{
  "course_name": "Musical Analysis",
  "course_description": "This class is an introduction to the analysis of tonal music. Students develop analytical techniques based upon concepts learned in 21M.301-21M.302. Students study rhythm and form, harmony, line and motivic relationships at local and large scale levels of musical structure. Three papers (totaling 20 pages, one to be revised) and one oral presentation are required.",
  "topics": [
    "Fine Arts",
    "Music",
    "Music Theory",
    "Fine Arts",
    "Music",
    "Music Theory"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nObjectives\n\nSome aspects of our experience of music are beyond words. The grace or invention of a particular passage leaves us simply awestruck. Some aspects, however, are due to a richness of relationship in the piece that, to a degree, can be described. These are aspects of its structure or process that we attend to when we analyze music. The more deeply we can understand music, the more sophisticated our analytical hearing, the richer our experience as performers, composers and listeners.\n\nThis class provides an introduction to the analysis of tonal music. It builds upon techniques and concepts learned in Harmony and Counterpoint I and II; hence, 21M.302 is a prerequisite. We shall study rhythm and form, harmony, line and motivic relationships at local and large-scale levels of musical structure.\n\nRequirements\n\nThree papers are required: two 5-page papers, each of which you will probably be asked to revise based upon my comments and suggestions, and one 10-page paper, due at the last class. You will also give one twenty-minute oral presentation on the same topic as your final paper, an opportunity to organize your thoughts and receive feedback on your ideas before committing them to paper. (Note that 21M.350 is a CI-M class; it satisfies the communication requirement for music majors.)\n\nGrading\n\nYour final grade for this subject will be determined by the following distribution:\n\nACTIVITIES\n\nPERCENTAGES\n\nPaper 1\n\n20%\n\nPaper 2\n\n20%\n\nPaper 3\n\n40%\n\nOral presentation\n\n10%\n\nClass participation\n\n10%\n\nPlease note that deadlines are strict and attendance is required. Late papers and unexcused absences may compromise your grade.\n\nCalendar\n\nLEC #\n\nTOPICS\n\nCLASS PREPARATIONS\n\nKEY DATES\n\nI: Introduction\n\n1-4\n\nWhat is musical analysis? Writing about music\n\nLec 2\n\nRead Harris and Epstein, and familiarize yourself with Purcell's 'Dido's Lament' and Haydn's\nSymphony No. 101 in D major\n, Movement III (Trio). Remember to bring copies of both the scores and the readings to class.\n\nLec 3-4\n\nRead Tovey's essay on Haydn's\nPiano Sonata No. 52 in E flat\nand familiarize yourself with the first movement of that work. Remember to routinely bring copies of the score and the reading to class.\n\nII: Rhythm and phrase\n\n5-8\n\nMeter, rhythm, grouping, phrase. Musical form: Period, section, 'binary' and 'rounded binary' form\n\nLec 5\n\nRead Cooper and Meyer. Prepare to discuss their theory of rhythm in class: What is rhythmic grouping? What is the relationship between rhythm and meter in this theory? What do the accent marks in their analyses actually refer to?\n\nContinue to study the first movement of Haydn's\nPiano Sonata No. 52 in E flat\nand prepare for further class discussion.\n\nLec 6\n\nRead Lerdahl and Jackendoff. How does their theory of grouping differ from Cooper and Meyer's? What is the essence of their critique of Cooper and Meyer?\n\nStudy Haydn's\nSymphony No. 101 in D major\n, third movement: Minuet. Do a Cooper and Meyer-style grouping analysis of mm. 1-28. You may find the piano reduction score easier to use that the full orchestral score. (However-don't forget to take into account instrumental factors in your grouping analysis!)\n\nLec 8\n\nRead Cone. Bring a copy to class and be prepared to discuss.\n\nPaper 1 due in Lec #7\n\nIII: Melody and line\n\n9-12\n\nMelodic prolongation; contrapuntal, decorative tones versus structural tones; 'reduction'\n\nLec 10\n\nRead Christ, et al.\n\nExamine Schumann's\nKinderszenen\n(Scenes from Childhood) No. 7, 'Traumerei' ('Dreaming'), mm 1-8. How would you analyze this material according to Cone's theory of initial, medial, and cadential accent? Where, in particular, is the initial accent: is it m. 1, corresponding to the tonic harmony, or m. 2, the climax? Does the motion into the climax in m. 2 (and again in m. 6) affect our sense of meter? Do Cooper and Meyer's methods illuminate this issue?\n\nIn these same measures, how would you analyze the 'basic melody' (according to the theory of Christ, et al.)\n\nLec 11\n\nRead Forte and Gilbert. Study Bellini, '\nCasta Diva\n', mm. 16-30. What kinds of melodic elaboration are at play here? Identify the harmony: what kinds of non-harmonic tones are in use? What is the 'basic melody'?\n\nLec 12\n\nStudy Chopin.\nPrelude Op. 28 No. 6 in B minor\n. Where are the phrases/cadences? Identify the harmony. Begin thinking about the melodic structure.\n\nPaper 1 revision due in Lec #11\n\nPaper 3 topic approval due in Lec #12\n\nIV: Harmony and voice leading\n\n13-14\n\nHarmonic prolongation 1 (local)\n\nLec 14\n\n1. Do a Roman numeral analysis of Bach's chorale, \"\nJesu meine Freude\n.\"\n\n2. Read Schenker. What is a 'scale step' according to this account? How does it compare to the traditional view of harmony?\n\n15-16\n\nHarmonic prolongation 2 (large scale, modulation)\n\nLec 15\n\nRead Salzer and review the associated musical examples.\n\nLec 16\n\nIn Bach's\nChorale Prelude in C Minor, \"Jesu meine Freude\n.\" Analyze the harmony in mm. 1-6. How does the structural framework (fundamental harmonic structure of each phrase) compare to the chorale harmonization? Reduce the bass voice (pedal part) to a more fundamental melodic structure: what does this reveal about the harmony?\n\nPaper 2 due in Lec #15\n\nV: Motive and theme\n\n17-18\n\nMelodic/rhythmic/harmonic characteristics; motivic transformation; 'Basic shape' (\nGrundgestalt\n)\n\nLec 17\n\nStudy Schumann's \"Wenn ich in deine Augen seh.\" What is the predominant feeling of the music and how is it related to the text? Where is the focal point of the song--is it the same as the climax? Analyze the harmonies in the song and the melodic structure of the vocal line.\n\n19-20\n\nOral presentations\n\nLec 19\n\nListen to the following works: Schubert, '\nDeath and the Maiden' Quartet\n, second movement; Beethoven, '\nFur Elise\n' and\nBagatelle in G minor\n, Op. 119, No. 1.\n\nPaper 2 revision due in Lec #19\n\nVI: Sonata form\n\n21-23\n\nSonata form\n\nVII: Program music\n\n24-25\n\nProgram music\n\nPaper 3 due in Lec #25",
  "files": [
    {
      "category": "Resource",
      "title": "amick_final.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-350-musical-analysis-spring-2008/a11eec258d3f4adf321a8c667590bfe6_amick_final.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n21M.350 Musical Analysis\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nTheme and variations in Schubert's String Quartet no. 14, # 2\nHow Schubert exploits theme and variation form to create a relationship between the movement and his\nlied \"Death and the Maiden\" that spans more than just the harmonic level.\nCharles Amick\n21M.350 Final Paper\n05/12/2008\n\nCharles Amick\n05/11/2008\nTheme and variations in Schubert's String Quartet no. 14, #2\nIn String Quartet no. 14, known colloquially as the \"Death and the Maiden\" quartet, Franz\nSchubert presents us with four movements of pure musical genius. The second movement, Andante con\nmolto, is a movement of particular brilliance. The piece, a theme and five variations with coda, draws its\ntheme directly from Schubert's 1817 lied Der Tod und das Madchen (Death and the Maiden). So\nbeautiful and powerful is the piece that it has become the defining movement of the string quartet - as can\nbe inferred from its colloquial naming. What is particularly interesting about the movement from an\nanalysis standpoint is the way in which it is tied so tightly to the piece upon which it is based. The\nmovement can be seen to reflect the lied on two distinct architectonic levels: the harmonic and melodic\nlevel, and the human interpretive level (by which I mean the way in which we interpret the mood and\ncreate expectations from the music.) Schubert achieves this strict adherence through the skillful use of\nmusical momentum and dashed expectations throughout the movement's variations in order to recreate\nthe tension that is present in the song but on a much grander scale.\nIn this paper I will analyze the theme of the quartet's second movement (referred to as \"the\nmovement\" for simplicity; I will compare it alongside \"the song\" often) and its five variations and coda in\norder to identify the processes that Schubert uses to generate the variations and how they reflect the\nemotive nature of the song from which they are drawn. We will see how momentum is created as the\npiece evolves, and discuss how this momentum is used to reflect the feeling of the source material but on\na grander scale. In order to make such observations, we must first understand the source material in its\nentirety. Insight into this matter will help us in our quest to identify the sources of emotion and musical\ntension and release in the theme.\nThe lied\nThe original Death and the Maiden is a lied - a German song cycle - composed by Schubert in\n1817 for solo voice and piano accompaniment. The song is a setting of a text of the same title by German\npoet Matthias Claudius. In the text, which can be read in figure 1 below, a young maiden desperately begs\nDeath to spare her soul, arguing that she is too young to die. Death replies calmly, telling the maiden that\nhe is a friend, that he does not come to punish her and that she will sleep softly in his arms. The poem\ncan clearly be split into two sections with distinct feelings - that of the fearful maiden and that of the\nreassuringly calm Death.\n\nCharles Amick\n05/11/2008\nTheme and variations in Schubert's String Quartet no. 14, #2\nOriginal German:\nEnglish translation:\nDas Madchen:\nThe Maiden:\nVoruber! Ach, voruber!\nPass by! Oh, pass by!\nGeh, wilder Knochenmann!\nGo away, fierce man of bone!\nIch bin noch jung, geh Lieber!\nI am still young, go my dear!\nUnd ruhre mich nicht an.\nAnd do not touch me.\nDer Tod:\nDeath:\nGib deine Hand, du schon und zart Gebild!\nGive me your hand, you beautiful and delicate form!\nBin Freund, und komme nicht, zu strafen.\nI am a friend, and am not come to punish.\nSei gutes Muts! ich bin nicht wild,\nBe of good cheer! I am not savage,\nSollst sanft in meinen Armen schlafen!\nYou will sleep softly in my arms!\nFigure 1: Original German and English translation of Der Tod und das Madchen by German poet\nMatthias Claudius .\nThe text does not lend itself readily to multiple interpretations, so its musical setting can be\nimagined relatively easily. Schubert chooses to split the song into three contrasting sections: a slow,\nfunereal introduction played solely by the piano; a fast, distressed section with the maiden singing her\nwords with piano accompaniment; and finally Death's return: a calm, slow section ending with a\nrecapitulation of the introduction but now in the parallel major key. We shall look at each section in\ngreater detail as doing so will give us a better understanding of how the movement derives from it. It is\nespecially important to inspect the introduction of the piece, as it is lifted verbatim for use in the\nmovement's theme and appears repeatedly throughout the movement.\nThe introduction to the song, shown below in figure 2, sets a morbid tone. Schubert uses dense\nchords played in the bass register to illicit a mood of sorrow. Harmonic reduction of the chords identifies\nthe structure to be a highly simplistic IVI harmony, with many chords easily explained as neighbor note\nor passing chords. A reductive analysis is shown in figure 2 for completeness.\nWikipedia contributors, \"Death and the Maiden (song)\", Wikipedia, The Free Encyclopedia,\nhttp://en.wikipedia.org/wiki/Death_and_the_Maiden_%28song%29 (accessed May 8, 2008)\n\nCharles Amick\n05/11/2008\nTheme and variations in Schubert's String Quartet no. 14, #2\nFigure 2: Harmonic analysis and subsequent reduction of opening theme from the lied Death and the\nMaiden.\nAs we can see from the above figure, the harmonic structure of the introduction is simply two\nmeasures of I, followed by a measure of V, followed by a return to I. This is then repeated in its entirety.\nThe steady bass line of scale degree I, then V, then I, lends a funereal feel to the introduction. The\nrelatively stagnant harmonic motion that is heard can be attributed to the long prolongations of the I and\nV chords through the use of neighbor and passing chords. Furthermore, there is relatively little shape\n(spatially) to the music, which is always a hint that there is not much at play.\nOne part that stands out clearly is the melodic line, which cuts through the dense mass of chords\nwith its distinctly sorrowful tone. The line can be extracted as shown below:\nFigure 3: Melody heard in opening theme from Death and the Maiden.\nThis line stands out above all for its relatively fluid motion (when compared with lines in other\nvoices), but reduction identifies that actually there is very little going on. We can treat the F on the third\nbeat of measure 2 as an upperneighbor of the E that is part of the V chord n the first beat of measure 3.\nth\nThe D in measure 3 is a passing tone down to the raised 7 scale degree, which itself is the leading tone\nback to scale degree 1 on the first beat of measure 4. This reduction shows us unequivocally that the\nintroduction to the piece is based around the tonic scale degree, and further helps us explain why we hear\nsuch little motion in the slow, solemn introduction to the piece.\n\nCharles Amick\n05/11/2008\nTheme and variations in Schubert's String Quartet no. 14, #2\nFigure 4: Reduction of melody from opening them from Death and the Maiden. Relative melodic\nimportance is conveyed by beat duration.\nBefore we carry on, let us briefly note another motive that stands out in starker contrast than the\nmelody does. This motive can be heard in the inner voices and is reproduced below:\nFigure 5: Melodic motive heard in inner voices during the introduction to Death and the Maiden.\nRemember this motive - the movement will place more importance upon this minute motive than the\nsong does.\nFollowing the solemn introduction, the song takes an abrupt turn as the maiden's voice enters\nwith an air of panic. The music speeds up from its initially slow pace not only through Schubert's written\ninstruction \"etwas geschwinder\" (quickly), but also through his introduction of eighth notes - a stark\ncontrast against the half and quarter notes of the preceding introduction. The harmonic structure of this\nsection is not of vast significance for our forthcoming analysis of the movement, as it does not bear much\nresemblance to any part of the movement's theme. But we can observe that the underlying harmony\nremains simple: I in mm.910, V in 11, I in 12, followed by a diminished seventh chord (importantly the\nfirst in the piece) resolving in m.14, and so on. There is no highly complex harmonic pattern here;\nSchubert keeps it simple and effective. Finally, as the Maiden's words run out, the music slows in\nmeasure 16 as half and quarter notes return to the accompaniment to the words \"go my dear! And do not\ntouch me.\"\nMeasure 22 begins Death's response to the maiden's pleas. As expected, Schubert again slows the\nharmonic rhythm in order to create a solemn effect. The vocal line, having been in upper registers with\nmuch motion when singing the words of the maiden, now resides firmly on a low D (scale degree 1),\n\nCharles Amick\n05/11/2008\nTheme and variations in Schubert's String Quartet no. 14, #2\nhighlighting Death's calm and reassuring demeanor as expressed in the poem - \"I am a friend, and come\nnot to punish\". As Death continues his words, the music mutates by m.37 to the parallel major of D. The\nintroduction is then recapitulated in the new key of D major. Schubert makes this shocking transform\nfrom D minor to D major in order to emphasize the words of Death (\"You will sleep softly in my arms\")\nand to show that Death is not a foe but a friend. This mutation into the parallel major is extraordinarily\nimportant as it will show up verbatim in the movement's theme and variations.\nOur overview of the song highlights a number of important points to bear in mind when studying\nthe quartet movement that bears the piece's name. Firstly, we will see that the theme of the quartet takes a\nform extremely similar to the form of the song. This is true not only from a structural standpoint between\nvariations, but also when considering the piece as a whole when looking at a more interpretive level.\n(How do parts tie together? How are they related? These questions will soon become answerable.)\nSecondly, we note the mutation from the tonic minor to the parallel major at the end of death's speech.\nThis will occur in the theme's music, as well as all subsequent variations (barring one, where Schubert\ndashes our expectations in the name of expression.) Finally, we note the extraordinarily simple harmonic\nlanguage used throughout the piece, yet the emotion that is invoked is strong. There are not highly\ndissonant chords (aside from a diminished seventh) which might have been used to force an emotional\nresponse, etc. This simple and clear harmonic language is a recurring point that we shall see throughout\nthe movement's theme and subsequent variations.\nLet us begin our analysis of the movement by presenting the necessary parallels between the\nstructure of the song and the structure of the movement's theme. The following paragraphs are\nsummarized visually in figure 6, below.\nThe theme can be split up into three structurally distinct parts: an A music, and a repeated BC\nmusic. The A music is nearly a direct transposition of the introductory music of the song, as shown in\nfigure 7. The B music, from mm. 916, is a noticeably agitated and emotional section, paralleling the\nmaiden's reaction to death in feel, but paralleling death's calm response to the maiden in harmonic\nlanguage. (This might be a trick played by Schubert purposely in order to smooth out the edges between\nsections of the original piece for use in the movement.) The C music, from mm. 1724, is a calmer\nsection, which contains the signature mutation to the parallel tonic major, Gmajor, by its completion in\nm.24. The C music is harmonically equivalent to the second half of death's reply in the original song,\nwhere he attempts to reassure the maiden that he means her no harm.\n\n2 9\nCharles Amick\n05/11/2008\nTheme and variations in Schubert's String Quartet no. 14, #2\nMm. 2 2\nMm.3037\nFigure 6: A diagram showing the mapping of the structure of the original lied to the theme of the\nmovement. The lied is shown on the left, and the movement is on the right.\nFigure 7: A diagram showing how the theme's A music is direct transposition of the introduction\nof the song. The theme is shown in the top image and the original source material is shown in the bottom\nimage.\nImportantly, note that it appears that the maiden's music has been entirely cut from the theme of\nthe movement. This might appear to void our argument about the extraordinary similarities between the\n\nCharles Amick\n05/11/2008\nTheme and variations in Schubert's String Quartet no. 14, #2\nform of the song and the form of the movement. In actuality, this strengthens our argument, as the\ninfluence of the song can be heard on the music of the movement even in its absence. Though\nharmonically the B music is based upon Death's music from mm.2229, different chord voicings and\nstresses add the nervous feel of the maiden's music that has otherwise been cut. The emotion of the absent\nmaiden's music is now wrapped up in the B music. This is a key point for our argument, as we will see\nthat the B music is increasingly important in propelling forward the momentum of the piece through its\nincreasingly tense variations.\nHaving identified and understood the relationship between the structure of the theme and the\nstructure of the original song, let us proceed to a harmonic analysis so that we may better understand the\nharmonic makeup of the theme and the variations that follow. We have already done a reductive harmonic\nanalysis on the A music, so let us continue with an analysis of the B and C music. Figures 8 and 9, below,\nshow analyses of the B and C music, respectively.\nOur background work has left us with a solid framework that we can build upon in order to better\nunderstand the structure of the piece. Now that we have a basic harmonic analysis of the theme under our\nbelts, we are equipped to understand the variations and how they relate back to the original lied upon\nwhich the movement is based. In the following pages we will investigate each of the variations in turn.\nVariation 1\nThe first of the five variations, beginning in m.25, is significantly lighter and more \"airy\" than the\ntheme. This effect is created by the newfound space created by the reductive techniques Schubert applies\nto the theme in order to create the variation. Figure 10, overleaf, shows a musical excerpt of the A music\nof the second variation. As we can see, the cello line has been significantly reduced when compared to\nthat of the theme. Nearly all notes have been reduced to eighth notes; other than that the rhythm and\npitches of the notes are unaltered (until the pickup upon the repeat in m.32).\n\nCharles Amick\n05/11/2008\nTheme and variations in Schubert's String Quartet no. 14, #2\nFigure 8: Harmonic analysis of the movement's B music in its theme.\nE flat maj: I\nV I6 V\nI\nV4/3 I V I\nG major: V6/5/V I6\nV4/3/V V6/5/V I6/4\nV7\nI\nE flat maj: I\nV\nV4/3 I\nG major: V6/5/V\nV4/3/V\nV7\nI\nFigure 9: Harmonic analysis of the movement's C music in its theme.\n\nCharles Amick\n05/11/2008\nTheme and variations in Schubert's String Quartet no. 14, #2\nFigure 10: Excerpt of the first variation a section\nFurther space is added in the variation due to violin 1's excursion into the upper registers, passing\nB natural - previously the highest note in the piece (m.24) - in its first measure (m.25). The notes played\nin the violin 1 line are essentially arpeggiations of the chords being played. Of further significance is the\nfact that violin 1 plays a syncopated rhythm, playing exactly where the cello does not (aside from in m.28\nwhen the two are playing simultaneously), further adding to the airy nature of the variation.\nViolin 2 and the viola expand their respective melodic ranges and their motion increases beyond\nthat displayed in the theme. Their triplet bowing breaks down each quarter note into triplets, adding a\nrefreshing swing to the variation. The bowing and expanded range help them fill the harmonic void left by\nviolin 1's upper register ornamentation.\nThe B music sees these new traits continue, aside from now the first violin plays more\narpeggiated lines, and is less ornamental in its playing. This creates a more tense, emotional and less airy\nsection when compared with the A and C music of this variation. Crescendos and decrescendos coupled\nwith dissonance placed prominently in the upper registers (for example, the Dflat in violin 1's music in\nmeasure 38) further add to the tension of this movement. The C music continues the stylistic variations of\nthe A and B music, but now the violin returns to playing a lighter, airy style as it had in the A music.\n\nCharles Amick\n05/11/2008\nTheme and variations in Schubert's String Quartet no. 14, #2\nWe can conclude that the first variation has already been used to build momentum in the\nmovement. The syncopated rhythm and reaches into the upper registers both contribute to a feeling of\nincreased activity and, as we have mentioned, an even more strained tone. We can't draw any conclusions\nabout the rest of the piece yet - we must first look at the remaining variations to extract any patterns that\nmight emerge.\nVariation 2\nThe second variation in the piece starts with a significant structural change, as the melodic voice\ndrops down into the cello line and the viola takes over the job of providing a steady bass voice. The effect\nof this is to create an even more emotional sound throughout the variation - cello playing in upper\nregisters is notoriously used to illicit emotional response due to its weak, airy tone.\nThe A music sees Schubert again apply reductive techniques to the first violin's part. Whereas in\nthe first variation violin 1 played eighth notes with eighth note rests preceding many of the motives, the\nviolin now finds itself playing sixteenth note motives, with sixteenth note rests. Reduction shows these\nnotes to be different from notes played in previous variations or the theme itself, but essentially we see\nthe first violin as embellishing the harmonic structure created by violin 2, the viola and the cello.\nCareful inspection of the cello line throughout this variation shows it to be a pseudo\nreduction/composite of melodic threads that have appeared earlier in the movement. In fact, this line is the\nimportant, for it is the first time that a clearly identifiable melody is played in any single instrument,\nwithout the voice jumping between different parts. Figure 11, below, shows how the line is composed of a\ncomposite of earlier lines.\nFigure 11: Example of how the cello line is composed of threads of previous lines in the A sections of\nvariation 2 compared with the theme. Note that the B section is much more clearly a composite.\n\nCharles Amick\n05/11/2008\nTheme and variations in Schubert's String Quartet no. 14, #2\nWith the cello busy playing the melody, the viola is resigned to playing the bass line, which it\ndoes with little harmonic modification of the original line, but significant rhythmic modification. This\nnew rhythmic motive consists of an eighth note, an eighth note rest, and two eight notes, as shown below\nin figure 12. The high voice that the bass line is now in contributes to the light, ungrounded feeling of this\nvariation.\nFigure 12: Viola bass voice. The introduction of more notes due to reduction creates more momentum.\nWith violin 1 playing ornamental motives in the upper register, the cello playing a melody, and\nthe viola resigned to play an adapted bass line, violin 2 finds itself having to fill in a significant number of\nnotes in order to maintain the harmonic language of the variation. It does so by playing a line consisting\nof an interpolation of violin 1 and the viola's parts from the initial theme. This is not a hard rule - there\nare variations - but the basic idea is true.\nFigure 13: Diagram illustrating the sources of the second violin line from the four lines in the\nmovement's theme A music.\n\nCharles Amick\n05/11/2008\nTheme and variations in Schubert's String Quartet no. 14, #2\nThe B music of variation 2 continues with the instruments playing similarly to how they did in\nthe A music. The violin begins playing a more arpeggiated line, albeit through the use of similar motives\nto those that it played in the A music and one or two pure arpeggios (m. 64 springs to mind.) The cello\nalso plays a juxtaposition of melodies exhibited in the original theme, as it had in the A music. This\nstructure is outlined below in figure 14. Like variation 1, Schubert uses dynamic markings (crescendo,\ndecrescendo) to make the music ebb and flow, thus creating emotive feelings in the B music.\nFigure 14: Cello line in B music, highlighting the source of the material from the theme's B music.\nFinally, as was the case in the C music, the violin returns to playing in a fashion similar to how it\ndid in the A music. Again, the cello continues its job of debuting the melody, playing another\njuxtaposition of melodic threads heard from the theme's C music. Having presented two previous figures\ndetailing this technique, the figuration is left to the reader.\nVariation 2, due to its reductive nature, clearly increases the momentum of the piece. (Adding\nnotes will tend to do that.) The harmonic language has remained the same, but the pure increase in note\n\nCharles Amick\n05/11/2008\nTheme and variations in Schubert's String Quartet no. 14, #2\ncount and the introduction of a unified melodic line have both added to the increased tension and\nmomentum in the piece.\nVariation 3\nAfter the light, relatively spacious and airy structures of variations 1 and 2, Schubert shocks the\nlistener with variation 3's juxtaposition of thick, muddy textures and returns to airy, open passages.\nBefore we look specifically at the music, let us make a key observation: the music represents the\nculmination of the momentum that has been building up in the previous two variations. Through his\nreductive techniques in the previous two variations and the techniques he applies in the third, Schubert is\nconstantly increasing the momentum of the piece and the emphasizing its sorrowful tone. By doing so,\nSchubert is emphasizing the part of the lied that was not harmonically included - the tense, nervous music\nof the maiden. We already argued that the B music in the theme wrapped up the sorrowful, nervous nature\nof the missing music, but now we can see that indeed the entire piece is representative of it as well.\nLooking at the music in this third, powerful variation should reinforce this view.\nThe A music has all four instruments playing a densely harmonized motive in fortissimo that\nsounds like a train chugging past the listener. Figure 15, below, shows this dense texture. This texture\ngives way after 4 measures to a lighter one with violin 1 and cello playing light, dreamy lines while violin\n2 and the viola continue to play in the rhythmic motive introduced earlier in the A music.\n\nCharles Amick\n05/11/2008\nTheme and variations in Schubert's String Quartet no. 14, #2\nFigure 15: Music from the first 4 measures of variation 3's A music.\nThe B music contains many rests, but a strong, emotional set of motives. The cello and violin\nboth play motives of the form shown below in figure 16 with great gusto, the triplestops creating\nmoments of great stress release as they outline the harmonies of each measure. Further release is added to\nthese moments by the preparation each receives from the quarter note that occurs before it on a weak\nbeat, preparing it for resolution on a strong beat. Finally, we hear that violin 1 is \"echoing\" the cello, and\nwe hear violin 2's upwards melodic progression as being the thread that ties the two together, thus\ncreating an effect that has the harmony of the measure move upwards through the voices. As always, the\nB music plays at a higher\nFigure 16: Motivic form of cello and violin 1 parts in the B music of variation 3.\nAs the violins and cello work to create massive moments of tension and release, violin 2 contains\na line that is a patchwork of the theme's original parts, serving doubleduty as both melodic line and\nharmonic maintainer. The viola serves to harmonize this line.\nThe C music, as always, begins by mimicking the style of the A music. However, this time the\nmusic is played pianissimo, and only violin 2 and viola 1 have the nearly constant rhythmic motive at\nfirst. The cello plays a bass line similar to that in the theme, but severely reduced in mm.8992 to be\nth\nth\nmerely 8 and 16 notes. By m. 93, all parts begin to build up to recommence playing the harmonic\n\"trainlike\" motive heard in the A music to the harmonic structure of the theme's C music. A crescendo\n\nCharles Amick\n05/11/2008\nTheme and variations in Schubert's String Quartet no. 14, #2\nhelps build tension until fortissimo is reached in m.95, after which another crescendo is signaled prior to\nthe end of the music in m. 96.\nLet us note at this point a unique property of this section: thus far, all C music we have seen\nfollowed the same harmonic pattern as the theme. However, variation 3's C music does not resolve to G\nmajor in its final measure; rather, it is left playing an extraordinarily loud, registerally wide Gminor\nchord. This chord does not resolve to G major, though it could be heard to do so in m.97 as the upcoming\nmodulation to Gmajor for variation 4 is prepared by having all instruments resolve in union to a single G\nnote. (The cello plays it one octave lower.) This is an excellent proof of the buildup of momentum - we\nare now so deeply engulfed in sorrowful, fast music, that the established pattern of resolution to G major\nhas been totally consumed.\nFigure 17: Final two measures of C music of variation 3, showing the lack of resolution to Gmajor.\nVariation 4\nVariation 4 is far and away the most different variation in the entire piece. Schubert stuns the\nlistener after the extremely dense, patternbreaking music of variation 3 by introducing an extraordinarily\nlight variation in the parallel major. It is the only variation to be in a different key from the theme.\n\nCharles Amick\n05/11/2008\nTheme and variations in Schubert's String Quartet no. 14, #2\nSchubert dashes the listener's expectations which, for good reason, might have expected an even brisker\nmovement, given the historical increase in momentum between sections. We can rest assured that this\nshort foray into a seemingly foreign key with foreign harmonic language is merely a prolongation of the\ninevitable Gmajor resolution of the preceding section, allowing us to continue our argument of the\nstructural influence of the lied upon the movement.\nFor all its differences, reduction of the A music of variation 4 exposes some points of interest.\nFirstly, as figure 18 shows, we still have the identifying motive of the entire piece sounded between the\ncello and the viola. The neighbor note motion is easily identifiable, even if it is in a major key.\nFigure 18: Neighbor note motion in cello and viola parts in A music of variation 4.\nFurthermore, harmonic reduction of the A music, apparently so different from the A music of the\ntheme, reveals that the harmonic language at a higher architectonic level remains as a solid IIVI as\nshown in the analysis in figure 19.\nFigure 19: Harmonic analysis/reduction of A music of variation 4.\nThe B music is far more similar to that of the theme. A modulation to Eminor in m.105 (vi in E\nminor is a pivot from IV in Gmajor) lands us solidly on a vi chord that we expect to lead off the B music.\nThe viola again finds itself playing the bass line, essentially unaltered aside from slight rhythmic\n\nCharles Amick\n05/11/2008\nTheme and variations in Schubert's String Quartet no. 14, #2\nalteration in m. 107 and the fact that it has been transposed to Eminor. Violin 2 and the cello share the\nduty of filling out inner voices, and violin 1 ornaments with the arpeggiations that have become so\ncommon in the B music.\nFinally, the C music enters with a modulation to C major in m.113 and brings with it the first real\nchange in harmonic language in the piece. The section certainly starts in C: we note the use of Fnatural\nexplicitly in the place of Fsharp, as well as the score's Cnatural markings to remind the player not to\nplay Csharp following the modulation. In this tonality we can identify m.114 as a ii chord - assuming the\nG in the cello to be a drone that lasts from m.114 to m.118 - followed by a predominantly dominant\nseventh chord in m.115 moving to V/V in G major by m. 117 through modulation in m.116, resolving to\nV and finally I by m.120. This harmonic analysis can be seen in figure x below. Note the differences in\nharmonic language from the C music of the theme until four measures before the C music's closing\nmeasure, where it returns to the common V/VVI that we've seen in all previous variations. Measure\n120, after the repeat of the BC music, provides the context for modulation back to Gminor by presenting\nnothing more than the note G in all four voices.\nWe can argue that Schubert used variation 4 to prolong the piece. After all, could we really\nexpect more momentum to be introduced after the thickly textured third variation? By giving the listener\nbreathing room in the fourth variation, Schubert makes the return to Gminor in variation five ever more\npotent and exciting as he prepares to close the piece.\nVariation 5\nThe fifth and final variation juxtaposes some of the common techniques that Schubert has thus far\nemployed when creating the preceding variations. The A music has the second violin and viola restating\ntheir parts from the theme, with a voice exchange occurring between them. The cello plays a repeating\nostinato jumping from G two octaves below middle C to G an octave below middle C and back again.\nThe cello never moves from this motive, thus it can be reduced as a G drone and excluded from our\nharmonic analysis, revealing that the harmonic language indeed remains the same as it had in the theme\nfor this portion of the piece. Figure 20 shows an excerpt of the music from this section, highlighting the\ncello ostinato. Finally, the first violin plays a reduced version of its line - a very long G - two octaves\nabove middle C. After two bars this gives way to a repeated motive focusing heavily on G and D (further\nreasserting the tonicity of G when coupled with the bass drone) that hints at what is to come in the B\nsection. Figure 21 shows the motive that can be heard in the violin part.\n\nCharles Amick\n05/11/2008\nTheme and variations in Schubert's String Quartet no. 14, #2\nFigure 20: Ostinato in cello line in A music of variation 5.\nFigure 21: Violin 1 line in beginning of A music in variation 5.\nIn stark contrast to the A music, the B music opens with all three upper strings playing in a dense\ntexture featuring the motive introduced by violin 1 in the A music. The three parts serve to harmonize the\nline of the cello, which plays a line extremely similar to that of the original theme's B music, but\nembellished by reductive processes with passing tones between each subsequent note in the line. Of\nparticular note is the line in the cello in m.130, shown in figure 22, for the lowest note in the piece (also\nheard in the B music of variation 3) is approached by a stepwise staccato motion. The resulting effect,\nwhen coupled with the fact that the note is not only low, but is the longest duration of the lowest note in\nthe piece, is to place great emotional intensity on this root of the minor IV chord which it creates. I\nbelieve that the listener will hear the momentum of the piece, suspended in variation 4, to return with\ngreat force at this extraordinary point, thus I believe it to be the moment that the momentum has been\nbuilding to.\nFigure 22: Cello line in m. 130. We hear the lowest note in the piece at this point.\nThe B music flows into the C music and we are greeted with a curious variation the likes of\nwhich we previously have not encountered. The cello enters a pattern of playing a low note, then jumping\noff in eccentric fashion to play a rhythmically complex motive in the upper registers (a change of clef is\nrequired in the music) and then jump down abruptly to begin over again. The viola takes the duty of\nplaying a consistent line, presenting an ostinato jumping from Bflat to that an octave above and back\n\nCharles Amick\n05/11/2008\nTheme and variations in Schubert's String Quartet no. 14, #2\nagain - a parallel to the cello's Amusic G ostinato. (Note how often we have seen correspondence\nbetween the A and C sections throughout this piece.)\nDuring the relatively eccentric parts of the C music (mm.137141), we can observe that the\nharmonic language is not entirely clear. For instance, on the downbeat of m. 138 we have a G, Bflat, C\nand G (moving to Aflat) sounding together. However, if we accept the Bflat ostinato in the viola to be a\ndrone, we can see that the second half of the first beat of measure 1 actually resolves to F, Aflat, C,\noutlining an Fminor chord. The previous note can be heard as a suspension of the motion from the\nprevious measure.\nFinally, the C music returns to relative normalcy in m.141 with the cello's return to playing the\nbass line of the original C music. The harmonic progression from the theme's closing C music is heard,\nand a resolution to Gmajor is observed in m. 144. At this point, we see that the BC music of variation 5\nactually does not repeat. This is the only variation to do so, and presumably the cause for this is to allow\nroom for the extended coda that follows.\nThe coda of the piece, beginning in m.144, draws its material from the B and C music of the\noriginal theme. Indeed, the reductive relationship between the music of the coda and the theme is\ntransparent in the second violin, viola and cello lines. The violin plays triplets around tones similar to\nthose that it played in the theme but, as always, its line shows the most variation of any of the lines. The\nviolin is used to great ornamental effect to open up the upper registers above the solemn, slow parts below\nit.\nAside from the viola, which plays a repeated rhythmic motive centered on B and then A, all three\nstrings restate their parts from the C music of the theme beginning in measure 153. There are a few\nexamples of reduction - in m.154, for example, the half note on the first beat consumes the following\nquarter note in order to become a dottedhalf note - but these are, again, entirely transparent and are left\nto the reader to investigate.\nIn the final measures of the piece, Schubert again draws directly from the lied. Measure 160 has\nthe music resolve to Gmajor - as has occurred throughout the piece at the end of C music - and\nimmediately flow into a restatement of the A music, played up an octave and in the new tonic center of G\nmajor. This is exactly how Schubert ends the song - with a restatement of the introduction in the parallel\nmajor - and brings closure to the entire movement, whilst reasserting the relationship between the\nmovement and the song unequivocally.\n\nCharles Amick\n05/11/2008\nTheme and variations in Schubert's String Quartet no. 14, #2\nConclusion\nOur detailed investigation of Schubert's String Quartet no. 14, Andante con molto has shown us\nthe great extent to which the piece is based upon Schubert's 1817 lied Death and the Maiden. We have\nshown this relationship at a cosmetic level - the harmonic language is virtually lifted directly from the\nlied - but also at a higher, interpretive level. We have shown how Schubert uses increasing momentum\nbetween variations (and dashed expectations in the fourth variation) to embellish the morbid, sorrowful\ntone set out in the original lied. We have also seen how momentum in the B music is used to create a\nstructural presence for music that is harmonically absent when compared to the original lied (the maiden's\npart.) This is really quite a profound technique - Schubert has mutated a harmonic passage into purely\nexpressive embellishments. The B music is thus one of the most important and interesting parts to look\nat, and we have consistently treated it as such.\nWhen all is said and done, the second movement of Schubert's String Quartet no. 14 may appear\nnothing more than a beautiful piece to many a listener. But to those interested in understanding why this\nis the case, we have shown that the piece is so much more than a simple set of theme and variations - it\nachieves the extraordinary task of breathing new life to the maiden, harmonically absent, through the\nmusic of Death. The piece thus gives an entirely new meaning to the concept of Death, and his dear\nvictim, the maiden."
    },
    {
      "category": "Resource",
      "title": "ovsey_final.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-350-musical-analysis-spring-2008/60665fd4b48ae82c2ac711d2b46244da_ovsey_final.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n21M.350 Musical Analysis\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nSimone Ovsey\n21M.350\nMay 15, 2008\n\nJupiter: The Musical Journey of Outward Conflict and Inner Resolution\n\nGustav Holst's glorious orchestral suite, The Planets, is one of the most\ncelebrated and performed English works of the Twentieth Century. Its lavish\norchestration and unforgettable motives have propelled the work into the forefront of\nstandard orchestral repertoire. Written between the years of 1914 and 1916, The Planets\nembodies the \"English\" style that Holst and contemporaries such as Vaughn-Williams\ntried to foster through their compositions. Each of its seven movements is named after a\nplanet, excluding Earth and Pluto, and corresponds to a Roman deity. The fact that Earth\nis not a part of the musical picture implies that Holst intended The Planets to have an\nastrological basis, not an astronomical one. The movements convey stimulating ideas\nand emotions associated with the human psyche and, as they unfold, seem to depict the\nprogression of life.\n\nOne of the most compelling movements of the entire suite is Jupiter, The Bringer\nof Jolity. While the entire suite merits an in-depth examination, the excitement, grace,\nand nuance of this fourth movement in particular warrant a closer analysis. Listening to\nJupiter multiple times leads to further discoveries about the piece, and, most importantly,\nleads to further questions regarding its musical characteristics. On the surface of the\n\npiece, there is a strong sense of conflict between various musical aspects. However, the\noverall mood of the piece is uplifting, celebratory, and triumphant. Analysis of the form,\nthematic and motivic structure, the central and well-known hymn section, and the overall\ntonality of the piece serves to reconcile the outward conflicts within Jupiter and provide\npossible answers to musical questions.\n\nAn integral aspect of Jupiter is the variety of distinct themes that appear\nthroughout the piece. These themes create a whirlwind of emotions through contrasting\ntimbres, orchestration, and overall mood. Holst introduces each of the six major themes\nin direct succession during the first half of the piece. What is most striking about the way\nin which Holst presents each theme is the lack of musical transition between them. Each\ntheme ends precisely as the next one begins, and there is little or no overlap connecting\none theme to another. Following the sixth or central theme, each theme is presented\nagain at least once in a similar manner to the first presentation, giving the piece as a\nwhole a loose ABA form. Although the themes seems to flow more fluidly together the\nsecond time through, a complete sense of continuity is still absent. However, analyzing\nthese themes reveals that they share integral musical material despite their lack of\nconnectivity on the surface.\n\nThe sixth and perhaps most well known portion of the piece is the hymn theme in\nthe middle of Jupiter. This section of the music is the most separated from the rest in\nterms of its texture, timbre, and mood. It does not have any musical introduction and\nsimply begins out of the blue. The lavish string orchestration and noble and sacred tone\nof this section set it apart from the other themes as a special point in the piece. Upon a\ncursory listen and overview of the music of the central theme,\n\nit bears no resemblance to the rest of the piece. However, a closer look at its underlying\nmotivic structure reveals a strong connection between the central melody and the\nsurrounding themes and, ultimately, a powerful relationship among all of the themes in\ngeneral.\n\nThe opening three notes of the hymn section drive the deeply lyrical theme\nthroughout this portion of Jupiter. The motivic grouping of a minor third between the\nfirst two notes followed by a resolution to an interval of a perfect fourth between the first\nand third notes is the cornerstone of this central section. In the case of the beginning of\nthe hymn theme, this central motive is evident in the melodic motion from the concert G\nto the B-flat followed by a C on the downbeat of the first full measure of the theme (See\nthe bracketed notes in Figure 1.). The rhythmic relationship of two \"fast\" notes followed\nby one of longer value (the C in this case) is also an important motivic feature of this\ntheme. In order to make a connection between this central hymn and the remaining\nthemes of Jupiter, we must analyze the other five themes with respect to the\naforementioned motivic foundation.\n\nFigure 1. The sixth/hymn/central theme of Jupiter (mm. 209-217)\n\nThe opening theme of Jupiter jumpstarts the piece with syncopated rhythms and\nflashy sixteenth notes (See Figure 2.). The french horns, violas, and cellos have the\nmelodic line first followed by the low brass, low woodwinds, and string bass during the\nrepetition of the theme. This opening line is filled with vigor and propulsion, yet it\nharbors a mysterious quality of covert excitement. The low register of the instruments\nthat play the theme in addition to the trumpet crescendo beginning in measure 12 create\nan excitingly tense atmosphere, and it seems as through something most exhilarating is\nbound to happen throughout the entire opening section. While this theme does not\nexplicitly feature the consecutive minor third and perfect fourth intervals, it does\nhighlight the relationship between the concert G and B and the interval of a major third.\nThis relationship can be seen explicitly in the first measure of the theme as well as in the\nsecond, fourth, and sixth measures (See the grouped notes in Figure 2.).\n\nFigure 2. Opening Theme (mm. 6-12)\n\nAs we move to the second theme of Jupiter we get closer to the central motive.\nThis theme can be regarded as a fanfare because the opening four measures of the\nmelodic line feature a glorious call on the French horn. The music of the remaining four\nmeasures of the theme is syncopated and grounds the exuberance of the previous\nmaterial. While this Fanfare Theme similarly does not feature the sequential movement\n\nfrom an interval of a minor third to that of a perfect fourth, it prominently features the\ninterval of a fourth. In the first and second measures, the distance between each pair of\nsuccessive notes within each measure is that of a perfect fourth (G to C and C to F in the\nfirst measure). The third measure also features the movement from G to C to F and\nmoves from G to D on the downbeat of the fourth measure. The syncopated section also\ncontains perfect-fourth intervals including the D to the G (a twelfth) and the F to the C in\nfifth measure and the D to the A in the fifth and sixth measures. (See Figure 3 for an\nillustration of these groupings.) In addition to the notes, the eighth-note and quarter note\nrhythm of the first two measures mimics the rhythmic motive of the central theme.\n\nFigure 3. Fanfare Theme (mm.29-36)\n\nThe third theme, labeled \"pesante\" in the score, is the shortest theme within\nJupiter, but it contains motivic material that is the closest, thus far, to that of the central\ntheme. The violins have the melody which is full of intervals spanning the range of a\nthird and fourth. The opening motive is almost identical to the minor third to perfect\nfourth motive and features an eighth-note C-sharp to an eighth-note E-sharp followed by\na quarter note F-sharp (See Figure 4). Aside from the fact that the interval between the\nC-sharp and the E-sharp is a major third, the two motives from the different themes are\nidentical. The second measure of the four-measure Pesante Theme is a repeat of the first,\n\nbut the third to the fourth measures contain the exact intervals of the central motive (a\nminor third between F-sharp and A and a perfect fourth between F-sharp and B). As we\nmove through the themes towards the central theme and continue to analyze each of the\nthemes in relation to the central motive, it is evident that the themes share progressively\nmore material with the central hymn.\n\nFigure 4. Pesante Theme (mm. 45-48)\n\nIn the fifth \"molto pesante\" theme, we finally have a motivic basis that mirrors\nthat of the central theme. The violins, once again, have the melody along with the violas\nand cellos. Although in a different time and key signature than the central melody, the\nbeginning of the Molto Pesante theme mimics the familiar central motive in terms of its\nrhythmic and motivic structure. The movement from the B to the D to the E marks the\nbeginning of each new phrase of this theme and closely links it to the principle motive\n(See Figure 5.)\n\nFigure 5. Molto Pesante Theme (mm. 65-71)\n\nThe fifth and final theme of Jupiter before the central theme can be regarded as a\n\"folk\" theme on account of its dance-like quality and triple meter. The horns, followed\nby the trumpets and tuba, have the melody of this theme. While the rhythmic structure\nand motivic structure of the Folk Theme are not identical to the central motive, the basic\nintervals of a minor third and a perfect fourth are still present. The first, third, and fifth\nmeasures of this dance-like theme contain a descending interval of a fourth followed by\nan ascending interval of a major second between the second and third notes (See Figure\n6.). Thus, this theme does contain both of the cornerstone intervals of the main motive,\nthe perfect fourth and minor third.\n\nFigure 6. Folk Theme (mm. 65-71)\n\nGoing back even further in The Planets to the second movement Venus, Bringer\nof Peace reveals the earliest foreshadowing of the central theme. In the opening section\nof this tranquil movement, a solo violin has a lyrical melodic line. The end of this\nmelody features the all-important skip of a minor third up to a perfect fourth. As\ndepicted in Figure 7, the violin has a dotted eighth note D to sixteenth note F on the\nupbeat of the fourth measure to a G on the downbeat of the fifth. The melodic line stops\nhere, as the G is held for the entire measure. The central theme can be regarded as a\n\ndevelopment of the conclusion of this solo violin melody because the ending of the violin\nmelody contains the distinctive interval of a minor third and the range of a fourth that\ncharacterizes the upbeat and downbeat of the of the phrases in the central theme.\n\nFigure 7. Solo violins melody in Venus (mm. 32-36)\n\nThe preceding analysis of the various themes in Jupiter and even the\nforeshadowing theme from Venus reveals that Holst took great care to subtly prepare the\nimportant central theme and did not just insert it adventitiously. All of the\naforementioned themes are related in one form or another to the central theme and are,\nmost importantly, connected to each other. This demonstrates the care with which Holst\nstrove to link each seemingly disjoint section of Jupiter. Even though a cursory overview\nof the movement can lead to the conclusion that each theme stands alone, separate from\nthe rest of the piece, an in-depth analysis exposes a common motivic thread running\nthroughout that serves to connect all of the sections of Jupiter on a deeper musical level.\n\nMoving to the question of tonality within Jupiter uncovers another seemingly\nconflicting aspect of the music. The music of the early Twentieth-Century English\ncomposers was unique in the sense that composers shied away from writing traditionally\ntonal music and embraced modal music in an effort to create a distinct English style of\nmusic composition. Tonal music is characterized by fundamental and indispensable\n\nelements of harmonic function premised upon the relationship between Tonic and\nDominant whereas modal music contains much less diatonic functionality and an unclear\ncenter of tone. In this sense, Jupiter can be considered modal music. Many of the\nsections of the piece are ambiguous in terms of key and are void of the typical harmonic\nprogressions found in traditionally tonal music.\n\nA closer examination of the first few phrases of the central hymn section exposes\na conflict between the melodic line and harmony, ultimately demonstrating Holst's use of\nmodality. We turn to the harmonic analysis in Figure 8 to illustrate the qualities that\nallow us to characterize this section as modal. The top line is the melodic line of the\nviolins and the bottom system is the harp part. While there are many other instruments\nplaying in this section, the chords of the harp contain every note that is heard in the other\nvoices. Therefore, the music that the harp plays is a good reduction of the harmony.\n\nFigure 8. Roman numeral analysis of the central theme\n\nAssigning roman numerals to the chords based upon the key signature of three\nflats reveals that the harmony is, for the most part, in the key of E-flat. The E-flat major\n\nchord (more specifically I6) is featured multiple times throughout these measures, and the\nsecond phrase ends with all of the instruments playing the note of E-flat. (This note is\nomitted from the analysis but directly follows the final chord in the last measure of\nFigure 8.) However, the most striking characteristic of this music is the lack of a leading\ntone. As a result, the chords seem to float by without a clear direction. There is no use of\na leading tone in the traditional sense and there are no dominant seventh to tonic\ncadences to fully tonicize the key of E-flat major. The progression from V to I6 appears\na few times throughout this portion of the music, but there is no traditional movement\nfrom V7 to I. In addition, the E-flats (not illustrated above) at the end of the second\nphrase, which suggests an E-flat chord, are not preceded by a dominant chord. Instead\nthey are preceded by a ii6/4 chord. This type of progression and lack of a clear dominant\nto tonic harmony strongly indicate that the music is modal.\n\nLooking closely at the violin melody and central theme, this line appears to be in\nthe key of C minor, the relative minor of E-flat major. The movement from the G to the\ndownbeat on the note C at the beginning of the theme suggests a dominant to tonic\nharmony. In addition, C is the central note of the theme. It returns the most often and is\nalmost always approached in a step-wise fashion. However, as the harmony lacks a\nleading tone, so does this violin melody. Instead of a B-natural leading to the C, we have\na B-flat. This allows the theme to lean more towards the natural minor mode rather than\nthe traditional harmonic minor that features the raised seventh-tone or leading tone of the\nscale.\n\nThe only way to reconcile the clash between the melody and harmony, the lack of\na leading tone, and the absence of a clear dominant to tonic harmony is to characterize\n\nthe section as modal. Since the music is no longer tonal, expectations of harmonic\nprogression and traditional movement from one chord to the next do not have to be met.\nIt is perfectly acceptable to lack a clear tonal center and be unable to characterize the\nmusic as a whole in a particular key. Modality allowed composers such as Holst to create\nunique moods and atmospheres without the restrictions of traditional harmony. Modality\nis evident throughout Jupiter, and the largely expressive nature of each individual\nthematic event is due, in part, to Holst's ability to employ and utilize the different modes\nin inventive and creative ways.\n\nThe superficial conflicts that arise within Jupiter are an essential part of the\nbeauty and mystery behind this piece. Whether Holst appears to have failed to link the\nthematic sections of the movement or has made the key ambiguous, there is always a\ndeeper explanation for and reconciliation of the musical contradictions that he creates.\nThis most striking feature of Jupiter accounts for the fact that underneath the conflicts on\nthe surface of the music lies such celebratory zeal and climactic passion that an\noverwhelming air of unrestrained glory rises above the piece as a whole. Holst's focus\nand attention to the interplay between the outward conflicts and their profound musical\nresolutions allows Jupiter to shine brilliantly as a magnificent piece of musical\nexpression."
    },
    {
      "category": "Resource",
      "title": "sheil_final.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-350-musical-analysis-spring-2008/ec118dfc3240b4ebedfb4987f61a2143_sheil_final.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n21M.350 Musical Analysis\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\n21M.350 Final Paper\nGeoffrey Sheil\nRhythmic Structures in Mozart's Linz Symphony\nThis paper will examine factors in tonal music which influence our perception of rhythmic form and\nphrase. As with any highly developed art, there will be a multitude of factors which define such a\nconcept as rhythmic phrase. In this paper I will look closely at the discernable qualities in the music\nwhich can help us form an intelligent conception of why the rhythm is (or perhaps is not) heard as\nambiguous or unusual.\nThe immediate structural details which deserve a large portion of attention are meter (and its relationship\nto the rhythmic patterns of the music) and the prevailing harmony. Latent elements such as relationship\nto form, and texture (e.g. contrapuntal or singular) will also be examined in detail.\nThe piece of music which will be used for the subsequent analysis is from Mozart's Symphony No. 36,\notherwise known as the Linz Symphony. It was written in 1783 as Mozart was travelling through the\nAustrian town of Linz toward Vienna. The local count announced, upon hearing of Mozart's arrival, that\nthere would be concert. Mozart allegedly had no scores with him and wrote the symphony in four days to\nhave it premiered on time.\nThe portion of Mozart's work which will form the basis of the rhythmic analysis is the Minuet and Trio.\nIn dealing with triple meter it would be advantageous to first briefly look at how rhythmic phrases\ntypically fall in such a framework. Triple patterns can be of three kinds - the amphibrach, dactyl and\nanapest.\nAmphibrach\nDactyl\nAnapest\n\n21M.350 Final Paper\nGeoffrey Sheil\nWe have here adapted a form of notation similar to that of Cooper and Meyer . '-' represents a metrically\naccented beat whereas '' represents a metrically unaccented beat. The bracketed groupings are an\nindication of rhythmic phrase. It is worth pointing out that inherent to triple meter is a very strong sense\nof an 'upbeat', and therefore, the amphibrach is a very natural way to hear triple meter.\n\n-\n\n\n-\n\nIn the above example, which is from Mozart's Minuet in G K1 (a somewhat simple, perhaps archetypal\nillustration), we can see how the amphibrach pattern can easily (and justifiably) be perceived once the\ninitial upbeat is heard. The dactyl requires that much of the structural stress coincides with the metrical\nstress, which results in more predictable and less flowing patterns. Note that this is a broad\ngeneralization, but still useful in terms of comparison and contrast of rhythmic feet. Finally, the anapest\nrequires that the majority of each measure be heard as on upbeat to the downbeat of the following\nmeasure. In some sense, the amphibrach can be considered as a compromise of the other extremes - and\ntherefore more easily heard as a natural and flowing pattern in triple meter. The reason for these\ncomparisons is to try to elucidate whether rhythmic ambiguity arises from use of less predictable feet in\nsituations where we are led to expect something which conforms more to a preceding or preconceived\npattern.\nBefore we look at examples from the music, I will briefly introduce the issue of contrapuntal versus\nsingular rhythmic analysis. In general, music is perceived in performance as a composite texture of many\nmusical parts. Does this mean that we can justifiably analyze the music in terms of singular lines? Or is\nit essential to study the lines individually to understand how the unique composite rhythmic pattern\narises? Or are these elements inseparable and only comprehensible in light of each others' qualities? I\nwill not be able to answer any of these questions definitively, but examination of the music with reference\nto these questions will certainly be useful in terms of understanding the inherent rhythmic structure of the\nmusic.\nBelow is the first extract from Mozart's Minuet and Trio, which is taken from the first few measures of\nthe movement.\nCooper and Meyer (1960). The Rhythmic Structure of Music\n\n21M.350 Final Paper\nGeoffrey Sheil\nAn analytic representation of\nthe score is presented below.\nCourtesy of IMSLP.\n\n21M.350 Final Paper\nGeoffrey Sheil\nIn reducing the orchestral score I have already made assumptions about the composite nature of the music\n- namely that the parts that I have reduced the excerpt to are the fundamental contrapuntal contours of the\nmusic. What is lost is the full sense of instrumental texture which is only ever fully realized by the entire\nscore. The reduced representation (\"example 1\") has been notated in various ways. The metrical accents,\nas described in the opening paragraphs, are marked throughout. The rhythmic phrasing or feet are shown\nby the indicated brackets. The arrows denote points of particular structural interest. Finally, the marcato\naccents indicate structural stresses which I will examine in each individual case.\nIn listening to Mozart's opening it may be difficult to determine a constant rhythmic trend throughout.\nThe upbeat at the very beginning strongly implies the amphibraic pattern (as in the Minuet in G K1).\nHowever, the structure is shifted almost immediately as we are denied an 'upbeat' in the second measure;\nrather, the music seems to group with what came before (dactyl). This pattern continues such that we\nbegin to feel a regular dactylic pattern, until our expectations are once again reversed when the half\ncadence in the fourth measure falls in beat two. The oddity of this cadential point arises from the\nrhythmic asymmetry of the phrase. A regular pattern has just been established but is suddenly negated at\na structurally significant point. Furthermore, the slurring of the notes into beat two (the cadential chord)\nsomewhat detracts from the metrical accent on beat one and empowers the arrival in beat two (a 'tonal'\naccent). Of course, this construction goes against the intuitive sense of cadential and metrical accents\naligning, but this is precisely how Mozart creates subtle and interesting ambiguity in the music. This\nnecessitates, in the analysis, a combination of dactylic, amphibraic (and in fact anapestic in measure\nfour/five) feet. Finally, it is interesting to note the presence of the rhythmic pattern that follows the\ncadence, namely the 'dotted eighth - sixteenth' followed by quarter notes pattern. This will be examined\nin detail later as it provides a very interesting kernel for discussion of metric ambiguity. The effect here,\nhowever, is to immediately establish momentum following the cadence - so much so, in fact, that the\nmeasure is structurally saturated with accents (metrical on beat one, structural (slur) on beat two and\nstructural on beat three due to the initiation of this new rhythmic pattern). This further lends to the\nrhythmic idiosyncrasy of the music.\nIn terms of contour, the patterns in measure one and two can be seen to descend and then ascend in\nmeasure three in approach to the cadence in measure four. The singular structures tend to align with these\ngeneral contours. What is more significant here is the placement of rests in the singular voices. The lead\nvoice (notated on the top stave) prominently features a pattern of a half note slurred into an eighth note\nfollowed by a rest (indicted by the arrow). The rests here explicitly deny us the chance of hearing\namphibrachs throughout. Furthermore, the initiation of the amphibraic idea on the first upbeat creates an\nunusual feel in the half note (which might be expected as two quarter notes), and although the other\nvoices fill in this space on beat two there is a registral significance to the long lead note which produces\nan implied accent on beat two. In some senses this could be thought of as an accent because of lack of\naccent. This construct makes the accent no less significant, as it is perfectly justified to feel abstract\naccents due to a composer's idiosyncratic phrase, and perhaps even more significant because this type of\naccent is undoubtedly more rare than conventional structural accents. These were notated in the example\nby bracketed marcatos. The other point notated in this way is beat one of measure four. This point is\nmarked because it is in fact a metrical accent, but this sense is strongly negated by the slurs to beat two,\nwhich effectively transfer some of the structural accent from the downbeat.\nThe following example is taken from measure 11 of the music.\n\n21M.350 Final Paper\nGeoffrey Sheil\nThe full score of this part can be found in the appendix - example 1 indicated the nature of the analytic\nreduction from the scored part so it is not necessary to show the full part in every subsequent instance.\nThis example is similar to the first in many respects. The main difference arises from the contour in the\nlead voice, which is now ascending. A pattern of large intervals into the third beat could be very\nsuggestive of amphibraic phrasing, although Mozart still insists upon the eighth note rests. Therefore it\nseems reasonable that again the phrasing is initially amphibraic and then immediately morphs into a\ndactylic pattern. The characteristic intervallic 'upbeats' are therefore a subtle reminder that the rhythmic\npatterns are not as clear cut as perhaps we may assume on initial scanning of the score. It is worth noting\nalso that the supporting voices suggest a constant dactylic pattern.\nThe following example concerns an extract from the music which contains the most rhythmically\nambiguous motif found in the minuet (bracketed below). The pattern is first introduced in measure 4.\nV\nI\nV7\n\n21M.350 Final Paper\nGeoffrey Sheil\nHere, as alluded to in example 1, we see the dotted eighth - sixteenth leading into a measure of quarter\nnotes. Also similar to example 1 is the arrival of the cadence on the second beat. In fact, the arrival on\nthe tonic is so emphatic that one's sense of metric security might be upset. However, the registral and\nstructural accent (the trill) on beat one still give us the sound sense of a downbeat. Thus, if one agrees\nwith this analysis, then the metrical structure is unambiguous but the harmonic structure is displaced. We\nmay want to know, then, what must be done in order to achieve a distinct undermining of meter, as\nopposed to a lesser structural displacement? The following example a more powerful sense of metrical\nambiguity is suggested.\nV7/ii\nii\nHere the same (bracketed) pattern appears. The cadence (in C: V7/ii - ii) is functionally identical and the\nresolution still falls on the second beat. What is structurally very significant now is that the downbeat of\nmeasure 20 features no registral accent (as seen at measure 6). The trill can be seen to provide something\nof a structural emphasis but in the context of the cadential progression and the lower register it is perhaps\nmore reasonably heard as an upbeat. Thus the pattern preceding the cadence truly feels as if the dotted\neighth - sixteenth pattern launches a measure of\ndirectly into a 'downbeat' on beat two of measure 20.\nThis can be represented as follows\netc...\nI should stress that this interpretation is not in any sense a definitive hearing of the music. In fact, I rather\nhear the music as in triple meter throughout, but with polyrhythmic undercurrents due to the phenomena\ndescribed above. This leads me to the suggestion that it is in fact possible to hear both triple (primarily)\nand other meters superimposed upon it simultaneously (analogous to a palimpsest in written manuscripts).\nFurthermore, I believe that music which allows for this kind of interpretation and hearing has in fact\nsucceeded in creating an inherently interesting musical structure. This aside, the functional effect of the\nlower register and the harmonic displacement on the metric structure can be seen clearly in this example.\n\nV - I\nV/IV - IV\n21M.350 Final Paper\nGeoffrey Sheil\nIt will also be useful also to examine a section containing this distinctive pattern in terms of rhythmic feet.\nAn analytic reduction of the music from measure 22 is shown below.\nThe initial dotted eighth - sixteenth is an upbeat, but also carries some structural emphasis due to its\nplacement (following directly from a cadence). It also carries motivic stress since it is a very specific\npattern which appears only in the context of the three following quarter note pattern. Therefore I have\nmarked it with a bracketed marcato. The quarter note pattern in measure 23 is inherently dactylic, so the\ndownbeat must pivot from an iamb to a dactyl to accommodate this change in feel. This pattern also\nseems to be dactylic due to the preceding sixteenth note 'launching' the quarter note pattern, and\ntransferring structural stress to the downbeat. However, the following cadence must be grouped as an\namphibrach because of the resolution on beat two - it seems essential that we group the tension and\nresolution together in this case (I have shown a bracketed marcato leading to a marcato to indicate the\ntransfer of structural accent to the cadential point). As a result, we have implied two separate metric\noverlaps in measure 23. This in itself could be a sound indication that Mozart is playing games with the\nrhythmic patterning and that there is justification for hearing the rhythm as interesting or ambiguous.\nIf we were to apply a parallel analysis to measures 19 - 20 (which feature the same rhythmic motif) we\nmay be forced to drastically alter our grouping to account for the implied change in meter. However,\nsuch a grouping analysis is limited in its notation as there is no way to represent an implied metric\nalteration. One could conceive of a layered structure based on superimposed structures which would\nnotate both the conventional metric analysis and an altered analysis (incorporating a change in meter)\nsimultaneously. Nevertheless, I think this would be ineffective, and it seems that more insight would be\ngained in analyzing the music as simply as possible according to the notated meter and then considering\nany implied metric feel through the existing framework provided by this Cooper & Meyer style analysis.\n\n21M.350 Final Paper\nGeoffrey Sheil\nIn any case, this analysis would come out identical to example 3. The difference between measures 20\nand 24 is, of course, the all important registral accent (or lack thereof cf. m.20), which was the main\njustification for the implied\nmeter at measure 19. In the grouping analysis, however, there is no other\nway we can describe the cadence differently to further stress the second beat. An amphibrach lends the\nmost emphasis to the second beat since the dactyl treats it as an intermediate element and the anapest\nsuggests it has much more of an 'upbeat' quality. The conclusion here is that rhythmic subtleties beyond\na certain level of complexity are lost in a Cooper & Meyer style analysis. What is reassuring here,\nhowever, is that the brackets marked \"?\" in example 3 are the very points where we felt a change in meter\nwas implied. This is also the point that the Cooper & Meyer style analysis picks out as being distinct, due\nto the dense overlap of metrical feet.\nWe should note that the composite pattern felt here is very similar to the singular pattern in the lead voice.\nThis is obvious in that the only other voices that have parts adopt a very supportive role in the music.\nThus, metric ambiguity is arising from harmonic and rhythmic elements, rather than contrapuntal voices.\nThere is more detailed interaction between the voices in example 1as the entry of the horns on beat two\ncan be felt as reinforcing the implied stress (on beat 2, as discussed above) in the lead voice. Here we can\nsay that the idiosyncratic rhythmic detail is very much intertwined with the contrapuntal structure of the\nmusic.\nFinally, given that we are studying a minuet and trio, we would expect each rounded binary to contain a\nreprise. The modulation from the dominant key of G to the home key of C is strongly suggested at the\ntonic C chord in measure 22. Following this is another V-I further outlining the tonic of C, until finally\nwe hear a satisfactory cadence on the downbeat of measure 28. (Note that this is one of the few cadences\nthat actually resolves on beat one.) Only after this do we see any form of reprise, indicating that the\noriginal modulation back to C does not coincide with the reprise, as expected. In the context of the\npattern introduced in measure 19, we see that not only does it introduce rhythmic ambiguity, but it is\naccompanied by a structural displacement in the traditional form of a minuet and trio.\nDotted eighth - sixteenth\npattern begins (beat 3)\nInitial cadence back\nto C major (beat 2)\n'Delayed' emphatic\nV-I cadence\nReprise...\nThe final musical example is taken from the reprise of the trio, at measure 48.\n\nd\n21M.350 Final Paper\nGeoffrey Sheil\nIn this example we are forced to address the issue of contrapuntal versus singular parts in terms of\nrhythmic analysis since the imitation of the lead line provides us with two distinct voices. The singular\nvoices would be simple to analyze if isolated\n\n_\n\n\n_\nHowever, the compound structure presents us with some problems. Example 4 shows how two\noverlapping feet may be used to describe the pattern. The amphibraic foot initiates the pattern on the first\nupbeat, and indeed, another amphibrach must be used at the start of the imitation. However, we still have\nto account for the ending of the first pattern on the first beat of measure 50, along with the supporting\nvoices in measure 50. The anapest seems adequate at the end of measure 50, and the preceding and\nfollowing anapests can be justified be considering them as a termination of the top stave lead voice\nphrase. The result of this analysis is a repeating, overlapping pattern of amphibrachs and anapests. It is\nquestionable how useful it is to maintain an entirely new layer of feet; after all, the pattern could be\ndescribed more simply be the amphibraic pattern alone, treating the imitation as nothing more than that.\nAlso noteworthy here is that we are in no danger of feeling metric ambiguity since our ear is well\naccustomed to hearing imitative patterns. The significance is therefore a sense that it may well be more\ninstructive to label rhythmic groupings in terms of the most fundamental structure possible (considering,\nfor example, the lead voice as carrying most of the structural weight) and build up a description of the\nmore involved and perhaps more subtle elements independently of this notation. Consequently, the more\ndetailed examples of overlap of metric feet (as in example 3) can be reserved for indication that\nsomething more fundamentally intricate is occurring in the rhythmic structure.\n\n21M.350 Final Paper\nGeoffrey Sheil\nIn summary, we have discovered that a Cooper and Meyer style analysis can be very limiting and\nsomewhat ambiguous if it is stretched beyond its intended applications. It was useful in distinguishing\nthe metric overlap in the pattern in example 3, however, we saw that application to cases such as alternate\nmeters or imitations can be confusing. In these cases it would be better to allow the rhythmic analysis to\nform a fundamental groundwork for further analysis which would be done without this notation.\nContrapuntal structures were shown to influence groupings (e.g. the structural weight of the secondary\nvoices in example 1), but, similar to what we found in the Cooper and Meyer analysis, it seems\nadvantageous to simplify the compound structure as far as possible. This is obvious in example 4 where\ntreatment of the lead voice as structurally superior to the imitation allowed us to group the music as\namphibrachs, with little notational confusion. Caution must be exercised, however, in any reduction of\nthe compound structure, to ensure elements that are in fact vital to the music are not lost.\nFinally, as I alluded to in my introduction, the amphibrach is a very natural way to hear triple meter. In\nalmost all the examples where rhythmic ambiguity is present, we see an amphibraic pattern shift to\nanother metric pattern due to structural accents. This is interesting because it suggests that the music is\ncapitalizing on the sense of what we want to hear naturally and working against it. Overall we can\nconclude that any instance of rhythmic subtlety in the music can arise from a range of combinations of\nrhythmic, motivic, harmonic, and contrapuntal elements (as well as any range of structural accents).\nSuitable analysis of such points requires due consideration of all of the above, as well as\nacknowledgement of form and more general qualities of the music.\nAppendix - Below is a copy of the full score for reference.\nCourtesy of IMSLP.\n\n21M.350 Final Paper\nGeoffrey Sheil\nCourtesy of IMSLP.\n\n21M.350 Final Paper\nGeoffrey Sheil\nCourtesy of IMSLP."
    }
  ]
}