{
  "course_name": "Music Since 1960",
  "course_description": "This course begins with the premise that the 1960s mark a great dividing point in the history of 20th century Western musical culture, and explores the ways in which various social and artistic concerns of composers, performers, and listeners have evolved since that decade. It focuses on works by classical composers from around the world. Topics include the impact of rock, as it developed during the 1960s - 70s; the concurrent emergence of post serial, neotonal, minimalist, and new age styles; the globalization of Western musical traditions; the impact of new technologies; and the significance of music video, video games, and other versions of multimedia. The course interweaves discussion of these topics with close study of seminal musical works, evenly distributed across the four decades since 1960; works by MIT composers are included.",
  "topics": [
    "Fine Arts",
    "Media Studies",
    "Music",
    "Music History",
    "Music Theory",
    "Fine Arts",
    "Media Studies",
    "Music",
    "Music History",
    "Music Theory"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nCourse Description\n\nWe'll explore the ways in which various social and artistic concerns of composers, performers, and listeners have evolved since the 1960s, with a focus on works by classical composers from around the world. Topics to be surveyed include: the legacy of serial composition, and the panoply of reactions against it; the cross-fertilization of classical and other styles, including jazz, rock, and music of other cultures; the emergence of post-serial, neo-tonal, minimalist, and post-minimalist styles; and the impact of new technologies throughout the period. Discussion of these topics will be grounded in close study of landmark musical works, evenly distributed across the four-and-a-half decades since 1960. Works by MIT composers will be included.\n\nTextbooks\n\nTwo books are required for this course:\n\nGriffiths, Paul.\nModern Music and After: Directions Since 1945\n. 2nd ed. New York, NY: Oxford University Press, 2007. ISBN: 9780198165118.\n\nDuckworth, William.\nTalking Music: Conversations with John Cage, Philip Glass, Laurie Anderson and 5 Generations of American Experimental Composers\n. Cambridge, MA: Da Capo Press, 1999. ISBN: 9780306808937.\n\nAdditional\nreadings\nare assigned from several other sources.\n\nClassroom Preparation and Participation\n\nPlease be sure to read the specified texts and listen to the specified works\nbefore\nthe class meeting for which they're assigned. There's no such thing as a stupid question, but there is a clear distinction between questions (or comments) that demonstrate proper preparation, and those that indicate the lack of same. Depending on the size of the class, you ought to plan on contributing three to five questions or comments in each class meeting. (Anything less will be conspicuous as a deficit of participation; anything more suggests that you might give your peers more opportunities to contribute.)\n\nListening Quizzes\n\nFour times during the semester, I'll administer a quiz in which I play excerpts from musical works and ask you to identify them as thoroughly as you can. For full credit, you'll need to identify the composer (first and last names), title (in the case of a single movement, naming both the movement itself and the larger work from which it's drawn), the year(s) of composition, and the techniques or trends that the music manifests (i.e., why did I assign this piece of music?).\n\nAnalytic Reviews of Live Performances\n\nYou're required to submit four reviews, each evaluating a live performance of a suitable musical work. Each review ought to be 1-3 pp. in length (ca. 500 words), and ought to distinguish between the strengths and weaknesses of the work and of the performance (e.g., a piece might be brilliantly composed, but sloppily performed...; or vice versa). Toward the latter end, you ought to learn as much as possible about each piece before attending the performance, especially if a recorded performance is available by which you can familiarize yourself with the work.\n\nTerm Paper and Presentation\n\nDuring the semester, you'll choose and pursue a topic of research grounded in the techniques and trends that we survey. You may investigate a particular work, or a composer, or a musical style, and your choice need not be drawn directly from the music covered during the lectures. You may choose to consider your chosen topic strictly within the context of contemporary music history, or you may incorporate perspectives from another discipline, such as cognitive psychology, ethnomusicology, feminist theory, gender studies, literary criticism, mathematics, philosophy, theology, or the visual arts. That is, a purely analytic paper is possible, but your investigation of the music can be energized and enriched by engaging one of your extra-musical intellectual interests.\n\nAdditionally, you'll present selected findings to the class, during one of the May class meetings. I recommend that you prepare a text, from which you may read directly, of ca. 5-7 pp. in length, or perhaps slightly less (depending on the duration of the audio excerpts you play by way of illustration).\n\nSummary of Grade Weights\n\nACTIVITIES\n\nPERCENTAGES\n\nClassroom Preparation and Participation\n\n20%\n\nFour Listening Quizzes\n\n20%\n\nAnalytical Reviews of Live Performances\n\n10%\n\nTerm Paper Prospectus and Draft\n\n10%\n\nTerm Paper (Final Version)\n\n10%\n\nClassroom Presentation\n\n10%\n\nFinal Examination\n\n20%",
  "files": [
    {
      "category": "Resource",
      "title": "Analytic reviews of performances: Some points of inquiry",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-263-music-since-1960-spring-2006/8a9c0b8aa07fa5f95ba06188b575d09e_pnt_inq_anl_rev.pdf",
      "content": "21M.263--Music since 1960\nAnalytic reviews of performances:\nSome points of inquiry\nBy popular demand, here are some typical points of inquiry for analytic reviews of live\nperformances. You needn't feel compelled to address every single question I ask here\n(and, indeed, probably ought not to try), but if you write a paragraph addressing each of\nthe seven areas in turn, you'll likely find yourself filling 1-3 pp. (ca. 500 words) before\nyou know it.\nNote that each set of questions is framed in very general terms, such that you might find\nthem useful for approaching any unfamiliar music, regardless of when and where it was\ncomposed.\nTIMBRE\nWhat sort of vocal or instrumental sounds do the performers produce?\nTo what extent are they conventional or unconventional? To what extent do they\nresemble sounds that we normally don't expect to hear in a concert hall?\nAre there any unusual instruments, and if so, to what degree (and how) is their sound\nintegrated into that of the ensemble?\nTo what extent are dissimilar sounds directly contrasted, and to what extent are\ncontinuous transitions effected?\nTEXTURE\nWhat are the relationships among the performers in the course of the music?\nTo what extent is their activity closely coordinated, or mutually independent?\nHow do these relationships change as the music proceeds?\nTo what extent are dissimilar relationships directly contrasted, and to what extent are\ncontinuous transitions effected?\nIs there a clear differentiation between melody (or solo material) and accompaniment?\nSPEED, VOLUME, REGISTER\nHow quickly or slowly does the music proceed?\nIf the speed changes, does it change suddenly or gradually?\nHow do changes in speed help to articulate the overall form?\nHow loudly or softly is the music performed?\nIf the dynamic level changes, does it change suddenly or gradually?\nHow do changes in volume help to articulate the overall form?\nHow high or low does the music operate?\nIf the register changes, does it change suddenly or gradually?\nHow do changes in register help to articulate the overall form?\n\n21M.263--Music since 1960\nFORM\nWhat are the relationships among musical materials across the course of the entire piece?\nDo the musical materials change abruptly, or evolve gradually?\nDo the changes seem to progress toward a clear point of arrival?\nAre there any clear thematic or motivic gestures that recur?\nIf so, to what extent are the recurrences altered or transformed?\nDo they recur frequently, or only at the very end?\nHow is the form articulated? How do you know when one section ends and another\nbegins?\nRHYTHM\nIs there a clearly identifiable pulse? or none? or several?\nAre there clearly identifiable rhythmic patterns, and if so, how are they transformed upon\nrecurrence? What are the relationships among phrase lengths?\nTo what extent does the rhythmic activity seem static (e.g., running in place), and to what\nextent does it seem to propel the music forward?\nHow do changes in rhythmic activity contribute to a sense of tension or relaxation?\nHow do contrasts in rhythm help to articulate the overall form?\nMELODY\nWhat is the proportion of small melodic intervals (steps) to large ones (leaps)?\nIf there are leaps, how many articulate consonant intervals (thirds, perfect fourths, perfect\nfifths, sixths)? How many articulate dissonances (tritones, sevenths, ninths, etc.)?\nTo what extent do melodic lines conform to triadic tonality, or deviate from it?\nTo what degree are the pitches of the melody stable?\nTo what degree are they varied or inflected?\nTo what extent do melodic lines sound static, or undecorated?\nTo what extent do melodic lines sound fluid, or ornamented?\nTo what extent do melodic lines seem to arrive at clearly defined goals?\nHARMONY\nTo what extent does the harmony sound consonant, or dissonant?\nWhat are the most simple or stable harmonies in the piece?\nWhat are the most complex or dissonant?\nTo what extent does the succession of harmonies conform to triadic tonality, or not?\nHow do changes in harmony contribute to a sense of tension or relaxation?\nHow do changes in harmony help to articulate the overall form?\nTo what extent do harmonic successions seem to arrive at clearly defined goals?"
    },
    {
      "category": "Resource",
      "title": "Further Thoughts",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-263-music-since-1960-spring-2006/bfa4e50bcdff4af00839630806c6c233_further_thoughts.pdf",
      "content": "21M.263--Music since 1960\nIn the guidelines I distributed earlier this week, I mentioned that one ought NOT to\nsubmit a disconnected laundry list of description, but I didn't specify how to organize a\nmore selective list.\n1) I recommend that you take a position: was the performance excellent? good?\nmediocre? bad? poor? You can then supply evidence to support your evaluation: first,\nexplain what was good about the performance, and then specify what was lacking. For\nthe latter, I would suggest that you frame your comments as constructive criticism: how,\nexactly, could the unsatisfactory aspect have been improved?\n2) Even if you haven't had a chance to familiarize yourself with a new piece (e.g., if the\nperformance is a world premiere), it's important to evaluate separately the composition\nand the performance (or at least, to try to do so). If you imagine these as the orthogonal\naxes of a two-dimensional, finite coordinate space, then there are four extreme cases:\na) The composition is a masterpiece, and the performance was brilliant,\nb) The composition is a masterpiece, but the performance was a fiasco,\nc) The composition is utter junk, but the performance was brilliant nonetheless,\nd) The composition is utter junk, and the performance was a fiasco\n(below and beyond the faults of the score).\nOf course, the more opportunity you've had to get to know the piece beforehand, the\neasier it is to render these independent judgments. Note also that case \"d\" above is the\nhardest to substantiate, as it essentially corresponds to trying to prove a negative, times\ntwo... or at least, with an unfamiliar piece, one can never be quite sure how much of the\nfault lies where, until one has heard another performance that suggests case \"b\" or case\n\"c\"... and even then, the right performance might convince you that you've just heard case\n\"a\" after all.\nNaturally, most performances won't fit these extreme cases (the four corners of the\ncoordinate space), but will fall somewhere in between... and herein lies the challenge\n(and the reward) of organizing clearly your observations and judgments.\n3) Yes, there's a high degree of subjectivity to all of this. Nonetheless, I encourage you to\nadopt a scientistic approach: Whatever your judgment, be sure to supply the evidence of\nyour observations to support it. Grading of reports will be based on how convincingly\nyou articulate your position, regardless of whether I agree with your opinion.\n--B.R. (18 Feb 2006)"
    },
    {
      "category": "Exam",
      "title": "Preview of the Final Exam",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-263-music-since-1960-spring-2006/0d7020309d1741b1e156001b8b06ed93_final_preview.pdf",
      "content": "21M.263--Music since 1960--Spring 2006\nPreview of the Final Exam\nPart I: Listening identification (10 x 5 = 50 pts.)\nI'll play ten excerpts from the following list of selections; for each excerpt, supply:\nthe composer's full name (1.5 pts.),\nthe work's title (1.5 pts.),\nthe year(s) in which it was written (1 pt),\nand indicate the technique(s), style(s), or trend(s) that it demonstrates (1 pt).\nBonus opportunity: Correctly identifying a movement within the larger work will earn an additional 0.5 pt.\nGyorgy Ligeti: Atmospheres (1961)\nHarry Partch: And on the seventh day petals fell in Petaluma (1964)\nAstor Piazzolla: Hora cero [Zero hour] (1965)\nIgor Stravinsky: Requiem canticles (1965-66)\nKarlheinz Stockhausen: Hymnen (1966-67)\nLuciano Berio: Sinfonia (1968-69)\nGeorge Crumb: Ancient voices of children (1970)\nHK Gruber: Frankenstein!! (1971-78)\nElliott Carter: A mirror on which to dwell (1975)\nPhilip Glass: Einstein on the beach (1976)\nSteve Reich: Music for 18 musicians (1976)\nPaul Lansky: Six fantasies on a poem of Thomas Campion (1978-79)\nGyorgy Kurtag: Messages of the late R.V. Troussova (1980)\nJohn Harbison: Mirabai songs (1982)\nAlfred Schnittke: String quartet no. 3 (1983)\nHarrison Birtwistle: Secret theatre (1984)\nGyorgy Ligeti: Etudes for piano, bk. I (1985)\nJohn Adams: Nixon in China (1985-87)\nJohn Zorn: Cat-o'-nine-tails (1988)\nHenri Dutilleux: Mystere de l'instant (1989)\nEllen Taafe Zwilich: Clarinet quintet (1990)\nKaija Saariaho: Noa noa (1992)\nPierre Boulez: Sur incises (1996-98)\nEvan Ziporyn: Partial truths (1997)\nJohn Adams: On the transmigration of souls (2002)\nPeter Child: Fantasia (2003)\n\n21M.263--Spring 2006--Preview of the Final Exam\nPart II: Short essay (20 pts.)\nI'll play a short excerpt from a late twentieth-century film soundtrack. Please briefly\ndescribe its characteristics, and then compare and contrast it in detail with the music\nwe've studied this semester. Into which of the semester's various topics would it seem to\nfit? Which techniques does it incorporate, or not? Whose music does it resemble, and for\nwhich features?\nPlease write approximately 200 to 250 words, i.e., one to two paragraphs, comprising a\ntotal of five long sentences (or ten short ones).\nPart III: Long essay (30 pts.)\nChoose any one of the subject's six units (listed below). Write an overview of that topic's\nhistorical development between 1960 and the present, identifying at least five\nrepresentative pieces by five different composers. For each such work, supply the\ncomposer's full name, the work's full title, and the year in which it was composed;\ndescribe how these pieces relate to each other, and how they contrast to contemporary\nmusic of other styles.\nPlease write approximately 500 to 750 words, i.e., about five paragraphs, comprising a\ntotal of fifteen long sentences (or thirty short ones).\nUnit One: Order and entropy\n(serialism, integral serialism, Darmstadt, postserialism, the \"New Complexity\")\nUnit Two: Mavericks\n(composers who aren't identified with any one school or -ism)\nUnit Three: New sounds, new technologies\n(extended techniques, electroacoustic music, spectral music)\nUnit Four: Quotation and polystyle\n(collage, quotation, allusion, crossover, polystylism)\nUnit Five: The minimalist impulse\n(minimalism, the \"holy minimalists,\" postminimalism)\nUnit Six: The persistence of tonality\n(neoclassicism, rejection of serialism, the \"new tonality,\" extensions of folk traditions)"
    }
  ]
}