{
  "course_name": "Musical Improvisation",
  "course_description": "In this course, students study concepts and practice techniques of improvisation in solo and ensemble contexts. The course examines relationships between improvisation, composition, and performance based in traditional and experimental approaches. Hands-on music making will be complemented by discussion of the aesthetics of improvisation. Weekly lab sessions support work on musical technique. Guest artist / lecturers will engage students through mini-residencies in jazz with film, Indian music, electronic music, and blending improvisation with classic music; and an accompanying concert series will feature these artists in performance. Open by audition to instrumental or vocal performers.",
  "topics": [
    "Fine Arts",
    "Music",
    "Fine Arts",
    "Music"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nLabs: 1 session / week, 1 hour / session\n\nSix on-campus concerts, outside of regular class time\n\nCourse Overview\n\nThis course is designed to expose students from a wide background of experience and training to the many facets of the art and craft of improvisation. It is not a jazz improvisation course, although there will be substantial use of jazz approaches. Having an open mind and open ears are paramount, as well as having intermediate musical-technical skills.\n\nThe course provides an overview of and an immersion in a variety of approaches to musical improvisation. We will study concepts and techniques of improvisation in solo and ensemble contexts, as well as the aesthetics of improvisation. Further, the relationships among improvisation, composition, and performance based in traditional and experimental approaches will be examined. Topics, with occasional guest lectures, will include jazz, non-western music, and western concert music, as well as the use of musical improvisation with film, All of these facets will be explored through lecture-discussions, lecture-demonstrations, and hands-on music making.\n\nStudents should plan to bring instruments to most class sessions and all lab sessions.\n\nPrerequisites\n\nStudents are expected to have at least an intermediate level of performance skill on an instrument, including voice. Prior experience as an improviser is not necessary, although it will be useful. Enrollment is contingent on brief auditions held during the first class (\nsee below\n).\n\nGuest Artist-Teachers and Concert Series\n\nThis term, we are privileged to have four distinguished artist-teachers and their ensembles participating in our course. Each artist-teacher will serve as guest lecture for a pair of class meetings, while their full ensembles will perform in our\nArt of the Improvisors\nconcert series.\n\nStructure of guest lecture sessions:\n\nFirst class: artist introduces concepts, demonstrates, & gives assignment to students, such as a short piece based on these concepts.\n\nSecond class: artist serves in \"master class\" mode, as students present their work, followed by further discussion, demonstration, and interaction.\n\nAttendance at all of the concerts is mandatory. Students write reflective reports on the concerts, reinforcing what the artist-teachers present in the classroom setting.\n\nIn addition to the four concerts in the guest artist series, students are also required to attend and write reports on two other concerts by the MIT Festival Jazz Ensemble and Aardvark Jazz Orchestra.\n\nLabs\n\nThe weekly lab session will be taught by\nTom Hall\n, a master improviser and teacher. Attendance is mandatory.\n\nLabs are intended to increase improvisational proficiency and general musicianship. However, their main goal is exposure and experience, not necessarily the focused development of individual improvisational skills. These individual skills are better pursued with a private teacher or in the context of the Jazz Combo program at MIT. And yet, students' individual skills will certainly improve by the end of the semester.\n\nAuditions\n\nAuditions will take place during the first class session. That class will begin with a very brief general overview. Then, individual auditions will proceed. The audition will include these elements: [1] a piece you prepare, something you regularly play and enjoy--no more than one minute in length; [2] a couple of major and minor scales, your choice; [3] a short improvisational exercise I will devise. Each audition should take no longer than 5-6 minutes. If necessary, the auditions may extend past the normal class ending time.\n\nTextbook\n\nHall, Tom.\nFree Improvisation: A Practical Guide\n. Bee Boy Press, 2009. ISBN: 9780615328621.\n\nSummary of Coursework Requirements\n\nAttendance (on time) and participation in all class and lab sessions.\n\nAttendance at, and written reports on, the concert events.\n\nWeekly assignments, including creative exercises and analytical reflections.\n\nGuest artist-teachers will assign exercises based in their particular approaches.\n\nA Final Project will demonstrate development of skills and aesthetic awareness based in course content.\n\nGrading\n\nGrading will be fairly evenly weighted across the many small design assignments, with a bit more weight on the larger final project.",
  "files": [
    {
      "category": "Resource",
      "title": "Handout on Improvisation/Composition",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-355-musical-improvisation-spring-2013/863e241cde70fca0b86059fe4d0811b0_MIT21M_355S13_handout.pdf",
      "content": "IMPROVISATION/COMPOSITION\nBASIC VARIABLES\nMELODIC ASPECTS\ntexture\ndynamics\nrange/register\nduration\nshape\nMotive\nPhrase\nGesture\nApproaches:\ntimbre/color\ntempo/feel\ncharacter/mood\nenergy lin tensi ty\nmani pulations:\nembellish/paraphrase/extend\ninvert/reverse/sequence/pattem\naugment/diminish\nscalar/modal, chordal, intervallic\nSTRUCTURAL ASPECTS background/foreground activity\ntension/release\nSimilar activity\nimitation\nComplementary activity\nrepetition\nContrary activity\nvariation\nSilence & Sound\nEvolving form\ndensity\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21M.355 Musical Improvisation\nSpring 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}