{
  "course_name": "Myth, Ritual, and Symbolism",
  "course_description": "Human beings are symbol-making as well as tool-making animals. We understand our world and shape our lives in large part by assigning meanings to objects, beings, and persons; by connecting things together in symbolic patterns; and by creating elaborate forms of symbolic action and narrative. In this introductory subject we consider how symbols are created and structured; how they draw on and give meaning to different domains of the human world; how they are woven into politics, family life, and the life cycle; and how we can interpret them.\nThe semester will be devoted to a number of topics in symbolism.\n\nMetaphor and Other Figurative Language\nThe Raw Materials of Symbolism, especially Animals and The Human Body\nCosmology and Complex Symbolic Systems\nRitual, including Symbolic Curing and Magic\nNarrative and Life\nMythology",
  "topics": [
    "Humanities",
    "Linguistics",
    "Semantics",
    "Religion",
    "Social Science",
    "Anthropology",
    "Humanities",
    "Linguistics",
    "Semantics",
    "Religion",
    "Social Science",
    "Anthropology"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nOverview\n\nHuman beings are symbol-making as well as tool-making animals. We understand our world and shape our lives in large part by assigning meanings to objects, beings, and persons; by connecting things together in symbolic patterns; and by creating elaborate forms of symbolic action and narrative. In this introductory subject we consider how symbols are created and structured; how they draw on and give meaning to different domains of the human world; how they are woven into politics, family life, and the life cycle; and how we can interpret them.\n\nThe semester will be devoted to a number of topics in symbolism.\n\nMetaphor and Other Figurative Language\n\nThe Raw Materials of Symbolism, especially animals and The Human Body\n\nCosmology and Complex Symbolic Systems\n\nRitual, including Symbolic Curing and Magic\n\nNarrative and Life\n\nMythology\n\nThe course will focus primarily on symbolic forms and their analysis, rather than on intellectual history or the place of symbolic studies in social theory. Theorists, schools of thought, and intellectual history will be discussed for the most part in the context of the six topics listed above, and technical vocabulary will be kept to a minimum. Readings will consist primarily of articles and chapters, most of them by anthropologists, covering a wide variety of cases from traditional and modern societies. Students, in addition to keeping up with the readings and participating in class discussions, will be expected to write a series of short essays and field studies over the course of the semester.\n\nThere is one required text,\nIllness as Metaphor\n\n/ AIDS and its Metaphors\n, (by Susan Sontag 1978, 1989, Doubleday). Otherwise, course readings consist of articles and chapters on different aspects of symbolism, which will be discussed in class.\n\nClasses will consist of a mixture of lecture and discussion. Each class is keyed to a set of readings, and it is crucial that students keep up with the readings and be prepared to discuss them in class. Class participation -- in terms of both regular attendance and participation in discussion -- will count strongly towards the final grade. In the first weeks of the semester attendance will be taken.\n\nThere is no prerequisite: this subject is open to any student.\n\nWritten work will consist of a series of short papers, divided between essays and field reports. There is no final exam.",
  "files": [
    {
      "category": "Resource",
      "title": "a.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-212-myth-ritual-and-symbolism-spring-2004/9182d96740784ed6f76d19b790aa8920_a.pdf",
      "content": "21A.212\n\nCorinne Packard\nProppian Analysis\n\n\"In the criminal justice system, the people are represented by two separate yet equally\nimportant groups -- the police who investigate crime, and the district attorneys who\nprosecute the offenders. These are their stories.\"-Law & Order\n\nProppian Analysis of \"Law and Order\"\n\nThe award-winning NBC series, \"Law and Order,\" about investigating crimes and\npunishing criminals has a highly formulaic pattern which can be analyzed using methods similar\nto those of Vladimir Propp in his book, Morphology of the Folktale. The plots of the series often\nbear a striking similarity to actual events in the news, though a disclaimer at the end of the show\ninsists that the plots are all fictional. Crimes involving stem cell researchers, Falon Gong\nparticipants, civil rights-sensitive cases, and September 11th fraud cases were all used during\nSeason 13 of \"Law and Order.\" Perhaps one of the reasons the series is so popular is because it\ndramatizes yet seems to imitate real life. The \"Law and Order\" series has been running on NBC\nfor 14 seasons and also has several derivative shows, \"Law and Order: Special Victims Unit\n(SVU)\" and \"Law and Order: Criminal Intent (CI).\" While a Proppian analysis could likely be\nextended to the entire spectrum of \"Law and Order\" episodes, this paper will focus for the sake\nof brevity just on episodes from season 13 of the original \"Law and Order\".\nEach episode breaks clearly into two parts: the law section (represented as I) and the order\nsection (represented as II). The law section is further broken down into all the elements of the\ndetectives investigating a crime and determining which laws have been broken.\nA.) Discovery of a death (or deaths)-- A death is discovered by either a civilian (Ac), the police\n(Ap), or by some other city worker (Aw). The crime is reported to the police and they\nsecure the crime scene.\n\nB.) Evidence is collected and examined--Evidence is collected by the police and examined by\nthe forensic team. Evidence may be collected from the victim's body (Bb), from the crime\nscene (Bc), from the victim's belongings or residence (Bv), or from a suspect's belongings\nor residence (Bs). Evidence is analyzed and either points to a new lead (Æ l), confirms\nsuspicions (Æ c), or results in a dead end (Æ e)\nC.) Witness interrogations--Different witnesses are interrogated to determine their involvement\nin the crime or knowledge of the events. Different witnesses may be interrogated: eye-\nwitnesses who were present at the time of the crime (Ce), neighbors surrounding the crime\nscene (Cnc), neighbors to the victim (Cnv), or neighbors to the suspect (Cns). Interrogations\nmay result false alibis (Æfa), true alibis (Æta), leads to new evidence or witnesses (Æl), or\ninformation about motive (Æm).\nD.) Suspect arrested--A suspect is arrested and brought to the precinct. The suspect may either\nrequest a lawyer (Dl) or confess to a crime (Dc). Sometimes no further detail besides the\narrest is given (D).\nThe 'order' part of \"Law and Order\" consists of actions taken by the district attorney in trying\nthe case before a judge or jury. This sequence can be broken down just as the 'law' sequence.\nE.) Evidence excluded-- A judge may exclude evidence such as physical evidence (Ep)\nor a confession (Ec) based on misconduct by the police.\nF.) Plea bargain--A plea bargain is either requested (Fr) or offered by the district attorney (Fo).\nA request for a plea bargain may be denied by DA or the terms may be rejected by the\nsuspect (Æd).\n\nG.) Witness/Suspect on the stand--A witness (Gw) or the defendant (Gd) takes the stand to\nanswer questions from the district attorney or defendant's counsel. This may lead to\nindications that the defendant may be guilty (Æ g) or may be innocent (Æ i).\nH.) Verdict-- This element may or may not be included directly in each episode. There are four\npossibilities: a verdict is implied, but not announced (Hn), a verdict is unknown (Hu), a\nguilty verdict is returned (Hg), or an innocent verdict results (Hi). There is also the\npossibility that the judge may overrule a verdict, changing the outcome to innocent (Æi), or\nguilty (Æg).\nFinally, one last element must be introduced: the 'wild card.' A wild card can be placed in\neither section I or II. The wild card defines a moment when a dramatic twist is introduced into\nthe case. The wild card can be described as follows:\nW*.) Wild Card-- a plot twist arises that is a dramatic change in the case. The wild card\nusually brings the plot back to a major element of the action. For instance, if tests on evidence\nreveal that a gun wasn't actually the murder weapon, the wild card would be represented as\nW*(B), or if the suspect is revealed to be uninvolved in the case, the notation would be W*(D).\n\nOne can see how this Proppian analysis works for specific episodes. For example, the 2\nepisodes \"Tragedy on Rye\" and \"The Ring\" are analyzed in the separate file lawandorder2.ppt\n(for ease of graphical illustration of the plot structure). The plot synopses offered here were\nwritten for this paper, but the official summaries can be seen on the show's NBC website\n(http://www.uni-television.com/laworder/html/episode/index.html)."
    },
    {
      "category": "Resource",
      "title": "bondry_of_meth_r.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-212-myth-ritual-and-symbolism-spring-2004/1cde17c4c82aa6d6131c995a82ebf762_bondry_of_meth_r.pdf",
      "content": "Boundary of Metaphors-Rewrite\n21A.212\nShen Qu\n5/1/2004\n\nA recurring issue in anthropology is the lack of clear definition on the subject\nmatter under discussion: it is difficult to make a definitive argument about rituals if no\none really know what the term \"ritual\" means? Other subjects such as \"society\" and\n\"culture\" face the same problem. People generally have a sense of what culture is; but if\nasked to define the term, most would have trouble and few could come up with answers\nthat seem complete even to themselves let alone those around them. However, because\nthese definitions are controversial, scholars are usually aware of the limitations and can\nconstruct their work accordingly (if they wish). Metaphors are slightly different. Most\n(educated) people \"know\" what a metaphor is: it is, plainly put, one thing used to\nrepresent another, similar thing. Therefore, people make liberal use of the term without\ngiving it much thought. But in practice, metaphor is not clearly defined; or rather the\n\"clear\" definition leaves a large gray area open to interpretation.\nThe Webster's Dictionary defines metaphor as \"a figure of speech containing an\nimplied comparison, in which a word or phrase ordinarily and primarily used for one\nthing is applied to another.\" This seems relatively straightforward, especially for a\ndictionary definition. Take for example the two sentences \"he is tall\" and \"she is\nfuming.\" The former is a statement of height where as the latter is a metaphor drawing a\ncomparison between anger and fire. The difference seems clear cut, but what if I tell you\nthat the \"tall\" guy has a height of five feet and four inches. Suddenly, you may realize\nthat \"tall\" is actually used to implicitly express a sense of greatness and strength; he is tall\nnot physically but metaphorically. In a similar way, if a girl is smoking a cigarette than\n\nshe may be literally \"fuming\" not metaphorically. But what if the girl is angry and\nsmoking at the same time? The meaning of the sentence gets more complicated. This\nshows that metaphor is not always easy to identify. An \"implied comparison\" means that\nthe reader or listener have to draw the connection. And the gap between the original\nintention and receiver's understanding is not always easy to fill.\nOne may argue that the above example only deals with the recognition of\nmetaphor, not its definition. But the two is tightly linked. Lets look into the idea that\n\"the heart is a pump.\"* Prior to the development of the mechanical pump people found it\nvery difficulty to describe how the heart functions. Thereafter, the heart is mostly\ndescribed in association with the pump. The question is, is the heart a pump in the\nmetaphorical sense? We can argue that the heart is by definition a pump made of flesh\nand blood or that a pump is by definition something which maneuvers the flow of liquid\nand the heart and the mechanical pump are only specific types of the generic pump.\nThere are certainly many comparisons that could be implied between heart and pump, but\ndoes that mean it is a metaphor? Man and the generic primate can also be described in\nmuch the same way, but saying that \"man is a primate\" is not a metaphor since man is\ntype of primate.\nSo perhaps the metaphor lies in the comparison between the heart and the\nmechanical pump much like one would compare man to another primate like the monkey?\nBut even this approach has its problems. Consider the possibility that the inventor of the\nfirst mechanical pump based his design on a heart. (This is very probable since humans\nderive knowledge from what already exists in nature.) In this case, the mechanical pump\nwould be nothing more than a simplified heart made of nuts and bolts. This idea only\n\n* This is taken from MIT course 21A.212 Spring 2004 lectures.\n\ngets more and more confusing and goes to show just how difficult the classification of\nmetaphor can be.\nIn Metaphors We Live By, Lakoff and Johnson further extended the complexity of\nmetaphors by suggesting that sometimes, \"it is far more difficult to see that there is\nanything hidden by the metaphor or even to see that there is a metaphor here at all\" (11).\nBut if we are using a metaphor without realizing then is it still a metaphor? Lets consider\na hypothetical situation. Long ago there lived a king named Hexar who had six toes on\none of his foot. Ever since, people started to refer to a six-toed foot as a hexar. Now\nyears have passed, and people have long forgotten about King Hexar. The dictionary\ndefines hexar as a foot with six toes. In this case is hexar a metaphor? Historically, yes.\nBut people in the present do not mean to imply a comparison when using the word; they\nare simply using vocabulary by definition; and the word is no longer used in association\nwith King Hexar and always in association with six toes. So then are the people using a\nmetaphor unconsciously or are they using metaphor at all? Can something be called a\nmetaphor if the users never meant to imply a comparison and the receiver never\nperceived a comparison?\nLakoff and Johnson also provided examples of imbedded metaphors such as\nargument is war, time is money, ideas are objects, etc. The detail analysis of these\nexamples often walk a thin line between metaphor and the fundamental structure of\nlanguage and thought, which is not surprising since they believe \"our conceptual system\nis largely metaphorical\" (3). This adds yet another layer of complexity to metaphor since\nit is no longer just a form of expression but a form of conception as well. For instance,\nthey defended the \"argument is war\" example by pointing out that war related terms such\n\nas defense, weakness, target, win, lose, and strategy are used to describe argument. First\nnotice that, much like the case of pump and heart, argument could be defined as a type of\nwar, a verbal war. Thus argument and war could be described in the same way without a\nmetaphorical comparison.\nFurthermore, since argument and war are similar, it is inevitable that they are\ndescribed by the same terms. A cheetah can run and a human can run, but saying that the\nhuman is running does not mean that s/he is compared to a cheetah; thus, a person can be\ndefensive in both war and argument without implicitly comparing the two. Defense is\nsimply an action on its own that can be applied to scenarios such as argument and war.\nIn fact, does anyone know whether the word defense was first used in conjunction with\nwar or argument or some other concept? Has anyone counted whether it is used more\noften with war or argument? If no, then how can we say defense is a term of war?\nFinally, consider the case where something previously unknown, such as an alien,\ncame into the world. How would we describe the alien and everything about it?\nWhatever it is like, the description must be made up of words already existing in the\nlanguage (whichever language it may be) because we do not know another way. Even if\nnew terms were created for this alien, these terms would in turn be defined with words in\nthe current language. Since these words are already associated with something in our\nworld, are we implicitly comparing that something with the alien? (If we use words such\nas defense or strategy in association with an alien action, does that mean we are making a\nmetaphorical comparison between war and this alien's action?)\nIn \"The Culture Basis of Metaphor,\" Naomi Quinn states her own views on\nmetaphors. Unlike Lakoff and Johnson, Quinn believes that metaphors are driven by\n\nculture; metaphors do not structure understanding but are chosen to \"satisfy mappings\nonto already existing cultural understandings\" (65). As example, she brought forth eight\ngeneral metaphorical categories associated with marriage: sharedness, lastingness, mutual\nbenefit, compatibility, difficulty, effort, success/failure, and risk. She argues that we do\nnot associate any of these traits to marriage because they are fundamentally linked;\ninstead, these metaphors reflect culture beliefs of what marriage is like. Personally, I find\nthis argument easier to accept than that of Lakoff and Johnson's. And the acceptance of\none or the other will certainly alter the line inside which we find metaphor. However,\nhow can we 'proof' that either one is closer to the 'true' definition of metaphor? How do\nwe know what is and what isn't a metaphor?\nIs metaphor the answer to Ontology? Does it define how we perceive being and\nexistence? If everything is in someway a metaphor then does the word metaphor still\ncarry a meaning? If not, then what is a metaphor, and where are its boundaries? These\nquestions are abstract but significant. They are also not specific to only metaphors: many\nof the same questions and arguments can be carried over to other forms of tropes. Take\nfor example metonyms. Does the mention of things linked to each other necessarily\nimply a metonymical comparison? What if two things used to be associated with each\nother in the distant past but have long since lost that connection? This essay does not\nanswer these questions. Its goal is to simply point out that writers should remain mindful\nof the gray boundary of what constitutes metaphor and be clear to themselves and readers\nwhat they mean when using the word until and unless a strict definition can be\nestablished.\n\nReferences\n\nLakoff, George, and Mark Johnson. Metaphors We Live By. Chicago: University\nof Chicago Press, 2003.\n\nQuinn, Naomi. \"The Culture Basis of Metaphor.\" Beyond Metaphor: The Theory\nof Tropes in Anthropology. Ed. James W. Fernandez. Stanford, CA: Stanford\nUniversity Press, 1991. 56-93."
    },
    {
      "category": "Resource",
      "title": "homily.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-212-myth-ritual-and-symbolism-spring-2004/abdf63b6b6688ae4a178a4d030c9f9fd_homily.pdf",
      "content": "Orlando Jaquez\nApril 26, 2004\nProfessor James Howe\nSecond Field Assignment\n\nPriest as Chief\nThe Rite of Homily as Guidance Tool\n\nOn Easter Sunday1 2004, I had the opportunity of attending a Catholic Mass at a church in the\nwestern suburbs of Boston. This visit, while admittedly pious in nature, allowed me to (in the\nmetaphorical sense) kill two birds with one stone. Not only was I able to fulfill my religious\nobligation, but I also managed to perform fieldwork and observe a well-known ritual firsthand.\nLuckily for me, it also allowed me the opportunity of obtaining a transcript of the sermon, which\nwill be used in this paper with his permission. In this short piece, I present an analysis of Catholic\nMass liturgy, in particular of the rite of Homily, and I argue that through the Homily, the Catholic\npriest, as the ritual leader, plays a key role in the preservation and reassertion of the Faith.\n\nRitual study - understanding the ritual form and its function - has become an\nincreasingly important area in anthropology, and has served as a major analytical tool for the\ngreatest minds in the field since its inception (Bell 1992: 3). Ritual is ubiquitous in all societies,\nand so, the study of rituals serves as a sort of spy-hole into the \"cultural dynamics by which\npeople make and remake their worlds\" (Bell 1992: 3). In the world of religion, in particular,\nritual study has been especially useful, as ritual is considered (by some) to be \"the ground from\nwhich religion grows\" (Rappaport 1999: 26). I tend to agree with Anthony Wallace's statement\nthat, \"it is ritual which accomplishes what religion sets out to do,\" and is thus, the primary\nphenomenon of religion (1966: 102). Religion, then, is kept alive, not by the mere belief in the\ndivine or the sacred, but by the performance of religious rituals. While these views of religion\nand ritual may not be universal, it is nonetheless my own belief that ritual, by any definition, is a\nfundamental feature of the religious experience. In fact, all studied religions have a defined\nsystem of rituals that serves to provide \"an aura of facticity\" to religious beliefs (Geertz, 1973:\n\n1 The holy day of Easter marks the end of a 40-day period of Lent, and symbolizes the resurrection of the Christ\nafter the third day of his death (See Elliott 1995).\n\n90). It is important to note that while a number of definitions of ritual exist (Frits Staal defines it\nas \"pure activity, without meaning or goal\", Levi-Strauss as \"a favored instance of a game\")2,3, I\nwill adopt Roy Rappaport's general statement, which is described in his book, Ritual and\nReligion in the Making of Humanity (1999: 27):\n\"[Ritual is] the performance of more or less invariant sequences of formal acts and utterances not\nentirely encoded by the performers [that] logically entails the establishment of convention, ... the\nconstruction of time and eternity, the representation of a paradigm of creation, the generation of\nthe concept of the sacred and the sanctification of conventional order, the generation of theories of\nthe occult, the evocation of numinous experience, the awareness if the divine, the grasp of the\nholy, and the construction of orders of meaning transcending the semantic.\"\n\nBy this definition, the Catholic religion is filled with ritual. In fact, the Catholic Church\nhas defined in great detail a set of rituals - a Sacramentary - that function to establish the\nreligion's \"aura of facticity\" that Geertz describes (Elliott 1995). The Sacraments - Baptism,\nCommunion, Confirmation, Penance, Anointment of the Sick, Holy Orders, and Matrimony - are\nthe principal rites of the Catholic faith, and function to define membership in much the same way\nas the rites of passage described by Turner (1967) and Van Gennep (1909). Communion, and to\na lesser extent, Penance, are calendrical rites. That is, these sacraments are performed regularly\nand normally adhere to a defined schedule (Rappaport 1999). The remaining five are non-\ncalendrical and occur only as responses to events in, or at different stages in life. For the sake of\nbrevity and in the interest of focus, I choose to only address the ritual of Communion, or the\nMass, and more specifically, the rite of the Homily (the sermon).\nThe modern Catholic Mass is itself divided into a series of minor rites. These rites are\ninvariably repeated at every mass, with few exceptions not herein discussed. I shall only provide\na brief review of these minor rites, as I am principally concerned with the Homily. The mass\nopens with the Introductory Rites: the entrance hymn, the greeting, the penitential rite, the kyrie\n\n2 Frits Staal, \"The Meaninglessness of Ritual,\" Numen 26, 1976. (Obtained from Bell 1992)\n3 Claude Levi-Strauss, The Savage Mind, trans. George Weidenfield and Nicholson Ltd., University of Chicago\nPress: Chicago, IL, 1966. (Obtained from Bell 1992)\n\neleison (congregation's prayer for forgiveness), the Gloria (a praise of God), and the opening\nprayer (a prayer that is peculiar to the day). 4 Following the Introductory Rites, the congregation\nengages in the Liturgy of the Word: the First Reading (from the Old Testament), the Second\nReading (from the New Testament), the Gospel and Acclamations (from the Book of Matthew,\nMark, Luke, or John), the Homily (the priest's sermon), the Credo (usually a recital of the\nNicene Creed, which restates the Faith), and the Intercessions (business of the Parish and special\nneeds). The Liturgy of the Eucharist follows, and includes: the preparation of the altar and gifts,\nthe Sursum Corda (prayer calling attention to the congregation to \"lift up [their] hearts\"), the\nPreface and Sanctus (prayer of the angels), the Eucharistic Prayer (which calls for\ntransubstantiation of bread and wine), and the Mystery of the Faith (a proclamation of the\nmystery of Christ's resurrection). At this point in the Mass, the bread and wine are said to be\ntransubstantiated into the body and blood of Christ, respectively. The mass concludes with the\nrite of Communion (Lord's Prayer, Taking of the Bread, and Prayer after Eucharist) and the\nDismissal (See Elliott 1995).\n\nThe Homily, however, is of special interest to me. During this sermon, the priest\nnormally addresses one, or a set of the readings presented during the Liturgy of the Word. I find\nthis single rite particularly interesting, because it differs substantially from the others in the\nMass. The Homily is the only non-scripted segment of the ceremony that is intended to have\ninstructional meaning. That is, during the Homily, the priest is able to offer his personal\ninterpretation of the readings, and more importantly, of the religious moral of these readings.\nThis rite, then, provides the priest with a powerful window of opportunity in which to address the\nspecific topics he deems important.\n\n4 The actual order of mass can be found at: \"The Order of Mass: Basic Text for the Roman Catholic Eucharist,\nhttp://clawww.lmu.edu/faculty/fjust/Mass.htm (accessed April 20, 2004), and \"Mass (liturgy)\",\nhttp://encyclopedia.thefreedictionary.com/Mass+(liturgy) (accessed April 20, 2004).\n\nDuring my visit to the St. Julia Parish (Weston, MA), I had the fortune of obtaining a\ntranscript of Father X's sermon. Just as Father X did on Easter Sunday, a Catholic priest can\nprepare a weekly \"lesson\" for his congregation. And with this weekly lesson, the priest plays a\ncrucial role in maintaining the Catholic religion's \"facticity\") through three non-exhaustive,\napproaches: the use of easily understood vernacular and real-world examples, the selective\nelucidation or decoding of religious metaphors, and the use of rhetoric.\nLooking at Father X's transcript, the utility of the first approach was immediately\napparent. In his opening, the Father begins with two simple examples of what he considers to be\nthe phenomenon of Easter.5 The first example, that which suggests that feast of Easter is similar\nto winning a lottery, uses the lottery metaphor to convey to the audience that Easter is an\nunearned (thus universal) \"change for the better.\" With this, the speakers suggests that Easter\nshould evoke in a person the same excitement and pleasure felt when winning the lottery. As a\nresult, the congregation is able to compare the abstract notion of inheriting new life from Christ\nto the more plausible (though admittedly not by much) lottery scenario. The Father repeats this\nexercise in the second example. He translates the abstract notion of the new life of Christ in the\nPope to the real example of the Pope's blind forgiveness of the worst of sins.\nFather X. uses the second approach of selectively deciphering and elucidating the\nmeaning behind Catholic symbols when explaining the meaning of Baptism. Much like the\nKuna chief (and his interpreter) described by Howe (1977), Catholic priests often choose to\nexplain a concept rich in symbols, in terms of a smaller subset of these symbols, which they feel\ndirectly applies to the day's lesson. In his Easter sermon, when explaining the concept of\nBaptism and its ties to Easter, Father Evans only chose to decode the symbols of Baptism that\n\n5 Though not necessary, the reader should know that the readings for Easter Sunday 2004 included: Acts 10:34a, 37-\n43; Colossians 3:1-4; John 20:1-9.\n\nwere directly relevant to the topic of Easter. So, in describing Baptism, he placed heavy\nemphasis on the idea of incorporation of the baptized into the Body of Christ - an incorporation\nthat is reinforced every Easter. What is more, the Father cleverly maintains this line of thought\nthroughout the entirety of the sermon, reinforcing specific characteristics of Easter and Baptism,\nso as to produce an extremely coherent lesson on the Church's oneness with God.\n\nFinally, Father X. illustrates the use of rhetoric as a tool for persuasion and guidance. A\nclear feature of his sermon is the use of a rhetorical question, which is quickly followed by his\npersonal answer to that question. This technique, along with the persistent repetition of key\nconcepts, allows for an extremely convincing lesson. By asking, \"what is so special about\nBaptism...\" and quickly providing a host of answers to the question, the priest was able to instill\na great deal of knowledge on the congregation, without allowing for little questioning.\n\nWith this case study I have shown that the Homily is the vehicle with which the priest\ndrives his audience toward the \"right\" direction. With the sermon, he is able to selectively\nreinforce a different aspect of the Faith, so as to rejuvenate the \"aura of facticity\" of areas that\nmay be lacking. All in all, as the leader of the ritual, the priest is able to lead his congregation in\nthe direction he deems appropriate. In this sense, the Catholic priest shares qualities with a tribal\nchief that uses sermon to lead his village along a certain path (as we see with Howe's Kuna\n(1977)), or with a ritual leader that asserts the facticity of a faith through his sermon (as we see\nwith Turner's Ndembu doctors (1967).\n\nREFERENCES:\n\nBell, Catherine, Ritual Theory, Ritual Practice, Oxford University Press: New York, NY, 1992.\n\nElliott, Peter J., Ceremonies of the Modern Roman Rite: The Eucharist and the Liturgy of the\nHours: A Manual for Clergy and All Involved in Liturgical Ministries, Ignatius Press: Ft. Collins,\nCO, 1995.\n\nHowe, James, \"Carrying the Village: Cuna Political Metaphors,\" In The Social Use of\nMetaphor: Essays on the Anthropology of Rhetoric, David J. Sapir and J. Christopher Crocker\ned., University of Pennsylvania Press: 1977.\n\nMorris, Brian, Anthropological Studies of Religion: An Introductory Text, Cambridge University\nPress: New York, NY, 1987.\n\nRappaport, Roy A., Ritual and Religion in the Making of Humanity, Cambridge University Press:\nNew York, NY, 1999.\n\nWallace, Anthony F. C., Religion: An Anthropological View, Random House, Inc.: New York,\nNY, 1966."
    },
    {
      "category": "Resource",
      "title": "laworder.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-212-myth-ritual-and-symbolism-spring-2004/fc101ed7dcdc3c84db599d0679ab9af1_laworder.pdf",
      "content": "21A.212\n\nCorinne Packard\nProppian Analysis\n\n\"In the criminal justice system, the people are represented by two separate yet equally\nimportant groups -- the police who investigate crime, and the district attorneys who\nprosecute the offenders. These are their stories.\"-Law & Order\n\nProppian Analysis of \"Law and Order\"\n\nThe award-winning NBC series, \"Law and Order,\" about investigating crimes and\npunishing criminals has a highly formulaic pattern which can be analyzed using methods similar\nto those of Vladimir Propp in his book, Morphology of the Folktale. The plots of the series often\nbear a striking similarity to actual events in the news, though a disclaimer at the end of the show\ninsists that the plots are all fictional. Crimes involving stem cell researchers, Falon Gong\nparticipants, civil rights-sensitive cases, and September 11th fraud cases were all used during\nSeason 13 of \"Law and Order.\" Perhaps one of the reasons the series is so popular is because it\ndramatizes yet seems to imitate real life. The \"Law and Order\" series has been running on NBC\nfor 14 seasons and also has several derivative shows, \"Law and Order: Special Victims Unit\n(SVU)\" and \"Law and Order: Criminal Intent (CI).\" While a Proppian analysis could likely be\nextended to the entire spectrum of \"Law and Order\" episodes, this paper will focus for the sake\nof brevity just on episodes from season 13 of the original \"Law and Order\".\nEach episode breaks clearly into two parts: the law section (represented as I) and the order\nsection (represented as II). The law section is further broken down into all the elements of the\ndetectives investigating a crime and determining which laws have been broken.\nA.) Discovery of a death (or deaths)-- A death is discovered by either a civilian (Ac), the police\n(Ap), or by some other city worker (Aw). The crime is reported to the police and they\nsecure the crime scene.\n\nB.) Evidence is collected and examined--Evidence is collected by the police and examined by\nthe forensic team. Evidence may be collected from the victim's body (Bb), from the crime\nscene (Bc), from the victim's belongings or residence (Bv), or from a suspect's belongings\nor residence (Bs). Evidence is analyzed and either points to a new lead (Æ l), confirms\nsuspicions (Æ c), or results in a dead end (Æ e)\nC.) Witness interrogations--Different witnesses are interrogated to determine their involvement\nin the crime or knowledge of the events. Different witnesses may be interrogated: eye-\nwitnesses who were present at the time of the crime (Ce), neighbors surrounding the crime\nscene (Cnc), neighbors to the victim (Cnv), or neighbors to the suspect (Cns). Interrogations\nmay result false alibis (Æfa), true alibis (Æta), leads to new evidence or witnesses (Æl), or\ninformation about motive (Æm).\nD.) Suspect arrested--A suspect is arrested and brought to the precinct. The suspect may either\nrequest a lawyer (Dl) or confess to a crime (Dc). Sometimes no further detail besides the\narrest is given (D).\nThe 'order' part of \"Law and Order\" consists of actions taken by the district attorney in trying\nthe case before a judge or jury. This sequence can be broken down just as the 'law' sequence.\nE.) Evidence excluded-- A judge may exclude evidence such as physical evidence (Ep)\nor a confession (Ec) based on misconduct by the police.\nF.) Plea bargain--A plea bargain is either requested (Fr) or offered by the district attorney (Fo).\nA request for a plea bargain may be denied by DA or the terms may be rejected by the\nsuspect (Æd).\n\nG.) Witness/Suspect on the stand--A witness (Gw) or the defendant (Gd) takes the stand to\nanswer questions from the district attorney or defendant's counsel. This may lead to\nindications that the defendant may be guilty (Æ g) or may be innocent (Æ i).\nH.) Verdict-- This element may or may not be included directly in each episode. There are four\npossibilities: a verdict is implied, but not announced (Hn), a verdict is unknown (Hu), a\nguilty verdict is returned (Hg), or an innocent verdict results (Hi). There is also the\npossibility that the judge may overrule a verdict, changing the outcome to innocent (Æi), or\nguilty (Æg).\nFinally, one last element must be introduced: the 'wild card.' A wild card can be placed in\neither section I or II. The wild card defines a moment when a dramatic twist is introduced into\nthe case. The wild card can be described as follows:\nW*.) Wild Card-- a plot twist arises that is a dramatic change in the case. The wild card\nusually brings the plot back to a major element of the action. For instance, if tests on evidence\nreveal that a gun wasn't actually the murder weapon, the wild card would be represented as\nW*(B), or if the suspect is revealed to be uninvolved in the case, the notation would be W*(D).\n\nOne can see how this Proppian analysis works for specific episodes. For example, the 2\nepisodes \"Tragedy on Rye\" and \"The Ring\" are analyzed in the separate file lawandorder2.ppt\n(for ease of graphical illustration of the plot structure). The plot synopses offered here were\nwritten for this paper, but the official summaries can be seen on the show's NBC website\n(http://www.uni-television.com/laworder/html/episode/index.html)."
    },
    {
      "category": "Resource",
      "title": "television.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-212-myth-ritual-and-symbolism-spring-2004/fbb2ee276c4a3d5162d0c2729f6f4b16_television.pdf",
      "content": "Orlando Jaquez\nMay 5, 2004\nProfessor James Howe\nProppian Analysis\n\nPropp and the Folktale of \"Reality\" Television:\nToward a Structure of Reality Shows\n\nThe beautiful, the savvy, the romantic, the fit. These are the heroes of television's new\nobsession, reality television. For the past five years, world television audiences have been\ndeluged by these unlikely heroes and their so-called \"reality shows,\" each equipped with its own\ndrama, challenge, and reward. In the United States, it truly takes serious effort to avoid a reality\nprogram during primetime hours. The same is true in other nations with well-developed\ntelevision industries. England's top channel, BBC, is a renowned creator of reality shows, while\nAustralia's Seven is set to produce 15 reality shows in the coming seasons (David Dale, 2004).\nThese reality programs, however, are nothing more than a new type of narrative, a new\ntype of storytelling that aims to mimic reality. Much like any folktale or myth, or like any soap\nopera or sitcom, reality shows are fantastic tales with fantastic heroes. Reality television then,\nshould be treated not as a modern documentary of human behavior, but rather as a new genre of\nstorytelling. And in treating these shows as stories, I argue that these contemporary tales, as do\nthe folktales described by Vladimir Propp (1968) and Benjamin Colby (1973), invariably follow\na simple, yet well-defined structure - a \"magic formula\" for reality television. This analysis\nprovides a brief outline of this magic formula and illustrates it through four well-known\n(seemingly different) reality shows: Average Joe, Survivor, The Apprentice, and The Swan.\nMany types of reality shows exist. While some simply follow humans on their daily\nroutines, most are competitive in nature. This analysis focuses primarily on the competitive\ngenre, and recognizes that this structure may not apply to all other genres. The competitive show\n\nwill often contain a standard set of components: a host, who serves as the story's narrator; the\ncompetitors, one of which will be the story's hero; the challenge or challenges; and the reward,\noften in form of a person, but mostly in some form of monetary compensation. These elements\noften appear in a highly predictable order, which I will call the structure of these reality shows.\nThis structure can be broken down to eight subcomponents (events):\n1. A number of contestants (16 in all the cases studied) are\nbrought together to compete against each other for a common\nreward.\n\n2. A challenge is introduced.\n\n3. The contestants are normally divided into groups. In most\ncases studied, the groups were divided into groups of 8, but\nThe Swan was a notable exception, where the 16 contestants\ncompeted in groups of 2.\n\n4. The two teams compete each week in smaller challenges, with\nthe object of eliminating a player.\n\n5. Elimination is usually carried out by a vote or personal\ndecision.\n\n6. When the number of contestants falls below a certain point, a\nnew game plan is instituted.\n\n7. A final, \"ultimate\" challenge takes place between the finalists\n(2 in most cases, 8 in the case of The Swan).\n\n8. A winner (the \"hero\") is selected and rewarded.\n\nThis order of events is conserved throughout the programs, and is thus the backbone of this genre\nof narrative. Below is an illustration of how four programs, all seemingly different in content,\nfit this structure. It is presented in table format for the sake of brevity (Table 1).\n\nTable 1. Narrative structure of four reality shows\n\nProposed\nStructure\nAverage\nJoe1\nSurvivor2\nThe\nSwan3\nThe\nApprentice4\n1. Contestants\nare\nbrought together to\ncompete for common\nreward\n16 men brought to\nmansion\ncontestants\ngather\ntogether in a remote\nlocation\nwomen\n(ugly\nducklings) chosen and\ntaken to mansion\nprofessionals\ngather\nin\nTrump\nboardroom\n2. Challenge;\nreward\n\nintroduced\nMeet\n\"bacholerette\"\n(challenge & reward);\nwin $1M\nChallenge and reward\nintroduced:\noutplay,\noutlast,\noutsmart\nfor\n$1M\nChallenge and reward:\nbe\nsurgically\nmade\nover\nand\nbecome\nfinalist in pageant of\n\"swans\"; win $250 K\nChallenge and reward\nannounced:\nbecome\nthe last apprentice\nand earn job with\nTrump Organization\n3. Contestants normally\n\ndivided into groups\nContestants\ndivided\ninto 2 groups of 8\nPlayers divided into 2\n\"tribes\" of 8\nWomen divided into 8\ngroups of 2\nContestants\ndivided\ninto 2 companies of 8\n(men vs. women)\n4. Weekly competitions\nWeekly group \"dates\"\nWeekly tribal challenge\nWeekly\non\ncompetitions\nWeekly\ncompany\ncompetitions\n5. Elimination by vote\nElimination; 4 then 6\nLosing tribe votes off\none member\nLosing swan voted out\nby\n\"dream\nteam\"\nexperts; winner on to\npageant\nLosing company sent\nto\nboardroom;\nelimination by Trump\n6. Number of players\n\nbelow certain point;\n\nnew game plan\nNumber of players at\n8;\nnew\n\"beaus\"\nintroduced; special 1\non 1 dates, and 2 by 2\nelimination.\nNumber of players at 10;\ntribes\nbecome\none;\nimmunity\nchallenges\nintroduced; 1 eliminated\nweekly\n8 swans remaining; 1st\nAnnual Swan Pageant\ntakes place\nNumber of players at\n8; shuffle companies,\nassign new leaders;\nincreasing difficulty\nin tasks\n7. Final challenge\nSpecial 1 on 1 nights\nfinalists\nin\nfinal\nchallenge\nFinal challenge is to\nwin pageant\nFinal\nchallenge\nbetween 2 finalists is\nto become CEO of\n\"event\"\n8. Winner crowned\nFiance chosen\nSurvivor chosen from\nfinal 2 by vote\n\"Ultimate\nSwan\"\ncrowned\nApprentice crowned;\noffered \"dream job\"\n\nAs Table 1 illustrates, all four shows follow the proposed structure closely. Average Joe,\nan \"unscripted relationship drama,\" presents a love story that, with all but small variations,\nadheres to the same structure as Survivor, a Darwinian survival show.1 This holds true for the\nother programs with seemingly different plots and motivations. Whereas in Survivor it is\nsurvival of the fittest, in The Swan, it is survival of the prettiest. The Apprentice seeks out the\nsavviest and wisest of businessmen, whereas Average Joe rewards the savviest and wisest of\nromantics. These reality programs, then, while attempting to transmit a different message, all\n\n1 The Average Joe Website: http://www.nbc.com/Average_Joe/about/index.html (accessed on May 3, 2004).\n2 The Survivor Website: http://www.cbs.com/primetime/survivor8/index.shtml (accessed on May 3, 2004).\n3 The Swan Website: http://www.fox.com/swan/home.htm (accessed on May 4, 2004).\n4 The Apprentice Website: http://www.nbc.com/The_Apprentice/ (accessed on May 3, 2004).\n\nshare a common narrative structure that is embraced by television producers and audiences alike.\nIn this sense, they closely resemble the Russian folktales analyzed by Propp (1968).\n\nWhat is of special interest in this analysis is not the similarity between this contemporary\nform of narrative and that of Propp and Colby, but rather, their dissimilarity. In \"A Partial\nGrammar of Eskimo Folktales,\" Colby (1973) explains that his proposed grammar (taken to be\nstructure) \"[applies] to the folktales of all Eskimo, but not to the folktales of neighboring\npeoples.\" Conversely, this structure of (competitive) reality programming seems to apply across\nmany cultures and in many languages around the world. Apart from England and Australia, a\nhost of other nations including (though not exclusively) France, Greece, and Morocco offer\nextremely similar programming. While this may be a result of ratings-hungry producers, it goes\nto show that there is a common interest in this particular form of narrative in different cultures of\nthe globe. Further analysis of this phenomenon would be of interest.\n\nReferences:\nColby, Benjamin N., \"A Partial Grammar of Eskimo Folktales,\" American Anthropologist 75:\n645-662, 1973.\nPropp, Vladimir, Morphology of the Folktale, Austin, TX: University of Texas Press, 1968."
    },
    {
      "category": "Resource",
      "title": "a5.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-212-myth-ritual-and-symbolism-spring-2004/82014d96d35a36c62442ff4c3f43d0df_a5.pdf",
      "content": "Orlando Jaquez\nApril 26, 2004\nProfessor James Howe\nSecond Field Assignment\n\nPriest as Chief\nThe Rite of Homily as Guidance Tool\n\nOn Easter Sunday1 2004, I had the opportunity of attending a Catholic Mass at a church in the\nwestern suburbs of Boston. This visit, while admittedly pious in nature, allowed me to (in the\nmetaphorical sense) kill two birds with one stone. Not only was I able to fulfill my religious\nobligation, but I also managed to perform fieldwork and observe a well-known ritual firsthand.\nLuckily for me, it also allowed me the opportunity of obtaining a transcript of the sermon, which\nwill be used in this paper with his permission. In this short piece, I present an analysis of Catholic\nMass liturgy, in particular of the rite of Homily, and I argue that through the Homily, the Catholic\npriest, as the ritual leader, plays a key role in the preservation and reassertion of the Faith.\n\nRitual study - understanding the ritual form and its function - has become an\nincreasingly important area in anthropology, and has served as a major analytical tool for the\ngreatest minds in the field since its inception (Bell 1992: 3). Ritual is ubiquitous in all societies,\nand so, the study of rituals serves as a sort of spy-hole into the \"cultural dynamics by which\npeople make and remake their worlds\" (Bell 1992: 3). In the world of religion, in particular,\nritual study has been especially useful, as ritual is considered (by some) to be \"the ground from\nwhich religion grows\" (Rappaport 1999: 26). I tend to agree with Anthony Wallace's statement\nthat, \"it is ritual which accomplishes what religion sets out to do,\" and is thus, the primary\nphenomenon of religion (1966: 102). Religion, then, is kept alive, not by the mere belief in the\ndivine or the sacred, but by the performance of religious rituals. While these views of religion\nand ritual may not be universal, it is nonetheless my own belief that ritual, by any definition, is a\nfundamental feature of the religious experience. In fact, all studied religions have a defined\nsystem of rituals that serves to provide \"an aura of facticity\" to religious beliefs (Geertz, 1973:\n\n1 The holy day of Easter marks the end of a 40-day period of Lent, and symbolizes the resurrection of the Christ\nafter the third day of his death (See Elliott 1995).\n\n90). It is important to note that while a number of definitions of ritual exist (Frits Staal defines it\nas \"pure activity, without meaning or goal\", Levi-Strauss as \"a favored instance of a game\")2,3, I\nwill adopt Roy Rappaport's general statement, which is described in his book, Ritual and\nReligion in the Making of Humanity (1999: 27):\n\"[Ritual is] the performance of more or less invariant sequences of formal acts and utterances not\nentirely encoded by the performers [that] logically entails the establishment of convention, ... the\nconstruction of time and eternity, the representation of a paradigm of creation, the generation of\nthe concept of the sacred and the sanctification of conventional order, the generation of theories of\nthe occult, the evocation of numinous experience, the awareness if the divine, the grasp of the\nholy, and the construction of orders of meaning transcending the semantic.\"\n\nBy this definition, the Catholic religion is filled with ritual. In fact, the Catholic Church\nhas defined in great detail a set of rituals - a Sacramentary - that function to establish the\nreligion's \"aura of facticity\" that Geertz describes (Elliott 1995). The Sacraments - Baptism,\nCommunion, Confirmation, Penance, Anointment of the Sick, Holy Orders, and Matrimony - are\nthe principal rites of the Catholic faith, and function to define membership in much the same way\nas the rites of passage described by Turner (1967) and Van Gennep (1909). Communion, and to\na lesser extent, Penance, are calendrical rites. That is, these sacraments are performed regularly\nand normally adhere to a defined schedule (Rappaport 1999). The remaining five are non-\ncalendrical and occur only as responses to events in, or at different stages in life. For the sake of\nbrevity and in the interest of focus, I choose to only address the ritual of Communion, or the\nMass, and more specifically, the rite of the Homily (the sermon).\nThe modern Catholic Mass is itself divided into a series of minor rites. These rites are\ninvariably repeated at every mass, with few exceptions not herein discussed. I shall only provide\na brief review of these minor rites, as I am principally concerned with the Homily. The mass\nopens with the Introductory Rites: the entrance hymn, the greeting, the penitential rite, the kyrie\n\n2 Frits Staal, \"The Meaninglessness of Ritual,\" Numen 26, 1976. (Obtained from Bell 1992)\n3 Claude Levi-Strauss, The Savage Mind, trans. George Weidenfield and Nicholson Ltd., University of Chicago\nPress: Chicago, IL, 1966. (Obtained from Bell 1992)\n\neleison (congregation's prayer for forgiveness), the Gloria (a praise of God), and the opening\nprayer (a prayer that is peculiar to the day). 4 Following the Introductory Rites, the congregation\nengages in the Liturgy of the Word: the First Reading (from the Old Testament), the Second\nReading (from the New Testament), the Gospel and Acclamations (from the Book of Matthew,\nMark, Luke, or John), the Homily (the priest's sermon), the Credo (usually a recital of the\nNicene Creed, which restates the Faith), and the Intercessions (business of the Parish and special\nneeds). The Liturgy of the Eucharist follows, and includes: the preparation of the altar and gifts,\nthe Sursum Corda (prayer calling attention to the congregation to \"lift up [their] hearts\"), the\nPreface and Sanctus (prayer of the angels), the Eucharistic Prayer (which calls for\ntransubstantiation of bread and wine), and the Mystery of the Faith (a proclamation of the\nmystery of Christ's resurrection). At this point in the Mass, the bread and wine are said to be\ntransubstantiated into the body and blood of Christ, respectively. The mass concludes with the\nrite of Communion (Lord's Prayer, Taking of the Bread, and Prayer after Eucharist) and the\nDismissal (See Elliott 1995).\n\nThe Homily, however, is of special interest to me. During this sermon, the priest\nnormally addresses one, or a set of the readings presented during the Liturgy of the Word. I find\nthis single rite particularly interesting, because it differs substantially from the others in the\nMass. The Homily is the only non-scripted segment of the ceremony that is intended to have\ninstructional meaning. That is, during the Homily, the priest is able to offer his personal\ninterpretation of the readings, and more importantly, of the religious moral of these readings.\nThis rite, then, provides the priest with a powerful window of opportunity in which to address the\nspecific topics he deems important.\n\n4 The actual order of mass can be found at: \"The Order of Mass: Basic Text for the Roman Catholic Eucharist,\nhttp://clawww.lmu.edu/faculty/fjust/Mass.htm (accessed April 20, 2004), and \"Mass (liturgy)\",\nhttp://encyclopedia.thefreedictionary.com/Mass+(liturgy) (accessed April 20, 2004).\n\nDuring my visit to the St. Julia Parish (Weston, MA), I had the fortune of obtaining a\ntranscript of Father X's sermon. Just as Father X did on Easter Sunday, a Catholic priest can\nprepare a weekly \"lesson\" for his congregation. And with this weekly lesson, the priest plays a\ncrucial role in maintaining the Catholic religion's \"facticity\") through three non-exhaustive,\napproaches: the use of easily understood vernacular and real-world examples, the selective\nelucidation or decoding of religious metaphors, and the use of rhetoric.\nLooking at Father X's transcript, the utility of the first approach was immediately\napparent. In his opening, the Father begins with two simple examples of what he considers to be\nthe phenomenon of Easter.5 The first example, that which suggests that feast of Easter is similar\nto winning a lottery, uses the lottery metaphor to convey to the audience that Easter is an\nunearned (thus universal) \"change for the better.\" With this, the speakers suggests that Easter\nshould evoke in a person the same excitement and pleasure felt when winning the lottery. As a\nresult, the congregation is able to compare the abstract notion of inheriting new life from Christ\nto the more plausible (though admittedly not by much) lottery scenario. The Father repeats this\nexercise in the second example. He translates the abstract notion of the new life of Christ in the\nPope to the real example of the Pope's blind forgiveness of the worst of sins.\nFather X. uses the second approach of selectively deciphering and elucidating the\nmeaning behind Catholic symbols when explaining the meaning of Baptism. Much like the\nKuna chief (and his interpreter) described by Howe (1977), Catholic priests often choose to\nexplain a concept rich in symbols, in terms of a smaller subset of these symbols, which they feel\ndirectly applies to the day's lesson. In his Easter sermon, when explaining the concept of\nBaptism and its ties to Easter, Father Evans only chose to decode the symbols of Baptism that\n\n5 Though not necessary, the reader should know that the readings for Easter Sunday 2004 included: Acts 10:34a, 37-\n43; Colossians 3:1-4; John 20:1-9.\n\nwere directly relevant to the topic of Easter. So, in describing Baptism, he placed heavy\nemphasis on the idea of incorporation of the baptized into the Body of Christ - an incorporation\nthat is reinforced every Easter. What is more, the Father cleverly maintains this line of thought\nthroughout the entirety of the sermon, reinforcing specific characteristics of Easter and Baptism,\nso as to produce an extremely coherent lesson on the Church's oneness with God.\n\nFinally, Father X. illustrates the use of rhetoric as a tool for persuasion and guidance. A\nclear feature of his sermon is the use of a rhetorical question, which is quickly followed by his\npersonal answer to that question. This technique, along with the persistent repetition of key\nconcepts, allows for an extremely convincing lesson. By asking, \"what is so special about\nBaptism...\" and quickly providing a host of answers to the question, the priest was able to instill\na great deal of knowledge on the congregation, without allowing for little questioning.\n\nWith this case study I have shown that the Homily is the vehicle with which the priest\ndrives his audience toward the \"right\" direction. With the sermon, he is able to selectively\nreinforce a different aspect of the Faith, so as to rejuvenate the \"aura of facticity\" of areas that\nmay be lacking. All in all, as the leader of the ritual, the priest is able to lead his congregation in\nthe direction he deems appropriate. In this sense, the Catholic priest shares qualities with a tribal\nchief that uses sermon to lead his village along a certain path (as we see with Howe's Kuna\n(1977)), or with a ritual leader that asserts the facticity of a faith through his sermon (as we see\nwith Turner's Ndembu doctors (1967).\n\nREFERENCES:\n\nBell, Catherine, Ritual Theory, Ritual Practice, Oxford University Press: New York, NY, 1992.\n\nElliott, Peter J., Ceremonies of the Modern Roman Rite: The Eucharist and the Liturgy of the\nHours: A Manual for Clergy and All Involved in Liturgical Ministries, Ignatius Press: Ft. Collins,\nCO, 1995.\n\nHowe, James, \"Carrying the Village: Cuna Political Metaphors,\" In The Social Use of\nMetaphor: Essays on the Anthropology of Rhetoric, David J. Sapir and J. Christopher Crocker\ned., University of Pennsylvania Press: 1977.\n\nMorris, Brian, Anthropological Studies of Religion: An Introductory Text, Cambridge University\nPress: New York, NY, 1987.\n\nRappaport, Roy A., Ritual and Religion in the Making of Humanity, Cambridge University Press:\nNew York, NY, 1999.\n\nWallace, Anthony F. C., Religion: An Anthropological View, Random House, Inc.: New York,\nNY, 1966."
    },
    {
      "category": "Resource",
      "title": "a7.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-212-myth-ritual-and-symbolism-spring-2004/79d302f329d0e5b6232bbd6e150b2600_a7.pdf",
      "content": "Orlando Jaquez\nMay 5, 2004\nProfessor James Howe\nProppian Analysis\n\nPropp and the Folktale of \"Reality\" Television:\nToward a Structure of Reality Shows\n\nThe beautiful, the savvy, the romantic, the fit. These are the heroes of television's new\nobsession, reality television. For the past five years, world television audiences have been\ndeluged by these unlikely heroes and their so-called \"reality shows,\" each equipped with its own\ndrama, challenge, and reward. In the United States, it truly takes serious effort to avoid a reality\nprogram during primetime hours. The same is true in other nations with well-developed\ntelevision industries. England's top channel, BBC, is a renowned creator of reality shows, while\nAustralia's Seven is set to produce 15 reality shows in the coming seasons (David Dale, 2004).\nThese reality programs, however, are nothing more than a new type of narrative, a new\ntype of storytelling that aims to mimic reality. Much like any folktale or myth, or like any soap\nopera or sitcom, reality shows are fantastic tales with fantastic heroes. Reality television then,\nshould be treated not as a modern documentary of human behavior, but rather as a new genre of\nstorytelling. And in treating these shows as stories, I argue that these contemporary tales, as do\nthe folktales described by Vladimir Propp (1968) and Benjamin Colby (1973), invariably follow\na simple, yet well-defined structure - a \"magic formula\" for reality television. This analysis\nprovides a brief outline of this magic formula and illustrates it through four well-known\n(seemingly different) reality shows: Average Joe, Survivor, The Apprentice, and The Swan.\nMany types of reality shows exist. While some simply follow humans on their daily\nroutines, most are competitive in nature. This analysis focuses primarily on the competitive\ngenre, and recognizes that this structure may not apply to all other genres. The competitive show\n\nwill often contain a standard set of components: a host, who serves as the story's narrator; the\ncompetitors, one of which will be the story's hero; the challenge or challenges; and the reward,\noften in form of a person, but mostly in some form of monetary compensation. These elements\noften appear in a highly predictable order, which I will call the structure of these reality shows.\nThis structure can be broken down to eight subcomponents (events):\n1. A number of contestants (16 in all the cases studied) are\nbrought together to compete against each other for a common\nreward.\n\n2. A challenge is introduced.\n\n3. The contestants are normally divided into groups. In most\ncases studied, the groups were divided into groups of 8, but\nThe Swan was a notable exception, where the 16 contestants\ncompeted in groups of 2.\n\n4. The two teams compete each week in smaller challenges, with\nthe object of eliminating a player.\n\n5. Elimination is usually carried out by a vote or personal\ndecision.\n\n6. When the number of contestants falls below a certain point, a\nnew game plan is instituted.\n\n7. A final, \"ultimate\" challenge takes place between the finalists\n(2 in most cases, 8 in the case of The Swan).\n\n8. A winner (the \"hero\") is selected and rewarded.\n\nThis order of events is conserved throughout the programs, and is thus the backbone of this genre\nof narrative. Below is an illustration of how four programs, all seemingly different in content,\nfit this structure. It is presented in table format for the sake of brevity (Table 1).\n\nTable 1. Narrative structure of four reality shows\n\nProposed\nStructure\nAverage\nJoe1\nSurvivor2\nThe\nSwan3\nThe\nApprentice4\n1. Contestants\nare\nbrought together to\ncompete for common\nreward\n16 men brought to\nmansion\ncontestants\ngather\ntogether in a remote\nlocation\nwomen\n(ugly\nducklings) chosen and\ntaken to mansion\nprofessionals\ngather\nin\nTrump\nboardroom\n2. Challenge;\nreward\n\nintroduced\nMeet\n\"bacholerette\"\n(challenge & reward);\nwin $1M\nChallenge and reward\nintroduced:\noutplay,\noutlast,\noutsmart\nfor\n$1M\nChallenge and reward:\nbe\nsurgically\nmade\nover\nand\nbecome\nfinalist in pageant of\n\"swans\"; win $250 K\nChallenge and reward\nannounced:\nbecome\nthe last apprentice\nand earn job with\nTrump Organization\n3. Contestants normally\n\ndivided into groups\nContestants\ndivided\ninto 2 groups of 8\nPlayers divided into 2\n\"tribes\" of 8\nWomen divided into 8\ngroups of 2\nContestants\ndivided\ninto 2 companies of 8\n(men vs. women)\n4. Weekly competitions\nWeekly group \"dates\"\nWeekly tribal challenge\nWeekly\non\ncompetitions\nWeekly\ncompany\ncompetitions\n5. Elimination by vote\nElimination; 4 then 6\nLosing tribe votes off\none member\nLosing swan voted out\nby\n\"dream\nteam\"\nexperts; winner on to\npageant\nLosing company sent\nto\nboardroom;\nelimination by Trump\n6. Number of players\n\nbelow certain point;\n\nnew game plan\nNumber of players at\n8;\nnew\n\"beaus\"\nintroduced; special 1\non 1 dates, and 2 by 2\nelimination.\nNumber of players at 10;\ntribes\nbecome\none;\nimmunity\nchallenges\nintroduced; 1 eliminated\nweekly\n8 swans remaining; 1st\nAnnual Swan Pageant\ntakes place\nNumber of players at\n8; shuffle companies,\nassign new leaders;\nincreasing difficulty\nin tasks\n7. Final challenge\nSpecial 1 on 1 nights\nfinalists\nin\nfinal\nchallenge\nFinal challenge is to\nwin pageant\nFinal\nchallenge\nbetween 2 finalists is\nto become CEO of\n\"event\"\n8. Winner crowned\nFiance chosen\nSurvivor chosen from\nfinal 2 by vote\n\"Ultimate\nSwan\"\ncrowned\nApprentice crowned;\noffered \"dream job\"\n\nAs Table 1 illustrates, all four shows follow the proposed structure closely. Average Joe,\nan \"unscripted relationship drama,\" presents a love story that, with all but small variations,\nadheres to the same structure as Survivor, a Darwinian survival show.1 This holds true for the\nother programs with seemingly different plots and motivations. Whereas in Survivor it is\nsurvival of the fittest, in The Swan, it is survival of the prettiest. The Apprentice seeks out the\nsavviest and wisest of businessmen, whereas Average Joe rewards the savviest and wisest of\nromantics. These reality programs, then, while attempting to transmit a different message, all\n\n1 The Average Joe Website: http://www.nbc.com/Average_Joe/about/index.html (accessed on May 3, 2004).\n2 The Survivor Website: http://www.cbs.com/primetime/survivor8/index.shtml (accessed on May 3, 2004).\n3 The Swan Website: http://www.fox.com/swan/home.htm (accessed on May 4, 2004).\n4 The Apprentice Website: http://www.nbc.com/The_Apprentice/ (accessed on May 3, 2004).\n\nshare a common narrative structure that is embraced by television producers and audiences alike.\nIn this sense, they closely resemble the Russian folktales analyzed by Propp (1968).\n\nWhat is of special interest in this analysis is not the similarity between this contemporary\nform of narrative and that of Propp and Colby, but rather, their dissimilarity. In \"A Partial\nGrammar of Eskimo Folktales,\" Colby (1973) explains that his proposed grammar (taken to be\nstructure) \"[applies] to the folktales of all Eskimo, but not to the folktales of neighboring\npeoples.\" Conversely, this structure of (competitive) reality programming seems to apply across\nmany cultures and in many languages around the world. Apart from England and Australia, a\nhost of other nations including (though not exclusively) France, Greece, and Morocco offer\nextremely similar programming. While this may be a result of ratings-hungry producers, it goes\nto show that there is a common interest in this particular form of narrative in different cultures of\nthe globe. Further analysis of this phenomenon would be of interest.\n\nReferences:\nColby, Benjamin N., \"A Partial Grammar of Eskimo Folktales,\" American Anthropologist 75:\n645-662, 1973.\nPropp, Vladimir, Morphology of the Folktale, Austin, TX: University of Texas Press, 1968."
    },
    {
      "category": "Resource",
      "title": "animals.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-212-myth-ritual-and-symbolism-spring-2004/03f41334456b1b3a66d46a170c003047_animals.pdf",
      "content": "8, 9, 10. ANIMALS (3/01, 3/03, 3/08)\n\nIn the next section of the course, we will primarily be looking, not at formal kinds of\nsymbolism like tropes but rather at kinds of symbolism based on what domains or fields\nin life they draw on.\nWe will look primarily at animals and the human body, with glances at food, color,\narchitecture, and place\nWe will be concerned both with how we draw on those domains in order to make\nsymbols about other things, but also how those things are themselves invested with\nmeaning.\nAlso, as we work through animal and body symbolism, we will also recognize some other\nsymbolic forms or mechanisms like the three tropes\n\nAnimals in Cocle polychrome pottery\nAncient Panama is famous for two kinds of art, small gold pieces and polychrome pottery\nThe polychrome pottery is most of all associated with the Sitio Conte, an archaeological\ndig in western Panama on the estate of Sr. Conte excavated in 1930s.\nMany of the designs on the pottery are of highly stylized animals\nand many of the excavated pots are associated with mass burials\n(See the illustration).\nTo understand the symbolism of the animals, we cannot turn to ancient manuscripts or\nhieroglyphic writing, as is sometimes possible in ancient Mexico and Guatemala, because\nthere are none in Panama\nAn archaeologist, Olga Linares, deciphered some of the symbolism based purely on the\ndistribution of the animals, which are included or excluded, and their place in the burials\n(\"Animals That Were Bad to eat Were Good to Compete With\" in Ritual and Symbol in\nNative Central America, P. Young & J. Howe, eds., U. of Oregon Anthropological Papers\n9, 1976, pp. 1-20; 1977, Ecology and the Arts in Ancient Panama, Dumbarton Oaks.)\n\nWe can do the same, with a little thought and work.\n\nAnimal Motifs in Cocle Pottery\n\nAnimals that are represented: stingrays, sharks, ticks, turtles, deer with antlers, frogs,\nworms, needlefish, crocodiles, jaguars, crabs, hawks, curassows (large forest birds with\nbig crests)\n\nQ. So what do all the animals or some of the animals have in common? Not all same\nsize, because range from crocodiles down to ticks; not in one genus or family.\nSeveral are dangerous to humans or even might eat them (sharks, rays, needlefish,\ncrocodiles, big cats)\nSome are small but aggressive and/or pinch or sting (crabs, scorpions, ticks)\nSome are no danger to us but obvious predators (hawks, frigate birds)\nSome are poisonous or repellent (snakes, worms, frogs) (Some bright-colored tropical\nfrogs highly poisonous)\nAnimals that might be seen to have weapons (crabs, ticks) or hard parts, defensive\n(turtles, armadillos, crustaceans)\nQ. If we turn the question backwards, what sorts of animals are not there?\nNo everyday food animals---even though lots of their bones found in these sites\nFew or no animals with soft body parts (raccoons, rabbits, monkeys etc.)\nIn region there are two kinds of deer, horned and hornless---only horned deer depicted.\nNo song birds or butterflies.\n\nOne mystery animal, curassow, flashy jungle bird. May be relevant that very showy,\nmakes displays, also that it seems to \"charge\", also that very aggressive among selves\n\nRepresentation of animals highlights certain features: wings, claws, spines, teeth, beaks\norgans for running, grabbing, seeing etc.\npots found in mass burials, all adult males, evidently killed at same time\nAnd many of the pots have decoration only on the inside, in effect on the top\n\nWhat does this suggest about the symbolism of the animals?\nIn one way or another, all seem warlike, like animal warriors\nSeems to be burial of men fallen in battle\n\nGiven the lack of large temples and other buildings, the inference is a that this was not a\ncentralized society, a state or an empire, but a chiefdom, in which competed for power\nand prestige through war\nstingrays, both motif on pots and poisonous spines as points on spears\n\nAs we will see, quite a few cases of animal symbolism involve multiple animals.\nAnother and very famous case in readings, by Mary Douglas\n\nThe Abominations of Leviticus\nDouglas concerned with food taboos in the Book of Leviticus in Old Testament\nMost famous prohibition on eating pork, shared with Islam\nBut as in previous example, Douglas emphasizes the collectivity\n\nQ. What kind of metaphor is traditionally used to interpret the animals, which Douglas\nrejects?: allegory, each animal separately considered is a metaphor for one vice or virtue.\n\nQ. What is the classical explanation in terms of public health? Somehow they recognized\nthat pigs were dirty.\n\nQ. Is there a theme or overriding concern---like fierceness in war in the Cocle example---\nthat Douglas sees shaping the prohibited animals? Wholeness, physical and spiritual, as\na sign of holiness\n\nQ. What characteristics of animals are most significant?---not weapons or aggressiveness,\nas in Cocle example. Forms of locomotion, limbs, and body coverings, connected with\ndifferent environments, and different animal families: in water, fish, swim, fins but no\nlimbs, with scales; in air, birds, two legs, wings, fly; on land, four-legged, hop, jump, or\nwalk\n\nAnything with inappropriate limbs, coverings, or locomotion is yucky\n\nQ. What further restrictions are there for domestic animals? Prototype of good animals\nare herds---cattle, sheep, goats. Domestic animals must be cloven-hoofed and cud-\nchewers.\nEverything else is prohibited as food : both camels and pigs have cloven hoofs but do not\nchew cud.\n\nQ. Can you see any problems with this explanation or alternatives, esp. concerning pigs?\nWhy is the prohibition on pork so prominent and so intense? Is the fact that pigs don't\nchew the cud really powerful enough as a characteristic to explain disgust? If it is, why\nare pigs so much worse than camels, which also fail to chew cud? Why aren't really\nanomalous, disgusting animals that swarm and teem more prominent than humble old\npigs?\n\nThe pig taboo is shared with Islam, but not most of the rest of the prohibitions---is it an\naccident that this taboo is shared by two neighboring religions, and if not, why can't we\nfind explanation that encompasses both Islam and Judaism?\n\nHow do we know that the classification of animals came first and the prohibitions\nfollowed? Given the rationalizing ability of priests and prophets with time on their\nhands, they could have devised a system into which they folded a pre-existing taboos on\npork. Douglas assumes causality in other direction.\n\nCompeting theories: Marvin Harris and others have suggested that pigs, which are the\nonly major domestic animals that give no milk etc., provide just meat, are in long run esp.\ndegrading to environment. Even though religious prohibition doesn't mention\nenvironment, the culture is without anyone knowing it shaped by requirement---a form of\nexplanation called functionalist. Ban pigs for seemingly religious but actually\nenvironmental reasons. But goats do terrible damage in very short order---why are they\nnot prohibited and unclean?\n\nMany authors suggest that for some historical reason in past, pigs became marked as a\nboundary between peoples, and over time they became increasingly prominent, as need to\ndifferentiate self from foreigners and enemies continued. Doesn't matter how first\nfocused on pigs---once not eating pork marks boundaries between groups, then it will be\nperpetuated.\n\nDouglas' article one of the most widely read and cited in anthropology. Poor Mary\nDouglas went on to write many more things, develop her ideas in complex ways, but\nmany readers, especially outside anthropology, only know this piece.\n\nWhether she is right or not, Douglas shows us a very useful way of looking at animal\nsymbols systematically and as part of a particular society and culture.\nShe also introduces a key concept, liminality. A liminal animal (or food or anything else)\nis something anomalous or on the margins. It either combines attributes otherwise kept\nseparate, or at edges where one thing shades into another.\nA huge dinosaur in \"Jurassic Park\" or King Kong is scary, but a liminal wolfman or a\nmutant is creepy.\n\nA third and very different case concerns dogs in Victorian Britain.\n\nCave Canem\nOne chapter in a wonderful book, The Animal Estate: The English and Other Creatures\nin the Victorian Age(1987). Harriet Ritvo, at MIT.\n\nQ. What is the paradox of rabies, as Ritvo sees it? Not that dangerous to humans, and not\nthat common. Very few had any direct experience. But inspired panic. (even\npsychosomatic cases). \"more threatening as a metaphorical disease than as an actual\none\" (p.170).\n\nBrings us back to Sontag and way diseases imbued with metaphorical qualities. Rabies\nwas kind of contamination, connected with moral state of sufferer. Dogs as \"guilty\".\n\nSo what made dogs immoral, dangerous? fighting dogs, poaching dogs, \"curs\", pets of\nlower class.\n\nAlso foxhounds, associated with upper classes, who got to violate middle class morality.\nCf. New England Puritans, who minded very much that Indian men spent time hunting\ndeer, which in England was pastime of leisured immoral aristocracy.\n\nBut very threatening to think that middle class pets could transmit, in bosom of family, so\ndenial.\n\nRitvo goes on to discuss ins and outs of debate, different segments of middle classes\ntaking different positions. For all of them, dogs heavily imbued with meaning.\nGreat deal to do with social boundaries, in this sense brings us back to Leviticus, though\nparticulars very different.\n\nWhat Ritvo doesn't do is bring story up into 20th century, when anti-rabies measures\nbecame barriers not between classes but between English and foreigners. Six months\nquarantine of dogs brought into UK, even though ten days sufficient to detect rabies.\nKennels had financial interest in preserving ban, but not complete explanation. Rabies\nwas French threat, infected French foxes and French dogs. Restrictions on horses much\nweaker. Rabies law changed only in last few years.\n\nMuch more recently, smaller scale in eastern US, rabies swept through raccoons, killed\nmany or most, but for while didn't cross onto Cape Cod; opposition to tourist hordes\nexpressed in immunity to rabies, though later sick raccoon presumably made it across one\nof the bridges.\n\nQ. What other animal disease scare? Mad cow disease. Tremendous concern, though\nactual number of humans thought to have died from it very small, drop in bucket\ncompared to cars or heart attacks. But insidious, it crosses species boundaries. Weird\nsymptoms.\nWhen first outbreak in late '80s, French and Germans stigmatized as a British disease,\nbragged of absence on continent. Some experts thought they were actually covering up\noutbreaks in own countries, greater danger from unacknowledged local outbreaks. Joke\nthat when \"Chunnel\" under Channel was completed, a rabid French fox would bite a mad\nBritish cow somewhere in the middle.\n\nUnited States gave up idea of sea level canal in Panama in part because of fears of sea\nsnakes (in cobra family) moving from Pacific to Atlantic.\n\nQ. What dogs are sources of fear and contamination today in U.S.? Rottweilers, Pit\nBulls. Owners' fantasies of aggression, others' fears. But not just fear of danger, is\nsocial class, immorality of raising dogs to fight.\n\nQ. What about \"urban legends\"? Are there dangerous animals? Most famous story about\nChihuahua that turns out to be a rat. Like many other urban legends, disquieting moral\nabout threats to boundaries, about world of social dangers, about false appearances,\ncreepiness of other people and things.\n\nObviously, to understand animal symbolism, often have to know about humans with\nwhich associated: both sides connected with and sometimes equated with each other.\nAlso have to know habits of animals, how used, how controlled or not.\n\nIn many Third World countries there are many stray, feral dogs, either individuals or in\npacks. Symbols of contamination and danger. Famous novel, Under the Volcano, by\nMalcolm Lowery, Mexican pariah dogs as menace. In rural US, fear and hostility toward\nroaming dogs, sometimes shot on sight.\n\nIrony that strays may resemble original association with humans thousands of years ago,\nhow dogs may have been domesticated: not kept by individuals, but rather hung around at\nmargins of camp or village, scavenged, learned to placate humans.\n\nSo we have some examples. Also others from previous classes, e.g. Bororo macaws.\nWill be others in later sections.\n\n* * *\nAnimals have features of several sorts that make them apt subjects of symbolism.\nHowever, for many years, anthropologists concentrated heavily on one aspect of animal\nsymbolism, the use of different kind of animals to represent human groups.\n\nInteresting in part because shows how possible for field to go off on side track for many\nyears, waste time and energy\n\nbegan in 19th century, decided that there was something called totemism. Was based on\nNative American word, typically got word wrong. Survives in our term for carved\n\"totem poles\" of NW Coast peoples.\nAt root was human kin groups named for animal species. Bear clan, eagle clan, etc.\nOther things were thought to go with naming in a totemic complex: exogamy, i.e.\nmarrying out of one's own group; taboo on eating animal; belief that it was group's\nancestor; other beliefs and taboos and rituals relative to totemic animal.\n\nSo idea of totemism became way of understanding animal symbolism. became widely\nrecognized complex, even seen as origin of religion. Every theorist had a go at\nexplaining totemism.\n\nMcClellan, 19th century theorist, did much to get concept established. Had entirely\nspeculative theory. Said people originally lived in primal hordes. Through speculation,\nthey decided that ancestor was an animal. They killed female babies, which created\n\nshortage of women, which led to polyandry, i.e. several men marrying one woman. But\nthen conflict within the group causes it to split up. Men of different groups try to get\nwives by stealing from other groups, eventually leads to rule that one must marry out of\nown group. Each group had own totem, led to system of intermarrying clans.\nCompletely speculative, today looks ridiculous.\n\nJames Frazer, great popularizer of anthropology, esp. in The Golden Bough. He tried out\nseveral theories. Last one: primitive man didn't understand connection between\nintercourse and childbirth. So how could he explain where children came from?\nAttributed child to whatever animal mother saw last before birth. So totemism based on a\nmistake in reasoning.\n\nSigmund Freud, in his worst book, Totem and Taboo. Primal horde, living on plains.\nThe patriarch, daddy, hordes all the women, including own daughters. Frustrated sons\nultimately kill and eat him and have sex with all the women. Then they feel remorse,\nwhich was the basis for the incest taboo and worship of totem. Freud inconsistent\nwhether this had actually happened.\n\nEmile Durkheim, great French social scientist, Elementary Forms of the Religious Life\n(1912), discussed above. People living in horde felt power of group, esp. in group rites.\nTotem, and later deities, are simply a symbolic representation of the group and its social\npower. In literal form, theory no more correct than others, but led to very useful\ntheorizing about society and religion.\n\nFunctionalists, esp. British social anthropologists between 1920 and 1950. One\nfunctional explanation: totems were animals that useful to society, good to eat and use.\nBut when pointed out that some totem animals negative or harmful, they answered that\ntotem animals either really good or really harmful. Functional explanations of this sort\nare often ad hoc, slippery. But then pointed out examples where animal pretty neutral:\nobscure worm or bird that appears briefly once a year.\n\nAnother line of thinking, comes from Durkheim and partner Mauss, work we will read in\npart soon. Seeing totemic classifications of animals etc. as basis for ability to classify in\ngeneral, ultimately derived from group. Also wrong, but got theorists thinking about\ntotemic classifications as systems of ideas. British anthro, usually functionalist,\nRadcliffe-Brown, suggested that differences between animals, white cockatoo vs. black\ncrow, were used to represent differences between groups. What important not the\nrelationship of single animal to particular group, but the whole system of animals and\ndifferences among them.\n\nPicked up by Claude Levi-Strauss. famous phrase, animals less good to eat than good to\nthink. Analyzed as systematic classification, a constellation of animals making coherent\nsymbolic whole. Very useful, provocative idea. Some of examples we have looked at,\nLeviticus and Cocle analyses, very much in that tradition.\n\nHis classic example, Bear, Eagle, and turtle clans, earth/air/water. But over time logic of\nsystem may be obscured. Bear clan dies out, turtle clan grows and splits, leaves Eagle\nclan and two different kinds of turtle. Logic of system obscured. Neat but completely\nspeculative explanation.\n\nProblem was that in many instances didn't work that way at all. Where many totems but\nkept secret: how could they form system if no one knew? In a case from Australia where\nan anthro observed addition of new totems, didn't follow L-S's logic.\n\nEven though L-S denied that there was really a single totemic complex, he went on to act\nas if there was. But he was right to deny reality of totemism. There are really a great\nvariety of associations between animals and humans. To insist that they were all part of\none complex called totemism was really an intellectual dead end, though at least some of\nthe approaches tried out had useful implications.\n\nAnimals are good to think and good to prohibit\nThe title of the reading by Tambiah obviously plays off of L-S's famous aphorism\nQ. What does T tell us about practical implications of \"totemic\" classification of animals?\nHow does connection to marriage rules and eating matter? What about location in house,\nand movement from one place to another by animals, especially invasion?\n\nHummingbird transformations\nTo understand animal symbolism, often have to know good bit about habits,\ncharacteristics, also about how contrasts with other animals\nEva Hunt, deceased anthro who taught at Boston University, found little poem about\nhummingbird among Mayan group in town of Zinacantan, Chiapas, Mexico\nFunny little poem, said hummingbirds were big, not little, white rather than brightly\ncolored\n\nDon't you believe that it is little, it is big\n\nJust like a dove its wings are white\n\nAll of it is white.\n\nThe poem ends up calling the hummingbird one-legged\n\nHunt started to write an article to explicate poem, ended up doing whole book (The\nTransformation of the Hummingbird, 1977)\nOne key to deciphering poem was discovery that in much of region, ancient civilizations\nas well as modern, the hummingbird was associated with sun, and with Aztec sun god,\nwho was also god of war\nDepends on whole series of observed similarities between sun and hummingbird:\n-like sun, hummingbirds not out at night\n-hummingbirds shine brilliantly like sun\n-hummingbirds are fierce little things, so like war god\n\n-hummingbirds can fly backwards or hover, unlike other birds; sun as it moves across sky\nover course of year seems to stop and then move backwards\n-hummingbirds take nourishment from flowers; flowers not peaceful symbol in\nMesoamerica; Aztecs had what called flowery war.\n-hummingbird beaks like thorns, which used for religious self-torture and sacrifice\n\n-Also different birds are associated with different seasons and colors:\nSpring with blue-green and hummingbirds; summer with white (doves) and hawks\n-Hummingbird is said paradoxically to be big and white because it transformed itself into\nhawk with change of season from Spring to summer.\n\n-Also complex associations and oppositions among flying animals: hummingbird vs.\nbats; hummingbird vs. Quetzal bird.\n-Quetzal bird emblem of famous god, Quetzalcoatl, supposedly peaceful; Sun god was\nwarlike, many human sacrifices offered to him, ripped out hearts.\n-Hummingbird is one-legged because sun god was lame or one-legged. Was also god of\nhurricanes and tornados---word hurricane comes from his Maya name. Tornados are\none-legged, so hummingbird symbolically is too.\n\nMany more complications. May not be totemic per se, but complex system of\ninterrelations between animals, which also linked to seasons, colors, and many other\nthings.\n\nHunt even has discussion of rabbits and drool and Mexican drink pulque.\nSo can see that decoding symbol may be immensely complex\nFortunately not always as difficult as in this case.\n\nCockfighting: opposed interpretations\n\nProbably the most famous and influential example, not just of the interpretation of animal\nsymbols, but of symbolic anthropology in general, is Clifford Geertz's reading of the\nBalinese Cockfight. In the readings, we have both G's article and an essay on\ncockfighting by a prominent folklorist, Alan Dundes, the conclusion to a reader D edited\nof articles on cockfighting around the world.\n\nD has a lot of criticisms of G, and the two offer diametrically opposed visions of how to\ninterpret symbols. In effect a little cockfight of their own, though G may not have known\nabout it.\n\nDundes and some other critiques of G say he read people's minds and put words in their\nmouth concerning what was going on in cockfight. Q. Do you think that's fair? What\nkinds of info is G using to get into the meaning of the event? The emotional tenor of the\nevent as he observed it. The nature of the betting. And then G's 17 numbered points (pp.\n437-440) on distribution of bets and antagonism etc. In no.17, he says the Balinese\nthemselves can articulate a lot of the claims in his article. So G may be incorrect or\npartial in his analysis, but D to the contrary, it's not as if G made it up out of whole cloth.\n\nD says G sees cockfight as \"a charter or articulation of social structure\". Q. Is that fair or\ntrue? G denies his interpretation is concerned with \"social mechanics\"---among other\nthings not a charter rationalizing or justifying things. When D talks about anthros and\ntheir supposed obsession with social structure (p. 272), he doesn't really get it. He sees\nanthros somehow relating some aspect of symbolism mechanically to support of, say\nkinship system, in way Radcliffe-Brown, famous functionalist, alleged that ancestor cults\nsupported descent systems. But G not concerned with anything that crude. Rather G\nconcerned with nature of social life, its rhythms, complexities, contradictions, with nature\nof people as social actors. That's why the article is so appealing to anthros. D just\ndoesn't get it. Also, the approach he espouses misses entirely how social systems work,\nthe dynamic nature of symbols. He just sees individual psychology.\n\nQ. So how does Dundes' approach differ from G's?\nD is strongly comparative. Denies that one can do an adequate job studying anything just\nwithin a single culture. Explicitly critical of anthropologists, ethnographic approach.\nConcedes in principle that there might variation in meaning from one culture to next, but\nin practice doesn't think so. G on other hand famous for digging into particular culture,\nfine-grained analysis of its idiosyncrasies. G also famously resistant to simple cross-\ncultural comparison.\n\nQ. What does D say the relationship is of folklore to culture? Says anthros follow idea\ninherited from Boas at beginning of 20th century, that folklore is a reflector of culture.\nSays in fact folklore can be a sanctioned escape from culture (p.248).\n\nQ. How might G reply? Doubt he would think that any culture was completely\nconsistent. Even departures or escapes from other aspects of culture are still part of the\ncultural whole. D has a very old-fashioned and limited idea of culture. G is very explicit\nthat the betting in \"deep play\" is quite different from normal Balinese behavior. They are\n\"playing with fire.\" D really oversimplifying G and making him into a straw man.\n\nQ. What does in fact G claim is relationship between cockfight and rest of culture? Is it a\ncharter, straightforwardly supporting and justifying? No. One of key points of idea (pp.\n448-453) is that the event should be seen as a text, \"saying something of something\", a\ncommentary, or in jargon, a meta-commentary of social life. Very different from what D\nsays.\n\nQ. So what does D see cockfight as about? Is a sexual contest between males, in all\ncultures. Cocks are proxies for men themselves. Pretty plausible, also G really supports\nthis interpretation more than D gives him credit for. Despite what D says, this\ninterpretation really not contradictory to what G saying, simply that G wants to go\ndeeper.\n\nD goes further into Freudianism, sees cockfight as masturbatory. Evidence for this seems\nmuch thinner, forced. Also, in classically Freudian way, D thinks if he finds this\nidentification at some level, then that that is the real truth, and the rest is just superfluous\n\nor cover-up. I think a cultural anthro like Geertz would say that idea that it is sexual\ncontest is obviously true but doesn't take you very far, and that if one finds hints that\nthere is a parallel between masturbation and cockfighting, that doesn't mean that it is\nnecessarily the absolute truth but rather one level among several. Dundes can't handle\nthe idea of multiple levels of symbolism and multiple meanings.\n\nThe opposition is less between two disciplines than between 2 different paradigms or\nmindsets or approaches found in number of disciplines, between reductionism (it's only\nabout X, it all boils down to X) and universalism vs. a particularistic, humanistic, and\n\"hermeneutic\" approach.\n\nWhy animals?\nQ. So what can we say about animals as vehicles for symbolism? They are often very\nstrong symbols. Q. What is it that makes them strong or absorbing symbols? (We may\nsay someone is prickly as a cactus, but we don't call him a dirty son of a cactus.) Q.\nWhat do we have to know about animals to understand them?\n\nAnimals are strongly associated with humans. Domestic animals, pets, farm animals.\nBut also wild animals. So, among other things, can talk about one in terms of other.\nAlso, some animals are so associated with us, it has been argued, that they may violate or\nthreaten the boundaries between wild and tame, nature and culture. They are inherently\nliminal.\n\nAnimals are associated with places. As in Douglas article. They may share or absorb\nsymbolism from location or movement. Irish exile mercenaries were called \"The Wild\nGeese\". Today in US, many geese stick around and poop and cause problems, very\ndifferent associations.\n\nThey may violate boundaries by invading space or by rejecting association with place---\nfox in the henhouse, strays and pariah dogs like humans with no fixed abode, bums,\ngypsies, etc. So animal symbolism overlaps spatial symbolism.\n\nAnimals come in species, identifiably different kinds. May seem obvious, but not\neverything in the world is so clearly differentiated. Different cultures agree for most part\non species boundaries among animals.\nThe differences between kinds of animal often used to mark social boundaries: One Jesuit\nmissionary recorded that Kuna said that roosters were roosters, jaguars were jaguars, but\nnow he didn't want to let them be Indians. Species boundaries often likened to human\nracial boundaries.\n\nHumans obsessed with drawing boundaries---class, ethnic, gender, national, racial.\n\nWe do tremendous number of things to animals: kill, eat, hunt, pickle, stuff and mount,\ndomesticate, train, experiment on. We get them to herd other animals, bark at intruders,\nkill pests, jump through hoops, leap over waterfalls, dive for fish, lead the blind, etc. etc.\nWe dock their tails, castrate them, dress them in bonnets, take their portraits, change their\n\nappearance drastically through selective breeding, put them on the Letterman show, feed\nthem bananas and periodically pluck their feathers. All of this provides a tremendous\nrange of potentiality for metaphor.\n\nEsp. eating. We put them in our mouths, take them inside ourselves. Another overlap:\nfood and animal symbolism.\n\nWe can create large variety of symbolic statements according to what we do to animals.\ne.g. Cattle-herding peoples of Sudan, primary symbolic act is animal sacrifice,\ncommunication between humans and spirit. If want to end feud, don't just kill animal but\nattack it, hack to pieces. If close cousins sexually involved and want to cut tie between\nthem, divide animal neatly down middle into two halves, separate. A symbolic idiom.\n\nWe also observe animals do many things to each other. many kinds of action and\nrelationship. Very apt for metaphorizing human relationships: predator/prey (cat and\nmouse, fox and rabbit, lion and gazelle); other antagonism (cat and dog); parasitism\n(shark and remora, lion and hyena, leeches)\n\nAnimals resemble us in ways that no other kind of symbol does. They eat, have sex, give\nbirth, fight, run, die. Even if a culture works overtime to keep up barriers between\nanimals and humans or denies the resemblance, it is always there, always powerful.\n\nNo wonder that animals are among the most pervasive and powerful domains for\nsymbolism.\n\nWe can do the same for other domains of symbolism. For food, we have no special\nsection in readings but comes up repeatedly, esp. in Tambiah article. We can also do a\nlot based on own experience.\n\nFood and symbolism\n\nQ. If we consider food as did animals, what can we say is distinctive about it, based on\nreadings to date, your own experience? brainstorm.\n\nWe ingest it, take it inside ourselves. Very potent form of use of symbol. Can establish\nan identification with us, with our bodies.\n\nCan have all the symbolic properties of the plants and animals from which it is derived.\nCan transfer qualities of natural world to our bodies. Or, as with host, the body of the\ndeity. Many many elaborations of symbolism according to what ingest: wide variety of\nhallucinogens in Americas. Siberian shamanism, consume own urine to conserve\nhallucinogens.\n\nQ. How do foods become markers of social boundaries and differences and group\nidentities? Ethnic identity thru metonyms discussed before---Beaners, Limeys, etc.\n\nElaboration of ethnic cuisines very important to identity. Also for social class, different\nfoods, different cooking, different etiquette for eating. Also, who you willing to eat with.\n\nCultures make all sorts of distinctions about what is OK or not OK to eat. Those in turn\ncan have all sorts of ramifications, establish all sorts of social distinctions. Leviticus.\nKuna drawn line between selves and Black merchant sailors they deal with in terms of\neating shark, which sailors do, Kuna even catch sharks for them, but which they find\nincredibly gross to eat. When Kuna hostile, might accuse me of eating shark too. With\nurban outsiders, Kuna point to things like salad, say eating greens is like a tapir in the\nforest---not as strong a distinction.\n\nUltimate distinction, ultimate taboo is on eating humans. Has been controversy in\nanthropology. Claim by anthro William Arens that, except in cases of starvation,\ncannibalism universally just a myth, or rather a slander. Peoples contacted by colonial\npowers would accused neighbors. Also used to stigmatize by colonial powers. Esp. early\nin Spanish empire, when laws forbad enslaving Indians unless shown that they were\ncannibals. Arens claimed that except when people starving, cannibalism unknown, but\nhe wrong, many well attested examples.\n\nAll sorts of symbolic statements are made through processing of things into food.\nDistinctions between everyday and special: boiling daily stew, broil for feast. Or by\ngender: with us, males grill. Or by social level: plain cooking for masses, complex\nprocessing, sauces etc. for elite. Levi-Strauss sees elaborate code in mythology:\nraw/cooked, roasted, boiled, baked, fried, rotten. Among chefs in 18th century France,\nconscious emulation in cooking of industrial processes.\n\nFood is connected with other processes, of body. Defecating, vomiting. In Kuna puberty\nceremonies, mother of girl must drink until she vomits, seems to be symbol of letting\ndaughter leave childhood, give up close control.\n\nPervasive metaphorical equation of eating and sex in many cultures.\n\nGift exchange is socially extremely important in all societies. (Gift is misnomer, often\nmisleads: they are non-market exchanges, even if don't fit our stereotype of gifts.) Food\nexchange and sharing one of most important forms of exchange. Sharing food often\ndefines the in-group, or marking fact that even stranger is under host's protection. Kuna\nused to see most disgusting thing about city life was restaurants, because can only get\nfood if pay.\n\nFinally, as Tambiah points out, many cultures link eating and sex"
    },
    {
      "category": "Resource",
      "title": "cosmology.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-212-myth-ritual-and-symbolism-spring-2004/65cf1ea69585bf6fb1ed185388c0a88f_cosmology.pdf",
      "content": "13. CLASSIFICATION AND COSMOLOGY\n\nStarting point today is famous work from 1902 by Emile Durkheim (already mentioned)\nand Marcel Mauss: we have excerpts in reading\n\nQ. What is the root problem D&M address?\nOrigin of ability to categorize, to divide up the world mentally into different kinds of\nthings. Basic issue, basic problem in philosophy\nTwo basic tendencies, to find origin of perception and classification in world itself, i.e.\nwe soak it up from what is out there, or to see categories in some way as already\nimplanted within us\nPerennial issue in Greek and European philosophy, in modern psychology\n\nQ. What is their answer? It is neither, rather found in society. This answer fits\nDurkheim, who was sociological imperialist, explained everything through society\n\nQ. What is the logic of their argument?\n1. They assume that world was originally a blur, indistinct\n2. assume that categorizing is not a natural ability\n3. first categories that presented to primitive people are groups in society\n4. changes in society lead to increasingly complex categories\n5. we can trace evolutionary changes in society through study of living primitives, who\nrepresent different stages in evolution. (Few anthros today believe this.)\n\nThey begin with Australian aborigines, who then thought to be simplest society (actually\nvery complex classifications and kinship system); division of society into just two parts.\nClassification of everything else follows, division of everything in world into two groups,\nlike two human groups\n(True that there are societies divided into two sides, typically one must marry person\nfrom other side, but not true that they are necessarily simple societies.)\n\n-Then more complex tribal societies (Zuni, Sioux), where more than two groups, and\ncategories also anchored to landscape\n-then complex premodern civilization, China, same kind of classification, but no longer\ntied to particular groups\n-and then to modern classifying, where detached from both concrete groups and from\nreligion\n\nWhole argument bogus. Original indistinction in premodern thought or at stage of life is\na myth. Some perceptual abilities we are born with.\nAlso, before one can perceive and categorize groups as distinct, one must be able to\nperceive and categorize in general. How could one discern that there are two separate\ngroups unless one could already perceive difference and number? D&M partially\nconcede this, say 'Well, maybe there was a little practical categorizing,' but once you\nmake that concession, whole argument implodes.\n\n-And the evolutionary sequence is imaginary.\n-Introduction to translation of volume by Rodney Needham shows that their scholarship\nwas generally shoddy\n\nBut paradox: they were wrong and slipshod but still very fertile source of ideas and\ntheories\nDidn't explain cognition or categorizing in general, but did start study of what came to be\ncalled symbolic classification, i.e. complex arrangements of symbols into wholes\nWe have already had a taste, with hummingbird example and others\n\nOften, as D&M show, divisions in one domain are replicated in another: divisions of\ncolor correspond to divisions of birds and divisions of seasons and quarters of universe\nand sections of town and parts of house and parts of body and parts of universe and so\nforth.\nVaries between societies just how relentlessly consistent they are, and how much build\ninto complex structures.\n\nWe have reading from Hertz, who was member of D&M's group\nQ. What does Hertz add to argument? ---recognition of almost universal differentiation\nbetween right and left, favoring of right hand.\nDifferentiation in treatment of the hands and what is done with them\nAnd in all orientations of all sorts\nQ. In what ways do we favor the right side in our society.\nDetails vary from society to society: one tribe in Sudan sometimes tie left hand for while\nto discourage use. But preference for right, opposition between sides universal\nQ. How does Hertz explain this? As follower of Durkheim, he insists on primacy of\nsocial elaboration of this difference, even if its ultimate origin might be in physiology.\n\nHertz also points us towards importance of opposition as one symbolic structure, whether\nor not it is found in an elaborate classification: opposition is often what going on between\ntwo elements in symbolism: not likeness or association but being set against each other.\nAs fundamental as metaphor, metonym or liminality.\n\nNature of opposition may also vary:\nMay simply be contrast, set off against each other\nBut may also be more fundamental logical or social contradiction (we will explore later)\n\nExamples of symbolic classification in preindustrial \"tribal\" societies\n\nComplex symbolic classifications are found in many tribal societies. One example from\nNorthwest Amazon, group called Cubeo, described by anthro named Irving Goldman\n(1963, The Cubeo).\nLive up and down rivers, in longhouses in clearings on riverbanks, whole community\nlives in one house\nMen marry women from another community\n\nBasic opposition is men versus women, us vs. them, but tied to other oppositions in\ncomplex ways\nJungle vs. river, river is more us rather than them.\nGardens vs. river. Gardens where raise manioc, they belong to women, so gardens\nassociated with women. esp. rapids in river, rocks, said to be home of ancestors.\nAgriculture (in gardens) vs. fishing and hunting---hunting associated with river because\nmen go in canoes, hunt near river.\nAdultery vs. licit sex. Adultery takes place in gardens, marital sex near river.\nIn-laws, affines vs. us---resident in-laws are the women in garden\nJaguar vs. ancestors---one from forest, dangerous, other from rocks in river\n\nSo the oppositions are lived, they are keyed to the environment and they make sense in\npeople's lives\n\nAnother tropical forest group but in Guianas of northern S. America, called Trio (Peter\nRiviere, 1969, Marriage among the Trio)\nSimilar concern with us/them, inside/outside. Also tied to environment, but in different\nway. Not river people.\n\nWary of outsiders but also drawn to visit them\nBasic divisions in Trio system are:\n\ninside/outside\nus/others\nour river/far river\nvillage/forest\nhouse/clearing\n\nConnected to seasons, in part because how they interact with outsiders depends on\nseasons:\n\nwet season (when rivers flooded, people stay at home, no travel) / dry seasons (travel,\ncontact)\nsoftness (ground soft, people act \"soft\") / hard (ground hard, act \"hard\" with outsiders)\nstill / active\nwood / stone\nhome fire (limited, controlled, warmth in rainy season) / burning fields (uncontrolled, big,\ndo burning in dry season)\n\nSimilar elements used in Trio classification as in Cubeo, but arranged in quite different\nway\nLike Cubeo, makes sense in terms of environment, lived as well as thought\nObviously, in a desert environment or place with no dry season, would have to be\ndifferent\n\nIn complex premodern and modern societies\n\nD&M were correct, symbolic classifications also found in complex societies\nIn fact, in preindustrial states like Aztec, Maya, traditional China, premodern Europe,\nthere is often a small literate elite, priests or clerks, who have the time and interest to\nmake increasingly elaborate systems\nVery typical of such societies\n\nTraditional Chinese symbolic classification, with four quarters, yin/yang, pervasive\nthrough Chinese culture: in medicine; in divination (I Ching); layout of towns and houses\n(Feng Shue)\nHas persisted through huge changes in politics and other aspects of culture, tenacious\n\nIn Europe, doctrine of humors, basis of medicine, from Greek physician Galen\nFour-part classification\nThe different humors had all sorts of correspondences in different domains:\n\nblood / choler / melancholy / phlegm\nunderstanding / opinion / perception / intellect\nair / fire / earth / water\nmoist / hot / dry / cold\nchild / youth / maturity / age\nfevers / vomiting / consumption / pneumonia\noptimistic / ambitious / pessimistic / apathetic\n\nCuring consisted in large part of counteracting imbalances between the humors\n\nMostly been supplanted in western culture, but remnants remain: for one kind of private\nschool with own mystique and methods, a booklet told teachers they could figure out\nstudents' personalities according to humors.\n\nMany other European examples:\npre-Socratic philosophers of Greece, before Socrates, Plato, and Aristotle\nExplained nature of world, changes, thru combinations of qualities like warm & hot etc.\n\nAstrology, still strong today, and alchemy both completely wrapped up in symbolic\nclassifications. Ditto modern \"reflexology\", correlates parts of foot with parts of rest of\nbody\nMedieval and renaissance magic too, esp. form of Renaissance magic called natural or\nplatonic. Inspired by revival of interest in Plato.\nAlso dominant mode of scholarly thought of medieval period, scholasticism, what\nNicolas Wey Gomez here at MIT called transcendental semiotics.\n\nFamous analysis of the 16th century encounter between Cortes and Aztec King\nMoctezuma by theorist Tzvetan Todorov, saw as clash between traditional, oral, religious\nworldview (symbolic classification) and modern, pragmatic, literate one. (1982, The\nConquest of America)\n\nWrong in two ways: early literacy often promoted rather than discouraged scholastic\nthinking, and 16th century Spaniards often still medieval mindset. Wey Gomez shows\nthat Columbus completely caught up in what we would see as mysticism, scholasticism.\n\nAlso at much more humble level. Peasants and townspeople in both Mediterranean world\nand Latin America often ascribe to a classification of foods into hot and cold, treatment\nfor illnesses by balancing and counteracting food and disease temperatures.\nSymbolic hot and cold, often doesn't correspond to our ideas of temperature. One\nversion:\nHot foods include: tortillas, toast, crackers, eggs, rice, lard, ice (sic)\nCold foods: beef, sweet potatoes, squash, oranges, watermelon\nAlso depends on whether cooked in pot or on griddle vs. cooked in oven\n\nVariety of things other than food divided up this way in hot/cold dichotomy:\nenvy / fear\nhigh fever / respiratory illness\nmoney / needles\nsun / moon\nblack animals / frogs, toads\n\nPhrenology, 19th century \"science\". tried to localize different aspects of thinking and\nfeeling in different parts of brain, much like modern brain science, except it had no basis\nin fact or experiment. Term paper by student many years ago in this class (Cynthia\nWilley) showed that phrenology based on symbolic classification\nDifferent regions grouped by oppositions and divisions and locations:\nInstincts, passions, impulses were lower in head; moral/religious sentiments higher\nBack and low, occipital lobe, location for selfishness\nfrontal lobe, intellect, sentiment\nMoral organs bunched together \"like a band of brothers\"\n\nIn many areas can see a transition from symbolic, scholastic thinking to modern science\nand philosophy. One helps lead to other. To this extent D&M correct.\nSome figures transitional. Isaac Newton, persistent claims that he wrote a secret\nastrological treatise turn out to be a myth, but he was \"into\" alchemy and theological\nquestions like the dimensions of King Solomon's temple and Biblical chronology\n\nIn effect, we can see that some features of modern science can be found in premodern\nthought\nOne is close observation of nature. Many examples, e.g. Hummingbird poem, great\nknowledge of planets, sun's path, habits of animals.\nOther is system-building, theorizing. Large, complex classifications, maps of the\nuniverse.\nOnly thing that not there skeptical attitude, rigorous hypothesis testing\nBut in some ways Maya priest not that different from modern cosmologist or theoretical\nphysicist.\n\nAlso symbolic classifications can be very satisfying: feeling of completion, structure,\nstability, wholeness\nProbably why so persistent\nAfter all, there was absolutely no factual basis for Galenic medicine, none at all, but it\nlasted for a couple of thousand years\n\nLevi-Straussian Structuralism\nIn decades after WWII, French social anthropologist, Claude Levi-Strauss (now very\nsenior), elaborated Durkheimian ideas\nHis system known as structuralism, though there are other varieties of structuralism\nL-S looked for something like a symbolic classification, but at much deeper level,\nunconscious: person in culture might not even recognize or be able to talk about\n\nL-S inspired by many things besides Durkheim & Mauss, esp. by linguist Jakobson, who\nwe discussed above\nJ. and L-S were together in NYC during WWII\nL-S inspired by depth and rigor of linguistic analysis, specifically borrowed J's emphasis\non binary, dual oppositions\nAt first L-S made very close, somewhat naive analogies with linguistics\nBut then moved away on own\n\nL-S said there were underlying structures, but likely to be abstract, more like\nmathematical formula, with many possible transformations, than an obvious symbolic\nclassification\nThese structures at deep level in all sorts of things, explored by L-S in different works:\nSystems of alliance through marriage exchanges; \"totemic\" classifications of animals;\nritual; cosmology; and especially mythology. Produced series of books exploring deep\nstructures in S. and N. American mythologies\nWas very trendy for some years, among intelligentsia in general as well as anthros in\nparticular---though few actually understood very well. Douglas and Tambiah articles\namong those partially inspired by L-S.\n\nL-S was inconsistent. In several places said such structures more typical of pre-industrial\nsocieties. \"Cold\" societies, vs. \"hot\" modern ones. Other places he stated or implied that\nuniversal.\n\nStructuralism since passed out of fashion. But I think has much to offer, if one is careful\nand skeptical. We will try our hand at structural myth analysis.\n\nTesting Structuralism\nProblem with L-S's structuralism, also with lot of symbolic anthropology, is how do we\ntest, make sure?\nIn literature, notorious how many different interpretations are imposed on a single work.\nIf we want to move past assertion, how do we test our own conclusions?\n\nQ. What is answer offered by James Fox in reading? First, find relatively mechanical\nway to establish connections between symbols.\nQ. How does he establish connection for Indonesian culture he studied? Through\nparallelism, arrangement of ritual verses into pairs. Was discovered by Biblical scholar\nin 18th century, found that much of Old Testament written in verse, and that those verses\nwere arranged in pairs, synonymous or semi-synonymous: spears into pruning hooks,\nswords into plowshares.\nSince then found to be important structure in religious poetry of many societies.\nSo Fox used computer to find most frequent pairings, and then arranged the pairs into a\nstructure\nOne of most satisfying aspects of work was that confirmed previous, more intuitive\nanalysis\nThis option not always open, but encourages us not to take issue of validation for granted"
    },
    {
      "category": "Resource",
      "title": "homily.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-212-myth-ritual-and-symbolism-spring-2004/3de761d331e86ef5602a2a5df895817a_homily.pdf",
      "content": "Orlando Jaquez\nApril 26, 2004\nProfessor James Howe\nSecond Field Assignment\n\nPriest as Chief\nThe Rite of Homily as Guidance Tool\n\nOn Easter Sunday1 2004, I had the opportunity of attending a Catholic Mass at a church in the\nwestern suburbs of Boston. This visit, while admittedly pious in nature, allowed me to (in the\nmetaphorical sense) kill two birds with one stone. Not only was I able to fulfill my religious\nobligation, but I also managed to perform fieldwork and observe a well-known ritual firsthand.\nLuckily for me, it also allowed me the opportunity of obtaining a transcript of the sermon, which\nwill be used in this paper with his permission. In this short piece, I present an analysis of Catholic\nMass liturgy, in particular of the rite of Homily, and I argue that through the Homily, the Catholic\npriest, as the ritual leader, plays a key role in the preservation and reassertion of the Faith.\n\nRitual study - understanding the ritual form and its function - has become an\nincreasingly important area in anthropology, and has served as a major analytical tool for the\ngreatest minds in the field since its inception (Bell 1992: 3). Ritual is ubiquitous in all societies,\nand so, the study of rituals serves as a sort of spy-hole into the \"cultural dynamics by which\npeople make and remake their worlds\" (Bell 1992: 3). In the world of religion, in particular,\nritual study has been especially useful, as ritual is considered (by some) to be \"the ground from\nwhich religion grows\" (Rappaport 1999: 26). I tend to agree with Anthony Wallace's statement\nthat, \"it is ritual which accomplishes what religion sets out to do,\" and is thus, the primary\nphenomenon of religion (1966: 102). Religion, then, is kept alive, not by the mere belief in the\ndivine or the sacred, but by the performance of religious rituals. While these views of religion\nand ritual may not be universal, it is nonetheless my own belief that ritual, by any definition, is a\nfundamental feature of the religious experience. In fact, all studied religions have a defined\nsystem of rituals that serves to provide \"an aura of facticity\" to religious beliefs (Geertz, 1973:\n\n1 The holy day of Easter marks the end of a 40-day period of Lent, and symbolizes the resurrection of the Christ\nafter the third day of his death (See Elliott 1995).\n\n90). It is important to note that while a number of definitions of ritual exist (Frits Staal defines it\nas \"pure activity, without meaning or goal\", Levi-Strauss as \"a favored instance of a game\")2,3, I\nwill adopt Roy Rappaport's general statement, which is described in his book, Ritual and\nReligion in the Making of Humanity (1999: 27):\n\"[Ritual is] the performance of more or less invariant sequences of formal acts and utterances not\nentirely encoded by the performers [that] logically entails the establishment of convention, ... the\nconstruction of time and eternity, the representation of a paradigm of creation, the generation of\nthe concept of the sacred and the sanctification of conventional order, the generation of theories of\nthe occult, the evocation of numinous experience, the awareness if the divine, the grasp of the\nholy, and the construction of orders of meaning transcending the semantic.\"\n\nBy this definition, the Catholic religion is filled with ritual. In fact, the Catholic Church\nhas defined in great detail a set of rituals - a Sacramentary - that function to establish the\nreligion's \"aura of facticity\" that Geertz describes (Elliott 1995). The Sacraments - Baptism,\nCommunion, Confirmation, Penance, Anointment of the Sick, Holy Orders, and Matrimony - are\nthe principal rites of the Catholic faith, and function to define membership in much the same way\nas the rites of passage described by Turner (1967) and Van Gennep (1909). Communion, and to\na lesser extent, Penance, are calendrical rites. That is, these sacraments are performed regularly\nand normally adhere to a defined schedule (Rappaport 1999). The remaining five are non-\ncalendrical and occur only as responses to events in, or at different stages in life. For the sake of\nbrevity and in the interest of focus, I choose to only address the ritual of Communion, or the\nMass, and more specifically, the rite of the Homily (the sermon).\nThe modern Catholic Mass is itself divided into a series of minor rites. These rites are\ninvariably repeated at every mass, with few exceptions not herein discussed. I shall only provide\na brief review of these minor rites, as I am principally concerned with the Homily. The mass\nopens with the Introductory Rites: the entrance hymn, the greeting, the penitential rite, the kyrie\n\n2 Frits Staal, \"The Meaninglessness of Ritual,\" Numen 26, 1976. (Obtained from Bell 1992)\n3 Claude Levi-Strauss, The Savage Mind, trans. George Weidenfield and Nicholson Ltd., University of Chicago\nPress: Chicago, IL, 1966. (Obtained from Bell 1992)\n\neleison (congregation's prayer for forgiveness), the Gloria (a praise of God), and the opening\nprayer (a prayer that is peculiar to the day). 4 Following the Introductory Rites, the congregation\nengages in the Liturgy of the Word: the First Reading (from the Old Testament), the Second\nReading (from the New Testament), the Gospel and Acclamations (from the Book of Matthew,\nMark, Luke, or John), the Homily (the priest's sermon), the Credo (usually a recital of the\nNicene Creed, which restates the Faith), and the Intercessions (business of the Parish and special\nneeds). The Liturgy of the Eucharist follows, and includes: the preparation of the altar and gifts,\nthe Sursum Corda (prayer calling attention to the congregation to \"lift up [their] hearts\"), the\nPreface and Sanctus (prayer of the angels), the Eucharistic Prayer (which calls for\ntransubstantiation of bread and wine), and the Mystery of the Faith (a proclamation of the\nmystery of Christ's resurrection). At this point in the Mass, the bread and wine are said to be\ntransubstantiated into the body and blood of Christ, respectively. The mass concludes with the\nrite of Communion (Lord's Prayer, Taking of the Bread, and Prayer after Eucharist) and the\nDismissal (See Elliott 1995).\n\nThe Homily, however, is of special interest to me. During this sermon, the priest\nnormally addresses one, or a set of the readings presented during the Liturgy of the Word. I find\nthis single rite particularly interesting, because it differs substantially from the others in the\nMass. The Homily is the only non-scripted segment of the ceremony that is intended to have\ninstructional meaning. That is, during the Homily, the priest is able to offer his personal\ninterpretation of the readings, and more importantly, of the religious moral of these readings.\nThis rite, then, provides the priest with a powerful window of opportunity in which to address the\nspecific topics he deems important.\n\n4 The actual order of mass can be found at: \"The Order of Mass: Basic Text for the Roman Catholic Eucharist,\nhttp://clawww.lmu.edu/faculty/fjust/Mass.htm (accessed April 20, 2004), and \"Mass (liturgy)\",\nhttp://encyclopedia.thefreedictionary.com/Mass+(liturgy) (accessed April 20, 2004).\n\nDuring my visit to the St. Julia Parish (Weston, MA), I had the fortune of obtaining a\ntranscript of Father X's sermon. Just as Father X did on Easter Sunday, a Catholic priest can\nprepare a weekly \"lesson\" for his congregation. And with this weekly lesson, the priest plays a\ncrucial role in maintaining the Catholic religion's \"facticity\") through three non-exhaustive,\napproaches: the use of easily understood vernacular and real-world examples, the selective\nelucidation or decoding of religious metaphors, and the use of rhetoric.\nLooking at Father X's transcript, the utility of the first approach was immediately\napparent. In his opening, the Father begins with two simple examples of what he considers to be\nthe phenomenon of Easter.5 The first example, that which suggests that feast of Easter is similar\nto winning a lottery, uses the lottery metaphor to convey to the audience that Easter is an\nunearned (thus universal) \"change for the better.\" With this, the speakers suggests that Easter\nshould evoke in a person the same excitement and pleasure felt when winning the lottery. As a\nresult, the congregation is able to compare the abstract notion of inheriting new life from Christ\nto the more plausible (though admittedly not by much) lottery scenario. The Father repeats this\nexercise in the second example. He translates the abstract notion of the new life of Christ in the\nPope to the real example of the Pope's blind forgiveness of the worst of sins.\nFather X. uses the second approach of selectively deciphering and elucidating the\nmeaning behind Catholic symbols when explaining the meaning of Baptism. Much like the\nKuna chief (and his interpreter) described by Howe (1977), Catholic priests often choose to\nexplain a concept rich in symbols, in terms of a smaller subset of these symbols, which they feel\ndirectly applies to the day's lesson. In his Easter sermon, when explaining the concept of\nBaptism and its ties to Easter, Father Evans only chose to decode the symbols of Baptism that\n\n5 Though not necessary, the reader should know that the readings for Easter Sunday 2004 included: Acts 10:34a, 37-\n43; Colossians 3:1-4; John 20:1-9.\n\nwere directly relevant to the topic of Easter. So, in describing Baptism, he placed heavy\nemphasis on the idea of incorporation of the baptized into the Body of Christ - an incorporation\nthat is reinforced every Easter. What is more, the Father cleverly maintains this line of thought\nthroughout the entirety of the sermon, reinforcing specific characteristics of Easter and Baptism,\nso as to produce an extremely coherent lesson on the Church's oneness with God.\n\nFinally, Father X. illustrates the use of rhetoric as a tool for persuasion and guidance. A\nclear feature of his sermon is the use of a rhetorical question, which is quickly followed by his\npersonal answer to that question. This technique, along with the persistent repetition of key\nconcepts, allows for an extremely convincing lesson. By asking, \"what is so special about\nBaptism...\" and quickly providing a host of answers to the question, the priest was able to instill\na great deal of knowledge on the congregation, without allowing for little questioning.\n\nWith this case study I have shown that the Homily is the vehicle with which the priest\ndrives his audience toward the \"right\" direction. With the sermon, he is able to selectively\nreinforce a different aspect of the Faith, so as to rejuvenate the \"aura of facticity\" of areas that\nmay be lacking. All in all, as the leader of the ritual, the priest is able to lead his congregation in\nthe direction he deems appropriate. In this sense, the Catholic priest shares qualities with a tribal\nchief that uses sermon to lead his village along a certain path (as we see with Howe's Kuna\n(1977)), or with a ritual leader that asserts the facticity of a faith through his sermon (as we see\nwith Turner's Ndembu doctors (1967).\n\nREFERENCES:\n\nBell, Catherine, Ritual Theory, Ritual Practice, Oxford University Press: New York, NY, 1992.\n\nElliott, Peter J., Ceremonies of the Modern Roman Rite: The Eucharist and the Liturgy of the\nHours: A Manual for Clergy and All Involved in Liturgical Ministries, Ignatius Press: Ft. Collins,\nCO, 1995.\n\nHowe, James, \"Carrying the Village: Cuna Political Metaphors,\" In The Social Use of\nMetaphor: Essays on the Anthropology of Rhetoric, David J. Sapir and J. Christopher Crocker\ned., University of Pennsylvania Press: 1977.\n\nMorris, Brian, Anthropological Studies of Religion: An Introductory Text, Cambridge University\nPress: New York, NY, 1987.\n\nRappaport, Roy A., Ritual and Religion in the Making of Humanity, Cambridge University Press:\nNew York, NY, 1999.\n\nWallace, Anthony F. C., Religion: An Anthropological View, Random House, Inc.: New York,\nNY, 1966."
    },
    {
      "category": "Resource",
      "title": "humanbody.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-212-myth-ritual-and-symbolism-spring-2004/0ee5667e9574e9482a73fe607f6b80df_humanbody.pdf",
      "content": "11, 12. THE HUMAN BODY\n\nMove today to new domain of symbolism, human body. As before, approaching from\ntwo directions, how body used to talk about other things, and how meanings imposed on\nthe body.\n\nVery trendy topic in recent years. Some elements of faddism, but is genuinely important\ntopic. We have of course already seen with Sontag.\n\nMuch of work in recent years concerned with way things, esp. power relations, are\nimposed or \"inscribed\" on body. Grows out of work of Michel Foucault and others. But\nthis only part of huge subject. We will cover several different aspects of body.\n\nAs with animals, space, colors, and other things, bodies seem to be unambiguously real\nand natural. Part of the strength of all these things. Does not seem to be constructed or\nimposed or in any way artificial. But of course we have already seen with animals that in\nfact cultures shape how we perceive, react to, feel about the natural world.\n\nAll this true of body as well. What could be more physical, just there, than the body?\nNature at its closest to us---the part of nature we have to live inside.\nBut in fact our experience and understanding of bodies is culturally shaped in any number\nof ways.\n\nBody image\nOne of the most given aspects of our bodies would seem to be their size and shape, their\ndisplacement in the world: there it is. In fact, many studies suggesting that our image of\nour bodies is constructed, put together out of different sensory inputs, concepts, etc. Also\nfragile.\n\nCases of trauma or assault on body image esp. revealing.\nPhantom limbs well known phenomenon. Because nerves still there, they can be\nstimulated even though the arm or leg they led to has gone. Feels like it is still there, can\nitch like crazy; some patients even see it.\n\nOpposite also revealing. Oliver Sacks, well known writer and all sorts of medical,\ncognitive issues. Movie from one of his books, opera based on another. Wonderful,\nfascinating. He has book, A Leg to Stand on. Tells how was chased down a mountain by\nbull, terrible fall and damage to leg. During long hospitalization, convinced that leg was\nnot there, only very gradually learned to perceive it and feel it again.\n\nSimilar phenomena with more \"normal\", everyday changes, e.g. as fall asleep. Sense of\none's size, shape, extension can change.\n\nIn experiments, people have trouble specifying color of own skin. Skin in fact is esp.\nindistinct. We conceptualize it as a distinct envelope, but our perception of own skin is\nmuch mushier\n\nBecomes clear that our image of own bodies constructed out of several elements together:\nsight as well as touch, other people's perceptions.\n\nGesture\nThis is one area where many people are aware of cultural differences, though sometimes\nstriking just how radically different can be: thumbs up gesture highly obscene or other\nwise negative in a number of cultures. Q. Do you have examples from your own\nexperience?\n\nMovement\nThis less often recognized. How people move, how they hold their bodies, strikingly\nvariable.\nThere are of course basic human constants: we all walk upright. Studies using film have\nshown pan-human constants in expressions: smiling, weeping, eyebrow flash.\nFundamental importance of eye contact.\n\nBut cultural variation also important. Marcel Mauss, Durkheim's colleague, struck by\nvariation in how European soldiers marched. How swung legs etc. Wrote essay on use\nof body, variation. One example: British regiment that adopted French marching band,\nsome historical reason, but British found it impossible to march to French military music,\nhad to go back to British band. (Marcel Mauss, \"Les Techniques du Corps\" in: 1966,\nMarcel Mauss, Sociologie et Anthropologie (Presses Universitaires), pp. 365-386; also\ntranslated by Ben Brewster, Economy & Society 2 (1973).\n\nAnother place where variation obvious, or used to be, is with martial arts from different\nparts of world. (With wide western adoption of eastern arts, differences blurred.)\nDifferences in where center of body is, where action begins in body. N. American\nculture emphasizes chest, arms, shoulders, some Asian societies more from abdomen.\n\nV striking differences in how run, e.g. in movie \"Seven Samurai\". Even more in\npunching. We say someone \"swings\" or \"throws\" punch; in martial arts, more contained,\nfrom inside.\n\nConceptions of the body\nWide variation in how invisible interior of body understood, issue raised by Sontag.\nJonathan Miller, in book, The Body in Question (1978), shows how understanding of\nbody and its parts changed over centuries. Things we assume are obvious may not be.\nChapter on the heart (pp. 176-212), Miller argues that Harvey grasped how heart\ncirculated blood in part because of recent invention of mechanical pumps. Needed\nindustrial objects as analogy before could be understood.\n\nAll sorts of interesting questions: when my son was in hospital for back operation,\nsurgeon complained that the condition of his disk was clearer in the MRI than when he\nactually cut.\n\nOne important question is how things are mapped onto the body. We put emotions in\nheart. Everyone aware that not really seat of emotions, is a pump of blood, but we use\nthe idea so consistently that it is more or less as if we did literally believe. Other cultures,\nwouldn't occur to map emotion onto heart.\n\nBuddhism, statues, emphasis on abdomen.\n\nSome years ago idea from neurological research that certain functions localized on right\nor left side of brain. became widespread metaphor for all sorts of oppositions, esp.\ncreativity, intuition vs. cold rationality. In letter of recommendation from famous anthro\nyears ago, he went into rant against left-brain people.\n\nFrench localize many conditions in liver. Every disease has something to do with liver.\nWe seldom think about it. Recent work shows surprising cultural variation in medicine\njust within Europe. Famous study of witchcraft, Azande of Sudan, showed that localized\nin liver. Maybe they are French.\n\nDoubt that there is free variation in how body is experienced. Certain bodily experiences\nphysiologically controlled, constants. But how they are interpreted in different cultures\nwide variation. The Japanese posit two states called ki and kokoro, culturally salient in\nall sorts of areas, incl. martial arts.\n\nExtreme in systematic mapping of things onto body, 19th century pseudo-science,\nphrenology. Head divided up into regions, each with cognitive and emotional functions\n(discussed below and in later class, see diagram on cover page for this OCW listing).\n\nSo, there are many answers possible to question: What's going on in there?\n\nThe body linked to other things\nAs always, we are less concerned than any things or things by itself than how linked to\nother things: hearts as pumps; dogs, rabies, and class; invasion metaphors for the body\n\nOften whole domains, great elaboration of bodily tropes. In effect, understanding thru\nbody, though not purely natural body, cultural body\nReligions offer great example. Consider the pervasiveness of body tropes in Christianity:\nJesus' bodily suffering (recently in notorious movie by Mel Gibson). Each feature\nbecomes elaborated: nail holes (stigmata), blood, spear wound, etc.\nSkull as embodiment of death, in many religious paintings.\nSaints' suffering, in art, some horrible. Hundreds of depictions of St. Sebastian as pin\ncushion, full of arrows. Again, tremendous elaboration in stories, art. Often close\nattention to pain, wounds.\nPieces of saints' bones etc. as relics.\nThinness of female saints.\nRenunciation of body by religious: hair shirts, self-flagellation. Carried to extreme by\nmedieval flagellants, penitentes of American SW\nImportance of physical reconstitution of bodies at last judgment.\n\nMiracle cures: Lourdes, Fatima.\nHeart of Jesus; heart of virgin.\nBody and blood of Christ in host.\nVirgin birth.\netc. etc.\nSame true for Buddhism, Hinduism.\n\nIn previous classes we talked about \"the body politic\", body metaphors of society, social\nmetaphors of body. Question of whether is inevitable political slant or message to such\ntropes.\nSontag, in 2d essay in book (optional reading), asserts that body metaphors for society\nalways repressive or authoritarian (p.94)\nWhether not is inevitable, no doubt that body metaphors for society can be elaborated to\nmake point.\n\nIt has been argued by Steven Shapin that when phrenology adopted by some in 19th\ncentury Edinburgh, was at least in part a social statement about nature of society and their\nplace in it. (Shapin, S., 'Homo Phrenologicus: Anthropological Perspectives on an\nHistorical Problem,' in Barnes, B.S., & Shapin, S., eds., Natural order: Historical Studies\nof Scientific Culture. London, 1979, pp. 41-71. Shapin, S., 'Phrenological Knowledge\nand the Social Structure of Early Nineteenth-Century Edinburgh', Annals of Science, 32,\n1975, pp. 219-243.)\nAccording to S., by pushing phrenology, members of rising commercial class were\nsuggesting a strong connection between innate abilities and one's place in society. Were\narguing against hereditary aristocracy, for a meritocracy. Relevant to MIT.\n\nReading by Emily Martin on \"scientific\" images of body, esp. of women's bodies\nQ. What is basic metaphor? What derived from? factory, modern capitalism.\nQ. What implications, according to M, for view of menstruation? Seen as failed\nproduction, failure in general, very negative image.\n\nQ. Do you think this characterization of menstruation follows inevitably from the root\nmetaphor? Not necessarily. Factories have many waste processes that are normal parts\nof industrial production, routine, not failure. Don't see why couldn't have metaphorized\nmenstruation as normal, expectable, harmless, if bias ran that way. (Wonder whether we\nmight find it in texts if we looked further.)\n\nQ. is the loss metaphor inevitably completely negative? Might there be some hint of the\npositive in the idea that menstruation is not just random but devoted to a valued purpose?\n\nQ. Does analogy between producing babies and producing goods mean that reproduction\nhas become mechanized or capitalized? arguable.\n\nQ. If metaphor as failure and loss really is dominant and really is negative, does the\nnegative judgment follow the metaphor or the other way around? Given that males in\nmany many societies have hang-ups, taboos about menstruation (in some societies isolate\n\nwomen until done), isn't it just as plausible that the prejudice came first, and the negative\ntrope was devised to express it?\n\nQ. What is M's argument about social class? That middle class women more\nindoctrinated, have bought metaphors, ideology more.\n\nQ. What is the difference between the way working and middle class women talk about\nthe subject? Middle class all purposive models, production. Working class resist, talk in\nterms of immediate experience.\n\nM has developed all of this more fully in other works, this very quick article, but there is\na lot to discuss, lots of questions: Q. If the difference in discourse is real, is this a matter\nof differences specific to reproduction etc., or is it a matter of styles of discourse by\nsocial class? M doesn't seem to recognize that there are social penalties for working\nclass people who talk in fancy ways, who seem over-fancy and pretentious, who seem to\nothers to be above themselves. Their listeners are sensitive to the slightest whiff of\npretension.\n\nThere is also a tendency among Left-leaning social scientists to sometimes romanticize or\nprefer working class people. May or may not be relevant here.\n\nQ. Could you say the two classes lean towards different tropes? Could say middle class\nmetaphorical, working class metonymical and synecdochal. Again, there are dangers\nhere. Rhetoric of valuing experience over theory. Also, hang-ups about tropes and\nrhetoric generally. (Remember Sontag's ambivalence). Idea that reality should not be\nmediated (and inevitably distorted) by tropes. Also one variety of feminist theory some\nyears ago, said women spoke and wrote literally, men through tropes. An \"essentialist\"\ntheory, attributing eternal, essential characteristics to genders. Martin not an essentialist\nat all, but there is danger in attributing directness and experience to working class, theory\nand ideology to middle class. For one thing, fits enduring cultural stereotypes.\n\nIn all sorts of areas, claims about illness and health can also be hidden social claims.\nDoesn't have to be just ideology by ruling powers. Those who resisting domination often\nelaborate own theories, claims about body.\nRejection of doctors as experts, claims one can cure oneself. Is a political statement.\nMany fears and political claims now expressed in do-it-yourself epidemiology, find out\nwhy \"everyone\" on your street is getting cancer.\n\nBook, Mesmerism and the End of the Enlightenment in France, by noted historian Robert\nDarnton (1968), famous quack Mesmer, was great sensation in pre-revolutionary France.\nShows how mesmerism had implicit social and political critique, grew stronger over time.\nWe see with many varieties of alternative medicine today. I don't need those bastards\nand their fancy training. I can do it myself.\n\nDoctors and professors are two classes of experts who push one around, where expertise\nis turned into immediately experienced control: Pull your pants down and cough! No,\n\nthat paper is not worth an A. Done with professors in 4 years but lifelong with doctors.\nSo reaction against authority etc., doctors apt target.\n\nReading variation and difference\nSubject of variation in bodily form often symbolically important.\nVariation in external bodily between populations, what we call race.\nTypically the ones that considered are color and form of skin & hair, then form of body,\ne.g. so-called cephalic index, ratio of two dimensions of head.\nThe measures used to assign people to races are biologically pretty trivial on whole, the\nbiological importance of skin color certainly trivial.\nMoreover, though there are statistical biological differences from one population to next,\nthey do not sort themselves into neat groups called races\nSome of the characteristics used to sort races and assign individuals to races trivial, some\neven imaginary. Look around room: are Asian Americans here really yellow?---\nimaginary characteristic.\nNonetheless, in 19th and 20th century tremendous political and social importance of race:\nan obsession.\n\nWe have reading on reading of physical form, fascinating book by Sander Gilman, The\nJew's Body (1991), chapter on foot. Jews are physically highly heterogeneous, but anti-\nSemites insist on not just typical nose but typical voice, in effect, social differences are\nmapped onto the body.\n\nQ. Why are feet so important, according to Gilman? What social implications were read\nout of feet?\nIn 19th century, anti-Semitic notion that Jews had flat feet, if not invariably, much more\noften than other Europeans.\nAssociations between feet and either what a category does (used to call cops flat-foot;\nnow shoes and feet preoccupation of professional chefs) or what capable of doing, here\nidea that couldn't serve in army. In this era universal armed service tied to growth of\nmodern nationalist state. citizenship and service in army connected. Thus flat feet\nsignaled supposed inability of Jews to be citizens, justified their exclusion\n\nQ. What were implications of different explanations for alleged flat feet? Some said that\nit was not a genetically controlled trait. Rather, product of city living, lack of sports,\nathletics. But this was hardly better, because city symbol of decadence, athletics symbol\nof vigor, manliness. Said Jews decadent, effete, weak.\n\nQ. How to counter this claim? Jewish doctors, according to Gilman, didn't challenge\nbogus, pseudoscientific studies. Instead, argued either that answer was athletics for Jews,\nreinvigorate, or else that not true of western European Jews, was eastern Polish and\nRussian Jews. So body symbolism was tied to spatial, and all sorts of social issues in\nconsideration of something as seemingly neutral as fallen arches.\n\nQ. What kind of supposed differences between races prominent today, concerning e.g.\nsports, music, dancing?\n\nAnother kind of variation, between the sexes rather than between populations. All sorts of\nmale/female differences, real/imaginary, halfway in between; specific to one society or\nallegedly universal, are explained by and mapped onto the body.\n\nQ. What do we explain in terms of chemistry of male or female body?---hormones. Said\nthat women can't be president because of raging hormonal storms. True, women do go\nthru hormonal cycles, affects their moods. But why don't ever say men can't be president\nbecause too much testosterone? Is there no danger that 3d world war could be started by\nmacho men? Look at 1989 invasion of Panama: only happened after Noriega started\nattacking Bush's manhood.\n\nVictorian notion that women tended to madness. Madness was a bodily condition,\nthought to be disease or physically caused condition. Organic cause, in womb. Illness of\nhysteria goes back to classical root for womb, caused by womb. Doctors thus had right to\ntreat hysterical women, in extreme cases pack them off to asylums. In some instances\nthese women not mentally unbalanced at all, merely rebellious, unwilling to submit.\nMedical, bodily diagnosis was a form of control. Interesting literature on subject. See\nElaine Showalter, Women, Madness, and English Culture, 1830-1980 (1985) and other\nworks since.\n\nEven theorized that women not knowing place, not submitting, either was symptom of\nspecific disease, or else that such misbehavior could provoke organic illness\n\nModification of bodies and reading of modifications\nBody of course not just there, we do things to it, then react to what have done\nReading by Firth on hair.\nFunctionally trivial to organism, but v apparent and safely modified\nSymbolically salient in many societies\n\nFirth writing early 1970s, chapter marked by era, much ado about long hair, even musical\n\"Hair\"\nEvoked powerful reaction: friend of mine dragged out of car on Commonwealth Ave in\n1960s, beaten, hauled off to jail, just because cop didn't like his long hair.\n\nF shows how both social norms, and then individuals and groupings working against\nClose attention to hair, reading\nMay have biological basis\nKuna, contrary to what F shows for Europe, cut women's hair short; conflict with police\nin 1920s because forbidden to cut short\nOften great intensity of concern with mere symbols: currently in France whether girls can\nwear headscarf to school\n\nCan be crucial to control: Manchus imposing topknots on Chinese male population\n\nAlmost every part of body modified: hair, skin, feet, nose, ears, lips, genitals\n\nAlmost anything you can think of, someone somewhere has done it.\nAlso impossible to avoid: in 1970s and 1980s some feminists insisted that obsession with\nappearance was a defect of corrupt capitalist society. Refused to play game, esp. not\nshaving legs. Only result was that unshaved legs became a symbol. Ditto not wearing\nbras.\n\nChanges in body often mark crucial changes in life.\n\nQuestion of modification of genitals esp. tricky.\nWhether circumcised or not very salient re Jewish identity, anti-Semitism, anti-Semitic\njokes.\nBut also nationalism: many non-Jewish American males circumcised. British find\nappalling, claim unnecessary suffering for child. remarkable vehemence of attack.\n\nMore recently, great international controversy about cutting female genitals in Africa and\nArab world. Is it an outrage or matter for local decisions? Raging controversies. Even\nin episode of \"Law and Order\". One of most balanced and thoughtful takes by Chris\nWalley in our program (1997, \"Searching for 'Voices': Feminism, Anthropology, and the\nGlobal Debates over Female Genital Operations.\" Cultural Anthropology 12(3):405-438.\nAlso Genital Cutting and Transnational Sisterhood : Disputing U.S. Polemics, edited by\nStanley M. James and Claire C. Robertson, University of Illinois Press.)\n\nQ. What does article by Turner show? Complexity and systematic nature of system in\none \"simple\" society.\n\nSimilar complexity and cultural variability in how body is to be covered, modesty,\nimmodesty, etc. (but we will not discuss today).\n\nInscription and Power\n\nAnother perspective on body is how things are imposed on it, how power is imposed thru\nrestrictions or \"inscriptions\" on body.\n\nThere is an element of coercion in almost everything that happens to body. If have long\nhair or green hair or whatever hair when everyone else is different, at most extreme, may\ndrag you in and cut it off. If not, may ostracize you. If not, may tease and criticize. If\nnot, will probably stare in rude way.\n\nHertz big on how right/left hand polarity is obligatory, imposed. Ask any Leftie.\n\nAnd of course impositions not equal for everyone:\nSlaves had to walk certain way.\nIn Islamic countries, women have to cover everything.\nIn US, at church when I was young, women expected to wear hat, keep it on during\nservice, men to take hat off\n\nDifference doesn't even have to be visible mark. Concerning monarch:\n-Don't turn back on her.\n-Don't touch in familiar way. Australian leader caused huge scandal by putting arm\naround queen.\n\nHighly arbitrary:\" in some societies, must always stay lower than social superior, in\nothers must stay standing when superior sits\nMay be elaborate graded code. One anthro, Goodenough showed scaled in clear way in a\nPacific society: for those slightly above, had to do X; for those more above, X and Y; all\nthe way to people at top, had to do XYZABC. (1965, \"Rethinking Status and Role\" in\nThe Relevance of Models for Social Anthropology).\n\nThe excerpts from Discipline and Punish by Foucault are a small taste of a much larger\nbody of work that has been extremely influential. Looking at the body as the site on\nwhich power does its thing.\n\nQ. Why does F want us to see the \"exemplary\" and horrible punishments of the pre-\nmodern era as a contrast with the modern era? F looking at non-coercive, non-obvious\nways the body is controlled and \"disciplined\". Later works on all sorts of other areas,\nclinics, madness, sexuality. F turning upside down our assumptions about freedom and\ncontrol. Absolutely correct in that there are many ways we are subtly or not so subtly\ndisciplined. e.g. with industrial revolution, millions of people had to learn to run lives by\nthe clock.\n\nQ. How is F's attitude towards theory and ideas and ideology like Martin's? F seeing\nforms of knowledge and theories as intimately tied up with power. Not objective, not\nstanding apart, but inevitably tied to power. However, in much of his work, he spends\nmore time looking at theories than at concrete actions. Also, in French tradition, his idea\nof knowledge and theory greatly influenced by French grand theories, which explain\neverything.\n\nWith, e.g. works on penology, theories about how to administer prisons effectively and\nhumanely, one can see a close connection between knowledge and power; ditto works on\npublic health; but ways in which and extent to which all forms of knowledge and theory\ncan b reduced to power remains to be seen.\n\nThis is the rhetorical device of the exemplary synecdoche, the example that makes your\npoint about the whole; danger is that carefully chosen parts may be only partly\nrepresentative of the whole.\n\nQ. Why is the panopticon crucial to F's argument? Because the embodiment of\ntheorizing, and because it was supposed to be more humane. Because, F argues, it is\nmatter of arranging space, of ability to see rather than hurt. F very big on the importance\nof the gaze, who can see who, when and how. The panopticon works by making it\npossible for those in center to control rest by observing them.\n\nQ. Is this the way modern prisons really work? There can be no doubt that authorities try\nto maximize their ability to observe prisoners. But all prisons also continue to depend on\nforce and violence. Prison is ultimately brutally violent coercive institution.\n\nMore generally, most countries in world use more violence to control than we care to\nadmit. Torture much more widespread than we believe. It's just that we don't do it so\nmuch in public. The fact that they used \"exemplary\" horrible punishments in past is just\nas likely to have been a function of the fact that premodern states were terribly\ninefficient. In making example, couldn't demonstrate consistency and catching majority\nof criminals (still can't today) so made punishments did inflict horrifying.\n\nBack to prisons, do they work as designed? of course not. Inmates regularly escape\ngaze. In many prisons, except that they can't get out, inmates control as much as guards.\nThe panopticon has never been more than an ideal. The super-max prisons that have\ncomplete control over inmates do it by radically confining them individually, severally\nrestricting time out of cells, and tremendous violent power.\n\nFoucault has raised all sorts of interesting ideas, extremely provocative and fruitful. Has\nextraordinary run of success, even after death. Some question, argue, but has not suffered\nkind of reaction Levi-Strauss and other past figures have."
    },
    {
      "category": "Resource",
      "title": "illnessmetaphor.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-212-myth-ritual-and-symbolism-spring-2004/f030586f8a2ebd00e499e46629eeb977_illnessmetaphor.pdf",
      "content": "3. DISCUSSION OF SONTAG'S ILLNESS AS METAPHOR (2/11)\n\nSontag's essay is hurried and sometimes careless. In places she contradicts herself.\nBut it provokes us to think about metaphor, and it encourages us to look for symbolic\nassociations and meanings everywhere in life, not just in highly self-conscious\nsymbols like the Christian cross or the hammer and sickle.\n\nAccording to S, what are the similarities and differences between the images of\ncancer and TB? Why do the differences matter?\n\nHow is insanity like TB? Can you think of recent examples where insanity or\npsychological excess is glorified or romanticized?\n\nAccording to S, what is wrong about attaching such ideas to a disease?\n\nWhat is S's attitude to metaphor in general? Is she consistent? What does she mean\nby metaphor?\n\nWhy is S angry?\n\nWhy does S think it significant which part of the body an illness attacks?\n\nHow does disease individuate people or lump them together?\n\nCan you think of ways other than those mentioned by S that we moralize disease?\n\nDo you think attitudes towards heart attack patients have changed since S wrote?\ntowards cancer?\n\nWhat other conditions do we deal today with by labeling them as illness?\n\nIs there a way to avoid metaphorizing illness?\n\nAre cancer metaphors necessarily authoritarian and repressive? What about\nmetaphors of the body and society?"
    },
    {
      "category": "Resource",
      "title": "imperialism.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-212-myth-ritual-and-symbolism-spring-2004/0ca667ed0a3d75557fa768c1cabb031e_imperialism.pdf",
      "content": "7. METAPHORICAL IMPERIALISM\n\nThe study of metaphor brings up a number of perennial problems in the study of cultures\nOne is the search for the core of culture: Is there something that is most fundamental, that\ndetermines other things or prior to them? Many answers have been offered. Basic\npersonality type---Ruth Benedict, famous book, Patterns of Culture, culture as\npersonality writ large. Other answers: a set of values, core elements of economy or social\norganization, adaptation to the physical environment---all suggested at one time or\nanother. Marx, divided society into base, structure, and superstructure, but latter-day\nMarxians have often changed priorities.\n\nRelated question: how different are cultures? What is the range of possible variation? Is\neach culture truly unique? Put another way, how plastic, how changeable, are human\nbeings? What are the possibilities?\nFamous study, Margaret Mead, Coming of Age in Samoa, argued that adolescent turmoil\nwas peculiar to western culture. Said Samoan adolescents very free in sexuality, and so\nhad no hang-ups or turmoil. Since strongly criticized, suggested that very biased, found\nresults that wanted. Huge controversy.\nAs general rule, anthropologists see lots of variation, cultural variability, but some see\nlimited possibilities in whatever area they study.\nE.g. study of color terms: great variability in how different cultures cut up color\nspectrum, but then study said there was in fact considerable regularity.\n\nThird related question: How much does culture determine thought and action? Are\ncultures straight-jackets or recipe books allowing one to cook up a lot of dishes and even\ncreate new ones?\n\nOne major approach to these questions is through language. Naive version of linguistic\ndeterminism very common: people are like their languages. Germans are harsh and rigid\nlike their consonants, Italians fluid and not rigid enough. English much better than other\nlanguages because has huge vocabulary.\n-A German told me the Kuna language had no fixed rules, i.e. no real grammar, which\nnonsense. A friend said Spanish speakers lacked sense of personal responsibility because\nthey used an impersonal form to describe accidents: \"It fell on me\" rather than \"I dropped\nit.\"\n\nTranslation and its difficulties suggest how different languages and worldviews may be.\nIn book by JH, I used word \"mixer\" about dances to suggest they were sponsored by\npolicemen in order to meet local women. Excellent translator into Spanish, but we never\nfound a way to translate mixer satisfactorily. (Now also strange in English, because no\nlonger have mixers.) Title of book, A People Who Would Not Kneel, implied both that\nthey refused to kneel and habitually didn't do it, untranslatable. Also, title in Spanish put\nin imperfect tense, Kuna friends said, \"Oh, and now we do kneel?\" which not an issue in\nEnglish.\n\nMost famous linguistic determinism in anthropology and linguistics, by amateur linguist,\nBenjamin Whorf, studied esp. Southwestern Indian languages. Said language strongly\ndetermined thought. Nouns in language determine how world seen. Most famous\nexample, Eskimo (Inuit) words for snow, much finer gradations than we have---many\npeople have heard of this example.\n\nEven more so in grammar. W. said language of Hopi had radically different conception\nof time from ours. Few or no constructions that refer primarily to time, to past, future,\nenduring or lasting states.\nMuch more recently, Hopi linguistic named Malotki says is complete bull: he wrote down\n600 pages of temporal expressions. (Ekkehart Malotki 1983, Hopi Time: A linguistic\nanalysis of the temporal concepts in the Hopi language. Mouton).\nSimilarly, we can learn distinctions in snow that unknown before: skiers have elaborate\nvocabulary.\n\nNo agreement on issue, but rough consensus that language does strongly shape how\npeople understand world but probably not radically determine it in way Whorf suggested\nin his strongest claims.\n\nIf we return to metaphor, can see that the article by Cohn is concerned with some of these\nissues. She suggests that to talk about strategic defense issues, she had to adopt the\ntropes used by specialists, got her thinking and talking in certain way, very hard to break\nout of trap.\n\nMost systematic and important development of such ideas by Mark Johnson and George\nLakoff, philosopher and linguist. We have an excerpt from their first book on subject.\nArgument very similar to Whorf, though I have never found place where they\nacknowledge connection.\n\nLakoff and Johnson suggesting that metaphor much more pervasive in our language than\nwe usually recognize. Not decoration but foundational, part of structure, basic. No self-\nconscious or consciously elaborated but imbedded in language, often so fundamental and\npervasive that we don't recognize. Systematic: hide some things, highlight others. These\nare important points, they are correct. They argue that core ideas and assumptions of a\nculture imbedded in metaphor.\n\nQ. What do you think of their example, Time is money? Seems very apt, though question\nof how much of the equation follows from the metaphors. Historians show how time\ndiscipline was imposed with growth of capitalist economy: does metaphor merely reflect\nor actively shape?\n\nQ. What about suggestion that linguistic expressions are containers? or that our field of\nvision is a container? May not be so intuitively obvious as time is money, but the\nlinguistic expressions we use seem to depend on that metaphor.\n\nQ. What do L&J mean by orientation metaphors? Q. by ontological metaphors?\n\nQ. What do L&J mean by metaphorical coherence? What is their positional on how\ncoherent sets of metaphors are? They stress how metaphors fit and work together, how\ncoherent they are, but they also take pains to point out that coherence is partial, and that\nmetaphors and ideas may be contradictory.\n\nOne of the key questions that has come up is whether and how much values and ideas etc.\nare imbedded in metaphors, how much the assumptions and values are in the metaphors,\nas opposed to the values and ideas being there in the culture, and the metaphors are\nchosen to represent them.\n\nArticle by Naomi Quinn, (in Beyond Metaphor, supplementary reading list), deals with\nthese issues concerning American conceptions of marriage.\nAs Quinn sees it, Americans have a set of core ideas about marriage and how it should\nbe. (Not everyone would agree---another might see less agreement or deny that\nsomething as big as the U.S. could have a common culture.)\nQualities: shared, lasting, mutual benefit, compatibility, difficulty, effort, success/failure,\nrisk (p.66)\nesp. shared, mutually beneficial, lasting. Mapping cultural understandings of love onto\nmarriage.\n\nThese ideas are often communicated through metaphor, but she argues that the ideas are\nnot embedded in any single metaphor.\ne.g. Lastingness represented by well-made manufactured product, on-going journey, two\ninseparable objects, permanent location, indestructible natural objects, secure\npossessions, covenant with God. No one metaphor is central--the idea is central.\nMetaphors are used to convey notions that exist outside of any particular metaphor.\nLakoff shrugged off this critique, perhaps because doesn't catch its full force.\n\nQ. If we go back to L&J's very first example in the book---argument is war (pp. 3-6)---\ndoes Quinn's argument apply? They argue that we think of arguments in a certain way,\nand that that conception is embedded in metaphor.\n\nNow we can certainly think of other metaphors for arguments: a duel (\"touche!\") or a\ngame with points. But L&J would shrug that off, see those metaphors as secondary to\nargument=war.\n\nWhat they miss is that, regardless of metaphor, antagonism and contestation are part of\nthe very definition of argument. If we see people talking without disagreeing, without\nantagonism, without trying to win, then we don't call it an argument. Instead it's a chat,\nan interchange of ideas, a dialogue, or billing and cooing.\nFurthermore, arguments are not a natural thing out there in the world like a chair. Verbal\ninterchanges are what we experience, and if we judge them a certain way, we call them\narguments.\n\nL&J go on to suggest we imagine a culture in which arguments are not seen as war. \"In\nsuch a culture, people would view arguments differently, experience them differently,\ncarry them out differently, and talk about them differently\" (p.5)---a strong claim. How\nwe represent arguments would influence our behavior and experience as well as our\nconcepts.\n\nThis form of claim is typical of philosophers, who often think up hypothetical, imaginary\nexamples. \"Thought experiments\". This example seems typical of two researchers who\njust work in English.\n\nQ. What's wrong with argument-as-dance in some other culture?\nIf we think seriously about that imaginary other culture, it won't have any word\nargument. It will have word X, gzornenplatz, which labels certain verbal interactions. If\nit labels antagonistic, contested interactions, we might translate gzornenplatz as\n'argument'. If gzornenplatz labels interactions that are nice or like a dance, or if it\ninvokes a metaphor comparing dialogue with dance, we wouldn't even consider\ntranslating it as 'argument'. We would translate it as dialogue or conversation or verbal\ninteraction, or if no English word corresponded closely and it was important to the point\nwe were making, we'd use gzornenplatz itself and then explain it at length. A word that\nboth translates as argument and yet implies lack of antagonism or contestation is logically\nimpossible. So the imaginary example is in its essence bogus.\n\nL&J actually pretty ambivalent about cultural variability. Make much of grounding of\nmetaphors in bodily experience, sounds pretty universalistic.\n\nQ. What about their idea that the words or the metaphor necessarily constrain experience\nand action? If we compare verbal interaction to dance, does that mean we have to be\nnice?\nAmong the Kuna, they have many metaphors for discussions in the meeting hall. Quite a\nfew are based on equation of cases or issue or matter with a trail or path or way (igar).\n\"Hear the way,\" \"find the way,\" \"clear the path,\" \"resolve the way,\" \"give each other the\nway.\" Other expressions: \"call to each other, first one and then the other.\" Nice friendly\nmetaphors.\n\nBut those discussions once in a while get heated, even harsh and antagonistic, sometimes\ndownright nasty. They regret the unpleasantness: \"Why do we have to fight and criticize\nand talk tough when we are hearing the way?\"\n\nSo the metaphors indicate the desired behavior but not what actually happens.\nAs with the original Whorfian hypothesis, this conclusions about metaphorical\ndeterminism leaves us in middle: metaphor influences and guides but seldom absolutely\ndetermines.\n\nTropical dualism\n\nThere is another, even more famous attempt to extend the idea of tropes, to use it to\nexplain different domains of life.\nComes from Roman Jakobson, famous linguist, ended up at MIT\nJakobson developed the duality of metaphor/metonym, said they represented two\nopposed cognitive tendencies that could be recognized in many areas\n(Roman Jakobson, 1956, \"Two Aspects of Language and Two Aspects of Aphasic\nDisturbances\" in Fundamentals of Language, R. Jakobson & M. Halle, eds., Mouton.)\nTo the extent that he paid attention to synecdoche, J saw it as just one variety of metonym\n\nIn all his work, J was very fund of two part, binary distinctions\n(oversimplifying) J said there were two basic operations in grammars\nSubstitution, what could go in place of something: thus, if the subject of sentence was\ntree, there was a large set of nouns that could be substituted for it to go in that place in the\nsentence structure.\nSequence: what could go before and after in the structure of sentence.\nIn music, would be harmony versus melody.\nMetaphor, J said, is based on substitution, metonym on sequence\nSometimes phrased as paradigmatic relations versus syntagmatic relations\n\nJ said this basic distinction characterized many domains\nIn literature, he said Romanticism was essentially metaphorical, naturalism metonymical\n\nSaid also found in problems with language. Aphasia, inability to correctly process or\ngenerate spoken or written language.\nJ said were two basic kinds of aphasia, two different linguistic failures, corresponded to\nmetaphor and metonym\nEven claimed that when one writer developed aphasia, it was the kind of aphasia that\ncorresponded to the style of writing he had written before.\n\nVery appealing and persuasive argument, what sometimes called sexy or cute. Clever,\nseems to explain a lot. Others have carried it further.\n\nAnthro named Paine, suggested that in political rhetoric, metaphor was essentially liberal,\nmetonym conservative\n\nClaude Levi-Strauss, one of most famous living anthros, his name will come up\nrepeatedly. During WWII, was in NYC with Jakobson and other refugees from Nazism.\nLevi-Strauss was strongly influence by J, tried to find similar deep structures in culture.\n\nIn The Savage Mind, L-S analyzed the relationship of animals and their names to human\nsociety. Some animals seen as essentially analogous to humans, metaphorical, while\nothers matter of association with humans, thus contiguity, metonym. Said in once case\nthat relationship of animals themselves to humans was metonymical but relationship of\ntheir names, metaphorical.\n\nAppealing, widely adopted, but lots of problems\n\nStudies of aphasia don't seem to have followed J's suggestion since then\nDoes literature really divide into two clear types corresponding to metaphor and\nmetonym? Not very likely, very hard to apply when get down to cases. Certainly,\nconcerning political rhetoric, there are lots of conservative metaphors and liberal\nmetonyms.\n\nThe grand schemes have been abandoned, but one frequently sees offhand, passing\nreferences to things as metonyms or metaphors. Very widespread, often-used distinction.\n\nMore fundamental problems with this dualism include the following.\nFirst, J offers no good reason to forget about synecdoche. In practice, with a particular\ntrope, it may be hard to say whether it's synecdoche or metonym , but it is in general\nuseful to distinguish the two\nIn particular, taxonomic synecdoches are quite distinct from metonyms\nSo no particular reason to insist on a dualism\n\nSecond, and even more important, J (and many others) assume that tropes are always\nessentially one thing or another.\nIn the readings, Ohnuki-Tierry introduces the concept of polytropes, tropes that are two\nthings at once.\nShe introduces a lot of technical points, sometimes confusing, her usage for synecdoche\nis different from what we are using here---disregard all that. What is crucial is the idea of\npolytrope.\n\nMany many tropes are both metaphorical and metonymic. The Kuna constantly compare\nvillages to rivers. Each village must be near a river for fresh water, so metonymic, but\nthey also develop instructive comparisons, so metaphorical. Effective political action\nlike flood in river that washes away debris and snags, sweeps clean.\nPreviously, in discussing magic, we mentioned hex-dollies that metaphorical,\nmetonymical, and synecdochal all at same time\n\nThird, tropes have a way of decomposing into each other.\nSynecdoches, part/whole relationship, but some are felt as more or less arbitrary than\nothers. Sapir calls them \"apt\" synecdoches. What is aptness?---it is when the part is felt\nto resemble or epitomize the whole. Thus metaphor lurks inside synecdoche, appears any\ntime there is a resemblance between part and whole.\n\nMetonym similar. a metonym is felt to be good or strong according to the strength of the\nphysical or logical connection between its parts and/or according to its aptness, i.e. its\nsimilarity. If a cigar is associated with a person only because he smokes them all day\nlong, the relationship is purely metonymical, but if in some implicit way, however vague,\nthe cigar's qualities resemble the smoker's, then the connection is also metaphorical.\nLook at L&J's discussion of metonym, esp. of dove as Christian metonym (p.40)---\nobvious that it is also a metaphor.\n\nSo both metonym and synecdoche have a tendency to leak into metaphor, just as soon as\ntwo things not just linked in fact but also in shared features.\n\nJakobson served a useful function, got people looking for tropes outside of literature,\npoetry, just as L&J have. But rigid distinction doesn't hold up."
    },
    {
      "category": "Resource",
      "title": "intmetaphor.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-212-myth-ritual-and-symbolism-spring-2004/c76ed362cd3fb8565d0034c4f7d1ba58_intmetaphor.pdf",
      "content": "6. INTERPRETING METAPHOR (2/25)\n\nWe will cover two main topics today, the use of tropes in rhetoric and persuasion, and\nhow we go about deciphering tropes.\n\nLast time we mostly looked at tropes as ways to understand something, but also used for\npersuasion. Especially noticeable concerning historical metaphors. Analogies like\nMunich or Korea were used not just to understand the Vietnam War but to sway others,\nget them on board.\n\nRhetoric and influence.\nTropes are such a staple of oratory and persuasion, the association is so strong, one of\nreasons why tropes are associated with deception, with describing things as what they are\nnot.\nBut there is nothing inherently wrong with persuading through tropes. Just like language\nin general, they can lie or tell truth.\n\nIn many cultures persuasion often a matter of finding just the right trope.\n\nAt one regional political meeting among the Kuna, with about three hundred delegates,\nspeakers used all sorts of tropes from nature, daily life, and Kuna mythology. I recorded\nthe following:\n\n-Men appointed to a special commission to deal with a problem complained they were\ndenied the resources needed to carry out the job: compared to a man sent by his wife to\nwork in the forest without the proper refreshing drink.\n\n-A chief trying to explain that a certain situation had both good and bad features:\ncompared to drinking cane beer at puberty ceremonies, which established by God and\nbasically a good thing, but which brings lots of trouble.\n\n-A speaker criticizing Kuna representatives on a national assembly compared them to the\nungrateful wayward sons of a hero named Piler.\n\n-Encouraging people to expel peasants who had invaded Indian lands: compared to a\nsnakebite, occurs at one spot on body but then spreads throughout.\n\n-In criticizing outside mining interests, pointed out that the earth was the body of the\nGreat Mother, mining was like incest or rape.\n\n-In warning against educated men, alluded to chant by famous chief in which had said\nthat such men would bring a devil into the meeting house---depends on equation between\nnon-Indians and evil spirits. Going to the city routinely referred to as traveling to the\nstronghold of the evil spirits.\n\n-To justify cooperating with outsiders on a project, mentioned great hero who briefly\nmarried the daughters of evil spirits to learn their secrets.\n\n-Any sort of struggle or effort or confrontation inevitably compared to their great\nrebellion against the government of 1925.\n\nSuch rhetoric of course plays crucial role in many struggles in rallying people. One of\nChurchill's greatest contributions to survival of Britain during World War II was rhetoric\nhe used to encourage fortitude and resistance.\n\nKuna had their own dark years during 1910s and 1920s, in which missionaries tried to\nsuppress their religion, and then national government tried to dominate them and to\neradicate native culture.\n\nChiefs sing to their followers several nights a week. Chief sings for hour or so, semi-\nintelligible to listeners, and then sub-chief interprets speaking, explains histories or\nmetaphors, draws out lesson and relevance for today.\n\n-Would sing about great hero Tat Ibe, who expelled the demons and pacified the world,\nwould say must fight like him. Or must emulate another hero, Twiren, who taught\nwimpy ancestors to stand up to blood-sucking enemies, defeated them in great battle.\n\nAlso sing elaborate metaphorical tableaux. Set pieces. One of things most remembered\nfor today. Compare police to sharks, invading turtle-fishermen to diving cormorants.\nStory of brother-in-law who marries into family but turns out to be a cannibal monster:\ncriticizes young men who favored change as well as outsiders.\n\nOne chief famous for singing: \"Foot-tip clothes; I am your father. The outsider says he\nwill make himself my father\"---was an attack on Catholic missionaries, who wore long\nrobes down to their toe-tips, and who insisted on being called Father.\n\nMost famously, the greatest leader of time, named Cimral Colman, sang long series of\nverses representing the dangers facing Kuna and their inexorable advance. (See hand-\nout.)\n\nAccording to the Kuna themselves, these metaphors helped galvanize opinion and\nprepare people for the great rebellion\n\nWe now turn to our second question. Less concerned with how they (whoever they are)\nuse tropes than how we try to figure them out.\n\nReading and deciphering tropes.\nWe have seen that many of the ways people use metaphors are remarkably similar all\nover world. Kuna choose certain wood for curing figure because it is extremely hard.\nOn other side of world, islander chooses another wood for his yam house because it is\nextremely hard.\n\nThe structure and the thought processes are remarkably similar, but the content can be\nquite variable.\nMany interpreters of symbols, e.g. Freudians and Jungians, look for universal symbols.\nBut anthropologists want to see what symbols mean locally first, in a particular culture or\nevent or place, only later look for universals.\n\nMost things used for tropes have multiple attributes. Even if we assume that people will\nnotice many of the same ones, it cannot be established ahead of time which ones they will\nforeground in a metaphor. Same animal or thing can be interpreted in great variety of\nways.\n\ne.g. Bees.\nIn our culture, mostly very positive metaphors: sweetness of honey; industriousness.\nWoman who center of attention, Queen bee.\nMight call lazy person a drone. Metaphors of stinging, aggression, though for those often\nswitch to hornets or wasps.\n\nAnthropologist, Napoleon Chagnon, who studied famous Venezuelan group, the\nYanomami. They called him \"Bee\" because his name sounded like word for bee in their\nlanguage. Was negative metaphor, suggesting he was persistent, buzzing, irritating, like\nbees swarming around something.\n\nNative North Americans saw honey bees as sign of advancing frontier, arrival of whites,\nbecause honey bees came from Europe, arrived a few years before settlers. Metonym and\nmetaphor at same time.\n\nIn one African culture, men who get together to drink beer from pot compared to bees\naround flower.\n\nIn the blues, very sexual: man's stinger; honey as female sexuality or genitals; buzzing\naround, like bees around flower.\n\ne.g. Wild pigs.\nRichard the III, King of England, had boar as emblem: tough animal, fought hard,\nformidable foe. Had hardened skin at shoulders, which spears bounced off, called a\nshield.\n\nNew Guinea society, men say they are like wild pigs, but opposite meaning. When wild\npigs encounter people, crash off through brush to get away, describes how this people\nfeel when encroached on by colonialism.\n\nKuna interpretation of two different kinds of pigs in dream symbolism already\nmentioned.\n\ne.g. Trees whose fruit attracts animals.\n\nMentioned society in Africa where in magic metaphor of fruiting tree helps bring child\nout of mother.\nIn head-hunting society of New Guinea, fruit equals a human head, tree the victim's\nbody, and a parrot or squirrel the headhunting man.\nKuna compare two kinds of tree to two kinds of chief: one with soft fruit that all animals\ncan eat is like generous, good leader; one with hard shell that only big animals can crack\nis like chief who show favoritism. In another context, animal who come to tree compared\nto enemy who is drawn into ambush.\n\nSo, the big question, is: how do we decide which attributes and which meanings are the\nsalient ones in any particular case?\nSometimes they will explain, or some clue will indicate. 'It means this, stupid.' Kuna\nchief I worked with could explain most of metaphors he used. But sometimes not: at end\nof four-day ritual, they kill a rooster with a bow and arrow. When I asked why, they said\nit had always been done that way, no other explanation.\n\nPart of answer is to pay attention to what they know about the world, what they see in it.\nWhat goes on with pigs or fruiting trees? e.g. Kuna, hunters often set up a stand near\nfruiting trees, shoot animals that come.\nTurns out that indigenous peoples often have very detailed knowledge of natural world:\nthousands of species of plants, all the habits of the animals. May not be scientific in\nsense of setting up experiments or testing hypotheses, but yes, scientific in sense of very\ncareful observation of natural world.\nOne of my favorite examples: Eskimo (properly called Inuit) notice that huge polar bears\ncan move across thin ice by lying out flat. (Can see in zoos how flexible polar bears are.)\nThe Inuit sometimes move across micro-thin ice in same way.\n\nPaying attention and respecting local knowledge can make huge difference.\nScandinavian explorers of the Arctic and Antarctic patterned their clothes on Inuit---very\nimportant that clothes can vent heat as well as retain it. Scandinavians mastered dog-\nsledding. Already very good on skis. Thus very successful. Amundsen in race with\nScott got to South Pole first.\n\nBritish were too arrogant to pay attention to what the natives did or learn their skills.\nScott tried ponies and motor vehicles, really inappropriate in polar regions, useless, never\nmastered dogs or skis. Ended up with men hauling sledges. Lost race, and whole team\ndied on way back from Pole.\nSimilarly, in 19th century in Arctic, Franklin expedition, famous disaster, ended up all\ndead, some cannibalism, while nearby Inuit doing fine.\n\nSo one answer, for us as well as Arctic explorers, is to pay close attention. I got a Kuna\nmetaphor that described birds called giblu, said to fly around sky in formation fighting\ninvisible battles with spirits. In September of that year I saw them, were migratory\nhawks, red-tailed hawks and others, same as in U.S. Hawks and buzzards migrating\nthrough area circle around in huge vortices in sky, like bird tornado, turns out they are\ncircling on thermals to get altitude before peel off and move on. Explains metaphor.\n\nProblem for us is that we are too detached from natural world. Even simple farmyard\nmetaphors may get past us because of ignorance. David Sapir has wonderful discussion\nof why dirty old men are compared to goats.\n\nSame with allusions to classics and Bible. In past people had read Bible, often knew\nintimately. One could make metaphor simply by mentioning a character in Old or New\nTestament, or even by citing a verse.\n\nStill, this is only part of answer, because goats and flowers and hawks and figures in the\nBible have many attributes. How do we know which are relevant in particular case?\n\nMust remember that every trope has two parts, the two things that linked together. We\nget at meanings by comparing the two parts, deciding what features they share. Often\nhave to look at context of metaphor---what have been talking about, where you are, etc.--\n-in order to decide which of shared features are relevant right now.\n\ne.g. Bears. many attributes. depending on context and who or what compared to, salient\nfeature could be love of blueberries, skill as fishermen, interest in garbage or in grubs in\nrotten logs, hibernation, etc. etc. But if talk about Russian bear, standard political\nmetaphor, then comparison of two parts suggests shared attributes. [In class, these are\nindicated by two large overlapping circles, with shared attributes written in the\nintersection of the two circles.]\n\nIn this metaphor probably have in mind: bears' danger, temper, ferocity, formidable as\nenemy or adversary, reclusive, burly, hairy, lives in cold climate, may be emerging from\nisolation. The trope comments on Russians and Soviet government.\n\nHas been suggested by theorists that metaphor actually consists of two linked\nsynecdoches. Each side is concrete thing (bear/Russian) and classes of things of which it\nis an example (burliness, isolation), thus a synecdoche. One doesn't have to accept this\nidea, but underlines fact that we are comparing two things, looking for the attributes they\nshare, as they are seen within a particular context.\n\nFamous example of decoding. Men of a tribe in central Brazil, the Bororo, say \"We are\nred macaws.\" (Macaws are a kind of parrot.) recorded by a 19th century explorer, this\nstatement was used by Lucien Levy-Bruhl, a theorist who wrote about \"primitive\nmentality\" as a prime example proving that \"primitive\" tribal peoples were either too\nstupid or too controlled by group thinking to see that they really weren't parrots. Levy-\nBruhl had lots of other examples supposedly showing that primitive man couldn't draw\nboundaries between himself and other things.\n\nMore recently, anthropologist named Christopher Crocker worked with the Bororo,\nwanted to solve famous mystery. Turns out it is crucial that only men say they are like\nmacaws: it is about being a Bororo man. To decode, he had to learn all about macaws,\nand about men. (In Sapir & Crocker 1977, in supplementary readings.)\n\nMacaws are associated with spirit world for several reasons: places where they are\ncaught, mostly by robbing nests, is a lair of spirits. Dead souls pass through\ntransformations, one as macaw. And men wearing macaw feathers are possessed by\nspirits in ritual. But macaws are also kept on little perches by house doors, fed banana by\nwomen, periodically plucked of feathers.\n\nMen see selves as spiritual, women as material; men are the ones who manage ritual. In\nthis way they see selves as superior to women. But men when marry move into wife's\nhouse, are never more than provisional member of household. Spend most of day with\nother men, go home briefly to be fed by wife.\n\nSo men are like macaws in that associated with spirit world, but also dependent on\nwomen, who keep them as kind of pet, feed them as do the parrots. Instead of a mindless\nclaim showing primitive mentality, it is really a very subtle statement about the paradoxes\nof gender roles in Bororo society."
    },
    {
      "category": "Resource",
      "title": "introduction.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-212-myth-ritual-and-symbolism-spring-2004/81914a73db2b67114dcf98a706f4a777_introduction.pdf",
      "content": "1. INTRODUCTION (2/04)\n\nIntroduction to the anthropology study of symbolism\nNo prereqs, open to anyone\nRun as combination of discussion and lecture\nReadings keyed to each class, crucial that stay up, is core of course\nNo exam, just class participation and short papers\n\nWill look at several kinds of symbolism anthropologists typically study.\n\n1. Myth. Narratives, often set at beginning of world, very significant for life today\nbut very different from today: Story of man who lives alone; one day comes home to\nfind food cooked. So hides in bushes next time goes to forest, watches his dog turn\ninto a woman, cook his food. Next time he keeps her from turning back into dog,\nmarries her. Then more episodes...\n\nBut also everyday narratives: what I did yesterday; how I wrecked my car; why so-\nand-sos are no good; why all our projects fail; how I beat cancer.\n\n2. Ritual. action of special sort. Some traditional African kingdoms, before new\nking put on throne, had to endure abuse, treated as vile. Famous Japanese temple\nrebuilt every twenty years, elaborate ceremonial at each step of taking apart and\nrebuilding.\n\n3. Magic. Ritual that accomplishes something concrete. In society where I worked,\nman chants to animals before hunting, gets them to fall in love and come to him. If\naccidentally thinks of women while chanting, then no animals but lots of love affairs.\n\n4. Taboo. prohibitions and negative magic, things shouldn't do. Don't eat pork,\ndon't eat beef. If pregnant, eat crackers but not bread.\n\n5. Cosmology and symbolic systems. Elaborate schemes of how the universe put\ntogether. In one system, 8 layers in universe. Soul must travel thru all 8 to get to\nheaven.\n\nSo we will be looking at lots of juicy, exotic stuff. But we will be looking at\nsymbolism in our own society as well, often just as exotic, certainly a crucial part of\nlife. Nothing secondary or trivial or decorative, often crucial issues in social life.\n\nWhat is distinctive about anthropological approaches to symbolism?\nAnthropology has borrowed from other fields concerned with symbolism, but we are\ndifferent from most of them.\n\nMany psychologists are most concerned with private symbols. Freudian analyst\nwants to decipher the symbols in patient's dream, use as key to patient's unconscious\n\nWhen Freud looked at shared symbols, he often treated them as a kind of mass\nneurosis or psychosis\n\nBut anthropologists are most concerned with public, shared symbols. Something\nused or recognized by all the members of a group. And we do not treat public\nsymbols as derivatives or offshoots of private symbols\n\nJust because the symbols are public doesn't mean that their meanings are necessarily\nobvious. Some symbols may be public but obscure.\nWith the people I studied in the field, the Kuna of Panama, sometimes when I asked\nwhat something meant, it could be explained right away. Why did chief sing about\ntermites in a tree trunk? Answer: It refers to a bad chief, who looks good on the\noutside but is rotten on the inside. For other symbols, they couldn't or wouldn't\nexplain. At end of one ritual, they shoot a rooster with bow and arrow, I asked what\nit meant, they said they'd always done it that way, end of explanation. May even\nrefuse to see as symbolic: a chief told me a myth, young men hiding behind a tree. I\nasked why that kind of tree, what did it mean? Chief said, well that just happened to\nbe the tree that was there when they needed to hide.\n\nPsychologists, when they leave the individual, often jump to the universal. Look for\nthe meanings of a symbol in all cultures. e.g., every time someone dreams of a train\ngoing into a tunnel, always means the same thing. There may be individual variants--\n-one patient may dream more often about trains, or a specific kind of train---but\noverall it is pretty constant. Jung and Jungians also looked for universals.\n\nAnthros, on other hand, recognize wide variation in meaning from one culture to\nanother. Some societies say the moon is female: the Kuna say it is an incestuous\nmale.\nSome cultures say dogs are wonderful, loveable; others that they are nasty,\npromiscuous, dangerous curs that eat, crap everywhere, and mount anything on legs.\nOthers say neither, just that dogs very tasty.\n\nWestern culture makes much of the number three. Kuna and many other societies\nthink four and multiples of four best: balanced, like the quarters of the universe.\nChinese, I am told, avoid four because it sounds like the word for death.\n\nSo there can be great variation from one culture to the next. Also, the meaning in a\nparticular culture is often most interesting and significant for how people understand\nand use symbols.\n\nThis doesn't mean that we won't find things that are similar from one culture to the\nnext. We may even infer the existence of some universals. But mostly we want to\nread symbols in their local context.\n\nMany students of symbolism most concerned with meaning. Anthros are very\nconcerned with meaning, but also want to know how symbols used, what symbols do.\n\nSymbols can help maintain the status quo, or they can convince someone to spend a\nlifetime fighting the status quo. They can take a child and turn him or her into an\nadult. They can sometimes even cure the sick. So we want to look at symbols in\naction.\n\nThe readings for this course consist mostly of article and chapter-length selections on\nparticular cases. Some easy, some more difficult. We will discuss and work through\nthe readings and try to build up some generalizations. I will also supply some\ngeneralities in class.\n\nWe will focus on particular kinds of symbolism and particular problems and issues in\nthe study of symbolism. We will not be doing a history of schools of thought or\ntheorists of symbolism. We will also not be introducing a lot of technical vocabulary,\njust a few basic terms and distinctions. Special terms are helpful sometimes, but in\nmy opinion too many people working on symbolism and meaning get themselves lost\nin a thicket of terms and dogma.\n\n[Class sessions will consist in large part of question-and-answer and discussion; in\nthese notes, however, they are presented, with some exceptions, as discursive\nlectures.]"
    },
    {
      "category": "Resource",
      "title": "laworder.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-212-myth-ritual-and-symbolism-spring-2004/e64fb8bb3a5c0ab7d96b5c2ba7b8b283_laworder.pdf",
      "content": "21A.212\n\nCorinne Packard\nProppian Analysis\n\n\"In the criminal justice system, the people are represented by two separate yet equally\nimportant groups -- the police who investigate crime, and the district attorneys who\nprosecute the offenders. These are their stories.\"-Law & Order\n\nProppian Analysis of \"Law and Order\"\n\nThe award-winning NBC series, \"Law and Order,\" about investigating crimes and\npunishing criminals has a highly formulaic pattern which can be analyzed using methods similar\nto those of Vladimir Propp in his book, Morphology of the Folktale. The plots of the series often\nbear a striking similarity to actual events in the news, though a disclaimer at the end of the show\ninsists that the plots are all fictional. Crimes involving stem cell researchers, Falon Gong\nparticipants, civil rights-sensitive cases, and September 11th fraud cases were all used during\nSeason 13 of \"Law and Order.\" Perhaps one of the reasons the series is so popular is because it\ndramatizes yet seems to imitate real life. The \"Law and Order\" series has been running on NBC\nfor 14 seasons and also has several derivative shows, \"Law and Order: Special Victims Unit\n(SVU)\" and \"Law and Order: Criminal Intent (CI).\" While a Proppian analysis could likely be\nextended to the entire spectrum of \"Law and Order\" episodes, this paper will focus for the sake\nof brevity just on episodes from season 13 of the original \"Law and Order\".\nEach episode breaks clearly into two parts: the law section (represented as I) and the order\nsection (represented as II). The law section is further broken down into all the elements of the\ndetectives investigating a crime and determining which laws have been broken.\nA.) Discovery of a death (or deaths)-- A death is discovered by either a civilian (Ac), the police\n(Ap), or by some other city worker (Aw). The crime is reported to the police and they\nsecure the crime scene.\n\nB.) Evidence is collected and examined--Evidence is collected by the police and examined by\nthe forensic team. Evidence may be collected from the victim's body (Bb), from the crime\nscene (Bc), from the victim's belongings or residence (Bv), or from a suspect's belongings\nor residence (Bs). Evidence is analyzed and either points to a new lead (Æ l), confirms\nsuspicions (Æ c), or results in a dead end (Æ e)\nC.) Witness interrogations--Different witnesses are interrogated to determine their involvement\nin the crime or knowledge of the events. Different witnesses may be interrogated: eye-\nwitnesses who were present at the time of the crime (Ce), neighbors surrounding the crime\nscene (Cnc), neighbors to the victim (Cnv), or neighbors to the suspect (Cns). Interrogations\nmay result false alibis (Æfa), true alibis (Æta), leads to new evidence or witnesses (Æl), or\ninformation about motive (Æm).\nD.) Suspect arrested--A suspect is arrested and brought to the precinct. The suspect may either\nrequest a lawyer (Dl) or confess to a crime (Dc). Sometimes no further detail besides the\narrest is given (D).\nThe 'order' part of \"Law and Order\" consists of actions taken by the district attorney in trying\nthe case before a judge or jury. This sequence can be broken down just as the 'law' sequence.\nE.) Evidence excluded-- A judge may exclude evidence such as physical evidence (Ep)\nor a confession (Ec) based on misconduct by the police.\nF.) Plea bargain--A plea bargain is either requested (Fr) or offered by the district attorney (Fo).\nA request for a plea bargain may be denied by DA or the terms may be rejected by the\nsuspect (Æd).\n\nG.) Witness/Suspect on the stand--A witness (Gw) or the defendant (Gd) takes the stand to\nanswer questions from the district attorney or defendant's counsel. This may lead to\nindications that the defendant may be guilty (Æ g) or may be innocent (Æ i).\nH.) Verdict-- This element may or may not be included directly in each episode. There are four\npossibilities: a verdict is implied, but not announced (Hn), a verdict is unknown (Hu), a\nguilty verdict is returned (Hg), or an innocent verdict results (Hi). There is also the\npossibility that the judge may overrule a verdict, changing the outcome to innocent (Æi), or\nguilty (Æg).\nFinally, one last element must be introduced: the 'wild card.' A wild card can be placed in\neither section I or II. The wild card defines a moment when a dramatic twist is introduced into\nthe case. The wild card can be described as follows:\nW*.) Wild Card-- a plot twist arises that is a dramatic change in the case. The wild card\nusually brings the plot back to a major element of the action. For instance, if tests on evidence\nreveal that a gun wasn't actually the murder weapon, the wild card would be represented as\nW*(B), or if the suspect is revealed to be uninvolved in the case, the notation would be W*(D).\n\nOne can see how this Proppian analysis works for specific episodes. For example, the 2\nepisodes \"Tragedy on Rye\" and \"The Ring\" are analyzed in the separate file lawandorder2.ppt\n(for ease of graphical illustration of the plot structure). The plot synopses offered here were\nwritten for this paper, but the official summaries can be seen on the show's NBC website\n(http://www.uni-television.com/laworder/html/episode/index.html)."
    },
    {
      "category": "Resource",
      "title": "metaphortropes.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-212-myth-ritual-and-symbolism-spring-2004/4e712003e508c9fbc2c0a73d0cdf5a4e_metaphortropes.pdf",
      "content": "4. METAPHOR AND OTHER TROPES (2/17)\n\nSusan Sontag sometimes insists that we only think about things literally, without using\nmetaphor, but it is not clear we can do that, because figurative language is so pervasive in\nall human languages\n\nWe need to make some basic distinctions, starting with the word Trope. Metaphor is one\nof several kinds of trope.\nA trope is a figure of speech (though we will also see that can exist outside of language)\nin which one thing is linked symbolically with something else.\nIt is sometimes seen as a replacement or substitution, as putting one thing in the place of\nanother: You're a chicken/ a turkey/ acting like a pig/ howling like a wolf.\nHe's a good egg/ a brick/ an angel/ pond scum.\nThe British comedian Terry Thomas used to say \"Hard Cheese, old chap\" meaning tough\nluck. A boat named the \"Flying Cloud\"; a town named \"New York\" or Turner's Falls---\nall are tropes.\n\nIt is sometimes said that a trope is calling a thing something it isn't: I can see that you're\nnot really a dirty dog or an old goat.\nSometimes this point has been taken even further, to suggest that all tropes are lies.\nSontag sometimes seems to pick up some of this attitude.\nBut we will see that this is a slippery distinction, because often tropes are not \"just a\nfigure of speech\": to say that Jesus is a shepherd or God is a father is not merely\nmetaphorical to a devout Christian.\nMoreover, the essential nature of many thing is often unclear or inchoate. We sometimes\ndefine what something is by tropes.\nNo reason to see tropes as anything but good, also as inevitable. No way anyone can get\nby with just literal speech.\n\nMetaphor. When people say \"metaphor,\" they often mean tropes in general, but it's best\nto save this word for one variety of trope.\nNamely one that links two separate things that are in some sense alike or equivalent or\nparallel or correspond with each other.\nHair of the dog that bit you/ Nixon as a used car salesman/ Elvis as teddy bear (not lion\nor tiger). Any trope where two separate things are likened to each other, where they\nshare attributes.\n\nNotice that metaphor is often distinguished from simile, in that similes make overt\ncomparisons, often using the word \"like\". Also distinguished from analogy, a term that\ntends to be used for more formal, abstract comparisons, or for complex metaphors.\nWe will ignore these distinctions. For us, all are varieties of metaphor: they have same\nstructure and intent, whether one says he is a lion or is like a lion. The term allegory is\nused for especially self-conscious or elaborate or moralizing metaphors.\n\nMetonym. Another trope, which links two things that are somehow connected,\nphysically or factually, or contiguous, but not necessarily alike.\n\nOne formal definition, from David Sapir (see supplementary readings), says metonym,\n\"Rather than the relationship of two terms from separate domains that share overlapping\nfeatures, it is the relationship of two terms that occupy a common domain but do not\nshare common features\" (1977:20).\n\nThus umbrellas can be metonyms for many things with which they are associated: rain\n(as in symbol in newspaper weather forecast table), Winnie the Pooh, British civil\nservants, appeasement of dictators (because of Neville Chamberlain in 1938).\nQ. What are things for which cigars are used as metonyms?: for tough guys, men on their\nown, bad smells, politicians, childbirth, Fidel Castro, Winston Churchill, tongue cancer,\netc. etc.\n\nAnything that is associated with something or someone can be a metonym for it:\nCowboys and guns, saddles, cows, prairies, chuck wagons, drinking, singing, fist fights,\nDodge City, the streets of Laredo, body odor, etc.etc.\nGeographical names are often metonymic: Cedar Rapids, Blue Hill, Turner's Falls,\nIndian Lake.\n\nQ. What about cars? What are the metonymical and metaphorical connections of cars as\nwholes, and parts of cars? Back seat or rumble seat with sex. The trunk with mob\nkillings. Hubcaps and radios with theft. Ad infinitum. Often elaborated, as in\nSpringsteen's \"Pink Cadillac.\"\n\nIn all of these examples, metonym is constructed on the basis of physical contiguity or\nconnection. Physically in same domain or joined. But, according to traditional\ndefinitions, which come down from Aristotle, it can also be logical contiguity or\nconnection:\nCause for effect: \"It's the liquor talking\" (about a belligerent drunk).\nEffect for cause: \"We laid a patch\" (meaning we accelerated sharply).\nContainer for contained: \"The Vatican issued a statement today.\"\nInstrument for agent: \"You have gotten yourself a machete\" (what is said to a new bride\nabout her husband as worker among the Kuna).\nAct for agent.\n\nIf we return to Sontag, we can see that when she says metaphor, she often means tropes\nin general and only sometimes metaphor in particular.\nIf TB is said to gallop, it is a metaphor about TB drawn from the domain of horses.\nIf the white race is called the cancer of the world, it is metaphor drawn from the domain\nof disease about a human population.\nIf TB is said to have been associated with travel, exotic places, or exile, these are all\nmetonyms.\nSeeing cancer as an invasion is metaphorical; claiming that it follows from sexual\nrepression is metonymic, cause and effect.\n\nSynecdoche. There is one more kind of trope to be noted. Synecdoche is a trope in\nwhich the relationship between the two things is one of part to whole. The most\ncommonly cited example is use of sail to mean a whole ship.\nVery frequent with hands: cowhands, deck hands, old hands, all hands on deck.\nKuna also say to bride, \"You have gotten yourself a hand.\"\n\nLike other two tropes, synecdoches are ubiquitous. Any kind of symbolic relationship\nwhere smaller represents larger or vice-versa. Macrocosm and microcosm: cities on\nsame plan as universe, house within city on same plan.\nAlternative therapy called reflexology: whole body is mapped out onto foot.\nJournalists are addicted to synecdoche: they examine one family or school or army unit or\nhydroelectric project and then treat it as typical of all such things.\nFamous documentary TV show from years ago about family named Loud: treated as if\nstood for all American families.\nSame in literature, drama, where situation is seen as in some way typical of all Americans\nor all humans or all whatevers: Death of a Salesman, Archie Bunker, Everyman, Hamlet.\n\nSome theorists treat synecdoche as just one kind of metonym. I think it is useful to\ndistinguish them. (More on this later.)\n\nSapir (1977:13-19) distinguishes two varieties of synecdoche, taxonomic and anatomical.\nAnatomical wherever it is a physical part/whole relationship: Just direct your feet to\nsunny side of the street. (No implication that you should leave the rest of your body\nbehind.\nAlmost any part of the human body: He is a brain/ an asshole/ a legman.\nCaricatures depend on a kind of physical synecdoche. Nixon's stubble or Barbara\nStreisand nose or Jimmy Durante's nose stands for whole person.\nTaxonomic where it is one kind of thing: where Columbine stands for all school violence\nor all schools. Where King Lear stands for all foolish or anguished old men.\n\nSo we have three basic kinds of trope.\nIt is important to remember that all three consist not of single things by themselves, but\nof relationships between two or more things.\nAlso, we will see that particular tropes may involve more than one kind of connection to\nsomething else. Something can be both contiguous and alike, thus both a metaphor and a\nmetonym. If we say dogs are like owners, a point often made humorously, dogs are thus\nboth connected with owners and resemble them.\nMany discussions of tropes have gotten completely tangled up or off on a wrong track\nbecause of the assumption that a figure can only be one thing or another.\n\nAll three terms come from Greek rhetoric, which actually has many more figures. But\nthese three enough for us. Fourth often recognized is irony.\nI prefer to see irony as a way of framing tropes or descriptions or claims or whatever is\nseen as ironic. Involves negation---I don't really mean it---or some other twist on the\nstatement or claim.\n\nThe sources of metaphor.\nAs soon as start paying attention to the three tropes, see that ubiquitous, pervasive.\nCan't get away from them.\nOne approach is to look at the sources of metaphor, the subject areas drawn on to make\nmetaphors about other things.\n\nWe will see later on some of the symbolic uses of foods, cooking, eating, etc.\nConsider how (supposedly) characteristic foods are used to label national and ethnic\ngroups: Limeys, Frogs, Beaners, Greasers, Krauts, etc.\nAny field, any domain of concern gets drawn on to make metaphors: weather, time of\nday, etc.\n\nIn some cases such metaphors hold on even after the field has changed: we still have\nhundreds of metaphors from the age of sailing ships, for some of which we have\nforgotten the logic.\nAbout people: derelict, hulk, loose cannon, old hand, mate, etc.\nActions: launch program, fend off, jump ship, scuttle, salvage, to ship something, etc.\nAnd especially concerning politics and government: ship of state, who's at the helm?\ndrifting, figurehead, change course, etc.\nDangers, problems: uncharted waters, sail close to wind, on lee shore, devil to pay, any\nport in storm, etc. etc. etc.\n\nLogic often unclear today: Back and fill (now often taken as parking metaphor) about\nstate of ship when drifting under control, sail alternately backing and filling. Loose\ncannon trope is vivid if see effect of uncontrolled cannon on wheels rolling around deck.\n\"Devil\" was last, outermost, seam between boards of deck, \"paying\" was caulking,\nhardest with that seam. Full version of saying was: \"The devil to pay and no pitch hot.\"\n\"Taken aback\": probably not even aware that it is a nautical metaphor. Describes what\nhappens when wind veers 180 degrees on square-rigged ship; suddenly driven straight\nbackwards. Strong metaphor for being surprised or shocked by something.\n\nLearning basic metaphors essential to participating in culture.\n\nClock as a resource for metaphor.\nSometimes new source of metaphors can transform thinking. Happened with invention\nof watches and clocks, most complex and impressive machine, people seized on them to\ntalk about other things.\nDescartes used to differentiate animals from humans: animals are like clock, essentially\nmechanical, no soul like humans.\nParts of natural world compared to parts of clock to argue for existence of God: if look at\nclock spring, can infer a clockmaker and a design for the whole; same true if look at an\neye or a whale. Argument from design.\nCould also be used to suggest purpose in universe, one we can't understand, like purpose\nin watch.\nBut some used in other ways: notion that world like clock, in that God sets it going in\nbeginning and then leaves it to run on own. Clock-maker god, not intervening\n\ncapriciously in people's lives as things come up. Some loved idea, made world seem\norderly; some hated it, made world too impersonal.\nSome romantics rebelled against \"soulless\" mechanistic ideas, attacked clock analogy.\n\nTropes as structure.\nStudy of tropes has revealed how crucially important they are in all sorts of areas: they\nprovide structure or a model of how to think about something. True in science, religion,\nhistory, and just about everywhere else.\n\nDream Interpretation.\nWe have an article by Gregor on Mehinacu dream interpretation.\nSome of their interpretations are outside our experience, but they all make perfect sense\nonce they are explained.\nQ. What does dream about an anaconda mean? Q. What do you need to know about\nMehinacu life to understand? Q. What about heaps of tapir dung? or wasp stings? or\nflying ants?\n\nThe Kuna, who live far way to North and West in Central America, differ in the specifics\nof their dreams and interpretations, but the interpretive principles are exactly the same.\n\nYou are standing on another island, your pants are ripped: means they are talking about\nyou at home.\nYou catch many fish: you will win the national lottery.\nYou see an American: you will hunt a white-lipped peccary (which goes in groups and\ntrumpets like U.S. soldiers in the Canal Zone). You see a Panamanian: you will hunt a\ncollared peccary (which goes singly or in small groups and is less noisy).\n\nVery striking that Freudian dream interpretation uses same mechanisms.\nHis theory is very different. Concerned with unconscious mind, wishes/ideas/emotions\nwhich too dangerous or frightening or turbulent to express or think about consciously, so\ndream them in hidden form.\nAnalyst is trying to find out, not what the future will bring, but what locked inside\nunconscious mind.\nFreud used different terms. But basically just treated the dream symbols as hidden,\ndifficult metaphors and metonyms. Analyst's job to unlock those tropes.\n\nDivination. Dream interpretation is just one variety of divination, meaning any\ntechnique to peer into the future or hidden realms of the present. Will I die soon? Does\nshe love me? Who is bewitching me? What hidden forces killed my brother?\nBasic structure is more often than not based on trope: what happens in whatever thing or\nwhatever area of life used for divination parallels what will happen: put a shoulder bone,\na scapula, in fire, the cracks on the bone are read as image of where will go on the land to\nfind animals to hunt.\n\nOften, the divination is based on a really obvious metaphor.\n\nWhen a couple marries among Kuna, send someone to nearby coral reef, find pair of\ncrabs in a hole: how the crabs act together predicts whether marriage will be happy or\nconflict-filled.\nAstrology, both western and Chinese, based on part on set of animals and reading of\nthose animals as metaphors about individuals born under those signs: Scorpios are\ndangerous or sexual, Tauruses obstinate, Geminis two-faced or ambivalent.\n\nMagic. Divination is one among many kinds of magic. Long ago, anthropologist James\nFrazer said were two kinds of magic, sympathetic and contagious, basically metaphor and\nmetonym.\nSympathetic magic, metaphorical, works through similarity: stick pins in a hex dolly,\nstands for victim\nContagious magic, metonymic, works through contact: stab footprint, or work on\nsomething the victim has touched or used. Or hide something magical near victim.\nAlso synecdoche, something from victim: hair, nail clippings.\nOften all three at once: hex dolly with toenail clippings inside it hidden under bed.\n\nEverywhere in world systems of magic depend on the three tropes.\n1. In one African society: when want abundance of something, use bark from a tree with\nmany small fruits; when want a lover, use a tree whose blossoms attract bees; when want\na baby to be born, use a tree whose fruits draw animals out of the forest.\n2. In a society near New Guinea, when one wants a storage house to be secure, to stay\nundamaged by storms: use wood from a tree with tenacious roots, another tree so hard it\nbreaks axes, and wood from the wild ginger, which fiercely repels animals.\n3. Among Kuna, if the patient has scaly shedding skin, it is caused by a snake spirit; to\ncure a cold, use bark from tree with white sap. Carved figures representing helpful\nspirits, each spirit has character of wood: thorny, with tough fruits, etc. Leader is of balsa\nwood, smartest, because soft head is one that lets learning in.\n\nMagical spells, from Guianas in Northern South America.\nSpell to cure eye infection:\n\"Sun-child eyes are blocked up with clouds/fire/smoke that meets you\nshort-dry-season sun-child tries very hard meets screecher parrot\"\nQ. What is the metaphor? Comparing cloudiness of eye with infection to sun blocked by\nsmoke. Need to know that in dry season, with slash-and-burn agriculture, huge clouds of\nsmoke as burn off forest. Screecher parrot flying through and dispersing smoke is like\ndesired cure of infection.\n\nAnother from same group, to cure whooping cough, called \"howler monkey sickness\"\nCharm describes a tree, with monkeys and sloths and other animals holding onto it with\nclaws. Invokes a chicken hawk and eagle to come catch the animals. Q. What is\ncomparison? Throat like tree trunk. Claws of animals like pain in throat. Also howler\nmonkeys make huge noise, very deep, like deep bronchial cough.\n\nStriking how much in all these examples the logic stays the same, despite differences in\nthe specifics.\n\nTaboo. Negative magic or taboo, avoidance of things that symbolically bad, taboo.\nKuna have many for pregnant women. Can eat little fish, not big--why? (Want small\nchild, easy to give birth.) Must eat crackers not bread---why? (Bread expands, rises,\nfetus would be too big, no easily born.) Why don't eat cold rice? (Too sticky, want birth\ncanal slippery, baby to emerge easily.) Why avoid jaguar pelts? (Don't want baby with\nspotted skin condition.)\n\nOther side of world, birth taboos have exact same logic: No reef fish, because live in little\ncaves in coral, hard to pry out. No rotten fruit, because rotting is like dead baby.\n\nRiddles, proverbs. Also depend on tropes:\nExamples from Kuna: Q. What animal is \"Meat in a can\"? (tortoise)\nQ. What is \"noisy silver\"? (a river)\nQ. What bird is \"Head falls first\"? (Riddling name of toucan, whose bill is so heavy that\ndrops head first if shot---metonym or synecdoche)\n\nProverbs are based on tropes: Don't ask the fox to guard the chickens, etc. etc.\n\nHumor\nHuge subject, but can see that at least sometimes based on tropes. When, as in The Far\nSide and in many other comic strips, animals do human things, is playing with metaphor.\nOften what makes a joke funny is a displacement or movement from one domain to\nanother.\nHilarious column by Maureen Dowd on Chinese snakefish, big scare in 2002, having\ngreat fun comparing in backwards way with businessmen, Monica Lewinsky, etc. (NYT\n7/07/2002). HYPERLINK HERE **************************************\nEven heading, \"coming on little fin feet\" is play on famous trope of fog coming in on\nlittle cat feet, joke is that fish really does walk, literally.\n\nEuphemism. Figures of speech that tone down or hide rough talk, unfortunate or filthy\nthings. Also depends on tropes.\nSome obviously based on metaphors. Kuna refer to urination as bailing your canoe,\ndefecation as sending a telegram.\nQ. Can you think of examples? Any of you who are native speakers of languages other\nthan English?\nOften such figures don't seem so euphemistic, not hiding or playing down or minimizing\nsomething, but joking about it. Kicked the bucket, bought the farm.\n\nSome metonymic. What examples come to mind? \"Go to bathroom\" is what do on way\nto urinate. \"Bathroom\" itself is metonymic, since we are most often concerned in such\nrooms with elimination, not bathing. Sleep with someone.\nKuna say \"Look North\" for urination and defecation, because outer, northern side of\nislands, is where go to do it.\n\nMany are based on a funny kind of synecdoche. Taxonomic. Takes advantage of fact\nthat one concrete thing can be part of many general classes of things. Choose general\nclass that sounds mild. To say that handicapped person is \"physically challenged\" is\ncertainly true---being blind is a challenge, as are many rough things like being attacked\nby a bull---but challenges also include many much milder problems, so the figure\neuphemizes the condition. Same with civilian dead called casualties or collateral damage\nor even adversely affected, or lying as mis-speaking.\n\nOne problem with euphemisms is that when become standard, lose some of euphemistic\npower: \"retarded\" now not felt as euphemistic enough, so have \"developmentally\nchallenged.\"\n\nSome euphemisms are not based on tropes, but on similarities in sound, though same kind\nof displacement as in tropes : Some English-speakers say sugar instead of shit, also\ncripes, Gee, Jees Louise, Heck, etc. Latin Americans say chuleta (pork chop) or\nChihuahua instead of chinga. British Cockneys had whole form of semi-secret speech\nbased on substituting silly rhymes."
    }
  ]
}