{
  "course_name": "Nazi Germany and the Holocaust",
  "course_description": "The rise and fall of National Socialism is one of the most intensively-studied topics in European history. Nevertheless, after more than half a century, popular views of Nazism in the media and among the public remain simplistic-essentialized by equal parts fascination and horror. Adolf Hitler, for instance, is often portrayed as an evil genius of supernatural ability; while the Nazi state is similarly imagined to have held absolute power over every aspect of its subjects’ lives. Such characterizations allow ordinary Germans to be portrayed as helpless victims of Nazism, ensnared or coerced into submission by forces beyond their control. Another popular characterization is that German culture itself is fundamentally flawed - that all Germans were basically Nazis at heart. This schema conveniently erases the manifestations of fascism in other Western nations, and allows Americans and other Westerners to reassure themselves that the horrors of Nazism could never emerge in their own enlightened national cultures.",
  "topics": [
    "Humanities",
    "History",
    "European History",
    "Modern History",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology",
    "Political Science",
    "Humanities",
    "History",
    "European History",
    "Modern History",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology",
    "Political Science"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.2 hours / session\n\nSyllabus Archive\n\nThe following syllabi come from a variety of different terms. They illustrate the evolution of this course over time, and are intended to provide alternate views into the instruction of this course.\n\nFall 2007, David Ciarlo (\nPDF\n)\n\nSpring 2007, David Ciarlo (\nPDF\n)\n\nFall 2004, David Ciarlo (\nPDF\n)\n\nDescription\n\nThe rise and fall of National Socialism is one of the most intensively-studied topics in European history. Nevertheless, after more than half a century, popular views of Nazism in the media and among the public remain simplistic-essentialized by equal parts fascination and horror. Adolf Hitler, for instance, is often portrayed as an evil genius of supernatural ability; while the Nazi state is similarly imagined to have held absolute power over every aspect of its subjects' lives. Such characterizations allow ordinary Germans to be portrayed as helpless victims of Nazism, ensnared or coerced into submission by forces beyond their control. Another popular characterization is that German culture itself is fundamentally flawed - that all Germans were basically Nazis at heart. This schema conveniently erases the manifestations of fascism in other Western nations, and allows Americans and other Westerners to reassure themselves that the horrors of Nazism could never emerge in their own enlightened national cultures.\n\nIn fact, most of the myths about Nazism can be traced directly back to images that the National Socialists themselves carefully constructed in their rise to power. (And post-1945 political concerns-the need for a \"new\" Germany to distance itself from the crimes of the Nazi regime; Cold War efforts to equate Nazism with Communism and fascism with capitalism-reiterated these myths.) This class will peel away at the image of Nazism by investigating the rise of National Socialism as a political, social, and cultural phenomenon, and by placing its development firmly within the larger framework of German history.\n\nAbout a third of the class will address the perpetration of the Holocaust, the nadir of Western civilization. We will grapple with the roots of the Holocaust in ideology, culture, prejudice, and even in some of the most mundane practices of modern life. One of the central aims for this course is to think about whether Nazism, and the crimes that it perpetrated, were part-and-parcel of what we think of as \"modernity,\" or were a horrific deviation from it.\n\nRequirements\n\nThere will be an in-class, closed-book final exam.\n\nIn addition, there will be three 5-6 page papers: due 3 days after Session 9, and Session 17 and Session 24.\n\nI want to emphasize here that the discussion of readings in class will be a significant part of this class. Participation in discussions will count for 20% of the final grade.\n\nGradings\n\nACTIVITIES\n\nPERCENTAGES\n\nPaper 1\n\n15%\n\nPaper 2\n\n20%\n\nPaper 3\n\n20%\n\nDiscussion\n\n20%\n\nFinal Exam\n\n25%\n\nPlease note:\nplagiarism of any kind - that is taking another's words and/or ideas from a book, another student, or from the internet without full and complete citation - will not be tolerated regardless of the circumstances, and will result in an \"F\" for the final class grade.",
  "files": []
}