{
  "course_name": "Neuropharmacology",
  "course_description": "The neuropharmacology course will discuss the drug-induced changes in functioning of the nervous system. The specific focus of this course will be to provide a description of the cellular and molecular actions of drugs on synaptic transmission. This course will also refer to specific diseases of the nervous system and their treatment in addition to giving an overview of the techniques used for the study of neuropharmacology.\nThis course is offered during the Independent Activities Period (IAP), which is a special 4-week term at MIT that runs from the first week of January until the end of the month.",
  "topics": [
    "Health and Medicine",
    "Pharmacology and Toxicology",
    "Science",
    "Biology",
    "Neuroscience",
    "Health and Medicine",
    "Pharmacology and Toxicology",
    "Science",
    "Biology",
    "Neuroscience"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 1 hour / session\n\nCourse Description\n\nThe neuropharmacology course will discuss the drug-induced changes in functioning of the nervous system. The specific focus of this course will be to provide a description of the cellular and molecular actions of drugs on synaptic transmission. This course will also refer to specific diseases of the nervous system and their treatment in addition to giving an overview of the techniques used for the study of neuropharmacology.\n\nLecture Schedule\n\nFour 1 hour lectures in January.\n\nCourse Prerequisites and Requirements\n\nThis course is open to both graduate and undergraduate students with a basic knowledge of neuroscience principles.\n\nCourse Requirements\n\nOutline\n\nThe key topics covered in this course are listed below:\n\nIntroduction to neuropharmacology\n\nPrinciples of neurobiology\n\nNeurotransmitter systems:\n\nGlutamate and GABA\n\nCatecholamines\n\nAcetylcholine and serotonin\n\nDisorders of the nervous systems and their treatment\n\nTechniques in neuropharmacology\n\nRecommended Texts\n\nThe following texts are recommended for this course:\n\nMeyer, Jerrold S., and Linda F. Quenzer.\nPsychopharmacology: Drugs, the Brain and Behavior\n. 1st ed. Sunderland, MA: Sinauer Associates, 2004. ISBN: 9780878935345.\n\nNestler, Eric, Steven Hyman, and Robert Malenka.\nMolecular Neuropharmacology: A Foundation for Clinical Neuroscience\n. 2nd ed. New York, NY: McGraw-Hill Professional, 2008. ISBN: 9780071481274.\n\nCooper, Jack R., Floyd E. Bloom, and Robert H. Roth.\nThe Biochemical Basis of Neuropharmacology\n. 8th ed. Oxford, USA: Oxford University Press, 2002. ISBN: 9780195140088.\n\nGrading\n\nThere will be a final exam for this course. The exam will be a pass/fail multiple choice exam.\n\nCalendar\n\nLEC #\n\nTOPICS\n\nBasics of neuroscience\n\nThe neurotransmitter systems\n\nNeuropsychiatric disorders: anxiety, mood disorders\n\nNeuropsychiatric disorders: schizophrenia, final exam",
  "files": [
    {
      "category": "Resource",
      "title": "Anxiety Disorders",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/9-98-neuropharmacology-january-iap-2009/966155502097299eaf28b28c15664056_lecture_3.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n\n9.98 Neuropharmacology\nJanuary (IAP) 2009\nor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\nF\n\n5-hydroxytryptamine (5-HT): Serotonin\nInvolved in depression, anxiety, obesity, aggression and drug addition\nStarting reagent: tryptophan\nTryptophan hydroxylase is specific of\nSerotoninergic neurons\nThe drug para-chlorophenylalanine (PCPA)\nselectively inhibits triptophan hydroxylase,\nTherefore blocking 5-HT synthesis\nA diet rich in carbohydrates leads to the increase of insulin which facilitate glucose\nuptake, and also several other aa, but not tryptophan\nince it is the ratio between tryptophan and other aa that is important for crossing the\nBB a carbo-rich diet would increase the uptake of tryptophan and eventually the\nS\nB\nproduction of serotonin\nSer\noto\nnin:\n-hyd\nrox\nytr\nyp\ntam\nine\n(5\n-HT)\ninvolved\nin depressi\non, anxiety,\n\no\nb\ne\ns\ni\nty, aggrression, and\ndrug ad\ndition.\nFigure by MIT OpenCourseWare.\n\nSerotoninergic transmission is similar to DA and NE transmission\nVMAT2 transport 5-HT into vescicles (reserpine blocker)\nPresence of auto receptors that modulate firing rate- release\n5-HT release can be stimulated by drugs with the structure of amphetamines\nOnce released, 5-HT is removed from the cleft by the e-HT transporter.\nA blocker of the transporter is fluoexitine (Prozac) that potentiate 5-HT transmission\nMonoamine oxidase (MAO) also catabolites 5-HT producing the metabolite\n5-hydroxyindoleacetic acid (5-HIAA)VMAT2 transportation mechanism of 5-HT into vescicles (reserpine blocker).\nFigure by MIT OpenCourseWare.\n\nThe majority of serotoninergic nuclei are localized in the brainstem\n(medulla, pons and midbrain)\nThese nuclei are called the raphe nuclei and they are localized on the midline\nof the brain stem\nThey project to all the forebrain regions\nImage removed due to copyright restrictions.\nFigure 6.17 in Meyer, and Quenzer, Psychopharmacology, 2004.\n\nThe firing of the serotoninergic neurons is associated with the behavioral status\nof the animal: the firing slows down with sleep and shut off during REM sleep\nIn general the firing is constant during repetitive movements, like chewing,\nand it suddenly stops when a new stimulus is presented\nInduced lesions of the serotoninergic system in animals show that it modulates food\nIntake, reproductive behavior, pain sensitivity and learning and memory\nC\no\nrr\nel\nat\nio\nn\nbe\ntw\nee\nn\nfi\nring of\nserotonin\nergic neurons a\nnd the behav\nioral status (food intake, reproductive behavior, pain sensitivity, learning & memory) of the animal.\nFigure by MIT OpenCourseWare.\n\n5-HT receptors\nThere are at least 15 receptor subtypes and they are all metabotropic,\nwith the exception of 5-HT3, which is an excitatory ionotropic receptor\n5-HT1A is present is many brain areas, including the hippocampus and the amygdala\nIt acts by inhibiting adenyl cyclase and by opening a K+ channel leading to\nmembrane iperpolarization\nAdministration of 5-HT1A agonists produce hyperphagia\nThe most studied antagonist (WAY-\nfrom the pharmaceutical company)\nproduced decrease in body weight\nbut it was accompanied by side effects\nImage removed due to copyright restrictions.\nFigure 6.19 (Part 1) in Meyer, and Quenzer, Psychopharmacology, 2004.\n\n5-HT1A stimulation also produced reduction in anxiety, and this is what is used in\nthe medication Buspar-commercial name for busiprone.\nAnother effect of 5-HT1A agonist is the inhibition of alcohol consumption\n5-HT2A receptors acts by activating protein kinase C,\nThey are present in cerebral cortex.\nAgonist of this receptor cause hallucinations, and this\nIs supposed to be related to the effects of lysergic acid\nDiethylamide (LSD)\nThe best known agonist is DOI (1-(2,5-dimethoxy-4-iodophenyl)\n-2-aminopropane\nKnown antagonists are ketanserin and ritanserin.\nIn general, these antagonists can be used for the treatment of schizophrenia.\nRecently, drugs that act on both the DA and 5-HT system have shown\nthe best results for the treatment of schizophrenia with lower side effects\nImage removed due to copyright restrictions.\nFigure 6.19 (Part 2) in Meyer , and Quenzer,\nPsychopharmacology, 2004.\n\nDrug\ns that affect the serotonergic system and their ac\ntions.\nFigure by MIT OpenCourseWare.\n\nAnxiety disorders\nAnxiety is a feeling of apprehension, fear, or worry.\nAnxiety can be a good thing: It warns for danger and it increases our energy level\npushing us to work harder and longer\nWhen anxiety is very intense in can cause discomfort or even terror\nAnxiety is commonly associated to depression\nThere are five principal categories of anxiety disorders:\nGeneralized anxiety disorder (GAD)\nPanic disorders\nPhobias\nPost-traumatic stress disorder\nObsessive-compulsive disorder\n\nGeneralized Anxiety Disorders:\nConstant worry. Muscle tension and agitation that lead to fatigue,\npoor concentration, irritability and sleep difficulties.\nIt tends to run in families\nPanic disorders:\nExperiencing the effects of a fear reaction without a threatening stimulus. Symptoms:\nHeart pounding, chest pain, sweating, shortness of breath\nThis can happen in response to an external cue, or without warning or in situations\nWhere attack occurred previously.\nThere is a clear genetic predisposition.\nPhobias:\nIrrational fears related to special\nobjects or situations\nGenera\nl anxiety disorder and panic disorder p\nhobias.\nFigure by MIT OpenCourseWare.\n\nPost-traumatic stress disorder (PTSD)\noccur after a traumatic event such as war, a terroristic attack, natural disasters\nPeople with PTSD have problems with: substance abuse, marital problems,\nDepression, sense of guilt\nChildren whose parents have PTSD have a igher probability of having PTSD\nSuggesting that there is a body factor that fecilitate the onset.\nAlso important are history of chronic stress, trauma, abuse.\nObsessive-compulsive disorders\nCharacterized by recurrent and persistent thoughts (Obsessions) that cause to the\nIndividual a sense od anxiety, guilt, shame.\nIn the aim to releive these symptoms the individual performs repetitive rituals\n(Compulsions) related or not to the obsessions.\nThe individual thinks that unless the compulsive ritual is completed, disasters will\noccur.\nSome people with OCD also suffer from other movement disorders such as:\nTourette's syndrome, Sydenham's chorea and Parkinson's disease\n\nOccurrence of OCD symptoms\nO\ncc\nur\nre\nnc\ne\nof obsessions and compulsions\nsymptoms.\nFigure by MIT OpenCourseWare.\n\nBrain areas interested in OCD\nImaging analysis shows that the following\nregions are involved in anxiety:\nBasal ganglia, frontal cortex, thalamus, and\nAnterior cingulate cortex. Neurosurgery that\ndestroys the connections in this loop\nrelieves the symptoms of anxiety\nImages removed due to copyright restrictions. Boxes 17.1 (A),\n17.1 (B), and 17.1 (C) in Meyer and Quenzer, Psychopharmacology, 2004.\n\nDrugs for treating anxiety\nThey are called anxiolytics and belong to the CNS depressants\nThey reduce neuron excitability by enhancing GABA transmission\nThey are alcohol, barbiturates and benzodiazepines\nWith increased doses, they cause also sedation, anesthesia and even death\nBarbiturates and benzodiazepines both enhance GABA transmission. Barbiturates\nincrease the duration of the opening of the channel and directly open the Cl- channel\nwithout GABA. Benzodiazepines have no effects with no GABA. They increase the\nfrequency of channel opening.\nAnxio\nlyti\ncs that belong to\nthe CNS depressants are\ndrugs\nthat ar\ne used for treating\nanxiety.\nFigure by MIT OpenCourseWare.\n\nThere is a direct correlation between GABA and anxiety\nThere are less BDZ receptors in patients with anxiety\nThere are endogenous diazepam binding inhibitor that induce anxiety\nImage removed due to copyright restrictions. Figure 17.19 in\nMeyer, and Quenzer, Psychopharmacology, 2004.\n\nBarbiturates action/applications changes according their solubility\nOver time, with tolerance, the balance desired effect-side effect shift toward the last one\nThey are used to induce anesthesia\nTheir interaction with alcohol is dangerous\nDuration o\nf action and uses\nof major Barbitura\ntes.\nDura\ntion of\naction and uses\nof major\nBarbiturates.\nFigure by MIT OpenCourseWare.\nFigure by MIT OpenCourseWare.\n\nDifferent benzodizepines are metabolized in a different way and therefore they\nhave a different interval of action\nThey are used as hypnotics, muscle relaxant\nAnticonvulsants.\nThey have very low effects on respiration, but\nThey give dependence\nA new anxiolytic is Busiprone, that does not interfere with other CNS depressants\ntherefore is safer, but it has a very slow action.\nIt has no effects on GABA tranmission: it is a partial agonist of 5-HT1A receptor\nOften antidepressant drugs are used to treat anxiety\nImage removed due to copyright restrictions.\nFigure 17.11 in Meyer, and Quenzer, Psychopharmacology, 2004.\n\nThere is a connection between the NE system and anxiety\nIn general, the NE system is activated by alerting situations\nSome of the effects of anxiolytic drugs can be explained with the modulation of LC firing\nLC firing is activated by the corticotropin-releasing factor and it is inhibited by GABA\nand serotonin.\nThis explain why depression and anxiety are often related and why SSRI are\neffective in treating anxiety\nAlso, increased levels of corticotropin-releasing factor (CRF) are related to anxiety\nThere are indications that increased DA transmission produces anxiety, while\nTreatments that increase 5HT transmission also reduce anxiety\nInteractions between anxiety and neurotransmitters\n\nAffective disorders:\nMajor depression\nBipolar disorders\nDepression\nLoss of interest in almost anything\nInability to experience pleasure in anything\nFeelings of hopelessness, sadness, worthless, guilt and desperation\nLoss of appetite, insomnia, crying, fatigue, thoughts of suicide\nEpisodes recur throughout life\nThe mean of onset for depression is 27 years\nBipolar Disorders\nManic individuals feel faultless, full of fun, and energetic. They need less sleep.\nThey make impulsive decisions and have unlimited confidence in themselves.\nOnset between 20 and 30 years of age and episodes continue throughout life.\n\nFigure by MIT OpenCourseWare.\nDiagnosis\nand Sy\nmptoms of Manic Episodes and Major Depression.\n\nWe all experienced feelings associated with depression and this\nis not pathologic.\nWhen the symptoms are disproportionate or prolonged it constitute\nmental illness\nDiagnosis\nand sy\nmptoms of manic episodes and major Depression.\nFigure by MIT OpenCourseWare.\n\nRisk Factors:\nHeredity\nEnvironmental stress\nAltered biological rhythms\nCorrelation between mood disorders and creativity\nCo\nrr\nel\nat\nio\nn\nbe\ntw\neen mood\ndisorders and creativity and a stu\ndy of the risk factors.\nFigure by MIT OpenCourseWare.\n\nStudy of concordance in\nMonozygotic twins and dizygotic\nTwins indicate a major role for\nHeredity in bipolar disorders\nStudy of concor\ndance in\nmonozyg\notic t\nwins and d\nizygotic.\n\nTwins\nindicate\na\nm\naj\nor role for heredity\ni\nn\nbipolar disorders.\nFigure by MIT OpenCourseWare.\n\nIn response to stress the hypothalamus\nProduces the corticotropin-releasing\nFactor (CRP) that acts on the pituitary gland\nInducing the release of the adrenocorticotropic\nHormone (ACTH).\nACTH goes in the blood and reaches the\nadrenal gland where it increases the secretion\nOf glucocorticoids, in particular cortisol.\nCortisol activates the energy to deal with\nStress. Cortisol feedbacks on hypothalamus\nThis is called the H-P-A axis\n(Hypothalamus-Pituitary-Adrenal)\nIn animal models, stress is induced by separating young animals from their mothers\nfor brief periods daily during the first weeks of life.\nImage removed due to copyright restrictions.\nFigure 16.3 in Meyer, and Quenzer,\nPsychopharmacology, 2004.\n\nStress induces transient surges of cortisol\nIn depressed individuals there is an abnormal secretion of cortisol\nIn this case the hypersecretion is due to an abnormal\nproduction of CRP by the hypothalamus.\nAntidepressant therapies reduce the CRF level in\ndepressed patients\nDexamethasone (a synthetic glucocorticoid that\nact as a negative feedback on the hypothalamus)\nCause a decrease in the levels of cortisol\nImage removed due to copyright restrictions.\nFigure 16.5 (A) in Meyer, and Quenzer,\nPsychopharmacology, 2004.\nImage removed due to copyright restrictions.\nFigure 16.5 (B) in Meyer, and Quenzer,\nPsychopharmacology, 2004.\n\nThe sleep pattern is altered in depressed patients\nImage removed due to copyright restrictions.\nFigure 16.5 (Part 2) in Meyer, and Quenzer, Psychopharmacology, 2004.\n\nDiscovering antidepressants\nAnimal models\nReduction of psychomotor activity,\nCognitive changes\nEating/sleeping\nThe interaction between genetic and environmental factors is important for the\nonset of depression\nGenetic factors are considered:\nDecrease in the monoamine levels\nIncreased activity of the HPA axis to stress\nExperiments on rodents proved that deprived animals respond more to stress\n\nThe discovery of anti-depressive treatments happened by chance\nIt was observed that reserpine, a drug that reduces high blood pressure\nInduces depression as side effect\nTherefore the antidepressant are tested as molecules capable of reverse the\nReserpine-induced sedation\nRemember that reserpine prevents the packaging of neurotransmitters into vescicles,\nLeaving the monoamines in the cytoplasm, where the MAO degrades them\nTherefore Reserpine reduces the transmission of monoamines\n(dopamine, norepinephrine and serotonin). MAO-inhibitors are therefore used as\nAntidepressants.\nImages removed due to copyright restrictions.\nFigure 16.7 (Part 1), 16.7 (Part 2), and 16.7 (Part 3)\nin Meyer, and Quenzer, Psychopharmacology, 2004.\n\nThis is known as MONOAMINE HYPOTHESYS, and it is based on the\nfollowing observations:\nManic-like activity produced by amphetamine and cocaine is correlated with an\nIncrease of chatecolamines at the synapses\nReduction of movements in depression\nMechanism of action of the MOAi\nIt is very likely that NE and 5-HT systems interactions are responsible of depression\nImage removed due to copyright restrictions.\nFigure 16.14 (Part 1) and 16.14 (Part 2) in\nMeyer, and Quenzer, Psychopharmacology, 2004.\n\nThe effects of MAO-I according to their time course should be on the post-synaptic\nModifications and effects of the second messenger.\nSide effects: it enhances the NE transmission in peripheral nerves of the sympathetic\nBranch and therefore it amplify the effects of all the medications that increase NE:\nnasal spray, cold medications, antiasthma drugs.\nAlso the foods that contain tyramine enhance NE transmission in terminals and\nshould be avoided.\nNE transmission increases blood pressure.\nMAOi inhibits some liver enzymes that catabolize barbiturates, alcohol, aspirin,\ntherefore amplifying the effects of these drugs.\nDietary re\nstrictio\nns for patients taking MAO-Is (Food Groups and\nExamp\nles).\nFigure by MIT OpenCourseWare.\n\nPossible treatments:\nAll these methods act enhancing monoamine transmission.\nThey require chronic administration, suggesting that the clinical\neffects are due to changes that occur over time\nMajor\nclasses of antid\nepressants\nand their most no\ntable side effects\n.\nFigure by MIT OpenCourseWare.\n\nTricyclic antidepressants act by binding the presynaptic transporter proteins and\nInhibiting the reuptake.\nThey also block acetylcholine, histamine, α-adrenergic receptors, determining:\nSedation and fatigue, dry mouth, constipation, cardiovascular problems\nTricyclic antidepressants act\nby binding the presynaptic tra\nnsporter prot\neins and i\nnhibiting the\nreuptake.\nFigure by MIT OpenCourseWare.\n\nSelective Serotonin reuptake inhibitors (fluoexitine, PROZAC)\nare used to treat, among others:\nDepression, anxiety disorders, obsessive-compulsive disorders, obesity\nThey act mostly on 5-HT reuptake, and therefore they avoid all the side effects\ndue to increased NE transmission\nSide effects: anxiety, restlessness, movement disorders, insomnia, headache and\nsexual dysfunction\nThey also cause physical dependence\nElectroconvulsive therapy:\nIt has been observed that there was an improvement of the mood in patients having\nSpontaneous seizures. Therefore inducing convulsions can be beneficial for\nPatients that are not sensible to drug treatments.\nThis treatment is very expensive. It probably works by acting on several\nNeurotransmitter systems. The main side effect are confusion and memory loss.\n\nBipolar disorders are treated with Lithium carbonate.\nIt is usually administered together with another antidepressant drug\nLithium enhance brain tryptophan therefore enhancing 5-HT actions.\nIt has effects on second messenger systems and brain neurotrophic factors.\nSide effects: Lithium is directly secreted by the kindey at a rate inversely related to\nSodium levels. Decrease in sodium levels leads to dehydratation, diarrhea, vomiting,\nEven seizures, coma and death.\nFor these reasons it has to be taken in low concentration.\nBipolar disor\nders treated with\nlithium carbonate are\nusuall\ny\n\na\nd\nm\ni\nn\ni\ns\nte\nred with ano\nther antidepressant drug.\nFigure by MIT OpenCourseWare.\n\nThere are several evidences in humans that the serotoninergic transmission is\nDecreased in depressed patients:\nIn post mortem brains it has been observed a reduction of the 5-HT metabolite\nIn post-mortem brains there in an increase in the 5-HT receptors\nDepressed patients have a low level of blood tryptophane\nPET studies have shown that in depressed patients there is an increase in metabolic\nActivity in amygdala and orbitofrontal cortex.\nThe activity is correlated with the severity of depression and with the treatments.\nStudies in animals confirmed the involvement of 5-HT in depression\n\nGlucocorticoid hypothesis:\nprolonged increase of glucocorticoid levels in blood determines a reduction\nIn the dendritic branching and neurogenesis in the hippocampus, therefore\nCausing the cognitive deficits associated to depression.\nNeurotrophic hypothesis:\nLow BDNF is responsible of the impairmentsGlucocorticoid hypothesis causes cognitive deficits associated to depression. Neurotrophic hypothesis causes low BDNF that is responsible for the impairments.\nFigure by MIT OpenCourseWare.\nGlucoc\nortico\nid hypothesis c\nauses cognitive\ndeficits\nassociated\nto depress\nion. Neu\nrotrophic\nhypothesis c\nauses low BDNF tha\nt is respo\nnsib\nle f\nor the impa\nirments.\n\nSummary of the hypothesis:Summary of glucocorticoid and neurotrophic hypothesis.\nFigure by MIT OpenCourseWare."
    },
    {
      "category": "Resource",
      "title": "Neuropharmacology",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/9-98-neuropharmacology-january-iap-2009/553d38ff1bdafbc62a4357ec28d9c600_lecture_1.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n\n9.98 Neuropharmacology\nJanuary (IAP) 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nNeuropharmacology:\nThe study of drugs specifically employed to affect the nervous system\nSeveral drugs used for the treatment of extra-neural pathology may have an effect on the\nNervous system\nThe effects of a drug can be considered at different levels:\n-Molecular\n-Cellular\n-Behavioral\nAs the complexity of the system increases it becomes more difficult to predict the\neffects of a drug\n\nDrug action:\nmolecular changes produced by a drug when it binds its target\nHow does a drug reach the brain?\nRoute of administration: Oral, Intravenous,\nIntramuscular, Subcutaneous, Inhalation,\ntopical, Epidural.\nThere are two distinct aspects of drug action:\n-Potency (the affinity of the drug for its receptor)\nOnce in the body the drug binds to inactive sites that\nretain the drug and release it\nover time, this prolongs the action of a drug. Also,\nthe amount of these proteins\nVaries by individuals\nThe affinity of different drugs for these sites can\nexplain some interactions between\ndrugs\n-Efficacy: the biological effects exerted on the target\nThr\nesh\nold\nf\nor\neff\necti\nv\ne\nne\nss\nf\nor drug action.\nFigure by MIT OpenCourseWare.\n\nThis means that a drug stays in the blood for some time after administration\nBefore reaching the CNS, where it has to cross the Blood Brain Barrier\nThe BBB barrier prevents that all the substances reach the brain\nAlso the placental barrier has to be taken into account.\nOnce the drug reaches the brain it can go through the cell membrane or\nbinds to a receptor on the cell surfaceCross section diagrams of typical and brain capillaries highlighting structure and transport mechanisms.\nFigure by MIT OpenCourseWare.\n\nDrugs can be agonists or antagonists:\nCo-agonists\nCompetitive antagonists\nNon-competitive antagonists\nCompari\nson of d\nrug action/effec\nt for agoni\nst drugs a\nnd antag\nonist drugs.\nFigure by MIT OpenCourseWare.\n\nHow do we measure the effects of a drug?\n...with the dosage-response curve (ED),\nDosage-response curves of\nwhich describes the amount of biologics\ndifferent analgesics the first three\nor behavioral effect (response) for a\nHave identical efficacy, even if at\ngiven drug concentration (dose)\nDifferent dosage. The fourth is less\neffective\nGrap\nhs to measur\ne\nthe\neffect\ns of a d\nrug with the dosage\nresp\nonse curv\ne an\nd a study\nof the dosage response\ncurves for diffe\nr\nen\nt\nan\nalg\ne\nsi\ncs.\nFigure by MIT OpenCourseWare.\n\nDrug effects\n-Therapeutic effects\n-Side effects\nGraph to study t\nhe t\nhe\nrap\neutic and side effect\ns of dr\nugs with\nthe aim to study anxiety, sedation an\nd respiratory depressi\non.\nFigure by MIT OpenCourseWare.\n\nInteraction between drugs. 1\nOnce in the body a drug is metabolized and eliminated, plus in the blood,\nthe drug binds to non reactive substances such as albumin, that 'buffer' their action\nOne of the possible causes of interference is through the interaction of a drug\nwith some of these molecules/enzymes.\nTwo drugs may act in different manners but having competitive effects (i.e.: on heart rate)\nOn have ADDITIVE EFFECTS, or showing POTENTIATION (when the combination of\ntwo drugs produces effects that are greater than the sum of their individual effects.\nG\nr\na\nphs that sh\now drug int\neractions a\nnd eff\nects o\nf physiolo\ngical antagonism,\nadditive e\nffects, and potentia\ntion.\nFigure by MIT OpenCourseWare.\n\nInteraction between drugs. 2\nRepeated use of a drug may cause an altered production of metabolic enzymes\nInvolved in the catabolism of several drugs. Example: some anti-seizure drugs\nInterfere with the metabolism of oral contraceptives. A similar effect is produced\nby cigarette smoke\nDrug competition: when drugs share the metabolic system. Es: alcohol increases\nthe metabolism of Valium increasing its effects.\nMetabolic enzymes are different at different ages and different gender therefore\nProducing different effects\n\nThe response to a drug can change over time\nTOLERANCE: a diminished response to drug administration after repeated exposures\nof that drug (metabolism or compensatory changes in the nerve cell\nSENSITIZATION (reverse tolerance), when repeated rug administration causes an\nEnhancements of the drug effects\nUp- or down-regulation of the receptors (1/2 weeks) reflect compensatory changes\n\nBasic properties of the nerve cells:\n-Ability to conduct electric signals\n-Specific intercellular connections with other nervous cells or with other tissues\nDrugs can affect either one of these properties\nAlso, glial cells in the brain are important for modulating neuronal function\n\nBasic elements of biophysics\nNeurons transmit electrical signals. At the cell membrane there is a different\nDistribution of ions that causes a resting potential of -70mV. This situation is\nMaintained through ATP-pumps that maintain Na+ and Cl- ions concentrated\noutside the cell and K+ localized inside.\nImage removed due to copyright restriction. Figure 2.10 in Meyer,\nand Quenzer, Psychopharmacology, 2004.\n\nThe ions can go across the membrane through channels. The ion channels are\nOpen depending on voltage, ligand, or biochemical modification (i.e. phosphorilation)\nImage removed due to copyright restriction. Fig 2.7 in Meyer\nand Quenzer, Psychopharmacology, 2004.\n\nLocal changes in ion\nconcentration induce local\npotentials, and when these\nevents\nsum up and a threshold is\nreached, a great number of\nvoltage-gated channels is\nopened allowing a massive\ndepolarization known as\naction potential.\nAfter the propagation of the signals\nthe channels close (refractory\nperiod) until the\nIon distribution is restored.\nLidocaine, a topic anesthetic, blocks the Na+ channels therefore blocking the transmission of pain\nPhenytoin (Dilantin) is used to prevent epilepsy. It binds to Na+ channels during the refractory period\npreventing their opening, therefore preventing the spreading of electrical activity\nStud\ny o\nf h\ny\nper\npo\nla\nrization and d\nepolariz\nation (ac\ntion potential) c\nause\nd by loca\nl changes in\nion concentration that\ninduce l\nocal potentials.\nFigure by MIT OpenCourseWare.\n\nModulation of synaptic transmission\nIt is based on the interaction between a neurotransmitter, released by the\npresynaptic terminal, and its receptor on the postsynaptic receptor\nRegulated from molecules that peptides that affect neuroactivity, even without being transmitters\nMany neurotransmitter have more than one receptor\nReceptors:\n-Ionotropic\n-Metabotropic\n\nFigure by MIT OpenCourseWare.Comparison of classical and non-classical neurotransmitters.\n\nFigure by MIT OpenCourseWare.\n\nA particular case of neurotransmitter is represented by NO: Nitric Oxide. It is a gas\nTherefore it is not stored in vescicles and it can cross the membranes. It is also\nProduced by the post synaptic element and it can act as a retrograde signal.\nThe only way to modulate its availability is by modulating its synthesis operated\nBy the enzyme Nitric Oxide Synthase (NOS).\nNO action results in the activation of an enzyme that produce cGMP (a second\nMessenger).\nBlocking NOS prevents the tolerance and the dependance induced by drug\nadministration. This may have an effect on the tolerance for drugs used for the\ntreatment of chronic pain.\nAnother effect of cGMP activation is to relax the smooth muscle that surround the\nBlood vessels therefore increasing arteries dilatation; cGMP degradation is catalyzed\nBy the enzyme cGMP phosphodiesterase. If this enzyme is blocked the effects of\nNO are potentiated facilitating arteries dilatation.\nIs this the mechanism used by the drug sildenafil (known commercially as VIAGRA)\n\nIonotropic receptors comprise multiple protein subunits that form an intrinsic ion\nChannel. They mediate fast excitatory and inhibitory neurotransmission\nMetabotropic receptors are constituted by one single unit and their activation\nstimulate a second messenger system that eventually leads to activation of ion\nchannels and protein kinases. Their action is slower but long-lasting\n\nFigure by MIT OpenCourseWare.\n\nFigure by MIT OpenCourseWare.\n\nFigure by MIT OpenCourseWare.\n\nPresynaptic modulation (the amount of transmitter released)\n-Change in the firing frequency of the presynaptic neuron\n-Change in the synthesis, storage, transport, release, reuptake, catabolism of a transmitter\ni.e. L-DOPA (the precursor of DA) is given to patients with Parkinson's disease,\ni.e.: drugs that block monoamine oxidase (MAO) that degrades serotonin (5-HT) are used to treat\nDepression, and so are drugs that prevent the re uptake of the neurotransmitter\n-Direct effect on the release mechanism by changing the electric properties of the terminals or\nmodulating specific molecules involved in the release process\nPostsynaptic modulation\n-Long term changes in the number of receptors (use of agonist or antagonist drugs)\n-Change in the affinity of a ligand for a receptor\n-Change in ionic conductance (2nd messenger)\n\nNeurotransmitter system: glutamate\nGlutamate mediates fast excitatory transmission and it is present in all the cells of nervous system\nGlutamate is generated from glutamine (via glutaminase) and it is loaded into vescicles by\nVGLUTs, which are present only in glutamatergic cells. Once released in the synaptic cleft\nglutamate is removed by neuronal and glial transporters:\nExcitatory Amino Acid Transporters (EAATs).EAAT1/2 are present on astrocytes and are important\nFor modulating the amount of extracellular glutamate. Excess of glutamate can be dangerous and\nEven produce cell death\nImage removed due to copyright restriction. Fig. 7.3 in Meyer\nand Quenzer, Psychopharmacology, 2004.\n\nExcitotoxicity hypothesis: excessive exposure to glutamate and related amino acids\ncause a prolonged depolarization of neurons that lead to their damage and death\nDomoic acid is an excitatory amino acid made by some algae. It concentrates in crabs,\nShellfish and fish. When wild life eat these sources they get intoxicated.\nThis happened in 1961 in Capitola (CA) and inspired the movie \"the birds\".\nAbnormalities in EAATs lead to diseases: half of the cases of Amylotrophic\nLateral Sclerosis (ALS) are caused by EAATs and cause degeneration of motor\nneurons.\nImage removed due to copyright restrictions.\nStill photo from The Birds by Alfred Hitchcock.\n\nGlutamate receptors are formed by different subunits that are targeted by different\ndrugs\nNBQX (2,3-dihydroxy-6-nitro-7-sulfamoyl-benzo[f]quinoxaline-2,3-dione)\nis a blocker for AMPA and Kainate receptors but not for NMDA. Rodents\ntreated with NBQX show sedation, poor coordination of movements and protection\nFrom chemically-induced seizures.\nThere are also metabotropic receptors\nalpha-amino-3-hydroxy-5-methyl-4-isoxazolepropionic acid receptor (AMPA)\nN-methyl D-aspartate (NMDA)\nImage removed due to copyright restriction. Fig. 7.4 in Meyer\nand Quenzer, Psychopharmacology, 2004.\n\nNMDA receptors have binding sites for glutamate and for other binders:\nGlycine and D-serine are co-agonists. They are necessary for the activation\nOf the receptor, but the limiting factor is glutamate.\nSo for the activation of NMDA receptors two events are necessary: glutamate and\nMembrane depolarization. Inside the channel there are three more bindings sites:\nFor phencyclidine (PCP), ketamine and MK-801. These substances block the channel\n( non competitive antagonists)\nThere are also blockers: Mg++ blocks the receptor, but it leaves its site when the\nMembrane is depolarized\nImages removed due to copyright restriction. Fig. 7.5 and fig. 7.6\nin Meyer and Quenzer, Psychopharmacology, 2004.\n\nGABA (Gamma-aminobutyric acid) and glycine are two inhibitory neurotransmitters.\nBlockade of GABA transmission induces seizures.\nGABA is synthesized from Glutamate by the enzyme Glutamic Acid Decarboxylase (GAD)\nWhich is present only in inhibitory neurons. GABA synthesis can be blocked by the following\ndrugs:\nAllyglycine, thiosemicarbazide, 3-mercaptopropionic acid\nImage removed due to copyright restriction. Fig. 7.13 in Meyer\nand Quenzer, Psychopharmacology, 2004.\n\nSimilarly to Glutamate, GABA is loaded into vescicles by VGAT, and it is removed from\nthe synaptic cleft by transporters located on both neurones and glia: GAT-1, GAT-2, GAT-3.\nTiagabine (GABITRIL), blocks specifically GAT-1, enhances GABAergic transmission and\nit is used in the treatment of epilepsy.\nAnother way to increase GABAergic transmission is to reduce the degradation of GABA by\nBlocking the enzyme GABA aminotransferase (GABA-T). Vigabatrin (SABRIL) is an irreversible\nInhibitor of GABA-T and it is used in certain types of epilepsy.\nDiazepam (VALIUM) is a syntetic product that increases GABAA receptor function, however\nThere are endogenous molecules that show a benzodiazepine-like activity endozepines,\nWhich may play a role in anxiety. There is also an endogenous peptide that inhibits diazepam\nBy binding diazepam binding site (DBI: diazepam binding inhibitor).\nBenzodiazepines have a specific binding site: substances that bind to the site act as convulsants,\nbecause they decrease the GABA transmission\n\nThere are two main type of GABA receptors: GABAA (ionotropic) and GABAB (metabotropic)\nGABAA receptor consists of a channel for Cl-. Drugs that interact with GABA are:\nMuscimol (agonist)\nBicuculline (antagonist)\nPentylenetetrazol (antagonist)\nBenzodiazepines*\nBarbiturates*\nNeurosteroids (agonists)\nEthanol (agonist)\nBaclofen (LIORESAL) is an agonist for GABAB receptors and it is used as a muscle relaxant and\nAntispastic\n* They activate the receptor together with GABA. There is no effect in absence of GABA\nImage removed due to copyright restriction. Fig. 7.14 in Meyer\nand Quenzer, Psychopharmacology, 2004."
    },
    {
      "category": "Resource",
      "title": "Neurotransmitter Systems",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/9-98-neuropharmacology-january-iap-2009/9cd2b47e9ca17dbe67324f84e80d60e3_lecture_2.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n\n9.98 Neuropharmacology\nJanuary (IAP) 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nNeurotransmitter systems\nGlutamate and GABA\nNoradrenaline\nAcetylcholine\nSerotonin\nDopamine\nwww.tropea.us\n\nCatecholamines:\nDopamine (DA)\nNorepinephrine (NE)\nEpinephrine (EPI)\nThe rate-limiting enzyme is TH, which is regulated by the product (feedback)\nand by stress (up-regulated).\nCatecholamines are synthesized in a multi-step process\nSyn\nth\ne\ns\nis o\nf Catecholamines regulate\nd by pro\nduct\n(feedback) an\nd\nst\nre\nss (un-regulat\ned) feedback.\nFigure by MIT OpenCourseWare.\n\nDopamine vescicular release\nVescicles are loaded with catheco-\nlamines by the enzyme\nVescicular Monoamine Transporter\n(VMAT).\nVMATS are blocked by the drug\nReserpine which causes sedation\nin animals and depressive symptoms\nIn humans\nCatecholamine release is inhibited\nby autoreceptors located on\ndopaminergic and noradrenergic\nneurons\nAutoreceptors reduce the amount of calcium that enters the\nFigure by MIT OpenCourseWare.\nterminal in response to a nerve impulse, therefore inhibiting catecholamine releaseCatecholamine release affected by Dopamine vescicular release.\n\nRelease of catecholamines is dependent on neuronal cell firing\nSome drugs induce the release independently from nerve cell firing.\nPsychostimulants such as amphetamine and methamphetamine in humans cause\nincreased alertness, euphoria, insomnia.\nIn animal models increase in catecholamine release produces increased locomotor\nactivity and stereotyped behavior\nModulation of catecholamine action\n1. Modulation of release\n2. Modulation of autoreceptors\nStimulation of autoreceptors inhibits catecholamine release\nAutoreceptor antagosists, increase catecholamine release\n\n3. Modulation of reuptake\nDopaminergic (DA) and Noradrenergic (NE) neurons have specific transporters on\ntheir membranes for the reuptake of neurotransmitter. These transporters are\ndifferent from the autoreceptors described in point 2.\nDrugs that block the transporters increase the amount of neurotransmitter in the\nSynaptic cleft therefore potentiating catecholamine transmission.\nReboexitine is a drug that specifically blocks NE uptake\nCocaine blocks the transport of DA, NE and 5-HT\n4. Modulation of metabolism\nInside the terminal the transmitters are also catabolized by 2 enzymes:\nCatechol-O-methyltransferase (COMT) and monoamide oxidase (MAO)\nDegradation of catecholamines produces metabolites: homovanillic acid (HVA) for DA\nand 3-methoxy-4hydroxy-phenylglycol (MHPG) (CNS) and vanillymandelic acid (VMA)\n(PNS) for NE.\nThe levels of these metabolites in blood or urines gives important indications for the\ncatecholaminergic activity and therefore contributes to the diagnosis of mental\ndisorders\nMAO inhibitors (phenelzine or tranylcypromine) have been used in the treatment of\nDepression. COMT inhibitors: entacapone (Comtan) and tolcapone (Tasmar) are used\nAs supplememts in the treatment of Parkinson disease.\n\nTransgenic animals are useful for the characterization of neurotransmitters action\nMutant mice lacking the dopamine\nTransporter DAT show an increase\nIn locomotor activity\nUse of tra\nnsgenic ani\nm\nals\nfo\nr t\nhe\nch\nar\nact\neri\nzat\nion of neurotransm\nitters action.\nFigure by MIT OpenCourseWare.\n\nDopaminergic pathways\nDopaminergic neurons are localized in the mesencephalon (midbrain)\nNigrostriatal tract:\ncells from the substantia nigra project to the striatum in the forebrain\nThis pathway is affected in Parkinson disease. It is involved in control of movements\nImage removed due to copyright restrictions. Figure 5.7 (Part 1) in\nMeyer, and Quenzer, Psychopharmacology, 2004.\n\nMesolimbic dopamine pathway:\nDomapinergic cells in the Ventral Tegmental Area (VTA) in the mesencephalon\nProject to structures of the limbic system: nucleus accumbens, septum, amygdala,\nhippocampus\nImage removed due to copyright restrictions. Figure 5.7 (Part 2) in\nMeyer, and Quenzer, Psychopharmacology, 2004.\n\nMesocortical dopamine pathway:\nDomapinergic cells in the Ventral Tegmental Area (VTA) in the mesencephalon\nproject to cerebral cortex\nMesolimbic and mesocortical pathways have been implicated in drug abuse and\nschizophrenia\nOther dopaminergic neurones are present in the retina and in the hypothalamus\nthese last control the secretion of prolactin\nImage removed due to copyright restrictions.\nFigure 5.7 (Part 3) in Meyer, and Quenzer, Psychopharmacology, 2004.\n\nLocalized application of the neurotoxin 6-hydroxydopamine (6-OHDA) is used to\nExamine the role of specific pathways in behavior.\nThis neurotoxin is similar to DA, and therefore is taken selectively by dopaminergic\nNeurons which are damaged and die\nImage removed due to copyright restrictions.\nFigure 4.1 (Part 1) in Meyer, and Quenzer, Psychopharmacology, 2004.\n\nDopamine receptors are found in the afferent stuctures of dopaminergic neurons\nThere are 5 known receptors: D1-D5 and they are all metabotropic receptors\nD1 receptors stimulate cAMP production, while activation of D2 receptors inhibits\nThe production of cAMP.\nThis happens through the stimulation of 2 different G-proteins (D1/Gs-D2/Gi)\nIn addition, D2 also activates potassium channels\nImage removed due to copyright restrictions.\nFigure 5.9 in Meyer, and Quenzer, Psychopharmacology, 2004.\n\nDopamine receptors agonists and antagonists control dopaminergic-related functions\nApomorphine is an agonist of both D1 and D2 receptors\nSFK38393 is an activator of D1 receptors and in mice it enhances self-grooming\nbehavior\nQuinprole affects D2 and D3 receptors. It causes an increase in locomotion and\nSniffing behavior\nAntagonists of dopaminergic receptors cause catalepsy: lack of spontaneous\nmovements\nHaloperidol causes catalepsy through D2 receptors, SCH acts through D1 receptors\nAfter prolonged treatment with D receptor antagonists the animals develop behavioral\nsupersensitivity, meaning that their reaction to dopaminergic stimulants is increased\n\nMice that lack D1 receptors are insensitive to locomotor stimulating effects\ninduced by cocaine\nMice that l\na\nck D\n1 rec\neptor\ns are\ninsensitive to l\noco\nm\no\nt\no\nr\n\ns\nt\nimul\nating\neffe\ncts i\nnduced by coca\nine\n.\nFigure by MIT OpenCourseWare.\n\nTabl\ne sh\nowing drugs that affect the\nDopaminergic system and the actions that they ca\nuse.\nFigure by MIT OpenCourseWare.\n\nParkinson disease\nCaused by death of dopaminergic neurons in the substantia nigra\nThe major symptoms include deficits in movement, but some patients also show\nCognitive dysfunctions\nPossible cause: oxyradical-induced oxidative stress that damages/kills\nDA neurons\nImage removed due to copyright restrictions.\nBox 5.1 (Part 1) in Meyer, and Quenzer, Psychopharmacology, 2004.\n\nSource: Grey's Anatomy. Courtesy of Wikipedia.Parasympathetic and Sympathetic Branches of the Autonomous Nervous System.Parasympathetic and Sympathetic Branches of the Autonomous Nervous System.Parasympathetic and Sympathetic Branches of the Autonomous Nervous System.\nThe autonomic Nervous System\n\nFigures by MIT OpenCourseWare.Parasympathetic and sympathetic branches of the autonomous nervous system.Parasympathetic and Sympathetic Branches of the Autonomous Nervous System.Sympathetic division showing noradrenergic and cholinergic neurons.\nNE transmission and the autonomic nervous system\n\nThe NE-containing neurons are localized mostly in the LOCUS COERULEUS (LC):\nan area in the pons (brain stem). These cells provide inputs to cords, cerebellum,\nand to several areas in the forebrain.\nAlso NE neurons are in the ganglia of the sympathetic branch of the autonomic\nnervous system, therefore playing an important role in PNS.\nImage removed due to copyright restrictions. Figure 5.11 in\nMeyer, and Quenzer, Psychopharmacology, 2004.\n\nThe NE neurons in the LC play an important role in the state of VIGILANCE:\nbeing alert to external stimuli.\nIn vivo electrophysiological recordings\nfrom the LC showed that the firing\ndepends on the status of the animal\nand the external stimuli\nImage removed due to copyright restrictions.Figure 5.12 in\nMeyer, and Quenzer, Psychopharmacology, 2004.\n\nThe receptors of NE and EPI are called ADRENERGIC RECEPTORS and they are\nMetabotropic receptors.\nThey are distinguished in alpha (α1 and α2 ) and beta (β1 and β2)\nβ1 and β2 receptors increase the levels of cAMP.\nα2 receptors inhibit adenilyl cyclase and increase K channels opening\nα1 receptors act with phosphoinositide as second messenger inducing an increase\nof Ca++ in the postsynaptic cell\nThe effects of drugs for the NE system are measured by looking at the vigilance:\nphenylephrine is α1 receptor agonist, while isoproterenol is a β receptors agonist\nD\nrug\ns e\nffe\ncts\non t\nhe N\norepinephrine\n(NE)\nsyste\nm by t\nrackin\ng vigila\nnce.\nFigure by MIT OpenCourseWare.\n\nNE modulates:\nvigilance\nanxiety\npain\nhunger and eating behavior\nautonomic functions\nIt is important to consider the localization of receptor\nsubunits in specific areas\nImage removed due to copyright restrictions.\nFigure 5.14 in Meyer, and Quenzer, Psychopharmacology, 2004.\n\nEffects\nAgonists:\nAntagonists:\nα receptors stimulation leads to constriction of the blood vessels in the bronchial\nlining, this reducing congestion and edema.\nThe agonist phenylephrine in the ingredient in Neosynephrine (a nasal spray)\nβ receptors stimulation induce relaxation of the bronchial muscles, therefore providing\nA wider airway. In fact albuterol in a very popular local medication in asthma\nPrazosin is a α1 receptors antagonist and causes a relaxation of the blood vessels\nPropanolol is a β receptors blocker that reduces the heart's contractile force.\nThey are both used as treatment for high blood pressure\nBlockers are in general used to treat the symptoms of anxiety disorders: palpitation,\ntachycardia\n\nLocation\nand\nphysiological actions of peripheral alp\nh\na\n\n(\nu\ns\ne\n\nsymbol) an\nd beta (us\ne symbol) adre\nnergic receptors and their receptor\nsubtypes.\nFigure by MIT OpenCourseWare.\n\nDrug\ns and their actions on the Noradrenergic system.\nFigure by MIT OpenCourseWare.\n\nAcetylcholine\nFactors that regulate Ach synthesis:\n-Availability of reagents\n-Firing rates\nSince so far there are no drugs that control ChAT, the control of cholinergic system\nhappen at different steps of transmission\nAcetylcholine is a neurotransmitter in:\nNeuromuscular junctions\nPeriferal Nervous System\nCentral Nervous System\n\nVesamicol is a drug that blocks the vescicular Ach transporter, therefore decreasing\nAch transmission: Ach can only be released through vescicles\nA Choline transporter takes back Ach into the presynaptic terminal. If this transporter\nIs blocked (hemicolinium-3 (HC-3)) the production of Ach declines. This suggests that\nThere is recycling. HC-3 has to be administered locally.Ach transporter mechanism.\nFigure by MIT OpenCourseWare.\n\nFactors that modulate Ach release:\nToxin in the venom of the black widow spider\nInduce a massive release of Ach, thereby causing:\ntremors, pain, vomiting, salivation, sweating\nBotulinum toxins: blocks Ach release\nThe toxins are picked up by cholinergic neurons at the neuromuscular junction, thereby\ncausing muscle paralysis.\nSymptoms: blurred vision, difficulty speaking and swallowing, muscle weakness\nAt low dosage Botox is used also for therapeutic purposes:\nDiseases causes by permanent muscle contraction: dystonias\nAlso used for reducing wrinkles\n\nAcetylcholinesterase (AChE) degrades ACh\nIt is localized in the presynaptic terminal, in the membrane of the postsynaptic\nterminal, and at the neuromuscular junctions\nDrugs that block AChE increase the effects of Ach transmission\nPhysostigmine (Eserine) blocks AChE therefore causing: loss of reflexes, mental\nconfusion, allucination, convulsions, slurred speech. It crosses the BBB.\nNeostigmine (Prostigmin) and pyrodostigmine (Mestinon) are analogous of\nPhysostigmine that do not cross the BBB. They are used for the treatment of\nMyasthenia gravis: an autoimmune disorder where antibodies attack cholinergic\nReceptors at the neuromuscular junction, therefore in these patients the muscles\nare less sensitive to Ach.\nReversible inhibitors:\nThese substances are used at low dosage also in pesticides\n\nIrreversible inhibitors of AChE:\nSarin and Soman: chemical gases developed in chemical warfare.\nThey causes paralysis of the diaphragm, hence death\nSome analogous - but reversible- blockers of AChE are used as antidote\n\nFigures by MIT OpenCourseWare.Parasympathetic and sympathetic branches of the autonomous nervous system.Parasympathetic and Sympathetic Branches of the Autonomous Nervous System.Sympathetic division showing noradrenergic and cholinergic neurons.\nAcetylcholine is fundamental in sympathetic and parasympathetic branches of\nAutonomic nervous system\n\nLocalization of cholinergic neurons in the CNS\nNote that in the striatum (the target of dopaminergic neuronsfrom substantia nigra),\nthere are cholinergic interneurons. The control of movement depends on the balance\nbetween cholinergic and dopaminergic transmission. Therefore in Parkinson disease\nanticholinergic drugs are also used to improve the control of movements: orphenadrine\n(Norflex), benztropine mesylate (Cogentin), trihexyphenidyl (Artane)\nNeurons of the BFCS are involved in cognitive functions\nRole of cholinergic system in Alzheimer disease\nImage removed due to copyright restrictions.\nFigure 6.7 in Meyer, and Quenzer, Psychopharmacology, 2004.\n\nAch receptors\nNicotinic: ionotropic, distributed mainly in neuromuscular junctions, autonomic\nNervous system, some neurons in the brain.\nWhen they are activated the Na+ and Ca++ ions flow through the channel, thereby\nMediating fast excitatory responses (in case of muscle, contraction)\nThe nicotinic receptor is made by different subunits\nThe composition at the neuronal and muscular\nsynapses are different.\nFor example the effects of nicotine are different\nIn the brain and in the muscles\nA nicotinic receptor antagonist is D-tubocurarine,\nThat is the main active ingredient of curare.\nCurare blocks cholinergic transmission at the\nneuromuscular junction therefore causing\nrespiratory paralysis.\nInterestingly, treatment with neostigmine\n(anti AChE) overcomes the effects of curare\nEff\nect\nof\nach recepto\nrs in the a\nuton\no\nm\ni\nc\nnervous system.\nFigure by MIT OpenCourseWare.\n\nMuscarinic receptors\nMetabotropic receptors (M1-M5) that activate different second messenger pathways:\nActivation of phosphoinositide\nDecrease of cAMP\nStimulation of K+ channels opening\nThese receptors play an important role in cognitive functions, and those in the\nstriatum are involved in motor function.\nM5 muscarine receptors are involved in morphine reward and dependence\nStudy of metabotropic recept\nors that activate\nm\nes\nse\nng\ner pathways.\nFigure by MIT OpenCourseWare.\n\nMuscarinic receptors outside the nervous system:\nCardiac muscle\nSmooth muscles associated with several organs\nThey modulate heart rate and contractions, salivation, sweating, lacrimation\nAll these possible side effects need to be take into account for the cognitive\neffects related to muscarinic receptors\nMuscarinic receptor AGONISTS (muscarine, pilocarpine, arecoline):\nMime the effects of parasympathetic activation: lacrimation, salivation, sweating,\nConstriction of the iris, contraction of the smooth muscles of the viscera, diarrhea\nMuscarinic receptor ANTAGONISTS (atropine, scopolamine)\nPupillary dilatation, reduction of secretions\n\nDrug\ns that af\nfect the cholinergic system and their actio\nns.\nFigure by MIT OpenCourseWare.\n\n5-hydroxytryptamine (5-HT): Serotonin\nStarting reagent: tryptophan\nTryptophan hydroxylase is specific of\nSerotoninergic neurons\nA diet rich in carbohydrates leads to the increase of insulin which facilitate glucose\nuptake, and also several other aa, but not tryptophan\nSince it is the ratio between tryptophan and other aa that is important for crossing the\nBBB a carbo-rich diet would increase the uptake of tryptophan and eventually the\nproduction of serotonin\nInvolved in depression, anxiety, obesity, aggression and drug addition\nThe drug para-chlorophenylalanine (PCPA)\nselectively inhibits triptophan hydroxylase,\nTherefore blocking 5-HT synthesis\nSer\noto\nnin:\n-hyd\nrox\nytr\nyp\ntam\nine\n(5\n-HT)\ninvolved\nin depressi\non, anxiety,\n\no\nb\ne\ns\ni\nty, aggrression, and\ndrug ad\ndition.\nFigure by MIT OpenCourseWare.\n\nSerotoninergic transmission is similar to DA and NE transmission\nVMAT2 transport 5-HT into vescicles (reserpine blocker)\nPresence of auto receptors that modulate firing rate- release\n5-HT release can be stimulated by drugs with the structure of amphetamines\nOnce released, 5-HT is removed from the cleft by the e-HT transporter.\nA blocker of the transporter is fluoexitine (Prozac) that potentiate 5-HT transmission\nMonoamine oxidase (MAO) also catabolites 5-HT producing the metabolite\n5-hydroxyindoleacetic acid (5-HIAA)VMAT2 transportation mechanism of 5-HT into vescicles (reserpine blocker).\nFigure by MIT OpenCourseWare.\n\nThe majority of serotoninergic nuclei are localized in the brainstem\n(medulla, pons and midbrain)\nThese nuclei are called the raphe nuclei and they are localized on the midline\nof the brain stem\nThey project to all the forebrain regions\nImage removed due to copyright restrictions.\nFigure 6.17 in Meyer, and Quenzer, Psychopharmacology, 2004.\n\nThe firing of the serotoninergic neurons is associated with the behavioral status\nof the animal: the firing slows down with sleep and shut off during REM sleep\nIn general the firing is constant during repetitive movements, like chewing,\nand it suddenly stops when a new stimulus is presented\nInduced lesions of the serotoninergic system in animals show that it modulates food\nIntake, reproductive behavior, pain sensitivity and learning and memory\nC\no\nrr\nel\nat\nio\nn\nbe\ntw\nee\nn\nfi\nring of\nserotonin\nergic neurons a\nnd the behav\nioral status (food intake, reproductive behavior, pain sensitivity, learning & memory) of the animal.\nFigure by MIT OpenCourseWare.\n\n5-HT receptors\nThere are at least 15 receptor subtypes and they are all metabotropic,\nwith the exception of 5-HT3, which is an excitatory ionotropic receptor\n5-HT1A is present is many brain areas, including the hippocampus and the amygdala\nIt acts by inhibiting adenyl cyclase and by opening a K+ channel leading to\nmembrane iperpolarization\nAdministration of 5-HT1A agonists produce hyperphagia\nThe most studied antagonist (WAY-\nfrom the pharmaceutical company)\nproduced decrease in body weight\nbut it was accompanied by side effects\nImage removed due to copyright restrictions.\nFigure 6.19 (Part 1) in Meyer, and Quenzer,\nPsychopharmacology, 2004.\n\n5-HT1A stimulation also produced reduction is anxiety, and this is what is used in\nthe medication Buspar-commercial name for busiprone.\nAnother effect of 5-HT1A agonist is the inhibition of alcohol consumption\n5-HT2A receptors acts by activating protein kinase C,\nThey are present in cerebral cortex.\nAgonist of this receptor cause Hallucinations, and this\nIs supposed to be related to the effects of lysergic acid\nDiethylamide (LSD)\nThe best known agonist is DOI (1-(2,5-dimethoxy-4-iodophenyl)\n-2-aminopropane\nKnown antagonists are ketanserin and ritanserin.\nIn general, these antagonists can be used for the treatment of schizophrenia.\nRecently, drugs that act on both the DA and 5-HT system have shown\nthe best results for the treatment of schizophrenia with lower side effects\nImage removed due to copyright restrictions.\nFigure 6.19 (Part 2) in Meyer and Quenzer,\nPsychopharmacology, 2004.\n\nDrug\ns that affect the serotonergic system and their ac\ntions.\nFigure by MIT OpenCourseWare."
    },
    {
      "category": "Resource",
      "title": "Schizophrenia",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/9-98-neuropharmacology-january-iap-2009/b6fb53fc7e3e8b1da03b886f2e848b95_lecture_4.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n\n9.98 Neuropharmacology\nJanuary (IAP) 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nSchizophrenia\nChronic disorder that occurs in 1% of the population.\nIt affects both men and women but the onset is different according to the gender\nS\nch\niz\nop\nhr\neni\na i\ns a chronic\ndisor der t hat o ccurs in 1 % of the\npo\npulat\nion and it affects bo\nth men and women.\nFigure by MIT OpenCourseWare.\n\nSymptoms:\nIllogical thinking\nInability to recognize reality\nHallucinations (voices insulting or commanding)\nAbsence of emotions, lack of feelings\nSymptoms change over time\nFunctional Imaging studies revealed:\nDecreased activity in the prefrontal area (hypofrontality)\nActivation of cortical areas during hallucinations\nIncreased activity also in subcortical areas: i.e.limbic system\n\nPositive symptoms:\nNegative symptoms:\nHallucinations\nDisorganized speech\nTreated with antagonist of D2 receptors, aggravated by increasing DA transmission\nReduced speech\nSocial withdrawal\nIntellectual impairement\nLoss of motivation/ emotions\nTreated with the \"atypical antipsychotics\"\n\nEtiology of schizofrenia\nGenetic components and environmental factors\nThere is an enlargement of the ventricles that is NOT\ncaused by cell death. It is rather due do defects\nin development that preceed the onset of the symptoms\nAlso, there are changes in cellular structure non accompanied by gliosis.\nThis suggests that the abnormalities occurred in the developmental process.\nAnatomical studiesGenetic components and environmental factors of schizofrenia.\nFigure by MIT OpenCourseWare.\nImage removed due to copyright restrictions.\nFigure 18.12 in Meyer, and Quenzer, Psychopharmacology, 2004.\n\nEEG show that in schizofrenics, the electrical activity evoked by a stimulus is not\nlocalized, as in normal subjects, but it is widespread in the brain\nLinkage studies across affected individuals identified specific loci on chromosomes\n13, 8, 22 and 6\nGenetic studies\nMicroarray analysis revealed impairments of transcripts for the presynaptic\nfunction in the prefrontal area, but also defects in glutamatergic and GABAergic\nTransmission, energy metabolism and growth factors\nNeurophysiological studies\nHypofrontality\nSchizofrenia is a neurodevelopmental disorder\n\nAmphetamine-induced stereotypy used in animal models for schizofrenia\nHigh dosage of amphetamine induce DA release\nDrugs that treat the symptoms of schizofrenia (neuroleptics)\ncan cause motor impairment (catalepsy)\nGate hypothesis: schizofrenics fail to \"gate\" the stimulus they receive\n(as measured by PPI)\nThe second generation drugs reduce the negative symptoms,\nthey have reduced side effects\nA\nmp\nhe\nta\nmin\ne-i\nnd\nu\nce\nd\nste\nreoty\np\ny\nus\ned\nin\nan\nim\na\nl\nmo\ndel\ns for\nschizof\nrenia.\nFigure by MIT OpenCourseWare.\n\nDrugs that treat the symptoms of schizofrenia (neuroleptics)\ncan cause motor impairment (catalepsy)\nThe second generation drugs reduce the negative symptoms,\nthey have reduced side effects\nThere are evidences of a reduced glutamatergic function (on DA neurons)\nSome studies have found no differences in DA transmission in schizofrenics\n\nPPI is a measure of the \"gate\"\nIt is disrupted by systemic administration of DA agonists and reinstated by\nDA receptor-blocking antipsychotic drugs\nPPI is also disrupted by systemic administration of serotonin agonists and\nGlutamate antagonists\nCommonly use\nd traditiona\nl and atypical antipsy\nchotic drugs and their sid\ne effects.\nFigure by MIT OpenCourseWare.\n\nThe mechanisms of action are not clear\nCommonly use\nd traditiona\nl and atypical antipsyc\nhotic drugs and thei\nr side effects.\nFigure by MIT OpenCourseWare."
    }
  ]
}