{
  "course_name": "Neuroscience and Behavior",
  "course_description": "This course covers the relation of structure and function at various levels of neuronal integration. Topics include functional neuroanatomy and neurophysiology, sensory and motor systems, centrally programmed behavior, sensory systems, sleep and dreaming, motivation and reward, emotional displays of various types, “higher functions” and the neocortex, and neural processes in learning and memory.",
  "topics": [
    "Science",
    "Biology",
    "Neuroscience",
    "Cognitive Science",
    "Social Science",
    "Psychology",
    "Science",
    "Biology",
    "Neuroscience",
    "Cognitive Science",
    "Social Science",
    "Psychology"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 3 sessions / week, 1 hour / session\n\nOverview\n\nNeuroscience and Behavior concerns the relation of structure and function at various levels of neuronal integration. Topics include functional neuroanatomy and neurophysiology, sensory and motor systems, centrally programmed behavior, sensory systems, sleep and dreaming, motivation and reward, emotional displays of various types, \"higher functions\" and the neocortex, and neural processes in learning and memory.\n\nText and Readings\n\nIn addition to the following texts, reading assignments will include primary research articles.\n\nMain Course Textbook\n\nRosenzweig, Mark R., Arnold L. Leiman, and S. Marc Breedlove.\nBiological Psychology\n. 3rd ed. Sunderland, MA: Sinauer Associates, Inc., 2002. ISBN: 0878937099.\n\nSelected Readings\n\nGazzaniga, Michael S., Richard B. Ivry, and George R. Mangun.\nCognitive Neuroscience. The Biology of the Mind\n. New York, NY: W.W. Norton & Company, 1998. ISBN: 0393972194.\n\nSupplementary Textbooks\n\nNauta, Walle J. H., and Michael Feirtag.\nFundamental Neuroanatomy\n. Anatomical drawings by Carol Donner. New York, NY: W.H. Freeman, 1986. ISBN: 0716717220. (Currently out of print)\n\nWolpert, Lewis.\nThe Triumph of the Embryo\n. With illustrations drawn by Debra Skinner. Oxford (England); New York, NY: Oxford University Press, 1991. ISBN: 0198542437.\n\nStudy Questions\n\nFor each class, we will give you study questions for you to work on for the next class lecture and readings assignments. Try to answer study questions regularly.\n\nQuizzes\n\nExpect a quiz every week, focusing on both the lectures and readings. The quizzes are often unannounced. There is a final exam for this course.\n\nWriting Requirements\n\nThere will be at least four writing assignments, consisting of homework problems and literature analysis and review.\n\nDo not copy sentences from your sources and paste them into your writings. Such plagiarism will often be detected. It is not worth the chance of being caught, which is significantly above zero, and the consequences are very unpleasant. Have confidence in your ability to use your own words and cite the source of specific information. If you are having problems, please see the instructor or a TA.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nQuizzes\n\n20%\n\nMidterm\n\n20%\n\nWriting Assignments\n\n30%\n\nFinal Exam\n\n30%",
  "files": [
    {
      "category": "Exam",
      "title": "quiz_spl_sleep.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/9-01-neuroscience-and-behavior-fall-2003/bc7f937769714bd8d42258e7b2586d6c_quiz_spl_sleep.pdf",
      "content": "9.01 End-of-class Quiz, Nov. 3, 2003\n\nCode Name: _______________\n\nIn a cataplexic attack, what kind of sleep intrudes abnormally on the waking state?\n________________________.\n\nIn Nauta's studies of sleep and waking in rats, he made two different lesions in what part\nof the brain? ______________________________.\n\nLesions of the raphe nuclei of the midbrain and hindbrain cause ___________________\nin animals. The severity of this problem is proportional to the amount of destruction of\nthe serotonin-containing raphe neurons.\n9.01 - Neuroscience & Behavior, Fall 2003\nMassachusetts Institute of Technology\nInstructor: Professor Gerald Schneider"
    },
    {
      "category": "Exam",
      "title": "exam_1_2003.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/9-01-neuroscience-and-behavior-fall-2003/c053b25662d1c2a45efc86fb97592256_exam_1_2003.pdf",
      "content": "9.01 Midterm Examination\n\nNAME ____________________________\nOctober 27, 2003\n\n1) Karl Wernicke, in the 1870s, formulated a model of the brain mechanisms for language\nprocesses. What are the two major brain areas involved (name them or give the major function),\nand how are these two connected? (4 points)\n\n2) The molecules kinesin and dynein are involved in what important neuronal activity? (2 points)\n\n3) What did Otto Loewi discover? Answer in a very few words. (You don't have to describe the\nexperiments that he literally dreamed up.) (2 points)\n\n4) Define \"ligand-gated ion channel\" and give an example. (4 points)\n\n5) What is neurohormone release and where does it occur? (2 points)\n\n6) The 'tweenbrain (diencephalon) contains four major subdivisions. Name two of them. (2 points)\n\n9.01 - Neuroscience & Behavior, Fall 2003\nMassachusetts Institute of Technology\nInstructor: Professor Gerald Schneider\n\n9.01 Midterm Examination\n\nNAME ____________________________\nOctober 27, 2003\n\n7) Briefly describe the anatomy of presynaptic inhibition. Why is it called \"inhibition\"? (5 points)\n\n8) Define \"secondary sensory neuron\" and name or describe two examples of such neurons. (4\npoints)\n\n9) Forward locomotion led to, or was associated with, the evolution of ______________\n___________________. (2 points)\n\n10) How is the hindbrain involved in some of the highest levels of human behavior (complex or\nunique behavior)? Answer by giving just one example. (2 points)\n\n11) Describe an example of diaschisis. Be as specific as you can. What major factor affects how\nlong it lasts? (5 points)\n\n9.01 Midterm Examination\n\nNAME ____________________________\nOctober 27, 2003\n\n12) At the junction of hindbrain and spinal cord, there are two major decussations. Define\n\"decussation\" and name or describe one of these major decussations. (3 points)\n\n13) What neurons are located in the \"lateral horn\", and describe the longitudinal level of the CNS\nwhere it can be found. (4 points)\n\n14) Give one example of a parasympathetic nervous system ganglion. (Name it or describe its\nlocation.) What neurotransmitter do these neurons release at their axon terminals? (3 points)\n\n15) Think of midbrain neurons that project to the spinal cord. Answer the following question for one\nsuch neuron: In what structure is it located, and what function is it involved in? (4 points)\n\n16) What types of neurons develop in the embryonic basal plate of the neural tube at spinal levels?\nName two types. (2 points)\n\n9.01 Midterm Examination\n\nNAME ____________________________\nOctober 27, 2003\n\n17) Name a major structure that develops from cells of the rhombic lip in the embryonic central\nnervous system. Where is the rhombic lip found? (3 points)\n\n18) Name two types of migration of post-mitotic neurons. (2 points)\n\n19) From what embryonic cells do the dorsal root ganglia, sympathetic ganglia, and parasympathetic\nganglia arise? (2 points)\n\n20) Answer either A or B: A) The cross section (coronal or frontal section) of the midbrain of the\nrat (or mouse or hamster) differs greatly from that of the squirrel (or tree shrew). What is the\nmajor difference? B) What is a major differences between the rat and human brains, other than\nsize/weight? (2 points)\n\n21) The __________________ forebrain bundle runs through the lateral hypothalamus. It contains\naxons coming from the _________________ system structures of the endbrain. (2 points)\n\n22) Netrin-1: What cells secrete this molecule, and what function of netrin-1 has been found? (4\npoints)\n\n23) Why is an innervated muscle fiber needed within the muscle spindle, a sensory organ? (3 points)\n\n9.01 Midterm Examination\n\nNAME ____________________________\nOctober 27, 2003\n\n24) Describe reciprocal inhibition during a withdrawal reflex. (3 points)\n\n25) Describe a spinal module of limb movement control, as discovered by Bizzi and collaborators. (4\npoints)\n\n26) Describe post-tetanic potentiation. (4 points)\n\n27) Some monkeys in the experiment by Lawrence and Kuypers had complete section of the\npyramidal tract plus lesions of lateral hindbrain pathways. These monkeys showed a paralysis in\none test and lack of paralysis of the same parts of the body in another test. Describe these two\ntests and how the movements differ. (6 points)\n\n28) How does multiple sclerosis cause severe impairments of sensory and motor function, and other\nfunctions as well? Answer by briefly describing the pathology - what goes wrong? (3 points)\n\n9.01 Midterm Examination\n\nNAME ____________________________\nOctober 27, 2003\n\n29) Name or describe one example of anatomical plasticity in the CNS not due to learning. What\ncauses it and what changes? (4 points)\n\n30) In the figure below, identify by name each of the five levels of the embryonic CNS. You may use\nthe English or the Latin or Greek names. Then, identify three parts at level \"e\" or \"d\". Indicate\nclearly the part you are identifying, and give the name. (8 points)\n\n9.01 Midterm Examination\n\nNAME ____________________________\nOctober 27, 2003\n\nDISCARDS:\n\nWhat is the Bell-Magendie law (the discovery by both Charles Bell and Francoise Magendie in the\nearly part of the 19th century)? Exactly where does it apply? (2 points)\n\nWhat are two major types of chemical attractants that can act on growing axons? (4 points) X\n\nWhere is the pituitary and what is the major difference between its two divisions? (4 points)\n\nThe catfish has a 7th cranial nerve with a distribution that differs markedly from that of the 7th cranial\nnerve in mammals. To what major part of the CNS does this nerve connect? After answering this,\nanswer one of the following two questions: What is the anatomical difference in the nerve's\ndistribution? What is the function that led to the difference? (4 points)\n\nDescribe one cell in the neolemniscus: the dorsal column - medial lemniscus pathway. Include the\nlocation of the cell body and of its axonal terminations. (3 points)\n\nDescribe filopodia (one location, their structural appearance, an action). (5 points)\n\nWhat is innervated by alpha motor neurons and by gamma motor neurons? (3 points)\n\nUsing what you know about visual system plasticity, explain why a patch periodically placed over the\nhealthy eye of a child with one \"weak\" eye is a good idea. Why should this be done as early as\npossible? (5 points)\n\nDescribe a genetic disorder that impairs the functioning of the nervous system. (4 points)\n\n1st DRAFT 135 points"
    },
    {
      "category": "Exam",
      "title": "quiz_1_2003.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/9-01-neuroscience-and-behavior-fall-2003/9334c0bc5bd7fefcb2dd1aaeb712f046_quiz_1_2003.pdf",
      "content": "9.01 Quiz 1\n\nName __________________________________\n9/10/2003\n\n1. What was Karl Lashley's principle of equipotentiality? What led Lashley to this\n(incorrect) conclusion? Your answer should refer to his experiments.\n\n2. What is the \"law of roots\"?\n\n3. Name two persons in the history of neuroscience before 1900 who argued for\n\"localization of function\" and briefly describe the nature of their evidence.\n9.01 - Neuroscience & Behavior, Fall 2003\nMassachusetts Institute of Technology\nInstructor: Professor Gerald Schneider"
    },
    {
      "category": "Exam",
      "title": "exam_2_2003.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/9-01-neuroscience-and-behavior-fall-2003/f57696b455702ad8a9694e8aa36f9313_exam_2_2003.pdf",
      "content": "9.01 Final Exam, Dec. 16, 2002 NAME ___________________________________\n\n1) Fixed Action Patterns are fixed in the ___________________. (1 point)\n\n2) The effect of TTX (tetrodotoxin, from the Japanese puffer fish) that is of great interest to\nneuroscientists is __________________________________________________. (2 points)\n\n3) Karl Lashley's 1917 paper, \"The problem of serial order in behavior\", was concerned with a\nbasic issue in CNS control of movement. Briefly explain his argument and his conclusion.\n(5 points)\n\n4) Describe an attack of cataplexy in a narcoleptic individual (human or dog) What triggers it\nand how can it be characterized? (4 points)\n\n5) Name the locus of a brain lesion that results in a large disturbance in sleep-waking control.\nThen, describe the disturbance. (3 points)\n\n6) What is the \"model of the stimulus\" in the theory of habituation described by the Russian\nneuroscientist Eugene Sokolov? (3 points)\n\n9.01 - Neuroscience & Behavior, Fall 2003\nMassachusetts Institute of Technology\nInstructor: Professor Gerald Schneider\n\n9.01 Final Exam, Dec. 16, 2002 NAME ___________________________________\n\n7) Describe a biological clock of a mammal: a) Where is it in the brain? (Name the structure or\ndescribe its location.) b) How fast does it run? c) How can it be re-set by stimulation from\nthe outside? (4 points)\n\n8) Where is the optic chiasm located? ___________________________________________\nName the cells of origin of the axons in the optic chiasm.\n____________________________________ (3 points)\n\n9) Name three neuronal cell types in the vertebrate CNS that communicate with other cells\nwithout action potentials. (Remember: the retina is part of the CNS.) (3 points)\n\n10) The visual cortex of the right hemisphere represents what part of the visual field of the left\neye? And what part of the visual field of the right eye? (3 points)\n\n11) Describe a test that has given evidence of vision in people with striate cortex lesions, within\ntheir scotomata, although they said \"I see nothing\" when shown something within a\nscotoma? (3 points)\n\n9.01 Final Exam, Dec. 16, 2002 NAME ___________________________________\n\n12) Describe the brain lesion in cats made by James Sprague that resulted in a permanent\ndiaschisis effect on the superior colliculus. What was the second lesion he made, and what\nwas the result (the \"Sprague effect\")? (4 points)\n\n13) What are three non-local sources of input to the inferotemporal neocortex? (3 points)\n\n14) What are \"recurrent connections\" in the neocortex? Give an example for the visual system.\n(4 points)\n\n15) Describe two major effects of SC (superior colliculus) ablation in hamsters. (2 points)\n\n16) Why do superior colliculus lesions in neonate hamsters have effects different from those of\nlesions in adults? (2 points)\n\n9.01 Final Exam, Dec. 16, 2002 NAME ___________________________________\n\n17) What is visual acuity? Describe two reasons why visual acuity is much greater in the fovea\nthan in the periphery of the visual field. (5 points)\n\n18) Describe briefly the properties of receptive fields for two neocortical cells, one in the\n\"primary\" visual cortex (striate cortex = area 17) and one in an extrastriate area. (6 points)\n\n19) Nucleus laminaris in the chicken is like the medial nucleus of the superior olive in\nmammals. The neurons of nucleus laminaris receive inputs from what secondary sensory\ncells? ________________________________________________. Nuc. laminaris neurons\nfire action potentials under what conditions? ___________________________________\n_________________________________________. What property of the stimulus do these\nneurons encode? _________________________________________________________ (5\npoints)\n\n20) Distinguish between the functions of the \"two auditory pathways\" (referring to ascending\nprojections in the brainstem). (2 points)\n\n9.01 Final Exam, Dec. 16, 2002 NAME ___________________________________\n\n21) What was the discovery that encouraged Fernando Nottebohm at Rockefeller University to\nwrite the paper \"A brain for all seasons\" ? (5 points)\n\n22) The aversiveness of loud sounds depends on what structure in rats?\n_________________________________________________________ (1 point)\n\n23) Describe the lesion and the major symptoms of the Brown-Sequard syndrome. (5 points)\n\n24) What is the anatomical defect in someone with congenital insensitivity to pain? (2 points)\n\n25) What are endogenous opioids? Give a specific example of their action. (4 points)\n\n9.01 Final Exam, Dec. 16, 2002 NAME ___________________________________\n\n26) Why does a person usually perceive a limb (a \"phantom limb\") after the actual limb has been\namputated? (2 points)\n\n27) Describe an adaptive function of \"overeating\" and weight gain. Name the species that needs\nthis function, or once needed it in its evolution. (3 points)\n\n28) Describe the weight regulation seen in rats with a) lesions of the ventromedial hypothalamus\nthat destroy descending axons from the paraventricular nucleus, and b) lesions of the lateral\nhypothalamic area. What molecule may be involved? (5 points)\n\n29) Describe one method for measuring the reward effects of brain stimulation. Where in the\nbrain can an electrode be placed that is very likely to cause rewarding effects (pleasure)\nwhen stimulated? (4 points)\n\n9.01 Final Exam, Dec. 16, 2002 NAME ___________________________________\n\n30) What is \"quiet biting attack\" in cats? How can we be sure that it is an innate behavior\npattern? Is the hypothalamus necessary for this behavior to occur? How do you know that?\n(6 points)\n\n31) How is olfactory information, detected by primary sensory neurons of the nasal epithelium,\norganized in the olfactory cortex? [Rosenzweig ch. 9] (3 points)\n\n32) Describe two differences (dimorphisms) between the brains of male and female animals or\npeople. [Rosenzweig ch. 12] (4 points)\n\n33) What are two kinds of thirst, with different triggering stimuli? [Rosenzweig ch 13, 15] (4\npoints)\n\n9.01 Final Exam, Dec. 16, 2002 NAME ___________________________________\n\n34) What is D. O. Hebb's hypothesis regarding the conditions under which synaptic strengths\nmay change? [Rosenzweig ch. 18; also: exper. of Kelso & Brown (1986) in support.] (4\npoints)\n\n35) Describe Seasonal Affective Disorder. [Rosenzweig ch. 16] (3 points)\n\n36) Describe 2 kinds of specific evidence that limbic forebrain structures are important in\nemotion. (4 points)\n\n37) One area of neocortex has been found to have direct connections to the hypothalamus. That\nneocortical area is ________________________________________________. (2 points)\n\n38) Name or describe two pathologies that involve dissociated mental states that include\nmemory dissociation. (4 points)\n\n9.01 Final Exam, Dec. 16, 2002 NAME ___________________________________\n\n39) Describe three findings that indicate that the human brain is not symmetric for cognitive or\naffective functions. (6 points)\n\n40) Describe tests for hemispheric dominance for language functions and for detecting facial\nexpression of emotion. What is the most common result in each case? (5 points)\n\n41) Why is a tachistoscope important for studies of split brain patients, when the experimentors\nare investigating differences in the function of the right and left hemispheres? (5 points)\n\n9.01 Final Exam, Dec. 16, 2002 NAME ___________________________________\n\n42) Give examples of an autonomic effect of hypoglycemia (low blood glucose) and a CNS\neffect. (4 points)\n\n43) What is meant by \"cross-cuing\" in the behavior of a split brain patient? (4 points)\n\n44) Experimental studies of the patient known as H.M., a man with bilateral lesions of the\nhippocampal formation, led to two major dissociations in the study of memory. What are\nthey? (4 points)\n\n45) Why is an innervated muscle fiber needed within the muscle spindle, a sensory organ? (3\npoints)\n\n46) At the junction of hindbrain and spinal cord, there are two major decussations. Define\n\"decussation\" and name or describe one of these major decussations. (3 points)\n\n47) The ____________________ forebrain bundle runs through the lateral hypothalamus. It\ncontains axons coming from the ______________________ system structures of the\nendbrain. (2 points)\n\n48) Karl Wernicke, in the 1870s, formulated a model of the brain mechanisms for language\nprocesses. What are the two major brain areas involved (name them or give the major\nfunction), and how are these two connected? (4 points)\n\n9.01 Final Exam, Dec. 16, 2002 NAME ___________________________________\n\n49) In the figure below, identify by name each of the five levels of the embryonic CNS. You\nmay use the English or the Latin or Greek names. Then, identify three parts at level \"e\" or\n\"d\". Indicate clearly the part you are identifying, and give the name. (8 points)\n\nDISCARDS:\n\nFor the visual system, describe two distinct routes that information can take from the retina to the\nneocortex."
    },
    {
      "category": "Exam",
      "title": "quiz_2_2003.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/9-01-neuroscience-and-behavior-fall-2003/1bccb7477abbefb122882f77d5753b9a_quiz_2_2003.pdf",
      "content": "9.01 Quiz 2\n\nName __________________________________\n9/17/2003\n\n1. The two ions that are most involved in the action potential are __________________\nand _______________________. They pass through the axonal membrane via\n______________-gated ion channels. These channels are actually\n__________________ embedded in the cell membrane.\n\n2. The speed of the action potential is determined by what two anatomical properties?\n_______________________________ and _________________________________\n\n3. Name four structural arrangements of synapses as seen by electron microscopy.\n\n9.01 - Neuroscience & Behavior, Fall 2003\nMassachusetts Institute of Technology\nInstructor: Professor Gerald Schneider"
    },
    {
      "category": "Exam",
      "title": "quiz_3_2003.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/9-01-neuroscience-and-behavior-fall-2003/691e7f7bc0c08753618a993a876180db_quiz_3_2003.pdf",
      "content": "9.01 Quiz 3\n\nName __________________________________\n9/26/2003\n\n1. Contrast retrograde and anterograde degeneration in the CNS.\n\n2. What are two behavioral specializations, in primates, that include expanded control\nareas in the CNS.\n\n3. The worm-like animal Amphioxus has a nervous system that is \"simpler\" than that of\nmany insects. Yet, it is a member of our phylum, the chordates. Why is it classified as\na chordate?\n9.01 - Neuroscience & Behavior, Fall 2003\nMassachusetts Institute of Technology\nInstructor: Professor Gerald Schneider"
    },
    {
      "category": "Exam",
      "title": "quiz_4_2003.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/9-01-neuroscience-and-behavior-fall-2003/e2eec762b46679ab13497b788242d9e3_quiz_4_2003.pdf",
      "content": "9.01 Quiz 4\n\nName __________________________________\n10/08/2003\n\n1) Describe one of the long pathways connecting the neocortex with the spinal cord.\nState the direction of information flow, and specify the location of the cell bodies and\nthe synaptic connections.\n\n2) Describe either the sympathetic or the parasympathetic innervation of the heart.\n\n3) Describe the eyeblink reflex: location of cell bodies and synapses involved.\n\n9.01 - Neuroscience & Behavior, Fall 2003\nMassachusetts Institute of Technology\nInstructor: Professor Gerald Schneider"
    },
    {
      "category": "Exam",
      "title": "quiz_5_2003.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/9-01-neuroscience-and-behavior-fall-2003/0d0f1cf82d2f1323f3c3824dc73fdbe3_quiz_5_2003.pdf",
      "content": "9.01 Quiz 5\n\nName __________________________________\n10/17/2003\n\n(print on back of this sheet also)\n\n1. The protein called Sonic Hedgehog plays an important role in the induction of the\nnervous system from the primitive ectoderm. In our phylum, this molecule comes\nfrom the _________________________ (a structure in the embryo). Later it is also\nsecreted by the _____________ ___________________ of the neural tube. (2 points)\n\n2. What is the difference between symmetric and asymmetric cell division during the\nstage of proliferation in the neural tube? (4 points)\n\n3. In the early development of the neocortex, proliferating cells migrate from the\nventricular or subventricular layer to the cortical plate by what mechanism? (2 points)\n\n4. Describe one experiment that demonstrated chemical guidance of growing axons. (4\npoints)\n\n9.01 - Neuroscience & Behavior, Fall 2003\nMassachusetts Institute of Technology\nInstructor: Professor Gerald Schneider"
    },
    {
      "category": "Exam",
      "title": "quiz_6_2003.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/9-01-neuroscience-and-behavior-fall-2003/6ed9b52ebb68820b87eaf3d7ccdb49d6_quiz_6_2003.pdf",
      "content": "9.01 Quiz 6\n\nName __________________________________\n11/05/2003\n\n(print on back of this sheet also)\n\n1) What determines the temporal pattern in the components of the startle reflex?\n\n2) Name two mechanisms that can determine temporal patterns of neuronal activity,\nother than reflexes.\n\n3) Night terror and somnambulism (sleep walking) occur in what kind of sleep?\n\n9.01 - Neuroscience & Behavior, Fall 2003\nMassachusetts Institute of Technology\nInstructor: Professor Gerald Schneider"
    },
    {
      "category": "Exam",
      "title": "quiz_7_2003.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/9-01-neuroscience-and-behavior-fall-2003/6b57e550838b956b3f1c089d88b1bf5d_quiz_7_2003.pdf",
      "content": "9.01 Quiz 7\n\nName __________________________________\n11/19/2003\n\n(print on back of this sheet also)\n\n1) What are the two lesions of the cat brain used in a demonstration of the Sprague\neffect (which demonstrated corticotectal diaschisis).\n\n2) Name a retinal neuron that does not fire action potentials. Name another one that\ndoes fire action potentials.\n\n3) Humans and monkeys with ablation of the striate cortex (primary visual cortex) are\nblind in some tests and not in others. Give an example of each type of test, one in\nwhich they fail and another where they show visual ability.\n9.01 - Neuroscience & Behavior, Fall 2003\nMassachusetts Institute of Technology\nInstructor: Professor Gerald Schneider"
    },
    {
      "category": "Resource",
      "title": "rsq_1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/9-01-neuroscience-and-behavior-fall-2003/50d8577f66bbfb62be8670d822d2c6ca_rsq_1.pdf",
      "content": "Study questions for lecture 1 assigned readings.\n\nFrom Mackay pp. 24-26:\n\nNote: This is the same as question 10 from the lecture 1 lecture study questions.\n\n1. How did Donald M. MacKay argue that one can accept physiological\ndetermination of behavior and still argue that a person is responsible for her\nactions?\n\n9.01 - Neuroscience & Behavior\nFall 2003\nMassachusetts Institute of Technology\nInstructor: Professor Gerald Schneider"
    },
    {
      "category": "Resource",
      "title": "rsq_2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/9-01-neuroscience-and-behavior-fall-2003/3c646201661a113bef1f181ebaed06df_rsq_2.pdf",
      "content": "Study questions for lecture 2 assigned readings.\n\nFrom Rosenzweig pp. 1-21:\n\n1. What might you hypothesize if you find that a). some feature of the nervous system is\nmuch the same in two species that are extremely different( like squid and humans)? b).\nsome feature of the nervous system is quite different in two species that are closely\nrelated (like chimpanzees and humans)?\n\n2. How can developmental research shed light on the organization of the nervous\nsystem? Use the development of memory as an example.\n\n3. What is the basis for saying that \"what is true of E. coli is true of the elephant\"? In\nwhat ways does this generalization not hold true?\n\n4. What are the independent variable and dependent variable of somatic intervention,\nbehavioral intervention and correlation experimental approaches in biological\npsychology, respectively?\n\n5. What does the term 'neural plasticity' refer to? Give examples.\n\n6. For each of the sections that follow, prepare two brief statements: one concerning the\nnature of the problem, and one concerning current research on that topic.\n\na). Problem: Growth and development of the nervous system.\nb). Problem: Processing of sensory information by the nervous system.\nc). Problem: Basis of sexual orientation.\nd). Problem: Brain regions underlying emotions.\ne). Problem: Storage of information by the brain\nf). Problem: Neural bases of language.\n\n7. What are the main points in D.O Hebb's book 'The organization of behavior'?\n9.01 - Neuroscience & Behavior\nFall 2003\nMassachusetts Institute of Technology\nInstructor: Professor Gerald Schneider"
    },
    {
      "category": "Resource",
      "title": "rsq_3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/9-01-neuroscience-and-behavior-fall-2003/d767679fdc6da902d8e85e47ca25b034_rsq_3.pdf",
      "content": "Study questions for lecture 3 assigned readings.\n\nFrom Gazzaniga pp. 75-120:\n\n1. What is a topographic map? What is the external dimension that is mapped in\nvisual, somatosensory, and motor topographic maps, respectively?\n2. Why does the somatosensory homonculus contain very large representations of\nthe fingers?\n3. What is a receptive field?\n4. How can the single-cell recording method be used to construct a topographic map\nin the visual system?\n5. What are the practical limitations of using lesions to determine the function of a\ncertain region of the brain?\n6. What are some of the major causes of neurological disorders?\n7. What is the Stroop task, and how do results from experiments using this task\nsupport the idea that the mind derives multiple representations of stimuli?\n8. Why is a connectionist computer model less affected by a single \"lesion\" than a\nserial computer model?\n9. PET and fMRI do not measure neural activity directly. What do these techniques\nactually measure, and how is what they measure thought to relate to neural\nactivity?\n\n9.01 - Neuroscience & Behavior\nFall 2003\nMassachusetts Institute of Technology\nInstructor: Professor Gerald Schneider"
    },
    {
      "category": "Resource",
      "title": "sq4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/9-01-neuroscience-and-behavior-fall-2003/133581c6b5ab03eb6c5ee2b2b3c5082d_sq4.pdf",
      "content": "9.01 - Neuroscience & Behavior\nFall 2003\nMassachusetts Institute of Technology\nInstructor: Professor Gerald Schneider\nStudy Questions for lecture 4 assigned readings.\nFrom Rosenzweig pp. 25-56:\n1. Give a brief account of the process by which information is transmited from the\npresynaptic cell to the postsynaptic cell. What change occurs in the postsynaptic\ncell?\n2. What are the two parts of the neuron doctrine?\n3. Write a brief description of the anatomy of the autonomic nervous system, using\nthe following terms in your answer: autonomic ganglia, preganglionic neurons,\npostganglionic neurons, sympathetic nervous system, sympathetic chain,\nparasympathetic nervous system.\n4. The hypothalamus, a collection of small nuclei, is implicated in numerous\nimportant, basic functions. Name some of these.\n5. Name the parts of the basal ganglia and a major function of this system,\n6. Describe the architecture and basic functions of the cerebellum and pons.\n7. What is meant by a \"cortical column\"? Describe the size and shape of a column;\nwhat is its functional significance?\n8. How many layers does the cortex have, and how do the layers vary from one\nanother?\n9. Give an outline of modern techniques for producing images of a living person's\nbrain and the particular advantages each technique offers."
    },
    {
      "category": "Resource",
      "title": "sq5.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/9-01-neuroscience-and-behavior-fall-2003/d2f51b98addc153946ae4f9c3c48dfaf_sq5.pdf",
      "content": "9.01 - Neuroscience & Behavior\nFall 2003\nMassachusetts Institute of Technology\nInstructor: Professor Gerald Schneider\nStudy Questions for lecture 5 assigned readings.\nFrom Rosenzweig chapters 3-5:\n1. Name the three important kinds of membrane potentials produced by neurons, the\ncellular location in which each is produced, and the basic ways in which they\ndiffer from one another.\n2. Provide an account of the membrane events that occur when an action potential is\nproduced.\n3. List the sequence of events involved in chemical synaptic transmission.\n4. Describe the EEG, and explain what it reflects, with examples.\n5. Describe the distribution of dopaminergic pathways, receptors for dopamine, and\nsome functional details of this system.\n6. Give an overview of the functioning of the NMDA receptor, highlighting its novel\nfeatures and functions.\n7. Describe some of the major ways in which neural processes are affected by drugs.\n8. What are some of the effects and general mechanisms of action of the major\nconsciousness-altering drugs?\n9. Hormones can have effects over tiny distances or large ones. Give an overview of\nthe various categories of hormonal communication.\n10. Summarize the four principle ways in which hormonal communication is different\nfrom communication between neurons.\n11. Give an anatomical description of the pituitary gland and discuss its two major\ndivisions.\n12. Identify the hormones that are known to have effects on memory processes, and\ndescribe some of the general ways in which they have these effects."
    },
    {
      "category": "Resource",
      "title": "rsq_6.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/9-01-neuroscience-and-behavior-fall-2003/89365372db40729635d368a4abcd790b_rsq_6.pdf",
      "content": "Study questions for lecture 6 assigned readings.\n\nFrom Rosenzweig pp. 213-234:\n\n1. What is sensory transduction, and how do receptor cells contribute to it?\n2. Describe the steps involved for a Pacinian corpuscle to signal the presence of its\npreferred stimulus to the nervous system.\n3. What is the concept of a labeled line? According to this concept, how do we\ndistinguish between, e.g., pain and vibration if they stimulate the same region of\nskin? How does the concept explain the ability to locate where a visual stimulus\noccurs?\n4. What is the difference between a tonic and phasic receptor? What is the\nadvantage of each?\n5. Why might there be more than one map of a given receptive surface, such as the\nbody surface in the somatosensory cortex?\n6. What are a couple experiments that have demonstrated that there is plasticity in\nsomatosensory cortical maps?\n7. What is meant by saying that the somatosensory cortex has a columnar\norganization? Do these different columns have any approximate relation to\ndifferent types of touch receptors (Pacinian corpuscle, Meissner corpuscle,\nMerkel disks, Ruffini's ending)?\n8. What might be the advantage to having a columnar organization of somatosensory\ncortex?\n\n9.01 - Neuroscience & Behavior\nFall 2003\nMassachusetts Institute of Technology\nInstructor: Professor Gerald Schneider"
    },
    {
      "category": "Lecture Notes",
      "title": "lectures_7_8.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/9-01-neuroscience-and-behavior-fall-2003/3cab5f3f2e7c1a7135a0e86f07549368_lectures_7_8.pdf",
      "content": "Study Questions on Required Readings for Lectures 7 and 8\n\nRosenzweig Chapter 6 (p 149 - 175)\nEvolution of Brain and Behavior\n\n1) How did Lamarck's theory of evolution differ from the one proposed by\nDarwin?\na. In what ways does our current knowledge of genetics provide support\nfor one of these theories?\n\n2) How is the rat brain similar to the human brain? How are they different?\n\n3) Describe the properties of Aplysia and Drosophila that make them useful for\nneuroscience research.\na. Name a few ways in which their nervous systems differ from the\nhuman nervous system.\n\n4) What is the neocortex?\n\n5) What does the encephalization factor (k) describe?\na. In figure 6.13 (c), where does the value \"0.69\" come from?\nb. Which mammal has the largest brain weight as a percentage of body\nweight? the largest k?\n\n6) What did the H. Stephan (1981) study demonstrate?\na. Do all regions of the brain increase in size at the same rate? (figure\n6.15)\n\n7) Briefly, describe the characteristics of:\na. australopithecines\nb. Homo erectus\nc. Homo sapiens\n\n8) \"Geoffrey Miller suggests that natural selection to obtain food and shelter is\nnot likely to account completely for the large brain and complex intelligence\nof Homo sapiens.\" What does Miller propose as an additional factor to\naccount for the large size of human brains?\na. How does this explain, according to evolution, other characteristic\nhuman traits?\nb. Describe an experiment that supports Miller's hypothesis.\n9.01 - Neuroscience & Behavior\nFall 2003\nMassachusetts Institute of Technology\nInstructor: Professor Gerald Schneider"
    },
    {
      "category": "Lecture Notes",
      "title": "9_01_lecture33.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/9-01-neuroscience-and-behavior-fall-2003/729720633a038fadf1ea07ebb0d6600b_9_01_lecture33.pdf",
      "content": "9.01 - Neuroscience & Behavior\nFall 2003\nMassachusetts Institute of Technology\nInstructor: Professor Gerald Schneider\nReadings Study Questions LECTURE 33 (Pain and the midbrain central grey area)\nPAGE 1/2\n9.01 Fall 2002\nOn Rosenzweig Chapter 8 (pages 235-245): Pain\n1. What type of primary sensory neurons respond to painful stimuli? How do they differ? Do they specifically\nsense \"pain\" per se? Why or why not?\n2. Describe one pathway by which information about painful stimuli reaches the cortex.\n3. Where in this circuit do descending cortical projections act to prevent incoming pain signals from reaching the\nbrain? Describe two other mechanisms by which pain can be modulated.\n4. What is meant by \"placebo analgesia\"?\nOn Rosenszweig Chapter 15 (pages 469-501): Emotions, Aggression, and Stress\n1. Why is there variation in the emotional responsiveness of individuals? (what are evolutionary, developmental, or\nproximal explanations)\n2. What did experiments on decorticate dogs suggest about the function of the neocortex in emotion?\n3. The emotional effects seen in primates with Kluver-Bucy syndrome (a result of temporal lobe removal) are not\nthe same as the effects of cortex removal. In fact, this syndrome seems to be caused by lesions to the underlying\n____________ system rather than lesions to the temporal neocortex. List five main structures in this system.\nLesions of which one yields effects similar to those seen in Kluver-Bucy syndrome? How did study of a human\npatient lacking this structure support these findings?\n4. Describe three pieces of evidence that suggest, at least in terms of cognitive processing, the brain is not\nsymmetric.\n5. Discuss some of the limitations of studies that ascribe aggression in humans to high levels of testosterone.\n6. Describe some short term advantages of stress. What are some long-term disadvantages?\n\n9.01 Readings Questions LECTURE 33 (continued):\nPAGE 2/2\nOn Rosenszweig Chapter 9 (pages 269-279): Taste and Smell\n1. For which of the four basic tastes is the basic stimulus transduction mechanism known? What is the specific\nstimulus that causes depolarization of the sensory receptor cell?\n2. What is the correllation between being a \"taster\", \"nontaster\", or \"supertaster\" for PTC and the number of\ntastebuds on your tongue?\n3.\na. True/False. The ability to perceive the four basic tastes is segregated into different regions of the\ntongue.\nb. True/False. Each sensory cell in the tongue can be depolarized by only one taste.\n4. Which cranial nerves carry taste information to the brainstem (to be transmitted to the VPM of the thalamus and\nsomatosensory cortex)?\n5. Is olfactory information transmitted to the brain via a cranial nerve? How many synapses lie between the sensory\ncell dendrites in the olfactory epithelium and olfactory cortex?\n6. Each olfactory sensory neuron expresses only one kind of olfactory receptor protein (usually, this receptor is\nspecific for molecules with functional groups in a specific configuration). What kind of receptors are they? What is\na possible explanation for the discrepancy between the number of olfactory receptor genes we have (~1000) and the\nnumber of smells we can discriminate (~5000)?\n7. How are the olfactory projections from the nose organized in the olfactory cortex? How does this compare to the\ntopographic map of visual space in the optic tectum?\n8. What is the primary role of the VNO in rodents?\nFrom Rosenszweig Chapter 12 (pages 363-398): Sex\n1. What hormone is ultimately responsible for masculinization of the brains of XY fetal rats? Where is\nthis hormone synthesized?\n2. Describe three differences (dimorphisms) between the brains of male and female animals.\n3. What is a possible cellular basis for \"androgen insensitivity\"? If a rat lacks sensitivity to androgens,\nwill its brain develop with \"masculine\" or \"feminine\" characteristics? What about a human? Why?"
    },
    {
      "category": "Lecture Notes",
      "title": "questions_lec9.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/9-01-neuroscience-and-behavior-fall-2003/df2112420df4487803f9a8647eaec8d9_questions_lec9.pdf",
      "content": "9.01 - Neuroscience & Behavior\nFall 2003\nMassachusetts Institute of Technology\nInstructor: Professor Gerald Schneider\nReadings Study Questions (on Nauta Chapter 5, for Lectures 9 and 10)\nThree main pathways to the brain from a sensory stimulation of the body are the\nspinothalamic tract, the dorsal column-medial lemniscus pathway, and\nthe spinocerebellar tract.\nThe spinothalamic tract carries diffuse touch, temperature, and pain information.\nThe medial lemniscus carries information about discriminative (fine) touch and\nvibration (as well as some proprioception).\nThe spinocerebellar tract carries proprioceptive info (position of body in space).\n1. Describe the pathway of sensory information flow from the skin to somatic cortex\nfollowing a vibratory stimulus.\n2. Briefly describe two sensory pathways that are involved in preventing a tightrope\nwalker from falling?\n3. What feature of sensory receptor inputs might account for the fine resolution of the\ntwo-point discrimination task? Give an example of one such input.\n4. Comment on the following using what you know about auditory conduction: \"If a tree\nfalls in the forest and noone hears it, does it still make a sound?\"\n5. It has recently been reported that some ganglion cells can fire action potentials (APs)\nin direct response to light without photoreceptor input. If an electrode is placed in the\nphotoreceptor layer and one of these ganglion cells simultaneously, which should\nrespond first to a light shined on the retina? Why?\n6. Why might the initial neural response to an olfactory stimulus display a shorter latency\nthan to any other type of sensory stimuli?"
    },
    {
      "category": "Resource",
      "title": "rsq_11.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/9-01-neuroscience-and-behavior-fall-2003/b20c23eb2790503991b27f5c17a4d9c8_rsq_11.pdf",
      "content": "Study questions for lecture 11 assigned readings.\n\nFrom Gazzaniga pp. 75-120:\n\n1. What is a topographic map? What is the external dimension that is mapped in\nvisual, somatosensory, and motor topographic maps, respectively?\n2. Why does the somatosensory homonculus contain very large representations of\nthe fingers?\n3. What is a receptive field?\n4. How can the single-cell recording method be used to construct a topographic map\nin the visual system?\n5. What are the practical limitations of using lesions to determine the function of a\ncertain region of the brain?\n6. What are some of the major causes of neurological disorders?\n7. What is the Stroop task, and how do results from experiments using this task\nsupport the idea that the mind derives multiple representations of stimuli?\n8. Why is a connectionist computer model less affected by a single \"lesion\" than a\nserial computer model?\n9. PET and fMRI do not measure neural activity directly. What do these techniques\nactually measure, and how is what they measure thought to relate to neural\nactivity?"
    }
  ]
}