{
  "course_name": "Neutron Interactions and Applications",
  "course_description": "This course is intended to introduce the student to the concepts and methods of transport theory needed in neutron science applications. This course is a foundational study of the effects of multiple interactions on neutron distributions and their applications to problems across the Nuclear Engineering department. Stochastic and deterministic simulation techniques will be introduced to the students.",
  "topics": [
    "Engineering",
    "Chemical Engineering",
    "Transport Processes",
    "Nuclear Engineering",
    "Science",
    "Chemistry",
    "Physical Chemistry",
    "Engineering",
    "Chemical Engineering",
    "Transport Processes",
    "Nuclear Engineering",
    "Science",
    "Chemistry",
    "Physical Chemistry"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nCourse Description\n\nThis course is intended to introduce the student to the concepts and methods of transport theory needed in neutron science applications. This course is a foundational study of the effects of multiple interactions on neutron distributions and their applications to problems across the Nuclear Engineering department. Stochastic and deterministic simulation techniques will be introduced to the students.\n\nCourse Structure\n\nAssignments\n\nThere will be a total of 6 homework assignments. The due dates are indicated on the schedule of class. Some homework will require the use of computational language such as Fortran or Matlab. Students that are not familiar with such languages are encouraged to do a few\ntutorials\n.\n\nTerm Paper\n\nThe goal of the 22.106 project is to give the student the opportunity to learn on their own and transmit this knowledge in a written 10 page report. The student is encouraged to pick a topic of their interest, but this topic must go beyond what is thought in the current Nuclear Engineering curriculum. The student may not pick a topic directly related to their current of previous research. Please keep in mind that the subject must be related to Neutron Interactions and Applications. A list of possible topics will be handed out towards mid-February, but students are encouraged to come up with their own original ideas. Topics must be selected by Ses #9 and final reports are due in Ses #24.\n\nEXAMS\n\nPERCENTAGES\n\nHomework\n\n30%\n\nTerm paper\n\n20%\n\nMid term\n\n25%\n\nFinal exam\n\n25%\n\nMIT Statement on Plagiarism\n\nPlagiarism--use of another's intellectual work without acknowledgement--is a serious offense. It is the policy of the Literature Faculty that students who plagiarize will receive an F in the subject, and that the instructor will forward the case to the Committee on Discipline. Full acknowledgement for all information obtained from sources outside the classroom must be clearly stated in all written work submitted. All ideas, arguments, and direct phrasings taken from someone else's work must be identified and properly footnoted. Quotations from other sources must be clearly marked as distinct from the student's own work. For further guidance on the proper forms of attribution, consult the style guides available at the\nWriting and Communication Center\nand\nthe MIT Web site on Plagiarism\n.\n\nCalendar\n\nLEC #\n\nTOPICS\n\nIntroduction / Logistics / Microscopic Interactions\n\nMacroscopic Interactions / Moderation Shielding\n\nNuclear Data\n\nR-Matrix Theory\n\nNeutron Thermalization\n\nScattering Laws / SANS\n\nNeutron Detection and Spectroscopy\n\nReview of Probability and Statistics, Introduction to Monte Carlo\n\nCollision Physics and Sampling\n\nTallying and Uncertainties\n\nVariance Reduction Techniques\n\nCriticality Safety / Monte Carlo Criticality\n\nDerivation of Transport Equation\n\nBoundary Conditions, Interface Conditions\n\nSimple Analytical Solutions to TE\n\nIntegral Form of TE\n\nCollision Probability Method\n\nDiscrete Ordinate Method\n\nPN Method / Diffusion\n\nLinearity of TE / Reciprocity Relation\n\nAdjoint Equation / Perturbation Theory\n\nVariational Methods\n\nPhoton Transport / Image Rendering\n\nMolecular Dynamics I\n\nMolecular Dynamics II",
  "files": [
    {
      "category": "Resource",
      "title": "MIT22_106S10_assn01.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/22-106-neutron-interactions-and-applications-spring-2010/c57a47258be0072ed19da3bda6f0511e_MIT22_106S10_assn01.pdf",
      "content": "22.106 Neutron Interactions and Applications\nProblem Set 1\n\nDue SES #4\n\nQuestion 1\n\nRead Chadwick's 1932 paper in Chadwick, James. \"Possible Existence of a Neutron.\" Nature\n(Feb. 27, 1932): 312 on the possible existence of a neutron, and then answer the following\nquestions briefly and concisely.\n\n(a) State in no more than two sentences what is the problem Chadwick addressed. In other words,\nwhat is the controversy that Chadwick intended to resolve?\n\n(b) What are the experimental results that Chadwick cited to show that there is an unresolved\nproblem?\n\n(c) Explain what was meant by the Compton effect (interaction between what and what) brought\nup by Chadwick in the early part of the paper?\n\n(d) What was Chadwick resolution to the controversy that he raised? What argument did he use to\nsupport his resolution, and was it of an experimental or theoretical nature?\n\n(e) How did Chadwick arrive at his postulate of the existence of a neutron?\n\n(f) Was Chadwick very sure of his conclusion? Did he leave the door open for other possible\nexplanations? What exactly was the quantum hypothesis mentioned in the final sentence?\n\n(g) Write an abstract of Chadwick's paper in not more than 4 normal sentences.\nQuestion 2\n\na) From the data in the table below, suggest which material you would select as a\nmoderator to increase the number of counts in a neutron detection device and\njustify your selection.\n\nTable I\nMaterial\nξ\nΣS (cm-1)\nΣA (cm-1)\nA\n0.7\nB\n0.5\n0.2\nC\n0.25\n0.05\nξ: Average logarithmic energy decrement\nΣS: Macroscopic scattering cross-section\nΣA: Macroscopic absorption cross-section\n\nb) Explain the need for a moderator in the development of a detection device for fast\nneutrons.\n\nQuestion 3\n\nA neutron ground probe that uses 1 MeV neutrons is used to detect the presence of oil in limestone (CaCO3).\nThe ground beneath the probe has been compacted non-uniformly over the years. This density change can\nbe estimated by the following linear relation:\np(x) = 2.2 (1 + 0.01x), where x is in meters and ρ(x) is in g/cm3.\na) Calculate the probability of neutrons reaching a depth of 200 meters.\nb) If more neutrons are needed to reach 200 meters to obtain significant results,\nsuggest two possibilities for increasing the number of neutrons.\nTable I: Nuclear data of limestone\nMicroscopic total x.s. at 1 MeV (in barns)\nCa\n1.14\n\nC\n\n2.58\nO\n8.22\n\nQuestion 4\n\nRead the Cruzate et al paper on Bonner sphere Spectrometer.\na) Discuss the limitations of experimentation in determining the response matrix data.\nb) Discuss the benefits of modeling and simulation in this context.\nc) A mono-energetic neutron source is detected by a system of Bonner spheres with\nresponse matrix of Figure 4. Using the data provided below, determine the\nneutron energy of the source.\n\nResponse relative to 8\" sphere\n2\" 0.32\n3\" 1.18\n5\" 2.09\n8\" 1.00\n10\" 0.45\n\nd) Explain how this technique would be used to determine the neutron spectrum\nof a distributed energy source.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n22.106 Neutron Interactions and Applications\n\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT22_106S10_assn02.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/22-106-neutron-interactions-and-applications-spring-2010/ea68d7dc4d11f305a5bd6657c8e4b6b6_MIT22_106S10_assn02.pdf",
      "content": "22.106 Neutron Interactions and Applications\nProblem Set 2\n\nDue SES #8\n\nQuestion 1\n\nRANDU is an infamous multiplicative linear congruential pseudorandom number\ngenerator which has been used since the 1960s with parameters: g = 65539, m = 31, c= 0.\n\nWrite a computer program of this LCG. Plot a 1-D, 2-D and 3-D distribution of many\nrandomly selected points (with the initial seed of 1). Discuss your observations and\nexplain why RANDU is no longer used in Monte Carlo simulations. Explain your\nobservations using the spectral test (see slides 2-33 and 2-34 of reference Monte Carlo\ndocument).\n\nQuestion 2\n\nRepeat the integral of question 4 a) of problem set 1 with the new parameters provided\nbelow using both Monte Carlo integration techniques: 1) Mathematical Approach, and 2)\nSimulation Approach. Compare your results to what you obtain analytically.\n\nρ(x) = 2.2 (1 + 0.0001x), where x is in cm and ρ(x) is in g/cm3.\n\nCalculate the probability of neutrons reaching a depth of 20 meters.\n\nQuestion 3\n\nThe neutron energy spectrum of a given source is a random variable with the following\nprobability density function\n\n(\n)\n⎩\n⎨\n⎧\n<\n≤\n+\n=\notherwise\nMeV\nE\nE\nE\nE\nf\n2.1\n)\n(\n\na) What is the probability that the energy is greater than 0.5 MeV?\nb) Find the mean energy.\nc) Find the probability that the energy is within +/- 0.1 MeV of the mean.\nd) Find the standard deviation.\ne) Find the probability that the energy is within +/- 2σ of the mean.\nf) Find the cumulative distribution function of the energy.\n\nQuestion 4\n\nWrite a simple mono-energetic particle transport code that will sample source particles\nuniformly in a slab of water with width of 10 cm. Use the properties given in Table I and\nassume that the slab is surrounded by a vacuum. You can use the random number\ngenerator that comes with the programming language of your choice and assume that the\nscattering is isotropic in the laboratory system.\n\nTable I: Macroscopic x.s for Water of density 1 g/cc (cm-1)\n\nΣs\nΣa\nΣt\nWater\n1.0\n0.5\n1.5\n\nRun a simulation with 1000 particles and count the number of particles that are leaving\nthe system and the total number of particles absorbed in the water.\n\nQuestion 5\n\nThe polar angle distribution of the scattering collision with isotope X is given by the\nfollowing pdf:\n\n( )\n⎪\n⎪\n⎩\n⎪⎪\n⎨\n⎧\n≤\n≤\n-\n+\n=\nelsewhere\nfor\nf\nμ\nμ\nμ\n\na) Verify that this distribution is truly a probability distribution function.\nb) Calculate the average and variance of the polar angle\nc) Using a direct sampling approach, derive a relation that will allow stochastically\nsampling the polar angle from a uniform random variable between 0 and 1.\n\nQuestion 6\n\nCalculate the total efficiency of the neutron detection system described below for\nneutrons of 1eV, 1keV and 1 MeV:\n\n-\nIsotropic point source of 2.0 x 1012 neutrons/second\n-\nBF3 (Enriched to 96% B10) Tube detector of 2 cm of diameter and 15 cm of length\no Gas pressure of 80kPa at room temperature (293 Kelvin)\n-\nDistance between point source and detector is 40 meters.\n\nState your assumptions clearly.\n\nQuestion 7\n\nLinear table search vs Binary table search\n\nWrite a subroutine that will sample the following discrete pmf, illustrated by the\nhistogram in figure 1, using the table search method seen in class using:\n1) Linear table search\n2) Binary table search\n\nSample this pmf with both methods multiple times and compare the computational cost\n\nEach bin is equally space from -1 to 1 by 0.05 increment (41 bins in total). Histogram of the probability mass function.\nFigure by MIT OpenCourseWare.\nHist\nogra\nm of\nthe\npro\nbabi\nlity\nmas\ns\nf\nu\nncti\non.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n22.106 Neutron Interactions and Applications\n\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT22_106S10_assn03.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/22-106-neutron-interactions-and-applications-spring-2010/5d72fd940c6beac9e46b67731a3c85f7_MIT22_106S10_assn03.pdf",
      "content": "22.106 Neutron Interactions and Applications\nProblem Set 3\n\nDue SES #12\n\nQuestion 1\n\nShielding: Monte Carlo simulation\n\nProblem Description\n\nSlab 1: Source\n-\nSource of Cf-252 producing neutrons of 108 neutrons per second uniformly\ndistributed in the slab.\n-\nAssume that all neutrons are produced at 1 MeV\n-\nWidth of 1 cm\n\nSlab 2: Moderator\n-\nMaterial is borated concrete\n-\nWidth of 5 cm\n\nSlab 3: Gamma shield\n-\nMaterial is lead\n-\nWidth of 2 cm\n\nSlab 4: Person\n-\nWidth of 3 cm\n\nDensity of lead 11 g/cc\nDensity of concrete 2.5 g/cc\nDensity of the californium 15g/cc\n\nTotal cross section of lead: 4.39 b\nAbsorption cross section of lead: 0.0033 b\n(n,2n) cross section of lead: 0.09 b\nAssume lead is a pure component of Pb-208.\n\nTotal cross section of borated concrete: 3.50 b\nAbsorption cross section of borated concrete (if E > 0.1 MeV): 0.01 b\nAbsorption cross section of borated concrete (if E < 0.1 MeV): 1.5 b\nAssume that the molecular mass of concrete is 60 g/mol and is made of a single\ncomponent.\n\nTotal cross section of Californium-252: 0.1 b\nAbsorption cross section of Californium-252: 0.001 b\n\nTotal macroscopic cross section of person: 1 cm-1\nAbsorption cross section of person: 0.2 cm-1\n\nThe system is surrounded by a vacuum. Assume that the remainder of all total cross\nsections is elastic scattering and that all scattering is isotropic in the lab system.\n\nQuestions\n\n1) Using Analog Monte Carlo, compute the flux and absorption rate in the person\n(slab 4) and include the uncertainties.\n2) Compare the figure of merit if you were to use:\no Implicit Capture\no Source Biasing\no Implicit Capture and Source Biasing\n\nQuestion 2\n\nExplain in your own words the basic idea of variance reduction and discuss its\nimportance in Monte Carlo simulations.\n\nQuestion 3\n\nDescribe how the lack of information of potential V is circumvented in the R-matrix\nderivation.\n\nQuestion 4\n\nExplain in your own words the roles of experimental data and theoretical modeling in\nevaluating nuclear cross sections. Why do we need to evaluate data?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n22.106 Neutron Interactions and Applications\n\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT22_106S10_assn04.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/22-106-neutron-interactions-and-applications-spring-2010/c6f5184bd2fd8c87eb9a1c52c4ca1399_MIT22_106S10_assn04.pdf",
      "content": "22.106 Neutron Interactions and Applications\nProblem Set 4\n\nDue SES #16\n\nQuestion 1\n\nDerive the time-dependent equation system in an arbitrary volume element V that\ndescribes the transport of neutrons and photons. Assume that neutron interactions are\nlimited to neutron capture and neutron scattering and that the photon interactions are\nlimited to scattering and photoneutron reactions.\n\nExplain in your own words the meaning of all the terms.\n\nQuestion 2\n\nStarting from the one-dimensional integro-differential form of the transport equation,\nsolve for the angular flux in the following slab with a plane isotropic source at x = X/3.\nAssume vacuum boundary conditions at both boundaries of the slab.\nIsotropic plane source\nX\nx\n\nQuestion 3\n\nStarting from the one-dimensional integro-differential form of the transport equation,\nsolve for the angular flux in the previous slab with a plane source at x = X/3 isotropic\nonly in the positive direction of the polar angle (i.e. isotropic between μ of 0 and 1,\n\nsource is zero in the negative direction). Assume reflective boundary condition on the\nleft side and vacuum on the right.\n\nQuestion 4\n\nExplain conceptually what the neutron transport equation represents.\n\nQuestion 5\n\nStarting from the one-dimensional mono-energetic integro-differential form of the\ntransport equation, solve for the angular flux in slab A. A uniform isotropic source of\nstrength S0 is located in slab A and both slabs are purely absorbing. Assume vacuum\nboundary conditions on the left boundary and reflective on the right.\n\nX2\nx\nA\nB\nVacuum\nReflection\nX1\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n22.106 Neutron Interactions and Applications\n\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT22_106S10_assn05.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/22-106-neutron-interactions-and-applications-spring-2010/11125c449a3b8944673449ffe7a59166_MIT22_106S10_assn05.pdf",
      "content": "22.106 Neutron Interactions and Applications\nProblem Set 5\n\nDue SES #19\n\nQuestion 1\n\nThe theory of thermal neutron inelastic scattering involves at least three key concepts:\nBorn approximation, the Fermi pseudopotential and the dynamic structure factor.\n\na) Define each concept mathematically and physically, focusing on the\napproximations involved (how well justified?) or the information it conveys (how\nsignificant?)\nb) Explain in the case of the Born approximation and Fermi pseudopotential why\nthey are essential in developing an expression for the double differential cross\nsection.\nc) Explain the significance of the dynamic structure factor in experimental and\ntheoretical studies in thermal neutron inelastic scattering.\n\nQuestion 2\n\nDefine coherent and incoherent scattering.\n\nQuestion 3\n\nCalculate the coherent and incoherent scattering cross-sections of a neutron with\nhydrogen if the scattering lengths are:\n\na+ = 5.3 fm\n\na- = -24.0 fm\n\nQuestion 4\n\nDemonstrate that (notes 1, page 7)\n\n[\n]\n=\n+\n∇\nikz\ne\nk\n\nQuestion 5\n\nDiscuss the behavior of\nfor the low energy approximation (kd << 1) and for the\nhigh energy approximation (kd >> 1). (notes 2, page 6)\n\nQuestion 6\n\nSuggested homework on page 14 of Neutron InteractionMIT2.pdf\n\nQuestion 7\n\nA silicon crystal has Bragg edges at 0.008 eV and 0.012 eV, what information can be\nobtained from these measurements? Explain the concept of Bragg scattering.\n\nQuestion 8\n\nDerive the following relation due to chemical binding effects\n\nand show how it impacts the scattering cross-section.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n22.106 Neutron Interactions and Applications\n\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT22_106S10_assn06.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/22-106-neutron-interactions-and-applications-spring-2010/f19d266e7992205fe38b3526959582a0_MIT22_106S10_assn06.pdf",
      "content": "22.106 Neutron Interactions and Applications\nProblem Set 6\n\nDue SES #24\n\nQuestion 1\n\nSolve the steady-state mono-energetic transport equation in the infinite slab system\nillustrated in figure 1 to obtain the angular flux. Consider that all slabs are purely\nabsorbing and that the boundary conditions are vacuum on each side.\nSlab 4\n\nΔ4 = 1\nΣ4 = 1\nS4 = 0\n\nSlab 3\n\nΔ3 = 2\nΣ3 = 0.5\nS3 = 1\n\nSlab 2\n\nΔ2 = 2\nΣ2 = 1.5\nS2 = 0\n\nSlab 1\n\nΔ1 = 1\nΣ1 = 1\nS1 = 2\n\nFigure 1\n\nQuestion 2\n\na) Using the CPM method, evaluate the scalar flux in each slab illustrated in figure\n2. Assume the problem to be steady-state, mono-energetic with vacuum boundary\nconditions on each side. The following link can be used to compute the\nexponential integrals (http://keisan.casio.com/ select Special Functions / Exponential\nIntegral)\n\nSlab 1\n\nΔ1 = 1\nΣs1 = 0.5\nΣt1 = 1\nS1 = 1\nSlab 2\n\nΔ2 = 2\nΣs2 = 1.0\nSlab 3\n\nΔ3 = 2\nΣs3 = 0.2\nΣt3 = 0.5\nS3 = 4\n\nΣt2 = 1.5\nS2 = 0\n\nFigure 2\n\nb) Explain in words the meaning of P21 and state the main assumptions made in\ndefining this term.\nc) What is the probability that a neutron born isotropically and uniformly in slab 1\nwill leak out of the system without making a collision.\n\nQuestion 3\n\nStarting from the 1D steady-state integro-differential form of the transport equation with\nisotropic scattering, derive the integral form of the transport equation\n\nQuestion 4\n\na) Write the one-dimensional mono-energetic steady-state S2 equations with an\nisotropic source and scattering.\nb) Explain why odd order SN equations are avoided.\nc) Solve the S2 equations for the following purely absorbing slab with reflective\nboundary conditions and an isotropic uniform unit source.\n\nX\nx\nReflective\nReflective\nUniform and\nisotropic unit\nsource\n\nPurely\nAbsorbing\nFigure 3\n\nQuestion 5\n\nProve the equivalence of the S2 and P1 equations for a steady-state mono-energetic\nproblem with isotropic source and scattering.\n\nQuestion 6\n\nThe Chebyshev polynomials of the first kind are a set of orthogonal polynomials defined\nas the solutions to the Chebyshev differential equation and denoted Tn(μ). As they are\northogonal over the -1 to 1 range, they are suitable for expanding the angular dependence\nof the angular flux in slab geometry. These polynomials also obey the two following\nrelations:\n\n-\northogonality relation\n\n-\nrecurrence relation\n\na) Starting from the time-independent mono-energetic transport equation in a slab\nwith isotropic scattering and isotropic source, derive the set of equations obtained\nwhen expanding the angular flux in terms of Chebyshev polynomials in\naccordance with the angular flux expression below\n\n∑\ninf\n=\n+\n=\n)\n(\n)\n(\n)\n(\n)\n(\n)\n,\n(\nn\nn\nn\nT\nx\nT\nx\nx\nμ\nφ\nπ\nμ\nπ\nφ\nμ\nφ\n\nb) Discuss the preference of odd versus even orders in the TN expansion\nc) From the equations in a), derive a diffusion-like equation from the T1 equations.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n22.106 Neutron Interactions and Applications\n\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT22_106S10_pp1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/22-106-neutron-interactions-and-applications-spring-2010/03609467f3b30a32fff2b1c2b2cc3e59_MIT22_106S10_pp1.pdf",
      "content": "List of Potential Projects for 22.106 Term Paper\n-\nImportance of Inelastic Scattering in fast reactors\n-\nImage rendering simulations (shading, blurring, ...)\n-\nAnalytical or semi-analytical solutions of the Transport Equation\n-\nSuperposition/Convolution techniques for photon transport\n-\nExternal beam therapy optimization\n-\nGamma scan for determining isotopic composition in spent nuclear\nfuel\n-\nIrradiation effects in material\n-\nSmall angle neutron scattering\n-\nElectron transport\n-\nNuclear shield design for a given applications\n-\nNuclear detection simulation in cargo (active or passive systems)\n-\nSource convergence studies in Monte Carlo criticality calculations\n-\nDose deposition following nuclear interactions\n-\nUnresolved resonance treatment (probability tables)\n-\nMo-99 production by neutron activation in a reactor\n-\nControl rod degradation\n-\nPerturbation theory in detection systems\n-\nFast neutron detector design\n-\nFood sterilization\n-\nChemical tracers (production, detection, ...)\n-\nDancoff factors - Bryan Herman\n-\nCross-sections resonance treatment (sub-group methods, ...)\n-\nMethod of Characteristics\n-\nShannon entropy in Monte Carlo simulations\n-\nWielandt's method in Monte Carlo criticality calculations\n-\nSpallation physics\n-\nDeterministic importance mapping - Jeremy Roberts\n-\nQuantum Computing - Suransh Galanti\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n22.106 Neutron Interactions and Applications\n\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT22_106S10_pp2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/22-106-neutron-interactions-and-applications-spring-2010/8170f8ab6184881117fdc6c0e5c5ad24_MIT22_106S10_pp2.pdf",
      "content": "22.106 Term Papers\nGuidelines\nFont: 11-12\nMargins: Minimum of 1\" everywhere, Maximum of 1.25\" everywhere\nPages: 8-10 pages (excluding references)\nHere are a few suggested guidelines. These may not be appropriate for all projects so\nfeel free to run it by me if you have any questions about the content.\nIntroduction:\n-\nDescribe your topic and its relation to 22.106. You can also briefly discuss other\nmethodologies used to analyze similar problems.\nMethodology\n-\nDescribe the methodology and the theory behind your topic and its solution. Do\nnot spend excessive time, effort and space describing concepts already covered in\nthe class.\n-\nExplain how the problem is solved\nResults\n-\nDescribe how you will test the proposed methodology\n-\nShow some results and discuss their significance\nConclusion\n-\nExplain the importance and significance of your project\n-\nOffer a critical view of the methodology employed\n-\nSuggest ways to improve\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n22.106 Neutron Interactions and Applications\n\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "MIT22_106S10_lec01.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/22-106-neutron-interactions-and-applications-spring-2010/5077c956fe7dd194a35a43a7b7470466_MIT22_106S10_lec01.pdf",
      "content": "Lecture 1\nNeutron Fundamentals\nMicroscopic Interactions\n22.106 Neutron Interactions and Applications\nSpring 2010\n\nObjectives\n- Basic Neutron Properties\n- Concept of Microscopic x.s.\n- Brief review of Neutron Interactions\n- Energy dependence of neutrons\n- Neutron - nucleus interactions\n- Neutron sources\n\nNeutron\n- Discovered by James Chadwick in 1932\n- No electric charge\n- Mass of 1.008664915 amu (slightly more than\na proton)\n- Spin of 1⁄2\n- Its existence explained the atomic model\nand the cohesion of the nucleus. The\nstrong nuclear forces are able to keep the\nprotons from repulsion.\n\n- Bound neutrons (i.e. in the nucleus) are stable\n- Free neutrons are unstable\n- They are produced by:\n- Fission\n- Fusion\n- Photoneutrons\n- Alpha sources (PuBe, AmBe, AmLi)\n- Decays by beta emission\n- Half life of 885.7s (roughly 15 min)\n- Bounded nucleus may also use beta decay if unstable\n- This is the case for the fission products who are neutron rich.\nSuccessive beta decay brings them closer to stability.\n\nStability of fission products\n- Neutron rich\nfission products\nbeta decay\ntowards stability\nImage removed due to copyright restrictions.\n\n- Neutron interacts with materials for different purposes or\nconsequences:\n- Detection\n- Based on the interaction of neutrons with other materials\n- Shielding\n- Neutron absorption or reflection prevents neutrons from escaping\n- Inducing fission\n- Active detection systems\n- Ionization chambers\n- Structural displacement\n- Material damage by creating defects in lattice\n- Material assay\n- Neutron Diffraction\n- Small Angle Neutron Scattering\n\nMicroscopic x.s.\n- Probability of a particular event occurring between a\nneutron and a nucleus is expressed through the concept\nof a cross-section.\n- Consider a beam of mono-energetic neutrons of intensity\nI (neutrons/cm2.s) incident on a very thin sample material\nsuch that there are NA atom per cm2\nFigure showin\ng that the probabili\nty of a neutron-nuclear reaction is characterized by the nuclear microscopic cross section.\nImage by MIT OpenCourseWare.\n\nProbability of a neutron-\nnuclear reaction is\ncharacterized by the\nnuclear microscopic\ncross section.\n\nA\nR\nI\nN\nσ\n=\n#\ncm\n⎡\n⎤\n⎢\n⎥\n⎣\n⎦\n#\ncm s\n⎡\n⎤\n⎢\n⎥\n⎣\n⎦\ncm\n⎡\n⎤\n⎣\n⎦\n#\ncm s\n⎡\n⎤\n⎢\n⎥\n⎣\n⎦\nMicroscopic Cross section\nFigure showin\ng that the probabili\nty of a neutron-nuclear reaction is characterized by the nuclear microscopic cross section.\nImage by MIT OpenCourseWare.\n\n- Cross-sections are strongly dependent of\nneutron incoming energy. This relation is\nimportant in the understanding of x.s. but also to\nestimate the time a neutron spends in a\nparticular region.\n- Classical expression for K.E. is sufficiently accurate\nbecause rest mass of a neutron is fairly large (939.55\nMeV)\nE = 1⁄2 mv2\nE = 5.227 x 10-15 v2\nor\nv = 1.383 x 107 E1/2\n\nExamples\n- 1 MeV neutron has a speed of\n- 1.383 x 107 m/s\n- Will cross a 15 cm sample in 11 nanoseconds\n- 0.025 eV neutron has a speed of\n- 2187 m/s\n- Will cross a 15 cm sample in 70 microseconds\n- Conclusion: When studying neutron\ndistributions, the energy levels involved and the\nsize of the systems usually make it possible to\nneglect the beta decay of the free neutron.\n\nTypes of Interactions\n- Two major types\n- Scattering: Speed and Direction change but\nnucleus is left with same number of neutrons\nand protons\n- Absorption: Original neutron disappears within\nthe nucleus\n\nElastic Scattering (n,n)\n- One of the most difficult neutron interactions to\nmeasure and the most complicated to analyze\ntheoretically.\n- It is also one of the most important reactions in\nreactors, characterization devices, ...\n- Elastic Scattering requires to consider the\ndouble differential cross section which describes\nthe angular distribution and the energy\ndistribution as well as the total elastic cross-\nsection.\n\nInelastic Scattering (n,n')\n- Plays a key role in neutron slowing down a\nhigh energies\n- Requires a threshold energy to excite the\nnucleus to a quantum state\n- The neutron can thus lose a considerable\namount of energy in one collision since most\nof it is used to bring the nucleus to this\nquantum state\n\nRadiative Capture (n,γ)\n- Neutron combines with target of mass A to\nproduce nucleus of mass A+1 in a quantum\nstate. The excitation of this state is equal to\nthe sum of the neutron binding energy and the\nkinetic of the neutron.\n- Energy is released in one or more gamma rays\n- This reaction is very important in the\nproduction of radioactive medical isotopes.\n(\n)\n*\nA\nA\nA\nZ\nZ\nZ\nn\nX\nX\nX\nγ\n+\n+\n+\n→\n→\n+\n\nCobalt-60\n- Production of\nradioactive medical\nisotopes\n- Sterilization\n- Medical Equipment\n- Food\n- Blood\n- Chemical tracer\nFigure\nshowing r\nadioactive\nisotopes.\nImage by MIT OpenCourseWare.\n\nTechnitium-99m\n- Technetium-99m is used in 20 million diagnostic nuclear\nmedical procedures every year.\n- It is a gamma ray emitting isotope used as a radioactive\ntracer that medical equipment can detect in the body. It\nis well suited to the role because it emits readily\ndetectable 140 keV gamma rays (about the same\nwavelength emitted by conventional X-ray diagnostic\nequipment), and its half-life for gamma emission is 6.01\nhours. The short half life of the isotope allows for\nscanning procedures which collect data rapidly, but keep\ntotal patient radiation exposure low.\n- Molybdenum-99 is produced mainly by fission of HEU\n- Decays to Tc-99m (half-life of 66hrs)\n- Tc-99m is chemically extracted from Mo-99 fairly easily\n\n(n,2n), (n,3n), ...\n- Two step process\n- Incident neutron is inelastically scattered by a\ntarget nucleus (threshold reaction)\n- If residual energy is left with excitation energy\nabove binding energy of last neutron, the\nneutron is free to escape\n- (n,2n) threshold usually is 7-10 MeV\n- 1.8 MeV for Be\n- (n,3n) threshold usually is 11-30 MeV\n\n(n,2n), (n,3n) for U-238\nGra\nph\nshow\ning\ncro\nss-section versus\nenergy - (n,2n), (n,3n) for U-238.\nImage by MIT OpenCourseWare.\n\nCharged particles (n,p), (n,α)\n- Usually requires lots of energy to happen with\none notable exception\n- 10B (n,α) 7Li: very high x.s. at low energy which is why\n10B is used as a thermal absorber\n- Very small x.s. in heavy nucleis, because\nemitted charge particle must overcome Coulomb\nbarrier in order to escape nucleus\n- Delay is so long that compound nucleus (CN) will\nscatter (elastic or inelastic) instead.\n\nFission Reaction (n,f)\n- Activation energy required to induce fission. Energy\nnot available in ground state of 236U but it is supplied\nin the form of the neutron binding energy in (236U)*\n- Fission usually provides two fission products (FP)\n- Scission in 3 or more FPs is possible but very rare\n- 1/400 scission in 3 FPs\n- 1/3000 scission in 4 FPs\n- Releases roughly 200MeV of energy and ν neutrons\n(typically 2-3).\nA\nA\nA\nZ\nZ\nZ\nn\nX\nX\nX\nneutrons\nMeV\n+\n→\n+\n+\n+\n\nEnergy Dependence of x.s.\n- General Rule: x.s. decreases with increasing\nenergy of incoming neutron\n- At low energies (<1 MeV), (n,n) is nearly\nconstant whereas (n,γ) is proportional to \"1/v\"\n- In the keV range, resonances are superimposed\non the \"1/v\" trend, these resonances are formed\nwhen neutron energy + binding energy\ncorrespond to an excitation level of the nucleus.\n\n- Heavy Nucleus\n- eV range: resonances appear\n- keV range: resonances are too close to be\ndistinguished\n- MeV range: resonances are broader and\nsmall, x.s. becomes smooth and rolling.\n\n- Light Nucleus\n- Resonances appear only in MeV range. They\nare broad and small\n- Exceptions\n- 1H and 2H have no resonances at all (no excitation\nlevel in the nucleus)\n- Nuclides with \"magic number\" of protons and\nneutrons may behave more like light nuclei\n\nC-12 total x.s.\nGra\nph\nshow\ning\ncros\ns-se\nctio\nn ve\nrsus\nene\nrgy\n(C-1\n2 t\nota\nl x.s.)\nImage by MIT OpenCourseWare.\n\n- Neutrons are produced with varying energy\ndepending on the source.\n- Fission produces 2-3 neutrons/fission\n- Large fraction is prompt (10-13 seconds)\n- Small fraction is delayed (decay of FPs)\n1.036\n( )\n0.453\nsinh\n2.29\nE\nE\ne\nE\nχ\n-\n=\nGraph s\nh\no\nw\ni\nn\ng var\ny\ning\nen\nerg\ny o\nf neutrons depending on the source.\nImage by MIT OpenCourseWare.\n\n- Spontaneous Fission from Cf252\nS\np\no\nn\nt\nane\nous\nFi\nssion from Cf252.\nImage by MIT OpenCourseWare.\n\n- Alpha Neutron Source\nG\nr\na\np\nh\n\nt\nr\na\nck\ning the measured ene\nrgy spectra for neutrons.\nImage by MIT OpenCourseWare.\n\n- Spallation Neutron Source\n- High energy proton bombard a heavy target and\ncreates spallation particles\n1)Negative hydrogen ions (1 proton and 2 electrons) are\ngenerated in pulses\n2)Accelerated to 1GeV (almost 90% of speed of light)\nby a linear accelerator\n3)Electrons are stripped and protons are concentrated\nin a 2MW beam\n4)Directed at liquid Mercury\n- Liquid at room temperature\n- Absorbs rapidly changes in temperature and can survive\nintense bombardment shock\n- Ejects 20-30 neutrons per collision (avg energy of 20-25\nMeV)\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n22.106 Neutron Interactions and Applications\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "MIT22_106S10_lec02.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/22-106-neutron-interactions-and-applications-spring-2010/57d5eac43f175adf73ced632e5207025_MIT22_106S10_lec02.pdf",
      "content": "Lecture 2\nMacroscopic Interactions\n22.106 Neutron Interactions and Applications\nSpring 2010\n\nObjectives\n- Macroscopic Interactions\n- Atom Density\n- Mean Free Path\n- Moderation in Bulk Matter\n- Neutron Shielding\n- Effective Dose Equivalent\n\nMacroscopic interactions\n- Suppose a target of thickness X is placed\nin a monodirectional beam of intensity I0\nand that a neutron detector is placed at\nsome distance behind the target. It is also\nassumed that the target and the detector\nare small so that the detector only detects\nthe neutrons that do not interact.\n\n- Let I(x) be the intensity of the non\ninteracted neutrons after penetrating the\ndistance x into the target.\n- In traversing an additional distance dx, the\nintensity of the beam will be decreased by\nthe number of neutron that have interacted\nin dx. This decrease in intensity will be\ngiven by:\n- dI(x) = NσtI(x)dx\nwhere N is the atom density in the target (at/cc)\n\n- Integrating the previous equation from 0 to\nx, we get\nI(x) = I0 exp(-Nσtx)\n- We define the macroscopic x.s. has\nΣ = Nσ\nunits of Σ are cm-1\n- Thus\n-dI(x) = ΣtI(x)dx or -dI(x)/I(x) = Σtdx\n\n- -dI(x)/I(x) in the previous equation is equal to the\nfraction of the neutrons that have penetrated the\ndistance x into the target without interacting,\nwhich subsequently interact in the distance dx\n- Equivalent to the probability that a neutron which\nsurvives up to x and interacts in the next dx\n- Thus Σtdx is the probability that a neutron interacts in\ndx\n- It follows that Σt is the probability per unit path length\nthat a neutron will undergo an interaction\n- I(x)/I0 = exp(-Σtx) is equal to the probability that a\nneutron can move through this distance without\ninteracting.\n\n- Let the quantity p(x)dx be the probability\nthat a neutron will have its first interaction\nin dx in the neighborhood of x.\np(x)dx = exp(-Σtx) .Σtdx\nFirst interaction probability distribution function\n- Examples\n- Calculate first interaction probability between\nx = a and x = b\n- Calculate probability of not interacting in slab\n\n- Macroscopic interactions are the simplest\nway to evaluate gamma ray attenuation\n- Low energy gamma's are more likely to be\nabsorbed\n- Neutrons on the other hand are more likely to\nscatter, which interferes with the\nmeasurements.\n- If the target is a compound, the total\nmacroscopic x.s. is the sum of the\nindividual elements macroscopic x.s.\nΣt = Σ1 + Σ2 + ...\n\nAtom Density\n- The atom density of each element i is\ngiven by:\nNi = ρ Na ni / Mm\nwhere\nρ = density of compound (g/cc)\nMm = molecular mass (g/mol)\nNa = Avogadro number\nni = number of atoms of element i\nin one molecule\n\n- Σ = ρ Na (n1σ1 + n2σ2 + ...) / Mm\n- Example of Natural Uranium\n\nMean Free Path\n- The distance that a neutron moves between\ninteractions is called a free path, and the\naverage distance is known as the mean free\npath.\n- Integral of xp(x)dx between 0 and infinity\n\nSignificance\n- If the mean free path of neutrons emitted by a sample in\na passive assay instrument is long compared to the\ndimensions of the sample, it is likely that most neutrons\nwill escape the sample and enter the detection region.\n- If we know the number of collisions to thermalize, we can\nestimate the needed moderator thickness (must also\nconsider the scattering angle)\n- If the thickness of a shield is many times the mean free\npath of a neutron trying to penetrate the shield, then the\nshield fulfills its purpose (complicated by the energy\ndependance of the x.s.)\n\nObjectives\n- Neutron Moderation\n- Shielding\n- Dose\n\nModeration in Bulk Matter\n- Moderation is often times needed for\n- Neutron detection\n- Thermal reactors\n- Neutron diffraction\n- Small angle neutron scattering (SANS)\n- Purpose:\n- Increase the probability of interaction in \"1/v\" region\n- Or, produce neutrons with low energy for condensed\nmatter studies\n\nSlowing Down\n- Neutrons are slowed down by collisions in\nthe manner of a random walk\n- Since fast neutrons have much more\nenergy than the molecules they are\ncolliding with, the neutrons will lose energy\n- Extent of slowing down depends on\n- Temperature of medium\n- Size, shape and nature of moderation\nmedium\n\nMine Detection\n- Neutron sources and neutron moderation\nare used to detect land mines\n- Cf252 source\n- Spontaneous fission with spectrum in slides of\nLecture 1\n- Explosives\n- Organic compounds with lots of Carbon and\nHydrogen\n\nMine Detection\nF\ni\ng\nu\nr\ne\n\ns\nhowing an experimental arrangement to simulate mine detection.\nImage by MIT OpenCourseWare.\n\nMine Detection\n- Fast neutrons enter soil\n- If there is no explosive they scatter in sand, soil,\n...\n- Not really good moderators\n- If a plastic explosive is found\n- Neutrons scatter off hydrogen and carbon\n- Lower energy neutrons are reflected and detected on\nthe surface\n- Potential issues\n- Wet soil, requires very fine calibration\n\nModerating Power\n- Compares ability of materials to moderate\nneutrons\n- Two important factors to consider\n- Probability of scattering interaction\n- Average change in kinetic energy of the\nneutron after scattering\n- Define as\nξΣs\nξ: average logarithmic energy decrement\nΣs: scattering macroscopic x.s.\n\nAverage Log Energy Decrement\n- ξ = ln (E0/E1)\n- Assuming isotropic elastic scattering only, we\ncan find the following expression\nFigure illustr\nating Elastic\nScreeni\nng.\nE\nq\nu\na\nti\no\nn\ns\n\nf\no\nr\n\nA\nv\ne\nr\na\ng\ne\n\nL\no\ng\nE\nn\ner\ng\ny\nD\ne\nc\nr\ne\nm\ne\nn\nt\ns.\nImages by MIT OpenCourseWare.\n\nNumber of collisions\n- If we lose ξ at every collision, we can\napproximate the average number of\ncollisions it takes to go from E0 to En\nwhich yields\nDerivation: See PDF on Neutron Moderation on stellar\nEquations for average number of collisions.\nEquati\nons fo\nr average number of collisions.\nImage by MIT OpenCourseWare.\nImage by MIT OpenCourseWare.\n\nModerating Ratio\n- A material with a large moderating power might\nstill not be practical if it has a large absorption\nx.s.\n- Moderating ratio helps in selecting a good\nmoderator: ξΣs / Σa\nTable\nlisting va\nlues of Moderati\nng Power and Mod\ner\natin\ng Ra\ntio.\nImage by MIT OpenCourseWare.\n\nShielding Objectives\n- Limit radiation exposure of staff, patients,\nvisitors and the public to acceptable levels\n- Optimize protection of patients, staff and\nthe public\n- Protect electronics (i.e. computer chips,\ntransistors, ...) in satellites or other\ninstruments\n- Reduce background counts in detectors\n\nConsiderations\n- Source characterization\n- Particle type\n- Energy\n- Rate of emission\n- Direction of the source\n- Utilization factor\n- Geometry of the room\n- Shielding is a 3-D problem\n- Location\n- 10th floor vs basement\n- Requirements\n- Size, cost, weight, ...\nImages removed due to copyright restrictions.\n\n- Must consider\n- Primary beam\n- Scattered beams\n- Leakage from\nsource\nImage by MIT OpenCourseWare.Figure illustrating primary beam, scattered beams and leakage from source.\n\nGamma Shielding\n- Low energy gamma\n- Lead\n- High energy gamma\n- Concrete (high density)\n- Cost plays a major role in the decision\n- Lead is much more expensive than concrete!\n- Very little scattering present\n\nNeutron shielding\n- Much more scattering than neutrons\n- Attenuation depends very strongly on\nneutron energy\n- Shielding designs require multiple layers\n- Premoderator\n- Moderator\n- Gamma shield\nFigure illus\ntrating t\nhat Shielding designs require multiple layers: Premoderator, Moderator, Gamma shield.\nImage by MIT OpenCourseWare.\n\nTypical Materials - Premoderator\n- Scatter the high energy neutrons to facilitate\nefficient of other two layers\n- Iron\n- Low activation, high Z number\n- Corrodes\n- Tungsten\n- Dense, high Z number\n- Expensive\n- Lead\n- Low activation, high Z number\n- Toxic\nImages removed due to copyright restrictions.\n\nTypical Materials - Moderator\n-\nAbsorbs and slows neutrons down\n-\nConcrete\n-\nCheap\n-\nLoses water (i.e. hydrogen) at high\ntemperatures, H creates 2.2 MeV gamma\n-\nBorated concrete\n-\nIncrease absorption\n-\nBoron depletes over time\n-\nWater\n-\nGood absorption\n-\nNo structural integrity, H creates 2.2 MeV\ngamma\n-\nPolyethylene\n-\nLightweight, good absorption\n-\nH creates 2.2 MeV gamma, C creates 4.4\nMeV gamma\nImage removed due to copyright restrictions.\n\nTypical Materials - Gamma Shield\n- Lead\n- Excellent gamma absorption\n- Toxic\n- Depleted uranium\n- Very high Z number\n- expensive\n\n- Thermal neutrons can be\neasily shielded by Boron\nor Cadmium as they have\nlarge neutron cross\nsections in the thermal\nregion\n- Cd has the disadvantage of\nemitting high energy\ngamma's after neutron\ncapture which requires\nadditional gamma shielding\n- High speed neutrons are\nmore difficult to shield\nagainst, because\nabsorption x.s. are\nsmaller in that range.\n- Thus it is first necessary to\nmoderate the neutrons\nGra\nph\nill\nust\nrat\ning\nthe\nshi\neldi\nng o\nf ne\nutro\nns.\nImage by MIT OpenCourseWare.\n\nGeometry - Maze\nFigure showing radiation along maze geometry.\nImage by MIT OpenCourseWare.\n\nActivation\n- Neutrons tend to activate shield material\nwhich can create disposition problems and\ncan also contribute to dose to environment\n- Must carefully select materials with low\nactivation and short-lived decay\n\n- Effective radiation shields consist of\ncombinations of materials\n- Low A materials to moderate\n- Thermal neutron absorbers\n- High Z materials to absorb gamma's\n- Examples\n- Polyethylene - lead\n- Concrete - Iron\n- Lithium hydride\n- Choice of material depends on sample to\nshield, cost, space, weight restrictions, ...\n\nPb-208\nH-1\nRad\niat\nion\ngr\naph\ns o\nf Pb\n-208\n.\nRadi\natio\nn gr\naphs\nof\nH-1.\nImage by MIT OpenCourseWare.\nImage by MIT OpenCourseWare.\n\nEffective Dose Equivalent\n- The energy absorbed from any type of\nradiation per unit mass of the absorber is\ndefined as the absorbed dose\n- Historical unit is the rad = 100 ergs/gram (1\nerg = 10-7 J)\n- SI unit is the Gray (Gy) = 1J/gram (1 Gy = 100\nrad)\n\n- Since neutron and gamma's are relatively\npenetrating radiations, the dose equivalent\nis easier to estimate from fluence\n- Dose equivalent (H) = Dose (D) x Quality (Q)\n- Quality factor is a function of the type of radiation\n- If D is in rad, H is in rem\n- If D is in Gy, H is in Sievert (Sv)\n- Fluence is given by Φ\n- Integral of the flux over time of exposure\n\n- In air, since there is almost no attenuation, we\ncan estimate fluence to be\nΦ = N / 4πd2\nwhere d is the distance from the source and N the total\nintegrated number of neutrons\n- Conversion from fluence-to-dose must take into\naccount\n- Secondary particle production\n- Kinetic energy of these particles\n- Quality factor of particle type\n- Fast electrons Q = 1\n- Gamma's Q = 1\n- Alpha Q = 20\n- Neutrons Q = 5-20 (depends on energy level)\n\n- Conversion will also depend on specific target\n- Tissues and organs\n- Orientation\n- Self-shielding\n- Attenuation\n- Effective dose equivalent is correlated to the flux\nHE = hEΦ\nwhere hE is the fluence-to-dose factor and is evaluated for\ndifferent models using photon-neutron-electron transport\ncalculations\n\nConversion factor\nNeutrons\nPhotons\nEnergy\nCharts\nfor Neu\ntrons.\nEnergy\nCharts\nfor Pro\ntons.\nImages by MIT OpenCourseWare.\n\n- Estimation of the effects of a given\nexposure to ionizing radiation is by its\nnature an inexact science.\n- Biological effects are not absolute physical\nquantities that can be measured with high\nprecision.\n- Effective dose calculations provide\nguidance in approximating the potential\neffects of a given exposure to radiation.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n22.106 Neutron Interactions and Applications\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "MIT22_106S10_lec03.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/22-106-neutron-interactions-and-applications-spring-2010/776e8cba009578c160830b6f669d11da_MIT22_106S10_lec03.pdf",
      "content": "Lecture 3\nNuclear Data\n22.106 Neutron Interactions and Applications\nSpring 2010\n\nCommon Misconceptions\n- It's just a \"bunch\" of numbers\n- Just give me the right value and stop\nchanging it.\n\nTraditional evaluation method\nFlow char\nt showin\ng\ntraditional\neva\nluation me\nthod: expe\nr\nimental\ndata and\nmodel parame\nters\nleading to e\nvalua\ntion.\nImage by MIT OpenCourseware.\n\nTheoretical model\n- Computer code SAMMY\n- Used for analysis of neutron and charged particle cross-section\ndata\n- Uses Bayes method to find parameter values\n- Generalized least squares\n- Uses R-matrix theory to tie experimental data to theoretical\nmodels\n- Reich-Moore approximation\n- Breit-Wigner theory\n- Treats most types of energy-differential cross sections\n- Treats energy and angle differential distributions of scattering\n- Fits integral data\n- Generates covariance and sensitivity parameters for resolved\nand unresolved resonance region\n\nThree energy regions\n- Resolved resonance range\n- Experimental resolution is smaller than the\nwidth of the resonances; resonances can be\ndistinguished. Cross-section representation\ncan be made by resonance parameters\n- R-matrix theory provides for the general\nformalism that are used\n\n- Unresolved energy range\n- Cross-section fluctuations still exist but experimental\nresolution is not enough to distinguish multiplets.\nCross-section representation is made by average\nresonance parameters\n- Formalism\n- Statistical models e.g. Hauser-Feshbach model combined\nwith optical model\n- level density models, ....\n- Probability tables\n\nEquations describing the unresolved\nresonance range.\nImage by MIT OpenCourseWare.\n\nImage by MIT OpenCourseWare.\n\nDescription of the probabili\nty table method.\nImage by MIT OpenCourseWare.\n\nDescription of the mathematical theory of the proba\nbi l\ni\nt\ny\nt\na ble method.\nImage by MIT OpenCourseWare.\n\nMonte Carlo algorithms for generating tables.\nImage by MIT OpenCourseWare.\n\n- High energy region\n- No cross-section fluctuations exist. Cross-\nsections are represented by smooth curves.\n- Formalism\n- Statistical models e.g. Hauser-Feshbach\n- Intra-nuclear cascade model\n- Pre-equilibirum model\n- Evaporation model\n\nHierarchy of\ncross sections.\nImage by MIT OpenCourseWare.\n\nORELA\n-\nHigh flux (1014 n/s)\n-\nExcellent Resolution (Δt = 2-30\nns)\n- faciliates better evaluations\n-\n\"White\" neutron spectrum from\n0.01eV to 80 MeV\n- Reduces systematic\nuncertainties\n-\nMeasurement systems and\nbackground well understood\n- Very accurate data\n-\nSimultaneous measurements in\ndifferent beams lines\n-\nMeasurements performed on\nover 180 isotopes\nFigures removed due to copyright restrictions.\n\nORELA Target\n- High energy electrons\nhitting a tantalum\ntarget produce\nbremsstrahlung\n(photon) spectrum.\nNeutrons are\ngenerated by\nphotonuclear\nreactions, Ta(gamma,\nn), Ta(gamma, 2n), ...\nFigure removed due to copyright restrictions.\n\nBayesian Inference\n- Bayesian inference is statistical inference\nin which evidence or observations are\nused to update or to newly infer what is\nknown about underlying parameters or\nhypotheses.\n\nCost of evaluations\nTable comparing the cost of evalu\nations.\nImage by MIT OpenCourseWare.\n\nCovariance Matrix\n- The covariance matrix or dispersion matrix\nis a matrix of covariances between\nelements of a random vector. It is the\nnatural generalization to higher\ndimensions of the concept of the variance\nof a scalar-valued random variable.\nEquations for covariance matrix.\nImage by MIT OpenCourseWare.\n\n- Each type of data comes from a separate\nmeasurement\n- Cross-sections are measured independently\n- However, the various types are highly interrelated\n- Data include measurement-related effects\n- Finite temperature\n- Finite size of samples\n- Finite resolution\n- ...\n- Measured data may look very different from the\nunderlying true cross-section\n- Think Doppler broadening\n\nAdvantages of evaluated data\n- Incorporate theoretical understanding\n- Cross-section shapes\n- Relationships between cross-sections for different\nreactions\n- Incorporate all available experimental data and\nall available uncertainty\n- Allow extrapolation\n- Different temperatures\n- Different energies\n- Different reactions\n\n- Generate artificial \"experimental\" points\nfrom ENDF resonance parameters\n- Include Doppler and resolution broadening\n- Make reasonable assumptions regarding\nexperimental uncertainties\n- Statistical (diagonal terms)\n- Systematic (off-diagonal terms)\n- Normalization, background, broadening, ...\n\n- Run models with varying resonance\nparameters with an assumed distribution\n- Include systematic uncertainties for\nmeasurement-related quantities\n- Perform simultaneous fit to all data\n- All experimental uncertainty is thus\npropagated\n\nComputational cost\n- Large cases require special care\n- U-235 has ~3000 resonances\n- 5 parameters for each resonance need to be\nvaried\n- Very time consuming\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n22.106 Neutron Interactions and Applications\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "MIT22_106S10_lec04a.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/22-106-neutron-interactions-and-applications-spring-2010/bfbef7e7386e7f01808355a7ecd8d8b5_MIT22_106S10_lec04a.pdf",
      "content": "Resonance Theory\n\nBasics\n- Deals with the description of nucleus-\nnucleus interaction and aims at the\nprediction of the experimental structure of\ncross-sections\n- Interaction model which treats the nucleus\nas a black box\n- Potential is unknown so models cannot\npredict accurately\n- Only care at what can be observed before\nand after a collision\n\nR-matrix theory\n- Introduced by Wigner and Eisenbud (1947)\n- Requires no information about internal structure\nof the nucleus\n- It is mathematically rigorous\n- Usually approximated\n- Most physical and appropriate of resonance\nframework\n- Cross-sections are parametrized in terms of\n- Interaction radii & boundary condition\n- Resonance energy & widths\n- Quantum number (angular momentum, spin, ...)\n\nWhy bother?\n- Couldn't we just use the measured data?\n- Too much information, too little understanding\n- x.s. vs energy would requires 100,000's of\nexperimental points\n- Angular distributions would require even more\n- Need for extrapolation\n- Different energies\n- Temperature changes\n- Geometry considerations (self-shielding, ...)\n- Unstable or rare nuclides\n\nR-matrix theory Assumptions\n- Applicability of non-relativistic quantum mechanics\n- Unimportance of processes where more than two\nproduct nuclei are formed\n- Unimportance of all processes of creation or destruction\n- Existence of a finite radial distance beyond which no\nnuclear interaction occurs\n- Based on the notion that we can describe accurately\nwhat's far enough from the compound nucleus but not\nwhat's inside\n\nDefinition\n- R-matrix is called a channel-channel matrix\n- Channel\n- Designates a possible pair of nucleus and particle\nand the spin of the pair\n- Incoming channel (c)\n- Outgoing channel (c')\n- Defined by pair of particles, mass, charge, spin\n- Many possible channels exist\n\n- Incoming channel (c)\n- We can control the incoming channel by the\nway we set up the experiment\n- Neutron energy\n- Target\n- Outgoing channel (c')\n- We can observe the outgoing channel with\nprecise measurement\n\nTotal spin of the channel\n\nCross-section\n- In 22.101, you used the phase shift theory\nto determine an expression for the\nscattering cross-section\n- This expression can be defined in terms of the\ncollision matrix U\n- Different relations between x.s and U exist for\nother interaction type\n\nGoal of R-matrix\n- Phase shift theory requires knowledge of the\npotential V(r)\n- Approximated by square well\n- R-matrix theory builds a relationship between a\nmatrix R that depends only on observable,\nmeasurable quantities and the collision matrix\n- Bypasses the need for the potential\n- Requires experimental data\n- We will derive a simplistic case of a neutron\ninteraction with no spin dependence\n\nR-Matrix Derivation\n- Start with the steady-state Schrodinger\nequation with a complex potential\n- Eigenvalue problem\n- The wavefunction is expressed in the form\nof partial waves\n\n- In radial geometry, the moment is a\nsolution of the following equation\n(1)\n- Additionally, the moment can be\nrepresented by an expansion in terms of\nthe eigenvectors of the solution\n- Eigenvectors are also solutions of the above\nequation\n\n- Eigenvectors are also a solution of:\n(2)\n- Boundary conditions\n- Both equations must be finite at r = 0\n- Logarithmic derivative at nuclear surface is\ntaken to be constant (where Bl is real)\n\n- The eigenvectors form a basis set, if\nnormalized properly, they have the\nfollowing property:\n- They form an orthonormal basis set\n- From this condition, the expansion\ncoefficients can be defined as:\n\n- Our goal is to eliminate the potential V(r)\n- Multiply eq (1) by the eigenvector and multiply\neq (2) by the moment\n- Subtract resulting equations\n- Integrate between 0 and a\n- Result: Gives an expression for\n- Which can be used to find the expansion\ncoefficients\n\n- We can now find an expression for the\nmoment at r = a\n- Where we can extract a definition of the R-\nmatrix\n- Or more commonly\n\n- γλl is the reduced width amplitude for level λ\nand angular momentum l\n- λ is the resonance\n- Eλ is the energy at the resonance peak\n- γλl's and Eλ's are unknown parameters and\ncan be evaluated by observing measured\ncross-sections\n- Eλ is the energy value at the peak\n- γλl is a measure of the width of the resonance at a certain\namplitude for the nuclei at rest\n- Related to the more common Γ through a matrix transform\n- Not easy to measure because of temperature effects (Doppler)\n- Usually inferred from the resonance integral\n\nGeneral Form\n\nAdvantages/Disadvatages of\nR-matrix theory\n- Disadvantages\n- Matrix inversion is always required\n- Channel radii and boundary condition appear arbitrary\n- Difficult to accommodate direct reactions (i.e.\npotential scattering)\n- Advantages\n- Channel radii and boundary condition have natural\ndefinitions which makes them appealing\n- Reduced width concept has an appealing relation to\nnuclear spectroscopy\n\nBoundary conditon\n- In the early days, there was much confusion in the\nchoice of channel radii and boundary condition\n- This topic has been debated heavily over the last 40 years!\n- Early papers described their choice as arbitrary\n- Optical model has facilitated the choice of these parameters\n- \"Natural\" choices exist\n- Described in more details in pdf R-matrix theory (2)\n- Bl must be kept real to preserve the nature of the eigenvalue\nproblem\n- Choice of boundary condition is to set it equal to the shift\nfunction at some point in the energy interval of measurement.\n- Keep only real part of the logarithmic derivative of the outgoing\nwave\n- Matching radii usually selected based on square-well interaction\n\nRelation with collision matrix\n- We found an expression for the solution of the\nwavefunction that doesn't depend on the\npotential\n- Depends on R-matrix\n- R-matrix depends on experimentally measured data\n- Total wave function in region outside nuclear\npotential interaction can be expressed as a\nlinear combination of the incoming and outgoing\nwaves\n\n- From R-matrix analysis, we found\n- We can then find that\n\n- Defining\n- We get\n\nGeneral form\n- No approximation has been made\n- Exact representation between U and R\n\nLevel matrix\n- The R-matrix is fairly small but fairly\ncomplex to built\n- Wigner introduced a clearer representation\ncalled the A-matrix whose elements\ncorrespond to energy levels\n- A is much larger\n- But its parameters are clearly defined\n- Summation is over incoming channels\n\nA-matrix\n- Very large\n- Corresponds to the total number of\nresonances\n- Symmetric matrix\n- Diagonal terms depend on each level\nindependently\n- Off-diagonal terms are mixed terms that\nintroduce the influence of different levels on\neach other\n\nMulti-level Breit Wigner\n- Neglecting off-diagonal terms yields the\nBreit Wigner approximation\n- Analyzing a single level at a time yields the\nSingle level Breit Wigner (SLBW)\napproximation\n- Works well if resonances are well spaced\n- Originally developed by Wigner based on an\nanalogy to the dispersion of light\n- In some cases, off-diagonal terms matter\n\nReich Moore Formalism\n- Current method of choice\n- Keeps most off-diagonal terms\n- Neglects impact of gamma channels\n- Measurements have shown that fluctuations\nbetween gamma channels at different levels must\nbe small\n\n- MLBW is more restrictive than Reich\nMoore\n- Poor treatment of multi-channel effects\n- SLBW is more restrictive than MLBW\n- Can give negative cross-section values\n\nReich Moore vs SLBW\n(U235 fission)\n- Solid line : SLBW\n- Dotted line : RM\n\nFe-56: RM, MLBW, SLBW\n- Solid line: RM\n- Dashed line: MLBW\n- Dotted line: SLBW\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n22.106 Neutron Interactions and Applications\nSpring 2010\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "MIT22_106S10_lec04b.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/22-106-neutron-interactions-and-applications-spring-2010/4944e2a2886c454bf64abd1b52909f76_MIT22_106S10_lec04b.pdf",
      "content": "Brief Review of the R-Matrix Theory\nL. C. Leal\nIntroduction\nResonance theory deals with the description of the nucleon-nucleus interaction and aims at\nthe prediction of the experimental structure of cross sections. Resonance theory is basically an\ninteraction model which treats the nucleus as a black box, whereas nuclear models are concerned\nwith the description of the nuclear properties based on models of the nuclear forces (nuclear\npotential). Any theoretical method of calculating the neutron-nucleus interactions or nuclear\nproperties cannot fully describe the nuclear effects inside the nucleus because of the complexity of\nthe nucleus and because the nuclear forces, acting within the nucleus, are not known in detail.\nQuantities related to internal properties of the nucleus are taken, in this theory, as parameters which\ncan be determined by examining the experimental results.\nThe general R-matrix theory, introduced by Wigner and Eisenbud in 1947, is a powerful\nnuclear interaction model. Despite the generality of the theory, it does not require information about\nthe internal structure of the nucleus; instead, the unknown internal properties, appearing as elements\nin the R-matrix, are treated as parameters and can be determined by examining the measured cross\nsections.\nA brief review of the R-matrix theory will be given here and the interaction models which\nare specializations of the general R-matrix will be described. The practical aspects of the general R-\nmatrix theory, as well as the relationship between the collision matrix U and the level matrix A with\nthe R-matrix, will be presented.\nOverview of the R-Matrix Theory\nThe general R-matrix theory has been extensively described by Lane and Thomas. An\noverview is presented here as introduction for the resonance formalisms which will be described\nlater.\nTo understand the basic points of the general R-matrix theory, we will consider a simple case\nof neutron collision in which the spin dependence of the constituents of the interactions is neglected.\nAlthough the mathematics involved in this special case is over-simplified, it nevertheless contains\nthe essential elements of the general theory.\nAs mentioned before, the nuclear potential inside the nucleus is not known; therefore, the\nbehavior of the wave function in the internal region of the nucleus cannot be calculated directly from\nthe Schrodinger equation. In the R-matrix analysis the inner wave function of the angular\nmomentum l is expanded in a linear combination of the eigenfunctions of the energy levels in the\ncompound nucleus. Mathematically speaking, if\nis the inner wave function at any energy E\nand\nis the eigenfunction at the energy eigenvalue E8, the relation becomes\nCourtesy of Luiz Leal, Oak Ridge National Laboratory. Used with permission.\n\n(1)\n(2)\n(3)\n(4)\n(5)\n(6)\nBoth\nand\nare solutions of the radial Schrodinger equations in the internal\nregion given by\nand\nSince all terms in this expression must be finite at\n, both functions vanish at that point.\nIn addition, the logarithmic derivative of the eigenfunction at the nuclear surface, say at\n, is\ntaken to be constant so that\nwhere\nis an arbitrary boundary constant.\nSince we are dealing with eigenfunctions of a real Hamiltonian,\nare orthogonal.\nAssuming that\nare also normalized, we have\nFrom Eq. (xx-1) and the orthogonality condition, we find the coefficients\n,\n\n(7)\n(8)\n(9)\n(10)\n(11)\nTo proceed to the construction of the R-matrix, Eq. (xx-2) is multiplied by\nand Eq.\n(xx-3) is multiplied by\n. Subtracting and integrating the result over the range to (as in\nEq. (xx-6)) produces the expression for the coefficients\n:\nInserting\ninto Eq. (xx-1) for r=a at the surface of the nucleus and using Eq. (xx-4), gives\nthe following expression for the wave function:\nEquation (xx-8) relates the value of the inner wave function to its derivative at the surface\nof the nucleus. The R matrix is defined as\nor\nwhere\n, the reduced width amplitude for the level 8 and angular momentum l, is defined\nas\nThe reduced width amplitude depends on the value of the inner wave function at the nuclear\nsurface. Both\nand\nare the unknown parameters of the R matrix which can be evaluated by\nexamining the measured cross sections.\nThe generalization of Eq. (xx-10) is obtained by including the neutron-nucleus spin\ndependence and several possibilities in which the reaction process can occur. The concept of channel\nis introduced to designate a possible pair of nucleus and particle and the spin of the pair. The\nchannel containing the initial state is called the entrance channel (channel c), whereas, the channel\n\n(12)\n(13)\n(14)\n(15)\n(16)\ncontaining the final state is the exit channel (channel c'). The elements of the R matrix in the general\ncase are given by\nwhere the reduced width amplitude becomes\nThe next objective is to relate the R-matrix to the cross-section formalism so that cross\nsections can be computed once the elements of the R-matrix are known.\nRelation between the R-matrix and the Collision Matrix U\nThe general expressions for the neutron-nucleus cross sections are based on the collision\nmatrix, also known as U-matrix, whose elements can be expressed in terms of the elements of the\nR-matrix. From basic quantum mechanics theory the cross sections for the neutron-nucleus\ninteraction can be given as a function of the matrix U as follows:\n(1) Elastic Cross Section\n(2) Reaction Cross Section which includes everything which is not elastic scattering (i.e.,\nreaction=fission, capture, inelastic, ...)\n3) Total Cross Section\nwhere is the neutron reduced wavelength given by\n\n(17)\nfor r $ a , (18)\n(19)\n(20)\n(21)\nWe first derive the relationship between the U and R matrices, for a simple case of spinless\nneutral particles. The total wave function in the region outside the nuclear potential can be expressed\nas a linear combination of the incoming and outgoing wave functions. If\nand\nare the\nincoming and outgoing wave functions for a free particle, respectively, the solution of the radial\nSchrodinger equation can be written as\nwhere\nis a normalization constant.\nThe presence of the U-matrix in Eq. (xx-18) (in this case a matrix of one element) indicates\nthat the amplitudes of the incoming and outgoing wave functions are, in general, different. The case\nof\ncorresponds to pure elastic scattering which means that no reaction has occurred.\nThe Schrodinger equation for\nand\nis the same as Eq. (xx-2) with\nsince the potential outside the nucleus is zero. The solution is a combination of the spherical Bessel\n( ) and Neumann (\n) functions\nand\nwhere\n.\nThe relation between the U and the R-matrices is obtained by first noting that Eq. (xx-8) can\nbe written as\nwhere\nis given in Eq. (xx-9).\n\n(22)\n(23)\n(24)\n(25)\n(26)\nEquation (xx-21), when combined with Eq. (xx-18), provides the relation between R and U-\nmatrices as\nWe define the logarithmic derivative as\nSince from Eqs. (xx-19) and (xx-20),\nand\nare complex conjugates,\nEquation (xx-22) becomes\nEquation (xx-25) represents the desired relationship between the collision matrix U and the matrix\nR.\nThe representation of the neutron cross sections will depend on the reduced width amplitudes\nand\nwhich are unknown parameters of Eq. (xx-25). Those parameters are obtained by fitting\nthe experimental cross section.\nThe general relation between the matrices U and R is similar to Eq. (xx-25) with each term\nconverted to matrix form:\n\n(27)\n(28)\n(29)\n(30)\nAll matrices in Eq. (xx-26) are diagonal except the R matrix. The matrix elements of\nare given by\n.\nIt should be noted that no approximation was used in deriving Eq. (xx-26). That equation\nrepresents an exact expression relating U and R, and leads to the determination of the cross section\naccording to Eqs. (xx-14, xx-15, and xx-16).\nTo avoid dealing with matrices of large dimensions, several approximations of the R-matrix\ntheory have been introduced. We will discuss various of these cross-section formalisms in the pages\nto come; we begin by introducing the level matrix A.\nRelation between U, R, and A\nAnother presentation of Eq. (xx-26) may be obtained by introducing the following definitions\nand\nwhere S and P are real matrices which contains the shift and the penetration factors, respectively\nand\n.\nFrom Eqs. (xx-20, xx-23, and xx-27), the penetration factors can be written as\n, and Eq. (xx-26) becomes\nwith\n.\nIt should be realized that the R-matrix is a channel matrix; i.e. it depends on the entrance and\noutgoing channels c and c'. The level matrix concept introduced by Wigner attempts to relate the\nU matrix to a matrix in which the indices are the energy levels of the compound nucleus, the level\n\n(31)\n(32)\n(33)\n(34)\n(35)\nmatrix of elements\n. In relating the channel matrix to the level matrix we recall that the R matrix\nis defined as\nwhere\nindicates the direct product between two vectors.\nThe expression\ncan be written as\nwhere we have defined\n, and\nis a symmetric matrix. The form of Eq. (xx-32) suggests\nthe following relation\nwhere the indices\nand refer to energy levels in the compound nucleus and A is determined as\nfollows:\nMultiplying Eqs. (xx-32) and (xx-33) and using the identity\n, we\nobtain the following expression,\nFactoring the term\nin the above equation, we find that the level matrix\nsatisfies the\nequation\nThe evaluation of the matrix\nwhich appears in Eq. (xx-30) is obtained by\ncombining Eqs. (xx-31) and (xx-33) which gives\n\n(36)\n(37)\n(38)\n(39)\n(40)\n(41)\nUsing Eq. (xx-35) as\ngives\nHence, the collision matrix is related to the level matrix as\nThe elements of the collision matrix for entrance and exit channels c and c', respectively,\nare given as\nwhere\nis the level width, and from Eq. (xx-35) the level matrix is\nIt should be remembered that no approximation has been introduced in the formal derivation\nof the collision matrix up to this point.\nSimplified Models Derived from the General R-Matrix Theory\n\n(42)\n(43)\n(44)\n(45)\n(46)\nIn this session we will present the approximations introduced to the R-matrix and, likewise,\nto the level matrix A which leads to various simplified resonance formalisms. The cross section\nformalisms frequently used are the single-level Breit-Wigner (SLBW), the Multilevel Breit-Wigner\n(MLBW), the Adler-Adler (AA), and the Reich-Moore (RM) formalism (also known as the reduced\nR-matrix formalism). A new methodology, called multipole representation of the cross section, was\ndeveloped at Argonne National Laboratory by R. N. Hwang; in this approach the cross section\nrepresentation is done in the momentum space (\n). We will address the approximations needed\nto obtain these simplified R-matrix models.\n\nThe starting points in deriving these formalisms will be the level matrix A and its relation\nto the collision matrix U.\nThe collision matrix is given by\nThe level matrix is represented as\n1. Multilevel Breit-Wigner (MLBW) Formalism\nIn the MLBW approximation the level matrix is assumed to be diagonal, which means that\nthe off-diagonal elements of the second term in the matrix given in Eq. (xx-43) are neglected, i.e.,\n\nHence Eq. (xx-43) becomes\nFrom Eqs. (xx-27) and (xx-40) we have\nand\n, which leads to\n\n(47)\n(48)\n(49)\n(50)\n(51)\nwhere\n(energy shift factor for the MLBW) and\n. Redefining\n, the level matrix becomes\nThe collision matrix given by Eq. (xx-42) becomes\nFrom this point, we proceed to the derivation of the cross section formalism in the MLBW\nrepresentation. For a reaction in which\n(fission, capture, or inelastic scattering channels) the\ncollision matrix and the reaction cross section are given respectively by\nand\nwhere we have used the identity\nin Eq. (xx-49). Inserting Eq. (xx-49) into Eq. (xx-50) gives\n\n(52)\n(53)\n(54)\n(55)\n(56)\n(57)\nwhere we have made\nand\n. This expression can be further modified by\nusing the following identity\nwhich gives\nwhere\n. The second term in Eq. (xx-53) is the complex conjugate of the first\nterm, hence\nThe term in the summation on\ncan be expanded to give\nwhere\nand the line shapes\nand\nare defined as\nand\n\n(58)\n(59)\n(60)\n(61)\n(62)\nEquation (xx-55) is the MLBW cross section form for the reaction cross section. A similar\nprocedure can be followed to derive the elastic cross section.\n2. Single Level Breit-Wigner (SLBW) Formalism\nThe SLBW cross section formalism is a particular case of Eq. (xx-55) when the second term\nin Eq. (xx-56) is zero, that is,\n.\n3. Adler-Adler (AA) Formalism\nThe AA approximation consists of applying an orthogonal complex transformation which\ndiagonalizes the level matrix as given in Eq. (xx-43). We are looking for a transformation such that\n\nor\nwhere\n. Here\nis a orthogonal complex matrix and is a diagonal matrix of\ncomplex elements. The elements of the matrix in Eq. (xx-60) are given as\nThe collision matrix of Eq. (xx-42) then becomes\nwhere\nand\n. The elements of the\nmatrix are determined from\n\n(63)\n(64)\n(65)\n(66)\nwhere Eq. (xx-43) has been used.\nBecause of the energy dependence of\nthrough the penetration factor\n, the elements\nwill, in general, be energy-dependent. In the AA approach, the energy dependence of\nis\nneglected. This assumption works very well for fissile isotopes where the resonance region is\npredominantly described by s-wave resonances (angular momentum corresponding to\n) for\nwhich the penetration factor is energy independent. However, the assumption breaks down when p-\nwave (\n) or other neutron partial wave functions with angular momentum greater than 1 are\npresent.\nThe reaction cross section in the AA formalism can be obtained in a similar way to that\ndeveloped for the MLBW. The result is\nwhere the following definitions were made\nand\n4. Reich-Moore Formalism\nThe approach proposed by Reich and Moore for treating the neutron-nucleus cross sections\nconsists of eliminating the off-diagonal contribution of the photon channels. The rationale for this\nassumption is this: systematic measurements of the resonance widths, mainly in the case of the\nneutron and fission widths, show strong fluctuations among resonances of the same total angular\nmomentum and parity. It should be expected, from Eq. (xx-40), that these fluctuations are connected\neither to the reduced widths\nor to the penetration factors\n. However, it is improbable that such\n\n(67)\n(68)\n(69)\n(70)\n(71)\nfluctuations are due to the penetration factors because they are either constant or a smooth function\nof the energy. Hence, the fluctuations must be related to the reduced widths. Porter and Thomas\nnoted that the reduced widths\nof Eq. (xx-13) are functions of the channel functions\nwhich, in turn, are projections of the eigenfunctions of the compound nucleus onto the nuclear\nsurface and exhibit random size variations. Consequently, the large number of gamma channels\nimplies that\nis very small for\n. The second term of the level matrix in Eq. (xx-43)\nis divided in two parts as\nand in the RM approximation\nThe level matrix becomes\nwhere, similarly to the MLBW, the following definitions were made:\n(Energy shift factor), and\n. Note that these quantities are\ndifferent from that in the MLBW formalism. Again, redefining\nwe have\nFrom this point we are going to derive a relation between the collision and the level matrix\nin the RM representation. Multiplying Eq. (xx-70) by\nand summing over gives\n\n(72)\n(73)\n(74)\n(75)\n(76)\n(77)\nMultiplying Eq. (xx-71) on the left by\nand on the right by\nand summing over\nand\ngives\nIf we define\nand\nthen Eq. (xx-72) becomes\nNote that this R matrix is an approximation, not to be confused with the exact R-matrix defined\nearlier.\nRearranging Eq. (xx-75) gives\nHence, from Eq. (xx-42) the collision matrix in the RM approximation becomes\n\n(78)\n(79)\n(80)\n(81)\n(82)\n(83)\nEquation (xx-77) relates the collision matrix to the Reich-Moore R-matrix in a form similar\nto that in the case of the general R-matrix theory. In the general R-matrix, the elements are\nwhereas in the RM approximation they are\nEquation (xx-79) is frequently referred to as the reduced R-matrix theory.\nWe now proceed to obtain a form for the cross section in the RM approximation, by writing\nEq. (xx-77) as\nwhere\nIt is useful to write the reduced R-matrix as\nin which the elements of K are given by\nThe explicit form of\nis\n\n(84)\n(85)\n(86)\n(87)\n(88)\n(89)\n(90)\n(91)\nTherefore\nbecomes\nRecalling that\nand making\n, the expression for\nbecomes\nThe matrix form of Eq. (xx-86) is\nEquation (xx-87) can be further reduced by using the identity\n.\nLetting\n,\n,\nand\nwe have\nIf we then add and subtract\nthe expression becomes,\nfor which the elements are, explicitly,\nThe collision matrix of Eq. (xx-80) then takes the form\n\n(92)\n(93)\n(94)\n(95)\n(96)\n(97)\n(98)\nwhere the elements of\nare given as\nThe RM cross sections are written in terms of the transmission probability, defined as\nfor which the collision matrix can be written as\nThe cross sections can then be obtained by using Eqs. (xx-14), (xx-15), and (xx-16) as,\nand\n5. Conversion of RM parameters into AA parameters\n\n(99)\n(100)\n(101)\n(102)\n(103)\n(104)\nA procedure to convert RM parameters into an equivalent set of AA parameters was\ndeveloped by DeSaussure and Perez. Their approach consisted of writing the RM transmission\nprobabilities\nand\nas the ratio of polynomials in energy; these polynomials can then be\nexpressed in terms of partial fraction expansions by matching the AA cross sections as:\nand\nwhere\nand\n.\nEquations (xx-99) and (xx-100) have poles\nwhich are roots of the equation\n\n(105)\n(106)\n(107)\n(108)\n(109)\n(110)\n(111)\nand are identifiable as the parameters of the Adler-Adler formalism. In deriving this methodology\nDeSaussure and Perez neglected the energy dependence of the neutron widths, i.e.,\n. This\nassumption limits the application of this methods to s-wave cross section. Hwang has extended the\napplication of the DeSaussure and Perez approach to the calculation of cross sections for any angular\nmomentum. In his approach, instead of using energy space, Hwang noted that the dependence of\non\nsuggests that an expansion in terms of\nwould lead to a rigorous representation of the\ncross section. Since momentum is proportional to\n, Hwang calls his methodology a rigorous pole\nrepresentation in the momentum space or, for short, a multipole representation of the cross sections\n(MP). The transformation of the RM parameters into the MP parameters is obtained as\nand\nwhere\nand\nis the number of resonance parameters in the RM representation. The factor\nof Eq. (xx-\n104) becomes\nwhere\nand\n\n(112)\n(113)\n(114)\n(115)\nDoppler Broadening and Effective Cross Sections\nThe Doppler broadening of cross sections is a well-known effect which is caused by the motion\nof the atoms of the target nuclei. Since the target nuclei are not at rest in the laboratory system,\nthe neutron-nucleus cross section will depend on the relative speed of the neutron and the\nnucleus. The effective cross section for mono-energetic neutrons of mass m and energy E\n(laboratory velocity v) is given by the number of neutrons per unit volume, multiplied by the\nnumber of target nuclei per unit volume, times the probability that a reaction will occur per unit\ntime at an energy equivalent to the relative velocity | v! W |, integrated over all values of W, the\nvelocity of the nucleus. The relation between the cross section measured in the laboratory and\nthe effective cross section is\nwhere\nis the effective or Doppler-broadened cross section for incident particles with\nspeed v [laboratory energy mv2/2]. The distribution of velocities of the target nuclei is described\nby\n. A major issue is the choice of the appropriate velocity distribution function of the\ntarget nuclei. Let us now assume that the target nuclei have the same velocity distribution as the\natoms of an ideal gas; i.e. the Maxwell-Boltzmann distribution,\nwhere M is the nuclear mass and kT the gas temperature in energy units. Combining Eqs. (xx-\n113) and (xx-114) gives\nNote that, from the above definitions, a 1/v cross section remains unchanged.\nChanging the integration variable from\nand choosing spherical\ncoordinates simplifies the integral to the following:\n\n(116)\n(117)\n(118)\nThis equation, known as the Solbrig's kernel, may be more familiar when written as the sum of\ntwo integrals,\nAt sufficiently high energies, the contribution from the second integral may be omitted since the\nvalue of the exponential is vanishingly small.\nTo simplify Eq. (xx-117) further, we make the following definition:\nEquation (xx-117) then becomes\n\n(119)\n(120)\n(121)\n(122)\n(123)\n(124)\n(125)\nFor programming convenience, we make a change of variable from velocity to square\nroot of energy. Thus instead of v we use\nwe redefine W to be\nand define U as\nIn addition, S(W) is set equal to s(w), or\nThese changes give the formulation which is used in SAMMY for the exact monatomic\nfree gas model (FGM):\nThese equations hold for 1/v cross sections, for constant cross sections, and for cross sections\nwith resonance structure.\nTo transform to the high-energy Gaussian approximation (hereafter referred to as HEGA)\nfrom the FGM, define E as V 2 and EN as W 2. Then Eq. (xx-124) takes the form\n\n(126)\n(127)\n(128)\nin which the lower limit has been changed from -4 to Emin, a number above zero, since the next\nstep involves approximations which are valid only for EN >> 0. If we expand the integrand of Eq.\n(xx-125) in powers of (E-E') for values of E'/E close to 1 and set\n, then\nDefining\n(Doppler width) as\n(Note that this quantity is energy-dependent) then the HEGA becomes\nwhere the lower limit was extended to negative infinity since that portion of the integrand is\nessentially zero. This is the usual Gaussian formulation of the free gas model.\nOther Energy-Dependent Cross Sections\nNo discussion of Doppler broadening would be complete without an analysis of the\neffects of Doppler broadening on particular types of cross sections. Here we examine some\nimportant types of energy dependencies.\nDoppler Broadening of 1/v Cross Sections\nDoppler broadening is expected to preserve (i.e., leave unchanged) a 1/v-cross section.\nTo test whether this is the case with FGM and/or HEGA broadening, we note that a 1/v-cross\nsection may be expressed as\n\n(129)\n(130)\n(131)\n(132)\nwhere the subscript \"0\" denotes constants. To evaluate the FGM with this type of cross section,\nnote that our function S of Eq. (xx-123), combined with Eq. (xx-129), gives\nFrom Eq. (xx-11) the FGM-broadened form of the 1/v cross section is therefore\ni.e., in the exact same mathematical form as the original of Eq. (xx-129). In other words, a 1/v\ncross section is conserved under Doppler broadening with the free gas model.\nThat is not the case for HEGA broadening. With the HEGA from Eq. (xx-128), the\nDoppler-broadened 1/v cross section takes the form\nwhich is not readily integrable analytically. What is clear is that the result is not 1/v.\nDoppler Broadening of a Constant Cross Section\nIn contrast to the 1/v cross section, a constant cross section is not conserved under\nDoppler broadening. That it is true experimentally can be seen by examining very low energy\ncapture cross sections, for which the unbroadened cross section is constant (which can be shown\n\n(133)\n(134)\n(135)\nby taking the low-energy limit of the Reich-Moore equations, for example) but the experimental\ncross section rises with decreasing energy. See, for example, the S elastic cross section from 0.01\nto 1.0 eV or the Cu elastic cross section below 2.0 eV (on pages 100 and 234, respectively, of\n[VM88]), which clearly rise with decreasing energy.\nTo calculate analytically what effect FGM and HEGA broadening have upon a constant\ncross section, we first note that a constant cross section can be expressed as\nThe function S needed for our formulation of FGM broadening (see Eq. (xx-123)) is\nfound to be\nso that Eq. (xx-124) gives, for the FGM-broadened constant cross section,\nReplacing (W-V) / U by x gives\n\n(136)\n(137)\n(138)\nin which we have replaced V/U by v.\nIn the limit of small v, the quantity in Eq. (xx-6) becomes\nso that the leading term is 1/v; this is somewhat counterintuitive but is nevertheless observed in\nmeasured low-energy cross sections. For large values of v, the limiting case is\n\n(139)\n(140)\n(141)\n(142)\ni.e., the broadened cross section is a constant, as expected.\nIn contrast, HEGA broadening preserves a constant cross section everywhere:\nthat is, the Gaussian kernel is normalized to unity, as expected. This result, which may\nintuitively appear to be correct, is nevertheless unphysical. As discussed above, It is well known\nthat measured (and therefore Doppler-broadened) cross sections exhibit 1/v behavior at very low\nenergies.\nDoppler Broadening of the Line Shapes\nand\nEquations (xx-57) and (xx-58) can be written as\nand\nwhere\n.\nThe HEGA of these functions are obtained by replacing\nin Eq. (xx-128) by\nand\n, which gives\nand\n\n(143)\nwhere\n.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n22.106 Neutron Interactions and Applications\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "MIT22_106S10_lec05.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/22-106-neutron-interactions-and-applications-spring-2010/66bfebee3b89bc703960f48701596dc9_MIT22_106S10_lec05.pdf",
      "content": "Coherent an\n \ninco\nL\nh\ne\ne\nt\nr\n \ne\na\nn\ns\nt\ns\n \nu\nsp\nm\nin\ne\n \n a\nd\ne\nas\nn\n I\n \n \nn\no\nc\np\no\nR\ne\nh\na\nr\nd\na\ne\nt\nr\ni\no\nu\nr\nn\nf\nt S\ns\n \n \no\n \nr\np\n t\ni\nh\nn\ne\n Scattering \n coherent and \n\n \n \na\n~\n~\n= A+ B\n~\nI\n\n.i\n\n J\n\n= I\n\n+ i\n \nJ\n2 = I\n2 +\n \n \ni 2 + 2I\n\n.i\n\n \nI .i 1\n=\n\n2[J\n\n2 -I\n\n2 -i 2]\n \n\n \na\n~\nζ\n~\n= A ζ\n~\n+ BI\n\n. i ζ\n \nζ\n \n→spin state eigenvector  \n\na\n~\nζ\n\n~\n= A ζ\n~\n+ B 1\n2[J\n\n2 -I\n\n2 -i 2] ζ\n \na = A + B 1\n \n[J(J +1) -I(I +1) -i(i +1)]\n \n \nFor i =1/2 ⇒J = I -1/2 and J = I +1/2\na) For J = I -1/2\nwehave\na-\n= A + 2 B[(I -1/2)(I +1/4) -I2 -I -3/4]\nor\na-\n= A -2\n \nB(I +1)\n\nb) For J = I +1/2\nwehave\na+\n= A + 2 B[(I +1/2)(I + 3/2) -I2 -I -3/4]\nor\na+\n= A + 2\n \nBI\n \nA and B as a functionof a-and a+\nFrom\na+\n= A + 2 BI\nand\na-\n= A -2 B(I +1)\n \n\nA and B become\nI\nA\n+1\n= 2I +1\nI\na+ + 2I +1a-\nand\nB = 2I +1(a+ -a-)\n \n \n \nIf\ne\nT\nx\nh\n \ni\ni\ns\ns\nt\n \ns\ni\n. \nn\na\ndi\n+\nca\n=\ntes\na\n \n-\nth\n=\nat\na\n  n\n \no\nth\n  s\ne\np\nn\ni\n \nn\nB\n  co\n=\nhe\nr\n \nen\nan\nt \nd\ns\n \nca\nA\ntte\n=\nrin\na\ng\n. \n \nthe inco\nH\nh\ne\ne\nn\nr\nc\ne\ne\nn\n, \nt \nA\nsc\n \na\nr\nt\ne\nt\nl\ne\na\nr\nt\ni\ne\nn\ns\ng\n t\n. \no the coherent and  B to \n \nbe d\nT\ner\nh\ni\ne\nv\n \ne\ne\nd\nx\n \np\nas\ne\n:\nc\n \nted values for the operator \n~ 2\na  can \n \n< a2 >= ζ\n~ ~ *\naa ζ\n \n \n\n \n\n \n< a\nh\n>=\ne c\nA\n\nT\nro\ns\n+\ns t\nAB\nerm\n<\ns \nI\nar\n.\ne\ni\n \n\nz\n>\ner\n+\no\nBA < I\n\n. i > +B2 < (I\n\n. i )2 >\ns\ne\np\nxi\ni\ns\nn\nt\n,\ns\n i\n \n.e\nb\n.\ne\n, \nt\n\n<\nw\nI\ne\n.\ne\ni\nn\n>=\n th\ne \n \nneutron s\n \np\nsi\n.\ni\nn\nn\nc\n a\ne\nn\n n\nd\no\n \n \nt\nc\nh\no\ne\nr\n \nr\nn\ne\nu\nla\ncl\nt\ne\nio\nu\nn\ns \n \n\n \n \n< a2 >= A2 + B2 < (I\n\n.\n \ni )2 > \n\n \n< (I\n\n. i )2 >=< (Ixix)2 + (I\nyiy) + (Iziz)2\n \n>\n \n< (i )2 >=< (i )2\nx\ny\n>=< (iz) >=1/4  \n< (I\n\n. i )2\n>= 4\n\nI\n<\n>\nor\n\n< (I . i )2\n>= 4 I(I +1) \n\n \n< a >= A2 + B2 1\n4 I(I +1)\n \n \n \nWith A and B as\nI\nA\n+1\n= 2I +1\nI\na+ + 2I +1a-\nand\nB = 2I +1(a+ -a-)\n \n \n \n \n \n \n \n \n\nI\n< a\n+1\n>= 2I +1\nI\na+ + 2I +1\n\na-\nI(I +1)\n+\n\n(2I +1)2\n \n(a+ -a-)2\n \na\nI +1\ncoh = 2I +1a+\nI\n+ 2I +1a-\n \n \n[I(I\na\n+1)]1/ 2\ninch =\n2I +1\n(a+ -a-)\n \n \n \n \n \n \n \n \n \n \n \n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n22.106 Neutron Interactions and Applications\nSpring 2010\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "MIT22_106S10_lec06a.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/22-106-neutron-interactions-and-applications-spring-2010/6ad03d691e31dad7b9eb8c803a978660_MIT22_106S10_lec06a.pdf",
      "content": "Luiz Leal \nOak Ridge National Laboratory \nLe\nE\nc\nn\nt\ns\n \ng\nu\ni\nr\nn\ne\nee\n P\nri\nr\nn\ne\ng\ns\n \ne\nD\nn\ne\nt\np\ned\nar\n a\nt\nt\nm\n the Nu\nMassachusetts Insti\ne\nt\nn\nu\nt\nt\n \ne\no\n \nf \nc\nt\nl\nh\ne\ne\na\n \nr \nTechnology (MIT) \nof \n \n \n \n \n \n \n \n \nCourtesy of Luiz Leal, Oak Ridge National Laboratory. Used with permission.\n\nN\n \nr\n\nT\nΦ\nim\n(E\ne\n,\n  ,Ω\nIn\nˆ )\ndependent \nTransport \nEquation \nfor \n \nΩˆ . ∇Φ+ Σ Φ\n \n \n \nt\n= ∫dΩˆ '\ninf\n∫dE'Σs(E'→E,\n\nΩˆ ' →Ω)Φ(E',r ',Ωˆ ) + S\n\n4π\nΣt  \nΣ\nM\n \nacroscopic total cross section \ns \n \nHow a\nM\n \nre\nac\n t\nr\nh\no\ne\ns\ns\ncopic scattering cross section \n \n(a)\nr\n\neac\nM\nto\ne\nr\na\ns,\ns\n e\nu\ne\nr\n q\nem\nua\ne\nn\nn\nt\nt\ni\n \nt\ntc; \nb\nie\ny\ns\n \n \nt\nt\ni\nr\nm\nea\ne‐\nt\nof\ned\n‐f\n?\nl\n \night  machine, \n \n \n(b)\n\nEvaluated using nuclear physics models; \n \n(c)\nG\nP\ne\no\nn\no\ne\n \n(\nHow  is  nucle\nr\nra\n C\nte\nh\nd\no\n \ni\nu\nc\ns\ne\ni\n!\nng nuclear physics codes  \n)       \nar  physics  applied  to  get  the  cross \neutron Interaction \nsections? \n\nN\n \nn + target\neutron Intera\n \n →  ??? \nction \n \nIn all three regions there are always: \n \n \nS\n \nCATTERING and REACTION \nc\nR\n \no\ne\nm\ngi\np\no\no\nn\nu\n \nn\nd\n: \n \nH\nnu\nig\nc\nh\nle\n e\nu\nn\ns\ne\n f\nr\no\ng\nr\ny\nm\n n\na\ne\nti\nu\no\nt\nn\nr\n;\no\n \nns - direct and \nu\nR\nn\ne\nr\ng\ne\ni\ns\no\no\nn\nl\n \nv\ned\n: \n)\nR\n  -\ne\n \nso\nD\nn\ne\nance  region  (resolved  and \nf\n \nR\no\ne\nr\ng\nm\nio\nat\nn\nion and som\nfi\ne\nn\n d\nit\ni\ne\nr\nl\ne\ny\nc\n \nt\nc\n i\no\nn\nm\nte\np\nra\no\nc\nu\nt\nn\nio\nd\nn\n \ns\nn\n;\nu\n \ncleus \no\nch\nf \ne\ni\nm\nn\ni\nc\nc\ni\na\nd\nen\n: \nt\nC\n \nh\nn\ne\ne\nm\nu\ni\nt\nc\nr\na\no\nl\nn\n r\n \ne\ni\ng\ns\ni\n \no\nc\nn\no\n \nm\n- \np\nn\na\ne\nr\nu\na\nt\nb\nro\nle\nn\n \n e\nto\nn\n \ner\nth\ngy\ne\n \nmolecule\nl \n \ns;\nb\n \ninding  energy  of  atoms  in  the \n \n \n\n \nThe  neutron  reaction  cross  sections \nsuch  as  (n,  fission),  (n,  gamma)  are \naffected  only  by  the  motion  of  the \nt\n \narget  atoms  (Doppler  broadening \neffects)\nIn  the  t\n.\nr\n \neatment  of  the  neutron  scattering \ncross section in the chemical region one mu t \n \nconsi\ns\n\nder:  \n(a) K\nis\ni\n \nn\nc\ne\no\nt\nm\nic\np\n e\na\nn\nra\ne\nb\nrgy of the incident neutrons \nt\nli\nh\nq\ne\nu\n \ni\na\nd\nt\n)\no\n. \nm in \nl\nt\ne\nh\n \ne\nto\n t\n \na\nt\nr\nh\ng\ne\ne\n \nt\nb\n \ni\n(\nn\nm\nd\no\nin\nle\ng\nc\n \nu\nen\nle\ne\n, \nr\ns\ng\no\ny\nl\n \ni\no\nd\nf\n, \n \n \n\nATOMS ARE NOT FREE!!! \n(b) N\nth\ne\ne\nu\n i\nt\nn\nro\nte\nn\nr\n \na\nw\nto\na\nm\nve\ni\nl\nc\ne\n \nn\nsp\ng\na\nth\nci\n \nn\nis  of  the  order \n\ncrystals; \ng in molecules o\no\nf\nf\n \n \n(c) S\nsa\nc\nm\nat\ne\nte\n \nri\nm\nng\n\no\n \nl\nfrom  v\n(coherent, i\ne\nn\nc\nc\nu\no\nl\nh\ne\ne\n \nre\no\na\nf\nr\n \nio\nc\nu\nr\ns\ny\n \ns\nn\nt\nuclei\nn\n \nt\ni\ne\nn\nr\n \nnt); \nal  i\nfe\nth\nre\ne\n \n \n(d) Neutron may GAIN or lose energy; \n\nBorn approximation  \nConsider the situat\nA\n \n Fermi pseu\nn\nd\nd\no\n \n potential  \nion: Scattering by a single \nspinless nucleus \n \n   ψ (r )\n-\n2μ\n\n∇+ V(r\n\n)\n\nψ (r )=Eψ(r )\n\n \n at the detector satisfy the equation: \n \n \n\nOr \n \n[\n\n∇+ k 2]\n(r ) F(r\nψ\n=\n)\n \nW\n \n \nhere: \nk 2 2μE\n=\n\n \nand\n \nF(r\n \n\n)\nμ\n=\n\nψ\n \n \nV(r )\n(r )\nt\nT\nr\nh\na\ne\nv\n \ne\ni\nl\nn\nin\nc\ng\nid\n i\ne\nn\nn\n t\nt\nh\n \ne\nw\n z\na\n \nv\nd\ne\nir\n \ne\nd\nc\ne\nt\nscribe\n \n\nikz\nion. It \ns\ni\n \ns\na\n g\n \ni\nf\nv\nr\ne\ne\nn\ne\n \n \na\np\ns\na\n  \nrticle \nψ inc(r ) = e\n \n \n \n \n\nWe also know that  \n \n [\nikz\n∇\nk 2\n+\n] e\n= 0\nSuggested homework: \n \nDemonstrate that  \n \n[\nk 2\n \n∇+\n] eikz = 0\n \n \nT\n \nheref\nore, the \nequations to be solved is \nw[\nit\n∇\nh \n+ k\n\n]\n\nψ (r )= F(r\nsc\n)\nF(r\n)\nμ\n=\n \n\n \nV(r )ψ(r )\nRecall that ψ (r )\n \n is included in  F(r ) \n\nGreen's Function \n \nS\n \nol\nr\n\nut\n-\nion\nr   '\nat the detecto\nψ\nr \nr\nd\n(\nue\n)\n to a point source \n \nat \n \n[\n∇+ k 2]\n\n is given as \nψ\n \n0(r )=δ(r -r ')\n0(r )\n \n \n\nψ\n\neik|r\nψ0(r )\n-r '|\n= -4\n\nπ | r\n\n-r '|  \n \nThe  solution  for \nis  obtained  by \n \nintegrat\n\nin\nψsc(r\n\ng in volum\n\ne τ  \n)\nik\n \n|\n(r )\ne\nr -r '|\nψsc\n= -\n\n4π | r\n-r '|\nr\n∫\nF( ')dτ\nτ\n \nor \n\n \nr\nψsc( )\nμ\n= -\n\n2π2\neik|r -r '|\n4π | r\n-r '|\n\n \n\n∫\nV(r ')\n\nψ(r ')dτ\nNice\nτ\n \nB\nV\ne\n(\nfo\nr   ) \nsolut\nre\nno\n pr\nr\no\n ψ\nio\n(\nn  of  little  value  since  neither \n| r |>>|\nce\nr\ne\nr\nd\n)\nin\na\ng\nr\n \ne\nf\n \nu\nk\nr\nn\nt\no\nh\nw\ner\nn\n n\n q\no\nu\nte\na\n \nn\nth\nti\na\nti s\n\nt\ne\n fo\n. \n'|\nr  \n \n \nr '.u ˆ\n| r\n-r '|≈r 1-2\n\nr\n \n\n/ 2\n\n \n\nor\n \n|\n \n \nr\nwher\n-\n \ne\nr '|≈r -r '.u ˆ  \n  \n\nr\nu ˆ =\n\nr\n \nSuggest\n \ned homework: \nShow that  \n \n| r r '|\n\n-\nr -\n \nr\n≈\n'.u ˆ\n \n \nThe function \n \nψ sc(r )\n(\nμ\nbecomes, \nψsc r ) = -\n\n2π2\n\ne-ikr '.u ˆ V(r ') (r\neikr\n\n∫\nψ\n')dτ\n\nτ\nr\nD\n \nefining \nf (θ)\nμ\n= -\n\n2π2\ne\n\n \n∫\n-ikr '.u ˆ V(r ')ψ(r ')dτ\n \nτ\n \n \n\n \nHence \n\nψ\n \nsc(r\neikr\n) = f (θ)\n\nr\n \n \nW\nsec\ne\nt\n k\nio\nn\nn\no\n \nw\nis \n \ng\nth\niv\na\ne\nt\nn\n t\n \nh\na\ne\ns\n \n \ndifferential scattering cross \n \nσ(θ)\nd2σ\n= dEdΩ = f (θ)\n \n \n \nσ(θ)\nμ\n= -\n\n2π2\nr\n∫e-ikr '.u ˆ V( ')ψ(r ')dτ\nτ\n \n \nT\nno\nh\nt\ne\n \n \n \nK\nfu\nn\nn\no\nc\nw\nti\nn\no\n!\nn\n!!\ns\n \n ψ(r\n\n) and  V(r ) are still \n\n \nBorn Approximation \n \nA\n \nssumption: \nT\npo\nh\nt\ne\ne\n \nn\nc\nt\no\nia\nm\nl \np\nr\nl\ne\ne\ng\nte\nio\n \nn\nw\n  i\na\ns\nv\n \ne\nr\n \nep\nfu\nla\nn\nc\nc\ne\nti\nd\no\n \nn\nb\n \ny  th\n(r\nψ\ne\n\n \n)\ni\n \nn\ni\nc\nn\ni\n \nde\nthe \nw\n \nave \n\nfu\n\nnction, that is, \nnt \nψ\n  (r )\neikz = e\nikr .u ˆ z\n \n \n \nR\n=\nationale: \nI\np\nn\no\nc\nt\ni\ne\nd\nn\ne\nt\nn\nia\nt \nl \np\nre\na\ng\nr\ni\nt\no\nic\nn\nle\n, \n  is  weakly  scattered  in  the \n \nσ(θ)\nμ\n= -\n\n2π2\n\n∫e\n-ikr '.(u ˆ z -u ˆ )V(r ')dτ\nτ\n \n \n\nF\ne\n\n \nF\nV(r )\n \ner\nr\nm\nm\ni \ni\nc\n P\ne\nam\nse\ne \nu\nxpression for\nu\nd\nV\np\no\n \n(\np\nr w\n\n)\no\ni\ntencial \nis very low. \n \nt\nw\nh \nh\na\ne\n \nn \nc\nt\nl\nh\ne\ne\nv\n \ne\nn\nr\ne\n \nu\ni\nt\nd\nr\ne\no\na\nn\n \n e\nfo\nn\nr\ne\n \nr\na\ng\nn\ny \n \n \nA\n \nssumptions: \n(\nm\na\no\n) \nm\nTh\ne\ne\nn\n \nt\np\num\note\n \nn\nsp e\nl\nt\n=\nia\nl\nh rically symm\n,\n \n \nis\nt\n \nh\nap\nat\np\n \nli\ni\ne\ns\nd\n, \n to\netric; \nth\n s\ne\n\n \nw\np\na\no\nv\nt\ne\ne\n, \nn\na\nt\nn\nia\ng\nl\nu\n \nla\nis\nr\n \n \n \n(\nT\nb\nh\n)\ne\n S\n p\nh\no\no\nt\nr\ne\nt\nn\n r\nt\na\nia\nn\nl\ng\n s\ne\nu\n p\ng\no\ng\nte\n \n\n2π\n=\nes\nn\nte\ntia\n\nd \nl\nb\n \ny Fermi is \nV(r )\n\nμ\nδ\n \nWhere       is th\na\n \na\ne s\n(\nc\nr\na\n)\nttering length  \n \n \n is still not known!! \n\n \nTo understand the concept introduced by \nF\nof\ne\n \nr\nn\nm\neu\ni \nt\nl\nr\ne\no\nt'\nn\ns continue examining the scattering \ne\n \nffect consi\ns\nd\n \ne\nb\nr\ny\ne\n \nd\na \n. \nsingle nucleus with no spin \nR\n \necall that: \n(\nikz\neikr\nψ r ) = e\n+ f (θ)\n\nr\nr\n \n \nfor  > R \nLow  energy  neutron,  since  k 2\n2μE\n=\n\nH\n→\nl\n \nk\n,  imp ies \nthat \n \nli\ne\nm\nnc\nr\ne\nψ\n \n(r) = r + lim f (θ)\nk →0\nk →0\nr> R\nr> R\n \n\n \nThe scattering length   is defined as  \n \na\na = -lim f (θ)\nk →0\n \nr> R\n \nI\nF\nn\n \no\nt\nr\ne\n r\nrpr\n \n=R\nRψ(R\n \ne\nat\nta\n t\nt\nh\ni\ne\no\n \nn\nn\n \nu\no\nc\nf\nl\n \ne\nth\na\ne\n) = R -a\nr \n \ns\ns\nu\nc\nr\na\nf\nt\na\nt\nc\ne\ne\nr\n w\nin\ne\ng\n \n \nh\nle\nav\nn\ne\ng\n \nth a \n \nor  \n  \n \na = R[1-ψ\n \n(\ni\nR\nm\n)\np\n]\n(\nand \na)  ψ(R) = 0\na=R \ne\n \nnetrable  sphere \n \n \n \n\n(b) \n \n \nψ(R) <1\na\n \n > \nR\ne\n \na\na\nl\nn\nis\nd\ntic\n a\n p\n \no\n<\nt\n \ne\nR\nn\n \ntial indicating bound states \n \n(c) ψ(\n \nR) >1\na \n \n \n \nNo\n<\n b\nou\n \nnd states!! \n\nThe  differential  scattering  cross  section \nw\n \nith the Ferm\nμ\ni pseudopotential is then \nσ(θ) = -\n\n2π2\n∫e\n-ikr .(u ˆ z -u ˆ )\nπ2\nτ\nμ\naδ(r )dτ\n \nf\n \nor  k →0\nσ(θ) =\n (\na\nlow energy neutrons) \n \n \nT\n \nσ\nh\ns\ne \n=\ntot\n∫\nal\nσ\n sc\ns\na\n(θ\ntte\n)\nr\nd\nin\nΩ\ng cross section is \n4π\n \n \no\n \nσ\nr \ns\n \n= 4π a\n \n \n \n \n\nThe  derivation  so  far  assumes  that  the \ni\na\nn\nls\nc\no\nid\n \ne\na\nn\nss\nt\nu\n n\nm\ne\ne\nu\nd\ntr\n \no\nth\nn\na\ns\nt\n h\n  t\na\nh\nv\ne\ne\n \n \nn\nvery low energy. I\nnot bound; therefore, the\nu\n \nc\nsc\nleus  of  mass  M\nt\n \n \ni\ni\ns\ns\n \n \nc\nm\na\no\nll\nl\ne\ne\nd\nc\n \nIf  the  neutron \na\nin\ntt\nt\ne\ne\nr\nr\ni\na\nn\nc\ng\nt\n \ns\nl\n \ne\nw\nng\nit\nt\nh\nh\n \n i\na\ns\n \n \nm\nm\no\nas\nle\ns\nc\n M\nu\na\nle\nfree\n o\n. \nf mass\nul\n \ne\nis\n, \n i\nt\nn\nh\nc\ne\nl\n \nu\nS\nd\nc\ne\n M' in \nh\nd\nr\n,\no\n i\nd\n.e\nin\n., n\nwh\nc\ni\nl\nc\n \ne\nh\nu\n \nge\nu\nr equ\ns\nt\n \nh\nb\ne\no\n \nu\nn\nn\nu\nd\ncl\n \ne\nto\nu\n \ns\nt\n \nh\no\ne\nf \n \ns\nm\ny\na\ns\ns\nte\ns \nm\nb\n \ne\nn\ntw\neu\ne\nt\ne\nr\nn\no\n \nn‐\nt\nm\nhe\no\n \nle\nn\nc\ne\nu\nu\nle\ntr\n \no\nw\nn\ni\n \nll \nat\ni\ni\nn\no\nc\nn\nlu\n \nd\nfo\ne\nr\n \n \nt\nt\nh\nh\nm\n'\n(\ne\ne\n \n \nolecule (M ). \nm)  and  the \n \nT\n \nhe scenarios are: \n \n(a)\n\nS\nystem m and M \n-\n2μ\n\n+ V(\n\n∇\nr )\n\nψ (\n \n\nr )=Eψ(r )\n\n \nw\n \nμ\nh\n=\nere\nmM\n \nm + M  \n\n(b) System m and M' \n \n \n\n-\n2μ'\n\n+ V(\n∇\nr )\n\n(\n\nψ\nr )\n\n \n=Eψ(r )\n\n \nw\n \nmM\nμ'\nh\n=\nere \n'\nm + M'  \n \nT\nan\nh\nd\ne\n \n \nM\nSchrodin\n \n-\n' can be \ng\nw\ne\nr\nr\ni\n \nt\ne\nt\nq\nen\nu\n \na\na\nt\ns\ni\n \non  for  the  system  m \n2μ\n∇ψ(r )\nμ'\n+ μ\n\n'\nV(r )ψ(r ) μ\n=μ\n \n \nEψ(r )\nm\nW\n‐\ne\nM\n  s\n'\n\n \ne\na\n\ne\ns\n \n \na\nμ\nn \n'\nV (r ) =\neffective  potential  for  the  system \neff\n\nμ V(r ) \n\nAs \nwe \nhave \nseen, \nin \nthe \nBorn \na\np\np\nse\np\nu\nro\nd\nx\no\ni\np\nm\no\na\nte\nti\nn\no\nt\nn\nia\n \nl \nt\nt\no\nh\ng\ne\ne\n \nth\nsc\ne\na\nr\nt\n \nte\nw\nri\ni\nn\nth\ng \n \nle\nth\nn\ne  Fermi \nthe e\n \nffective poten\nμ\ntial is \ngth  with \nabound =\n\n2π2\n\n∫Veff (r )dτ\nτ\n \n \nor\n  \n \nm\na\n+ M\nbound =\n\nM\nμ\n2π2\n\n∫V(r )dτ\nτ\n \n \n \n \n \n \n \n \n \n\nThe relation between \n and \n is \n \nabound\nafree\nm\na\n+ M\nbound =\nM\n \n \na\nnucl\nD\ne\ne\nu\nf\ns\ni\n \nn\nm\nin\na\ng\ns\n \ns\nA\n  M\n  a\n \ns\na\n \nfree\nnd\nth\n \ne\nth\n \ne\nr\n \na\nn\ntio  between  the \nA=M/m we have \neutron  mass  m, \nabound\n \nA +1\n=\nA\n \n \na\n \nfree\nS\nse\nin\nc\nc\nti\ne\no\n \nn\nth\n i\ne\ns\n \n \nlow‐energy bound‐scattering cross‐\n \nbound\nσ s\n= 4π a2\nbound  \n \n \n \n \n \n\n \nunb\nT\nou\nhe \nd \nr\ns\ne\nc\nlation\n \nbound\nn\na\nA\ntte\n+\nrin\n  b\n c\ne\nr\ntween \ng\noss sect\nt\ni\nh\no\ne\nn\n \n i\nb\ns \nound  and \nσ s\n=\nA\n\nA\n \nσ\n \n \nσ\ns \nbound\ns\nan exam\n\np\n\n= 4\nl\nσ\ne, \nfree\nfor \nfree\n\nA\n\n=1 (hydrogen)  \n \nSuggested homew\n \nork: \nbound\n(a) Which  one  is  measured  σ s\n  or \nσ free\ns\n? \n \n(b)  If both, how? \n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n22.106 Neutron Interactions and Applications\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "MIT22_106S10_lec06b.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/22-106-neutron-interactions-and-applications-spring-2010/f9c0eaa1bffda170956b2b9fba2a50b0_MIT22_106S10_lec06b.pdf",
      "content": "Oak Ridge N\nLu\nat\niz\nio\n L\nn\ne\na\na\nl \nl\nL\n \naboratory \nLe\nE\nc\nn\nt\ng\nu\ni\nr\nn\ne\ne\ns\ne\n P\nri\nr\nn\ne\ng\ns\n \ne\nD\nn\ne\nt\np\ne\n \nd\nar\n at the Nuclear \nMas\nT\nsa\ne\nc\nc\nh\nh\nu\nn\ns\no\ne\nl\nt\no\nt\ng\ns\ny\n I\n \nn\ntm\nsti\ne\nt\nn\nu\nt\nt\n \ne\no\n \nf\no\n t\nf \nhe \n \n(MIT) \n \n \n \n \n \n \n \n \n \nCourtesy of Luiz Leal, Oak Ridge National Laboratory. Used with permission.\n\n \nScat\n \ntering: Coherent and Incoherent \n(Interference effects) \n(\n1.\nA\n O\n)\n\n \nn\ncc\nC\nu\no\nrs\nh\n \ner\neutrons \nfo\ne\nr\nn\n \nt \nw\nE\na\nla\nv\ns\ne\nt\ns\nic\nh\n \n \nhaving  t e \nd\nS\ne\nca\nsc\nt\nr\nte\nib\nr\ni\ni\nn\nng\nsam\ng \n \ne  energ\ni\ni\nn\ne\nc\ns\ni\n \nd\nt\na\ne\nn\nnt \n\n \nh\nd \n2. \ne\nF\nikz\ne same spin state \nor\n \n \ne\na\na\n \nc\nin\nh \nci\nn\nd\nu\ne\nc\nn\nl\nt\ne\n \nu\nn\ns\ns\ne\n\n \nw\nu\nin\nt\na\nr\nv\n \no\ne\nt\nn\nh\n  characterized  by\nscattered wave (\n, l\ne\no\n \nw\nta\n e\nr\nn\ng\ne\ne\nr\nt \ngy\nem\n)  \nits  a \n  \n \neiki ri\nψsi = -ai\nri\n \n \n(\nto\nR\n \ne\nth\nla\ne\nt\n \n \ni\ni\nv\nth\ne\n n\n c\nu\no\nc\no\nle\nrd\nu\ni\ns\nn\n)\na\n \nte systems attached \n \n \n\n \n3.\nt\ne\nh\nn\ne\ne\n \nr\nto\ngy\nta\n a\nl \nn\nw\nd\na\n \nv\nsp\ne \ni\n(\nn\na\n \nd\nin\nd\n \ne\nth\nd\ne\n c\n \no\nla\nh\nb\ne\no\nr\nr\ne\na\nn\nt\nt\no\nl\nr\ny\ny\n) \n \nis\nsystem, \n \n \n!\n \n!\nik r #R\ne\ni\ni\n\" =\n#a\n \n                            \ns\ni\n\nnu\n \nc\nLab\n \nleus \noratory  position  of  the  ith \n4.  C\n \nan\no\ng\nh\nu\ne\nl\nr\na\ne\nr\nn\n \nt \nd\ns\ni\nc\ns\na\nt\nt\nr\nt\ni\ne\nb\nr\nu\nin\nti\ng\no\n \nn \naffe\no\nc\nf\nt\n \ns  o\ns\nn\nca\nly\ntt\n \ner\nt\ne\nhe \nn\nsc\ne\na\nu\nt\nt\nd \ncons\nt\nr\ne\no\nr\nn\nin\ns\ng\n. \n \nIt  does  not  affect  the  total \nerved in\ncr\n t\no\nh\ns\ne\ns\n \n \nsc\ns\na\ne\nt\nc\nt\nt\ne\ni\nr\no\ni\nn\nn\n \ng)\n(\n \nneutrons  are \n\n!\n!r # R i\nN\n$\ni=1\n!\nR\ni\n \n \n \n For  N  nuclei  in  the  target,  with  same \n \n\nSimple System \n \n \n \nThe  scattered  waves  arriving  at  the \ndetector  are  combinations  of  the  waves \ns\n \ncattered at A and \ne\nB\nikr\n and are give by \nψsc(r,θ,φ) →-a r\neik(r\n-a\n+BC )\nr + BC  \n \nThe scattering lengths are the same for both \nnuclei.    \n\n \nSince  r >> BC\nr + BC\nb\n \ne replaced by r \nThe segment  BC\n \nBC\n is give as \n \n= dsinθcosφ\nSuggested Home\n \nwork: \nShow the above expression \nH\n \nint:  Calculate  the  angle  between  two \nv\nT\ne\nh\nc\ne\nt\n t\no\no\nr\nt\ns\na\n \nl\ni\n \nn\nsc\n s\na\np\ntt\nh\ne\ne\nr\nr\ne\ni\nd\nc\n‐\na\nw\nl \na\nc\nv\no\ne\no\n f\nr\nu\nd\nn\nin\nct\na\nio\nte\n \neikr\nn\ns\n i\n.\ns\n \n \nψsc(r,θ,φ) = -r\n \n \n[a\naeikd sinθ cosφ]\nD\n \nf\ne\n(\nfin\n,\ning\n)\n the\nu\n+\n \n[\n s\na\ncatt\na\ner\ne\nin\nikd\ng \nsin\nf\nθ\nnc\ncos\nT\nθ φ =\n+\nti\nφ\non as \n \nhe differential scattering cros\n]\ns section is  \n, \n in the denominator can \n\n \nσ s(θ,φ) = f (θ,φ)\n \n \nT\nnu\nh\nc\ne\nl\n \ne\nd\nu\ni\ns\nff\n \ne\nfo\nre\nr \nn\no\nt\nu\nia\nr\nl\n \n \ns\ns\nim\nca\np\ntt\nl\ne\ne\nr\n s\nin\ny\nf\ng\nst\n(\n \nθ\ne\nc\nm\nr\n,φ\no\n \ns\n)\nis\ns\n \n \no\ns\nb\ne\nt\nc\na\nti\ni\no\nn\nn\ned\n  p\n b\ne\ny\nr \n \nsing the expression for \n1⁄2\n \nu\n (two nuclei) \n with a factor \nσ s(θ,φ) = 2\n \n \na2 [1+ cos(kdsinθcosφ)]\n \nSuggested homework: \n \nB\n \nehavior  of  σ s(θ,φ)  for  kd  <<  1  (low \nenergy) and kd >> 1, (high energy) \n \n \n \n \n \n \n\ncos\nC\nφ\non\n=\ns\nid\n \ner the special case for \n e., \n \nφ = 0, i.\nσ s(θ,0) = 2\nk\n \n \na2 [1+ cos(kdsinθ)]\nSince \nπ\n= λ  \n \nσ s(θ,0) = 2\nd\na2 1+ cos(2π λ\n \n\nθ\n\nsin )\n\nWe see that the m\n\na\n\n \ni\n\nn\nx\n\nwhe  \nmum of σ s(θ,φ) occurs \n \nn\n \nλ = dsinθ\nT\nn\nhi\n=\ns \n \ni\n,2,3...  \ns the Bragg's law for our simple system. \n \n\nIn general the situation is: \n \n \nNeutrons incident are scattered by an angle \n \n \nBragg's Law is \nθ\n \nnλ = 2dsinθ\nn =1,2,3...\n \n \n \n \n\nN\n \note that for: \n(a)\n \n\nλ > 2d \n\nno Bragg scattering is possible \n(b)\n \nthe \nM\nBr\na\na\nx\ng\nim\ng \nu\ncu\nm\nto\n o\nf\nc\nf \nc\n \nur for  λ = 2dmax; this is \nW\n \n2.86 ×10-9\nλ\ne\n=\n know that  \nE(eV)\n \n \n(cm)\nSuggested homework: \nS\nT\nh\n \nh\no\ne \nw\nex\n t\np\nh\nr\nat\nes\n \ns\nλ\nio\n=\n \n0.143\ndmax =\nn f\nf\no\n(\nr\nE\n th\n) \ne\na\n \ns\nB\n \nr\na\na\nb\ng\no\ng\nv\n c\ne\nu\n \ntoff is \nE(eV)  (A)\n \n1A =10-8cm \n \n\n \n \n \n \n \nCalculate   dmax = ? \n \n \n \n \n \n \n \n\n(B)\n1.\nI\nS\nncoher\n\n \n  catterin\ne\ng\nn\n \nt\nb\n E\ny \nl\nn\na\no\nst\nn\ni\n \nc\nid\n S\ne\nc\nn\na\nt\nt\ni\nt\nc\ne\na\nr\nl \ni\nn\nn\nu\ng\nc\n:\nl\n \nei \n \n2.  Nuclear spin \n3.  \n(\nN\nC\no\nry\nn\ns\n‐\nt\nc\na\no\nl\nn\n) \nstant nuclear spacing \n \n \n(\n \na)  Nonidentical  nuclei  (continuing  with \nt\nf\nI\no\nn\nh\n \ne\nt\n \nr \nh\ns\ne\nim\n s\np\nim\nle\np\n system) \nthe scatt\nle\ne\n \nr\ns\nin\ny\ng\nst\n \ne\no\nm\nf t\n \nw\nw\no\ne\n \n \nn\nh\no\na\nn\nve\n‐i\n \nd\nb\ne\ne\nn\ne\nt\nn\nic\n s\na\nt\nl\nu\n n\nd\nu\ny\nc\nin\nle\ng\ni \n \nthere  will  two  distinct  scattering  lengths a1 \nand\n \n \n   \n \nThe d\na\nif\nferenti\nal scattering cross section is \nσ s(θ,φ) = 2 a1 + a2eikd sinθ cosφ 2\n \n \n \n\nor \n \nσ s(θ,φ) = 2\nMaximum: \n[a2\n1 + a2\n2 + 2a1a2 cos(kdsinθcosφ)]\n \n \nmax\nσ s\n(θ,φ) = 2\n \n \n(a1 + a2)2\nM\nσ\ni\nmin\ns\nnim\n(θ\nu\n,φ\nm\n)\n: \n=\n \nIf only\n(a1 -a2)2\nand \n \na1 = a2\nThe  n\nmin\nσ s\n co\n(θ\nh\n,\ne\nφ\nr\n) =\n \nent\n scattering is present \n \n.  \n \npresenc\no\ne\nn\n o\nze\nf \nr\nin\no\nc\n \no\nσ\nhe\nmin\ns\nre\n(\nn\nθ\nt\n,\n \nφ\nsc\n)\na\n=\ntte\nr\n \nin\ni\ng\nn\n.\nd\n \nicates  the \n \n \n \n \n \n \n\nIn general for a number \n of nuclei with \ns\nd\nc\nif\na\nf\nt\ne\nt\nr\ne\ne\nr\nn\nin\nti\ng\na\n \ni\ns \n \nl sc\nle\na\nn\ntt\ng\ne\nt\nr\nh\nis:\nng cros\nn\ns se\nN\nan (\n \n=1\nc\n,\nt\ni\n,\no\nn\n,...\n p\n,N\ner\n)\n \n \nnuc\nth\nle\ne\ni\n \n \n \nσ s(θ,φ) = N\nN\n∑anGn(k,Rn)\nn=1\n \n \n \nRn \nG\n P\n*\nth\nn\nosition of the n  nucleus \nIf \nS\n \nGn\nG\no\nn\nm\nG\ne\n*\nn\n \n \n*\n=\ni\nG\ns \nnG\nth\nn\ne\n=\n \nc\n \nomplex  conjugate  of \n  then \n \n< a >=\nde\nfinitions: \nN\nN\n∑an\nn=1\n \n \n \n \n \n \n \n\nThe  expression  for \n  can  be  written \na\n \ns  \nσ s(θ,φ)\nσ s(θ,φ) = N\nN\nN\n∑∑anamGnG*\nm\nn=1 m=1\n \n \n \nB\n \na\ny usin\nw\n \ne\nn\n h\n=\nav\n(\ng  \ne\na\n \nn-< a >)+ < a > \nσ s(θ,φ) =< a2 > -< a\n> + < a\n2 1\n> N\nN\n∑anGn\nn=1\n \n \nSuggested homework: \nShow the expression above \n \n \n \n \n\nT\n \nσ\nh\ns\ne\n=\n sca\n∫\nt\nσ\nter\ns(\ni\nθ\nng\n,φ\n cr\n)\no\nd\ns\nΩ\ns section is  \nT\n \nhen \n4π\n \n \n \nT\nσ = 4π(< a2 > -\nar\nh\ne\ns\ne\n:\n \n \ncoherent  and  inc\n<\noh\na\ner\n>\nent\n)\n \n+\ncro\ns\nπ\ns  s\n<\nec\na\ntio\n>\nn\ns \n \ni.\nC\n \no\nσ\nhe\ncoh\ns\nren\n=\nt \n \n\n \nii.\na\nπ <\n>\nI\n \n \nincoh\nσ\nncoherent \ns\n= 4π(< a2 > -< a\n> )\n \n \n\n(b) N\n \nuclear spi\na\nn\n \nWhy is this   c\n  \naus\n \ne for interference?? \nP\nor\no\ni\nt\ne\ne\nn\nn\nt\nt\na\ni\nt\na\ni\nl\no\n \nn\nn\n o\ne\nf\nu\n t\nt\nh\nro\ne\nn\n s\n‐\np\nn\ni\nu\nn\nc\n v\nle\ne\nu\nc\ns\nto\n \nr\nd\n. \nepends  on  the \n\n \n \nV(r) ∝I\n\n. i\nI\n\n→nuclear\n \nspin\n\n \nC\ni\nha\n→\n\nJ\nn\nneutron spin 1/2)  \nnel\n(\n\n= I\n\n+ i  \n  spin: \n\nJ   is  a  sum  of \n \nI\n\nand  i that  is \nT\n \nhe\nand\n \nJ + =\nr\nI\ne\n+\nfo\nr\n/\ne\n: \n \n \nJ-=\n \nI -1/2 \n\nThe statistical spin factor is given as  \n \n2J\ng(J)\n+1\n= (2i +1)(2I +1)\n \nJ +\n \nF\n \no\n-\nr each \nI\n=\n and  J- we have \ng\n2I +1\n \n \nand\n \ng+\n \nI +1\n= 2I +1 \n \n \n \n \n \n \n \n \n \n\nT\nse\nh\nc\ne\nt\n \nio\ns\nn\np\ns\ni\n \nn\nar\n \ne\nc\n \noherent  and  incoherent  cross \n \ni.\nS\n \nσ\npi\ncoh\ns\nn co\n=\nher\ne\n \nii.\nSpin incohe\nπ\nnt \nren\n(\nt\ng\n \n+a2\n+ + g-a2\n-)\n\n \n \n \nincoh\n4 g-g+(a\na )2\nσ s\n= π\n+ -\n-\n \nE\n \na\nxamp\n5.3\nle for\nfm\n 1H \n \n  \n \na\n24.0 fm\n \n \nwh\n+\ne\n=\nre  \n+ = -\nCalculat\ne:\nfm\n \n=10-13 cm  and  I =1/2 \n \ncoh\nσ\ns\n= ?\nincoh\nσ\ns\n= ?\nσ s = ?\n \n \n           \n           \n \n\nI\nIn\nn\n \ne\nth\nla\ne\ns\n \"\nt\nC\nic\nh\n E\nem\nffe\nic\nc\na\nt\nl\ns\n \n \ne\nerg\ne\nr\nt\ne\nn\nla\nn\ne\ns\ny reg\ng\nic\ny\n \n \na\nl\nn\nev\nd\ne\n i\nl\nn\ns \ne\no\nla\nf \ns\nt\nt\nh\nic\ne\n \n \ne\nta\nff\nr\nects \ni\na\no\nr\nn\ne\ns\n \n\"\nr\n \ne\nth\nla\ne\nt\n \ne\nn\nd\no\n \nt\nt\ni\no\no\n \nn\nt\n \nh\no\ne\nf\n \n \ne\no\nn\nth\ne\ne\nr\nr\ng\nw\ny \nis\nle\ne\nv\n, \ne\nit\nl\n \ns\nis\n \n \nl\ni\ne\nn\na\ne\nd\nla\ns\ns\n \nt\nt\ni\no\nc\n \ng\na\ne\nn\nt\n \n. \ne\nN\nla\no\ns\n \nt\nc\ni\nh\nc \na\ns\nn\nc\ng\na\ne\nt\n \nt\ni\ne\nn\nr\n \ni\nt\nn\nh\ng\ne\n, \n \ndiat\nL\no\net's  examine \n. \np\nR\no\no\ns\nt\ns\na\ni\nt\nm\nb\ni\ni\no\ni\nl\nc\ni\nn\nt\n \nie\nm\ns \no\na\nl\nr\ne\ne\nc\n:\nu\n T\nla\nr\nr\na\n \nt\nn\nh\n(\ns\nE\ne\nl\nn\n \na\ne\nt\ns\ni\nr\ni\no\ng\nm\nn\ny\np\n,\n \n \nl\nV\nL\ne\ni\ne\n \nb\nv\nr\nc\ne\na\na\nls\ns\nt\n)\ni\ne\no\n.\n \n \nn\n \no\n a\nT\nf \nn\nh\nd\na\ne\n \n \n \n \n. \n \n \n\n \n\n \nand\nr =\n \nr\n1 -r 2 \n \nr = r '\n1 -r '\nT\n \nhe redu\nm\nce\n1m\n ma\nss is: \nμ = m1 + m2\n \no\n \n \n(a\nA\n)\nssu\n V\nm\nibrati nal mode: \n \ntogethe\ne\nr\n \n \nt\nb\nh\ny\ne\n a\n  m\nn e\na\nl\ns\na\ns\ns\n \nt\nm\nic\n \n \ns\nand \npring\nm\n s\nu\n \nc\na\n \nF\nh\nr\n \ne\na\n \ns\nb\n \nound \n= -k(x -x0)  \n\n \n \nQuantum -\nd2ψ\ndx 2\n \n\n \nT\n \nhe \n \nene\n \nrgy \n \nlevels will be \n \n \n \n \n \n2m\n+ 2\nClassical\nd2x\n(E\ndt 2\nEn = w(n\n \n+\n= -k(x -x0)\nx = x0 sin(wt + φ)\nk\nw =\nm;\nw = 2\n \nπν\nE0 = 2 w\nE1 = 2 w\nE2 =\nw\nMechanics\n \n \n \n \n \n-2 kx 2)ψ = 0\n2);\nn = 0,1,2,...\n\netc\n \n\n \n(b) Rotational Mode: \n \n \n \n(i)\nE\n \n= 2 m\n1υ1 + 2\n \nm\n2υ 2\nfor\n \nυ1 = wr1\nand\nυ 2 = wr2 \n \nt\n \nhen \nClassical energy of the system \n \n\nE = 2\n \nI w2\nwhere\nI = m r2\n1 + m\n \n2r2\n \nU\n\nr\ns\n\ni\n \n\nThe\n=\nng\n  p\nr\n \nro\n+\nble\nr\nm\n  is\nand\n  reduced\nm\n  t\no\nr1\n  a\n+\n  o\nm\nne\n‐\nr\nbody \n2 = 0\nproblem \n \n \n \n \n \n \n \n \n \n\nThe angular momentum \n \nL = mrυ\nor\nL = mr2w\nor\nL = Iw\nThe rotation energybecomes\nL2\nE = 2I\n \n \n(ii)\nL2 = 2\nQu\nl\na\n(\nn\nl\nt\n+\num\n‐\n)\nmech\nthe\nanics\nenergy\n viewpoint \nwill be :\nE\n=\n\n2I\n \nl(l +1)\nwhere\nl = 0,1, 2,...\n \n \n \n \n \n \n \n\n \nVibrationalRotational Energy Levels \n \n \n \n \n \n \n \n \n\nIn  the  inelastic  scattering  process  the \nv\nin\nib\nst\nr\na\na\nn\nti\nc\no\ne\nn\n)\n \n m\nm\na\no\ny\nd\n \ne\nc\n \nh\no\na\nf  the  system  (a  crystal  for \nc\nn\na\ne\nl\nu\nle\ntr\nd\no\n \nn\na \ns\np\n. T\nh\nh\no\ne\nn\n vib\nnge due to a collision with \nwhere  severa\n. \nr\nI\na\nn\nti\n \no\na\nn\n  m\nal \no\ne\nr\nn\ne\ne\n \nr\nr\ng\ne\ny\na\n \nl\nq\nis\nu\nti\na\nc\nn\n \nt\ns\ni\ny\nz\ns\ne\nt\nd\ne\n \nm\nis\n \n \nc\np\na\no\ns\ns\ne\ns\n \nib\no\nle\nn\n t\ne\no\n \n id\nu\ne\nl\no\n \nn\nnuclei  are  present  it  is  not \nspectrum  (ph\nse\nn\ns\nti\n \nfy\nt\n \nh\nin\ne\nd\n \niv\nc\ni\no\nd\nw\nn\nu\no\ne\nl\nb\n(\na  phono\non n  distri\nc\nu\nt\nπ\np\ni\nν\no\nt\n).\n \nn)\no\n \nf\nu\n \nn.\np\n I\nh\nn\no\n t\nn\nh\no\na\nn\nt \n\nn\ny  a\n \nfu ct on\nsu\n \na\nThe\ni\nall\nw nd \n \nt\ne\n o\nn\nf\ne\n t\nr\nh\ng\ne\ny\n f\n \nrequency \nhe ener\no\n \ng\nf\ny\n a\n s\n \np\np\ne\nh\nc\no\nt\nn\nr\no\nu\nn\nm\n o\n i\nf\ns\n \n \nfr\nf\ne\n(\nq\nw\nu\n)\ne\n \nncy  wis \n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n22.106 Neutron Interactions and Applications\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "MIT22_106S10_lec06c.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/22-106-neutron-interactions-and-applications-spring-2010/538962406e46d2c54b66152f3903af20_MIT22_106S10_lec06c.pdf",
      "content": "Luiz Leal \nOak Ridge National Laboratory \nLe\nE\nc\nn\nt\ng\nu\ni\nr\nn\ne\n \ne\ns\ne\n P\nri\nr\nn\ne\ng\ns\n \ne\nD\nn\ne\nt\np\ned\nar\n a\nt\nt\nm\n the Nu\nMassachusetts Insti\ne\nt\nn\nu\nt\nt\n \ne\no\n \nf \nc\nt\nl\nh\ne\ne\na\n \nr \nTechnology (MIT) \nof \n \n \n \n \n \n \n\nCourtesy of Luiz Leal, Oak Ridge National Laboratory. Used with permission.\n\nThermal Neutron Scattering\nampli\nh\ntu\ne\nd\n \n \np\nK\no\nro\nf\ne\n\nT\ne\n \nc\nr\nt\ne\nh\nn\nd\ne\nu\ne\n \nr\ns\nl\ne\nc\n\n \nD\nc\ne\no\nv\nn\ne\nsi\nl\ns\no\nts\np\n \nm\nof\ne\n \nn\nf\nt\nin\n\nd\n\ning  the \nl\nd\ne\no\na\ni\nd\nn\ns\ng\n \n \nt\ns\no\no\n t\n, \nh\na \ne\nf\n \ne\nd\nw\nif\n \nf\nt\ne\nh\nr\ni\ne\nn\nn\ng\nt\ns\ni\natte\nc\nring  wave  fu ctio\n \na\nw\nl \ni\ns\nn\nll \na\nb\nt\ne\nt\n \ne\na\nr\ns\ni\ns\nn\nu\ng\nm\n cr\ne\no\nd\ns\n: \ns sect\nn\nio\n \nn\nth\n. I\na\nn\nt\n \n \n \n \n(1)\n\nFirst Born approximation; \n \n(2)\n\nFermi Pseudo‐potential; \n(3\n(\n)\nTDS\nT\nE\nim\n)  \ne‐dependent  Schrodinger  equation \n \nThe \ndiscu\nf\ns\ni\ns\nrs\ne\nt\nd\n \n. \nt\nW\nwo\nh\n \ny\na\n a\ns\ns\ns\ns\nu\nu\nm\nm\np\ne\nt\n \ni\nt\no\nh\nn\ne\ns\n T\n  h\nD\na\nS\nv\nE\ne\n \n \nis\na\n e\nlr\nx\ne\np\na\nl\nd\na\ny\nin\n \ne\nb\nd\ne\nf\n \ne\na\nn\ns\n \nollows:  t\n \ne\nth\nig\ne\ne\n \nn\nS\ns\nc\nta\nh\nt\nr\ne\no\nhe  energy  depe\ns\nd\n o\nin\nf \ng\nt\ne\nh\nr\ne\n \n s\ne\nc\nq\na\nu\ntt\na\ne\nt\nr\ni\ni\no\nn\nn\nd\n \nen\np\n \nng \nim\ncy\nsyste\nl\n(\nie\ne\ns\nx\n \npl\nt\ni\nh\nci\na\nt\nt\nl\n \ny)\nt\n \nh\nin\ne \n \nk\ni.e\nn\n.\no\n, \nw\nin\nn\nit\n \ni\na\na\nn\nls\nd\n \n \na\nr\ne\nnd final\nm a e \nven if t\n \nh\ns\ne\nta\ny\nt\n \ne\na\ns\nr\n.\ne\n U\n k\ns\nn\nu\no\na\nw\nlly\nn\n \n \nt\nt\nh\nh\ne\ne\ny\nr\n \nk\na\nn\nre\no\n \nw\nno\nn\nt\n, \n \nl\ne\na\nx\nr\np\ng\nl\ne\nic\n \ni\nn\nt \nu\na\nm\npp\nb\ne\ne\na\nr\nr\n. \na\nI\nn\nt \nce\nis\n o\n  d\nf \ne\nth\ns\ne\nir\n e\ne\ni\nd\ng\n \ne\nt\nn\no\ns\n \nt\n\"\na\nelimi\n \nna\ne\nt\n \ne\nw\n\" \ni\nt\nll\nh\n \ne\na \ntes. \n \n \n \n \n\nIn so doing one uses \n \nE →i ∂ψ\n∂t\n\nor\n-2m\n\n∇+ Vψ = i ∂ψ\n\n∂t\n \n \nL\nd\ne\ne\no\np\n \ne\nV\nn\na\nd\nn\ne\n \nn\nH\nce\no\n \nv\ni\ne\ns\n \n \nchampioned\ntransformation. \nsubsequentl\n \ny\nt\n \nh\nu\ni\ns\ns\ne\n  i\nd\nd\n \ne\nin\na.\n \n \na\nT\n \nh\nF\ne\no\n \nu\nti\nr\nm\nie\ne\nr \n \n \n \nt =\nAs\nt\ns\num\n\ni\nr\nn\n\ng  th\nt\na\n>\nt \nt\nt\nhe  interaction  occurred  at \n. The wave function at the detector at the \np\n \nosi\n\nti\non \nfor \n is a solution of the equation \n-\n2m\n\n∇+ V(r ,\nr\nt)\n\n∂ψ(, t)\n\nψ (r ,t) = i\n\n∂t\n \n \n   \n \n \n \n\nFor \n  before  the  collision  has  occurred \nthe incident‐neutron wave function is \n \nt < t0\nt\nψinc(r , t)\ni(k\n\n.r w\n)\n= e\n-\nwhere\n\nk →neutron momentum\n\n \nw0 →neutron energy\n \n \n \nThe solution at the detector at \n \n(r ,t) is \n\"\n \n(! r ,t) =\"\n!\ninc( r ,t) +\"scat(! r ,t)  \nf\n \nro\nG\nm\niv\n \ne\nth\nn\ne\n \n \nt\np\nh\no\na\nt\nt\ne\n f\nn\no\nt\nr\nia\n t\nl\nh\n r\ne\ne\n \ng\nin\nio\nc\nn\nid\n \nent wave ψinc  away \n \n \n \n\n2m\nr\n∇+ i ∂ψ( ,t)\n\n∂t\n\n(r\n \n\nψ inc\n,t) = 0\n\n \nthen\n \n \n2m\nr\n∇+ i ∂ψ( ,t)\n\n∂t\n\n(r\nr\n \n\nr\n\nψ scat\n,t) = V( ,t)ψ(,t)\n\nApproximat\n \n \n \n(a)\nBorn appro\nio\nxi\nn\nm\ns\nat\n:\ni\n \non \nψ\nIn \nr\nth\n\n \n( ,\ne\nt\n r\n)\nig\n→\nht‐h\nψ\nand\ninc\n si\n(\nde\nr\n o\n,\nf\nt\n t\n)\nhe above equation: \n \n \n \n \n \n \n \n \n \n\n(b)\nVn(r , t)\n2π2\n=\nm\n\nanδ[r\n\n-R n(t)]\nwhere\n\nR n →position of nucleus n at time t\nan →bound scattering related to the bound cross section as\nσ b = 4πa2\nn\n(a2\nσ\nn =\nb\n4π\n \n \nH\n \n∇\nen\nc\n+\ne \nth\nmi\ne equation to b\n)\ne solved is \n\n∂\n∂t\n \n\n(r ,\n\nψ\n\nscat\nt) = 4π∑\n\na δ[(r R (t )]\nr\n-\nψ\n( ,t)\nN\n\n \nthe \note that \n\n \nRn(t0)\nt =\n.\n is for reactio\n\nn\nn\ns th\nn\nat occur\nn\nred\n at \ninc\n\n \nso\nM\nlv\na\ne\nk\n t\ni\nh\nn\nt\ne\ng\n \n \ne\nu\nq\ns\nu\ne\na\n o\nti\nf\no\n t\nn\nh\n \ne\na\n \nb\nG\no\nr\nv\ne\ne\ne\n.\nn\n L\n's\ne\n function method to \nGr\n \ne\n∇\nen's\n+\n fu\nn\nmi\nction, hence: \nt  G(r -r ',t -t0) be the \n\n∂\n∂t\n\nG(r r ',t\n\n-\n-\n=\n\nt0)\n4πδ\n\n(r -r ')δ(t -t0)\n\nFermi Pseudo‐potential \n \n\nThe solution for \n is \nψ\n \nψscat(r ,\n\nt)\n   \n(r , t) = ∫∫dτ dt G(r -r ',t -t )ψ\n(r\n\nw\nscat\nhere \nis the volu\ne\n',t )\nanδ\n \n[r -\nm .\ninc\n0 ∑\nR n(t0)]\n\nτ\nt0\nn\nSubst\nτ\nψ\nitu\nψ\n \ninc\n(\n w\nr ,\ne\nt)\n h\n=\na\nt\nv\ni\ne\nn\n \ng the values for \n\nG(r -r ',t -t0) and \nm\nscat\ni 2π\n\nt\n\n∫dt0(t -t0)3/2∑an ∫dτδ[r -R n(t0)]×\n-inf\nn\nim\nexp 2\nr\n-r '\n(t -t0)\n\n \n\n× exp[i(k .r -w t)]\n  Th\n\ne  ab\nr\no\n\nve  e\n\nxpression\nψscat\n  is  the\n  solution  for  the \ns\np\nc\no\na\ns\nt\ni\nt\nt\ne\nio\nre\nn\nd \nf\nw\nor\na\n \nv\nt\ne\nh\n \ne  tim\n \ne \nat  the  detecto\n \nr \nneutron o\n  for  an in\na\nc\nt\ni\n \nde\nth\nn\ne\nt \n \nf\nn\nr\no\no\nt\nm\n c\n \nle\nth\na\ne\nr\n \n h\nf \no\ne\nw\nne\n t\nr\nabove\no\ng\n \ny\no\n \nb\n\ntai\nn th\nt\ne\n>\nw  and \n \nm\ns\nt\nc\no\na\nm\ntt\ne\ne\nn\nre\ntu\nd\nm\n am\n \np\n\nk\n\nli\n. \nt\nI\nu\nt\nd\n i\ne\ns \n \nu\ntr\np  with  a  cle\n \na\ne\nv\nq\ne\nu\nr \nat\ni\ni n\n \nd\no\nL\nf \nea\n. \nansform o the type \n  o\ne\nf\no\n \nn\nu\n V\nsi\na\nn\nn\ng\n \n \nH\na\no\n \nv\nF\ne\no\n c\nu\na\nr\nm\nie\ne\nr \n \n \n\nr\nψscat( , t) =∑f (r , w')eiw't\nw '\nand\nf (r ,\nw') =\n\nT\nT\n∫dteiw'tψscat(r , t)\n \n \n \n\na\nf\nm\n(\np\nr\nli\n,\ntu\nw\nde\n)\n.\n \n \nrelates  to  the  scattered  wave \n \nA\n \nfter LOTS OF ALGEBRA \nf (r , w')\n=\n\nTr'\nT\n \n∫dt eiw't0\na\nd\n[r\n∑\n∫\nR (t )]ei\nκ .\nτδ\n-\nF\nT\no\nh\nr\ne\n \nrm\nde\na\nr\nl \ni\nN\nva\ne\nt\nu\nio\ntr\nn\no\n \nn\no\nn\nn S\nf\nc\n \na\nt\nt\nh\nte\ne\nr\n \nin\na\ng\nb\n \no\nb\nv\ny\ne\n E\n \nn\ne\ng\nq\ne\nu\nl\na\nst\nt\na\nio\nff\nn\n p\n \na\ns\ng\nee\nn\n: \n‐52 \nes \n \n \n \n \n\nThe scattered neutron has \n \n\nκ = k\n\n0 -k →momentum change\n\n \n \nw'= w0 -w →energy change\n \nT\nde\nh\nf\ne\nin\n \ne\ns\nd\nc\n \na\na\nt\ns\nt\n \nering  differential  cross  section  is \n \nd2σ\ndEdΩ\n\n= r' T\nh\nυ\nυ 0\nf (r ,w)\n \nR\nυ\ne\nad\nand\n:  T\nυ initial\nTheory A\nh\nn\ne\nt\n \nho\nElement\nand\n  o\nneutron velocity\nny Fode\ns\nfinal\n \nf (r ,w)\nraro\nf \n p\nN\na\ne\ng\nu\ne \nt\nro\nn\n \n  \nInteraction \n\n= T 2r'2\n+inf\n∫d e iw ∑a* a ∫dr \" ∫dr ei .(\nτ\n-\nτ\nκ r r\n-\")\nm\nn\n×\n-inf\nm,n\n[r\n\n\"\n\nδ\n-R n(0)] [r\n\nδ\n-R n(τ)]\nTh\n \ne bar indicates time averaging. \n \n\n \nThe double differential cross section is finally \no\n \nb\nd\nta\n2σ\nined as \ndEdΩ\n\n= h\nυ\nυ 0\n+inf\n∫dτ e-iwτ\na*\nman ∫dr\n∑\n' ∫dr ei\nκ .r\n×\n-inf\nm,n\n[r \"\n\nR (0)\nr\nδ\n-\nn\n-]δ[r\n\n-R n(τ)]\n \nT\n \nhe  SpaceTime  Correlation  Function  (Van \nHove) \nG(r , τ)\n=\n\nN ∑∫dr'δ[r '\n\n-R n(0)\n\n-r ]\n\nδ[r -R n(τ)]\nm,n\n\n \n \nI\nG\nnte\n(\nr\nr\np\n,\nr\nτ\net\n)\nat\nis\nion\nnot\n of th\nthe\ne\nGreen's function!!\nT\n \n \n \n \nwo\nm\n pa\n=\nrts\nn\n:  \nG(r , τ)\nf\nf\no\no\nr\nr\n \n  m =n\n (\n \nd\n(o\nia\nff\ng\n‐\no\nd\nn\nia\na\n \ng\nl \no\nt\nn\ner\na\nm\nl t\ns\ne\n)\nr\n \nm\nG\ns\n(\n)\nr ,\ns\nτ)  \n \nG (r\nd\n,τ) \n \n\nI\n \nG\nnt\ns\ne\n(r\nrpretation: \n\n \nI\nG\nD\nd\nE\n(\nN\n,\nr\nT\nτ) →\n, τ\nIC\n)\nAL \nself\nnucle\n-\nu\ncorrelation\ns is present \nfunction:  a  second \n\ns\n \nG\nec\ncorrelation\n(\no\nr\nn\n→distinct -\n, τ\nd\n)\n D\n=\nIS\nG\nT\ns\nI\n(\nN\nr\nC\n, τ\nT\n)\n n\n+\nuc\nG\nle\nd\nu\n(\ns\nr\n \n,\ni\nτ\ns p\n)\nresent\nfunction\n \n: \na \n \n \nw\n \nhere \nGs(r , τ)\n=\n\nN\nN\n \n\ndr'δ[r '\n\n-R n(0)\n\n-r ]δ[r\n\n∑∫\n-R\nand\nn(τ)]\n \nn=1\n \nGd (r , τ)\n=\n\nN\nN\n \n\ndr'δ[r '\n\n∫\n-R (0)\n\n-r ]δ[\n\n∑\nr -R (τ)]\nD\n \n<\ne\na\nfi\nni\n>=\nng \nn\nn\nm=n=1\nN ∑a*\nmanδmn\nm,n\n \n\n \n< a\n> = N 2\n \n∑a*\nman\nm=n\n \n \nd2σ\ndEdΩ\nd2σ\n=\ncoh\ndEdΩ\nd2σ\n+\nincoh\ndEdΩ  \n \nAssu\ne\nm\n \npres n\ni\nt\nn\n, i\ng\n.e\n \n., \no\n<\nn\na\nly\n>=<\ncoh\na\ne\n>\nre\n2=\nnt\na\n \n \ninelastic  scattering \nd2σ\ndEdΩ\nd2σ\n=\ncoh\ndEdΩ  \n \n \nd2σ\ndEdΩ\na2\n= h\nυ\nυ 0\n \n∫∫dr d ei(\nτ\nκ .r -w'τ )G(r ,τ)\n \nRecall that  \n\na2\nσ\n=\nb\n4π\nand\nυ\nυ 0\nE\n=\nE0\n \nd σ\ndEdΩ\nσ\n=\nb\n4π\nE\nE0\nS (\nκ ,w')\n \n \nw\n \nS\nh\n(\ne\n\nr\n\nκ ,\ne\nw\n \n')\n=\n\nh\n \n∫\ndr\n∫\ndτ ei(\nκ .r -w'τ )G(r , τ)\nS\n \n \n(κ , w') →Scattering Law  \nκ\n\n \n \nS ( , w') \ncan \nb\nd\ne \n2σ\ndEdΩ\nobtained \ndirectly \nfrom \nmeasurements of  \n \n\nProperties of \n \n \n(a)\nS (\nκ ,w')\ns\n\ncatt\nD\ne\ne\nr \np\nc\ne\ne\nn\nn\nd\nte\ns\nr\n \n \nonly  on  the  dynamics  of  the \n \n \n(b)\nSu\n\nm ruler \nw S (\nκ ,w)dw\nκ 2\n=\n\n2M\n \n∫\n \n(c)\nb\n\nalan\nC\nc\no\ne\nn\n \ndition  derived  from  the  detailed \n\n \nS\n\n(\nw\n-κ ,w-) = e\n-KT\n \nS (\nκ ,w) \n \n \n \n \n \n \n \n \n \n\nD\n \nefinitions: \nS (\nκ ,w)\nβ\n= e\n-2\n \nS(α,β) \nW\n \nhere \n2κ 2\nα =\n\n2mAKT\nE\nand\n-E0\nβ =\nKT\n \n \n\nS\n \nκ\nin\n\nc\n=\ne \n \nk\n\n0 -k\n\n→\nκ 2 = k 2 + k 2 -2k\n\n0. k\n\ncosθ\n2κ 2\nα =\n\n2mAKT\n2(k 2\n0 + k 2 -2k\n\n0. k\n\ncosθ)\n=\n2mAKT\nE0 + E -2 EE0\nα =\n \ncosθ)\nAKT\n \n \n \n \n \n \n\nHence\nbecom\n \nes\nt\n \nhe  double  differential  cross  section \n \n \nd2σ\ndEdΩ\nσ\n=\nb\n4πKT\nE\nE0\nβ\ne\n-2S(α,β)\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\nNotations:\n \n \nd2σ\ndEdΩ\nor\nσ s(E0 →E,θ)\nor\nσ s(E0 →E,μ)\nwhere\nμ = cosθ\n \n \n \n \n\n \nS\n \n(1\ni\n)\nmple Example: \n\nScatter\n \nO\n\nnly cohere\ner\nnt\n \n \ni\ns\ns\nc\n \na\na\nt\n \nt\ns\ne\ni\nr\nn\nin\ngl\ng\ne\n i\n \ns\nn\n a\nu\nc\nc\nc\nle\no\nu\nu\ns\nn\n \nt\no\ne\nf\nd\n \n \nm\nfo\na\nr\ns\n; \ns  M. \n \n(2)\nScatterer is free and at rest \nT\nth\nh\ne\ni\n \ns \nt\nc\nh\no\ne\nr\no\nr\nr\ne\ny\ns\n \np\no\no\nf\nn\n \nd\ne\nh\nh\nn\ns to \nc emical region ef\nu\nt\nfe\ntr\nc\no\nts\nn\n a\n \ne \nm\nsi\no\nt\nd\nu\ne\na\nr\nti\na\no\nt\nn\nio\n \nn\nd\n \ne\nw\nalt\nh\n \ne\nw\nre\nit\n \nh\nt\n \nh\nin\nre negligible. \ne\n \n \n \nσ s(E0 →E,μ)\nσ\n=\nb\n4π\n\nE\nE0\nS (\nκ ,w)\nμ = cosθ\n \n \n \n \n \n \n \n\n \nκ\nS ( , w')\n\n  is a delta function\nE\n a\ns \nE\nS (κ ,w) = δ(\nE -E\n+\n-(EE\n+\n0)1/ 2μ\nA\n\n)\nM\nμ = cosθ\nand\nA = m\n \nR\n \n\ne\nw\ncall\n→\n that\nE\n \n0 -E\nκ\n2M\nE0 + E -2(EE0)1/ 2μ\n→\nA\n \n \nA\n \nd\nls\nΩ\no, \n= 2π sinθ dθ\nμ = cosθ\ndμ = -sinθ dθ\ndΩ = 2π(-dμ)\n \n\n \nand\n \nσ s\n \n \n(E0 →E) = ∫σ s(E0 →E,μ)dΩ\n4π\n \nσ s(E0 →E)\n-1\n \n= 2π ∫σ s(E0 →E,μ)dμ\n+\n \n \nσ s(E0 →E) = 2\nσ\nπ\nb\n4π\nE\nE0\n\n/ 2\nE0 + E\n\nδ(E\n-2(EE0)1/ 2μ\n0 -E +\n\nA\n \n-1\nC\n \nhange of variable\nE\ns \n∫\n)dμ\n+1\nx = E0 -E\n0 + E -2(EE0)1/ 2μ\n+\nA\nsuch that\n2(EE\ndx = -\n0)1/ 2\nA\ndμ\n \n\n(\nμ = ±1\nE\n1/2\n→x= E0 -E\n0 E\n1/2)\n+\n\nA\n \n \nσ s(E0 →E) = 2\nσ\nπ\nb\n4π\nE\nE0\n\n/ 2\nA\n\n2(E0E)1/ 2\nx\n∫\n+\n \nδ(x)dx\n \nx-\n \n \nσ s(E0 →E)\nσ\n=\nb\nA\nE0\n \n \nR\n \necall that \nA +1\nσ b =\nA\n\nσ free\n\n \n \n\n \n(\nσ s(E0 →E)\nA +1)2\n=\n4A\nE0\n \nσ free\n \n \n \nA\nif\n-1\nα = A +1\n\n4A\n\n→\n1-α =\n\n(A +1)2\nhence\nσ s(E0 →E) = (1-α)E0\nσ\n \nfree\n \n \n\nEnergy\nrange?\nA2\nE\n+ 2Aμ +1\n=\n(A +1)2\nE0\nμ =1\n→\nE = E0\nμ = -1\n→\nE = (1-α)E0 \n \n \n \n\n(1-α)E0\nσ s(E0 →E) =\n\nσ free\nfor\n(1-α)E0 <\n<\n\nE\nE0\n\n \n\notherwise\nH\n(N\nam\nuc\ni\nl\nl\ne\nto\na\nn\nr \n pa\nR\ng\ne\ne\na\n \nc\nt\no\n)\nr  Analysis  Duderstadt  and \n \n \n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n22.106 Neutron Interactions and Applications\nSpring 2010\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "MIT22_106S10_lec07.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/22-106-neutron-interactions-and-applications-spring-2010/dc78537df1e165773d9cc6cb73be5c1f_MIT22_106S10_lec07.pdf",
      "content": "Lecture 7\nNeutron Detection\n22.106 Neutron Interactions and Applications\nSpring 2010\n\nTypes of detectors\n- Gas-filled detectors consist of a volume of gas\nbetween two electrodes\n- In scintillation detectors, the interaction of\nionizing radiation produces UV and/or visible\nlight\n- Semiconductor detectors are especially pure\ncrystals of silicon, germanium, or other materials\nto which trace amounts of impurity atoms have\nbeen added so that they act as diodes\n\nTypes of detectors (cont.)\n- Detectors may also be classified by the type of\ninformation produced:\n- Detectors, such as Geiger-Mueller (GM) detectors,\nthat indicate the number of interactions occurring in\nthe detector are called counters\n- Detectors that yield information about the energy\ndistribution of the incident radiation, such as NaI\nscintillation detectors, are called spectrometers\n- Detectors that indicate the net amount of energy\ndeposited in the detector by multiple interactions are\ncalled dosimeters\n\nModes of operation\n- In pulse mode, the signal from each\ninteraction is processed individually\n- In current mode, the electrical signals from\nindividual interactions are averaged\ntogether, forming a net current signal\n\nInteraction rate\n- Main problem with detectors in pulse mode is\nthat two interactions must be separated by a\nfinite amount of time if they are to produce\ndistinct signals\n- This interval is called the dead time of the system\n- If a second interaction occurs in this interval, its\nsignal will be lost; if it occurs close enough to the\nfirst interaction, it may distort the signal from the\nfirst interaction\n- Show figure p.120\n\nDead time\n- Dead time of a detector system largely\ndetermined by the component in the series with\nthe longest dead time\n- Detector has longest dead time in GM counter\nsystems\n- In multichannel analyzer systems the analog-to-digital\nconverter often has the longest dead time\n- GM counters have dead times ranging from tens\nto hundreds of microseconds, most other\nsystems have dead times of less than a few\nmicroseconds\n\nParalyzable or nonparalyzable\n- In a paralyzable system, an interaction\nthat occurs during the dead time after a\nprevious interaction extends the dead time\n- In a nonparalyzable system, it does not\n- At very high interaction rates, a\nparalyzable system will be unable to\ndetect any interactions after the first,\ncausing the detector to indicate a count\nrate of zero\n\nF\ni\ngure illu\nstrating\nparalyzable\nand nonparaly\nzable\nsystems.\nImage by MIT OpenCourseWare.\n\nGraph showing in\nteract\nion an\nd coun\nt rate\nfor p\na\nralyzable\na\nnd n\nonpa\nraly\nzabl\ne syst\nems.\nImage by MIT OpenCourseWare.\n\nCurrent mode operation\n- In current mode, all information regarding\nindividual interactions is lost\n- If the amount of electrical charge collected from\neach interaction is proportional to the energy\ndeposited by that interaction, then the net\ncurrent is proportional to the dose rate in the\ndetector material\n- Used for detectors subjected to very high\ninteraction rates\n\nSpectroscopy\n- Most spectrometers operate in pulse mode\n- Amplitude of each pulse is proportional to the\nenergy deposited in the detector by the\ninteraction causing that pulse\n- The energy deposited by an interaction is not\nalways the total energy of the incident particle or\nphoton\n- A pulse height spectrum is usually depicted as a\ngraph of the number of interactions depositing a\nparticular amount of energy in the spectrometer\nas a function of energy\n\nSli\nde\n- G\nraphs showin\ng e\nner\ngie\ns\nfrom spectroscopy as\na func\ntion of\ninteraction\ns a\nnd\nrel\nati\nve\nnum\nber\n\nof\nphotons.\nImage by MIT OpenCourseWare.\n\nDetection efficiency\n- The efficiency (sensitivity) of a detector is\na measure of its ability to detect radiation\n- Efficiency of a detection system operated\nin pulse mode is defined as the probability\nthat a particle or photon emitted by a\nsource will be detected\n\nefficiency\n\nIntrinsic\n\nefficiency\n\nGeometric\n\nEfficiency\ndetector\n\nreaching\nNumber\ndetected\nNumber\n\nemitted\nNumber\ndetector\n\nreaching\nNumber\n\nEfficiency\nemitted\nNumber\ndetected\nNumber\n\nEfficiency\n×\n=\n×\n=\n=\nF\ni\ng\nu\nre illustrating efficiency as a function of geometric efficiency and intrinsic efficiency.\nImage by MIT OpenCourseWare.\n\nGas-filled detectors\n- A gas-filled detector consists of a volume of gas\nbetween two electrodes, with an electrical\npotential difference (voltage) applied between\nthe electrodes\n- Ionizing radiation produces ion pairs in the gas\n- Positive ions (cations) attracted to negative\nelectrode (cathode); electrons or anions\nattracted to positive electrode (anode)\n- In most detectors, cathode is the wall of the\ncontainer that holds the gas and anode is a wire\ninside the container\n\n-\nOuter shell is a metal cylinder made of either Steel or Aluminum\n- Filled with a gas\n-\nInner wire is gold plated tungsten\n- Tungsten provides strength to the thin wire\n- Gold provides improved conductivity\nSchemati\nc of ga\ns-fileld\ndetector\n.\nImage by MIT OpenCourseWare.\n\nTypes of gas-filled detectors\n- Three types of gas-filled detectors in common\nuse:\n- Ionization chambers\n- Proportional counters\n- Geiger-Mueller (GM) counters\n- Type determined primarily by the voltage applied\nbetween the two electrodes\n- Ionization chambers have wider range of\nphysical shape (parallel plates, concentric\ncylinders, etc.)\n- Proportional counters and GM counters must\nhave thin wire anode\n\nIonization Counter\n- Ionization region\n- All electrons are\ncollected\n- Charge collected is\nproportional to the\nenergy deposited\n- Called ion chambers\nGrap\nh il\nlus\ntra\ntin\ng a\nppli\ned\nv\noltage vs. pulse height for io\nnization counte\nr.\nImage by MIT OpenCourseWare.\n\nIonization chambers\n- If gas is air and walls of chamber are of a\nmaterial whose effective atomic number is\nsimilar to air, the amount of current produced is\nproportional to the exposure rate\n- Air-filled ion chambers are used in portable\nsurvey meters, for performing QA testing of\ndiagnostic and therapeutic x-ray machines, and\nare the detectors in most x-ray machine\nphototimers\n- Low intrinsic efficiencies because of low\ndensities of gases and low atomic numbers of\nmost gases\n\nProportional Counter\n- Proportional region\n- Electric field is strong\nenough to create\nsecondary ionization\n- Further increases\ncreate more ionization\nin the gas\n- Avalanche ionization\n- Charge collected is\nlinearly proportional to\nenergy deposited\nGrap\nh il\nlus\ntra\ntin\ng a\nppli\ned\nv\noltage vs. pulse height for io\nnization counte\nr.\nImage by MIT OpenCourseWare.\n\nAvalanche Ionization\nFigure sho\nwing avalanche ionization.\nImage by MIT OpenCourseWare.\n\nGM Counter\n- Geiger-Mueller region\n- Saturation of the\nanode wire\n- Avalanche over the\nentire wire\n- Cannot be used for\nhigh count rate\napplications\nGrap\nh il\nlus\ntra\ntin\ng a\nppli\ned\nv\noltage vs. pulse height for io\nnization counte\nr.\nFigure\nshowing\nthe satur\nation of\nthe anode\nwire.\nImages by MIT OpenCourseWare.\n\nGM counters\n- GM counters also must contain gases with\nspecific properties\n- Gas amplification produces billions of ion pairs\nafter an interaction - signal from detector\nrequires little amplification\n- Often used for inexpensive survey meters\n- In general, GM survey meters are inefficient\ndetectors of x-rays and gamma rays\n- Over-response to low energy x-rays - partially\ncorrected by placing a thin layer of higher atomic\nnumber material around the detector\n\nGM counters (cont.)\n- GM detectors suffer from extremely long dead\ntimes - seldom used when accurate\nmeasurements are required of count rates\ngreater than a few hundred counts per second\n- Portable GM survey meter may become\nparalyzed in a very high radiation field - should\nalways use ionization chamber instruments for\nmeasuring such fields\n\nNeutron Detection\n- Neutral particles\n- Detection is based on indirect interactions\n- Two basic interactions\n- Scattering\n- Recoiling nucleus ionizes surrounding material\n- Only effective with light nucleus (Hydrogen,\nHelium)\n- Nuclear reactions\n- Products of the reaction can be detected (gamma,\nproton, alpha, fission fragments)\n\nNeutron Detection\n- Since x.s. in most materials are strongly\ndependent on neutron energy, different\ntechniques exist for different regions:\n- Slow neutrons (or thermal neutrons), below\nthe Cadmium cutoff\n- Fast neutrons\nGra\nph\nsho\nwin\ng e\nner\ngy v\ns. c\nross\nsec\ntion\n(Ne\nutro\nn De\ntect\nion)\n.\nImage by MIT OpenCourseWare.\n\nThermal Neutron Detectors\n- Two important aspects to consider\n- Find a material with large thermal x.s.\n- Find an arrangement that allows you to\ndistinguish from gamma rays\n- High Q-value of neutron capture will make it easier\nGra\nph\nsho\nwing\nneu\nt\nron\nen\nerg\ny v\ns.\ncro\nss-\nse\nc\ntion\n(Thermal Neutron D\netectors).\nImage by MIT OpenCourseWare.\n\n10B(n,alpha)\n- Equations\n- 94% of the time in excited state\n- Q-value of 2.310 MeV\n- Other 6%, Q-value of 2.792 MeV\nFigu\nres s\nh\no\nwing alph\na ki\nneti\nc\n\nenergy.\nImage by MIT OpenCourseWare.\n\nBF3 Tube\nFigu\nr\nes s\nh\nowin\ng\nalp\nh\na kinetic energy.\nFigures showing the energy deposited in d\netector.\nImage by MIT OpenCourseWare.\nImage by MIT OpenCourseWare.\n\nEfficiency of BF3 Tube\n- Intrinsic efficiency\n- Eff(E) = 1- exp(-Sigma(E) * L)\n\n6Li(n,alpha)\n- Equation\n- Only a ground state exists with Q-value of\n4.78 MeV\n- EHe-3 = 2.73 MeV and Ealpha = 2.05 MeV\n- Other possible reactions\n- 3He(n,p)\n- 157Gd\n\nGamma-ray sensitivity\nTable showing neutron an\nd gamma-ray interaction\nprobabilities in typical g\nas proportional count\ners and scintillators.\nImage by MIT OpenCourseWare.\n\nFission chambers\n- Inner surface of gas tube is coated with a fissile\nmaterial (U-235)\n- Current mode in reactor operation\n- Pulse mode elsewhere\n- Efficiency of about 0.5% at thermal energies\n- Combine fissile and fertile material to avoid loss\nof sensitivity (regenerative chambers)\n- Memory effect when used in high flux regions\n- Decay of FPs\n\nFission Chambers\nGra\nphs\nsh\now\ni\nng\ne\nne\nrg\nies\nin\nFis\nsion Chamber\ns.\nImage by MIT OpenCourseWare.\n\nNeutron Spectroscopy\n- Bonner Sphere\nDi\nag\nra\nm\nsho\nwin\ng sphere\ns in the\nBonner Sphere Spectrometer experiment.\nImage by MIT OpenCourseWare.\n\nLong Counter\n- Flat response for neutrons of all energy\nFigures\nsho\nwing flat response for neutrons\nof\nall\nenergy.\nImage by MIT OpenCourseWare.\n\nFast-Neutron induced reaction\ndetectors\n- 6Li(n,alpha)\n- Q-value of 4.78 MeV\n- Peaks appear at Q-value + neutron kinetic\nenergy\n- Lithium based scintillators\nEnergy\nvs. cros\ns secti\non for\nfast ne\nutron i\nn\nd\nu\nc\ne d r e\na\nc\nt i o n d\ne\nt\ne c t o r s\n.\nImage by MIT OpenCourseWare.\n\n- 3He(n,p)\n- Energy range 20 keV to 2 MeV\n- Smooth, nearly flat x.s.\n- Tube is wrapped in Cadmium and Boron layersto\nreduce contribution from thermal neutrons\n- Lead shield is also added to reduce impact of\nphotons\n- Intrinsic efficiency is very low (0.1%)\n- Full energy peak at En + 765 keV\n- Thermal neutron capture peak at 765 keV\n- Elastic scattering spectrum with a max at 0.75En\n\nEnergy ra\nnge for fast n\neutron\ni\nnd\nuc\ned\nreaction\ndete\nctors.\nImage by MIT OpenCourseWare.\n\nFast Neutron Recoil Detectors\n- Most useful reaction is elastic\nscattering\n- Recoil nucleus will ionize medium\n- Most popular target is hydrogen\n- Large elastic scattering x.s\n- Well known x.s.\n- Neutron can transfer all of its energyG\nr\na\np\nh\n\nc\nh\nart\ni\nng\nne\nutron energy vs s\ncatte\nred\nc\nross section for fas\nt neutron recoil detectors.\nin one collision\n- Q-value is zero\n- Information can be found about the\nincoming neutron energy\nImage by MIT OpenCourseWare.\n\nGas recoil detectors\nInc\nide\nnt\nneu\ntro\nn e\nner\ngy graphs for gas recoil det\nectors.\nImage by MIT OpenCourseWare.\n\nScintillators\n- Desirable properties:\n- High conversion efficiency\n- Decay times of excited states should be short\n- Material transparent to its own emissions\n- Color of emitted light should match spectral sensitivity\nof the light receptor\n- For x-ray and gamma-ray detectors, μ should be large\n- high detection efficiencies\n- Rugged, unaffected by moisture, and inexpensive to\nmanufacture\n\nScintillators (cont.)\n- Amount of light emitted after an interaction\nincreases with energy deposited by the\ninteraction\n- May be operated in pulse mode as\nspectrometers\n- High conversion efficiency produces\nsuperior energy resolution\n\nMaterials\n- Sodium iodide activated with thallium\n[NaI(Tl)], coupled to PMTs and operated in\npulse mode, is used for most nuclear\nmedicine applications\n- Fragile and hygroscopic\n- Bismuth germanate (BGO) is coupled to\nPMTs and used in pulse mode as\ndetectors in most PET scanners\n\nPhotomultiplier tubes\n- PMTs perform two functions:\n- Conversion of ultraviolet and visible light\nphotons into an electrical signal\n- Signal amplification, on the order of millions to\nbillions\n- Consists of an evacuated glass tube\ncontaining a photocathode, typically 10 to\n12 electrodes called dynodes, and an\nanode\n\nFigure sho\nwing the c\nonversion\nof visible\nlight ph\noton i\nnto an electr\nical s\nignal.\nImage by MIT OpenCourseWare.\n\nDynodes\n- Electrons emitted by the photocathode are\nattracted to the first dynode and are accelerated\nto kinetic energies equal to the potential\ndifference between the photocathode and the\nfirst dynode\n- When these electrons strike the first dynode,\nabout 5 electrons are ejected from the dynode\nfor each electron hitting it\n- These electrons are attracted to the second\ndynode, and so on, finally reaching the anode\n\nPMT amplification\n- Total amplification of the PMT is the product of\nthe individual amplifications at each dynode\n- If a PMT has ten dynodes and the amplification\nat each stage is 5, the total amplification will be\napproximately 10,000,000\n- Amplification can be adjusted by changing the\nvoltage applied to the PMT\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n22.106 Neutron Interactions and Applications\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT22_106S10_read01.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/22-106-neutron-interactions-and-applications-spring-2010/1abdfbe26e52b2652fa181ab81e33edd_MIT22_106S10_read01.pdf",
      "content": "G\n \n \nSo\nree\nn\nn\n \n's\nL{\nlu\ny\nti\n(\no\nx)}\nfor\n \n \nF\nth\nu\ne \nn\nfo\nc\nllo\nt\n= f (x)\nw\nio\nin\nn\ng \n \nprobl\nfor\nem: \na ≤x ≤b\nand boundary condition\n \n \nB{y(x)} = y(a) = 0\nP\n \nL\nro\n{\nb\nG\nlem\n(x\n's\n,\n G\nξ\nr\n)\ne\n}\nen\n=\n fu\nδ\nnc\n(\nti\nx\non\n-\n \nξ)\nsubject\nto\nG(a,ξ) = 0\nor\nB{G(x,ξ)} = 0\n \n \n\nSolution for  y(x)\nG(x,ξ)\ny(x)\nb\n= ∫G(x,ξ) f (ξ)dξ\n \n \nProve: \na\nb\n\nL{y(x)} = L ∫G(x,ξ) f (ξ)d\n \nξ\na\n\nb\n\nL{y(x)} = ∫L{G(x,ξ)} f (ξ)dξ\na\n\nb\n\nL{y(x)} = ∫\n \nδ(x -ξ) f (ξ)dξ\na\n\n \nL{y(x)} = f (x) \n \n \n including \n is \n \n\nFor the boundary condition: \n \nb\n\nB{y(x)} = ∫B{G(x,ξ)} f (ξ)dξ\na\n\n \nB{y(x)} = 0\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \nGreen's Function Solution for the \n \nScattering Problem \n\n (∇2 + k 2)G(r ,r ') = δ(r -r ')\n\n \nDefining R\n\n= r -r '\n\nFourier Transform of G(R )\n\nG(R ) =\n\n(2π)3/ 2\ng(\n\nK )e-i\n\nK .\n\nR\nτ∫\nd\n\nK\n \nRecall that the Dirac δ(\n\nR )can be represented as \n \nδ(\n\nR ) =\n(2π)3\ne-i\n\nK .\n\nR\nτ∫\nd\n\nK\n \n \n\nis the Fourier transform of \n \n \nK\n\ng(\n\n)\nG(R\n\n \n)\n(\n∇+ k 2)\n\n(2π)3/2\nK\n\n∫g(K\n\n)e\n\n-iK .R d\n\n=\nτ\n(2π)3\n \n∫e\n\n-iK .R d\n \nτ\n(\n-K\n\n+ k )g(K ) =\n\n(2π)3/2\nor\n \n \ng(K\n\n)\n= -\n\n(2π)3/2\nK 2 -k 2\n \nThen \n \nG(R\n\n) becomes, \n\nK\n\nG(R ) = -\n\n(2π)3\ne-i\n\nK .\n\nR\nK 2 -k 2\nτ∫\nd\n\nK\n \nThe integral is performed in spherical coordinates \nin the volume τ where \n \nd\n\nK →K 2dK dφsinθ dθ  \n \nThe range of integration is \n \n0 ≤φ ≤2π\n0 ≤θ ≤π\n0 ≤K ≤inf \n \nThe integral in G(\n\nR ) becomes \n \nG(\n\nR ) = -\n(2π)3\nK 2dK\ninf\n∫\ndφ\ne-iKR cosθ\nK 2 -k 2\nπ\n∫\n2π\n∫\nsinθ dθ\n \n\nG(\n\nR )\n= -\n\n(2π)3\nK 2dK\nK 2 -k 2\ninf\n∫\n(2π) 2sinKR\nKR\n \n\n \n \nThe function \n\nf (K)\nsinKR\n=\nK\nK 2 -k 2  \n \ni\n \ns eve\n\nn\n\n on K, there\nfore \nG(R ) = -\n\nπ R\nK dK\nK 2 -k 2\ninf\nsinKR\n∫\n-inf\nK\n\n \n\n \nR\n \necall that \n\nsinKR\n= 2i(eiKR -e-iKR) \n \n \n\nG(R ) = -4\nπ R\n\n2i\nKeiKR\nK 2 -k 2\ninf\nKe-iKR\n∫\n-\n-inf\nK 2 -k 2\n\ninf\n\n \n\n∫\n\n \n\n-inf\n\nUse of the Residue Theorem\n \n \nIf  f (z) is an analytic function then \n \nn\n∫f (z)dz = 2πi∑Res f (a j)\nc\nj=1\n \na\n \n \nWhere \nj\nth\n (singularity) is in the circle c. \nF\n \nor a m  order singu\nlarity \nRes f (a j) = (m -1)!\ndm\nzlim\n-1\n→a j dzm-1\n\n[(z -a j)m\n\nf (z)]\n\n \n\n \n \n\n(a)\n \nFirst part of the in\nKeiKR\ntegral \nf (K) = K 2\nk 2\n-\n \n \n \nS\n \nK\ningu\n=\nlar\n±\niti\nk\nes of order m=1 at \n \n \nS\n \nince  R > 0 \n \n \n \n\n \n \n \nKeiKR\nRes f (+k) =\nKlim\n→+k (K -k) (K -k)(K + k)\n \n \n \nRes f (+k)\neikR\n= 2\n \n \n∫f (z)dz = π ieikR\nc\n \n \n \n \n \n \n \n \n \n\n(b)\n \nKe\nf (K)\n-iKR\n= K 2 -k 2\n \n \nS\n \nince  R > 0 \n \n \n \nRes f (+k)\nKe\n=\nKlim\n→-k (K -k)\niKR\n(K -k)(K + k)\nSecond part of the integral \n \n\nRes f (+k) = (-k) e-i(-k)R\n-2k\n \n \n \nRes f (+k)\neikR\n= 2\n \n \nN\ncl\no\no\nt\nc\ne\nk\n \nw\nth\ni\na\ns\nt\ne\n \n.\nt\n \nhe sense of integration is counter‐\n \n \n∫f (z)dz = -π ieikR\nc\n \n \n \n \n \n \n \n \n\nHence \n becomes \n \nR\n\nG(\n\n)\nG(R\n\n)\n= -\n\nπ R\n2i\n\n \n[\nikR\nikR\n\nπie\n-(-πie\n)\n\n]\n\nG(R\n\n)\n= -\n\n4πR eikR\n \n \nR\n \nec\n\nall that \nR = r -r '\n \n \n \nG(r , r ')\n= -\n\nπ r\n-r ' e\nik r\n-r '\n \n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n22.106 Neutron Interactions and Applications\n\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT22_106S10_read03.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/22-106-neutron-interactions-and-applications-spring-2010/a6b3022bb559665b4b52990e73c1c0d4_MIT22_106S10_read03.pdf",
      "content": "C\nL\no\ne\nh\nt \ne\na\nr\ns\ne\ns\nn\nu\nt\nm\n a\ne\nn\n a\nd\nn\n Incoherent Spin Scattering \ncoherent spin as \n op\nR\ne\na\nr\nd\nat\ni\no\nu\nr\ns\n \n \nfor the coherent and \n= A\n~\n+ B\n~\nI\n\n.i\n\n= I\n\n+ i\n \n\nI\n\n=\n2 +\n \ni 2 + 2I\n\n.i\n\n \n.i 1\n=\n\n2[J\n\n2 -I\n\n2 -i 2]\n \nζ\n~\n= A ζ\n~\n+ BI\n\n. i ζ\n \n→spin state eigenvector  \n \nin\n \na\n~\n \nJ\n \nJ\n \nI\n \na\n~\n \nζ\n\n~\na ζ\n\n~\n= A ζ\n~\n+ B 1\n2[J\n\n2 -I\n\n2 -i 2] ζ\n \na = A + B 1\n \n[J(J +1) -I(I +1) -i(i +1)]\n \n \nFor i =1/2 ⇒J = I -1/2 and J = I +1/2\na) For J = I -1/2\nwehave\na-\n= A + 2 B[(I -1/2)(I +1/4) -I2 -I -3/4]\nor\na-\n= A -2 B(I +1)\n \n\nb) For J = I +1/2\nwehave\na+\n= A + 2 B[(I +1/2)(I + 3/2) -I2 -I -3/\nor\na+\n= A + 2\n \nBI\n \nA and B as a functionof a-and a+\nFrom\na+\n= A + 2 BI\nand\na-\n= A -2\n \nB(I +1)\n4]\n\nA and B become\nI\nA\n+1\n= 2I +1\nI\na+ + 2I +1a-\nand\nB = 2I +1(a+ -a-)\n \n \n \nIf\ne\nT\nx\nh\n \ni\ni\ns\ns\nt\n \ns\ni\n. \nn\na\ndi\n+\nca\n=\ntes\na\n \n-\nth\n=\nat\na\n  n\n \no\nth\n  s\ne\np\nn\ni\n \nn\nB\n  co\n=\nhe\nr\n \nen\nan\nt \nd\ns\n \nca\nA\ntte\n=\nrin\na\ng\n. \n \nthe inco\nH\nh\ne\ne\nn\nr\nc\ne\ne\nn\n, \nt \nA\nsc\n \na\nr\nt\ne\nt\nl\ne\na\nr\nt\ni\ne\nn\ns\ng\n t\n. \no the coherent and  B to \n \nbe d\nT\ner\nh\ni\ne\nv\n \ne\ne\nd\nx\n \np\nas\ne\n:\nc\n \nted values for the operator \n~ 2\na  can \n \n< a2 >= ζ\n~ ~ *\naa ζ\n \n \n\n \n\n \n< a\nh\n>=\ne c\nA\n\nT\nro\ns\n+\ns t\nAB\nerm\n<\ns \nI\nar\n.\ne\ni\n \n\nz\n>\ner\n+\no\nBA < I\n\n. i > +B2 < (I\n\n. i )2 >\ns\ne\np\nxi\ni\ns\nn\nt\n,\ns\n i\n \n.e\nb\n.\ne\n, \nt\n\n<\nw\nI\ne\n.\ne\ni\nn\n>=\n th\ne \n \nneutron s\n \np\nsi\n.\ni\nn\nn\nc\n a\ne\nn\n n\nd\no\n \n \nt\nc\nh\no\ne\nr\n \nr\nn\ne\nu\nla\ncl\nt\ne\nio\nu\nn\ns \n \n\n \n \n< a2 >= A2 + B2 < (I\n\n.\n \ni )2 > \n\n \n< (I\n\n. i )2 >=< (Ixix)2 + (I\nyiy) + (Iziz)2\n \n>\n \n< (i )2 >=< (i )2\nx\ny\n>=< (iz) >=1/4  \n< (I\n\n. i )2\n>= 4\n\nI\n<\n>\nor\n\n< (I . i )2\n>= 4 I(I +1) \n\n \n< a >= A2 + B2 1\n4 I(I +1)\n \n \n \nWith A and B as\nI\nA\n+1\n= 2I +1\nI\na+ + 2I +1a-\nand\nB = 2I +1(a+ -a-)\n \n \n \n \n \n \n \n \n\nI\n< a\n+1\n>= 2I +1\nI\na+ + 2I +1\n\na-\nI(I +1)\n+\n\n(2I +1)2\n \n(a+ -a-\n \na\nI +1\ncoh = 2I +1a+\nI\n+ 2I +1a-\n \n \n[I(I\na\n+1)]1/ 2\ninch =\n2I +1\n(a+ -a-)\n \n \n \n \n \n \n \n \n \n \n)2\n \n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n22.106 Neutron Interactions and Applications\n\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}