{
  "course_name": "New Culture of Gender: Queer France",
  "course_description": "This course addresses the place of contemporary queer identities in French discourse and discusses the new generation of queer authors and their principal concerns. Class discussions and readings will introduce students to the main classical references of queer subcultures, from Proust and Vivien to Hocquenghem and Wittig. Throughout the course, students will examines current debates on post-colonial and globalized queer identities through essays, songs, movies, and novels. Authors covered include Didier Eribon, Anne Garréta, Abdellah Taïa, Anne Scott, and Nina Bouraoui. This class is taught in French.",
  "topics": [
    "Fine Arts",
    "Media Studies",
    "Humanities",
    "Language",
    "French",
    "Literature",
    "International Literature",
    "Social Science",
    "Anthropology",
    "Social Anthropology",
    "Society",
    "Gender Studies",
    "Fine Arts",
    "Media Studies",
    "Humanities",
    "Language",
    "French",
    "Literature",
    "International Literature",
    "Social Science",
    "Anthropology",
    "Social Anthropology",
    "Society",
    "Gender Studies"
  ],
  "syllabus_content": "Course Meeting Times\n\nSeminars: 1 session / week, 3 hours / session\n\nCourse Overview\n\nThe course addresses the question of contemporary queer identities and representations in France and their place in current French discourse. Who are the new queer authors? What are the main concerns of this new generation? The class will first introduce students to the main classical references of queer subcultures from Proust and Vivien to Hocquenghem and Wittig. We will then study the new debates on postcolonial and globalized lesbian, gay and trans identities exploring essays songs, movies, and novels. Among the authors studied: Didier Eribon, Anne Garreta, Abdellah Taia, Monique Wittig, Nina Bouraoui, etc. Taught in French.\n\nGrading Policy\n\nSessions will be divided between\n\nStudents' presentations of the weekly theme\n\nClass discussion to engage with the main readings and movies screened\n\nA weekly analysis of topical issues on gender and sexuality in France\n\nFinal grade will be determined from three types of required exercises:\n\nOne grade will be based on one\noral presentation (30%)\n, individually or in groups (of no more than 2 students). It will be limited to 10 to 20 minutes maximum. Students will also have to\nspeak\nto the class during their oral presentation (not to\nread\na pre-written text).\n\nOne grade will be based on\nweekly short-answer papers (30%)\n. It will consist of a half-page argument on the weekly theme.\n\nOne grade will be based on\na stylistic composition (30%)\n. Students will write a 3 pages short story with four different characters, whose sex, sexual orientation, and gender are different. The rule is to write without using any mark of grammatical gender. The students will attach a two pages essay to explain who are the characters and how they manage to make them identifiable as men, women, gays, lesbians, transsexuals, bisexuals, transgenders, queers, etc.\n\nOne grade will be based on\nclass participation (10%):\nthe evaluation will be based on 1° attendance, 2° the demonstration that the students have done the weekly readings, 3° the quality (and not only the quantity) of their oral output. To help you prepare for the discussions, questions on the readings and their most topical aspects will be suggested every week.\n\nCalendar\n\nThe following table indicates which topics, readings, and questions were covered during each class session.\n\nSES #\n\nTOPICS\n\nASSIGNMENTS\n\nQu'ouir ?\n\nQueer est un terme anglophone. Il designe, sous la forme de l'injure, les lesbiennes, les gays, les transsexuel/les et plus generalement toutes celles et tous ceux dont le comportement deroge aux normes sexuelles dominantes. Nes aux Etats-Unis au debut des annees 1990, les mouvements queer cherchent a transformer ces normes en se reappropriant l'injure et en y puisant une nouvelle energie theorique et militante. Ces mouvements ont pris appui sur de nombreux auteurs francais, au premier rang desquels Michel Foucault, Monique Wittig, Guy Hocquenghem, etc. Le cours reflechira a l'influence des cultures homosexuelles francaises sur les mouvements queer et a la facon dont ceux-ci questionnent, en retour, les contours de la nationalite et la notion de culture elle-meme.\n\nPresentation du semestre\n\nChoix des exposes\n\nJeu de role : qu'est-ce que l'injure ?\n\nIcones : LGBT francais celebres\n\nChronologie : situez des evenements de l'histoire LGBT francaise\n\nLieux homosexuels\n\nRE\nPARTIE : \"BIZARRE, VOUS AVEZ DIT BIZARRE ?\"\n\nLecture generale:\n\nSedgwick, Eve Kosofsky. \"Construire des significations queer.\" In\nLes etudes gay et lesbiennes\n. du Centre Georges Pompidou edition. Edited by Dibier Eribon. Actes du colloque des 23 et, 1997, pp. 109-16. ISBN: 9782858509560.\n\nLe queer met l'accent sur la complexite de la subjectivation : se constituer comme sujet est un processus complexe, contradictoire, comportant des zones d'ombre et des beances. Les cultures heterosexuelles et homosexuelles se definissent ainsi dans des rapports de pouvoir equivoques : hegemonie, autonomie, anxiete, paranoia, deloyaute, authenticite, sont quelques-uns des maillons qui articulent les categories sexuelles entre elles. La premiere partie du semestre etudiera la facon dont est mis en scene, en France, le continuum sexuel, de l'heterosexualite exclusive a l'homosexualite exclusive. Ces representations de l'orientation sexuelle posent une question centrale : a quoi servent les categories ?\n\nLa race maudite\n\nLecture :\n\nMichel Foucault,\nLa volonte de savoir\n(1976)\n\nMarcel Proust,\nSodome et Gomorrhe\n(1921-1922)\n\nDidier Eribon, \"L'interpellation heterosexuelle\", in\nReflexions sur la question gay\n(1999)\n\nQuestion : Qu'est-ce qui differencie les heterosexuels des homosexuels ?\n\nAvoir mauvais genre\n\nLecture :\n\nMonique Wittig,\nLa Pensee straight\n(1980)\n\nSimone de Beauvoir,\nLe Deuxieme Sexe\n(1949)\n\nHeinrich Himmler, \"Discours a un groupe d'officiers SS\", Bad Tolz, 18 fevrier 1937.\n\nQuestion : Croyez-vous au \"gaydar\" ?\n\nParanoia et authenticite\n\nLecture :\n\nColette,\nLe Pur et l'Impur\n(1932).\n\nJean-Paul Sartre,\nL'Etre et le Neant\n(1943)\n\nFilm : Valerie Minetto,\nOublier Cheyenne\n(2005)\n\nE\nPARTIE : QUEERISER\n\nLecture generale :\n\nDavid M. Halperin, \"\nDes lits d'inities\n\",\nL'Unebevue\n, n°16, automne 2000, pp. 23-39.\n\nLa sous-culture homosexuelle est formee par un ensemble de representations vernaculaires autour desquelles se constitue une communaute. Ces references varient considerablement selon l'origine geographique, le milieu social, l'espace professionnel, l'age, la generation, etc. Andre Gide cotoie ainsi Mylene Farmer, Francois Ozon Lady Gaga, Rachilde Celine Sciamma, etc. Par-dela cette diversite, il existe tout de meme un denominateur commun : eleves comme heterosexuels, les lesbiennes et les gays ont appris le langage et les rites de l'heterosexualite ; ils finissent, selon les contraintes propres a leur environnement, par s'y frayer leur propre chemin en reinterpretant des references culturelles qui,\na priori\n, les excluaient. Une des principales pratiques queer au sein des universites americaines a donc consiste a \"queeriser\" les cultures majoritaires. Ce phenomene traverse (\ntwerk\n) les frontieres nationales et questionne l'ideal universaliste francais.\n\nLes amities particulieres\n\nLecture :\n\nMichel de Montaigne,\nLes Essais\n(1580-1588)\n\nHonore de Balzac,\nLa cousine Bethe\n(1846)\n\nMichel Foucault, \"De l'amitie comme mode de vie\" (1981)\n\nQuestion : Conseilleriez-vous a un/e ami/e homosexuel/le de sortir du placard ?\n\nLes heterotopies\n\nLecture :\n\nDenis Diderot,\nLa religieuse\n(1760)\n\nFilm : Jacques Demy,\nLes Demoiselles de Rochefort\n(1967)\n\nDrole de familles !\n\nLecture :\n\nJean Genet,\nNotre-Dame-des-Fleurs\n(1948)\n\nArthur Rimbaud,\nUne saison en enfer\n(1873)\n\nFilm : Francois Ozon,\nLe Temps qui reste\n(2004)\n\nE\nPARTIE : QUE FAIRE AVEC LE QUEER ?\n\nLecture generale :\n\nPerreau, Bruno. \"La reception du geste queer en France. Performativite, subjectivation et devenir minoritaire.\" In Chetcuti, Natacha, and Luco Greco.\nLe genre a l'epreuve des dispositifs de pouvoir, de langage et de categorisation sociale\n. Presses de l'universite Paris III (2011).\n\nQui s'identifie comme queer en France ? Pourquoi des militants se sont-ils definis, a partir de la fin des annees 1990, en reference au queer ? Comment ces mouvements sociaux coexistent-ils avec les associations gays et lesbiennes ? La troisieme partie du semestre retracera l'histoire des mouvements homosexuels en France et interrogera la notion de subversion. Faut-il se vivre, se dire voire se montrer radical pour transformer radicalement les normes ? Revendiquer une position marginale ne conforte-t-il pas les categories dominantes dans leur centralite ? Le cours montrera que la stylisation de son existence est indissociable d'une mise en question critique de son point de vue.\n\nHomosexualite et revolution\n\nLecture :\n\nAppel du Comite d'Action pederastique revolutionnaire (mai 1968)\n\nTout !\nJournal du groupe\nVive la Revolution\n, n°12 (23 avril 1971)\n\nExtraits du documentaire : Alessandro Avellis,\nLa Revolution du desir\n(2006)\n\nQuestion : L'homosexualite peut-elle changer la societe et pourquoi ?\n\nLa lutte contre les discriminations et la conjugalite\n\nLecture :\n\nRobert Badinter, intervention a l'Assemblee Nationale (20 decembre 1981).\n\nRoselyne Bachelot, intervention a l'Assemblee Nationale (7 novembre 1998).\n\nManifeste pour l'egalite des droits (2004)\n\nExtraits du documentaire : Yves Jeuland,\nMaris a tout prix\n(2004)\n\nQuestion : Developpez des arguments en faveur de la suppression du mariage\n\nLa maladie de la mort\n\nLecture :\n\nMarguerite Duras.\nLes yeux bleus cheveux noirs\n(1986).\n\nHerve Guibert.\nA l'ami qui ne m'a pas sauve la vie\n(1990).\n\nFilm : Andre Techine,\nLes Temoins\n(2007)\n\nHomonationalisme ?\n\nLecture :\n\nRachid O.,\nChocolat chaud\n(1998)\n\nMaxime Cervulle, Nick Rees-Roberts,\nHomoexoticus. Race, classe et critique queer\n(2010)\n\nLes Pantheres roses, Act Up Paris, \"Mon identite n'est pas nationale\" (2009)\n\nQuestion : Comment expliquez-vous que certain/es homosexuel/les soient d'extreme-droite ?\n\nBilan du semestre : tirer la langue !\n\nLecture : Anne F. Garreta,\nSphinx\n(1986)",
  "files": [
    {
      "category": "Resource",
      "title": "De l’amitié",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-325j-new-culture-of-gender-queer-france-fall-2011/2bd6e397b3051ea542c0d78422e33c1f_MIT21G_325JF11_Montaigne.pdf",
      "content": "Michel de Montaigne (1533-‐1592) Les Essais (1580-‐1588)\nPhilosophe francais, Montaigne est temoin de son temps : en humaniste, il pose son regard sur tout\nce qui fait la societe du XVIeme siecle. Son amitie indefectible avec Etienne de la Boetie, dont il dira\nqu'ils etaient « moitie de tout », est a l'origine des commentaires qui suivent. Non qu'il s'agisse de\ntrancher ici la controverse sur la nature de leurs relations, mais de voir plutot dans ce texte la richesse\ndes possibilites relationnelles de l'epoque, au dela du seul modele marital. L'amitie, mode de vie de\nbeaucoup de gays aujourd'hui, alternative a certains liens familiaux traditionnels, y trouve en partie\nson origine.\n\nDe l'amitie\nAu demeurant ce que nous appelons ordinairement amis et amities, ce ne sont\nqu'accointances et familiarites nouees par quelque occasion ou commodite, par le moyen de\nlaquelle nos ames s'entretiennent. En l'amitie de quoi je parle, elles se melent et confondent\nl'une en l'autre, d'un melange si universel, qu'elles effacent et ne retrouvent plus la couture\nqui les a jointes. Si on me presse de dire pourquoi je l'aimais, je sens que cela ne peut\ns'exprimer qu'en repondant : « Parce que c'etait lui, parce que c'etait moi ». II y a, au-‐dela de\ntout mon discours, et de ce que j'en puis dire particulierement, je ne sais quelle force\ninexplicable et fatale, mediatrice de cette union. Nous nous cherchions avant que de nous\netre vus, et par des rapports que nous oions l'un de l'autre, qui faisaient en notre affection\nplus d'effort que ne porte la raison des rapports, je crois par quelque ordonnance du ciel ;\nnous nous embrassions par nos noms. Et a notre premiere rencontre qui fut par hasard en\nune grande fete et compagnie de ville, nous nous trouvames si pris, si connus, si obliges\nentre nous, que rien des lors ne nous fut si proche l'un de l'autre. Il ecrivit une Satire latine\nexcellente, qui est publiee par laquelle il excuse et explique la precipitation de notre\nintelligence, si promptement parvenue a sa perfection. Ayant si peu a durer, et ayant si tard\ncommence, car nous etions tous deux hommes faits, et lui plus de quelque annee, elle\nn'avait pas a perdre temps et a se regler au patron des amities molles et regulieres,\nauxquelles il faut tant de precautions de longue et prealable conversation. Celle-‐ci n'a point\nd'autre idee que d'elle-‐meme, et ne se peut rapporter qu'a soi. Ce n'est pas une speciale\nconsideration, ni deux, ni trois, ni quatre, ni mille : c'est je ne sais quelle quintessence de\ntout ce melange, qui, ayant saisi toute ma volonte, l'amena se plonger et se perdre dans la\nsienne, qui, ayant saisi toute sa volonte, l'amena se plonger et se perdre en la mienne, d'une\nfaim, d'une concurrence pareille. Je dis perdre, a la verite, ne nous reservant rien qui nous\nfut si propre, ni qui fut ou sien, ou mien.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.325J / WGS.233J New Culture of Gender: Queer France\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Discours à un groupe d’officiers SS",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-325j-new-culture-of-gender-queer-france-fall-2011/5211ce846c10ea830043fedc0b10cd09_MIT21G_325JF11_Himmler.pdf",
      "content": "Heinrich Himmler (1900-‐1945). Discours a un groupe d'officiers SS, Bad Tolz, 18 fevrier\n1937.\nChef de la SS depuis 1929, ministre de l'interieur d'Hitler a partir de 1943, Heinrich Himmler utilisa les\ncamps de concentration comme instrument de terreur politique et d'extermination raciale. Les gays\net les lesbiennes furent parmi ses victimes : 100 a 150.000 homosexuel·∙le·∙s ont ete arretes entre 1933\net 1994, 10 a 15.000 ont ete envoyes dans des camps de concentration. Les gays devaient porter le\ntriangle rose, les lesbiennes (avec les asociaux), le triangle noir. Le 30 juin 1934, Himmler elimine\nRohm, chef des SA (sections d'assaut) et homosexuel. Cette \"nuit des longs couteaux\" est un\ntournant : Hitler est desormais seul a bord et Himmler est son bras arme. Dans son discours de Bad\nTolz, Himmler explique le danger que represente l'homosexualite pour la nation allemande. Il en\nattribue l'origine a la virilisation des femmes. Il est interessant d'interroger la relative bienveillance\ndont beneficient aujourd'hui certaines critiques du feminisme et du mouvement gay et lesbien,\naccuses de mettre a mal la civilisation en fragilisant les relations hommes/femmes. Ces discours, bien\nque plus moderes en apparence, ne sont malheureusement pas sans analogie avec le discours\nhimmlerien.\n\nLorsque nous avons pris le pouvoir en 1933, nous avons decouvert les associations\nd'homosexuels. Elles comptaient deux millions de membres. Les prudentes estimations des\nfonctionnaires charges de ce probleme indiquent jusqu'a quatre millions d'homosexuels en\nAllemagne. J'estime personnellement que les chiffres ne sont pas aussi eleves. Je pense que\ntous ceux qui faisaient partie de ces associations n'etaient pas vraiment des homosexuels.\nD'autre part, je suis naturellement convaincu que tous les homosexuels n'etaient pas inscrits\ndans ces associations. J'estime qu'il y en avait un a deux millions. Mais un million, c'est\nvraiment le minimum, l'estimation la plus basse et la plus indulgente qu'il soit permis de\nfaire en ce domaine.\n\n[...] Je vais developper devant vous quelques reflexions sur le probleme de l'homosexualite.\nIl y a parmi les homosexuels des gens qui adoptent le point de vue suivant : \"Ce que je fais\nne regarde personne, c'est ma vie privee\". Mais il ne s'agit pas de leur vie privee. Pour un\npeuple, le domaine de la sexualite peut etre synonyme de vie ou de mort, d'hegemonie\nmondiale ou de reduction de son importance a celle de la Suisse. Un peuple qui a beaucoup\nd'enfants peut pretendre a l'hegemonie mondiale, a la domination du monde. Un peuple de\nrace noble qui a tres peu d'enfants detient un billet pour l'au-‐dela, car dans cinquante ou\ncent ans, il n'aura plus aucune importance, et d'ici deux cents ou cinq cents ans, il sera mort.\nOutre ces problemes de nombre (je n'ai envisage que ce cas-‐la), un tel peuple peut\negalement disparaitre en tant qu'Etat pour d'autres raisons. Nous sommes un Etat\nd'hommes, et malgre tous les defauts que ce systeme presente, nous devons absolument\nnous y accrocher. Car cette institution est la meilleure.\n\n[...] La destruction de l'Etat commence lorsque, intervenant un principe erotique (je le dis\navec le plus grand serieux), un principe d'attirance sexuelle entre hommes, la qualification\n\nprofessionnelle, l'efficacite ne jouent plus dans cet Etat d'hommes le role qu'elles devraient\njouer. Je vais vous citer un exemple pris dans la vie quotidienne, je dis bien \"pris dans la vie\nquotidienne\". J'ajoute qu'a mon avis, dans toutes les regions habitees aujourd'hui sur la\nterre, aucun service n'a accumule autant d'experience dans le domaine de l'homosexualite,\nde l'avortement, etc., que la Gestapo en Allemagne. Je crois que, dans ce domaine, nous\npouvons parler d'experience. Le conseiller ministeriel X est homosexuel et cherche parmi ses\nassesseurs un conseiller gouvernemental, mais il ne cherche pas necessairement le plus\nefficace. Il ne choisira pas le meilleur juriste, il ne dira pas non plus : \"l'assesseur X n'est\ncertes pas le meilleur juriste, mais il est bien note, il a de la pratique, et (ce qui pese lourd\ndans la balance) il semble de bonne race et avoir une conception correcte du monde\". Non,\nil ne prend pas un assesseur qualifie, ni de bonne apparence physique. Il choisit celui qui est\nlui aussi homosexuel. Ces gens sont capables de se reperer d'un bout a l'autre d'une salle.\nLorsqu'il y a cinq cents hommes dans une soiree dansante, ils ont repere au bout d'une\ndemi-‐heure ceux qui ont le meme penchant qu'eux. Les gens normaux comme nous ne\npeuvent imaginer comment cela est possible.\n\n[...] L'homosexualite fait donc echouer tout rendement, tout systeme fonde sur le\nrendement. Elle detruit l'Etat dans ses fondements. A cela s'ajoute le fait que l'homosexuel\nest un homme radicalement malade sur le plan psychique. Il est faible et se montre lache\ndans tous les cas decisifs. Je crois qu'a la guerre il peut faire preuve de courage de temps a\nautre, mais dans le domaine civil, ce sont les hommes les plus laches que l'on puisse\nimaginer.\n\n[...] L'homosexuel est naturellement un objet ideal de pression, d'abord parce qu'il est lui-‐\nmeme passible de sanctions, deuxiemement parce que c'est un type malleable, et\ntroisiemement parce qu'il est veule et depourvu de toute volonte.\nDe plus -‐ je ne cherche qu'a vous presenter quelques exemples en ce domaine -‐\nl'homosexuel est possede par un insatiable besoin de faire des confidences dans tous les\ndomaines et tout particulierement dans le domaine de la sexualite. La plupart du temps,\nvous constatez que celui qui se fait pincer vous donne sans aucune contrainte tous les noms\nqu'il connait. Il n'y a donc -‐ il faut bien que je me place de ce point de vue -‐ aucune fidelite\ndans l'amour entre hommes, bien que ces gens pretendent s'aimer. L'homosexuel raconte\ntout de maniere debridee, dans l'espoir sans aucun doute de pouvoir sauver sa peau.\n\n[...] Aujourd'hui encore, il se presente tous les mois un cas d'homosexualite dans la SS. Nous\navons de huit a dix cas par an. J'ai donc decide la chose suivante : dans tous les cas, ces\nindividus seront officiellement degrades, exclus de la SS et traduits devant un tribunal. Apres\navoir purge la peine infligee par le tribunal, ils seront internes sur mon ordre dans un camp\nde concentration et abattus pendant une « tentative d'evasion ». Dans chaque cas, le corps\nd'origine de cet individu en sera informe sur mon ordre. J'espere ainsi extirper ces gens de la\nSS -‐ jusqu'au dernier. Je veux preserver le sang noble que nous recevons dans notre\norganisation et l'œuvre d'assainissement racial que nous poursuivons pour l'Allemagne.\n\n[...] Mais tout cela ne permet pas de resoudre le probleme dans son ensemble. Je ne vois\nqu'une seule solution : empecher les vertus d'un Etat d'hommes, les avantages des\nassociations masculines de degenerer en defauts. A mon avis, on constate une trop grande\nmasculinisation de notre vie. Nous allons jusqu'a militariser des choses inimaginables. Je le\ndis tres franchement : rien n'est aussi parfait que notre maniere de faire avancer les\nhommes en rang et de faire des paquetages, mais je trouve catastrophique de voir les filles\net les femmes -‐ les jeunes filles surtout -‐ circuler a travers le pays avec des paquetages\nparfaits. Cela donne envie de vomir. Je trouve catastrophique de voir les organisations\nfeminines, les associations feminines, les communautes feminines s'occuper de choses qui\ndetruisent le charme, la dignite et la grace de la femme. Nous autres hommes -‐ je parle de\nmaniere generale -‐, cela ne nous concerne pas directement. Nous voulons, dans notre folie,\nfaire de la femme un instrument de pensee logique, nous lui apprenons tout ce qui est\npossible. Je trouve cela catastrophique. Nous masculinisons les femmes de telle sorte qu'a la\nlongue la difference sexuelle et la polarite disparaissent. Des lors, le chemin qui mene a\nl'homosexualite n'est pas loin.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.325J / WGS.233J New Culture of Gender: Queer France\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "La cousine Bethe",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-325j-new-culture-of-gender-queer-france-fall-2011/cf5db58036fe8307ddddaaf89c31451b_MIT21G_325JF11_Balzac.pdf",
      "content": "Honor\n\ne de Balzac (1799-‐1850). La cousine Bethe (1846).\nBalzac a propose dans La Comedie humaine toute une serie de portraits ou l'homosexualite\njoue un role central : Vautrin adepte du « troisieme sexe », suscite l'admiration de Lucien de\nRubempre. Quant aux cousin·∙e·∙s, \"parents pauvres\" de l'ordre familial, leurs modes de vie,\nsans etre explicitement homosexuels, suscitent le trouble : le cousin Pons qui veut\ntransmettre ses biens a son ami Schmucke ainsi qu'a l'Etat provoque l'indignation de ses\nproches. Lisbeth Fischer et Valerie Marneffe destabilisante quant a elle la frontiere\namour/mariage/famille puisque si la cousine Bethe est promise au peintre Wencesla, elle\nn'en demeure pas moins profondement liee a Madame Marneffe. Je reprends ici le\ndecoupage propose par Michael Lucey, professeur a l'universite de Berkeley et specialiste de\nla litterature francaise du XIXeme siecle.\n\nLisbeth et Valerie offraient le touchant spectacle d'une de ces amities si vives et si peu\nprobables entre femmes, que les Parisiens, toujours trop spirituels, les calomnient aussitot.\nLe contraste de la male et seche nature de la Lorraine avec la jolie nature creole de Valerie\nservit la calomnie.\nMadame Marneffe avait d'ailleurs, sans le savoir, donne du poids aux commerages par le\nsoin qu'elle prit de son amie, dans un interet matrimonial qui devait, comme on va le voir,\nrendre complete la vengeance de Lisbeth\nLisbeth [...] adorait d'ailleurs Valerie, elle en avait fait sa fille, son amie, son amour; elle\ntrouvait en elle l'obeissance des creoles, la mollesse de la voluptueuse ; elle babillait avec\nelle tous les matins avec bien plus de plaisir qu'avec Wenceslas\n[...] Lisbeth avait d'ailleurs rencontre [...] dans son amitie nouvelle, une pature a son activite\nbien autrement abondante que dans son amour [...] pour Wenceslas. [...]\n-‐ Es-‐tu belle, ce matin ! dit Lisbeth en venant prendre Valerie par la taille et la baisant au\nfront. Je puis de tous tes plaisirs, de ta fortune, de ta toilette... Je n'ai vecu que depuis le jour\nou nous nous sommes faites sœurs...\n[...] -‐ Voyons, ma chere petite cousine Bette, dit gracieusement madame Marneffe, etes-‐\nvous susceptible d'une amitie devouee, a toute epreuve? Voulez-‐vous que nous soyons\ncomme deux sœurs? Voulez-‐vous surtout me jurer de n'avoir pas plus de secrets pour moi\nque je n'en aurai pour vous, d'etre mon espion comme je serai le votre? [...]\nMadame Mameffe s'arreta [...] la cousine Bette l'effraya. [...]\nElle serrait ses dents pour les empecher de claquer, et une affreuse convulsion faisait\ntrembler ses membres ; elle brulait! La fumee de l'incendie qui la ravageait semblait passer\npar ses rides comme par autant de crevasses labourees par une eruption volcanique. Ce fut\nun spectacle sublime.\n-‐ Eh bien ! pourquoi vous arretez-‐vous ? dit-‐elle d'une voix creuse, je serai pour vous tout ce\nque j'etais pour lui. Oh! je lui aurais donne tout mon sang...\n-‐Vous l'aimez donc?\n\n-‐ Comme s'il etait mon enfant !...\n-‐ Eh bien ! reprit madame Marneffe en respirant a l'aise, puisque vous ne l'aimez que\ncomme ca, vous allez etre bien heureuse, car vous le voulez heureux?\nLisbeth repondit par un signe de tete rapide comme celui d'une folle\n-‐ Il epouse dans un mois votre petite cousine.\n-‐ Hortense ? cria la vieille fille en se frappant le front et en se levant.\n-‐ Ah ca! vous l'aimez donc, ce jeune homme? demanda madame Marneffe.\n-‐ Ma petite, c'est entre nous a la vie et a la mort, dit mademoiselle Fischer. Oui, si vous avez\ndes attachements, ils me seront sacres. Enfin, vos vices deviendront pour moi des vertus, car\nj'en aurai besoin, moi, de vos vices !\n-‐ Vous viviez donc avec lui? s'ecria Valerie.\n-‐ Non, je voulais etre sa mere...\n-‐ Ah! je n'y comprends plus rien, reprit Valerie, car alors vous n'etes pas jouee ni trompee, et\nvous devez etre bien heureuse de lui voir faire un beau mariage...\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.325J / WGS.233J New Culture of Gender: Queer France\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "La religieuse",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-325j-new-culture-of-gender-queer-france-fall-2011/7430499df1268f71c8f6c81950a4d31c_MIT21G_325JF11_Diderot.pdf",
      "content": "Denis Diderot (1713-‐1784). La religieuse (1760)\nPhilosophe francais, directeur avec d'Alembert de l'Encyclopedie, Diderot propose avec La religieuse\nun roman philosophique sur la sociabilite. S'appuyant sur le proces de Marguerite Delamarre,\nreligieuse qui perdit son proces en resiliation de ses vœux en 1758, Diderot analyse les effets de\nl'isolement sur les mœurs. Madame de Moni est la mystique, sœur Sainte-‐Catherine la sadique et\nl'abbesse d'Arpajon, la tribade (meme si le mot n'est jamais utilise par Diderot). La narratrice, sœur\nSuzanne Simonin, est presente au couvent contre son gre. Elle raconte son quotidien a son protecteur,\nle marquis de Croismare, et notamment la passion que la mere superieure, abbesse d'Arpajon,\neprouve pour elle. Diderot innove car, en jouant sur l'innocence de la narratrice, il decale le regard sur\nle tribadisme en preferant la presentation des faits a toute interpretation morale. De meme, si\nl'abbesse sombre finalement dans la folie, ce n'est pas en raison de sa coupable passion mais parce\nque la morale chretienne la torture. « Tout ce qui est ne peut etre ni contre-‐nature ni hors nature »\nnous dit-‐il dans la Suite de son entretien avec d'Alembert.\n\nSuzanne a la superieure :\n[...] Chere mere, si vous avez quelques bontes pour moi, pardonnez a ma sœur Therese ; elle\na la tete perdue, elle ne sait ce qu'elle dit, elle ne sait ce qu'elle fait.\n-‐Que je lui pardonne ! Je le veux bien, mais que me donnerez-‐vous ?\n-‐ Ah ! Chere mere, serais-‐je assez heureuse pour avoir quelque chose qui vous plut et qui\nvous apaisat ?\n-‐ Elle baissa les yeux, rougit et soupira ; en verite, c'etait comme un amant. Elle me dit\nensuite, en se rejetant nonchalamment sur moi, comme si elle eut defailli : « Approchez\nvotre front, que je le baise... ». Je me penchai, et elle me baisa le front. Depuis ce temps,\nsitot qu'une religieuse avait fait quelques fautes, j'intercedais pour elle et j'etais sur\nd'obtenir sa grace par quelque faveur innocente [...]\n\nLa superieure a Suzanne :\n-‐ Mon amie, parlez-‐moi a cœur ouvert, voudriez-‐vous etre mariee ?\n-‐ Je l'aimerais mieux que d'etre ce que je suis ; cela est certain.\n-‐ Pourquoi cette preference ?\n-‐ Je l'ignore.\n-‐ Vous l'ignorez ? Mais dites moi quelle impression fait sur vous la presence d'un homme ?\n-‐ Aucune ; s'il a de l'esprit et qu'il parle bien, je l'ecoute volontiers ; s'il est d'une belle figure,\nje le remarque.\n-‐ Et votre cœur est tranquille ?\n-‐ Jusqu'a present, il est reste sans emotion.\n-‐ Quoi ! Lorsqu'ils ont attache leurs regards animes sur les votres, vous n'avez pas ressenti ...\n-‐ Quelques fois de l'embarras, ils me faisaient baisser les yeux.\n-‐ Et sans aucun trouble ?\n-‐ Aucun.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.325J / WGS.233J New Culture of Gender: Queer France\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Une saison en enfer",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-325j-new-culture-of-gender-queer-france-fall-2011/221848bfb87486da89cd1b7bbe186ff2_MIT21G_325JF11_Rimbaud.pdf",
      "content": "Arthur Rimbaud (1854-‐1891). Une saison en enfer (1873).\n\nDelires. Vierge folle : l'epoux infernal\n\nEcoutons, la confession d'un compagnon d'enfer : \"O divin Epoux, mon Seigneur, ne refusez\npas la confession de la plus triste de vos servantes. Je suis perdue. Je suis soule. Je suis\nimpure. Quelle vie ! [...]\nSes delicatesses mysterieuses m'avaient seduite. J'ai oublie tout mon devoir humain pour le\nsuivre. Quelle vie ! La vraie vie est absente. Nous ne sommes pas au monde. Je vais ou il va, il\nle faut. Et souvent il s'emporte contre moi, moi, la pauvre ame. Le Demon ! -‐ C'est un\nDemon, vous savez, ce n'est pas un homme. \"Il dit : \"Je n'aime pas les femmes. L'amour est a\nreinventer, on le sait. Elles ne peuvent plus que vouloir un position assuree. La position\ngagnee, coeur et beaute sont mis de cote : il ne reste que froid dedain, l'aliment du mariage,\naujourd'hui. Ou bien je vois des femmes, avec les signes du bonheur, dont, moi, j'aurais pu\nfaire de bonnes camarades, devorees tout d'abord par des brutes sensibles comme des\nbuchers...\" \"Je l'ecoute faisant de l'infamie une gloire, de la cruaute un charme. [...]\nAvec ses baisers et ses etreintes amies, c'etait bien un ciel, un sombre ciel, ou j'entrais, et ou\nj'aurais voulu etre laissee, pauvre, sourde, muette, aveugle. Deja j'en prenais l'habitude. Je\nnous voyais comme deux bons enfants, libres de se promener dans le Paradis de tristesse.\nNous nous accordions. Bien emus, nous travaillions ensemble. Mais, apres une penetrante\ncaresse, il disait : \"Comme ca te paraitra drole, quand je n'y serai plus, ce par quoi tu as\npasse. Quand tu n'auras plus mes bras sous ton cou, ni mon coeur pour t'y reposer, ni cette\nbouche sur tes yeux. Parce qu'il faudra que je m'en aille, tres loin, un jour. Puis il faut que\nj'en aide d'autres : c'est mon devoir. Quoique ce ne soit guere ragoutant..., chere ame...\"\nTout de suite je me pressentais, lui parti, en proie au vertige, precipitee dans l'ombre la plus\naffreuse : la mort. Je lui faisais promettre qu'il ne me lacherait pas. Il l'a faite vingt fois, cette\npromesse d'amant. C'etait aussi frivole que moi lui disant : \"Je te comprends.\" [...]\n\"Un jour peut-‐etre il disparaitra merveilleusement ; mais il faut que je sache, s'il doit\nremonter a un ciel, que je voie un peu l'assomption de mon petit ami !\"\nDrole de menage !\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.325J / WGS.233J New Culture of Gender: Queer France\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Sodome et Gomorrhe, vol. 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-325j-new-culture-of-gender-queer-france-fall-2011/7e81cc12f59ec1ef1ba06ff06c86d1f8_MIT21G_325JF11_Proust.pdf",
      "content": "Marcel Proust (1871-‐1922). Sodome et Gomorrhe (1921-‐1922).\n\nDe plus je comprenais maintenant pourquoi tout a l'heure, quand je l'avais vu sortir de chez\nMme de Villeparisis, j avais pu trouver que M. de Charlus avait l'air d'une femme : c'en etait\nune ! Il appartenait a la race de ces etres moins contradictoires qu'ils n'en ont l'air, dont\n1'ideal est viril, justement parce que leur temperament est feminin, et qui sont dans la vie\npareils, en apparence seulement, aux autres hommes; la ou chacun porte inscrite en ces\nyeux a travers lesquels il voit toutes choses dans 1'univers, une silhouette intaillee dans la\nfacette de la prunelle pour eux ce n'est pas celle d'une nymphe, mais d'un ephebe. Race sur\nqui pese une malediction et qui doit vivre dans le mensonge et le parjure, puisqu'elle sait\ntenu pour punissable et honteux, pour inavouable, son desir, ce qui fait pour toute creature\nla plus grande douceur de vivre ; qui doit renier son Dieu, puisque meme chretiens, quand a\nla barre du tribunal ils comparaissent comme accuses, il leur faut devant le Christ et en son\nnom, se defendre comme dune calomnie de ce qui est leur vie meme ; fils sans mere a\nlaquelle ils sont obliges de mentir obliges de mentir meme a l'heure de lui fermer les yeux ;\namis sans amities, malgre toutes celles que leur charme frequemment reconnu inspire et\nque leur cœur souvent bon ressentirait ; mais peut-‐on appeler amities ces relations qui ne\nvegetent qu'a la faveur d'un mensonge et d'ou le premier elan de confiance et de sincerite\nqu'ils seraient tentes d'avoir les ferait rejeter avec degout, a moins qu'ils n'aient a faire a un\nesprit impartial, voire sympathique, mais qui alors, egare a leur endroit par une psychologie\nde convention, fera decouler du vice confesse l'affection meme qui lui est la plus etrangere,\nde meme que certains juges supposent et excusent plus facilement l'assassinat chez les\ninvertis et la trahison chez les Juifs pour des raisons tirees du peche originel et de la fatalite\nde la race ? Enfin -- du moins selon la premiere theorie que j'en esquissais alors, qu'on verra\nse modifier par la suite, et en laquelle cela les eut par-‐dessus tout faches si cette\ncontradiction n'avait ete derobee a leurs yeux par l'illusion meme qui les faisait voir et vivre\n-- amants a qui est presque fermee la possibilite de cet amour dont l'esperance leur donne\nla force de supporter tant de risques et de solitudes, puisqu'ils sont justement epris d'un\nhomme qui n'aurait rien d'une femme, d'un homme qui ne serait pas inverti et qui, par\nconsequent, ne peut les aimer ; de sorte que leur desir serait a jamais inassouvissable si\nl'argent ne leur livrait de vrais hommes, et si l'imagination ne finissait par leur faire prendre\npour de vrais hommes les invertis a qui ils se sont prostitues. Sans honneur que precaire,\nsans liberte que provisoire jusqu'a la decouverte du crime [...]\n\nExclus meme, hors les jours de grande infortune ou le plus grand nombre se rallie autour de\nla. victime, comme les Juifs autour de Dreyfus, de la sympathie -- parfois de la societe -- de\nleurs semblables, auxquels ils donnent le degout de voir ce qu'ils sont, depeint dans un\nmiroir qui, ne les flattant plus, accuse toutes les tares qu'ils n'avaient pas voulu remarquer\nchez eux-‐memes et qui leur fait comprendre que ce qu'ils appelaient leur amour (et a quoi,\nen jouant sur le mot, ils avaient, par sens social, annexe tout ce que la poesie, la peinture, la\n\nmusique, la chevalerie, l'ascetisme, ont pu ajouter a l'amour) decoule non d'un ideal de\nbeaute qu'ils ont elu, mais d'une maladie inguerissable ; comme les Juifs encore (sauf\nquelques-‐uns , qui ne veulent frequenter que ceux de leur race, ont toujours a la bouche les\nmots rituels et les plaisanteries consacrees), se fuyant les uns les autres, recherchant ceux\nqui leur sont le plus opposes, qui ne veulent pas d'eux, pardonnant leurs rebuffades,\ns'enivrant de leurs complaisances ; mais aussi rassembles a leurs pareils par l'ostracisme qui\nles frappe, l'opprobre ou ils sont tombes, ayant fini par prendre, par une persecution\nsemblable a celle d'Israel, les caracteres physiques et moraux d'une race, parfois beaux,\nsouvent affreux, trouvant (malgre toutes les moqueries dont celui qui, plus mele, mieux\nassimile a la race adverse, est relativement, en apparence, le moins inverti, accable celui qui\nl'est demeure davantage) une detente dans la frequentation de leurs semblables, et meme\nun appui dans leur existence, si bien que, tout en niant qu'ils soient une race (dont le nom\nest la plus grande y injure), ceux qui parviennent a cacher qu'ils en sont, ils les demasquent\nvolontiers, moins pour leur nuire, ce qu'ils ne detestent pas, que pour s'excuser, et allant\nchercher, comme un medecin l'appendicite, l'inversion jusque dans l'histoire, ayant plaisir a\nrappeler que Socrate etait l'un d'eux, comme les Israelites disent que Jesus etait juif, sans\nsonger qu'il n'y avait pas d'anormaux quand l'homosexualite etait la norme, pas\nd'antichretiens avant le Christ, que l'opprobre seul fait le crime, parce qu'il n'a laisse\nsubsister que ceux qui etaient refractaires a toute predication, a tout exemple, a tout\nchatiment, en vertu d'une disposition innee tellement speciale qu'elle repugne plus aux\nautres hommes (encore qu'elle puisse s'accompagner de hautes qualites morales) que de\ncertains vices qui y contredisent comme le vol, la cruaute, la mauvaise foi, mieux compris,\ndonc plus excuses du commun des hommes ; formant une franc-‐maconnerie bien plus\netendue, plus efficace et moins soupconnee que celle des loges, car elle repose sur une\nidentite de gouts, de besoins, d'habitudes, de dangers, d'apprentissage, de savoir, de trafic,\nde glossaire, et dans laquelle les membres memes qui souhaitent de ne pas se connaitre,\naussitot se reconnaissent a des signes naturels ou de convention, involontaires ou voulus,\nqui signalent un de ses semblables au mendiant dans le grand seigneur a qui il ferme la\nportiere de sa voiture, au pere dans le fiance de sa fille, a celui qui avait voulu se guerir, se\nconfesser, qui avait a se defendre, dans le medecin, dans le pretre, dans l'avocat qu'il est alle\ntrouver ;\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.325J / WGS.233J New Culture of Gender: Queer France\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}