{
  "course_name": "Non-conventional Light Stable Isotope Geochemistry",
  "course_description": "No description found.",
  "topics": [
    "Science",
    "Earth Science",
    "Geochemistry",
    "Science",
    "Earth Science",
    "Geochemistry"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 1.5 hours / session\n\nPrerequisite\n\nPermission of instructor\n\nSummary\n\nThis course is designed for graduate students with an interest in using primary research literature to discuss and learn about current research around non-conventional light stable isotope geochemistry.\n\nFormat\n\nThis course will meet weekly for one and a half hours. During the regular class session, we will analyze two to three papers in a discussion-based format. Each class will conclude with a brief outline of the following week's class introduced by the instructors, or at the beginning of the class for sessions led by guest lecturers. Each student will pick one topic for presentation, and write up a one-page handout.\n\nGradings\n\nThis course is graded pass/fail, based upon the contribution to the discussion session.\n\nCalendar\n\nWEEK #\n\nTOPICS\n\nCourse overview\n\nEquilibrium / kinetic isotope effect\n\nHow good we can make it? Precision and accuracy of mass-spectrometery analysis\n\nHow mass-spectrometer works\n\nClumped isotope CO\n,\nCH\nD\n\nNitrous Oxide Isotopomer\n\nMass-dependent fractionation O-17 small anomaly\n\nMass-independent fractionation, O-17, Ozone, CO, stratspheric CO\n, NO\n, SO\n\nMass-independent fractionation, S-33\n\nO-17 hydrology",
  "files": [
    {
      "category": "Resource",
      "title": "A bistable organic-rich atmosphere on the Neoarchean Earth",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-491-non-conventional-light-stable-isotope-geochemistry-spring-2012/81d5fe82a191160807155336b5952035_MIT12_491S12_A_bistable.pdf",
      "content": "Review 01:\nZerkle, Aubrey L., Mark W. Claire, Shawn O. Damaga/-Goldman, James Farquhar, and Simon W. Poulton.\n(2012) A bistable organic-rich atmosphere on the Neoarchean Earth. Nature Geoscience\n001: lO.1038/NGE01425\nPri mary Question\nWhat was the Earth's atmosphere like prior to the Great Oxidation Event? Did it have an\norganic haze?\nMethods of Addressing this Question\n1. geochemical proxies from sediment cores\n2. photochemical models\nWhy is this important in the larger perspective?\nThey find that the Earth cou ld have been alternating between two stable states: a haze-free at mosphere\nand an atmosphere with an organic haze. Understanding the concentrations of organics in the\natmosphere constrains the reaction pathways and exit channels that are involved in sulfur MIF.\n1. Haze Free\nSOURCE: S02 photolysis is the major source of sulfur M IF\nEXIT CHANNElS; For the haze-free state, increasing CH4 allows elemental sulfur to polymerize,\npromot ing 58 as the reducing exit channel. At the same time, 502 becomes t he dominant\noxidized exit channel.\n2. Thin Organic Haze\nCH4 : CO2 -0.2\nSOURCE: Opacity of haze lowered the rates of S02 photolysis in the lower atmosphere, but S02\nphotolysis still was a likely source of sulfur MIF. In addition, symmetry dependent de-excitation\nof 502could have also been an important S-MIF source.\nEXIT CHANNElS: S02 and other minor channels.\nSwitching between th ese two states could explain the slope changes in the 6 365/ 6335.\nWeakness\nThey are not able to explain why rotat ion of the data array on t he 633 5 v. 6 36 5 plot is happening. They\nsay t hat\" a rotation of the arrays to different slopes instead implies a change in the nature of the\nprimary S-MIF signature, either due to a change in 6 36S/tJ.335 for a single atmospheric signal, or due to\nvariable amounts of mixing between atmospheric sources wit h differe nt 6 365/ 6335\" (pg. 2). However,\nt hey are not able to specify which sources could produce the signal t hat is demonstrated in the plot.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n12.491 Non-conventional Light Stable Isotope Geochemistry\nSpring 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Equilibrium iron isotope fractionation factors of minerals: Reevaluation from the data of nuclear inelastic resonant X-ray scattering and Mossbauer spectroscopy.",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-491-non-conventional-light-stable-isotope-geochemistry-spring-2012/b4fbbc979c0e591290de8663ddebe9c9_MIT12_491S12_EquilibriIron.pdf",
      "content": "Review of:\nPolyakov V.B., Clayton R.N., Horita J. and Mineev S.D. (2007) Equilibrium iron isotope fractionation\nfactors of minerals: Reevaluation from the data of nuclear inelastic resonant X-ray scattering and\nMossbauer spectroscopy. Geochim. Cosmochim. Acta 71, 3833-3846.\nMajor points:\n-\nBuilds on earlier work by Polyakov and others to calculate iron isotopic l3-factors from\nmeasured Mossbauer second-order Doppler shift (SOD) and adds new calculations based on the\nphonon density of state determined by inelastic nuclear resonance x-ray scattering (INXRS)\n-\nDoes this for several crystalline solids, including metallic iron, iron oxides, and iron sulfides with\nan emphasis on examining the widest possible range of oxidation states\n-\nFinds good agreement between methods as well as with established sulfur isotope\ngeothermometers among sulfides, calls into question the Mossbauer SOD for magnetite as\nreported by De Grave et al (1993) and Persoons et al. (1993) and adjusts these calculations\n-\nDemonstrates correlation between j3-factors and iron oxidation state; j3-factors are larger for\nhigher oxidation states.\nMethods:\nThis paper uses the primary equation,\nlnp = 6m(KE _~)\nm' RT\nwhere KE is the kinetic energy per mole of iron. This quantity is determined by one of two\nmethods:\nMossbauer spectroscopy, using the equation,\ns=\n-KE\nme\nwhere S is the Mossbauer second-order Doppler shift.\nInelastic Nuclear Resonant X-ray Scattering measures the PDOS g(e)directly,\nKE = 31z fmax E (e/kT)g(e)de\nE(e/kT) -\n;~kT) + 0.5 e/kT (This is a Bose-Einstein distribution)\nkT\nexp e kT -1\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n12.491 Non-conventional Light Stable Isotope Geochemistry\nSpring 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Mass-Dependent and -Independent Fractionation of Hg Isotopes by Photoreduction in Aquatic Systems",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-491-non-conventional-light-stable-isotope-geochemistry-spring-2012/6383a71608a71dd98fcb1d1612cc4e4d_MIT12_491S12_MassDependent.pdf",
      "content": "Reviewal:\n8.A. Bergquist, J. D Blum. Mass-Dependent and -Independent Fractionation of Hg\nIsotopes by Photoreduction in Aquatic Systems. Science 318, 417(2007).\nPrimary question\nInvestigation of Hg MDF and MIF and application to\nunderstanding global Hg cycle (reservoir sizes, fluxes, etc.).\nWhy is this important in the larger perspective?\nHg has complex biogeochemistry; varying levels of toxicity\nand mobility.\nStrength\nComparison of controlled experiments and natural systems\nWeakness\nDetection limits-experiments done at higher [Hg] than\nnatural systems, so relationships measured more qualitative\nthan quantitative\nNovel interpretation\nProponent magnetic isotope effect\nAppl'n to bioaccumulation studies and fluxes btwn reservoirs\nHow has this changed/advanced our understanding of\nthe issue?\nTrigger for more study-since examined fxn'n btwn snow\natm, wavelengths light in photoreduction\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n12.491 Non-conventional Light Stable Isotope Geochemistry\nSpring 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Triple-isotope composition of atmospheric oxygen as a tracer of biosphere productivity",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-491-non-conventional-light-stable-isotope-geochemistry-spring-2012/51adb687d13a9251c582639d320f95db_MIT12_491S12_TripleIsotope.pdf",
      "content": "Review 01:\nTriple-isotope composition of atmospheric oxygen as a tracer of biosphere productivity\nLuz et aI., Nature 1999\nThere are two primary controls on the triple-isotope composition e60 , 170 . 180 ) of atmospheric\n0 ,:\nI) photosynthesis and respiration (mass dependent fractionation : 170 enrichment is about\nhalf 180 enrichment)\n2) photochemical reactions in the stratosphere (mass independent fractionation; 170 and 180\nenrichment equal)\nThis paper describes a terrarium experiment used to simulate biological fractionation.\nInitially, air in the terrariums had the 170 anomaly characteristic of ambient air. After 100+\ndays, the anomaly had been removed.\n6, 0 is deviation from nonnal MDF:\nLl170 ~ 0170 - 0.5210\" 0\nIn terrarium experiment, A 170 = 155 ± 8 per meg with respect to HLA.\nNow, entering the stratosphere ...\nUV photolysis of ozone in the stratosphere results in 170 enrichment of CO2 and 170 depletion of\n0 2, leading to the 155 per meg anomaly.\nThe behavior ofN20 serves as a proxy for C02 distribution in the stratosphere and for C02\nmixing into the troposphere. Pre-industrial ozone levels are estimated using existing models;\nPre-industrial ozone CO2 levels are obtained from ice cores.\nUsing this information, the production rate of 6 17002 is calculated. Accumulation of anomalous\nO2 dctcnnined fTom the calculated production rates is between 104 and 131 per meg.\n\" ... the magnitude of the atmospheric A 17002 anomaly reflects the ratio bctween two\nimportant global processes - biospheric O2 production and stratospheric photochemistry\ninvolving O2,0], and CO2.\"\nApplication: GISP2 Ice Core\n6 170*02 = k[C02]1P (k is a constant relating anomalous O2 production to [C02])\nNonnalized gross biosphere production, t is time before present, 0 is prescnt.\nP,lPo ~ k,/ko([C02].1[C02]o) X (Ll17 O' 02101( [>170 '02),\nCalculated values ofP,lPo range from 0.87 to 0.97 (Table 2)\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n12.491 Non-conventional Light Stable Isotope Geochemistry\nSpring 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Summary of Estrade et al. 2009 (Geochimica et Cosmochimica Acta)",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-491-non-conventional-light-stable-isotope-geochemistry-spring-2012/d127ac02613b9a46ac189bbae4de171f_MIT12_491S12_EquilibDynami.pdf",
      "content": "Summary of Estrade et al. 2009 (Geochimica et Cosmochimica Acta)\nEstrade et al (2009) perform both equilibrium and dynamic (kinetic) evaporation\nexperiments to measure the isotope fractionation between liquid and gas·phase mercury.\nEquilibrium experiments gave them 202aeQliQuid.vapor values of 1.00086, with the vapor depleted in\n6202Hg by 0.86%0, across the range of temperatures tested. Reyleigh·type dynamic\nfractionation experiments produced a fractionation factor at 22°C of 20 2aOyrl liQ Uid _v~por = 1.0067,\nwhich agrees (within uncertainty) to their re-analysis of historical data e02a=1.0076).\nEquilibrium evaporation experiments display mass-independent fractionation in 199Hg and\n201Hg, with 6199Hg = 0.12%0 and 6201Hg = 0.07%0, whereas 200Hg was mass-dependent to within\nthe uncertainty of t he measurement. Smaller 6 199Hg and 6201Hg anomalies were observed in\nthe dynamic experiments, depending upon the conditions. This data produces a 6 199Hg / 6201Hg\nslope of 2.0 ± 0.6, which is (within uncertainty) similar to the predicted nuclear volume isotope\neffect (slope of 2.47), but significantly different from the slopes of 1.00 and 1.36 observed by\nBergquiest and Blum (2007) and attributed to magnetic isotope effect. The authors therefore\nhypothesize that the anomalous isotope fractionation is due to nuclear volume isotope effect.\nThis study is novel and significant because it demonstrates significant mass-independent\nfractionation in the odd isotopes of mercury occurring in a simple physical process (i.e.\nevaporation). Although the effect is small, it could potentially be attributed to a nuclear\nvolume isotope effect. Nuclear volume isotope effects are pred icted to be observed mostly in\nreactions where there are changes in redox state causing a change in the electron configuration\nof the heavy atom. However, in this case a nuclear volume effect is observed where both the\nproduct (HgO vapor) and the reactant (Hgo liquid) are in the same redox stat e. Since\nevaporation of mercury vapor does not involve radicals, it is unlikely that the observed effect\ncould be kinetic in nature. This study is significant in showing that it is possible to observe\nnuclear volume isotope effects in physical processes with no change in redox state. However,\nthe isotope effects observed in these experiments are unlikely to be relevant in earth surface\nenvironments, since the mercury MIF caused by photoreduction of mercury and methylmercury\nproduce a much stronger signal that more closely matches that observed in natural samples.\nThis study had several strengths. The authors did a good job reviewing the theory and\nusing the theory to explain their experimental resu lts. They also went back and re-analyzed\nhistorical literature data from the 1920's, converting it from density data to the modern delta\nnotation and showing that it is consistent with their experiments. In addition, the equilibrium\nexperiments were well designed, although I do not believe they justified strongly enough that\nthey had actually reached equ ilibrium. I thought the dynamic experim ents might be measuring\nadditional isotope fractionations beyond that from evaporation, such as an effect of\ncondensation on the walls, diffusion through the system, or possibly an effect from the large\ntemperature gradient in the system.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n12.491 Non-conventional Light Stable Isotope Geochemistry\nSpring 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}