{
  "course_name": "Nonlinear Dynamics I: Chaos",
  "course_description": "No description found.",
  "topics": [
    "Mathematics",
    "Computation",
    "Differential Equations",
    "Linear Algebra",
    "Mathematics",
    "Computation",
    "Differential Equations",
    "Linear Algebra"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nPrerequisites\n\nPrerequisites for this course are 8.02\nElectricity and Magnetism\n, and\n18.03\nDifferential Equations\n. Knowledge of ordinary differential equations is essential. Some linear algebra (knowledge of eigenvectors and eigenvalues) is also necessary. Having some experience with numerical computation is helpful but not necessary. This is an undergraduate course. Graduate students are reminded that this course carries no graduate credit and are encouraged to take\n18.385J\nNonlinear Dynamics and Chaos\ninstead.\n\nCourse Description\n\nThis course provides an introduction to nonlinear dynamics and chaos in dissipative systems. The content is structured to be of general interest to undergraduates in engineering and science. The course concentrates on simple models of dynamical systems, and their relevance to natural phenomena. The emphasis is on nonlinear phenomena that may be described by a few variables that evolve with time. The theory of nonlinear continuum systems is covered in the sequel to this course,\nNonlinear Dynamics II: Continuum Systems\n(12.207J/18.354J).\n\nFormat\n\nTo promote the notion of numerical experiments, we assign several laboratory-like problem sets that require the use of a computer. The computer exercises usually use MATLAB(r), but students are free to use whatever software tools and computers they desire. No previous experience with numerical computation is necessary.\n\nRequirements and Grading\n\nThere will be problem sets assigned weekly (or nearly weekly). Some problems will be analytical while others will require use of a computer.\n\nThere will be a midterm examination. The midterm exam will have a classroom written portion and a take-home computational portion.\n\nAt the end of the semester there will be a major assignment (in lieu of a final exam) due at the time of the last scheduled class. This assignment will require the assimilation of the semester's work.\n\nProblem sets should represent the student's own work but cooperation in the form of, say, comparison of one's numerical results with another's, or helpful hints, is welcome. The final assignment, however, must be an entirely individual effort. Students are not permitted to consult previously corrected problem sets, or solution sets or exams from previous years.\n\nThe final grade will be based approximately as follows:\n\nACTIVITIES\n\nPERCENTAGES\n\nGeneral Problem Sets\n\n50%\n\nFinal Problem Set\n\n25%\n\nMidterm Exam\n\n25%\n\nTextbooks\n\nThe most important book, which we recommend that you purchase, is:\n\nStrogatz, S.\nNonlinear Dynamics And Chaos: With Applications To Physics, Biology, Chemistry, And Engineering\n. Westview Press, 2001. ISBN: 9780738204536.\n\nStrogatz will be especially valuable for our discussion of stability of ordinary differential equations.\n\nThe following book may also be useful:\n\nBerge, P., Y. Pomeau, and C. Vidal.\nOrder within Chaos\n. Wiley-VCH, 1987. ISBN: 9780471849674.\n\nAdditional book recommendations are found in the\nreadings\nsection.\n\nList of Course Topics\n\nFree oscillators: Linear and nonlinear pendulum. Phase space and phase portraits. Fixed points. Stability. Liouville's theorem and conservation of areas in phase space. Damped pendulum: At-tractors. Contraction of areas in phase space.\n\nForced oscillators: Van der Pol equation. Limit cycles. Forced pendulum. Resonance. Stability.\n\nIntroduction to bifurcation theory.\n\nMethods for analyzing periodic, quasiperiodic, and aperiodic systems. Poincare sections. Floquet matrices and stability. Maps. Reduction of flows to maps. Reconstruction of phase space from one-dimensional signals.\n\nStrange attractors. Dissipation, attraction, and reduction of dimensionality. Minimum dimension of deterministic aperiodic systems. Sensitivity to initial conditions. Stretching and folding. Rossler attractor. Derivation of Lorenz attractor. Stability of Lorenz equations. Henon attractor.\n\nQuantitative analysis of strange attractors. Lyaponov exponents. Fractal dimension.\n\nTransitions to chaos. Period doubling: logistic map, Feigenbaum numbers, scaling, and universality. Quasiperiodicity. Intermittency. Illustrations from experiments.\n\nIf time permits, various applications of the course material in geosciences, math biology, etc.",
  "files": [
    {
      "category": "Resource",
      "title": "Matlab primer",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-353j-nonlinear-dynamics-i-chaos-fall-2012/e037f28c164ac9ab1b92c82594fe4f99_MIT18_353JF12_matlabPrimer.pdf",
      "content": "2.050J/12.006J/18.353J Nonlinear Dynamics I: Chaos, Fall 2012\nMatlab primer\nThe objective of this document is to get you to a position where you can complete the MATLAB portion\non the second problem set. It is by no means a comprehensive introduction to MATLAB.\nFigure 1: Example of a MATLAB window GUI\nDownload MATLAB\nIf you do not already have MATLAB on your computer you will need to download it on the MIT website\nhttp://web.mit.edu/student-matlab/ . This is a free package that only requires you have an MIT\ncertificate on your computer. Downloading it might take a while. If you don't have a certificate, you can\n*\nuse Matlab at Athena clusters.\nDownload MATLAB Codes from Course Website.\nOnce MATLAB is up and running on your computer you will need to download the codes from the course\nwebsite. Make sure you put this file in the Matlab working directory (to be discussed in the next section).\n* Athena is MIT's UNIX-based computing environment. OCW does not provide access to it\n\nWorking in the MATLAB environment\nAfter the download is completed, open the application. You will be brought to the MATLAB window\n(see an example in Figure 1). At the top center of the GUI is the command directory location bar. You\ncan put in whatever directory you would like to work out of. Put the M-files you download from the\ncourse website in the working directory. To the left of the GUI is the list of files in your Command\nDirectory; make sure that the M-files are there. Finally the command line is where you will start to run\ndifferent commands ( try a couple things in this window, for example: 1+1, sqrt(9), a = [1 2 3]';\nfigure(1); plot(a); ). To make sure everything is working fine type in help name-of-the-file.m\nin the command line. If the files are in place a brief message should come up in the Command Window.\nIf you need help and examples with any matlab function, for example plot, type in help plot . A\ndescription of the function with several examples will appear.\nWorking with the M-files\nWithin MATLAB there is the ability to write programs which can complete certain tasks. These files are\ncalled M-files, and you just downloaded the example ones for this Pset. You will start to write your own\nM-files as the course goes along. In order to open the M-files, find the file you would like to open in the\nCurrent Directory window on the left side of the GUI. Alternatively you can use the Open selection in\nthe File drop down in the top left of the GUI. You will have to modify the file you got for this Pset a\nlittle bit. The examples within the code that you can use as a template.\nComments\nWe will continue to use MATLAB on a regular basis and you will be expected to have developed a\ncertain skill set after each Pset. In this case we are expecting that you are capable of opening MATLAB,\nworking with M-files, inputing data, and working with plots. There is a great set of support files built\ninto MATLAB. Simply, type in helpdesk into the command line.\nAlso, within the help files there is a section on matrices and arrays that you should be familiar with. This\nsection is located in MATLAB >> Getting Started >> Matrices and Arrays. The opening page of this\nsection is shown in Figure 2.\nOther Matlab resources at MIT\nSoftware at MIT: http://web.mit.edu/matlab/www/\n\nFigure 2: Example of Matrices and Arrays in helpdesk\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n18.353J / 2.050J / 12.006J Nonlinear Dynamics I: Chaos\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Problem Set 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-353j-nonlinear-dynamics-i-chaos-fall-2012/875c7ea0a98fc10d090d280febfabc73_MIT18_353JF12_pset1.pdf",
      "content": "2.050J/12.006J/18.353J Nonlinear Dynamics I: Chaos, Fall 2012\n\nDue at noon on Friday Sept 14th, in the box provided (to the right of the entrance).\nNo late psets are accepted. If you collaborated with another student, list their names on the title sheet.\nThe work that you submit must be your own.\nMain concepts: phase space (phase line, phase plane), fixed points, their stability, review of linear\nalgebra (matrices, eigenvectors, eigenvalues) and its application to linear systems of ODEs.\nReading: Strogatz Ch.2, 18.03 notes (LS.1-6) (see below)\nHelpful review material from 18.03\n- Review of 2nd order ODEs with constant coefficients - video lectures - see Lecture 9: http://ocw.\nmit.edu/courses/mathematics/18-03-differential-equations-spring-2010/video-lectures/\n- 18.03 notes are on http://math.mit.edu/suppnotes/suppnotes03/index.html.\nProblem 1: 1D dynamical systems. Population growth. The Allee effect\n\nProblem 2: 1D dynamical systems. Potentials. Intro to bifurcations.\nThe dynamics of first order systems x = f(x), can be pictured as a particle sliding down the walls of a\ndV (x)\npotential well, where the potential V (x) is defined by f(x) = -\n(Reference: Strogatz ch. 2.7).\ndx\n1. Given the system x = sin(x) + α, where α is a real number, find the potential V (x), sketch it, show\ngraphically how a particle would move for different values of α (α = 0, 0.9, 1, 1.1).\n2. For the same values α find fixed points, their stability, sketch a phase portrait (phase line) with\narrows representing the flow between the fixed points, label the fixed points as stable, unstable,\nsemistable.\n3. Sketch a graph of the x-coordinate of the fixed points as a function of α, for 0 ≤ α ≤ 1.2. Describe\nwhat happens when α passes through 1? You just witnessed the phenomenon of a \"bifurcation\".\nProblem 1: 1D dynamical systems. Population growth. The Allee effect\nStrogatz 2.3.4\n\nHow would you define this concept based on the one example of a bifurcation that you just witnessed?\n(Do not look this concept up in the book, it has to be your definition that results from what you\nobserve).\n4. In another system x = (x + 1)(x - α) with a parameter α, sketch the graphs of the x-coordinate of\nthe fixed points, mark on the graph where the fixed point is stable or unstable\n5. The phenomenon of a \"bifurcation\" occurs again at α = -1. Describe what happens, and modify\nyour definition of a \"bifurcation\" that you had above to include this case in the definition. Sketch\nthe phase line for the values of α slightly below, at, and slightly above the bifurcation value α = 1.\n6. For the system x = (x+1)(x-α), sketch the phase line for the two values of α, before the bifurcation\nand after the bifurcation.\nProblem 3: Linear oscillators (review of 18.03)\nGiven the equations for linear oscillators,\n- find the general solution,\n- classify the oscillators as underdamped, overdamped, critically damped or undamped,\n- plot several trajectories as a function of time with different initial conditions.\n\na) θ + 10 θ + 41 θ = 0,\n\nb) θ + θ = 0,\n\nc) θ + 11 θ + 30 θ = 0,\n\nd) θ + 6 θ + 9 θ = 0.\nProblem 4: Linear systems of ODEs\nFor each of the equations in Problem 3,\n1. change variables to (x, y), where x = θ, and y = θ ,\n2. rewrite the second order ODE as a system of first order ODEs for x and y and a matrix A,\n3. find eigenvalues and eigenvectors of the matrix A,\n4. find a general solution to the ODE,\n5. (matlab) in the (x, y) plane plot some solutions (with different initial conditions) for each of the\ncases, plot eigenvectors (if they are real), and label the systems as underdamped, overdamped,\ncritically damped or undamped. What can you say about the stability of the origin (x, y) = (0, 0)?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n18.353J / 2.050J / 12.006J Nonlinear Dynamics I: Chaos\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MATLAB primer2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-353j-nonlinear-dynamics-i-chaos-fall-2012/2357fa643e88ca50f629620e364d593d_MIT18_353JF12_matlabPrim_2.pdf",
      "content": "2.050J/12.006J/18.353J Nonlinear Dynamics I: Chaos, Fall 2012\nMATLAB primer 2\nThe objective of this document is to get you to a position where you can complete the MATLAB portion\non the PSet 6.\nIn the previous assignments we were able to plot a phase portrait using the function streamslice. This\nplotting tool does a good job of representing the qualitative features of the phase portrait. However the\nuser is at the mercy of the code and doesn't necessarily have the ability to control where trajectories\nstart. Additionally this function does not give any time dependent information. What will be explained\nin this MATLAB primer is a function called ode45. This function numerically solves the system for a\ngiven initial condition and lets the users manipulate the results however they please.\node45 Set Up\nWhen trying to solve a system with ode45, two codes will actually have to be developed. These two codes\nare the \"system\" and \"solver\" codes. Both these codes will have to be in the same folder that you are\nworking out of. Within the \"system\" code you will create a set of state equations, which will be used by\nthe solver. These state equations must be of the form\ndx1\n=\nf1(x1, x2, ...)\ndt\ndx2\n=\nf2(x1, x2, ...)\ndt\n. . . =\n. . .\ndxn\n=\nfn(x1, x2, ...)\ndt\nWithin the \"solver\" code you will select the initial conditions and have the solver command line included.\nThe solver command line\nA sample solver command line is as follows\n> > [T Y] = ode45(@sys,[0:.1:10],[1 0]);\nThe solver ode45 has three inputs. The first input '@sys' is a function handle. It tells ode45 which\nfunction to use as the system (this example will call the m-file sys.m). The next input '[0 : .1 : 10]' is\nthe vector of time-steps. The system will be integrated from t0 = 0 to tfinal = 10 with a time-step 0.1.\nFinally the last input is '[1 0]' is the vector of initial conditions. This example is a second order system,\nwhich has the initial conditions x(0) = 1 and x ′(0) = 0.\nThere are two outputs for this command line. The first is 'T ' which is the time output by the command\nand the other output, 'Y ', is the system values as a function of time. In this example there are 101 time\nsteps and the dimensions of T are 101x1 and the dimensions of Y are 101x2. In this case the value Y (3, 1)\nis the value of the first system variable (i.e. x) at the third time step and the value of Y (10, 2) is the\nvalue of the second system variable (i.e. x ) at the tenth time step.\n\nY\n-1\n-2\n-3\n-4\n-5\n-6\n-4\n-2\nX\nFigure 1: Phase plane created using ode45 starting a variety of initial conditions\nFigure 2: Phase plane created using streamslice starting a variety of initial conditions\n-6\n-4\n-2\n-5\n-4\n-3\n-2\n-1\nY\nX\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n18.353J / 2.050J / 12.006J Nonlinear Dynamics I: Chaos\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Problem Set 2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-353j-nonlinear-dynamics-i-chaos-fall-2012/a7509ba2d86327cb1b0116e40d466703_MIT18_353JF12_pset2.pdf",
      "content": "in the box provided (until 5pm).No late psets are accepted.\n\nIf you collaborated with other students in the class, list their names on the title sheet.\nT he work that you submit must b e your own.\nStrogatz Ch. 5, 6.1-6.4.\nthere is a sample MAT L AB code with examples of how to plot phase portraits and\nDue by the end of day on Thursday,\nReading:\nMATLAB help:\nProblem 1: Stability of fixed points of linear systems of ODEs\n2.050J/12.006J/18.353J Nonlinear Dynamics I: Chaos, Fall 2012\nProblem Set 2\nvector fields of a dynamical system on a plane.\nMain concepts: phase portraits for linear systems, fixed points of nonlinear systems, their stability,\nphase portraits in the vicinity of a fixed point.\nStrogatz 5.1.10\n\nProblem 2: Romeo and Juliet. Linear systems of ODEs\nIf x is a measure of how attracted Juliet is to Romeo, and y is a measure of how attracted Romeo is to\nJuliet, and we model the evolution of their relationship as a linear system x = ax + by, y = cx + dy, then\n1. do opposites attract? (i.e. analyze x = ax + by, y = -bx - ay).\n2. is there a happy ending in the story of romantic clones x = ax + by, y = bx + ay?\nProblem 3: Rabbits versus Sheep. Phase portrait for nonlinear systems of ODEs\nThe evolution of the populations of rabbits (x ≥ 0) and sheep (y ≥ 0) is described by\nx = x(3 - 2x - y), y = y(2 - x - y).\n- Find fixed points, linearize the system near the fixed points, find eigenvalues, eigenvectors, determine\nthe stability of the fixed point, and sketch the local phase portrait.\n- Attempt to complete the sketch of the phase portrait for the full system\n- (MATLAB) plot the phase portrait. Compare the plot to your sketch, note any differences.\n- Describe different scenarios that the populations of rabbits and sheep would undergo depending on\nthe populations at time zero.\nProblem 4: Nonlinear systems which depend on a parameter (preview of bifurcations)\n- Find fixed points, classify their stability (it will depend on α).\n- Identify the values α∗ of the parameter α, such that when α passes through α∗, the phase portrait\nqualitatively changes (fixed points appear, disappear, change stability, etc.). We say that at these\nvalues of α the \"bifurcation\" phenomenon occurs.\n- Sketch (or plot with MATLAB) local phase portraits when α is just below, at, and just above α∗ .\n- As α passes through α∗, does the vector field far away from the fixed points change a lot?\na) x = αx - x , y = -y,\nb) x = αx + x , y = -y.\nProblem 5: Centers are not structurally stable\nFor the following nonlinear system x = -y + αx3 , y = x + αy3 one of the fixed points is at the origin.\nWhich phase portrait should the point have? It turns out that for systems with Re(λi) = 0 at the fixed\npoint the linear analysis is inconclusive. We demonstrate it below.\na) linearize the system at the fixed point at the origin and confirm that linear analysis suggests that the\nfixed point is a center\nb) change variables from (x, y) to polar coordinates (r, θ) using x = r cos θ, y = r sin θ, and the fact that\nx + y = r2, and θ = tan-1(y/x)\nc) for this new system r = f(r, θ), θ = g(r, θ), analyze the first equation (which you will probably have in\nthe form r = f(r, x, y)) and the fixed point r = 0. Show that for some values of α the origin (x, y) = (0, 0)\n(which corresponds to r = 0) is stable, while for other values it is unstable. Comment on why this\ndisagrees with the conclusion of the linear theory.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n18.353J / 2.050J / 12.006J Nonlinear Dynamics I: Chaos\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Problem Set 3",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-353j-nonlinear-dynamics-i-chaos-fall-2012/c07ca9e0c681691335dfe9681afb81cb_MIT18_353JF12_pset3.pdf",
      "content": "2.050J/12.006J/18.353J Nonlinear Dynamics I: Chaos, Fall 2012\nProblem Set 3\nDue at 12:01 pm on Friday, September 28th, in the box provided.\nNo late\npsets are accepted. If you collaborated with other students in the class, list their names on the title sheet.\nThe work that you submit must be your own.\nMain concepts: fixed points in nonlinear systems, their stability, phase portraits, conservative systems\nand nonlinear centers, non-dimensionalization.\nReading: Strogatz Ch. 6.\nProblem 1: NL systems, linearization, phase portraits\nProblem 2: Conservative systems: Glider\nStrogatz 6.5.19\nStrogatz 6.5.14\n\nProblem 3: Conservative systems: General relativity and planetary orbits\nProblem 4: Conservative systems\nFor the following system x = (2 cos x - 1) sin x,\n1. Find the potential and the conserved quantity,\n2. Rewrite the equation as a system in the (x, y) plane using y = x , find the fixed points, their stability\n3. Sketch the phase portrait, plot it in MATLAB.\nStrogatz 6.5.7\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n18.353J / 2.050J / 12.006J Nonlinear Dynamics I: Chaos\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Problem Set 4",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-353j-nonlinear-dynamics-i-chaos-fall-2012/1ff1763926ceba49e2137f55c1d30897_MIT18_353JF12_pset4.pdf",
      "content": "2.050J/12.006J/18.353J Nonlinear Dynamics I: Chaos, Fall 2012\nProblem Set 4\nDue at 12:01 pm on Friday, October 5th, in the box provided. No late psets\nare accepted. If you collaborated with other students in the class, list their names on the title sheet. The\nwork that you submit must be your own.\nMain concepts: Three bifurcations in 1D dynamical systems (saddle-node, transcritical, and pitchfork).\nReading: Strogatz Ch. 3.\nProblem 1: Bifurcations of 1D dynamical systems. Normal forms.\nFor each of the following problems,\n- sketch all the qualitatively different vector fields that occur as r is varied.\n- Find at which x and for which critical values of the parameter r the bifurcation occurs.\n- Which bifurcation is it (saddle-node, transcritical, supercritical pitchfork, or subcritical pitchfork)?\n∗\n- Finally, sketch or plot in MATLAB the bifurcation diagram of fixed points x versus r, and mark\nthe stable branches as solid lines, while the unstable branches as dashed lines. (Note: for some of\nthe cases it is simpler to plot the bifurcation in MATLAB).\n(a) x = r - cosh x\nx\n(b) x = xr - xe\n(c) x = rx - sinh x\n(d) x = 5 - re-x2\nx\n(e) x = rx + 1+x2\n(f) x = r - cos x\nProblem 2: Hierarchy of models of fishery\n(based on Strogatz 3.7.3 and 3.7.4)\nTo understand the underlying dynamics of a real-world problem, one frequently considers a hierarchy of\nmodels - from the simplest one to a more complicated one. In this problem we consider three models of\nfisheries of increasing complexity. Your task is to analyze them using the material from the class, and to\nsee if one model is better than the other (for example, the dynamics of which one is more physical).\nThe simplest model for fishery would be that in the absence of fishing the population of fish is assumed\n\nto grow logistically N = rN(1 - N/K). Then to model the fishing rate the simplest choices are:\n\n(a) N = rN(1 - N/K) - H, where the fish is harvested at a constant rate H,\n\n(b) N = rN(1 - N/K) - HN,\n\nN\n(c) N = rN(1 - N/K) - H A+N ,\n\n1. Interpret physically the form of the harvesting rate in (b) and (c). What does the parameter A\nstand for physically. Which model of a harvesting rate do you think is more physical?\n2. Non-dimensionalize the models to obtain the forms\na) x = x(1 - x) - h\nb) x = x(1 - x) - hx\nx\nc) x = x(1 - x) - h a+x\n3. For models (a) and (b) find the fixed points and determine their stability for different values of h.\nAre any of them unphysical?\n4. (MATLAB) plot the bifurcation diagrams for the cases (a) and (b). Label stable, unstable branches\nand bifurcation points.\n5. Do the normal form analysis in the cases (a) and (b) and obtain analytically the results you got\nusing MATLAB in the item above.\nFor model (c):\n6. Show that the system can have one, two, or three fixed points, depending on the values of a and h.\nClassify the stability of the fixed points in each case.\n7. Analyze the dynamics near x = 0 and show that the bifurcation occurs when h = a. What type of\nbifurcation is it?\n8. Show that another bifurcation occurs when h =\n(a + 1)2, for a < ac, where ac is to be determined.\nClassify the bifurcation.\n9. Plot the stability diagram of the system in (a, h) parameter space. (The stability diagrams in 2\ndimensional parameter space will be shown in class on Tuesday). Can hysteresis occur in any of the\nstability regions?\nAnd finally, your conclusions:\n10. Now that you know the dynamics of the three models and its dependence on parameters, conclude\nwhich model is more realistic, and which important (or not) physical effects it takes into account.\nWhich, if any, important effects does it miss?\nMatlab help:\nThere is an easy way to plot parametrized curves in MATLAB which, once you see it, is obvious. It is\nvery useful for plotting bifurcation curves.\nUsually one is plotting a curve, for example\nx = 0:0.1:10; plot(x,sin(x));\nHowever, say you need to plot a bifurcation diagram for x = r + sin(x), where r is a parameter, on the\n(r, x) plane. Then you can reverse the arguments in plot:\nx = -2:0.2:2; plot(-sin(x),x);\nIn general, when given a parameterized curve x(θ) = cos(θ), y(θ) = sin(θ), to plot it in MATLAB do\ntheta = [0:0.1:2*pi]; x = cos(theta); y = sin(theta); plot(x,y); axis equal;\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n18.353J / 2.050J / 12.006J Nonlinear Dynamics I: Chaos\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Midterm Practice Problems",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-353j-nonlinear-dynamics-i-chaos-fall-2012/6804ab2c7b66884cbcb57a4c002baa6e_MIT18_353JF12_midtermPra.pdf",
      "content": "2.050J/12.006J/18.353J Nonlinear Dynamics I: Chaos, Fall 2012\nMidterm Practice Problems\nThe midterm exam will have a classroom written portion and a take-home computational\nportion.\nThe best preparation for the exam is problem sets (the solutions are posted online). The solution to the\nPSet 6 will be online on Friday just after it is due.\nTopics\nYou now know how to analyze models of physical phenomena that are modeled as one and two-dimensional\nsystems of ODEs that can depend on parameter. The steps in the study are\n1. Non-dimensionalize the system, thus reducing the number of parameters in the problem.\n2. Find fixed points, study the local phase portrait near these fixed points\n(a) if the fixed points are hyperbolic, then the linear theory gives the correct phase portrait\n(b) if the linear system predicts centers, then one has to do extra work. Nonlinear centers appear\nin the cases of conservative systems, reversible systems. Otherwise more work is needed to\ndetermine if the phase portrait is a spiral, or a center, or something else. (Strogatz Ch. 7).\n(c) in case of zero eigenvalues one has to use different techniques (for example, graphical techniques)\nto deduce the stability of a fixed point. For example x = x2 (x = 0 is semi-stable), x = x3\n(x = 0 is unstable), etc.\n3. Deduce some of the characteristics of the global phase portrait (look at nullclines, \"fences and\nfunnels\" techniques from 18.03, perhaps you can find a trapping region).\n4. Check if there could be closed orbits in the system, or you can rule out their existence\n(a) in case of Li enard systems, there exists a unique stable limit cycle\n(b) check the index theory, perhaps you can show that there are no closed orbits\n(c) check if the system is conservative (then in 2D you can only have saddles and centers)\n(d) check if you can rule out closed orbits completely (Dulac's criterion, existence of a Liapunov\nfunction, gradient systems)\n5. Study dependence of the system on parameters - bifurcation theory.\n(a) Bifurcations we studied in both 1D and 2D are saddle-node, transcritical and pitchfork bifur\ncations (but in PSets you had examples of others).\n(b) Find where they occur (in 1D for x = f(x, r), r-parameter, can look at the system f(x, r) = 0,\n∂f(x, r)/∂x = 0).\n(c) Expand f(x, r) near a critical point x = x∗ (fixed point) and r = rc (where the bifurcation\nhappens), find the normal form, deduce the type of the bifurcation\n\n(d) Sometimes it is easier to see graphically when a bifurcation occurs. For example, if\n-x\nx = f(x) = e-x - (x + a), then the bifurcation occurs when the curve y = e\ntouches the\nstraight line y = x + a. The same graphical technique is applicable to the second order systems\nwhen you can check when the nullclines start to intersect as you vary a parameter.\n6. Last but probably the most important item: interpret your answer physically. For example, in\nthe laser system you find a transcritical bifurcation, and that a stable fixed point at zero loses\nits stability at the bifurcation point and a new stable equilibrium exists for the larger value of\nparameter. However, you should reinterpret your answer physically that below the critical value of\nthe parameter the system acts like a lamp, while above the \"laser threshold\" it acts like a laser.\nSample problems\n1. Non-dimensionalization:\nPset 2, 3, 6\nExtra sample problems: 3.7.5, 6.4.4-6, 6.4.7, 8.1.10 (these are all long problems, they all have good\nexamples of non-dimensionalization, but if you try to fully complete all the questions in them, it\nwill take a very long time)\n2. Stability of fixed points, linear phase portraits:\nall psets. Special cases: Pset 2, problem 1.\nExtra sample problems:\nx = x3 , y = y\nx = -x , y = -y\nStrogatz problems: 5.2.3 - 5.2.10.\n3. Nonlinear centers:\nPst 2, problem 5, Pset 3 (conservative systems), reversible systems (Strogatz, problems in 6.6).\nExtra sample problems: 6.5.13\n4. Using nullclines to deduce something about the system:\nin case of bifurcations (Strogatz, example 8.1.1.), in case of a trapping region (Strogatz, Glycosis\nexample 7.3.2).\nExtra sample problems:\n8.1.6,\n5. Closed orbits:\n(1. prove that there are some) NL centers (pset 3), 6.5.3, 6.6.5, 6.1.1\n(2. rule out closed orbits): Pset 6, 6.8.7, 7.2.6, 7.2.8, 7.2.12, 7.2.14\n(3. limit cycles): Pset 6, 7.4.2, 7.1.7\n(4. non-isolated periodic orbits): everything about linear and nonlinear centers\n6. Closed orbits: limit cycle versus centers:\nPet 6, problem 1 (case ε = 0 versus ε > 0).\nExtra sample problems:\n7. Bifurcations in 1D, 1 parameter:\nPset 4,\nExtra sample problems: 3.1.1-4, 3.2.1-4, 3.4.1-4, 3.4.5-10, 3.1.13. Plot bifurcation diagrams. 3.5.4.\n8. Bifurcations in 1D, 2 parametrs:\nPset 4,\nExtra sample problems: 3.7.5\n\n9. Bifurcations in 2D:\nPSet 5, problem 1\nExtra sample problems: 8.1.1-7, 8.1.10, 8.1.13\n10. Index theory:\nPset 5\nExtra sample problems: 6.8.2-5 (unusual examples), 6.8.9, 6.8.6,\nCan there be two fixed points inside a limit cycle? If so, give an example (graphically, do not make\nup equations for it).\n11. Oscillators:\nlinear oscillators: (18.03) underdamped, undamped, critically damped oscillators (Pset 1),\nnonlinear oscillators: x + bx + sin x = 0, Van der Pol, ... (Pset 6, first lectures).\nMatlab\nFor the take-home section, you should be able to plot things in Matlab and be able to use it to make\nsome research conclusions. Sample problems are of the type:\n1. Use streamslice to plot the phase portrait for any of the 2D systems listed above\n2. Use plot to plot bifurcation diagrams and trajectories x(t), y(t) as a function of time\n3. For many problems streamslice does not give good results at all (examples in the last Matlab\nprimer). Use ode45 in those cases, and choose where you start the trajectories yourself.\nYou should be able to plot phase portraits for any one of the problems listed above and in the psets.\nMake sure that your plots are *not* inconclusive. For example:\n1. if you want to show that a trajectory converges to a fixed point, and you compute the trajectory\nvia ode45, choose a long enough time-interval to show that it does.\n2. if you want to show that trajectories are attracted to a fixed point from all directions, pick the\ninitial conditions all around the fixed point, and not in one small area to one side of the fixed point\n3. label your plots accordingly. It is useful to put the parameter value in the title when you vary the\nparameter and have many plots. In the following example we vary μ between 0 and 1 in steps of\n0.1, then plotting something with the title reading mu = 0.3:\n4. We are dealing with solutions to ODEs. They are all differentiable. Therefore in your plots the\nsolutions should never have any corners (which happen if you plot a function with low resolution, for\nexample x = [0:1:10]; plot(x,sin(x)); So always make sure that you have enough resolution\nwhen you plot the trajectories (in phase space, or time-evolution plots).\nmu = [0:0.1:1]; x = [0:0.1:3];\nfor i = 1:length(mu),\nfigure(1);\nplot(x,sin(x)*mu(i));\ntitle(['mu = ',num2str(mu(i))]);\nend\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n18.353J / 2.050J / 12.006J Nonlinear Dynamics I: Chaos\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Midterm: At-home portion",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-353j-nonlinear-dynamics-i-chaos-fall-2012/6f20d1e63cf4d7160173aa60460bfe96_MIT18_353JF12_MidterAtHome.pdf",
      "content": "2.050J/12.006J/18.353J Nonlinear Dynamics I: Chaos, Fall 2012\nMIDTERM (At-home portion)\nProblem 1: Bifurcations - a biochemical switch\nA gene G, usually inactive, is activated by a biochemical substance S to produce a pigment or other gene\nproduct when the concentration S exceeds a certain threshold.\nLet g(t) denote the concentration of the gene product, and assume that the concentration s0 of S is fixed.\nThe model is\nk\ng = k1s0 -\n3g\nk2g +\n(1)\nk2\n4 + g2\nwhere k's are positive constants. The production of g is stimulated by s0 at a rate k1, and by autocatalytic\n(positive) feedback process modeled by the nonlinear term. There is also a linear degradation of g at a\nrate k2.\n1. Nondimensionalize the equations and bring them to the form\ndx\ndT = s -rx +\nx2\n,\nr > 0,\ns\n1 + x2\n≥0.\n(2)\n2. Show that if s = 0 there are two positive fixed points x if r < r\n∗\nc, where rc is to be determined.\n3. Find parametric equations for the bifurcation curves in (r, s) space.\n4. (MATLAB) plot quantitatively accurate plot of the stability diagram in (r, s) space\n5. Classify the bifurcations that occur.\n6. Assume that initially there is no gene product, i.e. g(0) = 0, and suppose that s is slowly increased\nfrom zero (the activating signal is turned on); What happened to g(t)? What happens if s then\ngoes back to zero? Does the gene turn offagain?\nProblem 2: Nonlinear oscillator\nGiven an oscillator x + bx -kx + x3 = 0, b, k can be positive, negative or zero.\n1. Interpret the terms physically for different values of b and k.\n2. Find the bifurcation curves in (b, k) plane, state which bifurcation happens and what kind of fixed\npoints one has to each side of the bifurcation curve.\n\nProblem 3: Numerical study of the displaced Van der Pol oscillator\nThe equations for a \"displaced\" Van der Pol oscillator are given by\nx = y -a,\ny = -x + δ(1 -x2)y,\na > 0,\nδ > 0.\nConsider a small.\n1. Show that the system has two equilibrium points, one of which is a saddle.\nFind approximate\nformula for small a of this fixed point. Study this system numerically with ode45.\n2. Submit the plots of phase plane with trajectories starting at different points (to illustrate the\ndynamics) for δ = 2, a = 0.1, 0.2, 0.4, and observe that the saddle point approaches the limit cycle\nof the Van der Pol equation.\n3. Find numerically the value of the parameter a to two decimal points when the saddle point collides\nwith the limit cycle. What happens to the limit cycle after this collision?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n18.353J / 2.050J / 12.006J Nonlinear Dynamics I: Chaos\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}