{
  "course_name": "Nuclear Engineering: Science, Systems and Society",
  "course_description": "In this exploratory seminar, first-year undergraduate students learn the basic physics of nuclear energy and radiation, and learn to communicate their knowledge and perspective by writing a traditional Op-Ed piece. The technical content emphasizes the unique attributes and challenges of nuclear energy as a low-carbon solution as well as the peaceful applications of ionizing radiation to help humankind. The open-ended writing project combines personal creativity and technical knowledge to share important messages about science. The course employs blended learning, as students use the online course 22.011x, freely available on the MIT Open Learning Library, to learn the technical content, and meet together in person for the communication component, developing and polishing their Op-Eds.",
  "topics": [
    "Energy",
    "Climate",
    "Hydrogen and Alternatives",
    "Nuclear",
    "Technology",
    "Social Science",
    "Communication",
    "Energy",
    "Climate",
    "Hydrogen and Alternatives",
    "Nuclear",
    "Technology",
    "Social Science",
    "Communication"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 1 hour / session\n\nPrerequisites\n\nThere are no prerequisites.\n\nCorerequisites\n\nStudents must also enroll in the online course\n22.011x Nuclear Energy: Science, Systems and Society\n, freely available on the\nMIT Open Learning Library\n.\n\nCourse Description and Format\n\nIn this exploratory seminar, first-year undergraduate students learn the basic physics of nuclear energy and radiation and learn to communicate their knowledge and perspective by writing a traditional Op-Ed piece. The course employs blended learning, as students use\nthe online course 22.011x\n, freely available on the MIT Open Learning Library, to learn the technical content, and meet together in person for the communication component, developing and polishing their Op-Eds.\n\nThe course's technical content offers an introduction to the basic physics of nuclear energy and radiation, with an emphasis on the unique attributes and challenges of nuclear energy as a low-carbon solution. Peaceful applications of ionizing radiation to help humankind, such as reactors for materials science research, nuclear medicine, and security initiatives, are also introduced. The course explores fission energy, establishing the scientific, engineering, and economic basis for fission reactors, and describes the state of the art in nuclear reactor technology. We also learn about magnetic fusion energy research, with lectures covering the scientific and engineering basis of tokamaks, the state of the art in world fusion experiments, and MIT's vision for a high-magnetic-field fusion reactor.\n\nThe open-ended writing project combines personal creativity and technical knowledge to share important messages about science. Presenting an exciting and engaging yet technically accurate short summary of a controversial scientific topic is an art form. Many scholars use the Op-Ed format to communicate with the public. Students will prepare a well-researched, one-page technical note (~850 words), and then transform this technical note into an Op-Ed. Working with the\nNuclear Science and Engineering Communication Lab\n, students will receive training on how to write a traditional Op-Ed piece (~750 words) of the kind seen in newspapers. Students will then have the option to present their opinion pieces to the class in any format they wish, whether in a formal presentation or through short films, YouTube lectures, songs, skits, etc.\n\nCourse Objectives\n\nIntroduction to the breadth of nuclear science and engineering fields of study\n\nExposure to technical research\n\nDevelopment of scientific communication skills\n\nClass Structure\n\nLectures (readings, assessments, video lectures) for the class will be online, through the online site 22.011x. Students are expected to keep up with this material in order to participate appropriately in discussions in class, as well as using the material to prepare their Op-Ed.\n\nIn-person class meetings will focus on discussions, student presentations, and activities. Students should expect to spend about 2 hours per week on a combination of online coursework (watching lectures and completing online assignments) and assignments relating to the in-class activities and student presentations. We expect to have many class meetings dedicated to work on the Op-Ed projects, or for expert guest speakers.\n\nGrading\n\nactivities\n\npercentages\n\nClass Discussions/Peer Review\n\n10%\n\nCompletion of online course material, 22.011x\n\n30%\n\nTechnical Note (1-2 pages, see example)\n\n25%\n\nFinal Op-Ed (~750 words, see examples)\n\n25%\n\nPresentation of Op-Ed (media of choice)\n\n10%\n\nEthics\n\nThis class is about two things: learning to present your opinion and your thoughts about complex technical subjects using an Op-Ed format, and learning how to provide a summary of facts using a technical note format. It will not benefit you at all to cheat or plagiarize. Plus, we are super exited to learn what YOU THINK! If you have questions about how to reference sources properly, don't worry, we will cover how to do this in class.",
  "files": []
}