{
  "course_name": "Numeric Photography",
  "course_description": "The aim of the students from the Numeric Photography class at the MIT Media Laboratory was to present an exhibition of digital artworks which blend photography and computation, in the context of scene capture, image play, and interaction. Equipped with low end digital cameras, students created weekly software projects to explore aesthetic issues in signal processing and interaction design. The results are more than a hundred Java® applets, many of which are interactive, that suggest new avenues for image play on the computer. These weekly exercises led to the final product, an exhibition of the student work.",
  "topics": [
    "Engineering",
    "Computer Science",
    "Software Design and Engineering",
    "Fine Arts",
    "Media Studies",
    "Digital Media",
    "Visual Arts",
    "Photography",
    "Engineering",
    "Computer Science",
    "Software Design and Engineering",
    "Fine Arts",
    "Media Studies",
    "Digital Media",
    "Visual Arts",
    "Photography"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nPrerequisites\n\nPermission of Instructor\n\nText\n\nMitchell, William.\nThe Reconfigured Eye: Visual Truth in the Post-Photographic Era\n. Cambridge, MA: MIT Press, 1992. ISBN: 9780262631600.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nAttendance\n\n30%\n\nAssignments\n\n30%\n\nExhibition\n\n40%\n\nDescription\n\nThe creative use of scene-capture devices is explored in the context of computational expression. Students will each be equipped with a low-end digital camera and explore the physical environment for imagery that can bond well with computational post-processing, in the context of scene-capture, image-play, and interaction.\n\nIntensive weekly exercises will be given, with review sessions each week.\n\nSponsors\n\nThis course is sponsored with generous donations from Minolta and Interval Research Corporation.\n\nExhibition\n\nAn exhibition of student work was held at the MIT Media Laboratory atrium on December 11th, 1998. Information about this show, and its permanent online component, is available in the\nprojects\nsection.",
  "files": [
    {
      "category": "Assignment",
      "title": "Problem Set 1: FFT-PAINT",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/mas-961-numeric-photography-fall-1998/f09f3b1aeee19a9ec98acb5346b45ffe_ps1.pdf",
      "content": "Problem Set 1: FFT-PAINT\nDescription:\nIn this problem set you will implement a basic paint system which with the flip\nof a button lets you edit the frequency spectrum representation of the image you\nare editing. And of course flipping back to the spatial representation at will.\nEmphasis will be placed upon the frequency spectrum mode, where you should\ndesign special brushes that emphasize various characteristics of the frequency\ndomain.\nPart 1: Basic Paint System\nIn an applet of maximum size 600 pixels wide by 400 pixels high, design a simple\npaint program that allows you to load and edit a grayscale image.\nPart 2: Frequency Domain Conversion\nAdd a button to your applet that takes the contents of the image, and converts it\nto a frequency domain representation (also a graylevel image). When that button\nis pressed, you should flip back to the spatial domain, and so forth.\nPart 3:\nDesign one special painting mode that allows you to play with the frequency\ndomain in a special way that relates to the spatial domain."
    },
    {
      "category": "Assignment",
      "title": "Problem Set 2: Portrait of a Cube",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/mas-961-numeric-photography-fall-1998/7798377c4194a6843d70f8c0a9e5d0a8_ps2.pdf",
      "content": "Problem Set 2: Portrait of a Cube\nDescription:\nIn this problem set you will gain skill with using a camera in relation to a subject,\nin this case a white paper cube you shall construct. Place this white cube on top\nof an identically white paper material. Arrange a maximum of 5 achromatic\nlights pointed at the cube.\nPart 1: Take Some Pictures\nShoot at least 64 different scenes of the cube, in different lighting conditions, or\nin the same lit conditions. Experiment with different lighting combinations and\nthe ambient light situation.\nPart 2: Basic Animation System\nIn an applet of maximum size 600 pixels wide by 400 pixels high, design a simple\ndisplay engine that displays a series of images, at a varied speed of display. For\ninstance, displaying images A, B, C, D, between A and B there can be a delay of\n150 milliseconds, between B and C a delay of 300 milliseconds, and C and D a\ndelay of 0 milliseconds. In otherwords, a variable speed playback engine where\nthe timing is predetermined by some form of script.\nPart 3: Tell a Story of the Cube\nGiven the frames you have shot, preload all of them (make sure they are all\nloaded with MediaTracker), and fire them away at a speed that tells a story of the\nessence of the cube you are shooting, as well as its surrounding lit conditions.\nSince you want to animate, you may want to limit the size of your images.\nFurthermore, do not exceed 1 minute to tell your story. DO NOT apply any type\nof special effect (like digital pan, zoom, etc. as geilfuss had demonstrated in ps1).\nWe are focusing upon just the pictures, and how you crop them."
    },
    {
      "category": "Assignment",
      "title": "Problem Set 3: Our World of Colours",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/mas-961-numeric-photography-fall-1998/9d5e666042b18175ca6ffa62681868d6_ps3.pdf",
      "content": "Problem Set 3: Our World of Colours\nDescription:\nIn this problem set you will locate colored objects in your environment. With the\nobjects/scenes you snap, you shall develop a larger palette of colors.\nPart 1: Take Some Pictures\nCapture 6 images of a naturally (or synthetic as long as it is captured with the\ncamera) found Red, Orange, Yellow, Green, Blue, Violet scene.\nPart 2: Making a Palette\nCreate the inbetween colors of Red-Orange, Yellow-Green, etc. by synthesizing\nthem from the given base scenes you have captured. In other words, given 6\nimages, create 12 images (or 18, 24, etc. however fine-grain you wish to get) that\nrepresent combinations of the image in some way that creates the inbetween\ncolor.\nPart 3: Paint with your Palette\nUsing these image chips, allow a user to select from the widened palette and\npaint with the images as brushes (there are many innovations possible at this\nstep)."
    },
    {
      "category": "Assignment",
      "title": "Problem Set 4: Cross Your Fingers",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/mas-961-numeric-photography-fall-1998/9a208df8bce1841cf99666b27059dba3_ps4.pdf",
      "content": "Problem Set 4: Cross Your Fingers\nDescription:\nIn this problem set you will examine your own hand (or a friend's if so desired)\nwith a digital camera. You shall then attach character to your fingers using\nadditional graphic primitives.\nPart 1: Take Some Pictures\nCapture no more than 6 images of your hand.\nPart 2: Selecting the Best Parts\nYou are allowed to crop/mask the pictures in the manner you desire to get the\n\"best\" parts.\nPart 3: Manipulate the Parts\nWith your set of basic parts, breathe life (or a total lack of life) into them through\nstatic or dynamic expression."
    },
    {
      "category": "Assignment",
      "title": "Problem Set 5: Looking Behind and Around Boston",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/mas-961-numeric-photography-fall-1998/1f30e0a0f1ea5aec201e0be4785a4836_ps5.pdf",
      "content": "Problem Set 5: Looking Behind and Around Boston\nDescription:\nIn this problem set you will focus upon the environment that surrounds the\ncentral object you shoot. Think of the cube problem set where the cube was the\ncenterpiece. Now think of everything around the cube. That should be your\nprimary focus.\nPart 1: Take Some Pictures\nAround Boston, choose 3 scenes that have a prominent foreground and less\nprominent background. Example: people sitting in a park, pigeon sitting on a\nbench, etc.\nPart 2: Amplifying the Background\nChoose one of the scenes and describe in text how you would intend to make the\nbackground amplified through some computational process.\nPart 3: Amplify it\nWith your concept clearly stated in 2, attempt to realize this concept to the best of\nyour ability."
    },
    {
      "category": "Assignment",
      "title": "Problem Set 6: Your Favorite Thing",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/mas-961-numeric-photography-fall-1998/e2e4aee5cd3745045f4f331c670e74f9_ps6.pdf",
      "content": "Problem Set 6: Your Favorite Thing\nDescription:\nIn this problem set you will focus upon your most revered object, and focus\nupon it more than you ever thought possible.\nPart 1: Take Some Pictures\nIn an outdoor environment, take your favorite object and shoot at least 6 pictures\nof the object.\nPart 2: Focusing on the Foreground\nAchieve prominence of your favorite object through describing in text a\ncomputational process, whether dynamic, static, or interactive that realizes the\nunabashed over-amplified essence of your object.\nPart 3: Amplify it\nWith your concept clearly stated in 2, attempt to realize this concept to the best of\nyour ability."
    },
    {
      "category": "Assignment",
      "title": "Problem Set 7: Nature as Unnature, or Unnature as Nature",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/mas-961-numeric-photography-fall-1998/41d409d6f753b4b27e359d9a611eebf5_ps7.pdf",
      "content": "Problem Set 7: Nature as Unnature, or Unnature as Nature\nDescription:\nIn this problem set you will consider a natural phenomenon posed as an unnatural\noccurence (or vice-versa). Examples of the natural would be the flow of water, the wind,\ngravity, etc. An example of the unnatural would be garbage, packages, toast, etc. (choose\nsomething concrete, versus some abstract concept).\nPart 1: Take Some Pictures\nCreate two sets of photos, one set depicting your natural phenomenon, the other set\ndepicting the unnatural phenomenon of your choice.\nPart 2: Describe the Natural with the Unnatural\nExplain in words why you chose your particular pair of concepts, and how you propose\nthey can be posed in relation to each other in a visual manner that is 50% computationally\nmotivated.\nPart 3: Realize it\nCreate a JAVA applet that depicts your proposed concept to the best of your ability."
    },
    {
      "category": "Assignment",
      "title": "Problem Set 8: The Issue of Quality",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/mas-961-numeric-photography-fall-1998/5477fc3cb68c37ffcd9ab6555030d648_ps8.pdf",
      "content": "Problem Set 8: The Issue of Quality\nDescription:\nChoose an underdeveloped piece of work and refine it's level of quality of\npresentation/concept.\nPart 1: Take Some Snapshots\nCreate one set of screen snapshots that depict your original design (a sequence is\npreferable).\nPart 2: Define its Deficiencies\nWrite a self critique that suggests how it can be improved.\nPart 3: Solve It\nRewrite your JAVA applet and describing web page with the improvements.\n\nSuggestions for what to do:\n1. pcho: the one with the harvard square station set. tighten concept and refine solution.\n2. kelly: the mirror box problem. think of asynchronicity, different speeds.\n3. brad: the dog or the pumpkin texture. i would make the dog experience very uber-\ndoggish.\n4. lau: the hand shadows/videogame. make it closer to your proposed concept. smoking\nfinger, etc.\n5. fry: the color problem. create stronger relation between left and right.\n6. tom: the vending machine. refine this solution to a good level of reality/non-reality.\n7. yuri: the fft problem set. redesign frontend interface to be more intuitive yet abstract.\n8. marc: the motion painter. try to make more efficient by using smaller window size\nperhaps, refine interface.\n\n9. msredin: the texture generation. create more options, make interface a bit deeper and\nfuller.\n10. vemuri: vemuri fighter. refine interaction so can be interrupted during motion\nsequence, use longer panorama, try to do more with interframe motion blending\ncomputationally.\n11. devaul: multi-space combiner. choose a better set of images to illustrate the multi-\nframe temporal collider\n12. ebeth: circuit-board paint. add a functional layer to this such that is not just painting\ncomponents, but has actual function of components at some level.\n13. elise: the flavor-meter. create better relation between meal and flavor-vision.\n14. golan: the hand-problem set. choose ONE representation and go with just that. try to\nget better flesh tone to make more handy."
    },
    {
      "category": "Assignment",
      "title": "Problem Set 9: The Issue of Even More Quality",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/mas-961-numeric-photography-fall-1998/7b278fe1eb57655f520c9a99594744b1_ps9.pdf",
      "content": "Problem Set 9: The Issue of Even More Quality\nDescription:\nChoose what you thought was a fairly developed piece of work and refine it's level of\nquality of presentation/concept.\nPart 1: Take Some Snapshots\nCreate one set of screen snapshots that depict your original design (a sequence is\npreferable). (DON'T FORGET TO DO THIS)\nPart 2: Define its Deficiencies\nWrite a self critique that suggests how it can be improved.\nPart 3: Solve It\nRewrite your JAVA applet and describing web page with the improvements.\n\nSuggestions for what to do: Use your own discretion."
    },
    {
      "category": "Assignment",
      "title": "Problem Set 10: The Denial of Golan's Network Problem Set",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/mas-961-numeric-photography-fall-1998/6c3932dd0b31cc7c8c90f49c56ea145d_ps10.pdf",
      "content": "Problem Set 10: The Denial of Golan's Network Problem Set\nDescription:\nCreate an online portfolio of your work in this course.You will use this for the exhibition.\nPart 1: Take a Self Portrait\nUse your favorite method of deconstruction to portray yourself in a discernable manner.\nPart 2: Create a Simple Portfolio\nIn your directory (people), for example, \"people/golan\" make a directory\n\"people/golan/exhibition\" that has your exhibit clearly organized.\nPart 3: And Finally\nAll examples should be *complete*. Try to get them to work in a browser instead of\nappletviewer."
    }
  ]
}