{
  "course_name": "Optics",
  "course_description": "This course provides an introduction to optical science with elementary engineering applications. Topics covered in geometrical optics include: ray-tracing, aberrations, lens design, apertures and stops, radiometry and photometry. Topics covered in wave optics include: basic electrodynamics, polarization, interference, wave-guiding, Fresnel and Fraunhofer diffraction, image formation, resolution, space-bandwidth product. Analytical and numerical tools used in optical design are emphasized. Graduate students are required to complete assignments with stronger analytical content, and an advanced design project.",
  "topics": [
    "Engineering",
    "Mechanical Engineering",
    "Science",
    "Physics",
    "Atomic, Molecular, Optical Physics",
    "Electromagnetism",
    "Quantum Mechanics",
    "Engineering",
    "Mechanical Engineering",
    "Science",
    "Physics",
    "Atomic, Molecular, Optical Physics",
    "Electromagnetism",
    "Quantum Mechanics"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nPrerequisites\n\n8.02 Physics II\n\n18.03 Differential Equations\n\n2.004 Dynamics and Control II\n\nDescription\n\n2.71 / 2.710 Optics\nis an introduction to optical science with elementary engineering applications. Topics include geometrical optics: ray-tracing, aberrations, lens design, apertures and stops, radiometry, photometry, wave optics: basic electrodynamics, polarization, interference, wave-guiding, Fresnel and Fraunhofer diffraction, image formation, resolution, and space-bandwidth product. Analytical and numerical tools used in optical design are emphasized.\n\nObjectives of the class are:\n\nStudying fundamental properties of light propagation and interaction with matter.\n\nTwo approximations (geometrical optics and scalar wave optics)\n\nEmphasis on physical intuition and underlying mathematical tools\n\nSystems approach to analysis and design of optical systems\n\nApplication of physical concepts to topical engineering domains.\n\nDifferences between 2.71 and 2.710\n\nStudents must choose between the undergraduate version of the course, 2.71, and the graduate version of the course, 2.710. The graduate version requires a final project and additional problem set assignments, namely in homeworks 4, 5, and 6.\n\nGrading\n\n2.71\n\nACTIVITIES\n\nPERCENTAGES\n\nHomework\n\n30%\n\nQuizzes\n\n40%\n\nFinal Exam\n\n30%\n\n2.710\n\nACTIVITIES\n\nPERCENTAGES\n\nHomework\n\n20%\n\nQuizzes\n\n30%\n\nFinal Project\n\n30%\n\nFinal Exam\n\n20%\n\nHomework Grading\n\nEach problem is worth 3 points. You earn:\n\n3 points if you solve the problem perfectly,\n\n2 points if you got the main idea but made minor error(s)\n\n1 point if you went seriously astray\n\n0 points if you did not attempt the problem\n\nWe will accept late homeworks but you lose 20% of the grade per day after the due date. The 1st homework is exempt from this policy (but please make sure to turn it in by the due date of the 2nd homework).\n\nFinal Project (2.710 only)\n\nEach project will be carried out by a team of 2-3 students from the 2.710 roster. A list of suggested project descriptions will be provided and you are free to take your own topics too. We will finalize the teaming arrangements by Lecture 7. Each team will consult with a mentor (faculty, TA or senior students in related topics) who will assist in clarifying key concepts, and organizing the presentations. The mentors will also suggest a few simple simulations for each project to give you a feel of what these advanced topics can accomplish, and what the difficulties / limitations are.\n\nThe projects will be presented in Lectures 23 and 24. Each presentation should be designed to last for 30 minutes with approximately 10 additional minutes for questions. If you all decide to go on stage, please be prepared to manage the 30 minute overall team time between 2 to 3 speakers, and switch swiftly between speakers to avoid delays. To further cut delays, we will also ask that you bring your presentations in a flash drive and use a laptop.\n\nThe presentations will be attended by the class, the instructor team, and guest faculty. Only faculty will give grades, but all present will vote for the best presentation.\n\n* If you are enrolled in 2.71, you are welcome to participate in the projects on a voluntary basis. You cannot receive credit for this work, however, unless you switch to 2.710. You would also have to do some additional homework problems that were assigned in 2.710 but not 2.71.\n\nCollaboration\n\nAllowed in homeworks but you should write your own solutions and make sure you understand them before handing in. Projects are collaborative by definition.\n\nRecommended Textbooks\n\nPedrotti, Frank L., Leno M. Pedrotti, and Leno S. Pedrotti.\nIntroduction to Optics\n. Addison-Wesley, 2006. ISBN: 9780131499331.\n\nGoodman, Joseph W.\nIntroduction to Fourier Optics\n. McGraw-Hill Book Company, 1968. ISBN: 9780070237766.\n\nSuggested References\n\nHecht, E.\nOptics\n. 4th ed. Addison-Wesley, 2001. ISBN: 9780805385663.\n\nSmith, W. J.\nModern Optical Engineering\n. 4th ed. SPIE Press, 2007. ISBN: 9780819470966.\n\nBass, Michael, E. W. Van Stryland, D. R. Williams, eds.\nHandbook of Optics\n. Vol 1, 2nd ed. McGraw-Hill Professional, 1995. ISBN: 9780070477407.\n\nHaus, H. A.\nWaves and Fields in Optoelectronics\n. Prentice Hall, 1983. ISBN: 9780139460531.\n\nIizuka, Keigo.\nElements of Photonics\n. Vol 1. Wiley-Interscience, 2002. ISBN: 9780471839385. [Preview with\nGoogle Books\n]\n\nVoelz, David George.\nComputational Fourier Optics: A MATLAB Tutorial\n. SPIE Press, 2011. ISBN: 9780819482044.",
  "files": [
    {
      "category": "Assignment",
      "title": "Optics, Assignment 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-71-optics-spring-2014/817fa97daa405d9ab3b4ad3362d8aa7f_MIT2_71S14_HW_1.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\n\n2.71/2.710 Optics\nSpring '14\nProblem Set #1\nPosted Feb. 10, 2014 -- Due Tuesday, Feb. 18, 2014\n\n1. (Modified from Pedrotti 2-2) In the xy- plane, we need to design a glass (index\nof refraction n=1.5) refracting surface to form a 'perfect' image of an object. The\nobject is placed in air, on the optical axis, 20cm from the vertex of the glass\nsurface. The conjugate image point forms 10cm inside the glass.\n\na. Assume the origin of the coordinates is at the object point, find the\nequation of the refracting surface.\n\nb. Plot the surface together with sample rays.\n\n2. Your ice-cream spoon can be used as a concave mirror, which forms an image\nhalf the size of the object. Then, you moved the spoon with respect to the object,\nto produce an image that is one third (1/3) the size of the object. If the spoon\nmoved 2.5cm in this process, how far has the image moved? What is the focal\nlength of the spoon concave mirror?\n\n3. A horse is 2.25 m tall, and it stands with its face 15 m away from the plane of a\nthin lens camera whose focal length is 3 m.\n\n(a) Determine the location of the image of the nose of the horse. Assume the\nheight of the nose to be 2.25m.\n\n(b) What is the orientation of the image in the x and z direction? What is the\nmagnification?\n\n(c) How tall is the image?\n\n(d) If the tail of the horse is located 17.5 m from the lens, how long is the image of the\nhorse (from nose to the tail)?\n\nH= 2.25m\n15 m\nCamera Lens,\nf =3m\n\n4. A prism pair is used to expand or shrink a beam in one dimension without\ndeflecting its angle, as shown here. The pair consists of two identical prisms\nwith wedge angle and the refractive index n. The beam enters each prism at\nnormal incidence to the front surface. As a model of the beam, it is useful to\nconsider parallel rays as shown.\n\na. Write down an expression that relates the deflection angle after the first\nprism to wedge angle and refractive index n.\n\nb. By how much is the beam reduced after the first and second prism? Write\nyour answer in terms of n and only.\n\n5. (Pedrotti 3-16) A telephoto lens consists of a combination of two thin lenses\nhaving focal lengths of +20cm and -8cm, respectively. The lenses are separated\nby a distance of 15cm. Determine the focal length of the combination, distance\nfrom the negative lens to the film plane, and the image size of a distant object\nsubtending an angle of 2o at the camera.\n\nhin\nhout\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n2.71 / 2.710 Optics\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Optics, Solutions to Assignment 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-71-optics-spring-2014/29862d5e41cfb75fd5eabfa10cd53b2d_MIT2_71S14_HW_1_sols.pdf",
      "content": "2.710 Optics\nHomework #1\nFebruary 18, 2014\n\nPage 1 of 10\n\nProblem 1. Refracting Surface (Modified from Pedrotti 2-2)\n\nPart (a)\n\nFermat's principle requires that every ray that emanates from the object and passes through the\nimage point must be isochronous (i.e., have equal optical path lengths).\n\nThe common optical path length (OPLcommon) can be easily found using the ray that passes along\nthe optical axis from the object to the image point, while taking into account the refractive\nindexes of air (no) and glass (ni):\n\nOPLcommon = noso + nisi\n\nLet x and y be the horizontal and vertical coordinates, respectively, with the origin at the object\npoint. The optical path length (OPLarbitrary) of any arbitrary ray that emanates from the object at\n(0, 0) , enters the glass at coordinate (x, y), and then passes through the image point at (si + so, 0),\ncan be found from the in-air propagation distance (do) and in-glass propagation distance (di),\nwhile taking into account the indexes of refraction:\n\ny\nx\ndo\n+\n=\n\n2)\n(\ny\nx\ns\ns\nd\ni\no\ni\n+\n-\n+\n=\n\ni\ni\no\no\narbitrary\nd\nn\nd\nn\nOPL\n+\n=\n\n)\n(\ny\nx\ns\ns\nn\ny\nx\nn\nOPL\ni\no\ni\no\narbitrary\n+\n-\n+\n+\n+\n=\n\nThe correct refracting surface corresponds to all (x, y) such that OPLarbitrary equals OPLcommon.\n\ncommon\narbitrary\nOPL\nOPL\n=\n\ni\ni\no\no\ni\no\ni\no\ns\nn\ns\nn\ny\nx\ns\ns\nn\ny\nx\nn\n+\n=\n+\n-\n+\n+\n+\n)\n(\n\nPlugging in no = 1, ni = 1.5, so = 20 cm, and si = 10 cm:\n\n)\n(\n5.1\n=\n+\n-\n+\n+\ny\nx\ny\nx\n\nNote: This equation is only 2-dimensional. The 3-dimensional solution would be a radial-\nsymmetric surface, where each cross-section (through the vertex) follows the 2D equation.\n\n2.710 Optics\nHomework #1\nFebruary 18, 2014\n\nPage 2 of 10\n\nPart (b)\n\nBelow is a plot of the refracting surface using labels from Part (a).\n\nI found (x, y) coordinates on the surface by substituting do back into the surface equation, as\nfollows:\n\n)\n(\n5.1\n=\n+\n-\n+\n+\ny\nx\ny\nx\n)\n(\n5.1\n=\n+\n+\n-\n+\n+\ny\nx\nx\ny\nx\n\n5.1\n2 =\n+\n-\n+\no\no\nd\nx\nd\n\n)\n(\n)\n(\n5.1\no\no\nd\nd\nx\n-\n=\n+\n-\n\nIn this form, x can easily be found from do, and y can be found from x and do:\n\n5.1\n)\n(\n)\n(\n5.1\n⋅\n-\n-\n+\n=\no\no\nd\nd\nx\n\nx\nd\ny\no -\n=\n\nBy choosing a series of values for do, I can calculate (x, y) coordinates that satisfy the original\nsurface equation, as follows:\n\ndo\nx\ny\n20.90\n±2.07\n21.81\n±2.85\n22.75\n±3.38\n\nAfter calculating many closely-spaced (x, y) coordinates in this way, I was able to plot the\nrefracting surface above with Matlab(r).\n\n2.710 Optics\nHomework #1\nFebruary 18, 2014\n\nPage 3 of 10\n\nProblem 2. Ice-cream Spoon\n\nFirst, let's define some variables:\n\n- Let s1 and s2 be the initial and final object distances, respectively.\n- Let s'1 and s'2 be the initial and final image distances, respectively.\n- Let m1 and m2 be the initial and final magnifications, respectively.\n- Let d be the distance moved by the mirror (initial to final)\n\nThe described problem can be quantified by 5 equations with 5 unknowns\n)\n,\n,\n,\n,\n(\nf\ns\ns\ns\ns\n′\n′\n:\n\nMirror equation at the initial object distance\n\nf\ns\ns\n=\n′\n+\n\nEq. 1\nMirror equation at the final object distance\n\nf\ns\ns\n=\n′\n+\n\nEq. 2\nMagnification at the initial object distance\n\ns\ns\nm\n′\n-\n=\n\nEq. 3\nMagnification at the final object distance\n\ns\ns\nm\n′\n-\n=\n\nEq. 4\nDifference between initial and final distances\n\nd\ns\ns\n+\n=\n\nEq. 5\n\nThe system of equations can be solved for the unknowns as follows:\n\nCombine Eq. 1 and Eq. 2\n\ns\ns\ns\ns\n′\n+\n=\n′\n+\n\n2.710 Optics\nHomework #1\nFebruary 18, 2014\n\nPage 4 of 10\n\nUse Eq. 3 and Eq. 4 to remove s'1 and s'2\ns\nm\ns\ns\nm\ns\n-\n=\n-\n\nUse Eq. 5 to remove s2\n\n)\n(\nd\ns\nm\nd\ns\ns\nm\ns\n+\n-\n+\n=\n-\n\nSolve for s1\n\n(\n)\nm\nm\nm\nm\nm\nd\ns\n-\n-\n⋅\n=\n\nSolve for remaining unknowns\n\nd\ns\ns\n+\n=\n\ns\nm\ns\n-\n=\n′\n\ns\nm\ns\n-\n=\n′\n\ns\ns\ns\ns\nf\n′\n+\n′\n=\n\nIn this problem, we are given |d| = 2.5 cm, |m1| = 0.5, and |m2| = 1/3, but we are not given their\nsigns (+ or -). Fortunately, we can safely (but arbitrarily) set d = +2.5 cm. After all, the sign of d\nshould be inconsequential, since the solutions (to the system of equations) for d = ±2.5 will\nsimply be the reverse of one another (left becomes right, right becomes left). However, the\nsolution to the system of equations will, indeed, depend on the signs of m1 and m2 (i.e., whether\nthe images are inverted or not)\n\nThe table below shows the solutions to the system of equations for all 4 combinations of m1 (+ or\n-) and m2 (+ or -). The table reveals that, depending on the signs of m1 and m2, the mirror may\ntake on a concave or convex geometry for the initial and/or final object-to-mirror distances. As\nhighlighted below, only the last combination of m1 (-0.5) and m2 (-1/3) conforms to the premise\nof the problem (i.e., that the ice-cream spoon is being used as a concave mirror).\n\nKnowns\nSolution to System of Equations\n(in centimeters)\nMirror Geometry\ndo (cm)\nm1\nm2.\ns1\ns2\ns'\ns'\nf\n2.5\n0.5\n1/3\n2.5\n-1.25\n-1.67\n-2.5\nConvex mirror for initial and final distances\n2.5\n0.5\n-1/3\n-0.5\n0.25\n0.67\n0.5\nConvex for initial; concave for final\n2.5\n-0.5\n1/3\n-1.5\n-0.75\n-0.33\n-0.5\nConcave for initial; convex for final\n2.5\n-0.5\n-1/3\n7.5\n3.75\n3.33\n2.5\nConcave for initial and final distances\n\nThe position (p) of the image, relative to the object, at each object-to-mirror distance is:\n\np1 = s1 - s'\n1 = 7.5 cm - 3.75 cm = 3.75 cm\np2 = s2 - s'\n2 = 10 cm - 3.33 cm = 6.67 cm\n\nThus, the answers to the specific questions are:\n- When the spoon moved 2.5 cm (i.e., s2 - s1) further away from the object, the image\nmoved 2.92 cm (i.e., p2 - p1) further away from the object.\n- The focal length of the spoon concave mirror is 2.5 cm.\n\n2.710 Optics\nHomework #1\nFebruary 18, 2014\nPage 5 of 10\nProblem 3. Horse and Camera\nPart (a)\nThe image distance of the horse's nose (s'nose) can be found with the thin-lens equation, given the\nobject distance of the horse's nose (snose = 15 m) and the focal length of the thin lens (f = 3 m):\ns\n⋅f\n15⋅3\n+\n=\n\ns′\nse\ns\nsno\nf\nnose =\nno\n=\n=\n= 3.75\nnose\n′ se\nsnose -f\n15 -3\nThe height of the image of the horse's nose (h'nose) can be found with the magnification equation,\ngiven the height of the horse's nose (hnose = 2.25 m):\nsno′\ne\n3 75\nm = -\ns\n.\n= -\n= -0.25\nsnose\nh '\nm\nno′\n=\nse\nhno′ se = mhnose = -0.25⋅2.25 = -0.5625\nhnose\nThus, the image of the horse's nose is located 3.75 m to the right of the lens and 56.25 cm below\nthe optical axis.\nPart (b)\nThe magnification is m = -0.25. In the vertical direction, the image is inverted, as indicated by\nthe negative magnification. In other words, the horse appears upside-down. In the horizontal\ndirection (as calculated in Part (d)), the horse's tail comes to focus closer to the lens than the\nhorse's nose does. In other words, the image of the horse's tail is to the left of the image of the\nhorse's nose. The graph above shows the orientation of the image (but not to scale), as described\nhere.\n\n2.710 Optics\nHomework #1\nFebruary 18, 2014\n\nPage 6 of 10\n\nPart (c)\n\nThe image is 56.25 cm tall (but inverted), as calculated in Part (a).\n\nPart (d)\n\nThe image distance of the horse's tail (s'tail) can be found with the thin-lens equation, given the\nobject distance of the horse's tail (stail = 17.5 m) and the focal length of the thin lens (f = 3 m):\n\nf\ns\ns\ntail\ntail\n=\n′\n+\n\n.3\n5.\n5.\n5.\n5.\n≈\n=\n-\n⋅\n=\n-\n⋅\n=\n′\nf\ns\nf\ns\ns\ntail\ntail\ntail\n\nThe length of the image (L) can be calculated as follows:\n\nL = s'nose - s'tail = 3.75 - 3.62 = 0.13\n\nThus, the image of the horse is 13 cm long (from nose to tail).\n\n2.710 Optics\nHomework #1\nFebruary 18, 2014\n\nPage 7 of 10\n\nProblem 4. Prism Pair\n\nPart (a)\n\nAt the first surface of the prism, the angle of incidence is zero, so no refraction occurs. At the\nsecond surface, as indicated in the drawing, the angle of incidence is α and the angle of refraction\nis (α + θ). Snell's law then gives the relation among θ, α, and n (assuming the index of\nrefraction of air is 1):\n\n)\nsin(\n)\nsin(\nθ\nα\nα\n+\n=\nn\nfor\n\n<\n-\nn\nsin 1\nα\n\nIf\n\n≥\n-\nn\nsin 1\nα\n, then total internal reflection (TIR) occurs and the rays must cross the bottom\ninterface of the prism to escape. Thus, the geometry of the original prism pair becomes invalid.\n\nPart (b)\n\nAs indicated in the drawing, the length (L) over which the beam intersects the second surface of\nthe prism is:\n\n)\ncos(α\nin\nh\nL =\n\nThe width of the beam after the prism is:\n\n2.710 Optics\nHomework #1\nFebruary 18, 2014\n\nPage 8 of 10\n\nin\nh\nL\nh\n)\ncos(\n)\ncos(\n)\ncos(\nα\nθ\nα\nθ\nα\n+\n=\n+\n=\n\nThus, the width of the beam is reduced by a factor (r) of:\n)\ncos(\n)\n(\nsin\n)\ncos(\n)\ncos(\nα\nθ\nα\nα\nθ\nα\n+\n-\n=\n+\n=\nr\n\nTo remove θ from the equation, we can substitute in the relation from Part (a):\n\n)\ncos(\n)\n(\nsin\nα\nα\nn\nr\n-\n=\n\nThe second prism simply repeats the same process, giving a total reduction factor of r2.\n\nThus, the reduction factors (r1 and r2) after the first and second prism, relative to the initial beam\nwidth, are:\n\n)\ncos(\n)\n(\nsin\nα\nα\nn\nr\nr\n-\n=\n=\nfor\n\n<\n-\nn\nsin 1\nα\n\n)\n(\ncos\n)\n(\nsin\nα\nα\nn\nr\nr\n-\n=\n=\nfor\n\n<\n-\nn\nsin 1\nα\n\nNote: For sufficiently small α, then sin(α) ≈ α, sin(α + θ) ≈ α + θ, and cos(α) ≈ 1. The answers\nto the problem could then possibly be approximated as follows:\n\nθ\nα\nα\n+\n≈\nn\n\nα\nθ\n⋅\n-\n≈\n)1\n(n\n\nα\nn\nr\nr\n-\n≈\n=\n\nα\nn\nr\nr\n-\n≈\n=\n\n2.710 Optics\nHomework #1\nFebruary 18, 2014\n\nPage 9 of 10\n\nProblem 5. Two Thin Lenses\n\nThe focal length of a combination of two thin lenses (f1 and f2), separated by distance d, is:\n\nf\nf\nd\nf\nf\nf\n-\n+\n=\n\nd\nf\nf\nf\nf\nf\n-\n+\n=\n\nPlugging in f1 = 20 cm, f2 = -8 cm, and d = 15 cm:\n\n)\n(\n-\n-\n-\n⋅\n=\nf\n= 53.33 cm\n\nThe distance from the negative lens to the film plane should equal the distance past the negative\nlens at which a horizontal, collimated beam would come to focus. This can be determined as\nfollows. The matrix (Msystem) representation of the two-lens system is\n\n-\n-\n-\n-\n=\n\n-\n\n-\n=\nf\nd\nf\nf\nf\nf\nd\nd\nf\nd\nf\nd\nf\nM system\n\nThe vector (xin) representation of a ray that has a height of 1 and is parallel to the optical axis\n(i.e., corresponding to a horizontal collimated beam) is:\n\n= 0\nin\nx\n\nIf xin is sent into the two-lens system, the output ray (xout) would be:\n\n-\n-\n-\n=\n=\nf\nf\nf\nf\nd\nf\nd\nx\nM\nx\nin\nsystem\nout\n\nIf xout is allowed to propagate a distance (L) past the negative lens, the resulting ray (xfocus)\nwould be:\n\n-\n-\n\n-\n-\n⋅\n+\n-\n=\n\n=\nf\nf\nf\nf\nd\nf\nf\nf\nf\nd\nL\nf\nd\nx\nL\nx\nout\nfocus\n\nThe distance from the negative lens to the film plane should equal the L at which the height of\nxfocus is zero (i.e., xfocus(1) = 0):\n\n2.710 Optics\nHomework #1\nFebruary 18, 2014\n\nPage 10 of 10\n\n)1(\n=\nfocus\nx\n\n-\n=\n\n-\n-\n⋅\nf\nd\nf\nf\nf\nf\nd\nL\n\n-\n-\n-\n=\nf\nf\nf\nf\nd\nf\nd\nL\n\n)\n(\n)\n(\nf\nf\nd\nf\nd\nf\nL\n+\n-\n-\n=\n\nPlugging in f1 = 20 cm, f2 = -8 cm, and d = 15 cm:\n\n)\n(\n)\n(\n-\n-\n-\n⋅\n-\n=\nL\n=13.33 cm\n\nIf a distant object subtends 2 degrees at the camera, then that means:\n\n)\ntan(\n\n=\no\no\ns\nh\n\nThe magnification formula says:\n\no\ni\no\ni\ns\ns\nh\nh\nm\n-\n=\n=\n\no\ni\ni\no\ns\ns\nh\nh\n-\n=\n\nPlugging in so = f = 53.33 cm (since the film plane is at the focus of the system):\n\nho = -tan(2o) ·53.33 = -1.86\n\nThus, the image of a 2 degree distant object is 1.86 cm tall.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n2.71 / 2.710 Optics\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Optics, Assignment 2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-71-optics-spring-2014/4721eabe5468603cd18c9c7bb404deb9_MIT2_71S14_HW_2.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\n\n2.71/2.710 Optics\nSpring '14\nProblem Set #2\nPosted Feb. 19, 2014 --Due Wed Feb. 26, 2014\n\n1. (modified from Pedrotti 18-9) A positive thin lens of focal length 10cm is\nseparated 5cm from a thin negative lens of focal length -10cm.\n\na. Sketch your optical system to scale.\nb. Find the equivalent focal length of the composite lens, together with the\nposition of the front focal plane, back focal plane and principal planes. You may\nuse ray tracing or matrix methods.\nc. For an arbitrary object placed in front of the system, please use your findings\nin b) to find the image.\n\n2. A 25.4mm diameter precision plano-convex achromat doublet lens from\nNewport is made by N-BK7 and SF5 glass. It has the following specifications:\n\nR1=60.741 mm,\nR2= -89.718 mm,\nR3= -268.159 mm,\nt1= 3.8 mm, t2= 2.5 mm,\nn1= 1.51947 (@λ=532nm),\nn2= 1.64570 (@λ=633nm).\na. What is the optical power of this composite element?\nb. If a plane wave is incident from the left, where will it focus?\n\nR1\nR2\nR3\nt1\nt2\nn1 n2\n\n3. A Telephoto Lens. For an object placed at infinity, we need to design a\ncomposite lens system with the following specifications.\n\n-\nThe spacing from the front lens to the rear lens is 120 mm.\n-\nThe working distance (from the rear lens to image plane) is 100 mm.\n-\nThe effective focal length (EFL) is 300mm.\n\na. Assuming all elements are thin lenses, determine the focal length of each\nindividual lens.\nb. Locate the principle planes of the lens system.\nc. The aperture stop (A. S.) of this system is located at the front lens. In order for\nthe system to operate at F-number of f/4.0, what should be the diameter of the\naperture?\nd. If two objects are separated by 10-3 radians at infinity, how far apart will their\nimages form on the screen?\n\n4. (modified from Pedrotti 3-5) A optical system is made up of a positive thin lens\nL1 of diameter 6cm, and focal length f1=6cm, and a negative thin lens L2 of\ndiameter 6cm and focal length f2=-10cm, and an aperture A of diameter 3cm. The\naperture A is located 3cm in front of the lens L1, which is located 4cm in front of\nthe lens L2. An object OP, 3cm high, is located 18cm to the left of L1.\n\nd=120 mm\nL1\nL2\nBFL=100 mm\nA.S.\nImage plane\n(c) Pearson Prentice Hall. All rights reserved. This content is excluded from our\nCreative Commons license. For more information, see http://ocw.mit.edu/fairuse.\n\na. Determine the location and the size of the field stop FS.\nb. Determine the location and the size of the entrance and exit windows.\nc. Using the chief ray from object point P to image point P\" as shown in the\nexample, draw the two marginal rays from P to P\", which, together with the\nchief ray, determine the cone of light that successfully get through the optical\nsystem.\n\n5. Camera lens and Image Stabilizer system: Professional or semi-professional\ncameras are usually designed to be used with interchangeable lenses. In this\nproblem, we will study a simplified model of how the camera works, as well as\nthe mechanism of the Image Stabilizer, which is state-of-art technology to\nimprove the photography quality when shooting with weak light.\nFor simplicity, we assume that the lens with our camera is a \"prime\" lens. This\nmeans that the focal length of this lens is fixed. As shown in Figure 5a, we want to\nshoot an image of a flower which is d = 36cm away from us. (More rigorously, the\nplane normal to the axis near the center of the flower is located distance d from\nthe film plane of the camera.) In today's digital cameras, electronic chips such as\nCCD or CMOS are placed at the image plane. We assume that the refractive index\nof the air is n = 1, and the glass used for the lens has ng = 1.5. The lens is assumed\nto be thin (the distance between the two curved surface is negligible) and\nsymmetric (the curvature of the two refractive surfaces are the same, with radii\nR = 50mm). In this problem, we only consider the imaging of an on-axis point A\non the flower.\n\nFigure 5a\na. In order to form a sharp image A' of A exactly at the film plane, the lens has to\nbe moved longitudinally to a proper position to satisfy the imaging condition\n(focusing). Calculate the distance between the lens nodal point O (center) and\nfilm plane which satisfying the imaging condition (Note: The image is\ndemagnified in camera, which means the valid solution of s satisfies s < d - s).\n\nFigure 5b\n\nb. At dim environments, e.g. indoors or during sunrise, sunset, and at night time,\nthe exposure time must be increased to let the film or CCD/CMOS capture\nenough photons. However, with long exposure time (> 0.1s), it is usually\nimpossible to keep the hand-held camera stationary, resulting in a smeared\nimage. Recently, camera companies developed various techniques to reduce the\neffect of camera shaking on image quality. In general, these techniques use a\nmicro-gyroscope to detect the shaking of the camera during exposure; then the\non-board micro computer drives an actuator to move the lens with respect to\nthe film/CCD/CMOS. Ideally the motion should exactly compensate the camera\nshaking, i.e. freeze the image at the same position on the film/CCD/CMOS.\nCANON's Image Stabilizer (IS) technology moves the lens to achieve this\ncompensation, as shown in Figure 5b. With the lens moved by δ2, the ray is bent\nand deflected to position A'. Assume the camera shaking is a counter clockwise\nrotation of 1* respect to the lens center, as shown in Figure 5b. In which\ndirection and by how much (δ2) does the IS system have to move the lens to\nkeep the image of A fixed at the same position (A') on the CCD?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n2.71 / 2.710 Optics\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Optics, Solutions to Assignment 2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-71-optics-spring-2014/0a21d96bf3d042f1eb0410034f75daaa_MIT2_71S14_HW_2_sols.pdf",
      "content": "Massachusetts Institute of Technology\n2.71/2.710 Optics\nSpring 2014\nSolution for HW2\n1. Modified from Pedrotti 18-9\na) The schematic of the system is given below.\nb) Using matrix method from point A to B,\n1 2\nlens\nA\nB\nM\nC\nD\nd\nd\nf\nd\nd\nd\nf\nf\nf f\nf\nf\nf\n\nFrom the above matrix, we see that A and D are unitless, B is in the unit of length, and C has the unit of 1/length.\nThe effective focal length and location of the principle planes can be calculated from Table 18-2 of Pedrotti:\n:\n,\n:\n,\n:\n,\n(\n1)\n(1\n)\n,\n:\n.\n:\neq\nEFL f\ncm\nC\nD\nA\nFFP p\ncm BFP q\ncm\nC\nC\nD\nA\nPP r\ncm PP\ns\ncm\nC\nC\n\nHere, PP1 represents the location of the starting plane of the system with respect to the original frontal plane A.\nPP2 represents the location of the modified ending plane of the system with respect to the original ending plane B.\n\nMassachusetts Institute of Technology\n2.71/2.710 Optics\nSpring 2014\nSolution for HW2\nc) An example is sketched with the object placed at 20cm to the left of the first lens. The object is located 10cm\nleft to PP1.\nFrom the lens law, we get:\n,\n.\ni\ni\ns\ncm\ns\n\nWe find that the image is located 20cm left to the 2nd principal plane, which is 25cm left to L1.\n\nMassachusetts Institute of Technology\n2.71/2.710 Optics\nSpring 2014\nSolution for HW2\n2. Plano-convex doublet lens\nIn the visible spectrum, the refractive index of glass is close to a constant as shown below in the spectrum\nprovided by Newport.\na) Using the matrix method to calculate the overall optical response, we can get\n\n0.968\n4.026\n0.00950\n0.994\nt\nt\ntotal\nR\nR\nR\nn\nn\nn\nn\nn\nn\nn\nn\nn\nM\nM\nM\nM\nM\nM\nt\nt\nn\nn\nn\nR\nR\nR\nA\nB\nC\nD\n\nand the optical power of the composite lens can be calculated from the equivalent focal length.\n0.00951\neq\nmm\nf\nP\nC\n\nb) If a plane wave is incident from the left, it focuses on the BFP.\n101.97\nB\nm\nF\nA\nm\nC\nP\n\nTherefore the plane wave focuses 102mm after the right surface of the lens.\n\n1 2\nlens\nd\nd\nf\nd\nM\nd\nd\nf\nf\nf f\nf\nf\nf\n\nMassachusetts Institute of Technology\n2.71/2.710 Optics\nSpring 2014\nSolution for HW2\n3. A Telephoto Lens\na) The focal length of each individual lens can be determined as the following.\nThe ABCD matrix for two thin lens is:\n.\nFrom the matrix we can set the following parameters to be:\n:\n300 ,\n:\n.\neq\nEFL f\nm\nC\nA\nBFL q\nmm\nC\n\nPlugging in the two values and using d=120mm, we get\nb) the principal planes can be obtained from:\nlens\nA\nB\nM\nC\nD\n\n,\n(1\n)\n.\nf\nn\nD\nn\nPP\nmm\nC\nA\nPP\nmm\nC\n\n,\n.\nmm\nf\nmm\nf\n\ntan(\n)\n0.3\napprox\nEFL\nmm\nx\nEFL\n\nin\nin\nin\ni\nt\nn\nout\nou\nBF\nx\nx\nx\nBFL\nA\nB\nB\nD\nC\nD\nC\nD\nL\n\n(1\n)\nA\nBFL\nB\nD\nB\nB\nB C\nE\nC\nC\nD\nFL\nC\n\nAD\nBC\n\nMassachusetts Institute of Technology\n2.71/2.710 Optics\nSpring 2014\nSolution for HW2\nPP1 is 240mm left of L1 and PP2 is 200mm left of L2.\nc) The entrance pupil is identical to the aperture stop. The diameter can be obtained from the equation for F-\nnumber:\n4,\n.\nf\nf\nmm\nN\nD\nmm\nD\nN\n\nd) The most efficient way to predict the answer is to graphically think about how much light propagates with the\ngiven angle variation. We can convert the input angle into output vertical distance by recognizing that the\neffective distance of propagation until the focus is EFL:\n.\nIs it really true? Let's check mathematically with the rigorous matrix method. We can construct a new system\nmatrix that includes the propagation to the BFP:\n,\nsince BFL=-A/C. This can be further simplified by:\n.\nIndeed! Here,\ncomes from the fact that the determinant of the system matrix is equal to the ratio\nbetween the initial and final refractive indices,\n. Therefore the distance between the two focuses is 0.3mm.\n0 /\nf\nn\nn\n\ntan\n(3/ 3)\n\ntan\n(9 /15)\n\nMassachusetts Institute of Technology\n2.71/2.710 Optics\nSpring 2014\nSolution for HW2\n4. Modified from Pedrotti 3-5\nAmong elements A, L1, and L2, the one whose image through the elements to its left subtends the smallest angle\nat the center of the EnP is the field stop. Aperture A in this case is our entrance pupil.\nThe rim of A at the EnP subtends 90°.\nThe rim of L1 at the EnP subtends\nL2 should be imaged towards the left, through L1. This iamge, labeled L2', can be calculated as:\n1 ,\n;\n,\n.\ni\ni\ni\ni\ni\no\ns\ncm\ns\ns\ny\nM\ny\ncm\ns\n\nTherefore, the rim of L2' at the EnP subtends\n, which is the smallest angle, making\nL2 the field stop of the system, and L2' the EnW.\nb) The EnW is the image of the FS through the optical components to its left. In a) we calculated this to be L2'.\nThe ExW is the image of the FS through the optical components to its right. Since there are no components to the\nright, the ExW is the L2 itself.\nc) The schematic of the system is given below. The marginal rays in this illustration start from P and toucnes the\nedges of the EnP. After hitting L1, they aim toward P', and after hitting L2, they are redirected towards P'', which\nis the final image. (Image Credit: (c) 2007 Pearson Prentice Hall, Inc)\n(c) Pearson Prentice Hall. All rights reserved. This content is excluded from our\nCreative Commons license. For more information, see http://ocw.mit.edu/fairuse.\n\n(\n30)(s 6)\ns\n\n(\n)sin\n5.24\nox\nd\nm\ns\nm\n\n,\no\ni\no\nx\nx\nx\n\n0.873mm\n\nMassachusetts Institute of Technology\n2.71/2.710 Optics\nSpring 2014\nSolution for HW2\n5. Camera lens and Image Stabilizer system\na)\n(\n1)\n(0.5)\n.\nn\nf\nR\nR\nmm\n\nThe transfer matrix from A to A' can be found as:\n(\n)(1\n)\ns\ns\ns\nd\ns\nf\nf\ns\nd\ns\nA\nB\nC\nD\nf\nf\nd\ns\nf\n\nThe distance is d=36nm. The imaging condition is B=0, which can be solved for s to yield\n.\nWhich is the correct answer? To have a demagnified image (s<d-s), the valid answer is s=6cm.\nb) After the rotation of the camera,\nThen we move the lens up by distance :\n,\n.\ni\no\nx\ns\nx\nd\ns\n\nTherefore the lens must be moved by\nupward to compensate for the shaking.\n(c) Source unknown. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see http://ocw.mit.edu/fairuse.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n2.71 / 2.710 Optics\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Optics, Assignment 3",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-71-optics-spring-2014/8a9b9f790b68d0b5bfed4b6ebb8f5136_MIT2_71S14_HW_3.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\n\n2.71/2.710 Optics\nSpring '14\nHW3\n\nPosted Mar 12, 2014, Due March 19, 2014\n\n1. Optical Path Length Calculation using a Thin Lens:\nThe optical path through a plano-convex lens at a given point (x, y) is proportional to\nits index of refraction n and thickness h(x, y):\n\nh(x, y) = √[R2 -(x2 + y2)] -d\nwhere R is the radius of curvature and d is the distance from the flat surface to the\ncenter of radius.\n\na) Using the thin lens approximation, find distance of the front and back focal\nplane.\nb) For an arbitrary ray (xin\nθ) originated at the front focal plane, calculate the total\noptical path length when it arrives at the back focal plane.\nc) Under paraxial approximation, compare your result of b) with the optical path\nlength of a chief ray (\nxin\n-xin/f).\nd) Plot the phase fronts associated with the two rays in b) and c) before and after\nthe lens. What is your observation?\n\n2. A plane wave and a spherical wave, both of the same wavelength λ, are co-\npropagating as shown on the next page.\n\na) Describe the interference pattern that would be observed on a plane perpendicular\nto the z axis at a distance of 1000λ away from the origin of the spherical wave.\n\nb) Repeat for the plane located 2000λ away from the origin of the spherical wave.\n\nc) What do you observe? Explain in physical terms.\nFront\nFocal\nPlane\nBack\nFocal\nPlane\nh(x, y)\n\nx n\nx\nR\nd\n\nd) What is the relationship between your result and a Michelson interferometer with a\nlens inserted in one of the two arms?\n\n3. Two plane waves of the same wavelength λ, are propagating along the directions\nof wave vectors k1, k2 as shown in the figure below.\n\na) Describe the interference pattern that would be observed on the xy- plane.\n\nb) Describe the interference pattern that would be observed on a plane parallel to\nxy but one wavelength λ away towards the positive z direction.\n\nc) Describe the interference pattern that would be observed on the yz- plane.\nk1\nk2\n30o\n45o\n30o\nz\ny\nx\n\n4. (Pedrotti 7-7) In a Young's double slit experiment, narrow double slits 0.2mm apart\ndiffract monochromatic light onto a screen placed 1.5 m away. The distance between\nto fifth minima on either side of the zeroth order maximum is measured to be 34.73\nmm. Determine the wavelength of the light.\n\n5. (Pedrotti 8-1) When one mirror of a Michelson interferometer is translated by 0.0114\ncm, 523 fringes are observed to pass the cross-hairs of the viewing microscope.\nCalculate the wavelength of the light source.\n\n(c) Pearson Prentice Hall. All rights reserved. This content is excluded from our\nCreative Commons license. For more information, see http://ocw.mit.edu/fairuse.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n2.71 / 2.710 Optics\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Optics, Solutions to Assignment 3",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-71-optics-spring-2014/099f9b294f15689987200d6eb3c72399_MIT2_71S14_HW_3_sols.pdf",
      "content": "(d\nR)\nUsing\nwe get:\n(\n1)\n(\n1)\n(\n1)\n.\n,\n,\n,\n.\nFFP is located\nto the left of the front surface of the lens.\nBFP is located\nto the ri\nn\nd\nn\nn\nf\nR\nR\nnR R\nR\nR\nR\nR\nn\nn\nn\nn\nR R\nf\nf\nR\nR\nf\nR\nf\n\nght of the back surface of the lens.\n\n2014 2.71/2.710 Optics, Solution for HW3\n1. Optical path length calculation using a thin lens\nFigure 1.\na) The thin lens approximation can be applied to the lens maker's equation as:\nAlternatively, the same results can be obtained from the ABCD matrix of the lens:\nA\nB\nn\nC\nD\nf\nR\n\n, which gives BFL = -A/C and FFL=-D/C.\n\n(\n2!\n4!\nsin\n(\n3!\n5!\n(\n(\ncos\n)\n)\ntan\n)\nsec\nc s\no\n)\nO\nO\nO\nO\n\nx\nx\nR\nR\nx\nx\nR\nR\nx\nf\nx\nR\nR\nR\nR\nO\nR\nx\nf\nf\nO\nf\nx\nx\n\n(\n)\nO x\n\n2014 2.71/2.710 Optics, Solution for HW3\nHow much simplification is acceptable in using the paraxial approximation (small angle approximation)?\n-\nThe effect of the paraxial approximation on the angle\nThe small-angle approximation is a useful simplification of the basic trigonometric functions which is\napproximately true in the limit where the angle approaches zero. They are truncations of the Taylor series for the\nbasic trigonometric functions to a second-order approximation.\nIn all cases, the order of the error is limited to be above\n(\n)\nO\n. Whether you choose to work with the original\ntrigonometric functions or choose to work with alternative form such as\n\n, you can make sure that the\nlinear and quadratic terms of\nare preserved.\n\n-\nThe effect of the paraxial approximation on the lateral displacement x\nIn the paraxial approximation, the longitudinal and lateral dimensions can be also simplified using the fact\nthat x is smaller than R and f.\n\n(\ntan )\ne\n)\ns c\n(\nOPL\nf\nf\nf\nf\n\nin\nin\nx\nf\nx\nf\nf\n\n(\n)\n\nin\nin\nx\nOPL\nf\nf\nf\nf\nx\nf\n\nxin\nf\n\n(\n)\n(\n)\n( )\n(\n)\n/\n.\ni\nn\nchief\nn\nn\nin\nf\nf\nn R\nd\nf\nf\nOPL\nR\nx\nf\nn\nd\nx\n\nin\nx\nf\n\n2014 2.71/2.710 Optics, Solution for HW3\nb) Calculate the OPL for an arbitrary paraxial ray.\nLet us denote the path length inside air before the lens as OPL1, the path length inside the lens as OPL2, and the\npath after the lens as OPL3. For the three components, we know the distance of travel in z direction. For an\narbitrary paraxial ray leaving\nin\nx\nat an angle , we can write:\n.\nFrom the fact that the lens is thin, we can safely assume that the lateral height of the ray entering and leaving the\nlens stays the same. Also, we can neglect the small distance traveled in air in front of the lens, between OPL1 and\nOPL2, illustrated in the blue arrow in figure 1.\n)\n(\n)\n(using x\n(x\n)\n( ,\nR\n)\n<<R\nin\nin\nOPL\nn\nx\nf\nn h x y\nR\nR\nf\nnd\nn\nnd\n\nLastly, we can obtain the angle of the ray coming out of the lens to be\n. Therefore,\n.\nNote that the OPL3 for all rays are identical, regardless of the angle. The wavefront plot in d) will clarify this fact\nfurther. Summing up the optical path lengths gives:\n\n(x\n)\n\n(1\n)\n(x\n(\n)\n(\n)\n.\n)\ni\nn\nn\nn\nin\nin\nin\nf\nf\nx\nOPL\nf\nn\nnd\nf\nf\nn\nR\nR\nf\nx\nf\nR\nd\nf\n\nNote that the terms that are proportional to the quadratic order of are not crossed out.\nc) For the chief ray,\n, which gives\nSince a negative term is zero for a chief ray, it is longer than most other rays with\n\n2 (\n1)\n/\n(x\n)\n)\n(x\n)\n(2n 1\n(\n)\n(\n)\n)\n(\nn\nchief\nin\nin\nin\nf\nin\nin\nin\ni\nn\nn\nf\nf\nn\nn\nn\nx\nf\nx\nOPL\nOPL\nf\nx\nf\nf\nx\nf\nf\nx\nf\n\nSetting\nin\nx\nto be positive, the chief ray is longer for\n, which corresponds to\nin\nx\nf\n\n.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n2.71 / 2.710 Optics\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Optics, Assignment 4",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-71-optics-spring-2014/f092c9e94242e194337c49173141c2cf_MIT2_71S14_HW_4.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\n\n2.71/2.710 Optics\nSpring '14\nHW4\nP o s t e d M a r . 1 9 , 2 0 1 4 , D u e A p r . 0 2 , 2 0 1 4\n\n1. The Mach-Zehnder Interferometer measure the relative phase shift of two separate\nlight paths. It operates in a similar principle of Michelson interferometer, except that\ncollimated light beams travel through each arm only once. The flexibility of Mach-\nZehnder interferometry to image over relatively large area makes it convenient for\nflow visualization in wind tunnels and plasma chambers (for instance, at the Alcator C-\nMod Tokamak Located in building NW-21 on the MIT campus).\n\na) As a practice problem, lets' consider a Mach-Zehnder interferometer with a gas cell\nof length 10 cm in one arm as shown. The input light wavelength is = 633 nm.\n\nThe cell is initially evacuated, and we measure a bright spot on the screen at x=0\nposition. As the cell is pressurized, you observe that the spot at x=0 goes dark then\nbecomes bright again with a total of 10 complete cycles. What is the refractive index\nof the gas at the final pressure?\n\nb) (2.710 only) Now let's assume the input light source replaced by a Na+ lamp\n(bichromatic, corresponding to wavelength 1=589.592nm, =588.995nm).\nSince the splitting is small, ∆λ≡(λ1 -λ2) ≪λ ≡\nλ1+λ2\n, show that the intensity at\nx=0 varies periodically from bright to dark when the cell is pressurized with gas,\nstarting again from vacuum, and express the accuracy of the measured refractive\nindex as a function of λ2\n∆λ\n⁄\n.\n\nreference\nmirror\nsignal\nmirror\nunknown\ngas\nlight\nsource\nreference\narm\nsignal\narm\nbeam\nsplitter\nbeam\ncombiner\nrotation\nθ\nScreen\nx\n\n2. (Pedrotti 8-12) White light is passed through a Fabry-Perot interferometer in the\narrangement shown as follows, where the detector is a spectroscope. A series of bright\nbands appear. When mercury light is simultaneously admitted into the spectroscope\nslit, 150 of the bright bands are seen to fall between the violet and green lines of\nmercury at 435.8nm and 546.1nm, respectively. What is the thickness d of the Fabry-\nPerot cavity(etalon)?\n\n3. Exercise on Fourier Transforms: Using known transform pairs and theorems, find the\nFourier transforms of the following:\n\na) rect (\nx\n2W) rect (\ny\n2W)\n\nb) exp(-\nx2+y2\n2W2 )\n\nc) circ (\n√x2+y2\nW\n)\n\nd) sinc(x)comb(y) ⊗comb(\nx\n2)sinc(\ny\n4)\n\ne) circ(√(x-a)2 + y2) + circ(√(x+ a)2 + y2)\n\n(c) Pearson Prentice Hall. All rights reserved. This content is excluded from our\nCreative Commons license. For more information, see http://ocw.mit.edu/fairuse.\n\n4. Fast Fourier Transform with MIT Seal! Please download an MIT seal (similar to the\nattached example), convert it to grayscale by using one of R, G, B color value at each\npixel, and crop its central portion g(x, y) so that it have square shape (e.g., 400 × 400.)\n(Please read Voelz Chapter 2 and 3 regarding digital signal processing and FFT with\nMATLAB).\n\na) Plot your image next to the amplitude |G(u, v)| and phase arg(G(u, v)) of its\nFourier transform G(u, v). (more details may be visible if instead you plot\nlog10|G(u, v)|.)\n\nb) Amplitude or Phase? Let's assume one of the above two Fourier spectrum is\nimmersed in the noise, so we can only recover amplitude or phase information,\nwhile the other is a constant(say |G(u, v)|becomes 1 everywhere). Please plot the\nrecovered image based only on |G(u, v)|or arg(G(u, v)). Which one is closer to the\noriginal barcode?\n\nc) To add a filter to this image, we define a 5 × 5 square region S around the origin of\nthe (\"shifted\" in FFT case) Fourier transform domain:\nT(u,v)=1 inside S\nT(u,v)=0 outside S\n\nNow plot the filtered image: g1(x, y) = ∫∫\nG(u, v)T(u, v) exp(-iux) exp (-ivy)dudv\n\nd) Now invert the filter, so\nH(u,v)=0 inside S\nH(u,v)=1 outside S.\n\nPlot the filtered image g2(x, y) = ∫∫\nG(u, v)H(u, v) exp(-iux) exp (-ivy)dudv.\n\nIf you use MATLAB to solve this problem, you will find the following functions useful:\n(i) fft2 computes the 2D Fourier transform of an image and returns it with some\nquadrants swapped, (ii) fftshift rearranges the quadrants of the Fourier transform in\ntheir proper order, (iii) ifft2 computes the inverse 2D Fourier transform (iv) imagesc;\ncolormap gray displays a real grayscale image, (v) print -dps [filename] prints a figure\ninto a postscript file which you can then print at any Athena printer using the lpr\ncommand.\nThis course makes use of Athena, MIT's UNIX-based computing environment. OCW does not provide access to this environment.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n2.71 / 2.710 Optics\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Optics, Solutions to Assignment 4",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-71-optics-spring-2014/7d6f96a45ca594e6634c3933bd433f91_MIT2_71S14_HW_4_sols.pdf",
      "content": "OPL\ne\ne\ne\nik\ni\ni t\nE\nE\nE\n\nOPL\ne\ne\ne\nik\ni\ni t\nE\nE\nE\n\n2 /\nk\n\nn\nn\n\n(\n1)\nL n\nm\n\n2014 2.71/2.710 Optics, Solution for HW4\n1. Mach-Zehnder Interferometer\na) In a Mach-Zehnder interferometer, the light source is split into two beams (\n,\n). Since the two beams come from the same source, they have equal wavelength\n(therefore equal wavenumber\n) and equal time dependent phase ei t\n. The magnitude of the fields do\nnot change the interference pattern except for its brightness, and thus can be set as a constant value (E).\nThe two beams go through two different light paths with a slightly different optical path length, and then they are\njoined in the end to produce an interference pattern on the screen. The interference pattern on the screen can be\ncontrolled by the rotation of the signal mirror and by a gradual change of the refractive index inside the\npressurized cell.\nIn this problem, the brightness change on the screen is produced by the gradual pressurization of the gas\ncell, and all measurements are taken at x=0 on the screen. A difference in the optical phase between the two\nbeams arriving at x=0 can be calculated from:\n\nk0(OPL2 OPL )\n\nk2\n\nn2 dl2\nn1 dl1\n\n2L(n\nn ).\n\nWhen the cell is evacuated,\nand there is no phase difference between the two signals, resulting\nin a constructive interference between two beams (brightness). As the cell is being pressurized, 10 brightness\ncycles were recorded (m=10). When the cell is fully pressurized, the refractive index reaches n, and the phase\ndifference is equal to\n. Therefore, the refractive index can be calculated from:\n(\n1)\n1.0000633\nm\nL\nL n\nn\n\n(\n1)\nL n\n\n1 2\n(\n1)\ncos\nL n\n\ntot\nI\n2014 2.71/2.710 Optics, Solution for HW4\nand\n\nb) The interference pattern for\ncan be considered separately, since two beams with distinct\nwavelengths are independent and therefore do not interfere with each other. (Recall that two sinusoidal function\nare orthogonal when the period is not exactly equal.) For each wavelength, the interference pattern can be\ncomputed from:\n(\n)\n(\n)\n|\n(\n) (\n*\n*)\n(e\ne\n)\ne\ne\n(1 e\n) 1 e\n(2\n2cos(\n)).\n|\n(\n)\n(\n)\ni\ni\ni\ni\ni\ni\nE\nE\nI\nE\nE\nE\nE\nE\nE\nE\n\nUsing the relationship\n, we obtain:\n(\n1)\n(2\n2cos(\n)\n(\n1)\n)\n(2\n2cos(\n)).\nI\nL n\nI\nL n\nE\nE\n\nRecall that the variable in the above equation is n, since the gas cell is being pressurized in time. The total\nintensity is calculated by summing the two intensities\nI\nI\n\n:\n\n1 2\n1 2\ncos\ncos\n1 cos\nc\n(\n1)\n(\n1)\n(\n1)(\n)\n(\n1)(\n)\nos\n(\n1)\n(\ncos\ncos\n.\n)\ntot\nI\nL n\nL n\nL n\nL n\nL n\nI\nI\nE\nI\nI\nL n\n\nThe result is a beating interference: a high frequency oscillation,\n\n1 2\n(\n1)\ncos\nL n\n\n, is modulated by a\nslowly varying envelope,\n. The plot of\nas a function of n, which is a function of time,\nlooks like the following figure.\nHow a beat is formed (http://hyperphysics.phy-astr.gsu.edu/hbase/sound/beat.html)\nImage removed due to copyright restrictions. Image found at http:\n//hyperphysics.phy-astr.gsu.edu/hbase/sound/imgsou/beat4.gif.\n\nL\nn\n\n2014 2.71/2.710 Optics, Solution for HW4\nThus, the intensity at x=0 on the screen varies periodically in time as the cell is gradually pressured. Since\nthe change in the refractive index is very small, it is likely that only the high frequency oscillation can be counted,\nrather than the envelope. The number of cycles for the high frequency oscillation can be counted to measure the\ntotal change in the optical phase:\n1 2\n1 2\n(\n1)\n.\nL\nL\nL n\nm\nn\nm\nm\n\nThe accuracy of the measurement can be determined by how much index difference is measurable from a single\nbrightness cycle (m=1), which gives\n.\n\n2014 2.71/2.710 Optics, Solution for HW4\nb) Alternate interpretation for the calculation of accuracy\nLet us consider a comparison between two separate interference measurements with\n. While this\nsituation is physically different from the first interpretation and is also hard to implement in reality, the accuracy\nof the refractive index measurement can be derived in a different way. For the same change in the refractive\nindex, two different number of cycles can be measured for\n1and\n\n1and\n.\n(\n1)\n(\n1)\nm\nm\nL n\nL n\n\nThe smallest change in the refractive index can be measured when m1 and m2 differ by one:\n\n(\n1)\n(\n1)\nL\nL n\nL n\nm\nm\nm\nm\nn\n\n435.8\n,\n546.1\n,\n3 10\n/\nnm\nnm c\nm s\n\n2014 2.71/2.710 Optics, Solution for HW4\n2. Fabry-Perot Interferometer\nThe relationship between the frequency and the wavelength\n, where c is the speed of light. Using\n, we get:\nThe thickness d of the etalon can now be calculated from:\n161.8\n435.8\n546.1\n.\nd\nnm\nnm\nd\nm\nd\nm\nd\nm\nm\nm\n\nis\n/\nf\nc\n\n,\n\n6.9 10 Hz,\n\n5.5 10 Hz.\n546.1\n4 5.8\nf\nf\n\nMichael Pasqual\nHomework #4\nApril 2, 2014\n2.710 - Optics\nProblem 3. Fourier Transforms\nI assume here that each function is defined as follows (Section 2.1.6 in Goodman):\nx < 1\nx 2 + y 2 <\n\nrect(x) = 1\nx = 1\n\ncirc( x 2 + y 2 ) =\n\nx 2\n\n+ y = 1\n\notherwise\notherwise\n\nsin(π\n∝\nx )\n\nsinc(x) =\n\ncomb(x) = ∑δ (x - n)\nπ x\nn=-∝\n\nPart (a)\nF\nSeparability Theorem:\ng(x) ⋅ h( y) ←→ G( f X ) ⋅ H( fY ) Eq. 2-21 in Goodman\nF\nf X\nScaling Theorem:\ng(ax) ←→\nG\n\nEq. 2-12 in Goodman\na\na\nF\nFT Pair:\nrect(x) ←→ sinc( f X )\nTable 2.1 in Goodman\nApply\nx\ny\ng(x,y) = rect\n⋅ rect\n\n2W\n2W\ng(x,y) = rect(ax) ⋅ rect(ay)\nwhere a =\n2W\ng(x,y) = h(ax) ⋅ h(ay)\nwhere h(x) = rect(x)\nf\nf\nX\nY\nG( f X ,f Y ) =\nH\n⋅ K\n\nSeparability & Scaling Theorems\na 2\na\na\nf\nf\nX\nY\nG( f X ,f Y ) =\nsinc\n⋅sinc\n\nFT Pair\na 2\na\na\nG( f X ,f Y ) = 4W 2sinc(2Wf X ) ⋅sinc(2WfY )\nrect\nrect\nW\ny\nW\nx\n\n⋅\n\nF\n←→ 4W ⋅sinc(2Wf X ) ⋅sinc(2WfY )\nPage 6 of 12\n\nMichael Pasqual\nHomework #4\nApril 2, 2014\n2.710 - Optics\n\nPart (b)\nF\nSeparability Theorem:\ng(x) ⋅ h( y) ←→ G( f X ) ⋅ H( fY ) Eq. 2-21 in Goodman\nF\nf X\nScaling Theorem:\ng(ax) ←→\nG\n\nEq. 2-12 in Goodman\na\na\nF\nFT Pair:\nexp(-πx ) ←→ exp(-πf X\n2 )\nTable 2.1 in Goodman\nApply\n\nx 2 + y 2\ng(x,y) = exp -\n\n2 W 2\n\nx2\n\ny 2\ng(x,y) = exp-\n2 ⋅ exp\n\n-\n\n2W\n2W 2\nx\n\ny\n\ng(x,y) = exp-\n⋅ exp -\n\n2W\n\n2W\n\ny\n\nx\n\ng(x,y) = exp-π\n⋅ exp -π\n\n2 πW\n\n2 πW\ng(x,y) = exp(- π (ax) 2 )⋅ exp(- π (ay) 2)\nwhere a =\n\n2πW\ng(x,y) = h(ax) ⋅ h(ay)\nwhere h(x ) = exp(- πx 2)\nf\nf\nX\nY\nG( f X ,fY ) =\nH\n⋅\nH\n\nSeparability & Scaling Theorems\na\na a\na\nf\nf\nG( f X ,fY ) =\nH\nX ⋅ H\nY\na 2\na\na\nG( f X ,fY ) = 1\n2 exp\n-π f X\n2 exp\n-π fY\n\nFT Pair\n⋅\n\na\na\na\n\nY\nX\na\nf\nf\n-π\n\n+\nG( f X ,fY ) =\n2 exp\na\n\nG( f X ,fY ) = 2πW exp(-2π W ( f X + fY ))\n(\n))\n(\nexp\nexp\nY\nX\nF\nf\nf\nW\nπ\n-\nπW\nW\ny\nx\n-\n+\n→\n←\n\n+\nPage 7 of 12\n\nMichael Pasqual\nHomework #4\nApril 2, 2014\n2.710 - Optics\n\nPart (c)\nScaling Theorem for Circular Symmetry:\n\ng(ar) ←→\nG\nEq. 2-34 in Goodman\nwhere r\nFT Pair:\ncirc(r)\nF\nρ\nEq. 2-35 in Goodman\n, and J1 is a Bessel function of the 1st\nkind, order 1\nApply\ng(x,y ) = circ\nW\ny\nx\n\n+\n\nr\ng(r) = circ\n\nwhere r\nx\n=\n+ y\nW\ng (r) = circ(ar)\nwhere a = W\nρ\nG( ρ) =\n2 G\n\nScaling Theorem\na\na\nρ\nFT Pair\nρ\nJ1(2π )\na\nG( ρ) = a\nρ\nG( ρ) =\nρ\nπWρ\nJ 2\n(\nW\n)\n\na\na\ny\nx +\n=\nand\nY\nX\nf\nf\nρ\n+\n=\nρ\nπρ\nJ\nF\n)\n(\n→\n←\nwhere\ny\nx\nr\n+\n=\n,\nY\nX\nf\nf\nρ\n+\n=\na\na\nπ\nJ\na\nρ\nG\n)\n(\n)\n(\n=\nρ\n(\n)\n)\n(\ncirc\nY\nX\nY\nX\nF\nf\nf\nf\nf\nπW\nJ\nW\nρ\nπWρ\nJ\nW\nW\ny\nx\n+\n+\n=\n→\n←\n\n+\nPage 8 of 12\n\nMichael Pasqual\nHomework #4\nApril 2, 2014\n2.710 - Optics\n\nPart (d)\nF\nSeparability Theorem:\ng(x) ⋅ h( y) ←→ G( f X ) ⋅ H( fY ) Eq. 2-21 in Goodman\nF\nf\nScaling Theorem:\ng(ax) ←→\nG\nX\nEq. 2-12 in Goodman\na\na\nF\nConvolution Theorem:\ng(x, y) ⊗ h(x, y) ←→ G( f , f ) ⋅ H ( f , f ) Eq. 2-15\nX\nY\nX\nY\nF\nFT Pair:\nsinc(x) ←→ rect( f X )\nTable 2.1 in Goodman\nF\ncomb(x) ←→ comb( f X )\nTable 2.1 in Goodman\nApply\nx\ny\ng(x,y ) = sinc(x) ⋅ comb( y) ⊗ comb ⋅ sinc\n\ng(x,y ) = h(x)k( y) ⊗ k(ax)h(by)\nwhere a =\n, b = , h(x) = sinc(x), k(x) = comb(x)\nf X 1\nfY\nG( f ,f ) = H ( f ) ⋅ K( f ) ⋅\nK\n⋅\nH\n\nConvolution & Scaling Theorems\nX\nY\nX\nY\na\na b\nb\nf X\nfY\nG( f ,f ) = rect( f ) ⋅ comb( f ) ⋅\ncomb\n⋅ rect\n\nFT Pair\nX\nY\nX\nY\nab\na\nb\nG( f ,f ) = 8 ⋅ rect( f ) ⋅ comb( f ) ⋅ comb (2 f )⋅ rect (4 fY )\nX\nY\nX\nY\nX\nF\nsinc(x) ⋅ comb( y) ⊗ comb x\n\n⋅\n\nsinc y\n\n←→ 8⋅ rect( f ) ⋅ comb( f ) ⋅ comb (2 f )⋅ rect (4 fY )\nX\nY\nX\nPage 9 of 12\n\nMichael Pasqual\nHomework #4\nApril 2, 2014\n2.710 - Optics\n\nPart (e)\nLinearity Theorem:\nShift Theorem:\nFT Pair:\nApply\nF\ng(x, y) + h(x, y) ←→ G( f , f ) + H ( f , f ) page 8 in Goodman\nX\nY\nX\nY\nF\ng(x - a, y - b) ←→ G( f , f ) ⋅ exp (- j2π (af + bf ))\nEq. 2-13\nX\nY\nX\nY\nF\ncirc(r) ←→\nρ\nJ 2\n(\nπρ)\nEq. 2-35 in Goodman\nwhere r\nx\n=\n+ y and ρ\nf\n=\nX + fY and J1 is a Bessel function of the\n1st kind, order 1\n(\n)\n(\n)\n(\n)\n)\ncos(\n)\n,\n(\n)\n,\n(\n)\nsin(\n)\ncos(\n)\nsin(\n)\ncos(\n)\n,\n(\n)\n,\n(\n)\nsin(\n)\ncos(\n)\nsin(\n)\ncos(\n)\n,\n(\n)\n,\n(\n)\nexp(\n)\nexp(\n)\n,\n(\n)\n,\n(\n)\nexp(\n)\n,\n(\n)\nexp(\n)\n,\n(\n)\n,\n(\n)\n,\n(\nere\nwh\n)\n,\n(\n)\n,\n(\n)\n,\n(\n)\n)\n(\n(\ncirc\n)\n,\n(\nX\nY\nX\nY\nX\nX\nX\nX\nX\nY\nX\nY\nX\nX\nX\nX\nX\nY\nX\nY\nX\nX\nX\nY\nX\nY\nX\nX\nY\nX\nX\nY\nX\nY\nX\naf\nf\nf\nH\nf\nf\nG\naf\nj\naf\naf\nj\naf\nf\nf\nH\nf\nf\nG\naf\nj\naf\naf\nj\naf\nf\nf\nH\nf\nf\nG\naf\nj\naf\nj\nf\nf\nH\nf\nf\nG\naf\nj\nf\nf\nH\naf\nj\nf\nf\nH\nf\nf\nG\ny\nx\nh\ny\na\nx\nh\ny\na\nx\nh\ny\nx\ng\ny\na\nx\ny\nx\ng\nπ\nπ\nπ\nπ\nπ\nπ\nπ\nπ\nπ\nπ\nπ\nπ\nπ\n⋅\n=\n+\n+\n-\n⋅\n=\n+\n+\n-\n+\n-\n⋅\n=\n+\n+\n-\n⋅\n=\n+\n⋅\n+\n-\n⋅\n=\n=\n+\n+\n-\n=\n+\n+\n-\n=\n)\n)\n(\n(\ncirc\ny\na\nx\n+\n+\n)\n(\ncirc\ny\nx +\nG( f X , fY ) =\n)\n(\n1J\nρ\n⋅\nπρ cos(2πaf X )\n(\n)\n)\ncos(\n)\ncos(\n)\n(\n)\n)\n(\n(\ncirc\n)\n)\n(\n(\ncirc\nX\nY\nX\nY\nX\nX\nF\naf\nf\nf\nf\nf\nπ\nJ\naf\nρ\nπρ\nJ\ny\na\nx\ny\na\nx\nπ\nπ\n+\n+\n=\n→\n←\n+\n+\n+\n+\n-\nPage 10 of 12\n\nMichael Pasqual\nHomework #4\nApril 2, 2014\n2.710 - Optics\n\nProblem 4. Fourier Transform with MIT Seal\nPart (a)\nMatlab Commands\ng\n= imread('MIT Seal','png');\nG\n= fftshift(fft2(g));\nmagG = abs(G);\nargG = atan2(imag(G),real(G));\n%g(x,y)\n%G(u,v)\n%|G(u,v)|\n%arg(G(u,v))\ng(x,y)\nlog10(|G(u,v)|)\narg(G(u,v))\nPart (b)\nMatlab Commands\nG_MagOnly = magG;\n%|G(u,v)|\ng_MagOnly = ifft2(ifftshift(G_MagOnly)); %F-1{|G(u,v)|}\nG_ArgOnly = exp(sqrt(-1)*argG);\n%exp(j·arg(G(u,v)))\ng_ArgOnly = ifft2(ifftshift(G_ArgOnly)); %F-1{exp(j·arg(G(u,v)))}\nlog10(F-1{|G(u,v)|})\nF-1{exp(j·arg(G(u,v))}\nThe image recovered from the phase information is closer to the original image, because the\nphase information determines the spatial location of frequencies in the image.\nPage 11 of 12\n\nMichael Pasqual\nHomework #4\nApril 2, 2014\n2.710 - Optics\n\nPart (c)\nHere, we applied a low-pass filter (LPF) to the image. The result, g1(x,y), is a blurry image\ncontaining low frequencies only.\nMatlab Commands\nN\n= size(g,1);\n%size of image\nmid\n= ceil(N/2);\n%middle index of image\nS\n= 5;\n%filter size\nmid_inds\n= (0:S-1)+mid-floor(S/2); %indices of filter\nT\n= zeros(size(g));\n%initialize T\nT(mid_inds,mid_inds) = 1;\n%T(u,v) - Low-Pass Filter\ng1\n= ifft2(ifftshift(G.*T)); %g1(x,y) = F-1{G(u,v)T(u,v)}\nT(u,v)\ng1(x,y)\nLow Pass Filter (LPF)\nFiltered Image\nPart (d)\nHere, we applied a high-pass filter (HPF) to the image. The result, g2(x,y), is a more detailed\nimage with high frequency edges and features.\nMatlab Commands\nH = 1 - T;\n%H(u,v) - High-Pass Filter\ng2 = ifft2(ifftshift(G.*H)); %g2(x,y) = F-1{G(u,v)H(u,v)}\nH(u,v)\ng2(x,y)\nHigh Pass Filter (HPF)\nFiltered Image\nPage 12 of 12\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n2.71 / 2.710 Optics\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Optics, Assignment 5",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-71-optics-spring-2014/8c8d0a14f38b0a4414be2f21cedd1b6b_MIT2_71S14_HW_5.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\n\n2.71/2.710 Optics\nSpring '14\nHW5\n\nPosted March 31, 2014, Due April 9, 2014\n\n1. (Adapted from Voelz 4-4) Derive analytic expressions for the Fraunhofer field and\nirradiance patterns for the following apertures (shown in Fig. 4.5) illuminated with a\nunit amplitude plane wave. Plot the analytic Fraunhofer irradiance pattern images and\nprofiles for the above apertures on the computer. Choose suitable propagation\ndistances z and side lengths L in the observation plane. Use = 0.547 m and the\nfollowing parameters:\n\n(a) wX = 0.1 mm, wY = 0.05 mm.\n(b) w1 = 1 mm, w2 = 0.2 mm.\n(c) w = 0.3 mm, s = 1 mm.\nVoelz Figure 4.5 Apertures: (a)rectangle; (b)circles with obscuration; (c) pair of circles.\n\n(c) SPIE Press. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see http://ocw.mit.edu/fairuse.\n\n2. (Adapted from Pedrotti 11-14) Retina Display is a brand name used by Apple which\nthey claim have a high enough pixel density that the human eye is unable to notice\npixelation at a typical viewing distance. Let's find the required pixel size based on\nprinciple of diffraction. Assume that the pupil diameter of a normal eye typically can\nvary 2 to 7 mm in response to ambient light variation.\n\na. What is the corresponding range of distance over which such an eye can detect\nthe separation of objects 1 mm apart.\n\nb. Experiment to find the range of distances over which you can detect the\nseparation of lines placed 1mm apart. Use the results of your experiments to\nestimate the diameter range of your pupils.\n\nc. Now we assume the screen of i-Phone is placed at 25cm away from the eye (you\nmay recall this is so called the nearpoint of the eye), estimate the maximum size\nof pixels on the screen you would not notice the pixilation effect.\n\n3. Newton's Rings: The following figure illustrates a setup used for testing plano-convex\nlenses using a famous interference effect, known as Newton's rings. A plano-convex lens\n(n=1.5, thickness t= 1cm, and radius of curvature R=20cm) is placed on a flat mirror,\nand illuminated at normal incidence with a plane monochromatic light at wavelength\n=500nm. For the approximation, assume the path difference between the two\nreflected beams (one at the curved surface of the plano-convex lens and the other at the\nmirror surface) is much smaller than the radius of curvature R of the lens, so we are\nlooking at the inner zones of Netwon's rings.\n\nIncoming\nplane wave\nPlano-Convex\nLens\nFlat\nMirror\nBeam\nSplitter\nCCD Detector\nx\n\na) Assume both the plano-convex lens (n=1.5) and the beam splitter are large enough to\naccommodate the entire lateral width of the expanding paraxial wave, write an\nanalytical expression for and sketch the interference pattern as function of the\ncoordinate x at the observation plane (CCD detector).\n\nb) Calculate the radius of 10th bright ring on the CCD detector.\n\nc) Explain how this Newton's ring pattern would change if the illumination beam tilted\nby a small angle .\n\n4. A blazed glass grating (index of refraction n=1.5) displays a surface shaped like a\nsawtooth, as shown in the following figure. The pitch of the tooth is 2.5 μm.\n\na) Find the optimum height h that maximizes the peak intensity of the -1 order\ndiffracted light for incident wavelength = 532nm.\nb) Using the grating height from a), calculate the steering angle of the -1 order\ndiffracted beam for the following wavelengths: = 488nm (Blue), 532nm (Green),\nand 633nm (Red).\nR\nh(x')\nx'\nPlano-Convex\nLens\nFlat\nMirror\nBlazed\ngrating\nn=1.5\nPeriod\n2500nm\n0th order\nInefficient\ndiffraction\n-1st order\nEfficient\ndiffraction\n+1st order\nInefficient\ndiffraction\nh\n\n5. Diffractive lens (Adpated from Goodman 5-13, 2.710 only): A diffracting\nstructure has a symmetric amplitude transmittance function given by\nt(r) = [1\n2 + 1\n2 cos(γr2)] circ(r\nR)\nThe grating is placed at the plane z = 0 and illuminated by an on-axis plane wave\nE(x, z= 0) = E0\n\na) Show that this grating also possess focusing function.\nb) Determine the focal length of this grating(Hint: you may compare the\ntransmittance function with that of a thin lens t(r) = exp[-ik\nr2\n2f] circ(\nr\nR))\n\nc) What are the limitations of using this diffractive grating as an imaging element for\npolychromatic objects?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n2.71 / 2.710 Optics\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Optics, Assignment 6",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-71-optics-spring-2014/ddd2408cb0b2bcc94e4d9e88763c4891_MIT2_71S14_HW_6.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\n\n2.71/2.710 Optics\nSpring '14\nHW6\n\nPosted April 7, 2014, Due April 16, 2014\n\n1. A simplified grating spectrometer setup is illustrated as in Figure 1. The spectrometer\nconsists of a sinusoidal amplitude grating with complex amplitude transmission\nfunction:\nt(x) = t0+t1cos(2π\nΛ x)\nThe grating is placed at the plane z = 0 and illuminated by an off-axis plane wave\nE(x, z= 0) = E0exp(ikxsinθ)\npropagating at angle θ with respect to the optical axis z.\n\nFigure 1. A grating spectrometer.\n\nThe diffracted lightwaves are transmitted through a lens L1 with focal length f, and\ncollected at the back focal plane for wavelength analysis. In all problems below, let's\nassume the grating is sufficiently large and paraxial approximation is valid across the\nwhole system.\n\na) With a coherent monochromatic illumination at wavelength , derive an expression\nfor the Fresnel diffraction pattern right behind the grating, and argue that the\nexpression that you derived physically represents a coherent superposition of three\nplane waves of different orientation.\n\nb) Using geometric optics, determine the location of the resulting spots on the back\nfocal plane, neglecting for now the diffraction effect due to finite beam width and\naperture of the lens. Use your result to show that the wavelength detection limit,\nof this spectrometer is inversely proportional to grating period .\n\nD\nscreen\nf\nAmplitude\ngrating\ntx\nZ\nL1\nf\nq\n\nc) (2.710 only) Now taking into account of the diffraction effect due to finite beam\nwidth W, estimate the resulting spot width of the diffracted order at the back focal\nplane at monochromatic wavelength . Evaluate again the minimum spectral\nresolution of the grating spectrometer.\n\n2. (Goodman 5-9)Effect of defocusing: A unit-amplitude, normally incident\nmonochromatic plane wave illuminates an object of maximum linear dimension D,\nsituated immediately in front of a larger positive lens of focal length f , as shown\nbelow. Due to a positioning error, the intensity distribution is measured across a plane\nat a distance d - ∆ behind the lens. How small must ∆ be if the measured intensity\ndistribution is to accurately represent the Fraunhofer diffraction pattern of the object?\n\nFigure 2(Goodman 5.18). Schematic of a measurement of defocusing effect.\n\n3. As shown in Figure 3, the input images t1(x, y)and a phase mask t2(x′, y′) were placed\non the surface of the lens L1 and L2. The focal length of the lens L1 is f1 = 2a and that of\nL2 is f2 = a. The spacings between L1 and L2 and the screen are all 2a.\na. Derive an expression for the light distribution on the screen.\nb. (2.710 only) Can you suggest a possible application of such an arrangement?\n\nFigure 3. Optical information processing using 2 convex lenses\nop\n2a\n2a\nOutput Plane\nx\nx\nz\n\nx′\nf=2a\nf=a\nt2(x', y')\n(c) McGraw-Hill. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see http://ocw.mit.edu/fairuse.\n\n4. We are given a 4F imaging system consisting of two identical lenses L1, L2 with focal\nlength f =10cm. As an experiment, you attached a T shaped amplitude mask at the\npupil plane of the imaging system.\n\nFigure 4. 4F imaging system with a T-shaped amplitude mask (dark area is completely\nopaque, and white area is transparent) placed at pupil plane(X, Y).\n\na) A quasi-monochromatic, coherent point source at wavelength λ = 0.5μm, is placed\nat the origin of the input plane (x = 0, y=0). calculate and sketch the Point Spread\nFunction of this lens system at output plane.\n\nb) A coherent illumination field pattern at the input plane of the system is given by\nE(x, y) = E0\n2 [3 + cos(2πx\n4μm) + cos(2πx\n2μm) + cos(2πx\nμm)]\nCalculate the output field and the contrast of the output intensity pattern for wavelength\n=0.547 um(green) and 0.633 um (red).\n\nopaque\nf\nf\nf\nf\nOutput Plane\nInput Plane\nx\nx′\nz\n\nPupil plane\nX\nY\n3cm\n2cm\n1cm\n1cm\n\n5. We are given a 4F imaging system consisting of two identical lenses L1, L2 with\nidentical focal length f. A glass prism of refractive index n, base length w, and apex\nangle α is placed at the pupil plane of the telescope. In all questions below, the\nillumination is assumed to be monochromatic at wavelength λ.\n\nFigure 4. Schematic of a 4F imaging system with a biprism placed at pupil plane(X\",Y\").\n\na) Consider first a point source placed at the origin x = 0 at the input (object) plane, and a\nray departing at angle q from the point source. What is the angle with respect to the\noptical axis z that the same ray emerges from the prism?\n\nb) Use the answer to the previous question to determine the 1D point-spread function (PSF)\nof this system, neglecting for now any diffraction effects due to the finite base length w\nof the prism.\n\nc) Now modify the 1D PSF, taking into account the finite base length w of the prism. You\nmay assume that the prism acts like a thin transparency and α « 1 radian for this\ncalculation.\n\nd) (2.710 only) Now consider the rotationally symmetric version of the prism, also known\nas an \"axicon.\" What is the 2D PSF of the rotationally symmetric system?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n2.71 / 2.710 Optics\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "Optics, Exam 1, 2004",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-71-optics-spring-2014/60a6d4e2ed32356be24e96105cccc1e6_MIT2_71S14_f04_quiz1.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\n2.710 Optics\nFall '04\nQUIZ 1\nMonday, Oct. 4, 2003\n1. (40%) Specify if the following statements are true, false, or inappropriately\nstated. Give a brief justification of your opinion for each statement.\n1.a) A telescope must have large magnifying power.\n1.b) A microscope is the cascade of two magnifying lenses.\n1.c) Consider an optical instrument producing a virtual image. The human eye\ncan convert the virtual image to a real image on the retina, independent of\nwhere the virtual image is located.\n1.d) A hyperopic person's unaided eye can focus on her retina objects that are\nfar away (at infinity).\nPLEASE TURN OVER!\n\n2. (60%) Consider the telephoto lens system shown below. Lens L1 has known\nfocal length f, and lens L2 has unknown focal length f0. The distance d between\nthe two lenses is also unknown. Specify the telephoto system according to the\nfollowing requirements:\nh\nf0\nd\nf\nα\nL2\nL1\nf\ni) An object at infinity, placed off-axis at angular deviation α = 10-2 radians,\nproduces a real image of size h = 5 × 10-2f (cm).\nii) The real image specified in part (i) is located at a distance 3f from L1.\n2.a) Specify the two unknowns f0, d in terms of f.\n2.b) Locate the principal planes.\n2.c) What is the effective focal length (EFL)?\n2.d) If a object is 24f away from lens L1, where is the image plane and what is\nthe magnification? Is the image real or virtual, erect or inverted?\nGOOD LUCK!\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n2.71 / 2.710 Optics\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "Optics, Exam 1, 2008",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-71-optics-spring-2014/c22194819594dea28554db1c697bbe19_MIT2_71S14_s08_quiz1.pdf",
      "content": "2.710\nQuiz 1\n50 min (7:35-8:25pm)\n\nx\nh\nx\nL1\nL2\nL3\nα\n2cm\n1cm\n20cm\n5cm\n8cm\nAS\nFS\nβ\nat infinity\nobject\n20- cm\nplane\nimage\nf =- cm\n3f =+5cm\n1f =+20cm\nMASSACHUSETTS INSTITUTE OF TECHNOLOGY\n2.710 Optics\nSpring '08\nQUIZ 1\nWednesday, March 5th, 2008\nThe optical instrument shown above (not to scale) consists of three lenses L1, L2, L3.\nLenses L1, L3 are positive with focal lengths f1 = +20 cm and f3 = +5 cm, as shown.\nLens L2 is negative, with focal length f2 = -x cm, where x > 0 is to be specified. The\ndistance between L1 and L2 is (20 - x) cm, as shown; that is, once we specify x this\ndistance is also specified. The distance between L2 and L3 is fixed to 8 cm, as shown.\nThe system's aperture stop (AS) is located 20 cm to the left of L1, and its half-size\nis 2 cm. The system's field stop (FS) is located 5 cm to the right of L3, overlapping\nwith the image plane. The FS half-size is 1 cm.\nThe instrument is intended for imaging objects at infinity. If a parallel ray bundle\nfrom such an object arrives at angle α with respect to the optical axis, the instrument\nis required to form a real image of height h = ±50α at the image plane. Use the\nparaxial approximation to answer the following questions.\n1. (30%) Specify x to meet the imaging requirement. Is the image erect or inverted\nin your design? What is the Field of View (FoV)?\n2. (30%) What is the value of the angle β in your design? (The quantity 2β is the\nNumerical Aperture of this instrument.) Hint: It is easiest to compute β for an\non-axis object at infinity, i.e. α = 0.\n3. (10%) Where is the 2nd Principal Plane (2ndPP) located, and what is the Effec\ntive Focal Length (EFL)?\n4. (30%) What is the location and size of the Exit Pupil (ExP)?\nGOOD LUCK!\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n2.71 / 2.710 Optics\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "Optics, Exam 1, 2008",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-71-optics-spring-2014/813ebc3deeb11be44e979e44b9fe0210_MIT2_71S14_s08_quiz1_sols.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n2.71 / 2.710 Optics\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "Optics, Exam 1, 2012",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-71-optics-spring-2014/438c2f4adfa5d5e68ac536013d5b2bff_MIT2_71S14_s12_note_quiz1.pdf",
      "content": "~ Followlha Odf oUSCtJSSIO() ,n l'ne (e'l.'ew cS€tSsion) ter'5 S€e whtAr h~ppe()s when\n118ht travelS\nthro~h (me of 'the P(JSMS Ii) 'the GOI'l! r of 20/2.\nI ,\nI\n~\nc1.. ~ (- cJ. ---? (:-\n('~ ~\nmere fOfe)\n( I d)( I 0) (I d) (I 0)( I d) = (I 2d t <¥n)\na I\non\nI\noYn\n\\\nAS seen) tAe (J'Ief\"o.II cl,stC\\()ce trovelecl ~ 118ht I'S\n(;4\nsuf1)m<AhW) o~\nthe J,:stCA\\')ce trovele>dlh t~e Q,V'(2d) plus thC\\tO'~ the. P(i'SI'r) olvlJeJ bJ\nI'tS\nfef(\"ach'v'~ \"f)d.e')(.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n2.71 / 2.710 Optics\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "Optics, Exam 1, 2012",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-71-optics-spring-2014/92cc87087265e8629d27345d55d79cf7_MIT2_71S14_s12_quiz1.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Mechanical Engineering\n\n2.71/2.710 Optics\nSpring 2012\n\nQuiz 1\n\nMonday, March 12, 2012\n\nPLEASE DO NOT TURN OVER UNTIL EXAM STARTS\n\nDURATION: 60min (9:35-10:35)\n\nTOTAL PAGES: 3\n\nMASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Mechanical Engineering\n2.71/2.710 Optics, Quiz 1\nSpring 2012, Monday, March 12, 2012\n\n1. A Binocular. The simplified optical diagram of an arm of a binocular can be considered as a\ntelescope, which consists of two lenses of focal lengths f1 = 25cm (objective) and f2 = 5cm\n(eyepiece). The normal observer's eye is intended to be relaxed and the nominal focal\nlength of the eye lens is taken to be fEL = 40mm. The first prism is placed 5cm away from\nthe objective and the two prisms are separated by 2cm.\n\na) (10%) In order to make the binocular compact, a pair of 45o prisms (5cm wide) are used, each\nof them is designed for total internal reflection of incoming rays. Estimate the index of refraction\nneeded to meet such a requirement under paraxial beam approximation.\n\nb-e) Assume the index of refraction of both prisms is 1.5.\n\nb) (15%) Please estimate the distance from the eyepiece to the back side of the second prism.\n\nc) (20%) If two distant objects are separated by 10-3rad to an observer with naked eye, how far\napart (in units of length) will the images form on the observer's retina when the observer is using\nthe binocular?\n\nd) (15%) An aperture (D=3cm) is placed inside the binocular, at a distance of 3cm to the left of the\neyepiece. Please locate the Entrance Window and Exit Window, and calculate the Field of View.\n\ne)(extra credit 10%) Where is the optimum location of the observer's eye pupil in the\nconfiguration described by d)?\n\nPLEASE TURN OVER\nEyepiece\n(f2=5cm)\nPrisms\nObjective (f1=25cm)\nField\nStop\na\nW=5cm\nW=5cm\nL1=5cm\nH=2cm\nL2=3cm\n(D=3cm)\n\n2. Reflection from a concave cavity. Figure 2 shows a reflective cavity made of concave\nmirrors, with light source s. The cavity is designed to reflect all rays leaving the source s to a\npoint p along the long axis of the cavity.\n\na) (10%) Following Fermat's principles, the optical path length from s to p on any point\n(x, y) on the reflective cavity should be a constant. Please show such a constant is 2a, the\nlength of the long axis of the cavity.\n\nb) (15%) Using Cartesian coordinates, please prove that any point (x, y) on the reflective\ncavity must satisfy the following relationship:\n\nWhere is the distance from s to p, and is the length of the short\naxis of the cavity. Therefore, the cavity is an ellipse.\n\nc) (15%) Assume the cavity is large enough so you can go in, and a small object is placed\non the left side of the source s, as shown by the arrow in Figure 1. Use ray tracing, please\nlocate the first reflected image of the object. Is it real or virtual?\n\nGOOD LUCK!\nX\nY\nS(-h,0)\nP (h,0)\n(x, y)\na\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n2.71 / 2.710 Optics\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "Optics, Exam 1, 2014",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-71-optics-spring-2014/46ede3e7fd0b097467698e6d64344ece_MIT2_71S14_s14_quiz1.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Mechanical Engineering\n2.71/2.710 Optics\nSpring 2014\nQuiz 1\nMonday, March 3, 2014\nPLEASE DO NOT TURN OVER UNTIL EXAM STARTS\nDURATION: 80min (9:35-10:55)\nTOTAL PAGES: 3\n\nMASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Mechanical Engineering\n2.71/2.710 Optics, Quiz 1\nSpring 2014, Monday, March 3, 2014\n\n1.\nYou are given an optical system that is composed of two converging (L1, f1=4cm\nand L3, f3=3cm) and one diverging lens (L2, f2 unknown). The lens L2 is placed\nto the right of L1 with a gap of d1=6cm and L3 is placed to the right of L2 by a gap\nof d2=1.4cm. By doing experiments, you found that the 3 lenses in combination\nis afocal, that is, rays that enter parallel emerge parallel.\n\na) (20 points) Assuming all elements are thin lenses, calculate the focal length\nf2 of the diverging lens L2 to satisfy the requirement.\n\nb) (10 points) Calculate the angular magnification power of the telescope\nsystem.\nc) (10 points) For a doll placed at 4cm in front of lens L1, locate the image of the\ndoll behind the lens L3.\nd) (20 points) An aperture (AS) is placed inside the system, at a distance of\n4.5cm to the right of the lens f1. For the image in part c), please locate the\nentrance pupil and exit pupil, and calculate the size of the aperture for\nnumerical aperture NA=0.25.\nPLEASE TURN OVER\nf1=4cm\nL1\nL3\nf3=3cm\nV\nV\nf2=?cm\nL2\nd1\nd2\nA.S.\ns1\n\n2. Silvered Glass Hemisphere: A glass hemisphere is silvered over its curved surface.\nA tiny air bubble in the glass is located on the central axis through the hemisphere,\n5cm from the plane surface. The radius of curvature of the hemisphere is 7.5cm, and\nthe glass has index of refraction of 1.50. We may assume paraxial imaging condition\nthroughout the problem.\n\na) (10 points) For an array of parallel beam normally incident from the flat side of\nthe hemisphere, geometrically find the focal point of the combined system by ray\ntracing.\n\nb) (10 points) Looking along the axis into the plane surface, one sees two images of\nthe bubble. Where do they appear?\n\nc) (10 points) Calculate the effective focal length of the optical system.\n\nd) (10 points, 2.710 only) Locate the principle planes.\n\nGOOD LUCK!\nn=1.50\n\n5cm\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n2.71 / 2.710 Optics\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "Optics, Solutions to Exam 1, 2004",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-71-optics-spring-2014/ec087169cdfdbe634528e5a28697e459_MIT2_71S14_f04_quiz1_sols.pdf",
      "content": "u-\na\nor-\nJ 1\n', r 3\nr\n1 *i\n--Vi -\ni $\nQ-\nM\n« a i\n-\nI ^ '-\n!]r\n^\nt\n-v\n^0\n*\n1 3 M\nJ( ? , 1\nI\n-s\n-\n\"\nM\n0f\n\\.\nr*\nV\n.?\n4 -\\, o\ni\n4U\n\" r\ns t\ns , 1\nJ\nD\n^\n^\n^n\nr-\nt f\nr- *.\n. i1l r\no\nri\n\nZ\n+-5\n-h\n,£____-\n*?\n'\nr 7\"\n&\nr\n/\n= -\n9>\nj......\n\n-£?-\nJ.\n^\n\n,<!cpW\n^\nv\n\\\nSi =\nTft\nXT\n^\nai\n4/.\n*/\n\nI\nI\nV\nKb\n!\nI\nOo\n*\nO\n!&-.\nl!\n!f\nHi'\ni\ni c. !\nr\nalj^l *\ni ' i jWlft\n:^;-;\nin\n^l^\n: P:£\n^\nu ; 1\nu\n\n^\n-4LK-\n*9\nII\n-\n- V\n\"V ^ _ _\n^\nv~;o J-_i^^^,4^4_..._~^=O.-\n^\n- --\n-\n--^\n--\n-\n'\n.\n-\n-\n-\n_\n*\n-,.\n_--_\n1 I ^\n^. 11\n° T ^\n|\n. ,\n-l--J--Uf'\n+-±- r\n'\nI\n\nU\nM\nif)\n*!hi\n4:\n4^K\n|\n!\nQ i\n!\ni\n.\nj\nw i\n<\n!\ni\n'\n!\nj\ni\ni\n;\n:\ni *\n'\nr^\n;\nIT\ni^^\n; v\n'\ni\ni\n\nU\nM\nif)\n*!hi\n4:\n4^K\n|\n!\nQ i\n!\ni\n.\nj\nw i\n<\n!\ni\n'\n!\nj\ni\ni\n;\n:\ni *\n'\nr^\n;\nIT\ni^^\n; v\n'\ni\ni\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n2.71 / 2.710 Optics\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "Optics, Solutions to Exam 1, 2012",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-71-optics-spring-2014/98e136ff424ad35d0adedc93ad7f7fbe_MIT2_71S14_s12_quiz1_sols.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\n\n2.71/2.710 Optics\nSpring '12\nQuiz #1 Solutions\n\n1. A Binocular. The simplified optical diagram of an arm of a binocular can be considered\nas a telescope, which consists of two lenses of focal lengths f1 = 25cm (objective) and f2 =\n5cm (eyepiece). The normal observer's eye is intended to be relaxed and the nominal\nfocal length of the eye lens is taken to be fEL = 40mm. The first prism is placed 5cm\naway from the objective and the two prisms are separated by 2cm.\n\na) (10%) In order to make the binocular compact, a pair of 45o prisms (5cm wide) are\nused, each of them is designed for total internal reflection of incoming rays. Estimate\nthe index of refraction needed to meet such a requirement under paraxial beam\napproximation.\n\nb-e) Assume the index of refraction of both prisms is 1.5.\n\nb) (15%) Please estimate the distance from the eyepiece to the back side of the second\nprism.\n\nc) (20%) If two distant objects are separated by 10-3rad to an observer with naked eye,\nhow far apart (in units of length) will the images form on the observer's retina when\nthe observer is using the binocular?\n\nd) (15%) An aperture (D=3cm) is placed inside the binocular, at a distance of 3cm to the\nleft of the eyepiece. Please locate the Entrance Window and Exit Window, and\ncalculate the Field of View.\n\ne) (extra credit 10%) Where is the optimum location of the observer's eye pupil in the\nconfiguration described by d)?\nEyepiece\n(f2=5cm)\nPrisms\nObjective (f1=25cm)\nField\nStop\na\nW=5cm\nW=5cm\nL1=5cm\nH=2cm\nL2=3cm\n(D=3cm)\n\nSolution:\na) The plane wave incident on the lens is converted into a converging spherical wave.\nAlthough each ray is initially parallel when it enters into the system at the objective lens,\neach exits the lens at a different angle with respect to the optical axis.\n\nBy applying Snell's law at the right interface of the prism, we can calculate the index of\nrefraction that is required for total internal reflection. However, the angles incident on\nthe interface depend upon the angle of the initial plane wave entering the system. Since\nno information is given about this angle, the simplest way to estimate the index of the\nprism is to consider a ray that strikes the interfaces with an incident angle of 45°.\n\n[1-1]\nThe index of the prism can be calculated from the criterion for total internal reflection,\nwhich occurs when the transmitted angle is 90°, i.e. it travels along the glass-air interface.\nFor an incident critical angle, , the index can be found to be:\n\n[1-2]\nTherefore, the index of refraction of the prism is estimated to be around 1.4, which is\nconsistent with the 1.5 value typical of glass.\nb) By ray tracing we can gain some intuition about what is happening in the system. We see\nthat the prisms act to essentially collapse the system into a more compact space. The\nangle of inclination of each ray entering into the top prism is identical to the angle of\ninclination of that same ray as it departs the lower prism. However, the rays leaving the\nlower prism are bundled closer together than they were when they entered into the\nupper one. Therefore, the focal point of the binoculars is located at a different plane than\nwould have occurred had the prisms been replaced with mirrors instead. We can find the\nlocation where the rays are focused by invoking Fermat's principle, which says that all\nrays that emerge from the objective lens must travel the same distance to the focal plane.\nHere, the easiest ray to trace is the one that enters the upper prism parallel to the optical\naxis.\nIf the prisms were absent the focal plane would simply occur one focal length away from\nthe objective lens. However, the presence of the prisms alters the trajectory of light rays\nby bending them towards the optical axis as they pass through the glass. This causes the\nrays to emerge from the exit end of the prism at a location further from the optical axis\nthen they would have if the prisms were made of air (i.e. replaced with mirrors).\n\nIn order to find the distance between the second prism and the eyepiece, the location of\nthe focal plane of the rays emerging from the second prism must first be found. There are\ntwo ways this can be accomplished:\nMethod 1: The focal plane can be most simply located by matching the optical path\nlength that the binocular system takes with the focal length of the objective lens.\nHowever, care needs to be taken because the optical path length of light through the\nbinocular system must be adjusted so that the path occurs completely in air. This means\nwe must determine the optical path length of the rays through the prism and determine\nthe equivalent distance along the optical axis light would take through air only.\n\n[1-3]\n\n[1-4]\n\n[1-5]\nThe optical path length from the objective lens to the focal plane through the binoculars,\nwith an equivalent path through air:\n\n[1-6]\nwhere is the distance from the objective lens to the first prism, is the equivalent\ndistance light takes through the prism as if it were in air instead, and d is the distance\nfrom the lower prism to the focal plane. For a prism index of 1.5:\n\n[1-7]\n\nNow we can match the OPL found in equation [1-7] with the focal length of the objective\nlens:\n\n[1-8]\nMethod 2: Another way of viewing this system is to essentially unwrap it into a linear\nconfiguration and apply the matrix method:\n\n[1-9]\nUsing Hecht's notation, the system matrix in equation [1-6] can be written as:\n\n[1-10]\n\nMerging equations [1-6] and [1-7] two equations can be found:\n\n[1-11]\n\n[1-12]\nThe height of an image of an object located at infinity should not depend on the height of\nthe initial rays. Therefore, a22 must be equal to zero:\n\n[1-13]\nNotice, this is the same result as that produced by Method 1 (Equation [1-8]).\nIn order for the eyepiece to produce an image at infinity for comfortable viewing with the\neye, it must be located one focal length away from the intermediate image produced by\nthe binocular objective and prisms. Therefore, the distance from the right side of the\nlower prism to the eyepiece is:\n\n[1-14]\nc) Continuing with the matrix method, we can determine the locations of the two objects on\nthe retina.\n\n[1-15]\nAs before, the system matrix can be rewritten as:\n\n[1-16]\nIt is noted that the distance from the eye-piece to the eye, L, is not yet known. Also from\nequation [1-8] it was found that d = 34/3 cm. Therefore:\n\n[1-17]\nMerging equations [1-14] and [1-4], two equations can be found:\n\n[1-18]\n\n[1-19]\nFrom equation [1-19] the differential between the off-axis locations of objects with a\ndifference in incident angles of 10-3 rad can be found:\n\n[1-20]\nd) The entrance and exit pupils associated with the aperture can be found by imaging it\nthrough the preceding and following elements respectively with the imaging condition:\n\n[1-21]\nThe entrance pupil can be found by using the focal length of the objective lens and an\nobject distance of:\n\n[1-22]\nTherefore, the entrance pupil that corresponds to the aperture is located 337.5cm to the\nleft of the objective lens.\nLikewise, the exit pupil associated with the aperture can be found by imaging it through\nthe eyepiece lens. The object distance is now simply :\n\n[1-23]\nTherefore, the exit pupil corresponding to the aperture is located 7.5cm to the left of the\neyepiece lens.\nFrom the problem statement, the aperture discussed above is taken as the field stop. The\nfield of view in this case is defined as twice the angle that the outer edge of the field stop\nmakes with the center of the objective lens, α. Therefore the FOV is:\n\n[1-24]\nNote that the field stop is currently located at a poor position along the optical axis. To be\neffective in limiting the spatial extent of the image, it should ideally be located at a\nlocation where a real image is formed. In this configuration, it should be one focal length\nto the left of the eyepiece, i.e. 5cm instead of 3cm.\ne) The optimal location of the eye is at the exit pupil of the binocular. In this situation, it is\nassumed that objective lens acts as the aperture stop. Therefore, the exit pupil is located\nwhen the ray passing through the center of the objective lens also passes through the\ncenter of the crystalline lens of the eye. The system matrix for this situation would be:\n\n[1-25]\n\nAs before, the system matrix can be rewritten as:\n\n[1-26]\n\n[1-27]\n\n[1-28]\nSince we are interested in the ray that passes through both the center of the objective\nlens and the center of the eye, we take yout = yin = 0. Therefore, from equation [1-28], the\ndistance from the eyepiece to the eye must be:\n\n[1-28]\n\n2. Reflection from a concave cavity. Figure 2 shows a reflective cavity made of concave\nmirrors, with light source s. The cavity is designed to reflect all rays leaving the source s\nto a point p along the long axis of the cavity.\n\na) (10%) Following Fermat's principles, the optical path length from s to p on any point (x,\ny) on the reflective cavity should be a constant. Please show such a constant is 2a, the\nlength of the long axis of the cavity.\n\nb) (15%) Using Cartesian coordinates, please prove that any point (x, y) on the reflective\ncavity must satisfy the following relationship:\n\nWhere is the distance from s to p, and is the length of the short\naxis of the cavity. Therefore, the cavity is an ellipse.\n\nc) (15%) Assume the cavity is large enough so you can go in, and a small object is placed on\nX\nY\nS(-h,0)\nP (h,0)\n(x, y)\na\n\nthe left side of the source s, as shown by the arrow in Figure 1. Use ray tracing, please\nlocate the first reflected image of the object. Is it real or virtual?\n\nSolution:\na) Fermat's theorem tells us that all rays traveling from point S and converging at point P will\ntravel the same distance. The simplest ray that can be considered is one that travels along\nthe long-axis and makes a reflection at the right vertex of the elliptical cavity:\n\n[2-1]\nb) Since all of the rays that leave point S converge to point P, the ray that travels from point S to\nP must both travel the same distance of 2a.\n\nThe total path travelled by the ray from point S to point P is the sum of arms 1 and 2. The\noptical path length is:\n\n[2-2]\nSimplifying:\n\n[2-3]\nGiven than the minor radius of the ellipse, b, is defined as equation [2-3] can be\nsimplified to yield the classic equation of an ellipse.\nh\nh\na\n❶\n❷\nS\nP\nh\nh\nx\ny\n❶\n❷\nS\nP\n\n[2-4]\n\n[2-5]\nc) Since the object is small, we can consider paraxial rays that leave from the object with slight\nangles of inclination and take advantage of the same special rays used to ray trace in a\nspherical mirror system. Two simple rays can be considered, a ray leaving horizontal to the\nlong axis will pass through the focus of the cavity, and a ray striking the vertex of the cavity\nwill have the same reflection and incident angles.\n\nAs seen in the figure above, the image formed from a single reflection off of the cavity wall is\nvirtual. Notice that this is the same situation that happens for an object located between the\nfocal point and the vertex point of a concave spherical mirror. Other images can be formed\nelsewhere by the cavity, only if paraxial rays are considered. Outside of the paraxial\napproximation, it becomes increasingly unlikely that all of the rays leaving a point on the\nobject will converge to a focused image point.\n\nSolutions by MTK, Spring 2012.\nS\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n2.71 / 2.710 Optics\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "Optics, Solutions to Exam 1, 2014",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-71-optics-spring-2014/4790ddc766046818459f7d78a48ee8e2_MIT2_71S14_s14_quiz1_sols.pdf",
      "content": "2.71/2.710 Optics, Spring 2014, Solution for Quiz 1\n\nMASSACHUSETTS INSTITUTE of TECHNOLOGY\nDepartment of Mechanical Engineering\n2.71/ 2.710 OPTICS - - Spring Term, 2014\n\nSolution for Quiz 1\nIssued Wed. 03/12/2014\n\nProblem 1.\nThe given optical system is made of 3 lenses and an aperture. The problem states that the\ncomposite system is a telescope: the rays that enter parallel should emerge parallel. Since\nparaxial approximation is valid (x<<z), both the ABCD matrix method and the step-by-step use\nof the lens law will yield the same correct solution.\n(a) Method 1: ABCD Matrix\nThe ABCD matrix of the system, starting from L1 and ending at L3, can be constructed\nas the following.\n\n1 2\n1 2\n1 2\n1 2\n1 3\n1 2 3\n2 3\n2 3\nsystem\nL3\nd2\nL2\nd1\nL1\nM\n\n=\nM\nM\nM\nM\nM\nf\nf\nf\nd\nd\nd\nd\nf\nf\nf f\nf\nd\nd\nd\nd d\nd\nd\nd\nd d\nf\nf\nd\nd\nd\nd\nf\nf\nf\nf\nf\nf\nf f\nf\nf\nf\nf\nf\nf\nd\nd\nd\nd\n\n(1.1)\nAn aperture does not change the ABCD matrix, since both the angle and the lateral height of the\nray is unaffected by an aperture. Recall that the ABCD matrix relates the input and output rays\nby:\n\nout\nin\nout\nin\nx\nx\nA\nB\nC\nD\n\n.\nIn order for a parallel ray to emerge parallel, the output angle should not be affected by the input\nheight x. Therefore, C should be zero. Solving for C=0 gives:\n\n1 2\n1 3\n2 1\n1 2\n2 3\n3 1\n1 2\n1 3\n1 3\n2 1\n(\n)\n.\nd\nd f\nd f\nd\nd\nf\nf f\nf f\nf f\nd\nf f\nd f\nd f\ncm\nd\nd\nf\nd\nd\nf\nf\n\n(1.2)\n\n2.71/2.710 Optics, Spring 2014, Solution for Quiz 1\n\nMethod 2. Step-by-step lens law\nFor light propagating in the positive direction, the object distance\nos is defined to be\npositive for an object place on the left side of the lens. The image distance is is defined to be\npositive for an image appearing on the right side of the lens. A parallel ray can be expressed as\nan object placed at\nos . Writing out the lens law for L1, we see that\n\n(\n1 ,\n,\n)\no\ni\no\ni\nf\ns\ncm\nf\ncm\ns\nf\ns\ns\n\n.\n(1.3)\nAfter passing through L1, a parallel ray will focus at the focal point,\nis\nf\n\n. Next, the image\nfrom L1 becomes the object for L2. The object distance can be calculated from\no\ni\nd\ns\ns\n\n, with\nrespect to L2. Using the lens law for L2, we obtain:\n\n,\n(\n)\no\no\ni\ncm\ns\ns\nf\ns\n\n,\n(1.4)\nwhere both\n2f and\nis\nare unknown. The image from L2 becomes the object for L3. With\nrespect to L3, the object distance can be calculated from\no\ni\ns\nd\ns\n\n. Since the problem states\nthat the output beam from a parallel input beam should also be parallel, we know that\nis .\n\n(\n1 ,\n,\n)\no\ni\no\ni\nf\ns\ncm\nf\ncm\ns\nf\ns\ns\n\n.\n(1.5)\nPlugging in this result back to (1.4), using\no\ni\ns\nd\ns\n\n, we obtain\n1.6\ni\ncm\ns\n\nand:\n\n.\n1.6\nf\ncm\ncm\ncm\nf\n\n(1.6)\n\nIndeed, the same answer with (1.2) is obtained.\n(b) The angular magnification power of the telescope system is\n/\nout\nin\n\n. Using ABCD method,\nwe can calculate:\n\n1 2\n2 3\n/\n1.06\nd\nd\nd\nd d\nf\no t\nn\nf\nf\nf\nu\ni\nD\n\n.\n(1.7)\nAlternatively, step-by-step lens law gives the same answer:\n\n1.06\n1.6\ni\ni\ni\no\no\no\ns\ns\ns\ns\ns\ns\n\n.\n(1.8)\nThe angular magnification power is -1.06.\n\n2.71/2.710 Optics, Spring 2014, Solution for Quiz 1\n\n(c) Using the ABCD matrix approach, we can construct the overall matrix including the\npropagation from the object to L1 as 1s , and the propagation from L3 to the image as\n2s .\n\ns\nsystem\ntotal\ns\ns\nA\nB\ns\nA\nB\nM\nM M\nM\nC\nD\nC\nD\n\n(1.9)\nIn order for the system to form an image,\nB\nshould be satisfied, which gives:\n\n1 2\n0.9375 4\n8.45\n4.4\n1.06\nA\nB\nDs\ns\nB\nB\ns\nCs\nAs\ns\nD\n\n(1.10)\nTherefore the image forms 4.406cm to the right of L3. Alternatively, the step-by-step lens law\nyields:\n\n,\n4 ,\ni\ni\ni\ns\ns\ns\nf\ns\n\n(1.11)\n\no\ni\nd\ns\ns\n\n(1.12)\n\n,\n,\ni\ni\no\ni\ns\ns\ns\nf\ns\n\n(1.13)\n\n9.4\no\ni\ns\nd\ns\n\n(1.14)\n\n9.4\n,\n4.406\no\ns\ns\ns\nf\ns\n\n(1.15)\nWe get the same answer with (1.10).\n(d) The entrance (exit) pupil is the image of the aperture stop through all optical elements before\n(after) the aperture stop. The EnP is calculated by using the lens law for L1 in the backward\ndirection:\n\n,\n,\n4.5\nEnP\nAS L\nEnP\nEnP\ns\ncm\ns\nf\ns\ns\n\n.\n(1.16)\nTherefore the EnP is located 36cm to the left of L1. Note that when the object is imaged in the\nbackward direction as in this case, simply substituting a negative value for\nos doesn't work.\n4.5\n4 : (incorrect!)\nis\n\n.\n\n2.71/2.710 Optics, Spring 2014, Solution for Quiz 1\n\nFor the ExP, we can write the consecutive lens law for L2 and L3 in the forward direction:\n\n,\n1.2632\n1.5\n8 ,\nAS\nL\ns\ns\ns\nf\ns\n\n(1.17)\n\n,\n23.72\n2.6632\n,\nExP\nExP\nExP\ns\nd\ns\ns\nf\ns\n\n(1.18)\nTherefore the ExP is located 23.72cm to the left of L3.\nThe object is located at the focal point of L1. Therefore, the marginal ray that leaves the\naxial point on the object plane becomes parallel to the axis after passing through L1. Therefore,\nthe NA can be calculated by\n\ntan\n0.25,\n1 005\n/ 2\n.\nD\ns\ncm\nD\n\n.\n(1.19)\nThe diameter of the AS is 1.005cm.\n\n2.71/2.710 Optics, Spring 2014, Solution for Quiz 1\n\nProblem 2. Silvered Glass Hemisphere\nA paraxial ray incident on the flat side of the hemisphere goes through the following:\n(1) Flat glass surface: refraction, change in angle if incident ray is not parallel.\n(2) Straight propagation inside glass, + direction.\n(3) Reflection at a curved surface with radius R: change in angle, and direction.\n(4) Straight propagation inside glass, - direction.\n(5) Flat glass surface: refraction, change in angle if incident ray is not parallel.\nRecall that a paraxial approximation is necessary to define a single focus for a non-parabolic\nsurface. Under the paraxial approximation,\ntan\nsin\n\n.\n(a) Graphically, steps (1) through (4) for a parallel incident ray are depicted in Figure 1.\n\nFigure 1\nThe focal point of a curved reflector can be obtained from the intersection between the reflection\nof the parallel ray and the horizontal axis. From the equality of the three angles marked in Figure\n1, we see that the length fO and fP are equal. Therefore, the focal point is the midpoint between\nO and R. Since the mirror is concave,\n7.5\nR\ncm\n\n, and\n/ 2\n3.75\nf\nR\ncm\n\n. The focal length\nof a concave mirror is positive.\n\n2.71/2.710 Optics, Spring 2014, Solution for Quiz 1\n\nb) We are now given a bubble that is inside the glass hemisphere. There are two images:\n(1) Object refracted through plane,\n(2) Object reflected by hemispherical mirror, then refracted through plane.\n\n(1) Object refracted through plane\nThe first image can be obtained by tracing a ray that leaves the object parallel towards the\nleft, and another ray that hits the axial point of the glass surface. The image is erect, and has the\nsame height as the object, as shown in Figure 2. This is a virtual image since the outgoing rays\nfrom a point on the object always diverge, rather than converge to form a real image.\n\nFigure 2\nThe location of the image can be obtained from the snell's law between the two angles\n,\ng\na\n\n:\n\nsin\nsin\n,\n.\na\na\ng\ng\na a\ng\ng\nn\nn\nn\nn\n\n(1.20)\nIn the paraxial limit, the two equations of (1.20) are equal. The location of the image with respect\nto the center of the hemisphere O can be obtained by comparing the two triangles, with angles\n,\ng\na\n\nat O. The location of the image can be found from:\n\ntan\ntan\n,\n/\n/1.5\n/\n3.3\n.\ni\na\no\ng\ni\no g\na\na\ng\no\ns\ns\ns\nn\ns n\ns\ncm\ncm\n\n(1.21)\nThus, the upright, virtual image is located 3.33cm to the right of the flat glass surface.\n\n2.71/2.710 Optics, Spring 2014, Solution for Quiz 1\n\n(2) Object reflected by hemispherical mirror, then refracted through plane.\nThe second image can be obtained by tracing a ray leaving the object parallel to the axis\ntowards the mirror, which is reflected to pass through the focal point. Next, a ray that hits the\naxial point of the mirror can be traced. The left side of Figure 3 shows the virtual image formed\nfrom reflection, in green dotted lines.\n\nFigure 3\nThis virtual image is erect and is larger than the object. The location of the image can be\nobtained from:\n\n/ 2\n7.5\n3.7\n,\n7.\ni\no\ni\ni\nR\ncm\ncm\ns\ncm\ns\ns\nf\ns\ncm\n\n.\n(1.22)\nTherefore, the virtual image is located 7.5cm to the right of the vertex of the hemisphere, before\nrefraction by the flat glass surface.\nSince the observer is in the air, the green rays are once more refracted by the flat glass\nsurface. The red rays in the right side of Figure 3 depict this refraction. The solid red rays\nrepresent the corrected image that the observer in the air can see. The location of the refracted\nimage can be obtained in the same way from (1.21):\n\n,\n/\n/1.5\ntan\nt\n/\n.\nan\ni\na\no\ng\ni\no g\na\na\ng\no\ns\ns\ns\ns\ns\nc\ncm\nn\nm\nn\n\n(1.23)\nTherefore, the virtual image is located 10cm to the right of the flat glass surface.\n\n2.71/2.710 Optics, Spring 2014, Solution for Quiz 1\n\nc) Let us consider the path of light to calculate the effective focal length for the system. Light is\nincident from the left side of the flat surface, and goes through the following components:\n(1) Refraction. Air into glass\n(2) Propagation. d=7.5cm\n(3) Concave Mirror Reflection. f=-2/R=3.75cm\n(4) Propagation. d=7.5cm\n(5) Refraction. Glass into air\nThere is no way that light can reach inside the system without being refracted at the flat surface.\nTherefore the system is defined to start and finish right outside the flat glass surface in air, rather\nthan inside the glass. The system ABCD matrix can be calculated as:\n\nsystem\n(4)\n(5)\n(3)\n(2)\n(1)\nM\n\n=M\n(1\n)\n,\n0.\nM\nM\nM\nM\ng\na\ng\na\na\ng\na\na\ng\ng\na\ng\na\ng\nn\nn\nf\nn\nn\nn\nn\nn\nR\nn\nn\nd\nd\nR\nR\nn\nn\nn\nd\nn\nR\nn\nR\nd\nd\nd\nd\nd\n\n(1.24)\nwhere\n7.5\n,\n7.5\n,\n1,\n1.5\na\ng\nd\ncm n\nn\nR\ncm\n\n. From (1.24), we calculate the EFL to be:\n\n2.5\n.\nEFL\ncm\nC\n\n(1.25)\nd) The principle planes are displaced from FFP and BFP by EFL: PP1+EFL=FFL,\nPP2+EFL=BFL. Since both FFP and BFP are located 2.5cm to the right of the flat glass surface,\nBoth PP's are located 5cm to the right of the flat glass surface. Alternatively, using the ABCD\nmatrix, we can get:\n\n(\n1)\n(1\n)\n,\n.\nD\nA\nPP\ncm\nPP\ncm\nC\nC\n\n(1.26)\nIndeed, the 1st PP is located 5cm to the right of the input plane, which is the flat surface. The 2nd\nPP is also located 5cm to the right with respect to the output plane, which is again the flat surface.\n(The negative sign of PP2 results from the negative propagation direction: -5cm to the left is the\nsame as 5cm to the right.) The principle planes overlap at 5cm to the right of the flat surface.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n2.71 / 2.710 Optics\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "Optics, Exam 2, 2004",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-71-optics-spring-2014/83752efebf664e7a9e7588a44a5da111_MIT2_71S14_f04_quiz2_Set_2.pdf",
      "content": "\"\nx\nx\noptical\naxis\nx'\nf\nf\nf\nf\ninput\nt(x)\nFourier\nimage\nplane\nplane\nx0\na\na\n\"\ny\nx \"\nplane\nL1\nL2\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n2.71 / 2.710 Optics\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Optics, Lecture 2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-71-optics-spring-2014/d558a4fabb2cc2eee8f864d3928b31f6_MIT2_71S14_lec2_notes.pdf",
      "content": "Lecture Notes on Geometrical Optics (02/10/14)\n2.71/2.710 Introduction to Optics -Nick Fang\nOutline:\n-\nGeometrical light rays\n-\nFermat's Principle of least time\n-\nFermat's Principle applied to Reflection and Refraction\n-\nSnell's Law examples\n-\nImaging and the Lens Law\n-\nThe Lens Maker's Formula\n-\nThin lens and keys for ray tracing\n-\nOptical Invariant\n-\nComposite Lenses\nIntroduction:\nWhile Maxwell's equations can solve light propagation in a rigorous way, the exact\nsolutions can be found in fairly limited cases, and most practical examples require\napproximations.\nBased on the specific method of approximation, optics has been broadly divided into two\ncategories, namely:\ni.\nGeometrical Optics (ray optics), treated in the first half of the class\n-\nEmphasizes on finding the light path\n-\nEspecially useful for studying the optical behavior of the system which has\nlength scale much larger than the wavelength of light, such as:\n-\ndesigning optical instruments,\n-\ntracing the path of propagation in inhomogeneous media.\nii.\nWave Optics (physical optics).\n-\nEmphasizes on analyzing interference and diffraction\n-\nGives more accurate determination of light distributions, because both the\namplitude and phase of the light are considered.\nA. Geometrical Light Rays\n-\nGeometrical optics is an intuitive and efficient approximation:\nRadios and mobile phones make use of same Maxwell Equations to transfer\ninformation as carried by light waves, but our perception is quite different.\nWhy?\n\nLecture Notes on Geometrical Optics (02/10/14)\n2.71/2.710 Introduction to Optics -Nick Fang\nWe tend to think of light as bundles of rays in our daily life. This is because we\nobserve the processes (emission, reflection, scattering) at a distance (> 10cms\nwith bare eyes) that are much longer than the wavelength of light (10-7m or 400\n700nm), and our receivers (retina and CCD pixels) are also considerably large.\nIn the other end, the wavelength of radio-frequency waves (10cm at 3GHz) is\ncomparable or sometimes larger than the size and spacing between\ntransmitting/receiving devices (say, the antennas in your cell phones).\nDistance of event\nwavelength\nVector Field, Polarization\n(Scalar) Fourier Optics\nGeometric\nOptics\nRadio\nEngineering,\nAntennas,\nTransmission\nlines,\ncavities,\namplifiers\nNano-Optics\nWavelength\nmin feature size\n-\nWith a common reference (the optical axis in your optical system) to make\nthe problem as simple as possible, a light ray can be defined by two co\nordinates:\no its position, x\ne\no its slope, e\nx\n2SWLFDOD[LV\nThese parameters define a ray vector,\nwhich will change with distance and\nas the ray propagates through optics.\nSign Conventions:\n\nLecture Notes on Geometrical Optics (02/10/14)\n2.71/2.710 Introduction to Optics -Nick Fang\noptical axis\n+ive\ncurvature\n-ive\ncurvature\nnegative\nray angle\npositive\nray angle\npositive\ndirection\npositive\nray elevation\nnegative\nray elevation\n-ive\ndirection\n- Light travels from left to right\n- A radius of curvature is positive if the surface is convex towards the left\n- Longitudinal distances are positive if pointing to the right\n- Lateral distances are positive if pointing up\n- Ray angles are positive if the ray direction is obtained by rotating the +z axis\ncounterclockwise through an acute angle\nProperties of rays:\n1) trajectories of \"particles of light\"\n2) Normal to the wavefront surfaces\n3) Continuous and piece-wise differentiable\n4) Ray trajectories are such as to minimize the \"optical path\"\n⇒ in free space, ray trajectories are straight lines\nB. Fermat's Principle of least time:\nAt first glance, Fermat's principle is similar to the problem of classical mechanics:\nfinding a possible trajectory of a moving body under a given potential field (We will\nintroduce such Lagrangian or Hamiltonian approach in more detail in the coming\nlectures about gradient index optics).\n\nLecture Notes on Geometrical Optics (02/10/14)\n2.71/2.710 Introduction to Optics -Nick Fang\nThe underlying argument is, light propagating between two given points P and P',\nwould take the shortest path (in time). In order to quantify the variation of light\nspeed in different medium, we introduce of an index of refraction n:\n\nݒ ؠ\nWhere:\nc~3x108 m/s is speed of light in vacuum;\nand v is the speed of light in the medium.\nUsing the index of refraction, we can define an \"Optical Path Length\"(OPL):\n\nሺHሻൌ\nܮ\n\nThis is equivalent to finding the total time (T= OPL/c) required for signals to travel\nfrom P to P', and vice versa.\nHow is it consistent with wave picture? Modern theorists like Feynman take more\nrigorous approach to show that all other paths that do not require an extreme time\n((shortest, longest or stationary) are cancelled out, leaving only the paths defined by\nFermat's principle.\nUnder this formulation, we need to find a class of optical paths r (one or more) that\nݏറሻݎሺ\n(1)\nడ\nare extreme value (డ௦ܮሺHሻൌͲ).\nAnalogy between Light path and a problem of lifeguard on the beach: Which path\nshould the lifeguard follow to reach the drowning person in minimum time?\n\nLecture Notes on Geometrical Optics (02/10/14)\nmirror\nOr dielectric interface\nO'\nO\ne\ne\n2.71/2.710 Introduction to Optics -Nick Fang\nC. Fermat's Principle applied to Reflection and Refraction\na. Application on flat interfaces:\nP'\nP\nP\"\nz\nx'\nn\ne\nn'\nz'\nP'\ne'\nh\nx\nP\nFigure: The law of reflection (Left) and refraction (Right) over a flat interface using\nFermat's Principles. Results are the famous Snell's (Decartes') Law of refraction and\nreflection.\nb. Application on curved surfaces:\no Parabolic reflector\n-\nWhat should the shape function s(x) be in order for the incoming parallel ray\nbundle to come to a geometric spot? (Hint: for every path from the incoming\nplan wave reflected by the mirror, OPL=2f )\n\nLecture Notes on Geometrical Optics (02/10/14)\n2.71/2.710 Introduction to Optics -Nick Fang\nS(x)\nx\nz\nf\nF\nfocus at F\nExamples of Reflectors: solar concentrators, satellite dishes, radio telescope\n\nLecture Notes on Geometrical Optics (02/10/14)\n2.71/2.710 Introduction to Optics -Nick Fang\no Elliptic refractor\nair\nglass\nRefractive\nindex n\nS(x)\nx\nf\nF\nD. A Mechanics View of Snell's Law and examples\nWe can compare the reflection and refraction of light to that of a ball bouncing off a\nhard wall.\nWhile the velocity of the ball changes immediately after collision, its projection\nparallel to the wall does not change. This is because there is no force acting on the\nball during the collision process, therefore the momentum does not change along\nthis direction. The same argument applies to the light ray: the momentum of light\nparticles in the direction parallel to the \"wall\" (an ideally flat surface) does not\nchange during reflection and transmission. Such process is often visualized with the\nfollowing graph method with the help of Decartes spheres:\n\nLecture Notes on Geometrical Optics (02/10/14)\n2.71/2.710 Introduction to Optics -Nick Fang\noptical\naxis\nIndex n'\nIndex n\ninterface\np\n\np\n//\np\n\np\n//\np\np\nThe half circles represent the amplitude of momentum in different medium (aa ൌ\nఠ\n\n), and the colored arrows indicates the direction of incident, reflected and\n\ntransmitted light beams, and momentum is conserved in the parallel direction,\nindicating p// = p'// .\nSnell's Law for\nmany parallel\nlayers\nIf the layers are\nparallel, then these\nangles are always\nequal.\nn1\nn2\nn3\nn4\nn5\ne1\ne5\ne2\ne2\n\nLecture Notes on Geometrical Optics (02/10/14)\n2.71/2.710 Introduction to Optics -Nick Fang\nE. Refraction from a sphere: paraxial approximation\n\nΤ ሻ ൎଶሺߠ௨௧ ݔ\nn1\nn2\nxin\ne1\ne2\nein\nes\nR\nz\neout\nes\nSnell's Law is approximated:\nA\n\nൎݔ௦ߠݏ\n\nΤ ሻ\n\nTwo special cases:\n- ߠൌͲ: The incoming beams are collimated, and the refracted beams are\nconverging to a spot at a distance.\n\nݔ\nߠሺ\nଵ\n\n(2)\nݏΤ\nݔଶ\n\nൎെ\n௨௧ߠଶ\nൎ\n\nΤ\nݔሻ\nଶ\nെ\nଵ\n\nሺ\ni\n-ߠ௨௧ ൌͲ: The beams emitted by a spot at a distance are converted to\ncollimated outgoing beams after refraction.\n\nΤ\nݔሻ\nଵ\nെ\nଶ\n\nሺ\nൎ\nߠଵ\n\nൎଵ ݏݔΤ o\nF. Imaging and the Lens Law\nIn the general case\n\nሺݔଵ\n\nΤ\n\nݔ\nݏ\nΤ ሻൎ\n\nሺെݔଶ\n\nΤ\n\nݔ\nݏ\nΤ ሻ\nWe find the following relationship:\nభ\nమ\n௦ ൎ\nమିభ\nோ\n(3)\nTo form a real image with converging beams in both sides, we see that both so and si has to\nbe larger than a minimum distance. If either of these conditions are broken then we will\nobtain a virtual image.\n\nLecture Notes on Geometrical Optics (02/10/14)\n2.71/2.710 Introduction to Optics -Nick Fang\nG. The Lens Maker's Formula\nTypically a lens is formed with two spherical glass surfaces. Let's place a second interface\nto the right of our spherical glass (without loss of generality, let's assume the first surface is\ngenerating a virtual image to help our drawing).\nOn the first interface we obtain:\n\nᇱൎ\nᇱି\n(4)\n௦భ\n௦భ\nோభ\nNote that Si1 is negative since the image is virtual. For the second interface, we\nagain use the Eq(3)\nᇱ\nൎ\nିᇱ\n(5)\n௦మ\n௦మ\nோమ\n. Adding (4) and (5) we find:\nଵݏൌെ\nଶݏ Also,\n\nͳ\nͳ\nԢ\n\nሻ\nെ\nᇱ\n\nሺ\nൎ\nെ\n൰\nଵݏ\nଶݏଵ\n\nଶ\n\nଵݏሻ\nଵݏ\nെ\nሺ\nWhen the lens is thin (d<<R1, R2), we can neglect the last term. Further, if the\nmedium is air (n=1), we arrive at the famous Lens maker's equation:\nଵ\nቀ\nሻ\nെͳ\nᇱ\n\nሺ\nൎ\nோభ\nଵ\nଵ\n௦మ\nെ\nଵ ቁ\n(6)\nோమ\n௦భ\n\nLecture Notes on Geometrical Optics (02/10/14)\n2.71/2.710 Introduction to Optics -Nick Fang\nPractice Example 1:\nI found a glass plano-convex lens thin lens on my shelf and I am using it to image\na light bulb 36cm in front of the lens. Assume the index of refraction is 1.5 and the radius\nof the lens is 6cm, where can I find the image behind the lens?\nH. Thin Lenses, Ray tracing\n3 Simple Rules:\n1) Rays parallel to the optical axis (from the left side of lens) are deflected through\nthe right focal point.\n2) Rays passing through the left focal point becomes parallel to the optical axis;\n3) Rays passing through the center of the lens remain in the same direction.\n\nLecture Notes on Geometrical Optics (02/10/14)\n2.71/2.710 Introduction to Optics -Nick Fang\nFigure (Figure 2-22 from Pedrotti)\n(c) Pearson Prentice Hall. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see http://ocw.mit.edu/fairuse.\n\nLecture Notes on Geometrical Optics (02/10/14)\n2.71/2.710 Introduction to Optics -Nick Fang\nPractice problem 2: A luminous object marked by the arrow and an observing\nscreen are separated by a fixed distance L>4f (the focal length of the lens). Show that\nthere are two positions separated by a distance D, where a thin convex lens can be\nplaced to give a focused image on the observing screen. What is the expression of f as a\nfunction of L and D? This is known as Bessel's method to find the focal length.\n(c) Pearson Prentice Hall. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see http://ocw.mit.edu/fairuse.\n\nؠࡹ\n:Magnification\nObservation from ray tracing\nൌെ\n௦ (since image is\ninverted)\nI. Optical Invariant\n-What happens to an arbitrary \"axial\" ray that originates from the axial intercept of\nthe object, after passing through a series of lenses?\n\nLecture Notes on Geometrical Optics (02/10/14)\n2.71/2.710 Introduction to Optics -Nick Fang\nIf we make use of the relationship between launching angle and the imaging\nconditions, we have:\nߠൌ\nand ߠ௨௧ ൌ\nఏ\nఏೠ ൌ\n௦ ൌെ\n\nRearranging, we obtain:\n\nൌߠ\nߠ\nWe see that the product of the image height and the angle with respect to the axis\nis a\n௨௧ߠൌԢ\nߠݏ\n\n.Indeed a more general result,\nconstant\nremains a\nconstant (often referred as a Lagrange invariant in different textbooks) across any\nsurface of the imaging system.\n-\nThe invariant may be used to deduce other quantities of the optical system,\nwithout the necessity of certain intermediate ray-tracing calculations.\n-\nYou may regard it as a precursor to wave optics: the angles are approximately\nproportional to lateral momentum of light, and the image height is equivalent\nto separation of two geometric points. For two points that are separated far\napart, there is a limiting angle to transmit their information across the\nimaging system.\nJ. Composite Lenses:\nTo elaborate the effect of lens in combinations, let's consider first two lenses\nseparated by a distance d. We may apply the thin lens equation and cascade the\nimaging process by taking the image formed by lens 1 as the object for lens 2.\nf1\nf2\nf1\nf2\nd\nͳ\nͳ\nͳ\nͳ\n\nൌ൬\n\n൰െ\nଶ\n\nଵ\nଶݏ\nଵݏ\n\nଵݏሻ\nଵݏ\nെ\nሺ\n\nLecture Notes on Geometrical Optics (02/10/14)\n2.71/2.710 Introduction to Optics -Nick Fang\nA few limiting cases:\nis the back-focal length (BFL)\nଶݏ Parallel beams from the left:\na)\nͳ\nͳ\nͳ\n\nൌ൬\n൰െ\n\nଵ\nଶ\n\nଵ\nሻ\nଵ\nെ\nሺ\nis the front-focal length (FFL)\nଵݏ b) collimated beams to the right:\nͳ\nͳ\nͳ\n\nൌ൬\n൰െ\n\nଵ\nଶ\n\nଶ\n\nሻ\nଶ\n\nെ\nሺ\nThe composite lens does not have the same apparent focusing length in front and\nback end!\nc) d=f1+f2: parallel beams illuminating the composite lens will remain parallel at\nthe exit; the system is often called afocal. This is in fact the principle used in\nmost telescopes, as the object is located at infinity and the function of the\ninstrument is to send the image to the eye with a large angle of view. On the\nother hand, a point source located at the left focus of the first lens is imaged at\nthe right focus of the second lens (the two are called conjugate points). This is\noften used as a condenser for illumination.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n2SWLFV\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Optics, Lecture 4",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-71-optics-spring-2014/04d4bff4ff4a9ae5e2c8ba7500905557_MIT2_71S14_lec4_notes.pdf",
      "content": "Lecture Notes on Geometrical Optics (02/18/14)\n2.71/2.710 Introduction to Optics -Nick Fang\n\nOutline:\nA. Optical Invariant\nB. Composite Lenses\nC. Ray Vector and Ray Matrix\nD. Location of Principal Planes for an Optical System\nE. Aperture Stops, Pupils and Windows\n\nA. Optical Invariant\n-What happens to an arbitrary \"axial\" ray that originates from the axial intercept of\nthe object, after passing through a series of lenses?\nIf we make use of the relationship between launching angle and the imaging\nconditions, we have:\nθin=\nxin\nso\nand θout= -\nxin\nsi\n\nθin\nθout= -\nsi\nso=\nhi\nho\nRearranging, we obtain:\nθinho= θouthi\n\nWe see that the product of the image height and the angle with respect to the axis\n(the components of the ray vector!) remains a constant. Indeed a more general\nresult, nhosinθin= n′hisinθout is a constant (often referred as a Lagrange\ninvariant in different textbooks) across any surface of the imaging system.\n-\nThe invariant may be used to deduce other quantities of the optical system, without\nthe necessity of certain intermediate ray-tracing calculations.\n-\nYou may regard it as a precursor to wave optics: the angles are approximately\nproportional to lateral momentum of light, and the image height is equivalent to\nseparation of two geometric points. For two points that are separated far apart,\nthere is a limiting angle to transmit their information across the imaging system.\n\nB. Composite Lenses\nTo elaborate the effect of lens in combinations, let's consider first two lenses\nseparated by a distance d. We may apply the thin lens equation and cascade the\nimaging process by taking the image formed by lens 1 as the object for lens 2.\n\nLecture Notes on Geometrical Optics (02/18/14)\n2.71/2.710 Introduction to Optics -Nick Fang\n\nso1\n+ 1\nsi2\n= (1\nf1\n+ 1\nf2\n) -\nd\n(d-si1)si1\n\nA few limiting cases:\na) Parallel beams from the left: si2 is the back-focal length (BFL)\nBFL = (1\nf1\n+ 1\nf2\n) -\nd\n(d-f1)f1\n\nb) collimated beams to the right: so1 is the front-focal length (FFL)\nFFL = (1\nf1\n+ 1\nf2\n) -\nd\n(d-f2)f2\n\nThe composite lens does not have the same apparent focusing length in front and\nback end!\n\nc) d=f1+f2: parallel beams illuminating the composite lens will remain parallel at\nthe exit; the system is often called afocal. This is in fact the principle used in\nmost telescopes, as the object is located at infinity and the function of the\ninstrument is to send the image to the eye with a large angle of view. On the\nother hand, a point source located at the left focus of the first lens is imaged at\nthe right focus of the second lens (the two are called conjugate points). This is\noften used as a condenser for illumination.\n\nf1\nf2\nf1\nf2\nd\n\nLecture Notes on Geometrical Optics (02/18/14)\n2.71/2.710 Introduction to Optics -Nick Fang\n\nC. Ray Vector and Ray Matrix\nIn principle, ray tracing can help us to analyze image formation in any given optical\nsystem as the rays refract or reflect at all interfaces in the optical train. If we restrict\nthe analysis to paraxial rays only, then\nsuch process can be described in a\nmatrix approach.\n\nIn the Feb 10 lecture, we defined a\nlight ray by two co-ordinates:\na. its position, x\nA\nB\nC\nD\n\nOptical system ↔ Ray matrix\nin\nθin\nout\nθout\nPractice Example: Huygens eyepiece\n\nA Huygens eyepiece is designed with two plano-convex lenses separated by the\naverage of the two focal length. Ideally, such eyepiece should produce a virtual image at\ninfinity distance. Let f1=30cm and f2=10cm, so the spacing d=20cm, let's find these\nparameters:\n\na) BFL and FFL,\n\nb) the location of PPs,\n\nc) the EFL.\nd=20cm\n\nLecture Notes on Geometrical Optics (02/18/14)\n2.71/2.710 Introduction to Optics -Nick Fang\n\nb. its slope,\nThese parameters define a ray vector, which will change with distance and as the\nray propagates through optics.\nAssociated with the input ray vector ( in\nθin) and output ray vector( out\nθout), we can\nexpress the effect of the optical elements in the general form of a 2x2 ray matrix:\n\n( out\nθout) = [A\nB\nC\nD] ( in\nθin)\nThese matrices are often (uncreatively) called ABCD Matrices.\nSince the displacements and angles are assumed to be small, we can think in terms\nof partial derivatives.\nin\nin\nout\nin\nin\nout\nout\nx\nx\nx\nx\nx\n\nin\nin\nout\nin\nin\nout\nout\nx\nx\n\nTherefore, we can connect the Matrix components with the functions of the imaging\nelements:\nA= (\n∂xout\n∂xin) : spatial magnification;\nD= (\n∂θout\n∂θin) : angular magnification;\nB= (\n∂xout\n∂θin) : mapping angles(momentum) to position (function of a prism);\nC= (\n∂θout\n∂xin) : mapping position to angles(momentum) (also function of a prism).\n\nFor cascaded elements, we simply multiply ray matrices. (please notice the order of\nmatrices starts from left to right on optical axis!!)\n\nSignificance of the matrix elements: (Pedrotti Figure 18.9)\nO1\nO3\nO2\nout\nθout\nin\nθin\nout\nθout\n= 2 1\nin\nθin\n\nLecture Notes on Geometrical Optics (02/18/14)\n2.71/2.710 Introduction to Optics -Nick Fang\n\n(a) If the input surface is at the front focal plane, the outgoing ray angles depend\nonly on the incident height.\n(b) Similarly, if the output surface is at the back focal plane, the outgoing ray heights\ndepend only on the incoming angles.\n(c) If the input and output plane are conjugate, then all incoming rays from constant\nheight y0 will converge at a constant height regardless of their angle.\n(d) When the system is \"afocal\", the refracting angles of the outgoing beams are\nindependent of the input positions.\n\nExample 1: refraction matrix from a spherical interface (only changes but not x)\n\nRight at the interface,\nin= out\n\nn1(θin+ inR\n⁄ ) ≈n2(θout+ inR\n⁄ )\nθout≈(n1\nn2\n) θin+\n[(n1\nn2) -1]\nR\nin\nSo we can write the matrix:\n\nn1\nn2\nxin\nin\ns\nR\nz\nout\ns\n(c) Pearson Prentice Hall. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see http://ocw.mit.edu/fairuse.\n\nLecture Notes on Geometrical Optics (02/18/14)\n2.71/2.710 Introduction to Optics -Nick Fang\n\nExample 2: matrix of a ray propagating in a medium (changes x but not )\n\nExample 3: refraction matrix through a thin lens (combined refraction)\n\nExample 4: Imaging matrix through a thick lens (combined refraction and\ntranslation)\n\nFrom left to right:\n-\nTranslation O1:\n[1\nso1\n1 ]\n-\nRefraction O2:\n[\n[(n\nn′) -1]\nR1\n(\nn\nn′)\n]\n\n-\nTranslation O3:\n[1\nd\n1]\n\n-\nRefraction O4:\n[\n[(n′\nn) -1]\n-R2\n(\nn′\nn)\n]\n\nxin , in\nz = 0\nxout , out\nz\nR1\nR2\nd\nso1\n-|si1|\nsi2\nn'\nn\nn\nout\nin\nin\nout\nin\nx\nx\nz\n\n(\n1)/\n(1/\n1)/\n1/\nthin lens\ncurved\ncurved\ninterface\ninterface\nO\nO\nO\nn\nR\nn\nn\nR\nn\n\nLecture Notes on Geometrical Optics (02/18/14)\n2.71/2.710 Introduction to Optics -Nick Fang\n\n-\nTranslation O5:\n[1\nsi2\n1 ]\n\nD. Location of Principal Planes for an Optical System\nA ray matrix of the optical system (composite lenses and other elements) can give\nus a complete description of the rays passing through the overall optical train. In\nthis session, we show that the focusing properties of the composite lens, such as\nthe principal planes.\nIn order to facilitate our analysis, we choose the input plane to be the front surface\nof the lens arrays, and the output plane to be the back surface of the lenses.\n\n(Adapted from Pedrotti Figure 18‐12)\nLet's start with the process of focusing at back focus first. In this case, an incoming\nparallel ray( 0\n0 ) is refracted from the 2nd principal plane (PP) so it passes through\nthe back focal point (BF). At the output plane, the ray vector of the refracted ray\nreads(\nf\n-θf).\n(\nf\n-θf) = [A\nB\nC\nD] ( 0\n0 )\nThis gives f= A 0 and -θf= C 0\n.\n\nd\nBFL\nx0\nInput\nPlane\nOutput\nPlane\n2nd PP\nxf\nEFL\n-f\n-f\n\nLecture Notes on Geometrical Optics (02/18/14)\n2.71/2.710 Introduction to Optics -Nick Fang\n\nUsing the small angle approximation, we can connect the ratio of beam height 0 and\nthe effective focal length (EFL) by the steering angle θf:\nθf= 0/EFL\nThus\n\nEFL = -1/C.\nAlso from the similar triangles,\nf/ 0 = BFL/EFL.\nWe can find BFL:\nBFL= -A/C.\nThus the 2nd PP is located at a distance from the output plane given by:\nBFL-EFL= -(A-1)/C.\nLikewise, we can find FFL and the first principal plane by the matrix components.\n\n( ′0\n0 ) = [A\nB\nC\nD] (- ′f\n-θ′f\n)\n\nd\nFFL\nx0\nInput\nPlane\nOutput\nPlane\n1st PP\nx'f\nEFL\n-'f\n-'f\n\nLecture Notes on Geometrical Optics (02/18/14)\n2.71/2.710 Introduction to Optics -Nick Fang\n\nYou could consider this as an inverse problem of the previous example, or solve the\nrelationship:\n′0 = -A ′f-Bθ′f\n\n0 = -C ′f-Dθ′f\n\nθ′f= ′0/EFL and θ′f= ′f/FFL\n\nSo how is the ray matrix experimentally determined by ray tracing?\nGenerally, for a given (2D) optical system with unknown details, one way to\ndetermine the transfer matrix is to take measurement of two arbitrary input and\noutput rays. To elaborate that idea, we can treat a pair of the input ray vectors as a\n2x2 matrix:\n( out\nout\nθout\nθout\n2 ) = [A\nB\nC\nD] ( in\nin\nθin\nθin\n2 )\n\nTherefore\n[A\nB\nC\nD] = ( out\nout\nθout\nθout\n2 ) ( in\nin\nθin\nθin\n2 )\n-1\n\n[A\nB\nC\nD] =\n( in\n1 θin\n2 - in\n2 θin\n1 ) ( out\nθin\n2 - out\n2 θin\nout\n2 in\n1 - out\nin\nθout\n1 θin\n2 -θout\n2 θin\nθout\n2 in\n1 -θout\n1 in\n2 )\nAs a special case you may select the two rays to be marginal and chief rays as\ndefined in the following section.\n\nLecture Notes on Geometrical Optics (02/18/14)\n2.71/2.710 Introduction to Optics -Nick Fang\n\nPractice Example: Rays Going Through 2F/4F Lens system\nPlease determine the ray transfer matrix of the following lens elements, with\ntheir input and output planes located at the front and back focal point of the\ncorresponding lens.\n\nf\nf\n\nLecture Notes on Geometrical Optics (02/18/14)\n2.71/2.710 Introduction to Optics -Nick Fang\n\nE. Aperture Stops, Pupils and Windows\no The Aperture Stops and Numerical Aperture\n\no Numerical Aperture(NA):\n- limits the optical flux that is admitted through the system;\n- also defines the resolution (or resolving power) of the optical system\n\no The concept of marginal rays and chief rays\n-\nMarginal ray: the ray that passes through the edge of the aperture.\n-\nChief ray (also called principal rays): the ray from an object point that\npasses through the axial point of the aperture stop (also appears as\nemitting from the axis of exit pupil).\nTogether, the C.R. and M.R. define the angular acceptance of spherical ray\nbundles originating from an off-axis object.\n\no The entrance and exit pupils\n\nmulti-element\noptical system\naperture\nstop\nimage through\npreceding elements\nimage through\nsucceeding elements\n\nLecture Notes on Geometrical Optics (02/18/14)\n2.71/2.710 Introduction to Optics -Nick Fang\n\no The field stop and corresponding windows\n\no Field stop:\n-\nLimits the angular acceptance of Chief Rays\n-\nDefines the Field of View\n-\nProper FS should be at intermediate image plane\no Entrance & Exit Windows\n\nimage through\npreceding elements\nimage through\nsucceeding elements\nfield\nstop\n\nLecture Notes on Geometrical Optics (02/18/14)\n2.71/2.710 Introduction to Optics -Nick Fang\n\no Effect of Aperture and field stops\n\nNA\nentrance\npupil\naperture\nstop\nexit\npupil\nFoV\nentrance\nwindow\nexit\nwindow\nfield\nstop\n(momentum)\nx\n(location)\nEffect of Apertures and stops\n'(momentum)\nX'\n(location)\n2 3\n2 3\napertures\nField stops\n\nLecture Notes on Geometrical Optics (02/18/14)\n2.71/2.710 Introduction to Optics -Nick Fang\n\nPractice Example: Single lens camera:\n\n-\nPlease determine the position and size of the image.\n-\nPlease determine the entrance and exit pupils.\n-\nPlease sketch the chief ray and marginal rays from the top of the object to\nthe image.\n(c) Pearson Prentice Hall. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see http://ocw.mit.edu/fairuse.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n2.71 / 2.710 Optics\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Optics, Lecture 7",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-71-optics-spring-2014/3a0560c6aa37dc11eae36f3f69a4ed7b_MIT2_71S14_lec7_notes.pdf",
      "content": "Review on Geometrical Optics (02/26/14)\n2.71/2.710 Introduction to Optics -Nick Fang\n\nReminder: Quiz 1 (closed book, Monday 3/3, in class)\nTopics Covered:\n(Pedrotti Chapter 2, 3, 18)\n\nReflection, Refraction, Fermat's Principle,\n\nPrisms, Lenses, Mirrors, Stops\n\nLens/Optical Systems\n\nAnalytical Ray Tracing, Matrix Methods\n\nOutline:\nA. Two General Approaches in Geometrical Optics\nB. From \"Perfect\" imager to paraxial rays, effects of aperture and stops\nC. Thin lenses and imaging condition\nD. Composite lenses\n\nA. Two General Approaches in Geometric Optics\nvs\n\nBoth approaches of GO Focused on the ray vector (x, ) (which carry the power flux\n(e.g. unit: W/cm2), and its change with distance and as the ray propagates through\noptics.\nApproach 1. Tracing rays through interfaces (e.g. Matrix Methods)\n\nApproach 2: Given the source and destination, what are the possible paths of\nshortest distance? (e.g. Eikonal Equations, Langrangian and Hamiltonian Optics)\n\n-The connection: momentumdescribe the slope of change of the ray in\nposition x at different time interval (but here we see them in steps along the\noptical axis z).\n\nO1\nO3\nO2\n\nReview on Geometrical Optics (02/26/14)\n2.71/2.710 Introduction to Optics -Nick Fang\n\nTherefore, the matrix method is similar to Newtonian equations:\n(t+ ∆t) (t) + v∆t\nv(t+ ∆t) v(t) + a∆t\n(a is acceleration; in a potential field U( ), a -\ndU\ndx )\n\nWe may define Optical Lagrangian: L n( , z)√ + 1\n\n∂L\n∂ d\ndz(∂L\n∂ )\n\nLHS: \"Potential force\"\nRHS: \"Acceleration\"\n\nOr\n∂n\n∂ √ + 1 d\ndz\nn\n√ + 1\n\n∂n\n∂\n√ + 1\nd\ndz\nn\n√ + 1\n\nExample: Two Interpretation of Refraction\n\nvs\n\noptical\naxis\nIndex n'\nIndex n\ninterface\np\n\np\n//\np\n\np\n//\np\np\nh\nx\nx'\nn'\nn\nz\nz'\nP'\nP\n\n'\n\nReview on Geometrical Optics (02/26/14)\n2.71/2.710 Introduction to Optics -Nick Fang\n\nImaging as a mapping in ray vector spaces\n\nB. From \"Perfect\" imager to paraxial rays, apertures and stops\n\n\"Ideal\" lens: aspherical!\nSpherical lens: only good for small\nProblem: spherical aberration (cos ≈1 -\nθ2\n+\nθ2\n4! + ⋯);\nMitigation: use proper apertures to reduce NA (max)\n\no Effect of Aperture and field stops\n(momentum)\nx\n(location)\n'(momentum)\nX'\n(location)\n2 3\n2 3\nair\nglass\nRefractive\nindex n\nS(x)\nx\nf\nF\n\n(c) Pearson Prentice Hall. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see http://ocw.mit.edu/fairuse.\n\n(c) Pearson Prentice Hall. All rights reserved. This con tent is excluded from our Creative\nCommons license. For more information, see http://ocw.mit.edu/fairuse.\n\nReview on Geometrical Optics (02/26/14)\n2.71/2.710 Introduction to Optics -Nick Fang\n\nNA\nentrance\npupil\naperture\nstop\nexit\npupil\nFoV\nentrance\nwindow\nexit\nwindow\nfield\nstop\n(momentum)\nx\n(location)\nEffect of Apertures and stops\n'(momentum)\nX'\n(location)\n2 3\n2 3\napertures\nField stops\n\nReview on Geometrical Optics (02/26/14)\n2.71/2.710 Introduction to Optics -Nick Fang\n\nC. Thin Lens and Imaging Condition\n\nImaging condition:\ns\n+ 1\ns\nf\n\nSpatial Magnification:\nM≡h\nh\nA 1 -s\nf\nAngular Magnification:\nMα≡\n\n≈ /s\n/s0\nD 1 -s\nf\n\nD. Composite lens and Principal Planes\n\nE. Typical function of composite lens, and corresponding matrix elements\n\nso\nsi\n(c) Pearson Prentice Hall. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see http://ocw.mit.edu/fairuse.\n\nReview on Geometrical Optics (02/26/14)\n2.71/2.710 Introduction to Optics -Nick Fang\n\nobject\nFFP\nBFP\nimage\n1st PP\n2nd PP\nEFL\nEFL\nI\nC'\nC\nO\nso\nsi\nhi\nho\n\nReview on Geometrical Optics (02/26/14)\n2.71/2.710 Introduction to Optics -Nick Fang\n\nNote: when prisms and mirrors are used in the optical train, consider \"unfold\" the optical\naxis first!\n\n(c) Pearson Prentice Hall. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see http://ocw.mit.edu/fairuse.\n\nReview on Geometrical Optics (02/26/14)\n2.71/2.710 Introduction to Optics -Nick Fang\n\nExample 1: Two identical, thin, plano-convex lenses with radii of curvature of 15cm are\nsituated with their curved surfaces in contact at their centers. The intervening space is\nfilled with oil, of refractive index n=1.65. The index of the glass is n=1.50. Determine the\nfocal length of the combination.\n\nExample 2: A Retrofocus Lens. For an object placed at infinity, we need to design a\ncomposite lens system with the following specifications:\n\n-\nThe spacing from the front lens to the rear lens is 120 mm.\n-\nThe working distance (from the rear lens to image plane) is 100 mm.\n-\nThe effective focal length (EFL) is 60mm.\n\na) Assuming all elements are thin lenses, determine the focal length of each\nindividual lens.\n\nb) Locate the principal planes of the lens system.\n\nc) The aperture stop (A. S.) of this system is located at the rear lens. In order for\nthe system to operate at Numerical Aperture =1/8, what should be the diameter\nof the aperture?\nA. S.\nImage plane\nBFL=100 mm\nd=120 mm\nL1\nL2\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n2SWLFV\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Optics, Lecture 9",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-71-optics-spring-2014/e6cfb73b15ef5b0610fe662794eb3205_MIT2_71S14_lec9_notes.pdf",
      "content": "Lecture Notes on Wave Optics (03/05/14)\n2.71/2.710 Introduction to Optics -Nick Fang\n\nOutline:\nA. Electromagnetism\nB. Frequency Domain (Fourier transform)\nC. EM waves in Cartesian coordinates\nD. Energy Flow and Poynting Vector\nE. Connection to geometrical optics\nF. Eikonal Equations: Path of Light in an Inhomogeneous Medium\n\nA. Electromagnetism and Maxwell Equations, Differential Forms:\n\n-\nIn real space, time-dependent fields:\n\n(Coulomb's Law, electric field)\n\n(1)\n\n(2)\n(Gauss' Law, magnetic field)\n\nD (displacement field)\ndS\nD\n+\nA\nV\ndS\nCoulomb\nB\nA\nV\nthere are no\nmagnetic\ncharges\ndS\n\nLecture Notes on Wave Optics (03/05/14)\n2.71/2.710 Introduction to Optics -Nick Fang\n\n(3)\n(Faraday's Law)\n\n(4)\n(Ampere-Maxwell's Law)\n\nNote: J, q are sources of EM radiation and E, D, H, B are induced fields.\n\nB. From time domain to frequency domain (Fourier Transform):\n\nContinuous wave laser light field understudy are often mono-chromatic. These\nproblems are mapped in the Maxwell equations by expanding complex time\nsignals to a series of time harmonic components (often referred to as \"single\"\nwavelength light):\ne.g.\n\nE (r , t) ∫\nE (r , ω)exp(-iωt)dω\ninf\n-inf\n\n(5)\nAdvantage:\n\n∂\n∂tE (r , t) ∫\nE (r , ω) ∂\n∂texp(-iωt)dω\ninf\n-inf\n∫\n[-iωE (r , ω)]exp(-iωt)dω\ninf\n-inf\n(6)\n\nB(t) up or down\ndl\nE\nC\nA\nE -\nt\ndl\nH\nI\nC\nA\ncurrent\ncapacitor\ndl\nH\nA\nC\nD\n\nt\n\nLecture Notes on Wave Optics (03/05/14)\n2.71/2.710 Introduction to Optics -Nick Fang\n\nSo, we can replace all time derivatives\n∂\n∂t by -iω in frequency domain:\n(Faraday's Law:)\n\n(7)\n(Ampere-Maxwell's Law:)\n\n(8)\n\nThe other two equations remain unaltered.\n\nThere are total of 12 unknowns (E, H, D, B) but so far we only obtained 8 equations\nfrom the Maxwell equations (2 vector form x3 + 2 scalar forms) so more information\nneeded to understand the complete wave behavior!\n\nGenerally we may start to construct the response of a material by applying a\nexcitation field E or H in vacuum. Therefore it is more typical to consider the E, H\nfield as input and D, B fields as output. In common optical materials, we may enjoy\nthe following simplification of local (i.e. independent of neighbors) and linear\nrelationship:\nD (ω) ε(ω)ε0E (ω)\n\n(9)\nB (ω) μ(ω)μ0H (ω)\n\n(10)\n\nThe so called (electric) permittivity ε(ω) and (magnetic) permeability μ(ω)are\nunitless parameters that depend on the frequency of the input field. In the case of\nanisotropic medium, both ε(ω) and μ(ω)become 3x3 dimension tensor.\n\nNow we have 6 more equations from material response, we can include them\ntogether with Maxwell equations to obtain a complete solution of optical fields with\nproper boundary condition.\n\nC. Maxwell's Equations in Cartesian Coordinates:\n\nTo solve Maxwell equations in Cartesian coordinates, we need to practice on the\nvector operators accordingly. Most unfamiliar one is probably the curl of a vector A .\nIn Cartesian coordinates it is often written as a matrix determinant:\n\nLecture Notes on Wave Optics (03/05/14)\n2.71/2.710 Introduction to Optics -Nick Fang\n\n∇ A |\nx\ny\nz\n∂\n∂x\n∂\n∂y\n∂\n∂z\nAx\nAy\nAz\n|\n\n(11)\n\nIn this fashion, we may write the Faraday's law in frequency domain,\n, with 3 components in Cartesian coordinates:\n(\n∂Ez\n∂y-\n∂Ey\n∂z) iω x\n\n(12)\n(\n∂Ez\n∂x-\n∂Ex\n∂z) iω y\n\n(13)\n(\n∂Ey\n∂x-\n∂Ex\n∂y) iω z\n\n(14)\n\nLikewise, we arrive at the rest of Maxwell's equations:\n(\n∂Hz\n∂y-\n∂Hy\n∂z) -iω x\n\n(15)\n(\n∂Hz\n∂x-\n∂Hx\n∂z) -iω y\n\n(16)\n(\n∂Hy\n∂x-\n∂Hx\n∂y) -iω z\n\n(17)\ntogether with\n∂\n∂x x\n∂\n∂y y\n∂\n∂z z\n\n(18)\nAnd\n\n∂\n∂x x\n∂\n∂y y\n∂\n∂z z\n\n(19)\n\n-\nExample: Plane EM wave in 1-D homogeneous medium (e.g. an expanded\nlaser beam in +z direction,\n∂\n∂x 0,\n∂\n∂y 0)\nWe can now further simplify from the above equations in Cartesian coordinates:\n(\n∂Ez\n∂y-\n∂Ey\n∂z) iω x\n\n(20)\n(\n∂Ez\n∂x-\n∂Ex\n∂z) iω y\n\n(21)\nAnd\n(\n∂Hz\n∂y-\n∂Hy\n∂z) -iω x\n\n(22)\n(\n∂Hz\n∂x-\n∂Hx\n∂z) -iω y\n\n(23)\n\nFrom the above we found only 4 non-trivial equations. In the isotropic case, they can\nbe further divided into 2 independent sub-groups (two Polarizations!):\n\nLecture Notes on Wave Optics (03/05/14)\n2.71/2.710 Introduction to Optics -Nick Fang\n\n(Ex, Hy only)\niωμμ0 y -\n∂\n∂zEx\n\n(24)\nand iωεε0Ez\n∂\n∂z y\n\n(25)\n\nOr\n(Ey, Hx only)\niωμμ0 x -\n∂\n∂zEy\n\n(26)\n\nAnd\niωεε0Ey\n∂\n∂z x\n\n(27)\n\nObservations:\n-\nWe see that wave propagation in such medium is purely transverse, i.e. only\ncomponents of E, H field that are orthogonal to propagation direction (+z)\nsurvived in the wave field.\n-\nTaking the derivative\n∂\n∂z again on any of these equations, we obtain wave\nequation such as:\n∂2\n∂z2 Ex -iωμμ0\n∂\n∂z y -iωμμ0(iωεε0)Ex\n(28)\n∂2\n∂z2 Ex (ω2μ0ε0)εμEx (\nεμω2\nc02 ) Ex\n\n(29)\n\nsince the speed of light c0 in vacuum satisfy ( c0\nε0μ0)\nTherefore the index of refraction is found as:\nn(ω) √ε(ω)μ(ω)\n\n(30)\n\nD. The Poynting Vector\nThe Poynting vector, S ε0c0\n2E , is used to power per unit area in the direction of\npropagation.\n\nLecture Notes on Wave Optics (03/05/14)\n2.71/2.710 Introduction to Optics -Nick Fang\n\no Justification:\n\nEnergy passing through area A in time t:\n\nSo the energy per unit time per unit area:\n\n-\nThe Irradiance (often called the Intensity)\nVisible light wave oscillates in 1014-1015Hz. Since we don't have a detector that\nresponds in such a high speed yet, for convenience we take the average power per\nunit area, as the irradiance.\n\nSubstituting a sinusoidal light wave into the expression for the Poynting vector\nyields\n〈S 〉 ε0c0\n2〈E 〉\n2 ε0c0\n2E0 0\n\n(31)\n\nE. High Frequency Limit, connection to Geometric Optics:\n\nHow can we obtain Geometric optics picture\nsuch as ray tracing from wave equations? Now\nlet's go back to real space and frequency\ndomain (in an isotropic medium but with\nspatially varying permittivity ε(x, z), for\nexample).\n∂2\n∂x2 Ex\n∂2\n∂z2 Ex ε(x, z) (\nω2\nc02) Ex (32)\nNow we decompose the field E(r, ) into two\nforms: a fast oscillating component exp(ik0),\nk0 ω/c0 and a slowly varying envelope E0(r)\nas illustrated in the textbox.\n\nA\nc t\nU = Energy density\n\nLecture Notes on Wave Optics (03/05/14)\n2.71/2.710 Introduction to Optics -Nick Fang\n\nWith this tentative solution, we can rewrite the wave equation:\n∂\n∂xEx (\n∂\n∂xE0(x, z)) exp(ikΦ(x, z)) E0(x, z) [\n∂\n∂xexp(ikΦ(x, z))]\n\n(33)\n∂\n∂xEx (\n∂\n∂xE0(x, z)) exp(ikΦ(x, z)) E0(x, z) [ik\n∂Φ(x,z)\n∂x\n] exp(ikΦ(x, z))\n(34)\n∂\n∂xEx [\n∂\n∂xE0(x, z) ikE0(x, z)\n∂Φ(x,z)\n∂x\n] exp(ikΦ(x, z))\n\n(35)\n∂2\n∂x2 Ex [\n∂2\n∂x2 E0(x, z) ikE0(x, z) ∂2\n∂x2 Φ(x, z) 2ik\n∂\n∂xE0(x, z) ∂\n∂xΦ(x, z) -\nk2E0(x, z) (\n∂\n∂xΦ(x, z))\n] exp(ikΦ(x, z))\n\n(36)\nSimilarly you can find the derivative along the z direction. So our wave equation becomes:\nk2 [ε(x, z) -(\n∂\n∂xΦ(x, z))\n-(\n∂\n∂zΦ(x, z))\n] E0(x, z)\n[\n∂2\n∂x2 E0(x, z)\n∂2\n∂z2 E0(x, z)] 2ik[\n∂\n∂xE0(x, z) ∂\n∂xΦ(x, z)\n∂\n∂zE0(x, z) ∂\n∂zΦ(x, z)]\nikE0(x, z) [\n∂2\n∂x2 Φ(x, z)\n∂2\n∂z2 Φ(x, z)]\n\n(37)\n\nFurthermore, if the envelope of field varies slowly with\nwavelength (e.g.\nk\n∂\n∂xE0 ≪1,\nk\n∂\n∂zE0 ≪1) then only\nthe first term is important.\n(\n∂Φ\n∂x)\n(\n∂Φ\n∂z)\nε(x, z) n2(x, z)\n(38)\nThis is the well-known Eikonal equation, Φ being the\neikonal (derived from a Greek word, meaning image).\n\nGeometrical relationship\nof E, H, and ∇Φ\n∇Φ\nE0\nH0\n\nLecture Notes on Wave Optics (03/05/14)\n2.71/2.710 Introduction to Optics -Nick Fang\n\nF. Path of Light in an Inhomogeneous Medium\n\nA.\nExample 1: 1D problems (Gradient index waveguides, Mirage Effects)\n\nThe best known example of this kind is probably the Mirage effect in desert or\nnear a seashore, and we heard of the explanation such as the refractive index\nincreases with density (and hence decreases with temperature at a given altitude).\nWith the picture in mind, now can we predict more accurately the ray path and\nimage forming processes?\n\nStarting from the Eikonal equation and we assume n2(x, z) is only a function of x,\nthen we find:\n\n(\n∂Φ\n∂x)\n(\n∂Φ\n∂z)\nn2(x)\n\n(39)\n\nSince there is the index in independent of z, we may assume the slope of phase\nchange in z direction is linear:\n\n(\n∂Φ\n∂z)= C(const)\n\n(40)\n\nThis allows us to find\n∂Φ\n∂x √n2(x) -C2\n\n(41)\n\nFrom Fermat's principle, we can visualize that direction of rays follow the gradient of\nphase front:\n\nn\ndr\ndl ∇Φ\n\n(42)\n\nImage of Mirage effect removed due to copyright restrictions.\n\nLecture Notes on Wave Optics (03/05/14)\n2.71/2.710 Introduction to Optics -Nick Fang\n\nz-direction:\n\nn(x)\ndz\ndl C\n\n(43)\n\nx-direction:\n\nn(x)\ndx\ndl √n2(x) -C2\n\n(44)\n\nTherefore, the light path (x, z) is determined by:\ndz\ndx\nC\n√n2(x)-C2\n\n(45)\n\nHence\nz-z0 ∫\nC\n√n2(x)-C2 dx\nx\nx0\n\n(46)\n\nWithout loss of generality, we may assume a quadratic index profile along the x\ndirection, such as found in gradient index optical fibers or rods:\n\nn2(x) n0\n2(1 -αx2)\n\n(47)\n\nz-z0 ∫\nC\n√n\n2(1-αx2)-C2 dx\nx\nx0\n\n(48)\n\nTo find the integral explicitly we may take the following transformation of the\nvariable x:\n\nx √\nn02-C2\nn02αsinθ\n\n(49)\nTherefore,\n\nz-z0 ∫\nC\nn0√αdθ\nθ\nθ0\n\n(50)\n\nz z0\nC\nn0√α(θ-θ0)\n\n(51)\n\nOr more commonly,\nx√\nn02α\nn02-C2 sinθ sin(θ0 √n02α\nC2 (z-z0))\n\n(52)\n\nAs you can see in this example, ray propagation in the gradient index waveguide follows a\nsinusoid pattern! The periodicity is determined by a constant\n2πC\nn0√α.\n\nLecture Notes on Wave Optics (03/05/14)\n2.71/2.710 Introduction to Optics -Nick Fang\n\nObservation: the constant C is related to the original \"launching\" angle of the\noptical ray. To check that we start by:\n\ndz\ndx|\nx=x0\n\nC\n√n2(x0)-C2\n\n(53)\nIf we assume C=n(x0)cosβ, then\ndz\ndx|\nx=x0\n\ncosβ\nsinβ cotβ\n\n(54)\n\nB. Other popular examples: Luneberg Lens\nThe Luneberg lens is inhomogeneous sphere that brings a collimated beam of light to a\nfocal point at the rear surface of the sphere. For a sphere of radius R with the origin at\nthe center, the gradient index function can be written as:\n\nn(r) {n0√2 -\nr2\nR2 ,\nr≤R\nn0\nr> R\n\n(55)\nSuch lens was mathemateically conceived during the 2nd world war by R. K. Luneberg,\n(see: R. K. Luneberg, Mathematical Theory of Optics (Brown University, Providence,\nRhode Island, 1944), pp. 189-213.) The applications of such Luneberg lens was quickly\ndemonstrated in microwave frequencies, and later for optical communications as well\nas in acoustics. Recently, such device gained new interests in in phased array\ncommunications, in illumination systems, as well as concentrators in solar energy\nharvesting and in imaging objectives.\n\nx\nz\nIndex of\nrefraction\nn(x)\ndz\ndx\n\nLecture Notes on Wave Optics (03/05/14)\n2.71/2.710 Introduction to Optics -Nick Fang\n\nLeft: Picture of an Optical Luneberg Lens (a glass ball 60 mm in diameter) used as\nspherical retro-reflector on Meteor-3M spacecraft. (Nasa.gov)\nRight: Ray Schematics of Luneberg Lens with a radially varying index of refraction. All\nparallel rays (red solid curves) coming from the left-hand side of the Luneberg lens will\nfocus to a point on the edge of the sphere.\n\nImage of Luneberg lens removed\ndue to copyright restrictions.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n2SWLFV\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Optics, Lecture 10",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-71-optics-spring-2014/13134562742a242caad5fd92fcb27dfa_MIT2_71S14_lec10_notes.pdf",
      "content": "03/11/13, Eikonal Equations, Superposition of EM Waves\nLecture Note (Nick Fang)\nOutline:\n‐\nConnection of EM wave to geometric optics\n‐\nPath of Ligh\n\nt in an Inhomogeneous Medium\n‐\nSuperposition of waves, coherence\nA. High\nHow can we obtain Geometric optics picture\nFrequency Limit, connection to Geometric Optics:\n\nsuch as ray tracing fro\ndomain (in\nlet's go back to real sp\nan isotropic\nace and\nm wave equations? No\nfrequency\nw\nspatially varying permittivity ߝ\nmedium but with\nexample).\nሺݔ, ݖሻ, for\n\nݔ\nଶ\nଶܧ௫ଶ\nݖଶܧ௫ߝሺݔ, ݖሻቆଶ\n\nଶቇܧ௫ൌ0\nTo see the connection to geometric optics, we\ndecompose the field E(r, ) into two forms: a\nfast oscillat\nkൌ/ and a slowly varying envelope\ning component exp(ik0),\nE0(r) as illustrated in the textbox.\nFurthermore, if the envelope of field varies slowly\n\nwith wavelength (e.g.\nଵ\n\nడ\nడ௫ܧ≪1,\nଵ\n\nడ\nడ௭ܧ≪1)\nthen we can convert wave equations to the well‐\nknown Eikonal equation:\nቀ\nడ\nడ௫ቁ\nଶ\nቀ\nడ\nడ௭\nObservatio\nቁ\nଶ\nൌߝሺݔ, ݖሻൌଶ\nn (not proof):\nሺݔ, ݖሻ\n\nThe above equation yields: |Φ|ଶൌଶ, or |Φ| ൌ.\nThis is equivalent to the Fermat's Principle on optical path length (OPL):\nܮൌන|Φ|ൌන.\n\nExample of decomposition of E\nfield into the product of slowly\nvarying envelope and a fast\noscillating phase exp(ikΦሻ\nE0(r)\nSlowly varying envelope\nE=E0 (rԦ)exp(ik0)\n\nGeometrical relationship\nof E, H, and Φ\nΦ\nE0\nH0\n\nSuch process requires the direction of the light path\nሬሬሬԦ\nof phase contour Φ (a vector). We will use it to determine\n, follows exactly the gradient\ngeneral inhomogeneous medium.\nthe path of light in a\nB. Path of Light in an Inhomogeneous Medium\n\n‐\nThe\n\nbest\nExample\nknown examp\n1: 1D probl\nle of\nem\nthis\ns (Gradient index waveguide\n\nnear a seashore, and we heard of\nkind\nthe e\nis\nxplanati\nprobably\non\nthe\nsuch\nMirag\ns, Mirage\ne effect\nEffe\nin dese\ncts)\nas the refractive ind\nrt\nincrea\nex\nor\nses w\nimage for\nWith the p\nm\nict\nith en\ning\nure\nd\nin\nsit\nmin\ny (\nprocesse\nd\na\n,\nn\nn\nd\no\nhenc\nw can\ne\ns?\nwe\ndecr\np\neas\nredi\ne\nct\ns with temper\nmore accura\na\nt\ntur\nely t\ne a\nh\nt\ne\na g\nray\niv\npath and\nen altitude).\n\nStarting fro\nthen we find\nm the Eikonal\n\n:\nequation and we assume ଶሺݔ, ݖሻ is only a function o\n\nf x,\n൬Φ\nݔ൰\nଶ\n൬Φ\nݖ൰\nଶ\nൌଶሺݔሻ\n\nSince there is the index in independent of z, we may assume the slope of phase\nchange in z direction is linear:\n\nቀ\nడ\nడ௭ቁ=\nThis allows us to find\nC(const)\n\nΦ\nݔൌඥଶሺݔሻെܥଶ\n\nImage of Mirage effect removed due to copyright restrictions.\n\nFrom Fermat's princ\nphase front:\niple, we can visualize that direction of rays follow the gradient of\n\nݎԦ\nൌΦ\n\nz‐direction:\n\nሺݔሻ\nௗ௭\nௗൌC\n\nx‐direction:\n\nሺݔሻ\nௗ௫\nௗൌට2ሺݔሻെܥ2\n\nTherefore, the light path (x, z) is determined by:\nݖ\nݔൌ\nC\nඥଶሺݔሻെܥଶ\n\nHence\nݖെݖൌන\nC\nඥଶሺݔሻെܥଶݔ\n௫బ\n\nWithout loss of generality, we may assume a quadratic index profile along the x\ndirection, such as found in gradient index optical fibers or rods:\n\nଶሺݔሻൌ\nଶሺ1 െߙݔଶ\n\nሻ\nݖെݖൌන\nC\nඥ0\n2ሺ1 െߙݔଶሻെܥଶ\n௫బ\nݔ\nTo find the\nvariable x:\nintegral explicitly we may tak\n\ne the following transformation of the\n\nݔൌඨ\nଶെܥଶ\n\nଶߙ\nݏߠ\nTherefore,\n\nݖെݖൌන\nC\n√ߙߠ\nఏ\nఏబ\n\nݖൌݖ\nC\n√ߙ\nሺߠെߠሻ\n\nOr more commonly,\n\nݔඨ\n\nଶߙ\n\nଶെܥଶൌݏߠൌݏቌߠඨ\nଶߙ\nܥଶሺݖെݖሻቍ\n\nAs you can see in this example, ray propagation in the gradient index waveguide follows a\nsinusoid pattern! The periodicity is determined by a constant\nଶగ\nబ√ఈ\n\n.\nObserv\n\nation:\n\nthe constant C\n\nis rela\n\noptical ray. To check that we start by\nted\n:\nt\nle\n\no the original \"launching\" ang\nof the\nݖ\nݔฬ\n௫ୀ௫బ\nൌ\nC\nඥଶሺݔሻെܥଶ\nIf we assume C=ሺݔሻݏߚ, then\nݖ\nݔฬ\n௫ୀ௫బ\nൌcosβ\nݏߚ\n\n‐\nOther\nfocal point\nThe Luneberg lens is\npopul\nat the r\nar examples\near s\nin\nu\nh\n:\nrface\nomogeneous sphere t\nLuneberg\nthe cent\nh\nof th\nLens\nൌݐߚ\ne sphere. For a sphere of\nhat brings a collimated beam of light to a\n\ner, t e gradient index function can be written as:\nradius R with the origin at\nሺݎሻൌ൞ඨ2 െݎ\n\nଶ\nଶ,\nݎ\n\nݎ\n\nx\nz\nInd\nrefr\ne\naction\nx of\nnሺxሻ\ndz\ndx\n\nSuch lens was mathemateically con\n(see: R. K. Luneberg, Mathematical Theory of Optics (Brown Univ\nceived during the 2nd world wa\nersity, Providence,\nr by R. K. Luneberg,\nRhode Island, 1944), pp. 189‐213.) The applications of such Lun\nas in acoustics. Recentl\ndemonstrated in microwave frequencies, and later for optical co\neberg lens was quickly\ny, such device gained new interests in in phase\nmmunications as well\ncommunications, in illumination s\nd array\n\nharvesting and in imaging objectiv\nystems, as well as concentrato\nes.\nrs in solar energy\nLeft:\nRight:\nPicture of an Optical Luneberg\n\nLens (a glass ball 60 mm in dia\n\nspherical retro‐reflector on Meteor‐3M\nRay Schematics of Luneberg Lens w\nspacecraft. (Nasa.\nparallel ray\nith a radially varying index o\ngov)\nmeter) used as\ns (red solid curves) coming from the left‐hand side of the Luneberg lens will\nf refraction. All\nfocus to a point on th\n\nC. Superposition of Waves\ne edg\n\ne of the sphere.\n\n‐\nFor example, the elec\n\nWaves in complex numbers\ntric fi\n\neld of light field can be expressed as:\n\nSince\nܧሺݖ, ݐሻൌܣݏሺݖെݐሻ\nexpሺݔሻൌc\n\nosሺݔሻsinሺݔሻ\n\nܧሺݖ, ݐሻൌሼܣݔሾሺݖെ\n\nݐሻሿሽ\nOr\n\nܧሺݖ, ݐሻൌ1\n‐\nComplex numbers simply\nሼܣݔ\n\nሾ\noptics!\nሺݖെ\n\nݐሻሿሽ. . ሺݔ ݑݐሻ\n\n‐\nCoherence\n\nImage of Luneberg lens removed\ndue to copyright restrictions.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n2SWLFV\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Optics, Lecture 11",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-71-optics-spring-2014/9f1cabaaa8aca1b730d3c329ad63658d_MIT2_71S14_lec11_notes.pdf",
      "content": "Lecture Notes on Wave Optics (03/12/14)\n2.71/2.710 Introduction to Optics -Nick Fang\n\nOutline:\nA. Superposition of waves, Interference\nB. Interferometry\n- Amplitude-splitting (e.g. Michelson interferometry)\n- Wavefront-splitting (e.g. Young's Double Slits)\nC. More Interferometry: Fabry Perot, etc\n\nA. Superposition of Waves, Interference\n\nThe nature of linear wave equation guarantees that waves can be superimposed:\nwe may combine an array of waves by algebra, as far as each of them are proper\nsolution of the wave equation. To facilitate this process, we make use of the\nfollowing complex number to represent the wave field.\n\n-\nWaves in complex numbers\nFor example, the electric field of a monochromatic light field can be\nexpressed as:\n\nE(z, t) = Acos(kz-ωt+ φ)\n\n(1)\n\nSince exp(ix) = cos(x) + isin(x)\n\n(2)\n\nE(z, t) = Re{Aexp[i(kz-ωt+ φ)]}\n\n(3)\n\nOr\n\nE(z, t) =\n2 {Aexp[i(kz-ωt+ φ)]} + c. c. (complex conjugate)\n(4)\n\n- Complex numbers simplify optics! Interference with two beams\ne.g.\n2 plane waves propagating in +z direction\n\nE1x= E1x(0)exp[i(k1z-ω1t+ φ1)]\n\n(5)\nE2x= E2x(0)exp[i(k2z-ω2t+ φ2)]\n\n(6)\n\nWe can define phase of each waves:\nδ1(z, t) = k1z-ω1t+ φ1\n\n(7)\n\nδ2(z, t) = k2z-ω2t+ φ2\n\n(8)\n\nFor a point P located at z=z0 the combined field is:\nEx= E1x+ E2x= E1x(0) exp[iδ1(z0, t)] + E2x(0) exp[iδ2(z0, t)]\n(9)\n\nLecture Notes on Wave Optics (03/12/14)\n2.71/2.710 Introduction to Optics -Nick Fang\n\nB. Interferometry\nWe often use optical interferometers to facilitate the study of interference. A few\ncommon setups are discussed here. Based on the operation principle to split the\nbeams, we may find the so-called amplitude-splitting or wavefront-splitting devices.\n\n-\nMichelson Interferometry\n\nThe Michelson Interferometer is\nnamed after Albert Michelson, who\nused it with Edward Morley in 1887,\nin an attempt to measure the\nexistence of the \"ether\".\n\nIn Michelson- Morley's famous experiment, the delay time ∆τ is achieved simply by\nmoving a mirror along the optical axis. Moving a mirror backward by a distance L\nyields a delay of:\n\n∆τ=\n2L\nc\n\n(10)\n(e.g. 300 μm of mirror displacement yields a delay of 2 × 10-12s=2ps).\n\nA Michelson Interferometer as shown in left\nschematic, split a beam of incident light into\ntwo arms using a thin glass window. Both\nbeams travel to mirrors that are precisely\naligned to reflect them. Before recombining\nthem at the beam splitter, the two beams\ntraveled with different optical path length L1\nand L2.\n\nI= 2I0 + 2I0 〈cos (2ω\nL1-L2\nc\n)〉\n\n(11)\n\nThe variation of intensity as a function of the\npath length L1 gives us a measure of wavelength of light! Recent effort is to apply such\ntechnology in measurement of gravity waves.\n\nObservation:\n\n-\nMichelson Interferometer measures (auto)-correlation in time.\n\nTo see this effect, we suppose the input light beam is not monochromatic.\nThus\nI=\nc\n2 ε〈Ex∙Ex\n∗〉=\nc\n2 ε〈(E1x+ E1x(t-τ)) ∙(E1x\n∗+ E1x\n∗(t-τ))〉\n\n(12)\n\nBeam-\nsplitter\nInput\nbeam\nDelay\nMirror\nMirror\nL1\nL2\nOutput\nbeam\nI0 I0\nTranslation stage\nInput\nbeam E(t)\nE(t-t)\nMirror\nOutput\nbeam\n\nLecture Notes on Wave Optics (03/12/14)\n2.71/2.710 Introduction to Optics -Nick Fang\n\nI= I1(t) + I1(t-τ) + 2〈E1x∙E1x\n∗(t-τ)〉\n\n(13)\n\nSuch auto-correlation function tells the similarity of the field over given\nperiod of time. The Fourier transform of the auto-correlated signal yields the\nPower Spectrum:\n\n∫\nE1x∙E1x\n∗(t-τ)dt\ninf\nFT\n⇒ E1x(ω) ∙E1x\n∗(ω) = |E1x(ω)|2\n\n(14)\nThis is how Fourier Transform Spectroscopy (often abbreviated as FTIR) are\nconstructed nowadays. (See Pedrotti 21-2 for more discussion)\n\n-\nIn the above analysis we assumed the input beams\nare ideal plane waves so we only focused on\nintensity variation of a single spot as the arm length\nchanges. In reality, a set of nested rings are often\nobserved on the receiving screen as the pattern on\nright. This is due to the variation of phase as a\nfunction of momentum difference (k1 -k2)z.\n\n-\nYoung's Double Slit Interferometry\n\nTo analyze Young's experiment,\nwe assume the screen X with\ntwo narrow slit is illuminated\nwith a monochromatic plane\nwave. After the slits, two\ncylindrical waves are excited.\nThis creates fringes at the\nobservation plane X' , after\ntravelling a distance z= l.\n\nFor a position x' on the screen,\nthe phase difference of the two waves becomes:\nInterferogram\nThis interferogram is\nvery narrow, so the\nspectrum\nis very broad.\n4000 3200 2400 1600 800\nincoming\nplane wave\n(on-axis)\nopaque\nscreen\nz =l\nx=x0\nx=-x0\nobservation\npoint x'\nZ\nX'\nX\n(c) Source unknown. All rights reserved.\nThis content is excluded from our Creative\nCommons license. For more information,\nsee http://ocw.mit.edu/fairuse.\n(c) Source unknown. All rights reserved.\nThis content is excluded from our Creative\nCommons license. For more information,\nsee http://ocw.mit.edu/fairuse.\n\nLecture Notes on Wave Optics (03/12/14)\n2.71/2.710 Introduction to Optics -Nick Fang\n\nδ1 -δ2 = k(r1 -r2) + (φ1 -φ2)\n\n(15)\n\nwhere r1 = √(x′ -x0)2 + l2, r2 = √(x′ + x0)2 + l2. When the slits are arranged\nsymmetrically and the incoming plane wave is at normal incidence, then φ1 -φ2 =\n\nIn a typical experiment the screen is placed far away from the slits (l≫x0) so we\ncan further take approximation:\nr1 = l√1 +\n(x′-x0)\nl2\n≈l(1 +\n(x′-x0)\n2l2\n)\n\n(16)\n\nr2 = l√1 +\n(x′+x0)\nl2\n≈l(1 +\n(x′+x0)\n2l2\n)\n\n(17)\n(r1 -r2) = -\n2x′x0\nl\n\n(18)\nIn order for the constructive interference to occur, cos(δ1 -δ2) = 1, then\nk(r1 -r2) = -k\n2x0x′\nl\n= 2mπ\n\n(19)\nm= 0, ±1, ±2, .... are called order number.\n\nThis gives rise to the famous condition:\n\n2x0x′ = mlλ\n\n(20)\n\nTherefore Young's experiments directly measured the wavelength of light (in 18\ncentury!)\n\nNote: Generally fringes will form by two or more beams crossing at an angle. To\nquantify that we can modify our phase term for the crossing beams:\n\nδ1(x, z, t) = k1xx+ k1zz-ω1t+ φ1\n\n(21)\nor in terms of incident angle θ:\nδ1(x, z, t) = k1xsinθ1 + k1zcosθ1 -ω1t+ φ1\n\n(22)\n\nδ1 -δ2 = (k1sinθ1 -k2sinθ2)x+ (k1cosθ1 -k2cosθ2)z+ (φ1 -φ2)\n(23)\n\nFringes can vary both on x and z directions!\n\n-\nNote: Young's double slit experiment measures the correlation in space.\nAssuming the input light beam is not a plane wave (i.e. inhomogeneous), at x'=0\nwe measure the interference:\nI=\nc\n2 ε〈Ex∙Ex\n∗〉=\nc\n2 ε〈(E1x(x-x0) + E1x(x+x0)) ∙(E1x\n∗(x-x0) + E1x\n∗(x+ x0))〉 (24)\n\nLecture Notes on Wave Optics (03/12/14)\n2.71/2.710 Introduction to Optics -Nick Fang\n\nI= I1(x-x0) + I1(x+ x0) + 2〈E1x(x-x0) ∙E1x\n∗(x+ x0)〉\n(25)\n\nSuch correlation function tells the similarity of the field over a given spatial\nperiod. This effect is often used to measure the coherence of a remote star\nunder the telescope, although the radiation is thought to be randomly\ndistributed. A daily life example is the spatial coherence of ripples in the pool\n(\"Spatial coherence from Ducks\" by Emil Wolf et al, Physics today 2010).\n\n-\nComparison between Michelson and Young's double slits:\nBoth can be regarded as interference of two spherical waves, but observed in\ndifferent directions.\n\n-\nOther wavefront splitting interferometry similar to Young's Double slits:\no Lloyd's Mirror\no Fresnel's biprism\no Fresnel's mirror\no Billet's split lens\n\nC. More examples of Interferometry\n\n-\nThin Film interference\n\nImage of wavefront splitting inferometry removed due to copyright restrictions.\n\nLecture Notes on Wave Optics (03/12/14)\n2.71/2.710 Introduction to Optics -Nick Fang\n\n-\nFabry-Perot Interferometry\nConsider two parallel reflective\nsurfaces separated by distance d,\nthe first one has a amplitude\ntransmission and reflection\ncoefficient t and r, and the\nsecond has amplitude\ntransmission and reflection\ncoefficient t' and r'. Multiple\nreflections between the two\nsurfaces results in two series of\nreflected and transmitted terms. Due to the round trip travel path, there is a phase\ndifference between successive transmitted terms:\nδ0 = (2kzd)\n\n(26)\nThe transmitted series is\nEt= exp (iδ0/2)(t′tE0 + t′(rr′)tE0 exp(iδ0) + t′(rr′)2tE0 exp(2iδ0) + ⋯)\n(27)\nEt= t′tE0exp (iδ0/2)[1 + (rr′) exp(iδ0) + (rr′)2 exp(2iδ0) + ⋯]\n(28)\nEt= t′tE0exp (iδ0/2) ∑\n(rr′)nexp(inδ0)\ninf\nn=0\n\n(29)\n\nEt=\nt′texp (iδ0/2)E0\n1-rr′ exp(iδ0)\n\n(30)\n\nThe transmitted irradiance is given by:\nIt=\nT′TI0\n|1-rr′ exp(iδ0)|2\n\n(31)\nThe denominator of the last result can be expressed as:\n|1 -rr′ exp(iδ0)|2 = (1 -rr′ exp(iδ0))(1 -r∗r′∗exp(-iδ0))\n= 1 -(rr′exp(iδ0) + r∗r′∗exp(-iδ0)) + RR′\n= 1 -2√RR′cos (δ) + RR′\n= (1 -√RR′)\n2 + 2√RR′(1 -cos(δ))\n= (1 -√RR′)\n2 + 4√RR′sin2 (\nδ\n2)\n\n(32)\n\nWhere δ= (2kzd) + φr+ φr′\n\n(33)\n\nWe define the coefficient of finesse F:\nr, t\nr', t'\nE0\ntE0\nrE0\nr'tE0\nt'tE0\ntr'tE0eid\nrr'tE0\nr'rr'tE0\ntr'(rr')tE0e2id\nt'rr'tE0eid\nt'(rr')2tE0e2id\n(rr')2tE0\nr'(rr')2tE0\n\nLecture Notes on Wave Optics (03/12/14)\n2.71/2.710 Introduction to Optics -Nick Fang\n\nF=\n4√RR′\n(1-√RR′)\n\n(34)\nTo express the general form of It:\nIt=\nT′TI0\n(1-√RR′)\n2 [\n1+Fsin2 (δ\n2)]\n\n(35)\n\nApplications: Fabry-Perot cavities are often designed to distinguish closely spaced\nspectral lines of a gas medium. Higher values of Finesse F give a sharper\ntransmission pass band and greater spectral resolution. To find the half-width of the\npass band, we solve:\n\n1+Fsin2 (δ\n2) =\n\n(36)\ngiving\nsin(\nδ1/2\n2 ) =\n√F\n\n(37)\n\nFigure 8.9 from Pedrotti: Transmittance of Fabry-Perot Cavity.\n\n(c) Pearson Prentice Hall. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see http://ocw.mit.edu/fairuse.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n2SWLFV\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Optics, Lecture 13",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-71-optics-spring-2014/ec1f3a7e694918d36cd70082cf9dcc6c_MIT2_71S14_lec13_notes.pdf",
      "content": "Lecture Notes on Wave Optics (03/19/14)\n2.71/2.710 Introduction to Optics -Nick Fang\n\nMathematical Preparation of Fourier Transform\n\n-\nFourier Transform in time domain\nA time signal f (t) can be expressed as a series of frequency components F():\n\nf(r, t) = ∫\nF(r, ω) exp(-iωt) dω\ninf\n-inf\n\nF(r, ω) = 1\n2π∫f(r, t) exp(+iωt) dt\ninf\n-inf\n\nThe functions f (t) and F() are referred to as Fourier Transform pairs.\n\n-\nFourier Transform in spatial domain\nA spatially varying signal f(x, y)can be expressed as a series of spatial-frequency\ncomponents F(kx, ky):\n\nf(x, y) =\n(2π)2 ∫\n∫\nF(kx, ky) exp(ikxx) exp(ikyy) dkxdky\ninf\n-inf\ninf\n-inf\n\nF(kx, ky) = ∫\n∫\nf(x, y) exp(-ikxx) exp(-ikyy) dxdy\ninf\n-inf\ninf\n-inf\n\nAccordingly, the functions f(x, y)and F(kx, ky)are referred to as spatial-Fourier\nTransform pairs.\n\n-\nA few famous functions\n\no Rectangle function\nrect(x) ≡\n{\n1,\n|x| <\n2 ,\n|x| =\n0,\n|x| >\n\no Sinc function\nsinc(x) = sin(πx)\nπx\n\nrect(x)\nx\n-.5 0 .5\n\nLecture Notes on Wave Optics (03/19/14)\n2.71/2.710 Introduction to Optics -Nick Fang\n\no Triangle Function\nΛ(x) ≡{1 -|x|,\n|x| < 1\n0,\n|x| ≥1\n\no Step function\nH(x) ≡{\n1,\nx> 0\n2 ,\nx= 0\n0,\nx< 0\n\no Comb function\ncomb(x) = ∑δ(x-n)\ninf\nn=-inf\n\nx\nsinc(x)\nzeros at x=\nnp (n = 0)\nx\n-1\nΛ(x)\nx\n\nLecture Notes on Wave Optics (03/19/14)\n2.71/2.710 Introduction to Optics -Nick Fang\n\n-\nInteresting properties of Fourier Transform:\n\no Scale theorem f(ax)\n\no Shift theoremf(x-a),\n\n(e.g. double slit)\n\no Complex Conjugate f∗(x)\n\no Derivative\nd\ndxf(x)\n\nf(x)\nF(kx)\nkx\nkx\nx\nx\nx\nkx\nt(x) = rect[(x+a)/w] + rect[(x-a)/w]\nx\na\n-a\nw\nw\nt(x)\n\nLecture Notes on Wave Optics (03/19/14)\n2.71/2.710 Introduction to Optics -Nick Fang\n\no Modulation f(x)cos(\n2π\nLx)\n\n-\nPractice problem: can you apply these theorems in (x, y) plane?\n\nAccordingly, the following functions f(x, y)and F(kx, ky)are referred to as spatial-\nFourier Transform pairs.\n\nFunctions\nFourier Transform Pairs\nrect(x\na)\n|a|sinc(akx\n2π)\nsinc(x\na)\n|a|rect(akx\n2π)\nΛ (x\na)\n|a|2sinc2 (akx\n2π)\ncomb (x\na)\n|a|comb(akx\n2π)\nGaussian exp(-\nx2\na2)\nexp(-a2\n4πkx\n2)\nStep function H(x)\nikx\n+ 1\n2 (δ(kx))\ncirc(√x2 + y2\na\n)\n|a|2\n2πJ1 (a√kx\n2 + ky\n2)\na√kx\n2 + ky\n\nkx\n-G0\nx\nf(x)cos(2π\nx)\nG0\nF(kx) δk- + δk+\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n2.71 / 2.710 Optics\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Optics, Lecture 14",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-71-optics-spring-2014/da64653098bef719b4537bb2d149c95d_MIT2_71S14_lec14_notes.pdf",
      "content": "Lecture Notes on Wave Optics (03/31/14)\n2.71/2.710 Introduction to Optics -Nick Fang\n\nOutline:\nA. General Diffraction Geometry\nB. Diffraction Using a Lens\nC. Diffraction Gratings\n\nA. General Diffraction Geometry\n\no Goal: What is the electric field E(x', y') measured at a distance z from the\nplane of the aperture?\n\nThe field is affected by 3 contributions:\n\na) The illumination source E(x, y)\nb) The transmission function through an aperture t(x, y)\nc) (Dipole or Huygens source) radiation at location (x, y), propagating to screen\n(x', y'): h(x'-x, y'-y, z)\n\nNote: The step c) is known as Huygens principle: every point along a wave-front\nemits a spherical wave that interferes with all others. Several scientists,\nincluding Kirchhoff, and Bethe-Boukamp (1946) attempted to quantify this idea\nbased on Maxwell Equations, but the strength and orientation of the source in\nmetallic holes at optical wavelength is now a hot topic under debate, since\nEbbesen's experiments in 1998.\n\nHere we take the simplest case of sphere waves:\nh(x′ -x, y′ -y, z) =\nexp(ikr)\nr\n\n(1)\nx\ny\nIncident\nwave-fronts\nE(x,y)\nx'\nAperture\ntransmission\nt(x,y)\ny'\nObservation\nplane\nE(x',y')\nz\nP'\nP\n\nLecture Notes on Wave Optics (03/31/14)\n2.71/2.710 Introduction to Optics -Nick Fang\n\nwhere r= √(x′ -x)2 + (y′ -y)2 + z2\n\n(2)\n\nThe resulting field is then a convolution of all the three factors:\n\nE(x′, y′) = ∫∫h(x′ -x, y′ -y, z)t(x, y)E(x, y)dxdy\n\n(3)\n\no Fraunhoffer diffraction: Far field (z>>x', y', x, y)\n\nr= √(x′ -x)2 + (y′ -y)2 + z2\n\nr≈z(1 +\n(x′-x)2+(y′-y)2\n2z2\n)\n\n(4)\n\nexp(ikr) ≈exp(ikz+ ik(x′ -x)2 + (y′ -y)2\n2z\n)\n\n≈exp(ikz)exp(-ik\nxx′+yy′\nz\n)exp(ik\nx′2+y′2+x2+y2\n2z\n)\n\n(5)\n\n(up to here, it is Fresnel condition for diffraction)\n\nNow if we further assume the quadratic terms are negligible:\n(Fraunhofer condition, difficult to achieve!)\n\nk(x′2+y′2)\n2z\n≪1,\nk(x2+y2)\n2z\n≪1\n\n(6)\n\nThen we have a set of plane waves (rays) launched at x, y:\nexp(-ik\nxx′+yy′\nz\n) ≈exp(-ik(θx′x+ θy′y))\n\n(7)\n\nθx′ ≈\nx′\nz, θy′ ≈\ny′\nz, or kx\n≈k\nx′\nz, ky≈k\ny′\nz\n\nE(x′, y′) ≈\nz∫∫exp(-ik(θx′x+ θy′y))t(x, y)E(x, y)dxdy\n(8)\nWhat we measure at the far field is a Fourier transform of t(x,y)E(x,y)!\n\nLecture Notes on Wave Optics (03/31/14)\n2.71/2.710 Introduction to Optics -Nick Fang\n\nPractice problem: Find the Fraunhofer diffraction pattern of a triangular aperture as\nshown in the following figure. The edges of the triangle are expressed at x=a, y=x, and\ny=-x, respectively. The screen is placed at z=z0.\n\nthe position x. So we\nmay integrate first along the y direction, and then along x-direction in the next.\n(c) Source unknown. All rights reserved\n\n. This content is\nexcluded from our Creative Commons license. For more\ninformation, see http://ocw.mit.edu/fairuse.\nHint: In this case, the aperture along the y direction depends on\n\nLecture Notes on Wave Optics (03/31/14)\n2.71/2.710 Introduction to Optics -Nick Fang\n\nB. Diffraction using a lens\n\nA lens introduces a phase delay\nproportional to its thickness h, at a given\npoint (x, y):\n\nt(x, y) = exp[ik(n-1)h(x, y)] (9)\n\nh(x, y) = √[R2 -(x2 + y2)] -d (10)\n\nIn the thin lens limit, we find:\n\nh(x, y) ≈R[1 -(x2 + y2)/2R2] -d\n\n(11)\n\nt(x, y) ≈exp{ik(n-1)[R-d-(x2 + y2)/2R]}\n\n(12)\n\nt(x, y) ≈exp[ik(n-1)(R-d)] × exp[-ik(n-1)(x2 + y2)/2R]\n(13)\n\nt(x, y) ≈exp[ik(n-1)(R-d)] × exp[-ik\n(x2+y2)\n2f\n]\n\n(14)\n\n1/f≡(n-1)/R\n∆≡(n-1)(R-d) →0 (thin lens)\n\nexp(ikr) t(x, y) ≈exp(ik(z+ ∆)) exp (-ikxx′ + yy′\nz\n)\nexp[ik(x2 + y2) (\n2z-\n2f)] exp[ik(\nx′2+y′2\n2z\n)]\n\n(15)\n\nThe quadratic term of x2 + y2 will vanish, provided that:\n\n2z-1\n2f= 0, orz= f\n\nYou can apply the same argument to the quadratic phase term of (x′2 + y′2) by\nplacing the screen at z=f away from the lens.\n\nWe'll see the Fourier Transform of E(x. y) (Fraunhofer diffraction) by placing the\naperture and a screen at the focal planes of a lens, even it is not far away!\nd\nR\nh(x, y)\n\nLecture Notes on Wave Optics (03/31/14)\n2.71/2.710 Introduction to Optics -Nick Fang\n\nor\n\nNote: This is consistent with our previous analysis based on ray optics. For a set of\ndiverging ray vectors (x, ) that emerge from the aperture at the front focal plane,\nthe lens converts the rays to a set of parallel beams. At the back focal plane, we\nmeasure a set of new ray vectors (x', '):\n\n(x′\nθ′) = [1\nf\n1] [\n-1/f\n1] [1\nf\n1] (x\nθ) = [\nf\n-1/f\n0] (x\nθ)\n\n(16)\n\nIn another word, geometric optics addresses the propagation (or optimal optical\npath length) from aperture stop to the screen appropriately. The effect of\ndiffraction is reduced to Huygens principle, or how the \"secondary\" field emerges\nright behind the aperture.\n\nC. Diffraction Gratings\n\nA diffraction grating is a slab with a periodic modulation of any sort on one of its\nsurfaces. The modulation can be in the form of transmission, reflection, or the phase\ndelay of a beam.\n\nFor example, let's begin with a sinusoidal modulation of the transmission\nfunction:\nt(x, y) = t0 + t1cos(\n2πx\nΛ )\n\n(17)\nthe Fraunhofer diffracted field is:\n\nE(x′, y′) ≈exp(ikz)\nz\n∫∫exp(-ikxx-ikyy))t(x, y)E(x, y)dxdy\n\n(18)\n\nz\nf\nF\nf\nA.S.\nScreen\nF\nA.S.\nf\nScreen\nf\nz\nincident\nplane\nwave\nΛ\n\nLecture Notes on Wave Optics (03/31/14)\n2.71/2.710 Introduction to Optics -Nick Fang\n\nWhat if the periodic modulation of the transmission is not sinusoidal, e.g. a\nsquare modulation?\n\nSince it's periodic, we can use a Fourier series for it (or consider a comb function in\nconvolution with the square windows):\n\nt(x) = ∑\ntmcos(\n2πmx\nΛ )\ninf\nm=0\n\n(19)\n\nAn order of a diffraction grating occurs if:\n\nkx= m\n2π\nΛ , or Λsin(θm) = mλ,\n\n(20)\nwhere m is an integer. The above equation assumed normal incidence.\n\n- Phase grating: In the case for phase grating, we may modulate the beams by\nvarying the phase delay of incident beam through a set of patterns on\ntransparent window.\n\nFor example, let's look at a binary grating with modulation of the\nphase function:\nt(x) = exp(ik(n-1)h(x))\n\n(21)\nh(x) = h× rect(\nx\nW) ⨂comb(\nx\nG) << λ\n\n(22)\n\nthe 1D Fraunhofer diffracted field is: (assuming E(x)=1)\n\nE(x′) ≈∫exp(-ikxx) t(x)dx\n(23)\n\nE(x′) ≈∫\nexp(-ikxx) [1 + ik(n-1)h(x)]dx\n(24)\n\nE(kx) ≈δ(kx) + ik(n-1) ∫\nexp(-ikxx) [h× rect(\nx\nW) ⨂comb(\nx\nG)] dx\n(25)\n\nE(x′) ≈δ(kx) + ik(n-1)h[Wsinc(Wkx)]comb(\nG\n2πkx)\n\n(26)\n\nG\nglass\nrefractive index n\nh\nincident\nplane\nwave\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n2SWLFV\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Optics, Lecture 16",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-71-optics-spring-2014/4b53a5747f9b58b9b73b2bbcc39945f0_MIT2_71S14_lec16_notes.pdf",
      "content": "Lecture Notes on Wave Optics (04/07/14)\n2.71/2.710 Introduction to Optics -Nick Fang\n\nOutline:\nA. Imaging with coherent light\nB. Optical Spatial Filtering\nC. The significance of PSF and ATF, and effect of coherence\nD. Phase Contrast Imaging: Zernike and Schlieren methods\n\nA. Imaging with Coherent Light\nRecap: a convex lens conduct Fourier Transform at the two focal planes:\n\nor\n\nThe two pictures above are interpretations of the same physical phenomenon.\nOn the left, the transparency is interpreted as a superposition of \"spherical\nwavelets.\"\nEach spherical wavelet is collimated by the lens and contributes to a plane wave at\nthe output, propagating at the appropriate angle (scaled by f.)\n\nOn the right, the transparency is interpreted in the Fourier sense as a superposition\nof plane waves (\"spatial frequencies.\") Each plane wave is transformed to a\nconverging spherical wave by the lens and contributes to the output, at distance f to\nthe right of the lens, a point image that carries all the energy that departed from the\ninput at the corresponding spatial frequency.\n\nFrom the front focal plane to the back focal plane:\n\nEout(x′, y′) ≈∫∫\nEin(x, y)exp {\n-ik[x′x+y′y]\nf\n} dxdy\n(1)\n\nWe see that: kx= x′\nk\nf, ky= y′\nk\nf or\n\nx′ = kx\nf\nk, y′ = ky\nf\nk\n\n(2)\n\nz\nf\nF\nf\nA.S.\nScreen\nF\nA.S.\nf\nScreen\nf\nz\n\nLecture Notes on Wave Optics (04/07/14)\n2.71/2.710 Introduction to Optics -Nick Fang\n\nBy cascading two lenses together, we can reveal Abbe's theory of imaging process:\n\nIdeally, applying two forward Fourier transforms recovers the original function of\nthe object field, with a reversal in the coordinates:\nEimage(x\", y\") ≈∫∫\nE(x′, y′)exp {\n-ik[x′x\"+y′y\"]\nf2\n} dx′dy′\n\n(3)\n\nUsing x′ = kx\nf1\nk, y′ = ky\nf1\nk\n\nEimage(x\", y\") ≈(\nf1\nk)\n∫∫\nE(x′, y′)exp {-i\nf1\nf2 [kxx\" + kyy\"]} dkxdky\n\n(4)\n\nLet -\nf1\nf2 x\" = x, -\nf1\nf2 y\" = y,\n\n(5)\n\nEimage(x\", y\") ∝F(F(Eobject(x, y))) = Eobject(-\nf2\nf1 x, -\nf2\nf1 y) (6)\nPotentially, the magnification ratio M= f2/f1can be arbitrarily large. This however\ndoes not mean that the microscope is able to resolve arbitrarily small objects. The\nfinite size of the aperture stop, and the corresponding transmission AS(x′, y′) will\ncontribute to the above Fourier transforms:\nAS(x′, y′) = AS(kx\nf1\nk, ky\nf1\nk)\n\n(7)\nplane\nwave\nillumination\nobject:\ndecomposed into\nHuygens wavelets\nimage\nplane\nplane\nwave\nillumination\nobject:\ndecomposed into\nspatial frequencies\nimage\nplane\nFourier (pupil)\nplane\ndiffraction order\ncomes to focus\n\nLecture Notes on Wave Optics (04/07/14)\n2.71/2.710 Introduction to Optics -Nick Fang\n\nEimage(x\", y\") ≈F(AS(kx\nf1\nk, ky\nf1\nk) × F(Eobject(x, y)))\n\nEimage(x\", y\") ≈Eobject(-\nf2\nf1 x, -\nf2\nf1 y) ⨂F[AS(kx\nf1\nk, ky\nf1\nk)]\n(8)\n\nNote: In Goodman's book, the termAS(kx\nf1\nk, ky\nf1\nk) is called Amplitude Transfer\nFunction(ATF), and its Fourier transform, F[AS(kx\nf1\nk, ky\nf1\nk)] is called Point Spread\nFunction(PSF) (since it is the spread of an ideal point source δ(x, y) at the image).\n\nWorked Examples:\n\n1) Rectangle apertures:\nATF= rect(\nf1kx\nak) rect(\nf1ky\nbk)\n\n(9)\n\nPSF(x\", y\") ≈(f1\nk)\n∫∫rect(f1\nakkx)rect(f1\nbkky)exp {-if1\nf2\n[kxx\" + kyy\"]} dkxdky\nPSF(x\", y\") ≈[asinc(ak\nf1\nx)] [bsinc(bk\nf1\ny)]\n=[asinc(-\nak\nf2 x\")] [bsinc(-\nbk\nf2 y\")]\n\n(10)\n\na/λf1\nb/λf1\nATF\nPSF\n\nLecture Notes on Wave Optics (04/07/14)\n2.71/2.710 Introduction to Optics -Nick Fang\n\n2) Circular apertures:\nATF= circ(\nf1\nRk√kx\n2 + ky\n2)\n\n(11)\n\nPSF(x\", y\") ≈(f1\nk)\n∫∫circ(f1\nRk√kx\n2 + ky\n2) exp {-if1\nf2\n[kxx\" + kyy\"]} dkxdky\n\nPSF(x\", y\") ≈a2Jinc(Rk\nf1\n√x2 + y2)=a2Jinc(Rk\nf2\n√x\"2 + y\"2)\n(12)\n\nB. Optical Spatial Filtering\n\nSpatial Filtering is a technique to process signals in an optical way, where the\nirradiance content in the Fraunhofer plane is manipulated to control the irradiance\npattern in the image plane. A digital element to provide Spatial Filtering in a\ndynamical way is coined as a spatial light modulator (SLM). SLM consists of an array\nof pixels, each capable of controlling the amplitude or phase of the illuminating field.\nFor example, liquid crystal SLMs control the amplitude and phase of the transmitted\nor reflected light. Likewise, TI's DLP SLM uses arrays of deformable micromirrors\nmade by MEMS technology to adjust the amplitude and phase of the reflected light.\n\nThe basic setup for optical spatial filtering is a telescopic lens system, consisting of\ntwo lenses. Quite often, we can assume that the two lenses have the same focal\n2R/λf1\nATF\nPSF\nExamples of spatial light modulators removed due to copyright restrictions.\n\nLecture Notes on Wave Optics (04/07/14)\n2.71/2.710 Introduction to Optics -Nick Fang\n\nlength f for simplicity. Then the distance from the object to the processed image is\n4f . For this reason such a system is called the 4-F setup for spatially filtering an\nimage.\n\nThe following examples are typical image processing setup using various types of\nspatial frequency filters:\n\n(a) Low pass filter: A circular aperture in the Fourier plane will block the high\nspatial frequencies and pass the low frequency ones. If the filter is an aperture\nof diameter a, the cutoff frequency is given by the condition:\nkcutoff=\nka\n2f1\n\n(13)\nThat is, features smaller than the length scale of 2λ\nf1\na is removed from the image.\n\n(b) High pass filter: A circular absorbing disk in the Fourier plane does the\nopposite to low pass filter. Features larger than the length scale of 2λ\nf1\na are\nremoved from the image. This filter is also called a dark field filter in the\nmicroscopy and used frequently in materials science, as it allows only light\nscattered from sharp edges (such as grain boundaries) to pass through the filter.\n\nLow pass\nfilter\nf1\nf1\nf2\nf2\nInput\nOutput\nScreen\nHigh pass\nfilter\nf1\nf1\nf2\nf2\nInput\nOutput\nScreen\n\nLecture Notes on Wave Optics (04/07/14)\n2.71/2.710 Introduction to Optics -Nick Fang\n\n(c) Step and Repeat operation\n\nC. The significance of PSF and ATF\n\nThe theory of optical imaging and communication has a lot in common. The above\nimaging process might be modeled with an equivalent circuit. (Such analogy has\nstimulated research and development for basic operation such as multiplication,\ndivision, differentiation, correlation, etc. The application of the optical processing\ncan be found in a variety of fields, such as, pattern recognition, computer aided\nvision, computed tomography, and image improvement. )\n\nThe typical distance between lenses and apertures are not large to meet\nFraunhofer condition. Instead, we can use the following Fresnel\npropagator:\n\nh(x, y, x′, y′, z) =\nexp(ikz)\nz\nexp(ik\n(x′-x)\n2+(y′-y)\n2z\n)\n(14)\n\nIn coherent illumination, the point spread function (PSF) describes the\nresponse of the lens system to an impulse δ(x, y) at the input field. If the\nDot Array\nMask\nf1\nf1\nf2\nf2\nInput\nOutput\nScreen\nlens,\ngrating,\napertures\nlens,\ngrating,\napertures\nInput:\nE(x, y)\nElement 1\nElement 2\nPropagation or\nscattering\nt1(x, y)\nt2(x', y')\nh(x, x', y, y')\nlens,\ngrating,\napertures\nPropagation or\nscattering\nh(x', x\", y', y\")\nElement 3\n\nLecture Notes on Wave Optics (04/07/14)\n2.71/2.710 Introduction to Optics -Nick Fang\n\nsystem is shift-invariant, then the observed image is a sum of all the field\nE(x\", y\") contributed by the spread of each point (x, y) from the object.\n\n- Under (spatially) coherent illumination, the image field is a convolution of\nobject field with point spread function (PSF). Correspondingly, the\nAmplitude Transfer Function (ATF) is the Fourier transform of PSF:\n\nEimage(x\", y\") = Eobject(-\nf2\nf1 x, -\nf2\nf1 y) ⨂PSF(x, y)\n\n(15)\nATF(kx, ky) = ∫∫PSF(x, y) exp(ikxx+ ikxy) dxdy\n\n(16)\n\ne.g. ATF of single square aperture:\n\nATF= rect(f1kx\nak) rect(f1ky\nbk)\n\n- Under (spatially) incoherent illumination, the image intensity is a\nconvolution of object intensity with intensity of point spread function\n(iPSF=|PSF|2). Correspondingly, the (complex) Optical Transfer Function\n(OTF) is the Fourier transform of iPSF:\n\nIimage(x\", y\") = Iobject(-\nf2\nf1 x, -\nf2\nf1 y) ⨂|PSF(x, y)|2\n\n(17)\nOTF(kx, ky) = ∫∫|PSF(x, y)|2 exp(ikxx+ ikxy) dxdy= ATF⊗ATF\n(18)\n\ne.g. OTF of single square aperture:\n\n|OTF| = Λ (\nf1kx\nak) Λ(\nf1ky\nbk)\n\n(19)\n\nE(x, y)\nE(x\", y\")\n\nLecture Notes on Wave Optics (04/07/14)\n2.71/2.710 Introduction to Optics -Nick Fang\n\nSimulated intensity pattern of a 5x5 checkerboard illuminated by a light source with different\ncoherence. (left)100% coherent; (middle)50% coherent; (right) non-coherent.\n\nD. More specific examples on Coherent Imaging\n\na. Zernike Phase-Contrast Imaging\nZernike's Phase Contrast is commonly used in biological microscopy to view\ntransparent objects such as cellular membranes (that would otherwise require\nstaining).\n\nLet's consider a transparent object with a small phase shift in the following form:\n\nt(x, y) = exp(ik(n-1)h(x, y)) ≈1 + ik(n-1)h(x, y)\n\n(20)\n\nWhen the transparent object is uniformly illuminated by a plane wave, the\ntransmitted intensity is close to unity, leaving very low contrast. The idea behind\nthe Zernike method starts with the observation that the unity part is the dc\ncomponent in the Fourier plane, while φ(x, y) = k(n-1)h(x, y) represents a\nspatial distribution in the Fourier spectrum.\nSo what if we modify one of these to prevent the cancellation? Specifically, let's\ntry a π/2 phase shift of the dc component:\n.05666 mm\n.05666 mm\n\n0.0000\n1.4051\n0.7026\nDLP Projection Image\nAERIAL IMAGE\nField = ( 0.000, 0.000) Degrees\nDefocusing = 0.000000 mm\nRNA: 0.00\n.05666 mm\n.05666 mm\n\n.00216\n0.1749\n.08855\nDLP Projection Image\nAERIAL IMAGE\nField = ( 0.000, 0.000) Degrees\nDefocusing = 0.000000 mm\nRNA: 1.00\n0.1138 mm\n0.1138 mm\n\n.00084\n0.1876\n.09420\nDLP Projection Image\nAERIAL IMAGE\nField = ( 0.000, 0.000) Degrees\nDefocusing = 0.000000 mm\nRNA: 1.00\nprotrusion\nphase-shifts\ncoherent illumination\nby amount φ(x,y) =k(n-1)h(x,y)\nglass plate\n(transparent)\nprotrusion\n(transparent)\nTOP\nVIEW\nthickness\nh(x,y)\nCROSS\nSECTION\nThis model is often useful for imaging\nbiological objects (cells, etc.)\n(c) Source unknown. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see http://ocw.mit.edu/fairuse.\n\nLecture Notes on Wave Optics (04/07/14)\n2.71/2.710 Introduction to Optics -Nick Fang\n\nt(x, y) = exp (i\nπ\n2) + ik(n-1)h(x, y) = i(1 + k(n-1)h(x, y))\n\n(21)\n\nI(x, y) ∝|t(x, y)|2 = 1 + 2k(n-1)h(x, y) + O(h2)\n(22)\n\nNow the transmitted intensity reflects the phase information. Actually, since the\nintensity with phase change is nearly linear for small phase shifts, this method\ngives a direct image of the phase that is simple to interpret.\n\nb. Schlieren Method\n\nSchlieren (\"streaks\" in German) or shadowgraph imaging is important in the\nvisualization of fluid flows, as it shows phase gradients of the object in a\nparticular direction. To elaborate that effect, let's model the transmission\nfunction of the phase mask (e.g. a glass wedge or spiral plate) as following:\n\nAS(x′, y′) ≈1 + ik(∆n)(x′/a)\n\n(23)\n\nThe field transmitted through the fluid (x, y) , is illuminating on the aperture:\n\nEobject(x, y) ∝exp[iφ(x, y)]\n\n(24)\n\nEimage(x\", y\") ≈F(AS(kx\nf1\nk, ky\nf1\nk) × F(Eobject(x, y)))\nEimage(x\", y\") ≈F((1 + i(∆n)kx\nf1\na) × F(Eobject(x, y)))\nEimage(x\", y\") ≈Eobject(x, y) + (∆n)\nf1\naF(F(\n∂\n∂xEobject(x, y)))\n(25)\n\nWedge\nOr spiral phase\nplate\nf1\nf1\nf2\nf2\nPhase object\nφ(x)\nOutput\nScreen\ntx′ ≈1 + ik∆n(x′/a)\nEi a ex\"\n≈\nxEobjectx\n\nLecture Notes on Wave Optics (04/07/14)\n2.71/2.710 Introduction to Optics -Nick Fang\n\nEimage(x\", y\") ≈Eobject(x, y) + (∆n)\nf1\na\n∂\n∂xEobject(x, y)\n(26)\n\nEimage(x\", y\") ≈Eobject(x, y) [1 + i(∆n)\nf1\na\n∂\n∂xφ(x, y)]\n\n(27)\n\nNote that using a mask with phase gradient, the intensity fringes of image are\nconnected to the index gradient of the fluid flow! Such effect was first reported\nby Hooke and Huygens, when they used a candle to heat up the air in front of an\nobserving lens. (see \"Schlieren experiment 300 years ago\", by J. RIENITZ ,\nNature 254, 293 - 295 (27 March 1975); doi:10.1038/254293a0)\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n2SWLFV\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Optics, Lecture 20",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-71-optics-spring-2014/e6c5af8e2e9757e569fdc7c76cd623aa_MIT2_71S14_lec20_notes.pdf",
      "content": "Lecture Notes on Wave Optics (04/23/14)\n2.71/2.710 Introduction to Optics -Nick Fang\n\nOutline:\n- Fresnel Diffraction\n- The Depth of Focus and Depth of Field(DOF)\n- Fresnel Zones and Zone Plates\n- Holography\n\nA. Fresnel Diffraction\nFor the general diffraction problem, the electric field E(x',y') measured at a distance\nz from the plane of the aperture is a convolution of three factors:\nE(x′, y′) = ∫∫h(x′ -x, y′ -y, z)t(x, y)E(x, y)dxdy\n\n(1)\nh(x′ -x, y′ -y, z) =\nexp(ikr)\nr\n\n(2)\n\nwhere r= √(x′ -x)2 + (y′ -y)2 + z2\n\n(3)\n\nWhen the distance z is sufficiently far (z>>x',y', x, y) we take the paraxial\napproximation:\n\nr≈z(1 +\n(x′-x)\n2+(y′-y)\n2z2\n)\n\n(4)\nexp(ikr) ≈exp(ikz)exp(-ik\nxx′+yy′\nz\n)exp(ik\nx′2+y′2+x2+y2\n2z\n)\n(5)\nIt is the value of the quadratic term k\nx′2+y′2+x2+y2\n2z\nthat determines whether the Fresnel or\nFraunhofer approximation should be used. Generally speaking, it is determined according\nto whether the value of k\nx′2+y′2+x2+y2\n2z\nis larger than π/2 (Fresnel) or smaller than π/2\n(Fraunhofer). For example, taking D=1mm, =500nm, then z(Fraunhoffer)=1m! Therefore\nbetween z=10mm to 1 m is all Fresnel diffraction region.\n\n- Fresnel propagator or Fresnel kernel:\n\nTwo types of expressions for the Fresnel approximation can be obtained; one is in the form\nof a convolution and the other is in the form of a Fourier transform. If we expand exp(ikr)\ninto quadratic terms:\n\nE(x′, y′) = ∫∫h(x′ -x, y′ -y, z)t(x, y)E(x, y)dxdy\n\n(6)\nE(x′, y′)\n= exp(ikz)\nz\nexp(ikx′2+y′2\n2z\n) ∫∫exp(-ikxx′ + yy′\nz\n)exp(ikx2+y2\n2z\n)t(x, y)E(x, y)dxdy\n\nE(x′, y′) =\nexp(ikz)\nz\nexp(ik\nx′2+y′2\n2z\n)F[exp(ik\nx2+y2\n2z)t(x, y)E(x, y)]\n\n(7)\n\nLecture Notes on Wave Optics (04/23/14)\n2.71/2.710 Introduction to Optics -Nick Fang\n\nYou may recognize exp(ik\nx2+y2\n2z) is a Gaussian function with respect to x and y, and\nthe wavefront is diverging.\nUsing x′ = kx\nz\nk, y′ = ky\nz\nk\n\n(8)\n\nThe corresponding transfer function is:\n\nH(kx, ky) = exp(ikz)\nz\n∫∫exp(ikx2 + y2\n2z\n) exp(-ikxx-ikyy) dxdy\n\nH(kx, ky) =\nexp(ikz)\nk\nexp(-iz\nkx2+ky2\n2πk\n)\n\n(9)\nThe Fourier transform of a Gaussian function is still a Gaussian function. The above\nproperty is often used in analyzing the depth of focus (DOF).\n\nLecture Notes on Wave Optics (04/23/14)\n2.71/2.710 Introduction to Optics -Nick Fang\n\nB. The Depth of Focus (DOF)\n\nWhen a focusing error z= is present in the imaging system, there is a difference of\npath length from the \"ideal\" object plane. This means the field at the object plane is\nof the form:\n\nE(x, y) ⊗exp(ik\nx2+y2\n2δ)\n\n(10)\nCorrespondingly, the Fourier spectrum of the object is modified by H(kx, ky):\nE(kx, ky) × exp(-iδ\nkx\n2+ky\n2k\n)\n\n(11)\nKeep in mind, kx= k\nx′\nf1, ky= k\ny′\nf1. Therefore, the effect of defocus is like a phase mask,\nwhere the offset from the object plane create a quadratic phase shift for every k\ncomponent on the aperture plane. Correspondingly, the out-of-focus point spread\nfunction is modified:\n\nPSF(defocus)=F[AS(kx\nf1\nk, ky\nf1\nk) × exp(-iδ\nkx2+ky2\n2k\n)]\n\n(12)\n\n- The significance of the defocus: (Goodman 6.4.4)\n\nMild defocus: exp(-iδ\nkx2+ky2\n2k\n) ≈1 (13)\n\nThis requirement is met when\nδ\nkx2\n2k=\nδ\n2k(k\nx′\nf1)2 ≪\nπ\n\n(14)\nOr\nδk\nπ(NA)2 ≪1\n\n(15)\nδ≪\nλ\n2(NA)2 ≡DOF(DepthofFocus)\n(16)\n\nimage\nplane\nobject\nplane\nAperture\n(Fourier)\nplane\nout-of-focus\nobject\nδ\nobject spectrum\nRe(ATF)\nδkx\n2k\nkx=\n2 δ\n\nLecture Notes on Wave Optics (04/23/14)\n2.71/2.710 Introduction to Optics -Nick Fang\n\na.\nSevere defocus: δ≥\nλ\n2(NA)2\n\nIn this case, the oscillatory nature of\nthe defocus kernel results in strong\nblur on the image because of the\nsuppression of spatial frequencies\nnear the nulls and sign changes at\nthe negative portions.\n\nFigure: Computed imaging of letter \"M\" convolved with diffraction-limited\nPSF at different degrees of defocus.\n\n- Can the blur be undone computationally? (Goodman 8.8)\no Inverse of Fresnel propagator H(kx, ky) over distance z:\nThe problem of division is typically reduced to obtaining the\ntransmittance of the inverse, namely:\nH(kx,ky) =\nH∗(kx,ky)\n|H(kx,ky)|\n\n(17)\nNote: this inverted filter is also limited by the numerical aperture; it\nmay also include the effect of defocus and higher-order aberrations.\n\nIn order to retrieve the proper information with noise, different\nstatistical tools such as Tikhonov regularization are used.\n\no Practical limitations: the inversion is sensitive to both noise in the\nmeasured data, and the accuracy of the assumed knowledge.\n\nIn focus\n= 2DOF\n= 4DOF\nRe(ATF)\nobject\nspectrum\nδkx\n2k\nkx=\n2 δ\n(c) Source unknown. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see http://ocw.mit.edu/fairuse.\n\nLecture Notes on Wave Optics (04/23/14)\n2.71/2.710 Introduction to Optics -Nick Fang\n\nFigure: Deconvolution using Tikhonov regularized inverse filter, utilized a\npriori knowledge of depth of each digit. Note the artifacts primarily due to\nnumerical errors getting amplified by the inverse filter (despite\nregularization)\n\nC. Fresnel Zones and Zone Plates\n\nIn the above analysis, we find that the shift of an object along the z axis is equivalent\nto a phase mask of varying phase delay in the aperture plane:\nH(kx, ky) = exp(-iz\nkx2+ky2\n2k\n)\n\n(18)\nWhat happens if we placed an amplitude mask with the transmittance in the\nfollowing form?\n\nt(x, y) = [1 + cos (\nx2+y2\n2L)]\n(19)\n\nTo answer this question we can calculate the Fresnel diffraction pattern of this\nsystem using kx= k\nx′\nz, ky= k\ny′\nz.\nE(x′, y′) ≈∫∫exp(ikx2+y2\n2z\n) {1 + cos[x2+y2\n2L\n]} exp{-i[kxx+ kyy]}dxdy\n\nE(x′, y′) ≈F{exp(ik\nx2+y2\n2z) +\n2 exp [ik(x2+y2) (\n2L+\n2z)] +\n2 exp [-ik(x2+y2) (\n2L-\n2z)]}\n\n(20)\n\nThe Fourier transform of the first term is straight forward:\nexp (-ik\nx′2+y′2\n2z\n).\n\n(21)\n\nLikewise, we can express the second and the third term:\nIn focus\n= 2DOF\n= 4DOF\n(c) Source unknown. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see http://ocw.mit.edu/fairuse.\n\nLecture Notes on Wave Optics (04/23/14)\n2.71/2.710 Introduction to Optics -Nick Fang\n\n2 exp (-ik\nL\n2z\nx′2+y′2\nL+z) +\n2 exp (ik\nL\n2z\nx′2+y′2\nz-L).\n(22)\nthe 3rd term indicates a converging wave front towards z=L (a real image) on the\noptical axis, while as the 2nd term indicates a diverging wave front from a source\nlocated at z=-L (a virtual image) behind the aperture.\n\nThis is known as a Gabor\nzone plate (the building block\nof a hologram). Such plates\ncan be produced optically by\nphotographing the\ninterference pattern formed\nby two coherent spherical\nwavefront of different radii of\ncurvature.\n\nMore general idea of such\nplates in amplitude or phase can be constructed such that the phase differs by\nfrom one boundary to the next. The mth boundary has radius determined by\n\nk\n2 (x2+y2) (\nz′ +\nz) = m\n\n(23)\n\nFigure 16.01 From Pedrotti: Recording and\nReconstruction of Hologram on Gabor Zone\nplates.\n(c) Pearson Prentice Hall. All rights reserved. This content is excluded from our\nCreative Commons license. For more information, see http://ocw.mit.edu/fairuse.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n2SWLFV\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}