{
  "course_name": "Paradox and Infinity",
  "course_description": "No description found.",
  "topics": [
    "Humanities",
    "Philosophy",
    "Metaphysics",
    "Mathematics",
    "Computation",
    "Mathematical Logic",
    "Social Science",
    "Game Theory",
    "Humanities",
    "Philosophy",
    "Metaphysics",
    "Mathematics",
    "Computation",
    "Mathematical Logic",
    "Social Science",
    "Game Theory"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1 hour / session\n\nRecitation: 1 session / week, 1 hour / session\n\nPrerequisites\n\nThere are no prerequisites for this class. In practice, however, people who do well tend to have some experience proving things, or have done a lot of math or computer science. If you're a freshman, you might consider waiting a year before signing up.\n\nDifficulty\n\nHere are the levels of philosophical and mathematical demandingness of each of the topics we'll discuss:\n\nOn the\nphilosophical\nside, a demandingness level of 100% means that some of the ideas we'll be discussing are rather subtle; you won't need philosophical training to understand them, but you'll have to think about them very carefully.\n\nOn the\nmathematical\nside, a demandingness level of 100% means that the lecture is designed for someone who is familiar with college-level mathematics or is otherwise experienced in mathematical proof.\n\nTextbook\n\nThere is a required textbook, which you should use to supplement your understanding of the lectures and as an aid to completing problem sets:\n\nRayo, Agustin.\nOn the Brink of Paradox: Highlights from the Intersection of Philosophy and Mathematics\n. MIT Press, 2019. ISBN: 9780262039413. [Preview with\nGoogle Books\n]\n\nFor specific chapter information, see the\nReadings\nsection.\n\nGrading Policy\n\nACTIVITIES\n\nPERCENTAGES\n\nProblem sets\n\n80%\n\nPop quizzes and surveys\n\nDuring some lectures, there will be pop quizzes or surveys. A pop quiz consists of multiple choice questions on material discussed in the current or preceding lecture. You'll have to answer a quiz correctly to get credit. A pop survey is a questionnaire aimed at figuring out where the group stands on some issue. All it takes to get full credit on a survey is to participate. Your final Pop Quiz and Survey grade is the result of averaging your pop quiz and survey scores across the semester, after dropping your lowest score.\n\n15%\n\nRecitation section attendance\n\nAttending recitation sections is mandatory. For each recitation meeting, you will be assigned a grade of 100% if you attend, or 0% if you fail to attend. (Tardiness may count as an absence, at your TA's discretion.) Your lowest attendance grade will be dropped.\n\n5%\n\nFor information on the problem sets, see the\nAssignments\nsection.",
  "files": [
    {
      "category": "Assignment",
      "title": "24.118_S19 Paradox and Infinity, Assignments: Problem Set 1: Infinite Cardinalities",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-118-paradox-and-infinity-spring-2019/df9cbef0041d6969bd6252920a2deb09_MIT24_118S19_ProblemSet1.pdf",
      "content": "24.118: Paradox and Infinity, Spring 2019\nProblem Set 1: Infinite Cardinalities\nHow these problems will be graded:\n- In Part I there is no need to justify your answers. Assessment will be\nbased on whether your answers are correct.\n- In Part II you must justify your answers. Assessment will be based both on\nwhether you give the correct answer and on how your answers are justified.\n(In some problem sets I will ask you to answer questions that don't have\nclear answers. In those cases, assessment will be based entirely on the basis\nof how your answer is justified. Even if it is unclear whether your answer is\ncorrect, it should be clear whether or not the reasons you have given in\nsupport of your answer are good ones.)\n- No answer may consist of more than 150 words. Longer answers will\nnot be given credit. (Showing your work in a calculation, a proof, or a\ncomputer program does not count towards the word limit.)\n- You may consult published literature and the web. You must, however,\ncredit all sources. Failure to do so constitutes plagiarism and can have\nserious consequences. For advice about when and how to credit sources\nsee: https://integrity.mit.edu/\nPart I\n1. A function f : A -→ B is an assignment of each member of A to some member\nof B. A function f : A -→ B is an injection if f(x) 6= f(y) whenever x =6\ny, for\na, b ∈ A. A function f : A -→ B is a surjection if there is no member of B to\nwhich f fails to assign some member of A.\nFor each of the following functions f : A -→ B determine whether f is injective and\nwhether it is surjective.\n(a) (2 points)\nf(x)\n= x + 1\nA\n= N\nB\n= N\n(b) (2 points)\nf(x)\n= x + 1\nA\n= N\nB\n= N -{0}\n\n(c) (2 points)\nf(x)\n= x2\nA\n= Z\nB\n= Z\n(d) (2 points)\nf(x)\n= x + 1\nA\n= R\nB\n= R\nNotation: N = {0, 1, 2, . . . } is the set of natural numbers, Z = {· · ·-2, -1, 0, 1, 2, . . . }\nis the set of integers, R is the set of real numbers, and X - Y is the set of entities\nthat are members of X but not of Y .\n2. A bijection from set A to set B is a function from A to B which is both injective\nand surjective. Between which of the following pairs of infinite sets is it possible to\nconstruct a bijection?\n(a) The set of negative integers and the set of non-negative integers. (2 points.)\n(b) The set of prime numbers and the set of real numbers. (2 points.)\n(c) The set of prime numbers and the set of real numbers between 0 and 1. (2 points.)\n(d) The rational numbers and the set of rational numbers between 0 and 1. (2 points.)\n3. The following principles give conflicting answers to cardinality questions:\nThe Proper Subset Principle Suppose A is a proper subset of B. Then A and\nB are not of the same size: B has more members than A.\nThe Bijection Principle Set A has the same size as set B if and only if there is a\nbijection from A to B.\nFor each of the questions below determine which of the following answers is correct:\n\"yes\", \"no\", or \"not determined\".\n(a) Are {0, 1, 2} and {0, 1, 2, 3} of the same size, according to the Proper Sub\nset Principle? Are they of the same size according to the Bijection Principle?\n(3 points.)\n(b) Are {0, 1, 2} and {1, 2, 3, 4} of the same size, according to the Proper Sub\nset Principle? Are they of the same size according to the Bijection Principle?\n(3 points.)\n(c) Are the set of prime numbers and the set of natural numbers of the same size,\naccording to the Proper Subset Principle? Are they of the same size according\nto the Bijection Principle? (3 points.)\n\nReminder: Although you'll need to think about the Proper Subset Principle for\nthe purposes of this question, it won't be relevant for the rest of the problem set.\nIn this class we follow Cantor--and current mathematical practice--in rejecting\nthe Proper Subset Principle and assessing cardinality questions on the basis of the\nBijection Principle.\n4. Every room in Hilbert's Hotel is occupied. New guests show up.\n(a) There is one new guest for each rational number. Can all of them be accommo\ndated without asking anyone to share a room? (3 points.)\n(b) There is one new guest for each real number. Can all of them be accommodated\nwithout asking anyone to share a room? (3 points.)\n5. Describe a set that contains no integers but has the same cardinality as the set of\nintegers. (4 points.)\nPart II\n6. Show that there is a bijection between the set of integers {. . . -2, -1, 0, 1, 2, . . . } and\nthe set of squares of integers {0, 1, 4, 9, 16, . . . }. (5 points)\n7. Show that there is a bijection from N to {hn, mi : n, m ∈ N}, which is the set of pairs\nof natural numbers. (10 points)\n8. Show that there cannot be a bijection from the set of natural numbers to the set of\nfunctions f such that f : N -→ {-1, π, e}. (10 points)\n9. The unit cube C is the set of triples hr, p, qi, for r, p, q ∈ [0, 1]. A point hr, p, qi in C\nis said to be \"rational\" if all three of r, p, and q are rational.\n(a) Is there a bijection from the set of points in C to the set of real numbers?\n(10 points; don't forget to justify your answer)\n(b) Is there a bijection from the set of rational points in C to the set of rational\nnumbers? (10 points; don't forget to justify your answer)\n10. Consider the following infinite tree:\n\n. . .\n(When fully spelled out, the tree contains one row for each natural number. The\nzero-th row contains one node, the first row contains two nodes, the second row\ncontains four nodes, and, in general, the nth row contains 2n nodes.)\n(a) Is there a bijection between the nodes of this tree and the natural numbers?\n(10 points)\n(b) Is there a bijection between the paths of this tree and the natural numbers? A\npath is an infinite sequence of nodes which starts at the top of the tree and\ncontains a node at every row, with each node connected to its successor by an\nedge. (Paths can be represented as infinite sequences of zeroes and ones.) Don't\nforget to justify your answers! (10 points)\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n24.118 Paradox and Infinity\nSpring 2019\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "24.118_S19 Paradox and Infinity, Assignments: Problem Set 10: Gödel's Theorem",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-118-paradox-and-infinity-spring-2019/0bd762712d2588ee93236f85f336dd0a_MIT24_118S19_ProblemSet10.pdf",
      "content": "24.118: Paradox and Infinity, Spring 2019\nProblem Set 10: G odel's Theorem\nHow these problems will be graded:\n- In Part I there is no need to justify your answers. Assessment will be\nbased on whether your answers are correct.\n- In Part II you must justify your answers. Assessment will be based both on\nwhether you give the correct answer and on how your answers are justified.\n(In some problem sets I will ask you to answer questions that don't have\nclear answers. In those cases, assessment will be based entirely on your\njustification. Even if it is unclear whether your answer is correct, it should\nbe clear whether or not the reasons you have given in support of your\nanswer are good ones.)\n- No answer may consist of more than 150 words. Longer answers will\nnot be given credit. (Showing your work in a calculation, a proof, or a\ncomputer program does not count towards the word limit.)\n- You may consult published literature and the web. You must, however,\ncredit all sources. Failure to do so constitutes plagiarism and can have se\nrious consequences. For advice about when and how to credit sources see:\nhttps://integrity.mit.edu/ (You do not need to credit course materials.)\nNote: Several of the questions below pertain to a specific formal language L, which\nis defined in Section 10.2 of the textbook. The symbol \"L\", in contrast, is used as\na variable to range over arbitrary formal languages.\nPart I\n1. The following are meant to test your ability to formalize sentences of L. You may\nmake use of any of the notational abbreviations introduced in chapter 10 of the\ntextbook (or its appendix).\n(a) Define an expression \"Mult17(xi)\" of L that is true if and only if xi is a multiple\nof 17. (5 points)\n(b) Define an expression \"PerfectSquare(xi)\" of L that is true if and only if xi is a\nperfect square. (5 points)\n√\n(c) Define an expression \"IrrationalRoot(xi)\" of L that is true if and only if\nxi is\nan irrational number. (5 points)\n\n(d) Extra Credit: Define an expression \"Perfect(xi)\" of L that is true if and only if\nxi is a perfect number.1 (5 points)\n(e) Find a sentence of L that expresses the (incorrect) claim that the natural num\nbers are dense: between any two natural numbers there is a third. (5 points)\n(f) Find a sentence of L that expresses Fermat's Last Theorem: there are no positive\nintegers a, b, c and n > 2 such that an + bn = cn . (5 points)\n(g) Find a sentence of L that expresses Euclid's Lemma: if a prime p divides the\nproduct of natural numbers a and b, then p must divide at least one of a and b.\n(5 points)\nPart II\n2. This question has three parts: (5 points each)\n(a) Is it possible to construct a Turing Machine M1 that runs forever outputting\nsentences of L in such a way that every arithmetical truth is eventually output\nby M1?\n(b) Is it possible to construct a Turing Machine M2 that runs forever outputting\nsentences of L in such a way that no arithmetical falsehood is ever output by\nM2?\n(c) Is it possible to construct a Turing Machine that satisfies both the conditions\nof M1 above and the conditions of M2 above?\n3. Let L10100 be the sublanguage of L consisting of formulas of L with 10100 symbols or\nfewer. Is L10100 immune from G odel's Theorem? More specifically, is there a Turing\nMachine M 10100 that when run on an empty input eventually outputs every true\nsentence of L10100 without ever outputting a false sentence of L10100 ?\nIf you think M 10100 exists, give a sketch of how it might work. If you think M 10100\ncannot exist, adapt the proof of G odel's Theorem in section 10.3 of the textbook to\nshow that its existence would lead to contradiction. (10 points.)\n4. The following definitions are adapted from sections 10.3.2 and 10.3.3 of the textbook:\nAn axiomatization for a language L is a system for proving claims within L. It\nconsists of two different components, a set of axioms and a set of rules of inference:\n- An axiom is a sentence of L that one treats as provable by fiat.\nWhen L is the language of arithmetic, for example, is is natural to select \"0 = 0\"\nas an axiom.\n1Recall that a perfect number is a number that is equal to the sum of its proper divisors. (A proper\ndivisor of n is a divisor of n distinct from n.)\n\n- A rule of inference is a rule that allows you to count a sentence of L as\nprovable, given that other sentences of L are provable.\nAn example of a rule of inference is modus ponens, which says that ψ is provable,\ngiven that φ and \"if φ, then ψ\" are both provable.\nFor an axiomatization of L to be complete is for every true sentence of L to be\nprovable on the basis of that axiomatization. For it to be consistent is for it to\nnever be the case that both a sentence of L and its negation are provable on the\nbasis of that axiomatization.\nNow suppose that L consists of the following sentences:\n- \"pigeons can't fly\" and \"camels are mammals\" are both sentences of L.\n- \"it is not the case that pigeons can't fly\" and \"it is not the case that camels are\nmammals\" are both sentences of L.\n- If φ and ψ are sentences of L, then so is \"it is both the case that φ and that ψ\".\n- Nothing else is a sentence of L.\n(a) Show that the following is an inconsistent axiomatization of L: (5 points)\nAxioms: \"camels are mammals\"\nRules of Inference: (1) If φ is provable, then so is any sentence of the form\n\"it is both the case that φ and that ψ\". (2) If \"it is both the case that φ\nand that ψ\" is provable, then φ and ψ are both provable.\n(b) Show that the axiomatization of problem (4a) is complete. (5 points)\n(c) Specify a consistent and complete axiomatization of L. (5 points; no need to\njustify your answer.)\n5. The textbook describes a proof of G odel's Theorem that is based on the following\nlemma:\nLemma 1 L contains a formula (abbreviated \"Halt(xi)\") which is true of a number\nk if and only if the kth Turing Machine halts on input k.\nAs it happens, the following lemma is also true:\nLemma 2 L contains a formula (abbreviated \"BB(xi, xj )\") which expresses the busy\nbeaver function. In other words: BB(n, k) if and only if the productivity of the\nmost productive Turing Machine with n states or fewer is k.\nProve G odel's Theorem by relying on Lemma 2 rather than Lemma 1. (30 points)\n(Hint: You may assume that the Busy Beaver Function is not computable.)\nRemember that the word limit doesn't apply to proofs.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n24.118 Paradox and Infinity\nSpring 2019\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "24.118_S19 Paradox and Infinity, Assignments: Problem Set 2: The Higher Infinite",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-118-paradox-and-infinity-spring-2019/1ee75cf7156bfff5521b2559a2158a7e_MIT24_118S19_ProblemSet2.pdf",
      "content": "24.118: Paradox and Infinity, Spring 2019\nProblem Set 2: The Higher Infinite\nHow these problems will be graded:\n- In Part I there is no need to justify your answers. Assessment will be\nbased on whether your answers are correct.\n- In Part II you must justify your answers. Assessment will be based both on\nwhether you give the correct answer and on how your answers are justified.\n(In some problem sets I will ask you to answer questions that don't have\nclear answers. In those cases, assessment will be based entirely on the basis\nof how your answer is justified. Even if it is unclear whether your answer is\ncorrect, it should be clear whether or not the reasons you have given in\nsupport of your answer are good ones.)\n- No answer may consist of more than 150 words. Longer answers will\nnot be given credit. (Showing your work in a calculation, a proof, or a\ncomputer program does not count towards the word limit.)\n- You may consult published literature and the web. You must, however,\ncredit all sources. Failure to do so constitutes plagiarism and can have\nserious consequences. For advice about when and how to credit sources\nsee: https://integrity.mit.edu/\nPart I\n1. Determine whether each of the following statements is true or false. (3 points each)\n(a) ℘n(N) ⊆ ℘m(N), for n < m and n, m ∈ N.\n(b) |℘n(N)| < |℘m(N)|, for n < m and n, m ∈ N.\n(c) ℘n(N) ⊆{℘m(N) : m ∈ N}, n ∈ N.\nS\n(d) ℘n(N) ⊆\n{℘m(N) : m ∈ N}, n ∈ N.\n(e) |℘n(N)| < | {℘m(N) : m ∈ N} |, n ∈ N\nS\n(f) |℘n(N)| < |\n{℘m(N) : m ∈ N} |, n ∈ N\nNotation:\n- N is the set of natural numbers.\n- ℘n(A) = ℘(℘(. . .℘( A ) . . . )) (n ∈ N).\n|\n{z\n}\n| {z }\nn times\nn times\n1You may assume that the natural numbers are not sets.\n\nS\n-\nA = {x : x ∈ B for B ∈ A}.\n2. Determine whether each of the following statements is true or false. (2 points each)\n(a) 00 + 0000 = 0000 + 00\n(b) 00 × 0000 = 0000 × 00\n(c) 00 + ω = ω0 + 0\n(d) 00 + ω = 0 + ω0\n(e) 0000 × ω = (ω + ω) + ω\n(f) ω × 0000 = ω + (ω + ω)\n(g) (ω × 000) + ω <o (ω × ω) + 000\n(h) ω × ω <o ω × (000 × ω)\n(i) ω × (ω + ω) = (ω × ω) + (ω × ω)\n(j) α + 00 = α ∪{α} (α an ordinal)\nPart II\n3. Draw a diagram (or use prose2) to give an informal characterization of the well-\nordering types represented by each of the following ordinals. (4 points each)\n(a) (ω × ω) + 0000\n(b) (ω + 0000) × 0000\n(c) (0000 × ω) × 0000\n[Correction: This problem should have been listed under Part I. So there is no need\nto justify your answer. Simply draw your diagram or write down your prose.]\n4. Using an example not found in the course material:\n(a) Specify (i) a set whose members are not numbers and (ii) an ordering on that\nset that is not a (strict) total ordering. (5 points)\n(b) Specify (i) a set of any kind and (ii) a (strict) total ordering on that set that is\nnot a well-ordering. (5 points)\n5. If α and β are ordinals, does α <o β entail |α| < |β|? If so explain, why. If not give\na counterexample. (10 points)\n2What does it mean to use prose to give an informal characterization of a well-order type? Suppose,\nfor example, that the well-order type in question corresponded to ω. Then you might say something like\n\"A countably infinite sequence of items which is ordered like the natural numbers, with a first member, a\nsecond member, and so forth--but no last member.\"\n\n6. Recall the Ordinal Construction Principle:\nConstruction Principle At each stage, we introduce a new ordinal, namely: the\nset of all ordinals that have been introduced at previous stages.\nUse this Principle to show that if α is an ordinal with infinitely many members, then\neither α = ω or ω <o α. (10 points)\n7. Give an example of a set whose cardinality is greater than the cardinality of each\nS\n℘n(U ) (n ∈ N), where U =\n{N,℘(N),℘(℘(N)), . . . }. (10 points; don't forget to\njustify your answer.)\n8. Give an example of a set of cardinality \"much greater\" than |Bω×ω|, where\n⎧\n⎪N, if α = 0\n⎨\nBα = ℘(Bβ), if α = β0\n⎪S\n⎩ {Bγ : γ <o α} if α is a limit ordinal greater than 0\nWhat does \"much greater\" mean here? It must be possible to show that there are\ninfinitely many sizes of infinity between the set you identify and |Bω×ω|. (10 points;\ndon't forget to justify your answer.)\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n24.118 Paradox and Infinity\nSpring 2019\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "24.118_S19 Paradox and Infinity, Assignments: Problem Set 3: Omega-sequence Paradoxes",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-118-paradox-and-infinity-spring-2019/97a6c8112dcf0b0e1ad517826f320043_MIT24_118S19_ProblemSet3.pdf",
      "content": "24.118: Paradox and Infinity, Spring 2019\nProblem Set 3: Omega-Sequence Paradoxes\nHow these problems will be graded:\n- In Part I there is no need to justify your answers. Assessment will be\nbased on whether your answers are correct.\n- In Part II you must justify your answers. Assessment will be based both on\nwhether you give the correct answer and on how your answers are justified.\n(In some problem sets I will ask you to answer questions that don't have\nclear answers. In those cases, assessment will be based entirely on the basis\nof how your answer is justified. Even if it is unclear whether your answer is\ncorrect, it should be clear whether or not the reasons you have given in\nsupport of your answer are good ones.)\n- No answer may consist of more than 150 words. Longer answers will\nnot be given credit. (Showing your work in a calculation, a proof, or a\ncomputer program does not count towards the word limit.)\n- You may consult published literature and the web. You must, however,\ncredit all sources. Failure to do so constitutes plagiarism and can have se\nrious consequences. For advice about when and how to credit sources see:\nhttps://integrity.mit.edu/ (You do not need to credit course\nmaterials.)\nWarning: You may find this problem set harder than the previous two. Whereas\nproblem Sets 1 and 2 were largely a test of your math skills, Problem Set 3 will\nbegin to test your philosophical abilities. In working through the problems, you may\nfind that the rules of the game are not as clear as you'd like--and therefore that you\ncan't just rely on your math skills. Keep in mind that even if a problem is murky,\nit can be addressed in more or less thoughtful ways: a good answer will reveal that\nyou've understood the complexity of the underlying terrain and that you've given\nthe issue serious thought. Addressing a murky question requires that you be more\ncareful, not less.\nPart I\n1. Imagine an island on which everyone is either a knight or a knave. Knights only\nassert truths, knaves only assert falsehoods.\nFor each of the scenarios below, determine whether one can settle the question of\nwhether S0 a knight or a knave. If the answer is \"yes\", state whether S0 is a knight\nor a knave; if the answer is \"no\", state the reason why.\n\n(a) Ten islanders, S0, S1, . . . , S9, are lined up. S0 is at the back of the line; in front\nof her is S1; in front of him is S2; and so on. Each islander says: \"There is\nat least one person in front of me, and everyone in front of me is a knave.\"\n(5 points)\n(b) Countably many islanders, S0, S1, S2, . . ., are lined up, one for each natural\nnumber. S0 is still at the back of the line; in front of her is S1; in front of him\nis S2, and so on. Each islander says: \"There is at least one person in front of\nme, and everyone in front of me is a knave.\" (5 points)\n(c) As in the previous case, but this time each islander says: \"There is at least one\nperson in front of me, and everyone in front of me is a knight.\" (5 points)\nPart II\n2. The following questions are intended to test your understanding of continuity assump\ntions.1 They may or may not have determinate answers. (If you think a question\nhas a determinate answer, make sure you explain why. If you think it doesn't, make\nsure you explain why not.)\n(a) You have a wheel with a radius of 1 meter. You draw a red line going from the\ncenter of the wheel to the twelve o'clock position:\nYou then rotate the wheel, in steps. At each step, you rotate the wheel one\nradian clockwise, so that the outermost point of the red line travels 1 meter\naround the perimeter of the wheel. Here is the first rotation:\n-→\nBecause the tip of the red line travels 1 meter around the perimeter after each\nrotation, and because the perimeter of the wheel is 2π meters (which is an\n1I am told that the underlying puzzle was created by Oxford philosopher Frank Arntzenius's daughter,\nwhen she was very young.\n\nirrational number of meters), there is no positive integer n such that, after n\nsteps, the red line returns to a position it had occupied before.\nSuppose you perform this operation infinitely many times, once for each positive\ninteger. At noon the red line is at the twelve o'clock position. At 12:30 you\nrotate the wheel one radian clockwise. At 12:45 you rotate the wheel another\nradian clockwise. And so forth: for each n ≥ 1, you perform the nth rotation\nn hours before 1pm.\nQuestion: in which direction will the red line be pointing at 1pm? (10 points)\n(b) Consider a variant of the case in part (a). As before, you start by drawing a\nred line from the center of the wheel to the twelve o'clock position. But this\ntime you draw new lines, in steps. At each step, you draw a red line at a one\nradian angle from the last line you drew. At noon you draw the initial red line,\npointing to the twelve o'clock position. At 12:30 you draw an additional line, a\nradian away in the clockwise direction. At 12:45 you draw an additional line, a\nradian away in the clockwise direction. And so forth: for each n ≥ 1, you draw\na line 2\nn hours before 1pm. Here are the first two steps of the process:\n-→\nThere is a well-defined fact of the matter about what the wheel will look like\nfrom noon onwards. Namely: a radial line r will be colored red if and only\nif, for some number n, r is exactly n radians away from twelve o'clock, going\nclockwise.\nNow it's 1pm and you're done drawing lines on the wheel. The next step is to\nrotate the wheel.\nConsider the result of rotating the wheel one radian in the clockwise direction.\nIt'll look exactly the way the unrotated wheel would have looked if you had\nskipped drawing the 12pm line. And if you rotate the wheel one radian further,\nfor a total rotation of two radians, it'll look exactly the way the unrotated wheel\nwould have looked if you had skipped drawing the 12pm and 12:30pm lines. And\nso forth: after a total of n rotations, the wheel will look exactly the way the\noriginal unrotated wheel would have looked if you had skipped drawing all lines\nup to and including the 1pm-2n\n-1 hours line.\nSuppose that you rotate the wheel infinitely many times, once for each positive\ninteger. At 1pm you rotate the wheel one radian in the clockwise direction. At\n1:30 you rotate the wheel another radian in the clockwise direction. Again at\n1:45. And so forth. For each n ≥ 0, you perform the nth rotation 2\nn hours\nbefore 2:00pm.\n\nQuestion: What does the wheel look like at 2pm? (10 points)\n(c) Suppose you start by drawing lines on the wheel as in part (b). But this time you\nperform no rotations. Instead, you erase red lines using the following procedure.\nAt 1:00pm you erase the red line pointing to the twelve o'clock position. At 1:30\nyou erase the line pointing one radian in the clockwise direction from the last\nline erased. And so forth: for each n ≥ 1, you erase the line one radian away in\nthe clockwise direction from the last line erased.\nQuestion: Is there a difference between the way our wheel looks at 2pm and the\nway the wheel in the previous exercise looked at 2pm? (5 points; make sure you\nexplain your answer)\n3. The following questions are also intended to test your understanding of continuity\nassumptions. As before, they may or may not have determinate answers. (If you\nthink a question has a determinate answer, make sure you explain why. If you think\nit doesn't, make sure you explain why not.)\n(a) Fool has infinitely many dollar bills and has labelled each of them with a different\nnatural number (its 'serial number'). One minute before midnight, Fool gives\nyou a dollar bill. Half a minute later, he gives you two dollar bills. Fifteen\nseconds later, he gives you four dollar bills. And so forth. (For each i ≥ 0,\nFool gives you 2i dollar bills 2-i minutes before midnight.) There is, however, a\ncatch. Each time you receive money from Fool, you are required to put together\nall your dollar bills, and burn the one with the lowest serial number. Assume\nthat, at midnight, you have every dollar bill that you received from Fool and\ndid not burn. How much money will you have at midnight? (10 points; make\nsure you explain your answer)\n(b) One minute before midnight, Fool gives you a dollar bill. Half a minute later,\nyou burn a dollar bill. Fifteen seconds later, Fool gives you two dollar bills. 7.5\nseconds later, you burn a dollar bill. 3.75 seconds later Fool gives you four dollar\nbills. And so forth. (For each i ≥ 0, Fool gives you 2i dollar bills 2-2i minutes\nbefore midnight and you burn a dollar bill 2-(2i+1) minutes before midnight.)\nAssume that, at midnight, you have every dollar bill that you received from Fool\nand did not burn. How much money will you have at midnight? (10 points;\nmake sure you explain your answer)\n4. Team A consists of an ω-sequence of persons, a0, a1, a2, . . . . 2 Between 11:00am and\nnoon, they are each given an opportunity to choose a one or a zero. They proceed\nin inverse order, with a0 choosing last, a1 next to last, and so forth. To fix ideas, let\nus assume that choices made on the following schedule:\n2This puzzle and the next are due to MIT philosopher Steve Yablo (of Yablo's Paradox fame).\n\ntime\nchooser\n.\n.\n.\n.\n.\n.\n12:00 -(1 - 2\nk )hours\nak\n.\n.\n.\n.\n.\n.\n11:15\na2\n11:30\na1\n12:00\na0\na0, a1, a2, . . . all want to pick the same color, so they agree on the following strategy:\nTeam A's Strategy If ak+1 chooses 0, ak chooses 0; otherwise, ak chooses 1.\nAssume that every member of the team succeeds in following this strategy. As a\nresult, they either all choose 1 or all choose 0. Is there a causal explanation3 to be\ngiven about why the group chooses one rather than zero (or zero rather than one)?\nIf so, spell out the explanation in some detail. If not, explain why not. (10 points)\n5. There are two teams, Team A and Team B. Each team consists of an ω-sequence\nof persons: a0, a1, a2, . . . and b0, b1, b2, . . . , respectively. Between 11:00am and noon,\nthe members of Team A and Team B will take turns choosing ones and zeroes. They\nproceed in inverse order, with a0 and b0 choosing last, a1 and b1 choosing next to\nlast, and so forth. In addition, ak always chooses ahead of bk. To fix ideas, let us\nassume that choices made on the following schedule:\ntime\nchooses first chooses second\n.\n.\n.\n.\n.\n.\n.\n.\n.\n12:00 -(1 - 1 )hours\n2k\nak\nbk\n.\n.\n.\n.\n.\n.\n.\n.\n.\n11:15\na2\nb2\n11:30\na1\nb1\n12:00\na0\nb0\nThe two teams have opposing goals: Team A wants ak and bk to choose the same,\nfor each k ∈ N. Team B wants them to choose differently,\nSince Team B has the advantage of choosing second, they agree on the following\nstrategy:\nTeam B's Strategy If ak chooses 0, bk chooses 1; otherwise, bk chooses 0.\n3What is a causal explanation? To causally explain why x occurred rather than y is to describe a\nsequence of causes and effects leading to x in a way that makes clear why x came about rather than y.\n\nTeam A knows about Bacon's Puzzle. First, they partition the set of ω-sequences of\n0s and 1s by placing two sequences in the same cell if and only if the sequences differ\nat most finitely (i.e. there are at most finitely many i ∈ N such that the sequences\ndiffer on the ith position). Then they agree on a representative from each cell.\nNow suppose it is ak's turn to choose and let B be the sequence hc(b0), c(b1), c(b2), . . .i,\nwhere c(bi) is the choice that bi has in fact made (or will in fact make). Since b0, . . . , bk\nhave not made their choices yet, ak doesn't know what they are. But we will suppose\nthat ak knows what bk+1, bk+2, . . . 's choices are. Accordingly, ak knows what lies\nin all but finitely many positions of the sequence B. This is enough to ascertain\nwhich cell B is in, and therefore to identify ρB, which is the sequence that had been\npreviously been agreed upon as a representative for B's cell. ak is then asked to\nchoose as follows:\nTeam A's Strategy If the sequence ρB has a 0 in its kth position, ak chooses 0;\notherwise, ak chooses 1.\n(a) By assuming that every member of Team A succeeds in following Team A's\nStrategy, show that there are at most finitely many k ∈ N such that ak and bk\nchoose differently. (5 points)\n(b) It is obvious that if every member of Team B succeeds in following Team B's\nStrategy, ak and bk will choose differently for each k ∈ N. So it follows form part\n(a) that it is impossible for every member of Team A to succeed in following\nTeam A's strategy and every member of Team B to succeed in following Team\nB's strategy.\nDoes the setup of the problem settle the question of who will fail to follow their\nassigned strategy? Does it determine a causal mechanism that might explain\nwhy people who don't follow their assigned strategy fail to do so? (10 points)\n6. There are two prisoners in a room. They both close their eyes and each of them is\napproached by a guard. Each guard flips a fair coin. If the coin lands Heads, she\ngives her prisoner a red hat; if it lands Tails, she gives her prisoner a blue hat. Once\nthe prisoners have been assigned hats, they are both allowed to open their eyes.\nAs soon as they each see the color of the other's hat (but not the color of their\nown hat), the prisoners are taken into separate cells so that they are unable to\ncommunicate with one other. At that point, they are each to be asked to name the\ncolor of their hat. The guards will then proceed as follows:\n- if at least one of the prisoners answers correctly, they will both be set free;\n- otherwise, they will both be shot.\n(a) Find a strategy that the prisoners can agree upon ahead of time which guar\nantees that their chance of survival is above 50%. Make sure your strategy is\n\ndeterministic: it must determine a definite outcome for each prisoner, given the\nprisoner's situation at the time of his decision. (5 points)\n(b) Given that the prisoners have no access to information about the color of their\nown hats, and that the colors were chosen using independent coin tosses, what\nexplains the possibility of a deterministic strategy that brings the prisoners'\nchance of survival above 50%? (10 points)\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n24.118 Paradox and Infinity\nSpring 2019\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "24.118_S19 Paradox and Infinity, Assignments: Problem Set 4: Time Travel",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-118-paradox-and-infinity-spring-2019/8152036933172dedd63d0a6abf9e32c4_MIT24_118S19_ProblemSet4.pdf",
      "content": "24.118: Paradox and Infinity, Spring 2019\nProblem Set 4: Time Travel\nHow these problems will be graded:\n- In Part I there is no need to justify your answers. Assessment will be\nbased on whether your answers are correct.\n- In Part II you must justify your answers. Assessment will be based both on\nwhether you give the correct answer and on how your answers are justified.\n(In some problem sets I will ask you to answer questions that don't have\nclear answers. In those cases, assessment will be based entirely on the basis\nof how your answer is justified. Even if it is unclear whether your answer is\ncorrect, it should be clear whether or not the reasons you have given in\nsupport of your answer are good ones.)\n- No answer may consist of more than 150 words. Longer answers will\nnot be given credit. (Showing your work in a calculation, a proof, or a\ncomputer program does not count towards the word limit.)\n- You may consult published literature and the web. You must, however,\ncredit all sources. Failure to do so constitutes plagiarism and can have se\nrious consequences. For advice about when and how to credit sources see:\nhttps://integrity.mit.edu/ (You do not need to credit course\nmaterials.)\nPart I\n1. Recall that for a time-travel story to be consistent, it must never give us conflicting\ndescriptions of a single point in the narrative's timeline.\nWith that in mind, determine whether each of the the following stories can be inter\npreted as a consistent time travel stories. (Make sure you interpret them as stories\nabout ordinary time, rather than super-time, and that you interpret them as time\ntravel stories rather than world-travel stories.)\n(a) After doing badly in an exam, you resolve to travel back in time to give yourself\na hint before the exam takes place. You successfully travel back in time but\nmistakenly hand your earlier self the wrong hint and end up doing even worse\non the exam. (5 points)\n(b) As a child, Oscar goes for a walk in the forest. For a few seconds, he experiences\nthe odd sensation of being watched. Many years later, he uses a time machine\nto travel back to that fateful day. He finds good a hiding place in the forest and\nspends a few seconds watching his younger self. As an old man, he again uses a\ntime machine to travel back to the fateful day. He finds an even better hiding\n\nplace and spends a few seconds watching his middle-aged self watch his younger\nself. (5 points)\n(c) A team of lepidopterists travels back in time to the Paleogene, hoping to catch\na glimpse of early butterflies. The team is cautioned not to interfere with the\npast in any way. But accidents happen. As they are completing their journey,\none of the scientists steps on a branch and startles a butterfly. When the team\nreturns to the present, they are confronted with changed world. Land octopuses\nhave conquered the Earth and rule with an iron tentacle. A small interference\nin the past has made a big difference to the future. (5 points)\nPart II\n2. Recall the Control Hypothesis:\nControl Hypothesis An agent acts freely in doing X if and only if: (1) she does\nX by making a certain decision, and (2) she is in a position to do something\nother than X by making a different decision.\nNow consider the following scenarios:\n(a)\nFelix is on his way to get ice-cream. You know Felix well enough to\nknow that the only ice-cream flavor he likes is chocolate. So you know\nfrom the start that he will choose chocolate. And sure enough: when\nhe arrives at the ice-cream store he chooses chocolate, even though he\nwas in a position to choose any flavor on the menu.\nAccording to the Control Hypothesis, did Felix act freely in choosing chocolate?\nKeep in mind that you were able to predict that he would pick chocolate from\nthe start. (5 points; don't forget to justify your answer)\n(b)\nBruno is on his way to kill Grandfather. You know that Grandfather\nis Bruno's grandfather.1 So you know from the start that Bruno will\nfail. And sure enough: Bruno has a change of heart at the last minute\nand decides to put down the gun, even though he was in a position to\nmake a different decision and pull the trigger instead.\nAccording to the Control Hypothesis, did Bruno act freely in putting down\nhis gun? Keep in mind that you were able to predict that he wouldn't kill\nGrandfather from the start. (5 points; don't forget to justify your answer)\n(c)\nAfter several hours of good fun, you decide to leave the party early\nand spend the rest of the evening at home. Unbeknownst to you, your\nhosts were finding your jokes extremely obnoxious and were about to\n1Also, you know that there is no funny business: no rising up from the dead, no frozen sperm, no\nreplicated DNA, etc.\n\nkick you out just as you left. So, had you instead decided to stay a little\nlonger, you wouldn't have been able to: you would have been forced to\nleave early anyway.\nAccording to the Control Hypothesis, did you act freely in leaving the party\nearly? Is that answer intuitively correct?\n3. To causally explain how event x occurs (or why it occurs) is to describe a sequence\nof causes and effects leading to x's occurrence. The following two questions concern\ncausal explanations.\n(a) On your 21st birthday, an elderly stranger hands you a nautically themed clock.\nThe clock is strikingly beautiful--mesmerizing, even. Many years later, in your\nold age, you travel back in time to your 21st birthday and hand the clock to\nyour younger self.\nOn the basis of the information you have been given so far, is there a causal\nexplanation to be given about how the clock was originally built? If so, spell it\nout. If not, explain why not. (10 points)\n(b) Olivia travels to the past in an effort to kill her grandfather before he has any\nchildren. On pain of contradiction, Olivia will not succeed.2\nOn the basis of the information you have been given so far, is there a causal\nexplanation to be given about why Olivia fails? If so, spell it out. If not, enrich\nthe story so that it entails a suitable explanation. (10 points)\n4. You're wondering whether to study for tomorrow's biology exam. It's a hard exam\nand you won't pass unless you study. Just then you see your good friend Amy emerge\nfrom a time machine. She announces that she's been to the future and has seen you\npass the exam. In fact, she took a picture of the graded exam with her phone. You\nglance at the screen and see an A+ scribbled with a red marker.\nAmy is totally reliable, so you can be 100% confident that you will pass the exam.\nDoes that mean that you'll pass even if you don't study? (10 points; don't forget to\njustify your answer.)\n5. Section 4.3.1 of the course materials discusses a toy model of time travel. The di\nagram below depicts a wormhole within the world of the toy model. The points\nrepresented by W- are identified with the points represented by W+. Particle A\njumps to the future when its spacetime trajectory reaches the wormhole from out\nside the wormhole region; particle B jumps to the past when its spacetime trajectory\nreaches the wormhole from inside the wormhole region.\n2As usual, I am assuming no funny business: no rising up from the dead, no frozen sperm, no replicated\nDNA, etc.\n\nA\nW+\nt\nB\nW\nA\nspace\ntime\nB\nNote that only one particle--particle B--exists at time t, though B experiences time\nt twice. Now consider a different diagram:\ntime\nW+\nW-\nspace\n\nt\nAssuming the laws of the toy model are in place, how many different particles exist\nat time t? (20 points; don't forget to explain your answer)\n6. There is a famous scene in the film The Matrix in which the Oracle predicts that\nNeo will break a vase. (You can find it online by searching \"matrix oracle vase\".3)\n(a) Describe a consistent time travel story that uses time travel to explain how the\nOracle acquires the information necessary to issue her successful prediction. (10\npoints)\n3Or you can go here: https://www.youtube.com/watch?v=eVF4kebiks4\n\n(b) Neo breaks the base after turning back. Does the Control Hypothesis entail\nthat, according to the story you gave in your response to (6a), Neo fails to act\nfreely in turning back? (10 points)\n*\n*\n*\nOptional\nIs contemporary physics compatible with time travel? Alan Guth, who is a famous physicist\nat MIT, tackled this question during a visit to Paradox and Infinity, a few years ago. You\ncan check out his lecture here: https://www.youtube.com/watch?v=t5AwyxCZIwE\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n24.118 Paradox and Infinity\nSpring 2019\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "24.118_S19 Paradox and Infinity, Assignments: Problem Set 5: Newcomb's Problem",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-118-paradox-and-infinity-spring-2019/a219e7c5a3d0203af4274fb446bd9246_MIT24_118S19_ProblemSet5.pdf",
      "content": "24.118: Paradox and Infinity, Spring 2019\nProblem Set 5: Newcomb's Problem\nHow these problems will be graded:\n- In Part I there is no need to justify your answers. Assessment will be\nbased on whether your answers are correct.\n- In Part II you must justify your answers. Assessment will be based both on\nwhether you give the correct answer and on how your answers are justified.\n(In some problem sets I will ask you to answer questions that don't have\nclear answers. In those cases, assessment will be based entirely on the basis\nof how your answer is justified. Even if it is unclear whether your answer is\ncorrect, it should be clear whether or not the reasons you have given in\nsupport of your answer are good ones.)\n- No answer may consist of more than 150 words. Longer answers will\nnot be given credit. (Showing your work in a calculation, a proof, or a\ncomputer program does not count towards the word limit.)\n- You may consult published literature and the web. You must, however,\ncredit all sources. Failure to do so constitutes plagiarism and can have se\nrious consequences. For advice about when and how to credit sources see:\nhttps://integrity.mit.edu/ (You do not need to credit course\nmaterials.)\nNotation:\nA. Evidential Decision Theory\nAccording to Evidential Decision Theorists, the expected value of an option A is the\nweighted average of the values of A's possible outcomes, with weights determined by the\nprobability of the relevant state of affairs, given that you choose A. Formally:\nEV (A) = v(AS1) · p(S1|A) + v(AS2) · p(S2|A) + . . . + v(ASn) · p(Sn|A)\nwhere S1, S2, . . . Sn is any list of (exhaustive and mutually exclusive) states of the world,\nv(ASi) is the value of being in a situation in which you've chosen A and Si is the case, and\np(S|A) is the probability of S, given that you choose A.\nEvidential Decision Theorists endorse the following principle:\nExpected Value Maximization In any decision problem, you ought to choose an option\nwhose expected value is at least as high as that of any rival option.\n\nB. Causal Decision Theory\nCausal Decision Theorists prefer a different way of calculating expected value. To avoid\nconfusion, I shall refer to the causalist's notion as expected causal utility.\nThe expected causal utility of an option A is the weighted average of the values of A's\npossible outcomes, with weights determined by the probability of the following subjunctive\nconditional: were you to perform A, the outcome would come about. Formally:\nECU(A) = v(AS1) · p(A □→ S1) + v(AS2) · p(A □→ S2) + . . . + v(ASn) · p(A □→ Sn)\nwhere S1, S2, . . . Sn is any list of (exhaustive and mutually exclusive) states of the world,\nv(ASi) is the value of being in a situation in which you've chosen A and Si is the case, and\nA □→ Si is the claim that Si would come about were you to perform A.\nNote that in the special case in which each Si (i ≤ n) is a state of the world whose\nobtaining or not is causally independent of action A, A □→ Si is equivalent to Si. So we\nget:\nECU(A) = v(AS1) · p(S1) + v(AS2) · p(S2) + . . . + v(ASn) · p(Sn)\nCausal Decision Theorists endorse the following principle:\nExpected Causal Utility Maximization In any decision problem, you ought to choose\nan option whose expected causal utility is at least as high as that of any rival option.\n(For further discussion of Causal Decision Theory see Section 5.4 of the class textbook.)\nC. Your Value Function\nThroughout the problem set we will assume that you value only money (and value it\nlinearly). Accordingly, you assign value n to a situation in which you net $n.\nPart I\n1. There are two boxes before you, Left Box and Right Box. You have two options:\nLeft Take the contents the Left Box only.\nRight Take the contents the Right Box only.\nPredictor has placed $100 in one of the boxes, but you don't know which. What\nyou do know is that last night Predictor made a prediction about whether you would\nchoose Left or Right. The predictor is your friend: if she predicted Left, she put the\nmoney in Left Box; if she predicted Right, she put the money in Right Box. Predictor\nis 90% reliable:\np(LeftPredicted|Left) = p(RightPredicted|Right) = 0.9\nThe boxes have been filled ahead of time and your choice will not cause their contents\nto change. (So, for example, if Predictor placed the $100 in Left Box, were you to\n\nchoose Left, the money would still be in Left Box, and were you to choose Right, the\nmoney would still be in Left Box. )\n(a) What is the expected value of choosing Left? (5 points)\n(b) Assume that you see yourself as equally likely to choose Left and Right, and\ntherefore that p(LeftPredicted) = p(RightPredicted) = 0.5.1 What is the ex\npected causal utility of choosing Left? (5 points)\nPart II\n2. There are two ways of getting to the concert:\nTaxi Take a taxi.\nCar Drive your car.\nTaking a taxi is expensive (value = -41). Driving there would cost only gas money\n(value = -2), but there might be a robber at the parking lot. If he's there, he'll steal\nyour stereo (value = -130). At home, your stereo is safe.\n(a) Assume that your two options have the same expected value and that the\nrobber's presence in the parking lot is independent of whether you drive (i.e.\np(RobberInLot) = p(RobberInLot|Car)). What is the probability that the rob\nber will be at the parking lot? (10 points; don't forget to justify your answer.)\n(b) Now suppose that the robber has a (perfectly accurate) informant who will tell\nhim whether you'll be driving to the concert. If he's told you're going, he'll be\nthere with probability 80%. If not, he'll be there with probability 50%.\nAccording to the Principle of Expected Value Maximization, should you drive\nor should you take a cab? (10 points; don't forget to justify your answer.)\n3. There are two boxes before you: Open and Closed. Open contains $10 but you cannot\nsee the contents of Closed. You are told, however, that Closed is either completely\nempty or contains $100. You have two options:\nOne-Box Take the contents of Closed and leave the contents of Open behind\nTwo-Box Take the contents of both boxes.\nThe boxes have been filled ahead of time and your choice will not cause their contents\nto change. (So, for example, if Closed contains $100, were you to One-Box, it would\nstill contain $100, and were you to Two-Box, it would still contain $100. )\n1I'll ask you to prove this entailment in Problem Set 6.\n\n(a) There is no predictor. Instead, a fair coin was flipped. If it landed Heads, Closed\nwas filled with the $100; if it landed Tails, Closed was left empty. All of this\nhappened yesterday and your choice will not cause the contents of the boxes to\nchange.\nAccording to the Principle of Expected Value Maximization, should you one-box\nor two-box? (10 points; don't forget to justify your answer.)\n(b) Same setup as (3a). According to the Principle of Expected Causal Utility\nMaximization, should you one-box or should you two-box? (10 points; don't\nforget to justify your answer.)\n(c) Now assume there is a predictor. Yesterday evening, Predictor was enlisted to\nmake a prediction about whether you would one-box or two-box. If Predictor\npredicted that you would one-box, the $100 dollars was placed in Closed. Oth\nerwise, Closed was left empty. The probability that Predictor guesses correctly\nis 60%. The boxes have now been sealed and their contents will not be changed.\nAccording to the Principle of Expected Value Maximization, should you one-box\nor should you two-box? (10 points; don't forget to justify your answer.)\n(d) Same setup as (3c). According to the Principle of Expected Causal Utility\nMaximization, should you one-box or should you two-box? (10 points; don't\nforget to justify your answer.)\n(e) Same setup as (3c), except that this time you learn that Closed has $100.\nAccording to the Principle of Expected Value Maximization, should you one-box\nor should you two-box? (5 points; don't forget to justify your answer.)\n(f) Same setup as (3c), except that this time you learn that Closed has $0.\nAccording to the Principle of Expected Value Maximization, should you one-box\nor should you two-box? (5 points; don't forget to justify your answer.)\n(g) Same setup as (3c), except for the following. It is now time t0 and you have no\nidea whether Closed contains $100 or $0. At a later time t2 you must decide\nwhether to one-box or two-box. At time t1 between t0 and t2 you will learn the\ncontents of Closed.\nAssume that you're certain that you always choose in accordance with the Prin\nciple of Expected Value Maximization. What should you believe at time t0\nabout what your decision at time t2 will be? (10 points; don't forget to justify\nyour answer.)\n(h) Same setup as (3c), except for the following. It is now time t0 and you have no\nidea whether Closed contains $100 or $0. At a later time t2 you must decide\nwhether to one-box or two-box. At time t1 between t0 and t2 you will be offered\nthe chance to learn the contents of Closed.\nAssume that you're certain that you always choose in accordance with the Prin\nciple of Expected Value Maximization. According to the Principle of Expected\nValue Maximization, should you choose, at t1, to learn the contents of Closed\n\nor should you choose to remain ignorant? Is that answer intuitively correct?\n(10 points; don't forget to justify your answer.)\n4. Extra Credit:2 There are two boxes before you, Left Box and Right Box. You have\nthree options:\nLeft Take the contents the Left Box only.\nRight Take the contents the Right Box only.\nCoin Pay $1 for the privilege of flipping a coin. If it lands Heads you keep the\ncontents of Left Box; if it lands Tails, you keep the contents of Right Box.\nPredictor has placed $100 in one of the boxes, but you don't know which. What\nyou do know is that last night Predictor made a prediction about whether you would\nchoose Left, Right, or Coin. Unfortunately for you, the predictor is evil: If she\npredicted Left, she put the money in Right Box; if she predicted Right, she put the\nmoney in Left Box. If she predicted Coin, she flipped a fair coin. If it landed Heads\nshe put the money in Right Box, if it landed Tails, she put the money in Left Box.\nFinally, Predictor is 100% reliable:\np(LeftPredicted|Left) = p(RightPredicted|Right) = p(CoinPredicted|Coin) = 1\nThe boxes have been filled ahead of time, and their contents will not be changed.\n(So, for example, if Predictor placed the $100 in Left Box, were you to choose Left,\nthe money would still be in Left Box, were you to choose Right, the money would\nstill be in Left Box, and were you to pick Coin, the money would still be in Left\nBox.)\n(a) According to the Principle of Expected Value Maximization, which of the three\noptions should you choose? (5 points; don't forget to justify your answer.)\n(b) Assume that you see yourself as equally likely to choose Left, Right, and Coin,\nand therefore that p(LeftPredicted) = p(RightPredicted) = p(CoinPredicted) =\n1/3. According to the Principle of Expected Causal Utility Maximization, which\nof the three options should you choose? (5 points; don't forget to justify your\nanswer.)\n(c) Optional: Think about whether the answer to (4b) is intuitively correct.\n2This example is due to Arif Amhed.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n24.118 Paradox and Infinity\nSpring 2019\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "24.118_S19 Paradox and Infinity, Assignments: Problem Set 6: Probability",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-118-paradox-and-infinity-spring-2019/6ea44ee975900ad1aa8f77bd848b5d7a_MIT24_118S19_ProblemSet6.pdf",
      "content": "24.118: Paradox and Infinity, Spring 2019\nProblem Set 6: Probability\nHow these problems will be graded:\n- In Part I there is no need to justify your answers. Assessment will be\nbased on whether your answers are correct.\n- In Part II you must justify your answers. Assessment will be based both on\nwhether you give the correct answer and on how your answers are justified.\n(In some problem sets I will ask you to answer questions that don't have\nclear answers. In those cases, assessment will be based entirely on the basis\nof how your answer is justified. Even if it is unclear whether your answer is\ncorrect, it should be clear whether or not the reasons you have given in\nsupport of your answer are good ones.)\n- No answer may consist of more than 150 words. Longer answers will\nnot be given credit. (Showing your work in a calculation, a proof, or a\ncomputer program does not count towards the word limit.)\n- You may consult published literature and the web. You must, however,\ncredit all sources. Failure to do so constitutes plagiarism and can have se\nrious consequences. For advice about when and how to credit sources see:\nhttps://integrity.mit.edu/ (You do not need to credit course materials.)\nPreliminaries\nRecall that a probability function, p(. . .), is an assignment of real numbers between 0\nand 1 to propositions that satisfies the following two coherence conditions:\nNecessity p(A) = 1 whenever A is a necessary truth\nAdditivity p(A ∨ B) = p(A) + p(B) whenever A and B are incompatible propositions\nWe take logically equivalent sentences to express the same proposition, which means that\n\"p(A) = p(B)\" is true whenever A and B are logically equivalent. (So, for instance,\np(A) = p(AB ∨ AB).)\nThroughout this problem set, we will assume that the credence function of a rational\nagent is always a probability function, and always satisfies the following principle:\nBayes' Law p(AB) = p(A) · p(B|A)\nIn addition, we will assume the following:\n\nUpdate by Conditionalization If S is rational, she will update her credences as follows,\nupon learning that B:\nnew(A) = p old(A|B)\np\nwhere pold is the function describing S's credences before she learned that B, and\npnew is the function describing her credences after she learned that B.\nFinally, we will assume the following connection between objective and subjective proba\nbilities:\nThe Objective-Subjective Connection The objective probability of A at time t is the\nsubjective probability that a perfectly rational agent would assign to A, if she had\nperfect information about the way the world is before t and no information about\nthe way the world is after t. 1\nIt'd be nice if we could also assume the Principle of Indifference:\nPrinciple of Indifference Consider a set of propositions and suppose one knows that\nexactly one of them is true. Suppose, moreover, that one has no more reason to\nbelieve any one of them than any other. Then, insofar as one is rational, one should\nassign equal credence to each proposition in the set.\nBut, as you may recall from Section 6.2.4 of the lecture notes, the Principle of Indifference\nleads to absurd results. At the same time, it's not clear what to put in its place. So we'll\nleave it in place warily: we'll try not to use it, but we will if we must.\nLogical Notation\n- A is the negation of A;\n- AB is the conjunction of A and B;\n- A ∨ B is the disjunction of A and B.\nPart I\n[No Questions in Part I. Go straight to Part II.]\n1Nerdy observation: Here I am tacitly presupposing that a perfectly rational agent is always certain\nabout the objective probabilities at t, given full information about how the world is before t. So, in\nparticular, for each complete history of the world up to t, Ht, there is a specification Pt of the objective\nprobabilities at t such that the agent treats Ht and H1Pt as equivalent. This assumption is potentially\ncontroversial but adds simplicity to our discussion.\n\nPart II\n1. Assume p(B|A) = p(B|A) and p(A) = p(A). Use Bayes' Law and the fact that\np(. . . ) is a probability function to prove each of the following results. You must\ndisplay every step of your proofs. Earlier results may be used in your proofs of later\nresults. (5 points each)\n(a) p(BA) = p(B A)\n(b) p(C|A) = 1 - p(C|A), for arbitrary C\n(c) p(BA) = p(BA)\n(d) p(B) = p(B)\n2. For each of the questions below, there is only one right answer. Half of your grade\nwill be determined by whether the given answer is correct. The other half will depend\non whether you are able to justify your answer using one or more of the principles\nmentioned in \"Preliminaries\". Do your best to make your justification water-tight.\nIf you don't succeed, then at least make sure that you identify the right principles\nfrom \"Preliminaries\" and use them sensibly. Since the Principle of Indifference leads\nto absurd results, use it only as a last resort.\n(a) Let x be a particle of 235U. What credence should you assign to the proposition\nthat x will decay sometime within the next 7.04 · 108 years? The half life of 235U\nis 7.04 · 108 years. (10 points)\n(b) A standard deck of 52 cards has been thoroughly shuffled. What is the objective\nprobability that the card at the top of the deck is the three of hearts? (10 points)\n(c) Assuming you have no information beyond what's stated in (2b) (and basic\nbackground information), what credence should you assign to the proposition\nthat the card at the top of the deck is the three of hearts? (10 points)\n(d) As in (2b), except that this time a time traveler informs you that she has seen\nthe card at the top of the deck being drawn and that it is, indeed, the three\nof hearts. Assume that there is no funny business going on (e.g. no slight of\nhand) and that the time-traveller is completely reliable. What is the objective\nprobability that the card at the top of the deck is the three of hearts? (10 points)\n(e) As in (2d). What should be your credence in the proposition that the card\nat the top of the deck is the three of hearts? (You may assume that you are\ncertain that there is no funny business going on and that the time-traveller is\ncompletely reliable.) (10 points)\n3. An urn is filled using the following procedure. At each time ti (0 ≤ i ≤ 2), two coins\nare tossed. The first toss is used to decide what kind of object to add to the urn: a\nmarble or a die. The second toss is used to decide the color of the selected object:\n\nblack or white. At the end of the process, there are three objects in the box, each a\nmarble or a die, each black or white.\nFor each of the questions below, make sure you justify your answers using the as\nsumptions listed in \"Preliminaries\".\n(a) What should be your initial credence in the proposition that every die in the\nurn is black (equivalently: the proposition that no object in the urn is a white\ndie)? (5 points)\n(b) Your friend draws an object at random from the urn, looks at it, and places it\nback in the urn. She informs you that the object she looked at is a die, but she\ndoes not clarify whether it's black or white. You are certain that your friend\nspeaks truly. What should your updated credence be in the proposition that\nevery die in the urn is black? (5 points)\n(c) Suppose your friend had made a different announcement in the situation de\nscribed in (3b). Rather than announcing that she drew a die, she announces\nthat she drew a white marble. As before, you are certain that she speaks truly.\nWhat should your updated credence be in the proposition that every die in the\nurn is black? (5 points)\n4. A fair coin will be tossed until it lands heads. If the coin lands heads on the nth toss,\nyou get $2n . (If the coin never lands Heads, no money exchanges hands.)\n(a) What is the expected dollar value of playing the game? (5 points)\n(b) A standard assumption in decision theory is that if the expected dollar value\nof an option is greater than $m, then you should be willing to pay $m for the\nprivilege of taking that option. On this assumption, how much should one be\nwilling to pay for the privilege of playing the game? (5 points)\n(c) Does the standard assumption above deliver the right result in this case? If\nso, explain why. If not, explain what is wrong with the standard assumption?\n(5 points)\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n24.118 Paradox and Infinity\nSpring 2019\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "24.118_S19 Paradox and Infinity, Assignments: Problem Sets 7 and 8",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-118-paradox-and-infinity-spring-2019/a8b7148022fe3edcdce0b25266e1e1c6_MIT24_118S19_ProblemSets7_and_8.pdf",
      "content": "24.118: Paradox and Infinity, Spring 2019\nProblem Sets 7 and 8: Non-Measurable Sets\nHow these problems will be graded:\n- In Part I there is no need to justify your answers. Assessment will be\nbased on whether your answers are correct.\n- In Part II you must justify your answers. Assessment will be based both on\nwhether you give the correct answer and on how your answers are justified.\n(In some problem sets I will ask you to answer questions that don't have\nclear answers. In those cases, assessment will be based entirely on the basis\nof how your answer is justified. Even if it is unclear whether your answer is\ncorrect, it should be clear whether or not the reasons you have given in\nsupport of your answer are good ones.)\n- No answer may consist of more than 150 words. Longer answers will\nnot be given credit. (Showing your work in a calculation, a proof, or a\ncomputer program does not count towards the word limit.)\n- You may consult published literature and the web. You must, however,\ncredit all sources. Failure to do so constitutes plagiarism and can have se\nrious consequences. For advice about when and how to credit sources see:\nhttps://integrity.mit.edu (You do not need to credit course materials.)\nPreliminaries\nThe line segment [a, b] is the set of real numbers x such that a ≤ x ≤ b. The Borel Sets\nare the members of the smallest set B such that: (i) every line segment is in B, (ii) if a\nset A is in B, then so is R - A, and (iii) if a countable family of sets is in B, then so is\nits union.\nThe Lebesgue Measure, λ, is the unique function on the Borel Sets that satisfies these\nthree conditions:\nLength on Segments λ([a, b]) = b - a for every a, b ∈ R.\nCountable Additivity\n[\n\nλ\n{A1, A2, A3, . . .} = λ(A1) + λ(A2) + λ(A3) + . . .\nwhenever A1, A2, . . . is a countable family of disjoint sets for each of which λ is\ndefined.\nNon-Negativity λ(A) is either a non-negative real number or the infinite value inf, for\nany set A in the domain of λ.\n\nPart I\n1. Of each of the following sets of real numbers, determine whether it is a Borel Set. If\nit is a Borel Set, specify its Lebesgue Measure. (You may assume that every Borel\nSet has a Lebesgue Measure.) (2 points each)\n\n(a)\n,\n(b) {\n\n}\n, 1\n\n(c)\n\n- [\n(d)\n]\n,\n,\n\n(f) {0, 1, 2, . . . }\n\n-{3\n1}\n(e)\n,\n,\n∪\n(g)\n,\n1 , 22 , 23 , . . .\n\n-\n21 , 22 , 23 , . . .\n(h) 0, 2\n(i) a Vitali set\n(j) the complement of a Vitali set\n(As usual, [a, b] = {x : a ≤ x ≤ b} and [a, b) = {x : a ≤ x < b}.)\nPart II\n2. Choosing Socks, Choosing Shoes\nRecall that a choice set for set A is a set containing exactly one element from each\nmember of A. And recall the Axiom of Choice:\nAxiom of Choice Any set of non-empty, non-overlapping sets has a choice set.\nOn a first reading, the Axiom of Choice is likely to sound trivial. This exercise is\naimed at helping you understand why it is not. (It is a variant of an explanation\ngiven long ago by British philosopher Bertrand Russell.)\nHere are two standard set-theoretic axioms:\nS\nUnion If a set A exists, then so does its union,\nA.\nS\n(Recall that\nA is the set {x : x is a member of some element of A}, i.e. the\nset of members of members of A.)\nSeparation Let φ(x) be any formula of the form \"x is such and such\" (for instance,\n\"x is a natural number\"). Then if set A exists, the following set also exists:\n{x : x ∈ A and φ(x)} (i.e. the set of objects that are members of A and satisfy\ncondition φ(x)).\n\nHere is an example of how Separation might be used. Let φ(x) be the formula \"x is\nfemale\". Separation entails that if the set O = {x : x is an octopus} exists, so does\n{x : x ∈ O and x is female}\nwhich is the set of female octopuses.\n(a) Let S be an infinite set, each member of which is a set of two shoes: a right\nshoe and a left shoe. Assume that no two elements of S have any shoes in\ncommon. Now suppose you'd like to have a choice set for S. The Axiom\nof Choice guarantees that a choice set exists, but it doesn't give you much\ninformation about what it looks like.\nS\nLet's see if we can do better than that. It follows from Union that\nS exists.\nS\nIs there an application of Separation to\nS that delivers a choice set for S? If\nso, sketch a proof. If not, explain informally why not. (5 points)\n(b) Let S be an infinite set, each member of which is a set of two socks. We will\nassume that all socks are alike, and, in particular, that there is no such thing\nas a \"right\" sock or a \"left\" sock. (We will also assume, unrealistically, that\nsocks are not located in space and therefore that socks cannot be distinguished\nby their spatial locations.) Assume that no two elements of S have any socks\nin common. Now suppose you'd like to have a choice set for S. The Axiom\nof Choice guarantees that a choice set exists, but it doesn't give you much\ninformation about what it looks like.\nS\nLet's see if we can do better than that. It follows from Union that\nS exists.\nS\nIs there an application of Separation to\nS that delivers a choice set for S? If\nso, sketch a proof. If not, explain informally why not. (5 points)\n3. Back to Bacon\nThis problem is about Bacon's Puzzle, which is discussed in Section 3.4 of the text\nbook. (Before reading further, you might consider having a look at the text, to\nrefresh your memory of the puzzle.)\nTowards the end of the discussion in the book, I write:\nWhat is the probability that an individual who follows the strategy will an\nswer correctly? I don't know the answer to this question but I suspect that\nwhen one follows the strategy one's probability of success is best thought\nof ill-defined. (Section 3.4.9)\nThroughout this problem, I will explain why I harbor such suspicions.\nLet S be the set of all functions from N to {0, 1}. We partition S into orbits, as\nfollows: for any f, g ∈ S, f is in the same orbit as g if and only if there are at most\nfinitely many numbers k such that f(k) 6= g(k).\n\n(a) Let f0(n) = 0 for each n ∈ N, and let O0 be f0's orbit. Describe a bijection μ0\nfrom N to O0. (5 points)\n(b) Given an arbitrary orbit O and a function f ∗ ∈ O, describe a bijection μ from\nN to O. (5 points)\nThe lesson of problem (3b) is that any representative from a given orbit can be used\nto define a well-ordering of that orbit.\nLet us now consider the problem of how one might go about choosing a representative\nfrom each orbit. Ask yourself: is the set of orbits analogous to the set of pairs of\nshoes of problem (2a), or is it analogous to the set of pairs of socks of problem (2b)?\nIn other words: is there a formula φ(x) such that an application of Separation based\non φ(x) could be used to specify a set that contains exactly one representative for\neach orbit?\nAs it turns out, the answer to this question is \"no\". It is impossible to set forth an\nexplicit rule that singles out exactly one representative from each orbit: the only way\nto show that a set of representatives exists is to use the Axiom of Choice.\n(c) Extra Credit: Show that one cannot prove that a set with exactly one repre\nsentative from each orbit exists without using the Axiom of Choice. You may\navail yourself of the following important result, due to Robert Solovey: one\ncannot prove that a non-measurable set exists without using Axiom of Choice.\n(5 points)\nBack to Bacon's Puzzle. The question we wish to consider is: what is the probability\nthat an individual who follows the strategy will answer correctly? To fix ideas, let\nthe individual in question be P0 and assume that she has been given a blue hat. Let\nthe function f@ represent the actual distribution of hats and let O@ be f@'s orbit.\nThen our question can be reformulated as follows: what is the probability that orbit\nO@ was assigned a representative ρ such that ρ(0) = 1?\nIn fact, there is a natural way of answering this question, relative to a well-ordering\nof O@. Let μ be a bijection from N to O@. Then μ can be used to characterize the\nfollowing probability function:\n|Z ∩{μ(0), μ(1), . . . , μ(n)}|\np(Z)\n= df\nlim\nn→inf\n|{μ(0), μ(1), . . . μ(n)}|\n(Here Z is a subset of O@. If you'd like a refresher on this type of probability function,\nsee Section 6.4.1.2 of the textbook.)\nLet X be the proposition that O@ was assigned a representative ρ such that ρ(0) = 1.\n(Formally: X = {f ∈ O@ : f(0) = 1}.) In the next couple of questions I'll ask you\nto calculate the value of p(X) relative to different orderings.\n\n(d) Suppose that O@ is orbit O0 from problem (3a) and that μ is the bijection μ0\nyou gave in your answer to (3a). What is the value of p(X)? (5 points)\n(e) For a given integer k ≥ 2, define a bijection μ from N to O0 such that p(X) = k\n1 .\n(10 points)\nAs problem (3e) suggests, you can get p(X) to have any value you want, by picking\na sufficiently devious μ. So the probability function p(. . . ) can only be assumed to\nassign a sensible probability to proposition X if it is defined using a sensible choice\nof μ.\nWhen it comes to particular orbits, you may well think that there are choices of μ\nthat stand out as particularly natural. Perhaps you think that when it comes to the\nspecific orbit O0 of problem (3a), the choice of μ0 that you supplied in your answer\nis a particularly natural way of ordering O0. (Maybe it even delivers the comforting\nresult that p(X) = 0.5.)\nBut what about the general case? Is there a general recipe that can be used to\nspecify a natural ordering of each of our uncountably many orbits. Unfortunately,\nthe answer is \"no\":\n(f) Show that it is impossible to explicitly characterize a relation < such that each\norbit O is well-ordered by <. You may make use of problem (3c). (10 points)\nIn the absence of a recipe for specifying a natural ordering for each orbit, I have\nno idea how one might go about characterizing sensible probability functions over\nthe members of our orbits. That's why I suspect that the probability of success in\nBacon's Puzzle, given that one follows the strategy, is not, in general, well-defined.\n4. The Square of Evil 1\nSay that a countable ordinal is an ordinal with countably many members, and let\nא1 be the set of all countable ordinals. א1 is itself an ordinal. From this it follows\nthat א1 must have uncountably many members. (For suppose otherwise, then א1 is\na countable ordinal, and therefore a member of itself. But no ordinal is a member of\nitself.)\nThink of the Continuum Hypothesis as the claim that א1 has the same cardinality\nas [0,1], and therefore that there is a bijection f from [0,1] to א1. Assume that the\nContinuum Hypothesis is true, and define the following ordering <e of [0,1]:\nfor any a, b ∈ [0, 1], a <e b if and only if f(a) ∈ f(b)\nSince the ordinals in א1 are well-ordered by ∈, it is an immediate consequence of this\ndefinition that <e is a well-ordering of [0,1].\n1The construction is due to the Polish mathematician Wac law Sierpi nski. I learned about it in Frank\nArntzenius, Adam Elga and John Hawthorne's \"Bayesianism, Infinite Decisions, and Binding\".\n\n(a) Show that <e has the following additional property: for each x ∈ [0, 1], there\nare at most countably many y ∈ [0, 1] such that y <e x. (5 points)\nWe will now use <e to color the unit square [0,1]×[0,1], using the following criterion:\nFor each point hx, yi ∈ [0, 1] × [0, 1], color hx, yi white if x <e y, and black\notherwise.\nI will refer to the colored square as the Square of Evil. Now let hx0, y0i be a\nparticular point on the Square of Evil:\n(b) How many white points are there in the row {hz, y0i : z ∈ [0, 1]}? (5 points)\n(c) How many white points are there in the column {hx0, zi : z ∈ [0, 1]}? (5 points)\nSuppose that a point is selected at random from the Square of Evil. (It is selected by\ntwice applying the Standard Coin Toss Procedure of Section 7.1.4.1 of the reading\nmaterials, once to pick an x coordinate, and once to pick a y coordinate.)\n(d) Someone tells you which row the selected point is in, and asks you to bet on\nwhether the selected point is black or white. How should you bet? (5 points)\n(e) Someone tells you which column the selected point is in, and asks you to bet on\nwhether the selected point is black or white. How should you bet? (5 points)\nIt will rain or snow, but you don't know which. If it rains, you should wear outfit A\nrather than outfit B. If it snows, you should also wear outfit A rather than outfit B.\nSo you should wear outfit A!\nHere is a generalization of that seemingly attractive idea:\nDominance Let Π be a set of possible states of the world over which you have no\ncontrol. You know that exactly one member of Π obtains, but you don't know\nwhich. Suppose you have two options, A and B. Suppose, moreover, that for\neach π ∈ Π you should choose A over B on the assumption that π obtains. Then\nyou should choose A over B.\n(f) Use the Square of Evil to show that Dominance is false. (10 points)\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n24.118 Paradox and Infinity\nSpring 2019\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "24.119_S19 Paradox and Infinity, Assignments: Problem Set 9: Computability",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-118-paradox-and-infinity-spring-2019/b44693acc08784dcd876844d312b497a_MIT24_118S19_ProblemSet9.pdf",
      "content": "24.118: Paradox and Infinity, Spring 2019\nProblem Set 9: Computability\nHow these problems will be graded:\n- In Part I there is no need to justify your answers. Assessment will be\nbased on whether your answers are correct.\n- In Part II you must justify your answers. Assessment will be based both on\nwhether you give the correct answer and on how your answers are justified.\n(In some problem sets I will ask you to answer questions that don't have\nclear answers. In those cases, assessment will be based entirely on you\njustification. Even if it is unclear whether your answer is correct, it should\nbe clear whether or not the reasons you have given in support of your\nanswer are good ones.)\n- No answer may consist of more than 150 words. Longer answers will\nnot be given credit. (Showing your work in a calculation, a proof, or a\ncomputer program does not count towards the word limit.)\n- You may consult published literature and the web. You must, however,\ncredit all sources. Failure to do so constitutes plagiarism and can have se\nrious consequences. For advice about when and how to credit sources see:\nhttps://integrity.mit.edu (You do not need to credit course materials.)\nImportant: Answers that call for a Turing Machine program will only be given credit\nif they are submitted as part of a PDF whose code can be copied and pasted onto\nthe following simulator: morphett.info/turing/turing.html. Please test\nyour PDF using Adobe's Acrobat Reader before submitting it, by making sure your\ncode works as intended after being copied and pasted into the simulator. (LATEX\nusers might consider using the \"verbatim\" environment, or an environment intended\nfor computer code.)\nPart I\n1. The aim of this problem is to get you to think about how to code Turing Machines\nas natural numbers. Please use the coding system described in Section 9.1.5 of the\ntextbook.\n(a)\ni. Which natural number codes the following Turing Machine? (5 points)\n0 _ _ l 1\nii. Give an informal description of the behavior of that Turing Machine, when\nrun on an empty input. (2 points)\n\n(b)\ni. Which Turing Machine is coded by the number 11,550? (5 points)\nii. Give an informal description of the behavior of that Turing Machine, when\nrun on an empty input. (2 points)\n(c) Could there be a function f such that, for distinct numbers n and m, n and m\nboth code Turing Machines that compute f? (6 points)\n2. Ternary notation is to 3 what decimal notation is to 10 and what binary notation is\nto 2. In other words: one works with three digits (\"0\", \"1\", and \"2\") and lets the\nstring \"dk . . . d1d0 \" refer to the number d0 · 30 + d1 · 31 · · · · · dk · 3k .\nDesign a Turing Machine that does the following: when given as input a natural\nnumber n ≥ 1 in ternary notation, followed by a blank, followed by natural number\nm ≥ 1 in ternary notation, it halts with the number n + m in ternary notation on\nan otherwise blank tape.\nHere is an example, to illustrate how your Turing Machine ought to work. Suppose\nn = 47 and m = 64. In ternary notation, \"1202\" refers to the number 47 and \"2101\"\nrefers to the number 64. So your machine should start out with the following string\nof symbols on an otherwise blank tape:\n1202 2101\nSince 47 + 64 = 111 (and since, in ternary notation, \"11010\" refers to the number\n111), your Turing Machine should halt with the following string of symbols on an\notherwise blank tape:\nAnd, of course, you want this to work for arbitrary n and m. You may use auxiliary\nsymbols, if you need them. (5 points)\n3. Suppose you're interested in minimizing the number of states required by your Turing\nMachine. One strategy is to come up with a clever algorithm. Another strategy is\nto start with an algorithm that requires many states and bring down the number of\nstates by increasing the number of auxiliary symbols that your Turing Machine is\nallowed to print on the tape. Use either of these strategies (or a combination of the\ntwo) to solve the following problems. Your Turing Machines are allowed to use as\nmany auxiliary symbols as they need. (10 points each)\n(a) Design a Turing Machine that has no more than two states and behaves as\nfollows: whenever it is given a sequence of n ones as input (n > 0), it halts with\na sequence of n ones, followed by a blank, followed by a one, with the reader\npositioned at the left-most one of the initial sequence.\n(b) Design a Turing Machine that has no more than two states and behaves as\nfollows: for some n ≥ 20, when run on an empty input, it halts with at least\nn cells of the tape containing non-blanks. (No need to worry about where the\nreader ends up.)\n\n(c) Design a Turing Machine that has no more than two states and behaves as\nfollows: when given as input a natural number n ≥ 1 in binary notation, it\nhalts with the number 4n + 3 in binary notation on an otherwise blank tape.\n(No need to worry about where the reader ends up.)\nPart II\n4. The following questions are meant to get you to think about the Halting Function.\nFor each of the descriptions below, determine whether there could be a Turing Ma\nchine satisfying that description. (5 points each; don't forget to justify your answers)\n(a) A Turing Machine M that behaves as follows when given the code of a Turing\nMachine M 0 as input:\n- If M 0 halts when run on an empty input, M halts.\n- If M 0 doesn't halt when run on an empty input, M doesn't halt\n(b) A Turing Machine M that behaves as follows when given the code of a Turing\nMachine M 0 as input:\n- If M 0 halts when run on an empty input, M outputs a 1\n- If M 0 doesn't halt when run on an empty input, M outputs a 0\n(c) For a given Turing Machine M 0 , a Turing Machine M that behaves as follows\non an empty input:\n- If M 0 halts when run on an empty input, M outputs a 1\n- If M 0 doesn't halt when run on an empty input, M outputs a 0\n5. Section 9.2.2 of the textbook contains a proof that the Busy Beaver function is not\nTuring-computable. The following problems are aimed at getting you to think about\nthat proof. (5 points each; don't forget to justify your answers.)\n(a) For k an arbitrary positive integer, design a (one-symbol) Turing Machine that\ndoes the following, given an empty input: it produces a sequence of k ones,\nbrings the reader to the beginning of the sequence, and halts. Please make sure\nyour machine has k + C states for some constant C. 1\n(b) Design a (one-symbol) Turing machine that does the following, given a sequence\nof n ones as input: it produces a sequence of 2n ones, brings the reader to the\nbeginning of the sequence, and halts.\n(c) Design a (one-symbol) Turing machine that does the following, given a sequence\nof n ones as input: it produces a sequence of n + 1 ones, brings the reader to\nthe beginning of the sequence, and halts.\n1This condition is not required to prove that the Busy Beaver function is not Turing-computable, but\nit'll simplify our discussion below.\n\n(d) The proof in Section 9.2.2 of textbook works with a hypothetical Turing Machine\nM I . The characterization of M I presupposes a Turing Machine M BB , which\ncomputes the Busy Beaver Function. Since the Busy Beaver Function is not\nTuring-Computable, M BB doesn't actually exist (and so neither does M I ). For\nthe purposes of this exercise, however, I'd like you to pretend that M BB does\nexist, and has the following program:\n; fake version of BB machine\n0 _ _ l 1\n0 1 1 r 0\n1 _ _ r halt\n1 1 1 l 1\nUse this pretense, together with your answers to problems (5a)-(5c), to explicitly\nwrite out a program for M I for the special case in which k = 3.\n(Request: as a courtesy to your TA, please annotate your program so as to make\nit easy to understand which parts of your code correspond to the fake version\nof M BB above and which correspond to your answers to problems (5a)-(5c).)\n(e) Your answer to (5d) is a Turing Machine program. Count the states in that\nprogram. Now assume that instead of working on the assumption that k = 3,\nyou had been asked to work with an arbitrarily given k. How many states would\nyour code for M I have had in that case, as a function of k?\n(Hint: your answer should be of the form k + C for some constant C.)\n(f) If the two-state machine I supplied in problem (5d) had really computed the\nBusy Beaver Function, then your code for M I would have computed the function\nBB(2k)+1. So your code would have been more productive--by one--than the\nmost productive Turing Machine with 2k states or fewer. How big must k be\nin order for your code for M I to have 2k states or fewer (and therefore be more\nproductive--by one--than it could possibly be)?\n(Hint: Your answer to problem (5e) should be of the form k + C for some\nconstant C. Your answer to the present question should be of the form k ≥ X,\nwhere X is specified using the value you used for C in (5e).)\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n24.118 Paradox and Infinity\nSpring 2019\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "24.118_S19 Paradox and Infinity, Lecture Note 1: The Cantorian Theory of Size I",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-118-paradox-and-infinity-spring-2019/80ae247f208a2d0027ab2f23fb4f5172_MIT24_118S19_LecNote1.pdf",
      "content": "The Cantorian Theory of Size\nBasic Definitions\nCardinality |A| is the size of set A.\nBijection Principle |A| = |B| iff there is a bijection from A to B.\nInjection Principle |A| ≤|B| iff there is an injection A to B.\nExtended Definitions\nNotation\nHow it's defined\nInformal notion\n|A| = |B|\nbijection from A to B\njust as many members in A as in B\n|A| ≤|B|\ninjection from A to B\nat most as many members in A as in B\n|A| < |B|\n|A| ≤ |B| and |A| 6= |B|\nfewer members in A than in B\n|A| ≥|B|\n|B| ≤|A|\nat least as many members in A as in B\n|A| > |B|\n|A| ≥|B| and |A| 6= |B|\nmore members in A than in B\nProperties of ≤\nReflexivity |A| ≤|A|\nAnti-symmetry If |A| ≤|B| and |B| ≤|A|, then |A| = |B|\nTransitivity If |A| ≤|B| and |B| ≤|C|, then |A| ≤|C|\nTotality∗ For any sets A and B, either |A| ≤|B| or |B| ≤|A|\n∗One can only prove Totality if one assumes a controversial set-theoretic axiom: the\nAxiom of Choice. We'll come across this axiom again. Stay tuned!\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n24.118 Paradox and Infinity\nSpring 2019\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "24.118_S19 Paradox and Infinity, Lecture Note 10: Newcomb's Problem",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-118-paradox-and-infinity-spring-2019/3722760445cd1211032055601b780639_MIT24_118S19_LecNote10.pdf",
      "content": "Newcomb's Problem\nThe Problem\nThere are two boxes. The transparent box contains $1K; you're not sure what\nthe opaque box contains but it's either $0 or $1M. You have two choices:\nTwo-Box Keep both boxes.\nOne-Box Keep the large box; leave the small box behind.\nThe boxes were sealed before you entered the room, and your choice will not\ncause their contents to change. How should you choose?\nA Predictor\nThe contents of the box were selected by a predictor, who is known to be\n99% accurate:\nPrediction Opaque Box Transparent Box\nOne-Box\n$1M\n$1K\nTwo-Box\n$0\n$1K\nAs before, the boxes were sealed before you entered the room, and your choice\nwill not cause their contents to change. How should you choose?\n- Wait! Could there even be such a predictor?\nA Case for One-Boxing\n- if you one-box, it is almost certain (99%) that the large box will contain\na million dollars;\n- if you two-box, it is almost certain (99%) that the large box will be\nempty.\n\nA Case for Two-Boxing\n- If the large box is empty, you'll be better off if you two-box than if you\none-box.\n- If the large box is full, you'll be better off if you two-box than if you\none-box.\nDecision Theory\nyour options + your probabilities + your values -→ a recommendation\nExpected Value Maximization Choose an option whose expected value\nis at least as high as that of any rival option.\nThe expected value of an option A is the weighted average of the value of\nthe outcomes that A might lead to, with weights determined by the proba\nbility of the relevant state of affairs, given that you choose A.\n5.1\nFormally Speaking. . .\nEV (A) = v(AS1) · p(S1|A) + . . . + v(ASn) · p(Sn|A)\n- S1, S2, . . . Sn is any list of (exhaustive and mutually exclusive) states of\nthe world;\n- v(ASi) is the value of being in a situation in which you've chosen A\nand Si is the case;\n- p(S|A) is the probability of S, given that you choose A.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n24.118 Paradox and Infinity\nSpring 2019\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "24.118_S19 Paradox and Infinity, Lecture Note 11: Probability, Subjective and Objective",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-118-paradox-and-infinity-spring-2019/68ebfa77b3f1a3776e7204e9823ebf46_MIT24_118S19_LecNote11.pdf",
      "content": "Probability, Subjective and Objective\nTwo Kinds of Probability\nSubjective Probability A person's subjective probability in p is the degree\nto which she is confident in p.\nExample: Jones's subjective probability that it'll rain tomorrow is 0.3\nbecause she is 30% confident that it'll rain tomorrow.\nObjective Probability The objective probability of an event is meant to\nbe a feature of the world that does not depend on the beliefs of any\nparticular subject.\nExample: the objective probability that a particle of 256Sg will decay\nin the next 8.9 seconds is 50%.\nHow are they related?\nThe Objective-Subjective Connection The objective probability of A\nat time t is the subjective probability that a perfectly rational agent\nwould assign to A, if she had perfect information about the world at\ntimes ≤ t and no information about the world at times > t. 1\nSubjective Probability\nA credence function for subject S is a function that assigns to each propo\nsition a real number between 0 and 1, representing S's degree of confindence\nin that proposition\nWhat does it take for a credence function to be rational?\n1. internal coherence;\n1Here I am tacitly presupposing that a perfectly rational agent is always certain about\nthe objective probabilities at t, given full information about how the world is before t. So,\nin particular, for each complete history of the world up to t, Ht, there is a specification Pt\nof the objective probabilities at t such that the agent treats Ht and HtPt as equivalent.\n(This assumption is potentially controversial but adds simplicity to our discussion.)\n\n2. update by conditionalization;\n3. Bayes' Law;\n4. the Principle of Indifference.\n3.1\nInternal Coherence\nFor a credence function to be internally coherent is for it to constitute a\nprobability function.\nA probability function, p(. . .), is an assignment of real numbers between\n0 and 1 to propositions that satisfies the following two coherence conditions:\nNecessity p(A) = 1 whenever A is a necessary truth\nAdditivity p(A or B) = p(A) + p(B) whenever A and B are incompatible\npropositions\n3.2\nUpdate by Conditionalization\nIf S is rational, she will update here credences as follows upon learning\nthat B:\nnew(A) = p old(A|B)\np\nwhere pold is the function describing S's credences before she learned\nthat B, and pnew is the function describing her credences after she\nlearned that B.\n3.3\nBayes' Law\np(AB) = p(A) · p(B|A)\n3.4\nThe Principle of Indifference\nHere's what we'd like to have in place:\nPrinciple of Indifference Consider a set of propositions and suppose one\nknows that exactly one of them is true. Suppose, moreover, that one\nhas no more reason to believe any one of them than any other. Then,\ninsofar as one is rational, one should assign equal credence to each\nproposition in the set.\n\nUnfortunately, this principle leads to inconsistency as stated. For instance:\nA factory produces cubes with a side-length l ≤ 1. What is the\n2]?\nprobability that l ∈ (0,\nArgument 1 (length):\n∈\n])\n(l\n(\n= p\n- There is just as much reason to think that l ∈ (0, ] as there\nis to think that l ∈ ( , 1].\n- By the Principle of Indifference, p(l ∈ (0,\n, 1]).\n- So p(l ∈ (0, 1\n2]) = 1\n2.\nArgument 2 (area):\n∈\n])\n(\n(\n= p a\n- There is just as much reason to think that a ∈ (0, ] as there\nis to think that a ∈ ( , 1].\n- By the Principle of Indifference, p(a ∈ (0,\n, 1]).\n2]) = 1\n2.\n- So p(a ∈ (0,\n4].\nBut wait! l ∈ (0, ] ↔ a ∈ (0,\nObjective Probability\nBy the Objective-Subjective Connection, our conclusions about rational sub\njective probability deliver tell us that the objective probabilities:\n1. constitute a probability function;\n2. update by an analogue of conditionalization;\n3. satisfy Bayes' Law;\n4. [satisfy a Principle of Indifference?].\n\nYes, but what is objective probability?\n5.1\nFrequentism\nWhat is it for the objective probability of a coin's landing Heads2 to be 50%?\n- According to frequentism, it is for 50% of coin tosses to land Heads.\n- According to hypothetical frequentism, it is for the following sub\njunctive conditional to be true: if sufficiently many coin tosses took\nplace, 50% of them would land Heads.\n5.2\nThe Law of Large Numbers\nUpon reflection, frequentism is obviously incorrect. What is true is this:\nIf the coin were tossed a sufficiently large number of times, then it\nwould with very high probability land Heads approximately 50%\nof the time.\nMore generally and precisely:\nLaw of Large Numbers Suppose that events of type T have a probability\nof p of resulting in outcome O. Then, for any real numbers ε and δ\nlarger than zero, there is an N such that the following will be true with\na probability of at least 1 - ε:\nIf M>N events of type T occur, the proportion of them that\nresult in outcome O will be p ± δ.\n5.3\nRationalism\n- According to rationalism, there is nothing more to objective proba\nbility than the Objective-Subjective Connection.\n- A localist agrees with rationalism and adds that the the objective\nprobabilities are only well-defined in certain special circumstances; in\nparticular, circumstances in which there is an unproblematic way of\ndeploying a Principle of Indifference.\n2Think of a \"coin toss\" as the result of observing a particle of 256Sg for 8.9 seconds. If\nthe particle decays within that period, our \"coin\" is said to have landed Heads; otherwise\nit is said to have landed Tails.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n24.118 Paradox and Infinity\nSpring 2019\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "24.118_S19 Paradox and Infinity, Lecture Note 12: Countable Additivity",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-118-paradox-and-infinity-spring-2019/cf8489f945f3bdb332b8e4b28321a3c2_MIT24_118S19_LecNote12.pdf",
      "content": "Countable Additivity\nThe Principle of Countable Additivity\n(Finite) Additivity p(A or B) = p(A) + p(B)\nwhenever A and B are incompatible propositions\nCountable Additivity p (A1 or A2 or . . .) = p(A1) + p(A2) + . . .\nwhenever A1, A2, . . . are countably many propositions with Ai and Aj\nincompatible for i 6= j.\nAgainst Countable Additivity\n- God has selected a positive integer, and that you have no idea which.\n- For n a positive integer, what credence should you assign to the propo\nsition, Gn, that God selected n?\nCountable Additivity entails that your credences should remain undefined\n(unless you're prepared to give different answers for different choices of n).\nProof: suppose otherwise. Then p(Gn) = r, for r ∈ [0, 1].\n- Suppose r = 0. By Countable Additivity:\np(G1 or G2 or G3 or . . .)\n= p(G1) + p(G2) + p(G3) + . . .\n0 + 0 + 0 + . . .\n=\n|\n{z\n}\nonce for each integer\n=\n- Suppose r > 0. By Countable Additivity:\np(G1 or G2 or G3 or . . .)\n= p(G1) + p(G2) + p(G3) + . . .\nr + r + r + . . .\n=\n|\n{z\n}\nonce for each integer\n=\ninf\nMoral: Countable Additivity entails that there is no way of distributing\nprobability uniformly across a countably infinite set of (mutually exclusive\nand jointly exhaustive) propositions.\n\n2.1\nInfinitesimals to the rescue?\nWhat if we had an infinitesimal value ι with the following property?\nι + ι + ι + . . .\n= 1\n|\n{z\n}\nonce for each positive integer\nThen:\np(G1 or G3 or G5 or . . .)\n= p(G1) + p(G3) + p(G5) + . . .\nι + ι + ι + . . .\n=\n|\n{z\n}\nonce for each positive integer\n=\nand\np(G2 or G4 or G6 or . . .)\n= p(G2) + p(G4) + p(G6) + . . .\nι + ι + ι + . . .\n=\n|\n{z\n}\nonce for each positive integer\n=\nSo, by (finite) Additivity:\np(G1 or G2 or G3 or . . .) = 2 (!)\nFor Countable Additivity\n- X, Y ⊆ Z+\n- p(X) is the probability that God selects a number in X.\n- p(X|Y ) is the probability that God selects a number in X given that\nShe selects a number in Y .\nHere is a natural way of characterizing p(X) and p(X|Y ):\n|X ∩ Y ∩{1, 2, . . . , n}|\np(X|Y )\n= df\nlim\nn→inf\n|Y ∩{1, 2, . . . , n}|\np(X)\n= df p(X|Z+)\n\n- p(X) is finitely additive but not countably additive.\n- p(X) is not well-defined for arbitrary sets of integers.1\nAlso, there is a set S and a partition Ei of Z+ such that:\n- p(S) = 0\n- p(S|Ei) ≥ 1/2 for each Ei.\nExample:\nS = {12 , 22 , 32 , . . . }; Ei be the set of powers of i (whenever i\nwhich is not a power of any other positive integer). In other\nwords:\nS\nE1\nE2\nE3\n[No E4, since 4 = 22]\n=\n=\n=\n=\n{1, 4, 9, 16, 25, . . . }\n{1}\n{2, 4, 8, 16, 32, . . . }\n{3, 9, 27, 81, 243, . . . }\nE5\n=\n.\n{5, 25, 125, 625, 3125, . . . }\n. .\n3.1\nIs this really so bad?\nYes. There is a sequence of bets BE1 , BE2 , BE3 , BE5 , . . . such that:\n- you are confident that you ought to take each of the bets,\n- you are 100% confident that you will lose money if she takes them all.\nBEi : Suppose God selects a number in Ei. Then you'll receive $2 if the\nselected number is in S and you'll be forced to pay $1 if the selected\nnumber is not in S. (If the selected number is not in Ei, then the bet\nis called off and no money exchanges hands.)\nProblems of this general form are inescapable: they will occur whenever a\nprobability function on a countable set of possibilities fails to be countably\nadditive.\n≤ k < 2m+1\n1For instance, when X consists of the integers k such that 2m\n, for some\neven m.\n\nThe Two-Envelope Paradox\n- Two envelopes:\n- one contains $n, for n chosen at random from Z+ .\n- the other contains 2n.\n- You are handed one of the envelopes, but don't know which.\n- Then you are offered the chance to switch. Should you switch?\nAn argument for switching:\nSay that your envelope contains $k. If k is odd, you should switch.\nIf k is even, there's a 0.5 chance that the other envelope has $2k\nand a 0.5 chance that the other envelope has $k/2. So:\nEV (switch)\n= $k/2 · 0.5 + $2k · 0.5\n=\n5/4 · $k\nEV (not switch) =\n$k\nBroome's Variant of the Paradox\n- Two envelopes:\n- Toss a die until it lands One or Two. If the die first lands One or\nTwo on the kth toss, place 2k-1 in the first envelope.\n- Place twice that amount in the other envelope.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n24.118 Paradox and Infinity\nSpring 2019\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "24.118_S19 Paradox and Infinity, Lecture Note 13: Measure Theory",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-118-paradox-and-infinity-spring-2019/03061c9ff32e1c9da2c17dc80b776cc6_MIT24_118S19_LecNote13.pdf",
      "content": "Measure Theory\nAdditive notions of size\n- the length of two (non-overlapping) line segments placed side by side\nis the length of the first plus the length of the second;\n- the mass of two (non-overlapping) objects taken together is the mass\nof the first plus the mass of the second.\n- The probability that either of two (incompatible) events occur is the\nprobability that the first occur plus the probability that the second\noccur;\nThe notion of measure is a very abstract way of thinking about additive\nnotions of size.\nGeneralizing the notion of length\nThe standard notion of length:\n- [a, b] = {x ∈ R : a ≤ x ≤ b}\n- Length([a, b]) = b - a.\n2.1\nThe Borel Sets\nA Borel Set is a set that you can get to by performing finitely many ap\nplications of the operations of complementation and countable union on a\nfamily of line segments.1\n- The complementation operation takes each set A to its comple\nment, A = R - A.\n- The countable union operation takes each countable family of sets\nS\nA1, A2, A3, . . . to their union,\n{A1, A2, A3 . . . }.\n1Formally, the Borel Sets are the members of the smallest set B such that: (i) every\nline segment is in B, (ii) if a set is in B, then so is its complement, and (iii) if a countable\nfamily of sets is in B, then so is its union.\n\n2.2\nLebesgue Measure\nThere is exactly one function λ on the Borel Sets that satisfies these three\nconditions:\nLength on Segments λ([a, b]) = b - a for every a, b ∈ R.\nCountable Additivity\n[\n\nλ\n{A1, A2, A3, . . .} = λ(A1) + λ(A2) + λ(A3) + . . .\nwhenever A1, A2, . . . is a countable family of disjoint sets for each of\nwhich λ is defined.\nNon-Negativity λ(A) is either a non-negative real number or the infinite\nvalue inf, for any set A in the domain of λ.\n- a function on the Borel Sets is a measure if and only if it satisfies\nCountable Additivity and Non-Negativity (and assigns the value 0 to\nthe empty set).\n- the Lebesgue Measure is the (unique) measure λ that satisfies Length\non Segments.2\nUniformity\nThe Lebesgue Measure, λ, satisfies:\nUniformity μ(Ac) = μ(A), whenever μ(A) is well-defined and Ac is the\nresult of adding c ∈ R to each member of A.\n3.1\nProbability Measures\nTwo ways of randomly selecting a number from [0, 1]:\n2We say that a set A ⊆ R is Lebesgue Measurable if and only if A = AB ∪ A0 , for\nAB a Borel Set and A0 a subset of some Borel Set of Lebesgue Measure zero. We apply λ to\nLebesgue measurable sets that are not Borel sets by stipulating that λ(AB ∪ A0) = λ(AB ).\n\nStandard Coin-Toss Procedure You toss a fair coin once for each natural\nnumber. Each time the coin lands Heads you write down a zero, and\neach time it lands Tails you write down a one. This gives you an infinite\nbinary sequence hd1, d2, d3, . . .i, Pick 0.d1d2d3 . . . (in binary notation).3\n- We get uniformity:\n- Given certain assumptions about the probabilities of sequences of\ncoin tosses, we get the Lebesgue Measure.\nSquare Root Coin-Toss Procedure As before, but this time you pick\n√ 0.d1d2d3 . . . (in binary notation).\n- We do not get uniformity:\nNon-Measurable Sets\n- There are subsets of R that are non-measurable:\nthey cannot be assigned a measure by any extension of λ, unless one\ngives up on one of Non-Negativity, Countable Additivity and Unifor\nmity.\n3Rational numbers have two different binary expansions: one ending in 0s and the other\nending in 1s. To simplify the present discussion, I assume that the Coin-Toss Procedure\nis rerun if the output corresponds to a binary expansion ending in 1s.\n\nThe Axiom of Choice\nIt is impossible to prove that there are non-measurable sets without some\nversion of the Axiom of Choice:\nAxiom of Choice Every set of non-empty, non-overlapping sets has a choice\nset.\n(A choice set for set A is a set that contains exactly one member from each\nmember of A.)\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n24.118 Paradox and Infinity\nSpring 2019\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "24.118_S19 Paradox and Infinity, Lecture Note 14: The Vitali Sets",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-118-paradox-and-infinity-spring-2019/09d491697f75ff86fe2fb226e199331a_MIT24_118S19_LecNote14.pdf",
      "content": "The Vitali Sets\nNon-Measurable Sets\n- There are subsets of R that are non-measurable:\nThey cannot be assigned a measure by any extension of λ, without\ngiving up on Non-Negativity, Countable Additivity, or Uniformity.\nThe Axiom of Choice\nProving that there are non-measurable sets requires:\nAxiom of Choice Every set of non-empty, non-overlapping sets has a choice\nset.\n(A choice set for set A is a set that contains exactly one member from each\nmember of A.)\nDefining the Vitali Sets\n3.1\nA sketch of the construction\n- Define an (uncountable) partition U of [0, 1).\n- Use the Axiom of Choice to pick a representative from each cell of U.\n- Use these representatives to define a (countable) partition C of [0, 1).\n- A Vitali Set is a cell of C.\n3.2\nDefining U\na, b ∈ [0, 1) are in the same cell if and only if a - b ∈ Q.\n\n3.3\nDefining C\n- C has a cell Cq for each rational number q ∈ Q[0,1).\n- C0 is the set of representatives of cells of U.\n- Cq is the set of numbers x ∈ [0, 1) which are at a \"distance\" of q from\nthe representative of their cell in U.\nHere \"distance\" is measured by bending [0, 1) into a circle:\n0 1\nand traveling counter-clockwise. For instance, 1 is at \"distance\" 1 from 3 :\n0 1\nA Vitali Set Cannot Be Measured\n4.1\nAssumptions\nCountable Additivity\n[\n\nλ\n{A1, A2, A3, . . .} = λ(A1) + λ(A2) + λ(A3) + . . .\nwhenever A1, A2, . . . is a countable family of disjoint sets for each of\nwhich λ is defined.\nNon-Negativity λ(A) is either a non-negative real number or the infinite\nvalue inf, for any set A in the domain of λ.\nUniformity μ(Ac) = μ(A), whenever μ(A) is well-defined and Ac is the\nresult of adding c ∈ R to each member of A.\n\n4.2\nThe Proof\n- Suppose otherwise: λ(Cq) is well-defined for some q ∈ Q[0,1).\n0 ∈ Q[0,1)\n- By Uniformity, λ(Cq\n0 ) = λ(Cq) for any q\n.\n- By Non-Negativity, λ(Cq) is either 0, or a positive real number, or inf.\n- By Countable Additivity, it can't be any of these:\n- Suppose λ(Cq) = 0. By Countable Additivity:\nλ([0, 1)) = λ(Cq) + λ(Cq0 ) + . . .\n0 + 0 + 0 + . . .\n=\n|\n{z\n}\nonce for each integer\n=\n- Suppose λ(Cq) = r > 0. By Countable Additivity:\nλ([0, 1)) = λ(Cq) + λ(Cq0 ) + . . .\nr + r + r + . . .\n=\n|\n{z\n}\nonce for each integer\n=\ninf\nMoral: There is no way of assigning a measure to a Vitali set without giving\nup on Uniformity, Non-Negativity or Countable Additivity.\nRevising Our Assumptions?\n- Giving up on Uniformity means changing the subject: the whole point\nof our enterprise is to find a way of extending the notion of Lebesgue\nMeasure without giving up on uniformity.\n- Non-Negativity and Countable Additivity are not actually needed\nto prove the existence of non-measurable sets.\n- Some mathematical theories would be seriously weakened by giving up\non the Axiom of Choice.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n24.118 Paradox and Infinity\nSpring 2019\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "24.118_S19 Paradox and Infinity, Lecture Note 15: Banach-Tarski: Preliminaries",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-118-paradox-and-infinity-spring-2019/48280be4fbd5fe71b41d04e6f28295e9_MIT24_118S19_LecNote15.pdf",
      "content": "Banach-Tarski: Preliminaries\nThe Theorem\nBanach-Tarski Theorem It is possible to decompose a ball into a finite\nnumber of pieces and reassemble the pieces (without changing their size\nor shape) so as to get two balls, each of the same size as the original.\n1.1\nWarm-Up Case 1: A Line\nIt is possible to decompose [0, inf) -{1} into two distinct parts,\nand reassemble the parts (without changing their size or shape)\nso as to get back [0, inf).\n- Decompose [0, inf) -{1} into: (i) {2, 3, 4, . . . } and (ii) everything else.\n- Translate {2, 3, 4, . . . } one unit to the left.\n1.2\nWarm-Up Case 2: A Circle\nIt is possible to decompose S1 -{p} into two distinct parts, and\nreassemble the parts (without changing their size or shape) so as\nto get back S1 .\np\nS1\n- Decompose S1 -{p} into: (i) B and (ii) everything else.\n- Rotate B one unit counter-clockwise.\n\nB = x ∈ S1 : x is n units clockwise from p (n ∈ Z+)\np5\np2\nThe first six members of B.\n1.3\nWarm-Up Case 3: The Cayley Graph\nIt is possible to decompose (the set of endpoints of) the Cayley\nGraph1 into four distinct parts, and reassemble the parts (albeit\nchanging their size) so as to get back two copies of the same size\nas the original.\np\np1\np3\np4\np6\n\nc\n- Decompose Ce into quadrants: Le, Re, U e, De .\n1A Cayley Path is a finite sequence of steps starting from c, where no step follows its\ninverse. The Cayley Graph C is the set of Cayley Paths. Xe is the set of endpoints of\nCayley paths in X.\n\n- Make first copy by expanding Re and translating left to meet Le .\n- Make second copy by expanding U e and translating down to meet De .\n1.4\nA more abstract description of the procedure\n←\nNotation: if X is a set of Cayley Paths, let X be the set that\nresults from eliminating the first step from each of the Cayley\nPaths in X.\nBy the definition of Cayley Paths:\n←\n(α) C =R ∪ L\n←\n(β) C =D ∪ U\nSince every Cayley Path has a unique endpoint, (α) and (β) entail:\ne\n(α0) Ce = R\n∪ Le\n\ne\n(β0) Ce = D\n∪ U e\n←\n←\nOn our two-dimensional interoperation of the Cayley Graph, this delivers the\nintended result because:\n1. Ce is decomposed into U e , De , Le and Re (ignoring the central vertex)\n\n←\ne\n←\ne\n2. One can get from Re to R , and from De to D , by performing a\ntranslation together with an expansion.\n\nU\nR\nL\nD\nR\nL\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n24.118 Paradox and Infinity\nSpring 2019\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "24.118_S19 Paradox and Infinity, Lecture Note 16: Banach-Tarski: The Theorem",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-118-paradox-and-infinity-spring-2019/78b4d20519c501f6084b7ef3b4ffd22a_MIT24_118S19_LecNote16.pdf",
      "content": "Banach-Tarski: The Theorem\nThe Theorem\nBanach-Tarski Theorem It is possible to decompose a ball into a finite\nnumber of pieces and reassemble the pieces (without changing their size\nor shape) so as to get two balls, each of the same size as the original.\nThe basic idea\nU\nR\nL\nD\n\nBy the definition of Cayley Paths:1\n←\n(α) C =R ∪ L\n←\n(β) C =D ∪ U\nSo we have:\n←\n←\ne\n(α0) Ce = R\n∪ Le\n\ne\n(β0) Ce = D\n∪ U e\nOn our two-dimensional interoperation of the Cayley Graph, we have:\n- Different Cayley Paths have different endpoints.\n←\n←\ne\n\ne\n[So our duplication requires only translations and expansions.]\n←\n←\ne\ne\ne\ne\ne\n[So C is decomposed into U\nD\nL and R ignoring the center.]\n,\n,\n,\ne\ne\n- One\nfrom R\nand from D\nby performing\nget\nto R\nto D\ncan\na\n,\n,\ntranslation together with\nexpansion.\nan\nNow we're going\nwork with\ndifferent interpretation of the Cayley\nto\na\nrotation.\nGraph, on which the graph is wrapped around the surface of a ball.\nOn this other interpretation, we'll have:\n- Different Cayley Paths have different endpoints.2\n[So Ce is decomposed into U e , De , Le and Re , ignoring the center.]\ne\n\ne\n- One can get from Re to R , and from De to D , by performing a\n[So our duplication requires only rotations.]\n←\n1If X is a set of Cayley Paths, Xe is the set of endpoints of paths in X and X is the\nset that results from eliminating the first step from each of the Cayley Paths in X.\n2Or close enough... See below!\n\nAn external coordinate system\n- The x-axis runs from your right to your left through the center of the\nball.\n- The y-axis runs is orthogonal to the x-axis. It runs from the wall in\nfront of you to the wall in behind of you, through the center of the ball.\n- The the z-axis is orthogonal to the other two. It runs from the ground\nto the sky, through the center of the ball.\nA spherical interpretation of the Graph\n- The \"center\" of our graph is interpreted as an arbitrary point c on the\nsurface of our ball.\n- A \"step\" is interpreted as the result of performing a rotation on the\nsphere, by a certain angle θ:\n- An \"up\" rotation is a counterclockwise rotation of θ degrees about\nthe x axis. (When you're holding the ball in front of you, you\nperform this rotation by rotating the ball from bottom to top.)\n- A \"down\" rotation is a clockwise rotation of θ degrees about the\nx axis. (When you're holding the ball in front of you, you perform\nthis rotation by rotating the ball from top to bottom.)\n- A \"right\" rotation is a counterclockwise rotation of θ degrees\nabout the z axis. (When you're holding the ball in front of you,\nyou perform this rotation by rotating the ball from left to right.)\n- A \"left\" rotation is a clockwise rotation of θ degrees about the z\naxis. (When you're holding the ball in front of you, you perform\nthis rotation by rotating the ball from right to left.)\nThe endpoints of Cayley Paths\n- To each rotation ρ corresponds a function fρ, which takes each point p\non the surface of the ball to the point on the surface of the ball whose\ncurrent location (relative to an external reference frame) would come\nto be occupied by p were rotation ρ to be performed.\n\n- The \"endpoint\" of Cayley Path hρ1, ρ2, . . . , ρni is the point\nfρ1 (fρ2 (. . . fρn (c) . . . ))\nThe key results\nWhen the rotation θ is chosen properly,3 we get a nice result:\n- Result 1: Different Cayley Paths always have different endpoints.4\nIn other words: if hρ1, ρ2, . . . , ρni and hσ1, σ2, . . . , σmi are distinct Cay\nley Paths, then\nfρ1 (fρ2 (. . . fρn (c) . . . )) 6= fσ1 (fσ2 (. . . fσm (c) . . . ))\ne\n\ne\n- Result 2: One can get from Re to R\n←\n, and from De to D\n←\n, by\nperforming a rotation.\nDuplicating the Surface of the Ball\n- Partition the surface of the ball into cells, with two points are in same\ncell if they are linked by a Cayley Path.\n- Choose a \"center\" for each cell.5\n(This delivers a partition of the surface of the ball into Cayley Graphs.)\n- Perform the duplication procedure to each Cayley Graph symultane\nously.\n7.1\nA complication\nWait! For hρ1, ρ2, ρ3, . . .i a Cayley Path:\n- fρ1 (fρ2 (fρr (. . . ))) is a rotation (by Euler's Theorem).\n3For instance: θ = arccos(1/3) ≈ 70.53*\n4Annoyingly, this result holds for almost every choice of our \"central\" point c but not\nquite every choice. I'll come back to this. . .\n5Rather than specifying a center for each cell, we use the Axiom of Choice to prove\nthat a set of cell-centers exists.\n\n- So fρ1 (fρ2 (fρr (. . . ))) does not change the location of the points inter\nsecting its axis of rotation.\n- So whenever c is such that some such problem point is the endpoint\nof some Cayley Path, we will have different Cayley Paths sharing an\nendpoint.\nThe good news:\n- There are only countably many problem points.\n- One can deal with these points separately, by applying a sophisticated\nversion of the trick we used in Warm-Up Case 2.\nDuplicating the Ball\n- Use the same procedure as before, but rather than working with points\non the surface of the ball, work with the lines that connect the center\nof the ball with each point.\n- Wait! What about the center of the ball?\nA region with no volume\nSome of the Banach-Tarski pieces must be non-measurable must therefore\nlack definite volumes!\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n24.118 Paradox and Infinity\nSpring 2019\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "24.118_S19 Paradox and Infinity, Lecture Note 17: Computability: Turing Machines",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-118-paradox-and-infinity-spring-2019/86929f7b9534d367d1e6c3048a960b86_MIT24_118S19_LecNote17.pdf",
      "content": "Computability: Turing Machines\nThe Main Result\n- We'll focus on functions f : N → N.\n- For a computer program to compute f is for it to yield f(n) as output\nwhenever it is given n as input (n ∈ N).\n- Theorem: not every function is computable.\n(And I can give you examples!)\nHow We'll Get There\n- Turing Machines are computers of an especially simple sort.\n- We'll see that some functions are not Turing-computable.\n- But: any function that can be computed using an ordinary computer\nis also computed by some Turing Machine.\nTuring Machines\nHardware\nMemory tape A long strip of paper, divided into cells:\n(An assistant is ready to add paper on either end, as needed.)\nTape-reader At any given time, the reader is positioned on a cell of the\nmemory tape and is able to perform any of the following functions:\n- Read the symbol written on the cell\n- Write a new symbol on the cell\n- Move one cell to the left\n- Move one cell to the right\n\nSoftware\nA finite list of command lines:\nhcurrent statei hcurrent symboli hnew symboli hdirectioni hnew statei\nThink of a command line as encoding the following instruction:\nIf you are in hcurrent statei and your reader sees hcurrent symboli\nwritten on the memory tape, replace hcurrent symboli with hnew symboli.\nThen move one step in direction hdirectioni, and go to hnew statei.\nOperation\n- Start out in state 0. Then carry out the following procedure, for as\nlong as you are able:\n- Perform the instruction corresponding to the (first) command line\nthat matches your current state and the symbol on which your\nreader is positioned.\n- Repeat.\n- If you are unable carry out the procedure, halt.\nA Turing Machine Simulator\nhttp://morphett.info/turing/\nComputing functions on a Turing Machine\nComputability:\n- For a computer program to compute f is for it to yield f(n) as output\nwhenever it is given n as input.\nTuring Computabiity:\n- M takes n (n ∈ N) as input if it starts out with a tape that contains\nonly a sequence of n ones (with the reader positioned at the left-most\none, if n > 0).\n\n- M delivers f(n) as output if it halts with a tape that contains only a\nsequence of f(n) ones (with the reader positioned at the left-most one,\nif n > 0).\n- M computes a function f(x) if and only if it delivers f(n) as output\nwhenever it is given n as input.\nThe Fundamental Theorem\nThe reason Turing Machines are so valuable is that it is possible to prove the\nfollowing theorem:\nFundamental Theorem of Turing Machines A function from natural num\nbers to natural numbers is Turing-computable if and only if it can be\ncomputed by an ordinary computer, assuming unlimited memory and\nrunning time.\n- One shows that every Turing-computable function is computable by\nan ordinary computer (given unlimited memory and running time) by\nshowing that one can program an ordinary computer to simulate any\ngiven Turing Machine.\n- One shows that every function computable by an ordinary computer\n(given unlimited memory and running time) is Turing-computable by\nshowing that one can find a Turing Machine that simulates any given\nordinary computer.\nChurch-Turing\nComputer scientists tend to think that something stronger than the Funda\nmental Theorem is true:\nChurch-Turing Thesis A function is Turing-computable if and only if it\ncan be computed algorithmically.\nFor a problem to be solvable algorithmically is for it to be possible to\nspecify a finite list of instructions for solving the problem such that:\n\n1. Following the instructions is guaranteed to yield a solution to the prob\nlem, in a finite amount of time.\n2. The instructions are specified in such a way that carrying them out\nrequires no ingenuity of any kind: they can be followed mechanistically.\n3. No special resources are required to carry out the instructions: they\ncould in principle be carried out by a machine built from transistors.\n4. No special physical conditions are required for the computation to suc\nceed (no need for faster-than-light travel, special solutions to Einstein's\nequations, etc).\nCoding Turing Machines as Numbers\nThe Plan\nTuring Machine → Sequence of symbols → Sequence of numbers → Unique number\nSequence of symbols → Sequence of numbers\n\"r\" → 0\n\"∗\" → 1\n\"l\" → 2\nSequence of numbers → Unique number\nCodes the sequence hn1, n2, . . . , nki as the number:\nn1+1\nn2+1\nnk+1\np\n· p\n· . . . · p\nk\nwhere pi is the ith prime number.\n(Treat any number that doesn't code a valid sequence of command lines as\na code for the \"empty\" Turing Machine.)\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n24.118 Paradox and Infinity\nSpring 2019\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "24.118_S19 Paradox and Infinity, Lecture Note 19: Non-computable Functions II",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-118-paradox-and-infinity-spring-2019/856682c5a364ccf68bda79e3043ce8b5_MIT24_118S19_LecNote19.pdf",
      "content": "Non-Computable Functions (part 2)\nThe Busy Beaver Function\n(\nk, if M yields output k on an empty input\n- Productivity(M) =\n0, otherwise\nthe productivity of the most productive (one-symbol)\n- BB(n) = Turing Machine with n states or fewer.\nBB(n) is not Turing-computable\n- Assume for reductio: Turing Machine M BB computes BB(n).\n- Construct Turing Machine M I , which behaves as follows on an empty\ninput:\nStep 1: Print a sequence of k ones, for a certain k (specified below).\nResult: k.\nStep 2: Duplicate your string of ones.\nResult: 2k.\nStep 3 Apply BB to your string of ones (using M BB).\nResult: BB(2k).\nStep 4 Add one to your string of ones.\nResult: BB(2k) + 1.\n- Let k = b + c + d\nb = the number of states used in Step 2 (to duplicate)\nc = the number of states used in Step 3 (to apply BB)\nd = the number of states used in Step 4 (to add one)\nNote: since a Turing Machine can output k using k states,\nM I = k + b + c + d = 2k\n\n- M BB is impossible:\n- At Stage 3, it produces as long a sequence of ones as a machine\nwith 2k states could possibly produce.\n- But (as noted above) M I = 2k.\n- So at Stage 3, it produces as long a sequence of ones as it itself\ncould possibly produce.\n- So at Stage 4, it produces a longer string of ones than it itself\ncould possibly produce.\n- So M H isn't computable after all.\nThe Universal Turing Machine\nThere is a Universal Turing Machine, M U , which does the following:\n- if the mth Turing Machine halts given input n, leaving the tape in\nconfiguration p, then M U halts given input hm, ni leaving the tape in\nconfiguration p.\n- if the mth Turing Machine never halts given input n, then M U never\nhalts given input hm, ni.\nThe Fundamental Theorem\nThe reason Turing Machines are so valuable is that it is possible to prove the\nfollowing theorem:\nFundamental Theorem of Turing Machines A function from natural num\nbers to natural numbers is Turing-computable if and only if it can be\ncomputed by an ordinary computer, assuming unlimited memory and\nrunning time.\n- One shows that every Turing-computable function is computable by\nan ordinary computer (given unlimited memory and running time) by\nshowing that one can program an ordinary computer to simulate any\ngiven Turing Machine.\n\n- One shows that every function computable by an ordinary computer\n(given unlimited memory and running time) is Turing-computable by\nshowing that one can find a Turing Machine that simulates any given\nordinary computer.\nChurch-Turing\nComputer scientists tend to think that something stronger than the Funda\nmental Theorem is true:\nChurch-Turing Thesis A function is Turing-computable if and only if it\ncan be computed algorithmically.\nFor a problem to be solvable algorithmically is for it to be possible to\nspecify a finite list of instructions for solving the problem such that:\n1. Following the instructions is guaranteed to yield a solution to the prob\nlem, in a finite amount of time.\n2. The instructions are specified in such a way that carrying them out\nrequires no ingenuity of any kind: they can be followed mechanistically.\n3. No special resources are required to carry out the instructions: they\ncould in principle be carried out by a machine built from transistors.\n4. No special physical conditions are required for the computation to suc\nceed (no need for faster-than-light travel, special solutions to Einstein's\nequations, etc).\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n24.118 Paradox and Infinity\nSpring 2019\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "24.118_S19 Paradox and Infinity, Readings: On the Brink of Paradox: List of Known Errors",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-118-paradox-and-infinity-spring-2019/2a13f9ac00c6c6b27ea5294815622a32_MIT24_118S19_Errors.pdf",
      "content": "On the Brink of Paradox :\nList of known errors, as of April 17, 2019\nChapter 1\n- p. 10, table: \"At most, as many members in A as in B\".\n- p. 11: \"select. [For example,] [i]t will be answered negatively\".\n- p. 18: \"Let the range of that function be the set SN = [{]s0, s1, s2, . . . [}]\".\n- p. 22: Exercise 1 (and its answer on page 30) uses \"B0 \" for the set that\nis introduced as \"B\" in the main text.\nChapter 2\n- p. 48: the claim that |A| + |B| = |A| when at least one of A and B\nis infinite and |B| ≤|A| assumes the axiom of choice. (The minimal\ncorrection here is to delete \"The claim that |A| ⊗|B| = |A| whenever\nA is infinite, B is nonempty, and |B| ≤|A| assumes\" and replace with\n\"Nerdy Observation: Here I assume\".)\nChapter 3\n- p. 75: \"a high table\"\nChapter 4\n- p. 100: \"correspond to points on the dotted [horizontal] line\".\nChapter 5\n- p. 134, last equation: \"1BE\" should be \"2BE\".\n- p. 135, first indented conditional: \"she failed to do so\" should be \"she\nfailed to take the trip\".\n\nChapter 6\n- There is a serious omission in section 6.1.1. The Objective-Subjective\nconnection is only plausible when one presupposes that a perfectly ra\ntional agent is always certain about the connection between events\nbefore t and the objective probabilities at t. Here is a proposed fix:\n(Nerdy observation: Here I am tacitly presupposing that a\nperfectly rational agent is always certain about the connec\ntion between events before t and the objective probabilities\nat t. So, in particular, for each complete history of the world\nup to t, Ht, there is a specification Pt of the objective prob\nabilities at t such that the agent assigns credence one to the\nproposition [if Ht then Pt]. This assumption is potentially\ncontroversial but adds simplicity to our discussion.)\nWith this fix in place on can give a formal proof--given assumptions--\nof the Principal Principle. Here is a proof for a particular isntance:\nAssume that x's half life is 7.04 · 108 years. Let D be the proposition\nthat x will decay sometime within the next 7.04 · 108 years. We show\nthat you should believe D to degree 0.5.\nIt follows from the fact that x's half life is 7.04 · 108 years that the\nobjective probability of D is 0.5. It then follows from the Objective-\nSubjective Connection that a perfectly rational agent with perfect in\nformation about the past (and none about the future) would assign\ncredence 0.5 to D.\nNow suppose you are perfectly rational and that--although you have\nnot quite learned the full truth about the past--the information you\nhave acquired, E, is entirely about the past. Suppose, moreover, that\na rational agent would take E to be compatible with the proposition\nthat p(D) = 0.5, were p is objective probability.\nBecause E is entirely about the past, it is equivalent to some disjunc\ntion Ht\n1 ∨ Ht\n2 ∨ . . . of possible histories-up-to-t. (We must assume that\nthe conjunction is either finite or countably infinite, to ensure Con\nglomerability later on.) Because perfectly rational agents are always\ncertain about the connection between events before t and the objective\n\nprobabilities up to t, each Hj is equivalent to HjPt\nj , where P j is a\nt\nt\nt\ncomplete specification of the objective probabilities at t.\nBecause E (and therefore Ht\n1 ∨Ht\n2 ∨. . . ) is compatible with p(D) = 0.5,\nthere are some Hk1 , Hk2 , . . . amongst the H1, H2 such that each P ki Hki\nt\nt\nt\nt\nt\nt\nj\nentails p(D) = 0.5. (Note that every Ht outside this list entails some\nthing incompatible with p(D) = 0.5.) So (p(D) = 0.5)E is equivalent\nto Ht\nk1 ∨ Ht\nk2 ∨ . . . :\n∨ Hk2\nc(D|(p(D) = 0.5)E) = c(D|Hk1\n∨ . . . )\nt\nt\nBut, for each i, we know that c(D|Hki ) = 0.5. So, by Conglomerability,\nt\n∨ Hk2\nc(D|(p(D) = 0.5)E) = c(D|Hk1\n∨ . . . ) = c(D|Hk1 ) = 0.5\nt\nt\nt\nAnd how do we know the Conglomerability holds? Here is a proof for\nthe finite case. (The result also holds in the countably infinite case but\nrequires Countable Additivity.)\np(A|B1)\n= p(A|B2)\np(AB1)\np(AB2)\n=\nB1\nB2\np(B2) · p(AB1)\n= p(B1) · p(AB2)\np(B2) · p(AB1)\n= p(B1)(p(AB2) + p(AB1) - p(AB1))\np(B1) · p(AB1) + p(B2) · p(AB1)\n= p(B1) · p(AB2) + p(B1) · p(AB1)\np(AB1)(p(B1) + p(B2)) = p(B1)(p(AB2) + p(AB1))\np(AB1) (p(B1) + p(B2)) = p(AB2) + p(AB1)\np(B1)\np(A|B1)(p(B1) + p(B2)) = p(AB1) + p(AB2)\np(AB1)+p(AB2)\np(A|B1)\n=\np(B1)+p(B2)\np(AB1∨AB2)\np(A|B1)\n=\np(B1∨B2)\np(A(B1∨B2))\np(A|B1)\n=\np(B1∨B2)\np(A|B1)\n= p(A|B1 ∨ B2)\nWe have now shown that c(D|(p(D) = 0.5)E) = 0.5. But the only\nrestrictions on E are that it be entirely about the past and that it be\ncompatible with p(D) = 0.5. So if you're fully rational, then as long\nas everything you've learned is entirely about the past and compatible\nthat p(D) = 0.5, Update by Conditionalizing entails that you should\nbelieve D to degree 0.5.\n\n- p. 169, indented paragraph: \"k dollars, say. [If k is odd, I should\ndefinitely switch. What about the case in which k is even? In that\ncase] This means that the other envelope [. . . ]\". (Also, replace two\noccurrences of \"outcomes\" in that paragraph with \"scenarios\".)\nChapter 8\n- p. 209, \"T\" and \"B\" labels on diagram should be \"U\" and \"D\", respec\ntively.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n24.118 Paradox and Infinity\nSpring 2019\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    }
  ]
}