{
  "course_name": "Philosophy of Love",
  "course_description": "This course explores the nature of love through works of philosophy, literature, film, poetry, and individual experience. It investigates the distinction among eros, philia, and agape. Students discuss ideas of love as a feeling, an action, a species of ‘knowing someone,’ or a way to give or take. Authors studied include Plato, Kant, Buber, D. H. Lawrence, Rumi, and Aristotle.\nThis course is part of the Concourse program at MIT.",
  "topics": [
    "Humanities",
    "Literature",
    "Classics",
    "Philosophy",
    "Ethics",
    "Political Philosophy",
    "Humanities",
    "Literature",
    "Classics",
    "Philosophy",
    "Ethics",
    "Political Philosophy"
  ],
  "syllabus_content": "Course Meeting Times\n\nLecture: 1 session / week; 2 hours / session\n\nThe Concourse Program\n\nThis course is part of the\nConcourse\nprogram at MIT. Concourse is a unique program for freshmen. It focuses on integration of the disciplines, teaching the rigorous scientific subjects within the broader human framework. Classes are taught by highly dedicated teachers in an interactive learning environment with small class sizes. This creates a high degree of student-faculty, and student-student interaction and therein a superior learning experience.\n\nPrerequisite\n\nNone\n\nCourse Overview\n\nThis is a 12 unit HASS Elective. All classes are discussion-based, and regular attendance is required. If you will not be able to attend a class, you must call me beforehand to let me know. Two papers of approximately six pages in length are required. I will give you a list of possible paper topics, though you can choose another topic after consulting with the T.A. or myself.\n\nGrading Policy\n\nACTIVITIES\n\nPERCENTAGES\n\nPaper 1\n\n30%\n\nPaper 2\n\n40%\n\nClass participation\n\n30%",
  "files": [
    {
      "category": "Resource",
      "title": "Adios to Eros, Away with Agape: Philia as the Highest Form of Love",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/cc-112-philosophy-of-love-spring-2013/0afdbe7a9d0f564053a9b34a3cbe1a55_MITCC_112S13_Paper2.pdf",
      "content": "CC.112 Paper Two\nCC.112 The Philosophy of Love\nProfessor Lee Perlman\nPaper Two\n\nAdios to Eros, Away with Agape: Philia as the Highest Form of Love\n\nThe words, \"I love you,\" take on very different meanings when said to a spouse,\nto a parent, or to a friend. While the English language appointed only one word to the\nmultifaceted concept of \"love,\" the Greeks invented three words for it: \"eros,\" \"philia,\"\nand \"agape.\" It comes as little surprise that philosophers across time have debated\nwhich the highest form of love is. To answer this question, one must consider the nature\nof each form of love, what each requires, and what each achieves for the lover and\nbeloved. My view is that philia is the highest form of love, for three reasons. Firstly,\nunlike erotic and agapic love, philic love treats the beloved not as an object with\nqualities, but as an actual human being with an essence. Secondly, whereas erotic love\nand agapic love are unidirectional, philic love is a two-way street that requires the\nmutual participation of both the lover and beloved. Lastly and most importantly, philia\nis a relationship between the consciousness of the lover and beloved.\n\nCC.112 Paper Two\nIn order to prove my argument that philia is the highest form of love, I will\nexamine three authors, Scott Peck, Plato, and Martin Buber, who have different views\non which form of love is the highest. Peck, a modern psychiatrist, believes that agape is\nthe highest form of love, because it fosters permanent spiritual growth. On the other\nhand, Plato, an ancient Greek philosopher, argues that eros is the highest form of love,\nbecause it gives birth to beauty outside oneself. While examining Peck and Plato‟s\nviews, I will refute their positions, and then argue why Buber‟s argument is the most\nconvincing. Buber, a 20th century Jewish philosopher, proposes that philia is the highest\nform of love, as it entails \"I-You\" relations in which both the lover and beloved\nmutually \"encounter\" (Buber p. 59) one another. My aim in this paper will be to prove\nthat philia is the highest form of love, as well demonstrate that it is the dialectic\nresolution between eros and agape.\nIn The Road Less Traveled, Peck claims that agape is the most important form\nof love. His argument is based on two reasons: Agapic love is permanent whereas erotic\nlove is temporary, and agape fosters another being‟s spiritual growth. In Peck‟s view,\n\"falling in love\" is a mundane example of erotic love. Whereas such erotic love is only\n\"invariably temporary\" (Peck p. 84), agapic love is a \"permanently self-enlarging\nexperience\" (p. 87). As we see in romantic stories such as the myth Tristan and Iseult or\n\nCC.112 Paper Two\nthe Hollywood film Casablanca, erotic love is often fleeting. For instance, Tristan‟s\nintense love for Iseult of the White Hands \"for her goodness and her beauty\" (p. 121)\ninstantly evaporates when he remembers Iseult the Fair. Similarly, Ilsa‟s love for her\nhusband Laszlo immediately falters when she unexpectedly crosses paths with Rick.\nUnlike the ephemeral nature of erotic love, agapic love is more deep-rooted. Due to its\npermanent nature, Peck believes that agape is the highest form of love.\nAnother reason that Peck claims agape is the highest form of love is that its\npurpose is to foster the \"spiritual growth\" (Peck p. 81) of oneself and his beloved.\nWhereas the erotic lover is possessive, the agapic lover does not ask his beloved for\nanything in return. For example, compare the relationship of a dating couple with that of\na mother and child. A person in a romantic relationship, whose love may be swayed by\nearthly elements such as lust or idealization, may \"love\" his partner because the partner\nhas something he desires. His erotic love is selfishly obsessed with possessing that\nquality of his significant other, not necessarily nurturing his partner. On the other hand,\na mother may pour agapic love into her child by constantly minding his wellbeing and\ngrowth, regardless of the mother‟s own gain. This example demonstrates Peck‟s view\nthat agape is a higher form of love than eros, because agape has the power to selflessly\nnurture another person.\n\nCC.112 Paper Two\nHowever, I do not completely agree with Peck‟s view that agape is the highest\nform of love, because his agapic love requires a separation between the lover and\nbeloved. In his view, a lover-beloved relationship seems to closely resemble a mentor-\nmentee relationship. Such a mentorship requires that \"the genuine lover always\nrespects... this separateness\" (p. 160). The mentor consequently \"experiences\" his\nmentee as an \"It\" entity. For example, a teacher primarily sees a student in terms of\nrelevant qualities such as their work ethic or academic performance. A typical teacher\nwould see a student as a student, not as the \"essence\" of the human being that the\nstudent is. Peck‟s agapic love requires a separation that involves objectifying the person\nwho is being nurtured. I believe that the truly highest form of love would instead\nachieve a personal union between the lover and beloved. As Buber says, \"the basic word\n„I-It‟ [is] the word of separation\" (Buber p. 75). Thus, Peck‟s agape cannot be the\nhighest form of love, as it requires an unnatural separation between the lover and\nbeloved.\nDistancing ourselves from the agape end of the spectrum of love brings us to\nthe other end, which entails eros. Plato argues in The Symposium that eros is the most\nimportant form of love, for two reasons: Unlike an agapic lover who resembles a mentor\nand is thus superior to his beloved, an erotic lover willingly admits that he is inferior to\n\nCC.112 Paper Two\nhis beloved. Erotic love establishes a dynamic equilibrium between the lover and\nbeloved. Another reason that Plato asserts eros is higher than agape is that eros takes\npart in the experience of beauty.\nIn Plato‟s view, eros is the highest form of love because, unlike the agapic\nlover, the erotic lover is capable of admitting his inferiority to his beloved. Plato shows\nthis by contrasting Socrates‟ modest character with that of his more arrogant peers. In\nthe monologues delivered by both eromenoi like Phaedrus and erastai like Pausanius,\neach speaker proposes a version of love that paints a flattering picture of himself. For\ninstance, Pausanius, Agathon‟s erastes, claims that Heavenly Love is exhibited by \"the\nelder... [who are] contributing to intellectual and all other excellence [of] the younger\"\n(Plato 184d-e). Phaedrus, Eryximachus‟ eromenos, believes that the gods are \"more\nadmiring... when the beloved is fond of his lover\" (180b). Both men are trapped in the\nself-conceited belief that they are superior to their significant other. Socrates, on the\nother hand, resembles the truly erotic lover who openly acknowledges his inferiority to\nhis significant other. His modesty is manifested in the very fact that he does not deliver\nhis own speech, but only acts as a mouthpiece for Diotima. Socrates‟ humility reflects\nhis well-known principle, \"The only thing I know is that I do not know.\" It is also\ninteresting to note that in The Symposium, Socrates reports, \"I... understand nothing but\n\nCC.112 Paper Two\nlove matters\" (177e). By combining these two statements, we can infer that eros is the\nart of not knowing. By being able to admit we do not know something, or do not\npossess something that another person does, we transform our relationship with that\nperson to a dynamic one. Instead of our relationship resembling a pair of compatible but\nunchanging puzzle pieces, it comes to resemble a teetering seesaw. Both one and one‟s\nsignificant other are able to appreciate how each is superior and inferior to one another.\nPlato believes that this dynamic equilibrium can be establisehd only through eros and\nnot through agape, and thus concludes that eros is the highest form of love.\nAnother reason that Plato believes eros is the highest form of love is that eros is\nthe experience of beauty. Socrates‟ speech explains that love is a means to \"know the\nvery essence of beauty\" (211c-d). Erotic love is a force that drives us to attain the\nunattainable. Beauty cannot be possessed, yet humans instinctively long to do so. In the\nmidst of our yearning for beauty, we attempt to come as close to it as possible by\nproducing beauty ourselves. On a day-to-day level, I think that fan-fiction and fan-art is\nan example of the creation of beauty enabled by eros. When an audience reads a novel,\nthey are inspired by its beauty and create their own art, literary or visual. Eros enables\nus to transform ourselves in the light of our beloved‟s beautiful qualities, with the goal\nof reaching kalon, or beauty. In Plato‟s view, only eros can provide this driving force,\n\nCC.112 Paper Two\nand thus eros is the highest form of love.\n\nHowever, I find that Plato‟s argument is not completely satisfying, because in\nhis view, love is directed towards the beauty that a person possesses, not towards the\nperson themselves. He advocates love for qualities in their universality, but not for\nhumans themselves in their particularity. In the end of The Symposium, Alcibides gives\nus the sense of how eros looks like in real life, when it is aimed at a particular person\nand not just their qualities. Socrates shudders at this manifestation of eros, calling it an\n\"amorous frenzy\" (203d). Alcibides makes us realize that there must be some higher\nform of love, which acknowledges the beloved person himself, as well as the qualities\nhe embodies.\n\nAs we have seen, Peck and Plato make strong arguments supporting their\nclaims that agape and eros, respectively, is the highest form of love. However, their\narguments are unsatisfying in certain aspects. Peck‟s agape requires a separation\nbetween the lover and beloved. Plato‟s eros does not love the beloved himself but only\nhis qualities. Both eros and agape appear to be incomplete forms of love because they\ntreat the beloved as an object, instead of a real human being. To use Buber‟s\nterminology, both eros and agape seem to treat love as an \"I-It\" relationship, instead of\nan \"I-You\" relationship. I believe that philia is the highest form of love, for three\n\nCC.112 Paper Two\nreasons: philic love treats the beloved as a \"You,\" it requires mutuality, and involves\nconsciousness of the lover and beloved.\n\nThe primary way that philia differs from both eros and agape is that it treats the\nbeloved as a \"You.\" Both eros and agape are experiential \"I-It\" relationships. This is\nbecause both the erotic lover and agapic lover treat their beloved as a categorized object,\nnot for the beloved‟s essence. The erotic lover desires his beloved‟s beauty. The agapic\nlover loves his beloved insofar as the lover can nurture the beloved‟s potential. In both\ncases, the lover experiences his beloved as a \"describable, analyzable, classifiable...\naggregate of qualities\" (Buber p. 68-69). Neither the agapic nor erotic lover actually\nrecognizes his beloved for his entire essence. Philia, on the other hand, requires\nunderstanding the \"whole being\" (p. 62) of the beloved. For example, a professional\nmusician may be \"loved\" erotically by aspiring musicians, for his ability to deliver\nexceptional performances. The musician may also be \"loved\" agapically by his\ninstructor, for the musician has the potential to improve even further. However, to be\ntruly loved philically, the musician must be loved not for his musicianship, but for the\n\"entirety\" of his being. By treating a beloved as a \"You\" and not an \"It,\" philia serves as\nthe highest form of love.\n\nFurthermore, philia is the only form of love that requires the active\n\nCC.112 Paper Two\nparticipation of both the lover and beloved. Eros and agape are essentially unidirectional.\nThe erotic lover selfishly takes in the beauty of his beloved, while the agapic lover one-\nsidedly supports his beloved‟s growth. In these \"I-It\" relationships, only the \"I\" is\nexperiencing the \"It,\" making the relationship unidirectional. Philia, on the other hand,\nresembles a two-way street. In this \"I-You\" relationship, both the \"I\" and the \"You\"\nencounter each other. The relationship is \"election and electing, passive and active\" (p.\n62) all at once. An \"actual relation\" revolves around constant, mutual feedback, since\n\"[You] acts on me as I act on [You]\" (p. 61). This \"actual relation\" is missing from both\neros and agape. This is why we hesitate when we are asked the hypothetical question,\n\"Would you rather be loved purely erotically, or purely agapically?\" To be loved purely\nerotically means that your qualities are valued, but you yourself have nothing to gain\nfrom the relationship. On the other hand, to be loved purely agapically is like having a\ntrainer obligated to stand by your side. He would bring out your potential, but you\nyourself are unable to affect him. That is why when asked the aforementioned question,\nwe are inclined to reply, \"I want something in between.\" This \"in between\" is perhaps\nphilia, the dialectic resolution of eros and agape. Philia is the highest form of love\nbecause it is a two-way road, unlike eros and agape.\n\nSaying that philia is the dialectic resolution of eros and agape is not to say that\n\nCC.112 Paper Two\nphilia is simply the combination of the two. This is because philia entails something\nnew, which is consciousness. Throughout I and Thou, Buber claims that to love\nsomeone does not mean to love the aggregate of the person‟s qualities, but to see the\nperson \"in its entirety\" (p. 58). Similar to how clothes are external accessories that hang\non a person‟s body, a person‟s qualities simply hang on his \"essence.\" For example,\nconsider what would happen if our professional musician were replaced by an equally\nmusically dexterous humanoid robot. Neither the aspiring musicians nor the instructor\nwould probably care. However, somebody who had loved the musician philically, for\nhis \"essence,\" would not love the robot in the same manner, because the robot does not\npossess the musician‟s unique consciousness. Philia involves a relation between the\nconsciousness of the lover and beloved, which further cements its power as the highest\nform of love.\n\nContrary to modern belief, there is no one thing that defines \"real love.\" Our\nrelationships are interspersed with all three forms of love, eros, agape, and philia.\nAuthors such as Peck argue that agape is the highest form of love because agapic love\nfosters permanent spiritual growth. On the other hand, philosophers such as Plato assert\nthat eros is the highest form of love because it is the means to experience beauty.\nHowever, both forms of love fall short because they are unidirectional, and treat the\n\nCC.112 Paper Two\nbeloved as an objectified \"It.\" I believe the highest form of love is philia, because it\ntreats the beloved as a \"You,\" requires mutuality, and recognizes consciousness. When\nthe day comes that I can sincerely say the words, \"I love you,\" to somebody, I hope to\nbe experiencing a love close to philia. I hope that my lover and I will desire each other‟s\nqualities, nurture each other‟s growth, and most importantly, see one another as unique,\nconscious and irreplaceable human beings.\n\nCC.112 Paper Two\nReferences\n\nBuber, M. (1937). I and Thou. [Accessed online]\nPeck, M. S. (1978). The Road Less Travelled: A New Psychology of Love, Traditional Values\nand Spiritual Growth. [Accessed online]\nPlato. The Symposium. [Accessed online: http://www.perseus.tufts.edu]\nTristan and Iseult. [Accessed online]\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nCC.112 Philosophy of Love\nSpring 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Head Over \"Feels\" in Love: The Emerging Synthesis of \"Love as Feeling\" and \"Love as Intention\"",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/cc-112-philosophy-of-love-spring-2013/8b1aead3c772a291237d2bee6b30b067_MITCC_112S13_Paper1.pdf",
      "content": "Professor Lee Perlman\nCC.112 Philosophy of Love - Paper 1\n\nHead Over \"Feels\" in Love: The Emerging Synthesis of \"Love as Feeling\" and \"Love as\nIntention\"\n\nIf people nowadays to were asked to describe \"love,\" their replies would most likely\nrange from \"Love is the feeling of butterflies fluttering in your stomach\" to \"Love is that warm\nfeeling in your heart.\" Contrary to the modern notion that love is a \"feeling,\" many philosophers\nand writers across time have disputed that love is actually a conscious choice - an intention that\nleads to action. What is the relationship between \"love as feeling\" and \"love as intention\"? Can\na synthesis of the two be constructed, and if so, what would this fusion entail? Some\nintellectuals claim that \"love as feeling\" and \"love as intention\" bear a hierarchal relationship, in\nwhich one form of love develops into the other. However, I venture to claim that these two\nopposing forms of love, in fact, bear a mutually dependent relationship.\nIn this paper, I will first examine the natures of \"love as feeling\" and \"love as\nintention,\" using examples drawn from literature, film, essays, and philosophical ideologies. I\nwill then examine the two most intriguing views on the relationship between \"love as feeling\"\nand \"love as intention.\" One view is that \"love as feeling\" is a nascent form of love that\ndevelops into \"love as intention.\" The second view entails almost the opposite. It claims that\n\"intentional\" acts of love actually generate \"feelings\" of love. Taking these two views into\naccount, I will then explore how the synthesis of these two forms of love results in two\n\ncomponents of human growth: the appreciation of sensuality, and the pursuit of beauty. My\nultimate goal is to demonstrate that \"love as feeling\" and \"love as intention\" bear a mutually\ndependent, cyclic relationship. If I can then adequately refute possible objections to my\nargument, I will consider my thesis substantiated.\n\n\"Love as feeling\" is essentially characterized by three elements: It is passive in nature,\nis heteronomous, and embodies Eros. The passive nature of \"love as feeling\" is manifested in\nWestern film and literature. In Casablanca and Tristan and Iseult, the pairs of lovers are\nbrought together primarily due to external circumstances. In Casablanca, these external forces\nare symbolized by World War Two, and in Tristan and Iseult, the \"wine of love\" (Tristan and\nIseult, p.37). Due to this passivity, this form of love is essentially heteronomous. As the\nexcitement of Tristan and Iseult's affair is ignited by the obstacle that is King Mark, and the\nflame between Rick and Ilsa is fueled by the threat of the ongoing war, the passion that\naccompanies \"love as feeling\" is governed by external factors. Similar to the way Tristan is\nhelplessly cast adrift by the sea many instances in his life, \"love as feeling\" is an overpowering\nemotion that is beyond human control. Furthermore, \"love as feeling\" often embodies Eros, for\nit is bodily and entails intense \"desire [that is] greater than mortal will\" (Tristan and Iseult, p.\n41). It is this passive, heteronomous, and bodily \"love as feeling\" that many people nowadays\nare perhaps familiar with.\n\"Love as intention,\" on the other hand, is active in nature, is autonomous, and\nembodies Agape. \"Love as intention\" encompasses a will that is strong enough to be translated\ninto action. As this form of love stems from one's own will, it is autonomous in nature. Peck\nespecially condones this form of love, as he defines love as \"an act of will - namely, both an\nintention and an action... [that] also implies choice\" (Peck 1978, p. 83). \"Love as intention\" is\n\noften a recurring element in religious and political ideologies that preach non-violence and\nforgiving, Agapeic love.\n\nNow that the natures of these two forms of love have been distinguished, we may\nexamine the two perspectives regarding the relationship between the two. One view exhibited in\nWestern culture is that \"love as feeling\" is a nascent form of love, which matures into \"love as\nintention.\" This view is embedded in Michael Curtiz's Casablanca as well as Scott Peck's The\nRoad Less Travelled.\n\nCasablanca illustrates the development of \"love as feeling\" into \"love as intention.\" In\nthe opening of the film, Rick is portrayed as a bitter man who still peels at the scabs of his\nemotional wounds from a long-lost love. However, when Ilsa reenters his life and declares she\nhas remained steadfast in her love for him, Rick transforms from a narcissistic cynic to a noble\nhero who sacrifices his happiness for the good of the Allied war effort. The love between Ilsa\nand Rick begins as Eros - an intense and passionate \"love of feeling\" during their honeymoon-\nlike days in Paris - but matures into Agapeic \"love of intention\" that brings about constructive\ngood for their society. Curtiz portrays \"love as intention\" as a mature form of love that, by\ntranscending earthly pleasures and selfish desires, brings good to both the lovers and the world\nthey live in.\n\nPeck also contends to the idea that \"love as feeling\" matures into \"love as intention\" in\nThe Road Less Travelled. This is apparent in his description of the process of how \"falling in\nlove\" transforms into \"real love\" (Peck 1978, p. 94). The Peckian notion of \"falling in love\"\ncoincides with that of \"love as feeling.\" He elaborately describes it as a \"sex-linked erotic...\nfeeling of ecstatic lovingness\" (p. 84-85), making it explicitly clear that it is neither \"an act of\nwill\" nor a \"conscious choice\" (p. 88). However, Peck proceeds to claim that \"falling in love\"\n\ncan indeed develop into \"the work of real loving\" (p. 88). The temporary collapse of ego\nboundaries can result in a permanent extension of those boundaries; the familiarity with\nanother's private soul can enable true compassion towards one's lover; the illusion of unity may\ngradually grow into true attachment that nourishes the spiritual growth of both lovers. Similar to\na temporary architectural scaffold that is later demolished, \"love as feeling\" is the indispensable\nfirst stage of what will mature into a truer \"love as intention.\"\n\nWhereas the claims we have just examined view \"love as intention\" as a derivative of\n\"love as feeling,\" other intellectuals argue the complete opposite. Another view on the\nrelationship between the two forms of love is that \"love as intention\" gives rise to the actions\nthat actually induce \"love as feeling.\" This perspective is manifested in various religious and\nphilosophical ideology, most notably that of Sivananda.\n\nSivananda's philosophy on Ahimsa claims that acts of \"love as intention\" can actually\ngenerate \"love as feeling.\" In Bliss Divine, Sivananda commands that Ahimsa be practiced by\n\"try[ing] to control the physical body and speech first\" (Sivananda, p. 3). Only once one has\nsuccessfully carried out these intentions will he \"enjoy the highest peace, bliss and immortality\"\n(p. 4). According to this philosophy, an initial \"feeling\" or emotion does not propagate the\naction of love, but quite the opposite. An intentional, loving act implants the seeds in one's soul,\nfrom which feelings of love subsequently grow. It is important to note here that \"love\" in this\ncontext takes on a slightly different nuance than \"love\" as portrayed in Western film and\nliterature. \"Love\" in the context of Ahimsa is perhaps better interpreted as a selfless love\ndirected towards all of humanity. In the ideology of Sivananda, \"love as intention\" generates\n\"love as feeling.\"\n\nAbraham Lincoln once declared, \"When I do good, I feel good... That's my religion.\"\n\nDespite the simplicity of this statement, I find from personal experience that it rings with much\ntruth. In high school, I undertook a challenge in handling a classmate who had been unpleasant\ntowards my friend and me for the previous two years. I decided to act lovingly towards him.\nOne day, I cheerfully greeted him, to his mild surprise. A few days later, I offered assistance for\na homework problem he was struggling with. Soon the classmate ceased to emanate the hostility\nthat had been there for so long, and we embarked on the beginning of new friendship.\nSurprisingly, I also found that a warm sense of peacefulness and love had arisen within me. The\nact of willingly practicing \"love as intention\" gave rise to \"love as feeling,\" not only towards\nmy classmate, but also within myself.\n\nSo far we have examined two perspectives on the connection between \"love as feeling\"\nand \"love as intention.\" Although these two views do contain an element of truth, they\nultimately fall short in creating an organic synthesis between the two forms of love. This is\nprimarily due to the fact that these arguments imply a hierarchal relationship between the two\nforms of love. In one view, \"feeling\" can mature into \"intention.\" In the other view, \"intention\"\ncan generate \"feeling.\" However, in neither view do the two forms of love converge. I venture\nto claim that both \"love as feeling\" and \"love as intention\" are mutually dependent, and bear a\ncyclic relationship. I will explore how the synthesis of the two forms of love produces two\ncomponents of human growth: the appreciation of sensuality and the pursuit of beauty.\n\nOne of the products of the synthesis of \"love as feeling\" and \"love as intention,\" is\nhuman sensuality. Literature across time has portrayed the inherent connection between sex and\nlove. Contrary to common belief nowadays, the act of sex does not involve solely the physical\nact, but also encompasses a spiritual aspect. As Patrick Lee and Robert George define in What\nSex Can Be, sex is a \"unitary, multi-leveled personal communion\" (George & Lee, p. 19). Due\n\nto its intrinsically bodily and entangling emotional nature, sensuality embodies \"love as feeling.\"\nHowever, it also involves \"love as intention\" between the two lovers, for the consequences of\nthis act are profound. It is an act of completely exposing oneself to another, and more\nimportantly, is the act of implanting the seeds of human life. The role of love in sensuality is\nportrayed in Lady Chatterley's Lover. The dichotomy of the \"mind\" and the \"machine\" is\npainfully highlighted in Connie's society, in which the upper class coldheartedly exploits\nlaborers to satiate their materialistic greed. Connie is suffocated by the \"nothingness... of words\"\n(Lawrence), which demonstrates that love cannot be sustained through solely an intellectual\nconnection. There must be an active component to the love, a \"love of intention,\" which is\nlacking in Connie and Clifford's relationship. Mellors, on the other hand, is a classless\nindividual who possesses characteristics of both the \"mind\" and the \"machine.\" He is educated\nand intelligent, yet refuses to join the upper class and prefers manual labor. He symbolizes the\nemerging synthesis of minds and machines: the living human body. This draws a parallel with\nthe fact that he also represents the synthesis between \"love as feeling\" and \"love as intention.\"\nLove is the interaction of living bodies. Thus, solely having \"intentions\" like an inert machine,\nor solely having \"feelings\" like a disembodied mind, is not sufficient to achieve this love. As\nMellors synthesizes the mind and the machine, true love only comes about through the synthesis\nof feeling and intention. This synthesis of \"love as feeling\" and \"love as intention,\" in the\nLawrencian world, produces the sensuality that allows Connie to survive in the dehumanizing\natmosphere she struggles in.\n\nAnother significant product of the synthesis of \"love as feeling\" and \"love as intention\"\nis the pursuit of beauty. Jane Campion portrays this through Baines' love for Ada in The Piano.\nAt a first glance, Baines' love appears to be far from true love, and even seems to verge on\ninfatuated, manipulative lust. The scenes in which Baines coerces Ada into exposing her body\n\nin exchange for her access to the piano present \"love as feeling\" at its highest intensity, almost\nto level that is disconcerting. However, if one observes Baines more closely, one realizes that\nunderlying this seemingly barbaric \"love as feeling\" is actually an Agapeic \"love as intention.\"\nThe synthesis of the two forms of love is manifested in his pursuit of the beauty that Ada\nexpresses through her masterful piano performance. Having been confined to the rigid world of\nutilitarianism all his life, Baines is appalled when he first glimpses into Ada's world of pure,\nunsullied beauty, as he listens to her perform on the seashore. Immediately driven by a longing\nfor this beauty, he makes every effort to come closer to the beauty Ada embodies. His pursuit\nencompasses both Erotic \"love as feeling\" and Agapeic \"love as intention.\" The latter manifests\nitself through all his acts of compassion: taking tender care of the piano, complying with Ada's\nwish to throw it overboard when leaving New Zealand, and crafting Ada a silver index finger\nwhen beginning their new life. Campion demonstrates that the synthesis of \"love as feeling\" and\n\"love as intention\" embodies the pursuit of beauty - a beauty that is otherworldly, captivating,\nand magical to Baines.\n\nOne may object to my claim by arguing that \"love as feeling\" and \"love as intention\"\nare such starkly conflicting entities that they cannot coexist. One may believe that is\ncontradicting to say that one can be passive and active at the same time, or be autonomous and\nheteronomous simultaneously. However, I refute that this is not a contradiction, but is rather a\nmanifestation of the complexity of human relationships. Whether it is a relationship with a\nloved one, a friend, or an enemy, one can be passive and active, or autonomous and\nheteronomous, all at once. In my relationship with my mother, I have no control over the fact\nthat I am indebted to her and have passively received her love all these years - yet I have the\npower to love her back and try to repay her loving in any way I can. When I feel attracted\ntowards another being, I have no control over my intense admiration and yearning to become\n\ncloser to them - yet I have the power to channel that energy into performing small acts of\nkindness to brighten that person's day. Our emotions may be outside our control, but how we\ndecide to respond to those emotions is our conscious choice. We humans are inherently a\ncurious blend of passivity and activity, of dependence and independence, and of internal\nemotions and external actions. It is only natural that both love as \"feeling\" and as \"intention,\"\ndespite their contradictory natures, can both arise within oneself.\n\nDespite the fact that they are both forms of love, \"love as feeling\" and \"love as\nintention\" oppose one another in almost every way. \"Love as feeling\" is passive, heteronomous,\nbodily, and Erotic. \"Love as intention,\" on the other hand, is active, autonomous, mental, and\nAgapeic. Writers, artists and philosophers across time have conceived of various views on the\npossible relationship between these two forms of love. Some believe that \"love as feeling\" is an\nimmature form of love that develops into \"love as intention,\" while others affirm that \"love as\nintention\" is responsible for giving rise to \"love as feeling.\" Both perspectives certainly contain\nan element of truth, but the true relationship between the two forms of love lies within the\nsynthesis of the two. When the two forms of love converge, two components of human growth\nemerge. Sensuality transforms one into a living being, and the pursuit of beauty propagates\nthem towards a life-long goal. As such, I believe that \"love as feeling\" and \"love as intention\"\ngo hand in hand. The two forms of love mutually reinforce one another. An intense \"feeling\" of\nlove drives us to perform acts of \"intentional\" love, which in turn enlarges our tender \"feelings\"\nof love even further. The organic relationship between \"love as feeling\" and \"love as intention\"\nis therefore perhaps cyclic, and elevates us towards the pinnacle of human growth.\n\nReferences\n\nChapman, J. (Producer), and Campion, J. (Director). (1993). The Piano [Motion picture].\nAustralia: Australian Film Commission.\nGeorge, R. P., & Lee, P. What Sex Can Be: Self-Alienation, Illusion, or One-Flesh Unity.\n[Accessed online]\nLawrence,\nD.\nH.\n(1928).\nLady\nChatterley's\nLover.\n[Accessed\nonline:\nhttp://www.gutenberg.net.au/ebooks01/0100181.txt]\nPeck, M. S. (1978). The Road Less Travelled: A New Psychology of Love, Traditional Values\nand Spiritual Growth. [Accessed online]\nSivananda, S. S. Bliss Divine. [Accessed online]\nWallis, H. B. (Producer), & Curtiz, M. (Director). (1942). Casablanca [Motion picture]. United\nStates: Warner Bros.\nTristan and Iseult. [Accessed online]\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nCC.112 Philosophy of Love\nSpring 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Writing a Paper For Me",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/cc-112-philosophy-of-love-spring-2013/18e9a03a5cf2f562533d85f128dd0562_MITCC_112S13_WritingAPaper.pdf",
      "content": "Writing a Paper For Me\n\n\" 'All you have to do is write one true sentence. Write the truest sentence you\nknow.' So finally I would write one true sentence, and then go on from there.\nIt was easy then because there was always one true sentence that I knew or had\nseen or had heard someone say. If I started to write elaborately, or like\nsomeone introducing or presenting something, I found that I could cut the\nscrollwork or ornament out and throw it away and start with the first true\nsimple declarative sentence I had written.\" - Ernest Hemingway, A Moveable Feast\n\nPreparing to Write\n\n[1] Choose your theme/question\n[2] Articulate for yourself the two most interesting opposing positions on this question.\n[3] Decide which side of this divide you will fall on. Write down for yourself the initial reasons that you\nfall on this side. These may not be the strongest arguments, but you want to develop those arguments\nfrom your true convictions and strong intuitions.\n[4] Outline your argument. You will probably deviate from the outline, but it is still useful for getting\nstarted and keeping on track.\n\nThe Paper\n\n[1] Clearly state the question you intend to answer in the opening paragraph. It is helpful if you give the\nreader a sense of the direction your argument will take. For instance \"I intend to demonstrate X. If I can\ndemonstrate Y and Z, which, I will argue, entail X, then I will consider my thesis substantially\nsupported.\" You can greatly influence the way your paper is read by the way you set it up. If you specify\nyour own criteria for success in the argument, the reader will most likely judge you by those criteria.\nMost good opening paragraphs are written after the paper has been completed, though it is good to run\nthis through as an exercise before writing the rest of the paper.\n\n2] Please avoid filler: \"The question of the nature of love has puzzled humankind since the dawn of time.\nMany a night by the campfire did our Cro-Magnon ancestors gaze at the stars and.....blah blah.\" Just cut\nto the argument. I am not opposed to beautiful prose, but every word in your paper should advance your\narguments.\n\n[2] As your argument proceeds, give continuing clear signals of where it has been and where it is headed.\nTurn signals, sub-conclusions when a part of the argument is concluded, sentences linking two sub-\narguments, anticipation of coming arguments - it is much better to err on the side of over-explaining the\nargument to the reader than under-explaining it. Subheadings within the paper are often helpful.\n\n[3] When you have concluded your argument, step into the shoes of your cleverest opponents and give me\ntheir most important and persuasive objections to your argument. Then tell me why I should not be\nconvinced by those arguments.\n\nHemingway, Ernest. A Moveable Feast. Simon and Schuster, 2010.\n\n(c) Simon and Schuster. All rights reserved. This content is excluded from our Creative Commons license. For more\ninformation, see http://ocw.mit.edu/fairuse\n\n[4] Your concluding paragraph should really sum up the argument, reminding me of the course it has\ntaken, of the criteria of success you set for yourself and how you have fulfilled it.\n\n[5] An honest conclusion is better than b.s. A paper which admits that it has fallen short of proving its\ncase can be an excellent paper. If, in addition, you can give some suggestions about what direction you\nmight take to strengthen the argument in the future, I will admire your honest appraisal of your situation.\nIf you conclude that 'Therefore, obviously, the question of the nature of love has been solved.' or some\nsuch, I will have you committed to the ward for deluded undergraduates.\n\nAfter The Paper\n\nA good way of telling if your argument proceeds in an orderly fashion is to try to outline the paper when\ncompleted. If it can be reduced to standard outline form, then you have an orderly argument. If not, you\nmay need to do some rearranging.\n\nRandom Tips\n\n1] IN THE AGE OF SPELLCHECK, MISPELLED WORDS ARE A SIGN THAT THIS PAPER\nWAS NOT EVEN IMPORTANT ENOUGH FOR YOU TO PUSH A BUTTON AT THE END.\n\n2] YOUR PAPER SHOULD SHOW SIGNS OF THINKING AND RE-THINKING BEFORE\nBEGINNING TO WRITE.\n\n3] MY PET PEEVES:\n\nA] WORDS YOU ARE FORBIDDEN TO USE IN YOUR PAPERS WITHOUT SAYING\nPRECISELY WHAT YOU MEAN BY THEM: OBJECTIVE, SUBJECTIVE, REAL.\n\nB] YOU CANNOT USE THE WORD 'VALID' TO REFER TO ANYTHING OTHER\nTHAN A PROPERLY CONSTRUCTED ARGUMENT.\n\nTechnical\n\n1] No name on papers, only I.D. #\n2] You must number your pages\n3] Papers submitted via email (details will be given in class)\n4] Preferred format is Word or RTF. If you must use Open Office, that is acceptable, though a bit of a\npain. Please do not send a PDF, as I will just have to convert it in order to add comments.\n5] You do not need to consult any material other than what we have read for class.\n6]. I am not a stickler for length, but if your paper is short and it seems clear that you could have\nprofitably said more, then this will count against you. If you have run out of things to say, try the\ntechnique of stepping into the shoes of your worthiest opponent.\n\nLee Perlman\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nCC.112 Philosophy of Love\nSpring 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}