{
  "course_name": "Physics II: Electricity and Magnetism",
  "course_description": "This freshman-level course is the second semester of introductory physics. The focus is on electricity and magnetism. The subject is taught using the TEAL (Technology Enabled Active Learning) format which utilizes small group interaction and current technology. The TEAL/Studio Project at MIT is a new approach to physics education designed to help students develop much better intuition about, and conceptual models of, physical phenomena.\nStaff List\nVisualizations:  \nProf. John Belcher\nInstructors:  \nDr. Peter Dourmashkin  \nProf. Bruce Knuteson  \nProf. Gunther Roland  \nProf. Bolek Wyslouch  \nDr. Brian Wecht  \nProf. Eric Katsavounidis  \nProf. Robert Simcoe  \nProf. Joseph Formaggio\nCourse Co-Administrators:  \nDr. Peter Dourmashkin  \nProf. Robert Redwine\nTechnical Instructors:  \nAndy Neely  \nMatthew Strafuss\nCourse Material:  \nDr. Peter Dourmashkin  \nProf. Eric Hudson  \nDr. Sen-Ben Liao\nAcknowledgements\nThe TEAL project is supported by The Alex and Brit d’Arbeloff Fund for Excellence in MIT Education, MIT iCampus, the Davis Educational Foundation, the National Science Foundation, the Class of 1960 Endowment for Innovation in Education, the Class of 1951 Fund for Excellence in Education, the Class of 1955 Fund for Excellence in Teaching, and the Helena Foundation. Many people have contributed to the development of the course materials. (PDF)",
  "topics": [
    "Science",
    "Physics",
    "Electromagnetism",
    "Science",
    "Physics",
    "Electromagnetism"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1 hour / session\n\nProblem Solving: 1 session / week, 1 hour / session\n\nCourse Overview\n\nElectromagnetism I is an introduction to electromagnetic fields and forces. Electromagnetic forces quite literally dominate our everyday experience. The reason you do not fall through the floor to the center of the earth as you are reading this is because you are floating on (and held together by) electrostatic force fields. However, we are unaware of this in a visceral way, in large part because electromagnetic forces are so enormously strong, 10^40 times stronger than gravity.\n\nBecause of the strength of electromagnetic forces, any small imbalance in net electric charge gives rise to enormous forces that act to try to erase that imbalance. Thus in our everyday experience, matter is by and large electrically neutral, and our direct experience with electromagnetic phenomena is disguised by many subtleties associated with that neutrality. This is very unlike our direct experience with gravitational forces, which is straightforward and unambiguous.\n\nThe objectives of this course are to tease out the laws of electromagnetism from our everyday experience by specific examples of how electromagnetic phenomena manifest themselves. We want to be able:\n\nTo describe, in words, the ways in which various concepts in electromagnetism come into play in particular situations;\n\nTo represent these electromagnetic phenomena and fields mathematically in those situations;\n\nAnd to predict outcomes in other similar situations.\n\nThe overall goal is to use the scientific method to come to understand the enormous variety of electromagnetic phenomena in terms of a few relatively simple laws.\n\nPrerequisites\n\n8.01 Physics I: Classical Mechanics\n\nFormat\n\nThis course is taught in the TEAL/Studio Physics format. This course format differs substantially from the lecture/recitation format. In this format, classes are held three times a week, twice in a two-hour block, and once in a one-hour block. Students sit at tables of nine in a specially designed classroom, with three groups of three students at each table. Mini-lectures are interspersed with desktop experiments and group problem solving and discussion. The one-hour session on the third session of the week is reserved entirely for problem solving.\n\nThe course design is based on the following premises:\n\nInteraction between teacher and student is an important factor in promoting learning;\n\nInteraction among students is another;\n\nActive learning is better than passive learning;\n\nHands-on experience with the phenomena under study is crucial.\n\nCollaborative Work\n\nScientists and engineers work in groups as well as alone. Social interactions are critical to their success. Most good ideas grow out of discussions with colleagues. This subject encourages collaborative teamwork. As you study together, help your partners, ask each other questions, and critique your group homework and lab write-ups. Teach each other! You can learn a great deal by teaching others.\n\nCourse Notes, Course Reader, Experiment Write-Ups, and Optional Textbook\n\nThe course content is contained in the 8.02 Course lecture notes. Students also need the \"8.02 Course Reader.\" This reader contains a number of different materials that you will need for the course, including experiment write-ups. You should bring this reader to class with you consistently, as it contains a lot of material that will be used in class and handed in. (Note for OCW users: The experimental write-ups and other materials included in the Course Reader are included in this OCW Web site.)\n\nIn addition, we use many visualizations in the course.\n\nIf you feel you need to consult a textbook for additional insight or for a different perspective, just about any of the standard introductory textbooks on electromagnetism will do. For your convenience, we reference relevant chapters of the following texts in the summaries:\n\nSerway, Raymond A., and John W. Jewett.\nPhysics for Scientists and Engineers (with PhysicsNOW and InfoTrac)\n. Belmont, CA: Thomson-Brooks/Cole, 2003. ISBN: 9780534408428.\n\nTipler, Paul A., and Gene Mosca.\nPhysics for Scientists and Engineers: Extended Version\n. New York: W.H. Freeman, 2003. ISBN: 9780716743897.\n\nGiancoli, Douglas C.\nPhysics for Scientists and Engineers with Modern Physics\n. Vol. 2. Upper Saddle River, NJ: Pearson Education, 2007. ISBN: 9780130215192.\n\nYoung, Hugh D., and Roger A. Freedman.\nUniversity Physics with modern Physics\n. San Francisco, CA: Addison-Wesley, 2003. ISBN: 9780805386844.\n\nResnick, Robert, David Halliday, and Kenneth S. Krane.\nPhysics\n. Vol. 2. New York, NY: Wiley, 2001. ISBN: 9780471401940.\n\nThese texts are expensive, and we strongly advise you to make sure that you are comfortable reading them before you go ahead and purchase them. The idea of purchasing any supplemental text is to get a different perspective on things that are written in a style accessible to you, so shop around a little before making your decision. Any edition of any of these texts will do. It should be straightforward for you to figure out which sections in your text are relevant.\n\nHonesty on Course Work\n\nYou are welcome to and encouraged to work on the homework problems with fellow students. However, the work you submit should be your own and reflect your own understanding of the subject. For in-class work, you must be present and personally write your name on any material which is turned in in that class.\n\nReadings\n\nYou are responsible for reading the Course Notes and working assigned problems. You will sometimes be assigned homework problems on material that has not yet been covered in class. You should start homework early and get help if needed before the due date.\n\nBefore Class Reading\n\nThere is a short reading assignment (Summary) which covers the material in the up-coming class. We urge you to read this summary before coming to class.\n\nWritten Homework\n\nThere will be one homework handed in on paper each week. To receive full credit for your hardcopy homework handed in, you must prepare and submit lucid and clearly reasoned written solutions. These problems will be graded and returned. (Note: Written homework assignments are not available to OCW users.)\n\nIn-class Group and Personal Assignments\n\nIn almost all classes, individuals and groups (see below) will submit answers to questions about desktop experiments done in class, material covered in the lecture in that class, and so on. You must be present in class to receive credit for assignments submitted either by you or by your group.\n\nGroup Work\n\nYou will be assigned to a group of three for collaborative work. Your group assignment will be announced near the beginning of the term. If you are not satisfied with the way your group is working, first try to discuss it with your group members. If you cannot arrive at a satisfactory solution, then discuss the problems with your instructor.\n\nLaboratory\n\nYou will be offered hands-on, inquiry-based activities during the class period. These labs allow you to discover various aspects of a physics concept. Labs will vary in length and complexity and will be done in groups.\n\nTests\n\nThree 11⁄2 hour tests will be given. There will be a final in the course. The final will be a comprehensive exam and will cover all of the subject material.\n\nGrades\n\nGrades are not curved in this subject. If everyone in the class does well, everyone can get an A. Once the final course grade has been computed at the end of the term, grades will be assigned adhering strictly to the break-points below. Grades (+/-) will be assigned based on your overall, weighted class average using the weighting scheme presented below.\n\nTASKS\n\nWEIGHTS\n\nTests + Final\n\n45% + 25%\n\nProblem sets\n\n10%\n\nMastering physics\n\n4%\n\nFriday problem solving\n\n6%\n\nExperiments\n\n6%\n\nConcept questions\n\n4%\n\n100%\n\nBREAKPOINTS\n\n+\n\n-\n\nA\n\n\\>= 95\n\n< 95 and >= 90\n\n< 90 and >= 85\n\nB\n\n< 85 and >= 80\n\n< 80 and >= 75\n\n< 75 and >= 70\n\nC\n\n< 70 and >= 67\n\n< 67 and >= 64\n\n< 64 and >= 60\n\nD\n\n< 60 and >= 55\n\nF\n\n< 55",
  "files": [
    {
      "category": "Resource",
      "title": "visualizn_links.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-02-physics-ii-electricity-and-magnetism-spring-2007/79c95fa1862a1f33d6b79b40448ce14a_visualizn_links.pdf",
      "content": "Several of the figures in the Course Notes have relating animations or interactive\nsimulations that can be found on the Visualizations page. The following table\nlists which figures in the course notes have associated animations and links to\nthe corresponding visualization.\n\nCHAPTER\n(from Course Notes)\nFIGURE\nVISUALIZATION\nChapter 1\n1.4.1(a)\nA Particle Sink\n\n1.4.1(b)\nA Particle Source\n\n1.4.2\nA Fluid Flow with a\nSource\n\n1.4.3(a)\nA Fluid Flow with a\nSource and Sink\n\n1.4.3(b)\nA Fluid Flow with Two\nSources\n\n1.4.4\nA Source and a Constant\nFlow\n\n1.4.5(a)\nA Circulating Flow of\nParticles\n\n1.4.5(b)\nA Fluid Flow with a\nCirculation\n\n1.4.6(a)\nA Fluid Flow with Two\nCirculations in the Same\nSense\n\n1.4.6(b)\nA Fluid Flow with Two\nCirculations in Opposite\nSenses\n\n1.4.7\nA Circulation and a\nConstant Flow\n\n1.4.8\nA Fluid Flow with a\nCirculation and a Source\n\n1.8.4\nTwo Point Charges\nChapter 2\n2.2.2(a)\nA van de Graaff\nGenerator Repelling a\nCharge\n\n2.2.2(b)\nA van de Graaff\nGenerator Attracting a\nCharge\n\n2.4.1(a)\nElectric Field of a Moving\nPositive Charge\n\n2.4.1(b)\nElectric Field of a Moving\nNegative Charge\n\n2.7.3\nElectric Field of a Dipole\n\nChapter 4\n4.6.2(a) and (b)\nCharge Moving in a\nConstant Field\n\n4.6.4(a) and (b)\nCharge Moving in a\nConstant Field\n\n4.6.5\nRepulsion of Charges\nwith Same Sign\n\n4.6.6\nAttraction of Charges\nwith Opposite Sign\nChapter 5\n5.2.3\nThe Capacitor\n\n5.4.2\nThe Electrostatic Force\nExperiment\n\n5.6.1(a), (b), and (c)\nCreating Electric Fields\n\n5.6.2\nCreation of an Electric\nDipole\n\n5.6.3\nCreating an Electric Field\n\n5.8.1(a)\nScattering of Charges of\nOpposite Sign\n\n5.8.1(b)\nScattering of Charges of\nSame Sign\n\n5.8.2\nMolecules\n\n5.8.3\nInteractive Molecules 2D\n\n5.8.4\nInteractive Molecules 3D\n\n5.8.5\nInteractive Dipoles\n\n5.8.6\nThe Ion Trap\n\n5.8.7\nLattices 3D\n\n5.8.8\nThe Suspension Bridge\n2D\n\n5.8.9\nThe Suspension Bridge\n3D\nChapter 8\n8.4.5\nThe Dip Needle\n\n8.4.6\nThe Earth and a Giant\nDip Needle (Far)\n\n8.5.3\nCharge Moving in a\nMagnetic Field (Front)\nChapter 9\n9.1.2\nThe Magnetic Field of a\nCurrent Element\n\n9.1.8(a)\nThe Magnetic Field of a\nMoving Positive Charge\n\n9.1.8(b)\nThe Magnetic Field of a\nMoving Negative Charge\n\n9.1.9\nMagnetic Field of Four\nCharges Moving in a\nCircle\n\n9.1.10\nIntegrating Around a Ring\nof Current\n\n9.1.11\nThe Ring of Current\n\n9.2.2(a)\nTwo Wires in Parallel\n\n9.2.2(b)\nTwo Wires in Series\n\n9.5.4\nA Bar Magnet in the\nEarth's Magnetic Field\n\n9.9.3(a)\nThe Magnetic Field of a\nHelmholtz Coil (aligned)\n\n9.9.3(b)\nTwo Rings of Current\nAttracting\n\n9.9.6(a)\nThe Magnetic Field of a\nHelmholtz Coil (anti-\naligned)\n\n9.9.6(b)\nTwo Rings of Current\nRepelling\n\n9.9.7\nThe TeachSpin(tm)\nApparatus\n\n9.9.8\nMagnet Oscillating\nBetween Two Coils\n\n9.9.9\nMagnet Suspended\nBetween Two Coils\nChapter 11\n11.3.1\nCreating a Magnetic Field\n\n11.3.2\nThe Levitating Ring\n\n11.3.3\nThe Falling Ring with\nFinite Resistance\n\n11.9.4(a) and (b)\nThe Force on a Moving\nCharge in a Time-\nChanging Field\nChapter 13\n13.8.5\nElectric Dipole Radiation\n\n13.8.6\nElectric Dipole Radiation\nReversing\n\n13.8.7(a)\nRadiation Pattern of a\nQuarter Wave Antenna\n\n13.8.7(b)\nRadiation from a Quarter\nWave Antenna"
    },
    {
      "category": "Resource",
      "title": "summary_w01d1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-02-physics-ii-electricity-and-magnetism-spring-2007/0bcac6d3d5b76d6793626daf35fedf5c_summary_w01d1.pdf",
      "content": "Summary of Class 01\n8.02\n\nTopics:\nIntroduction to TEAL; Fields; Review of Gravity; Electric Field\nRelated Reading:\n\nCourse Notes (Liao et al.):\nSections 1.1 - 1.6; 1.8; Chapter 2\n\nTopic Introduction\nThe focus of this course is the study of electricity and magnetism. Basically, this is the study\nof how charges interact with each other. We study these interactions using the concept of\n\"fields\" which are both created by and felt by charges. Today we introduce fields in general\nas mathematical objects, and consider gravity as our first \"field.\" We then discuss how\nelectric charges create electric fields and how those electric fields can in turn exert forces on\nother charges. The electric field is completely analogous to the gravitational field, where\nmass is replaced by electric charge, with the small exceptions that (1) charges can be either\npositive or negative while mass is always positive, and (2) while masses always attract,\ncharges of the same sign repel (opposites attract).\n\nScalar Fields\nA scalar field is a function that gives us a single value of some variable for every point in\nspace - for example, temperature as a function of position. We write a scalar field as a scalar\nfunction of position coordinates - e.g. (\n)\n, ,\n, ( , , )\nT x y z\nT r θ φ , or, more generically, ( )\nT rG . We\ncan visualize a scalar field in several different ways:\n\n(A)\n\n(B)\n\n(C)\n\nIn these figures, the two dimensional function\n(\n)\n(\n)\n1/3\n( , )\nx y\nx\ny\nd\nx\ny\nd\nφ\n=\n-\n+\n+\n+\n-\nhas\nbeen represented in a (A) contour map (where each contour corresponds to locations yielding\nthe same function value), a (B) color-coded map (where the function value is indicated by the\ncolor) and a (C) relief map (where the function value is represented by \"height\"). We will\ntypically only attempt to represent functions of one or two spatial dimensions (these are 2D)\n- functions of three spatial dimensions are very difficult to represent.\nVector Fields\nA vector is a quantity which has both a magnitude and a direction in space (such as velocity\nor force). A vector field is a function that assigns a vector value to every point in space - for\nSummary for Class 01\n\np. 1/2\n\nSummary of Class 01\n8.02\n\nexample, wind speed as a function of position. We write a vector field as a vector function of\nposition coordinates - e.g. (\n)\n, ,\nx y z\nF\nG\n- and can also visualize it in several ways:\n\nHere we show the force of gravity vector field in a 2D plane passing through the Earth,\nrepresented using a (A) vector diagram (where the field magnitude is indicated by the length\nof the vectors) and a (B) \"grass seed\" or \"iron filing\" texture. Although the texture\nrepresentation does not indicate the absolute field direction (it could either be inward or\noutward) and doesn't show magnitude, it does an excellent job of showing directional details.\ne also will represent vector fields usin (C) \"field lines.\" A field line is a curve in space\nat is everywhere tangent to the vector field.\nield\" g\n(A)\n\n(B)\n\n(C)\nW\ng\nth\n\nGravitational Field\nAs a first example of a physical vector field, we recall the gravitational force between two\nmasses. This force can be broken into two parts: the generation of a \"gravitational f\nby the first mass, and the force that that field exerts on the second mass (\ng\nm\n=\nF\ng\nG\nG ). This way\nof thinking about forces - that objects create fields and that other objects then feel the effects\nof those fields - is a generic one that we will use throughout the course.\n\nElectric Fields\nEvery charge creates around it an electric field, proportional to the size of the charge and\ndecreasing as the inverse square of the distance from the charge. If another charge enters thi\nelectric field, it will feel a force\ns\n(\n)\nE\nq\n=\nF\nE\nG\nG\n.\nImportant Equations\n2 ˆ\ng\nMm\n= -G r\nF\nr\nG\n\nForce of gravitational attraction between two masses:\nStrength of gravitational field created by a mass M:\n2 ˆ\ng\nM\nG\nm\nr\n=\n= -\nF\ng\nr\nG\nG\n\nForce on mass m sitting in gravitational field g:\n\ng\nm\n=\nF\ng\nG\nG\n\nby a charge Q:\n\n2 ˆ\ne\nQ\nk r\n=\nE\nr\nG\n\nStrength of electric field created\nE\nq\n=\nF\nE\nG\nG\nForce on charge q sitting in electric field E:\n\nSummary for Class 01\n\np. 2/2\nImage courtesy of the National Oceanic and Atmospheric Administration."
    },
    {
      "category": "Resource",
      "title": "summary_w01d2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-02-physics-ii-electricity-and-magnetism-spring-2007/37f591ac0f4ad1bbb5f47667e3d4812a_summary_w01d2.pdf",
      "content": "Summary of Class 2\n8.02\nThursday 2/3/05 / Monday 2/7/05\nTopics:\nElectric Charge; Electric Fields; Dipoles; Continuous Charge Distributions\nRelated Reading:\nCourse Notes (Liao et al.):\nSection 1.6; Chapter 2\nSerway and Jewett:\nChapter 23\nGiancoli:\n\nChapter 21\nTopic Introduction\nToday we review the concept of electric charge, and describe both how charges create\nelectric fields and how those electric fields can in turn exert forces on other charges. Again,\nthe electric field is completely analogous to the gravitational field, where mass is replaced by\nelectric charge, with the small exceptions that (1) charges can be either positive or negative\nwhile mass is always positive, and (2) while masses always attract, charges of the same sign\nrepel (opposites attract). We will also introduce the concepts of understanding and\ncalculating the electric field generated by a continuous distribution of charge.\nElectric Charge\nAll objects consist of negatively charged electrons and positively charged protons, and hence,\ndepending on the balance of the two, can themselves be either positively or negatively\ncharged. Although charge cannot be created or destroyed, it can be transferred between\nobjects in contact, which is particularly apparent when friction is applied between certain\nobjects (hence shocks when you shuffle across the carpet in winter and static cling in the\ndryer).\nElectric Fields\nJust as masses interact through a gravitational field, charges interact through an electric field.\nEvery charge creates around it an electric field, proportional to the size of the charge and\n⎛ G\n⎞\ndecreasing as the inverse square of the distance from the charge\n⎝⎜ E = ke\nQ\n2 rˆ ⎟ . If another\nr\n⎠\nG\nG\ncharge enters this electric field, it will feel a force (FE = q E) . If the electric field becomes\nstrong enough it can actually rip the electrons off of atoms in the air, allowing charge to flow\nthrough the air and making a spark, or, on a larger scale, lightening.\nCharge Distributions\nElectric fields \"superimpose,\" or add, just as gravitational fields do. Thus the field generated\nby a collection of charges is just the sum of the electric fields generated by each of the\nindividual charges. If the charges are discrete, then the sum is just vector addition. If the\ncharge distribution is continuous then the total electric field can be calculated by integrating\nG\nthe electric fields d E generated by each small chunk of charge dq in the distribution.\nSummary for Class 02\np. 1/1\n\nSummary of Class 2\n8.02\nThursday 2/3/05 / Monday 2/7/05\nCharge Density\nWhen describing the amount of charge in a continuous charge distribution we often speak of\nthe charge density. This function tells how much charge occupies a small region of space at\nany point in space. Depending on how the charge is distributed, we will either consider the\nvolume charge density ρ = dq dV , the surface charge density σ = dq dA , or the linear\ncharge density λ = dq d A , where V, A and A stand for volume, area and length respectively.\nElectric Dipoles\nThe electric dipole is a very common charge distribution consisting of a positive and negative\ncharge of equal magnitude q, placed some small distance d apart. We describe the dipole by\nits dipole moment p, which has magnitude p = qd and points from\nthe negative to the positive charge. Like individual charges,\ndipoles both create electric fields and respond to them. The field\ncreated by a dipole is shown at left (its moment is shown as the\npurple vector). When placed in an external field, a dipole will\nattempt to rotate in order to align with the field, and, if the field is\nnon-uniform in strength, will feel a force as well.\nImportant Equations\nG\nk qQ\nElectric force between two charges:\n=\nFE\ne\n2 ,\nr\nRepulsive (attractive) if charges have the same (opposite) signs\nG\nStrength of electric field created by a charge Q:\nE = ke\nQ\n2 rˆ ,\nr\nrˆ points from charge to observer who is measuring the field\nG\nG\nForce on charge q sitting in electric field E:\nFE = qE\nG\nElectric dipole moment:\np = qd\nPoints from negative charge -q to positive charge +q. G\nG\nG\nTorque on a dipole in an external field:\nτ = p E\n×\nG\nq rˆi = 1 ∑\nq G\ni\ni\nElectric field from a discrete charge distribution:\nE =\n∑\nri\n4πε0\ni\n4πε0\ni\nri\nri\nG\nElectric field from continuous charge distribution:\nE = 1\ndq rˆ\n∫ 2\n4πε0 V r\n⎧ρdV\nfor a volume distribution\n⎪\nCharge Densities:\ndq = ⎨σdA\nfor a surface (area) distribution\n⎪⎩λdA\nfor a linear distribution\nImportant Nomenclature:\nˆ\nA hat (e.g. ˆA ) over a vector means that that vector is a unit vector ( A = 1)\nThe unit vector rˆ points from the charge creating to the observer measuring the field.\nSummary for Class 02\np. 2/2"
    },
    {
      "category": "Resource",
      "title": "summary_w01d3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-02-physics-ii-electricity-and-magnetism-spring-2007/83a9b66f2896c2bd1568b41bc478fe1c_summary_w01d3.pdf",
      "content": "Summary of Class MW 02/ TR 03\n8.02\n\nTopics:\nCoordinate Systems; Gradients; Line and Surface Integrals\nRelated Reading:\n\nSpring 2006 Math Review Presentation\nHale Bradt's Spring 2001 8.02 Mathematics Supplement\n\nTopic Introduction\nToday we go over some of the more advanced mathematical concepts we will need in the\ncourse, so that you see the mathematics before being introduced to the physics. Maxwell's\nequations as we will state them involve line and surface integrals over open and closed\nsurfaces. A closed surface has an inside and an outside, e.g. a basketball, and there is no two\ndimensional contour that \"bounds\" the surface. In contrast, an open surface has no inside\nand outside, e.g. a flat infinitely thin plate, and there is a two dimensional contour that\nbounds the surface, e.g. the rim of the plate. There are four Maxwell's equations:\n\n(1)\n(2)\n(3)\n(4)\nin\nS\nS\nB\nE\nenc\nC\nC\nQ\nd\nd\nd\nd\nd\nd\nI\ndt\ndt\nε\nμ\nμ ε\n⋅\n=\n⋅\n=\nΦ\nΦ\n⋅\n= -\n⋅\n=\n+\n∫∫\n∫∫\n∫\n∫\nE\nA\nB\nA\nE\ns\nB\ns\nG\nG\nG\nG\nG\nG\nG\nG\nw\nw\nv\nv\n\nEquations (1) and (2) apply to closed surfaces. Equations (3) and (4) apply to open surfaces,\nand the contour C represents the line contour that bounds those open surfaces.\n\nThere is not need to understand the details of the electromagnetic application right now; we\nsimply want to cover the mathematics in this problem solving session.\n\nLine Integrals\nThe line integral of a scalar function\nalong a path C is defined as\n( , , )\nf x y z\n\n( , , )\nlim\n( ,\n,\n)\ni\nN\ni\ni\ni\ni\nC\nN\ni\ns\nf x y z ds\nf x y z\ns\n→inf\n=\n∆→\n=\n∆\n∑\n∫\n\nwhere C has been subdivided into N segments, each with a length\nis\n∆.\n\nLine Integrals Involving Vector Functions\nFor a vector function\n\nˆ\nˆ\nˆ\nx\ny\nz\nF\nF\nF\n=\n+\n+\nF\ni\nj\nk\nG\n\nthe line integral along a path C is given by\n\n(\n) (\n)\nˆ\nˆ\nˆ\nˆ\nˆ\nˆ\nx\ny\nz\nx\ny\nz\nC\nC\nC\nd\nF\nF\nF\ndx\ndy\ndz\nF dx\nF dy\nF dz\n⋅\n=\n+\n+\n⋅\n+\n+\n=\n+\n+\n∫\n∫\n∫\nF\ns\ni\nj\nk\ni\nj\nk\nG\nG\n\nwhere\n\nˆ\nˆ\nˆ\nd\ndx\ndy\ndz\n=\n+\n+\ns\ni\nj\nk\nG\n\nis the differential line element along C.\nSummary of Class MW 02/ TR 03\nW01D3\np. 1/2\n\nSummary of Class MW 02/ TR 03\n8.02\n\nSurface Integrals\nA function\nof two variables can be integrated over a surface S, and the result is a\ndouble integral:\n( , )\nF x y\n\n( , )\n( , )\nS\nS\nF x y dA\nF x y dxdy\n=\n∫∫\n∫∫\n\nwhere\nis a (Cartesian) differential area element on S. In particular, when\n, we obtain the area of the surface S:\ndA\ndx dy\n=\n( , )\nF x y =\n\nS\nS\nA\ndA\ndxdy\n=\n=\n∫∫\n∫∫\n\nSurface Integrals Involving Vector Functions\nFor a vector function ( , , )\nx y z\nF\nG\n, the integral over a surface S is is given by\n\nˆ\nn\nS\nS\nS\nd\ndA\n⋅\n=\n⋅\n=\n∫∫\n∫∫\n∫∫\nF\nA\nF n\nF dA\nG\nG\nG\n\nwhere\nand\nis a unit vector pointing in the normal direction of the surface. The\ndot product\nis the component of F\nˆ\nd\ndA\n=\nA\nG\nn\nˆn\nˆ\nn\nF =\n⋅\nF n\nG\nG\nparallel to\n. The above quantity is called\n\"flux.\" For an electric field E , the electric flux through a surface is\nˆn\nG\n\nˆ\nE\nn\nS\nS\ndA\nE dA\nΦ =\n⋅\n=\n∫∫\n∫∫\nE n\nG\n\nImportant Equations\n\nThe line integral of a vector function:\n\n(\n) (\n)\nˆ\nˆ\nˆ\nˆ\nˆ\nˆ\nx\ny\nz\nx\ny\nz\nC\nC\nC\nd\nF\nF\nF\ndx\ndy\ndz\nF dx\nF dy\nF dz\n⋅\n=\n+\n+\n⋅\n+\n+\n=\n+\n+\n∫\n∫\n∫\nF\ns\ni\nj\nk\ni\nj\nk\nG\nG\n\nThe flux of a vector function:\nˆ\nE\nn\nS\nS\ndA\nE dA\nΦ =\n⋅\n=\n∫∫\n∫∫\nE n\nG\n\nSummary of Class MW 02/ TR 03\nW01D3\np. 2/2"
    },
    {
      "category": "Resource",
      "title": "summary_w02d1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-02-physics-ii-electricity-and-magnetism-spring-2007/ef9b4b645b4810aa728bd187798d8c6d_summary_w02d1.pdf",
      "content": "Summary of Class 4\n8.02\nTuesday 2/8/05 / Wednesday 2/9/05\nTopics:\nWorking in Groups, Visualizations, Electric Potential, E from V\nRelated Reading:\nCourse Notes (Liao et al.):\nSections 3.1-3.5\nSerway and Jewett:\nSections 25.1-25.4\nGiancoli:\n\nChapter 23\nExperiments:\nExperiment 1: Visualizations\nTopic Introduction\nWe first discuss groups and what we expect from you in group work. We will then consider\nthe TEAL visualizations and how to use them, in Experiment 1. We then turn to the concept\nof electric potential. Just as electric fields are analogous to gravitational fields, electric\npotential is analogous to gravitational potential. We introduce from the point of view of\ncalculating the electric potential given the electric field. At the end of this class we consider\nthe opposite process, that is, how to calculate the electric field if we are given the electric\npotential.\nPotential Energy\nBefore defining potential, we first remind you of the more intuitive idea of potential energy.\nYou are familiar with gravitational potential energy, U (= mgh in a uniform gravitational\nfield g, such as is found near the surface of the Earth), which changes for a mass m only as\nthat mass changes its position. To change the potential energy of an object by ∆U, one must\ndo an equal amount of work Wext, by pushing with a force Fext large enough to move it:\nB G\nG\n∆U\nUB -U A = ∫A Fext ⋅d s =W\n=\next\nHow large a force must be applied? It must be equal and opposite to the force the object\nfeels due to the field it is sitting in. For example, if a gravitational field g is pushing down on\na mass m and you want to lift it, you must apply a force mg upwards, equal and opposite the\ngravitational force. Why equal? If you don't push enough then gravity will win and push it\ndown and if you push too much then you will accelerate the object, giving it a velocity and\nhence kinetic energy, which we don't want to think about right now.\nThis discussion is generic, applying to both gravitational fields and potentials and to electric\nfields and potentials. In both cases we write:\nB G\nG\n∆U\nU B -U A = -∫A F ⋅d s\n=\nwhere the force F is the force the field exerts on the object.\nFinally, note that we have only defined differences in potential energy. This is because only\ndifferences are physically meaningful - what we choose, for example, to call \"zero energy\" is\ncompletely arbitrary.\nPotential\nJust as we define electric fields, which are created by charges, and which then exert forces on\nother charges, we can also break potential energy into two parts: (1) charges create an\nelectric potential around them, (2) other charges that exist in this potential will have an\nassociated potential energy. The creation of an electric potential is intimately related to the\nSummary for Class 04\np. 1/2\n\nSummary of Class 4\n8.02\nTuesday 2/8/05 / Wednesday 2/9/05\nB G\nG\n=\ncreation of an electric field: ∆V\nVB -VA = -∫ E ⋅d s . As with potential energy, we only\nA\ndefine a potential difference. We will occasionally ask you to calculate \"the potential,\" but\nin these cases we must arbitrarily assign some point in space to have some fixed potential. A\ncommon assignment is to call the potential at infinity (far away from any charges) zero. In\norder to find the potential anywhere else you must integrate from this place where it is known\n(e.g. from A=inf, VA=0) to the place where you want to know it.\nOnce you know the potential, you can ask what happens to a charge q in that potential. It\nwill have a potential energy U = qV. Furthermore, because objects like to move from high\npotential energy to low potential energy, as long as the potential is not constant, the object\nwill feel a force, in a direction such that its potential energy is reduced. Mathematically that\nG\nis the same as saying that F = -∇ U (where the gradient operator ∇≡ ∂ ˆi + ∂ ˆj+ ∂ kˆ ) and\n∂x\n∂y\n∂z\nG\nG\nG\nhence, since F = qE , E = -∇ V . That is, if you think of the potential as a landscape of hills\nand valleys (where hills are created by positive charges and valleys by negative charges), the\nelectric field will everywhere point the fastest way downhill.\nImportant Equations\nB G\nG\nPotential Energy (Joules) Difference:\n∆U\nU B -U A = -∫A F ⋅d s\n=\nB G\nG\n=\nElectric Potential Difference (Joules/Coulomb = Volt):\n∆V\nVB -VA = -∫ E ⋅d s\nA\nElectric Potential (Joules/coulomb) created by point charge:\nVPoint Charge( ) = kQ\nr\nr\nPotential energy U (Joules) of point charge q in electric potential V:\nU\nqV\n\n=\nExperiment 1: Visualizations\nPreparation: Read materials from previous classes\nElectricity and magnetism is a difficult subject in part because many of the physical\nphenomena we describe are invisible. This is very different from mechanics, where you can\neasily imagine blocks sliding down planes and cars driving around curves. In order to help\novercome this problem, we have created a number of visualizations that will be used\nthroughout the class. Today you will be introduced to a number of those visualizations\nconcerning charges and electric fields, and currents and magnetic fields.\nSummary for Class 04\np. 2/2"
    },
    {
      "category": "Resource",
      "title": "summary_w02d2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-02-physics-ii-electricity-and-magnetism-spring-2007/40dfe778b10f19d6b7f7821d779e3242_summary_w02d2.pdf",
      "content": "Summary of Class 5\n8.02\nThursday 2/10/2005 / Monday 2/14/2005\nTopics: Gauss's Law\nRelated Reading:\nCourse Notes (Liao et al.):\nChapter 4\nSerway and Jewett:\nChapter 24\nGiancoli:\n\nChapter 22\nTopic Introduction\nIn this class we look at a new way of calculating electric fields - Gauss's law. Not only is\nGauss's law (the first of four Maxwell's Equations) an exceptional tool for calculating the\nfield from symmetric sources, it also gives insight into why E-fields have the r-\ndependence that they do.\nThe idea behind Gauss's law is that, pictorially, electric fields flow out of and into\ncharges. If you surround some region of space with a closed surface (think bag), then\nobserving how much field \"flows\" into or out of that surface tells you how much charge\nis enclosed by the bag. For example, if you surround a positive charge with a surface\nthen you will see a net flow outwards, whereas if you surround a negative charge with a\nsurface you will see a net flow inwards.\nElectric Flux\nThe picture of fields \"flowing\" from charges is formalized in the definition of the electric\nJG\nflux. For any flat surface of area A, the flux of an electric field E through the surface is\nG G\nG\n⋅\ndefined as Φ\n=\n\nE A , where the direction of A is normal to the surface. This captures\nE\nJG\nthe idea that the \"flow\" we are interested in is through the surface - if E is parallel to the\nsurface then the flux Φ =\n0.\nE\nWe can generalize this to non-flat surfaces by breaking up the surface into small patches\nwhich are flat and then integrating the flux over these patches. Thus, in general:\nG\nG\n⋅ d\nΦE = ∫∫ E\nA\n\nS\nGauss's Law\nGauss's law states that the electric flux through any closed surface is proportional to the\ntotal charge enclosed by the surface:\nJG\nG\nenc\nΦ\n=\nw ⋅ d\n∫∫ E\nA\n\n= q\nE\nS\nε0\nA closed surface is a surface which completely encloses a volume, and the integral over a\nclosed surface S is denoted by\n.\n∫∫w\nS\nSymmetry and Gaussian Surfaces\nAlthough Gauss's law is always true, as a tool for calculation of the electric field, it is\nonly useful for highly symmetric systems. The reason that this is true is that in order to\nJG\nsolve for the electric field E we need to be able to \"get it out of the integral.\" That is, we\nneed to work with systems where the flux integral can be converted into a simple\nSummary for Class 05\np. 1/1\n\nSummary of Class 5\n8.02\nThursday 2/10/2005 / Monday 2/14/2005\nmultiplication. Examples of systems that possess such symmetry and the corresponding\nclosed Gaussian surfaces we will use to surround them are summarized below:\nSymmetry\nSystem\nGaussian Surface\nCylindrical\nInfinite line\nCoaxial Cylinder\nPlanar\nInfinite plane\nGaussian \"Pillbox\"\nSpherical\nSphere, Spherical shell\nConcentric Sphere\nSolving Problems using Gauss's law\nGauss's law provides a powerful tool for calculating the electric field of charge\ndistributions that have one of the three symmetries listed above. The following steps are\nuseful when applying Gauss's law:\n(1)Identify the symmetry associated with the charge distribution, and the associated\nshape of \"Gaussian surfaces\" to be used.\n(2) Divide space into different regions associated with the charge distribution, and\ndetermine the exact Gaussian surface to be used for each region. The electric field\nmust be constant or known (i.e. zero) across the Gaussian surface.\n(3)For each region, calculate qenc, the charge enclosed by the Gaussian surface.\n(4)For each region, calculate the electric flux ΦE through the Gaussian surface.\n(5)Equate ΦE with q / ε , and solve for the electric field in each region.\nenc\nImportant Equations\nG\nG\n⋅ d\nElectric flux through a surface S:\nΦE = ∫∫ E\nA\n\nS\nJG\nG\nqenc\nGauss's law:\nΦ = w ⋅ d\n∫∫ E\nA\n\n=\nE\nS\nε0\nImportant Concepts\nGauss's Law applies to closed surfaces--that is, a surface that has an inside and an\noutside (e.g. a basketball). We can compute the electric flux through any surface, open or\nclosed, but to apply Gauss's Law we must be using a closed surface, so that we can tell\nhow much charge is inside the surface.\nGauss's Law is our first Maxwell's equations, and concerns closed surfaces. Another of\nJG\nG\nw ⋅ d\nMaxwell's equations, the magnetic Gauss's Law, ΦB = ∫∫ B\nA\n\n= 0 , also applies to a\nS\nclosed surface. Our third and fourth Maxwell's equations will concern open surfaces, as\nwe will see.\nSummary for Class 05\np. 2/2"
    },
    {
      "category": "Resource",
      "title": "summary_w02d3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-02-physics-ii-electricity-and-magnetism-spring-2007/e015fa23e97a0c7881bdb7fcd0e1d03c_summary_w02d3.pdf",
      "content": "Summary of Class 6\n8.02\nFriday 2/11/05\nTopics:\nContinuous Charge Distributions\nRelated Reading:\nStudy Guide (Liao et al.):\nSections 2.9-2.10; 2.13\nSerway & Jewett:\nSection 23.5\nGiancoli:\n\nSection 21.7\nTopic Introduction\nToday we are focusing on understanding and calculating the electric field generated by a\ncontinuous distribution of charge. We will do several in-class problems which highlight\nthis concept and the associated calculations.\nCharge Distributions\nElectric fields \"superimpose,\" or add, just as gravitational fields do. Thus the field\ngenerated by a collection of charges is just the sum of the electric fields generated by\neach of the individual charges. If the charges are discrete, then the sum is just vector\naddition. If the charge distribution is continuous then the total electric field can be\ncalculated by integrating the electric fields dE generated by each small chunk of charge\ndq in the distribution.\nCharge Density\nWhen describing the amount of charge in a continuous charge distribution we often speak\nof the charge density. This function tells how much charge occupies a small region of\nspace at any point in space. Depending on how the charge is distributed, we will either\nρ = dq dV , the surface charge density σ = dq dA , or\nconsider the volume charge density\nthe linear charge density\nrespectively.\nλ = dq d A , where V, A and A stand for volume, area and length\nImportant Equations\nG\ndq\nElectric field from continuous charge distribution:\nE\n∫\nrˆ\n=\n4πε0\nr\n(NOTE: for point charge-like dq)\nV\nCharge Densities:\nρ\nσ\nλ\n⎧\n⎪⎨\n⎪⎩\ndV\ndA\nd\nfor a volume distribution\nfor a surface (area) distribution\ndq =\nA\nfor a linear distribution\nSummary for Class 06\np. 1/1"
    },
    {
      "category": "Resource",
      "title": "summary_w03d1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-02-physics-ii-electricity-and-magnetism-spring-2007/265f0331dcba8fec03a8fb20f984fc85_summary_w03d1.pdf",
      "content": "Summary of Class 7\n8.02\nTuesday 2/15/2005 / Wednesday 2/16/2005\nTopics:\nConductors & Capacitors\nRelated Reading:\nCourse Notes (Liao et al.):\nSections 4.3-4.4; Chapter 5\nSerway and Jewett:\nChapter 26\nGiancoli:\n\nChapter 22\n\nExperiments:\n(2) Electrostatic Force\nTopic Introduction\nToday we introduce two new concepts - conductors & capacitors. Conductors are materials\nin which charge is free to move. That is, they can conduct electrical current (the flow of\ncharge). Metals are conductors. For many materials, such as glass, paper and most plastics\nthis is not the case. These materials are called insulators.\nFor the rest of the class we will try to understand what happens when conductors are put in\ndifferent configurations, when potentials are applied across them, and so forth. Today we\nwill describe their behavior in static electric fields.\nConductors\nSince charges are free to move in a conductor, the electric field inside of an isolated\nconductor must be zero. Why is that? Assume that the field were not zero. The field would\napply forces to the charges in the conductor, which would then move. As they move, they\nbegin to set up a field in the opposite direction.\nAn easy way to picture this is to think of a bar of\n-\n+\nmetal in a uniform external electric field (from\n-\n-\n-\nEtotal = 0\nEinternal = -Eexternal\n+\nleft to right in the picture below). A net positive\n+\ncharge will then appear on the right of the bar, a\n+\nnet negative charge on the left. This sets up a\n-\n+\nfield opposing the original. As long as a net field\nexists, the charges will continue to flow until they\nset up an equal and opposite field, leaving a net\nEexternal\nzero field inside the conductor.\nCapacitance\nUsing conductors we can construct a very useful device which stores electric charge: the\ncapacitor. Capacitors vary in shape and size, but the basic configuration is two conductors\ncarrying equal but opposite charges (±Q). In order to build up charge on the two plates, a\npotential difference ∆V must be applied between them. The ability of the system to store\ncharge is quantified in its capacitance: C\nQ\n≡\n∆V . Thus a large capacitance capacitor can\nstore a lot of charge with little \"effort\" - little potential difference between the two plates.\nA simple example of a capacitor is pictured at left - the\nparallel plate capacitor, consisting of two plates of area A, a\ndistance d apart. To find its capacitance we first arbitrarily\nplace charges ±Q on the plates. We calculate the electric field\nbetween the plates (using Gauss's Law) and integrate to obtain\nthe potential difference between them. Finally we calculate\nSummary for Class 07\np. 1/1\n\nSummary of Class 7\n8.02\nTuesday 2/15/2005 / Wednesday 2/16/2005\nthe capacitance: C\nQ\n=\n∆V = ε0 A d . Note that the capacitance depends only on\ngeometrical factors, not on the amount of charge stored (which is why we were justified in\nstarting with an arbitrary amount of charge).\nEnergy\nIn the process of storing charge, a capacitor also stores electric energy. We can see this by\nconsidering how you \"charge\" a capacitor. Imagine that you start with an uncharged\ncapacitor. Carry a small amount of positive charge from one plate to the other (leaving a net\nnegative charge on the first plate). Now a potential difference exists between the two plates,\nand it will take work to move over subsequent charges. Reversing the process, we can\nrelease energy by giving the charges a method of flowing back where they came from (more\non this in later classes). So, in charging a capacitor we put energy into the system, which can\nlater be retrieved. Where is the energy stored? In the process of charging the capacitor, we\nalso create an electric field, and it is in this electric field that the energy is stored. We assign\nto the electric field a \"volume energy density\" uE, which, when integrated over the volume of\nspace where the electric field exists, tells us exactly how much energy is stored.\nImportant Equations\nCapacitance:\nC\nQ\n≡\n∆V\nEnergy Stored in a Capacitor:\nU = Q2\n= Q ∆V = C ∆V\n2C\nEnergy Density in Electric Field:\nuE = 1 ε E2\no\nExperiment 2: Electrostatic Force\nPreparation: Read lab write-up. Calculate (using Gauss's Law) the electric field and\npotential between two infinite sheets of charge.\nIn this lab we will measure the permittivity of free space ε0 by measuring how much voltage\nneeds to be applied between two parallel plates in order to lift a piece of aluminum foil up off\nof the bottom plate. How does this work? You will do a problem set problem with more\ndetails, but the basic idea is that when you apply a voltage between the top and bottom plate\n(assume the top is at a higher potential than the bottom) you put a positive charge on the top\nplate and a negative charge on the bottom (it's a capacitor). The foil, since it is sitting on the\nbottom plate, will get a negative charge on it as well and then will feel a force lifting it up to\nthe top plate. When the force is large enough to overcome gravity the foil will float. Thus\nby measuring the voltage required as a function of the weight of the foil, we can determine\nthe strength of the electrostatic force and hence the value of the fundamental constant ε0.\nSummary for Class 07\np. 2/2"
    },
    {
      "category": "Resource",
      "title": "summary_w03d2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-02-physics-ii-electricity-and-magnetism-spring-2007/6c67a88cce411eb9016c81d6d9bb0722_summary_w03d2.pdf",
      "content": "Summary of Class 8\n8.02\nThursday 2/17/2005 / Tuesday 2/22/2005\nTopics:\nCapacitors & Dielectrics\n\nRelated Reading:\nCourse Notes (Liao et al.):\nSections 4.3-4.4; Chapter 5\nSerway and Jewett:\nChapter 26\nGiancoli:\n\nChapter 22\nExperiments:\n(3) Faraday Ice Pail\nTopic Introduction\nToday we continue our discussion of conductors & capacitors, including an introduction to\ndielectrics, which are materials which when put into a capacitor decrease the electric field\nand hence increase the capacitance of the capacitor.\nConductors & Shielding\nLast time we noted that conductors were equipotential surfaces, and\nthat all charge moves to the surface of a conductor so that the electric\nfield remains zero inside. Because of this, a hollow conductor very\neffectively separates its inside from its outside. For example, when\ncharge is placed inside of a hollow conductor an equal and opposite\ncharge moves to the inside of the conductor to shield it. This leaves an\nequal amount of charge on the outer surface of the conductor (in order\nto maintain neutrality). How does it arrange itself? As shown in the\npicture at left, the charges on the outside don't know anything about\nwhat is going on inside the conductor. The fact that the electric field is zero in the conductor\ncuts off communication between these two regions. The same would happen if you placed a\ncharge outside of a conductive shield - the region inside the shield wouldn't know about it.\nSuch a conducting enclosure is called a Faraday Cage, and is commonly used in science and\nindustry in order to eliminate the electromagnetic noise ever-present in the environment\n(outside the cage) in order to make sensitive measurements inside the cage.\nCapacitance\nLast time we introduced the idea of a\ncapacitor as a device to store charge. This\ntime we will discuss what happens when\nmultiple capacitors are put together. There\nare two distinct ways of putting circuit\nelements (such as capacitors) together: in\nSeries\nseries and in parallel. Elements in series\nParallel\n(such as the capacitors and battery at left)\nare connected one after another. As shown,\nthe charge on each capacitor must be the\nsame, as long as everything is initially\nuncharged when the capacitors are connected (which is always the\ncase unless otherwise stated). In parallel, the capacitors have the same potential drop across\nthem (their bottoms and tops are at the same potential). From these setups we will calculate\nthe equivalent capacitance of the system - what one capacitor could replace the two\ncapacitors and store the same amount of charge when hooked to the same battery. It turns\nSummary for Class 08\np. 1/2\n\nSummary of Class 8\n8.02\nThursday 2/17/2005 / Tuesday 2/22/2005\nSummary for Class 08\n\np. 2/2\nout that in parallel capacitors add (\nequivalent\nC\nC\nC\n≡\n+\n) while in series they add inversely\n(\nequivalent\nC\nC\nC\n-\n-\n-\n≡\n+\n).\n\nDielectrics\nA dielectric is a piece of material that, when inserted into an electric field, has a reduced\nelectric field in its interior. Thus, if a dielectric is placed into a capacitor, the electric field in\nthat capacitor is reduced, as is hence the potential difference between the plates, thus\nincreasing the capacitor's capacitance (remember, C\nQ\nV\n≡\n∆\n). The effectiveness of a\ndielectric is summarized in its \"dielectric constant\" κ. The larger the dielectric constant, the\nmore the field is reduced (paper has κ=3.7, Pyrex κ=5.6). Why do we use dielectrics?\nDielectrics increase capacitance, which is something we frequently want to do, and can also\nprevent breakdown inside a capacitor, allowing more charge to be pushed onto the plates\nbefore the capacitor \"shorts out\" (before charge jumps from one plate to the other).\n\nImportant Equations\nCapacitors in Series:\n\nequivalent\nC\nC\nC\n-\n-\n-\n≡\n+\n\nCapacitors in Parallel:\n\nequivalent\nC\nC\nC\n≡\n+\n\nGauss's Law in Dielectric:\n\nS\nin\nq\nd\nκ\nε\n⋅\n=\n∫∫\nE\nA\nG\nG\nw\n\nExperiment 3: Faraday Ice Pail\nPreparation: Read lab write-up.\n\nIn this lab we will study electrostatic shielding, and how charges move on conductors when\nother charges are brought near them. We will also learn how to use Data Studio, software for\ncollecting and presenting data that we will use for most of the remaining experiments this\nsemester. The idea of the experiment is quite simple. We will have two concentric\ncylindrical cages, and can measure the potential difference between them. We can bring\ncharges (positive or negative) into any of the three regions created by these two cylindrical\ncages. And finally, we can connect either cage to \"ground\" (e.g. the Earth), meaning that it\ncan pull on as much charge as it wants to respond to your moving around charges. The point\nof the lab is to get a good understanding of what the responses are to you moving around\ncharges, and how the potential difference changes due to these responses."
    },
    {
      "category": "Resource",
      "title": "summary_w03d3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-02-physics-ii-electricity-and-magnetism-spring-2007/0852e52fec1e7359f595c3610e58e5b1_summary_w03d3.pdf",
      "content": "Summary of Class 9\n8.02\nFriday 2/18/05\nTopics:\nGauss's Law\nRelated Reading:\nCourse Notes (Liao et al.):\nChapter 4\nSerway & Jewett:\nChapter 24\nGiancoli:\n\nChapter 22\nTopic Introduction\nIn today's class we will get more practice using Gauss's Law to calculate the electric field\nfrom highly symmetric charge distributions. Remember that the idea behind Gauss's law is\nthat, pictorially, electric fields flow out of and into charges. If you surround some region of\nspace with a closed surface (think bag), then observing how much field \"flows\" into or out of\nthat surface (the flux) tells you how much charge is enclosed by the bag. For example, if you\nsurround a positive charge with a surface then you will see a net flow outwards, whereas if\nyou surround a negative charge with a surface you will see a net flow inwards.\nNote: There are only three different symmetries (spherical, cylindrical and planar) and a\ncouple of different types of problems which are typically calculated of each symmetry (solids\n- like the ball and slab of charge done in class, and nested shells). I strongly encourage you\nto work through each of these problems and make sure that you understand how to choose\nyour Gaussian surface and how much charge is enclosed.\nElectric Flux\nGJ\nE\nA\nFor any flat surface of area , the flux of an electric field\nis normal to the surface. This captures the idea that\nG\nA\n, where the direction of\nG\nE A\nthrough the surface is defined as\nG\nΦ\n=\n⋅\nE\nGJ\nE\nthrough\nthe \"flow\" we are interested in is\nthe surface - if\nis parallel to the surface then the\nflux Φ\n= 0.\nE\nWe can generalize this to non-flat surfaces by breaking up the surface into small patches\nwhich are flat and then integrating the flux over these patches. Thus, in general:\nG\nG\nE\nΦ =\nd\n⋅\n∫∫E\nA\n\nS\nGauss's Law\nRecall that Gauss's law states that the electric flux through any closed surface is proportional\nto the total charge enclosed by the surface, or mathematically:\nJG\nG\nenc\n⋅d\nΦ\n= w E\nA\n\n= q\nE\n∫∫\nS\nε0\nSummary for Class 09\np. 1/1\n\nSummary of Class 9\n8.02\nFriday 2/18/05\nSymmetry and Gaussian Surfaces\nSymmetry\nSystem\nGaussian Surface\nCylindrical\nInfinite line\nCoaxial Cylinder\nPlanar\nInfinite plane\nGaussian \"Pillbox\"\nSpherical\nSphere, Spherical shell\nConcentric Sphere\nAlthough Gauss's law is always true, as a tool for calculation of the electric field, it is only\nuseful for highly symmetric systems. The reason that this is true is that in order to solve for\nJG\nthe electric field E we need to be able to \"get it out of the integral.\" That is, we need to\nwork with systems where the flux integral can be converted into a simple multiplication.\nThis can only be done if the electric field is piecewise constant - that is, at the very least the\nelectric field must be constant across each of the faces composing the Gaussian surface.\nFurthermore, in order to use this as a tool for calculation, each of these constant values must\neither be E, the electric field we are tying to solve for, or a constant which is known (such as\n0). This is important: in choosing the Gaussian surface you should not place it in such a way\nthat there are two different unknown electric fields leading to the observed flux.\nSolving Problems using Gauss's law\n(1) Identify the symmetry associated with the charge distribution, and the associated shape of\n\"Gaussian surfaces\" to be used.\n(2) Divide the space into different regions associated with the charge distribution, and\ndetermine the exact Gaussian surface to be used for each region. The electric field must\nbe constant and either what we are solving for or known (i.e. zero) across the Gaussian\nsurface.\n(3) For each region, calculate qenc, the charge enclosed by the Gaussian surface.\n(4) For each region, calculate the electric flux ΦE through the Gaussian surface.\n(5) Equate ΦE with q\n/ ε , and solve for the electric field in each region.\nenc\nImportant Equations\nG\nG\n⋅ d\nElectric flux through a surface S:\nΦE = ∫∫ E\nA\n\nS\nJG\nG\nqenc\nGauss's law:\nΦ = w ⋅ d\n∫∫ E\nA\n\n=\nE\nS\nε0\nSummary for Class 09\np. 2/2"
    }
  ]
}