{
  "course_name": "Physics II: Electricity & Magnetism with an Experimental Focus",
  "course_description": "This course is an introduction to electromagnetism and electrostatics. Topics include: electric charge, Coulomb’s law, electric structure of matter, conductors and dielectrics, concepts of electrostatic field and potential, electrostatic energy, electric currents, magnetic fields, Ampere’s law, magnetic materials, time-varying fields, Faraday’s law of induction, basic electric circuits, electromagnetic waves, and Maxwell’s equations. The course has an experimental focus, and includes several experiments that are intended to illustrate the concepts being studied.\nAcknowledgements\nProf. Roland wishes to acknowledge that the structure and content of this course owe much to the contributions of Prof. Ambrogio Fasoli.",
  "topics": [
    "Science",
    "Physics",
    "Electromagnetism",
    "Science",
    "Physics",
    "Electromagnetism"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 3 sessions / week, 1 hour / session\n\nRecitations: 2 sessions / week, 1 hour / session\n\nOverview\n\nDirect student experience with physics as an experimental science is rare in introductory college courses. The accompanying labs are often peripheral to the course (little credit, little involvement); and have set-piece experiments, sometimes with computers, that give students very little more feeling of how things really work than lecture demos or homework problems (valuable as these are).\n\nAt MIT, starting in 1988, John King, Phylis and Philip Morrison, Tony French, and Peter Dourmashkin developed and taught two courses, Mechanics (\n8.01X\n) and Electricity & Magnetism (8.02X), in which experiments were central. For a 12-week course there are 8 to 10 experiments that are issued in kit form to student partnerships of two, along with instruments, all in two \"Red Boxes\" (small plastic toolboxes). Each student purchases (at cost) a tool kit with soldering iron, pliers, wire cutters and strippers, screw drivers, etc.\n\nThe partners meet to assemble and run the experiments in their living quarters, take and analyze data, and turn in their notebooks for comment; thus the experiments are part of homework, which also has a reduced number of conventional problems.\n\nThese experiments were made central to the course:\n\nBy connecting them closely to the theoretical presentations in lectures and text\n\nBy taking 25 minutes out of the weekly 150 to discuss the experiment of the week, how to assemble the apparatus, how to troubleshoot, how to take, analyze and present data\n\nBy having homework and test problems related to the experiments\n\nNote that the mechanics experiments involve electrical construction and measuring techniques, no more mysterious than a stopwatch or PC. But here a digital multi-meter is taken as an instrument to use; in the E&M experiments analog meters are not only used but also understood-students learn all about how they work.\n\nCourses similar to these have been presented at Caltech, Harvard, and Ecole des Mines.\n\nAll necessary materials can be acquired from an online electronics supply source.\n\nBesides the course syllabi and notes, and instructions for 12 basic constructions and\nexperiments\n(Dourmashkin and King), there is a complete collection of 50 experiments (King, J. G., and A. P. French.\nPhysics 8.01X and 8.02X Experiment Instructions\n. MIT Physics Department, 1998) that have been used at various times. Finally, there was a published book, ZAP!, designed to be used in conjunction with a version of these introductory physics courses taught at Caltech: Morrison, Philip, Phylis Morrison, and John King.\nZap!: A Hands-on Introduction to Electricity & Magnetism\n. 1991. Preliminary ed. ISBN: 9780892784141.\n\nTextbook\n\nYoung and Freedman.\nUniversity Physics with Modern Physics\n. 11th ed. San Francisco, CA: Pearson/Addison Wesley, 2003. ISBN: 9780805387681.\n\nQuizzes\n\nThere will be a total of 4 quizzes. They will be closed book, and calculators will not be necessary. Quizzes will typically include at least one question on the experiments and one question on lecture demos. Quizzes will account for 60% of the final grade. There is no final exam.\n\nProblem Sets\n\nThere will be twelve written homework's (problem sets). Late homework's will not receive credit.\n\nExperiments\n\nThe take home experiments are a crucial part of the 8.02X experience. Each partnership of two students will build and use 9 experiments. All experiments need to be demonstrated and checked off during lab hours. Experiment related questions will be asked at check-off and will be included on the problem sets, as well as in the quizzes. Early check-off of the experiments will be awarded bonus points. The detailed check-off and grading policy will be announced in class. A book with experiment information and instructions will be provided.\n\nMastering Physics\n\nRegistered students will be given access to\nMastering Physics\n, an on-line tutorial and homework system. There will be a total of 10 Cybertutor assignments.\n\nNote: OCW Users will not be able to access this material.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nTwelve Problem Sets\n\n20%\n\nTen Mastering Physics\n\n10%\n\nNine Experiments\n\n10%\n\nFour Quizzes (15% each)\n\n60%\n\nCalendar\n\nLEC #\n\nTOPICS\n\nKEY DATES\n\nIntroduction: Fundamental Forces\n\nElectric Charge and E.S. Induction\n\nProblem set 1 with meter introduction experiment out.\n\nCoulomb's Law\n\nElectric Field\n\nProblem set 2 with low voltage power supply out.\n\nElectric Field and Polarization\n\nProblem set 1 with meter introduction experiment due.\n\nGauss' Law\n\nE-Field: Work, Energy, Potential (1/2)\n\nProblem set 3 with high voltage power supply experiment out.\n\nReview for Quiz 1\n\nEvening Review\n\nProblem set 2 with low voltage power supply due.\n\nQuiz 1\n\nE-Field: Work, Energy, Potential (2/2)\n\nProblem set 4 out.\n\nConductors and Insulators\n\nProblem set 3 due.\n\nCapacitance\n\nCapacitance (2/2), E-Fields in Matter\n\nProblem set 5 with electrostatic force experiment out.\n\nE.S. Force Experiment\n\nProblem set 4 with high voltage power supply experiment due.\n\nElectric Current, Ohm's Law\n\nElectric Circuits\n\nProblem set 6 with voltage and current experiment out.\n\nReview for Quiz 2\n\nEvening Review\n\nProblem set 5 with electrostatic force experiment due.\n\nQuiz 2\n\nRC Circuits\n\nProblem set 7 with electric breakdown experiment out.\n\nIonization, Electrical Breakdown Experiment\n\nProblem set 6 with voltage and current experiment due.\n\nMagnetic Field - Lorentz Force\n\nMagnetic Field Sources; Biot-Savart's Law\n\nProblem set 8 with magnetic force experiment out.\n\nMagnetic Field - Ampere's Law\n\nProblem set 7 due.\n\nMagnetic Fields in Matter\n\nMagnetic Induction - Faraday's Law\n\nProblem set 9 out.\n\nReview for Quiz 3\n\nEvening Review\n\nProblem set 8 with magnetic force experiment due.\n\nQuiz 3\n\nMagnetic Induction - Lenz's Law, Eddy Currents\n\nProblem set 10 with amplifier experiment out.\n\nInductance\n\nProblem set 9 due.\n\nAC Circuits\n\nProblem set 11 with microwave experiment out.\n\nRL Circuits\n\nProblem set 10 due.\n\nRLC Circuits\n\nDisplacement Current and Maxwell's Equations\n\nElectromagnetic Waves\n\nProblem set 12 out.\n\nProblem set 11 with amplifier experiment due.\n\nReview for Quiz 4\n\nEvening Review\n\nQuiz 4\n\nPolarization-Microwave Experiment\n\nProblem set 12 due.\n\nInterference, Diffraction, Scattering (1/2)\n\nInterference, Diffraction, Scattering (2/2)\n\nMicrowave experiment due.",
  "files": [
    {
      "category": "Resource",
      "title": "802x_05_amp_sol.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-02x-physics-ii-electricity-magnetism-with-an-experimental-focus-spring-2005/18e6e1afedb1809d4a62ba8af983d6e1_802x_05_amp_sol.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "802x_05_eb.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-02x-physics-ii-electricity-magnetism-with-an-experimental-focus-spring-2005/028cb49689a4f84e406b99d26c174735_802x_05_eb.pdf",
      "content": "Massachusetts Institute of Technology\nSpring Term 2005\n8.02X Electricity and Magnetism\nExperiment Electric Breakdown (EB) Problems\n(20 points total)\nLab Hours: Mondays: 3-5 pm, Tuesday: 7:30-9:30 pm, Wednesday: 7:30-9:30 pm,\nThursday: 3-5 pm, Fridays: 12-3 pm\nDue Date: Check-off by April 4 .To satisfy the check-off for experiment\nEB, you must do the following tasks.\nYou will be graded according to the following criteria:\n1. Your EB experiment works properly.\n2. The EB experiment is set-up according to diagrams that are shown in the lab\nwrite-up.\n3. You should be prepared to briefly explain the questions below.\nBonus Points Policy: Check-offs that are finished on Mon Mar 28 will receive 2\nextra points, and check-offs on Tue Mar 29 will receive 1 extra point.\nExperiment EB (Electrical Breakdown)\nConnect MMM 1 on the 1000DCV range (use -COM and +DC1000V for the test\nV0\nlead inputs) across the HVPS output. We will call this voltage\n. Connect MMM 2 on\nthe 500DCV range (use -COM and +V-\"-A for the test lead inputs and the same switch\nsetting as for the 1000DCV range) across one of the 1 M\" resistors. We will call this\nvoltage V1.\nFigure 1: Multimeter connections for Experiment EB\n\nd\n[mm]\nV0 [V]\nV0 [V]\nV0 [V]\nV0 [V]\nStart with the tungsten rod touching (shorted). Turn the wingnut on the clothespin\nsmoothly to the 0.025 position, one fourth of the way to the 0.1mm setting. Raise the\nHVPS voltage slowly until the second meter just begins to deflect, indicating breakdown\nV0\nwith the formation of an arc. Record the voltage\nwith MMM 1 across the HVPS and\nthe voltage V1 with MMM 2 across the 1 M\" resistor at which this happens. Repeat for\nthe three remaining gap widths, and repeat the entire procedure three times. Enter your\ndata in the tables below.\nAnalysis\nPlot the average breakdown voltage vs. gap, and determine either a best single\nvalue of the breakdown electric field or a range of values. Express your results in V/mm.\nData Table: Breakdown Voltages for Various Spark Gap Separations\nGap Separation\nBreakdown\nVoltage\nRun 1\nBreakdown\nVoltage\nRun 2\nBreakdown\nVoltage\nRun 3\nBreakdown\nVoltage\nAverage\n0.025\n0.05\n0.075\n0.1\n\nProblem 1: Experiment EB\na) What is the number of particles per m3, (the number density n), for an ideal gas at\nstandard temperature and pressure?\nb) Define the mean free path for an electron in a gas to be the average distance \" an\nelectron travels before it collides with an air molecule. If an electron travels close enough\nb, is defined to be the radius of a\ncircular cross sectional area of\n\"b\nto an air molecule it will collide. The impact parameter\neffective area\nthat the air molecule presents as a target\nto the electron. This means that there must be at least one air molecule in the volume\n\"# b\n2that the electron could collide with. Find an expression for the number density n of\nair molecules, in terms of the mean free path \", and the impact parameter b.\nc) When the electron is placed in a gap of width d and gap voltage \"Vgap, how much\nkinetic energy per charge does the electron acquire if it travels a distance equal to the\nmean free path \"?\n. If the electron gains a kinetic energy per charge equal to the ionization\nvoltage then the electron will ionize the air molecule. Using your result from part c),\nderive an expression for the mean free path\n\"Vion # 10V\nd) The energy per charge necessary to ionize air molecules, the ionization voltage, is\n\" in terms of the gap width d, gap voltage\n, and ionization voltage \"Vion.\n\"Vgap\ne)\n(average\ngap voltage\n\"\nUse your experimental results where you found the breakdown electric field\ngap width) necessary to ionize air molecules.\n/\nUse that result to calculate\nthe mean free path\n."
    },
    {
      "category": "Resource",
      "title": "802x_05_ef.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-02x-physics-ii-electricity-magnetism-with-an-experimental-focus-spring-2005/f73738325823e155d55f7524e8d2f18e_802x_05_ef.pdf",
      "content": "Massachusetts Institute of Technology\nSpring Term 2005\n8.02X Electricity and Magnetism\nQuestions for EF experiment write-up (20 points)\nDue Date: Check-off by March 11 in lab 4-355. The lab is located in 4-355. The lab hours\nare Mon 3-5, Tues 7:30-9:30 pm, Wed 7:30-9:30 pm, Thur 3-5, Fri 12-3.\nYou will be graded according to the following criteria:\n1. Your Experiment: Electrostatic Force apparatus works (you will need to demonstrate a\ntrial run during the check-off).\n2. Your understanding of the underlining physical principles involved in the experiment.\nYou may be asked a question during the check-off.\n3. The results of your data analysis. You may also be asked how you arrived at your result\n\"0\nfor the value of the permittivity of free space\nProblem One (10 points)\n1. Place a piece of aluminum foil, about 1 cm x 1 cm, on the bottom washer. Put the top\nwasher in place and turn up the HVPS all the way. Slowly raise the voltage and read the\nvalue of the voltage on your voltmeter when the foil lifts off. Turn down the voltage and\nrepeat. Repeat 5 times.\n2. Prepare double and triple thickness foils (again about 1 cm x 1 cm from pieces 2 cm x 1\ncm and 3 cm x 1 cm, folded and squeezed flat, and repeat the above procedure.\n3. Analysis: Average the voltages for a given foil thickness. You then have 3 numbers: the\nvoltages required to lift 1, 2, and 3 thicknesses of foil. Use a table like this to enter your\nExperiment EF data\nNumber\nof foils\nVoltage\nTrial 1\nVoltage\nTrial 2\nVoltage\nTrial 3\nVoltage\nTrial 4\nVoltage\nTrial 5\nAverage\nVoltage\n4. Plot the voltage squared V\n2 vs. n, the number of thicknesses of foil. Is the origin a data\npoint? (Zero voltage will not lift zero folds of foil). Include your graph.\n5. Your graph of the experimental values of V\n2 vs. n should be a straight line with the slope\nbeing the factor in parentheses. Find the slope of the best-fit line.\n\n6. Calculate the free permittivity of space \"0, from your experimental value for the slope\nusing the result that\nV\n2 = \"tg2d 2\n#0\nn\nwhere:\n-\nthickness of perf-board + tape,\nd =1.7 \"10\n#3m\nt = 6.7 \"10\n#6m\n\" = 2.7 #10\n3kg / m\ng = 9.8 m/ s\n;\n-\nthickness of Aluminum foil,\n;\n-\ndensity of Aluminum foil,\n;\n-\nacceleration due to gravity,\n.\nProblem 2 (10 points)\na) Using Gauss' Law, find an expression for the electric field between two discs of radius R\nthat are separated by a distance d. The discs have opposite charges that are equal in\nmagnitude placed on them. You may neglect edge effects. Make a sketch of the electric\nfiled lines when you include edge effects.\nb) Suppose a voltage difference \"V\nthe positive plate is given by the expression, Q = \"o#R2$V\nd\nis applied across the two discs. Show that the charge on\nwhen you ignore edge effects."
    },
    {
      "category": "Resource",
      "title": "802x_05_mf_sol.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-02x-physics-ii-electricity-magnetism-with-an-experimental-focus-spring-2005/f66f98950b00fe22a8306897d373ea1c_802x_05_mf_sol.pdf",
      "content": ""
    },
    {
      "category": "Assignment",
      "title": "802x_05_pset1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-02x-physics-ii-electricity-magnetism-with-an-experimental-focus-spring-2005/640bb7647f2a69ce330278b2ce565a76_802x_05_pset1.pdf",
      "content": "Massachusetts Institute of Technology\nSpring Term 2005\n8.02X Electricity and Magnetism\nProblem Set 1 and Experiment Problem MI\nIssued:\nWed, Feb 2\nDue:\nProblem set: Fri, Feb 11, 4PM in 4-337\nMI experiment check-off: Fri, Feb 11, 3PM in 4-355\nPlease note that in general both students for each partnership must submit an\nexperiment write-up, answering the questions regarding the experiment. For experiment\nMI however, no write-up is necessary. You should be able to demonstrate the answers to\nthe questions during experiment check-off!\nReading suggestions (from Young + Freedman, University Physics, 11th edition)\nFri: Electric Charge, Electric Induction 21-1, 21-2\nMon: Coulomb's Law: 21-3\nWed: Electric Field: 21-4, 21-6\nFri: Electric Field cntd, Dipoles: 21-5, 21-7\nHomework Problems (30 points)\nProblem 1 (5 Points) : Consider an electron and a proton in a hydrogen atom.\n(a) What is the ratio of the electric force to the gravitational force between them?\n(b) If we move the electron and proton either closer together or farther apart, can we\nfind a configuration at which the gravitational force is bigger than the electric force?\nExplain your answer in one or two sentences.\n(c) Given your answer to (a) and (b), why does gravity dominate for astronomical\ndistances?\nProblem 2 (5 Points): Suppose the charge of an electron was 10-9% smaller than it is in\nnature (i.e. multiplied by a factor (1 - 1011)), while the charge of the proton was the same.\n(a) Under these circumstances, what would be the ratio of the electrostatic force\nbetween Earth and Moon to the gravitational force between them?\n(b) Would they still form a stable system?\n\nProblem 3 (5 points):\nConsider the configuration shown below, with a positive charge Q0 at position x0=0 and\nanother positive charge Q1 at position x1 along the x-axis.\n(a) At which position x2 could a third positive charge charge Q2 be added, such that\nthe total force on Q0 is 0? Give two examples of x2 and corresponding Q2, in\nterms of x0, x1, Q0 and Q1 (or a subset of these variables).\n(b) Qualitatively, describe what would happen if Q0 was displaced by a small\ndistance Dx from x0=0 to x=Dx and then released (two sentences max.)?\nQ0 > 0\nQ1 > 0\nx =x1\nx0 =0\nProblem 4 (5 Points): Young + Freedman, Exercise 21.9\nProblem 5 (5 Points): Young + Freedman, Exercise 21.25\nProblem 6 (5 Points): Young + Freedman, Exercise 21.31\n\nExperiment Meter Introduction\nDue Date: Check-off by Friday 3PM Feb 11 in lab 4-355. To satisfy the check-off for the Experiment\nMeter Introduction you must do the following tasks. Please read the Check-off and Grading Policy\nhandout\nLab Hours: Mondays: 3-5 pm, Tuesday: 7:30-9:30 pm, Wednesday: 7:30-9:30 pm, Thursday: 3-5\npm, Fridays: 12-3 pm\nSoldering, and Clip Leads:\n-\nMake Two Clip Leads\n-\nSolder Alligator Clips to your Multimeter Leads for each Multimeter\n-\nSolder Alligator Clips on your Transformer Leads\n-\nPut Battery in Multimeter\nMeasuring Voltage, Resistance and Current with the Multimeter:\n-\nMeasure the resistance of the 20 Ω resistor\n-\nMeasure the voltage of the AA cell\n-\nMeasure the current in a simple circuit\nMeasure the resistance of the 20 Ω resistor: In order to zero the meter, short the test leads by\nconnecting them together. Then adjust the OHMS ADJUST knob (located to the left of center of the\nMMM) so that the meter reads 0 ohms; the needle is then at its maximum deflection.\nSet the range selector switch on the MMM to the RX1 range. Connect the test leads to the resistor. Measure\nthe resistance. You may want to make other resistance measurements. For example make a thick line with a\nlead pencil and measure the resistance of the mark.\nMeasure the voltage of the AA cell: Set the range selector switch on the MMM to the 5 DCV range. Place\nthe AA cell in the battery holder. Connect the test leads to the leads from the holder. Measure the voltage.\nMeasure the current in a simple circuit: First set the range selector switch on the MMM to the 250m\nDCA range. Make a simple circuit consisting of the 20 Ω resistor, the AA cell, and the MMM. You can do\nthis by connecting the red lead of the MMM to the red lead (plus,+) of the AA cell holder. Use a clip lead\nto connect the black lead (minus,-) of the AA cell holder to one end of the 20 Ω resistor. Connect the black\nlead of the MMM to the other end of the 20 Ω resistor. Measure the current in the circuit. What effect do\nyou think the MMM has on the circuit?"
    },
    {
      "category": "Assignment",
      "title": "802x_05_pset10.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-02x-physics-ii-electricity-magnetism-with-an-experimental-focus-spring-2005/689034cbb1e60816757b17dfcae9909b_802x_05_pset10.pdf",
      "content": "Massachusetts Institute of Technology\nSpring Term 2005\n8.02x Electricity and Magnetism\nProblem Set 10\nIssued:\nSun, April 17\nDue:\nFri, April 22, 4PM <- note Date & Time!\nReading suggestions from Young & Freedman\nMon, 4/18 Patriots day vacation\nWed, 4/20: AC Circuits, Inductors, RL Circuits 31.2, 30.2,30.4\nFri, 4/22: RLC circuits, Oscillations: 30.5, 30.6\nProblem 1 (6 points):\nCompare the oscillations of an LRC circuit to the vibration of a mass m on a spring. What\ndo L and C correspond to in the mechanical system? What is the mechanical analog to R?\nProblem 2(6 points)\nYou have probably noticed that when a circuit carrying a large current is interrupted, a\nspark occurs between the poles of the switch (or the poles of a plug that is pulled).\n(a) Explain this phenomenon. Where does the energy for the spark come from?\n(b) Assume an inductor L=1mH and a resistor R=10Ω are connected in series to a\nbattery providing V=100V. How much energy is stored in the inductor a long\ntime after the circuit is closed?.\nProblem 3 (6 points) Young&Freedman, Problem 30.10\nProblem 4 (6 points) Young&Freedman, Problem 30.14\nProblem 5 (6 points) Young&Freedman, Problem 30.26"
    },
    {
      "category": "Assignment",
      "title": "802x_05_pset11.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-02x-physics-ii-electricity-magnetism-with-an-experimental-focus-spring-2005/95030e0a837c3abeb9487b93f605ccd8_802x_05_pset11.pdf",
      "content": "Massachusetts Institute of Technology\nSpring Term 2005\n8.02x Electricity and Magnetism\nProblem Set 11\nIssued:\nSun, April 24\nDue:\nFri, April 29, 4PM <- note Date & Time!\nNote that Exp AMP check-off and write-up are also due 4/2\\9\nReading suggestions (from Young&Freedman)\nMon, 4/25: RLC circuits, Resonance: 30-6, 31-3,31-5\nWed, 4/27: Displacement current, Maxwell's Equations: 29-7\nFri, 4/29: Electromagnetic Waves: 32-1 to 32-3\n\\\nProblem 1 (10 points)\nHow do you know that sound is not an electromagnetic wave? What kind of wave is it?\nProblem 2(10 points) Young & Freedman 29.38\nProblem 3(10 points) Young & Freedman 32.6"
    },
    {
      "category": "Assignment",
      "title": "802x_05_pset12.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-02x-physics-ii-electricity-magnetism-with-an-experimental-focus-spring-2005/9584403c29b40e7e3d26b30f4a99e57c_802x_05_pset12.pdf",
      "content": "Massachusetts Institute of Technology\nSpring Term 2005\n8.02X Electricity and Magnetism\nProblem Set 12 (50 points)\nFor this problem set, you need to check-off the MW experiment and submit the MW write-\nup. Check-off for the experiment is due on Thursday. 5/12. The MW check-off will count\ndouble (20 points) relative to all other experiments. There will be 6 bonus points for check\noff by 5/6, 4 for check-off on 5/ 9 and 2 on 5/10.\nLab hours are Mon 3-5, Tues. 7:30-9:30 pm, Wed 7:30-9:30 pm, Thur 3-5, Fri 12-3.\nYou will be graded according to the following criteria:\n1. Your Experiment: Microwave apparatus works (you will need to demonstrate a trial run\nduring the check-off).\n2. Your understanding of how to measure the microwave wavelength.\n3. You may be asked a question during the check-off about the electromagnetic waves\ngenerated and received by your apparatus. You should know about the polarization of the\nwaves generated by the transmitting antenna.\nProblem 1: Observations\n1) Observe the waves by holding the receiving antenna parallel to the transmitting antenna\nand moving it back and forth. In the \"near\"\n1 r\nor \"induction\" field, less than a few\n1 r\n1 r\nwavelengths, the strength of the field falls off as\nand hence the power falls as\n.\nBut in the \"far\" or \"wave\" zone, greater than a few wavelengths, the field falls off as\n,\nand the power as 1 r\n2 as is appropriate for EM radiation. Remember that your amplifier\n\"overloads\" at about 4V and is no longer linear in its response. If you have too much\nsignal, move the antennas apart. Briefly describe your observations.\n2) Turn the receiving antenna 360o about the line between it and the transmitter; What\nhappens? Explain.\n3) Interpose a metal plate such as an aluminum-wrapped envelope with its plane\nperpendicular to the line joining the antennas. What happens? Is the effect different\naccording to whether the envelope is placed between the antennas with its long\ndimension horizontal or vertical?\n\n4) With the receiver at a fixed location, say 0.5m from the transmitter, adjust the reflector\n(use a textbook covered with foil) for maximum signal. What is the optimum distance\nbetween reflector and transmitting antenna?\n5) Explore briefly how the received signal varies with the position of the receiving antenna:\na) as you move the antenna in a horizontal circle about the transmitting antenna as\ncenter; keep the receiving antenna horizontal and always at right angles to the line\nfrom it to the transmitter.\nb) as you move it around a vertical circle; keep the receiving antenna horizontal\n(parallel to the transmitter dipole).\n6) Make a polarizer by wrapping #26 wire from your 38 turn coil (no longer needed) around\nan envelope. Tape the wire. Interpose this between the antennas and see what happens as\nyou turn it, so the wires are parallel and perpendicular to the antennas.\nProblem 2: Measuring the Wavelength\nWhen everything is optimized in your microwave set-up and with a steady spark, search for\nminima and maxima by moving the receiving antenna slowly toward or away from the\ntransmitting antenna. Standing waves are produced by the interference pattern of two waves\ntraveling in opposite directions. These two waves come from the transmitter and the reflector.\nYou can improve your measurement by putting the transmitter's reflector behind the transmitter.\nFix your receiving antenna about 20cm\n30cm\nto\naway from the transmitter. As you move the\nreflector closer to the transmitter, the receiving antenna will show maxima and minima.\na) What distance is your receiving antenna from your transmitter?\nb) What were the nearest and second nearest distances you put your transmitter's reflector behind\nthe transmitter so that the receiving antenna showed a maxima?\nc) What were the nearest and second nearest distances you put your transmitter's reflector behind\nthe transmitter so that the receiving antenna showed a maxima?\nd) From the data in parts b) and c), what is the wavelength of the radiation? Explain how\nyou obtained your answer.\n\nx = 0\nd\n\"t = #\nx = 0\nd\nx = L\nProblem 3: Microwave Experiment\nSuppose the transmitting antenna located at the position\nparallel to the y-axis and generates a plane sinusoidal wave of frequency f = 2.4 \"10\n9 Hz\nin the microwave experiment is\n. The\namplitude of the wave is E0.\nx = d\na) What is the wavelength of the wave?\nb) Approximate the electromagnetic wave generated by the transmitter field by a plane wave\nthat is traveling in the negative x-direction. The y-component of the electric field is given\nby\nEy = Ey,0cos( kx + \"t ).\nWrite down an expression for the magnetic field of the plane wave that is traveling in the\nnegative x-direction. Indicate the direction and amplitude of the magnetic field.\nc) A conducting plate is placed at the position\n, a distance\nbehind the transmitting\nantenna. At time\n, and at the position of the conductor\n, what are the\ndirections of the electric and magnetic fields of the plane wave that is reflected from the\nconductor.\nd) Find the closest distance\nbehind the transmitter that the conductor must be placed in\norder for the reflected wave and the transmitted wave to add up to produce a maximum\nconstructive interference pattern. These two waves are each travelling in the positive x-\ndirection. Briefly explain your reasoning.\ne) Now suppose a second conducting plate is placed at a position\nin order to\nmaximize the signal from the receiving antenna when it is placed between the plates. The\nreceiving antenna is moved along the x-axis. Briefly explain what signal pattern the\nantenna receives. Briefly explain what type of wave now exists between the plates.\n\nf) With the two conducting plates in place, the receiving antenna is moved along the x-axis.\nBriefly explain what signal pattern the antenna receives."
    },
    {
      "category": "Assignment",
      "title": "802x_05_pset2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-02x-physics-ii-electricity-magnetism-with-an-experimental-focus-spring-2005/6f2ae0f49725bc048955254e222f4928_802x_05_pset2.pdf",
      "content": "Massachusetts Institute of Technology\nSpring Term 2005\n8.02X Electricity and Magnetism\nProblem Set 2 and Experiment Problem LVPS\nIssued:\nFri, Feb 4\nDue:\nFri, Feb 18, 4PM <- note Date + Time!\nPlease note that both students for each partnership must submit the LVPS experiment\nwrite-up, answering the LVPS experiment questions found below and submit the\nanswers together with pset 2. This is in addition to the LVPS experiment check-off,\nwhich is due Fri, 2/18, 3PM.\nReading suggestions (from Young & Freedman, University Physics, 11th edition)\nMon, 2/14: Electric Flux, Gaus' Law: 22-1 to 22-5\nWed, 2/16: Electric Potential Energy, Electric Potential (1/2): 23-1, 23-2\nFri, 2/18: Electric Potential Energy, Electric Potential, Quiz Review: 23-3\nHomework Problems (30 points)\nProblem 1 (5 Points) Consider an infinite plane (non-conducting) with a uniform\nnegative surface charge density σ.\n(a) Draw a sketch of the electric field (using field lines) close to the plane.\n(b) Explain in words why the field has to look the way you have drawn (using\nsymmetry arguments). (Keep your explanation to 2-3 sentences)\nProblem 2 (5 Points) Consider an ellipsoidal conducting object carrying a positive\ncharge Q (shown below).\n(a) Draw a sketch of the elecric field (using field lines) very close to the surface of\nthe object. Your sketch should show where the magnitude of the electric field will\nbe biggest.\n(b) Explain in words how the fact that we are looking at a conducting object\ndetermines the direction of the field relative to the surface at very small distances\nto the surface. (Keep your explanation to 2-3 sentences)\n\nProblem 3 (5 points):\nConsider an electric dipole consisting of point charges +q and -q, separated by a fixed\ndistance d.\n(a) Determine the net force and net torque on the dipole in a uniform electric field E\nas a function of the angle φ between the axis of the dipole and the direction of the\nfield.\n(b) Now the dipole is brought into the field of a fixed point charge Q, which is at\ndistance r from +q and distance (r+d) from -q. We observe that the dipole\naccelerates towards Q. Is Q positive or negative?\n(c) If the dipole has mass m, what will be the initial acceleration of the dipole in case\n(b)?\nProblem 4 (5 Points): Young + Freedman, Challenge Problem 22.65\nProblem 5 (5 Points): Young + Freedman, Exercise 23.39\nProblem 6 (5 Points): Young + Freedman, Problem 23.61\n\nExperiment Low Voltage Power Supply (LVPS)\nDue Date: Check-off by Friday, 2/18, 3PM in lab 4-355.\nLab Hours: Monday: 3-5 pm, Tuesday: 7:30-9:30pm, Wednesday: 7:30-9:30 pm,\nThursday: 3-5 pm, Fridays: 12-3 pm\nThere will be 2 bonus points for check-off on Monday, 2/14 and 1 bonus point on\nTuesday, 2/15!\nCheck-off Criteria:\n- Every partnership needs to build two LVPS's.\n- One working LVPS must be demonstrated, with an output voltage range between\n1.2 and 17V\n- All connections need to be properly soldered, with no shorts or bad contacts\n- You should be prepared to explain the testing procedure out lined below\n- You will NOT be responsible for a detailed explanation of how the LVPS\nworks (yet)!\n-\nLVPS Measurement:\nTo test the characteristics of the LVPS, we will see how the output voltage of the LVPS\nchanges when a load (the 8W filament of the 1157 lamp) is connected to the LVPS\noutput.\nTo perform the measurement, you will need to do the following:\n1. Connect the LVPS to the wall transformer. Use a multimeter to determine\nthe output voltage of the LVPS. Verify that by turning the pot you can\nvary the output voltage between approximately 1.2 and 17V.\n2. Determine which filament of the 1157 lamp is the 8W filament and which\nis the 26W filament.\n3. For 8 different settings of the potentiometer between the minimum and\nmaximum, record the LVPS output voltage without the lamp connected\n(no-load voltage) and with the 8W filament of the lamp connected (load\nvoltage) for the same pot setting.\n\nLVPS Homwework tasks (20 points total):\n(Data table, graph and answer need to be handed in by BOTH partners,\ntogether with pset 2 on Fri, 2/20)\nTask 1 (10 points): Record the no-load and load (Vno load and Vload) voltages in a table.\nPlot Vload in a graph against Vno load.\nTask 2 (5 points): Determine over which range of no-load voltages connecting the lamp\nleaves the LVPS output voltage unchanged.\nTask 3 (5 points): Describe how you distinguished the 8W and 27W filament."
    },
    {
      "category": "Assignment",
      "title": "802x_05_pset3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-02x-physics-ii-electricity-magnetism-with-an-experimental-focus-spring-2005/8a13de05815f1c05a185dbee87cb728a_802x_05_pset3.pdf",
      "content": "Massachusetts Institute of Technology\nSpring Term 2005\n8.02X Electricity and Magnetism\nProblem Set 3\nIssued:\nWed, Feb 16\nDue:\nFri, Feb 25,, 4PM <- note Date + Time!\nReading suggestions (from Young & Freedman)\nFri, 2/18 : Quiz 1 Review\nTue, 2/22: Quiz\nWed, 2/23: Electric Potential cntd 23-3, 23-4\nFri, 2/25: Capacitance 24-1\nHomework Problems (30 points total)\nProblem 1 (10 points) Two pointlike test charges +q and -q are brought separately into\nthe vicinity of a pointlike charge +Q. First charge +q is brought to a distance r from +Q\nand then +q is removed and -q is brought to the same distance r.\n(a) At distance r from +Q, which of the two charges +q or -q has the greater\npotential energy U, relative to U(infinity) = 0?\n(b) How big is the difference in potential energy for +q and -q?\n(c) What can you say about the electric potential in the two cases?\nProblem 2 (10 points) A proton is shot towards a lead nucleus from very far away. The\nproton reaches a closest distance to the nucleus of 10 fermi before being pushed back.\nWhat is the initial speed of the proton?\nProblem 3(10 points) Consider two spherical conductors with radii A and B (A>>B),\nthat are connected by a conducting rod. The spheres carry a combined net charge +Q.\n(a) Explain why the electric potential of the surface of both spheres will be the\nsame\n(b) Determine the ratio of the electric field strengths near the surfaces of the two\nspheres.\n\nEXPERIMENT HVPS Questions\nLab Hours: Mondays: 3-5 pm, Tuesday: 7:30-9:30 pm, Wednesday: 7:30-9:30 pm,\nThursday: 3-5 pm, Fridays: 12-3 pm\nDue Date: Check-off by March 4 in lab 4-355. To satisfy the check-off for the\nBuilding the HVPS you must do the following tasks.\nYou will be graded according to the following criteria:\n1. Your HVPS works properly.\n2. The HVPS is wired according to the wiring diagrams that are shown in the lab\nwrite-up.\n3. All connections are properly soldered without shorts.\n4. You should be prepared to briefly explain the questions below.\n5. You will not be responsible yet for a detailed explanation of how the HVPS\nworks.\nBonus Points Policy: Check-offs that are finished during the week of Feb 22-Feb 25\nwill receive 3 extra points. Check-offs on Mon 2/28 will receive 2 extra points, and\ncheck-offs on Tue Mar 1 will receive 1 extra point.\nQuestion 1: Testing The HVPS.\nMeasurements:\nWe will measure the voltage output of the HVPS with no-load and with the 1 MΩ\nresistors as loads. Adjust the pot on your LVPS so that the output voltage of the LVPS is\nbetween 1.5V and 12 V . Use one of your multimeters to monitor the output voltage of the\nLVPS throughout the following measurements. Set the other multimeter to the l K range\nand connect the leads not at the output of the HVPS but just before the 1 MΩ resistors\nposition (in the above diagram this connection is labeled output voltage). (Place your\n\npositive red input into the appropriate input to the meter, labeled +DC 1000 V. The\nblack ground input goes in the usual place.)\n1) Determine the range of output voltages for the HVPS.\nNow make five measurements of your HVPS between 100V to 1000V with three\nloads, MMM only, the MMM and the two 1 MΩ resistors, and the MMM and one 1MΩ\nresistor . For each setting of the pot:\n2) For each setting of the pot, measure the output voltage of the HVPS with your\nMMM (note that the MMM is the only load).\n3) Use a clip lead to connect the ends of the two 1 MΩ resistors together so as to put\nthem in series across the output of the HVPS (in the above diagram this\nconnection is labeled (3)). For each setting of the pot, measure the new output\nload voltage of the HVPS.\n4) Use a clip lead to put only one of the 1 MΩ resistors as a load across the output of\nthe HVPS (in the above diagram this connection is labeled (4)). For each setting\nof the pot, measure the new output voltage of the HVPS.\nRecord your results in the accompanying data table at the end of this problem (which you\nshould hand in with your answers).\nQuestion 2:\n1) The multi-meter, on the 1K scale, acts like a resistor with resistance of\n20,000Ω/V DC . This means that to find the resistance you multiple\n20,000Ω/V DC by the full scale voltage reading which is 1000V . What is the\nresistance RMMM of your multi-meter on the 1K scale?\n2) Draw circuit diagrams of your HVPS, the multi-meter and the loads. Is your\nmulti-meter in parallel or in series with the load?\n3) When the multi-meter is in parallel with the load the equivalent resistance Req is\ngiven by\n\nReq\n=\nRMMM\n+\nRload\n.\nWhen the multi-meter is in series with the load the equivalent resistance Req is\ngiven by\nReq = RMMM + Rload.\nWhat is the equivalent resistance for loads of 2MΩ and 1MΩ loads?\n\n4) Calculate the current output of your HVPS given by\nV\nI =\noutput .\nReq\nCalculate the current output of your HVPS for each setting of the pot for both the\n2 MΩ load and 1MΩ load. Record your results in the last two columns of the\ndata table."
    },
    {
      "category": "Exam",
      "title": "practice_quiz_sol.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-02x-physics-ii-electricity-magnetism-with-an-experimental-focus-spring-2005/d40cc9e5644bdb33f2c07a5986391716_practice_quiz_sol.pdf",
      "content": "Updated solutions for 8.02x\npractice quizzes 1a and 1b\nPractice Quiz 1a, problem 1, part b:\nPotential energy of negative charge Q0 as a function of x\nx\nU(x) -U(0)\nQ2>0\nQ1>0\nSum of two 1/r\npotential energy graphs\nAsymptotic value\nfor x -> +/- infinity\nLocal (unstable) maximum in between Q2 and Q1\nPractice Quiz 1a, problem 3, part b:\nConsider the external field as shown on the solutions:\nThe positive charge feels a force towards -x, the negative charge feels a\nforce towards +x. Because the external field at the pos. charge is bigger\n(denser field lines), the net force will be towards -x, if both charges have\nthe same magnitude. Note that the field of the two dipole charges does not\nplay a role - the dipole can't exert a net force on itself.\nIncreasing the negative charge will increase the force on the negative\ncharge in +x direction, until eventually the net force on the dipole is in +x.\nUnlike what it says in the solutions, the net torque will not reverse and the\ndipole is still in a stable orientation.\nU(r) -U(0)\nr\nr0\n-ln(r/r0)\nPractice Quiz 1a, problem 4, part c:\n\nPractice Quiz 1b, problem 3, part a:\nE\nuniform (-> no net force)\nand parallel to dipole axis\n(-> no net torque). Direction\nfrom requiring stable equilibrium.\nU(r) -U(0)\nr0\nPractice Quiz 1b, problem 4, part c:\nr"
    },
    {
      "category": "Exam",
      "title": "pract_quiz1a_05.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-02x-physics-ii-electricity-magnetism-with-an-experimental-focus-spring-2005/3a701a1b4b88c103ecea5b87f4a97efd_pract_quiz1a_05.pdf",
      "content": "Massachusetts Institute of Technology\nSpring Term 2005\n8.02X Electricity and Magnetism\nPractice Quiz #1a\nThe quiz has four questions. It is a closed book quiz. No calculators are allowed.\nA letter-size formula sheet can be used, but has to be signed and submitted together with\nthe quiz.\n\nProblem 1 (25 points)\nx\nConsider the configuration shown below, with a negative charge\nQ0 at position x0=0 and another positive charge Q1 at position\n1 along the x-axis.\n(a) At which position x2 could another positive charge charge\nQ2 be added, such that the total force on Q0 is 0? Give two\nexamples of x2 and corresponding Q2, in terms of x0, x1, Q0\nand Q1 (or a subset of these variables).\n(b) Suppose Q0 is free to move along the x-direction, while Q1\nand Q2 are fixed. For one of your examples, draw a sketch\non the graph below, showing the change in electric\npotential energy U(x) - U(0) for Q0 as a function of position\nin x.\n(Hint: Consider the potential energy due to Q1 and Q2\nseparately and remember the superposition principle)\n(c) Qualitatively, describe what would happen if Q0 was\ndisplaced by a small distance Δx from x0=0 to x=Δ x and\nthen released (two sentences max.)?\nQ0 < 0\nQ1 > 0\nx0 =0\nx =x1\nx\nx\nU(x)-U(0)\n\nProblem 2 (25 points)\nSuppose I brought an object to class and claimed that this\nobject carries a third type of charge (i.e. neither 'positive' nor\n'negative', but a third type of electric charge). Given what you\nknow about the attraction/repulsion between like and unlike\ncharges and between charged and neutral objects, describe the\nsteps you would take to verify or dispute my claim. Assume you\nhave positively and negatively charged objects and neutral\nobjects at hand and that you have a device to measure the force\nbetween any two objects.\nYour answer should have no more than 5 or 6 sentences.\n\nProblem 3 (25 points)\nShown below is an electric dipole with equal charges +Q and -Q\nseparated by a distance d. The dipole is free to rotate or move.\nConsider the following information: The dipole sits inside an\nexternal electric field with |E| > 0. The dipole does not feel a net\ntorque. The dipole feels a net force in the -x direction. When\nrotated from its original orientation and released, the dipole\nmoves back towards the original orientation.\n(a) On the picture below, sketch field lines corresponding to\nan external electric field that is compatible with this\ndescription. Do not include the field due to the dipole\ncharges.\n(b) How would the force and torque on the dipole change if\nthe magnitude of the negative charge was increased, i.e. if\nthe charge -Q was made more negative? (two sentences\nmax.)?\ny\nd\n+Q\n-Q\nx\n\nProblem 4 (25 points)\nShown below is a thin conducting cylindrical shell of radius r0,\ncarrying a surface charge density σ > 0 (the thickness of the\nshell can be neglected).\n(a) Find the electric field E(r) created by the charged shell as\na function of r, where r is the distance to the center of the\ncylinder (neglect edge effects, i.e. assume the shell is\ninifinitely long). Determine E(r) both for r < r0 and for r > r0.\nShow work.\n(b) Determine the corresponding electric potential V(r) as a\nfunction of r.\n(c) On the graph below, sketch the potential energy U(r) for a\npositive point-charge q0 > 0 in the field created by the\nshell.\nr0\nU(r)-U(0)\nr"
    },
    {
      "category": "Resource",
      "title": "pract_qz1a_sol.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-02x-physics-ii-electricity-magnetism-with-an-experimental-focus-spring-2005/60c9388a150a051319e22fb3ffd516d4_pract_qz1a_sol.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "pract_qz1b_05.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-02x-physics-ii-electricity-magnetism-with-an-experimental-focus-spring-2005/2b1151dfdc2c878a862172bc505f582e_pract_qz1b_05.pdf",
      "content": "Massachusetts Institute of Technology\nSpring Term 2005\nPractice Quiz #1b\nThe quiz has four questions. It is a closed book quiz. No calculators are allowed.\nA letter-size formula sheet can be used, but has to be signed and submitted together with\nthe quiz.\n\nProblem 1 (25 points)\nThis problem deals with 3 positive charges, Q0, 2Q0 and 3Q0.\nConsider the configuration shown below, with a +2Q0 at\nposition x0=0 and a positive charge Q0 at position x1 along the x-\naxis.\n(a) Find a position x2 where the third positive charge Q3 = 3Q0\ncould be added, such that the total force on Q3 is 0?\n(b) Suppose Q3 was moved a small distance Dx to the right\n(towards positive x) and then released from rest. What\nwould the subsequent motion of Q3 be?\n(c) Qualitatively, describe what would happen if Q0 was\ndisplaced by a small distance Δx from x0=0 to x=Δ x and\nthen released (two sentences max.)?\n2Q0 >\nQ0 > 0\nx0 =0\nx =x1\nx\nx\nU(x)-U(0)\n\nProblem 2 (25 points)\nConsider the sequence of events (1) to (4) shown below. We\nstart with 2 neutral conducting spheres that touch each other,\nbut are insulated from the rest of the world (1). Then a positively\ncharged rod is brought close to sphere 1, while sphere 1 and\nsphere 2 still touch. The rod does not touch the spheres(2). In\nthe next step, the spheres are separated (3). Finally, the charged\nrod is removed (4).\n(a) For each of the 4 steps, sketch the charge distribution on\nthe spheres on the pictures below.\n(b) After the rod has been removed (step (4)), consider the\ncharges Q1 on sphere 1 and Q2 on sphere 2. Which of the\nfollowing statements is true:\n(i)\nQ1 = Q2 = 0\n(ii)\n|Q1| > |Q2|\n(iii)\n|Q2 | < |Q1|\n(iv)\nQ1 = - Q2, Q1 < 0\n(v)\nQ1 = - Q2, Q1 > 0\n(1)\n(2)\n+ +\n+ + +\n(3)\n(4)\n+ +\n+ + +\n\nProblem 3 (25 points)\nShown below is an electric dipole with equal charges +Q and -Q\nseparated by a distance d. The dipole is free to rotate or move.\nConsider the following information: The dipole sits inside an\nelectric field with |E| > 0. The dipole does not feel a net torque.\nThe dipole does not feel a net force. When rotated from its\noriginal orientation and released, the dipole moves back towards\nthe original orientation.\n(a) On the picture below, sketch field lines corresponding to\nan electric field that is compatible with this description.\n(b) Qualitatively, describe what would happen if the positive\ncharge +Q was doubled, while keeping the negative charge\nthe same (two sentences max.)?\n-Q\nd\n+Q\n\nProblem 4 (25 points)\nShown below is a thin conducting spherical shell of radius r0,\ncarrying a total charge Q > 0 (the thickness of the shell can be\nneglected).\n(a) Find the electric field E(r) created by the charged shell as\na function of r, where r is the distance to the center of the\nshell. Determine E(r) both for r < r0 and for r > r0\n(b) Determine the corresponding electric potential V(r) as a\nfunction of r, relative to V(r=0) = 0.\n(c) On the graph below, sketch the potential energy U(r) for a\nnegative point-charge q0 < 0 in the field created by the\nshell.\nr0\nU(r)-U(0)\nr"
    },
    {
      "category": "Resource",
      "title": "pract_qz1b_sol.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-02x-physics-ii-electricity-magnetism-with-an-experimental-focus-spring-2005/19f77a6759734abb8fe170e6d0d40934_pract_qz1b_sol.pdf",
      "content": ""
    },
    {
      "category": "Exam",
      "title": "quiz1sol.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-02x-physics-ii-electricity-magnetism-with-an-experimental-focus-spring-2005/1667b7ff23859a47e274ffbc8a7bcbce_quiz1sol.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "pract_qz2a_2005.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-02x-physics-ii-electricity-magnetism-with-an-experimental-focus-spring-2005/fbcef694bfc6c5fd38a3976aa8e048a1_pract_qz2a_2005.pdf",
      "content": "Massachusetts Institute of Technology\nSpring Term 2005\n8.02X Electricity and Magnetism\nPractice Quiz #2a\n\nProblem 1 (25 points)\nShown below is a circuit consisting of a power supply with an\noutput voltage ΔV and three identical light bulbs. For all\nanswers, explain your reasoning in one or two sentences.\n(a) Which of the bulbs will burn most brightly or will they all\nshow the same brightness?\n(b) Suppose bulb 2 was replaced with a bulb with twice the\npower rating. Would bulbs 1 and 3 burn brighter, less\nbright or be unaffected? Explain your reasoning.\n\n-\n+\na\nb\nΔV\n\nProblem 2 (25 points)\nA glass plate with dielectric constant K=2 is inserted into a\nparallel plate capacitor with area A and distance d0 between\nplates. Using a power supply, the capacitor is charged to a\ncharge Q. The power supply is NOT disconnected.\n(a) What is the energy stored in the capacitor?\n(b) The separation between the plates is increased to d=2d0,\nbut the glass plate remains in the same position. What is\nUstored now?\n\nd0\nd0\n(a)\n(b)\n2*d0\n\nProblem 3 (25 points)\nIn one of the lecture demos, a large capacitor was charged using\na power supply with on output voltage of 4000V and internal\nresistance of 10kOhm. Assume that at times t < 0 the capacitor\nis completely uncharged. Then the switch is moved to position\na to charge the capacitor.\n(a)Sketch how the charge Q on the capacitor will change as a\nfunction of time for t < 0.\n(b)At which time t will the power delivered by the power\nsupply by maximal? Explain in one or two sentences.\n(c) What is the maximum power provided by the power\nsupply?\n\n!V = 4000 V\nC = 100μF\n!V = 4000 V\nΩ\na\nb\nΩ\nthin wire with\nR =0.4\nr =10k\n\nProblem 4 (25 points)\nShown below is a schematic view of experiment EF. Assume the\nfoil jumps at a potential difference between the plates of 300V.\nFor questions (a) and (b), give the (approximate) reading of MM1\nand MM2 in Volts (assume MM1 and MM2 have identical\ncharacteristics).\n(a) What are the readings of MM1 and MM2, immediately after\nthe foil jumps and connects the two washers?\n(b) What are the readings of MM1 and MM2, immediately\nbefore the foil jumps and connects the two washers?\n(c) Determine the electric force on the foil for a potential\ndifference ΔV < 400 V (i.e. before the foil jumps). The foil\ncarries charge Q, the distance between washers is d.\n\n+\nMM2\nV\nHVPS\n-\nV\nd\nMM1\nAl Foil\n(mass m, charge Q)"
    },
    {
      "category": "Resource",
      "title": "pract_qz2b_2005.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-02x-physics-ii-electricity-magnetism-with-an-experimental-focus-spring-2005/e744c55925a1b8af3cc704089de03cb7_pract_qz2b_2005.pdf",
      "content": "Massachusetts Institute of Technology\nSpring Term 2005\n8.02X Electricity and Magnetism\nPractice Quiz #2b\n\nProblem 1 (30 points)\nIn lecture, you saw a demo with a parallel plate capacitor with\ncapacitance C0. The capacitor was connected to an ideal power\nsupply with an output voltage ΔV and charged to a charge Q.\nThe capacitor was disconnected from the power supply, still\ncarrying the same charge Q. Then the distance between the\nplates was increased by a factor of 2.\n(a) How big is the potential difference between the capacitor\nplates after they have been moved apart?\n(b) How big is the stored electrical energy in the capacitor\nafter the plates have been moved apart?\n(c) Explain how energy was conserved when moving the\nplates apart (1 sentence).\n(d) Suppose we had not disconnected the power supply\nbefore moving the plates apart. How big would the stored\nenergy be after the plates have been moved apart in this\ncase?\n\nProblem 2 (20 points)\nShown below is the cross-section of a parallel plate capacitor\nwith distance 2*d between the plates. The capacitor is given a\ncharge Q using a power supply and then disconnected from the\npower supply. Then a dielectric with thickness d and dielectric\nconstant K=2 is inserted between the plates.\n(a) Does the stored energy increase, decrease or stay the\nsame when the dielectric is inserted?\n(b) On the graph below, draw a qualitative sketch of the\nelectric potential between the capacitor plates as a\nfunction of x between x=0 and x=2d. At which value of x\ndid you choose to set V=0?\nd\nV\n+Q\n-Q\nd\n2d\nx\nX=0\nX=2d\n\nProblem 3 (30 points)\nShown below is the schematic setup of the EF experiment,\nincluding the HVPS and the two multimeters. The multimeters\nhave a resistance of 20MOhm. Suppose MMM1 measures 400V\njust before the foil jumps. We define the negative terminal of the\nHVPS to be at a potential of 0V.\n(a) What is the potential of washer 1 before the foil jumps and\nconnects the two washers?\n(b) What is the reading of MMM2 before the foil jumps?\n(c) After the foil jumps, the reading of MMM1 drops to 380V.\nWhat is the potential of washer 1 now?\n(d) What is the reading of MMM2, after the foil has jumped?\n(e) Explain why the reading of MMM1 dropped after the foil\njumped.\n(f) Assume the experiment was repeated with the distance\nbetween the washers doubled to 2*d. At which reading of\nMMM1 would the foil jump in this case? Explain your\nanswer.\n+\n-\nV\nV\nd\nMMM1\nHVPS\nMMM2\nAl Foil\n\nProblem 4 (20 points)\nShown below is a simple circuit consisting of a pair of light\nbulbs, connected in series to an ideal power supply providing a\nconstant 'voltage' ΔV = 12V.\n(a) Assume bulb 1 is rated as a 36W bulb at 12V, i.e. it will\nconsume 36W of electrical power if connected to a 12V\npower supply. What is its resistance?\n(b)Assume bulbs 1 and 2 are identical. In the circuit below,\nwhich one would burn brighter or would they show the\nsame brightness?\n(c) Assume bulb 1 is rated as a 36W bulb and bulb 2 as a 72W\nbulb. Which one would burn brighter (i.e. consume more\npower) in the circuit below, or would they both show the\nsame brightness? Explain your answer.\n-\n+"
    },
    {
      "category": "Exam",
      "title": "practquiz2_sol.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-02x-physics-ii-electricity-magnetism-with-an-experimental-focus-spring-2005/151d95328b46e5cb4092a3fbaded190d_practquiz2_sol.pdf",
      "content": ""
    },
    {
      "category": "Exam",
      "title": "quiz2_review.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-02x-physics-ii-electricity-magnetism-with-an-experimental-focus-spring-2005/e33598c4e6385783c8ca716f87f2f107_quiz2_review.pdf",
      "content": "Mar 12 2005\nNews\n- Quiz #2: Monday, 3/14, 10AM\n- Same procedure as for quiz 1\n- Review in class Fri, 3/11\n- Evening review, Fri, 3/11, 6-8PM\n- 2 practice quizzes (+ practice problems)\n- Formula sheet\nMar 12 2005\nCharge and Potential\n+\n+\n+\n+\n+\n+\n+\nR\n+\n+\n+\n+\n+\n+\n+\n+\n+\n-\n-\n-\n--\n-\n-\n--\nd\nCharged Sphere\nParallel Plate\nCapacitor\nV=1/(4 ! \"0 R) Q\nV= d/(A \"0) Q\nGeometry!\nMar 12 2005\nCharge Density\n+\n+\n+ +\n+\n+\n+\n+\n+++\n+\n+\n+\n+\n+\nDemo:\nLocal radius of curvature\nApplication: Lightning rod -\nBiggest E near pointy tip!\nMar 12 2005\nCharge and Potential\n- For given geometry, Potential and Charge\nare proportional\n- Define\n- Q = C V -> C is Capacitance\n- Measured in [F] = [C/V] : Farad\n- C tells us, how easy it is to store charge on\nit (V = Q/C )\n\nMar 12 2005\nCapacitance\nV\nslope = C\nC big\nC small\nQ\nV0\nQ1\nQ2\nC bigger -> Can store more Charge!\nMar 12 2005\nCapacitor\n- Def: Two conductors separated by insulator\n- Charging capacitor:\n- take charge from one of the conductors and put\non the other\n- separate + and - charges\nMar 12 2005\nweb.mit.edu/8.02x/www\nParallel Plate Capacitor\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n-\n-\n-\n--\n-\n-\n--\n-\n-\nd\n-Q\n+Q\n- To store lots of charge\n- make A big\n- make d small\nMar 12 2005\nEnergy stored in Capacitor\n- Work W = 1/2 Q2/C = 1/2 C V2 needed to\ncharge capacitor\n- Energy conserved\n- But power can be amplified\n- Charge slowly\n- Discharge very quickly\n\nMar 12 2005\nDemo (Loud...)\nVab = 4000 V\nC = 100μF\nU = 800 J\nthin wire\nMar 12 2005\nWhere is the energy stored?\n- Energy is stored in Electric\nField\n- E2 gives Energy Density:\n- U/Volume = ! e0 E2\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n-\n-\n-\n--\n-\n-\n--\n-\n-\nd\n-Q\n+Q\nMar 12 2005\nDielectrics\n2 cm\nIn your toolbox:\nC = 1000μF\n- Parallel Plate Capacitor:\n- C = \"0 A/d\n- Ex. A = 1m2, d=0.1mm\n-> C ~ 0.1μF\n- How can one get small\ncapacitors with big capacity?\nMar 12 2005\nDielectric Demo\n- Start w/ charged capacitor\n- d big -> C small -> V\nlarge\n- Insert Glass plate\n- Now V much smaller\n- C bigger\n- But A and d unchanged !\n- Glass is a Dielectric\n+\n+\n+\n+\n+\n+\n+\n-\n-\n-\n--\n-\n-\n--\n-Q\n+Q\n\nMar 12 2005\nMicroscopic view\nPolarization P = const. E = \"0 # E\n+\n+\n+\n+\n+\n+\n+\n-\n-\n-\n--\n-\n-\n--\n-Q\n+Q\n+\n-\n+\n-\n+\n-\n+\n-\n+\n-\n+\n-\n+\n-\n+\n-\n+\n-\n+\n-\n+\n-\n+\n-\n+\n-\n+\n-\n+\n-\n+\n-\n+\n-\n+\n-\n+\n-\n+\n-\n+\n-\n- +\n+\n-\n+\n-\n+\n-\n+\n-\n+\n-\n+\n-\n+\n-\n+\n-\n+\n-\n+\n-\nMar 12 2005\nDielectric Constant\n- Dielectric reduces field E0 (K > 1)\n- E = 1/K E0\n- Dielectric increases Capacitance\n- C = Q/V = Q/(E d) = K Q/(E0d)\n- This is how to make small capacitors\nwith large C !\nMar 12 2005\nElectric Current\n- We left Electrostatics\n- Now: Charges can move in steady state\n- Electric Current I:\n- I = dQ/dt\n- Net amount of charge moving through\nconductor per unit time\n- Units:\n- [I] = C/s = A (Ampere)\nMar 12 2005\nElectric Current\n- Current I = dQ/dt has a direction\n- Convention: Direction of flow of positive\ncharges\n- In our circuits, I carried by electrons\n- To get a current:\n- Need mobile charges\n- Need |E| > 0 (Potential difference)\n\nMar 12 2005\nDemo I\n+\n+\n+\n+\n+\n+\n+\n+\nElectroscope\nCharged Ions\nIons discharge\nElectroscope\nMar 12 2005\nDemo II\nVoltage source\nGlass\nLight Bulb\nMolten glass: Charge carriers become mobile ->\nCurrent flows -> Bulb lights up!\nMar 12 2005\nDemo III\n110 V\nDistilled Water\nLight Bulb\nAdd NaCl: Dissociates into Na+ and Cl-\nCharge carriers are available -> Current flows ->\nBulb lights up\nMar 12 2005\nDemo IV\nVoltage\nsource\nLight bulb (bright)\nLiquid Nitrogen\n(T ~ -200oC)\nWire cold -> less resistance -> more current ->\nbulb burns brighter\n\nMar 12 2005\nResistivity\n- Interplay of scattering and acceleration gives\nan average velocity vD\n- vD is called 'Drift velocity'\n- How fast do the electrons move?\n- Thermal speed is big: vth ~ 106 m/s\n- Drift velocity is small: vD ~ 10-3 m/s\n- All electrons in conductor start to move, as\nsoon as E> 0\nMar 12 2005\nResistance\n- Define R = V/I : Resistance\n- R = $ L /A for constant cross section A\n- R is measured in Ohm [%] = [V/A]\n- Resistivity $ is property of material (e.g. glass)\n- Resistance R is property of specific conductor,\ndepending on material ($) and geometry\nMar 12 2005\nOhm's law\nV = R I\n- Conductor is 'Ohmic', if R does not depend on V,I\n- For real conductors, that is only approximately true\n(e.g. R = R(T) and T = T(I))\n- Approximation\n- valid for resistors in circuits\n- not valid for e.g. light bulbs\nMar 12 2005\nElectric Power\n- Use moving charges to deliver power\nPower = Energy/time = dWdt\n= (dq V)/dt =\ndq/dt V = I V = I2R = V2/R\n\nMar 12 2005\nElectric circuits\n&\nR\nResistor\nSource of EMF\n+\n-\nI\nCapacitor\nC\nMar 12 2005\n&\nR\n+\n-\nI\na\nb\nc\nd\na\nb\nd\nc\nV\nElectromotive Force EMF\n- Def: & = Work/unit charge\n- & is 'Electromotive Force' (EMF)\n- Units are [V]\n&\nIR\nMar 12 2005\nInternal resistance\n- Sources of EMF have internal resistance r\n- Can't supply infinite power\nR\nBattery\n+\n-\nb\nr\n&\na\nVab = & - I r\n= IR\n-> I = & /(r+R)\nMar 12 2005\nElectric Circuits\nResistors in series\nR1\nVac = Vab + Vac= I R1 + I R2 = I (R1 + R2)\n= I Req for Req = (R1 + R2)\nVa\nVc\nR2\nVb\nI\nI\n\nMar 12 2005\nElectric Circuits\nResistors in parallel\nR1\nI = I1+I2 = Vab/R1 + Vab /R2 = Vab /Req\n-> 1/Req = 1/R1 + 1/R2\nVa\nR2\nI\nI\nVb\nMar 12 2005\nElectric Circuits\n- Two capacitors in series\n- V14 = V23 + V56\n- Q = Q1 = Q2\n- Vtot = Q1/C1 +Q2/C2 = Q/\n(C1+C2)\n- 1/Ctot = 1/C1+1/C2\n- Inverse Capacitances add!\n\nV14\nC1\nC2\nMar 12 2005\nElectric Circuits\n- Two capacitors in parallel\n- V56 = V23 = V14 (after\ncapacitor is charged)\n- Q1/C1 = Q2/C2 = V14\n- Qtot = Q1 +Q2\n- Ctot = (Q1 +Q2 )/ V14 =\nC1+C2\n- Capacitors in parallel ->\nCapacitances add!\nV14\nC1\nC2\nMar 12 2005\nDemo\n+\n-\nDC Supply\nLight Bulb\nResistor\nWater cell\nDiode\nFluorescent\nTube\nEMF & = V12 + V34 + V56 + V78 + V910\n?\n\nMar 12 2005\nLoop Rule\nV\n&\n1 2 3 4 5 6 7 8 9 10\nV12 = I R12\nV34 = I R34\nV56 = I R56\nV78 = I R78\nV910 = I R9\nIn general, ' Vj= 0\nLoop Rule\nMar 12 2005\nKirchoff's rules\n- Junction rule\n- Loop rule\nI\nI1\nI2\nI2\n' Iiin = '\nIjout\nAround closed loops:\n' ( Vj = 0\nAt junctions:\nCharge conservation\nEnergy conservation\n( V for both EMFs\nand Voltage-drops\nMar 12 2005\nKirchoff's rules\n- Kirchoff's rules allow us to calculate\ncurrents for complicated DC circuits\n- Main difficulty: Signs!\n- Rule for resistors:\nR\nVa\nVb\nI\n(V = Vb - Va = - I R , if we go in\nthe direction of I (voltage drop!)\nMar 12 2005\nKirchoff's rules\n- Kirchoff's rules allow us to calculate\ncurrents for complicated DC circuits\n- Main difficulty: Signs!\n- Rule for EMFs:\nVa\nVb\nI\n(V = Vb - Va = & , if we go in the\ndirection of I\n+\n-\n\nMar 12 2005\nExample\n- Pick signs for I1, &\n- Junction rule\nI1 = 1A + 2A = 3A\n- Loop rule (1)\n12V - 6V - 3A r = 0\n-> r = 6/3 % = 2 %\n- Loop rule (2)\n12V - 6V - 1V - & = 0\n-> & = 5V\n-\n+ 1%\n&\n3%\n+\n-\nr\n12V\n2A\n1A\nI1\nr, &, I1 ? 3 unknowns\nMar 12 2005\nweb.mit.edu/8.02x/www\nMMM2\n+\n-\nV\nV\nd\nAl Foil\n+Q\n-Q\nMMM1\nHVPS\nQ = CV = \"0A/d V\nExperiment EF"
    },
    {
      "category": "Resource",
      "title": "about_soldering.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-02x-physics-ii-electricity-magnetism-with-an-experimental-focus-spring-2005/907ce49a9ad65341896c9cbc6d48a061_about_soldering.pdf",
      "content": "About Soldering --Making Clip Leads--CLK\nIntroduction\nIn the course of these experiments, you will solder together wires and electronic\ncomponents to make an adjustable regulated direct current power supply and other devices.\nBefore you start doing the experiments, you and your partner will do three things involving\nsoldering, namely: making two clip leads, putting alligator clips on the multimeter leads, and\nputting alligator clips on the wall transformer leads.\nSoldering is a way of joining metals with solder, an alloy that melts at about 180\noC\n(360\no F). The hollow core of the wire solder in your tool kit contains a flux that cuts through\noxide films on the surfaces of the metals so that the molten solder can wet and bond them.\nSoldering Iron\nYour tool kit contains a pencil type soldering iron. Plug it in and after 2 to 3 minutes, rub\nits conical tip with solder to tin it; that is, a film of molten solder wets it.\nFigure 1: Tinning the soldering iron\nThe soldering iron in your toolkit requires some care. Once you have tinned the iron, you\ncan clean the tip with a quick pass with a paper towel or emery cloth. It is important to keep your\niron tinned otherwise oxides will form on the tip of the iron and the solder will not wet it. Unplug\nyour soldering iron when not in use. Keep the soldering iron away from flammable materials.\nThe tip of the iron gets very hot; be careful not to touch it.\nSoldering Wires\nTo solder, put the iron up against the wires to be joined, letting the iron heat up the wires\nfor a few seconds. Feed solder to the iron tip near the wires so that the molten solder can conduct\nheat to them and wet them. Smoke and vapors from this procedure are not harmful. Remove the\n\niron and let the solder solidify before moving the wires. The resulting joint should not come\napart except with a very strong pull.\nFigure 2: Soldering Connections\nYou should practice stripping (removing) the vinyl insulation from the ends of the\nstranded wire (in the clip lead kit), twisting the strands and tinning them with molten solder\nusing your soldering iron. Then solder the two ends of the wires together. Try tugging them\napart.\nMaking Clip Leads\nCut two pieces of vinyl-insulated stranded wire, about 300 mm (12 inch) long, one red,\none black. You'll find wire in the Clip Lead Kit (CLK). You can use the wire cutter part of the\nlong-nose pliers, or the wire strippers or scissors. Loosen the adjusting nut of the stripper, and set\nit so that the notch in the jaws just allows a regular paper clip to slide through. Wire is most\neasily stripped of its insulation by holding the wire with pliers with the part to be stripped\nprotruding and then levering the wire strippers against the plier jaws. Try not to cut any of the\nstrands. Remove about 4 mm (1/4 inch) of insulation from each end of each of the wires, and\ntwist the strands into a compact bundle.\n\nFigure 3: Stripping wires\nTin all the ends, which means put solder on them with your iron so that the strands are\nbound together. Put two sleeves of the same color as the wire insulation on the wires, large end\nfacing the wire ends. Make a right angle bend in the middle of the tinned part and put that\nthrough the hole in the end of the alligator clip from above (the side where there is a round pad to\nput your thumb when opening the jaws of the clip).\nFigure 4: Alligator clip\nSolder the tinned wire to the bottom side of the clip. You may find that it helps to hold\nthe clip in your pliers using a rubber band around the handle of the pliers to give a firm grip. Let\nit all cool. Bend the insulated part back and crimp the end of the clip around it. Work the sleeve\nover the clip. Repeat three more times to make two clip leads.\n\nFigure 5: Soldering clip leads\nAlligator Clips on Transformer Leads: In your Red Box you will find a Wall\nTransformer, that reduces the input 120V ac, 60 Hz (30 watt) from the line to a safe and\nconvenient 12V ac 1 A output with only moderate loss of power (heating the transformer). It is\nIMPORTANT that the leads of the transformer should be of unequal length to reduce the\nlikelihood of short circuits. If they are not, cut one of them so that it is about 50 mm (2 inches)\nshorter than the other. Put a black sleeve on each of the leads. Strip about 4 mm (1/4 inch) of\ninsulation from each end of each of the leads. Solder on alligator clips as before.\nPutting Alligator clips on the Multimeter Leads: Whenever you want to make a\nmeasurement with your meter, you will use the red and black test leads. Your analog multimeter\ncomes with test prods that have been removed. These prods would be useful in making quick\nmeasurements from point to point in some devices. They are not good for our purposes where we\nwant to leave the meter connected for extended times. Put red and black sleeves on the\nappropriate leads. Solder on alligator clips as you did for clip leads."
    },
    {
      "category": "Resource",
      "title": "about_wire.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-02x-physics-ii-electricity-magnetism-with-an-experimental-focus-spring-2005/147b95a16b8586ead5323ccc976d060c_about_wire.pdf",
      "content": "About Wire\nIntroduction\nThere's a mind-boggling variety of wire available nowadays, probably thousands of\nkinds. Wire is made by drawing ductile metal bars through ever smaller holes in a succession of\ndies to produce the desired size. Much wire is used for mechanical purposes: wire rope, wire-\nwrapped cannon barrels, picture wire, guy wires, spring wire, barbed wire, all mostly iron and\nsteel and alloys. Practically every solid element in the periodic table is used as wire, pure or\nmore often as an alloy, for a wide variety of purposes. Some common examples are lead wire for\nfuses and lead-tin alloys for solder, indium and gold for vacuum gaskets, platinum for electrodes\nand resistance thermometers. Most of the wire used for electrical conductors is made of copper\nor copper alloy, or aluminum.\nElectrical wire comes in diameters from 0.0001inch (Wollaston wire, made by drawing\ndown silver-clad platinum wire and then dissolving away the silver) up to about a half inch--\nlarger than that and its called `cable' or `bar'. The size is described by a \"gauge\" number\naccording to the \"American Wire Gauge\" (AWG), a scheme in which the diameter of wire of\neach successively higher gauge number is less than the diameter of the previous one by a\nconstant factor, the 39th root of 92 = 1.122932197. The idea of a constant ratio between\nsuccessive sizes comes naturally from the drawing process, and the particular choice of numbers,\nessentially arbitrary, provides enough wire sizes for many different uses, from power\ntransmission to miniaturized electronics. (This constant ratio scheme is like the equally tempered\nmusical scale, where each note is higher in pitch than the previous one by the 12th root of 2).\nFacts About Wire\nNumber 2 copper wire weighs 0.2 pounds per foot and number 10 wire with a diameter of\n0.10 inch has a resistance of about 1.0 ohms per 1000 feet. You can scale from this using the fact\nthat an increase of three gauge numbers halves the area and weight and doubles the resistance.\nIncreases of 6 and 10 gauge numbers approximately divides the area by 4 and 10, respectively.\nIt's often important to know the current-carrying capacity of a particular wire, which depends on\nwhat kind of insulation it has, how hot it can get safely, and of course how well it's cooled.\nCooling is complicated; heat must be conducted outward through the wire insulation, and then\nremoved, mostly by convection, a process in which heated, less-dense fluid rises and is replaced\nby cooler stuff.\nMost electrical wire is insulated to prevent shorts, either by plastic or rubber or by a\ncoating of \"enamel\", so-called because it's shiny like porcelain. Teflon, fiberglass and cotton are\nalso used as insulation, and in the past, silk and asbestos were common.\nData from the Handbook of Chemistry and Physics (HCP, 58th edition, p F-163) will\ngive you an idea of the current-carrying capacity of bare copper wire: #12, 30 A; #14, 20 A; #18,\n6 A. Plotting the current-carrying capacity versus area for these wires (and a few more) reveals\nthe relations:\nI\n= 7.2 d\nd in mm , I in A\nmax\n\nWe can use this formula to compute current-carrying capacities-- not to be taken too seriously; if\nit smokes it's too much-- to put in the following table of wire properties.\nGaug\ne\nMaterial\nInsulation\nDiameter\n( mm )\nResistance\nper length at\n20C ( Ω m )\nMax\nCurrent\n( A)\nComments\nCu\nnone\n0.255\n0.339\n0.5\nCu\nenamel\n0.405\n0.134\n1.0\ntinned Cu\nplastic\n0.644\n0.053\n3.0\nSolid & stranded\nas discussed\nalloy\nnone\n1.29\n1.02\nUsed as shunt\nCu\nplastic\n1.63\n0.008\nhouse wire\nComments On Wire You'll Use\nRed & black insulated #22 stranded tinned copper wire---This stranded #22 wire is made of\n7 #30 wires, each covered with a thin layer of solder, ie. tinned, which makes it easy for you to\nsolder it. Seven strands of #30 wires have the same area (within 10%), and hence about the same\ncurrent carrying capacity as solid #22 wire. The plastic insulation is vinyl, a good insulator, but\neasily melted as you'll discover while soldering. Be careful when stripping off the insulation with\nwire strippers not to take along any of the wire strands; check by inspecting the removed piece of\ninsulation. Stranded wire is more flexible and resistant to breaking than the corresponding solid\nwire.\n#16 resistance wire, made of a metal called \"Alloy 800\" by its manufacturer (MWS Wire\nIndustries); it has a composition (in percentages) of 75 Ni, 20 Cr, 2.5 Al, 2.5 Cu. Number 16,\ndiameter 1.3mm , has a resistance of 1.02Ω per meter. Contrast this with copper wire of the\n0.013Ω m\nsame gauge with a resistance of\nor with much thinner #30 with 0.34Ω m . In our\nexperiments currents rarely exceed 1A and are usually much less, so voltage drops are\nunimportant. By putting the resistance wire in series in a circuit you can measure currents\nbeyond the range of your multimeter simply by measuring the voltage drop across a measured\nlength, and hence known resistance, of the wire.\n\nWires Found in Various Kits:\nLengths of bare and insulated red & black #20 or #22 solid tinned copper wire--Wire up\ncircuits on perfboard (LVPS, HVPS, AMP) with this wire. Wherever there is no danger of shorts\nuse bare wire; otherwise, red wire for positive leads, black wire for ground, common or negative\nleads.\n#30 bare copper wire--This is used in Experiment EF (Electrostatic Force) to connect to the\nsteel washer capacitor plates. Negligible current flows, and the flexibility of this thin wire\nminimizes mechanical disturbances.\n#26 enamel coated copper wire--The insulating enamel, usually a dark brown, is a kind of\nplastic (urethane?). Use it to wind the coils used in Experiment MF (Magnetic Force). Except\nThe enamel insulation must be removed to make electrical connection by soldering. Remove the\nenamel by careful sanding with the emery cloth or scraping with a knife or scissor blade; be\ncareful not to weaken the wire by nicking it. There are solvents for enamel, nasty chemicals, and\nsome people burn the enamel off with match, kind of a mess, also anneals and therefore weakens\nthe wire.\n#14, 2-conductor with ground, house wire, called \"NM\", non-metallic sheathed--By\nconvention in house wiring, the black insulated wire is \"hot\", the white wire is the return near\nground potential, and the bare wire is connected to ground, a buried metal water pipe for\ninstance. This is to ground tools or appliances for safety so that internal electrical shorts or\nleakage to the metal case will not electrocute an operator who touches a grounded conductor,\nincluding moist earth. This wire, with the insulation pulled off, is used for transmitting and\nreceiving dipole antennas in Experiment MW (Microwaves).\n\n#22 speaker wire--This has two stranded #22 wires in a single clear plastic insulating sheath\nthat can be split at the ends so that the wires can be individually stripped. It's a handy way to\nconnect the transmitting antenna in Experiment MW (Microwaves) to the HVPS\nSingle-conductor or double-conductor shielded wire--The shield is a tubular envelope of\nbraided wire around the insulated inner conductor. With the shield grounded, charge and current\nthat would be induced on the inner conductor by external electric fields are greatly reduced. It's\nused to connect the receiving dipole antenna in Experiment MW (Microwaves) to the AMP\n(Amplifier). It shields out lower frequency disturbances which the spark generating microwaves\nin Experiment MW makes."
    },
    {
      "category": "Resource",
      "title": "building_amp.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-02x-physics-ii-electricity-magnetism-with-an-experimental-focus-spring-2005/f1c75a414a362987e9c67a4b37b0327a_building_amp.pdf",
      "content": "Building the AMP--Amplifier\nIntroduction\nFor about 80 years it has been possible to amplify voltage differences and to increase the\nassociated power, first with vacuum tubes using electrons from a hot filament; and, since about\n1960, with solid state devices--transistors (like the 2N3055) and integrated circuits (like the\nLM317 and the LF411). Amplify means to make larger, and the ratio of the output voltage to the\ninput voltage is called the \"gain\".\nThe voltages to be amplified are sometimes induced in antennas by fields from distant\nradio transmitters, or are the output of some 'transducer' that turns a physical phenomenon into a\nvoltage; for example, a microphone turns a varying sound pressure into a varying voltage.\nOperational amplifier integrated circuits are widely used nowadays. They have two inputs\nand one output. One input is called inverting--a plus voltage is turned into minus output; the\nother input is non-inverting--a plus voltage stays plus. Thus a voltage difference between the\ntwo inputs is obtained if the two input voltages are not equal. If the same voltage is applied to\nboth inputs there is no output (ideally). This voltage difference between the two inputs is\namplified by a large factor A, (open-loop gain). By using a negative feedback circuit, a much\nlower but stable ratio of output to input voltage, G = V\nVin , can be obtained (closed-loop gain).\nout\nThis also ensures a reduction of noise and gain variations.\nYou will construct a non-inverting dc amplifier with the integrated circuit op-amp,\nLF411. It has an amplification A of more than 105, which means that it can amplify voltages so\nthat tens of microvolt differences between the two inputs can become volts at the output. We will\nuse the LF411 op-amp in a negative-feedback circuit to give a gain, G, of about 90.\nYou will build your amplifier on the other half of the same circuit board that you used for\nthe LVPS (low voltage power supply). The schematic circuit diagram for the amplifier is shown\nin Figure 1.\n\nFigure 1: Amplifier Circuit Diagram\nVoltage divider for the LVPS\nThe LF411 requires two equal plus and minus power supply outputs. We can make this\nfrom the LVPS by using the voltage divider shown in Figure 2 with the LVPS set at 12V .\nFigure 2: Voltage divider for LVPS\nIf the central connection between the two resistors is defined to be the zero-volt level, then we\nhave two power supply outputs; one at +6V and one at -6V with respect to this common zero\nof voltage, called \"common\".\n\nLF411 op-amp\nThe op-amp has eight pins: pins 1-4 on one side and pins 5-8 on the other side. Pin 1 is\nconventionally marked by a dot on the op-amp.\nFigure 3: Op-amp\nThe various pin connections are as follows:\n1) Pin 7 connects to the +6V voltage output of the LVPS. Pin 4 connects to the -6V\nvoltage output of the LVPS.\n2) Pin 6 is the output voltage with respect to common.\n3) Pin 2 is the inverting input, so a voltage +V2 with respect to common becomes -AV2 at\nthe output, where A ≈ 10\n5 is the open-loop amplification. Similarly, a voltage -V2 with\nrespect to common becomes +AV2 at the output.\n4) Pin 3 is the non-inverting input, so a voltage +Vin with respect to common becomes\n+AVin at the output. Similarly, a voltage -Vin with respect to common becomes -AVin at\nthe output. So the two different input voltages input (pins 2 and 3) give an output voltage\n+A(Vin -V2 ) . The op-amp amplifies the difference of voltage between its two inputs. If\nthe two input voltages are the same voltage with respect to common, then there is no\noutput voltage.\n5) Most op-amps have some dc offset in the output. This can be eliminated by adjusting the\npotential difference between pin 1 and pin 5 with the 100 kΩ pot.\n6) Pin 8 has no connection.\nThe input voltages to the amplifier go to the non-inverting input (pin 3) through a 9.1kΩ\nresistor followed by a 0.047μF bypass capacitor between common and input (pin 3), to keep\nvoltage spikes and surges out of the op-amp.\n\nNegative Feedback\nThe negative feedback circuit is shown in Figure 4. Study this schematic diagram\ncarefully. Notice that the feedback voltage divider consisting of a resistor R1 = 9.1kΩ from the\noutput (pin 6) to the inverting input of the op-amp (pin 2) and a resistor R2 = 100Ω connected\nfrom the inverting input (pin 2) to the common. These resistors determine the gain of the circuit\nG = Vout Vin , which is the ratio of the output voltage at pin 6 to the input voltage at pin 3.\nFigure 4: The negative feedback circuit\n\nThe resistors R1 and R2 form a voltage divider so the voltage at pin 2 is\nV2 =\nR2\nVout ≡βVout\nR1 + R2\nwhere\n100Ω\nβ =\nR2\n=\n=\n.\nR1 + R2\n9.1kΩ+ 100Ω\nThe LF411 op-amp inverts V2 and then adds the inverted voltage to Vin . (This is\nessentially a voltage subtractor.) The difference between these input voltages is then amplified\nby a factor A ≈ 10\n5 to give the output voltage\nVout = A(Vin -V2 ) = A(Vin -βVout ) .\nWe can solve this equation for the gain G which is the ratio of the output voltage to the input\nvoltage at pin 3\nVout\nA\nA\nG =\n=\n≅\n=\n= 92\nVin\n1+ βA\nβA\nβ\n.\nNotice that 1 + βA ≅βA >> 1 sinceβA ≈ (10\n-2)(10\n5) = 10\n3. The negative feedback circuit reduces\nthe gain to 92. But the important point is that this gain is nearly independent of A, the\namplification. The amplification may vary due to factors like temperature changes, dependence\n\non voltage inputs, or noise, but the gain, determined by stable components (resistors), is stable. It\ncan be changed by choosing different resistors.\nWiring the Amplifier\nThe best way to wire the amplifier is shown in the circuit diagram, (Figure 1), and the\ndiagrams (Figures 5-8) showing the layout of the parts on the board. If you are not sure about the\nvalue of a resistor, measure it with your MMM!\nYou should start with the socket with eight legs. This will help get the wiring for the op-\namp correct. The LF411 op-amp itself is a sensitive component, and can be damaged by static\nelectricity. It should be the last item to be installed.\nFigures 5-8 are guides to how the amplifier can be wired. Notice that the leads of the\nsocket can be bent in directions that enable them to be connected to various components. Think\nwhere these should go and install them in the right place with wires heading toward where they\nwill be connected.\nFigure 5a: Parts Layout, Topview\n\nFigure 5b: Schematic Parts Layout, Topview\nNote: In figure 5a and 5b, there is two bare wires on the topside of the board. The first connects\nthe -6V line from the LVPS to one leg of the 5kΩ pot of the amplifier. The second connects\npin 6 to the output B.\nFigure 6: Wiring Plan, Bottom View\n\nFigure 7: Schematic Parts Layout, Bottom View\nFigure 8: Wiring Plan, Bottom View\n\nInstalling the Op-Amp\nWhen you have finished the wiring and checked everything; the circuit, the solder joints,\nno shorts, you can install the op-amp in its socket. Take precautions against static charges. Hold\nit so your fingers touch its pins and touch part of the wiring on your board with your other hand\nto bring it to the same potential. Then push the op-amp into place, being sure to match the\nnotched end of the socket and that of the LF411 op-amp. (If you need to remove the op-amp for\nrewiring, remember to go through this procedure for both the removal and the reinstallation.)\nPreparing and Adjusting the Amplifier\n1. Setting the LVPS:\nThe LVPS should be set to give an output of 12V . Once you have made that adjustment, the\nvoltage divider made from the two 100Ω resistors will supply you with +6V and -6V for the\nop-amp, and a zero common.\n2. Zeroing the Amplifier:\nMost op-amps have some dc offset in the output. Adjusting the potential difference between pin\n1 and pin 5 with the 100 kΩ pot can eliminate this.\nSet the MMM to the 5V range. Connect the negative side of your MMM to the ground of the\namplifier (common, labeled 'C' in Figures 4-7). Connect the positive side of your MMM to the\noutput, labeled 'B' in Figures 4-7. The input of the amplifier is labeled 'A' in Figures 4-7.\nDisconnect the ac input to the LVPS.\nPlug in the LF411 op-amp and turn on the LVPS. There may be a deflection of the\nMMM needle, plus or minus. Short the input of the amplifier by using one of your clip leads to\nconnect the lead labeled 'A' in the figures to common C. With the input of the amplifier still\nshorted, set your MMM to the 250 mV range. Using a screwdriver on the amplifier's 100 kΩ pot,\nadjust the MMM to read zero and leave the pot at this position. This is called nulling or zeroing\nthe amplifier; that is, adjusting the circuit to give a zero reading when there is no input. Once\nyou have finished this step; disconnect the clip lead that shorted the input A to the common C.\n3. Calibrating the Amplifier\nNormally the input of the amplifier will be a signal from a microphone, etc. In\nExperiment MW (Microwaves), the signal will come from a coil or antenna. Now calibrate the\namplifier by measuring input voltages and output voltages.\nDetermine the gain of the amplifier. Use as an input signal a dc voltage obtained from a 5 kΩ pot\nacross the 12 V LVPS output, followed by a voltage divider made up of 91kΩ and 1.3kΩ\nresistors. The calibration circuit is shown in Figure 8.\n\nFigure 8: Calibration Circuit\nConnect your second MMM, set on 250mV DC, across the1.3kΩ resistor, that is, from\nthe lead labeled 'D' in the Figure 8 to common C.\nConnect lead D to the input A (use your clip lead), and vary the input by turning the 5kΩ\npot in both directions so as to make 10 mV steps. Turning the 5kΩ pot in one direction will\nmake the input voltage minus so you will need to reverse the leads of the MMM in order to read\nthe voltage. You will measure the output voltage with your first MMM set on 5DCV (as you did\nwhen you were adjusting the offset voltage). Again you may need to reverse the polarity of the\nMMM as needed. You will only be able to reach a maximum input voltage of 67 mV in either\ndirection. Tabulate your measurements of input and output voltages.\nAMP Parts\nop amp, LF411\nsocket, IC 8 pin dual inline\npotentiometer, 100 kΩ\n\npotentiometer, 5kΩ\n\ncapacitor, 0.05μF\n1 ft\nwire, #22 red insulated solid\n1 ft\nwire, #22 bare solid\nΩ 1 2W\nresistors, 9.1kΩ 1 2W\nresistor, 91kΩ 1 2W\nresistor, 1.3 kΩ 1 2W\nresistor, 150 kΩ 1 2W\nresistors, 100\n\nAMP PARTS\n\nBuilding the AMP (Amplifier)\nReport:\nAfter you have made and tabulated your measurements of input and output voltages for the\namplifier, plot the output voltage as a function of input voltage. Determine the gain of the\namplifier in the region where the response is linear and compare your value with the theoretical\nexpectation. Does the gain remain constant over the whole range of input voltages?\nProblem 1: Amplification\nA negative feedback circuit in an amplifier circuit is shown in the figure below. In this circuit,\nthe resistors have the values R1 = 9.1kΩ , R2 = 100Ω, and the open loop amplification is A ≈10\n5.\nPin 3 is non-inverting and pin 2 is inverting.\na) What is the output voltage V\nof the op-amp in terms of the input voltage Vin to pin 3, and\nout\nthe voltage at pin 2, V2, and the amplification A? (Note: all voltages are with respect to\ncommon).\nb) Derive an expression for the voltage at pin 2, in terms of R1 and R2.\nc) Derive an expression for the closed loop gain G = V\nVin in terms of R1, R2, and A.\nout\nd) Calculate the value of the gain G, clearly indicating any approximations you have made.\n\nProblem 2: Calibration\nThe calibration circuit for the amplifier is shown in the figure below. When the multimeter is set\non the 250 mV scale the multimeter has a resistance of 5kΩ .\na) When the 5kΩ pot is turned 2/3 of the way in the direction of the +6V line from the -6V\nend, what is the voltage difference between common C and the 5 kΩ pot slider?\nb) When the 5 kΩ pot is set as in part a), calculate the voltage difference between the common C\nand point D which is connected via a clip lead to the input A?\nc) What ouput voltage did you read when your pot was set as in part a) while you were\ncalibrating your amplifier?"
    },
    {
      "category": "Resource",
      "title": "building_hvps.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-02x-physics-ii-electricity-magnetism-with-an-experimental-focus-spring-2005/1af9c151e4df6f7255df824ac3c7f3ec_building_hvps.pdf",
      "content": "Building the HVPS--High Voltage Power Supply\nIntroduction\nVoltages higher than the LVPS provides--kilovolts--are needed in later experiments to\nget strong electric fields and to generate microwaves. The high-voltage power supply makes such\nexperiments possible. You will have voltages from 100V to 1000V available to you, at a safe\ncurrent of less than a milliampere.\nThe HVPS is built on the empty space of the LVPS board and is powered by it. Some\nexperiments in this course will need both the HVPS and another device, an amplifier, which will\nbe built on the board of a second LVPS. You and your partner will have the necessary pair of\nLVPS's between you; if you are working alone, you will eventually need two LVPS's.\nBackground\nTo get adjustable high voltage, we will convert the adjustable dc from the LVPS into\nadjustable ac at a frequency of about , by means of an LC oscillator. Then, a step-up transformer\nwill be used to get high voltage ac, which can be turned into dc with a half-wave voltage-doubler\nrectifier. Here is the block diagram:\nFigure 1: HVPS block diagram\nFigure 2: HVPS circuit diagram\n\nThe oscillator is powered by the 2N3055 transistor. The main feature of a transistor is that a\nsmall current from base to emitter results in a large current from collector to emitter (larger by a\nfactor of order 100).\nThen the emitter current flows through an six turn primary winding on a transformer\nmade by using the windings of a 5 millihenry inductor as the secondary, as shown below. The\ntransformer is a device that converts an ac voltage across the primary coil winding into a\ndifferent ac voltage across the secondary coil winding. This is accomplished by using two\nclosely spaced coils of different number of turns, one is called the primary, and the other, the\nsecondary. The primary coil has a number of turns denoted by NP , and the secondary coil has\nN number of turns. Then the voltage across the primary, VP , is related to the voltage across the\ns\nsecondary, VS , according to\nVS\nVP =\n.\nNP\nN S\nThe secondary has about 300 turns, so the secondary voltage is about 50 times the\nprimary voltage.\nFigure 3: LC oscillator\nThe secondary winding of the transformer is part of a parallel LC circuit with a resonant\nfrequency\nf = 1\n2π\nLC\nThe inductance is 5mH and the equivalent capacitance is 91 pF , so the resonant frequency is\nf = 1\n2π\nLC\n= 1\n2π\n(5× 10\n-3 H )(9.1×10\n-11 F )\n= 2.4× 10\n5 Hz .\n\nFigure 4: capacitor voltage divider\nThe two capacitors shown above make a voltage divider, such that 1/11 of the total\nvoltage across the coil appears across the 1000 pF (.001 microfarad) capacitor. This voltage is\nfed back to the base of the 2N3055. If the transformer windings are properly connected, an\nincreasing current through the transistor will produce an emf in the secondary of the resonant\ncircuit which, when part of it is fed back to the base of the transistor, has the correct polarity to\ncause yet more current to flow in the 2N3055. This is positive feedback, rather than the negative\nfeedback utilized in the LVPS regulator.\nThe positive feedback tries to make the transistor current go to infinity, which, of course,\nis not possible. The voltage across the primary coil does increase to almost the positive power\nsupply voltage, at which point it must stop increasing, and the voltage induced in the transformer\nsecondary goes through zero and changes sign. Then the positive feedback makes the current\nthrough the transistor plunge in the opposite direction to zero. Thus, an alternating voltage\nalmost equal to the LVPS voltage is produced at the primary, at the resonant frequency of the LC\ncircuit of which the transformer is a part. This ac is stepped up to 1000V or more, peak-to-peak\n(maximum to minimum), by the transformer action.\nThe high voltage ac is rectified so as to produce an output dc voltage approximately\nequal to its peak-to-peak voltage, by using two high voltage diodes in a voltage doubler circuit:\nFigure 5: voltage doubler\n\nHere is how is how the voltage doubler works: if the sine wave voltage across the\nresonant circuit has a peak-to-peak value 2V0, then an alternating voltage of amplitude V0\nappears across the circuit composed of C1 and D1. Thus C1 and D1 act as a half-wave rectifier,\nwhich charges C1 to V0. As a result the sine wave voltage at point A causes the voltage at A to\noscillate from 0 to 2V0. The second diode, acting as a half-wave rectifier, will then charge to a\nvoltage approximately equal to 2V0. Hence the name 'doubler'.\nFollowing the voltage doubler, there is a filter capacitor, C2, and then each output lead is\nin series with a one megohm resistor. These are to isolate the supply from the long leads you\nmay connect to it, and to reduce the intensity of the shock you can get by putting yourself across\nthe output. The supply is safe, because the stored charge in the small filter capacitance is too\nsmall to be dangerous, and the steady output the supply can deliver is also too small to hurt you.\nHowever, if you touch it lightly you can feel the burn of the resulting spark.\nHVPS Parts\n-\nLVPS, already built\n-\nresistor, 8.2 kΩ 1 2W\n-\n2N3055T transistor, TO-220 type\n-\nTO-220 white transistor socket\n-\nclip on heat sink\n-\n2 - 1N5062 diodes, (max 800V peak inverse voltage, 750 mA max forward current)\n-\nferrite core inductor (5mH ), 3 segment\n-\n1 ft - #26 insulated solid wire\n-\n1 ft - #22 bare solid wire\n-\n1 ft - #22 red insulated solid wire\n-\n2 - 1 MΩ resistors, 1 2W\nceramic disc capacitors:\n-\n100 pF , 1kV , [1 pF = 1 picofarad = 10\n-12 F .]\n-\n1000 pF , 500V\n-\n2 - 470 pF , 1kV\n\nRecognizing the Parts\nFigure 6: Top view of HVPS\nTransistor: The transistor package looks like the regulator of the LVPS, and since it also\nproduces heat that must be led away, you should mount a heat sink on it. The transistor is an\namplifier of current, and in conjunction with the transformer produces ac at a frequency of about\n240 kHz .\nFigure 7: 2N3055T Transistor\nInductor: Your inductor consists of three connected coils wound on a ferrite core (a magnetic\nsintered powder); the coils are about 45 feet in length, something under 500 turns of thin\ninsulated wire. You will change the inductor into a \"step-up\" transformer converting low\nalternating voltage at relatively high current to high voltage at low current. (Your wall\ntransformer, converting 120V ac to 12V ac, is a \"step-down\" transformer.)\nFigure 8: Inductor\n\nCapacitors: The differences in shape and rating between these capacitors and the ones in the\nLVPS strongly suggest that they are made of different materials. That is true: also, this type of\ncapacitor is not polarized as to current direction: it doesn't matter which way around you place\nit. The physical size of capacitors is determined by their voltage rating capacitance and the\nmaterials used in their construction.\nFigure 9: Ceramic Disk Capacitors\nTo tell which capacitor is which use the decoding system for disc capacitors. Numbers\non the discs that don't end with a zero in the units place, for example numbers like 102, have a\ncode meaning: the \"2\" means \"put 2 zeros here\". So, 102 = 1000, 101 = 100, and 471 = 470. In\naddition, numbers that are not decimal fractions should be read as picofarads (10-12 F), whereas\ndecimal fractions, like .001 in the figure, mean microfarads (10-6 F). Thus .001 = .001 x 10-6\nfarads or 1000 picofarads. The capital letters following these numbers indicate tolerances.\nSome of the other coding tells the factory name, the country of origin or the manufacturer.\nDiodes: The diodes pass current from the + anode, to the - cathode, the black end in the case of\nthe 1N5062. (Placing the diode in the wrong direction can happen; so note carefully the black\nend).\nFigure 10: 1N5062 Diode\n\nConstruction Notes\nMaking the Transformer\nTo make the inductor into a transformer, you will need to wind six turns of the insulated\nFirst cut the wire to\n10 - 1 2\n#26 solid wire onto the core of the inductor to act as the primary coil.\ninches and strip off the insulation from the two ends to expose the bare wire.\nNotice that the windings already on the inductor are in three parts; wind three of your\nturns in each of the two gaps between. Wind in the same direction as the winding already there.\nHere's how; find the starting end of the inductor winding (see Figure 11), where the wire enters\nthe coil at the inner core. Hold the inductor by that end and wind in a counterclockwise\ndirection, three turns in the first gap and three in the second.\nThe wire already on the inductor is thin, fragile and exposed. Breaking these wires is a\ncommon source of trouble with HVPS construction. Don't wrap your turns so tightly as\nto break the wires already there.\nFigure 11: Winding the Transformer\nYou have now made a transformer. Check for electrical continuity in both coils to make\nsure no wire got broken. If it is unbroken, you will see about 10-50 ohms (depending on the\nmake of the inductor) across the inductor's coil. The 6-turns you added, which become the\n\"primary\" of the transformer, have a small resistance (too small to measure). There should be no\nelectrical connection between the two coils. You should certainly check for this if you run into\nany troubles.\nPerfboard Diagram for the Top of the HVPS\nThe figure below shows the placement of HVPS parts on the top of the perfboard. Start\nwith one of the boards on which you have already built a low-voltage power supply (LVPS).\nFollow the parts layout shown in the pictures and in the templates shown below.\n\nFigure 12: Parts lay out for the HVPS\nFigure 13: Diode and inductor wiring\nA common mistake is to wire the diodes the wrong way. In Figure 13 the wiring for the\ndiodes is shown. Notice that one end of the diode is dark. Make sure that these ends point in the\ncorrect direction.\nAnother common mistake is to wrap the primary in the wrong direction with respect to\nthe secondary wrappings of the ferrite core inductor. If the HVPS does not work correctly, you\nmay want to rewrap the primary wire. You will need to unsolder the primary. Another way to\ncorrect this problem is to unsolder the wires that emerge from either end of the ferrite core\ninductor. Then flip the inductor and re-solder the ends so that it will now connect the other way.\nFor this reason the ends of the secondary are soldered above the board. Once you are sure you\nhave the wires the correct way you may want to solder the ends from the inductor underneath the\nboard for more stability.\n\nOne leg of the 1000 pF capacitor first passes underneath the board then returns to the top\nside of the board where it soldered to the wire emerging from the end of the inductor. The other\nend of the inductor is soldered to the 470 pF capacitor.\nPerfboard Diagram for the Bottom of the HVPS\nThe diagram below shows the wiring of HVPS parts on the bottom of the perfboard. The\nsolid lines point to where the indicated components are soldered or go through the board. The\npositive and negative LVPS lines are marked.\nFigure 14: Bottom View\nWhen you assemble your HVPS make sure that connections are convenient and that\nshorts are not likely to occur. Be sure to get the diodes the right way around, and remember to\nconnect to the outputs of the LVPS. The HVPS ends up with two 1-megohm resistors to limit\nthe current to completely safe values, less than 1 mA (milliampere).\nTesting the HVPS\nHere are some procedures to follow for your circuit tests.\nSet your multimeter to the l K range and connect to the output leads. (You must use the\nappropriate input to the meter, labeled +DC1000 V.)\n\nFigure 15: Test lead inputs to multimeter for 1 K range\nInsert the 2N3055T transistor into the clip on heat sink. Insert the transistor into the\ntransistor socket. The writing on the transistor should face the opposite direction from the\ninductor. Insert your LM317 regulator into the LVPS and also make sure it is facing the correct\ndirection (towards the rectifier). Plug in the wall transformer. You should be able to adjust the\nHVPS output voltage to anywhere from 100V to over 1000V by turning the pot of the LVPS.\nYou can expect several components to get hot after a while. The transistor will probably be the\nmost noticeable one.\nBecause of the low power involved (about 1 watt), it is safe in this case to short the\noutput with a clip lead. You'll probably see small sparks when you do so. You can also put\nyour fingers across the output (not usually a good practice!) because the current is limited to less\nthan 1mA . If you do, you may feel a slight tingling sensation if you grasp firmly, or the burn of\nthe spark if you hold it loosely.\nTroubles?\nIf you get no output voltage:\n1) Did you plug in your transistors?\n2) Do you have a low-voltage input? Connect the multimeter on the 25V range to the LVPS\noutput terminals; set the LVPS for 10V or so.\n3) Feel the 3055 transistor. It should warm up after a minute. (A film of water placed on it\nwould evaporate in a few seconds -- but wouldn't sizzle!)\na)\nIf the transistor's not hot, measure the voltage between each of its terminals and the\nminus terminal of the LVPS. The base could read 0.5V positive and the emitter will\nread zero if the circuit is not oscillating; if it is oscillating you may get hard-to-\ninterpret readings even with only one meter lead connected. The collector reading\nshould match the output of the LVPS. Other readings might suggest wrong wiring\nor a bad transistor.\n\nb)\nIf the 3055 is hot but the circuit is not oscillating, reverse the primary leads of the\ntransformer you wound. This makes the feedback positive as needed for oscillation.\n4) If you still see no high-voltage output, check the capacitative dividers for correct\nplacement. (The 100 pF capacitor may be physically larger than the 1000 pF .)\nCould\nthey be defective? Check the capacitors themselves: on the ohmmeter they should show\ninfinite resistance.\n5) If the capacitors are OK, see if there is 240 kHz on the secondary of the transformer.\nApply maximum voltage from the LVPS to the HVPS and touch the \"hot\" top-side of the\ntransformer secondary with a regular wooden or plastic \"lead\" pencil. You should see a\nsmall spark. If not, reverse the transformer leads one more time and try again.\nDisconnect the first 470 pF capacitor. Now look again for 240 kHz . If you don't see it,\nreverse the transformer leads one last time! If you still get no ac reading, the problem is\ntoo subtle for these techniques. (See an expert in the lab help sessions.)\n6) If you do have ac, check the 470 pF for shorts. Also use the ohmmeter to check the\ndiodes.\nWe tested several diodes and got these readings on the various ohmmeter ranges with the\nred lead (+) connected to the cathode: Rx1: 20Ω , Rx10: 180Ω, Rx1k: 9 kΩ. With the\nmeter leads reversed we got inf on all ranges.\nNow it has to work, unless it is a really tricky problem. Rebuilding with greater care to\nfollow the drawing of the perfboard often clears matters up. Sometimes the only recourse is a\npersevering expert.\nTry this\nBring a transistor radio close to your HVPS. Turn the radio on and place it inches from\nthe coil. On almost any AM dial setting the radio will reproduce a strong buzz that will\ndisappear if you unplug the power supply, or even turn the pot down. If you make a spark at the\noutput, you should hear it broadcast sharply.\n\nTesting the HVPS\nMeasurements:\nWe will measure the voltage output of the HVPS with no-load and with the 1 MΩ\nresistors as loads. Adjust the pot on your LVPS so that the output voltage of the LVPS is\nbetween 1.5V and 12V . Use one of your multimeters to monitor the output voltage of the LVPS\nthroughout the following measurements. Set the other multimeter to the l K range and connect\nthe leads not at the output of the HVPS but just before the 1 MΩ resistors. (Use the appropriate\ninput to the meter, labeled +DC1000 V.)\n1) Determine the range of output voltages for the HVPS.\nNow make five measurements of your HVPS between 100V to 1000V with three loads,\nMMM only, the MMM and the two 1 MΩ resistors, and the MMM and one 1MΩ resistor . For\neach setting of the pot:\n2) For each setting of the pot, measure the output voltage of the HVPS with your MMM\n(note that the MMM is the only load).\n3) Use a clip lead to connect the ends of the two 1 MΩ resistors together so as to put them\nin series across the output of the HVPS. For each setting of the pot, measure the new\noutput load voltage of the HVPS.\n4) Use a clip lead to put only one of the 1 MΩ resistors as a load across the output of the\nHVPS. For each setting of the pot, measure the new output voltage of the HVPS.\nRecord your results in the accompanying data table.\n\nData Table for HVPS Problem\nVLVPS\nVHVPS (no\nload) [V]\nVHVPS ( 2 MΩ\nload) [V]\nVHVPS (1 MΩ\nload) [V]\nCurrent HVPS\n( 2 MΩ load)\n[I]\nCurrent HVPS\n(1 MΩ load)\n[I]\n5) The multi-meter, on the 1K scale, acts like a resistor with resistance of 20,000Ω/ V DC .\nThis means that to find the resistance you multiple 20,000Ω/ V DC by the full scale\nvoltage reading which is 1000V . What is the resistance RMMM of your multi-meter on the\n1K scale?\n6) Draw circuit diagrams of your HVPS, the multi-meter and the loads. Is your multi-meter\nin parallel or in series with the load?\n7) Is the multi-meter is in parallel or in series with the load equivalent resistance Req ? What\nis the equivalent resistance for loads of 2 MΩ and 1 MΩ loads?\n8) Calculate the current output of your HVPS is given by\nVoutput\nI =\n.\nReq\n9) Calculate the current output of your HVPS for each setting of the LVPS pot for both the\n2 MΩ load and 1 MΩ load. Record your results in the last two columns of the data table."
    },
    {
      "category": "Resource",
      "title": "building_lvps.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-02x-physics-ii-electricity-magnetism-with-an-experimental-focus-spring-2005/f07f329e0ed82e1413631ba4091f4bf7_building_lvps.pdf",
      "content": "Building the LVPS--Low Voltage Power Supply\nIntroduction\nLow voltage is one of those relative terms--up to 25 volts [ V ] dc is low, and most\npeople would call 1000V high. Power supplies provide energy from many different kinds of\nsources and at widely varying rates: gigawatts (10\n9 W ) from nuclear plants to microwatts\n(10\n-6W ) from watch batteries. Sources of energy for power supplies include nuclear fission,\nburning of coal, oil, gas or wood, chemicals reacting, and sunlight, wind and tides. Power is\ndelivered in electrical form as alternating or direct current (ac or dc) and in many combinations\nof current and voltage. Electrical power supplies in a narrow sense are really converters from\none voltage/current combination to another--with, one hopes, only small power losses.\nProject LVPS\nIn this project, you'll build a power supply that takes power at 120V , 60 hertz [ Hz ] ac\nfrom a wall outlet and converts it to dc. The power supply is adjustable between 2V to 12V and\ncan supply currents up to 1 ampere ( A).\nFigure 1: Block diagram of LVPS\nBackground\nThe circuit diagram for the LVPS looks like\nFigure 2: Circuit diagram for LVPS\n\nWall Transformer\nThe LVPS starts with your wall transformer, which reduces the 120V ac from the line to\na safe and convenient nomuinal 12V ac sine wave voltage with only moderate loss of power\n(heating the transformer). A sine wave voltage varies in time and can be described\nmathematically by the function\nV t( )= V0\n2π t T + φ\nsin (\n)=V0 sin (2π f t + φ)\nwhere V0 is called the amplitude (maximum value). The voltage varies between V0 =17V and\n-V0 = -17V since a sine function varies between +1 and -1.\nFigure 3: Wall transformer\nV\nV\n′ = t + T where T is the period.\n=1 T . The units of frequency are inverse seconds [sec-1] which are called hertz\n\nThe 12\nac refers to the root mean square (rms) amplitude defined by\nsine function is periodic in time.\nexactly the same at a later time t\nrms = V0\n2 . The\nThis means that the value of the voltage at time t will be\nThe frequency f is defined to\nbe f\n[ Hz ]. A\ngraph of the sine wave voltage vs. time looks like\nFigure 4: Wall transformer output voltage\n\nBridge Rectifier\nNext comes a full-wave bridge rectifier consisting of four half-wave rectifiers that act as\ndiodes. A half-wave rectifier allows current to flow through it in only one direction, as shown by\nthe arrow in the symbol for it.\nFigure 5: Half-wave rectifier\nIf an alternating sine-wave voltage is applied to a rectifier, it transmits only the positive half-\nwaves as shown in the sketch below.\nFigure 6: Rectifier sine wave after passing through half-wave rectifier\nFour half-wave rectifiers connected as shown in Figure 7 form a bridge rectifier.\nFigure 7: Bridge rectifier\nIn the next two sketches below, the four half-wave rectifiers act as switches that connect the\nupper or lower lead on the left, when either is positive, to the right-hand output lead, and to the\nleft-hand output lead when either is negative (convince yourself of this).\n\nFigure 8: Bridge rectifier in action\nIn this way the wiggly ac is made to flow in only one direction--i.e., it is straightened out or\nrectified. This is shown in the next sketch.\nFigure 9: Voltage output from the bridge rectifier\nCapacitors\nCapacitors are circuit elements that store electric charge Q according to\nQ = CV\nwhere V is the voltage across the capacitor and C is the constant of proportionality called the\n[ ] 1V\ncapacitance. The unit of capacitance is the farad [ F ] and is defined by [1F ]= 1C [ ].\nCapacitors come in many shapes and sizes but the basic idea is two conductors separated\nby a spacing which may be filled with an insulating material (dielectric). One conductor has\ncharge +Q and the other conductor has charge -Q . The conductor with positive charge is at a\nhigher voltage V than the conductor with negative charge. Most capacitors are in the picofarad\n[ pF ] to millifarad range, 1000μF .\nCapacitors can do many things in both ac circuits and dc circuits.\n\n- Capacitors store energy\n- Capacitors when coupled with resistors can delay voltage changes\n- Capacitors can be used to filter unwanted frequency signals\n- Capacitors are needed to make resonant circuits\n- Capacitors and resistors can be combined to make frequency dependent and independent\nvoltage dividers\nWe denote capacitors in circuits by the symbol\nFigure 10: Capacitor symbol\nSmoothing Out the Rectifier Output\nA 1000μF capacitor then smoothes out the rectifier output.\nFigure 11: Smoothed out voltage due to 1000μF\nVoltage Regulator\nNext comes the LM317T three-terminal integrated circuit (IC), containing 26 transistors\nand various resistors and capacitors. It keeps the output voltage constant with respect to an\ninternal reference voltage, using feedback--i.e., it is a 'voltage regulator'. It also protects itself\nagainst overload (too much current) and is compensated for changes in temperature.\n\nFigure 12: Heat sink, LM317T voltage regulator, and socket\nPotentiometer\nA resistor network--one variable resistor (a 5000Ω potentiometer, or \" 5k pot\") and one\nfixed resistor ( 390Ω, 1 2W\nNotice that the pot, here used\n) serves to adjust the output voltage.\nas a variable resistance, has the slider and one end connected. This guarantees that some part of\nthe pot resistance will be in the circuit, even if there is an uncertain contact inside the pot.\nFigure 13: potentiometer and `pot' circuit diagram\nHigh Frequency Filter\n\nFinally, a 1μF capacitor across the output bypasses high-frequency disturbances from\neither direction--from the ac supply line or from the load.\nBuilding the Low Voltage Power Supply\nThe circuit diagram for the LVPS tells us how the various parts are connected but we will\nplace the parts on the perfboard in order to minimize the number of wires and solders. So in the\nfollowing instructions try to understand the layout in terms of the circuit diagram. This will help\nyou find any missed or incorrect connections.\nFigure 14: Circuit diagram for LVPS\n\nFigure 15: Top view of LVPS (transformer leads on right)\nThere are many ways to assemble the LVPS, but we will give you detailed step-by-step\ninstructions to guarantee success. It takes up less than half the space on the perfboard, leaving\nroom to build other things later. The top view of the LVPS will help in placing the parts.\nFigure 16 Top view of layout of LVPS (transformer leads on left)\n\nHere is a template (top view) to help place the parts on the perfboard.\nFigure 17 Template LVPS (top view)\nThe bottom view of the LVPS shows the wiring.\nFigure 18: Bottom view of LVPS\n\nFigure 19: Wiring on bottom side of LVPS\nConstruction Steps\n1. Find and identify parts in the plastic bag.\n2. Draw a line with a pen lengthwise along the center of the perfboard.\n3. Stick 4 feet on the corners of the bottom side as close to the edge as possible.\n4. Place the parts according to the top view of perfboard. Bend the white socket's short leads\ncarefully while installing. (The black regulator's three leads will fit into the socket. You will\nonly solder the socket's leads so that the regulator can be easily removed). Identify on your\nperfboard which socket leads will correspond to the ADJ, OUT, and IN leads of the regulator.\n5. Bend the leads of the rectifier, capacitors, and resistors as shown on the bottom view of\nperfboard.\n6. Measure, cut, and solder a piece of the bare #22 wire to the minus lead (-) of the rectifier.\nExtend this wire across the board, and then form a loop on the top side. This will be the minus\n(-) output loop.\n7. Loop the end of the minus lead (-) of the large capacitor (the band points to the minus lead)\nthrough the perfboard at the bare wire from step 6. (This will help hold the capacitor to the\nperfboard). Solder the minus lead (-) of the large capacitor to the bare wire from step 6.\n\n8. Solder the pot lead nearest the edge of the perfboard to the bare wire of step 6. Be sure the pot\nis oriented as shown in the top view.\n9. Solder the minus lead (-) of the small capacitor (the band points to the minus lead) the bare\nwire of step 6.\n10. Solder the plus lead (+) of the rectifier to the plus lead (+) of the large capacitor.\n11. Solder the plus lead (+) of the large capacitor to the IN lead of the socket. (See step 4).\n12. Measure, cut, and solder another piece of the bare #22 wire to the OUT lead of the socket.\nExtend this wire across the perfboard, and then form a loop on the top side. This will be the plus\n(+) output loop.\n13. Solder the plus lead (+) of the small capacitor to the bare wire of the previous step 12.\n14. Solder one lead of the resistor to the bare wire of step 12.\n15. Solder the other lead of the resistor to the two other leads of the pot, thus connecting those\ntwo leads of the pot together.\n16. Measure, cut, and solder another piece of the bare #22 wire to the ADJ lead of the socket to\neither of the connected pot leads of the previous step 15.\n17. Remove about 6 mm of the insulation from two different lengths, 50 mm and 100 mm (2in\nand 4 in ) of black stranded wire. Tin all four ends and solder one length to each of the ac leads of\nthe rectifier.\nTrying out Your LVPS\nDo not plug in the LM317T regulator. You should have already soldered alligator clips\nto your transformer leads, multimeter leads, and made clip leads. Clip one of the wall\ntransformer leads to one of the LVPS leads of step 17.\nSet the MMM to the 25DCV range. Connect the voltmeter across the 1000μF capacitor,\nred to the plus side and black to the minus side. Plug in the wall transformer. Now touch the\nsecond transformer lead to the other ac lead of the LVPS. There should be little or no spark and\nthe meter should read about 17V -18V . Transfer the voltmeter leads to the output loops. Place\nthe regulator in the heat sink with its metal back covered by the heat sink. Now plug in the\nregulator into the socket with the number LM317T facing the large capacitor. Turn the pot\nand the output should vary from about 1.2V to 15V or more.\nTo make sure that your LVPS is working as it should, use the 1157 lamp (used as a rear\nbrake light in a car) from the plastic bag labeled LVPST (LVPS Test Kit) as a load on the LVPS.\nThis lamp has two filaments (tail and stop light) with nominal ratings of 8 watts and 27 watts\nrespectively at an applied voltage of 12.6V .\n\nFigure 20: Lamp and socket\nOne lead to each filament is connected to the brass shell and the other lead is connected to one of\nthe two terminals (soldered bumps) on the base of the lamp.\nPlug the lamp into the socket provided in your Red Box. There are two black leads from\nthe socket. In order to connect one of the filaments to the LVPS, use your clip lead to connect\none of the black wires from the socket to one output of the LVPS. Use a second clip lead to\nconnect the other output of the LVPS to anywhere on the socket. (This connects the LVPS to the\nbrass shell of the lamp.) Identify the 8W filament (cold resistance about 2Ω), either with your\nMMM on the RX1 range or by lighting it with the LVPS---it's the upper filament in the lamp.\nParts List for LVPS\nLVPS\nperfboard\nrubber feet\nfull wave bridge rectifier\nelectrolytic capacitor, 1000μF\nsocket for LM317T regulator\npotentiometer, 5kΩ\nelectrolytic capacitor, 1μF\n\nresistor, 390Ω 1 2W\n1 ft\nwire, #22 bare solid\nvoltage regulator LM317T\nheat sink for LM317 regulator\nLVPST\nresistor, 2.4Ω 2W\nlamp #1157 automotive\nRED BOX\n1 socket for 1157 lamp\n\nTesting the LVPS\nEach of you has built a power supply that converts ac (alternating current) power at\n120V (volt), at a frequency of 60 Hz (hertz = cycles/sec) from the wall outlet into dc (direct\ncurrent) power with a voltage range from 1.2V to about 17V . When the output voltage without\nload (lamp) is set between 1.2V and about 12 V , the output voltage will not change appreciably\nif a load is then placed across it. You will find that range when you place the 8W (watt) filament\nof an 1157 lamp across the output of the LVPS. See Building the LVPS: Trying out your\nLVPS.\nMeasurements and Data\nYou can set your pot at ten different settings from lowest to highest output by turning the top of\nthe pot either clockwise or counterclockwise (depending on how you wired the legs). Set the pot\nso the no load output voltage is minimium, 2V , 4V , 6V , 8V , 10 V , 12 V , 14V , 16V , and\nmaximum. Use the accompanying table to record the results of your measurements. For each\nsetting you will:\n1. Measure the output voltage (no-load voltage) of the LVPS when the lamp is not\nconnected;\n2. Measure the output voltage (load voltage) of the LVPS when the lamp is connected\nacross the output of the LVPS.\n3. Then connect the lamp and measure the load voltage across the terminals of the LVPS.\nQuestions\n1. What range of no-load output voltages remains unchanged after the lamp is connected\nacross the LVPS output terminals?\n2. Briefly describe how you distinguished between the 8W filament and the 27W filament?\n3. What happens when you connect the outputs of the LVPS to the two black wires in the\nsocket? Can you figure out the wiring diagram for the lamp?\nGraph\nPlot the output voltage of the LVPS without the lamp connected along the horizontal axis\nand the output voltage of the LVPS with the lamp connected along the vertical axis.\n\nData Table for LVPS\nPot Setting VLVPS\n[volts]\n(no load)\nVLVPS\n[volts]\n(load)\nminimum\n\nmaximum"
    },
    {
      "category": "Resource",
      "title": "exer_mulitimeter.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-02x-physics-ii-electricity-magnetism-with-an-experimental-focus-spring-2005/906477ec6cf70d63f404c46e1bf9e38c_exer_mulitimeter.pdf",
      "content": "Exercise MM--About the Multimeter\nIntroduction\nOur world is filled with devices that contain electrical circuits in which various voltage\nsources cause currents to flow. Electrical currents generate heat, light, and magnetic fields, and\nproduce chemical effects. Any of these phenomena can be used to measure current. One of the\nsimplest ways is to let the current flow through a coil of wire that is in a magnetic field and to\nmeasure the resulting torque on the coil by observing the deflection of a torsion spring. This is\nhow your multimeter works, which we call a magnetic multimeter (MMM), in contrast to the\nstandard term `analog'. Look at the meter itself. You can see the copper colored coil and one of\nthe two spiral torsion springs (the other is at the back; they also lead current in and out of the\nmoving coil). The MMM is a current meter with a range selector switch, so that with appropriate\nresistors and other parts it can measure voltages and resistances.\nFigure 1: Coil and torsion spring\nA meter has a needle that moves clockwise in proportion to the current flowing through\nthe meter. The needle goes over various scales above a reflecting mirror intended to reduce\nparallax error--move your head so that you see the needle just above its reflection, and you'll be\nlooking straight down onto the scale and be able to read the right number.\nIn this exercise you will use your MMM to measure the resistance of a resistor, the\nvoltage difference between the terminals of a AA cell (battery), and the current that flows in a\nsimple circuit consisting of the battery and a resistor.\nThe MM Kit contains one AA cell and one battery holder with a red lead (plus,+) and a\nblack lead (minus,-). You may need to remove some of the insulation on the leads so that about\n1 2in , 12 mm , of bare wire is exposed. Do this with the wire strippers in your toolkit. The kit\n\nalso contains two 20Ω resistors. You will also need one of the clip leads that you have just\nmade.\nThere is a separate package in the top tray of the Red Box containing two AA cells, and\nfour 500 mA fuses. You should first open the back of the MMM and put in a 1.5V AA cell into\nthe holder at the top of the MMM. Make sure the battery is placed with the + terminal connecting\nto the red wire. While the multimeter is open, notice that there is a fuse. If your multimeter is not\nworking then there are two likely reasons. The first is that your test leads are broken or not\nmaking a good connection. The second reason is that the fuse may have blown. You have four\nspare fuses in your Red Box. The fuses may blow if you make a measurement with an\ninappropriate range selector setting, in particular the 250 DCA and Rx1 ranges.\nMeasuring Voltage, Resistance and Current with the Multimeter\nChecking the MMM zero:\nWith the MMM lying flat on a table or desk and with nothing connected look down so as\nto line up the needle and its image in the scale mirror. The needle should bisect the 4 black zeros.\nTap or swing the meter; the needle should still show zero. If not, your 5mm flat screw driver\nwill just about fit the adjusting screw in the lower center of the meter. Turn carefully until the\nneedle sits on zero.\nMeasure the resistance of the 20Ω resistor\nThere are 3 resistance ranges, RX1, RX10, and RX1K (1K=1000). The ohmmeter\noperation depends on the 1.5V AA cell that is inside the meter. Essentially, current flows\nthrough the meter in inverse proportion to the resistance in the circuit. This accounts for the\nmarkedly non-linear green scale at the top of the meter.\nIn order to zero the meter before measuring resistance, short the test leads by connecting\nthem together. Then adjust the OHMS ADJUST knob (located to the left of center of the MMM)\nso that the meter reads 0 ohms; the needle is then at its maximum deflection. When the test leads\nare not connected, (an open circuit), no current flows and the needle sits on the infinite resistance\nmark , inf , all the way on the left side of the scale.\nSet the range selector switch on the MMM to the RX1 range. Connect the test leads to the\nresistor. Measure the resistance. You may want to make other resistance measurements. For\nexample make a thick line with a lead pencil and measure the resistance of the mark. Grasp the\nclips firmly and see what your resistance is. Touch the clips to your tongue.\nMeasure the voltage of the AA cell\nSet the range selector switch on the MMM to the 5 DCV range. Place the AA cell in the\nbattery holder. Connect the test leads to the leads from the holder. Measure the voltage.\n\nMeasure the current in a simple circuit\nFirst set the range selector switch on the MMM to the 250m DCA range. Make a simple\ncircuit consisting of the 20Ω resistor, the AA cell, and the MMM. You can do this by\nconnecting the red lead of the MMM to the red lead (plus, +) of the AA cell holder. Use a clip\nlead to connect the black lead (minus, -) of the AA cell holder to one end of the 20 Ω resistor.\nConnect the black lead of the MMM to the other end of the 20Ω resistor. Measure the current in\nthe circuit. What effect do you think the MMM has on the circuit?\n\nAbout the Magnetic Multimeter\nIntroduction\nThe MMM will be one of your most important tools in this course. Please read the\nfollowing explanation of the MMM. You may not be completely familiar with all the\nterminology. As the course develops, you will learn all the physical principles necessary to\nunderstand the MMM. So please keep on referring to the reading below if you have any\nquestions about your MMM.\nYour analog multimeter (we call them MMM--magnetic multimeters) is a \"moving coil\nmeter\" with a needle whose deflection shows and measures the torque on a current loop placed in\na magnetic field. That torque is proportional to the current, and a device that measures current is\ncalled an ammeter.\nThe multimeter consists of a cylindrical magnet (magnetized across a diameter) arranged\ncoaxially with a cylindrical magnetic return path as shown in Figure 2.\nFigure 2: Multimeter Coil\nIn the gap is a pivoted rectangular coil; you can see the top of it if you look down into the\nmeter. Spiral springs, top and bottom, lead current in and out of the coil and also provide a\nrestoring torque. Jeweled bearings provide a low-friction mounting as in some watches.\nCurrent in the coil interacts with the radial magnetic field to generate tangential forces,\nand hence torques about the axis of rotation. These turn the coil until the magnetic torque is\nbalanced by the torque of the spiral springs. The meter has a pointer or needle, which moves\nclockwise in proportion to the current flowing through the meter. The needle goes over various\nscales above a reflecting mirror intended to reduce parallax error--move your head so that you\nsee the needle just above its reflection, and you'll be looking straight down onto the scale and be\nable to read the right number.\nAny instrument that measure current will disturb the circuit under observation. (The coil\nitself has resistance.) There will be some voltage drop due to the resistance of the flow of current\nthrough the ammeter. An ideal ammeter has zero resistance, but a 0.1-0.2V drop is tolerable in\nour applications.\n\nThe range of an ammeter can be extended to measure higher currents by placing a\nresistor (called a shunt resistor) of resistance, Rs , generally lower than the coil resistance,\nacross the meter coil. When connected in a circuit with flowing current I, the meter will read a\nfraction of that current say 0.1 I, with 0.9 I passing through the shunt. The meter scale can be\ncalibrated so that it reads 10 times its original range.\nTo convert an ammeter into a voltmeter, a resistor (called a multiplier resistor) of\nresistance, Rm , generally higher than the coil resistance, is put in series with the meter coil.\nSuppose a current I through the meter coil produces a full-scale (FS) reading, that is FS\ndeflection of the needle. The coil resistance is Rc , so the voltage across it, V = I Rc . Putting a\nmultiplier resistor R = 9R in series with the coil means that it will take 10 V to produce a FS\nm\nc\nreading, so we now have another range and can calibrate and label the scale accordingly.\nThe ideal voltmeter should draw no current, corresponding to the zero voltage drop\nacross the ideal ammeter. But in any moving coil meter currents produce torques which deflect\nsprings and keep them deflected. Electrical power deflects the springs during the short time that\nthe needle is moving and is also dissipated in the coil resistance as long as the needle is\ndeflected.\nTest Leads\nThe test leads are generally placed into the two pin jacks on the lower left of the MMM;\nblack into -COM and red into +V-Ω-A. Note the warning label that the inputs for these cannot\nexceed the maximum values of 500V DC, 1000V AC, 250mA DC (Figure 8). When you want to\nmeasure DC voltages up to 1000V , put the positive test lead into the pin jack labeled DC 1000V\nwhile leaving the black lead in -COM.\nRange Selector Switch\nThe meter can measure current, dc voltage, resistance, or ac voltage depending on the\nsetting of the range selector switch. There are four types of positions: DCA for dc current, DCV\nfor dc voltage, OHMS for resistance, and ACV for ac voltage. Each position has several ranges;\nfor example OHMS has three ranges: RX1, RX10, and RX 1K.\n\nFigure 3: Pin Jacks\nFigure 4: Range Selector Switch\nScales\nThere are four scales on the MMM. The top non-linear scale in green is used to measure\nresistance in ohms and ranges from inf to 0 reading left to right. Directly beneath the green scale\nis a red scale to measure AC. There are no markings on this scale. The black DC scale is divided\ninto 10 large divisions over an angle of about 80 degrees; each large division is further divided\ninto 5 small divisions. Alternate large divisions are labeled with 4 numbers. To the left, these are\nall zero. On the right are 5, 10, 25, 125; the voltage that produces full scale readings on the\ncorresponding DCV range.\nFigure 5: Scales\n\nFor example, if you set your range selector switch to 25 DCV then each large division\ncorresponds to 2.5V . When the needle points to full scale deflection, the voltage is 25V . (Notice\nthat there is no 10V full scale switch setting.) When the switch is set to the 500 & 1K setting,\neach large division corresponds to 50V or 100V depending on which pin jack the positive lead\nis inserted into. The non-linear bottom scale (also in black) measures decibels (dB), a logarithmic\nunit associated with sound level. This scale has the zero setting at -20 dB and then ranges from 0\nto 22 dB moving from left to right.\nCurrent-Voltage Measurements\nDC current Ranges (DCA)\nFirst we'll consider the dc current ranges. DCA, ('DC' stands for direct current), 'A'\nstands for amperes so DCA means direct current amperage). There are two DCA current ranges,\n250m and 50μ (250 mV). The more sensitive 50μ (250 mV) range can also be used to measure\nvoltage. When the dial is set to 50 μ (250 mV) the resistance of the meter is 5000Ω. If the needle\ndeflects to full scale, then 50μA flows through the meter. This corresponds to a voltage\ndifference\nV = I R = (50μ A)(5000Ω) = 2.5×10\n-1V = 250 mV .\nSo this setting can measure voltages between 0V and 250 mV .\nBesides this most sensitive range, there is a 250 mA range marked 250mDCA. This puts\nin a 1Ω shunt resistor in parallel across the 5000Ω of the meter itself. Thus when current causes\n250 mV to appear across the shunt and the 5kΩ meter resistance, a current of 250 mA passes\nthrough the shunt while 50μA passes through the meter giving full-scale deflection. Many of the\nMMM's have a fuse to protect the meter from overload on this range, otherwise the 1Ω resistor\nwill burn out inside the meter.\nDC voltage Ranges (DCV)\nThere are 4 DCV range switch positions 5, 25, 125, and 500 & 1K, selected by turning\nthe range selector switch. DC stands for direct current, so DCV means direct current voltage.\nSelecting the various DCV ranges introduces more resistance in series. The resistance of the\nΩ] [V\nmeter on any DCV range is always the full scale reading in volts times 20,000 ohms/volt\n[\n], a number that characterizes this meter as a dc voltmeter. For example, on the 25V\nsetting, the resistance is\n=\nV\nΩ V\n(25 )(20,000\n) = 500k Ω= 5.0× 10\n5Ω.\nR25V\nTable 1 shows the full scale value, the resistance of the meter on that range, and the\npower dissipated in watts through the meter for the DCV and DCA ranges.\n\nTable One: resistance and power characteristics of DCV and DCA ranges on MMM\nRange\nResistance in ohms [Ω]\nPower in milliwatts\nfor full scale\ndeflection [mW]\n5V\n100 k\n0.25\n25V\n500 k\n1.25\n125V\n2.5 M\n6.25\n500V\n10 M\n25.0\n1000V\n20 M\n50.0\n250mV (50μ A)\n5k\n0.0125\n250mA\n62.5\nThe DCV range 500 & 1K is one range selector setting. When the positive test lead is in\nthe +V-Ω-A, the full scale deflection corresponds to 500V . When the positive test lead is in the\npin jack labeled DC 1000V, the full scale deflection corresponds to 1000V.\nAC voltage ranges (ACV)\nSuppose the ac input voltage is V( t ) = V0sin(2π f t ) where V0 is the amplitude. A half-\nwave rectifier is inserted in series with the various resistors so that the ac has a dc component.\nThe meter is insensitive to the fast variation of the output voltage across a load, so it will read the\ntime averaged dc voltage V . Each ac scale is then calibrated by various resistors to indicate the\nroot-mean square value V\n= V0\n2 .\nrms\nFor non-sinusoidal waveforms, or for ac superimposed on dc (average in time not zero),\nthe readings of the meter will most likely not be meaningful.\nFor ac you read the scales whose divisions and associated numbers are printed in red.\nFull-scale deflection corresponds to your choice of range for the root mean square voltage\nindicated on the rotary setting. At low voltages, the diode is not linear, (this is due to the small\nforward drop voltage) as can be seen from the small displacement of the red ac marks at the low\nend of the scale, from the corresponding black dc ones directly below.\nThe resistance of the meter on any ACV range is always the full scale reading in volts\ntime 10,000 ohms/volt, a number that characterizes this meter as an ac voltmeter.\nResistance-Ranges (RX)\nThere are 3 resistance ranges, RX1, RX10, and RX1K. The ohmmeter operation depends\non the 1.5V AA cell that is inside the meter case. Essentially, current flows through the meter in\ninverse proportion to the resistance in the circuit. This accounts for the markedly non-linear\ngreen scale at the top of the meter.\n\nIn order to zero the meter, short the test leads by connecting them together. Then adjust\nthe OHMS ADJUST knob (located to the left of center of the MMM) so that the meter reads 0\nohms; the needle is then at its maximum deflection. When the test leads are not connected, an\nopen circuit, no current flows and the needle sits on the infinite resistance mark inf all the way on\nthe left side of the scale.\nHalf scale readings (that is with the needle pointing straight up parallel to the edge of the\ncase) are: 24Ω, 240Ω and 24, 000Ω on the RX1, RX10, and RX1K ranges, respectively.\nNote also that on the resistance ranges the meter puts substantial current through the\nresistor being measured. Maximum currents are 0.05 A, 5 mA, and 50μA on the RX1, RX10, and\nRX1000 ranges, respectively. You can check out some of this by making measurements of one\nmeter with another.\nMeter Damage\nAvoid dropping the meter. Keep its range switch on zero when it is not in use. This\ndamps the motion of the coil and needle--you can see this by rotating the case back and forth in\na horizontal plane and comparing the needle motion with the switch on a voltage scale and on\nOFF. Or: set the meter on the RX1K, connect the test leads and note the time that the needle\ntakes to return to zero when the leads are disconnected. Compare that time with the time it takes\nthe needle to return to zero when the leads stay connected but the range is switched from RX1K\nto OFF.\nBesides the fuse, the moving coil is protected by resistors and a pair of back-to-back\ndiodes across its windings. This means that it's hard to damage the meter coil except for the\nranges with low resistance where resistors can be damaged by excessive currents (RX1 and\n250mA ranges). However, it's good practice to start with high ranges, and not to measure the\nresistances of components that are wired into circuits, especially if power is on.\nFigure 6 shows the circuit diagram for multimeter. Notice that when the meter range\nselected is 50μ (250 mV), it takes 50μA in the external circuit to produce full scale deflection,\nbut only 37μA flows through the coil of the meter.\n\nFigure 6: Circuit diagram for MMM\n\nMeasuring Voltage, Resistance and Current with the Multimeter\n- Measure the resistance of the 20Ω resistor\n- Measure the voltage of the AA cell\n- Measure the current in a simple circuit\nMeasure the resistance of the 20Ω resistor: In order to zero the meter, short the test leads by\nconnecting them together. Then adjust the OHMS ADJUST knob (located to the left of center of\nthe MMM) so that the meter reads 0 ohms; the needle is then at its maximum deflection. Set the\nrange selector switch on the MMM to the RX1 range. Connect the test leads to the resistor.\nMeasure the resistance. You may want to make other resistance measurements. For example\nmake a thick line with a #2 pencil and measure the resistance of the mark.\nMeasure the voltage of the AA cell: Set the range selector switch on the MMM to the 5 DCV\nrange. Place the AA cell in the battery holder. Connect the test leads to the leads from the holder.\nMeasure the voltage.\nMeasure the current in a simple circuit: First set the range selector switch on the MMM to the\n250mDCA range. Make a simple circuit consisting of the 20Ω resistor, the AA cell, and the\nMMM. You can do this by connecting the red lead of the MMM to the red lead (plus, +) of the\nAA cell holder. Use a clip lead to connect the black lead (minus, -) of the AA cell holder to one\nend of the 20Ω resistor. Connect the black lead of the MMM to the other end of the 20Ω\nresistor. Measure the current in the circuit. What effect do you think the MMM has on the\ncircuit?"
    },
    {
      "category": "Resource",
      "title": "exp_vol_cur_res.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-02x-physics-ii-electricity-magnetism-with-an-experimental-focus-spring-2005/8c87c5ffd0d422c191f3ae36c11c9acd_exp_vol_cur_res.pdf",
      "content": "Experiment VI--Voltage, Current and Resistance\nIntroduction\nOur world is filled with devices that contain electrical circuits in which various voltage\nsources cause currents to flow. We use radios, telephones, computers, flashlights, irons, heaters,\nstoves, motors -- the list is long. Each of these contain circuits which take electrical energy\nfrom some power supply and turn it into other forms: the light of a lamp, the heat of a stove,\nstereo sound or mechanical work.\nIn general, electrical currents generate heat and magnetic fields, and produce chemical\neffects. Any of these phenomena can be used to measure current. One of the simplest ways is to\nlet the current flow through a coil of wire that is in a magnetic field and to measure the resulting\ntorque on the coil by observing the deflection of a torsion spring. This is how your multimeter\nworks, which we call a magnetic multimeter (MMM), in contrast to the standard term `analog'.\nLook at the meter itself. You can see the copper colored coil and one of the two spiral torsion\nsprings (the other is at the back; they also lead current in and out of the moving coil). The MMM\nis a current meter with a range selector switch and appropriate resistors and other parts that can\nmeasure voltage and resistances.\nOne of the earliest and most widely used electrical devices is the incandescent lamp, of\nwhich there are hundreds of different kinds. They all work because current flowing through a\ntungsten filament in a glass bulb heats that filament to \"incandescence\" --visibly hot, so that\nlight is emitted, along with heat.\nIn this experiment you will use meters, power supplies, resistors and lamps in various\ncircuits. You will make measurements to get some intuition and knowledge of circuit behavior.\nEquipment\nYou will need your LVPS; two multimeters; three 43Ω, (power rating 1 2W ) resistors;\none 2.4Ω, 2W resistor; one length of #16 bare resistance wire (1.02Ω per meter); one #47\nminiature incandescent lamp, nominal rating 0.15 A at 6.3V (called pilot, panel or indicator\nlamp); and one #1157 auto tail and stop lamp (tail lamp filament with a nominal rating of 8W at\n12.6V ; stop lamp filament with a nominal rating of 27W at 12.6V ). Look closely at your lamps\nand notice the filament, conducting leads and glass insulator. Throughout this experiment you\nwill need clip leads.\n\nMeasurements\nArrange the experimental apparatus as directed and record your measurements on the\nseparate RESULTS sheet in the problem set. You may wish to add brief comments, as\nappropriate.\n1 ---Resistors and Lamps: Measure the resistance of each of the three 43Ω resistors, R1, R2,\nand R3. Solder together resistors R2 and R3in parallel. Then solder resistor R1 in series with the\nother two as shown in Figure 1. Measure the resistances between the points A and B, B and C,\nand A and C in Figure 2. Measure the 'cold' resistances (not connected to a power supply) of the\n#47 lamp and the two #1157 lamp filaments.\nΩ\nFigure 1: Three 43\nResistors, one in series with two in parallel\nFigure 2: Circuit Diagram: Three 43Ω Resistors, one in series with two in parallel\n2a---Voltage Divider: Connect the arrangement of the three resistors in Figure 1 to your LVPS\nwith the output set at 5 volts. Measure the voltage differences between the points A and B, B and\nC, and A and C in Figure 2. Calculate the current through each resistor using Ohm's Law and\ncalculate the power dissipated in each resistor.\n2b---Voltage and Current: Connect the arrangement of the three resistors in Figure 1 to your\nLVPS with the output set at 5 volts. Use a clip lead to short the two resistors ( R2 and R3) that are\nconnected in parallel, (connect B to C in Figure 2). Measure the voltage between A and B.\nCalculate the current and power dissipated through the remaining resistor R1. Observe the\nwarming of resistor R1 by feeling it with your fingers.\n\n2c---Voltage and Current: Connect the arrangement of the three resistors in Figure 1 to your\nLVPS with the output set at 5 volts. Now use the clip lead to short resistor R1 by connecting A to\nB. Measure the voltage between B and C. Calculate the current and power dissipated through the\nresistors R2 and R3. Observe the warming of the two resistors in parallel by feeling them with\nyour fingers.\n3a---Voltage-Current (V-I) Characteristics: Set your LVPS to its lowest output voltage\n(around 1.5V ). Connect one MMM on the 250mDCA range in series with one 43Ω resistor\nacross the LVPS output (Figure 3a). Be careful of shorts that might damage the MMM. (If your\nMMM suddenly stops working you probably blew the fuse. Open the back and replace the fuse\nwith one of your spare fuses.) Connect the other MMM on the 5DCV range across the resistor\n(Figure 3a). Adjust the voltage output (turn the pot) of the LVPS so that your MMM on the\n5DCV range across the resistor reads 1.5V , 2V , 3V , 4V , and 5V . Record the values of the\ncurrent for each voltage setting.\nFigure 3a: Voltage-Current (V-I) Characteristics for the 43 Ω resistor\n3b---#47 Lamp: Set your LVPS to its lowest output voltage and repeat the V - I measurements\nwith the #47 lamp instead of the 43Ω resistor. You can use one of the sockets provided to\nconnect the #47 lamp. Use your clip leads to connect to the socket tabs.\nFigure 3b: Voltage-Current (V-I) Characteristics for #47 lamp\n3c---#1157 Lamp: Set your LVPS to its lowest output voltage. Identify the 8W filament lead\n(it's the one with the higher resistance---use your ohmmeter to determine this; sometimes the\ncontact is not good initially when the lamp is plugged into the socket. Try cleaning the contacts\nwith a screwdriver blade). Use a clip lead to connect the positive terminal of the LVPS to one\n\nend of the foot long piece of resistance wire that can be found in the top tray your Red Box. Use\na second clip lead to connect the other end of the resistance wire to the shell of the lamp socket.\nConnect the 8W filament lead to the minus terminal of the LVPS (see Figure 3c).\nFigure 3c: Voltage-Current (V-I) Characteristics for #1157 lamp\nConnect one MMM on the 25DCV range (not shown in Figure 3c) across the #1157\nlamp. Connect the other MMM set on the 50μ (250mV)DCA range across a measured length of\nthe resistance wire (0.2 m is a good choice). The wire has resistance 1.02Ω per meter so a length\nof 0.2 m between the MMM probes corresponds to a resistance of 0.2Ω. When a current of\n0.5 A flows through the resistance wire then there will be a voltage drop\nV = IR = ( 0.5A)( 0.2Ω ) = 100 mV .\nThis will give almost a half scale reading on the 50μ(250mV)DCA setting. (On the\n50μ (250mV)DCA range the MMM will measure between 0V and 250 mV on the black DC\nscale.) Adjust the voltage across the #1157 lamp to 2V , 4V , 6V , 8V , 10V . Record the values\nof the voltage across the resistance wire for each voltage setting. Calculate the current through\nthe resistance wire for each voltage setting. Note the LM315T regulator may overheat and shut\ndown; if this happens simply disconnect the lamp for a minute to let things cool down.\n4a--- Some LVPS Properties A full characterization of the LVPS is a lot of work, but a few\nmeasurements will show some of its behavior. Connect a MMM on the 5DCV range across the\noutput of the LVPS. Set your LVPS to 1.5V (no load voltage). Use clip leads to connect the\n2.4 Ω, 2W resistor (from LVPST kit) across the LVPS output just long enough to see if the\nMMM reading changes (Figure 4a). Record the output voltage (load voltage) of the LVPS with\nthe 2.4Ω resistor load attached. Disconnect the resistor load and adjust the LVPS (no load\nvoltage) for 2V , 3V , 4V , and 5V .. Record the output voltages with the 2.4Ω resistor load for\neach setting of the LVPS. Then switch the MMM range to 25DCV, for setting of the LVPS of\n10 V and 15V . Record the output voltages with the 2.4Ω resistor load for each setting of the\nLVPS.\n\nFigure 4a: Measuring LVPS Properties\nNotice that for low voltages there isn't much change when the load is applied --- estimate the\nreadings as best as you can. At any voltage much over 2V you will be overloading the resistor,\nso that's why you shouldn't leave it connected for long.\n4b--- LVPS Short Circuit Current: Set your LVPS to its lowest output voltage. Connect the\ntwo ends of the resistance wire across the LVPS output. Connect a MMM on the 50μ(250mV)\nDCA range across 100 mm of the resistance wire. This is pretty close to a short circuit so\ncalculate the short circuit ISC by measuring the voltage across the 100 mm of resistance wire\n(resistance 0.1Ω). Turn the adjusting pot on the LVPS to see if the ISC varies.\n5--- Charging a Capacitor: Carefully zero a MMM on the RX1K range by connecting the leads\ntogether and adjusting the red OHMS ADJUST dial. Set the range switch to `OFF'. You will\nonly be able to make this measurement once so please follow directions carefully. Connect the\n1000μF capacitor with the red positive lead of the meter going to the negative lead of capacitor,\nand the black negative lead of the meter going to the positive lead of the capacitor. As soon as\nyou turn the MMM range to RX1K start your clock. Measure the time at which the pointer\nreaches 4.5, 4, 3, 2, 1, and 0.5 on the black DC scale with 5 as maximum. Record your results. If\nyou are unable to get data during the first run, on the next run the meter will only point between\n1 and 3 on the black DC scale. You can still measure the time it takes the pointer to reach 2.5, 2,\n1.5, 1 on the black DC scale.\n\nParts List\nYou will be using parts from several different parts kits and the Red Box.\nLVPS\nRed Box\nMMM\ntransformer 120V ac to 12V ac\n1'\n800 wire\nlamp socket (#1157)\nclip lead kit (CLK)\nLVPST Test Kit\nresistor, 2.4Ω 2W\nlamp #1157 automotive\nExperiment VI: Voltage and Current\nlamps, #47 6.3V 0.15 A\nlamp holders\nresistors, 43Ω 1 2W\nelectrolytic capacitor, 1000μF\n1 ft\nwire, #22 insulated stranded\n\nReport Experiment VI: Voltage and Current\nData and Analysis\nArrange experimental apparatus as directed in the Experiment VI: Measurements p.13 and record\nresults on the appropriate tables below.\n1 ---Resistors and Lamps (all values in ohms)\nResistance of three 43Ω resistors:\nR1 =\n, R2 =\n, and R3 =\n.\nRAB =\n, RBC =\n, and RAC =\n.\nResistance of Lamps:\n#47 =\n, #1157, 8W =\n, #1157, 27W =\n.\n2.Voltage Measurements\n2a---Voltage Divider\nVoltages (in volts):\nVAB =\n, VBC =\n, VAC =\n.\nCurrent (in amperes) through Resistors:\nI1 =\n,\nI2 =\n,\nI3 =\n.\nPower (in watts) dissipated by Resistors:\nP1 =\n,\nP2 =\n, P3 =\n.\n2b---Voltage and Current\nCurrent (in amperes) through Resistor R1:\nI1 =\n.\nPower (in watts) dissipated by Resistor R1:\nP1 =\n,\n2c---Voltage and Current\nCurrent (in amperes) through Resistors R2 and R3:\nI2 =\n, I3 =\n.\nPower (in watts) dissipated by Resistors R2 and R3:\nP2 =\n, P3 =\n.\n3---Voltage-Current (V-I) Characteristics\n3a)\n3a)\n3b)\n3b)\n3c)\n3c)\n3c)\n43Ω\n43Ω\n#47\n#47\n#1157 8W\n#1157 8W #1157 8W\nVoltage [ V ] Current\nVoltage\nCurrent Voltage [ V ]\nRes. Wire\nCurrent\nacross 43Ω\n[ A]\n[ V ] across\n[ A]\nacross #1157\n[ mV ]\n[ A]\n#47\nLength of resistance wire (in mm ) =\n,\nResistance of wire ( inΩ)\n=\n.\n\n4--- Some LVPS Properties\nNo Load Voltage\nVno load [ V ]\nVoltage with Load\nVload [V ]\nVno load - Vload\n[ V ]\n4b--- LVPS Short Circuit Current (in amperes) ISC =\n.\n5--- Charging a Capacitor\nMMM\nTime [ s ]\nreading\n5.0\n4.5\n4.0\n3.5\n3.0\n2.5\n2.0\n1.5\n1.0\n0.5\n\nProblem 1: Internal resistance of the LVPS\nWhen the output voltage of the LVPS is between 1.5V and 12.0V , the output voltage\ndoes not noticeably change when a reasonable load is connected. This means that the internal\nresistance is very small, in the range between 0.01Ω and 0.001Ω. However when the output\nvoltage of the LVPS is above 12.0V , the internal resistance increases substantially.\na) How can you determine the internal resistance as a function of load?\nb) From your data from the LVPS with the #1157 lamp as the load, determine the internal\nresistance as a function of load?\nProblem 2: Calculating the internal resistance of an AA cell.\nAn AA cell when there is no load connected to it, has a terminal to terminal voltage of\n1.50V . When a 2.4Ω resistor is connected in series to an AA cell, the terminal voltage drops to\n1.33V . What is the current in the circuit? What is the internal resistance of the AA cell? What\nis the short-circuit current if the terminals are connected by a wire with negligible resistance\nassuming that the internal resistance is constant? What power is lost to the internal resistance?"
    },
    {
      "category": "Resource",
      "title": "experiment_eb.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-02x-physics-ii-electricity-magnetism-with-an-experimental-focus-spring-2005/ecb0db9176aee59873ea4e5d0acfd96f_experiment_eb.pdf",
      "content": "Experiment EB--Electrical Breakdown\nIntroduction\nIf you apply a large enough electric field to an insulating material it will break down and\ncurrents will flow through it, often as a spark, a transient flash; or as an arc, a steady glow. Gases\nare generally good insulators, but it's not infrequent that large fields cause breakdown. For\ninstance:\n- In dry weather if you walk on rugs or take off a jacket, you'll often get a spark when you\ntouch a large metal object. (The electrical energy involved is not large and the sensation is\nreally a burn--you'll feel very little if you let the spark go through a firmly held piece of\nmetal)\n- When driving along in a gasoline powered car, sparks ignite the fuel-air mixture on the order\nof one hundred times a second.\n- Turning electric devices on and off makes sparks inside the switch.\n- Electric welding uses a controlled arc to melt metal along adjoining edges of two pieces so as\nto join them.\n- Lightning has been making really big (and sometimes damaging and deadly) sparks for eons.\nAll these sparks and arcs in gases and vapors have several features in common:\n- Neutral molecules are torn into ions and electrons that can acquire energy from the electric\nfield and then recombine and generate EM radiation: radio waves, heat and light.\n- Ions striking the electrodes heat them, and knock out atoms.\n-\n, 15\nBreakdown fields depend on the kind of gas or vapor and its pressure. For air at 1 atmosphere\nlb in\n(about 10\n5 N m\n, 760 mm\n.\nof mercury) the breakdown field is about\nV mm\n\nTheory\nA plasma is a gas containing free charged particles. A plasma can be created by ionizing\nmatter. Consider a volume of air containing many gases. There are also a number of free ions\nlike electrons, or other ionized molecules present in the air. Suppose there is an external electric\nfield that exerts a force on any ions in the air. In particular, let's consider the electric force on the\nfree electrons. The force will cause the electrons to accelerate increasing their kinetic energy.\nConsider a single hydrogen atom consisting of a proton and an electron in the air. The\nfree electron can collide with the hydrogen atom. If the electron has enough energy, the impact\nwill ionize the hydrogen atom creating a positively charged proton, a negatively charged\nelectron, along with the original free electron. This process is called impact ionization (Figure\n1).\nFigure 1: Impact ionization\nIn the atom, electrons are bound to the nucleus. A certain change in potential energy,\n∆U ion, is needed to extract the bound electron from the potential energy well created by the\npositively charged nucleus (Figure 2). This is analogous to the increase in potential energy\nnecessary to allow a mass to escape the gravitational field of a planet.\nFigure 2: Potential energy well for ionization\nThe energy per charge necessary to ionize the electron is called the ionization potential,\n∆Vion, and is given by\n=\n∆Vion\n∆U ion\ne\n\nwhere e = 1.6× 10\n-19 C is the magnitude of the charge of the electron. For atoms, the ionization\npotential is on the order of Vi ≈ 10 volts. A unit of energy for atomic processes is the electron-\nvolt, [ ]\n, with 1ev = 1.6 × 10\n- 19 J . So in order for a collision to ionize a hydrogen atom, an\nev\nincoming free electron must have a minimum kinetic energy of about ≈10ev, equal to the change\nin potential energy necessary to ionize the atom,\nKe = ∆Uion = e∆Vion = (1.6 ×10\n-19 C )(10V ) = 1.6 ×10\n-18 J = 10ev\nIf the incoming electron has too much energy, it will go too fast and 'not see the atom',\neffectively passing right through it. A qualitative graph is shown in Figure 3 of the ionization\nprobability plotted against incoming electron kinetic energy. There is an optimal maximum\nincoming kinetic energy to ionize the gas around ≈100ev although this maximum depends on\nthe specific gas.\nFigure 3: Ionization probability is plotted against incoming electron kinetic energy\nElectrical Breakdown of Air\nSuppose we establish a voltage difference, ∆Vgap , between two conducting plates that are\nseparated by a distance d. The electric field in the air between the plates has magnitude,\nVgap\nE =\n.\nd\nThis field will exert a force on any free electrons that are by chance already present between the\nr\nr\nplates according to F = -eE .\nMean Free Path\nThe gas between the plates is filled with molecules. What is the probability that the\nelectron will collide with one of the gas molecules? The electron will accelerate in the gas until it\ncollides with a gas molecule. The average distance that the electron travels between\ncollisions, λmfp , is called the mean free path.\n\nWe can model each atom in the air between the plates as a sphere with a circular cross\nsectional area σ = π r\n2, where r is a parameter that approximately corresponds to the radius of\nthe atom. Consider a cylindrical volume of length λ mfp and cross sectional area σ (Figure 4). If\nthere is at least one target atom in this cylindrical volume then the incoming electron will strike\nthe atom.\nFigure 4: Mean free path\nThe condition for collisions is that the number of atoms per volume, n , (the number\ndensity n of atoms in the gas), is one atom per cylindrical volume of cross sectional area σ and\nlength λ mfp ,\nλ\nn =\n.\nmfpσ\nRecall that the number density for an ideal gas at STP is given by\n6.0 × 1023 particles / mole = 2.7 × 10\n25 particles / m\n3.\nn =\n22.4 × 10- 3 m3 / mole\nThus the mean free path is given by\nλmfp = nσ = nπ r2 .\nNotice that the mean free path of the gas increases as the number density decreases. The\napproximate radius, r , of the air molecules is\n)\n1 2\nr =(1 nπλmfp\n.\nCollision Energy and Ionization Condition\nThe kinetic energy that a free electron acquires between collisions is just the work done\nby the electric field on the electron between collisions. This work is the product of the force and\nthe mean free path length that the electron travels, and is given by\nW = eEλ mfp .\n\nWhen this work is greater than the ionization energy ∆U ion = e∆Vion the target atom will ionize.\nThus the ionization condition is\neEλ mfp ≥ e∆Vion .\nThe magnitude of the external electric field is then (using our result for the mean free path) must\nsatisfy the following inequality,\n∆Vion = nσ∆Vion\nλ\nE ≥\nmfp\nWe can estimate the approximate radius, r , of the air molecules by measuring the electric\npotential difference, ∆ Vgap , between the gap, and the gap distance, d , when ionization occurs.\nFirst, our ionization condition for the magnitude of electric field is\n∆Vion\nλ\nE ≈\n.\nmfp\nThe magnitude of the electric field in the gap is just the electric potential difference divided by\nthe gap distance,\n∆Vgap\nE =\n.\nd\nEquating these conditions for the electric field yields\n∆V\n∆ Vion =\ngap\nλmfp\nd\nThus the mean free path can be measured according to\n∆Vion ,\nλmfp ≈ d ∆ Vgap\nwhere the ionization potential is ∆ Vion ≈ 10ev .\n)\n1 2\nSince the approximate radius of the air molecule is r =( 1 nπλmfp\n, we can use the above\ncondition for the means free path to give a value for the radius,\n)\n1 2\nr =( 1 nπλmfp )\n1 2 =(∆V\n.\ngap nπd∆Vion\n\nExperiment\nIn this experiment you will study the breakdown of air using your HVPS and a simple\nadjustable spark gap made from a clothespin, two tungsten rods, and a screw and wingnut to\nadjust the gap width. Your two MMMs will serve to measure voltage and current, so that beside\nthe breakdown field itself you could determine the voltage-current characteristic of the arc. The\nsame apparatus with some modifications will then act as the source of microwave radiation in\nExperiment MW (Microwaves).\n--BE SURE TO SAVE THE APPARATUS FOR EXPERIMENT MW--\nConstructing the Spark Gap\nYou'll make a spark gap out of two 3/16′′ long pieces of 0.040in diameter tungsten rod.\nSqueeze each short piece into the screw slot of a brass screw. The tungsten rod is thicker than the\nscrew slot so you have to apply a force to squeeze the rod in. Once the rods are in place, put the\ntwo screws into the holes at the end of the clothespin. Place solder lugs on the screws that you\nwill later use to solder on a short antenna for Experiment MW (Microwaves). The spark gap for\nthe clothspin looks like figure 5.\nFigure 5: Tungsten rod and clothespin assembly\nProcedure\n1. Use the needle nose pliers to break off two 3/16′′ long pieces of tungsten rod. When you\nbreak the rod, small pieces may fly around so wrap the tungsten rod in paper before you\nbreak it to contain any flying pieces.\n2. Put the solder lug onto the brass screw and place the nut on the other end with just one or\ntwo turns. The end of the nut and the screw slot will provide two surfaces for balancing\nthe pliers while you squeeze the rod into the screw slot. If you hold the tungsten rod with\nyour fingers you can start the squeezing process with the needle nose pliers. Once you get\nthe rod in a bit, use your slip joint pliers to squeeze the rod into the screw slot. This may\n\ntake a little patience but it is doable. Try to keep the rods as parallel as possible to the\nscrew slot.\n3. Once you get the rod into the slot, unscrew the nut and put each screw into one of the\nholes at the end of the clothespin. You can push the jaws of the clothespin sideways to\npermit access to the drilled holes.\n4. Split the ends of the two-conductor speaker wire and strip and tin all four ends. Pass the\nwire through the coil of the spring in the clothespin and solder one end to each of the two\n1MΩ resistors. Wrap the other end of the 1MΩ around the brass screw between the nut\nand the clothespin. Tighten down the nuts using your needle nose pliers. When\neverything is almost tight, adjust the two tungsten rods so that they are perpendicular to\neach other.\nFigure 6a (left): Speaker wire attached to 1MΩ resistors\nFigure 6b (right): Tungsten rods perpendicularly aligned;1MΩ resistor leads clamped\nbetween nut and clothespin\n5. Attach the clothespin to the corner brace with the screw, washers, and nuts in the\nfollowing order:\na) The 4-40 screw with a washer on it goes through the end hole of the brace, and then\nthrough a hole in one clothespin end.\nb) A nut is placed on the screw, and the screw then passes through the hole in the other\nclothespin end. Tighten firmly. It should be possible to open and close the clothespin\nwithout the screw rubbing on the edge of the hole. If this is not the case, try passing the\n4-40 screw with a washer on it through the hole in one clothespin end and then through\nthe end hole of the brace; then continue as before.\n\nc) Place another washer and the adjusting wing nut on the end of the screw to complete the\nassembly.\nd) Wedge, clamp, or tape the spark gap assembly firmly to a table or desk.\nFigure 7: Spark Gap diagram\nExperiment\n1. Use your clip leads to connect the two ends of the speaker wire to the output of your\nHVPS.\n2. Connect one MMM on the 1000DCV range across the HVPS output. (Use for the test\nlead inputs -COM and +DC1000V). We will call the voltage it reads V0.\n3. Connect a second MMM across one of the 1MΩ resistors. (Use for the test lead inputs -\nCOM and +V-Ω-A and the same switch setting as for the on the 1000DCV range (500 &\n1K DCV range). Since the input leads are input in the -COM and +V-Ω-A, the meter\nreads from 0 to 500 volts maximum. We will call the voltage the second MMM reads V1\n--this voltage is proportional to the current.\n\nFigure 8: Multimeter connections\n4. Calibrating the Gap Setting: Make a scale for the gap widths on the wooden clothespin\nusing one mark for a known width (0.1mm ) and a second mark for zero gap width; then\nyou will divide the scale into four parts corresponding to 0.025mm changes in gap width.\nIn order to set the gap to a known spacing, use a piece of photocopy paper as a feeler\ngauge. A package of 500 sheets is about 50 mm thick, so one sheet is 0.1mm thick, close\nenough. Put a piece of this paper between the tungsten rods and notice that as you turn\nthe wing nut the paper goes from being very easily moved back and forth to being quite\nfirmly gripped.\n5. Somewhere in between is when the gap separation is 0.1mm and with some judgment\nyou can find that setting. You'll be turning the wingnut back and forth but all final\nadjustments to the wingnut should be made in the same clockwise direction before\nmarking the wood. When you are satisfied that the width is right (while turning the nut\nclockwise) stop and make a small felt pen mark on both the nut and the wood of the\nclothespin as far on the right as you can.\nFigure 9: Calibrating the gap width\n6. Now set your HVPS to200V and proceed to reduce the gap separation by turning the\nwingnut counterclockwise until the tungsten rods come together and short, as indicated\nby a reading on the second MMM. Now turn the nut clockwise and when the gap just\nopens, stop. Make a small felt pen mark on the wood next to the mark on the nut. There\nshould now be two marks on the wood about 4 mm apart. You can easily estimate four\n0.025mm steps starting from when the gap is shorted and going to when the gap is\n0.1mm wide.\n\n7. Doing the Experiment: Start with the tungsten rods touching (shorted). Turn the\nwingnut smoothly clockwise to the 0.025mm position, 1/4 of the way to 0.1mm . Raise\nthe HVPS voltage slowly until the second meter just begins to deflect, indicating\nbreakdown. If you look you can see the arc between the tungsten rods. Record the voltage\nV0 at which this happens. Repeat for the three remaining gap separations, and repeat the\nentire procedure three times.\n8. You can enter you data in a table thus:\nData Table: Breakdown Voltages for Various Spark Gap Separations\nGap\nSeparation d\n[mm]\nBreakdown\nVoltageV0\n[V ] Run 1\nBreakdown\nVoltageV0\n[V ] Run 2\nBreakdown\nVoltageV0\n[V ] Run 3\nBreakdown\nVoltage V0\n[V ] Average\n0.025\n0.05\n0.075\n0.1\nAnalysis\nPlot the average breakdown voltage V0 vs. gap separation. Since the breakdown electric\nfield is given by\nVgap\nE = d ,\nelectric field or a range of values. Express your results in\nuse the slope of your best fit straight line to determine either a best single value of the breakdown\nkV m .\nParts List\ndrilled wooden clothespin\n1-3/4′′ .040\" tungsten rod\n4-40x1/2 brass screws\n4-40 steel nuts\nsolder lugs\n\n2\" corner brace\n4-40 screw, 1 1/2′′ long\n#4 flat washers\n4-40 nylon wing nut\nresistors 1 MΩ 1 2W\n\n3'\n#22 speaker wire\n\nExperiment EB (Electrical Breakdown)\nConnect MMM 1 on the 1000DCV range (use -COM and +DC1000V for the test lead\ninputs) across the HVPS output. We will call this voltage V0. Connect MMM 2 on the 500DCV\nrange (use -COM and +V-Ω-A for the test lead inputs and the same switch setting as for the\n1000DCV range) across one of the 1 MΩ resistors. We will call this voltage V1.\nFigure 1: Multimeter connections for Experiment EB\nStart with the tungsten rod touching (shorted). Turn the wingnut on the clothespin\nsmoothly to the 0.025 position, one fourth of the way to the 0.1mm setting. Raise the HVPS\nvoltage slowly until the second meter just begins to deflect, indicating breakdown with the\nformation of an arc. Record the voltage V0 with MMM 1 across the HVPS and the voltage V1\nwith MMM 2 across the 1 MΩ resistor at which this happens. Repeat for the three remaining gap\nwidths, and repeat the entire procedure three times. Enter your data in the tables below.\nAnalysis\nPlot the average breakdown voltage vs. gap, and determine either a best single value of\nthe breakdown electric field or a range of values. Express your results in V/mm.\nData Table: Breakdown Voltages for Various Spark Gap Separations\nGap\nSeparation d\n[mm]\nBreakdown\nVoltageV0\n[V ] Run 1\nBreakdown\nVoltageV0\n[V ] Run 2\nBreakdown\nVoltageV0\n[V ] Run 3\nBreakdown\nVoltage V0\n[V ] Average\n0.025\n0.05\n0.075\n0.1\n\nProblem 1: Experiment EB\na) What is the number of particles per m3, (the number density n), for an ideal gas at standard\ntemperature and pressure?\nb) Define the mean free path for an electron in a gas to be the average distance λ an electron\ntravels before it collides with an air molecule. If an electron travels close enough to an air\nmolecule it will collide. The impact parameter b, is defined to be the radius of a circular cross\nsectional area of effective area π b\n2 that the air molecule presents as a target to the electron. This\nmeans that there must be at least one air molecule in the volume λπ b\n2that the electron could\ncollide with. Find an expression for the number density n of air molecules, in terms of the mean\nfree path λ , and the impact parameter b.\nc) When the electron is placed in a gap of width d and gap voltage ∆Vgap , how much kinetic\nenergy per charge does the electron acquire if it travels a distance equal to the mean free path λ ?\nd) The energy per charge necessary to ionize air molecules, the ionization voltage, is\n∆Vion ≈ 10V . If the electron gains a kinetic energy per charge equal to the ionization voltage then\nthe electron will ionize the air molecule. Using your result from part c), derive an expression for\nthe mean free path λ in terms of the gap width d, gap voltage ∆Vgap , and ionization voltage\n∆ Vion.\ne) Use your experimental results where you found the breakdown electric field (average gap\nvoltage / gap width) necessary to ionize air molecules. Use that result to calculate the mean free\npath λ.\n\nProblem 2: I-V characteristic of the spark gap\nYou can see how you could obtain the voltage-current characteristic of the discharge by setting\nthe gap separation and varying the voltage. Suppose that when the MMM across the HVPS\noutput reads a voltage ∆V0, the MMM connected across the 1 MΩ resistor reads a full scale\ndeflection, ∆V1 = 500V . Recall that the resistance of the MMM connected across the 1 MΩ\nresistor set on the 500DCV scale is the full scale reading in volts times 20,000 ohms/volt [Ω/V].\na) Draw a circuit diagram that shows the two MMMs, the gap, and the two 1 MΩ resistors\nthat you used in the Experiment Electrical Breakdown. Be sure to include the internal\nresistance of the MMM connected across the 1 MΩ resistor in your circuit diagram.\nb) What is the equivalent resistance of the MMM connected across the 1 MΩ resistor and\nthe 1 MΩ resistor? Are these two resistors in series or parallel?\nc) Show that the full scale reading of the MMM connected across the 1 MΩ resistor,\n∆V1 = 500V , corresponds to 550μA in the circuit. Note that only a fraction of this current\nflows through the MMM connected across the 1 MΩ resistor.\nd) Show that the voltage across the spark gap satisfies, ∆Vg = ∆V0 - 2.1∆V1.\ne) Briefly describe how the above calculations can help you measure the I-V relation for the\nspark gap?"
    },
    {
      "category": "Resource",
      "title": "experiment_ef.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-02x-physics-ii-electricity-magnetism-with-an-experimental-focus-spring-2005/0586de1c5db133f29e1c71fd94698253_experiment_ef.pdf",
      "content": "Experiment EF--Electrostatic Force\nIntroduction\nIn this experiment you'll investigate aspects of the electrostatic force. This force has\nsuch varied roles as making currents flow in wires, holding atoms and molecules together,\nmaking clothes cling, glue stick, etc. The strength of the electrostatic force is proportional to the\nproduct of a charge (measured in coulombs) and the electric field (measured in volts/meter)\nproduced by the other charges.\nYou'll set up a horizontal parallel plate capacitor and find the voltage at which a piece of\naluminum foil of known weight just lifts off the bottom plate. The electric force then just\nbalances the force of gravity,\nr\nr\n.\nFelectric = Fgravity\nBesides a single thickness of foil, you will use folded foils equivalent to n thickness as\nwell. The electric field between the plates is proportional to the surface charge density on the\nplates. When the electric field is measured in SI units, the constant of proportionality between\nthe field and the surface charge density is determined by ε0, the permittivity of free space. From\nthe relations between measured or known electrical quantities, material properties and apparatus\ndimensions you can determine the constant ε0.\nTheory\nYou want to equate the gravitational and electric forces on the foil. The gravitational\nforce is just the weight of the foil. The density ρ of the aluminum foil material is 2.7 grams/cc\n(2.7 ×10\n3 kg / m\n3). The volume of the foil is then its area, Afoil , times its thickness t . Therefore\nthe magnitude of the gravitational force on the foil is\nl\nFgravity = m tot a g = ρtAfoil g .\nFinding the electrical force is a bit subtler. Treat the closely spaced, metal portions of the\nwashers as a parallel-plate capacitor. The electric force on the foil will be its charge times the\nelectric field it feels. The subtlety lies in calculating that field: The total field in the capacitor is\njust V d where V is the applied voltage and d is the spacing between the plates. But only half\nthat field is due to charges on the upper plate; and the other half is due to charges on the lower\nplate.\nGauss's Law, states that the electric flux through a Gaussian surface is equal to the charge\nenclosed in a Gaussian surface divided by the constant ε0.\nr\nd r\n∫∫ E⋅a = qenclosed ε0\nGaussian\nsurface\n\nChoose a cylindrical Gaussian surface whose upper end is inside the top plate and whose bottom\nend has area a and is within the gap. (See Figure 1.)\nFigure 1: Gaussian surface for parallel discs\nThe electric flux through the Gaussian surface is just the constant electric field inside the gap, E ,\ntimes the area, a, of the end cap. (Note the electric field is zero on the end cap that is outside the\nsurface). The charge enclosed by the Gaussian surface is a times the charge density σ\n(charge/area) on the upper plate. So applying Gauss's Law yields that the total electric field in\nthe gap is\nE = σ ε0 .\nTherefore the charge density, σ , can be found by equating the total field, E = V d , to the\nfield found from Gauss's Law:\nV\nσ = ε\n.\no d\nTo find the electric force on the foil, assume that the charge density, σ , on the foil, is the\nsame as that of the lower washer. Here comes the subtle point. By thinking about the electric\nfield from the charge sheets on the inner surfaces of the plates (positive on top and negative on\nthe bottom) you come to the conclusion that 1/2 the total field comes from the upper plate and\nhalf from the lower plate. Charges on the foil feel only horizontal forces from other charges on\nthe bottom plate, so the vertical force on the foil is due to the electric field of just the top charge\nsheet. The magnitude is given by:\nV\nεoV\n2 Afoil\n=\nFelectric = Qfoil Etop = σ Afoil 2d\n2 d2\nEquating the electric and gravitation forces yields,\nεoV\n2 Afoil\n2 d\n= ρtA foil g .\nThe area of the foil, Afoil , cancels giving:\n\nV\n2 =\n⎛⎜ 2d 2ρ g ⎞⎟ t .\n⎝\nε0\n⎠\nIf you plot V\n2 vs. t , you should get a straight line whose slope is the coefficient of t . You\ncan calculate the free permittivity of space, ε0, from your experimental value for the slope:\n2ρ gd2\nε0 =\n.\nslope\nUse the following values:\n-\n-\nthickness of perf-board + tape, d = 7.1 ×10 3 m ;\n-\nthickness of Aluminum foil, t = 7.6 × 10\n-6 m ;\n-\ndensity of Aluminum foil, ρ\n= 2.7 ×10\n3 kg / m ;\nAl\n-\nacceleration due to gravity, g = 8.9 m / s 2 .\nApparatus\nFirst make a parallel plate capacitor from two large washers (2.5 inch diameter). The\nexperiment depends on the smoothness and cleanliness of the washers and the cleanliness of the\nfoil. You can't do much about the smoothness of the washers beyond choosing, by sight and\ntouch, the best areas for where you put the foil (use a finger nail to feel the surface of the\nwasher). Rub the washers vigorously with a paper towel to remove \"finger grease\" or other\ncrud. Break the piece of perf-board into three equal sized pieces. Tape the 3 pieces of perf-board\nto one of the large washers at about 120° separations to form spacers that establish the gap\nbetween the washers. (Use black insulating tape.)\nFigure 2: perf-board used as spacers on washer\nThe perf-board is 1.5mm thick, and the tape is 0.2 mm thick. Since you want the gap to\nbe as uniform as possible, avoid burrs on the perf-board and smooth the tape down carefully.\nPress the second washer down on the spacers and check the gap measurement as best you can\n\nwith your steel scale to be sure it's not grossly off. Tape two #30 wires to the outside of the\nwashers, and place the first washer, the one with spacers, level on your desk.\nUse one of your MMM connected across the output of the HVPS to read the HVPS\noutput (the right MMM in Figure 3). Connect the lower washer to the low voltage side of the\nHVPS. Connect the upper washer to the negative input of the second MMM. Connect the\npositive input of the second MMM to the high voltage side of the HVPS. This puts the second\nMMM in series with the gap (the left MMM in Figure 3). You can use electrical tape to hold\nthese connections firmly on the washers. Both MMM are set on the 1000DCV range.\nFigure 3: Experiment EF connections\nExperiment\nCut a square piece of foil, about 1cm ×1cm . The foil should also be clean and flat, but it\nalso needs to be given a rough texture to allow air to pass under it when it lifts off. Press it firmly\non the 80 grit sandpaper found in the Red Box with a piece of tissue between foil and finger. Try\nto handle the foil with your fingers as little as possible to keep it clean. Tweezers work well for\nhandling the foil. Alternately, you can tip it off the abrasive cloth onto a piece of paper and then\nslide it onto the washer. Transfer the foil to the bottom washer, and make sure that it's fairly flat.\nYou can see that if the foil isn't flat, it either changes the gap or charge will flow out to the part\nnearest the upper washer so that larger forces will be exerted than if the foil were flat.\nFigure 4: Charge flows to edge of foil\nFigure 5: Charge flows to center of foil\nPut the top washer in place and turn up the HVPS all the way. The foil should lift off and\nbounce around. Turn down the voltage and repeat. When the foil lifts and shorts the gap, the\n\nsecond MMM will register a voltage. Once the apparatus is working well, carefully and slowly\nraise the voltage and read the voltmeter when the foil lifts off. Read the voltage across the gap\nby the first MMM which is connected directly across the HVPS output. There are two other\nways to determine when the foil lifts off the plate.\n- Directly, by looking in the gap, seeing the foil lift, and having your partner read the\nvoltmeter at that instant.\n- Watch the MMM readings as you slowly increase the voltage. When the foil lifts and shorts\nthe gap, the MMM reading will drop.\nExperiment EF Parts\n1 strip perfboard\nwashers, 1in. plated steel\n4 ft\nwire, #30 bare solid\n1piece Al foil, 2in square 0.0003in thick\n1piece sand paper 80 grit\nFigure 6: Experiment EF parts\n\nExperiment EF Data Analysis\n1. Once the apparatus is working well, carefully and slowly raise the voltage and read the\nmultimeter when the foil lifts off. Gentle tapping may help to get more reproducible\nresults. Repeat 5 times. Take care that the foil isn't shorting the gap when you read the\nmeter. (If you are having trouble, try different sizes of foil.) Prepare double and triple\nthickness foils (again about 1cm ×1cm from pieces 2cm ×1cm and 3cm× 1cm , folded\nand squeezed flat, and repeat the above procedure.\n2. Analysis: Average the voltages for a given foil thickness. You then have 3 numbers: the\nvoltages required to lift 1, 2, and 3 thicknesses of foil. Use a table like this to enter\nyour Experiment EF data\nNumber\nof foils\nVoltage\nTrial 1\nVoltage\nTrial 2\nVoltage\nTrial 3\nVoltage\nTrial 4\nVoltage\nTrial 5\nAverage\nVoltage\n3. Plot the voltage squared V\n2 vs. n, the number of thicknesses of foil. Is the origin a data\npoint? (Zero voltage will lift zero folds of foil). Include your graph.\n4. Your graph of the experimental values of V\n2 vs. n should be a straight line with the slope\nbeing the factor in parentheses. Find the slope of the best-fit line.\n5. Calculate the free permittivity of space ε0, from your experimental value for the slope\nusing the result that\nV\nρtg 2d 2\nε\n=\nn .\n\nProblem 1: Electrostatic Force Experiment\na) Using Gauss' Law, find an expression for the electric field between two discs of radius R\nthat are separated by a distance d. The discs have opposite charges that are equal in\nmagnitude placed on them. You may neglect edge effects. Make a sketch of the electric\nfiled lines when you include edge effects.\nb) Suppose a voltage difference ∆V is applied across the two discs. Show that the charge on\nε πR2∆V\no\nthe positive plate is given by the expression, Q =\nwhen you ignore edge effects.\nd\nc) Taking into consideration edge effects, the actual expression for the charge is given by\nε πR2∆V\no\nQ = f\nwhere f is a correction factor that depends on the ration of separation to\nd\nplate radius. For circular plates, the factor f depends on d / R as follows:\nd / R\nf\n0.2\n1.286\n0.1\n1.167\n0.05\n1.094\n0.02\n1.042\n0.01\n1.023\nExplain why the factor f is always greater than 1. Where is the 'extra charge'?\nd) Find an expression for the capacitance of the circular discs neglecting edge effects. Now\ntake into consideration the correction factor f . Is the actual capacitance larger or\nsmaller?\ne) How would you expect your results in parts a) - d) to change if you used two washers of\ninner radius r1 and outer radius r2 instead of two discs?\n\nProblem 2: Internal Resistance of the HVPS\nIn experiment EF, you connect the lower washer to the minus side of the HVPS, and the\nupper washer to the plus side. Let's approximate the internal resistance of the HVPS by 0.2MΩ\nand the two 1 MΩ gives a total internal resistance RT = 0 = 2.2 MΩ. Use one multimeter on the\n1000V DC setting to read the HVPS output. Remember that this also acts as a 20MΩ resistor.\nConnect the second multimeter on the 1000V DC setting in series with the gap. Again this acts as\na 20MΩ resistor. When the foil lifts and shorts the gap, the second multimeter does two things:\nit will register a voltage, and it acts as a current limiter due to its high resistance. The circuit is\nshown in figure 1 below.\nFigure 7: Experiment EF circuit\nThe voltage across the first multimeter will drop due to the changed load as soon as the\nfoil lifts. Just before the foil lifts, suppose the voltage is VHVPS = 400V .\na) What is the current through the multimeter when it is connected across the output of the\nHVPS?\nb) Find a relation between the emf of the high voltage power supply, Vemf , the current in the\ncircuit, I , the output voltage across the HVPS, VHVPS , and the total internal resistance of\nthe HVPS, RT .\nc) When the foil lifts, what is the equivalent load resistance due to the two multi-meters?\nAre they in series or parallel?\nd) What is the total resistance of the circuit including the total internal resistance of the\nHVPS?\ne) What is the current that flows in the circuit?\nf) Once the foil has lifted, what is the new voltage across the terminals of the HVPS?"
    },
    {
      "category": "Resource",
      "title": "experiment_mf.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-02x-physics-ii-electricity-magnetism-with-an-experimental-focus-spring-2005/99dbeb6cf780bea19357edfebc0a7ba9_experiment_mf.pdf",
      "content": "Experiment MF--Magnetic Force\nIntroduction\nThe magnetic force on a current-carrying conductor is basic to every electric motor --\nturning the hands of electric watches and clocks, transporting tape in Walkmans, starting cars,\noperating refrigerator compressors, etc.\nIn this experiment, you will investigate the magnetic force between two current carrying\nwire coils. One coil has 10 turns and the other has 38 turns. The 10-turn coil will be taped to\none end of a pivoted balance beam. The beam pivots on two pins that also make electrical\ncontact, allowing current to flow onto the beam and through the 10-turn coil (figure 1).\nFigure 1: Top view of balance with 10-turn coil taped to underside of foam core\nThe 38-turn coil will be positioned on the table directly below the 10-turn coil. A current\ntraveling through both coils will produce a magnetic force between the coils. You will measure\nthe magnitude of this force, by noting when the magnetic force between the coils is balanced by\nthe weight of squares of aluminum foil that are placed on the other end of the balance beam.\nFigure 2: Underneath side of balance beam with 10-turn coil\n\nDerivation of the force equation:\nConsider the case when the current in the two coils are flowing in the same direction.\nr\nCalculate the force by first calculating the magnetic field, B1, of the lower coil, (coil #1) at the\nupper coil. Then we use the magnetic force law,\nr\nF\nd\nr\n2 =\nr\nId r\n2 × B1 ,\nr\nto calculate the force, dF2, on a small current element, I dr r\n2, in the upper coil #2 (figure 3). We\nthen sum up the total force on all n2 turns in the upper coil,\nr\nr\nF2 = n2 ∫\nF\nd 2 .\ncoil 2\n#\nIn our experiment set-up, the two coils are a separated by a distance d that is much\nsmaller than the radius r of either coil. As a first approximation, we can treat the two coils as if\nthey were parallel wires separated by a distance d. Then we can use Ampere's Law to calculate\nr\nthe magnetic field, B1, from the lower coil and compute the force on the upper coil.\nFigure 3: Force diagram on coil # 2 for attractive force\nr\nNote that in our approximation when we calculate the force, dF2, on a small current\nelement, I dr r\n2 , in the upper coil, we are neglecting the contribution to the magnetic field, B1 ,\nfrom parts of the lower coil that are not directly below the small current element in the upper\ncoil. (This will over-estimate the force somewhat (can you see qualitatively why?) but the error\nis not more than about 10% with your arrangement).\nr\nEach turn in coil #1 has a current I which produces a tangential magnetic field Bturn at dr r\n(a distance d away), whose magnitude is then approximately the field of a single long straight\nwire,\nμ0I\n=\nBturn\n2πd\n.\nv\n\nThe constant μ = 4π × 10\n-7 T - m A and is called the magnetic permeability of space. The\nmagnitude of the total field B\nr\n1at dr r\n2 is equal to n1 times the field due to a single turn\nB1 = μ0n1I\n.\n2πd\nIn figure 3, the direction of the magnetic field at r\ndr\n2 points towards the center of the circle and is\nperpendicular to the current element I dr r\n2, in the upper coil.\nr\nThe magnetic force dF2 exerted on dr r\n2 is given by:\nr\nr\ndF2 = Idr r\n2 × B1.\nSince the currents are flowing in the same direction in the two coils, the direction of this force at\ndr r\n2 points downwards towards coil #1. Thus the force is attractive between the coils when the\ncurrents flow in the same direction. The magnitude of this force is given by\ndF2 = Idr2μ0n1I\n2πd\n.\n\nEvery element dr r\n2 of coil #2 experiences this force, in the same direction -- vertically\ndown, (if the current directions are such as to produce attraction). The total length of wire in coil\n#2 is n22πr , where r is the radius of both coil #1 and coil # 2. Thus the magnitude of the total\nforce of attraction on coil #2 is given by:\n2πrμ0n1I 2\n0n1n2I\n2 r\nF2 = n2 ∫ dF2 = n2 ∫ Idr2μ0n1I = n2\n2πd\n= μ\n2πd\nd\nwhere r is the coil radius, d the separation between the center of the two coils (see the figure\nabove), and n1 and n2 the number of turns in each of the coils. By Newton's Third Law of\nMotion, the total force on coil #1 is equal and opposite to the force on coil #2.\nThe magnetic force is balanced by aluminum foil weights that are placed on the other\nside of the pivot, at an equal distance from the pivot as the center of the upper coil. If the weights\nare all the same--2 cm x 2 cm of foil, their weight will be:\nF\n= nmg = nρAtg .\ngrav\nwhere g = 9.8m / s\n2, A = 4.0cm , ρ = 2.7 × 10\n3kg / m , t = 1.8 × 10\n-5 m , and n is the number of\nfoils. The balance just begins to tip when the torque from the magnetic force equals the torque\nfrom the aluminum weight. Since the moment arms are equal, the forces must also be equal,\nF\n= F2.\ngrav\nThus we have\n\nnρAtg = μ0n1n2 I\n2 r .\nd\nThis equation shows us that the current squared depends linearly on the number of foils\npresent, i.e.\nI\nρAtgd\n=\nn .\nμ0n1n2r\nThis is why you were asked to plot I2 vs. n. The slope of the I2 vs. n plot is given by\nslope = ρAtgd .\nμ0n1n2r\nThen from the best straight line fit of your data, you can calculate the magnetic permeability of\nspace using\nμ = 1 ( ρAtgd ) .\nslope n1n2r\nIn this experiment you depended on the multimeter calibration in amperes when you\nmeasured current. It is this very sort of experimental apparatus that was long used to define the\ncurrent unit, the ampere, in terms of geometry and mechanical forces, setting the constant μ0 in\nAmpere's law at exactly μ = 4π × 10\n-7 N A\n2 .\nYou can read your result backwards, so to speak. Find out what value your own\nmeasurements, using the ampere as the unit of current, yield for the constant μ0.\nApparatus\nThe wire coils are made by winding #26 enameled wire around a soda can. Before\nwinding, prepare the soda can by taping a sheet of paper around it -- this paper will help the wire\ncoil slide off the can. Then wind the wire around the can leaving about 8\" of wire at each end of\nthe coil. After making the coil, carefully slide it off the can. Then use a couple of pieces of tape\nto hold them in their round shape.\nFigures 1 and 2 above show the completed apparatus. Figures 4 through 6 provide a\ngeneral idea of how the balance is constructed. Begin by drawing 3 lines across the beam, one at\nthe center of the beam and the others at positions 1-1/2′′ from each end of the beam. Stick the T-\npins into the foam-core to make a pivot. Place and align each pin on the center line.\nUsing a line you marked on the beam as a guide, tape the lighter, ten-turn coil in place.\nCut the leads to the 10-turn coil to convenient lengths that will allow their ends to be wrapped\naround and soldered to the pins. Remove about 1/2′′ of the enamel insulation at the ends of the\nleads to the two coils. The enamel insulation on those wires is tenacious; folding a piece of\n\nemery cloth in half and drawing the wire through it will remove the insulation. Alternatively\nstrip off the enamel with your wire stripper. You will see a bright copper color when the\ninsulation has gone, but check with your ohmmeter to be sure. Wind the bare ends of the wire a\ncouple of turns around the pins. Solder the wires to the pins.\nFigure 4: wires soldered to pins\nFigure 5: Spacing between the 10-turn and 38-turn coils\nFigure 6: Lay out of coils on foam core and base\nUse double-sided sticky tape to hold the corner braces and the 38-turn coil to your desk.\nArrange things so the coils are parallel with the beam in its horizontal balanced position. The\ncoil end of the beam is much heavier than the other end. You can balance it by taping one or two\npennies, appropriately located, on the light end. As you tape the pennies into position, be careful\nnot to bear down on the beam while it's resting on the bearings: you'll distort the pin positions.\nRemember that the beam will start to swing slowly as it nears balance, and that sensitivity to a\nfew square centimeters of aluminum foil is quite good enough. (A square centimeter of the\naluminum foil provided has a mass of about 4.3 mg .) You can use a piece of aluminum foil or a\nsliver of tape for the final adjustment of balance. Later, it may help to make a stop out of\nwadded foil placed on the desk at the center of the bottom coil. Press down gently until the\n\nbeam is where you want it. In the experiment it will lift off when the unbalanced force of gravity\n(weight) just exceeds the magnetic force.\nIf the electrical path through the touching surfaces of pin and bearing appears erratic or\nintermittent, use emery cloth to clean the surfaces.\nExperiment\nDepending upon the winding direction of the coils, the current through them will\ngenerate magnetic forces such that the coils will either attract or repel each other causing them to\nmove. Exchanging the ends of one coil in the circuit will reverse the direction of the force\n(although reversing the direction of the current in both coils will not).\nConnect the following components in a series circuit as shown in the figure 7:\n-\nThe coil on the balance beam. (Connect it into your circuit by clipping alligator clips to\nthe corner braces.\n-\nThe other coil of the balance.\n-\nThe 8W filament of the 1157 bulb.\n-\nYour LVPS\n-\nThe piece of #16 alloy 800 resistance wire from your red box, a stiff shiny wire about\n1.3 mm in diameter with a resistance of1.02 Ω m .\n-\nConnect your MMM with the clips 0.2 m apart along the #16 resistance wire. You will\nmeasure the current flowing through the circuit by measuring the voltage across the\nresistance wire.\nFigure 7: Wiring diagram\n\nFigure 8: Experimental set-up\nPlug in the wall transformer of the LVPS; the lamp will tell you if current is flowing.\nAdjust the pot of the LVPS; the MMM should read on the 50μ(250mV) scale between 20 mV\nand 100 mV corresponding to currents from 0.1 A to 0.5 A .\nWhen you have things working, convince yourself that the balance can show the\nmagnetic effect, exchanging leads to see both attractive and repulsive forces.\nThe idea is to balance the magnetic force with the force of known masses of foil acting\non the balance. Several arrangements of the experiment's parameters are possible. The balance\ncan be set to attract or to repel, the current can be raised or lowered, and the weights can exert\ntheir force at either end of the beam. Think through how these setups vary and what might be\nthe advantages of one over the other.\nHaving the coils close together is a good idea; the magnetic force, whether attracting or\nrepelling, is strongest in that position. Also the coil spacing is easier to measure, and more\nreproducible, under those conditions. But should the coils be wired to repel or attract? Both\nways work. But the 'attraction' choice is preferable because once the coils start to separate the\nattractive forces are reduced in two ways simultaneously: by the lowered current and by the\nincreased separation of the coils.\nTaking Data\nSo turn the current up high. Set the coils to attract, and put weights, squares of aluminum\nfoil, on the line at the far end of the balance, but not enough to overcome the magnetic attraction.\nThen, bringing the current down slowly and as smoothly as you can, find the current where the\nreduced attraction lets the balance tip. Suitable weights are 2cm × 2cm squares of foil. Cut out\nthree weights of that size. Gentle tapping of the table may help overcome any tendency to stick.\nMake several measurements of the current at which the balance tips with all three\nweights. Then, remove one weight at a time and again measure the critical current. Repeat the\nmeasurements to make sure they are ok and tabulate the data, number of weights versus current.\n\nPlot the data with the number of weights, n , horizontally and current squared, I\nmeasured in [A\n2], vertically. If no weights were on your balance, and it balanced at zero current,\nthen the origin (0,0) is also a point. Fit a best straight line by eye. Estimate the slope and the\nerror on the slope. This can be done by taking the extremal (maximum and minimum) values of\nthe slope and computing the difference with the best fit slope.\nAnalyzing the Data\nFrom the best straight line fit of your data, you can calculate the magnetic permeability of\nspace using\nμ =\n( ρ At g d ).\nslope\nn1 n2 r\nError Analysis\nConsider the uncertainties in the quantities that appear in the slope: g , ρ, A, t , d , and\nr . Which error contributes the most? Which errors can you safely ignore?\nParts List\nRed Box\n1'\n800 wire\nlamp socket (#1157)\naluminum foil\nLVPST Test Kit\n#1157 tail lamp\nExperiment MF Parts Kit\n40 ft\n#26 enameled copper wire\n2′′ by 10′′ piece of foam core\nT-pins\n1′′ corner braces\npiece of double sided tape\n1 ft\n#22 red insulated stranded wire\n1 ft\n#22 black insulated stranded wire\n\nExperiment MF (Magnetic Force): Calculating the magnetic permeability\nIn your experiment, depending upon the winding direction of the coils, the current\nthrough them will generate magnetic forces such that the coils will either attract or repel each\nother causing them to move.\na) Is your apparatus set up to repel or attract? Briefly explain how you intend to measure the\ncurrent that flows through the coil that will produce a magnetic force that will just\nbalance the weight of the foil.\nb) What is the radius r of your coils? What is the distance d between your coils?\nc) You will measure the current that will produce a magnetic force that will just balance\none, two, and three squares of the foil. Suitable weights are 2 cm by 2 cm squares of foil.\nFor each number of weights, n, make several measurements of the current that balances\nthe weight. Average your values.\nd) Make a table of your data with columns for weight (in terms of the number of weights,\nn), the current, I , in [A], and the current squared , I\n2 , in [A\n2].\ne) Make a plot of the current squared I\n2 , in [A\n2], vertically vs. the weight (in terms of the\nnumber of weights, n) horizontally. If no weights were on your balance, and it balanced\nat zero current, then the origin is also a point.\nf) Use a linear regression to find the slope and intercept of a straight-line fit of your plot.\n(You may also find the best fit straight-line by eye.)\ng) Estimate the error on the slope. This can be done by taking the extremal (maximum and\nminimum) values of the slope and computing the difference with the best fit slope.\nh) Then from the best straight-line fit of your data, calculate the magnetic permeability of\nspace using\nμ =\n( ρ Atgd ),\nslope\nr\nn\nn 1\nwhere g = 8.9 m / s 2 , A is the area of your foil, ρ =\n7.2 × 10 kg / m is the density of\n-\naluminum, t =\n8.1 × 10 5 m is the thickness of the aluminum, n1 = 38 , n2 = 10 , r is the\nradius of your coils, and d is the separation between your coils.\nConsider the uncertainties in the quantities that appear in the slope: g , ρ , A, t , d , and r .\nWhich error contributes the most? Which errors can you safely ignore?\n\nProblem 1: Experiment Magnetic Force\nIn the magnetic force experiment, a current I = 0.5A is passed in series through a 38 turn\ncoil taped to a table and a 10 turn coil which is taped to a balance directly above the 38 turn coil.\nThe distance between the 10 turn coil and the 38 turn coil is d = 0.5cm . Each coil has a radius of\nr = 6.0cm .\na) Calculate the magnitude of the magnetic field originating from the 38 turn coil at any\npoint on the 10 turn coil. Clearly indicate any approximations you make.\nb) Calculate the magnitude of the magnetic field originating from both coils along the\ncentral axis at a height z = 0.5cm above the plane of the 38 turn coil. You may take this\npoint as the center of the 10 turn coil."
    },
    {
      "category": "Resource",
      "title": "2_06_2002_edited.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-02x-physics-ii-electricity-magnetism-with-an-experimental-focus-spring-2005/0795c1c28d5a7b18f1d2edd7923acb67_2_06_2002_edited.pdf",
      "content": "Feb 6 2002\nElectricity and Magnetism\n- The x in 8.02x\n- Course Organization\n- The Beginning\n\nFeb 6 2002\nFrom Amber to the Radio...\nNow\nObservation\nPhysical Law\n600 BC\nελεχτρον\n(amber)\nPrediction\nGalileo\n\nFeb 6 2002\nFrom Amber to the Radio...\nCoulomb\nGauss\nMaxwell\nGalileo\nFaraday\nHertz\nNow\n600 BC\nελεχτρον\n(amber)\n\nFeb 6 2002\n8.02x\nLecture Demos\nExperiments\n(me)\n(YOU!)\n\nFeb 6 2002\nLet's start from the beginning!\nNow\n600 BC\nελεχτρον\n(amber)"
    },
    {
      "category": "Resource",
      "title": "2_08_2002_edited.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-02x-physics-ii-electricity-magnetism-with-an-experimental-focus-spring-2005/ab284a05a4dc0bb7e4d9ef96f6cd3563_2_08_2002_edited.pdf",
      "content": "Feb 8 2002\nElectricity and Magnetism\ni.\ni. Recap: Electric Charge and\nElectrostatic Force\nii.\nFundamental Forces\ni.\nStrength and Range: Coulomb's Law\niii. Electrostatic Induction\n\nFeb 8 2002\ni. Recap: Electrostatic Force\n- New Property of Matter: Electric charge\n- comes in two kinds: '+' and '-'\n- connected to a force\n- Electrostatic Force\n- attractive (for '+-') or repulsive ('- -',\n`++')\n- Charge is conserved\n\nFeb 8 2002\nii. Fundamental Forces cntd.\n- How does the Electric force compare to\nthe other fundamental forces?\n- Gravity\n- Strong force (Atomic nuclei)\n- Weak force (Radioactivity, Star 'fuel')\n- How strong?\n- What Range?\n\nFeb 8 2002\nStrength\n10-7\n10-20\nWeak Force\nAtoms\nMolecules\nElementary Particles\nEarth\nSolar System\nFarthest\nGalaxy\nStrong Force\nAtomic Nuclei\n10-15\n10-10\n10-5\nElectric Force\nHuman\nGravity\n10-36\n\nFeb 8 2002\nSome Questions:\n- What determines the range of the\ninteraction?\n- How can one have 'Action at a distance'?\nIn-Class Demo\n\nFeb 8 2002\nModern View (>1930)\n- Interactions 'mediated' by exchange of\nparticles ('gauge bosons')\n- Weak interaction: Vector bosons (m large)\n- Strong interaction: Gluons (m=0)\n- Electric Force: Photons (m=0)\n- Gravity: Graviton (m=0)\n- For infinite range (e.g. Gravity,EM)\n- Exchanged particle must be massless!\n\nFeb 8 2002\nStrength of Electrostatic Force\n- How does it depend on charge?\n- How does it depend on distance?\nCharles Augustin de Coulomb\n(1736-1806)\nCoulomb's Law (1780)"
    },
    {
      "category": "Resource",
      "title": "2_11_2002_edited.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-02x-physics-ii-electricity-magnetism-with-an-experimental-focus-spring-2005/4c60171da92653f26eb3fffe1105f9fb_2_11_2002_edited.pdf",
      "content": "Feb 11 2002\nElectricity and Magnetism\n- Recap:\n- Fundamental Forces\n- E.S. Induction\n- Coulombs law (qualitative)\n- Coulombs Law (quantitative)\n- Induction (Demos)\n\nFeb 11 2002\nWhat we learned last time (II)\n- Strength of Electrostatic Force (qualitatively):\n- If distance gets larger, force gets weaker\n- If charge gets bigger, force gets stronger\n- Coulomb's Law (1780):\n- Electrostatic Induction\n- Force on (globally) neutral objects by\nredistributing balance of positive and negative\ncharges\n\nFeb 11 2002\nWhat we learned last time (I)\n- Four fundamental forces\n- Weak, Strong, Electromagnetic, Gravity\n- All mediated by Exchange Particles\n- Exchange particle for E.M. Force is Photon\n- mass m=0 -> Long Range\n- E.M. Force dominates from 10-10 to 1 m\n- E.M. Force is much stronger (x1035) than\nGravity\n\nFeb 11 2002\nToday\n- Study Coulomb's Law\n- Check 'Inverse square law' (F~1/r2)\nexperimentally\n- Superposition principle\n- What happens when there are many\ncharges?\n- 'Challenge' Demo on E.S. Induction\n- Summarize what we know about E.S.\n\nFeb 11 2002\nCoulomb's Law\nx\ny\nAngle α\nx2\nF21\nx1\nmg\n\nFeb 11 2002\nSuperposition principle\n- Just add the forces on Q1!\nQ3\nQ1\nQ2\nF12\nF13\nF1,total\n\nFeb 11 2002\nSuperposition principle\n- Just add the forces on Q1!\n- Works for arbitrary number of charges:\nF1 = Σ kQ1Qi/(ri/ri\n3)\n\nFeb 11 2002\nSuperposition principle\n- What to do for many, many charges?\n- 109 e- on glass rod...\n- Calculus makes life easier (for a change)!\n- Replace sum with integral!"
    },
    {
      "category": "Resource",
      "title": "2_13_2002_edited.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-02x-physics-ii-electricity-magnetism-with-an-experimental-focus-spring-2005/d0717984d77434e6ed80db1aed69b5ab_2_13_2002_edited.pdf",
      "content": "Feb 13 2002\nElectricity and Magnetism\n- Recap:\n- Confirmation of inverse square law\n- Superposition principle\n- Induction demo\n- Electric field\n\nx\ny\nAngle α\nx2\nmg\nF21\nx1\nQ: Is F21 ~ 1/r2 ?\nF21~x2\nr = x1+x2\nx2 ~ 1/(x1+x2 )2\nFeb 13 2002\nCheck:\nln(x2) ~ -2 ln(x1+x2 )\nln(x1+x2 )\nln(x2)\nSlope = -2!\n\nFeb 13 2002\nSuperposition principle\n- Just add the forces on Q1 (as vectors)\nQ3\nQ1\nQ2\nF12\nF13\nF1,total\n\nFeb 13 2002\nSuperposition principle\n- Just add the forces on Q1!\n- Works for arbitrary number of charges:\n\nFeb 13 2002\nSuperposition principle\n- What to do for many, many charges?\n- 109 e- on glass rod...\n- Replace sum with integral!\n\nFeb 13 2002\n3⁄4Two spheres, 1 ping-pong ball\n3⁄4All conducting, neutral\n\nFeb 13 2002\n3⁄4Approach with charged glass rod\n3⁄4Charges are induced on spheres\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n\nFeb 13 2002\n3⁄4Approach with charged glass rod\n3⁄4Charges are induced on spheres\n+\n+++\n++\n-\n-\n--\n-\n-\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n-\n-\n+\n+\n++\n+\n---\n\nFeb 13 2002\n3⁄4Net Force on ping-pong ball\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+++\n++\n++\n+\n-\n-\n--\n-\n-\n---\n-\n-\n+\n+\n\nFeb 13 2002\n3⁄4Net Force on ping-pong ball\n3⁄4Attracted to sphere 1\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+++\n++\n++\n+\n-\n-\n--\n-\n-\n---\nF\n-\n-\n+\n+\n\nFeb 13 2002\n3⁄4Ping-pong ball touches sphere 1\n3⁄4Picks up positive charge!\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n++\n+\n+ +\n+\n+\n+\n-\n-\n--\n-\n-\n-\n-\nF\n-\n-\n+\n+\n\nFeb 13 2002\n3⁄4Ping-pong now attracted to sphere 2\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n++\n+\n+\n-\n-\n--\n-\n-\n-\n-\n+\n+\n+ -\n-\n+\n+\nF\n\nFeb 13 2002\n3⁄4Ping-pong touches sphere 2\n3⁄4Picks up negative charge\n++\n+\n+\n+\n-\n-\n--\n-\n-\n-\n-\n- -\n+\n+\nF\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n\nFeb 13 2002\n3⁄4Each time, there's less charge to pick up\n3⁄4Eventually, process comes to a halt\n++\n+\n+\n+\n-\n-\n--\n-\n-\n-\n-\n- -\n+\n+\nF\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n\nFeb 13 2002\n3⁄4Now remove rod\n3⁄4Charge on 1 and 2 equal, opposite\n3⁄4Unstable equilibrium\n+\n-\n-- -\n-\n-\n-\n-\n++\n+\n+\n++\n\nFeb 13 2002\n3⁄4One side wins, attracts ball\n3⁄4Ball picks up charge -> Repulsion\n-\n--\n-\n-\n-\n-\n-\n+\n++\n+\n+\n++\nF\n\nFeb 13 2002\n3⁄4Touches other sphere\n3⁄4Continue until both spheres neutral\n+\n-\n--\n-\n- -\n+\n+\n+\n+\n++\nF\n\nFeb 13 2002\nThe Electric Field\n- What's a field?\n- How's the electric field defined?\n- Is it real?\n\nFeb 13 2002\nExample of Scalar Field\n- Each Location X connected to a Number: T(X)\n\nFeb 13 2002\nExample of Vector Field\n- Each Location X connected to a vector: v(X)\n\nFeb 13 2002\nThe Electric Field\nF(Q1,q,X1)\nF(Q1,q,X2)\nQ1\nF(Q1,q,X3)\nF(Q1,q,X0)\nq\nF(Q1,q,X4)\n\nFeb 13 2002\nThe Electric Field\n- Electric field is a Vector Field:\n- For each location x, E gives Force on a 'test\ncharge' q\n- We can say: Space around charge Q is\nmodified, such that 'test charge' q feels a\nforce F=Eq\nE(x) = F(x)/q\ndef\n\nFeb 13 2002\nThe Electric Field\n- Superposition principle for Forces\n- also true for Electric field (from Definition)\n- Field from many charges is vector sum of\nindividual fields\n- integral in limit of continous distributions\n\nFeb 13 2002\nVisualizing Fields\n- One way to do it\n- Color: Speed\n- Line orientation,\narrow: Direction\n\nFeb 13 2002\nVisualizing the Electric Field\n- Electric field 'lines'\n- Michael Faraday, 1791-1867\n- Cartoon of Strength and\nDirection of Field\n- Line Density: Strength\n- Line Orientation: Direction\n(for positive test charge q)"
    },
    {
      "category": "Resource",
      "title": "2_15_2002_edited.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-02x-physics-ii-electricity-magnetism-with-an-experimental-focus-spring-2005/6d95f57de45b1b7062e2fb644db8490f_2_15_2002_edited.pdf",
      "content": "Feb 15 2002\nElectricity and Magnetism\n- Electric field continued\n\nFeb 15 2002\nElectric Field\n- New concept - Electric Field E\n- Charge Q gives rise to a Vector Field\n- E is defined by strength and direction of\nforce on small test charge q\n\nFeb 15 2002\nElectric Field\n- For a single charge\n- Visualize using Field Lines\n- Cartoon!\n- Strength -> Density of Lines\n- Direction -> Direction of Lines\n- away from positive charges\n+Q\n\nFeb 15 2002\nElectric Field\n- Field can be used to accelerate charged\nparticles\nF = Q E\n-> Particle Accelerators\n\nFeb 15 2002\nThe Electric Field\n- Electric Field also exists is test charge q is not\npresent\n- We can say:\nThe charge Q gives rise to a property of\nspace itself - the Electric Field\n-> In-Class Demo...\n\nFeb 15 2002\nElectric Field Demo\n- Use a Van-der-Graaf Generator\n- Much more powerful than rubbing glass rods\n- Not really dangerous (I've been told) - but\npotentially painful\n- Creates large electric fields\n- Really big ones were used in Particle\nAccelerators (still in use in some labs)\n\nFeb 15 2002\n\nFeb 15 2002\nTorque τ = p x E\np = Q l Dipolemoment\n\nFeb 15 2002\nDoes Dipole feel a net Force?\nNo\nYes\n\nFeb 15 2002\nSuperposition Principle\n- Field of many charges is Vector Sum of\nindividual fields\n\nFeb 15 2002\nExample: Superposition principle for 3 charges\nx\ny\n+L\n-L\n+\n+\n+\nQ1\nQ2\nQ3\nx0\nE1\nE2\nE3\nr1\nr2\nr3\n)\n\nFeb 15 2002\nExample: Superposition principle for continous\ncharge distribution\nx\ny\n+L\n-L\nx0\nTotal Charge Q = 2 λ L\ndE\ndQ = λ dy\nr\n\nFeb 15 2002\nExample: Superposition principle for continous\ncharge distribution\nx\ny\n+L\n-L\nx0\nTotal Charge Q = 2 λ L\ndE\ndQ = λ dy\nr\n\nFeb 15 2002\nMore on Fields and Field Lines\n- What's wrong with this picture?\n- Magnitude and direction of field have to be\nunique at each point!\n- Field lines can't cross!\nE\n\nFeb 15 2002\nMore on Fields and Field Lines\n- Very close to surface of charged object\n- Field lines perpendicular to surface (if we go\nclose enough)!\n- Symmetry left and right (like an infinite plane)\n+ +\n+\n+\n+\n+\n+\n+\n+"
    },
    {
      "category": "Resource",
      "title": "2_19_2002_edited.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-02x-physics-ii-electricity-magnetism-with-an-experimental-focus-spring-2005/7cc97751d30454f05c0d5e42838b63f6_2_19_2002_edited.pdf",
      "content": "Feb 19 2002\nElectricity and Magnetism\n- Last time: Electric Field\n- Today:\n- Electric Flux\n- Gauss' Law\n\nFeb 19 2002\nGauss' Law\n- Today: Gauss' Law\n- Not so many demos, some math\n- Electricity and Magnetism in 4 equations:\n(1830)\n\nFeb 19 2002\nElectric Flux\n- Definition (simple case):\n- What does that mean?\n- Analogy with flow of e.g. water\nElectric Flux ΦE = E A\n\nFeb 19 2002\n'Flux' of water\nArea A\nVelocity v\nFlow: dV/dt = A dx/dt = Av\n\nFeb 19 2002\n'Flux' of water\nArea A\nα\nVelocity v\nFlow: Av cos(α) = A v\n\nFeb 19 2002\nElectric Flux\n- Electric Flux: ΦE = E A\n- Same mathematical form as water flow\n- But there is no 'substance' flowing\n- Took almost a century to accept\n- Flux tells us how much field 'passes' through\nsurface A\n\nFeb 19 2002\nElectric Flux\n- For 'complicated' surfaces:\n- Use integral\n- Often, 'closed' surfaces\n\nFeb 19 2002\nElectric Flux\n- Example of closed surface: Box\n- Flux in (left) = -Flux out (right): ΦE = 0\n- No 'source' of flux in this box\ndA\ndA\nE\n\nFeb 19 2002\nElectric Flux\n- How to make ΦE non-zero?\n- Remember:\n- Put Charge Q inside 'box'!\n+Q\n\nFeb 19 2002\nGauss' Law\n- How are flux and charge connected?\n- Charge Qencl as source of flux through closed\nsurface\n\nFeb 19 2002\nGauss' Law\n- Gauss vs Coulomb\n+Q\n\nFeb 19 2002\nGauss' Law\ndA\n+Q\n- Gauss vs Coulomb\n\nFeb 19 2002\nExample\n- Solid charged sphere (non-conducting)\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n++\n+\n+\n+\n+\n+\n+ +\n+\n+\nA1\nr0\n\nFeb 19 2002\nExample\n- Solid charged sphere (non-conducting)\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n++\n+\n+\n+\n+\n+\n+ +\n+\n+\nr0\nA2\n\nFeb 19 2002\nExample\n- Solid charged sphere (non-conducting)\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n++\n+\n+\n+\n+\n+\n+ +\n+\n+\nr0\nE\nr\nE~r\nE~1/r2\nr0\n\nFeb 19 2002\nExample II\n- Conducting Sphere\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\nE\nr\nE~1/r2\nr0\nE=0\nE=0\n\nFeb 19 2002\nExample IIa\n- Conducting Sphere\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n\nFeb 19 2002\nExample III\n- Line of Charge\nλ: Charge density dQ/dl\nl\n+\n+\n+\n+\n+\n+\n+ +"
    },
    {
      "category": "Resource",
      "title": "2_20_2002_edited.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-02x-physics-ii-electricity-magnetism-with-an-experimental-focus-spring-2005/06015ba0c4ce73e69f14f44a1714cfcd_2_20_2002_edited.pdf",
      "content": "Feb 20 2002\nElectricity and Magnetism\n- More on\n- Electric Flux\n- Gauss' Law\n\nFeb 20 2002\nMore on Electric Flux and\nGauss' Law\nMaxwell Equations\n(1873)\n\nFeb 20 2002\nElectric Flux\nElectric Flux ΦE = E A\nNote absence of '\n'\n'ΦE' is a Scalar: How much?\nI.e. how much field passes through surface A?\n\nFeb 20 2002\nA?\n- Direction\n- Normal to surface\n- Magnitude\n- Surface Area\n- For closed surface\n- Pointing outwards\n\nFeb 20 2002\nElectric Flux\n- What if E not constant on surface A?\n- Use integral\n- Often, 'closed' surfaces\n\nFeb 20 2002\nGauss' Law\n- Connects Flux through closed surface and\ncharge inside this surface:\nNote: k = 1/ 4 π ε0\n\nFeb 20 2002\nGauss' Law\n- True for ANY closed surface around Qencl\n- Suitable choice of surface A can make integral\nvery simple\n\nFeb 20 2002\nUse the Symmetry!\n+Q\nPoint Charge\ndA\n+Q\nSpherical Surface\n\nFeb 20 2002\nUse the Symmetry!\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n++\n+\n+\n+\n+\n+\n+ +\n+\n+\nr0\nSpherical Surfaces\nA1\nA2\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n++\n+\n+\n+\n+\n+\n+ +\n+\n+\nr0\nCharged Sphere\n\nFeb 20 2002\nUse the Symmetry!\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n++\n+\n+\n+\n+\n+\n+ +\n+\n+\nr0\nSpherical Surfaces\nA1\nA2\n\nFeb 20 2002\nUse the Symmetry!\nCharged Line\nCylindrical Surface\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+ +\n\nFeb 20 2002\nHollow conducting Sphere\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n\nFeb 20 2002\nLast example\n+\n+ + + + + +\n+\n+ + + + + +\n\nFeb 20 2002\nFaraday Cage\n+\n+\n+\n+\n+\n++\n+\n+\n+\nHV\n- -\n--\n-\nVan der Graaf Generator\nHollow Metal Sphere\nFigure by MIT OCW.\n\nFeb 20 2002\nFaraday Cage\n+\n+\n+\n+\n+\n+\n++\n+\nVan der Graaf Generator\nHollow Metal Sphere\nLarge E; E~1/r2\nFigure by MIT OCW.\n\nFeb 20 2002\n'Challenge' In-Class Demo"
    },
    {
      "category": "Resource",
      "title": "2_22_2002_edited.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-02x-physics-ii-electricity-magnetism-with-an-experimental-focus-spring-2005/9421a9acc54f57b71a0b95f298f0dbec_2_22_2002_edited.pdf",
      "content": "Feb 22 2002\nElectricity and Magnetism\n- Today\n- Kelvin Water Drop Generator\n- Electric Potential Energy\n- Electric Potential\n\nRecap: In-Class Demos\n- No field inside\n- No charge on\ninside surface\n+\n+\n+\n+\n+\n+\n++\n+\nVan der Graaf Generator\nLarge E; E~1/r2\nFaraday Cage\nFigure by MIT OCW.\n\nFeb 22 2002\nKelvin Water Drop Generator\nWater pipe\nMetal can\n- No battery, motor,\nanything...\n- Start water flow\n- Water 'flares out'\n- like tinsel\n- Spark!\n- Cycle repeats...\nMetal Bucket\n\nFeb 22 2002\nPuzzles\n- Spark\n- Spheres have opposite charge\n- Asymmetry!\n- But apparatus is symmetric!?\n- Where does the energy come from?\n\nFeb 22 2002\nKelvin Water Drop Generator\nWater pipe\nMetal can\nMetal Bucket\n\nFeb 22 2002\nKelvin Water Drop Generator\nWater pipe\nMetal can\n+\nSymmetry is broken\nby Fluctuation\n+\nMetal Bucket\n\nFeb 22 2002\nKelvin Water Drop Generator\nWater pipe\nMetal can\n+\n+\n+\n-\n-\n+\n+\n-\n+\n-\n-\n-\n+\nMetal Bucket\n\nFeb 22 2002\nKelvin Water Drop Generator\nWater pipe\nMetal can\n+\n+\n+\n+\n-\n-\n+\n+\n-\n+\n-\n-\n+\n+\n+\n--\n-\n-\n-\n-\n--\n-\n-\nPositive Feedback\nLoop\n+\n+\n-\n+\n+\n+\n+\n+\n+\n+\n+\n+\n--\n----\n--\nMetal Bucket\n\nFeb 22 2002\nKelvin Water Drop Generator\nWater pipe\nMetal can\nSpark neutralizes\nsystem\nMetal Bucket\n\nFeb 22 2002\nFinal question\n- Spark is like a small lightning\n- contains energy (like lightning)!\n- Where does this energy come from?\n- Where was it before the spark?\nGravitational potential energy of water\n(Epot = m g h)\n\nFeb 22 2002\nElectric Potential Energy\n- Massive objects in Gravitational Field\nhave potential energy\n- What about charged objects in E-Field?\n- Let's review some concepts from\n8.01x....\n\nFeb 22 2002\nWork and Potential Energy\nx\nxa\nb\ndl\nF(l)\nNote: In general, F || dl\nExample\n\nFeb 22 2002\nWork and Potential Energy\nx\nxa\nb\ndl\nF(l)\nWork:\nα\n\nFeb 22 2002\nWork and Potential Energy\nx\nxa\nb\n(1)\n(2)\n(3)\nConservative Force:\nWba independent of path\nWba\n(1)= Wba\n(2)= Wba\n(3)= Wba\n\nFeb 22 2002\nWork and Potential Energy\n- IF F conservative:\n- Define Potential Energy\ny\na\nb\ndl\nF(l)\nExample - Gravity\n\nFeb 22 2002\nWork and Electrostatic Force\n+Q\nb\na\n+q\nCharge q at point a\nin Coulomb field of Q\nHow much work to\nmove to point b?\n\nFeb 22 2002\nIs FES conservative?\n+Q\nb\na\ni.e. is Wab\n(1)= Wab\n(2) ?\n(1)\n(2)\n+q\n\nFeb 22 2002\nIs FES conservative?\n+Q\na\ndl\nr\n+q\nα\nb\n\nFeb 22 2002\nElectric Potential Energy\n- Found Potential Energy associated with\nElectric Force between two charges\n- Can only observe differences in potential\n- often set U( ) = 0\n- U(r) energy needed to bring q,Q together\nfrom infinity\n\nFeb 22 2002\nElectric Potential\n- Electric Potential Energy proportional to q\n- Again, define\n- Electric Potential V:\n- Units are Volt [V] = [J/C]\nV = U/q\n\nFeb 22 2002\nElectric Potential for many\ncharges\n- Superposition principle....\n- Sum of scalars, not vectors!\n- Integral for continous distributions\nV(r) = Σ1/(4πε0) Qi/ri\n\nFeb 22 2002\nElectric Potential for many\ncharges\n- Electric potential depends on charges that\ncreate field, not the test charge!\n- V tells us how much energy a charged\nobject can aquire when moving from a to b\nV(r) = Σ1/(4πε0) Qi/ri\n\nFeb 22 2002\nElectrical potentials\n- Battery: 1.5 V\n- Power outlet: 120 V\n- HV power line: 106 V\n- Accelerators: 108 V\n- Thunderstorm: 108 V"
    },
    {
      "category": "Resource",
      "title": "2_25_2002_edited.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-02x-physics-ii-electricity-magnetism-with-an-experimental-focus-spring-2005/b6ac1c35f06ba38a91f18a508d15f834_2_25_2002_edited.pdf",
      "content": "Feb 25 2002\nElectricity and Magnetism\n- Today\n- Electric Potential Energy\n- Electric Potential\n- Example of calculation\n- Practical applications\n- Conductors, Isolators and Semi-Conductors\n\nFeb 25 2002\nRecap\n- Work in the Electrostatic Field\n- Electrostatic Potential Energy\n- Electrostatic Potential\n\nFeb 25 2002\nWork and Electrostatic Force\n+Q\nb\na\n+q\nCharge q at point a\nin Coulomb field of Q\nHow much work to\nmove to point b?\n\nFeb 25 2002\n+Q\na\ndl\nr\n+q\nα\nb\nFES is conservative!\n\nFeb 25 2002\nElectric Potential Energy\n- Note: What we used was the fact that\nCoulomb Force is radial (i.e. F || r)\n- all radial forces are conservative (e.g.\nGravity)\n\nFeb 25 2002\nElectric Potential Energy\n- Potential Energy for two charges\n- Can only observe differences in potential\n- often set U( ) = 0 or U(earth) = 0\n- U(r) energy needed to bring q,Q together\nfrom infinity\n\nFeb 25 2002\nElectric Potential\n- Electric Potential Energy proportional to q\n- Define V = U/q\n- Electric Potential V:\n- Units are Volt [V] = [J/C]\nV = U/q\n\nFeb 25 2002\nElectric Potential\n- Note: because V = U/q -> U = V q\n- for a given V, U can be positive or negative,\ndepending on sign of q\n- Example: Single Charge\n\nFeb 25 2002\nElectric Potential for many\ncharges\n- Superposition principle....\n- Sum of scalars, not vectors!\n- Integral for continous distributions\nV(r) = Σ1/(4πε0) Qi/ri\n\nFeb 25 2002\nElectric Potential for many\ncharges\n- Electric potential depends on charges that\ncreate field, not the test charge!\n- V tells us how much energy a charged\nobject can aquire when moving from a to b\nV(r) = Σ1/(4πε0) Qi/ri\n\nFeb 25 2002\nElectrical potentials\n- Battery: 1.5 V\n- Power outlet: 120 V\n- HV power line: 106 V\n- Accelerators: 108 V\n- Thunderstorm: 108 V\n\nFeb 25 2002\nExample: Capacitor plates\n- Deposite opposite charges on\nplates\n- What is the Electric Potential?\n- What does E look like?\n- Move charge +q from a to b\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n-\n-\n-\n--\n-\n-\n--\n-\n-\nb\na\n+q\nxa\nxb\nxa\nxb\nx=0\nx\nx=d\n\nFeb 25 2002\nExample: Capacitor plates\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n-\n-\n-\n--\n-\n-\n--\n-\n-\nb\na\n+q\nxa\nxb\nx=0\nx\nx=d\n\nFeb 25 2002\nExample: Capacitor plates\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n-\n-\n-\n--\n-\n-\n--\n-\n-\nb\na\n+q\nxa\nxb\nx\nV(x)\nx\nx=0\nx\nU(x,q)\nq>0\nq<0\nx=d\n\nFeb 25 2002\nDemo: Ping-Pong Ball\n++\n+\n--\n-\n-\n-\n-\n--\n-\n-\n--\n-\n-\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\nq>0\n\nFeb 25 2002\nDemo: Ping-Pong Ball\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n-\n-\n-\n--\n-\n-\n--\n-\n-\nq>0\n+\n+\n+\n+\n+\nx\nV(x)\nx\nx\nU(x,q)\nq>0\n\nFeb 25 2002\nDemo: Ping-Pong Ball\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n-\n-\n-\n--\n-\n-\n--\n-\n-\nq<0\nx\nV(x)\nx\nx\nU(x,q)\n- -\n- --\n\nFeb 25 2002\nDemo: Ping-Pong Ball\n- Field not perfectly uniform:\n- Net Force on Dipole\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n-\n-\n-\n--\n-\n-\n--\n-\n-\n++\n+\n--\n-\nx\nV(x)\n\nFeb 25 2002\nTrick question: Why does it start?\nx\nV(x)\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n-\n-\n-\n--\n-\n-\n--\n-\n-\n++\n+\n--\n-\nSlope dV/dx~ E ~ F !\n\nFeb 25 2002\nApplications\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n-\n-\n-\n--\n-\n-\n--\n-\n-\n+q\nVelocity v\nd\n- Energy for single particle\n(e.g. electron) small\n- Often measured in\n'Electron Volt' [eV]\n- Energy aquired by\nparticle of charge 10-19 C\ngoing through ∆V=1V\n- Independent of d\n\nFeb 25 2002\nApplications\nRelativistic Heavy Ion Collider\nCathode Ray Tube\nRHIC\n∆V\nEkin ~ 10 keV (104eV)\nEkin ~ 100 GeV (1011eV)\n\nFeb 25 2002\nConductors\n- Important for next few weeks\n- Electrical Circuits\n- Why are some materials conductive?\n- All materials contain electrical charges!\n\nFeb 25 2002\nConductivity\nMicroscopic view\nMetal: e- can move around freely\nU(x)\ne-\nx\nx\nInsulator: e- stuck in place\nU(x)\ne-\n\nFeb 25 2002\nConductivity\nx\nU(x)\ne-\n- How can we get charges 'unstuck'?\n- Give them enough energy to jump out of\npotential wells\n\nFeb 25 2002\nIn-Class Demo\nCharged Ions\n+\n++\n+\n+\n+\n++\n+\n+\n+\n++\nElectroscope\n\nFeb 25 2002\nIn-Class Demo\nIons discharge\nElectroscope\nCharged Ions\n+\n+\n+\n+\n+\n+\n+\n+\nElectroscope\n\nFeb 25 2002\nImportant application\nx\nU(x)\n∆U ~ 0.5 eV\n- Semi-conductor\n- # of charges controllable (by T and V)\n- At T=0oC Ekin ~ 1/40 eV\n- Basis of all Electronic Circuits (e.g. Computers)\n\nFeb 25 2002\nConductivity\n- Note: Usually, charge carried by\nelectrons, but not always\n- 'holes' (i.e. missing electrons) in semi-\nconductors\n\nFeb 25 2002\nConductors\n- E = 0 inside\n- otherwise charges would move\n- No charges inside\n- Gauss\n- E perpendicular to surface\n- otherwise charges on surface would move\n- Potential is constant on conductor\n\nFeb 25 2002\nConductors\n- Potential is constant on conductor"
    },
    {
      "category": "Resource",
      "title": "2_27_2002_edited.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-02x-physics-ii-electricity-magnetism-with-an-experimental-focus-spring-2005/5c48da61d3532b22af63ad3792b99f6b_2_27_2002_edited.pdf",
      "content": "Feb 27 2002\nElectricity and Magnetism\n- Review\n- Electric Charge and Coulomb's Force\n- Electric Field and Field Lines\n- Superposition principle\n- E.S. Induction\n- Electric Dipole\n- Electric Flux and Gauss' Law\n- Electric Potential Energy and Electric Potential\n- Conductors, Isolators and Semi-Conductors\n\nFeb 27 2002\nToday\n- Fast summary of all material so far\n- show logical sequence\n- help discover topics to refresh for Friday\n\nFeb 27 2002\nElectric Charge and\nElectrostatic Force\n- New Property of Matter: Electric Charge\n- comes in two kinds: '+' and '-'\n- Connected to Electrostatic Force\n- attractive (for '+-') or repulsive ('- -', `++')\n- Charge is conserved\n- Charge is quantized\n\nFeb 27 2002\nStrength\n10-7\n10-20\nWeak Force\nAtoms\nMolecules\nElementary Particles\nEarth\nSolar System\nFarthest\nGalaxy\nStrong Force\nAtomic Nuclei\n10-15\n10-10\n10-5\nElectric Force\nHuman\nGravity\n10-36\n\nFeb 27 2002\nCoulomb's Law\n- Inverse square law (F ~ 1/r2)\n- Gives magnitude and direction of Force\n- Attractive or repulsive depending on\nsign of Q1Q2\n\nFeb 27 2002\nCoulomb's Law\nQ1\nF12\nr21\nr21\nQ2\n\nFeb 27 2002\nCoulomb's Law\nQ1\nQ2\nF12\nr21\nr21\nF12 = - F 21\n\nFeb 27 2002\nSuperposition principle\nQ1\nQ2\nF12\nQ3\nF13\nF1,total\n- Note:\n- Total force is given by vector sum\n- Watch out for the charge signs\n- Use symmetry when possible\n\nFeb 27 2002\nSuperposition principle\n- If we have many, many charges\n- Approximate with continous distribution\n- Replace sum with integral!\n\nFeb 27 2002\nElectric Field\n- New concept - Electric Field E\n- Charge Q gives rise to a Vector Field\n- E is defined by strength and direction of\nforce on small test charge q\n\nFeb 27 2002\nThe Electric Field\n- Electric Field also exists is test charge q is not\npresent\n- The charge Q gives rise to a property of space\nitself - the Electric Field\n- For more than one charge -> Superposition\nprinciple\n\nFeb 27 2002\nElectric Field\n- For a single charge\n- Visualize using Field Lines\n+Q\n\nFeb 27 2002\nField Lines\n- Rules for field lines\n- Direction: In direction of E at each point\n- Density: Shows magnitude of E\n- Field Lines never cross\n- From positive to negative charge\n- i.e. show direction of force on a positive charge\n- Far away: Everything looks like point charge\n\nFeb 27 2002\nElectric Dipole\nTorque τ = p x E\np = Q l Dipole moment\n\nFeb 27 2002\nElectrostatic Induction\n- Approach neutral object with\ncharged object\n- Induce charges (dipole)\n- Force between charged and\nglobally neutral object\n+\n+++\n++\n-\n-\n--\n-\n-\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n\nFeb 27 2002\nElectric Flux\n- Electric Flux: ΦE = E A\n- Same mathematical form as water flow\n- No 'substance' flowing\n- Flux tells us how much field 'passes' through\nsurface A\n\nFeb 27 2002\nElectric Flux\n- For 'complicated' surfaces and non-constant E:\n- Use integral\n- Often, 'closed' surfaces\n\nFeb 27 2002\nElectric Flux\n- Example of closed surface: Box (no charge inside)\n- Flux in (left) = -Flux out (right): ΦE = 0\ndA\ndA\nE\n\nFeb 27 2002\nGauss' Law\n- How are flux and charge connected?\n- Charge Qencl as source of flux through closed\nsurface\n\nFeb 27 2002\nGauss' Law\n- True for ANY closed surface around Qencl\n- Relates charges (cause) and field (effect)\n\nFeb 27 2002\nGauss' Law\n- Different uses for Gauss' Law\n- Field E -> Qencl (e.g. conductor)\n- Qencl -> Field E (e.g. charged sphere)\n- Proper choice of surface - use symmetries\n\nFeb 27 2002\nHollow conducting Sphere\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n\nFeb 27 2002\nGauss' Law\ndA\nQ\n- Charge Sphere radius r0, charge Q, r > r0\nr0\nr\nQencl = Q\n\nFeb 27 2002\nGauss' Law\n- Most uses of Gauss' Law rely on simple\nsymmetries\n- Spherical symmetry\n- Cylinder symmetry\n- (infinite) plane\n- and remember, E = 0 in conductors\n\nFeb 27 2002\nWork and Potential Energy\nx\nxa\nb\ndl\nF(l)\nWork:\nα\nConservative Force:\nPotential Energy\n\nFeb 27 2002\nElectric Potential Energy\n- Electric Force is conservative\n- all radial forces are conservative (e.g. Gravity)\n- We can define Electric Potential Energy\nF\n\nFeb 27 2002\nExample: Two charges\nQ\nq\nr\n- If q,Q same sign:\n- U > 0; we have to do work 'pushing'\ncharges together\n- If q,Q unlike sign:\n- U < 0; Electric force does work 'pulling'\ncharges together\n\nFeb 27 2002\nElectric Potential\n- Electric Potential Energy proportional to q\n- Define V = U/q\n- Electric Potential V:\n- Units are Volt [V] = [J/C]\n\nFeb 27 2002\nElectric Potential\n- Note: because V = U/q -> U = V q\n- for a given V: U can be positive or negative,\ndepending on sign of q\n- V :Work per unit charge to bring q from a to b\n- Ex.: Single Charge\n\nFeb 27 2002\nElectric Potential for many\ncharges\n- Superposition principle....\n- Sum of scalars, not vectors!\n- Integral for continous distributions\nV(x) = Σ1/(4πε0) Qi/ri\n\nFeb 27 2002\nExample: Three charges\nQ2\nQ1\nx\nQ3\nr1\nr2\nr3\nV(x) = Σ1/(4πε0) Qi/ri\n\nFeb 27 2002\nExample: Capacitor plates\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n-\n-\n-\n--\n-\n-\n--\n-\n-\nb\na\n+q\nxa\nxb\nx=0\nx\nx=d\n\nFeb 27 2002\nExample: Capacitor plates\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n-\n-\n-\n--\n-\n-\n--\n-\n-\nb\na\n+q\nxa\nxb\nx\nV(x)\nx\nx=0\nx\nU(x,q)\nq>0\nq<0\nx=d\n\nFeb 27 2002\nApplications\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n-\n-\n-\n--\n-\n-\n--\n-\n-\n+q\nVelocity v\nd\n- Energy for single particle\n(e.g. electron) small\n- Often measured in\n'Electron Volt' [eV]\n- Energy aquired by\nparticle of charge 10-19 C\ngoing through ∆V=1V\n\nFeb 27 2002\nConductors\n- E = 0 inside\n- otherwise charges would move\n- No charges inside\n- Gauss\n- E perpendicular to surface\n- otherwise charges on surface would move\n- Potential is constant on conductor"
    }
  ]
}