{
  "course_name": "Physics III: Vibrations and Waves",
  "course_description": "Vibrations and waves are everywhere. If you take any system and disturb it from a stable equilibrium, the resultant motion will be waves and vibrations. Think of a guitar string—pluck the string, and it vibrates. The sound waves generated make their way to our ears, and we hear the string’s sound. Our eyes see what’s happening because they receive the electromagnetic waves of the light reflected from the guitar string, so that we can recognize the beautiful sinusoidal waves on the string. In fact, without vibrations and waves, we could not recognize the universe around us at all!\n\nThe amazing thing is that we can describe many fascinating phenomena arising from very different physical systems with mathematics. This course will provide you with the concepts and mathematical tools necessary to understand and explain a broad range of vibrations and waves. You will learn that waves come from many interconnected (coupled) objects when they are vibrating together. We will discuss many of these phenomena, along with related topics, including mechanical vibrations and waves, sound waves, electromagnetic waves, optics, and gravitational waves.",
  "topics": [
    "Science",
    "Physics",
    "Atomic, Molecular, Optical Physics",
    "Classical Mechanics",
    "Electromagnetism",
    "Science",
    "Physics",
    "Atomic, Molecular, Optical Physics",
    "Classical Mechanics",
    "Electromagnetism"
  ],
  "syllabus_content": "« [Previous](/courses/8-03sc-physics-iii-vibrations-and-waves-fall-2016/) |\nNext\n»\n\nPrerequisites\n\n18.02 Multivariable Calculus\nand\n8.02 Electricity and Magnetism\n.\n\nThis course is designed for students who are already familiar with the concepts taught in\n8.01 Classical Mechanics\nas well as\n8.02 Electricity and Magnetism\n. We also rely on fundamental mathematics principles taught in\n18.01 Single Variable Calculus\nand\n18.02 Multivariable Calculus\n, as well as some aspects of\n18.06 Linear Algebra\n.\n\nCourse Overview\n\nWhat are vibrations? Many physical systems vibrate or oscillate when something disrupts their equilibrium. Think of what happens when you pull a mass attached to a spring or push a pendulum in a certain direction. The mass bounces up and down. The pendulum swings back and forth. But even these simple phenomena can respond in complicated and counterintuitive ways when subjected to forces known in physics as damping and driving. Combining several pendulums or springs can lead to even more unexpected motions. In this course you will see how physics can describe these motions mathematically.\n\nExtended physical systems that have been made to vibrate, like a string on a guitar, cannot return to their state of equilibrium without exerting forces on the area around them. These forces then lead to the phenomenon of waves, disturbances that propagate through a medium. The vibrating guitar string causes a sound wave to propagate through the medium of the air.\n\nAmong the most fascinating phenomena examined in the course are electromagnetic (EM) waves. EM waves have many properties similar to the waves we experience in everyday life, but the underlying physics of EM waves is profoundly different. Instead of a local disturbance exerting a force on adjoining regions, changing magnetic fields create electric fields (as quantified by Faraday's Law), and changing electric fields create magnetic fields (as quantified by Maxwell's extension of Ampere's Law).\n\nCourse Goals\n\nThis course has two complementary goals. The first is to provide you with the concepts and mathematical tools necessary to understand and explain a broad range of vibrations and waves. This will allow you to gain a deeper appreciation for the true nature and beauty of phenomena like music and rainbows, which all of us observe or experience every day.\n\nThe second goal is to provide you with the skill of using a broad range of techniques that can greatly simplify the analysis and solution of complex systems. These techniques include complex numbers, combinations of oscillatory and exponentially decaying functions, resonance, normal modes, Cramer's rule for solving several equations in several variables, boundary conditions, general wave equations, Fourier decomposition, dispersive and non-dispersive media, phase and group velocities, sound cavities and wave guides, polarization, Doppler effect, reflection and refraction, Fresnel's equation for transmission and reflection, total internal reflection, constructive and destructive interference, and diffraction.\n\nCourse Format and Components\n\nThis OCW Scholar course is based upon Professor Yen-Jie Lee's\n8.03 Physics III: Vibrations and Waves\ncourse as taught on the MIT campus. It includes a complete set of 24 video lectures recorded at MIT in the Fall of 2016. Additional materials have been developed specifically for this OCW Scholar course, including:\n\nLecture Notes aligned with the lecture videos\n\nProblem Sets (no solutions)\n\nProblem Solving Help Videos providing step-by-step solutions to sample problems\n\nExams with Solutions\n\nMIT students spend about 150-200 hours learning Vibrations and Waves in the on-campus version of this course. That number comes from a combination of attending lectures and recitations, and studying independently. It's difficult to estimate how long it will take you to complete all of the modules in this particular course, but you can probably expect to spend 3 to 4 hours on practice problems, readings and assessment for each hour of lecture video you watch.\n\nRequired Textbook\n\nGeorgi, Howard.\nThe Physics of Waves\n. Benjamin Cummings, 1992. ISBN: 9780136656210.\nDownload the book (PDF - 5.5MB)\n(Courtesy of Howard Georgi. Used with permission.)\n\nSuggested References\n\nFrench, A. P.\nVibrations and Waves\n. New York: W.W. Norton, 1980. ISBN: 9780393099362.\n\nBekefi, George, and Alan H. Barrett.\nElectromagnetic Vibrations, Waves, and Radiation\n. MIT Press, 1977. ISBN: 9780262520478. [Preview with\nGoogle Books\n]\n\n« [Previous](/courses/8-03sc-physics-iii-vibrations-and-waves-fall-2016/) |\nNext\n»",
  "files": []
}