{
  "course_name": "Physics I: Classical Mechanics",
  "course_description": "No description found.",
  "topics": [
    "Science",
    "Physics",
    "Classical Mechanics",
    "Science",
    "Physics",
    "Classical Mechanics"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nRecitations: 2 sessions / week, 1 hour / session\n\nCourse Description\n\nPhysics 8.012 is the advanced version of first-year Classical Mechanics. This course covers the same material as 8.01 and 8.01L, but at a faster pace and in slightly more depth. 8.012 is intended for those students with a strong mathematical background (mastery of single-variable calculus and vector algebra) and interest in physics. This course provides the best preparation for upper level courses, in particular 8.03 Physics III and 8.09 Classical Mechanics III.\n\nThe main topics in the class are: Vectors, Kinematics, Forces, Motion, Momentum, Energy, Angular Motion, Angular Momentum, Gravity, Planetary Motion, Moving Frames, and the Motion of Rigid Bodies.\n\nRequired Textbook\n\nKleppner, Daniel, and Robert J. Kolenkow.\nAn Introduction to Mechanics\n. New York, NY: McGraw-Hill, 1973. ISBN: 9780070350489.\n\nProblem Sets\n\nHomework problem sets will be assigned weekly. Students are encouraged to freely discuss homework problems with other students. However, you must write up your solutions completely on your own. Do not copy solutions from other students. Do not consult solutions from previous years or from the Web.\n\nProblem sets will be graded on correctness, but all work must be shown. Problems answered with only the correct answer and no work will receive no credit. Partial credit for showing work without a correct answer will be given at the discretion of the grader.\n\nExams\n\nThere will be three midterm exams given during the course of the semester. There will also be a comprehensive final exam. No books, notes, calculators, computers, cell phones, or other study aides are permitted in the exam. You will be provided with a list of helpful equations for each exam.\n\nGrading\n\nYour grade will be based on weekly homework problem sets, exams (3 midterms and a final), in-class concept tests, and a class project.\n\nACTIVITIES\n\nPERCENTAGES\n\nDETAILS\n\nHomework\n\n25%\n\n1 assignment per week\n\nIn-lecture concept tests\n\n5%\n\n~1-2 per lecture\n\nProject\n\n5%\n\nMidterm exams\n\n45%\n\n3 exams, each counting 15%\n\nFinal exam\n\n20%",
  "files": [
    {
      "category": "Assignment",
      "title": "Problem Set 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-012-physics-i-classical-mechanics-fall-2008/9f7e6c47cbd960c7232d163f31cfdaa8_ps1.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n8.012 Physics I: Classical Mechanics\nFall 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nMASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Physics\nPhysics 8.012: Physics (Mechanics) I\nFall Term 2008\nPROBLEM SET 1\nCollaboration policy: You are encouraged to freely discuss homework problems with other 8.012\nstudents and teaching staff. However, you must write up your solutions completely on your\nown--do not simply copy solutions from other students. You are forbidden from consulting\nsolutions from previous years or from the web. Violations of this policy may result in\ndisciplinary action.\nReading: Kleppner & Kolenkow, Chapters 1 and 2\n0. Collaboration and discussion. Please list the names of all the students with whom you\ndiscussed these homework problems. Also be sure to write down your name and recitation\nsection clearly on the first page.\n1. Kleppner & Kolenkow, Problem 1.2 (5 points)\n2. Kleppner & Kolenkow, Problem 1.7 (10 points)\n3. Kleppner & Kolenkow, Problem 1.12 (10 points)\n4. Kleppner & Kolenkow, Problem 1.13 (10 points)\n5. Kleppner & Kolenkow, Problem 1.14 (5 points)\n6. Kleppner & Kolenkow, Problem 1.15 (10 points)\n7. Kleppner & Kolenkow, Problem 1.18 (10 points)\n8. Kleppner & Kolenkow, Problem 1.20 (10 points)\nNote that \"radial\" and \"tangential\" accelerations correspond to the ˆr and θˆ components of\n~a.\nContinued on next page...\n\n9. Two Trains and a Bee. (15 points)\nConsider two trains moving in opposite directions on the same track. The trains start simul\ntaneously from two towns, Aville and Bville, separated by a distance d. Each train travels\ntoward each other with constant speed v. A bee is initially located in front of the train in\nAville. As the train departs Aville, the bee travels with speed u > v along the track towards\nBville. When it encounters the second train, it instantaneously reverses direction until it\nencounters the first train, then it reverses again, etc. The bee continues flying between the\ntwo trains until it is crushed between the trains impacting each other. The purpose of this\nproblem is to compute the total distance flown by the bee until it is crushed. Assume that\nthe bee is faster than the trains.\nThere are at least two good ways to solve this problem. One is to compute the distance for\neach flight leg and sum the resulting series. There is also another way to solve the problem\nwith very little calculation. You are to do it both ways.\n(a) (10 points) Find an expression for the distance dn covered by the bee after its nth\nencounter with a train. Define d0 as the distance traveled during the first flight from\nAville towards the train near Bville, d1 the distance traveled by the bee during the first\ntrip from the Bville train to the Aville train, etc. Sum the resulting series to get the\nfinal answer.\n(b) (5 points) Devise another way to obtain the same answer using very little calculation.\n10. Dimensional Analysis. (15 points)\nYou can often derive the solution of a problem by considering the dimensions of the rele\nvant variables, including all related fundamental constants, and match the dimensions of the\nquantity you want to determine. This is called dimensional analysis, and it is a powerful ap\nproximation technique as well as a method of determining how quantities scale with different\nvariables. The basic idea is to write the unknown quantity (X) as a factor of all your relevant\nvariables (Vn) and constants (Cn):\nX = V1\naV2\nbV3\ncC1\ndC2\ne ...\n(1)\nand then solve for the powers a, b, c, d, e, ... so that the dimensions on both sides of the\nequation work out.\n(a) (3 points) Derive an expression for the vibration frequency of a star of mass M and\nradius R, if that vibration is caused by gravitational instabilities.\n(b) (4 points) Derive an expression for the drag force on a ball of radius R and mass M\nmoving with velocity v through a medium with mass density ρ.\n(c) (4 points) Derive an expression for the terminal velocity of a falling ball of radius R and\nmass M close to the surface of the Earth, when it experiences a drag force of the form\nF = bv2 . Can you find an alternate way of deriving this velocity?\n(d) (4 points) Derive an expression for the frequency of a pendulum of mass M, hanging\nfrom a rope of length L near the surface of the Earth, released from rest at an initial\nangle θ0. Warning! θ0 is dimensionless. Is it possible to constrain how the frequency\ndepends on this variable?"
    },
    {
      "category": "Assignment",
      "title": "Problem Set 2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-012-physics-i-classical-mechanics-fall-2008/cfc1b9fd7a9e9308b3141831ebf47b87_ps2.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n8.012 Physics I: Classical Mechanics\nFall 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nMASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Physics\nPhysics 8.012: Physics (Mechanics) I\nFall Term 2008\nPROBLEM SET 2\nCollaboration policy: You are encouraged to freely discuss homework problems with other 8.012\nstudents and teaching staff. However, you must write up your solutions completely on your\nown--do not simply copy solutions from other students. You are forbidden from consulting\nsolutions from previous years or from the web. Violations of this policy may result in\ndisciplinary action.\nReading: Kleppner & Kolenkow, Chapter 2\n0. Collaboration and discussion. Please list the names of all the students with whom you\ndiscussed these homework problems.\n1. Kleppner & Kolenkow, Problem 2.1 (5 points) NOTE- The mass starts from rest.\n2. Kleppner & Kolenkow, Problem 2.3 (5 points)\n3. Kleppner & Kolenkow, Problem 2.5 (5 points)\n4. Kleppner & Kolenkow, Problem 2.7 (10 points)\n5. Kleppner & Kolenkow, Problem 2.9 (10 points)\n6. Kleppner & Kolenkow, Problem 2.11 (10 points)\n7. Kleppner & Kolenkow, Problem 2.12 (5 points)\n8. Kleppner & Kolenkow, Problem 2.15 (10 points)\n9. Kleppner & Kolenkow, Problem 2.17 (10 points) NOTE- The constraints should be tan θ > μ\nin (b) and tan θ < μ in (c)\n10. Kleppner & Kolenkow, Problem 2.24 (10 points)\nContinued on next page...\n\n11. Bridge Building. (10 points)\nA mass M (perhaps a car) sits at the center of a bridge made up of three equilateral triangles of\nbeams. Assume that these seven beams are effectively massless, and that they are connected\nto each other by hinges at the very ends (so forces only act at the ends of each beam). The\nsupports at either end of the bridge only provide vertical forces to hold the bridge the car\nup. Assume constant gravitational acceleration ~g acts downward.\n(a) (10 points) Find the forces on each hinge point of each beam (both magnitude and\ndirection) and specify whether these forces are compressive or tensive (i.e., do they push\nthe beam in or stretch it out?). It is helpful to draw force diagrams for each beam to\nwork out where each force originates.\n(b) (10 points EXTRA CREDIT CHALLENGE) Find the forces on 2n+1 beams making\nup an n-triangle bridge (i.e., generalize your result above).\n12. Order of Magnitude Estimates. (10 points)\nLast week we introduced dimensional analysis as a means of estimating the functional forms of\nphysical quantities from basic principles. This week you are going to make order of magnitude\nestimates of some physical quantities. Try to make these estimates without using a calculator!\nOne of the important skills of a physicist or engineer is to be able to calculate on the spot.\n(a) (2 points) The entire population of Earth lines up, holding each others hands with arms\noutstretched. How many times would this human chain wrap around the Earth? The\nEarth's radius is roughly 6×106 m.\n(b) (2 points) Astronomers typically measure the angular motion of nearby stars in units\nof arcseconds/year, where an arcsecond is 1/3600th of a degree. If we were to project\nthe angular motion onto the Moon (a distance of 4×108 m), what speed would that\ncorrespond to? Is this speed closest to that of a snail, an Olympic runner or a jet plane?\n(c) (3 points) Crumple zones in cars are designed to reduce the acceleration in a collision\nwith a stationary object. Estimate a relation between the size of the crumple zone, the\ninitial speed of the car, and the acceleration on the car's occupants using dimensional\nanalysis. For a collision at 30 miles per hour, what is the minimum crumple zone size\nneeded to keep accelerations below (a fatal) acceleration of 20g. How does this size\ncompare to the length of a typical car?\n(d) (3 points) The nearest star to the Sun is about 4 lightyears away. Knowing that the\nspeed of light is 3×108 m/s, and that the typical mass of a star is roughly 1030 kg,\nestimate the mass density of stars (kg/m3) in the vicinity of the Sun. How does this\ncompare with the density of air?"
    },
    {
      "category": "Assignment",
      "title": "Problem Set 3",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-012-physics-i-classical-mechanics-fall-2008/34444c2193275cdea4f6bfbe9029279c_ps3.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n8.012 Physics I: Classical Mechanics\nFall 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nMASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Physics\nPhysics 8.012: Physics (Mechanics) I\nFall Term 2008\nPROBLEM SET 3\nCollaboration policy: You are encouraged to freely discuss your homework problems with other\n8.012 students and teaching staff. However, you must write up your solutions completely on your\nown--do not simply copy solutions from other students. You are forbidden from consulting\nsolutions from previous years or from the web. Violations of this policy may result in disciplinary\naction.\nReading: Kleppner & Kolenkow, Chapter 3 & 4\n0. Collaboration and discussion. Please list the names of all the students with whom you\ndiscussed these homework problems.\n1. Kleppner & Kolenkow, Problem 2.22 [15 points]\n2. Kleppner & Kolenkow, Problem 2.28 [10 points]\n3. Kleppner & Kolenkow, Problem 2.30 [10 points]\n4. Kleppner & Kolenkow, Problem 2.31 [15 points]\n5. Kleppner & Kolenkow, Problem 2.34 [10 points]\n6. Kleppner & Kolenkow, Problem 2.35 [10 points]\n7. Kleppner & Kolenkow, Problem 3.1 [10 points]\n8. Kleppner & Kolenkow, Problem 3.4 [10 points]\n9. Kleppner & Kolenkow, Problem 3.5 [10 points]"
    },
    {
      "category": "Assignment",
      "title": "Problem Set 4",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-012-physics-i-classical-mechanics-fall-2008/e7cc16987059896698f8ccf6d9db1198_ps4.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n8.012 Physics I: Classical Mechanics\nFall 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nMASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Physics\nPhysics 8.012: Physics (Mechanics) I\nFall Term 2008\nPROBLEM SET 4\nCollaboration policy: You are encouraged to freely discuss homework problems with other 8.012\nstudents and teaching staff. However, you must write up your solutions completely on your\nown--do not simply copy solutions from other students. You are forbidden from consulting\nsolutions from previous years or from the web. Violations of this policy may result in\ndisciplinary action.\nReading: Kleppner & Kolenkow, Chapters 3 & 4\n0. Collaboration and discussion. Please list the names of all the students with whom you\ndiscussed these homework problems.\n1. Kleppner & Kolenkow, Problem 3.7 [10 points]\n2. Kleppner & Kolenkow, Problem 3.11 [10 points]\n3. Kleppner & Kolenkow, Problem 3.13 [10 points]\n4. Kleppner & Kolenkow, Problem 3.14 [10 points]\n5. Kleppner & Kolenkow, Problem 3.15 [10 points]\n6. Kleppner & Kolenkow, Problem 3.16 [5 points]\n7. Kleppner & Kolenkow, Problem 3.18 [10 points]\n8. Kleppner & Kolenkow, Problem 3.20 [10 points]\nContinued on next page...\n\n9. The super-astro-blaster. [15 points]\nIn class we demonstrated how the astroblaster (a set of elastic bouncing balls released from\nrest and rebounding from the floor) can launch the smallest and topmost ball to considerable\ndistance. Let's push this to the test. Assume we have n balls of mass (left figure above)\nm1, m2, m3, ..., mn where m1 >> m2 >> m3 >> ... > mn. The most massive ball is at\nbottom and starts at rest at a height H = 1 meter above the ground. Assume that all balls\nbounce elastically, that constant gravitational acceleration ~g points downward, and that air\nresistance and realistic limits in the elasticity of the balls can be ignored.\n(a) (10 points) In terms of n, to what height does the top ball bounce? How many balls do\nyou need to reach 1 kilometer?\n(b) (5 points) How many balls do you need to achieve escape velocity? You will need to\ndetermine an expression for escape velocity from the Earth, which is possible (to within\nan order of magnitude) through dimensional analysis.\n10. A falling chain. [10 points]\nYou hold a chain of mass M, length L and uniform mass density λ from one end above a fixed\ntable (right figure above). The chain falls under constant gravitational acceleration. Ignore\nany swinging or bouncing in the chain and assume that it moves purely in a vertical direction\nuntil it comes to rest hanging straight down below the table.\n(10 points) What is the support force from the table, FS , as a function of time after the chain\nis released?"
    },
    {
      "category": "Assignment",
      "title": "Problem Set 5",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-012-physics-i-classical-mechanics-fall-2008/eb1b3419ca14370702016fe3f4cbc944_ps5.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n8.012 Physics I: Classical Mechanics\nFall 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nMASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Physics\nPhysics 8.012: Physics (Mechanics) I\nFall Term 2008\nPROBLEM SET 5\nCollaboration policy: You are encouraged to freely discuss homework problems with other 8.012\nstudents and teaching staff. However, you must write up your solutions completely on your\nown--do not simply copy solutions from other students. You are forbidden from consulting\nsolutions from previous years or from the web. Violations of this policy may result in\ndisciplinary action.\nReading: Kleppner & Kolenkow, Chapters 4\n0. Collaboration and discussion. Please list the names of all the students with whom you\ndiscussed these homework problems.\n1. Kleppner & Kolenkow, Problem 4.4 [10 points]\n2. Kleppner & Kolenkow, Problem 4.5 [10 points]\n3. Kleppner & Kolenkow, Problem 4.7 [10 points]\n4. Kleppner & Kolenkow, Problem 4.8 [10 points]\n5. Kleppner & Kolenkow, Problem 4.9 [5 points]\n6. Kleppner & Kolenkow, Problem 4.10 [10 points]\n7. Kleppner & Kolenkow, Problem 4.13 [10 points]\n8. Kleppner & Kolenkow, Problem 4.20 [10 points]\n9. Kleppner & Kolenkow, Problem 4.28 [10 points]\nContinued on next page...\n\n10. Solar Energy. [15 points]\nThere is considerable discussion today about switching over to renewable resources for our\nenergy needs--wind, solar, tidal, biofuel--for both conservation and economics. In this prob\nlem you are to examine whether one of these solutions--Solar power--is a viable solution for\nBoston using estimation and order of magnitude approximations.\n(a) [5 pts] Estimate the average electrical power used by people in Boston, measured in\nWatts. There are roughly 6 million people in Boston.\n(b) [5 pts] Now estimate the amount of useable solar energy in the Boston area. First\nestimate the incident flux of radiation on the surface of the Earth, measured in W/m2 .\nThen estimate how much of that flux can reasonably be captured over the course of\nthe year, including the efficiency of solar panels (roughly 10%), the fact that the Sun is\nonly up in the daytime, the inclination of the Sun in the sky, the scattering of sunlight\nby the atmosphere and clouds, etc. Some important numbers: the luminosity of the\nSun (radiant power) is roughly 4×1026 W, the Sun-Earth distance is 1.5×1011 m = 1\nAstronomical Unit, and the metro area of Boston is 11,000 km2 .\n(c) [5 pts] Based on part (b), what fraction of Boston's land area would need to be set\naside for solar panels to provide electricity for everyone? Does this seem like a feasible\napproach? What are some of the practical impediments to doing this?\n(d) [5 pts] Redo the calculation but just for your dorm building. Could solar panels covering\nyour dorm roof provide enough energy to power the whole building? What about for the\ncase of a single family home (assume 4 residents)? Would simply covering every building\ntop in solar panels provide sufficient electrical energy?\n(e) [5 pts] The World Resources Institute estimates that the total energy usage per capita\nin the United States is roughly 80,000 kiloWatt-hours per year (what is this in Watts?).\nWhat accounts for the difference between this number and your estimate in (a)? With\nthis value, could solar panels meet all of the energy needs of Boston in the near future?"
    },
    {
      "category": "Assignment",
      "title": "Problem Set 6",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-012-physics-i-classical-mechanics-fall-2008/f0d6f9a9dac206550c245d2f05895177_ps6.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n8.012 Physics I: Classical Mechanics\nFall 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nMASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Physics\nPhysics 8.012: Physics (Mechanics) I\nFall Term 2008\nPROBLEM SET 6\nCollaboration policy: You are encouraged to freely discuss homework problems with other 8.012\nstudents and teaching staff. However, you must write up your solutions completely on your\nown--do not simply copy solutions from other students. You are forbidden from consulting\nsolutions from previous years or from the web. Violations of this policy may result in\ndisciplinary action.\nReading: Kleppner & Kolenkow, Chapters 5 & 6\n8.012 Project Proposal: The 8.012 Project is a design-your-own project to explore some of\nthe concepts we've been learning in class. It is free-form in the sense you can design any kind\nof (reasonable) project you can think of related to the class, but in the spirit of Newton should\nnevertheless be experimental in design. The project itself will be due on Wednesday, November\n26th in your recitation section, and is worth 5% of your total grade.\nHere are the ground rules for the 8.012 project (see also the 8.012 webpage):\nThe project must an experiment based on principles we have learned in 8.012.\n-\nThe project should test an idea (such as the conservation of momentum), verify a result\n-\nfrom the psets (such as confirming the properties of the capstan), demonstrate a physical\nconcept (similar to the classroom demos) or examine a unique mechanical situation (such as\nexamining the motion of coupled-pendulum system).\nThe project can be mechanical (i.e., building something), purely experimental (i.e., measuring\n-\nthe motion of a simple system) or numerical (i.e., simulating a physical problem on computer).\nEach project is to be accompanied by a 3-5 page write-up, as well as any accompanying media\n-\n(e.g., pictures, video or computer simulation).\nYou may work in groups of up to 4 people.\n-\nEach project will be graded according to its description of the physics underlying the ex\n-\nperiment, design and execution of the experiment and analysis/description of the results.\nCreativity will be rewarded!\nContinued on next page...\n\nThe objective here is to draft up a project proposal which you will hand in during your recitation\nsection on Wednesday, October 29th. The proposal must include:\n- A title and name(s) of those working on the project;\n- A brief description of the project itself (general idea, design, goals);\n- A description of how the project is specifically related to the physical principles discussed in\n8.012;\n- A description of the resources you may need to complete the project and how you aim to\nobtain those resources;\n- The proposal must be no longer than one (1) page, single-spaced, 12-point font.\nThe instructors will assess your project idea and either give you/your group the go-ahead or suggest\na revised project plan. No 8.012 project can be done without an accepted proposal, and\nno late proposals will be accepted, so be sure to get your proposals in on October 29th. Only\none proposal per group needs to be turned in; if your group spans multiple recitations, please\ndesignate one (responsible!) member of your group to hand in the proposal.\nSome examples of last year's projects are on the 8.012 website. Have fun brainstorming ideas!\nHomework Problems:\n0. Collaboration and discussion. Please list the names of all the students with whom you\ndiscussed these homework problems. Also be sure to write down your name and recitation\nsection clearly on the first page.\n1. Kleppner & Kolenkow, Problem 5.4 [10 points]\n2. Kleppner & Kolenkow, Problem 5.7 [10 points]\n3. Kleppner & Kolenkow, Problem 6.1 [10 points]\n4. Kleppner & Kolenkow, Problem 6.2 [10 points]\n5. Kleppner & Kolenkow, Problem 6.4 [10 points]\n6. Kleppner & Kolenkow, Problem 6.6 [10 points]\nContinued on next page...\n\n7. Hanging Cylinder. [10 points]\nA cylinder of mass M and radius R is suspended at one side by a length of rope, while\nthe other side rests against a vertical wall. The coefficient of friction between the wall and\ncylinder surfaces is μ. The rope extends off at an angle θ relative to the vertical wall. The\nwhole system remains at rest. Constant gravity acts downward.\nWhat is the minimum angle θ for which this setup remains stationary? Explain why this is\na minimum angle and not a maximum angle (i.e., explain what happens if the ball is placed\nhigher or lower on the wall)."
    },
    {
      "category": "Assignment",
      "title": "Problem Set 7",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-012-physics-i-classical-mechanics-fall-2008/250d4c960c29fd28e5ef63bbb6dba716_ps7.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n8.012 Physics I: Classical Mechanics\nFall 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nMASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Physics\nPhysics 8.012: Physics (Mechanics) I\nFall Term 2008\nPROBLEM SET 7\nCollaboration policy: You are encouraged to freely discuss homework problems with other 8.012\nstudents and teaching staff. However, you must write up your solutions completely on your\nown--do not simply copy solutions from other students. You are forbidden from consulting\nsolutions from previous years or from the web. Violations of this policy may result in\ndisciplinary action.\nReading: Kleppner & Kolenkow, Chapters 6 & 7\n0. Collaboration and discussion. Please list the names of all the students with whom you\ndiscussed these homework problems. Also be sure to write down your name and recitation\nsection clearly on the first page.\n1. Kleppner & Kolenkow, Problem 6.8 [10 points]\n2. Kleppner & Kolenkow, Problem 6.13 [5 points]\n3. Kleppner & Kolenkow, Problem 6.16 [10 points]\n4. Kleppner & Kolenkow, Problem 6.18 [5 points]\n5. Kleppner & Kolenkow, Problem 6.21 [10 points]\n6. Kleppner & Kolenkow, Problem 6.24 [10 points]\n7. Kleppner & Kolenkow, Problem 6.29 [10 points]\n8. Kleppner & Kolenkow, Problem 6.30 [5 points]\n9. Kleppner & Kolenkow, Problem 6.34 [10 points]\n10. Kleppner & Kolenkow, Problem 6.35 [10 points]\nContinued on next page...\n\n11. Superball Bounce. [15 points]\nA superball of mass M, radius R and uniform density is thrown with horizontal velocity vx\nand rotation rate ω (assume that the spin angular momentum vector is orthogonal to the\ntrajectory of the ball). The ball makes a perfectly elastic \"bounce\" on the floor without\nslipping, in a manner such that the magnitude of its vertical velocity is the same before\nand after the bounce (i.e., it would bounce to the same height from which it was originally\nreleased).\n(a) [10 pts] Calculate the horizontal velocity and rotation rate of the ball immediately after\nthe bounce, in terms of the vx, ω and R.\n(b) [5 pts] Calculate the horizontal velocity and rotation rate immediately after a second\nbounce, in terms of the original vx, ω and R. Based on this answer, can you describe the\nmotion of the ball after many bounces? (You are encouraged to confirm your answer by\nexperimentation)."
    },
    {
      "category": "Assignment",
      "title": "Problem Set 8",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-012-physics-i-classical-mechanics-fall-2008/beb75f47b0625ad80652a57e54161a5b_ps8.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n8.012 Physics I: Classical Mechanics\nFall 2008\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nMASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Physics\nPhysics 8.012: Physics (Mechanics) I\nFall Term 2008\nPROBLEM SET 8\nCollaboration policy: You are encouraged to freely discuss homework problems with other 8.012\nstudents and teaching staff. However, you must write up your solutions completely on your\nown--do not simply copy solutions from other students. You are forbidden from consulting\nsolutions from previous years or from the web. Violations of this policy may result in\ndisciplinary action.\nReading: Kleppner & Kolenkow, Chapter 7\n0. Collaboration and discussion. Please list the names of all the students with whom you\ndiscussed these homework problems. Also be sure to write down your name and recitation\nsection clearly on the first page.\n1. Kleppner & Kolenkow, Problem 6.33 [10 points]\n2. Kleppner & Kolenkow, Problem 6.39 [10 points]\n3. Kleppner & Kolenkow, Problem 6.40 [10 points]\n4. Kleppner & Kolenkow, Problem 6.41 [10 points]\n5. Kleppner & Kolenkow, Problem 7.2 [10 points]\n6. Kleppner & Kolenkow, Problem 7.3 [10 points]\n7. Kleppner & Kolenkow, Problem 7.4 [10 points]\nContinued on next page...\n\n8. Rectangular Symmetry. [15 points]\nA flat, uniform rectangle with sides of length a and b is at rest in free space (there are initially\nno external forces acting). You strike two opposite corners with equal and opposite forces F~\nas indicated for a short time period Δt.\n(a) [5 pts] Calculate the moments of inertia of the rectangle about horizontal (ˆx) and vertical\n(ˆy) axes passing through its center of mass. Note that this does not require calculating\nthe moment of inertia tensor. Verify your answers by showing that these moments of\ninertia satisfy the perpendicular axis theorem, Ix + Iy = Iz, where Iz is the moment of\ninertia about an axis coming out of the page (ˆz) through the center of mass (which you\nshould also calculate).\n(b) [10 pts] Calculate the spin vector (ω~ ) and angular momentum vector (L~) immediately\nafter the strike. Show that these are not parallel, and that the spin vector points along\nthe opposite diagonal from where the forces were applied if a =6\nb.\nContinued on next page...\n\n9. Euler's Disk. [15 points]\nIf you spin a coin (a solid uniform disk) about a vertical axis on a table, it will eventually\nlose energy and begin to wobble. Wobbling motion can basically be described as the rolling\nof the coin without slipping while tilted from horizontal by an angle α. Assume that once\nthe coin starts to wobble, it falls sufficiently slowly tht you can assume α is constant and the\ncenter of mass remains at a fixed point. Let ωs be the spin frequency of the coin, and Ω be\nthe frequency at which the contact point traces a circle on the table.\n(a) [5 pts] Show that the total angular velocity vector ~ω of the coin has magnitude Ω sin α\nand points in a direction from the contact point up through the center of mass of the\ncoin.\n(b) [5 pts] Show that:\nr\nΩ = 2\ng\n(1)\nL sin α\nand discuss what happens at the limits of α. It helps to verify that the direction of ~ω is\nalong one of the principal axes of the coin.\n(c) [5 pts] Show that, when viewed from above, the face of the coin appears to rotate with\nfrequency\nr\nΩ = 2(1 - cos α)\ng\n.\n(2)\nL sin α\nVerify these results by spinning a coin yourself!"
    },
    {
      "category": "Assignment",
      "title": "Problem Set 9",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-012-physics-i-classical-mechanics-fall-2008/6132ace92420940ffc961284f859a8eb_ps9.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n8.012 Physics I: Classical Mechanics\nFall 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nMASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Physics\nPhysics 8.012: Physics (Mechanics) I\nFall Term 2008\nPROBLEM SET 9\nCollaboration policy: You are encouraged to freely discuss homework problems with other 8.012\nstudents and teaching staff. However, you must write up your solutions completely on your\nown--do not simply copy solutions from other students. You are forbidden from consulting\nsolutions from previous years or from the web. Violations of this policy may result in\ndisciplinary action.\nReading: Kleppner & Kolenkow, Chapter 8\n0. Collaboration and discussion. Please list the names of all the students with whom you\ndiscussed these homework problems. Also be sure to write down your name and recitation\nsection clearly on the first page.\n1. Kleppner & Kolenkow, Problem 7.5 [10 points]\n2. Kleppner & Kolenkow, Problem 7.7 [10 points]\n3. Kleppner & Kolenkow, Problem 7.9 [10 points]\n4. Kleppner & Kolenkow, Problem 7.11 [5 points]\n5. Kleppner & Kolenkow, Problem 8.1 [10 points]\n6. Kleppner & Kolenkow, Problem 8.3 [10 points]\n7. Kleppner & Kolenkow, Problem 8.4 [10 points]\n8. Kleppner & Kolenkow, Problem 8.5 [10 points]\n9. Kleppner & Kolenkow, Problem 8.6 [10 points]\nContinued on next page...\n\n10. Moment of Inertia of a Water Molecule. [15 points]\nThe water molecule, H2O, is composed of 2 atoms of hydrogen (molecular weight 1 amu =\n1.66×10-27 kg) each bonded to one atom of oxygen (molecular weight 16 amu) in a triangular\narrangement. The oxygen-hydrogen bonds have a length r = 9.6×10-11 m and are set apart\nby an angle of 104.5o . Treat each atom as a point mass.\n(a) [10 pts] Determine the center of mass position of the water molecule, and find the\nprincipal axes that pass through this center of mass. Confirm these axes by calculating\nthe moment of inertia tensor in the principal axes frame. You can write your answer in\nterms of bond length r and hydrogen mass mH .\n(b) [5 pts] About which axis is torque-free rotation unstable (i.e, will lead to tumbling\nmotion)?"
    },
    {
      "category": "Assignment",
      "title": "Problem Set 10",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-012-physics-i-classical-mechanics-fall-2008/9f403188824326949f9f8098bb70674f_ps10.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n8.012 Physics I: Classical Mechanics\nFall 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nMASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Physics\nPhysics 8.012: Physics (Mechanics) I\nFall Term 2008\nPROBLEM SET 10 (OPTIONAL)\nThis problem set will be not be collected. Solutions will be posted online.\nReading: Kleppner & Kolenkow, Chapter 9\n1. Kleppner & Kolenkow, Problem 8.8\n2. Kleppner & Kolenkow, Problem 8.10\n3. Kleppner & Kolenkow, Problem 8.11\n4. Kleppner & Kolenkow, Problem 8.12\n5. Kleppner & Kolenkow, Problem 9.1\n6. Kleppner & Kolenkow, Problem 9.3\n7. Kleppner & Kolenkow, Problem 9.4\n8. Kleppner & Kolenkow, Problem 9.6\n9. Kleppner & Kolenkow, Problem 9.12\nContinued on next page...\n\n10. Spinning up Figure Skater.\n(a) The derivation of the rotational fictional forces we did in class (coriolis and centrifugal)\nassumed that the spin vector ~ω was constant in time. Relax this constraint and derive an\nadditional fictional force that depends on the ω~ (this is known as the azimuthal force).\n(b) We found earlier that the spin up of an ice skater as she brings her hands in can be\nattributed to conservation of angular momentum (for different moments of inertia).\nLet's examine this in the skater's frame of reference. Assume our skater has hands of\nmass M extended initially at a radius R from her body, attached to effectively massless\narms and an effectively massless body (think: spherical cow). She is initially rotating\nwith spin vector ω~ pointing upwards. Our skater moves her hands slowly toward the\ncenter of her body at a rate r. Based on the fact that the skater does not spin up in her\nown frame of reference (always true!), and considering all fictional forces in her rotating\nframe of reference, derive an expression for ω in terms of ω, R and r.\n(c) Derive this same expression by examining the evolution of angular momentum in the\ninertial reference frame.\n(d) If the skater pulls her hands in to half their original radius, by how much does she spin\nup?"
    },
    {
      "category": "Exam",
      "title": "Final Exam",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-012-physics-i-classical-mechanics-fall-2008/15cdb14e63ed07c47115ce18c73917bf_final.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n8.012 Physics I: Classical Mechanics\nFall 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nMASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Physics\nPhysics 8.012\nFall 2008\nFinal Exam\nMonday, December 15, 2008\nNAME: _________________________________________________\nInstructions:\n1. Do all SEVEN (7) problems. You have 2.5 hours.\n2. Show all work. Be sure to CIRCLE YOUR FINAL ANSWER.\n3. Read the questions carefully\n4. All work and solutions must be done in the answer booklets provided\n5. NO books, notes, calculators or computers are permitted. A sheet of\nuseful equations is provided on the last page.\nYour Scores\nProblem Maximum Score Grader\nTotal\n\n8.012 Fall 2008\nFinal Exam\n[NO TEST MATERIAL ON THIS PAGE]\nPage 2 of 12\n\n8.012 Fall 2008\nFinal Exam\nProblem 1: Multiple Choice & Short Answer Questions [10 pts]\nFor each of the following questions enter the correct multiple choice option or\nwrite/draw out a short answer in your answer booklet. You do not need to show\nany work beyond your answer.\n(a) [2 pts] Two planets of mass\nM and 2M are in circular orbits\nM\n2M\naround a star at radii R and 2R,\nrespectively (assume the star's\nmass is >> M). Which planet has\nthe greater orbital velocity and\nwhich planet has the greater\norbital angular momentum?\n2R\n(b) [2 pts] What is Chasles' theorem?\nR\n(1)\n(2)\n(3)\n(4)\nEvery force\nGravitational\nMotion can be separated\nInertial mass\nhas an equal\norbits form\nin translation of center of\nequals\nand opposite\nellipses\nmass and rotation about\ngravitational\npair\ncenter of mass\nmass\n(c) [2 pts] A stationary ice skater is spinning about her center of mass (along a\nprincipal axis) on a frictionless surface. She pulls in her arms and spins up faster.\nWhich of the following is conserved in this motion (write down all that apply)?\nEnergy\nMomentum\nAngular momentum\nPage 3 of 12\n\n8.012 Fall 2008\nFinal Exam\n(d) [2 pts] What are the dimensions of the gravitational constant G?\n(e) [2 pts] A gyroscope whose spin angular\nvelocity vector points toward the left is\nobserved to precess such that its precession\nangular velocity vector points at an angle as\nshown. In which direction does the gravity\nvector point?\n(f) [BONUS 2 pts] A diver is the middle of a dive as shown below. Based on clues\nin the photo, indicate in your answer booklet the direction that his total spin vector\npoints, and determine whether the diver is doing a front flip or a back flip.\nPage 4 of 12\n\n8.012 Fall 2008\nFinal Exam\nProblem 2: Atwood Machine [15 pts]\nα\n2M\nM\nM\nR\nμ\nd\nAn Atwood machine consists of a fixed pulley wheel of radius R and uniform mass\nM (a disk), around which an effectively massless string passes connecting two\nblocks of mass M and 2M. The lighter block is initially positioned a distance d\nabove the ground. The heavier block sits on an inclined plane with opening angle\nα. There is a coefficient of friction μ between the surfaces of this block and the\ninclined plane. Constant gravitational force acts downwards, and assume that the\nstring never slips.\n(a) [5 pts] Determine two conditions on the angle α which allow the lighter block\nto move up or move down.\n(b) [10 pts] Assuming that the lighter block moves down, determine its\nacceleration.\nPage 5 of 12\n\nMR + MF\n2R\nN particles/m3\nProblem 3: Rocket in an Interstellar Cloud [15 pts]\nA cylindrical rocket of diameter 2R, mass MR and containing fuel of mass MF is\ncoasting through empty space at velocity v0. At some point the rocket enters a\nuniform cloud of interstellar particles with number density N (e.g., particles/m3),\nwith each particle having mass m (<< MR) and initially at rest. To compensate for\n8.012 Fall 2008\nFinal Exam\nthe dissipative force of the particles colliding with the rocket, the rocket engines\nemit fuel at a rate dm/dt = γ at a constant velocity u with respect to the rocket.\nIgnore gravitational effects between the rocket and cloud particles.\n(a) [5 pts] Assuming that the dissipative force from the cloud particles takes the\nform F = -Av2, where A is a constant, derive the equation of motion of the rocket\n(F = ma) through the cloud as it is firing its engines.\n(b) [5 pts] What must the rocket's thrust be to maintain a constant velocity v0?\n(c) [5 pts] If the rocket suddenly runs out of fuel, what is its velocity as a function\nof time after this point?\n(d) [BONUS 5 pts] Assuming that each cloud particle bounces off the rocket\nelastically, and collisions happen very frequently (i.e., collisions are continuous),\nprove that the dissipative force is proportional to v2, and determine the constant A.\nAssume that the front nose-cone of the rocket has an opening angle of 90o.\nPage 6 of 12\n\n8.012 Fall 2008\nFinal Exam\nProblem 4: Sticky Disks [15 pts]\nω0\nM\n2M\n2R\n2R\nM\n2M\nA uniform disk of mass M and diameter 2R moves toward another uniform disk of\nmass 2M and diameter 2R on the surface of a frictionless table. The first disk has\nan initial velocity v0 and spin rate ω0 as indicated, while the second disk is initially\nstationary. When the first disk contacts the second (a \"glancing\" collision), they\ninstantly stick to each other and move as a single object.\n(a) [5 pts] What are the velocity and spin angular velocity of the combined disks\nafter the collision? Indicate both magnitudes and directions.\n(b) [5 pts] For what value of ω0 would the combined disks not rotate?\n(c) [5 pts] How much total mechanical energy is lost in this collision?\nPage 7 of 12\n\n8.012 Fall 2008\nFinal Exam\nProblem 5: Cylindrical Top [15 pts]\nM\nCOM\nr\nμ = 0\nΔp\nL\nR\nA cylinder of mass M, length L and radius R is spinning about its long axis with\nangular velocity\non a frictionless horizontal surface. The cylinder is\ngiven a sharp, horizontal strike with impulse Δp at a distance r from its center of\nmass (COM). Assume that constant gravitational acceleration acts downward.\nNOTE: you do not need to use Euler's equations to solve this problem.\n(a) [5 pts] What is the translational velocity of the cylinder after the impulse\n(magnitude and direction)?\n(b) [5 pts] The strike imparts an angular momentum impulse to the cylinder which\ncauses it to lift up at one end. At what angle α will the cylinder be tilted after the\nimpulse and which end of the cylinder lifts up? Assume that the angular\nmomentum impulse is much smaller than the spin angular momentum.\n(c) [5 pts] After the cylinder tilts up, it effectively becomes a top. Determine its\nprecessional rate and the direction of precession. Assume that nutational motion is\nnegligible (i.e., α remains effectively constant) and that R << L (i.e., that the\ncylinder can be approximated as a thin rod for this part).\n(d) [5 pts BONUS] For a strong enough impulse, the cylinder will tilt high enough\nto precess in the opposite direction. What is the minimum tilt angle for this to\nhappen and what is the minimum impulse required? (Note that you cannot assume\nR << L here. This problem is similar to the \"tipping battery\" trick pointed out by\none of the 8.012 students.)\nPage 8 of 12\n\n8.012 Fall 2008\nFinal Exam\nProblem 6: Bead on a Spinning Rod [15 pts]\nM\nω\nr0\nA bead of mass M is placed on a frictionless, rigid rod that is spun about at one end\nat a rate ω. The bead is initially held at a distance r0 from the end of the wire. For\nthe questions below, treat the bead as a point mass. Ignore gravitational forces.\n(a) [5 pts] What force is necessary to hold the bead in place at r0? Indicate both\nmagnitude and direction.\n(b) [5 pts] After the bead is released, what is its position in the inertial frame (in\npolar coordinates) as a function of time?\n(c) [5 pts] Now calculate the fictitious forces on the bead in a reference frame that\nis rotating with the wire. What real force must the rod exert on the bead in both the\nrotating and inertial frames?\nPage 9 of 12\n\n8.012 Fall 2008\nFinal Exam\nProblem 7: Central Potential [15 pts]\nA particle of mass m moves within a region under the influence of a force of the\nform\nThe particle is initially at a distance r0 from the origin of the force, and initially\nmoves with velocity v0 in a tangential direction.\n(a) [5 pts] Derive and sketch the effective potential of this system as a function of\nradius from the origin. Indicate all important inflection points. Can the particle\npass through the origin of this reference frame?\n(b) [5 pts] Find the velocity v0 required for the particle to move in a purely circular\norbit at a radius r0 with this force law.\n(c) [5 pts] Compute the frequency of small oscillations about this equilibrium\nradius. How does the period of these oscillations compare to the orbital period?\nPage 10 of 12\n\nar\nolar\n) of a\nt in\nnates\n\ny\nrces)\nwhere\num\nFixed axis rotation:\nVelocity in pol\ncoordinates\nAcceleration in p\ncoordinates\nCenter of mass (COM\nrigid body\nVolume elemen\ncylindrical coordi\nKinetic energy\nWork\nPotential Energ\n(for conservative fo\nAngular moment\nTorque\n8.012 Fall 2008\nFinal Exam\nUSEFUL EQUATIONS\nPage 11 of 12\n\n8.012 Fall 2008\nFinal Exam\nCOM Moment of inertia\nfor a uniform bar\nCOM Moment of inertia\nfor a uniform hoop\nCOM Moment of inertia\nfor a uniform disk\nCOM Moment of inertia\nfor a uniform sphere\nScalar parallel axis theorem\nMoments of inertia tensor\n(permute x→y→z)\nEuler's Equations\n(permute 1→2→3)\nTime derivative between\ninertial and rotating frames\nFictitious force in an\naccelerating frame\nFictitious force in a\nrotating frame (Ω constant)\nTaylor Expansion of f(x)\nPage 12 of 12"
    },
    {
      "category": "Exam",
      "title": "Final Exam Solutions",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-012-physics-i-classical-mechanics-fall-2008/d81322125af1816e7adc21bf498701bc_final_sol.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n8.012 Physics I: Classical Mechanics\nFall 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nMASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Physics\nPhysics 8.012\nFall 2008\nFinal Exam\nS O L U T I O N S\nNAME: _________________________________________________\nInstructions:\n1. Do all SEVEN (7) problems. You have 2.5 hours.\n2. Show all work. Be sure to CIRCLE YOUR FINAL ANSWER.\n3. Read the questions carefully\n4. All work and solutions must be done in the answer booklets provided\n5. NO books, notes, calculators or computers are permitted. A sheet of\nuseful equations is provided on the last page.\nYour Scores\nProblem Maximum Score Grader\nTotal\n\n8.012 Fall 2008\nFinal Exam\n[NO TEST MATERIAL ON THIS PAGE]\nPage 2 of 25\n\nnd your answer.\no planets of mass\nM\n2M\nin circular orbits\nt radii R and 2R,\nssume the star's\nR\n. Which planet has\nital velocity and\n8.012 Fall 2008\nFinal Exam\nProblem 1: Multiple Choice & Short Answer Questions [10 pts]\nFor each of the following questions enter the correct multiple choice option or\nwrite/draw out a short answer in your answer booklet. You do not need to show\nany work beyo\n(a) [2 pts] Tw\nM and 2M are\naround a star a\nrespectively (a\nmass is >> M)\nthe greater orb\nwhich planet has the greater\n2R\norbital angular momentum?\nOrbital velocity depends on the strength of the gravitational force, scaling as v2 ∝\n1/r; hence, the inner planet moves faster. The angular momentum scales as mvr ∝\nr1/2, so the outer planet (which also has twice the mass) has a greater angular\nmomentum.\n(b) [2 pts] What is Chasles' theorem?\n(1)\n(2)\n(3)\n(4)\nEvery force\nGravitational\nMotion can be separated\nInertial mass\nhas an equal\norbits form\nin translation of center of\nequals\nand opposite\nellipses\nmass and rotation about\ngravitational\npair\ncenter of mass\nmass\n(1) is Newton's 3rd law, (2) is Kepler's 1st law, (3) is Chasle's theorem and (4) is\nthe equivalence principle.\n(c) [2 pts] A stationary ice skater is spinning about her center of mass (along a\nprincipal axis) on a frictionless surface. She pulls in her arms and spins up faster.\nWhich of the following is conserved in this motion (write down all that apply)?\nEnergy\nMomentum\nAngular momentum\nPage 3 of 25\n\n8.012 Fall 2008\nFinal Exam\nWithout an external force, the ice skater's momentum doesn't change; similarly, as\nthere are no external torques, angular momentum is conserved. However,\nrotational energy scales as L2/2I, and the moment of inertia (I) is reduced for the\nskater as she pulls in her arms, so her total mechanical energy must increase.\n(d) [2 pts] What are the dimensions of the gravitational constant G?\n[M]-1[L]3[T]-2\n(e) [2 pts] A gyroscope whose spin angular\nvelocity vector points toward the left is\nobserved to precess such that its precession\nangular velocity vector points at an angle as\nshown. In which direction does the gravity\nvector point?\nThe precession direction points in the opposite direction as the spin vector initially\nmoves toward as the gyroscope falls under gravity. In this case, the gravity vector\nmust therefore be parallel to the precession vector.\n(f) [BONUS 2 pts] A diver is the middle of a dive as shown below. Based on clues\nin the photo, indicate in your answer booklet the direction that his total spin vector\npoints, and determine whether the diver is doing a front flip or a back flip.\nOne clue is the hair, which lies in a\nplane perpendicular to the spin vector\n(twirl a handful of string to convince\nyourself of this). The placement of the\narms breaks the degeneracy, indicating\nan applied torque that causes a twist\nrotation whose direction points along the\nfeet. So the total spin vector points in the\ndirection shown, and the flip component\nindicates a front flip (head over feet).\nPage 4 of 25\n\n8.012 Fall 2008\nFinal Exam\nProblem 2: Atwood Machine [15 pts]\nα\n2M\nM\nM\nR\nμ\nd\nAn Atwood machine consists of a fixed pulley wheel of radius R and uniform mass\nM (a disk), around which an effectively massless string passes connecting two\nblocks of mass M and 2M. The lighter block is initially positioned a distance d\nabove the ground. The heavier block sits on an inclined plane with opening angle\nα. There is a coefficient of friction μ between the surfaces of this block and the\ninclined plane. Constant gravitational force acts downwards, and assume that the\nstring never slips.\n(a) [5 pts] Determine two conditions on the angle α which allow the lighter block\nto move up or move down.\n(b) [10 pts] Assuming that the lighter block moves down, determine its\nacceleration.\nPage 5 of 25\n\n8.012 Fall 2008\nFinal Exam\nSOLUTION TO PROBLEM 2\n(a) The above diagram shows the appropriate forces on the two blocks and the\npulley wheel. The two conditions for the blocks arise from whether the leftmost\nblock moves up or down, which changes the direction of the friction force acting\non the rightmost block. Consider first the leftmost block moving down; in that\ncase Mg > T1 and T1 > T2 (so the wheel can spin), and T2 must be greater than both\nthe friction force (μN = μ2Mgcosα) and the component of gravitational force\nparallel to the inclined plane surface (2Mgsinα) on the rightmost block:\nMg\nR\nT2\nMg\nFs\n2Mg\nT2\nN\nμN\nT1\nT1\nIf the leftmost block moves up, then T1 > Mg, T2 > T1 and the gravitational force\non the rightmost block must overcome both tension and friction:\nPage 6 of 25\n\n8.012 Fall 2008\nFinal Exam\n(b) Choosing our coordinate systems for each component as shown above so that\nall objects move in a positive direction, we can write down the following equations\nof motion:\nleftmost block:\npulley wheel:\nrightmost block:\nThe constraint equation tying all of these objects together (connected by an\nmassless and hence inextensible string) is:\nUsing this and the first two equations of motion we can relate to two tension\nforces:\nand using the first and third equations of motion we can solve for the individual\ntensions:\nNote that the first conditions from part (a) is necessary for acceleration to be\npositive.\nPage 7 of 25\n\nMR + MF\n2R\nN particles/m3\nProblem 3: Rocket in an Interstellar Cloud [15 pts]\nA cylindrical rocket of diameter 2R, mass MR and containing fuel of mass MF is\ncoasting through empty space at velocity v0. At some point the rocket enters a\nuniform cloud of interstellar particles with number density N (e.g., particles/m3),\nwith each particle having mass m (<< MR) and initially at rest. To compensate for\n8.012 Fall 2008\nFinal Exam\nthe dissipative force of the particles colliding with the rocket, the rocket engines\nemit fuel at a rate dm/dt = γ at a constant velocity u with respect to the rocket.\nIgnore gravitational effects between the rocket and cloud particles.\n(a) [5 pts] Assuming that the dissipative force from the cloud particles takes the\nform F = -Av2, where A is a constant, derive the equation of motion of the rocket\n(F = ma) through the cloud as it is firing its engines.\n(b) [5 pts] What must the rocket's thrust be to maintain a constant velocity v0?\n(c) [5 pts] If the rocket suddenly runs out of fuel, what is its velocity as a function\nof time after this point?\n(d) [BONUS 5 pts] Assuming that each cloud particle bounces off the rocket\nelastically, and collisions happen very frequently (i.e., collisions are continuous),\nprove that the dissipative force is proportional to v2, and determine the constant A.\nAssume that the front nose-cone of the rocket has an opening angle of 90o.\nPage 8 of 25\n\n8.012 Fall 2008\nFinal Exam\nSOLUTION TO PROBLEM 3:\n(a) Consider some time t when a parcel of mass dm is ejected from the rocket at\nvelocity u. Newton's second law can be written as (assuming the rightward\ndirection to be positive):\nThe momentum of the rocket + fuel system before and after ejection of fuel can be\nwritten as:\nKeeping only first order terms we derive\nor\nwhere γ has been substituted in place of dm/dt.\n(b) To maintain constant speed, dv/dt = 0 hence the thrust is\n(c) When the rocket runs out of fuel, it has a mass MR and there is no thrust term,\nhence the equation in part (a) becomes:\nThis equation is separable and can be directly integrated:\nPage 9 of 25\n\n8.012 Fall 2008\nFinal Exam\n(d) As illustrated in the figure to the right, each particle that\ncollides with the rocket is deflected through 90o (due to\ngeometry), which means that each particle imparts an\nimpulse on the rocket of Δp = mv in the horizontal\ndirection opposite of motion (it also imparts an impulse of\nmv in the vertical direction, but that is balanced by particles\nstriking the other side of the nosecone). The number of\nparticles that strikes the rocket per unit time is simple the\nvolume swept through by the rocket per unit time, AΔx/Δt = πR2v. The total\nmomentum transfer onto the rocket is:\nPage 10 of 25\nmv\n\n8.012 Fall 2008\nFinal Exam\nProblem 4: Sticky Disks [15 pts]\nω0\nM\n2M\n2R\n2R\nM\n2M\nA uniform disk of mass M and diameter 2R moves toward another uniform disk of\nmass 2M and diameter 2R on the surface of a frictionless table. The first disk has\nan initial velocity v0 and spin rate ω0 as indicated, while the second disk is initially\nstationary. When the first disk contacts the second (a \"glancing\" collision), they\ninstantly stick to each other and move as a single object.\n(a) [5 pts] What are the velocity and spin angular velocity of the combined disks\nafter the collision? Indicate both magnitudes and directions.\n(b) [5 pts] For what value of ω0 would the combined disks not rotate?\n(c) [5 pts] How much total mechanical energy is lost in this collision assuming that\nthe combined disk system is not rotating?\nPage 11 of 25\n\n8.012 Fall 2008\nFinal Exam\nSOLUTION TO PROBLEM 4:\n(a) There are no external forces on this system, so the initial and final momenta are\nthe same and equal to Mv0 toward the right. The total mass of the combined disk\nsystem is 3M, so the final velocity is\nThe total angular momentum of the system is also conserved, but in this case we\nmust be more careful, as the question asks for the final spin angular velocity, so it\nis important to calculate the initial and final angular momenta about the center of\nmass of the combined disk system. This position lies at a distance:\nbelow the contact point of the two disks. About this point, the initial angular\nmomentum of the system comes from both rotation of the moving disk and its\ncenter of mass translation with respect to the center of mass of the combined disk\nsystem:\nThe final moment of inertia of the two disks can be found by first adding the center\nof mass moments of inertia of the two disks separately and thn applying the\nparallel axis theorem (moving to the center of mass of the combined disk system):\nHence the final spin angular velocity is\n(b) For the final spin angular velocity to be zero, the two terms above cancel, so\nPage 12 of 25\n\n8.012 Fall 2008\nFinal Exam\n(c) To keep the math clean, it is assumed that the final system is not spinning, so\nthat ω0 and v0 are related as in part (b). The initial energy is therefore:\nThe final energy is just the translation energy:\nso the total energy loss is:\nPage 13 of 25\n\n8.012 Fall 2008\nFinal Exam\nProblem 5: Cylindrical Top [15 pts]\nM\nCOM\nr\nμ = 0\nΔp\nL\nR\nA cylinder of mass M, length L and radius R is spinning about its long axis with\nangular velocity\non a frictionless horizontal surface. The cylinder is\ngiven a sharp, horizontal strike with impulse Δp at a distance r from its center of\nmass (COM). Assume that constant gravitational acceleration acts downward.\nNOTE: you do not need to use Euler's equations to solve this problem.\n(a) [5 pts] What is the translational velocity of the cylinder after the impulse\n(magnitude and direction)?\n(b) [5 pts] The strike imparts an angular momentum impulse to the cylinder which\ncauses it to lift up at one end. At what angle α will the cylinder be tilted after the\nimpulse and which end of the cylinder lifts up? Assume that the angular\nmomentum impulse is much smaller than the spin angular momentum.\n(c) [5 pts] After the cylinder tilts up, it effectively becomes a top. Determine its\nprecessional rate and the direction of precession. Assume that nutational motion is\nnegligible (i.e., α remains effectively constant) and that R << L (i.e., that the\ncylinder can be approximated as a thin rod for this part).\n(d) [5 pts BONUS] For a strong enough impulse, the cylinder will tilt high enough\nto precess in the opposite direction. What is the minimum tilt angle for this to\nhappen and what is the minimum impulse required? (Note that you cannot assume\nR << L here. This problem is similar to the \"tipping battery\" trick pointed out by\none of the 8.012 students.)\nPage 14 of 25\n\n8.012 Fall 2008\nFinal Exam\nSOLUTION TO PROBLEM 5:\n(a) The impulse provides the only external force to the system, so the total\nmomentum of the cylinder is simply the impulse, Δp in the y-direction. Hence, the\ntranslational velocity of the cylinder is:\n(b) The angular impulse imparted on\nr of mass is\ny to the\nα\nthe cylinder about its cente\nThis impulse adds vectorall\nspin angular momentum of the cylinder, as shown in the figure to the right. If we\nassume that LS >> ΔL (our standard gyroscopic approximation), then the\nmagnitude of the total angular momentum is still equal to IωS but points in a\ndirection offset by an angle α upwards. Since this is still the cylinder spinning\nabout its axis, it must be that the right side of the cylinder tips up by an angle α:\n(c) With the cylinder tipped up, gravity and the\nw exert\nl cause\nrecess\nmenta\nthe\nasured\n\nN = Mg\nMg\nL/2cosα - Rsinα\nα\nnormal contact force on the ground no\na net torque on the cylinder, which wil\nthe spin angular momentum vector to p\nwith rate Ω. Let's measure angular mo\nand torque about the center of mass of\ncylinder (alternately we could have me\nabout the pivot point, but since N=Mg, the\nresult is the same). The horizontal lever arm between the pivot point and the center\nof mass is (L/2)cosα - Rsinα, but assuming L >> R we can drop the second term.\nThe torque is then:\nPage 15 of 25\n\n8.012 Fall 2008\nFinal Exam\nusing here our expression for the time derivative of a vector (LS) in a rotating\nreference frame. The precession vector must point along the z-direction, a fact we\ncan ascertain by considering that gravity would initially pull the spin angular\nmomentum vector down, so to conserve total angular momentum the precession\nangular momentum vector must point upward. The precession vector rotates only\nthe radial component of the spin angular momentum vector, hence:\nSolving for the precession rate:\nnote that the I here is the moment inertia about the spinning axis, not about the\nL/2\nR\nα\nα\n90o-α\nprecession axis.\nfrom the solution to (a) this places a constraint on the\nimpulse required:\nNote that this is approximate, as we no longer satisfy the\ngyroscopic approximation that LS >> ΔL (indeed, they are of the same order of\nmagnitude in this case).\n(d) To precess in the other direction, the center of mass\nmust be inside the pivot point of the disk, which happens\nat a critical angle (see right):\nPage 16 of 25\n\n8.012 Fall 2008\nFinal Exam\nProblem 6: Bead on a Spinning Rod [15 pts]\nM\nω\nr0\nA bead of mass M is placed on a frictionless, rigid rod that is spun about at one end\nat a rate ω. The bead is initially held at a distance r0 from the end of the wire. For\nthe questions below, treat the bead as a point mass. Ignore gravitational forces.\n(a) [5 pts] What force is necessary to hold the bead in place at r0? Indicate both\nmagnitude and direction.\n(b) [5 pts] After the bead is released, what is its position in the inertial frame (in\npolar coordinates) as a function of time?\n(c) [5 pts] Now calculate the fictitious forces on the bead in a reference frame that\nis rotating with the wire. What real force must the rod exert on the bead in both the\nrotating and inertial frames?\nPage 17 of 25\n\n8.012 Fall 2008\nFinal Exam\nSOLUTION TO PROBLEM 6:\n(a) The force applied to hold the bead in place is simply the centripetal force:\n(b) In the inertial frame, we can write down the equations of motion in polar\ncoordinates assuming that there is no radial force acting (no friction or constraint\nforce):\nHere, N is some normal force acting on the bead in the angular direction (important\nfor part c). The angular position is straightforward, since the rod is rotating at\nconstant angular rate, hence,\nFor the radial position, we must solve the radial equation of motion:\nThis can be done by trial, or you can simply remember that the general solution for\nthis equation is:\nUsing the initial conditions r(0) = r0 and dr/dt(0) = 0, we find:\nSo\n(c) In the rotating reference frame, there is only radial motion, and there are two\nfictitous forces acting: centrifugal and coriolis forces:\nPage 18 of 25\n\n8.012 Fall 2008\nFinal Exam\nThe angular equation of motion in the rotating frame is:\nwhere N is again the angular normal force acting on the bead, and the net angular\nacceleration component is 0 since θ is constant in the rotating frame. Hence\nPage 19 of 25\n\n8.012 Fall 2008\nFinal Exam\nProblem 7: Central Potential [15 pts]\nA particle of mass m moves within a region under the influence of a force of the\nform\nThe particle is initially at a distance r0 from the origin of the force, and initially\nmoves with velocity v0 in a tangential direction.\n(a) [5 pts] Derive and sketch the effective potential of this system as a function of\nradius from the origin. Indicate all important inflection points. Can the particle\npass through the origin of this reference frame?\n(b) [5 pts] Find the velocity v0 required for the particle to move in a purely circular\norbit at a radius r0 with this force law.\n(c) [5 pts] Compute the frequency of small oscillations about this equilibrium\nradius. How does the period of these oscillations compare to the orbital period?\nPage 20 of 25\n\n8.012 Fall 2008\nFinal Exam\nSOLUTION TO PROBLEM 7:\n(a) The effective potential arises from the radial equation of motion assuming that\nthe total angular momentum is a constant:\nwhere the angular momentum is defined as\nThe potential arising from this total force law is\nThe figure above provides a rough sketch of this function (with A = 4 and l2 = 2m).\nThere is one minimum inflection (equilibrium) point where the net force vanishes:\nPage 21 of 25\n\n8.012 Fall 2008\nFinal Exam\nThis is a stable equilbrium point. The potential tends to infinity as r → 0, so it is\nnot possible to pass through the origin with this potential.\n(b) For a purely circular orbit, the object must reside at its minimum radius in the\npotential, hence:\n(c) The frequency of small oscillations in any potential can be derived from the\nsecond derivative of the potential about its (stable) equilibrium point:\nSubstituting in our expression for v0 from part (b) reduces this to:\nThe period of this oscillation is:\nPage 22 of 25\n\n8.012 Fall 2008\nFinal Exam\nThe period of rotational motion is:\nHence, the ratio of these periods is\n.\nPage 23 of 25\n\nVelocity in polar\ncoordinates\nAcceleration in polar\ncoordinates\nCenter of mass (COM) of a\nrigid body\nVolume element in\ncylindrical coordinates\nKinetic energy\nWork\nPotential Energy\n(for conservative forces)\nwhere\nAngular momentum\nTorque\nFixed axis rotation:\n8.012 Fall 2008\nFinal Exam\nUSEFUL EQUATIONS\nPage 24 of 25\n\nCOM Moment of inertia\nfor a uniform bar\nCOM Moment of inertia\nfor a uniform hoop\nCOM Moment of inertia\nfor a uniform disk\nCOM Moment of inertia\nfor a uniform sphere\nScalar parallel axis theorem\nMoments of inertia tensor\n(permute x→y→z)\nEuler's Equations\n(permute 1→2→3)\nTime derivative between\nFictitious force in an\naccelerating frame\nFictitious force in a\nrotating frame (Ω constant)\nTaylor Expansion of f(x)\n8.012 Fall 2008\nFinal Exam\ninertial and rotating frames\nPage 25 of 25"
    },
    {
      "category": "Exam",
      "title": "Exam 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-012-physics-i-classical-mechanics-fall-2008/9f43769bfcbf2be1a6e706aa240ef486_exam1.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n8.012 Physics I: Classical Mechanics\nFall 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nMASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Physics\nPhysics 8.012\nFall 2008\nExam 1\nNAME: _____________\n_ _ _ __________________\nInstructions:\n1. Do all FIVE (5) problems. You have 90 minutes.\n2. SHOW ALL WORK. Be sure to circle your final answer.\n3. Read the questions carefully.\n4. All work must be done in this booklet in workspace provided. Extra\nblank pages are provided at the end if needed.\n5. NO books, notes, calculators or computers are permitted. A sheet of\nuseful equations is provided on the last page.\nYour Scores\nProblem Maximum Score Grader\nTotal\n\n8.012 Fall 2008\nQuiz 1\nProblem 1: Quick Multiple Choice Questions [10 pts]\nFor each of the following questions circle the correct answer. You do not need to\nshow any work.\n(a) Which of the following is not a valid force law?\nwhere b has units of\nNewtons\nwhere G is the\ngravitational\nforce constant\nwhere b has units of\nkg\nwhere b has\nunits of\nradians\n(b) A tire rolls on a flat surface with constant\nangular velocity Ω and velocity\nas shown in the\ndiagram to the right. If V > ΩR, in which direction\ndoes friction from the road act on the tire?\nToward the left\nToward the right\nFriction does not act\non the tire\nPage 2 of 8\n\n8.012 Fall 2008\nQuiz 1\n(c) You pull a brick of mass M sitting on\na flat table using a thick rope of mass m.\nFriction between the surface of the table\nand the brick is sufficient so that the brick\nremains at rest. Compared to the force with which you pull on one end of the rope,\nthe force that the other end of the rope exerts on the brick is:\nLess\nGreater\nThe same\nZero\n(d) As a swinging pendulum passes through its lowest point, in which direction\ndoes the total net force act?\nOnly in an\nangular direction\nOnly in a radial\ndirection\nIn both angular\nand radial\ndirections\nThere is zero net\nforce at the\nequilibrium point\n(e) A pendulum with mass M and length L is released as a small angle off of\nvertical and oscillates with period P. If we double the mass and halve the length of\nthe pendulum then the new period is\nPage 3 of 8\n\n8.012 Fall 2008\nQuiz 1\nProblem 2: The Accelerated Atwood Machine [30 pts]\nTwo blocks of masses M1 and M2 (M2 > M1) are stacked on top of each other and\nstart at rest on the surface of a frictionless table. The masses are connected via an\nideal pulley (massless string and nearly massless pulley wheel), and the coefficient\nof static friction (assumed equal to the coefficient of kinetic friction) between the\nblock surfaces is μS. The pulley is accelerated to the right by a force\n, resulting\nin an acceleration of the pulley wheel of\n. Assume that gravity acts with\nconstant acceleration g downward.\n(a) [5 pts] Draw force diagrams for each of the blocks and the pulley wheel, clearly\nindicating all horizontal and vertical forces acting on them.\n(b) [5 pts] If the blocks do not slip relative to each other, what are their\naccelerations?\n(c) [10 pts] Assume that the blocks do slip relative to each other. Determine each\nblock's horizontal acceleration as a function of the parameters specified above\n(i.e., M1, M2, μS, g, a and F). Which block has a higher acceleration? Be sure to\nwork in an inertial reference frame!\n(d) [10 pts] What is the minimum force F required to cause one block to slip\nrelative to the other? Assume that the mass of the pulley is negligible compared to\nthose of the blocks.\nPage 4 of 8\n\n8.012 Fall 2008\nQuiz 1\nProblem 3: Hanging Rope [20 pts]\nConsider a rope of total mass M and length L suspended at rest from a fixed\nmount. The rope has a linear mass density that varies with height as λ(z) =\nλ0sin(πz/L) where λ0 is a constant. Constant gravitational acceleration g acts\ndownward.\n(a) [5 pts] Determine the constant λ0.\n(b) [5 pts] What is the tension force at the free (bottom) end of the rope?\n(c) [10 pts] Calculate the tension along the rope as a function of distance z below\nthe mount.\nPage 5 of 8\n\n8.012 Fall 2008\nQuiz 1\nProblem 4: Don't Slip! [20 pts]\nμ\nM\nr\nAn 8.012 student of mass M stands on a rigid disk at a distance r from the center\naxis. Assume that the coefficient of friction between the student's shoes and the\ndisk surface is μ. At time t = 0, the disk begins to rotate with a constant angular\nacceleration rate\n. Assume that gravity acts with constant acceleration g\ndownward.\n(a) [5 pts] What is the maximum value of angular acceleration rate (αmax) such that\nthe student does not immediately slip?\n(b) [10 pts] Assuming that α < αmax, what is the total friction force acting on the\nstudent as a function of time (prior to slipping)? Write your answer as a vector in\npolar coordinates.\n(c) [5 pts] Assuming that α < αmax, how long after the disk starts rotating will the\nstudent slip?\nPage 6 of 8\n\n8.012 Fall 2008\nQuiz 1\nProblem 5: Will the LHC Destroy the World? [20 pts]\nThere has been some speculation that the Large Hadron Collider (or LHC), a\nparticle accelerator experiment that will smash protons together at incredible\nenergies, might create a small black hole that could devour the Earth. Let's\nimagine that the LHC does create such a black hole of mass M (assume initially\nthan M << MEartg). Once it has formed (initially at rest), the black hole will\nimmediately fall under the influence of gravity toward the center of the Earth.\nAssume for this problem that the Earth has a constant volume mass density ρ, and\nthat the black hole doesn't eat that much of the Earth as it passes through it.\n(a) [5 pts] Using dimensional analysis, come up with an order-of-magnitude\nexpression for the oscillation period of the black hole as it passes through the Earth\nbased on the relevant parameters of this problem.\n(b) [10 pts] Now show that the black hole undergoes simple harmonic motion\n(similar to spring motion) by determining its acceleration as a function of time, and\nderive an expression for the oscillation period. How does this compare with your\nanswer in part (a)?\n(c) [5 pts] The Earth does not have a constant mass density but rather gets denser\ncloser to its center. Assuming that it is still spherically symmetric, would this fact\ncause the oscillation period of the black hole to be shorter or longer? Justify your\nanswer.\n(d) [10 pts BONUS] Assume that the particle collision that creates the black hole\nconverts the equivalent of an entire year's worth of global energy production\n(about 5x1020 Newton-meters) into a single black hole at rest. Also, the radius of a\nblack hole is the distance at which the gravitational escape velocity exceeds the\nspeed of light. Based on these assumptions, use dimensional analysis to estimate\nthe mass and radius of the black hole to within an order of magnitude. Based on\nthese values, should we worry about an LHC black hole? Some important\nnumbers for this question are the gravitational constant, G ≈ 7x10-11 m3 kg-1s-2; the\nspeed of light, c ≈ 3x108 m/s; and, for comparison, the radius of a proton, rproton ≈\n10-15 m, and the radius of the Earth, REarth ≈ 6x106 m.\nPage 7 of 8\n\n8.012 Fall 2008\nQuiz 1\nUSEFUL EQUATIONS\nTrajectory for constant acceleration\nVelocity in polar coordinates\nAcceleration in polar coordinates\nTaylor expansion of function f(x):\nNewton's Gravitational Law\nPage 8 of 8"
    },
    {
      "category": "Exam",
      "title": "Exam 1 Solutions",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-012-physics-i-classical-mechanics-fall-2008/4592a0f28149124e7a6eee75ee76d934_exam1sol.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n8.012 Physics I: Classical Mechanics\nFall 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nMASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Physics\nPhysics 8.012\nFall 2008\nExam 1\nNAME: _____________SOLUTIONS _ _ _ __________________\nInstructions:\n1. Do all FIVE (5) problems. You have 90 minutes.\n2. SHOW ALL WORK. Be sure to circle your final answer.\n3. Read the questions carefully.\n4. All work must be done in this booklet in workspace provided. Extra\nblank pages are provided at the end if needed.\n5. NO books, notes, calculators or computers are permitted. A sheet of\nuseful equations is provided on the last page.\nYour Scores\nProblem Maximum Score Grader\nTotal\n\n8.012 Fall 2008\nQuiz 1\nProblem 1: Quick Multiple Choice Questions [10 pts]\nFor each of the following questions circle the correct answer. You do not need to\nshow any work.\n(a) Which of the following is not a valid force law?\nwhere b has units of\nNewtons\nwhere G is the\ngravitational\nforce constant\nwhere b has units of\nkg\nwhere b has\nunits of\nradians\nBoth of these solutions are right, the first because it doesn't satisfy Newton's 3rd\nLaw (switch 1 and 2 and you don't get equal and opposite), the second because of\nunits\n(b) A tire rolls on a flat surface with constant\nangular velocity Ω and velocity\nas shown in the\ndiagram to the right. If V > ΩR, in which direction\ndoes friction from the road act on the tire?\nToward the left\nToward the right\nFriction does not act\non the tire\nThe intention was to have friction spinning the wheel up, but because of the word\n\"constant\" in the question, we deemed this question to ambiguous so it wasn't\ncounted in the final score\nPage 2 of 15\n\n8.012 Fall 2008\nQuiz 1\n(c) You pull a brick of mass M sitting on\na flat table using a thick rope of mass m.\nFriction between the surface of the table\nand the brick is sufficient so that the brick\nremains at rest. Compared to the force with which you pull on one end of the rope,\nthe force that the other end of the rope exerts on the brick is:\n(d) As a swinging pendulum passes through its lowest point, in which direction\ndoes the total net force act?\nLess\nGreater\nThe same\nZero\nThere is no net force on the rope (or block), so there cannot be a difference in\ntension along the rope. Hence the forces are the same at both ends.\nOnly in an\nangular direction\nOnly in a radial\ndirection\nIn both angular\nand radial\ndirections\nThere is zero net\nforce at the\nequilibrium point\nBecause the mass is moving in circular motion, there must be a radial force. At the\nlowest point there are no net angular forces, however.\n(e) A pendulum with mass M and length L is released as a small angle off of\nvertical and oscillates with period P. If we double the mass and halve the length of\nthe pendulum then the new period is\nDoubling the mass does not affect the period but decreasing the length decreases\nthe period, which is 2π(l/g)^0.5\nPage 3 of 15\n\n8.012 Fall 2008\nQuiz 1\nProblem 2: The Accelerated Atwood Machine [30 pts]\nTwo blocks of masses M1 and M2 (M2 > M1) are stacked on top of each other and\nstart at rest on the surface of a frictionless table. The masses are connected via an\nideal pulley (massless string and nearly massless pulley wheel), and the coefficient\nof static friction (assumed equal to the coefficient of kinetic friction) between the\nblock surfaces is μS. The pulley is accelerated to the right by a force\n, resulting\nin an acceleration of the pulley wheel of\n. Assume that gravity acts with\nconstant acceleration g downward.\n(a) [5 pts] Draw force diagrams for each of the blocks and the pulley wheel, clearly\nindicating all horizontal and vertical forces acting on them.\n(b) [5 pts] If the blocks do not slip relative to each other, what are their\naccelerations?\n(c) [10 pts] Assume that the blocks do slip relative to each other. Determine each\nblock's horizontal acceleration as a function of the parameters specified above\n(i.e., M1, M2, μS, g, a and F). Which block has a higher acceleration? Be sure to\nwork in an inertial reference frame!\n(d) [10 pts] What is the minimum force F required to cause one block to slip\nrelative to the other? Assume that the mass of the pulley is negligible compared to\nthose of the blocks.\nPage 4 of 15\n\n8.012 Fall 2008\nQuiz 1\n(a) The force diagrams are as shown below - note that the weight of the pulley is\nspecifically excluded here and the string tension assumed to be constant because\nthe string is massless (no points were taken off for not assuming these things).\nCommon errors were not matching up force pairs; i.e., Ff (crucial!) and N1\nNote that the direction of the friction force takes some thought, but can be\ndetermined if one considers the problem without friction. In that case the smaller\nmass M1 would move to the right faster (same tension force but smaller mass);\nhence, friction acts to stop that relative motion by acting toward the left on M1.\nNewton's 3rd law then states that the same friction force acts toward the right on\nM2.\n(b) If the blocks do not slip, then their accelerations are exactly equal to that of the\npulley, a. This can be shown formally through the constraint equation:\nand the condition\nBecause F is also specified, one can also determine solve for the equations of\nmotion assuming that the two accelerations are the same and equally determine:\nPage 5 of 15\n\n8.012 Fall 2008\nQuiz 1\nalthough care must be taken here since μ ≤ μS.\n(c) Based on the force diagram above, the equations of motion are:\nBecause the pulley is effectively massless, MPaP ≈ 0 and hence F = 2T. This alone\nprovides expressions for the two pulleys:\nWe can also solve for the rope tension using the constrain equation:\nsubstituting back in one can derive\nnote that\n.\nPage 6 of 15\n\n8.012 Fall 2008\nQuiz 1\n(d) There are number of ways to consider this problem, but the most obvious is to\nconsider the point at which\n(prior the slipping both masses are\naccelerating with a). This yields any of the following conditions based on the\nanswers to part (c):\nA third pair of valid expressions (in terms of F and a) are\nagain note that\n.\nPage 7 of 15\n\n8.012 Fall 2008\nQuiz 1\nProblem 3: Hanging Rope [20 pts]\nConsider a rope of total mass M and length L suspended at rest from a fixed\nmount. The rope has a linear mass density that varies with height as λ(z) =\nλ0sin(πz/L) where λ0 is a constant. Constant gravitational acceleration g acts\ndownward.\n(a) [5 pts] Determine the constant λ0.\n(b) [5 pts] What is the tension force at the free (bottom) end of the rope?\n(c) [10 pts] Calculate the tension along the rope as a function of distance z below\nthe mount.\nPage 8 of 15\n\n8.012 Fall 2008\nQuiz 1\n(a) The constant can be found by noting that the integral of the linear density over\nthe length of the rope should equal the mass; i.e.,\n(b) Because there is nothing hanging from the bottom end, the tension force is\nsimply 0.\n(c) There are two ways of determining this. First, you can consider that the tension\nat any height z is simply that required to hold up the mass below z; i.e.,\nAlternately, one can set up a differential equation at any height z requiring that the\ndifference in tensions must support the differential mass at that point (note that z\nincreases downward); i.e.,\nwhich reduces to the same result. Note that here we have used the result from (b)\nthat T(L) = 0.\nPage 9 of 15\n\n8.012 Fall 2008\nQuiz 1\nProblem 4: Don't Slip! [20 pts]\nμ\nM\nr\nAn 8.012 student of mass M stands on a rigid disk at a distance r from the center\naxis. Assume that the coefficient of friction between the student's shoes and the\ndisk surface is μ. At time t = 0, the disk begins to rotate with a constant angular\nacceleration rate\n. Assume that gravity acts with constant acceleration g\ndownward.\n(a) [5 pts] What is the maximum value of angular acceleration rate (αmax) such that\nthe student does not immediately slip?\n(b) [10 pts] Assuming that α < αmax, what is the total friction force acting on the\nstudent as a function of time (prior to slipping)? Write your answer as a vector in\npolar coordinates.\n(c) [5 pts] Assuming that α < αmax, how long after the disk starts rotating will the\nstudent slip?\nPage 10 of 15\n\n8.012 Fall 2008\nQuiz 1\n(a) Recall that the force acting on the student in polar coordinates is expressed as:\nat t=0,\n, so the force expression reduces to:\nwe want the case where the student doesn't slip, so\n(b) Now we have to explicitly consider the angular rate as a function of time,\nalthough note that the radius does not change so\nwhile\n. Then\n(c) Again we want to satisfy the condition:\nPage 11 of 15\n\n8.012 Fall 2008\nQuiz 1\nProblem 5: Will the LHC Destroy the World? [20 pts]\nThere has been some speculation that the Large Hadron Collider (or LHC), a\nparticle accelerator experiment that will smash protons together at incredible\nenergies, might create a small black hole that could devour the Earth. Let's\nimagine that the LHC does create such a black hole of mass M (assume initially\nthan M << MEartg). Once it has formed (initially at rest), the black hole will\nimmediately fall under the influence of gravity toward the center of the Earth.\nAssume for this problem that the Earth has a constant volume mass density ρ, and\nthat the black hole doesn't eat that much of the Earth as it passes through it.\n(a) [5 pts] Using dimensional analysis, come up with an order-of-magnitude\nexpression for the oscillation period of the black hole as it passes through the Earth\nbased on the relevant parameters of this problem.\n(b) [10 pts] Now show that the black hole undergoes simple harmonic motion\n(similar to spring motion) by determining its acceleration as a function of time, and\nderive an expression for the oscillation period. How does this compare with your\nanswer in part (a)?\n(c) [5 pts] The Earth does not have a constant mass density but rather gets denser\ncloser to its center. Assuming that it is still spherically symmetric, would this fact\ncause the oscillation period of the black hole to be shorter or longer? Justify your\nanswer.\n(d) [10 pts BONUS] Assume that the particle collision that creates the black hole\nconverts the equivalent of an entire year's worth of global energy production\n(about 5x1020 Newton-meters) into a single black hole at rest. Also, the radius of a\nblack hole is the distance at which the gravitational escape velocity exceeds the\nspeed of light. Based on these assumptions, use dimensional analysis to estimate\nthe mass and radius of the black hole to within an order of magnitude. Based on\nthese values, should we worry about an LHC black hole? Some important\nnumbers for this question are the gravitational constant, G ≈ 7x10-11 m3 kg-1s-2; the\nspeed of light, c ≈ 3x108 m/s; and, for comparison, the radius of a proton, rproton ≈\n10-15 m, and the radius of the Earth, REarth ≈ 6x106 m.\nPage 12 of 15\n\n8.012 Fall 2008\nQuiz 1\n(a) The important parameters are the mass of the Earth (ME ~ [M]), the radius of\nthe Earth (RE ~ [L]), the density of the Earth (ρ ~ [M/L3]) and the gravitational\nconstant (G ~ [L3T-2M-1]). Note that the mass of the black hole shouldn't matter\nbased on our knowledge of the gravitational force law (i.e., we are looking for an\naceeleration, which is independent of black hole mass). We are seeking a period ~\n[T], and the combinations that work are:\nHowever, ρ and Me/Re\n3 are degenerate with each other, hence either expression is\nviable.\n(b) We want to compute the force on the black hole as a function of radius from the\ncenter of the Earth using two important gravitational results: (1) the gravitational\nforce outside a spherical symmetric mass is equivalent to the force from a point\nmass and (2) inside a spherically symmetric shell an object feels no net\ngravitational force. Hence the black hole is only pulled in by the fraction of the\nEarth's mass that is interior to its radial position:\nwhere\nwhich has the form of a simple harmonic oscillator with period\nPage 13 of 15\n\n8.012 Fall 2008\nQuiz 1\n(c) The period will generally be shorter since the force (and hence acceleration) on\nthe black hole will be greater at a given radius as there is more total mass within\nthat radius. In the extreme case of a infinitesimal shell of mass the period can\nbecome very long as the BH will experience no acceleration past the thin shell (and\nthat acceleration will be the same as the case of a constant density ball).\n(d) For the black hole mass we can use Einstein's equation to relate energy to mass\n(an approximation to be sure), so m ≈ E/c^2 ≈ 5x1020 N-m/(9x1016 m2/s2) ≈ 5000\nkg, or about 5 tons.\nFor the radius, the relevant quantities are the black hole mass ([M]), G ([L3T-2M-1])\nto give a quantity that has dimension length. With the values given, this gives a\nradius of roughly 5x10-24 m - about 9 orders of magnitude smaller than a proton!\nSo I won't worry...\nand c ([L2/T2]), which can be combined as\nPage 14 of 15\n\n8.012 Fall 2008\nQuiz 1\nUSEFUL EQUATIONS\nTrajectory for constant acceleration\nVelocity in polar coordinates\nAcceleration in polar coordinates\nTaylor expansion of function f(x):\nNewton's Gravitational Law\nPage 15 of 15"
    },
    {
      "category": "Exam",
      "title": "Quiz 1 Equations",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-012-physics-i-classical-mechanics-fall-2008/f86d8c266cf4ad86b727856cf12df681_e1equations.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n8.012 Physics I: Classical Mechanics\nFall 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\n8.012 Fall 2008\nQuiz 1\nUSEFUL EQUATIONS\nTrajectory for constant acceleration\nVelocity in polar coordinates\nAcceleration in polar coordinates\nTaylor expansion of function f(x):\nPage 25 of 25"
    },
    {
      "category": "Exam",
      "title": "Exam 2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-012-physics-i-classical-mechanics-fall-2008/4769e1e9f16e380d2f9a5855e427a3a3_exam2.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n8.012 Physics I: Classical Mechanics\nFall 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nMASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Physics\nPhysics 8.012\nFall 2008\nExam 2\nNAME: ______________ _ _ _ _ _ _ _ _ _ _ __________________\nInstructions:\n1. Do all FIVE (5) problems. You have 90 minutes.\n2. SHOW ALL WORK. Be sure to circle your final answer.\n3. Read the questions carefully.\n4. All work must be done in this booklet in workspace provided. Extra\nblank pages are provided at the end if needed.\n5. NO books, notes, calculators or computers are permitted. A sheet of\nuseful equations is provided on the last page.\nProblem Maximum Score Grader\nTotal\n\n8.012 Fall 2008\nQuiz 2\nProblem 1: Quick Multiple Choice Questions [10 pts]\nFor each of the following questions circle the correct answer. You do not need to\nshow any work.\n(a) Which of the following is the result of an elastic\ncollision between the two isolated objects at right?\nm\n2m\nv\nv\nm\n2m\nv\nv/3\nm\n2m 2v/3\nm\n2m\nv/2\nm\n2m\nv\n(b) Which experiences the largest impulse?\nFully elastic\ncollision of 10 kg\nball dropped\nfrom 10 m\nFully inelastic\ncollision of 20 kg\nball dropped\nfrom 10 m\nFully elastic\ncollision of 20 kg\nball dropped\nfrom 5m\nThese all have\nthe same\nimpulse\n.\nPage 2 of 7\n\n8.012 Fall 2008\nQuiz 2\n(c) A cart traveling at speed v on a frictionless track starts to leak sand. What is\nthe cart's speed at a later time?\nGreater than v\nLess than v\nEqual to v\n(d) Consider the composite disk at right, with a main\nsection of mass density ρ and radius d, and a\nsubsection of mass density 2ρ and radius d/2. If O\nmarks the origin of our coordinate system, at the\ncenter of the composite disk, where is the disk's\ncenter of mass located?\nat O\nd/2 to right of O d/6 to right of O d/10 to right of O\n!\n2!\nd\nO\n(e) A block connected to a fixed wall by a spring\noscillates back and forth on a frictionless surface.\nWhen it reaches its maximum extent, a piece of clay\nis dropped onto it and instantaneously sticks. Which\nof the following is conserved in this collision?\nHorizontal\nmomentum\nTotal\nmechanical\nenergy\nTotal mechanical\nenergy and horizontal\nmomentum\nNone of these\nXMAX\nPage 3 of 7\n\n8.012 Fall 2008\nQuiz 2\nProblem 2: Collision [20 pts]\nm\n2m\nm\n2m\n!\nv\nv\nv\nU\nTwo balls, one of mass m and one of mass 2m, approach from orthogonal\ndirections with identical speeds v and collide. After the collision, the more\nmassive ball moves with the same speed v but downward (orthogonal to its original\ndirection) and the less massive ball moves with speed U at an angle θ with respect\nto horizontal. Assume that no external forces act during the collision.\n(a) [10 pts] Calculate the final speed U of the less massive ball and the angle θ.\n(b) [10 pts] Determine how much kinetic energy is lost or gained by the two balls\nduring the collision. Is this collision elastic, inelastic or superelastic?\nPage 4 of 7\n\n8.012 Fall 2008\nQuiz 2\nProblem 3: Cube on a Sphere [20 pts]\nR\nA small block starts from rest and slides down from the top of a fixed sphere of\nradius R, where R >> size of the block. The surface of the sphere is frictionless and\nconstant gravitational acceleration g acts downward.\n(a) [10 pts] Determine the speed of the block as a function of angle from the top\nwhile it remains in contact with the sphere.\n(b) [10 pts] At what angle does the block lose contact with the sphere?\nPage 5 of 7\n\n8.012 Fall 2008\nQuiz 2\nProblem 4: Tabletop Rocket [25 pts]\nμ\nM0/2\nvex\nM0/2\nA rocket of total mass M0, half of which is fuel, starts at rest on a long horizontal\ntable. The coefficient of friction between the rocket and table surfaces is μ. At\ntime t = 0, the rocket is ignited, ejecting fuel out at a constant rate γ = |dM/dt| with\nvelocity vex relative to the rocket. Constant gravitational acceleration g acts\ndownward.\n(a) [10 pts] What condition must be met for the rocket to start moving at t = 0?\n(b) [10 pts] Assuming that the rocket satisfies this requirement, what is the\nmaximum speed VMAX achieved by the rocket?\n(c) [5 pts] How far does the rocket go after it runs out of fuel? You can express\nyour answer in terms of VMAX.\n(d) [BONUS 5 pts] How far does the rocket travel in total? For this you will need\nto make use of the following integral:\nPage 6 of 7\n\n8.012 Fall 2008\nQuiz 2\nProblem 5: Planet Orbit [25 pts]\nr\nM\nm\nR\nA small planet of mass m is in a circular orbit of radius r around a star of mass M\nand radius R in otherwise empty space (assume M >> m so the star is stationary).\n(a) [10 pts] Determine the potential energy U(r), the kinetic energy K(r) and the\ntotal mechanical energy E(r) of the planet in terms of G, M and r assuming U→0\nas r→inf.\n(b) [5 pts] Determine the minimum amount of mechanical energy that must be\nadded to the planet to cause it to escape from the star (i.e., r→inf). By what factor\nmust the speed of the planet be increased to cause it to escape?\n(c) [5 pts] Now assume that the planet in subject to a viscous force of the form\nis the direction of motion. Compute the loss of\nmechanical energy in one orbital period in terms of G, M, r and A. Assume that\nthis loss is small enough that neither the orbital radius nor speed of the planet\nwhere A is a constant and\nchanges appreciably in one orbit.\n(d) [5 pts] Building from (c), compute the change in radius of the planet in one\norbital period due to the viscous force and the corresponding radial velocity based\non the assumptions above, in terms of G, M, r and A. Does the planet fall into the\nstar or away from it?\nPage 7 of 7"
    },
    {
      "category": "Exam",
      "title": "Exam 2 Solutions",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-012-physics-i-classical-mechanics-fall-2008/4f115573bb20efc33f9a73454ebca220_exam2sol.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n8.012 Physics I: Classical Mechanics\nFall 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nMASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Physics\nPhysics 8.012\nFall 2008\nExam 2\nSOLUTIONS\nNAME: ______________ _ _ _ _ _ _ _ _ _ _ __________________\nMIT ID number: __________________________________________________\nInstructions:\n1. Do all FIVE (5) problems. You have 90 minutes.\n2. SHOW ALL WORK. Be sure to circle your final answer.\n3. Read the questions carefully.\n4. All work must be done in this booklet in workspace provided. Extra\nblank pages are provided at the end if needed.\n5. NO books, notes, calculators or computers are permitted. A sheet of\nuseful equations is provided on the last page.\nYour Scores\nProblem Maximum Score Grader\nTotal\n\n8.012 Fall 2008\nQuiz 2\nProblem 1: Quick Multiple Choice Questions [10 pts]\nFor each of the following questions circle the correct answer. You do not need to\nshow any work.\n(a) Which of the following is the result of an elastic\ncollision between the two isolated objects at right?\nm\n2m\nv\nv\nm\n2m\nv\nv/3\nm\n2m 2v/3\nm\n2m\nv/2\nm\n2m\nv\nThis can be verified by examining conservation of momentum and energy (since it\nis an elastic collision).\n(b) Which experiences the largest impulse?\nFully elastic\ncollision of 10 kg\nball dropped\nfrom 10 m\nFully inelastic\ncollision of 20 kg\nball dropped\nfrom 10 m\nFully elastic\ncollision of 20 kg\nball dropped\nfrom 5m\nThese all have\nthe same\nimpulse\nThe first two choices experience the same impulse, which equals (1 or 2)\n.\nThe 3rd option experiences the largest impulse by a factor of\nPage 2 of 14\n\n8.012 Fall 2008\nQuiz 2\n(c) A cart traveling at speed v on a frictionless track starts to leak sand. What is\nthe cart's speed at a later time?\nEqual to v\nGreater than v\nLess than v\nThe sand experiences no force from the cart as it leaves, so it applies no force on\nat O\nd/2 to right of O d/6 to right of O d/10 to right of O\n!\n2!\nd\nO\nthe cart and cannot change the cart's momentum.\n(d) Consider the composite disk at right, with a main\nsection of mass density ρ and radius d, and a\nsubsection of mass density 2ρ and radius d/2. If O\nmarks the origin of our coordinate system, at the\ncenter of the composite disk, where is the disk's\ncenter of mass located?\nThis can be determined using the center of mass formula, adding together the\ncenters of mass of two solid disks with density ρ (superposition).\n(e) A block connected to a fixed wall by a spring\noscillates back and forth on a frictionless surface.\nWhen it reaches its maximum extent, a piece of clay\nis dropped onto it and instantaneously sticks. Which\nof the following is conserved in this collision?\nXMAX\nTotal\nTotal mechanical\nmechanical\nenergy and horizontal\nNone of these\nenergy\nmomentum\nWhen the clay sticks, in comes to rest so its mechanical energy is not conserved.\nHowever, the collision does not affect its horizonal momentum, which is 0, nor\nthat of the block.\nHorizontal\nmomentum\nPage 3 of 14\n\n8.012 Fall 2008\nQuiz 2\nProblem 2: Collision [20 pts]\nm\n2m\nm\n2m\n!\nv\nv\nv\nU\nTwo balls, one of mass m and one of mass 2m, approach from orthogonal\ndirections with identical speeds v and collide. After the collision, the more\nmassive ball moves with the same speed v but downward (orthogonal to its original\ndirection) and the less massive ball moves with speed U at an angle θ with respect\nto horizontal. Assume that no external forces act during the collision.\n(a) [10 pts] Calculate the final speed U of the less massive ball and the angle θ.\n(b) [10 pts] Determine how much kinetic energy is lost or gained by the two balls\nduring the collision. Is this collision elastic, inelastic or superelastic?\nPage 4 of 14\n\n8.012 Fall 2008\nQuiz 2\n[SOLUTION]\n(a) Momentum in both horizontal (x) and vertical (y) directions must be conserved,\nhence:\nso:\nso\n(b) The change in kinetic energy is just the change in the kinetic energy of the\nsmall mass (since the big mass has the same KE before and after the collision):\nthe collision is superelastic.\nPage 5 of 14\n\n8.012 Fall 2008\nQuiz 2\nProblem 3: Cube on a Sphere [20 pts]\nR\nA small block starts from rest and slides down from the top of a fixed sphere of\nradius R, where R >> size of the block. The surface of the sphere is frictionless and\nconstant gravitational acceleration g acts downward.\n(a) [10 pts] Determine the speed of the block as a function of angle from the top\nwhile it remains in contact with the sphere.\n(b) [10 pts] At what angle does the block lose contact with the sphere?\nPage 6 of 14\n\n8.012 Fall 2008\nQuiz 2\n[SOLUTION]\n(a) Only conservative forces are present, so total mechanical energy is conserved.\nHence the KE of the block comes simply from extracting gravitational potential\nenergy:\n(b) The block loses contact when the normal force\nacting on it disappears. Using polar coordinates and\nthe force diagram at right, we can write down the radial\nequation of motion:\nPage 7 of 14\n\n8.012 Fall 2008\nQuiz 2\nProblem 4: Tabletop Rocket [25 pts]\nμ\nM0/2\nvex\nM0/2\nA rocket of total mass M0, half of which is fuel, starts at rest on a long horizontal\ntable. The coefficient of friction between the rocket and table surfaces is μ. At\ntime t = 0, the rocket is ignited, ejecting fuel out at a constant rate γ = |dM/dt| with\nvelocity vex relative to the rocket. Constant gravitational acceleration g acts\ndownward.\n(a) [10 pts] What condition must be met for the rocket to start moving at t = 0?\n(b) [10 pts] Assuming that the rocket satisfies this requirement, what is the\nmaximum speed VMAX achieved by the rocket?\n(c) [5 pts] How far does the rocket go after it runs out of fuel? You can express\nyour answer in terms of VMAX.\n(d) [BONUS 5 pts] How far does the rocket travel in total? For this you will need\nto make use of the following integral:\nPage 8 of 14\n\n8.012 Fall 2008\nQuiz 2\n[SOLUTION]\n(a) The condition is that the rocket thrust (γvex) must exceed the force due to\nfriction (μM0g). Hence\n(b) The maximum speed occurs when the rocket has used up all its fuel (note: since\nthe friction force is not velocity-dependent, there is no \"terminal velocity\" in this\ncase). Applying conservation of momentum including the impulse from friction\nover a time dt (see figure):\nwhere we use the fact that a positive dm mass ejected corresponds to -dM lost\nfrom the rocket's total mass. The three terms can be separately integrated:\nPage 9 of 14\n\n8.012 Fall 2008\nQuiz 2\ntmax is the time it takes for the fuel to run out, which is (M0/2)/ γ. Hence,\n(c) After the rocket runs out of fuel, the problem reduces to a simple mass\naccelerated by a constant friction force:\nWe can also solve this using energy, since the work done on the rocket to reduce\nits kinetic energy to 0 is simply the friction force acting over the distance the\nrocket travels:\n(d) For those who attempted it, we simply use the expression of velocity as a\nfunction of time from our derivation of the rocket equation above, and integrate\nthis to get the distance traveled:\nwhere we now explicitly put in the time dependence of the rocket mass. To\nintegrate the first term on the right, we make the substitution:\nPage 10 of 14\n\n8.012 Fall 2008\nQuiz 2\nUsing our substitution for tmax for the limits of u and solving the left side and\nsecond term on the right side:\nThe total distance traveled is then\nPage 11 of 14\n\n8.012 Fall 2008\nQuiz 2\nProblem 5: Planet Orbit [25 pts]\nr\nM\nm\nR\nA small planet of mass m is in a circular orbit of radius r around a star of mass M\nand radius R in otherwise empty space (assume M >> m so the star is stationary).\n(a) [10 pts] Determine the potential energy U(r), the kinetic energy K(r) and the\ntotal mechanical energy E(r) of the planet in terms of G, M and r assuming U→0\nas r→inf.\n(b) [5 pts] Determine the minimum amount of mechanical energy that must be\nadded to the planet to cause it to escape from the star (i.e., r→inf). By what factor\nmust the speed of the planet be increased to cause it to escape?\n(c) [5 pts] Now assume that the planet in subject to a viscous force of the form\nis the direction of motion. Compute the loss of\nmechanical energy in one orbital period in terms of G, M, r and A. Assume that\nthis loss is small enough that neither the orbital radius nor speed of the planet\nwhere A is a constant and\nchanges appreciably in one orbit.\n(d) [5 pts] Building from (c), compute the change in radius of the planet in one\norbital period due to the viscous force and the corresponding radial velocity based\non the assumptions above, in terms of G, M, r and A. Does the planet fall into the\nstar or away from it?\nPage 12 of 14\n\n8.012 Fall 2008\nQuiz 2\n[SOLUTIONS]\n(a) The potential can be derived from the force law:\nIn this case we know that the constant C = 0 since U(inf) = 0. Hence:\nNote the m is a factor in this and other expressions (mistakenly neglected in the\nquestion).\nThe kinetic energy is\nbut we can substitute this using the force law in polar coordinates:\nthe total mechanical energy E = K + U is then:\n(b) The work required to effectively bring the planet to r = inf is simply that needed\nto climb the potential well to U = 0. In other words:\nPage 13 of 14\n\n8.012 Fall 2008\nQuiz 2\nSo the kinetic energy must double, which means the speed must increase by a\n.\nfactor of\n(c) The loss of mechanical energy simply comes from the work done by the\nfrictional force over one orbit (note: this is formally true since the potential energy\ndoesn't change - work only acts to change kinetic energy). Hence:\nwhere the substitution for mv2 from above is used\n(d) We can also write the change in energy as:\nto compute a velocity, we note that this change in r occurs over one orbit period for\nwhich:\nThus:\nNote that the radial velocity is negative, so the planet falls in to the star.\nPage 14 of 14"
    },
    {
      "category": "Exam",
      "title": "Quiz 2 Equations",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-012-physics-i-classical-mechanics-fall-2008/c17329eefb4ebc654bff7c4a2276b57c_e2equations.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n8.012 Physics I: Classical Mechanics\nFall 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\n8.012 Fall 2008\nQuiz 2\nUSEFUL EQUATIONS\nVelocity in polar\ncoordinates\nAcceleration in polar\ncoordinates\nUniversal Law of\nGravitational\nCenter of mass of a\nrigid body\nVolume element in\nrectangular coordinates\nVolume element in\ncylindrical coordinates\nKinetic energy\nWork-Energy Theorem\nPotential Energy\n(conservative forces)\nTaylor Expansion of\nf(x)\nPage 9 of 9"
    },
    {
      "category": "Exam",
      "title": "Exam 3",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-012-physics-i-classical-mechanics-fall-2008/d1129d8e8f3fd502c036a7898e8ae994_exam3.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n8.012 Physics I: Classical Mechanics\nFall 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nMASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Physics\nPhysics 8.012\nFall 2008\nExam 3\nNAME: _________________________________________________\nInstructions:\n1. Do all FIVE (5) problems. You have 90 minutes.\n2. SHOW ALL WORK. Be sure to circle your final answer.\n3. Read the questions carefully.\n4. All work must be done in this booklet in workspace provided. Extra\nblank pages are provided at the end if needed.\n5. NO books, notes, calculators or computers are permitted. A sheet of\nuseful equations is provided on the last page.\nYour Scores\nProblem Maximum Score Grader\nTotal\n\n8.012 Fall 2007\nQuiz 3\nProblem 1: Quick Multiple Choice Questions [10 pts]\nFor each of the following questions circle the correct answer. You do not need to\nshow any work.\n(a) [2 pts] A bicycle rider pedals up a hill with constant velocity\nv. In which direction does friction act on the wheels?\nUphill\nDownhill\nFriction does not act while the\nbike moves at constant velocity\n(b) [2 pts] A gyroscope is set to spin so that its\nspin vector points back to the mount. The\ngryoscope is initially set at an angle α below\nhorizontal and released from rest. Gravity acts\ndownward. In which direction does the\nprecession angular velocity vector point once\nthe gyroscope starts to precess?\n!\nUp\nDown\nInto the page\nOut of the page\n(c) [2 pts] A ball attached to rope is twirled around a stick as\nshown in the diagram at right. Ignore gravity and friction. Which\nof the following quantities is conserved in the motion of the ball?\nBe sure to write down all of the choices below that apply.\nAngular\nNone of these are\nEnergy\nMomentum\nMomentum\nconserved\nPage 2 of 7\n\n8.012 Fall 2007\nQuiz 3\n(d) [2 pts] A force F is applied to two\nidentical dumbbells, each comprised of\ntwo masses separated by a thin rod. The\nforce is applied at the center of mass for\nthe left dumbbell and directly on one of\nthe masses for the right dumbbell. If the\nforces are applied for the same duration of\ntime, which dumbbell acquires the\ngreatest center of mass velocity?\nLeft dumbbell\nRight dumbbell\nThey both have the same\nvelocity\n(e) [2 pts] For the same dumbbells in part (d), which one acquires the greatest\nkinetic energy from the applied force?\nThey both have the same\nLeft dumbbell\nRight dumbbell\nkinetic energy\nPage 3 of 7\n\n8.012 Fall 2007\nQuiz 3\nProblem 2: Catch Pendulum [20 pts]\nA pendulum consists of a ball of mass M attached to the end of a rigid bar of\nlength 2d which is pivoted at the center. At the other end of the bar is a container\n(\"catch\"). A second ball of mass M/2 is thrown into the catch at a velocity v where\nit sticks. For this problem, ignore the mass of the pendulum bar and catch, and\ntreat the balls as if they were point masses (i.e., neglect their individual moments\nof inertia).\n(a) [5 pts] What is the initial angular rotation rate of the pendulum after the\nincoming ball is caught?\n(b) [5 pts] How much total mechanical energy is lost when the incoming ball gets\nstuck in the catch?\n(c) [10 pts] What minimum velocity does the incoming ball need in order to invert\nthe pendulum (i.e., rotate it by 180o)?\nPage 4 of 7\n\n8.012 Fall 2007\nQuiz 3\nProblem 3: Swinging bar [25 pts]\nA uniform bar of mass M and length d is pivoted at one end. The bar is released\nfrom rest in a horizontal position and allowed to fall under constant gravitational\nacceleration.\n(a) [5 pts] How much work does the contact force apply to the system as a function\nof angle?\n(b) [5 pts] What is the angular speed of the bar as a function of angle?\n(c) [5 pts] What is the angular acceleration of the bar as a function of angle?\n(d) [10 pts] What are the vertical and horizontal forces the bar exerts on the pivot\nas a function of time angle?\nPage 5 of 7\n\n8.012 Fall 2007\nQuiz 3\nProblem 4: Atwood machine [25 pts]\nAn Atwood machine consists of a fixed pulley wheel of radius R, a rim of mass M\nand 6 spokes each with length R and mass M. An effectively massless string\npasses around the pulley wheel and connects two plates of mass M and 2M. The\nlighter plate is initially on the ground when the system is released from rest.\nConstant gravitational force acts downwards, and assume that the string never\nslips.\n(a) [5 pts] Calculate the moment of inertia of the pulley wheel.\n(b) [10 pts] Calculate the speed of the more massive plate when it hits the ground\n(there are multiple ways to solve this).\n(c) [10 pts] Assume that when it strikes the ground, the heavier plate sticks.\nFurthermore, the string remains \"stuck\" to the wheel, so it continues to pull the\nlighter plate up. How high does the lighter plate go?\nPage 6 of 7\n\n8.012 Fall 2007\nQuiz 3\nProblem 5: Rolling a coin [20 pts]\nα\nM\n2b\nR\nA coin (uniform solid circular disk) with mass M and radius b is set to roll in a\ncircular path of radius R on a table surface (R > b). The coin is given a spin\nangular velocity ωS, and as it rolls it is found to tilt at a small angle α with respect\nto vertical. Assume that the coin does not slip; constant gravity acts downward.\n(a) [5 pts] Determine the \"precession\" angular velocity of the rolling motion, Ω,\nboth magnitude and direction.\n(b) [5 pts] Determine the total angular velocity vector,\n, including both spin and\nprecession terms, in a polar coordinate system centered on the center of the coin's\ntrajectory.\n(c) [10 pts] Solve for the angle α in terms of the quantities given in the diagram\nabove. Be sure to examine all equations of motion!\n(d) [10 pts BONUS] Determine the total angular momentum vector,\n, in terms of\nthe quantities given in the diagram above, in a polar coordinate system centered on\nthe center of the coin's trajectory. For simplicity, assume that α is very small (i.e.,\nonly consider first order terms in α).\nPage 7 of 7"
    },
    {
      "category": "Exam",
      "title": "Exam 3 Solutions",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-012-physics-i-classical-mechanics-fall-2008/d185f8235a1d0c007871675d5b41beaa_exam3sol.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n8.012 Physics I: Classical Mechanics\nFall 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nMASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Physics\nPhysics 8.012\nFall 2008\nExam 3\nSOLUTIONS\nNAME: _________________________________________________\nInstructions:\n1. Do all FIVE (5) problems. You have 90 minutes.\n2. SHOW ALL WORK. Be sure to circle your final answer.\n3. Read the questions carefully.\n4. All work must be done in this booklet in workspace provided. Extra\nblank pages are provided at the end if needed.\n5. NO books, notes, calculators or computers are permitted. A sheet of\nuseful equations is provided on the last page.\nYour Scores\nProblem Maximum Score Grader\nTotal\n\n8.012 Fall 2007\nQuiz 3\nProblem 1: Quick Multiple Choice Questions [10 pts]\nFor each of the following questions circle the correct answer. You do not need to\nshow any work.\n(a) [2 pts] A bicycle rider pedals up a hill with constant velocity\nv. In which direction does friction act on the wheels?\nUphill\nDownhill\nFriction does not act while the\nbike moves at constant velocity\nFriction provides the only support against falling downhill, so it must point up.\n(b) [2 pts] A gyroscope is set to spin so that its\nspin vector points back to the mount. The\ngryoscope is initially set at an angle α below\nhorizontal and released from rest. Gravity acts\ndownward. In which direction does the\nprecession angular velocity vector point once\n!\nthe gyroscope starts to precess?\nUp\nDown\nInto the page\nOut of the page\nThe initial fall of the gyroscope causes the spin vector to point up. To conserve\nangular momentum in the z direction, precession rotation must point downward\n(c) [2 pts] A ball attached to rope is twirled around a stick as\nshown in the diagram at right. Ignore gravity and friction. Which\nof the following quantities is conserved in the motion of the ball?\nBe sure to write down all of the choices below that apply.\nOnly energy is conserved here.\nAngular\nNone of these are\nEnergy\nMomentum\nMomentum\nconserved\nPage 2 of 14\n\n8.012 Fall 2007\nQuiz 3\n(d) [2 pts] A force F is applied to two\nidentical dumbbells, each comprised of\ntwo masses separated by a thin rod. The\nforce is applied at the center of mass for\nthe left dumbbell and directly on one of\nthe masses for the right dumbbell. If the\nforces are applied for the same duration of\ntime, which dumbbell acquires the\ngreatest center of mass velocity?\nLeft dumbbell\nRight dumbbell\nThey both have the same\nvelocity\nBoth dumbbells receive the same impulse, hence their linear momenta are the\nsame, and as their masses are the same they have the same COM velocities.\n(e) [2 pts] For the same dumbbells in part (d), which one acquires the greatest\nkinetic energy from the applied force?\nLeft dumbbell\nRight dumbbell\nThey both have the same\nkinetic energy\nBoth dumbbells have the same linear velocity and hence linear kinetic energy, but\nthe right dumbbell will also have rotation kinetic energy associated with its motion.\nIn effect, the force for the right dumbbell acts over a longer distance than the left\none and does more work.\nPage 3 of 14\n\n8.012 Fall 2007\nQuiz 3\nProblem 2: Catch Pendulum [20 pts]\nA pendulum consists of a ball of mass M attached to the end of a rigid bar of\nlength 2d which is pivoted at the center. At the other end of the bar is a container\n(\"catch\"). A second ball of mass M/2 is thrown into the catch at a velocity v where\nit sticks. For this problem, ignore the mass of the pendulum bar and catch, and\ntreat the balls as if they were point masses (i.e., neglect their individual moments\nof inertia).\n(a) [5 pts] What is the initial angular rotation rate of the pendulum after the\nincoming ball is caught?\n(b) [5 pts] How much total mechanical energy is lost when the incoming ball gets\nstuck in the catch?\n(c) [10 pts] What minimum velocity does the incoming ball need in order to invert\nthe pendulum (i.e., rotate it by 180o)?\nPage 4 of 14\n\n8.012 Fall 2007\nQuiz 3\nSOLUTION TO PROBLEM 2\n(a) The angular momentum of the system relative to the pivot point just prior to the\nupper ball being caught is:\nAs there are no external torques acting on the system relative to the pivot point\nduring the time of the collision, the angular momentum can be determined as:\nhence,\n(b) The energy of the upper ball prior to sticking to the catch is:\nAfter the collision, all of the energy can be expressed as pure rotation about the\nstationary pivot point, hence:\nso\n(c) Because there are only conservative forces acting (the pivot does not move so it\ndoes no work) total mechanical energy is conserved. Assuming that the bottom of\nthe swing sets the zeropoint for gravitational potential, at the point that the ball\nsticks the total energy is:\nPage 5 of 14\n\n8.012 Fall 2007\nQuiz 3\nThe point at which the pendulum just comes to rest inverted, the bottom mass is at\nheight 2d:\nWith ΔE = 0 this gives:\nPage 6 of 14\n\n8.012 Fall 2007\nQuiz 3\nProblem 3: Swinging bar [25 pts]\nA uniform bar of mass M and length d is pivoted at one end. The bar is released\nfrom rest in a horizontal position and allowed to fall under constant gravitational\nacceleration.\n(a) [5 pts] How much work does the contact force apply to the system as a function\nof angle?\n(b) [5 pts] What is the angular speed of the bar as a function of angle?\n(c) [5 pts] What is the angular acceleration of the bar as a function of angle?\n(d) [10 pts] What are the vertical and horizontal forces the bar exerts on the pivot\nas a function of time angle?\nPage 7 of 14\n\n8.012 Fall 2007\nQuiz 3\nSOLUTION TO PROBLEM 3\n(a) The contact force is a fixed constraining force, and hence does no net work on\nthe system. The only work done is by gravitational force.\n(b) Since gravity (a conservative force) is the only force that produces net work on\nthe system, total mechanical energy is conserved. Energy provides the easiest (but\nnot only) route to velocity. Considering this a problem of pure rotation about the\npivot point:\nwhere\nabout the pivot point has been used.\n(c) Angular acceleration is directly tied to torques, so we can solve for the net\ntorque on the system as a function of angle. Choosing again the pivot point as the\norigin of our coordinate system:\nNote that this could also be solved from the relation:\nand plugging in the solution to (b).\n(d) One can solve this by computing the polar coordinate forces (being careful to\nget the changing orientation of the gravitation force):\nPage 8 of 14\n\n8.012 Fall 2007\nQuiz 3\nand then reorienting these forces back into a Cartesian system. An easier way is to\nrewrite the Cartesian coordinates in terms of θ. For the horizontal force (positive x\npointing toward the right):\nsubstituting in our expressions above:\nthis is the force the pivot exerts on the bar, the force the bar exerts on the pivot is:\nFor the vertical force (positive z pointing up):\nrearranging, and again flipping sign for the force on the pivot:\nPage 9 of 14\n\n8.012 Fall 2007\nQuiz 3\nProblem 4: Atwood machine [25 pts]\nAn Atwood machine consists of a fixed pulley wheel of radius R, a rim of mass M\nand 6 spokes each with length R and mass M. An effectively massless string\npasses around the pulley wheel and connects two plates of mass M and 2M. The\nlighter plate is initially on the ground when the system is released from rest.\nConstant gravitational force acts downwards, and assume that the string never\nslips.\n(a) [5 pts] Calculate the moment of inertia of the pulley wheel.\n(b) [10 pts] Calculate the speed of the more massive plate when it hits the ground\n(there are multiple ways to solve this).\n(c) [10 pts] Assume that when it strikes the ground, the heavier plate sticks.\nFurthermore, the string remains \"stuck\" to the wheel, so it continues to pull the\nlighter plate up. How high does the lighter plate go?\nPage 10 of 14\n\n8.012 Fall 2007\nQuiz 3\nSOLUTION TO PROBLEM 4\n(a) The moment of inertia of the pulley wheel is simply the sum of the moments of\ninertia of each spoke rotated about one end (MR2/3) and that of the rim (MR2).\nTaken together:\n(b) Again, this can be done using conservation of total mechanical energy, since\nthere are no nonconservative forces in (this part of) the problem. Setting the\nground to have zero potential energy, and assuming that the string must have a\nfixed length so each mass has the same velocity:\nThe rotation rate of the wheel is connected with the velocities of the masses\nthrough the no-slip requirement:\nhence for ΔE = 0:\n(c) Once the heavy mass strikes (and losses its kinetic energy) the remaining parts\nof the system will conserve energy, so we can use the same approach:\nPage 11 of 14\n\n8.012 Fall 2007\nQuiz 3\nPage 12 of 14\n\n8.012 Fall 2007\nQuiz 3\nProblem 5: Rolling a coin [20 pts]\nα\nM\n2b\nR\nA coin (uniform solid circular disk) with mass M and radius b is set to roll in a\ncircular path of radius R on a table surface (R > b). The coin is given a spin\nangular velocity ωS, and as it rolls it is found to tilt at a small angle α with respect\nto vertical. Assume that the coin does not slip; constant gravity acts downward.\n(a) [5 pts] Determine the \"precession\" angular velocity of the rolling motion, Ω,\nboth magnitude and direction.\n(b) [5 pts] Determine the total angular velocity vector,\n, including both spin and\nprecession terms, in a polar coordinate system centered on the center of the coin's\ntrajectory.\n(c) [10 pts] Solve for the angle α in terms of the quantities given in the diagram\nabove. Be sure to examine all equations of motion!\n(d) [10 pts BONUS] Determine the total angular momentum vector,\n, in terms of\nthe quantities given in the diagram above, in a polar coordinate system centered on\nthe center of the coin's trajectory. For simplicity, assume that α is very small (i.e.,\nonly consider first order terms in α).\nPage 13 of 14\n\n8.012 Fall 2007\nQuiz 3\nSOLUTION TO PROBLEM 5\n(a) This relation comes straight from the condition that the disk does not slip,\nwhich requires that the arclength traversed by the coin along its trajectory is the\nsame arclength covered along the edge of the coin per unit time, otherwise one of\nthe surfaces would be slipping relative to the other. This implies that:\nThis vector points upward, which can be inferred from the fact that if the coin does\nnot precess, it would tip over, causing the spin angular momentum in the\ndownward direction to increase. The coin must compensate for this by precessing\nin such a direction that its angular momentum vector points upwards (you can also\ninfer this from the direction of the rolling coin as well).\n(b) The total angular velocity vector is the sum of the spin and precession vectors.\nChoosing a polar coordinate system centered at the center of the orbit with the\nradial vector outward and the z-axis pointing up, these can be written as:\nhence\n(c) Now we want to consider the torque acting on the coin. We will consider our\nreference point to be the center of mass of the coin, since for this point torques are\nnot affected by non-inertial forces in the coin's moving frame of reference. The\npossible forces acting on the coin (see figure) are its weight (through the center of\nmass, which produces no torque), a vertical normal force which is equal in\nmagnitude to weight (since the coin is not falling in the z direction), and a\ntangential frictional force which provides the necessary radial force to keep the\ncoin moving in a circular trajectory, equal to\nPage 14 of 14\n\n8.012 Fall 2007\nQuiz 3\nto within our R >> b assumption. The total torque about the center of mass is\ntherefore:\nThis torque acts to change the direction of the total angular momentum vector, or\nmore precisely the radial component of the angular momentum vector that rotates\nas the coin goes along its trajectory. The spin component of this is simply:\nThe precession component is somewhat more complicated (see below), but is\ngoing to be smaller than the spin component in the radial direction by a factor of\nb/R because of the smaller precession rate. Hence, we can use the gyroscopic\napproximation and consider only the change in direction of the spin angular\nmomentum vector, namely the change in the radial component:\nPage 15 of 14\n\n8.012 Fall 2007\nQuiz 3\n(d) The total angular momentum of the coin about its COM is the sum of the spin\nangular momentum and precession angular momentum vectors:\nThe first is straightforward:\nThe second is not because of the tilt of the coin, which leads to off-axis terms in\nthe moment of inertia tensor (products of inertia). We can get an approximate\nhandle on this by first breaking up the precession rotation vector into components\nparallel and perpendicular to the disk plane through the center of mass, as shown in\nthe above diagram. Along these principal axes we compute the component angular\nmomenta:\nPage 16 of 14\n\n8.012 Fall 2007\nQuiz 3\nwe now have to project these axes back along the polar coordinates:\nwhich gives:\nwhere the latter comes from our small angle approximation. Combining this with\nthe spin angular momentum (and keeping the same approximation):\nNote that we retain the assumption made in (c), that the radial angular momentum\nis primarily from the spin, and that because b << R this component dominates the\nwhole angular momentum vector, making the gyroscopic approximation a realistic\none.\nPage 17 of 14"
    }
  ]
}