{
  "course_name": "Planning, Communications, and Digital Media",
  "course_description": "This course focuses on methods of digital visualization and communication and their application to planning issues. Lectures will introduce a variety of methods for describing or representing a place and its residents, for simulating changes, for presenting visions of the future, and for engaging multiple actors in the process of guiding action. Through a series of laboratory exercises, students will apply these methods in the construction of a web-based portfolio. The portfolio is not only the final project for the course, but will serve as a container for other course work throughout the MCP program.\nThis course aims to introduce students to (1) such persistent and recurring themes as place, race, power and the environment that face planners, (2) the role of digital technologies in representing, analyzing, and mobilizing communities, (3) MIT faculty and their work, (4) MIT’s computing environment and resources including Athena, Element K, the ESRI virtual campus, Computer Resources Laboratory (CRL), Campus Wide Information Systems Support (CWIS), the GIS Laboratory at Rotch Library and (5) software tools like Adobe® Photoshop® and Illustrator®, ESRI ArcView, Microsoft® Access, and Macromedia® Dreamweaver® that will assist them in creating digital images, working with relational databases, and launching a web-based portfolio.",
  "topics": [
    "Engineering",
    "Computer Science",
    "Graphics and Visualization",
    "Social Science",
    "Communication",
    "Urban Studies",
    "Urban Planning",
    "Engineering",
    "Computer Science",
    "Graphics and Visualization",
    "Social Science",
    "Communication",
    "Urban Studies",
    "Urban Planning"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 1 hour / session\n\nRecitations: 1 session / week, 1.5 hours / session\n\nCourse Description\n\nThis course focuses on methods of digital visualization and communication and their application to planning issues. Lectures will introduce a variety of methods for describing or representing a place and its residents, for simulating changes, for presenting visions of the future, and for engaging multiple actors in the process of guiding action. Students will apply these methods through a series of laboratory exercises as well as the construction of a web-based portfolio. The portfolio will serve as a container for these exercises and other work completed throughout the MCP program.\n\nThis course introduces students to (1) such persistent and recurring themes as place, race, and power face planners, (2) the role of digital technologies in representing, analyzing, and mobilizing communities, (3) MIT's computing environment and resources including Server, Element K, the ESRI virtual campus, Computer Resources Network, Web Communications Services, the GIS Laboratory at Rotch Library and (4) software tools like Adobe's(r) Photoshop(r), ESRI's ArcGISTM, Microsoft's(r) Excel and Access, as well as Macromedia's(r) Dreamweaver(r).\n\nEvaluation\n\nLab Exercises: In total, the laboratory exercises account for 50% of your grade. They are, however, weighted unevenly. Please note that labs 2, 4, 5, & 6 are each worth 10 points, while labs 1 and 3 are worth 5 points apiece.\n\nWeb-based Portfolio: You will begin thinking about and working on your web-based portfolio at the beginning of the semester and we expect that you will make improvements to it throughout the semester (ask for feedback and help at any time) and throughout your tenure at MIT. The web-based portfolio project will account for 20% of your final grade.\n\nFinal Project: The final project is a group project will constitute 30% of your final grade. Each member of the group is expected to contribute to the project, yet we expect group members to handle personal and other conflicts in a professional manner.\n\nFinally, attendance and participation count: We expect to see you in class and expect that you will contribute to the conversation.\n\nACTIVITIES\n\nPERCENTAGES\n\nLab Exercises\n\n50%\n\nWeb-based Portfolio\n\n20%\n\nFinal Project\n\n30%\n\nLateness Policy\n\nTurning in lab exercises promptly is important for keeping current with the subject matter, which is cumulative. As a result, we have adopted a lateness policy for exercises that are turned in after their due date. A late lab exercise will be accepted up until one week after the original due date for a loss of one grade (e.g., an \"A\" becomes a \"B\" or a \"check\" becomes a \"check minus\"). After one week, we will not accept the exercise, and you will receive a zero.\n\nHow Can We Improve?\n\nRather than wait until the end of the semester for feedback, we invite students to comment on the course throughout the semester. We will carefully consider suggestions submitted during the semester and implement appropriate changes along the way. If we are unable to make some changes in the current semester, they will be integrated into the next year's course design.",
  "files": [
    {
      "category": "Resource",
      "title": "lab1_help.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-204-planning-communications-and-digital-media-fall-2004/9a6458505b3f437d9a6161d660b544c5_lab1_help.pdf",
      "content": "Massachusetts Institute of Technology\nDepartment of Urban Studies and Planning\n11.204: Planning, Communications & Digital Media\nFall 2004\nLab 1: WWW Portal Page Building\nHelp Section\n1. Start Dreamweaver\nTo start Dreamweaver, click on the Start menu, and look for Macromedia Dreamweaver MX under Macromedia.\nSometimes it takes a long time (even a few minutes) to start the software on WinAthena machines.\n2. Create a \"site\" within Dreamweaver\nz Click on \"Site\" on the menu on the top of the window.\nz Choose \"New Site\" from the pulldown menu. The site definition wizard will pop up.\nz Type in the name for your web site, then click on \"Next >\". If the window does not look like this, tap on \"Basic\" tab on the top left\ncorner of the window.\nz Choose \"No, I do not want to use a server technology,\" then click on \"Next >\".\nz Choose \"Edit local copies on machine...\" In response to \"Where on your computer do you want to store files?\" Choose a folder and set\nthe folder at a location that you can find easily. By clicking this button, you can browse your drive. Then click on \"Next >\".\nz Choose \"None\" for \"How do you connect to...?\" Then click on \"Next >\".\n(If you will use a computer with an AFS access (at school or yours with AFS installed), you can choose \"Local/Network\" and set the\nserver folder at \"the MIT Server.\" If you set up this way, you can use the automatic \"Synchronize\"\nfunction of Dreamweaver.)\nz Click \"Done\" to open a site.\nYour site can be viewed in the \"Site\" window under the \"Files\" group on Dreamweaver. You can usually find it at the bottom and on the right.\nIf it does not appear on the screen, hit the F8 key.\n\n3. Create a web page (i.e. HTML file) as your portal page\nz To create a new file, go to the \"Site\" window on Dreamweaver, RIGHT CLICK over the green folder icon to expand the context menu,\nand choose \"New File.\" A new html file will be generated in the folder.\nz The default file name is \"untitled.htm,\" but change it to \"index.html\" Keep in mind that you can change the file name anytime by\nRIGHT CLICKing over the file, and choosing \"Rename.\"\nz In the main window (blank area), type in whatever information you want to put on your portal page. At minimum, it should contain\nyour name. You can change font size, color, typeface, and so on by using the Properties window, which is usually located at the bottom\nof the Dreamweaver window.\nz Think about image size (width/height/file size). Computers at CRN have relatively large screens. Check your pages with other\ncomputers to make sure that all images appear. If not, adjust them accordingly.\nz You might want to use \"Table\" function to create a visual grid to your web page. To do so, create a table (you can merge/split the cell\nlater on), and set the width and height to \"100%.\" Then you divide the table to create a grid. By using a table, you can place your\nimages/texts more flexibly.\n{ To create a table, go to \"Insert\" on the top, and choose \"Table.\"\n{ Rows: 1, Columns:1, Width: 100%, Border 0. This will create a table with a single cell. You can split/merge the cell(s) by\nRIGHT CLICKing on the cell to show a pulldown menu and choosing the operation from the pulldown menu.\n{ You can set alignment, width, height, and other properties for each cell.\nz Add a title to your page (the title will be shown in the window title bar; for example, the title of this page is \"Lab 1 Help Section...\").\nGo to \"Modify\" on the main menu at the top and choose \"Page Properties.\" Type in the title for the page in the \"Title:\" text box. You\ncan also change other properties for your page in this window. Because this is your portal page, the title should include your name.\nz Save the file by hitting \"Ctrl\" and \"S\" key or by choosing \"Save\" from the File menu.\nz While you are editing, you can see how your page will look in a web browser by hitting the F12 key.\n4. Prepare an image file for your portal page\nIf you are familiar with Adobe Photoshop and other image processing software...\nz Save your image in the JPEG/JPG or GIF format. TIFF, BMP, and other formats are not suitable for dissemination on the web.\nz The file should be saved within the folder for your web site, which you designated when you created a \"site\" on Dreamweaver in Step\n2.\nz You can create a new folder within that folder in order to save image files or you can save the image file directly under the folder.\nIf you are unfamiliar with Adobe Photoshop and other image processing software...\nz Choose one of the image files available at the MIT Server\\Data\\Images\\\nz Copy it onto the folder for your web site, which you designated when you created a \"site\" on Dreamweaver in Step 2.\nz You can create a new folder within the folder in order to save image files or you can save the image file directly under the folder.\nAlternatively, you might want to download a MIT icon file from the graphic identity web site. This site is worth bookmarking; it has\nletterhead templates and other useful things.\n5. Embed the image file on your portal page\nz Go back to Dreamweaver. To open your portal page on Dreamweaver, go to the Site window and double click on \"index.html\".\nz To embed the image, click on \"Insert\" in the main menu and choose \"Image.\"\nz Choose the image file in the \"Select Image Source\" window. Make sure to choose \"Document\" for the \"Relative to:\" option. Otherwise,\nthe image will not appear once you publish your web pages.\nz Strongly recommended: Click over the image once to active the image. In the Properties window, type a very short description (1-5\nwords) for the image in the ALT text box. This will allow visually impaired people to recognize the contents in the image.\n6. Create one or two additional pages within your site\nRepeat what you did in creating the portal page. This time, the file name(s) should be anything other than \"index.html\", but should end with\n\".html\" You can also use \".htm\" as the suffix for your additional pages. In most cases, \".html\" and \".htm\" are considered identical. However,\nyour portal page [index.html] should end with \".html\". MIT web server recognizes only \"index.html\" as the default HTML file for a file\nfolder.\n7. Create hyperlinks on the portal page to additional pages\nz Open the portal page.\n\nz If it is already open, you can choose \"index.html\" from the tab just below the main window. If it is not, double click on \"index.html\" in\nthe Site window.\nz Type in the text that you want to function as a hyperlink. Alternatively, you can also assign hyperlinks to images.\nz Go to the Properties window, click on the target symbol\nand drag it on to the target file in the Site window. After this action, the\ntext will be underlined and the color will be blue (if you did not assign a specific color).\nz If you are assigning a hyperlink to an image, choose the image by clicking the image once and dragging the target symbol (located next\nto the \"Link\" text box in the Properties window) to the target file in the Site window.\nz You can check if this hyperlink works by hitting [F12] to open the file in web browser, then clicking on the text.\n8. Create a hyperlink to MIT web site on your portal page. MIT web site should open in a separate window\nz Type in \"MIT\" or \"Massachusetts Institute of Technology\" (or whatever you deem appropriate) on the portal page. You may also\nchoose to embed a MIT logo image, which is available from the graphic identity web site.\nz Choose the text to highlight and go to the Properties window.\nz Type in \"http://web.mit.edu/\" in the \"Link\" box.\nz Choose \"_blank\" for the \"Target\" option. By doing so, the MIT web site will open in a new window when the hyperlink is clicked in\nthe browser. You can test this by hitting [F12] to open the file in web browser, and clicking on the link."
    },
    {
      "category": "Resource",
      "title": "lab1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-204-planning-communications-and-digital-media-fall-2004/7a3a74de215d7de8eaf51188aec76594_lab1.pdf",
      "content": "Massachusetts Institute of Technology\nDepartment of Urban Studies and Planning\n11.204: Planning, Communication & Digital Media\nFall 2004\nLab 1:\nWWW Portal Page Building\nAssigned: Recitation 1\nDue: Recitation 2\nI. Scenario\nThroughout your 2 years at DUSP, you will be encouraged to present your thoughts and ideas to the world and to interact with a diverse range\nof scholars and practitioners who have interests similar to your own. Designing and launching a web-based portfolio on the WWW (World\nWide Web) is one way to achieve these goals.\nThis lab exercise asks you to build a set of pages using Macromedia Dreamweaver. For this exercise, you will not work out all of the design-\nrelated aspects of your web site. Rather you will focus your attention on learning how to use Dreamweaver and successfully posting a few\npages on the WWW. You will, however, develop a more sophisticated design and populate your portfolio (see Project 1) throughout the\nsemester.\nII. Directions\n1. Start Dreamweaver [Help].\n2. You need to create a \"site\" within Dreamweaver [Help]. A site refers to a set of HTML and image files.\n3. Create a web page (i.e. one HTML file) as your portal page [Help].\nz A portal page for a web site is something like a cover sheet for your resume, or an entrance to special place. It should contain elements\nthat orient the visitor.\nz Make sure to name this file \"index.html\" - this is a default name and web servers look for \"index.html\" when no specific file is\nrequested. For example, \"http://web.mit.edu/\" is indeed \"http://web.mit.edu/index.html\". Because the portal page for MIT is saved as\n\"index.html,\" visitors do not need to type \"index.html\" at the end of the URL.\n4. Prepare an image file for your portal page [Help].\nz Unlike word processing software, you need to prepare separate files for images and graphics.\nz If you are familiar with Adobe Photoshop and other image processing software, try to prepare one by yourself.\nz If you are not familiar with image processing, we have prepared several image files for you. They are available at the MIT Server.\n5. Embed the image on your portal page [Help].\n6. Create one or two additional pages within your site [Help].\nz Their contents can be anything that relate to your interests. However, you should follow the MIT rules.\n7. Create hyperlinks on the portal page to the other pages [Help].\n8. Create a hyperlink to the MIT home page (http://web.mit.edu/) on your portal page [Help]. MIT's home page should open in a separate\nwindow.\n9. Exit from Dreamweaver. Copy your files (both HTML and images) into your \"www\" folder on your H drive.\nz Copy your files (both HTML and images) into your \"www\" folder on your H drive. By doing so, everyone on the Net will be able to\n\nbrowse your page.\nz The \"index.html\" file should be saved directly under the \"www\" folder.\nz Your portal page should be able to be browsed .\nz If you don't remember how to publish your web pages, refer to the instructions you received during the MCP orientation.\nIII. Things to ponder\nz Who is your target audience?\nz What kind of information should be included on your portal page?\nz What is the relationship between your portal page and the other pages?\nz What keywords would the viewers use to \"google\" your site?\nz Quantity is not the aim. A portfolio, a collection of work, derives from a tradition of showcasing accomplishments. It is important that\nyou select and make available your best work. For example, we do not expect you to post every paper or homework assignment that\nyou complete this semester on your site. You should post your best work -- and that's something that only you can decide. Also, keep in\nmind that your portfolio is a container for your planning-related endeavors; a product for potential employers that communicates your\nprofessional self.\nIV. Materials to submit\nThis lab is due at the end of Recitation 2.\nYou are to submit the URL of your portal to your TA.\nV. Grading criteria\nWe will evaluate your work based on the following criteria:\nz Your portal page is publicly accessible on the WWW.\nz Your portal page indicates your full name.\nz At least one image is embedded and displays on your portal page.\nz Your web site has at least 2 other pages. The contents of the other pages do NOT affect your grade as long as they are in compliance\nwith MIT guidelines.\nz Your portal page has operating links to other pages in the site.\nz Your portal page has an operating link to the MIT web portal page (http://web.mit.edu/).\nz Each page has an appropriate title (appearing in the title bar of the web browser).\nYou may receive extra points if your site is designed exceptionally well, however, if you meet the requirements above you will receive 5\npoints.\nLab 1 is worth a total of 5 percentage points toward your final grade.\nVI. To learn more\nFirst, browse through the reference page by MIT IS/T.\nTo learn more about the operation of Dreamweaver, visit Element K. It provides a range of courses that will guide you through the advanced\nfeatures of the software. To obtain a user ID, visit this page (MIT-IS/T) to request one. If you want a further hands-on training, MIT IS/T\noffers a course on web design and Dreamweaver. If you will be in Cambridge in January (during the Independent Activities Period), you\nmight find some interesting courses on web site development. Browse the IAP web site when the time comes.\nIf you are somewhat familiar with programming and interested in \"hard coding\" the HTML file, there are several free resources on the Web.\nWeb Monkey has very concise yet comprehensive directions on writing HTML code. If you want commercial-free tutorials, visit \"a\nbeginner's guide\" by NCSA or \"getting started with HTML\" by WWW Consortium.\nCreated June 2004 by Masa Matsuura. Modified July 2004 by Lorlene Hoyt."
    },
    {
      "category": "Resource",
      "title": "proj1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-204-planning-communications-and-digital-media-fall-2004/5950a789e6a6a7e1034873ad96fc36c6_proj1.pdf",
      "content": "Massachusetts Institute of Technology\nDepartment of Urban Studies and Planning\n11.204: Planning, Communication & Digital Media\nFall 2004\nProject 1:\nWeb-based Planning Portfolio\nAssigned: Week 1, Lec. 1\nDue: Week 9, Lec. 8 at 5PM\nI. Scenario\nWith the advent of the World Wide Web, data and their analyses are made more accessible, leaving the public (it is claimed) better informed.\nHowever, without adequate care in the design and organization of web delivered media such claims remain frustrated. Some sites are often so\npoorly constructed that a significant part of their content remains inaccessible or unintelligible.\nThis project asks you to design and build a web-based container for your academic work--an online portfolio of sorts. Your site should\naddress the design concerns above, particularly as it will host 11.204 work viewed and judged from outside. It will also host projects\ncompleted in other courses during your MCP tenure, including your thesis. The site will be critiqued at mid-semester and end of term. We\nexpect you to improve it continually.\nII. Directions\n1. Look at the examples from the last year. Find one example of a web site which you find particularly good and another you find bad. What\nmakes them so? Which problems had the designer successfully (or not) solved, and how? You need not submit answers.\n2. Give thought as to how the bad site might be improved and how the good site might inform your own portal design.\n3. Brainstorm by yourself and sketch (use paper and pencil) the look and structure of your entire site. You must discuss the sketch with\nyour TA before commencing work. You do not need to submit the sketch(es).\nIII. Things to ponder\nThink about these questions while sketching:\nLook:\na. How do you integrate the three key elements (title, navigation, and contents) in a page?\nb. Do you use different design schemes for the portal (home) page and subsequent pages? Or, are the schemes the same?\nc. What navigation tools will you use? (Text? Images? Buttons? Rollover images?)\nd. Which fonts will you use?\ne. How will color and composition be used? (the Artist's Toolkit is a helpful resource)\nStructure:\na. What are the main, secondary, tertiary topics?\nb. How are these made clear to visitors to the site?\nc. How will you accommodate course work outside 11.204, or even professional work?\nd. Would you include a biographical statement? If so, where would it be placed?\ne. How much of this is answered in the portal page and how much elsewhere?\nf. What other outside resources would make for appropriate links?\nYou need not submit answers. (sketch examples: look and structure)\n4. Based on your sketches, create a web site using Dreamweaver, Photoshop, and other useful software packages (such as Adobe Acrobat).\n\nIV. Materials to submit\nYou are to submit an email message with the URL of your portal .\nPlease address the email message to your TA with '11.204: Project 1' appearing in the subject line.\nV. Grading criteria\nz Function: The entire site is accessible from your portal, all links and buttons work, all images appear = 40%\nz Organization/Navigation: Portal page effectively orients viewer; susequent pages allow viewer to return to portal = 20%\nz Quality: Each page has an appropriate title; text and images are appropriate and effective = 20%\nz Audience/Message: Text and image selection is professional; site is appropriate for review by a potential employer = 10%\nz Identity: Student's concerns, interests, and activities are obvious to the viewer = 10%\nCreated by Duncan Kincaid. Updated July 2004 by Masa Matsuura. Modified July 2004 by Lorlene Hoyt."
    },
    {
      "category": "Resource",
      "title": "lab2_help.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-204-planning-communications-and-digital-media-fall-2004/27913a21ebd53b6f3f81afccfd4bdfc7_lab2_help.pdf",
      "content": "Massachusetts Institute of Technology\nDepartment of Urban Studies and Planning\n11.204: Planning, Communications & Digital Media\nFall 2004\nLab 2:\nPhotography and the Construction of Visual Arguments\nHelp Section\n1. Adjusting the page size\nYour page width should be less than 1,000 pixels.\nA pixel is a unit used to represent a dot on the screen. Computers have LCDs that can display 1,600 pixels of width, but these are not\nso common for computers widely available in the market. Most computer screens have a maximum display width of 1,024 or fewer pixels.\nThere are two key ingredients to keep your page viewable with these computers.\n1. Table width should be set to a value less than 1,000 (pixels). You can also set the table width as a percentage.\n2. The aggregate of the width for the images that are aligned in a single row should not exceed 1,000 pixels. If the images are larger than\nthe cell/table size, the browser automatically expands the table so that the images can fit in the cells. This means adjusting the table size\nis not enough to keep your web page within 1,000 pixels. Read below for the ways to adjust the image size.\n2. Adjusting the image size\nIn preparing your presentation on Dreamweaver, it is highly likely that you will want to change the size of your images. There are two ways\nto do so.\nA. Using Dreamweaver\nz You can resize your images by dragging the right-bottom corner of the embedded image. You will see the values for \"W\" and \"H\" in\nthe Properties window changes as you resize. These numbers are the size of the image, represented in pixels.\nz However, we recommend that you DO NOT use Dreamweaver to resize your image because it will negatively impact the quality of the\nimage.\nB. Using Photoshop\nz Open the image in Photoshop.\nz Method 1: Numerical expression\n{ Go to \"Image\" and choose \"Image Size\"\n{ Change the values for Height or Width (Photoshop automatically calculates other values to maintain the original proportions)\n{ Click OK\nz Method 2: Interactive resizing\n{ On your keyboard, click \"Ctrl\" and \"A\" together to select the entire image\n{ Go to \"Edit\" on the main menu at the top, and choose \"Transform.\" You can change the image size and proportion by dragging\nthe boxes that appear on the edge of the image.\nz If you resize a image that has already been embedded in HTML files, you have to open those HTML files in Dreamweaver, delete the\nembedded images, and embed the image files again.\n{ Why? Dreamweaver automatically assigns W and H properties for images when those images are embedded. Even if you resize\nthe image files (like JPG and GIF) in Photoshop, those W and H properties automatically inscribed in the HTML file do not\nchange. The web browser will use those properties to expand or shrink the image file to the width (W) and height (H) set by the\nHTML file.\n3. Additional features of HTML/Dreamweaver\nA. Anchoring\nYou can create a hyperlink to a specific section of a page. The target can be anywhere in a page, like the top of a page, or in the middle of a\n\npage. It is called anchoring. What you need to do is: create a named anchor in a place to be linked, and create a hyperlink to the named\nanchor.\nTo create a named anchor:\n1. In the Document window's Design view, place the insertion point where you want the named anchor.\n2. Do one of the following:\nz Select Insert > Named Anchor\nz Press Control+Alt+A (Windows) or Command+Option+A (Macintosh)\nz In the Common category of the Insert bar, click the Named Anchor button. The Named Anchor dialog box appears.\n3. In the Anchor Name text box, type a name for the anchor, and click OK. For more information, click the Help button in the\ndialog box. The anchor marker appears at the insertion point. Note: If you do not see the anchor marker, select View > Visual\nAids > Invisible Elements.\nTo link to a named anchor:\n1. In the Document window's Design view, select text or an image to create a link from.\n2. In the Link text box of the Property inspector, type a number sign (#) and the name of the anchor. For example:\nz To link to an anchor named \"top\" in the current document, type #top.\nz To link to an anchor named \"top\" in a different document in the same folder, type filename.html#top. Note: Anchor names\nare case-sensitive.\nTo link to a named anchor using the point-to-file method:\n1. Open the document containing the named anchor you want. Note: If you don't see the anchor, select View > Visual Aids >\nInvisible Elements to make it visible.\n2. In the Document window's Design view, select text or an image you want to link from. (If this is another open document, you\nmust switch to it.)\n3. Do one of the following:\nz Click the Point-to-File icon to the right of the Link text box in the Property inspector and drag it to the anchor you want to\nlink to: either an anchor within the same document or an anchor in another open document.\nz Shift-drag in the Document window from the selected text or image to the anchor you want to link to: either an anchor\nwithin the same document or an anchor in another open document.\nB. Creating a rollover image\nYou can insert rollover images in your page. A rollover is an image that, when viewed in a browser, changes when the pointer moves across\nit. Before you begin, obtain one or more pairs of images for the rollover. You create a rollover with two image files: the primary image (the\nimage displayed when the page first loads) and a secondary image (the image that appears when the pointer moves over the primary image).\nBoth images in a rollover should be the same size; if the images are not the same size, Dreamweaver automatically resizes the second image\nto match the properties of the first image. Rollover images are automatically set to respond to the onMouseOver event.\nTo create a rollover:\n1. In the Document window, place the insertion point where you want the rollover to appear.\n2. Insert the rollover using one of these methods:\nz In the Insert bar, select Common, then click the Rollover Image icon.\nz In the Insert bar, select Common, then drag the Rollover Image icon to the desired location in the Document window.\nz Select Insert > Interactive Images > Rollover Image. The Insert Rollover Image dialog box appears.\n3. Complete the dialog box. For more information, click the Help button in the dialog box.\n4. Click OK.\n5. Select File > Preview in Browser or press F12. You cannot see the effect of a rollover image in Design view.\n6. In the browser, move the pointer over the original image. The display should switch to the rollover image.\n.\n.\nCreated June 2004 by Shannon McKay. Updated June 2004 by Masa Matsuura. Updated July 2004 by Lorlene Hoyt."
    },
    {
      "category": "Resource",
      "title": "lab2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-204-planning-communications-and-digital-media-fall-2004/5b54a83bfb59a47d1b84aa291721b802_lab2.pdf",
      "content": "Massachusetts Institute of Technology\nDepartment of Urban Studies and Planning\n11.204: Planning, Communication & Digital Media\nFall 2004\nLab 2:\nPhotography and the Construction of Visual Arguments\nAssigned: Recitation 2\nDue: Recitation 4\nI. Scenario\nPlanners often use photography illustratively, to portray the character of a place and its population, and rhetorically, to prove a point or\nadvocate change. This presumes that the planner has decided what he or she wants to portray or say before acquiring and arranging the\nimages. But photography can also be used as a method of inquiry, a disciplined way of seeing, in which the act of photographing (choosing a\nsubject, framing a view, deciding where to stand and on what to focus, etc.) produces new discoveries, in which the analysis of the\nphotographs, later, yields further understanding.\nThis assignment, the first of a series on Central Square in Cambridge, asks you to investigate and analyze the character of Central Square and\nto present your findings in a series of 3-5 photographs, taken by yourself. The assignment requires that you use photography illustratively and\nrhetorically. You may also choose to use photography as a tool of discovery. No research apart from your observations on visits to Central\nSquare should inform your judgment. Future assignments will build on these preliminary field observations and will ask you to use other\nresearch methods and other forms of data. Walk around Central Square. What's going on here? What makes it a place? What stories can be\nread in its physical and social fabric? What signs can you find of the processes (e.g. social, economic, political, environmental) that are\nshaping its present and future? Given the limitation of 3-5 images, you will have to focus your investigation on what seems to be most\nspecial, most typical, or most interesting to you as a planner. Look for significant details and views, clues to forces or activities that might\notherwise be invisible. Look for views that embody or hint at the story you decide to tell. In choosing and telling your story, aim to go beyond\nthe obvious and simplistic to the more subtle and complex.\nThere is more than one way to approach this assignment. One is to form an initial hypothesis or narrative and then to look for images to\nsupport or refute it. Another is to go out and take photographs of things that seem significant, that \"speak\" to you, then to analyze them for\npatterns afterward. Whichever approach you take initially, you must ultimately formulate a position, argument, or story and express it to\nothers through the sequence of images that you select. These images are to be included in your online portfolio. Choose a title for the series of\nphotographs, which provides a clue to the story they tell.\nII. Directions\n(Please note that much of the '[help]' appearing below is delivered as QuickTime movies. Should you not have QuickTime installed on your\nPC, then please visit http://www.apple.com/quicktime/download/. All PCs have QuickTime installed. All Macintoshes\nhave QuickTime installed.)\n1. Familiarize yourself with Central Square, Cambridge; wander, visit coffee shops, bars, speak with people.\n2. Take photographs\nz Digital cameras may be checked out from Michael Enos or one may choose to use one's own camera, or purchase a disposable\ncamera\n3. Analyze the photographs for significant details or patterns\n4. Arrange the photographs to construct an argument or narrative\n5. Take additional photographs, if necessary, to fill gaps. However keep the total number submitted to no more than 5\n6. Create the following directories (folders) in your ~/www directory should it not already exist\nz /www/media\nz /www/media/raw\n\n7. Acquire/prepare images for page(s)\nz Acquire images\n{ Download from digital camera using the Flash Card readers in the I/O room\n{ Scan image using flatbed scanner [Help]\n{ Scan image using slide scanner [Help]\n{ Save raw (ie. unedited) images downloaded/scanned above in ~/www/portfolio/11.204/media/raw\nz Prepare images using Photoshop (note: not applicable to all images)\n{ Adjust levels [Help]\n{ Unsharp mask [Help]\n{ Crop (\n)\n{ Under \"File\" menu, select \"Save for web\" and save to: ~/www/media\n(Choose JPEG/JPG format for pictures and GIF format for graphics/texts.)\n{ Optional: You can also \"play with\" the filter functions of Photoshop, although it should not negatively affect the quality of your\nimages and messages.\n8. Embed images in HTML page(s). We recommend that you use tables here so that comments/captions and images are neatly arranged\nz Remember to design your pages so that they fit comfortably on a display of 1024x768 [Help]\nz You can take advantage of other features of HTML/Dreamweaver in your presentation [Help]\n9. Save HTML page(s) in \"/www\"\n10. Build appropriate links in your portal page* to page(s) just saved in 9 above\n(*portal page: If you have started developing your portal site, place this hyperlink in an appropriate section, such as \"academic\". If you\nhaven't, place this link on the cover page (i.e., index.html) you created for Lab 1.)\n11. Test your pages by launching a web browser.\nIII. Things to ponder\nz What is the main theme for your presentation? With this photographic essay, what message do you want to convey to the audience?\nz Do the images, both as a whole and individually, encapsulate your message? Did you select images that are most effective in conveying\nyour message?\nz What is the best way to integrate these photographs into a presentation? Should they be put in a single web page, or should they be\nsequenced in separate pages?\nz Are the images properly framed/cropped? What improvements could be made to your images?\nz This is an exercise of creating a photographic essay. The amount of text should be minimal.\nIV. Materials to submit\nThis lab is due at the end of Recitation 4.\nYou are to submit the URL of your photographic essay page (for the photographic essay page, ending with \".html\" or \".htm\">) to your TA.\n.\nV. Grading criteria\nThe criteria for this project and how each will be weighted are as follows:\nz Argument (Clarity, logic, and creativity) = 50%\nz Composition (Quality of graphic content, strategic selection of text, sequence of images) = 20%\nz Function (The page is accessible from your portal, links and buttons work, images appear) = 30%\nLab 2 is worth a total of 10 percentage points toward your final grade.\nVI. To learn more\nDreamweaver MX Level 2 (Windows / Macintosh)\nCourse Objectives\nz Create dynamic user-interface elements, including simple rollovers and complex navigation bars.\nz Use libraries to manage repeating site elements.\nz Define keyword, description, and other meta tags in order to make your site visible to automatic search engine spiders.\nz Create CSS styles to streamline text formatting within a page, and create external style sheets to allow formatting information to be\nused throughout a site.\n\nz Create and manage layers, as well as combine layers with behaviors to provide additional visual feedback for a viewer navigating a site.\nz Use the History panel to simplify repetitive tasks both within a single document and with other documents in a site.\nz Target page content to specific browsers and versions.\nz Add a form to your web page.\nDreamweaver MX: Level 3 (Windows / Macintosh):\nCourse Objectives\nz Determine what server technology to use for a database-driven site, and set up a database-driven site in Dreamweaver.\nz Create recordsets, and display fields and images on the page.\nz Create a master list of items that links to a detail page, and create a page to display the results of a search form.\nz Link form elements to recordsets.\nz Create pages to insert, update, and delete records\nPhotoShop 7.0: Level 2 (Windows / Macintosh):\nCourse Objectives\nz Use Quick Mask mode, alpha channels, and layer masks to isolate image areas. Create clipping groups to use one layer's contents to\nmask another's.\nz Create vector paths as tools for selecting images, for creating transparent areas in images to be used with other applications, and for\ndrawing shapes.\nz Create color swatches, gradients, and patterns, all of which can be saved and loaded in sets for convenience.\nz Create layer styles that can apply effects, colors, patterns, and gradients in one step.\nz Use the Background Eraser and the Extract command to create complex masks quickly and accurately, even for images with indistinct\nedges and very fine details.\nPhotoShop CS: Basic Image Enhancement (Level 1 - Windows / Macintosh):\nCourse Objectives\nz Select appropriate resolutions for different image and output types.\nz Resize and crop image areas.\nz Select image areas using the Lasso, Marquee, and Magic Wand tools.\nz Use alpha channels to save and load selections.\nz Create and manipulate multiple layers to composite images easily.\nz Apply blending and shading effects to create realistic composites.\nz Select colors using the Color palette, Color Picker, and Eyedropper tool.\nz Use Photoshop's painting tools to create artwork or to retouch photographs.\nz Add and format text within an image.\nz Apply layer effects and filters to create special effects including lighting effects and textures.\nz Modify the brightness, contrast, color balance, hue, and saturation of images.\nz Save images in file formats for use with other applications and the Web.\nPhotoShop CS: Refined Masking, Image Effects, and Retouching (Level 2 - Windows / Macintosh)\nCourse Objectives\nz Use the Background Eraser, Quick Mask mode, alpha channels, and layer masks to isolate image areas quickly and accurately, for\nimages with indistinct edges and very fine details.\nz Create clipping masks to use one layer's contents to mask another's.\nz Create vector paths as tools for selecting images, for creating transparent areas in images to be used with other applications, and for\ndrawing shapes.\nz Create color swatches, gradients, and patterns.\nz Distort type by warping it, wrapping it on a path, and transforming it.\nz Create layer comps to quickly compare multiple versions of a document.\nz Retouch and restore old damaged photographs.\nz Simulate natural media painted effects.\nz Automate multi-step processes with actions and batch processing.\nPhotoshop 7.0 Color Correction and Printing (Windows / Macintosh):\nCourse Objectives\nz Identify the typical uses for color modes, describe the Color Management and Color By The Numbers workflows, and combine the two\nworkflows.\nz Calibrate your system for maximum color accuracy.\nz Control the scanning process to work with the best possible images in Photoshop. <.li>\nz Remove defects such as moire patterns, dust, scratches, noise, and red-eye.\nz Perform curve-based color corrections to remove color casts, enhance image detail, and ensure balanced images, and modify the\nbrightness, contrast, color balance, hue, etc.\nz Create custom color separation settings and modify images' gamuts to create quality CMYK output.\nz Sharpen images to improve focus and detail.\nz Create better grayscale images from RGB files than with Photoshop's default conversion method; and use spot colors to create duotones\nand spot overlays in images.\nPhotoshop 7.0: Artistic Effects (Windows / Macintosh):\nCourse Objectives\n\nz Clean up jagged line art and accurately replace colors in line art with soft edges.\nz Apply time-saving shortcuts for selecting, stacking, and blending layers.\nz Precisely control layer styles with contours and with combinations of layer effects, as well as by splitting layer effects onto multiple\nlayers.\nz Repair and retouch old damaged photos efficiently and accurately.\nz Create atmosphere in an image by applying a soft focus effect and adding emphasis to the foreground.\nz Colorize grayscale images with a variety of techniques to create hand-tinted and sepiatone effects.\nz Wrap a two-dimensional object around a three-dimensional one realistically.\nz Use lighting effects and create cast shadows to further simulate three dimensions.\nz Transform a photographic image into a painted one with brushes, filters, and blending modes.\nz Combine multiple steps into one by saving them as actions.\nPhotoshop 7.0: Web Production (Windows / Macintosh)\nCourse Objectives\nz Use basic techniques and concepts about image resolution and identify factors that contribute to file size.\nz Understand GIF, JPEG, and PNG file formats so that you can choose the right one for each image.\nz Calibrate your monitor, and preview images for both platforms so you can adjust images to optimize their appearance on both\nMacintosh and Windows computers; control dithering in images, using it when necessary to improve images, and avoiding it at times\nwhen it detracts from the quality; and use the Web palette appropriately to optimize images.\nz Use Photoshop and ImageReady to create layouts of Web pages, aligning items precisely to one another with guides and a grid; and\nslice complex images into sections, and use ImageReady to generate HTML code that joins the slices together in a table on a Web page,\nincluding JavaScript rollovers and URL links.\nz Create animated GIF images that combine slow transitions and fast motion effects, while still maintaining small file sizes.\nCreated June 2002 by Duncan Kincaid and Anne Spirn. Modified June 2004 by Shannon McKay and Masa Matsuura. Modified July 2004 by\nLorlene Hoyt."
    },
    {
      "category": "Resource",
      "title": "proj2_eval_crit.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-204-planning-communications-and-digital-media-fall-2004/ab694bc7914a7f003e017eaa943977bf_proj2_eval_crit.pdf",
      "content": "11.204 - Planning, Communication, and Digital Media\nProject 2 Evaluation Criteria\n\nImages = 30 pts.\nComposition - Are the graphics complete in their design and content? Could the graphics stand\nalone and still be understood? Are they designed for maximum understanding and\nefficiency? (5 pts.)\nFraming/Perspective - Is there too much white space in the graphics' frames? Is the size\nappropriate? Are the data presented in an interesting and engaging way? (5 pts.)\nSymbols - Are all graphics understandable from the viewing distance? Do the chosen symbols\nmatch the data? (5 pts.)\nColor - Does the use of color enhance understanding or detract from the presentation? Are the\nselected colors relevant to the message? (5 pts.)\nNumbers - Do all numbers make sense? Is it evident exactly what the numbers represent? (5 pts.)\nLabeling -Are all elements labeled and positioned to maximize understanding? Are all legends,\ntitles, sources, dates, scale bars, etc., present, complete, and understandable? (5 pts.)\n\nArgument = 30 pts.\nClarity - Is a planning question or an objective to the research posed at the outset? Does the\ndevelopment of the argument make sense? Do the graphics adequately support the\nargument? (10 pts.)\nRelevance to planning - Does the argument capture a plausible and relevant planning issue? Do\nthe researchers acknowledge the link to planning? Do the researchers present a general\nbackground statement about the planning issue? (10 pts.)\nSequencing - Is the argument presented as a logical series of statements (premises to conclusion)\nthrough images and text? Is the conclusion stated? Is the conclusion valid? (10 pts.)\n\nComposition = 30 pts.\nArrangement of graphic content - Does the arrangement of graphics follow a logical sequence or\nstoryline - from the statement of the issue or objective, through premises and supporting\ndata, to conclusion? (10 pts.)\nText selection and positioning - Are the text statements concise, efficient and relevant to the\nposition of graphics? Does the arrangement allow for easy flow of the argument or is it\ndifficult to follow? (10 pts.)\nCreativity - Is the story interesting and presented in an engaging way? Is the issue presented in an\nunusual way that made you think differently about it? (10 pts.)\n\nOral Presentation = 10 pts.\nOrganization - Was the presentation logical? Did the oral delivery match the graphics shown to\nthe audience both in sequence and in content? (4 pts.)\nDelivery - Did the presenters appear to have practiced; was the presentation smooth? Could you\nread everything on the screen? (4 pts.)\nLength - Was the presentation within the time limit specified? Was the final document at the\nspecified three page length? (2 pts.)"
    },
    {
      "category": "Resource",
      "title": "proj2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-204-planning-communications-and-digital-media-fall-2004/dc67ce3fc600e530d50e4c5076bd8495_proj2.pdf",
      "content": "Massachusetts Institute of Technology\nDepartment of Urban Studies and Planning\n11.204: Planning, Communication & Digital Media\nFall 2004\nProject 2:\nExploring, Analyzing, and Describing a Massachusetts Town\nAssigned: Week 8, Rec 8\nDue: Town and Topic Selection, Week 9, Lec. 9\nDue: Final Project, Week 12, Pres 1\nDue: Group Presentations, Week 12, Pres 1 (Groups 1, 2, 3, and 4) and Week 12, Pres 2 (Groups 5, 6, 7, 8, and 9)\nI. Scenario\nThis project, the second for the course, is somewhat open-ended. We hope that this project allows group members to demonstrate their\ntechnical skills, we also expect you to work as a group to effectively communicate a single, simple visual argument about a town (or a\nspecific neighborhood or place within a town) in the Boston, MA metro area. While we encourage the groups to confront this project\ncreatively, there are several guidelines we expect each group to follow. They are:\nA. Each group will select a single MA Town or City - Brockton, Cambridge, Chelsea, Lawrence, Lincoln, Lynn, Newton, Revere,\nSomerville, Watertown, and Wellesley.\nFor each of the six lab exercises, individual students have collected and/or analyzed data pertaining to Central Square. Now and\nas a group of 4 to 5 students (which have been randomly assigned by the instructors), you will apply the skills that you acquired\nin the laboratory exercises to create a visual argument. As a team, you will select a town and a substantive topic of inquiry. You\nmay choose to analyze an issue that involves the entire town (e.g., how and why have homeownership rates changed over time?)\nor you may choose to focus on a neighborhood (e.g., which neighborhoods are changing with respect to racial composition? why\nmight they be changing?), a place (e.g., are housing values influenced by proximity to public transportation stops/hubs?) or a type\nof place (e.g., do children have access to parks and open space? who lives near the town's parks?) within the town.\nOne approach is to generate a question or hypothesis before you visit the town, collect and analyze data, and create a visual\nargument that answers the original question.\nAnother approach would be to review the data available to each group, and generate a question based on your preliminary\nunderstanding of basic patterns (e.g., Gee, homeownership rates in the City of Lawrence are lower than any other town. One\nneighborhood has particularly low homeownership rates. Why is that so?). Next, spend some time in the selected town or\nneighborhood. Can a group gather additional evidence (photographs) to answer the question?\nWhile each group may decide to collect additional data, groups are not required to do so. There are a host of arguments that\ngroups can make with the data provided in the course locker (race, housing, poverty, gender, etc.). We are keenly interested in\nseeing each group construct a clear and effective visual argument with the data provided. We will be more critical of work that\nincorporates additional data sets.\nB. Each group will address a substantive issue.\nFor example, a group may choose to further explore a theme a member uncovered in their photographic essay (Lab 2).\nAlternatively, the group may choose to abandon their photographic essays and select an issue that interests all (or most) of the\ngroup members. For example, you may begin by conducting an analysis (basic summary statistics) of race or home ownership for\na census tract in the selected town. Next, you may generate some charts and maps that defend the group's position. If a\nphotographic image would further support your group's case, seek and obtain the evidence. Beyond the collection of additional\nvisual data (photographs), we expect each group to work only with the data sets and maps that have been provided in the course\nlocker. It will be very time consuming if a group decides to acquire additional Census data or GIS shape files, and we hope each\ngroup can avoid the urge to do so.\nC. Groups will use a variety of tools to craft a visual argument and convey their position.\nWe expect each group to rely on a variety of tools (WWW, photographs, charts/graphs, tables/spreadsheets, GIS, and relational\ndatabases) to complete this project; however, groups should be strategic about the images they decide to include in their project.\nFor example, a creative, persuasive and concise argument is more effective than a stream of redundant images. In fact, each\ngroup should limit their presentation to only a few images (no more than 10) and phrases (no more than 150 words). It might be a\n\ngood idea to collect and organize a host of images, write a lengthy narrative, then select the key images and phrases and delete\nthe others. It is never easy to shorten your work, but less really is more.\nII. Directions\nA. Constructing a Framework for Your Group's Research\nFor this project, each group will design the framework for both the analysis and the presentation. To provide some guidance, we listed the\ntypes of questions that are typically part of such a process. You should review the questions as a group. While we do not expect a written\nresponse, they are the elements that we will use to evaluate a group's work.\n1. Selecting a Town - Due: Week 9, Lec. 9\nSite Visits. Each of the eleven towns are accessible by public transportation if group members do not have access to a car.\nSometime between Week 8, Rec. 8 and Week 9, Lec. 9, groups should attempt to visit at least one municipality to get a sense of the area and\npossible research topics.\nExamine the Data. The municipalities have their own individual folders in the course locker. Groups should look at the Census\ndata and maps and perform some basic data analysis in Excel to determine whether any of the towns possess patterns of interest\nto the group.\nConsult Others. If your group has an idea for a topic, but would like additional feedback, ask course instructors, TAs, other\nfaculty members, or fellow students in the DUSP what they think.\n2. Before You Begin Your Research\nWhat is your argument and who is your intended audience?\nDiscuss this as a group - be specific and descriptive. Also, the group's point of view does not need to be as a DUSP student. For\nexample, a group can frame their argument such that they are consultants, political advisors, community leaders, etc. Similarly, a\ngroup can determine their audience. For some examples, take a look at the work done last year.\nWhat is the question and why is it important?\nMake sure that your group's question is clearly articulated. Be sure to describe why or to whom it is important. Formulating a\nquestion that can be addressed in just three weeks and with limited data may be the most challenging aspect of the project. We\nencourage each group to seek help. Talk to instructors and teaching assistants and determine your focus as early as possible!\nFurthermore, we expect the groups to formulate a basic or simple argument that can be addressed in a concise and/or creative\nfashion. It is not intended to overwhelm a group.\n3. During the Research Process\nAfter some analysis, a group will likely refine their question. This is a short project, and it will be difficult to successfully tackle\nan extremely complex question. Try to scale it down or simplify it. To do this, groups will need to make some assumptions. Also,\nwhat is the principal finding? Did your group's analysis support or deny your original question? (Both are valid!) Did group\nmembers discover a finding that was only remotely related to their original question, and subsequently change their question?\n(This is legal, too!) Be sure to describe your assumptions as well as your findings in your oral presentation.\nIII. Things to ponder\nz Identify the most significant constraint team members experienced during the research process. A limited amount of time is not a valid\nconstraint. You should think about the group's ability to manipulate the tools, the functionality of the tools available to you, your ability\nto analyze qualitative data, the challenges associated with gathering additional data, the availability of teaching assistants, the quality of\nMIT's workstations, etc. We welcome your comments and criticisms.\nz Identify one action the group would take to overcome the above identified constraint(s). Imagine that the team was given the entire\nsemester to complete the project. What action(s) would you take to improve the end result?\nz Did the group enjoy the process? Why or why not? How might team members change their approach or question so that it had more\nmeaning or held their interest? Think about your role and responsibilities for this project. Are you satisfied with your individual\nperformance? The group's performance?\nIV. Materials to submit\nThe project is due at 5:00pm on Week 12, Pres 1.\nEach student will e-mail the URL for Project 2 to his or her TA with '11.204: Project 2' appearing in the subject line (project must be available\nin each group member's online portfolio).\nWhile each group will exercise a good deal of freedom throughout this project, yet there are some basic requirements. They are:\n1. Create a presentation that is no more than 3 pages in length (You should print it to see that it can fit on three sheets of 8.5\" x 11\")\n2. Use any combination of images (photographs, charts, graphs, tables, maps, etc.) to support the group's position. Use no more than 10\nimages and 150 words.\n3. Each group member needs to make at least one site visit to the selected town.\nYou will organize and display these components on the Web using Dreamweaver. The presentation must be no more than 3 pages in length\n(you should print it to see that it can fit on three sheets of 8.5\" x 11\"). Each group will have exactly 10 minutes to present their work (the 3\npages), so be certain to practice the delivery in advance. One, some, or all of the group members may present the work thats up to you. [This\nparagraph is added on Nov. 5, 2004.]\n\nV. Grading criteria\nQuality of Images (Composition, frame/perspective, size, color, labeling, etc.) --- 30%\nQuality of Argument (Clarity, relevance to planning, sequencing, etc.) --- 30%\nComposition (Arrangement of graphic content, text selection and positioning, creativity) --- 30%\nOral Presentation (Organization, delivery, and length) --- 10%\nProject 2 is worth a total of 30 percentage points toward each student's final course grade.\nCreated November 2002 by Jinhua Zhao. Updated November 2002 by Lorlene Hoyt, April 2003 by Masa Matsuura, November 2003 by\nLorlene Hoyt, July 2004 by Shannon McKay. Updated July 2004 by Lorlene Hoyt. Updated September 2004 by Shannon McKay."
    },
    {
      "category": "Resource",
      "title": "lab3_help.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-204-planning-communications-and-digital-media-fall-2004/339d49dff23aff5f7e867c9bdf9809c9_lab3_help.pdf",
      "content": "Massachusetts Institute of Technology\nDepartment of Urban Studies and Planning\n11.204: Planning, Communication & Digital Media\nFall 2004\nLab 3:\nUsing Excel to Understand Population Change\nHelp One: MS Excel XP Interface\nLaunch MS Excel\nLet's start the Excel application. Click on Start, choose Programs, Microsoft, Excel.\nComponents Layout\nThe components of the Excel application window are the title bar, the menu bar, the toolbars, the formula bar, the status bar and the task pane.\n\nThe title bar displays the name of the open application and document. The control menu icon enables you to control the size and position of\nthe Excel application window. The three buttons at the right end of the title bar enables you to minimize, maximize and close the application\nwindow.\nWorksheets\nIn Excel, spreadsheets are called worksheets and worksheets are contained in a file called a workbook.\nOnce the application is opened, a new blank workbook will be provided for you that contains three worksheets--sheet1, sheet2 and sheet3.\nToolbars\nThere are two frequently-used toolbars displayed in the following: the Standard toolbar and the Formatting toolbar. Each has buttons that\nprovide shortcuts for accomplishing many Excel tasks. By pointing to a button with the mouse pointer, you can display a pop-up text box,\ncalled a ScreenTip, containing the button's name.\nCells\nThe intersection of a column and a row is called a cell.\n\nFormula Bars\nThe formula bar displays the value or formula in a selected cell.\nTask Panes\nWhen you first start Excel, the task pane is located on the right-hand side of the window. It provides easy access to many common tasks\nperformed in Excel.\nCreated June 2002 by Jinhua Zhao. Updated August 2002 by Lorlene Hoyt\n\nMassachusetts Institute of Technology\nDepartment of Urban Studies and Planning\n11.204: Planning, Communication & Digital Media\nFall 2004\nLab 3:\nUsing Excel to Understand Population Change\nHelp Two: Data Input & Formatting\nOpen A New Workbook in Excel\nLaunch MS Excel, click on menu File, choose New... (Ctrl-N). In the task pane, choose Blank Workbook.\nLoad the text file \"camtractpopu1970.txt\"\nClick on Menu File, choose Open...(Ctrl-O). A new window pops up, navigate to the MIT Server. Change the File\nTypes to Text Files(*.prn, *.txt, *.csv), choose the file camtractpopu1970.txt and click the button Open.\n\nAnother window titled \"Text Import Wizard - Step 1 of 3\" appears. In the original data type frame, choose \"Delimited,\" press Next.\nIn the Delimiter frame, tick on tab. Press Next.\nIn \"Column data format,\" choose General. Press Finish.\n\nWe are back in the main Excel window. In the Menu Window, choose Arrange....then in the pop-up window, choose \"Vertical\" and click OK.\nNow the window should look like,\nIn the left side window (camtractpopu1970.txt), select all the rows and columns and press Ctrl-C (shortcut for Edit/Copy). Click once Cell A1\nin right side window and press Ctrl-V(shortcut for Edit/Paste).\nIn Menu Format choose Sheet..., then click Rename and type in \"Popu1970\". Now the window should look like,\n\nLoad the dBASE file \"camtractpopu1980.dbf\"\nClick on Menu File, choose Open...(Ctrl-O). A new window pops up, navigate to the MIT Server. Change the File\nTypes to dBase Files(*.dbf), choose the file camtractpopu1980.dbf and click the button Open.\nCopy all the rows and columns from camtractpopu1980.dbf to \"Sheet2\" of the new workbook and rename the sheet as \"Popu1980.\"\nLoad the other two files (camtractpopu1990.xls, and camtractpopu2000.xls)\nRepeat the same procedure as above to get all four files loaded into a new Excel workbook as four worksheets. (When loading the fourth file,\nwe need to create a new worksheet. In Menu Insert, choose Worksheet.) This is how it looks.\n\nPut the data into one worksheet\nInsert a new Worksheet (Insert/Worksheet) and name it as Population (Format/Sheet/Rename). Copy all columns from Sheet Popu1970 to\nSheet Population. Rename the last column from \"P001001\" to \"Popu1970\".\nCopy the \"P001001\" column from Sheet 1980, 1990, 2000 to Sheet Population. Rename the column according to their time as \"Popu 1980\",\n\"Popu 1990\", and \"Popu 2000\". Now it looks like,\n\nSave the file.\nIn Menu File, choose Save. Navigate to your CRN locker.\nCreated June 2002 by Jinhua Zhao. Updated July 2004 by Lorlene Hoyt.\n\nMassachusetts Institute of Technology\nDepartment of Urban Studies and Planning\n11.204: Planning, Communication & Digital Media\nFall 2004\nLab 3:\nUsing Excel to Understand Population Change\nHelp Three: Basic Statistical Analyses\nCalculate the Total Population\nMerge Button\nbutton\nto merge the three cells.\nAs shown in the following, add one new cell with \"Total Population\" at Cell A32; drag the mouse through A32, B32 and C32, and click the\nSum Function\nClick cell D32, type in \"=SUM(D2:D31)\" and press enter. \"SUM(D2:D31):\" is a built-in function of Excel, which returns the sum of from\ncell D2 to D31. This is our first time using formula, in which we input the expression instead of the value. When we click the cell, the\nexpression (this time it is a function) \"=SUM(D2:D31)\" is shown in the formula bar while the calculated value of the expression \"100361\" is\nshown in the cell.\n\nAuto-Fill Handle and Relative Cell References\nPosition the mouse pointer over the lower-right corner of cell D32 until the mouse pointer changes to a solid plus sign. Then, click and drag to\ncell G32. By using the fill handle, we are able to copy the sum formula quickly to cells D32, E32, F32, and G32. And typically, MS Excel\nadjusts copied formulas so cell references change according to the formula's new location. These self-adjusting references are called relative\ncell references. For example, when we copy the cell D32 to E32, MS Excel will automatically change D32=SUM(D2:D31) to E32=SUM\n(E2:E31).\nNow we get the answer for question 1 in the section titled, \"Basic Statistical Analyses.\"\n\nCalculate the Total Population\nAverage Function\nThe procedure to calculate the average is almost the same as that of the sum except that we use the function AVERAGE(D2:D31), which\ncalculates the average of the numbers from Cell D2 to Cell D31. Alternatively, we can use the result from the sum, then divide the sum by the\nnumber of census tracts (30) to get the average.\nNumber Formats\nWe find that the results \"3345.367\", \"3177.4\" and so on have decimal fractions which do not make sense for the population. We want them to\nbe rounded to full integer values. Select the four cells, under Menu Format, and choose Cell. In the pop-up window, in the first table\n\"Number,\" click \"Number\" in Category, and change the \"Decimal Places\" to zero, press OK.\nNow, the worksheet looks like,\nCalculate the Maximum\nMax Function\nThe Max Function is similar to calculate sum or average functions, however, this time use MAX function at cell F34=MAX(F2:F31).\n\nFiltering Rows\nWe can easily see that the maximum population in 1990 is 7,123, but in which census tract does it belong? Because this is a short database,\nwe can just explore the column F and find that 7,123 corresponds with the census tract \"25017353100, but what if we had a dataset that\ncontained thousands of records?\nLet's try filtering the rows. Under Menu Data, choose Filter then AutoFilter. The first Row in this worksheet changes to,\nClick on the button in F1, and choose \"Custom.\" A window pops up.\nType 7,123 and press OK. We identify census tract \"25017353100\" easily.\nCalculate the Percentage Changes\n\nCancel Row Filtering\nClick on the button in F1, and choose \"All.\" The window changes to the status before filtering. (i.e. all rows are displayed.)\nAdd in One New Column\nClick Cell H1, type in \"PopuChange.\"\nPopulation Change Calculation\nClick Cell H2, put the expression \"=(G2-D2)/D2.\" Use the auto fill handle to drag the mouse from cell H2 to cell H32. MS Excel will\ncalculate the population change for all the cells in Column H. Again, relative cell referencing is assumed.\nNumber Formatting\nIn order to show the percentage change clearly, we want to reformat the cells in Column H. Select the cells from H2 to H32. Under Menu\nFormat, choose Cell. In the pop-up window and in the first table \"Number\" click \"Percentage\" in Category, and change the \"Decimal Places\"\nto one, press OK.\n\nMax Function\nUse the Max function again to calculate the maximum percentage change. In Cell 35, put \"=MAX(H2:H31)\".\n\nFiltering Rows\nAgain, by filtering the rows (same method we used in finding the census tract that has the largest population) we can find the census tract that\nhas the sharpest population change.\nCreated June 2002 by Jinhua Zhao. Updated August 2002 by Lorlene Hoyt. Updated July 2004 by Lorlene Hoyt.\n\nMassachusetts Institute of Technology\nDepartment of Urban Studies and Planning\n11.204: Planning, Communication & Digital Media\nFall 2004\nLab 3:\nUsing Excel to Understand Population Change\nHelp Four: Making Charts\nChart One\nSort the Rows by Population Size\nBefore we start to create the chart, we need to sort the rows by their population size. Select the rectangular regions from A1 to H31; the area\nwith the rows we want to sort. In Menu Data, choose sort. In the pop-up window, choose sort by \"Popu2000\", click \"Ascending\" and press\nOK.\nThe rows show ordering by the population size (for the year 2000) from the minimum to the maximum value.\n\nChart Wizard\nSelect cells from G1 to G31. In Menu Insert, choose Chart. The Chart Wizard window pops up.\nIn the Standard Types, choose \"Column\" as the chart type and press Next.\n\nClick Tab Series. In the Category(X) axis labels, click the button\n.\nA Source Data selection window pops up. Drag the mouse from A2 to A31 and then click on the button\n. Return to Step Two of the Chart\nWizard window and click Next.\nIn the Step 3 window, we can insert the title, x-axis name and y-axis name and click Next.\nIn Step 4, choose to place chart as \"new sheet,\" name it \"Chart1\" then press Finish. Now we get the chart shown in Worksheet Chart1, which\nis in a less than satisfactory format.\n\nYou can refine the chart by double-clicking on each of its individual elements and changing the font, size, style, pattern and alignment.\nAlternatively, you can change the properties for all elements at once by double-clicking on the blank areas of the chart to open a new popup\nwindow. You might want to check off \"Auto scale\" function in this window. The \"Auto scale\" function, which is found in the Font properties,\noccasionally \"ruins\" the layout of the chart. That is, the function automatically designs the chart by changing the font size and other properties\nin a way that Excel considers the most appropriate (which is sometimes inappropriate).\nHere is an example of setting properties for individual elements. Double-click on the title. In the popup window \"Format Chart Title,\" there\nare three tabs. In Tab Patterns, you can set the border and color; in table font, you can choose the font, style and size; in the alignment, you\ncan choose the text alignment and orientation.\nHere we are only going to change the font and keep others as default. Choose Times New Roman, Bold, and 18. Click OK.\n\nIn the same way, you must format other elements in your chart to make sure that all elements appear on the chart. In the example shown\nabove, not all Census tract numbers are appearing. You should click on the area to open a window to set properties for the area. You should\nchange the alignment and the font size to make all the tract numbers appear.\nChart Two\nYou can follow the same method as in Chart One to produce your second chart. Some points for your reference:\n1. Pay attention to your choices of the chart type. There are several possibilities depending on your preferences, however, certain types are not\nproper for this situation, such as a pie chart.\n2. Choose the proper column or row as your input for the x-axis and y-axis of the graph and label them carefully.\n3. Check that you have included all of the essential elements -- title, author, date and data resources.\n4. Again, presentation matters. Make the numbers legible and the layout clear.\nCreated June 2002 by Jinhua Zhao. Updated August 2002 by Lorlene Hoyt. Updated June 2004 by Masa Matsuura."
    },
    {
      "category": "Resource",
      "title": "lab3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-204-planning-communications-and-digital-media-fall-2004/aefae7415150ed479ec8721635742ab4_lab3.pdf",
      "content": "Massachusetts Institute of Technology\nDepartment of Urban Studies and Planning\n11.204: Planning, Communication & Digital Media\nFall 2004\nLab 3:\nUsing Excel to Understand Population Change\nAssigned: Rec. 4\nDue: Rec. 5 at 5PM\nI. Scenario\nThis lab exercise is designed to help you learn more about MS Excel, while enhancing your understanding of Central Square in the City of\nCambridge. So, you should not only keep an eye toward the functions packaged in Excel, but also think about the data you are manipulating\nas you move through the following exercise.\nWe expect you to turn in something \"professional.\" We don't want you to prepare extra analyses, but each chart should have all the necessary\nelements appearing properly.\nII. Directions\nA. MS Excel XP interface\nIn this section, you will learn how to launch MS Excel and identify the Excel application window and its components. If you are familiar with\nMS Excel interface, you can skip this section; otherwise, enter here please.\nB. Data input & formatting\nFor this exercise, you will use population data from the US Census Bureau for the City of Cambridge, Massachusetts. Data for 1970, 1980,\n1990, and 2000 are provided to you; however, since the data were collected at four different points in time, they are stored in four different\nfile formats. They are: text file (.txt), dBASE4 file (.dbf), MS Excel 95 (.xls), and MS Excel XP(.xls).\n1. Open a new Excel workbook. [Help]\n2. Load the four files into the new Excel workbook as four separate worksheets. Name the worksheets \"Popu1970,\" \"Popu1980,\"\n\"Popu1990,\" and \"Popu2000.\" [Help] Be aware that all rows in the four worksheets are in the same order. Do not change the order\notherwise the data will not integrate properly.\n3. In order to view and work with data from each of the four decades simultaneously, you need to combine the four worksheets into one\n(name it \"Population\"). [Help]\n4. Save your file in your own CRL locker. Name your workbook \"username_lab3.xls.\" For example, it would look like \"H:\\private\\11.204\n\\lab3\\johndoe_lab3.xls\" if your username was \"johndoe\". [Help] Be sure to save it as an XLS file. (If your default save as type is \".txt\"\na window will pop up saying that a \".txt\" file can not save a multi-sheet into one file.)\nC. Basic statistical analyses\nWith the population data at hand, now you can answer several basic questions.\n1. In 1970, what was the total population of Cambridge, MA? In 1980? In 1990? In 2000? [Help]\n2. In 1970, what was the average population for a census tract in Cambridge, MA? In 1980? In 1990? In 2000? [Help]\n3. In 1990, which census tract in Cambridge had the greatest population? What was the population of this census tract? [Help]\n4. From 1970 to 2000, which census tract in Cambridge has the sharpest population change? (Calculate change as a percentage using\n1970 as the base year. In your answer only consider the positive values.)[Help]\n\nD. Making charts\nIn order to visualize the change in population over these four decades, you will generate two charts.\n1. Chart One: Make a chart that shows the population for each census tract in Cambridge (in 2000) sorted by population size. [Help]\nWe require that 1) the X-axis shows the census tract number and the Y-axis indicates the population size. 2) you must add a title,\nthe author's name, today's date and name the data resource \"US Census 2000.\" 3) We leave it to you to select an appropriate chart\ntype. Make sure that all information described above appear on the final version of your chart. Excel often hides some important\nelements without warning. If this occurs, change the font size and other elements.\n2. Chart Two: Make a chart that shows how the population of the City of Cambridge (as a whole) has changed from 1970 to 2000. [Help]\nWe require that 1) the X-axis shows the year (1970, 1980, 1990, and 2000) and the Y-axis shows the population size (for the City\nof Cambridge - not individual census tracts). 2) you must add a title, the author's name, today's date and name the data resources.\n3) We leave it to you to select an appropriate chart type.\nE. Comparison with the State of Massachusetts\nFrom Chart Two you made in Part D, you can examine the trend of the population change for the City of Cambridge. We want you to make\nthe same type of chart for the Commonwealth of Massachusetts and compare the trend for Cambridge with that of Massachusetts. In the\npopulation data file we've given you for the Commonwealth of Massachusetts (for years 1970, 1980, 1990 and 2000) the geographic unit is\ncounty rather than census tract.\nSince we are only considering the total population, you will need to sum the county population for each decade before you create the chart.\n1. Chart Three: Make a chart that shows how the population for the Commonwealth of Massachusetts (as a whole) has changed from 1970\nto 2000.\nWe require that 1) the X-axis shows the year (1970, 1980, 1990, and 2000) and the Y-axis shows the population size (for the\nCommonwealth of Massachusetts - not individual counties). 2) you must add a title, the author's name, today's date and name the\ndata resources. 3) We leave it to you to select an appropriate chart type.\n2. Carefully examine the two charts (Chart Two and Chart Three), and describe in just a few sentences (approx. 100 words) the population\ntrends in Cambridge and Massachusetts. Be sure to point out the obvious differences or similarities.\nIII. Things to ponder\nz If you had to create a presentation using the data from this lab, what argument would you formulate?\nz How would you communicate your position?\nz Would you display all of the data to your audience or would you summarize the data by constructing a chart?\nz If you use a chart to communicate how population changes over time, which type is most effective?\nz Would your audience understand your argument more easily if presented with a pie or bar chart?\nz If you use a bar chart, should each bar represent a decade?\nz Should each bar be represented using a different color?\nz If so, what color palette(s) are most appropriate? Would you consider forecasting the population for 2010?\nz If so, what methods (mathematical and visual) would you employ?\nIV. Materials to submit\nThis lab is due at 5:00pm on October 13th.\nPrint your answers to the questions in the sections C, D, and E, and submit them to the \"11.204 Box\"\n. The colors (or shades of gray) that you select should provide ample contrast and your document should be easy to read.\nV. Grading criteria\nz First of all, you should provide us the correct answers. Be careful when you handle the data on Excel, especially at the outset. If you\nmake a simple mistake in the beginning, all of your following answers will be wrong no matter how rigorously you work to create\nattractive charts.\nz For questions in section C, you should read each question carefully. Provide all the numbers requested.\nz Before submitting your paper, make sure that all the necessary elements are in the charts. Excel hides some elements automatically if\nthe font size is too large. You can't blame Excel. You should reduce the font size and/or change some other properties.\nz For question 2 in section E, we will give you an extra point if you can provide plausible reasons for the difference in population trends\nbetween the Commonwealth and the City of Cambridge.\nLab 3 is worth a total of 5 percentage points toward your final grade.\n\nVI. To learn more\nMicrosoft offers a wide range of support for its Office products. Visit MS-Office web site for further information. Element K also offers\ncourses on MS-Excel. Tutorials for Excel are available under the \"Spreadsheets\" category.\nCreated June 2002 by Jinhua Zhao. Updated August 2002 by Lorlene Hoyt. Updated September 2002 by Jinhua Zhao. Updated October 2002\nby Lorlene Hoyt. Updated April 2003 by Masa Matsuura. Updated October 2003 by Jinhua Zhao. Updated June 2004 by Masa Matsuura."
    },
    {
      "category": "Resource",
      "title": "lab4_help.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-204-planning-communications-and-digital-media-fall-2004/2572be03f4c1c5741b4efcbd11bd7469_lab4_help.pdf",
      "content": "Massachusetts Institute of Technology\nDepartment of Urban Studies and Planning\n11.204: Planning, Communication & Digital Media\nFall 2004\nLab 4:\nUsing ArcGIS to Visualize Population Density\nHelp Section\nArcMap interface and elements\nStart ArcMap\nArcMap is a part of the ArcGIS package. This program lets you create thematic maps.\nTo launch ArcMap, from the Start Menu choose Start > Programs > ArcGIS> ArcMap. Wait a moment for it to launch.\nOpen a ArcMap file\nWhen ArcMap first launches, you should see a \"ArcMap: Start using ArcMap with...\" window that prompts you to create or open a new map\ndocument. Click the option button \"An existing map.\" If the file you want to open appears in the list below, click it to select and then click\nOK. If not, choose \"Browse for maps...\" in the box and launch the Open dialogue box shown below.\nIn the Open dialog box, navigate to the MIT Server. Click OK.\n\nThe window should look like the following.\nOpen an attribute table\nClick on the layer (listed on the left) \"Camtract.shp\" to make it active. Then over the text, right click the mouse and in the pop-up menu,\nchoose \"Open Attribute Table.\"\nThe attribute table for the \"Camtract.shp\" layer appears.\n(Optional: If you activate a single tract using \"Select Features\" function available in the \"Tools\" bar, the highlighted records are\ncorresponding to the Census tract selected in the view window.)\n\nOpen a Layout\nFrom the text menu on the top of the window, choose \"Layout View\" from the \"View\" menu. A layout view for finalizing your mapping work\nshows up. To go back to the work pane, choose \"Data View\" from the same menu.\nChoose View -> Layout View\nLayout View\nClose the document and ArcMap\nFrom the text menu \"File\", choose \"Exit.\" (or simply click [x] on the top right) You will be asked whether or not save changes to the file\n\"startup.mxd,\" choose No.\n\nCreate your own map document\nCreate a new document\nStart ArcMap by from the Start Menu choosing Start > Programs> ArcGIS> ArcMap. In the welcome window choose the option \"A new\nempty map.\"\n(If the welcome window is closed, click the New Map File icon [looks like a sheet of paper] on the top left. Use \"blank document\" as your\ntemplate.)\nAdd data (layers)\nClick the \"Add Data\" icon, or right click on the \"Layers\" text and choose \"Add Data\" from the pop-up menu.\nIn the \"Add Data\" dialogue, choose the data file that will be used in the exercise.\nBrowse to the MIT Server\\Data, select \"camborder.shp\" and click OK. A new layer, \"Camborder,\" will be added, and the\ngeographic features are automatically displayed.\ny\nNOTE: If you don't find the MIT Server\\Data in your \"Add Data\" window, you have to assign the folder in\nour catalogue of ArcGIS files. To do so, click this icon\nin the Add Data window to open the \"Connect to Folder\" window, type\n\nin the MIT Server\\Data\" in the box, or browse to the data folder, then click OK. This process can take some\nminutes.\nClick on the square to the left to the layer name. The Cambridge border disappears. Click it again to make the box checked to show the\npolygon.\nWe need to add more layers. From \"the MIT Server\\Data\\\" add \"cambookstore.shp,\" \"massmbtaline.shp,\" and\n\"camtract.shp.\" We can select multiple layers in the adding layer window by pressing the \"Control\" key while clicking on files.\nTurn layers on and off, change layer draw sequence, and making a layer active\nWe turn layers \"on\" and \"off\" (making them visible or invisible) by clicking the square to the left to the layer name. In order to make a layer\nactive, we just need to click on the layer name in the left panel of the table of contents window.\nAll layers are overlaid in a sequence. The sequence of the layers are automatically determined by the software. We can change the display\nsequence by dragging and dropping layer objects. You should experiment with the ordering of layers, as it has a direct impact on how the\nimage appears in the view.\n\nThis is an example of the result of switching the order of layers.\nHow to Zoom/Pan\nNow take the opportunity to pan and zoom in the window. First, you may wish to enlarge both the main ArcMap window so that you can see\nmore detail in the image (click [ ] box on the top right).\nTry clicking the following buttons in the \"Tools\" bar, then clicking in the map window:\n(If Tools bar is not there, go to \"View\"->\"Toolbars\"->\"Tools\" and turn the \"Tools\" bar on.)\nZoom In - Click to zoom in on that location. Click and drag to zoom to a particular bounding box.\nZoom Out - Click to zoom out centered on the location of the click.\nFixed Zoom In - Click to zoom in without moving the map center\nFixed Zoom Out - Click to zoom out without moving the map center\nPan - Click and drag to pan around the map area.\nZoom to Full Extent - Click and observe that ArcMap zooms to the full extent of the largest layer (i.e. massmbtaline).\nZoom to Active Layer\nRight click the layer name and choose \"Zoom To Layer\" from the pop-up menu.\nThe view is zoomed to the extent of the chosen layer.\n\nZoomed to the extent of bookstore locations in Cambridge.\nExamining Attribute Data\nFirst activate the layer\"camtract.shp,\" and click on the info (\"i\") tool\nin the Tools menu. Move the mouse onto the map window and click\non the tract where MIT resides. You can locate this tract based on where the MBTA line runs. The attributes associated with this tract appear\nin a popup window. In the column area, we can read out the area value for this Census tract.\nHow to set data frame properties\nAt this point it is important to set a few properties for this data frame. From the View menu, select Data Frame Properties to change the name\nof the data frame from \"Layers\" to \"Cambridge Overview\", add in creation date and your name as creator in the pop-up window. Also in this\ndialog box you should set the \"Display Units\" to \"Miles\".\n\nOnce you close the Data Frame Properties window, you should see that the name of the layers changes to \"Cambridge Overview,\" which is\nshown in the table of contents window.\nHow to set layer properties\nActivate the layer \"cambookstore\" then from the table of contents window, right click to open a pop-up menu, then select Properties to open a\nLayer Properties dialogue box. Click the General tab, and change the name of the layer to \"Cambridge Book Stores\".\nChange other layer names according to their contents. After this, we will find the new layer name shown in the table of contents (left side) .\nHow to save a map document?\nSave your map document now. Go to the File menu and select Save. The \"Save As\" dialog box will appear.\n\nBrowse to the H:\\private\\11.204\\lab4, name the map document file as johndoe.mxd. (Replace johndoe with your username.)\nSymbolization & classification\nHow to change the default symbols for points\nIn the table of contents (left side) of the window, double-click on the small symbol below the layer name.\nSymbol Selector opens. Click on Triangle 1 to select the triangle shape. Click on the color box to open a color selector and choose red (or\nsimilar). Change the size to 12. Click OK to apply.\nObserve the view window to see the symbolization change for the Cambridge book stores.\nHow to change the default symbols for lines\nIn the table of contents (left side) of the window, double-click the box below the text \"Cambridge Census Tract.\" Symbol selector opens.\nChoose Hollow and change Outline Width to 3.\n\nHow to render the lines in different colors according to their name.\nIn the table of contents (left side) of the window, double-click on layer name \"MBTA Subway\" (or right-click to open the pop-up, then\nchoose Properties). Now you see the Layer Properties window. Click on the Symbology tab.\nChoose \"Categories\" -> \"Unique Values\" in the Show box on the left.\nChoose \"LINE\" in the Value Field select box.\n\nClick on the \"Add All Values\" button to add four attributes of the MBTA Subway layer.\nTo change the line style/color for the BLUE line, double click on the text \"BLUE\" to open the Symbol Selector.\nSelect Railroad, choose blue, and set the line width at 2.\nDo the same thing for all other three subway lines. Change their color according to their names. The Layer Properties now looks like this.\n\nClick OK to see the effect in the window.\nHow to classify the features.\nIn the table of contents (left side) of the window, double-click on layer name \"Census Tract\" (or right-click to open the pop-up, then choose\nProperties). Now you see the Layer Properties window. Click on the Symbology tab. This is same as what we did for the subway lines.\nChoose \"Quantities\" -> \"Graduated colors\" under \"Show:\" Under \"Fields\">\"Value\" select \"POPUDENSE\" (population density in the unit of\npersons per acre).\nNotice that ArcGIS automatically divides the population density data into five ranges and assigns a color to each. The default color ramp is\nBlue monochromatic. Change to Light Green monochromatic (the one shown below).\nNote: Population density is equal to the number of people per acre. This was calculated by taking the area of each tract (in square meters) and\ndividing by 4,046.9 (which is the number of square meters per acre). Then we divided the total population for the tract by the number of\nacres.\nOften we will want to make some adjustments to the way these ranges are created. To do so, click on the Classify button. The Classification\nwindow will appear. Under \"Method:\" select \"Quantile\", keep the number of classes at 5 then click OK. The quantile classification method\ndivides your data into so that, in this case, an equal number of tracts fall within each of the five ranges.\n\nBack in the Legend Editor notice that the ranges have changed to reflect the new classification scheme. Now click OK to make this new\nscheme take effect in the map.\nYou've made your first thematic map, with population density divided into 5 categories, each consisting of 20% of the tracts. The darker color\nhighlights the tracts with a denser population in 2000.\nSave your map document by pressing Ctrl-s (the short-cut for save map document).\nLayout/export\n\nHow to turn to the Layout mode (view).\nNow you are ready to create your final layout which will include a legend, title, scale bar, and north arrow. Zoom in/out to a reasonable scale\nbecause the extent that your map shows here will be the extent that will be displayed in your final layout.. Under the View menu select\nLayout View.\nThe main window will change to a layout mode without design works. Now, you need to apply a template to add map elements. Right click\nthe map to open a pop-up menu and choose \"Change Layout.\" (You might have to right click the map outside the green rectangular frame or\nwithout any selections, otherwise you get a different set of menu options, which does not include \"Change Layout\".)\nSelect Template window will appear. Choose \"General\"->\"LetterLandscape.mxt\" for this Lab work.\n\nYou should now see a page with a map, title, legend, scale bar and north arrow already placed on it. These are the most basic components of a\nmap. If you think that your map should cover greater area on the paper, go back to the Data view using the View menu and zoom in/out a bit\nmore. Then come back to the Layout view and you will see that it is automatically refreshed. In this way you can adjust the size of the map on\nthe page as it suits you.\nHow to arrange Legend\nWe need to work on the legend to make it legible. First, you need to remove <all other values> in the MBTA subway category. This stands\nfor those line elements without attribute data in the LINE property. Because such polygons do not exist in our data set, you can remove the\ncategory.\nIn the table of contents (left side), double click over \"MBTA Subway\" or right click to open a pop-up menu to choose \"Properties.\"\nIn the Symbology tab, uncheck the checkbox next to <all other values>, and click OK. This action hides the line elements without attribute\ndata in the LINE property.\nStill, the legend is not sensible. Double click over the legend on the map. Legend Properties will show up.\nIn the \"Items\" tab, choose \"MBTA Subway\" in the Legend Items box (not Map Layers on the left). Then click Style... box on its right. Legend\nItem Selector will show up.\n\nChoose \"Horizontal Single Symbol Layer Name and Label\" for the subway lines. Click OK to close this window. Then Click OK again to\nclose Legend Properties to see how the change is reflected in the map.\nWe will do the same change for the Census Tract. Choose \"Horizontal Single Symbol Layer Name and Label\" for this layer, too. Now, the\nlegend should look like this.\nWe need to reformat the labels (numbers) for the Census Tract. The digits are too long. Double click the text \"Census Tract\" on the left side\nof the window to open Layer Properties, then go to the Symbology tab (You should have opened this window before to create the thematic\nmap). Right-click in the Symbol-Range-Label box to open a pop-up menu shown below. Choose \"Format Labels.\"\n\nNumber Format window will show up. Reduce Rounding to 1. Click OK to apply.\nNow you see the decimal point reduced to 1, and it is reflected in the Layout View.\nWe need to add a few more elements to the map:\nz Data sources\nz Subtitles\nz Author's Name\n\nz Date\nLet's add the data source first. Click once on the Text (\"T\") button\n, or choose \"Insert\"->'Text\" menu, then click once on the Layout view.\nA text box appears, and type as follows:\nData Sources:\nUS Bureau of the Census, 2000\nMBTA\nIf you want to correct, double click the text box to open a Properties window to change it. You can also change font style and size in this\nwindow.\nNote that you can use the Enter key to insert line breaks in the text. Once you click OK, the text is placed wherever you clicked in the layout\nwindow.\n(When you applied the template, a text box is already prepared on the left bottom. You can also use this ready-made text box to add texts.)\nYou can move this text by selecting the arrow pointer tool\n(far left), then dragging the text to a new position. To change the type size,\nselect the arrow pointer tool from the toolbar, then click once on the text. Small squares surrounding the text should appear. Then double click\non it.Once again we see the Symbol Window, but this time the text tools are displayed.\nChoose a font, a font size, and a font style. This time changes are automatically applied.\nIn the same way, add your username as the author and the current date.\nArrange map elements (North Arrow, Legend, Scale, Title, Comments) and modify the size and style to create an attractive layout.\nTo change the properties for the scale, double click the scale bar. Stepped Scale Line Properties window will open.\nChange Division Units to \"Miles\"\nIn the Layout View, adjust the size of the scale to make it look suitable to the map.\n\nBelow is an example of the final arrangement. However, it contains several flaws. For example, does it seem reasonable that one of the\nsubway lines cuts across the legend? Is the title, \"Cambridge Overview\" helpful or descriptive? Does the heading \"Census Tract\" make sense?\nYour map should be better than this.\nHow to export maps into \".bmp\" or \".jpg\" pictures.\nAfter you are satisfied with the layout design, you can export the map into a picture file. For this exercise, use JPEG (Joint Photographic\nExperts Group) format. Highlight the layout window, under File Menu, and choose \"Export Map...\".\nIn the Export window, choose \"JPEG\" as the File Type (do not use JPEG [ArcPress]), browse to H:\\private\\11.204\\lab4, name is as\njohndoe.jpg (replace johndoe by your username) and click OK. After seconds, the image file is exported and you can view the image in\nviewing software or upload the image to your web site.\n\nTake the time to improve the presentation. Add a descriptive title and neat lines. Remember, you are trying to convey an idea without the\nbenefit of an oral presentation.\nSave the map document and exit ArcGIS."
    },
    {
      "category": "Resource",
      "title": "access.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-204-planning-communications-and-digital-media-fall-2004/08bb9bf6b1a73cf0b6d5fe7ea5d7b186_access.pdf",
      "content": "ACCESS\nThe ease or difficulty of access with which the site can be accessed by its intended\naudience.\nIs the site public or private? Can anyone visit and use or is use restricted? What is the\nprice of admission?\nDoes the design of the site support and express the intended access?\nPrivate\nOstensibly Public\nOpen"
    },
    {
      "category": "Resource",
      "title": "accommodation.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-204-planning-communications-and-digital-media-fall-2004/7a21de43e46bd50d39b58becec6b9b1c_accommodation.pdf",
      "content": "ACCOMMODATION\nHow well does the site invite and accommodate the contributions of multiple actors?\nHow is this expressed in the site's design?\nMIT's Spotlight Mission: Diversity, Originality, Creativity"
    },
    {
      "category": "Resource",
      "title": "adaptability.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-204-planning-communications-and-digital-media-fall-2004/0efd3a9cfafb7973cd898e06d69579e3_adaptability.pdf",
      "content": "ADAPTABILITY\nHow well does the site adapt to change, especially the unforeseen?\nWest Philadelphia Landscape Project Site I (early 1996)\nWest Philadelphia Landscape Project Site II (late 1996)\nWest Philadelphia Landscape Project Site III (1997-2000)\nWest Philadelphia Landscape Project Site IV (2002-)"
    },
    {
      "category": "Resource",
      "title": "control.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-204-planning-communications-and-digital-media-fall-2004/f24ecb2147bdc51701a0d505dfa6a227_control.pdf",
      "content": "CONTROL\nTo what extent do users have control over their movements?\nCan the visitor come and go freely?"
    },
    {
      "category": "Resource",
      "title": "delight.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-204-planning-communications-and-digital-media-fall-2004/10260513de5dc3075e772a952b79bcc5_delight.pdf",
      "content": "DELIGHT\nIs the site a pleasure to visit? Does it elicit delight? Does it make you want to return?\nMIT Home Page: \"Graphics should elicit surprise, laughter, or delight. (Other reactions\nmay be equally acceptable.) They should offer a unique perspective on MIT, its\ncommunity, its campus, or its research, although seasonal or more generic graphics are\nappropriate as well. Originality and creativity are the two most important elements of a\ngood home page variation.\" Graphic Guidelines for the MIT Home Page\nOh! La! La!\nCaffeine\nFourth of July"
    },
    {
      "category": "Resource",
      "title": "fit.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-204-planning-communications-and-digital-media-fall-2004/66290b8647f9398fdba8fe20c6f97acc_fit.pdf",
      "content": "FIT\nHow well does the site fulfill its purpose? Does the site meet the needs of owners and\nvisitors? Does it facilitate their activities?\nWho Is the Audience? What Is the Site's Purpose?\nWho Is Speaking to Whom?\nTo What End?"
    },
    {
      "category": "Resource",
      "title": "justice.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-204-planning-communications-and-digital-media-fall-2004/a1c7113ae93eed7b7a6af6fe1730a3cb_justice.pdf",
      "content": "JUSTICE\nDoes everyone who needs to use the site have access or are some people who need access\nexcluded?\nMIT's Policy on Accessibility\nWorld Wide Web Consortium's Content Accessibility Guidelines"
    },
    {
      "category": "Resource",
      "title": "legibility.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-204-planning-communications-and-digital-media-fall-2004/5bb873a225709945498215cba4bdad36_legibility.pdf",
      "content": "LEGIBILITY\nThe ease with which the site can be perceived, understood, and navigated.\nStructuring the Territory: Flatland, Hierarchical, Linear, Associative\nGateways\nNavigation Aids"
    },
    {
      "category": "Lecture Notes",
      "title": "lec1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-204-planning-communications-and-digital-media-fall-2004/7e8885f416fba64dadffa3d8ddd80b88_lec1.pdf",
      "content": "Lecture 1: The Planner's Toolbox\n\n--------------------------------------------------------------------------------\n\nI. Subject Pedagogy\n\nA. Planning\n1. Requires an understanding of present conditions; it is context driven\n2. It is a systematic and creative way to influence the future of a place\n3. Planning activities focus on issues of equity, efficiency, and democratic\ninvolvement\nB. Communication\n1. The expression of ideas takes many forms: written, oral, graphic, etc.\n2. Communication is persuasive, it is rarely value free\n3. It is linked to analysis and ranges from the formal/sophisticated to the\ninformal/messy\nC. Digital Media\n1. The planner's toolbox consists of instruments to analyze problems and promote\nideas\n2. There are choices: Memos Vs. E-mail; Sketches Vs. Photographs/Video\n3. We will examine such tools as Dreamweaver, Photoshop, Excel, Access and\nArcView\nD. How can we examine these three concepts simultaneously?\n1. By exploring advanced and real-world applications and projects (lectures)\n2. By observing demonstrations of various planning-related software packages\n(recitations)\n3. Through a \"hands-on\" approach to working with digital methods of visualization,\nanalysis, and communication (labs/projects)\n\n--------------------------------------------------------------------------------\n\nII. Subject Logistics\n\nA. The Team\nB. Student Groups\n\n--------------------------------------------------------------------------------\n\nIII. Subject Content\n\nA. Lecture Notes\nB. Recitations\nC. Lab Exercises and Projects\nD. Syllabus\nE. Calendar\nF. Required Readings\n\nG. Evaluation\n1. Your Grade\n2. Mid-semester Feedback Session\n3. Final Evaluations\n\n--------------------------------------------------------------------------------\n\nIV. What is a web-based portfolio?\n\nA. A collection of work, derived from a tradition of showcasing accomplishments\nB. A portable, durable container for your planning-related endeavors\nC. A product for potential employers\nD. Previous Student Work\n\n--------------------------------------------------------------------------------\n\nV. Important resources (if time allows)\n\nA. Web Publishing at MIT\nB. Computer Resource Network\nC. Rotch Library's GIS Laboratory\nD. ESRI Virtual Campus\nE. Element K (register here)\nF. IAP 2005"
    },
    {
      "category": "Lecture Notes",
      "title": "lect1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-204-planning-communications-and-digital-media-fall-2004/0313196688ff318442291694fed8b9e3_lect1.pdf",
      "content": "Massachusetts Institute of Technology\nDepartment of Urban Studies and Planning\n11.204: Planning, Communications & Digital Media\nFall 2002\nLecture 1: The Planner's Toolbox\nI. Exploring the Venn\n\nWhat do we mean by \"planning?\"\n-\nPlanning requires an understanding of present conditions; it is context driven\n-\nIt involves linking knowledge and action to improve the quality of (development\nand other) decisions\n-\nPlanning activities focus on issues of equity, efficiency, and democratic\ninvolvement\n-\nIt is a systematic and creative way to influence the future of a neighborhood, city,\nregion, etc.\n\nWhat do we mean by \"communications?\"\n-\nCommunicative tasks may take many forms: written, oral, graphic, etc.\n-\nIt involves expressing ideas (and plans) to others\n-\nCommunication is persuasive, it is rarely value free\n-\nIt is linked to analysis and ranges from the formal and sophisticated to the\ninformal and messy\n\nWhat do we mean by \"digital media?\"\n-\nThe planner's toolbox consists of instruments he/she relies upon to analyze\nproblems and promoting ideas\n-\nMemos Vs. E-mail; Quick calculations Vs. Spreadsheets, Sketches Vs.\nPhotographs/Video; Overlays Vs. GIS\n-\nWe will examine such tools as Dreamweaver, Photoshop, Excel, Access and\nArcView\nII. This Course\n\nHow can we examine these three concepts simultaneously?\n-\nBy examining advanced and real-world applications and projects (lectures)\n-\nBy observing demonstrations of various digital technologies and planning-related\nsoftware packages (recitations)\n-\nThrough a \"hands-on\" approach to working with various digital methods of\nvisualization, analysis, and communication (labs/projects)\nHow do we get started?\n-\nThe Team\n\n-\nA Quick Note on Certificates\n-\nSyllabus/Calendar\n-\nLecture Notes\n-\nSections and Recitations\n-\nLabs\n-\nRequired Readings\n-\nStudent Work\n-\nElement K\n-\nYour Grade (Web-based Portfolio Project, 20%; Cambridge Project, 20%; Lab\nExercises, 50%; Attendance/Participation, 10%)\nIII. What is a web-based portfolio?\n-\nA portfolio is a collection of work, derived from a tradition of showcasing\naccomplishments\n-\nA digital portfolio is durable and a web-based portfolio is portable\n-\nIt is a container for your planning-related endeavors, a product for potential\nemployers, your professional brochure\nLet's take a quick look at some examples,\nFilippo Caprioglio, Architect\nProfessor Dirk Donath, Chair Computer Science in Architecture\nCreated September 2002 by Lorlene Hoyt.\n."
    },
    {
      "category": "Resource",
      "title": "rec1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-204-planning-communications-and-digital-media-fall-2004/2cb076a89ef94c77abfd3036c1535935_rec1.pdf",
      "content": "11.204 Planning Communications and Digital Media - Recitation 1\nFall 2004\nRecitation I - Introduction to Web Page Creation with\nDreamweaver\n\nFirst, a brief history of the WWW\nIn 1989 while at the Conseil Europeenne pour la Recherche Nucleaire (CERN) in\nGeneva, Switzerland, Tim Berners-Lee wrote a hypertext editor program on a\nNeXT machine to link documents over a network so physicists could share\ninformation on their research. He called the program WorlDwidEweb. He ran the\nprogram on a \"web server\" at CERN. Three new technologies were incorporated\ninto his web server idea. Briefly, they were HTML (HyperText Markup Language)\nused to write the web documents, HTTP (HyperText Transfer Protocol) to\ntransmit the pages, and a web browser client software program designed to\nreceive, interpret data and display results. An important concept in the web\nserver idea was the fact that the client software program's user interface would\nbe consistent across all types of computer platforms so that users could access\ninformation from many types of computers. A line-mode (i.e., text only) user\ninterface was completed in 1989. By May 1991 the first information-sharing\nsystem using HTML, HTTP, and a client software program (called www) was fully\noperational on a multi-platform computer network at the CERN laboratories in\nSwitzerland.\n\nEducational institutions and industry took notice of Berners-Lee's web server\nconcepts. In 1993 Marc Andreesen an undergraduate student at the University\nof Illinois at Urbana-Champaign was working on a project for the National Center\nfor Supercomputing Applications (NCSA) when he led a team that developed the\ngraphic interface browser called Mosaic. Following the release of a beta version\nof Mosaic early that year, Version 1.0 of Mosaic was released in September 1993\nfor the Windows, Macintosh and the X Windows System platforms. Popularity of\nthe graphical user interface (GUI) browser was immediate. People without\ncomputer expertise were able to use the graphical interface and just point and\nclick to navigate the World Wide Web. The WWW grew quickly. Marc\nAndreesen left NCSA in March 1994. He and Jim Clark formed a company later\nknown as Netscape Communications Corporation.\n\nBerners-Lee decided to form the World Wide Web Consortium in September\n1994, with a base at MIT in the USA, INRIA in France, and also at Keio\nUniversity in Japan. (The above brief history was copied nearly verbatim from the following source:\nhttp://www.hitmill.com/internet/web_history.asp \"History of the Web: Beginning at CERN\" by Cheryl Gribble).\n\nPrior to the above developments, in the late 1950s the U.S. federal government\ncreated a research group called the Advanced Research Projects Agency\n(ARPA). By 1969, ARPA, along with the Department of Defense and various\nuniversities across the country, had built a computer communications network\ncalled ARPANET, intended to keep communities connected in case of nuclear\nattack. The first two nodes were at UCLA and the University of Utah. By 1971\nthere were 23 nodes, and by 1977 there were 111 nodes. This infrastructure\n\n11.204 Planning Communications and Digital Media - Recitation 1\nFall 2004\nfacilitated the tremendous growth of Berners-Lee's WWW in the U.S. By 1994\nthere were 4 million nodes. (The ARPANET information was taken from\nhttp://www.dei.isep.ipp.pt/docs/arpa.html \"History of ARPANET\" by Michael Hauben and\nhttp://smithsonian.yahoo.com/internethistory.html \"Birth of the Internet.\")\n\nArchived websites...at first it was text only.\nTake a look at the first web site in Japan. click here.\nArchived sites (1996): MIT | Yahoo! | White House\n\nBasics of web page creation in Dreamweaver\n1. Start Dreamweaver by clicking Start -> Programs-> Macromedia ->\nMacromedia Dreamweaver MX.\n\nThe Dreamweaver document window is surrounded by the toolbar, insert bar,\npanels, status bar and properties inspector, as well as the usual pulldown menus.\n\nPulldown menus\nPanels\n\nInsert bar\nToolbar\n\nBlank workspace\nto create your web\npage\n\nStatus bar\n\nProperties\nInspector\n\nOne way to find out the function of any button on the toolbars is to hold the\nmouse arrow over the button icon. The name or function of the button will\nappear.\n\n11.204 Planning Communications and Digital Media - Recitation 1\nFall 2004\n2. When you are done exploring, start a new web page by selecting File->\nNew. Then select Basic Page in the Category column and HTML in the\nBasic Page column.\n\nType in some text\n1. Open the Property inspector and select the font or heading type.\n2. Click the Align Center icon and type in the text you would like to see in\nyour first web page.\n3. The first three buttons on the Toolbar are \"Show Code View,\" \"Show\nCode and Design Views,\" and \"Show Design View.\" When in \"Show\nDesign View\" Dreamweaver will show your web page as it may appear in\na web browser. Switch between Design View and Code View to see the\ndifference between the HTML code and the interpretation of the code by a\nbrowser.\n\nHTML tags\nParagraph tags and break tags\nParagraph tags <p> are paired tags that surround a block of text and place two\ncarriage returns after the block.\n\nA break tag <br> is a single tag that places a single carriage return anywhere.\nShift+Enter inserts a break tag.\n\nClick here to view a list of HTML tags.\n\nTo see the HTML code for any web page:\n1. Click on the Internet Explorer icon to open the MIT web page (or any web\npage).\n2. Right-click on the page and choose View Source.\n\nSave your web page\n1. Look in My Computer and find your www folder on the H: drive where\nyour home directory resides. The terms folder and directory mean the\nsame. Everyone has a folder called www in their home directory.\n2. Suggestion for organizing your working files.....Create a new folder in your\nwww folder. Call the new folder \"testfiles.\" After creating the first page of\nyour web site save the document as \"index.html\" in your www\\testfiles\nfolder. Index.html is the default file name for the initial opening file on web\nservers. If you open http://web.mit.edu/, you are actually opening\n\n11.204 Planning Communications and Digital Media - Recitation 1\nFall 2004\nhttp://web.mit.edu/index.html. You should not keep the index.html file in\nwww while it is under construction. When you have refined your site and\nare ready to put it up on the web you can copy all of the contents of\nwww\\testfiles into www (provided your file references, i.e., pathways, are\nrelative...more about this later).\n\nChange the document title and page properties\n1. Give your document a meaningful title, especially if you want the major\nsearch engines to find it. You can change the document title several\nways:\na. Type a name in the space in the toolbar,\nb. Pull down the Modify-> Page Properties menu and type a new\nname, or\nc. Right-click on any part of the white space in the document\nwindow and choose Page Properties.\n2. In the Page Properties window you can also change the text color,\nmargins, etc.\n3. Or, select the text you typed in earlier and experiment with the format\nchoices in the Text Properties Inspector. In the future, Cascading Style\nSheets (CSS) text specifications will be the approved way of applying\nfonts and font sizes by the W3C (the Web standards organization).\n\nWhat we can put on a website\nImages, text, tables, video, links, scripts and more!\n\nSome things to know about images\nImages are separate files called by the HTML program and inserted by the\nbrowser when you view the Web page. Most new browsers support the two\nstandard image formats and one newer image format. The standard image\nformats are GIF and JPEG. The newer format is PNG. GIF is better for images\nthat have blocks of continuous color, like drawings. JPEG is better for\nphotographic images and images that do not have blocks of continuous color,\ne.g., images that have a color gradient. PNG is a replacement for the GIF\nformat.\n\nLet's find an image we can insert in our web page\n1. We'll start out by searching the web for an image you like. In the future,\nyour images should be your own.\n2. When you find an image from the web that you would like to use on your\nweb page, place the cursor over the image and click on the save icon.\nIf you don't see any icons just right-click on the image and choose\n\"Save Target As...\"\n\n11.204 Planning Communications and Digital Media - Recitation 1\nFall 2004\n3. Navigate through the directories until you find your www\\testfiles folder.\nCreate a subfolder, name it images, and save the image in this subfolder.\n\nInsert an image\n1. To insert an image in a web page place the cursor where you want the\nimage to appear.\n2. Pulldown Insert-> Image.\n3. Find the www\\testfiles\\images folder where you saved the image.\n4. Click on the image file name.\n\nCreating lists\n1. Type a list of items and hit enter after each item.\n2. Select all lines and choose the Unordered List button in the Properties\nInspector to format the list with bullets.\n\nAdd a separator line\n1. Click on the page where you want to add a separator line.\n2. Click on the Common tab in the Insert Bar and the click on the\nHorizontal Rule button.\n\nCreate a hyperlink\nA web site can be made up of many web pages. Hyperlinks allow you to open\nadditional web pages (as well as, other files) from within any web page. The\nunderlined blue URLs (Uniform Resource Locator) in the \"Save your web page\"\nsection above are hyperlinks, meaning when you click on them additional web\npages open. You can link to many kinds of files in your web page, but only some\nfile types, such as supported image formats, HTML, plug-in applications, and a\nfew other specialized types of files, will display in the browser.\n\n1. Create another web page document and save it in your www\\testfiles\nfolder OR find an existing page on the web to link to, such as\nhttp://web.mit.edu/.\n2. Create a hyperlink to http://web.mit.edu/ (SHOULD START WITH http://)\nby clicking on the place in your web page where you would like the\nhyperlink.\n3. The click Insert->Hyperlink.\n4. Type in the text that will hold the hyperlink.\n5. Type in the URL of your link.\n6. Consider opening the hyperlinked web page in a new window. Use the\n\"_blank\" target option. Click OK when you are done.\n\n11.204 Planning Communications and Digital Media - Recitation 1\nFall 2004\nPreview your page in a browser\n1. First save your work by choosing File->Save.\n2. Choose File->Preview in Browser and then Edit Browser List.\n3. Dreamweaver may have already located a browser program and put it on\nthe list during its installation process. If not, click on the + button to add a\nbrowser, usually iexplore or Netscape. You will have to locate the .exe file\nfor the browser in the Programs directory.\n4. You can also open your first web site.\nNow you have your own web site!\n\nQuestion for you to answer:\nThe following web page is named mypage.htm, located in your www folder.\nWhich files would also need to be in www for it all to appear on the internet?\n\n<HTML><HEAD><TITLE>My Page</TITLE></HEAD>\n<BODY BACKGROUND=\"clouds.gif\">\n<IMG SRC=\"me.jpg\" ALIGN=\"right\">\n<H1>My Web Page</H1> I have a page on the Web!<P>\n<A HREF=\"otherpage.htm\">Click here to see my other page.</A>\n</BODY></HTML>\n\nWeb design analysis\n-\nUse 11.204 site as an example.\n-\nWhat \"functions\" and \"contents\" should this site have? What are missing?\n-\nWhat are the major \"design elements\" found in this web site?\n-\nWhat suggestions for improvement would you make?\n\nHow to design your web portfolio...Project #1\n-\nPonder on the overall framework of your \"portfolio.\"\n-\nJust usePAPER AND PENCIL! That's what real web designers do... an\nexample of a layout sketch.\n-\nPrepare two things: Site Map and Design Template\n\nSite Map\n-\nConsider the hierarchical structure. Make it logical. Avoid creating \"a\nmessy web.\"\n\n11.204 Planning Communications and Digital Media - Recitation 1\nFall 2004\nBELOW IS A SAMPLE FRAMEWORK - USE YOUR CREATIVITY!\n\n-\nTerminology: Web Page versus Web Site.\n\nDesign Template\n-\nYou are allowed to use only static text and a few simple images.\n-\nTechnical elements of page design:\nText (fontsize/font-face)\nImage\nAlignment (Left, Center, Right)\nBackground (Color/Image Pattern)\nColor\nTable\n-\nOperational elements of page design:\nTitle\nNavigation\nViewer should be able to recognize where they are in the site.\nIndex\nContents\nIdentity/footnotes\n\nResources\nMIT logo web site http://web.mit.edu/graphicidentity/\n\n11.204 Planning Communications and Digital Media - Recitation 1\nFall 2004\n\nUse Dreamweaver's Site Definition Wizard to design and organize your\nwebsite. This wizard helps you organize your working files while you are creating\nyour site. Then Dreamweaver can help you upload your finished files to the\nserver all at once. In Dreamweaver, go to Site->New Site to start the Site\nDefinition Wizard.\n\nAdditional thoughts:\n\nWhat is your \"role\" in web site development?\nAs a planner, you need to understand all viewpoints.\n\nAs consultant:\nWeb strategist: suggest information presentation strategies that help your\nclient achieve their goals.\nWeb designer: compose in HTML, apply design principles, etc.\nAs client:\nDecision maker: review and guide what your team develops.\nProject leader: manage your team and develop the web site with help from\nprofessionals.\nAs user:\n\nIn your experience what works, what doesn't?\n\nElements of Web Development\n-\nStrategy - marketing, target segment, media-mix, positioning,\ndifferentiating from competitors.\n-\nStructure - hierarchical, horizontal, database, search feature.\n-\nTechnology - HTML, Flash, Streaming video.\n-\nDesign - color scheme, top page, templates, navigation.\n\nYour task is to develop your portal site\nStrategy -> Structure -> Technology -> Design\n\n-\nOrganize your thoughts... use pencil and paper!\n-\nWho is your audience?\n-\nWhat is the purpose of your portal site? What is the message?\n-\nWhat information is essential to your message?\n-\nWhat is your SWOT?\n-\nWhich technology do you employ? Will you try flash, video\ncomponents?\nWhat kind of de\n-\nsign scheme will you apply? (again, what will your\ntarget viewers like?)\n\n11.204 Planning Communications and Digital Media - Recitation 1\nFall 2004\n\nReminders:\n\n-\nYour WWW-related files should eventually be saved in the H:/www/\nfolder on AFS. When your opening page is saved in your H:/www/\nfolder as index.html, you can view the file in IE or Netscape.\n\n-\nTo edit the \"index.html\" file start Dreamweaver, and open the file using\nthe \"File->Open\" menu. Do not double-click on the index.html file to\nedit it in Dreamweaver because it will be launched in your browser.\n\n-\nIf you want to place images on your page:\no create a folder named \"media\" in the \"www\" or your \"www/testfiles\"\nfolder.\no save (or copy) image files into the media folder.\no on Dreamweaver, use \"Insert\"->\"Image\" function. You need to\nspecify the location of the image files you want to embed in your\npage.\n\n-\nIf you want to start working on other contents (like a bio page...).\nCreate a new document from \"File\"->\"New\" (Basic HTML file). Save\nyour new file in the \"www\" folder or your working directory with a name\nOTHER THAN index.html. Please remember the name. Write it down\non your site map/design template.\n\n-\nTo create a hyperlink in your top page, select the text where you want\nto attach the hyperlink. In the \"link\" box on Dreamweaver, type the\nname of the file to link to (you don't need \"http://www...\" in this case,\njust the file name like \"bio.html\"). You need http://www... if you want to\nmake hyperlinks to external web sites.\n\n-\nTo test a revised index.html file on IE or Netscape. If it remains\nthe same (does not reflect your work), press the \"Refresh\" button\n(looks like a recycle logo) to reload the page in the web browser.\n\nIf you have more specific questions once you start working on Dreamweaver,\nplease contact your TAs for help. Next week we will spend most of our time on\nthe mechanics of Photoshop. The third recitation will include more skills for\nDreamweaver and Photoshop.\n\nAlso, if you are coming to the next recitation session, and have a notebook PC\nloaded with Dreamweaver, please bring it with you."
    },
    {
      "category": "Resource",
      "title": "rec2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-204-planning-communications-and-digital-media-fall-2004/06287311c3373d2606045c4ee7091490_rec2.pdf",
      "content": "11.204 Planning Communications and Digital Media - Recitation 2\nFall 2004\nRecitation 2 - Introduction to Photoshop\n\nWhat is Adobe Photoshop?\nAdobe Photoshop is a tool for creating digital graphics either by starting with a\nscanned photograph or artwork or by creating the graphics within the program.\nPhotoshop can help you resize, retouch, and color digital images and add other\ncomputer effects.\n\nStart Adobe Photoshop\n1. Go to Start->Programs->Adobe Photoshop.\n2. Find an image on the web and save it to your directory.\nhttp://commpres.env.state.ma.us/search/photo_search.asp\n3. Navigate to your directory and double-click on the file you saved.\n\nLet's explore the Photoshop window\n- The status bar at the bottom shows the current magnification of the image\nyou opened.\n- You also see on the status bar the physical size and the storage size of\nthe image.\n- There are several floating palettes on the right for navigating, choosing\ncolors, working with layers, etc.\n- Explore the Color, Brushes, History, etc. palettes.\n\nToolbar Palettes\n\nStatus Bar\n\n11.204 Planning Communications and Digital Media - Recitation 2\nFall 2004\n- The Layers palette is used to separate and arrange your work so you can\npreview changes before permanently altering the pixels in the image.\n- You can also create multiple effects and modifications that you can save\nand print (or use in your website) separately.\n- Using the tab key will show or hide palettes.\n\nExplore the Toolbar\nMove the mouse over the different tools to display their names/functions. Make\nnote of:\n- Foreground/Background\n- Standard and quick mask mode.\n- Full screen and standard screen mode.\n- The magnify tool.\n\nHow Photoshop is organized\nA Photoshop file is really a stack of layers. The types of layers in Photoshop are:\nBackground - At the bottom of the stack, completely filled with pixels.\nTransparent layers - Can hold pixels, but can have areas that are completely or\npartially transparent.\nAdjustment layers - Don't contain pixels, but hold instructions regarding color\nor tone of the layer below.\nType layers - Contain text and their characteristics.\nShape layers and Fill layers - Don't contain pixels, but hold instructions on what\ncolor they should be and what parts of the layer can show.\n\nEach layer, except the Background, can include one or two masks. Masks are\neither pixel based (layers mask) or instruction based (vector mask).\n\nSkill-building in Photoshop\nUsing Filters\nWith an image open, try out some of the filtering options. Just pull down the\nFilter menu and choose some of the artistic effects. You can preview the effect\nand cancel it or you can click OK and allow the effect to change the image. If\nyou don't like the effect after you click OK, then use Ctrl-Alt-Z to undo it.\n\nUnsharp mask\nUnsharp Mask locates pixels that differ from surrounding pixels by the threshold\nyou specify. You can increase the pixels' contrast by an amount you specify. In\naddition, you specify the radius of the region to which each pixel is compared.\nThe effects of the Unsharp Mask filter are far more pronounced on-screen than in\nhigh-resolution output.\n\n11.204 Planning Communications and Digital Media - Recitation 2\nFall 2004\n1. With the image active in the Layers palette choose Filter->Sharpen-\n>Unsharp Mask.\n2. Play with the sliders and see the effects in the image. Cancel when you\nare done.\n\nCropping an image\nAfter scanning in a photograph you may want to crop the image, meaning you\nselect a part of the image to keep. You may also want to crop an image in order\nto change the size so that it fits in a document or your web page. To crop an\nimage:\n1. Select the crop tool\n.\n2. Drag the tool over the image and draw a rectangle around the area you\nwant to keep.\n3. Hit enter to complete the crop.\n4. You can also designate the exact dimensions you want in the cropped\narea by filling in width and height on the cropping toolbar.\n\nSelecting areas of the image - using the selection tools\nThere are several tools in Photoshop for selecting an area of the image to\nprocess. Try out a few.\n1. Choose the rectangular marquee tool and draw a box around a part of the\nimage to select it.\n2. To remove a selection you have made (i.e., unselect) go to Select-\n>Deselect.\n\nNow hold down the mouse button on the rectangular marquee tool to see some\nof the other selection tools.\n3. Choose the elliptical marquee tool and make a selection.\n4. Remove the selection with Select->Deselect.\n5. Now hold down the shift key and make a selection with the elliptical tool\nagain. When you let go of the mouse button and the selection is complete\nnotice that the area is a perfect circle as opposed to an ellipse. The shift\nkey enables this option.\n\nYou can also adjust your selection by choosing Select->Transform Selection.\nThis menu choice will add adjustment handles to the selected area so you can\nexpand or shrink the selected area.\n\nWorking on selected areas\nIf you don't want modifications to apply to the entire image you can select a\nportion of the image and save it to a layer. Then modify only that layer.\n1. Select the area you want to work on with the marquee tool.\n2. Then choose Layer->New->Layer via Copy.\n\n11.204 Planning Communications and Digital Media - Recitation 2\nFall 2004\n\nAdjust levels\n1. First, make sure the Info palette is available by going to Window->Info. To\nadjust the Brightness or Contrast of an image go to Image->Adjustments-\n>Brightness/Contrast.\n2. Use the sliders to change the brightness and contrast values. You will see\nthe effect in the image.\n3. Use the mouse pointer and click anywhere on the image. You will see\nvalues displayed in the Info palette for this point. The left-hand numbers\nare the values in the original image and the right-hand numbers are the\nvalues after you made Brightness/Contrast adjustments.\n4. Keep in mind that the Brightness/Contrast tool makes changes on the\nwhole image. For more Brightness/Contrast control use the \"Levels\"\noption.\n\nBefore making any changes to the original image with the Levels option:\n1. Open an adjustment layer by going to Layer->New Adjustment Layer-\n>Levels.\n2. Make the New Adjustment Layer active in the Layers palette.\n\nThe Clone Stamp Tool\nThe clone stamp tool can be used to copy small pieces of a picture to paste\nelsewhere.\n1. Choose the clone stamp tool from the Toolbar.\n2. Choose a brush size.\n3. Hold down the Alt key and click on a spot on the image that you want to\ncopy.\n4. Use the stamp to click on areas you want filled with spot you copied. You\ncan click as many times as you want.\n\nAdding Text\nText in Photoshop is added as an additional layer.\n1. Click on the top layer in the layers palette.\n2. Choose the horizontal Text tool in the tool bar.\n3. Drag a box on top of your image and type in the text you want. Hit Enter\non the numeric keyboard when you are done.\n4. Change the text font type, color and size on the text toolbar.\n\nSave (where and in what form)\nWhen you are satisfied with your image you should save it. It is recommended\nthat you save it to a new file (you'd still have the original). If you are going to\ncontinue working on the image save it as a Photoshop (.psd) file. When you are\ncompletely finish processing the image and are ready to put it in your website\n\n11.204 Planning Communications and Digital Media - Recitation 2\nFall 2004\nsave it again as a jpeg (.jpg) file type because jpeg compresses the image and\nwill make a fairly small file.\n1. Go to File->Save As.\n2. Choose the appropriate file type and name it.\n3. Be sure to save it in your www/testfiles/media folder for use in your\nwebsite.\n\nTo learn more\nPlease refer to the Lab 2 document \"Photography and the Construction of Visual\nArguments\" for information about the Dreamweaver and Photoshop topics\ncovered in the course modules found within the online tutorial elementk.\n\nFor information on the following -\nchecking out the digital cameras, or\n\ngetting photos in digital form by:\n\ndownloading from a digital camera\n\nscanning using flatbed scanner\n\nscanning using slide scanner\n\nvisit the Computer Resource Network (CRN) for DUSP at http://crn.mit.edu/. At\nthe CRN site click on facilities/resources or scanning to find out more about\nborrowing a digital camera or scanning photographs and images."
    },
    {
      "category": "Resource",
      "title": "rec3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-204-planning-communications-and-digital-media-fall-2004/d316ebeedc344134270596adf1ace887_rec3.pdf",
      "content": "11.204 Planning Communications and Digital Media - Recitation 3\nFall 2004\nRecitation 3 - Further Work with Dreamweaver and\nPhotoshop: Refining your Web Site\n\nMore Photoshop skills\n\nSelecting areas of the image - using the selection tools\nIn Recitation 2 we learned there are several tools in Photoshop for selecting an\narea of the image to process.\n1. Choose the rectangular marquee tool and draw a box around a part of the\nimage to select it.\n2. To remove a selection you have made (i.e., unselect) go to Select-\n>Deselect.\n\nNow hold down the mouse button on the rectangular marquee tool to see some\nof the other selection tools.\n3. Choose the elliptical marquee tool and make a selection.\n4. Remove the selection with Select->Deselect.\n5. Now hold down the shift key and make a selection with the elliptical tool\nagain. When you let go of the mouse button and the selection is complete\nnotice that the area is a perfect circle as opposed to an ellipse. The shift\nkey enables this option.\n\nYou can also adjust your selection by choosing Select->Transform Selection.\nThis menu choice will add adjustment handles to the selected area so you can\nexpand or shrink the selected area.\n\nMore selection tools\nThe Lasso tool gives you more control in selecting areas of an image than the\nrectangular or elliptical marquee tools. The polygonal lasso tool allows you to\nchoose an area by clicking on surrounding points. By holding down the Alt key\nthe polygonal lasso tool is temporarily changed to the lasso tool.\n\nRectangular marquee tool\nLasso tools\n\nMagic Wand tool\nStandard Mode\nQuick Mask Edit\n\n11.204 Planning Communications and Digital Media - Recitation 3\nFall 2004\n\nThe Magic Wand tool can be used to select areas of similar color and brightness\nvalues. By checking the contiguous option and changing the tolerance value you\ncan refine your color/brightness selection.\n\nThe Magnetic Lasso tool (pull down the Lasso tool to see this option) allows you\nto outline an area for selection based on the contrast between the object you are\nselecting and the surrounding pixels in the image.\n\nInverting the Selection\nAfter selected a portion of an image you can then \"invert\" the selection, i.e.,\nselect what wasn't outlined, by choosing Select->Inverse.\n\nQuick Mask\nSelected areas in images can be designated as \"masks\" so they remain\nunchanged when you alter the unselected parts of an image. You can first make\nsure the masked area is selected correctly by clicking on the \"Edit in Quick Mask\"\nbutton to modify your selection. Use the brush to add or subtract from the mask.\nThe color white subtracts, the color black adds.\n\nStandard Mode\nChange back to Standard Mode after editing in Quick Mask to make changes to\nthe unmasked part of the image.\n\nSave Your Selection as a Channel\nSave your selection as a channel so you can use it later if you need to. Do this\nby clicking on the \"Save selection as a channel\" button at the bottom of the\nChannels panel on the right of your screen. Alpha channels hold information\nabout the masks you create.\n\nChange Background\nWhile in Standard Mode try changing the background of your image (with the\nmask). Use the Gradient tool and try different effects.\n\nOutline Sunglasses\nOutline the sunglasses in the picture provided or use any picture you have to\noutline an object.\n\nCopy and Paste\nGo to Edit-> Copy, then activate your first image and choose Edit-> Paste.\n\nMove\nUse the Move tool to move the sunglasses in place.\n\nCrop\n\n11.204 Planning Communications and Digital Media - Recitation 3\nFall 2004\nCrop the modified image where you pasted the sunglasses. Save this image for\nthe web.\n\nImage resolution, size, file types, etc.\nUnlike printed images, images displayed on the web always appear at the\nviewer's monitor resolution, which is usually between 72 and 96 ppi. The image\nsize in inches and the resolution in pixels per inch are unimportant, the width and\nheight as measured in pixels determine the size at which the image will appear.\n\nIf an image's pixel dimensions exceed 750 pixels wide or 500 pixels tall, the\nentire image may not fit within a browser window, forcing the viewer to scroll to\nsee parts of the image. As a convention, many people save images intended for\nthe Internet with a resolution between 72 and 96 pixels per inch (and about 800\nby 600 pixel dimensions) so if printed from Photoshop or another application, the\nimage will appear approximately the same size that it did on screen.\n\nTry to adjust the size and resolution of images to optimize quality, while keeping\nthe file size to a minimum.\n\nYou can find out what an image will look like and how large a file in a particular\nformat will create by choosing:\n1. File->Save for Web and then,\n2. Select the 2-up or 4-up tab at the top of the image frame. You will then\nsee the image repeated and you can set each frame to show the image as\na different file type, such as, jpeg, gif, png, and wbmp. You will also see\nthe respective file sizes and download times.\n\nTry to keep your image files under 30KB apiece so that even people with slow\nmodems can load them quickly. Also, keep in mind png files are the newest file\ntype and not all browsers can read these files.\n\nIf you are working with jpeg files in Photoshop you should work in RGB mode\nbecause this is the \"monitor\" viewing mode.\n\nFYI: Each time you save a file as a jpeg you lose data. Never save a file as a\njpeg a second time. If you have converted to jpeg and want to go back and make\nchanges, use the original Photoshop file.\n\nCopying image characteristics\nYou can copy the image size, canvas size, resolution or color mode of one image\nto another image.\n1. Have two images open, make one active and go to Image->Size.\n2. Then choose Window->Documents and find the name of the file you want\nto match.\n\n11.204 Planning Communications and Digital Media - Recitation 3\nFall 2004\n3. Notice that the dimensions change when you click on the matched file's\nname.\n\nCreating and using backgrounds\nBackgrounds can make your website difficult to read if not used correctly, but\nthey can also help you create a certain \"look.\" Since you can use an image as a\ntile in HTML, your background files can be quite small.\n\nHere's one way to place a bar along one side of your web page like a border.\nCreate a file in Photoshop that is the width of a page (I use 1400 pixels on my\nlaptop) and about 100 pixels high. Select an area near the left side of this new\nimage and fill it with a pattern. Save the image as a jpeg file.\n\nIn Dreamweaver open your web page and right click on the white space. Choose\nPage Properties and, next to Background Image, Browse for the image file\nyou just created in Photoshop. Dreamweaver will automatically tile this image as\nbackground and the small area you filled with a pattern will look like a bar along\none side.\n\nMore Dreamweaver Skills\nAdding a table to your web page\n1. Place your cursor where you would like the table to be inserted on your\npage.\n2. Go to Table->Insert (or click on the Table icon in the Insert bar) and when\nthe table dialog appears accept the default columns and rows.\n3. Click OK.\n\nUsing tables to organize and place elements on a web page\nDreamweaver allows you to use tables to design and place elements in your web\npage. This is done in Layout View.\n1. Click on the Layout tab on the Insert bar.\n2. Click on \"Layout View.\"\n3. Select the \"Draw Layout Cell\" button on the Insert bar.\n4. Draw cells to hold page elements.\n\nQuick tips for designing with tables in layout view\n1. When you place your cursor over the edges of a layout table cell, the\noutline of the cell changes from dotted blue to solid red. This is when you\ncan click the cell to select it. A selected cell appears as a solid color\noutlined by the resize handles. Move cells by selecting and dragging\nthem.\n2. You can resize cells by dragging the resize handles.\n\n11.204 Planning Communications and Digital Media - Recitation 3\nFall 2004\n3. You can resize the whole table in the same way.\n4. To create multiple layout cells without having to click on the Draw Layout\nCell button every time, hold down the Ctrl key in Windows.\n\nWhat are relative and absolute pathnames?\nWhen linking web pages, images, videos, etc. you need to insert the \"address,\"\nor pathway, to the file you want to link to. There are two types of addresses that\ncan be used in these pathways. They are relative addresses and absolute\naddresses. A relative address describes the pathway to another file only as it\nrelates to the current web page. Absolute addresses include the full Internet\naddress of the file to be linked.\n\nAn example of a link with a relative pathname...\nSay you have a page named index.html in a directory folder\nand you want to include a link from index.html to a page named mycv.htm.\nMycv.htm happens to be in a sub-folder named bio. In HTML the link\nwould look like the following:\n\n<A HREF=\"bio/mycv.htm\">Read my CV online.</A>\n\nYour CV might also contain a link back to your index.htm page:\n<A HREF=\"../index.htm\">Return to the main page.</A>\n\nThe double-dot .. is a special code that means \"the folder containing the current\nfolder\" or, I like to think of the double-dot as meaning \"move up one folder\" (or\ndirectory level).\n\nBy the way, HREF stands for Hypertext Reference and is called an attribute of\nthe <A> tag. The <A> tag is used to define links and anchors.\nWhy use relative addresses instead of absolute addresses? Well, because\nsometimes server names change or you need to move your web pages to\nanother site. If your hyperlinks use relative addressing then your links will still\nwork. If you use absolute addressing you would have to change the URL for\neach link to keep them working.\n\n11.204 Planning Communications and Digital Media - Recitation 3\nFall 2004\nRollovers\nA rollover image is two images on top of one another. When viewed in a browser\nif you place the cursor on the top image the bottom image appears. A rollover\ncould be used to attract attention or make a statement about change. Here is\nhow to insert a rollover image.\n1. Click on the Rollover Image icon on the Insert Bar and place the cursor on\nyour page where you would like to put the rollover image.\n2. Type in a name for the rollover.\n3. In the original image text box click on Browse and find the image you want\ndisplayed when the page loads.\n4. In the rollover image text box click on Browse and find the image you want\ndisplayed when the cursor is placed on the original image.\n5. Select the Preload Images option.\n6. You can fill in the Alternate Text option with information about the images\nfor text only browsers (this is optional and rare).\n7. In the When Clicked Go to URL text box insert the pathway to a file you\nwant to open if you click on the rollover image.\n\nCreat a link that takes you back home\nYou learned how to create links to subsequent pages in Recitation 1. How would\nyou insert a link on each of your web pages that would allow a user to quickly go\nback to your home page? Would you use an absolute or relative address?\n\nReminder: To learn more\nPlease refer to the Lab 2 document \"Photography and the Construction of Visual\nArguments\" for information about the Dreamweaver and Photoshop topics\ncovered in the course modules found within the online tutorial elementk."
    },
    {
      "category": "Resource",
      "title": "rec4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-204-planning-communications-and-digital-media-fall-2004/817fd5637fb3dc81d876d46646f0f496_rec4.pdf",
      "content": "Recitation 4: Introduction to Microsoft Excel\nWhen working as an urban planner (or one of its variants), you may need to analyze data from all sorts of sources. Excel can serve\nas a starting point for gathering data in order to format, sort, and analyze it.\nExcel can readily view many different types of data and convert them into spreadsheet format. However, it does not establish a\nrelationship between data records - that is, Excel does not think of one row of information as having any connection to another\nrow. In order to create data relationships, you use a relational database program such as Microsoft Access (other popular examples\nare Lotus Notes, Sybase, and Oracle). These relational database management systems will be covered in Recitation 6.\n\nSample Data for Today's Recitation:\nFile 1 (tab deliminated)\nFile 2 (comma deliminated)\nFile 3 (fixed width)\nFile 4 (dbf)\nFile 5 (excel)\nDownload the files to your MyDocument folder (or on the desktop, or anywhere you can easily find).\n\nImporting Data\nDemographic data are often distributed in different format. (see the raw data using the notepad)\n1. Tab-deliminated (.txt)\n2. Comma-deliminated (.csv)\n3. Fixed width (.txt or .prn)\n4. Excel format\n5. Access format\n6. DBF (dBase file)\ndBase is one of the oldest database softwaare. Its format still survives although we don't use the software any more.\nChoose \"DBF 4 - dBase IV\" when you are asked to choose among different versions.\nThe first row in Excel corresponds to the field name for each column.\nGIS software packages often require this format for importing data.\nUsing Excel, you can open/save in all of those formats. Beware, Excel will try to lure you into saving in the Excel format.\nSeveral choices:\nFile | Open\nData | Get External Data | New Database Query\no This is for more complicated imports, like from Access or Dbase files.\nData | Get External Data | Import Text File\n\nTab Delimited Data\n\nSelect \"Delimited\" as the Original Data Type. When finished, click \"Next.\"\n\nSelect \"Tab\" as the Delimiter. When finished, click \"Next.\"\n\nIf you need to change the data format of the columns, do that here. You highlight each column and select the appropriate\ncolumn data format.\nThen hit \"Finish.\"\n\nScreenshot of what the tab delimited data looks like in Excel.\n\nComma Delimited\n\nSelect \"Delimited\" as the Original Data Type. When finished, click \"Next.\"\n\nSelect \"Comma\" as the Delimiter. When finished, click \"Next.\"\n\nIf you need to change the data format of the columns, do that here. You highlight each column and select the appropriate\ncolumn data format.\nThen hit \"Finish.\"\n\nScreenshot of what the comma delimited data looks like in Excel. Notice that height of Anna Jones is in the wrong column.\nThis occurs because the data was missing a comma between the suffix column (Column C) and the height column (Column D).\n\nFixed-Width\n\nSelect \"Fixed width \" as the Original Data Type. When finished, click \"Next.\"\n\nNow we need to tell Excel how to split up the data into columns. In this case, we need to put a column break after the longest\nfield. So Samantha; Walken; Jr or Sr (since they are the same length); the double quotes (\"); and 0. This translates into a length\nof 7 for Column 1, 6 for Column 2, 2 for Column 3, 5 for Column 4, 3 for Column 5, and 2 for Column 6.\n\nCreate a column break by clicking on the appropriate place in the window. The break can be moved by clicking and dragging it\nto the desired location. Double-click on a line to delete it.\n\nIf you need to change the data format of the columns, do that here. You highlight each column and select the appropriate\ncolumn data format.\nThen hit \"Finish.\"\n\nScreenshot of what the fixed width data looks like in Excel. It matches the results of the tab delimited data.\n\nExcel file format (*.xls) v. dBase file format (*.dbf)\n-\ndbf File removes any text formatting\n\nExcel File -- note the bold row headings and the italicized data.\n\ndBase File -- Note the loss of text formatting (bold, italics) and ALL CAPS row headings.\n\nData Display\nSort\nYou can sort ascending or descending...\nA single column\nAll columns via a single sort\nAll columns via a hierarchy of sorting\n\nTips:\nBe sure to sort all columns - don't misalign your data!\nRemember to check off header row if you have one.\n\nFiltering\nData | Filter | AutoFilter\nFocuses in on a subset of data\nSelect a single value, or make your own.\nYou can filter more than one column at a time.\nBe careful! The row numbers do not reflect the number of items. Look at the bottom right to see the number of records found.\n\nSplit or Freeze Panes\nThis allows you to keep important rows or columns visible while you scroll.\n\nSplit panes...\n1. At the top of the vertical scroll bar or at the right end of the horizontal scroll bar, point to the split box...this is the small\nrectangle just above the up arrow.\n\n2. When the pointer changes to a split pointer, drag the split box down or to the left to the position you want.\n\nBoth a vertical and a horizontal split are shown below in gray.\n\nFreeze panes...\nThe top horizontal pane - Select the row below where you want the split to appear.\nThe left vertical pane - Select the column to the right of where you want the split to appear.\nBoth the upper and left panes - Click the cell below and to the right of where you want the split to appear.\nThen choose Window | Freeze Panes\nTo remove or reset, choose Window | Unfreeze Panes\n\nThe frozen pane below is A6:C6 and outlined in black.\n\nCell formatting\nYou can set number appearance, alignment, font, border type, and background colors.\nNumber settings include currency, percentages, dates, and decimal places.\nFormat | Cells\n\nCell content\nJust type in the value you want to display.\n\nTIP: Place an apostrophe in front of a number to make it behave like text.\n\nFormulas\nExcel allows you to execute basic arithmetic (sums, division, etc.), as well as standard financial and statistical operations (average,\nnet present value, internal rate of return, etc.).\n\nTo pull up the formula options, click the = sign next to the text entry window:\n\nThen use the drop-down box at the far left of that row to select the operation you wish to use. The default is probably whichever\nyou last used, and the most recent will show up in a list:\n\nTo select any formula, or make your own, choose \"More functions...\"\n\nOnce you select a formula, a box with entry fields and instructions will appear. Either type in the cell numbers to be used in the\nformula, or click on the selection button to manually choose them with the mouse. (I find the latter option to be easier.)\n\nA range of cells is denoted with the starting and ending cell location, separated by a colon. Ranges must be contiguous.\n\nCell reference\nTo show the content of another cell, type in a + sign before the target cell's coordinates. To show content from another worksheet,\nuse an exclamation point to separate the sheet name and cell label. For example:\n+A2\n+SheetName!B4\n\nIMPORTANT:\nKeep in mind this content display is a dynamic connection - when the original cell's content changes, the other cell's\ndisplay changes.\nReferences will not work across worksheets unless sheet name is explicit in the cell value.\n\nRelative reference: If you copy a cell whose value is based on a formula, and paste it into a new cell, then:\n1. The formula - not the displayed value - copies over, AND\n2. The formula will update to reflect the shift in location.\n\nFor example, if cell A6 has the value 'SUM(A3:A5)' and is copied into...\ncell B6, the formula will change to 'SUM(B3:B5)'\ncell A12, the formula will change to 'SUM(A9:A11)'\n\nAbsolute reference: If a dollar sign precedes the letter and/or number, such as $A$1, the column and/or row reference is absolute.\nThe formula will remain the same no matter where it is pasted.\nIf you wish to maintain only the row or column - but not both - then place a single $ in front of the appropriate value.\n\nTo copy the cell value, rather than the formula, use Edit | Paste Special, and select 'Values'\n\nFunctions You Should Know\n-\nTwo ways of inserting a function\no Hit \"=\" on the toolbar, then find a function; or\no Type \"=\", type a function name, type \"(\", choose an area, type \")\", then hit Enter.\n1. SUM: sum\n2. MAX: find the maximum value\n3. MIN: find the minimum value\n4. AVERAGE: calculate the average/mean\n5. MEDIAN: find the median\n6. STDEV: calculate the standard deviation\n7. VAR: calculate the variance\n8. CONCATENATE: concatenate text data (or use &)\n9. IF: yield values by testing a given equasion\n-\nCopy by dragging +.\n-\nFill Option -- Down, Right, Up, Left (Under Edit Menu).\n\nFormula Examples:\n\nCONCATENATE Examples\n\nIF Examples\n\nCharts\n-\nChoosing among chart types\n-\nChanging the data set/Copy-paste trick\n-\nFormatting\no Text\no Width\n-\nEmbedding in Microsoft Word\n-\nEmbedding in Web Pages\nInsert | Chart\nThere are many graphic options...\nChoose the entire data set with the selector - this may take several tries to get it to display as you want it.\nI often find it easier to 'tidy up' the chart to my liking after finishing with the Wizard.\n\nAfter creating a chart, when you select it with the mouse, the Chart menu appears at the top of the screen.\n\nStatistical options are available in the Add Trendline window\nLine equation\nR-squared\n\nRemember - charts are dynamic. If you like your results, maybe you should copy and paste it into another file.\n\nPrinting\nA. Set Page Properties\n-\nPage setup: May want to choose Landscape. If appropriate, change the paper size:\nLetter: 8 1⁄2 by 11 (this is the standard...similar to A4 size used abroad)\nLegal: 8 1⁄2 by 14\nTabloid: 11 by 17 (colormaps has this size)\nB. Set Printable Area\n-\nSet the Print Area to select which portion of your spreadsheet(s) to print\nFirst, select the area you want to print out, then...\nFile | Print Area | Set Print Area\n\nCreated by Shannon McKay, October 2004 with assistance from Chris Hodges and Masa Matsuura.\n\nJoe Smith Jr 5'8\" Blue 140 24\nAnna Jones 5' Brown 100 18\nClaude Walken Sr 6'2\" Green 240 50\nSamantha Jones 5'4\" Blue 120 32\n\nJoe,Smith,Jr,5'8\",Blue,140,24\nAnna,Jones,5',Brown,100,18\nClaude,Walken,Sr,6'2\",Green,240,50\nSamantha,Jones,,5'4\",Blue,120,32\n\nJoe Smith Jr5'8\"Blue 14024\nAnna Jones 5' Brown10018\nClaude WalkenSr6'2\"Green24050\nSamanthaJones 5'4\"Blue 12032"
    },
    {
      "category": "Resource",
      "title": "rec5.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-204-planning-communications-and-digital-media-fall-2004/386f0d9b8a1a5c5358428958916dbe7e_rec5.pdf",
      "content": "Massachusetts Institute of Technology\nDepartment of Urban Studies and Planning\n11.204: Planning, Communications & Digital Media\nFall 2004\nRecitation 5: Using ArcGIS to Visualize Population Density\nI. Introducing GIS\nz Geographic Features: Point, Line, and Polygon\nz Feature Attributes\nz GIS software vendors and products\nVENDORS\nESRI (Environmental Systems Research Institute, Inc.)\nIntergraph\nMapInfo Corporation\nMicrosoft\nII. ArcGIS 8 Interface and Elements\nz Launch ArcMAP 8 and open an Existing Project File\nz Data frame / Data layer /Attribute Table\nz Existence, Visibility, and Activeness\nz Overlay of Layers / Display sequence\nz Panning and Zooming; Information Tool\nz Help\n1. Launch ArcMap and examine the interface.\nPRODUCTS\nArcView; ArcInfo; ArcGIS; ArcIMS\nGeoMedia; GeoMedia Web Map\nMapInfo; MapXtreme\nMapPoint\n2. Open an ArcMap file \"Recitation5.mxd\" at The MIT Server\\Data\\Recitation5\\Recitation5.mxd.\n3. Examine the data frame \"Pittsburgh.\"\n4. Open and examine the attribute table for the layer \"Census Tracts.\"\n5. Exit ArcMap.\nIII. Creating a New Project\nz Launch ArcMAP and create a new document\nz Add Layers\nz Data Frame Property\n{ Map unit / Display unit\nz Data Layer Property\n1. Restart ArcMap and Create a new document.\n2. Add a data layer The MIT Server\\Data\\Recitation5\\Newton_townboundary.shp (Newton Boundary) into the data\nframe.\n3. Add three more data layers. The first is a Point Feature, the second is a Line Feature, and the third is a Polygon Feature.\nz The MIT Server\\Data\\Recitation5\\Stops.shp (Newton MBTA Stop)\nz The MIT Server\\Data\\Recitation5\\MBTALines.shp (Newton MBTA Line)\nz The MIT Server\\Data\\Recitation5\\Newton_censustracts.shp (Newton Census Tract)\n4. Turn all the layers on, make sure they are displayed in a sequence from top to bottom in this order: Stops, MBTALines,\nNewton_censustracts and Newton_townboundary. Make the Stops layer active. Consider the difference between Existence, Visibility\nand Activeness.\n5. Play with Pan/Zoom In/Out/Full Extent/Layer/Selected/Previous.\n6. Use the \"i\" tool (linking information to location) to find out and examine the area of a census tract where a MBTA stop is located.\n7. Now, we need to setup the properties for the data frame. Change the data frame properties as follows,\nz Name: Type in \"Newton Overview\"\n\nz Display Units: Choose \"Miles\"\n8. Next, set up the layer properties. Change the name for each layer according to their contents.\n9. Save the map document to \"H:\\private\\11.204\\Recitation5\\janedoe.mxd.\" Replace \"janedoe\" with your username.\n10. Great, we have built our first ArcGIS map document file! However, it needs improvement.\nIV. Symbolization & Classification\nz Symbolization:\n{ Points: Style, Size, Color\n{ Lines: Style, Width, Color\n{ Polygons: Fill Pattern, Fill Color, Outline Width, Outline Color\nz Classification\n{ Classification Type: Quantile, Equal Interval, and Natural Breaks\n{ Classification Field\n{ Normalization\n{ Unique Value, Graduated Colors, Graduated Symbols, and Proportional Symbols\n1. Open the map document file \"H:\\private\\11.204\\Recitation5\\janedoe.mxd\" if you closed it. We want to refine the symbols for this map\ndocument.\n2. Make the layer \"Newton MBTA Stop\" active and change the symbol for MBTA stops to the \"Train Station\" symbol with a size of 22\n(Symbol Selector->More Symbols->Transportation).\n3. Change the symbol for \"Newton Boundary \" layer as follows.\nz Fill pattern: Hollow\nz Outline width: 3\nz Outline Color: Black\n4. Change the symbol for \"Newton MBTA Line\" layer by using the LINE field in determining the symbology.\nz Legend Type: Categories -> Unique Values\nz Style: Railroad line\nz Size: 2\nz Color: According to the line name (i.e. Green for G line, Purple for P Line)\n5. Change \"Newton Census Tract\" layer to show the population density for each tract.\nz Legend Type: Quantities -> Graduated Color\nz Value: POPUDENSE (population density: total population per dry acre)\nz Classification Type: Quantile\nz Number of classes: 5\nz Color Ramps:\n6. The map looks better. Save your map document.\nV. Layout, Print and Export\nz Data View vs. Layout View\nz Layout Template\nz Add Title, Author's Name, Date Source\nz Map Elements (North Arrow, Legend, Scale, and Title)\nz Map Export\n1. Change to Layout view (View->Layout View).\n2. Give the map a meaningful title\n3. Add the author's name and the date\n4. Add the data source as\nData Sources: US Bureau of the Census, 2000; MBTA\n5. Add north arrow, legend, and scale\n6. Arrange map elements (north arrow, legend, scale, and title) on the page, creating a logical presentation.\n7. Export the final map into \"H:\\private\\11.204\\Recitation5\\janedoe_recitation5.jpg\", replace \"janedoe\" with your username. Save the map\ndocument file.\nLab 4 is due Recitation 6.\nCreated October 2003 by Jinhua Zhao. Edited October 2004 by Shannon McKay."
    },
    {
      "category": "Resource",
      "title": "rec5slides.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-204-planning-communications-and-digital-media-fall-2004/22bd217a6c578891759f92f57ff6fe20_rec5slides.pdf",
      "content": "Recitation 5: Using ArcGIS to\nVisualize Population Density\n\nWhat is a GIS?\n- GIS (Geographic Information System) is a\nSystem of computer software, hardware,\nmethods and data, along with personnel who\nhelps to manipulate, analyze and present\ninformation that is tied to a spatial location:\n- Spatial information\nusually a geographic location\n- Information\nvisualization of analysis of data\n- System\nlinking software, hardware, data\n- Personnel\na thinking explorer who is key to\nthe power of GIS\nCopyright 2001 - Kristen S. Kurland, Carnegie Mellon University\n\nTransition from ArcView to\nArcGIS 8\nArcMap\nArcMap\nArcToolbox\nArcToolbox\nArcCatalog\nArcCatalog\nArcSDE\nArcSDE\nArcIMS\nArcIMS\n\nArcGIS 8\nArcMap: feature display and editing,\nmapmaking, and analysis\nArcCatalog: exploring and managing the\ndata\nArcToolbox: performing operations such as\ndata conversion and Geoprocessing tasks\n\nArcMAP\nVisualize,\ncreate, edit,\nquery,\nanalyze, and\npresent the\ndata\nTable of\ncontents\nMap display\narea\n\nArcCatalog\nFind,\nexplore, and\nmanage the\ndata\nSimilar to\nwindows\nexplorer\nCatalog tree\nPreview\nMetadata\n\nArcToolbox\nData conversion\ntools\nData management\ntools\nGeoprocessing tools\n\nRaster Images\n- Raster Images - grids\n- \"pixels\"\n- A location and value\n- Satellite images and aerial photos\n\nVector Images\n- Vector - grids\n- Points, lines & polygons\n- \"features\" (house, lake, etc.)\n- Attributes\n- Size, type, length, etc.\n\nVector GIS\n- Point\n- Line\n- Polygon\n\nGraphic Elements\n- Use Solid Point Markers\n- Use Representative Point Markers\n- Use Three to Seven Categories Max\n- Route Directions\n- Graduated Symbols\n- Think about:\n- Shape\n- Orientation\n- Texture\n- Size\n- Value\n- More Value\n- Hue\n- Saturation\n\nSymbology\nA variety of fill patterns, colors, shapes & styles\nA variety of fill patterns, colors, shapes & styles\n\nQualitative Symbology\nUnique Value\nUnique Value with multiple\nfield\n\nDisplay Multiple Attributes\nA water distribution\nsystem\nMaterial (line color)\nDiameter (line width)\n\nQuantitative Symbology\nGraduated Color\nGraduated Symbol\n\nQuantitative Symbology\nSymbol size\nproportional to the\npopulation.\nArea/Radius\n\nColor Wheel\n- Analogous/Adjacent\nSchemes use\nconsecutive hues and\ntheir tints from the color\nwheel (colors from three\nadjacent rows in the\ntable)\n- Clash Schemes\ncombines a color with a\nhue to the right or left and\nnot necessarily adjacent\nof its complement on the\ncolor wheel.\nhttp://www.hypermedic.com/colors/colortable.htm\n\nColor Wheel\n- Complementary\nSchemes use direct\nopposites on the color\nwheel.\nhttp://www.hypermedic.com/colors/colortable.htm\n\nGraphical Hierarchy\n- Goal\n- Direct attention toward\nor away from available\ninformation\n- Figure-Ground\n- Visual separation of a\nscene into\nrecognizable figures\nand inconspicuous\nbackground (ground)\n\nClassifications\n- Process of placing data into groups that\nhave a similar characteristic or value\n- Equal Area\n- Equal Interval\n- Natural Breaks\n- Quantile\n\nClassifications\n- Natural Breaks\n\nClassifications\n- Quantile\n\nNormalizing Data\n- By percent of total\n- Normalize values by dividing each value by the total\nof all values (percent of total)\n- By the value of another attribute\n- Map population density by dividing population counts\nby area\n- When not to normalize\n- In some cases, data is already normalized\n- Percentage (divorce rate of 0.34)\n- Density (number of people per square mile of 320)\n\nNormalized Data - Population/Area\n\nMap Audience\nExploration\nPresentation\nTrained Analyst\nGeneral Public\nVisual Thinking\nCommunication\nGraphical\nBelievable\nFine\nCoarse\nAbstract\nMimetic\n- Map Use:\n- Audience:\n- Purpose:\n- Advantages:\n- Granularity:\n- Symbols\n\nScale 2:\n- Dimensionless ratio of map to ground distances\n- Maps range from 1:5,000 to 1:50,000,000\n- 1:5,000 is large scale, 1:50,000,000 is small scale\n- Verbal scale (dimensioned)\n- \"1 inch represents 2,000 feet\" is the same as\n1:24,000\n- \"1 foot represents 10,000 miles\" is the same as\n1:52,800,000\n\nMap Design: Marginal Information\n- Concise Title\n- Topic, time, place\n- Ex: 1990 AIDS Incidence in Massachusetts\n- Scale\n- Inappropriate for small-scale maps\n- Not needed for familiar large-scale maps\n- Direction Indicator\n- North arrow - only for unusual orientations on large-\nscale maps\n- Use geographic grid on small-scale maps\n\nArcGIS Comments\n- Decide on Descriptive, Understandable\nNames for\n- Map Document\n- Data Frame\n- Layers\n- Layouts"
    },
    {
      "category": "Resource",
      "title": "rec6.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-204-planning-communications-and-digital-media-fall-2004/b98179d6f2c4db23108ea932aa593b17_rec6.pdf",
      "content": "Massachusetts Institute of Technology\nDepartment of Urban Studies and Planning\n11.204: Planning, Communication, and Digital Media\nFall 2004\nRecitation 6: Using Access to Query Multiple Data Sets\n1. What is database?\nz Remember stack cards in libraries?\nz Management of students, or employees...\nz Gift registry for wedding\nz My literature database\nVarious definitions of a database (http://www.google.com/search?hl=en&lr=&oi=defmore&q=define:database):\nz an organized body of related information\nz A collection of data: part numbers, product codes, customer information, etc. It usually refers to data organized and stored on a computer that can be searched and\nretrieved by a computer program.\nz A collection of information organized and presented to serve a specific purpose. (A telephone book is a common database.) A computerized database is an\nupdated, organized file of machine readable information that is rapidly searched and retrieved by computer.\nz A collection of related information about a subject organized in a useful manner that provides a base or foundation for procedures such as retrieving information,\ndrawing conclusions, and making decisions.\nz A shared collection of logically related data, designed to meet the information needs of multiple users in an organization. The term database is often erroneously\nreferred to as a synonym for a \"database management system (DBMS)\". They are not equivalent. A database is a store of data that describe entities and the\nrelationships between the entities. A database management system is the software mechanism for managing that data.\nz A collection of related types of data in a single file or set of files for sorting, analysing, and reporting.\n2. What are the advantages of computer-based database?\nImagine what you did (or would have done) in the libraries before computer-based systems (like OPAC) were introduced.\nz Less work (searching for data/matching two different sets of data)\nz Cross-referencing\nz Accessibility/Portability\n3. Why do we need Access?\nz In lab 4, from where is the population density field? (Look in ArcMap)\n{ Area--ESRI shape file\n{ Population--Census 2000\nz How do we use Census 2000?\n{ Free from the Census Bureau: Method 1 or Method 2\n{ Private vendors (like Geolytics) sell Census CDs, but they are expensive.\n3.1 What's the difference between MS Excel and MS Access?\nz Excel--non-structured or free structured; flat file\nz Access--strictly structured based on a general standard\n\n4. Input -- System (Core Function) -- Output --User Control\nCore Function of Access\nz Data collection, manipulation, integration--generate new datasets with more information or more specific information\nUser Control Interface\nz MS Access Interface and Elements\nData come from different resources in different formats.\nz Excel, Text, Lotus, dBase, Oracle, StarOffice...\nz Population (Census Bureau), Crime Record (Police Department), Zoning and Parcels (BRA), Traffic Flow (Transportation Statistics\nBureau), Fire Loss (Fire Department), Tax Data (Internal Revenue Service)\nData can be used for different purpose and further analysis.\nz Regression or Cluster analysis (SPSS), Make graphs and charts (Excel), Create Maps (ArcView, ArcGIS), Web Publish (HTML)...\n5. MS Access Operation\n5.1. Framework of MS-Access database\nz Table: database part. operates like Excel.\n{ Design View: Definition of columns\nPrimary Key: ID# for each record (e.g. call number at the library)\n{ Datasheet View: Real data\n{ Composed of records (rows), columns (fields), and cells.\nz Query: tool (1) to select specific data under criteria, and (2) to integrate multiple database.\nz Form: tool/interface to view the contents of the database\nz Report: tool to print out the contents of the database\n5.2 Creating Our Own Database by Importing Data (Input)\nSeveral ways to create a database--importing and designing the structure, then inputting data\nCreate a new empty database. Save the database.\nImport Tables\nz Which worksheet to use\nz First row contains column headings\nz Store the data in a new table or an existing table\nz Field Name, Type, Index or not, Setup a primary key\n{ Type:\n1. Text\nUse for text or combinations of text and numbers, such as addresses, or for numbers that do not require calculations,\nsuch as phone numbers, part numbers, or postal codes. Stores up to 255 characters. The FieldSize property controls\nthe maximum number of characters that can be entered.\n2. Memo\nUse for lengthy text and numbers, such as notes or descriptions. Stores up to 65,536 characters.\n3. Number\nUse for data to be included in mathematical calculations, except calculations involving money (use Currency type).\nStores 1, 2, 4, or 8 bytes; stores 16 bytes for Replication ID (GUID). The FieldSize property defines the specific\nNumber type.\n4. Date/Time\nUse for dates and times. Stores 8 bytes.\n5. Currency\nUse for currency values and to prevent rounding off during calculations. Stores 8 bytes.\n\n6. AutoNumber\nUse for unique sequential (incrementing by 1) or random numbers that are automatically inserted when a record is\nadded. Stores 4 bytes; stores 16 bytes for Replication ID (GUID).\n7. Yes/No\nUse for data that can be only one of two possible values, such as Yes/No, True/False, On/Off. Null values are not\nallowed. Stores 1 bit.\n8. OLE (Object Linking and Embedding) Object\nUse for OLE objects (such as Microsoft Word documents, Microsoft Excel spreadsheets, pictures, sounds, or other\nbinary data) that were created in other programs using the OLE protocol.\nStores up to 1 gigabyte (limited by disk space).\n9. Hyperlink\nUse for hyperlinks. A hyperlink can be a UNC path or a URL. Stores up to 64,000 characters.\n{ Index\nAn index helps Microsoft Access find and sort records faster. Access uses indexes in a table as you use an index in a\nbook: to find data, it looks up the location of the data in the index. You can create indexes based on a single field or\non multiple fields. Multiple-field indexes enable you to distinguish between records in which the first field may have\nthe same value.\nYou should consider indexing a field if all the following apply:\nThe field's data type is Text, Number, Currency, or Date/Time.\nYou anticipate searching for values stored in the field.\nYou anticipate sorting values in the field.\nYou anticipate storing many different values in the field. If many of the values in the field are the same, the\nindex may not significantly speed up queries.\n{ Primary Key\nEach table should include a field or set of fields that uniquely identifies each record stored in the table. This\ninformation is called the primary key of the table.\nz Name the table\nTables will vary in size based on the number of records that you are importing.\n5.3 Working with Tables\nModifying tables\nz Changing a Cell Value\nz Adding/Deleting Records\nSorting tables\nz Simple\nFiltering tables\nz Simple\nz Advanced Filtering with a logical operator\n5.4 Select Queries\nSimple query based on one table\nz Construct a select query that tells you how many census tracts in the Commonwealth of Massachusetts have more Black people than\nWhite people.\nQuery based on table join\nz Construct a select query that tells you how many census tracts in the City of Cambridge have more Black people than White people.\nQuery based on table join, sort, calculation by using query, expression\n\nz Build a select query to calculate the population density (number of people per square mile) for each of tract in the City of Cambridge.\nSort the records in ascending order. Which tract has the greatest density?\n5.5 Export Query Result (Output)\nExcel, dBASE, text, html, Lotus, Word\n6. Introduction to Relational Database\n6.1 Something behind the queries--SQL (structured query language)\nThree-tier model: Client--Web Server--Data Server e.g. Online Application, Online Shopping, Plaza, WebSIS\nSQL vs. HTML\nSQL vs. Java, C++ Procedural vs. Non-procedural\n6.2 One to one, one-many, many-many Relationship\nz A one-to-many relationship\nA one-to-many relationship is the most common type of relationship. In a one-to-many relationship, a record in Table A can have\nmany matching records in Table B, but a record in Table B has only one matching record in Table A.\nEx: One supplier ... can supply more than one product ... but each product has only one supplier.\nz A many-to-many relationship\nIn a many-to-many relationship, a record in Table A can have many matching records in Table B, and a record in Table B can\nhave many matching records in Table A. This type of relationship is only possible by defining a third table (called a junction\ntable) whose primary key consists of two fields -- the foreign keys from both Tables A and B. A many-to-many relationship is\nreally two one-to-many relationships with a third table. For example, the Orders table and the Products table have a many-to-\nmany relationship that's defined by creating two one-to-many relationships to the Order Details table. One order can have many\nproducts, and each product can appear on many orders.\nEx: One order can have many products ... and each product can appear on many orders.\nz A one-to-one relationship\nIn a one-to-one relationship, each record in Table A can have only one matching record in Table B, and each record in Table B\ncan have only one matching record in Table A. This type of relationship is not common, because most information related in this\nway would be in one table. You might use a one-to-one relationship to divide a table with many fields, to isolate part of a table\nfor security reasons, or to store information that applies only to a subset of the main table. For example, you might want to create\na table to track employees participating in a fundraising soccer game. Each soccer player in the Soccer Players table has one\nmatching record in the Employees table.\nEx: Each soccer player has one matching record in the Employees table.\nz About defining relationships\nThe kind of relationship that Microsoft Access creates depends on how the related fields are defined:\nz A one-to-many relationship is created if only one of the related fields is a primary key or has a unique index.\nz A one-to-one relationship is created if both of the related fields are primary keys or have unique indexes.\nz A many-to-many relationship is really two one-to-many relationships with a third table whose primary key consists of two\nfields -- the foreign keys from the two other tables.\n\n7. Database Vendors and Products\nVENDORS\nPRODUCTS\nORACLE\nORACLE\nGiant, Mainstream\nDB2\nMicrosoft\nSQL Server\nPowerful\nOpen Source, Free,\nPlaza\nFilemaker\nFilemaker Pro User friendly\nCOMMENTS\nIBM\nMySQL AB\nMySQL\nCreated October 2002 by Jinhua Zhao. Updated October 2003 by Jinhua Zhao. Updated October 2004 by Shannon McKay."
    },
    {
      "category": "Resource",
      "title": "rec7.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-204-planning-communications-and-digital-media-fall-2004/6ede03dc0f604ce50ee1da5a9c8808df_rec7.pdf",
      "content": "Today's theme: Join (Import data file into ArcMap)\nWhy do you need to import\nexternal data file into GIS\nsoftware?\n- Map files have only geographic\ninformation, not other meaningful\ninformation, such as income, population,\nhousehold size... etc.\n- In order to create thematic maps and\nanalyze them, you need to import those\ndata into GIS.\n\nEach geographic feature have an unique identifier.\nMuninci-\npalities\nName\nMuninci-\npalities\nName\nSubway\nname/\ncolor\nSubway\nname/\ncolor\nRoute\nnumber\nRoute\nnumber\nID# for\neach\nmuni.\nID# for\neach\nmuni.\n\nYou can import an external data/file into GIS using an unique\nidentifier as a key for association.\nMuninci-\npalities\nName\nMuninci-\npalities\nName\nRoute\nnumber\nRoute\nnumber\nNAME\nMEDINCM\nMedford 62409\nMalden\nEverett\n...\n...\n1999medincome.dbf\nRtNo\nTraffic\n52,135\n2A\n35,118\n125,721\n...\n...\ntrnsp.dbf\nFIPS\nPopu\n42,389\n24,194\n101,355\n...\n...\npopu2.dbf\nID# for\neach\nmuni.\nID# for\neach\nmuni.\n\nFinding an unique matching identifier...\nOn ArcMap (GIS): See \"Attribute Table\"\nOn the raw data side...\nuse Excel or Access\nBe sure to remember the field names.\nThey can be different for GIS and the data\nIn this case, join by:\nTOWN (ArcMap)\nand NAME (.dbf)\n\nIn this case, join by:\nTOWN (ArcMap)\nand NAME (.dbf)\nHow to import...: JOIN\nDifferent field names can be used\nin different files, even if they\ncontain a same set of identifiers!\n\nAfter you join (import) the data, you can create thematic maps\nbased on the external data.\nData\nmissing\nin the\ndbf file\n1999 Median Household Income"
    }
  ]
}