{
  "course_name": "Planning for Sustainable Development",
  "course_description": "This course explores policy and planning for sustainable development. It critically examines concept of sustainability as a process of social, organizational, and political development drawing on cases from the U.S. and Europe. It also explores pathways to sustainability through debates on ecological modernization; sustainable technology development, international and intergenerational fairness, and democratic governance.",
  "topics": [
    "Engineering",
    "Environmental Engineering",
    "Environmental Management",
    "Science",
    "Earth Science",
    "Sustainability",
    "Social Science",
    "Urban Studies",
    "Urban Planning",
    "Engineering",
    "Environmental Engineering",
    "Environmental Management",
    "Science",
    "Earth Science",
    "Sustainability",
    "Social Science",
    "Urban Studies",
    "Urban Planning"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 3 hours / session\n\nOverview\n\nThis class starts from three assumptions. The first is that that any effort to really do something about sustainable development will involve change on a broad scale. Think of the transition to a hydrogen economy or, more topically, a substantial effort to address climate change. Either will involve a broad array of changes in technology and behavior that are initiated and develop in local contexts and that have the potential to affect the broader trajectory and pace of change. This makes the management of change, transitions, and development a central problem in sustainable development.\n\nOur second working assumption is that the way to learn about how to foster change and development is to try to do it. To this end we will work in the class with the Environmental Programs Office and MIT and the Community Planning Department of the City of Cambridge on steps to enhance sustainability that further the City's climate change protection plan. Climate change is not only a central concern in sustainable development, but is precisely the sort of broad problem that makes the efforts to foster innovation and \"manage\" change important and vexing. The Environmental Programs Office and the Community Planning Department will be our client and partner in this effort. The other members of the community include faculty, students and staff at MIT who have been working with the City on these concerns and others who are involved in related efforts.\n\nOur third assumption is that a successful effort to address climate change, and sustainable development more broadly, is unlikely to stem from an exclusive reliance on conventional forms of state regulation. The limits on the resources and competence of the state are circumscribed and the authority to regulate is limited. Public officials and others who want to address these problems must find another way to act, that may draw on limited regulatory authority, but also finds ways to engage the resources and initiative of a variety of organizations and individuals. The outcome of this commitment, which is in keeping with current trends in regulatory practice, is to look for a level of organization that differs from control in an organizational hierarchy and coordination in a market. We will develop an approach that is rooted in organizations and that brings actors into interaction across organizational boundaries.\n\nEtienne Wenger's image of a community of practice gives a sense of what we mean.\n\n\"Communities of practice are groups of people who share a concern, a set of problems, or a passion about a topic and who deepen their knowledge and expertise in this area by interacting on an ongoing basis. Engineers who design a certain kind of electronic circuit called phase-lock loops find it useful to compare designs regularly and to discuss the intricacies of their esoteric specialty. Soccer moms and dads take advantage of game times to share insights about the subtle art of parenting. Artists congregate in cafes and studios to debate the merits of a new style or technique. Gang members learn to survive on the street and deal with an unfriendly world. Frontline managers running manufacturing operations get a chance to commiserate, to learn about upcoming technologies, and to foresee shifts in power.\n\nThese people don't necessarily work together every day, but they meet because they find value in their interactions. As they spend time together, they typically share information, insight, and advice. They help each other solve problems. They discuss their situations, their aspirations, and their needs. They ponder common issues, explore ideas, and act as sounding boards. They may create tools, generic designs, manuals, and other documents - or they may simply develop a tacit understanding that they share. However they accumulate knowledge they eventually become informally bound by the value they find in learning together . . . Over time they develop a unique perspective on their topic, as well as a body of common knowledge, practices, and approaches. They also develop personal relationships and established ways of interacting. They may even develop a common sense of identity. They become a community of practice.\"\n\n(Wenger, E., R. McDermott, and R. M. Snyder.\nCultivating Communities of Practice.\nCambridge, MA: Harvard Business School Press, 2002, pp. 4-5.)\n\nThe class will help you understand and reason about how to engage the potential for change that exists in these kinds of relationships within and among organizations.\n\nOrganization\n\nThe class is organized in two parts. Part I provides a general introduction to the issues and challenges associated with sustainable development. We focus here primarily on sustainable development at the local level. Part II is a project oriented workshop that focuses on the demands of taking action on sustainable development and on the designs that different groups use to try to promote change in organizational settings. In Part II we will interact with groups in the Boston area that are working to further goals of sustainable development. We will also work on our own projects in cooperation with the Environmental Programs office and the Department of Community Planning. These projects will provide a focal point that will help us organize our analysis and test our understanding by expressing it in designs for change in organizational settings. The class sessions are intended to be supplemented by interaction outside of class, in groups, with faculty, and with others in the community, especially our partners in the Environmental Programs Office and the Community Planning Department. The readings are organized in two categories. The background readings for individual class sessions are organized alphabetically in a section called class\nreadings\n. There is a second group of readings called\nrelated resources\nthat provide general background information on our topic.",
  "files": [
    {
      "category": "Resource",
      "title": "Cambridge Climate Action Plan",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-366j-planning-for-sustainable-development-spring-2006/dadc53d78cc34caa9d73e25ff2e6990a_final2004.pdf",
      "content": "- 1 -\nCambridge Climate Action Plan\nSuggestion about the implementation within MIT\n1.\nIntroduction ............................................................................................................................................... 2\n2.\nMethodology .............................................................................................................................................. 2\n3.\nAnalysis & Preliminary Results ............................................................................................................... 3\n3.1.\nDecision-Making Process................................................................................................................ 3\n3.2.\nProblems mentioned by actors....................................................................................................... 6\n3.3.\nSynthesis ............................................................................................................................................ 8\n4.\nRecommendations..................................................................................................................................... 9\n4.1.\nConcept.............................................................................................................................................. 9\n4.2.\nMake Polluters Pay: (Accountability?)......................................................................................... 10\n4.2.1.\nWhy ......................................................................................................................................... 10\n4.2.2.\nMetering.................................................................................................................................. 11\n4.2.3.\nIncentives/Rewards for people doing well ....................................................................... 11\n4.3.\nUtilize Competition........................................................................................................................ 12\n4.3.1.\nWhy ......................................................................................................................................... 12\n4.3.2.\nBenchmarking........................................................................................................................ 12\n4.3.3.\nHarvard/MIT competition .................................................................................................. 13\n4.3.4.\nAwards .................................................................................................................................... 14\n4.4.\nCreate Commitment ...................................................................................................................... 15\n4.4.1.\nWhy ......................................................................................................................................... 15\n4.4.2.\nMass Movement .................................................................................................................... 15\n4.4.3.\nBottom-up - top-down approach ...................................................................................... 16\n4.4.4.\nIncrease Awareness (\"educating\") ...................................................................................... 16\n4.5.\nMarket green ................................................................................................................................... 17\n4.5.1.\nWhy ......................................................................................................................................... 17\n4.5.2.\nGreen Benefits MIT .............................................................................................................18\n4.5.3.\nMIT's the Greenest............................................................................................................... 19\n5.\nImplementation ....................................................................................................................................... 19\n6.\nConclusion ............................................................................................................................................... 21\nThe Cambridge Climate Action Plan - Implementation at MIT\nAlex, Daniel, Elaine, Mithila\n\n- 2 -\n1.\nIntroduction\nThis report focuses on the implementation of the Climate Protection Plan (CPP) in the\nCity of Cambridge in collaboration with MIT. The CPP envisages a reduction in green\nhouse gases of 20% by 2010, by collaborating with institutions, businesses and\ncommunity. This report highlights the relationship between MIT and Cambridge and\nhow MIT has had to/will adapt to new environmental changes through planning/policy\ninitiatives.\nWe studied the buildings (old and new) by analyzing how they are being adapted to\nenvironmental issues and concerns. The decision to study \"green\" buildings (i.e. those\nbuildings that are constructed in an environmentally friendly manner by incorporating\ngreen features and technology) stems from two factors: a) the bulk of green house\nemissions came from built environment, and b) as the (MIT - Cambridge) relationship\nwith regard to buildings was less defined (as compared to transportation) we thought it\nnecessitated more attention.\nOur investigation was conducted in two stages: The initial phase was fact finding in\norder to have a better grasp of the problems associated with the different goals of MIT\nand existing policies (and their implementation) relating to making of \"green\" buildings.\nThe second phase involved more analysis and discussion, sitting with our immediate\ngroup, and the larger 11.336 team. The main effort in this phase was to develop and\nrecommend a framework of \"actionability\", given the problems we discovered during\nthe first phase.\nIn our study we found that the challenges posed by environmental problems cannot be\ncompartmentalized and solved in isolation. At MIT; research, education, legal\ncompliance, recycling and other sustainability initiatives are all interrelated.\n2.\nMethodology\nAt the beginning of the first phase we realized that we had a very limited knowledge of\nthe internal structure of MIT and how environmental policies, specifically those targeting\naspects of the CPP, are formed and implemented. As such, we decided that the best\napproach would be to learn as much as possible about institutional operations at MIT\nbefore focusing on specific environmental problems. Unsure of where to begin, we\napproached Mr. Dan Winograd, Deputy Director of the Senior Counsel's Office. He was\nable to give us an insightful overview of both the general structure of MIT and, more\nspecifically, how this structure relates to environmental policy within this institution.\nIn our discussion with Mr. Winograd we learnt that environmental policy does not\nfollow a single, neat path through the MIT hierarchy. In fact, many of the environmental\ninitiatives within MIT are not done through this structure at all, but are implemented by\ninformal networks formed by conscientious members of the institution. Concerned that\nwe would be unable to craft a thorough analysis of MIT as a whole, we decided to tailor\nour study to one aspect of the plan.\nThe Cambridge Climate Action Plan - Implementation at MIT\nAlex, Daniel, Elaine, Mithila\n\n- 3 -\nFollowing our meeting with Mr. Winograd, we selected building usage and\ntransportation as the two areas of greatest concern. Between the two possibilities of\ntransportation or building usage, we discovered that a large percentage of emissions\nproduced in the City of Cambridge originate from buildings, so we decided to focus on\nthis aspect.\nWe formulated the question: \"Are buildings on MIT's campus green, and if not, why?\",\nand began interviewing panoply of actors concerned with building planning and\nmaintenance on MIT's campus. These interviews helped us piece together the basic\nstructure of MIT as it relates to building planning and usage (Figure 1), as well as to\nbegin to understand the answer to our question. Phase two consisted of using the\ninformation we gained through our interviews to develop a framework of \"actionability.\"\nThis phase is discussed further in section 3.\nLS\nCITY OF CAMBRIDGE\nSENIOR OFFICERS\nDONORS\nFACILITIES\nACADEMY\nGOVT & COM REL\nE. P. O.\nSTUDENTS\nDLC\nSUPPORT STAFF\nGEN ADMIN.\nARCHITECTS\nGENERAL CONTRACTORS\nMAINT. STAFF\nEPTF\nEGTF\nE. H. S.\nELECTED OFFICI\nCOMMUNITY DEVEL.\nADMINISTRATION\nPLANNING BOARD\nENVIRO.\nCOUN.\nFigure 1\nDiagram of MIT hierarchy. Blocks highlighted in red indicate that we spoke to at\nleast one actor from that group. A full list of names and departments of people we\nspoke to is included in Appendix A.\n3.\nAnalysis & Preliminary Results\n3.1.\nDecision-Making Process\nAfter discussions with the many actors we attained a general understanding of the\nbuilding planning process (Figure 2). In addition, the involvement of the various actors\nin each phase is also shown on this Figure.\nThe Cambridge Climate Action Plan - Implementation at MIT\nAlex, Daniel, Elaine, Mithila\n\n- 4 -\nSET\nPROGRAM\nO & M\nDLC\nDONORS\nSUPPORT STAFF\nSTUDENTS\nDLC\nDLC\nNEED\nCRIT.\nFUNDS\nCONSTRUCTION\nDESIGN\nAPPROVAL\nDESIGN\nBUILDINGS\nCITY OF CAMBRIDGE\nGENERAL CONTRACTORS\nARCHITECTS\nFACILITIES\nEXEC.ADM.\nOFFICE OF GOV AND COM.\nRELATIONS\nFACILITIES\nGENERAL CONTRACTORS\nARCHITECTS\nFACILITIES\nFigure 2\nThe Actors Involved in the Steps of the Decision and Execution Process for New\nBuildings\nThe Cambridge Climate Action Plan - Implementation at MIT\nAlex, Daniel, Elaine, Mithila\n\n- 5 -\nBuilding on the above, we decided to investigate in greater details the involvement of the\nvarious actors in each stage of the process. To do this, we established a distinction\nbetween three major phases of the planning progress:\n-\nPolicy making\nThe policy-making phase is the period during which MIT's general policies are\nformed. In our case, a typical example could be the recent commitment to\nconstruct only LEED-Silver certificated buildings on MIT's campus.\n-\nPlanning\nThe planning phase is the phase during which a specific group of prospective\nusers (Department, Laboratories and Centers) expresses a need for a new\nbuilding, and defines the scope of the project.\n-\nDesign and Construction\nFinally, the design then is an implementation of the planning decisions, and\nconstruction is the architectural execution of planning/policy and design\nphases.\nAnother interesting result of our analysis was that there is a large disconnect between the\nactors involved in each of these phases, as shown in Figure 3. This figure illustrates the\nmain communication channels between the actors of each phase. Most actors are not\ninvolved in more than one phase; their contact with each other is incredibly limited. The\ncurrent system is not conducive to constant collaboration and effective coordination.\nPolicy-Making Phase\nEGTF\nLS\nCITY OF CAMBRIDGE\nSENIOR OFFICERS\nDONORS\nFACILITIES\nACADEMY\nGOVT & COM REL\nE. P. O.\nSTUDENTS\nDLC\nSUPPORT STAFF\nGEN ADMIN.\nARCHITECTS\nGENERAL CONTRACTORS\nMAINT. STAFF\nEPTF\nE. H. S.\nELECTED OFFICI\nCOMMUNITY DEVEL.\nADMINISTRATION\nPLANNING BOARD\nENVIRO.\nCOUN.\nPlanning Phase\nThe Cambridge Climate Action Plan - Implementation at MIT\nAlex, Daniel, Elaine, Mithila\n\n- 6 -\nEGTF\nLS\nCITY OF CAMBRIDGE\nSENIOR OFFICERS\nDONORS\nFACILITIES\nACADEMY\nGOVT & COM REL\nE. P. O.\nSTUDENTS\nDLC\nSUPPORT STAFF\nGEN ADMIN.\nARCHITECTS\nGENERAL CONTRACTORS\nMAINT. STAFF\nEPTF\nE. H. S.\nELECTED OFFICI\nCOMMUNITY DEVEL.\nADMINISTRATION\nPLANNING BOARD\nENVIRO.\nCOUN.\nDesign and Construction Phase\nSTUDENTS\nEGTF\nLS\nCITY OF CAMBRIDGE\nSENIOR OFFICERS\nDONORS\nFACILITIES\nACADEMY\nGOVT & COM REL\nE. P. O.\nDLC\nSUPPORT STAFF\nGEN ADMIN.\nARCHITECTS\nGENERAL CONTRACTORS\nMAINT. STAFF\nEPTF\nE. H. S.\nELECTED OFFICI\nCOMMUNITY DEVEL.\nADMINISTRATION\nPLANNING BOARD\nENVIRO.\nCOUN.\nFigure 3\nCommunication channels in the various phases of planning new buildings\n3.2.\nProblems Identified By Various Actors\nDuring our discussions with the different actors, we asked them for their opinion on\nwhy MIT was not making greater strides towards its pledge to have greener buildings.\nThe main problems that were mentioned by the various actors were:\n-\nLack of political will - no incentive system\nOne of the main problems was the absence of a real commitment from the\nsenior administration. Due to this lack of commitment, there is no incentive for\npeople to promote green technology in the construction and renovation of\nbuildings; especially since green technology is widely perceived as being more\nexpensive.\nThe Cambridge Climate Action Plan - Implementation at MIT\nAlex, Daniel, Elaine, Mithila\n\n- 7 -\n-\nLack of money\nWhen resources are limited, priorities become streamlined and since there is no\nformal commitment from the senior office with regards to green buildings, it is\nvery easy for the greening of buildings to get pushed down the agenda.\nDecentralization - Lack of coordination\nMIT's consensual decision-making process makes it difficult to make and\nexecute institutional changes. .\n-\nLow priority vs. research\nA few actors suggested that it was a question of priority rather than \"lack of\nmoney\". For example, many actors were highly critical of the Stata Center,\nbecause the greatest priority was given to aesthetics.\n-\nAsymmetric information\nSome actors also mentioned the problem of a lack of information. For\nexample, the fact that green buildings (at least at silver-LEED certification\nlevel) do not necessary have to be more expensive, was not known to most\npeople.\n-\nNo grassroots support for greener buildings\nFinally several actors mentioned that there was no base support for green\nbuildings, making it very difficult to convince the senior officers to make a\ncommitment.\nInterestingly, there was no general agreement on the sources of the problems among the\ndifferent actors. Table 1 summarizes the perceptions of each general category of actors\nfor each problem.\nActors category\nLack of\npolitical will\nLack of\nmoney\nDecentralization\n-coordination\nLow priority\nvs. research\nAsymmetric\ninformation\nCity of\nCambridge\nAcademia\nGeneral\nAdministration\nFacilities\nTable 1\nThe reason why MIT's buildings are not as green as they should be: Identification\nof problems by the different actors\nAs you can see from this table, people have very different views on the reasons that\nbuildings on MIT's campus are not as green as they should be. This lack of consensus\namong the actors is one of the primary reasons for the lack of progress. As long as there\nThe Cambridge Climate Action Plan - Implementation at MIT\nAlex, Daniel, Elaine, Mithila\n\n- 8 -\nis no general agreement among the actors on what the problem really is, it is difficult to\nconstruct a framework through which the various actors could coordinate all their\nefforts effectively.\n3.3.\nSynthesis\nA concerted analysis of the problems mentioned by the various actors showed that not\nall problems have the same actionability. Similarly, some of them have a large change\npotential, while others do not. Creating the framework presented in the Table 2 helped\nus understand better where the focus of the action should be.\nLarge Problem\nSmall Problem\nHigh Potential\n- Lack of Political Will\n- No Incentive structure\n- Lack of Knowledge\n- Lack of coordination\n- No base support for greener\nbuildings\n- Lack of Money\nLow Potential\n- Consensual decision\nmaking\nTable 2\nFramework for the problems' analysis\nBased on the results presented above, we have established a list of the issues that impede\nthe progress of green buildings at MIT. This list is based on the problems identified\nthrough the discussions with the actors, but reflects a broader understanding.\n-\nThe fact that MIT has a consensual decision-making process is the root of the\nproblem. If MIT was fully decentralized, each department would plan, pay for\nand operate its own buildings, hence assuring that life cycle cost would be\nconsidered. However, because MIT is a complex centralized institution,\ndecision-making involves a plethora of people with conflicting views and\ninterests; often resulting in a lengthy process of negotiation and culminating in\neither a preservation of the status quo or infinite postponement.\n-\nThe people drafting the policies and the people executing them are not the\nsame. The lack of coordination between the two stages of executing policy\ngenerates problems because it is difficult for the decision makers to make\ninformed decisions if they are not fully aware of all the consequences of their\ndecision.\n-\nLack of Money is certainly not the real problem, at least at the Silver LEED\ncertification level that is currently pursued. The latest planned project, the East\nCampus Extension of the Sloan School of Management, has been entirely\nplanned and designed to fulfill LEED specifications. Interestingly enough, the\nbuilding is not expected to be more expensive than other similar buildings. The\nEast Campus Extension of the Sloan School of Management example illustrates\nthe crucial problem of asymmetric information and misconceptions regarding\ngreen buildings.\nThe Cambridge Climate Action Plan - Implementation at MIT\nAlex, Daniel, Elaine, Mithila\n\n- 9 -\nBased on those considerations, we have established a list of recommendations that are\naimed at tackling those fundamentals issues. These recommendations are presented in\nthe subsequent section.\n4.\nRecommendations\n4.1.\nConcept\nAs a consequence of our discussions with the various actors, we thought that suggesting\nwell-defined actions would not be a successful strategy at MIT. In general people are not\nreceptive to executive mandates. Rather, we thought of coming up with a framework\nwithin which the different actors could choose a custom collection of actions that would\nbest suit their needs.\nAfter studying the interactions between the different actors in MIT, we have identified\nfour axes of actions to remedy several corresponding environmental problems. These\nfour axes of actions include making polluters pay, formulating incentives and rewards for\nthe behavior that we are trying to encourage (mainly being more environmentally\nfriendly), creating commitment and marketing green. Each axis will be discussed in more\ndetail below. Note here that we do not attempt to tackle the consensual decision making\nprocess directly because we believe it has low actionability (due to the already present\ncross over groups), but we believe that it will be indirectly solved through the actions\npresented below.\nTable 3 shows that there are many overlaps in recommended actions. Even though each\naxis represents a different goal to address a specific problem, the method to attain that\ngoal often overlaps with several other axes' action goal. Hence, we have decided not to\nfocus on simply one area that we believe is important because we put equal weight on\neach of these goals, and because it makes more sense to achieve two or three goals while\nusing one primary action. Moreover, the same action may be essential in achieving a\ngoal, but also helps achieve another goal, albeit to a lesser degree. Due to all these\noverlaps in actions and goals, although to differing degrees, it makes more sense to\npursue several policies simultaneously instead of focusing on just one issue and matching\nactions.\nAdditionally, we decided to create varying strategies in order to engage the broadest\nrange of people. For example, if competition through the rewards/incentive scheme\ndoes not appeal to one person, then perhaps the economic incentives or the market\ngreen approach might work. Since individuals in MIT are not homogenous it does not\nmake sense to homogenize environmental policy.\nThe Cambridge Climate Action Plan - Implementation at MIT\nAlex, Daniel, Elaine, Mithila\n\n- 10 -\n\nMake\npolluter pay\nUtilize\ncompetition\nCreate\ncommitment\nMarket\ngreen\nMetering\nIncentive/rewards\nBenchmarking\nMIT/Harvard competition\nAwards\nMass Movement\nCommitment from the top\nIncrease Awareness\nGreen Benefit MIT\nMIT's the greenest\nTable 3\nRole of each action in accomplishing the four goals\n4.2.\nMake Polluters Pay: (Accountability?)\nSustainable design process and implementation not only promotes \"green architecture\"\nbut also seeks to remedy some of the harmful \"consumptive\" patterns of users. These\nsometimes harmful practices lead to energy inefficiency and wastage, which should be\nidentified and remedied. Therefore, to build in a sustainable fashion, one needs to\nestablish sustainable goals as part of developing the project's concept. And, one of the\nways in achieving these goals would be to build into the system certain rewards and\npenalties.\n4.2.1.\nWhy\nAfter interviewing various people, the wide-held view with regards to green buildings\nwas 'Yes, we would like green buildings, but nobody is really willing to invest the time\nand the resources in the design of these buildings.\" Fundamentally, member of the MIT\ncommunity had no real incentive to conduct themselves in a more environmentally\nconscientious manner.\nTo battle this attitude of complacency, a dual system of rewards and penalties was\nsuggested to promote an efficient management of energy in buildings. This suggestion\ncame from the faculty, some of whom were working on areas closely related to green\nbuildings and technology, but who were not an integral part of making MIT a greener\ncampus.\nIntroducing rewards and penalties will compel members of the MIT community to take\nresponsibility for their actions.\nThe Cambridge Climate Action Plan - Implementation at MIT\nAlex, Daniel, Elaine, Mithila\n\n- 11 -\n\n4.2.2.\nMetering\na)\nHow\nElectricity consumption forms the bulk of the energy costs at MIT. MIT has only large\nservice meters for a cluster of buildings which does not allow individual buildings to\nkeep track of how much energy they are consuming. Raising awareness of how much\nenergy each building is utilizing is essential in decreasing energy consumption because\nwithout individual gauges benchmarking is not possible. Sub- metering would create\naccountability among the various users by recording metered data, and holding the\nparticular building responsible for superfluous energy consumption. This accountability\ncould lead to penalties relating to fines as well as bad publicity for the building in terms\nof pin up boards ranking buildings with the most wasteful energy usage.\nMIT faces the challenge of monitoring individual buildings. While many possible actions\nto address energy supply and cost issues exist, one option is to sub - meter individual\nbuildings on campus.\nb)\nWho\nThe installation costs of the sub-metering would be paid by facilities/utilities because\nthis is under their jurisdiction and would help them locate areas of energy inefficiency. In\nthe long run, the disproportionate costs (over a set limit) would no longer be borne by\nthe facilities/utilities but by the users of specific buildings. Hence, the cost of installation\nwould be offset by an efficient use of energy by the users (who would aim to not exceed\nthe set limit).\n4.2.3.\nIncentives/Rewards for people doing well\na)\nHow\nThere are social - environmental, economic and personal incentives for people to\nbecome \"green\". Benefits are manifold, though the priorities vary on which would be\nthe best option at any given time. These incentives are linked to:\n-\nEnvironmental and Social Benefits: Least energy usage, and a healthy\nenvironment is a definite consideration for students, faculty and administration\nat MIT.\n-\nEconomic Benefits: Reducing in infrastructure demands for the city\n(Cambridge) and MIT's utility bills.\n-\nMonetary Rewards: If utility bills are low and there exists efficiency in energy\nusage, then the particular building could be considered for subsidized\npurchasing of services/facilities from within MIT and the City of Cambridge.\n-\nPersonal/Psychological Benefits: The personal satisfaction of working towards\na greener environment, (e.g. using the revolving door for ones own satisfaction)\n-\nPublicity: The various departments at MIT get good publicity with their names\nranking high in energy efficiency. Show case good practices and stories. This in\nturn would be a compliment for the City of Cambridge as well, as MIT resides\nwithin the area.\nThe Cambridge Climate Action Plan - Implementation at MIT\nAlex, Daniel, Elaine, Mithila\n\n- 12 -\n\n-\nAwards: the institution and by the city could award periodically Departments\nthat stand out in saving energy by both.\nb)\nWho\nEven though this axis of action requires campus wide participation, senior office\ncommitment is necessary. Collaboration between the Departments, Labs and Centers\n(DLC's), students senior officers, is key to sustaining this action of axis.\n4.3.\nUtilize Competition\n4.3.1.\nWhy\nCompetitiveness is an essential component of the MIT culture. Competition is what has\ndriven MIT to be one of the best educational institutes in the world. From the students\nto the faculty to the administration, each member of MIT is infused with the competitive\nspirit, thriving on challenges and always rising to meet challenges.\nBased on our discussions with a cross-section of MIT's population, we believe that this\nculture of competition can be harnessed into a productive tool to create a greener\ncampus. This belief is based not only on our assessment of the academic climate of the\ninstitute, but also on concrete examples, such as the success of the recycling program.\nUntil a few years ago, the percent of waste recycled at MIT was barely in the double\ndigits. However, over the last few years, marked by the City of Cambridge challenging\nboth MIT and Harvard to raise their recycling rates to 40%, MIT has drastically\nincreased its recycling rate.\nWe also believe that the harnessing of this competitive culture is one of the key points of\nentry for the City of Cambridge to engage MIT and Harvard. By inciting a climate of\nfriendly competition between the universities, the City of Cambridge can help nudge\nthese institutions toward the goals of the Climate Protection Plan.\nIt is noted here that when focusing on competition, care must be taken to avoid creating\nan atmosphere of conflict. If the atmosphere of competition develops confrontational\novertones, it may have adverse consequences and sour relations between the Cambride,\nMIT and Harvard, which is not desirous.\n4.3.2.\nBenchmarking\na)\nHow\nBenchmarking is essential because it creates a framework within which competition can\nbe fostered. Without a system of benchmarks, it is impossible to record the progress that\nhas been made toward a set goal. Therefore it is recommended that a system of\nbenchmarking environmental impacts, specifically the effects due to buildings and\nbuilding use, should be created. This system should be based on a two tiered system,\nwith the first tier focusing on inter-institutional (MIT, Harvard, the City of Cambridge)\nbench marks and the second tier focusing on inner-institutional (departments and\nhousing units) bench marks. It is noted here that until metering is more universal on the\nMIT campus, inner-institutional bench marks will be difficult to establish as well as\nmonitor.\nThe Cambridge Climate Action Plan - Implementation at MIT\nAlex, Daniel, Elaine, Mithila\n\n- 13 -\n\nThe bench marking system should be designed to incorporate the emission study\ncurrently being conducted at MIT, as well as be extended to include the other aspects of\nthe plan. The system should consist of a visual chart displaying the bench mark levels\nwithin each category of the plan. This chart should be updated on a bi-yearly basis to\ndisplay the levels achieved by each participant along side the benchmark to allow easy\ncomparisons.\nIt is noted here that benchmarking is an inherently difficult action to accomplish as one\nmust consider both where the actors currently stand, as well as what can realistically be\naccomplished. Therefore the specifics of this recommendation are left for a later date\nwhen a more thorough analysis can be conducted.\nb)\nWho\nBench marking can only be successful is it has both the financial and political backing of\nthe senior officials of each institution involved. In this way, each institution (MIT,\nHarvard and the City of Cambridge) must make a commitment to assess their current\nsituation and to develop a system of benchmarks. However the senior officials should\nnot be expected to act alone. They should utilize the resources of the two universities,\nenlisting both graduate and undergraduate students in the process of assessing the\ncurrent conditions. This could be done either through formal channels, e.g. creating a bi-\nyearly class, or through informal channels, e.g. enlisting an environmental group.\n4.3.3.\nHarvard/MIT competition\na)\nHow\nThe recycling example has demonstrated that a friendly climate of competition between\nthe universities can foster an environment where the goals of the plan can be achieved.\nTherefore it is recommended that the City of Cambridge continue to use this\ncompetitive culture to further the aims of the plan.\nFurthermore, it is suggested that the City of Cambridge, in conjunction with the two\nuniversities; develop an electricity usage reduction target to be achieved by the year 2014.\nThe city should then monitor the universities throughout the process, using the\nsuccesses of one to encourage the other. In determining the reduction target, the fact\nthat both institutes are still growing and a simple percentage reduction may not be\nfeasible. Thus, it has been suggested that a reduction target based on square footage\nmight be more appropriate. Additionally, the differences in space usage at the\ninstitutions (lab space vs. classroom space) should be taken into consideration.\nOnce the target is established, it is recommended that, with the approval of the two\nuniversities, the progress of the universities toward this target be displayed in a\nprominent place within the city, e.g. on a billboard, as well as through the yearly Town\nGown reports. This will not only prevent the commitment of the universities from\nwaning as other priorities come up, but will also demonstrate to the city that the two\nuniversities are taking serious steps to address climate control. This also offers a\nconvenient way for the city to publicize the plan to a large segment of the city.\nThe Cambridge Climate Action Plan - Implementation at MIT\nAlex, Daniel, Elaine, Mithila\n\n- 14 -\n\nb)\nWho\nSimilar benchmarking, the success of this recommendation depends on the commitment\nof the senior officials. Members of the City Council should bring together officials from\nboth universities and develop an appropriate reduction target. It will then be the\nresponsibility of the university officials, with the help of the city, to publicize the target\nto the respective campuses. Again, the success of this recommendation does not fall\ncompletely on the shoulders of the senior officials. Once the target has been set, it is up\nto the entire community to address those things that they can change to help achieve\nthose goals. Thus demonstrating the cyclic nature of this process, as this\nrecommendation both fosters commitment and depends on it. Throughout the process,\nboth the city officials and the administration should use the competitive spirit to\npromote the target and encourage their respective community members to contribute\nwhere they can.\n4.3.4.\nAwards\na)\nHow\nSimilar to benchmarking, this recommendation is two tiered. The first tier focuses on\ninter-institutional awards while the second addresses intra-institutional awards. With\nregards to the first tier, the City of Cambridge can continue the process of nudging the\nlarger organizations (such as the two universities) in the right direction by establishing a\ncity-wide award system. It is recommended that, coupled with the first two sections\n(paragraphs 4.3.2 and 4.3.3), an annual city-wide award be established. This award should\nbe given to the university that has demonstrated the most progress toward achieving the\ngoals of the plan. We believe that due to the size and prominence of the universities, a\nsingle award that brings them into direct competition will have more success than an\naward based on reaching a targeted level.\nAs both MIT and Harvard are beginning to face more and more competition from other\ncolleges and universities, they have become more concerned with their image because\nthey way in which people perceive the Institution is important when attracting students.\nBy providing the two centers for learning with an incentive to become more\nenvironmentally friendly (e.g. an award to show prospective students and faculty), the\ncity can further the aims of its plan. This point is addressed further in section 4.6.\nWith reference to the second tier, MIT can institute an internal award system to\nencourage environmentally friendly practices within its sphere of influence. Once\nmetering and benchmarking have been achieved, it is recommended that the Institute\ncreate a system of inter-building energy competitions. It is recommended that the award\nsystem should be two tiered as well; with one overall best performing award and a\nsecond level of awards for all participants who have achieved the desired level of\nconservation.\nb)\nWho\nThis axis of action requires the commitment of the senior officials to institute the inter-\ninstitutional awards. As the City of Cambridge is the logical mediator between the two\nuniversities, it is recommended that they take the lead in setting up the meetings and\nThe Cambridge Climate Action Plan - Implementation at MIT\nAlex, Daniel, Elaine, Mithila\n\n- 15 -\n\ncreating the awards and appointing an independent selection committee. In this way, the\ncity will be seen as both a concerned participant as well as a neutral mediator.\nOn the intra-institutional plane, there are several actors who should participate. The\nsenior officials are in the best position to establish an institute-wide award system, and it\nis therefore recommended that they do so. However other actors, such as student groups\nor individual departments, can also create internal awards and should be encouraged to\ndo so.\n4.4.\nCreate Commitment\n4.4.1.\nWhy\nCultivating commitment within the MIT community, across each and every department\nand organizational group is imperative in promoting green buildings and technology as\nwell as providing the institutional setting for continual renovation of older buildings to\nbring them closer to fulfilling the LEED certification criteria.\n4.4.2.\nMass Movement\na)\nHow\nMIT should strive for both formal and informal commitment. Formal commitment is\nwhen there are formal procedural guidelines that must be observed while informal\ncommitment is observed in the form of individuals within department taking the\ninitiative to raise green issues whenever they feel appropriate. These individuals form\nconnections with other such environmentally concerned individuals and attempt to work\ntogether and push for greener action. Additionally, environmentally conscious\nindividuals expand their informal networks of action by recruiting individuals who have\nan interest in such matters but have not consciously done anything about making MIT's\nbuildings greener.\nb)\nWho\nThe most challenging part of this cyclical process is the initial catalyst that triggers the\ncycle. We have identified two potential triggers. The first is a \"champion\" in the form of\nany member of MIT or a group of members from MIT who are deeply committed to the\nmission of greening MIT's buildings, both new and old. A potential problem that might\narise from a student assuming this role is that her/his participation in MIT is temporary\nand relatively short in the long-run. This is a problem because policy change and social\nnorm shifts (e.g. persuading people within the institution to make green buildings a\npriority) may span a longer period of time than the designated student, faculty,\nadministrator \"champion,\" resulting in discontinuity and hence setbacks via time lags.\nThe problem of transience may be solved by creating a formal post for the advancement\nof green buildings within the institution with provisions in the appointment letter to\nensure continuity even after the designated person has left. One of the environmental\nadvocate's tasks would be to inform the institutional body at large to raise awareness\nconcerning the importance of MIT's commitment to green buildings. In the process of\nThe Cambridge Climate Action Plan - Implementation at MIT\nAlex, Daniel, Elaine, Mithila\n\n- 16 -\n\nraising awareness through informing the institutional body, grassroots support will be\ndeveloped.\n4.4.3.\nBottom-up - top-down approach\na)\nHow\nThe chain of commitment is cyclical because in order for the senior administration to\npass policy, grassroots support is initially required. Once the formal policy is passed,\nmore grassroots support is generated which should pressure the senior administration to\nexpand their formal policy and so forth.\nb)\nWho\nA combination of formal and informal commitment is ideal. In fact, the two go hand in\nhand. A formal commitment, such as an executive order from the senior office would\nensure compliance with certain regulations. However, before the senior administration\nwill take a firm stand, there must be grassroots support (these include lower\nadministration, faculty and students) and pressure for such issues to rise to the top of the\nsenior administration agenda.\n4.4.4.\nIncrease Awareness (\"educating\")\na)\nHow\nIncreasing awareness is a key component in creating mass movement which should then\ncreate pressure on the senior administration to pass formal policy to cement a more\nconscientious behavioral and social norm shift. Educating the masses to catalyze the\nmass movement can be done in a variety of ways. First, more courses addressing not\nonly green buildings but other aspects promoting the Cambridge CPP could be required.\nFor example, when the first-years come to campus, half a day could be spent discussing\nthese issues. Alternatively, the administration could alter course requirements to include\na course requirement that dealt with these issues. These course requirements and\nmandatory sessions would stimulate awareness on campus and hopefully create concern\nfrom the students that would encourage increased participation in environmentally-\nconscious activities. Increasing awareness need not only take place in formal settings,\nsuch as classrooms and orientation programs, but could also manifest itself in the form\nof informal lectures over lunch sponsored by one or more academic departments..\nMoreover, the campus should aim to sponsor at least one environmentally themed event\neach month to keep visibility of the cause on the forefront. More casual, fun affairs\ncould be held in the infinity corridor where a plethora of student organizations are\nvisible. This area is an ideal location especially for the undergraduates since the location\nhas such high traffic and movement of students.\nb)\nWho\nAlmost any group of body in the institution could help in increasing awareness on\ncampus. However, the two main groups would be the faculty and the students. Faculty\nand students alike could present in an informal setting, such as in lectures or in task\nforce meetings.\nThe Cambridge Climate Action Plan - Implementation at MIT\nAlex, Daniel, Elaine, Mithila\n\n- 17 -\n\nThe axis of action to organize at least one environmentally themed event once a month\nwould be coordinated by the person hired by the campus to oversee all environmental\naffairs on campus, who we will call, hypothetically, \"Director of Environmental Affairs\"\n(DEA). The DEA would actively involve each and every possible group on campus so\nthat a sense of ownership and responsibility is engendered. The more groups that are\ninvolved the greater participation there will be, which aids in creating the mass\nmovement effect that MIT should aim for.\n4.5.\nMarket green\n4.5.1.\nWhy\nOur analysis has shown that there is currently no broad recognition of the positive\neffects of green buildings and a green campus in general. People often accept that green\nbuildings are \"good\" for the natural environment, but do not relate improvements in this\ndirection with improvements in their working environment. Although several members\nof the faculty have insisted that research had long shown people working in green\nbuildings were happier and hence greater productivity, people do not seriously consider\nthis in their decision-making related to new buildings.\nSimilarly, other positive effects of green buildings or a green campus in terms of the\nimage of MIT, the increased attractiveness for prospective students, faculty members\nand sponsors etc, were never mentioned as a factor to be considered in the decision-\nmaking process.\nAfter a long discussion within our group, we have agreed that people will only lastingly\nchange their behavior if they can see some direct benefit for them. The benefit is\nvaluated by assessing the consequences of each decision with one's internal system of\nvalues. This means that in order to implement a durable change towards more \"green\"\non the campus of MIT, we need to change the way people perceive and value the\nenvironment. In fact, a reframing of the way the environment is perceived is necessary.\nCurrently, people do not see any direct benefit for them to consider environmental\nissues in their decisions. Rather, they might do it only if external benefits are provided\n(principle of the reward / incentive system presented in the paragraph 4.2.3), thus\n\"biasing\" their decision.\nThe idea behind the \"market green\" axis of action is to complement the other strategies\nby a long-term change in the systems of value of the people on campus, so that acting in\na green way becomes a natural decision rather than a forced one. In fact, acting in an\nenvironmentally friendly way should be seen as an advantage, rather than a hassle.\nAlthough this axis action might appear to be the least defined and most difficult one, we\nthink it is the only way to induce a long-term change on MIT's campus.\nWe envisage the following actions:\n-\nImprove the education about the environment and its positive influence on\nday-to-day life\nThe Cambridge Climate Action Plan - Implementation at MIT\nAlex, Daniel, Elaine, Mithila\n\n- 18 -\n\n-\nIncrease awareness about the positive role that a green campus could play in\nMIT's policy and image\n-\nSuggest an audacious plan for MIT to be the leader in the environmental field\nas it is in others.\nWhile those actions will not have an immediate effect on people's behavior, we think\nthat making clear and visible the positive consequences and aspects of the environment\nwill help internalize such values as sustainability and environmental friendliness.\n4.5.2.\nGreen Benefits MIT\na)\nHow\nWe believe that if MIT had a very green campus, it would improve its position in\nattracting and retaining:\n-\nProspective Students\n-\nNew Faculty and Researchers\n-\nSponsors and Donors\nHowever, as long as no hard figures are available to show this, it might be very difficult\nto convince the senior officers and administration of the integral role of the environment\nto MIT's success. Thus, initial efforts should go into collecting existing and new data\nsupporting (or refuting) the assumption of a positive effect of green buildings and\ncampus.\nThe data collected would then be used in a systematic economic assessment of the pros\nand cons of green buildings by considering not only the lifecycle costs (beneficial only\nfor the O&M people), but also positive/negative externalities of working in a green\nbuilding. If the study were to confirm the economic sense of green buildings for the\nusers, not only for the Operation and Maintenance staff, we think much more of the\ndecision-makers could be convinced of supporting green buildings.\nb)\nWho\nWe think that the lead should come from the research side. There are already several\nprofessors who mentioned the important contribution of green buildings to life and\nwork quality. This topic could be researched as a master's thesis in departments such as\nUrban Studies or Graduate Programs such as TPP (Technology and Policy Planning).\nThe subsequent economic analysis could be part of an interdisciplinary research between\nthe department of Urban Studies and Sloan or the Department of Economics.\nWith a systematic research about this available, it would then be the role of the\nresponsible Faculty to make sure that the information does not only get publicized, but\nalso reaches the potential users in the DLCs and in the administration. It would certainly\nbe a powerful argument for supporters of green buildings to convince the current and\nfuture users, who play an integral role in the planning process.\nThe Cambridge Climate Action Plan - Implementation at MIT\nAlex, Daniel, Elaine, Mithila\n\n- 19 -\n\n4.5.3.\nMIT's the Greenest\na)\nHow\nMIT has a tradition of excellence. However, it had not been true to its reputation in the\nenvironmental domain so far. There is a large disconnect between what is taught and\nwhat is practiced. We believe that here again, there is a potential for large improvement.\nBuilding on the \"Utilize Competition\" axis of action, MIT could try and become an\nexample of self-sufficient campus in the Country and in the World.\nThere is a lot of research being conducted currently on the Campus about topics as\ndiverse as fuel cells, green buildings, water conservation, biological waste treatment, solar\nenergy etc. All those efforts could be bundled into a commitment to make, in the long\nterm, MIT the most self-sufficient campus in the World. We believe that setting very\nambitious goals is an effective way of mobilizing latent energy.\nb)\nWho\nOnce again, most of the effort would come from the academic side. However, such a\nhuge commitment cannot be taken without the active support of some highly placed\nperson. We believe that only a pledge of the senior officers of the Institute, following a\nconsensual discussion-making process involving the related academic bodies, can lead to\nsuccess. This action is therefore subsequent to the \"Create Commitment\" axis of action\n- a sense of commitment needs to be created first. Following this, an interdepartmental\neffort would be needed, probably through the creation of a coordination body (matching\nthe efforts of the academic community and the needs of the administrative side).\nEventually all actors in MIT, users as well as planners and decision makers, need to be\ninvolved in a coordinated movement to make this ambitious goal happen.\n5.\nImplementation\nBecause all the actions presented above are interrelated and not independent, a\nstructured implementation plan is needed. Of great importance is also the concept of not\nstarting too big. Rather, we recommend starting with baby steps, then building on each\nof those steps to get further and further.\nTable 4 summarizes the suggested implementation concept for each of the actions that\nhave been presented in the chapter 4. For each action, this table presents the way this\naction could be implemented, the actors responsible for the implementation as well as\nthe source for the recommendation - the person or group of persons who\nrecommended this action during our discussion process.\nCategory\nAction\nImplementation\nActor\nSource\nMake Polluters\nPay\nMetering\nInstall sub-meters\nDept. of Facilities\nAcademia,\nFacilities\nIncentives/Rewards\nMake DLC pay for\nenergy usage\nGeneral\nAdministration\nAcademia,\nFacilities, General\nAdministration\nThe Cambridge Climate Action Plan - Implementation at MIT\nAlex, Daniel, Elaine, Mithila\n\n- 20 -\n\nCategory\nAction\nImplementation\nActor\nSource\nBench Marking\nCreate standard levels of\nSenior Officials\nAcademia, City of\nsuccess\nand City of\nCambridge\nCambridge\nMIT/Harvard\nUse friendly\nSenior Officials\nCity of\nCompetition\ncompetition between\nand City of\nCambridge,\nUtilize\nthe two universities\nCambridge\nGeneral\nCompetition\nAdministration\nAwards\nCreate awards for\nSenior Officials\n-\nenvironmentally friendly\nbehavior.\nand City of\nCambridge\nStudent Groups\nand Departments\nMass Movement\nEngage the entire\nEverybody\nGeneral\nInstitute\nAdministration\nCreate\nCommitment\nCommitment from the\nTop\nCreate pressure from\nthe base (grass root)\nSenior Officers\n(indirectly from\nthe base),\nEverybody\nIncrease Awareness\nIncrease visibility of\nactions, improve\neducation about the\nEverybody\nGeneral\nAdministration\nEnvironment\nGreen benefits MIT\nShow MIT's green\nAcademia\n-\nimage as an important\nMarket Green\nfactor of success\nMIT's the greenest\nMake MIT the most\nEverybody\nAcademia\nself-sufficient campus in\nthe World\nTable 4\nImplementation concept for the actions\nFinally, and as a complement to the implementation table, Figure 4 presents the\nimplementation spiral - the suggested sequence of actions that will allow the build-up\nprocess presented earlier. The series of action on the left are basic steps that form the\nfoundation on which the other actions can be built - going further and further. Starting\nwith the inner spiral, going through each round will allow building up the awareness and\ncommitment level within the MIT community, until really ambitious actions can be\nimplemented - eventually leading to MIT being the greenest building out there. The\nspiral also demonstrates that many of the actions much be maintained over the long\nterm in order to keep interest and commitment in the more specific actions\nrecommended.\nThe Cambridge Climate Action Plan - Implementation at MIT\nAlex, Daniel, Elaine, Mithila\n\n- 21 -\n\nMIT's the greenest\nMass Movement\nBegin Audit of\nCurrent Energy Use\nGet\nSet Incentive and\nMIT/Cambridge/Harvard\nRewards\nCommitment from\ntogether\nthe Top\nShort\n\nTerm\n\nLong\n\nTerm\n\nIncrease\nAwareness\nContinue Incentives\nand Rewards\nBegin Metering\nGreen Benefits\nNew Buildings\nMIT\nSet Benchmarks\nStart MIT/Harvard\nCompetition\nMeter Renovated\nBuildings\nStart Awards\nProgram\nContinue MIT/Harvard\nCompetition\nContinue Metering\nContinue Awards\n6.\nProgram\nMaintain Metering\nFigure 4\nImplementation Spiral\nConclusion\nThrough this analysis, we think we have shown that there is little room for the City of\nCambridge to force MIT to change its policy. In order to maintain a good relationship\nwith MIT, the City of Cambridge has to avoid unilateral actions. Therefore, MIT itself\nshould tackle the issue.\nIn an attempt to create a framework for MIT's progression toward a greener campus, we\nhave suggested the following four axes of action:\n-\nMake Polluters Pay\n-\nUtilize Competition\n-\nCreate Commitment\n-\nMarket Green\nWe believe the suggested axes of action offer a way for MIT to accomplish the goals of\nthe Climate Protection Plan of the City of Cambridge especially with regard to green\nbuildings. The suggested measures are meant to have an accelerating (catalyzing) effect\non the already existing trend toward a greener campus. By offering four axes, we aim to\nThe Cambridge Climate Action Plan - Implementation at MIT\nAlex, Daniel, Elaine, Mithila\n\n- 22 -\n\nprovide a broad enough framework to engage all members of the MIT community, but\nin the end the human aspect will be a critical factor of success for our suggested strategy.\nThe Cambridge Climate Action Plan - Implementation at MIT\nAlex, Daniel, Elaine, Mithila"
    },
    {
      "category": "Resource",
      "title": "Is it possible to reduce the green house gas emissions linked to energy use in MIT labs?",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-366j-planning-for-sustainable-development-spring-2006/025834a9d0c2181c9544d459d2192b34_final2005.pdf",
      "content": "Claudia Cordie', Jiwoon Kim, Peldon Tshering, Randall Coffie\nIs it possible to reduce the green house gas\nemissions linked to energy\nuse in MIT labs?\nIndex\n1.\nIntroduction\n2.\nBackground\n2.1 Broad look on the role of high educational institutions in the\nenvironmental issues\n2.2 Why focus on labs?\n2.3 Fume hoods\n2.4 Laboratories for the 21st Century program\n3.\nMethodology\n4. Observations\n\n4.1 Interviews and field visit\n\n4.2 Simple Survey\n\n4.3 The importance of training\n5. Benefits of conserving energy in the labs: Duke University and Berkley fume\nhoods report\n\n5.1 A summary of the Duke Report\n\n5.2 Implications for MIT\n\n5.3 The Berkeley fume hood\n6.\nRecommendations\n\n6.1 The \"mental scheme\"\n\n6.2 Recommendations\n7.\nConclusion\n8. Acknoledgements\n9. References\n\nAppendix A\n\nClaudia Cordie', Jiwoon Kim, Peldon Tshering, Randall Coffie\n\n1. Introduction\n\nThe nature of environmental problems facing our societies is complex and\nwide reaching. Sustainable development is not just another category of\nenvironmental, social and economic problems we face; it is a way of thinking\nabout these issues. If we do not learn to think about global environmental\ndegradation in a more effective way, we will continue to make little progress in\nreducing them. Part of the intellectual challenge of sustainable development,\ntherefore, is that we must learn how to solve several problems at once.\nGlobal warming is a worldwide problem that everyone --governments,\nindustry, communities and individuals-- should contribute to solve to make a real\ndifference.\nIn 1992, the United Nations Earth Summit in Rio de Janeiro produced a\nFramework Convention on Climate Change (UNFCCC) aimed at the \"stabilization\nof greenhouse gas concentrations in the atmosphere at a level that would\nprevent dangerous anthropogenic interference with the climate system\" (art.2\nUNFCCC). Most of the countries, including the United States, ratified this non\nbinding agreement that entered into force two years later.\nIn 1997 the Conference of the Parties of the UNFCCC adopted the Kyoto\nProtocol which added binding targets - quantified emission limitations and\nreduction commitments - and timetables to the framework Convention.\nAs of 29 April 2005, 150 states and regional economic integration\norganizations have deposited instruments of ratifications, accessions, approvals\nor acceptances of the Protocol (UNFCCC website). The United States of\nAmerica, the world's largest emitter of green house gases (GHG) has not ratified\nthe Protocol yet.\nHowever, there are many initiatives underway in USA at regional, state and local\nlevel.\n\nClaudia Cordie', Jiwoon Kim, Peldon Tshering, Randall Coffie\nIn August 2001, for example, the New England States and the Eastern Canadian\nProvinces adopted a regional Climate Change Action Plan to reduce GHG\nemissions to 1990 levels by the year 2010, with a further 10% reduction by 2020.\nThe Massachusetts Climate Protection Plan adopted in 2004, represents the\nMassachusetts commitment to achieve the goals established in the Regional\nPlan and even attempt to exceed the regional emissions targets.\n\nWithin Massachusetts, the City of Cambridge represents one of the few\nMunicipalities that have adopted their own Climate Protection Plan. The goal is\nambitious since it aims at reducing GHG emissions by 20 % from 1990 levels, by\n2010. Cambridge is also part of the International Campaign \"Cities for Climate\nProtection\" which includes about 150 cities in the United States, and 675\nparticipants worldwide.\nMajor Cambridge based institutions and companies are already taking actions to\nreduce their own impact. The Massachusetts Institute of Technology is one of\nthose.\nThis study focuses on GHG emission reduction through energy\nconservation opportunities at the MIT campus.\nOur main focus is concentrated on wet labs and in particular, on one of the most\nenergy intensive equipment of a wet lab which is the fume hood.\nIn this report, after describing our decision making process and the methodology\nused, we try to find an answer to the following question: is it possible to reduce\nGHG emissions linked to energy use in the MIT labs?\n\nClaudia Cordie', Jiwoon Kim, Peldon Tshering, Randall Coffie\n2. Background\n\nIn this chapter we describe our decision making process. How did we get\nto our research question? Which are the steps that we followed while merging\nourselves into the green house gas issue?\n\n2.1 Broad look on the role of high educational institutions in the\nenvironmental issues\nClimate change, acid rain, deforestation, species extinction, fisheries\ndepletion, soil erosion, toxic buildup in ecosystems, water, land and air pollution\nand ozone depletion are some of the most important environmental problems\nthat are forming a web of destruction around the world. The solution of these\nproblems requires professionals with multi level problem solving skills,\nprofessionals that can work collaboratively in interdisciplinary teams to solve\nproblems form a holistic point view. Hence, the role of universities becomes\nimperative.\nUniversities can give students and future leaders the intellectual tools for\ndoing that. U.S. colleges and universities influence the standards for higher\neducation throughout the world. They also serve a larger international student\nbody than in any other country. It is incumbent upon American higher education\nto contribute to solving the global challenge of sustainable development\n(Clugston and Calder 2002).\nIn particular, Universities with an excellent global reputation like MIT\nattract a significant amount of international students and in that sense they could\nmake an impact not only nationally but internationally too.\nAccording to Anthony Cortese there is a growing demand at colleges and\nuniversities in the United States and internationally for environmental education\nand for institutions to reduce the environmental impact of their own operations.\nThis effort must be encouraged (Cortese 1999).\nThrough out the evolution of Higher Education for Sustainable\nDevelopment in the U.S we can see that in Massachusetts, Institutions played\nand are still playing an important role in the scaffolding of \"how\" to become a\n\nClaudia Cordie', Jiwoon Kim, Peldon Tshering, Randall Coffie\ngreener campus and through that process educate on sustainability. Universities\nlike Tufts, University of Massachusetts, Harvard, MIT, Boston University, just to\nmention a few, have all been to some degree active in this process.\nAnthony Cortese mentions in his paper \"Education for sustainability (the\nuniversity as a model of sustainability)\" that without strong outside influence\nhigher education is not likely to change its direction far enough or fast enough.\nWhat are those Universities doing regarding worldwide environmental problems\nlike climate change? Besides the external pressure of the compliance with\nenvironmental rules, do they have other reasons to work on efficient resource\nmanagement on campus? Basically, what exactly is going on these campuses?\nThose are the first questions that we asked to ourselves when we started\nthinking about the focus of our study.\nWe decided to focus on MIT, mainly because we could have easier\naccess to the necessary sources of information.\n\n2.2 Why focus on Labs?\nOnce we decided to investigate MIT activities to reduce GHG emissions,\nwe choose to restrict our area of study to specific intensive energy consumptive\nspaces.\nThis brought our choice towards lab space.\nAccording to the US Environmental Protection Agency (EPA) and the US\nDepartment of Energy (DOE) a typical laboratory uses far more energy (5 to 10\ntimes) and water per square foot than a typical office building, due mainly to\nintensive ventilation requirements.\nWithin the MIT campus, in particular, if we consider the usage of energy\namong different kind of room use (academic, wet lab, residential, and service),\nthe wet labs are the most energy intensive spaces. The percentages of energy\nconsumption are represented in figure 1.\nWithin a wet laboratory, fume hoods are one of the biggest sources of energy\ndrain.\n\nAt this stage, we defined our research question which is: \"Is it possible to\nreduce the Greenhouse Gas emissions linked to energy use in MIT\nlaboratories?\".\nTo approach such a question, a beginning was made by familiarizing with the\nrelevant aspects of the MIT campus, which included recently renovated labs.\nSince the use of energy requires knowing the amount of energy used, a look at\nthe metering system was also found to be essential. It was also thought to be\nbeneficial to look at relevant projects currently in progress. These ideas put into\nperspective some way of going about finding an answer to our question.\n\nTable 1: Energy use by utility system within MIT\n\nGross area - Sq Ft\nElectricity - KW\nElectricity - KWH\nAcademic\n2,662,698\n9,569.0\n52,711,488\nResident\n1,578,815\n576.0\n4,765,997\nService\n4,904,336\n6,580.3\n48,959,844\nWet Lab\n1,309,863\n12,355.6\n73,713,285\nTotal\n10,455,713\n29,080.8\n180,150,614\n\nFigure 1: Energy use (%) by utility system within MIT\n\nElectricity - KWH\nAcademic\n29.3%\nResident\n2.6%\nService\n27.2%\nWet Lab\n40.9%\n\nSource: MIT campus building model 2003.\nClaudia Cordie', Jiwoon Kim, Peldon Tshering, Randall Coffie\n\nClaudia Cordie', Jiwoon Kim, Peldon Tshering, Randall Coffie\nWe also thought that it would have been interesting to examine the\nchanges that occurred, if any, in the labs planning and/or operating system, after\nEPA fined in 1998 MIT for the violation of certain requirements of the Resource\nConservation and Recovery Act (RCRA). As a consequence of the latter, in 2001\nMIT entered into a Consent Decree to:\n-\nachieve compliance with RCRA\n-\ncomplete supplementary environmental project\n-\nmake improvements to MIT environmental management system\n\nWhile collecting information on laboratories we discovered the existence\nof an EPA and DOE voluntary program called Laboratories for 21st Century (Labs\n21) dedicated to improving the performance of U.S. labs with particular attention\nto the energy efficiency issue.\nBefore entering the details of our study, it is necessary to describe the\nmain object of our research, the fume hood and talk briefly about the Labs 21.\n\n2.3 Fume hoods\nThis section defines a fume hood and examines its function.\nFor the purpose of this study, a fume hood may be simply defined as an\nexhaust system used for removing hazardous gases and vapors generated from\nongoing experiments in a workspace. While a fume hood may be considered a\nprimary means of protection and first defense to minimize chemical exposure to\nresearch workers from inhalation of hazardous vapors, it is also a device that has\nthe potential to be the biggest energy consumer depending on how it is used.\nThe fume hood protects users from inhaling chemicals by constantly\npulling air into the hood and exhausting it out of the building. The system may\neither use a complete hood in case of larger experiments or sometimes snorkel\nsystems are used for local and minimal exhaust. (figure 3).\n\nClaudia Cordie', Jiwoon Kim, Peldon Tshering, Randall Coffie\nThis mechanism of exhausting air from the fume hood requires the use of\nenergy, which is the primary concern of this study.\nEnergy use therefore depends on the position of the sash (the term used to\ndescribe the movable glass panel that covers the face area of a fume hood).\nSashes can be vertical, horizontal, or a combination of the two opening (see\npicture 2.1).\nThere are many types of hoods available, each with its own design and\nfunction based on either the Constant Air Volume principle (CAV) or the Variable\nAir Volume Principle (VAV).\nThe acceptable range of the average face velocity (measurement of the average\nvelocity at which air is drawn through the face to the hood exhaust) is 60-100 feet\nper minute (fpm). If non-carcinogenic materials are being used the acceptable\nface velocity for minimally hazardous materials is 50 fpm. The ideal average face\nvelocity is 100 fpm for most operations. Most hoods installed today are at 100\nfpm. The variable air volume hoods differ from constant air volume hoods\nbecause of their ability to vary air volume exhausted through the hood depending\non the hood sash position while maintaining a constant face velocity regardless\nof the sash position. VAV hoods are becoming the preferred hood due to the\nelimination of excess face velocity that can generate turbulence leading to\ncontaminated air spillage, endangering the worker. They also reduce the total\nquantity of supply and exhaust air to a space when not needed, thereby reducing\nuse of energy.\nThe current technology in fume hood system may be seen in the effective\nintegration of the fume hoods and ventilation components by the Phoenix\nSystem. Its pertinent points may be summarized as follows.\n\nPicture 2.1: A complete Phoenix System fume hood\n\n- The Phoenix system controls energy use by monitoring sash height and\ncorrespondingly regulating the amount of airflow into the hood (see picture\n2.1).\n- Lower sash heights result in less air exhausted by the hood. This reduces\nthe energy requirement of the hood itself as well as the building system\nthat must supply conditioned make-up air to the room. An alarm if fitted to\nindicate any fully wide open sashes.\n- In addition, the Phoenix controls are equipped with a motion sensor. When\nthere is no movement present, the exhaust air is further reduced.\n\n2.4 Laboratories for the 21st Century program\n\nClaudia Cordie', Jiwoon Kim, Peldon Tshering, Randall Coffie\n\nClaudia Cordie', Jiwoon Kim, Peldon Tshering, Randall Coffie\nLabs 21 is a voluntary program established by the EPA and the United\nStates Department of Energy (DOE) to improve the environmental performance\nof U.S. laboratories and in particular, their energy efficiency. . It consists of three\ncomponents: training and education, partnership programs, tool kit . The latter\nincludes design guides, case studies, a performance rating system, best\npractices, and other tools.\nLabs21 Environmental Performance Criteria (EPC) is a rating system specifically\ndesigned for laboratory facilities. It is based on Leadership in Energy &\nEnvironmental Design (LEED) Building Rating System established by the United\nStates Green Building Council (USGBC) for improving environmental building\nperformance. However, LEED focuses on commercial or residential buildings, not\nlaboratories. Therefore, the EPA and DOE established Labs21 to make\nenvironmental standards specifically for laboratories.\n- Purpose\nThis program provides mainly energy-efficient strategies for designing and\nequipping the laboratories of the 21st century.\n- Benefits\nAccording to US EPA, if half of all American laboratories can reduce their\nenergy use by 30%, the nation could reduce its annual energy\nconsumption by 84 trillion BTUs - equivalent to the annual energy\nconsumption of 840,000 household -. This would decrease CO2 emission\nby 19 million tons equivalent to removing 1.3 million cars from U.S.\nhighways.\n- Check point\nConditioning Ventilation air: energy-efficient technologies (variable-air-\nvolume (VAV) fume hood and heat recovery)\n\n3. Methodology\nThe methodology we used in our study includes, but it is not limited to, the\nfollowing:\n\nClaudia Cordie', Jiwoon Kim, Peldon Tshering, Randall Coffie\nLiterature review: This consisted of web site searches and review of other\nrelevant documents such as the consent decree of MIT, report on fume hoods\nby Duke University and the Environmental Health and Safety (EHS) manual.\nGroup discussion: The numerous guest speakers brought our attention to\nmany aspects that could be included in our project. The presentation that was\nrequired to be done by the group also helped to narrow down the focus into\nthe ultimate question. Various inter and intra team discussions provided\nopportunities to view the focus of the project from different angles.\nInterviews: The various members of the group met with different people who\nhad some relevance to sustainable development. These were mainly people\nin MIT in the capacity of academic or administrative staff.\nField visit: The group also made some field visit to various building of interest\nwhich included an extensive tour of the Dreyfus Building (building No. 18), the\nGenzyme building, a Green Campus tour and a quick look around building\nNo. 68.\nSurvey: A very simple survey was carried out based on a few questions which\nwere meant to capture the mind frame of the laboratory users in building No.\n18. The survey consisted of some direct questions as well as a few multiple\nchoice questions. The multiple choice questions were put in with a purpose to\ndirect focus on the topic which could otherwise blow out of proportion on the\nissue of sustainable development. This survey will be discussed in details at a\nlater stage (See appendix A for a copy of the questionnaire).\n\n4. Observations\nIn following the above methodology, the group was able to discern a few\nobservations from the various tasks.\n\n4.1 Observation from interviews and field visit\nFrom interviews and discussions, it was found that many lab buildings on MIT\ncampus are not metered.\nBuilding 68 was recommended to be inspected based on the fact that it is\na renovated lab building that which has a metering system in place.\n\nClaudia Cordie', Jiwoon Kim, Peldon Tshering, Randall Coffie\nUnfortunately this visit was not possible due to unavailability of persons in\ncharge. The presence of this metering system is important because it serves\nnot only as a base energy use estimate for other similar types of building on\ncampus but also for cost estimating for research grants and other funding\npurposes.\nA discussion with the administrator officer of the Department of Chemistry,\nRichard Wilk, clearly showed that Building No. 18 had undergone complete\nrenovation (started in 2002 and completed in 2004). This renovation included\nfeatures many of which were energy saving methods such as energy efficient\nwindows (with infra red screens), central exhaust system, new fume hood\nsystem, increasing natural light in the labs as well as a new roofing system.\nDiscussion with various people brought to light that energy efficient\nbuildings would be welcome especially from the point of view of recurring and\noperational costs. A suggestion that surface time and again, seemed to be\nthat while planning a project, the entire cost of the project, meaning life cycle\ncosts as well as environmental costs , should be taken into account. This was\nnot done previously because in many projects the people who made\ndecisions on the capital cost of the project differed from those responsible for\nthe operational costs. It was also noted that energy saving measures are not\nrequired as per the law. In other words, these are voluntary actions taken by\ninstitutions or organizations.\nJulie Paquette, a current MIT graduate student, participated as an\nengineer in an advisory group that conducted a national survey to assess the\ncase for a thorough review of current standards and codes to further drive\nenergy efficient lab design and operations. According to her, MIT is more\ninclined to invest in energy efficient lab design and operations for new\nconstructions rather than for renovations. This is because renovation projects\nare typically funded by individual research grants from outside, and therefore\nfunding is mainly applied to the most important research group.\nShe asserts that guidelines for the laboratory renovation projects should be\ncreated to satisfy the environmental improvement.\nAnother interesting issue that she mentioned is that laboratory designers\n\nClaudia Cordie', Jiwoon Kim, Peldon Tshering, Randall Coffie\ntend to build laboratories with extra capacity because they consider future\nexpansions but often the projections could be inaccurate. For example, when\na designer plans the size of a chilling water system, the design engineer\nestimates one thousand two hundred tons, but actual maximum load required\nis only three hundred and typical load is less than one hundred fifty tons. This\nsituation shows lack of feedback in the operating system. To avoid that, she\nsuggests that the designer, contractor, operator and client need to work\ntogether at the very beginning of the project.\n\nObservations made during the field visit are mainly centered on the visit to\nbuilding No. 18. It was observed that this building boasted of the state-of-art-\ntechnology for fume hoods. It has the Phoenix system which clearly display to\nthe user of the fume hoods the energy used at that instant. (See picture 2.1)\nThe fume hoods were outfitted with the double sashes, both vertical and\nhorizontal ones, for safety reasons as well as for energy efficiency purposes.\nAn automatic alarm goes go off if the sashes are open completely, to warn\nof huge air volume suction. Sensors are present to detect movement in front\nof the fume hoods. In the absence of movements, the fume hoods\nautomatically lower the air flow velocity thereby saving energy even if the\nsashes are left open. There are also occupancy sensors for lighting system.\nWith this sophisticated system in place, it is now left for the users to actually\nput these devices to maximum efficient use. The behavioral aspect was also\nnoted during the visit and it was found that many fume hoods are left open\n(see picture 2.3).\n\nSome experiments were observed to be completely set up in the fume\nhood itself, which raised the question of its necessity (see picture 2.3).\nThe other important observation was obtained from the result of the short\nsurvey that was carried out.\n\n4.2 Simple survey\n\nThe behavior of researchers in a laboratory building influences CO2\nemission caused by energy consumption. Researchers spend most their time in\nthe laboratories and use fume hoods. To have a general idea of the researchers\nview, regarding the energy intensity of lab spaces compared to other spaces on\ncampus, this small scale crude survey was implemented. The survey consists of\nfive questions and involved twenty at random researchers (PhD, post doc,\ngraduate students and undergraduates) working in Building 18.\n\nThe first question asked whether or not they were aware of the energy\nintensity of their lab space compared to a classroom or office area.\nFifteen people said yes. Seventy five percent of researchers answered that they\nknow about the energy intensity of their laboratories. (Figure 2.4)\n\nFigure 2.4: Result of question 1\n\nNo response=, 1\nNo=, 4\nYes=, 15\n\nThe second question asked whether they were aware of any measures to\nreduce the energy use in their lab space. If they answered \"yes,\" the next\nquestion asked what they thought such measures were. There were 15 yeses\nthat show half of them talked about light sensor (49%) rather than fume\nhoods(39%) even though the fume hoods should have top priority when energy\nsaving is considered. This result might be indicating a lack of awareness of the\nresearchers surveyed. (Figure 2.5)\nClaudia Cordie', Jiwoon Kim, Peldon Tshering, Randall Coffie\n\nFigure 2.5: Result of question 2\nNo=, 5\nfume hoods,\n7, 39%\nlight\nsensors, 9,\n49%\nCooling\nwater\nsystem, 1,\n6%\nspectromete\nr(UV FL), 1,\n6%\nYes=, 15\n\nThe third question asked about what they were doing to try to save\nenergy in their laboratories. Multiple choices were given. Fifteen indicated that\nthey closed the fume hoods as much as possible and kept them closed when\nFigure 5.1\nNo response\nOther (I know about the measures but am\nnot diligent about it)\nI don't have time to think about saving\nenergy\nKeep the lights on only when needed\nClose the fume hoods as much as\npossible and keep them closed when not\nin use\nthey are not in use. Eleven said that they kept the light on only when it is needed\n(Figure 2.6).\nThe fourth question asked about if they knew the optimal use of fume\nhood regarding to safety and energy. There were one hundred percent of yeses\nregarding safety, but for energy use, there were only fifty percent of yes (see\nfigure 2.7).\nClaudia Cordie', Jiwoon Kim, Peldon Tshering, Randall Coffie\n\nFigure 2.7: Result of question 4\nRegarding to energy?\nRegarding to safety?\nno= 10\nyes=10\nyes= 20\n50%\n50%\n100%\n\nThe fifth question asked them to make suggestions if they had any. There\nwere several suggestions, such as that all new equipment should be energy\nefficient, or that more energy efficient chilled water systems were necessary. The\nmost interesting response was that radios in the laboratories should be turned\noff. The following list shows the responses as written by the researchers.\n\nz All new equipment should be energy efficient.\nz More efficient chilled water systems\nz Personal efforts\nz Light sensors\nz Air con more cooler than needed, heat more than necessary\nz Automatic hoods\nz Lower air flow circulation at night\nz Can't think of anything\nz Turning off instruments - lights in the fume hoods\nz Vacuum pump power - turn off\nz Turn off radios\n\n4.3 The importance of training\n\nDue to the energy intensity of fume hoods in lab systems, the phoenix one\nmentioned earlier come in handy to have a more efficient use of energy. But the\noperators of fume hoods (researchers) are mainly familiar with the safety aspects\nof the fume hoods and not really with the energy consumption aspect, meaning\nClaudia Cordie', Jiwoon Kim, Peldon Tshering, Randall Coffie\n\nthat the implementation of a system like the phoenix system without a proper\ntraining to the users might have no positive effect on the decrease in energy\nconsumption. (See also fig 2.8)\n\nFigure 2.8: Mental Scheme\n\"Mental Scheme\"\nLab\nFume hood\nSafety\nUse\nEnergy\nEfficiency\n--Traditional\nTraditional\n--Each researcher is somehow aware of this.\nEach researcher is somehow aware of this.\n--Compliance (Required by law)\nCompliance (Required by law)\nFunding Grants\nProject Grants\nInstallation\n-Safety\n-Energy saving?\n--Beyond compliance/ cost saving\nBeyond compliance/ cost saving\nEHS Coordinator\nGap\n--Environmental\nEnvironmental\n--Health\nHealth\n--Safety\nSafety\nLower GHG emission\nLower GHG emission\n??\n\nClaudia Cordie', Jiwoon Kim, Peldon Tshering, Randall Coffie\n\nClaudia Cordie', Jiwoon Kim, Peldon Tshering, Randall Coffie\n5. Benefits of conserving energy in the labs: The Duke\nUniversity study and the Berkley fume hood report\n\n5.1 A summary of the Duke report\n\n5.1.1Introduction\n\nIn the summer of 2003, the Duke University and the Labs 21 program of\nthe EPA conducted a study under a voluntary partnership. The aim of the study\nwas to quantify benefits associated with low cost administrative controls that\npromote the efficient operation of laboratory fume hoods. Laboratory fume hoods\nwere chosen as the focus of this study due to the fact that they are typically the\nlargest energy consumer in the laboratory and their prevalence in most\nlaboratories. Fume hoods consume energy directly through exhaust fans, flow\nmonitors, fume hood lighting, and other fume hood mechanical devices. They\nalso consume a great deal of energy indirectly from the associated heating and\ncooling costs of exhausted air.\n\nDuke University's Levine Science Research Center (LSRC) was chosen\nas the site for this study due to its high concentration of fume hoods and its\nautomated fume hood monitoring system.\n\nThis study is presented in this work because of the relevance it has to the\nsituation of Building 18 on the MIT campus. This recently renovated chemistry\nbuilding has a total of 200 fume hoods all equipped with double sashes and a\nphoenix system.\n\n5.1.2 Some previous calculated cost\n\nAccording to the Duke report, various studies have been conducted to\naddress the costs associated with laboratory fume hood operations and patterns\nin fume hood utilization. The annual cost of a cubic foot of airflow in a laboratory\nfacility has been estimated to range from $2 to $7. The Colorado School of Mines\nestimated their costs at $2 per cfm, Grossman estimated the cost around $3 per\n\nClaudia Cordie', Jiwoon Kim, Peldon Tshering, Randall Coffie\ncfm, Bentsen estimated the cost around $4 per cfm, and Ryan estimated the cost\nto be from $4 to $5 per cfm.. Variation in these estimates stems from differences\nin energy costs, climate, and efficiencies of HVAC systems. Another reason for\nthe discrepancy is that many estimates only include the direct energy costs, while\nothers estimates include differed maintenance costs, extended equipment life,\netc. The annual cost of a cubic foot of airflow in LSRC is estimated to be $3,\nbased on the buildings historical energy consumption and certain assumptions.\n(For more detailed calculations of energy cost per cfm sees section 2.4 of the\nDuke report.)\n\nNumerous articles have been published that contain estimates the typical\namount of time a laboratory operator spends at their fume hood on a daily basis.\nThe amount of time a fume hood is used appears to be a function of (1) the\nnumber of laboratory personnel per fume hood, (2) the type of laboratory facility,\nand (3) the type of research that is being conducted. The average daily fume\nhood utilization estimates range from less than one hour per day to almost twelve\nhours per day. Grossman estimates that the typical laboratory operator spends 1-\n2 hours per day at their fume hood. In a survey conducted by Rabiah and\nWelkenbach, a survey of six University of Michigan departments found that fume\nhoods were open from 1 hour to 11 hours per day depending on the department.\nIn a study published by Phoenix Controls actual fume hood utilization at a\npharmaceutical company was measured and the results of study indicated that\nthe average hood was used for less than an hour and a half each day. It is\nbelieved that fume hoods in LSRC are directly utilized for an average of two to\nsix hours per day based on conversations and observations.\n\n5.1.3 Short description of the methodology\n\nBasically they chose two different lab areas within the LSFC and use the\nresearchers per space as a control and an experimental group. The study was\nthan split up in two phases. Table 5.1 gives a brief description of this lay out.\n\nClaudia Cordie', Jiwoon Kim, Peldon Tshering, Randall Coffie\nTable 5.1: layout of the Duke Study\n\nControl group\nExperimental group\nPhase 1\n(Baseline\nhood\nutilization)\nNo training\nNo training\nPhase 2\nNo training\nTraining\n\nImportant details about their methodologies will be briefly listed as follows:\n\n- Duration: 7 weeks study.\n- Training: The experimental group received individual one-on-one training\nthat took 1 day. A Handout given the researchers and magnets posted on\nthe fume hoods were used to reinforce the information given.\n- Type of fume hood: 4 feet wide, two stages (operating two flow rates one\nat a sash height < or = to 2inches and an other at height > 2 inches) and\nvertical sashes\n- Monitoring: Both phases were remotely monitored unbeknownst to the\nlaboratory personnel. Intervals of 15 minutes were used to monitor the\nface velocity of each fumehood.\n\nFor more detailed information on specifics in the methodology see Duke report.\n\n5.1.4 Results\n- Data collected during phase one of the study indicated that the fume\nhoods in Pharmacology rarely operated at low flow rates.\n- Thirty-six out of the 42 fume hoods operated at high flow rates for 24\nhours per day during phase one, which indicated that the fume hood\nsashes were virtually never closed below two inches.\n- Figure 5.1 below illustrates the initial high response to the administrative\ncontrols that begins to decline after the first week. Figure 5.2 shows the\nchange in high flow operation time from phase one to phase two for the\nindividual fume hoods.\n\nFigure 5.1\n6/18/2003\n6/20/2003\n6/22/2003\n6/24/2003\n6/26/2003\n6/28/2003\n6/30/2003\n7/2/2003\n7/4/2003\n7/6/2003\n7/8/2003\n7/10/2003\n7/12/2003\n7/14/2003\n7/16/2003\n7/18/2003\n7/20/2003\n7/22/2003\n7/24/2003\n7/26/2003\n7/28/2003\n7/30/2003\n8/1/2003\nHours Operaing at Low Flow (~340 cfm)\nExperimental Group\nControl Group\nPhase 1\nPhase 2\n\n-80%\n-60%\n-40%\n-20%\n0%\n20%\n40%\n60%\n80%\nC-107\nC-110\nC-112\nC-115\nC-127\nC-129\nC-130\nC-131\nC-207\nC-212\nC-215\nC-229\nC-230\nC-231\nC-307\nC-310\nC-312\nC-315\nC-327\nC-329\nC-330\nC-331\nC-141\nC-143\nC-145\nC-148\nC-164\nC-166\nC-167\nC-169\nC-241\nC-243\nC-245\nC-248\nC-264\nC-266\nC-343\nC-345\nC-361\nC-363\nC-364\nC-366\nHood Number\n% Change\nAverage Change for\nExperimental Group\nAverage Change\nfor Control Group\nFigure 2. Percentage Change in Fume Hood High Flow Operation Time\nAfter Implementing Administrative Controls\nExperimental\nControl\nFigure 5.2. Percentage Change in High Flow Operation\nTime\nClaudia Cordie', Jiwoon Kim, Peldon Tshering, Randall Coffie\n\n5.1.5 Duke Report Conclusion\n\nThe implementation of administrative controls to reduce fume hood energy\nconsumption can be both effective and economical. The capital costs associated\nwith administrative controls are typically less than most other energy conserving\noptions. Those implemented in this study would take approximately one day to\nimplement in 50 laboratories. Administrative controls are also advantageous\nbecause they heighten awareness of energy consumption and can create\nsecondary savings through producing behavioral changes in employees.\n\nThere was an approximate 6-hour sustained decrease in the high flow\noperation time among the fume hood personnel that experienced administrative\ncontrols. There was an approximate 6 hour sustained decrease in the high flow\noperation time among the fume hood personnel that experienced administrative\ncontrols. This 6-hour decrease in high flow operation translates into a savings of\n$1,000 to $11,000 annually if all 48 fume hoods in the Pharmacology Department\nare subjected to administrative controls.\n\nIt is important to mention though that there is a remaining challenge for the\nreal success of a project like this. There must be a ongoing project that can\ncontinuously reinforce the initial training of the lab personnel in order to keep the\nnew work habits and in a long term even convert those in regular day-to-day\nhabits.\n\n5.2 Implications for MIT\nThe above is an example that can very well work in labs like the one in\nBuilding 18 at MIT. These labs are already provided with a phoenix system that\namong other things give a right-on-spot reading of the energy consumption in\nsitu. If there is a way to record these readings a pilot study like the one done at\nDuke University can give much insight on how to effectively train the lab\npersonnel and achieve considerable energy savings. This latter would be than\nautomatically translated into GHG- emission reduction for the campus.\nBut it is also important to think ahead. Are there other fume hood systems that\ncan give at least the same savings but with less investment? Should the\nClaudia Cordie', Jiwoon Kim, Peldon Tshering, Randall Coffie\n\nClaudia Cordie', Jiwoon Kim, Peldon Tshering, Randall Coffie\nInstitution invest in Phoenix systems for the entire campus and rely on the\nsuccess (if any) of the training in building 18 to promote energy conservation?\nIn an attempt to answer these questions an Internet search brought us to a\nreport on the Berkeley Fume hood. The most interesting feature of this type of\nfume hood is that it works with lower face velocities that can be translated into\nless energy consumption.\n\n5.3 The Berkeley fume hood\n\n5.3.1 Introduction\nAccording to the Berkeley report conventional fume hoods rely solely on pulling\nair through the hood's open sash from the laboratory, around the worker, and\nthrough the hood workspace.\nThe generally accepted \"face velocity\" is around 100 feet per minute, depending\non hazard level. Interestingly, recent research shows that increasing face velocity\n(and, consequently, air volume and energy use) does not tend to improve\ncontainment. Instead, errant eddy currents and vortexes are induced in the hood\nand around hood users as airflows into the hood, reducing containment\neffectiveness and compromising worker safety (Figure 5.3 below).\nTypical fume hoods exhaust large volumes of air at great expense.\nFurthermore, the energy to filter, move, cool or heat, and in some cases scrub\n(clean) this air is one of the largest loads in most facilities and tends to drive the\nsizing (first cost) and energy use of the central heating, ventilating and air-\nconditioning systems in the buildings in which the hoods are located. Fume\nhoods are a major factor in making a typical laboratory four- to five-times more\nenergy intensive than a typical commercial building. A six-foot-wide hood\nexhausting 1200 cubic feet per minute, 24 hours per day, consumes 3.5-times\nmore energy than an average house.\nThis report further states that. the most common energy-efficient\nmodifications to traditional fume hoods are based on use of outside air (auxiliary\nair) or variable air volume (VAV) control techniques. While these approaches can\nsave energy, they are complicated and costly to implement and operate.\n\nClaudia Cordie', Jiwoon Kim, Peldon Tshering, Randall Coffie\nInnovation is hampered by various barriers stemming from existing fume hood\ntesting/rating procedures, entrenched industry practices, and ambiguous and\ncontradictory guidance on safe levels of airflow. These conditions make this\ntechnology area ripe for public interest research and development aimed at\nintroducing innovative alternatives to current practice.\n\n5.3.2 The proposed system\n\nTo address the shortcomings of existing approaches and to promote\ninnovation in the marketplace, Lawrence Berkeley National Laboratory (LBNL)\nhas developed and patented a promising new technology--The Berkeley Hood--\nthat reduces the hood's airflow requirements by up to 70 percent while enhancing\nworker safety by supplying most of the exhaust air between the hood's operator\nand work area\nThe LBNL containment technology uses a \"push-pull\" displacement airflow\napproach to contain fumes and move air through a hood (Figure 5.4).\n\nDisplacement air \"push\" is introduced with supply vents near the top and\nbottom of a hood's sash opening. Displacement air \"pull\" is provided by\nsimultaneously exhausting air from the back and top of the hood. These low-\nvelocity airflows create an \"air divider\" between an operator and a hood's\ncontents that separates and distributes airflow at the sash opening (unlike an air\ncurtain approach that uses high-velocity airflow). When the face of a hood is\nprotected by an airflow with low turbulent intensity, the need to exhaust large\namounts of air from the hood is largely reduced. The air divider technology is\nsimple, protects the operator, and delivers dramatic cost reductions in a facility's\nconstruction and operation.\n\n5.3.3 Benefits as presented in the report\n\nWhen cutting airflow by up to 70 percent in standard laboratory fume hood\ninstallations, we estimate that laboratories could save 8,000 Gigawatt-hours\n(GWh) of electricity demand annually, 1,900 megawatts of electrical peak\n\nClaudia Cordie', Jiwoon Kim, Peldon Tshering, Randall Coffie\ngenerating capacity, and 73 TBTUs in associated space-heating fuel (see the\nreport's appendix for further detail). This energy savings equates to about $1.2\nbillion per year, or $2,100/year per replaced hood.\nThe aforementioned savings include the ancillary benefits reduced energy\ncosts associated with pre-heating and -cooling the air provided to laboratories\n(Figure 5.5).\n\nBeyond ventilation reduction and associated energy savings, the Berkeley\nHood offers design features that deliver a range of benefits:\n\n- Simpler design than state-of-the-art variable air volume (VAV) fume hood\nsystems offers more certain energy savings, coupled with easier and less\nexpensive installations and maintenance.\n- Constant volume operation ensures energy savings are independent of\noperator interface.\n- Improved containment reduces dangerous airflow patterns, eddy currents,\nand vortexes.\n- Clean room air flowing, into the operator's breathing zone reduces\npotential hazard from fumes.\n- Thanks to lower fan power, offers robust peak-power savings, whereas\nother approaches to fume-hood efficiency do not.\n\nIn new construction projects, designers specifying the Berkeley Hood can\nachieve savings in energy, construction, and maintenance costs. While the\nBerkeley Hood itself is expected to have a direct first-cost premium over a\ncurrent standard hood, this cost can be offset with first-cost savings from smaller\nducts, fans, and central plants, as well as simpler control systems than those\nused for VAV, offering lower overall first cost than standard or VAV hood\nsystems.\nIn retrofit projects, Berkeley Hood users can receive critical HVAC system\nbenefits beyond energy savings. Many laboratories are \"starved\" for air as their\nneed for hoods has grown over the years. As a result, low supply or exhaust\n\nClaudia Cordie', Jiwoon Kim, Peldon Tshering, Randall Coffie\nairflows cause inadequate exhaust, in some cases, potentially leading to\ncontaminant spills from the hood. Since increasing supply airflow is very costly in\nmost cases, many laboratories cannot add new hoods. By replacing existing\nhoods with Berkeley Hoods, users can increase the number of hoods or improve\nexhaust performance, or both. The final result is improved research productivity,\nenhanced safety, and lower energy bills.\nThis represents an interesting option that MIT might consider for future\nrenovation and/or constructions, if it is really committed to the GHG-emission\nreduction plan of the Cambridge city.\n\n6. Recommendations\n\n6.1 The mental scheme\nFume hoods are required by law, for safety reasons. Energy efficiency on\nthe other hand is not required by law, making any effort to do so a beyond\ncompliance action. The fume hoods in building 18 are all equipped with the\nphoenix system that as mentioned before presents tremendous opportunities to\nsave energy. This latter can be translated into GHG-emissions reduction for the\ncampus. But as seen from the Duke and Berkley report the introduction of\ntechnologies like the phoenix system without the proper training in the use of the\nsystem will not provide the potential savings in energy consumption.\nIn the mental scheme below we present MIT's opportunity to effectively\nbenefit from the investment in the phoenix system as a gap that can be filled by\nthe provision of careful designed training to the lab personnel.\n\n\"Mental Scheme\"\nLab\nFume hood\nSafety\nUse\nEnergy\nEfficiency\n--Traditional\nTraditional\n--Each researcher is somehow aware of this.\nEach researcher is somehow aware of this.\n--Compliance (Required by law)\nCompliance (Required by law)\nFunding Grants\nProject Grants\nInstallation\n-Safety\n-Energy saving?\n--Beyond compliance/ cost saving\nBeyond compliance/ cost saving\nEHS Coordinator\nGap\n--Non\nNon--traditional Behavioral aspect\ntraditional Behavioral aspect\nDuke report\nLack of Training\n--Importance of training\nImportance of training\n--Environmental\nEnvironmental\n--Health\nHealth\n--Safety\nSafety\nLower GHG emission\nLower GHG emission\n\n6.2 Recommendations\nBy using the existing structure of the lab management we propose the\nfollowing recommendations:\n\n1. Pilot project for improving the behavioral aspect\nHaving fume hoods completely equipped with phoenix system like in\nbuilding 18 creates a big opportunity to set up a pilot project that aims at the\nconservation of energy through the proper use of the fume hoods:\nClaudia Cordie', Jiwoon Kim, Peldon Tshering, Randall Coffie\n\nClaudia Cordie', Jiwoon Kim, Peldon Tshering, Randall Coffie\n- A controlled area should be chosen in an area to do a similar study as\nthe one the Duke University conducted. The main difference should be\nthe non discrimination between a control and an experimental group.\n- Training should be provided to all the lab personnel by the EHS\ncoordinator(s) of the area. For this to work there must be a planning\ngroup consisting of all the stakeholders representatives of the lab.\n- Collaboratively they should design, implement and evaluate the pilot\nproject. The real challenge here will be how to sustain the behavioral\nchain.\n- For the latter we recommend to have a support system for the training\nby\nusing\nthe\nexisting\ncommunication\nnetwork\ntogether\nwith\ncomplementary visual aids (such as emails, meetings, posters,\nmagnets and so far and so on).\n- It is also fundamental in the implementation, to have a metering\nsystem in order to record the energy use and have historical data.\n- It is also important to create incentives schemes to engage the lab\nusers into the energy conservation project.\n- In addition, it is important to involve in the project people who are\npassionate in championing the cause.\n\n2. Improving the planning and operational process\n- In planning a project, such as building a new lab, the integration of the\ntotal cost is essential. This means taking into consideration, the life\ncycle costing and environmental cost in addition to the capital cost.\n- There is also the need to provide a clear communication means\nbetween the person(s) in charge of the lab and the maintenance staff\nof the lab. The needs of the lab-in-charge should be clear to the\nmaintenance staff in order to enable an effective service to attend\nthese needs.\n\n7. Conclusion\n\nClaudia Cordie', Jiwoon Kim, Peldon Tshering, Randall Coffie\nWe consider that it is crucial to have pilot projects because this can shed\nlight on pitfalls in the project. This will help to ensure success once the problem is\napplied on a larger scale.\nThe specific conditions of each wet lab should be taken into consideration\nin the application of the training program regarding energy conservation, rather\nthan a simple reproduction of earlier experiences with other labs.\nThe combination of the right use and the technology of fume hoods in a\nlaboratory represents a big opportunity to reduce energy consumption and\nthereby contributing to GHG reduction on MIT campus.\n\nClaudia Cordie', Jiwoon Kim, Peldon Tshering, Randall Coffie\n8. Acknowledgements\nWe would like to thank for their help:\n- Professors Davis Laws and Martin Rein\n- Steven Lanou\n- Peter Cooper\n- Walter Henry\n- Susan Leite\n- Jim Doughty\n- Richard Wilk\n- Julie Rebecca Paquette\n- Guest speakers\n- Panelists\n- Class mates\n\nClaudia Cordie', Jiwoon Kim, Peldon Tshering, Randall Coffie\n9. References\n\n- Clugston, R. M &W. Calder, (1999). Critical Dimensions of sustainability in\nhigher education, in Sustainability in higher education, W. Leal Filho\n,editor. Frankfurt am Main: Lang.15 pages.\n- Clugston, R. M & W. Calder, (2002) U.S. Progress Toward Sustainability\nin Higher Education, in Stumbling Toward Sustainability, Jhon C.\nDernbach, editor published by The environmental Law Institute.\n- Cortese, A. (1999) Education for Sustainability, the University as a model\nof sustainability, USA, Second Nature Education for Sustainability.\nhttp://www.secondnature.org/\n- City of Cambridge, M., C.D. Department, and E.T.P. Division. City of\nCambridge\nClimate\nProtection\nPlant\n(CCP).\n2002:\nCity\nof\nCambridge.http://www.cambridgema.gov~CDD/envirotrans/enviroplan/cli\nmate/\n- US EPA & DOE, Laboratory for the 21st century: an introduction to low-\nenergy, August 2000.\n- Consent Decree, MIT, 2001\n- MIT Campus building model, Stone &Webster Management consultants\nInc., 2003\n\nWEB SITES\nhttp://unfccc.int/2860.php\nhttp://www3.iclei.org/co2/ccpmems.htm\nhttp://www.labs21century.gov/\n\nClaudia Cordie', Jiwoon Kim, Peldon Tshering, Randall Coffie\nAppendix A\n\nPLANNING FOR SUSTAINABLE DEVELOPMENT COURSE\n\nQUESTIONNAIRE\n\nMale  Female \n\nQualification (grad. student., PhD, etc.) ........................................................\n\n1. Are you aware of the energy intensity of a lab space compared to a\nclassroom\nor office area?\n yes\n no\n\n2. Did you notice any measures that try to reduce the energy use in your lab?\n\n yes  no\n\nif yes, which ones? ........................................................................\n\n3. What are you doing to try to save energy in your lab?\n close the fume hoods as much as possible and keep them closed when not\nused\n keep the lights on only when needed\n I don't have time to think about saving energy\n Other (please specify)..................................................................\n................................................................................................\n................................................................................................\n\n4. Do you know the optimal use of the fume hood:\na) regarding to safety?  yes\n no\nb) regarding to energy?  yes\n no\n\n5. Do you have any suggestions on how to be more energy efficient in a lab?\n.....................................................................................................\n....................................................................................................\n....................................................................................................\n\nTHANKS A LOT FOR YOUR HELP!"
    },
    {
      "category": "Resource",
      "title": "Harvard Green Campus Initiative: Overview",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-366j-planning-for-sustainable-development-spring-2006/9d673943e3036afc18aa82c3aa90c049_jaclyn.pdf",
      "content": "Harvard Green Campus Initiative\nOverview\nApril 11, 2006\nJaclyn Emig\nLongwood Green Campus Initiative Program Coordinator\nENVR E-117 Spring 2006 | April 3 2006\n\nENVR E-117 Spring 2006 | April 3 2006\n- Introduction\n- Intro to Harvard Green Campus Initiative\n- Large Scale Behavior Change Programs\n- Case Studies\n- \"Shut the Sash\" Campaign in Labs\n- Sustainability Pledge Campaign\n- Green Living Programs\nAgenda\n\nHarvard Green Campus Initiative:\nOrganizational Chart\nDirector,\nLeith Sharp\nCo-Chair\nFaculty, Harvard School of\nPublic Health\nProf. Jack Spengler\nCo-Chair\nAssoc. VP, Facilities &\nEnvironmental Services\nTom Vautin\n\nFebruary\nManager, Communications, Finance & Admin.\nMaggie Husak\nFAS Campus Energy Reduction Program\nMaura Leahy\nFaculty of Arts & Sciences\nHarvard Real Estate Services\nHarvard Medical School,\nSchool of Public Health &\nDental School\nUniversity Operations\nServices\nWebmaster Sheldon Schwartz\nManager, High Performance Building Service\nMichael Crowley\nLongwood Campus Energy Reduction Program.\nJaclyn Emig\nHPBS, Program Coordinator Nathan Gauthier\nManager, Undergraduate Green Living Program\nAllison Rogers\nHGCI Course at Harvard\nExtension School:\nSustainability - The\nChallenge of Changing Our\nInstitutions\nOffered by Distance & Classroom\nUniversity Dining Services\nClients and Partners:\nHPBS, Research Assistant Andrea Ruedy\nHarvard Business School\nDirector, Harvard\nGreen Campus\nInitiative\nLeith Sharp\nCo-Chair\nAssoc. VP, Facilities\n& Environmental\nServices\nTom Vautin\nCo-Chair\nFaculty, Harvard\nSchool of Public\nHealth\nProf. Jack Spengler\nHarvard Law School\nManager, Graduate Green Living Program\nMeryl Brott\n38 part-time student employees\nSpecial Projects Assistant Gosia Sklodowska\nHigh Performance Building Service\nHPBS, Project Assistant Jesse Foote\nResidential Green Living Programs\nGreen Laboratory Programs\nHGCI Core Staff\n3418% Funded through Office of\nPresident and Provost\n3482% Funded through fee for\nservice partnerships\nOperating Cost = $1,000,000 pa.\nAnnual Savings = $3 million\n& over 40 million pounds of CO2\nHarvard School of Education\nAllston Development Group\n\nHarvard's Decentralized Nature\nEvery tub on its\nown bottom?\n\nGreen Campus Programs\nExisting Buildings\n- Conservation Projects\n- Green Loan Fund\n- Peer to Peer Training Programs\nNew Construction & Renovation\nOccupant Behavior Change\n- Labs\n- Green Living Programs\n- Large Scale Behavior Change\nGreenhouse Gas Inventory\nRenewable Energy\nTraining and Education\n\nharvard green campus initiative | high performance building services\nHGCI high performance building services\nBuilding Assessments\n- Building management profiles\n- Building performance analyses\n- Identification of efficiency project\n- Analysis of rebates & loan fund\n- Behavioral change opportunities\nPeer to Peer Training\n- Lighting\n- HVAC\n- Commissioning\n- Water Conservation/Efficiency\n- Procurement\n- Building Envelope\nLEED Project Management\n- Design Charrette Facilitation\n- LEED Administration\n- Research Support\nCurrent LEED Projects\n- 3 Certified Projects\n- 8 Registered Projects\n\nLEED Projects\n3 LEED Certified Projects\n- 1 Western Avenue (Silver Rating, New Construction,\n- Landmark Center (Certified Rating, Commercial\nInteriors, Pilot Project)\n- Schlessinger Library\n8 LEED Registered Projects\n- Blackstone Redevelopment\n- 90 Mt. Auburn Street\n- Hamilton Hall\n- Dunster/ Mather House Dinning Halls\n- 888 Memorial Drive\n- Banks, Cowperwaithe, Grant Street\n- 60 Oxford Street\n\nharvard green campus initiative | high performance building services\nGreen Campus Loan Fund\n- $3 million interest-free revolving loan fund\n- Available to Harvard Schools and Departments\n- A financial incentive for energy, water & resource optimization\n- Funded through the offices of the University President and Provost\n- Eligible projects: *5-year payback* Feasibility Studies * Photovoltaics\nOverview\n36 month Performance\n- Over $3 million invested in 41 projects\n- ROI = 32.6%\n- Annual GHG Reduction = 2% of 2001 emissions\n- 16,424,453 lbs of CO2\n- 7,278,498 gallons of water\n- 200,000 lbs of waste diverted\n\nHarvard Green Campus Initiative, Longwood Campus\nSustainability Principles\nThe Harvard Principles of Sustainability for\nCampus Planning and Operations\n\"\"Operating our campus in an environmentally sustainable way is not only\nthe right thing to do as a citizen and neighbor, it is also an economically\nsound way to conduct our business. As we plan for the future, these\nprinciples will set a strong course that will benefit Harvard and promote\nresponsible growth and environmental quality in our community.\"\nPresident Lawrence H. Summers, Harvard University\n\nLarge Scale\nBehavior Change Programs\n\nENVR E-117 Spring 2006 | April 3 2006\nAccording to the EPA Individuals can affect\n32% of personal ghg emissions through\nelectricity use, waste, and transportation choices!\nIndividual Impacts\n\nENVR E-117 Spring 2006 | April 3 2006\n- If all 8,000 computers on the Longwood\ncampus are left on all the time we spend\n$260,000 per year in wasted electricity.\n- For every degree you turn down the temp\non your thermostat you can save 2-3% of\nyour heating costs (energystar.gov)\nSmall Actions Add Up\n\nENVR E-117 Spring 2006 | April 3 2006\nOur Goals\n- Change behaviors\n- Build life-long habits and\nunderstanding\n- Raise environmental awareness\n- Build a culture of sustainability\n- Get people involved and\ninspired\nOur Campaigns\n\nENVR E-117 Spring 2006 | April 3 2006\nOur Campaigns\nWhat goes into campaigns?\nPartnerships and Relationships\n- Human Resources\n- Information Tech\n- Student Affairs,\n- Residential Assists.\n- Dept Heads,\n- Operations Staff\n- Administrators\n- Building Managers\n- Staff\n- Students\nFind the champions\n\nENVR E-117 Spring 2006 | April 3 2006\nOur Campaigns\nWhat goes into campaigns?\nKnowledge of the Organization\n- Existing communication venues\n- Decision-makers\n- Organizational Culture\n- Building Operations\n\nENVR E-117 Spring 2006 | April 3 2006\nOur Campaigns\nWhat goes into campaigns?\nEnvironmental Expertise\n- Understand the issues\n- Research project ideas, environmental\nimpacts and benefits\n\nENVR E-117 Spring 2006 | April 3 2006\nOur Campaigns\nWhat goes into campaigns?\nCreativity and Enthusiasm\n\nENVR E-117 Spring 2006 | April 3 2006\nOur Campaigns\nWhat goes into campaigns?\n- Partnerships and Relationships\n- Knowledge of the Organization\n- Information and Expertise\n- Creativity and Enthusiasm\n- Social Marketing Tools\n- Communication Skills\n\nCommunity-Based Social\nMarketing (CBSM)\nSource:\nENVR E-117 Spring 2006 | April 3 2006\n\nENVR E-117 Spring 2006 | April 3 2006\nCommunity-Based Social\nMarketing (CBSM)\nFostering Sustainable Behavior\nby Doug McKenzie-Mohr and William Smith\nCommunity-Based Social\nMarketing\nSocial Sciences research shows that\nINFORMATION alone is not always\nenough to influence BEHAVIOR\n\nENVR E-117 Spring 2006 | April 3 2006\nCommunity-Based Social\nMarketing\nSource: Fostering Sustainable Behavior by Doug McKenzie-Mohr and William Smith\nKey Steps\nStep 1: ID Barriers & Benefits\nStep 2: Develop Program using Proven Tools\nStep 3: Run a Pilot, Evaluate\nStep 4: Implement\nStep 5: Continuously Monitor and Adapt\n\nENVR E-117 Spring 2006 | April 3 2006\nCommunity-Based Social\nMarketing\nKey Steps\nStep 1: ID Barriers &\nBenefits\nStep 2: Use Proven Tools\nStep 3: Run a Pilot and Evaluate\nStep 4: Implement\nStep 5: Continuously Monitor & Adapt\n- Internal &\nexternal\n- Research\n- Focus Groups\n- Surveys\n- Stakeholders\nmake it\nconvenient!\n\nENVR E-117 Spring 2006 | April 3 2006\nCommunity-Based Social\nMarketing\nSource: Fostering Sustainable Behavior by Doug McKenzie-Mohr and William Smith\nKey Steps\nStep 1: ID Barriers & Benefits\nStep 2: Use Proven Tools\nStep 3: Run a Pilot and Evaluate\nStep 4: Implement\nStep 5: Continuously Monitor & Adapt\n- Commitment\n- Prompts\n- Norms\n- Communication\n- Incentives\n\nENVR E-117 Spring 2006 | April 3 2006\nCommunity-Based Social\nMarketing\nSource: Fostering Sustainable Behavior by Doug McKenzie-Mohr and William Smith\nKey Steps\nStep 1: ID Barriers & Benefits\nStep 2: Use Proven Tools\nStep 3: Run a Pilot &\nEvaluate\nStep 4: Implement\nStep 5: Continuously Monitor & Adapt\n- Test your\nstrategies\n- Measure results\nwith quantitative\ndata\n- Evaluate and\nadjust\n\nENVR E-117 Spring 2006 | April 3 2006\nCommunity-Based Social\nMarketing\nSource: Fostering Sustainable Behavior by Doug McKenzie-Mohr and William Smith\nKey Steps\nStep 1: ID barriers & benefits\nStep 2: Use Proven Tools\nStep 3: Run a Pilot & Evaluate\nStep 4: Implement\nStep 5: Continuously monitor & adapt\n\nENVR E-117 Spring 2006 | April 3 2006\nCommunity-Based Social\nMarketing\nSource: Fostering Sustainable Behavior by Doug McKenzie-Mohr and William Smith\nKey Steps\nStep 1: ID Barriers & Benefits\nStep 2: Use Proven Tools\nStep 3: Run a Pilot & Evaluate\nStep 4: Implement\nStep 5: Continuously\nmonitor & adapt\n- Continue to\nmonitor and\nfollow results\n- Be flexible\nComparing Computer Monitor Use 03/04:\nWhat Percentage of People Turn Them Off? Leave Them\nUse Sleep Software?\n53%\n7%\n13%\n14%\n34%\n80%\n0%\n10%\n20%\n30%\n40%\n50%\n60%\n70%\n80%\n90%\nmo\nmo\nmo\nsta\nmo\n\nENVR E-117 Spring 2006 | April 3 2006\nTools for Behavior Change\n34 Commitment\n34 Prompts\n34 Norms\n34 Communication Strategies\n34 Incentives\nStep 2: Use Proven Tools\n\nENVR E-117 Spring 2006 | April 3 2006\nTools of Behavior Change\nCommitment\n- Alters self-perception\n- Consistency\nTIPS:\n- written\n- make it public\n- actively involve people\n- group commitments\n\nTools of Behavior Change\nPrompts\nReminder to trigger\nbehavior\nTIPS:\n- Close to the point of action\n- Eye catching and noticeable\n- Clear instruction\n\nENVR E-117 Spring 2006 | April 3 2006\nTools of Behavior Change\nNorms\nTIPS\n- Visible to the community\n- Personal, Community oriented\n- Encourage positive behavior\n- People want to be seen\ndoing the right thing\n- Strong social pressures\n\nENVR E-117 Spring 2006 | April 3 2006\nTools of Behavior Change\nTIPS:\n- Make it visible\n- Consider\n- non-monetary\n(recognition, competition)\n- Closely pair the incentive\nand the behavior\nIncentives\nMotivation\n\nENVR E-117 Spring 2006 | April 3 2006\nTools of Behavior Change\n- Use simple,\nclear instructions\nCommunication\nStrategies\n\nENVR E-117 Spring 2006 | April 3 2006\nTools of Behavior Change\n- Use language that\nthat is understood by\nthe audience\nCommunication\nStrategies\nMany fume\nhoods use the\nsame amount of\nenergy as 3 12\nhouses!*\n\nENVR E-117 Spring 2006 | April 3 2006\nTools of Behavior Change\n- Use Personal contact\n- Use a credible source\n- Use community level\noutreach\nCommunication\nStrategies\n\nTools of Behavior Change\nCommunication\nStrategies\n- Provide Feedback\n- Enhance community\nnorms\n\nENVR E-117 Spring 2006 | April 3 2006\nTools of Behavior Change\n- Make it easy to\nremember\n- Tailor your message to\nyour audience\nCommunication\nStrategies\n\nCase Study #1\n\"Shut the Sash\" Campaigns in\nthe Labs\nSource:\nENVR E-117 Spring 2006 | April 3 2006\n\nFAS (College, Graduate\nSchool): 260 buildings,\n40% total Harvard by ft2,\n14,386 students/staff/faculty\nLongwood (Medical, Public\nHealth, Dental): 33 buildings,\n12% total,\n5,219 students/staff/faculty\nMany different building\ntypologies: From huge,\nultra-modern labs to 18th\ncentury houses converted to\noffice space, and everything\nin between.\nHarvard Green Campus Initiative | Campus Energy Reduction Program\n\nLabs use 3-5x\nmore energy per\nft2 than typical\noffice buildings.\nHarvard Green Campus Initiative | Campus Energy Reduction Program\n\nStep 1: Research\nChemical fume hoods:\n- Each costs about\n$3K/year to operate,\n- Harvard has nearly\n1000 of them.\n- Shutting the sash on\nsome models reduces\nenergy loss.\nHarvard Green Campus Initiative |\n\nStep 2. ID & Work With Stakeholders\nResearchers\nHGCI\nResearch\nDirector\nLab Director\nBuilding\nManager\nLab Admins.\nSchool\nAdmin.\nEH&S\nPIs\nSASH\nCAMPAIGN\n\n3. ID Barriers\n\"I thought we were supposed to keep it at 18 inches!\"\n\"You mean this thing uses a lot of energy?\n\"Umm, I just forgot.\"\n\"It'll never work.\"\nHarvard Green Campus Initiative | Campus Energy Reduction Program\n\nStep 4: Develop the Campaign\nPilot Project: Warren\nAlpert Building, HMS\nHarvard Green Campus Initiative | Campus Energy Reduction Program\n\nStep 4: Develop the Campaign\nPrompts\nHarvard Green Campus Initiative | Campus Energy Reduction Program\nMany fume\nhoods use the\nsame amount of\nenergy as 3 12\nhouses!*\n\nStep 4: Develop the Campaign\nIncentives and Clear Communication\nHarvard Green Campus Initiative | Campus Energy Reduction Program\n\nCommunication!\n- In person (walkthroughs)\n- Emails announcements\n- Group meetings\n- Helpful students & staff\n- Posters and flyers\n- Mandate from PIs, administration\nHarvard Green Campus Initiative | Campus Energy Reduction Program\n\nStep 5. Tracking and Monitoring\nAverage CFM per hood by lab, 8/25-8/29\nThursday\nFriday\nSaturday\nSunday\nMonday\n< > D a te T im e P o in t_ 1 P o in t_ 2 P o in t_ 3 P o in t_ 4\n9 /2 8 /2 0 0 5 0 0 :0 0 :0 0 2 3 6 4 .2 8 8 0 0 0 .0 0 9 9 5 .0 0 5 4 0 0 .0 0\n9 /2 8 /2 0 0 5 0 0 :3 0 :0 0 1 3 8 7 .7 3 8 0 0 0 .0 0 9 9 5 .0 0 5 4 0 0 .0 0\n9 /2 8 /2 0 0 5 0 1 :0 0 :0 0 1 4 9 0 .5 2 8 0 0 0 .0 0 9 9 5 .0 0 5 4 0 0 .0 0\n9 /2 8 /2 0 0 5 0 1 :3 0 :0 0 1 4 4 7 .6 9 8 0 0 0 .0 0 9 9 5 .0 0 5 4 0 0 .0 0\n9 /2 8 /2 0 0 5 0 2 :0 0 :0 0 1 4 4 7 .6 9 8 0 0 0 .0 0 9 9 5 .0 0 5 4 0 0 .0 0\n9 /2 8 /2 0 0 5 0 2 :3 0 :0 0 1 4 3 0 .5 6 8 0 0 0 .0 0 9 9 5 .0 0 5 4 0 0 .0 0\n9 /2 8 /2 0 0 5 0 3 :0 0 :0 0 1 4 1 3 .4 3 8 0 0 0 .0 0 9 9 5 .0 0 5 4 0 0 .0 0\n9 /2 8 /2 0 0 5 0 3 :3 0 :0 0 1 4 4 7 .6 9 8 0 0 0 .0 0 9 9 5 .0 0 5 4 0 0 .0 0\n9 /2 8 /2 0 0 5 0 4 :0 0 :0 0 1 5 0 7 .6 6 8 0 0 0 .0 0 9 9 5 .0 0 5 4 0 0 .0 0\n9 /2 8 /2 0 0 5 0 4 :3 0 :0 0 1 4 3 0 .5 6 8 0 0 0 .0 0 9 9 5 .0 0 5 4 0 0 .0 0\n9 /2 8 /2 0 0 5 0 5 :0 0 :0 0 1 5 4 1 .9 2 8 0 0 0 .0 0 9 9 5 .0 0 5 4 0 0 .0 0\n9 /2 8 /2 0 0 5 0 5 :3 0 :0 0 1 4 0 4 .8 6 8 0 0 0 .0 0 9 9 5 .0 0 5 4 0 0 .0 0\n9 /2 8 /2 0 0 5 0 6 :0 0 :0 0 1 5 5 9 .0 5 8 0 0 0 .0 0 9 9 5 .0 0 5 4 0 0 .0 0\n9 /2 8 /2 0 0 5 0 6 :3 0 :0 0 1 4 1 3 .4 3 8 0 0 0 .0 0 9 9 5 .0 0 5 4 0 0 .0 0\n9 /2 8 /2 0 0 5 0 7 :0 0 :0 0 1 5 2 4 .7 9 8 0 0 0 .0 0 9 9 5 .0 0 5 4 0 0 .0 0\n9 /2 8 /2 0 0 5 0 7 :3 0 :0 0 1 5 3 3 .3 5 8 0 0 0 .0 0 9 9 5 .0 0 5 4 0 0 .0 0\n9 /2 8 /2 0 0 5 0 8 :0 0 :0 0 1 4 3 9 .1 3 8 0 0 0 .0 0 9 9 5 .0 0 5 4 0 0 .0 0\n9 /2 8 /2 0 0 5 0 8 :3 0 :0 0 1 5 4 1 .9 2 8 0 0 0 .0 0 9 9 5 .0 0 5 4 0 0 .0 0\n9 /2 8 /2 0 0 5 0 9 :0 0 :0 0 1 4 9 0 .5 2 8 0 0 0 .0 0 9 9 5 .0 0 5 4 0 0 .0 0\n9 /2 8 /2 0 0 5 0 9 :3 0 :0 0 1 4 3 0 .5 6 8 0 0 0 .0 0 9 9 5 .0 0 5 4 0 0 .0 0\n9 /2 8 /2 0 0 5 1 0 :0 0 :0 0 1 5 2 4 .7 9 8 0 0 0 .0 0 9 9 5 .0 0 5 4 0 0 .0 0\n9 /2 8 /2 0 0 5 1 0 :3 0 :0 0 1 5 6 7 .6 2 8 0 0 0 .0 0 9 9 5 .0 0 5 4 0 0 .0 0\n9 /2 8 /2 0 0 5 1 1 :0 0 :0 0 1 4 0 4 .8 6 8 0 0 0 .0 0 9 9 5 .0 0 5 4 0 0 .0 0\n9 /2 8 /2 0 0 5 1 1 :3 0 :0 0 1 4 1 3 .4 3 8 0 0 0 .0 0 9 9 5 .0 0 5 4 0 0 .0 0\n9 /2 8 /2 0 0 5 1 2 :0 0 :0 0 1 3 2 7 .7 6 8 0 0 0 .0 0 9 9 5 .0 0 5 4 0 0 .0 0\n9 /2 8 /2 0 0 5 1 2 :3 0 :0 0 1 3 1 9 .2 0 8 0 0 0 .0 0 9 9 5 .0 0 5 4 0 0 .0 0\n9 /2 8 /2 0 0 5 1 3 :0 0 :0 0 1 4 3 9 .1 3 8 0 0 0 .0 0 9 9 5 .0 0 5 4 0 0 .0 0\n9 /2 8 /2 0 0 5 1 3 :3 0 :0 0 1 4 0 4 .8 6 8 0 0 0 .0 0 9 9 5 .0 0 5 4 0 0 .0 0\n9 /2 8 /2 0 0 5 1 4 :0 0 :0 0 1 4 3 0 .5 6 8 0 0 0 .0 0 9 9 5 .0 0 5 4 0 0 .0 0\n9 /2 8 /2 0 0 5 1 4 :3 0 :0 0 1 4 8 1 .9 6 8 0 0 0 .0 0 9 9 5 .0 0 5 4 0 0 .0 0\n9 /2 8 /2 0 0 5 1 5 :0 0 :0 0 1 4 8 1 .9 6 8 0 0 0 .0 0 9 9 5 .0 0 5 4 0 0 .0 0\n9 /2 8 /2 0 0 5 1 5 :3 0 :0 0 1 5 5 0 .4 9 8 0 0 0 .0 0 9 9 5 .0 0 5 4 0 0 .0 0\n9 /2 8 /2 0 0 5 1 6 :0 0 :0 0 1 4 9 0 .5 2 8 0 0 0 .0 0 9 9 5 .0 0 5 4 0 0 .0 0\n9 /2 8 /2 0 0 5 1 6 :3 0 :0 0 2 3 0 4 .3 1 8 0 0 0 .0 0 9 9 5 .0 0 5 4 0 0 .0 0\n9 /2 8 /2 0 0 5 1 7 :0 0 :0 0 2 3 3 8 .5 8 8 0 0 0 .0 0 9 9 5 .0 0 5 4 0 0 .0 0\n9 /2 8 /2 0 0 5 1 7 :3 0 :0 0 1 6 4 4 .7 1 8 0 0 0 .0 0 9 9 5 .0 0 5 4 0 0 .0 0\n9 /2 8 /2 0 0 5 1 8 :0 0 :0 0 2 2 3 5 .7 8 8 0 0 0 .0 0 9 9 5 .0 0 5 4 0 0 .0 0\n9 /2 8 /2 0 0 5 1 8 :3 0 :0 0 2 2 9 5 .7 5 8 0 0 0 .0 0 9 9 5 .0 0 5 4 0 0 .0 0\nGround\n8/24\n1527.49\n12812.09\n15469.62\n11152.39\n9/14\n1508.67\n11520.43\n14499.04\n12361.57\n10/5\n1491.671\n6824.466\n11881.5\n8289.189\n11/22\n1455.093\n7060.528\n9984.979\n8567.781\n12/13\n1580.437\n8404.878\n11265.73\n9495.324\n1/13\n1482.83\n8690.201\n12416.92\n9935.308\n3/7\n1455.055\n9856.145\n10868.83\n10233.16\nHarvard Green Campus Initiative | Campus Energy Reduction Program\n\n0.00%\n2.00%\n4.00%\n6.00%\n8.00%\n10.00%\n12.00%\nSept. 14\nSept. 15\nSept. 16\nSept. 17\nSept. 18\nSept. 19\nSept. 20\nKahne/Walker\nMyers\nKishi\nNaito Fume Hood Exhaust, August 24 - November 1\n8/24\n8/31\n9/7\n9/14\n9/21\n9/28\n10/5\n10/12\n10/19\n10/26\n11/2\n11/9\n11/16\n11/23\nAverage weekly CFM\nContest begins\nContest ends\nNovember 28\nNAITO BUILDING FUME HOOD CONTEST STANDINGS *\n*MacBeath and Zhuang coming soon!\nFrequent\nUpdates\nHarvard Green Campus Initiative | Campus Energy Reduction Program\n\nResults\nHMS Pilot: $24,000 and 300,000 lbs. CO2\nFrom 30% sashes closed to 80% closed\nTotal after 6 campaigns:\n-$209,879 Savings per year\n- 2,260,535 lbs. CO2\n- 222 cars off the road\n- Electricity use of 132 households\nOther Results:\n- Reached out to hundreds of lab users\n- Worked with EH&S,\nHarvard Green Campus Initiative | Campus Energy Reduction Program\n\nStep 6: Continued Monitoring and\nImprovement\n5,000\n10,000\n15,000\n20,000\n25,000\n30,000\n35,000\n40,000\n45,000\n50,000\n8/24/2005\n8/31/2005\n9/7/2005\n9/14/2005\n9/21/2005\n9/28/2005\n10/5/2005\n10/12/2005\n10/19/2005\n10/26/2005\n11/2/2005\n11/9/2005\n11/16/2005\n11/23/2005\n11/30/2005\n12/7/2005\n12/14/2005\n12/21/2005\n12/28/2005\n1/4/2006\n1/11/2006\n1/18/2006\n1/25/2006\n2/1/2006\n2/8/2006\n2/15/2006\n2/22/2006\n3/1/2006\n3/8/2006\nCFM\nContest begins\nContest ends\nMarch 8, 2006\nHarvard Green Campus Initiative | Campus Energy Reduction Program\n\nTHIS HOOD SASH WAS LEFT OPEN OVERNIGHT.\nClosing it would save $1,500 a year (enough to heat an average\nhome) and 10,600 pounds of CO2 emissions.\nA closed hood is also safer for you and others in the lab.\nPlease remember to shut the sash.\nThank you!\n___________________________________________\nJerry Connors/Mike Paterno\nDate\nHarvard Green Campus Initiative | Campus Energy Reduction Program\n\nCase Study #2:\nHarvard Campus Sustainability Pledge\nHarvard Green Campus Initiative | Campus Energy Reduction Program\n\nOnline Pledge Campaign\n- Commitment\n- Competition\n- Meaningful\nincentive\n- Community effort\n- Environmental\nethics\nHarvard Green Campus Initiative | Campus Energy Reduction Program\n\nHarvard Green Campus Initiative | Campus Energy Reduction Program\n\nHarvard Green Campus Initiative | Campus Energy Reduction Program\n\nCommunication Strategies\nHarvard Green Campus Initiative | Campus Energy Reduction Program\n- Champions within buildings\n- Posters to department\nadministrators\n- List-serves, emails from\ndepartment heads\n- Gazette, Crimson, HR newsletter\n- REPs\n- Pledge cards to all faculty\n- Tabling in dining halls\n\nPledge Results\n- 4300+ people signed\n- 20 buildings reached the 50%\nchallenge\n- 4 million kWh of wind energy\npurchased\n- 6.5 million lbs. of greenhouse\ngas emissions offset\n(equivalent to 500 cars)\nDudley\n88.9%\nPhillips Brooks\n86.7%\n60 JFK\n81.8%\nGeology\n78.4%\nMassachusetts\n77.1%\nGund Hall\n76.5%\nHoffman\n75.4%\nKirkland\n68.6%\nMorton Prince\n66.7%\nCabot\n56.1%\nQuincy\n54.0%\nMusic\n50.9%\nLeverett\n50.8%\n1705 Mass Ave\n50.0%\n77 Dunster\n50.0%\nTMEC\n55%\nGordon Hall\n53%\n160/164 Longwood\n63%\nCountway Library\n57%\nShattuck House\n72%\nKresge (bldg. 3)\n64%\nHarvard Green Campus Initiative | Campus Energy Reduction Program\n\n\"I ask you to\nremember and uphold\nthe pledge you took to\nwork toward a greener\ncampus.\"\n-Email to Massachusetts Hall staff\nfrom Harvard president\nLawrence Summers, 12/6/05.\nHarvard Green Campus Initiative | Campus Energy Reduction Program\n\nWhat have we learned?\n-The CBSM tools are very helpful!\n- Who needs to be involved? Figure\nthis out early on.\n- Identify and heavily utilize existing\nchannels of communication\n- People like competition\n- Updates on progress keep people\nengaged\n- You need to stay involved after the\ncampaign\nHarvard Green Campus Initiative | Campus Energy Reduction Program\n\nGreen Living Programs at\nGreen Living Programs at\nHarvard University\nHarvard University\nResource Efficiency Program\nGraduate Green Living Program\n\nREP is a unique peer environmental\neducation program. REP is a true\ncollaboration between students and the\nadministration. Student \"REPresentatives\"\nare paid to communicate with other students\nin their residential communities and act as a\nliaison between students and administrators\nabout sustainability, comfort, health,\nconservation, and efficiency issues inside the\ndorms.\nFAS Resource Efficiency Program (REP)\nWhat is REP?\n\nOverview of REP\n2 Student Co-Captains\n1 Program Coordinator\n13 Upperclass Dorm Reps\n(employees)\nResident\nFaculty\n3 First-Year Area Reps &\n1 Yard Frosh Captain\n(employees)\nDining\nServices\n= $\nHarvard College\nEnvironmental\nAction\nCommittee\nHarvard\nGreen\nCampus\nInitiative\nHarvard\nRecycling &\nWaste\nMgmt\nFAS\nOffice of\nPhysical\nResources\n\nGraduate Green\nGraduate Green\nLiving Programs\nLiving Programs\n\nGraduate Green Living Programs\nHarvard Real Estate Services - 3 apartment complexes (1,800\ntenants)\nHarvard Law School - 8 dorms (700 students)\nHarvard Business School - 4 dorms (350 students)\n\nGrad Green Living Program Goals\n1) Electricity & Steam Consumption:\nReduce by 10%\n2) Water Consumption:\nReduce by 10%\n3) Recycling:\nIncrease by 30 - 40%\n4) Reduction in maintenance and repair\ncalls due to better occupant education.\n\nWhat a Rep does...\nThe Rep will\nThe Rep will...\n...\n-act as a leader and example for the whole House or Yard to follow\n-create awareness about conservation & environmental issues on campus\n-initiate actions to \"green\" areas of the campus, creatively finding ways to\napproach each possible project\n-act as a resource for students' questions and giving them the information they\nneed on how to conserve\n-foster a sense of community within the house as well as a sense of competition\nbetween the houses\n-foster a sense of house (or dorm) pride in keeping the house \"green\"\n-give up-to-date eco-facts & statistics to the students, creating interest and care\n\nAnnual Waste Audit\nAnnual Waste Audit\n\nWaste Audit Results\n0%\n20%\n40%\n60%\nHBS\nSFP/OWA\nPbdy Terr\nHLS\n% of Total Waste\nreusables\ncans & bottles\npaper/cardboard\n\nRecycling\nRecycling\n\nGreen Cup and\nGreen Cup and\nOther Competitions\nOther Competitions\n\nEnergy\nCompetition 2006*\nChase vs. Gallatin vs. Morris vs. McCulloch\nSave the most energy\nduring February and Win\na Finale Dessert Party of\nMovie Tickets for your\ndorm!\n* An HBS tradition since\n\nEnviroCitizens\nEnviroCitizens\n\nMather's\nFirst-Ever\nENVIRO\nENVIRO\nCITIZEN!!!\nCITIZEN!!!\nA TRUE\nRecycling\nGreen Machine!\n\nModel Dorm Room\nModel Dorm Room\n\nEco Study Breaks &\nEco Study Breaks &\nOther Social Events\nOther Social Events\n\n...\n... and much more!\nand much more!\n\nWhy has REP been successful?\n-Strong partnership between students & administration\n- Coordination of efforts between departments (Harvard\nRecycling, Office of Physical Resources, etc.) and between\nstudents' environmental work on campus\nREP's Impact on Campus\n-Paid students lead to higher accountability than volunteers\n-One \"visible\" face within the dorms enables students to feel okay about asking\nquestions and seeking out answers from their fellow student Rep\n-Ability to institutionalize sustainability efforts on campus\n-Behavioral change/educational campaigns have an impact on daily life not just within\nthe dorms, but everywhere the educated students interact (in the classroom, athletics,\noff-campus, after graduation), creating a culture of change across the campus\n\nContact Info & Questions\nJaclyn Emig\nCoordinator, Longwood Campus Program\nVisit our new website for information and resources\nabout all our programs at\nhttp://www.greencampus.harvard.edu"
    },
    {
      "category": "Resource",
      "title": "Problem to Solution(s): Change Agency Competencies",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-366j-planning-for-sustainable-development-spring-2006/eb8a7ce09e37ea0d5e5a19a13bbed58b_laxmi.pdf",
      "content": "Problem to Solution (s)\nChange Agency\nCompetencies\nLaxmi Rao\nPlanning for Sustainable Development\nApril 12, 2006\n\nFrom Problem to Sustainable Solution\nChange\nAgents\nSolution\nProblem\nLoss of energy from use\nof Swing doors\nUse Revolving doors\n\nEnterprise Solutions - Monolithic ?\nProblem\n\nSolution Community\nEnd User\nFacilitator\nPolicy Maker\nSenior Management ( Resource Releasers)\n\nEnterprise Solutions - Distributed\nDisabilities Act Policy\nEnergy Buyer\nAesthetics Manager\nEnd User\nProblem\nSignage\n\nEnterprise Solutions - Distributed &\ncentrally co-ordinated\nBranding, resolving issues\nstaying the course\n\nSolution Approaches\nDRIVING from the Top\nGROWING from the Bottom\nWORKING in the Trenches\nCREATING VALUE with Prototypes & Pilots\nBLESSINGS from the Top\n\nMotivation\nWhat's in it for the Solution Community ?\nAlignment with SHORT term goals\nFlexibility to meet a variety of needs\nScalability\nMaintainability (sustainability)\nLimelight\n\nCompetency- Organizational Awareness\nThe POLITICS OF IT ALL\nKnow established policies and procedures\nUnderstand the culture\nAsess the impact of the solution\nKnow how to use organization to achieve\nobjectives\nStrategically position the solution in relation\nto enterprise goals\n\nCompetency- Communications\nCommunicate tactfully yet candidly\nClarify information as needed\nInterpret verbal and non-verbal messages\nProduce clear short reports\n\nCompetency - Influencing Others\nAbility to undertake continual\nadjustments with Solution Community\n(stakeholders) in a persuasive manner,\nto keep the solution on course by use of\npositive win/win negotiation\n\nCompetency - Building Relationships\nBuild and use cross-functional relationships\nFRIENDS in high places\nPARTNER in the trenches\nALLIES of your cause"
    }
  ]
}