{
  "course_name": "Playwriting I",
  "course_description": "This class introduces the craft of writing for the theater. Through weekly assignments, in class writing exercises, and work on a sustained piece, students explore scene structure, action, events, voice, and dialogue. We examine produced playscripts and discuss student work. This class’s emphasis is on process, risk-taking, and finding one’s own voice and vision.",
  "topics": [
    "Fine Arts",
    "Performance Arts",
    "Theater",
    "Humanities",
    "Literature",
    "Creative Writing",
    "Drama",
    "Fine Arts",
    "Performance Arts",
    "Theater",
    "Humanities",
    "Literature",
    "Creative Writing",
    "Drama"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 3 hours / session\n\nCourse Description\n\nIntroduction to Playwriting is dedicated to process. Students learn to write plays by writing plays. The primary goal of the course is to encourage students to write quickly, fluidly, and fearlessly. Students will write one 10 minute play (approximately 10 pages) each week, or a 10 page scene which will be outlined in an assignment. Our emphasis is on experimentation and process.\n\nThe course will introduce the traditional approach to theatre which is rooted in character and narrative structure, with emphasis on a play's arc through its beginning, turning point, and ending. In class exercises are designed to circumvent students' first lines of defense, to silence the negative editor voice, to experience trusting first instincts, and to encourage students to write both visually and concretely. Each week's assignment will introduce another element of craft, including high and low context dialogue, revealing action, the power of the unspoken word, disrupted ritual, etc.\n\nAfter a session devoted to the ground rules of giving and receiving constructive feedback, work is read in class and the group responds. Character maps, clustering, storytelling from personal experience, and monologues are the starting points. Reading is a component; a short play or scene by a contemporary playwright will be read and discussed each week in class. These plays introduce students to the wide world of individual voices and styles, from David Ives' comic, \"Sure Thing,\" to Jose Rivera's poetic magical realism, \"The Winged Man,\" to Donald Margulies carefully orchestrated, \"Last Tuesday.\"\n\nRewriting follows feedback. The process may also include seminars with guest playwrights and seeing local productions. The final project of the semester will be a reading of the completed plays.\n\nWriting Requirements/Final Projects\n\nYou will write a 10 minute play (approximately 10 pages) each week this semester\nor\na 10 page scene which will be outlined in an assignment. Your final project can be\neither\n:\n\nOne (1) expanded 10 minute play (a long one act of 20-30 pages)\nor\n\nTwo to three (2-3) polished 10 minute plays. These would be 2nd or 3rd drafts of plays you have written during the course of the semester.\n\nWriting Goals\n\nYour goal should be to write between 10 and 15 pages a week. Many of these will be \"false starts\" that you throw away. Keep going.\n\nPerformances\n\nI urge you to see as much theatre as possible this semester. See anything and everything on campus and at the Huntington, the ART, and the small theatres at the Boston Center for the Arts as well. We will try to plan one or 2 performances that we attend as a class.\n\nReading\n\nRead, read, read. Read for inspiration, news, permission, ideas.\n\nRead to find out what other playwrights are doing and how they are doing it.\n\nRead one play per week minimum.\n\nIf you want to write you have to read.\n\nStudents often ask why we don't do more reading/discussion in class. I would love to read and talk about plays with you. But that's another class. This is a writing workshop. Reading plays is a lot easier than writing them.\n\nJournals\n\nYou should keep a writing journal to record ideas, overheard conversations, made-up conversations, character profiles, research, images, titles, words you like the sound of, settings for scenes, etc.\n\nBuy a notebook small enough to carry with you all the time.\n\nGet in the habit of writing your ideas and your questions down. Keep a notebook next to your bed.\n\nWrite it down. Write it down. Write it down.\n\nDate all your work.\n\nCollect images, postcards.\n\nBegin to pay attention to your imaginative life; feed it a little.\n\nMake writing a habit.\n\nWriter's Block\n\nI don't believe in it.\n\nIt won't work as an excuse.\n\nIf you're having trouble writing, bring it to class and I'll create exercises/assignments to help you overcome it.\n\nWhat to Expect in Class\n\nThis class will be run as a workshop. Each week we will be reading our work out loud and critiquing it. We will create an atmosphere of trust and respect in order to mitigate this fairly terrifying process. Your participation in critiquing each other's work is as important as your own written work. You will learn as much from each other's successes and failures as from your own. We will be developing the skills and vocabulary to talk about plays, to recognize structure, story and content problems.\n\nWe will start each critique by telling the writer what we like about his or her work. We will follow up with questions: was anything confusing? Was the story line clear? Was the conflict strong enough? Were each character's wants strong enough, etc.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nAssignments\n\n50%\n\nFinal Project\n\n30%\n\nClass Participation\n\n20%\n\nThe factors in consideration beyond the quality of your writing include:\n\nAttendance\n\nReading the Assigned Texts and Being Prepared for Discussion\n\nMeeting the Assigned Deadlines for Scenes and Drafts\n\nDegree of Improvement\n\nQuality of your Critique of your Peers\n\nWillingness and Ability to Rewrite\n\nQuality of Final Manuscript\n\nQuality of Final Reading\n\nMeeting the Twenty Minute Time Limit of the Final Reading",
  "files": [
    {
      "category": "Resource",
      "title": "week2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-604-playwriting-i-spring-2005/5bf02f74ce6324a395841e5a024c1b2e_week2.pdf",
      "content": "Harrington\n21M.604 Fall 2005\nAssignment, Week 2\n\n1. Write a brief scene--5 to 10 pages--in which one character has enough\nmotivation to make a real effort to achieve his or her goal (i.e. get what they\nwant), whereas the other character, equally motivated, creates ever obstacle he or\nshe can to prevent that goal from being achieved. Both characters use whatever\ntactics the situation allows. The goals, motivations, obstacles and tactics should\nbe consistent with what you know about the characters, their relationship, the\nsetting, the time period, etc.\n2. Re-write the scene and add a 3rd character. The 3rd character can be an\nacquaintance, a total stranger, an intimate. A willing or unwilling participant in\nthe conflict (this would create additional tensions). How does the confrontation\nchange when a 3rd person is present? How does the 3rd person react? Respond?\nDo either or both original characters use the 3rd character as an obstacle? A\ntactic?\n\nSome notes:\nWhen you are beginning your play:\nStart on the most crucial day.\nWhy today? Why now?\nUp the stakes as high as you can.\nHow can you stack the deck against your characters?\nMake it difficult for them to get what they want.\nHow can you put them in a place where they MUST act?\n\nAs you look at and analyze your scenes, ask:\nAre characters distinct?\nDoes each character have their own voice, rhythms, speech patterns, verbal\nidiosyncrasies?\nDoes each character have its own compelling wants, needs, dreams, conflicts, senses of\nurgency?\n\nThink about:\nWhere characters must overcome obstacles to get what they want?\nWhere do their dreams and fears come into conflict?\nWhat is your character doing in the next five minutes to get what s/he wants?\n\nURGENCY is the prime factor in a scene.\nIf a scene isn't working, look at it and determine if anything urgent is going on.\nUrgency is a form of tension that drives the play forward.\nA need, a dream, a yearning that's INTENSE.\nEvery art form has to have a form of tension."
    },
    {
      "category": "Resource",
      "title": "week3_revised.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-604-playwriting-i-spring-2005/c826478d24675f02f2b5f76b87c92e36_week3_revised.pdf",
      "content": "Harrington\n21M.604 Fall 2005\nWeek 3, Assignment\n\nObjects\nWhy are objects important?\nBecause we invest them with meaning, and a single object can have multiple meanings as\nwell as mean different things to different characters\nFor example:\nA good luck charm.\nA letter.\nA book.\nA TV remote control.\nA key.\nAn article of clothing.\nA coffee mug.\nA picture.\n\nObjects can carry both meaning and memory.\nThey can be almost magical - or a character believes the object is magical.\nObjects can be stand-ins for a missing person.\n\nNegotiating over objects is always interesting because it gives us an opportunity to learn\nabout characters. Important information and emotion can be revealed in a compelling\nway. Think of the boyfriend as an object in our conflict/ no conflict improvisation.\n\nObjects can be dangerous.\nThey can change things.\nThey can be changed or they can transform in some way.\nA bottle, when broken, becomes a weapon.\nA tennis racket can stand in as a spaghetti strainer. (The Odd Couple)\n\nObjects can be stolen, lost, bartered, given away, valued, devalued, destroyed, damaged,\nused in a new way.\n\nAssignment:\nChoose an object and write a 10 page scene or play with 2 characters in which they\nnegotiate over that object. Stay in the present and stay focused on the object and the\nnegotiation. We should learn a great deal about your characters through the way they\nvalue the object and negotiate over the object.\n\nAdd interest to the scene by having the object transform in some way. You can modify\nthe object, destroy it, or use it in a new and unique way.\n\nFinally, choose an interesting setting for your scene, which might even add something to\nthe scene or create a challenge for your characters."
    },
    {
      "category": "Resource",
      "title": "week4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-604-playwriting-i-spring-2005/90ea12b69664c9e3b4bf3988a52e2c2a_week4.pdf",
      "content": "Harrington\n21M.604 Fall 2005\nWeek 4, Assignment\n\nWrite a high-context scene which becomes a low context scene.\n\nWorking with ACTION:\nChoose a character.\nChoose a specific revealing action.\nThe character must DO something that reveals something significant about them.\nLet us know when the action is complete.\nBe BOLD with your choices.\nThe character cannot speak.\nOne action must lead to the next, a progression.\nThink of storytelling: \"and then...\"\n\nKeep a sound journal.\nRecord 5 sounds that you hear every day.\nWe'll be using this in a future exercise."
    },
    {
      "category": "Resource",
      "title": "week5_revised.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-604-playwriting-i-spring-2005/881f86a513cfaee7b9a9d489adc806df_week5_revised.pdf",
      "content": "Harrington\n21M.604 Fall 2005\nWeek 5, Assignment\n\n1. Using 2-4 characters create a 10 minute play (10 pages) that centers on a\ndisrupted ritual.\n\n2. Read \"A Streetcar Named Desire,\" by Tennessee Williams. What's the disrupted\nritual in this play? How many can you name?\n\nWhat is ritual?\nReligious: funeral, wedding, daily mass, confession.\n\nSocial: 10 year old running poker game\n3 friends meet at a bar one time a week\nRunning partners\n\nFamily: Christmas evening\nThanksgiving morning\nBirthday party\nGraduation\n\nPersonal:\nHow you dress/eat.\nTurning TV on every time character is alone.\nHow you start your day.\n\nWork:\nWhat are the rituals in a lab with monkeys/rats/flies?\nWhat would a disruption cause?\nDoling out meds in a hospital.\nOpening the mail\nOpening/closing the office/store\nCar pool\nWatching the Superbowl\nRiding the subway\nRiding the commuter train\nBoarding the Monday morning Delta shuttle.\n\nAs you prepare to write your play, ask yourself the following questions:\n1. What is the ritual? Family? Social? Personal? Work-related?\n2. What is the scenario of the ritual? What usually happens? Think it through step by\nstep. How/when does it begin? End?\n3. How does each character respond to the ritual?\n\n4. What disrupts the ritual?\n5. When and how is the ritual disrupted? What are the SPECIFIC circumstances?\n6. How does the disruption affect the ritual? Characters? Relationships?\nImmediately? As the scene progresses?\n7. What CONFLICT does the disruption create?\n8. Are any or all of the conflicts resolved?"
    },
    {
      "category": "Resource",
      "title": "week5.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-604-playwriting-i-spring-2005/31ba199801759765cab1e0f6874af467_week5.pdf",
      "content": "Harrington\n21M.604 Fall 2005\nWeek 5, Assignment\n\n1. Using 2-4 characters create a 10 minute play (10 pages) that centers on a\ndisrupted ritual.\n2. Read \"A Streetcar Named Desire,\" by Tennessee Williams. What's the disrupted\nritual in this play? How many can you name?\n\nWhat is ritual?\nReligious: funeral, wedding, daily mass, confession.\n\nSocial: 10 year old running poker game\n3 friends meet at a bar one time a week\n\nFamily: Christmas evening\nThanksgiving morning\nBirthday party\nGraduation\n\nPersonal:\nHow you dress/eat.\nTurning TV on every time character is alone.\n\nWork:\nWhat are the rituals in a lab with monkeys/rats/flies?\nWhat would a disruption cause?\nDoling out meds in a hospital.\nOpening the mail\nOpening/closing the office/store\nCar pool\nWatching the Superbowl\nRiding the subway\nRiding the commuter train\nBoarding the Monday morning Delta shuttle.\n\nAs you prepare to write your play, ask yourself the following questions:\n1. What is the ritual? Family? Social? Personal? Work-related?\n2. What is the scenario of the ritual? What usually happens? Think it through step-\nby-step. How/when does it begin? End?\n3. How does each character respond to the ritual? What may be very important to\none character may mean very little to another. If the ritual is disrupted, the stakes\nare higher for one character than for another.\n4. What disrupts the ritual? A person? Event? The weather? An idea? If it's\nsomeone, is the person an outsider or someone involved in the ritual? (Ex: Bob's\n\nalways been second banana to Vick in their group. Tonight Bob's decided to\nchange that.)\n5. When and how is the ritual disrupted? What are the SPECIFIC circumstances?\nEx: If the ritual is disrupted before it even begins, the scene will be very different\nthan if the ritual is interrupted while it's happening. The pinochle game getting\ncancelled because the Jones's house was burgled that afternoon is very different\nfrom having a burglar enter mid-game.\n6. How does the disruption affect the ritual? Characters? Relationships?\nImmediately? As the scene progresses?\n7. What CONFLICT does the disruption create? Does anyone try to get rid of the\ndisruption? Does anyone ignore it? Go along with it? Is the conflict strictly\nbetween the ritual and the disruption? Or does the conflict also occur among\ncharacters involved in the ritual?\n8. Are any or all of the conflicts resolved? Does the ritual change significantly?\nPermanently? Are characters and relationships affected? Permanently? Does the\nold ritual stay pretty much intact? Or does it fall apart? Does a new ritual start to\nevolve to replace the old one? If so, does it include all the original characters in\nthe ritual? More? Less?\n\nRead any script, watch any production and you'll see that plays very often focus on\ndisrupted rituals. Almost all people need--require--their lives to be relatively calm,\nto go along smoothly. People naturally tend to be uncomfortable with change,\nbecause change is threatening. Most people, then, consciously or unconsciously,\nwork very hard to maintain the status quo and maintain things the way they are.\nRituals reinforce the status quo by giving people a repeated pattern to their lives.\nWhen someone or something disrupts the ritual, people are shaken up, lives are\nthrown off balance, ideas are brought into question. Whether major or minor, the\ndisruption creates conflict. The characters are forced to deal with the disruption in\norder to return to a state of equilibrium, either by trying to return to the way things\nwere, or by creating new rituals to replace old ones.\n\nAnything is possible when even the smallest personal ritual is disrupted. That's why\nthe disrupted ritual is such a powerful playwriting tool.\n\nIn Williams' \"A Streetcar Named Desire,\" literally every kind of ritual from the\ncosmic to the seemingly insignificant is disrupted over the course of the play. Each\ndisruption adds more and more heat to the central conflict between Blanche de Bois\nand Stanley Kowalski."
    },
    {
      "category": "Resource",
      "title": "week6.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-604-playwriting-i-spring-2005/3409144e8d5805db4554f6941282bc1a_week6.pdf",
      "content": "Harrington\n21M.604 Fall 2005\nWeek 6, Assignment\n\nWrite a 10 minute play/scene where:\n1. There is a clear EVENT.\n2. Character A is willing to do ANYTHING to get what he/she wants. Character B\nis equally motivated to keep Character A from getting what he/she wants.\nCharacter B must also want something. Keep the wants and obstacles strong. Be\ninventive. Make your characters worthy opponents.\n\nIn addition:\n1. There has to be a chorus. The chorus must interrupt the action at least 3 times.\nThe chorus can only speak from \"found\" text (a headline/ from a book/ a\nmagazine/ an ad/ overheard conversations)\n2. You must use 5 to 10 sounds effects (SFX) from your sound journals or that you\ndevise for this scene.\n3. Something has to be physically broken as a result of the action.\n4. The scene must be in an interesting/evocative public space.\n\nBe bold. Be larger than life. Go too far. In fact go way, way, way too far.\nBe outrageous.\nBe theatrical."
    },
    {
      "category": "Resource",
      "title": "week6b.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-604-playwriting-i-spring-2005/c28d39e2c72e264bec2aec23998f3dfb_week6b.pdf",
      "content": "Harrington\n21M.604 Fall 2005\nWeek 6, Assignment #2\n\nCREATING A SPINE\n1. Create 7 events that are linked causally.\n2. Now write 3-5 clusters. Free write, a la Gertrude Stein. These do not have to\nrelate to the 7 events (at least not consciously). Be playful. Choose interesting,\nevocative settings.\n3. Now insert the clusters into the spine.\n4. Read your work out loud to yourself. Revise."
    },
    {
      "category": "Resource",
      "title": "week7.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-604-playwriting-i-spring-2005/85bd694ba2ec847e7dbfadb6f924c81d_week7.pdf",
      "content": "Harrington\n21M.604 Fall 2005\nWeek 7, Assignment\n\nIncorporating at least 5 sounds described in your sound journal, write a short (10-15\npages) radio play.\n\nInclude a disrupted ritual.\n\nRemember: sound is all you have in a radio play--actors' voices and sound effects.\n\nHave fun with this."
    },
    {
      "category": "Resource",
      "title": "week8.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-604-playwriting-i-spring-2005/f3d5ec0af61944e87d38657ae7f41c1d_week8.pdf",
      "content": "Harrington\n21M.604 Fall 2005\nWeek 8, Assignment\n\nWrite a play that can't be staged.\n\nOR\n\nWrite a play where a dog is the protagonist.\n\nAnd, whatever happens, whatever problem(s) you create for your characters, make it\nworse.\n\nRemember:\nWANTS\nACTIONS\nEVENTS\nBEHAVIOR\nURGENCY\nOBSTACLES\n\nRead Sam Shepard's \"Fool for Love\" in preparation for next week's composition\nexercise."
    },
    {
      "category": "Resource",
      "title": "week9.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-604-playwriting-i-spring-2005/333f4608e81b431506a25a828c552f72_week9.pdf",
      "content": "Harrington\n21M.604 Fall 2005\nWeek 9, Assignment\n\n2 couples are playing golf on a miniature golf course.\nThe two couples do not know each other.\n\nEach couple is on a first date.\n(OR)\nOne couple is on a first date, and the other couple is breaking up.\n(OR)\nIn couple #1, there is a marriage proposal.\nIn couple #2, there is a break up OR a pregnancy OR an affair revealed.\n\nSomeone in each couple must be passionate about miniature golf."
    },
    {
      "category": "Resource",
      "title": "dona_felicidad.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-604-playwriting-i-spring-2005/144514bd78604e011b4e7e786a631b89_dona_felicidad.pdf",
      "content": "(EXCERPT OF)\n\nTHE ROSEWATER OF DONA FELICIDAD\nA Parable in One Act\nby\n\nHortense Gerardo\n\nSeptember 26, 2006\nCopyright (c) 2006,\nP.O. Box 15195\nby Hortense Gerardo\nBoston, MA 02215\n\nTHE ROSEWATER OF DONA FELICIDAD\nCast of Characters\nDona Felicidad:\nA woman in her late 50s.\nDon Pasquale:\nA man in his late 50's.\nThe Face in the Mirror:\nA non-descript personage\nDon Xavier:\nA man in his late 60s.\nAssorted Villagers:\nA minimum of three\nScene\nA small village in Patagonia.\nTime\nEarly September, 1973.\n\nTHE ROSEWATER OF DONA FELICIDAD\n\nACT I\n\nScene 1\nSETTING:\nEach scene should flow seamlessly\ninto the next to give the\nimpression of occurring in a wall-\nless, black box. Thus, each set\nshould be very minimal, giving the\nessentials of a dream-like setting\nrather than a highly-detailed set.\nAT RISE:\nDONA FELICIDAD rises from her bed\nand goes about the business of\npreparing herself for her day.\nShe stares at herself in the\nmirror at a wash basin, washes\nher face, combs her hair, and\ntries to tap out the remaining\ndrops of a bottle of facial lotion\nonto her face, without success.\nGiving up, she stares at herself a\nmoment longer in the mirror and\nemits a prolonged, soundless wail.\nAfterwards, she applies her\nmakeup, dresses in a simple shift,\nputs on her shoes, finds a small\nbag of papers and leaves her home.\nOn the street, she carries herself\nin a dignified, regal way that\nalso serves to hide a stiffening\nof her joints.\n\nVILLAGER #1\nGood morning, Dona Felicidad. How are you today?\n\nDONA FELICIDAD\n\n(gently weary)\nAnother day older, but still breathing, thank God.\n\nVILLAGER #1\nDona Felicidad! You don't look a day over sixteen!\n\nTHE ROSEWATER OF DONA FELICIDAD\n\nDONA FELICIDAD\nAh, you sweet liar! There is a special place in Dante's\nHell for those who lie but with good intentions. Bless\nyour soul.\n(VILLAGER #1 tips his hat, chuckles, and DONA\nFELICIDAD moves off slowly toward the town\nlibrary. At the library, she assumes her\nposition behind the reception desk, quietly\ntakes out a book from her bag, and settles in\nto read. After a while DON PASQUALE shuffles up\nto her reference desk with a stack of books)\n\nDONA FELICIDAD\nGood morning, Don Pasquale! Don't tell me you have\nfinished reading all of these books already. You were here\nonly two days ago!\n\nDON PASQUALE\n(shyly)\nDon't you know by now? I only come here to see you, Dona\nFelicidad. When will you finally come with me to the\nvillage square for dinner under the moonlight?\n\nDONA FELICIDAD\n(coyly)\nOh, do not mock me with your honeyed tongue Don Pasquale.\nReserve your energy for the young ladies who flutter around\nyou like butterflies.\n\nDON PASQUALE\n(laughing)\nDona Felicidad, do not be fooled by what your eyes see.\nWhat matters is what the heart tells you is true.\n\nDONA FELICIDAD\nIf that is true, then what matters are the books that\ncomfort me in my bed at night.\n\nDON PASQUALE\n\n(slightly embarrassed)\nAh! Well, thank goodness then, for that.\n(DON PASQUALE suddenly looks\nat his watch)\nGoodness! I'm almost late for an appointment at the Cafe\nFlorian this morning. I'll be back for more books soon.\n\nTHE ROSEWATER OF DONA FELICIDAD\n(DON PASQUALE bows grandly and leaves)\n\nDONA FELICIDAD\n(to herself, bitter)\nDon't be late for your appointment with the sixteen year-\nold girl you have been courting behind her parents' back!\n(after a time, DONA FELICIDAD places\nher book back into her bag and leaves the\nlibrary. She waits at a bus stop and after a\nwhile, Don Xavier steps up to the stop, tips\nhis hat and stands beside her.)\n\nDON XAVIER\nGood day, Dona Felicidad. How goes it at the library?\n\nDONA FELICIDAD\nThe books come in, the books go out. The books get a\nlittle moldier, a little more faded every day. They are\nnot always treated well.\n\nDON XAVIER\nAre you speaking of the books, or of yourself, Dona Felice?\n\nDONA FELICIDAD\n(DONA FELCIDAD is surprised at first, then sees\nthat Don Xavier is gently smiling at her.\nAfter a moment, she laughs and confides to\nhim.)\nSometimes, Don Xavier, I wish I could be like a book.\n\nDON XAVIER\nHow so, Dona Felicidad?\n\nDONA FELICIDAD\nI wish I could be invited into peoples' homes because of\nthe knowledge contained in me, no matter how moldy or faded\nI become.\n\nDON XAVIER\nAh, but you, yourself, said the books are not always\ntreated well.\n\nDONA FELICIDAD\nEven so, Don Xavier. Even so.\n(Just then, the bus pulls up, and\nwhen it pulls away, only DONA FELICIDAD\n\nTHE ROSEWATER OF DONA FELICIDAD\nremains at the curb. She watches the\nbus for a moment, then walks home.\nAt her home, DONA FELICIDAD sits at her\ndressing table and stares at herself in the\nmirror. She tries again to extract the\nremaining drops of a bottle of face lotion, to\nno avail. She stares at herself at the mirror\nagain, and eventually emits an anguished though\nsoundless wail. She combs her hair and is\nmassaging her face in a slowly deliberate\nmanner as she speaks to herself in the mirror.)\n\nDONA FELICIDAD\nEvery night I massage my face, hoping it will make me look\nyounger. I don't know who is more foolish, Don Pasquale\nchasing after girls young enough to be his granddaughter,\nor me rubbing my face, hoping it will bring back my youth.\nI wish I no longer felt burdened by the relentless\nonslaught of time.\n(Suddenly, DONA FELICIDAD notices THE FACE IN\nTHE MIRROR and freezes. After a while, she\nspeaks.)\n\nDONA FELICIDAD\nHow did you get in here!?\n(THE FACE IN THE MIRROR stares back silently.\nDONA FELICIDAD turns to look behind her and\nsees no one there.)\n\nDONA FELICIDAD\nWho are you? What do you want?!\n(THE FACE IN THE MIRROR points a bony finger at\nher but remains silent.)\n\nDONA FELICIDAD\nAre you coming for me? Because if you are I'm ready. I'm\nnot afraid of you. Do what you have to do and make it\nquick.\nTHE FACE IN THE MIRROR\nI only come to take people who are truly alive, Dona\nFelicidad.\n\nDONA FELICIDAD\nWell, if you came to insult me, Father Time already does\nthat on a daily basis. Go away.\n\nTHE ROSEWATER OF DONA FELICIDAD\nTHE FACE IN THE MIRROR\nI came to grant you a wish, Dona Felicidad.\n\nDONA FELICIDAD\nA wish? Why? So that you can torment me knowing what I\nlong for most and then, not grant it?\nTHE FACE IN THE MIRROR\nI will grant you whatever you wish, Dona Felicidad.\n\nDONA FELICIDAD\nI see. You will grant me my wish, and then take it away.\nThat is how you will watch me suffer.\nTHE FACE IN THE MIRROR\nWhatever you wish will not be taken away unless you,\nyourself, ask me to take it away.\n\nDONA FELICIDAD\nAnd then you will take my life?\n(THE FACE IN THE MIRROR remains silent.)\n\nDONA FELICIDAD\n(after a moment)\nWell it seems that this is the easiest proposition. What\nif my wish is to be young again forever?\nTHE FACE IN THE MIRROR\nIs that your wish?\n\nDONA FELICIDAD\nYou said you would grant anything I want and not take it\naway unless I ask, is that correct?\n(THE FACE IN THE MIRROR nods but remains\nsilent.)\n\nDONA FELICIDAD\n(laughing)\nThen of course that is what I want! Who would not want to\nbe young forever? Do you think I will ask for this wish to\nbe taken away? Ha! Then you are profoundly mistaken.\nBecause I will NOT ask for it to be taken away and you will\nNOT come back to claim my life! Ha ha! I can not believe\n\nTHE ROSEWATER OF DONA FELICIDAD\nyou would grant such a ridiculous offer! Why has no one\nelse thought of this before!? Ha ha ha ha ha! Yes! I\nwish to be young forever! Ha ha ha ha ha.\n(THE FACE IN THE MIRROR nods then appears to\ngive DONA FELICIDAD a bottle through the\nmirror.)\nTHE FACE IN THE MIRROR\nRub this into your skin each night as you do your nightly\nmassage.\n\nDONA FELICIDAD\nWhat is it?\nTHE FACE IN THE MIRROR\nRosewater.\n\nDONA FELICIDAD\nThat's all? Rosewater? How do I know this will not\ndisfigure me and do exactly the opposite of what you\nsuggest it will do?\nTHE FACE IN THE MIRROR\nYou do not have to do as I say. You can continue as before\nin your nightly rituals and your daily humiliations. But\nyour wish will not be granted. The choice is entirely\nyours to make.\n(THE FACEIN THE MIRROR fades away. DONA\nFELICIDAD stares at the bottle, then at\nherself in the mirror. She looks behind\nher and sees nothing, then looks back\nat the mirror. A long time elapses. Nothing.\nAfter a while she speaks to herself in the\nmirror.)\n\nDONA FELICIDAD\nThat's it, Felicidad. You have finally lost your mind.\nTalking into a mirror...hah!\n(She pauses, then looks at the bottle in her\nhands. The other bottle of face lotion is now\ngone.)\n\nTHE ROSEWATER OF DONA FELICIDAD\nBut then, where did this rosewater come from? Could it be\nI bought it on the way home today? Yes. Of course. That\nmust be it. It's been another long day and I'm tired.\n(She opens the bottle and sniffs it.)\nSmells nice! Perhaps the rosewater will help. What are you\nwaiting for, Felice? You're not getting any younger! What\nis there to lose?\n(DONA FELICIDAD carefully rubs a small amount\nof the unguent onto her face. As she does\nthis, while her eyes are closed, THE FACE IN\nTHE MIRROR appears, and her own reflection\nfades away. When she opens her eyes again, she\ndoes not notice THE FACE IN THE MIRROR is now\nher own.)\n\nDONA FELICIDAD\nHhmmmmm. Smells nice and it feels good too! Maybe this\nrosewater wasn't such an extravagance after all!\n(DONA FELICIDAD stares at her face from many\nangles. She moves it from side to side, as does\nTHE FACE IN THE MIRROR. She looks on\napprovingly, then trundles to bed, reads for a\nshort while, then falls asleep.)\n\n(FADE OUT)\n\n(END OF SCENE)\n\nACT I\n\nScene 2\nSETTING:\nSame as in Scene 1.\nAT RISE:\nDONA FELICIDAD rises from her bed\nand goes about the business of\nwashing and dressing herself for\nher day. She stares at herself in\nthe mirror at a washbasin, washes\nher face, combs her hair, and taps\nout some rosewater into her palm,\nrubs her palms together, and\nslowly rubs her palms onto her\nface. Afterwards, she stares at\nherself a moment longer in the\nmirror and emits a prolonged,\nsoundless bout of laughter.\nAfterwards, she applies her\nmakeup, dresses in a simple shift,\nputs on her shoes, finds a small\nbag of papers and leaves her home.\nOn the street, she carries herself\nin a dignified, regal way that is\nalso noticeably lighter than\nbefore\n\nVILLAGER #1\nGood morning, Dona Felicidad. How are you today?\n\nDONA FELICIDAD\n\n(gently weary)\nAnother day older, but still breathing, thank God.\n\nVILLAGER #1\n(VILLAGER #1 is about to tip his hat\nand walk past her when he glances\nat her and suddenly stops in his tracks,\nshocked.)\nDona Felicidad! You don't look a day over sixteen!\n\nDONA FELICIDAD\nAh, you sweet liar! There is a special place in Dante's\nHell for those who lie but with good intentions. Bless\nyour soul.\n\n(VILLAGER #1 tips his hat, dumbfounded,\nand DONA FELICIDAD moves off slowly toward\nthe town library. At the library, she\nassumes her position behind the reception\ndesk, quietly takes out a book from\nher bag, and settles in to read.\nAfter a while DON PASQUAL shuffles\nup to her reference desk with a\nstack of books.)\n\nDONA FELICIDAD\nGood morning, Don Pasquale! Don't tell me you have\nfinished reading all of these book already. You were here\nonly recently!\n\nDON PASQUALE\n(shyly)\nDon't you know by now? I come here only to see you, Dona\nFelicidad. When will you finally come with me to the\nvillage square for dinner under the moonlight?\n\nDONA FELICIDAD\n(impatiently)\nReserve your energy for the young ladies that flutter\naround you like butterflies.\n\nDON PASQUALE\n(laughing)\nDona Felicidad, do not be fooled by what your eyes see.\n(suddenly, DON PASQUALE notices\na change in Dona Felicia and is\nstunned. After a moment, he regains\nhis compusure but speaks ardently.)\nWhat matters is what the heart tells you is true.\n\nDONA FELICIDAD\nIf that is true, then what matters are the books that\ncomfort me in my bed at night.\n\nDON PASQUALE\nThen I wish devoutly to be one of your books.\n\nDONA FELICIDAD\n\n(slightly embarrassed)\n\nDo not mock me with your honeyed tongue Don Pasquale.\n(after an awkward pause, DONA FELICIDAD\nsuddenly points to DON PASQUALE's watch)\nGoodness! You'll be late for your appointment at the Cafe\nFlorian. Come back tomorrow for more books after you've\namused yourself with your...amusements.\n(DON PASQUALE begins to speak,\nreconsiders, then bows grandly\nand leaves. After a time,\nDONA FELICIDAD places her book back\ninto her bag and leaves. She waits\nat a bus stop and after a while,\nDON XAVIER steps up to the stop,\ntips his hat and stands beside her.)\n\nDON XAVIER\nGood day, Dona Felicidad. Are the books getting better\ntreatment today?\n\nDONA FELICIA\nThe books attracted unwanted attention today, but at least\nthey are, for the most part, intact.\n\nDON XAVIER\nAre you speaking of the books, or of yourself...\n(DON XAVIER looks at DONA FELICIDAD and is\nsuddenly taken aback)\n...Dona Felicidad!?!\n\nDONA FELICIDAD\n(DONA FELCIDAD is surprised at first, then sees\nthat Don Xavier is genuinely admiring her.\nAfter a moment, she laughs and asks)\nDon Xavier, why are you looking at me in that way?\n\nDON XAVIER\nIn what way, Dona Felicidad?\n\nDONA FELICIDAD\nIn the way a lover of books covets an original folio.\n\nDON XAVIER\nIf you were a folio, Dona Felicidad, I would savor each\npage between the covers.\n\nDONA FELICIDAD\nA book is meant to be savored for the ideas it contains.\nThe pages and covers are merely the vessel on which ideas\nare served.\n\nDON XAVIER\nEven so, Dona Felice. Even so. The vessel serves the\nimportant function of housing and conveying what is inside.\nThese things should not be ignored.\n(Just then, the bus pulls up,\nand when it pulls away, DON XAVIER\nand DONA FELICIDAD remain at the curb.\nThey stare at one another a long\nmoment.)\n\nDONA FELICIDAD\nDon Xavier, you have missed your bus.\n\nDON XAVIER\nThat is true. However, I will not allow myself to miss the\nboat: Dona Felicia, would you do me the honor of gracing me\nwith your presence at the village square this Friday night?\n\nDONA FELICIDAD\n\n(taken aback)\nDon Xavier, forgive me, but were you not only recently\nwidowed?\n\nDON XAVIER\nIt might seem like only yesterday in the eyes of some, but\nmy dearly-departed wife, Gertrude, passed away seven years\nago.\n\nDONA FELICIDAD\nIndeed, it does seem like only yesterday, may she rest in\npeace.\n\nDON XAVIER\nI believe a suitable mourning period has passed. Will you\nnot join me as I return to the land of the living?\n\nDONA FELICIDAD\nYes, of course, I would be delighted to accompany you, Don\nXavier. (A pause) I see you every day at this bus stop,\nand I wonder, why only now have you asked me to accompany\nyou to the village square?\n\nDON XAVIER\nI do not understand it, myself. But I feel as though I am\nonly seeing you now, for the first time, Dona Felicidad.\n\nAllow me to walk you home so that I might revel in your\nbeauty a while longer and contemplate how it is possible I\nhad not noticed it all these years.\nFADE OUT\nFADE IN\n(At her home, DONA FELICIDAD sits\nat her dressing table and stares at herself\nin the mirror. She does not seem to\nnotice the change in her that everyone else\nsees. She combs her hair and is applying\nrosewater to her face and limbs in a slow,\ndeliberate manner as she speaks to herself.\nTHE FACE IN THE MIRROR appears as her\nreflection.)\n\nDONA FELICIDAD\nI have longed many years for Don Xavier to ask me to the\nvillage square for Friday dance and now after I massaged\nthe rosewater only one time onto my skin, it has happened.\n(DONA FELICIDAD stares into the mirror and does\nnot seem to notice THE FACE IN THE MIRROR is\nnot her own as she speaks.)\nMaybe I will not look younger, but if DON XAVIER falls in\nlove with me, I will feel young forever. Won't I? Maybe\nit is the rosewater. Then again, maybe it is not. Maybe\nhe has finally come to see me for who I truly am.\n(THE FACE IN THE MIRROR stares back, and emits\na prolonged, soundless bout of laughter.)\n\n(FADE OUT)\n\n(END OF SCENE)\n\nACT I\n\nScene 3\nSETTING:\nThe village square at night.\nAT RISE:\nThere are musicians playing lively\nvallenato music. There are long\ntables with benches for people to\nsit and people are dining,\ndrinking and generally having a\ngood time under the stars.\nStrings of light bulbs light the\nsquare and the air is festive.\nDON XAVIER and DONA FELICIDAD are\nat one of the tables, laughing and\nclearly having a wonderful time.\nBoth are dressed in fine clothes\nthat are slightly ill-fitting as\nthough they were last worn when\ntheir owners were somewhat younger\nand leaner.\n\nDON XAVIER\nI have not laughed this way in years, Dona Felicidad! I\nfeel like celebrating! Would you dance a milonga with me?\n(DON XAVIER and DONA FELICIDAD rise\nfrom their table and approach the\ndancing area in front of the musicians.\nAs they approach, the musicians stop\nwhat they were playing and the other\ndancers politely clear an area for them.\nAll eyes are on the couple as they stand\nside by side. DON XAVIER addresses the\nmusicians.)\nPlay the music of one who has risen from the dead and wants\nto rejoice.\n(The musicians look at one another and\nbegin to play a lively tango. DON XAVIER\nand DONA FELICIDAD assume their respective\ndance positions as though they had\nbeen partnering for many years. As\nthey dance, the chatter among the villagers\ndiminishes as people begin to watch\nand stare admiringly.)\n\nDONA FELICIDAD\nI never knew you were such an elegant dancer, Don Xavier!\nYou are very light on your feet.\n\nDON XAVIER\nI dance as one who has escaped the bonds of the earth and\nis now floating with an angel.\nDONA FELICIDAD\nI am so happy at this moment that I will accept your kind\nflattery, even if for just one night.\n\nDON XAVIER\nI assure you, I would like to repeat many nights with you\nlike this, Dona Felicidad. I only hope you will not tire\nof dancing with me.\n\nDONA FELICIDAD\nHow can I ever tire of this moment with you? You make me\nfeel like a young girl again!\n\nDON XAVIER\nI am not surprised by this: you actually look like a young\ngirl again, Dona Felice! I never noticed what beautiful\nskin you have.\n\nDONA FELICIDAD\nI have my rosewater to thank for that. Each night I\nmassage it into my skin as though my life depended on it.\n\nDON XAVIER\nDo you mean to say that the only reason you look so young\nis because of rosewater?\n\nDONA FELICIDD\nAbsolutely! I am a woman of limited means, Don Xavier.\nThat is the only luxury I have permitted myself.\n(At this moment, THE FACE IN THE MIRROR\nappears in the crowd unnoticed and silently\nwatches DON XAVIER and DONA FELICIDAD, who are\nnow the only people dancing.)\n\nDON XAVIER\nThen I will gladly provide you with rosewater for the rest\nof my living days, Dona Felicidad! I am like a man who has\nlost his mind tonight, and to prove it to you, I will dance\nlike a madman trying to pound dust from the marble!\n\n(At this, DON XAVIER begins a dramatic dance\nsolo. The musicians take notice and begin to\nplay at a faster tempo to keep pace with DON\nXAVIER's highly skilled but increasingly\nfrantic dance movements. DONA FELICIDAD and the\nrest of the villagers take notice and cheer him\non. After a while, the villagers continue to\nclap and urge him on, but DONA FELICIDAD\nbecomes alarmed.)\n\nDONA FELICIDAD\nDon Xavier! Please slow down! You must not exert yourself\nso!\n\nDON XAVIER\n(gasping for breath, but continuing his dance)\nI'm hardly exerting myself at all! I am intoxicated by\nyour loveliness, Dona Felice! I have no other way to\nexpress how I feel.\n\nDONA FELICIDAD\nPlease, Don Xavier! I am afraid you will hurt yourself.\nPlease stop!\n\nDON XAVIER\nNonsense! I can dance like this forever!\n(By now, DON XAVIER is clearly struggling\nto catch his breath but his movement continue\nwildly. The musicians keep pace with his\n\nfaster movements.)\n\nDONA FELICIDAD\nThen please stop for my sake! I am tired and wish to sit\ndown, Don Xavier!\n\nDON XAVIER\nYou!?! A woman who looks like this is her first dance!?\nCome and dance with me, Dona Felice! Dance as though the\nworld were watching!\n(The villagers clap in rhythm to the music\nand there is much mirth in watching DON XAVIER\ndance, until suddenly, he sees THE FACE\nIN THE MIRROR in the crowd, freezes for\nan instant, then suddenly drops to the\nfloor and remains still. The crowd gasps.\nThe music stops. DONA FELICIDAD runs to\nDON XAVIER and cradles him in her arms.)\n\nDONA FELICIDAD\nDon Xavier! Wake up! Please! Wake up, Don Xavier!\n(DONA FELICIDAD stops to listen to his\nheart and hearing nothing, begins to\nshake him and shout for assistance.)\nHelp! Please help! Someone. Anyone! Don Xavier needs\nhelp!\n(Several villagers surround DONA FELICIDAD,\nand they huddle around the body of DON XAVIER,\nmurmuring. After a moment, DONA FELICIDAD\nstands up in the midst of them, notices\nTHE FACE IN THE MIRROR standing off to the\nside, and addresses it.)\n\nDONA FELICIDAD\nNo! This was not part of the bargain! No!\n(THE FACE IN THE MIRROR turns and walks\naway from the scene silently, unseen by anyone\nelse.)\n\nDONA FELICIDAD\nCome back! This is not fair! (she wails loudly) No! Come\nback!\n\nVILLAGER #2\nWho is she talking to?\n\nVILLAGER #3\nDon Xavier, you fool. The woman is begging Don Xavier to\ncome back.\n\nVILLAGER #2\nBut Don Xavier is down here. Not over there.\n\nVILLAGER #3\nThe poor woman is insane in her grief. Don Xavier is the\nfirst man to ask her to the village dance in many years.\n\nVILLAGER #1\n(speaking to DONA FELICIDAD)\nI am sorry to inform you, that Don Xavier has passed away,\nDona Felicidad.\n\nDONA FELICIDAD\n(still addressing THE FACE IN THE MIRROR)\nYou are not being fair! Come back!\n\n(FADE OUT)\n\n(END OF SCENE)\n\nACT I\n\nScene 4\nSETTING:\nSame as in Scene 1.\nAT RISE:\nDONA FELICIDAD rises from her bed\nand goes about the business of\nwashing and dressing herself for\nher day. She stares at THE FACE\nIN THE MIRROR at the washbasin,\nwashes her face, combs her hair,\nand taps out some rosewater into\nher palm, rubs her palms together,\nand slowly rubs her palms onto her\nface. Afterwards, she stares at\nherself a moment longer in the\nmirror and emits a prolonged,\nsoundless bout of sobbing.\nAfterwards, she applies her\nmakeup, dresses in a simple shift,\nputs on her shoes, finds a small\nbag of papers and leaves her home.\nOn the street, she carries herself\nin a dignified, regal way that is\nyet youthful.\n\nVILLAGER #1\nGood morning, Dona Felicidad. I am very sorry to hear of\nyour loss.\n\nDONA FELICIDAD\n\n(gently weary)\nI appreciate your sentiments, but a loss implies something\nthat was owned. The late Don Xavier, God rest his soul,\nwas not mine to lose.\n\nVILLAGER #1\nDona Felicidad! Surely you know he died happily in your\narms.\n\nDONA FELICIDAD\nAh, you sweet liar! He did not die in my arms. (pause)\nThere is a special place in Dante's Hell for those who lie\nbut with good intentions. Bless your soul.\n\n(VILLAGER #1 tips his hat, chuckles, and DONA\nFELICIDAD moves off slowly toward the town\nlibrary. At the library, she assumes her\nposition behind the reception desk, quietly\ntakes out a book from her bag, and settles in\nto read. After a while DON PASQUALE shuffles up\nto her reference desk with a stack of books)\n\nDONA FELICIDAD\nGood morning, Don Pasquale! Don't tell me you have\nfinished reading all of these book already. You were here\nonly days ago!\n\nDON PASQUALE\n(shyly)\nWhen will you believe me? I come here only to see you,\nDona Felicidad.\n\nDONA FELICIDAD\n(suspiciously)\nOh, do not mock me with your honeyed tongue Don Pasquale.\nReserve your energy for the young ladies that flutter\naround you like butterflies.\n\nDON PASQUALE\nDona Felicidad, I must tell you: ever since I saw you with\nthe late Don Xavier...\nDON PASQUALE AND DONA FELICIDAD\n...may God rest his soul..\n\nDON PASQUALE\nI have thought of no other woman than you.\n\nDONA FELICIDAD\nPlease, Don Pasquale. My heart is still heavy with grief\nfor the late Don Xavier...\nDONA FELICIDAD AND DON PASQUALE\n...may God rest his soul...\n\nDON PASQUALE\nThe truth is, I never thought you would accept the\nattentions of a man. You are always so engrossed in your\nbooks. I thought I would have nothing to offer you.\n\nDONA FELICIDAD\nI do not blame you for thinking these things, Don Pasquale.\nPerhaps I have cultivated this impression to mask the\nsimple truth that I am a woman of a certain age who remains\nalone.\n\nDON PASQUALE\n(moved)\nWhatever your age, Dona Felicidad, you remain as beguiling\nas any woman in full bloom.\n\nDONA FELICIDAD\nGoodness! You are almost late for your appointment at the\nCafe Florian this morning. Come back for more books soon!\n\nDON PASQUALE\nDona Felicidad...forgive my forwardnsss, but will you allow\nme the honor of accompanying me to the town square this\nFriday?\n\nDONA FELICIDAD\nDon Pasquale! How can you ask me such a thing when I am\nstill grieving the loss of the late Don Xavier...\nDONA FELICIDAD AND DON PASQUALE\n...may God rest his soul...\n\nDON PASQUALE\nNo disrespect, Dona Felice, but a loss implies something\nthat was owned. The late...he...was not yours to lose. I only\nsay this because I would not want to see you wasting away\nin a state of mourning that is not, by our customs,\nexpected of you. I stand before you a man, perhaps a\nlittle past his prime in his life, but younger in years at\nleast than the late...\n\nDONA FELICIDAD\n...I know to whom you refer...go on...\n\nDON PASQUALE\n...yes...and who can think of nothing sweeter than the thought\nof accompanying you to the Friday dance.\n\nDONA FELICIDAD\n(after a pause)\nI would be honored to accompany you to the town square on\nFriday, Don Pasquale. But please, no dancing! We will\ntalk and laugh, but no dancing. I beg you.\n\nDON PASQUALE\nAs you will! Whatever we do, Dona Felicidad, as long it is\nin your company, will be a source of utmost delight to me.\n(DON PASQUALE bows grandly and leaves)\nFADE OUT\nFADE IN\n(At her home, DONA FELICIDAD sits\nat her dressing table and stares at herself\nin the mirror. She still does not seem to\nnotice the change in her that everyone else\nsees. She combs her hair and is applying\nrosewater to her face and limbs in a slow,\ndeliberate manner as she speaks to herself.\nTHE FACE IN THE MIRROR appears as her\nreflection.)\n\nDONA FELICIDAD\nWhy shouldn't I accept Don Pasquale's invitation to ask me\nto the village square for Friday dance? I am not\nofficially in mourning, after all! Don Xavier was not my\nhusband. And why shouldn't Don Pasquale want to ask me to\nthe dance? After all, I have kept my figure all these years\nand I am a respectable woman.\n(DONA FELICIDAD stares into the mirror and does\nnot seem to notice THE FACE IN THE MIRROR is\nnot her own as she speaks.)\nMaybe it is the rosewater. But then again, maybe it is not.\nMaybe Don Pasquale has finally come to see me for who I\ntruly am.\n(THE FACE IN THE MIRROR stares back and emits a\nprolonged, soundless bout of sobbing.)\n\n(FADE OUT)\n\n(END OF SCENE)\n(TO READ MORE, CONTACT THE PLAYWRIGHT)"
    },
    {
      "category": "Resource",
      "title": "mahabharata.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-604-playwriting-i-spring-2005/b1b2b022cc6fa183612a05350228cbb6_mahabharata.pdf",
      "content": "Kunti's Prayer to the River\n(Based on an incident from the Mahabharata.)\nCharacters:\nKunti: a princess, adopted daughter of King Kuntibhoj\nDurvasa: a respected, powerful sage; feared for his temper\nBala: a servant girl (made her up; she doesn't appear in the Mahabharata)\nSurya: the sun god\nAncient India. A river bank. It is a hot day. Durvasa is meditating under a tree. Kunti\nbrings him a basket carrying his breakfast. Durvasa is an old, cranky sage, dressed in a\nsimple robe; he knows pieces of the future. Kunti is a pretty young princess; she wears an\nexpensive blue Indian dress. She always respects herself as a princess, though acts\nsubserviently for her self-interest. Whenever she walks, we can clearly hear her bangles\nand anklets jingling. Off on the side, Bala washes bright red clothes in the river; she\nconcentrates very hard on this labor, trying to distract herself from something. Surya, the\nsun god, sits on a platform near Bala. He wears simple yellow silks. He can also see bits\nof the future. Note, from Earth the other characters only see him as the sun, not his\nhuman form. During the play, Surya focuses light on different characters by moving his\nhand; in this way he exercises a certain persuasive power over them. Now, he looks at\nKunti longingly, without focusing light on anyone.\nDURVASA (without opening his eyes): Hello Kunti. You have come with my breakfast.\nThe rasam smells delicious.\nKunti remains standing. Silence.\nDURVASA: Now, you are standing still in front of me. (opens eyes) I was right. Anklets\nand bangles are lovely things--I hear you come, I know what you are doing without you\nspeaking a word.\nKunti silent.\nDURVASA: My, it is hot today. (shading his eyes, he looks at Surya. Surya smiles back).\nSurya scorches the earth.\nKunti takes out a fan from the basket and starts fanning Durvasa.\nDURVASA: I would like some breakfast now.\nKunti attentively and agilely serves Durvasa. Durvasa eats quickly, so Kunti is constantly\nrefilling his plate with various items, knowing exactly what he wants without being told.\nWhile he is eating, she also entertains him like a clown--juggling mangoes and bananas\n\nbefore cutting them up to serve him, frothing his tea (pouring the tea cup to cup quickly,\nextending the height between the two cups from pour to pour). Kunti does this all with a\nstraight face. Occasionally, Durvasa nods his approval or burps loudly.\nDURVASA: I am finished.\nKunti nods, begins stacking dishes.\nDURVASA: Wait.\nKunti puts down stacked dishes.\nDURVASA: Do you know why today is special?\nKunti doesn't answer.\nDURVASA: I am leaving you today.\nKunti nods.\nOne year. If I stay any longer in a palace, I will become spoiled and fat, full of ghee.\nKunti nods.\nDurvasa leans forward.\nAsk me how I've liked my stay.\nKUNTI (pleasantly): How have you liked your stay?\nDURVASA: Very much.\nKUNTI (bowing her head a little): I am happy you are pleased.\nDURVASA: You sound sincere when you say that. But I know I'm not an easy man to\ndeal with. Why, last month I turned some farmer boy into a horse for sneezing during my\nmeditation. (Kunti is expressionless. Durvasa chuckles.) But you have been a gracious\nhost.\nKUNTI: Thank you.\nDURVASA: No, thank you, Princess. You will make a fine bride one day. Praise the\nlucky man you choose in your swayamvara.\nKunti nods.\nDURVASA: I do not flatter--that husband of yours will be very fortunate. You can see\nwhat a man wants, even when you avert your head. (pause) I have never slept so well in a\npalace before. The slightest sound of people awakes me. (pause) It is hard to read your\nface, so calm. That is the best way to be with a sage.\n\nKunti nods.\nDURVASA: I do not only curse, I also bless. Let me leave you with a present.\nSurya looks shocked but curious.\nKUNTI (pleasant, but a break to her voice): You are kind, but it would be immodest of\nme to accept.\nDURVASA: Do not worry princess, this is a wonderful gift. Let me properly give you\nmy thanks.\nKUNTI (takes stack of dishes, stands up): Let me clean this up first.\nDURVASA(dangerously): Sit\nKunti clasps her hands together, almost in prayer, but also angrily--she looks down.\nSurya looks at her, concerned.\nKUNTI (pleasantly): Your kind words are all the thanks I need. I am happy you have\nstayed here, and I am happier than you are pleased.\nDURVASA: I will be more pleased if you accept my gift. Listen, I want to leave you\nwith a...mark of me. (sees her face and grins) You are much easier to read now.\nKunti grips a plate. She is afraid, but also angry. She has worked a full year to please\nDurvasa, and prevent his curses.\nDURVASA (laughs) :You do not trust me.\nDurvasa stares at Kunti for a long moment. Bala wrings the wet red cloth dry. Then she\nproceeds beating the red cloth against a large rock to dry it further. We can hear the\nsound of this beating--and in some way it should reflect the anger rising in Kunti.\nDURVASA(playfully): I see that you are afraid that I will--No, I am not like that. You\nare beautiful, but I do not care for such pleasures. (quietly) Penance to god has given my\nwords power, and I will give you my thanks through that power. Princess, I will leave\nyou with a gift or a curse. The choice is yours.\nKUNTI: Will you tell me what the gift is before you give it?\nDURVASA: You are keen. You did not throw that dish at me, though you were tempted\n(pause. smirking as Kunti waits for an answer) It is a mantra. When you recite it, think of\nany god in heaven and he will come to you. The swift Vayu, the wise Dharma, (Surya\nmurmurs something, and makes a sharp movement with his hand. Light focuses on\n\nDurvasa) The handsome Surya! We only see Surya as a bright dot in the sky; imagine if\nhe were standing before you, in the flesh?\nBala stops beating cloth against rock. Wipes sweat from forehead and takes a break.\nKUNTI (uncomfortably, but slightly relieved): I can call any god at my own will?\nDURVASA: Yes, come here. Let me tell it to you.\nLetting go of the plate, Kunti shifts closer to Durvasa. Durvasa whispers something in\nher ear; as he whispers it, we hear a whistled tune. After Durvasa finishes telling Kunti\nthe mantra, the whistling fades out.\nDurvasa leaves. Kunti sits still under the tree. Surya moves hand, focusing light on Kunti.\nShe looks at Surya. Blackout.\nLights return, though dimmer. Late afternoon, evening. It has been days since Durvasa\nleft. Same location as previous scene. Surya standing on the platform, moving arms to\nfocus light on Kunti. Kunti dances with Bala. They dance with no clear \"leader\"--they\nspin each other around, spin themselves, holding hands and spinning together in a circle.\nThey are amused by the way their dresses mushroom up as they dance. Kunti wears a\ngarland of flowers in her hair.\nKUNTI(spinning Bala): Everyone's chattering of Amita's swayamvara. All the\nhandsomest kings will attend.\nBALA: Whom do you think she will choose?\nKUNTI(spins):I don't know.\nBALA (spins Kunti): Who would you choose?\nKUNTI: (still dancing) Someone brave and kind.\nBALA: And handsome?\nKUNTI: Radiant.\n(smiles at Surya, and Surya smiles back)\nAnd he should like dancing too.\nBALA: Do you know such a man?\nKUNTI: Of course!\n(Kunti takes the flower garland from her hair, and respectfully places it around Bala's\nneck)\n\nBALA(sheepishly): I'd make a rotten husband.\nKUNTI: You fit my requirements perfectly.\nBALA (cracking a grin): But we'd dance all day and get fat on ladus.\nKUNTI: Yes!\nBALA: And we couldn't have children.\nKUNTI (slowly stops spinning. smiles.) You're in a sour mood. Bala and Kunti both stop\ndancing.\nBALA: No.\nKUNTI: Listen, I told you what Durvasa whispered in my ear.\nBALA: A mantra that calls any god in heaven.\nKUNTI: Yes, and I can call it when I please. It's not a curse at all.\nBALA: But you've been having those dreams...\nKUNTI: I had it again last night.\nBALA: Don't say that, a recurring dream always come true.\nKUNTI:\nI know Father is thinking of my swayamvara. Last night, Rohan commented that I was\nnearly a woman now and...(kunti holds bala's hands) Yesterday the dream was so--so\nstrong. (a little embarassed) Surya comes down from the sky, and we--\nBALA: (quietly) You...\nKUNTI: (lying) We danced.\nBALA: You sound afraid.\nKUNTI: No, those dreams--when he came down to me, it was...Even though his light\nwas hot, I felt...Come here. (Bala hesitantly walks to Kunti; their faces are close to each\nother. Bala is nervous and excited from their closeness, but know Kunti is describing a\nfeeling towards Surya.) Turn around. (Kunti holds up Bala's hair and blows on her neck.)\nBALA: Like that...\nKUNTI: A chill.\n\nBALA: (dazed and hurt) Surya makes you feel like this?\nKUNTI (slightly embarrassed)Yes...\nBALA: (anger seeping in) Miss... you shouldn't say such things.\nKUNTI: I know.\nBALA: It's not proper miss! It's--filthy.\nKUNTI: No! (embarrassed and irritated) No, I'm perfectly fine, Bala! How--how dare\nyou speak to me like that.\nBALA: (hurt) I will leave if Miss wishes it.\nKUNTI: Yes, go!\nBala gives Kunti the garland of flowers and gloomily exits. Kunti stares at garland of\nflowers blankly. Suddenly, she throws it to the ground. Surya looks at her\nsympathetically; the light brightens around Kunti.\nKUNTI: Who does she think she is. I'm filthy, she says. I just want to see him. We\nwouldn't do anything.\nKunti feels the sun, and turns towards the light.\nKUNTI:\n(quietly)\nI want to meet you.\n(Surya answers with shifting light around her.)\nKUNTI:\nNo, Durvasa probably gave me a phony mantra; he would trick me. The old crank\nthought of me as a little doll, a toy.\n(shifting light around Kunti)\nKUNTI\n(murmurs)\nThat silly mantra, silly...\n(Kunti is quiet. Her mind wanders, and without really thinking mumbles the mantra. We\nhear the whistling tune from before. A flash of blinding light. Surya descends from\nplatform and appears before Kunti. Kunti is wide-eyed in awe and fear.)\n\nSURYA:\nGreetings, Kunti.\nKUNTI:\nYou are beautiful.\n(Surya plucks a flower from the garland and places it in Kunti's hair)\nKUNTI:\n(smiling, but concerned)\nThank you for coming--\nI did not think you would come. But...but you must leave soon. Someone will see.\nSURYA:\nI can shape the light any way I wish. No one will see us. (pause) Would you like to\ndance?\n(Kunti nods. They dance, Surya leading Kunti, twirling her. Kunti is charmed and a little\nshy throughout this whole dance, and Surya is confident, calm. A sharp contrast to the\nfun-loving dance between Bala and Kunti.)\nKUNTI: You are beautiful. Even in my dreams, you weren't so beautiful.\nSURYA: I will give you a son just as beautiful.\nKUNTI (shocked silent. laughs uneasily): Oh, you are funny too.\nSURYA: I am not joking, Kunti.\nKUNTI: I am not married.\nSURYA: You called me for a son.\nKUNTI (horrified):\nDurvasa never--\nSURYA: He lied to you. What he whispered in your ear was a birth-giving mantra; by\ninvoking it, you can have a son with any god in heaven.\nKUNTI: I would never use it if I knew.\nSURYA: That is why he misled you.\nKUNTI (dazed): I only wanted to see how you looked like.\nSURYA: You will remain a virgin afterwards.\n\nKUNTI: I am not married--I can't raise a son.\nSURYA: Our son will be born with all my radiance--he will be handsome, brave,\ngenerous, the best of warriors. He will be born with earrings and armor dipped in\nambrosia.\nKUNTI: Please forgive my mistake and go.\nSURYA (gently): Kunti, I have long loved you.\nKUNTI:\n(holding hands over her eyes)\nNo...Why... why did you want me to say such a mantra, when you knew--\nSURYA: I am the Sun. I cannot leave the sky at whim--only a mantra such as Durvasa's\ncan bring me to you.\nKUNTI: You still do not listen. I am not married.\nSURYA: Our son will be...\nKUNTI: No...\nSurya touches her face.\nSURYA: The mantra holds me--I cannot leave without fulfilling it. Kunti, please be at\nease. You will stay a virgin, and his birth will be instantaneous. Painless.\nKunti is speechless, pale. Surya, still holding her face, murmurs something. A flash of\nblinding light. In front of Kunti is a basket, holding a crying baby. Surya has\ndisappeared. It is night. Dim, blue light.\nKunti touches baby and begins to cry. We hear a mix of her and the baby's crying.\nEventually, Bala comes onstage. Kunti steadies herself, but the baby continues crying.\nBALA: I--I wanted to apologize. Kunti? (hears and sees baby. stunned silent.) What\nis--\nKUNTI: I found him floating down the river.\nBALA: He looks unharmed, sounds loud and healthy. From a wealthy family--(taps on\narmor...makes a steel sound)\nKUNTI (detached): He is a divine child.\n\nBALA: May I hold him?\nKunti nods.\nBALA: He could be our son! You chose me as your husband after all! (Noticing garland\nof flowers at her feet. Still holding baby, takes garland.)\nKUNTI (repeats to herself): I am not married...\nBALA (forcing laugh): I was joking. She puts garland on crying baby, touches\nflowers.(to baby) Do you smell it? This is Kunti's scent. (rocks baby in her arms. baby\nquiets)\nKUNTI (blankly): I should tell father. I found him by the river.\nBALA (places baby back in basket): Yes, the king could find your parents, little one. (to\nKunti) He's asleep. Look.\nKunti looks at him.\nKUNTI: He looks dead, so still, with that garland around his neck.\nBALA (to Kunti, who still stares at the sleeping baby): Your father knows sage Narada,\nright? Narada knows all secrets; he could surely tell us the birthparents of this child.\nKUNTI (repeats blankly): Tell us the birthparents.\nBALA (concerned): Kunti.\nKUNTI: No, we can't show father.\nBALA: Why not?\nKUNTI: Father should not know the birthparents.\nBala looks closely at Kunti. She guesses that Kunti is the mother.\nBALA (quietly): It will be impossible to hide him in the palace.\nKUNTI: I know.\nBALA: Sooner or later your father would find out--\nKUNTI: I know. (pause) I would like for him to live by this river. Whenever I missed\nhim, I'd put my hands in the water and know that he was close by.\n\n(Silence. Bala is deep in thought.)\nBALA (suddenly): I can say he is mine.\nKUNTI: You are not married. No, you both would be cast out.\nBALA: There must be something I can do.\nKUNTI: Yes. (pause) Promise never to speak of this to anyone.\nBALA: I swear. I swear on my life. Ask anything else.\nKUNTI: Leave us alone.\nBALA: Kunti, I...\nKUNTI: Don't worry, everything will be just like it was. We will play chess tomorrow\nmorning, Father and I will discuss the Vedas at noon, and at night, we'll eat too many\nsweets and chat until the sun rises.\nKunti holds Bala's hand, and kisses her on the cheek.\nKUNTI: Thank you.\nBala is shocked at first. She slowly nods, smiles, and exits. Kunti kneels to sleeping baby.\nKUNTI (quietly): The world will curse me if I reveal you, and I will curse myself if I\nabandon you. (Kunti breathes heavily, she reaches over to touch the baby--she hears her\nbangles jingle, and suddenly yanks them from her wrists and throws them at the tree\nDurvasa had meditated under. The baby awakens, crying. Kunti holds up the baby and\nhugs him for a long quiet moment. The baby falls asleep again.) My words will have\npower too. (She carefully tucks baby in the basket again. Then she clasps her hands\nfervently in prayer. She murmurs to herself. Opens eyes and looks to river.) Goddess of\nthe River, please take care of him. Bring him to a loving home. (Shakily, she holds the\nbasket and stares at the baby) My son...(She places the basket in the river. She watches\nthe basket drift and weeps.)\nBlackout. We hear the gentle river, and the baby crying. The other end of the stage lights\nup. A shabbily dressed man carries wood, but at the sound of the baby's crying,\napproaches the river. He lifts the basket from the river, and stares at the baby for a long\nmoment. He tickles the baby, who gurgles happily. Smiling with love, he exits with the\nbaby. Blackout."
    },
    {
      "category": "Resource",
      "title": "mnemosyne.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-604-playwriting-i-spring-2005/aba97406e37dcdbae05c4978f91f4227_mnemosyne.pdf",
      "content": "Mnemosyne\nJoan Mao\nCharacters:\nMnemosyne, Titan goddess of memory\nLars, shepherd\nRhea, queen of the universe and mother of Zeus\nPlace:\nTartarus, in the Underworld\nTime:\nThe past\nCronos, Titan ruler of the heavens, has been informed by his parents Uranus and Gaia\nthat his son will overthrow him. To prevent the coup, Cronos devours his offspring when\nthey are born. Rhea, his wife, feels for her children and saves their son Zeus by tricking\nCronos into eating a rock bundled in clothing. She hides Zeus in Crete, where he is\nraised by nymphs. Soon Cronos learns of the deception though, and Rhea must resort to\nchanging Zeus into a mortal being and hiding him in the mortal realm. Until the time is\nright, Rhea waits...\n\nScene 1\nLars, a shepherd, approaches a wooden door leading to a cave. A black sheep follows\nbeside him. All areas are dark, save a spotlight on Lars. He knocks on the door, and\nMnemosyne, Titan goddess of memory, cracks it open and peeks out warily.\n\nMNEMOSYNE\n\nAre you lost?\n\nLARS\n\nI'm looking for the woman who lives here.\n\nMNEMOSYNE\n\nI don't know you. You must have the wrong place.\n(Mnemosyne shuts door.)\n\nLARS\n\n(yelling through door)\nPlease, miss, please--I beg you--I have heard things about you, I know you can help me!\nAt least give us some food! My companion is nearly dead from exhaustion.\n\nMNEMOSYNE\n\nI don't like sheep!\n(Pause)\n\nLARS\n\nWell, what do you like?\n(Pause)\n\nMNEMOSYNE\n\nBluebirds.\nScene 2\nSame set as Scene 1, but without the sheep. Lars knocks on the door again.\n\nLARS\n\nMiss, I've brought you a bluebird.\n(Mnemosyne cracks open door and peeks out.)\n\nMNEMOSYNE\n\nWhere is your friend?\n\nLARS\n\nHe passed away yesterday.\n(Mnemosyne opens door fully and motions for Lars to enter.)\n\nMNEMOSYNE\n\nI'm sorry for that.\n\nLARS\n\nDon't give it another thought, miss. He was old; I should not have led him on such a\nlong journey. But I have brought you a bluebird, a pretty little bold one.\n\nMNEMOSYNE\n\nI see that! Where did you find such a thing in this barren land?\n\nLARS\n\nI have a gift for calling animals. And this one was hardy enough to survive these ruins.\n\nMNEMOSYNE\n\nIt won't for long. They never last long down here. Something about the air...it kills the\nsoul.\n(Mnemosyne places bluebird in cage.)\n\nLARS\n\nWhy do you like bluebirds particularly? Why not some other pretty creature...why not\na...dolphin?\n(Mnemosyne laughs.)\n\nMNEMOSYNE\n\nA dolphin? Well, I suppose I could love a dolphin, even though they're silly...but I love\nbluebirds because of their beautiful song. So what is your request of me, that you would\ncatch me a bluebird here in the Underworld?\n\nLARS\n\nI have no roots, no past...and I was told that you could help me find it. The people in the\nnearby village said to look for a wretched hag who lives in the cave deep under a hill.\nThey say you have great knowledge about the past.\n\nMNEMOSYNE\n\nAnd you believed them? The gossip of the poor and bored?\n\nLARS\n\nI had no reason not to. Though I admit, at first laying eyes upon you, their credibility\nwavered. You are not the wretched hag they described.\n\nMNEMOSYNE\n\nFlattery won't get you anywhere in this hellhole, shepherd.\n\nLARS\n\nYour locks remind me of red wine.\n\nMNEMOSYNE\n\nI do not have great knowledge, per se, about the past, and I certainly know nothing about\nyour specific past. But I do have...abilities. And my locks are fairer than red wine; the\nlight is dim here.\n\nLARS\n\nA wild sunset, then. What kind of abilities?\n\nMNEMOSYNE\n\nI call it...memory. The ability to...relive what has happened a long time ago, but only in\nyour mind. It is much more complicated than that, but it is not something you can\nunderstand without experiencing it.\n\nLARS\n\nThis memory...how do I learn it?\n\nMNEMOSYNE\n\nYou cannot. It is unique to myself and those who I wish to bestow it upon, and I cannot\nbestow it upon you. A mere mortal.\n\nLARS\n\nAh, the lady's face changes. You are a god.\n\nMNEMOSYNE\n\nDoes it surprise you?\n\nLARS\n\nWhy could a mere mortal not possess such a gift? Because we are beneath you?\n\nMNEMOSYNE\n\nWhy would I impart something of such infinite preciousness and rarity to you, a\nshepherd? Because you compliment my beauty, stroke my vanity? Do not be foolish; I\nam a god, not a woman.\n\nLARS\n\nEven gods desire companionship. I refuse to leave until you help me; I have traveled too\nfar and endured too much to be turned away by an arrogant woman.\n\nMNEMOSYNE\nStay if you must, but you will not suffer less here than you have in the wilderness.\nScene 3\nLars stumbles into a barren room from outside, carrying two large pails of water on his\nback. Mnemosyne is feeding the bluebird in its cage.\n\nMNEMOSYNE\n\nPut them down over there.\n(Lars sets the pails down.)\n\nLARS\n\nYour bluebird...it does not sing. I have not yet once heard its music this past month.\n\nMNEMOSYNE\n\nIt is dying a slow death. It has lost the inspiration to create song.\n\nLARS\n\nYou believe its song is inspired? Not a habit by birth?\n\nMNEMOSYNE\n\nIt is not the song that is habit by birth, but the inspiration and creativity...that is their\nbirthright. That is why they fascinate me...to be born as a pure form of inspiration...\ncould I capture that gift, I would gladly trade in my own.\n\nLARS\n\nDon't be ridiculous; your powers are enviable enough.\n\nMNEMOSYNE\n\nAnd what would you know about having powers?\n\nLARS\n\nAnd what would you know about having nothing? What would you know about seeing\nyour life pass by in a blur, no more eventful than the sheep's that you care for? About\nhaving all the ambition, but none of the potential? About being mortal, having only one\nchance to live your dream? I am more the bluebird than you, trapped in a slow death.\n(Pause)\n\nMNEMOSYNE\n\nIs that why you covet memory? For your ambitions?\n\nLARS\n\nI covet your gift because I wish to discover my birthright. What is my inspiration, my\ncreativity? My parentage? What salt am I made of?\n\nMNEMOSYNE\n\nAnd what would you do with this knowledge?\n\nLARS\n\nChange the world.\n\nMNEMOSYNE\n\nYou mean rule the world. You want power, dictatorship. I know more than I'd like to\nabout the male craving for power.\n\nLARS\n\nNo, I only aspire to make a difference. To leave my mark, to have a presence in the\nworld even when I am gone. To...what do you call it...to be remembered.\n\nMNEMOSYNE\n\nPossessing memory will not achieve your ambitions. Your desire is irrational--I do not\nunderstand it.\n\nLARS\n\nWhen you are mortal, your greatest fear is entering and leaving this world without\nanyone so much as passing a glance. Without being noticed. I am a shepherd, living a\nlife of seclusion with no one to survive me when I die but my sheep. Were I to\nimmortalize myself in some way, to create something, to change something...\n\nMNEMOSYNE\n\nBear children.\n\nLARS\n\nWhat woman would love a man with no past and no future?\n\nMNEMOSYNE\n\nOne who is as desperate as he to be immortalized.\n\nLARS\n\nYou are already immortal, my lady.\n\nMNEMOSYNE\n\nLiving forever is not the same as being immortal, Lars. People--gods--can forget about\nyou just as easily while you are alive as when you are dead.\n(Lars kisses Mnemosyne.)\n\nLARS\n\nIf I ever left, I could never forget about you.\n\nMNEMOSYNE\nYou cannot keep that promise. It is not in your power; it is not your choice.\n\nLARS\n\nThen I shall never leave.\n(They kiss again.)\nScene 4\nLars and Mnemosyne lie in bed naked together, in each other's arms.\n\nLARS\n\nI have confessed my deepest desire, tell me yours.\n\nMNEMOSYNE\n\nMine? It is embarrassing; it will sound paltry and inconsequential next to yours.\n\nLARS\n\nI promise not to tease you.\n\nMNEMOSYNE\n\nMy deepest desire...is a castle in the sky. Surrounded by clouds the color of my hair\nduring sunset, floating high above this bleak desert.\n\nLARS\n\nTo live among the other gods?\n\nMNEMOSYNE\n\nTo live among the bluebirds.\n\nLARS\n\nWhat's it like to remember something? To relive the past? Does it take as long as living\nit?\n\nMNEMOSYNE\n\nNo, it's different...it's very quick. Like a lightning bolt. Images that just...flash across\nyour mind for a moment, bright as day.\n\nLARS\n\nA lightning bolt...I like that.\n(Pause)\nMnem, do you love me?\n\nMNEMOSYNE\n\nYou know, bad things happen to mortals who make gods blush.\n\nLARS\n\nThen please, I beg of you, grant me my wish! Bestow your gift upon my mind!\n\nMNEMOSYNE\n\nIt isn't that simple, darling. It is not so much a gift, as you call it, but a burden.\nPossessing memory is difficult and dangerous. You begin to live in the past; it hinders\nyou from moving forward. You are constrained; you become afraid and wary of the\nunknown, of what you know you have never experienced. I would not wish it upon\nanyone.\n\nLARS\n\nCan it not be used for good? For learning from mistakes you have already committed?\nFor reveling in extinguished happiness?\n\nMNEMOSYNE\n\nAnd for dwelling in a long-ago pain? Of course, but why? Why, when you could\nexperience happiness anew every day, as if it were the first time you felt that way? To\nlove anew? Without memory, you mortals never grow bored of your spouses, and never\nrecall your spouses' infidelities. Is that not a utopia?\n\nLARS\n\nI suppose, but--\n\nMNEMOSYNE\n\nAnd you! You reason that, if you could recall memories of your parents, that you could\ndiscover yourself! All you will find are your predispositions; your parents are not who\nyou are now. But your confidence will be inhibited by knowledge of these\npredispositions; they will prevent you from becoming a great man.\n\nLARS\n\nOr they could lead me to greater triumphs than I could have ever imagined.\n(Mnemosyne sighs.)\n\nMNEMOSYNE\n\nEven if I did transfer the power of memory to you, I don't know if your mind could\nwithstand it. It's risky...a lifetime of memories is a great deal for the mind to absorb all\nat once.\n\nLARS\n\nI am not afraid.\n\nMNEMOSYNE\n\nBut I am. And there's more...I cannot give you the power of memory without bestowing\nit upon all mortals. This is a fundamental law of the gods--we must keep equality\namong the mortals; we cannot provide one with any advantage or disadvantage over\nanother. And the gods would be exceedingly unhappy if I gave up my powers to the\nmortals.\n\nLARS\n\nOr maybe you fear, then you will be no better than the mortals. We would be equal.\n\nMNEMOSYNE\n\nNo, I would be content with my castle in the sky. But you are right, perhaps the other\ngods fear losing control over the mortals. I simply cannot do it, my love. It is supremely\nforbidden.\n\nLARS\n\nI suppose I will have to relinquish my dreams then. I will never be immortalized.\n\nMNEMOSYNE\n\nYou already are, beloved.\n(They hear a knock on door.)\n\nMNEMOSYNE\n\nGo back to sleep, darling. I will attend to the visitor.\n(Mnemosyne walks into the front room and opens the door. Rhea stands outside it.)\n\nMNEMOSYNE\n\nRhea! This is an unexpected pleasure. What brings you to these parts?\n\nRHEA\n\nSave the drivel, Mnemosyne. Where is he?\n\nMNEMOSYNE\n\nWhere is who?\n\nRHEA\nZeus, you silly girl. I have been keeping track of him, and I know he dwells here. The\ntime has come.\n\nMNEMOSYNE\n\nZeus is certainly not here, your Highness. I have never even seen--oh...oh my.\nLars...Lars is Zeus? Your Zeus?\n\nRHEA\n\nIs that what he calls himself? Laaaars? What a pathetic mortal name. Yes, I suppose; I\nneed to see Lars. The time has come.\n\nMNEMOSYNE\n\nThe time for what?\n\nRHEA\n\nFor reclaiming the throne, you daft cow! You know the prophecy. Uranus and Gaia\nforetold Zeus would overthrow his father and rule the universe. He is of proper age now,\nand the timing couldn't be better.\n\nMNEMOSYNE\n\nHe cannot leave! I won't allow it!\n\nRHEA\n\nWhat has come over you, child? This is our chance at freedom! Freedom from the\ncaves, the dungeons, the Underworld! And Cronos is getting worse by the day; he has\nbegun killing off the servants in his paranoia. The war is brewing...we need a leader! I\nhave come to render Zeus immortal again so he can claim his rightful place on the throne.\n\nMNEMOSYNE\n\nLars is not the meant to be the ruler of the universe.\n\nRHEA\n\nZeus! Zeus! Stop calling him Laaaars, and who are you to deny me my son? You, the\nblack sheep of all gods. Even the villagers call you a wretched hag, you know. I don't\nunderstand why you're fighting me on this...\n(Mnemosyne blushes and Rhea gasps.)\nWhy, my stars...you're in love with him!\n(Rhea laughs)\nYou're in love with a...a-a...a mortal! Truly Mnemosyne, you've outdone yourself this\ntime. Consorting with a mortal, why, it's preposterous!\n\nMNEMOSYNE\n\nHe is not REALLY a mortal, he's YOUR son, and frankly, he is plenty wiser than half\nthe gods I've met. His experiences as a mortal will serve him well as king.\n\nRHEA\n\nActually, he won't \"remember\", as you call it...anything. Yes, he will gain the power of\nmemory when he becomes immortal, but he won't recall anything from his mortal life.\nHe can only relive his immortal experiences. So you, my lovely, will no longer exist to\nhim once I take him away.\n\nMNEMOSYNE\n\nHe loves me.\n\nRHEA\n\nYou...you are only a detour from the path of his true destiny. A dabbling, if you will.\nHis hand, and his loooove, are promised to Hera, also foretold in the prophecy. Do not\npresume to hold any significance in my son's life. You are nothing. Now move aside; I\nwill find him myself if you refuse to aid me.\n\nMNEMOSYNE\n\nNo, I will turn him over. I cannot change his fate. But please, let me say my farewells to\nhim first, alone.\n\nRHEA\n\nVery well, be quick about it.\n(Mnemosyne returns to the bedroom where Lars is deep in sleep. She strokes his hair\nand speaks without disturbing him.)\n\nMNEMOSYNE\n\nLars, oh Lars...are you happy? Are you pleased? You will surely be a strong and\nmomentous leader. You are the world's savior. Treasure your mortality; strive towards\ngreatness as if you were to die tomorrow. And Cronos will be conquered--but your\ngreatest achievement will forever be conquering me. I am a woman, Lars. Remember\nme...\n(Mnemosyne places her fingers at Lars' temples and closes her eyes in deep\nconcentration. Tears roll down her cheeks. The bluebird begins to sing.)\nWhen you are king, love...build me a castle in the sky...among the bluebirds that fly..."
    },
    {
      "category": "Resource",
      "title": "write_home.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-604-playwriting-i-spring-2005/7fbafbc197525999ab1d3fb0c72ec349_write_home.pdf",
      "content": "Write Home About It\nWaseem Daher\nMay 15, 2006\n\nCast of Characters\nAndy\n26, an aspiring novelist\nBetsy\n24, a student in medical school\nMax\n34, a film studio executive\nScene 1\nWe're in a park in some big city on the East Coast, in the present day. It is\nabout midday on a nice summer day. Not too hot, not too cold. You can hear\nthe birds chirping in the background. Andy is sitting on a bench, notebook and\npen in hand, jotting something down. He's wearing a tshirt and some jeans,\nblackrimmed glasses, and a messenger bag leans against the bench, by his side.\nBetsy enters from stage left, wearing scrubs, carrying a paper bag lunch, and a\nbook, and walks past Andy.\nBetsy\n(gesturing to the park bench)\nDo you mind if I sit here?\nAndy\nNo, go ahead.\nShe sits down and begins to eat her lunch. Andy briefly looks in her direction\nand then resumes writing in his notebook. Betsy quickly looks at him, and then\nlooks back and continues eating her lunch. There is a fairly long silence. All of\na sudden, Betsy begins to speak.\nBetsy\nWhat are you working on, there?\n\nAndy\n(without looking up from his notebook )\nNothing.\nBetsy\nYou have to be working on nothing.\nAndy\nA book.\nBetsy\nA book? Oo!\nAndy\nYes. A novel.\nBetsy\nYou're a writer?\nAndy\nSomething like that.\nBetsy\nI'm Betsy, by the way.\nAndy\nAndy. Andy Ellis. Like the island.\nThey shake hands.\nBetsy\nThat name sounds really familiar. Why do I know that name?\nAndy\nDo you read The Gazette?\nBetsy\nYes! You're their book reviewer!\n\nAndy\nI'm impressed you remembered. Not many people actually read the bylines.\nBetsy\nWhat can I say, I'm an observant one. So what's it about?\nAndy\nWhat's what about? (Pause.) Oh, the book. Well, if I knew, I'd be done by now, right?\nShe smiles.\nBetsy\nSure, but you have to have some idea, right?\nAndy\nThat's part of the problem, I'm still sort of working on it.\nBetsy\nI want to write a book where the entire book is the title. Just one really really long title.\nAndy\nHow would that even work?\nBetsy\nI don't know. Really small print? Multiple title pages? Anyway, amazon.com would probably\nflip out -- how would you even list something like that?\nAndy\nThat is ridiculous. They'd probably just come up with a shortened title. Like Dr. Strangelove.\nShe jokingly punches him.\nBetsy\nYou're no fun.\nAndy\nSo what do you do? That is, when you're not revolutionizing the world of print media.\n\nBetsy\n(pointing to scrubs)\nYou have zero guesses.\nAndy pauses and exaggeratedly strokes his chin, making a show of thinking about\nthe answer.\nAndy\nYou're an eye doctor, but you specialize in monocles.\nBetsy\nActually. . .\nAndy\nWait, I'm not done. You're the last of your kind, so you're really high in demand. Noblemen\nfrom England and France travel across the ocean to come see you for their monocle needs,\nbecause you're the best in the business.\nBetsy\n(laughing )\nYes, I have autographed pictures with Mr. Peanut and Uncle Pennybags on my desk.\nAndy\nSo seriously, what do you do?\nBetsy\nI'm a med student.\nAndy\nAlmost done?\nBetsy\nA couple more years to go.\nAndy\nSo, if I started to die, right here, right now, could you save me?\nBetsy\nProbably not.\n\nAndy\nA little less exciting than I had hoped, but I'll forgive you.\nBetsy\nThanks.\nAndy looks at his watch.\nAndy\nHey, I actually need to catch the bus, but do you think that we could. . . uh--\nBetsy\nYes.\nShe pulls out a business card from her bag, writes a number on it, and hands it\nto him.\nBetsy\nWe can work out the details later.\nAndy\nWhat if I wasn't going to ask you out?\nBetsy\nWell, then I would have felt silly. But that's a risk I was willing to take.\nAndy\nI'll call you tonight.\nHe exits.\n\nScene 2\nTwo weeks later, again at the park bench. Andy and Betsy are returning from\na movie, walking handinhand. They sit down.\nBetsy\nWhat a gorgeous evening.\nAndy\nI know, right?\nBetsy\nWhat did you think of the movie?\nAndy\nIt was ok, though I won't write home about it.\nBetsy\nDo you ever write home about things?\nAndy\nSometimes I send telegrams.\nBetsy\nOh?\nAndy\n(makes motions as though operating a telegraph machine)\nJUST SAW MOVIE IN THEATER. STOP. FOUND IT ACCEPTABLE. STOP. COMPANY\nWAS ENJOYABLE. STOP.\nBetsy\n(jokingly; fake British film critic/snob voice)\nMmm, yes, well I thought the, mm, miseensc`ene really underscored the, mm, Christlike\nnature of the protagonist?\n\nAndy\n(in the same voice)\nRighto, I found the juxtaposition of the cinematic elements to be, um, yes, quite smashing.\nOne should hope that it takes a first at Cannes.\nThey laugh, move closer to each other, and begin to kiss.\nAndy\n(in between a kiss; softly )\nWow, I love you.\nBetsy sits upright and pushes him away.\nBetsy\nWhat did you say?\nAndy\n(hesitantly)\nI love you?\nBetsy\nDon't say that.\nAndy\nWhy not?\nBetsy\nJust don't. That's something guys say to get into girls' pants.\nAndy\nThat's not how I meant it.\nBetsy\nYou don't even really know me. How could you actually love me?\nAndy\nI guess you're right. (Pause.) I'm sorry. It seemed like the right thing to say.\n\nBetsy\nIt's fine. I'm sorry, too. I just had to be sure you weren't toying with me.\nAndy lies down on the bench, his head in Betsy's lap. She plays with his hair.\nAndy\nI have a great time with you.\nBetsy\nSo do I.\nThere is a long pause.\nBetsy\nHow is the paper? I liked your latest review.\nAndy\nThanks. It's going fine, I guess.\nBetsy\nAnd the book?\nAndy\nStill nothing.\nBetsy\nYou'll come up with something, don't worry.\nAndy\nI hope so.\nBetsy\nYou will. Trust me.\nAndy\nAnd if you're wrong?\n\nBetsy\nThen I'll break into John Grisham's house, steal a manuscript, and we'll publish it under\nyour name.\nAndy\nSee, that actually sounds worse.\nBetsy\nI know. Which is why you can't let me be wrong.\nAndy\nNo, I guess not. (Pause.) How about you? How are things?\nBetsy\nNothing new, really. Long hours, as usual. I've just finished my applications for residencies,\nbut I won't hear for a few months.\nAndy\nWhere did you apply?\nBetsy\nMostly places in the area. It's hard to go wrong here. I applied to a few on the West Coast,\njust in case.\nAndy\nIf you want me to look at any of your essays. . .\nBetsy\n(jokingly)\nAnd risk getting reviewed in the paper?\nAndy\nVery funny.\nBetsy\nI'll keep it in mind, thanks.\n\nScene 3\nThe park bench, again, a few months later (in early fall). Andy and Betsy are\nagain sitting on the bench, this time in the evening, as the sun is setting.\nBetsy\nSo, I have some good news.\nAndy\nWhat's up?\nBetsy\nI got into my first choice residency!\nAndy\nThat's great news! So you'll be staying here, then?\nBetsy\nThat's the plan!\nAndy\nLet me take you out to a fancy dinner.\nBetsy\nIf you insist. (Pause.) Andy, I love you.\nAndy\nI love you too.\nThey kiss, after which there is a long pause.\nAndy\n(more emphatically )\nI love you.\nBetsy\nMe too. (Pause.) Why twice?\n\nAndy\n\nDid you ever read L'Etranger?\nBetsy\n(joking)\nYou're a snob for saying it in French, but no, I haven't.\nAndy\nThere's a part where the girl asks the main character, \"Do you love me?\" and he says, \"No,\nnot really.\" I just wanted to make sure that I was saying it because I was convinced of it\nand not because it's the right response.\nBetsy\nOh, Andy. . .\nShe hugs him.\nAndy\nHave you finished reading my first draft yet?\nBetsy\nYeah, I really liked it.\nAndy\nYou're just saying that.\nBetsy\nNo, I really did!\nAndy\nYou're sweet. What do you think of the ending, though?\nBetsy\nWell. . .\nAndy\nYou think she shouldn't die.\n\nBetsy\nYeah, I think I'd rather see her redeemed.\nAndy\nI don't know. . .\nBetsy\nShe's so close to it at the end. . . she's almost there!\nAndy\nYou don't think it'd be too heavyhanded?\nBetsy\nWell, it probably would be. But it seems so wrong to cut her off after she's given up so much\nto make it back.\nAndy\nI don't know, I don't want the ending to be too happy. And doesn't it seem a little fake for\nit all to resolve itself like that?\nBetsy\nMaybe. But it's fiction, it's allowed to seem a little fake. Please?\nAndy\nHmm. (Pause.) OK. I'll make the changes first thing tomorrow morning.\nBetsy\nYou're a darling.\nAndy\n(joking)\nAnything for you, my dearest.\nBetsy\nAnything?\nAndy\nAnything.\n\nBetsy\nA giant castle.\nAndy\nI'll begin its construction immediately.\nBetsy\nIt'll include a moat and drawbridge?\nAndy\nNaturally. Can you even have a castle without those?\nBetsy\nCertainly not a good one!\nAndy\nIt looks like it's about to rain.\nBetsy\nYeah, it does.\nAndy\nWe should hurry to a restaurant if we're going to give you that fancy dinner you deserve!\nThey get up and begin to walk away.\nBetsy\nDon't you love it when it's nice and rainy outside? You know, a good rain?\nAndy\nNo, not really. I find it kind of depressing.\nBetsy\nSure, but it's so refreshing!\n\nScene 4\nA few months later, and it is now winter, again with the park bench. Snow\neverywhere. It's around lunchtime. Andy and Betsy, wearing heavy jackets,\nwalk over to it, brush off the snow, and sit down, steaming cups of coffee in their\nhands and jackets on.\nAndy\nHow's school?\nBetsy\nYou know, the usual. Can't complain. It's rough with exams, but I'll get past it. How about\nyou, how's the paper?\nAndy\nFine. . . but it doesn't matter anymore!\nBetsy\nWhat do you mean?\nAndy\nI heard from my publisher today! They want the book!\nBetsy\nThat's incredible! Oh, I knew you could do it! Didn't I tell you that this would happen?\nAndy\nI couldn't have done it without you. It gets better, though.\nBetsy\nIs that even possible? How could it get better?\nAndy\nThey want to make it a movie!\nBetsy\nA movie?\n\nAndy\nA movie! And they want to buy the rights to a sequel, too! They want to fly me in to\nHollywood to supervise the writing of the screenplay and the whole production!\nBetsy\n(slightly souring )\nFly you in?\nAndy\nCome to California with me.\nBetsy\nHow long?\nAndy\nA year, at least. Maybe two. And who knows how long if they decide to go with a sequel.\nBetsy\nA year, maybe two?\nAndy\nIt'll be fun!\nBetsy\n(annoyed )\nYou can't just expect me to up and go like this. What about school?\nAndy\nYou know I've been waiting for a chance like this all my life. I need you, Betsy. I need you.\nBetsy\nWhat about what I need?\nAndy\nYou can't take some time off?\nBetsy\nNo. I can't.\n\nAndy\nPlease? You know I can't do it by myself.\nBetsy\nI'm sorry, Andy, I just can't do it. If I stop now, I won't come back and finish. And I've\nbeen working hard for this. My parents have been working hard for this. What did you\nwant to be when you were little?\nAndy\nI don't know. A private eye, I think.\nBetsy\nI always wanted to be a doctor. I had this little white coat and everything, and when my\nuncle came over, I would steal his stethoscope and play with it.\nAndy\nBetsy. . .\nBetsy\nOne time, I found an old pill jar and filled it with Smarties and hid it in my drawer. My\nmom found it and freaked out; she thought they were real.\nAndy\nCan we. . .\nBetsy\nLook, you do what you have to do. I won't blame you for trying to follow your dream. But\nmy dream requires me to stay here.\nAndy\nYou don't think we could make something work?\nBetsy\nI want to, but I don't think it will.\nAndy\nIt never does, does it.\n\nBetsy\nIf it were a few months, OK. But you don't even know if you're coming back. I need a warm\nbody, Andy, not just a phone call every now and then.\nAndy\nI'm sorry.\nBetsy\nNo, I am.\nAndy\nSo, this is it?\nBetsy\nI guess so. When are you leaving?\nAndy\nIn two weeks.\nBetsy\nIt's probably best if we don't see each other again.\nAndy\nWhy?\nBetsy\nIt'll be better this way.\nAndy\nI don't know. . .\nBetsy\nTrust me.\nAndy\nGod, I'm going to miss you.\nBetsy\nMe too.\n\nScene 5\nA month or two has passed. We find Andy, wearing a suit, sitting in a chair in a\nHollywood executive's office, facing the desk. Movie posters are everywhere, and\na stack of scripts sits in the inbox, a stack in a pile labeled \"rejected,\" and one\nor two in the outbox. The office belongs to Max, a snappilydressed Hollywood\nexecutive whose sideburns are beginning to grey (think Jonah Jameson), who\nwalks in and takes a seat.\nMax\nWell well, if it isn't the man of the hour. I'm Max.\nMax extends his hand across the table, and they shake hands.\nAndy\nAndy Ellis. Like the island.\nMax\nOh, believe me, I know who you are. Your work has caused quite a bit of a stir around here.\nWe're itching to get your movie made. Who're you thinking for the lead? Ben Affleck? Matt\nDamon? Russell Crowe?\nAndy\nI don't really know much about acting. I'm sure your people will make a much better decision\nthan I could.\nMax\nYou're a quick learner, I like that. Flattery will go a long way around here.\nHe rifles through some paperwork on his desk.\nMax\nWell, it looks like someone high up really liked your book. . . they want you on the set of the\nmovie. We almost never give the writers this much creative involvement in the film. They're\nusually too afraid to change things, to cut things, to rearrange them.\nAndy\nWhat's your target audience with this?\n\nMax\nThe same audience that you were writing for. We're going pretty highbrow on this one. If\nwe put the right talent into it, we think this might have a good shot at an Oscar.\nAndy\nReally?\nMax\nI know we've given you veto power on any changes, but just follow my advice and I guarantee\nwe'll make the shortlist.\nAndy\nThis is incredible.\nMax\nI know, isn't it? Sometimes I can't believe it myself. Hey, where did they put you up?\nAndy\nThe Four Seasons down the street.\nMax\nNo, no, no. We'll have to get you a nice apartment.\nHe presses the intercom button on his phone.\nMax\nDoris? Hey, it's Max. Look, can you get Dennis to set up Mr. Ellis here with somewhere\ndecent to live? Thanks.\n(to Andy) There you go, you should be all set up now.\nAndy\nAmazing, thanks!\nMax\nOh, there was something I wanted to ask you about.\nAndy\nSure, what is it?\n\nMax\nYou know the ending to the screenplay?\nAndy\nYeah?\nMax\nI don't want to step on your turf, but she should die.\nAndy\nI dunno. . .\nMax\nAgain, it's your call. Trust me, though, I'm the best. I know movies. And if you want this\nto be big, if you want people to eat this one up, it has to seem deep. It has to seem artsy.\nShe has to die.\nAndy\nI'll think about it.\nMax\nDon't worry about it, this one's going to be big.\nMax reaches into his desk drawer, pulls out a cigar box, and offers one to Andy.\nAndy\nNo thanks, I don't smoke.\nMax\nNeither do I, but I make an exception for these whenever I start a new film.\nAndy\nSo how many is that, at this point?\nMax\nMore than you can count. One of my babies has won an Oscar every year, for the past\nforever.\n\nAndy\nHow do you do it?\nMax\nDid I mention that we've also won at Cannes and Sundance?\nAndy\nNo, you didn't.\nMax\nIt's all about how you sell it, Andy, it's all about how you sell it. Your audience is your\ncustomer. You are a salesman, not an artist.\nAndy\nSure, but--\nMax\nHey, what are you doing tonight?\nAndy\nI. . .\nMax\nWhy don't you come to Brad's party with us?\nAndy\nBrad? Brad Pitt?\nMax\nOf course, who else? Look, I have to run, make yourself at home in here, though. Let Doris\nknow if you need anything.\nMax exits.\n\nScene 6\nSeveral months later, the Monday after the film's opening weekend. Again, we're\nin Max's office, again Andy is sitting down, waiting for him to arrive. Max\nstorms in with a pile of newspapers.\nMax\n(annoyed )\nHave you seen today's papers?\nAndy\nNo, I've been avoiding them. . .\nMax\nThat's a luxury I wish I had.\nAndy\nNo good, huh.\nMax\nThat's an understatement.\nHe sets down the stack, pulls off the top paper, and begins reading.\nMax\nThe New York Times: \". . . both pretentious and snooty, this is one film that won't even do\nwell on DVD\"\nAndy\nOuch. . .\nMax throws down the paper and picks up the next one.\nMax\nThe Washington Post: \"While a stellar novel, the adaptors fail to realize that some elements\ndo not play well on the screen. An otherwisecompelling tale that really disappoints in its\nconclusion.\"\n\nMax\nI think some undergrad at Harvard liked it, but that was about it.\nAndy\nI'm sorry.\nMax\nSorry won't bring the millions back. You'd better hope, for your sake, that we break even.\nMax begins pacing around the room.\nMax\nI don't know why I took this. They said you had so much potential. \"Max, this kid's really\ngot it! Max, trust us on this one.\"\nAndy\nI --\nMax\nAndy, we could have had this one! It was so close. If it hadn't been for that stupid ending. . .\nAndy\nHey! We needed that ending.\nMax\nMaybe for the book, Andy, but not for the movie. People just aren't ready for that.\nAndy rubs his face with his hands.\nAndy\nOk, what can I do about this?\nMax\nNothing. Pray?\nAndy\nMaybe we can make the sequel more somber to counterbalance?\nMax laughs.\n\nAndy\nWhat?\nMax\nThe sequel?\nAndy\nYeah, isn't that what the contract said?\nMax\nI don't think you understand. You only get one shot at this.\nAndy\nOk, how about another screenplay?\nMax\nThe brass upstairs are not going to be pleased with your results. I'm sorry, Andy, it's not\nlooking good for you.\nAndy\nI'll do anything.\nMax\nLook, it's a tough town. You know what you need to do?\nAndy\nWhat?\nMax\nGo home.\nAndy\nExcuse me?\nMax\nGo home. I like you. You might not have made the best decisions, but I like you anyway.\nYour best bet is to lie low; no one will be too eager to take a script from you for a while\nnow.\n\nAndy\nOk. I'll see you at Jenn's.\nMax\nNo, I meant home home. I mean, you can stay here if you like, but I don't see the point.\nJust leave the keys with Doris when you're all packed up.\nAndy\nTell Jenn I'm sorry I couldn't make it?\nMax\nI won't need to. Unfortunately, this sort of thing is commonplace around here.\nAndy gets up and begins to leave.\nMax\nWait, before you go.\nAndy\nYeah?\nMax\nHere, take one of these.\nMax pulls out a cigar from his desk and hands it to Andy.\nMax\nFor your next book. Don't let this get you down, Andy. We almost did it.\nAndy\nI guess so. Almost isn't good enough though, huh.\nMax\nNo, not really. Take care.\nAndy\nYou too.\nHe exits.\n\nScene 7\nA week later, back at the park bench. It's summer, and Andy is again sitting on\nthe park bench with a notebook. Betsy walks in.\nBetsy\nHi.\nAndy\nHi.\nBetsy\nHow are you?\nAndy\nOk. Trying to come up with an idea for a book.\nBetsy\nWhen did you get back?\nAndy\nYesterday.\nBetsy\nWhy didn't you call?\nAndy\nI don't know. (Pause.) How's school?\nBetsy\nFine.\nThere is a long pause.\nBetsy\nSo. . .\n\nAndy\nSo.\nBetsy\nI saw your movie.\nAndy\nCan we not talk about this?\nBetsy\nYou kept my ending.\nAndy\nYou know, they wanted to change it.\nBetsy\nI know.\nAndy\nHow?\nBetsy\n(Faux British voice)\nMm, yes, I try to stay abreast of Hollywood news\nHe smiles.\nAndy\nWhat'd you think?\nBetsy\nI liked it. Though I probably won't write home about it.\nAndy\nFunny. Do you ever write home?\nBetsy\nI've been known to send a letter or two in my day.\n\nAndy\nYeah?\nYeah.\nI never got a letter.\nI guess you're just not that special.\nShe looks at her watch.\nBetsy\nAndy\nBetsy\n(jokingly)\nBetsy\nHey, I have to get back to work, but what if we--\nAndy\nYes.\nBetsy\nI was going to ask you to do something boring. Like, roll quarters or something.\nNo you weren't.\nAlright, maybe not.\nHere, I'll walk with you.\nHe gets up and they begin to leave.\nAndy\nBetsy\nAndy\nBetsy\nYou don't think this is a little too. . . heavyhanded?\n\nAndy\nToo much of a happy ending?\nBetsy\nSomething like that.\nAndy\nIt probably is. But I don't mind.\nBetsy\nMe neither.\nThey exit.\nThe End."
    },
    {
      "category": "Resource",
      "title": "handout_wk2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-604-playwriting-i-spring-2005/c0e9383dc333aaefee9b02740d74b169_handout_wk2.pdf",
      "content": "Harrington\n21M.604 Fall 2005\nHandout, Week 2\n\nAs you think about writing a play, ask yourself the following questions BEFORE you\nbegin to write:\n1. Why is this day different from all others?\n2. What is the EVENT that will bring your characters together?\n3. NOTE: Write bios of your characters that include what they WANT.\n4. How will they change during the play? NOTE: Plays are about how a course of\nEVENTS changes the characters involved. Characters do grow and change their\nthoughts, attitudes, relationships and perceptions through what they experience in\nthe play.\n5. What will the major CONFLICT be and how will it lead to the climax where the\nproblems get resolved? NOTE: Resolved doesn't mean happily ever after. A\nresolution means something has changed and that the play will end with that\nchange. I.e., for better or worse, the problem of the play has been worked to a\nconclusion.\n6. Brainstorm a basic plot. Think about how the problem might be solved (again,\nthe resolution may change as you write the play.) Sum up the plot briefly.\n7. Answer the five \"W's\": Why am I writing it? Who's in my play? Why are they\ndoing what they're doing? What's happening in the play? Where and when is it\ntaking place?\n8. Try outlining what happens in your scenes. This will quickly tell you whether\nanything at all is happening.\n9. Start writing the scene that excites you the most even if it's not the official first\nscene from your outline. Make sure to write down whatever great ideas come\nalong in your head as you're writing this or any other scene.\n10. If you get stuck, keep asking WHY. Why does she go to the ferris wheel after\nmidnight? Why does he stay in this terrible relationship? Why does he gamble\nwith his tuition money?\n11. Also, when you're stuck, put yourself in the physical reality of your characters--\nthere are millions of clues here--from the rats that live under the floorboards to\nthe empty dresser drawers to the 45 year old bathrobe he just can't bear to throw\naway.\n12. Have fun!"
    },
    {
      "category": "Resource",
      "title": "objects_wk2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-604-playwriting-i-spring-2005/ebf0c60b53f98900b3654af6140483f0_objects_wk2.pdf",
      "content": "Harrington\n21M.604 Fall 2005\nHandout, Week 2\n\nOBJECTS\n\nWhy are objects important?\nThey can mean so many things and they can transform.\nFor example:\nA talisman\nA good luck charm\nSomething that carries meaning and/or memory\nCan be almost magical--or a character believes the object is magical\nCan stand in for a missing person\n\nNegotiating over objects--always interesting.\nLots of information and feeling comes out.\nObjects can be dangerous:\nThe can change things\nThey can be changed/transformed.\nThey can be stolen, lost, bartered, given away, valued, devalued, destroyed, damaged,\nused in a new way.\n\nIn a scene, try introducing a dangerous object or substance, but make it dangerous in a\nnew and unexpected way. Think larger than the obvious weapon or poison. Why is it\ndangerous? Does every character in the room believe it's dangerous? Is it something\nthat transforms and becomes dangerous? Such as a glass or bottle that breaks, or a kiss\nthat becomes a bite?"
    },
    {
      "category": "Resource",
      "title": "handout_wk3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-604-playwriting-i-spring-2005/12c33563bb7e003071f727bb25ac6cad_handout_wk3.pdf",
      "content": "Harrington\n21M.604 Fall 2005\nWeek 3, Handout\n\nSome notes:\n\nThinking about PLOT\nPlot = arrangement of incidents/ EVENTS\nPlot = series of EVENTS\nWe build EVENTS to build or create a play.\nWhat do we DO first? Then what do we DO next?\nThe plot unfolds in time.\nWoes every one of your scenes have an event?\nWhat event caused each scene?\nWhat event might each scene cause?\n\nDecision defines character\nWatch for your character's progression of decision and how these decisions connect up to\nother characters in the play.\nFollow each character along each decision to see if each one comes out of the one before.\nAction = decisions = action.\nThat is what makes a plot come alive.\n\nURGENCY is the prime factor in a scene.\nIf a scene isn't working, look at it and determine if anything URGENT is going on.\nEx. I have to get what I want in the next five minutes.\nUrgency is a form of tension that drives the play forward, such as a need, a dream, a\nyearning, that's INTENSE.\nEvery art form has to have its own form of tension.\n\nOnce you create what your characters WANT INTENSELY in a scene, that's the\nbarometer you set the scene by.\nNot just what they want, but what they NEED.\nOnce a character makes a commitment to what they want and what they'll do to get it--\nyou (the writer) need to get down to it.\n\nYour characters may not always make the right choice of tacks/approaches/actions to get\nwhat they want. Allow them their flexibility and fallibility."
    },
    {
      "category": "Resource",
      "title": "context_wk4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-604-playwriting-i-spring-2005/6187dc80b549fd52da2098b4e057e4b3_context_wk4.pdf",
      "content": "Harrington\n21M.604 Fall 2005\nWeek 4, Handout\n\nAs to high and low context:\n\nOne of the most difficult technical challenges facing dramatic writers is high-context\nexposition. Exposition is the given circumstances that the audience needs to learn in\norder to understand the action of the story.\n\nPeople who have a low-context relations (and speak low-context dialogue) are those who\nare not familiar with each other and must explain themselves.\nExample: We frequently have low context relationships with doctors, lawyers,\naccountants, plumbers. There are people who reign over systems of knowledge which\nare mostly alien to our ears. We rely on these experts to explain to us what a left-handed\ngasket, deficit-financing, and torts are and how such things relate to our particular\nproblems. Experts are in possession of specialize information and part of their function is\nrooted in the disparity between what they know and what we know. When there is a\ndisparity of knowledge or information between people, you have a low context\nrelationship.\n\nA low-context relationship can occur outside of a professional encounter, of course.\nMeeting someone on a train or a bus. As we saw (all too briefly) in Albee, \"Who's\nAfraid of Virginia Woolf\" moves from high-context dialogue between Martha and\nGeorge, to low-context dialogue when Honey and Nick, the newcomers, enter the scene.\n\nSo what about high context dialogue and relationships?\nSimply put, people who know each other well and have shared experiences and\ninformation, speak assuming these things are known and do not need to be articulated.\nThey speak in shorthand.\nBut here's the problem: your characters may know this stuff, but your audience doesn't.\n\nSome writers have been tempted to have these characters explain this material to each\nother anyway. The result? They force characters in high-context relationships to speak\nlow-context dialogue. Mom and Dad tell each other how many children they have and\nwhat their names are. It sounds funny, and it undermines the character's credibility.\n\nSo, if you can't have the characters talk about what you want the audience to know, how\ndo you do this? How do you high-context exposition?\n\nThis takes us right back to the power of the unspoken word. You don't have to tell the\naudience the given circumstances of the play. Instead, you present BEHAVIOR that\nleads the audience to think, \"Ah, they wouldn't be doing this if that circumstance didn't\npertain.\" Again, we're back to stating premises rather than drawing conclusions. We're\noffering the audience data and inviting them to infer things from this data.\n\nWhat did we infer from what Albee showed us in that opening scene with George and\nMartha? They drink and spar to salve their pain--what's the locus of that pain? Stuck in\na university town? Stuck under \"daddy's\" thumb? A tragedy with a child? Etc, etc.\n\nJust as in the unspoken word monologue where you had to make the audience conjure up\nthe unspoken word, the challenge in this assignment is to encourage the audience to\nconjure up the exposition themselves.\n\nOne way is to have the characters deal with a problem that could exist only given the\ncircumstances you wish to expose. Don't have them talk about the circumstance itself;\nhave them negotiate over the problem.\n\nHave fun with this. Remember, you can always introduce a new character and shift from\nhigh- to low-context dialogue."
    },
    {
      "category": "Resource",
      "title": "setting_wk4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-604-playwriting-i-spring-2005/c568f7653588337c9c828f71f11a7dba_setting_wk4.pdf",
      "content": "Harrington\n21M.604 Fall 2005\nWeek 4, Handout\n\nThinking about where your play takes place.\nWhy is setting important?\n\nStatic vs. active\nContracting vs. expansive\nInteresting/new/novel vs. tried and true\nNeutral vs. charged with meaning and possibility\n\nSettings can be useful, they can actually add to the drama, help create tension.\nSettings can give your characters something to DO, something to deal with, something to\nstruggle with or against.\nThe setting can impact your characters; it can create a problem, an obstacle.\n\nThe setting can make you characters feel/remember things; i.e. as setting can be\nevocative--both for your characters and for the audience. Some classic examples: a\nFerris wheel = childhood; island = isolation; a highway = limitless possibilities, etc.\n\nA setting can be full of addition meaning; it can be associated with an important person\nor life event: Think of your high school bleachers a the football field--multiple\npossibilities--for multiple characters--a scene of triumph/failure/humiliation/ a sexual\nencounter/ a breakup/ etc.\n\nA setting can be a challenge--something to overcome, and obstacle--fear of heights, fear\nof water, fear of memory, fear of love, claustrophobia.\n\nThink of where and how you can use setting to subvert our expectations.\n\nA few examples: an intimate moment in a very publich place.\nGoing to the \"tunnel of love\" to break up.\nA battlefield and romance.\nViolence in a church or sanctuary."
    },
    {
      "category": "Resource",
      "title": "handout_wk6.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-604-playwriting-i-spring-2005/a7d2dca9d755359038374a68032e5fba_handout_wk6.pdf",
      "content": "Harrington\n21M.604 Fall 2005\nWeek 6, Handout\n\nThinking about PLOT\n\nPlot = arrangement of incidents/EVENTS.\nPlot = a series of EVENTS\nWe build EVENTS to build or create a play.\nWhat do we DO first? Then what do we DO next?\nThe plot unfolds in time.\nDoes every one of your scenes have an event?\nWhat event caused each scene?\nWhat event might each scene cause?"
    },
    {
      "category": "Resource",
      "title": "handout_wk9.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-604-playwriting-i-spring-2005/33d7649c70b3b23b6ff0ae5d371e4467_handout_wk9.pdf",
      "content": "Harrington\n21M.604 Fall 2005\nWeek 9, Handout\n\nNotes:\n\nFinding the LIVE LINE: where is your play most alive? Where does your play take us\nsomewhere new, stops the characters in their tracks, makes the audience hold its breath?\n\nPlay the reality.\nTell the truth.\n\nYou can't come to these moments unless you talk out loud.\nFight with yourself.\nPlay all the roles out loud.\n\nDon't always look to answer things with words.\nGive your characters ACTIONS which reveal them, show us something about them.\n\nContinue making lists for your characters.\nWhat they want, or what they thing they want.\nWhat they NEED--what they can't live without.\nYou'll see that you know you characters more fully now, in a deeper way.\nYou're refining their desires and motivation their desire through backstory/history.\nEVENTS.\n\nAvoid the temptation to be clever rather than real."
    },
    {
      "category": "Resource",
      "title": "in_class_wk9.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-604-playwriting-i-spring-2005/42767524c51b562cd2f07b28c813e62f_in_class_wk9.pdf",
      "content": "Harrington\n21M.604 Fall 2005\nWeek 9, Handout\n\nIn-Class Exercise: Composition\n\nDivide into groups of 3-5.\nEach group will create a 5 minute piece which is an expression of a Sam Shepard/ Fool\nfor Love world.\nThe piece will be in three parts, each with a clear beginning, middle, and end, and each\nseparated by a theatrical DEVICE such as a blackout, a voice-over, a bell, etc.\n\nThe 3 parts are titled:\n1. The way things look in this world.\n2. The way things sound in this world.\n3. The people are in this world.\n\nYou MUST include:\n1. A setting which is the perfect architectural environment for your piece.\n2. A clear role for the audience. Are we voyeurs? Judges? Historical\narchaeologists?\n3. A Revelation of Space. Example: The curtain rises and we see the stage, OR a\ndoor opens and we see endless corridors behind it.\n4. A Revelation of Object. Example: Someone opens a box and there is a gun inside\nit (or a head...)\n5. A surprise entrance\n6. Music from an unexpected source. Example: The doctor opens his medical bad\nand the aria of an operatic soprano emanates from inside it.\n7. 15 seconds of simultaneous unison action.\n8. A broken expectation.\n9. A staged accident.\n10. Two uses of extreme contrast: loud/quiet, fast/slow, dark/bright, violent/gentle,\nstill/chaotic.\n\nThe objects:\nA red dress\nA rocking chair\nA suitcase\nA shotgun\nA bottle of whiskey\nA rope\nA shoe\nA musical instrument\n\nThe sounds:\nDoor slam--exaggerated\n\nHead beating against a wall\nCar tires squealing on pavement\nA gun shot\nWhispering\nA scream\n\nThe actions:\nClutching a leg\nA slap\nA kiss\nA door slam\nHead banging against wall.\n\nThe only text you can use:\nI got a piece of ground in Wyoming.\nYour neck.\nI'm a nice guy.\nYou can take it, right?\nI don't understand how I could hate you so much.\nI promise.\nDon't go.\nThat's the woman of my dreams.\nHe's gone.\n\nYou have 30 minutes to make your piece. Go."
    },
    {
      "category": "Resource",
      "title": "handout_wk10.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-604-playwriting-i-spring-2005/d65f6989ef4a39aa2788a193e2104004_handout_wk10.pdf",
      "content": "Harrington\n21M.604 Fall 2005\nWeek 10, Handout\n\nWhen you think about revising you play, here are some questions to ask yourself:\n1. What did you like about your work?\n2. What's the major conflict? How strong is it? Strong enough?\n3. What's the dramatic ACTION of the play? What are characters doing to get what\nthey want--what actions are they taking?\n4. Did anything confuse you about your work?\n5. What's the most important image or moment for you in what you've already\nwritten?\n6. Do your characters all sound the same? Or like different people with distinct\nvoices?\n7. What does each character WANT? Are they going after something that's\ncritically important to them? Are the stakes high enough?\n8. Is the environment evocative? Does it add to the play?\n9. What sections made you cringe? Which surprised you?\n10. Can you explain what the play is about in 1 or 2 sentences? (The clearer you are,\nthe clearer it will be in the play. But sometimes we don't know the answer to this\nuntil deep into the process.)\n11. Is there anything you'd like to see more of? A more developed relationship?\nMore specific behavior from a character? Stronger needs?\n12. Were there any loose ends? Is something introduced in the play that kind of drifts\naway?\n\nRemember: in spite of whatever constructive criticism you may receive, it's ultimately\nyour play. It's not your job to do what everyone else tells you to do. Better to sift\nthrough any helpful comments and choose the ones most pertinent to your vision.\n\nIt's always a good idea to take notes when you're getting feedback on your play. Then\nyour can refer to them later. You'll also be able to see if more than one personal made a\ncomment--confusion on the part of several listeners is always a very good clue that\nsomething needs to be clearer, stronger, etc."
    }
  ]
}