{
  "course_name": "Politics and Policy in Contemporary Japan",
  "course_description": "This subject is designed for upper level undergraduates and graduate students as an introduction to politics and the policy process in modern Japan. The semester is divided into two parts. After a two-week general introduction to Japan and to the dominant approaches to the study of Japanese history, politics and society, we will begin exploring five aspects of Japanese politics: party politics, electoral politics, interest group politics, bureaucratic politics, and policy, which will be broken up into seven additional sections. We will try to understand the ways in which the actors and institutions identified in the first part of the semester affect the policy process across a variety of issues areas.",
  "topics": [
    "Humanities",
    "History",
    "Asian History",
    "Social Science",
    "Political Science",
    "Public Administration",
    "Public Policy",
    "Society",
    "Asian Studies",
    "Humanities",
    "History",
    "Asian History",
    "Social Science",
    "Political Science",
    "Public Administration",
    "Public Policy",
    "Society",
    "Asian Studies"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nPrerequisites\n\nThere are no prerequisites for this course.\n\nObjectives and Organization\n\nThe semester is divided into two parts. After a two-week general introduction to Japan and to the dominant approaches to the study of Japanese history, politics and society, we will begin exploring four aspects of Japanese politics:\n\nParty politics\n\nElectoral politics\n\nInterest group politics\n\nBureaucratic politics\n\nThe second part of the semester focuses on public policy, divided into the following seven policy areas:\n\nSocial policy\n\nForeign policy\n\nDefense policy\n\nEnergy policy\n\nScience and technology policy\n\nIndustrial policy\n\nTrade policy\n\nRequirements\n\nReading, attendance and participation are required of all students. Additional requirements are determined based on the level of the student, as follows:\n\nUndergraduates\n\nASSIGNMENTS\n\nPaper (5-7 pages) on an issue chosen from weekly discussion topics\n\nBook report (5-7 pages) on a book chosen from the list on the syllabus\n\nMidterm\n\nFinal exam\n\nSpecial discussion sessions for undergraduates are also required.\n\nGraduate Students\n\nASSIGNMENTS\n\nClassroom presentation\n\nSynthetic paper (10-15 pages) on Japanese politics\n\nSynthetic paper (10-15 pages) on public policy",
  "files": [
    {
      "category": "Resource",
      "title": "Books for Undergraduate Book Report",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-537-politics-and-policy-in-contemporary-japan-spring-2009/16474ef1e018c6cf7bdde92490282a5f_MIT17_537S09_Undergradbook.pdf",
      "content": "BOOKS FOR UNDERGRADUATE BOOK REPORT\nHISTORY:\nBarnhart, Michael A. Japan Prepares for Total War. Ithaca: Cornell University Press, 1987.\nCohen, Theodore. Remaking Japan: The Occupation as New Deal. New York: The Free Press,\n1987.\nDower, John. War Without Mercy. New York: Pantheon Books, 1986.\nDower, John. Embracing Defeat. New York: W.W. Norton, 1999.\nFujitani, T. Splendid Monarchy: Power and Pageantry in Modern Japan. Berkeley: University of\nCalifornia Press, 1996.\nGordon, Andrew. Labor and Imperial Democracy in Prewar Japan. Berkeley: University of\nCalifornia Press, 1991.\nHardacre, Helen. Shinto and the State, 1868-1988. Princeton: Princeton University Press, 1989.\nIenaga, Saburo. The Pacific War: 1931-1945. New York: Pantheon Books, 1978.\nIriye, Akira. Japan and the Wider World: From the Mid-Nineteenth Century to the Present.\nLondon: Longman, 1997.\nKeene, Donald. Emperor of Japan: Meiji and His World, 1852-1912. New York: Columbia\nUniversity Press, 2002.\nMinear, Richard H. Victors' Justice: The Tokyo War Crimes Trial. Princeton: Princeton\nUniversity Press, 1971.\nMorris-Suzuki, Tessa. Exodus to North Korea: Shadows from Japan's Cold War. Lanham:\nRoman and Littlefield, 2007.\nOhnuki-Tierney, Emiko. Kamikaze Diaries: Reflections of Japanese Student-Soldiers. Chicago:\nUniversity of Chicago Press, 2006.\nReischauer, Haru. Samurai and Silk. Cambridge: Harvard University Press, 1987.\nRuoff, Kenneth J. The People's Emperor: Democracy and the Japanese Monarchy, 1945-1995.\nCambridge: Harvard East Asian Monographs, 2001.\nSeidenstecker, Edward. Low City, High City. New York: Random House, 1983.\nSchaller, Michael. The American Occupation of Japan: The Origins of the Cold War in Asia.\nNew York: Oxford University Press, 1985.\n\nTotani, Yuma. The Tokyo War Crimes Trial. Cambridge: Harvard University Press, 2008.\nINDUSTRY AND ECONOMY:\nAllison, Anne. Millenial Monsters: Japanese Toys and the Global Imagination.\nBerkeley: University of California Press, 2006.\nGordon, Andrew. The Wages of Affluence: labor and Management in Postwar Japan.\nCambridge: Harvard University Press, 1998.\nGrimes, William W. Unmaking the Japanese Miracle: Macroeconomic Politics, 1985-2000.\nIthaca: Cornell University Press, 2001.\nHadley, Eleanor M. Antitrust in Japan. Princeton: Princeton University Press, 1970.\nJohnson, Chalmers. MITI and the Japanese Miracle, 1925-1975. Stanford: Stanford University\nPress, 1982.\nMiwa, Yoshiro and J. Mark Ramseyer. The Fable of the Keiretsu: Urban Legends of the\nJapanese Economy. Chicago: University of Chicago Press, 2006.\nNishiguchi, Toshihiro. Strategic Industrial Sourcing. New York: Oxford University Press, 1994.\nTilton, Mark. Restrained Trade: Cartels in Japan's Basic Materials Industries. Ithaca: Cornell\nUniversity Press, 1996.\nTsutsui, William M. Manufacturing Ideology: Scientific management in Twentieth Century\nJapan. Princeton: Princeton University Press, 1998\nWhittaker, D.H. Small Firms in the Japanese Economy. London: Cambridge University Press,\n1997.\nPOLITICS AND PUBLIC POLICY:\nChan, Jennifer. Gender and Human Rights Policies in Japan. Stanford: Stanford University Press,\n2004.\nFreeman, Laurie Anne. Closing the Shop: Information Cartels and Japan's Mass Media.\nPrinceton: Princeton University Press, 2000.\nGelb, Joyce. Gender Policies in Japan and the United States: Comparing Women's Movements,\nRights, and Politics. New York: Palgrave, 2003.\n\nKerr, Alex. Dogs and Demons: Tales from the Dark Side of Japan. New York, Hill and Wang,\n2001.\nLeheny, David. Think Global, Fear Local: Sex, Violence, and Anxiety in Contemporary Japan.\nIthaca: Cornell University Press, 2006.\nMulgan, Aurelia George. Japan's Failed Revolution: Koizumi and the Politics of Economic\nReform. Canberra: Asia Pacific Press, 2002.\nSamuels, Richard J. Securing Japan: Tokyo's Grand Strategy and the Furture of East Asia.\nIthaca: Cornell University Press, 2007.\nSeraphim, Franziska. War Memory and Social Politics in Japan, 1945-2005. Cambridge:\nHarvard University Press, 2007.\nSCIENCE AND TECHNOLOGY:\nBartholomew, James A. The Formation of Science in Japan. New Haven: Yale University\nPress, 1989.\nColeman, Samuel. Japanese Science: From the Inside. London: Routledge, 1999.\nLesbirel, S. Hayden. NIMBY Politics in Japan: Energy Siting and the management of\nEnvironmental Conflict. Ithaca: Cornell University Press, 1998.\nMorris-Suzuki, Tessa. The Technological Transformation of Japan: From the Seventeenth to the\nTwenty-First Century. Cambridge: Cambridge University Press, 1994.\nSamuels, Richard J. \"Rich Nation, Strong Army\": National Security and the Technological\nTransformation of Japan. Ithaca: Cornell University Press, 1994.\nSugimoto, M. and D. Swain. Science and Culture in Traditional Japan, A.D. 600-1854.\nCambridge: MIT Press, 1978.\nUehara, Cecil. The U.S.-Japan Science and Technology Agreement: A Drama in Five Acts.\nAldershot: Ashgate, 2000.\nWilkening, Kenneth E. Acid Rain, Science, and Politics in Japan. Cambridge: MIT Press, 2004.\nSOCIETY:\nAllison, Anne. Nightwork: Sexuality, Pleasure, and Corporate Masculinity in a Tokyo Hostess\nClub. Chicago: University of Chicago Press, 1994.\nBestor, Theodore C. Tsukiji: The Fish Market at the Center of the World. Berkeley: University\nof California Press, 2004.\n\nBrinton, Mary. Women and the Economic Miracle. Berkeley: University of California Press,\n1993.\nDore, Ronald. Shinohata. New York: Pantheon Books, 1978.\nField, Norma. In the Realm of a Dying Emperor. New York: Pantheon, 1992.\nFowler, Edward. San'ya Blues: Laboring Life in Contemporary Tokyo. Ithaca: Cornell\nUniversity Press, 1997.\nFruhstuck, Sabine. Uneasy Warriors: Gender, Memory, and Popular Culture in the Japanese\nArmy. Berkeley: University of California Press, 2007.\nHicks, George. Japan's Hidden Apartheid: The Korean Minority and the Japanese. Brookfield,\nVT: Ashgate Publishing, 1997.\nKumazawa, Makoto. Portraits of the Japanese Workplace. (A. Gordon, ed.) Boulder, CO:\nWestview press, 1996.\nOgasawara, Yuko. Office Ladies and Salaried Men: Power Gender, and Work in Japanese\nCompanies. Berkeley: University of California Press, 1998.\nRoth, Joshua Hotaka. Brokered Homeland: Japanese Brazilian Migrants in Japan. Ithaca: Cornell\nUniversity Press, 2002.\nSchoppa, Leonard J. Race for the Exits: The Unraveling of Japan's System of Social Protection.\nIthaca: Cornell University Press, 2006.\nScott-Stokes, Henry. The Life and Death of Yukio Mishima. New York: Farrar, Straus, and\nGiroux, 1974.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n17.537 Politics and Policy in Contemporary Japan\nSpring 2009\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Economic Concerns and Bureaucratic Politics in Japan’s Interwar Years",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-537-politics-and-policy-in-contemporary-japan-spring-2009/e0575d818f5baa98dca3657016af4970_MIT17_537S09_paper1.pdf",
      "content": "Economic Concerns and Bureaucratic Politics in Japan's Interwar Years\n17.537 Paper 1\nIn Japan Prepares for Total War: The Search for Economic Security, 1919-1941,\nMichael A. Barnhart chronicles the history of Japan's futile search for autarky in the\nyears leading to the Pacific War.1 In examining the vital linkage between economics and\nnational security in this period, Barnhart makes the argument that the perception of\neconomic vulnerability as the main security issue facing Japan, combined with\nbureaucratic politics in the form of army-navy inter-service rivalries, led directly to both\nthe impulse for empire in resource-rich mainland Asia and the attack on Pearl Harbor.\nHowever, Barnhart's history charts Japan's search for economic security without\nexplaining its justification for and entitlement to seizing the resources and land of others,\noften brutally so. As such, the sterility of Japan Prepares for Total War downplays the\nrole of racist attitudes and cultural myths in engendering the events described.\nNonetheless, with strong evidentiary support Barnhart makes a compelling case for the\nascendancy of economic considerations and bureaucratic politics as the causal factors in\nJapan's attack of the United States on December 7th, 1941.\nBarnhart posits that Japan's interpretation of the lessons of World War I drove its\nleaders to view autarky as the basis for grand strategic planning. After all, Germany,\npossessor of a stronger military than its conquerors, had succumbed to defeat in WWI\nbecause it lacked an industrial base able to mobilize to a degree freeing it from economic\ndependence on other nations. Such dependence creates vulnerability because the\ndependent nation is subject to the whims and economic pressure of those nations on\nCourtesy of\nstudent. Used\nwith permission.\n\nwhich it depends. Japan had defeated Western power Russia in the Sino-Soviet conflict\nof 1904-1905, but its status as a resource-poor nation caused a number of influential\ncivilian elites and military officers to become advocates of \"total war,\" or the national\ncapacity to not only wage war with strong military forces but with the economic\ncapability to supply all needed war materiel. Two essential elements were necessary for\nthis plan to succeed in establishing autarky and thus security: a peace of at least five years\nwith the hegemonic United States, and natural resources such as iron and oil. These\nmaterial resources could be had on the Asian mainland, specifically in Manchuria and\nsubsequently in China proper. As Barnhart points out, the Japanese chose to forcibly\nacquire these resources from its mainland neighbors, and this course of action brought it\ninto conflict with the free trade philosophy and Open Door policy of the United States.\nJapan's course to national mobilization and self-sufficiency included the creation\nof a puppet state for the economic exploitation of Manchuria; Manchukuo was created in\n1932 in concert with Japan's first long-term mobilization plan. After \"rational\nmobilization\" of the domestic economy, Japan's increasingly imperial interests turned to\nChina while the military's share of the budget rose to 45 percent. In 1937 Japanese\nforces commenced what Barnhart concededly calls the \"China Incident,\" in which China\nand its resources were claimed by Japan under the guise of establishing a Japanese-run\ncorporation for economic development of the region.\nBarnhart adeptly points out the ironies in Japan's fight to acquire the Chinese\nmainland as a strategic resource. The original total war proponents understood the threat\nto security that belligerence in China caused for Japan: the United States, in defending\nthe Open Door policy in China, might deny Japan the indispensable resources like\n\nmachine tools that it required to achieve self-sufficiency. Additionally, Japan's domestic\neconomy and citizenry were greatly strained in what Barnhart terms the \"bitter mortgage\"\nof funding the efforts of empire in China. Barnhart therefore argues that Japan's\naggressive imperial activities on the Asian mainland were counterproductive in its quest\nfor autarky: they threatened the necessary peace with the United States and came at\nextreme costs to the Japanese nation.\nJapan Prepares for Total War also contends that bureaucratic politics,\nspecifically the competing interests of Japan's army and navy, played a significant role in\nshaping policy and determining the sequence of events leading to the Pacific War. In\nbureaucratic politics, the players in a government bargain and compete according to their\norganizational interests, resulting in policy that is not the product of a single rational\ndecision but is instead an amalgam of the visions and choices of the players involved.2\nThe army and navy in pre-WWII Japan were both strong players in compelling the\nnation's political leaders to allocate resources according to their perceived needs;\nBarnhart offers a number of examples of how their economic demands for strategic\nresources like iron and oil led to further pressures to expand the Japanese empire in order\nto acquire such goods.\nAdditionally, Barnhart takes the position that differing strategic conceptions of\nhow to best approach the Southward Advance to commandeer the Dutch and French\ncolonies of Southeast Asia fed a growing inter-service rivalry. This rivalry between the\nImperial army and Imperial navy overshadowed rational considerations of the diplomatic\nand economic ramifications of the United States' reaction to aggressive Japanese\nimperialism as a means of achieving autarky. Barnhart documents that the navy in\n\nparticular instituted a practice of exchanging \"more vigorous foreign policies\" for greater\nresource allocations of strategic materials, and he argues that the military as a whole\nserved as the \"engine of real change\" in Japanese policy with regard to economic\nexpansion as a means of achieving national security. The quest of each service to outbid\nthe other in acquisition of strategic materials therefore led to the diversion of goods and\nfunds from exports and the domestic economy to meet military demands. It also led to\nthe commercial pressures the United States somewhat ironically imposed to punish Japan\nfor its imperialist imposition and attempt to create a sphere of economic and political\ninfluence in mainland Asia.\nIndeed, the economic measures that the United States adopted in Japan's interwar\nyears to stem the flow of Japanese aggression exacerbated the international situation\nbecause the Japanese elites in power at various points in the course to war were either\nunwilling to abandon mobilization plans or unable to do so because of military pressures\nand demands. The moral sanctions and embargoes on goods such as aluminum and\naviation fuel became progressively steeper as Japan sought more territory and strategic\nresources in Asia. Finally, the United States decided to freeze Japanese assets, and that\nfreeze quickly morphed into full embargo. Barnhart makes the point that this decision\nreflected an unshakable belief on the part of United States leaders that Japan could not be\ndeterred in the Southward Advance but might be slowed by even more drastic economic\nmeasures. He attributes the Japanese response, to push on with the advance, to the two\nfactors he assigns ultimate importance in determining the outcome of the clash between\nthe two powers: economic motivations and bureaucratic politics. Japan's grand strategic\nmotivation was the pursuit of autarky, and Barnhart argues that the July 2nd decisions for\n\nhow to best achieve that goal were an amalgam of the opposing viewpoints of the army\nand navy, resulting in decisions that were rational in that they were the only politically\npossible decisions within the Japanese government of the time.\nDespite Barnhart's strengths in precisely documenting the changing economic\ncondition of Japan in the interwar years and how its internal political dynamics and\nstrategy shaped its path to war, Japan Prepares for Total War fails to address the cultural\nattitudes and myths that enabled its feelings of entitlement in the region. For example,\nscholars such as John Dower have suggested that cultural myths like that of Japanese\ndescent from goddess Amaterasu Omikami were used as the psychological motivation for\nmobilizing the Japanese people and justifying horrific actions against other Asian peoples\nin the name of Japan's economic interests.3 Such cultural myths identified Japan and the\nJapanese people as holding a unique, predetermined status as the chosen natural rulers of\nAsia by virtue of their special descent from the true gods. Barnhart identifies the primary\nmotivation of Japan in its imperialist pursuits as strategic resource acquisition. While his\napplication of economic theory has wide explanatory power in the actions that the\nJapanese took in the pursuit of autarky, it does not explain why they felt entitled to or\njustified in their abuse of the territorial and human rights of other Asians.\nFurthermore, Barnhart is careful to avoid overt statement of the brutality of the\nJapanese military in imperialist \"incidents.\" For example, in the attack against Nanking\nthat many scholars have characterized as rife with atrocities, Barnhart comments that it\nwas an \"unbounded military success;\" his only concession to its putative unusual\nbrutality is that the State Department condemned it as \"contrary to the principles of law\nand humanity.\" Although it is perhaps common to dehumanize an enemy in war and thus\n\nBarnhart might choose to leave discussions of Japanese brutality to other scholars\nbecause it is common to dehumanize an enemy in war, but he could strengthen his\nargument for economic motivations by discussing how a feeling of racial, national or\ncultural superiority played a role in justifying Japanese entitlement to control of the lands\nand resources of others. Moreover, justification for such Japanese positions as the Amau\nDoctrine, which claimed the Japanese right to supervise economic development of China\nand barred all other nations from that right, was clearly based on more than Japanese\neconomic need, as it claimed Japan had a special right to control China, indicating a\nfeeling of either extreme paternalism or inherent superiority to China.\nWhile racist cultural myths are largely ignored by Barnhart, racism and\nmisperception in international diplomacy are touched on as factors in the myriad\nmisunderstandings that occurred between Japan and the United States. In Japan\nPrepares for Total War, both Japan and the United States are characterized as often\nsuspecting the other side of \"cunning\" and \"crafty\" behavior, and President Roosevelt is\nnoted as consistently holding an \"anti-Japanese\" attitude. These attitudes led to irrational\nfears; for example, Barnhart notes that Roosevelt feared a Japanese attack on the West\nCoast to the extent that he had crabbing operations checked for the possibility that the\nJapanese might use them as bases for war. Japan, too, based a number of decisions on\nmisperceptions of the stance of the other side; for instance, it believed for a time that the\nDraft Understanding was a formal United States policy position, and thus changed its\nestimate of the probability of war with the United States, leading to confidence in more\naggressive behavior. Barnhart demonstrates that racism and misunderstandings thus\ncontributed to the policies of the time period in question, but such a nod to the role of\n\nracism and misperception in policy is curious when his argument neglects to explain the\npossible of role of racism as justification for forcible economic expansion of Japan.\nIn conclusion, Japan Prepares for Total War is an economic history, one that\nserves its stated purpose of contributing to an understanding of how Japan's economic\nconcerns and inter-service rivalries contributed to bringing about the Pacific War.\nDiscussion of Japanese paternalism or racism in the pursuit of autarky is largely avoided\nby Barnhart, and this avoidance detracts to a small extent from the explanatory power of\neconomic vulnerability and internal political dynamics as the causal variables in Japanese\nimperialism and attack on the United States. Perhaps Barnhart is merely trying to\nachieve objectivity and avoid a condemnatory tone, but in failing to question the\nlegitimacy of Japan's special right to control the rest of Asia, he misses the opportunity to\nexplain the role of the values and attitudes that supposedly lent justification to Japan's\nright to cruelly exploit its Asian neighbors. Despite this criticism, Japan Prepares for\nTotal War: The Search for Economic Security, 1919-1941 offers a detailed and thought-\nprovoking account of the ironies of US-Japan relations and mistakes in the years\npreceding the Pacific War.\n1 Barnhart, Michael A. Japan Prepares for Total War: The Search for Economic Security, 1919-1941.\nIthaca, Cornell University Press: 1987.\n2 Allison, Graham T. and Halperin, Morton F. \"Bureaucratic Politics: A Paradigm\" World Politics 24,\nsupplement (Spring 1972): 40-79.\n3 Dower, John. Embracing Defeat: Japan in the Wake of World War II. New York: Norton, 2000.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n17.537 Politics and Policy in Contemporary Japan\nSpring 2009\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Japan Votes: Rational Choices and Social Obligations",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-537-politics-and-policy-in-contemporary-japan-spring-2009/5dd09f2294003ff83c70ead275b02712_MIT17_537S09_japanpaper2.pdf",
      "content": "Japan Votes: Rational Choices and Social\nObligations\n17.537 Paper 2\nCourtesy of\nstudent. Used\nwith permission.\n\nJapan is not unique in its status as a parliamentary democracy. In Japan, as in\nother parliamentary democracies, people vote for politicians, and politicians seek to win\nvotes in exchange for power within government. It is in the strategies voters employ in\nmaking voting decisions and the complementary strategies politicians craft to influence\nthose voting decisions that scholars contend the Japanese electoral system is unique. This\nuniqueness stems from the distinctive structural feature of many relationships and\norganizations in Japan: vertical, as opposed to horizontal, solidarity. Japanese voters and\npoliticians act within their vertically organized system in ways that seek to both\nmaximize utility and fulfill social obligations. The resultant strategies adopted by voters\nand politicians in voting and vote seeking are best explained by examination of both\nsociocultural and rational choice economic factors.\nIn this paper I will first present the model of Japan as a patron-client democracy\nas advanced by scholars Chie Nakane and Nobutaka Ike. I will argue that this\ncharacterization and its implications of vertical solidarity apply to the Japanese electoral\nsystem. Subsequently, I will present descriptions of social obligations, networks, and\nkoenkai and discuss them in the context of vertical relationships. I will then reexamine\nthese social phenomena of the electoral process from a rational choice economic\nperspective and argue for voting strategies that maximize economic and political utility\nfor the individual. I will conclude this paper by incorporating social and rational choice\nfactors into an explanation of the patron-client model of voting in Japan.\nIn 1970 Chie Nakane typified Japanese society as a hierarchy in which superiors\nand inferiors form patron-client relationships. In these relationships, patrons represent\nthe interests of their clients in return for client loyalty, and emotional ties between\n\npatrons and their clients are assumed. Most importantly, group solidarity is found\nvertically, or by institution or family unit. In other societies, solidarity is based\nhorizontally on shared placements within the social hierarchy; an example is the\nsolidarity amongst mine workers in the United States. Contrastingly, solidarity exists in\nJapan for all workers of a particular company, not for all workers of a particular type.\nIn Japanese Politics: Patron-Client Democracy, Nobutaka Ike applies this\nconception of Japanese social organization to Japan's government. Ike argues that\npatron-client social relationships have helped form group-centered patron-client\ndemocracy, in which \"individuals...tend to relate to the political system through their\npatrons, who typically are local notables, political bosses, union leaders, local politicians,\nand leaders of local organizations\" (1972, p.19). It is a logical extension of this patron-\nclient conception of the Japanese political system to view voter behavior and vote-seeker\nbehavior as functioning within the vertical system. Voters are clients that expect political\npatrons to provide for their particular needs. Patrons provide goods such as local public\nworks to their clients. Thus, in the vertical relationship voting model, personal\nconnections and expectations of care supersede ideologies as the basis for voting choices.\nBecause the electoral system in Japan is structured to allow local representation through\nits districting, local politicians serve as local patrons in patron-client democracy. At the\ncentral level, nationally elected politicians should typically vertically represent the\norganizations of institutions such as the Japan Medical Association. If Japanese\ndemocracy can be modeled as patron-client, it is probable that Japanese voter and vote-\nseeker behavior in the electoral system can be understood within the patron-client vertical\nmodel.\n\nSocial obligations in vertical relationships play a role in voter mobilization and\nvoter behavior, as evidenced by the phenomenon of social obligation voting and the local\nsupport network known as the koenkai. Gerald Curtis describes social obligation voting,\nor the \"hard vote,\" as a vote based on personal ties (1971, p. 38). This \"hard vote\" is\ndescribed as a cultural phenomenon arising from giri, or obligation to those who have\nreached a voter through a web of personal relationships. The conception of social\nnetworks as an important factor in voter mobilization and behavior is supported further in\nthe writings of Scott Flanagan, who posits that social network influences manifest\nthemselves in voter behavior characterized by assimilation effects, reference group\neffects, opinion leader effects, and effects of mobilization (1991). Assimilation of voting\nchoice in reference groups such as family units under the influence of the family leader,\nor patron, is in accord with the vertical conception of Japanese social arrangement and\nelectoral behavior because it reflects vertical solidarity of people in patron-led groups.\nVertically organized voter mobilization reflecting the patron-client relationship is\nobservable in the koenkai.\nThe koenkai is a politician's local personal support network, made up of\nassociations representing institutions and social groups like schools and local businesses.\nAs documented by Hideo Otake, the koenkai act as vertically organized political\nmobilization institutions (1998). They are hierarchically organized around their\npolitician patrons, who benevolently look after the interests of their local client voters in\nexchange for ballot loyalty. Koenkai also reflect an expected outcome of politicians'\nmobilization strategies in society characterized by vertical relationships in that they are\nlocal, comprised of people sharing a relationship within a particular geographical region\n\nand not a horizontal solidarity, such as a national association of workers of a particular\ntype gathering as a personal support system for a politician.\nJust as koenkai can be viewed as demonstrative of the importance of social ties in\nJapanese voter mobilization and behavior, they can be interpreted as presenting important\nsupport for a rational choice economic rationale for voting and vote-seeking strategies in\nJapan. Hideo Otake acknowledges that the koenkai functions not only as a social\norganization for voter mobilization, but also as an outright spoils distribution system\n(1998). Such an admission acknowledges that a type of market is inherent in the\nrelationship between voter and vote-seeker: the promises of tangible goods and services\nto be delivered to individuals or communities by politicians are purchased by voters with\ntheir votes. This conception of Japanese voters as rational actors seeking economic\nbenefits for themselves through the political system is supported by the fact that Japanese\nvoters are among the most literate and informed voters in any modern parliamentary\ndemocracy. Furthermore, emphasizing the significance of the utility a particular\npolitician might bring to the voters who support him credits the fact that Japan is a\nmodern nation and that the vestiges of feudalism no longer institutionally limit those\nindividuals lower in the power hierarchy from seeking personal gain through the political\nsystem.\nNeither the rational choice economic view of voter mobilization and behavior nor\nthe sociocultural account solely explains the Japanese electoral process. Rather, the two\ncan supplement each other in providing explanations for the mechanisms and trends at\nwork in Japanese elections. For example, many citizens that are a part of the electorate in\nJapan choose not to exercise their right to vote (Passin 1979). Those advocating a social\n\napproach to voting behavior might posit that qualified members of the electorate not\ninvolved in specific social networks due to the increasing mobility of the industrialized,\ntechnological world would thus not feel the obligation to support a patron-politician\nbecause they would not expect their needs to be met by such a figure, even if they offered\nballot loyalty. Those advocating rational choice might posit a case of rational apathy to\npolitics, or even rational ignorance, on the part of electorate members choosing not to\nvote. As political events such as the Lockheed and Recruit scandals have diminished\npublic confidence in the political system's ability to fulfill their needs, voters may feel\nthat gathering information about parties and candidates is too costly in terms of their time\nwhen they believe that their votes will bring them no tangible benefits, and so they do not\nparticipate in elections. These two explanations for those who fail to participate in the\nelectoral system in Japan are mutually exclusive, and when combined they have\nexpanded explanatory power.\nIn conclusion, both social explanations and rational choice explanations for voter\nbehavior and mobilization in Japan have weaknesses, and a combination of these\nexplanations thus enriches the patron-client vertical relationship model of Japanese\nvoting behavior by addressing the weaknesses of each particular viewpoint. As pointed\nout by Gerald Curtis, a rational choice economic perspective of voting behavior makes\nthe assumption that voting takes place in a system in which voters are always well-\ninformed and structural and institutional features of the system allow them to make a\nrational choice (1971). Moreover, rational choice theory tends to ignore the biases and\nassumptions an individual brings to a decision. Social relationship theories can be\nchallenged in that modernization theory claims that the patronage system is supposed to\n\nfade with modernization, and that they may also attribute too much uniqueness to Japan.\nFor instance, reciprocity in human relationships and obligation in human relationships are\narguably world norms, and thus obligations and social networks may not be the best picks\nin finding causal factors for the peculiarities of the Japanese voting system. Rational\nchoice theory addresses voting choices from an individual perspective, and social\nnetwork theory from a social perspective, and thus they can complement each other in\nfostering a more complete understanding of how voters and vote-seekers interact in\nJapan's vertically organized democratic and electoral systems.\nReferences\nCurtis, Gerald. Election Campaigning Japanese Style. New York: Columbia University\nPress, 1971.\nFlanagan, Scott. \"Mechanisms of Social Network Influence in Japanese Voting,\"\nChapter Four in Flanagan, ed. The Japanese Voter. New Haven: Yale University\nPress, 1991.\nIke, Nobutaka. Japanese Politics: Patron-Client Democracy. New York: Alfred A.\nKnopf, 1972.\nNakane, Chie. Japanese Society. Berkeley, Calif,: University of California Press, 1970.\nOtake, Hideo. \"How a Diet Member's Koenkai Adapts to Social and Political Changes,\"\nChapter One in Otake, ed. How Electoral Reform Boomeranged: Continuity in\nJapanese Campaigning Style. Tokyo: Japan Center for International Exchange,\n1998.\nPassin, Herbert, ed. A Season of Voting: The Japanese Elections of 1976 and 1977.\nWashington D.C.: American Enterprise Institute for Public Policy Research,\n1979.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n17.537 Politics and Policy in Contemporary Japan\nSpring 2009\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}