{
  "course_name": "Political Economy of Globalization",
  "course_description": "This is a graduate seminar for students who already have some familiarity with issues in political economy and/or European politics. The objective is to examine the ways in which changes in the international economy and the regimes that regulate it interact with domestic politics, policy-making, and the institutional structures of the political economy in industrialized democracies.",
  "topics": [
    "Business",
    "Globalization",
    "Social Science",
    "Economics",
    "International Economics",
    "Political Economy",
    "Political Science",
    "Business",
    "Globalization",
    "Social Science",
    "Economics",
    "International Economics",
    "Political Economy",
    "Political Science"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 2 hours / session\n\nDescription\n\nThis is a graduate seminar for students who already have some familiarity with issues in political economy and/or European politics. The objective is to examine the ways in which changes in the international economy and the regimes that regulate it interact with domestic politics, policy-making, and the institutional structures of the political economy in industrialized democracies.\n\nWe begin with an examination of these issues in historical terms during the 19th and early 20th centuries. We then consider the intensification of trade and financial flows in recent years associated with 'globalization' asking if these differ from past experience, how they affect domestic politics and policy-making, and whether other pressures are at work here. We enquire into the responses available to national states in the face of such developments and the implications of these responses for the state and society.\n\nThe objective is to examine some of the most provocative contribution in a large literature with a view to establishing the key issues and promising ways to investigate them.\n\nCourse readings emphasize the cases of Western Europe, but discussion will cover general issues applicable across the industrialized world.\n\nStrongly recommended background reading: Martin Wolf.\nWhy Globalization Works\n. New Haven, CT: Yale University Press, 2004. ISBN: 9780300102529.\n\nGrading\n\nStudents are required to prepare a research paper on topics related to the subject of the course\nor\nwrite two short essays (12-15 pages) based on course readings. The grade is based on these, with some allowance made for contribution to class discussion.",
  "files": []
}