{
  "course_name": "Polymer Science Laboratory",
  "course_description": "Experiments in this class are broadly aimed at acquainting students with the range of properties of polymers, methods of synthesis, and physical chemistry. Some examples of laboratory work include solution polymerization of acrylamide, bead polymerization of divinylbenzene, and interfacial polymerization of nylon 6,10. Evaluation of networks by tensile and swelling experiments, rheology of polymer solutions and suspensions, and physical properties of natural and silicone rubber are also covered.",
  "topics": [
    "Engineering",
    "Chemical Engineering",
    "Polymers",
    "Materials Science and Engineering",
    "Polymeric Materials",
    "Science",
    "Chemistry",
    "Physical Chemistry",
    "Engineering",
    "Chemical Engineering",
    "Polymers",
    "Materials Science and Engineering",
    "Polymeric Materials",
    "Science",
    "Chemistry",
    "Physical Chemistry"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 1 hour / session\n\nLabs: 2 sessions / week\n\nLab 1: 3-4 hours / session\n\nLab 2: 3-4 hours / session\n\nAttendance\n\nIt is required that you attend all lectures. Exams will cover lecture and lab material.\n\nThis is a relatively fast-paced lab course. For this reason,\nLab Attendance is required of all students in each group\n. Attendance will be taken, and lab attendance will be counted as part of the lab grade. If there is a reason you cannot make it to lab, you must contact\n\nyour lab TA and\n\nat least one member of your lab group prior to the lab period.\n\nReferences\n\nSuggested Readings will be given in the Lab Handouts in lecture or the lab.\n\nOther material may be given to you in the form of handouts from books during the course.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nLab Reports / Write-ups\n\n50%\n\nCI-M Assignments\n\n20%\n\nExams, Classroom\n\n30%",
  "files": [
    {
      "category": "Resource",
      "title": "1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-467-polymer-science-laboratory-fall-2005/dc50853eeca6fc58fae5f82c070debbe_1.pdf",
      "content": "Experiment 1: Polymerization of acrylamide in water\nAim: (a) To polymerize acrylamide (monomer) in water to polyacrylamide (polymer) by\nfree radical polymerization using a \"redox\" pair of initiators.\n(b) To follow the kinetics of polymerization by monitoring the variation of\ntemperature and viscosity (measured by using Stokes Law for falling spheres) with\ntime.\nMaterials and Apparatus:\nSolution I (Stock acrylamide solution): 30 wt/vol % acrylamide in water\nSolution II (Dilution solution): 0.05 M NaNO3 + 0.02 % NaN3 in Milli Q water or\nequivalent.\nRedox initiator AMPS (ammonium persulphate), granular solid, MW 232 g/mol\nRedox initiator TEMED (tetramethylethylene diamine), liquid, density 1g/ml, MW\n116 g/mol\nThermocouple set and read-out\n250 ml Erlenmeyer flasks\nScrew cap plastic test tubes (~ 5 \" long)\nGlass beads (3 mm)\nGlass \"wool\" insulation\nParafilm\nStop watch\nElectric balance\nHelium or nitrogen tank with reducing valve (multiple outlets)\nSparge tips\nBrief Background:\nFree radical chain polymerization: (see handout from Rempp & Merrill, Polymer Synthesis,\npp65-78)\nChain polymerization is the process by which a polymer chain grows by addition of\nmonomers - single units - only; growth does not occur by addition of oligomers -multiunit\nsegments. Free radical polymerization is one type of chain polymerization. Cationic and\nanionic polymerizations are other kinds of chain polymerization.\nFree radical polymerization produces \"linear\" strings of monomer units by a chain\nreaction started by free radical initiators. Reaction I below shows the key reaction of\npropogation, that a chain initiated by a radical R already having n vinyl units (i) adds another\n\nmonomer (ii) to its active radical end, thereby making the added monomer the new active\nend.\nR-(CH2CHX)n-1\nCH2C\nH\nX\n- +\nH2C\nC\n\nX\nH\nR-(CH2CHX)n\nCH2C\nH\nX\n-\n(i)\n(ii)\nReaction I\nKinetics of polymerization:\nFor homopolymerization and certain conditions, the conversion can be expressed as\nfollows:\nMo - M\nConversion =\n= 1 - e-Gt\n(1)\nMo\nwhere,\nMo = Initial monomer concentration\nM = Monomer concentration at any time, t\nG = \"Group constant\" which is a function of the rate constants involved in the reaction\nmechanism and the concentrations of the initiator. G need not be a constant.\nThus, as polymerization proceeds, conversion increases with time. If the\npolymerization process is exothermic then the increasing conversion results in the release of\nheat with time. In an adiabatic system, this heat realeased can be measured as a temperature\nincrease and be used to monitor the kinetics of polymerization.\nAlso note that to a first approximation, the sum of monomer and polymer\nconcentrations is constant. For example, 4 % monomer (4g/dl) solution has no polymer\ninitially. At 50 % conversion, 2 g/dl of monomer and 2 g/dl of polymer coexist. At 100 %\nconversion, monomer has been completely depleted. Only 4 g/dl of polymer exists.\nFree radical polymerization of acrylamide:\nIn the case of the polymerization of acrylamide to polyacrylamide, the monomer is\n(iii) given below:\n\nH\nH2C C\nC\nO\n\nNH2\n(iii)\nThe polymerization of acrylamide in water solution is of interest because the rate\nconstant kp for the propogation reaction I is unusually large, the rate constant for\ntermination relatively low, the so called transfer processes (to monomer, to solvent) very\nlow. As a consequence very long chains (high degrees of polymerization) are created.\nConversion of monomer to polymer is nearly complete within half an hour, not only\nbecause kp is large but also because the rate of generation of free radicals which start the\ncopolymerization is made large by the use of a \"redox\" (reduction-oxidation) pair of\ninitiators. One of this pair by itself would produce radicals at a much lower rate, and the\nother by itself would not generate any radicals. The redox pair we will use is AMPS\n(ammonium persulfate, (iv)) and TEMED (tetramethyl ethylene diamine, (v)). The reaction\nleading to radical production is shown in reaction II. The radicals are (vi) and (vii).\nAmmonium bisulfate (viii) is the inert by-product.\nO\nO\n[II]\nNH4+\nOSO OSO-NH4+\n+\nNCH2CH2N\nO\nO\n(iv)\n(v)\nO\n-\n+\nNH +HSO\nO\nNH4+\nOSO\n+\nNCHCH2N\n(vi)\n(vii)\n(viii)\nAtmospheric oxygen is a dramatic inhibitor of polymerization. It can be removed by\nsparging the acrylamide solution with an inert gas like nitrogen, helium or argon.\nThe enthalpy of polymerization is around 15000 cal/mol (exothermic), thus around 225\ncal/g of monomer polymerized. If this enthalpy is released adiabatically, the temperature rise\nwill amount to several degrees, which can be monitored by us.\n\nDegree of polymerization, molecular weight and viscosity:\n(See handout from Rabek,\nExperimental Methods in Polymer Science, Ch3 and Ch 9.)\nAs conversion increases, the polymer chains grow in length. The increase in length\ncauses an increase in the viscosity of the polymer solution. This increase in viscosity can\nalso be used to monitor the kinetics of polymerization. Some terms relating to the length of\nthe polymer chain need to be defined:\nThe degree of polymerization is defined as the number of monomer units\nincorporated into the polymer chain during the lifetime of the chain.\nThe molecular weight of the chain is the degree of polymerization multiplied by the\nmolecular weight of the repeat unit. (For the case of acrylamide, the molecular weight of the\nrepeat unit is 3 C @ 12 g/mol + 1 O @ 16 g/mol + 1 N @ 14 g/mol + 5 H @ 1 g/mol = 71\ng/mol.)\nTypically, any polymerization produces chains of various molecular weights i.e.,\nthere is a distribution of molecular weights or degrees of polymerization. Hence, there is a\nneed for measures of the average molecular weight and the spread of the distribution. The\ntwo most common averages of the distribution are the number average Mn and the weight\naverage Mw. The spread of the distribution is measured by the polydispersity index (PDI)\nwhich is the ratio Mw/Mn.\nAs the molecular weight increases, the viscosity of the polymer solution increases.\nTypically, the \"zero shear\" viscosity varies with the molecular weight (M) and concentration\n(c) as follows;\nη (0) ~ c2.5 M3.4\n(2)\nViscosity measurement using Stokes Law: (See addendum on the Falling Ball Viscometer)\nA solid sphere (of radius R and density ρS) falling through a liquid (of viscosity η\nand density ρL) under the action of gravitational forces (gravitational acceleration, g)\nacquires a steady terminal velocity Vt. Under these conditions, the viscosity of the liquid is\ngiven by the following equation:\n2 (ρS-ρL)R2g\nη =\n(3)\n9 Vt\nPolyacrylamide:\nPolyacrylamide solutions and variations of PAM solutions are widely used as model\nsolutions for rheological studies on polymer solutions.\n\n________________________________________________________________________\n________________________________________________________________________\n------------------------------------------------------------------------------------------------------------\n------------------------------------------------------------------------------------------------------------\n------------------------------------------------------------------------------------------------------------\nx\nPrecautions:\nNo special precautions. Follow general precautions.\nProcedure:\nFor each of 3 runs:\n1.\nIn preparation for the viscosity test, set aside a screw cap plastic test tube with a\n3mm glass bead inside it.\n2.\nMix Solution I and Solution II to produce a total of 200 ml, of x wt/vol %. Split the\n200 ml into two approximately equal volumes of 100 ml each. Use 250 ml Erlenmeyer\nflasks.\n3.\nAdd y grams of AMPS to one flask and z grams of TEMED to the other flask and\nthen swirl each flask to dissolve the added redox initiator. Sparge each flask with helium or\nnitrogen for at least 10 minutes. Be sure to use clean sparge tips.\nTable: Recipes\nVariation\nRun 1\nRun 2\nRun 3\nTeam A,D\ny & z\nx=4% [0.56M]\nx=4% [0.56M]\nx=4% [0.56M]\ny=0.10g [2.15X10-3M] y=0.10g [2.15X10-3M] y=0.20g [4.30X10-3M]\nz=0.05ml[2.15X10-3M]\nz=0.10ml[4.30X10-3M] z=0.10ml[4.30X10-3M]\nTeam B,E\nx=2% [0.28M]\nx=4% [0.56M]\nx=6% [0.84M]\ny=0.10g [2.15X10-3M] y=0.10g [2.15X10-3M] y=0.10g [2.15X10-3M]\nz=0.05ml[2.15X10-3M]\nz=0.05ml[2.15X10-3M] z=0.05ml[2.15X10-3M]\nTeam C,F\ny & z\nx=6% [0.84M]\nx=6% [0.84M]\nx=6% [0.84M]\n(y=z)\ny=0.05g [1.08X10-3M] y=0.10g [2.15X10-3M] y=0.20g [4.30X10-3M]\nz=0.025ml[1.08X10-3M] z=0.05ml[2.15X10-3M] z=0.10ml[4.30X10-3M]\n4.\nAdd the contents of one flask into the other. Simultaneously, start the stop watch\n(This shall be time = 0 for both temperature and viscosity measurements). Mix the solution\nby swirling.\n\n________________________________________________________________________\n________________________________________________________________________\n5.\nPour some of this solution to completely fill (to overflowing) the test tube set aside\nin step 1. Screw the cap on to the filled tube to exclude any bubbles of air. Every minute,\ninvert the tube and estimate the time it takes for the glass bead to fall from the top to bottom.\n6.\nSet up the 250 ml Erlenmeyer flask with the remaining solution (approx. 200 ml),\nsurrounded by glass fiber (glass \"wool\") as insulation. Inset a thermocouple probe through\nthe parafilm or a stopper that excludes air. Allow the remaining solution to polymerize.\nRecord the temperature of the contents of the flask every minute.\n7.\nStore the resulting polyacrylamide for subsequent experiments. In anticipation of\nExperiment #3, place 100 ml of the polyacrylamide solution recovered at the end of step (6)\nin a 250 ml Erlenmeyer flask, add 112 ml of 10% wt/vol NaOH solution in water (provided\nby TA). Stopper and label \"Sodium Polyacrlyate for Exp# 3\" with your Team #). Note:\nStir thoroughly to ensure complete hydrolysis, especially if viscous. Use mild heat if\nnecessary.\nObservations and Calculations:\n1.\nFor each recipe, tabulate:\nReaction time (min)\nTemperature (C) Bead falling time (sec) Viscosity (cP)\n2.\nShow a sample calculation for viscosity. Specify units, illustrate unit conversions\nand give source of data.\n3.\nPlot (temperature) vs. (reaction time) and (bead falling time) vs. (reaction time) on\nsame plot. Make one plot for each recipe. Legend should specify precise conditions for\neach recipe.\nDiscussion:\n1.\nTo what degree can you tell when the reaction ceased by the two methods\ntemperature and viscosity? Do they agree?\n2.\nWhen did the reaction appear to begin?\n3.\nDo the results of your three runs, taken together, seem reasonable? (For example,\nwas the reaction faster if the Redox concentration was increased?) If there is a trend, make a\nplot illustrating the trend.\n4.\nFind out if the data of another group with different recipes illustrated any other\nconcepts/trends. Just state their result in one or two lines. Is that reasonable ?\n\nAddendum: The Falling Ball Viscometer\nThis is a very simple device. A spherical bead is introduced into a column of liquid and its\nfall, if more dense than the liquid, or rise if the opposite is true, it then timed. The movement\nof the bead must occur in a laminar flow, and a steady velocity of fall (or rise) must be\nachieved. The bead cannot be near a wall of the container.\nThe bead has a radius R, a density ρs, and acquires a steady terminal velocity vt.\nThe liquid has a density ρL and a viscosity η.\nThe net gravitational force acting on the bead is exactly balanced at equilibrium by the\nfrictional force on the bead according to Stokes' law, i.e.:\n4 3\n(\n)πR3(ρs -ρL )g = 6πRηvt\n2(ρ -ρL )R2g\nWhence\nη =\ns\n9vt\nWherein g is the gravitational acceleration.\nThus, the terminal velocity is inversely proportional to viscosity.\nIn the CGS system (g, cm, sec, dyne) the dimensions of η are dyn-s/cm-2. One dyn-s/cm-2\nis called a \"poise\", in honor of Poiseuille. The viscosity of water at room temperature is\nabout 1 centipoise, or 0.01 poise. In the SI system, the dimensions of η are pascal-sec.\nOne milliPa-s is equal to 10 centipoise.\nThe falling ball viscometer is useful for the estimation of the viscosity of liquids that are\nNewtonian (viscosity independent of shear rate), transparent (so that the bead can be\ntracked), and of viscosity less than about 100 poise."
    },
    {
      "category": "Resource",
      "title": "2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-467-polymer-science-laboratory-fall-2005/077d670241d1ad33ab58c30bd7427e3c_2.pdf",
      "content": "Experiment 2: Characterization of polyacrylamide (PAM) by\nviscometry and gel permeation chromatography (optional)\nAim: (a) To determine the intrinsic viscosity and molecular weight of polyacrylamide\n(synthesized in experiment 1) using a Ubbelohde capillary viscometer.\n(b) To measure the shear rate dependent viscosity of \"concentrated\" PAM solutions\nby using a coaxial cylinder (Couette) viscometer.\n(c) To measure molecular weight and polydispersity index by gel permeation\nchromatography (optional)\nMaterials and Apparatus:\nPolyacrylamide synthesized in experiment 1.\nWater containing 0.05 M NaN03 + 0.02% NaN3\nWater bath with arrangements for maintaining constant temperature.\nUbbelohde capillary viscometer\nBrookfield Couette viscometer or Bohlin 88 Couette viscometer\nBrief Background:\nMethods to measure viscosity of polymer solutions: (See handout from Rabek,\nExperimental Methods in Polymer Science, Ch 9.)\nThe measurement of the viscosity of polymer solutions is called viscometry and the\napparatus used is called the viscometer. We shall study about three viscometers: falling ball\nviscometer, capillary (Ubbelohde) viscometer and Couette viscometer. The falling ball\nviscometer was discussed in experiment 1.\nCapillary viscometer, intrinsic viscosity, Mark-Houwink empirical correlation :\nA\ncapillary viscometer is used to get a measure of the viscosity of very dilute polymer\nsolutions. The solution is allowed to flow through a capillary of known diameter under the\naction of a pressure drop as a fully developed laminar flow and the time taken to flow\nthrough a given length is measured. For a dilute solution, the measured time (tc) at a given\ntemperature is proportional to the viscosity of the solution (hc) at that temperature. At the\nsame temperature, the flow time (ts) for the solvent through the same capillary is also\nmeasured. ts is proportional to the viscosity of the solvent (hs). Thus,\nhc = tc\n(1)\nhs\nts\n\n________________________________________________________________________\n________________________________________________________________________\n________________________________________________________________________\nThus, capillary viscometery gives only a relative measure of the viscosity and not an\nabsolute one. Let us define a couple of terms before proceeding.\nSpecific viscosity = hsp = hc - 1\n(2)\nhs\nhc\nIntrinsic viscosity = h = lim hsp = lim 1 ln\n(3)\nc\nc\nhs\ncÆ0\ncÆ0\nwhere, c is the concentration of the polymer solution. Thus, if the specific viscosity is\ndetermined experimentally for polymer solutions of different concentrations (but same\nmolecular weight), then the intrinsic viscosity can be determined by extrapolating the plot of\nhsp\nc vs. c\nor\nc1\nhc\nln\nvs. c\nhs\nto c=0. This intrinsic viscosity can be used to determine the molecular weight by using a\npreviously determined Mark-Houwink empirical correlation for that polymer in a given\nsolvent and temperature. The general form of the Mark-Houwink relation is\nh = K' Ma\n(4)\nwhere, [h] is reported in cm3/g and the molecular weight is obtained in units g/mol. The\nrange of a is 0.5 < a < 0.8 . Consider some examples:\nPolymer solution\nK'\na\nPAM in 0.05 M NaNO3 at 30 C\n0.0063\n0.800\nNaPAA in 0.05 M NaNO3 at 30 C\n0.0281\n0.770\nPEO in 0.05 M NaNO3 at 30 C\n0.0120\n0.784\nA short note on the hsp\nc\nvs. c\nand\nc1 ln hc\nhs\nvs. c plots: These plots are\ntypically found to be linear and describable by the following Huggins' equations:\nhsp = h + k' h 2c\n(5)\nc\n\nhc\n1 ln\n= h + k'' h 2c\n(6)\nc\nhs\nk' and k'' are called the Huggins' constants.\nCoaxial cylindrical Couette viscometer:\nA Couette type viscometer consists of a rotating cylinder (cylinder radius, R1 and\nrotating at N rev per min) positioned coaxially inside a cylindrical cup (of a slightly larger\nradius, R2). The liquid of viscosity, h, is subjected to shear in the narrow gap between the\ng\ntwo cylinders. Each rotating speed, N, corresponds to a particular strain rate, , experienced\nby the liquid. The viscous drag exerts a torque, T, on the rotating cylinder. For such a\nsystem, the strain rate dependent viscosity can be written as,\n60(R2-R1) T\n(7)\nh =\nN\n4p2R1\n3H\nand the shear stress, t, is given as,\nt = hg =\nT\n(8)\n2pHR1\nwhere, H is the height of the cylindrical region of the rotating cylinder.\nShear stress vs. strain rate relationship:\nIf the liquid under study is Newtonian, T/N\n(and hence h) will be constant and\nindependent of the shear strain rate. Polymer solutions, however, are generally Newtonian\nonly below some limiting shear strain rate. Above this limiting value, many behave as \"shear\nthinning\" fluids i.e., h decreases as N decreases. One common empirical correlation used is\nthe power law relation:\nh = ho g n-1\n(9)\nNote that the above relation works only at large strains and not at the zero-shear limit. What\nshould be the value of n for a shear-thinning liquid?\nPrecautions:\nNo special precautions.\n\n________________________________________________\n________________________________________________\n________________________________________________\nProcedure:\nA. Intrinsic viscosity determination by Ubbelhode viscometer:\n1.\nKeep ready the solvent for this experiment: 0.05 M NaNO3 and 0.02% NaN3. Use\npreviously prepared PAM solutions (Co = 4%, 8% or 12%) to form diluted solutions of\nconcentration Ci such that\nC1 = 0.0010 g/cm3\nC2 = 0.0015 g/cm3\nC3 = 0.0020 g/cm3\nC4 = 0.0025 g/cm3\nThe values of Ci need not be exactly as shown, as long as you know what the real value is,\ne.g. C4 = 0.00235.\n2.\nPrepare the water bath such that the bath is at a uniform temperature of 30 C.\n3.\nUse the Ubbelhode viscometer (as described below) to measure the flow time of the\nsolvent (ts). Repeat the measurement. The two measurements of the flow time should agree\nwithin 0.5 sec.\nUsing the Ubbelohde capillary viscometer:\nThis method is used for dilute solutions. We shall be\nusing Ubblehode viscometer of size OC or OB. These sizes\nare used for solutions in the following viscosity ranges:\nSize\nh(cStokes)/ t (sec)\nh range (cStokes)\nOC\n0.003\n0.6 to 3\nOB\n0.005\n1.0 to 5\nLet us consider the case where a concentrated solution of Co\nis diluted to concentration Ci by using a solvent and we are to\ndetermine the viscosity of the solution of concentration Ci.\nThe procedure is as follows (Note: in the following the\nsample could be solvent or any of the solutions):\na) Clean the viscometer using suitable solvents (water,\nthen ethanol) and dry by passing clean, dry filtered air\nthrough the instrument to remove the final traces of solvents.\nb) Charge the viscometer by introducing the sample\nthrough tube G into the lower reservoir; introduce enough\n\nsample to bring the level between lines J and K (this is about\n15 ml).\nc) Place the viscometer into the holder, and insert it\ninto the constant temperature bath. Vertically align the\nviscometer in the bath if a self-aligning holder has not been\nused.\nd) Allow approximately 15-20 minutes for the sample\nto come to bath temperature.\ne) With the side vent tube (B) closed (using a finger)\nuse a suction bulb on tube A to pull liquid upward through\nthe capillary measuring bulb (E) until it is above the top mark\nand half way into bulb C. Remove the suction bulb. Remove\nthe finger from the side vent (B) and immediately place the\nfinger over tube A until the sample drops away from the\nlower end of the capillary into bulb I. Then remove the finger\nand measure the efflux or flow time.\nf) To measure the flow time, allow the liquid sample\nto flow freely down the mark D (start the stopwatch when the\nmeniscus drops below this top mark) , measuring the time for\nthe meniscus to pass from mark D to mark F (stop the stop\nwatch when the meniscus drops below the bottom mark F).\ng) Without recharging the viscometer, repeat the\nmeasurement of the flow time.\nh) The flow times and concentrations are used to\ncalculate the intrinsic viscosity.\n4.\nEmpty solvent from the viscometer and add 5ml of next PAM solution to be tested,\nswirl to collect drops of solvent and then drain the solution.\n5.\nFor each solution of concentration Ci: Use the Ubbelhode viscometer to measure the\nflow time (ti) of the solution of concentration Ci. Repeat the measurement. The two\nmeasurements of the flow time should agree within 0.5 sec. The flow times for the solutions\nwill be greater than that of the solvent.\n\nB. Viscosity measurement using a Couette viscometer:\n1.\nKeep ready the solvent for this experiment: 0.05 M NaNO3 and 0.02% NaN3. Use\npreviously prepared PAM solutions (Co = 4%, 8% or 12%) to form diluted solutions of\nconcentration Ci such that,\nFor Co = 4%, Ci = 3%, 2%, 1%\nFor Co = 8%, Ci = 4%, 2%, 1%\nFor Co = 12%, Ci = 8%, 4%, 1%\nNine ml of each solution (so prepare 15-20 ml) is required for viscometry using the\nBrookefield viscometer. A lot more solution is required if you are using the Bohlin\nviscometer.\n2.\nEquilibrate all solutions to room temperature before viscometry.\n3.\nNow use the Couette viscometer (as described below) to measure the shear stress at\nseveral different RPMs (0.5, 1, 2.5, 5, 10, 20, 50, 100 RPM).\nUsing the Brookfield Couette Viscometer:\nThis method is used for comparatively concentrated\nsolutions. The procedure for measuring the shear stress is as\nfollows:\na) Level the instrument by ensuring that the leveling\nbubble is at the center of the circle.\nb) Turn POWER ON. Touch SPDL. Touch 21.\n(This is the spindle size.) Touch %. Touch AUTO ZERO.\nc) Hang spindle # 21 via S-hook.\nd) Position flow jacket to surround spindle. Lock to\nframe by thumb screw (back side of instrument).\ne) Introduce 9 ml of sample solution into the sample\nchamber.\nf) Slide sample chamber up through cylindrical hole\nin flow jacket, until top of the sample chamber is even with\nthe top of the jacket. Twist to lock in place. Spindle should\nnow be totally immersed. You should see 0.00 on the dial.\ng) Touch SS. This will display the shear stress in\ndyn/cm2.\nh) Turn MOTOR ON.\ni) Increase RPM in steps. Measure and record the\nshear stress. Viscosity is then calculated using the torque and\nrpm.\n\n________________________________________________\n________________________________________________\n________________________________________________\n________________________________________________\nj) Viscosity is then calculated using the torque and\nrpm.\nUsing the Bohlin viscometer:\na) Check if the instrument is connected to the mains.\nPress the ON/OFF button to switch on. \"OFF\" should\nappear on the display.\nb) Check to see if it is necessary to zero adjust the\nresidual torque of the motor. Press the START button to start\nmotor. Press FUNCTION button until the torque value (in\nunits of mN.m) appears on display. Run motor for 30 sec.\nTurn the SPEED switch. Read torques at speeds 1 to 4. If\ntorque value at any spped is greater than 0.01 mNm, zero\nadjustment is needed. Press START button to stop motor.\nc) Perform the zero adjustment. Press the START\nbutton. If motor is cold, let it run for 30 sec. Press START\nbutton to stop motor. Press FUNCTION button until \"CAL\"\nappears on the display. Hold the CAL button down until the\nmotor starts. Doing the adjustment for one speed, does the\nsame for all speeds.\nd) Choose rotational speed from the following:\nSPEED switch pos.\nRotational speed\n(rpm)\n(Hz)\n0.33\n0.58\n1.02\n1.78\n3.12\n5.45\n9.53\n16.67\ne) Choose measuring system using the SYSTEM\nswitch.\nMeasuring\nSystem switch\nEst. sample vol.\nsystem\nposition\nwith bottom cover\n\n________________________________________________\n________________________________________________\n________________________________________________\n________________________________________________\nC14\n10 ml\nC25\n14 ml\nC30\n17 ml\n\"infinite sea\" C14\n-\n\"infinite sea\" C25\n-\n\"infinite sea\" C30\n-\n\"wide gap\" C14\n-\n\"wide gap\" C25\n\nCheck if optimum system by reading the torque value at a\nrotational speed. Lower the measuring cylinder into the\nsample until it is submerged about 10 ml below the surface\nof the sample. If the viscosity is time-depenedent, use a test\nsample for this check. Press START button to start the motor\nat the chosen speed. Press the FUNCTION button until the\ntorque, M, appears on the display. Read the torque value and\ncheck that its is above 0.5 mNm and below 9.5 mNm. Press\nthe START button to stop the motor. (If torque is below 0.5\nmNm, use a larger diameter system or higher speed. If torque\nis above 9.5 mNm, use a smaller diameter or lower speed.)\nf) Start measurements. Lower the measuring cylinder\ninto the sample until it is submerged about 10 ml below the\nsurface of the sample. This will position the temperature\nsensor about 5 mm into the sample. Indicate the measuring\nsystem chosen with the STSTEM switch. Using the SPEED\nswitch, indicate the rotational speed chosen. Press the\nSTART button to start the motor and the measurement.\ng) Read measured data on the display by pressing\nFUNCTION button. Note down:\nrotational speed, V (rpm)\ntorque, M (mNm)\nFor calculations use:\nShear stress (Pa) = C1 X M\nShear rate (1/s) = C2 X V\nViscosity (Pas) = shear stress/shear strain\nMeasuring system\nC1\nC2\n154.7\n1.207\n27.16\n1.207\n\n________________________________________________\n15.72\n1.207\n154.7\n0.209\n27.16\n0.209\n15.72\n0.209\n154.7\n0.255\n27.16\n0.492\nh) End measurements. Press the START button to\nstop the motor. If all measurements are completed, the\ninstrument can be shut off via the ON/OFF button.\nC. Molecular weight determiniation by gel permeation chromatography (GPC) (optional):\nThe GPC should be set up beforehand and ready to go. The mobile phase is 0.05 M\nNaNO3/0.05 M NaN3 in water. The columns are Ultrahydrogel models.\nTo run a\nchromatograph, do the following:\n1. In a glass vial, prepare 2 ml of solution of PAM in 0.05 M NaNO3/0.05 M\nNaN3 water with a polymer concentration of 0.003 g/ml (record actual\nconcentration).\n2. Filter the solution through 0.45 ml syringe filters into a new glass vial.\n3. On the GPC LCD screen, make sure that the computer is set to \"Channel A\"\nand the plot to \"Auto\".\n4. Check to make sure that the GPC injector is in the \"Load\" position.\n5. Fill the GPC syringe (about 50-100 ml) with solution, being sure to remove any\nair bubbles. The can be done by turning the syring upside down and allowing any\nbubbles to rise to the top of th syringe. It may be necessary to tap the syringe to\ndislodge the bubbles. Then, while the syringe is upside down, gently push the\nplunger until liquid comes out the end of the needle.\n6. Place the syringe in the injector and inject enough solution such that it begins to\ncome through the overflow tube on the injector panel. It may be necessary to use\nmore than one syringe full of solution.\n7. To begin the run, switch the injector from \"Load\" to \"Inject\". Hold the switch\nin the \"Inject\" position for approximately 10 seconds and then return it back to the\n\"Load\" position.\n8. Wait for the GPC to finish the run. This should take about 20-30 minutes.\n9. Clean the injection syringe with a small amount of fresh mobile phase solution.\n10. After the run has finished, hit \"INJ A\" and a report should be printed.\nFor your report:\n\nObservations and Calculations:\n1)\nRecord the calculations for the dilutions in the lab notebook.\n2)\nTabulate the data for each run with the Ubbelhode viscometer. Use the equations in\nthe section \"Brief Background\" to perform calculations.\nhc\n3)\nPlot hsp vs. c\nand 1 ln\nvs. c plots to calculate the intrinsic viscosity. Indicate\nc\nc\nhs\non each plot your synthesis conditions (% acrylamide, TEMED conc., AMPS conc.). Also\ncalculate the Huggins constants.\n4)\nUse equation 4 to calculate the molecular weight.\n5)\nTabulate the data for each run with the Couette viscometer.\n6)\nPlot shear stress vs. shear rate over the range studied for each concentration.\nIndicate not only the concentration but also the synthesis conditions.\n7)\nThen plot log (shear stress) vs. log (shear rate) and see if it can be fitted with a\nsingle slope. Does equation (9) work? If yes, what is the value of n?\n8)\nDetermine viscosity for each concentration solution studied at the lowest shear rate\nobserved and plot log (viscosity) vs. log(concentration). Determine if there is a single slope.\n9)\n(If optional GPC analysis is performed:) Compare the GPC elution time (volume)\nwith the universal calibration plot provided to calibrate your results. Calculate the weight\naverage molecular weight and the number average molecular weight for your PAM sample.\nFrom these, calculate the polydispersity index.\nDiscussion:\n1)\nExamine each of the equations in the section \"Brief Background\" and equation (2)\nof experiment 1 in light of your observations.\n2)\nAre the Huggins constants reasonable?\n3)\nExamine the equations and your data to suggest methods to improve the accuracy of\nmeasurement.\n4)\n(For your own benefit; not needed in the report) Borrow the molecular weight (from\nMark Houwink equation) and lowest shear rate viscosity data of one other group that\nsynthesized PAM such that the expected molecular weight was different from the PAM you\nused. Compare viscosity results and the synthesis conditions in both cases. Does it make\nsense?"
    },
    {
      "category": "Resource",
      "title": "3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-467-polymer-science-laboratory-fall-2005/e224417c3bbe5deff0131c6a52a37555_3.pdf",
      "content": "Experiment 3: Conversion of polyacrylamide to sodium polyacrylate\nsalt and subsequent conversions to poly(acrylic acid).\nAim: (a) To convert PAM produced in Experiment #1 to sodium polyacrylate (NaPAA)\nand measure its intrinsic viscosity using an Ubbelohde capillary viscometer.\n(b) To convert NaPAA solution to polyacrylic acid (PAA) powder.\n(c) To precipitate NaPAA by converting it to the calcium salt of PAA using calcium\nchloride.\nMaterials and Apparatus:\nPolyacrylamide synthesized in Experiment #1.\nWater solution of NaOH (100g NaOH in a liter of solution)\nCalcium chloride (1M)\nHCl\n0.05 M NaNO3 + 0.02% NaN3\nStoppered or capped flasks\nReceiving flask\n0.2 and 0.45 micron Millex syringe filter\nSpatula\nAluminum weighing dishes\nVials\nSmall beakers (100 ml)\nHot plate with stirrer and stirring bars\nVacuum oven\nSuction filtration stand\nBrief Background:\nSythesis route - Conversion of PAM ---> NaPAA ---> PAA or CaPAA :\nThe polymer produced in experiment #1, polyacrylamide (PAM) is converted to a\npolymer having a different side group, without changing the degree of polymerization, by\nbase hydrolysis shown in reaction III below.\n\nH\nH\nCH2\nC\n+ NaOH\nCH2\nC\n+\nNH3\n[III]\nC\nO\n\nC\nO\n\nNH2\nO- Na+\n(ix)\nAmmonia is detectable by its odor. The resulting polymer sodium polyacrylate, NaPAA, has\nthe repeat unit shown in (ix). This polymer is a classical polyelectrolyte widely used in\nwater treatment as a coagulant or flocculent.\nThe addition of calcium as CaCl2, precipitates the polymer by bridging two\ncarboxylate groups on neighboring polymer segments (reaction IV), leading to the non-\nionized linkage (x).\nH\nH\nCH2\nC\nCH2\nC\nC O\nC\nO\n\n-\nO Na+\nO\n(ix)\n+ Ca 2+\nCa\nIV\n-\n(x)\nO\nO Na+\nC O\nC\nO\nCH2\nC\nH\nCH2\nC\nH\nTreatment of the calcium salt form or the free acid form of the polymer by a strong base,\ne.g., NaOH, KOH, etc. regenerates the corresponding salt with monovalent cations (Na+,\nK+) and renders the polymer again soluble in water.\nIf the ionized (ion pair) NaPAA (ix) is neutralized by an acid, e.g., HCl, the free, nonionized\ncarboxyl is produced, so that poly (acrylic acid), PAA, is produced (reaction V) of which the\nrepeat unit is (xi).\nH\nH\nCH2\nC\n+ H+\nCH2\nC\n+ Na+\nV\nC\nO\nC\nO\n\nO- Na+\nOH\n(ix)\n(xi)\n\nExtensive hydrogen bonding between carboxyl groups or neighboring polymer\nchains results in linkages like (xii). The water is no longer as effective a solvent for the\npolymer in the presence of this strongly H-bonded complex. The H-bonds form the basis\nof crystalline order, and the result is the immediate crystallization and its phase separation\nfrom aqueous solution.\nCH H2C\nOH\nO C\n(xii)\nC\nO\nHO\nCH2\nC\nH\nThis is but one of many examples of producing polymers not by direct synthesis\nfrom monomer but by transformation of a previously synthesized polymer. Other important\ncases include:\npoly (vinyl alcohol) from poly (vinyl acetate)\npoly (vinyl butyral) from poly (vinyl alcohol)\nacetate rayon from cellulose\npoly (styrene sulfonate) from polystyrene.\nThe polyelectrolyte effect on intrinsic viscosity:\nThe molecular weight of NaPAA is followed by the same method of capillary\nviscometry used in Experiment #2. In water, a significant proportion of the carboxylic acid\ngroups are dissociated, leaving negatively charged ions attached to the polymer chain.\nThese anions repel each other, causing the molecular coil to expand. The counter ions in\nsolution screen this repulsion, but as their concentration is made more dilute, the counter\nions screen the repulsions less and less. Using ion free water to dilute the polyelectrolyte\nsolution results in dilution of counter ions. For accurate results the polymer is diluted by a\ndilute ionic solution e.g., NaNO3, or NaCl. Use the equation below to understand this\neffect.\n~ M0.5\nη\nα\n(1)\nwhere α is the expansion factor. (see handout from Rabek, Experimental Methods in\nPolymer Science, pp45-52.)\nPolyelectrolytes:\n\nPolyelectrolytes are polymers with incorporated ionic substituents along the\npolymer chain. Polyelectrolyte solutions show large ionic conductivities. It is the ionic\nnature of the polyelectrolyte, and its tendency to form complexes with other charged species\nand water soluble materials, that is exploited in applications such as the use of NaPAA as a\ncoagulant in water treatment.\nPrecautions:\nNo special precautions.\nProcedure:\nA. Conversion of PAM to NaPAA:\n1.\nUse the PAM solution prepared at the end of Experiment #1: 100 ml of a 4% PAM\nsolution treated with 150 ml of a solution of 100g NaOH / litre.\n2.\nTake 100 ml of the 4% PAM solution (if you used the 6% solution, be sure to\nadjust all future calculations in this lab accordingly.\nYou may dilute your\nsolution if desired) and add 112ml of the solution of 100g NaOH / litre. Let it stand in a\nstoppered or capped flask and keep warm (over 60 C) for 2 days (preferred method) or at\nroom temperature for approximately 1 week. Over this period complete hydrolysis of AM\nunits takes place to form an equal number of NaPAA units. (Question: If all AM units\nhave been converted to NaPAA units, how many moles of NaOH remain unreacted? How\nmany moles and grams of NaPAA units are there in the completely hydrolysed solution?\nMol. wt. of NaPAA unit is 94 g/mol. What are the concentrations in g/ml and M of\nNaPAA, NaOH, NaNO3 and NaN3 in the 212 ml of completely hydrolysed solution?\nMol. wt. of NaNO3 = 85 g/mol and mol wt. of NaN3 = 65 g/mol.) You should find the\nNaPAA concentration to be approximately 0.024 g/ml.\nB. Dilution and intrinsic viscosity measurement:\n1.\nTake 5 ml of NaPAA solution and make a 10 fold dilution with distilled water. You\nwill need to add 45 ml of distilled water. You need not take exactly 5 ml or 5g but you must\nknow what you took to the second decimal place. (Calculate the concentrations for the\nappropriate quantity taken.) You will obtain a solution with NaPAA concentration of\napprox. 0.0024 g/ml and NaOH concentration of 0.1056 M.\n2.\nFilter this dilute solution through a 0.2 micron Millex Syringe into a clean flask.\n3.\nUse an Ubbelhode viscometer (see \"Procedure\" section of Experiment #2 for\ndetails) to determine the flow times for\na) the dilution solution \"solvent\" i.e., 0.05M NaNO3 + 0.02% NaN3 water.\nb) the filtered solution: NaPAA concentration of approximately 0.0024 g/ml\n\nc) the filtered solution diluted 1:1 with the dilution solution \"solvent\": NaPAA\nconcentration of approximately 0.0012 g/ml\nd) the filtered solution diluted 1:2 with the dilution solution \"solvent\": NaPAA\nconcentration of approximately 0.0008 g/ml.\n4.\nDemonstration of the polyelectrolyte effect:\na) Take some of the original solution (NaPAA concentration of 0.0024 g/ml) and\ndilute 1:7 with distilled water, so as to reduce polymer concentration and NaOH\nconcentration by a factor of 8 giving NaPAA concentration of approximately 0.0003g/ml\nand NaOH concentration of 0.0132M. Now use the Ubbelhode viscometer to determine the\nflow time for this solution.\nb) Prepare another solution of NaPAA concentration of 0.0003 g/ml but this time\nuse the dilution solution (0.05 M NaNO3 + 0.02%NaN3) for dilution. Again determine the\nflow time in the Ubbelhode viscometer.\nC. Conversion of NaPAA solution to PAA powder:\n1.\nSet up a 100 ml beaker with a stirring bar on a magnetic stirrer. Add about 50 ml of\n0.5 M HCl solution. Set the stirrer speed so as to produce a vortex. Drop-wise add 20 ml of\nthe original NaPAA solution of which the polymer concentration is about 0.024 g/ml\n(presuming use of the original 4% PAM solution).\n2.\nA precipitate of finely divided PAA will form. Cease stirring. Let the precipitate\nsettle. Decant and discard the clear supernatant, but do not let the precipitate escape.\n3.\nAdd now about 40 ml of distilled water. Stir the precipitate, then let it settle. Decant\nand discard the water. Transfer by spatula as quantitatively as possible the damp precipitate\ninto the aluminum (or plastic) weighing dish. Place in vacuum oven operating at about 60 C.\nWhen dry, weigh the residue (now as PAA) and check how closely the material balance\ncloses.\n4.\nSave the dried powder (PAA) in a labelled vial.\nD. Precipitation of NaPAA by Calcium Chloride: 1. Take 10ml of the NaPAA solution of\nconcentration 0.024 g/ml. Add 20 ml of 1M CaCl2 solution. A small beaker or an aluminum\nweighing dish would be appropriate.\n2.\nPre-weigh a 0.45 micron dry filter. Install this on a suction filtration stand. Transfer\nthe precipitate onto the filter. Filter off the solution into the receiving flask. Under suction\nrinse with about 40 ml of distilled water (to remove NaCl and excess CaCl2).\n3.\nDry the filter plus precipitate on a hot plate at low heat, or in a vacuum oven, to\nconstant weight. Determine the net weight of the precipitate and report whether the weight\n\nobserved, relative to the weight of the initial NaPAA is in accord with the differences in\nmolecular weights of NaPAA and CaPAA.\nObservations and Calculations:\n1.\nAnswer questions and perform the calculations in the \"Procedure\" section as you go\nalong.\n2.\nTabulate all necessary Ubblehode data and weight measurements in the lab note\nbook.\n3.\nPresent the Huggins plot of the Ubbelhode data and from it calculate the Huggins\nconstants, intrinsic viscosity and molecular weight (using the Mark-Houwink relationship\nand the constant given in \"Brief Background\" section of experiment 2). Indicate the\nconditions of polymerization of your PAM from which NaPAA was made as a legend.\n4.\nReport the material balance closure on NaPAA --> PAA. (We know that this will be\nat best an estimate, and with certain groups, impossible.) Indicate the conditions of\npolymerization of your PAM from which NaPAA was made as a legend.\n5.\nReport the material balance closure on NaPAA --> CaPAA. (We know that this will\nbe at best an estimate, and with certain groups, impossible.) Indicate the conditions of\npolymerization of your PAM from which NaPAA was made as a legend.\nDiscussion:\n1.\nWhen 0.05 M NaNO3 is used as diluent, is the Huggin's plot reasonable (i.e., do the\nHuggins constants have proper values, and do the two curves have a common intercept)?\n2.\nIs the value of molecular weight calculated (using the Mark-Houwink relationship)\nfor your NaPAA consistent with what would be expected from the molecular weight you\ncalculated on your PAM samples in experiment #2?\n3.\nDiscuss the polyelectrolyte effect.\n4.\nHow can you improve the accuracy of material balance closures?\n5.\nYou may find more CaPAA than expected from the NaPAA amount. What are some\npossible reasons?"
    },
    {
      "category": "Resource",
      "title": "4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-467-polymer-science-laboratory-fall-2005/3185aa185cabc5f54b2b3e1d958a52b6_4.pdf",
      "content": "Experiment 4: Synthesis of hydrogels of acrylamide and bisacrylamide\nin water.\nAim: (a) To synthesize polyacrylamide electrophoresis hydrogels by copolymerization of\nacrylamide and bisacrylamide in water by free radical polymerization using a redox pair of\ninitiators.\n(b) To observe the time to reach \"gel point\" as a function of the concentration of\nmonomers and ratio of monomer concentration.\n(c) To prepare \"worms\" and Petri dish gel slabs for experiment #5.\nMaterials and Apparatus:\nBuffer solution: Phosphate buffer saline (PBS), PH 7.4\nMaster solution a: 30 wt % acrylamide and 0.8 wt % bisacrylamide solution\n(mol ratio = 80:1 or wt. ratio = 37.5:1)\nMaster solution b: 40 wt % acrylamide and 2 wt % bisacrylamide solution\n(mol ratio = 40:1 or wt ratio = 19:1)\nAMPS (ammonium persulphate)\nTEMED (tetramethyl ethylene diamine)\n250 ml Erlenmeyer flask\nLarge beakers\nGlass wool insulation\n25 ml plastic test tube\nCapped test tubes (~5 \" long)\nGlass beads, 3 mm\nParafilm\n12 \" section of \"FEP\" 1/4\" diameter tube\n10 ml syringe\nSeptum\nThermocouple set\nStop watch or eq.\nWeighing machine\nHelium tank with reducing valve (multiple outlets) for sparging\n\nBrief Background:\nCopolymerization of acylamide and bisacrylamide:\nThis experiment is like experiment 1, in that a water solution of acrylamide (labeled\nas (iii) in experiment #1), is initiated to undergo radical polymerization by the same redox\ninititor pair used in that experiment. However, a tetrafunctional molecule, N, N' methylene\nbisacrylamide \"BIS\" (labeled (xiii) in equation below) is added in a mol ratio to acrylamide\nof about 1/50 to 1/100. The copolymerization of bis results in the bridging junction shown\nin (xiv) into which four chains of polyacrylamide come together in this irreversible covalent\nconnection.\nH\nchain\nH\nchain\nH2 C C\nCH2\nC\nC\nHN\nO\ncopolymerization with\nacrylamide (M.W.=71)\nC O\nNH\n(xiii)\nNH\nCH2\n(xiv)\nCH 2\n(VI)\nC O\nNH\nH2C C\nchain\nC O\nchain\nH\nCH2\nC\nH\n\"bis\" Monomer (M.W.= 154)\n\"bis\" junction has functionality f =4\nThe result is that the initial aqueous solution of acrylamide and \"bis\" following\ninitiation undergoes an exponential increase in viscosity until a network filling the reaction\nvessel has been created, at which point the system \"gels\", i.e., viscosity is infinite.\nGel point:\nAt the gel point the polymer transforms suddenly from a viscous liquid to an elastic\ngel (network). Prior to the gel point, all of the polymer is soluble in suitable solvents, and it\nis fusible also. Beyond the gel point, it is no longer fusible to a liquid nor is it entirely\nsoluble in solvents. We shall get an estimate of the gel point from the point at which the\nviscosity of the solution increases to infinity (i.e. a solid-like substance).\nHydrogels:\nA gel is a network i.e., chains are cross-linked to each other (unlike in experiment #1\nwhere there were several independent chains in the polymer solution that you prepared). A\ngel that is hydrophilic (water-loving) is called a hydrogel. So when dry hydrogels are put\ninto water, they absorb water and hence swell in volume (but the gel does not dissolve;\n\n________________________________________________________________________\n________________________________________________________________________\n------------------------------------------------------------------------------------------------------------\nwhy?). The equilibrium degree of swelling depends on the degree of cross-linking and the\nhydrophilicity (extent to which it loves water) of the gel. Can you name some common uses\nof hydrogels? (Are soft contact lenses hydrogels; if so how do they work? How could a\nhydrogel be used in controlled drug delivery? Some super-absorbing gels are used to\nslowly supply water to seeds in semi-arid, desert like areas; do you know how they work?)\nPrecautions:\nUse vinyl gloves. No special precautions.\nProcedure:\n1.\nIn preparation for the viscosity test, set aside a screw cap plastic test tube with a\n3mm glass bead inside it. Also set aside a second 25 ml plastic test tube with glass wool for\ncalorimetry. Finally, set up tubing with plugs and nine petri dishes with covers in\npreparation for steps 7 and 8 (see detailed description under each of these steps below).\n2.\nSythesize the following gels (one at a time) using the recipes given below for your\nteam. Master Solution a has acrylamide at the low bis cross-linker content and Master\nSolution b has acrylamide with the high bis cross-linker content.\nThe buffer solution is\nused for dilutions to maintain the appropriate pH to avoid conversion of acrylamide to acid\ngroups, other side reactions. Mix p ml of the buffer solution and q ml of master solution to\nproduce a total of 200 ml\nof x % acrylamide solution. Split the 200 ml into two\napproximately equal volumes of 100 ml each, which will be sparged with helium to remove\ndissolved oxygen. Use 250 ml Erlenmeyer flasks.\n3.\nAfter sparging, add y grams of AMPS to one flask and z grams of TEMED to the\nother flask (these are our redox initiators). Swirl each flask to dissolve the added redox\ninitiator.\nTable: Recipes\nVariation\nx=5% gel\nx=7.5% gel\nx=10% gel\nTeam A,C,D\n---------------- Use master solution a ----------------------------\np=83 ml\np=75 ml\np=67 ml\nq=16.6 ml\nq=25 ml\nq=33 ml\ny=0.1 g\ny=0.1 g\ny=0.1 g\nz=0.05 ml\nz=0.05 ml\nz=0.05 ml\nTeam B,E,F,G ---------------- Use master solution b ---------------------------\n\n------------------------------------------------------------------------------------------------------------\np=87.5 ml\np=81.2 ml\np=75 ml\nq=12.5 ml\nq=18.8 ml\nq=25 ml\ny=0.1 g\ny=0.1 g\ny=0.1 g\nz=0.05 ml\nz=0.05 ml\nz=0.05 ml\n4.\nAdd the contents of one flask into the other. Simultaneously, start the stop watch\n(This shall be time = 0 for both temperature and viscosity measurements). Mix the solution\nby swirling. At this point you are ready to immediately fill all of your containers as\ndescribed below in steps 5-8.\n5.\nPour some of this solution to completely fill (to overflowing) the test tube set aside\nin step 1. Screw the cap onto the filled tube to exclude any bubbles of air. Every minute,\ninvert the tube and estimate the time it takes for the glass bead to fall from the top to bottom.\nAlso record the time when the bead gets stuck.\n6.\nSet up the 25 ml plastic tube with some of the remaining solution, surrounded by\nglass fiber (glass \"wool\") as insulation. Inset a thermocouple probe through the parafilm or\na stopper, which excludes air. Allow the remaining solution to polymerize. Record the\ntemperature of the contents of the flask every minute.\n7.\nPreparation of \"worms\" for the diffusion Experiment 5: Place a septum over the end\nof a 12\" section of \"FEP\" 1/4\" diameter tube. Inject the mixed AMPS and TEMED solution\nvia a 10ml syringe and needle until it just starts to appear at the other end. You will make\nthree of these- one for each of the three recipes (5%, 7.5%, 10%). Remove the syringe\nneedle. Let the tube and contents rest for at least 45 minutes. Then apply gentle pressure to\nforce the \"worm\" out of the FEP tube into a petri dish. Leave the worms for the swelling\nstudy next time.\n8.\nPreparation of circular slabs for the diffusion Experiment 5:\na.\nSet aside 9 sets of the following: (bottom + cover) of 60 X 15 mm plastic petri\ndishes, and one bottom or cover of any larger diameter petri dish to take overflow. Cement\na 6 mm glass bead onto the outer surface of the 60 X 15 mm petri dish bottom. You will be\npreparing 3 slabs for each of three recipes (3 X 20 ml volume solution required).\nb.\nIn the case of each set, place the inverted cover of the 60 X 15 mm set on the larger\ndiameter dish. Fill it (for all three sets) nearly to overflowing (about 21 ml) with one of the\nsolutions. Thus one of each of the three recipes is used in each case. Immediately float the\nbottom on the solution, so that it forms a covering surface.\nc.\nSet aside for 45 minutes or longer (not critical). The solutions will have gelled.\n\nbottom of 60x15 mm set\ncover of 60x15 mm set\nlarger diameter, bottom\nor cover\nsolution\nsmall glass bead\nSchematic diagram of placement of various petri dish bottoms and covers.\nObservations and Calculations:\n1.\nTabulate data and analyse the data similar to what you did in experiment 1.\n2.\nBe sure to identify the gel point and study the trends.\n3.\nAddress one or more of the questions asked in the introduction of this text in your\nlab write-up introductory section.\nDiscussion:\n1.\nSimilar discussions as in experiment #1 without repetition."
    },
    {
      "category": "Resource",
      "title": "5.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-467-polymer-science-laboratory-fall-2005/b30a8f103c608bb5656a59f3fc8e84dd_5.pdf",
      "content": "Experiment 5: Swelling and solute transport properties of hydrogels.\nAim:\n(a) To study the response of polyacrylamide hydrogel networks (synthesized in\nexperiment 4) to temperature and ionic strength/ composition of the aqueous phase by\nmeasuring swelling or shrinking relative to the volume as synthesized.\n(b) To study the diffusion of colored molecules of known size through the gels.\nMaterials and Apparatus:\nBuffer solution: Phosphate buffer saline (PBS), PH 7.4\nVitamin B12 (1%) -- diameter 12 A.\nCytochrome C -- diameter 18 A\nHemoglobin -- diameter 40 A.\nLarger diameter petri dish - bottom or cover\n60 mm X 15 mm plastic petri dishes -- bottom and covers, 3 sets\nSaran wrap\nSurgical blades\nScintillation vials, 6\nIce bath\nHot water bath\nBrief Background:\nSwelling of networks in solvents:\nA network is crosslinked. Hence, when a solvent enters it, it does not dissolve it but\ninstead swells it. Thus, the total volume increases to that of the network and the solvent.\nThe degree to which the volume increases depends on a) the degree of cross-linking and b)\nthe degree to which the polymer \"likes\" the solvent.\nIn a dry non-crystalline (amorphous) polymer that has been cross-linked into a\nnetwork, the chains are in an entangled and relaxed conformation between two network\njunctions. However, when the solvent enters the polymer, the solvent molecules move the\nnetwork junctions away from each other (as the polymer swells in the solvent). As the\nnetwork junctions move away, the chains attached to these junctions experience a stress that\nis counteracted by the tendency of the polymer chain to return back to the relaxed state\n(where the entropy is higher). At some stage, an equilibrium is reached wherein the\npolymer refuses to accept anymore of the solvent. Clearly, this equilibrium depends on how\n\nlong the chains between network junctions are and the degree to which the polymer chains\n\"like\" (energetically) to have solvent molecules around them.\nHence, given a polymer (same chemistry) and solvent, the equilibrium degree of\nswelling will be smaller when the degree of cross-linking is higher. Why? Higher the\ndegree of cross-linking ----> the larger the number of cross-links -----> smaller the chain\nbetween network junctions -------> smaller the extent to which these chains will extend as\nvolume increases -------> smaller the degree of swelling.\nThe degree of swelling is thus used as a common measure of the degree of cross-\nlinking. The degree of swelling is measured as follows:\n1) Measure the dry weight and/ or volume of the polymer before swelling.\n2) Swell the polymer in a solvent till equilibrium swelling.\n3) Measure the weight of the swollen polymer and / or volume of the polymer after\nequilibrium swelling.\n4) The degree of swelling is measured using the following two swell ratios:\nMass swell ratio =\nMass of swollen polymer\n(1)\nMass of dry polymer\nVolume swell ratio = Volume of swollen polymer\n(2)\nVolume of the dry polymer\n5) Exercise 1: If ρs and ρp are the densities of the solvent and the polymer\nrespectively, how are the mass and volume swell ratios related?\n6) Exercise 2: Consider the case when the initial polymer that you had was not\ncompletely cross-linked but had some free chains. (Do you understand the\ndifference?) Here, the initial dry weight is the weight of the network and\nthe free chains. When this sample is swollen in a solvent, the free chains are\nslowly extracted from the swollen polymer by dissolution while the network\nremains swollen in the solvent. The weight of this swollen mass is that of\nthe network (without the free chains) and the solvent. Now if the swollen\nmass is dried thoroughly to remove the solvent, what remains is the\nnetwork. This we can weigh again to get the weight of the network. In this\ncase, the following two parameters are measured:\nMass swell ratio =\nMass of swollen network\n.\n(3)\nMass of dried network after swelling\nPercent extracted =\nSwollen mass - mass of dried network\n(4)\nInitial mass of polymer sample\n\nThink about the difference in definition between eq. (1) and (3) and the\nphysical significance of eq. (4).\nPolyacrylamide electrophoresis hydrogels:\nThe gel you produced in experiment 4 is the commonly used polyacrylamide\nelectrophoretic gel. It is used widely by biologists and biochemists in the electrophoretic\nseparation of proteins, DNA and RNA. They are usually \"cast\" (i.e., synthesized from\nsolution) by the experimenter just before the electrophoretic separation. These are called\n\"sieving gels\" because they delay the movement of the biological species (protein, DNA,\netc.) under the imposed voltage gradient to a degree increasing with the size of the species.\nFor the biologist the sieving \"size\" hole is of paramount importance. To get large sieving\nsizes, for large solutes, low acrylamide concentration (high water content) and low\nbisacrylamide/acrylamide ratios are used. (why ?)\n\"Gradient\" gels are routinely formed by filling the gel cavity with a solution in\nwhich the bisacrylamide/acrylamide ratio decreases as the cavity is filled. Within minutes\nthe layered solution gels, leaving the most porous gel at the top (where the biological species\nare introduced) and the \"tightest\" gel at the bottom.\nPermeability of molecules in a gel:\nIn diffusion, the distance, x, a solute travels is proportional to the square root of time,\nt:,\nx ~ Dt\n(5)\nwhere D is the diffusivity of the solute. Clearly, D depends on the size of the solute and of\nthe \"sieving size hole\" in the material it is diffusing through. If C0 is the concentration at the\nboundary of the semi-infinite slab and C(x,t) is the concentration at location x at time t, then\nthe concentration profile looks like\n⎛\n⎡ x ⎤⎞\nC x, t\n(\n) = C0⎜1 -erf ⎢\n⎥⎟\n⎝\n⎣2 Dt ⎦⎠\nerf() is the error function:\nz -u2 du\nerf (z) =\ne\n∫0\nπ\n\nValues of the error function may be looked up in a table or computed using software like\nMaple or Mathematica. If L(t) is the location at time t of the advancing front where the\nsolute concentration is just visible, say C(x,t) ~ 2% of C0, you should be able to show that\nthe distance L traveled by the solute in the hydrogel is given approximately by:\nL ≈ 4 Dt\n(7)\nPrecautions:\nNo special precautions.\nProcedure:\nA. Swelling experiments:\n1.\nCut the worms into six approximately equal (maybe 2\") lengths, for investigation of\nswelling/shrinking behavior. Label with permanent marker 6 scintillation vials: 1,2,3, etc.\nYou will thus need 18 vials (3 recipes X 6 vials).\n2.\nWeight each vial without its cap and record. Introduce one 2\" worm piece into a\nvial, record new weight, and thus record weight of the piece.\n3.\nFill 3 of the vials containing the worm pieces with pure water, and 3 of the vials with\nPBS buffer solution. In pairs (pure water, buffer) hold two at about 0 C in an ice bath, hold\ntwo at room temperature (measure and record) and hold two at 100 C (in boiling water) for\nat least 30 minutes.\n4.At intervals of one hour, one by one suddenly empty the vial of all the water of buffer in it,\ndraining as much as possible any free liquid. With the worm back in the vial, reweigh vial\nand worm, and determine the gain (or loss) of weight of the worm.\nAfter taking each\nmeasurement, refill the vial with its original swelling fluid (water or buffer solution).\nB. Circular slab diffusion experiment:\n1.\nYou should have set aside 9 circular gel slabs from Experiment 4 - three from each\nrecipe that you made.\n2.\nFor each gel slab, Gently remove the bottom of the 60 X 15 mm set. A spherical\nhole will result from the removal of the bead glued onto the dish cover.\n3.\nFor each set of three slabs for a given recipe you will do the following: Into one hole\nintroduce a small volume of 1% vitamin B12 (mol. wt. 1000, diamater 1.2 nm) in PBS, in\nanother a small volume of 1% cytochrome C (mol. wt. 12000, diameter 1.8 nm) in PBS and\n\nin the third, a small volume of 1% hemoglobin (mol. wt. 44000, diameter 5.0 nm) in PBS.\n(Only one solute per hole: 9 samples involving 3 recipes and three solutes)\n6.\nCover with Saran wrap to prevent evaporation. Be careful not to allow the solute to\npenetrate to the bottom of the dish, where excess water will carry it everywhere, and be sure\nto prevent Saran wrap or other items to accidentally spread the solute across the surface of\nthe gel. Examine the gels after 2 days to determine the average radial distance that the solute\nhas diffused. Estimate the diffusion coefficient for each solute using eq. 7.\nNote: The gels may be transported to your living quarters to facilitate periodic investigation.\nObservations and Calculations:\n1.\nAnswer all equations and exercises in the theoretical background section in your lab\nnotebook.\n2.\nTabulate weight measurements for the worms.\n3.\nCalculate mass swell ratio in all cases.\n4.\nWhat is the best way to plot the data for the swelling experiments? Do it so. (The\nbest way: Ask the questions \"what do want to learn about?\", \"what do you want to educate\nsomebody about?\")\n5 .\nTabulate data of time vs. distance for diffusion experiments.\n6.\nPlot the data to illustrate the concept being demonstrated here. (what is the concept?:\neffect of recipe variables and effect of size of diffusing molecule)\n7.\nReport doesn't need tabulated raw data. Just plots and final tables are needed.\n8.\nShow how eqn (7) is obtained.\nDiscussion:\n1.\nDiscuss the effect of synthesis variables, temperature and bathing solution on the\nswell ratio.\n2.\nDiscuss the effect of molecule size and synthesis variables on diffusion in gels."
    },
    {
      "category": "Resource",
      "title": "6.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-467-polymer-science-laboratory-fall-2005/9bdb71be4eed3406ec1749618e0db136_6.pdf",
      "content": "Experiment 6: Interfacial polymerization of Nylon 6,10\nAim: (a) To synthesize unsupported membranes of Nylon 6,10 by unstirred interfacial\nstep polymerization of hexamethylene diamine (HMDA) and sebacoyl chloride. To observe\nthe quality of the nylon film produced as a function of the rate of removal and of the\nconcentrations of diamine and diacid chloride in their respective phases.\n(b) To study the tensile properties of the synthesized collapsed film and compare it\nto the tensile properties of Nylon tire cord.\n(c) To synthesize supported membranes of Nylon 6,10 on hydrophilic Millipore\nmembranes.\nMaterials and Apparatus:\nSebacoyl chloride (tested for degradation)\nDichloromethane\nHexamethylene diamine\nNa2CO3 in water\nMethanol/Ethanol\nYellow food dye\nNylon undrawn tire cord\nSpatula\nForceps\nVessel (1-2 l)\nString\nBeakers 250 ml (narrow diameter preferred)\n25 mm 0.45 microns Millipore membrane\nPetri dishes\nVariable speed lab mixer (check for stability of rotation rate at slow speeds before\nusing. Use Variacs if necessary)\nStopwatch\nDial micrometer (0.001 \")\nWeighing machine\nHand held force gauge (max. load of 1000g or 2.5 lbs)\n\n(2)\n(2)\nBrief Background:\nStep polymerization: (see handouts from Rempp & Merrill, Polymer Synthesis, pp35-40\nand 50-57.)\nAs we noted before, the two main types of polymerization are chain and step\npolymerization. In chain polymerization, only the monomer can attach to the growing chain.\nHowever, in step polymerization the chain can grow by addition of monomers, oligomers\nand other polymer chains. For example, a chain consisting of four units could be formed by\ntwo routes - a) the addition of a monomer to a trimer (chain with three units) or b) the\nreaction of two dimers (chain with two units). Note that in chain polymerization only the\nfirst route would occur. Step polymerization involves the reaction of bifunctional monomers\n(i.e., the two ends of the monomer each have a reactive functional group). Often in notes and\ntexts, the functional groups are generically written as -A and -B; these two groups react to\nform a new group, -C- . Some steps of the reaction are illustrated below for the case where\ntwo different monomers are involved:\nA\nA\n+\nB\nB\nA\nB\n(1)\nA\nA\nA\nA (2)\nB + A\nFor polyesters, this reaction might be:\nHO\nR\nO\nOC\nO\nHO\nR\nOH\n+\nHOOC\nR'\nCOOH\nR'\nCOH\nStep polymerization can take place even if there is only one monomer but then the two\nfunctional groups on the monomer have to be different and reactive. Schematically:\nA\nB\n+\nA\nB\nA\nB\n(3)\nA\nB\nA\nB (4)\nB + A\nFor example\n\nO\nO\nO\nHO\nR\nOC\nR'\nCOH\n+\nHOOC\nR'\nCOOH\nHOOC\nR'\nCO\nR\nOC\nR'\nCOH\n\nNote that a water molecule is produced as a by-product in each step.\nStep\npolymerizations where a small molecule (like water or HCl) is produced during reaction is\ncalled polycondensation.\nStep Growth Polymerization - Polyamides (Nylons):\nPolyamides are polymers where the monomer units are connected together by amide groups\n( -C(=O)-NH- ). Two generic schemes for polyamide synthesis include condensation of\ndiacid and diamine monomers in the bulk state or at high concentrations. The first\nillustrated in Equation 8.\nEquation (8)\nO\nO\nH2N\nCH2\nNH2\n+\nHOC\nCH2\nCOH\nO\nO\nNH\nCH2\nCO\nCH2\nNH\nC\nn\nThe above reaction creates H2O as a byproduct, producing (n-1) moles of water for n moles\nof repeat units. It turns out that the reaction above is at or near equilibrium at low to\nmoderate temperatures (Keq is around one to ten in value). To drive toward the product, high\ntemperature and very effective water byproduct removal must be achieved for high polymer\nconversion.\nA second approach is to use the much more reactive acid chloride group in place of the acid.\nThe reaction of diamines with diacid chlorides have equilibrium constants that are about two\norders of magnitude higher than those of diamines with diacids. The reaction greatly favors\nthe production of amide product, and the reaction kinetics is extremely fast:\n\nEquation (9)\nO\nO\nH2N\nCH2\nNH2\n+\nClC CH2\nCCl\nO\nO\nNH\nCH2\nCO\nCH2\nNH\nC\nn\nHere (n-1) moles of HCl is created as a byproduct. HCl can be neutralized by the presence\nof weak base in the reaction solvent.\nThis second reaction is extremely rapid, and rather difficult to control in moderate to\nhigh monomer concentrations. It is possible to accomplish a polymerization of diamine\nand diacid chloride in a good solvent for both monomers. On the other hand, the reaction\nis very fast, irreversible, and highly exothermic. The concentrations must be kept low, and\nthe temperature must also be controlled, often below room temperature, to prevent\noverheating and side reactions. The solvent must be a good one not only for the monomers,\nbut for the resulting polymer, to achieve high molecular weight.\nInterfacial polymerization: (see handout from Rempp & Merrill, Polymer Synthesis, pp280\n287).\nA rapid, but more controlled approach is to take advantage of the fast kinetics of the\npolymerization of diamines and diacid chlorides at the interface between two immiscible\nphases. Interfacial polymerization involves the reaction of monomer A dissolved in an\norganic phase with a monomer B dissolved in an inorganic phase at the interface between\nthe two non-miscible phases. Interfacial polymerization can be of two types. In one case,\nthere are two separate macroscopic layers in contact with each other. This is called unstirred\ninterfacial polymerization. This is what we are going to study in this experiment. Unstirred\ninterfacial polymerization is used to produce membranes and to create polymer by\ncontinuous removal in a single rope. The other case is one where one phase is dispersed as\ntiny droplets in the other (continuous) phase by using high speed stirring. This is called\nstirred interfacial polymerization. Stirred interfacial polymerization is used to produce tiny\n\nmicrocapsules (hollow inside) and microspheres (not hollow) for various applications like\ncontrolled release of drugs and pesticides.\nUnstirred interfacial polymerization of Nylon 6,10: We shall study the reaction of 1,6\ndiamino hexane (HMDA) with diacid chloride (sebacoyl dichloride-SC) to form Nylon 6,10\nas shown in reaction (9). The polymer will form at the interface between a layer of diamino\nhexane dissolved in water (aqueous phase) and a layer of diacid chloride dissolved in\ndichloromethane-DCM (organic phase). The aqueous phase also contains sodium\nbicarbonate as a getter for HCl (see reaction 10).\n2HCl + Na2CO3 ---> 2NaCl + H2O + CO2\n(10)\nThe denser organic phase forms the lower phase (chlorinated solvents are used, which are\ndenser than water) while the aqueous phase will be carefully poured on top of the organic\nphase. Interfacial polymerization occurs instantly forming a thin film of solid nylon 6,10 at\nthe interface. The film at the interface stops further reaction by preventing the monomers\nfrom meeting each other (actually some monomers do reach other by diffusion through the\nfilm but this is so slow that the film appears to have stopped growing). The hydrochloric\nacid is rapidly neutralized by the carbonate in the aqueous phase. If the nylon film is pulled\nup, out of the interface, new film is formed continuously. In contrast to reaction in the bulk\n(discussed before while discussing reaction 8), there is no need to control of the\nstoichiometric ratio in this experiment. The stoichiometry at the interface is controlled\nperfectly by the mass transfer controlled rate of diffusion and consumption of each\nmonomer species. In other words, in this diffusion controlled situation, the monomer a to b\nratio is essentially one to one. Notice that interfacial polymerization is a very nice problem\nto observe the interplay of core chemical engineering concepts like diffusion and reaction.\nCan you identify all the diffusion and reaction processes? If these processes are important,\nthen what experimental variables are important? (\n\n(handout in class)\nFigure: A polyamide film forming at and being withdrawn from a liquid interface.\n(Ref. Encyclopedia of Polym. Sci., vol 8, Wiley-Interscience, p. 223)\nFibers: Natural (eg., cotton, silk etc.) and synthetic fibers (Nylon, Rayon, Polyester etc.) are\nall polymers. They are visibly different in being \"thread-like\" -- elongated in one direction\nand small in cross-section. Further, they distinguish themselves from other polymers in\nbeing anisotropic in their properties, i.e., their properties along their long axis are different\nfrom that in the perpendicular direction. Fibers are usually very strong in direction of the\nlong axis but are weaker in the perpendicular directions. Synthetic fibers are typically\ndrawn from undrawn polymers by stretching them with a specific force.\nMembranes: Membranes are films that are used to separate out a mixture of species into its\nconstituents. Often, a membrane will contain nano to micro-scale pores, and may thus have\nsome void space within its structure. This void space is useful for separations operations.\nIt also has a large effect on the final mechanical properties of the material.\nTensile testing: Tensile testing is perhaps the most commonly used form of mechanical\ntesting of polymeric materials. As shown in the figure below, a polymer sample of initial\narea of cross-section Ao and length Lo is subjected to a variable tensile (as opposed to say,\ncompression or shear) force F such that the sample is elongated at a constant rate of dL/dt\nwhere L is the length of the sample at time t.\n\n________________________________________________________________________\nF\nstress\nultimate tensile stress\nArea A0\nL0\nyield\nstress\nstrain\nstrain\nat break\nstrain\nmodulus\nhardening\nFigure: Schematic illustrating the tensile test and features on a stress-strain plot.\nThe force F and the length L is noted at periodic intervals. Following this the following\nquantities are calculated:\nDraw ratio, λ = L\n(11)\nLo\nEngineering strain, e = L-Lo\n(12)\nLo\nEngineering stress, s = F\n(13)\nAo\nThe plot of σ vs. ε is called the stress-strain plot. The stress-strain plot gives properties of\nthe material like the elastic modulus and the yield stress which are independent of the shape\nand size of the test sample but depends on the rate of strain (or elongation rate). The elastic\nmodulus is the slope of the stress-strain plot at very low strains.\nPrecautions:\nUse vinyl gloves. Prepare the two phases and introduce the aqueous phase on top\nof the organic phase in the hood.\nProcedure:\nRecipes\nRecipe Organic Phase Aqueous phase\nGroups doing it ....\n\n________________________________________________________________________\n------------------------------------------------------------------------------------------------------------\n------------------------------------------------------------------------------------------------------------\n________________________________________________________________________\nα\n1.5ml SC\n2.20g HMDA\nA, B, C, D, E, F\n+ 50 ml DCM\n+50 ml water\n+4 g Na2CO3\nβ\n0.75ml SC\n1.10g HMDA\nA, C, E\n+ 50 ml DCM\n+50 ml water\n+4 g Na2CO3\nγ\n3.0ml SC\n4.40g HMDA\nB, D, F\n+ 50 ml DCM\n+50 ml water\n+4 g Na2CO3\nA. Synthesis of unsupported membranes of Nylon 6,10:\n1.\nFirst, set the variable speed shaft (a lab mixer shaft) to its lowest STABLE rotating\nspeed. Estimate this RPM by measuring how much string is wound up in, say, 60 seconds,\nor by counting revolutions. Record this value. What you really want is the linear rate of\nwithdrawal, cm/s, so the string test will give it directly. Otherwise it will be (RPM/60) (pD)\nwhere D = shaft diameter, cm.\n2.\nFor each of the recipes you are to do, follow the procedure below: Using a 250 ml\nbeaker in a hood, introduce 50 ml of the organic phase. Then tip the beaker and slowly let\nthe 50 ml of aqueous solutions slide down the glass wall over the organic phase. Restore the\nbeaker upright.\n3.\nRemove from hood and set under the lab-mixer shaft (the shaft held horizontally).\nWith spatula or forceps, \"catch\" the membrane that has formed at the interface, draw it up\nand out, and attached the top end to the shaft of your variable speed set. Now run the set\nuntil you have produced 3 to 4 meters of collapsed membrane (which will be wound around\nthe shaft).\n4.\nUnwind the collapsed membrane into a large (1 to 2 liter) vessel of water, so as to\nrinse away the soluble salt. 5. Separate into two portions. Leave one portion wet for tensile\ntesting. Dry other portion in the 70°C air oven for weight measurement\n6.\nUsing the dial micrometer (calibrated in 0.001 inches), estimate the wet thickness of\nthe film. Determine the approximate weight per meter of length of dry film.\nB. Tensile test properties of the collapsed film:\n\n1.\nTake a length of about 50 cm of your wet film. Make two lines 10 cm apart. Fasten\none end of the length to a post, the other end to the force gauge. If the gauge reaches its\nlimit, disconnect and pull manually until the film breaks.\n2.\nRecord the final length Lf as a ratio to the original length Lo. This is the draw ratio.\nYou will plot tensile force (read from the gauge) as a function of L/Lo. Do this for two or\nthree 50 cm lengths from each run α and β or α and γ, to establish how closely the data\nagree.\n3.\nRepeat the same experiment with Nylon undrawn tire cord furnished to you from a\nspool. You will probably be able to take a single filament of this material and measure its\ntensile load vs. L/Lo relation all the way to break. Measure the weight of a known length of\nthe nylon cord. Using this and the literature value for the density of commercial nylon, you\ncan determine the cross-sectional area of the cord.\n4.\nDetermine what happens when you do similar measurements on a dried film.\nPostulate as to the differences between the wet and dry film.\nC. Synthesis of supported membranes:\n1.\nUse the solutions of recipe α only. Use a hydrophilic Millipore 25 mm 0.45 micron\nmembrane to absorb from a petri dish the aqueous solution. Then float this on a layer of\nthe organic phase in another petri dish, for 10 minutes. Remove and wash by submersion in\nwater.\n2.\nUsing a second 25 mm 0.45 micron hydrophilic membrane, let it absorb from a petri\ndish the organic solution. Then float this on a thin layer of the aqueous solution. After 120\nminutes, remove and wash.\n3.\nFor each of the supported membranes, test for wettability: Will a water drop spread\non the nylon film or not? Test the supported membranes for permeability to yellow food\ndye. Will the dye pass through the membranes?\nObservations and Calculations:\n1.\nRecord all the experimental conditions /variables and the measurements mentioned\nin the lab note book.\n2.\nUnsupported membranes:\na) Compare the weight per meter of length of the two recipes. Choose your method\nof presentation --- table or bar chart etc.?\n\nb) Plot the stress-strain plots for the different recipes. The plot should illustrate the\ndifference, if any, between the two recipes. Be sure to indicate the recipe used as a legend.\nYou can estimate the elastic moduli of each recipe from the slopes of the stress-strain plots.\nc) Plot stress-strain plots of Nylon tire cord and determine its elastic modulus\nd) Explain the differences in b and c results. What is different between the cord\nfilament and the nylon rope that you made?\n3.\nSupported membranes: Tabulate the required observations. Comment on whether\nyour nylon films supported on Millipore membranes are porous and permeable to dye, or\nimpermeable. Considering that the membrane is hydrophilic, what do you think happened\nin each case."
    },
    {
      "category": "Resource",
      "title": "7.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-467-polymer-science-laboratory-fall-2005/6591df3ba8911d7991288ba6e03c0fe1_7.pdf",
      "content": "Experiment 7: Characterization of uncrosslinked natural rubber from\nrubber tree latex and of crosslinked natural rubber.\nAim: To study the stress-strain properties (and effects of time and temperature) of\nuncross-linked natural rubber synthesized in the lab from latex and commercial cross-linked\nrubber.\nMaterials and Apparatus:\nLatex uncross-linked rubber\nCommercial vulcanized rubber pads\nIce\nRing stand\nClamps\nThermometer\nDial micrometer (0.001\")\nForce gauge\nStop watch\nBrief Background:\nNatural rubber:\nIt has been established especially by nuclear magnetic resonance\nspectroscopy that \"natural rubber\" from the tree Hevea Braziliensis is more than 98%\npoly(1,4 cis isoprene). This configuration is shown below:\n(1)\nRubber is drawn from the rubber tree in the form of an emulsion, called \"latex\". Latex from\nthe tree Havea Braziliensis consists of ~ 60 % poly (1,4 cis isoprene), 40% water, soap and\n\nNH3. Upon evaporation of water, the sub-micron globules of rubber coalesce, yielding a\nmaterial that is strong mechanically, yet tacky (sticky). GPC has established that the\nmolecular weight distribution is very broad: some fractions run into few million g/mol in\nmolecular weight (this fraction is the origin of strength) and others are only a few thousand\ng/mol (this fraction is the origin of \"tackiness\").\nOther configurations of polyisoprene: In the case of polydienes, several possibilities of\naddition of the monomer onto the growing chain are possible. In the case of isoprene, for\ninstance, the polymerization can involve only one double bond (1,2 -addition, or 3,4-\naddition), or it can involve both together (1,4-addition). In the former cases, the stereo\nplacement of the substituent in 1,2- or 3,4- units can be controlled in some instances. In the\nlatter case, the double bonds in the chain also involve stereoisomerism: They can be 1,4-cis\nor 1,4-trans, the properties of the corresponding polymers being widely different, ranging\nfrom a soft, amorphous gum to a hard, crystalline, non-elastomeric solid.\n\nCondition for exhibiting rubber-like properties: Any material with rubber-like properties is\ncharacterized by chains which exhibit significant flexibility and mobility at the temperature\nunder consideration. Hence, for polybutadiene and polyisoprene to exhibit rubber-like\nproperties, the molecules must be preferably cis-1,4 or at least a random copolymer of cis\nand trans units. The all 1,4-trans arrangement results in a very regularly packed organization\nof the molecules into crystals with high melting points (well above room temperature). The\nsecond requirement is the presence of crosslinks (permanent covalent crosslinks and chain\nentanglements), which hold the material together at specific points during deformation.\nMechanical properties vs. time and temperature for rubbers: A rubber sample (of initial\nlength, Lo and cross sectional area, Ao) under tensile stress (f/Ao) stretches to a length, L\nand exhibits a resistance against further deformation. One unique aspect of this resistance\nin rubbers is that it originates from the tendency of the chains to increase their entropy again\nfollowing the reduction of entropy of the chains on stretching. This is very different from\nwhat happens in other materials where the tendency to reduce total energy (not entropy) is\nthe source of resistance.\nThe following relationship is found to hold for small elongation ratios (a~1)\nbetween stress and elongation ratio (a=L/Lo) in rubber:\nt = f = Eo a - 1\n(4)\nAo\na\nwhere,\nEo = RT ne\n(5)\nVo\nwhere,\nEo = Tensile modulus of rubber.\nR = Universal gas constant.\nT = Absolute temperature.\n(ne/Vo) = moles of elastically effective chains per unit initial volume\n= network chain density\n\nUsing this equation, what happens to stress when the elongation ratio is kept constant and\nthe temperature is increased? What happens to the elongation ratio if the temperature is\nincreased while keeping the stress constant? (Rubber shrinks on increasing the\ntemperature). Contrast this with what happens when you heat a piece of metal.\nThe non-crosslinked material is viscoelastic - not an ideal rubber - and hence\n\"flows\" (or \"creeps\") with time. The chain entanglements can act as effective crosslinks\nover short time frames (like the time it takes to \"snap\" a rubber band) but not over the long\ntime frames of a stress relaxation or creep experiment (minutes to hours).\nUnder the\napplied stress, the entanglements slowly \"unwind\" and/or polymer chains slip and flow\npast each other.\nViscoelasticity: It may be easier to understand the viscoelastic effect - which is akin to a\ncombination of traditional viscous and rubber elastic deformation behavior - using a spring\nand dashpot model (called the Maxwell model). The spring is elastic; stress is directly\nproportional to strain. The dashpot is plastic; it behaves like a liquid and flows in response\nto a stress.\nStress Relaxation experiment and creep experiment: In a relaxation experiment, the strain is\nkept constant and the variation of stress with time is monitored (i.e., the stress relaxation is\nobserved). In a creep experiment, the stress is kept constant and the variation of strain with\ntime is monitored (i.e., the creep of the material is observed).\n\nPrecautions:\nNo special precautions.\nProcedure:\nThe session before this lab\nAt the end of the preceding lab session, you will have made (at least) two latex\nrubber bands for Experiments 7 and 8 (optional). You will need at least one of the rubber\nbands for this experiment. Rubber band preparation will be done by carefully syringing\nthe unvulcanized (uncrosslinked) latex into O-shaped molds.\nSyringing of the polymer\nmust be done slowly to maintain a continuous stream out of the needle, and you must avoid\nintroducing holes or bubbles that may serve as mechanical defects. The mold should be\nfilled as close to the top as possible. The bands will be allowed to \"dry\" under the hood.\nYou will also be working with cross-linked rubber bands that are available commercially.\nThese bands will be provided in lab (they are the traditional rubber bands used in offices).\nNote: Calculate stresses and elongation ratios as you move along in these\nexperiments. Also note that experiments A.2-3 and B.2-3 may be done simultaneously\nin the same ice bath.\n\nA. Experiments with non-crosslinked rubber:\n1.\nYou have already prepared non-crosslinked rubber bands (prepared in the lab from\nlatex by evaporation of water) which look like O-rings, are somewhat tacky, and are cast\nfrom D inch diameter circles. The circumference is p (D X 2.54) cm. When this ring is\nstretched, it effectively behaves as two equal length specimens, each of initial length Lo = p\n(D X 2.54)/2 = (half of the circumference). If the ring had an initial cross sectional area of\nAo, then the cross sectional area bearing the stress is 2 Ao.\n2.\nStrain at low temperature: Set up the ice-water mix and measure the temperature.\nHolding the \"O-ring\" under the ice-water mix, pull it as far as you can. Measure the length\nto which it gets stretched. Release the rubber band, and measure the length (if different)\nupon release.\n3.\nStrain at high temperature: Now remove the ice cubes, while keeping a thermometer\nimmersed along with the rubber. Slowly add tepid water with stirring. Observe a) the\ntemperature at which the rubber band starts to shrink from its stretched state and b) the\ntemperature at which it has regained its initial circular state (D inch diameter) or the\ntemperature at which no further shrinking occurs.\n4.\nStress relaxation experiment: Using the force gauge, a ring -stand, and suitable\nclamps so as to pull the band to an elongation ratio of L/Lo of about 3 at room temperature\n(you may need to use lower strain ratios depending on the thickness of the band you made).\nWhatever the elongation ratio is, record it, and keep it fixed. Record ambient temperature.\nRecord force as a function of time at 5 minute intervals for 30 minutes. After 30 minutes,\nremove the load, let the band relax, and measure its new diameter D'. The original diameter\nbeing D inches, (D'-D)/D is the fractional permanent \"set\" or fractional creep.\n(conversion factor: 1 lb = 0.454 kg)\nB. Experiments with commercial vulcanized rubber bands:\n1.\nYou are given commercial rubber bands that are thinner in cross section than the\nnon-crosslinked rubber bands, are non-tacky and usually race track shaped (two straight\nruns connected to semicircles).\n2.\nStrain at low temperature: Set up an ice-water bath and measure the temperature.\nHolding the commercial rubber band under the ice-water mix, pull it as far as you can.\nMeasure the length to which it gets stretched. Release the rubber band, and measure the\nlength (if different) upon release.\n3.\nStrain at high temperature: Now remove the ice cubes, while keeping a thermometer\nimmersed along with the rubber.\nSlowly add tepid water with stirring. Observe the\n\ntemperature at which the rubber band starts to shrink from its stretched state and the\ntemperature at which no further shrinking occurs.\n4.\nUsing a hand held force gauge, determine the tensile stress-strain at room\ntemperature. Record the temperature. Recall that two strands of rubber support the load\nequally, so that the cross-sectional area = 2 Ao. Ao is the cross-sectional area of the rubber\nband.\n5.\nThermoelastic Property Experiment: Arrange a set-up like that discussed in section\nA.4 of the procedure, so that you can impose an elongation ratio L/Lo of 3. Record the\ntensile force and the temperature.\n6.\nKeeping the elongation ratio at 3.0, pour ice water (near 0 C) over the band until you\nget a constant force reading. Record it.\n7.\nRemove the ice water and substituting hot water of known temperature (say 60-70\nC). Again try to obtain a constant force reading. Record the temperature.\n8.\nStress relaxation experiment: This experiment is the same as in section A.4.\nUsing the force gauge, a ring -stand, and suitable clamps, pull the band to an elongation\nratio of L/Lo of about 3 at room temperature (you may need to use lower strain ratios\ndepending on the thickness of the band you made). Whatever the elongation ratio is, record\nit, and keep it fixed. Record ambient temperature. Record force as a function of time at 5\nminute intervals for 30 minutes. After 30 minutes, remove the load, let the band relax, and\nmeasure its new length L'. The original diameter being L inches, (L'-L)/L is the fractional\npermanent \"set\" or fractional creep.\nYour report:\nObservations and Calculations:\n1.\nRecord required observations in the procedure/brief background in the lab\nnotebook. Be sure to record all relevant dimensions of the samples.\n2.\nReport all relevant stresses and elongation ratios.\nDiscussion:\n1.\nNon-crosslinked rubber:\na) Plot the circumference of the band as a function of temperature temperature for\nthe ice bath experiment.\nb) After reporting exact elongation ratio and other relevant conditions, plot the\ntensile stress vs. time for the relaxation experiment. Choose appropriate units. Compare\nyour results with what the Maxwell model predicts.\nc) Report fractional creep. Explain why you observe creep in these samples.\n\n2.\nCrosslinked rubber:\na) Plot tensile stress vs. elongation ratio, a.\nb) Plot the reduced modulus, t*, vs 1/a where,\n*\nt =\nt\n(6)\n-2\na-a\nc) Use plot in part b) to calculate the tensile modulus using equation 5. (The tensile\nmodulus is the reduced modulus as elongation ratio approaches 1.)\nUse the tensile\nmodulus to calculate the network chain density.\nd) Plot tensile stress vs. temperature (in Kelvin) and discuss the results with respect\nto the background given in this handout and the lecture.\n3.\nDiscuss experimental difficulties or inaccuracies, sources of error etc. (For example,\nwere there air bubbles or did the rings cast from latex have uniform thickness? What will be\nthe effect of such errors on your result? Or was temperature control a problem?)"
    },
    {
      "category": "Resource",
      "title": "10.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-467-polymer-science-laboratory-fall-2005/d4355185f20cf50b5be33cd9dba897f2_10.pdf",
      "content": "Experiment 10: Polymerization of methyl methacrylate (MMA) in\nbulk to form PMMA.\nAim: (a) To study the bulk polymerization of undiluted MMA to PMMA initiated by a\nsingle radical initiator at elevated temperature and to determine volumetric shrinkage after\nconversion is complete.\n(b) To polymerize MMA in the presence of PMMA at room temperature by\naddition of a redox pair (double radical initiator) [benzoyl peroxide (BP) - dimethyl\nparatohidine (DMPT)] and to follow percent conversion by the temperature-time course.\n(c) To study polymerization of MMA to PMMA as it occurs in a commercial kit\nused by orthopedic surgeons to make bone cement and to follow the conversion by the\ntemperature-time course.\nMaterials and Apparatus:\nPrepared master solutions of 100 g PMMA in 500 ml MMA (per vial)\nMMA monomer\nDMPT (N,N Dimethyl para toluidine)\nBenzoil peroxide (BP)\nBone cement packets made by Howmedica: Surgical Simplex P\nvials/testtubes (>10ml) (note: polystyrene is not appropriate for this experiment.\nWhy?)\nGraduated conical polypropylene centrifuge tubes, 15 ml capacity\nVials\nAl foil\nHeaters\nThermometers\nWater bath\nPlastic floats to insulate water bath\nBrief Background:\nWe have already studied several aspects of free radical polymerization. In this\nexperiment, we shall study the free radical polymerization of MMA to PMMA. This\npolymerization also allows us to study the Trommsdorf effect because we will do the\npolymerization in the bulk rather than solution. We shall also see a practical application of\nthis polymerization viz., its use in joint replacement as bone cement.\n\nFree radical polymerization: (Read expt. 1, 4 lab instructions \"Brief Background\" section\nand re-read Rempp & Merrill, Ch 3)\nFree radical polymerizations are usually performed using one of four different\nmethods: bulk polymerization, solution polymerization, suspension polymerization and\nemulsion polymerization. This experiment illustrates certain aspects of bulk free radical\npolymerization. We shall study suspension polymerization in experiment 13.\nFor a brief introduction to different kinds of free radical polymerization, read the excerpt\nfrom Young and Lovell, Introduction to Polymers, Chapman & Hall, 1991, pg. 63-68.\nBulk free radical polymerization of MMA to PMMA:\nIn this experiment, we are polymerizing MMA to PMMA:\n(1)\nCH3\nCH3\nH2C\nC\n\nC\nC\nO\nH2\nO\nH3CO\nH3CO\nn\nMMA:\nMW=100 g/mol\nPMMA:\nTg~100 C\nTm = -48 C\nno Tm\nTb = 100 C\nno Tb, decomposes\ndensity = 0.94 g/cm3\nThe redox system of initiators that we shall use are:\n(2)\n\nO\nO\nO O\nH3C\nN\n+\nDMPT\nBenzoyl Peroxide\nO\nO\nO\nO\n+\nH3C\nN\n+\nAs in experiment 1, the equations describing the process are:\nconversion X = 1 - e-Gt\n(3)\nwhere\nG = (kp/kt\n0.5)(kr [BP] [DPMT] )0.5\n(4)\nand\nkinetic chain length = kp/(krkt)0.5 * [M]/([BP] [DPMT])0.5\n(5)\nBulk polymerization is usually slow. This process is used to make clear rods, tubes and\nsheets of PMMA. The process followed in making \"Optical\" PMMA is described in the\nexcerpt from Rempp and Merrill, Polymer Synthesis, Huthig & Wepf, 1991, pp. 294-295.\nTrommsdorf effect:\nThis phenomenon is described in the excerpt from Rempp and Merrill, Polymer\nSynthesis, Huthig & Wepf, 1991, pp83-86.\nBone cement: (see the manufacturer's instructions from Howmedica)\nBone cement is the \"cement\" that is used by orthopedic surgeons to hold joint\nreplacements in place. Figure 1 below illustrates how bone cement is used in the total hip\nreplacement.\n\nThe orthopedic surgeons typically mix the monomer, polymer and the initiators at\nthe operating theatre just before fitting an implant. The implant is fitted in place and the\ncement injected into the gaps. The cement solidifies following complete polymerization and\nholds the implant steadily in place.\nThe manufacturer's instructions for the use of bone cement are included in the\nfollowing pages. Be sure to read the contents of each packet/ampule and the procedure.\n(Note that barium sulfate is added as a radioopaque agent so as to make the cement visible\non x-ray photographs. Although it is not mentioned, benzoyl peroxide is likely to be\npresent in the polymer powder.)\nExercise: Polymerization of one packet of bone cement involves:\nampule: 20 ml MMA monomer + DPMT\npacket: 40 g PMMA + poly(styrene-MMA) powder + BP+BaSO4\n∆Hpolymerization = -13 kcal/mol\nCp ~ 0.5 cal/g/C\nWhat is the calculated temperature rise at 100 % conversion assuming adiabatic conditions?\n\nPrecautions:\n1.\nPerform all transfer of monomer inside the hood. (You can use pipettes.)\n2.\nUse vinyl gloves.\n3.\nWhile weighing of powdered polymer and of granular initiator (BP) can be done on\nthe bench outside the hood, the measured quantities can be added to and mixed with the\nmonomer in the hood. In general, minimize exposure to vapors of monomer.\nProcedure:\nA. Maximum volume shrinkage-----Single initiator & undiluted monomer:\n1.\nDissolve 100 mg of BP (grind BP using a mortar and pestle first) in 10.0 ml of\nMMA in a glass vial. When the BP is fully dissolved, transfer to a 10 ml graduated\ncylinder. Dropwise, adjust the volume so that the meniscus is just even with the top mark (0\nml or 10.0 ml) of the graduate. Loosely stopper.\n2.\nPlace in a water bath operating at between 60 C and 70 C, the level of the water\nshould be slightly higher than the MMA level. Use plastic floats to insulate water bath\nagainst evaporation.\n3.\nRetrieve your sample at the next lab period, and determine by what percent the\nvolume has decreased as a consequence of polymerization, if the contents are a hard solid. If\nthe contents are viscous, conversion is incomplete and the shrinkage observed will not be the\nmaximum possible, but report it in any case along with your observation of the physical\nnature of the contents. If vapor bubbles have formed, can you estimate what % of the\nvolume is due to these voids? How might you decrease the number of bubbles that form?B.\nRedox initiated room temperature initiated polymerization of MMA in the presence of\nprevious made PMMA:\n1.\nThe purpose of the experiment is to illustrate how viscosity affects the\npolymerization kinetics. To this end, a master solution has been prepared of the following\ncomposition:\nPoly(methyl methacrylate)\n:\n100 g\nMethyl methacrylate (density = 0.93 g/cc)\n:\n500 ml (465g)\n(Determine wt % MMA in the master solution and the number of grams in each of\nthe following diluted solutions)\n2.\nMake the following dilutions by adding MMA monomer,\nVial # 1:\n8 g master solution + 8 g MMA\n(Total = 16g; Wt % MMA= 91.2; Net MMA=14.6g)\nVial # 2:\n12 g master solution + 4 g MMA\n(Total = 16g; Wt % MMA= 86.7; Net MMA=13.9g)\n\nVial # 3:\n16 g master solution\n(Total = 16g; Wt % MMA= 82.3; Net MMA=13.1 g)\n3.\nAdd 45 mg of finely ground benzoyl peroxide (BP) per gram of net MMA, to each\nvial. Stir until dissolved. Warm if necessary. Bring back to room temperature if it has been\nheated. Now add 0.025 ml of dimethyl paratoluidine (DMPT) per gram of MMA. Mix well.\n4.\nAfter mixing the vial can be removed from the hood and set up with insulation on\nthe bench (minimize exposure to monomer vapor). Insert thermometer or thermocouple well\nwrapped with aluminum foil. (Try to make sure that the initiators are not exposed to air as\nfar as possible.) Insulate the vial very well on all sides to avoid heat loss. Record\ntemperature vs. time until a plateau is reached.\nC. Howmedica(r) bone cementkit:1. You are given a kit of bone cement that has a\npowdered component, which contains an unspecified amount of benzoyl peroxide, and the\nMMA monomer in the ampule, which contains DMPT.\n2.\nTo mix, empty the entire contents of the packet containing the powder component\ninto a container. Add the entire contents of the ampule containing the liquid component.\nAdd the liquid component to the powder, not the powder to the liquid. Stir with a wooden\ntongue depressor. Insulate the container very well so as to minimize heat loss. Use a\nthermometer/thermocouple wrapped in foil to measure temperature.\nObservations and Calculations:\n1.\nRecord observations (volume shrinkage and temperature vs. time) required in the\n\"Procedure\".\nDiscussion:\n1.\nDiscuss your results in the context of the theory and equations. Should more than\none growth constant be used to describe these reactions?\n2.\nChose appropriate plots to illustrate concepts or comparisons.\n3.\nSuggestion for organizing your discussion section:\n- State a result (a number like temperature rise or a comparison between part A, B,\nand C or something else)\n- State what you expect from theory and if your result is in concordance.\n- Discuss why/why not?\n\n4.\nDo not forget to include other discussions like sources of error, suggestions for\nimprovement etc."
    },
    {
      "category": "Resource",
      "title": "experiment_11.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-467-polymer-science-laboratory-fall-2005/f26d6cfc67ca6eae81bd419df3511888_experiment_11.pdf",
      "content": "Experiment 11: PVC - Influence of plasticizer content and testing\ntemperature.\nAim: (a) To make \"plastisol\" compositions (suspension of fine spherical particle of PVC\nin a liquid like di-octyl phthalate, DOP), in which the PVC/DOP ratio is varied.\n(b) To measure the shear-stress-shear rate relation of these plastisol compositions,\nand thus the viscosity-shear rate relations, using the Bohlin coaxial cylinder viscometer and\nto determine viscosity as a function of volume fraction of PVC.\n(c) To estimate the temperature Tgel at which, upon heating, the fluid plastisol turns\nto a crumbly paste, and the higher temperature Tm at which the opaque crumbly paste\nbecomes transparent.\n(d) To form 2\" diameter rings of the plastisol compositions by heating in aluminum\nmolds in a heated platen press, at a temperature about Tm. To test the quenched rings for\ntheir elastic response and compare it to that of laboratory vinyl tubing.\n(e) To measure the stress-strain-time-temperature response of the rings before, as a\nfunction of plasticizer content.\nMaterials and Apparatus:\nDOP -- Dioctyl phthalate or di-2-ethyl hexyl phthalate\nPVC powder (paste grade resin)\nZCS - Zinc Cadmium Stearate, the heat stabilizer\nMethanol\nAl weighing dishes\nGlass scintillation vials (20 ml capacity)\nstirring rod\nplastic vials (>10 ml)\nglass containers (disposable)\nPapers and cotton swabs\nAl foil\nBucket\nMortar and pestle\nForceps\nThermistor probe\nAl molds\nHigh temp. gloves/pliers\n\nRing stand\nWeighing machine\nVacuum desiccator or vacuum oven + vacuum pump\nBohlin viscometer\nSand bath (dry sand in a stainless steel beaker on a hot plate)\nhand held force gauge\nBrief Background:\nPVC is a vinyl polymer that can be produced with different stereoregularity. The\nsyndiotactic PVC can be particularly crystalline with a very high melting point and hence\nimpossible to process. Thus, stereoregularity of the PVC produced is important. PVC is\nusually synthesized by either emulsion polymerization (to produce \"paste grade\" PVC -\nvery fine particles) or by suspension polymerization (to produce \"dry blending\" PVC --\nlarger size particles). The paste grade PVC is particularly useful for \"plastisols\" which are\ndispersions of glassy PVC in plasticizing liquids like DOP. The rheological behavior of\nthese plastisols is of particular interest to the PVC processing industry. When the plastisols\nare heated above the Tg of PVC, the PVC particles become rubbery -------> the diffusion\ncoefficient of DOP into the polymer increases ------> the PVC absorbs the suspending\nsolvent ------> We have a PVC paste with DOP inside it. This paste can then be molded into\nproducts at temperatures above the melting temperature of PVC . The resulting polymer\nproduct is viscoelastic and hence shows the characteristic property of hysteresis. The more\nthe DOP, the lower the Tg of the resulting PVC.\nThe properties of a polymer are strongly affected by whether the polymer is\nisotactic, syndiotactic, or atactic. See Rabek, Section 1.2.4 for more information about\ntacticity of polymers. For more information about the synthesis of PVC plastisols, refer to\nthe handout from Rempp & Merrill (pp 267-272).\n\nPVC is a semicrystalline polymer:\nPVC is a semicrystalline polymer i.e., it has crystalline and amorphous regions\nwithin it. Among the other polymers we have studied so far, Nylon was also a\nsemicrystalline polymer. On the other hand, PMMA (plexiglass) and (atactic) polystyrene\nare not semicrystalline (these have no crystals; they are completely amorphous). Note that\nonly polymers that have crystals can show a melting point (Tm is the temperature at which\nthe crystals melt) whereas all polymers show a glass transition temperature (Tg is the\ntemperature above which segments of the polymer chain exhibit motion). The Tg is always\nlower than Tm. For example, for PVC, Tg ~ 100 C while Tm ~ 170 C.\nPVC usually shows fringe-micellar crystals as opposed to Nylon, which shows\nchain folded crystals. Thus you end up with crystals that are \"tie points\" for the\ninterconnected amorphous regions. When these amorphous regions are plasticized with\nDOP, their glass transition is lowered to a value below room temperature. This makes the\namorphous regions flexible at room temperature. Applied stress results in a tough rubbery\nmechanical behavior. Heating above the melting point of the crystals results in flow of the\nentire matrix. See the handout from Rabek, Experimental Methods in Polymer Science,\npp443-450 for a description of the two types of crystal morphologies.\nThe viscoelastic behavior of polymers is strongly dependent upon temperature,\nespecially around the important transition temperatures, Tg and Tm. As a result, there are\nfive \"regions\" of viscoelastic behavior that are common to most polymers. The behavior in\nthese regions and the locations of the transitions can also be affected by plasticizers. This\nimportant behavior is described in more detail in the handout from Sperling, Introduction to\nPhysical Polymer Science (1992), pp309-319.\n\n________________________________________________________________________\n________________________________________________________________________\n________________________________________________________________________\nPrecautions:\n1)\nUse vinyl or nitrile rubber gloves\nProcedure:\nParts A through C should be completed in Day One; Day Two will involve Part D.\nA. Plastisol preparation:\n1.\nMake three identical master batches (of the following composition), one after the\nother, using the same mortar and pestle (note ZCS is a heat stabilizer). Each batch will be\nused for a different part of the experiment (Parts B-D).\nMaster batch composition\nwt%\nMaster batch preparation\nZCS\n1 g\n3%\n1) First weigh out ZCS in Al dish,\nDOP 13 ml (12.7 g)\n38%\n2) then, add DOP to it, stir, mix, transfer to mortar.\n(ρ=0.90732)\nPVC\n20 g (14.4 net ml)\n59%\n3) Then add PVC slowly while mixing.\n(density of PVC = 1.39 g/ml)\n2.\nGrind the initial PVC-DOP-ZCS mixture in mortar until fluid. No powdery PVC\nshould remain. Divide each of the three master batches into four equal portions. Transfer\napproximately 8.25 g (but note the exact amount transferred) of each master batch into glass\nscintillation vials (20 ml capacity).\n3.\nFor each batch, add additional DOP to each of the scintillation vials according to the\ntable below to get compositions α through δ of four different volume fractions of PVC. The\namounts shown below are for the case where 8.25 g of master batch are used. If the amount\nof plastisol used by you is different, then calculate the corresponding amount of DOP to be\nadded to get the same volumetric fractions of PVC given below.\nTable: Recipes\nPlastisol composition\nMaster batch\nAdd. DOP\nVolume fraction PVC\nα\n8.25 g\nβ\n8.25 g\nγ\n8.25 g\nδ\n8.25 g\nnone\nφα = 0.51\n1.1 ml\nφα = 0.44\n2.2 ml\nφα = 0.39\n3.3 ml\nφα = 0.35\n\n4.\nThe DOP added to the scintillation vials should be mixed in well by stirring rod.\n5.\nThus we should have three sets of vials. Each set of four vials shall consist of four\ndifferent plastisol compositions, α - δ. The first set of vials should be placed under vacuum\nin a vacuum desiccator or vacuum oven (not heated) to remove entrained air for part D. The\nother two sets will be used for part B and C and do not need to be placed under vacuum.\nB. Bohlin viscometer: Shear stress-shear rate vs. composition\n1.\nWe have about 8 ml of sample for each composition. Place this in a \"sawed-off\"\nplastic vial, the capacity of which is about 10 ml. Then lower the Bohlin viscometer into the\nvial. Place a weighing dish under the vial to collect the overflow. The bottom of the cylinders\nshould be just clear of the bottom of the vial to fill the gap between the cylinders.\n2.\nStart with pure DOP as the control, because we will be seeking to find the relative\nviscosity (viscosity paste/viscosity DOP) as a function of the volume fraction PVC. Record\nthe (room) temperature at which you carry out these experiments. Then run the same\nexperiment for compositions α-δ. After each run, i.e., DOP, α-δ , pour out the paste as\nmuch as possible into a common metal or glass discard container, wipe out the cylinders\nwith paper and/or cotton swabs, then introduce the next sample. You may find that a few ml\nof methanol will aid in cleaning up the cylinders. Be sure to dump methanol rinses in a\nmethanol waste bottle, NOT the container used for undiluted plastisol.\nC. Temperature response of plastisol:\n1.\nThis will not be an exact experiment. You will have a sand bath, i.e., dry sand in a\nstainless steel beaker on a hot plate. The temperature of the sand bath should be about 180\n200 C. (Be careful. Hot!)\n2.\nHold your vial (containing α-δ) with forceps, and immerse it halfway in the hot\nsand. Use the probe of your thermistor to mix and stir the sample. Record the temperature\nat which it turns to a crumbly, non-fluid gel, still opaque.\n3.\nContinue heating until the contents become transparent. This will happen at the wall\nfirst, so position the thermistor next to the wall.\n4.\nAfter these measurements are made, the vials are discarded in glass trash.\nD. Forming rings for tensile property evaluations (\"Fluxing\")- To be done on Day 2\n1.\nYou will use the aluminum molds previously used for making rubber rings by\nevaporation of latex. Each team has one mold. Pour your plastisol which has been under\n\nvacuum into the circular slot. Avoid trapping air bubbles. Avoid overfilling. Place aluminum\nfoil on top.\n2.\nPlace in Carver press, with platens at 350 F. Close press. Develop slight gauge\npressure. After 30 seconds to 60 seconds, open press (lower the bottom platen). Remove the\nhot mold (Careful! Hot!) with pliers. Under no conditions should you grab the mold by\nhand. Drop the mold into a bucket of cold water. When cool, remove, pull off foil, pry out\nfused ring.\nE. Tensile property evaluation\n1.\nExperiments at room temperature: At room temperature (record it), pull each of your\nrings (α-δ) until the maximum force (2.5 lb) is reached on your hand-held meter. Read the\nstrain ∆L/Lo produced by that force as accurately as possible. Maintain that strain ∆L/Lo,\nwhatever it is, and record the force as a function of time for 15 minutes.\n2.\nExperiments in the cold: Place your ring (α-δ) in ice water for 2 minutes. Then,\nkeeping it cold with a wet towel, or under ice cubes, pull it to a maximum tensile force of 2.5\nlb. Record the strain (to the best of your ability).\n3.\nExperiments at around 60C:\na) Measure temperature and record. Set up ring in stand, with hand held tensile force\ngauge connected to PVC-DOP ring by a wire around 6\" long. Connect lower end of ring\nstand clamp. Raise upper ring stand clamp, or trim connecting wire until gauge shows 2.5\nlbs force. Record strain.\nb) Slowly pour the hot water over the DOP-PVC ring and record the force gauge\nload with time, every 5 seconds, until you run out of hot water. If this were an \"ideal\"\nrubber, the force would go up. Does it?\n4.\nIf you have the time, determine the % of strain recovery on release for the PVC as a\nfunction of strain. Is there any permanent (unrecovered) deformation?\nObservations and Calculations:\n1.\nTabulate the torque and RPM (tested at various RPMs) for each of the recipes (Part\nB of the experiment).\n2.\nRecord visual observations at different temperatures for part C.\n3.\nPart E: For each of the recipes,\na) Record elongation at 2.5 lbs force for 0 C, room temperature and 60 C.\nb) Record relaxation of stress with time at room temperature.\nc) Record changes in stress at fixed strain as temperature is changed.\n4.\nThe raw data for part B should be processed as you did in experiment 2.\n\n5.\nThe raw data for part E should be processed as into plots of stress and elastic\nmodulus vs temperature, to show the viscoelastic (glassy or rubbery) behavior of the\nplastisol.,\nDiscussion:\n1.\nDo you see differences in the mechanical behavior of the plastisols with differing\namounts of plasticizer? Describe these differences, and why you see them.\n2.\nDo these materials follow the expectations of ideal rubber elasticity, including the\nthermoelastic behavior? Why or why not?\nExplain what you expect to see in these\nmaterials, and how they differ from the crosslinked natural rubber bands in terms of\nmechanical behavior."
    },
    {
      "category": "Resource",
      "title": "experiment_12.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-467-polymer-science-laboratory-fall-2005/dcc8d67b59d1de078f56331af0dda027_experiment_12.pdf",
      "content": "Experiment 12: Networks:\nA)\"Epoxy\" and \"RTV Silicone\"; B) Rapid step reaction accompanied\nby foaming using Hypol.\nAim:\n(a1) To study the cross-linking of epoxy/amine using two commercial kits: \"5 Minute\nEpoxy\" and \"Epoxy Patch\".\n(i) To determine the range of ratios of epoxy to amine over which networks are\nformed. To determine the time to gel for the \"5 Minute Epoxy\" kit.\n(ii) To determine the degree of swelling in solvent methyl/ethyl ketone as a function\nof epoxy/amine ratio, of gels from both kits.\n(iii) To determine extractables (via MEK) as a function of epoxy/amine ratio, of gels,\nfrom both kits.\n(iv) To determine the long term effect of water immersion as a function of\nepoxy/amine ratio, or gels not treated with MEK, from both kits.\n(a2) To study the cross-linking reaction in GE's \"RTV Silicone\".\n(i) To determine the weight loss (%) which accompanies each of the curing\nreactions.\n(ii) To determine the swelling ratio after long term exposure to liquid toluene. To\ndetermine extractables, if any.\n(iii) To determine the uptake of water after long term exposure to liquid water.\n(b) To investigate the reaction of Hypol with pure water as a function of mass ratio, and to\nqualitatively observe the properties of the foams produced after evaporation of water.\nMaterials and Apparatus:\nCommercial kits: 5 Minute epoxy, Epoxy patch, RTV silicone\nToluene\nHypol\nscintillation vials with caps (26)\nglass microscope slides\nplastic cups --- 12 ounce\nVariable speed stirrer with propeller\naluminum weighing dishes\naluminum ring mold\nwooden splints\n\nBrief Background:\nSummary:\nAll the polymers you shall study in this experiment have the following features:\na) Step polymerization mechanism: All polymerizations in this experiment are step\npolymerizations. You shall study both polycondensation and polyaddition reactions. For\nthis experiment, you should re-familiarize yourself with the reactions discussed in Ch. 2 of\nRempp & Merrill in the Supplemental Reading.\nb) Crosslinking and formation of networks: All the polymers here result in networks after\ncross-linking. You shall see glassy networks, rubbery networks and foamed networks.\nExercise: You should be able to say how networks are characterized. What makes a\npolymer glassy or rubbery (at the molecular level what is happening)? What is the physical\nproperty (hint: a temperature) of importance here? How does this difference manifest itself\nin the mechanical properties? Using simple thinking, what do you think should be required\nfor a network to be made into a foam?\nEpoxy-Polyamine:\nSee supplemental reading from Rempp & Merrill, Polymer Synthesis, pp54-57 for\nmore details.\nExercise: 1) What do you think is the difference between the \"5-Minute epoxy\" and\n\"Epoxy-patch\"? Why is one slower than the other? (Hint: The amine in the \"Epoxy patch\"\nis diethylene triamine i.e., three amine groups). 2) Is the epoxy a glassy network? How did\nyou guess? 3) What do you expect will happen as the relative proportions of epoxy and\npolyamine are changed?\nRTV Silicones:\nPlease read the special handout on Step Reactions Used to Cross-link\nPoly(dimethyl siloxane) for more details. Appendix 1 consists of excerpts from the GE\nSilicone data book \"Two-Component RTV Silicone Rubber Compounds for Industrial\nApplications\".\nExercise: 1) Which of the silicones used by you cure by the reaction schemes\ncorresponding to the different reaction schemes (eq. 5.7.2, 5.7.3) in the handout? 2) Why\ndoesn't the RTV Silicone in experiment A2 (part I) not cure within the tube? 3) In the\nfollowing pages, think about how silicones with different properties can be achieved?\n\nHypol:\nAppendix 2 consists of excerpts from the Hypol instructions sheet produced by\nHampshire Chemical Company and other excerpts from the document \"Hypol prepolymer:\nStarter sample kit booklet\".\nExercise: 1) What molecular and experimental variables could determine the\nproperties of the foam? 2) Suggest a novel use for the foam considering its properties. The\nuse should be different from those already suggested in Appendix 2.\nHypol, originally manufactured by W.R. Grace Co., is now produced by Hampshire\nChemical Co., a spin-off from W.R. Grace. The product (before addition of water) is a\ntrifunctional branched molecule of which the \"arms\" are poly(ethylene oxide) terminated by\ntoluene isocyanate.\nCH2CH2OCH2CH2O....CH2CH2O....NCO\nCH2CH2OCH2CH2O....CH2CH2O....NCO\nCH2CH2OCH2CH2O....CH2CH2O....NCO\nThe reactions that lead to the foamed network are given in Appendix 2.\nPrecautions:\n1.\nUse vinyl gloves while dealing with solvents. Latex gloves are fine for other parts.\n2.\nUse toluene in the hood.\n3.\nHandle Hypol in the hood.\nProcedure:\nThis year, we will make the following changes to the procedure described below:\na) For the 5-Minute Epoxy, each group is only required to prepare 5 recipes:\n(a, a1), (c, c1), (e, e1), (g, g1), and (i, i1).\nb) For the epoxy patch slow crosslinking, Team A should prepare vials j-m for\nMEK trials, and Team B should prepare vials j1-m1 for water trials. Share\ndata for analysis.\nc) The material actually used in RTV Silicone: Part I is GE-RTV-108.\nd) Omit RTV Silicone: Part III\n\n________________________________________________________________________\n________________________________________________________________________\n________________________________________________________________________\n________________________________________________________________________\nA1. Crosslinking of epoxy/amine:\n1.\nPreweigh and label 26 scintillation vials which will be coded a, a1, b, b1 ......\nm,\nm1. Ultimately the vials a-m will receive methyl ethyl ketone (MEK) and the vials a1 - m1\nwill receive water. The vials should be weighed without their caps.\n2.\n5-Minute Epoxy (fast crosslinking):\na) The previously joined syringes have been cut so that each can be used separately.\nThe polyamine syringe has the slightly yellowish liquid. We shall use the vials a, a1 - i, i1 .\nb) Introduce the amount shown of epoxy into the middle of the floor of the vial, and\nthen the polyamine on top of the epoxy. You need not dispense exactly the amount shown,\nbut you must record exactly what you dispense. For example, for a, you may have taken not\n0.50, but 0.45 g epoxy and 4.6 g polyamine.\nTable: Recipes\nFor vial ......\na,a1\nb,b1\nc,c1\nd,d1\ne,e1\nf,f1\ng,g1\nh,h1\ni,i1\nAdd g of\nepoxy.......\n0.5\n1.0\n1.5\n2.0\n2.5\n3.0\n3.5\n4.0\n4.5\nAdd g of\npolyamine..\n4.5\n4.0\n3.5\n3.0\n2.5\n2.0\n1.5\n1.0\n0.5\nc) Mix thoroughly the a - i set of vials with a wooden splint, remove the splint, re\ndetermine the net weight of the mixture in the vial and record it for each vial. (Some will be\nlost on the splint.)\nd) With the a1 - i1 set, use the splint as the gel tester (leave it in). When the splint\ngets \"stuck\" (when you can no longer stir), pull the splint out. If it is stuck permanently,\nbreak it off at the surface of the gel. For this set a1 - i1 you will be recording the gel time\nas a function of composition. As above, re-determine the net mass in the vial and record.\ne) At the end of the lab period, add about 10 ml of MEK to the vials a-i, and 10 ml\nof water to the vials a1 - i1. Seal the caps. Let it stand until next week.\nf) In the next lab period, pour out the MEK + extractables from the vials a - i into\npre-weighed and labeled aluminum weighing dishes. Allow the MEK to evaporate in a\n\n________________________________________________________________________\n________________________________________________________________________\n________________________________________________________________________\n________________________________________________________________________\nhood until the next lab session. Then, weigh the vials to determine the mass of the absorbed\nMEK and gel in order to calculate the percent uptake of MEK (100 * Absorbed MEK /\nOriginal wt. of epoxy). Afterwards, place the vials containing the cross-linked epoxy and\nabsorbed MEK back into the hood and allow the MEK to evaporate until the next lab\nsession.\nTime\ng) Similarly pour out the water off samples in vials a1 - i1 and determine the percent\nuptake of water.\nh) During the third lab session, record the weight of the residue in the aluminum\ndishes. Also, record the final amount of material remaining in vials a - i. Attempt to close\nthe material balance on the samples exposed to MEK.\n3.\nEpoxy patch kit (slow crosslinking):\na) This consists of a larger tube containing 2.51 ounces epoxy and a smaller tube\ncontaining 0.81 ounces polyamine. By reasons of this weight ratio, it is believed that it\nrepresents the correct stoichiometric ratio., i.e., about 3.0. Dispense the amounts shown into\nthe scintillation vials j,j1 - m,m1 , the epoxy first, the polyamine next.\nTable: Recipes\nFor vial ......\nj,j1\nk,k1\nl,l1\nm,m1\nAdd g of\nepoxy.......\n5.0\n5.0\n5.0\n5.0\nAdd g of\npolyamine..\n0.6\n1.1\n1.6\n2.5\nb) Mix thoroughly with wooden splints, discard the splint after mixing, re-determine\nand record the total mass (some will be lost on the wooden splint). Set these aside for the\nnext lab period.\nc) In the next lab period, place the samples in vials j,j1 - m,m1 under 10 ml water,\nrepeatedly, and retrieve these in the following lab session.\n\nd) The objectives are the same as for the 5-minute epoxy.\nA2. RTV Silicone (made by GE) experiments:\nPart I: Self condensation from collapsible tube (GE-RTV-105): Acetic acid evolved.1.\nOn a glass microscope slide, pre-weighed, place a length of the fluid about 2\" long.\nDetermine the gross weight. Set aside in the hood for the next lab period.\n2.\nAlso dispense into two pre-weighed scintillation vials about 3 g of the fluid.\nAccurately record the weight. Set aside for the next lab period.\n3.\nIn the next lab period, re-weigh what is on the slide and report the % weight loss\n(presumably acetic acid). Re-weigh the vials to determine net contents of silicone matter.\nThen during this lab period add 10 ml of toluene to one of the vials and 10 ml of water to\nthe other.\n4.\nIn the lab period following that, pour out the toluene and by weighing the residue\ndetermine the % uptake of toluene = (100 X sorbed toluene / original wt. of silicone\nrubber). Likewise, pour out the water and determine the % water uptake.\nPart II: Catalytic condensation (GE RTV 11): Alcohol evolved.\n1.\nUsing two tared weighing dishes, weigh out about 10 g of RTV 11 into each (record\nexact weight), then add 0.050 g of DBTDL (dibutyl tin dilaurate) and mix.\n2.\nFirst dish: Leave at room temperature. Every 30 minutes probe with a tooth pick, and\ntry to locate the gel time within + 15 minutes (gel time is the instant when the tooth pick\ncomes out clean and mass no longer flows). Set aside for next lab period.\n3.\nSecond dish: Put into 60 C oven. Probe as above to determine gel time. Set aside for\nnext lab period.\n4.\nNext lab period (beginning of the lab period): Determine the weight loss (due to\nethanol evaporation) of each of the two rubber discs. Place each disc, rolled up in a tared\nscintillation vial. Add toluene to fill vial. Close vial.\n5.\nToward end of this second lab period, empty toluene from vial into a tared aluminum\nweighing dish. Determine uptake of toluene by the swollen rubber and report as the mass\nswell ratio. Here the object is to determine if the cross-linking achieved is the same for the\ndisc vulcanized at room temperature as the disc heated in the oven at 60 C.\nPart III: Two component addition crosslinking (GE RTV 615 A and 615 B):\n\n________________________________________________________________________\n________________________________________________________________________\n________________________________________________________________________\n1.\nMix the A component (vinyl methyl siloxane) with the B component (SiH +\nchloroplatinic acid) in the ratio 10 g A to 1 g B in two tared aluminum weighing\ndishes. Mix.\n2.\nFollow the procedure outlined in part II, with the same objective.\n3.\nIn addition, prepare a mixture of 20 g A to 2 g B, and pour this into a ring mold (as\nused for latex and PVC rings).\n4.\nNext lab period: Remove the ring and determine the reduced modulus at low\nelongation ratios and from this estimate the concentration of elastically effective\nchains.\nB. Reactions with Hypol:\n1.\nHypol with water:\na) Use 12-ounce plastic cups and the variable speed stirrer with propellor. Prepare\nthe following recipes:\nTable: Recipes\nComposition\nP\nQ\nR\nHypol\n20 g\n20 g\n20 g\nDistilled water*\n20 g\n40 g\n10 g\nb) After not more than one minute of stirrer mixing, remove the stirrer, place the\npropellor and shaft in a second 12-ounce plastic cup filled with water only to wash it\noff.\nc) Measure the initial depth of liquid (Hypol + water) before mixing, and the final\nlength of foam. Estimate the time required to reach this final height.\n2.\nYou will allow your foams to dry out by evaporation in a stream of air, and the\nfollowing week, you will observe and report (qualitatively) what they look like as\ncompared to the original foam.\nObservations and Calculations:\n1. Experiment A1, A2: Gel times, mass balances, mass swell ratio and percent solvent\nuptake.\n2. Experiment B: Heights, observations on effect of pH, qualitative observations on the\nfoam.\n3. For each system, determine the mechanical nature of the material (hard and glassy, soft,\nrubbery, etc.). Explain in your own words why you saw such a variation in these\n\ncrosslinked materials. (What is the range of Tg for each sample with respect to room\ntemperature? What is the relative cross-link density?)\nDiscussion:\n1.\nExperiment A: Discuss the effect of compositions and polymer type on gel times,\nswell ratio, solvent uptake, and mass balance. Be sure to give brief but clear\nexplanations based on the theory, or propose other possibilities.\n2.\nExperiment A2 (all parts): Tabulate swell ratio results for all RTV Silicone\nexperiments such that a comparison can be made. Be sure to include the relevant\ncuring conditions and specific differences between the systems in the table.\n3.\nExperiment A2 (Part III): Compare the mechanical behavior of radiation cross\nlinked silicone and the room temperature cured silicone in this experiment.\n4.\nExperiment B: Explain what happens and why? Compare the differences between\nthe samples in each group.\n5.\nOther discussion of sources of error, suggestions for improvements etc."
    }
  ]
}