{
  "course_name": "Popular Culture and Narrative: Use and Abuse of the Fairy Tale",
  "course_description": "No description found.",
  "topics": [
    "Humanities",
    "Literature",
    "Fiction",
    "International Literature",
    "Humanities",
    "Literature",
    "Fiction",
    "International Literature"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nCourse Overview\n\nThis course takes a deep look at a big subject. We ask where Fairy Tales come from, surveying the work of the famous Brothers Grimm, before moving on to historic fairy belief in traditional Celtic societies, centering on the folkloristic work of Robert Kirk in late seventeenth-century Scotland, and his links with the Royal Society. We look at the structure of Fairy Tales, and how they are conditioned by oral transmission, and inherited story-telling techniques.\n\nWe ask what Fairy Tales mean, considering a range of Freudian and Jungian interpretations, and the claims made for them as a key psychological tool.\n\nThen follow two case studies of the abuse of Fairy Tales, firstly by the Nazis in 1930s Germany for the purposes of political indoctrination, and, secondly, by Walt Disney in the famous series of animated movies starting with\nSnow White and the Seven Dwarfs\n. We consider the filmic techniques involved, and the charges of sexism and political conservatism frequently laid at Disney's door.\n\nWe end with a close study of modern literary Fairy Tales from writers including Hans Christian Andersen, Charles Dickens, L. Frank Baum, Margaret Atwood, and Angela Carter.\n\nThe goal of the class is to teach students how to approach cultural history in a broad-based multi-disciplinary manner, using a blend of folklore, history, psychology and film and textual studies. Students will gain a detailed appreciation of the links between oral tradition and print, and the means by which culture is transmitted down the centuries via a wide range of media.\n\nPrerequisites\n\nThere are no prerequisites for this course.\n\nGrading\n\nStudents will be graded on the following:\n\nTwo essays of 1500 words to be submitted on dates and topics specified, double-spaced, in Word format (with a .docx extension).\n\nAttendance at class is a requirement of the course. Any absence must be for good reason and notified to the instructor in advance.",
  "files": [
    {
      "category": "Resource",
      "title": "21L.430F15 A Note on References",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-430-popular-culture-and-narrative-use-and-abuse-of-the-fairy-tale-fall-2015/b623e7993754e90da9a94adffdd059ea_MIT21L_430F15_ANote.pdf",
      "content": "A note on references:\n\nWhen referring to a text, the author-date system is probably the simplest\nto use. References should enable any reader to trace the source of\nquotations or material cited in your essay. For example, material quoted\nfrom The Penguin Book of Vampire Stories might appear as (Ryan, 1995\n[or whatever the date of your edition happens to be], p.x; or pp.x-y if your\nreference covers more than one page). This particular style has the\nadvantage of not cluttering up your essay with internal references. At the\nend of the essay you give a brief bibliography of sources consulted to\nshow the full reference, as follows, say:\n\nRyan, A. (ed.), The Penguin Book of Vampire Stories (London:\nClaremont Books, 1995)\nStoker, B. Dracula, ed. by Nina Auerbach and David J. Skal (New York:\nNorton Critical Edition, 1997)\n\nIf you are referring to an electronic source, you should include the author,\ntitle and full URL. For example, in referring to, say, an article on the\nNobel Prize your reference should contain the name of the author, the\nname of the website, the full address of its home page or mains starting\npoint, followed by the month you accessed it, as follows:\n\nEspmark, K. (2001) \"The Nobel Prize in Literature\", Nobelprize.org,\nStockholm: The Nobel Foundation [online]. Available from\nhttp://nobelprize.org/literature/articles/espmark/index.html [accessed 17\nSeptember 2004]\n\nIf it is not possible to establish the authorship of a webpage the author\nshould be given as \"anon\".\n\nThis may seem an unnecessary complication, but it is a good habit to get\ninto, and as you advance in scholarship and consult more and more\nsources, it becomes increasingly necessary.\n\nThere are a number of different \"style\" books for doing scholarly\nreferences, including also the MLA, the Chicago Style Book, and the\nMHRA [Modern Humanities Research Association] which is the British\nstandard (and the one I'm most familiar with, therefore: you can\ndownload it free by Googling MHRA Style Guide).\n\n*\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.430 / CMS.920 Popular Culture and Narrative: Use and Abuse of the Fairy Tale\nFall 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "21L.430F15 Fairy Tale Essay 2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-430-popular-culture-and-narrative-use-and-abuse-of-the-fairy-tale-fall-2015/637f17b5695895c92c3b51014e48bbf7_MIT21L_430F15_FairyTale.pdf",
      "content": "21L.430: The Use and Abuse of the Fairy Tale\nProf. Donaldson\nTransformation from the Passive to the Powerful\nFairy tales have often been criticized for depicting females as weak and powerless.\nDisney's Snow White and the Seven Dwarves' main song, \"Someday My Prince Will Come\"\nimmediately conjures the image of a helpless protagonist waiting for a prince to save her from\nthe evil stepmother. However, Angela Carter, who insists her intention was \"to extract the latent\ncontent from the traditional stories and to use it as the beginnings of new stories,\" depicts\nfemales in a different light in her anthology, The Bloody Chamber (Simpson, 2006,\nhttp://www.theguardian.com/books/2006/jun/24/classics.angelacarter). Although Carter's female\nprotagonists are initially controlled by men and society, as in traditional fairy tales, Carter's\nwomen are able to break free by recognizing and rejecting this control and using their growing\nsexuality as an instrument of rebirth and empowerment. Through this portrayal, Carter seems to\nsuggest a similar empowerment of females in traditional fairy tales.\nIn both traditional and Carter's fairy tales, the female characters initially seem passive\nand submissive, dependant on and controlled by men as dictated by society. This control comes\nfrom men objectifying and treating females as possessions. In The Robber Bridegroom, the\nGrimm's version of Bluebeard, the girl's father promises to \"give her to [the right suitor]\" who\nturns out to be rich (Tatar, 1999, 151). The girl is given away for money and a life of comfort.\nBeauty, in Madame de Beaumont's Beauty and the Beast, is basically sold to the Beast; although\nshe proclaims that she is sacrificing herself out of love for her father, she is still brought to the\nBeast in exchange for a \"chest...filled with gold\" (Tatar, 1999, 36). Carter plays with this motif;\nThe Tiger's Bride (TTB) begins with the powerful line, \"My father lost me to The Beast at\n\ncards\" (Carter, 1979, 51). Not only is Beauty treated as an object to be passed back and forth, but\nalso an object that has no feelings or soul. In fact, Beauty explains that because she is female,\n\"men denied [her] rationality... [and] all the best religions in the world state categorically that\nnot beasts nor women were equipped with the flimsy, insubstantial things [as souls]\" (Carter,\n1979, 63). Society, more specifically a male dominated society, declares that women are no more\nthan beasts without reason or soul. Instead, they become objects of desire; they are something\nthat men have bought and use to satisfy themselves. In The Bloody Chamber (TBC), the girl\nadmits, \"I knew I had behaved exactly according to his desires; had he not bought me so that I\nshould do so?... I had played a game in which every move was governed by a destiny as\noppressive and omnipotent as himself, since that destiny was himself; and I had lost\" (Carter,\n1979, 34). Again, the motif of buying and selling women as objects is evident, and the girl makes\nmore explicit that she had been bought \"according to [her husband's] desires.\" She becomes an\nobject on which her husband can implement his desires (sexual or violent) with no thoughts or\nfeelings of her own. Her husband owns her completely and freely manipulates her fate. Her\npassivity is even echoed in the storytelling. Her actions are direct responses to her husband's\norders; he commands her to \"kneel! [so she] knelt before him\" (Carter, 1979, 36), tells her to\nbathe, and she does so, calls her to him, \"so [she] must go to ...where [her] husband waited\"\n(Carter, 1979, 38). Her actions are almost mechanical with no feelings, and the language echoes\nthe emotionless, obedient call and response.\nHowever, Carter's heroines, by realizing their own passivity and discovering the power\nof their own sexuality, break free of male as well as societal control. The girl in TBC begins to\nquestion her destiny, asking, \"'who can say what I deserve or no?' 'I've done nothing; but that\nmay be sufficient reason for condemning me.'...'I only did what he knew I would'\" (Carter, 1979,\n\n37-38). From the beginning, her husband expected her to fail, forcing this fate upon her;\nhowever, by questioning the right for the Marquis to control her and her fate, she empowers\nherself. This transition from passive to powerful is also reflected in the language. Triggered by\nher mother's arrival, the protagonist gains a mind of her own, \"The blade did not descent, the\nnecklace did not sever, my head did not roll... [The Marquis'] astonished indecision... let me\nspring upright and dart to the assistance of my lover\" (Carter, 1979, 39). The aggressive tone and\nrepetitive use of \"did not\"' emphasizes the contrast from the previous obedient voice. She finally\ncontests her husband's decided fate for her, even actively helping her lover to escape. Comparing\nherself to dolls that \"break free of their strings... and start to live for themselves,\" she also gains\na mind and life of her own and rejects the control of her husband (Carter, 1979, 39). After the\ndeath of her first husband, the protagonist is reborn as a new woman, choosing Jean-Yves as a\nlover, (interestingly, her choice of blind lover, results for a change, in the male being dependent\non the female) and making a new life for herself without the Marquis' corrupted wealth.\nBeauty in TTB also realizes that all her life she has been but a puppet to her father;\nhowever, through her choice to remain with her lover, the Beast, she escapes the confines of\nsociety. She realizes that she \"had been bought and sold, passed from hand to hand...had [she]\nnot been allotted only the same kind of imitative life amongst men that the doll-maker had given\n[the doll]?\" (Carter, 1979, 63). By comparing herself to her doll-maid, Beauty acknowledges\nsociety and men's objectification of her. The word-choice of \"allotted...life\" echoes the\nMarquis' control over his wife's fate in TBC as well as the doll-like, obedient state of the wife.\nSimilarly, Beauty is bound by the expectations and constraints of male dominated society.\nHowever, she empowers herself by rejecting that human society. When given the chance to\nreturn to her father, she chooses instead to remain with the Beast and sends the doll in her place,\n\n\"I will dress her in my clothes, wind her up, send her back to perform the part of my father's\ndaughter\" (Carter, 1979, 65). She realizes that she has been playing the role of a dutiful daughter\njust like a mechanical doll with no feelings of her own or choice, and decides to escape that life.\nChoosing the Beast, she sheds her clothes to stand naked before him in an intimate and sexual\nmating ceremony, even shedding her human skin to be reborn in a wilder, more bestial form. Her\nchoice frees her; as she is turning into a beast, \"tiles came crashing down... the foundations of\nthe house... It will fall, everything will disintegrate\" (Carter, 1979, 67). The house represents\norder and civilization, namely society, which have been binding and trapping her with all the\nduties of being a woman, her father's daughter. As she sheds \"skin after successive skin, all the\nskins of a life in the world\" just as the walls of the house are shed, Beauty is freed (Carter, 1979,\n67).\nAlthough the girl in The Company of Wolves (TCW) is not explicitly possessed or\ncontrolled by men, she is similarly influenced by society. When the girl begins to seduce the\nwolf, which obedient young girls are not supposed to do, the grandmother's \"old bones under the\nbed set up a terrible clattering but [the girl] did not pay them any heed\" (Carter, 1979, 118). The\nold grandmother, who is described as a \"pious old woman\" and has \"her Bible for company,\"\nrepresents the rules and trappings of society (Carter, 1979, 115). Her bones, and through them,\nsociety, protests the girl's wild, sexual behavior, but she ignores the rules. Instead, like the\nprotagonists in TBC and TTB, the girl does not become a helpless girl before danger, but a\nseducer and tamer of that danger. Just as Beauty shed her outer layers in TTB, so does the girl\nshed her clothes. Carter uses the motif of shedding off one's outer layers to represent both a\nsexual discovery of self as well as defiance and discarding of societal control. The girl takes\ncontrol, even stripping the wolf, \"the girl burst out laughing; she knew she was nobody's meat...\n\nshe ripped off his shirt for him and flung it into the fire, in the fiery wake of her own discarded\nclothing\" (Carter, 1979, 118). She knows she is no one's possession, no one's \"meat,\" and\nseduces the wolf. Carter even mentions that she \"has just started her woman's bleeding,\" which\nfurther emphasizes the girl's transition into womanhood and discovery of the power of her\nsexuality (Carter, 1979, 113). In the end, the girl tames the wolf, picking out his lice, and even\n\"sweet and sound she sleeps...between the paws of the tender wolf\" (Carter, 1979, 118). Carter\ngoes further to challenge us, the reader, to question society. From the beginning of the story,\nwerewolves are portrayed as violent, feral beasts who \"tore off [a boy's] left foot\" (Carter, 1979,\n112). However, the protagonist's actions reveal that wolves can be tamed, even considered\n\"tender,\" a stark contrast to the view of society.\nUltimately, Carter invites us to view the age-old fairy tales in a new light, and the\nhelpless maidens no longer seem so helpless. While their fathers and husbands may control them\nand treat them like possessions, the female protagonists' choices in many ways free them.\nBeauty, in Madame de Beaumont's version, chooses to return to the Beast instead of staying with\nher father in society. In control at the end, she even commands the beast to \"live and become my\nhusband\" (Tatar, 1999, 41). Instead of the traditional father-giving-daughter-to-husband, Beauty\ntakes control of her own destiny by giving herself away. Similarly, the protagonists in variations\nof the Bluebeard tale cunningly escape the control of their evil husband and bring about his death\n(by stalling for time or disguising themselves as a bird). A closer look at many of the fairy tales\nreveal that although women may not have played an explicit role in defeating the antagonist, they\nare continuously working to change their fate and survive.\n\nCarter, A. The Bloody Chamber (New York: Penguin Group, 1979)\nSimpson, H. (2006), \"Femme fatale,\" The Guardian, Available from\nhttp://www.theguardian.com/books/2006/jun/24/classics.angelacarter [accessed 16 March\n2014]\nTartar, M. (ed.), The Classic Fairy Tales (New York: Norton Critical Edition, 1999)\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.430 / CMS.920 Popular Culture and Narrative: Use and Abuse of the Fairy Tale\nFall 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "21L.430F15 Writing Discursive Essays",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-430-popular-culture-and-narrative-use-and-abuse-of-the-fairy-tale-fall-2015/e7deb13325d3818f03046a33898e987d_MIT21L_430F15_Writing.pdf",
      "content": "Writing discursive essays\nStage One: have a good look at the target, i.e. study the question carefully and reflect on how it might unpack--\nwhat are the implications? What are the senses in which the question might be understood? Above all, what sort\nof information are you going to need as evidence?\nStage Two: armed with pens, pencils, erasers, highlighters, sticky labels and plenty notepaper and/or hard disc\nspace, we approach the text concerned for the first (of hopefully more than one) careful reading. What are the\nbits that seem to bear most closely upon/shed most light on/deal most fully with the question? We're going to\nneed to know this stuff, where it's at and how to get at it. So, we underline/highlight, we pencil marginal notes\ninto our text, we put in markers taking us quickly to the key sections, and our fingers fly rapidly over keyboards as\nwe begin to compile our notes (containing references to the bits of the text we mean to speak about so we know\nwhat they say and where they're at; and any and all ideas/insights/comments of our own [always enclosed in\nsquare brackets so we can be sure when we return to them later that the words are our own]\nStage Three: we begin to compile the essay. This is built up in a series of layers. First we rough out an outline\nargument in note form. Bearing in mind that we're going to need some kind of beginning, middle and end, we\ndecide on the order of our selected points (you can adjust these as you go by the simple expedient of re-\nnumbering) them, so we can see the stages through which our completed discussion will eventually go and we can\nattend to the shape and structure of our argument in detail before we begin to commit it to paper, or screen.\nHeed will have to be paid here to the amount of space at our disposal. Do we have room for everything we might\nwant, ideally, to say? Or are we going to have to select? In which case we will need to prioritise our points. Which\none/ones are the most important? They have got to stay in, obviously. How many of these do you need to make\nyour point adequately? What can you do without? Can a number of smaller points be included in a larger more\ngeneral one, for example?\nThe next step is to expand each of our essential points into a rough paragraph (or however long it may take,\ndepending on the importance of the point and the scale of the argument--i.e. the space at your disposal), so our\noriginal skeleton of argument is fleshed out, point by point, into a sequence somewhat resembling an essay but, as\nyet, probably, in pretty rough-hewn prose.\nThen we put it all together in a clean, consecutive draft.\nThen we sleep on it. One of the best things you can do with a passage of prose is leave it alone for several hours.\nIf you have allowed yourself sufficient time to do this, you may be surprised how much seems to fall into place\nand, almost, to correct itself, when you come back to it.\nStage Four: refining, polishing, working up to a final completed draft--with particular attention to expression:\ndon't try to be too fancy: clarity and economy are the things to aim for. At this stage you will also have to deal\nwith issues of length, and time may have to be set aside to sweating the piece down to the appropriate size: pieces\nof writing have a tendency to end up about 50% too long at early draught stage. Also you will need to ensure at\nthis stage that your piece is in the correct format for its intended audience. Double spacing, and footnotes rather\nthan endnotes (or references in brackets within the text if you like) are the preferred style options here, and\nwhether the recipient will accept electronic submission or prefers hard copy. Here in 21L.430 we accept either\nformat, although many of you will prefer to submit electronically.\nAll of this, as you will appreciate, takes time. There's an old writers' chestnut that 90% of a writing task takes up\n90% of the available time; the last 10% takes an additional 90%.....\n\n*\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.430 / CMS.920 Popular Culture and Narrative: Use and Abuse of the Fairy Tale\nFall 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "21L.430F15 'Ossian', James Macpherson, and the antiquity of oral tradition",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-430-popular-culture-and-narrative-use-and-abuse-of-the-fairy-tale-fall-2015/b215dc9160edc9f45678da09d9abe706_MIT21L_430F15_Ossian.pdf",
      "content": "The following chapter from my book The Highland Pipe and Scottish\nSociety (East Linton, 2000; 2nd edn., Edinr., 2008; reprinted 2013) tells\nthe story of James Macpherson's epoch-making mid-eighteenth-century\nedition of the traditional poems associated with the legendary bard\nOssian. The text was swiftly translated into most of the major European\nlanguages and enjoyed an immense influence. Macpherson's extensive\neditorial apparatus contains the earliest and most influential reasoned\ndefence of oral tradition as a mechanism capable of carring material\ncoherently over lengthy periods of time. The earlier parts of the chapter\nprovide the context; towards the end we consider Macpherson's detailed\ndefence of the coherence of tradition.\n\nCHAPTER ONE\n\n'Their songs are of other worlds': Ossian and the Macpherson Paradigm\n\nAs the 1750s drew to a close two young Highlanders were working to present major\nCeltic art forms to a wider British, and ultimately world, audience. James\nMacpherson's Works of Ossian and Joseph MacDonald's Compleat Theory of the\nScots Highland Bagpipe were the two great projects of the post-Culloden generation.\nThe first took Europe by storm, was translated into many different languages and\nbrought its author wealth and fame. The second was brought to an abrupt halt by the\ndeath in Calcutta at the age of twenty three of its brilliant young creator. It was not\npublished until 1803, and then in an edition so limited and corrupt that it was\neffectively lost for nearly a century thereafter. A reliable text only became available\nin 1994, nearly two hundred and fifty years after its first composition. Since all\nHighland art was subsequently, and wrongly, assumed by those outside the\nGaidhealtachd to have sprung from the same cultural matrix as the poems of Ossian,\nthe work of James Macpherson is fundamental to an understanding of how the pipe\nand its music were to be received outside the performer community from the 1760s\nonwards.\n\nTowards the end of September 1759 on the bowling green of Moffat, a small spa\ntown in the Scottish Borders, a young man presented himself with a letter of\nintroduction to John Home, a distinguished Scottish man of letters whose tragedy,\n'Douglas', had lately been the toast of Edinburgh. Home was affable and well-\nconnected, secretary and confidant to the great Earl of Bute and a channel, therefore,\nto impressive quantities of patronage. He had served as a volunteer with the\ngovernment forces during the '45 and made a daring escape from the castle of Doune\nafter his capture at the battle of Falkirk. He was fascinated by the differences between\nHighland and Lowland culture and was working, rather fitfully, on an ambitious long-\nterm project--a history of the Rising which would relate politics to deeper social and\n\ncultural forces.1 On his research forays into the Highlands he had listened enthralled\nto translations of epic oral verses recited by the common people, so that the tall, red-\nheaded, highly-educated Highlandman who stood before him was a real discovery.\nHis name was James Macpherson, and he was 22 years old.\nHome's questions met with a swift response. Yes indeed, Macpherson knew of\n\n1 After many delays this was eventually published as The History of the Rebellion in the year 1745\n(Lond., 1802); see especially pp. v-vi, 1-3. For its contemporary reception, see [James Browne], A\nCritical Examination of Dr. Macculloch's Work on the Highlands and Western Isles of Scotland\n(Edinr., 1825), pp. 11-14.\n\n#6 such poetry. Better still, he could read Gaelic (by no means a common\naccomplishment in the English-dominated educational milieu of the time) and had\ntranscripts of Ossianic material actually in his possession.\n\nWhen Mr Home desired to see them, Mr Macpherson asked if he\nunderstood the Gaelic? 'Not one word'. 'Then, how can I show you\nthem'? 'Very easily', said Mr Home; 'translate one of the poems which\nyou think a good one, and I imagine that I shall be able to form some\nopinion of the genius and character of the Gaelic poetry'. Mr Macpherson\ndeclined the task, saying, that his translation would give a very imperfect\nidea of the original. Mr Home, with some difficulty, persuaded him to try,\nand in a day or two he brought him the poem on the death of Oscar...2\n\nMacpherson's caution was intelligible. He was probably aware of what had\nhappened to the last volume of Gaelic poems to be published in Scotland, Alasdair\nMacMhaighstir Alasdair's Ais-eiridh na Sean Chanoin Albannaich (The Resurrection\nof the Ancient Scottish Tongue), burned by the common hangman at the cross of\nEdinburgh in 1752 on account of its fiercely Jacobite sentiments.3 His own were\nmore carefully guarded. Although too young to have taken part in the Rising, he had\nbeen well placed to witness its consequences.\nHe was a gentleman of the clan Macpherson, a first cousin of the chief, born\ninto the 'tacksman' or middle class of Highland society at Invertromie near\nKingussie on 27 October 1736. Brought up within sight of Ruthven barracks,\nunder a punitive military regime, he had gained first hand experience of those\nparts of the British constitution which were not consecrated to liberty and\nhuman rights. For years after the '45, parties of soldiers scoured the country\nhunting for the chief, Cluny Macpherson, who had rendered himself particularly\nodious by defecting to the Jacobite side after promising to support the\ngovernment. As late as 1755 the former local commander, James Wolfe (later\nto become a major general, and victor of Quebec) was advising that there should\nbe 'a couple of hundred men in the neighbourhood with orders to massacre the\nwhole clan if they show the least symptom of rebellion.'4\n\nFor those living beyond the Highland Line the '45 was the most momentous event\nof a momentous century, a desperate affair, described by Alasdair MacMhaighstir\nAlasdair, who had forsaken his little school in Ardnamurchan to fight as a captain in\nthe Jacobite Clanranald regiment, as 'ane enterprise the\n\n2 Henry Mackenzie, Report of the Committee of the Highland Society of Scotland, appointed to\ninquire into the nature and authenticity of the poems of Ossian (Edinr., 1805), Appendix 1V, pp.68-9.\n3 For an outline of Alasdair MacMhaighstir Alasdair's life and work see John Lorne Campbell, ed.,\nHighland Songs of the Forty-Five (Edinr., 1984, first published 1933), pp.33-41.\n4 Fiona J. Stafford, The Sublime Savage: A Study of James Macpherson and the Poems of Ossian\n(Edinr., 1988), pp.19, 23 n 54.\n\n#7 most hazardous and resolute that the history of any person or country can\naford.'5 It had seen Charles Edward Stuart land in Scotland with a handful of\ncompanions, seize Edinburgh at the head of a largely Highland army, rout\nGovernment forces at Prestonpans and Falkirk, and encounter shattering defeat in turn\nat the battle of Culloden. It is one of the best known episodes in Scottish history, the\nsubject of countless books and paintings, and of the epic Jacobite song-cycle which\ncelebrated the triumphs and disasters of the campaign and the 'flight through the\nheather' when the Prince, with a price of £30,000 on his head, was pursued through\nthe western Highlands and the Isles in the summer of 1746.6\n\nIt was one of the most remarkable events in recent European history, and there\nwere various attempts during the following two centuries to establish a perspective\nfrom which it might properly be viewed. Some saw it in dynastic, some in ethnic\nterms; some as a clash between opposing constitutional theories, some as a struggle\nbetween rival systems of social organisation--the triumph of a 'modern' over a\n'traditional' type of society.\nBut Highland historians spoke with a single voice: to them the '45 was an\nunparalleled calamity, not just for the Jacobite clans who had supported the Prince in\n'Bliadhna Thearlaich' (the Year of Chairlie)--for the '45 was a civil war, with people\nfrom the same district, island, family even, involved on opposite sides--but for the\nwhole of the Gaidhealtachd. 'All this country,' wrote the victorious Government\ncommander, William Augustus, Duke of Cumberland, 'are almost to a man Jacobites;\nand mild measures will not do', and he launched a vigorous campaign of reprisals to\ndetermine what a smack of officially-sanctioned terrorism might do to adjust the\npolitical inclinations of the natives. The distinctive legal framework which\nunderpinned the social organisation of the Highlands, linking commons, tacksmen and\nlairds in bonds of mutual obligation through a land-tenure system involving liability\nfor military service, was systematically dismantled.7 Execution and exile weakened\nthe leadership elite preparing the way for a new generation of Highland lairds more\nready to accommodate itself to 'British' norms. Disarming Acts of unprecedented\nseverity were passed.8 These were aimed at reducing the military potential of the\nGaidhealtachd not only by disarming certain sections of the population, but also by\nprohibiting a\n\n5 'Journall and Memoirs of P..... C...... Expedition into Scotland Etc. 1745-6. By a Highland Officer\nin his Army', in George Lockhart of Carnwath, The Lockhart Papers: containing Memoirs and\nCommentaries upon the Affairs of Scotland from 1702 to 1715 (2 vols., Lond., 1817), ii, 479-510,\n(479).\n6 See William Donaldson, The Jacobite Song: Political Myth and National Identity (Aberd., 1988),\npassim.\n7 Bruce Lenman, The Jacobite Risings in Britain 1689-1746 (Lond., 1980), pp. 277-280; for an\naccount from a less unionist perspective see Frank McLynn, The Jacobites (Lond., 1985); see also A.\nJ. Youngson, After the Forty-Five The Economic Impact on the Scottish Highlands (Edinr, 1973),\npp.12-13.\n8 19. Geo 2. c.39; 20.Geo.2.c.51 and 21 Geo.2.c.34.\n\n#8 distinctive article of clothing, the plaid, which was understood to permit that\nmobility and endurance which made Highland armies so formidable. Any member of\nthe common people, man or boy, found wearing plaid, philibeg, trews, shoulder-belts,\nor any item of clothing whatsoever composed of tartan, could expect in theory to face\nsix months imprisonment for a first offence, and transportation for a second. But the\nfirst Act was so badly drawn that Government had to have two further attempts at it,\npushing back the date of eventual implementation to 25 December 1748. There seem\nto have been relatively few prosecutions under its terms.9\nIt is frequently claimed that the pipes, too, were proscribed, but there is no mention\nof bagpipes in the Disarming Acts, nor contemporary evidence that they were\nforbidden or discouraged.10\nThe dismantling of the traditional hierarchy of social control within the Highlands\nwas completed by the forfeiture of 41 estates. Most were sold to pay creditors, but 13\nwere annexed to the Crown, and their rents administered by commissioners 'for the\nPurposes of civilizing the Inhabitants upon the said Estates, and other Parts of the\nHighlands and Islands of Scotland, and promoting amongst them the Protestant\nReligion, good Government, Industry and Manufactures, and the Principles of Duty\nand Loyalty to his Majesty, his Heirs and Successors...'11 The Gaelic language came\nunder sustained attack. It was viewed as a prime source of disaffection, because it\nencouraged the people to regard themselves as a race apart and restricted interaction\nwith their neighbours. Steps were taken, therefore, to increase provision of schools in\nwhich English alone would be the medium of instruction.\nAll the misfortunes which overtook the Gaidhealtachd during the following two\ncenturies: the great diaspora known as 'The Clearances'; the inexorable shrinking of\nthe language-base; the alienation of the leadership elite; land agitation and social\nstrife; the threatened extinction of a distinctively Celtic culture beyond the Highland\nline even, were ultimately traced to the '4512.\nBut the '45 did not just change the Highlands; it transformed the popular culture of\nLowland Scotland as well. The adoption as national icons of various elements of\nHighland costume, music and poetry led to a progressive Celticisa\n\n9 John Telfer Dunbar, The Costume of Scotland (Lond., 1981), pp.50-54. The writer Mrs. Ann Grant\nattended a service in the Rev.Patrick MacDonald's church at Kilmore near Oban in 1773. It is clear\nfrom her description that the kirk was ablaze with tartan: Letters from the Mountains; being the real\nCorrespondence of a Lady, between the years 1773 and 1803 (3 vols., Lond., 1806), i, 56-58. For a\ndetailed recent discussion of these points see John G. Gibson, Traditional Gaelic Bagpiping 1745-1945\n(Edinr., 1998), pp.25-8, 36-63.\n10 See Gibson, pp.28-35, 51-6.\n11 Youngson, p.27.\n12 By the same token a Stuart restoration was explicitely linked with a revival in Gaelic culture: see\nWilliam Matheson, ed., The Songs of John MacCodrum (Edinr., 1938), 'Introduction' p.xxix.\n\n#9 tion of the public symbolism of Scotland which transformed the national identity\nin the generation following the Rising. Robert Burns remarked, 'When political\ncombustion ceases to be the object of Princes & Patriots, it then...becomes the lawful\nprey of Historians & Poets',13 and the latter were given exciting scope by the\nextraordinary nature of what had just taken place. John Home captured something of\nthis in his History of the Rebellion:\nIn the year one thousand seven hundred and forty-five, Charles Edward\nStuart, the Pretender's eldest son, calling himself the Prince of Wales,\nlanded with seven persons in a remote part of the Highlands of Scotland.\nA few days after his arrival, some Highlanders (not a very considerable\nnumber) joined him, and descending from their mountains, undisciplined,\nand ill-armed, without cavalry, without artillery, without one place of\nstrength in their possession, attempted to dethrone the king, and subvert\nthe government of Britain. The conclusion of this enterprise was such as\nmost people both at home and abroad expected; but the progress of the\nrebels was what nobody expected; for they defeated more than once the\nking's troops; they over-ran one of the united kingdoms, and marched so\nfar into the other, that the capital trembled at their approach, and during\nthe tide of fortune, which had its ebbs and flows, there were moments\nwhen nothing seemed impossible; and, to say the truth, it was not easy to\nforecast, or imagine, anything more unlikely than what had already\nhappened.14\n\nThe fame of Charles Edward and his Highland clans, made them at once\n'l'admiration et la curiosite de l'Europe'.15 He had emerged from the mists\naccompanied by a living museum of ancient manners, dress and arts, the last remnants\n(or so it was thought) of the once mighty Celtic civilisation which had dominated\nEurope, and given instruction through its Bardic and Druidical schools to Gaul and all\nthe West. This was no footnote in a dusty classical text by Livy or Tacitus, but an\nactual survival from high antiquity, and as such immediately assimilable to the\nfashionable theories of primitive culture which shaped contemporary thinking about\nman and society. The European intelligentsia was fascinated. How could such\npeople, such a society, be? There was a clever young Highlander called James\nMacpherson very ready to tell them.\nMacpherson had studied at both of Aberdeen's university colleges, King's and\nMarischal, which attracted many students from the Highlands, because of the\nshortness of the academic year and the city's easy accessibility by sea. In the 1750s\nthe Aberdeen colleges were at the height of their fame, with a teaching staff of\ninternational reputation in philosophy, aesthetics, classical studies and rhetoric:\n\n13 J. De Lancey Ferguson and G. Ross Roy, eds., The Letters of Robert Burns (2 vols., Oxford, 1985),\nii, 82.\n14 Home, pp.1-2.\n15 Andrew Lang, Pickle the Spy: or The Incognito of Prince Charles (Lond., 1897), p.7.\n\n#10 figures like Thomas Reid, founder of the Scottish 'Common Sense' school of\nphilosophy, who was Macpherson's tutor; George Campbell, whose Philosophy of\nRhetoric dominated its field for upwards of a century; the writer James Beattie\n(although he came a little after Macpherson's time) whose poem 'The Minstrel' was\nto become one of the founding documents of the Romantic revival in Britain; above\nall, perhaps, Thomas Blackwell, the most distinguished Scottish classicist of his\nperiod, principal of Marischal College, teacher of Macpherson's teachers, and a man\nof immense influence.\nBlackwell was not a classicist in the narrow linguistic sense, or a writer in the\ndusty academic mode. His major works, An Enquiry into the Life and Writings of\nHomer (Lond. 1735) and Letters on Mythology (Lond. 1748) show him to have been\nat once a folklorist, a student of myth and a pioneering cultural anthropologist.16 He\noffered deep explanations of the nature of mythology, revealing the theories about the\nworld that lay behind the screen of metaphor, and he was author of the definitive\nScottish statement on the links between epic poetry and the social organisation of\nearly societies.\nHis approach was marked by a sophisticated cultural determinism, which suggested\nthat a combination of the right kind of society, geography and climate would produce\nepic poetry. An additional spark of genius would bring forth a Homer. Blackwell\npictured early classical Greece as a turbulent military society marked by a heroic\nsimplicity of manners, and a proliferation of small aristocratic courts. It was uneven\nin its cultural development because centres of high civilisation were mixed with\nsurrounding pools of relative barbarism. It was mountainous in its geography and\ndivided up by rivers and straths, fostering a variety of local cultures, each with its own\nidentity, and it sustained a powerful bardic class drawing inspiration from the\ntraditions of the common people.17 The whole bore an uncanny resemblance to the\nScottish Highlands of James Macpherson's youth.\nOne idea would have struck Macpherson with particular force: the insistence on a\nkind of noble barbarism as the essential precondition of great epic poetry. Blackwell\nwrote:\nI am in the case of a noble Historian, [Herodotus] who having related the\nconstant Superiority his Greeks had over the Inhabitants of the Assyrian\nVales, concludes 'That it has not been given by the Gods, to one and the\nsame Country, to produce rich Crops and warlike Men:' Neither indeed\ndoes it seem to be given to one and the same Kingdom, to be thoroughly\ncivilized, and afford proper Subjects for Poetry...It is thus that a People's\nFelicity clips the Wings of their Verse...18\n\n16 The latter text was begun by another hand; Blackwell completed letters 7 and 8, and wrote the\nremainder of the sequence through to no.19.\n17 Blackwell, Enquiry, pp. 5, 11-12, 15-25, 104-5, 119-28.\n18 Blackwell, pp.26, 28.\n\n#11\nBlackwell's insistence upon the creative importance of the audience for the Homeric\npoems, 'He had not the Inhabitants of a great luxurious City to entertain...but the\nmartial Race of a wide and free Country, who listen willingly to the Prowess of their\nAncestors, and Atchievements of their Kings' would have increased Macpherson's\ngrowing realisation that he was a privileged witness to a living heroic culture.19\nMacpherson went back to Ruthven as a schoolmaster and began to collect traditional\nGaelic poetry. But he was restless and hungry for recognition, and soon his own\noriginal verse, in English, was finding outlet in the magazines of the day. His first\nextended work, a poem in six cantos entitled The Highlander published in 1758,\nshowed epic Celtic warriors repelling a Scandinavian invasion, a foretaste, perhaps of\nwhat was to come.\nThe young man who stood before John Home that autumn day in Moffat\nrepresented several strands of cultural possibility: he had personal contact with a\nheroic 'primitive' culture, potential access to an international literary market hungry\nfor information about the Jacobite clans and the society from which they had sprung;\nand a powerful theory of culture capable of linking ancient and modern, the oral and\nthe literate, and Celtic with Classical antiquity in a common epic mould.\nA few days later Macpherson produced examples, in a startlingly unconventional\nEnglish prose, of what he claimed was the work of a mighty Caledonian bard called\nOssian who had flourished in the third century A.D. Home was stunned. Of Ossian\nhimself he had probably heard, but nothing in his experience could have prepared him\nfor the fresh, original and delicate fragments of prose poetry he held in his hand. This\nwas a discovery of major proportions, a line of noble ancient poetry preserved for\ncenturies within the fastnesses of the Scottish Highlands unknown to the larger world,\nwhich, if it were genuine, might have incalculable implications for the balance of\ncultural power within the United Kingdom. Anxiously he consulted his friend Adam\nFerguson, professor of Natural Philosophy at the University of Edinburgh and a\nGaelic-speaking Highlander from Perthshire, to whom Home owed most of his\nknowledge about the language and culture of the Gael. Ferguson confirmed. Yes, he\nremembered hearing such verses as a child, and there was, he thought, a lot of\nmaterial like this probably still in existence. Copies of Macpherson's fragments\ncirculated amongst Home's friends in Edinburgh's prestigious Select Society and\n'were...received with the utmost enthusiasm and delight. Every one read them, and\nevery one admired them; and, altogether, a sensation was created in the world of\nletters, which it had known but on few occasions before.'20 In an atmosphere of\nfeverish excitement and expectancy Macpherson was summoned to the capital to meet\n\n19 Blackwell, p.119. See also James Macpherson, An Introduction to the History of Great Britain and\nIreland (Lond., 1771), pp. 188-192.\n20 Robert Chambers, ed., Biographical Dictionary of Eminent Scotsmen (9 vols., Glasg., 1853-55), vi,\n542.\n\n#12 the great arbiter of contemporary taste, Dr. Hugh Blair, minister of the High\nKirk of St. Giles and 'literary accoucheur of Scotland.'21\nBlair was in his early forties and at the height of an outstandingly successful\necclesiastical career. He was as close as one could get in Presbyterian Scotland to\nbeing a 'society' preacher, numbering amongst his hearers the Lords of Session, and\nthe other great officers of law and state, the magistrates of Edinburgh, and most of the\nrank and fashion of the city. It was the most elegant congregation in Scotland, and he\nregaled it with sermons of unimpeachably chaste composition, containing, as one\nrather hostile later commentator remarked, 'one grain of the gospel dissolved into a\nlarge cooling-draught of moral disquisition.'22\nBlair was dignified and sedate, a fastidious, dressy, decent man, whose brains were\npowerful enough to be respectable but not enough to cause alarm. His fashionable\nlectures on literature and criticism were gratifyingly well attended, and he was soon to\nbe appointed to the chair of Rhetoric and Belles Lettres at Edinburgh University, the\nfirst of its kind in Britain. He was the touchstone of good taste in everything from\ntragedies to teapots and his instinct was held to be infallible; a classically safe pair of\nhands, guaranteed to ruffle no feathers and leave no hostages to fortune.\nIndeed Blair was later assumed to have been the controlling intelligence behind the\nwhole venture, but the reality was rather different. Since he had no Gaelic and little\npersonal knowledge of Highland culture he was almost entirely dependent on\nMacpherson for access to the text, and he was to prove little match for Macpherson's\npowerful and devious intellect.23 Nevertheless he unhesitatingly assumed the role of\nliterary co-ordinator-in-chief, and wrote a preface for Fragments of Ancient Poetry,\ncollected in the Highlands of Scotland, and translated from the Galic or Erse\nLanguage which was published in June 1760 and was greeted with high excitement in\nthe capital.24 As well it might be, for it was\n\n21 Henry Grey Graham, Scottish Men of Letters in the Eighteenth. Century (Lond., 1901), p.126.\n22 Eminent Scotsmen, i, 255.\n23 Mackenzie, Report., pp.60-61. That Macpherson was responsible for the intellectual approach is\nevident from his later prefaces and essays; Blair was forced to rely upon a network of Highland\ncorrespondents, chiefly ministers and lairds, such as John Macpherson of Sleat and Donald Macqueen\nof Kilmuir, who simply tended to confirm in a general kind of way what James Macpherson was\nsaying: see Hugh Blair, A Critical Dissertation on the Poems of Ossian, the Son of Fingal (2nd edn.,\nLond., 1765), pp.140-8. Blair's Whiggish and unionist circle must also have been uncomfortable with\nthe explicitely nationalist thrust of Macpherson's work. For example, see Adam Ferguson's letter to\nSir John Sinclair of Ulbster when the latter was compiling the Statistical Account of Scotland, urging\nhim to avoid using the word 'Scotland' and substitute instead 'certain northern counties or parishes of\nGreat Britain', quoted in Rev. John Sinclair, Memoirs of the Life and Works of the Late Right\nHonourable Sir John Sinclair, Bart (2 vols., Edinr., 1837), ii, 34-5.\n24 Fiona Stafford, 'Introduction: The Ossianic Poems of James Macpherson', in Howard Gaskill, ed.,\nThe Poems of Ossian and Related Works (Edinr., 1996), pp.v-xxi, (xii).\n\n#13 revealed that the Fragments were merely part of a much larger work. A lost\nepic poem, nearly two thousand years old existed somewhere in the Highlands, and it\nmight be possible to recover it.25\nMacpherson was furnished with money and letters of introduction and in August\n1760 despatched to the Highlands on the greatest literary big-game hunt of modern\ntimes. Several months later he returned laden with transcripts and proceeded to\nassemble the text of Fingal, An Ancient Epic Poem. In Six Books: together with\nSeveral Other Poems composed by Ossian, the Son of Fingal. This was published in\nLondon in December 1761, to be followed in March 1763 by Temora, an Ancient\nEpic Poem in Eight Books: together with Several Other Poems composed by Ossian,\nthe Son of Fingal. Both were issued together in 1765 as The Works of Ossian.26\nThese presented heroic episodes from the wars of the ancient Caledonians, a\nlegendary race of giant warriors led by Fingal, King of Morven, whose deeds were\ncommemorated by his son the blind minstrel Ossian, last of his race. Contemporaries\nwere excited by the boldness and novelty of the diction, which deliberately avoided\nconventional verse forms in favour of an elevated, loosely-structured poetic prose\nwhich emphasised the utter remoteness of the subject matter from a present widely\nperceived as decadent, whilst at the same time subtly reinforcing a characteristic\nambience of cloudy melancholy and loss:\nWhence is the stream of years? Whither do they roll along? Where have\nthey hid, in mist, their many-coloured sides? I look into the times of old,\nbut they seem dim to Ossian's eyes, like reflected moon-beams on a\ndistant lake...As flies the unconstant sun, over Larmon's grassy hill; so\npass the tales of old, along my soul, by night. When bards are removed to\ntheir place; when harps are hung in Selma's hall; then comes a voice to\nOssian, and awakes his soul. It is the voice of years that are gone: they\nroll before me, with all their deeds. I seize the tales, as they pass, and\npour them forth in song. Nor a troubled stream is the song of the king, it\nis like the rising of music from Lutha of the strings.--Lutha of many\nstrings, not silent are thy streamy rocks, when the white hands of Malvina\nmove upon the harp.--Light of the shadowy thoughts, that fly across my\nsoul, daughter of Toscar of helmets, wilt thou not hear the song! We call\nback, maid of Lutha, the years that have rolled away.27\n\nThe publication of Ossian was a major event. It was translated into most of the\nEuropean languages and hailed with delight by figures such as Herder (who\n\n25 The introduction to Fragments, is reproduced in Gaskill, Poems of Ossian, pp. 5-6.\n26 Gaskill, Poems of Ossian, p. xxiii.\n27 Ossian represented an extraordinary stylistic coup: looked at merely in terms of English language\nsources, there are obvious traces of the Authorised Version and Milton, and James Thomson's great\nnature poem, 'The Seasons', with perhaps a little smack of gentle parody directed against John Home\nhimself, whose epic blank verse had been extravagantly admired. The passages quoted are from\nTemora, pp.203, 211.\n\n#14 calmly read 'Fingal' in the middle of a shipwreck)28, Goethe, Schubert,\nHolderlin, Schiller, Madame de Stael, Chateaubriand, and Lamartine; Napoleon\ncarried it with him on his campaigns in an Italian translation, and it became the\ninspiration for countless other poems and novels, operas, paintings and plays.29\nBut in Britain, the response was sharply divided. There was bitter controversy\nabout the poems' authenticity. Scottish critics, led by Hugh Blair, asserted that they\nwere genuine, while English critics, led by Dr. Samuel Johnson, denounced them as\nforgeries. Johnson denied that non-literate communities could transmit cultural\nproducts coherently over anything like the time-span required and rejected with scorn\nthe notion that a people such as the Scotch Highlanders could at any period have\ncreated works of such refinement and moral cultivation. Macpherson's apparent\nreluctance to produce the 'originals' for inspection, led the hostile critics--though few\nof them were acquainted with the Gaelic language or the habits of oral communities--\nto conclude that he had made it all up himself.30\nBut the fury of the English intelligentsia was largely directed against a position that\nwas not, in fact, being defended. It appears that Macpherson's work really was based\non manuscript and traditional oral sources, however distantly.31 He had altered names\nand locations, interpolated huge passages of his own, expressed himself in an English\nwhose sumptuous literary patina, and unflaggingly elegiac tone departed significantly\nfrom the texts he was ostensibly translating; but such practices were not enormously\nat variance with the casual editorial standards of the time. He indicated explicitly that\nhe was responsible for weaving together into a coherent whole the fragmentary\nevidence he had found, justifying his publication of a second version of 'Temora'\nwith reference to fresh materials which had recently come into his possession, adding\n'The story of the poem, with which I had been long acquainted, enabled me to reduce\nthe broken members of the piece into the order in which they now appear.'32\nHis approach was entirely in keeping with contemporary Scottish theories of\n\n28 Uwe Boker, 'The Marketing of Macpherson: The International Book Trade and the first Phase of\nGerman Ossian Reception', in Howard Gaskill, ed., Ossian Revisited (Edinr., 1991), pp.73-93, (85).\n29 See Andrew Hook, 'Scotland and Romanticism: The International Scene' in Andrew Hook, ed.,\nThe History of Scottish Literature Volume 2 1660-1800 (Aberd., 1987), pp. 307-322, (313-6). See\nalso Kirsti Simonsuuri, Homer's Original Genius: Eighteenth-century Notions of the Early Greek Epic\n(1688-1798) (Cambridge, 1979), p.111. See also Roger Fiske, Scotland in Music A European\nEnthusiasm (Cambridge, 1983), pp. 31-54. There is a town called Ossian, in Indiana, USA.\n30 See R. W. Chapman, ed., Johnson's Journey to the Western Islands of Scotland and Boswell's\nJournal of a Tour to the Hebrides with Samuel Johnson, LL.D. (Oxford, 1930), pp.104-108.\n31 Derek S. Thomson, The Gaelic Sources of Macpherson's 'Ossian' (Edinr., 1951), passim, but esp.\npp. 1-12, 79-84; see also Ossian Revisited, op.cit., pp.5-6, 19.\n32 Temora, p.xviii; see also p.3, n, 4,n; Fingal, op.cit, p.104, n. See also Stafford, op.cit., pp.82-85,\n124-126.\n\n#15 epic poetry, which envisaged the evolution of unitary, written Homeric texts as\na late development resulting from deliberate editorial intervention in a previously oral\nprocess. Blackwell insisted that Homer had been a strolling oral poet, whose ballads\nhad been committed to writing as coherent developed epics centuries after his death.\nMacpherson could easily claim that what the Greek redactors had done, might very\nproperly be done again by a modern collector/editor working with the essentially non-\nliterate oral products of the Scottish Highlands.33\nHad the point of the controversy been merely literary, his position might have been\naccepted as a reasonable one. But in the domain of cultural politics, the implications\nof Ossian were explosive: if it were 'genuine', then the Scots, like the ancient Greeks\nand Romans (whom Macpherson also included in the roll of Celtic nations), but\npointedly unlike the contemporary English, possessed the ultimate national status-\nmarker: a great foundation epic.34 Hence the frequent references to Homer and Virgil.\nOssian was a calculated stroke in the struggle for cultural supremacy within the\nUnited Kingdom which had been rumbling on for centuries. Macpherson's\ndemonstration of the seniority of Scottish poetry, and his insouciant tracing of 'British\nLiberties' to Celtic rather than to Anglo-Saxon roots, were utterly galling to the\nEnglish intelligentsia and intended to be so.35 This is why the counter-attack was so\nferocious.\nBut Macpherson's political instincts were highly developed, and his text was\nfurnished with an elaborate apparatus of dissertations and notes intended to meet the\narguments likely to be brought against it. It was important to establish very clearly\nthe cultural community to which these poems referred, and this entailed an important\nsequence of arguments about the origin and identity of the Scottish nation. Some\nwriters had described the Scots as an ethnically loose confederation of peoples--\nGermanic Picts and northern Angles, and Celtic Scots out of Ireland--brought together\nby the vagaries of dynastic circumstance. Not so, said Macpherson, appealing to an\nimpressive array of antiquarian lore. With the exception of a later, debilitating,\nadmixture of Saxon stock following the acquisition of the Lothians, the ancient\nCaledonians were a wholly Celtic\n\n33 Blackwell, Enquiry, 104-5, 119ff; see also Temora, op.cit.,4,n. The poems' reception in the\nHighlands seems upon the whole to have been balanced and realistic. Duncan Robertson of Struan\nwrote in 1767: 'I have read Fingal, but not with the pleasure that I have heard many of his Exploits\nrepeated in the original Language. It is more than 40 years since I knew the characters of Fingal and his\nprincipal Heroes. The Translation seems really surprisingly good, but let any body that understands the\nLanguage compare the 7th Book of Temara in the Original (which M'Pherson has given as a\nspecimen), with the Translation, and he'll find a great deall of strength & beauty of expression lost;\nwhich is perhaps not so much the fault of the Translator as the deficiency of our modern Language'.\nquoted in T. L. Kington Oliphant, The Jacobite Lairds of Gask (Lond. 1870), p.354.\n34 See Macpherson, History of Great Britain and Ireland, pp.6-9.\n35 Ibid., pp.223-4; see also L, P, Curtis, jr., Anglo-Saxons and Celts: A Study of Anti-Irish Prejudice\nin Victorian England (Bridgeport: Conn., 1968), pp.8-9.\n\n#16 people, having originated in Gaul and subsequently migrated into the north.36\nPopular mythology might link them with marauding Irish war-bands during the Dark\nAges, but Macpherson insisted that the colonisation had taken place in exactly the\nopposite direction, Ireland being settled subsequently to Britain, the southern parts by\nBelgic Celts, and the north by Celts from Scotland and the Isles.37\nAlthough climate, geography, and political history had subsequently divided the\nHighland from the Lowland Caledonians in language and social mores, they were\nessentially a single people.38 So that the discovery of Gaelic epic poems possessed\nsignificance not merely for Highland, but for Scottish culture as a whole. And\nMacpherson insisted that Ossian was not an isolated phenomenon. He was by far the\nbest and oldest of the bards, it was true, but only one of a succession of brilliant poetic\ntalents preserved in the treasure-house of the Gaelic language, whose recovery bade\nfair to transform Scotland's standing in the world of learning and culture.39\nMacpherson was at pains to stress the unique richness of the Scottish Highlands as\na receptacle of tradition. He pointed to the deep conservatism of the people, and their\nsocial isolation which had restricted external influences whilst strongly fostering\nindigenous forms. Their military organisation and the spartan austerity of their way\nof life provided the ideal ambience for a cult of epic nobility to flourish.\n\nIf tradition could be depended upon, it is only among a people, from\nall time, free of intermixture with foreigners. We are to look for\nthese among the mountains and inaccessible parts of a country: places,\non account of their barrenness, uninviting to an enemy, or whose\nnatural strength enabled the natives to repel invasions. Such are the\ninhabitants of the mountains of Scotland. We, accordingly, find, that\nthey differ materially from those who possess the low and more fertile\npart of the kingdom. Their language is pure\n\n36 Fingal, pp. ii-iii; Temora, pp.ii-iv, xiii-xiv.\n37 Temora, p.vii. For the historical background to Macpherson's thinking see William Ferguson, The\nIdentity of the Scottish Nation, esp. Chs. 10-11.\n38 Temora, pp.v-vi.\n39 Macpherson was powerful on the links between language and identity: 'Nations are not so tenacious\nof their customs and manners as they are of their aboriginal tongues. The first may gradually vanish in\nthe growing improvements of civil life; the latter can only be buried in the same grave with the people\nthemselves. Conquest may confine the bounds of a language; commerce may corrupt it; new\ninventions, by introducing new words, may throw the old into disuse; a change in the mode of thinking\nmay alter the idiom: but the extirpation of those who speak any original tongue is the only means, by\nwhich it can be entirely destroyed, even where letters have been altogether unknown. It retires from\nsuccessful invasion into rocks and desarts; it subsists with the remains of a people; even mountains and\nrivers in part retain it when the people are no more.' History of Great Britain and Ireland, p.241.\n\n#17 and original, and their\nmanners are those of an antient and unmixed race of men. Conscious of\ntheir own antiquity, they long despised others, as a new and mixed\npeople. As they lived in a country only fit for pasture, they were\nfree of that toil and business, which engross the attention of a\ncommercial people. Their amusement consisted in hearing or repeating\ntheir songs and traditions, and these intirely turned on the antiquity\nof their nation, and the exploits of their forefathers. It is no\nwonder, therefore, that there are more remains of antiquity among\nthem, than among any other people in Europe.40\n\nThe antiquity of Ossian was essential to Macpherson's argument and the point was\nexpounded at length in the 'Dissertations' which accompanied the poems. He pointed\nto the deep conviction amongst the communities which had preserved them that the\npieces were antique. The ideas, manners and linguistic idiom also seemed to indicate\ngreat age. In structure they were nobly wild and irregular, which was thought to be\nthe hallmark of 'primitive' poetry. There was no reference to long-established social\nforms like clanship, and such allusions to Christianity as the poems contained treated\nit as an intrusive and novel creed.41\n\nMacpherson appealed to the fashionable theories of 'conjectural history' currently\nbeing developed by Enlightenment thinkers in Scotland and elsewhere. Human\nsocieties were thought to pass through a series of clearly-defined stages arranged in a\nfixed sequence: an age of hunter-gatherers followed by a pastoral age of flocks and\nherds, then an era of more settled agriculture with tending of crops, and finally the\nmodern mercantile era with its cash nexus and contractual relations.42 In terms of\nmaterial prosperity, each stage represented an advance on the previous one, but\ncontemporaries did not regard the process wholly in terms of gain. Blackwell had\nalready noted that it did not 'seem to be given to one and the same Kingdom, to be\nthoroughly civilized, and afford proper Subjects for Poetry,' and the idea of a lost\ngolden age distinguished by high artistic achievement could be traced back to\nclassical antiquity and beyond.43 The heroic past possessed a potentially strong appeal\nif it could be shown not to be barbaric in a squalid savage sense, but nobly primaeval;\nand this Macpherson set himself to do. He radically rearranged the graph of culture,\nreplacing the smooth upward curve with a high initial peak followed by a downward\nsubsequent trajectory, implying that the creative impulse had become so compromised\nby\n\n40 Ibid., pp.ii-iii; see also Fingal, 'Preface'.\n41 Fingal, pp. iv, vii; 'Preface' to Fragments, in Gaskill, Poems of Ossian, p.5.\n42 Macpherson's thinking here seems to have influenced both Adam Ferguson and Lord Kames: see\nWilliam C. Lehmann, Henry Home, Lord Kames, and the Scottish Enlightenment: a Study in National\nCharacter and in the History of Ideas (The Hague, 1971), p.190; and George W. Stocking, Jr.,\n'Scotland as the Model of Mankind: Lord Kames' Philosophical View of Civilisation', in Timothy H.\nH. Thoresen, ed., Towards a Science of Man: Essays in the History of Anthropology (The Hague,\n1975), pp.65-89.\n43 Blackwell, Enquiry, p.26.\n\n#18 commercial values that the present could not hope to equal the past in the\nproduction of an enduring poetry.\nThe lofty, chivalric code of the Ossianic heroes had been framed by the bards and\nconveyed in languageof such power and eloquence as to give it the force of a moral\nimperative. Art, which had begun by reflecting life, ensured that life in turn\nattempted to emulate art. In this way heroic values were diffused through Highland\nsociety. Every chief believed himself to be descended from a Fingalian hero, and\nevery chief had a bard who could recite the old epics, and in time the office became\nhereditary. And so bardic succession ensured that the poems were handed down\nintact from generation to generation.44\n\nMacpherson was committed to defending oral tradition as a medium capable of\ntransmitting large-scale cultural forms accurately over considerable periods of time,\nand he appealed to a spread of similar practices amongst other ancient peoples in\nsupport of his ideas.45 He was prepared to specify the mechanisms of transmission in\nconsiderable detail. These involved techniques of disciplined memorisation instilled\nin the bardic class; their practice of frequent allusion to the established classics which\nkept knowledge of them current; the public nature of poetry which provided a social\nbrake upon innovation; and the prosodic structures of Gaelic poetry itself which, he\nthought, inhibited casual mutation.46\nThe oral element was of crucial importance because it was the sole means of access\nto the 'lost' original fixed authoritative text. Various references in the Dissertations\nand Prefaces suggest that Macpherson actually believed that such a thing had once\nexisted, and that he was acting as a 'restorer' rather than as an independent creator in\nhis own right.47 Although he was willing, indeed compelled, to acknowledge the\nultimate coherence of 'tradition', he was never entirely comfortable in its presence,\nregarding variation between the oral versions as probable signs of corruption and\nloss.48 Blackwell had been happy to contemplate the 'original' Homeric text as\nepisodic and oral and as having undergone significant change over time, but\nMacpherson hankered after something a good deal more stable and unitary. He\nregarded invariance and fixity as the hallmarks of tradition and considered that it was\nthe role of educated mediators such as himself to rescue the products of these forces\nfrom disintegrating contemporary oral cultures. This was a task of some urgency.\nHighland society, he thought, had experienced more rapid change during the last\nthirty years than in the last thousand. As a result of this its traditional culture stood in\nserious jeopardy:\n\n44 Fingal, pp.x-xi.\n45 Ibid., p.xiii.\n46 Ibid., pp.xi-xiii.\n47 Stafford, pp.82-3.\n48 Indeed he remarked in Temora that 'Probability is all that can be established on the authority of\ntradition, ever dubious and uncertain.', p.xi.\n\n#19\n\nThe genius of the highlanders has suffered a great change within\nthese few years. The communication with the rest of the island is\nopen, and the introduction of trade and manufactures has destroyed that\nleisure which was formerly dedicated to hearing and repeating the\npoems of ancient times...Bards have been long disused, and the\nspirit of genealogy has greatly subsided. Men begin to be less\ndevoted to their chiefs, and consanguinity is not so much regarded.\nWhen property is established, the human mind confines its views to the\npleasure it procures. It does not go back to antiquity, or look\nforward to succeeding ages. The cares of life increase, and the\nactions of other times no longer amuse. Hence it is, that the taste for their\nancient poetry is at a low ebb among the highlanders.49\n\nMany generations of readers were to return to Fingal, and Temora and find\nthemselves touched by unearthly beauty and power. Many generations of historians\nand critics were to acknowledge their outstanding importance in the history of\nEuropean thought. For this study, however, the significance of Macpherson's work\nlies in the series of theoretical statements to which it gave rise about the nature of\nCeltic art. These were caught up and amplified by later writers and established the\nconventions to which all Highland art forms--and especially the music of the pipe--\nwere subsequently expected to conform outside the Gaidhealtachd. They were as\nfollows:\n\n(1) That as Ossian was shrouded in controversy, then all Celtic cultural\nproducts might be considered potentially bogus.\n(2) That antiquity was the distinguishing feature of Highland art and the great\nperiod of achievement lay in the past.\n(3) That its true expression was linked with noble barbarism and rugged\nnatural settings.\n(4) That wildness and irregularity were its leading formal characteristics.\n(5) That cloudy melancholy was its most typical emotion.\n(6) That 'tradition' ought to be, like the societies which sustained it, essentially\nunchanging.\n(7) That the fluidity inherent to oral 'variants' must therefore represent\ncorruption and loss.\n(8) That since the mechanisms of transmission were failing, modern 'tradition'\n\n49 Fingal, p.xv.\n\nmust be inherently degenerative and unable to sustain itself without the\nintervention of external mediators.\nThis, then, was the Macpherson paradigm which was to dominate the interpretation\nof Highland culture outside the Gaidhealtachd during the following two centuries.\n\n* * *\nDonaldson, William. The Highland Pipe and Scottish Society, 1750-1950: Transmission, Change and the\nConcept of Tradition. East Linton, East Lothian, Scotland: Tuckwell Press, 2000.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.430 / CMS.920 Popular Culture and Narrative: Use and Abuse of the Fairy Tale\nFall 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "21L.430F15 Albert B. Lord, The Singer of Tales",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-430-popular-culture-and-narrative-use-and-abuse-of-the-fairy-tale-fall-2015/89ccdfe130837be75a99e48e32c45e77_MIT21L_430F15_Albert.pdf",
      "content": "Albert B. Lord, The Singer of Tales (Cambridge, Massachusetts: Harvard\nU.P., 1960)\n\nThese notes are included here, because although they relate to the great\nheroic ballad tradition of the Balkans, rather than to tales and tale telling,\nthey vividly capture compositional and transmission methods in an old\npredominantly oral culture, similar to the ones the Grimms found in north\nHesse, and Propp in early twentieth century Russia\n\nThe story of The Singer of Tales is a rich and interesting one.\nSuggestions had been circulating for some time in the scholarly world\nduring the early years of the twentieth century, about an archaic\nperformance tradition featuring long heroic songs in the Balkans, which\ntook as their topic the wars of the Christians and the Turks. These used a\nmethod of composition-in-performance, a method, apparently\nimprovised, that enabled the production of lengthy sung narratives of\nseveral thousands of lines of length,. There was a further, sensational,\nsuggestion, namely that these oral bards were using the same methods\nthat Homer had, nearly two thousand years previously. The phenomenon\nprompted a number of intriguing questions: what were the mechanisms of\ntransmission here? When these performers sat down cross legged with\ntheir one-string gusles and entertained their audiences in taverns and\ncoffee-houses, were they performing from memory or was some other\nmechanism in play. Harvard scholars Milman Parry and Albert Lord\nwent to the area to explore this, and made an epic sequence of field-\nrecordings on aluminium disc, capturing several thousand hours of\nperformance. The results, enshrined in Albert Lord's wonderful book,\nThe Singer of Tales, were to transform our understanding of oral tradition\nand the processes of transmission in oral or predominantly oral societies.\n\nLord says \"The singer of tales is at once the tradition and an individual\ncreator. His manner of composition differs from that used by a writer\nin that the oral poet makes no conscious effort to break the\ntraditional phrases and incidents; he is forced by the rapidity of\ncomposition in performance to use these traditional elements.\" p.4\n\"With oral poetry we are dealing with a particular and distinctive\nprocess in which oral learning, oral composition, and oral\ntransmission almost merge; they seem to be different facets of the\nsame process.\" p.5\n\"Although it may be true that this kind of poetry has survived longest\namong peasant populations, it has done so not because it is\nessentially 'peasant' poetry, but rather because the peasant society\nLord, Albert B. The Singer of Tales. Harvard University Press, 1960. (c) Harvard\nUniversity Press. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\nhas remained illiterate longer than urban society.\" p.6\n\nThere are three ways of looking at the Homeric corpus: one, that it\nwas written, and by a single author, Homer, back in the ninth century BC.\nBut writing in ancient Greece could not be traced so far back.\nA second theory had Homer as the last brilliant representative of a series\nof \"redactors\" who had gathered oral fragments together and gradually\ncobbled hem together to form huge written epic structures. The third\napproach, and the one which Parry and Lord set themselves to document,\nwas that Homer was an oral bard, a wandering poet-singer who moved\naround the aristocratic courts of ancient Greece with his lyre, performing\nepisodes from the epics that were later gathered together under his name.\nThis raised fascinating questions about his compositional method, and the\nmeans by which his songs were transmitted orally for nearly three\ncenturies, before being codified in written form at the orders of\nPisistratus, tyrant of Athens in the 6th century BC.\n\nLord says \"These scholars who made the third choice were moving in\nthe right direction, namely towards oral tradition, but in putting the\npoet of our Homeric texts before the period of writing, they were\nunwittingly creating more problems than they were as yet equipped to\nhandle. Their choice was a compromise Oral tradition was a fickle\nmistress with whom to flirt. But scholars could call in to their help\nthe 'fantastic memories' so 'well attested' of illiterate people. They\nfelt that a text could remain from one generation to another\nunaltered, or altered only by inconsequential lapses of memory. This\nmyth has remained strong even to the present day. The main points of\nconfusion in the theory of those scholars who made the third choice\narose from the belief that in oral tradition there is a fixed text\nwhich is transmitted unchanged from one generation to another.\" pp.7-\n10.\nThis idea was first propounded by James Macpherson, the editor of\nOssian in eighteenth century Scotland, who posited various mechanisms\nin traditional societies which could ensure that oral material was\ntransmitted coherently over long periods of time. For an account of this, see the posting on Macpherson in the \"Materials\" section of the Stellar site, taken from my own book, The Highland Pipe and Scottish Society Edinr., 2008).\nLord continues, \"The theories of multiple authorship can\nbe divided into two general classes. The first, and the earliest, saw\nthe Homeric poems as compilations of shorter songs, stitched together\n\nby their compiler. D'Aubignac presented this in his Conjectures in\nLord, Albert B. The Singer of Tales. Harvard University Press, 1960.\n\n(c) Harvard\nUniversity Press. All rights reserved. This content is excluded from our Creative\n\nCommons license. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\n1715, but it was Lachmann and his followers in the nineteenth century\nwho made serious attempts to dissect the poems according to his lieder\ntheories. The attempts were unsuccessful and unconvincing; for the\ndissectors could not agree on where to use the scalpel. The theory\nwas discredited [...] The work of the first group of dissectors led to\nseveral valuable compilations. [Elias] Lonnrot [1802-1884] put together\nthe Finnish Kalevala, the Estonians entered the competition with the\nKalevipoeg, and the Serbs attempted a number of \"national\" epics on the\nKosovo theme. But nothing comparable to the Homeric poems was\nproduced. The problem of the way in which the Homeric poems had\nattained their length, if they were not literary productions of a single\nauthor, remained unsolved.\" pp.10-11.\n\"They knew and spoke often of folk ballad and epic, they were aware of\nvariants in these genres, yet they could see only two ways in which\nthose variants could come into being: by lapse of memory or by wilful\nchange. This seemed so obvious, so much an unquestioned basic\nassumption, that they never thought to investigate exactly how a\ntraditional poetry operated.\nThey always thought in terms of a fixed text or a fixed group of texts\nto which a poet did something for a reason within his own artistic or\nintellectual self. They could not conceive of a poet composing a line\nin a certain way because of necessity or because of the demands of his\ntraditional art.\" p.11\nComparing their recordings, Parry and Lord felt able to say: \"Our singer\nof tales is a composer of tales. Singer, performer,\ncomposer, and poet are one under different aspects but at the same\ntime. Singing, performing, composing are facets of the same act.\nIt is sometimes difficult for us to realize that the man who is\nsitting before us singing an epic song is not a mere carrier of the\ntradition but a creative artist making the tradition.\" p.13\nThis was a sensational finding. But it was complicated by the fact that\nthe south Slavs had had a written tradition for a thousand years when\nParry and Lord began their work, and it was true that many of the\ntraditional singers who seemed to perform in the true authentic manner\nwere in fact performing memorised written material which had been\ncirculating for some time. But there was a deeper strand, a still lingering\ntechnique that had survived the onset of literacy and still preserved the\ncompositional methods of an almost unimaginable antiquity.\n\"The majority of such 'folk' singers are not oral poets. The\ncollector even in a country such as Yugoslavia, where published\ncollections have been given much attention for over a century, some of\nwhich have become almost sacrosanct, must be wary; for he will find\nLord, Albert B. The Singer of Tales. Harvard University Press, 1960.\n\n(c) Harvard\nUniversity Press. All rights reserved. This content is excluded from our Creative\n\nCommons license. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\nsingers who have memorized songs from these collections.\nIn spite of authentic manner of presentation, in spite of the fact\nthat the songs themselves are often oral poems, we cannot consider\nsuch singers as oral poets. They are mere performers. Such\nexperiences have deceived us and have robbed the real oral poet of\ncredit as a creative composer; indeed to some extent they have taken\nfrom epic performance an element of vital interest.\" p.14\nLord begins, intriguingly, by looking not at the singer, but at the\naudience, because, he argues, their situation, horizons of expectation, and\nattention span have a direct shaping influence on the singer's approach to\nhis material.\n\"If we are fully aware that the singer is composing as he sings, the\nmost striking element in the performance itself is the speed with\nwhich he proceeds. It is not unusual for a Yugoslav bard to sing at\nthe rate of from ten to twenty ten-syllable lines a minute.\nSince...he has not memorized his song, we must conclude either that he\nis a phenomenal virtuoso or that he has a special technique of\ncomposition outside our field of experience. We must rule out the\nfirst of these alternatives because there are too many singers; so\nmany geniuses simply cannot appear in a single generation or continue\nto appear inexorably from one age to another. The answer, of course,\nlies in the second alternative, namely, a special technique of\ncomposition.\" p.17\nLord sees the existence of literacy and written/printed texts as deadly--\nnot to the songs themselves, but to the method of composition by which\nthey are realised [which in the end amounts to the same thing]--schools,\ncities, and literacy eventually put paid to it in urban areas. p.20\n\"We must remember that the oral poet has no idea of a fixed model text\nto serve as his guide. He has models enough but they are not fixed\nand he has no idea of memorizing them in a fixed form. Every time he\nhears a song sung, it is different.\" p.22\n\"Sometimes there are published versions of songs in the background.\n[Named Informant] in Bihac told us that he did not learn to sing until\nhe was about twenty-eight (he was forty-five in 1935), and that he had\nlearned his songs from the song books, the Matica Hrvatska collection\nin particular. Although he could not read, somebody had read them to\nhim. He had also heard the older singers in his district. The\nentrance of these song books into the tradition is a very interesting\nphenomenon, and one that is open to gross misinterpretation. Yet as\nlong as the singer himself remains unlettered and does not attempt to\nreproduce the songs word for word, these books have no other effect on\nhim than that of hearing the song.\" p.23\nLord, Albert B. The Singer of Tales. Harvard University Press, 1960.\n\n(c) Harvard\nUniversity Press. All rights reserved. This content is excluded from our Creative\n\nCommons license. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\n\"It may truthfully be said that the singer imitates the techniques of\ncomposition of his master or masters rather than particular songs.\nFor that reason the singer is not very clear about the details of how\nhe learned his art, and his explanations are frequently in very\ngeneral terms. He will say that he was interested in the old songs,\nhad a passion for them, listened to singers, and then, 'work, work,\nwork' and little by little he learned to sing. He had no definite\nprogram of study, of course, no sense of learning this or that formula\nor set of formulas. It is a process of imitation and of assimilation\nthrough listening and much practice on one's own.\" p.24\nThe beginner, \"has very likely not learned much about 'ornamenting' a\nsong to make it full and broad in its narrative style. That will\ndepend somewhat on his model. If the singer from whom he has learned\nit is one who uses much 'ornamentation,' he has probably picked up a\ncertain amount of that ornamentation too. Whether his first song is\nfully developed or not, it is complete in its story from beginning to\nend and will tend to follow the story as he heard it from his master.\nIf, however, and this is important, he has not learned it from one\nsinger in particular, and if the stories of that song differ in the\nvarious versions which he has heard, he may make a composite of them.\nHe may, on the other hand, follow one of them for the most part,\ntaking something from the others too. Either way is consistent with\nthe traditional process. One can thus see that although this process\nshould not be described as haphazard, which it is not, it does not fit\nour own conceptions of learning a fixed text of a fixed song.\" p.24\n\"Our proper understanding of these procedures is hindered by our lack\nof a suitable vocabulary for defining the steps of the process. The\nsingers themselves cannot help us in this regard because they do not\nthink in terms of form as we think of it; their descriptions are too\nvague at least for academic preciseness. [The learner/performer] without\nwriting thinks in terms of sound groups and not in words, and the two do\nnot necessarily coincide. When asked what a word is, he will reply that\nhe does not know, or he will give a sound group which may vary in\nlength from what we call a word to an entire line of poetry or even\nan entire song. The word for 'word' means an 'utterance.' When the\nsinger is pressed then to say what a line is, he, whose chief claim to\nfame is that he traffics in lines of poetry, will be entirely baffled\nby the question; or he will say that since he has been dictating and\nhas seen his utterances being written down, he has discovered what a\nline is, although he did not know it as such before, because he had\nnever gone to school.\" p.25\nOf one particular singer who said he had given a particular version\nLord, Albert B. The Singer of Tales. Harvard University Press, 1960.\n\n(c) Harvard\nUniversity Press. All rights reserved. This content is excluded from our Creative\n\nCommons license. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\n\"word for word and line for line\", Lord remarks that what he meant was\nthat it was \"like\" the version in question; obviously, since the\nspeaker did not know what a word or a line was.\n\"...the picture that emerges is not really one of conflict between\npreserver of tradition and creative artist; it is rather one of the\npreservation of tradition by the constant re-creation of it.\" p.29\n\"Memorization is a conscious act of making one's own, and repeating,\nsomething that one regards as fixed and not one's own. The learning\nof an oral poetic language follows the same principles as the learning\nof language itself, not by the conscious schematization of elementary\ngrammars but by the natural method.\" p.36\n\"The theme [he means the various episodes out of which these tales are\nbuilt], even though it be verbal, is not any fixed set of words, but a\ngrouping of ideas.\" p.69\n\"A general principle is here involved that is of significance when we\nare dealing with a tradition being invaded by printed song books:\nnamely, that if the printed text is read to an already accomplished\noral poet, its effect is the same as if the poet were listening to\nanother singer. The song books spoil the oral character of the\ntradition only when the singer believes that they are the way in which\nthe song should be presented. The song books may spread a song to\nregions where the song has not hitherto been sung; in this respect\nthey are like a migrant singer. But they can spoil a tradition only\nwhen the singers themselves have already been spoiled by a concept of\na fixed text.\" p.79\nVersions may change as a singer grows and matures; after maturity is\nreached, about 50, \"From the time that maturity is reached and the\nsinger has established the general outlines of a theme, evidence seems\nto indicate that he changes it little if at all.\" p.94.\n\"When the singer of tales, equipped with a store of formulas and\nthemes and a technique of composition, takes his place before an\naudience and tells his story, he follows the play which he has learned\nalong with the other elements of his profession. Whereas the singer\nthinks of his song in terms of a flexible plan of themes, some of\nwhich are essential and some of which are not, we think of it as a\ngiven text which undergoes change from one singing to another. We are\nmore aware of change than the singer is, because we have a concept of\nthe fixity of a performance or of its recording on wire or tape or\nplastic or in writing. We think of change in content and in wording;\nfor, to us, at some moment both wording and content have been\nestablished. To the singer the song, which cannot be changed (since\nto change it would, in his mind, be to tell an untrue story or to\nLord, Albert B. The Singer of Tales. Harvard University Press, 1960.\n\n(c) Harvard\nUniversity Press. All rights reserved. This content is excluded from our Creative\n\nCommons license. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\nfalsify history), is the essence of the story itself. His idea of stability, to\nwhich he is deeply devoted, does not include the wording, which to him\nhas never been fixed, nor the unessential parts of the story. He builds his\nperformance, or song in our sense, on the stable skeleton of narrative,\nwhich is the song in his sense.\" p.99\n\"We are occasionally fortunate enough to be present at a first\nsinging, and we are then disappointed, because the singer has not\nperfected the song with much practice and by the text of repeated\nperformance. Even after he has--and it may change much as he works it\nover--it must be accepted and sung by other singers in order to become\na part of the tradition, and in their hands it will go through other\nchanges, and so the process continues from generation to generation.\nWe cannot retrace these steps in any particular song. There was an\noriginal, of course, but we must be content with the texts that we\nhave and not endeavour to 'correct' or 'perfect' them in accordance\nwith a purely arbitrary guess at what the original might have been.\nIndeed, we should be fully aware that even had we this 'original,'\nlet us say, of the wedding of Smailagic Meho, we would not have the\noriginal of the basic story, that is the song of the young man who\ngoes forth into the world to win his spurs. We would have only the\napplication of this story to the hero Meho. Each performance is the\nspecific song, and at the same time it is the generic song. The song\nwe are listening to is 'the song'; for each performance is more than a\nperformance; it is a re-creation. Following this line of thinking, we\nmight term a singer's first singing of a song as a creation of the\nsong in his experience. Both synchronically and historically there\nwould be numerous creations and re-creations of the song. This\nconcept of the relationship between 'songs' (performances of the same\nspecific or generic song) is closer to the truth than the concept of\nan 'original' and 'variants'. In a sense each performance is 'an'\noriginal, if not 'the' original.\nThe truth of the matter is that our concept of 'the original,' of\n'the song,' simply makes no sense in oral tradition. To us it seems\nso basic, so logical, since we are brought up in a society in which\nwriting has fixed the norm of a stable first creation in art, that we\nfeel there must be an 'original' for everything. The first singing in\noral tradition does not coincide with this concept of the 'original.'\nWe might as well be prepared to face the fact that we are in a\ndifferent world of thought, the patterns of which do not always fit\nour cherished terms. In oral tradition the idea of an original is\nillogical.\nIt follows, the, that we cannot correctly speak of a 'variant',\nLord, Albert B. The Singer of Tales. Harvard University Press, 1960.\n\n(c) Harvard\nUniversity Press. All rights reserved. This content is excluded from our Creative\n\nCommons license. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\nsince there is not 'original' to be varied!\" pp.100-101\n\"...'oral transmission', 'oral composition,' 'oral creation,' and\n'oral performance' are all one and the same thing. Our greatest\nerror is to attempt to make 'scientifically' rigid a phenomenon that\nis fluid.\" p.101\n\"It seems to be highly significant that the words 'author' and\n'original' have either no meaning at all in oral tradition or a\nmeaning quite different from the one usually assigned to them.\" p.101\n\"In the Parry Collection there are songs from singers who learned\nthem from printed texts. Their songs, however, are very close to the\nprinted versions, and one realizes that the singer was attempting\nconsciously to memorize or at least to follow closely what was\nprinted. Singers like [a true traditional master] Avdo...make no attempt to\nmemorize...even when a song is read to them, but singers imbued with the\nidea that the written text is the proper one strive to keep to it even\nverbally if possible. With them the tradition is dead or dying. It could be\ntruly said, I believe that the only way in which they can compensate for\ntheir lack of awareness of the tradition, that awareness that we are\nbeginning to see as deeply conservative, religiously maintaining the\nmeaning of a song, is to memorize or attempt to memorize.\" p.109\nA section follows dealing with the fact that songs vary from fathers to\nsons, and why.\"...one cannot write song. One cannot lead Proteus\ncaptive; to bind him is to destroy him.\nBut writing, with all its mystery, came to the singers' people, and\neventually someone approached the singer and asked him to tell the song\nso that he could write down the words. In a way this was just one more\nperformance for the singer, one more in a long series. Yet it was the\nstrangest performance he had ever given. There was no music and no\nsong, nothing to keep him to the regular beat except the echo of previous\nsingings and the habit they had formed in his mind. Without these\naccompaniments it was not easy to put the words together as he usually\ndid. The tempo of composing the song was different, too. Ordinarily the\nsinger could move forward rapidly from idea to idea, from these to theme.\nBut now he had to stop very often for the scribe to write down what he\nwas saying, after every line or even after part of a line. This was difficult,\nbecause his mind was far ahead. But he accustomed himself to this new\nprocess at last, and finally the song was finished.\nA written text was thus made of the words of song. It was a record of a\nspecial performance, a command performance under unusual\ncircumstances. Such has been the experience of many singers in many\nlands, from the first recorded text, I believe, to present times. And what\nhas been said of other performances can be said of it; for though it is\nLord, Albert B. The Singer of Tales. Harvard University Press, 1960.\n\n(c) Harvard\nUniversity Press. All rights reserved. This content is excluded from our Creative\n\nCommons license. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\nwritten, it is oral. The singer who dictated it was its 'author,' and it\nreflected a single moment in the tradition. It was unique.\nYet, unwittingly perhaps, a fixed text was established. Proteus was\nphotographed, and no matter under what other forms he might appear in\nthe future, this would become the shape that was changed; this would be\nthe 'original'. Of course, the singer was not affected at all. He continued\nas did his confreres, to compose and sing as he always had and as they\nalways had. The tradition went on. Nor was his audience affected. They\nthought in his terms, in the terms of multiformity. But there was another\nworld, of those who could read and write, of those who came to think of\nthe written text not as the recording of a moment of the tradition but as\nthe song. This was to become the difference between the oral way of\nthought and the written way.\" pp.124-125.\nHe speaks of the kinds of things that happen to a text when the singer is\nasked to dictate it without singing and pausing after each verse, and there\nare two effects both with obvious potential relevance to Fairy Tales, one\nis that performers can't do it outside their usual setting and at a totally\ndifferent speed from what they're used to, and the resulting text is inferior\nto their normal standard, verse frequently being interspersed with\nexplanatory prose and so on. The other effect, and you get this with the\nmost able singers, is a very superior text, of conspicuous length and\nrichness of ornament, precisely because the singer has more time to think,\nand his talent makes him less context bound. This latter is what Lord\nthinks happened in the case of Homer, as he explains in the second,\nHomeric, section of his book. pp.126-7\n\"The use of writing in setting down oral texts does not per se have any\neffect on oral tradition. It is a means of recording. The texts thus\nobtained are in a sense special; they are not those of normal performance,\nyet they are purely oral, and at their best they are finer than those of\nnormal performance. They are not 'transitional,' but are in a class by\nthemselves.\nIt is necessary for us to face squarely the problem of 'transitional' texts.\nIs there in reality such a phenomenon as a text which is transitional\nbetween oral and written literary tradition?\" p.128 An important point\nthis in traditional Homeric studies. Lord thinks not: \"...this process is not\na transition from an oral to a literary technique of composition. It is a\ntransition from oral composition to simple performance of a fixed text,\nfrom composition to reproduction. This is one of the most common ways\nin which an oral tradition may die; not when writing is introduced, but\nwhen published song texts are spread among singers. But our singer does\nnot necessarily blossom forth as a literary poet. He usually becomes---\nnothing at all.\" p.130\nLord, Albert B. The Singer of Tales. Harvard University Press, 1960.\n\n(c) Harvard\nUniversity Press. All rights reserved. This content is excluded from our Creative\n\nCommons license. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\n\"One of the difficulties in comprehending the change from oral to written\nstyle lies in the fact that we think of the written always in terms of\nquality, and that of the highest. We assume without thinking that written\nstyle is always superior to oral style, even from the very beginning.\nActually this is an error in simple observation of experience, perpetrated\nalas by scholars who have shunned experience for the theoretical. A\nsuperior written style is the development of generations. When a\ntradition or an individual goes from oral to written, he, or it, goes from an\nadult, mature style of one kind to a faltering and embryonic style of\nanother sort...\nWhile the presence of writing in a society can have an effect on oral\ntradition, it does not necessarily have an effect at all. The fact of writing\ndoes not inevitably involve a tradition of written literature; even if it did,\na tradition of written literature does not inevitably influence an oral\ntradition. The Southern Slavs had a tradition of written literature since\nthe end of the ninth century; indeed they invented the alphabets used by\nthe Slavs. Yet this written tradition had no influence on the form of the\noral tradition until the nineteenth and twentieth centuries. The two\nexisted side by side, not, of course, within the same group, but certainly\nwithin the same district. In mediaeval times, writing and written\nliterature, first on foreign models but soon developing along its own lines,\nwere cultivated in the monasteries, as in the rest of Europe. The carriers\nof oral tradition were the unlettered people outside the monasteries.\nBeginning in the fifteenth century on the Adriatic coast and on some of\nthe islands, particularly in the cities of Split, Zadar, and Dubrovnik, again\nunder foreign influence and with foreign models at first, a rich literary\ntradition arose not only among the clergy, but more especially among the\nwealthy merchant aristocracy. In the villages surrounding these cities and\namong the other classes of the population in the cities, that is, among\nthose who were not of patrician families and not educated in the schools\nabroad, or later at home, oral tradition continued to flourish among the\nunlettered. In both these instances the literary tradition was not a\ndevelopment from the oral tradition. It was stimulated from outside, from\nByzantium or from Italy.\" pp.134-135\n\nWhat has been the effect of the collections on the tradition itself? The\nlarger, more expensive editions did not reach the communities in which\nthe singing was cultivated, nor did they have any effect in places where\nthere was no person who could read. But during the nineteenth century\nschools began to spread slowly, and after World War 1 schools were to be\nfound in most communities. Since the establishment of the Communist\nregime a concentrated battle against illiteracy has been going on, and now\nLord, Albert B. The Singer of Tales. Harvard University Press, 1960.\n\n(c) Harvard\nUniversity Press. All rights reserved. This content is excluded from our Creative\n\nCommons license. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\nin Yugoslavia only a comparatively small number of the older people are\nstill unable to read and write. Common fare in all school books have\nbeen the songs from Vuk's collection or, to a lesser extent, from Njegos's\nwork [...]\nThe effect on the younger generation which could read was that the\nyoung people began to memorize songs from the books. They still\nlearned the art from their elders and could sing songs picked up from oral\ntradition, but they were moving away from that tradition by memorizing\nsome of their repertory from the song books. The memorization from a\nfixed text influenced their other songs as well, because they now felt they\nshould memorize even the oral versions. The set, 'correct' text had\narrived, and the death knell of the oral process had been sounded. There\nare very few younger singers, particularly among the Christian\npopulation, who have not been infected by this disease. This is somewhat\nless true among the Moslems, because none of their collections has been\ngiven the almost sacred authority of Vuk's or Njegos's.\" pp.136-7.\n\"The singers who accept the idea of a fixed text are lost to oral\ntraditional processes. This means death to oral tradition and the rise of a\ngeneration of 'singers' who are reproducers rather than re-creators. Such\nare the men who appear in costume at folk festivals and sing the songs\nthey have memorized from Vuk's collection. You or I could do the same\nwith a certain amount of training and with a costume. These 'singers' are\nreally counterfeits masquerading as epic bards! They borrow the songs of\nreal singers complete from first word to last; one can follow the text in\nthe book. They are a menace to the collector. The idea of the fixed text\nhas been established in them, but they are not by this token literary poets,\neven though they are now members of the community of those with\nwritten 'mentality', in spite of the fact that some of them are still\nunlettered.\nThe change has been from stability of essential story, which is the goal\nof oral tradition, to stability of text, or the exact words of the story. The\nspread of the concept of fixity among the carriers of oral traditional epic\nis only one aspect of the transition from an oral society to a written\nsociety. Ironically enough, it was the collector and even more those who\nused his collection for educational, nationalistic, political, or religious\npropaganda who presented the oral society with a fixed form of its own\nmaterials...Today in Yugoslavia the transition under this aspect is nearly\ncomplete. The oral process is now nearly dead.\" p.138\n\n*\nLord, Albert B. The Singer of Tales. Harvard University Press, 1960.\n\n(c) Harvard\nUniversity Press. All rights reserved. This content is excluded from our Creative\n\nCommons license. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.430 / CMS.920 Popular Culture and Narrative: Use and Abuse of the Fairy Tale\nFall 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "21L.430F15 Angela Carter—a Brief Guide to Non-Featured Stories",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-430-popular-culture-and-narrative-use-and-abuse-of-the-fairy-tale-fall-2015/3d269a7d77e82a136d2fa6c033598cff_MIT21L_430F15_AngelaCarter.pdf",
      "content": "Angela Carter--a Brief Guide to Non-Featured Stories\n--There is lots of animal/human transformation/miscegenation in Carter's stories.\nThinking sideways is always useful in such contexts:--what else do we already know\nabout this? Swift's Houyhnhnms, the rational horses in Gulliver's Travels? The\ntransformation of Bottom in Midsummer Night's Dream? The use of such devices for\ncomic effect as in, say, the old sea-song of \"The Eddystone Light\"--\"My father was the\nkeeper of the Eddystone Light / And he met with a mermaid one fine night; / From this\nunion there came three- / Two of them was fishes and the other was me.\"\n--There appears to be much stress on the transformative power of love; an old theme, but\nhere it can turn a human into an animal, seemingly, as easily as it can turn an animal into\na human; vide Carter's grotesque but insightful story in which Beauty becomes a Beast.\n\"Puss in Boots\" (pp.68-84): features a cat with a braggadocio swagger: a pander, a\nprocurer, a thief, a cheat at cards. Amazing opening sentence--at once establishing the\npersona: suave, bustling, chic, sardonic; at the same time he's subtly undercut by his\ncreator: see the reference to his voice in paragraph two of the story. The setting, the\nnorthern tourist town of Bergamo near Milan at the foot of the Alps is full of Mozartian\nand Rossini implications and was itself famous in music as the birthplace of composers\nDonizetti and Locatelli. Here is a classic example of the creation of character through the\nestablishment of a certain tone of voice. The atmosphere of the tale in which a\nswashbuckling puss inventively assists his impoverished but devilishly handsome young\nmaster is drawn straight from the Commedia del Arte. Flamboyant tension between form\nand content: 'I went about my ablutions, tonguing my arsehole with the impeccable\nhygienic integrity of cats, one leg stuck in the air like a ham bone.\" (p.70) There is a\ncoarse, earthy quality about this cat-familiar, as you would expect from its creator. Both\ncat and master are unbridledly salacious, see pp.71-2. So puss assists his master seduce\nhalf the women of the town, in an atmosphere of roistering British seaside-postcard fun.\n(For a sample of this kind of deliberate vulgarity, see Postcards of the Past: Comic\n\"Seaside\" Postcards.)\nAnd yet, behind the fun there's a characteristic note of sour cynicism: \"love is desire\nsustained by unfilfilment. If I lead him to her bedchamber and there he takes his fill of\nher lily-white, he'll be right as rain in two shakes and next day tricks as usual.\" (p.72)\nWe get another strong dose of the writer's essential coarseness again: \"all good women\nhave the missionary streak, sir; convince her her orifice will be your salvation and she's\nyours.\" (pp.73-4). The artificial, dandified tone is underlined by a series of playful\nalliterative sequences on p.76 and 80: \"lovely lady's lubberly husband hump off his\nhorse\" and so on. Such is the over-egged verbal exuberance that we get a Scotticism,\n\"havering\" (to speak long-windedly and aimlessly) on p.78. Puss's speech meantime is\nstrewn with Gallicisms.\n\"The Erl-King\" (pp.84-91), rapturous, lush evocation of love affair with the spirit of the\nwoods. The trick, for the writer, is how to make this weird, inhuman being, sexy. I'm\nnot sure Carter manages, although she does evoke his otherworldliness surprisingly\neffectively in lush, strange physical imagery. Here comes Autumn: \"It struck the wood\nwith nicotine-stained fingers, the leaves glittered...withered blackberries dangled like\nCarter, Angela. The Bloody Chamber, and Other Stories. Penguin, 1990. (c) Penguin. All rights\nreserved. This content is excluded from our Creative Commons license. For more information,\nsee http://ocw.mit.edu/help/faq-fair-use/.\n\ntheir own dour spooks on the discoloured brambles...haunting sense of the imminent\ncessation of being; the year, in turning, turns in on itself. Introspective weather, a\nsickroom hush.\" (p.84) Here we see the same lust for erotic self-annihilation that we do\nin a number of these stories; all seem variations on the theme of Liebestod. And it is very\npowerfully present here (see pp.88-9). Pp.84-5, look for clunking shift from second to\nfirst person narrative. Does this work? Lovely inventive imagery: \"little brown bunnies\nwith their ears laid together along their backs like spoons\". The Other, the Erl-King is\ncreepily introduced by his effect on the animals around them. \"There are some eyes can\neat you.\" And so the girl enters the tangled wood; we never learn who she is or why. He\nis both lover and protector, maybe executioner too: \"I always go to the Erl-King and he\nlays me down on his bed of rustling straw where I lie at the mercy of his huge hands. He\nis the tender butcher who showed me how the price of flesh is love.\" [eh?--Shouldn't\nthat be the other way around?] p.87 He is the bird catcher, and his woodland abode is\nfull of caged birds. [A re-fashioning of the Papageno/Papagena relationship in the Magic\nFlute, then?]; he wants to turn the narrator into a bird and keep her in a cage. [high-\nfalutin', \"poetic\" kind of bondage urge?] There is a half hearted attempt at religious\nmysticism: \"the robin, the friend of man, in spite of the wound in his breast from which\nErl-King tore out his heart.\" p.91 Deliberate callow high-school blasphemy. [We\nremember, of course, that in traditional folklore the robin's breast is red because he flew\nabout the Cross trying to pull out the nails with his beak. The blood is Christ's]. The\nnarrative stance changes from first person to third, again clunkingly, in the final three\nparagraphs of the story. She is going to strangle him in his own hair and release his birds\nwho will turn back into girls. Ends with the classic Fairy Tale motif \"mother, mother,\nyou have murdered me\" (from My father ate me, my mother murdered me). [If you\ndidn't know the original Brothers Grimm tale, what would be the effect of these\nremarks?]\n\"The Snow Child\" (pp.91-2). Miniature; a tiny sketch based on Snow White; the sexual\nrivalry is blatant and explicit as only Carter can do it, and for some reason, unexplained,\nthe father-figure necrophiliacally ravishes Snow White in full sight of his wife. Snow\nWhite melts. [Balance? Plausibility? Sado-masochistic disgust?].\n\"The Werewolf\" (pp.108-110), is written in brutally blunt, short sentences in the present\ntense in Carter's idea of the bald folk-narrative style, quite unlike her usual sumptuous,\ntrope-strewn style; here grandmamma is a witch and a werewolf, and it is she who attacks\nLittle Red Riding Hood in the woods. This also is very short, a mere dozen paragraphs or\nso; Little Red Riding Hood succeeds Grandmamma in her cottage, after the locals kill\nGrandma. Will Little Red Riding Hood become like her? No indication. The story ends\nsimply \"she prospered.\" [another example of the prevailing moral inversion? This time\nit's the woman who is the predator?]\n\"The Company of Wolves\" (pp.110-118): would-be-scary Gothic introductory sequence\nasserting (unsuccessfully) how terrifying wolves are. Then we get to the bit: a hunter\ntraps a wolf, cuts off its head and feet, then finds \"the bloody trunk of a man, headless,\nfootless, dying, dead.\" (p.111). A Werewolf, then. So, next we get a peasant marriage:\nbride goes to bed, groom goes outside to ease nature and never returns; from the forest\nshe hears \"That long-drawn, wavering howl has, for all its fearful resonance, some\nCarter, Angela. The Bloody Chamber, and Other Stories. Penguin, 1990. (c) Penguin. All rights\nreserved. This content is excluded from our Creative Commons license. For more information,\nsee http://ocw.mit.edu/help/faq-fair-use/.\n\ninherent sadness in it, as if the beasts would love to be less beastly if only they knew how\nand never cease to mourn their own condition.\" [sense of alienation from one's true self?\nDoes this motif appear elsewhere?] (p.112). Episodic structure. The peasant girl marries\nagain, and has two children by her second husband; then, seven years later, the first\nhusband comes back, ragged, wild, angrily demanding a bowl of cabbage. He has been\nliving among the wolves, and seeing the happy domesticity of the scene wishes aloud that\nhe were a wolf again, at once becomes one, and has to be chopped to death with the wood\naxe but not before biting off the eldest son's left foot. Then there follow pseudo-\nfolkloristic notes on werewolves, their habits and how to recognise them, before we start\noff in conventional fictive mode again with a young girl taking a basket of goodies to her\ngrannie in the woods. By degrees we are persuaded that there is something magical about\nthis girl, she's just on the cusp of puberty and carries her virginity like an invisible\npentacle (pp.113-4). She has a knife, and the suggestion is that she knows how to use it;\nshe's afraid of nothing: at the height of the action she laughs openly at the wolf. There\nare a number of hints that the charming young huntsman she meets in the forest instead of\nthe expected wolf, is indeed a predator of some kind \"gleaming trails of spittle clung to\nhis teeth\" we're told (p.114); later we learn he has been snacking on the raw game birds\nhe carries over his shoulder; Little Red Riding Hood is dangerously complicit once more;\nwhen he sets off to Grandmother's cottage, she deliberately dallies so he will win the race\nand get there first. I dislike the grim, sadistic relish with which he is allowed to devour\ngrannie despite all her folkloristic counter-charms: but one wonders about the exact\nnature of his transformation: \"his genitals, huge. Ah! Huge. The last thing the old lady\nsaw in all this world was a young man, eyes like cinders, naked as a stone, approaching\nher bed.\" (p.116) So he eats up grannie and hides her bones under her bed. Then Little\nRed Riding Hood comes. He has volunteered to carry her basket with her big protective\nknife in it, and the reader becomes alarmed, but when the true state of things begins to\nemerge \"since her fear did her no good, she ceased to be afraid.\" They go through the\nritual of burning her clothes, and just when you think he'll gobble her up, she laughs at\nhim, rips his clothing off and throws it in the fire, and seduces him. [Reads like a\npornographic version of Roald Dahl? Except she cannot have read Dahl, because...?] A\nreference to werewolves in the plural, and seemingly in passing, suggests to the alert\nreader that she is one too. And looking back over the story, two things emerge strongly;\nin the professorial passages on werewolves and their distinguishing marks, we are told\nwith great emphasis that however normal their outward appearance, you can always tell\nthem by their eyes; and lo and behold, although hair and skin tone and such are lovingly\ndescribed by the author in the sections in which she introduces Little Red Riding Hood,\nno mention is made of her eyes...[so we see here again, a typical confusion of good and\nevil which Carter seems to love doing. Compare with traditional Fairy Tale morality?]\n\"Wolf-Alice\" (pp.119-126): a feral-child story; Alice is brought up among the wolves\nand returns to humanity reluctantly; the same profound misanthropy we see in other\nstories informs this one: her re-humanisation is imperfect and demeaning. The nuns who\nare looking after her give her up to the Duke, a werewolf, who lives by robbing graves.\nOne night out on the prowl, the villagers shoot him with a silver bullet. The wolf child\nlicks his wound clean and his reflection begins to re-appear in the mirror, presumably\nindicating recovered humanity. Odd, distasteful affair, based on an exploration of what it\nmust be like to slowly and for oneself construct such basic concepts as self and time.\nCarter, Angela. The Bloody Chamber, and Other Stories. Penguin, 1990. (c) Penguin. All rights\nreserved. This content is excluded from our Creative Commons license. For more information,\nsee http://ocw.mit.edu/help/faq-fair-use/.\n\nLooking at the stories as a whole, what emerges? I expect feminist critics may be fairly\noverjoyed; there is a new sense of female agency. But how expressed? Well, the mother\nas the avenger in \"Bluebeard\" comes immediately to mind. In Carter's forest, Grannie\nnot the wolf is the predator. The problem is that in re-working existing tales one is in\nlarge degree constrained by existing parameters, and female victimhood is also present\nhere, although with an unusual degree of joy and complicity, in the sense of \"let-s all\nhave a jolly good wallow in the moral gutter together\"? The main change in terms of\nnarrative is probably in point-of-view; there have been female protagonists before--think\nof Cinderella, Rapunzel, or Little Red Riding Hood, but events were never viewed\nthrough their eyes, it was always an omniscient 3rd person narrative. So this alone\nautomatically confers a heightened sense of agency even if the overall narrative arc\nremains similar (which it doesn't always do).\nAnd, of course, to come to this material straight from Disney is to be reminded how many\nmore demands upon the cultural equipment and intelligence of the consumer this makes\nthan the masscult stuff we've just been watching. The effect of this is to sharpen up\nrather than dumb down, which, as we will recollect, was exactly the point of Dwight\nMacdonald was making in A Theory of Mass Culture. The decadent moral quality [might\nwords like \"corrupt\" and \"depraved\" cover it? Have a root about in your Thesaurus]\nalso contrasts very strongly with the world Disney evokes. How many of these tales\ninvolve some sort of degradation and how does this affect us as readers?\nWD November 2015\n\nCarter, Angela. The Bloody Chamber, and Other Stories. Penguin, 1990. (c) Penguin. All rights\nreserved. This content is excluded from our Creative Commons license. For more information,\nsee http://ocw.mit.edu/help/faq-fair-use/.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.430 / CMS.920 Popular Culture and Narrative: Use and Abuse of the Fairy Tale\nFall 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "21L.430F15 Calvin S. Hall and Vernon J. Nordby, A Primer of Jungian Psychology",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-430-popular-culture-and-narrative-use-and-abuse-of-the-fairy-tale-fall-2015/8d683f2ad53629cf63e809b06be1134a_MIT21L_430F15_CalvinS.pdf",
      "content": "Calvin S. Hall and Vernon J. Nordby, A Primer of Jungian Psychology (New York:\nTaplinger, 1973)\nThe key section is Chapter 2 \"The Structure of Personality\" pp.31-56 This is clear, brief\nand sensible/scholarly (although the gender attitudes now seem very dated) but doesn't\nquite bring out with the force I remember from my own youth the essential fact about the\ncollective unconscious was all this obscure classical stuff that Jung's patients couldn't\npossible have known from personal experience, that led him to posit it, although, to be\nsure, Hall and Nordby do speak--though much less convincingly to my mind--about his\npatients fantasizing and dreaming in terms very similar to old alchemical imagery that\nthey couldn't possible have \"known\" about.\nIn his childhood, Jung is a dreamy, neurotic, solitary; child of a loveless marriage; father\na pastor; in his teens he discovers Schopenhauer, who has a significant effect on his\nthinking. He dreams powerfully, vividly all his life (q.v.), and is much influenced by\nthis; he is interested in seances and spiritualism; sends Freud, whom he greatly admires,\nsome early published work and Freud invites him to Vienna; they meet in 1907; warm\nfriendship and discipleship soon dissolve and they split not long afterwards. \"In more\nnormal people, the unconscious manifested itself most clearly in so-called occult\nphenomena, religious symbolism, mythology, astrology, and dreams.\" Pp.25-6\nA long-running controversy concerning the formation of the human personality underlies\nmuch of this: the debate between those who believe that \"nurture\" (upbringing, stimulus,\nenvironment) plays the key role; and those (much less fashionable) who allot a more\npowerful role to \"nature\", or heredity. (This latter position fell into disrepute largely\nowing to its abuse in Nazi Germany during the 1930s). Jung believed that man is born\nwhole and integrated, and that later psychological difficulties spring from dissociation of\nthat original wholeness. \"The psyche is composed of numerous diversified but interacting\nsystems and levels. Three levels in the psyche can be distinguished. These are\nconsciousness, the personal unconscious, and the collective unconscious. Consciousness\nis the only part of the mind that is known directly by the individual. It appears early in\nlife, probably prior to birth...(p.33) The ego is the name Jung uses for the organization of\nthe conscious mind; it is composed of conscious perceptions, memories, thoughts, and\nfeelings. Although the ego occupies a small portion of the total psyche, it plays the\nvitally important function of gatekeeper to consciousness. Unless the ego acknowledges\nthe presence of an idea, a feeling, a memory, or a perception it cannot be brought into\nawareness. The ego is highly selective. It resembles a distillery; much psychic material\nis fed into it but little comes out or reaches the level of full awareness.\"...(34) \"What\nhappens to the experiences that fail to gain recognition by the ego? They do not\ndisappear from the psyche, for nothing that has been experienced ceases to exist. Instead\nthey are stored in what Jung called the personal unconscious. This level of the mind\nadjoins the ego. It is the receptacle that contains all those psychic activities and contents\nwhich are incongruous with the conscious individuation or function. Or, they were once\nconscious experiences which have been repressed or disregarded for various reasons,\nsuch as a distressing thought, an unsolved problem, a personal conflict, or a moral\nissue...\" (p.35) \"How do complexes originate? At first, under the influence of Freud,\nJung was inclined to believe they had their origin in traumatic experiences in early\nHall, Calvin S., and Vernon J. Nordby. A Primer of Jungian Psychology. Taplinger, Pub. Co, 1973.\n(c) New York: Taplinger, Pub. Co. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\nchildhood. For example, a child might be abruptly separated from his mother, which\ncould give rise to an enduring mother-complex as a compensation for the lost mother.\nJung was not to be satisfied with this explanation for very long. He came to the\nrealization that complexes must originate out of something much deeper in human nature\nthan early childhood experiences. Prompted by curiosity over what this deeper something\nmight be, Jung discovered another level of the psyche, which he called the collective\nunconscious...\" (p.38) [the section on the collective unconscious occupies pp.38-41, and\nthe following section on archetypes, pp.39-43] \"Both the conscious mind and the\nunconscious mind were seen, for the most part, as originating out of experience.\nRepression of traumatic childhood experiences formed the unconscious, according to\nFreud, although he was to modify this view later...In any event, it was Jung who broke\nfree from a strictly environmental determinism of the mind, and showed that evolution\nand heredity provide the blue-prints of the psyche just as they provide the blueprints of\nthe body. The discovery of the collective unconscious was a landmark in the history of\npsychology.\nThe mind, through its physical counterpart, the brain, has inherited characteristics what\ndetermine the ways in which a person will react to life's experiences and even determine\nwhat type of experiences he will have. The mind of man is prefigured by evolution.\nThus, the individual is linked with his past, not only with the past of his infancy but more\nimportantly with the past of the species and before that with the long stretch of organic\nevolution. This placing of the psyche within the evolutionary process was Jung's\npreeminent achievement...First of all, it is that portion of the psyche which can be\ndifferentiated from the personal unconscious by the fact that its existence is not\ndependent upon personal experience The personal unconscious is composed of contents\nthat were once conscious, but the contents of the collective unconscious have never been\nconscious, within the lifetime of the individual.\nThe collective unconscious is a reservoir of latent images, usually called primordial\nimages by Jung...Man inherits these images from his ancestral past, a past that includes\nall of his human ancestors as well as his prehuman or animal ancestors These racial\nimages are not inherited in the sense that a person consciously remembers or has images\nthat his ancestors had. Rather they are predispositions or potentialities for experiencing\nand responding to the world in the same ways that his ancestors did...(p.39)\" They point\nout that unfortunately this is a Lamarckian view (a reference to the famous French thinker\nJean-Baptist Lamarck who argued for the transmissibility of acquired characteristics) but\nthat one can also explain the collective unconscious in orthodox Darwinian terms.\nJung posited numerous archetypes, including \"birth, rebirth, death, power, magic, the\nhero, the child, the trickster, God, the demon, the wise old man, the earth mother, the\ngiant, many natural objects like trees, the sun, the moon, wind, rivers, fire and animals,\nand many man-made objects such as rings and weapons.\" (pp.41-2) These are\npredispositions merely, he insisted, to be fleshed out in contact with direct experience by\neach individual. \"Although archetypes are separate structures in the collective\nunconscious they can form combinations. For example, if the hero archetype combines\nwith the demon archetype, the result could be a 'ruthless leader' type of person...Since\nthe archetypes are capable of interacting with each other in various combinations, this\nHall, Calvin S., and Vernon J. Nordby. A Primer of Jungian Psychology. Taplinger, Pub. Co, 1973.\n(c) New York: Taplinger, Pub. Co. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\nalso becomes a factor in producing personality differences among individuals.\" P.42.\nArchetypes are universal, but this still leaves wide room for individual and cultural\ndifference in the fleshing out of an archetype such as \"mother\".\n\"...it is, in fact, the nucleus of a complex. The archetype, acting as a center or nucleus,\nfunctions as a magnet, attracting relevant experiences to it to form a complex. After\ngaining sufficient strength from the addition of experiences, the complex can penetrate\ninto consciousness. It is only by being the center of a well-developed complex that the\narchetype can find expression in consciousness and behavior.\" P.43 Then we get\ndiscussion of Persona [the constructed social mask], Anima/Animus. The Shadow and the\nSelf are treated as archetypes. The Shadow is the animalistic, destructive, dark Jungian\nequivalent to the Id. Jung considered it, on the other hand, the source of all intuitive\ncreativity. It seems to be being used here in a sense close to \"instinct.\" Although its\npromptings can be thrust temporarily into the unconscious, it never gives up.\nArchetypes express themselves in symbols and in a process which Jung called\n\"amplification\" (very similar to the horizon-of-expectation type general-contextual\napproach we see in the Constance School) may be expounded and interpreted. It's very\nlike lit. crit. of the more ambitious and expansive sort.\nHere's a good bit from Jung himself, writing in 1948 (collected works, 9i, p.253, quoted\nhere on pp;.129-30): \"What have all our cultural achievements led to? The fearful\nanswer is there before our eyes: we have been delivered from no fear, a hideous\nnightmare lies upon the world. So far reason has failed lamentably, and the very thing\nthat everybody wanted to avoid rolls on in ghastly progression. Man has achieved a\nwealth of useful gadgets, but, to offset that, he has torn open the abyss, and what will\nbecome of him now--where can he make a halt? After the last World War we hoped for\nreason; we go on hoping. But already we are fascinated by the possibilities of atomic\nfission and promise ourselves a Golden Age-the surest guarantee that the abomination of\ndesolation will grow to limitless dimensions. And who or what it is that causes all this?\nIt is none other than that harmless (!), ingenious, inventive, and sweetly reasonable\nhuman spirit who unfortunately is abysmally unconscious of the demonism that still\nclings to him. Worse, this spirit does everything to avoid looking himself in the face, and\nwe all help him like mad. Only, heaven preserve us from psychology--that depravity\nmight lead to self-knowledge! Rather let us have wars, for which somebody else is\nalways to blame, nobody seeing that all the world is driven to do just what all the world\nflees from in terror.\"\nHall, Calvin S., and Vernon J. Nordby. A Primer of Jungian Psychology. Taplinger, Pub. Co, 1973.\n(c) New York: Taplinger, Pub. Co. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.430 / CMS.920 Popular Culture and Narrative: Use and Abuse of the Fairy Tale\nFall 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "21L.430F15 Carl G. Jung, Man and His Symbols",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-430-popular-culture-and-narrative-use-and-abuse-of-the-fairy-tale-fall-2015/11dcd0d62f4a0fb6b26b737739b75f9e_MIT21L_430F15_Carl.pdf",
      "content": "Carl G. Jung, M. L. von Franz, Joseph L. Henderson, Jolande Jacobi, Aniela Jaffe, Man\nand his Symbols (New York: Doubleday, 1964)\nThis book sprang from a TV interview with Jung, who was persuaded following it of the\nneed for a popular exposition of his views intended for the general reader. Marie-Louise\nvon Franz of Zurich, author of The Interpretation of Fairy Tales, is identified \"perhaps\nhis closest professional confidante and friend\" p.11.\nAlthough some philosophers deny the unconscious mind, Jung appeals to historical\nrelativism, to the growth of the psyche through time; his is a strongly ethnocentric view,\nholding that developed, Western, people have more sophisticated psyches than\n\"primitive\" peoples, p.24 \"There are historical reasons for this resistance to the idea of\nan unknown part of the human psyche. Consciousness is a very recent acquisition of\nnature, [how can he possibly know?] and it is still in an 'experimental' state. It is frail,\nmenaced by specific dangers, and easily injured. As anthropologists have noted, one of\nthe most common mental derangements that occur among primitive people is what they\ncall 'the loss of a soul'--which means, as the name indicates, a noticeable disruption (or,\nmore technically, a dissociation) of consciousness.\" P.24. Jung talks of primitive folks\nhaving two souls, a resident one and a \"bush soul\" which may inhabit an animal or tree.\nHe credits Freud with the modern realization that dreams are the royal road to accessing\nthe unconscious, and if patients can be induced to free-associate around the dream\nsymbols, they will reveal what is being repressed. Jung thought that dreams told you\nmuch more about the state of the psyche than Freud anticipated, but you had to\nconcentrate on the dream itself and not go spinning off into free-association, and relate it\nto all kinds of other things in the dreamer's life, and it wasn't all about sex. Not all keys,\nwalking sticks, umbrellas, staves, swords and such are phallic symbols.\nThe collective unconscious seems to be a wide penumbra of inherited cultural baggage.\nHe is unable to explain how this happens, but appeals repeatedly to Darwinian parallels:\ni.e. just as we accept that the body evolved from earlier forms, then so, too did the\npsyche, and traces of all earlier forms remain within it, including the archetypes, a kind of\npsycho-cultural node capable of acting independently and of generating meaning by use\nof symbols. He repeatedly stresses that the unconscious is not like the conscious mind,\nand it contains all kinds of stuff not put there by the individual; it is capable of acting\nindependently of conscious intention and will. It communicates with the conscious mind\nthrough dreams. At first blush this certainly sounds rather far-fetched, and very much a\npart of the obsession with the \"primitive' that marked so much of the Modernist impulse\nin the contemporary arts--think of Stravinsky's Rite of Spring, for example, or the folkish\npaintings of Marc Chagal.\nJung's American colleague and follower, Joseph L. Henderson, contributes an essay \"\nAncient myths and modern man\" which gives an account of how the symbolic systems\nseen in \"early\" cultures everywhere, also crop up in the dreams of modern individuals\nwho could have had no possible direct access to them. Henderson expresses clearly the\nJungian idea that the unconscious is full of ancient stuff not put there by its possessor\n(although, like Jung himself, Henderson is not very good at explaining how this might\nhappen): it does seem though that the psyche evolves like the physical frame of man\nhimself, and all kinds of ancient pre-modern stuff remains active within it, providing the\nJung, Carl G., and Marie-Luise von Franz. Man and His Symbols. Doubleday, 1964. (c)\nDoubleday. All rights reserved. This content is excluded from our Creative Commons\nlicense. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\nunconscious with its basic language for communicating with the conscious mind via\ndreams. Henderson's essay occupies pp.104-157, and concentrates on the symbol of the\nhero, apparently similar across a wide range of disparate and non-communicating cultural\nsystems, the common features being prodigious early strength or prowess, like Hercules\nor Davy Crockett (who killed him a bear when he was only three), rescuing damsels in\ndistress, hubris and eventual nemesis. According to Henderson, the occurrence of hero\nfigures in dream sequences has a personal bearing on the life of the dreamer, indicating\nfrequently an unconscious awareness that some vital life stage in the process of\nmaturation has been missed or inadequately passed/resolved. Monsters apparently\nrepresent the devouring aspect of a mother-dependence never successfully outgrown, and\nthe maiden represents the dreamers own, hitherto insufficiently developed anima.\nHenderson is rather old fashioned, even sexist in his (unexamined) view of the relative\nroles of men (dominance, competition, power) and women (motherhood, nurture,\nsubmission). The Jungians surveyed--very superficially--an extensive array of human\ncultures covering vast tracts of time, but seemed quite unaware that the gender\ncharacteristics they took as fundamental and unalterable, might be, in face, highly\ncontext-related and contingent: \"I saw an example of this in a young married woman\nwho did not yet have any children but who intended to have one or two eventually,\nbecause it would be expected of her. Meanwhile her sexual response was unsatisfactory.\nThis worried her and her husband, though they were unable to offer any explanation for\nit. She had graduated with honors from a good women's college and enjoyed a life of\nintellectual companionship with her husband and other men. Although this side of her\nlife went well enough much of the time, she had occasional outbursts of temper and\ntalked in an aggressive fashion that alienated men and gave her an intolerable feeling of\ndissatisfaction with herself. // She had a dream at this time that seemed so important she\nsought professional advice to understand it. She dreamed she was in a line of young\nwomen like herself, and as she looked ahead to where they were going she saw that as\neach came to the head of the line she was decapitated by a guillotine Without any fear\nthe dreamer remained in the line, presumably quite willing to submit to the same\ntreatment when her turn came. // I explained to her that this meant she was ready to give\nup the habit of 'living in her head'; she must learn to free her body to discover its natural\nsexual response and the fulfillment of its biological role in motherhood. The dream\nexpressed this as the need to make a drastic change; she had to sacrifice the 'masculine'\nhero role. // As one might expect, this educated woman had no difficulty in accepting\nthis interpretation at an intellectual level, and she set about trying to change herself into a\nmore submissive kind of woman. She did then improve her love-life and became the\nmother of two very satisfactory children. As she grew to know herself better, she began\nto see that for man (on the masculine-trained mind in women) life is something that has\nto be taken by storm, as an act of the heroic will; but for a woman to feel right about\nherself, life is best realized by a process of awakening. [to inferiority, and gender\nsubordination?] p.137 Henderson goes on to tell how this psychic dilemma is illustrated\nby the Fairy Tale of \"Beauty and the Beast\"; he recounts the tale then says \"In this story,\nif we unravel the symbolism, we are likely to see that Beauty is any young girl or woman\nwho has entered into an emotional bond with her father, no less binding because of its\nspiritual nature. Her goodness is symbolized by her request for a white rose, but in a\nsignificant twist of meaning her unconscious intention puts her father and then herself in\nJung, Carl G., and Marie-Luise von Franz. Man and His Symbols. Doubleday, 1964. (c)\nDoubleday. All rights reserved. This content is excluded from our Creative Commons\nlicense. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\nthe power of a principle that expresses not goodness alone, but cruelty and kindness\ncombined. It is as if she wished to be rescued from a love holding her to an exclusively\nvirtuous and unreal attitude. // By learning to love Beast she awakens to the power of\nhuman love concealed in its animal (and therefore imperfect) but genuinely erotic form.\nPresumably this represents an awakening of her true function of relatedness, enabling her\nto accept the erotic component of her original wish, which had to be repressed because of\na fear of incest. To leave her father she had, as it were, to accept the incest-fear, to allow\nherself to live in its presence in fantasy until she could get to know the animal man and\ndiscover her own true response to it as a woman. // In this way she redeems herself and\nher image of the masculine from the forces of repression, bringing to consciousness her\ncapacity to trust her love as something that combines spirit and nature in the best sense of\nthe words.\" Pp.138-9\nThen follows Marie-Louse von Franz's essay, 'The process of individuation', occupying\npp.158-229 usual stuff about animas and animuses; usual rather arbitrary and strained-\nseeming readings, which we will consider in detail in her book.\n\nJung, Carl G., and Marie-Luise von Franz. Man and His Symbols. Doubleday, 1964. (c)\nDoubleday. All rights reserved. This content is excluded from our Creative Commons\nlicense. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.430 / CMS.920 Popular Culture and Narrative: Use and Abuse of the Fairy Tale\nFall 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "21L.430F15 Christa Kamenetsky, Children’s Literature in Hitler’s Germany - The Cultural Policy of National Socialism",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-430-popular-culture-and-narrative-use-and-abuse-of-the-fairy-tale-fall-2015/27878be1c5b30a9412fd8f237b20885d_MIT21L_430F15_Christa.pdf",
      "content": "Christa Kamenetsky, Children's Literature in Hitler's Germany: The Cultural Policy of\nNational Socialism (Athens: Ohio University Press, 1984)\nPreface begins: \"In children's literature the Nazis perceived one of their most important\ntools for re-educating children in the spirit of National Socialism. They were not\nsatisfied with controlling their behavior merely by drill and discipline but aimed through\nchildren's books at promoting such values that would induce them to internalize the\nNational Socialist ideology and to defend it enthusiastically [...] To that end, they\nengaged thousands of censors, drafted mainly from the members of the National Socialist\nTeachers Association and the Reich Youth Leadership Organization, who would\nsystematically screen every book that was published, sold, loaned, purchased, circulated,\nor discussed. Through school reforms and a reorganization of libraries throughout the\nnation they further institutionalized censorship measures that would separate the books\nthey preferred from those that were to be discarded. By abolishing all civil liberties and\nthe possibilities of open dissent, and by centralizing the vast network of the censorship\napparatus within the general power structure of Party and State, they hoped to reach their\ngoal not within a year or two but certainly in the decades to come. They generally\nreferred to their long-range goals in this regard as the Volkserziehungsprogramm (folk\neducation program)\". p.xiii\nThey tossed out books on the blacklist and sought to fill the empty spaces on the library\nshelves with material which presented Germany and the German people in a positive\nlight: \"To these ends, they gave particular attention to German and Nordic Germanic\nfolklore, because in the inherited values of the past they discovered ideals and traits that\nthey adjusted to their own political purposes. Such remodeled values they hoped to\ndevelop into a mythos appealing to romantic, idealistic and patriotic sentiments, thus\ncreating the impression that Hitler's 'folk state' was firmly rooted in the traditions of the\nNordic Germanic 'ancestors'\". p.xiv\nChildren were exposed to \"an abundance of books dealing exclusively with the German\nand 'Nordic' spheres of interest, [conveying] a distorted view of German and Nordic\nGermanic folklore. At the same time, this policy consciously kept them away from books\npromoting world understanding across racial and national boundary lines.\" p.xiv\n\"When Hitler came to power in 1933, literary standards, along with pedagogical,\npsychological, and universal human perspectives of children's literature had to be\nsacrificed to the 'one and only goal,' the folk state of the Fuhrer. In the name of the\nGerman 'folk community,' the Nazis made children's books into the means toward\nanother end that would perpetuate the power of the Third Reich both at the time and in\nthe future.\" p.xv\nPart 1: Literary Theory and Cultural Policy\nCh 1: The Roots of Children's Folk Literature in Pre-Nazi Germany\nKamenetsky presents a general survey of children's literature in the earlier period. It was\nexactly like that of kids in Britain. I note here that a German edition of Robinson Crusoe\nwas published as early as 1720 and was vastly popular with children. There were lots of\nKamenetsky, Christa. Children's Literature in Hitler's Germany: The Cultural Policy of\nNational Socialism. Ohio University Press, 1984. (c) Ohio University Press. All rights\nreserved. This content is excluded from our Creative Commons license. For more\ninformation, see http://ocw.mit.edu/help/faq-fair-use/.\n\nEnglish language texts in translation: Fennimore Cooper, Mark Twain, Kipling, Dickens,\nDumas, Verne and Lewis Carroll are mentioned here. Uncle Tom's Cabin, too. In folk\nliterature, there was, in addition to the omnipresent Brothers Grimm, a tradition of\nchapbook folktales going back to the middle ages called Volksbucher which told of\neverybody from Dr. Faustus to Reynard the Fox. P.4 [Note, Kamenetsky seems to think\nthat the Grimms actually collected from the folk].\n\"The Nazis glorified Herder, the Brothers Grimm, and the Romantic movement as a\nwhole, but mainly for their contributions to the discovery of the 'healthy folk reality'--\nnot for their discovery of free imagination [...] Even in singling out Herder and the\nBrothers Grimm for their 'positive' contributions to the growth of the German nation, as\nthey put it, they would selectively emphasize their collections of national folklore while\nthey would ignore their contributions to comparative folklore and literature as well as to\ninternational understanding\". p.5\nHere's a useful phrase from Herder, Urpoesie (primeval poetry), p.5 Of Herder: \"His\nStimme der Volker (Voice of the Nations) contained authentic folk songs from a great\nnumber of nations, including the American Indians, and its preface supported the idea\nthat, originally, all nations had sung with 'one voice' to honor God who had endowed\neach one of them with an equal share of love. As a true Christian, Herder believed that\neach nation, like every individual, was equal and unique before God and that it was\nequipped with a 'folk soul.' To recapture this soul, he said, which civilization had\npartially buried, it was necessary that each nation should collect the folk songs, myths,\nfolktales and legends of the past, for in these was still living the naive and pure spirit of\nancient times\". p.5\n\"The Brothers Grimm shared Herder's concept of the Urpoesie, which they renamed\nNaturpoesie (nature poetry). In respecting this theory of its common origin, they kept\nalive their vital interest in the folktales of other lands. Folklorists from the Scandinavian\ncountries [...] corresponded with them over many years, and so did folklore scholars\nfrom England, Scotland, Ireland, Russia, and Serbia, to name just a few. The Brothers\ntraveled to various foreign countries, and in turn, they received many visitors from\nforeign lands\". p.5 The bottom line is that \"the poetic and scholarly contributions of the\nBrothers Grimm to international and cross-cultural studies are quite remarkable...\" p.6\nNazi theorists explicitly claimed \"that Nazism was rooted in the heritage of Herder and\nthe German Romantic movement\" p.6 The basis of a \"folk\" state was worked out by\nHeinrich Wilhelm Riehl: \"For the industrial worker he developed a plan that was to\ntransform him into a member of the folk community: he was to receive a small piece of\nland that he was expected to cultivate in his free time. Riehl thought that in this way he\nwould not only strengthen his communion with the soil but also with the people of the\npeasant community. Within this community he would recapture what he had lost as a\nresult of civilization: his creative self, his individuality.\" P.7 There was much\nglorification of the German peasant during the 19th century as the true heart of the nation\nand as perhaps its ultimate salvation. By 1900 some conservative intellectuals\n(Kamenetsky tells you who on p.9) were already speaking of \"decadent literature\" in\nassociation with \"undesirable cosmopolitan, liberal and Jewish influences\".\nKamenetsky, Christa. Children's Literature in Hitler's Germany: The Cultural Policy of\nNational Socialism. Ohio University Press, 1984. (c) Ohio University Press. All rights\nreserved. This content is excluded from our Creative Commons license. For more\ninformation, see http://ocw.mit.edu/help/faq-fair-use/.\n\nHitler said \"Either we will be a peasant Reich, or we will not be at all!\" p.10 In the\neducational debates of the first third of the 20th century, the internationalists and\nhumanitarians and aestheticians lost the argument to Volkish critics who said that\nbuilding a patriotic love of country should be at the forefront of school fiction, and that\nthe curriculum should be dominated by German folktales, myths and legends and ballads.\nThis allowed the Nazis to claim that they were merely continuing a \"natural\" trend. All\nmanner of nationalistic groups active in the 20s, including the Thule Society which used\nthe swastika as its emblem and was very enthusiastic about Nordic Germanicism. P.18\n\"many of these apparently innocent interests in nature and the outdoors, in storytelling,\nfolk singing, and solstice celebrations (in the old Nordic Germanic style) we shall\nrediscover a few decades later in the Hitler Youth program.\" p.20. \"The Nazis were\nquick to seize upon these ideas for their own purposes. In the Wandervogel movement\nand the [back to the land mystic peasant style] Artamanen movement they perceived\nperfect examples of how German and Nordic Germanic folklore could be applied to\nfestivals and rituals in such a way as to enhance the 'feeling for community'--something\ntoward which they aspired through their 'folk education' program.\" p.21 All these pre-\nexisting youth organizations were swallowed up in the Hitler Youth. \"By 1939, the\nHitler Youth Organization was the only youth organization left, and about seven million\nchildren and youths were forced to march, sing, and celebrate according to the same\nblueprints. By that time, some of the activities had already lost their popularity, mainly\nbecause they were no longer based on a freedom of choice and because attendance had\nbecome mandatory nation-wide.\" p.22 \"With the rise of Nazism a didacticism was\nimposed upon children's literature for which there was also no equivalent in the past.\nThe didactic trends of earlier times had served at least the moral and religious instruction\nof the individual child, but now literature and the child were both placed at the service of\nthe State\". p.23 And many people who had been through these earlier less-political\nculturally more diverse and outward-looking organizations were willing to accept\ncensorship, for example, as a temporary measure on the way towards achieving German\ncultural unity.\nChapter 2: From Book Burning Toward Gleichschaltung\nIn the spring of 1933 the German Student Association issued a demand that German\nuniversities should exhibit greater 'responsibility' towards the German race, German\nlanguage and German literature; weeks later they demanded that all 'un-German' books\nbe removed from the libraries. Not long after that, book burning began \"in the public\nsquares of numerous German cities\" p.31 It was students who did the burning.\nInterestingly, amongst the writers accused of \"decadence, moral decay, sloppy thinking,\npolitical treason, and eroticism\" was Sigmund Freud. p.32 There's a marvelous 'catch-\nall' phrase here, used to denounce anything the Party disliked: \"lack of respect for the\nGerman folk soul\". p.32\n\"The recommendations followed the same order. The first student praised the idea of the\nGerman folk community which from then on literature should portray in idealistic terms.\nThe second one demanded that books be faithful to the German people and the state. The\nthird requested of literature that it portray the 'nobility of the German soul,' and the\nfourth reminded all German authors that their works should reveal respect for German\nKamenetsky, Christa. Children's Literature in Hitler's Germany: The Cultural Policy of\nNational Socialism. Ohio University Press, 1984. (c) Ohio University Press. All rights\nreserved. This content is excluded from our Creative Commons license. For more\ninformation, see http://ocw.mit.edu/help/faq-fair-use/.\n\nhistory, the spirit of the ancestors, and the spirit of the past. Others still referred to the\nnecessity of promoting a type of literature that would show reverence for the German folk\nspirit by concerning itself with the love of home and nation, a search for the \"roots\" of\nGerman national identity, with native folklore and history, and a respect for \"honesty and\ntruth\". As such, it should be the goal of all literature to serve the German folk\ncommunity rather than to express the \"selfish\" interests of its authors. The ceremonies\ntook place at night, illuminated by dramatic torchlight processions and accompanied by\nmarching bands of the military and police. Singing and cheerleading further dramatized\nthe events which neither the public nor the press could overlook\". p.33\n\"After the burning of the Reichstag in Berlin, Goering proceeded to arrest thousands of\nCommunist suspects all over Germany. In the name of the State, he had armed the\nregular police force, adding to it 25,000 S.A. men and 20,000 S.S. men, which during the\nelection days in Berlin alone arrested 5,000 persons. Only two days after the Reichstag\nincident, Hitler suspended all normal civil liberties guaranteed by the Constitution while\nturning the Secret Service into an instrument of terror. This meant that Germans were\ndenied freedom of speech and of the press, the freedom to gather in groups, as well as the\nfreedom of privacy regarding mail, telegrams, and telephone calls. Anyone who acted\nsuspiciously or was overheard saying something against the Nazi Regime could be\narrested and detained without trial. Even before this time, the Party would send its agents\nto public lectures and gatherings of groups, and it was known to have dispersed meetings\nwhen speakers uttered even some harmless jokes at the expense of the Party. Intellectuals\nexperienced harassment if they were suspected of dissent, and as early as May, 1933\nthere were arrests, imprisonments and reported mistreatments of those who disagreed\nopenly with the Party's policy. During the year 1933 a total of 1,684 academics lost\ntheir jobs...\" p.34\n\"Simultaneously with the Nazis' purge of academics and intellectuals there occurred\nthe \"cleansing\" of the libraries and school libraries. Party and State authorities followed\nup the public book burning ceremonies so thoroughly that the public no longer was held\nin doubt who had instigated the \"book purge\" in the first place. In Bonn alone 20,000\nbooks were thrown into the flames. In Berlin 70,000 tones of books were removed from\nthe libraries...It is estimated that in this process about one-third of all library holdings in\nGermany was destroyed...Whatever the authorities considered as 'folk-alien' or\n'decadent,' whatever appeared to promote the spirit of Bolshevism, liberalism or\ninternationalism, or whatever had been written by Jewish authors was condemned to go\nto the incinerator, the public bonfire or the scrap paper collection...eventually it was\nstabilized within the context of a gigantic censorship apparatus of Party and State\nauthorities that screened every book that was printed, sold, purchased or circulated [....]\nThe frequent references of the Nazi ideologists and Hitler himself to such concepts as the\n'folk spirit,' the 'folk soul,' the 'folk tradition,' and the 'folk community' harkened back\nto earlier times when Herder, Grimm, Jahn and Arndt...had appealed to the German\npeople to unite in their quest for unity and German ethnic identity\". pp.34-5\n\"...it was not clear to many educators...that Hitler actually was out to reverse the\nRomantic concept of the Volk [...] In contrast to the Romantic concept, the Nazis'\nconcept no longer stood for diversity within unity, but it implied a uniformity that made\nKamenetsky, Christa. Children's Literature in Hitler's Germany: The Cultural Policy of\nNational Socialism. Ohio University Press, 1984. (c) Ohio University Press. All rights\nreserved. This content is excluded from our Creative Commons license. For more\ninformation, see http://ocw.mit.edu/help/faq-fair-use/.\n\nno allowance for individual differences. By abolishing the opposition and by leveling the\n'subjective element,' the Nazis hoped to form a society that was totally committed to the\nFuhrer and the National Socialist ideology.\nAccording to Meinecke, Hitler seized upon the idea of the 'folk community' for two\nparticular reasons: to get rid of the class-egotistical nationalism promoted by the heavy\nindustry patrons of the bourgeoisie and to overtrump the Marxism of the Russian\nBolshevists...When Rosenberg as the Nazis' chief ideologist, announced that the\nNational Socialist Cultural Community had set as its ultimate goal the revival of the\nGerman folk culture, this appeal sounded like an echo of Romantic thought and found a\nsympathetic reception by the German population who welcomed the idea of a cultural\nrenewal on the basis of native folklore and the Nordic Germanic folk heritage\". p.37\n\"...all of children's literature during the Third Reich was subordinated to the Nazi's\nVolkish ideology...\" p.38 \"The Nazis' definition of ideological goals echoed the\nRomantic quest for an 'organic' unity and a metaphysical 'totality,' although the new\ncontext changed its meaning to a 'total sacrifice' of the individual to the state and a denial\nof existence of the individual outside of the folk community. According to Dr. Gross,\nDirector of the Racial-Political Office, the system of liberalism had created an\n'individualistic society' that was basically 'unfree' in spirit. In order to regain his true\nfreedom, he said, every individual should sacrifice his desires and goals entirely to the\nState.\" p.39\n\"Like most of the Nazi ideologists, Gross appealed to the spirit of altruism and idealism\nwhen he spoke about the individual's contributions to the folk community: 'The human\nbeing no longer is a separate entity all by himself...Born into the community of his\npeople he will feel the bond of the blood, and he will consider it the ultimate goal of his\nlife to contribute his very best to the prosperity and preservation of this larger unit. Thus,\nit should come quite naturally to him that the meaning of his life no longer is bound up\nwith his own small ego but with the community of his folk to whom he owes his life. His\nfate is inseparably linked with the destiny of his people.'\" p.40 'While contemplating the\nNazi slogan 'Gemeinnutz geht uber Eigennuts!' (The Welfare of the Community has\nPriority over the Welfare of the Individual!), the literary critic Langenbucher explained\nthat life in the folk community was the only life style that would guarantee to a person a\n\"higher existence\"'. p.40 A lot of people were swayed by this: \"Only to the more\ndiscriminating minds it was evident from the very start that the Nazis' concepts of folk,\ncommunity and personality actually stood in direct opposition to the Western\nhumanitarian and democratic traditions; that unity for the Nazis meant uniformity, and\nthat freedom implied slavery within a totalitarian system of controls.\" p.44 \"As children's\nliterature and folklore were the very media through which the Nazis hoped to shape the\n'attitudes' of the youngest members of the German folk community toward the Third\nReich, these subjects offer a unique testing ground for their methods of indoctrination and\ntheir subsequent perversion of traditional humanitarian values.\" p.45\n\"To be sure [...] children's literature would be interpreted in the proper manner, the Party\nand State censorship authorities would issue detailed 'guidelines' for teachers, librarians\nand youth leaders. In addition, all editors of folklore journals and literature journals were\nplaced under pressure to follow the National Socialist ideology in the interpretation and\nKamenetsky, Christa. Children's Literature in Hitler's Germany: The Cultural Policy of\nNational Socialism. Ohio University Press, 1984. (c) Ohio University Press. All rights\nreserved. This content is excluded from our Creative Commons license. For more\ninformation, see http://ocw.mit.edu/help/faq-fair-use/.\n\ncriticism of every article or book review published. Those who did not follow this\ndemand were denied paper for printing or were ordered to stop publishing altogether.\nWhat we today plainly call 'censorship,' the Nazis expressed as 'cultural guidance.'\"\nP.52\n\"Hans Friedrich Blunck, President of the Reich Literature Chamber, used the gentle\nsimile of a gardener's job to explain the task that Goebbels had assigned to him. He said\nthat the State authorities would have to 'pull out all of the weeds' from the 'healthy bed\nof flowers,' very much like a gardener who truly cared about his plants. If left untended,\nthe weeds would choke the young plants and stifle growth and development. 'Thus,' he\nconcluded, 'the State has the right to choose and select from among the literary creations\nand the authors according to its own will and desire. It has the right to do so--and it has\nalways made use of this right--in order to counteract those movements that have a\ntendency to lead to the disintegration of German culture.\" p.52\n\"During the national conference in 1937, the National Socialist Teachers Association\nfinally agreed to set up definite guidelines for the removal of 'un-Volkish' literature and\nto implement these without delay. The ten points listed covered most aspects of the\nNazis' censorship theory. Significantly, the first one referred to the need of removing\nbooks that supposedly contradicted the 'Nordic Germanic attitude.' According to the\nattached explanation, this applied to works portraying unheroic characters, pacifistic\nthemes, or certain 'weaknesses' in German history. Implied in this statement was a\nsimultaneous promotion of books dwelling on heroic themes and a 'positive' world view.\nThe second point concerned unwanted literature as far as the 'wrong attitude toward\nJews' and the racial question were concerned. It referred quite explicitly to books which\nportrayed Jews as 'noble protagonists' but Germans as 'treacherous villains.' Such\nthemes were not to be tolerated, it said, nor others that presented a cooperation among\ndifferent races or interracial marriages in a favorable light. The next following point, too,\nspoke against books depicting the ideals of the brotherhood of man across racial\nlines...The most drastic National Socialist censorship principles were those which were\ndirected against works written by Jews or by persons who, for one reason or another, had\nexpressed a dissenting view in regard to the Nazi Regime.\" p.53\n\"The question then arises as to what exactly children's books were expected to\naccomplish within the new context of German folk education. During the early stages of\nthe Nazi regime, it was Hans Maurer, editor of one of the first bibliographical guides to\nVolkish literature for children and youth, who also gave one of the first definitions of its\ntasks. On behalf of the Hitler Youth Organization and the Reich Youth Library in Berlin,\nhe defined the new goals of Volkish literature as follows:\nWe expect of good books that they will:\n1.\nArouse among children an enthusiasm for the heroes of sagas, legends and\nhistory, for the soldiers of the great wars, the Fuhrer and the New Germany,\nso as to strengthen their love of the fatherland and give them new ideals to\nlive by.\n2.\nShow the beauty of the German landscape.\nKamenetsky, Christa. Children's Literature in Hitler's Germany: The Cultural Policy of\nNational Socialism. Ohio University Press, 1984. (c) Ohio University Press. All rights\nreserved. This content is excluded from our Creative Commons license. For more\ninformation, see http://ocw.mit.edu/help/faq-fair-use/.\n\n3.\nFocus on the fate of children of German ethnic groups living abroad and\nemphasize their yearning for the Reich.\n4.\nDeal with the love of nature and promote nature crafts.\n5.\nRelate old German myths, folktales and legends, in a language reflecting the\noriginal folk tradition as closely as possible.\n6.\nGive practical advise and help to the Hitler Youth, both in relation to\nrecreational programs and camp activities.\" pp.55-56\n\"The major emphasis in this definition [a later and more explicit version of the one\nquoted above which contained a formally warmongering and racist element] of the role of\nchildren's literature lies in its needed support of the German 'fighting spirit.' In that\nsense, children's books, like all literature, represented an ideological 'weapon' for the\nNazis to establish the principle that the present was a direct continuation of the past, and\nthat National Socialism demanded the same type of heroism as the Nordic Germanic\n'ancestors' had required. In the spirit of Norse mythology and the sagas, this implied a\ndefiant attitude toward fate and a spirit of 'action' rather than of resignation. Throughout\nthe Nazi period, the Nordic heroes were put up as ideal models for children and youth.\"\np.58\n\"The Nazis did not really wish to sell a finished product but hoped to stimulate by\n'symbolic literature' the continuous process of folk education that would turn German\nchildren and youth into a homogeneous community of 'true believers.' Writers who\ndwelt upon the theme of human suffering, or on deplorable social conditions and\noppressive circumstances were condemned as 'degenerates'. \" p.59.\n\"One leading educationist, once seemingly liberal, could write by the later thirties that 'It\nis the highest goal of political education to develop in the individual the feeling that he is\nan integral part of the racial folk community, and that he lives his life accordingly.\" p.65\nPart II The Interpretation of Children's Literature\nChapter 4 Folktale, Germandom, and Race\nThis has been posted as a separate document to the course site. A summary follows:\n\"The German folktale gained significantly in status and popularity during the National\nSocialist Regime, as the Party promoted it actively within the context of German folk\neducation. A Party official put it quite plainly in 1935: 'The German folktale shall\nbecome a most valuable means for us in the racial and political education of the young.'\nTo the already fairly large German folktale collections in the libraries the Nazis added a\ngreat number of new publications early in the thirties, and the markets were flooded with\nseries of paperbacks promoting the German folk heritage. The schools, too, officially\nsupported the trend by paying close attention to the German folktale at all levels of\neducation.\" p.70 Kamenetsky says that it was Nordic Germanic folktale that was twisted\nto present an image of German ethnic superiority, and that the tales of the Grimms the\nNazis rather left alone. Numerous other online sources, although less trustworthy, say\nthat versions of Red Riding Hood were used by the Nazis (including a film version with\nLittle Red Riding Hood in a fetching swastika motif cloak) to portray German youth\nmenaced by the Jewish wolf.\nKamenetsky, Christa. Children's Literature in Hitler's Germany: The Cultural Policy of\nNational Socialism. Ohio University Press, 1984. (c) Ohio University Press. All rights\nreserved. This content is excluded from our Creative Commons license. For more\ninformation, see http://ocw.mit.edu/help/faq-fair-use/.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.430 / CMS.920 Popular Culture and Narrative: Use and Abuse of the Fairy Tale\nFall 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "21L.430F15 Jack Zipes, Irresistable Fairy Tale",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-430-popular-culture-and-narrative-use-and-abuse-of-the-fairy-tale-fall-2015/113fdb2da4355e6f82082026b1b8618e_MIT21L_430F15_JackZipes.pdf",
      "content": "Jack Zipes, The Irresistible Fairy Tale The Cultural and Social History of a Genre\n(Princeton and Oxford: Princeton University Press, 2012)\n\nOpens with speculative passage on dawn of language and co-terminous rise of the\nstory, viewing latter in terms of power, as a means of dealing with and controlling\nthe world: \"Fairy tales are informed by a human disposition to action---to transform\nthe world and make it more adaptable to human needs, while we also try to change\nand make ourselves fit for the world. Therefore, the focus of fairy tales, whether\noral, written, or cinematic, has always been on finding magical instruments,\nextraordinary technologies, or powerful people and animals that will enable\nprotagonists to transform themselves along with their environment, making it more\nsuitable for living in peace and contentment. Fairy tales begin with conflict because\nwe all begin our lives with conflict. We are all misfit for the world, and somehow we\nmust fit in, fit in with other people, and thus we must invent or find the means\nthrough communication to satisfy as well as resolve conflicting desires and\ninstincts.' p.2\nZipes distinguishes between the two basic sorts of tale, the oral, or \"wonder tales\"\n(in Propp's term), and the written or printed corpus. Both sorts are still current in\nthe world today. He says it is too complicated to attempt a useful definition of the\ntwo types and refers the reader to Antti Aarne and Stith Thompson's classic tale\ntype and motif indices, and his own Oxford Companion to Fairy Tales (Oxford, 2000).\n\"In fact, together, oral and literary tales form one immense and complex genre\nbecause they re inextricably dependent on one another\". p.3\n\n\"If it is through language and story that cognition is fostered, it is all that much\nmore important that we see the connections between ancient stories and how as\nwell as why we continue to repeat them in innovative ways. Though we do not have\nprinted records of how people told stories thousands of years ago, we do have\nenough archeological evidence through cave paintings, vases, tombs, carvings,\ncodices, and other artifacts to enable us to grasp what kinds of stories were told in\nancient pagan cultures.' p.7\n\"Almost all cultures have cannibalistic ogres and giants or dragons and monsters\nthat threaten a community. Almost all cultures have tales in which a protagonist\ngoes on a quest to combat a ferocious savage. The quest or combat tale is\nundertaken in the name of civilization or humanity against the forces of voracity or\nuncontrolled appetite.\" p.8\n\"As Bartolomeo Rosetti indicates in his [,,,] introduction to Straparola's Le piacevoli\nnotti, \"The writers of Italian stories, beginning with [...]Boccaccio's Decameron, [...]\ndrew fully from the Oriental fairy tales, and we could also say, directly from the\ncommercial and cultural exchanges with the Orient that had been conducted for\ncenturies with the Italian coastal republics, above all with Venice. The continual\nflow of fairy-tale elements characteristic of the Orient and Arabic culture in\nparticular fortuitously enriched the body of Italian story writing in this way\". p.14\nAs [Donald Haas] remarks \"Despite its currency and apparent simplicity, the term\n'fairy tale' resists a universally accepted or universally satisfying definition. For\nZipes, Jack. The Irresistible Fairy Tale: The Cultural and Social History of a Genre. Princeton\nUniversity Press, 2012. (c) Princeton University Press. All rights reserved. This content is\nexcluded from our Creative Commons license. For more information, see\nhttp://ocw.mit.edu/help/faq-fair-use/.\n\nsome, the term denotes a specific narrative form with easily identified\ncharacteristics, but for others it suggests not a singular genre but an umbrella\ncategory under which a variety of other forms may be grouped. Definitions of 'fairy\ntale' often tend to include a litany of characteristics to account for the fact the term\nhas been applied to stories as diverse as 'Cinderella', 'Little Red Riding Hood',\n'Hansel and Gretel,' 'Jack and the Beanstalk,' 'Lucky Hand', 'Bluebeard', and 'Henny-\nPenny'\". p.22\nZipes continues \"storytellers and writers never used the term 'fairy tale' until\nd'Aulnoy coined it in 1697 [...] it was not until 1750 that the term [...] came into\ncommon English usage [...]\" p.22 He goes on to look at the long oral and literate\ntradition of fairy lore in French culture. He sees the genre as the creation of\naristocratic Frenchwomen writing in the later 17th and early 18th century, in a coded\nprotest against the inequalities of the patriarchal order of the ancien regime. pp.24-5\nA deeply feminized world with strong influence from opera and ballet, p.26, and the\nfairies acting as \"magical midwives\" p.37\nWe learn that the fairies are survivals of classical deities, and testimony to a strand\nof underlying paganism that the church could never quite eradicate. He describes\nd'Alene's work as \"protofeminist\" p.34\nZipes severely criticizes Disney for his trivialization of character, dilution of inter-\ngenerational rivalry, and sexist male-orientated view of women: \"to return to the\nwitch in the inane Disney film, we can see that the movie departs from the folk and\nliterary tradition, and that the witch/bitch is portrayed as one-dimensionally evil.\nFollowing what Walt Disney did in his first animated feature film, Snow White and\nthe Seven Dwarfs (1936), his 'modern' corporation has followed suit by creating in\nTangled an aging woman who will deceive and destroy just to remain beautiful. She\nis the pure incarnation of evil, [unlike, say, Baba Yaga, who can bless as well as\ncurse] and there is not just reason why she wants to kidnap Rapunzel except to\nfurther her narcissistic desires. Obsessed with beauty and her [sic] own desires, the\nDisney witches are stereotypical produces of the Western male gaze and mass-\nmediated manipulation of the images of women that date back to the Christian\nchurch's demonization of women.\" p.78\n\"Witches and fairies are not the only significant female characters in fairy tales. In\nfact, beautiful innocent maidens may be more important, but in the hands of male\ntellers, writers, and collectors, they tend to be depicted as helpless, if not passive.\nTo be good, they must be obedient and industrious. The overwhelming number of\noral and literary fairy tales up through the nineteenth century usually stereotype\nthe young heroine, but this is not due to the demonization of women as deviants [...]\nIt is because of a more general patriarchal view of women as domestics and\nbreeders, born to serve the interests of men.\" p.80 He asserts that in the women's\ntradition, of which he produces several examples culled from forgotten collections\nmade and published by women, the female protagonists are much more assertive,\nconfident and courageous. He quotes examples from the editions of female writers\nlike Gonzenbach, Levesque, Busk, and Nemcova, which, despite the feminist revival\nof the last third of the 20th century, continue to be overlooked.\nZipes, Jack. The Irresistible Fairy Tale: The Cultural and Social History of a Genre. Princeton\nUniversity Press, 2012. (c) Princeton University Press. All rights reserved. This content is\nexcluded from our Creative Commons license. For more information, see\nhttp://ocw.mit.edu/help/faq-fair-use/.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.430 / CMS.920 Popular Culture and Narrative: Use and Abuse of the Fairy Tale\nFall 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "21L.430F15 Jack Zipes, The Enchanted Screen—The Unknown History of Fairy-Tale Films",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-430-popular-culture-and-narrative-use-and-abuse-of-the-fairy-tale-fall-2015/777fe7c7c2406afc96e5aa6fc1c9aec2_MIT21L_430F15_TheEnchanted.pdf",
      "content": "Jack Zipes, The Enchanted Screen--The Unknown History of Fairy-Tale Films (New\nYork: Rutledge, 2011)\nThe chapter \"De-Disneyfying Disney: Notes on the Development of the Fairy-Tale Film\"\npp.16-29\nOpens with a long quote from Richard Schickel, The Disney Version The Life, Times, Art\nand Commerce of Walt Disney (New York, 1968): \"Indeed, there was something arrogant\nabout the way the studio took over these works [Alice in Wonderland and Peter Pan].\nGrist for a mighty mill, they were in the ineffable Hollywood term, 'properties' to do\nwith as the proprietor of the machine would. You could throw jarring popular songs into\nthe brew, would could gag them up, you could sentimentalize them. You had, in short,\nno obligation to the originals or to the cultural tradition they represented. In fact, when it\ncame to billing, J. M. Barrie's Peter Pan somehow became Walt Disney's Peter Pan, and\nLewis Carroll's Alice became Walt Disney's Alice. It could be argued that this was a true\nreflection of what happened to the works in the process of getting to the screen, but the\negotism that insists on making another man's work your own through wanton tampering\nand by advertising claims is not an attractive form of egotism, however it is rationalized.\nAnd this kind of annexation was to be a constant in the later life of Disney. The only\ndefense that one can enter for him is that of invincible ignorance: he really didn't see\nwhat he was doing, didn't know how some people could be offended by it, and certainly\ncould not see what was basically at fault with his insistence that there was only one true\nstyle for the animated film--his style.\" P.16\nThen we get a brief history of illustrations for fairy tale books, and the earliest movie and\nanimated versions, showing the background to Disney, the story being that the\nillustrations to the book versions were incidental, but that in Disney the image eventually\ncame to gobble up the word.\n\"Let us examine Disney's earliest animated feature fairy-tale film, Snow White and the\nSeven Dwarfs, and a later one, Beauty and the Beast, as examples. Each film is framed\nby a prince on a quest for the proper mate, essentially a young virginal woman, a trophy\nprincess, who will serve his vested interests, and the quest ends with a marriage in a\nsplendid castle, in which the prince and princess will be attended by admiring if not\nobsequious servants. The manner in which the prince attains the goal depends on the\ncollaboration of the underlings, the dwarfs and enchanted objects, and the ingenuity and\nvalor of this sympathetic prince. Songs are strewed along the plot as flowers to enliven\nand brighten the action, just as comic gags are used to divert us from the serious nature of\nthe business at hand--ruthless competition for power. But everyone knows his or her\nrole, and these roles are all geared to guaranteeing the happiness of their heroes,\nseemingly born to lead, take power, and to be admired, as fetishist objects. They will\neventually reside in a palace, a utopian realm that few people are privileged to inhabit,\nunless you are one of the chosen servants. The goal is not only a reconciliation of\nconflict and the defeat of evil, but also acclamation of those who deserve to rule by those\nwho deserve to serve.\" P.24\n\"Disney...divided his workers into separate groups and departments who often worked\nside by side at desks, as though they operated mechanically serving a conveyor belt in a\nZipes, Jack. The Enchanted Screen: The Unknown History of Fair-Tale Films. Routledge, 2011.\n(c) Routledge. All rights reserved. This content is excluded from our Creative Commons license.\nFor more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\nfactory. They were organized according to their functions: cell painters, animators,\nmusicians, gag men, storyboard producers, and directors. After 1935 Disney did not do\nanimating, composing, or screenplay writing and worked out of his own personal office.\nHowever, he supervised almost every film, large and small, and his decision was the final\ndecision for almost all the early productions. To his credit, he sought out the very best\ncollaborators and rarely stinted when it came to improving the technical quality of his\nproductions...Most of all, he conceived many of the ideas behind the films and decided\nwhat project would move forward and which collaborators would work on a particular\nproject...it was a shared spectacular vision of efficiency, exploitation, and expediency:\nhow best to use a story to promote one's artistic talents, make money, market oneself, and\npromote a vision of how social relations should be ordered. The contents and history of\nthe fairy tale were only a pre-text, that is, they provided the materials to be appropriated\nand adapted for production purposes that served market ends. Behind such purposes, of\ncourse, was an ideology commensurate with the capitalist mode of production and\ncommodity fetishism that was intended to shape the vision of audiences so that they\nwould want to see and consume more of the same.\" P.24\nThe basis of the charge against Disney, although Zipes never articulates it clearly, is the\nMarxist one frequently leveled against middleclass novelists, that in seeming to resolve\nthe conflicts in their works, they are complicit in papering over deep-lying inequalities\nand divisions in capitalist society, a kind of trahison des clercs--or \"betrayal of the\nintellectuals\". [Echoes here of Dwight Macdonald's Theory of Mass Culture, perhaps?]\nZipes quotes Czech filmmaker Jan Svanmajer on Disney: \"Disney is among the greatest\nmakers of 'art of children'. I have always held that no special art for children simply\nexists, and what passes for it embodies either the birch (discipline) or lucre (profit). 'Art\nof children' is dangerous in that it shares either in the taming of the child's soul or the\nbringing up of consumers of mass culture. I am afraid that a child reared on current\nDisney produce will find it difficult to get used to more sophisticated kinds of art, and\nwill assume his/her place in the ranks of viewers of idiotic television serials.\" Quoted on\np.25 Another commentator talks of \"banal, routine images of Disney's films. They are\nthe bankrupt signs of an imagination homogenized by the mass media.\" P.25\nZipes comments on \"the totalitarian message that almost all the Disney films have\nconveyed since their origin: the role of the peasants or little people is to help to reinstall\nkings, emperors, queens, princesses, and other celebrities so that they can rule more\ngraciously But rule they must and should.\" P.30\n\"...Sleeping Beauty (1959), as one of the last fairy-tale films he produced before his\ndeath in 1966, it is one of the best examples of how he and his huge staff of artists and\nmusicians conventionalized the adaptation of fairy tales so that they became hollow and\nfluffy narratives and discredited original thinking, that is, the need to rethink the deeper\nmeanings of the tales and their actual value for suggesting social if not artistic change.\nThe credits listed at the beginning of the film state that it is a 'story adaptation from the\nCharles Perrault version of Sleeping Beauty'. Nothing could be further from the truth,\nand Perrault would probably turn over in his eighteenth-century grave if he were to read\nthis...\nZipes, Jack. The Enchanted Screen: The Unknown History of Fair-Tale Films. Routledge, 2011.\n(c) Routledge. All rights reserved. This content is excluded from our Creative Commons license.\nFor more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\nMore prudish than Perrault, the Brothers Grimm wrote a very short, comic version of '\nSleeping Beauty' that has no illicit affairs or violence. The princess and the castle are\nsent into hibernation for a hundred years, frozen until the right prince comes along.\nWhen he does, he gives the sleeping virgin a chaste kiss. She awakens, and with her, all\nthe people in the castle. Prince and princess marry and live happily ever after. Basta. It\nis a boring fairy tale.\nAnd so is the Disney film. It flattens the literary tradition and transforms a classical\nfairy-tale about an unusually complex love affair that in the course of a few centuries has\ninvolved rape, adultery, illicit love, jealousy and matricide into a banal adolescent love\nstory in which a stereotypical nice-guy prince on a white horse rescues a pure blonde\nprincess who awaits his blessed kiss while lying flat on her back...rendition is so stale,\nstiff and stupid...\nThis recipe is easy to repeat, imitate, and digest.\n1) Begin the film in the first frame with a beautiful gilded book that opens elegantly\nand a master voiceover as authoritative storyteller and made it seem as though the\ncharming images represent a veritable fairy tale.\n2) Add music of acclamation with brilliant lyrics such as 'hail to the king, hail to the\nqueen', and a glittering or stately castle.\n3) Introduce three pudgy fairies to bless a new-born princess. Make sure they are\ncute.\n4) Threaten the bliss and the stability of the monarchy, and make sure that the\nthreatening figure is an angry female called Malificent, is dressed in black, and\nhas a raven as her crony.\n5) Let the comic characters such as dwarfs, animals, or pudgy fairies provide a bit of\nfrivolous relief.\n6) Arrange a prince-meet-princess encounter and have the couple fall suddenly in\nlove in the middle of the forest. Let the girl sing a catchy song, 'Once upon a\nDream', that recalls Snow White's 'One Day My Prince Will Come'. Have her\nsing a duet with the prince and then dance to a musical score of Peter Ilyich\nTchaikovsky's ballet, The Sleeping Beauty. Make sure that they don't know each\nother's identity.\n7) Throw in some irrelevant comic scenes such as two kings and a jester drinking\nand arguing about their children. Paint them as harmless daddies, not kings, who\ndote on their children and act more like buffoons than kings.\n8) Make it appear that the princess is doomed by the witch's curse when she is lured\nto a spinning wheel.\n9) Add a little drama by having the witch capture the guileless prince and take him\nto a dungeon in the Forbidden Mountain.\n10) Let the pudgy fairies come to the prince's rescue ad encourage them to give him a\nsword and a shield of virtue, truth, and courage.\n11) Send the prince to battle the witch and make sure she turns herself into a fierce\ndragon before the prince kills her on a cliff.\n12) Let everyone rejoice and celebrate that the prince and princess will unite two\nkingdoms and fulfill their parents' wishes. After all, it is important that elite\nZipes, Jack. The Enchanted Screen: The Unknown History of Fair-Tale Films. Routledge, 2011.\n(c) Routledge. All rights reserved. This content is excluded from our Creative Commons license.\nFor more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\ngroups preserve their legacies and are adored in acclamation. Make sure that the\nmusic is somewhat sacred.\n13) Close the gilded book to signify a happy ending.\n14) Remember the recipe: Make sure that the audience and characters in the film\nworship royalty and acclaim the beauty of a young girl, let her sing her wish for a\nman to save her, have her persecuted (generally by some one of her own sex),\ncreate a grand battle over the virginal body, let the best man win and elitism\ntriumph.\nAlthough the commentators in the two-DVD platinum edition of Sleeping Beauty,\nwhich celebrated its fiftieth anniversary in 2007, rave about the artistry and\noriginality of the film, a few concede that it is very similar to Snow White and the\nSeven Dwarves. Not only does Malificent look and speak like the vicious queen who\nwants to kill Snow White, but the animals and the forest are identical, and the\narranged meeting and song of the young lovers imitate Snow White's encounter with\nher prince. Even the great battle between the prince and Malificent at the end of\nSleeping Beauty is reminiscent of the dwarfs' battle with the queen. And, of course,\nthe comatose virginal princesses are laid out identically on a decorative bier and sofa.\nGreat care was taken by many gifted artists and technicians in producing Sleeping\nBeauty, and in some respects it is technically the well-made animated fairy-tale\nfeature film: intricate and decorative background designs, surreal color schemes,\nrenaissance architecture, realistically drawn major characters, naturalistic movement,\nand classical music made modern. Yet, there is no substance or deep humor, just\nfrivolity. The artwork crumbles because it cannot conceal an unimaginative\nnarrative, and even the artwork is faux UPA graphic style (United Productions of\nAmerica, q.v.) mixed poorly with well-rounded, realistic characters. There is a\nBarbie-doll quality to the leading characters that is upsetting, and needless to say, the\npatriarchal perspective regarding Princess Aurora's role in life is disturbing.\nSleeping Beauty, a product of the [...] icy Cold-War climate of the 1950s, is very\nmuch in keeping with its time. The difficulty is that, even though the Disney Studios\nstopped producing animated fairy tales until the resurgence in 1989 with The Little\nMermaid, the artistic and ideological recipe and approach to making animated fairy-\ntale films in the Disney Studio became cemented in 1959. No matter how the Disney\nartists and animators have tried--even when they have tried to mock themselves with\nthe pitiful Enchanted in 2007--they keep producing the same kind of fairy tale.\nBasically, they have been reduced to selling a brand and maintaining a mass cultural\ntaste for a particular brand of fairy-tale film.\" Pp.88-9.\n\nZipes, Jack. The Enchanted Screen: The Unknown History of Fair-Tale Films. Routledge, 2011.\n(c) Routledge. All rights reserved. This content is excluded from our Creative Commons license.\nFor more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.430 / CMS.920 Popular Culture and Narrative: Use and Abuse of the Fairy Tale\nFall 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "21L.430F15 Jack Zipes, When Dreams Came True: Classical Fairy Tales and Their Tradition",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-430-popular-culture-and-narrative-use-and-abuse-of-the-fairy-tale-fall-2015/c32daacb455a9aab4a963685283ae5d7_MIT21L_430F15_WhenDreams.pdf",
      "content": "Jack Zipes, When Dreams Came True Classical Fairy Tales and Their Tradition (2nd ed.,\nNew York, Routledge, 2007)\nIntroduction--\"Spells of Enchantment: An Overview of the History of Fairy Tales\"\nadopts the usual Zipes position--fairy tales are strongly wish-fulfillment orientated, and\nthere is much talk of humanity's unquenchable desire to dream. \"Even though numerous\ncritics and psychologists such as C. G. Jung and Bruno Bettelheim have mystified and\nmisinterpreted the fairy tale because of their own spiritual quest for universal archetypes\nor need to save the world through therapy, the oral and literary forms of the fairy tale\nhave resisted the imposition of theory and manifested their enduring power by\narticulating relevant cultural information necessary for the formation of civilization and\nadaption to the environment...They emanate from specific struggles to humanize bestial\nand barbaric forces that have terrorized our minds and communities in concrete ways,\nthreatening to destroy free will and human compassion. The fairy tale sets out, using\nvarious forms and information, to conquer this concrete terror through metaphors that are\naccessible to readers and listeners and provide hope that social and political conditions\ncan be changed.' pp.1-2 [For a writer rather quick to pooh-pooh other people's theories,\nthis seems quite a claim...]\nWhat the fairy tale is, is almost impossible of definition. Zipes talks about Vladimir\nPropp, and summarises him interestingly on pp.3-4, but in a way which detracts from\nwhat Propp actually said, I think, by systematizing it and reducing the element of\nnarrator-choice which was central to Propp's approach. Zipes also produces a kind of\ngeneral menu for fairy tale characters, motifs and incidents: \"we have the simpleton who\nturns out to be remarkably cunning; the third and youngest son who is oppressed by his\nbrothers and/or father; the beautiful but maltreated youngest daughter; the discharged\nsoldier who has been exploited by his superiors; the shrew who needs taming; the evil\nwitch, the kind elves; the cannibalistic ogre; the clumsy stupid giant; terrifying beasts like\ndragons, lions, and wild boars, kind animals like ants, birds, deer, bees, ducks, and fish;\nthe clever tailor; the evil and jealous stepmother; the clever peasant; the power-hungry\nand unjust king; treacherous nixies; and the beast-bridegroom. There are haunted castles,\nenchanted forests, mysterious huts in woods, glass mountains, dark, dangerous caves; and\nunderground kingdoms. There are seven-league boots...capes that make a person\ninvisible; magic wands that can perform extraordinary feats of transformation; animals\nthat produce gold; tables that provide all the delicious and sumptuous food you can eat;\nmusical instruments with captivating powers, swords and clubs capable of conquering\nanyone; lakes, ponds and seas that are difficult to cross and serve as the home for\nsupernatural creatures\". pp.4-5\nHe stresses the sense of Wonder, as the thing that distinguishes the Fairy Tale from other\ngenres.\nThe intention of these wonder-tales is ideological, declares Zipes, but they have been\ncurrent for so long and have suffered so many changes that it is difficult to discern what\nthe ideological purpose might have been. There are hints of what is to come from late\nClassical antiquity onwards, but the first collection of fairy tales as such was Giovan\nFrancesco Straparola's Le Piacevoli notti (The Pleasant Nights, 1550-1553) in the\nvernacular and for a mixed audience of men and women\" p.9 \"Though his tales did not\nZipes, Jack. When Dreams Came True: Classical Fairy Tales and Their Tradition. Routledge, 2007.\n(c) Routledge. All rights reserved. This content is excluded from our Creative Commons license.\nFor more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\nachieve the popularity of Boccaccio's collection, they were reprinted several times in\nItalian during the next few centuries and were translated into French in the eighteenth\ncentury and German and English in the nineteenth century\". p.9 Giambattista Basile's\nLo Cunto de li cunti, also called The Pentameron, published posthumously in 1634,\nwritten in the Neapolitan dialect. \"Although it cannot be fully documented, it is highly\nlikely that the Italian literary fairy tales were gradually spread in print and by word of\nmouth throughout Europe.\" pp.11-12. Then we turn to the French, Mme d'Aulnoy and\nCharles Perrault who bring us the contes de fee. Perrault seems to have been responsible\nfor the first published versions of Cinderella, Little Red Riding Hood, Sleeping Beauty,\nBlue Beard and Tom Thumb. A French version of The Thousand and One Nights (1704-\n17) was published in the early years of the eighteenth century. Zipes offers a seemingly\nentirely conjectural account of the reason for the predominance of female writers in this\nphase of the French tradition, it is that they were advocating a non-Christian notion of the\nsupernatural in reaction to the persecution of female witches during the previous two\ncenturies. Fairytales also circulated in 18th century France as chapbooks, the so-called\nBlbliotheque Bleue, very popular with the common people and children. During the\neighteenth century also, literary fairy stories began to be written with a view to\nsocialising children into acceptable social beliefs and conduct. This culminated with\nCharles Mayer's Le Cabinet des Fees published between 1785-1789 in 41 volumes.\nGerman writers too \"began employing the fairy tale to celebrate German customs.\" p.18\nZipes mentions Musaus, Wieland and others in this respect, culminating in the Grimms.\nWith the German Romantics, the Fairy Tale became even more strongly a criticism of the\nprevailing ethos and was aimed really at adults. But at the same time the Grimms in their\nsuccessive revisions edited down the tales more and more for children. The Grimms were\ntranslated into English by Edgar Taylor with illustrations by Cruikshank under the title\nGerman Popular Stories in 1823. Andersen \"more than any writer of the nineteenth\ncentury...fully developed what Perrault had begun, to write tales such as 'The Ugly\nDuckling' and 'The Red Shoes' which could be readily grasped by children and adults\nalike but with a different understanding. Really, no sooner had an Fairy Tale canon\ndeveloped than people began to distort and subvert it, as a means of questioning the\nconventional morality of the time which the more didactic tales seemed inclined to foster.\n[Maybe Disney is slightly different here--he uses the Fairy Tale tradition to affirm and\nreinforce the conventional morality of the time?] Amongst these revisionists he mentions\nGeorge MacDonald (\"The Day Boy and the Night Girl\" 1879) and Oscar Wilde (\"The\nFisherman and his Soul'\"1891) and Robert Louis Stevenson (\"The Bottle Imp\"). Lewis\nCarroll's Alice also comes into this and had a major influence [...] the most notable\nAmerican fairy tale of the nineteenth century was L. Frank Baum's The Wonderful\nWizard of Oz (1900), which depicts Dorothy's great desire to break out of Kansas and\ndetermine her own destiny, a theme that Baum also explored in \"The Queen of Quok\" in\nAmerican Fairy Tales (1901) p.22 By the early 20th century Fairy Tale themes could be\nfound in drama, poetry, ballet, music and opera. Zipes claims The Magic Flute as an\nexample of this. He mentions the extreme politicisation of the Fairy Tales under the\nNazis (but gives no references). Amongst post-war writers he mentions Philip K. Dick's\n\"The King of the Elves\" (1953), Naomi Mitchison's \"Five Men and a Swan\" (1957) and\nSylvia Townsend Warner, \"Bluebeard's Daughter\" (1960). The list is fairly extensive:\nwhat bound them together is that \"they know that most of their readers have been\nZipes, Jack. When Dreams Came True: Classical Fairy Tales and Their Tradition. Routledge, 2007.\n(c) Routledge. All rights reserved. This content is excluded from our Creative Commons license.\nFor more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\n'Disneyfied,' that is, they have been subjected to the saccharine, sexist, and illusionary\nstereotypes of the Disney-culture [sic] industry.' p.15 \"Perhaps the major social critique\ncarried by the Fairy Tale can be seen in the restructuring, the reformation of the fairy tale\nitself as genre, on the part of feminists. The result has been a remarkable production of\nnonsexist fairy tales for children and adults, as well as theoretical works that explore the\nunderlying implications of gender roles in fairy tales.\" p.25. Mentions Anne Sexton,\nAngela Carter, Olga Broumas, Margaret Atwood, A. S. Byatt, Tanith Lee, Rosemarie\nKunzler, Jane Yolen and Robin McKinley who have \"created highly innovative tales that\nreverse and question traditional sex roles...[they] have reacted critically to the standard\ncanon representing catatonic females flat on their backs waiting to be brought to life by\ncharming princes. A good example is the work of Attic Press in Ireland, which has\npublished such books as Rapunzel's Revenge (1985), Cinderella on the Ball (1991), and\nRide on Rapunzel (1992). In similar vein but with Fairy Tales much more diverse, Ellen\nDatlow and Terri Windling have published a series of important fairy-tale anthologies:\nBlack Thorn, White Rose (1993), Snow White, Blood Red (1994) Ruby Slippers, Golden\nTears (1995), and Black Swan, White Raven (1997). These books contain original stories\nby such notable writers as Joyce Carol Oates, John Crowey, Nancy Kress, Lisa Goldstein,\nTanith Lee, and Gene Wolfe that break the parameters of the classical fairy tale and\nexplore the genre's potential to address contemporary social concerns.\" pp.25-6. Zipes\ndismisses most fairy tale films as socially and morally conservative conformist slush, but\npraises a few more recent ones including, interestingly: \"Andy Tennant's Ever After\n(1998), a cinematic adaptation of Charles Perrault's famous fairy tale 'Cinderella', uses a\nclever conceit to catch our attention. Jacob and Wilhelm Grimm arrive at the castle of a\nFrench aristocratic woman played by the majestic Jeanne Moreau, and after she shows\nthem a glittering glass slipper, she invited them to spend a few hours with her while she\nregales them with the true story of Cinderella, who was ostensibly her grandmother. As\nshe tells her story, the Grimms are dazzled, for at the end of it, they realize that Charles\nPerrault's version was based on historical fact and that they had perpetuated a lie through\ntheir own particular version. Indeed, they learn that Cinderella, played by the pugnacious\nDrew Barrymore, was a liberal feminist before her times. She read Thomas More's\nUtopia , defended the rights of bonded servants, advocated educational and social\nreforms, enchanted a prince as well as Michelangelo, and became the queen of France.\nWhen the Grimms leave the castle, we smile because we are part of an inside joke and, at\nthe same time, we wish that Tenant's fraudulent version of 'Cinderella' might really be\ntrue, just as we wish that utopian aspects of the fairy tale were less commodified than\nthey are in the Disney tradition.\" pp.27-8.\nZipes claims that the Shrek movies are subversive of the Disney ethos. \"In the first film\nall the fairy-tale characters from the Grimms' tales up through the Disney films are\nbanished to Shrek's swamp. There they are happy and find refuge from the brutal\npuritanical force of Lord Farquaad, who resembles Michael Eisner, the former head of\nthe Disney Corporation [...] What is neat, clean, and beautiful at his court, which\nresembles the antiseptic Disneyland, masks the violence and ugliness of Farquaad's\nempire...\" p.29 The second episode also exposes the blackmail and pretension and force\nupon which the \"official\" world lives and most of the characters are happy to live in the\nswamp and be marginalised. [But isn't Pixar itself part of the Disney empire?]\nZipes, Jack. When Dreams Came True: Classical Fairy Tales and Their Tradition. Routledge, 2007.\n(c) Routledge. All rights reserved. This content is excluded from our Creative Commons license.\nFor more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.430 / CMS.920 Popular Culture and Narrative: Use and Abuse of the Fairy Tale\nFall 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "21L.430F15 Liz Lochhead Reading Guide",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-430-popular-culture-and-narrative-use-and-abuse-of-the-fairy-tale-fall-2015/987cd343863647cb51a8b2aba84467d3_MIT21L_430F15_LizLoch.pdf",
      "content": "Liz Lochhead: Reading Guide\n\nWe need to have a look at some of Lochhead's earlier poetry as a guide to her\ncharacteristic preoccupations and technique before we turn to the sequence \"Grimm\nSisters\".\nThe seemingly open and accessible nature of her poetry may dull our sense of the\nunobtrusively clever stuff actually going on. In \"The Abortion\", for example, have you\nnoted her use of powerful words suggesting acute pain and distress: \"agony\", \"neck\ndistended\" and so on. There are a number of questions we might ask: her imaginative use\nof non-standard word order, and the effects she achieves by its use, for example? Her use\nof allusion, and its effect? How she manages to link her own predicament, struggling\nwith an unborn poem to the miscarrying cow in the nearby field? Think of her \"labour\"\nat the \"barbed words\" on her desk top (ll.14-15). We might think, too, of the powerfully\noriginal visual imagery (the writer is, after all also a painter)...say, \"pulsing locomotion\nof some / terrible underwater creature, /rippled down her flank\" (ll.19-21). What does\nshe gain from the unusual word \"locomotion\" do you suppose? Her use of deliberately\nugly sounds in ll.27-8, say? How does she evoke the men in the poem? Any sense of\nopposition with the females in it; and if so, how is this achieved? Why the intense stress\non the cow's desperate attempts to somehow lick a dead calf into life? And at the end,\nwhat exactly is the cow--and by implication the poet--actually guilty of?\n\"Heartbreak Hotel\": Having a break, achingly lonely and disorientated after the near\ncollapse of yet another affair. She's on tranquillisers--deadly eye as usual for interior\ndetail--interesting stanza in which she rakes frantically amongst her beauty-kit, aware\nthat the only change she can produce is woefully superficial. Bitter commentary on her\nphysical beauty--\"Did my eyebrows offend you? ? Well I've plucked them out--\" her\nfrequent use of blasphemous biblical echoes. Surrounded by Kleenex, aerosols,\nmudpacks and creams and powder--all the tatty detritus of seduction she sits, stricken, in\nfront of the mirror in a state of near emotional collapse. Everything is empty. Powerful\npoem.\n\"Inter City\". Violent imagery--\"hammered like a bolt\"...Frankenstein? Image of male\nmonstrousness--train full of cursing drunks. Complete feeling of alienation from all that\nsurrounds her--the bestial fellow passengers, the weird splashes of synthetic light that\nmark the train's progress through and past the small burghs of Scotland; her own blurred\nfeatures reflected in the window glass (aha, we think--the mirror motif again--the\nblurring is probably the important bit--drained--ashen--) whole thing framed by the title\nof the photo in her glossy magazine, \"Portrait of Absence\". Anonymity of poem is\nintriguing. Just who, or what, is absent?\n\"My House\": Nice sweet (and therefore early) love poem from her stay in America in\nthelater sixties--usual bed stuff and domesticity.\n\"Dreaming Frankenstein\": Triumphant tying-together of renewed interest in the\nmonstrous and her dabbling in folklore--seven apple pips--hollowed out salt-filled\nLochhead, Liz. Dreaming Frankenstein: And Collected Poems 1967-1984. Birlinn, 2003. (c)\nBirlinn. All rights reserved. This content is excluded from our Creative Commons license.\nFor more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\negg--etc. which unites the theme of love with the quest for visionary experience. For the\nartist, however, the experience does not end with the \"experience\"; the even more\nalarming and risky stage comes later, in using such experience as a vehicle for art, sitting\n\"in the reasonable sun of the morning...[with] quill and ink ? and icy paper.\" Nice poem,\none of the best in her later manner.\n\"The Grim Sisters\" (pp.72-4) On the discomforts and petty degradations of youthful\nfemininity--beautiful sense of time and place: the references are placed with brilliantly\neconomical effect. Full of images of impressment, moulding, piercing--suggesting self-\nimmolation. Conversational opening as if overheard in medias res, a standard enough\ntechnique, no doubt, in the dramatic monologue, but effective here. Fragment, as many of\nthese poems are, of an as-yet-unfinished verse autobiography. Intense absorption in the\nrituals (?sacrificial) of the boudoir: \"Those days womanhood was quite a sticky thing /\nand that was what these grim sisters came to mean.\" i.e. grim in the sense of the Furies\nvisiting the pains of womanhood upon the pubescent Liz Lochhead. Grim, too, in the\nsense of the Brothers Grimm--chaperones into the glamorous and mysterious world of\nadult femininity. Cinderella reference (obviously the Grim Sisters have something in\ncommon, but what? with the Ugly Sisters). Typical Liz Lochhead, teasingly suggestive\nweb of references. Suddenly at midnight the scene flashes back to the present from the\nFifties and the participants, sans Liz Lochhead, remain frozen in increasingly passe and\nparodic modes. Marvelous collection of phallic objects carefully controlled, neutralised\ninside their prophylactic \"mantrap\" handbag--hedgehogs, mice, \"barbed combs\" (teeth),\nspiked heels, they themselves are contained, held, encased within protective corsetry\nwhich distorts their figures into the currently fashionable exageratedg shapes \"wasp waist\nand cone breast\".\nIn the course of these poems, the persona is transformed from an almost quivering\ninnocence into something utterly lewd and gross, through successive stages in what can\nonly be called psychological self-mutilation the Maiden is transmuted into the Hag in\nvery earnest.\nWe may reflect that when she fails--which is sometimes--its not because of an\nembarrassing uncontrolled slide into vulgarity and kitsch, but because she takes\nincredible heart-stopping risks, steering an expert but precarious-seeming (this is one of\nthe things which makes her poetry exciting) course along the knife edge which divides\ntragedy from bathos, deadly irony from high camp, partaking of both, but owing\nallegiance ultimately perhaps to neither quite.\n\nLochhead, Liz. Dreaming Frankenstein: And Collected Poems 1967-1984. Birlinn, 2003. (c)\nBirlinn. All rights reserved. This content is excluded from our Creative Commons license.\nFor more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.430 / CMS.920 Popular Culture and Narrative: Use and Abuse of the Fairy Tale\nFall 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}