{
  "course_name": "Portuguese I",
  "course_description": "This course provides an introduction to the language and culture of the Portuguese-speaking world, with special attention to Brazilian Portuguese. This course focuses are on basic oral expression, listening comprehension, and elementary reading and writing. Students develop their vocabulary and understanding of grammatical concepts through active communication. This is a coordinated language lab program and is designed for students with no knowledge of Portuguese. Class is conducted entirely in Portuguese.",
  "topics": [
    "Humanities",
    "Language",
    "Portuguese",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology",
    "Society",
    "Latin and Caribbean Studies",
    "Humanities",
    "Language",
    "Portuguese",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology",
    "Society",
    "Latin and Caribbean Studies"
  ],
  "syllabus_content": "Course Meeting Times\n\nClasses: 4 sessions / week, 1 hour / session\n\nRequired Books\n\nKlobucka, A., C. de Jouet-Pastre, et al.\nPonto de Encontro: Portuguese as a World Language\n. 1st ed. Prentice Hall, 2007. ISBN: 9780131894051.\n\n------.\nBrazilian Activities Manual for Ponto de Encontro: Portuguese as a World Language\n. 1st ed. Prentice Hall, 2007. ISBN: 9780131894082.\n\n------.\nAnswer Key to Student Activities Manual for Ponto de Encontro: Portuguese as a World Language\n. 1st ed. Prentice Hall, 2007. ISBN: 9780132393461.\n\nRecommended\n\nWhitlam, J., V. Davies, and M. Harland.\nHarper Collins Portuguese Dictionary: English, Portuguese Portuguese, English\n. Harpercollins, 1997. ISBN: 9780062734891.\n\nNitti, John J., and Michael Ferreira.\n501 Portuguese Verbs\n. Barron's Educational Series, 1995. ISBN: 9780812090345.\n\nWhitlam, John.\nModern Brazilian Portuguese Grammar: A Practical Guide\n. Routledge, 2010. ISBN: 9780415566438.\n\nGeneral Description\n\nPortuguese I is an introduction to Portuguese for students with little or no previous knowledge of the language. All the basic grammar is covered, divided into Portuguese I and II. Basic vocabulary is also presented. Our main goal is communication in Portuguese, with special emphasis on speaking in the first semester and greater attention to reading and writing in the second, but all the other skills are also practiced. Students will also be introduced to the cultures of the Portuguese-speaking world through readings of authentic materials, including brief dialogues, music and video. The class is conducted in Portuguese, with occasional resort to English for clarity purposes.\n\nPlease see the\nAssignments\npage for an overview of the topics covered in each class session over the semester.\n\nEvaluation/Grades\n\nGrading is based on frequent relatively small evaluations rather than on one or two major hurdles:\n\n1. Class Attendance and Participation: (20%)\n\nYour presence and active participation are essential in each and every session. This will be the most significant part of your grade since it is through continuous class interaction with other students that your communicative abilities in Portuguese will develop and improve. Your grade will be determined daily by the quality and quantity of your preparation and participation in class discussions, activities, group work, etc.\n\nAttendance\n\nAs your progress, and that of the class as a whole, will be impeded by excessive absences, your presence in the classroom is imperative. If you must miss a class, there is no excuse for not being prepared for the next one. If you have to be absent, please contact the instructor\nin advance\nto find out what material you will miss. Each absence without an official excuse will lower your course attendance and participation grade. Any student who has accumulated more than\nthree\nabsences without an official excuse must see the instructor.\nFurther absences after the warning will affect your final grade.\n\n2. Homework and Written Work: (20%)\n\nStudents are expected to prepare the assigned materials for each class and complete the written work as stipulated in the syllabus. These assignments include:\n\nStudying the vocabulary and grammar in the\nPonto de Encontro\ntext and completing any written exercises assigned.\n\nCompleting the exercises in the\nWorkbook\n. The\nWorkbook\nexercises can be checked with an answer key. You are expected to do these exercises and correct them using the answer key before handing them in.\n\nYou can also have extra practice by going on-line and doing the\nnon-mandatory\nexercises as a review for each lesson. They can be found on the\nPonto de Encontro website\n.\n\nAll assignments are to be done on the date indicated.\nLate work will not receive full credit\n. Do the homework in the order it is assigned each day. Anything marked \"entregar\" is to be handed in. The\nWorkbook\nexercises are designed to reinforce the grammar and vocabulary introduced in the textbook, as well as to improve your listening comprehension. They are required components of the course and it's important that you complete them right away, as soon as the material is covered. Don't let your homework pile up. Working a little every day and frequent reviewing are more effective than a few long sessions of study at longer intervals.\n\n3. Exams: (40%)\n\n4 in-class tests.\n\n4. Oral Presentation: (20%)\n\nIn addition to the written quizzes, students will make a 10-minute oral presentation in front of the class. Students may talk about a place where Portuguese is spoken or a historically or culturally significant figure in the Lusophone world. Alternatively, they can choose to talk about a personal trip_._ There will also be an individual oral test in the form of a 5-minute interview (entrevista) with the instructor.",
  "files": []
}