{
  "course_name": "Pricing",
  "course_description": "This course is designed to teach students how to price goods and services by providing a framework for understanding pricing strategies and tactics. Topics covered include economic value analysis, price elasticities, price customization, pricing complementary products, pricing in platform markets and anticipating competitive price responses.",
  "topics": [
    "Business",
    "Marketing",
    "Operations Management",
    "Social Science",
    "Economics",
    "Industrial Organization",
    "Microeconomics",
    "Business",
    "Marketing",
    "Operations Management",
    "Social Science",
    "Economics",
    "Industrial Organization",
    "Microeconomics"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 3 sessions / week, 1.5 hours / session\n\nCourse Goals\n\nThis course is designed to teach students how to price goods and services.\n\nLecture Notes\n\nEach lecture has accompanying notes. These notes are designed so students do not have to take copious notes and consequently will be able to focus on learning and reflection during lectures.\n\nTextbook\n\nI have written my own notes because I do not believe that current textbooks are \"quantitative\" enough to sufficiently teach practical pricing. Therefore students should take the lecture notes as the effective textbook for the course.\n\nHowever, there are textbooks that are good for getting a holistic feeling for the subject. For example,\n\nNagle, Thomas T, and John Hogan.\nThe Strategy and Tactics of Pricing\n. 4th ed. Upper Saddle River, NJ: Prentice Hall, 2005. ISBN: 9780131856776.\n\nForming Teams for Case Analysis and Group Presentations\n\nI would like you to form teams of three to analyze cases and prepare a group presentation. An ideal way to form a team would be to identify teammates who want to work on a similar topic area for the group project.\n\nYou should discuss cases with your team prior to class. In particular, you should answer the case questions which are found in the\nAssignments\nsection of this course. As you know, there are rarely right answers to cases. In pricing there tend to be a few more wrong answers, but the right answer depends on the assumptions you make about facts not presented in the case. You should therefore be clear about your assumptions during case discussions.\n\nEach team member must make a substantial contribution to the assignment. It is not, for example, acceptable to divide the assignments amongst the team members (e.g., part of the team does one case and another member does another case). The team may not collaborate with other students outside of the team.\n\nClass Discussion\n\nClass participation is up to 28% of your grade. It reflects the extent to which your participation in the class benefits the other class members. To gain full credit, you should read all of the cases and come to class with a series of comments that you think will be interesting to the class.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nClass participation\n\n28%\n\nThree group case reports (12% each)\n\n36%\n\nGroup presentation\n\n36%\n\nIn-class final (optional)\n\n28%\n\nIf you choose to do the final, it will be worth a maximum of 28 points and it will substitute in for your class participation scores (if it is higher).",
  "files": [
    {
      "category": "Exam",
      "title": "2009 Final Exam",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-818-pricing-spring-2010/88f30f6b97ac3f71607c7211416f63fa_MIT15_818S10_exam09.pdf",
      "content": "Final Exam: Class 15.818\nThis is a comment posted on a blog by a pricing consultant. Read carefully and then answer the questions below.\nOne of our recent clients wished to determine the optimum price for their consumer electronics product. Before\nretaining us, they had been selling the product at $200 because it felt like a nice round number, and it drove a retail\nprice of $399.95 They were considering dropping their price to $170 (for a retail price of $339.95) to try and improve\nsales volumes and profitably. We examined the market preferences and buying behavior, and concluded that this\ncompany's marketplace (within +/- 15% of the current price) had a price elasticity of 1. This means that a 1% change in\nprice will result in a 1% sales volume. Here is what our research concluded, both for their lower price point, as well as for\nthe optimum price we discovered.\nExample A: Lowering Price to Gain Market Share:\nExample B: Raising Price to Optimum (based on\nindependent market research)\nCost of your product: $100\nCost of your product: $100\nPrice of your product: $200\nPrice of your product $200\nGross margin per product: $100\nGross margin per product: $100\nPrice elasticity: 1\nPrice elasticity: 1\nSales volume: 10,000\nSales volume: 10,000\nRevenues: $2,000,000\nRevenues: $2,000,000\nOverall gross margin: $1,000,000\nOverall gross margin: $1,000,000\nNew lower price: $170\nNew optimum price: $230\nGross margin per product: $70\nNew gross margin per product: $130\nSales volume: 11,500\nSales volume: 8,500\nRevenues: $1,955,500\nRevenues: $1,955,500\nOverall gross margin: $805,000\nOverall gross margin: $1,105,500\nSo in the first case, lowering the prices by 15% -- a typical quick-fix solution at struggling companies - and where the\ncompany planned to move the price - the sales volume will go up, but the result will be an almost 20% decline in margin.\nIn the second case, market research shows that raising the price 15% to the optimum will instead result in a 10%\nimprovement from the original margins. (For this company, the per-unit cost did not change much depending on\nvolume). And just as important, a nearly 40% rise in margins resulted from the company's \"we know that the market will\nbear\" strategy to lower the price. Not bad! Just a little bit of market research, and now everyone at this electronics firm\ncan see that huge holiday bonus coming right around the corner.\nQuestions\n1) Summarize the point the pricing consultant is trying to make about pricing strategies?\n[20 points]\n2a) What assumptions is he making when making this point?\n[30 points]\n2b) What information would you need to make sure he was correct?\n[25 points]\n3)If you were hired as a consultant on this project what else would you want to look at and do in order to improve\npricing performance?\n[25 points]\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n15.818 Pricing\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "2010 Final Exam",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-818-pricing-spring-2010/d161bb99b40dd59fb20f0818f13b94bb_MIT15_818S10_exam10.pdf",
      "content": "Final Exam: 15:818\nExtract from \"With Select Apps, iPad is More Than a Pretty Face\", New York Times, April 2010\nTravelers can download 1,000 Experiences from Lonely Planet ($10), a graphically rich look at a wide variety of\ntrips. Lonely Planet cut the price for its app in half after a few days, which is a telling development. IPad\ndevelopers started with prices that were often much higher than iPhone versions of the same software, based\non logic that no one has yet unearthed. As competition builds in the App Store, that logic should fade quickly.\nAdditional Background facts to the case:\n6 weeks after the launch of the iPad:\n-\n1 million iPads and 85 million iPhone devices had been sold in total.\n-\nThere were 196,000 iPhone applications and 5,700 native iPad applications\nPeople can use iPhone applications on their iPads but the resolution is not as good as an iPad application.\nBoth iPhone and iPad applications are displayed in the application store in order of their popularity, so that the\nmost popular application is always the first one that any customer sees.\nSpecific Data for Case:\nThese data cover the first 6 weeks after the launch of the iPad, for an application that allows users to access information\nand reviews about restaurants in cities across the US on their iPad and iPhone.\niPad Price\niPad Downloads\niPhone Price\niPhone Downloads\nWeek 1\n9.99\n0.99\n10,500\nWeek 2\n9.99\n1.99\nWeek 3\n4.99\n1.99\nWeek 4\n4.99\n0.99\n9,000\nWeek 5\n2.99\n2.99\nWeek 6\n2.99\n2.99\nQuestions [Total 28 points]\n1) Calculate the price elasticity for both the iPad application and the iPhone application, using the Excel \"slope\"\nmethodology we covered in class. [2 points]\n2) How would you explain the difference between the elasticity for the iPad and the iPhone application? [4 points]\n3) Do you agree with the New York Times when it says that the decision to price iPad applications higher than iPhone\napplications was \"based on logic that no one has yet unearthed\"? Why or why not? [2 points]\n4) Calculate the price elasticity of the iPad application in weeks 1-3 and then again in weeks 4-6. How would you explain\nthe difference, if any? You are welcome to list multiple explanations. [6 points]\n5) Do you agree with the statement, \"As competition builds in the App Store, that logic [pricing higher on iPad\napplications than iPhone applications] should fade quickly.\"? Why or why not? [6 points]\n6) Do you think that product-based price segmentation is possible here? How would you adjust the iPad application to\nprice-segment the iPad application market? [Remember the methodology we used in class.] [8 points]\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n15.818 Pricing\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "2010 Final Exam Solutions",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-818-pricing-spring-2010/c25bc070c09f3d959ddc35cde12c6d27_MIT15_818S10_soln10.pdf",
      "content": "Final Exam: 15:818\nExtract from \"With Select Apps, iPad is More Than a Pretty Face\", New York Times, April 2010\nTravelers can download 1,000 Experiences from Lonely Planet ($10), a graphically rich look at a wide variety of\ntrips. Lonely Planet cut the price for its app in half after a few days, which is a telling development. IPad\ndevelopers started with prices that were often much higher than iPhone versions of the same software, based\non logic that no one has yet unearthed. As competition builds in the App Store, that logic should fade quickly.\nAdditional Background facts to the case:\n6 weeks after the launch of the iPad:\n-\n1 million iPads and 85 million iPhone devices had been sold in total.\n-\nThere were 196,000 iPhone applications and 5,700 native iPad applications\nPeople can use iPhone applications on their iPads but the resolution is not as good as an iPad application.\nBoth iPhone and iPad applications are displayed in the application store in order of their popularity, so that the\nmost popular application is always the first one that any customer sees.\nSpecific Data for Case:\nThese data cover the first 6 weeks after the launch of the iPad, for an application that allows users to access information\nand reviews about restaurants in cities across the US on their iPad and iPhone.\niPad Price\niPad Downloads\niPhone Price\niPhone Downloads\nWeek 1\n9.99\n0.99\n10,500\nWeek 2\n9.99\n1.99\nWeek 3\n4.99\n1.99\nWeek 4\n4.99\n0.99\n9,000\nWeek 5\n2.99\n2.99\nWeek 6\n2.99\n2.99\nQuestions [Total 28 points]\n1) Calculate the price elasticity for both the iPad application and the iPhone application, using the Excel \"slope\"\nmethodology we covered in class. [2 points]\niPad: -.53\niPhone: -2.22\n2) How would you explain the difference between the elasticity for the iPad and the iPhone application? [4 points]\nUltimately all the people who are price sensitive will buy the iPhone application and suffer the bad resolution.\niPad users are likely to be wealthier (it has a higher purchase price) meaning the purchase is a smaller proportion of their\nincome.\nThere are fewer competitive applications meaning that there is a larger buffer in terms of differentiation value for the\niPad application.\n\n3) Do you agree with the New York Times when it says that the decision to price iPad applications higher than iPhone\napplications was \"based on logic that no one has yet unearthed\"? Why or why not? [2 points]\nNo. Makes a lot of sense given the price elasticities which the application developers could have easily anticipated. The\nlogic is simple \"value-based pricing\" rather than cost-based pricing.\n4) Calculate the price elasticity of the iPad application in weeks 1-3 and then again in weeks 4-6. How would you explain\nthe difference, if any? You are welcome to list multiple explanations. [6 points]\nWeek 1-3\n-1.01\n-3.33\nWeek 4-6\n-0.17\n-2.03\nThe price change between 9.99 and 4.99 takes the application from being potentially a purchase that is perceived as a\nluxury to something discretionary. The price change between 4.99 and 2.99 may have felt small enough to not be\nmeaningful in terms of influencing customer behavior (due to proportional price perceptions). It could also be that\ncustomers were educated by their previous experience with low priced iphone applications that $9.99 was just an\n`unjust' price.\nAlso, it is possible that in Weeks 1-3 people were buying many different applications for their newly bought iPad and\nwere consequently price sensitive, but the purchases in week 4-6 were just people who really needed a restaurant\napplication.\nThere is also reasonably limited data. This may explain a rather surprising result, since we usually expect price sensitivity\nto go down over time. There also many have been limitations in how many ipad application could have been sold in the\nfirst week.\nIt could be that the fact the price was so much higher than the iphone application made customer very resistant to price\nsegmentation as it wasn't perceived as \"fair\". When the price came down this fairness issue was less salient.\nThey may have been also some form of network effects going on. Either the product needed \"user based content\" to be\nuseful. Or it could be that it got enough downloads eventually to be featured in Apple's bestseller list meaning that\ncustomers perceived higher quality.\n5) Do you agree with the statement, \"As competition builds in the App Store, that logic [pricing higher on iPad\napplications than iPhone applications] should fade quickly.\"? Why or why not? [6 points]\niPad buyers are still likely to be wealthier and ultimately less price sensitive. It is difficult to see how that will go away.\nHowever, competition in this market will be particularly ruthless because of Apple's decision to rank applications by\npopularity. This creates a winner takes all market and competitors may simply undercut prices and ignore the\ncharacteristics of their customers. If the NYT is silly enough to say that there is not rationale for segmenting the\niPhone/iPad market there are bound to be even sillier competitors out there.\n6) Do you think that product-based price segmentation is possible here? How would you adjust the iPad application to\nprice-segment the iPad application market? [Remember the methodology we used in class.] [8 points]\nChoose an aspect of the iPad application such as:\n- coverage of high-end restaurants\n\n- recency and coverage of the reviews\n- Guaranteed reservations at these restaurants\nThat are likely to be related to whether or not an individual has an overall high EVC for a restaurant review application.\nCreate one version at \"$9.99\" that has these features, and then mid-range version which has limited features (perhaps at\n4.99 or lower), and then finally a low end version that does not have these features (perhaps at 2.99). Make sure to\ncommunicate the differentiation value so that people do not feel that the segmentation is unfair. Remember it is all\nabout self-selection!\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n15.818 Pricing\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Measuring Customer Reactions to Prices",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-818-pricing-spring-2010/59dd681ca6c787b8a7a5f669974b0f77_MIT15_818S10_lec04.pdf",
      "content": "In this lecture we learn both how to price new products by using survey tools,\nand how to improve pricing of existing products by measuring price elasticities.\nTable 1. Price Measurement Matrix\nVariable Measured\nUncontrolled\nExperimental Im\nprovement\nPricing for the first time\nSurveys\nConjoint\nImproving existing pric-\nHistorical Sales Data Field-Tests\ning\n(Scanner/Store)\nMEASURING CUSTOMER REACTIONS TO PRICES\nContents\n1. Uncontrolled Price Surveys\n1.1. Unstructured Questions\n1.2. General issues with price survey techniques\n1.3. Implementation\n2. Improving Price Surveys by Using Conjoint Analysis\n2.1. Conducting conjoint analysis\n2.2. Conjoint advantages\n2.3. Conjoint disadvantages\n3. Using Historical Data to Improve Existing Pricing\n3.1. Price Elasticities\n3.2. Estimating a constant price elasticity\n3.3. Spreadsheet analysis\n3.4. Why is a price elasticity ever useful?\n3.5. Drawbacks of historical pricing analysis\n3.6. Ways of improving historical pricing analysis\n4. Improving Pricing Analysis by Using Field Experiments\n4.1. Challenges with field experiments\nMath Appendix\nMid-point elasticity formula\nUsing calculus to move from logs to price elasticity formula\n\nMEASURING CUSTOMER REACTIONS TO PRICES\n1. Uncontrolled Price Surveys\nVery early in the development of survey techniques for marketing,\nresearchers learned that it was futile to ask consumers outright\nwhat they would be willing to pay for a product.\nThe Strategy and Tactics of Pricing, Nagle and Hogan\n1.1. Unstructured Questions. The most obvious way of finding out customers'\nfeelings about price is to ask them a question like 'How much should this can of Coke\ncost?'. Such a question has problems from the outset, because the question does\nnot demand that the customer actually buy the can of Coke. Instead it conflates\n'price awareness' with willingness to pay.\n1.1.1. Van Westendorp's Price Sensitivity Meter. Marginally better is: 'How much\nwould you be willing to pay for a can of Coke'? This type of price questioning\nis used in a species of pricing research named 'Van Westendorp's Price Sensitivity\nMeter'. Here, customers are asked:\n- At what price would you consider the product too expensive?\n- At what price would you consider the product to be so cheap you would\nnot consider it?\n- At what price would you consider the product to start to get expensive?\n- At what price would you consider the product to be a 'good value'?\nThis was originally proposed in 1976 as a way of gauging how important the kind\nof price-quality signal that we discussed in the previous lecture is for a product.\nHowever, it has been distorted from its original intention and is commonly used as\na way of getting a price range for a product. The lower bound is the intersection of\n'too cheap' and expensive. The upper bound is the intersection of 'too expensive'\nand 'cheap'.\nThis methodology has been discredited. I suspect its persistent popularity it lies\nin the facts a) that it produces a figure with intersecting lines that is reminiscent of\nsome kind of demand and supply curve and b) 'Van Westendorp' had an impressive\nsounding last name.\nProblems in general with open-ended questioning approach:\n- The problem with this is that a customer will almost always say: it depends.\nAfter all, my willingness to pay for a can of Coke would probably vary from\n$.20 in a supermarket if I was in a hurry and I had plenty of Coke cans\nback home, to $5 if I was in a hotel room and the only place I could get a\ndrink was from a hotel minibar.\n- People are not very good at this kind of open-ended question since we are\nnot called upon to make this kind of judgement often. Suppose you were\n\nMEASURING CUSTOMER REACTIONS TO PRICES\ngiven a suitcase and asked to guess how much it weighed. People have\na tough time with questions like this. However, when on the other hand\npeople are given two suitcases and asked to say which one is heavier, they\nget it right 100 percent of the time.\n- Lyon (2002) suggests that 20% of respondents say that the price that would\nbe 'right' is lower than the price at which they say they would find the\nproduct too 'cheap' at.\n- Such huge price ranges are they give clients an excuse to go with their gut.\n1.1.2. Monadic Pricing Studies. Monadic pricing studies are a fancy name given to\n'single cell' pricing research where respondents are asked a single question about a\nproduct.\n- 'If a Coke can is priced at $0.99, how likely are you to buy it?'\n- 'If a Coke can is priced at $0.99, how likely are you to buy it at the snack-\nshop at work?\n- 'If a Coke can is priced at $0.99, would you buy it at the snack-shop at\nwork'?\n- 'If a Coke can is priced at $0.99 and Pepsi is $1.09 at the snack-shop at\nwork, would you buy Pepsi, Coke or neither supposing, you had no soda so\nfar that day?'\nThis kind of phrasing is less likely to confuse survey-takers as they just have\nto make a choice rather than naming a price. This would at least get you more\naccurate answers for your particular setting. One advantage if you test a broad\nenough range of prices, you can recreate a demand curve.\nPotential Problems:\n- By focusing the customer's attention on a reasonable price, you may be\ncensoring extreme responses such as $5 which may be the basis for profitable\nsegmentation.\n- Need a lot of respondents to get an answer. Do not be tempted to use\na price ladder, however. Asking follow-up questions such as 'how about\n$0.89?, How about $0.79?. just lead the customer to behave as though\nthey are negotiating.\n- Need to ensure that the question is not overly focused on the price.\n1.2. General issues with price survey techniques. There are three main flaws\nto this approach\n(1) Customers may deliberately understate their willingness to pay\n\nMEASURING CUSTOMER REACTIONS TO PRICES\n- For example, a chemical distributor was told by its customers that\nthey would pay 75 percent less than the market price for waste disposal\nservices.\n- Customers may say a price that reflects how they want the person\nconducting the survey to view them, but does not reflect their actual\nwillingness to pay. For example, Phillips conducted a survey where the\nteenage participants said they wanted yellow boom boxes. However,\nwhen they came to leave the room, they all chose black boom boxes.\n- Customers may simply be unsure about their willingness to pay. For\nexample, an American bridal survey found that brides overstated will\ningness to pay five-fold.\n1.3. Implementation.\n(1) In person\n- The key is to find the right setting. Rushed settings produce worse\ndata. The best data comes from times when people take time and\nsurvey-taking becomes a communal activity.\n(2) Online\n- The problem here is reliability of data. We found that when we asked\nsurvey participants what browser they used, 40 percent lied. This\nfigure actually increased when we raised their compensation.\n(3) Focus Groups\n- A crucial problem here is that the incentives of the focus group fa\ncilitator can often lead to misleading results and analysis. However,\nwithout a facilitator no pricing questions get answered.\n2. Improving Price Surveys by Using Conjoint Analysis\nChoice-based conjoint is a laboratory survey of how customers would value dif\nferent attribute bundles. It is usually (and best) used for product design.\n2.1. Conducting conjoint analysis.\n(1) You choose a limited selection of product features to permutate in questions.\nPrice should be one of these features.\n(2) Software then gives survey respondents a selection of choices between differ\nent product bundles. It is important that you make sure that respondents\nalways have the option not to buy.\n(3) Software then conducts logit analysis and gives regression output.\n(4) The estimates of how much a customer values each product feature can\nbe converted into rough dollar amounts by multiplying by the ratio of the\ncoefficient on price. This allows us to establish EVC amounts.\n\nMEASURING CUSTOMER REACTIONS TO PRICES\n2.2. Conjoint advantages.\n- Conjoint analysis reduced the rather artificial focus on price in surveys by\nincluding information about features.\n- Conjoint output allows researchers to give 'utility-values' to various com\nponents which can help accurately determine the EVC.\n- Quick and relatively cheap\n2.3. Conjoint disadvantages. Do not use conjoint if\n- Customers are likely to take price as a signal of the quality of the attribute.\nThis problem is often severe and means that you need to severely limit the\nnumber of attributes. More than 3 is often too many.\n- Product features are not well understood by customers.\n- Part of a more complex system of related products.\n3. Using Historical Data to Improve Existing Pricing\n3.1. Price Elasticities. The price elasticity of a product measures the responsive\nness of sales to a change in price. Price elasticity is defined as the percent change\nin quantity sold given a 1% change in price.\nThis helps analysts figure out whether revenues will be the same, higher or\nlower after a change in price. If elasticity=1, revenues will be the same from a\nprice change. If elasticity is >1, revenues will be higher with a price decrease. If\nelasticity<1, revenues will be higher with a price increase.\nOn average, price elasticities are around -2, but 'on average' is not very useful.\nThe standard formula is\n% change in quantity demanded\nΔQd/Qd\nEd =\n=\n% change in price\nΔPd/Pd\n3.2. Estimating a constant price elasticity. One problem with the formula\nΔQd/Qd for the price elasticity is that it can take two different values for whether\nΔPd/Pd\nP or Q are the original or final values. This shouldn't matter if you are comparing\nprice elasticities across segments and are always consistent about what values you\nuse (for example the value that is used in the denominator, should be the one used\nto calculate the numerator).\nThis occurs because we are assuming a linear relationship between price and\nquantity. One (smart) way of getting around this is by assuming that the demand\ncurve instead has a constant elasticity.\nThe functional form for a constant-elasticity demand curve is\nSales = aP b\nx\n\nMEASURING CUSTOMER REACTIONS TO PRICES\nTaking logs\nlog Sales = log a + b log P\nWe can then use spreadsheet analysis to find the value of the constant b which\nsummarizes the price elasticity.\n3.3. Spreadsheet analysis. It is quite straightforward to use a spreadsheet tool\nlike excel to calculate a price elasticity from historical data. The steps are\n(1) Create new columns for log(sales) and log(prices). Use the excel function\n= LOG() to convert the raw sales data into log form.\n(2) In a new cell, insert the function '=SLOPE(known y's, known x's)'\n(3) Choose for the known y's the log of sales, and for the known x's the log of\nprices.\n(4) You should get a negative number that represents the price elasticity\nOne drawback to this procedure is that is not clear how reliable your estimate\nis. As an alternative you can also use the Data Analysis Add-In for Excel and\nthe 'Regression' option to get measures called standard errors (which tell you how\nprecise your estimate is), and R-squared which is a statistic that helps you know\nhow much of the variation in sales is explained by price1\n3.4. Why is a price elasticity ever useful?\n- Relative margins (More on this in our next lecture):\nAn electronics retailer priced batteries the same all over....[Price\nElasticity Analysis] showed the battery that had the highest \"price\nsensitivity\" in Dallas had the lowest price sensitivity in Boston. In\nother words, while Texans would buy this particular battery only\nwithin a narrow price range, Bostonians were far less picky about\nit. The store altered its prices accordingly, sold more batteries\nand made more money at it.\nAssociated Press, 2007\n- Rule of thumb pricing tool, especially in retail sector with a large number\nof SKUs. This caries a weighty health warning since you are effectively\nassuming away your competitors, that you are already optimizing and that\nyou have increasing marginal costs.\n% change in quantity demanded\nΔQd/Qd\nEd =\n=\n% change in price\nΔPd/Pd\n1You can also use the array function LINEST() should you not be able to install the 'Analysis\nAdd-In.'\n\nMEASURING CUSTOMER REACTIONS TO PRICES\nRevenue for a firm:\nRevenue = P × Q\nIf they maximize revenue with respect to the quantity they sell:\nMarginal Revenue = P δQ + QδP\nδQ\nδQ\nδP\nMarginal Revenue = P + δQ × Q\nδP\nQ\nMarginal Revenue = P [1 + δQ × P ]\nWe can simplify since the price elasticity Ed\nδP\nQ\nEd = -1/δQ × P\nMarginal Revenue = P [1 -\n]\nEd\nIf you are a profit maximizing firm, then you of course set price such\nthat MR=MC.\nMarginal Cost = P [1 -\n]\nEd\nDividing by P and rearranging yields:\nP = Marginal Cost × 1 -\n|Ed|\nLet us suppose you estimate a price elasticity of Ed = 2, then you can calculate\na rough mark-up such that your price should be twice cost. If Ed = 3 then price\nshould be 3/2 marginal cost (or a 50 percent mark-up). If demand is only somewhat\nelastic Ed = -1.5, then price should be three times cost.\nHint: Use the absolute value of the price elasticity. The formula is already\nadjusted for it being negative.\nHint: Don't use the formula for price elasticities less than one. In my opinion it\ndoes not work well for price elasticities less than 1.5.\n3.5. Drawbacks of historical pricing analysis.\n(1) Need accurate pricing data\n- For example, the marketing division of a Web server space company\nfaced problems when the sales force didn't keep record of discounts.\n(2) Need variation in price\n\nMEASURING CUSTOMER REACTIONS TO PRICES\n- A drapes manufacturer could not calculate an elasticity because it had\nkept the same price for the last 10 years.\n(3) If the data goes back too far it may describe an old scenario. Don't use\npricing data more than 5 years old.\n- A book catalog company calculated an artificially low price elasticity\nby including pre-internet-era data.\n(4) Misleading because of changes in other confounding factors\n- For example, ice-creams are priced higher and sell better in hot weather.\nHowever, if one performs multivariate analysis rather than univariate\nanalysis when calculating price elasticities, it is possible to control for\nthese 'observable' sources of bias.\n3.6. Ways of improving historical pricing analysis.\n(1) CRUCIAL. Calculate different price elasticities for each type of customer,\neach region, each product.\n(2) Use more data than just aggregate sales and prices\n- DHL employed software that included the reactions of customers who\ncalled and got a quote but didn't ship - that is, a failed sale. By in\ncluding data from this group of customers, they improved their 'quote\nto book ratio' from 17 percent to 25 percent.\n(3) Use panel data econometrics where you include controls for places and times\nin your regression analysis. The problem is that this can get very expensive\nboth in terms of personnel and costs of acquiring data.\n4. Improving Pricing Analysis by Using Field Experiments\nA lot of the problems with historical data analysis happen because the price\nchanged for reasons that were also associated with changes in sales (for example\nthe weather and ice-cream sales). This can be controlled for by using controlled\nprice experiments. Can be very successful. Ambassadors travel group discovered\nthey had a price elasticity of 0.3 and were able to increase profits by 15 percent.\nUsually we tend to think of field tests as being experiments, but new tools such\nas Google Analytics are actually putting them easily in the reach of firms with\nsmaller budgets.\n4.1. Challenges with field experiments.\n(1) Ensure will have enough price-variation.\n- One experiment I encountered had lowered all prices by 15%, which is\nonly useful if your aim is to drop all prices by 15%.\n(2) If too visible, can anger customers\n\nMEASURING CUSTOMER REACTIONS TO PRICES\n- Amazon had to refund $7,000 to angry customers after its DVD pricing\nexperiments were spotted\n(3) Stock-outs or problems with an experimental cell (such as mailing problems)\ncan be detrimental to establishing concrete conclusions.\n(4) Multiple pricing experiments make interpretation of one cell difficult\n- Fingerhut runs 30,000 pricing experiments a year, making interpreta\ntion of results that involve complements and substitutes difficult.\nMath Appendix\nMid-point elasticity formula. If you are concerned about the approximations\ninvolved with the simple elasticity formula but are not doing the kind of detailed\nhistorical analysis which is amenable to the log transformation, you can use the\nmidpoint elasticity formula.\n(Q2-Q1)\nEd =\n(Q1+Q2)/2\nP 2-P 1\n(P 1+P 2)/2\n(Q2 - Q1)(P 2 - P 1) (P 1 + P 2)\nEd =\n×\n(Q1 + Q2)\nUsing calculus to move from logs to price elasticity formula. Our constant\nelasticity demand function is\nQ = aPx\nb\nLet u = ln Q, v = (ln p)\nd ln Q\ndu\ndu dq dp\nEd = - d ln P == dv = dq dp dv\nd ln Q dy dev\n1 dy v\ndy x\nEd\n=\ne =\n= - dQ dx dv\nQ dx\ndx y\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n15.818 Pricing\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Non-linear Pricing",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-818-pricing-spring-2010/9e09e8e8c17bdd03da830f7250ea0ebf_MIT15_818S10_supp02.pdf",
      "content": "NON-LINEAR PRICING\nContents\n1. Quantity Discounts\n2. Metered Pricing\n3. Value-Based Pricing Metrics\nSometimes we need to sell more than one unit of our good to each customer.\n1. Quantity Discounts\nThe basic theory about offering quantity discounts is that it allows you to serve\nhigh-valuation and low-valuation customers. High-valuation customers signal the\nfact they are high-valuation customers to you by purchasing in bulk. Low-valuation\ncustomers signal that they value your product less by buying fewer units but at a\nhigh unit price.\nThere are some practical problems:\n- There are often practical problems when it comes to managing returns,\nas customers may buy more units to get the discount but expect to be\nrefunded at the average per-unit price for the units they return.\n- The ideal product is something like a banana, where resellers cannot store\nor hoard the product and it is difficult and expensive to resell.\n- There must be no realistic chance of hoarding of the product by consumers.\n- The Robinson-Patman Act was explicitly designed to try and prevent firms\nusing these kind of non-linear tariffs to benefit chain stores at the expense\nof 'Mom and Pop' stores\n2. Metered Pricing\nOften some form of metered pricing arrangement is preferable where the buyer\npurchases goods simply on the basis of usage. Variations along this theme are\nrazor-blade models where the customer buys a low price durable (the razor) and\nthen subsequently purchases high price consumables (the blades).\n3. Value-Based Pricing Metrics\nWith any form of pricing, the key to pricing multiple units of a good to each\ncustomer is to get the pricing metric right.\n- For example, for most information services it makes sense to price 'per\ndownload' rather than per minute.\n- It very rarely makes sense to charge per hour.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n15.818 Pricing\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Out-pricing",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-818-pricing-spring-2010/b5b66ab8b76c42cd28e0128a53e7ace2_MIT15_818S10_lec07.pdf",
      "content": "OUT-PRICING\nAnheuser-Busch executives last month said they were lowering prices\nto win back drinkers who are choosing wine and spirits over beer.\nMiller, the No. 2 U.S. brewer, will match Anheuser-Busch's cuts to\navoid losing market share heading into the summer season.\nContents\n1. Legal Regulation of Pricing\n1.1. Price fixing and bid rigging\n1.2. Predatory pricing\n2. Preempting Competitive Price Erosion\n2.1. Assessing risk of price erosion\n2.2. Assessing competitor's pricing sophistication\n2.3. Pricing threat\n2.4. Talking to the press about pricing\n3. Responding to Competitive Price Erosion Using the Other 3Ps\n3.1. Product\n3.2. Promotion\n3.3. Placement\n3.4. Why not lower price?\nIn this lecture series we have intentionally ignored competitors. We did this to avoid\na natural tendency to let competitors dictate prices. Instead, we have focused on\npricing techniques intended to erect and protect price fences that allow us to defend\nour value proposition from competitors.\n1. Legal Regulation of Pricing\nPeople of the same trade seldom meet together, even for merriment\nand diversion, but the conversation ends in a conspiracy against\nthe public, or in some contrivance to raise prices.\nAdam Smith\n\nOUT-PRICING\n1.1. Price fixing and bid rigging. In the United States, price fixing can be\nprosecuted as a criminal felony offense under Section 1 of the Sherman Antitrust\nAct. Price fixing is an agreement among competitors to raise, fix, or otherwise\nmaintain the price at which their goods or services are sold. It is not necessary that\nthe competitors agree to charge exactly the same price, or that every competitor\nin a given industry join the conspiracy. Price fixing can take many forms, and any\nagreement that restricts price competition violates the law.\nAny communication directly with competitors about prices or other elements\nof competition is strictly forbidden under US and EC antitrust laws. Even indi\nrect communication about prices may be treated as evidence of possible collusion\nwhich, combined with other evidence of collusive intent, could result in an antitrust\nindictment.\n1.1.1. Patterns that the FTC looks for when detecting price fixing.\n- Identical prices may indicate a price-fixing conspiracy, especially when:\n- Prices stay identical for long periods of time\n- Prices previously were different\n- Price increases do not appear to be supported by increased costs.\n- Discounts are eliminated, especially in a market where discounts historically\nwere given.\n- Vendors are charging higher prices to local customers than to distant cus\ntomers. This may indicate local prices are fixed.\n1.1.2. Red Flags to FTC in employee behavior. Each of the following situations has\ntriggered a successful criminal antitrust prosecution:\n- Any reference to industry-wide or association price schedules.\n- Any statement indicating advance (non-public) knowledge of competitors'\npricing.\n- Statements to the effect that a particular customer or contract 'belongs' to\na certain vendor.\n- Statements that a bid was a 'courtesy,' 'complementary,' 'token,' or 'cover'\nbid.\n- Any statement indicating that vendors have discussed prices among them\nselves or have reached an understanding about prices.\n1.1.3. Examples of successful price fixing prosecutions.\n- Alfred Taubman, the former chairman of Sotheby's auction house, served\n9 months of a one-year jail sentence for rigging fees charged to clients. He\nwas also fined $7.5m. Taubman acknowledged a dozen meetings with his\nChristie's rival but insists they never colluded. 'We were careful never to\n\nOUT-PRICING\ndiscuss anything that was illegal. And we knew the law and I knew it well,'\nhe said. 'Whatever we do, we mustn't discuss prices,' Mason said. 'Tennant\nsaid that was the first thing that Taubman mentioned to him.'\n- Airlines colluded between 2004 and 2006 to levy heavy fuel surcharges on\ntransatlantic flights. Virgin Atlantic escaped financial punishment because\nit came forward to expose the collusion. BA was fined $200 million by the\nOffice of Fair Trading, Britain's competition watchdog, and $300 million\nby the DoJ. Virgin Atlantic escaped financial punishment because it came\nforward to expose the collusion. Keith Packer, cargo manager, got eight\nmonths in US prison and a $20k fine for his part in rigging the cost of price\nservices to and from America.\n- Peter Baci, Senior VP of Yield Management for Sea Star Line, LLC, got 4\nyears in prison for fixing the prices of cargo shipped between the US and\nPuerto Rico. Baci claimed in court that he was acting on orders, but this\ndidn't help him at sentencing.\n1.2. Predatory pricing. Pricing low with an intent to drive your competitor out\nof business can be prosecuted under the anti-monopolization regulations of the\nSherman Act. However, the Supreme Court ruled in 1986 that fare wars that do\nnot drive out competitors are 'a boon to consumers,' and the government must\nbe very careful not to 'chill the very conduct the antitrust laws are designed to\nprotect.'\n2. Preempting Competitive Price Erosion\nOne thing to note is that in some sense competitive price erosion is becoming less\nof a concern empirically. According to RSR Research (January 2010), the extent\nto which 'pricing aggressiveness from competitors' was considered a challenge fell\nfrom 48% to 38%. Instead, price erosion became more driven by internal pressure\nto improve sales.\n2.1. Assessing risk of price erosion.\n2.1.1. At risk.\n(1) Falling Demand\n(2) Spare Capacity\n(3) Few differences in differentiation value\nBeer is classic example of a product where there is a potential for price wars. It is\nan undifferentiated product with high fixed costs. Falling demand due to increased\ndemand for wine and other alternatives.\n\nOUT-PRICING\n2.1.2. Not at risk.\n(1) Tight Capacity\n(2) Steadily Increasing Demand\n(3) Plenty of differentiation value. Razor-Blade or Two-Sided Markets are\nideal.\nIn April, 2009, in the UK, Amazon offered 100 popular MP3s at just 29p (0.50c)\nper download. Apple's iTunes store responded by raising prices on the most pop\nular MP3s to 99p, or $1.50. Apple could do this because of switching costs and\nsuperiority of iTunes experience.\n2.1.3. Cross-price elasticities. A cross-price elasticity measures the percentage change\nin unit sales for a firm's product to the percentage change of a competitor's price.\n% change in demand of product A\nEA,B =\n% change in price of product B\nIt is also possible to calculate a cross-price elasticity for your product using the\nlog-log transformation and the slope formula in Excel. The ys are the log of sales of\nyour good, the xs are the log of price of your competitor's goods. Ideally it would\nbe zero. Anything over 0.5 is worrying.\n2.2. Assessing competitor's pricing sophistication.\n- What are their price/cost structures?\n- Are they strategically sophisticated? You can only play a pricing game at\nthe level of your least strategic competitor.\n- Pricing Game:\n(1) You need to pick an selling price between $0 and $50 for this object\nwhich will maximize your chances of winning this competition.\n(2) This is a tricky market where the ideal price-discount is 20%. Any\nhigher, then people do not switch their brand allegiance. Any lower,\nthen people begin to doubt the quality of the product.\n(3) The person who picks a selling price at stage 1 which manages to\nundercut the average price by 20% (i.e. charges 80% of the average\nprice) will win this object.\nGroup\nAverage Iteration\nComputer Scientists\n3.8\nPortfolio Managers\n2.8\nHigh School Students\n1.6\nCEOS\n1.0\nStrategic pricing relies not only on an understanding of game theory but an\nunderstanding of how well your competitors understand game theory.\n\nOUT-PRICING\n2.3. Pricing threat. Selectively revealing information about capabilities and fu\nture plans can be useful in avoiding harmful negative-sum game. The goal of such\ninformation is to dissuade competitors from reducing prices and ever challenging\nthe firm's resolve.\n- Some strategists say that expanding capacity makes you so fearsome that\nno competitor dares cut prices for fear of your response.\n- However, the airline industry only regained profitability after they cut\ncapacity after 9/11. In 2003, the industry load factor had recovered\nfrom 9/11 and was the highest ever: 73.4% of available seats were\nfilled.\n- Talking about a cost advantage can sometimes backfire:\n- An early car computer software firm stated that competitors would\nnot be able to under-cut its prices since it had a cost advantage due\nto out-sourcing of call centers. Its competitors also moved their ser\nvice departments overseas, which led to price increases from the call-\ncenters.\n- Most effective strategy is to commit in public to fight back with pricing.\n- In the case of Winn-Dixie and Big Star vs. Food Lion, price matching\ncommitment lead to doubling of prices on 79 commonly purchased\nbrand items after two years as Food Lion raised its prices.\n- However, the recent 'secret memo' that was revealed about Best-Buy's\nattempts to circumvent its own price-matching policies shows problems\nof these policies.\n2.4. Talking to the press about pricing. Firms should take steps when commu\nnicating with the press to make sure that their pricing strategy is advantageously\nperceived by competitors, in the same manner as they manage perceptions of stock\nholders and securities analysts\n- Pre-announce pricing intentions and justify increases and decreases\n- Good Communication example: 'Serguei Beloussov...., the CEO said\nhe's now taking a cue from Apple, positioning Parallels [desktop virtual\nmachine software] as a premium product with improved quality and\nservice. What he says he won't do, is get in a price war with close\ncompetitor VMWare Fusion.' 'Beloussov is convinced that the best\npath to more market share is improving the product and support while\nadding more features than the competition. Mac users, he says are not\nas price-conscious as their Windows counterparts, and are willing to\npay more for a product that works well.'\n\nOUT-PRICING\n- Bad Communication example: In 1997 Compaq Computer Corp CEO\nEckhard Pfeiffer claimed that his company's new business model and\naggressive price cuts will not lead to the price war among major\nPC makers that some were anticipating. The company says...the an\nnounced prices make the DeskPros 6-8% cheaper than the comparable\nDell offerings. Pfeiffer [says]... all-out war will be averted because\ncuts by other manufacturers 'will come from their margins,' obviously\nsomething Pfeiffer feels won't carry too far given current market pres\nsure.\n- Explain yourself if you are changing your prices to avoid retaliation\n- Heart monitor manufacturer had to sell off multiple units that didn't\ncomply with proposed FTC regulation, so they reduced price. This\nset off a price war as their competitors did not understand what they\nwere doing.\n3. Responding to Competitive Price Erosion Using the Other 3Ps\nSabotage Customer Perceptions of Price Cut by exploiting Product, Promotion\nand Placement\n3.1. Product.\n- Develop a Fighting Brand. Read 'Should You Launch A Fighter Brand?'\nby Mark Ritson in Harvard Business Review, October 2009 before you do.\n- Intel used its Celeron chip to fight price wars with rather than its\npremium Pentium chips reasonably successfully.\n- Delta's Song airline did not stave off JetBlue.\n- Improved Product\n- Norton Anti-Virus. After McAfee came in offering 'Net-to-Zero' re\nbate, Symantec examined customer research showing that customers\nwanted more manageability across products (AV + Utilities). Instead,\nthey responded by shifting to a value bundle. Norton SystemWorks,\nwhich was a well integrated suite of great point products with a sin\ngle, easy-to-use user interface. Symantec built a lead in profitability\nfrom retail segments, while McAfee retreated and continued to invest\nin corporate solutions.\n3.2. Promotion. One danger of price wars is that a promotional message can get\nlost. However, promotion can actually be an effective tool to counter price erosion.\n- Southwest Airlines, for example, responded to American's value-pricing\nmove not with a price move of its own but rather with an advertising\n\nOUT-PRICING\ncampaign proclaiming, 'We'd like to match their new fares, but we'd have\nto raise ours.'\n- Don't get too complicated. A Medical device manufacturer told its client\nhospitals that if he was forced out of the market, they would be at the\nmercy of the larger company. With a monopoly position, the CEO warned,\nthe customers would find their short-term price cuts transform into long-\nterm price increases. This was not every effective as the hospitals were not\nsure how credible this was.\n3.3. Placement.\n- Form strategic partnerships with distributors and suppliers or complemen\ntary good sellers. Do not tell your distributors not to distribute a low-cost\ngood. That leads to jail time.\n- 2003, 3M was found guilty under Section 2 of the Sherman Act for a\nde facto exclusive dealing arrangements whereby 3M offered customers\nlarge cash payments to purchase their transparent tape exclusively\nfrom 3M. Damages totaled $68 million.\n- In 2001 Bed, Bath and Beyond planned to introduce Waterford/Crystal\nand China. However, Federated and May Co. secured the exclusive\ndeal for the purpose of preventing Bed Bath & Beyond from selling\nthe Lenox/Waterford products. Successful prosecution in NY state\nand million-dollar fines.\n- Criteria for legal action is any two of\n∗ Product boycott is horizontal (e.g., encompassing two or more\ncompetitors) as opposed to vertical (e.g., covering entities at\ndifferent levels of the distribution chain)\n∗ Designed to suppress price competition\n∗ Involves firms with market power or control over a critical source\nof supply.\n- Instead work with key buying influencers. For example, when Microsoft\nthreatened to enter the small business financial software market, Intuit\nstarted a special program to reach out to the 200,000+ accountants who\nprovide support for QuickBooks.\n3.4. Why not lower price?\n(1) Shallow-Pockets Trap\n- You may have deep pocketed competitors. Wal-mart vs K-mart in\n1990s.\n- Bromine manufacturer Dow defeated predatory pricing by a government-\nsupported German cartel, Bromkonvention. Bromkonvention had been\n\nOUT-PRICING\nflooding the US market with below-cost bromine, at an even lower\nprice than Dow's. But Dow simply instructed their agents to buy up\nUS Bromine at the very low price, then sell it back in Germany at\na profit but still lower than Bromkonvention's price. In the end, the\ncartel could not keep up selling below cost, and had to give in.\n(2) Low Quality Trap\n- Customers assume quality is low\n(3) Fragile Market Share Trap\n- The consumers you attract are not loyal. Sprint has found that its\nrecent 25% discount plan has led to higher churn. The problem is that\nthe defecting customers are only 2.6% of their total number of year\nend subscribers. The risk is that the other 97.4% of the customers are\ngoing to want discounts too.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n15.818 Pricing\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Pricing and IT",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-818-pricing-spring-2010/f3899294c9e77ec3e08153e957b0bc94_MIT15_818S10_lec06.pdf",
      "content": "PRICING AND IT\nContents\n1. Pricing and IT Systems\n1.1. Great uses for price optimization software\n1.2. Some problems these systems have faced\n2. Case Study: Google Adwords Pricing\n2.1. Adwords Pricing Process\n2.2. Lessons to learn from Google\n3. Pricing for Software Platforms\n3.1. Two-Sided Platforms\n3.2. Pricing strategies in two-sided platforms\n3.3. Implementation of two-sided platform pricing strategies\n3.4. Challenges with two-sided platform pricing\nIn today's lecture we discuss two separate issues. The first is how software\nplatforms can transform pricing. The second is pricing for software platforms.\n1. Pricing and IT Systems\nTheoretically, IT advances have the potential to revolutionize pricing. However,\nthere has been mixed success. Generally, they perform two functions:\n(1) Automating the calculation of price elasticities. This is very useful if you\nhave multiple difference SKUs or different sources of data. (See earlier\nlecture's battery example).\n(2) Suggesting a price based on these price elasticities given some kind of con\nstraint (such as limited or perishable capacity). This involves price opti\nmization.\n1.1. Great uses for price optimization software.\n1.1.1. Avoiding overcrowding. One optimal use for IT pricing software systems is\nwhen there is an externality problem. A good example is road congestion pricing,\nwhere a city prices roads higher during peak hours to deter drivers from driving\nthen. This is also the case for water parks, theme parks and so on. These are\n\nPRICING AND IT\nexamples of goods that have a very high fixed capacity and highly variable demand,\nleading to congestion at certain times that they need to manage.\n1.1.2. Avoiding spare capacity.\nThe most expensive thing in a restaurant is an empty table\nGus Bassele, restaurant marketer\nMost firms want to operate at something close to full capacity whenever they\ncan. By booking a hotel room, I am directly preventing another customer from\ntaking that hotel room.\nThis trade-off between pricing a room low and selling it now against waiting and\npotentially selling a room at the last minute for a higher price, has given rise to the\npractice of revenue management.\nThe good news is that Sloan is including more revenue management examples\nin the operations management class that is taught by Professors Vivek Farias and\nJeremie Gallien. Those of you who are thinking of working in the airline industry,\nthe travel industry, or any industry that has a fixed number of goods to sell should\ntake this class. Also, those of you with a operations management bent will learn\nuseful optimization techniques.\nIn a general sense, while optimization techniques for revenue management are\nimportant, equally important is constructing the right price fences to optimize\naround. Revenue can be improved by:\n- Identifying new pricing fences\n- Preventing arbitrage across existing pricing fences\n- Improving customer perceptions of pricing fairness\n1.1.3. Sometimes there are success stories outside of traditional revenue manage\nment domains. Generally most success stories outside of industries with fixed ca\npacities rest on a better understanding of price elasticities. Theoretically, optimiza\ntion systems could optimize over cost schedules, but I have come across no software\nsystems that do this very well primarily because managers simply do not know cost\nschedules.\n1.2. Some problems these systems have faced.\n(1) Used a price management rather than optimization tool.\n- Large department store invested in expensive pricing optimization soft\nware. Merchandizing set key commands on override and used it pre\ndominantly to manage the prices that they set using their 'super gut'.\n(2) Sometimes management uses it for uses it was not intended for...\n\nPRICING AND IT\n- Quote from USA Today (2007)\nA few years ago, 7-Eleven Inc. noticed that when\nit fought to \"beat down\" certain costs, so its con\nvenience stores could reduce some of the prices they\ncharged consumers, the effort wasn't always worth\nwhile, says Kay Trapp, manager for merchandise pric\ning. It turned out that several items with newly low\nered prices saw no change in sales. The chain bought\nprice-optimization software to get such insights in ad\nvance. \"We decided it made us smarter,\" Trapp says.\n(3) Limitations to the use of optimization software created for selling airplane\nseats in industries that have no capacity constraints..\n- Example of software that created artificial constraints in order to be\nable to say that it was optimizing.\n2. Case Study: Google Adwords Pricing\nA lot of these problems are caused because IT systems model people's pricing\nbehavior in the future as being like it was in the past. They also assume that people\nwill not try and outsmart the pricing software. However, it makes a lot more sense\nif IT systems instead were focused on giving incentives so that people were actually\nwilling to tell the firm what they were willing to pay. This is what Google has\nbeen able to do with its automated auctions for advertising search terms 'Adwords'\nsystem. By doing this, Google has transformed itself into the market leader in the\nprovision of advertising.\n2.1. Adwords Pricing Process. First, a quick description of the Google search\nterm auction mechanism:\nFirms enroll in Adwords\n-\n- They pick the particular search terms that they want their ads to display\nnext to\n- They then place a bid for each of these terms.\n- (Roughly) the firm that bids the highest amount has their ad displayed\nfirst, and pays the price bid by the second highest bidder.\n- I say roughly because Google also adjusts the price bidders pay based\non their 'Quality Score,' that is, how many customers click through on\nthe ad.\n- The second highest bidder's ad displays second, and they pay the price bid\nby the third highest bidder, and so on.\n\nPRICING AND IT\n2.2. Lessons to learn from Google.\n(1) Auctions can help price your good\n- Auctions are incredibly successful at encouraging buyers to state their\ntrue valuations. Think of the typical auction, where the winning bidder\npays the price bid by the second-highest bidder. Can you think of any\ncircumstances under which the highest bidder would choose to bid less\nthan they did?\n- It is no surprise then that firms that sell goods much prefer to use\nauctions when possible. 'About 80 percent of private equity firms in\na recent poll said they prefer to use auctions when acting as sellers.\nMeanwhile, about 90 percent of the same firms said they preferred to\navoid auctions when acting as buyers. (Auction Process Roundtable,\nMergers and Acquisitions, December 2006, pp. 31-32.)\n- Auctions therefore represent an attractive alternative to implementing\nrevenue management techniques. Rather than using historical data\nand assumptions, the firm simply gives customers the right incentives\nto state their true willingness to pay.\n- Items that were difficult to price through other means (for example,\nArt and Houses). These goods were characterized by high enough\nprices to make it worthwhile to run an auction.\n- Items that needed to be sold quickly and in bulk (for example trade-in\ncars, various financial instruments and Dutch flowers). It was worth\nwhile running an auction in order to be sure of quick sales.\n(2) Identifying the right type of network interaction to price can be crucial\n- Pay-per-click big success compared to pay-per-impression\n- Pay-per-action is less clearly a success\n(3) Pricing on the most micro scale possible is essential for profitability\n- (Goldfarb and Tucker 2009) show that crucially the most profitable\nsearch terms are the ones at the most micro level with the fewest\nsearches.\n- We provide evidence that Google is able to charge even more when the\nmarket is thin - that is, when the market is part of the long tail.\n- The crucial take-away is that to emulate Google's success in using\nelectronic auctions, the key thing to do is to use auctions to price the\nmost micro and specific version of your product that you can.\nQuestion: Why are advertisers willing to pay a higher average price per click for\nappearing first?\n\nPRICING AND IT\n3. Pricing for Software Platforms\n3.1. Two-Sided Platforms.\n3.1.1. What is a two-sided platform? The majority of new business models on the\ninternet are actually two-sided platforms. This is especially true for companies that\nMIT Sloan graduates set up. These are sometimes referred to as two-sided networks\nor two-sided markets. A two-sided platform is one where two groups interact over\na common platform or market.\nIn the Keurig Case, we thought hard about how to price strategically with lock-in.\nGenerally, there are large ties between markets which have 'lock-in' or razor-blades\npricing and markets that are two-sided platforms. For example, Keurig would have\nbeen a two-sided platform if it just acted as an intermediary for the roasters and the\ncustomers and did not attempt to sell coffee itself. The key difference in markets\nwhere there is just lock-in is that the customer's decision to purchase a product\ngives the firm purchasing power over him. By contrast, in a two-sided platform, the\ncustomer's decision to purchase a product also gives the network operator power\nover the purchasing decisions over those on the other side of the network.\nThere are three major different kinds of two-sided platforms (Evans and Schmalensee\n2007)1\n(1) Exchanges. These are typically networks that bring together disparate\ngroups of buyers and sellers.\n- Examples include craigslist.org, a Mall, eBay.com.\n(2) Software systems. Generally the platform is the operating system, and the\ntwo groups are computer users and program developers.\n- Linux, Windows\n- XBox, Playstation\n(3) Content-Based Markets. These are markets, such as newspapers, where on\none side there are advertisers and on the other side users who want access\nto the content.\n- The content can be user generated like on Facebook.\n- Or it can be generated by the website as in the case of yellowpages.com,\nSalon.com or (perhaps) Google\nThese markets tend to be characterized by high fixed costs and strong network\neffects.\n3.2. Pricing strategies in two-sided platforms. Pricing strategy for two-sided\nplatforms is more complicated, because there are potentially two sets of access fees\nand usage fees to set.\n1There are also payments systems, but these are too specific to discuss in this class\n\nPRICING AND IT\n- An access fee is the price paid to use the network technology, which is\nindependent of usage\n- A usage fee is the price paid to interact with someone else over the network\n(1) Identify the group that has larger spillovers for the other group\n- For example, a nightclub having more women customers is more likely\nto attract a large number of men than a nightclub having a large\nnumber of men is to attract a large number of women. Browsers bring\ngreater benefits to advertisers than vice versa.\n- We can use our Excel technique again to gauge the differences in elas\nticity between groups. We need to subsidize the group that has the\nlower absolute elasticity. In our example, men have a higher elasticity\nfor the presence of women than vice-versa.\n(2) We also need to identify the group that is more price-sensitive.\n- For example, lawyers' clients are more price-sensitive than lawyers\nthemselves.\n(3) If price-sensitivity and spillovers go in the same direction, that is great. If\nnot, then it makes strategic sense to reduce access fees on the price-sensitive\nside and raise the usage price for the less network-sensitive side.\nAnother strategy is to target subsidies so as to encourage a particular user of\nthe platform to agree to use your platform. For example, when Universal Studios\nagreed to make only HD-DVDs.\n3.3. Implementation of two-sided platform pricing strategies.\n(1) Exchanges\n- EBay is the classic example of a successful two-sided exchange network.\nThey charge both listing fees and transactional fees to their sellers.\n- Chemdex provided an online marketplace for sales of chemicals, en\nzymes, lab equipment, biotech products like peptides, and many types\nof chemical reagents. Chemdex signed up nearly 150,000 users who\nordered products from more than 2,000 suppliers. The Chemdex data\nbase listed around a million products from beakers to specialty bio\nchemicals. At the point of its IPO Chemdex recorded quarterly sales of\n$165,000, mostly to Genentech, and had lost $6.8 million in the same\nquarter. Yet it raised $112.5 million at IPO, and its stock rose 60% on\nthe first day, valuing the whole company (including those shares still\nprivately held) at over $750 million. Its value eventually shrunk to 1%\nof its previous value. It made its money by charging a 1 percent fee\non transactions. The problem with this company was that all their\nmarketing efforts ('Get a Free T-shirt!') were aimed at consumers.\n\nPRICING AND IT\nHowever, the real challenge was actually persuading suppliers to pay\nthe 5% listing fee. They simply could not see the value proposition.\n(2) Software systems\n- Adobe's revolutionary price model was to give away the reader for free\nand make people pay for Adobe Distiller.\n- Opentable charged restaurants to join its reservation service. After\na $1000 to $1300 system setup fee, restaurants paid $100 to $200 a\nmonth plus $1 for each honored reservation. This restricts the number\nof restaurants that it can sell for. Customers receive reward points. For\neach reservation a customer made, they earned $1. By 2009, Opentable\nhas served 75 million diners at 8,400 restaurants.\n(3) Content Markets\n- Platforms have to decide whether to charge people or use an advertising-\nbased model.2 This is not always obvious.\n- Facebook's big challenge is to think of a way of monetizing the interac\ntion between users and advertisers. The key issue they face is privacy\nconcerns.\n3.4. Challenges with two-sided platform pricing.\n(1) Make sure that you are subsidizing an attractive group of customers\n- FreePC learned this lesson in 1999 when it provided computers and\nInternet access at no cost to consumers who agreed to view Internet-\ndelivered ads that could not be minimized or hidden. Unfortunately,\nfew marketers were eager to target consumers who were so cost-conscious.\nFreePC abandoned its offer after losing $80 million.3\n- Youtube.com may just have the wrong kind of content to successfully\nmonetarize. Too much is highly personal.4\n(2) Product supply issues\n- One interesting side note is to think why it is that in a two-sided tech\nnology market such as a Playstation or an Xbox, firms persistently un\ndersupply the market initially. The real winners in such situations are\nthe game console profiteers who hawk the systems on eBay. Playsta\ntion 3s sold roughly for $1,500 on eBay just after the launch. The\nretail price was $599.\n(3) Lack of broad understanding of these issues can lead to legal problems.\n- Sometimes usage fees are very large. 'Rewards Network' is a two-\nsided platform that allows restaurants to offer coupons to potential\n2See 'Why You Didn't Pay To Read This', Slate.com, Oct 27, 2007.\n3Free-PC.com sets off 'sales' frenzy, 11 Feb 1999, ZDNET.co.uk\n4'YouTube Is Doomed', April 9 2009, Benjamin Wayne\n\nPRICING AND IT\nough its website. To acquire restaurants, Re\ncustomers thr\nwards Net\nworks offered restaurants advances of $10k to $25k. The restaurant\nrewards network received dining credits of 150% to 200% of the amount\nof the advance. So for example, if a restaurant was advanced $10k,\nthe Rewards Network would be entitled to sell its members $20k of\ncredit at the restaurant. They signed up 3 million customers and\n10,000 restaurants. However, they were then hit by an unfavorable\nclass-action suit for usurious interest rates.\n(4) Competitive Concerns\n- Why is the Kindle priced so high? Some observers have speculated it is\nto appease Amazon's standard publishing market. However, Amazon\nis also having trouble pricing e-books high where high is above $9.995\n- However, the iPad is priced even higher ($499 iPad costs around $290\nto make)\n5'Kindle Readers Ignite Protest Over E-Book Prices', Wired Apr 6, 2009, Priya Ganapati\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n15.818 Pricing\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Pricing Economic Value to the Customer",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-818-pricing-spring-2010/2318b493c551d7770340c79ff6de0c7a_MIT15_818S10_lec02.pdf",
      "content": "PRICING ECONOMIC VALUE TO THE CUSTOMER\nContents\nDefinition\nEVC example\nPractical Implementation of EVC analysis in a firm\nHow far should a firm discount from EVC?\nUsing EVC as a Pricing Formula\nUsing EVC as a Pricing Guideline for new products\nUsing EVC as a Pricing Diagnostic for existing products\nDefinition\nEconomic Value to the Customer (EVC) is based on the insight that a customer\nwill buy a product only if its value to them outweighs the value of the closest\nalternative, or when Utilitya ≥ Utilityb. The utility of a product depends on its\nvalue to the customer minus its price.\nV aluea - P ricea ≥ V alueb - P riceb\nRearranging gives:\nP ricea ≤ [V aluea - V alueb] + P ricebP ricea ≤ DifferentiationV alueab + P riceb\nRewriting [V aluea - V alueb] as the differentiation value between product a and\nb allows us to summarize product a's price ceiling as\nP ricea ≤ DifferentiationV alueab + P riceb\nTherefore, to sell a product, a firm needs to price at or below its competitor's\nprice plus the value advantage its product has to the customer over the rival prod\nuct.\n\nPRICING ECONOMIC VALUE TO THE CUSTOMER\nEVC example\nAtlantic Computer has developed software that allows their servers to host twice\nas much webspace as its rivals. How should they price this new software-server\ncombination?\n- Relative to buying two servers from Atlantic's competitor, by buying one\ndoubly efficient server from Atlantic, a firm would save $4,000 in labor costs,\n$500 in electricity and $1,500 in software licenses. This suggests that the\ndifferentiation value relative to the closest competitive offering is $6,000.\n- The price of two servers from the competitor is $6,800.\n- This suggests that the EVC of a server with the software is $6,000 + $6,800\n= $12,800.\nPractical Implementation of EVC analysis in a firm\n- Identify what benefit your product provides\n- Make sure you define a benefit, not a feature. Skill here reaps large\nrewards.\n∗ Xerox became very profitable because it priced per photocopy.\n- Identify closest competitive offering and calculate its price\n- Be honest about who your closest competitor is\n∗ For example, even though a B2B online video-calling service\nmay want to compare itself to dedicated-line video-conferencing\nsystems, its real closest competitor is Skype, which is free.\n- Be honest with yourself about the price that competitors sell their\nproduct for.\n∗ For example, a web back-up company calculated an EVC price\nthat was 100 percent greater than what they were charging.\nHowever, they omitted to include the fact that all their rivals\ndiscounted at 80 percent from list.\n- Get the units and time-horizon right. This is far easier to do when\nyou have defined the product's benefit properly.\n∗ For example, an cleaning product manufacturer left money on\nthe table by not reflecting the fact that its cleaner cleaned twice\nas much as its competitor.\n- Identify potential sources of differentiation value\n- Be specific, not vague. It is important that your firm's value proposi\ntion does not sound like it was churned out by generic software.\nMeasure how much value these create\n-\n- Have an independent lab do measurable testing.\n\nPRICING ECONOMIC VALUE TO THE CUSTOMER\n∗ For example, an air-filter company got a lab to measure the\nnumber of dust particles in the air and estimate the effect this\nwould have on asthma sufferers.\n- Often current customers are willing to take part in benchmarking stud\nies, as they view it as free consulting.\n∗ For example, W.W. Grainger offered consulting and measure\nment incentives to 15 clients who agreed to participate.\n- Add the reference price and differentiation values together to get EVC.\nThe next challenge is to determine how far below EVC the firm's ideal price\npoint will be.\nHow far should a firm discount from EVC?\nIt is a common misperception that EVC analysis implies that a firm should price\nat the EVC. This is not the case. The EVC describes only the maximum price a\nfirm might theoretically charge. Generally, a firm will decide to forego some of their\ndifferentiation value.1 There is some neurological basis for this 'fairness effect'.2\nYou're standing on the sidewalk with a friend, minding your own\nbusiness, when a man approaches with a proposition. He offers you\n$20 in one-dollar bills and says you can keep the money, under one\ncondition: You have to share some of it with another person. You\ncan offer this other person as much or as little as you like, but if\nthey reject your offer, neither of you get to keep any of the money.\nWhat do you do?\nThis suggests a 50 percent discount rule.\n- For example, Atlantic Computer ultimately priced not at the suggested\nEVC, but instead discounted its differentiation value by 50 percent ($3,000),\nso that it priced the product at $9,800.\nSet price closer to EVC if.\n(1) End-Benefit effect: When your product is an essential part of a known\nend-use.\n- Since Bridal Bouquets are a small but essential part of a large and\nexpensive end product, florists are able to charge a great deal more for\nthem than for other bouquets.\n(2) Shared-Cost effect: When the cost is shared.\n1Sloan Management Review 'Why the Highest Price Isn't the Best Price', Winter 2010.\n2'The Neural Basis of Economic Decision-Making in the Ultimatum Game', Science 13, June 2003.\n\nPRICING ECONOMIC VALUE TO THE CUSTOMER\n- Business hotels have been able to capture the customer's differentiation\nvalue for pillow-top mattresses and expensive bedding because usually\nthe firm is paying for the hotel stay.\n(3) Advantageous mental account: Customers have different mental accounts\nwhich they evaluate separately when they make purchase decisions. Price\ncloser to EVC if your product falls into an advantageous mental account\nsuch as 'Vacation Money' or 'Tax Refund Money'.\n- For example, success of travel agency selling Las Vegas packages that\noffered a $300 tax rebate special to coincide with the 2008 Bush tax\nrebate checks.\nMay have to price well below EVC if.\n(1) Uncertainty Effect: Uncertainty over realization of attributes\n- For example, a new anti-dandruff shampoo was unable to command a\nprice premium because its claims could not be verified by experts and\nconsumers knew that its effectiveness would vary.\n(2) Newness Effect: Attributes are new and therefore hard to understand\n- For example, Boxee is a 'freeware cross-platform media center software\nwith social networking features that is a fork of the open source XBMC\nmedia center software with some custom and proprietary additions'.\nSince customers are unlikely to understand the value that implies,\nthey may have to price below EVC when they release their hardware\n(allegedly) in 2010.\n- Make clear this is temporary. 1969 study: Five brands in two stores.\nOne had discount from initial price, other had no sign of discount. In\nall five cases, the store that had marked the discount as being from\nthe list price did better in the long run.\n(3) Expenditure effect: When it is a larger proportion of expenditure.\n- For example, an industrial carpet cleaner could charge higher prices\nto office managers than dedicated office cleaning companies.\n(4) When it is ethically right or legally appropriate to do so\n- Bottled water priced at $35 for a 12 pack during Hurricane Rita\n- North Carolina 'Price Gouging Law'. North Carolina defines price\ngouging as intentionally charging an unreasonably excessive price un\nder the circumstances for goods or services that are used by North\nCarolinians during an emergency to preserve, protect or sustain life,\nhealth, safety or economic well-being.\nMay wish to price below EVC for strategic reasons if.\n(1) Winner-takes-all market\n\nPRICING ECONOMIC VALUE TO THE CUSTOMER\n(2) Initial Customer Lock-In\n(3) Pre-empt competitive response\nWe discuss these in detail in weeks 3-6 of the course.\nThere are three ways that EVC analysis gets used (as a formula, as a guideline\nand as a diagnostic), which we now discuss in turn.\nUsing EVC as a Pricing Formula\nIt is best to use EVC as a pricing formula\n- When competitor's prices are well-known and concrete\n- When a product's differentiation value is easy to calibrate\n- When a product's differentiation value is easy and believable to communi\ncate\nThe Atlantic Computing example is an almost ideal setting for the use of EVC as\na formula.\nThe ideal setting for the use of EVC as a formula is one where the seller knows\nprecisely how the customer will use the product, and intimate details of their likely\ncost savings or net benefits of using the technology. This generally implies a man\nufacturing or engineering setting. This is no surprise, since consultants developed\nEVC analysis for these kind of industries. EVC can be particularly useful as a tool\nto help the sales force sell and prevent price erosion by allowing them to answer\nquestions like:\n- How can you justify charging that much for your product?\n- Why should I buy your product when your competitor's product is $3,000\ncheaper?\n- What is most worthwhile for our firm to keep in mind about your offering?\nHowever, the system should not be so complex that sales people bypass it.\nUsing EVC as a Pricing Guideline for new products\nEVC can be useful for a firm that is choosing the initial price of its product.\nThe classic example of this is Zantac. As a second entrant to the stomach ulcer\nmarket, it may have been natural for them to price at or just under the incumbent's\n(Tagamet's) price. However, EVC analysis demonstrated large differentiation value\nbecause of the twice-daily dosage format and fewer side effects, and as a consequence\nthey priced at 50 percent above the incumbent's price. In two years they were the\nmarket leader.\n\nPRICING ECONOMIC VALUE TO THE CUSTOMER\nUsing EVC as a Pricing Diagnostic for existing products\nEVC is a useful tool for establishing whether an existing product that is per\nforming poorly is overpriced or mis-promoted\n(1) Overpriced\n- Segway recognized that compared to its EVC, segways were felt by\nthe majority of customers to be overpriced at a price point of $3,000.\nTherefore the Segway company focused on finding ways of reducing\nthe average price, such as the use of Segway on one-day city tours.\n(2) Value message is not focused on crucial differentiation value\n- Michelin initially emphasized all its points of differentiation value such\nas longevity, speed and safety, in its advertising. Customer tests re\nvealed that their most salient and easy to communicate differentiation\nvalue was safety, and Michelin switched its advertising to emphasize\nthat, with great success.\n(3) Value message is not being communicated effectively\n- Duracell found out that its value message that it lasted for longer\nwas not believed by customers. Therefore they switched from a quan\ntitative message to one that emphasized that consumers should use\nDuracell batteries when reliability was crucial.\nIt is essential to conduct a form of EVC analysis before instituting a price cut, to\nprotect management from making the wrong decision.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n15.818 Pricing\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Pricing to Segment Customers",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-818-pricing-spring-2010/24b2de274486a33ad373351ec961166f_MIT15_818S10_lec05.pdf",
      "content": "PRICING TO SEGMENT CUSTOMERS\nContents\n1. Why the demand curve can be misleading as a concept for pricing\n2. Strategic assessment of whether a firm should move from a single price\nstrategy\n3. Customer-based price segmentation\n3.1. Implementation challenges\n3.2. Price discrimination with anti-competitive intent\n3.3. Ethical issues with customer-based price discrimination\n4. Product-based price segmentation\n4.1. Necessary criteria for success\n4.2. Different types of product attribute segmentation\n4.3. Challenges with product-line price segmenting\nAppendix A. An example using radiology information software\n1. Why the demand curve can be misleading as a concept for pricing\nIn the last lecture, we thought hard about how to measure the demand curve.\nBut it is important to also think about why it slopes downwards. The answer is\nvariation in how much our customers value our product.\nThe most crucial insight of this class is that we shouldn't think about where we\nshould price along our demand curve. Instead we should think, how many different\nprices to different customers can I charge along my demand curve?\nP riceH ≤ DiffV alueH\nab + P ricebH\na\nP riceL ≤ DiffV alueL + P ricebL\na\nab\nIn this familiar setting, by pricing at or below the 'Low' price a firm is leaving\nmoney on the table. The crucial question is always how your firm can charge a lower\nprice to low-valuation types and get them to 'enter' the market, but still persuade\nthe high-valuation types to pay the high price. During this class we will talk about\n'high' and 'low' types. This is just a short-hand for the multiple types along the\ndemand curve, and the aim is always to construct price strategies to price to all of\nthem.\n2. Strategic assessment of whether a firm should move from a single\nprice strategy\n(1) Does my product offering have differentiation value?\n(2) Can I identify 2+ customer value profiles who theoretically have different\nvaluations for my product?\n\nPRICING TO SEGMENT CUSTOMERS\n(3) Is there empirical evidence that these different customers actually have the\nEVC differences you expect them to have?\n- Very different price elasticities indicate that they do have different\nEVC.\n(4) Is there empirical evidence that customers in this value profile have similar\nenough EVC?\n- You can find out whether you have segmented enough, by trying to\nsegment again. If the new price-elasticities that you calculate are no\nticeably different from each other then you have not segmented enough.\nWhen marketers talk about customer segments, they are often thinking of a\ncertain type such as 'Denim Dads', 'Yoga Mommies', or 'Gen Y-ers'. However,\nwhen pricing analysts use the term 'segmentation', they are thinking of some\nthing far more specific. The aim of empirical analysis at all times is to identify\nand charge different prices to 'High' and 'Low' types. There are two main means\nof implementing segmentation: Customer-based and Product-attribute based. In\ncustomer-based price segmentation, the firm selects which prices the customer will\npay based on their observable characteristics. In product-based price segmentation,\nthe customer decides what price they will pay based on the product's observable\ncharacteristics. The firm's job is to create an appropriate pricing schedule and price\nfences between the different products.\n3. Customer-based price segmentation\n3.1. Implementation challenges. In customer-based price segmentation, the firm\nselects which prices the customer will pay based on their observable characteristics.\n(1) Unambiguous indicator of group membership\n- For example, veterinarians have veterinarian school certificates that\nthe firm could demand be produced for a discount.\n(2) Characteristic must be correlated with EVC\n- This is not always clear cut. We saw this in the empirical example that\nwe discussed in class, where the doctors had widely different valuations.\nThis is problem too in the real world.\n- For example, Quickbooks had been charging existing customers\nless because it reckoned that they would value an upgrade less\nsince they already had it. However, there was actually a split\nbetween those who valued it less and those who valued it more.\n(3) Product must not be tradeable across groups\n- An enterprising veterinarian could purchase the software and resell at\na profit to a hospital.\n- This explains why customer-based segmentation is found mostly for\nservices or experiences.\n3.2. Price discrimination with anti-competitive intent. A seller charging\ncompeting buyers different prices for the same 'commodity' or discriminating in\nthe provision of 'allowances' - compensation for advertising and other services\nmay violate the Robinson-Patman Act. This kind of price discrimination may give\nfavored customers an edge in the market that has nothing to do with their superior\nefficiency. Price discrimination is generally lawful, particularly if they prices reflect\n\nPRICING TO SEGMENT CUSTOMERS\nthe different costs of dealing with different buyers or are the result of a seller's\nattempts to meet a competitor's offering.\n3.2.1. Specific Legal Tests.\n(1) The Act applies to commodities, but not to services, and to purchases, but\nnot to leases.\n(2) The goods must be of like grade and quality.\n(3) There must be likely injury to competition (that is, a private plaintiff must\nalso show actual harm to his or her business).\n(4) Normally, the sales must be in interstate commerce (that is, the sale must\nbe across a state line).\n3.2.2. Anti-trust authorities look for.\n- Below-cost sales by a firm that charges higher prices in different localities\n- Price differences in the sale of identical goods that cannot be justified on\nthe basis of cost savings or meeting a competitor's prices; or\n- Promotional allowances or services that are not practically available to all\ncustomers on proportionately equal terms.\n3.2.3. Outcomes from Robinson-Patman.\n- Merck would sell the drugs to hospitals at a 92% discount from the cat\nalog price, but only if the hospitals reached certain market shares for the\ndrugs. Prosecuted for swindling Medicare/Medicaid by not offering these\ndiscounts.\n- Robinson-Patman explains why in Costco you enter a bizarre alternate\nuniverse of products for sale. Cereal comes in twin packs. Coke is available\nin cases containing 32 cans, not 24. Printer cartridges are sold in three-\npacks, not as singles or in pairs as at other stores.\n- Since the Brooke Group Ltd. v. Brown & Williamson and Volvo Trucks\nNorth America, Inc. v. Reeder-Simco GMC rulings there have been fewer\nsuccessful prosecutions. Plaintiffs have to show harm rather than intent.\n3.3. Ethical issues with customer-based price discrimination.\n(1) Price discrimination must be legal\n- In addition to Robinson Patman Act (1936): B2B regulation, EU de\nvelopments\n- Wheeler Lea Amendment: Bans unfair or deceptive acts in commerce\n- Racketeer Influenced and Corrupt Organizations Act (RICO). Victo\nria's Secret's differing catalog prices were prosecuted as mail fraud\nunder this act.\n- Some state laws forbidding gender based price-segmentation.1\n(2) Price discrimination must be culturally acceptable. It may be perceived as\nunfair or illegal even if it is not.\n- 2/3 of adult internet users believe that it is illegal for online retailers\nto charge different people different prices.2\n1See 'Is Ladies' Night Legal?', Gelf Magazine, September 2007\n2'Online shoppers seem naive about prices: Consumers unaware of 'price customization,' study\nfinds', Associated Press, June 1 2005\n\nan appropriate pricing schedule and to maintain appropriate price fences between\nthe different products.\n4.1. Necessary criteria for success.\n(1) Can identify an unambiguous component of differentiation value correlated\nwith overall EVC (e.g. convenience). Structure product accordingly.\n(2) 'Distortion': This component of differentiation value must be correlated\nstrongly enough with overall EVC that high-valuation types will pay a\npremium rather than not have it. Or in other words, you are going to force\nyour low-valuation types to signal that they have low-valuations because\nyou are going to distort your product quality downwards.\n- Comfort, Speed, Reliability, Ease of use are good places to start.\n(3) 'Compensation': This component of differentiation value must be not so\nessential that low-valuation types will never buy the product without it.\nPrice to compensate them. This is why we see discounts for economy class\ndiscomfort.\nI illustrate analytically the concepts of 'Distortion' and 'Compensation' in a\ndetailed mathematical illustration in the appendix to this handout. Though this\nis a highly analytical concept based on economic ideas of signaling, this is actually\nthe place where pricing becomes more of an art than a science. You will need the\nPRICING TO SEGMENT CUSTOMERS\n- Bloomberg waged a war on a Chinese restaurant that charged $1 more\non its English menu, though it was difficult to find a law to prosecute\nunder.\n- Controversy of supermarket chain that had unique '10 percent' mark\nup for stores targeted at Hispanic shoppers3\n- Sometimes, just sometimes, this can be resolved by better framing.\n- Disney customer-based discrimination would be a lot less palat\nable if they said they are going to charge more for adults, than\nif they said, as they do now, they are going to offer discounts to\nkids.\n(3) Privacy Issues\n- Customer-based price discrimination that makes use of past customer\ndata is often felt to encroach on a customer's privacy. This is becoming\nmore important in Europe, and latterly so in the US.\n(4) We worry about the ethical nature of price discrimination. I would argue,\nhowever, that when a company does not price-segment because it can't find\nappropriate metrics, then this can lead to just as bad consequences. For\nexample, in the early 2000s 90% of those who suffer from AIDS could not\nafford the prices charged for AIDS drugs.\nThe feeling that such a practice is not fair can be ascribed partly to a feeling\nof customer powerlessness. This has led firms to redesign their price segmentation\nstrategies to emphasize that customers have a choice into which bucket they fall.\n4. Product-based price segmentation\nIn product-based price segmentation, the customer decides what price they will\npay based on the product's observable characteristics. The firm's job is to create\n3See '9 questions with Nash Finch Co.' and 'Some grocery stores add 10 percent fee', Dan\nBoniface, 9news.com, October 10, 2008.\n\ngoods to not always come out in a perfectly consistent manner.\n(2) Capacity\n- Charging $199 for the 8GB IPhone, and $299 for the 16GB IPhone.\nHere the low-valuation types have to signal that they will not be using\na full range of the multimedia capacity of the IPhone.\n(3) Pleasantness\n- Sales rep in charge of 'economy line' at printing company that delivered\nmaterials to non-profits was deliberately chosen to be unpleasant.4\n(4) Convenience of Purchase\n- The classic example here is coupons. There were 253 billion coupons\nissued in 2005. Low-valuation types have to signal their low valuations\nby going to the bother of clipping and remembering the coupon.\n(5) Quantity\n- Low-valuation types signal their type by forgoing bulk discounts.\n(6) Channel\n- Bestbuy.com has better prices than Best Buy stores, but a low-touch\nenvironment. Those with low valuations have to signal this by being\nprepared to not see the product before they purchase it.\n(7) Geography\n- Supermarkets charge different prices depending on location. Often,\nhowever, such price differences are more a reflection of local competi\ntion than strategic price-segmentation.5\n(8) Add-on Pricing\n- The classic example of add-on pricing is where a hotel separates out its\nlow-valuation types (vacationers) from its high-valuation types (busi\nness people) by charging for incidentals such as internet access. Low-\nvaluation types have to signal their low values by being willing to go\nwithout internet.6\n- This kind of price-segmentation is very like feature-based price seg\nmentation except that the feature is explicitly optional.\n- The problem is that it can begin to feel like extra fees, which are\nseparately painful each time a customer incurs them.\nPRICING TO SEGMENT CUSTOMERS\nskill to identify a product feature or aspect of your product, where you can distort\nquality downwards and ultimately not annoy your customers. An obvious place to\nstart is to reframe the product choice as the idea that you are distorting product\nquality upwards from the low-value product, rather than vice versa.\n4.2. Different types of product attribute segmentation.\n(1) Reliability\nCommercial oven thermometers cost 10 times more than oven ther\n-\nmometers aimed at the domestic market, because they promise within\n2 degree accuracy rather than within 10 degree accuracy. Here the\nlow-valuation type have to signal that they are willing for their baked\n4Another example is 'The Mystery of the Rude Waiter: Why my favorite restaurant employs\nsuch a churlish lout, Tim Harford, Jan. 21, 2006'\n5See 'Wal-Mart Price Discrepancies Investigated', September 22 2008, WKMG\n6See How Much Should Hotel Web Access Cost? Sometimes it's free. Sometimes it's $20 a\nday. Why? By Steven E. Landsburg, Slate.com Wednesday, Feb. 1, 2006\nNews.\n\nPRICING TO SEGMENT CUSTOMERS\n(9) Timing of Delivery\n- High-valuation types are willing to pay more for early delivery of goods.\nThis can be as simple as charging a premium for express shipping. Or\nit can be as complex as skimming your initial market and pricing high\nfor early adopters, and then lowering prices for late adopters. Low-\nvaluation types therefore have to signal their low valuations by waiting\nfor the product to go mass-market. These kind of skimming strategies,\nhowever, can lead to customer unhappiness, as we saw in the case of\nApple with their IPhone pricing.\n4.3. Challenges with product-line price segmenting.\n(1) Finding attributes that correlate with EVC\n- For example, a skateboard manufacturer sold a premium line of skate\nboards with better wheels and colors, and also a discount stripped-\ndown line where there were few patterns and the wheels were obviously\nplastic. The stripped down basic skateboards sold out, and actually\nresold for higher prices on eBay than the non-stripped premium ver\nsion.\n(2) Ensuring the integrity of the different products within the product line is\nmaintained.\n- Customers can re-engineer low-segment products. For example, GPS\nfor boating was re-engineered to work for airplanes.\n(3) Perceived fairness for low-segment users\n- A catalog company found a negative effect on all sales for including\ndifferential pricing for 'plus-sizes'\n- Dell faced a backlash from all customers for its new XPS pricing\nscheme, where 'high-value' customers got access to faster technical\nsupport.\n(4) Price segmentation can unwittingly reveal your costs.\n- Fast-setting bandage material manufacturer revealed just how cheap\nits product was to make when it started selling its product as a novelty\ncraft item.\n(5) Can create bad publicity if price fences are found out\n- Best Buy got caught out with a secret website that customer service\nreps showed in-store customers, that supported its policy of charging\nless on the internet than in stores.7\n(6) Cost-Effectiveness of Separation\n- Maintaining different product features can be expensive. This can\nmean that it may in limited circumstances be necessary to discon\ntinue product-based price segmentation. For example, a baby carrier\ncompany had to discontinue organic line as it was too expensive to\nmanage.\n- Sometimes product segmentation goals can be lost to short-term profit\ngoals. For example, Alamo and National decided to co-locate their car\nrental services.\n7Press Release: Attorney General, DCP Commissioner Sue Best Buy For Deceiving, Over\ncharging Customers, May 2007 .\n\nPRICING TO SEGMENT CUSTOMERS\n- A similar story is true for rebates, which started off with the same\npremise as coupons, but retailers got addicted to slippage and people\nforgetting to send their rebate forms in.\n(7) Need pricing power\n- The problem here is generally non-strategic competitors. You are only\nable to maintain price fences while your competitors co-operate.\n- Some surprising industries are able to sustain the kind of pricing\npower that you need for price segmentation. For example, dry\ncleaners persist in charging more for women's blouses than men's\nshirts. 8\n- However, in ad-metrics industry a profitable add-on used to be\ntrademark infringement monitoring services, since these were\nof interest predominantly to lawyers and other 'high-valuation\ntypes'. However, profitability of this segment has been chal\nlenged by 'one-price-fits-all' start-ups.\nAppendix A. An example using radiology information software\nA radiology imaging services firm makes software that stores radiology images.\nThe marginal cost of this software is zero. There are two potential groups of\ncustomers for this product: Hospitals and Veterinarians.\nThe differentiation value of this software is that it allows a healthcare provider\nto compare and contrast more than one image at a time. In fact it actually allows\nthem to compare up to 10 images at once. Both Veterinarians and Hospitals prefer\nto be able to look at more images at once, than not. However, hospitals value the\nability to compare up to 10 images more than Veterinarians do, because the human\nanatomy is far more complex than the average dog or cat anatomy.\nThe ideal strategy. There are QH Hospitals and QL Veterinarians who compose\nthe market for this software. The EVC equations are simplified by assuming that\nbecause this software is so unique the appropriate reference product is no purchase,\nwhich has a price of zero.\nPH ≤ DV A + DV B\nH\nH\nPL ≤ DV A + DV B\nL\nL\nAt the moment the firm is following a \"penetration\" pricing strategy where they\nprice at DV L\nA + DV L\nB = PL to everyone in order to maximize sales. Therefore\nprofits are\nΠcurrent = PL(QH + QL)\nIn a dream world, the firm would divine whether the customer is a High or Low\ntype and charge them accordingly. The profits of doing so would be equal to\nΠdream = PH QH + PLQL\nThis would increase profits over the firm's current pricing strategy by (PH -\nPL)QH . In the real world, however, the software firm would be worried that if they\n8Taken to the Cleaners? Nobody can explain why laundries charge less for men's shirts than\nfor women's, even E. Landsburg, Slate.com. July 3, 1998\n\nPRICING TO SEGMENT CUSTOMERS\ncharged a Veterinarian one price and a Hospital another price for this software, as\nthe Veterinarian would just resell it to the Hospital.\nProduct-based price segmentation. Product-Based Price segmentation is where the\ndesign of the product is such that it encourages customers to signal whether they\nare a high-valuation or a low-valuation type through their choice of product. High-\nvaluation types value the software more in two dimensions: the number of images\nit can composite (A) and high-quality documentation that facilitates the use of the\nsoftware (B).\nThe high-valuation types value the number of composite images more.\nDV A\nH > DV A\nL\nThe high-valuation types also value the documentation more.\nDV\nB\n> DVL\nB\nH\nThe challenge is how to use these differences in valuations to segment the market.\nLet the firm designs two products.\n- Complete product\n- Discount product (which has no documentation).\nThe aim is to ensure that high-valuation types choose the complete product and\nthe low-valuation types choose the discount product. In particular, high-valuation\ntypes must be deterred from pretending to be low-valuation types and buying the\ndiscount product. Therefore the price of the complete good needs to be less than\nthe net benefits of the discount good given its lower price and lower differentiation\nvalue. But this is simply the binding EVC equation.\nP C = P D + DV\n.\nB\nH\nFor high-valuation types, the reference product is now endogenously determined\nby the choice of price for the discount product. For low-valuation types, the outside\noption is still no software with a price of zero. To ensure that they buy the product,\nthe firm needs to price at:\nP D = DV\n.\nA\nL\nTherefore, recognizing that by offering this discount product the reference price\nhas now changed for high-valuation types, means that the firm prices the complete\nproduct at:\nP C = DV A\nL + DV B\nH\n.\nHow do these prices do compared to the perfect segmentation ideal? Ideally, the\nfirm would charge low-valuation types:\nPL ≤ DV A\nL + DV B\nL\nBut under product-based segmentation, the firm instead charges low-valuation\ntypes:\n\nPRICING TO SEGMENT CUSTOMERS\nP D = DV L\nA\nTherefore the firm distorts prices downwards by DV L\nB , to compensate low-\nvaluation types for the fact that they have to choose not to get the documentation\nto signal that they are the low-valuation type. Ideally the firm wants to charge\nhigh-valuation types a price of:\nPH ≤ DV A + DV B\nH\nH\nBut under product-based segmentation, the firm instead charges high-valuation\ntypes:\nP C = DV L\nA + DV H\nB\nTherefore the firm distorts price downwards by (DV A - DV A) to bribe the\nH\nL\nhigh-valuation type to buy the non discount product.\nA.0.1. Profitability. For product-based price segmentation to be profitable requires\nit to be more profitable than current pricing practices.\nΠpbsegmentation ≥ Πcurrent =\nP C QH + P DQL ≥ PL(QH + QL)\n(DV A + DV B )QH + (DV A)QL ≥ (DV A + DV B )(QH + QL)\nL\nH\nL\nL\nL\nTherefore the profitability condition for customer-based price segmentation is:\n(DV B - DV B )QH ≥ QLDV B\nH\nL\nL\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n15.818 Pricing\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Pricing under Consumer Uncertainty",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-818-pricing-spring-2010/8bfe4b9ed4dffc78756906f4025033fe_MIT15_818S10_lec03.pdf",
      "content": "PRICING UNDER CONSUMER UNCERTAINTY\nContents\n1. When customers do not know reference prices\n1.1. Product Line Strategies\n1.2. Discounting Strategies\n1.3. Price Cues\n2. When pricing affects a customer's valuation\n2.1. Timing Strategies\n2.2. Asymmetric information about product quality\n2.3. Signaling by the customer\nIn the last lecture, we focused our attention on how firms can use EVC as a\nconceptual framework to guide their thinking about pricing. We emphasized the\nimportance of value communication, given that what matters is 'perceived differen\ntiation value' rather than the firm's notion of differentiation value. In this lecture,\nwe cover how firm strategy has to change when customers stop making decisions\nbased on price and start using price to make decisions.\nA reworking of the EVC framework to emphasize consumer behavior would be.\nP ricea ≤ (P erceivedRefP riceb|P riceab) + (PerceivedDiffV alueab|P riceab))\nWe discuss in turn:\n(1) How to make consumers feel comfortable about a price when they are not\nclear about the reference price\n(2) How price can influence the perceived differentiation value of the product\n1. When customers do not know reference prices\nMany customers do not know prices. A recent MIT study interviewed people\nin line at the store. They found that while 80% of customers thought they knew\nthe price of the objects in their basket, only 50% did know the price. Given their\nrelative lack of price knowledge, customers often seek 'price cues' to inform them\nas to whether it is a good deal or not. This lack of price knowledge means that\n\nPRICING UNDER CONSUMER UNCERTAINTY\nthey constantly look for clues as to whether this price they are seeing is going to\nbe a good 'deal' relative to an unknown reference price.\n1.1. Product Line Strategies. The compromise effect is a crucial behavioral\nimpulse when designing prices. Customers often choose the mid-priced option to\nprotect themselves from making a bad choice. The implication here is that one can\nincrease profits by adding a low-price or high-price option in addition to an existing\nproduct.\n1.1.1. Considerations for Compromise Effect.\n- Not just for B2C markets.\n- Works successfully in B2B markets. Purchasing agents are never crit\nicized for purchasing the mid-price option.\nNeeds to be same brand.\n-\n- Lab evidence shows that if you add a premium brand as a decoy prod\nuct it doesn't have the shift consumers from low-price option to mid-\nprice option.\n- Everyone at the firm needs to know what the intention of introducing 'de\ncoys' is.\n- Architectural software firm lost money after sales force manager mis\nunderstood its decoy premium product and started discounting it to\nmatch the mid-price product.\n1.2. Discounting Strategies. One way that firms can signal that their price will\nbe cheaper than the unknown reference price is to advertise a discount, so that the\nreference price is anchored upwards.\n1.2.1. Proportional Discounts.\n- People tend to think of prices in terms of proportion or percentage changes\nrather than absolute changes. Take for example the following decision.\nThere is no absolute difference in money saved, but consumers respond\ndifferently.\nGood\nPC\nXerox\nStick with order of machine for $1,000 $20,000\nCancel and re-order one for\n$600 $19,600\n- When discounting, discount cheapest part of the product bundle\n- More effective to discount off dessert than total meal.\n- More effective to discount car financing than entire car price.\n\nPRICING UNDER CONSUMER UNCERTAINTY\n- The percentage change from 0 is infinity, which perhaps explains why cus\ntomers like free products so much. An MIT experiment just showed that\ngoing from free to 1 cent for a chocolate can reduce demand by 17 percent,\neven if competitive products also increase by 1 cent.\n1.2.2. Credible Discounting.\n(1) MIT research suggests that effectiveness of sales signs decreases at around\n30 percent saturation.\n(2) Pricing software needs to reflect the need for credibility\n- JCPenney recently started discounting earlier but less (10 percent dis\ncounts) rather than 20 percent discounts, on basis of projections from\npricing software\n(3) Firm needs to give credible reasons\n- GM's employee discount program was so successful because it signaled\na 'large' discount.\n- Similarly, liquidation sales are successful because again there is a cred\nible reason for the firm to be discounting.\n1.3. Price Cues.\n1.3.1. Key Item Pricing. Most popular strategy used in retail. Takes advantage\nof the fact that consumers know the price of a few items and retailers price these\naggressively. Works well in the lab. Less real-world evidence it works well because\nrepeat purchase items often have huge fluctuations in prices rendering customers\nprice knowledge imperfect.\n1.3.2. Price Endings. $9 endings are effective at signalling value relative to an un\nknown reference price.\n- Previously, $9 endings have been taken as reflecting left-to right process\ning by customers (for example, a customer believes that a sweater that is\nmarked $9.99 is closer to $9 than $10).\n- However, more recent research suggests a more nuanced relationship with\nthe company's brand message. (e.g. Discount Stores vs. Art Galleries)\n2. When pricing affects a customer's valuation\nThe price of a product itself can send important signals about the product.\n2.1. Timing Strategies. Getting the timing of pricing right can actually aid how\nmuch consumers enjoy your good. Basically, consumers prefer to avoid a payment\nthat is timed when either they are enjoying the good, or when they expect in\nparticular to not enjoy the good.\n\nPRICING UNDER CONSUMER UNCERTAINTY\n2.1.1. Practical timing considerations.\n- Decouple the pain of paying from consumption for experience goods\n- For example, people are willing to pre-pay and pay a premium for\nthings they enjoy (such as vacations)\n- Decouple the pain of paying from the pain of learning how to use a tech\nnology good.\n- Customers are more likely to switch if they do not have to pay full\nprice for a technology service in the same month they are learning\nhow to use it.\n- Decouple pain of paying from possibility of bad experience of products.\n- Cellphone companies gain more customers if they preannounce an au\ntomatic rebate when there is service interruptions.\n2.2. Asymmetric information about product quality. High prices may imply\nhigh quality if quality is uncertain.\n- Do you want the cheapest surgeon to perform laser eye surgery on you?\nHowever, the question remainsL: Why does this work? It isn't credible that these\nprices reflect costs (for example having better-quality lasers). The bad surgeon\ncould have bad lasers and still charge a high price.\nGenerally, high prices as a signal of quality work well with:\n- Customers of middling sophistication who are uncertain about quality\n- Some survey evidence of limited ability to think iteratively through\nthe credibility of price as a signal of quality\n- Scenarios when people who are not knowledgable anticipate that there will\nbe repeat or more knowledgable purchasers in the market too.\n- I might buy more expensive cigars as I assume they are priced right\nfor cigar fans\n- Capacity constraints\n- Show promoters in Vegas sell more seats at higher prices\n2.2.1. Other occasions that price influences quality.\n- High prices may signal 'quality' of fellow shoppers\n- If you subscribe to a cheap dating service, you may just meet cheap\npeople.\n- High price being equated with high quality is so ingrained in customer\nbehavior that it has a neurological component.\n- For example, customer perceptions of the quality of wine are affected\nby price. This has been confirmed by neural imaging.\n\nPRICING UNDER CONSUMER UNCERTAINTY\n2.3. Signaling by the customer. One potential source of differentiation value is\nfor Veblen or 'snob' goods, where part of the product's appeal is its high price.\n- High prices allow customers to signal their worth to other individuals\n- When a fountain pen manufacturer raised its prices, it sold more.\n- It also allows customers to signal their worth to themselves\n- It also allows gift-buyers to signal the value of their present.\n- Scottish whiskies had difficulty in Japan when they tried to enter with\nlower prices.\n- L'Oreal has had huge success with the 'Because you're worth it' cam\npaign\n\nPRICING UNDER CONSUMER UNCERTAINTY\nFigure 1. When to emphasize EVC and when to emphasize con\nsumer price framing considerations\nTo summarize: There is a clear use for EVC but there is also a clear use for price\nframing. The art of pricing is realizing which to emphasize and when.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n15.818 Pricing\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Summarizing Pricing",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-818-pricing-spring-2010/1f716eaea678af6c196ac393ad17efad_MIT15_818S10_lec08.pdf",
      "content": "SUMMARIZING PRICING\nContents\n1. Pricing Aim\n2. Pricing Menu\n3. 10 Challenges to Pricing Intuition\n1. Pricing Aim\nUse of\nPricing\nData\nPricing\nSophistication\nPrimitive\nPricing\n-Gut Feel\n-Cost Plus\nReactive\nPricing\n-Competition\nbased\n-Some Excel\nAdaptive\nPricing\n-Fact based pricing\napproach\n-Reactive to\ncustomers\nPre-emptive\nPricing\n-Complex Price\nSegmentation\n-Novel Pricing Metrics\n-Experimentally driven\npricing approach\nFigure 1. A taxonomy of pricing strategies\n\nSUMMARIZING PRICING\n2. Pricing Menu\nNew product to price\nLimited field tests\nframed as\nintroductory pricing\nB2B\nEVC Analysis with\nBenchmarking\nStrategic Analysis\nof EVC discount\nB2C\nOpen ended\nprice questioning\nMonadic/Conjoint\ntests\nFigure 2. Pricing a new product\nImproving pricing for\nexisting product\nUse EVC as initial\ndiagnostic\nObtain broad historical\ndata\nCalculate price\nelasticities for different\nproducts/customers\nDevelop price\nsegmentation fences\nFigure 3. Pricing an existing product\n\nSUMMARIZING PRICING\n3. 10 Challenges to Pricing Intuition\n(1) If we use cost-plus pricing, we will make a profit\n- Only if you are incredibly accurate with your sales projections\n(2) Our customers always prefer low prices\n- Customers will always say they like lower prices. However, in many\nmarkets price serves as a guide to quality, and pricing too low can send\nout a negative signal.\n(3) Our customers do not know prices, so our pricing strategy is unimportant.\n- Lack of customer price knowledge makes how you present the price\neven more important. This is where strategies such as good-better\nbest and price ending cues are key.\n(4) Simpler pricing structures are better.\n- You always want three prices. Simplifying pricing structures means\ngiving away money. Due to the taxi-meter effect, customers may not\nalways appreciate it when firms do price simply.\n(5) If we are profitable, we do not need to price-discriminate.\n- On the contrary: Price segmentation is actually going to be most\neffective for already-profitable firms, because effective segmentation\nrequires the market power implied by profitability.\n(6) Razor Blade pricing works because our customers are stupid\n- Razor blade pricing works because it is actually subtle price segmen\ntation. High-value, high-usage customers pay more. Low-value, low-\nusage customers pay less.\n(7) Our product has network effects, so we need to set a low price\n- Your product may well not have network effects at all.\n- Even when a product has network effects, price segmentation is key.\nThe crucial questions for network goods are: Whom do I set a low\nprice to and whom do I set a high price to?\n(8) Firms need to adjust prices until I fill capacity.\n- It can be more profitable to have unused inventory or capacity.\n(9) Industries need to work together to ensure that they avoid harmful price\nwars\n- Statements like this lead to jail time. It is the responsibility of the\nfirm, and the firm alone, to avoid a price war.\n(10) Our competitors understand our pricing strategy\n- Firms have to actively manage perceptions of their pricing by com\npetitors, regulators and other stakeholders.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n15.818 Pricing\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "B2B Negotiations",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-818-pricing-spring-2010/9e05bee8e87e63b65e339e7e60a5b552_MIT15_818S10_supp01.pdf",
      "content": "B2B NEGOTIATIONS\nContents\n1. Price Waterfall Analysis\n1.1. Action plan\n2. Negotiation\n2.1. Say: Our price is X\n2.2. A Final Story\nB2B is pretty unique to the extent that pricing negotiations are key to most\npricing outcomes. Consumer products (with the exception of cars) very rarely have\nnegotiated prices.\n1. Price Waterfall Analysis\nFirms must understand how sensible the prices are that your current negotiation\nprocess is leading to.\n1.1. Action plan.\n- Plot the price paid against the number of units bought by the customer.\nOften it becomes evident that your best (high-volume) customers are paying\nmore per unit than your less profitable customers. This is not a recipe for\nhappy and long-term relationships.\n- One often-recommended solution is to construct a 'price waterfall' chart.\nThis allows you to work out the true net price for each customer.\n- Start with 'Transaction price'\n- Net Rebate\n- Net Allowance\n- Net Discount\n- Calculate final 'Pocket Price'\n2. Negotiation\nPrice often looms larger in sales reps minds than in repeat buyers minds. You\ndo not know if the price is too high until you lose the sale\n- Establish economic value before discussing price\n- Be the first person to bring up price: If you dont talk price, your customer\nwill.\n- 94% of sales reps do not talk price until their customer does\n- 1/3 will not say price ever, will only write it down or point\n\nB2B NEGOTIATIONS\n2.0.1. Implement Pricing Policy via a Price Menu.\n- Establish consistent, transparent criteria for discounting - Fixed prices,\nFlexible offers\n- Never give ad-hoc discounts to repeat customers\n- Reward loyalty and trial, not sheer volume\nStudy of 64 firms who dropped vendors\n- Price was reason vendor was dropped 8.1% of the time\n- 70.2% delivery problem\n- 9.4% quality problem\n- 6.2% service problem\n2.1. Say: Our price is X. Be firm. Do not be descriptive. Ban Phrases like:\n- Regular, normal, list, book, lowest, best, reduced, basic, usual price\nThe best I can do\n-\n- We can work a little on this price\n- Our price is lower than anyone else\n- Our price is less than a bag of chips per widget\n- How does $100 sound to you? Am I in the ballpark?\n- Tell me where I need to be. What do I have to do to get your business?\n2.2. A Final Story. Two village idiots wanted to invest $100 they won in the\nlottery. They went to a pumpkin farmer they knew and bought 100 pumpkins at\n$1.00 each. After finding a good place to park and sell the pumpkins from their\ntruck's flatbed, they started selling them at $1.00 each. When they sold that load\nthey went back to the farmer for more. After selling several truck loads they counted\ntheir money and realized they still had only $100. After counting it several more\ntimes to be sure, Charley said to Bobby, \"This is getting us nowhere! We sold all\nour pumpkins, but we still only have $100. Something's wrong but I surely can't\nfigure it out.\" Bobby said to Charley, \"You idiot, I was gonna let you figure it out,\nbut you're just too dumb since you didn't even finish the third grade. It's as plain\nas the nose on your ugly face that the only way we can make money is to get a\nbigger truck!\"\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n15.818 Pricing\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Pricing Beyond the 3 Cs",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-818-pricing-spring-2010/f606231bdd98ee76b12107bbefde0bf9_MIT15_818S10_lec01.pdf",
      "content": "PRICING BEYOND THE 3 CS\nContents\n1. Why Study Pricing?\n2. Three Cs and Pricing\n2.1. Cost-Based Pricing\n2.2. Customer-Based Pricing\n2.3. Competition-Based Pricing\n3. To Summarize\n1. Why Study Pricing?\n(1) Even slight improvements in pricing can yield significant results. For ex\nample, for a company with 8% profit margins, a 1% improvement in price\nrealization, assuming a steady unit sales volume, would boost the compa\nnys profits by 12.5%. By contrast, decreasing fixed costs by 1% would only\nlead to an increase in profits of 4%. (Dolan 1992)\n- Continental Airlines had 44 million passengers in 2001, at an average\nticket price of $193. Charging $2, or 1.04%, more per ticket would\nhave transformed a loss into a profit.\n(2) 80% of managers know how much it costs to produce their product. 23%\nsay they know their customers' willingness to pay for the product.\n(3) 41% of firms have identified their inability to recruit employees with the\nright pricing tool sets as their major barrier to implementing pricing prac\ntice overhauls.\n2. Three Cs and Pricing\nTypically an introductory marketing class teaches that any pricing strategy\nshould reflect the '3 Cs' of pricing:\nCosts\n-\nCustomer\n-\n- Competition\nAdvanced pricing analysis, however, views the 3 Cs as describing a set of con\nstraints that pricing strategies must overcome to succeed. The 3 Cs also describe\nthree bad pricing strategies.\n\nPRICING BEYOND THE 3 CS\n- Cost-Based Pricing. Or, pricing on the basis of what it costs you to make\nthe product.\n- Customer-Based Pricing. Or, allowing your customers to dictate your pric\ning policy.\n- Competition-Based Pricing. Or, choosing your pricing strategy exclusively\non the basis of what your competitors do.\n2.1. Cost-Based Pricing. Cost-Based Pricing involves setting a price such that\nP rice = (1 + percentmarkup)(UnitV ariableCost + AverageF ixedCost)\nPractical implementation problems:\n(1) You have to know costs.\n- A baby sleepsuit company made a loss despite engaging in cost-plus\npricing, because they did not realize how much their packaging cost.\n- For example, Diamond Deliveries in Philadelphia. The bicycle divi\nsion, which management thought of as Diamond's core business, gen\nerated just 10% of total revenues and barely covered its own direct-\nlabor and insurance costs. Diamond was charging customers $4.69 per\njob, but with fully allocated costs of $9.24 per job, the company was\nlosing $4.55 every time a cyclist picked up a package.1\n- You need to be able to estimate the costs of everything.\n(2) Costs are a function of sales which are in turn a function of prices. This\nmakes such calculations circular. Imagine a firm whose average costs de\ncrease with sales.\n- If they sell less, their costs go up. But is a time of declining sales really\nthe right environment to increase prices?\n- For example, Wang Computer\n- If they sell more, their costs go down. But pricing at average cost\nfor small-scale capacity means that the firm may never discover this.\nThis is an issue for firms that face large economies of scale or unknown\nexperience curves.\n- For example, an aeroplane manufacturer found that every time\nthey managed to double their sales, they reduced labor time per\naeroplane produced by 10 percent.\n(3) Cost-based pricing is misplaced in industries where there are high fixed\ncosts and near-zero marginal costs. Distributing fixed costs is hard.\n- Complicated when products affect fixed costs in different ways.\n1'Are We Making Money Yet?', Inc Magazine July 1 1995.\n\nPRICING BEYOND THE 3 CS\n- Activity-based pricing is where the customer agrees to pay the price\nwhen the cost is determined with an agreed mark-up based on the con\ntribution to fixed costs. Activity-based pricing is better than regular\ncost-based pricing in such situations.\n- For example, Owens Minor, a medical supply equipment distrib\nutor, improved pricing performance by adjusting its mark-up to\nbe higher on adult diapers compared to replacement ultrasound\nfilm.\n(4) Ignoring the value you create leads to underpricing\nPet Rock\n-\nRather than asking what prices firms need to charge in order to cover their costs\nand achieve their profit objectives, firms should ask how their pricing strategy will\naffect their cost structure.\n2.2. Customer-Based Pricing. There are many versions of customer-based pric\ning.\n(1) B2B: Salesforce allows purchasing agents to dictate their prices.\n- An aquarium cleaning product firm sold below their cost because they\nwere scared of losing the custom of a big-box retailer.\n(2) B2C: Giving away a valuable product or add-on for free because the com\npany fears a customer revolt.\n- Flickr hosts 4 billion images (as of Oct 2009). However, the user base\nis so passionate that managers are reluctant to charge more.\nThe problems with customer-based pricing are that:\n(1) Customers do not reveal how much they value the product\n- Radiohead launched a 'pay what you want' scheme for their album 'In\nRainbows'. 62 percent paid nothing. Average price of $2.26 an album.\n(2) Customers need to be educated about the value of the product\n- For example, it was hard for customers to understand what TiVo of\nfered over a traditional VHS recorder.\n(3) When customers are used to being in control of a firm's pricing, they revolt\nat price changes\n- Turbotax starting charging users $9.95 for each additional return they\nfiled. Users revolted and gave them a 1.5 star rating on Amazon.\nThe company retreated, reverted to charging nothing and refunded\nthe money.\n- Resident Evil 5, a computer game, tried a different approach: 'This\nis the part where I get to say 'BS',' the vice president of Strategic\nPlanning & Business Development wrote on the Capcom forums. 'RE5\n\nPRICING BEYOND THE 3 CS\nis well worth every penny of $60. A huge game, with tons of replay\nvalue, loads of unlockables, new weapons, co-op, mercenaries mode,\netc. If any game warrants its price point, it's RE5'\nInstead of asking themselves what their customers would pay, firms should ask\nthemselves what are the prices at which they can convince their customers are\nsupported by their product's value. How can they segment to reflect differences in\ncustomer valuation?\n2.3. Competition-Based Pricing. Competition-based pricing describes the sit\nuation where a firm does not have a pricing policy that relates to its product, but\ninstead a pricing policy that reflects its competitors' pricing decisions.\nSometimes this simply takes the form of a firm copying their competitor's pricing\nand not conducting their own pricing research.\nSometimes such pricing can take the form of a firm setting a market share ob\njective and discounting their price relative to their competitor until they attain\nit.\nThe problems with competition-based pricing are that:\n(1) It encourages firms to ignore their unique value proposition\n- A radiology software firm with a unique 3D capability lost millions\nbecause they priced at the same price as the marketing leader.\n(2) It can lead to price wars\n- If a firm sets a market share objective when the market size is fixed or\ndeclining, then this immediately signals that this gain in market share\nwill come at the loss of a competitor. This leads to price wars.\n- For example, the 2005 price war between Anheuser-Busch and Miller\nwas provoked by flat sales.\n(3) Focusing on market share does not necessarily lead to maximum profits\n- Even in industries with large economies of scale, some segments of the\npopulation are more profitable to serve. In the UK, cable companies\nhave often ignored this and focused on extending their market share\nto rural villages.\nInstead of setting market share objectives, firms should focus on identifying the\nmost profitable segments to serve, and finding ways of profitably serving them while\nprotecting themselves from price wars.\n3. To Summarize\nThe 3 Cs are often thought of as pricing 'dos', but they can just as well describe\npricing don'ts.\n\nPRICING BEYOND THE 3 CS\nGenerally, the problem is that each of the 3 Cs encourages a powerless approach\nwhen it come to pricing. In all cases, the firm is reacting to a constraint, rather\nthan shaping that constraint. The rest of this course will focus on how we can\nshape customer and competitive reactions to our pricing strategy, in a way which\nmeans that firms do not have to worry about hitting the cost floor.\nA more attractive reworking of the 3 Cs would be:\n- Create Value\n- Calibrate Value\n- Communicate Value\n- Capture Value\nThe course is based around these new 4 Cs.\nFigure 1. Aim of 15.818: Tools to allow students to transform\nindustries into pricing leaders Source: Based on Deloitte Analysis\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n15.818 Pricing\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}