{
  "course_name": "Principles of Naval Architecture",
  "course_description": "This course presents principles of naval architecture, ship geometry, hydrostatics, calculation and drawing of curves of form, intact and damage stability, hull structure strength calculations and ship resistance. It introduces computer-aided naval ship design and analysis tools. Projects include analysis of ship lines drawings, calculation of ship hydrostatic characteristics, analysis of intact and damaged stability, ship model testing, and hull structure strength calculations.",
  "topics": [
    "Engineering",
    "Mechanical Engineering",
    "Fluid Mechanics",
    "Mechanical Design",
    "Ocean Engineering",
    "Hydrodynamics",
    "Ocean Structures",
    "Engineering",
    "Mechanical Engineering",
    "Fluid Mechanics",
    "Mechanical Design",
    "Ocean Engineering",
    "Hydrodynamics",
    "Ocean Structures"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nRecitations: 1 session / week, 1 hour / session\n\nDescription\n\nThis course presents principles of naval architecture, ship geometry, hydrostatics, calculation and drawing of curves of form, intact and damage stability, hull structure strength calculations and ship resistance. It introduces computer-aided naval ship design and analysis tools. Projects include analysis of ship lines drawings, calculation of ship hydrostatic characteristics, analysis of intact and damaged stability, ship model testing, and hull structure strength calculations. Students taking graduate version complete additional assignments.\n\nPrerequisites\n\nStudents need to have taken one of these courses:\n\n2.002 Mechanics and Materials II\n\n2.02B Mechanics of Structures\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nHomework / Projects\n\n40%\n\nResearch Paper and Presentation\n\n15%\n\nQuizzes (open book, open notes)\n\n45%\n\nTextbook\n\nLewis, Edward V., ed.\nPrinciples of Naval Architecture, Vol. I: Stability and Strength\n. Society of Naval Architects and Marine Engineers, 1988. ISBN: 9780939773008.\n\n------.\nPrinciples of Naval Architecture Vol. II: Resistance, Propulsion, and Vibration\n. Society of Naval Architects and Marine Engineers, 1988. ISBN: 9780939773015.\n\nGillmer, Thomas C., and Bruce Johnson.\nIntroduction to Naval Architecture\n. Naval Institute Press, 1982. ISBN: 9780870213182.\n\nBooks in this series are available for purchase at\n\nThe Society of Naval Architects and Marine Engineers\n\nwebsite.\n\nKerwin, Justin E., and Jacques B. Hadler.\nPrinciples of Naval Architecture Series: Propulsion\n. The Society of Naval Architects and Marine Engineers, 2010. ISBN: 9780939773831.\n\nLarsson, Lars, and H. C. Raven.\nThe Principles of Naval Architecture Series: Ship Resistance and Flow\n. The Society of Naval Architects and Marine Engineers, 2010. ISBN: 9780939773763.\n\nMoore, Colin S.\nThe Principles of Naval Architecture Series-Intact Stability\n. The Society of Naval Architects and Marine Engineers, 2010. ISBN: 9780939773749.\n\nLetcher, John.\nPrinciples of Naval Architecture Series: The Geometry of Ships\n. Edited by J. Randolph Paulling. The Society of Naval Architects and Marine Engineers, 2010. ISBN: 9780939773671.\n\nThese textbooks are not required, but are useful reference materials.\n\nTupper, Eric C.\nIntroduction to Naval Architecture\n. 5th ed. Butterworth-Heinemann, 2013. ISBN: 9780080982373. [Preview with\nGoogle Books\n]\n\nZubaly, Robert B.\nApplied Naval Architecture\n. Cornell Maritime Pr / Tidewater Pub, 1996. ISBN: 9780870334757.\n\nBurcher, Roy, and Louis J. Rydill.\nConcepts in Submarine Design\n. Cambridge University Press, 1994. ISBN: 9780521416818. [Preview with\nGoogle Books\n]",
  "files": [
    {
      "category": "Resource",
      "title": "Paper: Survey of Naval Architecture Literature",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-700-principles-of-naval-architecture-fall-2014/b3fc1cea056ee4d598f8409eb956bd96_MIT2_700F14_survey_paper.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Mechanical Engineering\n\n2.701 PRINCIPLES OF NAVAL ARCHITECTURE\nFall 2014\n\nPAPER: SURVEY OF NAVAL ARCHITECTURE LITERATURE\n\nDate issued: October 6, 2014\nDate Due: November 3, 2014 (identification of paper);\nDecember 1, 2014 (written \"review\");\nDecember 8, 2014 (presentations on 8th and 10th of December)\n\n1.\nPaper Review/Written Summary\nAs one of the earliest 'sciences' as well as 'art', naval architecture is rich in history, tradition, and\ndocumentation. As discussed in class, a naval architect is considered a \"jack-of-all-trades\". As\nsuch, maintaining a razor-sharp knowledge in all disciplines is quite a task. To facilitate our quest\nfor knowledge, each student will review a paper, article, summary, etc. of their choice related to\none of the following topics:\n\nShip Geometry and Hydrostatics,\nInitial Stability,\nLongitudinal Stability and Trim,\nGeneral Stability at Large Angles,\nSubmarine Hydrostatics,\nDamaged Stability,\nShip Resistance,\nShip Powering,\nShipbuilding Materials,\nShip Structures,\nShip Propellers and Propulsion Systems,\nShip Motions,\nShip Maneuverability and Control,\nEtc.\n\nEach student will identify and provide a copy of the paper they will review on/before November 3,\n2014. Each student will prepare a \"typed\" 2-3 page summary of their review. The summaries will\nbe copied and provided to all students for their reference library. Your written summary is due\nDecember 1, 2014.\n\n2.\nIn-class Presentation\nIn addition to your written summary, prepare a 5-10 minute oral presentation and present your\nsummary to the class on December 8 or 10, 2014.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n2.700 Principles of Naval Architecture\nFall 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Project 1: Hull Geometry",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-700-principles-of-naval-architecture-fall-2014/ded8260f8ff2df104dc73d1699d03dec_MIT2_700F14_project_1.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Mechanical Engineering\n\n2.701 PRINCIPLES OF NAVAL ARCHITECTURE\nFall 2014\n\nPROJECT #1: HULL GEOMETRY\n\nDate issued: September 5, 2014\nDate Due: September 22, 2014\n\nReferences: Chapters 1-3 and Appendix B (pg 292-296) of Gillmer and Johnson, \"Introduction\nto Naval Architecture.\"\n\n1. Introduction/background:\n\nShip's lines are generally designed to be \"fair.\" To the naval architect, fairness means that the\nlines have a continuous second derivative; this is the definition of a spli\n\nne. Before the advent of\ndigital computers, naval architects checked every line on a lines plan for fairness by bending a\nthin stick of wood, called a batten, on the line. If the line followed the natural bend of the batten,\nthe line was fair. This phenomenon follows from the beam equation, which shows that the\nminimum energy in a beam with given boundary conditions and passing through given points\noccurs when the beam has a continuous second derivative of position.\n\nTypically designers will start with an existing ship, referred to as a \"parent hull,\" to develop a\nnew ship's geometry and will use \"design lanes\" for various ship characteristics and coefficients\nas a \"final sanity check\" of new hull form designs. We will visit some of those design lanes in\nthis project.\n\nIn lieu of drawing the ship's lines, we will generate a conventional destroyer type hull by\nspecifying several primary ship characteristics and coefficients. Various computer aided ship\ndesign tools can be used to develop a hull. For this assignment we will use a computer aided\ndesign tool used by the U.S. Navy: the Advanced Surface Ship and Submarine Evaluation Tool\n(ASSET).\n\nComputers with ASSET version 6.3 software loaded are available to you in the 2N Ship Design\nLab. ASSET 6.3 is under All Programs > LEAPS > Applications > ASSET 6.3.0. An older\nversion, 5.3, is under >All Programs >ASSET. Make sure you are using ASSET 6.3 and not the\nolder version!\n\nASSET 6.3 Training Files are located on the design lab computers under \\\\CADFAC\\2n design\nlab share drive\\ASSET Training Files.\n\n2. Assignment:\n\nUsing ASSET 6.3, each student will generate a baseline hull based on a given set of ship\ncharacteristics and form coefficients.\n\nEach student will then perform a controlled variant study by changing one characteristic or form\ncoefficient at a time and inspecting the results.\n\nNext, each student will determine/calculate the ship's characteristics and form coefficients at the\nDesign Waterline (DWL) and compare computer generated results to hand calculations for\nwaterplane areas.\n\n3. Procedure/Deliverables:\n\nASSET 6.3 is relatively new and somewhat \"buggy.\" It is not uncommon for it to freeze or crash.\nSave your work often! If the program freezes and you have to force it to close, you may not be\nable to reopen your databank because it contains a \"lock file.\" Simply go into the folder where\nyour databank is, find the lock file and delete it. Then you should be able to reopen your\ndatabank. Feel free to contact the TA or the professor for advice.\n\n3.1 Creating a Baseline Hull\n\nFirst you need to copy reference ASSET databank to your profile. The reference databank is\nprovided to us by NSWCCD and contains parent hulls of several different types of navy ships.\nFrom the recitation folder, copy the folder ASSET63RefDB to your profile. DO NOT MODIFY\nTHE ORIGINAL DATA BANKS ON THE LAB COMPUTERS! Inside this folder will be your\ndatabank, ASS\n\nET63RefDB.pdbIndex, along with several other files. This is now YOUR data\nbank for this and future projects. Second, perform the same procedure with the\nHullformLibrariesV63 folder as both will be required for this and future projects.\n\nOpen ASS\n\nET 6.3 by double-clicking the desktop icon. You will be prompted to \"Select\nDataBank.\" Choose the file \"ASSET63RefDB.pdbIndex\" from your copy of the data bank\nfolder on your desktop. The Messages window at the top in ASSET should indicate that the\ndatabank was opened. Change to English units under the Options menu (this must be done every\ntime you open ASSET). Select the icon,\n, \" Open Current Model from Databank.\" Select\n\"Destroyer-Mech\" from the list (the \"Destroyer\" model has an electric propulsion system while\nthe \"Destroyer-Mech\" model has a traditional mechanical propulsion system).\n\nNow you will generate your baseline hullform. In the \"Surface Combatant Module Run\nManager\", double-click \"Hullform Utility.\"\n\nOnce the application window opens, click on the Open Existing Database icon,\n, and open\nyour \"HullformLibrariesV63.pdbIndex\" file. Next you will select a parent hullform, select the\n\"HFT_DDG79_wsd\" hullform and click OK. This is a model of a U.S. Navy destroyer; \"wsd\"\nmeans \"with sonar dome.\"\n\nOnce the hullform is opened, click the \"Shaper\" tab. At this point in the project, you will need to\nbalance your design. The goal is to create a hullform with the following parameters:\n\nLBP = 450 ft\n\nCp = 0.60\nB = 60 ft\n\nCx = 0.83\nT = 20 ft\n\nD10 = 37 ft\n\n(Ensure values are within 0.5% tolerance)\n\nOnce you have balanced the parameters above, export the hullform into ASSET 6.3 by clicking\nin the upper right corner. Click OK to any following windows acknowledging combining\nor converging certain features. Then, select NO step to be added and go ahead and Start the\ntransfer. If you come across any messages that require the hullform to converge, select OK.\n\nOnce the transfer is complete, Save the Model As in the File menu as the name \"Baseline.\" Now\nthat you are back at the main ASSET window, click the Toggle Model Editor icon,\nto enter\neditor mode. Enter the values in Table 1. You can use the find function (the binoculars icon) to\nsearch for the parameters. As you enter the data, right-click on the parameter names and read\ntheir definitions. Think about what effect each parameter might have on the design. A list of the\norganizational tree structure is in the Appendix.\n\nDO NOT change any values in the \"Hull Form Parent Controls\" section. If one of your\nsearches winds up in the parent section where the parameter names are preceded by \"Ps,\" use the\n\"find next\" function to find the same parameter in the current ship sections.\n\n1) Derived Aviation Facilities Indicator = MINOR AVN\n10) Main Deck Height = 37.0 FT\n2) Derived Embarked Commander Indicator = NONE\n11) Hull Offsets Indicator = GIVEN\n3) Design Mode Indicator = SHIP WT\n12) Hull Dimensions Indicator = NONE\n4) Design Endurance Displacement Indicator = FULL LOAD\n13) Bulwark Height = 0 FT\n5) Design Endurance Definition Indicator = USN\n14) Bilge Keel Indicator = NONE\n6) Design Sustained Speed Indicator = CALC\n15) Skeg Indicator = PRESENT (given in hullform)\n7) Design Endurance Speed Indicator = GIVEN\n16) Boundary Conditions Indicator = GIVEN\n8) Design Endurance Speed = 15 KTS\n17) Hull Station Indicator = OPTIMUM\n9) Ship Type Description = SC\n\nTable 1: Common Parameters\nThe following parameters were set in the Hullform Utility and will not need to be adjusted here.\nNote that in ASSET, a blank cell is not the same as 0:\n\nLBP (Hull Length Between Perpendiculars): 450 ft T (Hull Design Waterline Draft): 20 ft\nB (Hull Design Waterline Beam): 60 ft Cp (Hull Prismatic Coefficient): 0.60\nD10 (Hull Depth at Station 10): 37 ft Cx (Hull Maximum Section Coefficient): 0.83\n\nNext, calculate and input the Weight at Full Load (Ship Char > General Char > Principal Char)\nusing the following formula (do you understand why this works?):\n\n!\n\n⁄⁄ !\n\nClick the Toggle Model Editor icon to exit the editor. This will take you back to the Module Run\nManager window. Answer YES when asked if you want to store modifications to the current\nmodel.\n\nNow (and frequently hereafter) you should save your model; click File > Save Model\n\nAllow ASSET to synthesize (converge) your model by clicking\n, Toggle Synthesis Manager,\nbutton and then double-clicking \"Surface Combatant Synthesis\" in the left pane. When it is done,\nyou will see a Design Summary Report in the Synthesis Manager window. For purposes of this\nproject, we are only interested in the hull geometry. So click\n, the Module Run Manager\nwindow, a nd double-click \"Hull Geometry Module.\" You will see a summary of the geometry\nparameters and calculated values. Make sure you understand what they all mean. Look them up\nin the Help files if you need to.\n\nDouble-click on Body Plan, Hull Isometric Plan, and the other graphics to see your ship's lines.\n\nVerify your displacement by checking the value of BARE HULL DISPL on DWL in the \"Hull\nGeometry Report\" and comparing it to your input (hand-calculated) value. If it matches within\n0.5%, you are good to go...if not, verify your inputs from Table 1. Another check is to open\nHullform Utility and verify the displacement calculated for you but understand that the principal\ndimensions coming out of Hullform Utility are inexact values. Anothe\n\nr reason for the values to\nbe different is that ASSET treats appendages as part of your hand-calculated value. You\naccounted for this in Table 1 but the hand-calculated value is the displacement of the molded\nvolume.\n\nDeliverable D-1: \"Hull Geometry Report,\" \"Body Plan,\" and \"Hull Isometric View.\"\n\n3.2 Variant Creation\n\nUse ASSET with the parameters given in Table 2 below to generate your hull variants. Don't\nforget to recalculate and re-input your full load weight. SAVE these ships in your databank\nindividually!\n\nVariant\nLBP(ft)\nCp\nCx\nBaseline\n0.60\n0.83\n1A\n0.60\n0.83\n1B\n0.60\n0.83\n2A\n0.56\n0.83\n2B\n0.64\n0.83\n3A\n0.60\n0.78\n3B\n0.60\n0.88\nTable 2: Variant Parameters\n\nD-2: Perform a comparative analysis of your baseline hull and six variants using the above\ncharacteristics and form coefficients in Table 2. Are there any evident relationships and/or\nconclusions that you can derive/detect? Comment on how the various parameters affect the lines\nand the displacement. Which parameter has the greatest impact on GMT? On AWS? etc.\n\nVariant\nΔ\nKB\nBMT\nCWP\nAWS\nGMT\nBaseline\n\n1A\n\n1B\n\n2A\n\n2B\n\n3A\n\n3B\n\nTable 3: Comparative Analysis\n\n3.3 Methods of Numerical Integration\n\nThere are two numerical integration techniques that you will conduct to calculate the waterplane\narea at a specific waterline. The ship's stations are generated automatically according to the\nselected option in ASSET, OPTIMUM, in order to create an optimal numerical model of the\nhullform. This part of the project checks those calculations with Simpson's rule and the\ntrapezoidal rule.\n\nD-3: For the Design Waterline (T=20 ft) determine/calculate the following hull form\ncharacteristics and form coefficients using the information from the ASSET Hull Geometry\nreports for\n\nthe Baseline hull:\n\nΔ\n\nCB\n\nL/B\n\nLBP\n\nCP\n\nL/T\n\nB\n\nCWP\n\nB/T\n\nT\n\nCM\n\nUwVol /(L/10)**3\n\nUnderwater Vol\n\nCX\n\nΔ / (L/100)**3\n\nAWP\n\nCIL\n\nLCB\n\nAM\n\nCIT\n\nKB\n\nAX\n\nD-4: A sectional area curve for your ship, \"Hull Sectional Area Curve Graph.\"\n\nThis next section requires understanding the Simpson's and trapezoidal rules (Appendix B in\nGillmer and Johnson). Since, they require an \"x\" value (station location) and \"y\" value (half\nbreadth/beam), you must pull these values from the Hull Offsets report in the Hull Geometry\nModule. You should notice that the section spacing isn't uniform; therefore, you must interpolate\nthe \"y\" values based on evenly spaced stations that you specify. The\n\nsame procedure for\nwaterplane areas (AWP) applies to calculating sectional areas (AM) with exception of the\nreference value. For example, given the data below; find the \"y\" value at station location, x= -10\nft for a 40 ft waterline.\nSTATION NO. 6, AT X = -10.328 FT\nPOINT HALF BEAM,FT WATERLINE,FT\n1 0.000 38.832\n2 0.735 40.019\n3 1.484 41.184\n4 3.029 43.493\n5 4.583 45.789\nSTATION NO. 7, AT X = -8.834 FT\nPOINT HALF BEAM,FT WATERLINE,FT\n1 0.000 37.303\n2 0.751 38.668\n3 1.521 40.001\n4 3.331 42.888\n5 5.185 45.706\n\nAnswer: y = 0.908 ft (half beam)\n\nRefer to Appendix for interpolation help.\n\nD-5: By \"hand\", using Simpson's rule and the offsets ASSET calculated, calculate the following\ncharacteristics and form coefficients at the DWL (T=20 ft) and compare your results to those\ngenerated by ASSET (note: ASSET does not provide a value for LCF). Explain any significant\n(> 5%) differences.\n\nAWP\n\nCWP\n\nAM\n\nCM\n\nLCF\n\nCIL\n\nCIT\n\nD-6: Recalculate AM using the trapezoidal rule and comment on your results.\n\nD-7:\nConclusions and Recommendations\n\n4. Appendix:\n\n4.2 Calculating Hullform Coefficients and Parameters\n\nIt may be useful to note that, according to Gillmer and Johnson,\n\n!\n\nand\n\n!\n\nYou can't use the ASSET-generated offsets to \"hand\" calculate the section area at midships\nwith Simpson's rule, because the waterline spacing is not uniform. You can use your\ninterpolated values at the \"round number\" waterlines, but to get sufficient accuracy, you will\nneed greater resolution that the 2 ft waterline intervals in the table.\n\n4.3 ASSET Tree to Find Parameters\n\nShip Requirements > Derived Requirements > Derived Mission Requirements > Derived\nFacilities\n\n1 - Derived Aviation Facilities Indicator - M\n\nINOR AVN\n\n2 - Derived Embarked Commander Indicator - N\nONE\n\nShip Requirements > Derived Requirements > Design Endurance\n\n3 - Design Mode Indicator - S\nhip WT\n\n4 - Design Endurance Displacement Indicator - F\null Load\n\n5 - Design Endurance Definition Indicator - USN\n\nShip Requirements > Derived Requirements > Design Speeds\n\n6 - Design Sustained Speed Indicator - CALC\n\n7 - De\n\nsign Endurance Speed Indicator - G\nIVEN\n\n8 - De\n\nsign Endurance Speed = 15 kts\n\nShip Characteristics > General Characteristics\n\n9 - S\nhip Type Description - SC\n\nShip Geometry > Molded Form Views > View of Decks > Hull Decks\n\n10 - Main D\n\neck Height - 37 ft\n\nShip Geometry > Molded Form Views > View of Hulls > Hull 0000001 > Hull Form Factors\n\n11 - H\null Offsets Indicator - GIVEN\n\n12 - Hull Dim\n\nensions Indicator - NONE\n\n13 - B\nulwark Height - 0\nft\n\nShip Geometry > Molded Form Views > View of Hulls > Hull 0000001 > Hull Shell Appendage\n\n14 - B\nilge Keel Indicator - NONE\n\n15 - S\nkeg Indicator - P\nRESENT (given in hullform)\n\nShip Geometry > Molded Form Views > View of Hulls > Hull 0000001 > Hull Boundary Cond.\n\n16 - B\noundary Conditions Indicator - G\nIVEN\n\n17 - Hull S\n\ntation Indicator - OPTIMUM\n\n4.4 Interpolation:\n\ny! =\n!\n!\n!\n!\n(x! -x!)\n+ y!\n\nx-x\n(y-y)\nTo interpolate the y! value:\nx!, x!, y! and y! need to be entered/copied from the table.\nx! defines the point to perform the interpolation.\ny! is the interpolated value and solution\n\nx! y!\nx! y!\nx! y!\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n2.700 Principles of Naval Architecture\nFall 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Project 2: Hydrostatics",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-700-principles-of-naval-architecture-fall-2014/e85b9ced442dafc03ffa3204cdbfc424_MIT2_700F14_project_2.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Mechanical Engineering\n2.700/2.701 Principles of Naval Architecture\nFall 2014\nProject #2: Hydrostatics\nDate issued: September 22, 2014\nDate due: October 1, 2014\nThe file \"hull.3dm\" contains the hull sections in the form of points and curves1, as well as the\nprofiles of the bow and stern. Using Rhinoceros implement the following tasks:\n1.\nApproximate the given hull points with smooth curves (ship sections), which have\nuniform distribution of control points along their length, and smooth distribution of\ncurvature without unnecessary inflection points. The smoothed ship sections should be\nas close as possible to the original ones.\nDeliverables: The .3dm file that contains the original and smooth ship sections. A technical\nreport describing the steps that you follow and also 3D snapshots of the ship sections with\nthe curvature graph on (Display scale = 105).\n2.\nBy interpolating the smooth ship sections create a surface that is smooth everywhere\nexcept from the stern area.\nDeliverables: The .3dm that contains 3D model for the ship hull. A technical report\ndescribing the steps that you follow; 3D snapshots of the ship hull model and 3D snapshots\nof the surface curvature (curvature range ±0.05).\n3.\nCompute the hydrostatic characteristics (displacement; center of flotation; horizontal\nand vertical position of the center of buoyancy, wetted surface; waterplane area) for 5\nwaterlines, which are uniformly distributed over the vertical direction.\nDeliverables: Hydrostatic diagram.\nThe 3dm files should be emailed to the instructor with the filename format:\n'!_! _x.3dm' where x is 1 for the ship sections and 2 for the 3 model.\n1 The hull data used in this project is a modification from a hull used in a CAD/CAM project by Prof. Kaklis and\nDr. Gkinis - School of Naval Architecture and Marine Engineering at National Technical University of Athens.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n2.700 Principles of Naval Architecture\nFall 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Project 3: Ship Intact Stability",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-700-principles-of-naval-architecture-fall-2014/45d7928d293cc7d8b194d94505127044_MIT2_700F14_project_3.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Mechanical Engineering\n2.701 PRINCIPLES OF NAVAL ARCHITECTURE\nFall 2014\nPROJECT #3: SHIP INTACT STABILITY\nDate issued: October 1, 2014\nDate Due: October 10, 2014\n1. Introduction/background:\nAn intact stability analysis follows naturally from the hydrostatic analysis. Hydrostatics\n(determination of KM and knowledge of KG) can be used to predict initial stability. This intact\nstability analysis will evaluate the range of stability at various angles of inclination.\nVarious computational tools can be used to compute the hydrostatic properties and righting arms\nfor an inclined hull form. For this assignment we will use the Advanced Surface Ship and\nSubmarine Evaluation Tool (ASSET) and the Program for Operational Ship Salvage Engineering\n(POSSE). Computers with ASSET and POSSE software loaded are available in the 2N Ship\nDesign Lab.\n2. Assignment:\nFrom baseline the ship developed in Project #1, produce righting arm (GZ) cross-curves and\nstatic stability curves for a displacement range of design ∆ ± 1000 LT.\nLoad your Project #1 ship into ASSET and save it under a new name. Use the Hydrostatic\nAnalysis Module to produce general stability curves for your ship. Then import the ship into\nPOSSE to generate the cross-curves of stability. Detailed instructions \"Taking a ship from\nAsset 6.3 to POSSE 5.1\" and a macro-enabled spreadsheet are provided.\n3. Procedure / Deliverables\n3-1: Generating Static Stability curves in ASSET\na) Run the Hydrostatic Analysis Module. ASSET will generate your static stability\ncurves and also calculate limiting KGs for 100 kts beam winds and high speed turns. You can\nsee these limiting KGs on the \"Intact Static Stability\" report. For this first run, your\ndisplacement should match your \"design\" displacement. You can verify this by checking the\ndisplacement on either of the graphic reports or on the \"Hydrostatics Summary.\"\nb) To generate curves at other displacements, open the editor and change the \"Hydrostatic\nIndicator\" to WT TRIM (see the ASSET help files to understand what this means). Then change\nthe value of \"Hydrostatic Weight\" to the displacement desired (e.g., 500 tons less than design).\n\nRun the Hydrostatic Analysis Module again, selecting the same reports as before. ASSET will\nalso ask you to enter several other hydrostatic condition parameters. Use the values from the\ndesign condition for all cases. Displacement should match your \"input\" displacement. Repeat\nfor other values of displacement.\nD-1:\nA plot of the general stability curve (intact static stability curve) for your ship at\ndisplacements from design ∆ ± 1000 LT in 500 LT increments. Discuss your results, noting\ntrends.\n3-2: For the Roll period calculation below, refer to Introduction to Naval Architecture, Gillmer\nand Johnson, page 265-266, for a suitable relationship between roll period and GM. Use 0.45 as\nyour value of \"C.\"\nD-2:\nFor the three displacements ∆ ± 500 LT, determine the maximum KG for each of the\nfollowing conditions:\na) Beam winds (100 kts)\nb) High Speed turning (35 kts)\nc) Roll period ≤ 15 seconds\nd) GM ≥ 2.0 ft\nWhich of these conditions is the \"limiting\" condition for each displacement, and which is\nlimiting overall? What does this mean to you as a ship designer?\n3-3: Generating Static Stability curves in POSSE\na) Follow the attached instructions \"Taking a ship from ASSET 6.3 to POSSE 5.1\" Part I to\ngenerate the offsets file for your ship.\nb) Use the POSSE Ship Project Editor to import the offsets file and generate the cross\ncurves of stability at the specified displacements.\nD-3: A plot of the cross curves of stability for your ship at displacements from the design ∆ ±\n1000 LT in 500 LT increments. Discuss your results, noting trends.\n.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n2.700 Principles of Naval Architecture\nFall 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Project 4: Ship General Stability",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-700-principles-of-naval-architecture-fall-2014/cd06a2f898575fae8d663a96644349dc_MIT2_700F14_project_4.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Mechanical Engineering\n2.701 PRINCIPLES OF NAVAL ARCHITECTURE\nFall 2014\nPROJECT #4: SHIP GENERAL STABILITY\nDate Issued: October 10, 2014\nDate Due: October 20, 2014\nReferences: Gillmer and Johnson Chapter 6\n1. Introduction/background:\nOnce the initial stability analysis is complete, the movement or addition of weights affects KG,\nGZ and overall general stability. For a weight addition, the new GM and the list angle can be\ncalculated from the equations given in lecture.\nIn the case of tanks aboard a ship, there is an additional adverse effect on stability known as\n\"free surface effect.\" This is caused by the shift in center of gravity of the liquid as the ship\nheels. The correction to GM (known as free surface correction, FSC) for a rectangular tank and a\nwall-sided ship heeling is:\nGZ\n!!!! = !GM\n!!!!! -\n!\nγ! ∇!\n!\"#\n! sin φ\nγ\ni\n!\n!\n\nis t\nis t\nhe specific gra\nhe 2nd moment of area (transverse) of the liquid surface\nvity of seawater\nφ\n!\n\n2. Assignment:\nFor general stability, analyze the weight addition and free surface effect of your baseline ship\nfrom Project #1.\nγ is the specific gravity of the tank of liquid\n∇is the underwater volume of the ship\nis the heel angle\n\nγ\ni\n!\n!!!!!!!!!\n!\"\n!!!!!!\"\"\n\n3. Procedure / Deliverables\n3-1: Starting at zero list and trim, add 150,000 gals of fuel oil load into a tank that was\npreviously empty on your baseline ship in Project #1 with the following parameters.\nTank width (b) = 25 ft\nTank height (h)= 10 ft\nTank length (l) = 160 ft\nTank LCG = LCB\nTank TCG = +12.5 ft (stbd) Tank KG = 7.5 ft\nTank partially full\nγl = 0.89\nρfw = 8.34 lbs/gal\nγs = 1.025\nD-1:\nStability calculations following the weight addition (assume no pocketing):\n1. Final displacement\n2. New draft\n3. New KG\n4. Effective GM accounting for FSC\n5. List of the ship as a result of the fuel load\nD-2:\nA plot of the initial static stability curve and the corrections for the weight addition.\n1. Plot the righting arm (GZ0 curve) for your baseline ship using the Intact Static\nStability Report from ASSET. Add an extra point to estimate where the righting arm\ncurve crosses zero (~95 degrees). Fit a curve through the points.\n2. Plot the sine curve correction for Kg for each data point and fit a curve.\n3. Plot the cosine curve correction for gG for each data point and fit a curve.\n4. Plot the FSC curve with the assumption that pocketing does not occur and fit a curve.\n5. Plot the final static stability curve.\n6. Annotate the changes in GM, range of stability, and GZmax between the initial static\nstability curve and the final. Also annotate graphically the final list angle - does this\nagree with your calculations on Deliverable 1?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n2.700 Principles of Naval Architecture\nFall 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Project 5: Hull Subdivision and Damage Stability",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-700-principles-of-naval-architecture-fall-2014/8316a0aabd66498773b3f4ed5a2dbdcc_MIT2_700F14_project_5.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Mechanical Engineering\n2.701 PRINCIPLES OF NAVAL ARCHITECTURE\nFall 2014\nPROJECT #5: HULL SUBDIVISION and DAMAGE STABILITY\nDate issued: Oct 20, 2014\nDate due: Oct 31, 2014\nReference: Gillmer and Johnson Chapter 10\n1. Introduction/background:\nAs discussed in class, there are many hazards your ship will encounter over its service life. Your\nship design must take these hazards into account. You must design your ship to handle various\nconditions that account for the extent of the damage as well as the location of the damage. Then,\nyou must ascertain an acceptable ship condition after the damage. Things you must consider\ninclude sinkage, drafts, heel, trim, metacentric height (GM), righting arm (GZ), range of stability\n(ROS), righting energy, etc. One method of evaluating a ship's ability to sustain damage and\nremain afloat and stable is to develop a Floodable Length Curve and subsequently subdivide the\nhull, using watertight transverse bulkheads, so that it meets damage stability requirements.\nVarious computational tools can be used to compute the Floodable Length Curve and perform a\ndamage stability analysis. For this assignment we will use the Advanced Surface Ship and\nSubmarine Evaluation Tool (ASSET). Computers, with ASSET software loaded, are available in\nthe 2N Ship Design Lab (Room 5-306).\n2. Assignment:\nUsing your baseline ship from Project #1, locate transverse bulkheads such that your ship meets\nthe minimum damage stability criteria specified in DDS-079-1.\n3. Process:\nRun Synthesis again on your ship from Project #1 (you should do this any time you reopen a\npreviously saved model).\nIn the Editor:\n- Verify that Hull Subdivision Indicator = GIVEN (why? Check the Help files)\n- Set the Floodable Length Permeability = .9. Delete all other instances\nRun the Hydrostatics Analysis Module and print out the Floodable Length graphic. Stretch it as\nlarge as you can on the page, because you are going to be doing some pencil work on it.\n\nUsing the longitudinal locations of your watertight transverse bulkheads from the editor,\ndetermine the worst-case damage condition at each longitudinal location on the ship. To do this,\nyou will need to add 15% LBP to each transverse bulkhead location and determine how many\nother transverse bulkheads would be damaged in that situation. Using the Floodable Length\ngraphic, draw the corresponding flooded length triangles from the bracketing intact transverse\nbulkheads to see if the extent of damage exceeds the floodable length at that location. For\npurposes of this project we are using a 90% permeability curve for the entire length of the ship.\nThis is a simplification; each compartment has a specified permeability based upon its use\n(engine room, berthing, etc).\nIf your flooded length exceeds your floodable length anywhere on the ship, you will need to\nadjust your transverse bulkhead locations in the editor, or possibly add transverse bulkheads. If\nyour flooded length is too conservative (i.e., well below the floodable length curve), then your\ntransverse bulkheads are too close together or you have too many--you are adding unnecessary\nweight and restricting access. You should increase the distance between them or remove a\ntransverse bulkhead.\nIn the Editor:\n- The location of transverse bulkheads is listed in the array Transverse Bulkhead X\nLocation. Select Transverse Bulkhead 000001 and then click on the button \"View Data\nin Table Format\" to see the entire array.\n- Run the Hull Subdivision Module and Synthesis to incorporate your changes.\nAfter each adjustment, run Synthesis and then the Hydrostatic Analysis Module again, and\nrecheck your flooded length triangles by marking up the floodable length graphic. Go through\nthis process at least twice. Get your flooded length triangles as close as you can to the flooded\nlength curve without exceeding it, but you don't have to iterate more than twice. Your final\ndesign must not EXCEED floodable length anywhere.\n4. Deliverables:\nD-1:\nThree printed floodable length graphics, indicating where you moved/added/deleted\nbulkheads and showing all appropriate flooded length triangles.\nD-2:\nA table showing the original and final locations of your bulkheads as a fraction of LBP.\nD-3:\nAnswers to the following questions:\n1. Does floodable length analysis account for off-center flooding? If so, how? If not, do we\naccount for it?\n2. Weight and access are negatively affected by overly-conservative watertight subdivision.\nName two other things that are negatively affected.\n3. Compare the US Navy's 15% LBP damage criterion with commercial \"integer\ncompartment\" criteria (< 100ft LBP-1 comp, 100-300ft LBP-2 comp, > 300ft-3 comp).\nWhich is more conservative, and what makes it so?\n4. Using your floodable length curve as a reference, explain how increasing and decreasing\npermeability would affect your design.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n2.700 Principles of Naval Architecture\nFall 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Project 6: Ship Resistance Model Testing",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-700-principles-of-naval-architecture-fall-2014/a8bcfa91c9090387da163625d5143c72_MIT2_700F14_project_6.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Mechanical Engineering\n2.701 PRINCIPLES OF NAVAL ARCHITECTURE\nFall 2014\nPROJECT #6: SHIP RESISTANCE MODEL TESTING\nDate issued: October 31, 2014\nDate Due: November 12, 2014\nReference:\n1. Principals of Naval Architecture Series: Ship Resistance and Flow. Chapter 8\n2. \"A simple method for the evaluation of the form factor and the low speed wave\nresistance\" (C.W. Prohaska)\n1. Background\nIn ASSET, initial powering estimates come from ratios with \"like-type\" ships and then further\nrefined using one of many other methods such as Taylor Standard Series method. However in\nmodel testing the total resistance force is measured directly. The method used to turn model\nscale resistance data into full-scale ship EHP was developed by William Froude in 1872.\nThe Froude method, as discussed in class, considers the total model resistance as the sum of a\nfrictional resistance component and a residuary resistance (literally everything other than\nfriction) component. Under his hypothesis the two are separated and each scaled differently.\nThe frictional component is scaled based on Froude's experiments with flat plates towed under\nwater. The residuary resistance is scaled by requiring the coefficient of residuary resistance to be\nthe same for two geometrically similar ships traveling at corresponding speeds. Corresponding\nspeeds are speeds where the speed-length ratio is constant (constant Froude number in non-\ndimensional terms).\nOver the years towing tank facilities in different countries developed improvements to the basic\nFroude approach. In 1978 the International Towing Tank Congress (ITTC) adopted a updated\nstandardized procedure for performing ship resistance experiments and calculations. The ITTC-\n78 method considers the total model resistance as the sum of a viscous component and a wave\nmaking component (see reference material). The viscous component uses the 1957 ITTC friction\nline to estimate a frictional resistance coefficient. To include the effect of hull shape and viscous\npressure drag a form factor is estimated and applied to the frictional resistance coefficient to\nmake a viscous resistance coefficient. Froude's hypotheses is still applied to the wave making\nresistance, where the coefficient of wave making resistance is the same for two geometrically\nsimilar ships traveling at the same Froude number.\n\n2. Assignment\nObserve/conduct a model test for a 1/100th scale model of the USS ARLEIGH BURKE DDG-51\nClass guided missile destroyer. Compare the model test results to full scale resistance data\nprovided from ASSET.\n3. Process:\n3.1. Prepare for model testing:\n-\nTests will be conducted using a 1/100th scale model (λ = 100) of the DDG-51 class\nguided missile destroyer at ship speeds from 5 to 30 knots in 5 knot intervals.\n-\nUse Froude scaling to determine the model speeds for the towing tank tests.\n-\nGiven the full load displacement for the DDG-51, determine how much the model must\nweigh (in lbs) to replicate this condition\n3.2 Conduct model tests:\n-\nThe MIT Towing Tank is located in the Parson's Laboratory\n-\nCalibrate the force block (or calibration data provided)\n-\nRecord the water temperature in the towing tank\n-\nRecord the voltage output for each speed and use the calibration to convert into the total\nmodel resistance (in lbf).\n-\nTruncate the data over a period of at least a few seconds where the model has reached full\nspeed and take the average value of total resistance\n3.3 EHP Expansion:\n-\nUse the ITTC-1978 method to expand the model test data to full scale.\n-\nUse the measured water temperature (fresh water) for the model and 59° F (salt water) for\nthe ship.\n4. Deliverables:\nD-1: Describe and comment on your observations during the tow tank experiment. What are the\nlimitations of most model tests? How are you able to account for or resolve them?\nD-2: Comparative plot of predicted and actual full scale EHP vs speed for the DDG151.\n1. Use the data below for full scale comparison.\n2.\nCalculate the form factor using Prohaska's method (section 8.3.3) and include a copy of\nthe plot in your report (see Figure 8.6 for an example).\n3.\nYou can approximate the frontal area for the DDG-51 as AT = B x B/2\nD-3: A plot of the predicted ship scale resistance coefficients vs. Froude number for the DDG-51\n1. Plot the CTS, (1+k) CFS, CWS, ΔCF and CAA.\n2. Comment on the shape of the coefficient of wave making resistance graph.\nD-4: Spreadsheet with your calculations.\n\nD-5: Answer the following questions:\n1. From section 8.2.2 - is the model an appropriate size for the MIT towing tank? What\nhappens when a model is too large for the tank it is tested in? MIT tank dimensions\nare 100ft x 8 ft x 4ft.\n2. From section 8.2.2: Do we need to be concerned about the critical depth Froude\nnumber in any of our tests? What assumption is violated if we do exceed this value?\n3. Determine the static ballasting requirements (draft and weight) for the model to\nreplicate the full scale ship in the condition listed below.\n4. Are there any runs that will not be in the turbulent regime (by Reynolds number)? If\nso, how do we account for this? Why do we want the model tests to be in the\nturbulent regime?\n5. Comment on any significant differences between the EHP from the ITTC-78\nexpansion and the values from ASSET.\nUse the following values for the characteristics of the full scale DDG51:\nLOAD LENGTH, FT\n467.35\nFULL LOAD BEAM, FT\n59.56\nFULL LOAD DRAFT, FT\n21.90\nFULL LOAD PRISMATIC COEF\n0.6023\nFL WETTED SURF AREA, FT2 32248.8\nFULL LOAD MAX SECT COEF\n0.8301\nFULL LOAD WT, LTON\n9000.9\nCORR ALW\n0.00040\nSPEED\n------------EFFECTIVE HORSEPOWER, HP------------\nDRAG\nKT\nFRIC\nRESID\nAPPDG WIND MARGIN\nTOTAL\nLBF\n5.00\n76.\n27.\n81.\n3.\n15.\n203. 13214.\n6.00\n130.\n46.\n131.\n5.\n25.\n337. 18328.\n7.00\n202.\n73.\n197.\n8.\n38.\n520. 24190.\n8.00\n298.\n110.\n280.\n12.\n56.\n756. 30784.\n9.00\n419.\n156.\n382.\n18.\n78.\n1052. 38095.\n10.00\n569.\n214.\n504.\n24.\n105.\n1415. 46115.\n11.00\n750.\n289.\n648.\n32.\n137.\n1855. 54961.\n12.00\n965.\n400.\n817.\n41.\n178.\n2401. 65196.\n13.00\n1217.\n540.\n1011.\n53.\n226.\n3046. 76355.\n14.00\n1508.\n719.\n1233.\n66.\n282.\n3808. 88646.\n15.00\n1842.\n941.\n1484.\n81.\n348.\n4696. 102015.\n16.00\n2222.\n1119.\n1759.\n98.\n416.\n5614. 114330.\n17.00\n2649.\n1336.\n2064. 118.\n493.\n6661. 127679.\n18.00\n3127.\n1633.\n2405. 140.\n584.\n7889. 142814.\n19.00\n3658.\n1950.\n2777. 165.\n684.\n9234. 158377.\n20.00\n4246.\n2545.\n3199. 192.\n815.\n10996. 179167.\n21.00\n4892.\n3517.\n3679. 222.\n985.\n13295. 206302.\n22.00\n5600.\n4434.\n4188. 256.\n1158.\n15635. 231591.\n23.00\n6371.\n5347.\n4731. 292.\n1339.\n18080. 256159.\n24.00\n7210.\n6397.\n5318. 332.\n1541.\n20797. 282376.\n25.00\n8117.\n7842.\n5966. 375.\n1784.\n24085. 313935.\n26.00\n9097.\n9933.\n6692. 422.\n2092.\n28236. 353886.\n27.00\n10152.\n13267.\n7533. 473.\n2514.\n33937. 409595.\n28.00\n11283.\n18092.\n8502. 527.\n3072.\n41476. 482701.\n29.00\n12495.\n24037.\n9575. 586.\n3735.\n50428. 566643.\n30.00\n13789.\n30763. 10733. 648.\n4475.\n60407. 656149.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n2.700 Principles of Naval Architecture\nFall 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Project 7: Hull Structure",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-700-principles-of-naval-architecture-fall-2014/a86f4c2e7df5635bad9da8197a4f05b4_MIT2_700F14_project_7.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Mechanical Engineering\n2.701 PRINCIPLES OF NAVAL ARCHITECTURE\nFall 2014\nPROJECT #7: HULL STRUCTURE\nDate issued: November 12, 2014\nDate Due: November 24, 2014\n1. Assignment\nThe scope of this project is to i) familiarize yourself with the American Bureau of\nShipping (ABS) rules and regulations for building and classing steel vessels, and ii)\nquantify the mid-ship section's structural strength.\nThe following ship characteristics are given:\nShip type: Product Carrier\nLOA = 175.50 m\nLBP = 163.40 m\nLWL = 170.00 m\nB =\n25.00 m\nD =\n15.00 m\nd = 11.18m (molded draft)\nTd =\n10.80 m\nCB =\n0.82\nVS =\n14.75 knots\ns = 750mm (spacing of transverse frames or longitudinals)\nFraming: Longitudinal\n\nProcedure:\n\nI.\n\nUsing \"ABS Rules for Building and Classing Steel Vessels 2000\" compute the\nthickness/size for the following structural elements (In parenthesis the\ncorresponding section in the ABS rules is given):\n\n- Bottom shell plating - (§\n\n3/2/2.3.13.2) pg. 69\n- Plate keel - ( §3/2/2.3.15)\n- Inner - bottom plating - (§3/2/4.9.1)\n- Side Shell Plating - ( §3/2/2.3.9)\n- Sheerstrake - (§3/2/2.3.11)\n- Main deck plating - (§3/\n\n2/3.5.1)\n- Main deck stringer plating - (assume same thickness with main deck)\n- Side tanks plating (§3/2/9.5.1) (assume that yield point Y=235N/mm^2\nand α = 15/13.3 = 1.128)\n- Bottom center girder - ( §3/2/4.3.3.1)\n- Bottom side girders - ( §3/2/4.3.9)\nFor the thickness calculations round each result to the closest larger mm, e.g.\nt=11.3mm should be rounded t=12mm.\n\nII.\nIn the provided .dwg file for the mid-ship section, the exact position, number and\nsize of the longitudinals is given. Using the Dimension or Analyze menu in\nRHINO 3D at the top of the window you can measure all the distances you need\nfrom the baseline for each element.\n\nCreate a table with all the elements that contribute to the longitudinal strength of\nthe ship and calculate the position of the neutral axis, the mid-ship section's\nmoment of inertia, as well as the section modulus SMtop and SMbottom. You can\nstart using the attached .xls file which also contains useful information about the\nlongitudinals (such as thickness etc.). You can obtain all the geometrical\ninformation that is not included in the .xls using the .dwg file.\n\nNote: In the attached .xls file:\n- b is the breadth of each element and t is the thickness\n- Y is the distance of the neutral axis of each element from the baseline\n- h is the vertical projection of each element\n- for the longitudinals \"web\" is the long side and \"flange\" the short one.\n\nDeliverable:\nA technical report showing in detail the calculations for the structural elements in part I\nand the .xls file containing all the calculations requested in part II.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n2.700 Principles of Naval Architecture\nFall 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}