{
  "course_name": "Principles and Practice of Science Communication",
  "course_description": "This course helps in developing skills as science communicators through projects and analysis of theoretical principles. Case studies explore the emergence of popular science communication over the past two centuries and consider the relationships among authors, audiences and media. Project topics are identified early in the term and students work with MIT Museum staff. Projects may include physical exhibits, practical demonstrations, or scripts for public programs.",
  "topics": [
    "Fine Arts",
    "Media Studies",
    "Social Science",
    "Communication",
    "Fine Arts",
    "Media Studies",
    "Social Science",
    "Communication"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 3 hours / session\n\nWhat this Course is About\n\nScience is the most highly specialized form of knowledge we possess. But science also sells, and sells well - in newspapers, magazines, popular books, radio programs, TV documentaries, films, plays, exhibitions and new media. In these and other ways, science is constantly communicated far beyond the confines of the academy and the laboratory.\n\nThis course considers the importance of popular science communication - for working scientists, for science policy makers and funding agencies, and for citizens whose lives are affected by scientific research and its practical applications. We shall look at the wide range of people who are involved in communicating science, asking questions like: what motivates these people to popularize science, and what challenges, opportunities and pitfalls do they face in the process? We shall also explore why non-scientists care about what is going on in science. What prior interest, knowledge, attitudes and expectations do so-called lay people bring to their encounters with science? And what do they hope to take away from the experience?\n\nStarting with questions like these, we shall construct a picture of the complex and frequently difficult relationship between science and the public. Then we shall look at some different forms of popular science communication - journalism, creative writing, radio programs, films and museum displays. Each form of science communication presents particular challenges, and these will be explored with the help of guest practitioners who have professional expertise in particular media. Finally, we shall apply what we've learnt to a series of case studies: a famous public debate about recombinant DNA technology in the 1970s; an equally famous public debate about genetically modified food in the 1990s; and the current debates about stem cell research and 'Intelligent Design'.\n\nThroughout, the course will combine 'theory' and 'practice'. Students will learn about how science communication is supposed to work ('theory'), and at the same time they will have the opportunity to discover for themselves just what is involved in presenting science to non-specialist audiences ('practice'). The MIT Museum will be used as an experimental laboratory for the practical work, providing students with opportunities to join in the processes of program and exhibit development. Students will also have the chance to contribute to an iCampus project designed to create a new multi-user educational game based around exploration of science and society issues with the help of hand-held electronic devices.\n\nWhat this Course Aims to Do\n\nTo provide an introduction to popular science communication in the broader contexts of (a) the role of communication in science, and (b) public perceptions of science and technology;\n\nTo provide intellectual resources for constructive critical analysis of popular science communication in a variety of real-world contexts;\n\nTo cultivate practical skills in popular science communication, through hands-on projects at the MIT Museum (including collaboration in POSIT, an iCampus initiative to develop an innovative interactive educational electronic game around a topical issue in science, technology and society);\n\nTo explore the distinctive nature of science communication through journalism, creative writing, radio, TV and museums;\n\nTo explore popular science communication through a series of case studies of science, technology and society issues in the public domain.\n\nWhat this Course Requires\n\nThe course will meet for one 3 hour lecture/seminar per week. In addition, there are two required Saturday classes focused on practical learning, both to be held at the MIT museum. These Saturday classes will substitute for two of our usual weekday classes.\n\nThe course has four main components: 'Principles', 'Practice' and 'Case Studies' are three sequential elements; and a 'Practical Project' element runs throughout the semester. Key texts required for individual sessions should be read prior to the class.\n\nThere are two required texts for the course:\n\nGregory, J., and S. Miller.\nScience in Public: Communication Culture and Credibility\n. New York, NY: Plenum Press, 1998. ISBN: 9780306458606.\n\nChittenden, D., G. Farmelo, and B. V. Lewenstein, eds.\nCreating Connections: Museums and the Public Understanding of Current Research\n. Walnut Creek, CA: Altamira Press, 2004. ISBN: 9780759104761.\n\nAdditional readings are either available on-line or will be handed out in class in a timely fashion.\n\nGrading\n\nAll students taking this course will be asked to develop a significant practical project of their own in science communication; individual guidance will be provided. The final project counts for 40% of the final grade. The remaining 60% will be assessed on the basis of class participation, a take-home midterm exam, and mini-research projects and presentations. See course\ncalendar\nfor details.\n\nACTIVITIES\n\nPERCENTAGES\n\nClass Participation\n\n20%\n\nTake-home Midterm Exam\n\n25%\n\nMini-research Projects and Presentations\n\n15%\n\nFinal Project\n\n40%",
  "files": [
    {
      "category": "Resource",
      "title": "A New Agenda for the Public Understanding of Science",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-014-principles-and-practice-of-science-communication-spring-2006/72ff7c527fa80cccce3493acef455c0b_durant_newagenda.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "Why should we promote the public understanding of science?",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-014-principles-and-practice-of-science-communication-spring-2006/9a2dfa5e9d69b2c0bd06b38606827f1c_durant_promote.pdf",
      "content": "Scientific\nIssues and Perspectives\nWhy Should we Promote the Public\nUnderstanding of Science?\nGEOFFREY THOMAS and JOHN DURANT\nIntroduction\nThe public understanding of science is widely regarded as A Good Thing.\nthat it is difficult to argue against the greater comprehension of almost anything\nby almost anybody, this is not particularly surprising. For the most part,\nhowever, such support as exists for the promotion of public understanding of\nscience is largely tacit; certainly, it often escapes close examination. Yet such\nexamination is the more necessary at a time when greater public awareness of\nmatters scientific is being actively encouraged by Government agencies, leading\nrepresentatives of the scientific community, and many others. What, exactly, do\nwe mean by the public understanding of science; and why, exactly, should we be\nconcerned to promote it?\nThis paper is offered as a contribution to the current debate on these and\nrelated questions. The first half of the paper rehearses a\nof different\narguments that are commonly deployed in favour of promoting the public\nunderstanding of science. On the basis of this review,\nsecond half of the paper\ncritically a number of assumptions that\nembodied in\nof these\narguments. This examination paves the way for a discussion of the notion of\nliteracy, which provides at least\npreliminary criteria according to\nwhich the nature and extent of public understanding of science may be assessed.\nBefore turning to these topics, we must say something about the phrase\n\"public understanding ofscience\" itself.\nmany ways, it is regrettable that this\nphrase has come to stand for a concern\nwider perceptions of science in\nsociety. For one thing, public\nof science may be taken to\nis\ncertainly false, namely that there exists in society a single and/or a\nstable outlook on matters scientific; and for another, it is at least triply\nambiguous. As will become obvious in our review of arguments in favour of\n\nGEOFFREY THOMAS AND JOHN DURANT\npromoting public understanding of science, different authors mean different\nthings by the terms public, understanding, and science. For this reason, at least, it\nmay be helpful at the outset to say what\nintend by these terms.\nBy\nmay be meant anyone and everyone from legislators and civil\nservants, at one end of the spectrum, to private individuals at the other. For\npresent purposes, we shall take the public to be the people as a whole other than\nthose acting in their professional capacity as expert representatives of the\nscientific community. (An alternative term for the public thus defined is \"lay\npeople\").\nis an even trickier notion than public. In popular\nparlance, on the one hand, it is commonly used to mean anything and everything\nfrom knowledge to sympathy; and in dictionaries, on the other hand, it is\ngenerally defined as: to grasp mentally; to perceive the nature or significance of;\nor to know how to deal with. In each case, conventional usage is rather too\nextensive for present purposes. Later on, we shall offer a somewhat more\nrestricted interpretation of the notion of understanding with reference to the\nconcept of scientific literacy.\nFinally, there is the term science itself. While the root meaning of science is\nknowledge, this is clearly too broad a definition to be of much use. For our\npurposes, scientific knowledge is knowledge that is produced by and in some\nsense bears the seal of approval of the scientific community. (The scientific\ncommunity, in turn, is simply that group of people who are recognized as the\nprofessional knowledge-producers in our culture.) This sociological definition\nhas the great advantage that it presupposes nothing about the nature or the\nsignificance of science,. other than that it is an authoritative or officially\nrecognized form of knowledge. We are concerned here with scientific knowledge\nof all kinds, embracing not only what are generally termed the natural sciences\nbut also the scientific aspects of medicine and technology.\nNine Arguments for Promoting the Public Understanding of Science\nThe literature on our subject is extensive and diverse. Calls for the promotion of\nthe public understanding of science have come from many and varied quarters\nand have been motivated by many and varied concerns. We shall rehearse briefly\nno fewer than nine different arguments, distinguished according to the nature of\nthe benefits which they see as stemming from greater public understanding of\nscience. The alleged benefits are to: science itself; national prosperity; national\npower and influence; individuals; democratic government; society as a whole;\nintellectual life; aesthetic appreciation; and morality. This classification has its\nweaknesses: it represents a complex picture somewhat simplistically; it may be\ntaken as exhaustive, when almost certainly it is not; and it may conceal the\noverlap which can and does exist between different arguments. Despite these\nweaknesses, the classification is offered both as a convenient guide to a complex\nliterature and as a basis for discussion.\n1. Benefits to Science\nIt is quite common for advocates of greater public understanding of science to\nsuggest that such understanding benefits science itself. Quite apart from the need\nto attract new recruits into the scientific community, it is often argued that public\nsupport for science depends upon at least a minimal level of public awareness of\nthe processes and products of scientific research. The prolific science writer Isaac\nAsimov, for example, has claimed that \"Without an informed public, scientists\nwill not only be no longer supported financially,they will be actively persecuted\".\nThe difference between understanding and non-understanding, Asimov suggests,\nis\"the difference between respect and admiration on the one side, and hate and\nfear on the other\".'\nWhether or not they share\nsomewhat dramatic view of the matter,\nmany practising scientists are inclined to respond to perceived threats to the well-\nbeing of their disciplines by trying to promote greater public understanding of\nthem. In the early\nPaul Couderc saw the roots of public opposition to\nscience in \"widespread lack of knowledge on the part of the general populace of\nthe concepts of science, its objectives, its capabilities, its promise\", and he went\non to advocate knowledge itself as an \"antidote for anti-science\".? Similarly, in\nthe early 1980s American biologists responded to the growth of\nmotivated opposition to evolution by entering the public arena to expound their\nviews on\nHere, once again, the assumption appears to have been that\npublic understanding would bring public consent to the findings of science.\nThere is another way in which science itselfmay benefit from the promotion of\ngreater publicunderstanding. Given the kind ofhyperbole that from time to time\nattaches to particular scientific and technological developments it would not be\nsurprising if sections of the public were to acquire unrealistic and unrealizable\nexpectations of science. Wherever this occurs, it is arguable that there is a risk of\nloss of confidence, cynicism, and eventual withdrawal of support. (Could it be,\nperhaps, that there is something of this in contemporary public disenchantment\nwith civil nuclear technologies?) In a recent work, the sociologist ofscience Harry\nCollins has defended his own discipline's concern to analyse science as a form of\nhuman, and therefore fallible, expertise in precisely this way. Professional\nscientists, he notes, are the experts to whom we must turn when we want to know\nabout the natural world. However, they can offer only\"the best advice that there\nis to be had\". To ask for more than this, Collins suggests, is to risk \"widespread\ndisillusion with science with all its devastating\n2. Benefits to National Economies\nIt is not difficultto see a connection between public understanding of science and\nthe economic wealth of nations. Let us suppose that national wealth is\ndetermined in part by success in competition for the sale of goods and services in\ninternational markets, and that success in such markets is based in part upon the\npossession of vigorous research and development programmes for the generation\n\nGEOFFREY THOMAS AND JOHN DURANT\nof new goods and services. Vigorous research and development programmes\ndepend in part upon a steady supply of scientifically and technically trained\npersonnel; and it seems clear that only nations whose peoples possess a generally\nhigh level of scientific and technical understanding will be able to sustain this\n..\n.\nsupply, and hence maintain their ground in the international competition for\neconomic wealth.\nThis argument was given due prominence in a report of the Royal Society on\nThe\nUnderstanding of Science in 1985:\nImprovements in existing technologies demand some degree of scientific and/or\ntechnical understanding from all concerned-the designer, the\nthe manager\nand the\nThe new technologies, such as those involved in electronics,\nsynthetic materials,\nor biotechnology, have developed from the\nunderlying science. Their successful exploitation requires those responsible for the\nnation's industries, as well as a supportive government, to be aware of science and\ntechnology, to recognize their potential value and to accept the opportunities they can\ngenerate.'\nThis is certainly not the only kind of economic argument in favour of\npromoting public understanding of science. For example, it can be argued that a\ncertain familiarity with science and technology is necessary in order to sustain\nconsumer demand for science- and technology-based products. In recent years,\nhowever, it appears that the argument based on\nhas had\nparticularly wide currency, at least in the English-speaking world.\n3.\nto National Power and Influence\nOver and above any purely economic benefits, greater public understanding of\nscience has been claimed t o bring wider political benefits in its wake. For\nexample, such benefits were widely touted in the debates on scientific education\nwhich took place in the United States in the post-Sputnik years.\nLe\nCorbeiller, Professor of Applied Physics and General Education at Harvard,\nsuggested that the problem facing the United States was\"to bring the American\npublic to know what science is\". For one thing, the country needed many more\nscientists and engineers, not only to sustain its expanding civil and military\nindustries, but also to help spread American influence to the rest of the world.\n\"Our adversary\", he wrote,\"has taken full advantage of the progress of science,\nnot only on the interior front but also in his external propaganda, where he\npresents himself to the world as the champion ofscience, the bourgeois countries\nas sunk in\nLe\nmessage was clear: scientific\neducation for young people and adults alike was a national necessity if the United\nStates was to maintain its position of intellectual and ideological leadership in the\nworld. Of course, similar reasoning has been employed outside the sphere of\n\"Cold War\" politics; but the sharpness of that particular conflict has generated\nperhaps the clearest examples of this particular argument in the literature.\nPROMOTE PUBLIC UNDERSTANDING OF SCIENCE?\n4. Benefits to Individuals\nIt has often been suggested that improved understanding of science and\ntechnology is useful to anyone living in a scientifically and technologically\nsophisticated society. The claim here is that more knowledgeable citizens are able\nto negotiate their way more effectively through the social world: that they are\nbetter-equipped to take decisions about diet, health-care, and personal safety;\nand that they are better-placed to make a wide range of consumer choices in the\nface of conflicting (and often spuriously \"scientific\") promotional claims on\nbehalf of products. The Royal Society Report outlined part of this particular\nargument as follows:\nIgnorance of elementary science cuts off the individual from understandingmanyof the\ntools and services used every day. Same basic understanding of how they function should\nmake the world a more interesting and less threatening place. It is obviously not necessary,\nand hardly possible, for an individual to understand the functioning of everythingfrom a\nbus to a ball point pen or a television set, But those who have never been stimulated to\nenquire about how things work and who lack the basic knowledge to pursue such an\nenquiry are surely at a disadvantage in the modern world.\nAnother crucial area of benefits to individual citizens relates to employment.\nClearly, individuals who lack basic information about and understanding of\nscience and technology may be either cut offfrom job opportunities altogether or\nprevented from taking full advantage of technical developments in their place of\nwork. Here, of course, the interests of individuals and those of national\neconomies may overlap to a significant degree.\n5. Benefits to Democratic Government\nMuch of the literature on the public understanding of science is concerned with\nthe politics of decision-making about science. The issues at stake here are easily\nsummarized (but perhaps not so easily resolved, as the article by Robert\nFullinwider in this volume makes clear). In democratic societies, citizens possess\nthe right to influence decisions that are taken on a wide variety of matters in\nwhich they have an interest. Fairly obviously, modern science is far more than a\npurely private pursuit: for one thing, a great deal of scientific research is funded\nfrom the public purse; and for another, the results of this research exert a\nprofound influence over many aspects of public and private life. Clearly,\ntherefore, citizens have legitimate interests in science, and there is a case to be\nmade that they possess the right to influence the science policy-making process.\nThe bridge from these preliminary points to our theme is now easily made. If\nscience is to be controlled by the people, then the people had better know\nsomething about science. It is worth observing that two distinct benefits are at\nstake here. Greater public understanding of science may be thought to promote\nmore democratic decision-making (by encouraging people to exercise their\ndemocratic rights), which may be regarded as good in and of itself; but in\naddition, it may be thought to promote more effective decision-making (by\n\nGEOFFREY THOMAS AND JOHN DURANT\nencouraging people to exercise their democratic rights\nformer benefit\nhas been widely discussed in the literature on public participaton in science,' and\nthe latter appears to be embodied in the Royal Society Report's contention that\n\"wider understanding of the scientific aspects of a given issue will- not\nautomatically lead to a consensus about the best answer, but it will at least lead to\ninformed, and therefore better, decision-making\".\n6. Benefits to Society as a Whole\nThe last section was concerned with public understanding of science as an aid to\ndemocratic decision-making. Also operating at the level of relationships within\nsociety, but this time not concerned with specifically political processes, is the\nargument that the general health of a nation in which science is practised depends\nupon the effective integration of science into wider culture. Understandably,\nperhaps, this is an argument that has found favour with some social anthropolo-\ngists. Writing at the end of the\nfor example, the American anthropologist\nMargaret Mead noted with concern the growing alienation of lay\nfrom the\nworlds of science and technology. She suggested that a \"schismogenic process\"\nwas under way in western\nand that this could and should be stopped\nby the discovery of 'new educational and communication devices\" capable of\nbridging the gulf between \"the specialized practitioners of a scientific or humane\ndiscipline and those who are laymen in each particular field\".\"\nThis last quotation makes it clear that the problem of divisions within culture\nis not confined to sciencealone. All sorts of activities may cut themselves off from\nthe common weal by becoming specialized and highly technical. However,\nscience is the paradigm of specialization and technicality, and it presents us with\nthe problem of fragmentation in a particularly acute form. As long ago as 1961\nthe historian of science A. Hunter Dupree warned that the isolation of science\nfrom the rest of American culture was producing a scientific\"cargo cult\". Many\nof the media-generated symbols of science in the public mind, he asserted, were\n\"no more functional parts of the scientific enterprise than are the bamboo\nantennas of the Melanesians\". Failing to understand science properly, the public\nresponded with a mixture of fear and adulation; and it was thus the \"positive\nduty\" of the Universities to set about destroying the \"cultic\"images upon which\nsuch unproductive responses were\nThe problem of the gulf between science and the wider culture has been\naddressed in an interesting way by the science policy analyst Maurice Goldsmith.\nIn several publications, Goldsmith has developed the notion of the \"science\ncritic\" by analogy with the more familiar ideas of literary or music\nHis\nsuggestion is that each person should become his or her own science critic; but it\nis some measure of the\nof the problem that the whole notion seems lightly\nodd. Science broadcaster, yes; science journalist, certainly; science popularizer,\nof course; but science critic? The very notion seems slightly odd, conjuring up\nvague images of indignant protests against the laws of nature. Yet it is precisely\nthe sense of detachment underlying this reaction that Mead, Dupree and many\nothers have seen as such a powerful argument in favour of the promotion of the\npublic understanding of science.\n7. Intellectual Benefits\nNo review of this kind would be complete without reference to the place of\nscience in our intellectual culture, where by intellectual culture we mean the\nattributes of an educated and cultivated mind. This notion of culture as\ncultivated intellect may be traced from the writings of Victorian educationalist\nand man of letters\nArnold in the middle of the nineteenth century to\nthose of the physicist and novelist C. P. Snow in the middle of the twentieth\ncentury. For Arnold, culture was the sum of the very best human intellectual\nachievements, with the emphasis\nupon the classics and humanities. The\nDarwinian biologist Thomas Huxley challenged Arnold's emphasis champion-\ning the place of science in intellectual culture, and boldly asserting that,\n\"the man who should know the history of a bit of chalk which every carpenter carries\nabout in his breeches pocket, though ignorant of other history, is likely, if he will think his\nknowledge out to its ultimate results, to have a true and therefore a better conception of\nthis wonderful universe and of man's relation to it than the most learned student who is\ndeep-read in the records of humanity and ignorant of those of nature\".\"\nRepeatedly from Huxley's time to our own, the argument has been put that\nscience is an intellectually enabling and ennobling enterprise. For Snow, the\nscientific edifice of the physical world was \"in its intellectual depth, complexity\nand articulation the most wonderful collective work of the mind of\nSnow's advocacy of a common culture, in which (for example) molecular biology\nwould be a requisite, was part of a long-standing attempt to broaden the notion\nof what it is to be an educated person. If the need for such broadening is accepted,\nthen the promotion of public understanding of science becomes part and parcel\nof the promotion of intellectual culture itself.\n8. Aesthetic Benefits\nClosely linked to the intellectual argument outlined above is an aesthetic\nargument that would make science as central to a truly cultivated mind as\nliterature, music, and the performing arts. This argument suggests that science is\nthe distinctively creative activity of the modern mind. T o one American scientist\nand writer, for example, science is this century's cathedral\nwhile to\nanother it is this century's art-\"the most interesting, difficult, pitiless,\nexhilarating and beautiful pursuit we have yet\nT o many scientific\nhumanists, in particular, it has seemed that the Romantics had it quite the wrong\nway round; so far from degrading the mind with its arid, soulless conceptions,\nscience has been portrayed as continually expanding what the historian ofscience\nGlass called \"the area of beauty and meaning\" which it reveals.\"\n\nGEOFFREY THOMAS AN D JOHN DURANT\nThe American advocate of science Warren Weaver has eloquently captured\nboth the intellectual and the aesthetic arguments in favour of the promotion of\nthe public understanding of science:\nThe capacity of science progressively to reveal the order and beauty of the universe,\nfrom the most evanescent elementary particle up through the atom, the molecule, the cell,\nman, our earth with all its teeming life, the solar system, the metagalaxy, and the vastness\nof the universe itself, all this constitutes the real reason, the incontrovertiblereason, why\nscience is important, and why its interpretation to all men is a task of such\nurgency, significance and\nHere, therefore, are arguments to the effect that we should promote public\nunderstanding of science for the same sorts of reasons that we preserve rare\nbooks, conserve beautiful buildings, and promote the arts. Without knowledge\nof science, it is suggested, life would be that much less worth living.\n9. Moral Benefits\nFinally, there are ethical arguments for promoting the public understanding of\nscience. According to a number of authors, of whom perhaps the scientist and\nbroadcaster Jacob Bronowski is best-known in the recent past, the internal\nnorms or values of science are so far above those of everyday life that their\ntransfer into wider culture would signal a major advance in human civilization. If\nscience could convince us, for example, that many social evils stem from\nignorance or neglect of the scientific spirit itself, then according to the biologist\nPaul\nit would have given us, \"another noble gift: a basis for responsible\nand judicious self-direction as a design for living\".\"\nThe mathematical biologist Anatol Rapoport has suggested that the following\nethical principles are inherent in scientific practice:\nthe conviction that there exists objective truth; that there exist rules of evidence for\ndiscovering it; that, on the\nof this objective truth, unanimity is both possible and\ndesirable; and that unanimity must be achieved by independent arrivals at convictions,\nthat is, by examination of evidence, not through coercion, personal argument, or appeal to\nauthority.\nRapoport argues that this list represents a substantial part o f a superior ethical\nsystem which might, with considerable benefit, be much more widely adopted in\nhuman affairs.\nMinimally, at least, this ethical argument depends upon science providing\nespecially powerful illustrations of moral precepts whose ultimate justification\nlies elsewhere. However, it is possible to go further by claiming that science can\nestablish as well as exemplify moral precepts. This was the position adopted by\nthe nineteenth-century English philosopher Herbert Spencer, who looked to\nscientific laws as the basis not only for the understanding of nature but also for\nthe organization and regulation of society. Spencer's evolutionary ethics was but\none (albeit particularly influential) version of a more general philosophy,\ntraceable at least as far back as the Enlightenment, which holds that scientific\nunderstanding makes people not merely wiser but better.\nIn recent years, ethical arguments for the promotion of the public understand-\ning of science have become rather unfashionable. Partly, at least, this may be\nbecause they have attracted a great deal of critical attention from moral and\nsocial philosophers; but partly, also, it is because the scientific humanism upon\nwhich they commonly rest has gradually withered in the face of growing public\nconcern about what have come to be seen as the totally unwelcome social\nimplications of much scientific research. To take only the most dramatic\nexample, our generation has become accustomed to the idea that a substantial\nfraction of scientific research and development is devoted to sustaining the\ninternational\nrace; and in this situation, Bronowski's sweeping claim that\n\"every machine has been a\nhas come to seem not so much\ncomplacent as utterly fantastic.\nScientific Understanding and Scientific Literacy\nWe have now rehearsed nine distinct kinds of argument in favour of promoting\nthe public understanding of science. We d o not intend to assess and criticize each\nof them in turn. Inevitably, individuals will differ in their attitudes t o each.\nPractising scientists may perhaps find themselves drawn to some version of the\nscientificargument; other academics may perhaps incline towards the intellectual\nand the aesthetic arguments; cabinet ministers and civil servants may perhaps\nfind one or more of the economic and the political arguments to their taste; and\nso on. We happen to be working in the field of continuing education, and in\ngeneral we find ourselves drawn to arguments based on the enhancement of the\nlives of individuals (nos. 4,7 and 8) and the welfare of society as a whole (nos. 2,5\nand 6). We are less attracted to the arguments based on benefits to national\npower and influence (no. 3) or to morality (no. 9), since such benefits appear to us\neither illusory or undesirable (or both). We say more about the argument based\non benefits to science below.\nHaving rehearsed so many different arguments, we have felt obliged to\nsummarize our own view of them in this way. This, however, is not our main\nobject. To repeat what was said at the outset, most people who have taken the\ntrouble to comment on the question at all appear to be agreed that the promotion\nof the public understanding of science is \"A Good Thing\"; but what the nine\narguments reveal is the fact that beneath this superficial consensus there lie\nprofound differences of orientation, of outlook, and of aim, That these\ndifferences are not more obvious is due chiefly to the deceptive simplicity of the\nnotion of public understanding of science. Take, for example, the first of the\narguments outlined above. The scientific argument rests upon the key assump-\ntion that greater public understanding of science brings greater public approval\nof science in its wake; but what is meant by understanding and approval here? By\nunderstanding, do we mean a grasp of the aims of science, the norms of science,\nthe processes of science, the products of science, or a combination of some or all\nof these? And by regard, d o we mean approval of the practice of science, the\nprinciples of science, the expert judgments of science, the research priorities of\n\nGEOFFREY THOMAS AND JOHN DURANT\nscience, or again a combination of some or all of these? Without being clearer\nhere, it is difficult to see what we are being invited to accept.\nEven granted that these ambiguities can be cleared up, the scientific argument\nraises a second and larger problem, namely that in order to have any general\nforce it appears to rest either upon the unacceptable notion of understanding as\nthe manipulation of consent or upon the unexamined notion of science as\ninherently approvable, or both. If, on the one hand, to understand something is\nautomatically to approve\nthen\nthe argument holds; but who would\nwish\nsuch a view\non the other hand, to understand\nsomething is not automatically to approve of it, then the argument holds only\ncan be shown that science is inherently approvable; but while this last\nproposition may appear superficiallyattractive, a moment's thought is enough to\nshow that it is implausible. For surely even the most sanguine view of science and\neven the most generous view of society must allow that there may be cases where\nas least some rational and informed observers will find cause to disapprove of one\nor another aspect of science; and if this is conceded, then it becomes clear that the\nrelationship between understanding and approval is not necessary but rather\ncontingent upon the nature of the particular understandings and the particular\ncontexts in which they occur.\nThis point is treated in thechapter in this volume devoted to a discussion of our\n,\npilot survey, but for the moment it may be illustrated by reference to an earlier\nexample. It is perfectly possible that a firmer grasp of population genetics and\npalaeontology amongst American fundamentalists would help to reduce levels of\norganized opposition to the teaching of evolution in American public schools\nand colleges; but it is also perfectly possible that it would not. Here, everything\ndepends upon exactly what fundamentalists are really objecting to, and why. To\njudge from the nature of their interventions in the\ndebate,\nsome of the representatives of science appear to believe that more population\ngenetics and paleontology are the answer, whereas others take the view that in the\nend the problem will only be overcome by resolving issues that are fundamentally\nmoral and\nWe have explored the implications of the scientific argument in this way simply\nin order to emphasise the importance of being clear about what we mean by the\npublic understanding of science. In developing our own thoughts on this subject,\nwe have found it helpful to make use of the concept of scientific literacy. This\nconcept encapsulates what in our view should be a major, or even the main goal\nof efforts to enhance public understanding of science; and at the same time, it\nserves to convey the fundamental nature of the issues. What, then, do we mean by\nscientific literacy?\nAccording to the Oxford English Dictionary, to be literate is to be\"acquainted\nwith letters; educated, learned\". One who is literate is \"a liberally educated or\nlearned person\". Thus, literacy has to d o not merely with the ability to read and\nwrite but with a certain measure of learning which may reasonably be expected to\nflow from the application\nbasic skills; and\ntake a liberal education as\nbeing in the most general sense an education for citizenship, then literacy takes\non even wider connotations of active and effective participation in society.\nFor some years, the wider connotations of the concept of literacy have been\ntaken up in debates about political education. Thus, the Working Party of the\nHansard Society's Programme for Political Education published their report\nunder the title \"Political Education and Political Literacy\". They defined\npolitical literacy as \"the knowledge, skills and attitudes that are necessary to\nmake a man or woman both politically literate and able to apply this literacy\".\nThey went on to identify a complex, situation-dependent combination of\nknowledge\nof the political system), skills\ngaming and simulation\nstudies), and attitudes\nvalues such as \"rules for civilised procedures,\nfreedom, toleration, fairness, respect for truth and reasoning\") which are to be\nfound in the politically literate person. Such a person, they wrote,\nwill then know what the main political disputes are about; what beliefs the main\ncontestants have of them; how they are likely to affect him, and he will have a\npredisposition to try to do something about it in a manner at once effective and respectful\nof the sincerity of others. Put another way. . . teaching should help to develop empathy\nabout other political viewpoints and to give people a knowledge of the actual political\nconflicts of the day; some language or system of concepts with which to express themselves\ncritically about these problems, and neither to expect too much or too little from their own\nHow far can this usage be applied in the fields of science and technology? The\npolitical scientists' emphasis on a suitable combination of knowledge, skills and\nattitudes seems, on the face of it, quite appropriate. Presumably, scientifically\nliterate people have some basic knowledge of science and technology, particu-\nlarly in the context of their own lives; also, they have the skills that are necessary\nto interpret new developments in science and technology, particularly as they\nimpinge on their own lives or the lives of others around them; and finally, they\npossess the attitudes that permit them to respond actively and effectively to these\ndevelopments where appropriate. (Some of the political assumptions underlying\nthese ideals are discussed at greater length in the paper by Michael Shortland in\nthis volume.)\nIn the realm of\nKenneth Prewett has taken a similar approach and\nused the term \"savvy\" in discussing scientific literacy. Savvy people are those\nwith skills and insights that make for success in what would otherwise be\nperplexing and intimidating situations. They are not bewildered by the arrival of\nnew scientific languages or the introduction of new techniques and technological\nappliances. Being generally familiar with the scientific-technological underpin-\nnings of society, scientifically literate people are\"in-the-know\" and can make the\nsystem work to their own advantage.\" To this extent, scientific literacy may be\nregarded as a basic survival skill in a scientifically and technologically\nsophisticated society.\nThis approach to the notion of scientific literacy incorporates much of the\nspirit of the Hansard Society Working Party's concept of political literacy. In\ncommon with their approach, it rejects any narrowly technical knowledge of\nparticular branches of science and technology, however thorough, as of itself\nto constitute scientific literacy. Seen as the fostering of this sort of\n\nGEOFFREY THOMAS AND JOHN DURANT\nscientific literacy, attempts to promote the public understanding of science\nbecome attempts to enhance people's abilities to live with and benefit from, while\nat the\ntime they avoid being mystified or oppressed by, the scientific and\ntechnical expertise that are such fundamental aspects of our society.\nThus far, our discussion has focused on one major area of competence-what\nBenjamin Shen has termed civic science\nThe hope we have identified is\nthat scientifically literate people may be both more active and more effective\ncitizens; but by the same token, ofcourse, it may also be hoped that such people\nwill find that the quality of their personal and working lives has been enriched.\nHere, however, it is less easy to generalize. Fairly obviously, individuals\nin\nthe extent to which they gain intellectual and aesthetic satisfaction from great art\nor great literature; and presumably the same is also true\nscience. The task\nhere, we suggest, should be t o ensure that science is at least as publicly available\nand accessible as are other major products of human creativity.\nAs in personal life, so also in working life there must be large differences in the\nextent to which individuals find themselves in need of an acquaintance with either\nthe processes or the products of science. This having been said, however, it\nappears that the number of tasks in modern industrial societies which require\nfamiliarity with one or another aspect of science and technology increases more-\nor-less continually. Throughout the\nfor example, Britain has experienced\nboth chronically high levels of unemployment and debilitating shortages of\ncertain sorts of scientifically and technically skilled labour. Here is a case where\ngreater levels of public scientific literacy would seem to have been in almost\neverybody's interests.\nThere is a danger in trying to identify the component terms within the concept\nof scientific literacy in too rigid and formal a way. Much of the existing literature\non the subject2' identifies some or all of the following characteristics of scientific\nliteracy:\nI. An appreciation of the nature, aims and limitations of science; a grasp of\n\"the scientificapproach\nw-rational argument, the ability to generalize, systema-\ntize and extrapolate; the roles of theory and observation.\n2. An appreciation of the nature, aims and limitations of technology, and of\nhow these differ from those of science.\n3. A knowledge of the way in which science and technology actually work,\nincluding the funding of research, the conventions of scientific practice, and the\nrelationships between research and development.\n4. An appreciation of the inter-relationships between science, technology, and\nsociety, including the role of scientists and technicians as experts in society and\nthe structure of relevant decision-making processes.\n5. A general grounding in the language and some of the key constructs of\nscience.\n6. A basic grasp of how to interpret numerical data, especially relating to\nprobability and statistics.\n7. The ability to assimilate and use technical information and the products of\ntechnology; \"user-competence\" in relation to technologically-advanced pro-\nducts.\nSome idea of where or from whom to seek information and advice about\nmatters relating to science and technology.\nOne has only to glance a t a list like this to realize how unsatisfactory it is. While\nour eight items certainly cover many topics relevant to scientific literacy, they are\nabstract and ideal qualities that appear extremely remote from the needs and\ninterests of ordinary people. Together, they amount to a formidable combination\nof qualities rarely encountered anywhere, even within the expert domains of\nscience and science studies. Whatever we may have in mind when we think about\nthe promotion of scientificliteracy, presumably it is not the prospect of creating a\nsociety composed entirely of professional scientists-cum-science policy analysts!\nWhat has gone wrong in the attempt to define the component parts of scientific\nliteracy in the abstract is that we have come up with many relevant attributes but\nsomehow missed the heart of the matter, which is the way in which ordinary\npeople relate to the world of science. To be scientificallyliterate is not to be expert\nin anything in particular, but rather to be able to deal effectively with matters\nscientific as they arise in the course of life; it is to be able to cope with science in a\nway that is both respectful of scientists' legitimate expertise and wary of their\nmany\nand weaknesses; it is to be able to recognize science for what it\nis, and thus to make discerning judgments about its personal and social\nrelevance.\nConclusion\nIn this paper we have reviewed some of the commoner arguments that have been\nused by those who support the promotion of the public understanding of science.\nWithin these arguments, we have detected the presence of a number of rather\ndifferent ideas about and interests in the public understanding of\nmany\nways, the promotion of the public understanding of science is rather like the\nprotection of the environment: both are eminently worthy causes which easily\nrecommend themselves to many and varied supporters; but while it is difficult to\nimagine how anybody would wish explicitly to oppose them, it is almost equally\ndifficult to achieve a consensus amongst their supporters about what, exactly,\nthey entail and why, precisely, they are deserving of so much support.\nWe have attempted to provide a preliminary account of the nature of the\npublic understanding of science in terms of the concept of scientific literacy.\nUndoubtedly, this concept is itself problematic; but we believe that it offers a\npromising way of bringing into sharper focus the question of the relationship\nbetween science and the rest of society. At the same time, the concept of scientific\nliteracy lends itself to theclearer articulation of the essentially political argument\nfor promoting the public understanding of science which is concerned with\ndecision-making about science-related issues in a democratic society. As several\nof the other articles in this volume make plain, the politics of the public"
    }
  ]
}