{
  "course_name": "Principles and Practice of Assistive Technology",
  "course_description": "6.811: Principles and Practice of Assistive Technology (PPAT) is an interdisciplinary, project-based course, centered around a design project in which small teams of students work closely with a person with a disability in the Cambridge area to design a device, piece of equipment, app, or other solution that helps them live more independently.",
  "topics": [
    "Engineering",
    "Computer Science",
    "Human-Computer Interfaces",
    "Electrical Engineering",
    "Electronics",
    "Mechanical Engineering",
    "Mechanical Design",
    "Health and Medicine",
    "Public Health",
    "Engineering",
    "Computer Science",
    "Human-Computer Interfaces",
    "Electrical Engineering",
    "Electronics",
    "Mechanical Engineering",
    "Mechanical Design",
    "Health and Medicine",
    "Public Health"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1 hour / session\n\nLabs: 2 sessions / week, 2 hours / session\n\nPrerequisites\n\nThere are no formal prerequisites for the course. We seek students from a wide range of backgrounds and disciplines. Teams of three to four students will complement each other's skill sets. Many of the students are in Mechanical Engineering, Electrical Engineering, and Computer Science, but students from all majors are welcome. This course is a good fit for students interested in public service, user-centered product design, working closely with a client with a disability (potentially in consultation with their caregivers and / or clinicians), and tackling difficult, real-world problems.\n\nDescription\n\n6.811: Principles and Practice of Assistive Technology (PPAT) is an interdisciplinary, project-based course, centered around a design project in which small teams of students work closely with a person with a disability in the Cambridge area to design a device, piece of equipment, app, or other solution that helps them live more independently.\n\nOver the course of the term, each team meets with its \"client,\" iterates through multiple prototypes, and learns about the challenges and realities of designing technologies for people with disabilities.\n\nAlong with the project, the course includes guest lectures from clinicians in rehabilitation, human-computer interface experts, product designers, and people living with physical or cognitive impairments, with topics such as principles of successful assistive technology design; perspectives from people with disabilities, AT makers, and users; design processes; human factors; and social, economic, and ethical perspectives on disability.\n\nLab exercises will be featured in which students use and evaluate various assistive technologies.\n\nCourse Goals\n\nUnderstand principles and complexities of assistive technology design and engineering.\n\nLearn about the challenges and realities of people with disabilities and become equipped as an advocate.\n\nGain experience managing a team-based design / engineering project and working with a real client.\n\nCourse Components\n\nLectures and Labs: These involve hands-on activities, discussions, and occasional guest speakers with experience in disability and assistive technology. Some of the lab periods will provide time for teams to discuss and work on their projects with technical mentors. Attendance and active participation in all in-class activities are required.\n\nClient project: This is a central part of the course. Descriptions of potential projects and clients will be presented in the second week of class, and matches will be announced in the third week. Teams will meet weekly with their client to understand their needs, define a problem that can be solved with assistive technology, develop evaluation metrics, and test multiple iterations of prototypes. The client meetings, design work, and documentation represent the majority of work required outside of class. Deliverables for the project include a written contextual inquiry report, a video documenting the client's challenge or the design process, midterm and final presentations, and blog reflections.\n\nReflections: Each student will write a few individual blog-style reflections. We expect that you will think critically about the material and activities in PPAT, write about disability from your own perspective, attend other events and happenings around Cambridge and Boston related to disability, or learn more your client's life experiences. We will share many of these posts on the PPAT class blog. Some posts may be private, but we encourage you to make the majority of posts public so that the world can learn about your work in the course.\n\nProjects\n\nSome examples of past projects have included:\n\nCustomized seat cushion for wheelchair users.\n\niPhone app for detecting clothing colors and patterns to help a blind person dress independently.\n\nBinoculars for birdwatching, that are accessible without the use of hands.\n\nBicycle with sensing and a haptic interface designed for a blind rider.\n\nAndroid-based task-reminder and sequencing system for a person with a brain injury causing deficits in working memory.\n\nBlind-accessible modification to an otherwise inaccessible espresso machine.\n\nCustomized mouse event handler for someone using only his eyes to control the mouse.\n\nVoice-controlled tablet-based software to control various aspects of the user's environment.\n\nCustom \"no-spill\" spoon for a person with a spinal cord injury to eat more easily.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\n4 Blog Posts\n\n10%\n\nVideo documenting either client challenge or design process\n\n10%\n\nMid-semester presentations\n\n10%\n\nFinal-semester presentations\n\n10%\n\nOnline, open-source documentation & press release (+ high quality photos)\n\n20%\n\nAttendance, discussion participation, lab check-ins (i.e. mentor feedback)\n\n20%\n\nClient and peer feedback\n\n20%\n\nLecture and Lab Expectations\n\nThis year, we aim to have lively discussions, debates, and other activities about disability and assistive technology in lecture and lab sessions. We expect full attendance at all sessions (unless you have an excused absence). When guest speakers are presenting, please do not use laptops, tablets, or phones. Most importantly, PPAT requires your presence and active participation in lectures and labs--we are truly interested in your ideas, thoughts, and reflections throughout the semester.\n\nTextbook (Optional)\n\nCook, Albert M., and Jan Miller Polgar.\nCook & Hussey's Assistive Technologies: Principles and Practice\n. 3rd ed. Mosby Elsevier, 2007. ISBN: 9780323039079. [Preview with\nGoogle Books\n]",
  "files": [
    {
      "category": "Lecture Notes",
      "title": "Class Blog: Reflections on Assistive Technology and Disability",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-811-principles-and-practice-of-assistive-technology-fall-2014/43034396f64a436c681f989b6f86ab16_MIT6_811F14_BloggingAssig.pdf",
      "content": "6.811 Blogging Assignments\n6.811: Principles and Practice of Assistive Technology\nClass Blog: Reflections on Assistive Technology and Disability\n\nIn addition to the assistive technology (AT) project part of PPAT, this term is also an opportunity to reflect\non AT, disability, and related issues.\n\nEach student participating in the class will submit four individual blog posts throughout the term. You\nshould write an article (about a page long, but there are no strict word limits). In addition, you can embed\nphotographs, diagrams, videos, or other elements to convey your ideas. You should write in the first\nperson and with your own voice.\nMost of your submissions will be available online on the class blog; they will be part of the public face of\nthe class during the semester. As a result, you should get permission from other people if you are writing\nabout them or taking photos or video. The course staff may lightly edit your writing for clarity before\nfeaturing it online.\nGrading\nWe will use the following checklistbased grading scheme (out of 1.0).\nChecklist Question\nWeight\nIs the post on time?\n0.1\nIs the post free of spelling, grammar,\n0.2\nlanguage, and formatting errors?\nTopic: Is the post relevant to the goals of PPAT?\n0.2\nIdeas: Are the ideas interesting and clearly communicated?\n0.2\nStructure and Organization: Is the post wellwritten and an effective use of\n0.2\nthe blogging medium? (Recommended: photos, videos, headings, bullet\npoints)\nDistinctiveness: Is the post particularly original, insightful, personalized, or\n0.1\nexciting to read?\nSuggested Blog Topics\nMost importantly, we want you to write about topics in disability and assistive technology that inspire you.\nHere are some suggestions; if you want to write about something else, just run it by one of the course\nstaff.\nEvents/Field Trips\nWrite a report and reflection on your experience at one of the following events/places:\n● Abilities Expo (September 57, Boston Convention and Exhibition Center)\n● Open Style Lab final presentations (Saturdays in October at the Museum of Science)\n● Visit with the BU/Tufts occupational therapy programs\n● Visually Impaired and Blind User Group (VIBUG) meeting\n● The Boston Home\n● The Leonard Florence Center for Living\n● Artisan's Asylum or Danger!Awesome\n● Spaulding Rehabilitation Hospital, Braintree Rehabilitation Hospital\n● Labs around MIT (Hugh Herr, Neville Hogan/Igo Krebs, Leia Sterling)\nClient Interviews\n● Have your client teach you something, and write about what you learned and your experience.\n\n● Write a more detailed \"explainer\" article about the disability that your client has.\n● Discuss a nontechnological challenge that your client faces.\n● Describe a typical day in the life of your client, including some of the challenges that he or she\nfaces (and also things that are easy).\n● Describe the caregivers and other people that your client interacts with on a regular basis.\nLectures and Labs (Maximum: 2)\n● Discuss peoplefirst language and the complexities of communicating with and about people\nwith disabilities.\n● Write a summary and reflection on one of the guest speakers or lectures.\n● If you disagreed with something that was discussed in the class, write a post about it,\narticulating your concerns.\n● Write a more detailed analysis of the work you did in one of the lab activities (i.e. the wheelchair\ncampus accessibility lab or electronic device access labs).\nAdvocacy\n● Write about a disabilityrelated cause or charity, and include actions that readers can take to\nsupport the cause.\n● Conduct an interview of someone with a disability or an advocate (a community organization, a\nlawyer, an activist, or an entrepreneur) and write about what you learned.\n● Write about an issue that people with a disability face and propose realistic changes in social\nnorms or public policy that would address it.\nPersonal Reflection and Research\n● Discuss a personal experience with impairment, disability, or assistive technology.\n● Watch a film that includes someone with a disability and critically evaluate the portrayal of\ndisability in that film.\n● Investigate a local issue related to disability and accessibility (e.g. on the MBTA, in hilly Beacon\nHill, or in taxis).\n● Describe landmark legislation on disability (e.g. the Assistive Technology Act, the Americans\nwith Disabilities Act) and its impact on your client or certain disability communities.\n● Research a controversial issue in the disability community (e.g. Braille and sign language\nliteracy, cochlear implants) and write a balanced post describing the different points of view.\nAssistive Technology Ideas\n● Discuss an issue related to the inaccessibility of existing technologies or the built environment.\n● Describe a technology/device idea that is beyond the scope or timeline of this class, but that\ncould be beneficial to people with disabilities.\n● Research a new, emerging technology that you are familiar with and describe (or speculate) on\nhow it will affect people with disabilities. Will it level the playing field or increase the gap between\npeople with and without impairments?\n● Propose an event or program that could promote assistive technology education, awareness, or\ninnovation.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n6.811 Principles and Practice of Assistive Technology\nFall 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Contextual Inquiry and Success Metrics",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-811-principles-and-practice-of-assistive-technology-fall-2014/f96edeeaeff5e358cbc2717b94fe31af_MIT6_811F14_CntextulInqry.pdf",
      "content": "Contextual Inquiry and Success Metrics\nMIT Class 6.811/Principles and Practice of Assistive Technology\n\nThis document directs you to organize your findings about your client, using the\nframework of the human-activity-assistive technology-context (HAAT) model.\n(Note: This was previously adapted from a 6-10 page long written assignment on\ncontextual inquiry)\n\nStart with describing your client (age, gender), his/her living situation (independent,\nalone, in group etc.) and general level and type of activity, including occupational\nstatus. State where you met your client. Describe your client's disability. How is this\nindividual representative of others with this kind of disability? In what ways is this\nindividual distinctive or unique? Describe any \"meta\"-issues (e.g. about\ncommunication or assumptions or fatigue) that arose during your meeting.\n\nDiscuss the activity you identified that the client wishes to do (but currently cannot),\nor that the client wishes to do more of, do more independently, do faster or better or\nmore reliably, or do in more places than s/he can currently manage. Describe how\nthe client's disability manifests as a functional deficit in the client's performance of\nthe activity of interest. Describe your client's psychosocial affect with respect to the\nactivity.\n\nDescribe the strategies that the client has used or tried in the past to perform the\nactivity of interest. What assistive technology or technologies, if any, has the client\nused or tried? In what way have those strategies or assistive technologies failed or\nonly partially succeeded? Briefly describe what you understand to be the cause of\nthis failure in terms of the disability, the activity, and/or the context.\n\nWhat is the client's physical, social, cultural, and institutional context? How do\nelements of the context (including availability, or unavailability, of assistance) relate\nto or contribute to the functional impairment? What contextual aspects are salient in\nconsideration of this client's situation, and how?\n\nThis final paragraph about success metrics will be addressed at a later lab:\nDefine a \"success metric\" for this client. The metric can have both qualitative and\nquantitative aspects. Define a monotonic scale (low to high) for each aspect of your\nmetric, and evaluate the client's current level of ability with respect to the scale you\nhave defined for that aspect. Keep in mind that you will use your metric(s) as design\nconstraints in the next phase of the class, and will evaluate them repeatedly during\nthe term; define the metric(s) so as to facilitate this kind of engineering use.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n6.811 Principles and Practice of Assistive Technology\nFall 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Mid­-Semester Presentation Instructions",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-811-principles-and-practice-of-assistive-technology-fall-2014/36540d5768909893ab4366ed5603e17e_MIT6_811F14_MidSemstrPres.pdf",
      "content": "6.811: MidSemester Presentation Instructions\n6.811: Principles and Practice of Assistive Technology\nMidSemester Presentation Instructions\nEach team will give a 15minute presentation to share its work with the rest of the class. Signups will be\narranged in class. We will have an expert design review panel, who will attend each presentation and\ngive feedback.\nWe are allowing friends of PPAT to attend our midsemester presentations this is a public event. The\nattendees understand that your projects are currently in their midstages. You may wish to be discreet\nabout certain kinds of personal information about your client, or to blur photos.\nInstructions:\n● Please remember to only refer to clients by their first name.\n● You may wish to show your team's project video during the presentation.\n● We encourage all of your team member's to have a speaking role during the presentation.\nDeliverables:\nIn addition to the presentation, you should upload your slides or other presentation materials.\nPresentation Contents:\nYour presentation need not be highly formal, but it must cover each aspect of what your team has\naccomplished so far. We recommend a length of 1215 minutes; we will stop you at exactly 15 minutes.\nWe recommend the following structure:\n● Introduce yourselves.\n● Contextual Inquiry (45 minutes): Describe your client and his/her abilities, disabilities and\nactivity goals. Use the HAAT model. Present the qualitative and quantitative success metrics that\nyou chose. This section should correspond to Section 1 of the MidSemester Report.\n● Project Organization and Progress (~45 minutes): Show early sketches, mockups, or\nprototypes and your client's reactions to them. Describe your iterative design process to date and\nhow you've narrowed down ideas and the resources (facilities, people) you've made contact with\nso far. This section should correspond to Section 2 of the MidSemester Report.\n● Project Plans (~34 minutes): Describe your timeline for the rest fo the semester and each team\nmember's past and future contributions and roles.\nGrading:\nTeams will be evaluated primarily on the quality of their contextual inquiries, ideas, and plans, but also on\ntheir presentation contents and style and their ability to answer questions. The panelists' feedback will\nalso contribute to the grading.\nAs audience members, each student in the class should also be prepared to ask good questions and\nprovide constructive suggestions.\nEach team will receive written feedback about their presentation, along with a letter grade, the week\nafter the panels.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n6.811 Principles and Practice of Assistive Technology\nFall 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Mid­Semester Report",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-811-principles-and-practice-of-assistive-technology-fall-2014/e7d9c3dbf99b617ef4110a62a97fb1ae_MIT6_811F14_MidSemstrRprt.pdf",
      "content": "6.811: MidSemester Report\n6.811: Principles and Practice of Assistive Technology\nMidSemester Report\nIn addition to your midsemester presentation, each team should submit a report describing their client,\ntheir contextual inquiry, and their earlystage design and prototyping work. The report should include the\ncontent in the presentation, along with additional supplementary content.\nInstructions:\n● Your report should be titled \"MidSemester Report for Team [Client Name].\"\n● All team members should be listed as authors (and must contribute to the writing!).\n● You should use oneandahalfspaced text and adhere to the length guidelines below.\n● Roughly 60% of the document should be text, and the rest should be photos, video frames, or\nfigures.\n● Your report should be in PDF format.\nReport Contents\nSection 1: Contextual Inquiry (57 pages)\nIn this section, your document should focus exclusively on the client and on contextual inquiry around the\ntask of interest using the HAAT model. Do not include your ideas about the assistive technology project\nthat that might help the client.\nHuman\n● Start the document by generally and briefly describing your client (age, gender), his/her living\nsituation (independent, alone, in group etc.) and general level and type of activity, including\noccupational status. State where you met your client, and include a photo of him or her if possible.\n● Describe your client's disability. How is this individual representative of others with this kind of\ndisability? In what ways is this individual distinctive or unique? Describe any \"meta\"issues (e.g.\nabout communication or assumptions or fatigue) that arose during your meeting.\nActivity\n● Discuss the activity you identified that the client wishes to do (but currently cannot), or that the\nclient wishes to do more of, do more independently, do faster or better or more reliably, or do in\nmore places than s/he can currently manage.\nContext\n● What is the client's physical, social, cultural, and institutional context?\n● How do elements of the context (including availability, or unavailability, of assistance) relate to\nor contribute to the functional impairment?\n● What contextual aspects are salient in consideration of this client's situation, and how?\n● Include one or more photos of relevant aspects of the physical context, if necessary for the\nreader to understand the nature functional impairment.\nAssistive Technology\n● Describe the strategies that the client has used or tried in the past to perform the activity of\ninterest. What assistive technology or technologies, if any, has the client used or tried? In what\nway have those strategies or assistive technologies failed or only partially succeeded? Briefly\ndescribe what you understand to be the cause of this failure in terms of the disability, the activity,\nand/or the context.\nSuccess Metric\n● Define a \"success metric\" for your client and your project. The metric can have both qualitative\nand quantitative aspects. Define a monotonic scale (low to high) for each aspect of your metric,\n\nand evaluate the client's current level of ability with respect to the scale you have defined for that\naspect. Keep in mind that you will use your metric(s) as design constraints in the next phase of\nthe class, and will evaluate them repeatedly during the term; define the metric(s) so as to facilitate\nthis kind of engineering use.\nSection 2: Project Organization and Progress (35 pages)\nYou should also describe your team's progress to date. In particular, you should include the following:\n● How are you tackling the project, and what subtasks you are taking on in what order?\n● Your initial design concepts, including a diagram, sketch or photo of each concept.\n● Your client's reactions to the concepts and/or mockups that you presented.\n● How you've used iterative design to narrow and revise those concepts based on your client's\nfeedback.\n● Your current documentation practices (including, if applicable, links)\n● The resources and contacts (e.g. facilities, other advisors from outside the class, relationships\nwith companies or organizations) that you require for your project, and your current contact status\nwith them.\n● An estimated budget for your project, including expenses to date.\n● Finally, you should also describe the role and contributions to date of each individual member of\nyour team, as well as their expected contributions for the remainder of the project.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n6.811 Principles and Practice of Assistive Technology\nFall 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "November and December Course Requirements and Deliverables",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-811-principles-and-practice-of-assistive-technology-fall-2014/3f3b859b5d01f61a168ea234443870c3_MIT6_811F14_Deliverables.pdf",
      "content": "November and December 2014 Deliverables for PPAT\n6.811: Principles and Practice of Assistive Technology\nNovember and December Course Requirements and Deliverables\nHere are the deliverables for November and December:\nPrototyping\n● Week of 11/5: Second Prototype\n● Week of 11/19: Third Prototype (leave with client)\nBlog Post #4\n● Please consult the blogging assignment instructions.\nEndofSemester Presentations\n● Each team will give a 9-minute presentation.\n● As per the course syllabus, the endofsemester presentation is 10% of the final grade.\n● Presentation guideline:\n○ Introduce your client and the assistive technology challenge.\n○ Briefly show/describe your earlier prototypes and the evaluation results of your\nexperiments.\n○ Describe/demonstrate your final prototype and how it performed, according to your\nexperiments and success metrics.\n○ Describe what you learned as a team about assistive technology design and engineering\nand from your client.\nFinal Showcase\n● Demo your final product, show videos and photos (from your laptop)\n● Recommended: poster (24'' x 36'') on your project (we can help you print these)\nOnline Project Documentation, Press Release, and HighQuality Photos\n● First page: press releasestyle page introducing your client, the design challenge, your design\nprocess, and the results\n● Goal of documentation: What documentation, code, designs, prototypes, experiments and\nresults, and reflections would be useful to pass onto a future PPAT\nteam/UROP/SuperUROP/6.UAP/M.Eng./PhD student?\n● Possible documentation options:\n○ Github repositories of software code\n○ ATSolutions.org or Instructables of design and implementation\n○ Written reports\n○ Technical notes or student research competition papers\n● This week's lab: mentors will check in on the state of documentation\n● Next week's lab: teams will present a documentation plan to their mentors\nClient and Peer Feedback\n● The course staff will solicit feedback from clients near the end of the course online or in person.\n● We will also prepare a form for you to evaluate your teammates near the end of the class.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n6.811 Principles and Practice of Assistive Technology\nFall 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Project Documentation Plan",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-811-principles-and-practice-of-assistive-technology-fall-2014/13438bba8ace3892af2f104b82c9ab7c_MIT6_811F14_ProjectDocum.pdf",
      "content": "6.811: Principles and Practice of Assistive Technology\nProject Documentation Plan\n\nThe goals of documenting your project are as follows:\n1.\nEnable others to reproduce and continue your project.\n2.\nCreate publicly available materials that are useful for educational purposes (future PPAT classes,\n\noccupational therapy, and assistive technology programs)\n3.\nProvide an opportunity for personal reflection at the end of PPAT.\n\nTeams should assign a lead team member to each of the project documentation elements by the start of\nthe lab, one student per team should submit a onepage document\nstating:\n●\nthe product name\n●\nfor each of the elements of the project documentation (except for the personal reflection): 1) the\nname of the lead team member 2) the planned platform (if applicable)\n\nElements of Project Documentation\nItem\nDescription\nName of Product\n-\ncome up with a name for your product\nPress Release and\nPhotos/Video\n-\nsee\n\nsubmission requirements\n-\nsubmit on blog and Google Drive, and provide links to the other project\ndocumentation elements\nHAAT Summary\nThis may be adapted from your midsemester report. Include one paragraph\neach about:\n-\nyour client\n-\nthe target activity\n-\nthe context\n-\ncurrent gaps in your client's current approach\n-\nyour team's assistive technology solution\nRequired Materials\nfor Final Prototype\n-\nsee end of document for spreadsheet format\nHelpful Contacts and\nResources\n-\nprovide names, contact information, and descriptions of people and\nresources on campus and beyond who were helpful for your project\nCode Repository\n-\nmay not be applicable for nonsoftware projects\n-\nrecommended platforms\n\nFabrication/\nInstallation/ Usage\nInstructions\n-\nfor software projects, installation information may be included in the\ncode repository.\n-\ninclude text and photos\n-\nrecommended platforms: atsolutions.org, instructables.com, Vimeo,\n\nGithub, or your own website\nPrototypes and\nExperiments\n-\ninclude photos, screenshots, and descriptions of early and late-stage\nprototypes\n-\ndescribe feedback from client, experiments, and results\nFinal Showcase\nDisplay\n-\nprepare a demo and display (e.g. 24''x36'' poster, photos, video) for\nDecember 10\n-\neach team will get one table and whiteboard of space\n-\nconsider accessibility in your display design\n\nPersonal Reflection\n-\nDescribe how your own understanding of the activity of interest, or of the\nsuccess metric, changed as the term proceeded.\n-\nDescribe one or more aspects of the effort that turned out be be easier\nor harder than expected.\n-\nDiscuss ideas or lessons from lectures or labs that arose within the\ncontext of your project.\n-\nOptionally, describe your ideas about how this class could be improved\nin the next offering.\n-\nSubmit on the class blog.\nOther (optional)\n-\nmeeting summaries/minutes, surveys, email threads, brainstorming, etc.\n\nSubmission/Archiving Instructions\n●\nOne student/team: upload your press release to the class blog with links to the other public project\ndocumentation elements (e.g. your client video):\n○\nText\n○\nPhotos (name photos starting with your team name, followed by a number, e.g.\n\"TeamArt_1\", \"TeamArt_2\", \"TeamArt_3\")\n●\nOne student/team: upload your press release and all other documentation (including nonpublic\ndocumentation), in a single submission. This will help for our class archiving purposes.\nYou should include everything within reason, e.g. include PDFs of fabrication instructions but don't\nprint out dozens of pages of code. :)\n●\nEach student: submit your personal reflection on the class blog.\n\nAppendix\n\nRequired Materials for Final Prototype\nItem\nPrice\nVendor\nNotes\nLink (if applicable)\n\nTotal Cost of Materials\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n6.811 Principles and Practice of Assistive Technology\nFall 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Review of October Course Requirements and Deliverables",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-811-principles-and-practice-of-assistive-technology-fall-2014/98b814fb226256df18674ee5c42c88e5_MIT6_811F14_OctDeliverbles.pdf",
      "content": "6.811: October 2014 Deliverables for PPAT\n6.811: Principles and Practice of Assistive Technology\nReview of October Course Requirements and Deliverables\nOctober has a number of formal deliverables for PPAT.\nBlog Posts\n● Blog post #2 should be related to your client. You can write about anything related to your\nclient's life, interests, abilities or disabilities, hobbies, or occupation, experiences with assistive\ntechnology, motivation for participating in the class, or context. You should illustrate some aspect\nof the daily life, challenges, and realities of your client, which is one of the goals of this course.\n● You should not make blog post #2 public unless you explicitly get permission from your\nclient. You can make it a private post on Wordpress or submit a file directly.\n● Blog post #3 can be about a much wider set of topics.\n● As per the course syllabus, blog posts constitute 20% of the final grade.\n● The grading rubric has been added to the blogging assignment instructions.\nResearch Ethics Training\n● Ethical conduct is an essential part of client projects. While we are exempt from requiring MIT\nCommittee on the Use of Humans as Experimental Subjects (COUHES) approval for the projects\nin the class, we will hold ourselves to a high ethical standard.\n● Every student should complete the first part of the Social and Behavioral Research Human\nSubjects Training offered by MIT COUHES. See the assignment description for more details.\n● Completion of the training is graded as part of \"participation\" part of the syllabus..\nVideo Project\n● Your project film is due before the midsemester presentations.\n● The requirements, as listed in the lab, are as follows:\n○ 1 video per team\n○ Content: Either about your client, or your team's design process (if your client does not\nwish to be in the video)\n○ Length: 23 min\n○ Uploaded to Vimeo, subtitled\n○ Deadline: before midsemester panels\n● As per the course syllabus, the video is 10% of the final grade.\nMidSemester Presentations\n● Each team will give a 15minute presentation to a design review panel.\n● Other students in the class will provide feedback in an online interface.\n● As per the course syllabus, the midsemester presentation is 10% of the final grade.\nMidSemester Report\n● Each team will submit a substantial report summarizing their contextual inquiry and project\nprogress to date. There is significant overlap between the midsemester presentation and report.\n● Team mentors may ask for early drafts of the report prior to the due date, at their discretion.\nYour mentor may be able to provide useful feedback in advance of the presentations.\n● The midsemester report will be incorporated into the grading of the midsemester presentation.\nIts contents will also be considered as part of the final documentation, which constitutes 20% of\n\nthe final grade.\nAttendance and Professionalism\n● Attendance is graded under the \"attendance, discussion participation, lab checkins\" part of the\nclass (20%).\n● Please be ontime and prepared for your client meetings.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n6.811 Principles and Practice of Assistive Technology\nFall 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Team Agreement",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-811-principles-and-practice-of-assistive-technology-fall-2014/8ec59a486ebcc2de244fefd2029d7d02_MIT6_811F14_TeamAgreement.pdf",
      "content": "Team Agreement\nMIT Class: Principles and Practice of Assistive Technology\nMIT class 6.811, Principles and Practice of Assistive Technology, is a term-long subject in which\nsmall teams of 3-4 students work with clients from the community. Each team works with one client\nto understand the client's needs and desires, and develop a series of ideas about assistive technology\nthat may be useful to the client. Team activities begin in the middle of September, and run through the\nmiddle of December.\nThis form helps the student team members agree on their expectations for working together. Please\ndiscuss it and fill it out together, as a team, then return it to the PPAT staff. We will email each of you\na scanned copy and retain the original.\nFor All Team Members to Read and Sign in One Another's Presence:\nWe, the undersigned student team members, understand and commit to the following:\n- We will meet and communicate regularly and respectfully with each other as a team to advance\nthis project.\n- We commit to working with our client throughout the term, as described in the accompanying\n\"Team-Client Agreement.\"\n- We have identified (day, time)\nas a regular meeting slot outside of lab.\nTeam member signature:\nDate:\nTeam member signature:\nDate:\nTeam member signature:\nDate:\nTeam member signature:\nDate:\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n6.811 Principles and Practice of Assistive Technology\nFall 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Team-Client Expectations and Agreement",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-811-principles-and-practice-of-assistive-technology-fall-2014/f4a87aa5299c6a17f7ed1c9cacbe0878_MIT6_811F14_ClientAgrment.pdf",
      "content": "Team-Client Expectations and Agreement\nMIT Class: Principles and Practice of Assistive Technology\nMIT class 6.811, Principles and Practice of Assistive Technology, is a one-term subject in which\nsmall teams of 3-4 students work with clients from the community. Each team works with one client\nto understand the client's needs and desires, and develop a series of ideas about assistive technology\nthat may be useful to the client. Team activities begin in the middle of September, and run through the\nmiddle of December.\nThis form helps the client and the student team members agree on their expectations for working\ntogether. Please discuss it and fill it out together with your client, then return it to the PPAT staff.\nFor the Team Members to Read Aloud and Sign, with the Client Present:\nWe, the undersigned student team members, understand and commit to the following:\n- We will meet regularly with you, the client, for 1-2 hours every 1-2 weeks;\n- We will do our best to listen carefully and respectfully to you, and communicate effectively with\nyou; and\n- We will try hard to understand your needs and preferences, and to develop a prototype assistive\ntechnology that you will find useful.\nTeam member signature:\nDate:\nTeam member signature:\nDate:\nTeam member signature:\nDate:\nTeam member signature:\nDate:\nFor the Client to Read and Sign, with the Team Present:\nI, the undersigned client, understand and commit to the following:\n- It is my own, voluntary choice to work with you, the team, this term.\n- I will meet regularly with you, for 1-2 hours every 1-2 weeks.\n- I will tell you about the activity or task that I wish to do more effectively, and about my needs\nand preferences.\n- I will: listen carefully to your questions and ideas; consider carefully any sketches or prototype\nsolutions that you share with me; and respond frankly and constructively.\n- I understand that, while you will try very hard to understand my needs and preferences, and\nto develop an assistive technology that is useful for me, you might not manage to produce a\ncomplete or polished solution before the end of the term.\nClient signature:\nDate:\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n6.811 Principles and Practice of Assistive Technology\nFall 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Video Project",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-811-principles-and-practice-of-assistive-technology-fall-2014/999c661077e3eb83cbe64e7aa53ccc87_MIT6_811F14_VideoAsignment.pdf",
      "content": "6.811: Video Assignment\n6.811: Principles and Practice of Assistive Technology\nVideo Project\nEach team should make a video documenting either (i) their client's challenge or (ii) their team's design\nprocess.\nInstructions:\n● Your project film is due before the midsemester presentations.\n● The requirements are as follows:\n○ 1 video per team\n○ Content: Either about your client, or your team's design process (if your client does not\nwish to be in the video)\n○ Length: 23 min\n○ Uploaded to Vimeo, subtitled\n● As per the course syllabus, the video is 10% of the final grade.\nHelpful Links:\nVimeo compression guidelines: https://vimeo.com/help/compression\n● Helps you choose appropriate visual and audio resolution and codecs\n● SD video is sufficient, though HD is preferred.\nSubtitling:\n● Software for subtitling: http://amara.org/en/\n● Vimeo guidelines on subtitling: https://vimeo.com/help/faq/managingyourvideos/captionsand\nsubtitles\nGrading Rubric:\nTechnical clarity, 40%\n● Is the video stable, welllit and wellframed?\n● Is the audio clear?\n● Was the video subtitled appropriately?\n● Were fonts, transitions and title pages used appropriately?\nStoryline, 40%\n● Was there a clear narrative? Can it act as a 'standalone' without external context?\n● Is the narrative wellpaced?\n● Are the characters introduced well?\n● Is the video interesting to watch overall?\nOthers, 20%\n● Was the assignment uploaded on time?\n● Was the video of appropriate duration?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n6.811 Principles and Practice of Assistive Technology\nFall 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "AT Showcase Worksheet",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-811-principles-and-practice-of-assistive-technology-fall-2014/0aea4ab796ca7a843a5bfdac00d3d59e_MIT6_811F14_AT_Showcase.pdf",
      "content": "What was a piece of AT you thought could have been designed better? How\nwould you have designed it better?\n\nWhat was a piece of AT you thought could have been designed better? How\nwould you have designed it better?\n\nName:\nWhat was your favorite piece of AT? Why?\nName:\nWhat was your favorite piece of AT? Why?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n6.811 Principles and Practice of Assistive Technology\nFall 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Campus Accessibility Lab Exercise",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-811-principles-and-practice-of-assistive-technology-fall-2014/4038d295cdf7850547065b8c5a1028c8_MIT6_811F14_CampusAccess.pdf",
      "content": "6.811: Principles and Practice of Assistive Technology\nCampus Accessibility Lab Exercise\n\nObjectives\n● Survey the state of wheelchair accessibility on and around the MIT campus\n● Understand the challenges and realities associated with using a wheeled mobility device\n\nActivities\n● Campus tour with wheelchairs\n● Reflection discussion session in lab\n\nDeliverables\n● A facilities request for an accessibility improvement to MIT campus, also due before lab.\n● Blog post about this topic (optional)\n\nIn this lab activity, you will use a wheelchair to get around campus while completing certain tasks that\nare common to activities of daily living. You are strongly encouraged to document your experience\nwith notes, photos, and diagrams, as appropriate.\n\nInstructions:\n1. Obtain a wheelchair. Become familiar with how to use it.\n2. Follow the instructions on the last page. You may do tasks 1-7 in any order. Bring a notebook with\nyou. Although we do not have enough wheelchairs for everybody, this is intended to be an\nindividual experience, so if you must have a partner, don't help one another unless there is a safety\nrisk. Each person should submit a unique account of their experience.\n\nDuring the tour of campus, you should:\n● Note the location and details of any accessibility challenges that you encounter, including:\n● Difficulties due to non-functioning/malfunctioning equipment or facilities designed to\nfacilitate accessibility\n● Recommendations that would improve the accessibility of campus (e.g. documentation\nof missing accessible affordances)\n● Make note of accessibility \"successes,\" surprises, or personal encounters.\n3. Return the wheelchairs.\n\nIndividual Reflection\n\nTopics to think about:\n\nA. Document and discuss any accessibility challenges that you encountered. Can you think of ways\nthat either the wheelchair or the environment itself could have been designed to ameliorate each\nchallenge?\nB. Document and discuss your experiences with other people - did you perceive yourself or others\nexperiencing any discomfort when you were speaking with strangers or ordering food? If you were\nable to take the tech shuttle then describe your experience getting on and off.\nC. Discuss what you learned about the realities and challenges of using a wheeled mobility device.\n\nYou should be prepared to discuss these topics during the lecture on Wednesday.\n\nFacilities Request\n\nYou will encounter accessibility challenges during your trek across campus. We should let MIT\nFacilities know about them!\n\nWrite a request to facilities in which you identify one aspect in which the accessibility of the campus\ncould be improved. Then, submit that request to MIT Facilities.\n\nInstructions for Campus Accessibility Survey Lab Activity\n\n1. Activity Guidelines\n● People should complete this lab and the written assignment on their own, when possible.\ngroups of more than 2 people.\n● Except when instructed otherwise, do not make use of your legs and do not exit the wheel\nunless your safety or that of another is at risk.\n● Ask for help only when you need it. Think about what you would/would not be comfortab\nwith if you relied on the wheelchair for mobility.\n\n2. Safety first, last, and always!\n● This is not a race! Move safely and carefully, especially if you have not used a wheelchair\nbefore. Be aware of yourself and your surroundings, and use your common sense.\n● In the event of a problem (e.g. malfunctioning wheelchair), return for assistance.\nNo\nchair\nle\n\nTasks:\nIn this lab you will travel around MIT while voluntarily confined to a wheelchair. Your basic route will\nbe to go from the Stata Center to or around the Student Center and then back. Throughout the trip, you\nwill need to perform a number of tasks that are typical of activities of daily living. To begin, head\ntoward Lobby 7 via one of the paths below (as indicated by the letter on the top of your sheet).\n\na) Exit building 32 from the entrance closest to the gym in the Stata Center, then travel outside (within\ncampus through the opening in building 26 and between buildings 24 and 12, not along Vassar\nStreet). Enter building 7 at sidewalk level from Massachusetts Avenue.\nb) Travel on the third floor of buildings 32, 36, and 34, and 24 (a wheelchair lift will be involved). Go\noutside from building 24 and then travel outside toward Massachusetts Avenue. Enter building 7 at\nsidewalk level from Massachusetts Avenue.\nc) Travel in the tunnels from building 32 to building 26, then (above ground) along the Infinite\nCorridor.\nd) Travel on the third floor (designated by MIT as accessible) of buildings 32, 36, 34, 38, 39, and 37.\nSomewhere around building 37, the accessible path is on the fourth floor. Exit to Massachusetts\nAvenue from Building 35, go outside, and enter building 7 at sidewalk level from Massachusetts\nAvenue.\n\nAlong the way, perform each of the following tasks in any order you see fit, keeping in mind that you\nshould avoid traveling in groups:\n\n1. Get a drink of water from water fountains in two separate buildings.\n2. Use the restroom (or go through the motions of doing so), both with and without a\nwheelchair. Time how long it takes you in each case and remember to not use your legs\nwhen using the wheelchair.\n3. Engage three strangers in conversation (perhaps by asking for directions). Try not to\nvolunteer that you're involved in a class project (but don't lie!).\n4. From the entrance of a building (either from the street or from another building), time\nyourself going up one floor in two different ways:\ni. using an elevator or a wheelchair lift while in your wheelchair; and\nii. using your legs and a stairwell (it is ok to leave the wheelchair sitting at the bottom of\nthe stairwell for a few minutes while you walk up and down).\n5. Get any paper form from the student information center in 7-121.\n\n6. Log onto any Athena-enabled computer and email the instructors with your location.\n7. Go to the stacks in the basement of Hayden Memorial Library (building 14) and note the\ntitle and author of a graduate thesis from the year at which you started at MIT.\n\nOnce you've completed the above tasks, exit building 7 and cross Massachusetts Ave. Depending on\nyour preferences and remaining time, go to the Student Center or Flour. Order a snack or beverage and\nenjoy it in their common seating area.\n\nFinally, return to 32-044 using a different route than the one you took. Optionally, take the Tech\nShuttle, which picks up every ten minutes at Vassar & Mass., and goes directly to Stata.\nTech Shuttle Route:\nhttp://web.mit.edu/facilities/transportation/shuttles/schedules/tech.pdf\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n6.811 Principles and Practice of Assistive Technology\nFall 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Laboratory: Photo and Film Documentation",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-811-principles-and-practice-of-assistive-technology-fall-2014/efd38e09060708424ab3f4994835406a_MIT6_811F14_Lab3.pdf",
      "content": "6.811\nLaboratory: Photo and Film Documentation\n\nAim:\nLearn the basics of film pre-production, production and post-production in documentary\nmaking, to prepare for the class video assignment.\n\nAssignment to complete before lab:\n1. Pick a tangible process that you would like to document in your dorm, home\nor school environment.\nThe process can be as simple as 'How to fry an egg', to as complex as 'How to\nplay the banjo while riding a unicycle through Stata Center'.\n2. Film an interview of someone explaining the process. This is known as \"A\nroll\" in documentary making.\nThe total time of the interview should be under 10 min. Questions to answer may\ninclude:\na. Who performs this process?\nb. When does this happen?\nc. Why does it happen? E.g., \"I lost a bet and have to make eggs every\nmorning for all my roommates for a month.\"\nd. How is this process performed? What tips or tricks are there? What\nchallenges are there? Look at the questions posed in Prof Miller's User-\nCentered Design lecture slides. This is the bulk of the interview.\n3. Get footage (and optionally, photographs) of the process and the\nenvironment it occurs in. This is known as \"B roll\" in documentary making.\nYou may want to consider filming a range of wide (kitchen), mid (person frying\nthe egg on the stove) and close-up shots (frying egg in the pan). Wide shots help\nthe viewer to understand the context the process is happening in, mid shots help\nthe viewer understand the action in the process, and the close-up shot help focus\non critical details or emotions. You may choose to have a person narrating the\nprocess.\n4. Upload the footage into the movie editing software you have on your laptop\n(iMovie, Windows Movie Maker etc.), and bring it to class on Monday.\n\nTips:\n- Film in landscape, not portrait. This is a common mistake with camera phone\nfilming.\n- If you are using your phone camera to record this interview, try to use the mic on\nyour headphones to record the sound from the person being interviewed or\nnarrating, to get higher audio quality.\n- Try to make sure light is coming from behind the camera and onto the subject\nbeing shot, NOT from behind the subject being shot.\n\nThis assignment should take no longer than 2 hours to complete. It is not graded, but will\nbe necessary for our lab activities on Monday. Have fun!\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n6.811 Principles and Practice of Assistive Technology\nFall 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Project Documentation",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-811-principles-and-practice-of-assistive-technology-fall-2014/c1aa2485cf8706bc737db88a9085d517_MIT6_811F14_Lab3Docmetatin.pdf",
      "content": "Project Documentation\n.11 Principles and Practice of Assistive Technology, Fall 2014\nhttp //courses.csail.mit.edu/PPAT\n\nPrinciples and Practice of Assistive Technology, Fall 2014\n\n.11\nComplete this task now (5 minl\nhttp //courses.csail.mit.edu/PPAT\n1 Principles and Practice of Assistive Technology, Fall 2014\nUpload your A roll footage (or any footage with\na person speaking) onto Vimeo\n1. Create a Vimeo account\n2. Upload video\n3. Make sure you get to the page where it says\n'Processing'\n4. You can delete this footage from Vimeo at\nthe end of today\n\nPrinciples and Practice of Assistive Technology, Fall 2014\n\n.11\nMow are we aocumenting our\nprojects?\nhttp //courses.csail.mit.edu/PPAT\n1 Principles and Practice of Assistive Technology, Fall 2014\n- Text\no Weekly brief written project updates at lab check-ins\n- Photos\no Final online open-source documentation on\nInstructables.com etc\no End-of-semester press release\n- Video\no Video assignment of client profile or team design\nprocess\n\nPrinciples and Practice of Assistive Technology, Fall 2014\n\n.11\nViaeo assignment\nhttp //courses.csail.mit.edu/PPAT\n1 Principles and Practice of Assistive Technology, Fall 2014\nSpecifications\n- 1 video per team\n- Content Either about your client, or your\nteam's design process\n- Length 2-3 min\n- Uploaded to Vimeo, subtitled\n- Deadline Oct 17, before mid-semester\npanels\n\nPrinciples and Practice of Assistive Technology, Fall 2014\n\n.11\nEaiting\nhttp //courses.csail.mit.edu/PPAT\n1 Principles and Practice of Assistive Technology, Fall 2014\n- Documentary film making Cutting together A\nroll audio, with B roll footage\n- iMovie example\n\nPrinciples and Practice of Assistive Technology, Fall 2014\n\n.11\n\nComplete this task now\nEaiting (50minl\nhttp //courses.csail.mit.edu/PPAT\n1 Principles and Practice of Assistive Technology, Fall 2014\nIn teams (Smin)\n- Review each other's footage\no Lighting, audio quality, shakiness\nIn individuals or pairs (4Smin)\n- Make a super simple 30sec -1min instructional video by\ncutting together A roll and B roll footage, in a video\neditor of your choice.\n- Try out transitions, text, audio effects\n\nViaeo proauction process Detting\nthe footage you neea\n- Pre-production\no\nStoryboara, but leave space for aiscovery!\no A roll ana B roll\n- Production\no Lights, sound, action\no Organizing (Date, location, aescription, auration,\ncorresponaing auaio filel\n- Post-production\no Editing\no Syncing video and audio (Pluraleyes or Final Cut Pro)\no Subtitles and closed captions (Amara)\no Adding music (Vimeo Music for Free)\n.11 Principles and Practice of Assistive Technology, Fall 2014\nhttp //courses.csail.mit.edu/PPAT\n\nViaeo proauction process Viaeo\nana souna quality\n- Pre-production\no Storyboard, but leave space for discovery!\no A roll and B roll\n- Production\no\nLights, souna, action\no Organizing (Date, location, description, duration,\ncorresponding audio file)\n- Post-production\no Editing\no Syncing viaeo ana auaio (Pluraleyes or Final Cut Prol\no Subtitles and closed captions (Amara)\no Adding music (Vimeo Music for Free)\n.11 Principles and Practice of Assistive Technology, Fall 2014\nhttp //courses.csail.mit.edu/PPAT\n\nViaeo proauction process Finishing\ntouches\n- Pre-production\no Storyboard, but leave space for discovery!\no A roll and B roll\n- Production\no Lights, sound, action\no Organizing (Date, location, description, duration,\ncorresponding audio file)\n- Post-production\no Editing\no Syncing video and audio (Pluraleyes or Final Cut Pro)\no\nSubtitles ana closea captions (Amaral\no Aaaing music (Vimeo -usic for Freel\n.11 Principles and Practice of Assistive Technology, Fall 2014\nhttp //courses.csail.mit.edu/PPAT\n\nPrinciples and Practice of Assistive Technology, Fall 2014\n\n.11\nComplete this task now\nSubtitling (.5minl\nhttp //courses.csail.mit.edu/PPAT\n1 Principles and Practice of Assistive Technology, Fall 2014\nAs individuals\n- Subtitle 30 sec of your uploaded Vimeo file\nin Amara\n\n/emember\n- 0ive credit\n-\nAsk all involved if they are comfortable with the final video if you\nchoose to post your video assignment publicly\nGuestions?\n.11 Principles and Practice of Assistive Technology, Fall 2014\nhttp //courses.csail.mit.edu/PPAT\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n6.811 Principles and Practice of Assistive Technology\nFall 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Electronic Access Lab (Part 1) Station A: Head Tracker/Eye Tracker",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-811-principles-and-practice-of-assistive-technology-fall-2014/9c6911803d6dbdb571c8a994c7b88371_MIT6_811F14_HeadTracker.pdf",
      "content": "6.811 Principles and Practices of Assistive Technology\nElectronic Access Lab (Part 1)\n\nStation A: Head Tracker/Eye Tracker\nHead tracking allows the user to control a mouse cursor by repositioning the head. Our devices track head\nlocation by detecting a small reflective dot affixed to a pair of glasses. Our eye tracker is a camera that detects\nthe locations of your eyes and (after a short round of calibration) estimates your gaze direction and its\nintersection with the display.\n\nIn this activity, you will use combinations of tracking hardware and software. We have two head trackers and\none eye tracker connected to the laptops. The head tracker computers each have a different software package\nfor configuring the behavior of the camera.\n\nThis Lab\nThere are only a few laptops with tracking hardware set up. Whenever a laptop comes free, you should do the\ncorresponding section, use \"Camera Mouse,\" \"Eye Tracking\" or \"NaturalPoint Head Tracking.\"\n\nWhen none of the laptops with tracking hardware is available, follow the instructions in the \"Chatting in IRC\"\nsection on your own laptop or one of the provided laptops. The idea is to have conversation happening in the\nIRC channel at all times that students are using the tracking hardware.\n\nA. Camera Mouse\nCamera Mouse is a free program that enables you to control the mouse pointer on your computer screen\njust by moving your head. You can also try downloading this onto your computer if you wish to.\nRead instructions here: http://cameramouse.org/downloads/CameraMouse2014Manual.pdf\n\n1.\nClick on a location on your face to start tracking. We recommend eyes or center of glasses (something\npretty distinct).\n2.\nMake sure that PointNClick is open and then press Ctl + F9 to start the Camera Mouse.\n\nExplore\n\n1. Experiment with PointNClick. There are a lot of buttons in the PointNClick toolbar. Experiment with\nthem to see which you find most useful.\n\n2. Try some regular desktop actions. Move windows around and drag icons around on the desktop.\n\n3. Follow the instructions in the \"Chatting in IRC\" section below.\n\nB. NaturalPoint Head Tracking\n\n1. Make your head trackable. Either put on the provided, lenseless glasses that have the reflective\nheadtracking stick on them, or put one of the provided stickers on your glasses or face.\n\n2. Ensure that the NaturalPoint head tracker is connected to the laptop via USB.\n\n3. Launch SmartNAV from the Start menu. The green light on top of the head tracker should light up when\nyour reflective sticker is in its field of view. The mouse cursor should start moving as you move your head.\n\n4. From here on, try to use only the head tracker! You can left-click by pressing the left Windows key on the\nkeyboard, and right-click by pressing the Context Menu key on the right half of the keyboard (to the left of the\ncontrol key).\n\n5. Launch Dasher from the Start menu, then type some text. Click once in the Dasher window to start, then\nmove the mouse to steer the Dasher cursor into the sequence of letters you wish to type. Click again to stop\ntyping. The letters will automatically be typed into the last window you had focused.\n\nExplore\n1. Try \"Relative\" and \"Absolute\" cursor positioning. Open the SmartNAV window. Try changing the\n\"Cursor Positioning\" setting back and forth between \"Relative\" and \"Absolute\" and observe the effect.\n\n2. Try some regular desktop actions. Move windows around and drag icons around on the desktop.\n\n3. Follow the instructions in the \"Chatting in IRC\" section below.\n\nChatting in IRC\nFollow these instructions when no laptop with tracking hardware is free.\n\n1. Open Chrome and visit http://lightirc.com/start/ (If the Internet isn't working today, go to the Backup Text\nsection below and do that instead.)\n\n2. When it connects, type \"/join #ppat\" and press enter to join our chat room.\n\n3. Chat! Send messages by pressing enter or clicking the send button that's just to the right of the input box,\nwhichever is easier. Talk about things that interest you:\n\n●\nYour favorite classes\n●\nYour most dreaded finals\n●\nHobbies\n●\nThe weather\n\nKeep the conversation going so that people using the tracking hardware have a chance to participate.\n\nAlternative Instructions\n1. Launch Notepad from the Start menu.\n\n2. Type the following passage:\nSome say the world end in fire,\nSome say in ice.\nFrom what I've tasted of desire\nI hold with those who favor fire.\nTopics to think about:\n●\nWhat usability issues did you encounter with each of the tracking devices? What was easy to do and\nwhat was more difficult?\n●\nHow does using a head/eye tracker affect your experience in the chat room?\n●\nAre there ways in which app UIs could be better suited for use with head/eye trackers?\n●\nHow comfortable did you feel using each device by the time you were done?\n\nB. Eye Tracking (Currently Does NOT work)\nFollow these instructions when the eye tracking laptop is free. The eye tracker looks like a Kinect and rests on\nthe keyboard looking up at the user's eyes.\n\n1. Ensure that the eye tracker is connected to AC power.\n\n2. Launch QuickACCESS from the Start Menu (Start > QuickACCESS Beta). This is the software for\nenabling eye-tracking-friendly control of the operating system.\n\n3. Ensure that the eye tracker is connected to the laptop via Firewire.\n\n4. Place the eye tracker on the keyboard and direct it up toward your eyes. Both green lights beneath the\nlens will light up when your eyes are in view and the camera is the proper distance away.\n\n5. Start calibration. Moving the mouse to the blue haze on the left corner of the screen, then click the first icon\nin the column that has an \"eye\" at the top. Then follow the moving target with your eyes. (When you need to\nrecalibrate, click the second icon in that column that looks like a mouse pointer pointing at one of the calibration\ntargets.)\n\n6. Start the on-screen keyboard. Aim the cursor at the blue haze (you may need to look past the edge of the\nscreen) and click the keyboard icon by closing your eyes for about a second. Resize the keyboard to fit the\nscreen. (You may find this difficult, and may need to use a mouse to start the keyboard.)\n\nFrom here on, try to use only the eye tracker!\n\nExplore\n\n1. Practice clicking. Depending on the current setting, you click by closing your eyes for about a second, or\nholding the cursor at the same screen position for a second or two.\n\n2. Explore the settings. Activate the blue haze and click the gears icon in the third column. Change any\nsetting you're curious about, but please change it back when you're done.\n\n3. Try hiding the mouse cursor. Click the fourth icon in the fourth column of the blue haze menu. It looks like\na \"No Mouse Cursor\" sign. (Be sure to turn it back on afterward.)\n\n4. Try some regular desktop actions. Move windows around and drag icons around on the desktop. Go to the\ndesktop by clicking the fourth icon in the third column that looks like a desk top. Then use the dragging actions\nin the first column of the blue haze menu.\n\n5. Follow the instructions in the \"Chatting in IRC\" section below.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n6.811 Principles and Practice of Assistive Technology\nFall 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Electronic Access Lab (Part 1) Station B: Alternative Text Input",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-811-principles-and-practice-of-assistive-technology-fall-2014/d194d53e323d76f9de8e97ca996e4db5_MIT6_811F14_AltrnativText.pdf",
      "content": "6.811 Principles and Practices of Assistive Technology\nElectronic Access Lab (Part 1)\n\nStation B: Alternative Text Input\nYou should do the \"Conventional Typing\" activity first on a laptop; afterward, you can do\nthe other activities in any order depending on equipment availability. Keep track of this for the alternative\nkeyboard/mice exercise.\n\nConventional Typing\nFor this exercise, you need a laptop computer to obtain a baseline of your conventional typing speed.\n1. Go to http://www.typingtest.com/ and conduct a minutelong typing test.\n2. Repeat two more times for a total of three trials. Note whether your typing speed\n(adjusted for errors) has increased or decreased (due to learning effects or fatigue).\n\nDasher\nFor this exercise, you will test out Dasher, an input method developed by the Inference Group at the\nUniversity of Cambridge.\n1. On your laptop, go to www.inference.phy.cam.ac.uk/dasher/ and click on \"Download\" in the sidebar.\n2. Download and install Dasher for your operating system. There are Windows, MacOS, and Linux\nversions.\n3. Once installed, play around with Dasher for a minute or two. What are your first impressions and\nthoughts about the interface? Based on your interaction, how do you think it works? Adjust the speed of\nDasher (in the bottom left corner of the interface) to a speed that you think is optimal.\n4. Prepare a stopwatch (either your own or www.onlinestopwatch.com/). Type out the following passage\nusing Dasher (the first sentence of Black Beauty by Anna Sewell) letter for letter, i.e. without any errors.\nThe first place that I can well remember\nwas a large pleasant meadow with a pond\nof clear water in it.\nThis paragraph contained 21 words. Compute your WPM.\n\n5. Practice with Dasher for five minutes to try to improve your proficiency of the interface. Afterward, try\ntyping the following sentence (paraphrased from the Americans with Disabilities Act) letter for letter, i.e.\ndo not make mistakes. Use a stopwatch.\nIt is the purpose of the Americans with\nDisabilities Act to provide a clear and\ncomprehensive national mandate for the\nelimination of discrimination against\nindividuals with disabilities.\nThis sentence contains 24 words. Compute your WPM. Did your time improve?\n\n6. In the options, change the Alphabet to \"More Alphabets...\" \"Deutsch / German with limited\npunctuation\". Try typing in the Black Beauty sentence again and compute your WPM. How was this\ndifferent?\n\n7. Change the alphabet back to \"English with limited punctuation\". What do you predict will happen if you\nare asked to type non-words? Use a stopwatch to calculate your WPM for the following text:\naRgfhE uIfsacm fdfqkk jfIOPL TrdIfd\n8. Some experienced users of Dasher (often people with physical disabilities who cannot use a physical\nkeyboard, but instead rely on mouse or head-tracker input) can achieve speeds of over 30 words per\nminute. The performance is achieved in part by the system's language model, which adjusts the sizes of\nletters based on the probability of the word. You should discuss the pros and cons of language models.\n\nSpeech Recognition\nSpeech recognition might be useful for people who do not have the fine motor skills needed to use a\nkeyboard. In this part of the activity, you will test out automatic speech recognizers typically used for web\nsearch and examine the limits of speech recognition.\n\n1. Set up a speech recognizer on your computer or mobile device. This might include:\n●\nSiri (free) on an iPhone or iPad using the Notes application.\n●\nGoogle's speech recognizer on an Android smartphone, used as input to a text message or\ndocument.\n●\nSpeech icon on the www.google.com search prompt (via a laptop and Google Chrome, which you\nmay need to install).\nFamiliarize yourself with the speech interface. Try the phrase \"Furiously sleep ideas green colorless.\"\nWhat was the result?\n\n2. Try saying each of the words separately, e.g. \"furiously\", \"sleep\", and so on. Do you experience an\nimprovement or degradation in performance?\n3. Try saying \"Massachusetts Institute of Technology.\" Now, try \"Maine Institute of Technology.\" What are\nthe results? Try additional single-syllable words and longer phrases and note the performance of the\nspeech recognizer.\n4. Try saying ` printf(\"hello world\\n\"); ` and ` #include <cstdlib> `\n\nDictation Interfaces\nThis section will give you a sense of speech recognition interfaces for navigating a desktop environment\nand dictating a document.\n1. In Windows 7, click on the Start menu, go to Control Panel, and click on \"Ease of Access\".\n2. Under \"Speech Recognition\", click on \"Start Speech Recognition.\" Follow the wizard, if necessary, to\nensure that your microphone is working (this should only be necessary for the first person to use the\nworkstation.\n3. Click on \"Open the Speech Reference Card\" to learn the different kinds of speech commands that can\nbe used in Windows 7. Launch Microsoft Word or another word processor (e.g. Notepad or Wordpad)\n\n4. Start the stopwatch and try dictating the Black Beauty sentence word for word, i.e. without any errors.\nTry doing this entirely without the use of the mouse or keyboard -you should be able to use speech\ncommands, for example, to correct any errors. Compute your WPM.\n5. Spend up to five minutes testing out different speech correction functions, including deleting words,\nchanging the capitalization of a word, and spelling out words letter by letter. Start a stopwatch and try\ndictating the Americans with Disabilities Act sentence. Compute your WPM.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n6.811 Principles and Practice of Assistive Technology\nFall 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Electronic Access Lab (Part 1) Station C: Alternative Keyboard/Mice",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-811-principles-and-practice-of-assistive-technology-fall-2014/dcf48a7471e81e9c85fce6c4cf5af5ac_MIT6_811F14_KeyboardMice.pdf",
      "content": "6.811 Principles and Practices of Assistive Technology\nElectronic Access Lab (Part 1)\n\nStation C: Alternative Keyboard/Mice\nConventional Typing\nFor this exercise, you need a laptop computer to obtain a baseline of your conventional typing speed.\n1. Go to http://www.typingtest.com/ and conduct a minutelong typing test.\n2. Repeat two more times for a total of three trials. Note whether your typing speed (adjusted for errors) has\nincreased or decreased (due to learning effects or fatigue).\n\nAlternative Keyboards\nAlternative keyboards are designed to make it easier for individuals with certain kinds of fine motor impairments\nto use a keyboard. People who spend large amounts of time using a conventional keyboard may find it useful to\ntry alternative keyboard layouts.\n1. Plug these keyboards into your computer via USB and note your initial reactions to them. Obtain your WPM\nrate using http://www.typingtest.com/.\n2. Switch back to the laptop's regular keyboard. Does it feel more comfortable or ergonomic than these\nalternative keyboard layouts?\n3. How does the Kinesis Advantage Keyboard compare to other keyboards that you have used in the past?\n\nAlternative Mice\nCompare the differences among the Vertical Mouse, Roller Mouse, and Expert Mouse.\n\nErgonomic mice are designed to allow your hand to rest in a more neutral position to reduce the stress from a\ntraditional mouse grip. What are the advantages and disadvantages to this design?\n\nThe Roller Mouse is designed to be placed in front of your keyboard so you don't have to reach for the mouse.\nSee what happens if you lightly roll the bar leftright and forwards. For more information, read\nhttp://ergo.contour-design.com/.\n\nFor the Expert Mouse, you can set the button functions to match specific applications. What is the\nadvantage/disadvantage of this?\n\nReflection\n1.\nWhat kind of effort is required to learn how to use these alternative communication technologies\neffectively? Once learned, how does the speed of access compare with regular keyboard use?\n2.\nHow would this change for highly technical domains that use shorthand or jargon (e.g. programming,\nlegal, medical) that falls outside of standard language models?\na.\nWhat design improvements would you suggest to make these technologies more useful/efficient\nfor assistive purposes?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n6.811 Principles and Practice of Assistive Technology\nFall 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Electronic Access Lab (Part 1) Station D: Cognitive Disability",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-811-principles-and-practice-of-assistive-technology-fall-2014/8faa48b00c0313a7e042722bfc2c9d37_MIT6_811F14_CongitiveDisb.pdf",
      "content": "6.811 Principles and Practices of Assistive Technology\nElectronic Access Lab (Part 1)\n\nStation D: Cognitive Disability\nPeople with cognitive impairments may have difficulties with attention, memory, problem solving, and\nlanguage, among other things. There is variation in the cause, severity, and effects of cognitive\ndisability.\n\nCognitive disability can be present from birth due to genetic reasons, such as with Down syndrome,\nAutism, and Dementia. It can also arise from an injury, such as stroke, illness, or brain tumor. Because\nof the complexity of the brain, the effects of such an injury vary by individual and must be evaluated\nfor each person. Brain injuries often result in some subset of the following:\n●\nDisrupted attention and concentration\n●\nLanguage problems\n●\nDifficulty storing and retrieving new memories\n●\nDifficulty learning new information\n●\nLack of emotional response\n●\nEmotional lability\n●\nDepression and anxiety\n●\nDisorientation\n\nIn this activity, we will focus on the first two items in the list. You will experience a little of what it is like\nto live with cognitive disabilities affecting focus, attention, and language. The two impairments we will\nbe simulating are dyslexia and Attention Deficit Hyperactivity Disorder (ADHD).\n\nDyslexia is a languagebased disability that makes it difficult to read. People with dyslexia\nsometimes perceive words and letters as being inverted, transposed, or otherwise transformed.\nAttention Deficit Hyperactivity Disorder (ADHD) affects a person's ability to focus, which\nmay cause them to have difficulty paying attention to details, following instructions, or sitting\nstill.\n\nAttention\nBefore starting the exercise, watch this video, which contains two short interviews with children with an\nattentionrelated disability.\n1) Visit http://www.pbs.org/wgbh/misunderstoodminds/attention.html\n2) Click the \"view it\" link under \"Attention Video\" at the top\n3) Click \"View clip in QuickTime\" in the popup that appears. (Watch on someone else's computer if you don't\nwant to install QuickTime)\nFeel free to also try out the Visual and Auditory Activity.\n\nNow, we're going to simulate having some of the attention difficulties that someone with a cognitive disability\nmay have.\n1) Go to http://webaim.org/simulations/distractability-sim.swf in a browser with Flash\n2) Follow the instructions and complete the exercise (Easy mode is fine), recording the number of\nattempts and your total time to completion (including all attempts; use a stopwatch).\n\nDyslexia\nThere are four passages written on the next two pages. The first two passages are typeset normally, but\nthe second two passages have been transformed in ways typical of people with dyslexia, such as with\nreversed and transposed letters. (See the example below that has 10 variations of the word \"teapot\" as\nwritten by people with dyslexia.)\n\nRead the passages, timing how long it takes you to complete each one. After each passage, answer the\ncomprehension questions later in this handout. Don't read the questions until after reading the passage.\n\nAnswer the following questions about the first passage:\n1. What is the setting of this scene?\n2. How many characters are present?\n\nAnswer the following questions about the second passage:\n1. What is the proposed interface used to do?\n2. The proposed technology is a combination of which two kinds of interfaces?\n\nAnswer the following questions about the third passage:\n1. Why did Robert box?\n2. How did Robert break his nose?\n\nAnswer the following questions about the fourth passage:\n1. What is the topic of this paper?\n2. What was Wansink's previous finding?\n\nReflection\n●\nGiven the first-hand accounts you heard in the video, how do you think actual attention disorders differ\nfrom what you experienced?\n●\nThere are a number of ATs intended to assist people with cognitive disabilities. For each type of\ndisability that we studied, can you suggest one or more assistive technologies that might enable more\nindependent or effective performance of the relevant task? (Note that some ATs are not limited in their\napplication to those with disabilities; they can be useful to almost everyone.)\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n6.811 Principles and Practice of Assistive Technology\nFall 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Electronic Access Lab (Part 1) Station E: Low Vision",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-811-principles-and-practice-of-assistive-technology-fall-2014/1c8c6cdf3def54698fe0a6a75a075860_MIT6_811F14_LowVision.pdf",
      "content": "6.811 Principles and Practices of Assistive Technology\nElectronic Access Lab (Part 1)\n\nStation E: Low Vision\nBackground\nAlthough many--particularly the elderly--have reduced vision, here we focus only on those individuals who are\nlegally blind. 1 In the United States, being legally blind requires that:\nA. Vision in the best eye is worse than 20/200 with best correction, and/or\nB. Field of view is no more than 20 degrees.\n\nEstimates on the number of legally blind in the United States range between 310 million, but it is difficult to\naccurately determine because census data often collects data in such a way that those who are legally blind\nare inseparable from those who are either completely blind or those who have visual limitations that are\nuncorrected (but correctable). It is worth noting, however, that fewer than 40% of those who are blind or legally\nblind are employed in the US (note that this is different from being unemployed, which entails actively seeking\nwork out).\n\nWhen considering the utility of an assistive technology or accommodation, it is useful to distinguish between\nnear and farsight tasks and, in particular, some of the most common tasks in each that present problems.\n\nProblem FarSight Tasks include:\n1.\nComputer / cellphone use.\n2.\nReading books, papers and restaurant menus.\n3.\nHandwriting / filling out forms.\n\nProblem NearSight Tasks include:\n4.\nNavigation, sign spotting.\n5.\nViewing presentations / TV\n6.\nPerson interaction (principally this is person recognition)\n7.\nMany social activities (most anything that includes demonstration or distant cueing, particularly when\nimpromptu or when there is a time component, e.g. dance, sports, theatre, board/card games)\n\nNote: Many assistive technologies exist for 14; far fewer, if any, for 6 and 7.\n\nThe degree to which someone with lowvision is affected in these activities will of course depend on their acuity\nbut, perhaps less obviously, will be greatly affected by whether (and if) they are near or farsighted. For\ninstance, someone who's nearsighted will need less (if any) magnification for reading materials by virtue of the\n\"natural magnification\" they get from being able to focus at short distances.\n\nAssistive Technologies\nThe most common lowvision AT includes:\n●\nScreen Magnifiers for interacting with computers / phones\n○\nFor desktops/laptops, Windows (with Ai Squared's ZoomText or Freedom Scientific's MAGic)\nhave traditionally been the preferred platform though OSX (with it's builtin magnifier) is gaining\ntraction.\n\n1 Unfortunately, the term legally blind is a bit of a misnomer as individuals so described have vision ranging from\nlight perception to sufficiently highfunctioning as to safely ride a bicycle. Legally blind is usually reserved for\nformal conversations (e.g. with governments or employers); \"lowvision\" is otherwise more\ncolloquial.\n\n○\nFor cellphones, Windows Mobile used to be the preferred platform but iOS has since taken over\n(and Windows Mobile was replaced with the less accessible Windows Phone)\n●\nMonoculars (handheld or head-mounted, optical or electronic) for viewing signage and for viewing\npresentations.\n●\nBoard Magnifiers (camera-based systems that project to a laptop/display); typically used in classrooms\nand, less commonly, in the workplace.\n\nOther products/technologies, e.g. monitor arms (which float a monitor off and over the lip of a desk for effective\ncomputer ergonomics), consumer GPS and cellphones serve double duty as AT for the low-vision (though they\nweren't built for that purpose and are rarely considered as such).\n\nIn addition to assistive technology, provision of certain accommodations by employers and federally-funded\nschools are mandated by (typically) the Vocational Rehabilitation Act of 1973 and the Americans with\nDisabilities Act. Highlights include:\n●\nHuman note-takers in universities\n●\nTesting / materials accommodations in universities (e.g. large print, extended time).\n●\n\"Reasonable\" accommodations that do not impose an \"undue hardship\" on an employer for an\nemployee to perform an essential function of a job.\n\nLab Activities\nIn this station, we will quantitatively assess the efficiency of some\ncommon low-vision adaptations. Specifically,\nwe will look at how use of a board magnifier affects efficiency when taking notes, and also at how different\npresentations of magnified font affect reading speeds.There are also some handheld magnifiers to help with\nreading close up. Try using those to read this handout.\n\n1. Board Magnifiers\nYou may do 1a, 1b in any order. In both steps, you are asked to time yourself copying equations. Please do so\nwith the same attention to detail as though you were taking notes for a class.\na.\nBring to the Note-Taker Station with a pen/pencil, a sheet of paper and a timer. Familiarize yourself with\nthe interface by panning and zooming with the usual iPad-style two-finger gestures. You may also need\nto adjust the camera's focus by sliding the rocker atop the lens, closest to you.\nNow, using a stopwatch, time how long it takes to copy the equations \"on the board\" as seen through\nthe board magnifier's interface. You can pan and zoom (if needed) while doing this. Record this number.\n\nb.\nHead over to either adjacent station in which there are two sheets of equations. Time how long it takes\nto copy the equations on both sheets by looking at them with your naked eye (as you normally would).\n\nConsider the difference in times (if any), bearing in mind that the equations' complexities were roughly\nequivalent. Is there a difference and, if so, how substantial was it? Do you think this stemmed more from your\ninexperience with the board magnifier's interface, or from the time it took to pan and zoom around the image?\nConsider how a low-vision student might be affected if doing this in a class that contained 10 times this number\nof equations.\n\n2. Large Print\nIn this exercise, we measure how large print interfaces (both physical and digital) can affect reading speed. In\nthe exercises that follow, you will be timing yourself while reading approximately 1000 words of text in each of\nfour separate interfaces. You should \"read for comprehension,\" i.e. neither studying nor skimming it. Because\nyou will be reading chapters from a book, it is recommended that you do them in order.\n\n1.\nTime how long it takes to read the Chapter 01 (paper, normal font) handout. Divide this number by 853\nto get your normal words-per-minute (WPM)\n\n2.\nTime how long it takes to read the Chapter 02 (paper, large print) handout. Divide this number by 798 to\nget your large-print WPM.\n3.\nUsing your laptop, download the first half of Chapter 03 at the below link and, using your favorite PDF\nreader, magnify it so that a maximum of 4-5 words fit on the screen at any one time (thus, to read this\nyou will need to pan left and right across each line). Now, time how long it takes you to read this and\ndivide by 855. http://goo.gl/vy0Fpi\n4.\nLastly, also using your laptop, download and install the Amazon Kindle application and, within it,\ndownload Pride and Prejudice. Again, set the font so that a maximum of 4-5 words span the screen.\nUsing the left and right arrows to page, find your place in Chapter 3 and then time yourself finishing the\nchapter. Divide this number by 852.\n\nDo you notice a difference between the physical and digital interfaces? Reading speeds were commonly\nobserved to be 10-15% slower on screens in older generations but the divide is apparently lessening with the\ncurrent generation.\n\nNotice also that there are, in general, two methods for applying magnification - those in which the user pans\nand zooms around an otherwise unmodified interface (3), and those in which the formatting is reflowed (3). Is\none method categorically better than the other or are there situations in which one would be better suited (with\nrespect to efficiency and learnability)?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n6.811 Principles and Practice of Assistive Technology\nFall 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Electronic Access Lab (Part 1) Station F: Augmentative & Alternative Communication (AAC)",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-811-principles-and-practice-of-assistive-technology-fall-2014/ac1a454e0de6b3511cd595465d4eec2a_MIT6_811F14_AAC.pdf",
      "content": "6.811 Principles and Practices of Assistive Technology\nElectronic Access Lab (Part 1)\n\nStation F: Augmentative & Alternative Communication (AAC)\n\nThis lab activity has three parts:\n●\nKinds of AAC, in which you will survey the design space for augmentative &\nalternative communication devices\n●\nObserving AAC Use, in which you will watch videos of people with speech\ndisabilities using AAC devices.\n●\nTrying AAC, in which you will conduct a conversation using AAC devices.\n\nFor Trying AAC, you will need a Mac laptop and an iPad with AAC software installed. The\nsoftware is expensive ($219.99), so we will provide iPads with the software already\ninstalled.\n\nKinds of AAC\nAlternative and augmentative communication devices are assistive technology for people\nwith speech impairments. Speech impairments can have many causes:\n●\nmotor impairments like cerebral palsy and ALS. Stephen Hawking is a wellknown\nuser of\nAAC; he is almost completely paralyzed by ALS\n●\ncognitive impairments like autism\n●\napraxia of speech, a specific neuromotor impairment of the speech system\n●\ndevelopmental disabilities, which may be motor or cognitive or both. A child who is\nslow to develop speech may need AAC.\n\nAs this list shows, speech disabilities may frequently be accompanied by other kinds of\nmotor or cognitive disabilities that can affect a person's ability to use or learn the assistive\ntechnology. Many AAC users are children. Keep these facts in mind while you consider the\nfollowing.\n\nThe spectrum of AAC devices is wide and diverse. For this part of the lab, you will consider\nseveral AAC devices and identify some of the dimensions of the design space for AAC. To\nillustrate what we mean by a dimension in a design space, here are some examples of\ndimensions for a different domain, smartphones: (a) operating system: iOS, Android,\nWindows. Determines which applications can be run on the device. (b) keyboard: touch\nscreen (Android, iOS, Windows) or buttons (Blackberry). Affects the speed of typing, the\npresence of tactile feedback, the ability to use the device without looking. (c) cell network:\nCDMA, GSM, LTE. Affects the speed and coverage of the network and which network\nproviders can offer service for the phone.\n\nThe smartphone design space above focuses entirely on the technical aspects of the\nhardware, but your design space should not. Yours should focus instead on the aspects of\nthe AAC design space that are most relevant to the user's abilities. That may involve\nmentioning some features of hardware, but keep the user foremost in your mind.\n\nSearch the web for the six devices listed below. Use them (and other devices you find, if\nyou wish) to identify at least three dimensions of the design space for AAC.\n\n●\nSpringboard Lite Unity 32\n●\nCheap Talk 8\n●\nJabbla Allora\n●\nDynavox Tango!\n●\nE Z Keys\n●\nPicture Exchange Communication System (PECS)\n\nAfter you've done this exercise, you may find the Periodic Table of AAC inspiring to look at\n(search the web for it).\n\nObserving AAC Use\nTo see what it's like for real people with disabilities to use AAC devices, watch the videos\nbelow. For your convenience, all videos are linked from this page: http://bit.ly/lab5-vids\n\nAutism/Dynavox III (2:17)\nhttp://www.youtube.com/watch?v=JUs50BkYz0U\nThis girl is transitioning from picture boards (PECS) to a dynamic device. What is she still\nstruggling with? What does the AAC make available in one press?\n\nAutism/Dynavox IV (1:17)\nhttp://www.youtube.com/watch?v=4h4DMx6XWHc\nHow is she doing now?\n\nBrandon T. discusses CSUN and his AAC device (7:10, but you can stop at 1:30)\nhttp://www.youtube.com/watch?v=P7Dz6IWrCfE\nThis boy constructs longer, more complex sentences. How is his device different from\nAbby's? Roughly how many presses does he use for each word?\n\nSchuyler's Monster: At the Purple Cow (5:58, but you can stop at 3:10)\nhttp://www.youtube.com/watch?v=N9toup9IDb4\nThis girl uses her AAC to order at a restaurant. What issues does she face? What's the\nadvantage of being able to create and store an utterance? (Schuyler has polymicrogyria, a\nneural abnormality that often leads to speech impairments. Her dad writes a wonderful blog\nabout her life, Fighting Monsters with Rubber Swords.)\n\nGiving Stephen Hawking a Voice - BBC World (2:40)\n\nhttp://www.bbc.co.uk/worldservice/programmes/2010/03/100312_blackburn_video.shtml\nTime point 1:33 shows a screenshot of the software he's using. When do you think it was\nwritten? Why is he still using it?\n\nTrying AAC\nFor this exercise, you'll use Proloquo for the Mac and Proloquo2Go for the iPad. If you\ndon't have a Mac laptop, work with somebody else in the class who does, or borrow one\nfrom an instructor.\n\n1. Find a partner to talk to.\n\n2. Install the software. Proloquo2Go is already running on the class iPad. Proloquo for the\nMac has a free trial download that you can install and run:\nhttp://www.assistiveware.com/product/proloquo/downloads. We recommend just using one\nof the class iPads.\n\nNotes about the install process:\n1. When you install the app, you don't need to install Infovox iVox voices as well. That\njust provides additional voices to choose from, and the bundled voices\nare\ngood enough for our purposes.\n2. When you first start the app, choose \"Use as communication tool.\"\n3. The first time you open Proloquo, you may be warned that \"Proloquo can't be\nopened because it is from an unidentified developer.\" Circumvent this warning by\nright-clicking Proloquo in the Finder and selecting Open, which will give you the\noption to really open the application.\n\n3. Hold some brief conversations (suggested wording below) and measure the time it\ntakes to do each one. The first time, speak aloud to each other as you normally would so\nthat you can time it. Then use the AAC for the dialog after, with one person using the laptop\nand the other person using the iPad. For the third dialog, switch roles.\n\nYou don't need to precisely duplicate these utterances. Just get the message across, but\nalso reflect on the compromises you made.\n\nSpeaking normally to each other:\n●\nWhere do you go for Thanksgiving?\n●\nI go home.\n●\nDo you like turkey?\n●\nI like stuffing!\n\nOne person uses Proloquo, the other uses Proloquo2Go:\n●\nDo you want dinner?\n\n●\nYes, I'm hungry.\n●\nHow about burritos?\n●\nOK! I need my coat.\n\nSwitch roles: one person uses Proloquo2Go, the other uses Proloquo:\n●\nDo you want the tablet?\n●\nYes, thank you.\n●\nI need the laptop, please.\n●\nI don't have one.\n\nReflection\n●\nDesign space: What were your design dimensions from the first part, and how did\neach device fit into the design space?\n●\nLearnability: What kind of effort is required to learn how to use these\ntechnologies effectively? Reflect in particular on the observations you made of the\nvideos.\n●\nEfficiency. Once learned, how does the speed of communication compare with\nnormal communication?\n●\nPerception. How do aspects of the system like voice, vocabulary, and grammar\naffect how other people perceive the user?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n6.811 Principles and Practice of Assistive Technology\nFall 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Disability Communication and Etiquette",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-811-principles-and-practice-of-assistive-technology-fall-2014/3e2459c189d2d4ca4371973a6d60d349_MIT6_811F14_Communicating.pdf",
      "content": "Disability Communication\nand Etiquette\n6.811: Principles and Practice of Assistive Technology, Fall 2014\nhttp://courses.csail.mit.edu/PPAT\n\nAgenda\n- Introductions and preamble\n- Disability communication/etiquette\no Opening questions\no Video: \"Ten Commandments\"\n- Discussion\n6.811: Principles and Practice of Assistive Technology, Fall 2014\n1: Principles and Practice of Assistive Technology, Fall 2014\nhttp://courses.csail.mit.edu/PPAT\n\nSafe Space for Discussion\n- Be respectful of others\no People have different experiences with disability and\nassistive technology\no Don't be afraid to ask questions or voice your\nthoughts!\n-Answers are not always clear-cut\n6.811: Principles and Practice of Assistive Technology, Fall 2014\n1: Principles and Practice of Assistive Technology, Fall 2014\nhttp://courses.csail.mit.edu/PPAT\n\n6.811: Principles and Practice of Assistive Technology, Fall 2014\n1: Principles and Practice of Assistive Technology, Fall 2014\nhttp://courses.csail.mit.edu/PPAT\n\nTrue or False?\n1. When meeting someone who is blind, always identify yourself\nverbally (e.g. \"Hey, it's me, Michelle.\")\n2. You should offer assistance to someone with a disability without\nbeing asked.\n3. If you are having difficulty understanding someone, it<s O= to nod\nand keep the conversation flowing.\n4. You should always use \"people-first\" language, e.g. \"person with a\ndisability\" or \"person with Down syndrome\", instead of \"disabled\nperson\", \"paralyzed person\", or \"blind person.\"\n5. You should not use terms like \"see you later\" or \"did you hear about\nthis?\" to someone who has a vision or hearing disability.\n6.811: Principles and Practice of Assistive Technology, Fall 2014\n1: Principles and Practice of Assistive Technology, Fall 2014\nhttp://courses.csail.mit.edu/PPAT\n\n6.811: Principles and Practice of Assistive Technology, Fall 2014\nhttp://courses.csail.mit.edu/PPAT\nMovie Time!\n1: Principles and Practice of Assistive Technology, Fall 2014\n\nVideo Discussion\n6.811: Principles and Practice of Assistive Technology, Fall 2014\n1: Principles and Practice of Assistive Technology, Fall 2014\nhttp://courses.csail.mit.edu/PPAT\n\nVideo Assistive Technologies\n6.811: Principles and Practice of Assistive Technology, Fall 2014\n1: Principles and Practice of Assistive Technology, Fall 2014\nhttp://courses.csail.mit.edu/PPAT\n\nCommon Practices\n6.811: Principles and Practice of Assistive Technology, Fall 2014\n1: Principles and Practice of Assistive Technology, Fall 2014\nhttp://courses.csail.mit.edu/PPAT\n\nPeople-First Language Exceptions?\n- National Federation for the Blind\n- Deaf culture (with a capital D)\n- Abled-bodied person\n-\n6.811: Principles and Practice of Assistive Technology, Fall 2014\n1: Principles and Practice of Assistive Technology, Fall 2014\nhttp://courses.csail.mit.edu/PPAT\n\nPractical Ta(ea)ays\n- How does your client want to be\nportrayed/described?\n- Terminology at partner organizations:\no \"resident\" instead of \"patient\"\n- If you make a mistake, apologize,\nimprove, and move on\n6.811: Principles and Practice of Assistive Technology, Fall 2014\n1: Principles and Practice of Assistive Technology, Fall 2014\nhttp://courses.csail.mit.edu/PPAT\n\n*ther Frame)or(s\n- Impairment, disability, and handicap\n- Cituational impairments\n- Differently abled/temporally abled\n6.811: Principles and Practice of Assistive Technology, Fall 2014\n1: Principles and Practice of Assistive Technology, Fall 2014\nhttp://courses.csail.mit.edu/PPAT\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n6.811 Principles and Practice of Assistive Technology\nFall 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Ethics of Human Subject  Research",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-811-principles-and-practice-of-assistive-technology-fall-2014/5c9b5bf95c79ed9eb73b97a4a88816e6_MIT6_811F14_Ethics.pdf",
      "content": "6.S196 / PPAT:\nPrinciples and Practice\nof Assistive Technology\nToday: Ethics of Human Subject\nResearch\n\nEthics of Human Subject Research\n- Human subjects have been seriously\nabused in the past\n- Nazi concentration camps\n- Tuskegee Institute study\n- MIT Fernald School study\n- Yale electric shock study\n- Stanford prison experiment\n\nNazi Concentration Camps (1940s)\n- Prisoners were used for horrific medical\nexperiments\n- extreme cold\n- extreme low pressure\n- typhus, tuberculosis,\nmalaria, hepatitis, ...\n- chemical weapons\n- Thousands of people were killed\n\nTuskegee Institute Syphilis Study\n(1930s-72)\n- US Government (Dept of Public Health) +\nTuskegee Institute researchers\n- recruited black males with syphilis, without\ntelling them, and studied the progress of the\nuntreated disease\n\nFernald School & MIT Study\n(1940s-50s)\n- MIT researchers studying calcium/iron\nabsorption from breakfast cereal\n- enrolled children at Fernald\nSchool for mentally-disabled\n- got parental permission, but\nomitted to mention the\nradioactive tracer isotopes\n\nYale Shock Study (1950s)\n- Yale psychologists studying power of\nauthority to overcome personal morals\n- participants told to give\nelectric shocks to another\nperson (a confederate\nsimulating real pain)\n\nStanford Prison Experiment (1971)\n- Stanford psychologists studying people's\nresponses to captivity\n- recruited Stanford undergrads to live in a\nmock prison, randomly assigned as either\n\"guards\" or \"prisoners\"\n- guards rapidly\nbecame abusive, and\nprisoners became\ntraumatized\n\nBasic Principles (Belmont Report)\n- Respect for persons\n- Beneficence\n- Justice\n\nRespect for Persons\n- Voluntary participation\n- Informed consent\n- not only say yes, but understand what saying yes\nmeans\n- studies that require initial deception must meet a\nhigher bar, and must eventually debrief\n- Protection of vulnerable populations\n- children\n- prisoners\n- people with disabilities (esp. cognitive)\n\nBeneficence\n- Do no harm\n- not just physical well-being, but also privacy\n- Must weigh the risks vs. benefits\n- risks to participants should be commensurate\nwith benefits of the work to the participants or\nto society as a whole\n\nJustice\n- Fair selection of participants\n- opportunity to be in clinical trials of new\ntreatments must be available to all\n(scientifically-appropriate) participants\n\nInstitutional Review Boards\n- Research with people is subject to scrutiny\n- All federally-funded institutions have an\ninstitutional review board (IRB) that approves\nhuman subjects research\n- MIT's IRB is called the Committee on Use of\nHumans as Experimental Subjects (COUHES)\n\nWhat is Research?\n- IRB oversight is confined to research\n- \"Research\" is work leading to generalizable\nknowledge\n- \"Practice\" (clinical medicine, product\ndevelopment, class projects) does not require\nIRB approval\n- But all work with human beings should follow\nthe IRB ethical guidelines, even if it doesn't\nneed to do IRB paperwork\n\nCase Study\n- Venkman, P. \"The Effect of Negative\nReinforcement on ESP Ability.\"\nUnpublished monograph, 1984.\n\nTreat the Client with Respect\n- Time\n- Don't waste it\n- Comfort\n- Accessible & convenient meeting location\n- Energy & fatigue\n- Informed consent\n- Inform the client fully\n- Privacy\n- Preserve the client's privacy\n- Control\n- The client can stop at any time\n\nSummary\n- Know about the history of human subjects\nabuse\n- Treat people with respect, beneficence,\njustice\n- Respect your client's time, comfort,\ninformed consent, privacy, and control\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n6.811 Principles and Practice of Assistive Technology\nFall 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Introduction",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-811-principles-and-practice-of-assistive-technology-fall-2014/11494623dc05af5f759a1c118487453a_MIT6_811F14_Introduction.pdf",
      "content": "Welcome to 6 811!\n6.811: Principles and Practice of Assistive Technology, Fall 2014\nhttp://courses.csail.mit.edu/PPAT\n\nAgenda\n- Motivation\n- Staff introduction\n- Course overview, syllabus, and logistics\n- Project example\nhttp://courses.csail.mit.edu/PPAT\n6.811: Principles and Practice of Assistive Technology, Fall 2014\n1: Principles and Practice of Assistive Technology, Fall 2014\n\nPre.Class Survey: Themes\n- Interest in technologies that help people with disabilities\n- Challenging design and engineering constraints\n- Personal experience with disability\n- Get out of the MIT bubble\nhttp://courses.csail.mit.edu/PPAT\n6.811: Principles and Practice of Assistive Technology, Fall 2014\n1: Principles and Practice of Assistive Technology, Fall 2014\n\nPractical Customized Assistive\nTechnology\n- Needs-driven, not\ntechnology-push\n- Effective, usable, robust,\naffordable\n6.811: Principles and Practice of Assistive Technology, Fall 2014\n1: Principles and Practice of Assistive Technology, Fall 2014\nhttp://courses.csail.mit.edu/PPAT\n\nPPAT Course Goals\n1. Understand principles and complexities of assistive\ntechnology design and engineering.\n2. Learn challenges and realities of people with disabilities\nand become equipped as an advocate.\n3. Gain experience managing a team-based\ndesign/engineering project and working with a real client.\nhttp://courses.csail.mit.edu/PPAT\n6.811: Principles and Practice of Assistive Technology, Fall 2014\n1: Principles and Practice of Assistive Technology, Fall 2014\n\nHow PPAT works\n- Lectures: MW1-2\n- Labs: MW3-5\n- Client meetings: Weekly\n- Mentoring during W3-5 lab\nClient & 3 students\nMentor\nClient & 3 students\n6.811: Principles and Practice of Assistive Technology, Fall 2014\nhttp://courses.csail.mit.edu/PPAT\n\n.\n\nHow PPAT works your proJect\nCheck out \"Project Progress\" column in syllabus' schedule\nSept 15: Client matching\nSept 22: Student-client matches announced\nLab check-ins every Wed lab, lots of prototyping/iterations\nOct 20 & 22: Mid-semester presentations\nNov 17: Deliver final prototype to client\nDec 1 & 3: Final presentations\nhttp://courses.csail.mit.edu/PPAT\n6.811: Principles and Practice of Assistive Technology, Fall 2014\n1: Principles and Practice of Assistive Technology, Fall 2014\n\nWho are our clients?\nFind out more!\n- Community members « 1h away by TE\n- Adventurous\n- Educators\n- Physical & cognitive disabilities\n- Welcome to lectures & labs\nhttp://courses.csail.mit.edu/PPAT\n6.811: Principles and Practice of Assistive Technology, Fall 2014\n1: Principles and Practice of Assistive Technology, Fall 2014\n\nGrading\nAssignment\nFour blog posts\n2-3 min video\nMid-semester presentations\nOnline open-source documentation & press release\nFinal-semester presentations\nAttendance, discussions, lab participation\nPeer feedback\n6.811: Principles and Practice of Assistive Technology, Fall 2014\nhttp://courses.csail.mit.edu/PPAT\n\nPPAT Class 8log\n- Goal: personalized reflection on disability\nand disability\n- Four blog posts, from list of suggested topics\no Attend a Boston-area event related to disability or\nAT\no Write more about your client\no Discuss a disability-related issue\n- Deadline: every two weeks\nhttp://courses.csail.mit.edu/PPAT\n6.811: Principles and Practice of Assistive Technology, Fall 2014\n1: Principles and Practice of Assistive Technology, Fall 2014\n\nLecture/Lab Expectations\n- Presence and active participation\no No screens when there are guest speakers\n- Full attendance at labs and lectures\nhttp://courses.csail.mit.edu/PPAT\n6.811: Principles and Practice of Assistive Technology, Fall 2014\n1: Principles and Practice of Assistive Technology, Fall 2014\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n6.811 Principles and Practice of Assistive Technology\nFall 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Project Matching and Logistics",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-811-principles-and-practice-of-assistive-technology-fall-2014/79b46ff00c7c2afe7c927dcd6eff07f4_MIT6_811F14_Project_Match.pdf",
      "content": "Project Matching\nand Logistics\n6.811: Principles and Practice of Assistive Technology, Fall 2014\nhttp://courses.csail.mit.edu/PPAT\n\nThis week\n- Today\no 1-2 PM: Project matching & logistics\no 3-5 PM: Project documentation lab\n- Wed:\no 1-2 PM: Ethics, Prof Rob Miller\no 3-5 PM: First lab check-in with mentors\n- TBD:\no First Client Meeting\n6.811: Principles and Practice of Assistive Technology, Fall 2014\n1: Principles and Practice of Assistive Technology, Fall 2014\nhttp://courses.csail.mit.edu/PPAT\n\nAssignments\n- Today, 3pm: Video assignment for lab\n- Next Session: Read Cook & Hussey's Chap 2,\nfollow-up from AT showcase\n- End of this week: 1st blog post\n6.811: Principles and Practice of Assistive Technology, Fall 2014\n1: Principles and Practice of Assistive Technology, Fall 2014\nhttp://courses.csail.mit.edu/PPAT\n\nBlogging\nhttp://assistivetech.mit.edu/blog\nLength: < 600 words\nUse headings, subheadings, bullet points\nBe creative:\n- text, photo-essays, audio/video/visualizations, code,\nStorify, listicles, maps...\n6.811: Principles and Practice of Assistive Technology, Fall 2014\n1: Principles and Practice of Assistive Technology, Fall 2014\nhttp://courses.csail.mit.edu/PPAT\n\nAgenda\n- Your first lab check-in and client meeting\n- Client matches\n- Purchasing & reimbursements\n- DCW Educator\n- Confidentiality\n- Releases\n6.811: Principles and Practice of Assistive Technology, Fall 2014\n1: Principles and Practice of Assistive Technology, Fall 2014\nhttp://courses.csail.mit.edu/PPAT\n\nFirst lab check-in and client meeting\n- Lab check-in 1:\no Format of each lab check-in will be covered on Wed\no Do preliminary research, generate questions for\ncontextual inquiry & define team roles\no Sign team contract\n- Client meeting 1:\no Must happen before Lab Check-in 2 (Wed, Sept. 24A\no Dccurs at client's choice of location\no Mentor will accompany team\no Sign client-team contract\n6.811: Principles and Practice of Assistive Technology, Fall 2014\n1: Principles and Practice of Assistive Technology, Fall 2014\nhttp://courses.csail.mit.edu/PPAT\n\nClient matches\nIn the next 2 min:\n- Find your teammates and sit with them\n- Michelle will email your client and mentor contact\ninformation to your team after lecture\n6.811: Principles and Practice of Assistive Technology, Fall 2014\n1: Principles and Practice of Assistive Technology, Fall 2014\nhttp://courses.csail.mit.edu/PPAT\n\nhnology, Fall 2014\nClient confidentiality\n- Classroom policies\no Client first-names only, in written assignme\no Ask your clients before you post something\n- Have a conversation with your client this week\no Explain first-names-only policy in class\no Explain why you need to take photo/videos\n-\nProject documentation, private\n-\nVideo assignment, potentially public\n-\nDCW documentation for public\no Ask clients what information they would ar\nand how it is to be shared\no Dffer clients the film/photo release, to be si\nYour priority is your client's comfort\nnts and presentations\npublic about them\n\ne comfortable with sharing,\ngned\n1: Principles and Practice of\n6.811: Principles and Practice of Assistive Tec\nAssistive Tec\nhttp://courses.csail.mit.edu/PPAT\nhnology, Fall 2014\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n6.811 Principles and Practice of Assistive Technology\nFall 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "User-Centered Design",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-811-principles-and-practice-of-assistive-technology-fall-2014/2e883e0736aaca8c5fb1bde6bc531400_MIT6_811F14_UserCentered.pdf",
      "content": "6.811 / PPAT:\nPrinciples and Practice\nof Assistive Technology\nToday: User-Centered Design\n\nToday's Topics\n- Design process\n- Iterative design\n- User-centered design\n- Information gathering\n- User analysis\n- Task analysis\n- Contextual inquiry\n- Defining success end-to-end\n\nIterative Design\n\nSpiral Model\n\nIterative Design of User Interfaces\n- Early iterations use cheap prototypes\n- Parallel design is feasible: build & test multiple\nprototypes to explore design alternatives\n- Later iterations use richer implementations,\nafter UI risk has been mitigated\n- More iterations generally means better UI\n- Only mature iterations are seen by the world\n\nEarly & Late Prototypes\n\nUser-Centered Design\n- Spiral design\n- repeated iterations of cheap prototypes\n- Early focus on users and tasks\n- user analysis: who the users are\n- task analysis: what they need to do\n- involving users as evaluators, consultants,\nand sometimes designers\n- Constant evaluation\n- users are involved in every iteration\n- every prototype is evaluated somehow\n\nUser Analysis: Know Your Client\n- Identify characteristics of target user\n- Age, gender, culture, language\n- Education (literacy? numeracy?)\n- Functional limitations\n- Technology experience (computers? typing?)\n- Motivation, attitude\n- Relevant environment and other social context\n- Relevant relationships and communication\npatterns\n\nSkills Evaluation: Sensory\n- Visual function\n- acuity, field, tracking, scanning\n- Visual perception\n- depth, spatial relationships\n- Tactile function\n- Auditory function\n\nSkills Evaluation: Motor\n- Range of motion\n- Muscle strength\n- Muscle tone\n- Balance\n- Tremor/involuntary movement\n- Functional grasp patterns\n\nSkills Evaluation: Cognitive\n- Memory\n- Problem-solving\n- Sequencing\n- Language\n\nTask Analysis\n-\nIdentify the individual tasks the assistive\ntechnology might address\n-\nEach task is a goal (what)\n-\nStart with a high-level activity\n-\nThen decompose it hierarchically into\nsubtasks (how)\n\nEssential Parts of Task Analysis\n- What needs to be done?\n- Goal\n- What must be done first to make it possible?\n- Preconditions\n- Tasks on which this task depends\n- Information that must be known to the user\n- What steps are involved in doing the task?\n- Subtasks\n- may be further decomposed, recursively\n\nOther Questions to Ask About a Task\n- Where is the task performed?\n- What is the environment like?\n- noisy, dirty, dangerous, crowded\n- How often is the task performed?\n- What are its time or resource constraints?\n- What can go wrong?\n- exceptions, errors, emergencies\n- Who else is involved in the task?\n- What assistive technology (if any) is the client\ncurrently using for the task?\n\nHints for Better Task Analysis\n- Questions to ask\n- Why do you do this? (goal)\n- How do you do it? (subtasks)\nLook for weaknesses in current situation\n- Goal failures\n- Wasted time\n- User irritation or fatigue\n-\n\nContextual Inquiry\n- Observe client doing the tasks in their real\nenvironment\n- Be concrete\n- Establish a master-apprentice relationship\n- Client shows how and talks about it\n- You watch and ask questions\n- Challenge your own assumptions\n- Share your assumptions openly with client\n- Probe surprises\n\nNeedfinding Exercise\n- Improve the experience of shopping at IKEA\n\nExercise 1: Collect Observations\n- Since we can't go there ourselves right now, we'll\ncollect information through a proxy: social media\n- Go to http://www.yelp.com/biz/ikea-stoughton-stoughton\n- Find interesting comments pertaining to user experience\n- Jump around so that we cover the space of ~300 reviews\n- Capture snippets of comments & notes in a text editor\n- Organize the comments according to recurring good and bad\nthemes\n- Work in a small group, then we'll discuss results as a\nclass\n\nExercise 2: Analyze User Classes\n\n- Based on your observations, perform a user\nanalysis on IKEA shoppers\n- What user classes do you find?\n- What characteristics do these classes have?\n- What are their roles and motivations?\n- Work in a small group, then we'll discuss\nresults as a class\n\nExercise 3: Identify User Needs/Goals\n- Identify high-level goals in the process of\nIKEA shopping\n- Do NOT yet identify solutions\n- What about the environment could make these\ntasks difficult to complete?\n- Work in your group, then we'll discuss as a\nclass\n\nExercise 4: Needfinding\n- What problems in the IKEA user experience\nmight we target?\n- Do NOT yet identify solutions\n- Let's discuss this as a class\n\nParticipatory Design\n- Include client directly in the design team\n\nSuccess Metrics\n- Choose evaluation metric(s) with client\n- efficiency: time on task\n- success rate\n- errors: frequency or severity\n- fatigue: how many times task can be done\n- Set quantitative and qualitative targets\n- \"get dressed in 2 minutes\"\n- \"make coffee without assistance\"\n- \"control my bed while hand is holding something else\"\n- Use the metrics and targets in subsequent process\n- evaluate on system models\n- predict outcome\n- measure on prototypes\n\nChallenges for UCD\nfor Assistive Technology\n- Cognitive impairments\n- May need to include others in information-\ngathering\n- Hidden impairments\n- May be hard to find people\n\nSummary\n- User-centered design manages project\nrisk and stays focused on user needs\n- User analysis assesses the client\n- Task analysis discovers their tasks\n- Success metric keeps you on track\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n6.811 Principles and Practice of Assistive Technology\nFall 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Wheelchair Lab Discussion",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-811-principles-and-practice-of-assistive-technology-fall-2014/558a02fdd95168aef6f78a8170e06b6d_MIT6_811F14_Wheelchair.pdf",
      "content": "Agenda\n- Objectives\n- Small Group Discussions\n- Class Discussion\n6.811: Principles and Practice of Assistive Technology, Fall 2014\nhttp://courses.csail.mit.edu/PPAT\n\nObjectives\n●Survey the state of wheelchair accessibility\non and around the MIT campus\n●Understand the challenges and realities\nassociated with using a wheeled mobility\ndevice\n6.811: Principles and Practice of Assistive Technology, Fall 2014\nhttp://courses.csail.mit.edu/PPAT\n\nDiscussion Topics\nA.Discuss any accessibility challenges that you\nencountered. Can you think of ways that either the\nwheelchair or the environment itself could have been\ndesigned to ameliorate each challenge?\nB.Discuss your experiences with other people - did you\nperceive yourself or others experiencing any discomfort\nwhen you were speaking with strangers or ordering food?\nIf you were able to take the tech shuttle, describe your\nexperience getting on and off.\nC.Discuss what you learned about the realities and\nchallenges of using a wheeled mobility device.\n6.811: Principles and Practice of Assistive Technology, Fall 2014\nhttp://courses.csail.mit.edu/PPAT\n\nFinal Thoughts\n● Would it have been OK for us to go around MIT's campus\nwhile simulating other disabilities?\n● Are there situations where it might be OK to \"gawk at\" or be\nimpressed by someone's assistive technology?\n● Pragmatically, without having the same abilities or\ndisabilities, to what extent can any of us truly understand the\nrealities of the people we work with in this course?\n6.811: Principles and Practice of Assistive Technology, Fall 2014\nhttp://courses.csail.mit.edu/PPAT\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n6.811 Principles and Practice of Assistive Technology\nFall 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}