{
  "course_name": "Principles of Microeconomics",
  "course_description": "14.01 Principles of Microeconomics is an introductory undergraduate course that teaches the fundamentals of microeconomics. This course introduces microeconomic concepts and analysis, supply and demand analysis, theories of the firm and individual behavior, competition and monopoly, and welfare economics. Students will also be introduced to the use of microeconomic applications to address problems in current economic policy throughout the semester.\nThis course is a core subject in MIT’s undergraduate Energy Studies Minor. This Institute-wide program complements the deep expertise obtained in any major with a broad understanding of the interlinked realms of science, technology, and social sciences as they relate to energy and associated environmental challenges.\nCourse Format\nThis course has been designed for independent study. It includes all of the materials you will need to understand the concepts covered in this subject. The materials in this course include:\n\nA complete set of Lecture Videos by Prof. Jon Gruber.\nReading Assignments in your choice of two textbooks – one of which is a free online edition - as preparation for the lectures.\nMultiple-choice Quizzes to assess your understanding of the key concepts in each session.\nProblem Sets with solution keys to test your ability to apply to concepts covered in lecture, and Problem Solving Videos to provide step-by-step instruction through several problem set solutions.\nA collection of links For Further Study to provide supplemental online content.\nA full set of Exams, including review material and practice exams to help you prepare.",
  "topics": [
    "Social Science",
    "Economics",
    "Microeconomics",
    "Social Science",
    "Economics",
    "Microeconomics"
  ],
  "syllabus_content": "«\nPrevious\n|\nNext\n»\n\nAbout this Course\n\n14.01 Principles of Microeconomics\nis an introductory undergraduate course that teaches the fundamentals of microeconomics. At MIT, this is the first course that undergraduates take in economics. For some, it may be the only course they take in the subject, and it provides a solid foundation for economic analysis and thinking that can last throughout their education and subsequent professional careers. For other students, it may provide a foundation for many years of study in economics, business, or related fields.\n\nThis course begins with an introduction to supply and demand and the basic forces that determine an equilibrium in a market economy. Next, it introduces a framework for learning about consumer behavior and analyzing consumer decisions. We then turn our attention to firms and their decisions about optimal production, and the impact of different market structures on firms' behavior. The final section of the course provides an introduction to some of the more advanced topics that can be analyzed using microeconomic theory. These include international trade, the impact of uncertainty on consumer behavior, the operation of capital markets, equity vs. efficiency trade-offs in economic policy and social insurance.\n\nBy the end of the course, you will be able to understand introductory microeconomic theory, solve basic microeconomic problems, and use these techniques to think about a number of policy questions relevant to the operation of the real economy.\n\nPrerequisites and Preparation\n\nThis course will include some basic uni-variate calculus material, as taught in the MIT course\n18.01 Single Variable Calculus\nor in a comparable high-school calculus course. There are no other prerequisites.\n\nVisit\n18.01SC Single Variable Calculus\nto learn or review this material.\n\nCourse Goals\n\nAfter completing this course, students should have developed a range of skills enabling them to understand economic concepts and use those concepts to analyze specific questions.\n\nBy the end of this course, students should be able to:\n\nUnderstand consumer behavior.\n\nUnderstand firm behavior.\n\nAnalyze different types of market structures (monopoly, oligopoly and a competitive market).\n\nUnderstand how to apply economic principles to a range of policy questions.\n\nStudents should also have the skills needed to:\n\nUse supply and demand diagrams to analyze the impact of overall changes in supply and demand on price and quantity.\n\nSolve a consumer's utility maximization problem mathematically and graphically; analyze the impact of changes in price and income on a consumer's decision via shifting income and substitution effects.\n\nUnderstand the consumer's labor supply decision.\n\nSolve a firm's cost minimization problem mathematically and graphically.\n\nAnalyze the behavior of firms in a perfectly competitive market in the short-run and the long-run.\n\nCalculate producer and consumer surplus.\n\nAnalyze the behavior of firms in a monopoly or oligopoly, and calculate the resulting changes in producer or consumer surplus.\n\nUnderstand consumer behavior under uncertainty.\n\nUse economic tools to analyze economic policies.\n\nCourse Components and Requirements\n\nAssigned readings\n\nRecitations\n\nLectures\n\nNine problem sets\n\nTwo midterm exams\n\nFinal Exam\n\nAssigned Readings\n\nReadings are assigned for each lecture, and should be completed prior to watching the lecture videos and completing subsequent activities.\n\nTEXTBOOK\n\nDESCRIPTION\n\n[Perloff] = Perloff, Jeffrey M.\nMicroeconomics\n. 5th ed. Addison Wesley, 2008. ISBN: 9780321558497.\n\nThis is the official textbook used by students enrolled in the class at MIT. Unfortunately due to copyright restrictions, OCW cannot provide online access to this book.\n\n[R&T] = Rittenberg, Libby, and Timothy Tregarthen.\nPrinciples of Microeconomics\n(PDF - 15.1MB)\n. 2009. (Courtesy of Libby Rittenberg, Timothy Tregarthen, and the Saylor Foundation.)\n\nThis Creative Commons-licensed text is a free online alternative to Perloff text used in the class at MIT.\n\nRecitations\n\nIn Recitations, students meet with a Teaching Assistant in a smaller group to go over problem set and exam solutions, review key concepts, and occasionally learn new material. A selection of recitation notes is included throughout this course and highlights some of the key teachings of 14.01.\n\nDeliverables and Grading\n\nThere will be nine mandatory problem sets which will be individually graded. At the end of the term students will have the best eight homework grades cumulated up and this will count for 22% of the final course grade.\n\nThere will be two midterm exams held throughout the term. These will each cover roughly one -third of the course material, will be 2 hours long, and will count as 22% (collectively 44%) of the grade.\n\nThere will also be a three hour final, which will be cumulative and cover all of the course materials. This will count as the remaining 34% of the grade.\n\nAcknowledgements\n\nThis course includes substantial contributions from several talented\n14.01SC Teaching Assistants\n.\n\n«\nPrevious\n|\nNext\n»",
  "files": [
    {
      "category": "Resource",
      "title": "MIT14_01SCF11_rev_midtm01.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-01sc-principles-of-microeconomics-fall-2011/20c1312e8e56a899ed91790b22f39938_MIT14_01SCF11_rev_midtm01.pdf",
      "content": "14.01: Midterm 1 review\nUnit 1: Supply and demand\n- Lecture 2: Supply and Demand\nI. Supply and demand diagrams: demand shows willingness of consumers to buy the good;\nsupply shows willingness of producers to sell; intersection is market equilibrium.\nII. Supply and demand curves can shift when there are shocks to the ability of producers to\nsupply; shocks in consumer tastes; shocks to the price of substitute goods.\nIII. Interventions in market can lead to disequilibrium: for example, imposing a minimum\nwage means that more people will want to work than employers want to hire at the\nminimum wage. This creates unemployment.\nIV. The cost of these interventions is found in reduced efficiency (trades that are not made);\nthere may be benefits in greater equity.\n- Lecture 3: Applying supply and demand\nI.\nPerfectly inelastic demand is characteristic of a good with no substitutes; perfectly elastic\ndemand is a good with perfect substitutes.\nδQ\nII.\nPrice elasticity of demand is defined = Q\nδP .\nP\nIII. Perfectly inelastic demand is = 0, perfectly elastic demand is = -inf.\nIV. The elasticity affects consumers' response to a shift in price: if the elasticity is between 0\nand -1, then firms can raise revenues by raising the price (since consumers will still buy\nthe good in significant quantities); if < -1, then raising the price results in a decline in\nfirm revenue.\nV. Accurately estimating an elasticity requires a shift along the supply curve (e.g., a tax on\nsuppliers).\nUnit 2: Consumer Theory\n- Lecture 4: Preferences\n\nand\n\nutility\nI. Introduction to preferences and utility\nII. We impose three assumptions about consumer preferences: preferences are complete, tran\nsitive and non-satiated.\nIII. These yield four assumptions about utility curves: consumers prefer higher indifference\ncurves, they are downward-sloping, they never cross and there is one indifference curve\nthrough every consumption bundle.\n\nIV. Utility function is a function that transfers bundles of goods into a scale of utils; however,\nit provides only an ordinal ranking, not a cardinal one.\nV.\nA general assumption employed is diminishing marginal utility: consumers receive less\nutility from each unit of a good they consume.\nVI.\nMRS = MUX is the ratio of marginal utilities; diminishing as you move along the indif\nMYY\nference curve.\n- Lecture 5: Budget constraints and constrained choice\nI.\nBudget constraint over two goods X and Y is defined Y = ppP + pmM.\nII. Slope of the budget constraint is defined as marginal rate of transformation: rate at which\nyou can transform one good into the other in the marketplace.\nIII. Shifts in price and income alter the position and slope of the budget constraint.\nIV. The optimal bundle that a consumer can choose is defined by the point of tangency\nbetween the indifference curve and the budget line: MRS = -MUx =\npx = MRT . This\nMUy\n-py\nis equivalent to equating the marginal cost and benefit of consuming each good.\nV. The above equation defines an interior solution (in which the consumer consumes some of\neach good); if indifference curves are flat, there can also be corner solutions in which the\nconsumer only consumes one good.\n- Lecture 6: Deriving demand curves\nI.\nWe can use the constrained optimization problem to derive the demand curve.\nΔQ\nII. This also allows us to define the income elasticity of demand: γ =\nQ\nΔ Y .\nY\nIII. For most goods, the income elasticity is positive (normal goods), but some goods may\nshow a consumption decline when income increases (inferior goods).\nIV. An increase in price, on the other hand, has two effects: it makes the consumer relatively\npoorer (income effect) and it also makes this specific good less attractive relative to al\nternatives (substitution effect). The substitution effect can be interpreted as the shift in\ngoods consumed from the original point to the optimal point for a budget constraint that\nhas the new slope, but is tangent to the old indifference curve.\nV. Substitution effect is always negative, but income effect can be positive.\nVI. Accordingly, the overall effect of a price increase on consumption of a good can be negative\n(for a normal good) or positive, if the good is inferior and the income effect is larger than\nthe substitution effect.\nVII. A good with a positive own-price elasticity is known as a Giffen good.\n\n- Lecture 7: Income / substitution effects and labor supply\nI. Income and substitution effects can be used to analyze labor supply: leisure (time not\nspent working) is a consumption good, and the price of that good is the wage, since that\nis the opportunity cost of time not spent working.\nII. When the wage rate increases, this also has both an income effect and a substitution\neffect.\n- Income effect: each worker is now richer, and may want to work less (consume more\nleisure).\n- Substitution effect: returns to working are higher, each worker may want to work\nmore.\n- If the income effect more than offsets the substitution effect, labor supply may go\ndown when income increases.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n14.01SC Principles of Microeconomics\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT14_01SCF11_rev_midtm02.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-01sc-principles-of-microeconomics-fall-2011/66a11c228027ef6cd3dbc53a30e64921_MIT14_01SCF11_rev_midtm02.pdf",
      "content": "14.01: Midterm 2 Review\nUnit 3: Producer Theory\nLecture 8: Production\n-\nI. Production Functions\nQ = f(L, K);\nII. Short Run Production\nthere is a xed factor of production, usually capital (plant size is xed in SR);\nIII. Long Run Production\nall factors are variable;\nLecture 9 - Production & Costs\n-\nI. Productivity\nII. Costs\nFixed cost = cost on xed factor;\nVariable cost = cost on variable factor;\nTotal cost = Fixed cost + Variable Cost;\nMarginal cost = additional cost of producing one more unit, MC = 4TC . If total\n4Q\ncost function is dierentiable, then MC = dT C .\ndQ\nAverage cost = cost per unit of output;\nIII. Long Run Cost Curves\nall factors variable, factor input demand is such that MRT S = w , tangency between\nr\nisoquant and isocost curve determines optimal mix of inputs and minimum cost of pro-\nduction;\nMarginal cost and Average cost dened in the same way;\nLRAC is the lower envelope of SRAC for dierent plant sizes, i.e. LR cost of production\nlower than SR cost of production.\nLRAC=SRAC implies SRMC=LRMC.\neconomies of scale and scope.\nLecture 10 - Competition\n-\nI. Perfect Competition\nrms and consumers are price takes;\nsymmetric information;\nno transaction costs;\n\nfree entry and exit in the long run;\nII. Short Run Prot Maximization\nrm maximizes prots by producing output where MR = MC;\ncompetitive rm faces a perfectly elastic demand curve, MR = P . Hence, for a perfectly\ncompetitive rm, P = MC;\nin short run rms use short run cost curves (SRMC, ATC, AVC) to make prot maxi-\nmization and shut down decisions;\nrm shuts down if P < min AV C;\nderive individual rm short run supply curve using P = MC and Q = 0 (shut down) for\nP < min AV C.\nSR market supply curve is horizontal sum of individual rm SR supply curves.\nindustry prots can be positive or negative in SR.\nLecture 11 - Competition II\n-\nI. Competition in the Long Run\nin LR free entry and exit drives economic prots to 0, i.e. P = MC = AC. Hence,\nLR industry supply curve is perfectly elastic at P = min AC and each rm produces at\nq = arg min AC;\nwith barriers to entry, problem is as in the SR only rms use their LR cost curves; LR\nindividual supply curve with barriers to entry is LRMC curve above minimum of AC and\n0 below.\nSR supply less elastic than LR supply with entry barriers, which is less elastic than LR\nsupply with free entry.\nIncreasing input prices can lead to an upward sloping LR supply curve even with free\nentry;\nUnit 4: Welfare Economics\nLecture 12 - Competition III\n-\nI. Do Firms Maximize Prots?\nagency problem when manager of rm does not own full stake in the rm;\nallign incentives by using stock options and other payment schemes - can lead to excessive\nrisk taking and short term behavior;\nLecture 13 - Welfare Economics\n-\nI. Consumer Surplus\ndemand curve represents marginal willingness to pay for good;\narea under demand curve and above the price is the value from consuming the good\nin monetary terms - consumer surplus;\n\nII. Producer Surplus\nsupply curve comes from marginal cost of production;\narea above supply curve and below price is net benet to producers - producer\nsurplus;\nIII. Competition Maximizes Welfare\ntotal welfare (CS+PS) maximized when demand=supply, i.e. at perferctly compet-\nitive output level;\nany other output level leads to a deadweight loss (gains from trade that are left\nunexploited);\ngovernment policies done for redistributive reasons or to raise tax revenues;\nIV. Government policies\nprice controls (price ceiling);\nprice support/minimum wage (price oor);\nimport taris/quotas;\nunit tax/subsidy;\nUnit 5: Monopoly and Oligopoly\nLecture 14 - Monopoly I\n-\nI. Monopoly Prot Maximization\ntotal revenue is TR = P (Q) Q;\n·\naverage revenue for a rm is given by demand curve, AR = P (Q);\nmarginal revenue is additional revenue from selling one more unit, MR = 4TR or if\n4Q\nrevenue function is dierentiable, MR = dT R .\ndQ\nperfectly competitive rm faces a perfectly elastic demand curve, P (Q) = P and\nhence, MR = P = AR.\nmonopoly faces downward sloping demand curve and hence MR = P (Q) + Q dP <\n· dQ\nP (Q) since dP < 0.\ndQ\nmonopolist has to decrease price on all units sold in order to sell one additional unit.\nNot the case with a perfectly competitive rm, which cannot inuence the price at\nwhich it sells.\nMR curve for monopolist is below AR curve (the demand curve).\nMR = P (Q) + Q · dP = P (Q)(1 +\nQ\ndP ) = P · (1 + 1 ). For |D| < 1, MR < 0\ndQ\nP (Q) dQ\nD\nand so a monopoly never produces at the inelastic part of the demand curve.\nProt maximization = ⇒ MR = MC. Hence, P · (1 +\nD ) = MC or P -\nP\nMC = -\nD :\nmark-up, measure of monopoly power.\nShut down decision is like that of a competitive rm.\nII. Welfare Eects of Monopoly\nBecause MR < AR, monopolist would supply less than the socially optimal (welfare\nmaximizing) level of output, which leads to a deadweight loss;\n\nLecture 15 - Monopoly II\n-\nI. Price Discrimination\nabove analysis is for a uniform pricing monopoly - the monopolist sets the same price\nfor every unit sold or for every consumer type.\nmonopolist can price discriminate - set dierent prices for dierent units, charge\ndierent uniform prices for dierent consumer groups, use two part taris, etc.\nperfect price discrimination/1st degree price discrimination - monopolist charges each\nconsumer their willingness to pay for the good, and hence extracts all the consumer\nsurplus. MR curve is now the AR curve, i.e. the demand curve. Set output where\nnew MR curve equals MC, i.e. where demand intersects MC.\nhence, a perfectly price discriminating monopolist produces the socially optimal\noutput level.\nII. How do Monopolies Arise?\ncost advantages - natural monopoly, for any output produce at lower AC than any\nother rm can (AC is declining);\nbarriers to entry - xed costs, patents;\nIII. Regulating Monopolies\nGovernment regulation of monopoly, through a price ceiling can improve welfare.\nSetting a price ceiling at the competitive price leads to zero DWL.\nEect of a unit tax on the price of good - price of good can increase by less than 1\nfor 1 with the tax or by more - dierence with perfectly competitive market.\nIV. Contestable Markets\nthreat of entry disciplines monopolist and they charge a price close to the perfectly\ncompetitive price.\nLecture 16 - Other Market Structures\n-\nI. Oligopoly\nsmall number of rms that interact strategically (not price takers but have to take\ninto account other rms' decisions when making their own decisions);\nduopoly - narket with two rms;\nII. Game Theory\nstudy of the outcome of strategic interactions;\nplayer's objective is to maximize payos given actions of others;\nnon-cooperative games - players cannot enforce mutually benecial strategies;\nstrategies - possible actions that players choose from to maximized payos;\ndominant strategy - strategy that maximizes a player's payo no matter what the\nother player does;\nNash equilibrium - each player is doing the best it can (maximized payo) given the\nactions of its opponents;\n\nIII. Cournot Model of Noncooperative Equilibrium\nCournot doupoly - two rms compete by setting output levels simultaneously. Each\nrm treats the output of its competitor as xed;\nReaction curve - relationship between rm's prot maximizing output and output it\nthinks its competitor will produce;\nCournot equilibrium - Nash equilibrium of Cournot duopoly game. Output levels for\nwhich reaction curves intersect.\nLecture 17: Oligopoly Continued (Chapter 12)\nI. Cournot Math\n- Cournot: All firms set quantities at the same time\n- Calculate residual demand for a given firm and solve its profit maximization problem to find its\nbest response function to other firms' output decisions.\n- Solution is a set of quantities (one for each firm) that solves this system of equations.\nII. Cooperative Equilibrium - Cartels\n- Firms can form a cartel and behave like a single monopolist, maximizing total industry profits.\n- Cartels are unusual because they are fundamentally unstable (incentive to \"cheat\" and raise own\nproduction) and because they are illegal (antitrust laws).\nIII. Comparing Equilibria\n- In terms of welfare, usually Perfect Competition > Oligopoly > Monopoly\n- Quantity as an indicator of social welfare\n- DWL in welfare analysis comes from trades that aren't made\nIV. Many Firms\n- In Cournot, as number of firms →inf, Cournot equilibrium approaches competitive equilibrium\n- As number of firms → 1, approaches monopoly\n- Markup over competitive price depends on number of firms and elasticity of demand:\np - MC\np\n= - nε\nV. Price Competition\n- Bertrand: firms set prices (instead of quantities) at the same time\n- Two firms may be enough to remove market power (i.e. restore competitive outcome) if products\nare identical\n- Recall proof from class that identical Bertrand duopolists drive price down to marginal cost\n- Also recall the Stackelberg model where one firm set their quantity before the other firm. In this\ncase, the best response function for the Stackelberg leader takes into account the fact that the\nfollower will respond to the leader's output decision.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n14.01SC Principles of Microeconomics\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT14_01SCF11_review_fin.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-01sc-principles-of-microeconomics-fall-2011/c4f2f635f68a6b6820602221a4eff0b7_MIT14_01SCF11_review_fin.pdf",
      "content": "14.01: Final Review\nDecember 3, 2010\nUnit 5: Market Power\nLecture 17: Oligopoly Continued (Chapter 12)\nI. Cournot Math\n- Cournot: All firms set quantities at the same time\n- Calculate residual demand for a given firm and solve its profit maximization problem to find its\nbest response function to other firms' output decisions.\n- Solution is a set of quantities (one for each firm) that solves this system of equations.\nII. Cooperative Equilibrium - Cartels\n- Firms can form a cartel and behave like a single monopolist, maximizing total industry profits.\n- Cartels are unusual because they are fundamentally unstable (incentive to \"cheat\" and raise own\nproduction) and because they are illegal (antitrust laws).\nIII. Comparing Equilibria\n- In terms of welfare, usually Perfect Competition > Oligopoly > Monopoly\n- Quantity as an indicator of social welfare\n- DWL in welfare analysis comes from trades that aren't made\nIV. Many Firms\n- In Cournot, as number of firms →inf, Cournot equilibrium approaches competitive equilibrium\n- As number of firms → 1, approaches monopoly\n- Markup over competitive price depends on number of firms and elasticity of demand:\np - MC\np\n= - n\nV. Price Competition\n- Bertrand: firms set prices (instead of quantities) at the same time\n- Two firms may be enough to remove market power (i.e. restore competitive outcome) if products\nare identical\n- Recall proof from class that identical Bertrand duopolists drive price down to marginal cost\n- Also recall the Stackelberg model where one firm set their quantity before the other firm. In this\ncase, the best response function for the Stackelberg leader takes into account the fact that the\nfollower will respond to the leader's output decision.\nUnit 6: Topics in Intermediate Microeconomics\nLecture 18: Factor Markets (Chapter 15)\nI. Competitive Factor Markets\n- In SR and in LR, demand for labor will be its marginal revenue product\nMRPL = MR MPL\n·\nwhere MR is marginal revenue from additional unit of output (MR = p if competitive output\nmarket). These will differ in LR and in SR because MPL in LR will take into account optimal\ncapital adjustments.\n\nLR labor demand more elastic than SR\n-\nII. Monopsony\n- Monopsony: single buyer in input market\n- Barriers to exit (from factor market) create monopsony\n- Competitive firms consider price of inputs, but monopsonist looks at marginal expenditure.\nME(q) = dT E(q) = d[p(q) · q]\ndq\ndq\n- Takes \"poisoning effect\" on inframarginal untis into account\n- Increase input usage if ME<MRP, decrease if ME>MRP.\n- Price comes from supply function\n- Monopsonists underhire at lower wages relative to perfect competition\nIII. Application: Minimum Wage\n- Higher minimum wages can restore competitive outcome in a monopsonistic market\nLecture 19: International Trade\nI. What is International Trade?\n- trade deficit = imports-exports\nII. Comparative Advantage and Gains from Trade\n- Differences in opportunity costs lead to comparative advantage in different goods\n- When countries have different comparative advantages in production of different goods, there are\npotential gains from trade through specialization\nIII. Welfare Implications from International Trade\n- In competitive model, opening to trade increases total welfare but usually at the expense of either\nconsumers or producers\n- Practice welfare comparisons using the usual graphs for imports and exports\nIV. Trade Policy\n- Effects of tariffs and quotas\nLecture 20: Uncertainty (Chapter 17, sections 1-3)\nI. Decision-Making Under Uncertainty\n- Expected utility: probability-weighted average of utility\nEU = Pr(Lose) U (Lose) + Pr(Win) U(Win)\n·\n·\n- Different than utility of expected value, since utility functions usually concave (diminishing MU\nof income)\nII. Extensions\n- Concave utility (decreasing MU income) → risk averse\n\n- Linear utility (constant MU income) → risk neutral\n- Convex utility (increasing MU income → risk loving\nIII. Applications\n- Insurance: risk averse people will pay money to turn a gamble into a certain payoff since they get\nhigher utility from certain income than from a gamble with the same expected value\n- Maximum amount they're willing to pay for this is their \"risk premium\"\n- Lottery behavior is a puzzle - maybe risk averse at low incomes and risk loving at high incomes\nLectures 21 and 22: Capital Supply and Capital Markets (Chap\nter 16)\nLecture 21 - Capital Markets\nI. Capital and Intertemporal Choice\n- Supply of capital from household decisions about how much to save - increasing in interest\nrate\n- Demand for capital comes from firms with potentially productive investments to make\n- Intertemporal choice graph over consumption in period one (C1 on x-axis) and in period 2\n(C2 on y-axis). Slope of the BC is -(1 + r)\n- When r changes, effect on savings depends on relative size of IE and SE\nII. Present Value\n- Need to translate all future dollars into today's terms\n- For a single payment of FV in year t:\nFV\nPV = (1 + r)t\n- Value of a perpetuity - constant payment of f every period forever:\nPV = f/r\n- Importance of compunding\nReal interest rate r is the one we care about - the nominal interest rate i minus inflation π\n-\nr = i - π\nLecture 22 - Capital Markets II\nI. Choices Over Time\n- Choose option with highest present value when choosing between projects or investments\nII. Investment Decisions\n- Net Present Value (NPV) = PV of revenues - PV of costs\n- Rule: Invest if NPV greater than zero\n- if revenues Rt in each period and costs Ct, NPV of investment is:\nNPV =\n(R0 - C0) + R1 - C1 + R2 - C2 + . . . + Rt - Ct\n(1 + i)1\n(1 + i)2\n(1 + i)t\n- NPV decreasing in interest rate for projects with up-front costs and future payoffs\nIII. Increasing Savings\n- Savings important for economic growth\n- Government encourages savings using tax subsidies to retirement savings\n\nSW F = f(U1, U2, . . .)\nUtilitarian SWF\n-\nSW F = U1 + U2 + . . .\nRawlsian SWF\n-\nSW F = min(U1, U2, . . .)\nIII. Inequality in the US and Around the World\n- See class handouts on inequality, poverty line, poverty rates over time\nIV. Sources of Leakage\n- Recall transfer program discussed in class - leads to decrease in labor supply especially among\nthose who qualify or are originally near the cutoff to receive the subsidy.\n- Distortionary taxation leads to DWL - this is the cost of redistribution\nLecture 24: Taxation and Redistribution\nI. Taxation in the U.S.\n1. Income tax (progressive, main tax in the U.S.)\n2. Payroll tax (flat)\n3. Consumption tax (regressive, paid on spending rather than earnings)\n4. Property tax (tax on wealth)\n5. Corporate tax (tax on businesses, small share of total tax revenue)\nII. What Should We Tax?\n- European countries raise most revenue through VAT on consumption\n- Consumption taxes encourage savings but not progressive\n- Excise taxes usually on \"sin goods\" (goods with negative externalities in consumption)\nIII. What is the Right Tax Rate?\nTax revenues = base t\n-\n·\n- As tax rate rises, base shrinks\nd(tax revenue)\nd(base)\n= base + t\ndt\n·\ndt\n- Laffer curve → tax revenue initially rising, then falling with tax rate (depends on elasticity of tax\nbase)\nIV. Low Income Programs in the U.S.\n- Importance of targeting assistance programs\n- Earned Income Tax Credit (EITC) is a wage subsidy program that balances targeting and effi\nciency\nUnit 7: Equity and Efficiency\nLecture 23: Equity and Efficiency (Chapter 10)\nI. Equity and Efficiency\nII. Choosing the Socially Optimal Allocation\n- Social welfare function (SWF) can be though of as a utility function for society taking individual\nutilities as inputs\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n14.01SC Principles of Microeconomics\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "MIT14_01SCF11_exam01_f07.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-01sc-principles-of-microeconomics-fall-2011/a899c18986c0667965a59915d7e587b1_MIT14_01SCF11_exam01_f07.pdf",
      "content": "Page 1 of 18\nMassachusetts Institute of Technology\nDepartment of Economics\n14.01 Principles of Microeconomics\nExam #1\nWednesday, October 10th, 2007\nLast Name (Please print): ______________\nFirst Name:\n__________________\nMIT ID Number:\n__________________\nInstructions. Please read carefully.\nThe exam has a total of 100 points. Answers should be as concise as possible.\nThis is a closed book exam. You are not allowed to use notes, equation sheets,\nbooks or any other aids. You are not allowed to use calculators. You must write\nyour answers in the space provided between questions. DO NOT attach\nadditional sheets of paper. This exam consists of (18) sheets (13 pages + 5 blank\npages for scratch work).\n0. Circle Your Section/Recitation (1 point):\nPlease circle the section or recitation which you are attending below. The marked\nexam will be returned to you in the section or recitation that you indicate. You\nwill loose 1 point if you leave it unselected.\nS01: MWF9\n(Peter Schnabl)\nR01: F10 (Rongzhu Ke)\nS02: MWF10\n(Chia-Hui Chen)\nR02: F11 (Rongzhu Ke)\nS03: MWF11\n(Chia-Hui Chen)\nR03: F2\n(Rongzhu Ke)\nS04: MWF1\n(Monica Martinez-Bravo)\nR04: F12 (Marco Migueis)\n\nR05:\n\nF1\n\n(Marco\n\nMigueis)\n\nR06:\n\nF2\n\n(Marco\n\nMigueis)\n\nDO NOT WRITE IN THE AREA BELOW:\nQuestion 1 __/20\n\nQuestion 2 __/10\nQuestion 3 __/15\n\nQuestion 4 __/25\nQuestion 5 __/29\n\nQuestion 0 __/1\nTotal __/100\nCite as: William Wheaton, Chia-Hui Chen, Rongzhu Ke, Monica Martinez-Bravo, Marco Migueis, Peter Schnabl,\nand Hongliang Zhang, course materials for 14.01 Principles of Microeconomics, Fall 2007. MIT OpenCourseWare\n(http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nPage 2 of 18\n1. True/False Questions (TOTAL: 20 points):\nIn this section, write whether each statement is True or False. Please fully explain your\nanswer, using a diagram if appropriate. No credit will be given for an answer without an\nexplanation.\n(a) (5 points) A risk averse individual that has to decide between two different lotteries\nwill always prefer a lottery with less risk.\n(b) (5 points) Steven only consumes two goods: X and Y. If X is a Giffen good for\nSteven, then Y must be a normal good for Steven.\nCite as: William Wheaton, Chia-Hui Chen, Rongzhu Ke, Monica Martinez-Bravo, Marco Migueis, Peter Schnabl,\nand Hongliang Zhang, course materials for 14.01 Principles of Microeconomics, Fall 2007. MIT OpenCourseWare\n(http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nPage 3 of 18\n(c) (5 points) Ann and Bob consume clothes (C) and food (F) only. Ann's utility function\nis U (C, F ) = a A ln C + bA ln F , and Bob's utility function is U (C, F) = aB ln C + bB ln F .\na A ,bA , aB ,bB > 0 . The price of clothes is PC , and the price of food is PF . Ann and Bob\nmust have the same marginal rates of substitution (MRS) of clothes for food at the\noptimal level of consumption.\n(d) (5 points) If S and F are perfect complements you must be indifferent between these\ntwo bundles:\ni. One unit of S and one unit of F\nii. Two units of S and one unit of F\nCite as: William Wheaton, Chia-Hui Chen, Rongzhu Ke, Monica Martinez-Bravo, Marco Migueis, Peter Schnabl,\nand Hongliang Zhang, course materials for 14.01 Principles of Microeconomics, Fall 2007. MIT OpenCourseWare\n(http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nPage 4 of 18\n2. Short Answer Questions (TOTAL: 10 points):\n(a) (4 points) Mary's demand curve for food is Q = 10 - 2P . Her price elasticity of\ndemand for food at price P* equals -\n. How much is P*?\nCite as: William Wheaton, Chia-Hui Chen, Rongzhu Ke, Monica Martinez-Bravo, Marco Migueis, Peter Schnabl,\nand Hongliang Zhang, course materials for 14.01 Principles of Microeconomics, Fall 2007. MIT OpenCourseWare\n(http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nPage 5 of 18\n(b) (6 points) Ann and Bob are a couple. They are the only people in the family. Bob's\ninverse demand curve for shirts is P = 5 - QB . Ann's inverse demand curve for shirts\nis P = 10 - 2QA . What is their family demand function for shirts? What is their family\nconsumption of shirts when the price is 4? What's their family consumption of shirts\nwhen the price is 6?\nCite as: William Wheaton, Chia-Hui Chen, Rongzhu Ke, Monica Martinez-Bravo, Marco Migueis, Peter Schnabl,\nand Hongliang Zhang, course materials for 14.01 Principles of Microeconomics, Fall 2007. MIT OpenCourseWare\n(http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nPage 6 of 18\nLong Questions:\n3. (15 points) Jane has utility function over her net income U (I ) = I\n(a) (2 points) What are Jane's preferences towards risk? Is she risk averse, risk neutral\nor risk loving? [Explain briefly your answer]\n(b) (6 points) Jane drives to work every day and she spends a lot of money in parking\nmeters. Many days the thought of cheating and not paying for parking crosses her\nmind. However she knows that there is a 1⁄4 probability of being caught in a given\nday if she cheats, and that the cost of the ticket is $36. Her daily income is $100.\nWhat is the maximum amount of she will be willing to pay for one day parking?\n[Hint: by paying that amount she avoids the risk of getting a ticket!].\nCite as: William Wheaton, Chia-Hui Chen, Rongzhu Ke, Monica Martinez-Bravo, Marco Migueis, Peter Schnabl,\nand Hongliang Zhang, course materials for 14.01 Principles of Microeconomics, Fall 2007. MIT OpenCourseWare\n(http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nPage 7 of 18\n(c) (2 points) Paul also faces the same dilemma every single day. But he has a utility\nfunction U(I)=I. His daily income is also $100. What are Paul's preferences\ntowards risk? Is he risk averse, risk neutral or risk loving?\n(d) (5 points) If the price of one day parking is 9.25, will Paul cheat or pay the\nparking meter? Will Jane cheat or pay the parking meter under this price?\nCite as: William Wheaton, Chia-Hui Chen, Rongzhu Ke, Monica Martinez-Bravo, Marco Migueis, Peter Schnabl,\nand Hongliang Zhang, course materials for 14.01 Principles of Microeconomics, Fall 2007. MIT OpenCourseWare\n(http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nPage 8 of 18\n4. (25 points) In Country Faraway, cigarettes are forbidden, so people trade cigarettes in a\nblack market. The cigarette demand is QD = 12 - P , and the cigarette supply is Qs = 2P .\n(a) (3 points) Find the equilibrium price and quantity in the black market.\n(b) (6 points) The government becomes aware of the black market and reinforces the\npolice so that half of the cigarette supply would be seized and destroyed. Under\nthis circumstance, what are the demand and supply functions? What is the new\nequilibrium price and quantity? Show the change by using a supply and demand\n\ndiagram.\nCite as: William Wheaton, Chia-Hui Chen, Rongzhu Ke, Monica Martinez-Bravo, Marco Migueis, Peter Schnabl,\nand Hongliang Zhang, course materials for 14.01 Principles of Microeconomics, Fall 2007. MIT OpenCourseWare\n(http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nPage 9 of 18\n(c) (4 points) How does the consumer surplus change between (a) and (b)?\n(d) (8 points) Suppose that the government changes the policy and legalizes cigarette\ntrade. Now cigarettes are traded in an open market. However, for every unit of\ncigarette purchased, the buyer has to pay tax T to the government. T is equal to\nthe pre-tax price P. What are the demand and supply functions under this\ncircumstance? What are the equilibrium (pre-tax) price and quantity? What is the\n\nafter-tax price paid by buyers?\nCite as: William Wheaton, Chia-Hui Chen, Rongzhu Ke, Monica Martinez-Bravo, Marco Migueis, Peter Schnabl,\nand Hongliang Zhang, course materials for 14.01 Principles of Microeconomics, Fall 2007. MIT OpenCourseWare\n(http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nPage 10 of 18\n(e) (4 points) Compare (b) and (d). Which policy do consumers prefer? Which policy\ndoes the government prefer? Why?\nCite as: William Wheaton, Chia-Hui Chen, Rongzhu Ke, Monica Martinez-Bravo, Marco Migueis, Peter Schnabl,\nand Hongliang Zhang, course materials for 14.01 Principles of Microeconomics, Fall 2007. MIT OpenCourseWare\n(http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nPage 11 of 18\n5. (29 points) Eric receives utility from days spent traveling on vacation domestically (D)\nand days spent traveling in a foreign country (F) as given by the utility U(D, F) = DF.\nThe price of a day spent traveling domestically is $160 and in a foreign country $200.\nEric's annual budget for traveling is $8,000.\n(a) (5 points) Find Eric's utility maximizing choice of days traveling domestically\nand in a foreign country. Find also his utility level from consuming that bundle.\n(b) (6 points) Suppose that the price of domestic traveling increases to $250 per day.\nCalling his budget for traveling x, (suppose by now that it is unknown) find the\ndemand for D and F under the new prices as a function of x.\nCite as: William Wheaton, Chia-Hui Chen, Rongzhu Ke, Monica Martinez-Bravo, Marco Migueis, Peter Schnabl,\nand Hongliang Zhang, course materials for 14.01 Principles of Microeconomics, Fall 2007. MIT OpenCourseWare\n(http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nPage 12 of 18\n(c) (4 points) Find the income necessary to make Eric reach the same utility level as\nbefore the price change.\n(d) (2 points) Compute the quantities demanded with the new prices and the income\nyou found in section c.\n(e) (2 points) Compute the quantities demanded with the new prices and the original\nincome.\nCite as: William Wheaton, Chia-Hui Chen, Rongzhu Ke, Monica Martinez-Bravo, Marco Migueis, Peter Schnabl,\nand Hongliang Zhang, course materials for 14.01 Principles of Microeconomics, Fall 2007. MIT OpenCourseWare\n(http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nPage 13 of 18\n(f) (6 points) Using your previous answers tell us what is the total change in quantity\nof D due to the price increase in PD that the consumer experiences and what part\nof that change is due to income or substitution effects. Give definitions of what\nincome and substitution effects mean.\n(g) (4 points) Draw a graph showing the income and substitution effects you found.\nCite as: William Wheaton, Chia-Hui Chen, Rongzhu Ke, Monica Martinez-Bravo, Marco Migueis, Peter Schnabl,\nand Hongliang Zhang, course materials for 14.01 Principles of Microeconomics, Fall 2007. MIT OpenCourseWare\n(http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nPage 14 of 18\nBLANK PAGE\nCite as: William Wheaton, Chia-Hui Chen, Rongzhu Ke, Monica Martinez-Bravo, Marco Migueis, Peter Schnabl,\nand Hongliang Zhang, course materials for 14.01 Principles of Microeconomics, Fall 2007. MIT OpenCourseWare\n(http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nPage 15 of 18\nBLANK PAGE\nCite as: William Wheaton, Chia-Hui Chen, Rongzhu Ke, Monica Martinez-Bravo, Marco Migueis, Peter Schnabl,\nand Hongliang Zhang, course materials for 14.01 Principles of Microeconomics, Fall 2007. MIT OpenCourseWare\n(http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nPage 16 of 18\nBLANK PAGE\nCite as: William Wheaton, Chia-Hui Chen, Rongzhu Ke, Monica Martinez-Bravo, Marco Migueis, Peter Schnabl,\nand Hongliang Zhang, course materials for 14.01 Principles of Microeconomics, Fall 2007. MIT OpenCourseWare\n(http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nPage 17 of 18\nBLANK PAGE\nCite as: William Wheaton, Chia-Hui Chen, Rongzhu Ke, Monica Martinez-Bravo, Marco Migueis, Peter Schnabl,\nand Hongliang Zhang, course materials for 14.01 Principles of Microeconomics, Fall 2007. MIT OpenCourseWare\n(http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nPage 18 of 18\nBLANK PAGE\nCite as: William Wheaton, Chia-Hui Chen, Rongzhu Ke, Monica Martinez-Bravo, Marco Migueis, Peter Schnabl,\nand Hongliang Zhang, course materials for 14.01 Principles of Microeconomics, Fall 2007. MIT OpenCourseWare\n(http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n14.01SC Principles of Microeconomics\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "MIT14_01SCF11_exam01.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-01sc-principles-of-microeconomics-fall-2011/0454bc30df1666fe266f0a3353c0c633_MIT14_01SCF11_exam01.pdf",
      "content": "Massachusetts Institute of Technology\nDepartment of Economics\n14.01 Principles of Microeconomics\nExam 1\nLast Name (Please print):\n______________\nFirst Name:\n______________\nInstructions. Please read carefully.\nThe exam has a total of 100 points. Answers should be as concise as possible. This is a closed\nbook exam. You are not allowed to use notes, equation sheets, books or any other aids. You\nare not allowed to use calculators. You must write your answers in the space provided between\nquestions. DO NOT attach additional sheets of paper. This exam has 18 pages (13 pages +\n5 blank pages for scratch work)\nDO NOT WRITE IN THE AREA BELOW:\nQuestion 1\n__/16\nQuestion 2\n__/10\nQuestion 3\n__/23\nQuestion 4\n__/25\nQuestion 5\n__/26\nTotal\n__/100\n\n1. True/False/Uncertain Questions (16 points)\nIn this section, write whether each statement is True, False or Uncertain. You should fully\nexplain your answer, including diagrams where appropriate. Points will be given based on\nyour explanation.\n(a) (4 points) A consumer nds two goods to be perfectly substitutable. Claim: The\noptimal bundle for this consumer will always be a corner solution.\n(b) (4 points) Innovations in the production of batteries lead to a rightward shift in the\nmarket supply for hybrid cars, while demand stays the same. Since this leads to a\ndecrease in the equilibrium price and an increase in the equilibrium quantity, demand\nis more inelastic at the new equilibrium.\n\n(c) (4 points) A consumer has selected an optimal bundle of two goods that includes some\nof each good. The price of one good increases. Claim: her utility is lower after the\nprice increase compared to before it.\n(d) (4 points) When market demand and supply shift in opposite directions, we can un-\nambiguously say how the equilibrium price and quantity change.\n\n2. Market demand for frozen yogurt (10 points)\nMarket surveys show that there are two types of consumers for frozen yogurt. The rst\ntype like frozen yogurt and have an inverse demand curve of P = 5 - 2\n1 Q. The second\ntype are crazy about frozen yogurt and have an inverse demand curve of P = 20 - Q. In\nthe town of Smallville there are only 2 consumers: one of them likes frozen yogurt and the\nother is crazy about frozen yogurt.\n(a) (5 points) Using the individual demand curves above, derive the market demand for\nfrozen yogurt in Smallville. Plot the market demand curves.\n(b) (5 points) Suppose that the market supply for frozen yogurt in Smallville is given by\nQS = 2 + P . Find the equilibrium price and quantity. How much does each consumer\nbuy at the equilibrium price? (Hint: Check the equilibrium price and quantity you\nget on a graph.)\n\n3. Consumer preferences and optimal allocations (23 points)\nMary is starting a jewelry collection. She wants to own matched sets of three bracelets\nand one necklace that can be worn together, and she doesn't want to own any bracelets or\nnecklaces that are not in a matched set of this size.\n(a) Draw Mary's indierence curves and write her utility function. Put bracelets on the\ny axis and necklaces on the x axis. Assume she receives utility of 3 utils from each\nmatched jewelry set she owns.\n(b) (5 points) Currently, Mary has 32 dollars to spend. The price of necklaces is pn = 2\nand the price of bracelets is pb = 2. What is the optimal allocation of necklaces and\nbracelets for Mary? How much utility does she achieve from this allocation?\n\n(c) (4 points) Due to a shortage of gold, the price of necklaces increases to pn = 10. What\nis the new allocation of necklaces and bracelets at this price level, and what utility\ndoes Mary obtain?\n(d) (4 points) Luckily, Mary's parents value their daughter's utility, and are willing to\ngive her enough income to ensure that she has the same utility she did prior to the\nprice change. How much extra money do they have to give her?\n\n(e) (5 points) Mary has a sister Lily who doesn't like wearing matched sets of jewelry\nand has dierent preferences. Her utility function is nb2. If she started with the same\njewelry budget as Mary of 32 dollars and then faced the same price shock, what would\nbe the decrease in her utility when the price of necklaces increases from $2 to $4?\n(f) (3 points) Mary and Lily's parents are going to give a gift of equal monetary value to\nboth sisters. They are trying to decide whether to give cash or give jewelry. Which\nsister is more likely to prefer cash? Please explain intuitively and/or graphically; there\nis no need for algebra in this section.\n\n4. Labor markets and labor supply shocks (25 points)\nConsider the labor market in the country of Widgetland. The demand for labor is given\nby:\nLD = 34 - 4w\nwhere w is the wage rate.\nLabor supply is:\nLS = L + 2w\nwhere L is the number of people in the country willing to work at a wage of zero.\n(a) (5 points) Suppose that L = 10. Find the equilibrium wage and equilibrium demand\nfor labor. Is demand for labor elastic or inelastic at the equilibrium wage?\nSuppose that there is a sudden inux of migrant labor, which increases the number of\npeople willing to work at a wage of zero to L = 16. For the remainder of the problem,\nset L = 16.\n(b) (5 points) Compute the new market equilibrium. What happens to the equilibrium\nwage rate?\n\n(c) (5 points) In reality an increase in population should aect the demand for labor as\nwell as the supply. Explain how the equilibrium wage and labor demanded will change\ncompared to the market equilibrium in part (a) if demand for labor were to increase\nas well.\n(d) (5 points) The government in Widgetland becomes worried about the upcoming elec-\ntion and decides to appease voters by imposing a minimum wage of w = 4. What\nhappens in the labor market as a result? What is the demand and supply for labor\nnow? Include a graph in your explanation.\n\n(e) (5 points) The government is unhappy with the results of the minimum wage law and\nrepeals it. Instead it introduces a subsidy of τ = 1 dollar on labor that is paid to\nworkers. What happens to the equilibrium wage and labor used as a result of this\nsubsidy? How much do workers get in equilibrium?\n5. Income and substitution eects (26 points)\nGlenn's utility function for goods X and Y is represented as U(X, Y ) = X0.2Y 0.8. Assume\nhis income is $100 and the prices of X and Y are $10 and $20, respectively.\n(a) (4 points) Express his marginal rate of substitution (MRS) of good Y for good X. As\nthe amount of X increases relative to the amount of Y along the same indierence\ncurve, does the absolute value of the MRS increase or decrease? Explain.\n(b) (4 points) Express his marginal rate of substitution (MRS) of good Y for good X. As\nthe amount of X increases relative to the amount of Y along the same indierence\ncurve, does the absolute value of the MRS increase or decrease? Explain.\n\n(c) (5 points) What is his optimal consumption bundle (X∗, Y ∗), given income and prices\nof the two goods?\n(d) (5 points) How will this bundle change when all prices double and income is held\nconstant? When all prices double AND income doubles?\n\n(e) (4 points) Derive the demand curve for good X and the demand curve for good Y as\na function of prices assuming income is $100.\nNow a government subsidy program lowers the price of Y from $20 per unit to $10\nper unit.\n(f) (4 points) Calculate the change in good Y consumption resulting from the program.\nIn a clearly labeled diagram with Y on the y-axis and X on the x-axis, graphically\nshow the change in consumption of good Y resulting from the program.\n\n(g) (4 points) In a clearly labeled diagram with Y on the y-axis and X on the x-axis,\ngraphically show the change in consumption attributable to the separate income and\nsubstitution eects for good Y only. Explain the intuition of the income and substi-\ntution eects. No calculations are required for this part.\n(h) How much does the program cost the government?\nEND OF EXAM\n\nBLANK PAGE\n\nBLANK PAGE\n\nBLANK PAGE\n\nBLANK PAGE\n\nBLANK PAGE\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n14.01SC Principles of Microeconomics\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "MIT14_01SCF11_exam02_f07.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-01sc-principles-of-microeconomics-fall-2011/1e7f3ad24377c2ce5b92c9017d63e2fc_MIT14_01SCF11_exam02_f07.pdf",
      "content": "Page 1 of 18\nMassachusetts Institute of Technology\nDepartment of Economics\n14.01 Principles of Microeconomics\nExam 2\nTuesday, November 6th, 2007\nLast Name (Please print): ______________\nFirst Name:\n__________________\nMIT ID Number:\n__________________\nInstructions. Please read carefully.\nThe exam has a total of 100 points. Answers should be as concise as possible.\nThis is a closed book exam. You are not allowed to use notes, equation sheets,\nbooks or any other aids. You are not allowed to use calculators. You must write\nyour answers in the space provided between questions. DO NOT attach\nadditional sheets of paper. This exam consists of (18) sheets (13 pages + 5 blank\npages for scratch work).\n0. Circle Your Section/Recitation (1 point):\nPlease circle the section or recitation which you are attending below. The marked\nexam will be returned to you, in the section or recitation that you indicate. You\nwill loose 1 point if you leave it unselected.\nS01: MWF9\n(Peter Schnabl)\nR01: F10 (Rongzhu Ke)\nS02: MWF10\n(Chia-Hui Chen)\nR02: F11 (Rongzhu Ke)\nS03: MWF11\n(Chia-Hui Chen)\nR03: F2\n(Rongzhu Ke)\nS04: MWF1\n(Monica Martinez-Bravo)\nR04: F12 (Marco Migueis)\n\nR05:\n\nF1\n\n(Marco\n\nMigueis)\n\nR06:\n\nF2\n\n(Marco\n\nMigueis)\n\nDO NOT WRITE IN THE AREA BELOW:\nQuestion 1 __/20\n\nQuestion 2 __/15\nQuestion 3 __/10\n\nQuestion 4 __/24\nQuestion 5 __/15\n\nQuestion 6 __/15\nQuestion 0 _/1\nTotal __/100\nCite as: William Wheaton, Chia-Hui Chen, Rongzhu Ke, Monica Martinez-Bravo, Marco Migueis, Peter Schnabl,\nand Hongliang Zhang, course materials for 14.01 Principles of Microeconomics, Fall 2007. MIT OpenCourseWare\n(http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nPage 2 of 18\n1. True/False Questions (TOTAL: 20 points):\nIn this section, write whether each statement is True or False. Please fully explain your\nanswer, using a diagram if appropriate. No credit will be given for an answer without an\nexplanation.\n(a) (5 points) As long as the marginal cost of production is greater than the average\nvariable cost, the average variable cost is increasing.\n(b) (5 points) In a perfectly competitive market with constant long run marginal cost, the\nconsumer will bear all the taxation burden.\nCite as: William Wheaton, Chia-Hui Chen, Rongzhu Ke, Monica Martinez-Bravo, Marco Migueis, Peter Schnabl,\nand Hongliang Zhang, course materials for 14.01 Principles of Microeconomics, Fall 2007. MIT OpenCourseWare\n(http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nPage 3 of 18\n(c) (5 points) In a perfectly competitive market, firms take the market price as a given,\nwhich implies that the market demand is infinitely elastic.\n(d) (5 points) In an exchange economy, no individual will ever prefer a point inside the\nutility possibilities frontier to a point on the utility possibilities frontier.\nCite as: William Wheaton, Chia-Hui Chen, Rongzhu Ke, Monica Martinez-Bravo, Marco Migueis, Peter Schnabl,\nand Hongliang Zhang, course materials for 14.01 Principles of Microeconomics, Fall 2007. MIT OpenCourseWare\n(http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nPage 4 of 18\nLong Questions:\n2. (15 points) Ricardo produces widgets, using as inputs labor (L) and machines (K). His\nproduction function is given by the following equation:\nq = 10K2/3 + L1/2\n(a) (4 points) What type of returns to scale (increasing/constant/decreasing) does\nRicardo's production function exhibit? Explain.\nAt the end of last year, Ricardo bought his only machine for $1,000. He will use this\nmachine for 5 years, after which the machine will have no value. Ricardo will calculate\ndepreciation linearly (depreciation will be 20% of the total value of the machine per\nyear). This machine has no other use besides Ricardo's production of widgets, and, at this\nmoment, Ricardo cannot buy any more machines.\n(b) (4 points) What is Ricardo's annual fixed cost of production? Is the fixed cost\nsunk or not? Explain.\nCite as: William Wheaton, Chia-Hui Chen, Rongzhu Ke, Monica Martinez-Bravo, Marco Migueis, Peter Schnabl,\nand Hongliang Zhang, course materials for 14.01 Principles of Microeconomics, Fall 2007. MIT OpenCourseWare\n(http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nPage 5 of 18\n(c) (4 points) What is Ricardo's demand for labor as a function of the quantity he\nwants to produce annually?\n(d) (3 points) Assuming that wage equals 1, what is Ricardo's annual total cost\nfunction?\nCite as: William Wheaton, Chia-Hui Chen, Rongzhu Ke, Monica Martinez-Bravo, Marco Migueis, Peter Schnabl,\nand Hongliang Zhang, course materials for 14.01 Principles of Microeconomics, Fall 2007. MIT OpenCourseWare\n(http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nPage 6 of 18\n3. (10 points) Sally's firm produces granola bars with a fixed cost of 10 (this cost is\nalready sunk). Her variable cost function is VC = q2 + 2q.\n(a) (4 points) Assuming the market for granola bars is competitive, derive Sally's\nsupply function?\n(b) (6 points) What is Sally's surplus if the market price is 6? What is her profit?\nDoes she want to stay in this market? Explain.\nCite as: William Wheaton, Chia-Hui Chen, Rongzhu Ke, Monica Martinez-Bravo, Marco Migueis, Peter Schnabl,\nand Hongliang Zhang, course materials for 14.01 Principles of Microeconomics, Fall 2007. MIT OpenCourseWare\n(http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nPage 7 of 18\n4. (24 points) Suppose the demand function for corn is Qd = 10 - 2 p , and supply\nfunction isQs = 3p - 5 . The government is concerned that the market equilibrium price of\ncorn is too low and would like to implement a price support policy to protect the farmers.\nBy implementing the price support policy, the government sets a support price and\npurchases the extra supply at the support price. In this case, the government sets the\nsupport price ps = 4.\n(a) (4 points) Calculate the original market equilibrium price and quantity in\nabsence of the price support policy.\n(b) (3 points) At the support price ps = 4 , find the quantity supplied by the farmers,\nthe quantity demanded by the market, and the quantity purchased by the\ngovernment.\nCite as: William Wheaton, Chia-Hui Chen, Rongzhu Ke, Monica Martinez-Bravo, Marco Migueis, Peter Schnabl,\nand Hongliang Zhang, course materials for 14.01 Principles of Microeconomics, Fall 2007. MIT OpenCourseWare\n(http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nPage 8 of 18\n(c) (3 points) Draw a diagram to show the change in the producer surplus due to the\nimplementation of the price support policy. Calculate the change in the producer\nsurplus.\n(d) (3 points) Draw a diagram to show the change in the consumer surplus due to\nthe implementation of the price support policy. Calculate the change in the\nconsumer surplus.\n(e) (3 points) Calculate the cost to the government to implement the price support\npolicy. Draw a diagram to show the government cost.\nCite as: William Wheaton, Chia-Hui Chen, Rongzhu Ke, Monica Martinez-Bravo, Marco Migueis, Peter Schnabl,\nand Hongliang Zhang, course materials for 14.01 Principles of Microeconomics, Fall 2007. MIT OpenCourseWar e\n(http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nPage 9 of 18\n(f) (8 points) Suppose now the government switches from price support policy to\nsubsidy policy. For each unit of corn produced, the government subsidizes the\nfarmer s = 5\n3 . Find the new equilibrium price under this subsidy policy. How\nmuch money will the government have to spend in order to implement this\nsubsidy policy?\nCite as: William Wheaton, Chia-Hui Chen, Rongzhu Ke, Monica Martinez-Bravo, Marco Migueis, Peter Schnabl,\nand Hongliang Zhang, course materials for 14.01 Principles of Microeconomics, Fall 2007. MIT OpenCourseWare\n(http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nPage 10 of 18\n5. (15 points) Molly's company produces knee warmers according to the following\nproduction function:\nq = (K-8)1/4L1/4\n(a) (4 points) Assuming that the unit cost of capital (r) and the unit wage (w) are both\nequal to 1, derive Molly's demand for inputs--capital and labor, respectively--as\na function of her choice of output (q).\n(b) (2 points) Show that Molly's long run total cost function is given by C(q) = 8 +\n2q2.\nCite as: William Wheaton, Chia-Hui Chen, Rongzhu Ke, Monica Martinez-Bravo, Marco Migueis, Peter Schnabl,\nand Hongliang Zhang, course materials for 14.01 Principles of Microeconomics, Fall 2007. MIT OpenCourseWare\n(http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nPage 11 of 18\nThe demand for knee warmers is given by P = 40 - Qd. There are no costs of entry or exit\nfor a firm on the market for knee warmers. Any firm in this market will have access to\nthe same technology as Molly.\n(c) (6 points) What will the price be in the long run in this market? How much will\neach firm produce in this market in the long run.\n(d) (3 points) How many firms will there be in this market in the long run?\nCite as: William Wheaton, Chia-Hui Chen, Rongzhu Ke, Monica Martinez-Bravo, Marco Migueis, Peter Schnabl,\nand Hongliang Zhang, course materials for 14.01 Principles of Microeconomics, Fall 2007. MIT OpenCourseWare\n(http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nPage 12 of 18\n6. (15 points) Consider a two-person economy consists of Ann and Bob. Both of them\nonly consume x and y. Ann's utility over these two goods is U A (xA , y A ) = xA y A\n2 and\nBob's utility is U B (xB , yB ) = xB\n2 yB . Initially, Ann is endowed with 9 units of x and zero\nunits of y ; Bob is endowed with 6 units of y and zero units of x .\n(a) (2 points) Write Ann's marginal rate of substitution in terms of xA and yA and\nBob's marginal rate of substitution in terms of xB and yB .\n(b) (5 points) Derive the equation for the contract curve.\nCite as: William Wheaton, Chia-Hui Chen, Rongzhu Ke, Monica Martinez-Bravo, Marco Migueis, Peter Schnabl,\nand Hongliang Zhang, course materials for 14.01 Principles of Microeconomics, Fall 2007. MIT OpenCourseWare\n(http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nPage 13 of 18\n(c) (8 points) Find the general equilibrium allocation of x and y among Ann and Bob\nof the above economy.\nCite as: William Wheaton, Chia-Hui Chen, Rongzhu Ke, Monica Martinez-Bravo, Marco Migueis, Peter Schnabl,\nand Hongliang Zhang, course materials for 14.01 Principles of Microeconomics, Fall 2007. MIT OpenCourseWare\n(http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nPage 14 of 18\nBLANK PAGE\nCite as: William Wheaton, Chia-Hui Chen, Rongzhu Ke, Monica Martinez-Bravo, Marco Migueis, Peter Schnabl,\nand Hongliang Zhang, course materials for 14.01 Principles of Microeconomics, Fall 2007. MIT OpenCourseWare\n(http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nPage 15 of 18\nBLANK PAGE\nCite as: William Wheaton, Chia-Hui Chen, Rongzhu Ke, Monica Martinez-Bravo, Marco Migueis, Peter Schnabl,\nand Hongliang Zhang, course materials for 14.01 Principles of Microeconomics, Fall 2007. MIT OpenCourseWare\n(http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nPage 16 of 18\nBLANK PAGE\nCite as: William Wheaton, Chia-Hui Chen, Rongzhu Ke, Monica Martinez-Bravo, Marco Migueis, Peter Schnabl,\nand Hongliang Zhang, course materials for 14.01 Principles of Microeconomics, Fall 2007. MIT OpenCourseWare\n(http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nPage 17 of 18\nBLANK PAGE\nCite as: William Wheaton, Chia-Hui Chen, Rongzhu Ke, Monica Martinez-Bravo, Marco Migueis, Peter Schnabl,\nand Hongliang Zhang, course materials for 14.01 Principles of Microeconomics, Fall 2007. MIT OpenCourseWare\n(http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nPage 18 of 18\nBLANK PAGE\nCite as: William Wheaton, Chia-Hui Chen, Rongzhu Ke, Monica Martinez-Bravo, Marco Migueis, Peter Schnabl,\nand Hongliang Zhang, course materials for 14.01 Principles of Microeconomics, Fall 2007. MIT OpenCourseWare\n(http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n14.01SC Principles of Microeconomics\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "MIT14_01SCF11_exam02.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-01sc-principles-of-microeconomics-fall-2011/848c8e311d4ddfc10f10c7819965338e_MIT14_01SCF11_exam02.pdf",
      "content": "Massachusetts Institute of Technology\nDepartment of Economics\n14.01 Principles of Microeconomics\nExam 2\nLast Name (Please print):\n______________\nFirst Name:\n______________\nInstructions. Please read carefully.\nThe exam has a total of 100 points. Answers should be as concise as possible. This is a\nclosed book exam. You are not allowed to use notes, equation sheets, books or any other aids.\nYou are not allowed to use calculators. You must write your answers in the space provided\nbetween questions. Fractional answers are permissible in any part of this exam. DO NOT\nattach additional sheets of paper. This exam has 18 pages (13 pages + 5 blank pages for\nscratch work)\nDO NOT WRITE IN THE AREA BELOW:\nQuestion 1\n__/16\nQuestion 2\n__/22\nQuestion 3\n__/27\nQuestion 4\n__/35\nTotal\n__/100\n\n1. True/False/Uncertain Questions (16 points)\nIn this section, write whether each statement is True, False or Uncertain. You should fully\nexplain your answer, including diagrams where appropriate. Points will be given based on\nyour explanation.\n(a) (4 points) Two rms are producing similar goods, but one enjoys economies of scale\nand one has diseconomies of scale. Claim: both rms can have an identical long-run\nlinear expansion path.\n(b) (4 points) A rm is currently earning negative prot on each good it produces. Claim:\nit is always optimal for this rm to shut down in the short run.\n\n(c) (4 points) The market for drug production is characterized by both lengthy periods of\npatent protection and the need for FDA permission to market products. Claim: this\nmarket will be characterized by production at the minimum level of average cost in\nthe long run.\n(d) (4 points) Cooperative behavior between two oligopolists is impossible if they know\nthat they will be competing for a limited number of years.\n\n2. Costs and prot maximization (22 points)\nA prot-maximizing, price-taking rm produces output Y using a single input X. The\nrm can produce 0, 8, 9, or 15 units of Y by using 0, 4, 7, or 9 units of X, respectively.\nThere are no other possible input-output combinations. The rm's production function is\ntherefore given by:\nY = f(X) =\n⎧\n⎪\n⎨\n⎪\n⎪\n⎩\nif X = 0\nif X = 4\nif X = 7\n16 if X = 12\nThe price of input X is 1 dollar per unit.\n(a) (4 points) Write the rm's total cost as a function of output.\n(b) (6 points) Find the rm's supply function y(p). Explain your answer.\n\n(c) (5 points) Suppose that there are 5 such price-taking rms in the market, and that\nthere is no entry. Market demand is given by QD = 100-10p. What is the equilibrium\nprice and quantity in this market?\n(d) (7 points) Suppose now that instead of the 5 rms in part (c) there is actually a\nsingle monopolist that is ve times as large as one of these individual rms. The\nmonopolist's production function is therefore:\nYM = 5 f(XM ) =\n·\n⎧\n⎪\n⎪\n\n⎨\n⎪\n⎪\n⎩\nif XM = 0\n40 if XM = 20\n45 if XM = 35\n80 if XM = 60\nDemand is given by QD = 100 - 10p as before. Assume now that entry is once again\nimpossible. What is the equilibrium price and quantity in this market? Compare this\noutcome with the equilibrium in (c) and explain why they are the same / dier.\n\n3. Monopoly and oligopoly (27 points)\nA uniform pricing monopolist has the following cost function and faces the following demand\ncurve for its product:\nC(Q) = 20Q\nP\n= 100 - Q\n(a) (3 points) Find the monopolist quantity (Qm), price (Pm), and deadweight loss rel-\native to the perfectly competitive outcome. Draw a diagram labeling the perfectly\ncompetitive outcome as A, and the monopolist outcome as B. Be sure to include the\nmarginal cost and marginal revenue curves in your diagram.\n\n(b) (6 points) There are two possible scenarios for the monopolist:\ni. The government set a price ceiling of $40/unit in which case the monopolist does\nnot invest in any R & D because it is wary of future government regulation.\nii. There is no government regulation, so then the monopolist invests in R & D which\nthen changes the cost function so that MC = 0.\nWhich scenario has higher welfare (ignore the cost of R & D for producer surplus)?\nWhich scenario do the consumers prefer? Explain.\n(c) (6 points) For plan (i), the MR curve features a discontinuity at some Q'. Explain\nintuitively why the MR curve has this discontinuity.\n\n(d) (6 points) In scenario (ii), when MC = 0, the monopolist chooses (Qm, Pm) such that\nD = 1. Will an unregulated uniform pricing monopolist ever choose (Qm, Pm) such\n|\n|\nD\nthat |\n| < 1? Explain intuitively.\n(e) (6 points) Go back to your solution in (a). Suppose now the government allows one\nother identical rm to enter this market and rms compete on quantity. Let x equal\nthe value of the MR at the monopolist output when there's only one rm. Claim: If\nthe two rms each produce half the monopoly quantity, then MR = x for both rms\nat current levels of output. Is this claim true, false, or uncertain? Please explain your\nreasoning.\n\n4. Trade in sweat-trapping headbands (35 points)\nThe U.S. demand for sweat-trapping headbands is summarized by the function qd = 1200-\np, where p is the market price of a headband. There are currently 49 identical, prot-\nmaximizing domestic headband producers in the U.S., each with the cost function TC(q) =\n72 + 0.5q2. U.S. consumers consider domestically produced headbands to be identical to\nforeign-produced headbands, and currently have access to a huge supply of foreign-made\nhandbands at a constant price of $10 per band (that is, we can think of the worldwide\nsupply of sweat-trapping headbands as a horizontal curve at p = 10).\n(a) (5 points) Write down an expression for the supply curve for an individual domestic\nheadband producer. If there is perfectly free international trade in sweat-trapping\nheadbands, what will be the market price of a headband in the U.S.? How many\nheadbands will be purchased in the U.S.? How many of those will be imported from\nabroad?\n\n(b) (5 points) What will be the prots of each domestic headband producer? What will be\nthe total prots earned by rms in the U.S. domestic headband industry? Assume, for\nnow, that the number of domestic producers remains xed at 49. Illustrate your answer\nwith two diagrams: one showing the prot-maximization decision of an individual\ndomestic rm, the other showing the entire U.S. headband industry.\n(c) (2 points) What do you predict would happen to the U.S. domestic headband industry\nin the long run?\n\n(d) (3 points) Suppose the U.S. government passes a dramatic new trade bill, the Sweat-\nTrapping Headbands Industry Protection Act of 2009, outlawing all imports of foreign-\nmade head-bands. If the number of domestic headband producers remains xed at\n49, what will be the new market price of a headband? How many headbands will be\npurchased in the U.S.?\n(e) (6 points) What will be the prots of each domestic producer after the new law is\npassed? What is the total increase in prots in the domestic headband industry as a\nresult of this new trade law? Depict graphically the change in consumer surplus for\nheadband buyers in the United States as a result of this policy as compared to your\nanswers in (a). Under which scenario will consumer surplus be larger?\n\n(f) (6 points) Assuming that the law described in (d) remains in force, but that there is\nfree entry and exit in the domestic headband industry over time, what do you predict\nwill be the long-run market equilibrium price? How many sweat-trapping headbands\nwill be sold in the U.S.? How many headband-producing rms will there be in the\nU.S. in the long run?\n(g) (8 points) Suppose that instead of the bill described in (d), the U.S. government de-\ncides to pass a less extreme law, assessing a t% tax on all imports of foreign headbands.\nHow large must t be (5%? 10%? etc.) in order to ensure that the 49 existing domestic\nproducers can remain in business in the long run?\nEND OF EXAM\n\nBLANK PAGE\n\nBLANK PAGE\n\nBLANK PAGE\n\nBLANK PAGE\n\nBLANK PAGE\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n14.01SC Principles of Microeconomics\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT14_01SCF11_final_f07.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-01sc-principles-of-microeconomics-fall-2011/39c21ac1c3eb1c3de18b206bab7f287c_MIT14_01SCF11_final_f07.pdf",
      "content": "Page 1 of 18\nMassachusetts Institute of Technology\nDepartment of Economics\n14.01 Principles of Microeconomics\nFinal Exam\nWednesday, December 19th, 2007\nLast Name (Please print): ______________\nFirst Name:\n__________________\nMIT ID Number:\n__________________\nInstructions. Please read carefully.\nThe exam has a total of 100 points. Answers should be as concise as possible.\nThis is a closed book exam. You are not allowed to use notes, equation sheets,\nbooks or any other aids. You are not allowed to use calculators. You must write\nyour answers in the space provided between questions. DO NOT attach\nadditional sheets of paper. This exam consists of (18) sheets (14 pages + 4 blank\npages for scratch work).\n0. Circle Your Section/Recitation (1 point):\nPlease circle the section or recitation which you are attending below. The marked\nexam will be returned to you, in the section or recitation that you indicate. You\nwill loose 1 point if you leave it unselected.\nS01: MWF9\n(Peter Schnabl)\nR01: F10 (Rongzhu Ke)\nS02: MWF10\n(Chia-Hui Chen)\nR02: F11 (Rongzhu Ke)\nS03: MWF11\n(Chia-Hui Chen)\nR03: F2\n(Rongzhu Ke)\nS04: MWF1\n(Monica Martinez-Bravo)\nR04: F12 (Marco Migueis)\n\nR05:\n\nF1\n\n(Marco\n\nMigueis)\n\nR06:\n\nF2\n\n(Marco\n\nMigueis)\n\nDO NOT WRITE IN THE AREA BELOW:\nQuestion 1 __/25\n\nQuestion 2 __/5\nQuestion 3 __/25\n\nQuestion 4 __/25\nQuestion 5 __/19\nQuestion 0 _/1\nTotal __/100\nCite as: William Wheaton, Chia-Hui Chen, Rongzhu Ke, Monica Martinez-Bravo, Marco Migueis, Peter Schnabl,\nand Hongliang Zhang, course materials for 14.01 Principles of Microeconomics, Fall 2007. MIT OpenCourseWare\n(http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nPage 2 of 18\n1. True/False Questions (TOTAL: 20 points):\nIn this section, write whether each statement is True or False. Please fully explain your\nanswer, using a diagram if appropriate. No credit will be given for an answer without an\nexplanation.\n(a) (5 points) After Professor Wheaton promises that no one would fail, students never\nstudy and turn in problem sets again. This is an example of adverse selection\nproblem.\n(b) (5 points) When a firm chooses among different projects, the one which has the\nhighest present value is always the one with the highest yield rate.\nCite as: William Wheaton, Chia-Hui Chen, Rongzhu Ke, Monica Martinez-Bravo, Marco Migueis, Peter Schnabl,\nand Hongliang Zhang, course materials for 14.01 Principles of Microeconomics, Fall 2007. MIT OpenCourseWare\n(http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nPage 3 of 18\n(c) (5 points) If the government guarantees a binding price floor for agricultural output\nby purchasing any surplus, then the demand for farm labor will be more elastic.\n(d) (5 points) Exploitation Mining Co. is the only employer in the remote town of\nUranium City and pays its workers $10.00/hour. If the government forces the\ncompany to raise its wage by a small amount--say to $10.10/hour--then it will hire\nmore workers.\nCite as: William Wheaton, Chia-Hui Chen, Rongzhu Ke, Monica Martinez-Bravo, Marco Migueis, Peter Schnabl,\nand Hongliang Zhang, course materials for 14.01 Principles of Microeconomics, Fall 2007. MIT OpenCourseWare\n(http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nPage 4 of 18\n(e) (5 points) A factory that pollutes a river has negative externalities on residents along\nthe river. If the factory and residents can negotiate, an efficient result can be achieved\nonly if the property right of the river is assigned to the residents.\nCite as: William Wheaton, Chia-Hui Chen, Rongzhu Ke, Monica Martinez-Bravo, Marco Migueis, Peter Schnabl,\nand Hongliang Zhang, course materials for 14.01 Principles of Microeconomics, Fall 2007. MIT OpenCourseWare\n(http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nPage 5 of 18\nShort Question:\n2. (5 points) A and B play rock, paper, scissors. Their payoffs are as follows (the first\nnumber is A's payoff and the second number is B's payoff):\nB\n\nA\nRock\nPaper\nScissors\nRock\n0,0\n-1,1\n1,-1\nPaper\n1,-1\n0,0\n-1,1\nScissors\n-1,1\n1,-1\n0,0\nHow many Nash equilibria are there in the game? Explain.\nCite as: William Wheaton, Chia-Hui Chen, Rongzhu Ke, Monica Martinez-Bravo, Marco Migueis, Peter Schnabl,\nand Hongliang Zhang, course materials for 14.01 Principles of Microeconomics, Fall 2007. MIT OpenCourseWare\n(http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nPage 6 of 18\nLong Questions:\n3. (25 points) Suppose that Intel has a monopoly in the market for computer chips. In\norder to produce X computer chips, it costs Intel C(X) = 2X2 .\n(a) (2 points) Find the marginal cost of producing a computer chip for Intel.\n(b) (6 points) The demand for computer chips is X D = 12 - 0.25P . Find the level of\noutput that maximizes Intel's profits. What price is Intel charging?\nCite as: William Wheaton, Chia-Hui Chen, Rongzhu Ke, Monica Martinez-Bravo, Marco Migueis, Peter Schnabl,\nand Hongliang Zhang, course materials for 14.01 Principles of Microeconomics, Fall 2007. MIT OpenCourseWare\n(http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nPage 7 of 18\n(c) (4 points) What level of output would maximize total surplus in the computer chip\nmarket?\n(d) (4 points) Suppose the government knew the demand and production functions.\nFind a price regulation the government could impose that would induce Intel to\nmaximize total surplus, i.e., produce the efficient quantity from part (c).\nCite as: William Wheaton, Chia-Hui Chen, Rongzhu Ke, Monica Martinez-Bravo, Marco Migueis, Peter Schnabl,\nand Hongliang Zhang, course materials for 14.01 Principles of Microeconomics, Fall 2007. MIT OpenCourseWare\n(http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nPage 8 of 18\n(e) (6 points) If the government subsidized Intel s for every unit of computer chips\nproduced, what quantity would Intel choose? Find the choice of subsidy that\nmaximizes total surplus, i.e., induces Intel to produce the efficient quantity from\npart (c).\n(f) (3 points) Both the price regulation policy from part (d) and the subsidy policy\nfrom part (e) maximize total surplus. Is there any reason someone might prefer\none policy over the other?\nCite as: William Wheaton, Chia-Hui Chen, Rongzhu Ke, Monica Martinez-Bravo, Marco Migueis, Peter Schnabl,\nand Hongliang Zhang, course materials for 14.01 Principles of Microeconomics, Fall 2007. MIT OpenCourseWare\n(http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nPage 9 of 18\n4. (25 points) Firm 1 and firm 2 are the only producers of spring water in the market.\nThe market demand for spring water is given by P = 70 - Q1 - Q2 . Firm 1 and firm 2\ncompete by choosing quantities Q1 andQ2 respectively. Each firm has a marginal cost\nof 10 and no fixed cost.\n(a) (5 points) Find out firm 1's and firm 2's reaction functions.\n(b) (5 points) Suppose the two firms choose quantities simultaneously. What are the\nequilibrium price, quantities, and profits of the two firms in this market?\nCite as: William Wheaton, Chia-Hui Chen, Rongzhu Ke, Monica Martinez-Bravo, Marco Migueis, Peter Schnabl,\nand Hongliang Zhang, course materials for 14.01 Principles of Microeconomics, Fall 2007. MIT OpenCourseWare\n(http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nPage 10 of 18\n(c) (5 points) Suppose only firm 1 has a chance to bribe the government and get the\nright to choose the quantity first, what is the maximum amount of money that firm\n1 is willing to pay? If firm 1 gets to move first, what are the equilibrium quantities\nand profits of firm 1 and firm 2? [Hint: if firm 1 does not bribe the government,\nthe two firms will choose quantities simultaneously as in (b).]\n(d) (5 points) Now back to the situation that the two firms choose quantities\nsimultaneously. Suppose the two firms decide to collude and share the profit\nequally. Assume that both firms value their reputation and will behave according\nto their agreement. What are the quantities they will choose for each firm? What\nis the profit of each firm?\nCite as: William Wheaton, Chia-Hui Chen, Rongzhu Ke, Monica Martinez-Bravo, Marco Migueis, Peter Schnabl,\nand Hongliang Zhang, course materials for 14.01 Principles of Microeconomics, Fall 2007. MIT OpenCourseWare\n(http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nPage 11 of 18\n(e) (5 points) Suppose the two firms decide to collude and share the profit equally,\nbut both firms do not care about their reputation and might try to take advantage\nof the other. Foreseeing this, they make a legally enforceable contract saying that\nif a firm does not produce the quantity agreed, it has to pay some penalty to the\nother firm. What is the minimum amount of penalty that ensures each firm\nproducing the right quantity agreed in part (d).\nCite as: William Wheaton, Chia-Hui Chen, Rongzhu Ke, Monica Martinez-Bravo, Marco Migueis, Peter Schnabl,\nand Hongliang Zhang, course materials for 14.01 Principles of Microeconomics, Fall 2007. MIT OpenCourseWare\n(http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nPage 12 of 18\n5. (19 points) The country of Economia has two industries. In the Clothing industry, the\nmarginal product of labor is always 1. In the Steel industry, the marginal product of\nlabor is12L-\nS\n1/ 2 - 2, where LS is the total number of workers employed in the Steel\nsector. The total supply of labor in Economia is fixed at LC + LS = 25 , and the output\nprice is 1 for both Clothing and Steel.\n(a) (7 points) Suppose that the labor market is competitive. How many workers will\nbe employed in the Clothing sector, and how many in the Steel sector? What\nwage rate will workers in each sector receive? [Hint: Workers can switch sectors\nat will. What does that imply about wages in the two sectors?]\nCite as: William Wheaton, Chia-Hui Chen, Rongzhu Ke, Monica Martinez-Bravo, Marco Migueis, Peter Schnabl,\nand Hongliang Zhang, course materials for 14.01 Principles of Microeconomics, Fall 2007. MIT OpenCourseWare\n(http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nPage 13 of 18\n(b) (8 points) Suppose that workers in the Steel sector form a union, which acts as a\nmonopolist in supplying labor to the Steel industry. The union chooses a level of\nemployment that maximizes the total wages of its members (i.e., it maximizes\nwSLS). How many workers will the union allow to be employed in the Steel\nsector? How many will now be employed in the Clothing sector? What wage rate\nwill workers in each sector receive? [You should assume that the prices of\nClothing and Steel remain 1.]\nCite as: William Wheaton, Chia-Hui Chen, Rongzhu Ke, Monica Martinez-Bravo, Marco Migueis, Peter Schnabl,\nand Hongliang Zhang, course materials for 14.01 Principles of Microeconomics, Fall 2007. MIT OpenCourseWare\n(http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nPage 14 of 18\n(c) (4 points) If workers in Clothing had unionized in order to increase their wage\nrate instead of workers in Steel, what would have happened to employment and\nwages in each sector? Explain why. [No calculations necessary; just describe the\noutcome qualitatively.]\nCite as: William Wheaton, Chia-Hui Chen, Rongzhu Ke, Monica Martinez-Bravo, Marco Migueis, Peter Schnabl,\nand Hongliang Zhang, course materials for 14.01 Principles of Microeconomics, Fall 2007. MIT OpenCourseWare\n(http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nPage 15 of 18\nBLANK PAGE\nCite as: William Wheaton, Chia-Hui Chen, Rongzhu Ke, Monica Martinez-Bravo, Marco Migueis, Peter Schnabl,\nand Hongliang Zhang, course materials for 14.01 Principles of Microeconomics, Fall 2007. MIT OpenCourseWare\n(http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nPage 16 of 18\nBLANK PAGE\nCite as: William Wheaton, Chia-Hui Chen, Rongzhu Ke, Monica Martinez-Bravo, Marco Migueis, Peter Schnabl,\nand Hongliang Zhang, course materials for 14.01 Principles of Microeconomics, Fall 2007. MIT OpenCourseWare\n(http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nPage 17 of 18\nBLANK PAGE\nCite as: William Wheaton, Chia-Hui Chen, Rongzhu Ke, Monica Martinez-Bravo, Marco Migueis, Peter Schnabl,\nand Hongliang Zhang, course materials for 14.01 Principles of Microeconomics, Fall 2007. MIT OpenCourseWare\n(http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nPage 18 of 18\nBLANK PAGE\nCite as: William Wheaton, Chia-Hui Chen, Rongzhu Ke, Monica Martinez-Bravo, Marco Migueis, Peter Schnabl,\nand Hongliang Zhang, course materials for 14.01 Principles of Microeconomics, Fall 2007. MIT OpenCourseWare\n(http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n14.01SC Principles of Microeconomics\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT14_01SCF11_final.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-01sc-principles-of-microeconomics-fall-2011/44154f5290ccede02ea16124f8905bea_MIT14_01SCF11_final.pdf",
      "content": "Massachusetts Institute of Technology\nDepartment of Economics\n14.01 Principles of Microeconomics\nFinal Exam\nLast Name (Please print):\n______________\nFirst Name:\n______________\nInstructions. Please read carefully.\nThe exam has a total of 173 points. Answers should be as concise as possible. This is a\nclosed book exam. You are not allowed to use notes, equation sheets, books or any other aids.\nYou are not allowed to use calculators. You must write your answers in the space provided\nbetween questions. Fractional answers are permissible in any part of this exam. DO NOT\nattach additional sheets of paper. This exam has 22 pages (17 pages + 5 blank pages for\nscratch work)\nDO NOT WRITE IN THE AREA BELOW:\nQuestion 1\n__/48\nQuestion 2\n__/20\nQuestion 3\n__/45\nQuestion 4\n__/40\nQuestion 5\n__/20\nTotal\n__/173\n\n1. True/False/Uncertain and Short Questions (48 points)\nIn this section, write whether each statement is true, false or uncertain or answer the\nquestion that is posed. You should fully explain your answer, including diagrams where\nappropriate. Points will be given based on your explanation.\n(a) (4 points) A uniform pricing monopolist has an upward sloping MC curve. Claim: a\nprice ceiling set below the monopoly price will increase welfare relative to the monopoly\noutcome (assume the monopolist does not shut down).\n(b) (4 points) A large box of paper towels which will last you 2 years is on deep discount\nat Wal-Mart, saving you $1 per roll. Claim: a rational consumer who has perfectly\ninelastic demand for paper towels should always purchase this large box instead of\npaying a higher price for individual paper towel rolls.\n\n(c) (4 points) In an oligopolistic market with identical rms, the market price is higher\nwhen there are two rms in the market than when there are 100 rms in the market.\n(d) (4 points) The government of a developing country is worried about the adverse eect\nthat the high interest rate in the economy has on investment. Claim: Since a low\ninterest rate makes more projects have positive NPV, investment in this economy will\nincrease if the government imposes an interest rate cap.\n\n(e) (8 points) There are three individuals in society: Bob, Milton and Paul. There are\nthree possible social states which result in dierent utility levels for the three individ-\nuals:\nBob\nMilton\nPaul\nA\nB\nC\nAre the following True/False/Uncertain? Explain.\n(i) No government would choose social state C.\n(ii) There is a government election in this society and there are two candidates: a\nRawlsian and an Utilitarian government candidates. Claim: In a democratic election\n(majority win election) a Utilitarian candidate will be elected since more individuals\nin this society prefer the Utilitarian candidate.\n(f) (8 points) Jon spends his entire budget on espresso and gasoline. You have the fol-\nlowing data on his choices:\nTable 1: Jon's budget\nPrice/\nPrice/\nGallons\nShots\nTotal\ngallon gasoline\nshot espresso\npurchased\npurchased\nincome\nFebruary\nMarch\n5/2\n3/4\nApril\n1/2\n\nAssume Jon's preferences are monotone, the same over the three months, and that he\nhas no way to save or borrow across periods. Are Jon's choices consistent with utility\nmaximization?\n(g) (4 points) Marco's monthly income is $1000. He spends 40% of his income on food and\nthe rest on buying designer clothes. The City Council thinks it is unfair that people\nspend more than 35% of their income for food. In order to lower the proportion of\nincome going to food, the City Council gives Marco $200. Claim: given that Marco's\nincome elasticity of food is 2, the City Council accomplishes its goal.\n\n(h) (4 points) Venus Williams likes both tennis rackets and tennis shoes. She has many\nof both. Her marginal rate of substitution (MRS) of rackets for shoes is 3, meaning\nthat given the opportunity, she is willing to trade 3 tennis rackets for 1 pair of shoes,\nor vice versa. Unused rackets and shoes may be returned to the local sporting goods\nstore for a refund. The current price for a racket is $200 and the price for a pair of\nshoes is $100. Claim: Venus can make herself better o by trading in some tennis\nrackets in return for some shoes at the market rate.\n(i) (4 points) Suppose that there are two types of drivers: speeders and slowpokes. Speed-\ners are more likely to have accidents, and have expected costs of $5,000 a year in car\nrepair bills. Slowpokes on the other hand have expected costs of only $100 a year. Sup-\npose further that speeders are risk-loving and that slowpokes are risk-averse. Claim:\na (risk-neutral) private car insurance company will insure only slowpokes even if there\nare no asymmetric information or moral hazard problems in this market.\n\n(\n(j) (4 points) Please outline the pros and cons of the U.S. adopting a tax system with a\nheavier reliance on a consumption tax.\n2. Uncertainty (20 points)\nAn economy has two agents, Bill and Bob. Bill has $110, and Bob has $200. Utility of\nagents in this economy is characterized by the following function of income:\nlog(y - 60) if y < 160\nU = u(y) =\n1 y\nif y ≥ 160\nThe minimum level of income possible in this economy is 60.\nEach agent is about to choose a new business venture, and has a choice between project A\nand project B. Neither project requires any investment up front. Project A yields revenues\nof 20 with probability 1 and revenues of -10 with probability 1 . Project B yields revenues\nof 4 with probability one-half and revenues of 5 with probability one-half. Throughout this\nproblem, assume that fractional income is possible.\n(a) (5 points) Which project would each agent choose? Provide intuition for your answer.\n\n(b) (5 points) If Bill and Bob each choose an investment project each year and receive\nthe associated income for 20 years, will the expected gap in their incomes be larger or\nsmaller at the end of this period than it was initially? How does this relate to attitudes\ntoward risk? You do not need to calculate income over 20 years, just provide intuition.\n\n(c) (10 points) Now, assume that there is a job available that provides xed wage income.\nWhat salary would the job have to provide in order to induce Bill to take the job\nrather than entering a new business venture? What salary would the job have to\nprovide in order to induce Bob to take the job? Which is higher, and why? Algebraic\nexpressions are acceptable as answers.\n3. Costs and oligopoly (45 points)\nA rm produces output q using capital and labor inputs according to the production func-\ntion:\nq = f(K, L) = 4K + 2L\nCapital and labor are both supplied in perfectly elastic input markets at prices of r = 4\nand w = 4.\n(a) (5 points) Draw a representative set of isoquants for this rm. On the same graph,\ndraw and label the rm's expansion path at these prices of capital and labor.\n\n(b) (5 points) Find the factor demands for capital and labor as functions of output.\n(c) (6 points) Derive an expression for the rm's total cost as a function of q.\n\n(d) (8 points) Suppose that in this market, our original rm competes with one other\nidentical rm, and that both rms set their quantities at the same time. Furthermore,\ninverse demand for q is given by p = 7 - q. Regardless of what you found in part\n(c), you should now assume that both rms produce at a constant marginal cost of\n1. Find the equilibrium price as well as the quantities and prots for each of these\nduopolists.\n(e) (6 points) What is the maximum amount that an outside investor would be willing to\npay to purchase one of these rms? Explain.\n\n(f) (8 points) What is the maximum amount that duopolist A would pay to acquire rm\nB before quantities are set? Explain intuitively why rm B is worth more to its\ncompetitor than to an outside investor.\n(g) (7 points) Suppose instead that the two rms were competing on price, a la Bertrand.\nHow much would an outside investor be willing to pay for rm B? How much would\nrm A have paid?\n\n4. Labor supply and income and substitution eects (40 points)\nThere are three periods, t = 0, 1, 2. In t = 1 Mary maximizes her utility over leisure and\nconsumption given the following function:\nU1(N1, C1) = N1\n\nC 1\nsubject to the following budget constraint:\nC1 + w1N1 = 24w1\nwhere w1 = 10. Note the price of the consumption good is assumed to be one in all periods.\nAfter she has made this decision, in t = 2 she maximizes this utility function:\nU2(N2, C2) = N2\n\nC 2\nsubject to the following budget constraint:\nC2 + w2N2 = 24w2\nwhere w2 = 20.\n(a) (6 points) For t = 1, 2 calculate Mary's choice of leisure and consumption in each\nperiod.\n(b) (6 points) For t = 1, provide economic intuition for the income and substitution eects\nof a wage increase on leisure. Can you say anything about the relative magnitudes of\nthese income and substitution eects?\n\n(c) (7 points) Go back to your solution in part (a). If the interest rate is 10% per period,\nwhat is the present value of her consumption in t = 0? Please use 0.9 and 0.8 as\napproximations for 1/(1.1) and 1/(1.1)2 respectively.\n(d) (7 points) Mary now has the option of obtaining additional job training in t = 0 at an\ninvestment cost of $200. As a result, her wage rate increases in t = 1 to w1 = 20 and in\nt = 2 to w2 = 30. Calculate the net present value of this investment on consumption.\nConsider only the value of consumption (and not the value of leisure).\n\n(e) (7 points) For more general utility functions, when will the net present value of the\ninvestment on consumption from part (d) likely be negative? Use income and substi-\ntution eects in your explanation.\n(f) (7 points) Does Mary have a Laer curve for income taxes (as opposed to consumption\ntaxes)?\n\n5. Trade and price discrimination (20 points)\nA U.S. pharmaceutical rm sells its patent-protected drug Levemir in the U.S. and E.U.\nmarkets. The domestic demand function is QUS = 120 - 2pUS , and the E.U. demand\nfunction is QEU = 60 - pEU , where all prices are measured in U.S. dollars and quantity is\nmeasured in vials. The rm's marginal cost is MC = 10 in both countries.\n(a) (6 points) Initially, the U.S. and E.U. governments prevent resale of Levemir. What are\nthe rm's optimal pUS and pEU ? (The same price has to be charged to all consumers\nin the U.S. market and all consumers in the E.U. market.) How many vials does it\nsell in the U.S. and E.U. markets?\n(b) (6 points) Now assume that the U.S. and E.U. governments permit resales and per unit\ntransportation and other transaction costs are negligible, so that the pharmaceutical\nmonopoly can no longer price discriminate. What price will the rm charge and how\nmany vials will it sell in the U.S. and in the E.U. markets?\n\n(c) (8 points) Use one graph for the U.S. market and one graph for the E.U. market to\nshow the welfare impacts of the policy change in (b). What happens to consumer\nand producer surplus in each nation? Overall, is this a social welfare improvement or\nreduction? Please provide intuition for the overall welfare impact.\nEND OF EXAM\n\nBLANK PAGE\n\nBLANK PAGE\n\nBLANK PAGE\n\nBLANK PAGE\n\nBLANK PAGE\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n14.01SC Principles of Microeconomics\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "MIT14_01SCF11_exam01_sol.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-01sc-principles-of-microeconomics-fall-2011/4bae52b4c897ac7b853b856b9a8d2a45_MIT14_01SCF11_exam01_sol.pdf",
      "content": "(\n14.01 Fall 2010: Midterm 1 Solution Set\n1. True/False/Uncertain Questions\nWrite whether each statement is True, False or Uncertain. You should fully explain your answer, including\ndiagrams where appropriate. Points will be given based on your explanation.\n(a) A consumer nds two goods to be perfectly substitutable. Claim: The optimal bundle for this\nconsumer will always be a corner solution.\nFalse. Consider for example the utility function u = x + y. The optimal bundle will be a corner\nsolution if the prices of the two goods are dierent; if the prices are the same, then any allocation\nis optimal.\n(b) Innovations in the production of batteries lead to a rightward shift in the market supply for hybrid\ncars, while demand stays the same. Since this leads to a decrease in the equilibrium price and an\nincrease in the equilibrium quantity, demand is more inelastic at the new equilibrium.\nUncertain. This is true in the case of linear demand, since elasticity of demand is increasing in\nprice along a linear demand curve. However, this is false in the case of a constant elasticity demand\ncurve.\n(c) A consumer has selected an optimal bundle of two goods that includes some of each good. The\nprice of one good increases. Claim: her utility is lower after the price increase compared to before\nit.\nTrue. If the consumer was indierent to one of the goods, she would have selected a bundle of only\nthe other good. Clearly, she obtains utility from both goods; thus when the price of either increases\nand her budget constraint shifts in, she will be on a lower indierence curve.\n(d) When market demand and supply shift in opposite directions, we can unambiguously say how the\nequilibrium price and quantity change.\nFalse. When demand and supply shift in the opposite direction we can unambiguously say how the\nequilibrium price changes (equilibrium price increases if supply shifts to the left and demand shifts\nto the right and vice versa). However, the eect on equilibrium quantity is ambiguous; it could\neither increase or decrease in both cases.\n2. Market demand for frozen yogurt\nMarket surveys show that there are two types of consumers for frozen yogurt. The rst type like frozen\nyogurt and have an inverse demand curve of P = 5 -\nand have an inverse demand curve of P = 20 - Q. In the town of Smallville there are only 2 consumers:\n2Q. The second type are crazy about frozen yogurt\none of them likes frozen yogurt and the other is crazy about frozen yogurt.\n(a) Using the individual demand curves above, derive the market demand for frozen yogurt in Smallville.\nPlot the market demand curves.\nThe demand of the rst group is\nQD\n10 - 2P\n, P ≤ 5\n=\n, P > 5\n\n(\n(\nand the demand of the second group is\nQD\nSumming the two demand curves, we get a market demand curve of\n= QD + QD\n= 20 - P\nQD\nM\n30 - 3P\n, P ≤ 5\n=\n20 - P\n, P > 5\nThe inverse market demand curve is then:\n20 - Q\nP =\n10 -\nQ ≤ 15\n3Q\nQ > 15\n(b) Suppose that the market supply for frozen yogurt in Smallville is given by QS = 2 + P . Find the\nequilibrium price and quantity. How much does each consumer buy at the equilibrium price? (Hint:\nCheck the equilibrium price and quantity you get on a graph)\nThe market demand curve is piecewise linear. However, since at p = 5 QS = 7 < 15 = QD it follows\nthat supply would intersect demand to the left of the kink. Hence, QS = QD or 2 + P = 20 - P and\nhence P ∗ = 9. This means that Q∗ = 11. Only the crazy consumer buys at the equilibrium price.\n3. Consumer preferences and optimal allocations\nMary is starting a jewelry collection. She wants to own matched sets of three bracelets and one necklace\nthat can be worn together, and she doesn't want to own any bracelets or necklaces that are not in a\nmatched set of this size.\n(a) Draw Mary's indierence curves and write her utility function. Put bracelets on the y axis and\nnecklaces on the x axis. Assume she receives utility of 3 utils from each matched jewelry set she\nowns.\nU(b, n) = 3 min(n, 1\n3 b) or U(b, n) = 3 min(3n, b)\nGr\nap\nh\ni\ncal representation for Exam 1, Problem 2.\nImage by MIT OpenCourseWare.\n\n(b) Currently, Mary has 32 dollars to spend. The price of necklaces is pn = 2 and the price of bracelets\nis pb = 2. What is the optimal allocation of necklaces and bracelets for Mary? How much utility\ndoes she achieve from this allocation?\nWe can nd the optimal allocation by nding the intersection of the lines b = 3n and 2n + 2b = 32.\nSubstituting in to the budget constraint, this yields the following.\n2n + 6n = 32\nn =\nWe have n = 4, b = 12, u = 12.\n(c) Due to a shortage of gold, the price of necklaces increases to pn = 10. What is the new allocation\nof necklaces and bracelets at this income level, and what utility does Mary obtain? What is the\nproportional decrease in her utility?\nRe-solve the problem with a new budget constraint. This yields\n10n + 6n = 32\nWe have n = 2, b = 6, u = 6.\n(d) Luckily, Mary's parents value their daughter's utility, and are willing to give her enough income to\nensure that she has the same utility she did prior to the price change. How much extra money do\nthey have to give her?\nMary's parents have to give her sucient income to buy two more matched sets at the new prices.\nThis requires the purchase of two necklaces and six bracelets, at a cost of 2 ∗ 10 + 6 ∗ 2 = 32. They\nhave to double her income, increasing it by $32, in order to maintain her at the same utility level.\n(e) Mary has a sister Lily who doesn't like wearing matched sets of jewelry and has dierent preferences.\nHer utility function is nb2. If she started with the same jewelry budget as Mary of 32 dollars and\nthen faced the same price shock, what would be the decrease in her utility when the price of\nnecklaces increases from $2 to $10?\nFirst, solve for Lily's original optimal allocation. We set the ratio of marginal utilities equal to the\nratio of prices.\nb2\n=\n2nb\nb =\n2n\nSubstituting into the budget constraint, this yields\n2(2n) + 2n = 32\nGraphi\ncal repre\nsentation for Exam 1, Problem 3.\nImage by MIT OpenCourseWare\n\nThis yields n = 16 , b = 32 , and u = 16 ( 32 )2 = 512\nWhen prices increase, we now re-solve the problem.\nb2\n=\n2nb\nb = 10n\nSubstituting into the budget constraint, this yields\n2(10n) + 10n = 32\nThis yields n = 16 , b = 160 , and u = 16 ( 160 )2 = 2560 . To calculate the decrease in utility, subtract\nthe second level of utility from the rst.\n= ( 16 ∗ 162 ∗ 4\n- 16 ∗ 162 ∗ 100\n27 ∗ 53\n)/( 16 ∗ 162 ∗ 4\n)\n=\n16 ∗ 162(4 ∗ 53 - 100)\n27 ∗ 53\n= 485.4\nLily experiences a 80% decline in her utility.\n(f) Mary and Lily's parents are going to give a gift of equal monetary value to both sisters. They are\ntrying to decide whether to give cash or give jewelry. Which sister is more likely to prefer cash?\nPlease explain intuitively and/or graphically; there is no need for algebra in this section.\nMary is more likely to prefer cash, because she only receives utility from a gift that is given as a\nmatched set and no utility from any other type of gift. You can portray this graphically by showing\na graph of the two utility functions and indicating that for Mary, any increase in the quantity of one\ngood or the other keeps her on the same indierence curve, while for Lily, any increase will move\nher to a new indierence curve. The below graph shows the result of a gift of necklaces only to both\ngirls. Mary is on the same utility curve, but Lily has increased utility. In this case and others like\nit, Mary is more likely to prefer cash.\n4. Labor markets and labor supply shocks\nConsider the labor market in the country of Widgetland. The demand for labor is given by:\nLD = 34 - 4w\nwhere w is the wage rate.\nGraphi\ncal repre\nsentation for Exam 1, Problem 3.\nImage by MIT OpenCourseWare.\n\nLabor supply is:\nLS = L + 2w\nwhere L is the number of people in the country willing to work at a wage of zero.\n(a) Suppose that L = 10. Find the equilibrium wage and equilibrium demand for labor. Is demand for\nlabor elastic or inelastic at the equilibrium wage?\nTo nd equilibrium wage we set LS = LD and hence 34 - 4w = 10 + 2w. Hence, w∗ = 4. L∗ = 18.\nThe elasticity of demand at the equilibrium wage is\ndLD w∗\nD = dw L∗ = -418 = - 18 = - 9\nHence, demand for labor is inelastic at w∗.\nSuppose that there is a sudden inux of migrant labor, which increases the number of people willing\nto work at a wage of zero to L = 16. For the remainder of the problem, set L = 16.\n(b) Compute the new market equilibrium. What happens to the equilibrium wage rate?\nIn the new equilibrium 34 - 4w = 16 + 2w. Hence, w∗ = 3. L∗ = 22. Hence the equilibrium wage\nrate decreases.\n(c) In reality an increase in population should aect the demand for labor as well as the supply. Explain\nhow the equilibrium wage and labor demanded will change compared to the market equilibrium in\npart (a) if demand for labor were to increase as well.\nA shift in demand in the same direction as the shift in supply increases the equilibrium demand for\nlabor unambiguously. However, the change in the wage rate is ambiguous as the wage rate could\neither increase or decrease.\n(d) The government in Widgetland becomes worried about the upcoming election and decides to appease\nvoters by imposing a minimum wage of w = 4. What happens in the labor market as a result?\nWhat is the demand and supply for labor now? Include a graph in your explanation.\nSince w > w∗ it follows that the minimum wage will be binding. At the minimum wage demand for\nlabor is LD = 18 whereas supply for labor is LS = 24. Hence, as a result of the minimum wage\nthere is unemployment of LS - LD = 6.\nG\nr\nap\nhi\nca\nl\nrepresentation for Exam 1, Problem 4.\nImage by MIT OpenCourseWare.\n\n(e) The government is unhappy with the results of the minimum wage law and repeals it. Instead it in-\ntroduces a subsidy of τ = 1 dollar on labor that is paid to workers. What happens to the equilibrium\nwage and labor used as a result of this subsidy? How much do workers get in equilibrium?\nA subsidy behaves like a negative tax. Hence, it eectively shifts supply down by τ. The new\nequilibrium wage is determined where labor supply with the subsidy equals labor demand, i.e. LS (p+\nτ) = LD or 16 + 2(w + τ ) = 34 - 4w. Hence, w∗ = 16 = 8 . Hence workers get paid w∗ + τ =\n8 + 1 = 11 .\n5. Income and substitution eects\nGlenn's utility function for goods X and Y is represented as U(X, Y ) = X0.2Y 0.8. Assume his income\nis $100 and the prices of X and Y are $10 and $20, respectively.\n(a) Express his marginal rate of substitution (MRS) between goods X and Y . As the amount of X\nincreases relative to the amount of Y along the same indierence curve, does the MRS increase or\ndecrease? Explain.\nMUX = 0.2(Y/X)0.8 and MUY = 0.8(X/Y )0.2\nMRSY\n= -MUX /MUY = -Y/4X\nfor X\nThe MRS (in absolute value) gets smaller as the amount of X increases relative to Y . In other\nwords, the more X (and less Y ) one has, the less of Y one is willing to give up in order to obtain\nan additional unit of X.\n(b) What is his optimal consumption bundle (X∗, Y ∗), given income and prices of the two goods?\nAt the optimal consumption bundle, the MRS is equal to the ratio of prices. That is, MRSY forX =\n-PX /PY . Plugging in our prices and the results from (a),\n-Y/4X = -10/20 =⇒-Y/4X = -1/2 =⇒ 2Y = 4X = ⇒ Y = 2X\nThe budget constraint must hold as well: I = PX X + PY Y =\n100 = 10X + 20Y\n⇒\nWe now have two equations and two unknowns. Solve for (X∗, Y ∗):\n100 = 10X + 20(2X) =\n100 = 50X =\nX∗ = 2\n⇒\n⇒\nY = 2X = 2(2) =\nY ∗ = 4\n⇒\n(c) How will this bundle change when all prices double and income is held constant? When all prices\ndouble AND income doubles?\nThe utility function does not change and therefore the formula for MRS does not change. Prices\nchange, but the ratio -PX /PY does not. Therefore, from MRSY\n= -PX /PY we still get\nfor X\nY = 2X. The budget constraint changes to 100 = 20X +40Y . Solving as before (with two equations,\ntwo unknowns), we get (X∗, Y ∗) = (1, 2). If all prices and income change proportionally, the optimal\nbundle does not change.\n(d) Derive the demand curve for good X and demand curve for good Y .\nSolve for X∗ and Y ∗ as before, except this time do not plug in explicit values for PX , PY and I.\nMRSY for X = -PX /PY =⇒-Y/4X = -PX /PY = ⇒ PY Y = 4PX X\nBudget constraint: I = PX X + PY Y\nNow let's solve for X∗ by substituting out Y .\nI = PX X + 4PX X = 5PX X =\nX∗(PX ; I) = I/(5PX )\n⇒\nHolding income constant at $100 gives us a demand curve of X∗(PX ; I = 100) = 20/PX\n\nWe can solve for Y ∗ by substituting out X:\nPY Y = 4PX X =\nY = (4PX X)/PY =\nY = (4PX [I/(5PX )])/P Y\n⇒\n⇒\nY ∗(PY ; I) = 4I/(5PY )\nHolding income constant at $100 gives us a demand curve of Y ∗(PY ; I = 100) = 80/PY\nNow a government subsidy program lowers the price of Y from $20 per unit to $10 per unit.\n(e) Calculate and graphically show the change in good Y consumption resulting from the program.\nTo calculate the new bundle we could go through the same procedure as is part (b) or simply use the\ndemand equations derived in part (d). X∗ does not depend on PY so X∗0 = 2.\nY ∗ is a function of its own price and, using demand from (d), Y ∗0 = 80/PY = 80/10 = 8. This\nchange is depicted in the gure below.\n(f) In a clearly labeled diagram with Y on the y-axis and X on the x-axis, graphically show the change\nin consumption attributable to the separate income and substitution eects. No calculations were\nrequired for this part.\nRefer to the gure below for the separate income and substitution eects. Note that the substitution\neect for good Y may be found by sketching a BCsub with the new price ratio (parallel to BC1)\nbut tangent to the original indierence curve IC0. The corresponding point tells us what a person\nfacing the new price ratio would purchase if utility were somehow held constant at its original level.\nThe income eect brings us from this substitution point to Y ∗0 .\n(g) How much does the program cost the government?\nFor each unit of Y purchased, the government pays out $10. Since 8 units of Y are currently\npurchased, the cost will be 8($10) = $80.\nG\nr\nap\nh\nic\na\nl\nrepresentat\nion\nfo\nr E\nxam\n1,\nPr\noblem 5.\nImage by MIT OpenCourseWare.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n14.01SC Principles of Microeconomics\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "MIT14_01SCF11_exam02_soln.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-01sc-principles-of-microeconomics-fall-2011/81a3f61fc64b47ebc0fbe50c0c0b5fcb_MIT14_01SCF11_exam02_soln.pdf",
      "content": "14.01 Fall 2010: Midterm 2 Solution Set\n1. True/False/Uncertain Questions (16 points)\nIn this section, write whether each statement is True, False or Uncertain. You should fully\nexplain your answer, including diagrams where appropriate. Points will be given based on\nyour explanation.\n(a) (4 points) Two rms are producing similar goods, but one enjoys economies of scale\nand one has diseconomies of scale. Claim: both rms can have an identical long-run\nlinear expansion path.\nTrue. A linear expansion path simply indicates that the optimal mix of labor and\ncapital does not change, but there can be either economies or diseconomies of scale\ndepending on the production function. These rms could have the same expansion\npath, but output using the same quantity of inputs will not be the same.\n(b) (4 points) A rm is currently earning negative prot on each good it produces. Claim:\nit is always optimal for this rm to shut down in the short run.\nFalse. A rm will not shut down in the short run as long as its revenue is greater than\naverage variable cost. If revenue is less than average variable cost (i.e., the absolute\nvalue of negative prots is larger than the xed costs), the rm will shut down. In the\nlong run, of course, rm exit will occur and prots will go to zero.\n(c) (4 points) The market for drug production is characterized by both lengthy periods of\npatent protection and the need for FDA permission to market products. Claim: this\nmarket will be characterized by production at the minimum level of average cost in\nthe long run.\nUncertain. Both patent protection and government regulation constitute market bar-\nriers in this case. In a market with barriers to entry, the long-run supply curve will\nnot necessarily be horizontal and average cost will not necessarily be minimized. To\nguarantee a horizontal supply curve, there must be be no barriers to entry, all rms\nmust be identical, and there can be no variation in input costs.\n(d) (4 points) Cooperative behavior between two oligopolists is impossible if they know\nthat they will be competing for a limited number of years.\nTrue. A cooperative equilibrium can be sustained only if the competition game will\ncontinue forever. If they know the period of competition is nite, both will cheat.\n2. Costs and prot maximization (22 points)\nA prot-maximizing, price-taking rm produces output Y using a single input X. The\nrm can produce 0, 8, 9, or 15 units of Y by using 0, 4, 7, or 9 units of X, respectively.\n\nThere are no other possible input-output combinations. The rm's production function is\ntherefore given by:\nY = f(X) =\n⎧\n⎪\n⎪\n⎪\n⎪\n⎨\n⎪\n⎪\n⎪\n⎪\n⎩\nif X = 0\nif X = 4\nif X = 7\n16 if X = 12\nThe price of input X is 1 dollar per unit.\n(a) (4 points) Write the rm's total cost as a function of output.\nC(Y ) =\n⎧\n⎪\n⎪\n⎪\n⎪\n⎨\n⎪\n⎪\n⎪\n⎪\n⎩\nif Y = 0\nif Y = 8\nif Y = 9\n12 if Y = 16\n(b) (6 points) Find the rm's supply function y(p). Explain your answer.\ny(p) =\n⎧\n⎪\n⎨\n⎪\n⎩\nif p < 1/2\nif 1/2 ≤ p < 1\n16 if p ≥ 1\nIf output increases from 0 to 8, costs per unit increase by $0.50/unit. Therefore the\nrm will supply 0 units if p < 1\n2 .\nIf the rm increases output from 8 to 9, the cost to produce the additional unit is $3.\nHowever, if the rm increases output from 8 to 16, the additional cost per unit of the\nadditional units 8 is $1/unit. Therefore the rm will produce 8 units when the price\nis above $0.50 and below $1, and 16 units if the price is above $1.\n(c) (5 points) Suppose that there are 5 such price-taking rms in the market, and that\nthere is no entry. Market demand is given by QD = 100-10p. What is the equilibrium\nprice and quantity in this market?\nTotal market supply with 5 rms is:\n⎧\n⎪\n⎨\n⎪\n⎩\nif p < 1/2\nif 1/2 ≤ p < 1\n5 y(p) =\n·\nif p ≥ 1\n= 2 and QM = 80.\nWith this level of demand, the market clears at pM\n(d) (7 points) Suppose now that instead of the 5 rms in part (c) there is actually a\nsingle monopolist that is ve times as large as one of these individual rms. The\nmonopolist's production function is therefore:\n⎧\n⎪\n⎪\n\nᆰ\n⎨\n⎪\n⎪\n\nᆰᆰ\n⎩\nif XM = 0\n40 if XM = 20\n45 if XM = 35\n80 if XM = 60\nYM = 5 f(XM ) =\n·\n\nDemand is given by QD = 100 - 10p as before. Assume now that entry is once again\nimpossible. What is the equilibrium price and quantity in this market? Compare this\noutcome with the equilibrium in (c) and explain why they are the same / dier.\nThe monopolist compares marginal revenue to marginal cost when deciding whether or\nnot to increase production:\nQ\nP = 10 - Q/10\nTR\nTC\nMR\nMC\nProt\n5.5\n247.5\n7.5\n-87.5\n212.5\nThe monopolist will not increase production beyond 40 because MR<MC for all quan-\ntities greater than 40. As a result, prots are maximized at Q = 40. The equilibrium\nprice at this quantity is $6.\nThis is a lower quantity and higher price than in (d) because the large monopoly rm\nhas market power and the ve smaller rms are assumed to be price takers.\n3. Monopoly and oligopoly (27 points)\nA uniform pricing monopolist has the following cost function and faces the following demand\ncurve for its product\nC(Q) = 20Q\nP\n= 100 - Q\n(a) (3 points) Find the monopolist quantity (Qm), price (Pm), and deadweight loss rel-\native to the perfectly competitive outcome. Draw a diagram labeling the perfectly\ncompetitive outcome as A, and the monopolist outcome as B. Be sure to include the\nmarginal cost and marginal revenue curves in your diagram.\nThe monopolist sets MR = MC\nDWL = 1\n240 ∗ 40 = 800.\n=\n⇒100 - 2Q = 20 =⇒ Qm = 40, Pm = 60.\n(b) (6 points) There are two possible scenarios for the monopolist:\ni. The government set a price ceiling of $ 40/unit in which case the monopolist does\nnot invest in any R & D because it is wary of future government regulation.\nii. There is no government regulation, so then the monopolist invests in R & D which\nthen changes the cost function so that MC = 0.\nWhich scenario has higher welfare (ignore the cost of R & D for producer surplus)?\nWhich scenario do the consumers prefer? Explain.\ni. At P = 40, Q = 60, we have CS = 1\n2BH = 1\n2 ∗ 60 ∗ 60 = 1800.\nPS = BH = 60 ∗ (40 - 20) = 1200\nW = CS + PS = 3000\nii. MC = 0, MR = MC = ⇒ 100 - 2Q = 0 =⇒ Qm = 50, Pm = 50\nAt Pm = 50, Qm = 50, we have:\n1 ∗ 50 ∗ 50 = 1250\nCS = BH =\nPS = BH = 50 ∗ 50 = 2500\nW = CS + PS = 3750\n\nConsumers would prefer scenario (i) since consumer surplus is higher because they\npay a lower price. Welfare is higher under scenario (ii) because the cost saving R & D\ngenerates large producer surplus and also limits the loss to consumer surplus because\noutput expands.\n(c) (6 points) For plan (i), the MR curve features a discontinuity at some Q'. Explain\nintuitively why the MR curve has this discontinuity.\nGenerally there are two eects for a monopolist when you increase Q by one unit: the\n\"output eect\" when you get to sell the additional unit you produce, and the \"poisoning\nthe well\" eect when you receive a lower price on the inframarginal units (units you\ncontinue to sell). When Q < Q0, the MR is constant at the price ceiling of 40 because\nthe monopolist is a price taker. While the monopolist would like to charge more, it\nis constrained by the government regulation and only has the \"output eect\". When\nQ > Q0, the MR suddenly drops because you are already selling a lot of inframarginal\nunits, and now the government price ceiling no longer binds, which implies that the\n\"poisoning the well\" eect is very large , leading to this discontinuity.\n(d) (6 points) In scenario (ii), when MC = 0, the monopolist chooses (Qm, Pm) such that\n|D| = 1. Will an unregulated uniform pricing monopolist ever choose (Qm, Pm) such\nthat |D| < 1? Explain intuitively.\nOn the inelastic portion of the demand curve, the marginal revenue is negative. If\nthe monopolist is ever on this portion of the demand curve, you can increase prots\nunambiguously by decreasing quantity by one unit. It is able to save the marginal cost,\nand its revenues also increase since MR < 0.\n(e) (6 points) Go back to your solution in (a). Suppose now the government allows one\nother identical rm to enter this market and rms compete on quantity. Let x = the\nvalue of the MR at the monopolist output when there's only one rm. Claim: If the\ntwo rms each produce half the Monopoly quantity, then MR = x for both rms at\ncurrent levels of output. Is this claim true, false, or uncertain? Please explain your\nreasoning.\nFalse. MR > x for each of the rms, because when the quantity is split between two\nrms, there are fewer inframarginal units so that the \"poisoning the well\" eect is\nsmaller from the perspective of one rm. The \"output eect\" is the same for either\nthe duopoly case or monopoly case.\n4. Trade in sweat-trapping headbands (35 points)\nThe U.S. demand for sweat-trapping headbands is summarized by the function qd = 1200-\np, where p is the market price of a headband. There are currently 49 identical, prot-\nmaximizing domestic headband producers in the U.S., each with the cost function TC(q) =\n72 + 0.5q2. U.S. consumers consider domestically produced headbands to be identical to\nforeign-produced headbands, and currently have access to a huge supply of foreign-made\nhandbands at a constant price of $10 per band (that is, we can think of the worldwide\nsupply of sweat-trapping headbands as a horizontal curve at p = 10).\n(a) (5 points) Write down an expression for the supply curve for an individual domestic\nheadband producer. If there is perfectly free international trade in sweat-trapping\nheadbands, what will be the market price of a headband in the U.S.? How many\nheadbands will be purchased in the U.S.? How many of those will be imported from\nabroad?\n\nIndividual domestic producers' supply function can be found by setting P = MC =\nQi,dom. Since there are 49 domestic producers, the total domestic supply will be Qdom =\n49P or Qdom/49 = P . The market price will be equal to the world price of 10.\nSince the market demand is P = 1200 - Q, this implies Qtotal = 1200 - 10 = 1190.\nDomestic producers supply Qdom = 49 10 = 490 units and foreign producers supply\n·\nthe remainder, Qforeign = 1190 - 490 = 700.\n(b) (5 points) What will be the prots of each domestic headband producer? What will be\nthe total prots earned by rms in the U.S. domestic headband industry? Assume, for\nnow, that the number of domestic producers remains xed at 49. Illustrate your answer\nwith two diagrams: one showing the prot-maximization decision of an individual\ndomestic rm, the other showing the entire U.S. headband industry.\nSince P = 10 and each domestic rm produces 10 units, individual prots are:\nπ = P\nQ - TC(Q) = 10 10 - 0.5 (10)2 - 72 = -22\n·\n·\n·\nIndustry prots are 49 (-22) = -1078.\n·\n(c) (2 points) What do you predict would happen to the U.S. domestic headband industry\nin the long run?\nAs short run prots are negative, we expect rms to exit this market in the long run.\n(d) (3 points) Suppose the U.S. government passes a dramatic new trade bill, the Sweat-\nTrapping Headbands Industry Protection Act of 2009, outlawing all imports of foreign-\nmade head-bands. If the number of domestic headband producers remains xed at\n49, what will be the new market price of a headband? How many headbands will be\npurchased in the U.S.?\nWhen imports are banned, the new market equilibrium is the intersection of demand\nand domestic supply: 1200 - Q = Q/49 =⇒ Q = 1200 · 49/50 = 1176, so P = 24.\n(e) (6 points) What will be the prots of each domestic producer after the new law is\npassed? What is the total increase in prots in the domestic headband industry as a\nresult of this new trade law? Depict graphically the change in consumer surplus for\nheadband buyers in the United States as a result of this policy as compared to your\nanswers in (a). Under which scenario will consumer surplus be larger?\nIndividual prots are: π = 24 24 - 0.5 (24)2 - 72 = 216, and industry prots are\n·\n·\n49 216 = 10584. The total change in the industry prots is thus 10584 - (-1078) =\n·\n11662. Consumer surplus is larger in the free trade case by the triangle indicated on\nthe graph below.\n(f) (6 points) Assuming that the law described in (d) remains in force, but that there is\nfree entry and exit in the domestic headband industry over time, what do you predict\nwill be the long-run market equilibrium price? How many sweat-trapping headbands\nwill be sold in the U.S.? How many headband-producing rms will there be in the\nU.S. in the long run?\nSince prots are positive in the short run equilibrium without imports, rms will enter\nuntil MC = AT C, such that individual prots are zero. Solving for the individual\nquantities:\nQ = 72/Q + 0.5 Q =\nQ2 = 72 2 = 144 =\nQ = 12\n·\n⇒\n·\n⇒\nWith P = MC this implies P = 12. The total quantity in the market is thus Qtotal =\n1200 - 12 = 1188. And since each rm produces 12 units, we have 99 = 1188/12 rms\nin the long run market equilibrium (or 50 new rms entering).\n\n(g) (8 points) Suppose that instead of the bill described in (d), the U.S. government de-\ncides to pass a less extreme law, assessing a t% tax on all imports of foreign headbands.\nHow large must t be (5%? 10%? etc.) in order to ensure that the 49 existing domestic\nproducers can remain in business in the long run?\nIf the government sets a tax t, then the market price will be P tax = P (1 + t) =\n·\n10 (1 + t). From the individual supply functions Q = P , this implies that producers\n·\nare each selling 10 (1 + t) units. Their prots are thus:\n·\nπ = P Q-TC(Q) = (10 (1+t))(10 (1+t))-0.5 (10 (1+t)))2 -72 = 50 (1+t)2 -72\n·\n·\n·\n·\n·\n·\nFor individual prots to be zero, we need\n72/50 = (1 + t)2 =\n1.44 = (1 + t)2 =\nt = 0.2 = 20%\n⇒\n⇒\nG\nr\naphical repre\nsen\nta\nt\ni\non f\nor\nEx\nam 2\n, Problem 4.\nImage by MIT OpenCourseWare.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n14.01SC Principles of Microeconomics\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT14_01SCF11_final_soln_f07.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-01sc-principles-of-microeconomics-fall-2011/627039d2f5adf84f0693ecad4fbf6541_MIT14_01SCF11_final_soln_f07.pdf",
      "content": "Page 1 of 7\nMassachusetts Institute of Technology\nDepartment of Economics\n14.01 Principles of Microeconomics\nFinal Exam\nWednesday, December 19th, 2007\nLast Name (Please print):\n______________\nFirst Name:\n__________________\nMIT ID Number:\n__________________\nInstructions. Please read carefully.\nThe exam has a total of 100 points. Answers should be as concise as possible. This is a closed book exam. You are\nnot allowed to use notes, equation sheets, books or any other aids. You are not allowed to use calculators. You\nmust write your answers in the space provided between questions. DO NOT attach additional sheets of paper. This\nexam consists of (18) sheets (13 pages + 5 blank pages for scratch work).\n0. Circle Your Section/Recitation (1 point):\nPlease circle the section or recitation which you are attending below. The marked exam will be returned to you, in\nthe section or recitation that you indicate. You will loose 1 point if you leave it unselected.\nS01: MWF9\n(Peter Schnabl)\nR01: F10 (Rongzhu Ke)\nS02: MWF10\n(Chia-Hui Chen)\nR02: F11 (Rongzhu Ke)\nS03: MWF11\n(Chia-Hui Chen)\nR03: F2\n(Rongzhu Ke)\nS04: MWF1\n(Monica Martinez-Bravo)\nR04: F12 (Marco Migueis)\nR05: F1\n(Marco Migueis)\nR06: F2\n(Marco Migueis)\nDO NOT WRITE IN THE AREA BELOW:\nQuestion 1 __/25\n\nQuestion 2 __/5\nQuestion 3 __/25\nQuestion 4 __/25\nQuestion 5 __/19\nQuestion 0 _/1\nTotal __/100\nCite as: William Wheaton, Chia-Hui Chen, Rongzhu Ke, Monica Martinez-Bravo, Marco Migueis, Peter Schnabl,\nand Hongliang Zhang, course materials for 14.01 Principles of Microeconomics, Fall 2007. MIT OpenCourseWare\n(http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nPage 2 of 7\n1. True/False Questions (TOTAL: 20 points):\nIn this section, write whether each statement is True or False. Please fully explain your\nanswer, using a diagram if appropriate. No credit will be given for an answer without an\nexplanation.\n(a) (5 points) After Professor Wheaton promises that no one would fail, students never\nstudy and turn in problem sets again. This is an example of adverse selection problem.\nFalse. It is an example of moral hazard.\n(b) (5 points) When a firm chooses among different projects, the one which has the\nhighest present value is always the one with the highest yield rate.\nFalse. A big project with small yield rate might have higher present value than a\nsmall project with high yield rate.\n(c) (5 points) If the government guarantees a binding price floor for agricultural output\nby purchasing any surplus, then the demand for farm labor will be more elastic.\nTrue. With the price guarantee, firms move along their conditional demand curve,\nwhich is more elastic than the unconditional demand for labor.\n(d) (5 points) Exploitation Mining Co. is the only employer in the remote town of\nUranium City and pays its workers $10.00/hour. If the government forces the\ncompany to raise its wage by a small amount--say to $10.10/hour--then it will hire\nmore workers.\nTrue. This is just like the price regulation example we saw for monopolists, except\nthat here the firm is a monopsonist in the market for labor. A regulated small\nincrease in the wage will increase the quantity of labor used above the monopsony\nlevel.\n(e) (5 points) A factory that pollutes a river has negative externalities on residents along\nthe river. If the factory and residents can negotiate, an efficient result can be achieved\nonly if the property right of the river is assigned to the residents.\nFalse. According to the Coase Theorem, as long as the property right is well specified,\nefficiency can be achieved no matter who owns the river.\nCite as: William Wheaton, Chia-Hui Chen, Rongzhu Ke, Monica Martinez-Bravo, Marco Migueis, Peter Schnabl,\nand Hongliang Zhang, course materials for 14.01 Principles of Microeconomics, Fall 2007. MIT OpenCourseWare\n(http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nPage 3 of 7\nShort Question:\n2. (5 points) A and B play rock, paper, scissors. Their payoffs are as follows (the first\nnumber is A's payoff and the second number is B's payoff):\n\nB\n\nA\nRock\nPaper\nScissors\nRock\n0,0\n-1,1\n1,-1\nPaper\n1,-1\n0,0\n-1,1\nScissors\n-1,1\n1,-1\n0,0\nHow many Nash equilibria are there in the game? Explain.\n0 if only pure strategy Nash equilibria are considered.\nCite as: William Wheaton, Chia-Hui Chen, Rongzhu Ke, Monica Martinez-Bravo, Marco Migueis, Peter Schnabl,\nand Hongliang Zhang, course materials for 14.01 Principles of Microeconomics, Fall 2007. MIT OpenCourseWare\n(http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nPage 4 of 7\nLong Questions:\n3. (25 points) Suppose that Intel has a monopoly in the market for computer chips. In\norder to produce X computer chips, it costs Intel C(X) = 2X2 .\n(a) (2 points) Find the marginal cost of producing a computer chip for Intel.\nSolution: MC X\n(\n)\n\n= 4X .\n(b) (6 points) The demand for computer chips is X D = 12 - 0.25 P . Find the level of\noutput that maximizes Intel's profits. What price is Intel charging?\nSolution: We can rewrite the demand function as P = 48 - 4X D , so total revenue\nis R(\n) = X (48\n\n- 4X ) = 48\n\nX - 4X 2 and marginal revenue is MR X\n(\n)\n\n= 48\n\n- 8\nX\nX .\nEquating marginal revenue to marginal cost gives\n4X = 48\n\n- 8X\nX * = 4\nm\nThe price is P = 48 - 4(4) = 32 .\n(c) (4 points) What level of output would maximize total surplus in the computer chip\nmarket?\nSolution: Total surplus is maximized when price equals marginal cost. That is,\n48 - 4X = 4X\nX * = 6\nTS\n(d) (4 points) Suppose the government knew the demand and production functions.\nFind a price regulation the government could impose that would induce Intel to\nmaximize total surplus, i.e., produce the efficient quantity from part (c).\nSolution: The price that gets consumers to demand 6 units is 24. If the\ngovernment set a regulated price cap at P = 24 , Intel would face a constant\nmarginal revenue function and would choose to produce where MC = 24 , i.e., at\nthe efficient level from part (c).\n(e) (6 points) If the government subsidized Intel s for every unit of computer chips\nproduced, what quantity would Intel choose as a function of s? Find the choice of\nsubsidy that maximizes total surplus, i.e., induces Intel to produce the efficient\nquantity from part (c).\nCite as: William Wheaton, Chia-Hui Chen, Rongzhu Ke, Monica Martinez-Bravo, Marco Migueis, Peter Schnabl,\nand Hongliang Zhang, course materials for 14.01 Principles of Microeconomics, Fall 2007. MIT OpenCourseWare\n(http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nPage 5 of 7\nSolution: Now marginal revenue is\n(\n)\n\n= 48\n\n-8X +\nMR X\ns . If Intel equates\nmarginal revenue to marginal cost, then\n4X =\n8X\ns\n\n-\n+\n*\ns\nX\ns( ) 4\n=\n+\n\nThe surplus-maximizing choice of subsidy induces Intel to produce the efficient\nnumber of chips from part (c). Solving for X\ns\n6 , we find that a subsidy of 24\n*( ) =\nper unit is required.\n(f) (3 points) Both the price regulation policy from part (d) and the subsidy policy\nfrom part (e) maximize total surplus. Is there any reason someone might prefer\none policy over the other?\nSolution: While the policies have the same efficiency characteristics, they have\nvery different distributional consequences. The subsidy increases Intel's profits\nat the expense of taxpayers; the price regulation redistributes some of Intel's\nprofits to consumers.\nCite as: William Wheaton, Chia-Hui Chen, Rongzhu Ke, Monica Martinez-Bravo, Marco Migueis, Peter Schnabl,\nand Hongliang Zhang, course materials for 14.01 Principles of Microeconomics, Fall 2007. MIT OpenCourseWare\n(http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nPage 6 of 7\n4. (25 points) Firm 1 and firm 2 are the only producers of spring water in the market.\nThe market demand for spring water is given by P = 70 -Q1 -Q2 . Firm 1 and firm 2\ncompete by choosing quantities Q1 and Q2 respectively. Each firm has a marginal cost\nof 10 and no fixed cost.\n(a) (5 points) Find out firm 1's and firm 2's reaction functions.\nSolution: Q1 = 60 - Q2 ,Q2 = 60 - Q1 .\n(b) (5 points) Suppose the two firms choose quantities simultaneously. What are the\nequilibrium price, quantities, and profits of the two firms in this market?\nSolution: Q1 = Q2 = 20, P = 30\n(c) (5 points) Suppose only firm 1 has a chance to bribe the government and get the\nright to choose the quantity first, what is the maximum amount of money that firm\n1 is willing to pay? If firm 1 gets to move first, what are the equilibrium quantities\nand profits of firm 1 and firm 2? [Hint: if firm 1 does not bribe the government,\nthe two firms will choose quantities simultaneously as in (b).]\nSolution: The quantity of the first mover is 30 and the profit is 450. The quantity\nof the second mover is 15 and the profit is 225. If firm 1 does not get the right, its\nprofit is 400. Therefore, firm 1 is willing to pay is 450-400=50.\n(d) (5 points) Now back to the situation that the two firms choose quantities\nsimultaneously. Suppose the two firms decide to collude and share the profit\nequally. Assume that both firms value their reputation and will behave according\nto their agreement. What are the quantities they will choose for each firm? What\nis the profit of each firm?\nSolution: Each firm produces 15 units and gets profit 450.\n(e) (5 points) Suppose the two firms decide to collude and share the profit equally,\nbut both firms do not care about their reputation and might try to take advantage\nof the other. Foreseeing this, they make a legally enforceable contract saying that\nif a firm does not produce the quantity agreed, it has to pay some penalty to the\nother firm. What is the minimum amount of penalty that ensures each firm\nproducing the right quantity agreed in part (d).\nSolution: Given the other firm produces 15 units, the best response of a firm is to\nproduce 22.5 units and it gets profit 506.25. Therefore the penalty should be at\nleast 56.25 so that no one would deviate.\nCite as: William Wheaton, Chia-Hui Chen, Rongzhu Ke, Monica Martinez-Bravo, Marco Migueis, Peter Schnabl,\nand Hongliang Zhang, course materials for 14.01 Principles of Microeconomics, Fall 2007. MIT OpenCourseWare\n(http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nPage 7 of 7\n5. (19 points) The country of Economia has two industries. In the Clothing industry, the\nmarginal product of labor is always 1. In the Steel industry, the marginal product of\nlabor is 12L-\nS\n1/ 2 -2, where LS is the total number of workers employed in the Steel\nsector. The total supply of labor in Economia is fixed at LC + LS = 25 , and the output\nprice is 1 for both Clothing and Steel. [Note on calculus: if you have forgotten, the\nderivative of aXb is abXb-1.]\n(a) (7 points) Suppose that the labor market is perfectly competitive. How many\nworkers will be employed in the Clothing sector, and how many in the Steel\nsector? What wage rate will workers in each sector receive? [Hint: Workers can\nswitch sectors at will. What does that imply about wages in the two sectors?]\nSolution: Workers in each sector will receive the same wage (equal to their\nmarginal revenue product), so wC = wS = 1. This implies that LC = 9 and LS = 16.\n(b) (8 points) Suppose that workers in the Steel sector form a union, which acts as a\nmonopolist in supplying labor to the Steel industry. The union chooses a level of\nemployment that maximizes the total wages of its members (i.e., it maximizes\nwSLS). How many workers will the union allow to be employed in the Steel sector?\nHow many will now be employed in the Clothing sector? What wage rate will\nworkers in each sector receive? [You should assume that the prices of Clothing\nand Steel remain 1. The labor market for Clothing workers is still perfectly\ncompetitive.]\nSolution: The wage rate will still be the marginal revenue product of labor, so the\n1/ 2 -\n=12 1/2\nunion maximizes LS (12 L-\nS\n2)\nLS -2LS . Setting the derivative of total\nwages equal to 0, we find that\n6L-1/ 2\n-\n=\nS\nLS = 9\nThat is, now 16 workers will be employed in Clothing and only 9 in Steel.\nWorkers in each sector still receive their marginal revenue products, so wC = 1\nand wS = 2.\n(c) (4 points) If workers in Clothing had unionized in order to increase their wage\nrate instead of workers in Steel, what would have happened to employment and\nwages in each sector? Explain why. [No calculations necessary; just describe the\noutcome qualitatively.]\nSolution: Nothing. Workers in the Clothing sector can't raise wages at all--\nClothing firms have a perfectly elastic demand for labor!\nCite as: William Wheaton, Chia-Hui Chen, Rongzhu Ke, Monica Martinez-Bravo, Marco Migueis, Peter Schnabl,\nand Hongliang Zhang, course materials for 14.01 Principles of Microeconomics, Fall 2007. MIT OpenCourseWare\n(http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n14.01SC Principles of Microeconomics\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT14_01SCF11_final_soln.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-01sc-principles-of-microeconomics-fall-2011/6c60e9cb452492f849f1d95210e28bf3_MIT14_01SCF11_final_soln.pdf",
      "content": "14.01 Fall 2010: Final Exam Solution Set\n1. True/False/Uncertain Questions (48 points)\nIn this section, write whether each statement is True, False or Uncertain. You should fully\nexplain your answer, including diagrams where appropriate. Points will be given based on\nyour explanation.\n(a) (4 points) A uniform pricing monopolist has an upward sloping MC curve. Claim: a\nprice ceiling set below the monopoly price will increase welfare relative to the monopoly\noutcome (assume the monopolist does not shut down).\nUncertain. For a certain range of prices, a binding price ceiling will increase welfare\nbecause it forces the monopolist to be a price taker and output increases (q moves\ntoward the perfectly competitive outcome). However, if the price ceiling is low enough\nthen the monopolist could produce even less output than the unregulated monopolist\nand therefore welfare is lower.\n(b) (4 points) A large box of paper towels which will last you 2 years is on deep discount\nat Wal-Mart, saving you $1 per roll. Claim: a rational consumer who has perfectly\ninelastic demand for paper towels should always purchase this large box instead of\npaying a higher price for individual paper towel rolls.\nFalse. For this purchase, you pay a large upfront cost to save dollars in the future. If\ninterest rates are suciently high, it is better for you to not buy this box, since you\ncan earn interest on the money you would have used to buy the big box of paper towels.\n(c) (4 points) In an oligopolistic market with identical rms, the market price is higher\nwhen there are two rms in the market than when there are 100 rms in the market.\nUncertain / False - This may be true in a market with Cournot competition, but\nunder Bertrand competition any market with more than one rm will have price equal\nto marginal cost. Even in the Cournot case, if the demand curve is perfectly elastic\nprice will not depend on the number of rms.\n(d) (4 points) The government of a developing country is worried about the adverse eect\nthat the high interest rate in the economy has on investment. Claim: Since a low\ninterest rate makes more projects have positive NPV, investment in this economy will\nincrease if the government imposes an interest rate cap.\nFalse. An interest rate cap below the equilibrium interest rate will lower the supply\nof funds and increase the demand, leading to excess demand for funds in the capital\nmarket. The level of investment in the economy will fall, since the supply of funds is\nlower.\n(e) (8 points) There are three individuals in society: Bob, Milton and Paul. There are\nthree possible social states which result in dierent utility levels for the three individ-\nuals:\n\nBob\nMilton\nPaul\nA\nB\nC\nAre the following True/False/Uncertain? Explain.\n(i) No government would choose social state C.\nTrue. Social state B always dominates state C since, everybody is better o under B\ncompared to C.\n(ii) There is a government election in this society and there are two candidates: a\nRawlsian and an Utilitarian government candidates. Claim: In a democratic election\n(majority win election) a Utilitarian candidate will be elected since more individuals\nin this society prefer the Utilitarian candidate.\nFalse. A Rawlsian government would choose social state B, whereas an Utilitarian\ngovernment would choose state A. Since Bob and Paul are better o under B than\nunder A they would vote for a Rawlsian government.\n(f) (8 points) Jon spends his entire budget on espresso and gasoline. You have the fol-\nlowing data on his choices:\nTable 1: Jon's budget\nPrice/\nPrice/\nGallons\nShots\nTotal\ngallon gasoline\nshot espresso\npurchased\npurchased\nincome\nFebruary\nMarch\n5/2\n3/4\nApril\n1/2\nAssume Jon's preferences are monotone, the same over the three months, and that he\nhas no way to save or borrow across periods. Are Jon's choices consistent with utility\nmaximization?\nThe key to these problems is to see if two bundles are aordable in a period and if\nbundle A is chosen over bundle B, then A is preferred to B. Neither the March nor\nApril bundles are aordable in February. The April bundle is aordable in March but\nit is not chosen, so March is preferred to April. Checking to see if March is aordable\nin April, we nd that it is not, so this is consistent with utility maximization.\n(g) (4 points) Marco's monthly income is $1000. He spends 40% of his income on food and\nthe rest on buying designer clothes. The City Council thinks it is unfair that people\nspend more than 35% of their income for food. In order to lower the proportion of\nincome going to food, the City Council gives Marco $200. Claim: given that Marco's\nincome elasticity of food is 2, the City Council accomplishes its goal.\nOriginally Marco spends $400($1000 ∗ 40%) on food. After Marco receives $200 from\nthe City Council, his income increases by 20%. Since his income elasticity of food is\n2, his spending on food will increase by 40%(20% ∗ 2), which is equal to $560($400 ∗\n(1 + 40%)). Then the proportion of Marco's income going to food is 47%(560/1200),\nwhich is higher than 40%. Thus, the City Council will not accomplish its goal.\n(h) (4 points) Venus Williams likes both tennis rackets and tennis shoes. She has many\nof both. Her marginal rate of substitution (MRS) of rackets for shoes is 3, meaning\n\n(\nthat given the opportunity, she is willing to trade 3 tennis rackets for 1 pair of shoes,\nor vice versa. Unused rackets and shoes may be returned to the local sporting goods\nstore for a refund. The current price for a racket is $200 and the price for a pair of\nshoes is $100. Claim: Venus can make herself better o by trading in some tennis\nrackets in return for some shoes at the market rate.\nTrue. Since Venus has many tennis rackets (Y) and tennis shoes (X) she hasn't\nworn, she can return or exchange them. Since her MRSY forX = 3, she would be\nwilling to give up 3 rackets for one pair of shoes. However, since the price ratio is\nPX /PY = $100/$200 = 1/2, she's only required to give up 1/2 racket for each extra\npair of shoes (if you don't like the way that sounds, an equivalent statement is that\nshe's required to give up 1 racket for every 2 extra pairs of shoes). Venus would make\nherself happier by trading in some tennis rackets in return for some shoes at the market\nrate.\n(i) (4 points) Suppose that there are two types of drivers: speeders and slowpokes. Speed-\ners are more likely to have accidents, and have expected costs of $5,000 a year in car\nrepair bills. Slowpokes on the other hand have expected costs of only $100 a year. Sup-\npose further that speeders are risk-loving and that slowpokes are risk-averse. Claim:\na (risk-neutral) private car insurance company will insure only slowpokes even if there\nare no asymmetric information or moral hazard problems in this market.\nTrue - speeders will never want to buy fair insurance, so the insurance market will\nlose money on average by insuring speeders and make money by insuring slowpokes.\nInsurers can oer a policy aimed at slowpokes and speeders will never try to buy the\npolicy.\n(j) (4 points) Please outline the pros and cons of the U.S. adopting a tax system with a\nheavier reliance on a consumption tax.\nA consumption tax encourages savings, which may be positive for growth, especially\ngiven that savings rates in the U.S. are currently extremely low. On the other hand,\na consumption tax is generally regressive since the poor consume a higher fraction of\ntheir income than the rich, and will thus pay a higher proportion of their income in\ntax than the rich (unlike the income tax, which is progressive).\n2. Uncertainty (20 points)\nAn economy has two agents, Bill and Bob. Bill has $110, and Bob has $200. Utility of\nagents in this economy is characterized by the following function of income:\nU = u(y) =\nlog(y - 60)\ny\nif y ≥ 160\nif y < 160\nThe minimum level of income possible in this economy is 60.\nEach agent is about to choose a new business venture, and has a choice between project A\nand project B. Neither project requires any investment up front. Project A yields revenues\nof 20 with probability 1\n2 and revenues of -10 with probability 1\n2. Project B yields revenues\nof 4 with probability one-half and revenues of 5 with probability one-half. Throughout this\nproblem, assume that fractional income is possible.\n(a) (5 points) Which project would each agent choose? Provide intuition for your answer.\n\nBill is in the risk-averse portion of the utility function, and so he will choose project B\nwhere there is no possibility of a loss. Bob is risk-neutral, and so he chooses the project\nwith higher expected returns, which is project A. We can verify that Bill receives higher\nutility from project B.\nE[UBill, B] =\nlog 54 +\nlog 55 =\nlog 2970\nE[UBill, A] =\nlog 40 +\nlog 70 =\nlog 2800\nClearly, the rst expression is higher.\n(b) (5 points) If Bill and Bob each choose an investment project each year and receive\nthe associated income for 20 years, will the expected gap in their incomes be larger or\nsmaller at the end of this period than it was initially? How does this relate to attitudes\ntoward risk? You do not need to calculate income over 20 years, just provide intuition.\nThe income gap will be larger. Eventually Bill will get to a point on his utility function\nwhere it is optimal for him to choose the more lucrative project, but because he starts at\na lower income level and initially chooses a less lucrative project, the income gap will\ngrow. Because there is risk aversion at lower levels of income, relatively poor agents\nwill not choose more protable but riskier sources of income because the disutility of a\ndecline of income from an already low level is high.\n(c) (10 points) Now, assume that there is a job available that provides xed wage income.\nWhat salary would the job have to provide in order to induce Bill to take the job\nrather than entering a new business venture? What salary would the job have to\nprovide in order to induce Bob to take the job? Which is higher, and why? Algebraic\nexpressions are acceptable as answers.\nWe need to provide each person with his certainty-equivalent level of income as a wage.\nFor Bill, this is equal to\n√\n2970 - 50, or around $4.50. Since Bob is risk neutral, we\nneed to provide him with the same level of income he could earn in project A, which\nis $5. The salary is higher for BobBill has higher utility from the job by virtue of\nit being a steady stream of income as opposed to a gamble, and so a lower salary will\nmake him satised. Bob is indierent to risk, so he needs a higher salary.\n3. Costs and oligopoly (45 points)\nA rm produces output q using capital and labor inputs according to the production func-\ntion\nq = f(K, L) = 4K + 2L\nCapital and labor are both supplied in perfectly elastic input markets at prices of r = 4\nand w = 4.\n(a) (5 points) Draw a representative set of isoquants for this rm. On the same graph,\ndraw and label the rm's expansion path at these prices of capital and labor.\n\nIn this production function, capital and labor are perfect substitutes. The isoquants\nhave a slope of -1/2:\nq = 4K + 2L\nq\nL\n⇒\nK = 4 - 2\nAt these prices, the rm will only use capital in production. Therefore the expansion\npath is simply increasing along the y-axis.\n(b) (5 points) Find the factor demands for capital and labor as functions of output.\nWe know that the rm will only use capital at these prices, so the demand for labor as\na function of q is simply\nL(q) = 0\nThe production function can therefore be written\nq = 4K\n⇒ K(q) = 4\nq\n(c) (6 points) Derive an expression for the rm's total cost as a function of q.\nAs usual, we can calculate the total cost function\nTC(q) = rK(q) + wL(q) = 4 4\nq + 4 · 0 = q\nMarginal cost is constant at MC(q) = 1.\n(d) (8 points) Suppose that in this market, our original rm competes with one other\nidentical rm, and that both rms set their quantities at the same time. Furthermore,\ninverse demand for q is given by p = 7 - q. Regardless of what you found in part\n(c), you should now assume that both rms produce at a constant marginal cost of\n1. Find the equilibrium price as well as the quantities and prots for each of these\nduopolists.\nG\nraphical\nr\nepresentation for the Final Exam, Problem 3.\nImage by MIT OpenCourseWare.\n\nWe solve for the Cournot quantities and prices in the usual way.\nFor rm A, the problem is\nmax qA(p - MC(qA))\nqA\nmax qA(7 - qA - qB - 1)\nqA\nThe rst order condition with respect to qA yields optimality condition\n6 - 2qA - qB = 0\nqA = 6 - qB\n⇒\nSince the rms are identical, we know that\n6 - qA\nqB =\nand we can substitute in to solve for qA:\nqA = 3 - 2\n1 qB = 3 - 2\n3 + q\nA\n⇒\n4qA = 2\nqA = 2\n⇒\nSo we have:\nqA =\nqB\n=\nQ =\np =\n7 - 4 = 3\nπA = 2(3 - 1) = 4\nπB\n=\n(e) (6 points) What is the maximum amount that an outside investor would be willing to\npay to purchase one of these rms? Explain.\nAn outside investor knows that the rm will generate 4 in prots when it produces.\nThe investor would therefore be willing to buy the rm at any price such that her net\nprots were nonnegative. The highest such price is 4.\n(f) (8 points) What is the maximum amount that duopolist A would pay to acquire rm\nB before quantities are set? Explain intuitively why rm B is worth more to its\ncompetitor than to an outside investor.\nIf rm A acquires rm B, rm A will be a monopolist in its market. If rm A were a\nmonopolist, it would set its quantity to solve the usual monopolist's problem:\nmax q(7 - q - 1)\nq\n⇒\n6 - 2q = 0\nq∗ = 3\n⇒\n\nPrice would then go up to 4, so rm A's prots would be πM = 3(4 - 1) = 9 in this\nscenario. Firm A would therefore be willing to pay up to 5 to purchase rm B, as\ndoing so would increase prots from 4 to 9.\nFirm B is worth more to rm A than to an outside investor because rm A not only\ngains the prots B would have earned in the Cournot duopoly, but also increases its\nown market power, allowing it to maximize total industry prots.\n(g) (7 points) Suppose instead that the two rms were competing on price, a la Bertrand.\nHow much would an outside investor be willing to pay for rm B? How much would\nrm A have paid?\nProts in the case with identical rms in a Bertrand duopoly are zero, so an outside\ninvestor would not have been willing to pay any positive price for rm B. Firm A on\nthe other hand would be able to raise its prots from 0 to 9 if it bought out rm B.\nTherefore rm A would be willing to pay up to 9 for rm B.\n4. Labor supply and income and substitution eects (40 points)\nThere are three periods, t = 0, 1, 2. In t = 1 Mary maximizes her utility over leisure and\nconsumption given the following function:\nU1(N1, C1) = N 2\n1 C 2\nsubject to the following budget constraint:\nC1 + w1N1 = 24w1\nwhere w1 = 10. Note the price of the consumption good is assumed to be one in all periods.\nAfter she has made this decision, in t = 2 she maximizes this utility function:\nU2(N2, C2) = N 3\n2 C 3\nsubject to the following budget constraint:\nC2 + w2N2 = 24w2\nwhere w2 = 20.\n(a) (6 points) For t = 1, 2 calculate Mary's choice of leisure and consumption in each\nperiod.\nFor t = 1, MRS = w1 implies C1 = w1N1. Plugging back into the budget constraint\nyields N1 = 12, H1 = 12, C1 = 120. For t = 2, w2 = w1 + 2.5(H1 - 8) = 20.\nMRS = w2 implies C2 = 2w2N2. Plugging back into the budget constraint yields\nN2 = 8, H2 = 16, C2 = 320. Note that the optimal amount of labor/leisure does not\ndepend on the wage rate.\n(b) (6 points) For t = 1, provide economic intuition for the income and substitution eects\nof a wage increase on leisure. Can you say anything about the relative magnitudes of\nthese income and substitution eects?\nSubstitution eect: when the wage increases, it is relatively more expensive to take\nleisure so you will work more.\nIncome eect: when the wage increases, you are richer and since leisure is a normal\ngood you take more leisure.\nThese eects are equal in magnitude because leisure does not depend on the wage rate.\n\n(c) (7 points) Go back to your solution in part (a). If the interest rate is 10% per period,\nwhat is the present value of her consumption in t = 0? Please use 0.9 and 0.8 as\napproximations for 1/(1.1) and 1/(1.1)2 respectively.\nPV = 120/(1 + i) + 320/(1 + i)2 = 120 ∗ 0.9 + 320 ∗ 0.8 = 108 + 256 = 364\n(d) (7 points) Mary now has the option of obtaining additional job training in t = 0 at an\ninvestment cost of $200. As a result, her wage rate increases in t = 1 to w1 = 20 and in\nt = 2 to w2 = 30. Calculate the net present value of this investment on consumption.\nConsider only the value of consumption (and not the value of leisure).\nSince the optimal amount of work/leisure does not depend on the wage rate, we can use\nthe same answers we found in part (a), H1 = 12 and H2 = 16 which implies C1 = 240\nand C2 = 480. As a result, the increase in consumption is C1 = 120, C2 = 160 with\nan upfront investment of $200.\nNPV = -200 + 120/(1.1) + 160/(1.1)2 = -200 + 108 + 128 = 36\n(e) (7 points) For more general utility functions, when will the net present value of the\ninvestment on consumption from part (d) likely be negative? Use income and substi-\ntution eects in your explanation.\nFor more general utility functions, it's possible that an increase in wage will cause\nyou to work less because the income eect is larger than the substitution eect. In\nother words, it's possible that your consumption of goods barely changes but instead\nyou decide to take more leisure. This could result in NPV < 0.\n(f) (7 points) Does Mary have a Laer curve for income taxes (as opposed to consumption\ntaxes)?\nNo, Mary does not have a Laer curve because as you increase the income tax rate,\nit does not change her labor/leisure decision. She continues to work the same amount\nregardless of the income tax, so revenues will always increase monotonically with the\ntax rate. The only way that she could have a Laer curve is if she worked less when\nyou increased her tax rate.\n5. Trade and price discrimination (20 points)\nA U.S. pharmaceutical rm sells its patent-protected drug Levemir in the U.S. and E.U.\nmarkets. The domestic demand function is QUS = 120 - 2pUS , and the E.U. demand\nfunction is QEU = 60 - pEU , where all prices are measured in U.S. dollars and quantity is\nmeasured in vials. The rm's marginal cost is MC = 10 in both countries.\n(a) (6 points) Initially, the U.S. and E.U. governments prevent resale of Levemir. What are\nthe rm's optimal pUS and pEU ? (The same price has to be charged to all consumers\nin the U.S. market and all consumers in the E.U. market.) How many vials does it\nsell in the U.S. and E.U. markets?\nIf U.S. and E.U. government can prevent resale, then this rm can implement the\nmulti-market price discrimination. That is, this monopolistic rm solves its prot\nmaximization problem separately in two markets, U.S. and E.U. market.\nU.S. Market:\n- demand curve: QUS = 120 - 2PUS ;\n\n- inverse demand curve: PUS = 60 - 0.5QUS ;\n- marginal revenue curve: MRUS = 60 - QUS .\nProt maximization condition:\nMRUS = MC = ⇒ 60 - QUS = 10 =⇒ QUS = 50\nSubstituting QUS into the inverse demand function:\nPUS = 60 - 0.5QUS = 60 - 0.5(5) = 35\nE.U. Market:\n- demand curve: QEU = 60 - PEU ;\n- inverse demand curve: PEU = 60 - QEU ;\n- marginal revenue curve: MREU = 60 - 2QEU .\nProt maximization condition:\nMREU = MC = ⇒ 60 - 2QEU = 10 =⇒ QEU = 25\nSubstituting QEU into inverse demand function:\nPEU = 60 - QEU = 60 - 25 = 35\nThus, this rm sells 50 and 25 vials at the same price, 35 per vials, in the U.S. and\nE.U. markets, respectively.\n(b) (6 points) Now assume that the U.S. and E.U. governments permit resales and per unit\ntransportation and other transaction costs are negligible, so that the pharmaceutical\nmonopoly can no longer price discriminate. What price will the rm charge and how\nmany vials will it sell in the U.S. and in the E.U. markets?\nAssume that this monopoly charges a single price such that PUS = PEU = P .\n- aggregate demand curve: Q = QUS +QEU = (120-2PUS )+(60-QEU ) = 180-3P ;\n- inverse demand curve: P = 60 -3Q;\n- marginal revenue curve: MR = 60 -\nProt maximization condition:\n3Q.\nMR = MC = ⇒ 60 - 3Q = 10 =⇒ Q = 75\nSubstituting Q = 75 into the inverse demand curve:\nP = 60 - 3(75) = 35\nSubstituting p = 35 into individual demand functions:\nQUS = 120 - 2P = 50\nQEU = 60 - P = 25\n\n(c) (8 points) Use one graph for the U.S. market and one graph for the E.U. market to\nshow the welfare impacts of the policy change in (b). What happens to consumer\nand producer surplus in each nation? Overall, is this a social welfare improvement or\nreduction? Please provide intuition for the overall welfare impact.\ni. U.S. Market:\n- consumer surplus: A1 + B1;\n- producer surplus: C1 + D1;\n- deadweight loss: E1.\nii. E.U. Market:\n- consumer surplus: A2 + B2;\n- producer surplus: C2 + D2;\n- deadweight loss: E2.\niii. Total\n- consumer surplus: (A1 + B1) + (A2 + B2);\n- producer surplus: (C1 + D1) + (C2 + D2);\n- deadweight loss: E1 + E2.\nGenerally, the monopolist is better o under price discrimination (part a), because at\nworse he can always charge the unifrom price in each market. The monopolist's pricing\ndecision depends on the elasticity of demand. In general, consumers in low-elasticity\nmarkets are adversely aected by the discrimination and would prefer a uniform price;\nconsumers in high-elasticity markets prefer price discrimination. However, the two\ndemand functions in this problem have the same elasticity. Hence the monopolist's\npricing decisions are the same in parts (a) and (b).\n\nGra\nphi\ncal\nre\npre\nsentatio\nn\nfo\nr\nth\ne\nFi\nna\nl Exam, Problem 5: the US Market.\nImage by MIT OpenCourseWare.\nGra\nph\nic\nal repre\nsen\nta\nti\non\nfo\nr\nth\ne Fi\nna\nl Exam, Problem 5: the E.U. Market.\nImage by MIT OpenCourseWare.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n14.01SC Principles of Microeconomics\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT14_01SCF11_soln01_f07.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-01sc-principles-of-microeconomics-fall-2011/a8a2097abd606e23e94ef540accf2139_MIT14_01SCF11_soln01_f07.pdf",
      "content": "Page 1 of 7\nMassachusetts Institute of Technology\nDepartment of Economics\n14.01 Principles of Microeconomics\nFinal Exam\nWednesday, October 10th, 2007\nLast Name (Please print): ______________\nFirst Name:\n__________________\nMIT ID Number:\n__________________\nInstructions. Please read carefully.\nThe exam has a total of 100 points. Answers should be as concise as possible.\nThis is a closed book exam. You are not allowed to use notes, equation sheets,\nbooks or any other aids. You are not allowed to use calculators. You must write\nyour answers in the space provided between questions. DO NOT attach\nadditional sheets of paper. This exam consists of (18) sheets (13 pages + 5 blank\npages for scratch work).\n0. Circle Your Section/Recitation (1 point):\nPlease circle the section or recitation which you are attending below. The marked\nexam will be returned to you in the section or recitation that you indicate. You\nwill loose 1 point if you leave it unselected.\nS01: MWF9\n(Peter Schnabl)\nR01: F10 (Rongzhu Ke)\nS02: MWF10\n(Chia-Hui Chen)\nR02: F11 (Rongzhu Ke)\nS03: MWF11\n(Chia-Hui Chen)\nR03: F2\n(Rongzhu Ke)\nS04: MWF1\n(Monica Martinez-Bravo)\nR04: F12 (Marco Migueis)\n\nR05:\n\nF1\n\n(Marco\n\nMigueis)\n\nR06:\n\nF2\n\n(Marco\n\nMigueis)\n\nDO NOT WRITE IN THE AREA BELOW:\nQuestion 1 __/20\n\nQuestion 2 __/10\nQuestion 3 __/15\n\nQuestion 4 __/25\nQuestion 5 __/29\n\nQuestion 0 __/1\nTotal __/100\nCite as: William Wheaton, Chia-Hui Chen, Rongzhu Ke, Monica Martinez-Bravo, Marco Migueis, Peter Schnabl,\nand Hongliang Zhang, course materials for 14.01 Principles of Microeconomics, Fall 2007. MIT OpenCourseWare\n(http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nPage 2 of 7\n1. True/False Questions (TOTAL: 20 points):\nIn this section, write whether each statement is True or False. Please fully explain your\nanswer, using a diagram if appropriate. No credit will be given for an answer without an\nexplanation.\n(a) (5 points) A risk averse individual that has to decide between two different lotteries\nwill always prefer a lottery with less risk.\nFalse. A risk averse individuals dislike risk but not at \"any price\". They will take into\naccount the expected value of each lottery in their decisions.\n(b) (5 points) Steven only consumes two goods: X and Y. If X is a Giffen good for\nSteven, then Y must be a normal good for Steven.\nTrue. A Giffen good is an inferior good. Since Steven only consumes two goods, they\ncannot both be inferior goods. Therefore, Y is a normal good. (Need to point out\nexplicitly that Giffen goods are a special kind of inferior goods, or the negative income\neffect of a Giffen good dominates the substitution effect. People who only say that the\nconsumption of a Giffen good decreases with income without explanation lose partial\npoints.)\n(c) (5 points) Ann and Bob consume clothes (C) and food (F) only. Ann's utility function\nis U (C, F) = a A ln C + bA ln F , and Bob's utility function is U (C, F) = aB ln C + bB ln F .\na A ,bA , aB ,bB > 0 . The price of clothes is PC , and the price of food is PF . Ann and Bob\nmust have the same marginal rates of substitution (MRS) of clothes for food at the\noptimal level of consumption.\nTrue. With utility functions in this form, we always have an interior solution, and\nhence Ann's MRS and Bob's MRS both equal the price ratio.\n(d) (5 points) If S and F are perfect complements you must be indifferent between these\ntwo bundles:\ni. One unit of S and one unit of F\nii. Two units of S and one unit of F\nFalse. The line that goes through the kinks of the indifference curves doesn't need to\nhave slope 1. Consider a consumer that likes to consume both goods in a ratio 2:1. In\nthat case the first bundle is in another indifference curve with a lower level of utility\nassociated.\nCite as: William Wheaton, Chia-Hui Chen, Rongzhu Ke, Monica Martinez-Bravo, Marco Migueis, Peter Schnabl,\nand Hongliang Zhang, course materials for 14.01 Principles of Microeconomics, Fall 2007. MIT OpenCourseWare\n(http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nPage 3 of 7\n2. Short Answer Questions (TOTAL: 10 points):\n(a) (4 points) Mary's demand curve for food is Q = 10 - 2P . Her price elasticity of\ndemand for food at price P* equals -\n. How much is P*?\nMary's demand function is QB = 10 - 2P . His price elasticity of demand at P* is\ndQB P *\nP *\n= -2 ×\n= - .\ndP QB *\n10 - 2P *\n⇒ 3P* = 10 - 2P *\n⇒ P* = 2\n(b) (6 points) Ann and Bob are a couple. They are the only people in the family. Bob's\ninverse demand curve for shirts is P = 5 - QB . Ann's inverse demand curve for shirts\nis P = 10 - 2QA . What is their family demand function for shirts? Calculate their family\nconsumption of shirts when the price is 4 and 6, respectively.\nAnn's demand function is QA = 5 - P . When 5 ≤ P < 10 , only Ann buys shirts, and\nwhen P < 5 , both of them buy shirts. Therefore, the family demand function is\n⎧\n⎫\n⎪5 - P,if 5 ≤ P < 10⎪\nQ = ⎨\n⎬ . They consume 5 shirts when P=4 and consume 2 shirts\n⎪15 - P,if 0 ≤ P < 5⎪\n⎩\n⎭\nwhen P=6.\nCite as: William Wheaton, Chia-Hui Chen, Rongzhu Ke, Monica Martinez-Bravo, Marco Migueis, Peter Schnabl,\nand Hongliang Zhang, course materials for 14.01 Principles of Microeconomics, Fall 2007. MIT OpenCourseWare\n(http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nPage 4 of 7\nLong Questions:\n3. (15 points) Jane has utility function over her net income U (I ) = I\n(a) (2 points) What are Jane's preferences towards risk? Is she risk averse, risk neutral\nor risk loving? [Explain briefly your answer]\nWe know that Jane is risk averse by the concavity of her utility function. She\nprefers an amount for sure than any lottery that has that amount as expected value\nbut involves some risk.\n(b) (6 points) Jane drives to work every day and she spends a lot of money in parking\nmeters. Many days the thought of cheating and not paying for parking crosses her\nmind. However she knows that there is a 1⁄4 probability of being caught in a given\nday if she cheats, and that the cost of the ticket is $36. Her daily income is $100.\nWhat is the maximum amount of she will be willing to pay for one day parking?\n[Hint: by paying that amount she avoids the risk of getting a ticket!].\nShe will be indifferent between paying x for parking or facing the \"cheating\nlottery\" when the following equation holds:\nU(100-x) = 0.25*U(100-36)+0.75*U(100)\n√(100-x) = 0.25*√64 + 0.75*√100\n√100-x = 0.25*8 + 0.75*10 = 2 + 7.5 = 9.5\n100-x = 90.25\nx = 9.75\n(c) (2 points) Paul also faces the same dilemma every single day. But he has a utility\nfunction U(I)=I. His daily income is also $100. What are Paul's preferences\ntowards risk? Is he risk averse, risk neutral or risk loving?\nPaul is risk neutral since he has linear utility function over income.\n(d) (5 points) If the price of one day parking is 9.25, will Paul cheat or pay the\nparking meter? Will Jane cheat or pay the parking meter under this price?\nPaul will cheat since:\nU(100-9.25) < 0.25*U(100-36) + 0.75*U(100)\n90.75 < 16 + 75 = 91\nJane will not cheat since the price of one day parking is lower than what she is\nwilling to pay to avoid the risk of getting caught.\nCite as: William Wheaton, Chia-Hui Chen, Rongzhu Ke, Monica Martinez-Bravo, Marco Migueis, Peter Schnabl,\nand Hongliang Zhang, course materials for 14.01 Principles of Microeconomics, Fall 2007. MIT OpenCourseWare\n(http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nPage 5 of 7\n4. (25 points) In Country Faraway, cigarettes are forbidden, so people trade cigarettes in a\nblack market. The cigarette demand is QD = 12 - P , and the cigarette supply is Qs = 2P .\n(a) (3 points) Find the equilibrium price and quantity in the black market.\nP=4, Q=8.\n(b) (6 points) The government becomes aware of the black market and reinforces the\npolice so that half of the cigarette supply would be seized and destroyed. Under\nthis circumstance, what are the demand and supply functions? What is the new\nequilibrium price and quantity? Show the change by using a supply and demand\n\ndiagram.\nQD = 12 - P , QS = P , P=6, Q=6.\n(c) (4 points) How does the consumer surplus change between (a) and (b)?\nIn (a), the consumer surplus is 32, and in (b), the consumer surplus is 18. The\nconsumer surplus decreases by 14.\n(d) (8 points) Suppose that the government changes the policy and legalizes cigarette\ndealings. Now cigarettes are traded in an open market. However, for every unit of\nthe cigarettes bought, the buyer has to pay tax T to the government. T is equal to\nthe pre-tax price P. What are the demand and supply functions under this\ncircumstance? What are the equilibrium (pre-tax) price and quantity? What is the\n\nafter-tax price paid by buyers?\nQD = 12 - (P + T ) = 12 - 2P ,QS = 2P , P=3, Q=6. The after-tax price is 6.\n(e) (4 points) Compare (b) and (d). Which policy do consumers prefer? Which policy\ndoes the government prefer? Why?\nThe quantities and the (after-tax) prices paid by buyers are the same in both cases.\nTherefore, consumers feel indifferent. For the government, the policy in (b)\nrequires extra expenditure on police and the policy in (d) brings tax revenue.\nTherefore, the government prefers (d).\nCite as: William Wheaton, Chia-Hui Chen, Rongzhu Ke, Monica Martinez-Bravo, Marco Migueis, Peter Schnabl,\nand Hongliang Zhang, course materials for 14.01 Principles of Microeconomics, Fall 2007. MIT OpenCourseWare\n(http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nPage 6 of 7\n5. (29 points) Eric receives utility from days spent traveling on vacation domestically (D)\nand days spent traveling in a foreign country (F) as given by the utility U(D, F) = DF.\nThe price of a day spent traveling domestically is $160 and in a foreign country $200.\nEric's annual budget for traveling is $8,000.\n(a) (5 points) Find Eric's utility maximizing choice of days traveling domestically\nand in a foreign country. Find also his utility level from consuming that bundle.\nMRS = (∂U/∂D) / (∂U/∂F) = F/D\nPD / PF = 160/200\nO F = 4D/5\n160D + 200F = 8,000\nO D* = 25 F* = 20\nO U(25, 20) = 500\n(b) (6 points) Suppose that the price of domestic traveling increases to $250 per day.\nCalling his budget for traveling x, (suppose by now that it is unknown) find the\ndemand for D and F under the new prices as a function of x.\nMRS = (∂U/∂D) / (∂U/∂F) = F/D\nPD / PF = 250/200\nO F = 5D/4\n250D + 200 F = x\nO D* = x / 500\nO F* = x / 400\n(c) (4 points) Find the income necessary to make Eric reach the same utility level as\nbefore the price change.\nU(D*, F*) = [( x / 500)*( x / 400)] = 500\n⇒ x = √100,000,000 = 10,000\n(d) (2 points) Compute the quantities demanded with the new prices and the income\nyou found in section c.\nDc* = 10,000 / 500 = 20\nFc* = 10,000 / 400 = 25\n(e) (2 points) Compute the quantities demanded with the new prices and the original\nincome.\nD** = 8,000 / 500 = 16\nF** = 8,000 / 400 = 20\nCite as: William Wheaton, Chia-Hui Chen, Rongzhu Ke, Monica Martinez-Bravo, Marco Migueis, Peter Schnabl,\nand Hongliang Zhang, course materials for 14.01 Principles of Microeconomics, Fall 2007. MIT OpenCourseWare\n(http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nPage 7 of 7\n(f) (5 points) Using your previous answers tell us what is the total change in quantity\nof D due to the price increase in PD that the consumer experiences and what part\nof that change is due to income or substitution effects. Give definitions of what\nincome and substitution effects mean.\nInitial bundle: D* = 25 F* = 20\nFinal bundle: D** = 16 F** = 20\nCompensated bundle: Dc* = 20 Fc* =25\n⇒ Substitution effect 20-25 = -5\n⇒ Income effect 16 - 20 = -4\nWe can decompose the change in quantity generated by a price change in two\neffects. The substitution effect is the variation in quantity generated by a change\nin the price ratio but holding utility constant. The income effect is the remaining\nchange in quantity and is the result of the change in the purchasing power of the\nconsumer.\n(g) (5 points) Draw a graph showing the income and substitution effects you found.\nIE\nSE\nF\nD\nCite as: William Wheaton, Chia-Hui Chen, Rongzhu Ke, Monica Martinez-Bravo, Marco Migueis, Peter Schnabl,\nand Hongliang Zhang, course materials for 14.01 Principles of Microeconomics, Fall 2007. MIT OpenCourseWare\n(http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n14.01SC Principles of Microeconomics\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT14_01SCF11_soln02_f07.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-01sc-principles-of-microeconomics-fall-2011/e5d6665b225e91d204990b870efa40eb_MIT14_01SCF11_soln02_f07.pdf",
      "content": "Page 1 of 8\nMassachusetts Institute of Technology\nDepartment of Economics\n14.01 Principles of Microeconomics\nExam 2\nTuesday, November 6th, 2007\nLast Name (Please print): ______________\nFirst Name:\n__________________\nMIT ID Number:\n__________________\nInstructions. Please read carefully.\nThe exam has a total of 100 points. Answers should be as concise as possible.\nThis is a closed book exam. You are not allowed to use notes, equation sheets,\nbooks or any other aids. You are not allowed to use calculators. You must write\nyour answers in the space provided between questions. DO NOT attach\nadditional sheets of paper. This exam consists of (18) sheets (13 pages + 5 blank\npages for scratch work).\n0. Circle Your Section/Recitation (1 point):\nPlease circle the section or recitation which you are attending below. The marked\nexam will be returned to you, in the section or recitation that you indicate. You\nwill loose 1 point if you leave it unselected.\nS01: MWF9\n(Peter Schnabl)\nR01: F10 (Rongzhu Ke)\nS02: MWF10\n(Chia-Hui Chen)\nR02: F11 (Rongzhu Ke)\nS03: MWF11\n(Chia-Hui Chen)\nR03: F2\n(Rongzhu Ke)\nS04: MWF1\n(Monica Martinez-Bravo)\nR04: F12 (Marco Migueis)\n\nR05:\n\nF1\n\n(Marco\n\nMigueis)\n\nR06:\n\nF2\n\n(Marco\n\nMigueis)\n\nDO NOT WRITE IN THE AREA BELOW:\nQuestion 1 __/20\n\nQuestion 2 __/15\nQuestion 3 __/10\n\nQuestion 4 __/24\nQuestion 5 __/15\n\nQuestion 6 __/15\nQuestion 0 _/1\nTotal __/100\nCite as: William Wheaton, Chia-Hui Chen, Rongzhu Ke, Monica Martinez-Bravo, Marco Migueis, Peter Schnabl,\nand Hongliang Zhang, course materials for 14.01 Principles of Microeconomics, Fall 2007. MIT OpenCourseWare\n(http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nPage 2 of 8\n1. True/False Questions (TOTAL: 20 points):\nIn this section, write whether each statement is True or False. Please fully explain your\nanswer, using a diagram if appropriate. No credit will be given for an answer without an\nexplanation.\n(a) (5 points) As long as the marginal cost of production is greater than the average\nvariable cost, then the average variable cost is increasing.\nTrue. By the definition of the average variable cost, we can find that as long as\nMC\nAC , dAC > 0 .\n>\ndq\n(b) (5 points) In a perfectly competitive market with constant long run marginal cost, the\nconsumer will bear all the taxation burden.\nTrue. This is because the supply curve is a flat line, no matter what the demand is,\nsupply is inelastic.\n(c) (5 points) In a perfectly competitive market, firms take the market price as a given,\nwhich implies that the market demand is infinitely elastic.\nFalse. In a competitive market, firms are assumed to be very small, therefore they are\nassumed to have no influence on the market price - like if they faced an infinitely\nelastic demand at the market price level. Nevertheless, the market demand can be\nelastic or rigid.\n(d) (5 points) In an exchange economy, no individual will ever prefer a point inside the\nutility possibilities frontier to a point on the utility possibilities frontier.\nFalse. The points on the Pareto frontier are such that one cannot improve the situation\nof one individual without making someone else worse off - we can move to an interior\npoint and make one individual better off, just not the whole society.\nCite as: William Wheaton, Chia-Hui Chen, Rongzhu Ke, Monica Martinez-Bravo, Marco Migueis, Peter Schnabl,\nand Hongliang Zhang, course materials for 14.01 Principles of Microeconomics, Fall 2007. MIT OpenCourseWare\n(http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nPage 3 of 8\nLong Questions:\n2. (15 points) Ricardo produces widgets, using as inputs labor (L) and machines (K). His\nproduction function is given by the following equation:\nq = 10K2/3 + L1/2\n(a) (4 points) What type of returns to scale (increasing/constant/decreasing) does\nRicardo's production function exhibit?\nThe production function exhibits decreasing returns to scale:\nF(2K,2L) = 10(2K)2/3\n+ (2L)1/2 = 10*22/3K2/3\n+ 21/2L1/2 < 2*[10K2/3\n+\nL1/2]=2F(K,L)\nAt the end of last year, Ricardo bought his only machine for $1,000. He will use this\nmachine for 5 years, after which the machine will have no value. Ricardo will calculate\ndepreciation linearly (depreciation will be 20% of the total value of the machine per\nyear). This machine has no other use besides Ricardo's production of widgets, and, at this\nmoment, Ricardo cannot buy any more machines.\n(b) (4 points) What is Ricardo's annual fixed cost of production? Is the fixed cost\nsunk or not? Explain.\nFC = 0.2 * 1000 = 200\nAll the fixed cost is sunk, as Ricardo already paid it in the past and cannot\nrecover it. There is no opportunity cost, as the machine has no other use besides\nRicardo's production of widgets.\n(c) (4 points) What is Ricardo's demand for labor as a function of the quantity he\nwants to produce annually?\nq = 10 * 12/3 + L1/2\nLd\n⎧(q -10)\n2, if q ≥ 10\n= ⎨\n⎩\n0, if q < 10\n(d) (3 points) Assuming that wage equals 1, what is Ricardo's annual total cost\nfunction?\n⎧q 2 - 20q + 300, if q ≥ 10\nTC = ⎨\n⎩\n200, if q < 10\nCite as: William Wheaton, Chia-Hui Chen, Rongzhu Ke, Monica Martinez-Bravo, Marco Migueis, Peter Schnabl,\nand Hongliang Zhang, course materials for 14.01 Principles of Microeconomics, Fall 2007. MIT OpenCourseWare\n(http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nPage 4 of 8\n3. (10 points) Sally's firm produces granola bars with a fixed cost of 10 (this cost is\nalready sunk). Her variable cost function is VC = q2 + 2q.\n(a) (4 points) Assuming the market for granola bars is competitive, derive Sally's\nsupply function?\nSupply: P = MC ↔ P = 2qs + 2\n(b) (6 points) What is Sally's surplus if the market price is 6? What is her profit?\nDoes she want to stay in this market? Explain.\nIf P = 6, q = 2. Producer surplus = Revenue - Variable Costs = 12 - 8 = 4.\nProfit = Revenue - Total Costs = 12 - 10 - 8 = -6.\nSally would want to stay in the market, even though she makes a loss, as that will\nminimize her losses - she will be able to cover all her variable costs and still\nmake some extra money, which will lower the loss she would have due to her sunk\ncosts.\nCite as: William Wheaton, Chia-Hui Chen, Rongzhu Ke, Monica Martinez-Bravo, Marco Migueis, Peter Schnabl,\nand Hongliang Zhang, course materials for 14.01 Principles of Microeconomics, Fall 2007. MIT OpenCourseWare\n(http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nPage 5 of 8\n4. (24 points) Suppose the demand function for corn is Qd =10 -2 p , and supply\nfunction is Qs = 3p -5 . The government is concerned that the market equilibrium price\nof corn is too low and would like to implement a price support policy to protect the\nfarmers. By implementing the price support policy, the government sets a support price\nand purchases the extra supply at the support price. In this case, the government sets the\nsupport price ps = 4.\n(a) (4 points) Calculate the original market equilibrium price and quantity in\nabsence of the price support policy.\nThe original equilibrium price is p0 = 3. And the equilibrium quantity is 4.\n(b) (3 points) At the support price ps = 4 , find the quantity supplied by the farmers,\nthe quantity demanded by the market, and the quantity purchased by the\ngovernment.\nWhen the price is\nps = 4 , the demand is 2, and supply will be 7, so the\ngovernment need to buy 5.\n(c) (3 points) Draw a diagram to show the change in the producer surplus due to the\nimplementation of the price support policy. Calculate the change in the producer\nsurplus.\nThe producer's gain is\n\n1 7\n4) =\n×\n-\n(7 -\nWhich is area A+B+D in the following graph.\n(d) (3 points) Draw a diagram to show the change in the consumer surplus due to\nthe implementation of the price support policy. Calculate the change in the\nconsumer surplus.\nThe loss to consumer is 2(4 -3) + (4 -2)(4 -3) / 2 = 3, which is area A+B in\nthe following graph.\nCite as: William Wheaton, Chia-Hui Chen, Rongzhu Ke, Monica Martinez-Bravo, Marco Migueis, Peter Schnabl,\nand Hongliang Zhang, course materials for 14.01 Principles of Microeconomics, Fall 2007. MIT OpenCourseWare\n(http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nPage 6 of 8\np0=3\nps=4\np\nA\nB\nD\nq\nGov's purchase\n(e) (3 points) Calculate the cost to the government to implement the price support\npolicy. Draw a diagram to show the government cost.\nCost to the government: PsQg=20, which is the rectangle area indicated in the\nabove graph by Gov's purchase*price.\n(f)\n(8 points) Suppose now the government switches from price support policy to\nsubsidy policy. For each unit of corn produced, the government subsidizes the\nfarmer\ns =\n. Find the new equilibrium price under this subsidy policy. How\nmuch money will the government have to spend in order to implement this\nsubsidy policy?\nUnder subsidy\ns =\n, the suppliers face the price\npb +\n, and the consumers\nface the price pb , thus,\n10 2\n3(\n) 5\nb\nb\np\np\ns\n-\n=\n+\n-\nThis implies\npb =\nThe new amount of supply is\n10 2\nb\nQ\np\n=\n-\n=\n, which is the amount that the\ngovernment needs to subsidize. The government's total budget is\nsQ =\n.\nCite as: William Wheaton, Chia-Hui Chen, Rongzhu Ke, Monica Martinez-Bravo, Marco Migueis, Peter Schnabl,\nand Hongliang Zhang, course materials for 14.01 Principles of Microeconomics, Fall 2007. MIT OpenCourseWare\n(http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nPage 7 of 8\n5. (15 points) Molly's company produces knee warmers according to the following\nproduction function:\nq = (K-8)1/4L1/4\n(a) (4 points) Assuming that the unit cost of capital (r) and the unit wage (w) are both\nequal to 1, derive Molly's demand for inputs--capital and labor, respectively--as\na function of her choice of output (q).\nCost minimization will lead to the following two conditions:\n⎧\nK - 8\n⎧ Ld = q 2\n⎪\n=\n⎨\nL\n1/ 1\n1/ 4\n⇔⎨K d = 8 + q 2\n⎪\n⎩\n⎩q = (K - 8) L\n(b) (2 points) Show that Molly's long run total cost function is given by C(q) = 8 +\n2q2.\nC(q) = C(Kd,Ld)=8 + 2q2\nThe demand for knee warmers is given by P = 40 - Qd. There are no costs of entry or exit\nfor a firm on the market for knee warmers. Any firm in this market will have access to\nthe same technology as Molly.\n(c) (6 points) What will the price be in the long run in this market? How much will\neach firm produce in this market in the long run.\nIn the long run, P = Min LAC\nMin LAC: LAC = LMC\n8/q + 2q = 4q\nqMin LAC = 2\nPrice in the long run = Min LAC = 8\n(d) (3 points) How many firms will there be in this market in the long run?\nIf Price = 8, looking at the demand function, we see that Q = 32, which implies\nthat on the long run, we will have 16 firms in this market.\nCite as: William Wheaton, Chia-Hui Chen, Rongzhu Ke, Monica Martinez-Bravo, Marco Migueis, Peter Schnabl,\nand Hongliang Zhang, course materials for 14.01 Principles of Microeconomics, Fall 2007. MIT OpenCourseWare\n(http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nPage 8 of 8\n6. (15 points) Consider a two person economy consisting of Ann and Bob only. Both of\nthem only consume x and y. Ann's utility over these two goods is U A (xA , y A ) = xA y A\nand Bob's utility is U B (xB , yB ) = xB\n2 yB . Initially, Ann is endowed with 9 units of x ,\nzero units of y , and Bob is endowed with 6 units of y, zero units of x .\n(a) (2 points) Write Ann's marginal rate of substitution in terms of xA and yA and\nBob's marginal rate of substitution in terms of xB and yB .\nMRS A = MU x = yA\nMU y\n2xA\nMRS B = MU x = 2yB\nMU y\nxB\n(b) (5 points) Derive the equation for the contract curve.\nLet MRSA = MRSB , we have\nyA = 2yB = 2(6\n\n- yA )\n2xA\nxB\n9 - xA\nthus\ny A = 24xA = 3\n+\nx\nx\nA\nA\n; alternatively, one can write\n9 + 3xA\n2yB = 6 - yB\nthus yB = 2xB\nxB\n2(9 - xB )\n12 - xB\n(c) (8 points) Find the general equilibrium allocation of x and y among Ann and Bob\nof the above economy\nFor Ann, her utility maximization problem is\nmax xA yB\ns.t. xA + py A = 9\nit's ready to give the solution x ∗\nA = 3 ;\nFor Bob, his utility maximization problem is\nmax xB yB\ns.t. xB + pyB = 6 p\nthis gives the solution yB\n∗= 2 ;\nThus the final solution for this is:\n∗\n∗\n∗\n∗\nxA = 3; yA = 4; xB = 6, yB = 2; p = 2\nCite as: William Wheaton, Chia-Hui Chen, Rongzhu Ke, Monica Martinez-Bravo, Marco Migueis, Peter Schnabl,\nand Hongliang Zhang, course materials for 14.01 Principles of Microeconomics, Fall 2007. MIT OpenCourseWare\n(http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n14.01SC Principles of Microeconomics\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT14_01SCF11_graph02.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-01sc-principles-of-microeconomics-fall-2011/ce03508ea91bf5d93423cb299bab5421_MIT14_01SCF11_graph02.pdf",
      "content": "Figure 2-1: Pork market equilibrium\np, $ per kg\nS\nD\ne\nQ, Million kg of pork per year\n\nFigure 2-2: Impact of a demand shift\np, $ per kg\nS\nD1\nD2\ne1\ne2\n$3.50\n$3.00\n220 228\nExcess demand = 12\nQ, Million kg of pork per year\n\nFigure 2-3: Impact of a supply shift\np, $ per kg\nS1\nD\nS2\ne2\ne\n$3.55\n$3.00\n205 215 220\nExcess demand = 15\nQ, Million kg of pork per year\n\nFigure 2-4: Labor market equilibrium\nw, Wages per hour\nS\nD\ne\nL*\nW*\nL, Hours worked per year\n\nw, Wages per hour\nS\nD\ne\nLd\nL*\nLs\nW*\nW\nMinimum wage, price floor\nUnemployment\nL, hours worked per year\nFigure 2-5: Labor market with\nminimum wage\n\np, $ per gallon\nD\ne\nS2\nS1\nQs\nQ2\nQ1 = Qd\np1 = p\np2\ne2\nFigure 2-6: Gasoline price cap\nExcess demand\nQ, Gallons of gasoline per month\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\n14.01SC Principles of Microeconomics\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT14_01SCF11_graph03.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-01sc-principles-of-microeconomics-fall-2011/a672f1a9ca56a6b05caa742c7915bc2d_MIT14_01SCF11_graph03.pdf",
      "content": "Figure 3-1: Market equilibrium with supply shift\nS2\ne1\nS1\ne2\nP2\nP1\nD\nQ2\nQ1\nQ\nP\n\nFigure 3-2: Perfectly inelastic demand\nS2\nD\nS1\ne2\nP2\nP1\ne1\nQ\nQ\nP\n\nFigure 3-3: Perfectly elastic demand\nS2\ne1\nS1\ne2\np\nD\nQ2\nQ1\nQ\nP\n\nFigure 3-4: Supply and demand shifts\np, $ per kg\nP2\nP1\ne1\nD2\nS2\nS1\ne2\ne2'\nD1\nQ2\nQ1\nQ2'\nQ, Million kg of pork per year\n\np, $ per kg\n\nFigure 3-5: Impact of a producer tax\nS1\ne1\nS2\ne2\np1 = 4.00\np2 = 3.30\np2 - τ = 2.95\nD\nQ2 = 206\nQ1 = 220\nQ, Million kg of pork per year\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n14.01SC Principles of Microeconomics\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT14_01SCF11_graph04.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-01sc-principles-of-microeconomics-fall-2011/cf538695601bcc7002d56b83b00ff91e_MIT14_01SCF11_graph04.pdf",
      "content": "Figure 4-1a: Pizza/movie preferences\nPizza\nC\nB\nA\nMovies\n\nFigure 4-1b: Indifference curves\nA\nC\nB\nPizza\nMovies\n\nFigure 4-2: Upward-sloping indifference\ncurve\nPizza\nMovies\n\nUtility\nMovies\nFigure 4-4: Diminishing marginal utility\n\nFigure 4-5: Diminishing marginal utility for U\n= sqrt(P*M)\nMarginal utility\n(1, 1.4)\n(2, .6)\n(3, .45)\n(4, .38)\nMovies\n\nFigure 4-6: Indifference curve and MRS\nPizza\n(2,2)\n(4,1)\n(1,4)\nMovies\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n14.01SC Principles of Microeconomics\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT14_01SCF11_graph05.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-01sc-principles-of-microeconomics-fall-2011/c636ae76a2d35d9f05e3345286cce3b0_MIT14_01SCF11_graph05.pdf",
      "content": "Figure 5-1: Budget constraint\n16P + 8M = 96\nPizz\na\n24P + 8M = 96\nMovies\nBC1\nBC2\n\nFigure 5-2: Increase in the price of pizza\nMovies\nPizza\n24P + 8M = 96\n16P + 8M = 96\nBC2\nBC1\n\nFigure 5-3: Decrease in income\nMovies\nPizza\n16P + 8M = 80\nBC2\nBC1\n16P + 8M = 96\n\nFigure 5-4: Budget constraint and\nindifference curves\nA (2, 5)\nD (6, 3)\nB (10, 1)\nM\nP\nI1\nI2\nI3\nI4\nE (8, 4)\nBudget constraint: 8M + 16C = 96\nC (4.5, 2.2)\nBudget line\n\nFigure 5-5: Corner solution\nBudget line\nM\nI1\nI2\nI3\nP\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n14.01SC Principles of Microeconomics\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT14_01SCF11_graph06.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-01sc-principles-of-microeconomics-fall-2011/f90025ff5e764c159e7ba8698ff9fac5_MIT14_01SCF11_graph06.pdf",
      "content": "Figure 6-1: Food stamps versus cash\nAll\nother\ngoods\nx2\nx1\ny1\ny2\nx3\nI4\nI3\nI2\nI0\nI1\nBudget line with cash\nOriginal\nbudget\nline\nBudget line with food stamps\nFood\n\nFigure 6-2: Drawing a demand curve\nB (4, 3)\nA (6, 3)\nC (8, 3)\nM\nBC2\nBC1\nBC3\nP\n\nB\nPM\nA\nC\nDemand for M\nM\n\nFigure 6-3: Generating an Engel curve\nP\nM\nBC2\nBC1\nBC3\nB (8, 4)\nA (6, 3)\nC (4, 2)\n\nC\nA\nB\nDemand curves for M\nM\nPM\n\nIncome (y)\nC\nA\nB\nEngel curve for M\nM\n\nFigure 6-4 and 7-1: Income and\nsubstitution effect for a normal good\nPizzas\nC\nB\nA\nBC2\nBC3\nBC1\nMovies (M)\n4.89\nIncome effect Substitution effect\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n14.01SC Principles of Microeconomics\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT14_01SCF11_graph07.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-01sc-principles-of-microeconomics-fall-2011/d272b420c0171f47cd3edcb5b9cab225_MIT14_01SCF11_graph07.pdf",
      "content": "Figure 6-4 and 7-1: Income and\nsubstitution effect\nC\n4.89\nMovies (M)\nB\nBC2\nBC1\nBC*\nA\nPizza (P)\nIncome effect Substitution effect\n\nFigure 7-2: Price change with an inferior good\n1.4\n8.3\n3.3\nB\nA\nC\nBC2\nBC3\nBC1\nP\nS\nSubstitution effect\nInc. effect Total effect\n\nFigure 7-3: Labor - leisure trade-off\n24w\nBC\nLeisure\nWork\nSlope of budget constraint = -w\nGoods\n(Price of goods = 1)\n\nN2 N3\nN1\nC2\nC3\nC\nC1\nBC1\nBC2\nBC*\nA\nB\nIncome effect\nSubstitution effect\nLeisure\nWork\nGoods\nFigure 7-4: Income and substitution\neffects for labor supply: income effect\ndoes not dominate\n\nFigure 7-5: Income and substitution effects\nfor labor supply: income effect dominates\nN2\nN3\nN1\nC2\nC3\nC\nC1\nBC1\nBC2\nBC*\nA\nB\nIncome effect\nSubstitution effect\nLeisure\nWork\nGoods\n\nConsumer's Decision\nBC1\nBC2\nLeisure\n8W1\n24W1\n12W2\nB\n24W2\nGoods\nA\n\nFigure 7.6:\nDeriving\nleisure\ndemand and\nlabor supply\n\nFigure 7.6: Deriving leisure\ndemand and labor supply\nW2\nWage\nW1\nLeisure\nDemand for Leisure\n\nSupply of labor\nWage\nW2\nW1\nLabor\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n14.01SC Principles of Microeconomics\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT14_01SCF11_graph08.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-01sc-principles-of-microeconomics-fall-2011/9c9d589299d8607ab57b829d8117e655_MIT14_01SCF11_graph08.pdf",
      "content": "K\nq = sqrt(K*L)\nL\nFigure 8-3: Isoquants\n\nFigure 8-4a: Perfectly substitutable inputs\nK\nL\n\nK\nL\nFigure 8-4b: Non-substitutable inputs\n\nFigure 8-5: Isoquants and MRTS\nK\nL\nA\nB\nC\n(1,4)\n(2,2)\n(4,1)\nMRTS = -2\nMRTS = -1/2\n\n6‐7\nFigure 8-6a: Isoquants and constant returns to scale\nElectronics and Equipment: Constant Returns to Scale\nK, Units of Capital per year\nIsoquant\ns and co\nnstant returns to scale.\nL, Units of Labor Per Year\nImage by MIT OpenCourseWare.\n\nFigure 8-6b: Isoquants with increasing and\ndecreasing returns to scale\nTobacco: Decreasing Returns to Scale\nPrimary Metal: Increasing Returns to Scale\nIsoquants with increasing and\ndecr\neasin\ng return\ns to sca\nle.\nL, Units of labor per year\nL, Units of labor per year\nImages by MIT OpenCourseWare.\n6‐8\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n14.01SC Principles of Microeconomics\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT14_01SCF11_graph08a.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-01sc-principles-of-microeconomics-fall-2011/2cd9a13ca8ccbc9c6bb19c713bf52fc1_MIT14_01SCF11_graph08a.pdf",
      "content": "Figure 8-1: Rice export quotas in Vietnam\nQuota\nSv\nPr\nPw\nPv\nDw\nDv\nQv\nQw\nQr\n\nFigure 8-2: Child labor in Vietnam\nW\nS2\nS1\nW3\nW2\nW*\nW1\nD2\nS3\nD1\nL3\nL1\nL2\nL*\nL\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n14.01SC Principles of Microeconomics\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT14_01SCF11_graph09.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-01sc-principles-of-microeconomics-fall-2011/1ef458b02967425a924134a2668e08c5_MIT14_01SCF11_graph09.pdf",
      "content": "Figure 9.1: Isocost Lines\nIsoc\nost\nlin\nes.\nImage by MIT OpenCourseWare.\n\nFigure 9-2: Cost Minimization\n\n7-2\nCost minimiza\ntion.\nImage by MIT OpenCourseWare.\n\nFigure 9-3: Cost Minimization with an increase in\nwages\n\n7-3\nC\no\nst Minimizati\non with an inc\nrease in wa\nges.\nImage by MIT OpenCourseWare.\n\nFigure 9-4a: Long-run expansion path (linear)\nLong-run expa\nnsion path\n(linear).\nImage by MIT OpenCourseWare.\n\nFigure 9-4b: Long-run expansion path:\ncapital becomes less productive\nK, Units of capital per year\nExpansion path\nL, Units of labor per year\n\nFigure 9-4c: Long-run expansion path:\nlabor becomes less productive\nk, Units of capital per year\nExpansion path\nL, Units of labor per year\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n14.01SC Principles of Microeconomics\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT14_01SCF11_graph10.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-01sc-principles-of-microeconomics-fall-2011/f9add6bcf120f0c6298dd7ae3dcb5297_MIT14_01SCF11_graph10.pdf",
      "content": "Figure 10-1: Supply shift with perfectly\nelastic demand\np\nP\nq2\ne2\ne1\nS2\nS1\nD\nq1\nQ\n\nFigure 10-2a: Revenues and costs\n$\nQ\nπ\nC\nR\n\nFigure 10-2b: Profit maximization\nπ\nπ max\nQ\n\nFigure 10-3: Cost curves for C=10+.5q^2\nA\nAC\nMC\nAVC\np=6\nB\nAFC\nq\nC\n\nFigure 10-4: Cost curves with tax\nC\nq\nB\nA\nC\nD\nMC + t\nAC + t\nAC\np=6\nMC\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n14.01SC Principles of Microeconomics\nFall 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT14_01SCF11_assn01.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-01sc-principles-of-microeconomics-fall-2011/cb13186677565efb1dc58bd9e91f947b_MIT14_01SCF11_assn01.pdf",
      "content": "14.01 Fall 2010\nProblem Set 1\n1. (25 points) For each of the following scenarios, use a supply and demand diagram to illustrate the effect\nof the given shock on the equilibrium price and quantity in the specified competitive market. Explain\nwhether there is a shift in the demand curve, the supply curve, or neither.\n(a) (5 points) An unexpected temporary heat wave hits the East Coast. Show the effect in the ice\ncream market in New England.\n(b) (5 points) The government introduces a tax on ice cream which is paid by producers. What is the\neffect in the ice cream market?\n(c) (5 points) China and Mexico are major producers of textiles. Workers in Mexico decide to go on\nstrike. Show the effect on the market for Mexican textiles.\n(d) (5 points) Show the effect of the situation described in (c) on the market for Chinese textiles.\n(e) (5 points) Suppose the government imposes a price cap on bottled water. Show the effect in the\nbottled water market.\nProblem 1 courtesy of William Wheaton. Used with permission.\n2. (20 points) For each of the following pairs of goods, identify which one you would expect to have more\nown-price elastic demand. Please explain your reasoning.\n(a) (5 points) Computers (generally) vs. Apple MacBook Pro laptops.\n(b) (5 points) Stereo headphones (generally) vs. hearing aids.\nFor each of the following goods, identify whether you would expect demand to be more (own-price)\nelastic in the short run or the long run. As above, please briefly explain your reasoning.\n(c) (5 points) Retail gasoline in the suburbs of Chicago.\n(d) (5 points) Air conditioning units in Miami Beach, Florida.\nProblem 2 courtesy of Luke Stein. Used with permission.\n3. (30 points) Consider the market for apple juice. In this market, the supply curve is given by QS =\n10PJ - 5PA and the demand curve is given by QD = 100 - 15PJ + 10PT , where J denotes apple juice,\nA denotes apples, and T denotes tea.\n(a) (7 points) Assume that PA is fixed at $1 and PT = 5. Calculate the equilibrium price and quantity\nin the apple juice market.\n(b) (7 points) Suppose that a poor harvest season raises the price of apples to PA = 2. Find the new\nequilibrium price and quantity of apple juice. Draw a graph to illustrate your answer.\n(c) (8 points) Suppose PA = 1 but the price of tea drops to PT = 3. Find the new equilibrium price\nand quantity of apple juice.\n(d) (8 points) Suppose PA = 1, PT = 5, and there is a price ceiling on apple juice of P ∗ = 5. What is\nJ\nthe excess demand for apple juice as a result? Draw a graph to illustrate your answer.\nProblem 3 courtesy of William Wheaton. Used with permission.\n4. (25 points) You have been asked to analyze the market for steel. From public sources, you are able to\nfind that last year's price for steel was $20 per ton. At this price, 100 million tons were sold on the\nworld market. From trade association data you are able to obtain estimates for the own price elasticities\nof demand and supply on the world markets as -0.25 for demand and 0.5 for supply. Assume that\nsteel has linear demand and supply curves throughout.\n(a) (10 points) Solve for the equations of demand and supply in this market and sketch the demand\nand supply curves.\n\n(b) (15 points) Suppose that you discover that the current price of steel is $15 per ton and the current\nlevel of worldwide sales of steel is 150 million tons. The most recent elasticity estimates from the\ntrade association this year are -0.125 for demand and 0.25 for supply. Describe the change in\nthe supply and demand curves over the past year using your diagram from part (a). What sort of\nevent(s) might explain the change?\nProblem 4 courtesy of Luke Stein. Used with permission.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n14.01SC Principles of Microeconomics\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT14_01SCF11_assn02.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-01sc-principles-of-microeconomics-fall-2011/d3c8fbeaf7f9c0e225b378eeed5983f3_MIT14_01SCF11_assn02.pdf",
      "content": "14.01 Fall 2010\nProblem Set 2\n1. (10 points) Annie and David are painting their apartment. At the paint store, David says he prefers\nCanary Yellow to Bumblebee Yellow, Lime Yellow, and Crayola Yellow. Annie finds new paint samples\nand asks David to compare Canary Yellow to School Bus Yellow and to Sunrise Yellow. David prefers\nSunrise Yellow to Canary Yellow, and prefers School Bus Yellow to Canary Yellow. He also prefers\nSunrise Yellow to School Bus Yellow. The store is out of Sunrise Yellow, so they buy School Bus Yellow\nand paint their apartment with it. David then insists that they go back, buy Lime Yellow, and repaint\nthe apartment.\nTrue/False/Uncertain: David has rational preferences (as we define them).\nProblem 1 courtesy of William Wheaton. Used with permission.\n2. (20 points) In each of the following examples, a consumer purchases just two goods: x and y. Based on\nthe information in each of the following parts, sketch a plausible set of indifference curves (that is, draw\nat least two curves on a set of labeled axes, and indicate the direction of higher utility). Also, write\ndown a utility function u(x, y) consistent with your graph. Note that although all these preferences\nshould be assumed to be complete and transitive (as required for utility representation), not all will be\nmonotone.\n(a) (4 points) Jessica enjoys bagels x and coffee y, and consuming more of one makes consuming the\nother more enjoyable.\n(b) (4 points) Plamen loves mocha swirl ice cream x, but he hates mushrooms y.\n(c) (4 points) Jennifer likes Cheerios x, and neither likes nor dislikes Frosted Flakes y.\n(d) (4 points) Edward always buys three white tank tops x for every pair of jeans y.\n(e) (4 points) Nancy likes both peanut butter x and jelly y, and always gets the same additional\nsatisfaction from an ounce of peanut butter as she does from two ounces of jelly.\n3. (20 points) A consumer's preferences are representable by the following utility function:\nu(x, y) = x + y.\n(a) (10 points) Obtain the MRS of the consumer at an arbitrary point ( x, y ), where x > 0 and y > 0.\n(b) (10 points) Suppose the price of the second good (y) is 1, and the price of the first good (x) is\ndenoted by p > 0. If the consumer's income is m > 0, obtain the optimal consumption bundle of\nthe consumer (in terms of m and p). [Caution: make sure you cover cases in which m is relatively\nlow, as well as cases in which m is relatively high.]\n4. (25 points) It is exactly 24 hours before Lauren's physics final. She has an economics final directly after\nthe physics final and has no time to study in between. Lauren wants to be a physicist, so she places\nmore weight on her physics test score. Her utility function is given by\nu(p, e) = 0.6 ln(p) + 0.4 ln(e)\nwhere p is the score on the physics final and e is the score on the economics final. Although she cares\nmore about physics, she is better at economics; for each hour spent studying economics she will increase\nher score by 3 points, but her physics score will only increase by 2 points for every hour spent studying\nphysics. Studying zero hours results in a score of zero on both subjects (although ln(0) is not defined,\nassume her utility for a score of zero is negative infinity).\n(a) (5 points) What constraints does Lauren face in her test score maximization problem?\n(b) (5 points) How many hours should Lauren optimally spend studying physics? How many hours\nstudying economics? (hours are divisible)\n∗\n(c) (5 points) What economics and physics test scores will she achieve (i.e. what are e and p ∗)?\n(d) (5 points) What utility level will she achieve?\n\n(e) (5 points) Suppose Lauren can get an economics tutor. If she goes to the tutor, she will increase\nher economics test score by 5 points for every hour spent studying instead of 3 points, but will\nlose 4 hours of study time by going to the tutor. She cannot study while at the tutor, and going\nto the tutor does not directly improve her test score. Should Lauren go to the tutor?\nProblem 4 courtesy of William Wheaton. Used with permission.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n14.01SC Principles of Microeconomics\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT14_01SCF11_assn03.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-01sc-principles-of-microeconomics-fall-2011/5abef939c84d158ab052e37a91fc8880_MIT14_01SCF11_assn03.pdf",
      "content": "14.01 Fall 2010\nProblem Set 3\n1. (12 points) Assume the government has two policy options, a cash grant of $200 and providing food\nstamps worth $200.\n(a) (3 points) Draw the budget constraint faced by the consumer in each of these two situations.\n(b) (3 points) Now, draw a set of indifference curves that corresponds to an individual who would be\nindifferent between these two policies.\n(c) (3 points) Next, draw a set of indifference curves corresponding to an individual who would prefer\nto have a cash grant rather than food stamps.\n(d) (3 points) Is there a consumer who strictly prefers food stamps to cash grants (i.e., is better off\nwith food stamps rather than a cash grant?) Why does the government use food stamps?\nProblem 1 by MIT OpenCourseWare.\n2. (22 points) Suppose there are exactly two consumers (Albie and Bubbie) who demand strawberries.\nSuppose that Albie's demand for strawberries is given by\nqa(p) = p αfa(Ia)\nand Bubbie's demand is given by\nqb(p) = p β fb(Ib)\nwhere Ia and Ib are Albie and Bubbie's incomes, and fa(·) and fb(·) are two unknown functions.\n(a) (5 points) Find Albie and Bubbie's (own-price) elasticities of demand, qa,p and qb,p. Use the sign\n∂y x\nconvention that y,x = ∂x y .\n(b) (5 points) Suppose that α > 0 > β. Are strawberries a Giffen good for Albie? Are strawberries a\nGiffen good for Bubbie?\n(c) (12 points) Are strawberries an inferior good for Albie? Are strawberries an inferior good for Bub\nbie? Assume that these demands arise from utility maximization, given linear budget constraints.\nHint: This question should not require much/any algebra beyond (b).\n3. (24 points) Joe considers beer and soda to be perfect substitutes at a rate of 1:2, that is, he always\nreceives the same utility if he has one beer or two sodas to drink. He spends $12 a day on drinks, and\nbeers cost $3 while sodas cost $1 each. However, one day the price of beers decreases to $2; there is no\nchange in his budget.\n(a) (6 points) How does consumption change when the price of beers changes? What is Joe's new\nlevel of utility?\n(b) (6 points) Show with the aid of a graph what happens to the optimal allocation and the level of\nutility when the price of beer changes.\n(c) (6 points) How much must Joe's budget decrease to return him to the original utility level?\n(d) (6 points) Now assume the price of beers returns to the original price of $3. Describe the demand\ncurve for soda holding the price of beer and income constant; a graphic representation is optional.\nProblem 3 by MIT OpenCourseWare.\n4. (42 points) Xiaoyu spends all her income on statistical software (S) and clothes (C). Her preferences\ncan be represented by the utility function: U(S, C) = 4 ln(S) + 6 ln(C).\n(a) (6 points) Compute the marginal rate of substitution of software for clothes. Is the MRS increasing\nor decreasing in S? How do we interpret this?\n(b) (6 points) Find Xiaoyu's demand functions for software and clothes, QS (pS , pC , I) and QC (pS , pC , I),\nin terms of the price of software (pS ), the price of clothes (pC ), and Xiaoyu's income (I).\n\n(c) (6 points) Draw the Engel curve for software.\n(d) (6 points) Suppose that the price of software is pS = 2, the price of clothes is pC = 3, and Xiaoyu's\nincome is I = 10. What bundle of software and clothes (S, C) maximizes Xiaoyu's utility?\n(e) (6 points) Suppose the price of software increases to pS = 4. What bundle of software and clothes\ndoes Xiaoyu demand now?\n(f) (6 points) Given the price increase, how much income does Xiaoyu need to remain as happy (have\nthe same utility) as she was before the price change? What bundle of software and clothes would\nXiaoyu consume if she had that additional income, given the new prices?\n(g) (6 points) Going back to the situation in part (e) (pS = 4 and I = 10), decompose the total change\nof software and clothes demanded into substitution and income effects. In a clearly-labeled diagram\nwith software on the horizontal axis, show the income and substitution effects of the increase in\nthe price of software.\nProblem 4 courtesy of William Wheaton. Used with permission.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n14.01SC Principles of Microeconomics\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT14_01SCF11_assn04.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-01sc-principles-of-microeconomics-fall-2011/ad3334b81b1ae8f429ec09f4d4a1daa4_MIT14_01SCF11_assn04.pdf",
      "content": "(\n14.01 Fall 2010\nProblem Set 4\n1. (27 points) For each of the following production functions, sketch a representative isoquant (2 points).\nCalculate the marginal product for each input, and indicate whether each marginal product is dimin\nishing, constant, or increasing (3 points). Calculate the marginal rate of technical substitution for each\nfunction (2 points). Also indicate whether the function exhibits constant, increasing, or diminishing\nreturns to scale (2 points).\n(a) F (L, K) = LK3\n(b) F (L, K) = L + 3K\n(c) F (L, K) = (min{L, K})\n2. (21 points) Consider the production function f(L, K) = 2L 4 K 4 .\n(a) (15 points) Find the associated (long run) total, average, and marginal cost curves.\n(b) (6 points) Sketch the total, average, and marginal cost curves.\n3. Problem removed due to copyright restrictions. This content is presented in audio form in the Solution\nVideo for Problem Set 4, Problem 3.\n4. (28 points) You run a cost-minimizing firm with production function f(L, K) = [min{L, K}]\nL is labor and K is capital. Assume that you are a price-taker in the input markets: you pay w for\n3 , where\neach unit of labor you hire and r for each unit of capital (where w and r are set exogenously), and face\nno costs other than those from labor and capital.\n(a) (15 points) Assuming that you can freely choose both labor and capital (i.e., the \"long run prob\nlem\"), derive expressions for your cost-minimizing conditional input demands, L∗(r, w, Q) and\nK∗(r, w, Q). Confirm that the conditional input demand functions are \"homogeneous of degree\nzero\" in w and r; that is,\nL∗(tr, tw, Q) = L∗(r, w, Q)\nfor all t > 0\nK∗(tr, tw, Q) = K∗(r, w, Q)\n(b) (8 points) What will happen to your conditional demand for labor if there is an increase in the\nwage rate, assuming that r and Q remain the same? Explain in one sentence why your answer\nmakes intuitive sense.\n(c) (5 points) Use your answers from (a) to write down an expression for your total cost function\nTC(r, w, Q). Is this function \"homogeneous of degree one\" in w and r; that is, does TC(tr, tw, Q) =\nt · TC(r, w, Q)?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n14.01SC Principles of Microeconomics\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT14_01SCF11_assn05.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-01sc-principles-of-microeconomics-fall-2011/9f32f98042155acee14de27b8a41b130_MIT14_01SCF11_assn05.pdf",
      "content": "14.01 Fall 2010\nProblem Set 5\n1. (24 points) You manage a factory that produces cans of peanut butter. The current market price is\n$10/can, and you know the following about your costs:\nMC(5) = 10,\nATC(5) = 6\nMC(4) = 4,\nATC(4) = 4\n(a) (8 points) A case of food poisoning breaks out due to your peanut butter, and you lose a lawsuit\nagainst your company. As punishment, Judge Judy decides to take away all of your profits, and\nconsiders the following two options to be equivalent:\ni. Pay a lump sum in the amount of your profits.\n∗\nii. Impose a tax of $[P - AT C(q ∗)] per can, since that is your current profit per can, where q\nis the profit maximizing output before the lawsuit.\nExplain briefly why she is right or wrong.\n(b) (8 points) Judge Judy gives you the option of choosing either plan. Which plan would you choose?\nProvide intuition. Hint: a clear diagram may be helpful.\n(c) (8 points) In the following year, you finally pay off the court ordered amount and everything\nreturns to normal. However, an employee tells you that at current levels of production, actual\ncosts are double what you initially thought. After carefully looking at the cost information, you\ndecide to continue producing the exact same amount. Could you still be maximizing profits?\nProblem 1 courtesy of Edward Cho. Used with permission.\n2. (32 points) Some questions about short-term and long-term costs:\n(a) (8 points) What is the relationship between the long-run average cost curve and the short-run\naverage cost curve? Please show graphically.\n(b) (8 points) What algebraic condition describes a firm that is at an output level that maximizes its\nprofits, given its capital in the short-term?\n(c) (8 points) What two algebraic conditions describe a firm that is at a capital level that minimizes\nits costs in the long-term?\n(d) (8 points) If a firm is characterized by short-run marginal cost that is greater than long-run\nmarginal cost and short-run average cost greater than long-run average cost, how should it change\nits capital level in the long-run to minimize costs?\nProblem 2 by MIT OpenCourseWare.\n3. (6 points) Suppose, in the short run, the output of widgets is supplied by 100 identical competitive\nfirms, each having a cost function:\ncs(y) = 1 y 3 + 2\nThe demand for widgets is given by:\ny d(p) = 6400/p\n(a) (3 points) Obtain the short run industry supply function for widgets.\n(b) (3 points) Obtain the short run equilibrium price of widgets, and the output of widgets supplied\nby each firm.\n4. (22 points) Sebastian owns a coffee factory in Argentina. His production function is:\nF (K, L) = (K - 1)\n4 L 4\nConsider the cost of capital to be r and the wage to be w. Both inputs are variable, and Sebastian\nfaces no fixed costs.\n\n(a) (2 points) What is the MRT S of labor for capital?\n(b) (5 points) What are Sebastian's input demands, conditional on the quantity (q) he wants to\nproduce? [Hint: Treat w and r as parameters.]\n(c) (3 points) Show that Sebastian's long run cost function is C(q) = r + 2(wr) 2\n1 q .\n(d) (5 points) What is the supply function of Sebastian's firm?\nConsider now that r = 4, w = 1, and that the market demand for coffee is Qd = 20 - P . There are 7\nother companies operating in this market, all with cost structures identical to Sebastian's company.\n(e) (6 points) What is the aggregate supply in this market?\n(f) (6 points) Calculate the equilibrium price, aggregate quantity sold, quantity sold by each firm,\nand economic profit of each firm.\n(g) (5 points) Can this be a long run equilibrium? Why? How will the supply side of the market\nadjust in the long run?\n(h) (6 points) What is going to be the price in the long run? How many firms will be present in this\nmarket in the long run? How much will each firm produce?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n14.01SC Principles of Microeconomics\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT14_01SCF11_assn06.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-01sc-principles-of-microeconomics-fall-2011/bfd02c40de05ca327f4b93745ccfa049_MIT14_01SCF11_assn06.pdf",
      "content": "14.01 Fall 2010\nProblem Set 6\n1. (10 points) In Cambridge, shoppers can buy apples from two sources: a local orchard, and a store that\nships apples from out of state. The orchard can produce up to 50 apples per day at a constant marginal\ncost of 25¢ per apple. The store can supply any remaining apples demanded, at a constant marginal\ncost of 75¢ per unit. When apples cost 75¢ per apple, the residents of Cambridge buy 150 apples in a\nday.\n(a) (5 points) Draw the marginal cost curve of apple production in Cambridge.\n(b) (5 points) Assume that the city of Cambridge sets the price of apples within its borders. What\nprice should it set, and should the price vary depending on where you purchase your apples?\nProblem 1 by MIT OpenCourseWare.\n2. (20 points) Tariffs are usually imposed in order to decrease imports, but they don't always have the\nsame effect. Please draw graphs that demonstrate how shifts in the domestic supply curve for a product\nsubject to a tariff could result in the following scenarios.\n(a) (10 points) No imports at all of that product.\n(b) (10 points) The country becoming an exporter of that product.\nProblem 2 by MIT OpenCourseWare.\n3. (35 points) (Suggestion: It may be helpful to read section 9.6 before doing this question.) Moldavia is a\nsmall country that currently trades freely in the world barley market. Demand and supply for barley\nin Moldavia is governed by the following schedules:\nDemand: QD = 4 - P\nSupply:\nQS = P\nThe world price of barley is $1/bushel.\n(a) (12 points) Calculate the free trade equilibrium price and quantity of barley in Moldavia. How\nmany bushels do they import or export? On a well-labeled graph, depict this equilibrium situation,\nand shade the gains from trade relative to the autarkic (no trade) equilibrium in Moldavia.\n(b) (12 points) The Prime Minister of Moldavia, sympathetic as always, believes he can help those hurt\nby free trade in barley relative to the situation in autarky. He taxes the party that has benefited\nfrom free trade (either consumers or producers) an amount per bushel that is the difference between\nthe autarkic price of barley and the free trade price. Furthermore, he rebates the entire government\nrevenue of the tax back to the party harmed by free trade (again, either consumers or producers).\nIn a new, well-labeled diagram, show this post-tax equilibrium situation. Calculate and show:\n- The new equilibrium price and quantity of barley in Moldavia\n- Changes in the quantity of imports or exports\n- The amount of revenue collected by the Prime Minister\nWho pays the larger burden of this tax, consumers or producers in Moldavia? Why?\n(c) (11 points) Are the free trade losers better off or worse off after the rebate than they were under\nautarky? Why?\nOn your diagram from (b), shade the DWL (if any) of this tax rebate policy, relative to the free\ntrade equilibrium you found in (a).\n4. Problem removed due to copyright restrictions. This content is presented in audio form in the Solution\nVideo for Problem Set 6, Problem 4.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n14.01SC Principles of Microeconomics\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT14_01SCF11_assn07.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-01sc-principles-of-microeconomics-fall-2011/11a3cae628a7d063176809cb89f8de48_MIT14_01SCF11_assn07.pdf",
      "content": "14.01 Fall 2010\nProblem Set 7\n1. (20 points) For each of the following statements, please indicate whether they are TRUE, FALSE, or\nUNCERTAIN. No credit will be given without an explanation as to why your claim is true.\n(a) (5 points) If a monopsonist faces a perfectly elastic supply curve, there will be no deadweight loss\nrelative to the competitive outcome.\n(b) (5 points) It is economically more efficient to have a monopolist that discriminates perfectly than\na monopolist that sets a single price.\n(c) (5 points) In a Cournot duopoly market, the two firms agree to produce half of the monopoly\noutput level for that market and split the resulting profit. Since the monopoly profit is the highest\nprofit that can be obtained, the two firms will always stick to that agreement even if it's not legally\n(or in any other way) binding.\n(d) (5 points) A firm is a monopolist in the market for good X. The government has perfect information\nabout the marginal and average cost curves of this firm and also has perfect information about the\ndemand curve for good X. Claim: The economy will reach an efficient outcome if the government\nsets a price ceiling that makes the price equal to the marginal cost, evaluated at the quantity\nwhere the marginal cost intersects the demand curve.\n2. Problem removed due to copyright restrictions. This content is presented in audio form in the Solution\nVideo for Problem Set 7, Problem 2.\n3. (20 points) A monopoly faces market demand Q = 30 - P and has a cost function C(Q) = 1 Q2 .\n(a) (5 points) Find the profit maximizing price and quantity and the resulting profit to the monopoly.\n(b) (5 points) What is the socially optimal price? Calculate the deadweight loss (DWL) due to the\nmonopolist behavior of this firm. Calculate consumer surplus (CS) and producer surplus (PS).\nShow CS, PS, and DWL on the diagram.\n(c) (5 points) Assume that the government puts a price ceiling on the monopolist at P = 18. How\nmuch output will the monopolist produce? What will be the profit of the monopolist? Calculate\nCS, PS, and DWL. Why is the deadweight loss different now?\n(d) (5 points) Assume that the government put a price ceiling on the monopolist in order to maximize\nthe total (i.e. consumer plus producer) surplus. What price ceiling should it choose? How much\noutput will the monopolist produce at this price ceiling? What will the profit of the monopolist\nbe? What is the DWL?\nProblem 3 courtesy of William Wheaton. Used with permission.\n4. (15 points) Suppose an industry has a duopoly structure. Duopolist 1 has a cost function given by:\nc1(y1) = (y1)2 for y1 ≥ 0\nDuopolist 2 has a cost function given by:\nc2(y2) = 12y2 for y2 ≥ 0\nDenoting total output produced in the industry by y = (y1 + y2), the inverse demand function for the\ngood produced in the industry is given by:\np = 100 - y\n(a) (5 points) Find the reaction function of each duopolist.\n(b) (5 points) Using (a), obtain the output levels that will be produced in a Cournot-Nash equilibrium,\nand the price level in such an equilibrium.\n(c) (5 points) Illustrate your solution in (b) above in a suitable diagram.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n14.01SC Principles of Microeconomics\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT14_01SCF11_assn08.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-01sc-principles-of-microeconomics-fall-2011/a0daeb011d937f560b8cba4d164a45a7_MIT14_01SCF11_assn08.pdf",
      "content": "p\n14.01 Fall 2010\nProblem Set 8\n1. (36 points) Two firms, A and B, are competing in the production of a homogenous good. The good's\nmarginal cost for both firms is equal, MC = $25. Assuming linear reaction functions, describe what\nwould happen to output and price in each of the following situations if the firms are in (i) collusive\nequilibrium, (ii) Cournot equilibrium, (iii) Bertrand equilibrium.\n(a) (4 points for each of (i)-(iii)) The demand curve shifts to the left.\n(b) (4 points for each of (i)-(iii)) Because it invents a new and improved machine, the marginal cost\nat firm B decreases to $20.\n(c) (4 points for each of (i)-(iii)) Costs in the entire industry increase due to an increase in wages.\nProblem 1 by MIT OpenCourseWare.\n2. Problem removed due to copyright restrictions. This content is presented in audio form in the Solution\nVideo for Problem Set 8, Problem 2.\n3. (28 points) Suppose a perfectly competitive labor market has a demand curve of LD = 120 - 2w and\na supply curve of LS = 8w, where w is the wage rate is dollars and L is the quantity of labor in\nperson-hours.\n(a) (2 points) What are the equilibrium values of the wage and employment?\n(b) (4 points) Suppose the government imposed a minimum wage of $14 per hour. Now what are the\nequilibrium values of the wage and employment?\n(c) (8 points) Repeat part (a), assuming now that the market is a monopsony.\n(d) (8 points) Repeat part (b), assuming now that the market is a monopsony.\n(e) (6 points) Does the imposition of the minimum wage decrease employment here under perfect\ncompetition? What about under monopsony? Give a brief intuitive explanation for your answer\nand why it may be different under the two different market structures.\nProblem 3 courtesy of William Wheaton. Used with permission.\n4. (11 points) Suppose you face the following lottery. You can earn 1 of 3 possible grades in this class: an\n\"A\", a \"C\", or an \"F\", with the following probabilities:\nπA =\n,\nπC =\n,\nπF =\nYour current wealth (w) is $400. If you receive an \"A\", you gain (e.g. I pay you) $500. However, if\nyou get an \"F\", you lose (e.g. you pay me) $300. If you receive a \"C\", you DO NOT GAIN OR LOSE\nanything. Assume your utility function, defined over wealth, is U(w) =\n(w).\n(a) (6 points) What is your expected utility (EU)? [Hint: be sure to calculate your total wealth in\neach \"state\".]\n(b) (5 points) What is the certainty equivalent level of wealth (w ∗), that is, the guaranteed payoff at\nwhich a person is \"indifferent\" between accepting the guaranteed payoff and their expected utility\nfrom (a)?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n14.01SC Principles of Microeconomics\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT14_01SCF11_assn09.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-01sc-principles-of-microeconomics-fall-2011/3adbb05565cd503574c5bea4c29a3cee_MIT14_01SCF11_assn09.pdf",
      "content": "14.01 Fall 2010\nProblem Set 9\n1. (28 points) R&D and effect of government borrowing\nA pharmaceutical company is considering whether to invest in the research and development of a new\ndrug. It will incur a cost of $100 million starting in this year for 10 years, and it will get a patent that\nis worth $1.5 billion at the beginning of the 11th year. Alternatively to the R&D project, the firm can\nexpand advertising for an already existing drug, which will increase its profits by $10 million forever.\nThe interest rate in the economy is 5% and is constant over time.\n(a) (7 points) What's the present value of the project? Write an expression for the net present value.\n(b) (7 points) Suppose that the internal rate of return on the project is 5.28%. Will the project be\nundertaken? Why?\n(c) (7 points) The government is considering increasing government consumption. Suppose that the\nmarket supply of funds is given by QS = i, where QS is funds supplied per year (in billion) and i is\nthe interest rate. Market demand for funds is given by QD = 10-i. The government is considering\npermanently increasing annual borrowing by $1 billion. Will the project get undertaken now?\nWhy?\n(d) (7 points) Given your results in part (c), discuss why a fiscal expansion could hurt productivity\ngrowth in the long run.\nProblem 1 courtesy of Plamen Nenov. Used with permission.\n2. (28 points) Intertemporal consumption and savings supply\nSuppose that there are only 10 individuals in the economy, each with the following utility function over\npresent and future consumption:\nU(c1, c2) = c1 + c2\nwhere c1 is consumption today, and c2 is consumption tomorrow. Buying 1 unit of consumption today\ncosts $1 today, and buying 1 unit of consumption tomorrow costs $1 tomorrow. All individuals have\nincome of $10 dollars today and no income tomorrow (they are retired tomorrow), but they can save\nat the market interest rate r ≥ 0.\n(a) (7 points) What is the price today of one unit of consumption tomorrow? Why?\n(b) (7 points) Write an expression for an individual's budget constraint in terms of today's and\ntomorrow's consumption expenditure.\n(c) (7 points) How much of their income would an individual consume, and how much would they\nsave, given the interest rate of r?\n(d) (7 points) Suppose that the market demand for funds is given by QD = 100 - i. What is the\nmarket supply for funds? What is the equilibrium interest rate that clears the capital market?\nWhat is aggregate consumption at that interest rate?\nProblem 2 courtesy of Plamen Nenov. Used with permission.\n3. (15 points) Demand for flu shots\nThe demand for flu shots this season is given by: P = 13 - 0.0005Q. The marginal cost of a flu shot is\n$8.\n(a) (5 points) In a competitive market, what are the equilibrium price and quantity of flu shots?\n(b) (5 points) The social benefit of flu shots is SB = 13Q - 0.0005 Q2 . What is the socially optimal\nquantity in the market? Compare your result here to the quantity in part (a). Explain any\ndifferences you see.\n(c) (5 points) What government policies could be implemented to achieve the social optimum in this\ncase?\n\n4. (29 points) Government Redistribution and Social Welfare\nConsider an economy with only one good, food. There are three people in the economy, A, B and C.\n√\nA has 400 units of food, B has 100 units, and C has only 16 units. All have the same utility, Ui =\nf\nfor i = A, B, C. The social welfare function for this society is the sum of the utilities of the three\nindividuals.\n(a) (6 points) If each agent simply consumes their own endowment, what is the utility level for A, B\nand C? Find the social welfare level.\n(b) (8 points) The government decides to redistribute food more equally, so it takes 175 units from\nA and gives them to B. However, the government spoils 79 of these units in transportation, so B\nultimately gets only 96 units of food. What is each person's utility level now? Find the social\nwelfare level in this case.\n(c) (8 points) Assume now that the government considers a different redistribution scheme. Starting\nwith the original endowments, the government takes 175 units from A. This time it wishes to give\nthem to C, but in transportation it destroys 91 units, so C only gets 84 of these extra units. What\nis each person's utility level now? Find the social welfare level in this case.\n(d) (7 points) Compare parts (b) and (c) in terms of social welfare. Note that the government is more\nwasteful in (c), and explain your result.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n14.01SC Principles of Microeconomics\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT14_01SCF11_soln01.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-01sc-principles-of-microeconomics-fall-2011/246785b93665931deee8867a16cfefd9_MIT14_01SCF11_soln01.pdf",
      "content": "14.01 Fall 2010\nProblem Set 1 Solutions\n1. (25 points) For each of the following scenarios, use a supply and demand diagram to illustrate the effect\nof the given shock on the equilibrium price and quantity in the specified competitive market. Explain\nwhether there is a shift in the demand curve, the supply curve, or neither.\n(a) (5 points) An unexpected temporary heat wave hits the East Coast. Show the effect in the ice\ncream market in New England.\nThe temporary heat wave shifts the demand curve to the right from D to D0 . As a result,\nequilibrium price and quantity both go up.\n(b) (5 points) The government introduces a tax on ice cream which is paid by producers. What is the\neffect in the ice cream market?\nThe supply curve shifts up from S to S0 by the amount of the tax. As a result, the equilibrium\nprice increases and the equilibrium quantity decreases. However, the rise in the equilibrium price\nfrom P to P 0 is smaller than the tax.\n(c) (5 points) China and Mexico are major producers of textiles. Workers in Mexico decide to go on\nstrike. Show the effect on the market for Mexican textiles.\nThe supply curve for Mexican textiles shifts to the left. This results in a higher equilibrium price\nand lower equilibrium quantity in the market for Mexican textiles.\n(d) (5 points) Show the effect of the situation described in (c) on the market for Chinese textiles.\nThe demand curve for Chinese textiles shifts to the right. This results in a higher equilibrium\nprice and higher equilibrium quantity in the market for Chinese textiles.\n(e) (5 points) Suppose the government imposes a price cap on bottled water. Show the effect in the\nbottled water market.\n\nIf the price ceiling P ∗ is set below the equilibrium price P , then there will be a shortage of bottled\nwater in the amount of Q1 - Q2 and bottled water will be rationed. If the price ceiling is above\nthe equilibrium price, then there is no effect.\nProblem 1 solution courtesy of William Wheaton. Used with permission.\n2. (20 points) For each of the following pairs of goods, identify which one you would expect to have more\nown-price elastic demand. Please explain your reasoning.\n(a) (5 points) Computers (generally) vs. Apple MacBook Pro laptops.\nApple MacBook Pro, because it is a specific brand and has more substitutability.\n(b) (5 points) Stereo headphones (generally) vs. hearing aids.\nStereo headphones, since they tend to be less of a necessity good than hearing aids.\nFor each of the following goods, identify whether you would expect demand to be more (own-price)\nelastic in the short run or the long run. As above, please briefly explain your reasoning.\n(c) (5 points) Retail gasoline in the suburbs of Chicago.\nMore price elastic in the long run, because people cannot effectively adjust to necessity goods like\ngasoline in the short run, while in the long run, people can substitute it with electricity (hybrid\ncars), diesel, public transportation, etc.\n(d) (5 points) Air conditioning units in Miami Beach, Florida.\nMore price elastic in the short run, because there are other good substitutes in the short run,\nsuch as fans. If there were a sudden increase in the price of A/C units, people could delay their\npurchase of a unit for a few days or weeks. But in the long run, there is no good substitute for\nA/C.\nProblem 2 solution courtesy of Luke Stein. Used with permission.\n3. (30 points) Consider the market for apple juice. In this market, the supply curve is given by QS =\n10PJ - 5PA and the demand curve is given by QD = 100 - 15PJ + 10PT , where J denotes apple juice,\nA denotes apples, and T denotes tea.\n(a) (7 points) Assume that PA is fixed at $1 and PT = 5. Calculate the equilibrium price and quantity\nin the apple juice market.\nWe have the system of equations Q = 10PJ - 5 · 1 and Q = 100 - 15PJ + 10 · 5. Solving for PJ\nand Q we get that PJ = 6.2 and Q = 57.\n(b) (7 points) Suppose that a poor harvest season raises the price of apples to PA = 2. Find the new\nequilibrium price and quantity of apple juice. Draw a graph to illustrate your answer.\n\nWe now have to solve the system:\nQ = 10PJ - 10\nQ = 150 - 15PJ\nSolving for PJ and Q we get that PJ = 6.4 and Q = 54. In a supply and demand graph, the supply\ncurve shifts to the left, resulting in the higher equilibrium price and lower equilibrium quantity.\n(c) (8 points) Suppose PA = 1 but the price of tea drops to PT = 3. Find the new equilibrium price\nand quantity of apple juice.\nQ = 10PJ - 5, Q = 130 - 15PJ -→ PJ = 5.4, Q = 49.\n(d) (8 points) Suppose PA = 1, PT = 5, and there is a price ceiling on apple juice of P ∗ = 5. What is\nJ\nthe excess demand for apple juice as a result? Draw a graph to illustrate your answer.\nNote that the price ceiling will be binding, since the equilibrium price from (a) is PJ = 6.2.\nPlugging the price ceiling level into the supply and demand equations we get that QS = 45 and\nQD = 75. Hence, there will be excess demand for apple juice of QE = 30. The graph in Question\n1(e) shows the identical case as the one here.\nProblem 3 solution courtesy of William Wheaton. Used with permission.\n4. (25 points) You have been asked to analyze the market for steel. From public sources, you are able to\nfind that last year's price for steel was $20 per ton. At this price, 100 million tons were sold on the world\nmarket. From trade association data you are able to obtain estimates for the own-price elasticities of\ndemand and supply on the world markets as -0.25 for demand and 0.5 for supply. Assume that steel\nhas linear demand and supply curves throughout.\n(a) (10 points) Solve for the equations of demand and supply in this market and sketch the demand\nand supply curves.\nAssume that this is a competitive market and assume that demand and supply are linear. Thus,\nXd = a - bP and Xs = c + dP . We know from the equation for own-price elasticity of demand\nthat\ndXd PX\nPX\nEQX PX =\n= -b\n= -b\n= -0.25\ndPX Xd\nXd\nSolving for b, then, we have b = 1.25. Substituting back into the equation for demand, Xd =\na - 1.25P or 100 = a - 1.25(20). Solving for a we have a = 125. Hence, the equation for last\nyear's demand is Xd = 125 - 1.25P .\nWe know that the price elasticity of supply is\ndXs PX\nEQX PX =\n= d\n= 0.5\ndPX Xs\n\nSolving for d, then, we have d = 2.5. Substituting back into the equation for supply, Xs = c+2.5P\nor 100 = c + 2.5(20). Solving for c, we have c = 50. Hence, the equation for last year's supply is\nXs = 50 + 2.5P .\n\n(b) (15 points) Suppose that you discover that the current price of steel is $15 per ton and the current\nlevel of worldwide sales of steel is 150 million tons. The most recent elasticity estimates from the\ntrade association this year are -0.125 for demand and 0.25 for supply. Describe the change in\nthe supply and demand curves over the past year using your diagram from part (a). What sort of\nevent(s) might explain the change?\nUsing the same functional forms as in the first part of the answer, with the new data we find that\nXd = a - bP becomes 150 = a - b(15). Our equation for elasticity of demand yields\ndXd PX\nPX\nEQX PX =\n= -b\n= -b\n= -0.125\ndPX Xd\nXd\nSolving for b yields b = 1.25. Substituting this value for b into the equation for (linear) demand,\nwe have 150 = a - 1.25(15) or a = 168.75. Hence, Xd = 168.75 - 1.25P .\nFor supply, we have Xs = c + dP or 150 = c + d(15). The equation for elasticity yields\ndXs PX\nEQX PX =\n= d\n= 0.25\ndPX Xs\nSolving for d yields d = 2.5. Substituting this value for d into the equation for linear supply, we\nhave 150 = c + 2.5(15) or c = 112.5. Thus, Xs = 112.5 + 2.5P .\nThe demand and supply have kept the same slope as last year, but the intercepts have changed for\nboth curves: demand and supply have shifted out. The demand shift could occur with any number\nof factors that increase the willingness to pay for steel at any given price, such as an increase in\nincome, an increase in the price of other (substitute) materials, or the increase in demand for a\ngood that requires steel as an input, like cars. The supply shift could occur with any of a number\nof factors that increase the willingness to produce steel for the markets at a given price, such as\nan increase in the number of firms that sell steel, or a decrease in the prices of inputs required to\nproduce steel (such as steel workers' wages).\nProblem 4 solution courtesy of Luke Stein. Used with permission.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n14.01SC Principles of Microeconomics\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT14_01SCF11_soln02.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-01sc-principles-of-microeconomics-fall-2011/7f7098ba18351b03b31b9f9376902d13_MIT14_01SCF11_soln02.pdf",
      "content": "14.01 Fall 2010\nProblem Set 2 Solutions\n1. (10 points) Annie and David are painting their apartment. At the paint store, David says he prefers\nCanary Yellow to Bumblebee Yellow, Lime Yellow, and Crayola Yellow. Annie finds new paint samples\nand asks David to compare Canary Yellow to School Bus Yellow and to Sunrise Yellow. David prefers\nSunrise Yellow to Canary Yellow, and prefers School Bus Yellow to Canary Yellow. He also prefers\nSunrise Yellow to School Bus Yellow. The store is out of Sunrise Yellow, so they buy School Bus Yellow\nand paint their apartment with it. David then insists that they go back, buy Lime Yellow, and repaint\nthe apartment.\nTrue/False/Uncertain: David has rational preferences (as we define them).\nFalse. He violates transitivity.\nProblem 1 solution courtesy of William Wheaton. Used with permission.\n2. (20 points) In each of the following examples, a consumer purchases just two goods: x and y. Based on\nthe information in each of the following parts, sketch a plausible set of indifference curves (that is, draw\nat least two curves on a set of labeled axes, and indicate the direction of higher utility). Also, write\ndown a utility function u(x, y) consistent with your graph. Note that although all these preferences\nshould be assumed to be complete and transitive (as required for utility representation), not all will be\nmonotone.\n(a) (4 points) Jessica enjoys bagels x and coffee y, and consuming more of one makes consuming the\nother more enjoyable.\n\n(b) (4 points) Plamen loves mocha swirl ice cream x, but he hates mushrooms y.\n\n(c) (4 points) Jennifer likes Cheerios x, and neither likes nor dislikes Frosted Flakes y.\n\n(d) (4 points) Edward always buys three white tank tops x for every pair of jeans y.\n(e) (4 points) Nancy likes both peanut butter x and jelly y, and always gets the same additional\nsatisfaction from an ounce of peanut butter as she does from two ounces of jelly.\n\n3. (20 points) A consumer's preferences are representable by the following utility function:\nu(x, y) = x\n2 + y.\n(a) (10 points) Obtain the MRS of the consumer at an arbitrary point ( x, y ), where x > 0 and y > 0.\n1 -\nx\n-1\nMRS = - 2\n= - x\n(b) (10 points) Suppose the price of the second good (y) is 1, and the price of the first good (x) is\ndenoted by p > 0. If the consumer's income is m > 0, obtain the optimal consumption bundle of\nthe consumer (in terms of m and p). [Caution: make sure you cover cases in which m is relatively\nlow, as well as cases in which m is relatively high.]\nThe consumer solves max x\n2 + y so that px + y = m. We look for stationary values of the\nLagrangian L = x\n2 + y + λ(m - px - y). The first-order conditions for stationarity are\n∂L\n1 -1\n2 - λp = 0\n= x\n∂x\n∂L = 1 - λ = 0\n∂y\n∂L = m - px - y = 0\n∂λ\n∗\n∗\nCombining the first two equations above gives\nSubstituting x into the\n= p, or x =\n2 .\n4p\n2x\n∗\nbudget constraint gives y = m - px = m - 4p .\n∗\n=\nCase 1) m ≥\nand y = m -\n≥ 0.\n-→ x\n4p\np\np\n∗\nm\nCase 2) m ≤ 4p -→ x = p and y = 0.\nGraphically,\ny\nx\nGraphic\nal solution for problem 3, part b.\nImage by MIT OpenCourseWare.\n4. (25 points) It is exactly 24 hours before Lauren's physics final. She has an economics final directly after\nthe physics final and has no time to study in between. Lauren wants to be a physicist, so she places\nmore weight on her physics test score. Her utility function is given by\nu(p, e) = 0.6 ln(p) + 0.4 ln(e)\nwhere p is the score on the physics final and e is the score on the economics final. Although she cares\nmore about physics, she is better at economics; for each hour spent studying economics she will increase\nher score by 3 points, but her physics score will only increase by 2 points for every hour spent studying\nphysics. Studying zero hours results in a score of zero on both subjects (although ln(0) is not defined,\nassume her utility for a score of zero is negative infinity).\n\n(a) (5 points) What constraints does Lauren face in her test score maximization problem?\nHp + He ≤ 24\nHp ≥ 0,\nHe ≥ 0\nOne might also consider production constraints:\np = 2Hp,\ne = 3He\n(b) (5 points) How many hours should Lauren optimally spend studying physics? How many hours\nstudying economics? (hours are divisible)\nmax 0.6 ln(2 × (24 - He)) + 0.4 ln(3He)\n(c) (5 points) What economics and physics test scores will she achieve (i.e. what are e and p ∗)?\nHe\n-→ F.O.C. 0.6 × 48\n- 2He\n= 0.3 × 1\nHe\n-→ He = 9.6,\nHp = 14.4\n∗\n∗\ne = 3He = 28.8\n∗\np = 2Hp = 28.8\n(d) (5 points) What utility level will she achieve?\nu(p, e) = 0.6 ln(p) + 0.4 ln(e) = 3.36\n(e) (5 points) Suppose Lauren can get an economics tutor. If she goes to the tutor, she will increase\nher economics test score by 5 points for every hour spent studying instead of 3 points, but will\nlose 4 hours of study time by going to the tutor. She cannot study while at the tutor, and going\nto the tutor does not directly improve her test score. Should Lauren go to the tutor?\nmax 0.6 ln(2 × (20 - He)) + 0.4 ln(5 × He)\nHe\n0.4\nF.O.C. 0.6 ×\n=\n40 - 2He\nHe\n-→ He = 8,\nHp = 20 - He = 12\n-→ e = 40,\np = 24,\nu(24, 40) = 3.38\nLauren has higher utility when she goes to the tutor, so she should go.\nProblem 4 solution courtesy of William Wheaton. Used with permission.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n14.01SC Principles of Microeconomics\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT14_01SCF11_soln03.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-01sc-principles-of-microeconomics-fall-2011/6f583fd576e8b1f052b85147bc6880d2_MIT14_01SCF11_soln03.pdf",
      "content": "14.01 Fall 2010\nProblem Set 3 Solutions\n1. (12 points) Assume the government has two policy options, a cash grant of $200 and providing food\nstamps worth $200.\n(a) (3 points) Draw the budget constraint faced by the consumer in each of these two situations.\nBudget line with food stamps\nBudget line with cash transfer\nOriginal budget line\n(b) (3 points) Now, draw a set of indifference curves that corresponds to an individual who would be\nindifferent between these two policies.\nI0\nI1\ny2\n\ny1\n\nIndifference curve I0 and I1 correspond to an individual who is indifferent between the two policies.\n(c) (3 points) Next, draw a set of indifference curves corresponding to an individual who would prefer\nto have a cash grant rather than food stamps.\n\nI3\nI1\nx3\n\nx1\n\nI2\nx2\n\nThis individual is on indifference curve I1 prior to the transfer of cash or food stamps. With cash,\nthey could reach indifference curve I3. However, with food stamps they can only reach indifference\ncurve I2. Accordingly, this individual would be better off with a cash transfer.\n(d) (3 points) Is there a consumer who strictly prefers food stamps to cash grants (i.e., is better off\nwith food stamps rather than a cash grant?) Why does the government use food stamps?\nThere is no consumer who strictly prefers food stamps to cash grants. Any allocation that can be\nachieved with food stamps can also be achieved with cash grants, so there is no reason to strictly\nprefer a cash grant. However, some allocations that can be achieved with a cash grant cannot\nbe achieved with food stamps, because food stamps require that you spend a certain amount on\nfood. Nonetheless, the government may use food stamps because policymakers prefer to require\nthat consumers spend a certain amount of food rather than on other goods that the policymakers\nview as undesirable (e.g., alcohol, cigarettes, entertainment.)\nProblem 1 solution by MIT OpenCourseWare.\n2. (22 points) Suppose there are exactly two consumers (Albie and Bubbie) who demand strawberries.\nSuppose that Albie's demand for strawberries is given by\nqa(p) = p αfa(Ia)\nand Bubbie's demand is given by\nqb(p) = p β fb(Ib)\nwhere Ia and Ib are Albie and Bubbie's incomes, and fa(·) and fb(·) are two unknown functions.\n(a) (5 points) Find Albie and Bubbie's (own-price) elasticities of demand, qa,p and qb,p. Use the sign\n∂y x\nconvention that y,x = ∂x y .\n∂qa\np\np\nqa,p =\n= [αpα-1fa(Ias)]\n= α\n∂p qa(p)\npαfa(Ia)\nand similarly, qb,p = β.\n(b) (5 points) Suppose that α > 0 > β. Are strawberries a Giffen good for Albie? Are strawberries a\nGiffen good for Bubbie?\nqa,p = α ≥ 0 which means that strawberries are Giffen for Albie. qb,p = β < 0, regular for\nBubbie.\n\n(c) (12 points) Are strawberries an inferior good for Albie? Are strawberries an inferior good for Bub\nbie? Assume that these demands arise from utility maximization given linear budget constraints.\nHint: This question should not require much/any algebra.\nStrawberries must be inferior for Albie, since Giffen goods must be inferior. The substitution effect\nmeans a higher price for strawberries encourage Albie to buy less of them. Thus if he buys more,\nthe income effect must make him buy more (i.e., it is inferior), and outweigh the substitution\neffect.\nFor Bubbie, strawberries could be normal or inferior. If inferior, it's just that the substitution\neffect outweighs the income effect.\n3. (24 points) Joe considers beer and soda to be perfect substitutes at a rate of 1:2, that is, he always\nreceives the same utility if he has one beer or two sodas to drink. He spends $12 a day on drinks, and\nbeers cost $3 while sodas cost $1 each. However, one day the price of beers decreases to $2; there is no\nchange in his budget.\n(a) (6 points) How does consumption change when the price of beers changes? What is Joe's new\nlevel of utility?\nIntuitively, since beer and soda are perfect substitutes, Joe will always spend his entire budget on\nwhichever drink has the lower price per unit of utility. Originally, a unit of utility from soda cost\n$2 (for two sodas), while a unit of utility from drinking beer cost $3, so Joe bought only soda; he\nwould consume 12 sodas, and his utility is 6. Given his budget, he would buy 4 beers. When the\nprice of beer changes, the cost of a unit of utility from soda is now equal to the cost of a unit of\nutility from beer. Accordingly, Joe is indifferent between soda and beer. He can optimally buy\nonly soda, only beer, or any combination in between. However, his overall utility has not changed.\n(b) (6 points) Show with the aid of a graph what happens to the optimal allocation and the level of\nutility when the price of beer changes.\nOriginal budget line\nSoda\nBeer\nNew budget line (dotted)\n(c) (6 points) How much must Joe's budget decrease to return him to the original utility level?\nJoe's utility level has not changed; accordingly, there is no need for a change in the budget to\nreturn him to his original level of utility.\n(d) (6 points) Now assume the price of beers returns to the original price of $3. Describe the demand\ncurve for soda holding the price of beer and income constant; a graphic representation is optional.\nAt the original price of beer, Joe purchased only soda as long as the price of soda was less than\nI\n$1.50, and demand is equal to Ps . Once the price of soda is above $1.50, demand is zero as Joe\nwill prefer to consume beer.\n\nPs\nSoda\n$1.50\n8 sodas\nDemand curve\nProblem 3 solution by MIT OpenCourseWare.\n4. (42 points) Xiaoyu spends all her income on statistical software (S) and clothes (C). Her preferences\ncan be represented by the utility function: U(S, C) = 4 ln(S) + 6 ln(C).\n(a) (6 points) Compute the marginal rate of substitution of software for clothes. Is the MRS increasing\nor decreasing in S? How do we interpret this?\n2 C\n=\nS =\nWe have that MRS\n. Hence, the MRS is decreasing in S. As Xiaoyu moves down\nS\nC\nan indifference curve consuming more software and fewer clothes, she is ready to give up fewer\nclothes for extra software.\n(b) (6 points) Find Xiaoyu's demand functions for software and clothes, QS (pS , pC , I) and QC (pS , pC , I),\nin terms of the price of software (pS ), the price of clothes (pC ), and Xiaoyu's income (I).\n2 C\npS\npS\npS\n-→\nAt an interior optimum, MRS =\n. Hence C =\nS. Substituting for C into the\n=\n3 S\npC\npC\npC\n5 pS .\npS\nbudget constraint, we get that pS S + pC\nS = I, which means that QS (pS , pC , I) = S =\n2 pC\nHence QC (pS , pC , I) = 3\nI .\npC\n(c) (6 points) Draw the Engel curve for software.\n2pS .\nThe Engel curve is a linear function with zero intercept and a slope of\n(d) (6 points) Suppose that the price of software is pS = 2, the price of clothes is pC = 3, and Xiaoyu's\nincome is I = 10. What bundle of software and clothes (S, C) maximizes Xiaoyu's utility?\n2 10\n3 10\nUsing the demand functions from part (b), we get that S =\n= 2 and C =\n= 2.\n(e) (6 points) Suppose the price of software increases to pS = 4. What bundle of software and clothes\ndoes Xiaoyu demand now?\nUsing the demand functions from part (b), we get that S0 = 2\n10 = 1 while C0 = 2 as before.\n(f) (6 points) Given the price increase, how much income does Xiaoyu need to remain as happy (have\nthe same utility) as she was before the price change? What bundle of software and clothes would\nXiaoyu consume if she had that additional income, given the new prices?\nPrior to the price change, Xiaoyu's utility is:\nU(2, 2) = 4 ln(2) + 6 ln(2) = 10 ln(2)\nWe want to find the income level I∗ which would give her the same utility U = 10 ln(2) after the\nprice increase. Plugging Xiaoyu's demand functions from part (b) into her utility function, we get\nthat:\n\n2 I\n3 I\nU(S, C) = 4 ln\n+ 6 ln\npS\npC\n= 4 ln(2) + 6 ln(3) + 10 ln(I) - 10 ln(5) - 4 ln(pS ) - 6 ln(pC )\nI\n\nNow, I∗ solves:\nU(2, 2) = 10 ln(2) = 4 ln(2) + 6 ln(3) + 10 ln(I ∗ ) - 10 ln(5) - 4 ln(4) - 6 ln(3)\n6 ln(2) = 10 ln(I ∗ ) - 10 ln(5) - 4 ln(4)\n3 ln(2) + 5 ln(5) + 2 ln(4)\nln(I ∗ ) =\n= ln(5 · 2 2\n7 )\nHence I∗ = 21.45 = 13.1951. If Xiaoyu had I∗ she would consume S00 = 1.3195 and C00 = 2.639.\n(g) (6 points) Going back to the situation in part (e) (pS = 4 and I = 10), decompose the total change\nof software and clothes demanded into substitution and income effects. In a clearly-labeled diagram\nwith software on the horizontal axis, show the income and substitution effects of the increase in\nthe price of software.\nThe total effect is the difference between the bundles consumed after and before the price change,\ni.e. (S0, C0) - (S, C) = (-1, 0), i.e. the total effect is a decrease in the consumption of software by\n1 and no decrease in the consumption of clothes.\nThe substitution effect (SE) is the difference between the bundles consumed and before the price\nchange staying on the same indifference curve, i.e. (S00, C00) - (S, C) = (-0.6805, .639). Hence,\nthe pure substitution effect is a decrease in the consumption of books by .6805 and an increase in\nthe consumption of clothes by .639.\nThe income effect (IE) is the difference between (S0, C0) and (S00, C00), i.e. a decrease of .3195 in\nsoftware and a decrease of .639 in clothes.\nProblem 4 solution courtesy of William Wheaton. Used with permission.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n14.01SC Principles of Microeconomics\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT14_01SCF11_soln04.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-01sc-principles-of-microeconomics-fall-2011/4cc2789ee90481d45cd1a12efe189b86_MIT14_01SCF11_soln04.pdf",
      "content": "14.01 Fall 2010\nProblem Set 4 Solutions\n1. (27 points) For each of the following production functions, sketch a representative isoquant (2 points).\nCalculate the marginal product for each input, and indicate whether each marginal product is diminish\ning, constant, or increasing (3 points). Also calculate the marginal rate of technical substitution for each\nfunction (2 points). Also indicate whether the function exhibits constant, increasing, or diminishing\nreturns to scale (2 points).\n(a) F (L, K) = LK3\nThis production function is of the Cobb-Douglas form. Isoquants: K = (Q/L)\n1 look approxi\nmately as follows:\nLet's first calculate the marginal products and check whether they are diminishing, constant, or\nincreasing.\nMPL = ∂F = K3\n∂2F = 0\n→ constant\n∂L\n∂L2\n∂F\n∂2F\nMPK =\n= 3LK2\n= 6LK > 0\n→ increasing\n∂K\n∂L2\nMPL\nK3\nK\nFor the MRTS we get MRT S =\n=\n=\n. Checking for returns to scale (we are scaling\nMPK\n3LK2\n3L\nup all inputs for a factor t > 1):\nF (tK, tL) = tL(tK)3 = t4LK3 = t · F (K, L)\nSo, this production function exhibits increasing returns to scale.\n(b) F (L, K) = L + 3K\nThis is the perfect substitutes production function. Isoquants are linear with a slope equal to the\nnegative of the constant MRTS, which is 1/3 here. Isoquant: K = Q/3 - L/3\n\n(\n(\n(\n(\n(\nMarginal products are constant for both inputs.\nMPL = ∂F\n∂L = 1\n∂2F\n∂L2 = 0\n→ constant\nMPK = ∂F\n∂K = 3\n∂2F\n∂L2 = 0\n→ constant\nMPL\nFor the MRTS we get MRT S = MPK = 3 . We verify constant returns to scale:\nF (tK, tL) = tL + 3tK = t(L + 3K) = t · F (K, L)\n(c) F (L, K) = (min{L, K})\nThis is a perfect complements production function. Isoquants are L-shaped, with a kink at L = K.\nMarginal products for both inputs:\n∂F\nif L ≥ K\n∂2F\nif L ≥ K\nMPL =\n=\n=\nL-2\nif L < K\n∂L2\n- 2\n9 L-\n∂L\nif L < K\n∂F\nif L ≤ K\n∂2F\nif L ≤ K\nMPK =\n=\n=\n∂L2\n- 2\n9 K-\nK-\n∂K\nif L > K\nif L > K\nif L > K\nMPL\nFor the MRTS we get MRT S = MPK =\ninf\nif L < K\nMRTS is not defined on the kink points, where K = L. This production function exhibits decreas\ning returns to scale (note t > 1):\nF (tL, tK) = [min{tL, tK}] = [t · min{L, K}]\n[min{L, K}] < t · F (K, L)\n3 = t\n2. (21 points) Consider the production function f(L, K) = 2L K\n4 .\n(a) (15 points) Find the associated (long run) total, average, and marginal cost curves.\nWe want to minimize wL + rK so that 2L K = Q. Setting up the Lagrangian and solving for\nthe first order conditions yields the \"conditional\" input demand curves for K and L.\nQ2r\n4w\nQ2w\n4r\nL ∗ (r, w, Q) =\n,\nK ∗ (r, w, Q) =\n2 r 2\nQ2w\nTC ∗ (r, w, Q) =\nQ2\nQw\nw 2 r 2\n2 r 2\nAC ∗ (r, w, Q) =\n=\n2Q\n∂T C\n2Qw 2 r 2\nMC ∗ (r, w, Q) =\n= Qw 2 r 2\n=\n∂Q\n\n(\n(b) (6 points) Sketch the total, average, and marginal cost curves.\n3. Problem solution removed due to copyright restrictions. This content is presented in audio form in the\nSolution Video for Problem Set 4, Problem 3.\n4. (28 points) You run a cost-minimizing firm with production function f(L, K) = [min{L, K}]\nL is labor and K is capital. Assume that you are a price-taker in the input markets: you pay w for\n, where\neach unit of labor you hire and r for each unit of capital (where w and r are set exogenously), and face\nno costs other than those from labor and capital.\n(a) (15 points) Assuming that you can freely choose both labor and capital (i.e., the \"long run prob\nlem\"), derive expressions for your cost-minimizing conditional input demands, L∗(r, w, Q) and\nK∗(r, w, Q). Confirm that the conditional input demand functions are \"homogeneous of degree\nzero\" in w and r; that is,\nL∗(tr, tw, Q) = L∗(r, w, Q)\nfor all t > 0\nK∗(tr, tw, Q) = K∗(r, w, Q)\nF (L, K) = {min L, K}\nalways be producing at L = K.\nis a perfect complements production function, so we know that we will\nUsing this, Q = F (L, K) = {min L, K} = {min L, L} = L -→\nL∗ = Q3 and K∗ = Q3 .\nThat is, L∗(r, w, Q) = K∗(r, w, Q) = Q3 are independent of the input prices r and w. In particular,\nwe verify homogeneity of degree zero: L∗(tr, tw, Q) = Q3 = L∗(r, w, Q) and same for K∗(r, w, Q).\n(b) (8 points) What will happen to your conditional demand for labor if there is an increase in the\nwage rate, assuming that r and Q remain the same? Explain in one sentence why your answer\nmakes intuitive sense.\nAs can be seen both in the picture and by plugging into the formulas, since L∗(r, w, Q) =\nK∗(r, w, Q) = Q3 are independent of the prices r and w, there will be no change in the in\nputs for a change in prices (given the perfect complement production function, producers cannot\nsubstitute away from labor when its price w increases).\n(c) (5 points) Use your answers from (a) to write down an expression for your total cost function\nTC(r, w, Q). Is this function \"homogeneous of degree one\" in w and r; that is, does TC(tr, tw, Q) =\nt · TC(r, w, Q)?\nThe total cost function TC(r, w, Q) states how much it costs to produce quantity Q, when prices\nare r and w (and the producer behaves optimally). We have:\nTC(r, w, Q) = wL ∗ (r, w, Q) + rK ∗ (r, w, Q) = wQ3 + rQ3 = (r + w)Q3\nTC(r, w, Q) is indeed homogenous of degree one:\nTC(tr, tw, Q) = (tr + tw)Q3 = t · (r + w)Q3 = t · TC(r, w, Q)\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n14.01SC Principles of Microeconomics\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT14_01SCF11_soln05.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-01sc-principles-of-microeconomics-fall-2011/1aeaeb3993e8b8c60bb91f6aa0cce667_MIT14_01SCF11_soln05.pdf",
      "content": "14.01 Fall 2010\nProblem Set 5 Solutions\n1. (24 points) You manage a factory that produces cans of peanut butter. The current market price is\n$10/can, and you know the following about your costs:\nMC(5) = 10,\nATC(5) = 6\nMC(4) = 4,\nATC(4) = 4\n(a) (8 points) A case of food poisoning breaks out due to your peanut butter, and you lose a lawsuit\nagainst your company. As punishment, Judge Judy decides to take away all of your profits, and\nconsiders the following two options to be equivalent:\ni. Pay a lump sum in the amount of your profits.\n∗\nii. Impose a tax of $[P - AT C(q ∗)] per can since that is your current profit per can, where q is\nthe profit maximizing output before the lawsuit.\nExplain briefly why she is right or wrong.\n∗\nYou maximize profits where P = MC, and since P = 10 = MC(5) you would set q = 5.\nπ/q = (P - AT C) = (10 - 6) = 4\nThe tax would be $4/can.\n(b) (8 points) Judge Judy gives you the option of choosing either plan. Which plan would you choose?\nProvide intuition. Hint: a clear diagram may be helpful.\nThe lump sum transfer will result in π = 0.\nWith the tax, MCt(4) = 8 and since P = 10 > 8, this implies that the optimal qt is such that\n4 < qt < 5. We also know that 8 < ATCt(qt) < 10, since average total cost also shifts up by 4.\nThis implies πt = qt(P - AT Ct) > 0.\nIntuition: Since we know that MC(4) = AT C(4), the average total cost is minimized at q = 4,\nboth with and without the tax. By imposing a $4/can tax, the firm reduces its quantity from 5\nto qt, which decreases average total cost. (P - AT C) or the profit/can increases, so that the firm\nis still making positive profits despite the $4/can tax.\nConclusion: You would prefer to have the tax plan.\n(c) (8 points) In the following year, you finally pay off the court ordered amount and everything\nreturns to normal. However, an employee tells you that at current levels of production, actual\ncosts are double what you initially thought. After carefully looking at the cost information, you\ndecide to continue producing the exact same amount. Could you still be maximizing profits?\nYes, the increase in costs could be completely due to fixed costs. This would not affect your\nbehavior in any way in the short run. However, in the long run, since π = q(P - AT C) =\n5(10 - 12) = -10 < 0, you would exit the market.\nProblem 1 solution courtesy of Edward Cho. Used with permission.\n2. (32 points) Some questions about short-term and long-term costs:\n(a) (8 points) What is the relationship between the long-run average cost curve and the short-run\naverage cost curve? Please show graphically.\n\nImage by MIT OpenCourseWare.\n(b) (8 points) What algebraic condition describes a firm that is at an output level that maximizes its\nprofits, given its capital in the short-term?\nThe required condition is MR = SRMC, or marginal revenue is equal to short-run marginal cost.\n(c) (8 points) What two algebraic conditions describe a firm that is at a capital level that minimizes\nits costs in the long-term?\nThe required conditions are SRAC = LRAC and SRMC = LRMC, or both marginal cost and\naverage cost are equal to their long-run levels.\n(d) (8 points) If a firm is characterized by short-run marginal cost that is greater than long-run\nmarginal cost and short-run average cost greater than long-run average cost, how should it change\nits capital level in the long-run to minimize costs?\nIt should increase its capital input in the long-run in order to move cost curves to the right.\nProblem 2 solution by MIT OpenCourseWare.\n3. (6 points) Suppose, in the short run, the output of widgets is supplied by 100 identical competitive\nfirms, each having a cost function:\ncs(y) = 1 y 3 + 2\nThe demand for widgets is given by:\ny d(p) = 6400/p\n(a) (3 points) Obtain the short run industry supply function for widgets.\ns\nSince P = MC = y2, the supply function of each firm is given by yi = p\n2 . In the figure below,\nMC = y2 and AV C = y\n2 .\nSu\npp\nly\nfu\nnction of each firm.\nImage by MIT OpenCourseWare.\nT\nh\ne\n\ng\nraphi\ncal r\nelati\nonsh\nip\nb\ne\ntw\nee\nn the long-run av\nerage cost curve and the short-run average cost curve.\n\n(\ns\nThe industry supply function is ys(p) = 100y (p) = 100p\ni\n2 .\n(b) (3 points) Obtain the short run equilibrium price of widgets, and the output of widgets supplied\nby each firm.\nys = yd -→ 100p\n∗\n∗\n-→ p = 64. Hence y = 100 · 8 = 800 and yi = 8. Finally, p = 64.\n=\np\n4. (22 points) Sebastian owns a coffee factory in Argentina. His production function is:\nF (K, L) = (K - 1) L\nConsider the cost of capital to be r and the wage to be w. Both inputs are variable, and Sebastian\nfaces no fixed costs.\n(a) (2 points) What is the MRT S of labor for capital?\nMPL\n(K - 1)\nMRT S =\n=\nMPK\nL\n(b) (5 points) What are Sebastian's input demands, conditional on the quantity (q) he wants to\nproduce? [Hint: Treat w and r as parameters.]\nOptimality Conditions:\nK - 1\nw\n=\nL\nr\nq = (K - 1) L\nConditional Demand Functions:\nr\nLd =\nq\nw\nw\nKd =\n2 + 1\nq\nr\n(c) (3 points) Show that Sebastian's long run cost function is C(q) = r + 2(wr) q .\nr\nw\nC(q) = wLd + rKd\nq 2 + 1\n= r + 2(wr)\n+ r\n= w\nq\nq\nw\nr\n(d) (5 points) What is the supply function of Sebastian's firm?\nThe inverse supply function for a firm is given by P = MC(q), for any q such that P ≥ min AC(q).\nThis is true when MC = AC.\nr\n4(wr) q =\n+ 2(wr)\n2 q\nq\nr\nw\nq =\nq, for all q ≥ ( r\nw\nTherefore, the inverse supply function is P = 4(wr)\n) /2\n2 .\n(wr3)\nWhen q = ( r )\nw\n/2 , P = 2\n, and therefore, Sebastian's supply function is:\nP\nq =\n4(wr)\n2 ,\nwhen P ≥ 2\n2 (wr3)\nq = 0,\notherwise\nConsider now that r = 4, w = 1, and that the market demand for coffee is Qd = 20 - P . There are 7\nother companies operating in this market, all with cost structures identical to Sebastian's company.\n(e) (6 points) What is the aggregate supply in this market?\nq2 . Therefore, MC = 4(wr)\nAs shown in (c), C(q) = r + 2(wr)\nq = 8q.\nInverse supply of one firm:\n\n(\n(\n\nP = MC = 8q, for any q such that P ≥ min AC. At min AC, MC = AC. Therefore,\n8q =\n+ 4q -→ q = 1\nq\nmin AC = 8\nSupply of one firm:\nP\nfor P ≥ 8\nq =\n,\nq = 0,\notherwise\nAggregate supply:\nP\nQs = 8 ·\n= P, for P ≥ 8\nQs = 0, otherwise\n(f) (6 points) Calculate the equilibrium price, aggregate quantity sold, quantity sold by each firm,\nand economic profit of each firm.\nQs = Qd\nP = 20 - P -→ P = 10\nQ = 10\nq =\n=\nEconomic profit of one firm = 10 ·\n-\n-\n4 (\n·\n)2 = 2.25\n(g) (5 points) Can this be a long run equilibrium? Why? How will the supply side of the market\nadjust in the long run?\nNo, because the economic profits of the firms in this market will attract the entry of other firms,\nuntil the economic profits are driven to 0.\n(h) (6 points) What is going to be the price in the long run? How many firms will be present in this\nmarket in the long run? How much will each firm produce?\nIn the long run, we must have P = min AC = 8. When P = 8, Qd = 20 - 8 = 12. So we will need\nto have 12 firms in this market in the long run, each producing q = 1.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n14.01SC Principles of Microeconomics\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT14_01SCF11_rec01.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-01sc-principles-of-microeconomics-fall-2011/5c67b8718ff55091c19b47d15136dc53_MIT14_01SCF11_rec01.pdf",
      "content": "Recitation 1 Notes\n14.01SC Principles of Microeconomics\nI. Supply and Demand Model\na. Supply and demand determine prices\nb. Need a competitive market\nII. Competitive market\na. Producers and consumers are price takers (not price setters)\ni. Do not individually influence prices\nb. Non-differentiated good\ni. All goods are the same, non-distinguishable\nc. Symmetric information\ni. All producers/consumers have the same knowledge about goods\nd. No transaction costs\ni. Buying/selling does not include any extra costs\nIII. Demand\nQD = D(P)\ndQD/dP < 0\nP (price) = QD/D\nAlso influenced by:\nIncome (I)\nTastes\nSubstitutes\nComplements ᄋ\nᄋ\nᄋ\nᄋ\nChange in QD - movement along demand curve\nChange in demand - shift of demand curve, change in variables other than price\nExample: Market for Pork\nQD (P, I, Pbeef) = 7 - 2P + 3I + Pbeef\nIf I = 4, Pbeef = 1, then\nQD (P) = 20 - 2P\nP = 10 - 1/2 QD\nIf I=4, Pbeef = 3, then\nQD(P) = 22-2P\nP=11-1/2 QD\nIf I=2, Pbeef = 1\nQD(P) = 14-2P\nP = 7 - 1/2QD\n\nMarket demand is sum of consumer demand:\nQM = ∑Qi\nIV. Supply\nQS = S(P)\nP = QS/S\ndQS/dP > 0 (law of supply)\nAlso influenced by:\nInput price\nTechnology\nChange in QS - move along supply\ncurve\nChange in S - shift of supply curve ᄋ\nᄋ\nV. Market Equilibrium\nEquilibrium = satisfaction, no desire\nto change\nP = P* (price is optimal)\nQ = Q* (quantity supplied and\ndemanded is optimal)\nQD (P*) = QS (P*)\nExample:\n20-2P* = 8+4P*\nP* = 12\nQ* = 16\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n14.01SC Principles of Microeconomics\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT14_01SCF11_rec02.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-01sc-principles-of-microeconomics-fall-2011/32e74182abe73c0c2035508b67c2d040_MIT14_01SCF11_rec02.pdf",
      "content": "Recitation 2 Notes\n14.01SC Principles of Microeconomics\nI.\nPrice Elasticity of Demand\nED = (%\nquantity demanded)/(%\nprice)\n( Q/Q) / ( P/P) = ( Q/ P) * (P/Q)\nED = (dQ/dP) * (P/Q)\nExample:\nQD(P) = 24-2P, P=3, Q=18\nED = -2(3/18) = -1/3\n| ED | = 1/3\nperfectly elastic |ED| =\nperfectly inelastic |ED\nelastic |ED| > 1\ninelastic |ED| < 1\nunit elastic |ED| = 1\n| = 0\nII.\nPrice Elasticity of Supply\na. Income/cross price elasticity - tell about sensitivity of curve behavior in\nresponse to changes in income and other input factors\nIII.\nTaxes - Public Economics\na. Sales Tax - ad valorem tax (tax is fraction of price)\nb. Gas Tax - specific /unit tax (added per unit sold of a good)\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n14.01SC Principles of Microeconomics\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT14_01SCF11_rec03.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-01sc-principles-of-microeconomics-fall-2011/7576d5136178f34315678983953421c9_MIT14_01SCF11_rec03.pdf",
      "content": "Recitation 3 Notes\n14.01SC Principles of Microeconomics\nI.\nSubstitution\nMarginal Rate of Substitution: the rate at which a consumer is ready to give up one good\nin exchange for another good while maintaining the same level of utility.\nPerfect Substitutes - Marginal Rate of Substitution is constant.\nII.\nIndifference Curves\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n14.01SC Principles of Microeconomics\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT14_01SCF11_rec04.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-01sc-principles-of-microeconomics-fall-2011/39fdb9770f2dd53f5ad4fd71de2b04df_MIT14_01SCF11_rec04.pdf",
      "content": "Recitation 4 Notes\n14.01SC Principles of Microeconomics\nI.\nDemand Functions\na. Perfect Complements u(x,y) = min(x, y/4)\nx* = 1⁄4y*\nPx x* + Py y* = I\nSubstitute and solve to get:\ny*(PxPyI) = I / (1⁄4Px + Py)\nx*(PxPyI) = 1⁄4I / (1⁄4Px + Py)\nb. u(x,y) = x*y (neither substitutes nor complements)\nMRS = -MU x / MUy = -y/x\nMRT = -Px/Py\nY* = (Px/Py) (x*)\nX*(Px,Py,I) = I/2Px\nY*(Px,Py,I) = I/2Py\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n14.01SC Principles of Microeconomics\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT14_01SCF11_rec05.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-01sc-principles-of-microeconomics-fall-2011/d5e3984e1e3d5b5a67985441ce486b66_MIT14_01SCF11_rec05.pdf",
      "content": "Recitation 5 Notes\n14.01SC Principles of Microeconomics\nI.\nProduction Functions: Q = f(L,K)\na.) Cobb-Douglas production function\nQ = L1⁄2 K1⁄2\nL =\n= 1⁄2(L/K) 1⁄2\nMarginal rate of technical substitution = -dK/dL\n(MRTS) = MPL / MPK\n= (.5*(K/L)^.5)/ (.5*(L/K)^.5)\n= K/L\nReturns to scale are constant.\nb.) Leontief\nQ = min(aL, bK)\naL = bK\nII.\nCosts (forward-looking)\na.) Short Run Costs\nK is fixed\nFixed cost (FC) = r * k\nVariable cost (VC) = w * L\nMarginal cost (MC) =\nAverage fixed cost (AFC) = FC/Q\nAverage variable cost (AVC) = VC/Q\nAverage total cost (ATC) = AFC + AVC\nShort run cost (SRC) = r * K + w * L\nb.) Long Run Costs\nMRTS = w/r\nMPL/ MPK = w/r MPL/w = MPK/r\nLong run costs: LRC(Q) = r*K(Q) + w*L(Q)\nIncreasing returns to scale if Q increases and AC decreases\nDecreasing returns to scale if Q decreases and AC increases\nC/ Q = dC/dQ\n\nᄊ\nᄊ\nᄊ\n\nᄊ\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n14.01SC Principles of Microeconomics\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT14_01SCF11_rec06.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-01sc-principles-of-microeconomics-fall-2011/63880fbbbf6dd47ebfdf934a25c02a0c_MIT14_01SCF11_rec06.pdf",
      "content": "Recitation 6 Notes\n14.01SC Principles of Microeconomics\nI.\nEconomies of Scale\na. Q = f(L,K)\nII.\nConstant Returns to Scale\na. F(2L,2K) = 2F(L,K)\nIII.\nIncreasing Returns to Scale\na. F(2L,2K) > 2F(L,K)\nIV.\nDecreasing Returns to Scale\na. F(2L,2K) < 2F(L,K)\nV.\nEconomies of Scale in Production\na. C(2Q) < 2C(Q)\nb. C(2Q)/Q < 2C(Q)/Q\nc. C(2Q)/2Q < C(Q)/Q\nd. Average cost of producing more is less than average cost of producing less.\nVI.\nDiseconomies of Scale in Production\na. C(2Q) > 2C(Q) AC(Q) increases\nVII.\nEconomies of Scope -firms that produce multiple goods cheaper should produce goods\ntogether rather than separately\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n14.01SC Principles of Microeconomics\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT14_01SCF11_rec07.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-01sc-principles-of-microeconomics-fall-2011/036a42dbf99a143561e9b40cc2d2faf2_MIT14_01SCF11_rec07.pdf",
      "content": "Recitation 7 Notes\n14.01SC Principles of Microeconomics\n-\nWith output fixed, whether or not cost is minimized can be seen by comparing AC and\nMC.\n-\nWith capital fixed, profit maximization is determined by comparison with the condition\nMR=MC.\n-\nIn the long-run, LRMC=SRMC at the same Q where LRAC=SRAC.\n-\nThis can be seen in the following derivation:\nd/dQ SRAC(Q) = d/dQ LRAC(Q)\nd/dQ (SRTC(Q)/Q) = d/dQ (LRTC(Q)/Q)\n(SRTC ′(Q)Q - SRTC(Q))/Q^2 = (LRTC ′(Q)Q - LRTC(Q))/Q^2\nSRMC (Q) - SRAC(Q) = LRMC(Q)- LRAC(Q)\n-\nThus when SRAC(Q)=LRAC(Q), SRMC(Q)=LRMC(Q).\n-\nProfit = TR-TC\n-\n(d/dQ) = 0 dTR/dQ - dTC/dQ = 0\n-\nTR = P*Q\n-\nWhen perfectly competitive, MR = P\n-\nWhen not perfectly competitive, MR = dP/dQ\n-\nShort run supply (short run costs, no entry/exit)\n-\nProfit = (P-ATC)Q\n-\nSupply curve - chooses Q based on MC, except when price < AVC (nothing is\nproduced)\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n14.01SC Principles of Microeconomics\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT14_01SCF11_rec08.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-01sc-principles-of-microeconomics-fall-2011/02fed21358a64601ee532821383a3b78_MIT14_01SCF11_rec08.pdf",
      "content": "Recitation 8 Notes\n14.01SC Principles of Microeconomics\nI.\nPrice Ceiling\nCS = A-B\nPS = -A-C\n---------------\nW = -B-C\nII.\nPrice Floor\n----------------\nCS = -A-B\nPS = A-C-D\nW = -B-C-D\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n14.01SC Principles of Microeconomics\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT14_01SCF11_rec09.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-01sc-principles-of-microeconomics-fall-2011/dffbb225142d51c3adcd71ef6bac0be5_MIT14_01SCF11_rec09.pdf",
      "content": "Recitation 9 Notes\n14.01SC Principles of Microeconomics\nI.\nGovernment Policy - want to redistribute surplus and raise money\na. Price Controls - price ceiling\nb. Price Support - price floor\nc. Import Tariffs/Quotas, Free Trade\ni. subject to perfectly elastic demand/supply at world price\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n14.01SC Principles of Microeconomics\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}