{
  "course_name": "Principles of Automatic Control",
  "course_description": "This course introduces the design of feedback control systems as applied to a variety of air and spacecraft systems. Topics include the properties and advantages of feedback systems, time-domain and frequency-domain performance measures, stability and degree of stability, the Root locus method, Nyquist criterion, frequency-domain design, and state space methods.",
  "topics": [
    "Engineering",
    "Aerospace Engineering",
    "Guidance and Control Systems",
    "Engineering",
    "Aerospace Engineering",
    "Guidance and Control Systems"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 3 sessions / week, 1 hour / session\n\nRecitations: 1 session / week, 1 hour / session\n\nCourse Description\n\nThis course introduces the design of feedback control systems as applied to a variety of air and spacecraft systems. Topics include the properties and advantages of feedback systems, time-domain and frequency-domain performance measures, stability and degree of stability, the Root locus method, Nyquist criterion, frequency-domain design, and state space methods.\n\nTextbook\n\nThe textbook for the class, available at the COOP or on Amazon, is:\n\nFranklin, Gene, J. David Powell, and Abbas Emami-Naeini.\nFeedback Control of Dynamic Systems\n. 6th ed. Prentice Hall, 2009. ISBN: 9780136019695.\n\nThe previous edition is very similar, but the problems are numbered differently, and have some changes, so you should use the 6th edition.\n\nOther texts which might be helpful (on reserve in the Aero/Astro Library):\n\nVan de Vegte, John.\nFeedback Control Systems\n. 3rd ed. Prentice Hall, 1994. ISBN: 9780002085069.\n\nOgata, Katsuhiko.\nModern Control Engineering\n. 4th ed. Prentice Hall, 2002.\n\nKuo, Benjamin.\nAutomatic Control Systems\n. 8th ed. John Wiley & Sons, 2003. ISBN: 9780471381488.\n\nOgata, Katsuhiko.\nSolving Control Engineering Problems with MATLAB\n. Prentice Hall, 1993. ISBN: 9780130459077.\n\nUse of MATLAB(r)\n\nThe use of a software package like MATLAB is very helpful in the study of Feedback Systems. The software can best be used initially to check work that is first done traditionally with pencil and paper. This is particularly helpful when verifying polar plots (Nyquist plots), Bode diagrams and root loci when first attempting to sketch these functions. In addition, step responses in the time domain can be examined in order to build an intuitive sense of the relations between time and frequency domain behavior. We also will use MATLAB to check the validity of simplifying approximations that are often made when carrying out preliminary designs. Finally we can study more complex problems with a computer-aided design package without the enormous burden of doing extensive computations. We suggest that everyone become familiar with the use of MATLAB on Athena or learn to use the Student Edition of MATLAB (Prentice Hall, Englewood Cliffs, NJ) which is available for both Microsoft and Macintosh computers. Where necessary in the homework, we will indicate Macros (M-files) available on Athena which can be used to aid in studying the problem. Remember that we want you to come away with an understanding of feedback theory in some depth. The computer is to aid in achieving this understanding and should be used intelligently as an engineering tool.\n\nQuizzes\n\nThere will be two evening quizzes during the term after lecture 16 and lecture 29.\n\nFinal Exam\n\nA three-hour examination will be scheduled during the final exam period.\n\nProblem Sets\n\nProblem sets will be issued during the third lecture of every week and will be due the following week at the beginning of the third lecture. Late problem sets will not be accepted. (See Grading Policies)\n\nGrading\n\nGrades will be based on performance in the following required assignments:\n\nACTIVITIES\n\nPERCENTAGES\n\nQuiz 1\n\nQuiz 2\n\nFinal Exam\n\nWeekly homework assignments and labs (about one assignment per week)\n\nParticipation and assessment of staff\n\nNote that attendance in lectures and recitations is mandatory and failure to attend on a regular basis will affect your grade.\n\nGrades in 16.06 are based on the\nofficial MIT grading policy\n.\n\nCollaboration and Academic Honesty\n\nIn this course, you may collaborate with others on the solution of problem sets, unless the instructions on a problem set indicate otherwise. Working in small groups can be beneficial, especially if the group is used as a learning resource, not just a source of answers. If you do collaborate, you should acknowledge (by name) others with whom you have worked, including a brief description of the amount and nature of help received from others. Modifying someone else's work to make it appear that it is your own is unacceptable. In case of doubt, consult the course instructor or the graduate TA. By submitting a homework, you affirm that the final work is your own.\n\nYou may\nnot\nuse sources such as the solutions from prior offerings of 16.06, whether the solutions were the official solutions from the course staff or the solutions of students, no matter the source (OCW, \"bibles,\" etc.)\n\nIt is dishonest and counterproductive to copy the work of others and submit it as if it were your own. The goal of doing problems is to learn the material; the goal is not to turn in the right answer, or surprisingly, even to get a good grade. If you are unable to do the problem sets on your own, it is very unlikely that you will do well on the quizzes. Plagiarism and other forms of cheating are a severe breach of the codes of the Institute and the engineering profession and will be dealt with as such. Violations of these guidelines will be dealt with as per section 10.2 of the MIT Policies and Procedures. A useful discussion of these issues may be found\nhere\n.\n\nLate Assignments and Missed Quizzes\n\nGenerally, we do not accept late homework assignments, since solutions are posted immediately after the due date, and the grading of late homeworks imposes a significant burden on the teaching staff. Likewise, students cannot make up a missed exam, except under specific circumstances. You will be given a makeup exam only under one of the following conditions:\n\nYou need to participate in a significant scholastic event (including varsity sports). Allowing makeups for scholastic events is at the discretion of Prof. Hall. In order for your request to be considered, you must make a request to Prof. Hall one week\nbefore you need to make travel plans\n.\n\nYou have an illness serious enough that you are unable to take the exam. In this case, you must inform Prof. Hall\nbefore\nthe exam, and you may be asked to have Student Support Services verify your illness.\n\nIf you miss the final, you automatically receive a grade of \"O,\" unless a failing grade is inevitable. If your absence is subsequently approved by Student Support Services, the grade will be changed to \"OX,\" which allows you to arrange for a makeup final.",
  "files": [
    {
      "category": "Assignment",
      "title": "16.06 Principles of Automatic Control, Problem Set 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-06-principles-of-automatic-control-fall-2012/890e764323e8a25d620cdd4532dd5f95_MIT16_06F12_ProblemsSet_1.pdf",
      "content": "16.06 Principles of Automatic Control\nProblem Set 1\nIssued: September 7, 2011\nDue: September 14, 2011\nInstructions: Do each problem on separate sheets of paper, and staple the sheets for each\nproblem together. Write your name on each problem.\nProblem 1 -- Review of Laplace Transforms\nLaplace Transforms: If necessary, read Appendix A of FPE for a review of Laplace trans-\nforms.\n1. Find the Laplace transform of the function\ng(t) = te-2tσ(t)\nwhere σ(t) is the unit step function. Note: FPE uses the notations 1(t) instead of σ(t).\n2. Find the inverse LT of the transform\n6s2\ns\nG(s)\n-2\n=\n-2,\nRe[s] > 1\ns(s2 -1)\n3. Use the Final Value Theorem to find\nlim y(t)\nt→inf\nif y(t) has transform\ns2 + 4s + 6\nY (s) =\n,\nRe[s] > 0\ns(s + 1)(s + 3)\n\nProblem 2\nConsider the feedback system block diagram shown below:\nG\nplant\nK\ncompensator\nF\nsensor\nu\nz\ne\ny\n-\n+\nr\n1. Find the transfer function from r to z, given by\nZ(s)\nH(s) = R(s)\n2. We are often interested in how sensitive a control system is to variations in components\nof the control system. For example, the plant may be expected to have transfer function\nG, but in fact have transfer function G + δG. These variations are often expressed\nnot as an absolute variation, say, δG, but as a relative or percentage change, δG . The\nG\nsensitivity function SG describes the percent change in the closed-loop transfer function\nH for a given percent change in the transfer function G. Find the sensitivity\nδH/H\n∂H G\nSG =\n=\nδG/G\n∂G H\nMake sure to simplify your expression as much as possible. In order for the closed-loop\ntransfer function to be relatively insensitive to variations in G, what property should\nthe loop gain KGF have?\n3. Find the sensitivity\nδH/H\n∂H K\nSK =\n=\nδK/K\n∂K H\nto changes in the compensator, again simplifying as much as possible. How does it\ncompare to SG?\n4. Find the sensitivity\nδH/H\n∂H F\nSF =\n=\nδF/F\n∂F H\nto changes in the sensor gain and simplify. Is the sensitivity greater for small loop gain\nor large loop gain?\n5. If you were designing a control system that is supposed to have a specific closed-loop\ntransfer function, would it be more important to have a precise actuator (one that has\nsmall variations from its expected transfer function) or a precise sensor?\n\nProblem 3\nFeedback can be used to improve the linearity of systems with nonlinearities. For example,\nconsider an audio power amplifier, with input u and output y, which has a static respones\n(i.e., the response does not have any dynamics) given by y = f(u), where the nonlinear\nfunction f is given as in the plot below:\n-1\n0.5\n-0.5\nu\ny\nA unity feedback control system is used to improve the linearity of the system, as shown in\nthe block diagram below.\nf(u)\nu\ny\ne\n-\n+\nr\nPlot the closed-loop response, that is, plot y as a function of r. Describe in words the\ndegree to which feedback did or did not improve the linearity of the system.\nProblem 4\nDo Problem 2.9 from FPE.\nProblem 5\nDo Problem 2.5 from FPE.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n16.06 Principles of Automatic Control\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "16.06 Principles of Automatic Control, Problem Set 10",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-06-principles-of-automatic-control-fall-2012/a18cec257b71fc8ebccf47c5f8b43ef0_MIT16_06F12_ProblemsSet_10.pdf",
      "content": "16.06 Principles of Automatic Control\nProblem Set 10\nIssued: November 10, 2012\nDue: November 16, 2012\nInstructions: Do each problem on separate sheets of paper, and staple the sheets for each problem to\ngether. Write your name on each problem.\nProblem 1\nDo Problem 6.45 from FPE.\nProblem 2\nDo Problem 6.49 from FPE.\nProblem 3\nDo Problem 6.52 from FPE.\nProblem 4\nYou are to design a compensator K(s) for the unity feedback control system\nG(s)\nK(s)\nr\ny\nwhere\n(1 - s/300)\nG(s) = (1 + s/4)2\nthat meets the following specifications:\n- Phase margin at least 40 deg\n- Rise time as fast as is practical\n- No excessive \"undershoot,\" i.e., wrong way behavior\n- The steady error to a unit step input is less than 0.5%\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n16.06 Principles of Automatic Control\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "16.06 Principles of Automatic Control, Problem Set 11",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-06-principles-of-automatic-control-fall-2012/dbfe7dd3ad8a1bd16fb4571cda05bd1e_MIT16_06F12_ProblemsSet_11.pdf",
      "content": "16.06 Principles of Automatic Control\nProblem Set 11\nInstructions: Do each problem on separate sheets of paper, and staple the sheets for each problem to\ngether. Write your name on each problem.\nProblem 1\nDo FP&E Problem 8.1\nProblem 2\nDo FP&E Problem 8.2\nProblem 3\nDo FP&E Problem 8.3\nProblem 4\nNote: This problem will be due with Problem Set 12. It is being presented here so that you can begin\nworking on it, and consult me for ideas. Time permitting, I will demo the best controllers the last week of\nclass.\nYou are to design a control system (in continuous time) for the one degree of freedom helicopter demo\nin class. The transfer function for the plant is given by\ns + 43.8\nG(s) = 0.0905 (s + 2.26)(s + 0.814)(s - 0.639)\nwhere the input ranges from -1 to 1, and the output ranges from -0.5 to 0.5. You are to design a control\nsystem for the system, that best meets the desired control objectives. In particular, you are to choose K1,\nK2, and K3 for the following block diagram:\nK3(s)\nK2(s)\nK1(s)\nG(s)\ny\nr\nu\nNote that choosing K2(s) = 0, K3(s) = 1, and K1(s) = K(s) results in the traditional unity feedback\ncontroller. K2(s) is used for minor loop feedback. K3(s) may be used to pre-filter the reference, to shape\nthe step response of the system. The reference input will be a step input of magnitude 0.05. Design the\ncontroller to optimize the following performance metrics:\n1. The step response should be as fast as possible, given the other constraints below.\n2. There should be minimal overshoot. The overshoot should not exceed 5%.\n3. The magnitude of the control signal should not exceed 0.40.\n4. The control system should be Type 1, so that the steady error due to a constant disturbance (such as\nwould result from a change in the weight of the helicopter) are zero.\nIssued: November 25, 2012\nDue: November 30, 2012\n\n5. In addition, undesirable behaviors, such as long tails in the step response, are to be avoided.\nI will judge the results based on these criteria, and present the best results in class.\nYour results should be submitted online as a MATLAB m-file. Executing the m-file should leave in the\nworkspace the three controller transfer functions, named k1, k2, and k3. Name the file xyz.m, where your\ninitials are xyz (in lowercase). For example, your file might look something like:\n% srh.m\n%\n% Controller for the helicopter demo by\n% Steven R. Hall\ns = tf([1 0],1);\nk1 = 10*(1+s/1)/(1+s/10);\nk2 = tf(0,1);\nk3 = tf(1,1);\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n16.06 Principles of Automatic Control\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "16.06 Principles of Automatic Control, Problem Set 12",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-06-principles-of-automatic-control-fall-2012/aeb024adaeedfc54c4a90441c0e31aee_MIT16_06F12_ProblemsSet_12.pdf",
      "content": "16.06 Principles of Automatic Control\nProblem Set 12\nInstructions: Do each problem on separate sheets of paper, and staple the sheets for each problem to\ngether. Write your name on each problem.\nProblem 1\nDo FP&E Problem 8.7\nProblem 2\nDo FP&E Problem 8.9\nProblem 3\nYou are to design a compensator Kd(z) for a unity feedback sampled data control system, where the\nplant is\nG(s) = 5 (1 + s/20)(1 + s/4)\nwhere the sampling time is\nT = 0.005 sec\nwhich meets the following specifications:\n- Maximum overshoot Mp ≤ 0.20\n- Cross over frequency is ωc = 100 r/s\n- The steady error to a unit step input is less than 0.5%\nAssume that there is no processing delay, but you must still account for the effective delay of the zero-order\nhold.\nProblem 4\nTime permitting, I will demo the best controllers the last week of class.\nYou are to design a control system (in continuous time) for the one degree of freedom helicopter demo\nin class. The transfer function for the plant is given by\ns + 43.8\nG(s) = 0.0905 (s + 2.26)(s + 0.814)(s - 0.639)\nwhere the input ranges from -1 to 1, and the output ranges from -0.5 to 0.5. You are to design a control\nsystem for the system, that best meets the desired control objectives. In particular, you are to choose K1,\nK2, and K3 for the following block diagram:\nK3(s)\nK2(s)\nK1(s)\nG(s)\ny\nr\nu\nIssued: December 2, 2012\nDue: December 7, 2012\n\nNote that choosing K2(s) = 0, K3(s) = 1, and K1(s) = K(s) results in the traditional unity feedback\ncontroller. K2(s) is used for minor loop feedback. K3(s) may be used to pre-filter the reference, to shape\nthe step response of the system. The reference input will be a step input of magnitude 0.05. Design the\ncontroller to optimize the following performance metrics:\n1. The step response should be as fast as possible, given the other constraints below.\n2. There should be minimal overshoot. The overshoot should not exceed 5%.\n3. The magnitude of the control signal should not exceed 0.40.\n4. The control system should be Type 1, so that the steady error due to a constant disturbance (such as\nwould result from a change in the weight of the helicopter) are zero.\n5. In addition, undesirable behaviors, such as long tails in the step response, are to be avoided.\nI will judge the results based on these criteria, and present the best results in class.\nYour results should be submitted online as a MATLAB m-file. Executing the m-file should leave in the\nworkspace the three controller transfer functions, named k1, k2, and k3. Name the file xyz.m, where your\ninitials are xyz (in lowercase). For example, your file might look something like:\n% srh.m\n%\n% Controller for the helicopter demo by\n% Steven R. Hall\ns = tf([1 0],1);\nk1 = 10*(1+s/1)/(1+s/10);\nk2 = tf(0,1);\nk3 = tf(1,1);\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n16.06 Principles of Automatic Control\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "16.06 Principles of Automatic Control, Problem Set 2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-06-principles-of-automatic-control-fall-2012/1e75437897499f647baf29d40b0b0093_MIT16_06F12_ProblemsSet_2.pdf",
      "content": "16.06 Principles of Automatic Control\nProblem Set 2\nInstructions: Do each problem on separate sheets of paper,\nproblem together. Write your name on each problem. Also, please make sure you use the\n6th edition of FPE. The 4th and 5th edition numbers the problems differently.\nProblem 1\nDo Problem 3.21 from FPE. The problems refers to Figure 3.54 in FPE. Use only sub-\nfigures (c) and (d). Also, solve using both block diagram reduction and Mason's rule.\nProblem 2\nDo Problem 3.25 from FPE.\nProblem 3\nDo Problem 3.32 from FPE.\nProblem 4\nDo Problem 3.36 from FPE.\nProblem 5\nDo Problem 3.38 from FPE.\nIssued: September 17, 2012\nDue: September 24, 2012\nand staple the sheets for each\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n16.06 Principles of Automatic Control\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "16.06 Principles of Automatic Control, Problem Set 3",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-06-principles-of-automatic-control-fall-2012/aa8014d0bb947936c9579962c6012dc9_MIT16_06F12_ProblemsSet_3.pdf",
      "content": "16.06 Principles of Automatic Control\nProblem Set 3\nInstructions: Do each problem on separate sheets of paper, and staple the sheets for each problem to\ngether. Write your name on each problem.\nProblem 1\nDo Problem 3.43 from FPE.\nProblem 2\nDo Problem 3.44 from FPE.\nProblem 3\nDo Problem 4.14 from FPE.\nProblem 4\nDo Problem 4.8 from FPE.\nIssued: September 24, 2012\nDue: September 28, 2012\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n16.06 Principles of Automatic Control\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "16.06 Principles of Automatic Control, Problem Set 4",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-06-principles-of-automatic-control-fall-2012/48799e93af250a928737a16d610dbd3d_MIT16_06F12_ProblemsSet_4.pdf",
      "content": "16.06 Principles of Automatic Control\nProblem Set 4\nInstructions: Do each problem on separate sheets of paper, and staple the sheets for each problem to\ngether.\nNOTE: Many of the problems ask you to sketch first, then use MATLAB. Do not use MATLAB first. You\nwill not gain any intuition by looking at results -- you need to learn to do the sketches by hand.\nAlso, some of the problems have many parts. Please try to understand how to do the problems before\ngrinding through.\nProblem 1\nDo Problem 5.2 from FPE, parts (a)-(e)\nProblem 2\nDo Problem 5.4 from FPE, parts (b) and (d) only\nProblem 3\nDo Problem 5.6 from FPE, parts (a), (c), (e), and (g) only\nProblem 4\nDo Problem 5.8 from FPE, parts (a), (d), and (f) only\nIssued: September 28, 2012\nDue: October 5, 2012\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n16.06 Principles of Automatic Control\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "16.06 Principles of Automatic Control, Problem Set 5",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-06-principles-of-automatic-control-fall-2012/0ccb33e077939db53cf0e2d58191ad89_MIT16_06F12_ProblemsSet_5.pdf",
      "content": "16.06 Principles of Automatic Control\nProblem Set 5\nInstructions: Do each problem on separate sheets of paper, and staple the sheets for each problem together.\nWrite your name on each problem.\nProblem 1\nDo Problem 5.7, parts (a) and (c) from FPE\nProblem 2\nDo Problem 5.17 from FPE\nProblem 3\nDo Problem 5.26 from FPE.\nIssued: October 6, 2012\nDue: October 12, 2012\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n16.06 Principles of Automatic Control\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "16.06 Principles of Automatic Control, Problem Set 6",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-06-principles-of-automatic-control-fall-2012/07144ad451d33fbc9ae9911943edfc57_MIT16_06F12_ProblemsSet_6.pdf",
      "content": "16.06 Principles of Automatic Control\nProblem Set 6\nInstructions: Do each problem on separate sheets of paper, and staple the sheets for each\nproblem together. Write your name on each problem.\nProblem 1\nDo Problem 5.25 from FPE.\nProblem 2\nDo Problem 5.28 from FPE.\nProblem 3\nSketch the 0° locus for the examples given in FPE 5.7.\nIssued: October 12, 2011\nDue: October 19, 2011\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n16.06 Principles of Automatic Control\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "16.06 Principles of Automatic Control, Problem Set 7",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-06-principles-of-automatic-control-fall-2012/66ce129bbc63b946fff95201968b261f_MIT16_06F12_ProblemsSet_7.pdf",
      "content": "16.06 Principles of Automatic Control\nProblem Set 7\nInstructions: Do each problem on separate sheets of paper, and staple the\ngether. Write your name on each problem.\nProblem 1\nDo Problem 6.2 from FPE.\nProblem 2\nDo Problem 6.4, parts parts (a), (b), (c) from FPE.\nProblem 3\nDo Problem 6.5, parts (a), (b), (e) from FPE.\nProblem 4\nDo Problem 6.7, parts (a), (b) from FPE.\nIssued: October 19, 2012\nDue: October 26, 2012\nsheets for each problem to\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n16.06 Principles of Automatic Control\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "16.06 Principles of Automatic Control, Lecture 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-06-principles-of-automatic-control-fall-2012/0be3c8c751fd4765dd77e3292c72d48e_MIT16_06F12_Lecture_1.pdf",
      "content": "16.06 Principles of Automatic Control\nLecture 1\nImportant information:\n- Active learning if an important part of the class. Come prepared to learn, think, contribute every class.\n- Text is Franklin, Powell, Emami-Naeni, Feedback Control of Dynamic Systems, 5thEdition.\nNote: NOT 4thedition.\n- Grading\nQuiz 1\n20%\nQuiz 2\n20%\nFinal\n30%\nHomework\n20%\nParticipation\n5%\nStaff Assessment\n5%\n- See collaboration policy. It is NOT same the same as Unified. In particular, it is not allowed to use\nsolutions from past years from any source.\n- Generally, late assignments are not accepted.\n- May sometimes have to \"look ahead\" problems where you need to read material to be able to do the\nproblems.\nWhy automatic control?\nTwo broad categories of control:\n- Manual Control\n- Automatic Control\nWe'll be discussing automatic control almost exclusively. Automatic control systems can be designed to hold\nan output steady or to track a desired reference signal.\n- Regulator: keep output at a steady, known value\n- Tracking or servo system: Make output track a reference system\nCan further categorize control systems as either open-loop or closed-loop. Closed-loop controllers (or feedback\ncontrollers) compute the control action based on the measured output of the system being controlled.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n16.06 Principles of Automatic Control\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "16.06 Principles of Automatic Control, Lecture 10",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-06-principles-of-automatic-control-fall-2012/d534f7b9322ae4439af5f23889ea074c_MIT16_06F12_Lecture_10.pdf",
      "content": "16.06 Principles of Automatic Control\nLecture 10\nPID Control\nA common way to design a control system is to use PID control.\nPID = proportional-integral-derivative\nWill consider each in turn, using an example transfer function\nA\nGpsq \" s2 ` a1s ` a2\nProportional (P) control\nIn proportional control, the control aw is simply a gain, to that u is proportional to e:\n-\n+\nkp\nG(s)\ny\nr\ne\nu\nu \" kpe\nFor our example, the characteristic equation is\n0 \"1 ` kpGpsq\nkpA\n\"1 ` s2 ` a1s ` a2\nn 0 \"s 2 ` a1s ` a2 ` kpA\n\nThe resulting natural frequency is\na\nωn \"\na2 ` kpA\nSo in the example, increasing kp increases the natural frequency, but reduces the damping\nratio.\nPlot of pole location vs kp:\nIm(s)\nRe(s)\nincreasing kp\n-a1/2\nopen loop\npole location\nclosed-loop\npole location\nDerivative (D) control\nTo add damping to a system, it is often useful to add a derivative term to the control,\nuptq \"kpeptq ` kDe9ptq\nor\nvpsq \"kpEpsq ` kDsEpsq\n\"pkp ` kDsqEpsq\n\"KpsqEpsq\nWhat is the characteristic equation?\n0 \"1 ` KpsqGpsq\npkp ` kDsqA\n\"1 ` s2 ` a1s ` a2\n0 \"s 2 ` pa1 ` kDAqs ` pa2 ` kpq\n\nSo increasing kD increases the damping ratio without changing the natural frequency, for\nthis example.\nFor kpfixed, kDvarying, plot of closed-loop pole location is:\nIm(s)\nRe(s)\npole position for kD = 0\npole position for kD > 0\nincreasing kD\nNB: For other Gpsq, results may vary.\nSometimes, it's better to place derivative feedback in the feedback path:\n-\n+\nkp\nkD(s)\ny\nr\nu\n+\nG(s)\nWhy? We get the same pole locations, but no additional zeros to cause additional overshoot.\nAnother way to think about this is that we want the derivative effect on y, because that\nadds damping, but we don't want to differentiate the reference.\nIntegral (I) control\nEspecially if the plant is a type 0 system, we may want to add integrator to controller to\ndrive steady-state error to zero:\n`kI\nV psq \" pkp\n`kDsq Epsq\nO\nO\ns\nO\nP\nI\nD\n\nExample:\nGpsq \" s2 ` s ` 1\nSuppose we want a system that\n1. Has rise time above tr \" 1s\n2. Has peak overshoot of Mp \" 0.05\n3. Has zero steady-state error to step command\nLet's do one piece at a time:\n-\n+\nkp\nG(s)\nCharacteristic equation is\n0 \" s 2 ` s ` 1 ` kp\nSo can only change ωn (and indirectly, ζ) with kp. for tr \" 1, need\n1.8\n1 \"\nn ωn « 1.8\nωn\nSo let's take kp \" 2 for simplicity. Then\nkpG\nT \"\n\"\n1 ` kpG\ns2 ` s ` 4\nn ζ \"0.25,\nLow\nTo get Mp \" 5%, need ζ \" 0.7. So add derivative control. Characteristic Equation is\n0 \" s 2 ` p1 ` kpqs ` 1 ` kp\nThe desired polynomial is\n0 \" s 2 ` 2.8s ` 4\nSo take kD \" 1.8.\n\nIf PD control is in forward loop,\n1.8s ` 3\nT \" s2 ` 2.8s ` 4\nand the peak overshoot will be 16%, not 5%. So instead, use control structure\n-\n+\n1.8s\ny\nr\nu\n+\nG(s)\n(*)\np q \" \"mirror loop feedback\"\nWith this structure, we have:\ntr \"1.06s\nMp \"4.6%\ness \"0.25\nSo let's add integral control:\n-\n+\nkv+kI/s\nkDs\ny\nr\n+\nG(s)\nTake kI \" 0.25 (trust me!)\nThen\nResponse sort of meets specs:\nT \"\n3s ` 0.25\ns3 ` 2.8s2 ` 4s ` 0.25\n\n0.2\n0.4\n0.6\n0.8\nt\ny\n5%\nThe response has a long tail, due to slow pole - poles are at:\ns \" 1.37 1.40j\ns \" 0.065\nO slow pole causes long tail\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n16.06 Principles of Automatic Control\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "16.06 Principles of Automatic Control, Lecture 11",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-06-principles-of-automatic-control-fall-2012/d566b5095f68500326ab0e24f15fe863_MIT16_06F12_Lecture_11.pdf",
      "content": "16.06 Principles of Automatic Control\nLecture 11\nThe Root Locus Method\nOften, it is useful to find how the closed-loop poles of a system change as a single parameter\nis varied. To do this, we use the root locus method.\nRoot - root of s polynomial equation\nLocus - Set of points (plural - loci)\nConsider a typical feedback loop\n-\n+\nK(s)\nG(s)\ny\nr\nIf both Kpsq and Gpsq are rational, then the loop gain may be expressed as\nKpsqGpsq \" kLpsq\nwhere\nnpsq\nLpsq \"dpsq\nnpsq \"s m ` b1s m 1 ` ... ` bm\n\"ps z1qps z2q...ps zmq\nm\nz\n\"\nps ziq\ni\"1\ndpsq \"s n ` a1s n 1 ` ... ` an\nn\nz\n\"\nps piq\ni\"1\n\nThen the roots of the closed-loop system occur at:\n1 ` KpsqGpsq \" 0 p‹q\nor\n1 ` kLpsq \" 0 p‹q\nor\nLpsq \"\np‹q\nk\nor\ndpsq ` knpsq \" 0 p‹q\nThe root locus is the set of values s for which p‹q holds, and k is any positive real value.\n(For reasons that will become clear later, this is the definition of the positive or 180 degree\nlocus. Will later define the negative, or 0 degree locus.)\nExample:\n-\n+\nk\ns(s+1)\nIn this case,\nLpsq \"\n,\nnpsq \" 1\nsps ` 1q\ndpsq \"sps ` 1q \" s 2 ` s\nzeros: none\npoles: pi \" 0, 1.\nThe characteristic equation is:\ns 2 ` s ` k \" 0\n\nBecause characteristic equation is quadratic, we can find the roots using the quadratic for\nmula:\n?\ns \" 1\n1 4k\nWhen 0 d k d 1\n4 , the roots are real, and between -1 and 0. For k a 1\n4 , the roots are complex,\n?\nwith real part\n2 , and imaginary part that increases (asymptotically) as k.\nθ\nIm(s)\nRe(s)\nSuppose our goal is to choose k so that ζ \" sin θ \" 0.5 n θ \" 30 .\nLooking at the geometry in the figure, the imaginary part is\nRepsq\nImpsq \" tan θ\nRpsq \" 2\nsin 30\n1{2\ntan θ \"\n\" ?\n\" ?\ncos 30\n3{2\n?\nn Impsq \" 3{2\n?\n4k 1\nBut Impsq \"\n6 k \"1\nExample:\nWhat is the root locus of\n\n-\n+\ns+3\ns+8\nk\n(s+1)(s+2)\nIn this problem,\ns ` 3\nnpsq\nLpsq \"\n\"\nps ` 8qps ` 1qps ` 2q\ndpsq\nThe characteristic equation is\nps ` 8qps ` 1qps ` 2q ` kps ` 3q \" 0\nBecause the polynomial is cubic, we can't find the roots (easily) in closed form. Nevertheless,\ncan sketch the root loci using root loci sketching rules:\nIm(s)\nRe(s)\nWith a little practice, you should be able to sketch root loci very rapidly.\nGuidelines for Sketching Root Locus\nWill give rules for k a 0.\nFor k a 0 and 1 ` kLpsq \" 0 must have that\nLpsq \" \" negative real number\nk\nThat is, the phase of the L(s) must be:\n\n=Lpsq \" 180 ` l 360 , where l is an integer.\nThis is the root locus phase condition, and the reason we call the locus for k a 0 the\n180 locus.\nConsider the example above:\nIm(s)\nRe(s)\nφ3\nφ1\nφ2\nψ2\nThe phase of L(s) is given by\n=Lpsq \" Ψ1 φ1 φ2 φ3\nTo see if a given point is on the locus, could measure all the angles, add/subtract, and test\nresult. This used to be done mechanically with a \"spirule\". However, it's only important to\nbe able to sketch general shapes; Matlab can do the rest.\nRoot Locus Rules\nRule 1\nThe n branches of the locus start at the n points of L(s). m branches end at the zeros of\nL(s). n m branches end at s \" 8.\nRule 2\nThe loci cover the real axis to the left of an odd number of poles and zeros.\nTo the left of the pole, φ \" 180\nTo the left of a zero, Ψ \" 180 .\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n16.06 Principles of Automatic Control\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "16.06 Principles of Automatic Control, Lecture 12",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-06-principles-of-automatic-control-fall-2012/2a107059e26df574559b1def4fa9e36d_MIT16_06F12_Lecture_12.pdf",
      "content": "16.06 Principles of Automatic Control\nLecture 12\nRoot Locus Rules\n- Rule 1\nThe n branches of the locus start at the n poles of L(s). m branches end at\nthe zeros of L(s). n m branches end at s \" 8.\n- Rule 2\nThe locus covers the real axis to the left of an odd number of poles and\nzeros.\nTo the left of the pole, φ \" 180\nTo the left of a zero, Ψ \" 180 .\nφ=0o\nφ=180o\ns to the right of the pole\ns to the left of the pole\nTo the right of a pole, φ \" 0\nTo the right of a zero, Ψ \" 0 .\nSo,\nm\nn\ny\ny\n=Lpsq \"\nΨi\nφi\ni\"1\ni\"1\n\"m1180 n1180\n\"pm1 ` n1q180 n1360\n\"180 ` l 360\nif m1 ` n1 is off, where\n\nm1 \" number of zeros to the right of s\nn1 \" number of poles to the right of s\n- Rule 3 For large k, n m of the loci are asymptotic to the lines emanating from the\npoint s \" 8, with angles\n180 ` 360 pl 1q\nθl \"\n,\nl \" 1, ...n m\nn m\nr\nr\npi zi\nwhere α \"\nn m .\nWhy? If s N 8, k N 8,then to highest order the equation\ndpsq ` knpsq \" 0\nbecomes\ns n ` ... ` kps m ` ...q \" 0\nSo the solution satisfies\nn\ns „ ksm ,\npk, s N 8q\nO \"asymptotic to\"\nn s n m „ k\nn s „p kq\nn m\n180 ` 360 pl 1q\nn m =\n\"k\nn m\nTo get the point s \" α, do asymptotic analysis with next terms:\nResult is that center of pattern is at:\nr\nr\npi\nzi\ns \"\nn m\nA related rule, not in FPE, is:\n- Rule 3a If n m e 2, the centroid of the closed-loop poles is constant, and is at\n\nr pi\nn\nTo show this, consider a polynomial with roots z1, z2, ... The polynomial is then\nps p1qps p2q...ps pnq\n\"s n pp1 ` p2 ` ...pnqs n 1 ` ...\nr\nTherefore, a1 \"\npi.\nNow, the closed loop polynomial is given by\ndpsq ` knpsq\n\"s n ` a1s n 1 ` ... ` kps m ` b1s m 1 ` ...q\n\"s n ` a1s n 1 ` ... ` pan m ` kqs m ` ...\nThat is, the first term to change in the polynomial is the an mterm. If n m e 2, the a1term\nis unchanged, and the centroid is a constant.\nNote that if m poles go to the m zeros zi, the centroid of the remaining n m poles must\ngo to\nr\nr\npi\nzi\nn m\nin agreement with rule 3.\n- Rule 4 The angle(s) of departure of a branch of the locus from a pole of multiplicity\nq is\ny\ny\nqφdep \"\nΨi\nφi 180 360 pl 1q\n\nand the angle(s) of arrival of a branch at a zero of multiplicity q is given by\ny\ny\nqΨarr \"\nφi\nΨi ` 180 ` 360 pl 1q\n\nr\nwhere the sum\nexcludes to poles (or zeros) at the point of interest.\n\nExample:\ns\nLpsq \" ps ` 1qps2 ` 1q\nIm(s)\nRe(s)\nφ2=90o\nφ1=45o\nφdep=90o-45o-90o-180o\nψ1=90o\nφdep \" 90 45 90 180\nφdep \" 225 \" 135 (mod 360 )\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n16.06 Principles of Automatic Control\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "16.06 Principles of Automatic Control, Lecture 13",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-06-principles-of-automatic-control-fall-2012/dfbdaedad1c061bf06c7d99d233d38d5_MIT16_06F12_Lecture_13.pdf",
      "content": "16.06 Principles of Automatic Control\nLecture 13\nRoot Locus Rules (cont-d)\n- Rule 5 The locus crosses the jω axis at points where the Routh criterion shows a\ntransition in the number of unstable roots.\nExample:\nLpsq \" ps ` 1q3\nThe characteristic equation is\ns 3 ` 3s 2 ` 3s ` 1 ` k \" 0\nThe Routh array is\n1 ` k\n8 k\n1 ` k 0\nSo the transitions occur at k \" 8, 1.Look at locus:\n\nk=8\nFor k \" 8,the characteristic equation is\ns 3 ` 3s 2 ` 3s ` 9 \" 0\nwhich has roots at\n?\ns \" 3, 3j\nloomoon\nO\njω axis crossing\n- Rule 6 The locus will have multiple roots at points on the locus where\nddpsq\ndnpsq\nnpsq\ndpsq\n\" 0\nds\nds\n(see FPE for details)\nExample:\ns ` 3\nLpsq \" ps ` 1qps ` 2q\n\nwhere does locus depart/arrive real axis?\nnpsq \"s ` 3\ndpsq \"s 2 ` 3s ` 2\nn 1psq \"1\nd1psq \"2s ` 3\nnpsqd1\npsq dpsqn psq\n\"ps ` 3qp2s ` 3q ps 2 ` 3s ` 2q\n\"2s 2 ` 9s ` 9 ps 2 ` 3s ` 2q\n\"s 2 ` 6s ` 7 \" 0\n?\n36 28\nn s \"\n\n?\ns \" 3 2\nas in recitation!\nLead Compensator Example\nFor the plant\nGpsq \" ps ` 1qps ` 2q\nfind a unity feedback controller with compensator Kpsq such that\ntr A0.5 sec\nMp A10%\nIf the closed loop system is second order, the poles would need to have\nMp \" 0.10 \" e π tan θ n θ \" 0.6325\nn ζ \" sin θ \" 0.5912\nSo set ζ \" 0.707 to allow some margin.\n\ntr \" 1\nω\n.\nn\n8 n ωn « 3.6 rad/sec\nThis would place poles at\ns \" 2.6 2.6j\nTo simplify, want poles at\ns \" 3 3j\nLook at locus with gain only:\nIm(s)\nRe(s)\nSo gain only doesn't work - must add lead compensation:\nps ` αq\nKpsq \" k ps ` βq\nwhere α a β.\nThen rough locus will be\nIm(s)\nRe(s)\n-β\n-α\n\nMust choose α, β, k to make this work.\nWe have multiple degrees of freedom, so answer is not unique. Let's fix\nα \" 3\nto guarantee the real closed-loop pole settles faster than complex poles. Then β must be\nselected to achieve desired angle condition.\nIm(s)\nRe(s)\nφ\n90o\n108.4o 123.7o\n-β\n-3\n-2\n-1\n4.92\n3.61\n3.16\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n16.06 Principles of Automatic Control\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "16.06 Principles of Automatic Control, Lecture 14",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-06-principles-of-automatic-control-fall-2012/84821af4788443d3d2501ec57c3b81e4_MIT16_06F12_Lecture_14.pdf",
      "content": "16.06 Principles of Automatic Control\nLecture 14\nLead Compensator Example (cont-d)\nTo satisfy the angle condition, require that\nφ \" 90 108.4 123.7 ` 180pmod 360q \" 37.9\nFrom the geometry shown,\ntan φ \"\n3 n β \" 6.9\nβ 3\nTo find the gain K, we must invoke the magnitude condition that\n|KpsqGpsq| \" 1\nat the poles.\n|KpsqGpsq| \" 2 K\nˇˇˇˇ\ns ` 3\nps ` 1qps ` 2qps ` 6 9q\nˇˇˇˇ \" 1\n1 3.61 3.16 4.92\nTherefore, k \" 2\n\" 9.35.\nSo choose compensator\ns ` 3\nKpsq \" 9.35 s ` 6.9\nThe closed loop transfer function is\nY\ns ` 3\nT psq \"\npsq \" 18.7\nR\ns3 ` 9.9s2 ` 41.4s ` 69.9\nThe closed loop poles are at\ns \" 3.015 2.996j, 3.87\n\nThe performance stats are:\nMp \"8.4% d 10%\ntr \"0.42 sec d 0.5 sec\nkp \"4.06 Ð low\nA note on Closed-Loop poles and zeros\nConsider a closed-loop system with only one forward path and only one loop:\n-\n+\nK(s)\nG(s)\ny\nr\nF(s)\nThe poles of\nKpsqGpsq\nT psq \" 1 ` KpsqGpsqF psq\ncan be found using root locus or other means.\nThe zeros of T(s) can be found by plugging in for K,G,F, and clearing fractions. However,\nthe result is easy to state:\nThe zeros of T(s) are the zeros in the forwards path plus the poles in the feedback\npath. Suppose we add the requirement that\nkp e 20\nSo that steady-state tracking performance is acceptable. How can we modify the controller?\nLag Compensation\nA lag compensator has the form\ns ` α\ns ` β\n\nwhere β a α. Typically, α and β are much less (say, a factor of 100 than the natural\nfrequency of the dominant poles.\nWhy does this work? At low frequency ps « 0q, the gain of the lag compensator is\n0 ` α\nα\n\"\n0 ` β\nβ\nSo the lag compensator increases the d.c. gain by the lag ratio. However, the effect on the\ndominant pole location is small:\nIm(s)\nRe(s)\nφ\nψ\n(ψ-φ) small\nThe change in phase angle at the desired pole location is small (θp5 q), so the locus (away\nfrom the origin) doesn't change much.\nContinuing the example from last time, the natural frequency of the dominant pole is 4.24\nrad/sec. Need lag ratio of 5. So use compensator\ns ` 0.5\ns ` 0.1\nSo compensator with both lead and lag is\ns ` 3\ns ` 0.5\nKpsq \" 9.35\n\ns ` 6.9 s ` 0.1\nThe response looks like:\nt\n~10%\n\nThe peak overshoot is 3%, but the \"natural\" overshoot is about 10%. There is also a slow,\nexponential tail. This is typical with lag compensation. Why?\nThe closed-loop pole-zero diagram is\nIm(s)\nRe(s)\n-4\n-3\n-0.5\n-0.46\n-2.7+2.9j\nThe near pole-zero cancellation of pole at -0.46 means the effect of that pole is small, but it\nhas a very long time constant. This pole is responsible for the small but long time constant\nerror.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n16.06 Principles of Automatic Control\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "16.06 Principles of Automatic Control, Lecture 15",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-06-principles-of-automatic-control-fall-2012/c461316140b558c7c15c8173b9d36cd5_MIT16_06F12_Lecture_15.pdf",
      "content": "16.06 Principles of Automatic Control\nLecture 15\nThe Negative p0 q Root Locus\nSometimes, we need to plot the root locus for a negative gain parameter\nExample:\nLongitudinal dynamics of 747, M=0.8 at 20,000 ft.\nh \"altitude\nδe \"elevator deflection\nhpsq\n32.7ps ` 0.0045qps ` 5.645qps 5.61q\n\"\nδepsq\nsps ` 0.003 0.0098jqps ` 0.6463 1.1211jq\nPoles of system:\n- s \" 0 \"energy mode\" - represents change in total (kinetic plus potential) energy. Hard\nto control with elevator - hence near cancellation with zero at s \" 0.0045.\n- s \" 0.6463 1.1211j \"short period mode.\" The short period mode is dominated by\nchanges in aircraft pitch altitude, much like an arrow or weather vane feathering into\nthe wind.\n- s \" 0.003 0.0098j \"phugoid mode\". This mode represents long period exchange of\nkinetic and potential energy, with very small changes in aircraft angle of attack.\nNote that:\n1. There is a two orders of magnitude difference between the natural frequencies of the\nshort period and phugoid modes.\n2. The phugoid has only the modest damping (ζ \" 0.29). Often, it is much lower, say,\nonly a few percent.\n\nFor our discussion, the most interesting aspect is the right half plane zero at s \" `5.61.\nWhy?\nRewrite the transfer function as\nhpsq \" Gpsq \"32.7Lpsq\nδepsq\nO\nroot locus gain of G(s)\nLook at the feedback loop using only proportional gain1:\n-\n+\nk\nG(s)\nr\ne\nSo the characteristic equation is:\n0 \" 1 ` kGpsq \" 1` 32.7k\nloomoon Lpsq\nK\nThe question is, should k, (and therefore K) be positive or negative?\nNote that because there are an off number of RHP poles and zeros, the D.C. gain Gp0q is\nnegative. To improve performance at D.C., must have negative gain.\nThere are other situations where a negative R.L. gain may be required, but this is the most\ncommon.\nModification to the Root Locus Rules.\nThe fundamental result is that s is on the negative locus if\n1 ` KLpsq \" 0 n Lpsq \" K\nfor some negative K. If K is negative, 1{K is positive, so that the angle condition is\n1For this system, a PD controller would be better, but that is not important for our argument.\n\n=Lpsq \" 0 ` l 360 ,\nlinteger\nSo the rules are:\n- Rule 1: The n branches of the locus start at the n poles. m approach the zeros, n-m\napproach 8. (No change)\n- Rule 2: The locus is on the real axis to the left of an even number of poles and zeros.\n- Rule 3: The asymptotes are described by\nα \"\nr pi r zi\nn m\n,\n(no change)\nθl \"360 pl 1q\nn m\n,\nl \" 1, 2, 3, ...n m\nNote: no 180 term.\n- Rule 4: The departure angles from poles and the arrival angles at poles are given by\nr\nr\nΨi\nφi 360 pl 1q\nφdep \"\nq\nr\nr\nφi\nΨi ` 360 pl 1q\nΨarr \"\nq\nwhere q is multiplicity of pole or zero, l \" 1, 2, ...q.\n- Rule 5: The locus crosses the imaginary axis for values of K at which Routh's criterion\nshows a change in the number of unstable poles. (No change)\n- Rule 6: No change in rule for when there are multiple points on the locus.\nIn summary, all rules are the same, except:\n1. All 180 s become 0 s.\n2. \"Odd\" becomes \"even\" in Rule 1.\n\nExample\ns 1\nGpsq \" ps ` 1qps ` 3q\n0 locus:\nNote:\n- Locus looks familiar but is different\n- RHP zero tends to pull poles into RHP - bad.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n16.06 Principles of Automatic Control\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "16.06 Principles of Automatic Control, Lecture 16",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-06-principles-of-automatic-control-fall-2012/97d0ebb1b1071c91c35dae91e56a9af9_MIT16_06F12_Lecture_16.pdf",
      "content": "16.06 Principles of Automatic Control\nLecture 16\nFrequency Response Design\nProblems with root locus:\n- Works only for rational transfer functions:\nπps ziq\nGpsq \" πps piq\nIf we start with experiment data, it may be difficult or impossible to put Gpsq in the form\nabove.\n- The connection between performance of the system and the root locus is sometimes\npoor, so it is difficult to design for some kind of performance.\n- For simple problems, can guess that right solution is lead (for greater stability or faster\nresponse) or lag (for greater position or velocity constant). For other problems, it's\nharder to guess the right form of the compensator.\nFrequency response methods consider the behavior of Gpsq, Kpsq along the jω axis.\nThat is, we look only at plots of Gpjωq, Kpjωq to determine stability, performance.\nSome advantages:\n- Works with any Gpsq (or Gpjωq), whether rational or not.\n- It's relatively easy to determine Gpjωq from experimental data.\n- Performance requirements can usually be specified in terms of the frequency response\ncharacteristics.\n- The stability test is straightforward.\n- There are a few simple rules for determining the type of compensator to use.\n\nOne disadvantage:\n- Some of the ideas are difficult, even if the techniques are not.\nThe Frequency Response\nConsider an LTI system G with input u and output y:\nG\nu\ny\nIf the input is uptq \" est, then a particular solution is:\nyptq \" Gpsqe st\nFor a sinusoidal signal\nuptq \"A cos ωt\n\"ARepejωtq\nthe response is\nyptq \"ARepGpjωqejωtq\n\"ApRerGpjωqs cos ωt ImrGpjωqs sin ωtq\nSo the response is sinusoidal, with amplitude AM, where\nM \"|Gpjωq|\na\n\"\npRerGpjωqsq2 ` ImrGpjωqs2\nyptq can be expressed more simply as\nyptq \" AM cospωt ` φq\nwhere\nˆ\n\nImrGpjωqs\nφ \" tan\nRerGpjωqs\n\"=Gpjωq\n\nG may be expressed in polar form as\nGpjωq \"Mejφ\n\"M=φ\nSo if we plot |Gpjωq| and =Gpjωq versus ω, we can easily determine the response to any\nsinusoidal input.\nTerminology:\nM \" |Gpjωq| \" magnitude of Gpjωq\nφ \" =Gpjωq \" phase of Gpjωq\nFrequency Response of Lead Compensator\nRecall that lead compensator has the form:\ns ` ζ\nKpsq \"k\n, p a z\ns ` p\nO\nR.L. gain\nRewrite this as\nkζ 1 ` s{ζ\nKpsq \" p 1 ` s{p\n1 ` s{ζ\n\"K 1 ` s{p\nO\n\"Bode\" gain\nWhat is magnitude and phase?\na\n1 ` pω{ζq2\n|Gpjωq| \"K a\n1 ` pω{pq2\n=Gpjωq \" tan 1pω{ζq tan 1pω{pq\nTraditionally, |G| is plotted on a log-log plot, =G on a semilog plot, together called Bode\nplot.\n\nExample:\n1 ` s\nKpsq \" 1 ` s{10\nMagnitude (dB)\n-2\n-1\nPhase (deg)\nBode Diagram\nFrequency (rad/sec)\ndecade\nNotes:\n- Low-frequency magnitude = 1 = K(0)\n- High-frequency magnitude =10=K(8)\n- The phase is always positive - hence phase lead.\nOften, magnitude is expressed in decibels, which is basically the log of |G|:\n\nmagnitude in decibels=20 log10 |G|\nVisualization using Root Locus plane\nIn root locus form, the lead compensator is\n1 ` s{ζ\np s ` ζ\nKpsq \"\n\"\n1 ` s{p\nζ s ` p\nlooomooon\nloomoon\nBode form\nroot locus form\nBode gain=1 R.L. gain=p\nζ\nIm(s)\nRe(s)\n-ζ\n-p\nφ=tan-1(ω/p)\nψ=tan-1(ω/ζ)\np2+ω2\nl=\nζ2+ω2\nl=\n?\n?\nζ2`ω2\n1`pω{ζq2\nSo |G| \" p ?\n\" ?\n, as before.\nζ\np2`ω2\n1`pω{pq2\n=G \"Ψ φ\n\" tan 1ω{ζ tan 1 ω{p, as before.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n16.06 Principles of Automatic Control\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "16.06 Principles of Automatic Control, Lecture 17",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-06-principles-of-automatic-control-fall-2012/bc37be7b3dcc54ee00b70ad8f4df6044_MIT16_06F12_Lecture_17.pdf",
      "content": "16.06 Principles of Automatic Control\nLecture 17\nFrequency Response Design\nSuppose we want to design a closed-loop system with a specific desired response. How\nmight we use the FR to accomplish this?\nω2\nHpsq \"\nn\ns2 ` 2ζωns ` ωn\n\"\n(Bode form)\np s q2 ` p 2ζs q2 ` 1\nωn\nωn\nThe Bode (magnitude) plot is as shown in figure below.\nNote: See FPE Figure 6.3\nζ small\nζ large\nMr\nω/ωn\n|H|\n\nWe'll say more on Bode plot construction later. For now, a few importnat points:\n- The magnitude of the resonant peak is Mr\n- The resonant frequency, ωr, is close to ωn for lightly-damped systems with greater\ndamping.\n- The bandwidth (not shown) is the freq\n- uency at which |Hpωq| \" 0.707\n|Hp0q|\nFor a given unity-feedback control system\n-\n+\nK(s)\nG(s)\nr\nwhat will closed-loop transfer function\nKpsqGpsq\nT psq \" 1 ` KpsqGpsq\nlook like?\nlow\nfrequency\nhigh\nfrequency\nKG\nT\nT≈KG\ncrossover\nω\n| · |\nWe can consider three regimes\n1. Low frequency: |KG| \" 1\nIn this frequency range, T pjωq « 1.\n\n2. High-frequency: |KG| ! 1.\nIn this frequency range, T pjωq « KpjωqGpjωq\n3. Crossover: |KG|=1\nIn this frequency range, |T | \" | KG | \"\n1`KG\n|1`KG|\nNote that at crossover, |T | depends on the phase of KG.\nIf KG=1 (phase=0 ), |T | \" 1{2.\nIf KG=-1 (phase= 180 ), |T | \" 8!\nBottom line is that the phase at crossover has a strong effect on Mrfor the closed-loop system.\nFor now, it's enough to note that at crossover, we will have/want\n180 a =KG a 0\nIn practice, we want the phase to be well away from 180 , but it will usually be less than\n90 . A phase of 120 often works well, but that depends on the actual specifications.\nBode Plot Construction\nThe first step is to the transfer function of interest in Bode form\nα p1 ` s{s1qp1 ` s{s2q . . .\nKGpsq \" K0s p1 ` s{saqp1 ` s{sbq . . .\nWe can also have second order terms, which we will add later. Since we are plotting (for the\nmagnitudinal plot), log |KG|, we have\nlog |KGpjωq| \" log |K0| ` α log |ω|\n` log |1 ` jω{s1| ` . . .\nlog |1 ` jω{sa| . . .\nSo on a log scale, plots of the individual terms add, since the log of a product is the sum of\nlogs.\nThe K0sα term is plotted as a straight line, since\nlog |K0pjωqα \" log K0 ` lo α on log ω\nloooooomoooooon\nloomoon\nomo loomoon\nslope\ny-axis\nconst\nx-axis\nFor example, plot magnitude of 10{s2 :\n\n| - |\n0.1\n0.1\n-20\ndB\nslope=-2,\nor 20 dB/decade\nTo plot 1 ` s{a term, note that\n|1 ` jω{a| \"p1 ` ω2{a 2q1{2\n$\n'1\nω ! a\n&\n\"\nω{a\nω \" a\n'?\n% 2\nω \" a\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n16.06 Principles of Automatic Control\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "16.06 Principles of Automatic Control, Lecture 18",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-06-principles-of-automatic-control-fall-2012/6710ed719ba8922b352151fa5de3a640_MIT16_06F12_Lecture_18.pdf",
      "content": "16.06 Principles of Automatic Control\nLecture 18\nBode Plot Construction (continued)\nNote that phase of sα term is\n=pjωqα \"=jα \" α=j\n\"α 90\nTo plot 1 ` s{a term, note that\n|1 ` jω{a| \"p1 ` ω2{a 2q1{2\n$\n'1,\nω ! a\n&\n\"\nω{a, ω \" a\n'?\n% 2,\nω \" a\nExample:\nKpsq \" 1 ` s{20\n\n|K|\nω\ndB\n+1, 20 dB/dec\n2 ~ 3dB\nWhat about the phase?\n=1 ` jω{a \" tan 1ω{a\na\na/5\n5a\n°\n°\nω\nK\n11°\nThat is, the phase varies by 90 over the frequency range pa , 5aq.\nSome people find it easier to draw the construction lines with breakpoints at a{10, 10a.\n- Easier to draw\n- Less phase error\n\n- Middle segment is not technically an asymptote anyway\n°\n°\nω\nK\n6°\nFor K \" 1`\ns{a , the above magnitude and phase plots are flipped about |K| \" 1 or =K \" 0 .\n-2\n-1\n-90\n-45\nω\nω\nK\n|K|\na\n-1\nBode Rules:\nRule 1: Manipulate the transfer function into Bode form.\nRule 2: Determine α for K0sα term. Plot the low-frequency asymptote with slope α(or 20α\ndB/dec) through the point ω \" 1,\n1 1 \" K0.\n\nRule 3: Complete the composite magnitude asymptotes. At each break point, change the\nslope by 1, or 2, as appropriate.\nRule 4: Sketch in approximate magnitude curve. (see FPE for more details).\nRule 5: Plot the low frequency asymptote of the phase curve pφ \" α 90 q.\nRule 6: The approximate phase is found by changing the phase by 90 or 180 at each\nbreakpoint.\nRule 7: Locate the asymptotes for each phase curve, at break points 1{5 and 5 times (or\n1{10 and 10 times) the frequency of the magnitude break point.\nRule 8: Graphically add the asymptotes, and draw the approximate phase curve.\nExample:\n2000ps ` 0.5q\nKGpsq \" sps ` 10qps ` 50q\n2p1 ` s{0.5q\n\" sp1 ` s{10qp1 ` s{50q\nThe magnitude break points are\n0 0.5\nx 10\nx 50\nThe phase break points are\n0.05, 5\nx 1, 100\nx 5, 500\n\n0.1\n0.01\n0.01\n0.1\nChoose appropriate scales on log-log paper\nFrequency, ω (rad/sec)\nMagnitude\nPlot low-frequency asymptote\nK0=2, α=-1\n0.01\n0.1\nFrequency, ω (rad/sec)\n0.1\n0.01\nMagnitude\n\nComplete the composite magnitude asymptotes\nK0=2, α=-1\nslope=-1\nslope=-1\nslope=0\nslope=-2\n0.5\n0.1\n0.01\nMagnitude\n0.1\nFrequency, ω (rad/sec)\nSketch the appropriate magnitude curve\nK0=2, α=-1\nslope=-1\nslope=-1\nslope=0\nslope=-2\n0.5\n0.1\n0.01\nMagnitude\n0.1\nFrequency, ω (rad/sec)\n\n0.01\n0.1\nFrequency, ω (rad/sec)\n-180\n-150\n-120\n-90\n-60\n-30\nPhase\napprox.\nsmoothed\nversion\n0.05\n- 90 /dec\n- 45 /dec\n- 45 /dec\n0.01\n0.1\nFrequency, ω (rad/sec)\n-180\n-150\n-120\n-90\n-60\n-30\nPhase\n0.5\n\n- 45 /dec\n45 /dec\n-90 /dec\n0.05\n-180\n-150\n-120\n-90\n-60\n-30\nPhase\n0.01\n0.1\nFrequency, ω (rad/sec)\n0.5\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n16.06 Principles of Automatic Control\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "16.06 A primer on solving systems of linear equations",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-06-principles-of-automatic-control-fall-2012/c507f498eabaa8365599e4b2950f6061_MIT16_06F12_primer.pdf",
      "content": "A Primer on Solving Systems of Linear\nEquations\nIn Signals and Systems, as well as other subjects in Unified, it will often be\nnecessary to solve systems of linear equations, such as\nx +\n2y\n+\n3z\n=\n\n2x\n+\n5y\n+\n2z\n=\n\n(1)\nx\n+\ny\n+\nz\n=\n\nThere are are at least three ways to solve this set of equations: Elimination of vari\nables, Gaussian reduction, and Cramer's rule. These three approaches are discussed\nbelow.\nElimination of Variables\nElimination of variables is the method you learned in high school. In the example,\nyou first eliminate x from the second two equations, by subtracting twice the first\nequation from the second, and subtracting the first equation from the third. The\nthree equations then become\nx +\n2y\n+\n3z\n=\n\ny\n-\n4z\n=\n\n(2)\n-y\n-\n2z\n=\n\nNext, y is eliminated from the third equation, by adding the (new) second equation\nto the third, yielding\nx +\n2y\n+\n3z\n=\n\ny\n-\n4z\n=\n\n(3)\n-\n6z\n=\n\nFrom the third equation, we conclude that\nz = -\n(4)\nFrom the second equation, we conclude that\ny = 4z = -\n(5)\nFinally, from the first equation, we find that\nx = 1 - 2y - 3z =\n(6)\n\nGaussian Reduction\nA more organized way of solving the system of equations is Gaussian reduction.\nFirst, the augmented matrix of the system is formed:\n\n[\n\n]\n(7)\nEach row of the augmented matrix corresponds to one equation in the system of\nequations. The first three elements of each row are the coefficients of x, y, and\nz in the equation. The fourth element in each row is the right-hand side of the\ncorresponding equation.\nThe goal of the reduction process is to apply row operations to the matrix to get\nzeros below the first diagonal of the matrix. To do this for the example, subtract\ntwice the first row from the second, and the first row from the third, to obtain\n\n[\n3 1\n1 -4 0\n0 -1 -2 2\n\n]\n(8)\nThis produces zeros in the first column below the diagonal. Then add the second row\nto the third to obtain\n\n[\n\n-4\n\n-6\n\n]\n(9)\nNormally, the process is stopped at this point, and \"back substitution\" is used\nto solve for the variables. That is, the array above is really the same as the last\nreduction we did in elimination of variables, so we can proceed as before.\nAlternatively, we could continue the process further, by dividing the third row by\n-6, and then eliminating terms above the diagonal as well, as follows:\n\n[\n\n-4\n\n-1\n\n]\n(10)\nSubtract 3 times the third row from the first, and add 4 times the third row to the\nsecond:\n\n[\n\n]\n\n-\n(11)\n\n-\nFinally, subtract 2 times the second row from the first:\n\n[\n\n]\n-\n(12)\n\n-\n\nfrom which we conclude that\nx =\ny = - 3\nz = - 3\nas before.\nThere is really no need to repeatedly write down the augmented matrix. Instead,\nit is convenient to write down the matrix with space between the rows, and update a\nrow at a time, crossing out the old row. (See attached page.)\nNote that the two methods, elimination of variables and Gaussian reduction, are\nreally the same approach. The only real difference is that in Gaussian reduction, we\ndon't bother to write down x, y, and z. Instead, the variables are associated with\ncolumns of the augmented matrix.\nCramer's Rule\nCramer's Rule is a method that is useful primarily for low-order systems, with\ntwo or three unknowns. Cramer's rules states that each unknown can be expressed\nas the ratio of two matrix determinants. For example, x (the first variable) is given\nby\n\n-28\n\n(13)\nx =\n=\n=\n-6\n\nThe denominator is the determinant of the matrix of coefficients of the equation, i.e.,\n\n[ 2\n\n]\n\nThe numerator is the determinant of the same matrix, except with the first column\nreplaced by the three numbers on the right-hand side of the equations. Likewise, y is\nfound by a similar ratio, with the top matrix found by replacing the second column\n\nof the denominator matrix by the right-hand side column:\n\ny =\n=\n= -\n(14)\n\n-6\n\nFinally,\n\nz =\n=\n= -\n(15)\n\n-6\n\nCramer's rule is very handy for second- and third-order systems. However, it\nis much less useful for larger systems, because the determinant calculation becomes\nprohibitive, if done in the conventional way. (See section below.) Determinants can\nalso be found by Gaussian reduction; however, the reduction process does more than\ndetermine the determinant, it also solves the equations! So just use Cramer's rule for\nsmall \"toy\" problems.\nDeterminants\nFinally, you need to know how to take determinants of matrices. For second-order\nmatrices,\na\nb\n=\n\nad - bc\n(16)\nc\nd\n\nFor third-order systems,\na\nb\nc\n\nd\ne\nf\n= aei + bfg + cdh - afh - bdi - ceg\n(17)\ng\nh\ni\n\nBoth of these have an obvious pattern--each of the terms is the product of diagonals,\nwith a + sign for one direction of diagonal, and a - sign for the other direction. Note\nthat for the third-order case, the diagonals \"wrap around.\"\nFor higher-order systems, there are two approaches to find the determinant. One\napproach is to do Gaussian reduction to obtain a triangular matrix. The determinant\nis then the product of the terms on the main diagonal.\nThe other approach is to decompose the determinant along, say, the first row of\nthe matrix. For each element A1j along the first row of the matrix, find the matrix\n\nformed by deleting the first row and jth column. Call the determinant of that matrix\ndj. Then\n|a| = A11d1 - A12d2 + . . . - (-1)nA1ndn\n(18)\nFor example,\na\nb\nc\n\nd\ne\nf\n\ng\nh\ni\n\n=\n\na\ne\nf\n\nh\ni\n-\n\nb\nd\nf\n\ng\ni\n+\n\nc\nd\ne\n\ng\nh\n\n(19)\nActually, we can expand on any row or column as above. When expanding on an\neven-numbered row or column, the sign of the determinant is changed.\nThe only problem with the approach is that the amount of calculation required\nto calculate the determinant using this approach goes like n!, but only goes like n3\nusing Gaussian reduction. So it usually isn't used for systems much higher than third\norder.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n16.06 Principles of Automatic Control\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "16.06 Principles of Automatic Control, Recitation 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-06-principles-of-automatic-control-fall-2012/73db4620a30a8f23e28a4e5cc3fa3d03_MIT16_06F12_Recitation_1.pdf",
      "content": "16.06 Principles of Automatic Control\nRecitation 1\n-\n+\ny\nu\n-1\nu\ny\nu\ny\nr\ne\nFind y as a function of r:\n+\nu \" 5e\nThese come from feedback diagram\ne \" r y\nNow substitute u \" 5pr yq\ny is a piecewise function.\n\n$\n'u 1,\nu a 1\n&\ny= 0,\n1 a u a 1\n'\n% u ` 1,\nu a 1\nNow do a substitution for each of the regions:\nua 1\n1 au a 1\nua 1\ny \" 5pr yq 1\ny \" 0\ny \" 5pr yq ` 1\n6y \" 5r 1\n6y \" 5r ` 1\ny \" r\ny \" r `\nLast step is to find a breakpoint:\nua 1\nua 1\n5pr yq a 1\nr 5 r ` 1 a 1\n5pr yq a 1\nr 5 r 1 a 1\nr a\nr a\ny\nu\n-1/5\n5/6\n1/5\n5/6\nSo the system becomes less non-linear. Increasing the gain would reduce the deadban area\nand increase the slope towards 1.\nNow have non-linear portion in feedback loop.\n\n-\n+\nu\nr\ne\ny\nu\n-1\nSo now output is u, and we want to find u as a function of r.\n+\nu \" 5e\nequations from block diagram\ne \" r y\nu \" 5pr yq N substitution\n$\n'\nu \" 5e,u a 1\n&\ny \"\ne \" r y, 1 a u a 1 N these are equations of non-linear function\n'\n%\nu ` 1,u a 1\nSubstitute for y in each piece:\nua 1\n1 au a 1\nua 1\nu \" 5r 5u 5\nu \"5r\nu \" 5r ru ` 5\n6y \" 5r 5\n6y \" 5r ` 5\nu \" r\nu \" r `\nFor limits on r:\nua 1\nua 1\nr\na 1\nr `\na 1\nr a\nr a\n\nu\nr\n5/6\n-1/5\n1/5\n5/6\n-1\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n16.06 Principles of Automatic Control\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "16.06 Principles of Automatic Control, Recitation 10",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-06-principles-of-automatic-control-fall-2012/50e5b1062509c5a352d0a70607363680_MIT16_06F12_Recitation_10.pdf",
      "content": "16.06 Principles of Automatic Control\nRecitation 10\nDesign a compensator strategy for a system\n\ns\n1 300\nGpsq \"5\n\n1 ` s\n1 ` s\nto have a closed loop system that will have PM \" 45 , and rise time as fast as possible.\nLet's first identify the \"big picture\" strategy. In typical problems, there is no limit on ωc\n(tr as fast as possible would mean ωc as high as possible, since tr « ω\nc ). But because of\nat 300\nthe RHP zero, we would need to set ωc\n2 or 3 , which would provide 20% undershoot,\nwhich is too much (not accessible), so let's aim to set ωc at 100 rad/sec.\nSo the big picture strategy consists of two parts:\n1. Design lead compensator in the vicinity of ωc.\n2. Then design a lag compensator to get the desired gain at low frequency, at ω „ ωc .\nTherefore, since we will add a lag compensator, with a zero a decade before the crossover\nfrequency, we will need to account for „ 6 extra phase when designing the lead compensator\n(that we will lose due to the phase lag contribution of the lag compensator).\nStep 1. Lead compensator at ωc \" 100 rad/sec:\n1 ` s\nK\na\n1 ` s\nb\nˇ\n`100\n`100\n`100\nˇ\nphase of Gpsqˇ\n= tan\ntan\ntan\nω\"100\n\" 78.69 87.71 18.43\n\" 184.83\n\nand we need a PM \" 45 .\n6 we need the compensator to provide\n45 ` 6 ` p 180 p 184.83 qq \" 55.83\n`b\n6 55.83 \" 2 tan 1\nb 90\na\nb\na\nn\nb \" 3.25 and, since ωc \" 100 \"\npabq:\n#\na\nb \"\na \" 30.77\nTo find K, we use the magnitude condition:\nb\nb\n1 ` p 100 q2\n1 ` p 100 q2\n30.77\n1 \" |KpsqGpsq|ωc \"100 \"5?\n?\nb\nK\n1 ` 52 1 ` 252\n1 ` p 100 q2\n6 K „7.45\n6 lead compensator:\ns\np1`\nq\n30.77\nKpsq \" 7.45\ns\np1`\nq\nStep 2. Design the lag compensator: zero 1 decade below crossover:\ns ` a Ns ` 10\ns ` b\ns ` b\nbut low frequency gain is „ 7.45 5 „ 37.25 rad/s.\nKp requirement N need 200 N lag ratio „ 5.37 \"\nN b „ 1.86\nb\n6 lag compensator:\ns ` 10\ns ` 1.86\n\n`\n\n7.45 1 `\ns\nps ` 10q\n30.77\nKfinpsq \"\n`\n\ns\n1 `\nps ` 1.86q\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n16.06 Principles of Automatic Control\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "16.06 Principles of Automatic Control, Recitation 11",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-06-principles-of-automatic-control-fall-2012/4a57e45ac6d79274072af665524fdcf7_MIT16_06F12_Recitation_11.pdf",
      "content": "16.06 Principles of Automatic Control\nRecitation 11\nSketch a Nichols plot of:\nGpsq \" ps ` 1q3\ns \" 3 tan 1pωq \" 180\nω \"1.73\n6 K \"\n\n? 1\n\" ? 1\n\" 1 \" K\n1 ` 3\np 1 ` 3q3\nStart with Bode plot of the system:\n-3\n-2\n-1\n-2\nMagnitude, dB\n-3\n-2\n-1\n-300\n-250\n-200\n-150\n-100\n-50\nPhase (deg)\nFrequency, ω (rad/sec)\n-3\n\nNichols:\n0.1\n0.01\n-360\n-270\n-90\n|G(jω)|\nG(jω)\nBut, similar to Nyquist, we need to reflect the plot, so what we really have is:\n0.1\n0.01\n-360\n-270\n-90\n|G(jω)|\nG(jω)\n0.125\nk>0\nk<0\nNow the question is how do we count the number of encirclements? Z \" N ` P still applies!\nA clockwise encirclement in Nyquist is equivalent to leftward crossing in Nichols. In Nyquist,\nwhen counting encirclements, always on imaginary axis. In Nichols, this corresponds to 0\nvertical line. Along 0 line there is one leftward crossing, which makes N \" 1. Along 180\n\nline for magnitudes greater than 0.125, N \" 0. For magnitudes lower than 0.125, N \" 2.\nWhat gain corresponds to boundary point?\n8 a\na\nK\n0 aK a 8\n0 a\na 1\nK\nK a 1\nso stable for 1 aK a 8\nCheck with Nyquist and get the same result!\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n16.06 Principles of Automatic Control\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "16.06 Principles of Automatic Control, Recitation 12",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-06-principles-of-automatic-control-fall-2012/5e824afd8ad84569e270baf48ce45f8f_MIT16_06F12_Recitation_12.pdf",
      "content": "16.06 Principles of Automatic Control\nRecitation 12\nDesign (by emulation) a discrete time controller for:\nGpsq \"\nsatisfying:\nps ` 2q2\nωc \" 50 r/s\nMp d 25%\nKp e 5000\nT \" 0.01 sec\nGpsq \" p s ` 1q2\nMp \" 0.25 \" e π tan θ N ζ \" sin θ N PM „ 40.4\nThe strategy is to first design a lead compensator followed by a lag compensator (to satisfy\nthe high Kp value), while accounting for the ZOH delay of ωc\nT\nπ .\nStep 1. Lead compensator:\n`\n\ns\nk\n` 1\n?\na\n`\nN ab \" ωc \" 50\np1q\ns\nb ` 1\nc\nb\nωcT\n2 tan\n90 \" 180 sGpωcq ` PM `\n\n` 6 plagq\na\nπ\n\" 180 p 175.4 q ` 40.4 ` 14.3 ` 6\n« 56.1\n\nc\nb\nn\n«3.28\np2q\na\nEquations (1) and (2) yield:\nb \"164\na \"15.2\np s\n15 ` 1q\nKleadpsq \"7.5 p s ` 1q\nTo find k :\nb` 2\n` 12\n1 \"25 k b 15\np164 q ` 12\nk \"7.5\nStep 2. Lag compensator:\nDesired low frequency gain is 5000 :\n6 for Klagpsq \"s ` a\ns ` b N a\nb 25 7.5 \" 5000\nchoose a to be 1 decade below ωc : a \" 5.\n5 25 7.5\n6 b \"\n« 0.19\n6 overall compensator:\n`\n\n7.5\ns ` 1\nps ` 5q\nKpsq \" `\n\ns ` 1\nps ` 0.19q\n\nUsing MATLAB, we see that there is excessive overshoot:\n38% N 13%, too much.\nTherefore, we will need to change ζ by „ 0.1, PM by „ 10 .\nb\nNeed to redesign lead compensator: 2 tan 1\na\nb 90 \" 56.1 .\nNeed to re-design lag compensator:\n`\n\n5.3\ns ` 1\nps ` 5q\n`\n10.6\n\nKpsq \"\n\ns ` 1\nps ` 0.13q\n236.2\nwhich yields:\nKp \" 5000, and 23.3% overshoot.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n16.06 Principles of Automatic Control\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "16.06 Principles of Automatic Control, Recitation 13",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-06-principles-of-automatic-control-fall-2012/b1c883836955c2d9740607a9a74a827b_MIT16_06F12_Recitation_13.pdf",
      "content": "16.06 Principles of Automatic Control\nRecitation 13\n-+\nK(z)\nG(s)\nr(t)\ne\nZOH\nGd(z)\ny\nT\nE\nE\n\"\nN E \"\nR\nR\n1 ` KG\nR\ness \" lim eptq \" lim s Epsq, in continuous time.\ntN8\nsN0\ness \" lim erks \" limpz 1qEpzq\nkN8\nzN1\nFor a step input, r \" σptq.\nC\nD\ness \"\n1`Kp0q Gp0q\ness \"\n1`Kdp1qGdp1q\nKp\nKp\n\" Kp0qGp0q\n\" Kdp1qGdp1q\nGiven a type I system:\nL0pzq\nLpzq \"Gdpzq Kdpzq \" z 1\nFind Kv :\nEpzq\n\"\nRpzq 1 ` KdpzqGdpzq\nEpzq\nTz\nEpzq \"\nRpzq \"\n\nRpzq\n1 ` L0pzq\npz 1q2\nz 1\n\nwhere Tz is unit ramp from the table.\nTherefore,\nTz\ness \" limpz 1q\n\nzN1\n1 ` L0pzq\npz 1q2\nz 1\nTz\n\" lim\nzN1 z 1 ` Lopzq\nT\n\" L0p1q\n\" Kv\nLop1q\n\"\n, in discrete time.\nn Kv\nT\nUsing the w-transform:\n\n1` wT\n1` wT\n1 wT\nL0pzq\nL0\n1 wT\nL0\n1 wT\nTake\n\"\n\"\n1` wT\nz 1\nwT\n2 1\n1 wT\n\n1` wT\n1 wT\n1 wT\nL0\n6 Kv \" lim\nw\nwN0\nwT\nL0p1q\n\"\nT\nThe w-transform preserves Kp and Kv.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n16.06 Principles of Automatic Control\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "16.06 Principles of Automatic Control, Recitation 2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-06-principles-of-automatic-control-fall-2012/82a3a9b474b86097dda269af65cd26a4_MIT16_06F12_Recitation_2.pdf",
      "content": "16.06 Principles of Automatic Control\nRecitation 2\n1. Given the transfer function Gpsq \"\n, sketch the step response.\ns2`s`1\nGeneral form of second order system:\nω2\nn\ns2 ` 2ζωns ` ωn\nωn \" 1\nζ \" 1{2 a\nωd \" ωn\n1 ζ2 \" 0.866\n?\nπζ{\n1 ζ2\nMp \" e\nπ\ntp \"\nsec\nωd \" 3.62\n1.8\ntr «\n\" 1.8 sec\nωn\n4.6\nts \"\n\" 9.2 sec\nζωn\n\nr\n2. What if\ns ` 1\nGpsq \"\n`\n?\ns2 ` s ` 1\ns2 ` s ` 1\nRecall that in Laplace domain multiplying by s is equivalent to taking derivative in time.\nWe can easily graph this step response by plotting the derivative and the function and then\nadding them together.\n\nThe system in this number Gpsq \" ps ` 1q{ps2 ` s ` 1q is the same system as in #1, but with\nan additional zero at s \" 1. We note that in the step response, the addition of this zero\nresults in a faster rise time but also in a higher percent overshoot.\nTo obtain approximation for the peak of the \"derivative curve\", we can use the rise time to\nestimate the average slope around the inflection point. So average slope is:\np0.9 0.1q\n0.8\nslope \"\n\"\n\" 0.44\ntr\n1.8\nBut since this is the average slope, the maximum slope will be higher, i.e. « 0.5 0.6 (0.55\nin this case).\nAlso, note that the 2 curves intersect at the maxima and minima (since the derivative curve\nhas value zero there). This implies that the peaks of the second curve are greater, i.e. the\naddition of the zero has increased the overshoot (which is a bad thing), but it has also sped\nup the system (which can be a good thing). Lesson here: one must also consider the effect of\nthe zeros and not only that of the poles (see future class notes and lectures for more details).\nAnother point here: the slope of the derivative curve is discontinuous at t \" 0, while the\nslope of the original curve is continuous at t \" 0.\nThe function\ns`1\nhas two poles and one zero, and thus is of relative degree 1.\ns2`s`1\nThe function\nhas 2 poles and no zeros, and thus is of relative degree 2.\nps2`s`1q\nThe greater the relative degree, the smoother the step response curve is.\n\nNow what if :\ns ` 1\ns\nGpsq \"\n\"\n`\ns2 ` s ` 1\ns2 ` s ` 1\ns2 ` s ` 1\nso now we want to subtract derivative from our original response.\nNotice that this system has a zero in the RHP:\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n16.06 Principles of Automatic Control\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "16.06 Principles of Automatic Control, Recitation 3",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-06-principles-of-automatic-control-fall-2012/9fad6707ac033c1fd154bef9ba24e854_MIT16_06F12_Recitation_3.pdf",
      "content": "16.06 Principles of Automatic Control\nRecitation 3\nRouth Array\n-\n+\ns2\ns4+10s3+35s2+50s+24\nK\nPart 1.\nFor the feedback system above, find the values of K that make system stable/unstable.\nFor unstable system. determine # of RHP poles.\nKs2\nHpsq \" s4 ` 10s3 ` p35 ` Kqs2 ` 50s ` 24\nRouth Array:\ns4 :\n35 ` K 24\ns3 :\ns2 : 30 ` K\ns1 :\n1260`50K\nK`30\ns0 :\nIn order for the system to be stable, we need all elements in the first column to be positive,\nbut the elements in the first column will change depending on K. Start by finding critical\nvalues for K :\nK ` 3 a 0 N K a 30\n\n1260`50K\n30`K\na 0 N K a 25.2\nNow consider the sign on the first elements of the first column for different ranges of K:\nK a 30\n25.2 a K a 30\nK a 25.2\n`\n`\n`\n`\n`\n`\n\n`\n`\n`\n\n`\n`\n`\n`\n2 sign changes\n2 sign changes\nno sign changes\n2 RHP poles\n2 RHP poles\nno RHP poles\nunstable\nunstable\nstable\nPart 2.\ns 3 3s ` 2\nRouth array:\ns3 :\n1 3\ns2 :\ns\nHere, in the second row, we have a \"0\" in the first column. Since we can't divide by \"0\", we\nreplace that entry by a small constant t and proceed.\nt a 0 t a 0\ns3 :\n`\n`\ns2 :\nt\n2 N\n`\n\nN 2 sign changes N\n2 RHP poles\ns :\n3 2{t\n\n`\n`\n`\nOne can factor the polynomial and check:\ns3 3s ` 2 \" ps 1q2ps ` 2q N poles at:s \" 1, 1, 2.\nIndeed, we have 2 RHP poles.\nPart 3.\ns 5 ` 2s 4 ` 24s 3 ` 48s 2 25s 50\n\ns5 :\n`\ns4 :\n`\ns3 :\n`\ns3 :\nN\n`\nN One sign change\nN 1 RHP pole.\ns2 :\n`\ns :\n112.7\n\n1 :\nFor row 3, we get the entire row of zeros. Take previous characteristic equation (s4): auxiliary\npoles.\nP psq \" 2s4 ` 48s2 50, differentiate this:\nBP\nBs \" 8s3 ` 96s. We use this results' coefficients in the s row.\nRoots of auxiliary polynomial are shown below:\n5j\n-5j\n-1\ns2 \" 1 N s \" 1\ns2 \" 25 N s \" 5j\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n16.06 Principles of Automatic Control\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "16.06 Principles of Automatic Control, Recitation 4",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-06-principles-of-automatic-control-fall-2012/a67ac2562a6b94386b79cf03810658de_MIT16_06F12_Recitation_4.pdf",
      "content": "16.06 Principles of Automatic Control\nRecitation 4\nProblem 1.\ns\nSketch the root locus for Lpsq \" ps`1qps`4q .\n180 `360\n\"\n\" 180 , open loop pole at s \" 1, s \" 4. Zero at s \" 0.\nφR\n2 1\nIm(s)\nRe(s)\n-1\n-4\nProblem 2.\ns\nSketch the root locus for Lpsq \" ps 1qps 4q .\n180 `360\nφR \"\n2 1\n\" 180 , open loop pole at s \" 1, s \" 4. Zero at s \" 0.\nTo find departure/arrival point from real axis, use characteristic equation:\nks\n1 ` kLpsq \" 0 N1 `\n\" 0\ns2 5s ` 4\n\nn s 2 ` pk 5qs ` 4 \" 0\nUse quadratic formula\na\npk 5q\npk 5q2 16\n\n?\npk 5q2 16\nThe\nterm may be real or imaginary. If we sent it equal to zero and solve for k,\nthat is the gain at which the transition from real to imaginary occurs.\na\npk 5q2 16 \" 0\npk 5q2 \"15\n|k 5| \"4\nN k \"1, 9\nNow need to put k values back into characteristic equation, and solve for s. This will tell us\nthe location of the roots.\nk \" 1 N s2 4s ` 4 \" 0, two roots at s \" 2, k \" 9 N s2 ` 4s ` 4 \" 0.\nTwo roots at s \" 2.\nWhen k \" 5, the real part of the quadratic equation is zero, so this is the value of k for when\nthe locus intersects the imaginary axis. Plugging k \" 5 into characteristic equation:\ns2 ` 4 \" 0 NIntersects imaginary axis at s \" 2j.\nIm(s)\nRe(s)\n\nProblem 3.\nSketch the locus of Lpsq \" ps`1qps\ns\n`\n`\nqps`20q\n1 2`3 20\nα \"\n\" 10\n3 1\nIm(s)\nRe(s)\n-10\n-20\nIf the pole at s \" 20 were closer to the zero, the locus would look more like\ns=-8\ns=-14\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n16.06 Principles of Automatic Control\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "16.06 Principles of Automatic Control, Recitation 5",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-06-principles-of-automatic-control-fall-2012/3e0110be3a09d34f4ef2044cbd093446_MIT16_06F12_Recitation_5.pdf",
      "content": "16.06 Principles of Automatic Control\nRecitation 5\nProblem 1.\nSketch the positive (180 ) and negative (0 ) root locus for following system:\ns 2\nGpsq \" ps2 ` 1qps ` 2qps ` 5q\n.\nPoles are at s \" j, 2, 5.\nZero are at s \" 2.\np0`0 2 5q p2q\nα \"\n\" 3\n4 1\nAsymptotes are at angles of 60 , 180 for positive locus.\nAsymptotes are at angles of 120 , 0 for negative locus.\nAngle of departure from pole at s \" `j for positive locus is\ny\ny\nΨdep \"\nφ\nψ ` 180\n` 1\n`1\n`1\n`2\n\" tan\ntan\ntan\ntan\n` 180\n\"153.4 26.6 113 90 ` 180 \" 205.6\nFor the negative locus the departure angle is\n` 1\n`1\n`1\n`2\nΨdep \" tan\ntan\ntan\ntan\n\" 25.6\n\nk<0\nk>0\nasymptote\nk<0\nk>0\nk>0\n-2\n-4\n-6\n-8\n-10\n-2\n-4\n-8\n-10\n-6\nProblem 2.\nSketch the negative root locus for the following system:\ns ` 4\nGpsq \" sps ` 2qps ` 3qps ` 8q\nPoles are at s \" 0, 2, 3, 8.\nZero are at s \" 4.\np0 2 3 8q p 4q\nα \"\n\" 3\nAsymptotes are at 0 , 120 .\n\n-2\n-4\n-8\nThe zero attracts the locus, so it actually crosses the asymptotes, which is permissible.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n16.06 Principles of Automatic Control\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "16.06 Principles of Automatic Control, Recitation 6",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-06-principles-of-automatic-control-fall-2012/4bdc391d26febf38f24ea8c0d8376c69_MIT16_06F12_Recitation_6.pdf",
      "content": "16.06 Principles of Automatic Control\nRecitation 6\nBode Diagrams\n10ps ` 5q\nps ` 0.1qps ` 20q\nFirst, re-write in Bode form:\n10 5ps{5 ` 1q\n25ps{5 ` 1q\n\"\n0.1p10s ` 1q20ps{20 ` 1q\np10s ` 1qps{20 ` 1q\nα \" 0, K \" 25.\nLFA:\nslope \" α \" 0\nM \" 25 at ω \" 1\nHFA:\nslope \" pn mq \" 1\nBreak Points: pole at 0.1, 20, zero at 5.\n(At poles, slope decreases by one, at zeros, slope increases by 1)\n\n-2\n-40\n-20\nMagnitude\n-2\n-150\n-100\n-50\nPhase (deg)\nFrequency, ω (rad/sec)\nω\nω\nBreak points are the same for phase.\nStart at 0 because α \" 0 . At poles phase drops 90 , at zeros it increases by 90 . For the\nphase plot though, we use construction lines to help us draw plot better.\n\n0.1\n0.01\n0.001\n0.1\n0.01\n-90\n\n0.1\n0.01\n0.001\n0.1\n0.01\n-90\n\n0.1\n0.01\n0.001\n0.1\n0.01\n-90\n\n0.1\n0.01\n0.001\n0.1\n0.01\n-90\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n16.06 Principles of Automatic Control\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}