{
  "course_name": "Prizewinners: Nobelistas",
  "course_description": "This half-semester Samplings course, worth six instead of the typical twelve credits, drew attention to the thirteen female Nobel laureates. As the MIT Literature website explains, Samplings serve students looking for “a less intensive, more discussion and reading oriented way of continuing literary study.” Secondly, “they allow the Literature Faculty to offer occasional subjects that cannot be permanently and regularly offered. Finally, they are a site of experimentation—a way of trying out new authors and new themes.”",
  "topics": [
    "Humanities",
    "Literature",
    "Comparative Literature",
    "Criticism",
    "Humanities",
    "Literature",
    "Comparative Literature",
    "Criticism"
  ],
  "syllabus_content": "Course Meeting Times\n\nThis course meets in the second half of the semester.\n\nSessions: 2 sessions / week, 1.5 hours / session\n\nClass Description\n\nThis Sampling course, worth six instead of the typical twelve credits, drew attention to the thirteen female Nobel laureates. As the\nMIT Literature website\nexplains, Samplings serve students looking for \"a less intensive, more discussion and reading oriented way of continuing literary study.\" Secondly, \"they allow the Literature Faculty to offer occasional subjects that cannot be permanently and regularly offered. Finally, they are a site of experimentation--a way of trying out new authors and new themes.\"\n\nThis version of \"Prizewinners\" looks at women writers who have won the Nobel Prize in Literature. There have been thirteen so far:\n\nSelma Lagerlof (1909)\n\nGrazia Deledda (1926)\n\nSigrid Unset (1928)\n\nPearl Buck (1938)\n\nGabriela Mistral (1945)\n\nNelly Sachs (1966)\n\nNadine Gordimer (1991)\n\nToni Morrison (1993)\n\nWislawa Szymborska (1996)\n\nElfrieda Jellinek (2004)\n\nDoris Lessing (2007)\n\nHerta Muller (2009)\n\nAlice Munro (2013)\n\nWe will read novels or stories by five fiction writers--Gordimer, Morrison, Lessing, Muller, and Munro--with particular attention to narrative patterns in the texts, the socio-historical context of each writer, and critical reception of these works. Questions about how the Nobel Prize functions and is understood and about how Literature relates to the other Nobel subject areas--Peace, Chemistry, Physics, Medicine, Economic Sciences--will feature in our discussions too.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nResponse Papers (2 total)\n\n30%\n\nIn-Class Presentation\n\n10%\n\nEssay\n\n30%\n\nParticipation\n\n30%\n\nCalendar\n\nSES #\n\nTOPICS\n\nDUE DATES\n\nIntroduction\n\nNadine Gordimer\n\nNadine Gordimer (cont.)\n\nToni Morrison\n\nToni Morrison (cont.)\n\nToni Morrison (cont.)\n\nResponse paper 1\n\nHerta Muller\n\nHerta Muller (cont.)\n\nDoris Lessing's stories\n\nResponse paper 2\n\nAlice Munro\n\nAlice Munro (cont.)\n\nAlice Munro (cont.)\n\nSubmission of final essay\n\nFinal essay\n\nHow to Succeed in\n21L.315 Prizewinners\n\nCome to class. Each student will be allowed 1\nexcused\nabsence (i.e. discussed in advance). For each additional absence your letter grade will drop by a third. Two latenesses count as one absence.\n\nBring the assigned text to class and be prepared to discuss with the group. If you have not completed the reading or feel otherwise unprepared, it is far, far better to come to class than to miss the discussion.\n\nA conference with me is required before the end of our course. These are useful for brainstorming response papers and the final essay, clarifying issues in the reading, or preparing for an in-class presentation.\n\nHand your materials in on time. Lateness will result in lower grades, dropping by a third per day.\n\nAsk for an extension (because of illness, family crisis, or other equally difficult circumstances) well ahead of the due date.\n\nKnow Your Resources\n\nLearn exactly what constitutes plagiarism and how to avoid it. This is the Literature Section's policy on plagiarism: Plagiarism--use of another's intellectual work without acknowledgement--is a serious offense. It is the policy of the Literature Faculty that students who plagiarize will receive an F in the subject, and that the instructor will forward the case to the Committee on Discipline. Full acknowledgement for all information obtained from sources outside the classroom must be clearly stated in all written work submitted. All ideas, arguments, direct phrasings, and images / media taken from someone else's work must be identified and properly footnoted. Quotations from other sources must be clearly marked as distinct from the student's own work. For further guidance on the proper forms of attribution, consult the\nstyle guides available in the Writing and Communication Center\n, and the\nMIT Website on Plagiarism\n.\n\nUse the\nWriting and Communication Center\n, which offers\nfree\nprofessional advice to MIT students about oral presentations and about all types of academic, creative, and professional writing.\n\nStudents with Disabilities that might affect their work, in or out of class, should check with me as soon as possible (privately after class or by email).\n\nStudent Support Services (S^3)\n: If you are encountering academic difficulty of any kind, be sure to take advantage of the resources at S^3. \"If you are dealing with a personal or medical issue that is impacting your ability to attend class, complete work, or take an exam, please discuss this with Student Support Services (S3). The deans in S3 will verify your situation, and then discuss with you how to address the missed work. Students will not be excused from coursework without verification from Student Support Services.\"\n\nResearch & Library\n\nFinally: Devices. Please turn off electronic devices unless we need them for that day's work. Any use of cellphones or other devices for communication with the world outside the classroom will signal that you are mentally absent, and you will be counted absent for that day.",
  "files": [
    {
      "category": "Resource",
      "title": "MLA Citation Form",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-315-prizewinners-nobelistas-spring-2014/2bb8343bd93cfa36137150a4d3c65fe5_MIT21L_315S14_MLA_Citation.pdf",
      "content": "MLA Citation Form\nExample from a Sample Essay:\nThere can be no doubt that the Apothecary's potions are powerful. As Romeo proclaims, \"O true\napothecary, / Thy drugs are quick\" (IV, iii 119-20). But what are they made of? Some scholars\nhave argued that Shakespeare based the death potion on known poisons, borrowing his medical\nknowledge from the leading authorities of the day (Hastings 16, Birk 107). Compendia of\nmedieval remedies include poisons alongside standard therapeutic drugs (Stark 11). But Craig V.\nPopuli has shown that Shakespeare could not have encountered a real-life death potion; he must\nhave fabricated it imaginatively for the concluding scenes of Romeo and Juliet (29). The fatal\ndrink: fact or fiction?\nWorks Cited\nBirk, Alan. \"Romeo's Last Purchase: Buying Poison in the Renaissance.\" Early Modern\nLiterature 58 (1999): 285-301. Rpt. in Shakespearean Criticism. Ed. Mark W. Scott. Vol.\n5. Detroit: Gale Research, 1987. Literature Resource Center. Web.\nHastings, Nancy B. Shakespeare's Apothecary Shop: Medical Knowledge in Renaissance\nLondon. Cambridge, MA: MIT Press, 1998.\nPopuli, Craig V. \"Herbs, Simples, and Venom: Drugs in Romeo and Juliet.\" Journal of Fictional\nMedicine 45 (2003): 18-36. Print.\nShakespeare, William. Romeo and Juliet. Ed. Barbara A. Mowat and Paul Werstine. New York:\nSimon and Schuster, 1992.\nStark, Alexandra. \"Medieval Medicine Mastered.\" In Medicine Through History. Ed. Jonathan\nCraik. Yale Medical School. (September 6, 2011). Web.\n\n[From the Mayfield Manual, on MLA Citation Form]\nGeneral Structure\nThe MLA Handbook for Writers of Research Papers, 4th ed. (1995), recommends a system of in-text\ncitations that clearly point to entries included in a reference list, called Works Cited at the end of the\ndocument. . . . MLA style emphasizes the exact location of information. Consequently, the specific page\nnumbers of a reference are always listed in the citation unless the reference is clearly to the entire source as\na whole.\nCitation in Text\n\nThe connection between brain damage and autism is no longer disputed (Bailey 8).\n\nEntry in List of Works Cited\n\nBailey, Arthur. \"The Biology of Autism.\" Psychological Medicine 23 (1993): 7-11.\n\nName of Author Included in Text\nMLA style encourages placing the name of the author in the running text, thus decreasing the number and\nsize of parenthetical citations and making the prose more readable. If the name of the author is included in\nthe text, include in the citation only the page number (and, if your Works Cited list includes two works by\nthe same author, a short title).\n\nBailey concludes that the connection between brain damage and autism is no longer disputed (8).\nWilliams independently reached the same conclusion (111-19).\nPlacement of Parenthetical Citation\nBecause MLA style emphasizes readability, it recommends, in general, placing parenthetical citations at the\nend of the sentence rather than immediately after the information being cited. If the author's name is\nincluded in the text, the page number should still be placed at the end of the sentence.\nPage Numbers\nIndicate page numbers without p. or pp. For a range of numbers, give the full first number and the final two\ndigits of the last number with a hyphen in between. Give more than two digits in cases where they are\nneeded to make the range immediately apparent to the reader (66-98, but 66-103 instead of 66-03).\nQuotations\n\nPlace the citation immediately after the quotation but before any punctuation ending the clause or sentence.\nHowever, if the quotation ends with an exclamation point or a question mark, place that punctuation mark\nbefore the closing quotation mark, and then write the parenthetical citation followed by the punctuation that\nends the clause or sentence.\n\nThe developer of MIT's Media MOO observes \"Virtual communities, social clubs, universities, and\ncorporations are all groups of people brought together for a purpose. Achieving that purpose often requires\nthat there be some way to determine who can join that community\" (Bruckman 51-52).\nBruckman observes, \"Virtual communities, social clubs, universities, and corporations are all groups of\npeople brought together for a purpose. Achieving that purpose often requires that there be some way to\ndetermine who can join that community\" (51-52).\nNoting that gravitational and kinetic energies are no longer equal, Lightman asks, \"Why are [they]\nbecoming unbalanced at this particular moment in cosmic time, just when Homo sapiens happened to\narrive?\" (61).\n\nSet off quotations of more than four lines by starting them on a new line and indenting each line ten spaces\nor one inch. If the quotation is only one paragraph or part of one, do not indent the first line further. If the\nquotation includes the beginning of a second paragraph, indent the first line of each complete paragraph an\nadditional three spaces or one-fourth inch. Place the citation after the final punctuation.\nUse of Endnotes or Footnotes\nMLA style allows two types of endnotes or footnotes.\n1. Content notes providing supplementary information, explanations, and comments that would\ninterrupt the readability of the text. In general, avoid long notes. Use notes only to include material\nthat you cannot fit into the text but that is essential for a clear and complete understanding of what\nyou have written.\n2. Bibliographic notes giving additional references and evaluative comments on sources, contact\ninformation, or both for each of the document's authors.\nNumber your notes consecutively, using superscript arabic numerals both in the text and in your endnotes.\nContent Guidelines [for Works Cited list]\nInclude all sources that have contributed ideas and information to your document. Be sure that the entries\ncorrespond to and match the in-text references. A list of works cited includes only sources mentioned in the\ntext, notes, or appendixes. If you need to mention works that you consulted but that did not directly\ncontribute information or ideas to your document, change the title to Works Consulted. Include references\nto all sources, whether or not they are publicly available.\nPage Format\n-\nTitle: Works Cited (centered)\n-\nOrdering of entries: Arrange in alphabetical order by first author's last name or, for works without\nauthors, the first significant word in the title. List a single-author entry before a multiple-author\nentry beginning with the same author name. Do not number entries.\n\n-\nSpacing: Double-space both within and between entries.\n-\nIndentation: Begin the first line at the left margin, and all subsequent lines five spaces or half an\ninch.\nGeneral Structure of Entry\nAn MLA Works Cited entry has three basic elements: author(s); title; and publication information. Separate\nthe elements with a period and a single space. In some cases, such as online materials and articles in an\nedited book, other elements are included.\n1. Author or authors: List the authors or, in some cases, the editors of the work in the order and form\nin which they are listed on the title page of the document. Include all first names, middle names,\nand initials. List the first author by last name followed by a comma, a space, and the rest of the\nname. For works with two authors, follow the first author's name with a comma and a space, and\nthen list the second author's name in straightforward order followed by a period. For works with\nthree authors, follow the first author's name with a comma and a space, then list the second and\nthird authors' names. For works with more than three authors (or editors), list only the inverted\nname of the first author followed by a comma and \"et al.\" the Latin phrase meaning \"and others.\"\nIf a work produced by an organization lists no individual author, give the full name of the\norganization as author. If no author or organization is listed, move the title of the work into the\nauthor position. If your list of works cited includes two or more works by the same person, list the\nname in full in the first entry. In subsequent entries, type three hyphens and a period in place of\nthe name. The three hyphens indicate exactly the same name or names as the preceding entry and\ncan be used even if the role (author or editor) is different.\n2. Title: Give the full name of work including subtitles, which are separated from the title by a colon\nand a single space. Capitalize the first and last words of a title and subtitle and all other words\nexcept articles, coordinating conjunctions, prepositions and the to in infinitives.\n3. Publication information\nDate format: MLA style includes the year and, in some cases, the month and day as part of the\npublication information. Dates are given in arabic numerals in the the format day, month, and year\nwithout any commas. Abbreviate all months except May, June, and July with the month's first\nthree letters plus a period (for example, 12 Sep. 1991).\nPage numbers: Indicate page numbers without the abbreviation p. or pp. For a range of numbers,\nwrite out the full first number and the final two digits of the last number, with a hyphen in\nbetween. Give more than two digits in cases where they are needed to make the range immediately\napparent to the reader (66-98, but 66-103 instead of 66-03).\nBooks\nTitle: Italicize or underline book titles (including spaces). If the book is an edited work and the author is\nlisted, include the edition number and the editor or editors as a separate element between the title and the\npublication information. Treat a translation the same way. Separate the elements with periods.\nPublication information: List the city (written out in full). If the city is not well known or could be\nconfused with another location, add the state (two-letter postal abbreviation) for U.S. locations or the\ncountry for foreign publishers. End the location information with a colon and a space followed by a short\nversion of the publisher's name (Harcourt for Harcourt Brace & Co., and Beacon for Beacon Press, Inc.).\nUse the abbreviation UP for University Press. After the publisher's name type a comma, and then give the\nyear of publication followed by a period.\nBook by one Author\n\nLightman, Alan. Ancient Light: Our Changing View of the Universe. Cambridge, MA: Harvard UP, 1991.\n\nBook by Two Authors\n\nChomsky, Noam, and Morris Halle. The Sound Patterns of English. New York: Harper, 1968.\n\nEdited Book or Anthology\nPlace the editor or editors (followed by a comma, a space, and ed. or eds.) in the author position.\n\nSpudich, John L., and Bruce H. Satir, eds. Sensory Receptors and Signal Transduction. New York: Wiley-\nLiss, 1991.\n\nSelection in an Edited Book\nThis type of entry has six parts, each ending with a period: (1) the author of the selection; (2) the title of the\nselection; (3) the title of the edited book; (4) the full name of the editor; (5) publication information; and (6)\nthe page numbers of the selection.\n\nLipson, Edward D., and Bruce D. Horwitz. \"Photosensory Reception and Transduction.\" Sensory\nReceptors and Signal Transduction. Ed. John L. Spudich and Bruce H. Satir. New York: Wiley-\nLiss, 1991. 1-64.\n\nTwo or More Works by the Same Author\n\nChomsky, Noam. \"Current Issues in Linguistic Theory.\" The Structure of Language. Ed. Jerry A. Fodor\nand Jerrold J. Katz. Englewood Cliffs, NJ: Prentice, 1967. 50-118.\n---. \"Degrees of Grammaticalness.\" The Structure of Language. Ed. Jerry A. Fodor and Jerrold J. Katz.\nEnglewood Cliffs, NJ: Prentice, 1967. 384-89.\nChomsky, Noam, and Morris Halle. The Sound Patterns of English. New York: Harper, 1968.\n\nBook by an Institutional or Organizational Author\n\nCouncil of Biology Editors. Scientific Style and Format: The CBE Manual for Authors, Editors, and\nPublishers. 6th. ed. Chicago: Cambridge UP, 1994.\n\nGovernment Publications\n\nNational Aeronautics and Space Administration. NASA Pocket Statistics. Washington, DC: Office of\nHeadquarters Operations, 1991.\n\nBook with No Listed Author\n\nWaterstone's Guide to Books. London: Waterstone, 1981.\n\nTranslation\n\nHeisenberg, Werner. The Physical Principles of the Quantum Theory. Trans. Carl Eckart and Frank C.\nHoyt. Chicago: U of Chicago P, 1930.\n\nJournal Articles\nEntries for articles from periodicals, like books, have three main divisions, each ending with a period. The\nfirst part is the name of the author or authors. The second part is the title of the article, enclosed in\nquotation marks. The third part of the entry is the publication information, which begins with the name of\nthe periodical. Underline or italicize the journal title, and capitalize all words except prepositions and\narticles that do not begin the title or follow a colon. Additional publication information , such as the volume\nnumber and the date of publication, follows the title and concludes with a colon, a space, the page numbers\nof the article, and a period. If an article is continued from its first page to a nonconsecutive page, give only\nthe first page and (without a space) a + sign.\nArticle in a Journal Paginated by Annual Volume\nGive the journal title (italicized or underlined) followed by a space, the volume number, another space, the\nyear of publication (in parentheses), a colon, a space, and the page numbers of the article without the\nabbreviation p. or pp.\n\nNelson, Keith A., et al. \"Optical Generation of Tunable Ultrasonic Waves.\" Journal of Applied Physics 53\n(1982): 1144-49.\nPasternack, Robert F., and Peter J. Collins. \"Resonance Light Scattering: A New Technique for Studying\nChromophore Aggregation.\" Science 269 (1995): 935-9.\n\nArticle in a Journal Paginated by Issue\nAdd a period and the issue number (also in arabic numerals) to the volume number.\n\nAllemang, John. \"Social Studies in Gibberish.\" Quarterly Review of Doublespeak 20.1 (1993): 9-10.\n\nArticle in a Monthly or Bimonthly Periodical\nIf the journal is a monthly or bimonthly periodical, list the month and year of publication instead of the\nvolume number.\n\nFallows, James. \"Networking Technology.\" Atlantic Monthly July 1994: 34-36.\n\nArticle in a Daily, Weekly, or Biweekly Magazine or Newspaper\nInclude the year, month, and day.\n\nMetcalfe, Bob. \"The Numbers Show How Slowly the Internet Runs Today.\" Infoworld 30 Sep. 1996: 34.\n\nUnpublished Dissertation\nGive the title of the dissertation in quotation marks. Then add Diss. and the name of the university,\nfollowed by the year.\n\nGlazer, Frederick G. \"Hierarchical Motion Detection.\" Diss. Univ. of Massachusetts, 1987.\n\nOnline Sources [corrected by WK]\nOne proposed, but not yet accepted, MLA style guideline (Harnack and Kleppinger, 1996) suggests the\nfollowing format: the author's name; the full title of the document in quotation marks, if appropriate; the\ntitle of the journal or larger work if available underlined or in italics; the date of publication or last revision;\n[ . . . ] the date accessed in parentheses [followed by a period and the concluding word \"Web.\" MLA no\nlonger encourages use of URLs.]\nJournal Published Only Online\n\nHarnack, Andrew, and Gene Kleppinger. \"Beyond the MLA Handbook: Documenting Electronic Sources\non the Internet.\" Kairos 1.2 (1996): 12-22. (21 Sep. 1996). Web.\n\nDocument Available through the World Wide Web\n\nWalker, Janice R. \"MLA-Style Citations of Electronic Sources.\" Ver. 1.0, Rev. Apr. 1995.\n(21 Sep. 1996). Web.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.315 Prizewinners: Nobelistas\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Writing FAQs",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-315-prizewinners-nobelistas-spring-2014/1108694ef15331160402247f8667ce0f_MIT21L_315S14_Writing_FAQ.pdf",
      "content": "Writing FAQs\n\n1. TITLES\na. Give your paper a title that conveys its content (\"Morrison's Use of\nBiblical Allusions in Song of Solomon\"), rather than the assignment\n(\"Song of Solomon Close Reading\").\nb. Italicize or underline titles of books, novels, plays, or other complete\nworks. Place the titles of shorter pieces like poems, articles, stories or\nessays in quotation marks.\n2. VERBS\na. Use present-tense verbs in literary analysis. Reserve past-tense verbs for\nevents that took place in the past; and also recognize that when you do,\nyou run the risk of narrating what has happened (re-telling the plot or\nparaphrasing the language) rather then analyzing the text (showing how\nthe language produces a certain effect or outcome).\nb. Avoid passive verbs, which can lend themselves to wordy or vague\nlanguage. Avoid over-use of the verb \"to be,\" which can produce static\nsentences. Look for active, vigorous verbs.\n3. Check DANGLING MODIFIERS AND PHRASES:\na. \" . . . simply by examining his choice of words, it is quite clear that the\nfeeling remains.\"\nb. CORRECT SO THAT THE PHRASE MODIFIES THE APPROPRIATE\nNOUN: \"simply by examining [who's examining?] WE SEE that the\nfeeling remains.\"\n4. PRONOUN AGREEMENT: Make sure pronouns agree in number and gender\nwith the nouns they refer to. \"The diction is very lofty throughout this passage--\nalmost as if each speaker is flaunting their knowledge.\" \"Each speaker\" is\nsingular. Hence: \"each speaker is flaunting HIS knowledge.\" If the gender is\nunknown use HIS OR HER or change the number of the noun: \"the SPEAKERS\nare flaunting THEIR knowledge.\"\n5. FAULTY PRONOUN REFERENCE: Make sure that pronouns like \"which,\"\n\"this,\" or \"that\" have nouns to refer to. See OWL (Online Writing Lab at Purdue).\n6. PUNCTUATION IN A COMPOUND SENTENCE. A compound sentence\nlinks two or more main clauses with a comma and coordinating conjunction (and,\nbut, or), or a semicolon.\na. Conjunction and no comma makes a run-on (error). \"I collected bananas,\nyoghurt, and frozen berries and I made a smoothie.\"\nb. Comma and no conjunction makes a comma splice (error). \"I collected\nbananas, yoghurt, and frozen berries, I made a smoothie.\"\nc. Comma and conjunction makes it just right. \"I collected bananas, yoghurt,\nand frozen berries, and I made a smoothie.\" OR \"I collected bananas,\nyoghurt, and frozen berries; I made a smoothie.\"\n7. SENTENCE STRUCTURE\na. A simple sentence has one main clause (a subject-verb unit that can stand\nalone): \"My dog eats bats.\" It can have a compound subject--\"My dog\nand my cat eat bats\"--or a compound verb--\"My dog eviscerates and\nthen eats bats\"--or both. But it cannot have more than one clause. It can\nhave multiple phrases (groups of words missing a subject or verb or both):\n\nWriting FAQs\n\n\"My dog, spotted all over, eats bats.\" \"Running after bats, my dog trips\nover rats.\" \"My dog eats bats, not rats.\" It can be a long sentence (lots of\nphrases). It is still a simple sentence.\nb. A compound sentence has more than one main clause linked by\nsemicolon(s) or coordinating conjunctions and correct punctuation (see\nabove). \"My dog eats bats, and my cat eats rats.\"\nc. A complex sentence has one or more main clauses and one or more\ndependent clauses (subject-verb units that cannot stand alone). \"Although\nmy cat prefers rats, my dog eats bats.\" \"My dog eats bats, which are found\nunder mats.\" \"When my dog learns to eat cats, I will lose my favorite pet.\"\nd. You can probably guess what a compound-complex sentence looks like:\n\"I am finding out a great deal about the dietary habits of cats; and as I\nprogress in my studies, I have also learned that dogs eat bats, a discovery\nthat fills me with delight and awe.\" How many clauses and what kind do\nyou find here?\ne. A group of words missing a subject and/or verb is a phrase. When it stands\nalone with an opening capital letter and a closing period, it is a sentence\nfragment (generally an error, though writers sometimes use it for effect).\n8. CITATIONS AND QUOTATIONS\na. Supply a \"Works Cited\" list at the end of your paper. Cite the text you are\nquoting from, as well as the Oxford English Dictionary or anything other\nwork you cite. If a text appears in \"Works Cited,\" you should cite it in the\nessay, that is, refer to or quote from it, supplying a page number within\nparentheses after the reference or quotation (21). You do not need to use\nthe author's last name in the parentheses unless there's any doubt about\nwhich source you're referring to. Use MLA format for the \"Works Cited\"\nlist. If you used a source that you do not refer to or quote in your essay,\nyou can supply a list of \"Works Consulted\" and add it to that.\nb. When quoting material from a text, set off longer passages with indented\nmargins. You do not need to use a different size font or italics, nor do you\nneed to use quotation marks unless they appear in the quoted material.\nPlace the page number in parentheses after the quotation and final\npunctuation.\n9. GENERALIZATIONS Try to avoid basing your argument on what a \"reader\"\nmust do to understand the text. This approach leads to generalizations you cannot\nsupport (do you really know how all readers see the book?). Focus rather on what\nyou can substantiate with concrete evidence, that is, what the text reveals, what\nyou can see and demonstrate on the page.\n10. PROCESS LANGUAGE Get right to your ideas. Avoid language that announces\nyour methods (\"This essay will examine certain images,\" \"In order to understand\nthis idea, we need to look at this passage\") and set up your argument directly\ninstead (\"As the author's use of imagery suggests, this passage is significant\nbecause . . . \").\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.315 Prizewinners: Nobelistas\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}