{
  "course_name": "Problems of Philosophy",
  "course_description": "This course is an introduction to the problems of philosophy—in particular, to problems in ethics, metaphysics, theory of knowledge, and philosophy of logic, language, and science. It takes a systematic rather than historical approach. Readings come from classical and contemporary sources, but emphasis is on examination and evaluation of proposed solutions to the problems.",
  "topics": [
    "Humanities",
    "Philosophy",
    "Epistemology",
    "Ethics",
    "Logic",
    "Metaphysics",
    "Religion",
    "Humanities",
    "Philosophy",
    "Epistemology",
    "Ethics",
    "Logic",
    "Metaphysics",
    "Religion"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1 hour / session\n\nRecitations: 1 session / week, 1 hour / session\n\nPrerequisites\n\nThere are no prerequisites for this course.\n\nCourse Description\n\nThis course has two goals. The first is to introduce you to the things that philosophers think about. We will look at some perennial philosophical problems: Can we prove the existence or nonexistence of a God? What is the place of our consciousness in the physical world? Do we have free will? How do we persist over time, as our bodily and psychological traits change? Are there objective facts about what's good and bad? What do race and gender consist of? What is the meaning of life? The second goal is to get you thinking philosophically yourself. This will help you develop your critical and argumentative skills more generally.\n\nRequirements\n\nReadings\n\nCarefully read the assigned texts in advance of each class. Some of the texts are dense and difficult. If you do not understand a text first time around, then read it again.\n\nAll readings can be found in the table of the\nReadings\nsection.\n\nAttendance: Lectures\n\nThere will be two one-hour lectures each week. You must attend all the lectures. We have a laptops-closed, phones-in-pockets policy in lecture. Many lectures will include a brief quiz to help us assess whether you are absorbing essential material.\n\nAttendance and Participation: Recitation Sections\n\nCommunication Intensive (\nCI-H\n) subjects offer students substantial opportunity for oral expression. Each of you will be assigned to a weekly one hour discussion session, where you will be expected to participate actively.\n\nPresentations\n\nEach of you will give a formal presentation on a subject determined in discussion with the instructor leading your recitation section.\n\nPapers\n\nCI-H subjects require at least 5,000 words of writing divided among a number of assignments, at least one of which will be revised and resubmitted. In this class you will write three 1,000-to-1,200 word papers, and one 2,000-to-2,400 word final paper, for a minimum of 5,000 words. You will revise and resubmit your first paper after meeting with your recitation instructor.\n\nFor more detail, see the\nAssignments\nsection.\n\nPlagiarism\n\nAs you surely know, all your writing must be your own. This means that anything quoted verbatim must appear within quotation marks and be accompanied by a footnote that identifies its source. And it means that you may not paraphrase a person's writing without making it explicit that you are doing so--changing the words does not make it your writing. And it means that whenever the insights or ideas of another person (including friends of yours, including anonymous authors of material on the internet) appear in your paper you must credit that person in a footnote. If you are in any doubt about whether something you are writing amounts to plagiarism, talk about it with your TA before you hand in your paper. You should also review\n\"Academic Integrity at the Massachusetts Institute of Technology: A Handbook for Students.\" (PDF - 1.4MB)\n\nGrading Policy\n\nACTIVITIES\n\nPERCENTAGES\n\nParticipation and oral presentation\n\n10%\n\nQuizzes\n\n10%\n\nPaper 1\n\n10%\n\nPaper 1 rewrite\n\n10%\n\nPaper 2\n\n15%\n\nPaper 3\n\n15%\n\nFinal paper\n\n30%",
  "files": [
    {
      "category": "Lecture Notes",
      "title": "24.00F19 Lecture Handout 1: Basics of Analytic Philosophy",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-00-problems-of-philosophy-fall-2019/fe6a7d62e3df817bd9c38340be9cb9b9_MIT24_00F19_lecturehandout1.pdf",
      "content": "Handout 1\nBasics of Analytic Philosophy\n1. What Do We Do?\nPhilosophy addresses questions which are usually big, important, and are the intellectual leftovers\n- questions that we don't yet have complete methods for answering in any other academic\ndiscipline. Examples:\n1. Does God exist? (A specific version: does an all-powerful, all-knowing, perfectly-\nbenevolent agent who created the universe exist?)\n2. Is it rational to have faith?\n3. Are there objective facts about what's right and wrong?\n4. Is the mind a physical entity?\n5. Is there free will?\n6. Is gender socially constructed?\n2. How Do We Do It?\nThrough argument. Here's what the process looks like for an individual philosopher, which\nduring Fall 2019, will be you!\nDiscover - Discover an intellectual reaction (for example, by contemplating a question or reading a\nphilosophy paper)\nExplore - Explore the reaction (for example, by free-writing)\nFormalize - Turn the reaction into an argument. (This is the part that requires skills you'll be\nlearning in this class). See if you still endorse the reaction upon seeing it in argument form. If\nnot, modify the argument, or explore your reaction further. Play around until you're happy.\nConvey - Convey the argument to others\nReceive Feedback - If you're lucky enough to get feedback from another human, listen extremely\ncarefully to their intellectual reaction. Take it in. Ask questions about it until you fully\nunderstand it. (Note - the aim is not to refute it, it's to understand it!)\nStart over: Discover - Observe a reaction to their reaction in yourself...\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n24.00 Problems of Philosophy\nFall 2019\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "24.00F19 Lecture Handout 10: Panpsychism and Dual Aspect Monism",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-00-problems-of-philosophy-fall-2019/322912795aeec97d628e58f6845e2d8d_MIT24_00F19_lecturehandout10.pdf",
      "content": "Handout 10\nPanpsychism/Dual Aspect Monism\n1. Two Hard Problems\nThe Hard Problem of Consciousness - The hard problem of consciousness is another way of bringing\nout the challenge consciousness poses to physicalism. It's not unrelated to the knowledge\nargument, but it focuses on explanation. The thought is, no amount of science will be able to\nexplain why particles moving around in such and such way will give rise, to say, red experience.\nThe Hard Problem of Matter - What is physical matter in and of itself, beyond the structure\ndescribed by physics?\nLike the hard problem of consciousness, the hard problem of matter seems like a problem science\ncan't solve.\n2. The Hard Problem of Matter\nTraditional scientific methods tell us what matter does, not what matter is. It describes the\nsoftware, rather than the hardware of the universe.\nExamples:\n- What is charge? A matter of repelling other matter with the same charge and\nattracting other matter with different charge.\n- What is mass? A matter of responding to applied forces, gravitationally attracting\nother particles with mass, curving spacetime, interacting with the Higgs field...\nBut we might want to know what is it that's doing the attracting, curving the spacetime, interacting with the\nHiggs field?\nOne proposal: structuralism - all there is is structure and relations. There's no thing which is the\nthing that realizes it. But, the argument goes, there are lots of abstract mathematical structures.\nPresumably the particular structure describing our universe differs from the other abstract\nstructures because it's realized by some stuff.\n3. Can we Solve Both Problems at Once?\nThe hard problem of matter calls for non-structural (qualitative) properties and consciousness is\nthe one phenomenon we know that might provide us with some.\nWe know what conscious properties - qualia - are like in and of themselves, not just how they relate\nto other stuff: when Mary sees red for the first time she isn't learning anything about how the\nproperty of looking red relates to other things - she's learning what it's like.\n\nSo here's the proposed solution: perhaps consciousness of some primitive or rudimentary form is\nthe hardware that the software physics describes runs on. Maybe fundamental particles are\nmental beings - streams of experience in physical relation to other streams of experience.\nThis is a proposed answer to the hard problem of matter. How does it purport to solve the hard\nproblem of consciousness? If matter just is consciousness there is no question about how\nconsciousness arises from matter.\n4. Dual aspect monism\nMonism - all of reality is made of the same kind of stuff.\nDualism - reality is made of two types of stuff\nDual aspect monism accepts that the brain is a purely material system, but says that it has an\nintrinsic nature which we can detect from the inside that can't be captured by any physical\ntheory. It then proposes that we think of everything like this. All matter has an intrinsic mental\nnature.\n5. Objections\nPanpsychism - implausible that fundamental particles are conscious.\nResponse - look at the alternatives!\nCombination problem - how does more complex consciousness arise out of simpler forms of\nconsciousness? Looks similar to the original hard problem.\nResponse - they're working on it.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n24.00 Problems of Philosophy\nFall 2019\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "24.00F19 Lecture Handout 11: Incompatibilism",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-00-problems-of-philosophy-fall-2019/7dd9f1bfe1d6dc00706b638e46114178_MIT24_00F19_lecturehandout11.pdf",
      "content": "Handout 11\nIncompatibilism\n1. Van Inwagen's Argument\nDeterminism (v.I, p.186): (a) For every instant of time there is a proposition that expresses the state\nof the world at that instant. (b) If A and B are any propositions that express the state of the world\nat some instants, then the conjunction of A with the laws of physics entails B.\nLaw of physics - a law of nature that is not about the voluntary behavior of rational agents\nFree will - the power or ability of agents to act otherwise than they in fact do.\nCase: A judge J had the opportunity to raise his hand at time T to pardon somebody but he did\nnot.\nL = the laws of physics\nP = a proposition that expresses the state of the world at T\nP0 = a proposition that expresses the state of the world at a time before the judges birth, T0\nFrom p.191:\n1. If determinism is true, then the conjunction of P0 and L entails P.\n2. If J had raised his hand at T, then P would be false.\n3. If (2) is true then if J could have raised his hand at T, J could have rendered P false.\n4. If J could have rendered P false, and if the conjunction of P0 and L entails P, then J could\nhave rendered the conjunction of P0 and L is false.\n5. If J could have rendered the conjunction of P0 and L false, then J could have rendered L\nfalse.\n6. J could not have rendered L false.\n7. If determinism is true, J could not have raised his hand at T.\n2. Defending the Premises\n2.1. Defense of (4)\nLet \"-\" represent logical entailment.\nSuppose\n(P0 and L) - P\nIt follows (by logic) that:\n(~P) - ~(P0 and L)\nSo if you can make it the case that (~P) - that is, you can render P false - then arguably you can\nalso make it the case that conjunction of P0 and L false.\nVan Inwagen, Peter. \"The Incompatibility of Free Will and Determinism.\" Philosophical Studies: An International Journal for Philosophy in the Analytic Tradition 27, no. 3\n(1975):185-99. (c) Springer. All rights reserved. This content is excluded from our Creative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/.\n\n2.2 Defense of (5)\nIf J could have rendered the conjunction of P0 and L false, then J could have rendered L false.\nWhy? Because P0 expresses some state of the world before J's birth, and so, van Inwagen thinks,\nJ can't render P0 false. This means that if he can render the conjunction false, that must be\nbecause he can render L false.\n2.3. Defense of (6)\nVan Inwagen argues that if somebody could render a proposition false, then that proposition is\nnot a law of physics. Which means that if J could have rendered L false, then L is not a law of\nphysics. But by stipulation L is a law of physics.\nWhy think that if somebody could render a proposition false then that proposition is not a law of\nphysics?\nSuppose the following are both true:\n(A) Nothing ever travels faster than light\n(B) Jones a physicist can construct a particle accelerator that would cause protons to travel at\ntwice the speed of light.\n(It follows from (A) that Jones will never exercise such a power).\nvan Inwagen's two claims: (A) and (B) are consistent, but (B) entails that (A) is not a law of physics.\n\"surely it is a feature of any proposition that is a physical law that no one can conduct an\nexperiment that would show it to be false.\" (193)\n*Humeanism vs non-Humeanism about laws\n3. Objections\nObjection 1: In day to day life we have criteria for determining whether an agent could have acted\notherwise. These criteria determine what it means to say that an agent could have acted\notherwise. These criteria make no mention of determinism so if you think free will and\ndeterminism are incompatible you're confused.\nResponse: Predestinarianism says (1) if an act is foreseen it's not free (ii) all acts are foreseen by\nGod. Clearly this view is incompatible with free will, but are ordinary criteria make no appeal to\nit. So the inference from \"ordinary criteria for free will make no appeal to X\" to \"X is\ncompatible with free will\" is false.\nObjection 2: Quite the contrary - free will entails determinism! To say that someone acted freely\nrequires that he acted. But to say that someone acted requires that the person caused the relevant\nphenomenon (e.g. hand rising to occur). If determinism is false then the hand-raising would be\nuncaused, in which case it's not even an act to begin with.\nVan Inwagen, Peter. \"The Incompatibility of Free Will and Determinism.\" Philosophical Studies: An International Journal for Philosophy in the Analytic Tradition 27, no. 3 (1975):\n185-99. (c) Springer. All rights reserved. This content is excluded from our Creative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/.\n\nResponse: Causation is consistent with determinism.\nObjection 3: \"Conditionalists\" say that\n\"S could have done X\"\nmeans\n\"If S had chosen to do X, S would have done X.\"\nResponse: What premise of the argument is the conditionalist going to deny? The crucial premise\nis premise (6). Suppose we substituted\n(6) J could not have rendered L false.\nwith\n(6a) It is not the case that if J had chosen to render L false, J would have rendered L false.\nVan Inwagen says - (6a) still seems true, but let's suppose for the sake of the argument that (6a) is\nfalse: that if J had chosen to render L false, J would have rendered L false.\nThis would show that (6) does not mean the same thing as (6a) since (6), van Inwagen argued, is\ntrue.\nSo either the conditionalist's analysis is true, but so is (6a) (since (6) is) and the argument goes\nthrough, or the conditionalist's analysis is false.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n24.00 Problems of Philosophy\nFall 2019\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "24.00F19 Lecture Handout 12: Compatibilism",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-00-problems-of-philosophy-fall-2019/159a35816659132375ddbe46aa73d098_MIT24_00F19_lecturehandout12.pdf",
      "content": "Handout 12\nCompatibilism\n1. First and Second Order Desires and the Will\n\"A wants to X\" doesn't have much content apart from context because it is consistent with (p.7):\n(a) The prospect of doing X elicits no sensation or emotional response in A\n(b) A believes he does not want to do X\n(c) A believes that he does not want to X\n(d) A wants to refrain from X-ing\n(e) A wants to do Y and believes it is impossible to do both X and Y\n(f) A does not \"really\" want to do X\n(g) A would rather die than X\nSo you can't predict much about what a person will do just from knowing they want X.\nFrankfurt thinks we should distinguish between:\nFirst order desire to X - X refers to an action\nSecond order desire to X - X refers to a first order desire\nThe will - the desire or desires which motivate the agent in some action, or those by which the\nagent will or would be motivated\n(The will is identical with one or more first order desires - it is an effective desire).\n2. Second Order Desires\nTwo kinds of situation in which A has a second order desire:\n(1) A has the desire to desire to X, but also the desire to refrain from X-ing - the desire they\nwant to have is a desire they want to be unsatisfied. Example: a doctor wants to\nunderstand what it's like to strongly desire an addictive substance. He forms the desire to\nhave that desire (perhaps temporarily) but he doesn't want such a desire to be satisfied.\nHe doesn't want the desire to take the drug to be his will\n(2) A has the desire to desire to X, and he wants the desire to X to be effective. This entails\nthat A already has the desire to X. Example: I want to want to concentrate on my work.\nThis kind of 2nd order desire is called a second order volition\nFrankfurt thinks that 2nd order volitions are essential to personhood. Wantons have 2nd order\ndesires but no 2nd order volitions. Wantons do not care about their will. Their desires move\nthem to do things but they neither want to be moved by those desires nor prefer to be moved by\nothers. A wanton is not concerned with the desirability of his desires.\nExample: unwilling addict - has 2 conflicting first order desires - the desire to take the drug and\nthe desire not to take it, but it is the desire not to take the drug that she desires to be her will.\nWanton addict - also has conflicting first order desires, but no preference between them.\nFrankfurt, Harry G. \"Freedom of the Will and the Concept of a Person.\" Journal of Philosophy 68, no. 1 (1971): 5-20. (c) The Journal of Philosophy, Inc. All rights\nreserved. This content is excluded from our Creative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/.\n\n3. Free Will\nFrankfurt thinks that 2nd order volitions are the key to free will.\nOn one view: an agent acts freely if she does what she wants to do. But Frankfurt thinks, even if\nthere's something right about this as an account of what it is to act freely, it doesn't capture the\nidea that the will is free. The freedom to act as one wants to act isn't sufficient for free will.\nIf freedom of action is roughly the freedom to do what one wants, then freedom of will is roughly the\nfreedom to will what one wants. This means that with respect to any first order desires, the person is\nfree to make that desire her will, or to make some other desire her will instead.\nFree will is exercised when an agent brings her will into conformity with her second order\nvolitions.\nConsequence: The unwilling addict's will is not free. Whichever way the unwilling addict\nacts, she acts according to her desires. But her will is not what she wants it to be.\n- There can be conflicts among 2nd order desires. If the someone fails to identify himself\nwith any of his conflicting first order desires then he is not a person.\n- There can be 3rd order desires, etc. Still, when a person identifies herself decisively with\none of the first order desires that identification \"resounds\" through all the levels that there\nare.\n- Someone who is free to do what he wants to do and to will what he wants to will has all\nthe freedom it is possible to desire or conceive. All the freedom we could want is\ncompatible with determinism.\n4. Frankfurt on Moral Responsibility\nFrankfurt denies any straightforward connection between free will and moral responsibility.\nBeing morally responsible, Frankfurt thinks, doesn't entail that you could have had whatever will\nyou wanted to have.\no Example: the willing addict - the willing addict wants to be an addict. In this\ncase, we can imagine, his will is not free because the desire for the drug would be\neffective even if he didn't want that desire to constitute his will. But when he takes\nthe drug, he takes it freely. Furthermore, even though his will is outside of his\ncontrol \"by his second order desire that his desire for the drug should be effective\nhe has made his will his own.\" (20).\n-\nQuestion: what about the unwilling addict? Frankfurt's view opens the\npossibility for an account of moral responsibility according to which an\nagent is morally responsible when she acts freely and her first order desires\nconforms to her higher order desires - in other words she has \"made her\nwill her own.\"\nFrankfurt (in other work) also denies the claim that a person is morally responsible for what she\ndoes do only if she can do otherwise.\nFrankfurt, Harry G. \"Freedom of the Will and the Concept of a Person.\" Journal of Philosophy 68, no. 1 (1971): 5-20. (c) The Journal of Philosophy, Inc. All\nrights reserved. This content is excluded from our Creative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/.\n\nFrom the Stanford Encylopedia of Philosophy:\n\"Here is a close approximation to the example Frankfurt presented in his original paper:\nJones has resolved to shoot Smith. Black has learned of Jones's plan and wants Jones to shoot\nSmith. But Black would prefer that Jones shoot Smith on his own. However, concerned that\nJones might waver in his resolve to shoot Smith, Black secretly arranges things so that, if\nJones should show any sign at all that he will not shoot Smith (something Black has the\nresources to detect), Black will be able to manipulate Jones in such a way that Jones will shoot\nSmith. As things transpire, Jones follows through with his plans and shoots Smith for his own\nreasons. No one else in any way threatened or coerced Jones, offered Jones a bribe, or even\nsuggested that he shoot Smith. Jones shot Smith under his own steam. Black never\nintervened.\nIn this example, Jones shot Smith on his own, and did so unencumbered -- did so freely.\nBut, given Black's presence in the scenario, Jones could not have done otherwise than shoot\nSmith.\"\nSo in response to van Inwagen, it's possible to agree that: \"If determinism is true, the agent could\nnot have acted otherwise\" while still claiming that:\n(a) The agent acted freely (in the sense that she did what she wanted to do)\n(b) The agent acted of her own will (in the sense that the will by which the agent was moved\nwas the will she wanted to have, first and second order desires coincide).\n(c) The agent is morally responsible (perhaps because of (a) and (b)).\nMcKenna, Michael, and D. Justin Coates. \"Compatibilism.\" In Stanford Encyclopedia of Philosophy. 2019. (c) Michael McKenna and D. Justin Coates. All rights\nreserved. This content is excluded from our Creative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n24.00 Problems of Philosophy\nFall 2019\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "24.00F19 Lecture Handout 13:  Moral Responsibility",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-00-problems-of-philosophy-fall-2019/96ce4833b2255e7c9fdb44d78f015f11_MIT24_00F19_lecturehandout13.pdf",
      "content": "Handout 13\nMoral Responsibility\n1. Versions of the Argument\n(a) The Basic Argument (Strawson, p.5)\n1. Nothing can be the cause of itself (causa sui)\n2. In order to be truly morally responsible for one's actions one would have to be the cause\nof oneself - at least in certain crucial mental respects\n3. Nothing can be truly morally responsible\n(b) Elaborated (adapted a bit, from p.6):\n1. When one acts for a reason what does is a function of how one is, mentally speaking.\n2. So if one is to be truly responsible for how one acts, one must be truly responsible for how\none is, mentally speaking - at least in certain respects.\n3. To be truly responsible for how one is, mentally speaking, in certain respects, one must\nhave brought it about that one is the way one is, mentally speaking, in certain respects.\n4. But one cannot really be said to choose the way one is mentally speaking, in any respect\nat all, unless one is already equipped with some principles of choice, P1 - preferences,\nvalues, pro-attitudes, ideals - in the light of which one chooses how to be.\n5. But then to be truly responsible on account of having chosen to be the way one is, one\nmust be truly responsible for having P1 in the light of which one chose how to be.\n6. But for this to be so one must have chosen P1.\n7. But for this to be so one must have had some principles of choice P2 in the light of which\none chose P1.\n8. True self-determination is impossible because it requires the actual completion of an\ninfinite series of choices of principles of choice.\n9. True moral responsibility requires true self-determination.\n(c) A More Natural Version (adapted a bit from p.7)\n1. One is the way one is, initially, as a result of heredity and early experience, and these are\nthings for which one cannot be held to be responsible.\n2. One cannot at any later stage of life hope accede to true moral responsibility for the way\none is by trying to change the way one already is as a result of heredity and previous\nexperience.\nWhy? Because the particular way in which one is moved to try to change oneself\nand the degree of one's success in one's attempt at change will be determined by\nhow one already is as a result of heredity and previous experience, and any further\nchanges that one can bring about only after one has brought about certain initial\nchanges will be determined, via the initial changes, by heredity and previous\nexperience. Maybe some changes are traceable to indeterministic or random\nfactors, but one definitely is not responsible for this!\n3. At no stage can there be true moral responsibility for the way one is.\nStrawson, Galen. \"The Impossibility of Moral Responsibility.\" Philosophical Studies: An International Journal for Philosophy in the Analytic Tradition 75, no. 1/2 (1994):\n5-24. (c) Springer. All rights reserved. This content is excluded from our Creative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/.\n\n4. At no stage can one be truly morally responsible for their actions.\n(d) Yet another version! (adapted a bit from p.13)\n1. You do what you do because of the way you are.\n2. To be truly morally responsible for what you do you must be truly responsible for the way\nyou are - at least in certain crucial mental respects.\n3. You cannot be truly responsible for the way you are.\n4. You cannot be truly responsible for what you do.\nDefense of (3):\nTo be truly responsible for the way you are, you must have intentionally brought it about that\nyou are the way you are in a way that makes you responsible for how you are. But this is\nimpossible.\nWhy?\n(a) For you to have intentionally brought about the way you are, you must already have had\na certain nature N in the light of which you intentionally brought it about that you are as\nyou are now.\n(b) For it to be true that you are truly responsible for how you are, you must be truly\nresponsible having had the nature N in the light of which you intentionally brought it\nabout that you are the way you.\n(c) To have intentionally brought it about that you had that nature N in a way which makes\nyou responsible for it, you must have existed already with a prior nature N', in the light of\nwhich you intentionally brought it about that you had the Nature N in the light of you\nintentionally brought it about that you are the way you now are...\nRegress!\n2. Why Does It Matter?\nBelief in absolute moral responsibility has been central to Western religious moral and cultural\ntradition.\nIt implies that there is a fundamental sense in which no punishment or reward is ever ultimately\njust. It's no more just to punish somebody for their actions than for their hair color.\nIt's relevant to our self-understanding - we have a feeling we have that we are fully morally\nresponsible for what we do (cake versus Oxfam tin) and how we are that Strawson thinks come\nabout just because we have self-conscious awareness of ourselves as agents who deliberate about\nwhat to do.\nStrawson, Galen. \"The Impossibility of Moral Responsibility.\" Philosophical Studies: An International Journal for Philosophy in the Analytic Tradition 75, no. 1/2 (1994): 5-\n24. (c) Springer. All rights reserved. This content is excluded from our Creative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/.\n\n3. Objections and Responses\nObjection 1 - Compatibilism\nCompatibilists think you can be a morally responsible agent just in virtue of your actions being\ncaused in a certain way - for example by your desires, when they coincide with your higher order\ndesires. They reject (2) in the last argument.\nResponse: The kind of responsibility compatibilists give us is not true moral responsibility.\nCompatibilists have given various accounts of when punishment is \"fitting\" but they can't, says\nStrawson, reasonably think it's truly and ultimately just to punish, if the causes of action are not\nthings we are responsible for.\nObjection 2 - Libertarianism\nLibertarians are incompatibilists who believe determinism is false, and so we do have free will\nand are morally responsible.\nResponse: Denying determinism doesn't help. You're no more responsible for truly random\nevents going on in your brain than for determined events going on in your brain.\np.19: \"In the end, whatever we do, we do it either as a result of random influences for which we\nare not responsible, or as a result of non-random influences for which we are not responsible, or\nas a result of influences for which we are proximally responsible, but not ultimately responsible.\"\nObjection 3 - There is a \"self\" beyond the motivation system\nThe idea is that you \"self\" is independent of your personality or motivational structure - your\n\"CPM\". Your self, S, considers the deliverances of CPM and makes a decision in light of them,\nbut independent of them.\nResponse: S decides on the basis of the CPM, but whatever S decides it decides because of the\nway S is.\nStrawson, Galen. \"The Impossibility of Moral Responsibility.\" Philosophical Studies: An International Journal for Philosophy in the Analytic Tradition 75, no. 1/2 (1994): 5-24. (c) Springer.\nAll rights reserved. This content is excluded from our Creative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n24.00 Problems of Philosophy\nFall 2019\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "24.00F19 Lecture Handout 14: Locke on Personal Identity",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-00-problems-of-philosophy-fall-2019/b1b69ed912fd0510b0b03662b8258369_MIT24_00F19_lecturehandout14.pdf",
      "content": "Handout 14\nLocke on Personal Identity1\n1. Three Uses of Terms Like 'Identity'\n1. To refer to a self-conception. E.g: 'My fascination with philosophy threatens my identity as an\nexperimental scientist'.\n2. To refer to the relation that holds between things that share many intrinsic properties. E.g:\n\"These two paper clips are identical.\" We may call this qualitative identity.\n3. To refer to the relation that holds between each thing and itself, and nothing else. We may call\nthis strict identity.\nQuestions about strict identity typically come up when you know that there is one thing with\nfeatures F, and that there is one thing with features F*, and you ask: \"Is the thing with features F\nthe thing with features F*?\"\nExamples: Is the youngest person in this room the tallest person in this room?\nIs the third perfect number the 28?\n2. Strict Identity Over Time\nWe're going to be interested in strict identity but across time.\nQuestions about strict identity across time come up when you know that there is one thing with\nfeatures F at time t1, and that there is one thing with features F* at a later time t2, and you ask:\n\"Is the thing with features F at t1 the thing with features F* at t2?\"\nExamples: Is the shirt you're wearing the one I gave you for your birthday?\nIs the person I saw at the coffee shop this morning the same as the person I sat next to on\nthe airplane yesterday?\nWe care a great deal about questions of the identity of persons over time:\nIs the person I am pointing at now a person who will be given a million dollars tomorrow?\nIs the person I am pointing at now going to be suffering from a horrible illness next year?\nIs the person I am pointing at now one of the people who will be alive tomorrow?\nIs the person on trial today the person who committed the murder three months ago?\n3. Locke's Criterion of Persistence Over Time\nFor Masses\nWhenever A is mass that exists at one time, t1, and B is a mass that exists at a later time, t2\nA is B iff\nevery part of A at t1 is a part of B at t2, and vice-versa\n1 Parts of this handout are taken from a handout made by Professor Caspar Hare.\n\nLocke's Criterion of Persistence Over Time for Organisms ('Vegetables', 'Animals', 'Man')\nWhenever A is an organism that exists at one time, t1, and B is an organism that exists at a later\ntime, t2\nA is B iff\nA and B 'partake in the same life, though that life be communicated to new\nparticles of matter vitally united to the living [organism]'\nIn other words: there is a kind of organizational continuity that exists between an organism at\ndifferent times which is what makes it a single organism.\n(Compare: a club, 24.00)\nLocke's Criterion of Persistence Over Time for People\nWhenever A is person who exists at one time, t1, and B is a person who exists at a later time, t2\nA is B iff\nat t2, B remembers A's actions and experiences at t1.\n(Note: in what follows theories of personal identity over time will assume that A is a person who\nexists at t1 and B is a thing that exists at a later time, t2).\n4. Objections to Locke from Reid and some Modifications\nObjection 1: He 'Mistakes Testimony for the thing Testified'\nAccording to Locke, my remembering doing something makes it the case that I did it. But isn't\nthat objectionably circular? Isn't it part of the concept of remembering that I only remember the\nthings I did?\nModification to Avoid Reid's First Objection\nSay that I quasi-remember doing something when I am in a mental state that is intrinsically just like\nthe one I would be in if I remembered doing it.\nA is B iff\nat t2, B quasi-remembers A's actions and experiences at t1.\nObjection 2: Locke is Saying that Strict Identity is Intransitive\nSay that a relation is transitive when, for all things x,y,z, if x bears the relation to y, and y bears the\nrelation to z, then x bears the relation to z.\nStrict identity is a transitive relation. But, when lives are long and memory is short (e.g. the boy,\nyoung officer, general), remembering is intransitive. The general remembers being the young\nofficer, the young officer remembers being the boy, but the general does not remember being the\nboy. So Locke cannot be giving a criterion of strict identity.\nModification to Avoid Reid's Second Objection\nSay that A's mental state at t1 is memory connected to B's mental state at t2 iff at t2, B quasi-\nremembers being A at t1\nSay that A at t is memory continuous with B at t' (the ancestral of the forward memory connected\nrelation) iff either\nA at t is memory connected to B at t',\n\nor\nthere is a chain of persons C1, C2, C3...Cn that exist at times t< t1...tn-1<tn<t',\nsuch that\n- A is memory connected to C1, and\n- For all i, Ci is memory connected to Ci+1, and\n- Cn is memory connected to B.\nA is B iff\nat t1 A is memory continuous with B at t2.\n5. Should The Criterion Only Focus on Memory?\nLocke argued that personal identity is a concept we use it to guide our practice of blaming and\npunishing: only blame and punish a person for crimes he/she committed.\nAnd, says Locke, we should only blame and punish people for crimes they remember\nperpetrating.\nBut is Locke right about this?\nAnd isn't Locke is overlooking other important maxims?\nAbsent some exchange, attribute property to a person only if he/she is the previous\nowner.\nAnticipate pleasure and suffering only if it will be yours.\nFear death only if you will not be around in the future.\nThe Amended Broader Version of the Psychological Criterion of Persistence for People\nSay that A's mental state at t1 is psychologically connected to B's mental state at t2 iff B's mental state\nat t2 has many desires, beliefs, memories in common with A's mental state at t1, and A's mental\nstate at t1 causes B's mental state at t2 to be as it is.\nLet psychological continuity be the ancestral of the psychological connectedness relation.\nA is B iff\nA's mental state at t1 is psychologically continuous with B's mental state at\nt2.\n6. Some other Theories of Personal Identity Over Time\nThe Soul Criterion\nA is B iff\nthe soul A has at t1 is the soul B has at t2\nThe Bodily Criterion\nA is B iff\nthe body A has at t1 is the body B has at t2\nThe Brain Criterion\nA is B iff\nthe brain A has at t1 is the brain B has at t2\nLocke's objections to the bodily criterion: the prince and the cobbler, Socrates and the mayor of\nQueensborough. Similar objections might apply to the soul and brain criterion.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n24.00 Problems of Philosophy\nFall 2019\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "24.00F19 Lecture Handout 15: Parfit on Personal Identity",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-00-problems-of-philosophy-fall-2019/ab4242e73c4ee4bb7b42d70f172d8efe_MIT24_00F19_lecturehandout15.pdf",
      "content": "Handout 15\nParfit on Personal Identity\n1. Parfit's Goals\nParfit wants to argue against two claims:\n(a) Questions of personal identity of the form \"Is X the same person as Y\" must always have\nan answer.\n(b) Unless we can answer personal identity questions in some particular case, we cannot\nanswer several other important questions (survival, responsibility etc.)\nParfit is then going to argue that his picture has some important upshots: it makes less sense to\nhave a self-interested theory of morality, and it also makes less sense to be depressed about aging\nand death.\n2. Fission\nSome cases:\nBrain Transplant 1: Your brain is transplanted into a new body. The new body has the same\ncharacter and apparent memories.\nBrain Transplant 2: Half of your brain is damaged, as well as your body. The healthy half gets\ntransplanted into a new body that has the same character and apparent memories.\nFission: Your brain is divided and each half is transplanted into a new body - both resulting\npeople have the same character and apparent memories. (Or: teletransportation)\nThree options for how to think about fission cases:\n(1) I survive as one of the two people\n(2) I do not survive\n(3) I survive as both people.\nArgument against (1): No grounds for supposing it to be one rather than the other\nArgument against (2):\nP1: In Brain Transplant 1, you survive.\nP2: In Brain Transplant 2, you survive\nWhy? P1+ people have in fact survived with half their brains destroyed. So it's plausible\nthat you survive in Brain Transplant 2 as well.\nP3: The only difference between Brain Transplant 2 and Fission is that in Fission there is more you\nish stuff around.\nP4: More you-ish stuff around can't take you from survival to non-survival.\nC: In Fission you survive. (P2-P4)\nArgument against (3):\nP1: The two fission products, A and B are two distinct people.\nP2: Identity is a transitive relation.\nC: A and B are not both identical to C, the original person (P1, P2)\nParfit, Derek. \"Personal Identity.\" Philosophical Review 80, no. 1 (1971): 3-27. (c) Duke University Press. All rights reserved. This content is excluded from our\nCreative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/.\n\nParfit considers the rejection of P1. Why can't we imagine a single person with 2 bodies?\nCertain surgical procedures result in \"split-brain\" - in which there are \"two separate spheres of\nconsciousness\" each of which controls half of the patient's body.\nBut it seems much less plausible to think of there being one person with two bodies if the mind is\ndivided permanently and each half develops in its own ways, creates its own memories, etc.\nWhat to do?\nParfit's favorite approach: There is no answer. Second to favorite: Answer (3)\nBut the crucial point for Parfit is that the identity question doesn't matter. Whether you are the\nsame person as one or both fission products or not, what's important for survival is the relation that\nexists between you and the fission products, not any questions about identity.\nTerminological note: Survival does not entail identity\n\"Survival\" is being essentially used as code for \"what matters when we talk about survival.\"\n(Another option in a similar spirit: Claim that you don't survive in fission cases, but that's fine\nbecause survival is not what matters.)\n3. What Matters for Survival?\nIf identity is not what matters, what does matter?\nRoughly \"psychological continuity.\"\nParfit thinks that when we take judgments of personal identity to be of great importance, that's\nreally because in the cases we're considering, identity implies psychological continuity.\nParfit proposes that we think of identity as non-branching psychological continuity.\n\"X and Y are the same person if they are psychologically continuous and there is no person who\nis contemporary with either and psychologically continuous with the other.\"\nWhat does psychological continuity consist in? Continuity with respect to things like quasi-\nmemory, beliefs, desires, personality traits and so forth.\n[Parfit defines q-remembering an experience as:\n\"(1) I have a belief about a past experience which seems in itself like a memory belief (2) someone\ndid have such an experience and (3) my belief is dependent up on this experience in the same\nway (whatever that is ) in which a memory of an experience is dependent upon it.\" (15).]\n4. Fusion\nIn fusion cases two people come together. While they are unconscious their bodies grow into\none. One person wakes up.\nq-memories can be maintained but some things will be lost. They can't be both optimists and\npessimists, they can't both intend to go shopping and intend to not go shopping etc...\nParfit, Derek. \"Personal Identity.\" Philosophical Review 80, no. 1 (1971): 3-27. (c) Duke University Press. All rights reserved. This content is excluded from our\nCreative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/.\n\nParfit thinks it's less absurd to regard fusion as death (=not surviving) than to regard fission as\ndeath, since some aspects of your psychology will indeed cease to exist. But he still thinks that\nenough can be maintained that it seems implausible to regard it as death - especially if a suitable\n\"fusion partner\" is selected for you.\n5. Refining the Psychological Continuity Account\nRecall that we defined \"memory continuous\" as the ancestral of \"memory connected.\"\nSimilarly, we'll define \"psychologically continuous\" as the ancestral of \"psychologically\nconnected\" (A is psychologically connected to B if and only if A and B share sufficiently similar\npsychologies, and B's psychology depends on A's \"in the right sort of way\").\nNote that connectedness is intransitive, but continuity is transitive.\nParfit thinks that connectedness is more important for survival than continuity.\nEither way though: both connectedness and continuity come in degrees which means that survival,\nthe thing that matters according to Parfit, comes in degrees as well.\nHow much connectedness or continuity is required to count some being as a \"past self\" of ours\nmight vary in different contexts - it's up to us what criteria we set, but it will be somewhat\narbitrary.\n6. The Upshots\n(a) Self Interest\nA principle some have found plausible: \"Act in your own self-interest\" (the interest of your future\nself)\nA way to motivate the principle: Act in accordance with what you want + most people want\nwhat's in their own self-interest. Parfit doesn't object (here) to that. But the self-interest principle\nis stronger that what's motivated by this thought. It says you should act in your own self interest\nwhether you want to or not.\nSo now imagine somebody that doesn't care particularly about the interest of his future self.\nOnce we accept the idea that what counts as a person's future self is essentially arbitrary - it's\nhard to motivate the claim that this person has special reason to care about his own interest more\nthan others.\n(b) Fear of Aging and Death\nWhether in-the-distant future \"you\" actually is you is again, for Parfit, not a deep question. It's\njust a matter of how we decide to use personal identity language. So there's no real reason to\nfear your own distant death any more than you would somebody else's.\nParfit and Hume's hope: more of what is bad depends on false belief.\nParfit, Derek. \"Personal Identity.\" Philosophical Review 80, no. 1 (1971): 3-27. (c) Duke University Press. All rights reserved. This content is excluded from our\nCreative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n24.00 Problems of Philosophy\nFall 2019\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "24.00F19 Lecture Handout 16: Williams on Personal Identity",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-00-problems-of-philosophy-fall-2019/8cac7008d64588cccf993e74b327715e_MIT24_00F19_lecturehandout16.pdf",
      "content": "Handout 16\nWilliams on Personal Identity\n1. The Case\nSuppose A and B are going to be put to sleep. Wires will be set up between their brains such that\nall the information encoded in A's brain will be transferred to B's and vice versa.\nWhen they wake up we'll be confronted with two people:\nOne person with what-was-A's body and what-was-B's mind. We'll call him The A-bodied person\nThe second with what-was-B's body and what-was-A's mind. We'll call him The B-bodied person\nBefore being put to sleep it's announced that the one of the two people after the experiment will\nbe given $100,000 and the other will be tortured.\nEach of A and B before the experiment are asked which treatment they want each post-\nprocedure person to get from a purely selfish perspective.\n2. In Support of Psychological Criteria\nConsideration 1: Suppose A chooses that the B-body person gets the pleasant treatment and the\nA-body person gets the unpleasant person. And B chooses the reverse (that the A-body person\nget the pleasant treatment).\nThe experimenter can't act in accordance with both preferences.\nSuppose she gives the pleasant experience to the A-body person and the unpleasant experience to\nthe B-body person, in accord with B's pre-procedure preferences. Then the A-body person will be\nvery pleased upon waking up, and claim \"I made the right choice! I'm so glad the experimenter\ndecided to go with what I wanted.\"\nWhereas the B-body person will be upset and claim: \"My choice wasn't honored!\"\nThis is some evidence that the A-body person really is B, and the B-body person really is A. And that\nin fact each person made the right choice.\nWhyis this evidence? Perhaps the thought is:\nIf X's belief about his past are beliefs about what A did, that is some evidence that X is A.\nConsideration 2: Suppose A has anxiety and hopes that as a result of the procedure his anxiety\nwill diminish. After the procedure the A-body person is asked: \"Do you feel relief from your\nanxiety\"? The A-body person will respond: \"What are you talking about? I've never had any\nanxiety.\" If the B-body person is asked the same question he'll say \"sadly, this procedure did\nnothing to relieve my anxiety.\"\nWhy is this evidence for the psychological criterion? Perhaps the thought is:\nIf X's claims about his past mental life are claims about what A's mental life was like that is some\nevidence that X is A.\nWilliams, Bernard. \"The Self and the Future.\" Philosophical Review 79, no. 2 (1970): 161-80. (c) Duke University Press. All rights reserved. This content is\nexcluded from our Creative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/.\n\nMore generally, perhaps the thought is: we should defer to present people who their past selves were.\n3. In Support of the Bodily Criterion\nSuppose I'm told I'll be tortured. I'll be unhappy about this.\nSuppose they say: \"while you're being tortured you won't remember being informed of the fact\nthat you'll be tortured\"\nThis won't mitigate my concern\n(Note: according to Parfit this should mitigate my concern a bit)\nSuppose they then add that during the torture I won't remember several things.\nThis won't mitigate my concern. I'll think torture + amnesia! That's awful!\nSuppose they also add that the torture will result in my brain getting messed up in such a way\nthat I have apparent memories that are not my own.\nThis won't mitigate my concern. I'll think in addition to being tortured I'll have gone\nmad.\nBut, Williams says, this is the same as the case described earlier, just presented differently!\nAccording to the psychological criteria my comfort should be increasing as the description\ncontinues and at the end I should think \"this person being tortured will not be me!\"\nOther intuition-pumps in the vicinity:\n- Fears about general anesthesia\n- If you were told you'd be in a car accident, and wake up with amnesia and with a\ndifferent personality, would you want to invest in this person's well being, pain relief,\nmedical care etc? Would you expect your friends and family to care for this person?\n4. Possible Sources of the Conflicting Intuitions\nPossible Source #1: The language, it's described as I'll be tortured, I'll cease to remember my\npast, etc.\nResponse: if we found the idea incoherent we wouldn't/shouldn't go along with it. Williams\nsuggests that, what's underlying the intuition is the thought \"my undergoing physical pain in the\nfuture is not excluded by any psychological state I may be in at the time\" (169) (with certain\nobvious exceptions).\nPossible Source #2: The other person, the person would be me in a \"body-swap\" case, is not even\nmentioned! So I latch on to the only person in the story who could be me.\n5. Breaking it Down\n(From p.172):\n(i)\nA is subjected to an operation which produces total amnesia;\n(ii)\nAmnesia is produced in A and other interference leads to certain changes in his\ncharacter\nWilliams, Bernard. \"The Self and the Future.\" Philosophical Review 79, no. 2 (1970): 161-80. (c) Duke University Press. All rights reserved. This content is excluded\nfrom our Creative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/.\n\n(iii)\nChanges in his character are produced, and at the same time illusory 'memory' beliefs\nare induced in him; these are of quite a fictitious kind and do not fit the life of any\nactual person;\n(iv)\nThe same as (iii) except that both the character traits and the 'memory' impressions\nare designed to be appropriate to another actual person B.\n(v)\nThe same as (iv) except that the result is produced by putting the information into A\nfrom the brain of B by a method which leaves B the same as he was before;\n(vi)\nThe same happens to A as in (v) but B is not left the same, since a similar operation is\nconducted in the reverse direction.\nWhen would you start feeling comforted?\nWilliams thinks that A should clearly be afraid of situation (i), (ii) and (iii).\nDoesn't seem like the fact that the memory impressions are those of an actual human being\nshould make a difference. (iv)\nAnd if we think that why should it matter to me whether they just happened to be the same or\nwhether they were obtained through B (v).\nSo the crucial turning point must happen in (vi), where A's psychology gets transplanted into B.\nBut once we've gotten to (v), says Williams, why would A care what happens to this other person?\nThe move from (v) to (vi), says Williams, seems like one of the least plausible ones to block\nbecause the change is a change that happens to somebody else!\nObjection 1: You're begging the question Williams when you say it's happening to somebody\nelse. On my view it's happening to A!\nResponse: If you think what happens to the B-bodied person in (vi) is happening to A, and so in\n(vi), A isn't being tortured, then you should also think that A isn't being tortured in (v).\nAfter all in both (v) and (vi) the person being tortured - the A-bodied person is exactly the same\nin all respects - character, history, apparent memory. So if you think it's not A being tortured in\n(vi), you should think it's not A being tortured in (v).\nObjection 2: It's unreasonable to insist that a sharp line be drawn somewhere. It might be\nindeterminate or ambiguous at which point the A-bodied person is no longer A.\nResponse: This may be intellectually comforting but what is A who is anticipating all this\nsupposed to make of the fact that in some versions of the case it will be indeterminate whether or\nnot it is A being tortured?!\n\"That it is conceptually undedicable whether it will be me or not, is something which, it seems, I\ncan do nothing witih ;because, in particular, it seems to have no comprehensible representation\nin my expectations and the emotions that go with them\" (175).\nAnalogy: Perhaps it's like a case in which it's indeterminate whether an object you're\nsentimentally attached to is destroyed?\nResponse: It's not. \"To regard the prospective pain-sufferer just like the transmogrified object of\nsentiment, and to conceive of my ambivalent distress about his future pain as just like ambivalent\ndistress about some future damage to such an object, is of course to leave him and me clearly\ndistinct from one another, and thus to displace the conceptual shadow from its proper place. I\nWilliams, Bernard. \"The Self and the Future.\" Philosophical Review 79, no. 2 (1970): 161-80. (c) Duke University Press. All rights reserved. This content is excluded\nfrom our Creative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/.\n\nhave to get nearer to him than that. But is there any nearer that I can get to him without\nexpecting his pain? If there is, the analogy has not shown us it. We can certainly not get nearer\nby expecting as it were ambivalent pain; there is no place at all for that. There seems to be an\nobstinate bafflement to mirroring in my expectations a situation in which is conceptually\nundecidable whether I occur (177-178).\nWilliams ends up saying he has no idea what option to choose if he were presented with the\noriginal case and that he finds this rather disturbing.\nOne last consideration: If Parfit is right and we care about psychological connectedness or\ncontinuity, then even in cases in which we clearly don't survive, we should still prefer there to be\nbeings who are more psychologically connected to us.\nBut do we? Imagine a case in which you're killed, but prior to your death some of your\nmemories get transplanted into another person. Does that make you feel even a bit better about\ndying?\nWilliams, Bernard. \"The Self and the Future.\" Philosophical Review 79, no. 2 (1970): 161-80. (c) Duke University Press. All rights reserved. This content is\nexcluded from our Creative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n24.00 Problems of Philosophy\nFall 2019\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "24.00F19 Lecture Handout 17: Dennett-Where Am I?",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-00-problems-of-philosophy-fall-2019/90c61ac40ce7090c1d4067a3aff4b860_MIT24_00F19_lecturehandout17.pdf",
      "content": "Handout 17\nDennett - Where am I?\nThe case: Dennet's brain is put in a vat so he can go explore some radioactive substance\nunderground in Tulsa Oklahoma. When he awakes from the surgery he names the brain\n\"Yorick\" and the body \"Hamlet\" and himself \"Dennett.\" Where is Dennett?\nDifferent views:\n(1) Where Hamlet goes there goes Dennett. Problem - Body swapping\n(2) Where Yorick goes there goes Dennett. Problem - Dennett is thinking \"Obviously I'm\nnot inside a vat right now.\"\nFurther support: He imagines robbing a bank in California (the vat is kept in\nTexas). Several questions arise\n- Whose jurisdiction would he be under? CA or TX?\n- Would CA put Hamlet in prison and leave Yorick happily in his vat in\nTexas? Or would TX put Yorick in some dark dungeon? Dennett\nnotices he's prefer the latter.\n- Could the Houston people provide an alibi by claiming he was in\nTexas during the bank robbery?\n(3) Dennett is wherever he thinks he is - At any given time a person has a point of view and\nthe location of the point of view is the location of the person. Problem - sometimes we\nare ignorant about where are. Imagine we are lost in the woods, or believe we are in\nsome other country, etc. Response: in such cases we are still sure that we are in our own\nbody.\n- But...not obviously in Dennett's current situation. Does this view\nentail that Dennett is in some indeterminate location?\n- Someone in a Cinerama who is under the illusion that he's on a roller\ncoaster and forgets momentarily that he's seated in a theatre.\n- Workers who operate mechanical arms undergo a shift in point of view\n(4) Dennett exists in two places - just like you can stand with one foot in Rhode Island and\none foot in Connecticut. Problem: Hamlet goes to Tulsa Oklahoma for his underground\nexpedition. Then gradually he gets disconnected. First he can't hear, then he can't\nspeak, then he can't see, then he becomes paralyzed until...Dennett experiences himself\nas disembodied and fully believes himself to be in Houston.\n- Did he move faster than the speed of light (when the last radio signal\ndied)? Does this show that he's not a material object?\no Compare to: a treaty being signed changing the \"location\" of a\ncountry. Does this show that countries aren't physical objects?\nIn a sense yes, in a sense no. But do we think of ourselves as in\nsome sense abstract objects, like we might think of a country?\nThe story continues:\nDennett, Daniel C. \"Where Am I?\" Chapter 6 in Science Fiction and Philosophy: From Time Travel to Superintelligence. 2nd ed. Edited by Susan Schneider. Wiley-Blackwell, 2016.\n(c) Wiley-Blackwell. All rights reserved. This content is excluded from our Creative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/.\n\nDennett is put to sleep for about a year while they work on getting him a new body. When\nDennett wakes up with his new body (Fortinbras) he goes to visit Yorick in the vat and just for\nfun turns the switch to \"off\" but nothing happens!\n\"It seems that before they had even operated on the first occasion they had constructed a\ncomputer duplicate of my brain, reproducing both the complete information-processing\nstructure and the computational speed of my brain in a giant computer program. After\nthe operation, but before they had dared to send me off on my mission to Oklahoma they\nhad run this computer system and Yorick side by side. The incoming signals from\nHamlet were sent simultaneously to Yorick's transceivers and to the computer's array of\ninputs. And the outputs from Yorick were not only beamed back to Hamlet, my body;\nthey were recorded and checked against the simultaneous output of the computer\nprogram which was called \"Hubert\" for reasons obscure to me. Over days and even\nweeks, the outputs were identical and synchronous...Hubert's input, and hence activity,\nhad been kept parallel with Yorick's during my disembodied days.\" (6)\nBefore waking Dennett up they hooked Hubert (rather than Yorick) to Fortinbras.\nDennett now has the option of switching the control of his body back to Yorick from Hubert. He\ntries it out and nothing happens. He flicks the switch back and forth and notices no difference\nwhatsoever. He realizes it doesn't matter which one he's hooked up to. He settles on Yorick.\nHe gets set up with a device that controls connections to both brains, and he is the only person\nthat has access to these connections. (Dennett requests this in part to make sure that the other\nbrain doesn't get hooked up to a separate body and create a bunch of havoc in his financial and\nsocial affairs, in addition to puzzlement about which one he is). There's a switch on the device\nwhich allows him to switch between brains from time to time just for kicks, but the switch is\nunmarked so he never knows which he is.\nAt a certain point Dennett is giving a lecture and flips the switch as a demonstration. Here's\nwhat emerges:\n\"THANK GOD! I THOUGHT YOU'D NEVER FLIP THAT SWITCH! You cant\nimagine how horrible it's been these last two weeks - but now you know; it's your turn in\npurgatory. How I've longed for this moment! You see, about two weeks ago - excuse\nme, ladies and gentlemen, but I've got to explaini to my...um, brother, I guess you could\nsay, but he's just told you the facs, so you'll understand - about two weeks ago our two\nbrains drifted just a bit out of synch...and of course once the process started, it\nsnowballed, for I was in a silightly deifferent receptive state for the input we both\nreceived, a difference that was soon magnified. In no time at all the illusion that I was in\ncontrol of my body - our body - was completely dissipated. There was nothing I could\ndo - no way to call you. YOU DIDN'T EVEN KNOW I EXISTED! It's been like being\ncarried around in a cage, or better, like being possessed - hearing my own voice say\nthings I didn't mean to say, watching in frustration as m yown hands performed deeds I\nhadn't intended. You'd scratch our itches, but not the way I would have, and you kept\nme awake, with your tossing and turning. I've been totally exhausted, on the verge of a\nnervous breakdown, carried around helpleslly by your frantic round of activities\" (8).\nDennett, Daniel C. \"Where Am I?\" Chapter 6 in Science Fiction and Philosophy: From Time Travel to Superintelligence. 2nd ed. Edited by Susan Schneider. Wiley-Blackwell,\n2016. (c) Wiley-Blackwell. All rights reserved. This content is excluded from our Creative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n24.00 Problems of Philosophy\nFall 2019\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "24.00F19 Lecture Handout 18: Wolf on Meaning of Life",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-00-problems-of-philosophy-fall-2019/2275adfc73f1a4063aa030eb367f16ee_MIT24_00F19_lecturehandout18.pdf",
      "content": "Handout 18\nWolf on the Meaning of Life\n1. What is the \"What is the Meaning of Life?\" Question?\n* What does a life represent or symbolize?\nLives are not parts of languages or symbolic systems\n* \"What is the purpose of human existence\" \"why are we here?\" with the hope that the answer\nwill inform what we should do with our lives\nThe standard secular response is: there is no purpose. If we weren't designed by a God\nwith some intention, the idea that we're here for some reason is implausible. We're just\nthe output of some physical processes.\n* How can one find meaning in a life?\nWolf thinks \"meaningfulness\" is an intelligible feature to be sought after in a life.\n2. What Makes for Meaning if Life?\nA Hypothesis Wolf Rejects: Experiences that we find subjectively rewarding, emotionally\nsatisfying, experiences that feels meaningful/have importance/meaning/significance to the\nsubject.\nWolf rejects this view. She thinks we can judge other peoples' lives as meaningful or not\nand that our judgments are not determined by whether we think those people had\nemotionally satisfying experiences.\nThe strategy: Consider candidates for meaningless lives, and see what these lives are missing:\nThe Blob - person spends day after day in front of a TV, watching sitcoms and drinking beer. Life\nlived in \"hazy passivity\"\nUseless\n-\nthe idle rich hopping from one amusement to another\n-\nThe corporate executive working all the time, experiencing great stress for the sole\npurpose of accumulation of wealth\n-\nThe pig farmer who buys more land to grow more corn to feed more pigs to buy more\nland to grow more corn to feed more pigs\nBankrupt\n-\nDevoting one's life to create and build up a company to hand over to one's children but\nthe item the company manufactures is rendered obsolete by new technology shortly\nbefore retirement\n-\nScientist whose life work is rendered useless by the announcement of a breakthrough\nweeks before her research would have yielded the same result\n-\nDevotion to a relationship that turns out to be a fraud\nWolf, Susan. \"The Meaning of Lives.\" (c) Susan Wolf. All rights reserved. This content is excluded from our Creative Commons license. For more information, see\nhttps://ocw.mit.edu/help/faq-fair-use/.\n\nThe contrast:\nActive engagement (unlike Blob) in a project that has positive value (unlike Useless) and which is\nto some extent successful (unlike Bankrupt).\n\"A meaningful life is one that is actively and at least somewhat successfully engaged in a project (or projects) of\npositive value\" (5).\n3. Clarifications\nProjects - the word is used in a broad sense to encompass not only goal-directed tasks but other\nsorts of ongoing activities and involvements as well.\nActive - activity is not enough for active engagement. The alienated housewife's life may be full of\nactivity but her heart isn't it. She's just \"going through the motions.\"\nPositive value - Wolf leaves this intentionally unspecific so that the account is ecumenical to a\nbroad range of views of positive value. But she wants to rule out a view on which it suffices for\npositive value that the project seem to have positive value from the subject's perspective. This\nwould blur what she takes to be the important distinction between living a meaningful life and\nliving a life that seems meaningful.\nOne role for this distinction: explaining the sorts of epiphanies one experiences when\none suddenly recognizes that one's life to date has not been meaningful. The yearning for\nmeaningfulness will not be satisfied by \"putting the scales back on\"\nLastly: positive value = moral value (consider athletes and artists)\n4. Should We Care About Having a Meaningful Life?\nFact: a lot of people want meaning in their lives.\nBut we don't just think it's fine for people to like meaning, in the way it's for people to like\ncountry music. We think people ought to pursue lives that are meaningful.\nBut this is a bit mysterious.\nQuestion: What is so good about living a meaningful life and who exactly is it good for?\n- Not necessarily morally better - so not better for the world\n- Not necessarily happier - Blob's hazy passivity may feel better than the experience of a\ntortured artist. So it's not obviously better for the subject.\nSo what kind of \"ought\" is used in the claim that one \"ought\" to care about meaning in one's life,\nor live a meaningful life, or want a meaningful life?\nWolf thinks the ought involved is closest to the prudential ought - it is bad for the subject to have a\nlife that's not meaningful - even if she has no desires that meaningfulness would satisfy. If\nmeaninglessness won't make her unhappy, what about a lack of meaning is bad for subject?\nWolf, Susan. \"The Meaning of Lives.\" (c) Susan Wolf. All rights reserved. This content is excluded from our Creative Commons license. For more information, see\nhttps://ocw.mit.edu/help/faq-fair-use/.\n\nThe Answer: A subject whose life lacks meaning has a life that is not in accord with or responsive\nto certain important facts.\nWolf thinks recognition of our place in the universe, our insignificance, involves recognition of\nthe \"mereness\" of our subjective point of view. In the face of such a recognition a life devoted to\nthe subjects own fulfillment or survival seems soplisistic or silly.To live such a life expresses a kind\nof commitment that one's happiness is all that matters, but that seems very implausible.\nCompare: Nagel argues that if you fail to see the pain of others as a reason, you are acting\nas if others pain is not real. Such a person is making an error.\nSimilarly, devoting oneself wholly to one's own satisfaction is to act in a way that is not in\naccordance with the truth that one's own satisfaction doesn't matter all that much.\nObjection: Our speckness warrants the conclusion that there is no meaning to life, and that each\nindividual life is necessarily absurd. So seeking meaning in life is not the appropriate response to\nour cosmic insignificance.\nResponse: \"Living in a way that is significantly focused on, engaged with, and concerned to\npromote or realize value whose source comes from outside of oneself, does seem to harmonize\nwith [the fact of our insignificance and the of the mereness of our subjectivity], whereas living\npurely egocentrically does not. Living lives that attain or realize some nonsubjective value may\nnot make us meaningful, much less important, to anyone other than ourselves, but will give us\nsomething to say, to think, in response to the recognition of perspectives that we ourselves\nimaginatively adopt that are indifferent to our existence and to our well-being\" (14)\nWolf's Moral: There can be meaningful lives even if there is no overall meaning to life.\nTo Think About: Does our own satisfaction matter at least a bit? If so, isn't the question a matter of\nhow much our own satisfaction compares to other, arguably, specky-projects? Why doesn't\ndevotion to non-self-oriented specky-projects express a commitment to these other specky-things\nbeing all that matters?\nWolf, Susan. \"The Meaning of Lives.\" (c) Susan Wolf. All rights reserved. This content is excluded from our Creative Commons license. For more information, see\nhttps://ocw.mit.edu/help/faq-fair-use/.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n24.00 Problems of Philosophy\nFall 2019\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    }
  ]
}