{
  "course_name": "Projects in Microscale Engineering for the Life Sciences",
  "course_description": "This course is a project-based introduction to manipulating and characterizing cells and biological molecules using microfabricated tools. It is designed for first year undergraduate students. In the first half of the term, students perform laboratory exercises designed to introduce (1) the design, manufacture, and use of microfluidic channels, (2) techniques for sorting and manipulating cells and biomolecules, and (3) making quantitative measurements using optical detection and fluorescent labeling. In the second half of the term, students work in small groups to design and test a microfluidic device to solve a real-world problem of their choosing. Includes exercises in written and oral communication and team building.",
  "topics": [
    "Engineering",
    "Biological Engineering",
    "Biomaterials",
    "Cell and Tissue Engineering",
    "Mechanical Engineering",
    "Microtechnology",
    "Nanotechnology",
    "Engineering",
    "Biological Engineering",
    "Biomaterials",
    "Cell and Tissue Engineering",
    "Mechanical Engineering",
    "Microtechnology",
    "Nanotechnology"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 3 hours / session\n\nContents - Engineering Systems at the Scale of Cells and Biomolecules\n\nHow do you build tools that can manipulate cells?\n\nLithography: Shrinking patterns to the micro-scale\n\nSoft lithography: Making bio-compatible fluid reservoirs\n\nRapid prototyping: Using existing microscale structures to test new ideas\n\nHow do you measure properties of individual cells?\n\nOptical imaging\n\nElectrical signals\n\nCell sorting\n\nAveraging\n\nTeaching/Learning Activities\n\nTwo lectures each week to introduce new material.\n\nTwo lab sessions each week to provide hands-on experience.\n\nOne project to help students learn to pose testable hypotheses, to conduct research, and to communicate results.\n\nWeekly homework assignments to encourage students to actively assimilate the course material.\n\nHomework\n\nWeekly homework assignments provide an opportunity to develop intuition for new concepts by actively applying the new concepts to solve problems and answer questions. The process of actively struggling with the use of new ideas until you understand them is an effective and rewarding form of education.\n\nWeekly homework assignments will be distributed in class on Thursdays and will be due the following Thursday at the start of lecture. Late homework will not be accepted. Homework assignments will be corrected, graded, and returned the week after they are due. The solution to each homework assignment will generally be made available to the class a few days after the homework due date. Paper copies of homework assignments and solutions will not be distributed.\n\nHomework problems will be chosen for their educational value. Reading someone's solution to a problem is not educationally equivalent to generating your own solution. If you skip the process of personally struggling with the use of new concepts, you will have destroyed your most important educational experience.\n\nCollaboration Policy\n\nWe encourage students to\ndiscuss\nthe homework with other students and with the teaching staff to better understand the concepts. However, we expect that\nyou\nwrote the solutions that you submit under your name. Students should\nnot\nuse solutions of other students (from this year or from previous years) in preparing their own solutions. Students should\nnot\ntake credit for computer code or electronic plots generated by other students. Students should\nnot\nshare their solutions with other students. Any student caught plagiarizing will receive a grade of zero on the assignment. All incidents of plagiarism will be reported to the Committee on Discipline (COD). More information about what constitutes plagiarism can be found at\nMIT Academic Integrity\n.\n\nProjects\n\nThis subject includes one project. In this project, students are asked to improve on an existing microfluidic design or technique. Students will be expected to demonstrate the improvement with a working prototype. The project provides an opportunity to learn about, planning R&D and experiments, acquiring, processing, and interpreting data, communicating the results to others. The project requires a written proposal, which includes a well-defined hypothesis and procedures to test the hypothesis. Students are encouraged to work in pairs for the project. Partners are encouraged to submit a joint proposal and to cooperate in design, in collecting and processing data, in discussing interpretations, and in preparing their reports. Partners are also encouraged to submit a joint report. We strongly believe that students learn more by working with other students than by working in isolation. The final report will be presented in the form of a short talk to the class. It should be 12 minutes in length and should be delivered during the next to last week of the semester. The report has a\nfirm due date\n, which is listed on the subject calendar. There are\nsevere lateness penalties\nfor missing the due date.\n\nCommunications Intensive\n\nThis subject is communications intensive. We feel that communications skills are essential for professional engineers and scientists. We also feel that the process of creating written manuscripts and oral presentations can help clarify thinking and can be an effective way to\nlearn technical material\n. Homework assignments will often ask you to explain something or to define something that you have been taught. In addition the project is communications intensive. For the project, you and your partner must submit a written proposal and revise the proposal until it is approved by the staff. You and your partner must prepare a formal report that is structured as a scientific oral presentation. First drafts of the report are due approximately one week before the final draft, and will be reviewed by the technical staff, staff from the Writing Program, and by student peers. You and your partner will be assigned to prepare a written critique of a first draft from a different team. The critiques will be discussed during a special session held between the first draft and final draft deadlines. Students can satisfy their freshman year communications requirement by taking this subject.\n\nGrade\n\nBecause of the project-oriented nature of this subject, grades will depend strongly on the final project. It should be noted that this project grade itself has several components which will be graded separately (e.g., proposal, first draft, written critique, etc.). In addition, your final presentation will be graded on several metrics (technical content, effective use of slides, clarity of presentation, etc.). More detail on grading is provided in the\nassignments\nsection of this site. The weighting factors for determining letter grades are:\n\nACTIVITIES\n\nPERCENTAGES\n\nHomework\n\n50%\n\nLab project\n\n50%\n\nFor students near grade boundaries, other factors may be taken into account, including participation in class, laboratory performance not evidenced in the laboratory grade, etc. The grades are determined by the staff.\n\nText\n\nThe course has no required text. Supplementary materials will be distributed over the course of the semester.\n\nCalendar\n\nLEC #\n\nTOPICS\n\nKEY DATES\n\nIntroductory exercises\n\nMicrofluidics\n\nMicrofabrication\n\nCells and membranes\n\nCells and membranes (cont.)\n\nHomework 1 due after five days\n\nModels of diffusion and cell experiment\n\nLaminar flow\n\nHomework 2 due\n\nData analysis using MATLAB(r)\n\nResearch applications\n\nHomework 3 due\n\nResearch paper discussion\n\nVisit research lab\n\nHomework 4 due\n\nCell traps\n\nCell traps (cont.)\n\nProject brainstorming\n\nProjects\n\n14-18\n\nProjects\n\nHomework 5 due Lec #15\n\nProject propsal due Lec #16\n\nDevice fabrication\n\n20-23\n\nProjects\n\nProject presentation\n\nDry runs\n\nProjects\n\nProject presentations",
  "files": [
    {
      "category": "Resource",
      "title": "chipmask.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-410j-projects-in-microscale-engineering-for-the-life-sciences-spring-2007/5de9a3c7a1ae57195547c24aae32d2c7_chipmask.pdf",
      "content": "\\\\Cam2\\E\\mit\\38747\\Layer_1.gbr (Board layer 1) Scale=1.00 Tue Dec 26 14:15:44 2006\nHarvard-MIT Division of Health Sciences and Technology\nHST.410J: Projects in Microscale Engineering for the Life Sciences, Spring 2007\nCourse Directors: Prof. Dennis Freeman, Prof. Martha Gray, and Prof. Alexander Aranyosi\nHarvard-MIT Division of Health Sciences and Technology\nHST.921: Information Technology in the Health Care System of the Future, Spring 2007\nCourse Director: Steven E. Locke, MD"
    },
    {
      "category": "Resource",
      "title": "lab_equipment.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-410j-projects-in-microscale-engineering-for-the-life-sciences-spring-2007/bb9f772318e403cbe02d0f9c861980bd_lab_equipment.pdf",
      "content": "Experiment Platforms\nThe experiment platforms for the microfluidics laboratory consist of a microfluidic\nchamber and a video microscope that is controlled via a computer.\nMicrofluidic Chambers\nWe will be using a variety of chamber designs throughout the course of the term; you\nmight even design one of your own for your project. One example design is a long\n(approximately 30 cm) slender (250 micrometers wide, 75 micrometers high) channel\nthat runs between five reservoirs that can be filled with test solutions and cells. The\nHarvard-MIT Division of Health Sciences and Technology\nHST.410J: Projects in Microscale Engineering for the Life Sciences, Spring 2007\nCourse Directors: Prof. Dennis Freeman, Prof. Martha Gray, and Prof. Alexander Aranyosi\n\nimage below illustrates the topology of this design; the actual layout may differ\nsomewhat.\n\nIf the two-reservoir end is used as the input, then the solutions in those reservoirs will\nflow side-by-side as they enter the central channel. Such flow is said to be \"laminar\"\nbecause the fluids seem to be in layers. As the fluid progresses down the channel, the\nfluids will gradually mix by diffusion. Such mixing is illustrated in the following\nphotograph.\n\nAlternatively, the three-reservoir end can be used as input, in which case the flow will be\n\"tri-laminar.\" This configuration can be useful for mixing cells contained in the central\nreservoir into a test solution contained in the other two reservoirs.\n\nEstablishing Fluid Flow\nA variety of methods have been used to push fluids through microchambers, including\nmacroscopic pumps (e.g., syringe pumps, peristaltic pumps, etc.) and electrically driven\nflows (e.g., electro-osmosis or electrophoresis). In this lab, we recommend that you use\ngravity flow. With typical designs, a few millimeter difference in fluid level is sufficient\nto drive flow rates on the order of micrometers per second, which are satisfactory for\nmost experiment designs. Input and output ports connect the microfluidic channels to\nmacroscopic fluid reservoirs, as shown in the following photograph. A variety of\nreservoir designs are possible.\n\nBefore running experiments, the device should be completely filled with fluid. In most\ncases, this can be accomplished by adding fluid to one reservoir and allowing capillary\naction to pull fluid through the rest of the device. As the fluid reaches other reservoirs,\nadditional fluid can be added to those reservoirs to help fill the rest of the device more\nquickly. Be careful not to introduce air bubbles with adding fluid. Alternatively, you can\nattempt to fill stubborn devices by applying suction to one reservoir. If you need to do\nthis, we recommend speaking to an instructor before proceeding. You should avoid\napplying positive pressure (pushing), since doing so could rupture the bond between the\nPDMS and glass, ruining your device.\nBefore leaving the lab, please flush your chamber with deionized water and store the\nchamber with all reserviors filled with dionized water. This simplifies starting the flow\nwhen the chamber is next used.\nMicroscope\nThe microfluidics chambers can be held in place on the stage of the microscope using\nmagnets. The stage has x and y control knobs plus a calibrated focus control knob for z.\nThe microscope illumination system can be turned on with a toggle switch on the back of\nthe microscope. The intensity of the illumination can be adjusted with a control on the\n\nright side of the base of the microscope. The microscope has 3 objectives: 4X, 10X, and\n20X, which focus an image of the chamber onto a video camera.\nMeasuring Flow Rates\nQuantitative interpretation of data from microfluidic systems often requires knowledge of\nthe flow rates. Although flow rates can in principle be determined by measuring the time\nit takes for some known volume of fluid to flow through system, it is often more\nconvenient to measure flow rates by tracking microscopic particles that are suspended in\nthe fluid. Microscopic polystyrene beads with diameters on the order of 1 micrometer are\navailable for this purpose. Because of fluid viscosity, the flow profile across the channel\nis approximately parabolic, with faster flow near the center than near the channel walls.\nFor that reason, we use beads that are neutrally bouyant in water (by virtue of a tiny air\nbubble in each bead!). If used in solutions with high concentrations of solutes, these\nbeads can float to the top of the channel (where the fluid moves much less quickly).\nCamscope\nA computer running Linux is attached to the video camera via FireWire. You will use a\nprogram called camscope to collect and analyze data from this camera. What follows are\nsome instructions to get you started. This program was designed for this lab, and has\nmany important features that are not described below. To take full advantage of\neverything this program offers, we recommend you read further information on camscope.\nHere are a few of the things you an do with camscope:\n-\nCapture images from the camera\n-\nCapture sequences of images (movies)\n-\nPlay back previously recorded images and movies\n-\nMeasure distances\n-\nMeasure velocities\n-\nMeasure brightnesses\n-\nMeasure cell sizes\nTo start, log in to the computer using the username camscope and the password\ncamscope. Once you log in, there should be a console (a window with a command\nprompt) visible. If not, click on the icon that looks like a monitor to open one. Since\nmultiple groups will be using each computer, you will need to use directories to keep\nyour data separate. You can name this directory anything you want, as long as the name\nis unique. To make a directory and enter it, type commands like the ones below into the\nconsole.\n> cd\n> mkdir I_Love_Camscope\n> cd I_Love_Camscope\n\nOnce you are in your own directory, type\n> camscope\nto activate the main program.\nWhen camscope starts, it will look like the image below. This is the entire interface: no\nmenus, no pop-up windows, no miraculously appearing or disappearing buttons, no\nmonkeys to punch. There are a few controls that don't have visible buttons, but not many.\nThese are documented at the link provided above. The main part of the screen is taken up\nby the image. This image is either a live feed from the camera, or one of the images you\nrecorded previously. The text above the image tells you the current image number (every\ntime you record a new image, the image number goes up by one) and the time at which\nthe image was taken. Above that are the data set controls and the camera settings (more\nabout these later). Below and to the right of the image are two plots. When the cursor is\nover the image, you will see a horizontal line and a vertical line. The plot below the\nimage displays the RGB (Red, Green, Blue) values for the pixels along the horizontal line.\nThe plot to the right of the image displays the RGB values along the vertical line. Text\nbetween the two plots tells you the current location of the cursor and the RGB values for\nthe pixel below the cursor. The text across the bottom reports distance and velocity\nmeasurements.\n\nButtons on the right provide the following functions (top to bottom, with keyboard\nshortcuts in parentheses. For all keyboard shortcuts, hold down the Ctrl key and press\nthe other key listed):\n\n-\nEXIT (ctrl-q): quit camscope and return to Linux prompt.\n-\nPLAY (ctrl-p): display live images from video camera, or loop through\npreviously recorded images if the program is in Analyze mode.\n-\nPAUSE (ctrl-z): stop displaying new images and hold last one displayed.\n-\nRECORD (ctrl-r): start recording images. Records ten images (by default) and\nthen stops.\n-\nSNAPSHOT (ctrl-s): record a singe image.\n-\nSTOP (ctrl-b): stop recording.\n-\nAnalyze (ctrl-a): toggles between showing live video and showing previously\nrecorded images (Analyze mode).\n-\nBACK (ctrl-left_arrow): display previous recorded image (only works in Analyze\nmode).\n-\nNEXT (ctrl-right_arrow): display next recorded image (only works in Analyze\nmode).\n-\nScreen Capture (ctrl-d): save image of screen (screendump).\nTaking Measurements\nThere are a variety of measurements you can make with camscope. We will describe a\nfew here. You can make any of these measurements in real time from the live camera\nfeed, or from pre-recorded data in Analyze mode.\nBrightness\nMeasuring brightness is easy. Simply put the cursor over a pixel in the image, and\ncamscope will tell you the brightness of that pixel, along with plots of the\nbrightness of all of the pixels in the same row or column. If you take a snapshot\n(ctrl-s) or record a movie (ctrl-r) while the cursor is over the image, this\nbrightness information will be saved into a text file along with the image (in live\ncamera mode only). Note that you'll need to use the keyboard shortcuts for taking\nimages if you want to do this. You can also measure the average brightness in a\nregion of the image by clicking and dragging the right mouse button to draw a\nbox around that region. This average brightness will be displayed next to the\nsingle-pixel brightness data.\nDistance\nTo measure the distance between two points in an image, click and drag from the\nstarting point to the end using the left mouse button. The distance will be\ndisplayed (in pixels) at the bottom of the screen.\nVelocity\nYou can measure velocity the same way you measure distance. However, because\nvelocity involves time as well as space you will need to combine information\nfrom two or more images. In real-time this is easy -- as you click and drag, new\nimages are being displayed, so you can (for example) follow a cell with the mouse\nin real-time to measure its velocity. In Analyze mode, you will need to switch\nimages manually. For example, you can click on a cell in one image, and while\nholding down the left mouse button press ctrl-right_arrow to switch to the next\n\nimage. If you then drag the mouse to the new location of the cell, camscope will\nreport the velocity of the cell as well as the distance traveled.\nArea\nYou can measure the area of an object within camscope using a rudimentary\nsegmentation algorithm built in to the program. When you click the middle mouse\nbutton on a pixel, camscope selects all of the similar pixels that are in contact\nwith the first pixel and displays them in magenta. It also reports the size of the\nselected area (in pixels) below the Screen Capture button. The algorithm is not\nperfect, but there are ways to adjust the settings to fine-tune its performance.\nUsing Multiple Data Sets to Organize Your Measurements\nWhile you're in the lab, you're likely to want to perform more than one experiment. If you\njust collect a bunch of images without organization and go back to analyze them later,\nyou'll have trouble remembering which images correspond to which experiment -- and\nyou might make mistakes in your analysis as a result. However, it can be a pain to\nremember to write down the image numbers corresponding to each experiment. This is\nwhere data sets come in handy.\nData sets are a convenient way to organize your data by experiment. In the upper left\ncorner of the camscope screen you'll see a number that tells you the current data set,\nalong with + and - buttons (with keyboard shortcuts ctrl-. (period) and ctrl-, (comma)\nrespectively). If you increment the data set each time you start a new experiment or\nchange viewing locations, you will only need to write down the data set rather than the\nimage numbers. Starting a new data set resets the current image number to zero. All of\ncamscope's other features (record, analyze, playback, etc) operate on only the current\ndata set. You have 1000 potential data sets to choose from, so take advantage of them!\nSaving Your Results\nAs you record images, camscope will save them to the hard drive. If you quit and restart\nthe program, it will continue recording where it left off (i.e., it won't overwrite the data\nyou've already taken). When you are ready to leave the lab, you should save your data.\nWe cannot guarantee that your data will be preserved on the lab computer, so copy\neverything before you leave. The easiest way to save your data is to record it on a CD.\nPut a blank CD into the CD burner and type\n> k3b\nat the linux prompt. This command will bring up a graphical interface that lets you save\nyour data to CD. If your directory is larger than the size of one CD (about 700 MB), you\nmay find it helpful to split your data into multiple subdirectories and copy each onto a\nseparate CD. Your TA can help you do this. IMPORTANT: along with each image is a\ncorresponding text file. If you delete these text files, or do not save them along with your\nimages, camscope may not be able to load your saved images later. Be sure to keep these\ntext files!\n\nAnalyzing Results\nCamscope is intended to provide sufficient information for you to monitor how your\nexperiment is proceeding while you are in the lab. This is important so that you can\ndiscover problems and fix the problems as they come up. It is also important so that you\nhave a good idea that your experiment was successful or not before you leave the lab. If\nyou discover problems with your data, it is generally easier to take new data now than it\nis to come back at a later time and start again.\nResults from camscope can also be directly incorporated into your homeworks and final\nproject report. However, quantitative statistics to test specific hypotheses generally\nrequire additional analyses, based on images and brightness profiles saved by camscope.\nYou can generate statistics from the info files by importing those numbers into text\nprocessing, spreadsheet, and/or plotting programs. You can generate statistics directly\nfrom the image files using any programming environment that supports the .bmp format\n(e.g., Matlab). Feel free to consult instructors, TAs, peers, or other knowledgable people\nif you need help analyzing data.\nLaboratory Equipment and Supplies\nIn addition to the microfluidic platforms, the lab also has\n-\na scale to weigh solutes\n-\nmicropipeters to measure small quantities of fluid\n-\npipets to measure larger quantities of fluid\n-\ndisposable pipets to transfer fluids to and from reservoirs\n-\nsmall plastic bottles with lids to hold and store test solutions\n-\nchemicals: NaCl, KCl, CaCl2, dextrose, sucrose\n-\nfood coloring to visualize flows\n-\ndeionized water\n-\nand NOTHING else (well actually, there is also air to breathe -- but we don't\nsupply this, so if you use it all up it's your responsibility to get more).\nYou are welcome to use additional supplies and equipment to implement novel methods.\nHowever, you are responsible for obtaining any supplies or equipment not explicitly\nlisted above. The staff is only responsible for supplying the equipment described above.\nIn this experiment, you may use dyes and other chemicals that could stain or irritate your\nskin. Wear latex gloves whenever possible. Wash your hands thoroughly immediately\nafter exposure to any chemicals. Clean up minor chemical spills immediately. Report\nmajor spills to the staff.\nNo foods or beverages will be allowed in the laboratory."
    },
    {
      "category": "Resource",
      "title": "projectideas.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-410j-projects-in-microscale-engineering-for-the-life-sciences-spring-2007/c6bf7ce9d819a4e3b371e4ba39736361_projectideas.pdf",
      "content": "Some Project Ideas\nOptimize Single Cell Traps The single-cell traps you used in lab were de\nsigned as a prototype, with little effort put in to optimizing the design for\nefficiency of trapping (as you probably noticed). One project idea is to\nidentify the parameters that affect trapping efficiency to allow trap design\nto be optimized for individual cell types. This project would involve fab\nricating a series of traps with slightly different configurations (trap size,\ntrap spacing, uniformity, etc.) and testing each for efficiency of trapping.\nDesign Microfabricated Valves One significant challenge in making prac\ntical microfluidic devices is controlling the flow of fluid using valves. A\nvariety of valve designs have been proposed and made. This project would\ninvolve testing various designs to find the best one, and potentially design\ning a new type of valve.\nCoulter Counter A common application of microfluidic devices is cell count\ning. As you read in the paper, this step is often done visually, using a\nmicroscope and a camera. An alternate technique is to build a Coulter\ncounter, which channels the cells through a narrow tube and measures the\nelectrical change that occurs when the cells partially block the tube. This\nproject would involve building and testing such a device, with the poten\ntial to integrate it into the T-cell and CTC-cell detecting devices being\ndeveloped in Dr. Toner's group.\nSorting Cells and Biomolecules by Size A recent paper describes a mi\ncrofluidic device that looks like a pachinko machine -- cells flow past\na series of pillars, and move to one side or the other of each pillar. The\npillars are arranged so that larger cells tend to move to one side while\nsmaller cells tend to move to the other. The net result is that at the end\nof the device, the cells are separated by size. This same concept could\nbe applied to biomolecules or other cell types. This project would involve\ndesigning and fabricating the device, and testing its ability to sort the\ncells or molecules in question.\nHarvard-MIT Division of Health Sciences and Technology\nHST.410J: Projects in Microscale Engineering for the Life Sciences, Spring 2007\nCourse Directors: Prof. Dennis Freeman, Prof. Martha Gray, and Prof. Alexander Aranyosi\n\nMeasuring Mechanical Properties Of Cells Many cells adjust gene tran\nscription and translation based on mechanical forces. Measuring the me\nchanical properties of cells is an important part of understanding how\nthese proteins are regulated. There are a variety of devices that can be\nused to study cell mechanical properties. These include microfluidic traps\nin which cells can be squeezed, microfabricated probes to apply shearing\nforces to cells, and atomic force microscopy for measuring cell surface prop\nerties. This project would involve using one or more of these technologies\nto study the mechanical properties of cells and extracellular structures.\nClassifying Neutrophils Characterizing the growth of new neutrophils in the\nblood of burn victims is an important diagnostic tool. Young neutrophils\ncan be distinguished from adult ones by the shapes of their nuclei; the\nyoung ones are round while the adult ones are convoluted. Currently the\nprocess of counting young and adult neutrophils is done by hand. A com\nputer algorithm that automatically detects the two types would greatly\nspeed the diagnostic process. This project would involve developing image\nprocessing tools to distinguish the two types of neutrophils in images of\nstained tissue, and detecting the presence of contaminant cells.\nCell Migration and Chemotaxis Many cells, including neutrophils, migrate\nin response to chemical, eletrical, and/or optical stimuli. The migration\nprocesses are not fully characterized, and may be useful clinically. This\nproject would involve observing the migration of neutrophils in microflu\nidic devices in response to a variety of stimuli, and characterizing how the\nspeed of migration depends on the stimulus, the type and age of the cell,\netc.\nDesigning a Cleanable Micro-filter A common problem with microfluidic\ndevices is contamination, since dirt and other crud can block the channels.\nOne potential solution to this problem is to build a micro-filter that traps\nthe junk before it enters the device. Such a filter would need to be clean\nable, so that the trapped junk could be flushed out before it completely\nblocks the device. This project would involve designing, fabricating, and\ntesting such a filter."
    },
    {
      "category": "Resource",
      "title": "hw1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-410j-projects-in-microscale-engineering-for-the-life-sciences-spring-2007/d898398241bf96a25d4d4dc715b6e830_hw1.pdf",
      "content": "Massachusetts Institute of Technology\nHarvard-MIT Division of Health Sciences and Technology and\nDepartment of Electrical Engineering and Computer Science\nHST.410J/6.07J\nProjects in Microscale Engineering for the Life Sciences\nHomework Assignment #1\nIssued: February 8, 2007\nDue: February 15, 2007\nProblem 1. Consider an exponential function of time,\nx(t) = Ae-t/ + B.\nPart a. We can approximate this function at t = 0 by a straight line that passes through x(0) with\na slope equal to the slope of the exponential function. We can also approximate this function as\nt ! by a straight line through x(\n) with zero slope. Determine the time T where these two\nstraight lines intersect.\n\nPart b. Determine the time constants a and b of the exponential functions shown by the solid\ncurves in the following plot labelled \"a\" and \"b,\" respectively. Briefly explain your method.\n-3\nPart c. Determine the time constant c of the exponential function shown by the solid curve in the\nprevious plot labelled \"c.\" Briefly explain your method.\nProblem 2. Estimate the velocity with which fluid flows through your microfluidic chamber.\nDescribe your results by writing a one to two page report (350-700 words). Include one or two\nfigures to support your conclusions.\nProblem 3. Estimate the speed with which mixing occurs in your microfluidic chamber. Describe\nyour results by writing a one to two page report (350-700 words). Include one or two figures to\nsupport your conclusions.\nProblem 4. Submit photocopies of your lab notebook pages documenting the construction of your\ndevice and demonstration that it works. Be sure to document any problems or irregularities that\nyou encountered.\nHarvard-MIT Division of Health Sciences and Technology\nHST.410J: Projects in Microscale Engineering for the Life Sciences, Spring 2007\nCourse Directors: Prof. Dennis Freeman, Prof. Martha Gray, and Prof. Alexander Aranyosi"
    },
    {
      "category": "Resource",
      "title": "hw2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-410j-projects-in-microscale-engineering-for-the-life-sciences-spring-2007/74acc0eacaf1363d61a2481cf9c8ee9d_hw2.pdf",
      "content": "Massachusetts Institute of Technology\nHarvard-MIT Division of Health Sciences and Technology and\nDepartment of Electrical Engineering and Computer Science\nHST.410J/6.07J\nProjects in Microscale Engineering for the Life Sciences\nHomework Assignment #2\nIssued: February 15, 2007\nDue: February 27, 2007\nDesign an experiment to test some hypothesis about transport through cellular membranes using\nmicrofluidics. You and your partner can choose any topic you find interesting. Examples of good\nhypotheses include the following:\n- Osmosis. Doubling the osmolarity of the extracellular solution by adding a large impermeant\nmolecule (such as polyethylene glycol (PEG)) will make a cell shrink by a factor of two.\n- Permeability of ionic species. Cell membranes are more permeant to potassium ions than\nto sodium ions.\n- Osmosis is colligative. Adding the same molar volume of two different sugars (e.g., glucose\nand sucrose) will cause the same amount of cell shrinking.\n- Concurrent diffusion and osmosis. Adding a permeant solute (such as dimethylsulfoxide\n(DMSO)) will cause a cell to first shrink and then swell back to its original volume.\n- Cell viability. Dead cells will have smaller osmotic responses than live cells.\n- Lysis. Adding a detergent (e.g., trisodium phosphate (TSP)) to the extracellular solution will\ndissolve the cell's membrane.\nYou may choose one of these hypotheses or develop your own original hypothesis. Design your\nexperiment and discuss your plan with the staff. After your idea is approved, do your experiment\nand collect data. Your homework assignment is to write a short report (three pages, which is\napproximately 3 × 350 words) plus supporting images and graphs. Also submit photocopies of\nyour lab notebook pages documenting your experiment.\nHarvard-MIT Division of Health Sciences and Technology\nHST.410J: Projects in Microscale Engineering for the Life Sciences, Spring 2007\nCourse Directors: Prof. Dennis Freeman, Prof. Martha Gray, and Prof. Alexander Aranyosi"
    },
    {
      "category": "Resource",
      "title": "hw3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-410j-projects-in-microscale-engineering-for-the-life-sciences-spring-2007/7a6c07516b482b1afc6d7ae1999c4509_hw3.pdf",
      "content": "Massachusetts Institute of Technology\nHarvard-MIT Division of Health Sciences and Technology and\nDepartment of Electrical Engineering and Computer Science\nHST.410J/6.07J\nProjects in Microscale Engineering for the Life Sciences\nHomework Assignment #3\nIssued: February 27, 2007\nDue: March 6, 2007\nMeasure the diffusivity of a dye. Focus in Tuesday's lab on designing the experiment and getting\nexperimental results (images). On Thursday, we will help you to analyze your data. Your home\nwork assignment is to write a short report (three pages, which is approximately 3×350 words) plus\nsupporting images and graphs. Also submit photocopies of your lab notebook pages documenting\nyour experiment.\nHarvard-MIT Division of Health Sciences and Technology\nHST.410J: Projects in Microscale Engineering for the Life Sciences, Spring 2007\nCourse Directors: Prof. Dennis Freeman, Prof. Martha Gray, and Prof. Alexander Aranyosi"
    },
    {
      "category": "Resource",
      "title": "hw4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-410j-projects-in-microscale-engineering-for-the-life-sciences-spring-2007/d4a54b90378d50c0b279885e68f5c528_hw4.pdf",
      "content": "Massachusetts Institute of Technology\nHarvard-MIT Division of Health Sciences and Technology and\nDepartment of Electrical Engineering and Computer Science\nHST.410J/6.07J\nProjects in Microscale Engineering for the Life Sciences\nHomework Assignment #4\nIssued: March 6, 2007\nDue: March 13, 2007\nFor this week's homework, please read the Rodriguez paper that is posted on our website\n(http://umech.mit.edu/6.07J/index.php in the Handouts section). Write short para\ngraphs addressing each of the following issues (which we will also discuss in class on March 8):\n1. Discuss the strengths of the microchip counter for counting CD4 cells over previous tech\nniques. What are its weaknesses? Is this technique a useful application of micro-scale\nengineering? Why or why not?\n2. Does the microchip counter work as effectively as previous cytometry techniques mentioned\nby the authors? What evidence do the authors present to show that the microchip counter\nworks effectively? Are you convinced by their arguments?\n3. What aspects of the CD4 counting system could be improved in your opinion (e.g., the\noptical techniques used, the fluid delivery system, etc.)?\n4. If the authors are correct in their assertion that this novel device may reduce costs of HIV\nmonitoring by more than ten-fold, then is this microfluidics device going to have a dramatic\nimpact in helping save lives in the fight against HIV/AIDS? Why or why not? What else\nneeds to be done to get this device into widespread clinical use?\n5. One concern in developing diagnostic tools is the rate of false-positives (the test returns\na positive result although the patient is disease-free) and false-negatives (the test returns a\nnegative result although the patient has the disease). If we take flow cytometry as the \"gold\nstandard\", what are the rates of false-positives and false-negatives for this new technique?\nHow would you establish a threshold CD4 count to maximize the effectiveness of treatment?\nHarvard-MIT Division of Health Sciences and Technology\nHST.410J: Projects in Microscale Engineering for the Life Sciences, Spring 2007\nCourse Directors: Prof. Dennis Freeman, Prof. Martha Gray, and Prof. Alexander Aranyosi"
    },
    {
      "category": "Resource",
      "title": "hw5.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-410j-projects-in-microscale-engineering-for-the-life-sciences-spring-2007/ab08b8ccc1d7238725479e66b22f020d_hw5.pdf",
      "content": "Massachusetts Institute of Technology\nHarvard-MIT Division of Health Sciences and Technology and\nDepartment of Electrical Engineering and Computer Science\nHST.410J/6.07J\nHomework Assignment #5\nIssued: March 15, 2007\nDue: April 5, 2007\nDetermine whether volume change of a cell depends on the isotonic volume.\nIn today's and next Tuesday's lab you will be trapping individual cells in a microfluidic de\nvice. Once the cells are trapped, you can change the perfusates to expose the cells to a variety of\nsolutions. You can then measure the volume change of the cells in each solution. For example,\nyou can dilute PBS with DI water to measure swelling as a function of ionic strength (swelling\nshould increase as ionic strength is lowered). Your homework assignment is to compare individ\nual cells to determine whether the volume change in these various solutions depends on the initial\n(isotonic) volume of the cell. Write a short report (three pages plus supporting images and graphs)\nto document your findings.\nHarvard-MIT Division of Health Sciences and Technology\nHST.410J: Projects in Microscale Engineering for the Life Sciences, Spring 2007\nCourse Directors: Prof. Dennis Freeman, Prof. Martha Gray, and Prof. Alexander Aranyosi"
    },
    {
      "category": "Resource",
      "title": "casting_masters.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-410j-projects-in-microscale-engineering-for-the-life-sciences-spring-2007/6242ad4d671a536beac25fc4176ad848_casting_masters.pdf",
      "content": "Casting Masters\nMasters for casting microfluidic channels are typically made from thin silicon wafers,\nand are quite fragile. Moreover, masters tend to lose their patterns over time, and are\ndifficult to modify to make variations on a single design. Here we demonstrate a\ntechnique for using an existing master to create a new master out of plastic. This new\nmaster is sturdy and can be easily modified (e.g., with wax or modeling clay). Moreover,\nmultiple plastic masters can be made from a single silicon mapster, allowing each group\nof students in the class to have their own master.\nThe first step is to use the silicon master to cast a PDMS device such as the one shown\nbelow (link goes to larger image). In this case, metal cylinders were used during casting\nto create holes for inserting the plastic cylinders.\n\nRather than bonding the device to a glass slide as shown in the above image, though, the\ndevice is placed in the bottom of a plastic tray channel-side up. A quick-hardening plastic\nis poured over the device and allowed to solidify. The plastic takes the complementary\nshape to the device; that is, it becomes a new master. The plastic can easily be separated\nHarvard-MIT Division of Health Sciences and Technology\nHST.410J: Projects in Microscale Engineering for the Life Sciences, Spring 2007\nCourse Directors: Prof. Dennis Freeman, Prof. Martha Gray, and Prof. Alexander Aranyosi\n\nfrom the PDMS device; however, it is more difficult to separate it from the other plastic,\nso a separate plastic container typically has to be used for each cast.\n\nThe resulting master is sturdy, can be used many times without loss of resolution, and can\neasily be modified. The images below show two variations of a single design, one which\ncreates holes for inserting plastic cylinders and one which does not.\n\nA slightly different technique is shown below. First, a small (roughly 5\" x 3\") container is\nfilled with white plastic and allowed to harden. This plastic is then placed in the center of\na larger container, such as the blue one shown below. More white plastic is poured\naround the existing cast, but to a lower level, so that a mold like the one shown below is\ncreated.\n\nThis mold is then used to create a PDMS container, such as the one shown below. The\nplastic mold can be saved and used to make a large number of PDMS casts.\n\nFinally, a microfluidic channel can be placed in the center of the PDMS container,\nchannel-side up. Plastic can then be poured into the container and allowed to harden. The\nresulting plastic mold can then be used to cast a large number of PDMS devices identical\nto the one placed into the center of the container. Also, since the plastic and PDMS are\neasily separable, the PDMS device and container can be used to make multiple plastic\nmasters."
    },
    {
      "category": "Resource",
      "title": "casting_pdms.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-410j-projects-in-microscale-engineering-for-the-life-sciences-spring-2007/5679db749fa4bcd2d7c8b798f177fd29_casting_pdms.pdf",
      "content": "Casting PDMS\nWhen we cast microfluidic devices in PDMS, we are dealing with structures that have\nvery small feature sizes. In this class, the feature sizes are on the order of 25-50\nmicrometers, but many microfluidic devices have even smaller features. To ensure that\nour devices have the correct structures, it is important to have a thoroughly clean master.\nThe first step in this process is washing the master. After getting the master wet, it should\nbe cleaned with soap and then rinsed in tap water (note: this applies to the plastic masters\nonly; silicon masters must be treated more gently).\n\nAfter washing the master, it should go through several rinse stages. First, rinse it with\ndeionized (DI) water. This removes residue left behind by the tap water.\nHarvard-MIT Division of Health Sciences and Technology\nHST.410J: Projects in Microscale Engineering for the Life Sciences, Spring 2007\nCourse Directors: Prof. Dennis Freeman, Prof. Martha Gray, and Prof. Alexander Aranyosi\n\nNext, it should be rinsed with isopropyl alcohol. This step picks up oils and other debris\nthat can affect the casting.\n\nThe master should then quickly be dried with pressurized air, either from an air canister\nas shown here or from a central air pump.\n\nFinally, the dry master should be placed on a flat surface and covered with packing tape.\nMake sure not to touch the sticky side of the tape before it contacts the master! The\npacking tape picks up any dust, PDMS, or other residue that is still stuck to the master.\nMake sure to press down on the tape to make sure it contacts the important parts of the\nmaster (i.e., where the channels are). Lift off the tape when you're ready to pour the\nPDMS.\n\nWhen pouring PDMS, it is important to try to minimize the formation of air bubbles. If\nyou have too many air bubbles, you may need to de-gas the master before baking the\nPDMS. One way to minimize the formation of air bubbles is to pour the PDMS as close\nto the master as possible. The image below shows an example of how to pour. The PDMS\nshould flow out of the cup onto the device, rather than drop.\n\nWhen you are done pouring, the entire device should be covered in PDMS, as shown\nbelow.\n\nAfter the PDMS is poured, carefully place the master into the oven. Be careful not to spill\nany PDMS while you are moving the master! The image below shows what you should\nNOT do: do not place the master directly on the cooking rack! Instead, place it in a\nsecondary container, such as a teflon pan. That way, any PDMS that spills out of the\nmaster will be caught by the pan.\n\nThe PDMS needs to bake for at least an hour before it is hardened. Preferably it should\nbake for two hours or more. The oven should be set to 150 degrees F, on convection\nmode. The image below shows the proper oven settings for a one-hour bake."
    },
    {
      "category": "Resource",
      "title": "coulter_counter.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-410j-projects-in-microscale-engineering-for-the-life-sciences-spring-2007/1158f5bde3608359fbecb15b4dff1fc0_coulter_counter.pdf",
      "content": "Coulter Counter\nA Coulter counter is a device for counting individual cells. Cells are made to flow\nthrough a short, narrow channel while the resistance of the channel is measured. Because\nthe cell blocks part of the channel, the resistance will increase while the cell is in the\nchannel. This transient change can be used not only to count cells, but to estimate their\nsize. The channel cross-sectional area needs to be small enough that the cell blocks a\nsignificant fraction of it. Moreover, the channel needs to be short for two reasons. First,\nso that the portion of the channel length blocked by the cell contributes significantly to\nthe overall resistance. Second, so that only one cell is likely to be in the channel at a\ngiven time. Here we show two simple techniques for making a Coulter counter.\nThe first technique uses an existing microchannel design. A plastic master is made from a\nportion of a microchannel, as shown in the image below. The center channel in this\nmaster has cross-sectional dimensions of 50x75 micrometers.\nHarvard-MIT Division of Health Sciences and Technology\nHST.410J: Projects in Microscale Engineering for the Life Sciences, Spring 2007\nCourse Directors: Prof. Dennis Freeman, Prof. Martha Gray, and Prof. Alexander Aranyosi\n\nThis master is used to make a PDMS mold. We wish to take a thin section of this mold in\norder to get a short channel. The sectioning is done with a chopping tool as shown below.\nThe length of the resulting channel slice is less than one millimeter.\n\nThis short PDMS slice is then bonded to a glass slide, channel-side down. Fluid placed\non one side of the slice is carried through the channel by capillarity. The resistance across\nthe channel can be measured by placing electrodes into fluid droplets on either side of the\nchannel. The image below shows the PDMS slice with droplets of green fluid on either\nside. A bright line in the center of the device is the channel; green fluid has started to\nenter the channel from the right-hand side. The dark line below is a shadow of the\nchannel that has been projected through the underlying glass slide."
    },
    {
      "category": "Resource",
      "title": "filling_devices.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-410j-projects-in-microscale-engineering-for-the-life-sciences-spring-2007/e19081284fcc482aed0e0fa83bb3767c_filling_devices.pdf",
      "content": "Filling Microfluidic Devices\nThere's an art to filling microfluidic devices. It's easy to create air bubbles that limit or\neliminate the functionality of the device. With a bit of care and some patience, though, it\nis possible to fill the devices fully with fluid. The process is to introduce fluid into one\nopening and allow capillary action to \"suck\" the fluid through the rest of the device. The\ndevice below has five connections; we are going to add fluid through the leftmost one.\n\nFirst, we place a small droplet of deionized (DI) water over the hole. This ensures that\nwhen we insert the fluid-filled pipette tip, we do not push air into the channel.\nHarvard-MIT Division of Health Sciences and Technology\nHST.410J: Projects in Microscale Engineering for the Life Sciences, Spring 2007\nCourse Directors: Prof. Dennis Freeman, Prof. Martha Gray, and Prof. Alexander Aranyosi\n\nNext, we insert a pipette tip filled with DI water into the hole. Make sure that the pipette\ntip does not contain any air bubbles, particularly at the tip. In this photo, the device is\nalready partially filled with fluid. Note the fluid boundary in the large channel near the\nlower-left corner of the device.\n\nFinally, we wait until fulid fills the entire device. In the image below, fluid has reached\nfour of the five openings. Once the fluid reaches an opening, it will start to form a water\nbubble above the hole. At this point, add some more water and insert a pipette filled with\nwater. This will have two effects. First, it will guarantee that the opening will continue to\nbe full of fluid. Second, if you fill the pipette the water pressure will keep more fluid\nfrom flowing out of that opening, helping the rest of the device to fill more quickly.\n\nThe device below is a battery-powered pipetter, which can be used to help fluid move\nthrough the device more quickly. However, it should be used with great care, since you\ncan easily ruin a device with one of these. Applying positive pressure at the input\ncontaining fluid can help push the fluid through the device more quickly. However, the\npositive pressure can also break the bond between the PDMS and the class, causing fluid\nto leak out of the device. In the process of making these images I did exactly that to the\ndevice shown, which is why there is no image of a completely filled device here.\nApplying negative pressure at one of the air-filled openings can also help bring fluid\ntoward that opening. However, this can have the unintended effect of creating air bubbles\nelsewhere in the device (e.g., near the other openings). If you find it necessary to use this\npipetter, be sure to check with an instructor, and use it only on the lowest setting."
    },
    {
      "category": "Resource",
      "title": "fluid_reservoirs.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-410j-projects-in-microscale-engineering-for-the-life-sciences-spring-2007/11564106018fa0a83ed39b43e1639f76_fluid_reservoirs.pdf",
      "content": "Fluid Reservoirs\nOne of the key challenges with using microfluidic devices is getting fluids into and out of\nthem. Several techniques have been developed. One common method is to insert plastic\ntubing that is connected to a motorized pump, but this approach is expensive and can be\nchallenging to master. Here we will show several simple techniques.\nThe first technique is to punch small holes into the device before bonding, and insert\npipette tips filled with fluid into these holes. The image below shows a device with five\nholes punched into it to act as inlets and outlets. To insert a pipette, first a droplet of\nwater is placed over the hole to guarantee that no air bubbles are introduced into the\ndevice.\nHarvard-MIT Division of Health Sciences and Technology\nHST.410J: Projects in Microscale Engineering for the Life Sciences, Spring 2007\nCourse Directors: Prof. Dennis Freeman, Prof. Martha Gray, and Prof. Alexander Aranyosi\nNext, a pipette tip filled with fluid is inserted into the hole. The pipette tip must not\ncontain any air bubbles. One advantage of this technique is simplicity; it is relatively easy\n\nto punch holes into PDMS, and pipette tips are plentiful. Another advantage is that it is\neasy to switch solutions. Simply place a drop of fluid around the base of the pipette tip,\nplace your thumb over the back of it to keep the fluid in, and pull it out of the device.\nThen simply insert a pipette tip containing the new fluid to be perfused through the\ndevice. One disadvantage is that it can be tricky to control the fluid height, which\ndetermines how fast fluid flows through the device. Another disadvantage is that the\nPDMS can tear when punching holes, causing fluid to leak out of the tear rather than flow\ninto the device.\n\nA second approach is to use cylinders from syringes as the reservoir, as shown in the\nimage below. This technique has the advantage of being mechanically stable, and the\nreservoirs can be cut to any height necessary. In addition fluids can easily be exchanged\nby pipetting them into and out of the reservoirs. Also, this approach has a built-in o-ring\nto prevent leaks (described below). It has the disadvantage of being more difficult to\nfabricate. In addition, cells and debris tend to collect at the bottom of the reservoir,\nclogging the device.\n\nTo fabricate devices using this technique, we first start with a device containing no inlets\nour outlets, as shown here.\n\nWe then place cylindrical plastic devices at each location where we would like to insert a\nsyringe cylinder. These plastic devices were cast from capacitors that have an indented\nring near the bottom. In the final device, this ring is filled with PDMS; since it is smaller\nthan the syringe cylinder, it acts as an o-ring to hold the cylinder in place.\n\nA third technique is to cast reservoirs out of PDMS. This technique has all of the\nadvantages of the cylinder method, and can be tapered at the bottom to prevent clogging.\nIt has the disadvantage of requiring another casting and bonding step. First, tapered\ncylinders like the one shown below are cast to form a mold.\n\nThis mold is then used to create a plastic negative. The plastic negative is used to cast the\nreservoirs in PDMS.\n\nSince the bottom surface will be bonded to a PDMS device, it must be smooth. To ensure\nsmoothness, a glass chamber is built out of microscope slides to surround the plastic\nmold. PDMS is then poured into this chamber to cast the reservoirs. The resulting\nreservoirs have smooth, optically clear surfaces."
    },
    {
      "category": "Resource",
      "title": "manuf_pdms.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-410j-projects-in-microscale-engineering-for-the-life-sciences-spring-2007/a8ccf98b4a870a05112f4143c5146c0a_manuf_pdms.pdf",
      "content": "Manufacturing a PDMS microfluidic\ndevice via a Silicon Wafer Master\nEric Lam, Tri Ngo\nAbstract\n\nThis document describes the manufacturing process for a general microfluidic device\nwhich uses either pipette tips, O-Ring or non O-Ring syringe reservoirs as a fluid\ndelivery mechanism. The manufacturing process does not involve much labor but\nrequires a lot of waiting. The entire process takes a minimum of 5 hours but optimally the\nprocess takes 9 hours. First the PDMS is mixed and degassed for approximate 1 hour.\nThen the activated PDMS is poured onto the master and baked in an oven. After a\nminimum of 4 hours of baking, the PDMS is unmolded from the master and processed\nfurther. Next a glass slide is cleaned and the PDMS layer containing the microfluidic\nfeatures are bonded to the glass slide. Finally the device is completed by attaching either\npipette tips or pre-cut syringe tubes.\nMixing the PDMS\nIn preparation for this stage obtain a some unpowdered disposable gloves, a disposable\nplastic knife and a disposable plastic cup.\nPDMS should be mixed in a 1:10 ratio of curing agent and PDMS monomers. The PDMS\nmonomers are much more viscous than the curing agents. For this example\nimplementation, we will be using a mixture which consists of 7g of curing agent and 70g\nof monomer.\nHarvard-MIT Division of Health Sciences and Technology\nHST.410J: Projects in Microscale Engineering for the Life Sciences, Spring 2007\nCourse Directors: Prof. Dennis Freeman, Prof. Martha Gray, and Prof. Alexander Aranyosi\n\nThe PDMS can be mixed in a disposable plastic cup, not unlike the cups found near water\ncoolers. Wider cups may be better because they expose a larger surface of the contained\nfluid to air, which will aid in degassing the PDMS later.\nWhile PDMS is very safe, it is a sticky and messy substance to work with. You should\nput on some disposable gloves before touching the containers or tools which come into\ncontact with uncured PDMS. Use unpowered gloves to prevent contaminating the PDMS.\nAt this stage, you should not be too concerned with dust or other particles falling into the\nPDMS, they will be absorbed into the bulk of the device and will usually not affect the\nchannels. However, powdered gloves should not be used the unmolding and bonding\nstages of fabrication.\nTurn on the electronic scale and adjust the device so that it reads the correct units, in this\ncase we adjust it to read in grams. Place the cup on the scale, and press the \"Tare\" button\nto rezero the scale.\n\nSlowly pour 70g of PDMS (base) monomer into the cup.\n\nPress the Tare button to rezero the scale. Then pour approximately 1/10 the amount of\nPDMS curing agent into the cup (7g), for a total mass of 77g for the entire mixture. You\nwill not notice any immediate visible reactions when these two fluids come in contact. In\nactuality, the order in which the curing agent and PDMS base is added to the cup is not\nimportant since they will thoroughly be mixed anyway.\n\nTake the cup off the scale and begin to stir the PDMS mixture using the disposable\nplastic knife. Stir the mixture for approximately 3 minutes. A large stopwatch is useful\nfor keeping time. In general, any stiff disposable rod can be used to stir the mixture and a\nplastic knife is low cost and works well. After the 3 minutes of stirring the mixture will\nhave many air bubbles. These bubbles must be removed before the PDMS can be used to\nmake a device. Throw away the knife, it is no longer needed.\n\nDegassing the PDMS\nTo degas the PDMS, we expose the mixture to a vacuum. The vacuum causes the bubbles\nin the PDMS mixture to expand and rise to the surface where they pop. Although, the\nprecise amount of time needed to fully degas the mixture will depend on the amount of\nPDMS being mixed and the width of the cup, 1 hour is a good estimate. However, most\nof this time is spent just waiting for the process to complete.\n\nA desiccator connected to a vacuum line is used to apply a vacuum to the PDMS mixture.\nFirst place the plastic cup containing the mixture into a larger, heavier container, such as\na Pyrex beaker or an aluminum foil boat. The larger container will catch any PDMS that\nspills out of the plastic cup during the degassing process and will keep the plastic cup\nfrom being knocked over when the vacuum is released. Place both the cup and its\ncontainer into the desiccator. Multiple cups of PDMS can be degassed simultaneously as\nlong as there is enough room inside the desiccator.\n\nClose the lid of the dessicator and adjust the vaccuum valve on the dessicator to connect\nthe vaccuum line.\nNow turn on a relatively weak vacuum by opening the valve on the vacuum line by only\na few turns. A vacuum that is too strong causes the PDMS to actually boil over the side\nof the cup. Leave the PDMS in the vacuum for 1-2 hours. The PDMS is ready to be taken\nout of the vacuum when there are nearly no bubbles in the liquid. Release the vacuum\nvalve on the desiccator slowly since the sudden rush of air may knock over the cup. A\nfew small bubbles are acceptable because they will float to the top when making the\ndevice. Do not leave the PDMS in the vacuum for too long because it will become more\nviscous and will prevent bubbles from rising to the surface when the PDMS is poured\ninto the mold.\nPouring the PDMS\nOnce the PDMS has been degassed, remove it from the desiccator and place the cup\ncontaining it on a lab bench with plenty of space to work with. The pattern for the PDMS\ndevice is created by pouring the liquid PDMS onto a surface containing the negative of\nthe pattern and then allowing the PDMS to harden. The solid PDMS now contains the\ndesired pattern of channels and can be bonded to a glass slide or a slab of PDMS to seal\nthe channels. In this project the pattern has been created using SU-8 that has been layered\nonto a silicon wafer. The SU-8 has been developed by exposing it to a UV light image of\nthe desired pattern. The sections of the SU-8 that were not exposed to UV light are\nremoved leaving a negative mold for the device. The wafer containing the pattern is\ncoated with a thin layer of silane to make it easier to peel the solidified PDMS from the\nwafer. The completed wafer is known as a \"master\" for creating the PDMS device.\nDeveloping masters using silicon wafers allows the use of standard microfabrication\ntechniques which provide for excellent resolution and pattern quality. The disadvantage is\nthat the wafers take a long time to create and require the use of special clean room\nfacilities. Additionally the wafers are very fragile and a small crack will easily propagate\nthroughout the entire wafer.\n\nDue to the fragile nature of silicon wafers, the masters are usually stored in a special box\ndesigned to hold wafers. The PDMS will be poured onto these wafers but we will need to\ncreate a container to prevent the PDMS from dripping off the sides of the wafer. To\ncreate this container we will create an aluminum foil \"boat\" around the wafer. It is best to\nuse thin regular aluminum foil, not heavy duty, because it will be easier to remove the\naluminum foil from the PDMS later.\n\nTear a sheet of aluminum foil that is large enough to hold the wafer with at least an\nadditional 2 inches of clearance on all sides. Place the sheet on the lab bench near the\nstored wafers and the degassed PDMS. While wearing gloves, gently take the silicon\nmaster out of its storage box and center the master on the foil with the pattern face up.\nNow, gently, fold the edges of the foil up around the master and crimp the foil around the\nedge of the wafer with the intent of sealing the underside of the wafer from contact with\nPDMS. The foil should also form a wall around the wafer, preventing the PDMS from\nrunning off the wafer.\n\nIf the device requires O-Ring reservoir fittings, the O-Ring mold must be placed on the\nwafer before pouring the PDMS onto the master. the O-Ring mold consists of an array of\ncapacitors glued onto a a glass slide. Holding the mold with the glass slide on top and the\ncapacitors on bottom, gently align the capacitors with the array of reservoir pads on the\nwafer.\n\nPour the PDMS on one edge of the wafer and as low as possible to prevent the creation of\nnew air bubbles. The PDMS will eventually flow to a uniform height over the wafer.\nSome air bubbles will form on the surface of the wafer, especially near the turns of the\nserpentine channels. These small bubbles will float up to the surface after about 5\nminutes. Bubbles on the surface of the PDMS will not affect the device's performance\nand will usually burst during the curing process. Dust and other small particles in the\nPDMS also will usually not affect the device's performance because they will be trapped\nin the bulk of the device. If pipette tips or non O-Ring reservoirs will be used as the\ndelivery mechanism for the device, no additionally work is needed and the aluminum\nboat containing the PDMS and wafer can be placed in the 60 degree Celsius curing oven.\nIf the device uses O-Rings, you may notice some bubbles under the capacitors. These\nbubbles can be extracted by placing the entire wafer with PDMS into the vacuum\ndesiccator for a few minutes before placing the wafer into the oven.\n\nOther researchers may be baking PDMS so remember to write your name and the time\nyou placed the PDMS into the oven on the board nearby. The curing process takes a\nminimum of 4 hours but optimally the PDMS should be left in the oven overnight for 8\nhours.\nPDMS Unmolding\n\nRemember to be very gentle with the wafer throughout the unmolding process. Most\nmaster breakages occur during this step. While wearing gloves, take the wafer out of the\noven and place it on the lab bench. Wait a few minutes for the wafer to cool. To it easier\nto handle the wafer, remove the excess aluminum foil around the edges of the wafer.\n\nNow use a small knife, i.e. an exactoknife, to completely remove the foil on the bottom of\nthe wafer.\n\nNow with the wafer again flat on the table, slide the knife's tip in between the wafer and\nthe PDMS at the edge of the wafer. Slide the knife around the circumference of the wafer\nseparating the PDMS from the wafer at the edges. Continue to unmold more of the\nPDMS by inserting the knife deeper but being careful not to touch the SU-8 pattern on\nthe wafer. Continue to use the knife to move the unmolded \"front\" to the edge of the\npattern.\n\nAt this point use your hands to grip the PDMS and slowly peel it away from the wafer.\n\nIf the device uses O-Ring molds, these must be gently pried off the surface of the wafer\nalong with the surrounding PDMS. You can pry the O-Ring mold off by tilting the glass\nslide gently causing the capacitors to separate from the wafer. Do this slowly as this\nprocess can place a lot of stress on the wafer. Place the peeled off PDMS on the lab\nbench with the side containing the channels face up.\n\nNow place the wafer into its protective box.\n\nIf we are making O-Ring devices we must remove the O-Ring mold from the PDMS.\nGenerally, we wish to avoid touching the side of the PDMS containing the channels\nbecause this surface will be bonded to glass and any oil on our gloves may affect the\nquality of the bonding. However, an exception can be made if we are making O-Ring\ndevices because it is very difficult to properly remove the O-Ring mold without touching\nthis surface. Loosen the capacitors from the surrounding PDMS using your fingers until\nthey are finally completely removed. It is very easy to crack the PDMS around the\ncapacitors during this procedure. The crack will create a leak which will usually cause the\ndevice to fail because the reservoir will be unable to deliver fluid properly.\nPost Processing of PDMS device\n\nAfter the O-Ring mold is removed, there may still be a thin film of PDMS left over. This\nthin film will prevent the reservoir from feeding the delivery channel. Using a small knife,\ni.e. exactoknife, remove the film to bring the large reservoir in contact with the tiny\ndelivery channel.\nAfter the O-Ring mold has been removed or if the device uses pipettes or non-O-Ring\nreservoirs, take a box cutter and cut out the devices from the PDMS. If we are making O-\nRing devices no additional post processing is required.\n\nFor pipette tip style devices, a hole must be punched on the delivery channels to interface\nwith the pipette. Place the device with the channel surface face up on a slab of PDMS to\nprevent the cutting edge of the hole puncher from dulling. The hole puncher consists of a\nlarge needle with an inner diameter of about 2mm and a rod to remove the PDMS inside\nthe needle. Insert the needle perpendicular to the surface of the device into the delivery\nchannel about 5mm away from the junction between the delivery channel and the large\ncircular reservoir pad.\n\nPush the needle completely through the device and use the thin rod to punch out the\nPDMS inside the needle before removing the the needle. For non O-Ring reservoir\ndevices, place PDMS on a Teflon block and use a number 6 cork borer to punch a hold\nwhere the reservoir pads are located. Again try to punch the hole perpendicular to the\ndevice.\n\nOnce the necessary holes have been created, completely cover the side of the device\ncontaining the channels with scotch tape. Use an excess amount of tape because it will be\npeeled away later when the device is bonded to glass. The tape serves the dual purpose of\nprevent dust from accumulating on the bonding surface as well as removing the debris of\nthe hole punching process from the surface. At this point the devices can be stored for\nbonding later.\nSlide Cleaning\nThe channels of the device can be closed by bonding a glass slide to the surface\ncontaining the channels. To ensure a good bond and to prevent small particles from\nclogging the channels, the glass slides are cleaned prior to bonding. Only the side of the\nslide to be bonded needs to be cleaned but as it is sometimes difficult to know which side\nof the slide is which, both sides can be washed just in case. Gloves should be worn\nthroughout the cleaning process to prevent skin oils from transferring onto the slides.\n\nFirst the slides are rinsed under running water. Then clean the surface using dish\ndetergent and rinse the soap off completely. Next rinse the surface with distilled water.\nFinally rinse the surface with isopropyl alcohol.\nDry off the isopropyl alcohol completely using the nitrogen gun. The cleaned glass slides\nshould be stored in a petri dish to prevent dust in the air from accumulating on them.\nDevice Bonding\n\nThe cleaned glass slide will be bonded to the PDMS device using a plasma bonder. Inside\nthe plasma bonder, the bonding surfaces of the slide and the PDMS device are subjected\nto high energy plasma which strips away electrons on the surface. This causes the\nsurfaces to become hydrophilic. When these two hydrophilic surfaces come into contact\nthey form a strong bond. In this project a plasma is created from air but a stronger bond\nmay be created if a pure oxygen plasma is used instead.\nTake the PDMS device and peel off the protective tape. Now use this tape to remove any\nparticles on the bonding surface. Pay extra care to remove particles around the fluid\ndelivery holes as these may clog the channels if they enter the device.\n\nOnce the surface is clean place the PDMS on a glass slide with the bonding surface face\nup and place the slide and PDMS into the plasma bonder. Take the cleaned glass slide\nand place it on another glass slide, again with the bonding surface face up and put both\ninto the plasma bonder.\nClose the door and close the venting valve on the door. Turn on the vacuum and switch\non the RF generator but leave the dial for the RF strength in the off position. Wait 3\nminutes to ensure a good vacuum is created in the chamber.\n\nThen gently turn the dial controlling the RF strength to its maximum power. The venting\nvalve may need to be opened very slightly to allow more air into the plasma. Look into\nthe chamber via the window on the door to know how much to adjust the venting valve.\nThe plasma in the chamber should be a bright pink color. Too much air in the chamber\nwill prevent the plasma from forming, and too little will produce a weak plasma. Expose\nthe device and glass slide to the plasma for 50 secs to one minute. This duration was\nfound optimal for the bonding process and shorter or longer durations may result in a\nweaker bond.\n\nSwitch off the RF generator, vacuum pump and turn the RF dial to the off position. The\nsurfaces quickly become less hydrophilic when exposed to air so try to bond the glass and\nPDMS as quickly possible. Open the venting valve to release the vacuum in the chamber.\n\nAfter opening the chamber door, take the glass slide and place it on the table with the\nbonding surface upwards. Now take the PDMS device, flip it over and place it on top of\nthe glass slide so that the two bonding surfaces contact. You should be able to see the\nbonding process occur. Apply gentle pressure to the regions of the device that have\ndifficulty bonding. After 5 minutes the device should be finished bonding.\n\nThe device should be filled immediately with distilled water after the bonding process.\nAfter bonding, the channels are still very hydrophilic and makes it very easy to fill. Place\na bead of water in one of the reservoir or punched pipette holes. You should be able to\nsee the water from the single delivery channel fill the entire device.\nAttaching Pipettes or Syringe Reservoirs\n\nTo complete a pipette tip device, pipette tips are inserted into the small punched holes.\nTry not to introduce air bubbles into the device throughout this process. Air bubbles will\nimpede or block flow and are sometimes difficult to remove. Use a micro-pipette to fill a\n1000 ml pipette tip with approximately 600 ml of distilled water. Place a bead of water\non one of the device's input pipette holes. Using the micro-pipette, insert the pipette tip\ninto the hole ensuring that no air is in the tip of the pipette. Finally, release the pipette\nfrom the micro-pipette leaving the pipette implanted in the device.\n\nRepeat this process for the other pipette inputs. The residual liquid from the initial bead\nof water can be wiped away using a kimwipe or some other low lint material. Pipette tips\nfor the outputs can simply be inserted into the hole since fluid will be entering the outputs.\n\nFor the reservoir type devices, precut syringe tubes are inserted into the reservoir holes.\nWhen you insert the syringe tubes, be very careful not to crack the PDMS around the\nreservoir holes. These cracks can easily propagate through the PDMS and cause a leak."
    },
    {
      "category": "Resource",
      "title": "plasma_bonding.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-410j-projects-in-microscale-engineering-for-the-life-sciences-spring-2007/5cf5de07db02fb929701ac9db699a961_plasma_bonding.pdf",
      "content": "Plasma Bonding\nMicrofluidic devices made from PDMS typically need to be bonded to a glass slide\nbefore being used. The bonding process creates a tight seal between the PDMS and the\nglass, so that fluids and cells remain confined to the channel. This process is facilitated\nby a technique known as plasma bonding. In essence, exposing both bonding surfaces to\nan oxygen plasma makes them extremely clean, which facilitates the bonding process.\nThe oxygen plasma is generated by a plasma cleaner like the one shown below. The\nplasma bonder we will be using in class looks somewhat different, but has the same\nfunctionality.\n\nThe first step in plasma bonding is to make any needed holes in your PDMS (i.e., fluid\ninlets and outlets). Next, make sure your device is reasonably clean and dry. If it is dirty\n(e.g. from fingerprints), wash it with soap and water and allow it to air-dry. You can\nspeed up the drying process with compressed air if desired; don't use paper towels, which\nwill leave fibrous residue on the PDMS.\nPlace your device, bonding side up, on a glass slide covered in transparent tape. The tape\nkeeps the device from sticking to this slide. Place the glass slide to which you plan to\nbond the device on another tape-covered slide. Insert both slides into the chamber of the\nplasma bonder, as shown in the image below.\nHarvard-MIT Division of Health Sciences and Technology\nHST.410J: Projects in Microscale Engineering for the Life Sciences, Spring 2007\nCourse Directors: Prof. Dennis Freeman, Prof. Martha Gray, and Prof. Alexander Aranyosi\n\nClose the chamber door, close the release valve (the picture below shows the device with\nthe release valve closed; compare it to the first picture above). Flip both switches to the\n\"On\" position, but do not turn up the RF level yet.\n\nThe vacuum pump has two indicators that tell you when the vacuum is ready. First, a\nlight on the pump itself turns from yellow to green. Second, the vacuum gauge shows that\nthe pressure drops to about 65 mbar (i.e., 65/1000 of atmospheric pressure) and stabilizes\nthere. At this point you can turn the RF signal on to the highest setting. When you do so,\nyou should see a purple glow coming from the inside of the chamber.\n\nThe purple glow indicates that the RF coil is working. At this point we need to add\nenough oxygen to generate the plasma, while being careful not to release the vacuum\nentirely. To do this, open the release valve on the door very slightly. When it is opened\njuts enough, the plasma will turn from a purple to a pink color. If you open it too far, the\nplasma will disappear entirely. Allow the devices to sit in the plasma for a full minute.\nAfter one minute, turn the RF signal off, shut off the pump, and release the vacuum by\nopening the release valve fully.\n\nTake your devices out of the chamber, being careful to handle only the tape-covered\nslides. You must bond your devices within 60 seconds of shutting off the plasma. To\nbond the devices, simply bring the two cleaned surfaces into contact. You can do this by\nplacing the PDMS on the glass slide or vice-versa, whichever you find easier. You should\nbe able to see the PDMS device seal itself against the glass slide. You might need to\napply pressure in some locations to ensure a good seal. Be sure not to apply too much\npressure where your channels are, or you may cause them to collapse."
    },
    {
      "category": "Lecture Notes",
      "title": "lec01.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-410j-projects-in-microscale-engineering-for-the-life-sciences-spring-2007/4c553d06a916d1c412893f554eee33e7_lec01.pdf",
      "content": "Microscale Engineering\nElectronics\nMedicine and Biology\nImages removed due to copyright restrictions.\nrevised March 5, 2007\nHST.410J/6.07J Calendar\nIntroductory Exercises\nProjects\n(weeks 1-7)\n(weeks 8-14)\nTuesday\nThursday\nTuesday\nThursday\n2/6\n2/8\n4/3\n4/5\nProject Proposal\nHomework #6\nL1\nL2\nDue\nL14\nDue\nL15\nMicrofluidics\nMicrofabrication\nProjects\nProjects\n2/13\n2/15\n4/10\n4/12\nL3\nL4\nL16\nL17\nCells and\nMembranes\nCells and Membranes\nProjects\nProjects\n2/20\n2/22\n4/17\n4/19\nHomework #1\nDue\nL5\nL18\nModels of Diffusion &\nk\nPatriot's Day\nHST.410J/6.07J\nLecture 1\nFebruary 6, 2007\nProjects in Microscale Engineering for the Life Sciences\nHST.410J / 6.07J\nStaff:\nDenny Freeman\nMartha Gray\nAJ Aranyosi\nJanice Balzer (secretary)\nWeb site:\nhttp://umech.mit.edu/6.07J/index.html\nNo Lecture / No Lab\nCell Experiment\nHomework #2\nDue\n2/27\nL6\nLaminar Flow\n3/1\nL7\nusing Matlab\nData Analysis\n\nHomework #3\nDue\n3/6\nL8\nResearch Applications\n3/8\nL9\nPaper Discussion\nResearch\n\nHomework #4\nDue\n3/13\nL10\nResearch Applications\n3/15\nL11\nCell Traps\nHomework #5\nDue\n3/20\nL12\nL13\n3/22\nCell Traps\nStatistics\nSpring Wee\nNo Lecture / Lab\nProjects\n4/24\nL19\nProjects\n4/26\nL20\nTechnical Writing\nDROP DATE\nand Oral Presentation\n5/1\nL21\nProjects\n5/3\nL22\nFirst Drafts\nDue\nProjects\nL23\nProject Presentation\n5/8\nDry Runs\nL24\nProject Presentation\n5/10\nDry Runs\nL25\nProject\n5/15\nPresentations\nL26\nProject\n5/17\nPresentations\nHarvard-MIT Division of Health Sciences and Technology\nHST.410J: Projects in Microscale Engineering for the Life Sciences, Spring 2007\nCourse Directors: Prof. Dennis Freeman, Prof. Martha Gray, and Prof. Alexander Aranyosi\n\nImage removed due to copyright restrictions.\nJohnson Hou MIT PhD thesis, 2007\n\nMicro/Nano Fluidics\ncell\ninduced\ndipole\nelectric field\nelectrodes\n+\n-\nDirection of DNA electrophoresis\nJongYoon Han\nJoel Voldman\nCourtesy of JongYoon Han. Used with permission.\nCourtesy of Joel Voldman. Used with permission.\nCourtesy of Joel Voldman. Used with permission.\n\ninfo.123456.txt\n14:32:56.935655 GMT (52376.935655 sec)\nRGB Values for Row 215\nx_value R\nG\nB\n\n000 141 173 178\n001 142 174 179\n002 142 174 179\n003 141 173 178\n004 141 173 179\n005 142 174 180\n006 141 173 179\n007 141 173 179\n008 139 175 180\n009 139 175 180\n010 139 175 180\n011 139 175 180\n...\n637 137 161 143\n638 138 162 144\n639 138 162 144\n\nRGB Values for Column 447\ny_value R\nG\nB\n\n000 133 125 095\n001 136 126 094\n002 135 131 096\n003 136 131 092\n004 136 129 103\n005 136 130 101\n006 137 130 104\n007 144 133 106\n008 149 137 108\n009 149 143 112\n010 149 143 112\n011 148 136 107\n...\n477 134 132 128\n478 133 133 124\n479 141 136 125\n\nimage.123456.bmp"
    },
    {
      "category": "Lecture Notes",
      "title": "lec02.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-410j-projects-in-microscale-engineering-for-the-life-sciences-spring-2007/8d94d3e504cefec05ee46cfcd1b4083c_lec02.pdf",
      "content": "HST.410J/6.07J\nLecture 2\nFebruary 8, 2007\nHarvard-MIT Division of Health Sciences and Technology\nHST.410J: Projects in Microscale Engineering for the Life Sciences, Spring 2007\nCourse Directors: Prof. Dennis Freeman, Prof. Martha Gray, and Prof. Alexander Aranyosi\n\ninfo.123456.txt\nimage.123456.bmp\n14:32:56.935655 GMT (52376.935655 sec)\nRGB Values for Row 215\nx_value\nR\nG\nB\n\n000 141 173 178\n001 142 174 179\n002 142 174 179\n003 141 173 178\n004 141 173 179\n005 142 174 180\n006 141 173 179\n007 141 173 179\n008 139 175 180\n009 139 175 180\n010 139 175 180\n011 139 175 180\n...\n637 137 161 143\n638 138 162 144\n639 138 162 144\n\nRGB Values for Column 447\ny_value\nR\nG\nB\n\n000 133 125 095\n001 136 126 094\n002 135 131 096\n003 136 131 092\n004 136 129 103\n005 136 130 101\n006 137 130 104\n007 144 133 106\n008 149 137 108\n009 149 143 112\n010 149 143 112\n011 148 136 107\n...\n477 134 132 128\n478 133 133 124\n479 141 136 125"
    },
    {
      "category": "Lecture Notes",
      "title": "lec03.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-410j-projects-in-microscale-engineering-for-the-life-sciences-spring-2007/5b448e11f22b9a357dc0cd2058860453_lec03.pdf",
      "content": "Harvard-MIT Division of Health Sciences and Technology\nHST.410J: Projects in Microscale Engineering for the Life Sciences, Spring 2007\nCourse Directors: Prof. Dennis Freeman, Prof. Martha Gray, and Prof. Alexander Aranyosi\nHST.410J/6.021J\nLecture 3\nFebruary 13, 2007\nEscherichia Coli (E. Coli)\nCulture Medium\nImage removed due to copyright restrictions.\nPhotograph of an E. coli cell.\nNH4Cl\nMgSO4\nKH2PO4\nNa2HPO4\nGlucose\nWater\n1.0 g\n0.13 g\n3.0 g\n6.0 g\n4.0 g\n1.0 L\nGeneric Eukaryotic Animal Cell\nCulture Medium\nEssential Amino Acids\n(a dozen)\nVitamins (eight)\nImage removed due to copyright restrictions.\nSalts (Na+, K+, Ca2+, Mg2+,\nCl-, PO43-, HCO -\n3 )\nGlucose\nSerum\nFigure from Weiss, T. F. Cellular Biophysics,\nVol. I. Cambridge, MA: MIT Press, 1996.\nCourtesy of MIT Press. Used with permission.\nAir\nCO2\nFood, water\nWaste\nRespiratory system\nCirculatory\nCells\nsystem\nDigestive system\nInputs to Organism\nInputs to Cells\n- air\n- oxygen\n- water\n- water\n- food\n- ions\n- carbohydrates\n- building block molecules\n- fats\n- sugars\n- proteins\n- lipids\n- amino acids\n\nImages removed due to copyright restrictions.\nImages of inside an intestinal tract and an endothelial cell.\n- 800 g food + 1.2 L water ingested daily\n- 1.5 L saliva\n- 2 L gastric secretions\n- 0.5 L bile 7 L digestive fluids\n- 1.5 L pancreatic secretions\n- 1.5 L intestinal secretions\n\n15 pounds of water (10% of body weight)\nsecreted and reabsorbed daily\nSalivary\nglands\nPharynx\nEsophagus\nTrachea\nStomach\nLiver\nPancreas\nSmall\nintestine\nLarge\nintestine\nRectum\nAnus\nWater transport in digestive system\nDaily traffic\n\nFigure from Weiss, T. F. Cellular Biophysics,\nVol. I. Cambridge, MA: MIT Press, 1996.\nCourtesy of MIT Press. Used with permission.\n\nApical (mucosal)\nJunctional\nMicrovilli\ncomplex\nsurface\nLateral\nsurface\nIntercellular\nBasal (serosal)\nTranscellular Paracellular transport through\nsurface\ntransport\ntransport\ngap junctions\nlipid\nbilayer\ncell\nmembrane\n7 nm\nFigure from Weiss, T. F. Cellular Biophysics,\nVol. I. Cambridge, MA: MIT Press, 1996.\nCourtesy of MIT Press. Used with permission.\nConcentration at a point\nin space and time\nvolume V\namount of substance in V\nconcentration c(x,t) = lim\nV →0\nV\n\nFlux at a point\nin space and time\nwindow\narea A\nφ(x,t)\namount of substance flowing\nflux φ(x,t) = lim\nA →0\nthrough test window A in Δt\nAΔt\nΔt→0\nFick's First Law\nCH2OH\nCH2OH\nCH2OH\nC\nO\nC\nO\nC\nH\nOH\nH\nH\nH\nH\nH\nH\nC\nC\nC\nC\nC\nOH\nH\nOH\nH\nOH\nOH\nOH\nH\nOH\nOH\nFigure from Weiss, T. F. Cellular Biophysics,\nVol. I. Cambridge, MA: MIT Press, 1996.\nCourtesy of MIT Press. Used with permission.\nO\nH\nC\nOH\nOH\nC\nC\nC\nC\nC\nC\nH\nOH\nH\nOH\nH\nH\nD-glucose\nD-mannose\nD-galactose\nFigure from Weiss, T. F. Cellular Biophysics,\nVol. I. Cambridge, MA: MIT Press, 1996.\nCourtesy of MIT Press. Used with permission.\n\nCH2OH\nCH2OH\nC\nO\nO\nC\nH\nH\nH\nH\nFigure from Weiss, T. F. Cellular Biophysics,\nH\nH\nC\nC\nC\nC\nVol. I. Cambridge, MA: MIT Press, 1996.\nOH\nH\nH\nOH\nCourtesy of MIT Press. Used with permission.\nOH\nOH\nOH\nOH\nC\nC\nC\nC\nH\nOH\nOH\nH\nD-glucose\nL-glucose\nintegral\nmembrane solute\nlipid\nbilayer\nprotein\nmembrane\n7 nm\ncell\n-2\n-1\nHydrophobicity\n-3\n-4\nFigure from Weiss, T. F. Cellular Biophysics,\nVol. I. Cambridge, MA: MIT Press, 1996.\nCourtesy of MIT Press. Used with permission.\nResidue position\n\nHydrophobic\nHydrophilic\nOutside\nInside\nNH2\nCOOH\nFigures from Weiss, T. F. Cellular Biophysics,\nVol. I. Cambridge, MA: MIT Press, 1996.\nCourtesy of MIT Press. Used with permission.\nImage removed due to copyright restrictions.\nPlease see figure 5 in Mueckler, Mike, and Carol Makepeace. \"Cysteine-scanning Mutagenesis and Substituted Cysteine\nAccessibility Analysis of Transmembrane Segment 4 of the Glut1 Glucose Transporter.\" J Biol Chem 280 (2005): 39562-39568.\n\nPumps\nADP + P\nATP\n2 K+\n3 Na+\nInside\nMembrane\nOutside\nintegral\nmembrane\nlipid\ncell\nmembrane\n7 nm\npore\nbilayer\nprotein\n\nY. Jiang, A. Lee, J. Chen, V. Ruta, M. Cadene, B. Chalt, and R. MacKinnon (2003),\nNature 423:33-41.\nImages removed due to copyright restrictions.\n\nDissolution Transport\nTransport\nCarrier-\nPumps\nIntracellular\nExtracellular\nMembrane\nand diffusion\nthrough\nlipid bilayer\nthrough\nwater\nchannels\nthrough\ngated ion\nchannels\nmediated\ntransport\nFigure from Weiss, T. F. Cellular Biophysics,\nVol. I. Cambridge, MA: MIT Press, 1996.\nCourtesy of MIT Press. Used with permission."
    },
    {
      "category": "Lecture Notes",
      "title": "lec04.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-410j-projects-in-microscale-engineering-for-the-life-sciences-spring-2007/ebec55e8748d6d0935ecbd86caf982a1_lec04.pdf",
      "content": "Harvard-MIT Division of Health Sciences and Technology\nHST410J: Projects in Microscale Engineering for the Life Sciences, Spring 2007\nCourse Directors: Prof. Dennis Freeman, Prof. Martha Gray, and Prof. Alexander Aranyosi\nHST.410J16.021 J\nLecture 4\nFebruary 15, 2007\nDissolution Transport\nTransport\nPumps\nand diffusion through\nFigure from Weiss, T. F. Cellular Biophysics,\nthrough\nwater\nlipid bilayer\nchannels\nVol. I. Cambridge, MA: MIT Press, 1996.\nIntracellular\nCourtesy of MIT Press. Used with permission.\nMembrane A\nU\nExtracellular\nlipid\nbilayer\nI\nI\nFigure from Weiss, T. F. Cellular Biophysics,\n\"\"Ir\nVol. I. Cambridge, MA: MIT Press, 1996.\nCourtesy of MIT Press. Used with permission.\n-\n0.01 ~\n,\n,\n, : ,\n,\n,\n,\n\nTime (h)\nTime (h)\n\nVial 1\nVial 2\nVial 3\nVial 4\nVial N\nCells loaded\nwith solute n\n.\n0 . - . --\"\n,-\nFlow tube\n,It\nSolution free\nof solute n\nSampling chambers\nu u u u u\nFigures from Weiss, T. F. Cellular Biophysics,\nVol.I. Cambridge, MA: MIT Press, 1996.\nCourtesy of MIT Press. Used with permission.\n0.05 1,\nTime (ms)\n\nintegral\nmembrane solute\nlipid\nprotein \\ f\nbilayer I\nmembrane\nFigure from Weiss, T. F. Cellular Biophysics,\nVol.I. Cambridge, MA: MIT Press, 1996.\nCourtesy of MIT Press. Used with permission.\nTime (minutes)\nImage removed due to copyright restrictions.\nIllustration of a water channel in a cell membrane\n\nWater transport in digestive system\nDaily trafflc\n800 g food + 1.2 L water ingested daily\n.1.5 L saliva\n2 L gastric secretions\n.0.5 L bile\nI\n7 L digestive fluids\n1.5 L pancreatic secretions\n.1.5 L intestinal secretions\nFigure from Weiss, T. F. Cellular Biophysics,\n15 pounds ofwater (10% of body weight)\nancrear\nsecreted and reabsorbed daily\nF'o'ol. I. Cambridge, MA: MIT Press, 1996.\nCourtesy of MIT Press. Used with permission.\nOsmosis Observations\nHenri Dutrochet(early 1800s)\n.first described phenomenon and called it osmosis\n.developed first osmometer: animal bladder filled\nwith test solution, plunge into water, swlls, turgid\n.pressure greater for solutions Vvlth more solute\nwater\nWllhelm Pfeffer (mid 1800s)\n.osmosis can be stopped with hydraulic pressure\n.thistle tube + animal bladder (or artificial membrane by late 1800s)\n- water flows in direction to equalize sugar concentration\n- hydraulic pressure develops\n- flow stops vvtlen osmotic pressure = hydraulic pressure\n.pressure proportionalto concentration of solute\n.pressure increasesslightly Vvlth temperature\nThistle\nWater\n\nHenricus van't Hoff (1886)\n.formulated mathematical law\n.count number of particles in volumeV\n.measure temperatureT\n.\nosmotic pressure = pressure produced by gas with same\nnumber of particles, same volume, and same pressure\nvan't Hoff's Law\n\"/\\-\npressure\nconcentration\nmolar gar\n'\n8.314 Jl(mo1.K)\n.salts are different\nSvante Arrhenius (1 884)\n.PhD (age 25): dissolution of salts into ions\n.NaCl + Na+ + C I (;.\nconducts electricity)\n.count ions as separate particles\n+ van' t Hoff s law works for salts as well\nosmdic\npressure\n[ P a = N l m 2 ]\n-\nArbacia eggs\nFigure from Weiss, T. F. Cellular Biophysics,\nVol.I. Cambridge, MA: MIT Press, 1996.\nCourtesy of MIT Press. Used with permission.\nI\nI\nI\nI\n\nTune (minutes)\nTune (minutes)\nTime (mrnutes)\nFigure from Weiss, T. F. Cellular Biophysics,\nVol.I. Cambridge, MA: MIT Press, 1996.\nCourtesy of MIT Press. Used with permission."
    },
    {
      "category": "Lecture Notes",
      "title": "lec05.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-410j-projects-in-microscale-engineering-for-the-life-sciences-spring-2007/9d755ac510007590a323b4a4d0cd1e18_lec05.pdf",
      "content": "HST.410J/6.07J\nLecture 5\nFebruary 22, 2007\nConcentration at a point\nin space and time\nvolume V\namount of substance in V\nconcentration c(x,t) = lim\nV →0\nV\nFlux at a point\nin space and time\nwindow\narea A\nφ(x,t)\namount of substance flowing\nflux φ(x,t) = lim\nA →0\nthrough test window A in Δt\nAΔt\nΔt→0\nFick's First Law\nHarvard-MIT Division of Health Sciences and Technology\nHST.410J: Projects in Microscale Engineering for the Life Sciences, Spring 2007\nCourse Directors: Prof. Dennis Freeman, Prof. Martha Gray, and Prof. Alexander Aranyosi\nFigure from Weiss, T. F. Cellular Biophysics,\nVol. I. Cambridge, MA: MIT Press, 1996.\nCourtesy of MIT Press. Used with permission.\n\nx\nl\n2l\n3l\n+3\n+2\n+1\n-1\n-2\n-3\nm\nn\nF\nV\nC\nRandom Walk Model\n- number of solute particles << number of solvent particles\n- motion of solute determined by collisions with solvent\n(ignore solute-solute interactions)\n- focus on 1 solute particle, assume motions of others\nare statistically identical\nEvery τ seconds, solute particle gets hit by solvent particle.\nIn response, solute particle is equally likely to move +l or -l.\nτ = mean free time; l = mean free path\n0.2\n0.4\n0.6\n0.8\n0.2\n0.4\n0.6\n0.8\n-7 -5 -3 -1\nW(m,n)\nm\nn\nigures from Weiss, T. F. Cellular Biophysics,\nol. I. Cambridge, MA: MIT Press, 1996.\nourtesy of MIT Press. Used with permission.\n\nFick's First Law\nHow long till half the solute diffuses to |x|>x1/2\nx1/2\n2Dt\n~<\n2Dt\n~> x1/2\n~>\nx1/2\n2Dt\nx1/2\nD\n~>\n≡ t1/2\nt\nImportance of Scale\nx1/2\ncm2\n=\n; D = 10-5\nfor small solutes (e.g., Na+)\nt1/2\nD\ns\nt1/2\nx1/2\nmembrane sized\n10 nm\nμsec\ncell sized\n10 μm\n1 sec\ndime sized\n10 mm\n105 sec ≈ 1 day\nFigure from Weiss, T. F. Cellular Biophysics,\nVol. I. Cambridge, MA: MIT Press, 1996.\nCourtesy of MIT Press. Used with permission.\n-3\n-2\n-1\n50%\n68%\n95%\n99%\nc(x,t) =\nno\n4πDt e-x2/(4Dt)\nx\n2Dt"
    },
    {
      "category": "Lecture Notes",
      "title": "lec06.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-410j-projects-in-microscale-engineering-for-the-life-sciences-spring-2007/20be466cfc2110f159cb10f7690b40a8_lec06.pdf",
      "content": "HST.410J/6.021J\nLecture 6\nFebruary 27, 2007\n- number of solute particles << number of solvent particles\n- motion of solute determined by collisions with solvent\n(ignore solute-solute interactions)\n- focus on 1 solute particle, assume motions of others\nare statistically identical\nEvery τ seconds, solute particle gets hit by solvent particle.\nIn response, solute particle is equally likely to move +l or -l.\nτ = mean free time; l = mean free path\nx\nl\n2l\n3l\nRandom Walk Model\n0.2\n0.4\n0.6\n0.8\n0.2\n0.4\n0.6\n0.8\n-7 -5 -3 -1\nW(m,n)\nm\nn\nFigure from Weiss, T. F. Cellular Biophysics,\nVol. I. Cambridge, MA: MIT Press, 1996.\nCourtesy of MIT Press. Used with permission.\nHarvard-MIT Division of Health Sciences and Technology\nHST.410J: Projects in Microscale Engineering for the Life Sciences, Spring 2007\nCourse Directors: Prof. Dennis Freeman, Prof. Martha Gray, and Prof. Alexander Aranyosi\nFigure from Weiss, T. F. Cellular Biophysics,\nVol. I. Cambridge, MA: MIT Press, 1996.\nCourtesy of MIT Press. Used with permission.\n\n-3\n-2\n-1\nx\n50%\n68%\n95%\n99%\n\n-3\n-2\n-1\nx\n50%\n68%\n95%\n99%\n\nApply Fick's law to dye demonstration\ninitially\ndye\nno dye\nc(x,t=0)\nFind c(x,t) for t>0\nφ(x,t=0)\nx\nFick's law:\n\n∂ c(x,t)\nφ(x,t) = - D\n∂ x\n- provides information about time \"t\" only\n- need new information to get from time \"t\" to time \"t+Δt\"\nc(x,t)\nIf there is net flux out of a region,\nthen the concentration in that region must fall.\nIf there is net flux into a region,\nφ(x,t)\nthen the concentration in that region must rise.\n→ conservation of solute\nx\n\n_\n_\n_\n_\nContinuity Equation\nc(x+Δx,t)\nx\nx+Δx\nvolume AΔx\narea A\narea A\nφ(x,t)\nφ(x+Δx,t)\nx\nx+Δx\nAmount of solute entering\nChange in amount of solute\nthrough edges during (t,t+Δt)\nin volume from t to t+Δt\nleft\nright\ntime 2\ntime 1\nφ(x,t+Δ\nt) A Δt - φ(x+Δx,t+Δ\nt) A Δt = c(x+Δ\nx,t+Δt) A Δx - c(x+Δ\nx,t) A Δx\nequal if solute is neither created nor destroyed\nφ(x,t+Δ_\nt) -φ(x+Δx,t+Δ_\nt)\nc(x+Δ_\nx,t+Δt) - c(x+Δ_\nx,t)\n=\nΔx\nΔt\nTake limit as Δx→0 and Δt→0\n∂φ(x,t)\n∂ c(x,t)\n-\n=\n∂ x\n∂ t\n\nImportance of Scale\n=\nx1/2\n; D = 10-5 cm2\nfor small solutes (e.g., Na+)\nt1/2\nD\ns\nt1/2\nx1/2\nmembrane sized\n10 nm\nμsec\ncell sized\n10 μm\ndime sized\n10 mm\n105 sec ≈ 1 day\nsec"
    },
    {
      "category": "Lecture Notes",
      "title": "lec07.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-410j-projects-in-microscale-engineering-for-the-life-sciences-spring-2007/8e36a3ef647861b98b3a5ab54b2a7ccd_lec07.pdf",
      "content": "Useful Matlab Examples\nBasic Math\nAddition: 2 + 3\nDivision (using previous answer): ans/4\nExponentiation: 31 ^ 4\nTrig functions: log(100); sin(90 pi/180)\nVectors\nAssigning values: x = [0 : 1 : 5]; x = [7.5 : 2 : 33]\nTaking a subset of the vector: x(2 : 5)\nAssigning a single value: x(4) = x(3) + pi\nFlipping between row and column vectors: x0\nReversing a row vector: flipdim(x, 2)\nSquaring individual elements: y = x. ^ 2\nMatrices\nAssignment: x = [1 2 3 ; 3 1 2 ; 2 3 1]; x(2, 2) = 6\nMath: x/4\nExponentiation: x. ^ 2\nMatrix multiplication: x ^ 2\nExtracting vectors: x(1, :); x(:, 1)\nPlotting\n2D plots: plot(x, y)\nTurn on/off plot overlays: hold off; hold on\n3D plots: image(x); surf(x); mesh(x)\nHarvard-MIT Division of Health Sciences and Technology\nHST.410J: Projects in Microscale Engineering for the Life Sciences, Spring 2007\nCourse Directors: Prof. Dennis Freeman, Prof. Martha Gray, and Prof. Alexander Aranyosi\n\nScripting\nCreate a file with the name of your script, ending in .m; e.g., meanvar.m:\nfunction [meanval,varval] = meanvar(data)\n% Computes the mean and variance of values in the data array\nmeanval = mean(data);\nvarval = var(data);\nImages\nReading an image: a0 = imread(0c : image.bmp0,0 bmp0);\nDisplaying an image: image(a0)\nAssigning a subset of one color: b0 = a0(1 : 445, 240 : 420, 2);\nData Fitting\nErf function: y = (erf((x - mean)/stdev) + 1) range/2 + offset\nComputing error of fit: err = sum((double(b0(200, :)) - y). ^ 2)\nMinimizing an error function with respect to one variable:\nq = fminsearch(@(x) sqerferr(x, b0(200, :)), x0)\nLoops\nLooping across all rows of an array:\nfori = 1 : size(b0, 1)\nq = fminsearch(@(x) sqerferr(x, b0(i, :)), x0);\nstdev0(i) = q(2);\nend"
    },
    {
      "category": "Lecture Notes",
      "title": "lec08.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-410j-projects-in-microscale-engineering-for-the-life-sciences-spring-2007/b2d5a8eed55d89c078d5167f98cd4e1a_lec08.pdf",
      "content": "Harvard-MIT Division of Health Sciences and Technology\nHST.410J: Projects in Microscale Engineering for the Life Sciences, Spring 2007\nCourse Directors: Prof. Dennis Freeman, Prof. Martha Gray, and Prof. Alexander Aranyosi\nHST.410J/6.07J\nLecture 8\nMarch 6, 2007\nImages removed due to copyright restrictions.\nPlease see figures 2 and 6 in Li, Xiujun, and Paul C. H. Li. \"Microfluidic selection and retention of a single cardiac myocyte, on-chip dye\nloading, cell contraction by chemical stimulation, and quantitative fluorescent analysis of intracellular calcium.\" Analytical Chemistry 77\n(2005): 4315-4322.\nCourtesy of Joel Voldman. Used with permission.\n\nCourtesy of Joel Voldman. Used with permission.\nCourtesy of National Academy of Sciences, U.S.A. Used with permission. Source: Saleh, Omar A., and Lydia L. Sohn. \"Direct Detection of\nAntibody-Antigen Binding using an On-chip Artificial Pore.\" PNAS 100 (2003): 820-824. Copyright 2003 National Academy of Sciences, U.S.A.\n\nCourtesy of National Academy of Sciences, U.S.A. Used with permission. Source: Saleh, Omar A., and Lydia L. Sohn. \"Direct Detection of\nAntibody-Antigen Binding using an On-chip Artificial Pore.\" PNAS 100 (2003): 820-824. Copyright 2003 National Academy of Sciences, U.S.A.\nImage removed due to copyright restrictions.\nPlease see figure 1 in Jeon, et al. \"Neutrophil Chemotaxis in Linear and Complex Gradients of Interleukin-8 formed in a Microfabricated Device.\"\nNature Biotechnology 20 (2002): 826-830.\nImage removed due to copyright restrictions.\nPlease see figure 2 in Jeon, et al. \"Neutrophil Chemotaxis in Linear and Complex Gradients of Interleukin-8 formed in a Microfabricated Device.\"\nNature Biotechnology 20 (2002): 826-830.\n\nImage removed due to copyright restrictions.\nPlease see figure 3 in Jeon, et al. \"Neutrophil Chemotaxis in Linear and Complex Gradients of Interleukin-8 formed in a Microfabricated Device.\"\nNature Biotechnology 20 (2002): 826-830.\nJohnson Hou MIT PhD thesis, 2007\n\nImages removed due to copyright restrictions.\nFigures from Wang, Y.-C., A. L. Stevens, and J. Han. \"Million-fold Preconcentration of Proteins and Peptides by Nanofluidic Filter.\"\nAnalytical Chemistry 77 (2005): 4293-4299."
    },
    {
      "category": "Lecture Notes",
      "title": "lec11.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-410j-projects-in-microscale-engineering-for-the-life-sciences-spring-2007/f7d087c8e819cb783eaad6422cc79e53_lec11.pdf",
      "content": "Harvard-MIT Division of Health Sciences and Technology\nHST.410J: Projects in Microscale Engineering for the Life Sciences, Spring 2007\nCourse Directors: Prof. Dennis Freeman, Prof. Martha Gray, and Prof. Alexander Aranyosi"
    },
    {
      "category": "Resource",
      "title": "rodriguez_plos05.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-410j-projects-in-microscale-engineering-for-the-life-sciences-spring-2007/e920ea0b0ce5f5376d910f78aa655174_rodriguez_plos05.pdf",
      "content": "A Microchip CD4 Counting Method for HIV\nMonitoring in Resource-Poor Settings\n1,2,3*\nWilliam R. Rodriguez\n, Nicolaos Christodoulides , Pierre N. Floriano , Susan Graham , Sanghamitra Mohanty ,\nMeredith Dixon , Mina Hsiang , Trevor Peter , Shabnam Zavahir , Ibou Thior , Dwight Romanovicz , Bruce Bernard ,\n1,2\n4*\nAdrian P. Goodey , Bruce D. Walker\n, John T. McDevitt\n1 Partners AIDS Research Center, Massachusetts General Hospital, Charlestown, Massachusetts, United States of America, 2 Division of AIDS, Harvard Medical School, Boston,\nMassachusetts, United States of America, 3 Brigham and Women's Hospital, Boston, Massachusetts, United States of America, 4 Department of Chemistry and Biochemistry,\nUniversity of Texas, Austin, Texas, United States of America, 5 Botswana-Harvard AIDS Institute Partnership, Princess Marina Hospital, Gaborone, Botswana\nCompeting Interests: WRR, NC,\nPNF, BDW, and JTM have applied for\na patent for the application de-\nscribed here.\nAuthor Contributions: WRR, NC, PF,\nSG, BDW, and JTM designed the\nstudy. WRR, NC, PNF, SG, MD, SM, ST,\nIB, TP, MH, DR, BB, APG, BDW, and\nJTM collected and analyzed the data.\nWRR, BDW, NC, PNF, and JTM\nprepared the manuscript.\nAcademic Editor: Zvi Bentwich,\nRosetta Genomics, Israel\nCitation: Rodriguez WR, Christo-\ndoulides N, Floriano PN, Graham S,\nMohanty S, et al. (2005) A microchip\nCD4 counting method for HIV mon-\nitoring in resource-poor settings.\nPLoS Med 2(7): e182.\nReceived: January 31, 2005\nAccepted: April 26, 2005\nPublished: July 19, 2005\nDOI:\n10.1371/journal.pmed.0020182\nCopyright: 2005 Rodriguez et al.\nThis is an open-access article\ndistributed under the terms of the\nCreative Commons Attribution\nLicense, which permits unrestricted\nuse, distribution, and reproduction\nin any medium, provided the\noriginal work is properly cited.\nAbbreviations: CCD, charge-\ncoupled device; ETC, electronic taste\nchip; PBS, phosphate buffered saline\n*To whom correspondence should\nbe addressed. E-mail: wrodriguez@\npartners.org (WRR), mcdevitt@mail.\nutexas.edu (JTM)\nA B S T R A C T\nBackground\nMore than 35 million people in developing countries are living with HIV infection. An\nenormous global effort is now underway to bring antiretroviral treatment to at least 3 million of\nthose infected. While drug prices have dropped considerably, the cost and technical complexity\nof laboratory tests essential for the management of HIV disease, such as CD4 cell counts,\nremain prohibitive. New, simple, and affordable methods for measuring CD4 cells that can be\nimplemented in resource-scarce settings are urgently needed.\nMethods and Findings\nHere we describe the development of a prototype for a simple, rapid, and affordable method\nfor counting CD4 lymphocytes. Microliter volumes of blood without further sample preparation\nare stained with fluorescent antibodies, captured on a membrane within a miniaturized flow\ncell and imaged through microscope optics with the type of charge-coupled device developed\nfor digital camera technology. An associated computer algorithm converts the raw digital\nimage into absolute CD4 counts and CD4 percentages in real time. The accuracy of this\nprototype system was validated through testing in the United States and Botswana, and\nshowed close agreement with standard flow cytometry (r 1⁄4 0.95) over a range of absolute CD4\ncounts, and the ability to discriminate clinically relevant CD4 count thresholds with high\nsensitivity and specificity.\nConclusion\nAdvances in the adaptation of new technologies to biomedical detection systems, such as\nthe one described here, promise to make complex diagnostics for HIV and other infectious\ndiseases a practical global reality.\nPLoS Medicine | www.plosmedicine.org\nJuly 2005 | Volume 2 | Issue 7 | e182\nOpen access, freely available online\nPLoS MEDICINE\nHarvard-MIT Division of Health Sciences and Technology\nHST.410J: Projects in Microscale Engineering for the Life Sciences, Spring 2007\nCourse Directors: Prof. Dennis Freeman, Prof. Martha Gray, and Prof. Alexander Aranyosi\n\n13]. Low-cost microbead separation of CD4 cells from other\nFluid Delivery System\nblood cells, followed by standard manual cell counting\nIn initial studies, we used a single peristaltic pump to\ntechniques using a light microscope, offers significantly lower\ndeliver sample and washes to the flow cell. Subsequently, a\nreagent costs than flow cytometry. These methods, however,\npartially automated fluid delivery system was developed. This\nare low throughput and extremely labor intensive, and\nfunctional adaptation uses two miniature OEM peristaltic\nappear to be less accurate than traditional flow cytometry;\npumps, each in conjunction with a pinch valve, and 0.031-in.\nthus, they have not been widely adopted [13-18].\n(0.79-mm) silicone tubing capable of delivering flow rates of\nLess expensive CD4 counting methods that capitalize on\n46-920 ll/min to the flow cell. Integrated software (LabVIEW,\nlow-cost microfabrication, efficient light sources, and afford-\nNational Instruments, Austin, Texas, United States) directs\nable microelectronics and digital imaging hardware have\ndelivery of whole blood samples and washes to the flow cell\nbeen conceptualized, but never realized [19,20]. One of us\nusing the appropriate pumps and valves. Sample filtrate,\n(JTM) has previously reported the development of a novel\nincluding red blood cells, is captured in a waste reservoir.\nmicrochip-based detection system for measuring analytes\nsuch as acids, bases, electrolytes, and proteins in solution\nOptical Station and Image Capture\nphase [21-23]. This electronic taste chip (ETC) system carries\nThe flow cell was positioned on the stage of a modified BX2\nout chemical and immunological reactions on microspheres\nOlympus (Tokyo, Japan) compound microscope equipped\npositioned in the inverted pyramidal microchamber wells of a\nwith a 103 objective lens and a high-pressure 100 W mercury\nsilicon or plastic microchip, which is housed in a miniature\nburner arc lamp as a light source. Focusing was maintained\nPLoS Medicine | www.plosmedicine.org\nJuly 2005 | Volume 2 | Issue 7 | e182\nMicrochip CD4 Counting\nIntroduction\nflow cell. Microfluidic channels deliver a series of small-\nvolume reagents and washes to the flow cell, and hence to the\nMore than 35 million HIV-infected people live in develop-\nchip and to each one of the microspheres. Optical signals\ning countries with significant resource limitations. Although\ngenerated by the reactions on the microspheres are visualized\n6 million people living in developing countries are in urgent\nand captured on a charge-coupled device (CCD) with the use\nneed of antiretroviral therapy, only 700,000 currently receive\nof transfer optics and a digital video chip. Using the ETC\neffective treatment [1]. Global treatment efforts, including\nsystem, complex immunological assays, such as the ones\nthe World Health Organization's ''3 by 5'' Initiative, aim to\ndeveloped to quantify cardiac risk factors in serum, can be\nextend therapy to several million people over the next few\nperformed with small sample volumes, short analysis times,\nyears [2]. While the cost of antiretroviral medications has\nand markedly reduced reagent costs [22].\ndropped considerably, other obstacles, including the cost,\nFurther development of the ETC system has shown that it\ntechnical, and operational requirements of CD4 counts, viral\ncould be adapted to the detection of bacteria, spores, and\nloads, and other sophisticated diagnostic tests used to initiate\nliving cells [24]. We hypothesized that additional modifica-\nand monitor HIV treatment, remain to be addressed.\ntions could be made to provide accurate, low-cost CD4 counts\nIn particular, measurements of CD4þ T lymphocytes are\nto monitor HIV infection in resource-constrained settings.\nessential for staging HIV-infected patients, determining their\nWe show that a microchip-based system can perform CD4\nneed for antiretroviral medications, and monitoring the\ncounts from 16.5 ll of whole blood rapidly, simply, and with a\ncourse of their infection [3]. The CD4 count--expressed in\nhigh degree of accuracy compared to flow cytometry,\nadults as the absolute number of CD4 cells per microliter of\nparticularly for patients with CD4 counts below 500 cells/ll.\nblood, and in children as a percentage of total lymphocytes or\nWe suggest how this prototype system can be readily\ntotal T lymphocytes--has enormous prognostic and thera-\ndeveloped as a low-cost, portable device for use in\npeutic implications, and forms the basis for most HIV\nresource-poor settings.\ntreatment decisions [4-6]. In developed countries, CD4\ncounts are typically performed every three to six months\nfor each patient using the method of flow cytometry. Flow\nMethods\ncytometers use lasers to excite fluorescent antibody probes\nFlow Cell\nspecific for CD4 and other cell surface markers, to distinguish\nThe ETC system was originally designed for microsphere-\none type of lymphocyte from another. Several factors--\nbased assays [21-23]. The modified version of the flow cell (see\nincluding the cost of a flow cytometer (which ranges from\nFigure 1) is enclosed within a three-piece metal casing with a\n$30,000 to $150,000), technical and operational complexity,\nflat platform permanently affixed to a circular vertical\nthe need for reliable electricity, and the high cost of\nsupport, which is in turn connected to a screw-on cap.\nreagents--have made these instruments impractical and/or\nWithin the metal casing there are top and bottom plastic\ndifficult to sustain in resource-scarce settings. The urgent\ninserts made from PMMA. Fluids are introduced to and\nneed for affordable and technically simple CD4 diagnostics is\ndrained out of the flow cell through integrated stainless steel\nwidely recognized [7-11].\ntubing within the inserts. The bottom PMMA insert also\nSeveral efforts have been made to develop alternative,\nfeatures a plastic screen disc that acts as a support for a 3-lm\naffordable CD4 counting methods for resource-poor settings.\nNuclepore polycarbonate, track-etch filter (Whatman, Flor-\nSingle-purpose flow cytometers have been designed solely for\nham Park, New Jersey, United States), which serves as a\ncounting CD4 cells, such as the Becton Dickinson FACS-\nlymphocyte capture and red blood cell separation membrane.\nCount, the Partec CyFlow, and desktop instruments from\nA gasket between the membrane and the top insert prevents\nGuava and PointCare Technologies. Although these newer\nleaks and ensures that the entire sample is delivered into the\nversions make flow cytometry more affordable in some\nflow cell and filtered through the membrane. The top outlet is\nsettings, reagent costs remain high, and the instruments\nused with lateral flow for the removal of air bubbles.\nremain expensive and in most cases, technically complex [7-\n\non a fixed plane throughout the duration of the assay.\nimage was the maximum object count over 256 iterations\nVisualization of AlexaFluor-647-stained lymphocytes was\n(upper intensity limits 1!255) for which the average object\nachieved using a Cy5 filter cube (620 nm excitation, 660 nm\nroundness fell below a threshold value. In this manner, the\nlong-pass beam splitter dichroic mirror, and 700 nm\nsoftware algorithm determined the optimal analysis param-\nemission), while AlexaFluor-488-stained lymphocytes were\neters for each image individually, greatly relaxing the\nvisualized with a fluoroisothiocyanate (FITC) filter cube (480\nstringency of image capture requirements. Cell counts were\nnm excitation, 505 nm long-pass beam splitter dichroic\nrecorded in a spreadsheet as numbers of CD4þCD3,\nmirror, and 535 6 25 nm emission). For each study\nCD4þCD3þ, CD4CD3þ, CD8þCD3, CD8þCD3þ, CD8CD3þ,\nparticipant, images were obtained from each of five non-\nand CD4þCD8þ cells, depending on the combination of\noverlapping regions of the lymphocyte capture membrane in\nantibodies used. Absolute CD4 counts were recorded as the\nthe flow cell, using a 12-bit CCD digital camera (DVC, Austin,\nsummed number of CD4þCD3þ cells counted over five images,\nTexas, United States) mounted on the microscope. Each\nnormalized per microliter of imaged blood. CD4:CD8 ratios\nimaged region represented 0.18 ll of whole blood, so that for\nwere recoded as the ratio of CD4þCD3þ cells to CD8þCD3þ\neach assay, cells were counted from a total volume of 0.9 ll of\ncells counted over five images. Relative CD4 abundance as a\nblood. Each region was imaged serially with both filter cubes.\npercentage of total T lymphocytes was recorded as 100 times\nThe corresponding images were stored separately as mono-\nthe ratio of CD4þCD3þ cells to total CD3þ cells, with cells\nchromatic eight-bit images for subsequent digital image\ncounted over five images.\nanalysis and automated cell counting.\nLymphocyte Staining and Delivery\nImage Analysis\nAntibodies utilized in these studies were stored at 4 8C and\nImages were analyzed using a custom algorithm supported\ncentrifuged to remove precipitated material prior to use.\nby Image-Pro Plus (Media Cybernetics, Silver Spring, Mary-\nThis process ensured removal of fluorescent particulate\nland, United States) processing software. An iterative ap-\nmatter that could be captured by the membrane and might\nproach allowed for flexible analysis of data acquired under\ninterfere with imaging. For the initial dilution control\ndifferent conditions of illumination, focus, and sampling. For\nstudies, CD4 cells were purified by immunomagnetic separa-\neach iteration, an upper and lower value defined a range of\ntion from donor buffy coats. CD4 cells labeled with\ngreen or red intensities that were then used to segment the\nAlexaFluor-488-conjugated anti-CD4 antibodies (A21335,\nimage. Pixels whose intensity values fell within the defined\nclone 289-14120, Molecular Probes, Eugene, Oregon, United\nrange were reassigned values of one, while all others were set\nStates) were introduced to the flow cell in amounts ranging\nto zero. The process yielded a binary version of the original\nfrom zero to 200,000 cells, and washed with phosphate\neight-bit image. A lymphocyte selection algorithm was then\nbuffered saline (PBS). For whole blood studies, 33 ll of whole\napplied. Objects (i.e., lymphocytes) were defined as contig-\nblood collected by venipuncture was incubated at ambient\nuous groups of pixels with values of one. Object selection was\ntemperature (20-25 8C) with 3 ll of AlexaFluor-488- and\nrefined by a lymphocyte profile (defined by size, aspect ratio,\nAlexaFluor-647-conjugated antibodies to CD4 and CD3\nand uniformity); objects not fitting the profile were not\n(A21332, clone 289-13801, Molecular Probes), respectively,\ncounted. The number of counted objects was recorded for\nand allowed to react for 8 min. Similarly, for CD8\neach iteration. From one iteration to the next, the upper and\nenumeration, 33 ll of whole blood with 3 ll of AlexaFluor-\nlower intensity limits used to segment the image were both\n488- and AlexaFluor-647-conjugated antibodies to CD8\nincreased by a single intensity count. The final cell count per\n(A21340, clone 289-13804, Molecular Probes) and CD3,\nPLoS Medicine | www.plosmedicine.org\nJuly 2005 | Volume 2 | Issue 7 | e182\nMicrochip CD4 Counting\nFigure 1. Components of the ETC System\nA fluid delivery system is used to introduce sample containing fluorescently stained lymphocytes in whole blood and wash buffer to a capture flow cell.\nLymphocytes captured within the flow cell are visualized with a fluorescence imaging station using a mercury pressure lamp as a light source, and a\nCCD for image collection. Raw data images are then processed and analyzed using an automated algorithm run by an attached computer. The flow cell\nincludes a polymer membrane supported on a chip and two transparent polymethylmethacrylate inserts that allow for the optical evaluation of\ncaptured lymphocytes.\nDOI: 10.1371/journal.pmed.0020182.g001\n\nStatistical Methods\nWe next quantified the percentages of CD3, CD4, and CD8\nThe accuracy of the microchip-based CD4 counting system\ncells in whole blood samples from healthy control partic-\nwas determined by comparing results directly to parallel\nipants using this system. Prior to delivery to the flow cell, we\nsamples processed by flow cytometry using Passing-Bablok\nlabeled a 33-ll whole blood sample with 3 ll of fluorophore-\nregression analysis and the Bland-Altman methods compar-\nconjugated anti-CD3 and anti-CD4 antibodies for 8 min off\nisons approach [25,26]. For assay reproducibility, a coefficient\nchip, then diluted the sample with 961 ll of PBS, and\nof variance was calculated from 20 replicates of a single\ndelivered 500 ll of the resulting sample (containing 16.5 ll of\nparticipant. Data were analyzed and processed using Analyse-\nblood) to the flow cell using a fluidics controller. Digital\nIt software (Analyse-It Software, Leeds, United Kingdom).\nimages from one region of the lymphocyte capture mem-\nbrane were obtained with two different emission filters, one\nspecific for the AlexaFluor-488-conjugated antibody used to\nResults\nstain CD4þ T lymphocytes green (Figure 4A), and the other\nIn initial experiments using the original ETC system [21-\nspecific for the AlexaFluor-647-conjugated antibody used to\n23], microspheres were coated with monoclonal antibodies to\nstain CD3þ T lymphocytes red (Figure 4B). Automated digital\nthe lymphocyte surface markers CD3, CD4, or CD8, followed\nmerging of the two images and image processing allowed the\nby microfluidic delivery of fluorescently labeled lymphocytes\nsystem to distinguish the CD3þCD4þ T lymphocytes of\nfrom whole blood obtained from non-HIV-infected partic-\ninterest (i.e., ''CD4 cells''), which appear yellow, from the\nPLoS Medicine | www.plosmedicine.org\nJuly 2005 | Volume 2 | Issue 7 | e182\nMicrochip CD4 Counting\nrespectively, was allowed to react for 8 min at ambient\nipants. Although lymphocytes were readily captured, precise\ntemperature. Stained blood samples were brought up to 1,000\nquantification of cell numbers and CD4 cell counts were not\nll with PBS, half of which was introduced directly into the\npossible using the microsphere as a surface for lymphocyte\nflow cell (representing 16.5 ll of the original sample of blood)\ncapture (data not shown). We next modified the flow cells\nand then washed with 1 ml of PBS. Because red blood cells are\nwith a disposable, microporous membrane filter for lympho-\nmechanically separated from white blood cells, red blood cell\ncyte capture. A single polycarbonate, track-etch membrane\nlysis is not necessary. Images of labeled cells captured on the\nwith 3-lm pores was immobilized and secured within the flow\nmembrane were obtained and analyzed as described above.\ncell, creating a lymphocyte capture surface with a surface\nFor SEM (scanning electron microscopy), a fixative (2%\narea of 80 mm2. Whole blood samples were delivered to the\nparaformaldehyde/2.5% glutaraldehyde) was added into the\nflow cell from a sample reservoir tube, and the membrane\nflow cell and rinsed with PBS. The filter was removed from\nwithin the flow cell was washed with PBS from a second\nthe flow cell, fixed for 90 s with OsO4 vapor, and then\nreservoir. As in the original ETC system, cells were imaged\ndehydrated with EtOH/HMDS. The same SEM protocol was\nunder fluorescence optics using a mercury arc lamp light\napplied to a drop of whole blood on a glass slide.\nsource and a CCD camera (Figure 1).\nTo confirm that cells could be adequately captured, 33 ll of\nStudy Participants and Comparison to Flow Cytometry\nunprocessed whole blood from non-HIV-infected partici-\nBlood was obtained from HIV-1-uninfected control par-\npants was incubated for 8 min with fluorophore-conjugated\nticipants and HIV-infected participants at the Massachusetts\nanti-CD4 antibodies, and delivered by a peristaltic pump to\nGeneral Hospital in Boston, Massachusetts, United States, and\nthe modified microfluidics chip. Red blood cells passed\nfrom HIV-infected participants at the Botswana-Harvard\nreadily through the pores under appropriate fluid flow\nAIDS Institute HIV Reference Laboratory in Gaborone,\nconditions. In contrast, the majority of white blood cells\nBotswana. The Botswana samples originated from a study of\nwere captured onto a single imaging focal plane (Figure 2).\nHIV-infected pregnant women attending maternal-child\nThis mechanical separation of autofluorescent red blood cells\nhealth clinics in Gaborone or three nearby villages, Molepo-\nallows for the imaging and counting of white blood cells from\nlole, Mochudi, and Lobatse. Six infants were also included in\nunprocessed whole blood without additional sample process-\nthe study. Three milliliters of venous whole blood was\ning, such as centrifugation or red blood cell lysis. Using the\ncollected from each participant (in EDTA anticoagulant).\ndigital imaging system originally developed for microsphere-\nAll samples were run on the microchip on the day of blood\nbased capture in the ETC system, fluorescently labeled white\ncollection. Parallel samples were processed using standard\nblood cells can then be imaged directly on the chip and\nfour-color flow cytometry on a Becton Dickinson FACSCa-\ncounted.\nlibur, using the MultiTEST reagents and TruCOUNT beads,\nTo assess the analytical validity of the membrane-based\nand analyzed using MultiSET software. All samples were\nmicrochip system, we first performed a dilution control study\nprocessed by flow cytometry according to standard operating\nto evaluate the correlation between total fluorescence\nprocedure in the HIV reference laboratory in Botswana. The\nintensity and the absolute number of purified CD4 cells from\nmajority were processed within 24 h of blood collection, and\nnon-HIV-infected participants (labeled with fluorophore-\nall were processed and analyzed within 72 h of blood\nconjugated anti-CD4 antibody) captured in the microcham-\ncollection. A total of 70 participants were enrolled, including\nber. The results show a linear correlation between the\n64 adults and six infants. Three adults did not have flow\nnumber of cells in the sample and the intensity of light\ncytometry results available, leaving 67 participants for\nemitted from the membrane filter (R 1⁄4 0.999) for a range of\nanalysis. The study was approved by the institutional review\nCD4 cell counts relevant to advanced HIV disease (0-200 CD4\nboards of the participating institutions. For a preliminary\ncells/ll blood) (Figure 3). This dose-response study estab-\nassessment of assay variability, blood from a single study\nlished proof of the concept that a modified microfluidic flow\nparticipant was assayed as described above 20 separate times\ncell and a digital image analysis system can accurately detect\nand measure populations of whole blood lymphocytes labeled\nover the course of a single afternoon by a single operator.\nwith fluorescent markers.\n\nFigure 2. The Membrane Flow Cell Selectively Captures Lymphocytes\nstained whole blood, diluted to a total volume of 500 ll of\nand Provides for the Removal of Red Blood Cells without Sample\nPBS), and calculating the unit volume of blood per digital\nProcessing\nimage (0.18 ll), we were able to count the total number of\n(A) A whole blood sample collected atop a glass slide and imaged by a\nCD4þCD3þ cells in 0.9 ll of blood, and determine the absolute\nscanning electron microscope reveals the overabundance of red blood\nCD4 count per microliter.\ncells in the sample.\n(B) A whole blood sample processed through the flow cell reveals that\nWe next tested this rapid, whole blood microchip assay in a\nlymphocytes are captured on the membrane support while red blood\nseries of samples acquired in an HIV reference laboratory in\ncells are largely excluded from within the cell. Arrows indicate red blood\nBotswana. Seventy consecutive HIV-infected participants\ncells passing through the membrane.\n(C) Fluorescent antibody stain specific for a lymphocyte marker is used to\npresenting to the HIV reference laboratory for standard\nvisualize captured lymphocytes within the flow cell in a representative\nCD4 counting as part of a vertical transmission study were\nsingle-color data image.\nenrolled, of whom 64 were adult women and six were infants.\nDOI: 10.1371/journal.pmed.0020182.g002\nParallel samples were processed by standard four-color flow\nCD4þCD3 monocytes (green) and the CD3þCD4 T lympho-\ncytometry on a Becton Dickinson FACSCalibur. The time\ncytes (red) (Figure 4C).\nfrom blood collection to complete analysis and results\nWe next developed a custom algorithm for translating\nreporting using the chip-based assay was approximately 15\nthese digital images into accurate CD4 and CD8 T cell counts\nmin per sample. Three adult participants did not have valid\nPLoS Medicine | www.plosmedicine.org\nJuly 2005 | Volume 2 | Issue 7 | e182\nMicrochip CD4 Counting\nFigure 3. CD4 Lymphocyte Dose Response\nPurified CD4 cells were labeled with AlexaFluor-488-conjugated anti-CD4\nantibodies, introduced to the flow cell in amounts ranging from zero to\n200,000 cells and imaged. There is a linear correlation between the\nnumber of cells in the sample and the intensity of light emitted from the\nmembrane filter (R2 1⁄4 0.999).\nDOI: 10.1371/journal.pmed.0020182.g003\nusing pixel analysis with the aid of a commercial image\nprocessing package. Automated counting of the three subsets\nof cells was based on object size, aspect ratio, and uniformity,\niterated across the range of color intensity levels. As shown in\nFigure 4D, a binary mask first removes the unwanted cell\ntypes, and residual objects representing CD4 T cells are\ncounted. A similar protocol was applied to a second aliquot of\nblood stained with AlexaFluor-647-conjugated CD3-specific\nantibody and AlexaFluor-488-conjugated CD8-specific anti-\nbody to visualize and count CD3þCD8þ T lymphocytes.\nIn order to calculate an absolute CD4 count with standard\nflow cytometry, one of two measures must be undertaken to\ncalculate a concentration in cells per microliter. Either a\nstandardized reference reagent, such as calibration beads at a\nknown concentration, can be added to the assay (''single-\nplatform'' flow cytometry), or an absolute total lymphocyte\ncount in cells per microliter can be obtained on a hematology\nanalyzer (''dual-platform'' flow cytometry). The microchip\nassay we describe here uses a direct volumetric method and\nfunctions as a single-platform approach. By delivering a\nconsistent volume of blood to the flow chamber (16.5 ll of\n\nFigure 4. Data Collection and Processing for Digital Images Obtained from a Single Diluted Whole Blood Specimen from an HIV-Infected Participant\nA total of 16.5 ll of whole blood stained with antibodies specific for CD4 and CD3 markers is delivered to the flow cell after 8 min, and an image of the\nsame region of the membrane is obtained with two different emission filters.\n(A) AlexaFluor-488-conjugated anti-CD4 antibody stains CD4þ cells (T lymphocytes and monocytes) green.\n(B) AlexaFluor-647-conjugated anti-CD3 antibody stains CD3þ T lymphocytes red.\n(C) By digitally merging the two images, CD3þCD4þ T lymphocytes (i.e., ''CD4 cells'') appear yellow and are distinguished from CD4þCD3 monocytes\n(green) and CD3þCD4 T lymphocytes (red).\n(D) A lymphocyte selection algorithm is applied to the merged image, based on a lymphocyte profile as defined by size, shape, and uniformity. Objects\nnot fitting the lymphocyte profile are deleted while remaining objects are selected and ultimately counted. A similar protocol to count CD8 cells is used\nin each participant.\nBoxed region indicates two CD4þ cells (yellow in [C]) in the original (A and B), merged (C), and processed (D) images. Large green and red objects seen\nin some images represent aggregates of fluorescent antibody.\nDOI: 10.1371/journal.pmed.0020182.g004\nflow cytometry results available, leaving 61 adults and six\n5. Figure 5A shows a 31-y-old woman with an absolute CD4\ninfants for analysis.\ncount by flow cytometry of 83 cells/ll. While numerous CD3þ\nRepresentative processed data images from three partic-\nT cells (red) are present as well as scattered monocytes\nipants, two adult women and one infant, are shown in Figure\n(green), her low CD4 count is reflected in the few double-\nFigure 5. Representative Processed Data Images from Three Participants in Botswana\nThe participants included (A) a 31-y-old woman with a CD4 count of 83 cells/ll by flow cytometry; (B) a 33-y-old woman with a CD4 count of 271 cells/ll\nby flow cytometry; and (C) a 5-mo-old infant with an absolute CD4 count of 2,098 cells/ll and a CD4:CD8 ratio of 1.80 by flow cytometry. In these\nimages, CD3þCD8þ T cells appear red, monocytes appear green, and CD3þCD4þ T cells appear yellow. Each image reflects 0.18 ll of whole blood.\nDOI: 10.1371/journal.pmed.0020182.g005\nPLoS Medicine | www.plosmedicine.org\nJuly 2005 | Volume 2 | Issue 7 | e182\nMicrochip CD4 Counting\n\nFigure 6. Methods Comparison and Correlation Studies for Absolute CD4\nCounts in 61 Adults in Botswana\nBland-Altman methods comparison plot comparing absolute CD4 cells\nper microliter of whole blood obtained by the microchip system as\ncompared to standard four-color flow cytometry processed in parallel on\na FACSCalibur in 61 HIV-infected adult participants. There is a propor-\ntional bias of 50 cells/ll relative to flow cytometry. Grey line indicates\nzero bias. Red lines indicate upper and lower 95% limits of agreement.\nDOI: 10.1371/journal.pmed.0020182.g006\nFigure 7. Methods Comparison and Correlation Studies for CD4\nPercentages of Total T Cells and CD4:CD8 Ratios in 67 Human Subjects\n(A and B) CD4 percentages of total T cells and (C and D) CD4:CD8 ratios\nin 67 human participants, including 61 adults and six children. In\nPassing-Bablok correlation plots (A and C), solid black lines indicate\nidentity, blue lines indicate the observed correlations, and dashed black\nlines indicate 95% confidence limits. Correlations for CD4 percentages of\ntotal T cells (r 1⁄4 0.98, p , 0.0001) and CD4:CD8 ratios (r 1⁄4 0.98, p ,\n0.0001) are shown. For Bland-Altman methods comparison plots (B and\nD), notations are as described in Figure 6 caption.\nDOI: 10.1371/journal.pmed.0020182.g007\nPLoS Medicine | www.plosmedicine.org\nJuly 2005 | Volume 2 | Issue 7 | e182\nMicrochip CD4 Counting\nlabeled CD3þCD4þ T cells (yellow) seen in the image. Similar\n0.97, specificity 1⁄4 0.83; and CD4 , 500, sensitivity 1⁄4 0.96,\nrepresentative data images from a young woman with a CD4\nspecificity 1⁄4 0.85.\ncount of 271 cells/ll by flow cytometry and a 5-mo-old infant\nOne important application of our method is in pediatric\nwith a CD4 percentage of T lymphocytes of 0.39 by flow\nHIV monitoring. The wide range of normal absolute CD4\ncytometry are also shown in Figure 5B and 5C, respectively.\ncounts in infants and children requires the use of CD4:CD8\nThese images illustrate the dynamic range of the membrane\nratios or CD4 percentages in pediatric infection. Results for\nCD4:CD8 ratios and CD4 percentages of T lymphocytes for all\ncapture and digital image analysis system, including the\n67 participants (61 adults and six infants) are shown in Fig-\nability to quantify both absolute CD4 counts and CD4\nure 7. Agreement, bias, and correlations between the micro-\npercentages.\nchip method and flow cytometry are excellent for both CD4\nWe compared results from our microchip assay with results\npercentages of T lymphocytes (Figure 7A and 7B) and\navailable from flow cytometry, the latter obtained on a\nCD4:CD8 ratios (Figure 7C and 7D). Bland-Altman plots for\nFACSCalibur through standard clinical laboratory operating\nboth CD4 percentages of T lymphocytes and CD4:CD8 ratios\nprocedures. The data for adult absolute CD4 counts are\nshow low proportional bias, with tight 95% limits of agree-\nplotted in the Bland-Altman methods comparison plot\nment. Correlations are excellent for both CD4 percentages of\nshown in Figure 6. For 61 adult participants with CD4 counts\nT lymphocytes (r\n0.98, p , 0.0001) and CD4:CD8 ratios (r\nranging from 35 to 1,087 cells/ll (mean, 372 cells/ll) by flow\n1⁄4\n1⁄4\n0.98, p , 0.0001). Overall, the data show that all three\ncytometry, results show a good correlation between absolute\napproaches to measuring CD4 cell counts can be accurately\nCD4 counts measured by our microchip assay and those\nquantified using the microchip method, and that both adult\nmeasured by flow cytometry. Bland-Altman methods com-\nand pediatric CD4 results can be obtained.\nparison analysis shows a bias of 50 cells/ll (95% confidence\nTo determine assay variability, we examined 20 replicate\ninterval, 81 to 20 cells/ll), and good 95% limits of\nsamples of blood from a single participant over the course of\nagreement (Figure 6). Several of the results from participants\none day, using the established basic protocol. We determined\nat the higher end of absolute CD4 counts fall outside the 95%\nthat the coefficient of variance was 12% (data not shown),\nlimits. For these participants, individual lymphocytes may\nwhich is similar to other methods of CD4 counting [27].\noverlap in the digital images (as seen in Figure 5C), which can\nAlthough the assay described here introduced 16.5 ll of blood\ninterfere with the accuracy of the lymphocyte counting\ninto the system, the actual volume of blood analyzed by digital\nalgorithm. In resource-limited settings, the primary use of\nimage analysis is only 0.90 ll. We have conducted preliminary\nCD4 counts is as a trigger to initiate antiretroviral therapy,\nstudies that suggest that we can accurately measure CD4\ncounts from less than 5\nl of blood obtained via fingerstick\nwhich typically occurs at a CD4 count of 200 cells/\nl\nll. Higher\n(data not shown); additional studies will be required to assess\nCD4 count thresholds of 350 and 500 cells/ll are also used to\nthe correlation between CD4 counts obtained by fingerstick\nincrease the intensity of monitoring. For these values, the\nand by venipuncture.\nsensitivity and specificity of our method are: CD4 , 250,\nsensitivity 1⁄4 0.86, specificity 1⁄4 0.81; CD4 , 350, sensitivity 1⁄4\n\nTable 1. A Comparison of Methods for CD4 Determination\nMethod\nManufacturer/\nEquipment\nAssay\nTime to Result\nAdult or\nModel\n(Minutes)\nPediatric\nEstimated Cost\nLocation\nEstimated\nSample\nSample\n(USD$)a\nof Use\nCost\nVolume\nPreparation\n(USD$)a\nFlow cytometry\nBeckman Coulter\n$75,000-125,000\nCentral reference\n$5-50\n100 ll\n.3 pipet steps\n20-30\nBoth\nlaboratory\nEPICS XL\nBecton Dickinson\nFACSCalibur\nSingle-purpose\nBecton Dickinson\n$20,000-50,000\nDistrict/regional\n$5-25\n50 ll\n2 pipet steps\nAdult only\nflow cytometry\nFACSCount\nfacility\nGuava Easy CD4\n$5-10\n10 ll\n3 pipet steps\nAdult only\nPartec CyFlowb\n$3-10\n50 ll\n3 pipet steps\nBoth\nc\nPointCare FlowCare\n$10\n5 ml\nNone\nBoth\nMicrobead separation\nCoulter Cytospheres\n$2,000\nDistrict/regional\nfacility\n; $4-7\n;100 ll\n3 pipet steps,\nmanual count\n30-45\nAdult only\nDynal Dynabeads\nMicrochip digital imaging\nIn development\n,$5,000\nPoint of care\nd\nIn development\n,10 ll\nNoned\n;10\nBoth\nCompared with flow cytometric and related methods, including newer systems, the described method can be adapted to a portable device offering true point-of-care testing, although likely at lower throughput than current methods.\nCompared with microbead-based microscopic methods, the described method is significantly less labor intensive and higher throughput.\naCosts are rough estimates for resource-limited countries. CD4 equipment and assay costs vary significantly by country, and a variety of discounts are available based on volume purchasing, and equipment purchase versus equipment lease\noptions. Assay costs are intended to reflect cost per patient result for reagents, consumables, sample collection, processing, and overhead, including personnel costs, but are not intended to reflect amortization of equipment purchase or\nequipment maintenance fees, which can be as high as $15,000 per year.\nbPartec CyFlow is available in a mobile version powered by a 12-V automobile battery.\ncPointCare's technology uses nonfluorescent detection of side angle light scatter information from a flowing sample, and thus differs slightly from traditional flow cytometry.\ndMicrofluidic cartridges with embedded reagents are now in development. These systems are projected to use significantly less reagents than flow cytometry, and final assay costs are likely to be low. For the prototype described here, two\npipet steps were required. These steps will be integrated components of the microfluidic cartridges, which will require no sample preparation.\nDOI: 10.1371/journal.pmed.0020182.t001\nPLoS Medicine | www.plosmedicine.org\nJuly 2005 | Volume 2 | Issue 7 | e182\nMicrochip CD4 Counting\nDiscussion\nAlthough only six pediatric samples were available, limiting\nclaims of statistical significance, we believe the issue of\nOur results provide proof of principle that low-cost\npediatric CD4 count monitoring to be of such importance\nmicrofluidic structures combined with fluorescence imaging\nthat the data merited inclusion. Excluding the six pediatric\nand digital image analysis can be successfully applied to the\nsamples does not affect the analysis.\nmeasurement of CD4 cell counts, which are critical to the\nThe results presented here were obtained with a stationary,\nclinical management of HIV infection. The method described\ntabletop monitoring system using a standard epifluorescence\nhere can deliver both absolute CD4 counts for adult\nmicroscope and commercial image processing software.\nmonitoring, and CD4 percentages or CD4:CD8 ratios for\nWhile the methods we described provide the basis for a\npediatric monitoring. Most importantly, the rapid and\nhighly portable and flexible miniaturized CD4 counting\naccurate CD4 assessments obtained with this method,\nsystem, it should be emphasized that a number of additional\ntogether with its anticipated low cost relative to flow\ndevelopments are required to enable the widespread use of\ncytometry, may make this type of approach ideal for\nthis approach in resource-limited settings. With additional\nresource-scarce settings. As our results show, this method\nengineering of optics, electronics, and mechanical compo-\nmay be less accurate at the higher range of CD4 counts, where\nnents along with advancements in integrated microfluidic\ncells may be more likely to overlap in our digital images.\nsystems, it should be possible to develop a point-of-care\nWhile this may limit its applicability, our method is accurate\ninstrument that is battery-powered, uses simple light emitting\nat CD4 counts below 500 cells/ll, which represent the\ndiodes (LEDs), and secures analyzable digital images with\nclinically relevant CD4 levels in resource-poor settings. In\n\naffordable video imaging chips. When combined with an\naddition, both the bias in the method described here ( 50\ncells) and the accuracy at higher CD4 counts are likely to be\nembedded microprocessor and disposable assay cartridges for\nimproved significantly by the further development of a\nboth adult and pediatric monitoring manufactured from\ndisposable microfluidic cartridge, where the volume of\ninjection-molded plastic, it should be possible to create a\ndistribution of the sample will be much smaller, and more\nfunctional CD4 counting device that can be used at the point\naccurate volumetric control will be possible.\nof care. Further trials in a larger, more diverse cohort of\nOur study was designed to evaluate the accuracy of our\npatients, including adult men and children, will be necessary\nmethod against the gold standard in a population of adults.\nto confirm the accuracy of the method, including an assess-\nDuring enrollment, a small number of pediatric samples were\nment of assay bias and reproducibility. Such a device is\nmade available to us by the staff at Princess Marina Hospital\ncurrently in commercial development, and may be available\nin Botswana. We chose to include these samples in the data\nby early 2006. While it is too early to provide an accurate cost\npresented here to provide proof of principle that pediatric\nestimate for a portable instrument and disposable plastic CD4\nCD4 percentages can also be assessed with this method.\nassay, we expect the equipment cost would be substantially\n\nminimal power requirements. Preliminary cost estimates for\nAdditional Online Resources\nInformation about CD4 monitoring for\nthe instrumentation here described suggest, at a minimum, a\nHIV/AIDS patients can be found at the following Web sites.\nWorld Health Organization (search for CD4 count):\n10-fold reduction in the cost for the associated measurement\nhttp://www.who.int/en/\nsystem. Further, reagent consumption for the microchip\nThe World Health Organization's specific review of CD4 counting\nsystem can be reduced by a similar factor relative to flow\ntechnologies:\nhttp://www.who.int/3by5/amds/Suzanne_Crowe.pdf\ncytometry, while sample storage and shipping costs are\nThe Well Project:\nexpected to be reduced dramatically by virtue of the point-\nhttp://www.thewellproject.org/\nof-care capabilities of this new lab-on-a-chip structure. The\nThe Well Project's specific page on CD4 counts:\nimportance of microtechnologies to the realities of labora-\nhttp://www.thewellproject.org/Treatment_and_Trials/First_Things_First/\nUnderstanding_CD4_and_CD8_Cells.jsp\ntory infrastructure worldwide has been recognized previously\nFind Diagnostics, an organization focused on affordable diagnostics for\n[28-30]. Although CD4 counting represents the most urgent\ninfectious diseases worldwide:\nneed in HIV diagnostics for resource-poor settings, the\nhttp://www.finddiagnostics.org/\nThe Forum for Collaborative HIV Research, a consortium with an\nmicrochip platform is adaptable to other important assays.\nadvocacy and funding role for HIV/AIDS research priorities, including\nThrough the interface of the lymphocyte capture membrane\nlow-cost CD4 and viral load tests:\ndescribed here with the previously reported microchip\nhttp://www.hivforum.org/\narrays, cellular assays like CD4 counts can be multiplexed\nProject Inform (search for CD4 and monitoring):\nhttp://www.projectinform.org/\nwith other molecular biomarker measurements (i.e., proteins\nand nucleic acids) on a single miniaturized chip. The rapid\nextension of the chip-based CD4 counting method described\nhere to HIV RNA measurements, diagnostics for opportun-\nistic infections, liver enzymes, and other biochemical markers\nof interest in infectious disease is feasible.\nAcknowledgments\nThe authors would like to thank Drs. Max Essex, Joel Katz, Shahin\nand Melinda Gates Foundation, and the Doris Duke Charitable\nLockman, Ric Marlink, and Roger Shapiro for their assistance with\nFoundation. The funders had no role in study design, data\nfield testing of the microchip system in Botswana. This work was\ncollection and analysis, decision to publish, or preparation of the\nsupported by grants from the National Institutes of Health, the Bill\nmanuscript.\nPLoS Medicine | www.plosmedicine.org\nJuly 2005 | Volume 2 | Issue 7 | e182\nsample measurement systems into miniaturized devices with\nreliable for pediatric patients.\nMicrochip CD4 Counting\nlower than for flow cytometry, and the assay cost would be\nPatient Summary\nsimilar to assays using existing methods (Table 1).\nBackground Most HIV-infected people don't develop AIDS right away,\nAlthough several CD4 counting systems are now used in\nbecause their immune systems can keep the virus in check for months\nresource-limited settings, they remain suboptimal to meet the\nand sometimes years. In general, doctors don't recommend that infected\nneeds of HIV care and treatment scale-up. None can truly be\npeople start taking HIV medications while their immune system is still\nhealthy. Doctors know whether or not a patient's immune system is\nused at the point of care beyond a district hospital or similar\nhealthy-and therefore whether or not to start treatment-by measuring\nfacility, and either the capital and operating costs remain\nthe \"CD4 count.\" This is the number of CD4 cells in a sample of blood.\nhigh, or throughput is low, or both (Table 1). Pediatric\nCD4 cells, also called CD4+ T cells, are a type of white blood cell that\nfights infection. HIV destroys CD4 cells, weakening the body's immune\nmonitoring using CD4 percentages also remains largely\nsystem and ultimately causing AIDS. CD4 counts should be determined\nunavailable. The method we describe here addresses several\nbefore a patient receives antiretroviral therapy and then measured\nof the limitations of performing diagnostic assays in resource-\nregularly while the patient is on therapy.\nlimited settings. First, sample volumes are minimal, so that\nWhy Was This Study Done? Most tools available to count CD4 cells are\ntests can be performed on fingerstick samples of blood,\nlarge and expensive to buy, and every actual count is also expensive and\ncircumventing the need for venipuncture, and minimizing\ndifficult to carry out. These tools are therefore unsuitable for many low-\nincome countries. The researchers wanted to develop a tool that allows\nboth medical waste and operator exposure to biohazardous\neasier and cheaper measurement of CD4 cells, and is small and simple\nmaterial. Second, reagent use is minimized in the microchip\nenough that health-care workers can take it to patients when they visit\nsystem, reducing reagent costs by as much as 90%. Third,\nthem in remote areas.\nlabor- and equipment-intensive sample preparation is elim-\nWhat Did the Researchers Do? They built a prototype for a new tool\ninated. Fourth, the microchip CD4 assay is extremely rapid.\nthat counts CD4 cells in a simpler and cheaper way. They then took\nCD4 results in the prototype system described here are\nsamples from 61 adults and six children and compared the results when\nthey used both the standard technologies and their prototype counter.\navailable in less than 15 min from the time of blood\ncollection. In a mature microfluidic device with push-button\nWhat Did They Find? They found that their prototype works well and is\nindeed cheaper and easier to use. It also appears to be just as reliable as\noperation, results should be available in less than 10 min, and\nthe large and more complicated machines in helping doctors make\nthus can be used to make real-time clinical decisions at the\ndecisions about when to start therapy and when to change therapies.\npoint of care. Fifth, the assay is technically simple, analogous\nThey have done enough samples from adults infected with HIV to be\nconfident about that. It looks like it might work for infected children as\nto a portable glucometer, and ultimately will be useable by a\nwell, but they haven't done enough child samples yet to be certain.\nhealth-care worker in remote settings with minimal training,\nextending the reach of CD4 assays to district hospitals and\nWhat Does This Mean? This suggests that with some additional work, it\nshould be possible to develop a handheld CD4 counter that is cheap,\nremote clinics, and reducing labor costs. Sixth, both adult and\neasy, and transportable. This could make a big difference for the care of\npediatric monitoring are possible.\nHIV patients in developing countries and other remote areas.\nWe believe that the future of low-cost diagnostics for use in\nWhat Next? There is still more development work to do to get from the\nthe developing world lies in the development of new lab-on-a-\nprototype to a handheld counter, and the researchers should also study\nchip technologies that integrate sample preparation and\nmore samples from children to see whether the new test is equally\n\nPLoS Medicine | www.plosmedicine.org\nJuly 2005 | Volume 2 | Issue 7 | e182\nMicrochip CD4 Counting\nReferences\nalternative to CD4þ and CD8þ T lymphocyte counts in Africans. Trop\n1.\nJoint United Nations Programme on HIV/AIDS, World Health Organiza-\nMed Int Health 4: 79-84.\ntion\n(2004 December) AIDS epidemic update: 2004. Available: http://\n16. Landay A, Ho JL, Hom D, Russell T, Zwerner R, et al. (1993) A rapid manual\nwhqlibdoc.who.int/unaids/2004/9291733903.pdf. Accessed 9 March 2005.\nmethod for CD4þ T-cell quantitation for use in developing countries. AIDS\n2.\nWorld Health Organization (2004) . World Health Organization (2004) 3 by\n7: 1565-1568.\n5 progress report: December 2003 through June 2004. Available: http://\n17. Didier JM, Katachkine MD, Demouchy C, Moat C, Diagbouga S, et al. (2001)\nwww.who.int/3by5/en/Progressreport.pdf. Accessed 15 January 2005.\nComparative assessment of five alternative methods for CD4þ T-lympho-\n3.\nDepartment of Health and Human Services (2005 April 7) Guidelines for the\ncyte enumeration for implementation in developing countries. J Acquir\nuse of antiretroviral agents in HIV-1-infected adults and adolescents.\nImmune Defic Syndr 26: 193-195.\nAvailable: http://aidsinfo.nih.gov/guidelines/adult/AA_040705.pdf. Accessed\n18. Lyamuya EF, Kagoma C, Mbena EC, Urassa WK, Pallangyo K, et al. (1996)\n9 June 2005.\nEvaluation of the FACScount, TRAx CD4 and Dynabeads methods for CD4\n4.\nO'Brien WA, Hartigan PM, Martin D, Esinhart J, Hill A, et al. (1996)\nlymphocyte determination. J Immunol Methods 195: 103-112.\nChanges in plasma HIV-1 RNA and CD4þ lymphocyte counts and the risk of\n19. Shapiro H (2004) ''Cellular astronomy''--A foreseeable future in cytometry.\nprogression to AIDS. Veterans Affairs Cooperative Study Group on AIDS.\nCytometry A 60: 115-124.\nN Engl J Med 334: 426-431.\n20. Janossy G, Jani IV, Kahan M, Barnett D, Mandy F, et al. (2002) Precise CD4\n5.\nMellors JW, Munoz A, Giorgi JV, Margolick JB, Tassoni CJ, et al. (1997)\nT-cell counting using red diode laser excitation: For richer, for poorer.\nPlasma viral load and CD4þ lymphocytes as prognostic markers of HIV-1\nCytometry B Clin Cytom 50: 78-85.\ninfection. Ann Intern Med 126: 946-954.\n21. Goodey AP, McDevitt JT (2003) Multishell microspheres with integrated\n6.\nO'Brien WA, Hartigan PM, Daar ES, Simberkoff MS, Hamilton JD (1997)\nchromatographic and detection layers for use in array sensors. J Am Chem\nChanges in plasma HIV RNA levels and CD4þ lymphocyte counts predict\nSoc 125: 2870-2871.\nboth response to antiretroviral therapy and therapeutic failure. VA\n22. Christodoulides N, Tran M, Floriano PN, Rodriguez M, Goodey A, et al.\nCooperative Study Group on AIDS. Ann Intern Med 126: 939-945.\n(2002) A microchip-based multianalyte assay system for the assessment of\n7.\nGlencross DK, Stevens G, Scott LE, Mendelow BV, Stevens W (2002) The\ncardiac risk. Anal Chem 74: 3030-3036.\nchallenge of laboratory monitoring of HIV. S Afr Med J 92: 248.\n23. Goodey A, Lavigne JJ, Savoy SM, Rodriguez MD, Curey T, et al. (2001)\n8.\nGlencross D, Scott LE, Jani IV, Barnett D, Janossy G (2002) CD45-assisted\nDevelopment of multianalyte sensor arrays composed of chemically\nPanLeucogating for accurate, cost-effective dual-platform CD4þ T-cell\nderivatized polymeric microspheres localized in micromachined cavities.\nenumeration. Cytometry 50: 69-77.\nJ Am Chem Soc 123: 2559-2570.\n9.\nHuff B (2001) Low cost diagnostics. GMHC Treat Issues 15: 1-4.\n24. Floriano PN, Christodoulides N, Romanovicz D, Bernard B, Simmons GW,\n10. Bartholomew C (2001) Prices of CD4 assays and viral load tests must be\net al. (2005) Membrane-based on-line optical analysis system for rapid\nreduced for developing countries. BMJ 323: 809-810.\ndetection of bacteria and spores. Biosens Bioelectron 20: 2079-2088.\n11. Sherman GG, Galpin JS, Patel JM, Mendelow BV, Glencross DK (1999) CD4þ\n25. Bland JM, Altman DG (1999) Measuring agreement in methods comparison\nT cell enumeration in HIV infection with limited resources. J Immunol\nstudies. Stat Methods Med Res 8: 135-160.\nMethods 222: 209-217.\n26. Passing H, Bablok W (1983) A new biometrical procedure for testing the\n12. Janossy G, Jani IV, Bradley NJ, Bikoue A, Pitfield T, et al. (2002) Affordable\nþ\nequality of measurements from different analytical methods. Application\nCD4 -T-cell counting by flow cytometry: CD45 gating for volumetric\nof linear regression procedures for method comparison studies in clinical\nanalysis. Clin Diagn Lab Immunol 9: 1085-1094.\nchemistry. J Clin Chem Clin Biochem 21: 709-720.\n13. Kannangai R, Ramalingam S, Jesudason MV, Vijayakumar TS, Abraham\nOC, et al. (2001) Correlation of CD4þ T-Cell counts estimated by an\n27. Whitby L, Granger V, Storie I, Goodfellow K, Sawle A, et al. (2002) Quality\nþ\nimmunocapture technique (Capcellia) with viral loads in human immuno-\ncontrol of CD4 T-lymphocyte enumeration: results from the last 9 years of\ndeficiency virus-seropositive individuals. Clin Diagn Lab Immunol 8: 1286-\nthe United Kingdom National External Quality Assessment Scheme for\n1288.\nImmune Monitoring (1993-2001). Cytometry 15: 102-110.\n14. Kannangai R, Prakash KJ, Ramalingam S, Abraham OC, Mathews KP, et al.\n28. Daar AS, Thorsteinsdo ttir H, Martin DK, Smith AC, Nast S, et al. (2002) Top\n(2000) Peripheral CD4þ/CD8þ T-lymphocyte counts estimated by an\nten biotechnologies for improving health in developing countries. Nat\nimmunocapture method in the normal healthy south Indian adults and\nGenet 32: 229-232.\nHIV seropositive individuals. J Clin Virol 17: 101-108.\n29. Harris E (1996) Developing essential scientific capability in countries with\n15. Diagbouga S, Durand G, Sanou PT, Dahourou H, Ledru E (1999) Evaluation\nlimited resources. Nat Med 2: 737-739.\nof a quantitative determination of CD4 and CD8 molecules as an\n30. Harris E, Tanner M (2000) Health technology transfer. BMJ 321: 817-820."
    },
    {
      "category": "Resource",
      "title": "2005nature.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-410j-projects-in-microscale-engineering-for-the-life-sciences-spring-2007/2c54539970ab15dad0966a9d238019a2_2005nature.pdf",
      "content": "to a relatively small fraction (0.01-1%) of\nCD4+ T cells in the chronic stages of infec-\ntion3. This low frequency of infection\nseemed to reflect the fact that the viruses\nrequire the presence of a co-receptor in addi-\ntion to CD4 to gain entry, and also that they\nreplicate best in activated memory CD4+\nT cells (memory cells being those previously\nstimulated by foreign antigen). The pre-\nferred co-receptor for most HIV and SIV\nstrains is CCR5, which is expressed only in a\nsubset of memory CD4+T cells.\nDespite the apparent low frequency\nof T-cell infection in chronic infection,\nseminal studies in SIV-infected monkeys4\n-- subsequently confirmed in HIV-infected\nhumans5,6 -- revealed a rapid and wide-\nspread depletion of CD4+ T cells in the gut\n(mucosal T cells) during the first few weeks\nof infection. T cells in the blood or lymph\nnodes did not show the same degree of\ndepletion. This predilection of HIV and SIV\nfor replicating in gut lymphocytes was felt\nto be a consequence of the relatively large\npopulations of activated CD4+ T cells at this\nsite that express CCR5.However,the propor-\ntion of cells actually infected with SIV was\nnot known; nor was it clear whether T-cell\nactivation was in fact required for infection,\nor how T cells were killed.\nMattapallil et al.1 have now examined the\nrole of SIV in the depletion of CD4+ T cells\nduring early (acute) stages of infection. As\npreviously reported4, SIV rapidly depleted\nCD4+ T cells in the gut. Remarkably, how-\never, 60-80% of memory CD4+ T cells were\nconcurrently depleted at all sites. Using a\ntechnique that can detect a single copy of SIV\nDNA, the authors determined that 30-60%\nof all memory CD4+ T lymphocytes were\ninfected with SIV within 10 days of infection,\nregardless of their location, and that most of\nthese cells had disappeared 4 days later.These\npercentages far exceed the number of CD4+\nT cells that express CCR5, but the authors\npropose that this apparent contradiction\nmay be resolved by their finding of low levels\nof CCR5-encoding messenger RNA in mem-\nory cells in which CCR5 protein could not be\ndetected by flow cytometry.This implies that\nsuch cells may in fact express sufficient levels\nof CCR5 protein to render them permissive\nfor SIV infection. Alternatively, SIV may be\nentering the cells using other co-receptors.\nLi and colleagues' paper2 provides a\ncomplementary perspective on this viral\nblitzkrieg.By identifying cells expressing SIV\nRNA in tissue sections, these investigators\ncharacterized the activation state of virus-\nproducing cells (viral production requires\nSIV DNA to be transcribed into RNA).Con-\nsistent with their earlier work7, they found\nthat most infected cells did not express\nmarkers of activation (CD25 or CD69), nor\ndid they express Ki67 -- a molecule found in\nnews and views\nNATURE|VOL 434|28 APRIL 2005|www.nature.com/nature\nat this current level was limited to a few\nminutes by the attainable temperature rise.\nAlthough this output is too small for most\napplications, the authors outline plans to\nincrease the yield to a million neutrons per\nsecond, comparable to that of some com-\nmercial portable neutron generators.Never-\ntheless, even at the level already attained,\nthere are laboratory uses, such as measuring\nneutron detector response or for student\npractical demonstrations,for which a simple,\ninexpensive, monoenergetic neutron source\nwould be most valuable.\n■\nMichael J. Saltmarsh is mostly retired from\nOak Ridge National Laboratory, PO Box 2008,\nOak Ridge, Tennessee 37831-6368, USA.\ne-mail: msaltmarsh@aol.com\n1. Naranjo, B., Gimzewski, J. K. & Putterman, S. Nature 434,\n1115-1117 (2005).\n2. Donnay, G. Acta Crystallogr. A 33, 927-932 (1977).\n3. Brownridge, J. D. Nature 358, 287-288 (1992).\n4. Brownridge, J. D. & Raboy, S. J. Appl. Phys. 86, 640-647 (1999).\n5. www.amptek.com/coolx.html\nHIV\nViral blitzkrieg\nR. Paul Johnson and Amitinder Kaur\nIt takes years for AIDS to develop from the damage inflicted on the\nimmune system by HIV or its simian counterpart. Surprisingly, as many as\nhalf of the body's memory T cells may die at a very early stage of infection.\nH\nIV and the related simian immuno-\ndeficiency virus (SIV) cause AIDS\nby infecting the master regulatory\ncells of the immune system -- T helper cells,\nbetter known as CD4+ T cells. It is generally\nyears before enough damage is done to\nthis cellular army for full-blown AIDS to\ndevelop. Nevertheless, two reports in this\nissue1,2 (pages 1093 and 1148) suggest that\nthe outcome of the battle between SIV and its\nhost may be determined by a dramatic open-\ning salvo, in which the virus eliminates\naround half of the host's memory CD4+\nT cells within four days -- thus setting the\nstage for a lengthy war of attrition.\nCD4+T lymphocytes are so called because\nthey express a receptor protein termed\nCD4; this is necessary for T-cell function,\nbut has also been co-opted by HIV and SIV to\ngain entry to the cells. Previous results sug-\ngested that HIV/SIV replication is restricted\nIf you yourself can't breed, you can\nat least help your relatives with their\noffspring. Such altruistic behaviour\noccurs in long-tailed tits (Aegithalos\ncaudatus, pictured), which Stuart\nSharp and colleagues have studied\nto find out what cues enable a\n'helper' to recognize kin. Their report\nappears elsewhere in this issue\n(Nature 434, 1127-1130; 2005).\nAdult long-tailed tits pair off and\nattempt to breed each year, but many\ndon't succeed because of high rates\nof predation on the eggs or nestlings.\nThe childless parents may then\nturn to assisting kin in feeding their\nbrood -- which makes sense in\nevolutionary terms but requires some\nform of recognition system. Long-\ntailed tits are not the greatest of\nvocalists. They sing infrequently but\ndo have an individually characteristic\ncontact call, the 'churr', which\ndevelops even before fledging\nand is retained in the adult bird.\nThe first part of Sharp and\ncolleagues' research involved the\nplayback to individuals of churr calls\nbelonging to a close relative and a\nnon-relative, and a further two trials\nin which the frequency of these calls\nhad been tweaked. The responses\nof birds to the untweaked calls of\nrelatives differed significantly from\ntheir responses to the other three\ncalls. From this, the authors\nconclude that the churr call provides\ncues involved in kin recognition.\nThe most innovative part of the\nstudy, however, was an investigation\ninto how much churr acquisition\nowes to nurture (learning) and nature\n(genetics). This took the form of\nswapping young birds between\nnests, so that adult birds were\nraising foster nestlings along with\ntheir true offspring. The churr calls of\nthe fostered birds were the same as\nthose of their nestmates, and unlike\nthose of their biological siblings\nraised elsewhere -- so it seems that\nthe churr is in large part learned.\nThe pattern of helping observed\nin long-tailed tits is consistent with\nthe use of this learned cue in the\ngreat majority of cases. But this kin-\nrecognition system evidently isn't\nfaultless: in 6% of cases, an adult\nhelped unrelated nestlings. As the\nauthors point out, recognition systems\nare rarely perfect.\nTim Lincoln\nBehavioural ecology\nCue for kin\nANDREW MACCOLL\nNature Publishing Group\n(c) 2005\n\ncells that have recently divided. Hence, these\ncells were deemed to be 'resting'.\nAlthough these resting cells produce less\nvirus than do Ki67-expressing cells, they\nvastly outnumber their activated counter-\nparts and so serve as the major viral reservoir\nduring this first phase of infection. Because\nofits ability to replicate in non-dividing cells,\nSIV can broaden its substrate base signifi-\ncantly,and deplete most CCR5+ CD4+ T cells\nin all lymphocyte compartments during\nacute infection. Once the resting memory-\ncell population is nearly eliminated, the\nactivated population increases slightly, but\nnow makes a larger contribution to total\nvirus production (Fig.1).\nThe idea that SIV (and presumably HIV)\ncan infect resting lymphocytes seems to con-\ntradict the conventional wisdom that these\nviruses replicate primarily in activated cells.\nBut mucosal lymphocytes (the main target\ncells) are probably better described as\n'recently activated' rather than truly resting.\nMany such cells appear to be derived from\nblood cells that have recently divided and\nthen migrated into the mucosa, where they\nlose Ki67 expression8. The dichotomous\nnomenclature of 'resting' and 'activated'\nT cells may obscure our ability to understand\nthe range of cellular states that affects\nSIV/HIV replication. Further research is\nneeded to determine the roles of viral pro-\nteins, host cytokine proteins, nucleotide\npools and cellular resistance factors9,10 in\nregulating viral replication in non-dividing\nlymphocytes.\nAlthough there are many points of agree-\nment between the new papers1,2, they differ\non a key issue: the relative roles of direct\nversus indirect killing (death ofvirus-infected\nversus uninfected cells).Mattapallil and col-\nleagues'finding1 of SIV DNA in up to 60% of\nmemory CD4+ T cells at peak suggests that\nnearly all T-cell death at early stages can be\nattributed to direct infection. But Li et al.2\nfound a significantly lower peak frequency\nof cells expressing SIV RNA, and suggest\nthat indirect mechanisms (mediated by the\nFas-FasL cell-suicide pathway) also con-\ntribute to T-cell death in acute infection.\nDifferences in the sensitivity of the tech-\nniques used by the two groups to detect\ninfected cells may contribute to this discrep-\nancy. But another, perhaps more likely,\npossibility is that not all of the cells that\ncontained SIV DNA were producing new\nviruses (indicated by the presence of SIV\nRNA). A similar situation occurs in chronic\nHIV infection, where fewer than 1 in 100\ninfected cells is 'productively infected'3.\nDo these acute events determine the\nchronic course of infection? Owing to their\nfocus on acute infection, neither study1,2\nallowed early events to be correlated with\ndisease progression. So it is not known\nwhether differences in the proportion of\nSIV-infected CD4+ T cells -- or in the size of\nthe memory T-cell pool destroyed during\npeak replication -- affect the extent of\nvirus production during chronic infection,\na key predictor of disease progression. The\ncontribution of immune responses to the\ndepletion of infected CD4+ cells and the\ninitial drop in peak viral load also remains\ncontroversial.\nHowever,once acute viral replication has\nsubsided,different viral and T-cell dynamics\nwill come into play. Overall levels of virus\nproduction will fall, even though the shift\nin viral replication from resting to activated\nNATURE|VOL 434|28 APRIL 2005|www.nature.com/nature\nT cells means that more viruses are produced\nper cell.The smaller size of the infected T-cell\npool and the generation of virus-specific\nimmune responses are both likely to con-\ntribute to the overall decrease in virus pro-\nduction. The body's ability to regenerate\nmucosal lymphocyte pools is also likely to be\nimportant in forestalling the onset ofAIDS8.\nAs for vaccines, the findings reinforce the\nrationale for blocking HIV before it gains\naccess to the fertile grounds of mucosal\nlymphocytes -- and for reducing the initial\nburst of viral replication. Recent vaccine\nefforts have been aimed at activating other\nT cells, those expressing CD8, which are\nmost effective in decreasing chronic levels of\nviral replication and slowing down disease\nprogression11. But it may be more effective\nto stimulate the body to produce neutral-\nizing antibodies that prevent the initial\nburst of replication -- although this remains\na challenge.\n■\nR. Paul Johnson and Amitinder Kaur are in the\nDivision of Immunology, New England Primate\nResearch Center, Harvard Medical School,\nSouthborough, Massachusetts 01772, USA.\nR. Paul Johnson is also at the Partners AIDS\nResearch Center and Infectious Disease Unit,\nMassachusetts General Hospital, Boston.\ne-mail: paul_johnson@hms.harvard.edu\n1. Mattapallil, J. J. et al. Nature 434, 1093-1097 (2005).\n2. Li, Q. et al. Nature 434, 1148-1152 (2005).\n3. Haase, A. T. Annu. Rev. Immunol. 17, 625-656 (1999).\n4. Veazey, R. S. et al. Science 280, 427-431 (1998).\n5. Brenchley, J. M. et al. J. Exp. Med. 200, 749-759 (2004).\n6. Mehandru, S. et al. J. Exp. Med. 200, 761-770 (2004).\n7. Zhang, Z. et al. Science 286, 1353-1357 (1999).\n8. Picker, L. J. et al. J. Exp. Med. 200, 1299-1314 (2004).\n9. Unutmaz, D., KewalRamano, V. N., Marmon, S.\n& Littman, D. R. J. Exp. Med. 189, 1735-1746 (1999).\n10.Chiu, Y.-L. et al. Nature doi:10.1038/nature03493 (2005).\n11.Robinson, H. L. Nature Rev. Immunol. 2, 239-250 (2002).\nFigure 1 Model for the depletion of gut CD4-expressing T lymphocytes\nby SIV. Most of the body's memory CD4+ T helper cells are found in the\ngut, mainly in a compartment known as the lamina propria. a, Before\ninfection, non-dividing (resting) CD4+ T cells in the lamina propria\noutnumber activated T cells by 70-fold or more. b, In the initial (acute)\nphase of infection, the CD4+ T-cell population in the gut is eliminated\nrapidly; the new papers reveal that up to 60% of these T cells are infected\nwith SIV1 and that most of the infected cells are resting rather than\nactivated2. Only a subset of infected cells that contain SIV DNA will\nexpress SIV RNA and produce viral particles. Such 'productively infected'\ncells, cells that contain viral DNA but not RNA, and uninfected cells\nmay all be killed as a result of SIV infection, although the relative\nnumbers of each are not known. c, During chronic infection, in\nresponse to the depletion of resting cells, the number of activated\ncells increases slightly. These cells now represent the dominant site\nof viral replication.\nnews and views\nNature Publishing Group\n(c) 2005"
    },
    {
      "category": "Resource",
      "title": "refoldnature2005.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-410j-projects-in-microscale-engineering-for-the-life-sciences-spring-2007/bef4dbfcab9b2b85db09cd409c716ace_refoldnature2005.pdf",
      "content": "When the nebula disappeared, the proto-\nplanets would retain some of these atmos-\npheres and thereby acquire noble gases from\nthe solar nebula.\nGenda and Abe1 use a ruthlessly simpli-\nfied model to describe how giant impacts\ninteract with atmospheres3. They accept as a\nmatter of course that much of the stricken\nhemisphere is lost, driven off by hydro-\ndynamic jetting or the tangential momen-\ntum of a glancing blow.Their concern is with\nthe hemisphere that is not hit directly.\nHere the impact announces itself when\nthe bow shock erupts through the surface.\nIndeed, the entire crust launches into space\nat high velocity, typically several kilometres\nper second. The crust drives a shock wave\ninto the atmosphere that accelerates as it\nrises into thinner air. At some height the air\nreaches escape velocity,but escape is efficient\nonly if the ground velocity approaches or\nexceeds the escape velocity3,4. Such high\nground velocities are difficult to achieve if\nthe planet itself survives; the highest ground\nmotions achieved in successful Moon-form-\ning impact simulations (a relatively gentle\nevent) are typically less than half the escape\nvelocity5. Genda and Abe therefore argue\nthat most of a planet's atmosphere,including\nits primordial noble gases, is retained in\ngiant impacts.\nAn ocean changes everything. When the\ncrust hits the ocean, the ocean is driven\noutward at an even higher velocity and it is\nalso vaporized. The resulting explosion of\nsupercharged steam accelerates most of the\noverlying atmosphere to escape velocity and\nbeyond (Fig. 2 in the supplementary infor-\nmation1). Genda and Abe therefore argue\nthat, with an ocean, most of the atmosphere\n(and most of the noble gas) is lost in\ngiant impacts. Because they were there, the\nnoble gases provide the best test of their\nhypothesis.\nThe authors take the minority view that\nbound water was common to all the building\nblocks of Earth and Venus, so that from the\nstart the protoplanets each had their own\noceans and atmospheres, and independent\nlives as infant Earths. A more popular view\nis that Earth and Venus became wet while\nstill accreting, but only because they were\nstruck by cold, wet protoplanets ejected\nfrom what is now the asteroid belt6; with\nmodest revision, however, Genda and Abe's\nhypothesis could apply in this context\nas well.\nTo distinguish between Earth and Venus,\nGenda and Abe invoke the runaway green-\nhouse effect7. On worlds nearer the Sun,\nwater evaporates into a thick atmosphere,\nwhereas on more distant worlds it condenses\nas oceans and ice sheets. With oceans, the\nbuilding blocks of Earth lost much more of\ntheir primary atmospheres than did the\nbuilding blocks of Venus. In this way, Genda\nand Abe's model can account for Venus\nnews and views\nNATURE|VOL 433|24 FEBRUARY 2005|www.nature.com/nature\nHuman immunodeficiency virus\nRefolding the envelope\nPeter D. Kwong\nHIV has evolved to avoid neutralization by human antibodies. New\natomic-level details reveal that such evasion involves substantial\nrefolding of its exterior glycoprotein.\nhaving 70 times more argon than Earth.\nOf course there are caveats. Genda and\nAbe stress low-velocity collisions that merge\nthe two protoplanets. A broader assessment\nof impact geometries and velocities suggests\nthat most giant impacts are bounces, rather\nthan mergers, in which both bodies emerge\nslightly smaller (and much hotter) amidst a\nspray of silicates5. In a high-speed bouncing\nimpact between unequal planets,the smaller\none could easily lose both its crust and its\natmosphere.\nBut the big problem with gravitational\ncapture of nebular noble gases is the abun-\ndance of neon. The neon:argon ratio on\nVenus, Earth, Mars and meteorites is in-\nvariably about 1% of what it is in the Sun8.\nExplaining this requires both a heroic\ntheory of selective neon escape9 and some\nluck to make the neon:argon ratio always\ncome out the same. It may work better to\nstart from some other source of noble gases\nthat discriminates against neon -- say,\nextremely low-temperature condensates\nthat quantitatively trap argon10 (neon\nfreezes only if hydrogen freezes), or noble\ngas implantation by the solar wind into\nunaccreted grains and boulders11-13. If you\nmerely wish to bury the argon, there is no\nlimit to how much.\nThe new work offers a fresh look at plan-\netary accretion. The argument that oceans\nspeed the loss of atmospheres is more\nbroadly applicable than the authors imply.\nIt need not be restricted to atmospheres of\nsolar composition acquired gravitationally;\nand it need not be restricted to water\noceans or even liquid oceans. It applies\ngenerally during or before the giant-impact\nstage of accretion,and it could apply to satel-\nlites of the outer Solar System as easily as\nto Earth.\n■\nKevin Zahnle is at the NASA Ames Research Center,\nSpace Science Division, MS 245-3, Moffett Field,\nCalifornia 94035-1000, USA.\ne-mail: kevin.j.zahnle@nasa.gov\n1. Genda, H. & Abe, Y. Nature 433, 842-844 (2005).\n2. Lissauer, J. J. Annu. Rev. Astron. Astrophys. 31, 129-174 (1993).\n3. Chen, G. Q. & Ahrens, T. J. Phys. Earth Planet. Int. 100, 21-26\n(1997).\n4. Genda, H. & Abe, Y. Icarus 164, 149-162 (2003).\n5. Agnor, C. & Asphaug, E. Astrophys. J. Lett. 613, 157-160 (2004).\n6. Morbidelli, A. et al. Meteorit. Planet. Sci. 35, 1309-1320 (2000).\n7. Nakajima, S., Hayashi, Y. & Abe, Y. J. Atmos. Sci. 49, 2256-2266\n(1969).\n8. Pepin, R. O. Icarus 92, 2-79 (1991).\n9. Zahnle, K. J., Kasting, J. F. & Pollack J. B. Icarus 84, 502-527\n(1990).\n10.Owen, T. et al. Nature 402, 269-270 (1999).\n11.Wetherill, G. Icarus 46, 70-80 (1981).\n12.Sasaki, S. Icarus 91, 29-38 (1991).\n13.Ballentine, C., Marty, B., Lollar, B. S. & Cassidy, M. Nature 433,\n33-38 (2005).\nA\ndefining feature of HIV is the ability\nto thrive for a decade or more\ndespite sustained and vigorous\nimmune attack. How does the virus remain\nable to infect host cells at the same time as\nevading immune surveillance? The solution\nresides largely in the molecular trickery of a\nsingle viral protein, gp120 -- the compo-\nnent of the 'spikes' on the viral surface that\nbinds to receptors on host cells.\nTantalizing new details of this trickery are\nrevealed on page 834 of this issue1, where\nChen and colleagues report the structure of\nthe unliganded (receptor-free) form of\ngp120. Comparison with the previously\ndetermined structure2 of gp120 in complex\nwith one of its cell-surface receptors reveals\nthat receptor binding induces roughly half\nof the protein to refold. Like a trick jigsaw\npuzzle that can form two entirely different\npictures, the refolding preserves pieces of\ngp120's secondary structure, but reshuffles\ntheir location and relative orientation.In the\nviral spike, this reshuffling moves pieces of\nprotein by more than 40 A, rivalling the\nlargest changes ever observed for a single\nprotein domain.\nSoon after HIV was identified as the aeti-\nological agent of AIDS, it became clear that\nalthough infection prompts the human body\nto produce a large number of HIV-reactive\nantibodies, they are mostly ineffective at\nneutralizing the virus3. The machinery\nbehind HIV's remarkable evasion involves a\nprotective membrane around the virus and\nan ordered, two-receptor mechanism of\nentry into cells. The membrane is derived\nfrom a previous host cell and forms the outer\nsurface of HIV -- its envelope.The only viral\nproteins that protrude through this mem-\nbrane are the envelope glycoproteins, gp120\nand gp41: three copies of each make up a\nviral spike.\nThe two-receptor mechanism involves\nthe virus first binding to the CD4 glyco-\nprotein on the surface of a potential host\ncell. This binding induces changes in gp120\nthat permit it to interact with a second cell-\nsurface receptor,or co-receptor4,5.This mech-\nanism is not essential for viral propagation,\nNature Publishing Group\n(c) 2005\n\nnews and views\nNATURE|VOL 433|24 FEBRUARY 2005|www.nature.com/nature\nas variants that do not require CD4 for entry\n(CD4-independent isolates) can be obtained\nin vitro6. Rather, the mechanism appears to\nbe necessary for immune evasion, as alter-\nations in gp120 that lead to CD4 indepen-\ndence are invariably linked to increased\nsensitivity to neutralization by antibody.\nThe upshot of all this is that, in HIV iso-\nlates that resist neutralization, gp120 can\nexist in two quite different states. Before it\ninteracts with the cell surface, it is highly\nresistant to antibody binding -- hidden by\nthe overlapping defences of steric occlusion,\nconformational masking and glycan (sugar)\nshielding7-9. After binding to CD4, gp120 is\nprimed for interaction with other proteins,\nincluding the co-receptor. In this 'CD4-\ninduced'state,it would in theory be sensitive\nto antibody binding.But the sensitizing trig-\nger occurs at the interface between the virus\nand the host cell, and the close proximity to\nthe cell membrane sterically inhibits anti-\nbody binding10.\nThe structure of gp120 before CD4 bind-\ning has been sought for almost 20 years,\nbut the machinery that prevents antibody\nbinding also inhibits the lattice interactions\nnecessary for X-ray analysis. In a technical\ntour de force, however, Chen and colleagues1\nhave now been able to grow crystals of an\nunliganded gp120 core, build an atomic-\nlevel structure, model the expected orien-\ntation of the unliganded gp120 in the\nviral spike, and outline a pathway for how\nCD4 binding triggers large conformational\nrearrangements.\nThe results show that the unliganded\ngp120 attaches to the rest of the viral spike\nthrough a highly hydrated inner domain,\nsuggesting that it would retain considerable\nflexibility in the assembled spike. Sequence-\nvariable regions from neighbouring gp120s\npoint towards each other; by interlocking\nto restrict gp120 movements, they provide\na means for the variable regions to control\nconformational masking8.\nN-linked glycans cover much of the\nsurface of gp120 that would be expected to\nform the spike's outer face, and one can\nenvisage them forming a shield to prevent\nantibody binding9.Much of the glycan has an\nordered structure, implying that glycans at\nhigh density may display a limited range of\nconformations. Structural elements needed\nto bind the gp120 co-receptor -- elements\nthat, when assembled together, would in\ntheory be sensitive to antibodies -- are\nspatially separated in the unliganded struc-\nture, and only assemble upon CD4 binding\n(Fig. 1). All of these details lay the ground-\nwork for understanding how gp120 in the\nviral spike can evade antibodies.\nSeveral issues remain. First, the relation-\nship between the monomeric form of gp120\nstudied by Chen and colleagues and the\noligomeric form in the viral spike is unclear.\nDoes oligomeric gp120 fold into a different\nconformation? Possibly so:secondary-struc-\nture analysis11strongly predicts that portions\nof gp120 that are involved in co-receptor\nbinding should have -helical structure,\nbut they adopt mostly -strand configura-\ntions in the unliganded1 and CD4-bound2\nstructures.Second,the unliganded structure\ndoes not contain regions of the protein\nthat govern protein-protein interactions in\nthe spike.\nSo it remains to be seen how spike inter-\nactions fix gp120 in such a way as to allow\nCD4-induced rearrangements while pre-\nventing antibody binding. A complete\nunderstanding of antibody resistance may\nrequire snapshots not only of each confor-\nmation of gp120,but of the entire spike.\nThe classic 'before' and 'after' images of\nthe fusion peptide of influenza virus being\nthrown 100 A towards the host-cell mem-\nbrane shattered the staid notion of proteins\nhaving a single unique manner of folding12.\nSuch extensive refolding seemed,however,to\nbe a special facet of the process of fusing viral\nand host-cell membranes during viral entry\n-- a process requiring large overall molecu-\nlar movements. The newly revealed 'before'\nimage of gp120 now shows that HIV deploys\nextensive refolding not only for fusion but\nalso to evade neutralization by antibody.\nParadoxically,however,the refolding that\nprotects HIV from antibodies may also be a\nsource of vulnerability. One consequence of\nfolding into more than one conformation is\nthat dual packing restraints may leave empty\npockets or cavities.Both the unliganded and\nthe CD4-bound gp120 structures contain\nunusual pockets. One such pocket in the\nunliganded structure is,Chen and colleagues\nfind, the binding site for a recently discov-\nered class of\nviral-entry inhibitors13.\nAlthough the authors' unliganded gp120\ncrystals are not suitable for structure-based\ndrug design, tinkering with lattice contacts\nand with this site of inhibitor binding may\npermit suitable complex crystals to form.\nIn terms of vaccine design, the structure\nof unliganded gp120 reveals the envelope at\nits potentially most vulnerable. This is the\nstate before attachment -- before occlusion\nat the cell interface -- where HIV should be\nmost accessible to antibody binding.But this\nis also the state in which the virus uses\nits full arsenal of tricks to evade antibody\nneutralization.\nThe details revealed by Chen and col-\nleagues will enable each of these tricks to be\nprobed by the increasingly sophisticated\ntools of protein design, to fix or expose\notherwise transient or occluded sites of\nantibody binding. Will such modified\nenvelopes -- based on the unliganded struc-\nture -- be capable of eliciting broadly\nneutralizing antibodies? In addition to alter-\ning the way we view receptor binding, this\nstructure1 opens the envelope on these and\nother experiments.\n■\nPeter D. Kwong is at the Vaccine Research Center,\nNational Institutes of Health, 40 Convent Drive,\nBethesda, Maryland 20892, USA.\ne-mail: pdkwong@nih.gov\n1. Chen, B. et al. Nature 433, 834-841 (2005).\n2. Kwong, P. D. et al. Nature 393, 648-659 (1998).\n3. Weiss, R. A. et al. Nature 316, 69-72 (1985).\n4. Feng, Y. et al. Science 272, 872-877 (1996).\n5. Wu, L. et al. Nature 384, 179-183 (1996).\n6. Kolchinsky, P. et al. J. Virol. 73, 8120-8126 (1999).\n7. Wyatt, R. et al. Nature 393, 705-711 (1998).\n8. Kwong, P. D. et al. Nature 420, 678-682 (2002).\n9. Wei, X. et al. Nature 422, 307-312 (2003).\n10.Labrijn, A. F. et al. J. Virol. 77, 10557-10565 (2003).\n11.Rost, B., Yachdav, G. & Liu, J. Nucleic Acids Res. 32, W321-W326\n(2004).\n12.Bullough, P. A., Hughson, F. M., Skehel, J. J. & Wiley, D. C.\nNature 371, 37-43 (1994).\n13.Lin, P. F. et al. Proc. Natl Acad. Sci. USA 100, 11013-11018\n(2003).\nFigure 1 Molecular tricks of HIV. a, Before HIV attaches to the surface of a host cell, its surface spikes\n(one of which is shown here) are accessible to antibodies, but protected by numerous viral defences.\nThese include N-linked glycans (blue), which cloak the three gp120 glycoproteins (pink and grey\novals) and three gp41s (triangular plate) that make up a spike. b, Chen and colleagues1 find that\nattachment to the cell's CD4 protein induces roughly half of the gp120 glycoprotein molecule to\nrefold. This refolding is highlighted for two -ribbons (red), which rearrange (green) to form part of\na site that allows binding to a second receptor, the co-receptor. c, The crowded virus-cell interface\nprotects the assembled co-receptor-binding site from antibodies.\nNature Publishing Group\n(c) 2005"
    },
    {
      "category": "Resource",
      "title": "toner_2006.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-410j-projects-in-microscale-engineering-for-the-life-sciences-spring-2007/69255c8af42342072202fb0357965fb8_toner_2006.pdf",
      "content": "PAPER\nwww.rsc.org/loc | Lab on a Chip\nA microfluidic device for practical label-free CD4+ T cell counting of HIV-\ninfected subjects\nXuanhong Cheng,a Daniel Irimia,a Meredith Dixon,b Kazuhiko Sekine,a Utkan Demirci,a Lee Zamir,b\nRonald G. Tompkins,a William Rodriguez*bc and Mehmet Toner*a\nReceived 19th September 2006, Accepted 2nd November 2006\nFirst published as an Advance Article on the web 24th November 2006\nDOI: 10.1039/b612966h\nPractical HIV diagnostics are urgently needed in resource-limited settings. While HIV infection\ncan be diagnosed using simple, rapid, lateral flow immunoassays, HIV disease staging and\ntreatment monitoring require accurate counting of a particular white blood cell subset, the CD4+\nT lymphocyte. To address the limitations of current expensive, technically demanding and/or\ntime-consuming approaches, we have developed a simple CD4 counting microfluidic device. This\ndevice uses cell affinity chromatography operated under differential shear flow to specifically\nisolate CD4+ T lymphocytes with high efficiency directly from 10 microlitres of unprocessed,\nunlabeled whole blood. CD4 counts are obtained under an optical microscope in a rapid, simple\nand label-free fashion. CD4 counts determined in our device matched measurements by\nconventional flow cytometry among HIV-positive subjects over a wide range of absolute CD4\ncounts (R2 = 0.93). This CD4 counting microdevice can be used for simple, rapid and affordable\nCD4 counting in point-of-care and resource-limited settings.\nIntroduction\nOf the 40.4 million people infected with HIV globally, more\nthan 35 million live in developing countries with significant\nresource limitations, many of whom are in urgent need of\ndiagnosis, monitoring and antiretroviral therapy.1 In the\nprocess of managing HIV-infected subjects, counts of a specific\nwhite blood cell population, CD4+ T lymphocytes, have\nproven to be essential biological indicators.2 In adults, the\nabsolute number of CD4+ T cells per microlitre of blood has\ncritical prognostic and therapeutic implications, and is used for\nboth HIV staging and treatment decisions.3-5 Regular\nmonitoring of CD4 counts--two to four times per year--is\nrecommended for all stages of infection, prior to the need for\nantiretroviral drugs and during lifelong treatment.6 Clinically,\na CD4 count below 200 cells mL21 establishes the diagnosis of\nAIDS,7 and in most settings is used to initiate antiretroviral\ntreatment (ART) and prophylaxis against opportunistic\ninfections.8 Higher CD4 count thresholds of 350 and 500 cells\nmL21 are widely used to increase the intensity of monitoring,\nand in some settings, to initiate ART. However, affordable\nand appropriate laboratory monitoring tools to determine\nCD4 counts have little penetration in resource-limited settings,\ndespite ongoing international efforts to extend the availability\nof ART to these areas.9\nCurrently, the gold standard for CD4+ T cell enumeration is\nflow cytometric counting of lymphocyte subpopulations using\nmonoclonal antibodies and commercial multi-purpose flow\ncytometers, such as the FACSCalibur (Becton Dickinson) or\nEPICS XL (Beckman Coulter), or single-purpose CD4\ncounting flow cytometers, such as the FACSCount (Becton\nDickinson).10-13 Although high throughput and accurate, the\ncost and technical requirements for operation and mainte\nnance of these instruments have limited their reach and\nsignificantly delayed the implementation of HIV treatment\nprograms in resource-limited areas worldwide.14 Smaller\ninstruments like the Guava EasyCD4 offer limited improve\nments and have not been widely adopted. Non-cytofluoro\ngraphic methods, including ELISA format15 and bead format\nassays16,17 have been suggested as useful alternatives for CD4+\nT lymphocyte quantification, since these methods require less\nequipment and have lower reagent costs than flow cytometry.\nHowever, they have much lower throughput, are more labour-\nintensive and less accurate, and are not widely used or\nrecommended by World Health Organization guidelines.\nIn addition, improvements on the back-end aspects of CD4\ncounting--such as miniaturization of equipment--do not\naddress the most problematic issue for resource-limited\nsettings, which is sample preparation. The requirements to\ncollect blood by venipuncture, to lyse erythrocytes, to\ncentrifuge samples, or to use pipettes for any step in the\ndiagnostic assay are extremely problematic in these settings.18\nRecently, Rodriguez et al. tested a prototype CD4 counting\ndevice designed for resource-limited settings, in which capture\nof leukocytes and imaging of the CD4+ subset were carried out\non a membrane within a miniaturized flow cell.19 This device\nstill required sample preparation, including labelling of the\nblood samples, and fluorescence-based detection for imaging\nand counting.\n170 | Lab Chip, 2007, 7, 170-178\nThis journal is The Royal Society of Chemistry 2007\nHarvard-MIT Division of Health Sciences and Technology\nHST.410J: Projects in Microscale Engineering for the Life Sciences, Spring 2007\nCourse Directors: Prof. Dennis Freeman, Prof. Martha Gray, and Prof. Alexander Aranyosi\n\nAmongst the new technologies with growing impact in\nmedical diagnostics and global health, microfluidics and\nminiaturized lab-on-a-chip-type devices are extremely attrac\ntive for blood analysis.20 Beyond biochemical assays on the\nprotein level,21,22 new capabilities for analysing blood cells in\nmicrofluidic devices are emerging.23,24 Although promising,\nmost of these microfluidic devices are only compatible with\nmodel cell systems or require extensive sample preparation\noutside the device.25,26 In this paper, we present the develop\nment of a functional microfluidic device (Fig. 1) for whole\nblood CD4 counting that requires no sample handling or\nspecific labelling. Operation of the device is based on a new cell\nisolation strategy discovered in our lab, in which effects of\ndifferential flow select the binding of cells on an antibody\nsurface from whole blood. It is operated by directly injecting\n10 mL of whole blood at a controlled flow rate, followed with\nrinsing non-specific cells from the microfluidic chamber and\ncounting all the captured cells within the chip. Close agreement\nin CD4 counts was observed between the microchip measure\nments and conventional flow cytometry results for CD4 counts\nup to 800 cells mL21. This micro-device can be used with a\nsimple light microscope, such as those widely used for malaria\nsmears, to form a low-cost, rapid, CD4 cell counting system\nappropriate for resource-limited settings. Demonstration in\nour study of cell analysis from unprocessed whole blood of\nHIV+ subjects represents, to our knowledge, the first practical\napplications of microfluidics in blood diagnostics based on cell\nsurface markers, and opens new potential for microfluidic\ntechnology.\nMaterials and methods\nMaterials\n3-Mercaptopropyl trimethoxysilane was purchased from\nGelest (Morrisville, PA). Ethanol (200 proof), glass coverslips\n(35 6 60 mm, no. 1), hemacytometer and microslide field-\nfinder were obtained from Fisher Scientific (Fair Lawn, NJ).\nFor chamber fabrication, SU-8 photoresist and developer were\nobtained from MicroChem (Newton, MA); silicone elastomer\nand curing agent were obtained from Dow Corning (Midland,\nMI). Phosphate buffered saline (PBS) was obtained from\nMediatech (Herndon, VA). Lyophilized bovine serum albumin\n(BSA) was obtained from Aldrich Chemical Co. (Milwaukee,\nWI). The coupling agent GMBS (N-y-maleimidobutyryloxy\nsuccinimide ester) and NeutrAvidin were obtained from\nPierce Biotechnology (Rockford, IL). Biotinylated mouse\nFig. 1 Microfluidic devices used in the study and operating procedure of the counting device. (a) Schematic depiction showing the operating\nprocedure of the CD4 counting device. The microchip is operated by injecting 10 mL whole blood at controlled flow rate. This is followed with\nrinsing unbound cells from the chamber and counting all the captured cells within the chip using an optical microscope to obtain CD4 counts. (b)\nPhotograph of a linear cell count device. Microfabricated PDMS devices with one inlet and one outlet were bound to glass slides to form closed\nchambers. The chamber was functionalized with specific antibody to capture target cells from whole blood. The shaded area indicates the chamber\nlocation within PDMS. (c) Geometry of the Hele-Shaw device. The Hele-Shaw device offers a linear variation of shear along its central line. It was\nused in this study to screen the optimal shear stress for cell capture. (d) Geometry of the linear cell count device. The linear device has a volume of\n10 mL for sample volume metering. It was operated under the optimized shear stress to capture and numerate the target cells.\nThis journal is The Royal Society of Chemistry 2007\nLab Chip, 2007, 7, 170-178 | 171\n\nanti-human anti-CD4 (clone 13b8.2) was purchased from\nBeckman Coulter (Somerset, NJ). Biotinylated mouse anti\nhuman anti-CD36 (clone SMO) was obtained from Ancell\n(Bayport, MN). Alexa Fluor1 488-conjugated mouse antibody\nto human CD4 (AF488-anti-CD4, clone 289-14120), Alexa\nFluor1 647-conjugated mouse antibody to human CD3\n(AF647-anti-CD3, clone 289-13801) and 49-6-diamidino-2\nphenylindole (DAPI) were obtained from Molecular Probes\n(Eugene, OR). Phycoerythrin (PE)-conjugated mouse anti\nhuman CD14 monoclonal antibody (PE-anti-CD14, clone\nM5E2) was purchased from BD Bioscience (San Diego, CA).\nParaformaldehyde was obtained from Electron Microscopy\nSciences (Hatfield, PA).\nChamber design and fabrication\nTwo types of microfluidic devices were used in this work. The\nfirst one was the Hele-Shaw chamber (Fig. 1c) designed based\non the equations derived by Usami et al.23,27 The shape of\nthe chambers is such that the shear stress along the axis of\nthe chamber decreases linearly along the chamber length. The\nfabricated flow chambers were 43 ¡ 1 mm in height with inlet\nwidth and total length of 5 mm and 50 mm, respectively. The\nHele-Shaw devices were used to study the dynamics of\nlymphocyte attachment to microdevices using healthy donor\nblood, since multiple shear rates can be obtained in each flow\nchamber without changing the inlet flow rates. The second\ntype of device was a straight flow channel (Fig. 1d), which\nprovides a constant shear stress along the channel length and\nhas a footprint of 2 cm2. The width, length and height of the\nchannel were 4 mm, 51 mm and 50 ¡ 1 mm respectively. The\nstraight channel device was used for actual cell capture and\ncounting experiments, using the operating shear stress\ndetermined from the Hele-Shaw experimental data. The\ndevices were fabricated in PDMS and bonded permanently\nto clean glass cover slips using standard clean room\ntechniques.23,27\nSurface modification\nFreshly fabricated devices were modified using the method\ndescribed previously.23,27 Briefly, the chambers were pretreated\nwith 4% (v/v) solution of 3-mercaptopropyl trimethoxysilane\nin ethanol for 30 min at room temperature, followed with\nincubating the chambers with 0.01 mmol mL21 GMBS in\nethanol for 15 min at room temperature. Afterwards,\nNeutrAvidin was immobilized to GMBS by incubating the\nchamber surfaces with 10 mg ml21 NeutrAvidin solution in\nPBS for at least 1 h at 4 uC. Finally, 10 mg mL21 biotinylated\nanti-CD4 solution in PBS containing 1% (w/v) BSA and 0.09%\n(w/v) sodium azide was injected to react at room temperature\nfor 15 min. After each step, the surfaces were rinsed with either\nethanol or PBS, depending on the solvent used in the previous\nstep, to flush away unreacted molecules.\nStudy subjects and blood preparation\nHealthy HIV-negative and HIV-infected subjects were\nrecruited from the Massachusetts General Hospital (MGH)\nin Boston. All subjects provided written informed consent.\nSamples of 5 mL of peripheral blood were collected by\nvenipuncture in either heparin or EDTA Vacutainer\ncollection tubes (Becton Dickinson). All samples were run\non the microfluidic devices on the day of blood collection.\nParallel measurement of CD4 counts of the HIV infected\nsubjects were taken through standard clinical laboratory\noperating procedures, as described previously.19 Briefly,\npatient samples were processed in the hospital clinical\nlaboratory using standard 4-color flow cytometry on a\nBecton Dickinson FACSCalibur, using the MultiTEST\nreagents and TruCOUNT beads and analysed using\nMultiSET software to obtain CD4 counts.\nMicrofluidic flow experiments\nIn experiments performed to develop the prototype micro-\ndevice, 300 ml of unprocessed whole blood from healthy\ndonors was introduced into the Hele-Shaw chambers at the\ndesired shear rates (5-40 ml min21) using a syringe pump\n(Harvard Apparatus PHD 2000, Holliston, MA). The volume\nof whole blood was chosen such that cell adhesion on the\nsurfaces reaches a pseudo-steady state, where no significant\nincrease of captured cells was observed as determined by both\nexamining the number of cells adhered on the surfaces and the\nblood samples collected from the device outlet. Immediately\nafter sample delivery, PBS containing 1% BSA (w/v) and 1 mM\nEDTA was flowed through the chamber at 40 mL min21 for\n5 min to rinse off the unbound cells. The cells were then fixed\non the surfaces by incubating with 1% paraformaldehyde,\nfollowed with incubating with an antibody mixture containing\nAF647-anti-CD3/AF488-anti-CD4/PE-anti-CD14 for 15 min.\nAfter rinsing off the unbound antibody with PBS containing\n1% BSA (w/v) and 1 mM EDTA, the number of adhered cells\nwere counted by placing a field finder under the chambers and\ncounting cells at select points along the device axis using an\ninverted microscope (Nikon Eclipse TE2000, Nikon, Japan).\nMonocytes were identified by staining with antibody to CD14,\nCD4+ T cells were recognized by CD3+/CD4+/CD142\nstaining, and the total number of adherent nucleated cells\nwere determined by staining with DAPI or direct observation\nunder the phase contrast microscope. For each point, three\nmeasurements were made, corresponding to three 1 mm 2\nsquares in that vicinity, and averaged. Images were obtained at\n106 magnification using fluorescein, rhodamine and Cy5\nexcitation/emission filters. DAPI staining was performed\nafterwards by incubating the surface-attached cells with\n300 nM DAPI in PBS at room temperature for 5 min and\nrinsing with PBS. The cells were counted either manually or\nusing Image J software (http://rsb.info.nih.gov/ij/). To avoid\ncompetitive binding between the capture antibody and the\nlabelling antibody, CD4 antibodies were selected to bind to\ndifferent epitopes.\nIn experiments performed to test the CD4 cell counting\ndevice, 10 ml of whole blood from healthy donors or HIV-\ninfected subjects was flowed into linear chambers at the desired\nflow rates (1-20 ml min21). After rinsing at a flow rate of\n20 ml min21 for at least 3 min using PBS containing 1% BSA\nand 1mM EDTA, cells adherent to the surface were stained\nusing the same antibody mixture and DAPI solution as\n172 | Lab Chip, 2007, 7, 170-178\nThis journal is The Royal Society of Chemistry 2007\n\ndescribed above for Hele-Shaw devices. Three minutes of\nrinsing was noted as the minimal amount of time to wash\naway all unbound cells, and longer rinsing has not been\nfound to affect captured cells. To determine CD4 counts\nfrom the microchips using HIV+ blood samples, the total\nnumber of adherent nucleated cells was counted throughout\nthe device by enumeration of DAPI stained cells or direct\nobservation under a phase contrast microscope. CD4 counts\n(cells l21) were calculated by dividing the total cell number\nby 10, the volume of blood samples processed through the\ndevice in microlitres. Sample flow-through and rinse buffer\nwere collected from the outlet of the device into Eppendorf\ntubes and centrifuged to concentrate the cells for flow\ncytometry.\nFlow cytometry analysis\nIn order to confirm the efficiency of the devices in depleting\ntarget cells from whole blood, aliquots of samples before and\nafter passage through the linear chamber devices were\ncollected and analysed using standard flow cytometry to\nquantify the percentage of CD4+ T cells. The flow cytometric\nmeasurements were performed on a FACSCalibur (Beckton\nDickinson Immunocytometry System (BDIS, San Jose, CA)\ninstrument using BD CellQuest Pro Software. The capture\nefficiency, or yield of the device was estimated from the ratio\nof the percentage of CD3+ CD4+ T cells in samples collected\nbefore and after passing the microfluidic device.\nStatistics and data analysis\nThe experiments performed with blood from healthy HIV-\nnegative subjects were repeated in at least 3 different devices at\neach condition. Data shown in Figs. 2, 3 and 4 represent cell\ncounts or flow cytometric measurements averaged over these\ndevices, and each error bar represents the standard error of the\nmean.\nResults\nDevelopment of a simple device for CD4+ cell separation from\nwhole blood using affinity isolation chemistry\nUsing device simplicity and accuracy as our key objectives, we\nidentified two key factors in our design criteria: the specificity\n(purity) and efficiency (yield) of CD4+ T cell capture in a\nlabel-free microfluidic device. We first tested how specific an\nanti-CD4-immobilized, BSA-blocked surface is in capturing\nCD4-presenting cells. Fig. 2a shows representative overlapped\nphase contrast images and anti-CD4 stained fluorescent\nimages (green) of cells from whole blood obtained from a\nhealthy, HIV-negative subject and adherent to anti-CD4\nfunctionalized surfaces. As shown, almost all captured cells\n(density y50-500 cells mm 22) stained positively for surface\nCD4 antigen. A control device lacking a specific cell capture\nantibody demonstrated 1-2 orders of magnitude lower cell\nattachment from whole blood (density , 5 cells mm22). Thus,\na surface functionalization scheme appeared successful in\nexclusively capturing CD4-presenting cells from unlabeled\nwhole blood samples.\nFig. 2 Effect of shear stress on cell adhesion in the Hele-Shaw\ndevices using whole blood from healthy subjects. (a) Representative\nimages of cells captured in the Hele-Shaw chamber at locations\ncorresponding to shear stresses of 0.4 (left), 1.7 (middle) and 5 dyn cm22\n(right). The image was created by overlapping a phase contrast\nphotograph and the corresponding fluorescence photograph. All the\ncells in the phase contrast image are stained positively (green) for the\nCD4 surface marker, but captured cell density is greatly dependent on\nthe shear stress. (b) Representative images of captured cells after CD4\n(green) and CD14 (red) staining at the shear stresses conditions as\ndescribed in (a). Both lymphocytes (CD4+CD142, green) and\nmonocytes (CD4+CD14+, yellow) were captured at the shear stress\nof 0.5 dyn cm22, but pure lymphocytes were captured at two higher\nshear stresses. (Bar: 100 mm) (c) Adhesion of CD4+ T cells (solid\ncircles), monocytes (empty circles) and other cells (solid triangles) in\nresponse to shear stress. Differentiated capture of monocytes and\nlymphocytes in response to shear was observed: a shear stress window\nbetween 1 and 3 dyn cm22 was optimal for CD4+ T cell adhesion,\nwhile monocyte adhesion drops significantly above 0.7 dyn cm 22\n(inset). The adhesion of other cells is minimal in the whole range of\ntested shear stress. (d) Composition of the surface captured cells as a\nfunction of shear stress. When shear stress is above 0.7 dyn cm 22,\n.95% of the surface captured cells are CD4+ T cells (solid circles). The\npurity of these cells drops quickly to less than 50% when shear stress\ndrops below 0.7 dyn cm22. In (c) and (d), each data point was repeated\nin 3 devices spanning different shear stress ranges; error bars represent\nstandard deviations in measurements within each experiment.\nThis journal is The Royal Society of Chemistry 2007\nLab Chip, 2007, 7, 170-178 | 173\n\nFig. 3 Dependence of capture yield on shear stress in a linear device evaluated by flow cytometry using 10 mL blood samples from healthy\nsubjects. (a) Flow cytometric analysis of a blood sample before CD4+ T cell isolation. The CD4+ T cells (CD3+CD4+) compose 29.67% of all\nlymphocytes. (b) Flow cytometric analysis of the same blood sample after CD4+ T cell capture in the device. The composition of the target cells in\nthe sample flow through dropped to 2.13% of all lymphocyte population after device capture. Ten microlitres of whole blood were injected into the\nlinear device at a shear stress of 1.7 dyn cm22. Cells were acquired in the gated lymphocyte population, and the quadrants were set up with an\nisotype-matched control. (c) Capture yield at different shear stress calculated from flow cytometric analysis. Nearly 95% of the target cells can be\nisolated from whole blood using shear stress in the range of 1 to 3 dyn cm22. The yield quickly drops to less than 85% out of this range. Each data\npoint was repeated in at least 3 devices. The error bars represent standard deviations in measurements within each experiment.\nMonocyte versus CD4+ T lymphocyte adhesion from whole\nblood\nIn circulating cells, CD4 molecules are present on both\nlymphocytes and monocytes, which cannot be differentiated\nby immobilized anti-CD4 alone. This can be observed in\nFig. 4 Distribution of CD4+ T cells along the linear cell capture\nchamber at two shear stresses. At 1.7 dyn cm22 (solid circle, yield nearly\n95%), captured cell density reaches maximum near the sample inlet. By\ncontrast, at 7 dyn cm22 (empty circle, yield y75%), the distribution of\ncells is fairly uniform along the device. The experiments were performed\nusing 10 mL of whole blood from healthy subjects. Each data point was\nrepeated in at least 3 devices. The error bars represent standard\ndeviations in measurements within each experiment.\nFig. 2b, where some of the CD4-presenting cells (stained green)\nalso stain with the monocyte marker CD14 (stained red). Thus,\nfor the purpose of enumerating CD4+ T cells alone, a\nsecondary selection mechanism has to be used to exclude\nmonocyte binding. We used shear stress for this purpose,\nconsidering the lower CD4 expression level on monocytes\nrelative to CD4+ T cells, as well as their size differences. To\nstudy the effect of shear stress on monocyte and lymphocyte\nadhesion, we used antibody-functionalized Hele-Shaw devices\n(Fig. 1c), which allows for an analysis of cell adhesion over a\nrange of shear stresses in a single experiment.23,27\nFig. 2c compares the adhesion profiles of monocytes (empty\ncircles) and CD4+ lymphocytes (solid circles) within a shear\nstress range of 0.15 to 5 dyn cm 22. Maximum adhesion of\nCD4+ lymphocytes occurs in a shear stress window between\n1 and 3 dyn cm 22. Within this region, roughly 500 cells\nadhered per square millimeter of area. The adhesion of CD4+\nT cells decreases rapidly outside of this shear stress window. In\ncontrast to lymphocyte adhesion on the anti-CD4 surface,\nmonocytes have a different dependence on shear stress (inset in\nFig. 2c). Monocyte adhesion drops from about 40 cells mm22\nto around 5 cells mm22 when the shear stress increases from\n0.3 to 0.7 dyn cm22, and remains below 5 cells mm22 when the\nshear stress is above 0.7 dyn cm22. We also plotted the number\nof other cells (the total number of adherent cells minus\nmonocytes and CD4+ T cells) adherent to the anti-CD4\nsurface (solid triangles in Fig. 2c). The non-specific cell\nnumber remained at a constant low level (,5 cells mm 22)\nthroughout the tested shear stress range.\nWhen the cell composition on the device surface is plotted\n(Fig. 2d), we observe that purity of surface captured CD4+ T\n174 | Lab Chip, 2007, 7, 170-178\nThis journal is The Royal Society of Chemistry 2007\n\nlymphocytes is more than 95% when the shear stress is above\n0.7 dyn cm22. Purity drops at shear stress below 0.7 dyn cm22\ndue mainly to the adhesion of monocytes under the low shear\ncondition; purity also drops slightly above 4 dyn cm22. Thus,\nshear stress is a powerful tool to differentiate specific adhesion\nof CD4+ T lymphocytes and monocytes.\nDevelopment of a cell counting device and determination of\ncapture efficiency\nIn the initial experiments, we demonstrated highly selective\ncapture of CD4+ T cells using a monoclonal antibody\nfunctionalized surface operated under differential shear stress.\nNext, we designed a straight channel device for efficient\nisolation of CD4+ T lymphocytes under fixed shear stress\nwithin the shear stress range optimised for pure CD4+ T cell\ncapture without contaminating monocytes (Fig. 1d). This\nsimple device had an internal volume of 10 mL, which serves as\na sample volume metering mechanism. The 10 mL volume\nallows for convenient delivery of a small-volume sample\nobtained from a study subject, and sufficient sample size for\nstatistically valid cell counts. The elongated chamber design\nincreases the interaction time of blood with the functional\nsurface.\nWe injected 10 mL of whole blood at shear stresses ranging\nfrom 0.2-7 dyn cm22 into the linear device, collected samples\nbefore and after flow through the chamber, and analysed them\nby flow cytometry to study the capture efficiency within this\ndevice. Representative quadrant analysis data from the\nlymphocyte window of blood samples before and after passage\nthrough the device at a shear stress of 1.7 dyn cm22 are shown\nin Figs. 3a and b. In this representative experiment, CD4+ T\nlymphocytes (CD3+ CD4+) comprised 29.7% of all lympho\ncytes entering the microfluidic channel (Fig. 3a); after selective\ncapture, this fraction dropped to 2.1% of lymphocytes exiting\nthe device (Fig. 3b), indicating retention of more than 90% of\nthe target CD4+ T cells within the device at this shear stress.\nSimilar experiments were performed at various shear stresses\nto study the effect of shear stress on capture efficiency (or\nyield) of CD4+ T cells in the linear device (Fig. 3c). We\nobserved that a shear stress window of 1-3 dyn cm 22 was\noptimal for efficient CD4+ T cell capture in the linear\nchamber, matching the results obtained using the Hele-\nShaw chamber (Fig. 2c). Within this shear stress window,\nnearly 95% of the CD4+ T lymphocytes were isolated with\npurity greater than 95%. Outside of this window, capture\nefficiency quickly dropped to 70-80%, along with a decrease in\npurity (Fig. 3c).\nWhen we evaluated cell distribution in devices operated at\ntwo shear stresses in and out of the optimal window, we\nobserved differences that help to explain the mechanism for\ntheir distinctive capture efficiency (Fig. 4). At a shear of\n1.7 dyn cm22, which yielded 95% target cells, a narrow cell\ndensity peak of around 200 adherent cells mm 22 was seen\nwithin 10 mm from the device inlet; this density quickly\ndropped below 20 cells mm 22 at greater distances from the\ninlet. In contrast, at a less efficient shear of 7 dyn cm 22\nsurface-captured cells remain at a relatively constant, low\ndensity throughout the length of the chamber. Thus, controlled\nshear flow in a simple, anti-CD4 functionalized device\n,\npromotes efficient and specific CD4+ T cell capture.\nCD4 counts from HIV-infected subjects using optimised, simple\nmicrofluidic devices\nAfter determining the optimal conditions for the device using\nblood from healthy donors, we next tested the devices using\nsamples obtained from HIV+ adult subjects. A ten-microliter\nsample of blood was introduced for 2 min at 5 mL min21,\nwhich corresponds to a shear stress of 1.7 dyn cm22. Next,\nbuffer was introduced at 20 mL min21, which corresponds to a\nshear stress of y7 dyn cm22, to remove monocytes and non\nspecific cells. CD4 counts were then determined from the total\nnumber of adherent cells, counted manually under a phase\ncontrast microscope; total assay time was under 10 min. We\ncompared these CD4 counts from our microdevice with results\nobtained from samples processed in parallel by flow cytometry\n(Fig. 5). For 13 adult study subjects with CD4 counts ranging\nfrom 26 to 1428 cells mL21 by flow cytometry, our results show\na close correlation between the two methods at CD4 counts up\nto 800 cells mL21 (n = 11, R2 = 0.93) respectively. At CD4\ncounts above 800 cells mL21, the microdevice cell counts are\nsignificantly lower than those obtained by flow cytometry,\nwhich likely reflects saturation of cell binding within the\nchamber.\nTo confirm these findings, we assessed the purity and yield\nof CD4+ T cells in the linear device using whole blood from\nHIV-infected subjects (Fig. 6a and b). Purity (or capture\nspecificity) was calculated by taking the ratio of CD4+ T cells\n(CD3+CD4+) to the total number of captured cells (DAPI+);\nyield (or capture efficiency) was defined as the ratio of\ncaptured CD4+ T cells to the sum of captured CD4+ T cells\nplus those lost in the flow through. For the 13 study subjects, a\nconsistent yield (.75%) was observed for CD4 counts up to\nFig. 5 Correlation of total cell counts in the linear microchip versus\nabsolute CD4 counts by flow cytometers, using whole blood from\n13 HIV+ adult subjects. A linear regression of the experimental data\n,\nfor absolute CD4 counts under 800 cells mL21 (n = 11) indicates good\ncorrelation between the two measurements (dash-dot line). The dash\nline represents an ideal 1 : 1 correlation between the two.\nThis journal is The Royal Society of Chemistry 2007\nLab Chip, 2007, 7, 170-178 | 175\n\nFig. 6 Purity and yield of captured CD4+ T lymphocytes in the linear\ncell count device using whole blood from 13 HIV-positive adult\nsubjects. (a) Purity of the surface captured CD4+ T cells as a function\nof the absolute CD4 counts. Purity was above 60% and fairly\nconsistent for absolute CD4 counts greater than 200 cells mL21. (b)\nYield of CD4+ T cells within the linear device as a function of the\nabsolute CD4 counts. Fairly consistent yield was observed for absolute\nCD4 counts up to 800 cells mL21. The dashed lines are drawn as a\nvisual guide.\n800 cells mL21; the yield started to drop for subjects with\nhigher absolute CD4 counts. Purity ranged from 60-90% for\nCD4 counts above 200 cells mL21. When the absolute CD4\ncount is below 200 cells mL21, poorer capture specificity was\nobserved (20-50%). Nevertheless, a clear cutoff was observed\nfor CD4 counts around 200 cells mL21, which is used clinically\nto discriminate relevant CD4 count thresholds. We also\nobserved that .90% of the non-target cells are monocytes\n(data not shown), which in the context of HIV infection may\nbe more adherent to an anti-CD4 functionalized surface than\nmonocytes from uninfected blood.\nDiscussion\nWe describe here a whole blood CD4+ T lymphocyte count\nassay using cell affinity chromatography in a microfluidic\nformat. The device was functionalized with a specific antibody\nfor affinity selection of target cells. Controlled shear stress\napplied in the microfluidic channel enabled specific and\nefficient selection of CD4+ T cells versus monocyte and\nother white blood cells from a small volume sample\ncompatible with fingerprick collection. To perform CD4\ncounts, 10 mL of unprocessed whole blood is injected into\nthe microfluidic channel at a controlled flow rate and CD4+ T\ncell counts are determined as the number of all captured cells\nusing a light microscope. The total assay time is less than\n10 minutes.\nOne critical factor for accurate CD4 counting using this\napproach is the specificity of cell capture. To achieve this, we\nused cell affinity chromatography with immobilized antibo\ndies, which are further blocked with BSA to reduce non\nspecific binding.28 Since CD4 is also expressed on monocytes,\nwe used shear stress as a secondary selection step to exclude\nmonocytes. We found that CD4+ T lymphocytes and\nmonocytes respond differently to shear stress on the functio\nnalized device surface, as preferential binding of lymphocytes\noccurs in a window of 1-3 dyn cm22; by contrast, monocytes\nbind optimally at lower shear stresses. Selective binding within\nthis window (1-3 dyn cm 22) may be accounted for by two\nreasons. First, compared to lymphocytes, monocytes express\nabout an order of magnitude less surface CD4, which reduces\nthe chance of antibody-antigen interaction, especially under\ndynamic flow conditions.29 Second, the larger size of mono\ncytes increases the shear force exerted on individual cells\n(which is roughly proportional to the square of cell diameter),\nresulting in decreased binding efficacy. These two factors allow\nfor differential binding of lymphocytes relative to monocytes.\nControlled shear stress is also shown to be critical for efficient\ncell capture. The capture efficiency is further promoted by the\nelongated channel geometry, which increases the interaction\ntime between target cells and the active surface area.\nWithin\nthe\noptimal\nlymphocyte-binding\nwindow\n(1-3 dyn cm22), the shear force exerted on a cell 10 mm in\ndiameter is y8-25 pN. This is of the same order as the binding\nforce of a single antibody-antigen pair.30,31 When the shear\nforce is above this level, up to two orders of magnitude drop in\ncell adhesion is observed. This observation implies that when\ntarget cells come into contact with the surface, cell-substrate\nattachment is initiated by the formation of a single antibody-\nantigen interaction32 and high membrane antigen density will\nfavor the opportunity of such interaction. A somewhat\nsurprising result was that the number of adherent cells also\ndecreases when the shear is dropped below 1 dyn cm22. This\ndecrease occurred when experiments were performed with\nwhole blood, but not with lysed blood (data not shown). We\nspeculate that erythrocytes play an important role in the\nreduction of target cell binding at the low shear stress range.\nErythrocytes have been known to induce margination of\nleukocyte flow in capillaries above certain flow rates.33,34 In\nour devices, margination is analogous to pushing the\nleukocytes to the floor and roof of the chamber. At low flow\nrates, the margination effect is not favored and the erythro\ncytes in whole blood could occupy most of the functional\nsurface and prevent antibody-antigen interactions. In lysed\nblood, cell-cell interaction is greatly reduced and leukocyte\n176 | Lab Chip, 2007, 7, 170-178\nThis journal is The Royal Society of Chemistry 2007\n\nsettling is driven mainly by sedimentation, which does not\ndecrease with reduced flow.\nAfter the single channel device was optimized with blood\nfrom healthy donors (95%+ purity and 90%+ yield), its\nperformance was tested with whole blood from HIV-infected\nsubjects. We found a slight decrease in the device performance\nwith samples from these subjects, which may be accounted for\nby several reasons. Interfering soluble factors in the serum of\nHIV-infected patients, such as soluble CD4,35 may compro\nmise the yield of captured cells. Other soluble factors including\ncytokines, chemokines and immune complexes36 may influence\nbehavior of blood cells.37-39 Leukocyte surface adhesion\nmolecules may be altered during HIV disease progression,36,40\nwhich may lead to elevated non-specific binding in our device.\nChanges on CD4+ T cell surfaces in HIV-infected subjects,\nsuch as down-regulation of CD4 receptors41 and binding of\ngp120,42 might also reduce the receptor-antibody interaction\nand decrease yield. Thus, it was not surprising to see both\npurity and yield drop when samples from HIV-infected\nsubjects\nwere\ntested\nin\nthe\nlinear\nchamber\ndevice.\nNonetheless, a linear relationship was observed for CD4\ncounts obtained by microchip and by flow cytometer in the\nclinically relevant range between 200 and 800 cells mL21. Thus,\nthe microfluidic device appears to be extremely useful for\nclinical decision-making and disease monitoring in resource-\nlimited settings. Further optimization of purity and yield\nshould lead to even higher levels of accuracy.\nThe application of a microfluidic device for CD4 counting\noffers the advantages of reduced sample volume, decreased\nreagent consumption, low fabrication cost and portability over\nconventional flow cytometric equipment. It uses a direct\nvolumetric method and functions as a single platform.\nMoreover, no reagents need to be added to the assay, as\nrequired in single-platform flow cytometry and other proposed\nmethods. Compared to the labor-intensive bead format assay\nand previously described miniaturized flow cell design,19 this\nmicrofluidic CD4 counting device directly addresses the\nsample preparation challenge faced in most resource-poor\nsettings. No sample preparation, such as lysing erythrocytes,\npipetting, or mixing with antibody reagents is required, so the\ndevice serves as a self-contained system. No differentiation of\nmonocytes from CD4+ T lymphocytes needs to be made\nduring microscope-based counting. All these advantages\ndirectly address the need of CD4 counting in a resource-\nlimited setting.\nConclusions\nWe demonstrate a simple, quick and inexpensive CD4+ T cell\ncounting device based on microfluidic cell affinity chromato\ngraphy operated under controlled shear stress. To our knowl\nedge, this is the first design with which CD4 counts can be\nperformed from a fingerprick sample of whole blood, without\neither sample processing or the addition of reagents. Minimum\nhandling procedures, rapid operation, simple device design\nand potential high-throughput detection makes this strategy a\npromising candidate for managing HIV patients in resource-\nlimited settings. We also note that CD4 counting is just one\napplication for devices of this type. The demonstration of\nspecific cell isolation with high efficiency using shear stress\ncombined with cell affinity chromatography could be applied\nto a number of applications where specific and efficient cell\nisolation is required.\nAcknowledgements\nWe thank Dr Shashi Murthy for help with the surface\nmodification protocol, Mr Octavio Hurtado for technical\nsupport with the microfabrication procedures and Mr Donald\nPoulsen for the schematic illustration. This work was partially\nsupported by the National Institute of Biomedical Imaging\nand Bioengineering under Grant No. P41 EB002503\n(BioMEMS Resource Center). Dr William Rodriguez was\nsupported by grants from the National Institutes of Health,\nthe Bill and Melinda Gates Foundation, and the Doris Duke\nCharitable Foundation.\nReferences\n1 AIDS Epidemic Update: December 2005, Joint United Nations\nProgramme on HIV/AIDS, World Health Organization,\nDecember, 2005, available at http://libdoc.who.int/unaids/2005/\n929173439X_eng.pdf, accessed 20th March 2006.\n2 Guidelines for the Use of Antiretroviral Agents in HIV-1-Infected\nAdults and Adolescents, Department of Health and Human\nServices, October 6, 2005, available at http://aidsinfo.nih.gov/\nContentFiles/AdultandAdolescentGL.pdf, accessed 20th March\n2006.\n3 W. A. Obrien, P. M. Hartigan, E. S. Daar, M. S. Simberkoff and\nJ. D. Hamilton, Ann. Intern. Med., 1997, 126, 939-945.\n4 J. W. Mellors, A. Munoz, J. V. Giorgi, J. B. Margolick,\nC. J. Tassoni, P. Gupta, L. A. Kingsley, J. A. Todd, A. J. Saah,\nR. Detels, J. P. Phair and C. R. Rinaldo, Ann. Intern. Med., 1997,\n126, 946-954.\n5 W. A. Obrien, P. M. Hartigan, D. Martin, J. Esinhart, A. Hill,\nS. Benoit, M. Rubin, C. Lahart, N. Wray, S. M. Finegold,\nW. L. George, G. M. Dickinson, N. Klimas, G. Diamond,\nS. B. ZollaPazner, P. C. Jensen, C. Hawkes, C. Oster, F. Gordin,\nA. M. Labriola, P. Spivey, T. Matthews, K. Weinhold, G. Drusano\nand M. J. Egorin, N. Engl. J. Med., 1996, 334, 426-431.\n6 Selection and Procurement of HIV/AIDS Diagnostics, PAHO\nTechnical Advisory Committee, January 2005, available at http://\nwww.paho.org/english/ad/fch/ai/Clinton%20HIV%20Initiative\nSelection%20&%20Procurement.pdf, accessed 20th March 2006.\n7 Centers for Disease Control and Prevention Revised classification\nfor HIV infection and expanded surveillance case definition for\nAIDS among adolescents and adults, in MMWR Morbidity and\nMortality Weekly Report, 1992, pp. 1-19.\n8 Patient Monitoring Guidelines for HIV Care and ART, World\nHealth Organization, 4 November, 2005, available at http://\nwww.who.int/hiv/pub/guidelines/patientmonitoring.pdf, accessed\n20th March 2006.\n9 Progress on Global Access to HIV Antiretroviral Therapy: An\nupdate on ''3 by 5'', World Health Organization, June, 2005,\navailable at http://www.who.int/3by5/fullreportJune2005.pdf,\naccessed 20th March 2006.\n10 P. Balakrishnan, M. Dunne, N. Kumarasamy, S. Crowe,\nG. Subbulakshmi, A. K. Ganesh, A. J. Cecelia, P. Roth,\nK. H. Mayer, S. P. Thyagarajan and S. Solomon, J. Aquir.\nImmune Defic. Syndr., 2004, 36, 1006-1010.\n11 K. Strauss, I. Hannet, S. Engels, A. Shiba, D. M. Ward, S. Ullery,\nM. G. Jinguji, J. Valinsky, D. Barnett, A. Orfao and L. Kestens,\nCytometry, 1996, 26, 52-59.\n12 T. N. Dieye, C. Vereecken, A. A. Diallo, P. Ondoa, P. A. Diaw,\nM. Camara, F. Karam, S. Mboup and L. Kestens, J. Aquir.\nImmune Defic. Syndr., 2005, 39, 32-37.\n13 S. Z. Josefowicz, L. Buchner, C. L. Epling, E. Sinclair and B. Bredt,\nCytometry, Part A, 2004, 59A, 124-124.\nThis journal is The Royal Society of Chemistry 2007\nLab Chip, 2007, 7, 170-178 | 177\n\n14 S. Crowe, S. Turnbull, R. Oelrichs and A. Dunne, Clin. Infect. Dis.,\n2003, 37, S25-S35.\n15 D. Carriere, J. P. Vendrell, C. Fontaine, A. Jansen, J. Reynes,\nI. Pages, C. Holzmann, M. Laprade and B. Pau, Clin. Chem., 1999,\n45, 92-97.\n16 S. Diagbouga, G. Durand, P. T. Sanou, H. Dahourou and\nE. Ledru, Trop. Med. Int. Health, 1999, 4, 79-84.\n17 E. F. Lyamuya, C. Kagoma, E. C. Mbena, W. K. Urassa,\nK. Pallangyo, F. S. Mhalu and G. Biberfeld, J. Immunol. Methods,\n1996, 195, 103-112.\n18 R. Pacifici, P. Zuccaro, A. Cozzi-Lepre, S. Di Carlo, A. Bacosi and\nA. Fattorossi, Clin. Biochem., 1998, 31, 165-172.\n19 W. R. Rodriguez, N. Christodoulides, P. N. Floriano, S. Graham,\nS. Mohanty, M. Dixon, M. Hsiang, T. Peter, S. Zavahir, I. Thior,\nD. Romanovicz, B. Bernard, A. P. Goodey, B. D. Walker and\nJ. T. McDevitt, PLoS Med., 2005, 2, 663-672.\n20 M. Toner and D. Irimia, Annu. Rev. Biomed. Eng., 2005, 7, 77-103.\n21 K. Sato, A. Hibara, M. Tokeshi, H. Hisamoto and T. Kitamori,\nAdv. Drug Delivery Rev., 2003, 55, 379-391.\n22 T. Chovan and A. Guttman, Trends Biotechnol., 2002, 20, 116-122.\n23 S. K. Murthy, A. Sin, R. G. Tompkins and M. Toner, Langmuir,\n2004, 20, 11649-11655.\n24 A. Sin, S. K. Murthy, A. Revzin, R. G. Tompkins and M. Toner,\nBiotechnol. Bioeng., 2005, 91, 816-826.\n25 C. Q. Yi, C. W. Li, S. L. Ji and M. S. Yang, Anal. Chim. Acta,\n2006, 560, 1-23.\n26 H. Andersson and A. van den Berg, Sens. Actuators, B, 2003, 92,\n315-325.\n27 S. Usami, H. H. Chen, Y. H. Zhao, S. Chien and R. Skalak, Ann.\nBiomed. Eng., 1993, 21, 77-83.\n28 M. Amiji and K. Park, J. Biomater. Sci., Polym. Ed., 1993, 4,\n217-234.\n29 B. Lee, M. Sharron, L. J. Montaner, D. Weissman and R. W. Doms,\nProc. Natl. Acad. Sci. U. S. A., 1999, 96, 5215-5220.\n30 Y. Harada, M. Kuroda and A. Ishida, Langmuir, 2000, 16,\n708-715.\n31 P. Hinterdorfer, W. Baumgartner, H. J. Gruber, K. Schilcher and\nH. Schindler, Proc. Natl. Acad. Sci. U. S. A., 1996, 93, 3477-3481.\n32 O. Tissot, A. Pierres, C. Foa, M. Delaage and P. Bongrand,\nBiophys. J., 1992, 61, 204-215.\n33 H. L. Goldsmith and S. Spain, Microvasc. Res., 1984, 27, 204-222.\n34 S. S. Shevkoplyas, T. Yoshida, L. L. Munn and M. W. Bitensky,\nAnal. Chem., 2005, 77, 933-937.\n35 M. Peakman, G. Senaldi, N. Foote, T. J. McManus and\nD. Vergani, J. Infect. Dis., 1992, 165, 799-804.\n36 J. A. Trial, H. H. Birdsall, J. A. Hallum, M. L. Crane,\nM. C. Rodriguezbarradas, A. L. Dejong, B. Krishnan,\nC. E. Lacke, C. G. Figdor and R. D. Rossen, J. Clin. Invest.,\n1995, 95, 1690-1701.\n37 S. Polo, F. Veglia, M. S. Malnati, C. Gobbi, P. Farci, R. Raiteri,\nA. Sinicco and P. Lusso, AIDS, 1999, 13, 447-454.\n38 M. Vonsydow, A. Sonnerborg, H. Gaines and O. Strannegard,\nAids Res. Hum. Retrov., 1991, 7, 375-380.\n39 M. Clerici, F. T. Hakim, D. J. Venzon, S. Blatt, C. W. Hendrix,\nT. A. Wynn and G. M. Shearer, J. Clin. Invest., 1993, 91, 759-765.\n40 J. Trial, J. A. Rubio, H. H. Birdsall, M. Rodriguez-Barradas and\nR. D. Rossen, J. Immunol., 2004, 173, 2190-2198.\n41 S. Anderson, D. C. Shugars, R. Swanstrom and J. V. Garcia,\nJ. Virol., 1993, 67, 4923-4931.\n42 M. Thali, C. Furman, E. Helseth, H. Repke and J. Sodroski,\nJ. Virol., 1992, 66, 5516-5524.\n178 | Lab Chip, 2007, 7, 170-178\nThis journal is The Royal Society of Chemistry 2007"
    }
  ]
}