{
  "course_name": "Project Appraisal in Developing Countries",
  "course_description": "This course covers techniques of financial analysis of investment expenditures as well as the economic and distributive appraisal of those projects. The course gives special consideration to cases in the developing world. Students will engage in a critical analysis of these tools and their role in the political economy of international development. The course will cover topics such as alternative planning strategies for conditions of uncertainty; organizations and project cycle management; the political environment; and interactions of clients and advisers, engineers, planners, policy analysts, and other professionals.\nIntroductory micro-economics is a pre-requisite for this course.",
  "topics": [
    "Business",
    "Finance",
    "Social Science",
    "Economics",
    "Financial Economics",
    "International Development",
    "Society",
    "The Developing World",
    "Business",
    "Finance",
    "Social Science",
    "Economics",
    "Financial Economics",
    "International Development",
    "Society",
    "The Developing World"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nCourse Description and Objectives\n\nThis is a practical course that teaches techniques of project evaluation with special consideration for the developing world context. It also provides a critical analysis of these tools and their role in the political economy of international development. The goal is to make students adept at using and managing project evaluation.\n\nStudents will first learn the financial analysis of investment expenditures and then proceed to the economic and distributive appraisal of such projects. Students will also consider:\n\nProject cycle management, preconditions and assumptions, and its iterative structure.\n\nAlternative planning strategies for conditions of uncertainty.\n\nOrganizational factors involved in developing new policies, choosing among alternatives, gaining acceptance, assuring implementation, and coping with unanticipated consequences.\n\nPolitical environment and the interactions of clients and advisers, engineers, planners, policy analysts, and other professionals.\n\nPre-requisites\n\nStudents should have introductory level of micro-economics.\n\nCourse Format\n\nClass will meet for lectures. Students will then practice applying the course material in problem sets. The teaching assistant will also be available to meet with students during his office hours for assistance with the assignments.\n\nAssignments and Grading\n\nThere will be five cost-benefit analysis problem sets and two shorter memos. Late submissions will be graded with a penalty.\n\nThe assignments will be graded according to the following weights:\n\nACTIVITIES\n\nPERCENTAGEs\n\nFive Problem Sets\n\n60%\n\nTwo Written Assignments\n\n40%",
  "files": [
    {
      "category": "Assignment",
      "title": "Case Study Memo Assignment: World Bank’s appraisal of the Three Cities Sanitation Project",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-484-project-appraisal-in-developing-countries-spring-2005/30426be14d05d1beab28926985bc0ce5_case_study_memo.pdf",
      "content": "11.484 Project Appraisal in Developing Countries\nSpring 2005\nProf. Annette M. Kim\n\nCase Study Memo Assignment:\nWorld Bank's appraisal of the Three Cities Sanitation Project\n\nRead the Project Appraisal Document for the World Bank's Three Cities Sanitation Project in\nVietnam, 1999, VN-PE-51553\n\nWrite a 5 page memo addressing the following points:\n\n* Carefully review the financial, economic, and risk analysis portions of the appraisal document,\nlooking in particular at the appropriate appendices. The appraisal finds that the proposed project\nis overall economically positive and should therefore be funded.\n\na) What are some key factors or assumptions that are driving the positive net result? (3 pts)\nHow justified are these assumptions in your opinion? (3 pts)\nb) What are some of the benefits and costs that have not been counted in this appraisal? (2 pts)\n\n* Discuss how the project's design influences and/or is influenced by the distributive issues and\ninstitutional dimensions that we have covered in the course. (4 pts)\n\n* In reviewing the document's risk and sensitivity analysis, some risks have been analyzed but\nof course projects are challenged by a wide variety of risks. Identify and discuss at least three\nother project risks that were not accounted for in the analysis. (3 pts)\n\n* Comment on the role that financial and economic appraisal seems to have in this project\ndocument. How important was it relative to the other components of the appraisal? Do you\nthink it helped determine its recommendation? (1 pt)\n\nTips:\n-The objective of the assignment is analysis: do not just list the numbers in the document or\nreview what they have done. If you think the document appraised an aspect well, explain why.\nIf not, identify potential problems and unjustified assumptions.\n- You can use a memo format to save space: bullet point the main points you want to express.\n\nDUE: Session 23\n\nSubmit your 5 page word document with 1\" margins, 10-12 point font, 1.5 spacing. Be prepared\nto discuss your memos in class."
    },
    {
      "category": "Resource",
      "title": "Final Essay",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-484-project-appraisal-in-developing-countries-spring-2005/afebe2f136e7a06bb26b73a4a2d2b110_final_memo.pdf",
      "content": "11.484 Project Appraisal in Developing Countries\nSpring 2005\nProf. Annette M. Kim\n\nFinal Essay\n\nThe cost benefit analysis tools covered in the course are supposed to give us a systematic way to\nhelp choose and design good projects. In this course, we have looked at both the usefulness and\nthe limitations of the techniques in development projects. As covered in the readings from class\nsession 20-26, write an essay about both the usefulness and limitations of using these tools. Give\nexamples and invoke ideas from the readings. What are some strategies to mitigate the\nlimitations?\n\nThe objective of this assignment is not to summarize the readings but to give you a chance to\nsynthesize in your own words and framework a few key lessons you have learned about how to\nuse cost benefit analysis responsibly.\n\nDirections: Submit on the class website your 5 page word document with 1\" margins, 10-12\npoint font, 1.5 spacing.\n\nDUE: Session 26"
    },
    {
      "category": "Assignment",
      "title": "Problem Set 1: Financial Cash Flows from Alternative Perspectives",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-484-project-appraisal-in-developing-countries-spring-2005/3f22cdf750c2973a8ae974cbdf05afa0_ps01.pdf",
      "content": "Spring 2005\nMIT 11.484 Project Evaluation in Developing Countries\nProfessor Annette M. Kim\n\nProblem Set 1:\nFinancial Cash Flows from Alternative Perspectives\n\nAppraisals of an Entertainment Media Loading Project\n\n1. The Department of Industry and Technology of the Government of Calm Island has started\nthe 'Industrial Park' scheme in Cresseda for the promotion of small and medium enterprises.\nThe scheme envisages the selling of 500 square meter plots of land at the end of 2006 to\nentrepreneurs. In 2007, they are expected to develop the land, build a workshed and install the\nnecessary machinery.\n\n2. Gulshan Poldofsky is currently the manager of a sales outlet for media recorders and DVDs in\nrented premises. He is expected to earn Rs 24,000 per annum through the year 2010. At the end\nof the year 2010, the machinery used in the outlet will be totally depreciated. Gulshan also has\nan open offer for a position in an electronics start-up where he will make Rs 20,000 per annum.\nHe is however considering a plan to join the Industrial Park scheme and set up his own\nentertainment media project.\n\n3. In December of 2006, the Department of Industry and Technology will purchase the land\nrequired for the project at the market price of Rs. 30 per square meter and then directly sell it at\nthe subsidized rate of Rs. 9 per square meter to the promoter. The cost of site development is Rs.\n3 per square meter. It is expected that this land can be sold at the price of Rs. 50 per square\nmeter in year 2015 when the project comes to a close and assets are liquidated. The cost of\nconstruction is Rs. 400,000 and equipment is Rs. 4,800,000. The construction works and\nequipment are expected to have useful lives of 20 years and 12 years respectively. The annual\nmaintenance expenses for construction works and equipment will be Rs. 100,000 from 2006\nonwards.\n\n4. Production will begin in year 2006 with 200,000 DVDs. From the following year, production\nwill go up by 25,000 per annum and it will stabilize in year 2010 when the production level\nreaches 300,000 DVD per annum. Gulshan will have to devote all his time to the project starting\nyear 2006 when production begins. He will not have to spend any time away from his current\noperations when the construction and installation works are being undertaken.\n\n5. The promoter will procure raw material on credit, and accounts payable at any time are\nexpected to be 8.25% of the annual cost of raw material. Any outstanding bills from year 2014\nwill be settled in year 2015. The purchase price of one jumbo sheet of raw recording media\nmaterial is Rs. 1 million. Each sheet will be used to produce 25,000 DVDs. The purchase price\nof DVD label lamination material is Rs. 16 per DVD. The manufacturing and packaging\nexpenses per DVD are Rs. 10.\n\n6. The sales price of a DVD is Rs. 70 and accounts receivable are expected to be 7.5% of sales\nrevenue. Cash balance requirements will be 4% of sales revenue. All outstanding receivables at\nthe end of year 2014 will be collected in year 2015.\n\n7. The promoter will be given financial assistance by the Industries Department in the form of a\nterm loan disbursed at the end of 2006 to cover the initial cost of land purchase, site\ndevelopment, construction and machinery. The loan will carry an interest rate of 7.5% per\nannum. Unpaid interest will be capitalized and added to the initial principal. Principal and\ninterest will be repaid in 7 equal installments starting in 2008.\n\n8. The plant is set up in 2007, production takes place from year 2006 to 2014 and liquidation\ntakes place in 2015.\n\nNOTE: Assume there is no price inflation.\n\nThe Assignment:\n\n1. Construct a table of parameters.\n\n2. Construct a loan schedule, showing the interest and principal repayments throughout the life\nof the project.\n\n3. Construct a 12-year financial cashflow profile (2006-2015) of the project from the point of\nview of the total invested capital. Calculate the net present value of the project using a discount\nrate of 9.5%.\n\n4. Construct a 12-year cashflow profile of the project from the owner's (promoter's) point of\nview. Calculate the net present value of the project using a discount rate of 11%. Is this an\nattractive project to the owner?\n\n5. Construct a 12-year cashflow profile of the project from the economy's point of view.\nCalculate the net present value of the project using a discount rate of 13%.\n\n6. Construct a 12-year cashflow profile of the project from the point of view of the Department\nof Industry and Technology's budget. (no need to calculate a NPV) How would the cashflow\nchange if the department owned the land instead of buying it?\n\n7. The promoter is concerned that the project benefits are sensitive to the price of DVD label\nlamination material and would like to investigate the issue. Conduct a sensitivity analysis to\ndetermine the effect of the price of DVD lamination material on the net present value of the\nproject from the promoter's perspective. (Start with a price of Rs. 14 and increase it by an\nincrement of Rs. 1 to a maximum value of Rs. 24) Is the project sensitive to the price of\nlamination material?\n\nHINT:\nTo calculate the equal installments for principal and interest repayments, use the @PMT function\nof the spreadsheet:\n\n@PMT (debt at beginning of Yr of repayment, interest rate, number of years of\nrepayment)\n\nFor example, if a loan is given at a rate of 8%, and the repayment is to start at the end of year 4\nand is to go on for 6 years, one would compute the annual installment as follows:\n@PMT (debt at the beginning of Yr 4,0.08,6)"
    },
    {
      "category": "Assignment",
      "title": "Problem Set 2: Discounting and Alternative Investment Criteria",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-484-project-appraisal-in-developing-countries-spring-2005/91cc8a9261884aed8c56cdfcd02b18d5_ps02.pdf",
      "content": "Spring 2005\nMIT 11.484 Project Evaluation in Developing Countries\nProfessor Annette M. Kim\n\nProblem Set 2:\nDiscounting and Alternative Investment Criteria\n\nPart A: Glass Bottle Unit\n\nThe Grsk Group of Industries envisages adding yet another product to their diversified portfolio.\nMs. Reem Grsk, Head of the Consultancy Group, has identified glass bottles as a product that\nwill be in high demand in the near future. There are two alternative strategies for investment in\nglass bottles. The group could either purchase a sick unit and rehabilitate it or set up an entirely\nnew unit. The estimated project life is 11 years.\n\nAlternative A: Making a sick unit viable\nThe Grsk group has identified an available sick glass-bottle plant. It can be made viable with a\nfew modifications. The expected cash outflows and inflows from this alternative are as follows:\n\nTable 1\n(Figures in NPs in Thousands)\nYear\nOutflows 103\n32.5 37\n46.5\n44.5\n\nInflows\n\nAlternative B: A New Unit\nIf a new unit is to be set up, the expected cash outflows and inflows are as follows:\n\nTable 2\n(Figures in NPs in Thousands)\nYear\nOutflows 145\n36.5 38\n39.5\n42.5 42.5\n\nInflows\n\n27.5\n\nIn either case, a loan will have to be taken from the Grsk Financial Services Ltd., a fully owned\ncompany of the Grsk Group which will charge a low rate of interest of only 6%.\n\nTo make a decision, Ms. Grsk has to calculate the NPV of the two alternatives. She is however\nnot certain whether the discount rate to be used is 8% or 10%.\n\nThe Assignment:\n\n1) If Ms.Grsk evaluates these alternatives using the two discount rates, which alternative would\nshe prefer in each case? Why? Briefly explain the logic of your answer from basic principles of\ndiscounting. Show your calculations using discount factors. (Check your answers with the\nNPV function of the spreadsheet.)\n\n2) One of Ms. Grsk's subordinates is of the view that it is more meaningful to compare the net\nfuture values of both alternatives at the end of year 12, as this is the year in which all the benefits\nand costs would have been realized. Although Ms. Grsk does not subscribe to this point of view,\nshe agrees to evaluate the alternatives on this criterion using a discount rate of 8%. Which\nproject would Ms. Grsk choose? Again, please show your calculations using discount factors.\n\n3) Another of Ms. Grsk's subordinates argues that the project choice might differ depending on\nthe year in which you calculated the net present (future) value. He suggests that the net future\nvalue should be calculated in year 2 when production starts. Calculate the net future value for\nboth projects in year 2 using an 8% discount rate. Do you agree with Ms. Grsk's subordinate?\nPlease explain.\n\n4) What is the relationship (if any) between evaluating the project return as of year 0, year 2,\nand year 12 for the two projects? (compare using the 8% discount rate).\n\nPart B: Project Selection\n\nMr. Samer Shammah is a fresh engineering graduate who has come into a large legacy. He\nwould like to invest these funds in the best possible manner. Based on certain market studies,\nhis consultant has shortlisted four projects. The first project is for Injection Moulding, the\nsecond is for Film Capacitors. The third is for Steel Pipes and the fourth one is for Computer\nSoftware. The four options are mutually exclusive, i.e. only one of the four can be implemented.\nThe opportunity cost of funds is 15.00%. Mr. Shammah has been advised to evaluate these\nprojects using the following four investment criteria:\n\na) Net Present Value (NPV)\nb) Internal Rate of Return (IRR)\nc) Ratio of net benefits to investment costs, and\nd) Ratio of gross benefits to total costs.\n\nMr. Shammah's consultant has constructed the following net cash flows (benefit minus cost) for\nthe four projects (Table III). Year zero represents the year of investment.\n\nTable III\n(NPs. in Thousands)\nYear\nInjection Moulding\n-3.25\n2.75\n2.60\n2.70\n2.55\nFilm Capacitors\n-11.25\n1.15\n1.20\n1.25\n2.40\n8.25\nSteel Pipes\n-10.00\n2.00\n2.25\n2.25\n2.25\n2.60\nSoftware Unit\n-3.50\n-2.00\n4.00\n3.60\n6.00\n1.75\n\nThe operating costs of these projects have been estimated as follows (Table IV). These figures\nhave already been taken into account in constructing the net cash flows of Table III.\n\nTable IV\n(NPs. in Thousands)\nYear\nInjection Moulding\n\n5.00\n5.50\n6.00\n6.50\nFilm Capacitors\n\n2.80\n2.90\n3.00\n3.20\n3.40\nSteel Pipes\n\n1.00\n1.05\n1.15\n1.25\n1.25\nSoftware Unit\n\n2.00\n2.25\n2.50\n3.20\n3.75\n\nThe Assignment\n1) Please rank the four projects using each of the four investment criteria mentioned above.\n2) Which project would you choose? Why?\n\nIn your answers to the above questions, clearly identify and discuss the merits (or demerits) of\neach of the different investment criteria.\n\nPART C\nEvaluation of Projects with Different Lengths of Life\n\nMr. Pedro Lopez is a progressive farmer and owns a farm house in \"Los Pozos\". He is looking\nat two alternative ways of farm irrigation. One option is to draw water from a nearby canal\nthrough a pop-up sprinkler system by constructing an underground network of polyurethane\npipes. The other option is to install a shallow tubewell which will also generate revenues\nthrough sale of water to the neighboring farms. The sprinkler system has a life of five years\nwhile the tubewell life is seven years. Each project is repeatable. The estimated net cash flows\n(benefit minus cost) are as below:\n\n(NPs. in Thousands)\nYear\nSprinkler\n-0.50\n0.45\n0.45\n0.45\n0.45\n-\n-\nTubewell\n-1.10\n0.50\n0.55\n0.60\n0.50\n0.40\n0.30\n\nThe two projects are strict alternatives. Due to future contingencies, it will not be possible to\nrepeat either of the projects more than once. When a project is repeated, the construction period\nin either case is one year. It is assumed that reinvestment cannot occur in the terminating year of\nthe previous project's life, but only in the year following termination.\n\nThe opportunity cost of funds is assumed at 10%.\n\nThe Assignment:\n\nWhat investment strategy will you recommend to Mr. Lopez? While comparing, be sure that the\nstrategies have the same length of time and the result should not be sensitive to which project is\nadjusted. The analysis should, therefore, be carried out twice; by adjusting the first project and\nthen adjusting the second."
    },
    {
      "category": "Assignment",
      "title": "Problem Set 3: Scale and Timing",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-484-project-appraisal-in-developing-countries-spring-2005/38bd3eb0775481b7dc246a907dc588f2_ps03.pdf",
      "content": "Spring 2005\nMIT 11.484 Project Evaluation in Developing Countries\nProfessor Annette M. Kim\n\nProblem Set 3:\nScale and Timing\n\nPart A: Scale--Power Plant for Industrial Park\n\nSituated in the foothills of the Andes is the city of Loma Linda, famous for the captivating\nbeauty of its landscape and meadows. To give an impetus to the economic welfare of this region\nwhile given due consideration to environmental effects, the government of Pluton has\nencouraged industrial projects in this area for the manufacture of electronic products because of\ntheir non-polluting nature. In an Electronics Industrial Park, about 200 electronic projects have\nbeen commissioned and another 80 projects are under implementation. Some plots are still\nvacant.\n\nThe industrial park is equipped with a 10 megawatt (MW) power plant to cater to the\nrequirements of the industrial units as well as the nearby residential colony. On average, the\npower requirement is 50 kilowatts (KW) per industrial unit and 1,000 KW for the colony. As a\nresult, there is a shortfall of about 1,000 KW of power, resulting in electricity rationing.\nMoreover, with the commissioning of an additional 80 projects within the year, this deficit would\nincrease to about 5,000 KW. (1 MW = 1000 KW).\n\nUnder the new economic policy which allows the private sector to generate, transmit, and\ndistribute electricity, Fernandez Power Company Pvt. Ltd. (FPCPL) has decided to set up a new\npower plant in the Loma Linda industrial park. The company belongs to a large diversified\nindustrial group and has a great deal of experience in installing captive power plants.\n\nMs. Gloria Fernandez, managing director of FPCPL, wants to find the optimal capacity of the\npower plant expressed in KW. The total cost of this power facility is made up of the capital cost\nof the power plant, the installation cost, and the cost of fuel and maintenance. The relevant\nparameters are:\n\n1. Capital costs (Ci) of the Power Plant are captured by the following equation:\n\nCi = C0 * [(Xi/X0)^L + N * {(Xi/X0)^M - 1}]\n\nwhere\n\nCi = Capital costs for power plant of size i\nC0 = Capital cost for the plant of base capacity = 100,000,000 Pesos\nXi = Plant capacity\n\nX0 = Base plant capacity = 3,000 KW\nL = 0.65\nM = 2.60\nN = 0.10\n\n2. Installation costs (ICi = IC0 * (Xi/X0)^H\n\nwhere\n\nIC0 = Installation cost for plant of base capacity = 6,000,000 pesos\nH is a parameter: H = 0.025\n\n3. The costs of fuel and maintenance are as follows:\n\nFuel cost (FC) per year,\nFCi = FC0 * (Xi/X0)^K\nFC0 = 250,000*p, where p, the cost of fuel/liter, is 6 Pesos\nK is a parameter; K = 0.90\n\nAnnual maintenance costs are 5% of the capital cost of the plant.\n\n4. Depreciation expense, residual value, and project life: Assume that the plant will have a\nuseful life of 15 years regardless of the number of the operating hours per year. Straight line\ndepreciation of the historical costs appropriately measures the declining value of this asset\n(annual depreciation = investment cost/years of life). Carry out your analysis for 10 years of\nplant operation. Assume investment occurs in year 0, the plant operates in years 1 through 10\nand liquidation occurs in year 11.\n\n5. Hours of generation per day: The plant will operate ten hours per day on average, since the\ncustomer electronics industry generally operates on single-shift basis.\n\n6. Days of generation per year: The plant will operate for 300 days per year on average.\n\n7. Tariff per unit of power: the company will charge 2.95 pesos per kilowatt-hour. These rates\nare comparable to the existing tariff of government-supplied power.\n\n8. The discount rate is 10% per annum.\n\n9. All values are in real terms.\n\nAssignment:\nAs a consultant, you have been asked to help Ms. Fernandez:\n\n1. Assess whether the base case is financially attractive.\n\n2. Calculate the NPV and IRR for the project at various scales from 3,000 KW to 10,000 KW, in\nsteps of 500 KW.\n\nBased on these calculations, what scale do you choose? Briefly explain your reasoning.\n\n3. Calculate the NPV and IRR of each increment to scale (i.e. the Marginal net present value and\nthe marginal internal rate of return.\n\nBased on these calculations, what scale do you choose? Briefly explain your reasoning.\n\n4. Is your choice in (2) the same as your choice in (3)?\n\nBriefly explain your answer with reference to the underlying relationships between the NPV, the\nMNPV, the IRR, and the MIRR.\n\nDiscuss whether the IRR is a reliable criterion for selecting the optimal scale? What is an\nappropriate decision rule(s) for selecting the optimal scale of a project?\n\n5. Show in one computer generated graph (ONE only) the relationships between these different\nmeasure by showing the discount rate and the NPV, the MNPV, the IRR, and the MIRR as a\nfunction of the scale of the plant.\n\nHints to expedite your work:\n1) After obtaining the pro forma cashflows, NPV and IRR for the base capacity,\nthen use the \"Data, Tables\" command in Excel to generate cashflows, NPVs, and IRRs for the\nother scales.\n\n2) To obtain the NPV and IRR of the incremental investments (MNPV and MIRR), subtract the\nundiscounted net cashflows of scale S from the undiscounted net cashflows of the next scale\n(S+1) from the previous table.\n\n3) Your spreadsheet is capable of generating graphs with two Y-axes: put NPV and MNPV on\none Y axis and IRR and MIRR on the other.\n\nPart B: Timing: Establishing a Lithotripsy Clinic\nDr. E. Rojas, director general of the Bolivar Post Graduate Institute (BPGI), Pluton, is examining\nthe feasibility of starting a lithotripsy service, utilizing a process by which kidney stones are\npulverized through shock waves without resorting to surgery. The process has become popular\nin other large cities over the past few years. The demand for treatment of kidney stones has been\nrising, and since surgical capacity is limited, there is already a long waiting list of patients at\nBPGI.\nIn view of the benefits of this method, Dr. Rojas has obtained the approval of the governing body\nto establish a lithotripsy clinic with an adequate number of lithotripters and supporting staff.\nThere are three different cost scenarios (see below), and the question before Dr. Rojas is when to\nset up the clinic in each case.\nIn Year 0, the capital cost would be 65 million pesos. Annual operating and training costs would\nbe 4 million pesos in Year 1.\nThe benefits of the lithotripsy clinic come from quicker treatment and the resultant increase in\nrevenue to BPGI. These benefits grow over time because of an expansion in market size that\nwill occur independently of when the clinic is established. The benefits, amounting to 10 million\npesos is Year 1, are expected to grow at the rate of 20% per annum.\nUse a discount rate of 8%.\nThe three scenarios are as follow:\nScenario 1: Neither the cost of the clinic nor the operating cost change over time.\nScenario 2: Over time, lithotripters and accessories begin to be assembled in the country, leading\nto a reduction in capital cost at the rate of 10% per annum. Operating and training costs, on the\nother hand, are expected to grow at 3% per annum.\nScenario 3: This is the same as Scenario 2, except that with rising demand, indigenous\nmanufacture of lithotripters accelerates, and the resulting economies of scale lead to a greater\ndecline in the capital cost at a rate of 20% per annum.\nAssignment\nFor each of the three scenarios, calculate the following:\na) The optimal year in which to invest.\nb) The change in NPV, if any, if the project is implemented in the optimal year rather than in\nYear 0."
    },
    {
      "category": "Assignment",
      "title": "Problem Set 4: Mexican Toll Road Project Case Memo",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-484-project-appraisal-in-developing-countries-spring-2005/1a188548edb20cbe0af9e014d65ef688_ps_4_risk_case_m.pdf",
      "content": "11.484 Project Evaluation in Developing Countries\n\nProblem Set 4:\nMexican Toll Road Project Case Memo:\n\nRead the Tribasa Toll Road Trust case.\n\nIt is 1993. While, the Mexican government's Secretariat of Communications and Transport\n(SCT) is eager to see private investors help finance infrastructure projects such as the Tribasa\nToll Road, it also has the responsibility to make sure they approve financing schemes that will\nnot jeopardize the services of the road which are crucial to the local economy.\n\nAs was mentioned in the case, the private investors, Grupo Tribasa, hired an international\nconsulting firm, URS Consultants to appraise the Tribasa Toll Road Trust Financing project.\nSCT has seen URS' report which recommended the project. But, upon further consideration,\nthey have decided to hire you, an independent consultant, to further appraise the project's\nviability (project point of view) before they make their decision on whether to approve the\nfinancing project. The only numbers they have given you to work with for your report are in the\ncase. Because URS' exhibits 5 and 6 in the original report were illegible, they provided\nduplicate copies in the attached Tables 12.2 (formerly Exhibit 5) and Table 12.3 (formerly\nExhibit 6) from the report. Exhibit 3 is also reprinted for you below for ease of reading.\n\nTable 12.2 is the Base Case financial projections. The footnotes contain the calculations\nassumed for line items for O&M, interest payments, withholding tax payments, and distribution\nto Grupo Tribasa. (The selected financial ratios indicate that net cash flow covers total debt\nservice each year at least 1.40 times. Revenues available for debt service cover total debt service\neach year at least 1.45 times. Base case coverages at these levels would be deemed adequate.)\n\nTable 12.3 shows the summary results of the sensitivity analysis that URS conducted. These\nprojections analyze what would happen in the case of reduced economic activity (REA). The\nREA case is more conservative than the base case. It assumes that employment grows more\nslowly than in the base case and as a result, the annual rate of traffic growth is about 1 percent\nslower in the REA case. Furthermore, in the REA case, inflation in Mexico is greater and the\npeso devalues more rapidly (relative to the dollar). Therefore, revenues are greater in the REA\ncase because higher inflation more than offsets the lower traffic volumes. But, the faster\ndevaluation of the peso also increases the amount of pesos that must be set aside to service the\nnotes denominated in dollars.\n\nThe Assignment:\nA, Reconstruct the Cashflows:\n\n1) Reconstruct the cash flows (showing figures in millions of pesos). On closer examination\nwe see that URS did a sloppy job in their analysis. They did not show the projections for\nthe year 2004 and some of their line items need to be re-calculated.\n\nLabel this cashflow \"Table 1: New Base Case Table\". You may want to use the \"define\nname\" function for parameters such as loan principal, discount rates, etc.\n\nSome missing figures for 2004:\nInsurance & Administration\n5.3\nInvestment Income\n6.1\nDeposit to MMA\n3.1\nPeriod inflation\n8.5%\nEnding Ps/US% Exchange Rate\n4.98\nREA Case NCF\nREA Case TDS\n155.11\n\nSome simplifying assumptions:\n- For the Operating and Maintenance line item, you can use the footnoted calculation of\n14% of net revenues instead of the numbers from Exhibit 4.\n- Investment income is guaranteed at the current amounts listed in Table 12.2 instead of\nthe calculation in the footnotes. However, all of these figures were converted from\ndollars at the current exchange rate.\n- The \"Interest payments\" line item was miscalculated in the previous tables. Re-\ncalculate: interest = remaining principal * coupon rate. Note that principal is paid of\nsemi-annually. Assume that the coupon rate is fixed during the life of the project.\n- Similarly, \"withholding tax payments\" needs to be re-calculated. This is the domestic\nincome tax on the interest payments that the note holders would have paid but the\nproject will pay instead. See the footnote for the calculations. Assume the tax rates do\nnot change.\n- For this assignment use only the Scheduled Amortization Payment Plan (payments\ncompleted by end of 2005 at which point the road is transferred to Mexico.). Re-\ncalculate these as well.\n\n2) Using a discount rate of 8% for the total investment point of view, what is the nominal\nNPV in the base case? What about in real terms? Note: First construct the cash flow\ntable in nominal terms, and then obtain the cashflow in real terms. Assume that the US'\nannual inflation rate is 2%.\n\n3) Now using a discount rate of 15%, look at Grupo Tribasa's point of view as an equity\nholder. They transferred their asset (the road) and their debt into the Trust. Their equity\ninvestment into this financing project was the rights to the toll road revenue. To simplify\nthe analysis, assume that their return is all the net proceeds (\"Period Cash Flow\") instead\n\nof the dividends calculated according to the restricted payment schedule in the contract.\nWhat is their nominal NPV and real NPV?\n\n4) Find the NPV of URS' REA case in nominal terms for total investment point of view and\nequity point of view (remember to use the TDS of URS' REA case to get the period cash\nflows for equity point of view). Label this (small) cashflow \"Table 2: URS' REA case\"\n\nB. Now conduct your own financial risk analysis:\n\n5) SCT is concerned about what inflation would do to the project's financial feasibility.\nExamine the project's risk to inflation. Assume traffic levels remain the same as in the\nbase case (demand is price inelastic) and that there are strict price controls on tolls due to\npolitical constraints. What would happen to the project's nominal and real NPV if\ninflation increased from both the total investment point of view and Tribasa's? SCT asks\nyou to analyze three annual rates of inflation increases: 10%, 15%, and 20%. (Hint: you\nwill also have to calculate new nominal exchange rates with a new relative inflation index\napplied to the previous real exchange rate). Please label this analysis \"Table 3: Inflation\nrisk\"\n\n6) Another thing SCT wants you to analyze is how sensitive the project is to changes in\nexchange rate since the project is engaging the international capital markets and will\ntherefore be denominated in foreign currency. What is the break-even exchange rate for\nTribasa? In other words, starting from the base case, how much would the peso have to\ndevalue in nominal terms in order for the project to be jeopardized (i.e. problems paying\nthe international debt)? Devalue the base case exchange rates by percentages and see\nwhat it does to the NPV. What happens to the NPV from the project point of view at\nTribasa's break-even exchange rate? Please label this \"Table 4: Exchange rate risk\"\n\n7) Now do a worst-case scenario. Pick both an inflation rate and an exchange rate that you\nthink are reasonable and see what happens to the project returns from both total\ninvestment and Tribasa's point of view. Please clearly identify the rates you have chosen\nand label the cashflow \"Table 5: Scenario analysis\"\n\nC. Write a memo to SCT that discusses the additional analysis you have done (mention all five\ntables). The maximum length of the memo is one page and less than 350 words (SCT will not\nread more).\n\nIn your memo, also discuss how robust the Tribasa Toll Road Trust financing project is to\nmacro-economic risks. Compare it to URS's study.\n.\n\nExhibit 3:\n\nScheduled Amortization Principal Payments\nyear\nJune principal pyt\n\n1,284,630\n\n2,210,660\n\n3,282,140\n\n4,344,160\n\n5,259,840\n\n6,192,170\n\n7,237,370\n\n8,739,840\n\n10,260,630\n\n8,590,560\nDec principal pyt\n\n1,384,650\n\n2,333,560\n\n3,436,150\n\n4,365,730\n\n5,278,220\n\n6,248,590\n\n7,355,510\n\n8,949,340\n\n10,647,280\n\n2,598,970"
    },
    {
      "category": "Assignment",
      "title": "Problem Set 5: Economic Appraisal of Nontradeable Projects",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-484-project-appraisal-in-developing-countries-spring-2005/c0032fa750775a63967bf0d8fd2f034d_ps05.pdf",
      "content": ""
    }
  ]
}