{
  "course_name": "Prototypes to Products",
  "course_description": "For students and teams who have started a sustainable-development project in D-Lab (EC.701J or EC.720J), Product Engineering Processes (2.009), or elsewhere, this class provides a setting to continue developing projects for field implementation. Topics covered include prototyping techniques, materials selection, design-for-manufacturing, field-testing, and project management. All classwork will directly relate to the students’ projects, and the instructor will consult on the projects during weekly lab time. There are no exams. Teams are encouraged to enroll together.",
  "topics": [
    "Engineering",
    "Mechanical Engineering",
    "Mechanical Design",
    "Systems Engineering",
    "Systems Design",
    "Science",
    "Earth Science",
    "Sustainability",
    "Social Science",
    "Economics",
    "Developmental Economics",
    "International Development",
    "Sociology",
    "Community Development",
    "Engineering",
    "Mechanical Engineering",
    "Mechanical Design",
    "Systems Engineering",
    "Systems Design",
    "Science",
    "Earth Science",
    "Sustainability",
    "Social Science",
    "Economics",
    "Developmental Economics",
    "International Development",
    "Sociology",
    "Community Development"
  ],
  "syllabus_content": "Course Meeting Times\n\nLecture and work sessions: 2 sessions / week, 1.5 hours / session\n\nClass Description\n\nFor students and teams who have started a sustainable-development project in D-Lab (\nEC.701J\n,\nEC.720J\n), the\nIDEAS Competition\n, Design for Demining (\nEC.S06\n), Product Engineering Processes (2.009), or elsewhere, this class provides a setting to continue developing projects for field implementation. Topics covered include prototyping techniques, materials selection, design-for-manufacturing, field-testing, and project management. All classwork will directly relate to the students' projects, and the instructor will consult on the projects during weekly lab time. There are no exams. Teams are encouraged to enroll together.\n\nRecommended Textbook\n\nUlrich, Karl T., and Steven D. Eppinger.\nProduct Design and Development\n. 3rd ed. New York, NY: McGraw-Hill, 2003. ISBN: 9780072471465.\n\nGrading Policy\n\nThis is a six-unit class: three hours a week will be spent in class and the remaining three hours will be spent doing homework and working on the design projects, both individually and in groups. Because much of the work for this seminar will be done during class time, attendance is essential. Students missing a class meeting should contact the instructor and their group to make up the work. Students may not miss more than two classes during the semester. This seminar is graded on an A/B/C/D/F basis, furthermore it is a class where your work is impacting the lives of people around the world and we expect an appropriate level of commitment.\n\nactivities\n\npercentages\n\nClass Participation and Attendance\n\n10%\n\nWeekly Progress/Updates\n\n15%\n\nHomework Assignments\n\n10%\n\nM1 Design Review\n\n25%\n\nFinal Design/Prototype\n\n15%\n\nM2 Final Presentation\n\n25%\n\nGroup Meetings and Weekly Updates\n\nRoughly one session each week will be largely dedicated to group work and will include progress reports and group consulting. Groups should come to class with a work plan for the class so they can get things done while they are together as a group. Groups will also need to schedule time for meetings outside of the class session.\n\nIntellectual Property Policy\n\nIn this class, you will be working on projects and inventions as individuals or in groups. All of MIT's intellectual property rules apply to any projects you work on during this class. For further information about these policies, you can contact the IP office directly. The Web site for the office is\nMIT Office of Intellectual Property Counsel\nand some of the policies on \"Ownership of Intellectual Property\" can be seen at\nInformation Policies\n.\n\nThat being (carefully) said, students can own the rights to their projects if they have not made significant use of MIT resources. The machine shop, library, desktop computers and so on are not considered significant MIT resources. It is unlikely that you will receive \"significant MIT resources\" (e.g. certain types and amounts of money) from this class. Unless you have received other resources from MIT outside of this class, it is unlikely that MIT will have any rights to the intellectual property you develop in this class. Please contact the IP office with any questions.",
  "files": [
    {
      "category": "Resource",
      "title": "Homework 1: Goals for Semester",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-s06-prototypes-to-products-fall-2005/cd5f8c4fede3c01c375cd76dcd488a38_MITEC_S06F05_hw1.pdf",
      "content": "Prototypes to Products, SP.724\n\nHomework #1, Project goals\n\nAssigned: Thursday 9/8/05\nDue: Tuesday 9/13/05\n\nDeliverables: One set of answers per team, bring a printed copy to use in class.\n\nProject name:\n\nAnswer the following: (in approx. 1 page)\n\nWhat are your big-picture goals for the semester?\nWhat level of prototype do you want to have at the end and what will you use it\nfor?\nWho do you want to see or use the prototype?\nWhat milestones will you complete?\nWhat are the greatest risks?\nWhat determines success?\n\nYour answers should be specific and measurable, so that at the end of the\nsemester you say if you have accomplished each thing with a \"yes/no\" answer.\n\nYour answers should be ambitious enough that if you accomplish them, you will\nbe very pleased with your progress for the semester and your project will be\nsignificantly farther along the development path than where it is now. Keep the\nbig picture in mind, and focus on doing things that get you closer to that.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nEC.S06 Prototypes to Products\nFall 2005\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Homework 2: Gantt Chart",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-s06-prototypes-to-products-fall-2005/cebc7ee5162aefc70b7873fb829f5806_MITEC_S06F05_hw2.pdf",
      "content": "Prototypes to Products, SP.724\n\nHomework #2, Project planning\n\nAssigned: Thursday 9/13/05\nDue: Tuesday 9/15/05\n\nDeliverables: One Gantt chart per team, bring a printed copy to use in class.\nEmail to instructor before class.\n\nGet access to a Gantt chart program that you can use for the rest of the\nsemester. Here are some options:\n- Download Gantt_auto-bars_short_v3-3.xls from\nhttp://www.hyperthot.com/pm_excel_gantt.htm\n- Microsoft project (~$600)\n- If you download a free trial for a program, make sure you will be able to\nuse it for the rest of the semester.\n\nFinish brainstorming tasks on Post-its and organizing them into groups.\n\nCome up with a list of major tasks and put them in order.\n\nMake a Gantt chart with the tasks down the right side, and the dates of the\nsemester across the top. Fill in dates for bars showing which tasks will be done\nwhen. Make sure that you believe what you put down, because this is the\nschedule that you will be following for the rest of the semester.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nEC.S06 Prototypes to Products\nFall 2005\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Homework 3: Detailed Schedule",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-s06-prototypes-to-products-fall-2005/72828908683aa7ede62b2ff7612cdc28_MITEC_S06F05_hw3.pdf",
      "content": "Prototypes to Products, SP.724\n\nHomework #3, three week schedule\n\nAssigned: Thursday 9/15/05\nDue: Tuesday 9/19 or 9/20 at your consulting session\n\nDeliverables: One schedule per team, bring a printed copy to the consulting\nsession. Email to instructor beforehand.\n\nCome up with a detailed list of things you plan to accomplish during the next 3\nweeks. This should be based on the first items in your Gantt chart. You can\nmake a mini Gantt chart if some things are dependent on other things (i.e.\ndesign, build, assemble), or a list of tasks if they can all be done in parallel (i.e.\npurchase items A-Z).\n\n(Note on Gantt charts, if an item is not dependent on another item, it should be\nlisted early on the Gantt chart. For example, building something from a piece of\nmetal has to come after you purchase the metal, but buying some paint for it can\ncome at the beginning, and does not have to wait until the item is built. Do things\nin parallel whenever possible. This will save time because you will not have to\nspend time waiting for the paint to be delivered when your item is otherwise\nready to go.)\n\nWrite down a clearly what is going to be completed each week (either using the\nGantt chart or due dates on your list.)\n\nThe tasks on the list should be bite sized and there should be many of them (5-\n10 items). If a task is going to take more than a couple of hours, break it up into\nsmaller tasks. The objective is to be able to check off tasks as you go, and see\nwhether you are on schedule. If you have one big task, \"do the project\", you\ncannot measure progress, delegate work if you have teammates, or tell when\nyou have finished. It is also much less intimidating to start a small task than a big\none.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nEC.S06 Prototypes to Products\nFall 2005\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Homework 4: Pugh Charts, Selection Matrices",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-s06-prototypes-to-products-fall-2005/481d1b5b65aad814f465773db54b1d6d_MITEC_S06F05_hw4.pdf",
      "content": "Prototypes to Products, SP.724\n\nHomework #4\n\nAssigned: Thursday 9/20/05\nDue: Parts of this are due each day for the next 3 weeks, please read carefully.\n\nPart 1: Thursday September 22:\n\nLinda Plano will be guest speaking. Answer the following questions. Short answers are\npreferable.\n\nToday it can be difficult to build a career directly related to Appropriate Technology even though\nthere is considerable need for it throughout the world. In this class, we want to explore options to\nachieve ongoing development and dissemination of AT. Many people believe that no one should\nmake a profit from AT, at least not for AT in the developing world. To explore this issue, think\nabout what you would want your life to be like if you were to make a career out of AT.\n\nFor the purposes of this exercise, assume that in five to ten years, you will have a spouse and\ntwo kids under the age of five and that you want to continue doing AT. Please answer the\nfollowing questions:\n- Financial Risk Tolerance\n- What's your risk tolerance? I.e., how much of your income would you be willing\nto risk if you were working on something you really care about?\n- What's your risk tolerance for your family*? If you are the sole provider, how\nmuch of their financial well-being are you willing to risk?\n- What's their risk tolerance? Do you think they would agree with you (OK, that's a\ntough one but I promise you'll need to deal with it one way or another if you get\nmarried)?\n- Lifestyle\n- What counts as a luxury? I.e., how much income do you need to have in order\nto have the lifestyle you want?\n- What counts as barely acceptable?\n- Values, Impact and Control\n- What are your values - personal, local, global? This is a huge question,\nobviously, but one that bears thinking about for your future. For the purposes of\nthis class, try to think about it in terms of AT: e.g., is it important to you that you\nget to work on AT because you enjoy it?; is it important that your community\nbenefits from and/or recognizes your efforts on your AT work?; is it important that\nyour work have a global impact? Or just that it is benign?\n\n- How critical is it that your work expresses those values?\n- Does it matter to you whether you are calling the shots? I.e., do you want\nsomeone else figuring out the overall strategy as long as you get to do hands-on\nwork, or vice versa?\nNote: There are definitely no right or wrong answers to this and related values questions. The\nmore honest you are, the better the chances that you will avoid a midlife crisis. Honest!\nPart 2: Tuesday, September 27 & Tuesday, October 4\nBen Linder will be consulting on your project. Bring in your Gantt chart, and your list of tasks. He\nwill be able to spend around 15 minutes on each project, so be ready to explain what you have\nbeen working on, and how it has been going. Be ready to ask questions if you are getting stuck\non anything. Use the feedback you get to adjust your tasks for next week.\nPart 3: Thursday October 6th\nJoost Bonson will be guest speaking. Come prepared with any questions about networking,\nbusiness questions, 50k competition, the Developmental Entrepreneurship class, etc.\nPart 4: Thursday, October 13th,\nProgress reports: Have a couple of power point slides discussing what you have done for the past\nfew weeks, and if your goals originally were different, why was there a difference? What your\nmajor goals are for the next 2 weeks?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nEC.S06 Prototypes to Products\nFall 2005\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Homework 5: Updated Gantt Chart, Funding",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-s06-prototypes-to-products-fall-2005/74b33760e01184c1683385a5eeea6111_MITEC_S06F05_hw5.pdf",
      "content": "Prototypes to Products, SP.724\nHomework #5,\nAssigned: Thursday 10/13/05\nDue: Tuesday 10/18/05\n1) Update Gantt chart and make a task list for the next 2 weeks\n2) Research the following grant opportunities and identify one (or\nmore) that is appropriate for your project. Find the one that is a best\nfit. Write down why it is a good fit for your project.\n3) If none of them are appropriate, explain very briefly why each one\ndoesn't fit, and see if you can find a different opportunity that was\nnot listed.\nOpportunities for funding around MIT\nName\nweb site\napplication deadline\nIDI Grants\nhttp://web.mit.edu/Edgerton/www/idi-summary.pdf\nrolling applications\nPSC Grants\nhttp://web.mit.edu/mitpsc/funding/psc.shtml\nrolling applications\nFellowship grants\nhttp://web.mit.edu/mitpsc/fellowships/\nOctober 21, 2005\nBaker Fellowship (must include\nfaculty member)\nhttp://web.mit.edu/baker-foundation/www/\nNovember 4, 2005\nIDEAS working grants\nhttp://web.mit.edu/ideas/www/index.htm\nNovember 14, 2005\n$1K competition\nhttp://50k.mit.edu/\nNovember 14, 2005\nGlobal social ventures\nhttp://www.socialvc.net/\nNovember 16, 2005\nCarroll Wilson award\nhttp://entrepreneurship.mit.edu/wilson_award.php\nJanuary 16, 2006\nThe Ignite Clean Energy Competition http://www.uml.edu/cvd/MA_Ignite_flyer.pdf\nMarch 1, 2006\nIDEAS working grants\nhttp://web.mit.edu/ideas/www/index.htm\nMarch 13, 2006\nIDEAS final application\nhttp://web.mit.edu/ideas/www/index.htm\nApril 19, 2006\nPHRJ Fellowships (summer)\nhttp://mit.edu/phrj/research_fellows.html\n?\nNCIIA Advanced E-Teams\nhttp://www.nciia.org/grants_eteam.html\nDecember 2, May 12\nother resources\nhttp://entrepreneurship.mit.edu/awards_scholarshi\nps.php\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nEC.S06 Prototypes to Products\nFall 2005\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Homework 6: Videotape Destruction",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-s06-prototypes-to-products-fall-2005/90913df05dbffde0743852a6536f2000_MITEC_S06F05_hw6.pdf",
      "content": "Prototypes to Products, SP.724\n\nHomework #6,\n\nAssigned: Thursday 10/18/05\nDue: Tuesday 10/20/05\n\nBring a VHS video tape to class next time. Do not buy them as a group, as\nwe want to have a variety of tapes to compare as we take them apart.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nEC.S06 Prototypes to Products\nFall 2005\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Homework 7: Final Goals",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-s06-prototypes-to-products-fall-2005/bb394efc733684ce86bebc12151477c1_MITEC_S06F05_hw7.pdf",
      "content": "Prototypes to Products, SP.724\n\nHomework #7, Final Objectives\n\nAssigned: Thursday 11/3/05\nDue: Tuesday 11/8/05\n\nDecide what your final goals for the end of the semester will be. You can use the\nsuggested goals for your project given to you in class, or you can re-write them.\nYour grade for the final project will be largely based on whether you completed\nwhat you set out to do here.\n\nDevelop 3-6 objectives for your project\n\nObjectives are concrete statements describing what the project is trying to\nachieve. Objectives should be written so that they can be evaluated at the\nconclusion of a project to determine if they were achieved. While goal statements\nare designed to be vague, a well-worded objective will be \"SMART\":\n- Specific: include a specific target or accomplishment\n- Measurable: establish a metric that indicates that an objective has been\nmet\n- Attainable/Realistic: make sure your objective is achievable given the\navailable resources\n- Time-bound: achieve objectives within a specified time frame (in this case,\nDecember 8th.)\n\nThe format for part of your final presentation can be a list of these objectives and\nproof that you completed them.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nEC.S06 Prototypes to Products\nFall 2005\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Lesson plan, Prototypes to Products, Day 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-s06-prototypes-to-products-fall-2005/acefbd7b181b1f5bf7692e4ea2473d08_MITEC_S06F05_lp1_2.pdf",
      "content": "Lesson plan, Prototypes to Products, Day 1\n\nProps\n\nCamera\n\nPrototypes\n- Mars foam core cage\n- Pick prods\n- Cardboard rocket\n- TacShot rocket\n- Flail head\n\nOn board:\n\nClass name, number\n\nTeam outline\n\nIndividuals' outline\n\nHandouts:\n\nSyllabus\n\nIP policy\nGrading Policy\n\nContact info\n\nSign in list\n\nTeam Selection cards (attached at end...)\n\nIntro (10 min)\n\nAgenda\nGoals\n- Get products into the field\n- Teach product design\n- All projects at different phases, no one plan, self motivation\n\nStudent introductions\n\nExplain team selection (5 min)\n- Get to know projects\n- Select appropriate projects for this class\n- Match students w/o projects to teams\n\nWrite outline on board\n\nTeams\n- Name of project\n- Brief description\n- Who is the target community / community partners\n\n- History of project, what has been done? (classes, contests, prototypes,\nprevious work etc.)\n- Long term goals\n- How many people on team, are you recruiting new team members?\n\nStudents w/o teams\n- Name, year, major (write on board)\n- Previous project experience / other experience\n- Why you are taking this class\n\n10 minutes to prepare\n\nStudent presentations (2-3 minutes each)\n\nPrototypes presentation\n- Looks like\n- Works like\n- Made like\n- Alpha\n- Beta\n- Manufacturing Prototype\n- Bad idea\n\nOptional discussion: What level of prototyping are you at?\n\nTeam selection cards (with emails)\n- \"I will email everyone with a list of which teams will be in the class and\nwho will be on which teams.\"\n- Drop date is today, please talk to me after class if you do not want to be\non a team\n\nHomework\n\nOptional: photos of students\n\nTeam Selection Cards\nTeam Name:\n\nCurrent members of team (in this class)\nName\nemail\n\nHow many new team members are you looking\nfor?\n\nList any new people you would like to join team\n(in order of preference)\n\nStudents w/o projects\n\nName:\n\nList 2-3 (or more) projects you would like\nto join, in order of preference:\n\nTeam Name:\n\nCurrent members of team (in this class)\nName\nemail\n\nHow many new team members are you looking\nfor?\n\nList any new people you would like to join team\n(in order of preference)\n\nStudents w/o projects\n\nName:\n\nList 2-3 (or more) projects you would like\nto join, in order of preference:\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nEC.S06 Prototypes to Products\nFall 2005\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Lesson plan, Prototypes to Products, week 2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-s06-prototypes-to-products-fall-2005/adf07a85c9f06ada1e8ac00101f08c85_MITEC_S06F05_lp2_1.pdf",
      "content": "Lesson plan, Prototypes to Products, week 2, Tuesday\n\nProps\n- Camera\n- Post its\n- Sharpies\n- Manioc presentation\n- Manioc grater\n- Amy's manioc grater\n- A Manioc\n- Tablecloth\n- Gantt chart software\n- Homework copies\n- C clamps\n\nHandouts:\nHomework copies\n\nLogistics\nSuccess vs. failure, \"failure\" is not a bad thing.\nCollect homework at end of class\nActivities\nManioc presentation\nBrain storming rules\nPost it exercise\nGantt charts\nGroup projects together.\n\nOptional activity\nTalk about lab notebooks\nPhotos of students\nHomework\nProject management HW#2\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nEC.S06 Prototypes to Products\nFall 2005\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Lesson plan, Prototypes to Products, Week 2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-s06-prototypes-to-products-fall-2005/304b2435a2352e58152461d32b07be94_MITEC_S06F05_lp2_2.pdf",
      "content": "Lesson plan, Prototypes to Products, Week 2, Thursday\n\nProps\n\nHandouts:\n\nFellowship info\nTax exempt form\nLogistics\n- Schedule consulting times\n- Mention my trip to Australia and plans for next 3 weeks, guest speakers,\nplease show up for all classes\n- Who wants to take a machine shop class?\n- Mention prize money for final presentations\n- Discuss fellowship applications\n- Bring work to class for days with a \"*\" on the syllabus\n\nActivities\n\nNotebooks\nBudget for the class $200/team\nHow to spend money, tax-exempt, reimbursements,\nWhat is worth spending money on?\nThink about resources\nResources Q&A, what do you need?\nDiscuss Gantt charts\n\nOptional activity\nStart on homework\nHomework\nSchedule and tasks for next 3 weeks\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nEC.S06 Prototypes to Products\nFall 2005\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Lesson plan, Prototypes to Products, week 6",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-s06-prototypes-to-products-fall-2005/5b8b5d04acd33b15d6c45963c95cf90c_MITEC_S06F05_lp6_2.pdf",
      "content": "Lesson plan, Prototypes to Products, week 6, Thursday\n\nProps\n\nHandouts:\nFund raising opportunities sheet\n\nThe attached list has several opportunities for you to apply for grants for your\nprojects. You should apply for at least one. You could raise some money, and it\nis also very helpful to have to explain your work and get feedback from people\noutside your projects. It helps raise awareness and helps make your project\nmore active in the MIT community.\n\nIf you are interested, please send me a copy of your application(s) and I would\nbe happy to look it over.\n\nLogistics\nMachine shop class, IDEAS generator tonight\nActivities\nProgress reports\nPlans for next 2 weeks, description of M1 review and goals\nHow to write a fundraising proposal\n\nOptional activity\nHomework\nCome up with schedule for next 2 weeks\nLook through grants and find one that is appropriate.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nEC.S06 Prototypes to Products\nFall 2005\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Lesson plan, Prototypes to Products, week 7",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-s06-prototypes-to-products-fall-2005/3687492a65e39e5c563fab5840ab0998_MITEC_S06F05_lp7_1.pdf",
      "content": "Lesson plan, Prototypes to Products, week 7, Tuesday\n\nProps\n\nHandouts:\n\nLogistics\nMachine shop class?\nActivities\n\nProgress reports\nDiscuss homework\nPlans for next 2 weeks, description of M1 review and goals\nConsulting time\n\nOptional activity\nHomework\nHomework 6, bring a video tape\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nEC.S06 Prototypes to Products\nFall 2005\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Lesson plan, Prototypes to Products, week 7",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-s06-prototypes-to-products-fall-2005/7e4228754ca18e1486fd36c84f7f1cb4_MITEC_S06F05_lp7_2.pdf",
      "content": "Lesson plan, Prototypes to Products, week 7, Thursday\nDFM\nProps\nTools\nSpare video tape\nUlrich and Eppinger book\nDFM presentation and projector\nHandouts:\n\nLogistics\n\nActivities\n\nTake apart video tapes\nDiscuss\nDFM presentation\nOptional activity\nHomework\nWork on projects\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nEC.S06 Prototypes to Products\nFall 2005\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Lesson plan, Prototypes to Products, week 8",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-s06-prototypes-to-products-fall-2005/5b6f61f0e217fd062af8f4b637064d26_MITEC_S06F05_lp8_1.pdf",
      "content": "Lesson plan, Prototypes to Products, week 8, Tuesday\nM1 Design review preparation\nProps\nPaper to layout poster boards\nHandouts:\n\nLogistics\n\nActivities\n\nMeeting the five most valuable people \"how to pitch our\ndesign review\"\nMake sure we don't waste their time or ours\nMake sure to bring the prototype as well\nElevator speech\nWhat would you want to hear about if you were a reviewer?\nWhat kind of feedback do you want?\nThese people might be giving you money at the end of the\nsemester\n\nBrainstorm what to put on poster boards\n\nGoal of project (new for next year, review \"what will make this project\nsuccessful\" from start of class)\nCustomer\nAccomplished to date\nPlans for rest of semester\n\nOptional activity\n\nHomework\nBring in poster boards if you want feedback on Thursday\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nEC.S06 Prototypes to Products\nFall 2005\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Lesson plan, Prototypes to Products, week 9",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-s06-prototypes-to-products-fall-2005/39f78fe9fa21033c48962ed376949af2_MITEC_S06F05_lp9_1.pdf",
      "content": "Lesson plan, Prototypes to Products, week 9, Tuesday\nM1 Design review\nProps\nName tags\nHandouts:\n\nLogistics\n\nActivities\n\nOptional activity\nHomework\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nEC.S06 Prototypes to Products\nFall 2005\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Lesson plan, Prototypes to Products, week 9",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-s06-prototypes-to-products-fall-2005/480b92366f1299de9adb94a5f81c771c_MITEC_S06F05_lp9_2.pdf",
      "content": "Lesson plan, Prototypes to Products, week 9, Thursday\n\nProps\n\nHandouts:\n\nFeedback forms\nMy comment forms\n\nSWOT page (attached below)\nLogistics\nemail list of homeworks completed\n\nActivities\nHand back feedback\nSWOT\nOptional activity\nHomework\n\nSWOT Analysis\n\nConduct a SWOT analysis and refine your objectives (30 minutes).\n\nA SWOT Analysis (SWOT = Strengths, Weaknesses, Opportunities, and Threats) is\nused to help teams review their project; understand their capabilities, resources, and\nrisks; and analyze their priorities. Strengths and Weaknesses refer to issues internal to\nthe team; Opportunities and Threats refer to issues external to the team.\n\nWhat are the Strengths within the team?\n\nWhat do we do well?\n\nWhat do we know or have already that can help us?\n\nWhat did the judges like about our project?\n\nWhat are the Weaknesses within the team?\n\nWhat do we do poorly, or don't know how to do?\n\nWhat concerns did the judges raise?\n\nWhat other internal limits do we face?\n\nWhat are the external Opportunities we have?\nWhat aspects of the situation that we're trying to help will make this a success?\n\nWho do we know who can help us make this a reality?\n\nWhat are the external Threats we face?\nWhat features of the community we're trying to help might hinder our work?\nAre there logistical issues beyond our control?\n\nNow, look at the overlaps between the internal strengths and weaknesses and the\nexternal threats and opportunities to help you decide on priorities.\n\nOpportunities\nThreats\nStrengths\nInvest: there's great overlap and\nthese areas you should definitely\npursue\nDefend: you can probably\nmobilize your resources to\nminimize these threats\nWeaknesses\nDecide: you have a choice, either\ninvest resources to prevent the\nweakness from ruining the\nopportunity, let the opportunity go,\nor collaborate to mitigate the\nweakness\nDamage Control/Divest: this is a\nrisky area that you need to\nmanage\n\nReview this SWOT analysis, thinking about your objectives and whether you need to\nrevise them based on this analysis. Overall, the SWOT is intended to make sure you're\nthinking about the project you're undertaking, to maximize your chances for success.\n\nSample SWOT Analysis for Sample Project\n\nStrengths\n1. Completed Proof of Concept (POC)\n2. Good sales case: low cost, fast, easy to use\n3. Patent just issued\n\nWeaknesses\n4. POC needs advanced features\n5. Low on $$\n6. Alan is too busy\n7. I don't like sales\n8. Need to partner with company with manufacturing capabilities\n\nOpportunities\n9. We have existing contacts\n10. Product area is hot right now\n\nThreats\n11. Finding a partner is proving difficult\n12. The competition may make something better soon\n13. POC is perceived as not capable enough\n\nOpportunities\nThreats\nStrengths\nInvest:\n1,2,3,10\nGood market and good\nposition\nDefend:\n\n2,3,11 - Use sales attributes\nand patent to attract partner\n\n1&12 - Get product out\nbefore field moves ahead\ntoo far\n\n2&13 Show value\nWeaknesses\n\nDecide:\n\n5, 7,8&9 Get existing contacts\nto help\n\n5 & 10 - Sell something with\nreduced features sooner\nDamage control:\n\n8&11 Get a partner \"or\nelse...\"\n\n3,12 &13 Get product started\nso we can concentrate on\nnew features\n\nSummary: Bold items indicate areas to focus on. Some basic ideas came up in\nmore than one box, so they are the most important, and create a coherent\nstrategy.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nEC.S06 Prototypes to Products\nFall 2005\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT Design for Demining Mid-project Review Sheet",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-s06-prototypes-to-products-fall-2005/a619d60b6f9e293287fb45b63b4b9621_MITEC_S06F05_m1_review.pdf",
      "content": "MIT SP.724 Prototypes to Products Mid-project Review Sheet\n\nReviewer Name\n______________________\n\nProject Name\n______________________\n\nPresentation\n0 - 1 - 2 - 3 - 4 - 5 (circle a number 0 to 5 or a \"-\")\n\n0 = No idea what they are talking about\n5 = Clear, concise, well organized, good content, quality materials\n\nComments:\n\nOpportunity\n0 - 1 - 2 - 3 - 4 - 5\n\n0 = Does not need to be done\n5 = This should be done, it's clear who needs it, meets an important need\n\nComments:\n\nApproach\n0 - 1 - 2 - 3 - 4 - 5\n\n0 = Barking up the wrong tree\n5 = Good, acceptable by community, addresses need, objectives achievable by mid\nDecember\n\nComments:\n\nComments\nA major concern:\n\nA major strength:\n\nOther:\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nEC.S06 Prototypes to Products\nFall 2005\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT Design for Demining Mid-project Review Sheet",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-s06-prototypes-to-products-fall-2005/8d4bbf33a7349d3b0cd0c508ed6cb85f_MITEC_S06F05_m2_review.pdf",
      "content": "MIT SP.724 Prototypes to Products Final Presentation Review Sheet\n\nReviewer Name\n______________________\n\nProject Name\n______________________\n\nPresentation\n0 - 1 - 2 - 3 - 4 - 5 (circle a number 0 to 5 or a \"-\")\n\n0 = No idea what they are talking about\n5 = Clear, concise, well organized, good content, quality materials\n\nComments:\n\nProgress since\nMid term\n0 - 1 - 2 - 3 - 4 - 5\n\n0 = Didn't do any perceptible work since Mid term\n5 = Showed goals from Mid term review and completed them\n\nComments:\n\nNext Steps\n0 - 1 - 2 - 3 - 4 - 5\n\n0 = This project will not get anywhere\n5 = Next steps were clearly stated, are doable, and will lead in the right direction\n\nComments:\n\nComments\nA major concern:\n\nA major strength:\n\nOther:\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nEC.S06 Prototypes to Products\nFall 2005\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "How would you allocate $1,000 among these projects?",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-s06-prototypes-to-products-fall-2005/a4d5676db86477ab9d7f035a5cc91d2b_MITEC_S06F05_final_grants.pdf",
      "content": "At the end of the semester (next week), we will be giving a modest amount of\ngrant funding to one or more of the projects that are presenting today. This\nmoney is to be used for the project(s) over the next year.\n\nIf you had $1,000 to give out to these projects, how would you split it up? You\ncould give it all to one project, split it up between the projects any way you want,\nor not give it all out.\n\nExample 1:\n\nProject 1: $0\n\nProject 2: $0\n\nProject 3: $1000\n\nExample 2:\n\nProject 1: $600\n\nProject 2: $100\n\nProject 3: $0\n\nPlease write how you would distribute:\n\nProject\nAmount\nMantra (Internet kiosks)\n$\nCell phone networking\n$\nSodis (Solar water disinfection)\n$\nTotal\n$\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nEC.S06 Prototypes to Products\nFall 2005\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}