{
  "course_name": "Protein Folding and Human Disease",
  "course_description": "This course covers amino acid sequence control of protein folding, misfolding, amyloid polymerization and aggregation. Readings and discussions address topics such as chaperone structure and function, folding and assembly of fibrous proteins, and pathologies associated with protein misfolding and aggregation in Alzheimer’s, Parkinson’s, Huntington’s and other protein deposition diseases. Students are required to write and present a research paper.",
  "topics": [
    "Science",
    "Biology",
    "Biochemistry",
    "Cell Biology",
    "Proteomics",
    "Virology",
    "Science",
    "Biology",
    "Biochemistry",
    "Cell Biology",
    "Proteomics",
    "Virology"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 3 hours / session\n\nPrerequisites\n\n7.51 Graduate Biochemistry\n, or permission of the instructor.\n\nCourse Description and Objectives\n\nThe primary goal of this course is to increase your knowledge of the world of protein folding, misfolding and aggregation, and their relationship to human disease.\n\nWe aim to give you a broad working knowledge of the problem and the multifaceted ways it determines the biological properties of living organisms. We will include protein structures and folding intermediates; in vitro analyses that provide essential concepts; off-pathway aggregation and amyloid formation; key chaperones and chaperonins; practical implications in biotechnology; the importance of model organisms; and, finally, special emphasis on human protein deposition diseases including Alzheimer's, Parkinson's and Huntington's disease. We will not attempt to be comprehensive. We will provide a framework for you to fill in, this year and in the future.\n\nA second goal is to help you develop your skills as a professional scientist.\n\nEffective written and oral communications are essential aspects of a successful research program. You will have the experience of reviewing in depth a topic of your choosing in the field. You will present the outcome of that review to the class in an engaging and well-organized oral presentation, and formulate a coherent, well written review in the style of a mini review for\nCell, JBC, Nature Reviews Molecular Cell Biology\netc.\n\nEstablishing a successful teaching and / or research program requires several types of mentorship: helping your students, postdocs, and colleagues to critically explore the literature, and improve their oral presentations, grants, and manuscripts. You have certainly had the experience of critically reviewing and discussing the literature, and that will be a continuing part of our course. You will also engage in peer review for both the oral and written presentations. This peer review process will occur a few days\nbefore\nyour colleague's presentation and ~ one week\nbefore\ntheir final paper is due--in time to make a positive difference for them.\n\nOverview of Assignments\n\nReadings, Questions and Presentation / Discussion:\nEach week you will read original research articles as well as background materials from texts and reviews. Read these before class and be prepared for meaningful discussion. For the first four weeks you will be guided by specific questions. You will be asked to prepare the presentation and discussion of the original research articles you have read.\n\nResearch on Individual Topics for an Oral Presentation and Final Paper:\nPick a specific topic to review in depth that intrigues and excites you. We have a variety of suggested topics for you, which we consider important for the class. If it happens that you have previously worked on a problem involving protein folding, we ask that you\ndon't\nuse that subject as your topic. (Our goal is to stretch your knowledge base while increasing ours.)\n\nGrading\n\nThe factors that weigh in your grade are:\n\nthe quality of your final paper & oral presentation, and\n\nyour class assignments - this includes leading and participating in class discussion of questions and research papers and your conscientious peer review of your colleague's oral presentations and final papers.\n\nParticipation\n\nYour participation makes all the difference in the world to the success of the class. Very importantly, you will mentor your fellow classmates to produce better oral presentations and better papers. Students who are slated to present on the same day will agree amongst themselves about the peer review process and on the order of presentation.",
  "files": []
}