{
  "course_name": "Quantum Physics I",
  "course_description": "This is the first course in the undergraduate Quantum Physics sequence. It introduces the basic features of quantum mechanics. It covers the experimental basis of quantum physics, introduces wave mechanics, Schrödinger’s equation in a single dimension, and Schrödinger’s equation in three dimensions. The lectures and lecture notes for this course form the basis of Zwiebach’s textbook Mastering Quantum Mechanics published by MIT Press in April 2022.\nThis presentation of 8.04 by Barton Zwiebach (2016) differs somewhat and complements nicely the presentation of Allan Adams (2013). Adams covers a larger set of ideas; Zwiebach tends to go deeper into a smaller set of ideas, offering a systematic and detailed treatment. Adams begins with the subtleties of superpostion, while Zwiebach discusses the surprises of interaction-free measurements. While both courses overlap over a sizable amount of standard material, Adams discussed applications to condensed matter physics, while Zwiebach focused on scattering and resonances. The different perspectives of the instructors make the problem sets in the two courses rather different.",
  "topics": [
    "Science",
    "Physics",
    "Quantum Mechanics",
    "Science",
    "Physics",
    "Quantum Mechanics"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 90 minute / session\n\nRecitations: 2 sessions / week, 1 hour / session\n\nPrerequisites\n\nStudents must have completed\n8.03 Physics III: Vibrations and Waves\nwith a grade of C or higher.\n\nDescription\n\nThe course is broadly divided into three parts:\n\nIn Part 1, we introduce the basic concepts: Interpretation of the wavefunction, relation to probability, Schrodinger equation, Hermitian operators and inner products. We also discuss wave-packets, time evolution, Ehrenfest theorem and uncertainty.\n\nPart 2 deals with solutions of the Schrodinger equation for one-dimensional potentials. We discuss stationary states and the key problems of a particle moving in: A circle, an infinite well, a finite square well, and a delta-function potential. We examine qualitative properties of the wavefunction. The harmonic oscillator is solved in two ways: Using the differential equation and using creation and annihilation operators. We study barrier penetration and the Ramsaur--Townsend effect.\n\nPart 3 begins with the subject of scattering on the half-line. One can learn in this simpler context the basic concepts needed in 3-dimensional scattering theory: Scattered wave, phaseshifts, time delays, Levinson theorem, and resonances. We then turn to three-dimensional central potential problems. We introduce the angular momentum operators and derive their commutator algebra. The Schrodinger equation is reduced to a radial equation. We discuss the hydrogen atom in detail.\n\nRequired Text\n\nGriffiths, David J.\nIntroduction to Quantum Mechanics\n. Pearson Prentice Hall, 2004. ISBN: 9780131118928.\n\nReferences\n\nShankar, Ramamurti.\nPrinciples of Quantum Mechanics\n. Plenum Press, 1994. ISBN: 9780306447907.\n\n(A conceptual textbook with many superb explanations.)\n\nCohen-Tannoudji, et al.\nQuantum Mechanics, Vols. 1 & 2\n. Wiley, 1991. ISBN: 9780471164333 and 9780471164357.\n\n(Useful for this course as well as for Quantum Physics II and III. Many students find it too encyclopedic.)\n\nLiboff, Richard L. _Introductory Quantum Mechanic_s. Addison Wesley, 2002. ISBN: 9780805387148.\n\n(A detailed and pedagogic textbook with many exercises.)\n\nGasiorowicz, Stephen.\nQuantum Physics\n. Wiley, 2003. ISBN: 9780471057000.\n\n(Efficient textbook, with plenty of material but little explanation.)\n\nDirac, Paul Adrien Maurice.\nThe Principles of Quantum Mechanics\n. Clarendon Press, 1982. ISBN: 9780198520115.\n\n(Deep, hard and rewarding. Not practical during the semester.)\n\nOhanian, Hans C.\nPrinciples of Quantum Mechanics\n. Prentice Hall, 1989. ISBN: 9780137127955.\n\nProblem Sets\n\nWeekly problem sets will normally be posted on Thursdays and be due the following Thursday or Friday by 5:00 pm. Solutions will be posted on the due date and graded problem sets will be handed out in recitation sections by the following Thursday.\n\nFor practical reasons, late homework will not be graded. For conflicts known in advance (such as religious holidays or travel) problem sets should be turned in before the deadline. Illness or emergencies must be documented if you want to excuse a late homework. To allow for unforeseen circumstances (such as work overload, an annoying headache, forgetting to turn in the p-set on time, etc, etc.) one problem set, either an omitted set or the one with the lowest score, will be removed from the calculation of the homework average.\n\nSitting down by yourself and reasoning your way through a problem will help you learn the material deeply, identify concepts that are not clear, and develop the analytical skills needed for a successful career in science. If you can solve the problems by yourself, you can expect to do well on the exams. After trying to solve a problem without success, seek help from staff or classmates. Many students learn a great deal from talking to each other. Identify what was preventing you from solving the problem and then solve and write up the solution by yourself.\n\nIt is a breach of academic integrity to copy any solution from another student or from previous years' solutions. Your solutions should be logical, complete, and legible. If you cannot present a solution clearly, it is likely that you do not understand it adequately. Graders are instructed not to give credit for unclear or illegible solutions.\n\nExams\n\nMastery of homework is intended to be the primary learning tool in preparation for exams. There will be two in class tests and one three-hour final exam.\n\nGrading\n\nThe relative weighting of exams and problems sets will be as follows:\n\nTotal grade = 75% Exam average + 25% Homework average\n\nExam average = 0.25 (Test 1 + Test 2) + 0.50 (Final Exam)\n\nThe course is not graded on a predetermined curve. If the class as a whole shows unusual mastery of quantum mechanics, the grades will be unusually high. Since we use absolute rather than relative standards, a student cannot lower his or her grade by helping classmates understand the material. Indeed, the process of explaining difficult concepts generally helps clarify and solidify one's own understanding.",
  "files": [
    {
      "category": "Assignment",
      "title": "Assignment 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-04-quantum-physics-i-spring-2016/b2fe9e6e2ddf53d15e42c920f766d873_MIT8_04S16_ps1_2016.pdf",
      "content": "Quantum Physics I (8.04) Spring 2016\nAssignment 1\nMassachusetts Institute of Technology\nPhysics Department\nDue R, February 11, 2016\nFebruary 4, 2016\n5:00pm\nAnnouncements\n- Please put you name and section number at the top of your problem set, and place\nit in the 8.05 box labeled with your section number near 8-395 by 5:00pm.\n- You may find it fun to read the first few pages of Dirac's book on Quantum Mechanics.\nProblem Set 1\n1. Radiative collapse of a classical atom. [10 points]\nIn a classical universe, we might try to build a hydrogen atom by placing an elec-\ntron in a circular orbit around a proton. We know, however, that a non-relativistic,\naccelerating electron radiates energy at a rate given by the Larmor formula:\ndE\ndt = -2 e2a2\n.\nc3\nHere e is the electron charge and a is the magnitude of the electron acceleration. So\nthe classical atom may have a stability problem. We want to figure out how big is\nthis effect. In the units we are working the electron potential energy in the presence\nof the proton is V = -e2/r and the magnitude of the force of attraction is e2/r2.\n(a) Show that for a non-relativistic electron the energy ∆E lost per revolution is\nsmall compared to the electron's kinetic energy K. Do this by computing the\nratio ∆E/K. Hence, it is possible to regard the orbit as circular at any instant,\neven though the electron eventually spirals into the proton.\n(b) A good estimate for the size of the hydrogen atom is 50 pm (pico-meters), and\na good estimate for the size of the nucleus is 1fm (femto-meter). Compare the\nclassically calculated velocity of the electron to the velocity of light at an orbital\nradius of 50 pm, 1 pm, and 1 fm.\n(c) Calculate how long it would take for the electron to spiral from 50 pm to 1pm?\nAre you justified in ignoring relativistic corrections? Would the answer using\nthe non-relativistic approximation change much for a spiral from 50pm to 1fm?\n(d) As the electron approaches the proton, what happens to its energy? Is there a\nminimum value of the energy the electron can have?\n\nPhysics 8.04, Quantum Physics 1, Spring 2016\n2. Quantized energies. [5 points]\nConsider an electron in circular motion around a fixed (heavy) proton as a model for\nthe hydrogen atom. Let V = -e2/r denote the potential energy of the electron.\n(a) Assume a circular orbit and find the relations between the kinetic energy K of\nthe electron, its potential energy V and the total energy E.\n(b) Assume that the magnitude L of the electron angular momentum is quantized\nand equal to nħwhere n is a positive integer. Find the quantized values En\nfor the total energy and the associated orbit radii rn. Express your answers in\nterms of n, the rest energy Ee = mec2 of the electron, its Comption wavelength\nλ =\nħ\nmec, and the fine structure constant α = e2\nħ.\nc\n3. DeBroglie Relations and the Scale of Quantum Effects. [10 points]\n(a) Matter Particles as Waves\nIf a wavelength can be associated with every moving particle, then why are we not\nforcibly made aware of this property in our everyday experience? In answering,\ncalculate the de Broglie wavelength λ = h/p (with h = 6.6 × 10-34J.s) of each\nof the following particles:\ni. an automobile of mass 2000 kg traveling at a speed of 50 mph (22m/s)\nii. a marble of mass 10 g moving with a speed of 10 cm/s,\niii. a smoke particle of diameter 100nm and a mass of 1fg being jostled about\nby air molecules at room temperature (T = 300K) (assume that the particle\nhas the same translational kinetic energy as the thermal average of the air\nmolecules, KE = 3kBT, with kB = 1.38 × 10-23J/K)\niv. an 87Rb atom that has been laser cooled to a temperature of T = 100μK.\nAgain, assume KE = 3kBT.\n(b) Light Waves as Particles\nThe Photoelectric effect suggests that light of frequency ν can be regarded as\nconsisting of photons of energy E = hν, where h = 6.6 × 10-34Js.\ni. Visible light has a wavelength in the range of 400-700 nm. What are the\nenergy and frequency of a photon of visible light?\nii. The microwave in my kitchen operates at roughly 2.5 GHz at a max power of\n300W. How many photons per second can it emit? What about a low-power\nlaser (10mW at 633 nm), or a cell phone (0.25W at 850MHz)?\niii. How many such microwave photons does it take to warm a 200ml glass\nof water by 10 C? (The heat capacity of water is roughly 4J/gK, and the\ndensity is 1g/ml.)\niv. At a given power of an electromagnetic wave, do you expect a classical wave\ndescription to work better for radio frequencies, or for X-rays?\n\nPhysics 8.04, Quantum Physics 1, Spring 2016\n4. Complex Number Practice [15 points]\nA complex number can be written in either Cartesian or polar form\nz = a + ib = reiθ ,\n|z| ≡\np\na2 + b2 .\n(1)\nThe real numbers a and b are, respectively, the real and imaginary parts of z. The\nreal numbers r and θ are, respectively, the magnitude and phase of z. We call |z| the\nnorm of z. Use this definition for z in the following:\n(a) Use Taylor expansions to derive the Euler formula\neiθ = cos θ + i sin θ .\n(2)\n(b) Write a and b in terms of r and θ, and vice versa.\n(c) Complex numbers are viewed a vectors in a two-dimensional \"complex plane\".\nMultiplication of a complex number by a phase (a complex number of unit mag-\nnitude) is equivalent to a rotation in the complex plane.\ni. Show that multiplication by i is equivalent to rotation by 90*: iz = rei(θ+π/2)\nii. Write iz in terms of a and b. What is the real part of iz?\niii. Show that multiplication by eiφ is equivalent to rotating by φ.\n(d) The complex conjugate z∗of a complex number z = a + ib is z∗= a -ib. A\ncomplex number z is actually real if z = z∗, meaning that its imaginary part is\nzero. A complex number z is actually imaginary if z = -z∗, which implies that\nits real part is zero.\ni. Is there a number that is both real and purely imaginary?\nii. What is (z∗)∗? Show that z∗= re-iθ.\niii. Express the real and imaginary parts of z in terms of z and z∗.\niv. Show that zz∗is real and evaluate it to express it in terms of a and b, in\nterms of r, and in terms of |z|.\n(e) Using the Euler formula derive formulae for cos 2θ, sin 2θ, cos 3θ, and sin 3θ, all\nin terms of sin θ and cos θ. Derive formulae for cos(A + B) and sin(A + B), both\nin terms of sines and cosines of A and B.\n5. Absorption? [5 points]\nA photon collides with a free electron. Explain why the photon cannot be completely\nabsorbed.\n6. Mach-Zender interferometer [10 points]\nConsider the Mach-Zender interferometer and assume an input beam of the form\nα\n. Call P0 and P1 the detection probabilities at D0 and D1.\nβ\n(a) Calculate P0 and P1 assuming we insert a phase shifter with phase δl on the\nlower leg of the interferometer.\n\nPhysics 8.04, Quantum Physics 1, Spring 2016\n(b) Calculate P0 and P1 assuming we insert a phase shifter with phase δu on the\nupper leg of the interferometer.\n(c) Calculate P0 and P1 assuming we insert the two phase shifters simultaneously.\n7. Elitzur-Vaidman bombs! [10 points]\n(a) Suppose you decide to test bombs with a Mach-Zender interferometer repeatedly\nuntil the status of any given bomb is certain beyond reasonable doubt. What\nfraction of the working bombs are certified without detonation?\n(b) Suppose 80% of the bombs in your possession are defective. You choose one at\nrandom and test it with a Mach-Zender interferometer by sending in one photon.\nYou detect the photon at D0. What is the probability that the bomb is defective?\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n8.04 Quantum Physics I\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Assignment 2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-04-quantum-physics-i-spring-2016/6e6dbe0a93bddc9ecf93eb173e514e15_MIT8_04S16_ps2_2016.pdf",
      "content": "Quantum Physics I (8.04) Spring 2016\nAssignment 2\nMassachusetts Institute of Technology\nPhysics Department\nDue Thu. February 18, 2016\nFebruary 11, 2016\n5:00pm\nProblem Set 2\n1. de Broglie wavelength [20 points]\n(a) The de Broglie wavelength of a non-relativistic (nr) electron with kinetic energy\nEkin can be written as as\nδ\nλnr = √\nA .\nEkin\nIn this formula δ is a unit-free constant, and the value of the energy Ekin is\nentered in eV as a pure number. The answer comes out in Angstroms ( A =\n10-10m) . Give the value of the unit-free constant δ.\n(b) The de Broglie wavelength of a relativistic (r) electron with energy E can be\ncalculated in terms of the γ factor of the electron: E = γmec2. One finds\nl\nλr = p\n.\nγ2 -1\nWhat is the value of lin fm = 10-15m? Is this a well-known length?\n(c) Rewrite the expression for λnr in (a) in terms of land γ, using Ekin = (γ -\n1)m\nec . Demonstrate that λr < λnr for any energy.\n(d) A few numerical calculations:\ni. What is the energy of an electron whose de Broglie wavelength is equal to\nits Compton wavelength? Is that electron relativistic: Is it moving faster\nthan 0.2 c ?\nii. The de Broglie wavelength of a particle gives you the rough idea of the dis-\ntance scale it can explore in a collision experiment. The International Linear\nCollider, which may be built in the near future, is expected to accelerate\nelectrons to 1 TeV = 1000 GeV. What is the de Broglie wavelength of such\nelectrons? Compare to the de Broglie wavelength of 7 TeV protons at the\nLHC at Geneva.\niii. What is the maximum electron kinetic energy, and the associated β = v/c,\nfor which the non-relativistic value of λ (in (a) or (c)) has an error less than\nor equal to 10% ?\n\nPhysics 8.04, Quantum Physics 1, Spring 2016\n2. Bohr radius, electron Compton wavelength, and classical electron radius.\n[10 points]\nThe classical electron radius r0 is the radius obtained by setting the electrostatic\nenergy associated to a charged ball of radius r0 equal (up to constant factors) to the\nrest energy of the electron\ne2\nr0\n= mec2\n→\nr0 =\ne2\n.\nmec2\nHere e is the charge of the electron. The bar-Compton wavelength λ C of the electron\nis\nħ\nλ C =\n.\nmec\nFinally, the fine structure constant α, which measures the strength of the electromag-\nnetic coupling is\ne2\nα = ħc ≃\n1 .\n(a) The Bohr radius a0 is the length scale that can be constructed from e2, ħ, and\nme and no extra numerical constants. Find the formula for the Bohr radius by\nconsideration of units. Evaluate this length in terms of fm.\n(b) Show that the three lengths form a geometric sequence with ratio α:\na\n0 : λ C : r0 = 1 : α : α .\nUse this to give the values of λ C and r0 in fm.\n3. Two-by-two matrices and linear devices. [10 points]\nConsider the two-beam Mach-Zender interferometer and a beam represented by the\ntwo-component column vector u:\nu =\nu1\n\n,\nwith\n|u1|2 + u\nu2\n| 2|2 = 1 .\nAny linear optical element in the interferometer can be represented by a two-by-two\nmatrix R such that with input u beam the output is a u′ beam given by\nu′ = R u .\nShow that conservation of probability for arbitrary u requires that R be a unitary\nmatrix.\nA (finite size) matrix R is said to be unitary if R+R = 1, where dagger\ndenotes the operation of transposition and complex conjugation.\n\nPhysics 8.04, Quantum Physics 1, Spring 2016\n4. Improving on bomb detection [15 points]\nWe modify the Mach-Zehnder interferometer to increase the percentage of Elitzur-\nVaidman bombs that can be vouched to work without detonating them.\nFor this\npurpose we build a beam-splitter with reflectivity R and transmissivity T. A photon\nincoming (from either port) has a probability R to be reflected and a probability T to\nbe transmitted (R + T = 1). Let r and t denote the positive square roots:\nr\n√\n≡\nR ,\nt ≡\n√\nT .\n(a) Build the two-by-two matrix U that represents the beam splitter. For this con-\nsider what happens when a photon hits the beam splitter from the top side (input\n\n) and when it hits it from the bottom side (input\n\n). To fix conventions\nU will have all entries positive (and real) except from the bottom right-most\nelement (the 2,2 element). Confirm that U is unitary.\nThe interferometer with detectors D0 and D1 (shown below) uses two identical\ncopies of the beam splitter. The incoming photon arrives from the top side.\n(b) A defective bomb is inserted in the lower branch of the interferometer. What\nare the detection probabilities P0 and P1 at D0 and D1 respectively?\nA functioning bomb inserted in the lower branch of the interferometer. What\nis the detonation probability Pboom and the detection probabilities P0 and P1?\nExpress your answers in terms of R and T.\n(c) You test bombs until you are reasonably sure that either they malfunction or\nthat they are operational. What fraction f of the operational bombs can be\ncertified to be good without detonating them? Give your answer in terms of R.\nWhat is the maximum possible value for f?\n\nPhysics 8.04, Quantum Physics 1, Spring 2016\n5. Plane waves for matter particles.\n[10 points] Assume we want to represent the\nwave for a matter particle moving in the x direction with momentum p = ħk. A\nreasonable guess for such a wave is\nΨ(x, t) = cos(kx -ωt) + γ sin(kx -ωt) ,\nwhere γ is a constant. A physical requirement is that an arbitrary displacement of x\nor an arbitrary shift of t should not alter the character of the wave. We will demand\ntherefore that after the shift, whose effect is to change the phase by some constant o,\nwe have\ncos(kx -ωt + o) + γ sin(kx -ωt + o) = a\n\ncos(kx -ωt) + γ sin(kx -ωt)]\nfor some constant a that may depend on o.\nWrite the equations that follow from the above requirement. Find the two possible\nsolutions for γ and the associated a. Which is the solution that corresponds to our\nconventional description of a matter wave?\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n8.04 Quantum Physics I\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Assignment 3",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-04-quantum-physics-i-spring-2016/758985e10e8d23d87138a6f2c0adc5a9_MIT8_04S16_ps3_2016.pdf",
      "content": "Quantum Physics I (8.04) Spring 2016\nAssignment 3\nMIT Physics Department\nDue Thu. February 25, 2016\nFebruary 18, 2016\n5:00pm\nAnnouncements\n- Recommended Reading: Griffiths, sections 1.1, 1.2, 1.4 and 1.5.\nProblem Set 3\n1. Exercises with commutators [10 points] Let A, B, and C be linear operators.\n(a) Show that [A, BC] = [A, B]C + B[A, C].\n(b) Show that [AB, C] = A[B, C] + [A, C]B.\n(c) Show that [A, [B, C]] + [B, [C, A]] + [C, [A, B]] = 0.\n(d) Calculate [xˆn, pˆ] and [x, pˆn] for n an arbitrary integer greater than zero.\n(e) Calculate [xˆpˆ, xˆ2] and [xˆpˆ, pˆ2].\n2. Simple tests of the stationary phase approximation [10 points]\nIn here we consider integrals of the form\nΨ(x) =\nZ inf\ndk Φ(k)eikx ,\n-inf\nwhere Φ(k) is a function that is sharply localized around k = k0. In each of the\nfollowing cases use the stationary phase argument to predict the location of the peak\nof |Ψ(x)|. Then compute the integral exactly to find Ψ(x), |Ψ(x)|, and to confirm\nyour prediction.\n(a) Φ(k) = e-L2(k-k0)2, where L is a constant with units of length.\n(b) Φ(k) = e-L2(k-k0)2e-ikx0, where x0 and L are constants with units of length.\nUseful integral: Valid for complex constants a and b, with real part of a positive:\nZ inf\ne-ax2+bxdx =\n-inf\nr π\na exp\nb2\n,\n4a\n\nwhen Re(a) > 0 .\n\nPhysics 8.04, Quantum Physics 1, Spring 2016\n3. Galilean invariance of the free Schrodinger equation. [15 points]\nShow that the free-particle one-dimensional Schro dinger equation for the wavefunc-\ntion Ψ(x, t):\n∂Ψ\niħ∂t\n= -ħ2\n2m\n∂2Ψ ,\n∂x2\nis invariant under Galilean transformations\nx′ = x -vt ,\nt′ = t .\nBy this we mean that there is a Ψ′(x′, t′) of the form\nΨ′(x′, t′) = f(x, t) Ψ(x, t) ,\nwhere the function f(x, t) involves x, t, ħ, m and v, and such that Ψ′ satisfies the\ncorresponding Schro dinger equation in primed variables.\n∂Ψ′\niħ∂t′\n= -ħ2\n2m\n∂2Ψ′\n.\n∂x′2\n(a) Find the function f(x, t). [Hint: Note that the function f(x, t) cannot depend\non any observable of Ψ; it is a universal function that is used to transform any\nΨ. Thus if Ψ is a (single) plane wave, f cannot depend on its momentum or its\nenergy.]\n(b) Demonstrate that the plane wave solution\nΨ(x, t) = A ei(kx-ωt)\ntransforms as expected. In other words, give Ψ′ and show that it represents, in\nthe primed reference frame, a particle with the expected momentum and energy.\n4. Re-do current conservation in 3D\n[10 points]\nIn class we derived the expression for the one-dimensional probability current J(x, t)\nstarting from ρ(x, t) = |Ψ(x, t)|2 and using the one-dimensional Schro dinger equation\nto write\n∂ρ\n∂t + ∂J = 0 .\n∂x\nRepeat the same steps starting from\nρ(x, t) =\nΨ(x, t)\n\n,\nand using the three-dimensional Schro dinger equat\n\nion to derive the form of the prob-\nability current J(x, t) that should appear in the conservation equation\n∂ρ + ∇· J = 0 .\n∂t\n\nPhysics 8.04, Quantum Physics 1, Spring 2016\n5. Time evolution of an overlap between two states. [10 points] (Merzbacher)\nConsider a wavefunction that at time t = 0 is the superposition of two widely sepa-\nrated narrow wave packets Ψ1 and Ψ2:\nΨ(x, 0) = Ψ1(x, 0) + Ψ2(x, 0) .\nEach packet is separately normalizable. We define the overlap integral γ(t) as\nγ(t) ≡\nZ inf\nΨ∗\n1(x, t)Ψ2(x, t)dx .\n-inf\nAt time equal to zero the value of |γ(0)| is very small. As the packets evolve and\nspread, what will happen to the value of |γ(t)|?\nWill it increase as the packets\noverlap?\n6. Probability current in one dimension [10 points]\nCalculate the probability current J(x) for the following wavefunctions, all of which\nrefer to t = 0:\n(a) Ψ(x) = A eγx . Here A is a complex constant and γ is a real constant.\n(b) Ψ(x) = N(x)eiS(x)/ħ. Here N(x) and S(x) are real.\n(c) Ψ(x) = Aeikx + Be-ikx. Here A, B are complex constants and k is real.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n8.04 Quantum Physics I\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Assignment 4",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-04-quantum-physics-i-spring-2016/63aa28d2a3cf3e7f49c701147195e4a1_MIT8_04S16_ps4_2016.pdf",
      "content": "Quantum Physics I (8.04) Spring 2016\nAssignment 4\nMIT Physics Department\nDue Fri. March 4, 2016\nFebruary 25, 2016\n12:00 noon\nAnnouncements\n- Recommended Reading: Griffiths, sections 1.5, 1.6, 2.4.\nProblem Set 4\n1. Exercises on packets changing shape [5 points]\n(a) A free proton is localized within ∆x = 10-10m. Estimate the time ts it takes\nthe packet to spread appreciably. Repeat for an proton localized within 1 cm.\n(b) Consider a wave packet that satisfies the relation ∆x∆p ∼ħ. Show that the\ncondition ∆p ≪p guarantees that the packet does not spread appreciably in\nthe time it takes to pass through a fixed position.\n2. Probability current in three dimensions [10 points]\nIn elastic scattering of particles in three-dimensional space the wavefunction takes\nthe form\n)\nΨ(x)\neikz\nf(θ\n=\n+\neikr ,\nvalid for large r .\nr\nThe time dependence has been suppressed; it is just an overall time dependent phase\ne-iEt/ħwith E = ħ2k2/(2m). It will play no role here.\nThe first term represents the incoming particles, moving in the +z direction. The\ntarget is located at the origin r = 0 and the second term represents the amplitude for\nparticles moving radially out - the scattered particles. This amplitude is θ dependent\nbut assumed to be φ independent; f(θ) is a complex function of θ that carries the\ninformation about the scattering. Recall that θ is the polar angle and z = r cos θ.\nWhen you calculate the probability current J(x) associated with Ψ there will be a\ncontribution J1 due to the first term (the plane wave), a contribution J2 due to the\nsecond term (the spherical waves), and a contribution J12 due to interference between\nthe first and second term:\nJ(x) = J1(x) + J2(x) + J12(x) .\n(a) Calculate the probability current J1 and the total flux of this current over a\nlarge sphere of radius R centered at the origin r = 0.\n\nPhysics 8.04, Quantum Physics 1, Spring 2016\n(b) Calculate the radial component ˆr · J2 of the probability current J2. Here ˆr is\nthe unit vector in the radial direction. Calculate the flux of this current over\na radius R sphere centered at the origin in the limit as R →inf. Your answer\nshould be left as an integral over solid angle\nR\ndΩ, or over\ndθ, if you prefer.\n(c) Calculate the radial component of the interference term J\nR\n12 but pick up only\nthe leading part in 1/r (that is ignore 1/r2 terms). Show that the answer can\nbe written in the form\nħk\nˆr · J12 =\nIm i\nmr\n. . .\n\nwhere (. . .) represent terms that your calculation should determine. These terms\ndepend om f(θ), cos θ, and the product kr in exponentials. Calculating the flux\nof this current over the large sphere is delicate so we will leave that for later (the\nend result is the so called optical theorem!).\n3. Evolving the Gaussian wave packet [15 points]\nConsider the normalized wave packet representing the state of a particle of mass m\nat t = 0:\nΨa(x, 0) = (2π)1/4√a exp\n\n-x2\n.\n4a2\n\nHere a is a length parameter that represents the width of the packet at zero time.\n(a) Confirm that Ψa(x, 0) is properly normalized.\n(b) Find the Fourier representation of Ψa(x, 0), namely, determine the function\nΦa(k) such that\nΨa(x, 0) = √\ni\nZ inf\nΦa(k)e kxdk .\nπ\n-inf\n(c) Assume the particle is free to find the wavefunction Ψa(x, t) for arbitrary t > 0.\nThe answer is a bit messy, but can be written more clearly using the time\nconstant τ built from the constants in the problem:\n2ma2\nτ ≡\n.\nħ\n(d) At time zero the probability density is\n|Ψa(x, 0)|2 = √\n2π a\nexp\n\n-x2\n2 2\nG\na\n\n≡\n(x; a) ,\nwhere we defined the gaussian G(x; a) with width parameter a. What is the\nprobability density |Ψa(x, t)|2 for t > 0. Express your answer in terms of the\ngaussian G with a time-dependent width parameter a(t). Give a(t).\n\nPhysics 8.04, Quantum Physics 1, Spring 2016\nUseful integral: Valid for complex constants a and b, with real part of a positive:\nZ inf\ne-ax2+bxdx =\n-inf\nr π\na exp\nb2\ne\n\n,\nwhen R (a) > 0 .\na\n4. Parseval's identity in 1D and 3D, and application [10 points]\n(a) Consider the Fourier pair (Ψ(x), Φ(p)) relevant to one dimensional (1D) wave-\nfunctions and the Fourier pair (Ψ(x), Φ(p) ) relevant to three-dimensional (3D)\nwavefunctions.\nUse the Fourier relations and the integral form for the delta\nfunction to prove the 1D and 3D versions of Parseval's identity:1\nZ inf\ninf\ndx Ψ(x) 2 =\ndp Φ(p) 2 ,\n-inf\n|\n|\nZ\n-inf\n|\n|\nZ\nd3x |Ψ(x)|2 =\nZ\nd3p |Φ(p)|2 .\n(b) In the hydrogen atom the ground state wavefunction takes the form Ψ(x) =\nNe-r/a0 where r = |x|, a0 is the Bohr radius, and N is a normalization constant.\nFind N. The Fourier transform (which you need not derive) takes the form\nN′\nΦ(p) =\n1 + a2\n0p2\n2 ,\nħ2\n\nfor some constant N′ and with p ≡|p|. Find N′ (you may use an algebraic\nmanipulator to do the integral). Calculate the probability that the electron may\nbe found with a momentum whose magnitude exceeds ħ/a0. (Write your inte-\ngrals explicitly, but you may evaluate them with a computer). [The momentum\ndistribution was measured by ionization of atomic hydrogen by a high energy\nelectron beam, see, Lohan, B. and Weigold, E. (1981) \"Direct measurement of\nthe Electron Momentum Probability Distribution in Atomic Hydrogen,\" Phys.\nLett. 86A, 139-141.]\n5. Ehrenfest theorem [10 points]\nConsider a particle moving in one dimension with Hamiltonian H given by\np2\nH =\n+ V (x) .\n2m\nShow that the expectation values ⟨x⟩and ⟨p⟩are time-dependent functions that\nsatisfy the following differential equations:\nd\ndt⟨x⟩=\np\nm ⟨⟩,\nd\n∂\np\ndt⟨⟩= -\nD V\n∂x\nE\n.\n1In mathematics this is called Plancherel's theorem. Parseval's result was the analog for Fourier series.\n\nPhysics 8.04, Quantum Physics 1, Spring 2016\n6. Momentum uncertainty [5 points]\nShow that in a free-particle wave packet the momentum uncertainty ∆p does not\nchange in time.\n7. Finding Meaning in the Phase of the Wavefunction [10 points]\nSuppose ψo(x) is a properly-normalized wavefunction with ⟨x ψo = xo and p ψo = po,\nx\np0\nˆ\n⟩\n⟨⟩\nwhere\no and\nare constants. Define the boost operator Bq to be the operator that\nacts on arbitrary functions of x by multiplication by a q-dependent phase:\nBˆq f(x) = eiqx/ħf(x) .\nHere q is a real number with the appropriate units. Consider now a new wavefunction\nobtained by boosting the initial wavefunction:\nψ\nˆ\nnew(x) = Bq ψo(x) .\n(a) What is the expectation value ⟨x⟩ψnew in the state given by ψnew(x)?\n(b) What is the expectation value ⟨p⟩ψnew in the state given by ψnew(x)?\n(c) Based on your results, what is the physical significance of adding an overall\nfactor eiqx/ħto a wavefunction.\nˆ\nˆ\n(d) Compute [pˆ, Bq] and [xˆ, Bq].\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n8.04 Quantum Physics I\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Assignment 5",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-04-quantum-physics-i-spring-2016/fcad31ce526fc0b219362cc29def5314_MIT8_04S16_ps5_2016.pdf",
      "content": "Quantum Physics I (8.04) Spring 2016\nAssignment 5\nMIT Physics Department\nDue Fri. March 18, 2016\nMarch 11, 2015\n12:00 noon\nReading: Griffiths: 3.2, 3.3, 3.4, 2.1 and 2.2.\nProblem Set 5\n1. Gaussians and uncertainty product saturation [5 points]\nConsider the gaussian wavefunction\nψ(x) = N exp\n\n-2\nx2\n,\n(1)\na2\nwhere N ∈R a is a real positive constant with units\n\nof length. The integrals\nZ inf\ndxe-αx2+βx =\n-inf\nrπ\nα exp\nβ2\n4α\n\n,\nRe(α) > 0 ,\nZ inf\n-inf\ndx x2e-αx2 = 1\n-\nZ inf\ndx e\nαx\nα\n-inf\n(a) Use the position space wavefunction (1) to calculate the uncertainties ∆x and\n∆p. Confirm that your answer saturates the Heisenberg uncertainty product\n∆x∆p ≥ħ.\n(Hints: These calculations are actually quite brief if done the right way! Using\nthe second of the above integrals you don't even have to determine N. For the\nevaluation of ⟨pˆ2⟩in position space fold one factor of pˆ into ψ∗. ).\n(b) Calculate the Fourier transform φ(p) of ψ(x).\nUse Parseval to confirm your\nanswer and then recalculate ∆p using momentum space.\n2. Complex Gaussians and the uncertainty product [10 points]\nConsider the gaussian wavefunction\nψ(x) = N exp\n\n-2\nx2\n,\n∆∈C ,\nRe(∆2) > 0 ,\n(1)\n∆2\nwhere N is a real normalization constant\n\nand ∆is now a complex number: ∆∗= ∆.\nThe integrals in Problem 1 are also useful here and so is the following relation, valid\nfor any nonzero complex number z,\nRe\nz\n\n= Re(z)\n(prove it!)\n|z|2\n\nPhysics 8.04, Quantum Physics 1, Spring 2016\n(a) Use the position space representation (1) of the wavefunction to calculate the\nuncertainties ∆x and ∆p. Leave your answer in terms of |∆| and Re(∆2). (∆x\nwill depend on both1, while ∆p will depend only on Re(∆2)).\n(b) Calculate the Fourier transform φ(p) of ψ(x).\nUse Parseval to confirm your\nanswer and then recalculate ∆p using momentum space.\n(c) We parameterize ∆using a phase φ∆∈R as follows\n∆= |∆| eiφ∆.\nCalculate the product ∆x∆p and confirm that the answer can be put in terms of\na trigonometric function of φ∆and that |∆| drops out. Is your answer reasonable\nfor φ∆= 0 and for φ∆= π?\n(d) Consider the free evolution of a gaussian wave packet in Problem 3 of Home-\nwork 4. What is ∆p at time equal zero? Examine the time evolution of the\ngaussian (from the solution!) and read the value of the time-dependent (com-\nplex) constant ∆2. Confirm that ∆p, found in (a), gives a time-independent\nresult.\n3. Exercises with a particle in a box [15 points]\nConsider a 1D problem for a particle of mass m that is free to move in the interval\nx ∈[0, a]. The potential V (x) is zero in this interval and infinite elsewhere. For that\nsystem consider a solution of the Schro dinger equation of the form\nπ\nΨn(x, t\n= N sin\nn\n)\nx e-iφn(t) ,\nx ∈[0, a] ,\na\nand Ψn(x, t) = 0 for x < 0 and x > a. Here\n\nn ≥1 is an integer.\n(a) Find the expression for the (real) phase φn(t) so that the above wavefunction\nsolves the Schro dinger equation. Find the normalization constant N.\n(b) Use Ψn(x, 0) to calculate ⟨x⟩, ⟨x2⟩, and ∆x.\n(c) Use Ψ\nn(x, 0) to calculate ⟨p⟩, ⟨p ⟩, and ∆p.\n(d) Is the uncertainty inequality satisfied? Is it saturated?\n(e) What answers in (b) and (c) change for Ψn(x, t)? Explain.\n4. A Hard Wall [5 points]\nA particle of mass m is moving in one dimension, subject to the potential V (x):\nV (x) =\n(\n0,\nfor x > 0,\ninf\nfor x ≤0 .\nFind the stationary states and their energies. These states cannot be normalized.\n1Actually ∆x can be written in terms of Re(1/∆2) alone.\n\nPhysics 8.04, Quantum Physics 1, Spring 2016\n5. A Step Up on the Infinite Line [10 points]\nA particle of mass m is moving in one dimension, subject to the potential V (x):\nV (x) =\n(\nV0,\nfor x > 0,\n0 ,\nfor x ≤0 .\nFind the stationary states that exist for energies 0 < E < V0.\n6. A Wall and Half of a Finite Well [10 points]\nA particle of mass m is moving in one dimension, subject to the potential V (x):\nV (x) =\n\ninf,\nfor x < 0,\n\n-V0,\nfor 0 < x < a ,\n(V0 > 0)\n0 ,\nfor x > a .\nFind the stationary states th\n\nat correspond to bound states (E < 0, in this case). Is\nthere always a bound state? Find the minimum value of z0\nz2\n2ma2V0\n0 =\n,\nħ2\nfor which there are three bound states. Explain the precise relation of this problem\nto the problem of the finite square well of width 2a.\n7. Mimicking hydrogen with a one-dimensional square well. [5 points]\nThe hydrogen atom the Bohr radius a0 and ground state energy E0 are given by\nħ2\na0 = me2 ≃0.529 × 10-10m ,\nE0 = -e2\n= -13.6 eV.\n2a0\nThe ground state is a bound state and the potential goes to zero at infinity. We want\nto design a one-dimensional finite square well\n(\n-V0,\nfor |x| < a0,\nV0 > 0 ,\nV (x) =\n0 ,\nfor |x| > a0 ,\nthat simulates the hydrogen atom. Calculate the value of V0 in eV so that the ground\nstate of the box is at the correct depth.\n8. No states with E < V (x) [5 points]\nConsider a real stationary state ψ(x) with energy E:\nħ2\n-\nψ′′(x) + [V (x) -E]ψ(x) = 0 .\n2m\n(a) Prove that E must exceed the minimum value of V (x) by noting that E = ⟨H⟩.\n(b) Explain the claim by trying (and failing) to sketch a wavefunction consistent\nwith being on the classically inaccessible region for all values of x.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n8.04 Quantum Physics I\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Assignment 6",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-04-quantum-physics-i-spring-2016/eb660f9384d5af5f6eb9efc9c65b0e46_MIT8_04S16_ps6_2016.pdf",
      "content": "Quantum Physics I (8.04) Spring 2016\nAssignment 6\nMIT Physics Department\nDue Friday April 1, 2016\nMarch 17, 2016\n12:00 noon\nReading: Griffiths section 2.6. For the following week sections 2.5 and 2.3.\nProblem Set 6\n1. Particle in a square well.\n[10 points] A particle of mass m moves in an infinite\nsquare well of width a. Its wavefunction at time t = 0 is\nΨ(x, 0) = √\nr\na sin 2πx\na\n+\nr\nr\na sin 3πx .\na\n(a) Is Ψ in an energy eigenstate? Find Ψ(x, t).\n(b) What are the probabilities that a measurement of the energy at time t gives\neach of the following values\nħ2π2\n2ma2 ,\n4ħ2π2\n2ma2 ,\n9ħ2π2\n.\n2ma2\n(c) What is the expectation value of x at time t?\n(d) What is the expectation value of p at time t ?\n2. Non-degeneracy of bound states in one dimension [10 points]\nGriffiths Problem 2.45, p. 87.\n3. Infinite rectangular well in the plane [10 points]\nConsider a particle of mass m moving in the x, y plane with potential that is zero\ninside the rectangular box comprised of all points (x, y) for which\n0 ≤x ≤Lx ,\n0 ≤y ≤Ly ,\nand is infinite elsewhere.\n(a) Use the two-dimensional Schro dinger equation to find the energy eigenstates.\nGive the energies and the normalized eigenfunctions.\n\nPhysics 8.04, Quantum Physics 1, Fall 2015\n(b) Consider the case Lx = Ly = L. You will see that there are degeneracies in\nthe energy spectrum. Some degeneracies have a simple symmetry explanation;\nidentify them and state why they occur. Some degeneracies are accidental; they\nseem to be random. Display some examples. [Hint: 49+ 1 = 25 + 25].\n(c) Show that whenever (L\nx/Ly) is irrational there are no degeneracies.\n4. An infinite square well with a step [10 points]\nA particle of mass m is moving in one dimension, subject to the potential V (x):\nV (x) =\n\ninf,\nfor x < 0,\n\n0,\nfor 0 < x < a ,\nV\n(V\n\n0 ,\nfor a < x < 2a ,\n0 > 0)\ninf,\nfor x > 2a .\n(a) Find the equations tha\n\nt determine the stationary states with energies 0 < E <\nV0. For this we define\nk2\n2mE\n≡\nħ2\n,\nκ2 ≡2m(V0 -E)\nħ2\n,\nz2\n0 = 2ma2V0\nħ2\n,\nη ≡ka ,\nξ ≡κa .\n(We use k for classically allowed regions and κ for classically forbidden re-\ngions).Your equations should be possible to write in terms of ξ, η, and z0.\n(b) As a numerical application, consider z0 = 2π. How many states do you get with\nE < V0? Find the possible values of the energy E in terms of V0 (use at least 4\nsignificant digits).\n5. Shooting method and application [15 points]\nFor a particle in a quartic potential V (x) ∼x4, after rescaling of x into a unit-free\nvariable u, the Schro dinger equation takes the form\n-2\nd2ψ\n2 + (u\nψ\nu\n-e)\n= 0 ,\nd\nwhere e is a unit-free measure of the energy eigenvalue. The Mathematica instructions\nthat allow you to find the values of e for the even solutions of this potential are given\nbelow. These instructions produce a plot for the solution ψ(u), for u ∈[0, 3.5] with\nsome suitable initial conditions and for the chosen value of the energy e.\nClear[e, psi]\nv[x_]:= x^4\ne=0.65;\npsi = psi/. NDSolve[{-(1/2)psi''[u] + (v[u]-e)psi[u]==0, psi[0]==1,\n\nPhysics 8.04, Quantum Physics 1, Fall 2015\npsi'[0]==0}, psi, {u, 0, 3.5}][[1]];\nPlot[psi[u], {u, 0, 3.5}]\nAfter executing these instructions, if you write psi[0.5], for example, the program\nwill return the value of ψ at u = 0.5.\nPlay with this to familiarize yourself. The initial value of e set above is 0.65 but the\nground state energy, as you can find out by trial and error, is a little bit higher.\nWe now revisit the previous problem: a particle of mass m on an infinite square well\nwith a step. Again, we take z0 = 2π. You found two bound states with E < V0:\nE1 = 0.##436 V0 ,\nE2 = 0.##747V0 .\n(a) Use x = au, with u ∈[0, 2] unit free, and write V = V0f(u) for a suitably defined\nf(u) to obtain a differential equation for the energy eigenstates in which no units\nappear and the energy eigenvalue is encoded by the pure number e = E/V0.\nTest your differential equation with the shooting method to recover the above\nvalues of E1 and E2. Find the next two energy levels E3 and E4.\n(b) We discussed in lecture the fact that for slowly varying potentials the amplitude\nof the wavefunction is roughly proportional to the square root of the 'local' de\nBroglie wavelength. Our potential, having a step, is not really slowly varying,\nbut we can still see numerically to what degree this property holds.\nConstruct the energy eigenstate with 8 nodes (the eighth excited state) and\ndetermine its energy. Let AL and AR denote the amplitudes of your wavefunction\non the left and right sides of the square well. Read the ratio AL/AR from your\nwavefunction and compare with the prediction for this ratio using the de Broglie\nwavelength.\n6. Hydrogen ion using the square well model. [10 points]\nLast time you modeled the hydrogen atom size and ground state energy\nħ2\na0 = me2 ,\nE0 = -e2\n=\n.\na0\n-13 6 eV,\nusing the square well potential\nV (x) =\n(\n-V0,\nfor |x| < a0,\nV0 > 0 ,\n0 ,\nfor |x| > a0 .\nYou previously found that this well has\nz0 = 1.3192,\nand\nV0 = z2\n0|E0| = 1.7402|E0| = 23.67eV .\nThe square well potential mimics the potential created by the proton and the ground\nstate energy is the energy of the electron in this potential.\n\nPhysics 8.04, Quantum Physics 1, Fall 2015\nTo simulate the hydrogen ion H+\n2 (2 protons 1 electron) we will construct an even\npotential with two identical square well models of hydrogen separated by a small\ndistance 2γ a0 where γ is a small positive unit-free constant. The potential is therefore\nfor\n|x| < γa0 ,\nV (x) =\n\n-V0,\nfor\nγa0 < |x| < (2 + γ)a0,\nV0 > 0 ,\n\n0 ,\nfor\n|x| > (2 + γ)a0 .\nFor definiteness work w\n\nith γ = 0.2 .\n(a) Use the shooting method to find the energy of the lowest energy eigenstate,\nnamely, the bound state energy of an electron shared by the two protons. Show\nthe wavefunction of the electron from the plot of your solution.\n(b) The binding energy of the ion is obtained by adding the positive energy due to\nthe repulsion of the two protons to the above ground state energy. What binding\nenergy do you get? How does it compare with the experimental value?\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n8.04 Quantum Physics I\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Assignment 7",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-04-quantum-physics-i-spring-2016/e56c39618b49183ed4e855ae38e2f0d0_MIT8_04S16_ps7_2016.pdf",
      "content": "Quantum Physics I (8.04) Spring 2016\nAssignment 7\nMIT Physics Department\nDue Friday April 8, 2016\nApril 1, 2016\n12:00 noon\nReading:\nGriffiths sections 2.5 and 2.3.\nProblem Set 7\n1. Two delta functions\n[15 points]\nConsider a particle of mass m moving in a one-dimensional double well potential\nV (x) = -gδ(x -a) -gδ(x + a) ,\ng > 0 .\n(a) Find transcendental equations for the bound state energy eigenvalues of the\nsystem. Plot the energy levels in units of ħ2/(ma2) as a function of the dimen-\nsionless parameter λ ≡mag/ħ2. Explain the features of the plot.\n(b) In the limit of large separation 2a between the wells find a simple formula for\nthe splitting between the ground state and the first excited state.\n2. Sketching wavefunctions. Griffiths 2.47, p. 87. [10 points]\nIn this problem you should try to figure out intuitively how the solutions look. It is\na good idea then to check your intuition with the shooting method and the setup of\nthe H+\n2 ion.\n3. Harmonic oscillators beyond the turning points [10 points]\nFor the simple harmonic oscillator energy eigenstates with n = 0, 1, and 2, calculate\nthe probability that the coordinate x takes a value greater than the amplitude of a\nclassical oscillator of the same energy.\n4. Harmonic oscillator computations [15 points]\n(a) Calculate the expectation value of x4 on the energy eigenstate with number n.\n(b) Calculate ∆x and ∆p on the energy eigenstate with number n. What is the\nvalue of the product ∆x∆p?\n\nPhysics 8.04, Quantum Physics 1, Spring 2016\n(c) Consider the polynomials Hn(ξ) defined by the generating function\ninf\nn\ne-s2+2sξ\ns\n=\nX\nHn(ξ)\nn=0\n.\nn!\nVerify that Hn(ξ) = (2ξ)n+. . . where the dots represent terms with lower powers\nof ξ. Show that the polynomials Hn(ξ) so defined satisfy the Hermite differential\nequation:\nH′′\nn -2ξH′\nn + 2nHn = 0 .\n5. Harmonic oscillator and a wall. Griffiths Problem 2.42. p. 86. [ 5 points]\n6. Harmonic oscillator oscillating! [10 points]\nA particle of mass m in a harmonic oscillator with frequency ω has an initial, time\nzero wavefunction\nΨ(x, 0) = √φ0(x) + φ1(x)\n\n,\nwhere φ0 and φ1 are the normalized eigenstates of the Hamiltonian with number\neigenvalue zero and one, respectively.\n(a) Write down Ψ(x, t) and |Ψ(x, t)|2. You may leave your expressions in terms of\nφ0 and φ1.\n(b) Find ⟨x⟩as a function of time. What is the amplitude of this oscillation and\nwhat is its frequency?\n(c) Find ⟨p⟩as a function of time.\n(d) Show that for any harmonic oscillator state, the probability distribution |Ψ(x, t)|2\nis equal to |Ψ(x, t + T)|2 for T = 2π\nω .\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n8.04 Quantum Physics I\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Assignment 8",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-04-quantum-physics-i-spring-2016/67574eeda2314554048c13a823b23d7a_MIT8_04S16_ps8_2016.pdf",
      "content": "Quantum Physics I (8.04) Spring 2016\nAssignment 8\nMIT Physics Department\nDue Friday, April 22, 2016\nApril 13, 2016\n12:00 noon\nProblem Set 8\nReading: Griffiths, pages 73-76, 81-82 (on scattering states).\n1. States of the harmonic oscillator [15 points]\nConsider the state ψα defined by\nψα ≡N exp(αaˆ+) φ0 ,\nwith α ∈C a complex number. For the first two questions below it may be helpful to\nsimply expand the above exponential.\n(a) Find the constant N needed for the state ψα to be normalized.\n(b) Show that the state ψα is an eigenstate of the annihilation operator aˆ. What is\nthe eigenvalue?\n(c) Find the expectation value of the Hamiltonian in the state ψα.\n(d) Find the uncertainty in the energy in the state ψα.\n(e) Use the eigenvalue equation, viewed as a differential equation to calculate the\nexplicit form of the normalized wavefunction ψα.\n2. Two delta functions- again\n[15 points]\nConsider again the problem of a particle of mass m moving in a one-dimensional\ndouble well potential\nV (x) = -gδ(x -a) -gδ(x + a) ,\ng > 0 .\nYou found in the previous set the value of the bound state energy E for the even state\nin terms of the energy E0 =\nħ/(2ma2). You had ξ = κa\nE\nE0\n= -ξ2\nwhere\nξ\n1 + e-2ξ = λ ,\nλ ≡mag ,\nħ2\nwith λ unit free, encoding the intensity g of the delta functions, if a is constant, or\nthe separation of the delta functions, if g is constant. We can thus write\na\nλ = a0\na0 ≡ħ2\nOhanian, Chapter 11: Scattering and Resonances\n,\nmg\n\nPhysics 8.04, Quantum Physics 1, Spring 2016\nwith a0 a natural length scale in the problem once g is fixed. Introduce also the\nenergy E\nassociated with a single delta function:\ninf\nmg2\nEinf≡\n.\n2ħ2\nAssume now that this is a model for a diatomic molecule with interatomic distance\n2a. The bound state electron helps overcome the repulsive energy between the ions.\nLet the repulsive potential energy Vr(x), with x the distance between the atoms, be\ngiven by\nβg\nVr(x) =\n,\nβ > 0 ,\nx\nwhere β is a small number. The total potential energy Vtot of the configuration is the\nsum of the negative energy E of the bound state and the positive repulsive energy:\nVtot = E + Vr(2a) .\n(a) Write E as E = -E\nf(ξ, λ) where f is a function you should determine. Plot\ninf\nE as a function of a/a0 = λ in order to understand how the ground state energy\nvaries as a function of the separation between the molecules. What are the values\nof E for a →0 and for a →inf?\n(b) Write Vr in terms of E\n, β, and λ.\ninf\n(c) Now consider the total potential energy Vtot and plot it as a function of a/a0 = λ\nfor various values of β. You should find a critical stable point for the potential\nfor sufficiently small β. For β = 0.31 what is the approximate value of a/a0 at\nthe critical point of the potential?\n3. Finite square well turning into the infinite square well [5 points]\nConsider the standard square well potential\n(\n-V0 ,\nfor |x\na,\nV (x) =\n| ≤\nV0 > 0 ,\n(1)\nfor\n|x| > a ,\nand the wavefunction for an even state\nψ(x) =\n\n√a cos kx ,\nfor |x| ≤a,\nA\n√a e-κ|x| ,\nfor x > |a| ,\n(2)\nwhere we included the\n√\nprefactor to have consistent units for ψ.\na\nWe want to have a better understanding of the limit as V0 →infand understand why\nthe discontinuity in ψ′ in the infinite well does not give trouble. Keeping m and a\nconstant as we let V0 grow large is the same as letting z0 grow large.\nA previous analysis has demonstrated that for the ground state, in the situation of\nlarge z0, the ansatz (2) is accurately normalized and\nη = ka ≃π\n2 (1 -1\nz0 ) ,\nξ = κa ≃z0 ,\nA ≃\nπ\n2z0 ez0 .\n\nPhysics 8.04, Quantum Physics 1, Spring 2016\nWe want to see if the expectation value of the Hamiltonian receives a singular con-\ntribution from the forbidden region.\nSince the potential V (x) vanishes there, we\nonly need to concern ourselves with the contribution from the kinetic energy operator\nˆK =\npˆ2\nˆ\n. Calculate the contribution to the expectation of K from the forbidden\n2m\nregion x > a\ninf\n⟨ˆ\nˆ\nK⟩x>a ≡\nZ\ndx ψ∗(x)Kψ(x)\na\nThe answer should be in terms\n\nof z0. Interpret your result.\n4. Reflection of a wavepacket offa step potential [20 points]\nConsider a step potential with step height V0:\nV (x) =\n(\nV0 ,\nfor x > 0\n(1)\n0 ,\nfor x < 0 .\nWe send in from x = -infa wavepacket all of whose momentum components have\nenergies less than the energy V0 of the step. For this we need modes with k satisfying\n≤ˆ\nˆ\nk\nk ,\n2mV\nk\n=\n.\n(2)\nħ2\nWe will then write the incident wavepacket as\nΨinc(x) = √\nˆ\na\nZ k\ndk Φ(k) eikxe-iE(k)t/ħ,\nx < 0 .\n(3)\nHere a is the constant with units of length, uniquely determined by the constants\nm, V0, ħ\nˆ\nin this problem, and Φ(k) is a real, unit-free function peaked at k0 < k\nħ\na ≡√\n,\nΦ(k) = e-β a2(k-k0)2 .\n(4)\nmV0\nThe real constant β, to be fixed below, controls the width of the momentum distri-\nbution. The units of Ψ\ninc are L-/2 and that's why we included the √a prefactor in\n(3). Recall that dk has units of L-1.\n(a) Write the reflected wavefunction (valid for x < 0) as an integral similar to (3).\nThis integral involves the phase shift δ(E) calculated in class.\nIntroduce a unit free version K of the wavenumber k, a unit-free version u of the\ncoordinate x, and a unit-free version τ of the time t as follows\nK\nk ≡a ,\nx ≡au ,\nt ≡ħτ .\n(5)\nV0\nNaturally, we will write k0 = K0/a. Note that kx = Ku.\n\nPhysics 8.04, Quantum Physics 1, Spring 2016\n(b) Show that the group velocity and the uncertainty relation for the incoming packet\ntake the form\ndu = #K0 ,\n∆u ∆K\n#\nτ\n≥\n,\nd\nwhere # represent numerical constants that you should fix (different constants!).\nUse the approximation that we have the full gaussian |Φ(K)|2 to determine the\nuncertainty ∆K in the incoming packet in terms of β. Assuming again that we\nhave a full gaussian, what would be (in terms of β) the minimum possible value of\nthe uncertainty ∆u for the associated coordinate space probability distribution?\n(c) Complete the following equations by fixing the constants represented by #\nE(k) = # V0K2 ,\ne2iδ(E) = # + #K2 + iK\np\n# + #K2 ≡w(K) .\n(d) Show that the delay ∆t = 2ħδ′(E) experienced by the reflected wave implies a\n∆τ given by\n#\n∆τ =\nK0\np\n,\n# + #K2\nwhere you must fix the constants.\n(e) Prove that the complete wavefunction Ψ(x, t) valid for x < 0 and all times, which\nwe now view as Ψ(u, τ) valid for u < 0 and all τ, takes the form\na\n#\n2Ψ(u, τ) =\nZ\ndKe-β2(K-K0)2e-i#K2τ\neiKu -e-iKuw(K)\n\nand determine the two missing constants.\n(f) Set β = 4 and K0 = 1. What are the values of ∆K and ∆u? What is the\npredicted time delay ∆τ? (Not graded: Can you make an informed guess if the\npacket will change shape quickly?)\nNow use Mathematica to calculate and make plots of the probability density\n|\na 2Ψ(u, τ)|2. Give the plot of the wavefunction for τ = -20, -5, and 0, and\nusing u ∈[-30, 0]. Examine the plot for τ = 20 and determine the time delay\n∆τ by looking at the position of the peak of the packet. Your answer should\ncome reasonably close to the analytical value you determined previously.\n5. Scattering offa rectangular barrier. Based on Griffiths 2.33. p.83. [10 points]\nDo only the cases E < V0 and E = V0.\nCan you get T = 1 for E < V0?\nFind the answer for E > V0 in some book (or do it). When does one get T = 1 for\nE > V0?\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n8.04 Quantum Physics I\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Assignment 9",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-04-quantum-physics-i-spring-2016/b460d8399091008e58b1c3a4110ede8e_MIT8_04S16_ps9_2016.pdf",
      "content": "Quantum Physics I (8.04) Spring 2016\nAssignment 9\nMIT Physics Department\nDue Friday April 29, 2016\nApril 21, 2016\n12:00 noon\nReading:\nGriffiths: section 4.1.\nProblem Set 9\n1. A numerical test of stationary phase. [10 points]\nWe have used stationary phase to figure out the time dependence of the position of\npeaks in wavepackets constructed from integral representations. More generally, the\nstationary phase approximation can help get the value of the integral itself.\nConsider the integral of a Gaussian peaked at x = 2 against a phase factor:\nf(λ) =\nZ inf\ndx e\n100(x\n2)2\n-\n-\neiφ(λ,x) ,\nφ(λ, x) = 50\n-inf\nx -1 λx4\n\n,\nλ ∈R .\nWe want to confirm that |f(λ)| peaks at a value λ∗selected by stationary phase and\nget the value of f(λ∗).\n(a) What is the width ∆at half-maximum for the gaussian? In other words, what\nis the largest ∆for which for all x in |x -2| ≤1∆the gaussian is larger than\nhalf-maximum? If you had to do the integral numerically, would it be safe to\nintegrate from 1 to 3? Explain.\n(b) Use stationary phase to find the critical value λ∗of λ for which f(λ) would have\nthe largest magnitude. For λ∗write φ(λ∗, x) as a Taylor expansion around x = 2\nup to and including terms quadratic in (x -2).\n(c) What is the excursion of the phase φ(λ∗, x) for |x -2| <\nOhanian, Chapter 11: Scattering and Resonances\n∆? Your result,\nexpressed in units of π, should imply that it is a decent approximation to ignore\nthe phase variation at the critical λ.\nDo so and then perform the resulting\nintegral analytically. The answer is a complex number. Write your answer in\nterms of a phase times the magnitude.\n(d) Perform the integral analytically using the quadratic approximation for the\nphase. Write your answer in terms of a phase times the magnitude.\n(e) Perform the integral numerically as a function of λ for the interval λ ∈[0, 1].\nPlot the absolute value |f(λ)|. What is the value of f(λ) for the critical λ?\nCompare with your previous estimates. What is the value of λ that leads to the\nlargest |f(λ)|?\n\nPhysics 8.04, Quantum Physics 1, Spring 2016\n2. Testing Levinson's theorem in an example [10 points].\nFor the potential V (x) = -V0 for 0 < x < a, V (x) = 0 for x > a and V (x) = inffor\nx < 0 we calculated in class the phase shift δ(E) finding\n1 -k′\ntan δ =\nk cot k′a tan ka\ntan ka + k′\n′\n,\nk cot k a\nwith\nk2\n2mE\n=\n,\nk′2\nm(E + V0)\n=\nħ2\n,\nz2\nmV0a2\nħ2\n0 =\nħ2\n(a) As the energy E goes to zero, ka →0. What happens to k′a? Show that tan δ\ngoes to zero, and thus we can take δ →0 as ka →0.\n(b) What is the limit for tan δ as E →inf? Explain in detail.\n(c) Call u ≡ka and write tan δ as a function of u and z0\ntan δ = f(u; z0)\n→\nδ = ArcTan [f(u; z0)] .\nWrite the function f(u; z0).\nIn order to construct plots with Mathematica, I found it difficult to use ArcTan[...]\nbecause it uses the range (-π/2, π/2) and the graphs give discontinuities. One option\n(suggested by W. Taylor) is to differentiate the ArcTan function and then to integrate\nit again! Since δ = 0 for u = 0 we can write:\nd\nδ(u; z0)\nZ u\n=\ndu′\nArcTan [f(u′; z0)] .\ndu′\nLet the computer take the derivative and integrate. If you find a simpler way to do\nthis let us know!\n(d) Graph the phases δ(u, z0) as a function of u for z0 = 2, 5, 9. For z = 2 use\nu ∈[0, 15], for z0 = 5 use u ∈[0, 20] and for z0 = 9 use u ∈[0, 30]. In each\ncase explain how the result is consistent with Levinson's theorem and state how\nclose is δ at the upper value of u to the expected value of δ(E = inf).\n\nPhysics 8.04, Quantum Physics 1, Spring 2016\n3. Scattering offa step and a wall [10 points]\nConsider the potential\n\nV0 ,\nfor\n0 < x < a ,\nV\nV (x) =\n\n0 > 0 ,\n\n0 ,\nfor\nx > a ,\n\ninf,\nfor\nx ≤0 .\nCalculate the phase shift δ(k) as a function of k. You will have to consider two cases:\n(a) E(k) > V\n′\n0 . Call k the wavenumber for x < a. You may want to do this\nstarting from the beginning (for practice). Otherwise you could try to use the\nexample worked in class (and Problem 2 here), where instead of a step we had\na well of depth V0, and modify the answer suitably. Leave your answer in the\nform cot δ = . . ..\n(b) E(k) < V0. You may want to do this starting from the beginning (for practice).\nOtherwise you could try some analytic continuation of the result of part (a).\nLeave your answer in the form cot δ = . . ..\n(c) Plot δ(k) as a function of u = ka ∈[0, inf] for a potential with z0 = 5 (recall\nthat z2\n0 = 2mV0a2\nħ2\n).\n4. Scattering offa delta function and a wall. [15 points]\nConsider our usual one-dimensional potential with V (x) = inffor x ≤0, and with\nV (x) = g δ(x -a) , g > 0\nx > 0 .\nWe scatter particles with mass m and energy E > 0 offthis potential. We have\n(ka)2\n2mEa\n=\nħ2\n,\nλ ≡mag , unit free.\nħ2\n(a) Calculate the phase shift δ(k). Write the answer in the form\nsin2(ka)\ntan δ = -\n,\nh(ka; λ)\nwhere h(ka; λ) is a function you must determine. Explain how, with δ known,\none readily finds the amplitude A(k) multiplying the 'sin' function in the wave-\nfunction for 0 < x < a.\n(b) To understand features of tan δ calculate the leading approximation to it for\nka ≪1. Discuss the λ dependence of the result. For arbitrary ka what does\ntan δ become for λ →inf?\n(c) Plot δ, the time delay 1\na\ndδ\ndk, and |A| as functions of ka ∈[0, 10] for λ = 5. Do\nyou see resonances? If so, identify the values of ka, the time delay 1\na\ndδ\ndk and the\nmagnitude of |A|. Is the plot of δ consistent with Levinson's theorem?\n\nPhysics 8.04, Quantum Physics 1, Spring 2016\n5. A few commutators and a few expectation values. [10 points]\n(a) Calculate the commutators\n[Lz, x] ,\n[Lz, y] ,\nand\n[Lz, z] .\n(b) Calculate the commutators\n[Lz, px] ,\n[Lz, py],\nand\n[Lz, pz] .\n(c) Assume ψ0 is an Lz eigenfunction. Show that py and px have zero expectation\nvalue in the state ψ0.\n(d) Assume ψ0 is an Lz eigenfunction. Show that y and x have zero expectation\nvalue in the state ψ0.\n6. Angular momentum in spherical coordinates. [10 points]\n(a) Calculate the nine partial derivatives of the spherical coordinates (r, θ, φ) with\nrespect to the Cartesian coordinates (x, y, z) expressing your answers in terms\nof the spherical coordinates.\n(b) Use the above results to write Lx, Ly, and Lz as differential operators in spherical\ncoordinates.\n(c) Compute L2\nx, L2\ny, and L2\nz as differential operators in spherical coordinates and\nuse your results to derive the expected form of L2 as a differential operator in\nspherical coordinates.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n8.04 Quantum Physics I\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Assignment 10",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-04-quantum-physics-i-spring-2016/badeeaf5742e3b1b60c69056933911bd_MIT8_04S16_ps10_2016.pdf",
      "content": "Quantum Physics I (8.04) Spring 2016\nAssignment 10\nMIT Physics Department\nDue Friday May 6, 2016\n29 April, 2016\n12:00 noon\nReading: Griffiths sections 4.1, 4.2, and 4.3.\nProblem Set 10\n1. Bound states from imaginary wavenumber [5 points]\nConsider the scattering solution for a finite range one-dimensional potential:\nψx(x) = eiδ(k) sin(kx + δ(k)) ,\nx > R .\nShow that having a bound state means A = eiδ\ns\nsin δ has a pole at k = iκ with κ > 0.\n2. Simultaneous eigenfunctions [5 points]\nˆ\nˆ\nConsider two Hermitian operators A and B that commute. Assume that at least\nˆ\none of the operators, say A, has no degeneracies in its spectrum. Show that the\nˆ\nˆ\neigenfunctions of A are also eigenfunctions of B.\n3. Expectation values in a particular wavefunction [10 points]. (Based on Oha-\nnian, Ch. 7, problem 17).\nSuppose a particle has the wavefunction\nψ(r, θ, φ) = 4\nr\nπ sin2 θ\n1 +\n√\n14 cos θ cos 2φ f(r) ,\nwith f(r) a normalized radial wavefunction.\n\n(a) Rewrite this wavefunction in terms of spherical harmonics. What are the pos-\nsible outcomes of the measurement of L2 and Lz? What are the corresponding\nprobabilities?\n(b) What are the expectation values of L2 and Lz?\n(c) Determine the uncertainties ∆L2 and ∆Lz.\n\nPhysics 8.04, Quantum Physics 1, Spring 2016\n4. Spherical wells. [10 points]\n(a) Consider l= 0 states of a particle moving in the infinite spherical well\nV (r) =\n(\n0 ,\nif r < a\ninf,\nif r > a .\nSolve the radial equation for the radial wavefunction u(r) and find the possible\nenergy levels. Recall that u must vanish at r = 0. Try matching this l= 0\nspectrum to that of a one-dimensional infinite well potential V (x).\n(b) Consider now states of a particle moving in a finite spherical well with V0 > 0:\nV (r) =\n(\n-V0\nif r < a\n0 ,\nif r > a .\nShow that there is no bound state if\nV\nπ2ħ\n0a\n<\n.\n8m\n5. Hydrogen atom with total momentum. [10 points] Based on Ohanian.\nWhen the motion of the nucleus is taken into account, the state of the hydrogen atom\ncan be represented by a wavefunction ψ(X, x), with X the center of mass coordinate\nand x = xe -xp the relative coordinate pointing from the proton to the electron.\nSuppose that the atom is in such a state that the total momentum has equal probabil-\nities for the values p0 and -p0. Moreover the internal states are φ1,0,0(x) or φ2,1,1(x)\nwith probabilities 1/4 and 3/4 respectively (we use the notation φnlm). These prob-\nabilities are not correlated with the total momentum.\n(a) Write an expression for ψ(X, x) ignoring the overall phase but including arbi-\ntrary constant phase factors where possible.\n(b) What is the expectation value for the total energy?\n\nPhysics 8.04, Quantum Physics 1, Spring 2016\n6. Virial Theorem and applications [15 points]\n(a) Consider any time independent operator Ωand the time derivative of its expec-\ntation value, which is given by\nd\niħ\nΩ\ndt⟨⟩=\n[ Ω, H ] ,\nwhere H is the Hamiltonian. Explain care\n\nfully wh\n\ny the right-hand side vanishes\nif the system is in a stationary state.\n(b) Now take Ω= r·p and show that for any stationary state of the hydrogen atom\nHamiltonian the following relation holds\n⟨T⟩= -1 V\n2⟨⟩.\nHere T is the kinetic energy operator and V is the potential energy operator.\n(c) For any hydrogen atom eigenstate write ⟨T⟩= 1m⟨v2⟩, where m is quite accu-\nrately the mass of the electron. Express the ratio\np\n⟨v2⟩\nc\nin terms of the fine structure constant α = e2\nħc ≃\n1 and the principal quantum\nnumber n. Is the electron relativistic? Give the corresponding results for the\nground state when the nucleus has Z protons.\n(d) What is\n\nr\n\nin a general energy eigenstate of the hydrogen atom?\n7. Exercises on hydrogen atom and some generalizations [10 points]\n(a) Find ⟨r⟩and ⟨r2⟩in the ground state of hydrogen. What is the most probable\nvalue of r in the ground state?\n(b) Assume that the nucleus of hydrogen has radius one femtometer. Calculate the\nprobability that the ground state electron is found inside the nucleus. Make\napproximations to simplify your work and still get a very accurate answer!\n(c) Positronium is a bound state of an electron and a positron (equal mass parti-\ncles!). What are the energy levels? How does the size of positronium compare\nwith the size of a hydrogen atom?\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n8.04 Quantum Physics I\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "Final Exam",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-04-quantum-physics-i-spring-2016/47367602c26c4559e9c267f8694203bf_MIT8_04S16_FinalTest_2015.pdf",
      "content": "8.04, Quantum Physics I, Fall 2015\nFINAL EXAM\nFriday December 18, 1:30-4:30 pm\nYou have 3 hours = 180 minutes.\nAnswer all problems in the white books provided. Write\nYOUR NAME and YOUR SECTION on your white\nbook(s).\nThere are six questions, totalling 105 points.\nThe first three questions are shorter, the last three ques-\ntions are longer.\nNo books, notes, or calculators allowed.\nShow your work CLEARLY!\n\nFormula Sheet\n-\nħc ≃197.3 MeV · fm ,\nm\nec ≃0.511 MeV ,\nmpc2 = 938 MeV ,\ne2\nħc ≃\n- Relativity: p = γ mv ,\nE = γmc2 ,\nE2 = p2c2 + m2c4 ,\nγ =\n√\n,\n1-β2\nβ = v\nc\n- Photons:\nE = hν ,\np = h ,\nor\nE = ħω ,\np = ħk\nλ\n- Wavelengths\nh\nde Broglie: λ =\nh\n,\nCompton: λC =\np\n.\nmc\n- Momentum and position operators\nħ\np =\ni\n∂\n∂x ,\n[x, p ] = iħ,\np = ħ\nħ\n,\ni ∇\n[xi, pj ] = iħδij ,\n[ pi, f(x)] =\ni\n∂f\n∂xi\n- Schro dinger equation\n∂Ψ\niħ∂t (x, t) =\n\n-ħ2\n2m∇+ V (x, t)\n\nΨ(x, t) ,\n∂ρ(x, t) +\n∂t\n∇· J(x, t) = 0\nħ\nρ(x, t) = |Ψ(x, t)|2 ;\nJ(x, t) =\nIm [Ψ∗\nm\n∇Ψ]\n- Fourier transforms:\nΨ(x) = √\nd\n2π\nZ\nk Φ(k)eikx ,\nΦ(k) = √\nZ\ndx Ψ(x)e-ikx ,\nZ\ndx |Ψ(x)\n2π\n|2 =\nZ\ndk |Φ(k)|2\nΨ(x) =\n(2π)\nd\nZ\n3k Φ(k)eik·x , Φ(k) =\n(2π)\nd\nZ\n3x Ψ(x)e-ik·x ,\nZ\nd3x |Ψ(x)|2 =\nZ\nd3k |Φ(k)|2\ninf\n2π\nZ\neikx\ndx = δ(k) ,\n-inf\nZ inf\neik·x d3x = δ(3)(k)\n(2π)3\n-inf\nZ +inf\ndx exp\n-inf\n-ax2 + bx\n\n=\nrπ\na exp\nb2\n,\nwhen Re(a) > 0 .\n4a\n- Wavepackets\ndω\nvgroup =\n,\n∆k ∆x\nk\n≃1 ,\nshape preserving : t ∆v\nd\n≤∆x\n- Hermitian conjugation:\nZ\ndx (KΨ(x, t))∗Ψ(x, t) =\nZ\ndx Ψ∗(x, t) (K+Ψ(x, t))\nIf K+ = K, then K is Hermitian.\n\n- Expectation values\n⟨Q⟩(t) =\nZ\ndx Ψ∗(x, t)(QΨ(x, t))\n- Time evolution of expectation value. For Q Hermitian\nd\niħ\n,\nd ⟨Q\nQ\nt\n⟩=\n\n[\nH]\n\n- Commutator identity\n[A, BC] = [A, B]C + B[A, C]\n- Uncertainty ∆Q of a Hermitian operator Q\n(∆Q)2 = ⟨Q2⟩-⟨Q⟩2 =\n\n(Q -⟨Q⟩)2\n- Uncertainty principle:\n∆x ∆p ≥ħ\n∆x = ∆\n√\nħ\nand ∆p =\n√\nfor ψ\n2∆\n∼exp\n\n-\nx2\n2 ∆2\n\n- Stationary state:\nħ2\nΨ(x, t) = ψ(x)e-iEt/ħ,\n-2m\nd2\nψ(x) + V (x)ψ(x) = E ψ(x)\ndx2\n- Infinite square well\n(\n0 ,\nfor 0 < x < a,\nV (x) =\ninf\notherwise\nψn(x) =\nr\na sin nπx\na\n,\nEn = ħ2π2n2\n,\nn = 1, 2, . . .\n2ma2\n- Finite square well bound states: E ≤0\n(\n-V0 ,\nfor\nx\nV (x) =\n| | < a,\nV0 > 0\nfor |x| > a\n2m(E + V\nη2 ≡\n0)a\n,\nξ2\nm\nħ2\n|E|a2\n≡\n,\nz2\nmV\nħ2\n0 ≡\n0a2\nħ2\n→\n|E|\nV0\n= ξ2\n,\nξ2 + η2 = z2\nz2\nEven solutions:\nξ = η tan η\nOdd solutions:\nξ = -η cot η\n- Delta function potential:\nmα2\nV = -α δ(x),\nα > 0,\nBound state:\nE = -2ħ2\n\n- Harmonic Oscillator\nˆH =\npˆ2 +\n2m\nˆ\nmω2xˆ2 = ħω (N + 1\nˆ\n) ,\nN = aˆ+aˆ\naˆ =\nrmω\n2ħ\n\nˆx + iˆp\nmω\n\n,\nˆa+ =\nrmω\n2ħ\n\nˆx -iˆp\n,\nmω\n\nxˆ =\nr\nħ\n(aˆ + aˆ+) ,\npˆ = i\n2mω\nr\nmωħ(aˆ+ -aˆ) ,\nx, p\niħ,\na, a+\n,\nNˆ, a\n-a ,\nNˆ\n[ˆ ˆ] =\n[ˆ ˆ ] = 1\n[\nˆ ] =\nˆ\n[\n, aˆ+ ] = aˆ+ .\nω\naˆφ0 = 0 ,\nφ0( ) =\nm\nx\nπħ\n/4\nexp\n\nmω\n-\nx2\n2ħ\n\n.\nφn = √\n(a+)nφ0\nn!\nHˆ φn = En φn = ħω\nn + 1 φ\n\nn ,\nNˆ φn = n φn ,\n(φm , φn) = δmn\naˆ+φn =\n√\nn + 1 φn+1 ,\nˆa φn = √n φn-1 .\n- Positive energy states\nħ\nψ(x) = Aeikx + Be-ikx\nk\n,\nJ =\nm\n|A|2 -|B|2\n,\nE = ħ2k2\n2m\n- Scattering in 1D. V (x) = inffor x ≤0. Solution φ(x) = sin kx when V = 0.\nψ(x) = eiδ sin(kx + δ) ,\nx > R (R is the range)\nScattered wave: ψ = φ + ψs\nψ\ni\ns = Ase kx ,\nAs = eiδ sin δ\ndδ\nTime delay:\n∆t = 2ħdE\n→\nR\ndδ\n∆t\n=\ndk\nfree transit time\nNbound =\nδ(0) -δ(inf)\nπ\nResonances: Rapid growth in δ\n, large time d\n\n(Levinson's theorem)\nelay, large amplitude in the inner region.\n\n- Orbital angular momentum\nˆLx = yˆpˆz -\nˆ\nˆ\nzˆpˆy ,\nLy = zˆpˆx -xˆ pˆz ,\nLz = xˆ pˆy -yˆpˆx .\nLˆ , Lˆ\niħLˆ ,\nLˆ , Lˆ\niħLˆ\nLˆ\n[\nx\ny ] =\nz\n[\ny\nz ] =\nx ,\nˆ\n[\nħˆ\nz , Lx ] = i Ly .\nLˆ2 ≡Lˆ ˆ\nxL\nˆ\nx + L ˆ\nyL\nˆ\ny + LzLˆz ,\nˆ\n[ L2 , Lˆi ] = 0\n∇2\n= r\n∂2\n∂r2 r + 1\nr2\n∂2\n∂θ2 + cot θ ∂\n∂θ +\n∂2\nsin2 θ ∂φ2\n\n∂\nLˆ2 = -\nħ\n\n∂\n∂2\n+ cot θ\n+\n∂θ2\n∂θ\nsin2 θ ∂φ2\n\nħ\nˆLz = i\n∂\n∂φ ;\nˆL± = ħe±iφ\n\n± ∂\n∂θ + i cot θ ∂\n∂φ\n\n- Spherical Harmonics\nY\n(θ, φ) ≡N\nP m\ni\nl,m\nl,m\nl(cos θ)e mφ\nˆLz Y\nħ\nlm =\nm Ylm\nLˆ2 Ylm =\nħl(l+ 1) Ylm\nZ\n2π\ndΩY ∗\nlm (θ, φ) Ylm(θ, φ) = δl′,lδm′\n′\n′\n,m ,\nZ\ndΩ=\nZ\ndφ\nZ\nd(cos θ)\n-1\nY0,0(θ, φ) = √\n4π ;\nY1,±1(θ, φ) = ∓\nr\n8π sin θ exp(±iφ) ;\nY1,0(θ, φ) =\nr\n3 cos θ\n4π\n- Central potentials: V (r) = V (r)\nu(r)\nψ(r, θ, φ) =\nYlm(θ, φ)\nr\n\nħ2 d2\nħ2 l(l+ 1)\n-\n+ V (r) +\n\nu(r) = Eu(r)\n2m dr2\n2mr2\nu(r) ∼rl+1 ,\nas r →0 .\n\n- Hydrogen atom:\np2\nZe2\nH = 2m -\nr\nZ2e2 1\nħ2\ne2\nEn = -\n,\na0 =\n≃0.529 × 10-10m ,\n13.6 eV\n2a\n0 n\nme\n2a0\n≃\nl\nZr\nψn,l,m(x) = A\nr\nr\n\nPolynomial in\n0 of degree n -(l+ 1)\n\ne-na0 Yl,m(θ, φ)\na\na\nn = 1, 2, . . . ,\nl= 0, 1, . . . , n -1 ,\nm = -l, . . . , l\nunl(r)\nψn,l,m(x) =\nYl,m(θ, φ)\nr\n2r\nu1,0(r) =\nexp( r/a0)\n3/2\na0\n-\n2r\nr\nu2,0(r) =\nexp( r/2a0)\n(2a0)3/2\n\n-2a0\n\n-\nr2\nu2,1(r) = √\nexp( r/2a0)\n3 (2a\n0) /2 a0\n-\n\n1. Virial Theorem for one-dimensional potentials. [15 points]\n(a) Let ψ(x) be an energy eigenstate. Explain why the expectation value [H, Ω] of\nthe commutator of H with an arbitrary operator Ωvanishes on the sta\n\nte ψ.\n\n(b) Choose Ω= xp, and take\np2\nH =\n+ V (x) .\n2m\nUse the claim from part (a) to find a relation between the expectation value ⟨T⟩\nof the kinetic energy and the expectation value of a combination of x and the\nderivative V ′(x) of the potential with respect to its argument. Both expectation\nvalues are taken on an energy eigenstate.\n(c) What does your result in (b) imply for the relation between ⟨T⟩and ⟨V ⟩for the\ncase of the one-dimensional harmonic oscillator?\n2. Electron orbit in the Hydrogen Atom [15 points]\nThroughout this problem we consider a hydrogen atom with fixed principal quantum\nnumber n, with l= n -1, and m = n -1. The value n is arbitrary and possibly large.\n(a) Write the wavefunction ψn,l,m(r, θ, φ) in terms of the relevant spherical harmonic\nand a radial factor fully determined except for an overall unit-free normalization\nconstant N.\n(b) Give, up to normalization, the radial probability density P(r) for which P(r)dr\nis the probability to find the electron in the interval (r, r + dr). For what value\nof r is P(r) maximum? For large n this is actually a rather sharp maximum.\n(c) It is known that, up to normalization,\n|Y\n(θ, φ)|2\nl\n,\n≃\nll\n(sin θ)\n.\nSketch |Yl,l|2 as a function of θ ∈[0, π] when lis a large integer. Describe in\nwords and/or with a picture, the locus where the electron is likely to be found for\nn large and l= m = n -1.\n\n3. Finding the outgoing wave-packet [15 points]\nIn a one-dimensional scattering problem with a potential of range R we write the\nsolution ψ(x) for x > R as\nψ(x) = eiδ(k) sin\nkx + δ(k)\n\n,\nx > R .\n(a) Decompose this ψ(x) into the sum of an incident wave ψinc(x) traveling towards\nx = 0 and an outgoing wave ψout(x) traveling away from x = 0.\n(b) We send in a localized wave-packet Ψinc(x, t) given by\ninf\nΨinc(x, t) =\nZ\ndk f(k) e-ikxe-iE(k)t/ħ,\nx > R ,\nwith f(k) a function whose magnitude peaks sharply for k = k0 > 0. Write an\nanalogous expression for the associated out-going wave packet Ψout(x, t).\n(c) Use the stationary phase approximation to find the relation between x and t that\ndescribes the motion of the outgoing packet Ψout(x, t).\n\n4. Towards perfect bomb detection [20 points]\nWe modify the Mach-Zehnder setup to increase towards 100% the fraction of Elitzur-\nVaidman (EV) bombs that can be vouched to work without detonating them. An EV\nbomb is triggered by a photon detector: if operational any photon incident on the\ndetector will make the bomb explode, if defective the detector lets all photons through\nand the bomb does not explode.\nTo improve detection we use a high reflectivity beam-splitter, henceforth called BS,\nrepresented by a two-by-two unitary matrix U of the form\nπ\n=\n\ncos\nU\n2N\ni sin\nπ\n2N\ni sin\nπ\n2N\ncos\nπ\n,\n2N\n!\nwith N some large, fixed, positive integer.\nNote that BS is a beam splitter with\nreflectivity R and transmissivity T given by\nπ\nR =\n\ncos 2N\n,\nT =\n\nsin π\n,\nR + T = 1 .\nN\nWe will imagine the beamsplitter BS placed vertically, with a photon to the left of BS\nrepresented by\nand a photon to the right of BS represented by\n\n. This holds\nboth for photons moving towards or away from BS.\ns\nU\no\n\nco α\ni sin α\nseful f rmula:\ni sin α\ncos α\n!\ncos β\ni sin β\ncos(α + β)\ni sin(α + β)\n=\n.\ni sin β\ncos β\n!\n\ni sin(α + β)\ncos(α + β)\n!\n(a) Calculate the k-th power Uk of the matrix U.\n(b) We now construct a cavity in which the beam-splitter BS is placed in between\nperfectly reflecting mirrors M1 and M2 at equal distances to the left and to the\nright. A photon is sent in from the left, as shown in the figure. The photon will\nhit BS and split, the reflected and transmitted components will bounce offthe\nmirrors and hit BS a second time, and so on and so forth.\n\nAfter k hits of the BS what is the probability pL(k) that the photon will be found\non the left side of the cavity and what is the probability pR(k) that it will be\nfound on the right side of the cavity?\nWhat are those probabilities for k = N?\n(c) A photon detector is inserted on the right side of the cavity, so that any photon\nreaching the right side will be detected (and absorbed!). As before, a photon is\nsent in from the left. After waiting for the time needed for N hits on BS, what is\nthe probability PL(N) that the photon will be found on the left side of the cavity?\nWhat is the probability PD(N) that the photon has been detected?\n(d) Estimate PL(N) and PD(N) in the limit as N is large. Helpful formulae: cos o ≃\n1 -1o2 , (1 + o)k ≃1 + ko for o sufficiently small.\n(e) Given an EV bomb, we insert it on the right side of the cavity. We send in a\nphoton from the left and wait for the time needed for N hits of the BS. At that\npoint, if the lab does not blow up, we look for the photon.\ni. What can we conclude if the photon is found on the left side of the cavity?\nii. What is the probability PE(N) that an operational EV bomb will explode in\nthis experiment? Give an approximate value for N = 250.\n\n5. Infinite square well with extra dimension = a truncated cylinder [20 points]\nA particle in a one-dimensional infinite square well of width a can be thought as a\nparticle forced to move on a line segment of length a. Consider a particle moving on a\nsmall cylinder of length a. The cylinder has circumference L and it can be represented\nas a rectangular region in the (x, y) plane, with the y coordinate along the circumference\nof the cylinder and the horizontal lines with arrows identified:\nThe system is described by the two-dimensional Schro dinger equation (SE) with a\npotential that vanishes in the rectangle {(x, y) : 0 ≤x ≤a , 0 ≤y ≤L}, and is infinite\non the vertical edges at x = 0 and x = a.\n(a) Perform separation of variables in the SE and give the two equations that help\ndetermine the energy eigenstates. State the boundary conditions that apply.\n(b) Solve for the energy eigenvalues Enland normalized eigenstates ψnl(x, y), where\nn and lare quantum numbers for the x and y dependence, respectively. State\nprecisely the ranges n and lrun over.\n(c) What is the ground state energy of the particle?\n(d) Assume henceforth that a and L are such that no accidental degeneracies occur\n(accidental degeneracies are those that require special relations between a and L).\nWhat is the list of energy eigenvalues for the particle in the cylinder that coincide\nwith those for the one-dimensional segment x ∈[0, a].\n(e) What are (or is) the lowest energy levels that exist on the cylinder but do not\nexist in the segment?\n(f) The y dimension that turns the segment into a cylinder may be considered as a yet\nundetected small extra dimension. Suppose the size L of the extra dimension is\nabout 1000 times smaller than the size a of a small interval where an experimenter\nhas localized a particle. Assume also that the length a and the particle mass m\nare such that\nħ2\n= 1 eV.\n2ma2\nEstimate the minimum energy that the experimenter needs to explore to find\nevidence for the extra dimension?\n\n6. Resonant transmission across two delta functions [20 points]\nConsider a potential with two positive-strength delta functions, one at x = -a and\nanother at x = a:\nV (x) = gδ(x + a) + gδ(x -a) .\nNote the unit-free combination λ that represents the effective strength of the potential:\nmag\nλ =\nħ2\n≥\n.\nIn solving the general scattering problem of a particle incident from the left one sets\nup a wavefunction\n\nAeikx + Be-ikx\nψ(x) =\n\n,\nx < -a ,\nCeikx + De-ikx ,\nikx\n|x| < a ,\nFe\n,\nx > a .\nHere A, B, C, D, F are complex c\n\nonstants that must be adjusted for this to be a solution\nof the time-independent Schro dinger equation. We are interested in finding the energies\nfor which there is resonant transmission, namely, the transmission coefficient is one!\n(a) Which of the complex constants in the above ansatz for ψ should vanish for\nresonant transmission? Explain briefly.\n(b) Assume this constant vanishes and find the four equations that implement the\nboundary conditions. Clean them up and put them in the form:\nC + D e··· =\n·\n· ·\nC + D e· ·\n·\n=\nC -D e···\n· · ·\n= · · ·\nC -D e··· = · · ·\nThe expressions indicated by dots should be written in terms of ka, λ, constants\nin the ansatz for ψ and numerical constants.\n(c) We now claim that the existence of a solution for the above equations requires\nξ cot ξ = -2λ ,\nwith\nξ = 2ka .\n(1)\nYou need not prove this! Show a plot of ξ cot ξ for ξ ∈[0, 3π]. Show the -2λ\nline in the plot for both very small and very large λ. For λ ≪1 what are the\napproximate values of ka for perfect transmission.\nFor λ ≫1 what are the\napproximate values of the ka for perfect transmission?\n(d) Under condition (1) one can prove that\nC\nD = -\nλ\n,\nC =\ncos(2ka)\n\n1 +\nA\nika\n\n.\nConsider the case of λ ≫1 and the first resonant transmission. Find an approx-\nimate formula for ψ in the region |x| < a and setting A = 1 do a rough plot of\n|ψ(x)|2 for all x. Comment on the features of your plot!\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n8.04 Quantum Physics I\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Test 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-04-quantum-physics-i-spring-2016/698de341e6bb0dd4f2f1207cf4af41f2_MIT8_04S16_Test1_Fall2015.pdf",
      "content": "8.04, Quantum Physics I, Fall 2015\nTEST 1\nTuesday October 20, 9:30-11:00 pm\nYou have 90 minutes.\nAnswer all problems in the white books provided. Write\nYOUR NAME and YOUR SECTION on your white\nbook(s).\nThere are five questions, totalling 100 points.\nNo books, notes, or calculators allowed.\nShow your work CLEARLY!\n\nFormula Sheet\n-\nħc ≃197.3 MeV · fm\n,\nmec2 ≃0.511 MeV ,\nmpc2 = 938 MeV ,\ne\nħc ≃\n- Relativity: p = γ mv ,\nE = γmc2 ,\nE2 = p2c2 + m2c4 ,\nγ =\n√\n1-β2 ,\nβ = v\nc\n- Photons:\nE = hν ,\np = h ,\nor\nE = ħω ,\np = ħk\nλ\n- Wavelengths\nh\nde Broglie: λ =\nh\n,\nCompton: λC =\np\n.\nmc\n- Momentum and position operators\nħ\np =\ni\n∂\n∂x ,\n[x, p ] = iħ,\np = ħ\n,\ni ∇\n[xi, pj ] = iħδij\n- Schro dinger equation\n∂Ψ\niħ\n(x, t) =\n\nħ2\n-\n∇2 + V (x, t)\n∂t\n2m\n\nΨ(x, t) ,\n∂ρ(x, t) +\n∂t\n∇· J(x, t) = 0\nħ\nρ(x, t) = Ψ(x, t) 2 ;\nJ(x, t) =\nIm [Ψ∗\nΨ]\n|\n|\nm\n∇\n- Fourier transforms:\nΨ(x) = √\nZ\ndk Φ(k)eikx ,\nΦ(k) =\nd\n2π\n√\n2π\nZ\nx Ψ(x)e-ikx ,\nZ\ndx |Ψ(x)|2 =\nZ\ndk |Φ(k)|2\nΨ(x) =\nZ\nd3\nk Φ(k)eik·x , Φ(k) =\nZ\nd3x Ψ(x)e-ik·x\n,\nd3x Ψ(x) 2 =\nd k Φ(k) 2\n(2π) 2\n(2\nπ) 2\nZ\n|\n|\nZ\n|\n|\n1 Z inf\neikxdx = δ(k) ,\n2π\n-inf\n(2π)3\nZ inf\neik·x d3x = δ(3)(k)\n-inf\nZ +inf\nπ\nb2\ndx exp\nax2 + bx =\nexp\n,\nwhen Re(a) > 0 .\n-inf\n-\nr\na\n\n4a\n\n- Wavepackets\ndω\nvgroup =\n,\n∆k ∆x\nk\n≃1 ,\nshape preserving : t ∆v\nd\n≤∆x\n- Hermitian conjugation:\nZ\ndx (KΨ(x, t))∗Ψ(x, t) =\nZ\ndx Ψ∗(x, t) (K+Ψ(x, t))\nIf K+ = K, then K is Hermitian.\n\n- Expectation values\n⟨Q⟩(t) =\nZ\ndx Ψ∗(x, t)(QΨ(x, t))\n- Time evolution of expectation value. For Q Hermitian\nd\niħ\n,\nd ⟨Q\nQ\nt\n⟩=\n\n[\nH]\n\n- Commutator identity\n[A, BC] = [A, B]C + B[A, C]\n- Uncertainty ∆Q of a Hermitian operator Q\n(∆Q)2 = ⟨Q2⟩-⟨Q⟩2 =\n\n(Q -⟨Q⟩)2\n- Uncertainty principle:\n∆x ∆p ≥ħ\n\n1. Estimate and units [10 points]\nThe size of a proton (more technically, the so-called charge radius) is about 0.9 fm.\nHow does its Compton wavelength compare with the size? The possible answers are:\nThe Compton wavelength is [ a lot bigger, a little bigger, a little smaller, and a lot\nsmaller ] than the size. Which one is it?\n2. Group velocity [10 points]\nFor a relativistic particle E2 = p2c2 + m2c4. Evaluate the group velocity vg =\ndω\ndk\nrecalling that E = ħω and p = ħk. Leave your answer in terms of the velocity v of the\nparticle (without any approximation!).\n3. Free particle evolution [15 points]\nConsider the state of a free particle of mass m that at time equal zero is represented\nby the wavefunction\nΨ(x, 0) = sin k0x ,\nk0 ∈R .\n(a) Find the probability current J(x, 0).\n(b) If we measure the momentum of the particle (at time equal zero) what are the\npossible values that we may obtain?\n(c) Calculate Ψ(x, t).\n\n4. Improving on bomb detection [35 points]\nWe modify the Mach-Zehnder interferometer to increase the percentage of Elitzur-\nVaidman bombs that can be vouched to work without detonating them.\nFor this purpose we build a beam-splitter with reflectivity R and transmissivity T. A\nphoton incoming (from either port) has a probability R to be reflected and a probability\nT to be transmitted (R + T = 1). Let r and t denote the positive square roots:\nr\n√\n≡\nR ,\nt ≡\n√\nT .\n(a) Build the two-by-two matrix U that represents the beam splitter. For this consider\nwhat happens when a photon hits the beam splitter from the top side (input here\nis\n\n) and when it hits it from the bottom side (input here is\n\n). To fix\nconventions U will have all entries positive (and real) except from the bottom\nright-most element (the 2,2 element). Confirm that U is unitary.\nThe interferometer with detectors D0 and D1 (shown below) uses two identical\ncopies of the beam splitter. The incoming photon arrives from the top side.\n(b) A defective bomb is inserted in the lower branch of the interferometer. What are\nthe detection probabilities P0 and P1 at D0 and D1 respectively?\n(c) A functioning bomb inserted in the lower branch of the interferometer. What\nis the detonation probability Pboom and the detection probabilities P0 and P1?\nExpress your answers in terms of R and T.\n(d) You test bombs until you are reasonably sure that either they malfunction or that\nthey are operational. What fraction f of the operational bombs can be certified\nto be good without detonating them? Give your answer in terms of R. What is\nthe maximum possible value for f?\n\n5. Overlap between moving gaussians [30 points]\nWe have learned (homework) that the overlap\ndxΨ∗\n1Ψ2 between two different wave\npackets Ψ1 and Ψ2 is, on general grounds, time\nR\nindependent.\nThe following EXAMPLE seems to be in tension with this fact: Consider two gaussians\nthat coincide at t = 0 but are moving in opposite directions with large momenta\ncompared to their momenta uncertainties. Now we make two claims:\n1. At t = 0 the overlap is big.\n2. Once the centers of the packets are separated by a small multiple of the position\nuncertainty the overlap is small.\nThe purpose of this problem is to find a flaw in the claims of the EXAMPLE.\nˆ\nConsider a free particle and a normalized gaussian wavepacket Ψ at zero time:\nˆΨ(x, 0) = (2π)1/4√a exp\n\n-x2\n.\n4a2\n\nFrom this we create two wavepackets Ψ1 and Ψ2:\nΨ1(x,\nˆ\n0) ≡eiqx/ħΨ(x, 0) ,\nΨ2(x,\nˆ\n0) ≡e-iqx/ħΨ(x, 0) .\nHere q is a real quantity with units of momentum.\n(a) What is ⟨p⟩\nˆ\nfor Ψ(x, 0) ? Will this expectation value change in time? Explain.\n(b) What is ⟨p⟩for Ψ1(x, 0) ? What is ⟨p⟩for Ψ2(x, 0) ? Do these expectation values\nchange in time?\n(c) Compute the zero-time overlap γ(0) of the two packets:\nγ(0) =\nZ\nΨ∗\n1(x, 0)Ψ2(x, 0)dx .\nThe following integral may be useful:\nZ inf\ne-ax2+bxdx =\n-inf\nr π\na exp\nb2\n(\n\n,\nwhen Re a) > 0 .\na\n(d) Write an inequality that expresses the fact that the momentum of the wave-\npackets is large compared to the momentum uncertainty. What was wrong with\nthe claims of the EXAMPLE ?\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n8.04 Quantum Physics I\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Test 2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-04-quantum-physics-i-spring-2016/7aa68fd69386743f73ea86101559753d_MIT8_04S16_Test2_Fall2015.pdf",
      "content": "8.04, Quantum Physics I, Fall 2015\nTEST 2\nTuesday November 17, 9:30-11:00 pm\nYou have 90 minutes.\nAnswer all problems in the white books provided. Write\nYOUR NAME and YOUR SECTION on your white\nbook(s).\nThere are five questions, totalling 100 points.\nNo books, notes, or calculators allowed.\nShow your work CLEARLY!\n\nFormula Sheet\n-\nħc ≃197.3 MeV · fm\n,\nmec2 ≃0.511 MeV ,\nmpc2 = 938 MeV ,\ne\nħc ≃\n- Relativity: p = γ mv ,\nE = γmc2 ,\nE2 = p2c2 + m2c4 ,\nγ =\n√\n1-β2 ,\nβ = v\nc\n- Photons:\nE = hν ,\np = h ,\nor\nE = ħω ,\np = ħk\nλ\n- Wavelengths\nh\nde Broglie: λ =\nh\n,\nCompton: λC =\np\n.\nmc\n- Momentum and position operators\nħ\np =\ni\n∂\n∂x ,\n[x, p ] = iħ,\np = ħ\n,\ni ∇\n[xi, pj ] = iħδij\n- Schro dinger equation\n∂Ψ\niħ\n(x, t) =\n\nħ2\n-\n∇2 + V (x, t)\n∂t\n2m\n\nΨ(x, t) ,\n∂ρ(x, t) +\n∂t\n∇· J(x, t) = 0\nħ\nρ(x, t) = Ψ(x, t) 2 ;\nJ(x, t) =\nIm [Ψ∗\nΨ]\n|\n|\nm\n∇\n- Fourier transforms:\nΨ(x) = √\nZ\ndk Φ(k)eikx ,\nΦ(k) =\nd\n2π\n√\n2π\nZ\nx Ψ(x)e-ikx ,\nZ\ndx |Ψ(x)|2 =\nZ\ndk |Φ(k)|2\nΨ(x) =\nZ\nd3\nk Φ(k)eik·x , Φ(k) =\nZ\nd3x Ψ(x)e-ik·x ,\nx\n=\nZ\nd3\nZ\nd\n|Ψ(x)|\nk |Φ(k) 2\n(2π) 2\n(2π) 2\n|\n1 Z inf\ninf\neikx\ndx = δ(k) ,\nZ\neik·x d3x = δ(3)(k)\n2π\n-inf\n(2π)3\n-inf\nZ +inf\nπ\nb2\ndx exp\n-ax2 + bx\ne\ninf\n\n=\nr\nxp\n-\na\n\n,\nR\na\n\nwhen\ne(a) > 0 .\n- Wavepackets\ndω\nvgroup =\n,\n∆k ∆x\nk\n≃1 ,\nshape preserving : t ∆v\nd\n≤∆x\n- Hermitian conjugation:\nZ\ndx (KΨ(x, t))∗Ψ(x, t) =\nZ\ndx Ψ∗(x, t) (K+Ψ(x, t))\nIf K+ = K, then K is Hermitian.\n\n- Expectation values\n⟨Q⟩(t) =\nZ\ndx Ψ∗(x, t)(QΨ(x, t))\n- Time evolution of expectation value. For Q Hermitian\nd\niħ\n,\nd ⟨Q\nQ\nt\n⟩=\n\n[\nH]\n\n- Commutator identity\n[A, BC] = [A, B]C + B[A, C]\n- Uncertainty ∆Q of a Hermitian operator Q\n(∆Q)2 = ⟨Q2⟩-⟨Q⟩2 =\n\n(Q -⟨Q⟩)2\n- Uncertainty principle:\n∆x ∆p ≥ħ\n- Stationary state:\nħ2\nΨ(x, t) = ψ(x)e-iEt/ħ,\n-\n2ψ(x) + V (x)ψ(x) = E ψ(x)\n2m∇\n- Infinite square well\n(\n0 ,\nfor 0 < x < a,\nV (x) =\ninf\notherwise\nψn(x) =\nr\na sin nπx\na\n,\nEn = ħ2π2n2\n,\nn = 1, 2, . . .\n2ma2\n- Finite square well bound states: E ≤0\n(\n-V0 ,\nfor\nx\nV (x) =\n| | < a,\nV0 > 0\nfor |x| > a\n2m(E + V\nη2 ≡\n0)a\nħ2\n,\nξ2 ≡2m|E|a2\nħ2\n,\nz2\n0 ≡2mV0a2\nħ2\n→\n|E|\nV0\n= ξ2\n,\nξ2 + η2 = z2\nz2\nEven solutions:\nξ = η tan η\nOdd solutions:\nξ = -η cot η\n- Delta function potential:\nmα2\nV = -α δ(x),\nα > 0,\nBound state:\nE = -2ħ2\n\n- Harmonic Oscillator\nHˆ\nˆ\n=\npˆ2\n+\nmω2xˆ2 = ħω\nˆ\n(N + 1) ,\nN = aˆ+aˆ\n2m\naˆ =\nrmω\nipˆ\nmω\nipˆ\nxˆ +\n,\naˆ+ =\nxˆ\n,\n2ħ\nmω\n\nr\n2ħ\n\n-mω\n\nxˆ =\nr\nħ\nmωħ\n(aˆ + aˆ+) ,\npˆ = i\nr\n(aˆ+\n2mω\n-aˆ) ,\n[xˆ, pˆ] = i\n+\nħ,\n[aˆ, a\nˆ\nˆ\n= 1 ,\nˆ\n]\n[N, aˆ ] = -aˆ ,\n[N , aˆ+ ] = aˆ+ .\nmω1/4\nmω\naˆφ0 = 0 ,\nφ0(x) =\nexp\nx\nπħ\n\n-\n2ħ\n\n.\nφn = √\n(a+)nφ0\nn!\nHˆ φn = En φn = ħω\nn + 1\nφn ,\nNˆ φn = n φn ,\n(φm , φn) = δmn\naˆ+φn =\n√\nn + 1 φn+1 ,\naˆ φn = √n φn-1 .\n\n1. Sketching wavefunctions [20 points]\nA symmetric potential is attached to the first inside page of your blue book (it is also\nthe last page on this test.)\nThe potential is infinite for |x| > a and it is an even\nfunction of x. Indicated on the figure as horizontal dashed lines are the first (ground\nstate), the second, and the fifth energy levels. Sketch the associated wavefunctions.\nPay attention to symmetry, convexity or concavity, inflection points, nodes, amplitude,\nand wavelength.\n2. Cleaning up units [15 points]\nIn the hydrogen atom, the length scale is the Bohr radius a0 given by\nħ2\na0 =\n.\nme2\nConsider now the \"radial equation\" for the radial part ψ(r) of the wavefunction:\n\nħ2\n-2m\nd2\ndr2 + ħ2l(l+ 1)\n2mr2\n-e2\n(\nr\n\nψ(r) = Eψ r) .\nHere lis a non-negative integer. Clean up the equation by defining a unit-free coordi-\nnate u and a unit-free energy E so that the equation will take the form:\n\nd2\n-\n+\n. . .\nu\nu2\n\nψ( ) =\nd\nE ψ(u) .\n(a) How are r and u related?\n(b) How are E and E related?\n(c) Complete the above equation.\n3. Exercises with the harmonic oscillator [15 points]\n(a) Calculate\n(b) Calculate\nφn, (xˆ)3φn\n\n.\nφ0, (xˆ)10φ10\n\n.\n\n4. Ground state and first excited state of a potential [20 points]\nConsider the even potential sketched below, with height V0 except for a dip around\nx = 0, near which the potential is accurately described by a quadratic function:\nV (x) ≃\n1αx2 ,\nx near 0 ,\nwhere α > 0 is a constant.\n(a) Use the harmonic oscillator to give an estimate for the ground state energy. Find\nan inequality satisfied by α, V0, m, and ħrequired for the accuracy of your result.\n(b) Now consider the even potential built by using two copies of the potential above,\nwith well-separated centers at ±x0.\nGive the approximate energies of the ground state and the first excited state\nof this potential and sketch the associated wavefunctions. Write an inequality\ninvolving x\nħ\n0, α, , m required for the accuracy of your result.\n(c) Combine your two inequalities into the form\n. . . ≪α ≪. . .\nwhere the dots represent quantities you must write out.\n\n5. From square well to delta function [30 points]\nIn this problem we ask you to derive the bound state energy of a particle of mass m\non the delta function potential\nVδ(x) = -α δ(x) ,\nα > 0 ,\nstarting from the problem of a particle of mass m on a finite square well potential. For\nthis purpose consider a square well with potential Va(x):\n(\n-V0 ,\nfor |x| < a,\nV0 > 0\nVa(x) =\nfor |x| > a\nWe think of the total width 2a as a regulator, namely, a parameter that will be taken\nto zero in the limit as the potential Va becomes infinitesimally narrow to represent the\ndelta function potential Vδ.\nYou can think of a negative delta function as the limit of a well whose width and height\nare simultaneously going to zero and infinity, respectively, while keeping the area of\nthe well equal to one.\nIf the regulator works properly, the final answer for the energy of the delta function\nmust not depend on a.\n(a) For a given value of a fix the value of V0 so that in the limit a →0 the potential\nVa represents Vδ correctly. Give your answer in terms of α and a.\n(b) What is the value of z2\n0 for the well Va? As a →0 what happens to z0? Explain\nwhy such behavior is reasonable.\n(c) Work with a very small but nonzero, and calculate leading approximations for η\nand ξ in terms of z0.\n(d) Determine the bound state energy of the delta function potential from your anal-\nysis of the well. Do you get the correct answer?\nNOTE: Being a proof-like problem, show clear work!\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n8.04 Quantum Physics I\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture Note 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-04-quantum-physics-i-spring-2016/7f930e013cef9cd7dec5aa88baa83f0a_MIT8_04S16_LecNotes1.pdf",
      "content": "B. Zwiebach\nFebruary 9, 2016\nChapter 1: Key Features of Quantum Mechanics\nQuantum mechanics is now almost one-hundred years old, but we are still discovering some of its\nsurprising features and it remains the subject of much investigation and speculation. The framework\nof quantum mechanics is a rich and elegant extension of the framework of classical physics. It is also\ncounterintuitive and almost paradoxical.\nQuantum physics has replaced classical physics as the correct fundamental description of our phys-\nical universe. It is used routinely to describe most phenomena that occur at short distances. Quantum\nphysics is the result of applying the framework of quantum mechanics to different physical phenomena.\nWe thus have Quantum Electrodynamics, when quantum mechanics is applied to electromagnetism,\nQuantum Optics, when it is applied to light and optical devices, or Quantum Gravity, when it is\napplied to gravitation. Quantum mechanics indeed provides a remarkably coherent and elegant frame-\nwork. The era of quantum physics begins in 1925, with the discoveries of Schr odinger and Heisenberg.\nThe seeds for these discoveries were planted by Planck, Einstein, Bohr, de Broglie, and others. It is\na tribute to human imagination that we have been able to discover the counterintuitive and abstract\nset of rules that define quantum mechanics. Here we aim to explain and provide some perspective on\nthe main features of this framework.\nWe will begin by discussing the property of linearity, which quantum mechanics shares with elec-\ntromagnetic theory. This property tells us what kind of theory quantum mechanics is and why, it\ncould be argued, it is simpler than classical mechanics. We then turn to photons, the particles of light.\nWe use photons and polarizers to explain why quantum physics is not deterministic and, in contrast\nwith classical physics, the results of some experiments cannot be predicted. Quantum mechanics is a\nframework in which we can only predict the probabilities for the various outcomes of any given exper-\niment. Our next subject is quantum superpositions, in which a quantum object somehow manages to\nexist simultaneously in two mutually incompatible states. A quantum light-bulb, for example, could\nbe in a state in which it is both on and offat the same time!\nLinearity of the equations of motion\nIn physics a theory is usually described by a set of equations for some quantities called the dynamical\nvariables of the theory. After writing a theory, the most important task is finding solutions of the\nequations. A solution of the equations describes a possible reality, according to the theory. Because\nan expanding universe is a solution of Albert Einstein's gravitational equations, for example, it follows\nthat an expanding universe is possible, according to this theory. A single theory may have many\nsolutions, each describing a possible reality.\nThere are linear theories and nonlinear theories. Nonlinear theories are more complex than linear\ntheories. In a linear theory a remarkable fact takes place: if you have two solutions you obtain a\nthird solution of the theory simply by adding the two solutions. An example of a beautiful linear\ntheory is Maxwell's theory of electromagnetism, a theory that governs the behavior of electric and\nmagnetic fields. A field, as you probably know, is a quantity whose values may depend on position\nand on time. A simple solution of this theory describes an electromagnetic wave propagating in a\ngiven direction. Another simple solution could describe an electromagnetic wave propagating in a\n\ndifferent direction. Because the theory is linear, having the two waves propagating simultaneously,\neach in its own direction and without affecting each other, is a new and consistent solution. The sum\nis a solution in the sense that the electric field in the new solution is the sum of the electric field\nin the first solution plus the electric field in the second solution. The same goes for the magnetic\nfield: the magnetic field in the new solution is the sum of the magnetic field in the first solution plus\nthe magnetic field in the second solution. In fact you can add any number of solutions to still find\na solution. Even if this sounds esoteric, you are totally familiar with it. The air around you is full\nof electromagnetic waves, each one propagating oblivious to the other ones. There are the waves of\nthousands of cell phones, the waves carrying hundreds of wireless internet messages, the waves from\na plethora of radio-stations, TV stations, and many, many more. Today, a single transatlantic cable\ncan carry simultaneously millions of telephone calls, together with huge amounts video and internet\ndata. All of that courtesy of linearity.\nMore concretely, we say that Maxwell's equations are linear equations. A solution of Maxwell's\nequation is described by an electric field E a magnetic field B, a charge density ρ and a current density\nJ, all collectively denoted as (E, B , ρ , J).\nThis collection of fields and sources satisfy Maxwell's\nequations. Linearity implies that if (E, B , ρ , J) is a solution so is (αE, αB , αρ , αJ), where all fields\nand sources have been multiplied by the constant α. Given two solutions\n(E1, B1, ρ1, J1) ,\nand\n(E2, B2, ρ2, J2) ,\n(1.1)\nlinearity also implies that we can obtain a new solution by adding them\n(E1 + E2 , B1 + B2 , ρ1 + ρ2 , J1 + J2) .\n(1.2)\nThe new solution may be called the superposition of the two original solutions.\nIt is not hard to explain what is, in general, a linear equation or a linear set of equations. Consider\nthe equation\nL u = 0 ,\n(1.3)\nwhere, schematically, u denotes the unknown. The unknown may be a number, or a function of time,\na function of space, a function of time and space, essentially anything unknown! In fact, u could\nrepresent a collection of unknowns, in which case we would replace u above by u1, u2, . . .. The symbol\nL denotes a linear operator, an object that satisfies the following two properties\nL(u1 + u2) = Lu1 + Lu2 ,\nL(a u) = aLu ,\n(1.4)\nwhere a is a number. Note that these conditions imply that\nL(αu1 + βu2) = αLu1 + βLu2 ,\n(1.5)\nshowing that if u1 is a solution ( Lu1 = 0) and u2 is a solution (Lu2 = 0) then αu1 + βu2 is also a\nsolution. We call αu1 + βu2 the general superposition of the solutions u1 and u2. An example may\nhelp. Consider the equation\ndu\ndt + 1 u = 0 ,\n(1.6)\nτ\nwhere τ is a constant with units of time. This is, in fact, a linear differential equation, and takes the\nform L u = 0 if we define\ndu\nL u ≡\ndt + 1u\n(1.7)\nτ\n\nExercise 1. Verify that (1.7) satisfies the conditions for a linear operator.\nEinstein's theory of general relativity is a nonlinear theory whose dynamical variable is a gravita-\ntional field, the field that describes, for example, how planets move around a star. Being a nonlinear\ntheory, you simply cannot add the gravitational fields of different solutions to find a new solution. This\nmakes Einstein's theory rather complicated, by all accounts much more complicated than Maxwell the-\nory. In fact, classical mechanics, as invented mostly by Isaac Newton, is also a nonlinear theory! In\nclassical mechanics the dynamical variables are positions and velocities of particles, acted by forces.\nThere is no general way to use two solutions to build a third.\nIndeed, consider the equation of motion for a particle on a line under the influence of a time-\nindependent potential V (x), which is in general an arbitrary function of x. The dynamical variable\nin this problem is x(t), the position as a function of time. Letting V ′ denote the derivative of V with\nrespect to its argument, Newton's second law takes the form\nd2x(t)\nm\n=\n-V ′(x(t)) .\n(1.8)\ndt\nThe left-hand side is the mass times acceleration and the right hand side is the force experienced by\nthe particle in the potential. It is probably worth to emphasize that the right hand side is the function\nV ′(x) evaluated for x set equal to x(t):\n∂V (x)\nV ′(x(t)) ≡\n.\n∂x\n\n(1.9)\nx=x(t)\nWhile we could have used here an ordinary derivative, w\n\ne wrote a partial derivative as is commonly\ndone for the general case of time dependent potentials. The reason equation (1.8) is not a linear\nequation is that the function V ′(x) is not linear. In general, for arbitrary functions u and v we expect\nV ′(au) = aV ′(u) ,\nand\nV ′(u + v) = V ′(u) + V (v) .\n(1.10)\nAs a result given a solution x(t), the scaled solution αx(t) is not expected to be a solution. Given two\nsolutions x1(t) and x2(t) then x1(t) + x2(t) is not guaranteed to be a solution either.\nExercise. What is the most general potential V (x) for which the equation of motion for x(t) is linear?\nQuantum mechanics is a linear theory.\nThe signature equation in this theory, the so-called\nSchr odinger equation is a linear equation for a quantity called the wavefunction and it determines\nits time evolution. The wavefunction is the dynamical variable in quantum mechanics but, curiously,\nits physical interpretation was not clear to Erwin Schr odinger when he wrote the equation in 1925. It\nwas Max Born, who months later suggested that the wavefunction encodes probabilities. This was the\ncorrect physical interpretation, but it was thoroughly disliked by many, including Schr odinger, who\nremained unhappy about it for the rest of his life. The linearity of quantum mechanics implies a pro-\nfound simplicity. In some sense quantum mechanics is simpler than classical mechanics. In quantum\nmechanics solutions can be added to form new solutions.\nThe wavefunction Ψ depends on time and may also depend on space. The Schr odinger equation\n(SE) is a partial differential equation that takes the form\n∂Ψ\niħ\nˆ\n= HΨ ,\n(1.11)\n∂t\n\nˆ\nwhere the Hamiltonian (or energy operator) H is a linear operator that can act on wavefunctions:\nˆ\nˆ\nˆ\nˆ\nˆ\nH(aΨ) = a H Ψ ,\nH(Ψ1 + Ψ2) = H(Ψ1) + H(Ψ2) ,\n(1.12)\nˆ\nwith a a constant that in fact need not be real; it can be a complex number. Of course, H itself does\nnot depend on the wavefunction! To check that the Schr odinger equation is linear we cast it in the\nform LΨ = 0 with L defined as\n∂Ψ\nLΨ ≡iħ∂\n-ˆHΨ\n(1.13)\nt\nIt is now a simple matter to verify that L is a linear operator. Physically this means that if Ψ1 and\nΨ2 are solutions to the Schr odinger equation, then so is the superposition αΨ1 + βΨ2, where α and β\nare both complex numbers, i.e. (α, β ∈C)\nComplex Numbers are Essential\nQuantum mechanics is the first physics theory that truly makes use of complex numbers. The numbers\nmost of us use for daily life (integers, fractions, decimals) are real numbers.\nThe set of complex\nnumbers is denoted by C and the set of real numbers is denoted by R. Complex numbers appear\nwhen we combine real numbers with the imaginary unit i, defined to be equal to the square root of\nminus one: i\n√\n≡\n-1. Being the square root of minus one, it means that i squared must give minus\none: i2 = -1. Complex numbers are fundamental in mathematics. An equation like x2 = -4, for an\nunknown x cannot be solved if x has to be real. No real number squared gives you minus one. But if\nwe allow for complex numbers, we have the solutions x = ±2i. Mathematicians have shown that all\npolynomial equations can be solved in terms of complex numbers.\nA complex number z, in all generality, is a number of the form\nz = a + ib ∈C ,\na, b ∈R .\n(2.1)\nHere a and b are real numbers, and ib denotes the product of i with b. The number a is called the real\npart of z and b is called the imaginary part of z:\nRe z = a ,\nIm z = b .\n(2.2)\nThe complex conjugate z∗of z is defined by\nz∗= a -ib .\n(2.3)\nYou can quickly verify that a complex number z is real if z∗= z and it is purely imaginary if z∗= -z.\nFor any complex number z = a+ib one can define the norm |z| of the complex number to be a positive,\nreal number given by\n|z| =\np\na2 + b2 .\n(2.4)\nYou can quickly check that\n|z|2 = zz∗,\n(2.5)\nwhere z∗≡a -ib is called the complex conjugate of z = a + ib. Complex numbers are represented as\nvectors in a two dimensional \"complex plane\". The real part of the complex number is the x component\nof the vector and the imaginary part of the complex number is the y component. If you consider the\nunit length vector in the complex plane making an angle θ with the x axis has x component cos θ and\n\ny component sin θ. The vector is therefore the complex number cos θ + i sin θ. Euler's identity relates\nthis to the exponential of iθ:\neiθ = cos θ + i sin θ .\n(2.6)\nA complex number of the form eiχ, with χ real is called a pure phase.\nWhile complex numbers are sometimes useful in classical mechanics or Maxwell theory, they are\nnot strictly needed. None of the dynamical variables, which correspond to measurable quantities,\nis a complex number.\nIn fact, complex numbers can't be measured at all: all measurements in\nphysics result in real numbers. In quantum mechanics, however, complex numbers are fundamental.\nThe Schr odinger equation involves complex numbers. Even more, the wavefunction, the dynamical\nvariable of quantum mechanics it itself a complex number:\nΨ ∈C .\n(2.7)\nSince complex numbers cannot be measured the relation between the wavefunction and a measurable\nquantity must be somewhat indirect. Born's idea to identify probabilities, which are always positive\nreal numbers, with the square of the norm of the wavefuntion was very natural.\nIf we write the\nwavefunction of our quantum system as Ψ, the probabilities for possible events are computed from\n|Ψ|2. The mathematical framework required to express the laws of quantum mechanics consists of\ncomplex vector spaces. In any vector space we have objects called vectors that can be added together.\nIn a complex vector space a vector multiplied by a complex number is still a vector. As we will see in\nour study of quantum mechanics it is many times useful to think of the wavefunction Ψ as a vector in\nsome complex vector space.\nLoss of Determinism\nMaxwell's crowning achievement was the realization that his equations of electromagnetism allowed\nfor the existence of propagating waves. In particular, in 1865 he conjectured that light was an elec-\ntromagnetic wave, a propagating fluctuation of electric and magnetic fields. He was proven right in\nsubsequent experiments. Towards the end of the nineteenth century physicists were convinced that\nlight was a wave. The certainty, however, did not last too long. Experiments on blackbody radiation\nand on the photo-emission of electrons suggested that the behavior of light had to be more complicated\nthan that of a simple wave. Max Planck and Albert Einstein were the most prominent contributors\nto the resolution of the puzzles raised by those experiments.\nIn order to explain the features of the photoelectric effect, Einstein postulated (1905) that in a light\nbeam the energy comes in quanta - the beam is composed of packets of energy. Einstein essentially\nimplied that light was made up of particles, each carrying a fixed amount of energy. He himself found\nthis idea disturbing, convinced like most other contemporaries that, as Maxwell had shown, light was\na wave. He anticipated that a physical entity, like light, that could behave both as a particle and as\na wave could bring about the demise of classical physics and would require a completely new physical\ntheory. He was in fact right. Though he never quite liked quantum mechanics, his ideas about particles\nof light, later given the name photons, helped construct this theory.\nIt took physicists until 1925 to accept that light could behave like a particle. The experiments of\nArthur Compton (1923) eventually convinced most skeptics. Nowadays, particles of light, or photons,\nare routinely manipulated in laboratories around the world.\nEven if mysterious, we have grown\naccustomed to them. Each photon of visible light carries very little energy - a small laser pulse can\n\ncontain many billions of photons. Our eye, however, is a very good photon detector: in total darkness,\nwe are able to see light when as little as ten photons hit upon our retina. When we say that light\nbehaves like a particle we mean a quantum mechanical particle: a packet of energy and momentum\nthat is not composed of smaller packets. We do not mean a classical point particle or Newtonian\ncorpuscle, which is a zero-size object with definite position and velocity.\nAs it turns out, the energy of a photon depends only on the color of the light.\nAs Einstein\ndiscovered the energy E and frequency ν for a photon are related by\nE = hν\n(3.1)\nThe frequency of a photon determines the wavelength λ of the light through the relation νλ = c, where\nc is the speed of light. All green photons, for example, have the same energy. To increase the energy\nin a light beam while keeping the same color, one simply needs more photons.\nAs we now explain, the existence of photons implies that Quantum Mechanics is not deterministic.\nBy this we mean that the result of an experiment cannot be determined, as it would in classical\nphysics, by the conditions that are under the control of the experimenter.\nConsider a polarizer whose preferential direction is aligned along the xˆ direction, as shown in\nFigure 1. Light that is linearly polarized along the xˆ direction namely, light whose electric field points\nin this direction, goes through the polarizer. If the incident light polarization is orthogonal to the xˆ\ndirection the light will not go through at all. Thus light linearly polarized in the yˆ direction will be\ntotally absorbed by the polarizer. Now consider light polarized along a direction forming an angle α\nwith the x-axis, as shown in Figure 2. What happens?\nFigure 1: A polarizer that transmits light linearly polarized along the xˆ direction.\nFigure 2: Light linearly polarized along the direction at an angle α hitting the polarizer.\nThinking of the light as a propagating wave, the incident electric field Eα makes an angle α with\nthe x-axis and therefore takes the form\nEα = E0 cos α xˆ + E0 sin α yˆ .\n(3.2)\n\nThis is an electric field of magnitude E0. In here we are ignoring the time and space dependence\nof the wave; they are not relevant to our discussion. When this electric field hits the polarizer, the\ncomponent along xˆ goes through and the component along yˆ is absorbed. Thus\nBeyond the polarizer:\nE = E0 cos α xˆ .\n(3.3)\nYou probably recall that the energy in an electromagnetic wave is proportional to the square of the\nmagnitude of the electric field. This means that the fraction of the beam's energy that goes through\nthe polarizer is (cos α)2. It is also well known that the light emerging from the polarizer has the same\nfrequency as the incident light.\nSo far so good. But now, let us try to understand this result by thinking about the photons that\nmake up the incident light. The premise here is that all photons in the incident beam are identical.\nMoreover the photons do not interact with each other. We could even imagine sending the whole\nenergy of the incident light beam one photon at a time. Since all the light that emerges from the\npolarizer has the same frequency as the incident light, and thus the same frequency, we must conclude\nthat each individual photon either goes through or is absorbed. If a fraction of a photon went through\nit would be a photon of lower energy and thus lower frequency, which is something that does not\nhappen.\nBut now we have a problem. As we know from the wave analysis, roughly a fraction (cos α)2 of the\nphotons must go through, since that is the fraction of the energy that is transmitted. Consequently a\nfraction 1 -(cos α)2 of the photons must be absorbed. But if all the photons are identical, why is it\nthat what happens to one photon does not happen to all of them?\nThe answer in quantum mechanics is that there is indeed a loss of determinism. No one can predict\nif a photon will go through or will get absorbed. The best anyone can do is to predict probabilities.\nIn this case there would be a probability (cos α)2 of going through and a probability 1 -(cos α)2 of\nfailing to go through.\nTwo escape routes suggest themselves. Perhaps the polarizer is not really a homogeneous object\nand depending exactly on where the photon his it either gets absorbed or goes through. Experiments\nshow this is not the case. A more intriguing possibility was suggested by Einstein and others. A\npossible way out, they claimed, was the existence of hidden variables. The photons, while apparently\nidentical, would have other hidden properties, not currently understood, that would determine with\ncertainty which photon goes through and which photon gets absorbed. Hidden variable theories would\nseem to be untestable, but surprisingly they can be tested. Through the work of John Bell and others,\nphysicists have devised clever experiments that rule out most versions of hidden variable theories. No\none has figured out how to restore determinism to quantum mechanics. It seems to be an impossible\ntask.\nWhen we try to describe photons quantum mechanically we could use wavefunctions, or equivalently\nthe language of states. A photon polarized along the xˆ direction is not represented using an electric\nfield, but rather we just give a name for its state:\nphoton; x .\n(3.4)\nWe will learn the rules needed to manipulate\n\nsuch objects,\n\nbut for the time being you could think of\nit like a vector in some space yet to be defined. Another state of a photon, or vector is\nphoton; y\n\n,\n(3.5)\n\nrepresenting a photon polarized along yˆ. These states are the wavefunctions that represent the photon.\nW\ne now claim that the photons in the beam that is polarized along the direction α are in a state\nphoton; α\nthat can be written as a superposition of the above two states:\nphoton; α\n= cos α photon; x + sin α photon; y .\n(3.6)\nThis equation should be com\n\npared with\n\n(3.2). While\n\nthere\n\nare some\n\nsimilarities\n\n-both are superpositions-\none refers to electric fields and the other to \"states\" of a single photon. Any photon that emerges\nfrom the polarizer will necessarily be polarized in the xˆ direction and therefore it will be in the state\nBeyond the polarizer:\nThis\n\nphoton; x\n\n.\n(3.7)\ncan be compared with (3.3) which with the factor cos α carries information about the amplitude\nof the wave. Here, for a single photon, there is no room for such a factor.\nIn the famous Fifth Solvay International Conference of 1927 the world's most notable physicists\ngathered to discuss the newly formulated quantum theory. Seventeen out of the twenty nine attendees\nwere or became Nobel Prize winners. Einstein, unhappy with the uncertainty in quantum mechanics\nstated the nowadays famous quote: \"God does not play dice\", to which Niels Bohr is said to have\nanswered: \"Einstein, stop telling God what to do.\" Bohr was willing to accept the loss of determinism,\nEinstein was not.\nQuantum Superpositions\nWe have already discussed the concept of linearity; the idea that the sum of two solutions representing\nphysical realities represents a new, allowed, physical reality. This superposition of solutions has a\nstraightforward meaning in classical physics. In the case of electromagnetism, for example, if we have\ntwo solutions, each with its own electric and magnetic field, the \"sum\" solution is simply understood:\nits electric field is the sum of the electric fields of the two solutions and its magnetic field is the sum of\nthe magnetic fields of the two solutions. In quantum mechanics, as we have explained, linearity holds.\nThe interpretation of a superposition, however, is very surprising.\nOne interesting example is provided by a Mach-Zehnder interferometer; an arrangement of beam\nsplitters, mirrors, and detectors used by Ernst Mach and Ludwig Zehnder in the 1890's to study\ninterference between two beams of light.\nA beam splitter, as its name indicates, splits an incident beam into two beams, one that is reflected\nfrom the splitter and one that goes through the splitter. Our beam-splitters will be balanced: they\nsplit a given beam into two beams of equal intensity (Figure 3). The light that bounces offis called\nthe reflected beam, the light that goes through is called the transmitted beam. The incident beam\ncan hit the beam splitter from the top or from the bottom.\nThe Mach-Zehnder configuration, shown in Figure 4, has a left beam splitter (BS1) and a right\nbeam splitter (BS2). In between we have the two mirrors, M1 on the top and M2 on the bottom.\nAn incoming beam from the left is split by BS1 into two beams, each of which hits a mirror and is\nthen sent into BS2. At BS2 the beams are recombined and sent into two outgoing beams that go into\nphoton detectors D0 and D1.\nIt is relatively simple to arrange the beam-splitters so that the incoming beam, upon splitting at\nBS1 and recombination at BS2 emerges in the top beam which goes into D0. In this arrangement\nno light at all goes into D1. This requires a precise interference effect at BS2. Note that we have\n\nFigure 3: An incident beam hitting a beam-splitter results in a reflected beam and a transmitted beam. Left:\nincident beam coming from the top. Right: incident beam coming from the bottom.\nFigure 4: A Mach-Zehnder interferometer consists of two beam splitters BS1 and BS2, two mirrors M1 and\nM2, and two detectors D0 and D1. An incident beam will be split into two beams by BS1. One beam goes\nthrough the upper branch, which contains M1, the other beam goes through the lower branch, which contains\nM2. The beams on the two branches recombine at BS2 and are then sent into the detectors. The configuration\nis prepared to produce an interference so that all incident photons end at the detector D0, with none at D1.\ntwo beams incident upon BS2; the top beam is called 'a' and the lower beam is called 'b'.\nTwo\ncontributions go towards D0: the reflection of 'a' at BS2 and the transmission from 'b' at BS2. These\ntwo contributions interfere constructively to give a beam going into D0. Two contributions also go\ntowards D1: the transmission from 'a' at BS2 and the reflection from 'b' at BS2. These two can indeed\nbe arranged to interfere destructively to give no beam going into D1.\nIt is instructive to think of the incoming beam as a sequence of photons that we send into the\ninterferometer, one photon at a time. This shows that, at the level of photons, the interference is not\ninterference of one photon with another photon. Each photon must interfere with itself to give the\nresult. Indeed interference between two photons is not possible: destructive interference, for example,\nwould require that two photons end up giving no photon, which is impossible by energy conservation.\nTherefore, each photon does the very strange thing of going through both branches of the inter-\nferometer! Each photon is in a superposition of two states: a state in which the photon is in the top\nbeam or upper branch, added to a state in which the photon is in the bottom beam or lower branch.\nThus the state of the photon in the interferometer is a funny state in which the photon seems to be\ndoing two incompatible things at the same time.\n\nEquation (3.6) is another example of a quantum superposition. The photon state has a component\nalong an x-polarized photon and a component along a y-polarized photon.\nWhen we speak of a wavefunction, we also sometimes call it a state, because the wavefunction\nspecifies the \"state\" of our quantum system. We also sometimes refer to states as vectors. A quantum\nstate may not be a vector like the familiar vectors in three-dimensional space but it is a vector\nnonetheless because it makes sense to add states and to multiply states by numbers. Just like vectors\ncan be added, linearity guarantees that adding wavefunctions or states is a sensible thing to do. Just\nlike any vector can be written as a sum of other vectors in many different ways, we will do the same\nwith our states. By writing our physical state as sums of other states we can learn about the properties\nof our state.\nConsider now\n\ntwo states A\nand B . Assume, in addition, that when measuring some property\nQ in the state A the answer is always a, and when measuring the same property Q in the state B\nthe answer is always b. Suppose now that our physical state |Ψ⟩is the superposition\n\n|Ψ⟩= α A + β B ,\nα, β ∈C .\n(4.1)\nWhat happens now if we measure propert\n\ny Q\n\nin the\n\nsystem described by the state |Ψ⟩? It may seem\nreasonable that one gets some intermediate value between a and b, but this is not what happens. A\nmeasurement of Q will yield either a or b. There is no certain answer, classical determinism is lost, but\nthe answer is always one of these two values and not an intermediate one. The coefficients α and β in\nthe above superposition affect the probabilities with which we may obtain the two possible values. In\nfact, the probabilities to obtain a or b\nProbability(a) ∼|α|2 ,\nProbability(b) ∼|β|2 .\n(4.2)\nSince the only two possibilities are to measure a or b, the actual probabilities must sum to one and\ntherefore they are given by\ny(a) =\n|α\nProbabilit\n|\n|α|2 + |β|2 ,\nProbability(b) =\n|β|2\n.\n(4.3)\n|α|2 + |β|2\nIf we obtain the value a, immediate repeated measurements would still give a, so the state after\nthe measurement must be |A⟩. The same happens for b, so we have\nAfter measuring a the state becomes |Ψ⟩= |A⟩,\n(4.4)\nAfter measuring b the state becomes |Ψ⟩= |B⟩.\nIn quantum mechanics one makes the following assumption: Superposing a state with itself doesn't\nchance the physics, nor does it change the state in a non-trivial way. Since superimposing a state with\nitself simply changes the overall number multiplying it, we have that Ψ and αΨ represent the same\nphysics for any complex number α different from zero. Thus, letting ∼= represent physical equivalence\nA\n∼= 2\nA\n∼= i A ∼= -|A⟩.\n(4.5)\nThis assumption is necessary to verify that the polarization\n\nof a photon state has the expected number\nof degrees of freedom. The polarization of a plane wave, as one studies in electromagnetism, is described\nby two real numbers. For this consider an elliptically polarized wave, as shown in Figure 5. At any\ngiven point, the electric field vector traces an ellipse whose shape is encoded by the ratio a/b of\n\nthe semi-major axes (the first real parameter) and a tilt encoded by the angle θ (the second real\nparameter). Consider for this a general photon state formed by superposition of the two independent\npolarization states |photon; x⟩and |photon; y⟩:\nα|photon; x⟩+ β|photon; y⟩,\nα, β ∈C .\n(4.6)\nAt first sight it looks as if we have two complex parameters α and β, or equivalently, four real\nparameters. But since the overall factor does not matter we can multiply this state by 1/α to get the\nequivalent state that encodes all the physics\n|photon; x⟩\nβ\n+\nphoton;\nα |\ny⟩,\n(4.7)\nshowing that we really have one complex parameter, the ratio β/α. This is equivalent to two real\nparameters, as expected.\nFigure 5: Parameters that define an elliptically polarized state.\nLet us do a further example of superposition using electrons. Electrons are particles with spin.\nClassically, we imagine them as tiny balls spinning around an axis that goes through the particle itself.\nOnce an axis is fixed, the electron has two and only two options: its rotation may be clockwise or\ncounterclockwise about the axis, but in both cases it spins at the same fixed rate. These opposite ways\nof spinning are called spin up and spin down along the axis (see Figure 6). The up and down refer to\nthe direction of the angular momentum associated with the rotation, and it is indicated by an arrow.\nAccording to quantum mechanics, and as verified by multiple experiments, the same possibilities, up\nor down, arise whatever axis we use to measure the spin of the electron.\nPhysicists usually set up coordinate systems in space by choosing three orthogonal directions, the\ndirections of the x, y, and z axes. Let us choose to describe our spinning electrons using the z axis.\nOne possible state of an electron is to be spin up along the z axis. Such a state is described as | ↑; z⟩,\nwith an arrow pointing up, and the label z indicating that the spin arrow points along the increasing z\ndirection. Another possible state of an electron is spin down along the z axis. Such a state is described\nas | ↓; z⟩, with an arrow pointing down, meaning this time that the spin points along the decreasing\nz direction. If these two are possible realities, so it would be the state |Ψ⟩representing the sum\n|Ψ⟩= | ↑; z⟩+ | ↓; z⟩.\nThe state |Ψ⟩is in a superposition of a spin up and a spin down state. What kind of physics does this\nsum |Ψ⟩represent? It represents a state in which a measurement of the spin along the z axis would\nresult in two possible outcomes with equal probabilities: an electron with spin up or an electron with\nspin down. Since we can only speak of probabilities, any experiment must involve repetition until\n\nprobabilities can be determined. Suppose we had a large ensemble of such electrons, all of them in\nthe above state |Ψ⟩. As we measured their spin along z, one at a time, we would find about half of\nthem spinning up along z and the other half spinning down along z. There is no way to predict which\noption will be realized as we measure each electron. It is not easy to imagine superposition, but one\nmay try as follows. An electron in the above state is in a different kind of existence in which it is able\nto both be spinning up along z and spinning down along z simultaneously! It is in such a ghostly,\neerie state, doing incompatible things simultaneously, until its spin is measured. Once measured, the\nelectron must immediately choose one of the two options; we always find electrons either spinning up\nor spinning down.\nFigure 6: An electron with spin along the z axis. Left: the electron is said to have spin up along z. Right:\nthe electron is said to have spin down along z. The up and down arrows represent the direction of the angular\nmomentum associated with the spinning electron.\nA critic of quantum mechanics could suggest a simpler explanation for the above observations. He\nor she would claim that the following simpler ensemble results in identical experimental results. In the\ncritic's ensemble we have a large number of electrons with 50% of them in the state | ↑; z⟩and 50% of\nthem in the state | ↓; z⟩. He or she would then state, correctly, that such an ensemble would yield the\nsame measurements of spins along z as the ensemble of those esoteric |Ψ⟩states. The new ensemble\ncould provide a simpler explanation of the result without having to invoke quantum superpositions.\nQuantum mechanics, however, allows for further experiments that can distinguish between the\nensemble of our friendly critic and the ensemble of |Ψ⟩states. While it would take us too far afield\nto explain this, if we measured the spin of the electrons in the x direction, instead of z direction,\nthe results would be different in the two ensembles. In the ensemble of our critic we would find 50%\nof the electrons up along x and 50% of the electrons down along x. In our ensemble of |Ψ⟩states,\nhowever, we would find a very simple result: all states pointing up along x. The critic's ensemble\nis not equivalent to our quantum mechanical ensemble. The critic is thus shown wrong in his or her\nattempt to show that quantum mechanical superpositions are not required.\nEntanglement\nWhen we consider superposition of states of two particles we can get the remarkable phenomenon\ncalled quantum mechanical entanglement. Entangled states of two particles are those in which we\ncan't speak separately of the state of each particle. The particles are bound together in a common\n\nstate in which they are entangled with each other.\nLet us consider two non-interacting particles. Particle 1 could be in any of the states\n{\nu1\n\n,\ne\n\nu2\nwhile particle 2 could b\nin any of the states\n\n, ...} ,\n(5.1)\n{\nIt may seem reasonable to conclude that the\nv1\n\n,\nv2\n\n, ...}\n(5.2)\nstate of the full system, including particle 1 and particle\n2 would be specified by stating the state of particle 1 and the state of particle 2. If that would be the\ncase the possible states would be written as\nui\n\n⊗\nvj\nfor\n\n,\ni, j ∈N ,\n(5.3)\nsome specific choice of i and j that specify the state of particle one and particle two, respectively.\nHere we have used the symbol ⊗, which means tensor product, to combine the two states into a single\nstate for the whole system. We will study ⊗later, but for the time being we can think of it as a kind\nof product that distributes over addition and obeys simple rules, as follows\n(α1\nu1\n\n+ α2\nu2\n\n) ⊗(β1\nv1\n\n+ β2\nv2\n\n) =\nα1β1\nu1\n\n⊗\nv1\n\n+ α1β2\nu1\n\n⊗\n+ α2β1 u2 ⊗v1 + α2β2 u2 ⊗\nv2\nv2\n\n(5.4)\n.\nThe numbers can be moved across the ⊗but the order of the\n\nstates\n\nm\n\nust be preserv\n\ned.\n\nThe state on\nthe left-hand side -expanded\n\noutonthe right-hand side- is still of the type where\n\nof the first particle (α1 u1 + α2 u2 ) with a state of the second particle (β1\nany one of the states listed\n\nin (5.3)\n\nthis state is not entangled.\nUsing the states in (5.3), however, we can construct more intriguing superp\n\nv\nwe combine a state\n1 + β2\nv2\n\n). Just like\nositions. Consider the\nfollowing one\nu1 ⊗v1 + u2 ⊗v2 .\n(5.5)\nA state of two particles is said to be entangled\n\nif\n\nit cannot\n\nb\n\ne written\n\nin the factorized form (· · · )⊗(· · · )\nwhich allows us to describe the state by simply stating the state of each particle. We can easily see\nthat the state (5.5) cannot be factorized. If it could it would have to be with a product as indicated\nin (5.4). Clearly, involving states like |u3⟩or |v3⟩that do not appear in (5.5) would not help. To\ndetermine the constants α1, α2, β1, β2 we compare the right hand side of (5.4) with our state and\nconclude that we need\nα1β1 = 1 ,\nα1β2 = 0 ,\nα2β1 = 0 ,\nα2β2 = 1 .\n(5.6)\nIt is clear that there is no solution here. The second equation, for example, requires either α1 or β2 to\nbe zero. Having α1 = 0 contradicts the first equation, and having β2 = 0 contradicts the last equation.\nThis confirms that the state (5.5) is indeed an entangled state. There is no way to describe the state\nby specifying a state for each of the particles.\nLet us illustrate the above discussion using electrons and their spin states. Consider a state of two\nelectrons denoted as | ↑⟩⊗| ↓⟩. As the notation indicates, the first electron, described by the first\narrow, is up along z while the second electron, described by the second arrow, is down along z (we\nomit the label z on the state for brevity). This is not an entangled state. Another possible state is\n\none where they are doing exactly the opposite: in | ↓⟩⊗| ↑⟩the first electron is down and the second\nis up. This second state is also not entangled. It now follows that by superposition we can consider\nthe state\n| ↑⟩⊗| ↓⟩+ | ↓⟩⊗| ↑⟩.\n(5.7)\nThis is a entangled state of the pair of electrons.\nExercise. Show that the above state cannot be factorized and thus is indeed entangled.\nIn the state (5.7) the first electron is up along z if the second electron is down along z (first term),\nor the first electron is down along z if the second electron is up along z (second term). There is a\ncorrelation between the spins of the two particles; they always point in opposite directions. Imagine\nthat the two entangled electrons are very far away from each other: Alice has one electron of the pair\non planet earth and Bob has the other electron on the moon. Nothing we know is connecting these\nparticles but nevertheless the states of the electrons are linked. Measurements we do on the separate\nparticles exhibit correlations. Suppose Alice measures the spin of the electron on earth. If she finds\nit up along z, it means that the first summand in the above superposition is realized, because in\nthat summand the first particle is up. As discussed before, the state of the two particles immediately\nbecomes that of the first summand. This means that the electron on the moon will instantaneously go\ninto the spin down-along-z configuration, something that could be confirmed by Bob, who is sitting\nin the moon with that particle in his lab. This effect on Bob's electron happens before a message,\ncarried with the speed of light, could reach the moon telling him that a measurement has been done\nby Alice on the earth particle and the result was spin up. Of course, experiments must be done with\nan ensemble that contains many pairs of particles, each pair in the same entangled state above. Half\nof the times the electron on earth will be found up, with the electron on the moon down and the other\nhalf of the times the electron on earth will be found down, with the electron on the moon up.\nOur friendly critic could now say, correctly, that such correlations between the measurements of\nspins along z could have been produced by preparing a conventional ensemble in which 50% of the\npairs are in the state | ↑⟩⊗| ↓⟩and the other 50% of the pairs are in the state | ↓⟩⊗| ↑⟩. Such\nobjections were dealt with conclusively in 1964 by John Bell, who showed that if Alice and Bob are\nable to measure spin in three arbitrary directions, the correlations predicted by the quantum entangled\nstate are different from the classical correlations of any conceivable conventional ensemble. Quantum\ncorrelations in entangled states are very subtle and it takes sophisticated experiments to show they are\nnot reproducible as classical correlations. Indeed, experiments with entangled states have confirmed\nthe existence of quantum correlations. The kind of instantaneous action at a distance associated with\nmeasurements on well-separated entangled particles does not lead to paradoxes nor, as it may seem,\nto contradictions with the ideas of special relativity. You cannot use quantum mechanical entangled\nstates to send information faster than the speed of light.\nSarah Geller transcribed Zwiebach's handwritten notes to create the first LaTeX version of this docu-\nment.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n8.04 Quantum Physics I\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture Note 2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-04-quantum-physics-i-spring-2016/afaef4b8271759d352ac75c4e85eaee6_MIT8_04S16_LecNotes2.pdf",
      "content": "Chapter 2: Experiments with photons\nB. Zwiebach\nFebruary 9, 2016\nContents\nMach-Zehder Interferometer\nElitzur-Vaidman Bombs\nMach-Zehder Interferometer\nWe have discussed before the Mach-Zehnder interferometer, which we show again in Figure 1.\nIt\ncontains two beam-splitters BS1 and BS2 and two mirrors. Inside the interferometer we have two\nbeams, one going over the upper branch and one going over the lower branch. This extends beyond\nBS2: the upper branch continues to D0 while the lower branch continues to D1.\nFigure 1: The Mach-Zehnder Interferometer\nVertical cuts in the above figure intersect the two beams and we can ask what is the probability to\nfind a photon in each of the two beams at that cut. For this we need two probability amplitudes, or\ntwo complex numbers, whose norm-squared would give probabilities. We can encode this information\nin a two component vector as\nα\nβ\n\n.\n(1.1)\nHere α is the probability amplitude to be in the upper beam and β the probability amplitude to be in\nthe lower beam. Therefore, |α\n|2 would be the probability to find the photon in the upper beam and\n|β| the probability to find the photon in the lower beam. Since the photon must be found in either\none of the beams we must have\nα\n2 +\nβ\n2 = 1 .\n(1.2)\n\nFollowing this notation, we would have for the cases when the photon is definitely in one or the other\nbeam:\nphoton on upper beam:\n,\nphoton on bottom beam :\n.\n(1.3)\nWe can view the state (1.1) as a superposition of these two simpler states using the rules of vector\naddition and multiplication:\nα\nβ\n\nα\n=\n\n+\n= α\n+ β\n.\n(1.4)\nβ\n\nIn the interferometer shown in Figure 1 we included in the lower branch a 'phase shifter', a piece of\nFigure 2: A phase shifter of phase factor eiδ. The amplitude gets multiplied by the phase.\nmaterial whose only effect is to multiply the probability amplitude by a fixed phase eiδ with δ ∈R.\nAs shown in Figure 2, the probability amplitude α to the left of the device becomes eiδα to the right\nof the device. Since the norm of a phase is one, the phase-shifter does not change the probability to\nfind the photon. When the phase δ is equal to π the effect of the phase shifter is to change the sign\nof the wavefunction since eiπ = -1.\nLet us now consider the effect of beam splitters in detail. If the incoming photon hits a beam-\nsplitter from the top, we consider this photon to belong to the upper branch and represent it by\n.\nIf the incoming photon hits the beam-splitter\n\nfrom the bottom, we consider this photon to belong\n\nto\nthe lower branch, and represent it by\n. We show the two cases in Figure 3. The effect of the beam\nsplitter is to give an output wavefunction for each of the two cases:\nLeft BS:\ns\nu\n,\nRight BS:\n.\n(1.5)\n\n→\n\nt\n\n→\n\nv\n\nAs you can see from the diagram, for the photon hitting from above, s may be thought as a reflection\namplitude and t as a transmission coefficient. Similarly, for the photon hitting from below, v may be\nthought as a reflection amplitude and u as a transmission coefficient. The four numbers s, t, u, v, by\nlinearity, characterize completely the beam splitter. They can be used to predict the output given\nany incident photon, which may have amplitudes to hit both from above and from below. Indeed, an\nα\nincident photon state\n\nβ\n\nwould give\nα\nβ\n\n= α\n\n+ β\n\n→\nα\ns\nt\n\ns\n+\nu\nα\nβ\nv\n\n=\n\n+ βu\nαt + βv\n\n=\ns\nu\nt\nv\nα\nβ\n\n.\n(1.6)\nIn summary, we see that the BS produces the following effect\nα\nβ\n\n→\ns\nu\nt\nv\nα\nβ\n\n.\n(1.7)\n\nFigure 3: Left: A photon incident from the top; s and t are the reflected and transmitted amplitudes, re-\nspectively. Right: A photon incident from the bottom; v and u are the reflected and transmitted amplitudes,\nrespectively.\nWe can represent the action of the beam splitter as matrix multiplication on the incoming wavefunction,\nwith the two-by-two matrix\ns\nu\nt\nv\n\n.\n(1.8)\nWe must now figure out the constraints on s, t, u, v. Because probabilities must add up to one, equation\n(1.5) implies that\ns\n2 +\nt\n\n=\n1 ,\n(1.9)\nu2\n+ v\n=\n1 .\n(1.10)\nThe kind of beam splitters we use are called balanced,\n\nwhich means that reflection and transmission\nprobabilities are the same. So all four constants must have equal norm-squared:\ns\n2 =\nt\n2 =\nu\n2 =\nv\n2 = 1\n2 .\n(1.11)\nLet's try a guess for the values. Could we have\ns\nu\nt\nv\n\n=\n√\n√\n√\n√\n?\n!\n(1.12)\nThis fails if acting on normalized wavefunctions (or column vectors) does not yield normalized wave-\nfunctions. So we try with a couple of wavefunctions\n√\n√\n√\n√\n! 1\n\n=\n√\n√\n!\n,\n√\n√\n√\n√\n! 1\n√\n√\n(1.13)\n!\n=\n.\n\nWhile the first example works out, the second does not, as |1|2 + |1|2 = 2 = 1. An easy fix is achieved\nby changing the sign of v:\n\ns\nu\n=\n\n√\n√\n!\n= √\n.\n(1.14)\nt\nv\n√\n√\n-\n-1\n\nα\nLet's check that this matrix works in general. Thus acting on a state\n\nwith α 2 + β 2 = 1 we find\nβ\n\n| |\n| |\n√\n-1\nα\nβ\n\n=\n√\nα\n\n+ β\nα -β\n\n.\n(1.15)\nIndeed the resulting state is well normalized. The total probability is what we expect\nα + β\n2 + 1\nα -β\n2 =1\n2(\nα\n2 +\nβ\n2 + αβ∗+ α∗β) + 1\n\n( α\nα\n\n+ β\n-αβ∗\n\n(1.16)\n-α∗β)\n=\n+ β\n= 1 .\n\nThe minus sign in the bottom right en\n\ntry\n\nof (1.14) means that a photon incident from below, as it is\nreflected, will have its amplitude changed by a sign or equivalently a phase shift by π (check this!).\nThis effect, of course, is realized in practice. A typical beam splitter consists of a glass plate with a\nreflective dielectric coating on one side. The refractive index of the coating is chosen to be intermediate\nbetween that of glass and that of air. A reflection causes a phase shift only when light encounters a\nmaterial of higher refractive index. This is the case in the transition of air to coating, but not in the\ntransition from glass to coating. Thus the beam splitter represented by (1.14) would have its coating\non the bottom side. Transmitted waves have no phase shift.\nAnother possibility for a beam splitter matrix is\n√\n-1\n(1.17)\n\n,\nwhich would be realized by a dielectric coating on the top side. You can quickly check that, like the\nprevious matrix, its action also conserves probability. We will call the left beam-splitter BS1 and the\nright beam splitter BS2 and their respective matrices will be\nBS1 :\n√\n-1\n\n,\nBS2 :\n√\n\n-1\n\n.\n(1.18)\nThe two beam splitters are combined to form the interferometer shown in Figure 4. If we now assume\nα\nan input photon wavefunction\n\nfrom the left, the output wavefunction that goes into the detectors\nβ\nis obtained by acting first with the BS1 matrix and then with the BS2 matrix:\ninput\nα\n:\nβ\n\noutput: √\n-1\n√\n-1\nα\nβ\n\n= 1\n.\n-2\nα\nβ\nβ\n\n=\n\n(1.19)\n-α\n\nWith the help of this result, for any input photon state we can write immediately the output photon\nstate that goes into the detectors.\nIf the input photon beam is\nphoton will be detected at D0. This\n\n, the output from the interferometer is\n, and therefore a\nis shown in Figure 5. We can make a very\n\nsimple\n\ntable with the\npossible outcomes and their respective probabilities P:\nOutcome\nP\nphoton at DO\nphoton at D1\n(1.20)\n\nFigure 4: The Mach-Zehnder interferometer with input and output wavefunctions indicated.\nFigure 5: Incident photon from below will go into D0.\nNow, block the lower path, as indicated in Figure 6. What happens then? It is best to track down\nthings systematically. The input beam, acted by BS1 gives\n√\n-1\n\n=\n√\n(1.21)\n\n.\nThis is indicated in the figure, to the right of BS1. Then the lower branch is stopped, while the upper\nbranch continues. The upper branch reaches BS2, and here the input is\n√\n!\n, because nothing is\ncoming from the lower branch. We therefore get an output\n√\n-1\n√\n!\n=\n.\n!\n(1.22)\nIn this experiment there are three possible outcomes: the photon can be absorbed by the block, or\n\nFigure 6: The probability to detect the photon at D1 can be changed by blocking one of the paths.\ncan go into any of the two detectors. As we see in the diagram, the probabilities are:\nOutcome\nP\nphoton at block\nphoton at D0\nphoton at D1\n(1.23)\nIt is noteworthy that before blocking the lower path we could not get a photon to D1. The probability\nto reach D1 is now 1/4 and was increased by blocking a path.\nElitzur-Vaidman Bombs\nTo see that allowing the photon to reach D1 by blocking a path is very strange, we consider an imag-\ninary situation proposed by physicists Avshalom Elitzur and Lev Vaidman, from Tel-Aviv University,\nin Israel. They imagined bombs with a special type of trigger: a photon detector. A narrow tube goes\nacross each bomb and in the middle of the tube there is a photon detector. To detonate the bomb\none sends a photon into the tube. The photon is then detected by the photon detector and the bomb\nexplodes. If the photon detector is defective, however, the photon is not detected at all. It propagates\nfreely through the tube and comes out of the bomb. The bomb does not explode.\nHere is the situation we want to address. Suppose we have a number of Elitzur-Vaidman (EV)\nbombs, but we know that some of them have become defective.\nHow could we tell if a bomb is\noperational without detonating it?\nAssume, for the sake of the problem, that we are unable to\nexamine the detector without destroying the bomb.\nWe seem to be facing an impossible situation. If we send a photon into the detector tube and\nnothing happens we know the bomb is defective, but if the bomb is operational it would simply\nexplode. It seems impossible to confirm that the photon detector in the bomb is working without\ntesting it. Indeed, it is impossible in classical physics. It is not impossible in quantum mechanics,\nhowever. As we will see, we can perform what can be called an interaction-free measurement!\nWe now place an EV bomb on the lower path of the interferometer, with the detector tube properly\naligned. Suppose we send in a photon as pictured. If the bomb is defective it is as if there is no detector,\nthe lower branch of the interferometer is free and all the photons that we send in will end up in D0,\n\nFigure 7: A Mach-Zehnder interferometer and an Elitzur-Vaidman bomb inserted on the lower branch, with\nthe detector tube properly aligned. If the bomb is faulty all incident photons will end up at D0. If a photon ends\nup at D1 we know that the bomb is operational, even though the photon never went into the bomb detector!\njust as they did in Figure 5.\nOutcome\nP\nphoton at D0\nno explosion\nphoton at D1\nno explosion\nbomb explodes\n(2.24)\nIf the bomb is working, on the other hand, we have the situation we had in Figure 6, where we placed\na block in the lower branch of the interferometer:\nOutcome\nP\nbomb explodes\nphoton at D0\nno explosion\nphoton at D1\nno explosion\n(2.25)\nAssume the bomb is working. Then 50% of the times the photon will hit it and it will explode, 25%\nof the time the photon will end in D0 and we can't tell if it is defective or not. But 25% of the time\nthe photon will end in D1, and since this was impossible for a faulty bomb, we have learned that\nthe bomb is operational! We have learned that even though the photon never made it through the\nbomb; it ended on D1. If you think about this you will surely realize it is extremely surprising and\ncounterintuitive. But it is true, and experiments (without using bombs!) have confirmed that this\nkind of interaction-free measurement is indeed possible.\nSarah Geller transcribed Zwiebach's handwritten notes to create the first LaTeX version of this docu-\nment.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n8.04 Quantum Physics I\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture Note 3",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-04-quantum-physics-i-spring-2016/f928b8dce3d6a218fddda9617c5eb4f2_MIT8_04S16_LecNotes3.pdf",
      "content": "PARTICLE NATURE OF LIGHT AND WAVE NATURE OF MATTER\nB. Zwiebach\nFebruary 16, 2016\nContents\nPhotoelectric Effect\nCompton Scattering\nMatter Waves\nPhotoelectric Effect\nThe photoelectric effect was first observed by Heinrich Hertz in 1887. When polished metal plates are\nirradiated, he observed, they may emit electrons, then called \"photo-electrons\". The emitted electrons\nthus produce a photoelectric current. The key observations were:\n- There is a threshold frequency ν0. Only for frequencies ν > ν0 is there a photoelectric current.\nThe frequency ν0 depends on the metal and the configuration of the atoms at the surface. It is\nalso affected by inhomogeneities.\n- The magnitude of the photoelectric current is proportional to the intensity of the light source.\n- Energy of the photoelectrons is independent of the intensity of the light source.\nA natural explanation for the features in this effect didn't come until 1905, when Einstein explained\nthe above features by postulating that the energy in light is carried by discrete quanta (later called\nphotons) with energy hν. Here h is Planck's constant, the constant used by Planck to to produce a\nfit for the blackbody energy as a function of frequency.\n-\n-\n-\nFigure 1: Electrons in a metal are bound. If the photon energy is greater than the work function W\nan electron may be ejected.\nA given material has a characteristic energy W, called the work function, which is the minimum\nenergy required to eject an electron.\nThis is not easily calculated because it is the result of an\n\ninteraction of many electrons with the background of atoms. It is easily measured, however. When\nthe surface of the material is irradiated, electrons in the material absorb the energy of the incoming\nphotons. If the energy imparted on an electron by the absorption of a single photon is greater than\nthe work function W, then the electron is ejected with kinetic energy Ee\nequal to the difference of\n-\nthe photon energy and the work function:\nEe\n=\n-\nmv2 = hν\n-W = Eγ -W.\n(1.1)\nThis equation, written by Einstein explains the experimental features noted above, once we assume\nthat the quanta act on individual electrons to eject them. The threshold frequency is defined by\nhν0 = W ,\n(1.2)\nas it leads to a photoelectron with zero energy. For ν > ν0 the electrons will be ejected. Increasing the\nintensity of the light source increases the rate that photons arrive, which will increase the magnitude\nof the current, but will not change the energy of the photoelectrons because it does not change the\nenergy of each incoming quanta.\nEquation (1.2) allowed Einstein to make a prediction: The kinetic energy of the photo-electrons\nincreases linearly with the frequency of light.\nEinstein's prediction was confirmed experimentally\nby Millikan (1915) who measured carefully the photoelectron energies and confirmed their linear\ndependence on the energy. Millikan's careful work allowed him to determine the value of Planck's\nconstant ħto better than 1% accuracy! Still, skepticism remained and physicists were not yet convinced\nabout the particle nature of these light quanta.\nExample: Consider UV light with wavelength λ = 290nm incident on a metal with work function\nW = 4.05eV What is the energy of the photo-electron and what is its speed?\nSolution: It is useful to solve these problems without having to look up constants. For this try\nrecalling this useful relation\nh\nħc = 197.33 MeV.fm ,\nħ≡\n,\n(1.3)\n2π\nwhere MeV = 106eV and fm= 10-15m. Let us use this to compute the photon energy. In this case,\nc\nEγ = hν = 2πħλ = 2π · 197.33 MeV.fm\n290 × 10-9m.\n= 2π · 197.33 eV\n≈4.28 eV,\n(1.4)\nand thus\nEe\n= Eγ -W = 0.23 eV.\n(1.5)\n-\nTo compute the energy we set\n0.23 eV =\n2mev2 =\n2(mec2)\nv\nc\n\n(1.6)\nRecalling that mec2 ' 511, 000eV one finds\n0.46\n511000 =\nv\nc\n!\nv = 0.0009488 .\n(1.7)\nc\nWith and c = 300, 000 Km/s we finally get v ' 284.4 Km/s.\nThis is a good point to consider units, in particular the units of h. We can ask: Is there a physical\nquantity that has the units of h. The answer is yes, as we will see now. From the equation E = hν,\nwe have\nE\nML2/T 2\nL\n[h] =\n=\n= L\nν\n1/T\n· M\n,\nT\n\n(1.8)\n-\n-\n≡\n·\n×\n·\n≈\n-\n\n≃\n\n→\n≃\n\n·\n\nwhere [·] gives the units of a quantity, and M, L, T are units of mass, length, and time, respectively.\nWe have written the right-most expression as a product of units of length and momentum. Therefore\n[h] = [r × p] = [L].\n(1.9)\nWe see that h has units of angular momentum! Indeed for a spin one-half particle, the magnitude of\nthe spin angular momentum is 1 .\n2ħ\nWith [h] = [r][p] we also see that one has a canonical way to associate a length to any particle\nof a given mass m. Indeed, using the speed of light, we can construct the momentum p = mc, and\nthen the length lis obtained from the ratio h/p. This actually is the Compton wavelength lC of a\nparticle:\nh\nλC =\n(1.10)\nmc\nthen has units of length; this is called the Compton wavelength of a particle of mass m. Note that this\nlength is independent of the velocity of the particle. The de Broglie wavelength of the particle uses\nthe true momentum of the particle, not mc! Thus, Compton and de Broglie wavelengths should not\nbe confused!\nIt is possible to get some physical intuition for the Compton wavelength λC of a particle. We claim\nthat λC is the wavelength of a photon whose energy is equal to the rest energy of the particle. Indeed\nwe would have\nmc2 = hν = h c\nλ\n!\nλ = h ,\n(1.11)\nmc\nconfirming the claim. Suppose you are trying to localize a point particle of mass m. If you use light,\nthe possible accuracy in the position of the particle is roughly the wavelength of the light. Once we\nuse light with λ < λC the photons carry more energy than the rest energy of the particle. It is possible\nthen that the energy of the photons go into creating more particles of mass m, making it difficult, if\nnot impossible to localize the particle. The Compton wavelength is the length scale at which we need\nrelativistic quantum field theory to take into account the possible processes of particle creation and\nannihilation.\nLet us calculate the Compton wavelength of the electron:\nh\nλC(e) = mec = 2πħc\nmec2 = 2π · 197.33 MeV.fm = 2426 fm = 2.426 pm.\n(1.12)\n0.511 MeV\nThis length is about 20 times smaller than the Bohr radius (53 pm.) and about two-thousand times\nthe size of a proton (1 fm.). The Compton wavelength of the electron appears in the formula for the\nchange of photon wavelength in the process called Compton scattering.\nCompton Scattering\nOriginally Einstein did not make clear that the light quantum meant a particle of light. In 1916,\nhowever, he posited that the quantum would carry momentum as well as energy, making the case for\na particle much clearer. In relativity, the energy, momentum, and rest mass of a particle are related\nby\nE2 -p2c2 = m2c4.\n(2.13)\n·\n×\n→\n·\n-\n\n(Compare this with the classical equation E = p2/2m.) Of course, one can also express the energy\nand momentum of the particle in terms of the velocity:\nmc2\nE = q\n1 -v2\nc2\n,\np =\nmv\nq\n1 -v2 .\n(2.14)\nc2\nYou should use these expressions to confirm that (2.13) holds (jpj = p). A particle that moves with\nthe speed of light, like the photon, must have zero rest mass, otherwise its energy and momentum\nwould be infinite due to the vanishing denominators. With the rest mass set to zero, equation (2.13)\ngives the relation between the photon energy Eγ and the photon momentum pγ:\nEγ = pγc.\n(2.15)\nThen, using λν = c, we reach\nEγ\npγ = c = hν\nc = h.\n(2.16)\nλ\nWe will see this relation again later when we discuss matter waves.\nFigure 2: Unpolarized light incident on an electron scatters into an angle θ. Classically, this is described\nby Thomson scattering. The light does not change frequency during this process.\nCompton carried out experiments (1923-1924) scattering X-rays offa carbon target. X-rays corre-\nspond to photon energies in the range from 100 eV to 100 KeV. The goal was scattering X-ray photons\nofffree electrons, and with some qualification, the electrons in the atoms behave this way.\nThe classical counterpart of the Compton experiment is the scattering of electromagnetic waves\nofffree electrons, called Thompson scattering. Here an electromagnetic wave is incident on a electron.\nThe electric field of the wave shakes the electron which oscillates with the frequency of the incoming\nfield. The electron oscillation produces a radiated field, of the same frequency as that of the incoming\nradiation. In classical Thomson scattering the differential scattering cross section is given by\ndσ\ndΩ=\ne2\nmc2\n\nq\nq\n| |\n\n1 + cos2 θ ,\n(2.17)\nwhere θ is the angle between the incident and scatte\n\nred wave, w\n\nith the radiated energy at the same\nfrequency as the incoming light. This is shown in Figure 2. The cross-section has units of length-\nsquared, or area, as it should. It represents the area that would extract from the incoming plane wave\nthe amount of energy that is scattered by the electron. Indeed the quantity e2/(mc2) is called the\nclassical electron radius and it is about 2.8 fm! not much bigger than a proton!\nIf we treat the light as photons, the elementary process going on is a collision between two particles;\nan incoming photon and a roughly stationary electron. Two facts can be quickly demonstrated:\n\n- The photon cannot be absorbed by the electron. It is inconsistent with energy and momentum\nconservation (exercise)\n- The photon must lose some energy and thus the final photon wavelength λf must be larger\nthan the initial photon wavelength λi. This is clear in the laboratory frame, where the initially\nstationary electron must recoil and thus acquire some kinetic energy.\nFigure 3: The results of Compton's scattering experiment. The incident photon wavelength is λi, and\nthe scattered photon wavelength is λf ' λi + lC, corresponding to θ = 90*.\nIndeed, Compton's observations did not agree with the predictions of Thompson scattering: the\nX-rays changed frequency after scattering. A calculation using energy and momentum conservation\nshows that the change of wavelength is correlated with the angle between the scattered photon and\nthe original photon:\nh\nλf = λi +\n(1 -cos θ) = λi + lC (1 -cos θ) .\n(2.18)\nmec\nNote that appearance of the Compton wavelength of the electron, the particle the photon scatters off\nfrom. The maximum energy loss for the photon occurs at θ = π, where\nλf(θ = 180*) = λi + 2λC .\n(2.19)\nThe maximum possible change in wavelength is 2λ . For θ = π\nC\n-\n-\n≃\nthe change of wavelength is exactly lC\nλf(θ = 90*) = λi + λC .\n(2.20)\nCompton's experiment used molybdenum X-rays with energy and wavelength\nEγ ≈17.5 keV ,\nλi = 0.0709 nm ,\n(2.21)\nincident on a carbon target. Placing the detector at an angle θ = 90*the plot of the intensity (or\nnumber of photons scattered) as a function of wavelength is shown in Figure 2. One finds a peak for\nfor λf = 0.0731 nm, but also a second peak at the original wavelength λi = 0.0709 nm.\nThe peak at λf is the expected one: λf -λi '≃2.2 pm, which is about the Compton wavelength\nof 2.4 pm. Given that the photons have energies of 17 KeV and the bound state energies of carbon\n\nare about 300 eV, the expected peak represents instances where the atom is ionized by the collision\nand it is a fine approximation to consider the ejected electrons. The peak at λi represents a process\nin which an electron receives some momentum from the photon but still remains bound. This is not\nvery unlikely: the typical momentum of a bound electron is actually comparable to the momentum of\nthe photon. In this case the photon scatters at 90*and the recoil momentum is carried by the whole\natom. The relevant Compton wavelength is therefore that of the atom. Since the mass of the carbon\natom is several thousands of times larger than the mass of the electron, the Compton wavelength of\nthe atom is much smaller than the electron Compton wavelength and there should be no detectable\nchange in the wavelength of the photon.1\nMatter Waves\nAs we have seen, light behaves as both a particle and a wave. This kind of behavior is usually said to\nbe a duality: the complete reality of the object is captured using both the wave and particle features\nof the object. The photon is a particle of energy Eγ, but has frequency ν which is a wave attribute,\nwith E = hν. It is a particle with momentum pγ but it also has a wavelength λ, a wave attribute,\ngiven by (2.16)\nh\nλ =\n.\n(3.22)\npγ\nIn 1924, Louis de Broglie proposed that the wave/particle duality of the photon was universal, and\nthus valid for matter particles too. In this way he conjectured the wave nature of matter. Inspired by\n(3.22) de Broglie postulated that associated to a matter particle with momentum p there is a plane\nwave of wavelength λ given by\nh\nλ =\n.\n(3.23)\np\nThis is a fully quantum property: if h ! 0, then λ ! 0, and the particles have no wave properties.\nAnd exciting consequence of this is that matter particles can diffract or interfere!\nIn the famous\nDavisson-Germer experiment (1927) electrons are strike a metal surface and one finds that at certain\nangles there are peaks in the intensity of the scattered electrons. The peaks showed the effect of\nconstructive interference from scattering offthe lattice of atoms in the metal, demonstrating the wave\nnature of the electrons. One can also do two-slit interference with electrons, and the experiment can\nbe done shooting one electron at a time. A recent experiment [arXiv:1310.8343] by Eibenberger et.al\nreports interference using molecules with 810 atoms and mass exceeding 10 000 amu (that's 20 million\ntimes the mass of the electron!)\nThe de Broglie wavelength can be calculated to estimate if quantum effects are important. Consider\nfor this purpose a particle of mass m and momentum p incident upon an object of size x, as illustrated\nin Figure 3. Let λ = h/p denote the de Broglie wavelength of the particle. The wave nature of the\nparticle is not important if λ is much smaller than x. Thus, the \"classical approximation,\" in which\nwave effects are negligible, requires\nλ\nWave effects negligible:\nx ≪.\n(3.24)\nUsing λ = h/p, this yields\nWave effects negligible:\nx p ≫h ,\n(3.25)\n→\n→\n≪\n≫\n\nFigure 4: A particle of momentum p incident on an obstacle of size x.\na relation in which both sides have units of angular momentum.\nClassical behavior is a subtle limit of quantum mechanics: a classical electromagnetic field requires\na large number of photons. Any state with an exact, fixed number of photons, even if large, is not\nclassical, however. Classical electromagnetic states are so-called coherent states, in which the number\nof photons fluctuates.\nAndrew Turner transcribed Zwiebach's handwritten notes to create the first LaTeX version of this\ndocument.\n1Thanks to V. Vuletic for a clarification of this point.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n8.04 Quantum Physics I\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture Note 4",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-04-quantum-physics-i-spring-2016/0c07cbdc9c352c39eb9539b31ded90d7_MIT8_04S16_LecNotes4.pdf",
      "content": "Lecture 4\nB. Zwiebach\nFebruary 18, 2016\nContents\nde Broglie wavelength and Galilean transformations\nPhase and Group Velocities\nChoosing the wavefunction for a free particle\nde Broglie wavelength and Galilean transformations\nWe have seen that to any free particle with momentum p, we can associate a plane wave, or a \"matter\nwave\", with de Broglie wavelength λ = h/p, with p = jpj. The question is, waves of what? Well, this\nwave is eventually recognized as an example of what one calls the wavefunction. The wavefunction,\nas we will see is governed by the Schr odinger equation. As we have hinted, the wavefunction gives us\ninformation about probabilities, and we will develop this idea in detail.\nDoes the wave have directional or polarization properties like electric and magnetic fields in an\nelectromagnetic wave? Yes, there is an analog of this, although we will not delve into it now. The\nanalog of polarization corresponds to spin! The effects of spin are negligible in many cases (small\nvelocities, no magnetic fields, for example) and for this reason, we just use a scalar wave, a complex\nnumber\nΨ(x, t) 2 C\n(1.1)\nthat depends on space and time. A couple of obvious questions come to mind. Is the wavefunction\nmeasurable? What kind of object is it? What does it describe? In trying to get intuition about this,\nlet's consider how different observers perceive the de Broglie wavelength of a particle, which should\nhelp us understand what kind of waves we are talking about. Recall that\nh\np = λ = h\n2π\n2π = ħk,\n(1.2)\nλ\nwhere k is the wavenumber. How would this wave behave under a change of frame?\nWe therefore consider two frames S and S0 with the x and x0 axes aligned and with S0 moving to\nthe right along the +x direction of S with constant velocity v. At time equal zero, the origins of the\ntwo reference frames coincide.\nThe time and spatial coordinates of the two frames are related by a Galilean transformation, which\nstates that\nx0 = x -vt,\nt0 = t .\n(1.3)\nIndeed time runs at the same speed in all Galilean frames and the relation between x and x0 is manifest\nfrom the arrangement shown in Fig. 1.\nNow assume both observers focus on a particle of mass m moving with nonrelativistic speed. Call\nthe speed and momentum in the S frame ve and p = mve, respectively. It follows by differentiation with\n| |\n∈\n′\n′\n′\n′\n-\n′\n′\n\nFigure 1: The S0 frame moves at speed v along the x-direction of the S frame. A particle of mass m\nmoves with speed v\n,\nf\ne, and thus momentum p = mv in the S frame.\nrespect to t = t0 o the first equation in (1.3) tha\ne\nt\ndx0\ndt0\n= dx -v ,\n(1.4)\ndt\nwhich means that the particle velocity ve0 in the S0 frame is given by\nv 0 = v -v .\n(1.5)\nMultiplying by the mass m we find the relati\ne\non be\ne\ntween the momenta in the two frames\np0 = p -mv.\n(1.6)\nThe momentum p0 in the S0 frame can be appreciably different from the momentum p in the S frame.\nThus the observers in S0 and in S will obtain rather different de Broglie wavelengths λ0 and λ! Indeed,\nh\nλ0 = p0 =\nh\nmv 6= λ,\n(1.7)\np -\nThis is very strange!\nAs we review now, for ordinary waves that propagate in the rest frame of\na medium (like sound waves or water waves) Galilean observers will find frequency changes but no\nchange in wavelength. This is intuitively clear: to find the wavelength one need only take a picture\nof the wave at some given time, and both observers looking at the picture will agree on the value of\nthe wavelength. On the other hand to measure frequency, each observers must wait some time to see\na full period of the wave go through them. This will take different time for the different observers.\nLet us demonstrate these claims quantitatively.\nWe begin with the statement that the phase\nφ = kx -ωt of such a wave is a Galilean invariant. The wave itself may be cos φ or sin φ or some\ncombination, but the fact is that the physical value of the wave at any point and time must be agreed\nby the two observers. The wave is an observable. Since all the features of the wave (peaks, zeroes,\netc, etc) are controlled by the phase, the two observers must agree on the value of the phase.\nIn the S frame the phase can be written as follows\nφ = kx -ωt = k(x -ω\nk t) = 2π\nλ (x -V t) = 2πx\nλ\n-2πV\nλ t,\n(1.8)\nwhere V = ω\n′\n′\n′\n′\n′\n′\n′\n′\n′\n′\n′\n′\n′\n=\n′\n\nis the wave velocity. Note that the wavelength is read from the coefficient of x and ω is\nk\nminus the coefficient of t The two observers should agree on the value of φ. That is, we should have\nφ0′(x′0, t′0) = φ(x, t)\n(1.9)\n\nwhere the coordinates and times are related by a Galilean transformation. Therefore\n2π\nφ0(x0, t0) =\nλ (x -V t) = 2π\nλ (x0 + vt0 -V t0) = 2π\nλ x0 -2π(V -v)t0.\n(1.10)\nλ\nSince the right-hand side is expressed in terms of primed variables, we can read λ0 from the coefficient\nof x0 and ω0 as minus the coefficient of t0:\nλ0 = λ\n(1.11)\n2π\nω0 = λ (V -v) = 2πV\nλ\n\n1 -v\nV\n\n= ω\n\n1 -v\n.\n(1.12)\nV\nThis confirms that, as we claimed, for a physical wave propagating in a\n\nmedium, the wavelength is a\nGalilean invariant and the frequency transforms.\nSo what does it mean that the wavelength of matter waves change under a Galilean transforma-\ntion? It means that the Ψ waves are not directly measurable! Their value does not correspond to a\nmeasurable quantity for which all Galilean observers must agree. Thus, the wavefunction need not be\ninvariant under Galilean transformations:\nΨ(x, t) 6= Ψ0(x0, t0) ,\n(1.13)\nwhere (x, t) and (x0, t0) are related by Galilean transformations and thus represent the same point and\ntime. You will figure out in Homework the correct relation between Ψ(x, t) and Ψ0(x0, t0).\nWhat is the frequency ω of the de Broglie wave for a particle with momentum p? We had\np = ħk\n(1.14)\nwhich fixes the wavelength in terms of the momentum. The frequency ω of the wave is determined by\nthe relation\nE = ħω ,\n(1.15)\nwhich was also postulated by de Broglie and fixes ω in terms of the energy E of the particle. Note\nthat for our focus on non-relativistic particles the energy E is determined by the momentum through\nthe relation\np2\nE =\n.\n(1.16)\n2m\nWe can give three pieces of evidence that (1.15) is a reasonable relation.\n1. If we superpose matter waves to form a wave-packet that represents the particle, the packet\nwill move with the so called group velocity vg, which in fact coincides with the velocity of the\nparticle. The group velocity is found by differentiation of ω with respect to k, as we will review\nsoon:\ndω\nvg = dk\n= dE\ndp\n=\nd\ndp\np2\n2m\n\n=\np\n= v .\n(1.17)\nm\n2. The relation is also suggested by special relativity. The energy and the momentum components\nof a particle form a four-vector:\nE\nc , p\n\n(1.18)\n′\n′\n′\n-\n′\n′ -\n′\n′ -\n-\n′\n′\n′\n′\n′\n-\n-\n-\n=\n′\n′\n′\n′\n′\n′\n′\n′\n′\n\n′\n\nSimilarly, for waves whose phases are relativistic invariant we have another four-vector\nω , k\n(1.19)\nc\nSetting two four-vectors equal to each other is a con\n\nsistent choice: it would be valid in all Lorentz\nframes. As you can see, both de Broglie relations follow from\nE\nc , p\n\n= ħ\nω , k\nc\n\n.\n(1.20)\n3. For photons, (1.15) is consistent with Einstein's quanta of energy, because E = hν = ħω.\nIn summary we have\np = ħk,\nE = ħω .\n(1.21)\nThese are called the de Broglie relations, and they are valid for all particles.\nPhase and Group Velocities\nTo understand group velocity we form wave packets and investigate how fast they move. For this we\nwill simply assume that ω(k) is some arbitrary function of k. Consider a superposition of plane waves\nei(kx-ω(k)t) given by\nψ(x, t) =\nZ\ndk Φ(k)ei(kx-ω(k)t).\n(2.22)\nWe assume that the function Φ(k) is peaked around some wavenumber k = k0, as shown in Fig. 2.\nFigure 2: The function Φ(k) is assumed to peak around k = k0.\nIn order to motivate the following discussion consider the case when Φ(k) not only peaks around\nk0 but it also is real (we will drop this assumption later). In this case the phase φ of the integrand\ncomes only from the exponential:\nφ(k) = kx -ω(k)t .\n(2.23)\nWe wish to understand what are the values of x and t for which the packet ψ(x, t) takes large values.\nWe use the stationary phase principle: since only for k ∼k0 the integral over k has a chance to give a\nnon-zero contribution, the phase factor must be stationary at k = k0. The idea is simple: if a function\nis multiplied by a rapidly varying phase, the integral washes out. Thus the phase must have zero\nderivative at k0. Applying this idea to our phase we find the derivative and set it equal to zero at k0:\ndφ\ndk\n\nk0 = x -dω\ndk\n\nk0 t = 0 .\n(2.24)\n∼\n\nThis means that ψ(x, t) is appreciable when x and t are related by\ndω\nx =\nt\ndk\n\n,\n(2.25)\nk0\nshowing that the packet moves with group velocity\n\ndω\nvg =\n.\ndk\n\n(2.26)\nk0\nExercise. If Φ(k ) is not real write Φ(k) = jΦ(k)jeiφ(k\n\n). Find the new version of (2.25) and show that\nthe velocity of the wave is not changed.\nLet us now do a more detailed calculation that confirms the above analysis and gives some extra\ninsight. Notice first that\nψ(x, 0) =\ndk Φ(k)eikx .\n(2.27)\nWe expand ω(k) in a Taylor expansion around k\nZ\n= k0\ndω\nω(k) = ω(k0) + (k -k0)\n\n+ O\n\n(k\ndk\n-k0)\n.\n(2.28)\nk0\nThen we find, neglecting the O((k -k )2\n\n) terms\ni(k\nk ) dω\nt\nψ(x, t) =\nZ\ndk Φ(k) eikx e-iω(k0)te\n-\n-0\ndk jk0 .\n(2.29)\nIt is convenient to take out of the integral all the factors that do not depend on k:\niω(k )t+ik\ndω\nt\nik dω\nt\nψ(x, t) = e\n-\n0 dk jk0\nZ\ndk Φ(k)eikxe\n-\ndk jk0\n(2.30)\niω(k )t+ik\ndω\nt\nik x\ndω\nt\n= e\n-\n0 dk jk\ndk k\nZ\ndk Φ(k)e\n\n-\nj\n\n.\nComparing with (2.27) we realize that the integral in the above expression can be written in terms of\nthe wavefunction at zero time:\n-iω(k\ndω\n0)t+ik0 dk j\nt\ndω\nψ(x, t) = e\nk0\nψ\n\nx -\n(2.31)\ndk\n\nt .\nk0\n\nThe phase factors in front of the expression are not important in trac\n\nking where the wave packet is.\nIn particular we can take the norm of both sides of the equation to find\ndω\njψ(x, t)j =\nψ\n\nx -\nt,\ndk\n\nk0\n\nIf ψ(x, 0) peaks at some value x it is clear from the abov\n\ne equation\n.\n(2.32)\nthat jψ(x, t)j peaks for\ndω\nx -\n\ndω\nt = x0\n!\nx = x0 +\ndk k\ndk\n\nsho\n\nt ,\n(2.33)\nk0\nwing that the peak of the packet moves with velocity vgr = dω, ev\n\naluated at k0.\ndk\n-\n-\n-\n-\n-\n-\n|\n-\n|\n-\n|\n-\n|\n-\n|\n-\n|\n-\n-\n|\n|\n-\n→\n|\n|\n|\n|\n\nChoosing the wavefunction for a free particle\nWhat is the mathematical form of the wave associated with a particle a particle with energy E and\nmomentum p? We know that ω and k are determined from E = ħomega and p = ħk. Let's suppose\nthat we want our wave to be propagating in the +xˆ direction. All the following are examples of waves\nthat could be candidates for the particle wavefunction.\n1. sin (kx -ωt)\n2. cos (kx -ωt)\n3. ei(kx-ωt) = eikxe-iωt - time dependence / e-iωt\n4. e-i(kx-ωt) = e-ikxeiωt - time dependence / e+iωt\nIn the third and fourth options we have indicated that the time dependence could come with either\nsign. We will use superposition to decide which is the right one! We are looking for a wave-function\nwhich is non-zero for all values of x.\nLet's take them one by one:\n1. Starting from (1), we build a superposition in which the particle has equal probability to be\nfound moving in the +x and the -x directions.\nΨ(x, t) = sin (kx -ωt) + sin (kx + ωt)\n(3.1)\nExpanding the trigonometric functions this can be simplified to\nΨ(x, t) = 2 sin(kx) cos(ωt) .\n(3.2)\nBut this result is not sensible. The wave function vanishes identically for all x at some special\ntimes\nωt =\nπ\n2 , 3π\n2 , 5π, ...\n\n(3.3)\nA wavefunction that is zero cannot represent a particle.\n2. Constructing a wave function from (2) with a superposition of left and right going cos waves,\nΨ(x, t) = cos(kx -ωt) + cos(kx + ωt) = 2 cos(kx) cos(ωt) .\n(3.4)\nThis choice is no good, it also vanishes identically when ωt =\nπ\n2 , 3π, ...\n3. Let's try a similar superposition of exponentials from (3), with both\n\nhaving the same time\ndependence\nΨ(x, t)\n=\nei(kx-ωt) + ei(-kx-ωt)\n(3.5)\n=\n(eikx + e-ikx) e-iωt\n(3.6)\n=\n2 cos kx e-iωt .\n(3.7)\nThis wavefunction meets our criteria! It is never zero for all values of x because e-iωt is never\nzero.\n-\n-\n-\n-\n∝\n-\n-\n-\n-\n∝\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n\n4. A superposition of exponentials from (4) also meets our criteria\nΨ(x, t)\n=\ne-i(kx-ωt) + e-i(-kx-ωt)\n(3.8)\n=\n(eikx + e-ikx) eiωt\n(3.9)\n=\n2 cos kx eiωt .\n(3.10)\nThis is never zero for all values of x\nSince both options (3) and (4) seem to work we ask: Can we use both (3) and (4) to represent a\nparticle moving to the right (in the +xˆ direction)? Let's assume that we can. Then, since adding a\nstate to itself should not change the state, we could represent the right moving particle by using the\nsum of (3) and (4)\nΨ(x, t) = ei(kx-ωt) + e-i(kx-ωt) = 2 cos(kx -ωt) .\n(3.11)\nThis, however, is the same as (2), which we already showed leads to difficulties. Therefore we must\nchoose between (3) and (4).\nThe choice is a matter of convention, and all physicists use the same convention. We take the free\nparticle wavefunction to be\nFree particle wavefunction :\nΨ(x, t) = ei(kx-ωt) ,\n(3.12)\nrepresenting a particle with\np = ħk ,\nand\nE = ħω .\n(3.13)\nIn three dimensions the corresponding wavefunction would be\nFree particle wavefunction :\nΨ(x, t) = ei(k·x-ωt) ,\n(3.14)\nrepresenting a particle with\np = ħk ,\nand\nE = ħω .\n(3.15)\nAndrew Turner and Sarah Geller transcribed Zwiebach's handwritten notes to create the first LaTeX\nversion of this document.\n-\n-\n--\n-\n-\n-\n-\n-\n-\n-\n· -\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n8.04 Quantum Physics I\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture Note 5",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-04-quantum-physics-i-spring-2016/a512b3a45fd80afefa7640c366839191_MIT8_04S16_LecNotes5.pdf",
      "content": "Lecture 5\nB. Zwiebach\nFebruary 21, 2016\nContents\nEquations for a wavefunction\nSchr odinger Equation for particle in a potential\nInterpreting the Wavefunction\nEquations for a wavefunction\nWe determined that the wavefunction or de Broglie wave for a particle with momentum p and\nenergy E is given by\nΨ(x, t) = ei(kx-ωt) ,\n(1.1)\nwhere ω and k are determined from\np2\np = ħk,\nE = ħω ,\nE =\n(1.2)\n2m\nThe wavefunction (1.1) represents a state of definite momentum. It is then of interest to find an\noperator that extracts that information from the wavefunction. The operator must be, roughly,\na derivative with respect to x, as this would bring down a factor of k. In fact more precisely,\nwe take\nħ\ni\n∂\n∂xΨ(x, t) = ħ(ik)Ψ(x, t)\ni\n= ħ\n(1.3)\nkΨ(x, t)\n= pΨ(x, t)\nwhere the p factor in the last right-hand side is just the momentum. We thus identify the\noperator ħ\ni\n∂\nm\n∂x as the\nomentum operator pˆ\nħ\npˆ ≡\n∂\ni\n.\n∂x\n(1.4)\nand we have verified that acting on the wavefunction Ψ(x, t) for a particle of momentum p it\ngives p times the wavefunction:\npˆΨ = p Ψ .\n(1.5)\nThe momentum operator it acts on wavefunctions, which are functions of space and time to\ngive another function of x and t. Since pˆ on Ψ gives a number (p, in fact) times Ψ we say\n\nthat Ψ is an eigenstate of pˆ. The matrix algebra analogy is useful: matrices are the operators\nand column vectors are the states.\nMatrices act by multiplication on column vectors.\nAn\neigenvector of a matrix is a special vector. The matrix acting on an eigenvector gives a number\ntimes the eigenvector. After the action of the matrix the direction of the vector is unchanged\nbut its magnitude can be scaled. The same for eigenstates of operators: an operator acting on\nan eigenstate gives the eigenstate up to a multiplicative constant. We also say that Ψ is a state\nof definite momentum.\nLet us now consider extracting the energy information from the free particle wavefunction. This\ntime we must avail ourselves of the time derivative:\n∂\niħ\nΨ(x, t) = iħ(-iω)Ψ(x, t) = ħω Ψ(x, t) = E Ψ(x, t) .\n(1.6)\n∂t\nIt would seem plausible to say that the time derivative iħ∂\n∂t is an energy operator but, for a\nfree particle the energy is given in terms of the momentum, so we can construct the relevant\nenergy operator by working on the above right-hand side\np2\nEΨ = 2mΨ =\np\n2m pΨ =\np\n2m\nħ\ni\n∂Ψ ,\n(1.7)\n∂x\nwhere we used equation (1.5) to write pΨ as the momentum operator acting on Ψ. Since p is\na constant we can move the p factor on the last right-hand side close to the wavefuntion and\nthen replace it by the momentum operator:\nEΨ = 2m\nħ\ni\n∂\n∂x pΨ =\n2m\nħ\ni\n∂\n∂x\nħ\ni\n∂Ψ .\n(1.8)\n∂x\nThis can be written as\nEΨ = 2m ˆp ˆp Ψ =\nˆp2\nΨ ,\n(1.9)\n2m\nˆ\nwhich suggests the following definition of the energy operator E :\npˆ2\nEˆ ≡2m = -ħ2\n2m\n∂2\n.\n(1.10)\n∂x2\nˆ\nIndeed, for our free particle wavefunction, (1.9) shows that EΨ = EΨ.\nOur work also allows us to find an differential equation for which our de Broglie wavefunction\nˆ\nis a solution. Consider (1.6) and replace the right hand side EΨ by EΨ giving us\n∂\nħ2 ∂2\niħ\nΨ(x, t) = -\nΨ(x, t) .\n∂t\n2m ∂x2\n(1.11)\nThis is the free-particle Schro dinger equation. More schematically, using the energy operator,\nit can be written as\n∂\niħ\nΨ(x, t\nˆ\n) = E Ψ(x, t) .\n∂t\n(1.12)\n\nIt is worth re-checking that our de Broglie wavefunction satisfies the Schro dinger equation\n(1.11). Indeed for Ψ = ei(kx-ωt) we find\nħ2\niħ(-iω)Ψ = -\n(ik)2Ψ\n(1.13)\n2m\nwhich is a solution since the Ψ factors cancel and all that is needed is the equality\nħ2k2\nħω =\n,\n(1.14)\n2m\nwhich is recognized as the familiar relation E = p .\n2m\nNote that the Schro dinger equation admits more general solutions than the de Broglie wave-\nfunction for a particle of definite momentum and definite energy. Since the equation is linear,\nany superposition of plane wave solutions with different values of k is a solution. Take for\nexample\nΨ(x, t) = ei(k1x-ω1t) + ei(k2x-ω2t)\n(1.15)\nThis is a solution, and note that while each summand corresponds to a state of definite mo-\nmentum, the total solution is not a state of definite momentum. Indeed\npˆΨ(x, t) =\nk ei(k1x-ω1t) + k ei(k2x-ω\nħ\nħ\n2t)\n,\n(1.16)\nand the right hand side cannot be written as a number times Ψ. The full state is not a state of\ndefinite energy either. The general solution of the free Schro dinger equation is the most general\nsuperposition of plane waves:\ninf\nΨ(x, t) =\nZ\ndk Φ(k) ei(kx-ω(k)t) ,\n(1.17)\n-inf\nwhere Φ(k) is an arbitrary function of k that controls the superposition and we have written\nω(k) to emphasize that ω is a function of the momentum, as in (1.14).\nExercise. Verify that Ψ in (1.17) solves the free Schro dinger equation.\nWe now have the tools to time-evolve any initial wavefunction.\nNamely, given the initial\nwavefunction Ψ(x, 0) of any packet at time equal zero, we can obtain Ψ(x, t). Indeed, using\nFourier transformation one can write\nΨ(x, 0) =\nZ\ndk Φ(k) eikx ,\n(1.18)\nwhere Φ(k) is the Fourier transform of Ψ(x, 0). But then, the time evolution simply consists\nin adding the exponential e-iω(k)t to the integral, so that the answer for the time evolution is\nindeed given by (1.17).\nAs we have discussed before, the velocity of a wave packet described by (1.17) is given by the\ngroup velocity evaluated for the dominant value of k. We confirm that this is indeed reasonable\n∂ω\n∂ħω\n∂E\n∂\np2\np\nvg ≡\n=\n=\n=\n=\n∂k\n∂ħk\n∂p\n∂p\n\n2m\n\n,\n(1.19)\nm\n\nwhich is the expected velocity for a free non-relativistic particle with momentum p and mass m.\nThe Schro dinger equation has an explicit i on the left-hand side. This i shows that it is\nimpossible to find a solution for real Ψ. If Ψ were real the right-hand side of the equation would\nbe real but the left-hand side would be imaginary. Thus, the Schro dinger equation forces us to\nwork with complex wavefunctions.\nNote also that the Schro dinger equation does not take the form of a conventional wave\nequation. A conventional wave equation for a variable φ takes the form\n∂2φ\n∂x2 -1\nV 2\n∂2φ = 0 .\n(1.20)\n∂t2\nThe general solutions of this linear equation are f±(x ± V t). This would certainly allow for\nreal solutions, which are not acceptable in quantum theory. The Schro dinger equation has no\nsecond-order time derivatives. It is first-order in time!\nSchro dinger Equation for particle in a potential\nSuppose now that our quantum particle is not free but rather is moving in some external\npotential V (x, t). In this case, the total energy of the particle is no longer simply kinetic, it is\nthe sum of kinetic and potential energies:\np2\nE =\n+ V (x, t) ,\n(2.1)\n2m\nThis naturally suggests that the energy operator should take the form\npˆ2\nEˆ =\n+ V (x, t) .\n(2.2)\n2m\nThe first term, as we already know, involves second derivatives with respect to x. The second\nterm acts multiplicatively: acting on any wavefunction Ψ(x, t) it simply multiplies it by V (x, t).\nWe now postulate that the Schro dinger equation for a particle in a potential takes the form\n(1.12) with Eˆ replaced by the above energy operator:\n∂\nħ2 ∂2\niħ\nΨ(x, t) =\n-\n+ V (x, t) Ψ(x, t) .\n∂t\n2m ∂x2\n\n(2.3)\nEˆ\nˆ\nThe energy operator\nis usually called the Hamiltonian operator H, so one has\nħ\n∂2\nHˆ ≡-\n+ V (x, t) ,\n2m ∂x2\n(2.4)\nand the Schro dinger equation takes the form\n∂\niħ\nΨ(x, t\nˆ\n) = H Ψ(x, t)\n∂t\n.\n(2.5)\n\nLet us reconsider the way in which the potential V (x, t) is an operator. We can do this by\nintroducing a position operator xˆ that acting on functions of x gives another function of x as\nfollows:\nxˆf(x) ≡xf(x) .\n(2.6)\nNote that it follows from this equation and successive applications of it that\nxˆkf(x) ≡xkf(x) .\n(2.7)\nIf the potential V (x, t) can be written as some series expansion in terms of x it then follows\nthat\nV (xˆ, t)Ψ(x, t) ≡V (x, t)Ψ(x, t) .\n(2.8)\nThe operators we are dealing with (momentum, position, Hamiltonian) are all declared to\nˆ\nbe linear operators. A linear operator A satisfies\nAˆ(aφ) = a Aˆφ ,\nAˆ(φ1 + φ\nˆ\n2) = Aφ\nAˆ\n1 +\nφ2 ,\n(2.9)\nˆ\nˆ\nwhere a is a constant. Two linear operators A and B that act on the same set of objects can\nAˆ\nˆ\nalways be added (\n+ B)φ ≡Aˆφ\nˆ\n+ Bφ\nˆ ˆ\n. They can also be multiplied, the product AB is a\nˆ ˆ\nˆ ˆ\nˆ\nlinear operator defined by ABφ ≡A(Bφ), meaning that you act first with B, which is closest\nto φ\nˆ\nˆ ˆ\nand then act on the result with A. The order of multiplication matters and thus AB and\nBˆAˆ may not be the same operators. To quantify this possible difference one introduces the\ncommutator [A, B] of two operators, defined to be the linear operator\nAˆ\n[\n, Bˆ ] ≡AˆBˆ -BˆAˆ .\n(2.10)\nIf the commutator vanishes, the two operators are said to commute.\nIt is also clear that\nAˆ, Aˆ\nˆ\n[\n] = 0 for any operator A.\nWe have operators xˆ and pˆ that are clearly somewhat related.\nWe would like to know\ntheir commutator [ xˆ , pˆ]. For this we let [ xˆ , pˆ] act on some arbitrary function φ(x) and then\nattempt simplification. Let's do it.\n[ xˆ , pˆ]φ(x) = (xˆpˆ-pˆxˆ)φ(x) = xˆpˆφ(x) -pˆxˆ φ(x)\n= xˆ(pˆφ(x)) -pˆ(xˆφ(x))\n= xˆ\nħ\ni\n∂x\nħ∂φ(x)\nħ∂\n= x\n-\n(xφ(x))\ni\n∂x\ni ∂x\nħ∂φ(x)\nħ∂φ(x)\nħ\n=\nx\n-\nx\n-\nφ(x)\ni\n∂x\ni\n∂x\ni\nħ\n= -φ(x) = iħφ(x) ,\n∂φ(x)\n-ˆp(xφ(x))\n(2.11)\ni\nso that, all in all, we have shown that for arbitrary φ(x) one has\n[ xˆ , pˆ]φ(x) = iħφ(x) .\n(2.12)\n\nSince this equation holds for any φ it really represents the equality of two operators. Whenever\nˆ\nwe have Aφ\nBˆ\n=\nφ\nˆ\nˆ\nfor arbitrary φ we simply say that A = B. The operators are the same\nbecause they give the same result acting on anything! We have therefore discovered the most\nfundamental commutation relation in quantum mechanics:\n[ xˆ , pˆ] = iħ.\n(2.13)\nThe right hand side is a number, but should be viewed as an operator (acting on any function it\nmultiplies by the number). This commutation relation can be used to prove Heisenberg's uncer-\ntainty principle, which states that the product of the position uncertainty and the momentum\nuncertainty must always exceed ħ/2.\nThe idea that operators can fail to commute may remind you of matrix multiplication, which\nis also non-commutative. We thus have the following correspondences:\noperators\n↔\nmatrices\nwavefunctions\n↔\nvectors\n(2.14)\neigenstates\n↔eigenvectors\nOne can in fact formulate Quantum Mechanics using matrices, so these correspondences are\nactually concrete and workable.\nAs an example of useful matrices that do not commute, consider the Pauli matrices, three\ntwo-by-two matrices given by\nσ1 =\n\n, σ2 =\n-i\ni\n\nσ3 =\n\n-1\n\n.\n(2.15)\nActually these matrices are exactly what is needed to consider spin one-half particles. The spin\noperator S has three components Si = ħσi. Let us now see if σ1 and σ2 commute.\n-i\ni\nσ1σ2 =\n\ni\n\n=\n\n-i\n\n(2.16)\n-i\nσ2σ1 =\ni\n\n=\n\n-i\ni\n\nWe then see that\n[σ1 σ2] =\n\ni\n\n,\n= 2i\ni\n-2i\n\n-1\n\n= 2 σ\n(2.17)\nIn fact, one also has [σ2, σ3] = 2iσ1 and [σ3, σ1] = 2iσ2.\nMatrix mechanics, was worked out in 1925 by Werner Heisenberg and clarified by Max\nBorn and Pascual Jordan. Note that, if we were to write xˆ and pˆ operators in matrix form,\nthey would require infinite dimensional matrices. One can show that there are no finite size\nmatrices that commute to give a number times the identity matrix, as is required from (2.13).\nThis shouldn't surprise us: on the real line there are an infinite number of linearly independent\nwavefunctions, and in view of the correspondences in (2.14) it would suggest an infinite number\nof basis vectors. The relevant matrices must therefore be infinite dimensional.\nTwo basic properties of the Schro dinger equation\n\n1. The differential equation is first order in time. This means that for an initial condition it\nsuffices to know the wavefunction completely at some initial time t0 and the Schro dinger\nequation then determines the wave function for all times. This can be understood very\nexplicitly. If we know Ψ(x, t0) for all x then the right-hand side of the Schro dinger equa-\ntion, which just involves x derivatives and multiplication, can be evaluated at any point x.\nThis means that at any point x we know the time-derivative of the wavefunction (left-\nhand side of the Schro dinger equation) and this allows us to calculate the wavefunction\na little time later.\n2. Linearity and superposition. The Schro dinger equation is a linear equation for complex\nwavefunctions. Therefore, given two solutions Ψ1 and Ψ2, we can form new solutions as\nlinear combinations αΨ1 + βΨ2 with complex coefficients α and β.\nWe have written the Schro dinger equation for a particle on a one-dimensional potential.\nHow about for the case of a particle in a three-dimensional potential? As we will see now, this\nis easily done once we realize that in three dimensions the position and momentum operators\nhave several components! Recall that the de Broglie wavefunction\nΨ(x, t) = ei(k·x-ωt) = e i( kxx+kyy+kzz -ωt )\n(2.18)\ncorresponds to a particle carrying momentum p = ħk, with k = (kx, ky, kz). Just as we did in\n(1.3) we can try to extract the vector momentum by using a differential operator. The relevant\noperator is the gradient:\n∇=\n∂\n∂x , ∂\n∂y , ∂\n(\n∂z\n\n2.19)\nwith which we try\nħ\ni ∇Ψ(x, t) = ħikx, iky, ikz Ψ(x, t) = ħk Ψ(x, t) = p Ψ(x, t) .\n(2.20)\ni\nWe therefore define the momen\ntum operato\n\nr pˆ as follows:\nħ\npˆ =\n∇.\n(2.21)\ni\nIf we call the momentum components (p1, p2, p3) = (px, py, pz) and the coordinates as (x1, x2, x3) =\n(x, y, z) then we have that the components of the above equation are\nħ\npˆk =\ni\n∂\n,\nk = 1, 2, 3 .\n(2.22)\n∂xk\nJust like we defined a position operator xˆ, we now have three position operators (xˆ1, xˆ2, xˆ3)\nmaking up xˆ. With three position and three momentum operators, we now should state the\nnine possible commutation relations. If you recall our derivation of [xˆ, pˆ] = iħyou will note\nthat the commutator vanishes unless the superscripts on xˆ and pˆ are the same. This means\nthat we have\n[ xˆi , pˆj ] = iħδij ,\n(2.23)\n\nwhere the Kronecker delta is defined by\n(\n1 if i = j ,\nδij =\n(2.24)\n0 if i = j .\nIn order to write now the general Schro dinger equation we need to consider the kinetic energy\noperator, or the Hamiltonian:\npˆ2\nHˆ =\n+ V (x, t) ,\n(2.25)\n2m\nThis time\nħ\npˆ2 = pˆ · pˆ =\ni ∇· ħ∇= -\nħ∇2\n(2.26)\ni\nwhere ∇2 is the Laplacian operator\n∇2\n∂2\n≡∂x2 + ∂2\n∂y2 + ∂2\n.\n(2.27)\n∂z2\nThe Schro dinger equation finally takes the form\niħ∂\nħ\nΨ(x, t) =\n∂t\n\n-\n∇2 + V (x, t)\n2m\n\nΨ(x, t) .\n(2.28)\nInterpreting the Wavefunction\nSchro dinger thought that the wavefunction Ψ represents a particle that could spread out and\ndisintegrate. The fraction of the particle to be found at x would be proportional to the mag-\nnitude of |Ψ|2. This was problematic, as noted by Max Born (1882-1970). Born solved the\nSchro dinger equation for scattering of a particle in a potential, finding a wavefunction that\nfell like 1/r, with r the distance to the scattering center. But Born also noticed that in the\nexperiment one does not find fractions of particles going in many directions but rather particles\nremain whole. Born suggested a probabilistic interpretation. In his proposal,\nThe wavefunction Ψ(x, t) doesn't tell us how much of the particle is at position x at\ntime t but rather the probability that upon measurement taken at time t we would\nfind the particle at position x.\nTo make this precise we use an infinitesimal volume element with volume d3x centered\naround some arbitrary point x. The probability dP to find the particle within the volume\nelement d3x at time t is\ndP = |Ψ(x, t)|2 d3x .\n(3.1)\nConsistency requires that the total probability to find the particle somewhere in the whole\nspace is unity. Thus the integral of dP over all of space must give one:\nZ\nd3x |Ψ(x, t)|2 = 1\n(3.2)\nall space\nNext time we will explore the consistency of this equation with time evolution.\nSarah Geller transcribed Zwiebach's handwritten notes to create the first LaTeX version of this\ndocument.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n8.04 Quantum Physics I\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture Note 6",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-04-quantum-physics-i-spring-2016/d87c768c4e1181fde8d4366112169719_MIT8_04S16_LecNotes6.pdf",
      "content": "Lecture 6\nB. Zwiebach\nFebruary 23, 2016\nContents\nNormalization and time evolution\nThe Wavefunction as a Probability Amplitude\nThe Probability Current\nProbability current in 3D and current conservation\nNormalization and time evolution\nThe wavefunction Ψ(x, t) that describes the quantum mechanics of a particle of mass m moving\nin a potential V (x, t) satisfies the Schro dinger equation\n∂Ψ(x, t)\niħ\n=\n\nħ2 ∂\n-\n2 + V (x, t) Ψ(x, t) ,\n(1.1)\n∂t\n2m ∂x\n\nor more briefly\n∂Ψ(x, t)\niħ\nˆ\n= H Ψ(x, t) .\n(1.2)\n∂t\nThe interpretation of the wavefunction arises by declaring that dP, defined by\ndP = |Ψ(x, t)|2dx ,\n(1.3)\nis the probability to find the particle in the interval dx centered on x at time t. It follows that\nthe probabilities of finding the particle at all possible points must add up to one:\nZ inf\nΨ∗(x, t) Ψ(x, t) dx = 1 .\n(1.4)\n-inf\nWe will try to understand how this equation is compatible with the time evolution prescribed by\nthe Schro dinger equation. But before that let us examine what kind of conditions are required\nfrom wavefunctions in order to satisfy (1.4).\nSuppose the wavefunction has well-defined limits as x →±inf. If those limits are different\nfrom zero, the integral around infinity would produce an infinite result, which is inconsistent\nwith the claim that the total integral is one. Therefore the limits should be zero:\nlim Ψ(x, t) = 0 .\n(1.5)\nx→±inf\n\nIt is in principle possible to have a wavefunction that has no well-defined limit at infinity but\nis still is square integrable. But such cases do not seem to appear in practice so we will assume\nthat (1.5) holds. It would also be natural to assume that the spatial derivative of Ψ vanishes as\nx →±infbut, as we will see soon, it suffices to assume that the limit of the spatial derivative\nof Ψ is bounded\n∂Ψ(x, t)\nlim\n< inf.\n(1.6)\nx→±inf\n∂x\nWe have emphasized before that the overall numerical factor multiplying the wavefunction\nis not physical. But equation (1.4) seems to be in conflict with this: if a given Ψ satisfies it,\nthe presumed equivalent 2Ψ will not! To make precise sense of probabilities it is convenient to\nwork with normalized wavefunctions, but it is not necessary, as we show now. Since time plays\nno role in the argument, so assume in all that follows that the equations refer to some time t0\narbitrary but fixed. Suppose you have a wavefunction such that\nZ\ndx |Ψ|2 = N = 1 .\n(1.7)\nThen I claim that the probability dP to find the particle in the interval dx about x is given by\ndP =\n|Ψ|2 dx .\n(1.8)\nN\nThis is consistent because\nZ\ndP =\nZ\ndx |Ψ|2 =\n· N = 1 .\n(1.9)\nN\nN\nNote that dP is not changed when Ψ is multiplied by any number. Thus, this picture makes\nit clear that the overall scale of Ψ contains no physics. As long as the integral\nΨ 2dx <\nthe wavefunction is said to be normalizable, or square-integrable\n| |\ninf\n. By adjust\nR\ning the overall\ncoefficient of Ψ we can then make it normalized.\nIndeed, again assuming (1.7) the new\nwavefunction Ψ′ defined by\nΨ′\n= √\nΨ ,\n(1.10)\nN\nis properly normalized. Indeed\nZ\ndx|Ψ′|2\n=\nZ\n|Ψ|2dx = 1 .\n(1.11)\nN\nWe sometimes work with wavefunctions for which the integral (1.4) is infinite. Such wave-\nfunctions can be very useful. In fact, the de Broglie plane wave Ψ = exp(ikx -iωt) for a free\nparticle is a good example: since Ψ 2 = 1 the integral is in fact infinite. What this means is\nthat exp(ikx -iωt\n| |\n) does not truly represent a single particle. To construct a square-integrable\nwavefunction we can use a superposition of plane waves. It is indeed a pleasant surprise that\nthe superposition of infinitely many non-square integrable waves is square integrable!\n\nThe Wavefunction as a Probability Amplitude\nLet's begin with a normalized wavefunction at initial time t0\nZ inf\nΨ∗(x, t0)Ψ(x, t0)dx = 1 .\n(2.1)\n-inf\nSince Ψ(x, t0) and the Schro dinger equation determine Ψ for all times, do we then have\nZ inf\nΨ∗(x, t)Ψ(x, t)dx = 1 ?\n(2.2)\n-inf\nDefine the probability density ρ(x, t)\nρ(x, t) ≡Ψ∗(x, t)Ψ(x, t) = |Ψ(x, t)|2 .\n(2.3)\nDefine also N (t) as the integral of the probability density throughout space:\nN (t) ≡\nZ\nρ(x, t)dx .\n(2.4)\nThe statement in (2.1) that the wavefunction begins well normalized is\nN (t0) = 1 ,\n(2.5)\nand the condition that it remain normalized for all later times is N (t) = 1. This would be\nguaranteed if we showed that for all times\ndN (t) = 0 .\n(2.6)\ndt\nWe call this conservation of probability. Let's check if the Schro dinger equation ensures this\ncondition will hold:\ndN (t) =\ndt\nZ inf∂ρ(x, t)dx\n-inf\n∂t\n.7\nZ inf\n(2 )\n∂Ψ∗\n∂\nΨ(x, t) + Ψ∗\nΨ(x, t)\n=\n(x, t)\n\ndx .\n-inf\n∂t\n∂t\nFrom the Schro dinger equation, and its complex conjugate\n∂Ψ\n∂Ψ\ni\niħ\nˆ\n= HΨ\n=\n∂t\n⇒\n=\n∂t\n-HˆΨ ,\n(2.8)\nħ\n∂Ψ∗\n∂Ψ∗\ni\n-iħ\nˆ\n= (H\nˆ\nΨ)∗\n=\n=\n(HΨ)∗.\n(2.9)\n∂t\n⇒\n∂t\nħ\nIn complex conjugating the Schro dinger equation we used that the complex conjugate of the\ntime derivative of Ψ is simply the time derivative of the complex conjugate of Ψ. To conjugate\n\nˆ\nthe right hand side we simply added the star to the whole of HΨ. We now use (2.8) and (2.9)\nin (2.7) to find\ndN (t)\ni\n=\nZ inf\ni\nˆ\n(HΨ)∗Ψ -\nΨ∗ˆ\n(HΨ)\nd\n\ndx\nt\nħ\nħ\n-inf\ni\n= ħ\nZ inf\n(2.10)\nˆ\n(HΨ)∗Ψdx\n-inf\n-\nZ inf\n∗Hˆ\nΨ (\nΨ)dx\n-inf\n\n.\nTo show that the time derivative of N (t) vanishes, it suffices to show that\nZ inf\ninf\nˆ\n(HΨ)∗Ψ =\nZ\nΨ∗ˆ\n(HΨ) .\n(2.11)\n-inf\n-inf\nˆ\nEquation (2.11) is the condition on the Hamiltonian operator H for conservation of probability.\nˆ\nˆ\nIn fact, if H is a Hermitian operator the condition will be satisfied.\nThe operator H is a\nHermitian operator if it satisfies\nZ inf\nH\nZ inf\nˆ\n∗\n∗\nHˆ\nHermitian operator:\n(\nΨ ) Ψ\n=\nΨ1(\nΨ2) .\n(2.12)\n-inf\n-inf\nHere we have two wavefunctions that are arbitrary, but satisfy the conditions (1.5) and (1.6).\nAs you can see, a Hermitian operator can be switched from acting on the first function to acting\non the second function. When the two functions are the same, we recover condition (2.11).\nIt is worth closing this circle of ideas by defining the Hermitian conjugate T + of the linear\noperator T. This is done as follows:\nZ inf\nΨ∗(TΨ ) =\nZ inf\n(T +Ψ )∗\nΨ2 .\n(2.13)\n-inf\n-inf\nThe operator T +, which is also linear, is calculated by starting from the left-hand side and\ntrying to recast the expression with no operator acting on the second function. An operator T\nis said to be Hermitian if it is equal to its Hermitian conjugate:\nT is Hermitian if\nT + = T .\n(2.14)\nHermitian operators are very important in Quantum Mechanics. They have real eigenvalues\nand one can always find a basis of the state space in terms of orthonormal eigenstates. It turns\nout that observables in Quantum Mechanics are represented by Hermitian operators, and the\npossible measured values of those observables are given by their eigenvalues. Our quest to show\nthat normalization is preserved under time evolution in Quantum Mechanics has come down\nto showing that the Hamiltonian operator is Hermitian.\n\nThe Probability Current\nLet's take a closer look at the integrand of equation (2.10). Using the explicit expression for\nthe Hamiltonian we have\n∂ρ\ni\nˆ\n=\n((HΨ)∗Ψ\nΨ∗ˆ\n(HΨ))\n∂t\nħ\n-\ni\n∂\n=\n\nħ2\nΨ\n-\n∂2Ψ∗\n2 Ψ\nΨ\nħ\n2m\n∂x\n-\n∗\n∂x2\n\n+ V (x, t)Ψ∗Ψ -Ψ∗V (x, t)Ψ\n\n(3.1)\n.\nThe contributions from the potential cancel and we then get\ni\nħ\n∂2\n∗\n2Ψ\n((HˆΨ)∗Ψ -\n∗\nΨ\n∂\nˆ\nΨ (HΨ)) =\nΨ\nim\n\n∂x2\n-Ψ∗\n.2\nħ\nx2\n\n.\n(3 )\n∂\nThe only chance to get to show that the integral of the right-hand side is zero is to show that\nit is a total derivative. Indeed, it is!\ni\nˆ\n((HΨ)∗Ψ\nħ\n-Ψ∗\n∂\nˆ\n(HΨ)) =\n∂x\nħ\n2im\n∂Ψ∗\nΨ\n∂x\n-Ψ∗∂Ψ\n∂x\n\n∂\n=\n-∂x\nħ\nΨ∗∂Ψ\n∂Ψ∗\nΨ\n2im\n\n∂x -∂x\n\n(3.3)\n∂ ħ\n\n∗∂Ψ\n=\n-\n2i Im Ψ\n∂x 2im\n∂x\n\n∂\n∂\n=\n-\nħ\nΨ\nIm Ψ∗\n,\n∂x m\n\n∂x\n\nwhere we used that z -z∗= 2i Im(z). Recall that the left-hand side we have evaluated is\nactually ∂ρ and therefore the result obtained so far is\n∂t\n∂ρ\n∂\n+\nħIm\n\nΨ∗∂Ψ\n= 0 .\n(3.4)\n∂t\n∂x m\n∂x\nThis equation encodes charge conservation and is of the type\n∂ρ\n∂J\n+\n= 0 ,\n(3.5)\n∂t\n∂x\nwhere J(x, t) is the current associated with the charge density ρ. We have therefore identified\na probability current\nħ\nJ(x, t) ≡\nIm\nm\n\nΨ∗∂Ψ\n∂x\n\n.\n(3.6)\nThere is just one component for this current since the particle moves in one dimension. The\nunits of J are one over time, or probability per unit time, as we now verify.\n\nFor one spatial dimension, [Ψ] = L-1/2, which is easily seen from the requirement that\nR\ndx|Ψ|2 is unit free. (When working with d spatial dimensions the wavefunction will have\nunits of L-d/2). We then have\n\nΨ∗∂Ψ\nML2\nħ\nL2\n=\n,\n[ħ\n] =\n,\n∂x\nL\nT\n\nm\n\n=\n,\n(3.7)\nT\n=⇒[J] =\n= probability per unit time\n(3.8)\nT\nWe can now show that the time derivative of N is zero. Indeed, using (3.5) we have\ndN\n∂ρ\n=\nZ inf\ninf∂J\ndx\n=\nd\ndt\n-inf\n∂t\n-\nZ\nx =\ninf\n∂x\n-(J(inf, t) -J(-inf, t)) .\n(3.9)\nThe derivative vanishes if the probability current vanishes at infinity. Recalling that\nħ\n∂Ψ∗\nJ =\nΨ∗∂Ψ\nΨ\n,\n(3.10)\n2im\n\n∂x -\n∂x\n\nwe see that the current indeed vanishes because we restrict ourselves to wavefunctions for which\nlim\n∂\nx→±infΨ = 0 and lim\nΨ\nx→±inf\nremains bounded. We therefore have\n∂x\ndN = 0 ,\n(3.11)\ndt\nas we wanted to show.\nTo illustrate how probability conservation works more generally in one dimension, focus\non a segment x ∈[a, b]. Then the probability Pab to find the particle in the segment [a, b], is\ngiven by\nPab =\nZ b\nρ(x, t) dx .\n(3.12)\na\nIf we now take the time derivative of this and, as before, use current conservation we get\ndPab =\ndt\n-\nZ b ∂J(x, t)dt =\nJ(b, t) + J(a, t) .\n(3.13)\na\n∂x\n-\nThis is the expected result. If the amount of probability in the region [a, b] changes in time, it\nmust be due to probability current flowing in or out at the edges of the interval. Assuming the\ncurrents at x = b and at x = a are positive, we note that probability is flowing out at x = b\nand is coming in at x = a. The signs in the above right-hand side correctly reflect the effect of\nthese flows on the rate of change of the total probability inside the segment.\n\nProbability current in 3D and current conservation\nThe determination of the probability current J for a particle moving in three dimensions follows\nthe route taken before, but we use the 3D version of the Schro dinger equation. After some work\n(homework) the probability density and the current are determined to be\nħ\nρ(x, t) = |Ψ(x, t)|2 ,\nJ(x, t) =\nIm (Ψ∗∇Ψ) ,\n(4.1)\nm\nand satisfy the conservation equation\n∂ρ + ∇· J = 0 .\n(4.2)\n∂t\nIn three spatial dimensions, [Ψ] = L-3\n2 and the units of J are quickly determined\n∗\nħ\nL2\n[Ψ ∇Ψ] =\n4 ,\n=\n(4.3)\nL\nm\nT\n=⇒[J] =\n2 = probability per unit time per unit area\n(4.4)\nTL\nThe conservation equation (4.2) is particularly clear in integral language. Consider a fixed\nregion V of space and the probability QV (t) to find the particle inside the region:\nQV (t) =\nZ\nρ(x, t)d3x .\n(4.5)\nV\nThe time derivative of the probability is then calculated using the conservation equation\ndQV\n=\nZ\n∂ρ d3x = -\nZ\n∇· J d3x .\n(4.6)\ndt\nV ∂t\nV\nFinally, using Gauss' law we find\ndQV\n= -\nZ\nJ · da ,\n(4.7)\ndt\nS\nwhere S is the boundary of the volume V . The interpretation here is clear. The probability\nthat the particle is inside V may change in time if there is flux of the probability current across\nthe boundary of the region. When the volume extends throughout space, the boundary is at\ninfinity, and the conditions on the wavefunction (which we have not discussed in the 3D case)\nimply that the flux across the boundary at infinity vanishes.\nOur probability density, probability current, and current conservation are in perfect analogy\nto electromagnetic charge density, current density, and current conservation. In electromag-\nnetism charges flow, in quantum mechanics probability flows. The terms of the correspondence\nare summarized by the table.\n\nElectromagnetism\nQuantum Mechanics\nρ\ncharge density\nprobability density\nQV\ncharge in a volume V\nprobability to find particle in V\nJ\ncurrent density\nprobability current density\nSarah Geller transcribed Zwiebach's handwritten notes to create the first LaTeX version of this\ndocument.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n8.04 Quantum Physics I\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture Note 7",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-04-quantum-physics-i-spring-2016/6ca5bd79a2121967796f7c0b8f6f48c9_MIT8_04S16_LecNotes7.pdf",
      "content": "Lecture 7\nB. Zwiebach\nFebruary 28, 2016\nContents\nWavepackets and Uncertainty\nWavepacket Shape Changes\nTime evolution of a free wave packet\nWavepackets and Uncertainty\nA wavepacket is a superposition of plane waves eikx with various wavelengths.\nLet us work with\nwavepackets at t = 0. Such a wavepacket is of the form\nΨ(x, 0) = p\nZ\nΦ(k)eikxdk.\n(1.1)\n2π\n-1\nIf we know Ψ(x, 0) then Φ(k) is calculable. In fact, by the Fourier inversion theorem, the function\nΦ(k) is the Fourier transform of Ψ(x, 0), so we can write\nΦ(k) = p\nZ\nΨ(x, 0)e-ikxdx.\n(1.2)\n2π\n-1\nNote the symmetry in the two equations above. Our goal here is to understand how the uncertainties\nin Ψ(x, 0) and Φ(k) are related. In the quantum mechanical interpretation of the above equations one\nrecalls that a plane wave with momentum ħk is of the form eikx. Thus the Fourier representation of\nthe wave Ψ(x, 0) gives the way to represent the wave as a superposition of plane waves of different\nmomenta.\ninf\n√\nZ\n-inf\ninf\n√\nZ\n-inf\nFigure 1: A Φ(k) that is centered about k = k0 and has width ∆k.\nLet us consider a positive-definite Φ(k) that is real, symmetric about a maximum at k = k0, and has\na width or uncertainty ∆k, as shown in Fig. 1. The resulting wavefunction Ψ(x, 0) is centered around\nx = 0. This follows directly from the stationary phase argument applied to (1.1). The wavefunction\nwill have some width ∆x, as shown in Fig. 2. Note that we are plotting there the absolute value\nj|Ψ(x, 0)j| of the wave packet. Since Ψ(x, 0) is complex, the other option would have been to plot the\nreal and imaginary parts of Ψ(x, 0).\n\nFigure 2: The Ψ(x, 0) corresponding to Φ(k) shown in Fig. 1, centered around x = 0 with width ∆x.\nIndeed, in our case Ψ(x, 0) is not real! We can show that\nΨ(x, 0) is real if and only if Φ∗(-k) = Φ(k) .\n(1.3)\nBegin by complex conjugating the expression (1.1) for Ψ(x, 0):\nΨ∗(x, 0) = p\nZ\nΦ∗(k)e-ikxdk = p\nΦ∗( k)eikxdk .\n(1.4)\n2π\n-1\n2π\nZ\n-\n-1\nIn the second step we let k ! -k in the integral, which is allowable because we are integrating over\nall k, and the two sign flips, one from the measure dk and one from switching the limits of integration,\ncancel each other out. If Φ∗(-k) = Φ(k) then\nΨ∗(x, 0) = p\nZ\nΦ(k)eikxdk = Ψ(x, 0),\n(1.5)\n2π\n-1\nas we wanted to check. If, on the other hand we know that Ψ(x, 0) is real then the equality of Ψ∗and\nΨ gives\np\nΦ∗(-k)eikx\ndk = p\nΦ(k)eikxdk .\n(1.6)\n2π\n-1\n2π\n-1\nThis is equivalent to\nZ\nZ\np\nΦ∗( k)\nΦ(k) eikxdk = 0 .\n(1.7)\n2π\n-\n-\n-1\nThis equation actually means that\nZ\nthe\n\n|\nobject o\n\n{z\nver the\n}\nbrace must vanish. Indeed, the integral is\ncomputing the Fourier transform of the object with the brace, and it tells us that it is zero. But a\nfunction with zero Fourier transform must be zero itself (by the Fourier theorem). Therefore reality\nimplies Φ∗(-k) = Φ(k), as we wanted to show.\nThe condition Φ∗(-k) = Φ(k) implies that whenever Φ is non-zero for some k it must also be non-\nzero for -k. This is not true for our chosen Φ(k): there a bump around k0 but is no corresponding\nbump around -k0. Therefore Ψ(x, 0) is not real and Ψ(x, 0) will have both a real and an imaginary\npart, both centered on x = 0, as shown in Fig. 3.\nLet's now get to the issue of width. Consider the integral for Ψ(x, 0)\nΨ(x, 0) = p\nZ 1\nΦ(k)eikxdk ,\n(1.8)\n2π\n-1\nand change variable of integration by letting k = k0 + ek, where the new variable of integration k\nparameterizes distance to the peak in the momen\nZ\ntum distribution. We then have\ne\nΨ(x, 0) = p\neik0x\nΦ\n\nk\ni\n0 +\n2π\n-1\nek\n\ne\nekx dek.\n(1.9)\n∗\n√\nZ inf\n-inf\n∗\n√\nZ inf\n-inf\n∗\n→\n∗\n∗\n√\nZ inf\n-inf\n∗\n√\nZ inf\n-inf\n∗\n√\nZ inf\n-inf\n√\nZ inf\n-inf\n∗\n|\n{z\n}\n∗\n∗\n√\nZ inf\n-inf\ne\ne\n√\nZ inf\n-inf\n\ne\n\ne\n∗\n\nFigure 3: The real and imaginary parts of Ψ(x, 0).\nAs we integrate over ek, the most relevant region is\nk 2 -∆k, ∆k\n,\n(1.10)\nbecause this is where Φ(k) is large. As we sw\ne\neep\n\nthis reg\n\nion, the phase kx in the exponential varies in\nthe interval\nkx 2 -∆kx ,\n∆kx\n(for x > 0) ,\n(1.11)\ne\nand the total phase excursion is\ne\n∆k x.\n\nWe will get\n\na substantial contribution to the integral for a\nsmall total phase excursion; if the excursion is large, the integral will get washed out. Thus, we get a\nsignificant contribution for ∆kjxj ≲1, and have cancelling contributions for ∆kjxj ≫1.\nFrom this, we conclude that Ψ(x, 0) will be nonzero for x 2 (-x0, x0) where x0 is a constant for\nwhich ∆kx0 ≈1. We identify the width of Ψ(x, 0) with ∆x := 2x0 and therefore we have ∆k 1∆x\n≈1.\nSince factors of two are clearly unreliable in this argument, we simply record\n∆x ∆k ≈1 .\n(1.12)\nThis is what we wanted to show. The product of the uncertainty in the momentum distribution and\nthe uncertainty in the position is a constant of order one. This uncertainty product is not quantum\nmechanical; as you have seen, it follows from properties of Fourier transforms.\nThe quantum mechanical input appears when we identify ħk as the momentum p. This identifica-\ntion allows us to relate momentum and k uncertainties:\n∆p = ħ∆k .\n(1.13)\nAs a result, we can multiply equation (1.12) by ħto find:\n∆x ∆p ≈ħ.\n(1.14)\nThis is the rough version of the Heisenberg uncertainty product. The precise version requires definining\n∆x and ∆p precisely. One can then show that\nħ\nHeisenberg uncertainty product:\n∆x ∆p ≥\n.\n(1.15)\ne\ne\n\ne\ne\n∈\n\n| |\n| | ≫\n∈\n≈\n≈\n≈\n≈\n≥\n∈\n\nThe product of uncertainties has a lower bound.\nExample: Consider the case where Φ(k) is a finite step of width ∆k and height 1/\np\n∆k, as shown in\nFig. 4. Find Ψ(x, t) and estimate the value of ∆x.\nFigure 4: A momentum distribution.\nNote that the Ψ(x, 0) we aim to calculate should be real because Φ∗(-k) = Φ(k). From the integral\nrepresentation,\nZ\n∆k\nΨ(x, 0) = p\n2π\n∆k\np\neikxdk\n-\n∆k\n∆k\neikx\n= p\n2π∆k\nix\n\n-∆k\n(1.16)\ni ∆kx\n\ne\n\n=\n\n-\n∆\ne-i\nkx\np\n2π∆k\nix\n∆kx\nsin\n= p\n∆\nsin ∆kx =\nr\nk\n.\nx\n2π∆k\n2π\n∆kx\nWe display Ψ(x, 0) in Fig. 5. We estimate\nFigure 5: The Ψ(x, 0) corresponding to Φ(k).\n2π\n∆x ≈\n!\n∆x∆k ≈2π .\n(1.17)\n∆k\nWavepacket Shape Changes\nIn order to appreciate general features of the motion of a wave-packet we looked at the general solution\nof the Schr odinger equation\nΨ(x, t) = p\nZ\nΦ(k)ei(kx-ω(k)t)dk ,\n(2.18)\n2π\n-1\n√\n∗\n√\nZ\n√\n√\n\n√\n√\nr\n≈\n→\n≈\n√\nZ inf\n-inf\n\nand under the assumption that Φ(k) peaks around some value k = k0 we expanded the frequency ω(k)\nin a Taylor expansion around k = k0. Keeping terms up to and including (k -k0)2 we have\ndω\nd2ω\nω(k) = ω(k0) + (k -k0)\n+\n(k\n-k0)2\ndk k\ndk2\n\n.\n(2.19)\nk0\nThe second term played a role in the determination\n\nof the group velocit\n\ny and the next term, with\nsecond derivatives of ω is responsible for the shape distorsion that occurs as time goes by.\nThe\nderivatives are promptly evaluated,\ndω\ndE\np\nħk\nd2ω\nħ\n=\n=\n=\n,\n=\n.\n(2.20)\ndk\ndp\nm\nm\ndk2\nm\nSince all higher derivatives vanish, the expansion in (2.19) is actually exact as written. What kind of\nphase contribution are we neglecting when we ignore the last term in (2.19)? We have\ne-iω(k)t = e··· -i 1(k-k0)2 ħt\nm .\n(2.21)\nAssume we start with the packet at t = 0 and evolve in time to t > 0. This phase will be ignorable as\nlong as its magnitude is significantly less than one:\nħ\n(k -k0)2\nt\nm\n≪1.\n(2.22)\nWe can estimate (k -k0)2 ≈(∆k)2 since the relevant k values must be within the width of the\nmomentum distribution. Moreover since ∆p = ħ∆k we get\n(∆p)2t\nmħ\n≪1.\n(2.23)\nThus, the condition for minimal shape change is\nmħ\nt ≪\n.\n(2.24)\n(∆p)2\nWe can express the inequality in terms of position uncertainty using ∆x∆p ≈ħ. We then get\nm\nt ≪\n(∆x)2 .\n(2.25)\nħ\nAlso from (2.24) we can write\n∆p t\nħ\nm\n≪\n,\n(2.26)\n∆p\nwhich gives\n∆p t\nm\n≪∆x .\n(2.27)\nThis inequality has a clear interpretation. First note that ∆p/m represents the uncertainty in the\nvelocity of the packet.\nThere will be shape change when this velocity uncertainty through time\nproduces position uncertainties comparable to the width ∆x of the wave packet.\n-\n-\n\n-\n\n-\n··· -\n-\n-\n≪\n-\n≈\n≪\n≪\n≈\n≪\n≪\n≪\n\nk\n\nIn all of the above inequalities we use ≪and this gives the condition for negligible shape change.\nIf we replace ≪by ≈we are giving an estimate for some measurable change in shape.\nExercise: Assume we have localized an electron down to ∆x = 10-10m. Estimate the maximum time\nt that it may remain localized to that level.\nUsing (2.25) we have\nm(∆x)2\nmc2(∆x)2\n0.5 MeV\nt ≈\n=\n=\n· 10-20m2\n10-16s.\n(2.28)\nħ\nħc · c\n200 MeVfm · 3 × 108m/s ≈\nIf we originally had ∆x = 10-2m, we would have gotten t ≈1s!\nTime evolution of a free wave packet\nSuppose you know the wavefunction Ψ(x, 0) at time equal zero. Your goal is finding Ψ(x, t). This is\naccomplished in a few simple steps.\n1. Use Ψ(x, 0) to compute Φ(k):\nΦ(k) = p\nZ\ndx Ψ(x, 0)e-ikx .\n(3.1)\n2π\n-1\n2. Use Φ(k) to rewrite Ψ(x, 0) as a superposition of plane waves:\nΨ(x, 0) = p\n2π\nZ 1\nΦ(k)eikxdk .\n(3.2)\n-1\nThis is useful because we know how plane waves evolve in time. The above is called the Fourier\nrepresentation of Ψ(x, 0).\n3. A plane wave ψ (x, 0) = eikx evolves in time into ψ (x, t) = ei(kx\nk\nk\n-ω(k)t) with ħ\nħ2\nω =\nk2 . Using\n2m\nsuperposition we have that (3.2) evolves into\nΨ(x, t) = p\nZ\nΦ(k)ei(kx-ω(k)t)dk.\n(3.3)\n2π\n-1\nThis is in fact the answer for Ψ(x, t). One can easily confirm this is the solution because: (i) it\nsolves the Schr odinger equation (check that!) and (ii) setting t = 0 in Ψ(x, t) gives us the initial\nwavefunction (3.2) that represented the initial condition.\n4. If possible, do the integral over k to find a closed form expression for Ψ(x, t). If too hard, the\nintegral can always be done numerically.\nExample: Evolution of a free Gaussian wave packet. Take\nψa(x, 0) =\n.\n/ p\ne-x /4a\n(3.4)\n(2π)1 4\na\nThis is a gaussian wave packet at t = 0. The constan\nR\nt a has units of length and ∆x ≈a. The state\nψa is properly normalized, as you can check that\ndxjψa(x, 0)j2 = 1.\n≪\n≪\n≈\n-\n≈\n·\n·\n-\n·\n×\n≈\n-\n-\n≈\n√\nZ inf\n-inf\n-\n√\nZ inf\n-inf\n-\n√\nZ inf\n-inf\n-\n√\n-\n≈\nR\n|\n|\n\nWe will not do the calculations here, but we can imagine that this packet will change shape as\ntime evolves. What is the time scale τ for shape changes? Equation (2.25) gives us a clue. The right\nhand side represents a time scale for change of shape. So we must have\nm\nτ ≈\na2 .\n(3.5)\nħ\nThis is in fact right. You will discover when evolving the Gaussian that the relevant time interval is\nactually just twice the above time:\n2ma2\nτ ≡\n.\n(3.6)\nħ\nIf we consider the norm-squared of the wavefunction\njΨ∗\na(x, 0)j2\n= p\ne-x2/2a2 ,\n(3.7)\n2π a\nyou will find that after time evolution one has\njΨ∗(x, t)j2\n= p\n-x2/2a2\ne\n(t)\na\n,\n(3.8)\n2π a(t)\nwhere a(t) is a time-dependent width. The goal of your calculation will be to determine a(t) and to\nsee how τ enters in a(t).\nAndrew Turner transcribed Zwiebach's handwritten notes to create the first LaTeX version of this\ndocument.\n≈\n≡\n|\n∗\n|\n√\n-\n|\n∗\n|\n√\n-\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n8.04 Quantum Physics I\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture Note 8",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-04-quantum-physics-i-spring-2016/72de1b688f3f40e1c42b26b3da29585a_MIT8_04S16_LecNotes8.pdf",
      "content": "Lecture 8\nB. Zwiebach\nFebruary 29, 2016\nContents\nUncovering momentum space\nExpectation Values of Operators\nTime dependence of expectation values\nUncovering momentum space\nWe now begin a series of developments that lead to the idea of momentum space as a counterpoint\nor dual of position space. In this section the time dependence of wavefunctions will play no role.\nTherefore we will simply suppress time dependence. You can imagine all wavefunctions evaluated at\ntime equal zero or at some arbitrary time t0.\nWe begin by recalling the key identities of Fourier's theorem:\nΨ(x) = √\n2π\nZ inf\nΦ(k) ikx\ne\ndk ,\n-inf\ninf\nΦ(k) = √\nΨ(x)e-ikxdx .\nπ\nZ\n-inf\n(1.1)\nThe Fourier transform Φ(k) has all the information carried by the wavefunction Ψ(x). This is clear\nbecause knowing Φ(k) means knowing Ψ(x). The function Φ(k) also acts as the weight with which we\nadd the plane waves with momentum ħk to form Ψ(x).\nWe will now see that the consistency of the above equations can be used to derive an integral\nrepresentation for a delta function. Such a representation is a needed tool for our upcoming discussion.\nThe idea is to replace Φ(k) in the first equation by the value given in the second equation. In order\nto keep the notation clear, we must use x′ as a dummy variable of integration in the second equation.\nWe have\nΨ(x) = √\nZ inf\nikx\ndk e\n√\nZ inf\nx′ e-ikx′\nd\nΨ(x′)\n2π\n-inf\n2π\n-inf\n=\nZ inf\ninf\ndx′ Ψ(\nik(x\nx′)\nx′)\ndk e\n-\n-inf\n2π\nZ\n.\n-inf\n|\n{z\n(1.2)\nLook at the type of integral. The factor indicated by the brace hap\n}\npens to reduce the x′ integral to\nan evaluation at x. We know that δ(x′ -x) is the function such that for general f(x),\nZ inf\ndx′ f(x′) δ(x′\nx) = f(x),\n-inf\n-\n(1.3)\nand so we conclude that the factor indicated by the brace is a delta function\nZ inf\n′\n′\nδ(x -x) =\nik(x\ndk e\n-x ) .\n2π\n-inf\n(1.4)\n\nIn this integral one can let k →-k and since\ndk is left-invariant under this replacement, we find\nthat δ(x′ -x) = δ(x -x′), or more plainly δ(x)\nR\n= δ(-x). We will record the integral representation\nof the delta function using the other sign:\nδ(x -x′) =\ninf\n2π\nZ\nik(x\ndk e\n-x′) .\n-inf\n(1.5)\nAnother useful property of delta functions is\nδ(ax) =\nδ(x) .\n(1.6)\n|a|\nAt this point we ask: How does the normalization condition for Ψ(x) look in terms of Φ(k)? We\nmust simply calculate. We have\nZ inf\ninf\ninf\nΨ∗( )Ψ( ) =\n√\n-ikx\ninf\nΦ∗( )\nik′x\ndx\nx\nx\ndx\nk e\ndk\n-inf\nπ\n-inf\n√\nΦ(k′)e\ndk′ .\n-inf\n2π\n-inf\nZ\nZ\nZ\n(1.7)\nRearranging the integrals to do the x integral first we write\nZ inf\ninf\ninf\ninf\ni(k′\nk)x\ndx Ψ∗(x)Ψ(x) =\nZ\ndk\nZ\ndk′ Φ∗(k)Φ(k′)\ndx e\n-\n-inf\n-inf\n-inf\n2π\nZ\n-inf\n=\nZ inf\ndk dk′ Φ∗(k)Φ(k′)δ(k′\nk)\nZ-inf\n-\ninf\n=\ndk Φ∗(k)Φ(k) ,\n-inf\n(1.8)\nwhere we recognized the presence of a delta function and we did the integral over k′. Our final result\nis therefore\nZ inf\ndx\n-inf\n|Ψ(x)|2 =\nZ inf\ndk\n-inf\n|Φ(k)|2 .\n(1.9)\nThis is known as Parseval's theorem, or more generally, Plancherel's theorem. This equation relates\nthe Ψ(x) normalization to a rather analogous normalization for Φ(k). This is a hint that just like for\n|Ψ(x)|2, we may have a probability interpretation for |Φ(k)|2.\nSince physically we associate our plane waves with eigenstates of momentum, let us rewrite Par-\nseval's theorem using momentum p = ħk. Instead of integrals over k we will have integrals over p.\nLetting Φe(p) = Φ(k) equations (1.1) become\ninf\nΨ(x) = √\nΦ\n2πħ\n-inf\ne(p) ipx/\ne\nħdp ,\ninf\nΦ( ) = √\nx\np\nZ\nΨ(\ni\nx)e-p /ħdx .\nπ\n-inf\nZ\ne\n(1.10)\nFor a more symmetric pair of equations we can redefine the function Φe(p). We will let Φe(p) →Φ(p)\n√\nħ\nin equations (1.10). We then obtain our final form for Fourier's relations in terms of momentum:\nΨ(x) = √\ninf\n2πħ\nZ\nΦ(p)\nipx/\ne\nħdp ,\n-inf\nΦ(p) = √\ninf\n2πħ\nZ\nΨ(x)e-ipx/ħdx .\n-inf\n(1.11)\n\nSimilarly, Parseval's theorem (1.9) becomes\nZ inf\ndx\n-inf\n|Ψ(x)|2 =\nZ inf\ndp\n-inf\n|Φ(p)|2 .\n(1.12)\nExercise. Verify that the redefinitions we did to arrive at (1.11) indeed yield (1.12) when starting\nfrom (1.9).\nOur interpretation of the top equation in (1.11) is that Φ(p) denotes the weight with which we add\nthe momentum state eipx/ħin the superposition that represents Ψ(x). This momentum state eipx/ħ\nis an eigenstate of the momentum operator pˆ with eigenvalue p. Just like we say that Ψ(x) is the\nwavefunction in position space x, we can think of Φ(p) as the wavefunction in momentum space p.\nThe Parseval identity (1.12) suggests that Φ(p) has a probabilistic interpretation as well. Given that\na properly normalized Ψ(x) leads to a Φ(p) that satisfies\nR\ndp|Φ(p)|2 = 1, we postulate that:\n|Φ(p)|2dp is the probability to find the particle with momentum in the range (p, p + dp) .\n(1.13)\nThis makes the analogy between position and momentum space quite complete.\nLet's consider the generalization to 3D. Fourier's theorem in momentum space language (namely, using\np as opposed to k) takes the form\nΨ(x) = (2πħ)3/2\nZ inf\nd p Φ(p) ie p·x/ħ,\n-inf\ninf\nΦ(p) = (2πħ)3/2\nZ\nd x Ψ(x)e-ip·x/ħ.\n-inf\n(1.14)\nJust like we did in the 1D case, if we insert the Fourier transform into the expression for Ψ(x), we\nfind an integral representation for the 3D δ-function\nΨ(x) =\ni\nd\nħ\np e p·x/\nd x′ Ψ(\ni\nx′)e-p·x′/ħ\n(2πħ)3\n=\nZ\n′ Ψ(\n′\n)\nZ\nip·(\n′\nd x\nx\nd p e\nx-x )/ħ\n(2πħ)3\n=\nZ\nd x′\nΨ(x′)\n′\n(\nZ\ni\nd k e k·(x-x ),\n2π)3\nZ\nZ\n(1.15)\nwhich leads to the identification\nδ (x -x′\n) =\n′\n(\nZ\ni\nd k e k·(x-x ).\n(1.16)\n2π)3\nIt is then straightforward to derive Parseval's identity (exercise!). We find\nZ inf\nd x\n=\n-\n|Ψ(x)|\nZ\nd p\ninf\n|Φ(p)| .\n(1.17)\nWe use in 3D momentum space the same probability interpretation: |Φ(p)|2d3p is the probability to\nfind the particle with momentum in the range d3p around p.\n\nExpectation Values of Operators\nConsider a random variable Q that takes values in the set {Q1, . . . , Qn} with respective probabilities\n{p1, . . . , pn}. The expectation value ⟨Q⟩(or expected value) of Q is the average value that we expect\nto find after repeated observation of Q, and is given by the formula\nn\n⟨Q⟩=\nX\nQipi.\n(2.18)\ni=1\nAs we have seen, in a quantum system the probability for a particle to be found in [x, x + dx] at\ntime t is given by\nΨ∗(x, t)Ψ(x, t) dx.\n(2.19)\nThus, the expected value of x, denoted as ⟨xˆ⟩is given by\n⟨xˆ⟩≡\nZ inf\nx Ψ∗(x, t)Ψ(x, t)dx.\n(2.20)\n-inf\nNote that this expected value depends on t. What does ⟨xˆ⟩correspond to physically? If we consider\nmany copies of the physical system, and measure the position x at a time t in all of them, then the\naverage value recorded will converge to ⟨xˆ⟩as the number of measurements approaches infinity.\nLet's discuss now the expectation value for the momentum. Since we have stated that\nΦ∗(p, t)Φ(p, t) dp\n(2.21)\nis the probability to find the particle with momentum in the range [p, p + dp] at time t, we define the\nexpectation ⟨pˆ⟩of the momentum operator as\ninf\n⟨pˆ⟩≡\nZ\np Φ∗(p, t)Φ(p, t)dp .\n(2.22)\n-inf\nWe will now manipulate this expression to see what form it takes in coordinate space. Using (1.11)\nand its complex conjugate version we have\ninf\n⟨pˆ⟩=\nZ\np Φ∗(p, t)Φ(p, t) dp\n-inf\n=\nZ inf\nZ inf\ndx\ninf\ndx′\n√\nipx/\nipx′/\ndp p\ne\nħΨ∗(x, t)\nZ\n√\ne-\nħΨ(x′, t)\n-inf\n-inf\n2πħ\n-inf\n2πħ\n=\nZ inf\nΨ∗(\n)\nZ inf\n′ Ψ( ′\n)\nZ inf\nipx/ħ\nipx′/\ndx\nx, t\ndx\nx , t\ndp p e\ne-\nħ\n2πħ\n-inf\n-inf\n-inf\n=\nZ inf\nΨ∗(\n)\nZ inf\n′ Ψ( ′\n)\nZ inf\nħ∂\nipx/ħ-ipx′/\ndx\nx, t\ndx\nx , t\ndp\ne\ne\nħ\n2πħ\n-inf\n-inf\n-inf\ni ∂x\nZ inf\ninf\nħ∂\ninf\n=\n(\ni\ndx Ψ∗(x, t)\nZ\ndx′ Ψ x′\nipx/\npx′/\n, t)\nZ\ne\n-inf\ninf\n\ndp e\nħ-\n-\ni ∂x\n\nħ.\n2πħ\n-inf\n(2.23)\nLetting p = ħu in the final integral we have\nZ inf\ninf\nipx/ħ\n′\n-ipx /ħ\n=\nZ\niu(x\nx′\n-\n)\ndp e\ne\ndu e\n= δ(x\n2πħ\n-inf\n2π\n-inf\n-x′) .\n(2.24)\n\nAs a result, we have\n⟨pˆ⟩=\nZ inf\ninf\nħ\ndx Ψ∗(x, t)\n-inf\nZ\ndx′ Ψ(x′, t)\n-inf\n\ni\n∂\n∂x\n\nδ(x -x′)\n=\nZ inf\n-inf\ndx Ψ∗(x, t)\nħ\ni\n∂\ninf\n(2.25)\ndx′ Ψ(x′, t)δ(x′\nx) ,\n∂x\nZ\n-inf\n-\nwhere we changed the order of integration. The x′ integral is now easily done and we find\ninf\nħ\n⟨pˆ⟩=\nZ\ndx Ψ∗(x, t)\n-inf\n\ni\n∂\nΨ\n∂x\n\n(x, t) ,\n(2.26)\nWe have thus shown that\ninf\n⟨pˆ⟩=\nZ\nħ\ndx Ψ∗\n∂\n(x, t) pˆΨ(x, t) ,\npˆ =\n.\n-inf\ni ∂x\n(2.27)\nNotice the position of the pˆ operator: it acts on Ψ(x). This motivates the following definition for the\nˆ\nˆ\nexpectation value ⟨Q⟩of any operator Q:\ninf\n⟨Qˆ⟩=\nZ\ndx Ψ∗(x, t ˆ\n) QΨ(x, t) .\n-inf\n(2.28)\nExample:\nˆ\nConsider the kinetic energy operator T for a particle moving in 1D:\npˆ2\nTˆ = 2m = -ħ2\n2m\n∂2\n.\n(2.29)\n∂x2\nThe definition gives\nħ\n⟨Tˆ⟩= -2m\nZ\ndx Ψ∗(x, t) ∂2\nΨ(x, t) .\n(2.30)\n∂x2\nThe kinetic energy is a positive operator (being proportional to the square of the momentum operator).\nIt is therefore of interest to make this positivity manifest. Integrating by parts one of the x derivatives\nand ignoring boundary terms that are presumed to vanish, we find\nħ\n⟨Tˆ⟩= 2m\nZ\ndx\n\n∂Ψ(x, t)\n.\n∂\n\nx\nˆ\n.\n( 31)\nThis is manifestly positive! The expectation value of T can a\n\nlso be computed in momentum space\nusing the probabilistic interpretation that led to (2.22):\nTˆ⟩=\nZ\np\n⟨\ndp\n.\n|Φ(p, t)\n(\nm\n|2 .\n2 32)\nOther examples of operators whose expectation values we can now compute are the momentum\noperator pˆ →ħ∇in 3D, the potential energy operator, V (xˆ), and the angular momentum operator\ni\nLˆ = ˆr × pˆ = ( yˆpˆz -zˆpˆy , zˆpˆx -xˆpˆz , xˆpˆy -yˆpˆ\n\nx)\nħ\n∂\n∂\n∂\n∂\n∂\n∂\n(2.33)\n=\ny\nz\n, z\ni\n-\nx -x\n, x\ny\n.\n∂z\n∂y\n∂\n∂z\n∂y -\n∂x\n\nTime dependence of expectation values\nThe expectation values of operators are in general time dependent because the wavefunctions repre-\nsenting the states are time dependent. We will consider here operators that do not have explicit time\ndependence, that is, operators that do no :\nd\nd\niħ\n⟨Q⟩= iħ\nZ inf\nd x\nt ˆ\nΨ∗(x, )QΨ(x, t)\ndt\ndt\n-inf\n= iħ\nZ inf\nd x\n-inf\n∂Ψ∗\nQˆΨ + Ψ∗\n∂Ψ\nQˆ\nZ\n∂t\n∂t\n\ninf\ni\niħ\nd x\nˆ\nˆ\n=\n(HΨ)∗\ni\nQˆΨ -\nΨ∗Qˆ(HΨ)\nħ\n-inf\n\nZ\nħ\ninf\nd x\n\n∗QˆHˆ\nˆ\n=\nΨ\nΨ\n-inf\n-(H\nQˆ\nΨ∗) Ψ\n\n(3.34)\nˆ\nWe now recall the hermiticity of H, which implies that\nZ inf\nZ inf\ndx\nˆ\n(HΨ1)∗Ψ2 =\ndx\n∗ˆ\nΨ1HΨ2.\n(3.35)\n-inf\n-inf\nˆ\nThis can be applied to the second term in the last right-hand side of (3.34) to move H into the other\nwavefunction\nd\niħ\ninf\n⟨Q⟩\nZ\nd x\n\n∗QˆHˆ\nHˆ\n=\nΨ\nΨ\ndt\n-inf\n-Ψ∗\nQˆΨ\n\nZ inf\nh\ni\n(3.36)\nx Ψ∗\nˆ Hˆ\n=\nd\nQ,\nΨ ,\n-inf\nˆ\nwhere we noted the appearance of the commutator. All in all, we have proven that for operators Q\nthat do not explicitly depend on time,\nd\niħdt⟨Qˆ⟩=\nD\nQˆ, Hˆ E\n.\n(3.37)\nNote that the commutator satisfies the following properties (homework):\n[A, B] = -[B, A]\n(3.38)\n[A, A] = 0\n(3.39)\n[A, B + C] = [A, B] + [A, C]\n(3.40)\n[A, BC] = [A, B] C + B [A, C]\n(3.41)\n[AB, C] = A [B, C] + [A, C] B\n(3.42)\n0 = [A, [B, C]] + [B, [C, A]] + [C, [A, B]] .\n(3.43)\nAndrew Turner transcribed Zwiebach's handwritten notes to create the first LaTeX version of this\ndocument.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n8.04 Quantum Physics I\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture Note 9",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-04-quantum-physics-i-spring-2016/be7c26e13550f3b3cc7f3f7a87f00d44_MIT8_04S16_LecNotes9.pdf",
      "content": "Lecture 9\nB. Zwiebach\nMarch 3, 2016\nContents\nObservables and Hermitian operators\nUncertainty\nObservables and Hermitian operators\nˆ\nLet's begin by recalling the definition of a Hermitian operator. The operator Q is Hermitian if for the\nclass of wavefunctions Ψ we work with,\nZ\ndx Ψ∗Qˆ\nΨ2 =\nZ\ndx\nˆ\n(QΨ\n∗\n1) Ψ2 .\n(1.1)\nWe will sometimes use a briefer notation for the integrals of pairs of functions:\n(Ψ1 , Ψ2) ≡\nZ\ndx Ψ∗\n1(x)Ψ2(x) .\n(1.2)\nNote that for any constant a\naΨ1, Ψ2) = a∗Ψ1, Ψ2) ,\nΨ1, aΨ2) = a\nΨ1, Ψ2) .\n(1.3)\nWith this notation the condition of Hermiticity is more briefly stated\nQˆ is Hermitian:\nΨ1, QΨ2) =\nQΨ1, Ψ2) .\n(1.4)\nˆ\nThe expectation value of Q was defined by\n⟨Q⟩Ψ =\nZ\ndx Ψ∗QˆΨ =\nΨ , QˆΨ\n\n.\n(1.5)\nFor this formula to make sense, the state Ψ must be normalized.\nClaim 1. The expectation value of a Hermitian operator is real.\nTo prove this we complex conjugate\nthe above definition. The complex conjugate of the integral is the integral of the complex conjugate\nof the integrand, therefore\n⟨Q⟩\n∗\nˆ\nˆ\nˆ\nΨ\n=\nZ\ndx\nΨ∗QΨ\n∗=\nZ\ndx Ψ(QΨ)∗=\nZ\ndx (QΨ)∗Ψ .\n(1.6)\nQˆ\nNote that\nΨ is a wavefunction, so it makes sense to take its complex conjugate (we never have to\nˆ\nthink of conjugating Q). Using the Hermiticity of the operator, we move it into Ψ to get\n⟨Q⟩\n∗\n∗\nΨ\n=\nZ\ndx\nˆ\nΨ QΨ = ⟨Q⟩Ψ ,\n(1.7)\n\nthus showing that the expectation value is indeed real.\nClaim 2. The eigenvalues of a Hermitian operator are real.\nQˆ\nAssume the operator\nhas an eigenvalue\nq1 associated with a normalized eigenfunction ψ1(x):\nQˆψ1(x) = q1ψ1(x) .\n(1.8)\nˆ\nNow compute the expectation value of Q in the state ψ1:\n⟨Qˆ⟩ψ1 = (ψ1 , Qˆψ1) = (ψ1 , q1 ψ1) = q1(ψ1 , ψ1) = q1 .\n(1.9)\nBy claim 1, the expectation value is real, and so is the eigenvalue q1, as we wanted to show. Note the\nQˆ\ninteresting fact that the expectation value of\non an eigenstate is precisely given by the corresponding\neigenvalue.\nˆ\nConsider now the collection of eigenfunctions and eigenvalues of the Hermitian operator Q:\nQˆ ψ1(x) = q1ψ1(x) ,\n(1.10)\nQˆ ψ2(x) = q2ψ2(x) ,\n(1.11)\n...\nThe list may be finite or infinite.\nClaim 3. The eigenfunctions can be organized to satisfy orthonormality:\n(ψi, ψj) =\nZ\ndx ψ∗\ni (x)ψj(x) = δij .\n(1.12)\nFor i = j, this is just a matter of normalizing properly each eigenfunction, which we can easily do.\nThe equation also states that different eigenfunctions are orthogonal, or have zero overlap. We now\nˆ\nexplain why this is so for i = j with qi = qj. Indeed, for this we evaluate (ψi, Qψj) in two different\nways. First\n(ψi, Qˆψj) = (ψi, qjψj) = qj(ψi, ψj) ,\n(1.13)\nˆ\nand second, using Hermiticity of Q, and the reality of the eigenvalues\n(ψi, Qˆψ\nˆ\nj) = (Qψi, ψj) = (qiψi, ψj) = qi(ψi, ψj) .\n(1.14)\nEquating the final right-hand sides in the two evaluations we get\n(qj -qi) (ψi , ψj) = 0.\n(1.15)\nSince the eigenvalues were assumed different, this proves that (ψi, ψj) = 0, as claimed. This is not yet\na full proof of (1.12) because it is possible to have degeneracies in the spectrum, namely, different\neigenfunctions with the same eigenvalue. In that case the above argument does not work. One must\nthen show that it is possible to choose linear combinations of the degenerate eigenfunctions that\nare mutually orthogonal (the orthogonality with the eigenfunctions beyond the degenerate space is\nautomatic). This is done in 8.05!\n\nClaim 4. The eigenfunctions of Qˆ for a complete set of basis functions. Any reasonable Ψ can be\nwritten as a superposition of Qˆ eigenfunctions. (This is the so-called spectral theorem, which is proven\nin 8.05 in the finite-dimensional case.) This means that\nΨ(x) = α1ψ1(x) + α2ψ2(x) + · · · =\nX\nαiψi(x) ,\ni\n(1.16)\nwith calculable coefficients αi. Indeed, if we know the eigenfunctions we have that αi is calculated\ndoing the integral of ψ∗\ni against Ψ:\nαi = (ψi, Ψ) .\n(1.17)\nWe quickly prove this by doing the integral\nZ\ndx ψ∗\ni (x)Ψ(x) =\nZ\ndx ψ∗\ni (x)\nX\nαjψj(x) =\nX\nαj\nZ\ndx ψ∗\ni (x)ψj(x) =\nX\nαjδij = αi . (1.18)\nj\nj\nj\nThe condition that Ψ is normalized implies a condition on the coefficients αi. We have\nZ\ndx Ψ∗(x)Ψ(x) =\nZ\ndx\nX\nα∗\ni ψ∗\ni (x)\nX\nαjψj(x)\ni\nj\n=\nX\nα∗\nx ψ∗\ni αj\nZ\nd\ni (x)ψj(x)\n(1.19)\ni,j\n=\nX\nα∗\ni αjδij =\ni,j\nX\nα∗\ni αi ,\ni\nso that the normalization of Ψ implies that\nX\ni\n|αi|2 = 1 .\n(1.20)\nWe are finally in the position to state the measurement postulate. This is the way in which we\nunderstand that Hermitian operators represent observables and learn the rules that they follow.\nMeasurement Postulate: If we measure the Hermitian operator Qˆ in the state Ψ, the possible\noutcomes for the measurement are the eigenvalues q1, q2, . . .. The probability pi to measure qi is given by\np\n=\ni\n|αi| ,\n(1.21)\nwhere Ψ(x) = P αiψi(x). After the outcome qi, the state of the system becomes\ni\nΨ(x) = ψi(x) .\n(1.22)\nThis is called the collapse of the wavefunction.\nThe collapse of the wavefunction implies that immediately after the measurement that yielded qi\nˆ\na repeated measurement of Q will yield qi with no uncertainty. A small subtlety occurs if we have\ndegenerate eigenstates. Suppose the wavefunction contains a piece\nΨ = (αiψi + αkψk) + . . .\n(1.23)\n\nwhere ψi and ψk happen to have the same eigenvalue q and the dots represent other terms. Then if\nwe measure q the state after the measurement collapses to the sum of those two terms\nαiψi + αkψk\nΨ = p\n,\n(1.24)\n|αi|2 + |αj|2\nwith the square root denominator included to provide the proper normalization to Ψ. As a consistency\ncheck note that the probabilities pi to find the various eigenvalues as outcomes properly add to one:\nX\npi =\ni\nX\ni\n|αi|\n= 1 ,\n(1.25)\nby the normalization condition for Ψ given in (1.20). The measurement postulate follows the Copen-\nhagen interpretation of quantum mechanics.\nNote that the measurement postulate uses the property that any vector in a vector space can be\nˆ\nwritten as a sum of different vectors in an infinite number of ways. If we are to measure Q1 we expand\nthe state in Qˆ\nˆ\nˆ\n1 eigenstates, if we are to measure Q2 we we expand the state in Q2 eigenstates, and so\non and so forth. Each decomposition is suitable for a particular measurement. Each decomposition\nreveals the various probabilities for the outcomes of the specific observable.\nExercise: Use the expansion Ψ = P α ψ\nQ\ni\ni\ni to compute the expectation value ⟨⟩. We find\n⟨Qˆ⟩=\nZ\ndx\nX\nα∗\ni ψ∗\ni (x ˆ\n) Q\ni\nX\nαjψj(x)\nj\n=\nX\nα∗\ni αj\nZ\ndx ψ∗\ni (x ˆ\n)Qψj(x)\ni,j\n(1.26)\n=\nX\nα∗\ni αjqj\nZ\ndx ψ∗\ni (x)ψj(x)\ni,j\n=\nX\n∗\nαi αjqjδij =\nX\ni\n|αi\ni\n| qi =\n,j\nX\npiqi.\ni\nˆ\nThis matches our expectations: the expectation value of Q is the sum of the possible outcomes qi\nmultiplied by the corresponding probabilities pi. This is a nice consistency check on our definition of\nexpectation values.\nExample. Free particle on the circle x ∈[0, L].\nWe imagine the points x = 0 and x = L identified to form a circle of circumference L. A wavefunction\nΨ(x) on the circle must satisfy the periodicity condition\nΨ(x + L) = Ψ(x) ,\n(1.27)\nAssume that at some fixed time we have the wavefunction\nΨ(x) =\nr\nL\n√\nsin 2πx\nL\n+\nr\n3 cos 6πx\n.\nL\n\n(1.28)\nThis wavefunction satisfies the periodicity condition, as you should check. We want to know what are\nthe possible values of the momentum and their corresponding probabilities.\n\nGiven our discussion, we must find the set of momentum eigenstates and rewrite the wavefunction\nas a superposition of such states.\nMomentum eigenstates are exponentials of the form eikx. Two\nthings happen on the circle that do not happen in free space. First the momentum will be quantized\nas a consequence of the periodicity condition (1.27). Second, since space here is of finite length, the\nmomentum wavefunctions will be normalizable. Consider the periodicity condition as applied to eikx.\nWe need\neikx = eik(x+L)\n→\neikL = 1\n→\nkL = 2πm ,\nm ∈Z .\n(1.29)\nNote that m can be any integer, positive, negative, or zero. We thus write for the momentum eigen-\nstates, labeled by m\n2πimx\nψm(x) = N e\nL\n,\n(1.30)\nwith N a real normalization constant. The normalization condition gives\nL\n1 =\nZ\nL\n|\n( )|2\nψm x\ndx =\nN\nZ\ndx = N L\n→\nN = √\n.\nL\n(1.31)\nTherefore our momentum eigenstates are\nψm(x) = √\n2πimx\ne\nL\n,\nL\n(1.32)\nand these are states with momentum pm, which is calculated as follows\nħ∂\n2π mħ\n2π mħ\npˆψm =\nψm =\nψm\ni ∂x\nL\n→\npm =\n.\nL\n(1.33)\nNow that we are equipped with the momentum eigenstates we must simply rewrite the wavefunction\n(1.28) as a superposition of such states:\nr\n2 1\ni -\n2πix\n2 1 1\n√\n\n2π x\n6πix\n6πix\nΨ(x) =\ne\n-\nL\ne-\nL\nL\nL\n\n+ √\n√\nL\n\ne\n+ e\nL\n3 2i\n3 2\n\n.\n(1.34)\nWe then recognize that we have\n2 1\n2 1\nΨ(x) =\nr\nψ1(x) -\nr\nψ-1(x) + √ψ3(x) +\n3 2i\n3 2i\n√ψ\n-3(x) .\n(1.35)\nThis is our key result: the original wavefunction written as a superposition of momentum eigenstates\nψm(x). We can now give the possible values p of the momentum and their corresponding probabili-\nties P:\n2πħ\np =\n,\nP =\nL\nr\n2 1\n,\n3 2i\n= 6\n2πħ\n\np\n\n= -\n,\nP =\nL\n-\nr\n2 1\n=\n,\n\n3 2i\n\n(1.36)\n6πħ\nr\n1 2\n\np\n\n=\n\n=\n,\nP\n=\n,\nL\n6πħ\nr\n\n,\nP =\nL\n\np = -\n\n=\n.\n\nUncertainty\nFor random variables, the uncertainty is the standard deviation--the square root of the expected value\nof the square of deviations from the average value. Let Q be a random variable that takes on values\nQ1, . . . , Qn with probabilities p1, . . . , pn, respectively. The expected value is\nQ =\nX\npiQi ,\n(2.37)\ni\nand the variance (the square of the standard deviation) is\n(∆Q)2 ≡\nX\npi(Qi\ni\n-\nQ) .\n(2.38)\nThis definition makes it clear that if ∆Q = 0, then the random variable is constant: each term in the\n\nabove sum must vanish, making Qi = Q, for all i. We find another useful expression by expanding\nthe above definition\n(∆Q)2 =\nX\npiQi\ni\n-2\nX\npiQi\ni\nQ +\nX\ni\npiQ\n= Q2 -2Q Q + Q\n2 = Q2 -\n(2.39)\nQ ,\nwhere we used P p\ni\ni = 1. Therefore\n(∆Q)2 = Q2 -\nQ .\n(2.40)\nSince, by definition (∆Q)2 ≥0, we have the interesting inequality\nQ2 ≥\nQ .\n(2.41)\nNow let us consider the quantum mechanical case. We have already defined expectation values of\nˆ\nHermitian operators, so we can now mimic the definition (2.40) and declare that the uncertainty ∆QΨ\nof an operator in a state Ψ is a real number whose square is given by\n(∆Q)2\nΨ = ⟨\nQ ⟩Ψ -(⟨Q⟩Ψ)2.\n(2.42)\nSometimes for brevity, we omit the label for the state,\n(∆Q)2 = ⟨\nQ ⟩-⟨Q⟩2 .\n(2.43)\nClaim 1. The uncertainty can also be written as the expectation value of the square of the difference\nbetween the operator and its expectation value:\n(∆Q)2 =\nDQˆ -⟨Qˆ⟩\n2E\n.\n(2.44)\nIndeed, expanding the right hand side we have\n\nQˆ2 -\nˆ\n2 Q⟨Qˆ⟩+ ⟨Qˆ⟩2\n= ⟨Qˆ2⟩-2⟨Qˆ⟩⟨Qˆ⟩+ ⟨Qˆ⟩2 = ⟨Qˆ2⟩-⟨Qˆ⟩2 .\n(2.45)\n\nClaim 2\nˆ\nˆ\n. The uncertainty can be written as the integral of the square of the norm of (Q -⟨Q⟩)Ψ:\nZ inf\n\n(∆Q)2 =\ndx\nQˆ -⟨Q⟩\n\nΨ(x)\n-inf\n.\n(2.46)\n\nIndeed to prove this we begin with (2.44) By a very similar proof, we can show this is equivalent to\n(∆Q)2 =\nD2\nQˆ -⟨Q⟩\nE\n=\nZ\ndx Ψ∗\nQˆ -⟨Q⟩\n\nΨ .\n(2.47)\nQˆ\n⟨Qˆ\nUsing the Hermiticity of\nand the reality of\n⟩we can bring one of the two factors to act on Ψ∗:\n∗\nQˆ\n∆\nZ\n(\nQ)2 =\ndx\nh\n-⟨Q⟩\n\nΨ\ni\n(Q -⟨Q⟩)Ψ =\nZ\ndx\n\nQˆ -⟨Q⟩\n\nΨ\n.\n(2.48)\nThis completes the proof of claim 2.\n\nIf ∆Q = 0, then by claim 2, we must have that for all x:\n(Q -⟨Q⟩)Ψ(x) = 0 ,\n→\nQˆΨ(x\nˆ\n) = ⟨Q⟩Ψ(x) .\n(2.49)\nWe see that Ψ is an eigenstate of Qˆ, which indeed means there is no uncertainty in the measurement.\nˆ\nˆ\nˆ\nOf course if Ψ is an eigenstate of Q then again QΨ = ⟨Q⟩Ψ and the uncertainty vanishes. All in all,\nwe have established the equivalence\nQˆ\n∆\nΨ = 0\n⇐⇒\nˆ\nΨ is an eigenstate of Q .\n(2.50)\nAndrew Turner transcribed Zwiebach's handwritten notes to create the first LaTeX version of this\ndocument.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n8.04 Quantum Physics I\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture Note 10",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-04-quantum-physics-i-spring-2016/01b09433137651bedbbfe4f039b0c5be_MIT8_04S16_LecNotes10.pdf",
      "content": "Lecture 10: Solving the Time-Independent Schr odinger Equation\nB. Zwiebach\nMarch 14, 2016\nContents\nStationary States\nSolving for Energy Eigenstates\nFree particle on a circle.\nStationary States\nConsider the Schr odinger equation for the wavefunction Ψ(x, t) with the assumption that the potential\nenergy V is time independent:\n∂Ψ\nħ2 ∂2\niħ\nˆ\n= HΨ(x, t) =\n∂t\n\n-\n+ V (x)\nΨ(x, t) ,\n(1.1)\n2m ∂x2\n\nˆ\nwhere we displayed the form of the Hamiltonian operator H with the time independent potential\nV (x). Stationary states are a very useful class of solutions of this differential equation. The signature\nproperty of a stationary state is that the position and the time dependence of the wavefunction\nfactorize. Namely,\nΨ(x , t) = g(t) ψ(x) ,\n(1.2)\nfor some functions g and ψ. For such a separable solution to exist we need the potential to be time\nindependent, as we will see below. The solution Ψ(x, t) is time-dependent but it is called stationary\nbecause of a property of observables.\nThe expectation value of observables with no explicit time\ndependence in arbitrary states has time dependence. On a stationary state they do not have time\ndependence, as we will demonstrate.\nLet us use the ansatz (1.2) for Ψ in the Schr odinger equation. We then find\n\ndg(t)\nˆ\niħ\n\nψ(x) = g(t) Hψ(x) ,\n(1.3)\ndt\nˆ\nbecause g(t) can be moved across H. We can then divide this equation by Ψ(x, t) = g(t)ψ(x), giving\n1 dg(t)\niħ\nˆ\n=\nHψ(x) .\n(1.4)\ng(t)\ndt\nψ(x)\nThe left side is a function of only t, while the right side is a function of only x (a time dependent\npotential would have spoiled this). The only way the two sides can equal each other for all values of t\nˆ\nand x is for both sides to be equal to a constant E with units of energy because H has units of energy.\nWe therefore get two separate equations. The first reads\ndg\niħ\n= Eg .\n(1.5)\ndt\n-\n\nThis is solved by\ng(t) = e-iEt/ħ,\n(1.6)\nand the most general solution is simply a constant times the above right-hand side. From the x-\ndependent side of the equality we get\nˆHψ(x) = Eψ(x) .\n(1.7)\nˆ\nThis equation is an eigenvalue equation for the Hermitian operator H. We showed that the eigenvalues\nof Hermitian operators must be real, thus the constant E must be real. The equation above is called\nthe time-independent Schr odinger equation. More explicitly it reads\n\nħ2 d2\n-\n+ V (x)\n\nψ(x) = Eψ(x) ,\n(1.8)\n2m dx2\nNote that this equation does not determine the overall normalization of ψ. Therefore we can write\nthe full solution without loss of generality using the g(t) given above:\nħ\nˆ\nStationary state:\nΨ(x, t) = e-iEt/ ψ(x) ,\nwith\nE 2 R and Hψ = Eψ .\n(1.9)\nˆ\nNote that not only is ψ(x) an eigenstate of the Hamiltonian operator H, the full stationary state is\nˆ\nalso an H eigenstate\nˆHΨ(x, t) = EΨ(x, t) ,\n(1.10)\nsince the time dependent function in Ψ cancels out.\nWe have noted that the energy E must be real. If it was not we would also have trouble normalizing\nthe stationary state consisten\nZ\ntly. The normalization condition for Ψ, if E is not real, would give\nħ\n1 =\ndx Ψ∗\n∗\nħ\n(x, t)Ψ(x, t) =\nZ\ndx eiE t/ e-iEt/ ψ∗(x)ψ(x)\n(1.11)\n= ei(E∗-E)t/ħ\nZ\ndx ψ∗\nħ\n(x)ψ(x) = e2 Im(E)t/\ndx ψ∗(x)ψ(x).\nThe final expression has a time dependence due to the exponential.\nZ\nOn the other hand the normal-\nization condition states that this expression must be equal to one. It follows that the exponent must\nbe zero, i.e., E is real. Given this, we also see that the normalization condition yields\nZ 1\ndx ψ∗(x)ψ(x) = 1 .\n(1.12)\n-1\nˆ\nHow do we interpret the eigenvalue E? Using (1.10) we see that the expectation value of H on the\nstate Ψ is indeed the energy\nh ˆ i\nZ\n∗\nˆ\nH Ψ =\ndx Ψ (x, t)HΨ(x, t) =\nZ\ndxΨ∗(x, t)EΨ(x, t) = E\nZ\ndxΨ∗(x, t)Ψ(x, t) = E,\n(1.13)\nˆ\nˆ\nSince the stationary state is an eigenstate of H, the uncertainty ∆H of the Hamiltonian in a stationary\nstate is zero.\nThere are two important observations on stationary states:\n-\n-\n-\n∈\n∗\n-\n∗\n-\n∗\n∗\ninf\n-inf\n∗\n⟨\n⟩\n∗\n∗\n∗\n\nˆ\n(1) The expectation value of any time-independent operator Q on a stationary state Ψ is time-\nindependent:\nhQi\nˆ\n=\nZ\ndx Ψ∗(x, t)QΨ(x, t) =\nZ\ndx eiEt/ħ\nΨ(x,t)\nψ∗\nˆ\n(x)Qe-iEt/ħψ(x)\nZ\n(1.14)\niEt/ħ-iEt/ħ\n∗\nˆ\nZ\n∗\nˆ\n=\ndx e\ne\nψ (x)Qψ(x) =\ndx ψ (x)Qψ(x) = hQiψ(x) ,\nsince the last expectation value is manifestly time independent.\n(2) The superposition of stationary states with different energies not stationary. This is clear because\na stationary state requires a factorized solution of the Schr odinger equation: if we add two\nfactorized solutions with different energies they will have different time dependence and the\nˆ\ntotal state cannot be factorized. We now show that that a time-independent observable Q may\nhave a time-dependent expectation values in such a state. Consider a superposition\nħ\nħ\nΨ(x, t) = c e-iE1t/ ψ1(x) + c2e-iE2t/\nψ2(x),\n(1.15)\nˆ\nwhere ψ1 and ψ2 are H eigenstates with energies E1 and E2, respectively. Consider a Hermitian\nˆ\noperator Q. With the system in state (1.15), its expectation value is\nhQiΨ =\nZ 1\ndx Ψ∗\nˆ\n(x, t)QΨ(x, t)\nZ-1\n∗iE1t/ħ\n∗\n∗iE2t/ħ\n∗\n-iE1t/ħˆ\nħˆ\n=\ndx c1e\nψ1(x) + c2e\nψ2(x)\nc1e\nQψ1(x) + c\niE\n2e-\n2t/ Qψ2(x)\nZ-1\n\nj\nj2\n∗ˆ\nj\nj2\n∗ˆ\n∗\nħ\nˆ\nħ\nˆ\n=\ndx\nc1 ψ1Qψ1 + c2 ψ2Qψ2 + c1c2ei(E1-E2)t/ ψ∗Qψ + c∗c e-i(E1\n\n-E2)t/\n2 1\nψ2\n∗Qψ1\n-1\n(1.16)\n\nWe now see the possible time dependence arising from the cross terms. The first two terms are\nˆ\nsimple time-independent expectation values. Using the hermitically of Q in the last term we\nthen get\nhQiΨ = jc1j2hQi\nψ1 + jc2j hQiψ2\n(1.17)\n+ c∗\n1c2ei(E1\n-E2)t/ħ\nZ\nˆ\ndx ψ1\n∗Qψ2 + c1c∗\n2e-i(E1-E2)t/ħ\n-1\nZ\nˆ\ndx ψ1(Qψ2)∗\n-1\nThe last two terms are complex conjugates of each other and therefore\nhQiΨ = jc1j2hQiψ1 + jc2j2hQiψ2 + 2 Re\n\nc∗\nħ\nˆ\n1c ei(E1-E2)t/\nZ\ndx ψ1\n∗Qψ2\n\n.\n(1.18)\n-1\nWe see that this expectation value is time-dependent if E1 = E2 and (ψ1, Qψ2) is nonzero. The\nfull expectation value hQiΨ is real, as it must be for any Hermitian operator.\nSolving for Energy Eigenstates\nWe will now study solutions to the time-independent Schr odinger equation\nˆHψ(x) = E ψ(x).\n(2.19)\n⟨⟩\n∗\n∗\n-\n-\n∗\n∗\n⟨⟩\n-\n-\n⟨⟩\nZ inf\n-inf\n∗\ninf\n-inf\n∗\n∗\n∗\n∗\n-\n-\ninf\n-inf\n|\n|\n∗\n|\n|\n∗\n∗\n-\n∗\n∗\n-\n-\n∗\n⟨⟩\n|\n| ⟨⟩\n|\n| ⟨⟩\n∗\n-\ninf\n-inf\n∗\n∗-\n-\ninf\n-inf\n∗\n⟨⟩\n|\n| ⟨⟩\n|\n| ⟨⟩\n∗\n-\ninf\n-inf\n∗\n=\n⟨⟩\n\nˆ\nFor a given Hamiltonian H we are interested in finding the eigenstates ψ and the eigenvalues E,\nwhich happen to be the corresponding energies. Perhaps the most interesting feature of the above\nequation is that generally the value of E cannot be arbitrary. Just like finite size matrices have a set\nof eigenvalues, the above, time-independent Schr odinger equation may have a discrete set of possible\nenergies. A continuous set of possible energies is also allowed and sometimes important. There are\nindeed many solutions for any given potential. Assuming for convenience that the eigenstates and\ntheir energies can be counted we write\nψ1(x) ,\nE1\nψ2(x) ,\nE2\n(2.20)\n.\n.\n.\n.\n.\n.\nOur earlier discussion of Hermitian operators applies here. The energy eigenstates can be organized\nto form a complete set of orthonormal functions:\nZ\nψi\n∗(x)ψj(x) = δij .\n(2.21)\nConsider the time-independent Schr odinger equation written as\nd2ψ\n2m\n= -\n(E\nV\ndx2\nħ2\n-\n(x)) ψ .\n(2.22)\nThe solutions ψ(x) depend on the properties of the potential V (x). It is hard to make general state-\nments about the wavefunction unless we restrict the types of potentials. We will certainly consider\ncontinuous potentials. We also consider potentials that are not continuous but are piece-wise contin-\nuous, that is, they have a number of discontinuities. Our potentials can easily fail to be bounded.\nWe allow delta functions in one-dimensional potentials but do not consider powers or derivatives of\ndelta functions. We allow for potentials that become plus infinity beyond certain points. These points\nrepresent hard walls.\nWe want to understand general properties of ψ and the behavior of ψ at points where the potential\nV (x) may have discontinuities or other singularities.\nWe claim: we must have a continuous\nwavefunction. If ψ is discontinuous then ψ0 contains delta-functions and ψ00 in the above left-hand\nside contains derivatives of delta functions. This would require the right-hand side to have derivatives\nof delta functions, and those would have to appear in the potential. Since we have declared that our\npotentials contain no derivatives of delta functions we must indeed have a continuous ψ.\nConsider now four possibilities concerning the potential:\n(1) V (x) is continuous. In this case the continuity of ψ(x) and (2.22) imply ψ00 is also continuous.\nThis requires ψ0 continuous.\n(2) V (x) has finite discontinuities. In this case ψ00 has finite discontinuities: it includes the product of\na continuous ψ against a discontinuous V . But then ψ0 must be continuous, with non-continuous\nderivative.\n(3) V (x) contains delta functions. In this case ψ00 also contains delta functions: it is proportional\nto the product of a continuous ψ and a delta function in V . Thus ψ0 has finite discontinuities.\n∗\n-\n-\n′\n′′\n′′\n′\n′′\n′\n′′\n′\n\n(4) V (x) contains a hard wall. A potential that is finite immediately to the left of x = a and becomes\ninfinite for x > a is said to have a hard wall at x = a. In such a case, the wavefunction will\nvanish for x ≥a. The slope ψ0 will be finite as x ! a from the left, and will vanish for x > a.\nThus ψ0 is discontinuous at the wall.\nIn the first two cases ψ0 is continuous, and in the second two it can have a finite discontinuity. In\nconclusion\nBoth ψ and ψ0 are continuous unless the potential has delta functions\n(2.23)\nor hard walls in which cases ψ0 may have finite discontinuities.\nLet us give an slightly different argument for the continuity of ψ and dψ in the case of a potential\ndx\nwith a finite discontinuity, such as the step shown in Fig. 1.\nFigure 1: A potential V (x) with a finite discontinuity at x = a.\nIntegrate both sides of (2.22) a -ε to a + ε, and then take ε ! 0. We find\nZ a+ε\nd\n\ndψ\n2m Z a+ε\ndx\n= -\ndx (E -V (x))ψ(x) .\n(2.24)\na\nε\ndx\ndx\nħ2\n-\na-ε\nThe left-hand side integrand is a total derivative so we have\ndψ\n\ndψ\ndx a+ε\n-dx\nZ\nBy definition, the discontinu\n\nity in the\n\n2m\na+ε\n\n=\ndx (V (x) -E)ψ(x) .\n(2.25)\nħ2\na-ε\na-ε\nderivative of ψ at x = a is the limit as ε ! 0 of the left-hand\nside:\ndψ\ndψ\ndψ\n∆a\ndx\n≡lim\nε!0\n\n.\n(2.26)\ndx a+ε\n-dx\n\na-ε\nBack in (2.25) we then have\n\ndψ\n2m Z a+ε\n∆a\n= lim\ndx (V (x)\ndx\nε!0\nħ2\na\n-E)ψ(x) .\n(2.27)\n-ε\nThe potential V is discontinuous but not infinite around x = a, nor is ψ infinite around x = a and,\nof course, E is assumed finite. As the integral range becomes vanishingly small about x = a the\nintegrand remains finite and the integral goes to zero. We thus have\n∆a\ndψ\ndx\n\n= 0 .\n(2.28)\n≥\n′\n→\n′\n′\n′\n′\n→\n→\n→\n→\n≡\n\ndψ\nThere is no discontinuity in\n. This gives us one of our boundary conditions.\ndx\nTo learn about the continuity of ψ we reconsider the first integral of the differential equation. The\nintegration that led to (2.25) now applied to the range from x0 < a to x yields\ndψ(x)\ndψ\n2m Z\n\nx\n=\n(E\ndx\ndx x0\n-ħ\nx0\n-V (x0))dx0.\n(2.29)\nNote that the integral on the right is a bounded\n\nfunction of x. We now integrate again from a -ε to\na + ε. Since the first term on the right-hand side is a constant we find\ndψ\n2m\na+ε\nx\nψ(a + ε) -ψ(a -ε) = 2ε\n-\ndx\n\nħ\nZ\ndx\ndx\nx\na-ε\nZ\n(E\nV (x0)).\n(2.30)\nx0\n-\nTaking the ε ! 0R limit, the first term on the righ\n\nt-hand side clearly vanishes and the second term goes\nx\nto zero because\ndx0 (E -V (x0)) is a bounded function of x. As a result we have\nx0\n∆aψ = 0 ,\n(2.31)\nshowing that the wavefunction is continuous at x = a. This is our second boundary condition.\nFree particle on a circle.\nConsider now the problem of a particle confined to a circle of circumference L. The coordinate along\nthe circle is called x and we can view the circle as the interval x 2 [0, L] with the endpoints identified.\nIt is perhaps clearer mathematically to think of the circle as the full real line x with the identification\nx ∼x + L ,\n(3.1)\nwhich means that two points whose coordinates are related in this way are to be considered the same\npoint. If follows that we have the periodicity condition\nψ(x + L) = ψ(x) .\n(3.2)\nFrom this it follows that not only ψ is periodic but all of its derivatives are also periodic.\nThe particle is assumed to be free and therefore V (x) = 0. The time-independent Schr odinger\nequation is then\nħ2 d2ψ\n-\n= E ψ(x) .\n(3.3)\n2m dx2\nBefore we solve this, let us show that any solution must have E ≥0. For this multiply the above\nequation by ψ∗(x) and integrate over the circle x 2 [0 , L). Since ψ is normalized we get\nħ2\n2ψ\n-\nZ L\nd\nψ∗(x)\ndx = E\n2m\ndx2\nZ\nψ∗(x)ψ(x)dx = E .\n(3.4)\nThe integrand on the left hand side can be rewritten as\nħ2\n-2m\nZ L\nh d\ndψ\ndψ∗dψ\nψ∗\ndx = E .\n(3.5)\ndx\n\ndx\n\n-dx dx\ni\n-\n-\n′\n′\n-\n-\n-\n-\n-\n′\n-\n′\n→\n′\n-\n′\n∈\n∼\n-\n≥\n∗\n∈\n-\n∗\n∗\n-\n∗\n-\n∗\n\nand the total derivative can be integrated\nħ2\n-2m\nh\ndψ\nψ∗\ndx\n\ndψ\n-\n∗\n(3.6)\nx=L\n\nψ dx\n\nħ2\nL dψ 2\n+\ndx = E .\nx=0\ni\n2m\nZ\n\ndx\n\nSince ψ(x) and its derivatives are p\n\neriodic, the con\n\ntributions from\n\nx =\n\nL and x = 0 cancel out and we\nare left with\nħ2\nL dψ 2\nE =\ndx\n0 ,\n(3.7)\n2m\nZ\n\ndx\n\n≥\nwhich establishes our claim. We also see that E = 0 requires ψ constant (and nonzero!).\nHaving shown that all solutions must have E ≥0 let us go back to the Schr odinger equation, which\ncan be rewritten as\nd2ψ\n2mE\n=\ndx2\n-\nψ .\n(3.8)\nħ2\nWe can then define k via\nk2\n2mE\n≡\nħ\n≥0 .\n(3.9)\nSince E ≥0, the constant k is real. Note that this definition is very natural, since it makes\nħ2k2\nE =\n,\n(3.10)\n2m\nwhich means that, as usual, p = ħk. Using k2 the differential equation becomes the familiar\nd2ψ =\n(3.11)\n-k2ψ .\ndx\nWe could write the general solution in terms of sines and cosines of kx, but let's use complex expo-\nnentials:\nψ(x) ∼eikx.\n(3.12)\nThis solves the differential equation and, moreover, it is a momentum eigenstate. The periodicity\ncondition (3.2) requires\neik(x+L) = eikx\n!\neikL = 1\n!\nkL = 2πn ,\nn 2 Z .\n(3.13)\nWe see that momentum is quantized because the wavenumber is quantized! The wavenumber has\ndiscrete possible values\n2πn\nkn ≡\n,\nn\nL\n2 Z.\n(3.14)\nAll integers positive and negative are allowed and are in fact necessary because they all correspond to\ndifferent values of the momentum pn = ħkn. The solutions to the Schr odinger equation can then be\nindexed by the integer n:\nψn(x) = Neiknx ,\n(3.15)\nwhere N is a real normalization constant. Its value is determined from\nZ L\nL\n1 =\nψn\n∗(x)ψn(x)dx =\nN2dx = N2L\nZ\n!\nN = p\n,\n(3.16)\nL\n-\n∗\n-\n∗\n≥\n≥\n-\n≡\n≥\n≥\n-\n∼\n→\n→\n∈\n≡\n∈\n∗\n→\n√\n\nso we have\nψn(x) = p eiknx\n=\nL\np\n2πinx\ne\nL\n.\n(3.17)\nL\nThe associated energies are\nħ2k2\nEn =\nn\nħ24π2n2\n2π2ħ2n2\n=\n=\n.\n(3.18)\n2m\n2mL2\nmL2\nThere are infinitely many energy eigenstates. We have degenerate states because En is just a\nfunction of jnj and thus the same for n and -n. Indeed ψn and ψ-n both have energy En. The only\nnondegenerate eigenstate is ψ0 = p1 , which is a constant wavefunction with zero energy.\nL\nWhenever we find degenerate energy eigenstates we must wonder what makes those states differ-\nent, given that they have the same energy. To answer this one must find an observable that takes\ndifferent values on the states. Happily, in our case we know the answer. Our degenerate states can be\nħ\nħ\ndistinguished by their momentum: ψn has momentum 2πn\nand ψ\nL\n-n has momentum (-2πn ).\nL\nGiven two degenerate energy eigenstates, any linear combination of these states is an eigenstate\nwith the same energy. Indeed if\nˆ\nˆ\nHψ1 = Eψ1 ,\nHψ2 = Eψ2 ,\n(3.19)\nthen\nˆ\nˆ\nˆ\nH(aψ1 + bψ2) = aHψ1 + bHψ2 = aEψ1 + bEψ2 = E(aψ1 + bψ2) .\n(3.20)\nWe can therefore form two linear combinations of the degenerate eigenstates ψn and ψ-n to obtain\nanother description of the energy eigenstates:\nψn + ψ\nn ∼cos(k x\n-\nn ) ,\n(3.21)\nψn -ψ-n ∼sin(knx) .\nWhile these are real energy eigenstates, they are not momentum eigenstates. Only our exponentials\nˆ\nare simultaneous eigenstates of both H and pˆ.\nThe energy eigenstates ψn are automatically orthonormal since they are pˆ eigenstates with no\ndegeneracies (and as you recall eigenstates of a hermitian operator with different eigenvalues are\nautomatically orthogonal) :\nL\nL\nn\nψn\n∗\n2πi(m-)x\n(x)ψm(x)dx =\ne\nL\ndx = δmn.\n(3.22)\nL\nThey are also complete: w\nZ\ne can then construct a\nZ\ngeneral wavefunction as a superposition that is in\nfact a Fourier series. For any Ψ(x, 0) that satisfies\nX\nthe periodicity condition, we can write\nΨ(x, 0) =\nan ψn(x),\n(3.23)\nn2Z\nwhere, as you should check, the coefficients an are determined by the integrals\nan =\nZ L\ndx ψn\n∗(x) Ψ(x, 0) .\n(3.24)\nThe initial state Ψ(x, 0) is then easily evolved in time:\nX\n-iEnt\nΨ(x, t) =\nan ψn(x)e\nħ.\n(3.25)\nn2Z\nAndrew Turner transcribed Zwiebach's handwritten notes to create the first LaTeX version of this\ndocument.\n√\n√\n| |\n-\n-\n√\n-\n-\n-∼\n-\n-∼\n∗\n∈\n∗\n∈\n-\n-\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n8.04 Quantum Physics I\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    }
  ]
}