{
  "course_name": "Race and Identity in American Literature: Keepin' it Real Fake",
  "course_description": "This course explores the ways in which various American artists view race and class as performed or performable identities. Discussions will focus on some of the following questions: What does it mean to act black, white, privileged, or underprivileged? What do these artists suggest are the implications of performing (indeed playing at or with) racial identity, ethnicity, gender, and class status? How and why are race and class status often conflated in these performances?",
  "topics": [
    "Humanities",
    "Literature",
    "American Literature",
    "Criticism",
    "Society",
    "African American Studies",
    "Gender Studies",
    "Humanities",
    "Literature",
    "American Literature",
    "Criticism",
    "Society",
    "African American Studies",
    "Gender Studies"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nCourse Description\n\nThis course explores the ways in which various American artists view race and class as performed or performable identities. Discussions will focus on some of the following questions: What does it mean to act black, white, privileged, or underprivileged? What do these artists suggest are the implications of performing (indeed playing at or with) racial identity, ethnicity, gender, and class status? How and why are race and class status often conflated in these performances?\n\nThis course counts toward CI-H (Communication Intensive) credit, which means that 21L.504 fulfills the communication requirement to \"plan, organize, draft, and revise a series of assignments based on course material,\" leading to a total of at least 20 pages of writing. A minimum of 1 hour a week (out of 3) will be dedicated to class discussion. This course also counts toward fulfillment of the Black Studies concentration requirement.\n\nThe Skills You'll Learn\n\nHow to discuss issues of race, class, and gender in the context of American literary and cultural studies\n\nHow to argue a case about a literary text\n\nHow to preserve the memory of your reading experiences\n\nHow to find pleasure and critical thinking skills in the process of reading and analyzing texts\n\nHow to proselytize effectively to your friends about the joys (and pains) of reading Literature\n\nHow You'll Learn Those Skills\n\nParticipation\n\nRegular attendance and active participation in class is required. Participation includes responding to questions or points raised in discussion and generating discussion. You may miss 2 classes without penalty, for any reason. Each miss beyond 2 will count for 2/3 of a letter grade taken off of your final grade (i.e. B to C+). More than 6 misses may mean no credit for the course (missed classes due to college athletics, religious holy days, or serious illness must be cleared with me). Two late arrivals to class will count as one absence, so please do and do try to be on time.\n\nAssigned Readings\n\nAll readings (books) for the class are available at the bookstore. These readings must be completed by the date they appear on the syllabus. Other readings are listed in the\nreadings\nsection.\n\nAssigned Writings\n\nYour assignments for class are recorded on the syllabus and available in the\nassignments\nsection. Unless otherwise directed, assignments must be submitted by 5 pm in my mailbox on the due date. Written assignments include two 5-page papers, a complete revision of any one of the two papers, and a 10-paged research paper due on the last day of class. All papers should follow the MLA format (see\nDocumenting Sources: MLA Style: English and Other Humanities\n). These papers should be typed, double-spaced, paginated, titled (no title page necessary), and in 12-point font (Times New Roman) with 1-inch margins on all sides.\n\nOral Presentations\n\nEach student will choose a line or passage from the text assigned for the day's reading, and the designated student will discuss what he or she thinks is the significance of the passage within the context of the book (or short story) itself. Then the student will also share his or her response/reaction to the passage and devise one question to pose to the class in an effort to generate class discussion. The presentation can run from 5-15 minutes long. I will, however, cut you off at exactly 15 minutes.\n\nGrading\n\nREQUIREMENTS\n\nPERCENTAGES\n\nEssay 1\n\n10%\n\nEssay 2\n\n10%\n\nRevision\n\n20%\n\nEssay 3\n\n30%\n\nParticipation\n\n15%\n\nOral presentation\n\n15%\n\nCalendar\n\nSES #\n\nTOPICS\n\nKEY DATES\n\nIntroductions\n\nIn-class TV clip: \"When Keeping it Real Goes Wrong\"\n\nHerman Melville\n\n3-4\n\nMark Twain\n\nSuzan-Lori Parks\n\n6-7\n\nCharles Chesnutt\n\nInterracial identity\n\nIn-class film:\nCross-Over King\n\nToni Morrison\n\nIn-class film:\nMr. White\n\nEssay 1 due\n\n10-11\n\nJames Weldon Johnson\n\nNella Larsen\n\nBeing Indian\n\n14-15\n\nPhilip Roth\n\n16-17\n\nJohn Howard Griffin\n\nEssay 2 due in Ses #17\n\nGender\n\nIn-class film:\nParis is Burning\n\nLeRoi Jones\n\nWhiteness\n\nLibrary instruction\n\n21-22\n\nToi Derricotte\n\nRevision due in Ses #22\n\n23-24\n\nGeorge Schuyler\n\nIn-class film:\nSix Degrees of Separation\n\nStudent presentations\n\nEssay 3 due",
  "files": []
}