{
  "course_name": "Race and Science",
  "course_description": "This course examines one of the most enduring and influential forms of identity and experience in the Americas and Europe, and in particular the ways race and racism have been created, justified, or contested in scientific practice and discourse. Drawing on classical and contemporary readings from Du Bois to Gould to Gilroy, we ask whether the logic of race might be changing in the world of genomics and informatics, and with that changed logic, how we can respond today to new configurations of race, science, technology, and inequality. Considered are the rise of evolutionary racism; debates about eugenics in the early twentieth century; Nazi notions of “racial hygiene”; nation-building projects and race in Latin America; and the movement in modern biology from race to populations to genes and genomes.",
  "topics": [
    "Social Science",
    "Anthropology",
    "Cultural Anthropology",
    "Ethnography",
    "Sociology",
    "Social Justice",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology",
    "Ethnography",
    "Sociology",
    "Social Justice"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 3 hours / session\n\nOverview\n\nThe category of \"race\" has often been used to naturalize social inequality by assigning people to hierarchically ordered groupings based on assumed biological difference. Scientific discourse has been a key resource in the history of this practice. But it has also been a crucial tool for dismantling race. In the first portion of this course, \"The Alchemy of Race: Making and Unmaking Scientific Racism,\" we will examine these twin tendencies, reading about the rise of evolutionary racism alongside ideas about reproduction and sex; early twentieth century contests over eugenics in the U.K. and U.S.; Nazi notions of \"racial hygiene\"; race in the nation-building projects of Latin America; and trends in biological theory from studying race to evaluating populations to, today, examining genomes. We will also look at links between race and medical practice. The second portion of this class, \"Reformulating Race: Making and Remaking the Idioms of Science,\" looks more keenly at the place of race in formulating the problems, approaches, and epistemologies animating scientific work more generally, even when it is not centrally about race as such. We try to understand how the practice of science - and the fashioning of technologies - can be racially marked in both oppressive and liberatory ways, by both dominant and marginalized groups. We want to know, for example, how \"whiteness\" might get written into science, and whether doing science from historically subordinated racial positions might allow us to see science and technology as well as the history of science and technology, differently. We examine these questions with particular attention to North American political contexts and racial formations. At the end of the course, we consider whether the logic of \"race\" might not be changing in our contemporary world of genomics and informatics, and with this the way we can usefully respond to configurations of race, science, and technology.\n\nRequired Books\n\nHarding, Sandra, ed.\nThe \"Racial\" Economy of Science: Toward a Democratic Future.\nBloomington, IN: Indiana University Press, 1993. ISBN: 9780253326935.\n\nKevles, Daniel J.\nThe Name of Eugenics: Genetics and the Uses of Human Heredity\n. Berkeley, CA: University of California Press, 1986. ISBN: 9780520057630.\n\nAssignments\n\nStudents will write three 7-page papers, choosing from a selection of topics to be provided by the instructor for each paper. Each paper represents 30% of the subject grade. No emailed papers accepted. Students will also be evaluated on class participation, including discussion and in-class writing exercises (10% of subject grade). Punctual attendance is obligatory. There is no final.",
  "files": [
    {
      "category": "Resource",
      "title": "topicspaperone.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-240-race-and-science-spring-2004/6aa9139ee6982a88ff0271ad87b154c6_topicspaperone.pdf",
      "content": "21A.240\nRace and Science\nSpring 2004 MIT\n\nDr. Stefan Helmreich\n\nTopics for PAPER # 1\n\n1. Compare and contrast the place of sex, gender, and reproduction in the ideas of two\neugenic thinkers discussed by Kevles. Integrate a brief discussion of sex and gender\nin Darwin.\n\n2. Discuss similarities and differences between Blumenbach, Boas, and Gould using Omi\nand Winant's notion of \"racial formation.\"\n\n3. Compare and contrast notions of racial hygiene in Brazilian and Nazi/German\neugenics. Be sure to discuss the place of the \"nation\" in each case.\n\n4. Use Bowker and Star's ideas about Aristotelian and prototypical classification to\nexamine how scientific and legal ideas about race interact in debates about\nimmigration and naturalization in the United States as discussed by Jacobson."
    },
    {
      "category": "Resource",
      "title": "topicspaperthree.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-240-race-and-science-spring-2004/cbea236009b2ddbe69658ec898847356_topicspaperthree.pdf",
      "content": "21A.240\nRace and Science\nSpring 2004 MIT\n\nDr. Stefan Helmreich\n\nTopics for PAPER # 3\n\n1. Puzzle through the \"racial economy\" of nuclear weapons work and testing using\nboth\n\na. Churchill and LaDuke's notion of \"radioactive colonialism\" in Native\nAmerica\nand\nb. The analysis of damaging stereotypes of Asian Americans in the nuclear\ncomplex outlined in Wong's \"The Los Alamos Incident\" and Masco's \"Lie\nDetectors: On Secrets and Hypersecurity in Los Alamos.\"\n\n2. Drawing on Takaki's \"The Myth of the Model Minority\" and Englash's \"Race, Sex,\nand Nerds: From Black Geeks to Asian American Hipsters,\" examine the politics\nof racial (and gender) stereotyping in connection with science education in the\nUnited States. If you think it relevant, draw on your own sense of such dynamics\nat MIT.\n\n3. Using Gomez-Pena's \"Ethno-cyborgs and Genetically Engineered Mexicans\" as an\ninspiration, suggest ways that Kumar's \"Temporary Access: The Indian H-1B\nWorker in the United States\" could be transformed into an artistically rendered\npolitical statement about the politics of South Asian immigrant workers in the\nUnited States.\n\n4. Mix and match any of the above, or, using materials from the second part of our\ncourse, \"Reformulating Race: Making and Remaking the Idioms of Science,\"\ndevelop your own topic."
    },
    {
      "category": "Resource",
      "title": "topicspapertwo.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-240-race-and-science-spring-2004/382644d760ba54ce65407a600665e5bc_topicspapertwo.pdf",
      "content": "21A.240\nRace and Science\nSpring 2004 MIT\n\nDr. Stefan Helmreich\n\nTopics for PAPER # 2\n\n1. Read Donna Haraway's \"Universal Donors in a Vampire Culture.\" Use her section\n\"III: Genome,\" to discuss and contextualize the cases discussed in Troy Duster's\nand Michael Montoya's articles.\n\n2. If you did not for the first paper write about Brazilian eugenics, consider this\ntopic: Read Nayan Shah's \"Public Health and the Mapping of Chinatown.\"\nCompare notions of \"health\" and \"race\" in this chapter with both Nancy Stepan's\nanalysis of Brazilian eugenics as well as James Jones' chapter in The \"Racial\"\nEconomy of Science on \"The Tuskegee Syphilis Experiment.\"\n\n3. Use Nancy Stepan and Sander Gilman's \"Appropriating the Idioms of Science:\nThe Rejection of Scientific Racism\" to discuss the following other two articles from\nHarding's \"Racial\" Economy of Science:\n\nHine, Darlene Clark. 1993. Co-Laborers in the Work of the Lord: Nineteenth\nCentury Black Women Physicians. In The \"Racial\" Economy of Science:\nToward a Democratic Future, Sandra Harding, ed. Bloomington: Indiana\nUniversity Press, 210-227. ISBN: 0253326931.\n\nand\n\nKreiger, Nancy and Mary Bassett. 1993. The Health of Black Folk: Disease,\nClass, and Ideology in Science. In The \"Racial\" Economy of Science: Toward a\nDemocratic Future, Sandra Harding, ed. Bloomington: Indiana University\nPress, 1993, 161-169. ISBN: 0253326931.\n\nConclude with reflections on Troy Duster's arguments about new medical uses of\n\"race\" in the age of genomics and briefly discuss how these might be approached\nin ways sensitive to the fraught politics of race.\n\n4. Drawing on the writings of Londa Schiebinger and Terry Kapsalis, historicize\nDonna Haraway's discussion in \"Apes in Eden, Apes in Space: Mothering as a\nScientist for National Geographic\" on the role of \"whiteness\" in fashioning\nscientific portraits of non-human primates like apes."
    },
    {
      "category": "Lecture Notes",
      "title": "lecnotes_02_12.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-240-race-and-science-spring-2004/a092c79c73174bb6e0bbe578f168bf15_lecnotes_02_12.pdf",
      "content": "21A.240\nRace and Science\nSpring 2004 MIT\n\nINTRODUCTION\nLecture 2. February 12\n\nPlan: develop a vocabulary for talking about biology, society, classification.\n\nCrash Course in Category of Race as Biological Phantom and Social Reality\n\nGould, Stephen Jay. 1977. Why We Should Not Name Human Races -- A Biological\nView. In Ever Since Darwin: Reflections in Natural History. New York: Norton, (pp.\n231-236).\n\nRace has long been considered a biological category of human difference.\nPeople thought that humanity was divided into major lineages that had\nradically different evolutionary histories and that \"race\" described these\ndivisions. Most biologists at least since the 1950s, however, do not view race\nas a biological category. It tells us nothing about the evolutionary history of\nthe species. Gould's articles summarize why.\n\nGould writes: \"I contend that the continued racial classification of Homo\nsapiens represents an outmoded approach to the general problem of\ndifferentiation within a species\" (p. 231).\n\nWhy? Well, what is a species? The most common definition of a species is a\ngroup of organisms that is reproductively isolated from other species; that is,\ncan't breed with other species (e.g. dogs and cats). What this means,\naccording to Gould, is that dividing species into subgroups, into subspecies,\ninto races (all these things are equivalent) requires that the person doing this\ndivision must make a decision about what sorts of characters will be of\ninterest. The person who is classifying these characters needs to choose what\nthey will be.\n\nSo, naming subspecies is a largely subjective affair.\n\nAs Gould puts it, \"There is no requirement that a species be divided into\nsubspecies. The subspecies is a category of convenience\" (p. 233).\n\nBut of course, one might argue that there is obvious geographical variation\namong populations of humans. But the question then becomes -- do racial\ncategories help or confuse our understanding of this variation?\n\nTake one example of a character that is often used to classify race: skin color.\n\nCan skin color serve as a useful index of subspecific differentiation?\n\nMaybe, but the problem is that this is only one character among many that\ncould be used to group human populations. When one begins to add other\n\ncharacteristics -- blood types, eye color, for example, the categories get\nfuzzier, not neater.\n\nGould puts it this way: \"variation in single traits is a pale shadow of patterns\nin variation that affect so many features simultaneously. Moreover, the\nclassical problem of 'incongruity' arises. Maps constructed for other single\ntraits almost invariably present different distributions\" (p. 234).\n\nFurther, is a difference in skin color really a difference? Differences in skin\ncolor simply result from the productive activity of melanocytes in the skin --\nnot from their presence or absence, nor from differences in their number, for\nexample. The fact that humans have skin color is a similarity rather than a\ndifference. (albinism, is the result of melanocytes not producing melanin, not\nof the absence of melanin.)\n\nGould, Stephen Jay. 1985. Human Equality Is a Contingent Fact of History. In The\nFlamingo's Smile: Reflections in Natural History. New York: Norton, (pp. 185-198).\n\nNow, in \"Human Equality is a Contingent Fact of History\", Gould adds a few\nmore steps to the argument against race as a biological category.\n\nAnd the title is worthy of comment. What does it mean? It means that it\nCOULD have been the case that humans could have had strong\ndifferentiations -- it could have been possible that Homo erectus and Homo\nsapiens, for example, could both still exist. But that's not the way it turned\nout. Humans don't exhibit strong differences between populations (as in, say,\ndogs, where humans have enforced breeding lineages in line with ideas about\nwhat should count as a \"purebred\" One might make an argument for dogs as\nracialized -- but really only because the subjective categories of breeders\nhave been reinforced in practice, in projects of breeding that have been much\nmore rigorous than anything ever done in humans).\n\nIn this article, Gould gives THREE reasons why there are no subspecies in\nhumans:\n\n1. \"discordance of characters\" -- which I've already mentioned: \"We might\nmake a reasonable division on skin color, only to discover that blood groups\nimply different alliances,\" or acidity of saliva, or presence of absence of sickle\ncell (which does NOT vary by latitude, as does skin color; doesn't line up. it's\nassociated with malaria) or ability to roll your tongue. There is NO\nCLUSTERING of traits in humans.\n\n2. \"fluidity and gradations\" \"We interbreed wherever we move, breaking down\nbarriers and creating new groups.\n\n3. \"convergences\" \"similar characters evolve independently again and again.\"\nSo, for example, high concentration of melanin has developed independently\nin various tropical populations. As has particular facial structure, limb\nproportions.\n\nQuick digression on the evolution of melanin concentration;\n\ndarker skin shields from high UV rays, in areas with a lot of sun\n\ncancer\n\nlighter skin lets more vitamin D in, in areas with not as much sun\n\nrickets\n\nLet me give you an example that I think illustrates some of these points\npretty well. Think about the evolution of dark skin in populations in sub-\nSaharan Africa and in aboriginal Australia.\n\nNow, these are independent events. Australia was not originally settled by\nhumans who came straight from Africa. Direct ancestry in sub-Saharan Africa\nis not a reason that many Australian aboriginals have dark skin. In terms of\ngenealogical relationship, Australian aboriginals have a more recent history in\ncommon with the people of mainland Asia -- people in India, China, Laos, etc,\nwith whom they share the most recent common ancestry. As you'll note by\nthese examples, there's a very high probability that the ancestors of\naboriginals developed darker skin as their relatives in Asian populations\ndeveloped somewhat lighter skin.\n\nSo, here we have\nCONVERGENCES: same traits developing in different populations\n\nDISCORDANCE: looking at skin color similarities in some African and\nAustralian populations will blind you to other differences. Maybe a different\ncategorization, say by blood type, would lead to a different grouping.\n\nIn many ways, both African and Australian aboriginal groups have come to be\nseen as \"black\" because of a common history of colonization by the British.\nAnd this has also affected the way they've come to see themselves. In fact,\nmany Australian aboriginals have linked themselves up with global black\npower movements. You might imagine a scenario, then, in which two people\nfrom these populations come together and happen to have children. What is\nthe \"race\" of that child? This gets to Gould's point about FLUIDITY and\nGRADATIONS, humans interbreeding wherever they go, breaking down\nbarriers and creating new groups.\n\nNow, examining GENETIC DATA can help us understand all of these things --\nand curiously, genetics, a tool that developed out of a concern with\ngenealogy, actually has served to unravel, shatter, many popular social\nbeliefs about who is related to whom, and how populations cluster.\n\nGould on variation within and between groups:\n\"We can measure so much variation among individuals within any 'race' that\nwe encounter very little new variation by adding another race to the sample.\nIn other words, the great preponderance of human variation occurs within\ngroups, not in the differences between them\" (p. 196). If some disaster\noccurred that killed all the human race except some very small group, we'd\nstill have 80 percent of human variation.\n\nAnd keep in mind that these \"groups\" are socially and historically designated!\nAt different times in history, racial groups have been quite various. Irish and\nItalians have not always been white in the US for example. We'll talk about\nthe history of such variation in social racialization in this course.\n\nQUESTIONS?\n\nMarks, Jonathan. 1995. Racial and Racist Anthropology. In Human Biodiversity:\nGenes, Race, and History. New York: De Gruyter, (pp. 99-116).\n\nOmi, Michael and Howard Winant. 1994. Racial Formation. In Racial Formation in the\nUnited States: From the 1960s to the 1990s, Second Edition. New York: Routledge,\n(pp. 53-76).\n\nIf race is not a biological category, and is rather historical and social, how\nshould we understand it? Even if we are persuaded that there is no\n\"biological\" reality, how can we account for the regularities (and irregularities)\nof its use? Omi and Winant suggest the idea of RACIAL FORMATION (and this\nis something they develop for the US). We want to try to adopt their model as\nwe look at the history of race in this class.\n\nOmi and Winant ask us to consider the creation of racial categories socially\nand historically. So, clearly, they want us to avoid thinking about race as an\nESSENCE (they base this contention on their reading of arguments like\nGould's). At the same time, though, they argue that we must not see it as an\nILLUSION; just because it is socially produced does not mean it isn't real.\nWhat does that mean?\n\nThey try to explain this though a concept they call RACIAL FORMATION:\n\n\"We define racial formation as the sociohistorical process by which racial\ncategories are created, inhabited, transformed, and destroyed.\" (p. 55) Own\nwords?\n\nImportantly, racial formation is a process that is both symbolic and structural;\nthey write \"we argue that racial formation is a process of historically situated\nprojects in which human bodies and social structures are represented and\norganized.\" (p. 56). \"from a racial formation perspective, race is a matter of\nboth social structure and cultural representation\" (p. 56). Racial formations\nare made of racial projects. A racial project is \"simultaneously an\ninterpretation, representation, or explanation of racial dynamics, and an effort\nto reorganize and redistribute resources along particular racial lines\" (p. 56).\n\nSo, for example, there was a racial formation during American slavery\nthat represented the bodies of slaves as firstly uniformly \"black\" (even\nif particular slaves may have come from very different areas of Africa\nor have had a white father) and secondly as capable of hard labor in a\nway white bodies were not, and thirdly as less than fully human. These\nrepresentations were articulated to a social organization in which\nenslaved persons were commodities who could be bought and sold,\nand in which norms of paternity, maternity, and family that applied to\nwhite people -- that applied to slave HOLDERS -- did not apply to\nslaves, newly racialized as \"black.\" The children of a slave woman\nwere not hers, but rather the property of a master.\n\nOther examples?\n\nthe conquest of the Americas by Europeans\ndispossession of Native Americans\n\neugenics movements\nsegregation\nAsian exclusion acts\nJapanese internment\n\nbut also civil rights\naffirmative action\nblack power\nback to Africa\nla raza Chicano movements.\n\nAll of these projects represented what race was, organized resources\naccordingly and importantly CREATED the categories of their own\nconcern.\n\nAnd note that not all projects of racial formation are racist.\nWhat is racism?\n\nWhat's the difference between an awareness of \"race\" and \"racism\"?\nWhat do you think?\n\nOmi and Winant, have a helpful definition:\n\n\"a racial project can be defined as racist if and only if it creates\nor reproduces structures of domination based on essentialist\ncategories of race\" (p. 71). \"In order to identify a social project\nas racist, one must in our view demonstrate a link between\nessentialist representations of race and social domination\" (p.\n71).\n\nSo, back to Africa movement in 1920s? depends: may have\nessentialist understanding of race, but is not linked to\ndomination.\n\nKu Klux Klan? has essentialist notions and seeks to reinforce\nstructures of domination.\n\nbell curve and idea that different racial groups have different\nIQ? yes.\n\nFarrakhan? potentially yes, since it is essentialist and depends\nin part on demonizing Jews. Even so, black supremacism, while\nracist, is not necessarily as powerful and frightening as white\nsupremacism.\n\naffirmative action? no -- not essentialist and not dedicated to\npreserving hierarchy. (p. 72).\n\nSo, how does science fit in? How have scientific projects been part of racial\nprojects, been part of racial formation? Can you think of examples? 18th\ncentury ranking of races, eugenics\n\nnote that Stephen Jay Gould's work is also engaged in racial formation -- in\nthis case, by saying that there is no biological basis for race -- he's engaged\nin REPRESENTING RACE as biologically ephemeral. And he's got a notion that\nsociety has been organized around a misapprehension of how race works.\n\nSo, read the Omi and Winant carefully and think about how you can apply it\nto the different moments that we'll examine.\n\nEthnicity? Often the self-defined, rather than externally ascribed,\ncategorization of peoples; so \"black\" is racial, while Liberian, Afro-Caribbean,\nSea Islander, West Indian are perhaps more ethnic. \"White\" is racial, while\nGerman, English, Irish, are ethnic. Tricky though -- and obviously something\nthat changes over time and context; i.e., Jewish.\n\nBowker, Geoffrey C. and Susan Leigh Star. 2000. The Case of Race Classification and\nReclassification under Apartheid. In Sorting Things Out: Classification and Its\nConsequences. Cambridge: MIT Press, (pp. 60-64, 195-225).\n\nThis article centers on a different sort of deployment of science in making\n\"race\" than biology. Here, the focus is less on heredity than the technologies\nof classification through which race becomes manifest (or not).\n\nAnd I've given you some pages in their book in which they write about\nAristotelian versus prototypical classification. Can we try to figure these out?\n\n\"Aristotelian classification works according to a set of binary characteristics\nthat an object being classified either presents or does not present. At each\nlevel of classification, enough binary features are adduced to place any\nmember of a given population into one and only one class\" (p. 62). [like\nLinnaean classification in Marks]\n\nexample: the idea that there are distinct races that can be sorted (Europeans,\nAsiatics, coloreds, \"natives\"/Bantus/Africans)\n\nPrototypical characterization: go from abstract example to object. We have a\nrough idea and then see if it maps onto the object in question.\n\nexample: classification of a given person into a race.\n\nEveryday classification of race in South Africa partook of both ideas.\n\nSo, what I'd like you to do now is divide into four groups and do the following task\nfor me:\n\nTake a racial category from South Africa\n\nAsian\n\nWhite\n\nBantu/Black African\n\ncolored\n\nand together with your group, be prepared to tell the class\n\n1. how the category is defined in theory and seems to work in practice\n2. a story about how particular people's lives were affected by the\ncategory (go through chapter for examples). Think here about stories\nof racial reclassification.\n3. describe how you think the category functioned prototypically and/or\naccording to an Aristotelian logic as well as offering a broader view of\nwhat you think RACIAL FORMATION was like in Apartheid South Africa.\n\n1. how the category is defined in theory and seems to work in\npractice\n\npay attention to Population Registration Act and the Group Areas Act.\n\nBoth of these Acts assumed that races were natural kinds, that\nracial categories were Aristotelian in character, the result of\nsorting out mutually exclusive traits through histories of clean\nlines of descent. The policy of \"separate development\" was\nbased on \"loose eugenic basis that each race must develop\nseparately along its natural pathway and that race mixing was\n'unnatural' \"(p. 197)\n\nBut when it came to enforcing these Acts, what happened?\n\nPop Reg Act assigned people to \"lower\" race of the two parents\nwhen they reached age 16. But Group Areas Act asked that\npeople be classified according to father's race in order to live in\nsame household.\n\nThere are potentially conflicting ideas about descent and\ninheritance here. How do you explain this? Bowker and Star say\nthat when it came time to classify INDIVIDUALS, Prototypical\ncategories were used. So, a child of two parents falls into race\nof lower parent, but a child must live with its father. What's\ngoing on? Is this a conflict between Aristotelian categories and\nPrototypical ones? Or are there two different Aristotelian frames\nwith different assumptions about gender?\n\n2. a story about how particular people's lives were affected by the\ncategory (go through chapter for examples). Think here about\nstories of racial reclassification.\n\nWhy was it possible, given the sense that races were pure immutable\ntypes, for people to be reclassified?\n\nOne factor is of course the fact that individuals are classified\nprototypically in practice to avoid endless inquiries into their\ndescent (Think about the Race Reclassification Board). As\nBowker and Star point out, many white south Africans did not\nwant to face the possibility of being disenfranchised by finding\n\"black blood\" in their past (this is a real contrast to the one-\ndrop rule!). (p. 208)\n\nSo \"In the case of apartheid, we see the scientistic belief in\nrace difference on an everyday level and an elaborate formal\nlegal apparatus enforcing separation [based on Aristotelian\nconvictions]. At the same time, a much less formal, more\nprototypical approach uses an amalgam of appearance and\nacceptance and the on-the-spot visual judgments of everyone\nfrom police and tram drivers to judges to perform the sorting\nprocess on the street\" (p. 201)\n\nAnother factor is that the Aristotelian categories themselves\nexplicitly contain their own sabotage in the category of\n\"colored.\" What do cases of the reclassification of colored\npeople tell us about the categories?\n\nTotally based on prototypical ideas. Where you've been to\nschool, etc. And technologies used inconsistent and crude\n(combs, etc.).\n\n3. describe how you think the category functioned prototypically\nand/or according to an Aristotelian logic as well as offering a\nbroader view of what you think RACIAL FORMATION was like in\nApartheid South Africa.\n\nOmi and Winant write: \"from a racial formation perspective, race is a\nmatter of both social structure and cultural representation\" (p. 56).\nRacial formations are made of racial projects. A racial project is\n\"simultaneously an interpretation, representation, or explanation of\nracial dynamics, and an effort to reorganize and redistribute resources\nalong particular racial lines\" (p. 56).\n\nHow can we bring the strategic inconsistency of racial classification --\nof racial representation -- that Bowker and Star point into dialogue\nwith Omi and Winant's attention to the politics of representation? What\ndoes inconsistency add?\n\nHelps show how contradictory forces work in representational practice.\n\nBowker and Star write that \"the prototypical and the Aristotelian are conflated,\nleaving room for either to be invoked in any given scenario\" (p. 223). And why are\nthey conflated? Because \"the pure types existed nowhere and racism existed\neverywhere\" (pp. 201-202).\n\nFurther, \"The conflation [of Aristotelian and prototypical] gives a terrible power of\nownership of both the formal and informal to those in power\" (p. 204). When racial\ncategories oscillate back and forth between these two modes, the consistency that\nhas emerged has been less at the level of categories than in at the level of securing\nprivilege.\n\nNext time:\n\nPART 1: THE ALCHEMY OF RACE: MAKING AND UNMAKING SCIENTIFIC\nRACISM\n\n3. February 19\nBlood, Sex, and Skeletons: Colonialism, Climatic Determinism, Cranial\nCapacity, and the Rise of Monogenist and Polygenist Scientific Racism\n\nSKIM Darwin!\n\nCome to class with a page of thoughts about how RACE and SEX work together in\nthe readings."
    },
    {
      "category": "Lecture Notes",
      "title": "lecnotes_02_19.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-240-race-and-science-spring-2004/2b4798f58e7d0c987316c24d0d918dfd_lecnotes_02_19.pdf",
      "content": "21A.240\nRace and Science\nSpring 2004 MIT\n\nPART 1:\nTHE ALCHEMY OF RACE: MAKING AND UNMAKING SCIENTIFIC RACISM\nLecture 3. February 19\n\nI want us to look today at the rise of the concept of race - with THREE things in\nmind:\n\n1. its transformation from a largely religious category -- with origins in European\nChristendom -- to a scientific category; we're looking at major shifts in racial\nformations.\n\n2. the importance of sex, gender, and reproduction for the consolidation of \"race\"\nacross both religious and scientific racial formations.\n\n3. skulls.\n\nWhat I want to do is explore this history of pre-scientific racial formation and early\nscientific racial formation with you with the aid of the articles we've read, taking\nthem mostly in order, but also jumping back and forth a bit.\n\nI'm going to start with a lecture, in which I will tell you about the invention of the\nconcept of race in medieval Europe and how it gradually transformed from a religious\ncategory into one employed by scientists, or, as they were called natural\nphilosophers.\n\nBlood, Sex, and Skeletons: Colonialism, Climatic Determinism, Cranial\nCapacity, and the Rise of Monogenist and Polygenist Scientific Racism\n\nTHE HUMORS AND GEOGRAPHICAL DETERMINISM\n\nIn Medieval Christian Europe, it was believed that climate and geography could\ndefinitively determine people's constitutions and dispositions.\n\nIt was believed that there were four elements (earth, wind, and fire -- and\nwater) that corresponded to four humors -- or fluids -- in the human body:\nblood, phlegm, yellow bile (choler), and black bile. The proper balance of\nthese humors would lead to proper temperament, but improper balance would\nlead to a person being more or less SANGUINE, PHLEGMATIC, CHOLERIC, or\nMELANCHOLIC.\n\nOVERHEAD 1: HUMOURS\n\nEuropean natural philosophers believed that different PLACES in the world\nwere more or less suited to having a balance of humors, and some places\nwould tilt you way out of balance. People thought that Asia, for example, was\n\na place of melancholy souls, since black bile predominated in climates that\nwere cold and dry like the Asian steppes.\n\nSince the Europeans thinking about these things were medieval Christians, it\nis not surprising that they thought the perfect climate was to be found in the\nGarden of Eden, from which humanity had been exiled after the sin of Adam\nand Eve.\n\nThe prevailing belief was that as people had moved away from Eden they had\nDEGENERATED; their humors had been thrown out of whack. SOME places,\nlike ancient Greece, approximated Eden more closely than others. People\nfrom these climates could try to reapproximate a close-to-God state. Some\nplaces were lousy and the people who lived there were lazy or mean.\n\nThis whole cluster of beliefs is called GEOGRAPHICAL DETERMINISM\n\nNow when Europeans came upon the Americas, there was a huge question to\nbe answered about who exactly the native people were and what they were\nlike. Was the so-called New World similar to Eden? Or was it a horrible hellish\nplace?\n\nThere was lots of controversy about the humoural balance of the indigenous\npeople of the Americas. And the Americas were a key place for the\ndevelopment of RACE.\n\nPURITY OF BLOOD AND LINEAGE THINKING\n\nHow did people come to believe that humoral traits could be INHERITED? Stay in\nEurope with me for a moment. King Ferdinand and Queen Isabel's Castilian Empire\non the Iberian peninsula in the 1500s. You may be familiar with this today as SPAIN.\n\nIn the 1500s, Iberians were obsessed with an idea that they called PURITY OF\nBLOOD. And this was about religion.\n\nChristians who could trace their lineage back to other Christians were said to\nbe pure of blood; recently converted Christians whose ancestors were Jewish\nor Muslim were suspect -- could not be trusted to hold royal or clerical office;\nthis was a legacy of the Spanish Inquisition. Those who were impure of blood\nwere prevented from holding office, marrying Christians, and in many cases\nfrom traveling to the Americas.\n\nWhy BLOOD?\n\nBlood was not just one of the humours, but was the substance that people\nbelieved carried heritable social characteristics down the generations. The\n\"proper\" flow of blood, in proper families, was felt to reproduce new people in\nproper places in the social order, in the social body.\n\nThis idea was transferred to the Americas.\n\nBut, now, geographical area became important. For the SPANISH COLONISTS there\nwere three primary areas from which people could originate: EUROPE (Christendom),\n\nAMERICA, and AFRICA -- and so there were three major RACES of concern to them,\nwhich they called ESPANOL, INDIO, and NEGRO.\n\nBy the end of the 1500s in the Americas, there had been intermarriage and mixture\nalong with conversion to Christianity and the category that was of real concern was\nMESTIZO.\n\nMestizos --people who were the offspring of Spaniards and Indians [as they were\ncalled (remember, because Columbus was lost!)] -- held positions of power, but\nthere was a big question among colonial rulers back in SPAIN about whether they\ncould be TRUSTED.\n\nIt was all about holding colonial office and being loyal to the people back in Spain.\nPeople who were too mixed might not be loyal. And that meant that colonial officials\nhad to figure out what to do with them. So, people were categorized by LINEAGE.\nBLOOD was the symbol of FAMILY and LOYALTY. CATEGORIES of INTERMIXTURE\n\nSo now the earlier GEOGRAPHIC DETERMINISM -- with EUROPE, AMERICA, and\nAFRICA as the primary places of origin joined PURITY OF BLOOD. And racial\ncategories proliferated. RACE itself came into existence. One etymology for the word,\nin Spanish, is RAZA.\n\nRAZA is from an old Spanish word, which initially referred to noble ancestry, though\nsome say this meaning was later brought into juxtaposition with an older Castilian\n(Spanish) word which meant defect.\n\nThe word \"race\" has been variously traced to the Latin ratio (\"reason\") or\nradix (\"root\"), and to the Hebrew for \"head\" or \"origin,\" ras. Cf. Leo Spitzer.\n\na. F. race, earlier also rasse (1512), a. It. razza = Sp. raza, Pg. raca, of\nobscure origin.\n\nIn the context of the religious concerns of Inquisition Spain, where Jewish or Muslim\nancestry was considered a \"defect,\" these meanings came together to make race\nabout religious heritage.\n\nRACE itself came into existence as a SOCIAL CATEGORY.\n\nNew Spain went crazy for race, for classifying everyone. I have some paintings here\nfrom the 1700s, which depict all the categories, and what happens when they mix.\n\nOVERHEAD 2: CATEGORIES OF INTERMIXTURE\n\nYou might not be surprised to learn that ideas about GENDER were implicated in\nthese ideas about PURITY OF BLOOD\n\nWomen and men were positioned differently in the social system.\n\nOne Spanish Jurist put it this way:\n\n\"only women can bring bastards into the family\" Why would that be? What\nkind of family is being talked about here?\n\nBecause, in this system, women come into men's families though\nmarriage, not the other way around. Women were considered the ones\nwho could pollute the family line (while men could get mistresses\npregnant, etc. without it reflecting on their family.\n\nthis is a patrilineal patriarchal system\n\nSo, control over women was key to maintaining \"purity of blood.\"\n\n\"Whenever social position in a hierarchical society is attributed so-called racial and\nhence allegedly inherent, natural, and hereditary qualities, it is essential to control\nthe reproductive capacity of its women in order to preserve its social preeminence.\"\n(p. 285).\n\nThis quotation is from\n\nStolcke, Verena. 1994. Invaded Women. In Women, \"Race,\" and Writing in\nthe Early Modern Period. Margo Hendricks and Patricia Parker, eds. London:\nRoutledge, 272-286.\n\nin this system WOMEN have to SAFEGUARD RACIAL IDENTITY-potential traitors\nMEN control WOMEN; men as paragons of racial identity\n\nI would add that it's with respect to particular kinds of ideas about paternity and\nmaternity and family; i.e. one in which men confer identity through their name (even\nas there is a sense of physical inheritance through both lines). IT'S NOT NATURAL!\n\"Bastard\" is NOT a NATURAL category!\n\nSo, let's pause: what is the racial formation here? representation and organization?\n\nRepresentation: through religion, with the humours, and ideas about men and\nwomen's roles in social reproduction.\n\nOrganization: a social hierarchy based on the religious past, the control of women by\nmen, and geographical provenance of lineage.\n\nLINNEAUS AND THE FOUR FIXED RACES\n\nBack to Europe, where natural philosophers had continued their theories of\ngeographical determinism.\n\nThe founder of modern taxonomy, the Swiss naturalist Carl Linne -- also known as\nLinneaus -- is important here.\n\nIn 1758, Linneaus wrote Systema Naturae, in which he came up with the system of\nbinomial naming -- the designation of organisms by Latin genus and species name\n(like Homo sapiens, which he coined; and this is also, by the way, why Linne\nchanged his name to Carolus Linneaus, to fit into his own system. Wacky guy.)\n\nLinneaus sought to classify human varieties in this book -- and he came up with\nfour:\n\nOVERHEAD 3: LINNEAUS' FOUR RACES AND THEIR CHARACTERS\n\nEUROPEAUS\n\nsanguineus\nASIATICUS\n\nmelancholicus\nAMERICANUS\ncholericus\nAFER\n\nphlegmaticus\n\nNow, even though Linneaus has bequeathed to us the naming system used in\nmodern evolutionary biology, Linneaus himself was a creationist and believed that\nthese four categories had been created by God and that they were unchanging, fixed\ntypes (he was a POLYGENIST [believed in \"many origins\"]). As you read in the\nHudson piece, online, Linneaus's rival Buffon was largely responsible for beginning to\nuse the word \"race\" in this kind of classification.\n\nAnd Linneaus explicitly assigned to the different varieties different temperaments,\nreaching back into the theory of humors. Europeans were sanguine, Asians were\nmelancholy, Americans were choleric, Africans were phlegmatic. So, four geographic\nregions, four humors, four races.\n\nBLUMENBACH, THE FIFTH RACE, AND THE FAMILY TREE\n\nOne of Linneaus' students, Johann Friedrich BLUMENBACH elaborated this system in\n1795 in his book On the Natural Variety of Mankind, and he renamed the European\nas CAUCASIAN. WHY?\n\nOn the basis of a new feature: the SKULL; less mutable, he thought.\n\nBlumenbach, also a creationist, thought that the most perfect skulls belonged to\npeople from around Mount Caucasus in what is now the nation-state of Georgia, in\nthe former Soviet Union (which he identified as part of Europe). These were the\nCAUCASIANS. He said of one female skull found in Georgia: \"really the most\nbeautiful form of skull which ... always of itself attracts every eye.\"\n\nBlumenbach reasoned that because these skulls were the most beautiful, they must\nbe a direct line to the first, perfect humans, Adam and Eve. Blumenbach believed\nthat the Garden of Eden was near Mount Caucasus.\n\nAfter Adam and Eve got kicked out of Eden, their children diversified into the\ndifferent races and some, according to Blumenbach, DEGENERATED -- in two BAD\nDIRECTIONS: ASIAN/MONGOLIAN and AFRICAN/ETHIOPIAN; and, Blumenbach\nbelieved, AMERICANS were intermediate between CAUCASIANS and ASIANS, and a\nnew category -- which Blumenbach invented because he needed an intermediate\nform -- the MALAY, were halfway between CAUCASIANS and AFRICANS.\n\nOVERHEAD 4: BLUMENBACH'S FIVE RACES\n\nSo, suddenly, with FIVE RACES, the idea of the four humors goes away.\n\nWe get the image of a FAMILY TREE -- with some branches reaching up and others\nstraggling off to the side.\n\nFAMILY TREES would become the preferred image for thinking about human history,\nespecially among people who subscribed to a MONOGENIC view of human origins.\n\nMONOGENIST DEGENERATION\n\nThis idea that some peoples had degenerated from a pure original form continued\ninto the 1800s, even as many natural philosophers began to abandon the Bible and\nadopt Darwin's theory of evolution. That is, the idea survived from being a religious\none to becoming scientized.\n\nThe old racial categories and ideas about inferiority continued. The idea was that\nsome groups of people had been stunted, evolutionarily speaking. Adult Africans\nwere like white children, for example. The idea was that some groups had EVOLVED\nMORE.\n\nDiscussions of race move from humours to skulls.\n\nSchiebinger, Londa. 1993. Theories of Gender and Race. In Nature's Body: Gender in\nthe Making of Modern Science. Boston: Beacon Press, (pp. 143-183).\n\nWe begin to see a shift from explicitly religious ideological warrants for \"race\"\nto ones that make use of natural philosophy and the beginnings of what\nwould come to be called \"biology.\" We've still got lots of ideas about a created\nworld, even as we see the first hints of a concern to assess human difference\nthrough MEASUREMENT.\n\nSchiebinger shows that Europeans had begun to rank the \"races\" that were\nbeing consolidated by colonialism on the great chain of being (scala naturae:\nLinneaus was into this), making use of an existing epistemology in\nChristianity, and they sought to buttress these claims with reference to\nmeasurements of skulls, pelvises, etc. She also argues that this work was\ndone in the context of struggles over political participation.\n\nIn the context of discussion over the \"natural; rights of men\" the exclusion of\nsome people from these rights demanded \"proof of natural inequality\" -- and\nscience obliged.\n\nThe first section of this chapter is called \"Were women on the chain?\"\nThe great chain of being. What does Schiebinger mean?\n\nShe says: \"notions of racial and sexual relations rested on contradictory\nvisions of nature\" (p. 146). How? (race: unilinear; sex: oppositional)\n\nimplications? SKULLS versus PELVIS; BRAIN versus GENITALS\n\ntheories of Race were almost always developed by looking at male bodies\n(skulls in particular)(and skulls [the seat of reason] were used to make the\ngreat chain of being; using indices of prognathism)\n\ntheories of Sex usually with respect to contrasts between women and men\nwithin their racial group, and almost always with respect to Europeans\n\nwhen women WERE compared across racial lines, it was always with respect\nto their sexual anatomy (particularly breasts and pelvis)\n\n(I once heard Stephen Jay Gould remark that he'd seen collections of great\nmen's skulls in Europe, but never their penises).\n\nHow did pelvises (pelvii?) enter into the story? (pp. 157-158). First they were\nproblematic (Africans' appeared larger? ease of parturition), then they were\ntamed (\"Ease of parturition no longer suggested a larger African pelvis, but a\nsmaller African skull\"[p. 158]). Finally they were used to solidify racial chain\nof being. But note what has to happen here -- one must START with\nassumptions about the skull...\n\nSo, again, how did women fit on the chain?\n\n\"Women and Africans were seen as sharing similar deficiencies when\nmeasured against a constant norm -- the Elite European man\" (158).\nprognathism, for example. Stepan's argument (1986 ISIS) detour.\n\nStepan, Nancy. 1993. Race and Gender: the Role of Analogy in Science. In The\n\"Racial\" Economy of Science: Toward a Democratic Future, Sandra Harding, ed.\nBloomington: Indiana University Press, (pp. 359-376).\n\nmetaphor in science; analogy. What's the argument here?\n\nthat scientific description, often thought to be dispassionate and objective,\noften makes use of metaphors and analogies: \"the metaphors functioned as\nthe science itself; without them the science did not exist\" (p. 364).\n\nwhite women and non-white men: feminine, juvenile, smaller heads\n\nDarwin says \"The female, in the formation of her skull, is said to be\nintermediate between the child and the man\" (p. 317).\n\n\"established as signs of inferiority, the facial angle ... could be then be\nextended analogically, to explain other inferior groups and races\" (p. 363)\n\nSchiebinger adds a step to Stepan's argument, though: \"This assessment (p.\n158), however, does not take into account the contrasting ways in which\nEuropean naturalists described women of different ethnic and cultural\nbackgrounds.\"\n\nSchiebinger is arguing that \"females in general were considered a sexual\nsubset of their race; unique female traits only served to confirm their racial\nstanding\" (p. 160).\n\nWhile Stepan's argument makes sense of some persistent regularities in\nEuropean racial science, it also assumes that the metaphorical grid within\nwhich things are seen is relatively airtight and self-consistent. It may not be.\n\nSchiebinger uses the story of Sarah Bartman -- the so-called Hottentot Venus\n-- to illustrate the ways that racial and sexual traits were crafted in concert.\n\nWhat is the story here, and what can you say about it in terms of race and\ngender ideas of Europeans at this time?\n\n\"doubly determined that the focus would be on sexuality.\" climatic\ndeterminism survives: \"African labia and breasts ... one writer said ... became\nenlarged and elongated in the same way that the flora of that continent grew\nlarge and fleshy in its extreme heat\" (p. 171).\n\nsays more about the fantasies of European men; assumption that this person\nwas a \"type\"\n\nI think part of what's important about this is that the origin of RACIAL\ncategories absolutely must be understood in the context of GENDER and\nCOLONIALISM.\n\nGould, Stephen Jay. 1993. American Polygeny and Craniometry before Darwin:\nBlacks and Indians as Separate, Inferior Species. In The \"Racial\" Economy of\nScience: Toward a Democratic Future, Sandra Harding, ed. Bloomington: Indiana\nUniversity Press, 84-115.\n\nthis is about pre-evolutionary scientific racism.\n\nwhat are polygeny and monogeny?\n\npolygeny (separate creations: Aggasiz)\n\nAggasiz, abolitionist but polygenist racist, opponent of evolution\n\nwhat is the relation between religion and science in his work?\n\nSamuel George Morton: craniometry and cranial capacity\nthough Morton seemed to tamper with his data, Gould says that he\nhad not committed fraud. Why?\n\nan older tradition of skull stuff is alive here.\n\nGould goes through Morton's data, arguing that it was not conscious fraud,\nbut that he was led to choose particular kinds of measurements:\n\n(how has Gould used racial categories in his own reanalysis on page 105? (is\nhe saying, OK IF you accept these categories...?) corrections for body weight,\nsex (he seems to take sex for granted!), sample size, etc.)\n\nnote how race is sexed/gendered in the pronouncements of the people Gould\ncites (\"effeminate\" races) and how this is in turn scientized.\n\nprimarily a creationist position. races are separately created species. proof?\nlook at FORMS. Since forms are unchanging over time, this is the place to\nlook. Skulls.\n\nMonogeny: everyone has common ancestor.\n\nAlthough both monogeny and polygeny started out with an appeal to religious\ndoctrine, polygeny was the far weaker of the two, because the idea of\nseparate origins went against scripture.\n\nBut, as you see, a racist commitment to insuperable racial difference could\neasily be accommodated in monogeny. How?\n\nsome groups have DEGENERATED\n\nreligious warrant?\n\nclimatic determinism, movement away from Eden\n\nscientific warrant?\n\nclimatic and geographic dispersal (Blumbenbach)\n\nsome groups were stunted: the theory of recapitulation (Adult blacks were\nlike white children, Asians like white adolescents...) i.e. some groups had\nEVOLVED MORE: here you get the FUSION of the CHAIN OF BEING AND THE\nFAMILY TREE (PICTURE)\n\nHere's a family tree from the late 19th century.\n\nFamily tree started to get used in EVOLUTIONARY THEORY, particularly by\nDARWIN.\n\nWHAT SORT OF FAMILY IS THIS?\nWHAT ARE THE ROLES OF MEN AND WOMEN IN THIS FAMILY?\nAND HOW DO WE UNDERSTAND DIFFERENT \"RACES\" IN THE FAMILY IDIOM?\n\nDarwin, Charles. 1871. The Descent of Man and Selection in Relation to Sex.\nPrinceton: Princeton University Press, 1981, (pp. 214-236, 240-250, 316-329, 381-\n384) - SKIM\n\nFedigan, Linda Marie. 1986. Biological Evolution in the Nineteenth Century, from The\nChanging Role of Women in Models of Human Evolution. Annual Review of\nAnthropology 15: (pp. 25-66). -- READ ONLY (pp. 27-29).\n\nGROUP ACTIVITY\n\nNow we get to the major figure in biology: Darwin. Darwin's theory of\nevolution by natural selection is founded on a monogenist view of organic\nhistory, and no less so when he forwards his theory of the evolution of\nhumans. And it's a theory about PROCESS rather than types (ultimately, one\nmight argue, it is this process logic that people later use to demolish race as a\nscientific category, but we're getting ahead of ourselves here).\n\nWhat I've excerpted here is stuff from Descent of Man, Darwin's attempt to\napply his theory of evolution to humans.\n\nWe want to think about what RACE was for Darwin. Any starts?\n\n(p. 216: differences)\n(p. 226: lots of slippage into species. It's almost as though race and species\nare sometimes synonymous; he also throws in subspecies [p. 227])\n\nWhere does Race come from?\n\nsexual selection as a major process: quote page 250.\n\nHow does this work? Let's unpack it.\n\nfirst, what is sexual selection?\n\nselection to account for secondary sex characteristics in males and\nfemales\n\n\"struggle between males for possession of females\" (pp. 87-90);\nbasically, male competition and then female choice\n\n\"competition, Darwin believed, generally occurred between males for access\nto female mates, and choice, he reasoned, was exercised by females from\namong the male mates available to them\" (Fedigan: p. 27)\n\nAn interesting entailment of the way Darwin framed things was that natural\nand sexual selection seemed only to be acting on males: \"competition\nselected for male armaments (size strength weapons) and choice selected for\nmale ornaments (colors, elaborate headdresses, beautiful voices)\" (Fedigan:\np. 28). Female traits seemed to occur in the absence of natural and sexual\nselection.\n\nBut, as Fedigan notes, Darwin later contradicts this theory when it came to\nhumans. In humans, Darwin argued, females were chosen by men after their\ncompetition and fighting. Basically, then, men operated in the realm of\nnatural selection and sexual selection, and women were subject only to the\nless rigorous forces of sexual selection, which just selects them to be pretty.\nIn a way, you might say that, in Darwin's theory, women are selected to give\nbirth to the men who are doing all the evolving through natural selection.\n\n\"Darwin helped to pioneer what I call the coat-tails theory of evolution: traits\nare selected for in males and women evolve by clinging to the coat-tails of\nmen\" (Fedigan: p. 29).\n\nDarwin: \"Thus man has ultimately become superior to woman. It is indeed\nfortunate that the law of equal transmission of characters to both sexes\nprevails with mammals. Otherwise it is probable that man would have become\nas superior in mental endowment to woman as the peacock is in ornamental\nplumage to the peahen.\" (Fedigan: 29).\n\nThe Descent of Man's title should be taken literally! THE FAMILY TREE IS A\nBUNCH OF MEN!\n\nNow, what does all this mean about race? And can we make links back to the\nprevious authors?\n\nwell, he says \"secondary sex characteristics differ much in the several\nraces\" (p. 320). WHY?\n\nPAGE 325 quote: \"there can be little doubt that the greater size and\nstrength of man...\"\n\nPAGE 327: \"the half-human male progenitors of man, and men in a\nsavage state, have struggled together for many generations for the\npossession of females\"\n\nWhat is the importance of this \"possession of females\"? what sort of\nrelationship does it put women and men into? passive female sexuality, active\nmale sexuality\n\nfemales become the conduits for males to pass on the traits they have\naccumulated from natural selection and from competition with one another for\nfemales.\n\nKey quote page 328: The higher powers of the imagination as well as\npersistence \"will have been developed in man, partly through sexual selection\n-- that is through the contest of rival males, and partly through natural\nselection -- that is from, success in the general struggle for life; and as in\nboth cases the struggle will have been in maturity, the characters thus gained\nwill have been transmitted more fully to the male than to the female\noffspring. Thus man has ultimately become superior to woman.\" (p. 328)\n\nSo, racial difference, for Darwin, where does it come from?\n\nin part from the persistence and imagination of males of a particular group,\nas well as their choice of attractive female characteristics!\n\nproblem with Darwin's argument: takes for granted what it wants to prove!\nassumes racial dispositions in order to show how they've evolved!\n\nbut still, females must be \"possessed\" (i.e., their sexuality controlled) in order\nfor these traits not to be diluted, especially since, because of the law of equal\ninheritance, they also obtain then (coat-tails). The racial identity is passed on\nthrough agency of males in control of females. This naturalizes the idea of\npatriarchy and makes it part of some of the earliest evolutionary attempts to\ntheorize race,"
    },
    {
      "category": "Lecture Notes",
      "title": "lecnotes_02_26.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-240-race-and-science-spring-2004/3290a365d3ddf4515aa57e8704d3635b_lecnotes_02_26.pdf",
      "content": "21A.240\nRace and Science\nSpring 2004 MIT\n\nPART 1:\nTHE ALCHEMY OF RACE: MAKING AND UNMAKING SCIENTIFIC RACISM\nLecture 4. February 26\n\nIn three weeks, PAPER # 1 is DUE. Let me give you a sense of how to think about it.\nI write on the syllabus: Students will write three 7-page papers, choosing from a\nselection of topics to be provided by the instructor for each paper. What kinds of\ntopics will those be? Let me give you a sense of what these might be like -- just so\nyou can start to tune in. I'll provide the real topics next time.\n\n1.\nExplain\nthe\nplace\nof\nsex,\ngender,\nand\nreproduction\nin\ntwo\neugenic\nmovements/moments documented by Kevles.\n\n2. Discuss similarities and differences between Boas and Du Bois on matters of race\nclassification and science. Consider contexts of immigration, segregation, and health.\n\n3. Compare and contrast notions of racial hygiene in Brazilian and Nazi/German\neugenics. Be sure to discuss the place of the \"nation\" in each case.\n\n4. Use Bowker and Star's ideas about Aristotelian and prototypical classification to\nexamine the workings of race for Blumenbach, Boas, and Gould.\n\nGerm Plasm: American and British Eugenics\n\nKevles, Daniel J. 1995. In the Name of Eugenics: Genetics and the Uses of Human\nHeredity. Cambridge: Harvard University Press, chapters I-IX, XI-XIII (pp. 3-147,\n164-211).\n\nThis is a big book with lots of history, taking us from early social Darwinism through\nmid-20th century population genetics. Some of this later stuff I had you read won't\nbe directly relevant to today, but sets the stage for later history we'll do in this class.\n\nAnyway, we need to think about how to make all of this history manageable for\ndiscussion.\n\nSo, I have a plan -- one which will get us through the different positions enunciated\nin the history of eugenics, allow us to theorize some the history we've read about,\nand also allow you to get to know each other some more.\n\nDivide into three groups:\n\nGalton-Pearson-Davenport chapters 1-3\n\nGospel becomes Popular-Eugenic Enactments chapters 4-7\n\nFalse Biology, A Reform Eugenics-Brave New Biology chapters 9, 11-12\n\n****\n\nI would like each group to consider the following questions collectively. What I'll do is\ngive you about 20 minutes to discuss these amongst yourself. At the end of that\ntime, we'll hear a summary from each group. These should be about 15 minutes or\nso.\n\n1. What are some continuities and discontinuities between the theories and practices\nof the eugenics movements you've read about in the chapters for which your group\nis responsible and the racial ideas that we looked at last time (in terms of\nsex/gender, class, nation)? Think also about differences and similarities from earlier\neugenics, if you're in groups 2 or 3.\n\n2. To use Omi and Winant's terms, can you characterize the racial projects of the\ndifferent people Kevles writes about? And can you identify the racial formation of\nwhich they were a part?\n\nLet me refresh your memory on Omi and Winant:\n\n\"We define racial formation as the sociohistorical process by which racial categories\nare created, inhabited, transformed, and destroyed.\" (p. 55)\n\n\"we argue that racial formation is a process of historically situated projects in\nwhich human bodies and social structures are represented and organized.\" (p.\n56). \"from a racial formation perspective, race is a matter of both social\nstructure and cultural representation\" (p. 56). Racial formations are made of\nracial projects. A racial project is \"simultaneously an interpretation,\nrepresentation, or explanation of racial dynamics, and an effort to reorganize\nand redistribute resources along particular racial lines\" (p. 56).\n\nNow, you may have noticed that \"race\" as such figures differently in different\nmoments, and you might see something like class or nation eclipsing or\noverdetermining \"race\" sometimes; so, feel free to speak about class\nformation, too. Because Kevles is a comparative history of the US and the UK,\nsome of these differences are not surprising.\n\n3. Can you say something about the relationship between science and race in these\nmoments; how does science construct or deconstruct race? And as part of that, tell\nus something about the various meanings of \"race\" you detect in the periods you're\nresponsible for. You might even pick out passages in which that term is used.\n\nJust a few comments about Kevles: As you may have noticed, he organizes his\nhistory around individual people -- kind of Great Man theory of history, even when\nthe men aren't so great! And he uses the word \"Man\" to stand for humanity, which is\nannoying. And he often offers a kind of psychological explanation for people's\nadherence to eugenics.... I'm asking you to squeeze out a more sociological,\nhistorical, theoretical story by asking you to use Omi and Winant.\n\nSo, about 20 minutes to discuss these questions, search for quotes, etc. Then we'll\nhear a report from each group -- try to get everyone to speak; however you like (by\nchapter, question, etc.). If you can think of any questions you'd like to discuss with\nthe class as you go along, things you're not sure of, interesting ambiguities that you\nthink we can talk about, do that.\n\ngroup one will focus on Galton, Pearson, Davenport\ngroup two on eugenic policies -- sterilization, IQ testing\ngroup three on reform eugenics and the instability of \"race\"\n\n***\n\nGROUP ONE\n\nGalton -- coined \"eugenics\"\nHereditary Genius 1869, interested in MEN and their BRAINS, reputation flows from\nheredity\npage 6, 11: phrenology and humoral balance of Galton (older racial parameters!),\ninterest in Hottentots, shapes of skulls\n\n\"Whenever you can, count.\" (p. 7) wanted to use STATISTICS to understand\nheredity (and note that \"the word statistics, denoted, in Galton's time, \"state\"\nnumbers -- indices of population, trade, manufacture, and the link -- the gathering\nof which aided the state in the shaping of sound public policy\" (p. 12). variation from\nthe mean.\n\nThis use of STATISTICS factored out the CAUSES of variation, ASSUMING them to be\nHEREDITARY.\n\n\"For Galton the scientist, the professional classes were the prime repository of\nability and civic virtue, and his eugenics made them the keystone of a biological\nprogram designed to lead to the creation of a conservative meritocracy\" (p. 9) so,\naristocracy and working-class not as good.\n\nbelieved in regression to the mean: It was \"in consequence impossible that the\nnatural qualities of a race may be permanently changed through the action of\nselection on mere variation\" (this was actually against Darwin's theory).\n\nwhat is A RACE here? an archetype, a fixed thing.\n\nSCIENCE measures it objectively...\n\nPearson\nBritish socialist background\n\"In Pearson's view, Darwinism buttressed Herbert Spencer's doctrine of individualism\nand provided a justification of laissez-faire capitalism. But in the England of the\n1880s, reformers were forging Darwinism into a weapon against laissez-faire.\nPearson soon followed suit, by substituting competition between national groups for\nindividual struggle\" \"Pearson came to equate morality with the advancement of\nsocial evolution, the outcome of the Darwinian struggle with the ascendancy of the\nfittest nation\" (p. 23). NATION is often used synonymously with RACE.\n\nenabled by the fact that Pearson seeks to measure RACIAL DIFFERENCE through\nSTATISTICS, numbers generated by the STATE, which is the representative of the\nNATION.\n\nNation should be bred from the best \"stocks\" (p. 32). PROFESSIONAL CLASS.\n\nPearson felt that capitalism was to blame for the deterioration of Britain; the demand\nfor cheap labor pressed poor people to have many children. Private charity was\nworse still, and encouraged continued profligacy on the part of the poor. \"Natural\nselection, he believed, had been suspended and replaced by 'reproductive selection'\nwhich gave the battle to the most fertile, not the most fit\" (p. 34).\n\nCONTRADICTION HERE?\n\nPlace of women in Pearson's theory? (Male Female club). Socialist ideas, supporter of\nwomen's rights, sexual emancipation, 'voluntary motherhood'. Only if women had\nfull education, job opportunities, sexual education, reproductive options, could they\nfreely make eugenic mate choices (if they could support themselves, they wouldn't\nbe forced to marry prematurely; if they had scientific training, they could tell a good\nman when they saw one).\n\nThe views of British eugenicists like Pearson incarnated prevalent British ideas about\nthe differences between classes; much of this had to do with upper and middle class\nprejudices about unfettered lower class sexuality.\n\nWhat is RACE here? \"national eugenics\": \"the study of agencies under social control\nthat may improve or impair the racial qualities of future generations either physically\nor mentally\" (p. 37).\n\nrace is nation, race is a general category of physicality. vague.\n\nDavenport\nIn the US, concerns with 'race' mixture and with the possible degeneration of Euro-\nAmerican stock came into vogue as the US was 'infiltrated' by immigrants from\nEastern Europe.\n\nCharles Davenport founded a eugenics research center (this meant starting an\narchive of human pedigrees [useful for tracing inheritance of Mendelian units\n{Davenport's eugenics was somewhat different from Pearson's and Galton's which\nwere more 'biometric'}]) in 1904 at Cold Spring Harbor.\n\nDavenport believed that immigrants ('races' like Jews, Irish Catholics, Italians, etc)\nthreatened the 'nation's germ plasm'.\n\nAside about Weismann -- sequestered germ cell line. disallowed Lamarckian\ninheritance (define). But used to buttress claims about genetic essentialism,\ndismissing environment.\n\nso, germ plasm, protoplasm, became a racial essence.\n\nprotoplasm as a scientific term that also functioned as cultural representation of\ngenetic essence\n\n\"Like many of his colleagues, Davenport equated national and \"racial\" identity, and\nassumed as well that race determined behavior. He held that the Poles, the Irish, the\nItalians, and other national groups were all biologically different races; so, in his\nlexicon, were the 'Hebrews'\" (p. 46).\n\n\"Believed that the European nations sent over disproportionately large numbers of\nthe worst human stock \"(p. 51).\n\nGood human stock to be found in the middle-class.\n\nNEGATIVE EUGENICS: immigration restriction, sterilization\n\nDavenport also advocated what was to become the mainline eugenics view of the\nrole of women in population betterment: motherhood in the service of the nation,\nthe race (often completely conflated [actually, I don't think conflated is the right\nword; nation and race are not empirically distinct things waiting to be conceptually\ndecoupled; as categories, they were mutually constituted, and though now we think\nit important to distinguish them, I think it was by no means clear at the turn of this\ncentury how they were going to get delineated]). Women should not enter higher\neducation because this would divert their energies from their natural duties (this\nVictorian stuff won't go away).\n\nGROUP TWO\nGospel becomes popular: people filling out records of family traits, to be sent to\nDavenport. local organizations, like the \"Race Betterment Foundation\"\n\nFitter families contests at Kansas fair.\n\nEugenics congresses with illustrious participants. \"race hygiene\" (what is RACE?\nseems to oscillate between meaning the HUMAN RACE, a NATION, those people who\nare or should be MOST REPRESENTATIVE OF THE HUMAN RACE. This oscillation, this\nslippage is HOW race comes to mean so many things; it becomes a flexible term. As\na cultural representation, it becomes extraordinarily fluid.\n\nThe continued use of STATISTICS continues to conflate environment, heredity, and\nideas about things. In Omi and Winant's terms, we could see this as a tool for\ncultural representation, a tool that appears to be objective because it is quantified\nand backed up by credentialed experts who claim that they are best suited to\ninterpret it.\n\ndef of civilization in Britannica: \"The organic betterment of the race through wise\napplication of the laws of heredity\" (p. 63).\n\nRACE seems to be slipping in and out of synonymy with NATION, SPECIES and the\nlocation of racial essence is in PROTOPLASM.\n\nNATURE a source of moral lessons: a cultural representation filtered through\nscience\n\nDiversity of ideological attachments to the project; DIFFERENT RACIAL/CLASS\nPROJECTS\n\nsocial-radical wing: abolish class difference and the best stocks will be revealed! (87)\nsuffragettes: women need to be allowed independence so they can make eugenic\ndecisions\nmainline: women are baby-machines, class distinction must be kept in place\n\n(contrast between social-radicals and mainline: is kind of like sexual selection ideas\nin Darwin -- like animals and humans!)\n\nbelief that \"artificial selection was replacing natural selection in human evolution )(p.\n71).\n\nCONTRADICTORY IDEAS about FITNESS\n\nwhat does KEVLES suggest are the social causes of EUGENICS in US?\n\nidea that immigrants were breeding more in US, that they were breeding from\n\"less fit\" portions of their group. idea that these social inefficient were taking\nTAXPAYER'S MONEY. WELFARE. SOCIAL STUCTURAL CONCERNS\n\nAt the beginning of the century, there was a decline in the US 'white' birth rate\nowing to urbanization, and Teddy Roosevelt inferred from this that the upper-class in\nthe US was committing 'race suicide' and that 'race purity must be maintained.' (p.\n74). Early 20th century feminist projects of birth control were often co-opted into\nthis rhetoric and \"what was a 'right' for the privileged became a 'duty' for the poor\"\n(Angela Davis 1981).\n\nIrish Catholics become a \"race\" in part because of ideas about their supposed\nrampant reproductivity?\n\nAside about Margaret Sanger\nMargaret Sanger, initially a socialist who saw birth control as a necessary step in\nwomen's emancipation, saw the bearing and rearing of many children as the cause\nof women's oppression.\n\nAs time went on Sanger brought her concerns with birth control for middle-class\nwomen into line with a concern about population control for minority and lower-class\nwomen.\n\nWhen Sanger left the socialist party, her ideas became more connected to eugenic\nideas. In 1919, Sanger summarized one of the goals of birth control thus: \"more\nchildren from the fit, less from the unfit\" (p. 90) (this designated mental defectives,\netc) (In 1939, she and others planned a 'Negro Project' which was aimed at reducing\nthe birth rate among blacks {Sanger's whole position on this was kind of complex\n[well, not really]: she claimed that while 'negroes' were not inferior to 'whites', the\nsector of the negro population which was 'reproducing' the fastest was that sector\nwhich least knew how to exercise prudent choice about how many offspring to have;\nthe 'negro project' would target these people.\n\nIn sterilization of the feeble-minded, a large number of poor people were targeted,\nas you saw. Given the racial hierarchy of the US, this also meant that large numbers\nof Negroes and Indians were sterilized.\n\n\"If natural selection yielded the Darwinian fit, only artificial selection, - by\ngovernmental means, where appropriate - could multiply the eugenically fit.\"\n\nIQ\nmental age/chronological age\n\nArmy IQ tests as \"the fit really significant contribution to the study of race\ndifferences in mental traits\" (p. 82).\n\nRACE starts to be associated with differences in INTELLIGENCE. measurement again.\nIQ as heritable. national decline became a decline in Intelligence. Again, concerns of\nthe professional academic class interested in these things became the measure for\nall.\n\ncritics; Catholics against biological reductionism\n\nGROUP THREE\n\nReform Eugenics: politics on the left and right\nThere begins to be dissonance between eugenics and the new genetics. Human\ngenetics begins to be treated mathematically, statistics are no longer about an\ninferred heredity, indirectly assayed though family histories, but about gene\nfrequencies. Mathematical models of how genes work in populations can be tested\nagainst statistical data.\n\nHuman genetics (and genetics generally) were brought under the yoke of\nmathematics, and evolution, long described from the point of view of reproductively\nsuccessful individuals and prosperous or declining species, came to be described as\nchanges in gene frequencies over generations.\n\nMany of the population geneticists involved in this revamping were socialist\neugenicists [NOT R.A. Fisher]. These 'reform eugenicists', as Kevles calls them, were\nconfident that eugenics programs could work to better the species, but that real\nhereditary inequality couldn't be properly seen until the social playing field was even;\nnot till there was a classless society could eugenics make any sense.\n\nBecause these people didn't buy idea that existing social divisions by race and class\nwere determined by innate inequality, they favored talk of 'populations' to talk of\n'race.' (p. 175).\n\nIn weird way, these ideas lay behind this notion of EUTELEGENESIS(p. 188). You\nreally COULD treat people as though they were just bags of genes (of course what\nthis does is fetishize sperm).\n\nEvelyn Fox Keller has discerned in this a masculine bias of mathematical\npopulation genetics. In this discourse, all individuals are structurally equal, all\njust bags of genes. Keller writes that, \"Effectively bypassed with this\nrepresentation were all the problems entailed by sexual difference, by the\ncontingencies of mating and fertilization that resulted from the finitude of\nactual populations and also, simultaneously, all the ambiguities of the term\nreproduction as applied to organisms that neither make copies of themselves\nnor reproduce by themselves\" (1992b:132).\n\nBrewer called eutelegenesis the \"the socialization of the germ plasm\" (p.\n190).\n\npopulation genetics: a cultural representation part of a racial project that\nsought in part to dismiss prevailing race prejudice as misleading about \"actual\ngenetic facts\"\n\ncontrast with earlier uses of STATISTICS\n\nTheir eugenic ideas were connected less to class and race issues than those of\nmainline eugenicists. Muller, Haldane, and Huxley believed in conscious social\ndirection of human biological evolution, and they thought that they were developing\nthe tools to understand how to weed out deleterious alleles (population genetics had\nexcellent mathematical models for single locus genetic traits), which manifested\nthemselves in 'undesirable' phenotypes.\n\nOn the way to the revolution, some few things might be done; eugenic counseling\nmight aid couples in deciding if they wanted to bear children together; the state\nmight help eugenically fit families finance having kids (this sense that fitness is best\njudged by humans rather than in the court of reproductive success continued);\nmental deficients might be sterilized (now that I list it, it all sounds very much like\nthe usual totalitarian project).\n\nFISHER\nRA Fisher had a bizarre idea to help 'fit' families {those hereditarily intelligent\nenough to abstain from 'reproducing' in a social environment which punished them\nfor doing so [no accident, I suppose that their intelligence would be served by a\nrefined moral sense [but too bad it went along with low fertility; how paradoxical and\ntroubling!]]}: Fisher suggested governmental support for eugenically fit families that\nwould guarantee them no drop in standard of living with more children; if it took an\nupper class family $100,000 to raise one kid, the government should provide them\nwith $100,000 if they decided to have another one).\n\nthe eugenic paradox: \"If success in the Darwinian sense meant high fertility rates,\nthen in modern Western society evolutionary success went together with social\nfailure, and social success with evolutionary defeat\" (p. 182).\n\nFisher: 'Professionals were 'destroying their racial stock as rapidly as any communist\nwould wish to see the intelligentsia extirpated\"\n\n\"The eagerness to foster higher fertility among the eugenically valuable fortified\nreform eugenicists in their embrace of melioriative economic measures or socialist\nreconstruction. Yet to some on the eugenic left, particularly biologists, social\nmeasures would not by themselves make the eugenicists utopian dream of man's\neugenic improvement a reality.\" (Kevles 1985).\n\nFor Muller and Haldane, a sexual revolution needed to happen alongside a social and\nscientific revolution. So, explicit talk of \"race\" starts to vanish. BUT ideas about\ngender, roles of women and men don't change too much.\n\nNext time:\nwe're going to go back in history somewhat and look at another venue in which\nscience was making pronouncements about race, this time anthropology led by\nFranz Boas in early 20th century and sociology of W.E.B. DuBois. This is a parallel\nhistory and I want us to think about some of the ways the category of race was\ndistinguished from culture -- and therefore reified -- in the context of debates about\nAmerican belonging, immigration."
    },
    {
      "category": "Lecture Notes",
      "title": "lecnotes_03_04.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-240-race-and-science-spring-2004/91744082723aaf1586db0f97c6bf4f29_lecnotes_03_04.pdf",
      "content": "21A.240\nRace and Science\nSpring 2004 MIT\n\nPART 1:\nTHE ALCHEMY OF RACE: MAKING AND UNMAKING SCIENTIFIC RACISM\nLecture 5. March 4\n\nSummary of so far : Close weave between theories of race and ideas about proper or\nnatural SEX/GENDER roles and behaviors. We've seen this all the way from early\npre-scientific ideas about race through Darwin on sexual selection up to eugenics.\n\nConcerns with measuring the relative worth of races -- first through ranking on the\ngreat chain of being, then through craniometry, then through an assessment of their\nevolutionary \"fitness.\"\n\nWe've looked at changing SUBSTANCES of race.\n\nLast time, we looked at the history of eugenics in the United States and in Britain,\nwhich showed us how ideas about \"race\" were articulated to ideas about NATION and\nCLASS. And today, I want us to look at two histories PARALLEL to eugenics. These\nare:\n\n1. history of race in early American anthropology and sociology (Baker, Boas)\nand\n2. histories of immigration, citizenship law (Jacobson)\n\nYou'll have noticed from the Jacobson readings on American nativism, and the\nAmerican making of the term \"Caucasian\" as a scientific synonym for white,\nanthropological visions and revisions of race take place in political context of\nAmerican debates about IMMIGRATION and CITIZENSHIP and more particularly\nabout IMMIGRATION and CITIZENSHIP LAW\n\nSo, American anthropology comes into existence amidst anxieties and debates about\nracial categories and the political and legal debates about immigration.\n\nI want you to see these two histories as contexts for one another -- looking at how\nracial categories created in public debate about immigration, for example, affected\nhow anthropology took on the categories AND looking at how public discourse about\nimmigration and citizenship drew from, ignored, or reshaped anthropological\ncategories.\n\nIn thinking about these two histories as mutually constitutive CONTEXTS, It's useful\nto reflect on what W.E.B. Du Bois said about RACE: \"perhaps it is wrong to speak of\nrace at all as a concept, rather than as a group of contradictory forces, facts and\ntendencies\" (Baker 1997: p. 112). This as a call to understand \"race\" not simply as\nan idea, but as a messy part of everyday life.\n\nSo, If our past two classes have been trying to get you to think about how scientific\narticulations of race also have simultaneously spoken in the registers of gender,\n\nclass, nation, and state, today, I want you to think about the relation between\nSCIENCE, RACE, AND LAW.\n\nSkin Color, Bodily Form: Laws of Science and Laws of the Land in the\nContext of Immigration, Assimilation and Early 20th-Century American\nAnthropology\n\nJacobson, Matthew Frye. 1998. Race and American Nativism, from Anglo-Saxons and\nOthers, 1840-1924. In Whiteness of a Different Color: European Immigrants and the\nAlchemy of Race. Cambridge: Harvard University Press, pp. 68-90.\n\nStocking,\nGeorge,\nJr.\n1994.\nThe\nTurn-of-the-Century\nConcept\nof\nRace.\nModernism/Modernity 1:1: pp. 4-16.\n\nBaker, Lee. 1997. Rethinking Race at the Turn of the Century: W.E.B. Du Bois and\nFranz Boas. In From Savage to Negro: Anthropology and the Construction of Race,\n1896-1954. Berkeley: University of California Press, pp. 99-126.\n\nBoas, Franz. 1913. Changes in Bodily Form of Descendents of Immigrants. In Race,\nLanguage and Culture. New York: The Free Press/Macmillan, 1966, pp. 60-75.\n\nJacobson, Matthew Frye. 1998. Becoming Caucasian, 1924-1965 & Naturalization\nand the Courts. In Whiteness of a Different Color: European Immigrants and the\nAlchemy of Race. Cambridge: Harvard University Press, pp. 91-109, pp. 223-240.\n\nANTHROPOLOGY AND SOCIOLOGY\n\nLet's start with the Stocking piece:\n\nG. Stanley Hall, president of Clark University, remarking on a paper he heard\nin 1895 on \"The Scotch-Irish in America\"\n\nmade it clear that much more was involved in the \"commingling of bloods\"\nthan simply physical characteristics. \"The combination of racial bloods is not a\nmere matter of biology or physiology...because physical inheritance does not\ninclude mere physical mingling of the bloods, but [also] that subtle\natmosphere of associations, of home traditions, of family recollections and\nideals and aims, that are so inseparable.\"\n\n\"Blood\"--and by extension \"race\"--included numerous elements that we would\ntoday call cultural; there was not a clear line between cultural and physical\nelements or between social and biological heredity\n\nStocking is showing us how many, different, separate features of human\nsocial life are confused, conflated by Hall, mixed together.\n\nStocking argues that there were four traditions of thinking about human\ndifference that were used\n\nThe ETHNOLOGICAL: language, food, custom, etc,\n\nThe LAMARCKIAN: inheritance of acquired characteristics, couldn't distinguish\nbetween cultural and biological inheritance (before ideas about heredity).\nPOLYGENISM: idea that God had created human groups separately\nEVOLUTIONISM: but with idea that some groups are more evolved than\nothers.\n\nIt was all of these that FRANZ BOAS was interested in demolishing.\n\nHow?\n\n1. Separate biology from culture.\n\n2. Use Darwinian theory to refute Lamarck,\n\n3. Argue for the unity of humanity\n\n4. Argue that evolution does not imply ranking (that is an old great chain of\nbeing idea) and that cultures must be studied on their own terms.\n\nLet's go back to Hall's idea about\n\n\"The combination of racial bloods is not a mere matter of biology or\nphysiology...because physical inheritance does not include mere physical\nmingling of the bloods, but [also] that subtle atmosphere of associations, of\nhome traditions, of family recollections and ideals and aims, that are so\ninseparable.\"\n\nBoas would SEPARATE these strands\n\nRACE, LANGUAGE, and CULTURE have different histories.\n\nBoas is responsible for defining CULTURE in the way we think about it today.\nBefore Boas, CULTURE meant opera, oil paintings -- and only Europeans had\nit.\n\nBut, having separated CULTURE from BIOLOGY, what did this make RACE for\nBOAS? See his 1913 article, in which he demonstrates that children of\nimmigrants to US look different from their parents. (an intervention in\nimmigration debates)\n\nWhat did RACE become for BOAS? Plastic\n\nWhat's really tricky here is that RACE still exists for BOAS\n\n-MOVEOVER, RACE IS always negative for BOAS.\n\nThis means that he's still trapped in the game -- that there is something\nthere in biology; he's still using the categories of his day (see Baker 119)\n\nW.E.B. DU BOIS had a different approach. What was it?\n\n\"perhaps it is wrong to speak of race at all as a concept, rather than as a\ngroup of contradictory forces, facts and tendencies\" (Baker 1997: p. 112).\n\nRace is fully sociological; invented in the context of power and inequality. (p.\n111).\n\nAnd THIS is where the context of IMMIGRATION LAW in the UNITED STATES\nduring this period comes in.\n\nIMMIGRATION AND NATURALIZATION\n\nThe concept of race forged and re-forged in the context of who could count as\na citizen capable of rational self-government and immigration debates.\n\n1840-1924, question of who could be a Citizen of the US depended upon\nwhether people were considered capable of self-government, organized\naround what we would now call regional/national identities (Germanic,\nMediterranean, Hebrew, Irish, Italian, etc.) but which back then were\nracialized identities.\n\nTo \"naturalize\" -- and note the word! Getting citizenship AS IF being born in\nUS (US grants citizenship on birth on land -- not all nations do this; e.g.\nGermany):\n\n1790 \"any alien being a free white person\"\n1870 added \"aliens of African nativity and persons of African descent\"\n1882: Chinese Exclusion Act, explicitly excluded Chinese, (who had been\ncoming from Canton because of the Gold Rush in California) lasts until 1943\n[about when Japanese internment starts!))\n\nCelts, Hebrews, Italians becoming less white in terms of who should appear\non shore, but more white in terms of who could be citizens (p. 75).\n\nImmigration Restriction League 1893 (p. 77).\n\nanti-miscegenation laws (some state laws on books until 1967, 1948 in CA)\n\nsome of these laws specified that a US citizen woman, if she\n\nmarried an alien ineligible for citizenship would lose her citizenship\n(only other thing you lose citizenship for is TREASON)\n\ntreated women as property of a \"race\"; white women property of white\nmen.\n\nof a piece with anti-immigration laws, regulating \"reproduction\" of the\nnation and its favored constituents.\n\nalso kept \"races\" distinct by forcing immigrant groups into their own\ncommunities, thereby reproducing communities of people who were\njudged according to those categories.\n\nDavenport: nation as race at Cold Spring Harbor\n\n1907 gentlemen's agreement: stopped immigration of Japanese people to US.\n\n1911 Dillingham Commission Report on Races and Peoples; used\nBlumenbach's 5 races, but also recognized \"45 races among immigrants\ncoming to the US\" (p. 78). (p. 79: quote of use in analyzing Boas 1913!!!\n[names the very categories he's using]).\n\nDillingham commission saw immigrants as parents of future Americans (since\ncitizenship is conferred by birth!), and so inquired into their fitness to be\nincluded in national germ plasm (eugenic concern) (pp. 82-83).\n\n1924: Johnson Act: 2% quotas for immigrants based on 1890 census.\n\nAfter 1924, a shift from ranking specific \"races\" like \"Mediterranean\" or \"Irish\"\nto the beginning of the consolidation of a \"Caucasian\" racial formation; all\nthese types BECOME Caucasian.\n\n\"Caucasian\" supposedly a more \"scientific\" term than \"white\" (more than\nskin-deep) [Jacobson p. 94]\n\nRace politics get reorganized around black-white\n\n\"as scientists asserted over and over that \"Aryans,\" \"Jews,\" \"Italians,\"\n\"Nordics,\" and the like were not races, their myriad assertions themselves all\nbuttressed an edifice founded upon three grand divisions of mankind--\n'Caucasian,' 'Mongoloid', and 'Negroid' -- whose differences by implication\nwere racial\" (Jacobson p. 103)\n\n\"Races of Mankind\" exhibit 1943: nationalities are not races, the Jews are not\na race, etc. \"what is an American?\" EXHIBIT WAS A LESSON IN CIVICS.\n\nNaturalization and the Courts\n\nWhy is whiteness so important, legally?\nit's about assignation of property rights\nwhiteness AS property (Lockean property in self, and right to own property)\nlegal disputes: \"Hey, I'm white!\"\n\n\"Between the 1870s and the 1920s the court generated their own\nepistemology of race that drew from scientific doctrine, from popular\nunderstanding, from historical reasoning, from \"common-sense ideas, from\ngeography, from precedent\" (p. 226 quote)\n\nAh Yup 1878 applied to be white: judge said that he was Mongolian and\ncouldn't be Caucasian\nHalladjian 1909 Armenians judged white because they were \"Caucasian\" even\nif not \"European\" but their inclusion was still based on the \"fact\" they were\nlighter than many Europeans -- like the Portuguese -- and also that white\nmeant anyone who wasn't African\n\nLet's take a look in depth at two famous court cases in which people sought\nto be classified as \"white/Caucasian\" in order to \"naturalize\" as citizens.\nThese demonstrate the slide between Aristotelian and Prototypical\n\nclassification employed by those in power to consolidate social hierarchy (see\ndiscussion in Jacobson):\n\nOzawa (1922): \"you may be white, but you are not Caucasian\" science\nThind (1923): \"you may be Caucasian, but you are not white\" common-sense\n\n\"'Caucasian' did accomplish something that the more casual notion of\nwhiteness could not: it brought the full authority of science to bear on white\nidentity.\" (p. 94)."
    },
    {
      "category": "Lecture Notes",
      "title": "lecnotes_03_11.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-240-race-and-science-spring-2004/bf98a5e32bbde6a526fd28d9b2da7bd5_lecnotes_03_11.pdf",
      "content": "21A.240\nRace and Science\nSpring 2004 MIT\n\nPART 1:\nTHE ALCHEMY OF RACE: MAKING AND UNMAKING SCIENTIFIC RACISM\nLecture 6. March 11\n\nPAPER # 1 questions?\n\nHealth and Hygiene: Latin American Lamarckism, Nazi German Darwinism\n\nStepan, Nancy Leys. 1991. Eugenics in Latin America: Its Origins and Institutional\nEcology, Racial Poisons & The Politics of Heredity in Latin America in the 1920s. In\nThe Hour of Eugenics: Race, Gender and Nation in Latin America. Ithaca, NY: Cornell\nUniversity Press, pp. 35-101.\n\nNancy Leys Stepan's book, The Hour of Eugenics: Race, Gender and Nation in\nLatin America is a nice companion to the history Kevles gave us in In the\nName of Eugenics. We see how eugenic ideas articulated to very different\nracial formations in diverse places.\n\nOne useful thing Stepan does here is refuse to see Latin American eugenics\nsimply as a shadow of -- or worse, a kind of degeneration of -- European and\nU.S. eugenic discourse. Using the metaphor of \"ecology,\" she wants us to see\nLatin American eugenics on its own terms, in its own history, located with\nrespect to particularly Latin American concerns and institutions, not as a\nscientific formation whose shape is simply the result of Latin American science\nlagging behind science in Europe and the U.S., which are somehow seen to\nlead the way to real truths behind heredity and race.\n\nHer book presents three case studies: Brazil, Mexico, and Argentina -- of\nwhich I've had you read one, about Brazil. I'd like to discuss this a little bit\nand then tell you something about the Mexico case. Then we'll get to the\nNazis.\n\nBRAZIL.\n\nWhat are factors that form the context for Brazilian eugenics?\n\n1. WWI (concern about national regeneration)\n\n2. underdevelopment and neo-colonial inequality: the creation of an\nextremely poor underclass in a highly racialized and class-stratified nation.\n\n3. state and concerns of science and medicine also conditioned Brazilian\nEugenics. Here, eugenics was associated not with biometrics or Mendelian\ngenetics, but rather with medicine -- including psychiatry (mental hygiene),\nlegal medicine (linked to concerns about \"criminality\"), and obstetrics.\n\n4. racial ideologies already in place. The idea that Brazil was a mixture of\nEuropean, Indian and African \"races\". Brazil was also interpreted by\nEuropeans as a site of tropical decay and racial degeneration (remember the\nhumours?). Brazilian eugenics had to engage with these ideas, either by\nembracing them, sidestepping or complicating them, or somehow reversing\nthem.\n\nPerhaps a good way into discussing Brazilian eugenics -- and its differences\nfrom the US and European versions we've looked at is to reflect on Stepan's\nquotation of a contemporary British author's reflection on the matter (p. 64)\n\n\"Apparently the Brazilians interpret the word 'eugenics' less strictly than we\ndo, and make it cover a good deal of what we should call hygiene and\nelementary sexology, and no very clear distinction is drawn between\ncongenital conditions due to prenatal injury and diseases which are strictly\ngenetic.\"\n\nStepan argues that this was not simply the result of Brazilian science being\n\"behind\" European and U.S. science. In European and US eugenics\nremember, genes and environment had been differentiated into distinct\ndomains.\n\nCULTURE/BIOLOGY: the division in the US around which people would fight.\n\nWeismann had shown the germ line to be independent of somatic line\n\nMendel had supplied the rules by which genes sort themselves in heredity.\nLatin American eugenics didn't fully buy into these findings.\n\nBoas had tried to DIFFUSE RACE as a category, arguing that BIOLOGY is\nplastic.\n\nWhat happened in Latin America, and in Brazil more specifically?\n\nExploring the idea of RACIAL POISON might be a useful way to get at this\nstuff. What was a \"racial poison\"?\n\n\"These poisons were called 'racial' because, though the habits and diseases\nwere often first acquired in one individual's lifetime, they were believed to\nlead to permanent, hereditary degeneration that in the long run could affect\nentire populations or nations\" (p. 85).\n\nHow was this poison to be understood to affect heredity?\n\nTradition of \"Peuriculture\": \"poisons\" present at the moment of conception\nhad negative effects on the germinal materials\" (p. 78) mother-child unit the\nfocus of attention (this idea from France).\n\n\"Eschewing a hard and fast distinction between heredity and the\nenvironment, [Latin American doctors] paid considerable attention to the\nmilieu in which reproduction occurred, because it was seen as a source of\nreproductive poisons that could have disastrous consequences for future\ngenerations. So, eugenics became linked to obstetrics, population policies,\n\nand infant welfare and made common cause with campaigns against\nalcoholism, tuberculosis and VD\" (p. 81) (intoxicants as sources of racial\ndecay. Alcoholism) Eugenics came to mean heath in general.\n\nPrinciples of public health were extended into the sciences of heredity. Goal\nwas \"the prevention of the environment from being a source of hereditary\ndegradation in humans and the sanitization and civilization of the\nreproductive instinct\" (p. 80)\n\nSo, what was RACE here in this notion of the RACIAL POISON?\nPopulation/nation that could be transformed by proper social hygiene. How\nwould you compare this to the eugenic projects we looked at in the Kevles?\n\nLAMARCKISM\n\nWhy was Lamarckism popular in Latin America? (p. 64)\n\nBelief that social environment and health care could affect germ plasm was\ncongenial to the medical sciences, which dominated scientific discussion in\nBrazil.\n\nDesire to believe that changes in social environment would have lasting\neffects (p. 73).\n\n\"Politically, neo-Lamarckism also often came tinged with an optimistic\nexpectation that reforms of the social milieu would result in permanent\nimprovement, an idea in keeping with the environmentalist-sanitary tradition\nthat had become fashionable in the area\" (p. 73).\n\nA complex mixture emerged, with Darwinism responsible for natural selection\nand Lamarckism responsible for the \"origin of the fittest\" Human effort had\nmeaning, progress could occur. This was embedded in the Brazilian ideology\nof \"order and progress\"\n\nIt ALSO provided a flexible model of disease etiology that underscored the\nphysician's own agency. (p. 75) Also seemed to explain heredity of congenital\nsyphilis and alcoholism.\n\nWhy else might this be important in Brazil at this time? And Latin America\nmore generally?\n\nBrazil had been used as an example of the deleterious effects of \"race mixing\"\n\nLamarckism was an interesting way to argue against geographical determinist\nviews of tropical climates leading to degeneration (itself a kind of\nLamarckism!)\n\n\"many Latin American hygienists turned to the gains made in sanitation to\nchallenge the traditional view that race and climate in Latin America combined\nto produce degraded and backward nations\" (p. 89)\n\nThe Brazilians said: The tropical environment itself might actually be a\nsalutary force. It's only dysgenic social surrounds that produce degeneration.\n\nthis view also serves to encourage white immigration, which was desired (p.\n90). The argument here is that tropics aren't bad for white people!\n\nMoreover, it allowed Brazilian doctors to argue, as some did, that \"race\nmixing\" could be healthy -- if races were exposed to proper environments!\n\nLamarckism could account for degeneration as well as regeneration seemingly\nwithout essentializing either.\n\nCompare this Lamarckian model to what we've seen with Boas, the opponent\nof the Mendelian, genetically essentialist eugenics movement? Was Boas a\nLamarckian?\n\nNo, not really, not at all. The malleability he located was in the phenotype,\nnot the genotype.\n\nMEXICO.\n\nMexican eugenics emerged in the aftermath of the Mexican revolution, from\n1910-20, in a leftist revolutionary context. And the socialist eugenics that was\nemerging in other parts of the world was an inspiration to the Mexican\ncontext.\n\nBut one of the more interesting features of Mexican eugenics and its views on\nrace was the idea that there could be such a thing as \"constructive\nmiscegenation\" -- that national populations for example, might be\nstrengthened by race mixing. This turned dominant stereotypes of racial\ndegeneration in Latin America on their head. Argued against ideas of Latin\nAmerica as a zone of decay through mixture.\n\nWhere did this come from? Boasian influence was important.\n\nManuel Gamio was an important Mexican anthropologist. He was a student of\nBoas and argued that there were no \"racial differences\" between different\nindigenous groups in Mexico, just cultural differences. However, these had\ncommon histories and might be brought back together, assimilated into a\ncommon national identity.\n\nThis idea of fusion was racialized in the work of Jose Vasconcelos who\nforwarded the idea of the RAZA COSMICA.\n\nJose Vasconcelos (minister of education, revolutionary, 1920's) accepted the\nargument that the difference between Indians and mainstream was cultural,\nbut far from encouraging detailed study of the differences like Boas and\nGamio, he proposed that policies be developed to \"mexicanize\" the Indians as\nsoon as possible. He urged the immediate learning of Spanish and the almost\nmystical goal of developing a \"mestizo culture\" in which all Mexicans would\nparticipate as equals (from Stepan)\n\nBut in spite of his culturalist view, he imagined this mestizo identity in a\nBIOLOGICAL IDIOM. Interbreeding would produce a hybrid race that took the\n\nbest from each stock. (this idea later took hold in Brazil, too...more Boas-\ntrained scientists...)\n\ncosmic race would be (p. 147):\nNEW a final stage in race formation\nCOSMIC all races would be fused into a new racial unity\nLATIN AMERICA was the logical place for this to happen, since it was already\nwell advanced and all races were present\n\nspiritual eugenics: the most beautiful of each race would seek mates like\nthemselves (Darwin's sexual selection!)\n\nSimilarities/differences from ideas in UK and US eugenics and race thinking?\n\nstill maintained that race existed and that homogeneity was the answer.\nWhile ennobling the indigenous people, they hoped to assimilate and\neliminate the biological type of the Indian\n\nalso denigrated \"Negroes\" and Chinese.\n\nProctor, Robert. 1993. Nazi Medicine and the Politics of Knowledge. In The \"Racial\"\nEconomy of Science: Toward a Democratic Future, Sandra Harding, ed. Bloomington:\nIndiana University Press, 344-358.\n\nGerman eugenics was, like Brazilian based on medicine, and on the notion of\nhygiene.\n\nThe Germans were also concerned with the idea of being PURE OF BLOOD.\n\nThey adhered to the Weismannian view of CULTURE/BIOLOGY and assigned\neverything to BIOLOGY, which they called RACE. And, as we've seen, there\nare disturbing connections between eugenic movements in the United States\nand those in Germany, with the scientists talking to each other. The readings\nI assigned also point out that Franz Boas was involved in trying to mobilize\nscientists against Nazi race science.\n\nAnd this proved difficult. And this connects, I think to he question that always\ncomes up in the wake of the Holocaust, which is:\n\nthe question of COMPLICITY, which often comes up in two ways:\n\nA. WHY didn't ordinary citizens DO anything?\n\noften the argument is about what Hannah Arendt called the \"banality of evil.\"\nnotions of essential human inequality became part of everyday life, part of\nthe most everyday ways of thinking.\n\nthis argument gets extended in recent writing about the continuing place of\nBLOOD IMAGERY in GERMANY; the symbolism that sustained Nazism is STILL\nin circulation in the German imaginary. The argument here is that it has\nbecome part of the CULTURE, part of the LEGACY (we can see what we think\nof that).\n\nNOW, we're NOT going to work this question out; the question of WHY the\nHolocaust happened is perennial -- was it modernity, capitalism, misreadings\nof Darwin, fascism, human nature, Germanness? We won't be able to get at\nthat. We cannot in this class answer WHY the unspeakable horror of the\nHolocaust happened in any definitive way.\n\nwhat we might be able to speculate a bit more on -- what is more germane to\nour purposes -- is another question about COMPLICITY:\n\nB. WHY didn't SCIENTISTS/ANTHROPOLOGISTS do anything? Or WHY did it\ntake them so long? What was the role of anthropology and human biological\nscience in Nazi Germany?\n\nThese are the questions taken up by the Proctor and the Barkan. Proctor\nargues, against the grain of the usual scholarship, that Nazi notions of race\nscience were not completely different from ideas in circulation elsewhere.\nIndeed, he argues that our attempts to label Nazi \"race science\" as \"pseudo-\nscience\" excuses us from giving a proper historical account of how science\nfunctions in social and political context. I'd like us to start, then, with the\nProctor.\n\nPROCTOR: begins by asking: \"How could it happen?\" (p. 199).\n\n\"Anthropologie had come to be seen as providing a \"cure\" for many of the ills\nfacing German society\" (p. 145). Mendelian genetics was used as a warrant\nfor the idea that these ills were fixed in different lineages of people, were\nessential to racial germ plasms.\n\nCharacterize Eugen Fischer's ideas about RACE (p. 146).\n\nFischer believed that physical and spiritual racial traits were inherited\naccording to \"classical Mendelian inheritance by independent assortment\"\n\nRaces mix without blending. Races might mix, but they could never blend.\nSo, \"the Jews were a mixture of the Oriental and the African\"\n\nINTERESTING that the dominant traits are those from the \"lower races\" (see\nchart on p. 159). THIS is what leads to degeneration.\n\nWhat's striking here is the incredible flexibility of the \"race\" concept. Different\nstereotypes can be deployed at different moments.\n\nAnd of course, in order to do this kind of \"racial science,\" there must be\ncategories. And here we see what Bowker and Star characterized as the\nmixing of Aristotelian and prototypical categories.\n\nEugen Fischer said that it was dangerous to advance a political cause in the\nname of science or to conflate science with political doctrine (p. 173).\n\nObviously, this is hypocrisy. But it actually rephrases Proctor's argument that\nNazi \"race science\" was not an anomaly insofar as it was shot through with\n\npolitics; so was the counter-argument. But this of course doesn't make them\ncompletely symmetrical, either.\n\nBarkan, Elazar. 1988. Mobilizing Scientists against Nazi Racism, 1933-1939. In\nBones, Bodies, Behavior. George Stocking, ed. Madison: University of Wisconsin\nPress, 180-205.\n\nwhat obstacles did Boas meet in trying to get a statement about race made\nby the associations of which he was a part and by the scientific community in\ngeneral?\n\npeople to whom he turned did not want these issues brought into the realm of\npolitics. And Boas, as a Jew, kept disqualifying himself from committees... in\norder to be seen as \"objective\"\n\nWhat finally turned the tide and allowed many scientists to feel they could\nspeak against Nazi race science was an article, about physics published in\nNature \"The Pragmatic and Dogmatic Spirit in Physics\" (see p. 197). Why was\nTHIS seen as offensive?\n\nNow, scientists could fasten on the idea that science was not to be based on\nnational ideas and could flourish only where there was intellectual freedom.\nTHIS is of course is about PROTECTING the perceived apolitical character of\nscience, RATHER than any kind of acknowledgment that the science of human\nraces was political in and of itself.\n\nSo, Nazi ideas about race could be indirectly denounced as \"pseudo-science.\"\nPhysical anthropology in the US did not have to speak as one about the\n\"facts\" of what \"race\" was or was not in order to condemn German\nanthropological theories of race. (indeed, many physical anthropologists had\nideas about race not dissimilar from German anthropologists)\n\nNEXT TIME: We're going to travel into the realm of the genomic."
    },
    {
      "category": "Lecture Notes",
      "title": "lecnotes_03_18.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-240-race-and-science-spring-2004/a38a1b194890ef06fa4f5e400eea31e4_lecnotes_03_18.pdf",
      "content": "21A.240\nRace and Science\nSpring 2004 MIT\n\nPART 1:\nTHE ALCHEMY OF RACE: MAKING AND UNMAKING SCIENTIFIC RACISM\nLecture 7. March 18\n\nPAPER # 1 DUE\n\nFrom Population to Genome: Race after World War Two\n\nWe'll be talking about the evaporation of typological race categories in evolutionary\nand population biology and in anthropology after World War II -- and particularly\nthinking about how this evaporation becomes manifest in the UNESCO statements\nabout race which we've already heard so much about. We've already gotten glimpses\nof this move -- in our readings of Kevles and Proctor - from seeing RACE as a\ntypological category -- enabling ranking and so forth -- to seeing RACE as an illusory\nconcept based on misapprehensions of the proper object of evolutionary inquiry: the\nPOPULATION, characterized by shifting gene frequencies.\n\nThe shift from POPULATION thinking to GENOMIC thinking.\n\nTo summarize and anticipate: we want to look today at the shift from RACE to\nPOPULATION to GENOME in scientific discourses about human biological unity and\ndiversity. We're also going to be concerned with continuities between these\ncategories -- and particularly with whether typological race categories actually do go\naway through these shifts. I think we'll find that they don't entirely. But I think we'll\nalso see some NEW WAYS in which RACE gets articulated.\n\nIt's useful to have the typology that Haraway provides us in mind as we go:\n\nRACE, POPULATION, GENOME\n(eugenics/population genetics/molecular genetics)\n\nHaraway, Donna. 1994. Universal Donors in a Vampire Culture, Or It's All in the\nFamily: Biological Kinship Categories in the Twentieth-Century United States. In\nUncommon Ground: Toward Reinventing Nature. William Cronon, ed. New York:\nNorton, pp. 321-366.\n\nRACE\non RACE as an organizing principle: we've really gone over this category and\nits various instantiations with a fine-toothed comb. And we've seen a bit of\nPOPULATION thinking, too. But POPULATION is where I want to begin. The\nUNESCO statements are a good starting point. Look at Provine and Montagu\nto help us along:\n\nsummarizing the shift from TYPOLOGICAL RACE thinking to POPULATION\nthinking:\nMontagu: \"such differences as exist between different groups of mankind are\ndue to the operation of evolutionary factors of differentiation such as\n\nisolation, the drift and random fixation of the material particles which control\nheredity (the genes), changes in the structure of these particles, hybridization\nand natural selection\"\n\n\"from the biological standpoint, the species Homo sapiens is made up of a\nnumber of populations, each one of which differs from the others in the\nfrequency of one or more\ngenes ... a race from the biological standpoint,\nmay therefore be defined as one of the group of populations constituting the\nspecies Homo sapiens\"\n\n\"The term 'race' designates a group or population characterized by some\nconcentrations, relative as to frequency and distribution, of hereditary\nparticles (genes) or physical characters, which appear, fluctuate, and often\ndisappear in the course of time by reason of geographic and/or cultural\nisolation. The varying manifestations of these traits in different populations\nare perceived in different ways by each group\"\n\nso WHAT IS RACE now?\n\na population that differs from others with respect to gene frequencies.\nnote that differences are:\nIMPERMANENT and SUBJECTIVE (relative to the categories chosen [since\nfocus on different gene frequencies/populations would result in different\ngroups]). Kind of confusing since the statement seems to simultaneously\npoint to \"real\" groups at the same time that it emphasizes relativity of\nmeasure.\n\ncompare Boas? RACE exists and does not at the same time.\n\nthe focus is now shifted to what humans have IN COMMON:\n\n\"the one trait which above all others has been at a premium in the evolution\nof men's mental characters has been educability, plasticity. It is indeed a\nspecies characteristic of Homo sapiens\"\n\ndifferences between 1950 and 1952 statements? 1950 had cooperation in it\nand metal equality. 1952 dropped cooperation and remained agnostic on\nmental traits.\n\ndifference between race and population thinking: \"Rather than phylogenies\nand types, it was processes and populations -- constructed out of gene flow,\nmigration, isolation, mutation, and selection -- which were to be the\nprivileged scientific objects of knowledge\" (p. 202)\n\nIt was this view, this focus on what humans had in common, which shifted\nthe research agenda of physical anthropology from typological questions, to\nquestions of adaptation.\n\nthe search for a common human adaptational complex in early humans: the\nsharing way of life, hunting, bipedalism, brain growth. As Haraway points out,\neven as ideas about race were muted, the search for the common human\nadaptational complex remained grounded in traditional ideas about sex role.\nHence, Man the Hunter (recall Darwin on sexual selection!)\n\nDID RACE GO AWAY? Why not? Is POPULATION inconsistent with RACE?\n\nClearly not; even in the 1950 statement we see the same old Mongolian,\nCaucasian, Negroid categories, though these are now declared temporary,\nimpermanent (begging the question of whether they are originary, I think.\nPolygenist commitments were to be disavowed when if you could still use the\nsame categories and claim they were \"plastic\"). Hooton and Coon held on to\nrace\n\nTHE PLACE OF GENES\nSo, GENES take on a new visibility here, though ostensibly not as essences.\nAny account about human unity and diversity now must get constructed\naround the adaptational histories that would lead to the temporary fixing of\nnew genetic complexes of traits.\n\nInterlude on sociobiology...\n\nGENOMICS\nHaraway argues that we are moving into a NEW REGIME of REPRESENTATION\nOF UNITY AND DIVERSITY IN HUMAN (and other) BIOLOGY: GENOMICS\n\nShe argues that GENOMICS has a different logic than that of POPULATION.\nCan someone explain what she means?\n\nFirst what is a genome?\nFull complement of genes that code for proteins in chromosomes.\n\nWhat is a gene?\nchromosomes made of DNA made of codons that code for amino acids,\nwhich make proteins. Gene maps are supposed to locate segments of\nthe genome that code for stuff like hemoglobin. Gene sequences are\nlists of the nucleotides (bases: purines and pyrimadines) that make up\na gene.\n\nHaraway writes that \"If universal humanity was plastic under the sign of the\npopulation at mid-century, then human nature is best described as virtual at\npresent\" (p. 348). Why is this? Well, because, as she puts it, \"human nature\nis embodied, literally, in an odd thing called a genetic database\" (p. 348).\n\nWe think about genes through databases: \"something peculiar happened to\nthe stable, family-loving. Mendelian gene when it passed into a database,\nwhere it has more in common with LANDSAT photographs, Geographical\nInformation systems, international seed banks, and the World Bank than with\nT.H. Morgan's fruit flies at Columbia University in the 1910s or UNESCO's\npopulations in the 1950s\" (p. 349).\n\nmaterial instantiations of genomes: in a body, \"in yeast artificial\nchromosomes or bacterial plasmids, which can hold and transfer cloned\ngenes. The entire genome of an organism might be held in a library of such\nartifactual biochemical information structures\" (p. 351)\n\nIn this practice, \"Embodied information with a complex time structure is\nreduced to a linear code in an archive outside time\" So what?\n\nWhat are implications for thinking about human diversity and unity?\n\nShe writes: \"the genome projects produce entities of a different ontological\nkind than flesh-and-blood organisms, \"natural races\" or any other sort of\nnormal organic being\" They produce DATABASES\n\nand \"genetic engineering is not eugenics\" (because, for one thing, its not\nabout heredity and birth)\n\nMight be good to use EXAMPLES to figure out what she means. HGDP,\nGuaymi, Iceland, SNiPs on chips.\n\n1. Human Genome Diversity Project: the result of population geneticists'\ncritique of molecular geneticists' grasp of how variation is distributed\nacross human populations\n\n2. Guaymi case -- is this about \"race\"? don't need \"race,\" even as project\nmay be racializing.\n\n3. Iceland case: a private company was able to obtain the rights to a\ncomprehensive genetic database of Iceland's population. So, the genetic\ndatabase is privately owned. Iceland was thought to be relatively\nhomogeneous (but Vikings!)\n\nDuster, Troy. 2001. The Sociology of Science and the Revolution in Molecular\nBiology. In The Blackwell Companion to Sociology. Judith R. Blau, ed. Malden, MA.:\nBlackwell Publishers Limited, pp. 213-226.\n\nSNiPs on chips.\nDUSTER argues that in the age of genomics, we are seeing the reconstruction\nof race as a biological/genetic category, though this time not through appeals\nheredity or lineage. Race is being biologized/geneticised in new ways. He\ncenters his argument on this technology called SNiPs on chips. What are\nthose?\n\nSNiPs are single nucleotide polymorphisms -- sites where people's genomes\ndiffer from one another by a single nucleotide substitution (sickle-cell is an\nexample).\n\nIf you're interested in seeing whether a complex of SNiPs is connected to\nsomething like heart disease, you'll want to look at a number of SNiPs at\nonce. This is where SNiPs on chips come in. What are those?\n\nDNA chips. Different bits of DNA are affixed to a chip and then compared to a\nsample of DNA for a particular person (complementary base pairing). You can\nput together different DNA chips to look for sets of different SNiPS. SNiP\nprofiles.\n\nDuster argues that this is already being used in line with social categories of\nrace and reinscribing them, though in new ways. How? (begins on p. 16,\n\"Molecular genetics and the new conflation of race and forensics\")\n\n\"It is possible to make arbitrary groupings of populations (geographic,\nlinguistic, self-identified by faith, identified by others by physiognomy) and\nSTILL find statistically significant allelic variations between those groupings\"\n\n\"when researchers claim to be able to assign people to groups based on allele\nfrequency at a certain number of loci, they have chosen loci that show\ndifferences between the groups they are trying to distinguish\"\n\nso WHAT DOES THIS MEAN FOR \"RACE\"?\n\nGo back to the Bowker and Star: Prototypical racial categories (which can be\ndifferent for the FBI, for Scotland yard, etc.) are being used to divide up a\ngroup of people; these categories are then fed into questions about which\ngenetic loci can help make the distinction; this DNA distinction is then used to\nidentify people according to that prototypical category, which at that moment\nis conflated (perhaps) with an essential category -- and perhaps the\nassumption that the racial category is real, based in lineage, etc. But it\ndoesn't need to be so based in order to be recognizable.\n\nSo, here we're getting the potential for a reconstruction of RACE (according to\nsocial categories) in a biogenetic idiom that doesn't explicitly appeal to\nlineage of heredity (since there are many reasons and histories that could\naccount for the presence of SNiPs and heredity and lineage are not always the\nmost parsimonious).\n\nSo, it's circular. Race becomes a self-fulfilling prophesy, with one powerful\nscientific account flattened into the technology of the chip. So, ideas about\nhumours, bloodlines, germ plasms, crania don't need to be in place for racial\nand racist categories to be re-biologized in the age of genomics! Discussion?"
    },
    {
      "category": "Lecture Notes",
      "title": "lecnotes_04_01.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-240-race-and-science-spring-2004/32e157b364dac3fbd0e6e8f65b620ae6_lecnotes_04_01.pdf",
      "content": "21A.240\nRace and Science\nSpring 2004 MIT\n\nPART 1:\nTHE ALCHEMY OF RACE: MAKING AND UNMAKING SCIENTIFIC RACISM\nLecture 8. April 1\n\nOK, today, we're looking at RACE and MEDICINE, and we're also going to examine\nwhat has happened to the concept of RACE in the TWENTIETH CENTURY.\n\nJust to anticipate: we're going to look at the shift from RACE to POPULATION to\nGENOME in scientific discourses about human biological unity and diversity. We're\ngoing to look at the evaporation of typological race categories in evolutionary and\npopulation biology and in anthropology after World War II -- and particularly at the\nway this evaporation becomes manifest in UNESCO statements about race which\nwe've heard so much about and which are summarized in the Will Provine piece I've\nhad you look at.\n\nRoughly speaking, we will examine the move from seeing race as a RACE as a\ntypological category -- enabling ranking and so forth -- to seeing RACE as an illusory\nconcept based on misapprehensions of the proper object of evolutionary inquiry: the\nPOPULATION, characterized by shifting gene frequencies, to, finally, today emphasis\non GENOMICS.\n\nWe want to look at continuities and discontinuities.\n\nSo, in the first hour of class, we'll look at the Kapsalis and watch the Tuskegee\nmovie.\n\nIn the second hour, we will look at the UNESCO statement and look at ideas about\nPOPULATION. I'll also have you critique a recent populational model of race.\n\nIn the third hour, we will read through the Duster and the Montoya, thinking about\nRACE in the age of GENOMICS.\n\nAs if that wasn't enough to do, I am now going to give you PAPER TOPICS for the\nnext paper, which is due in two weeks. Items we will discuss today and next time\nwill be very helpful, so pay attention!\n\nRace, Population, Genes and Medicine\n\nKapsalis, Terri. 1997. Mastering the Female Pelvis: Race and the Tools of\nReproduction. In Public Privates: Performing Gynecology from Both Ends of the\nSpeculum. Durham, NC: Duke University Press, 31-59.\n\nA sense of Black people (and nonwhites, more generally) as both DIFFERENT\nand SIMILAR from Whites -- though explicit racial stereotypes about and\nexplanations for difference (e.g., black slave women are more durable than\ntheir white counterparts [so don't need anesthetics, etc.]\n\nstory of Sims \"father of gynecology\"\n\nThree claims in this article:\n1. the institution of slavery served medicine in providing subjects for\nexperimentation\n2. the use of the speculum was founded on slave women's bodies\n3. Sims surgical experimentation was precedent for medical institution\ninvolvement in racist eugenicist practices concerned with the reproductive\ncapacities of poor women of color.\n\nslaves' \"triple pathology\" (1. skin color 2. female sex, taken in combo with\nskin color 3. vaginal fistula) allowed Sims to perform multiple operations\n\n\"the simultaneous sameness and difference is what made the slave women\nsuch fitting \"human guinea pigs\" (p. 42),\n\n\"...Sims's eulogist's statement that 'the time was ripe' for Sims's\nexperimentation. Implicit in this statement is the idea that the ends,\ngynecology and the furtherance of medicine, justified the means, slavery. The\nimplication is that it is fortunate for humanity in general that slavery existed if\nonly because it helped foster medical intervention\" (p. 48)\n\nNorplant\nBlack Women's Health Project: \"the line between incentive and coercion is\nfuzzy\"\n\n\"Dominant white forces go to faraway lands to identify the sameness with the\nexotic 'other' while simultaneously establishing and maintaining the others'\ndifferences and reaping the benefits\" (p. 55)\n\n\"women in Indonesia, Bangladesh, and numerous other countries had\ndifficulties getting Norplant removed due to resistant trial investigators whose\nscientific data 'would be rendered incomplete'\" (p. 55).\n\nNorplant as new eugenics\n\ncontrast repro politics under slavery and now with Norplant\n\ncompare to Tuskegee.\n\nProvine, Will. 1986. Genetics and Race. American Zoologist 26: 857-887.\n\nIn this piece, Provine leads us through some very familiar stories. But I want\nus to start in with UNESCO Statements about RACE. Now, in the wake of\nWW2, these documents reposition what scientists will take human biological\ndifference to be. Look at Montague.\n\nPOPULATION\nsummarize the shift from TYPOLOGICAL RACE thinking to POPULATION\nthinking\n\nMontagu: \"such differences as exist between different groups of mankind are\ndue to the operation of evolutionary factors of differentiation such as\nisolation, the drift and random fixation of the material particles which control\nheredity (the genes), changes in the structure of these particles, hybridization\nand natural selection\"\n\n\"from the biological standpoint, the species Homo sapiens is made up of a\nnumber of populations, each one of which differs from the others in the\nfrequency of one or more genes ... a race from the biological standpoint, may\ntherefore be defined as one of the group of populations constituting the\nspecies Homo sapiens\"\n\n\"The term 'race' designates a group or population characterized by some\nconcentrations, relative as to frequency and distribution, of hereditary\nparticles (genes) or physical characters, which appear, fluctuate, and often\ndisappear in the course of time by reason of geographic and/or cultural\nisolation. The varying manifestations of these traits in different populations\nare perceived in different ways by each group\"\n\nso WHAT IS RACE now?\n\na population that differs from others with respect to gene frequencies.\nnote that differences are:\nIMPERMANENT and SUBJECTIVE (relative to the categories chosen [since\nfocus on different gene frequencies/populations would result in different\ngroups]). kinda confusing since the statement seems to simultaneously point\nto \"real\" groups at the same time that it emphasizes relativity of measure.\n\ncompare Boas? RACE exists and does not at the same time.\n\nthe focus in now shifted to what humans have IN COMMON:\n\n\"the one trait which above all others has been at a premium in the evolution\nof men's mental characters has been educability, plasticity. It is indeed a\nspecies characteristic of Homo sapiens\"\n\ndifferences between 1950 and 1951 statements? 1950 had cooperation in it\nand metal equality. 1951 dropped cooperation and remained agnostic on\nmental traits.\n\ndifference between race and population thinking: \"Rather than phylogenies\nand types, it was processes and populations -- constructed out of gene flow,\nmigration, isolation, mutation, and selection -- which were to be the\nprivileged scientific objects of knowledge\" (p. 202).\n\nIt was this view, this focus on what humans had in common, which shifted\nthe research agenda of physical anthropology from typological questions, to\nquestions of adaptation.\n\nDID RACE GO AWAY? Why not? Is POPULATION inconsistent with RACE?\n\nClearly not, even in the 1950 statement we see the same old Mongolian,\nCaucasian, Negroid categories, though these are now declared temporary,\n\nimpermanent (begging the question of whether they are originary, I think.\nPolygenist commitments were to be disavowed when if you could still use the\nsame categories and claim they were \"plastic\"). Hooton and Coon held on to\nrace.\n\nLook at Rushton.\n\nAssumption here is that being r-selected (rearing many young with low\nparental investment) is itself genetic. The problematic logic works like this:\n\n1) description of what a particular \"human nature\" is like (some groups are\nr-selected)(based on looking around... not asking whether the thing is the\nwrong question, social , or what)\n2) claim that the fact that the characteristic in question is prevalent points to\na strong possibility that it is genetic.\n3) claim that the characteristic has come about through a process of natural\nselection (in this case, low selection pressure associated with prosperity\nselects FOR a predisposition to reproduce more [apparently not in whites,\nthough -- which makes the traits essential, not evolved, and\ndemonstrates that Rushton sees the trait of r-selectedness as essential to\nNegroids. It's not really an evolutionary story at all)\n\nDuster, Troy. 2001. The Sociology of Science and the Revolution in Molecular\nBiology. In The Blackwell Companion to Sociology. Judith R. Blau, ed. Malden, MA.:\nBlackwell Publishers Limited, 213-226.\n\nSNiPs on chips.\nDUSTER argues that in the age of genomics, we are seeing the reconstruction\nof race as a biological/genetic category, though this time not through appeals\nheredity or lineage. Race is being biologized/geneticised in new ways. He\ncenters his argument on this technology called SNiPS on chips. What are\nthose?\n\nSNiPs are single nucleotide polymorphisms -- places where people's genomes\ndiffer from one another by a single nucleotide substitution (sickle-cell is an\nexample).\n\nIf you're interested in seeing whether a complex of SNiPs is all connected to\nsomething like heart disease, you'll want to look at a number of SNiPs at\nonce. This is where SNiPs on chips come in. What are those?\n\nDNA chips. Different bits of DNA are affixed to a chip and then compared to a\nsample of DNA for a particular person (complementary base pairing). You can\nput together different DNA chips to look for sets of different SNIPS. SNIP\nprofiles.\n\nDuster argues that this is already being used in line with social categories of\nrace and reinscribing them, though in new ways. How? (begins on p. 16,\n\"Molecular genetics and the new conflation of race and forensics\")\n\n\"It is possible to make arbitrary groupings of populations (geographic,\nlinguistic, self-identified by faith, identified by others by physiognomy) and\nSTILL find statistically significant allelic variations between those groupings\"\n\n\"when researchers claim to be able to assign people to groups based on allele\nfrequency at a certain number of loci, they have chosen loci that show\ndifferences between the groups they are trying to distinguish\" FEEDBACK\n\nso WHAT DOES THIS MEAN FOR \"RACE\"?\n\nGo back to the Bowker and Star: Prototypical racial categories (which can be\ndifferent for the FBI, for Scotland yard, etc.) are being used to divide up a\ngroup of people; these categories are then fed into questions about which\ngenetic loci can help make the distinction; this DNA distinction is then used to\nidentify people according to that prototypical category, which at that moment\nis conflated (perhaps) with an essential category -- and perhaps the\nassumption that the racial category is real, based in lineage, etc. But it\ndoesn't need to be so based in order to be recognizable.\n\nSo, here, we're getting the potential for a reconstruction of RACE (according\nto social categories) in a biogenetic idiom that doesn't explicitly appeal to\nlineage of heredity (since there are many reasons and histories that could\naccount for the presence of SNIPS and heredity and lineage are not always\nthe most parsimonious).\n\nSo, it's circular. Race becomes a self-fulfilling prophecy\n\n\"\"race\" in molecular biological clothing\" (Duster, p. 218).\n\nMontoya, Michael. 2003. Purity and Danger: Genes and Disease on the US/Mexico\nBorder. Presented at panel on \"Populations, Race, and the New Genetics\" at Society\nfor Social Studies of Science Annual Meeting, Atlanta GA, October 15-18 2003.\n\nNEXT TIME: we change gears to think about what it means to be a scientist, what it\nmeans to do science, what it means to be affected by science, and how ideologies of\nrace shape these experiences, even when they are not about any presumptive\n\"biology\" of race. You'll see what I mean."
    },
    {
      "category": "Lecture Notes",
      "title": "lecnotes_04_08.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-240-race-and-science-spring-2004/aa182fbd1d5e018c0e8eea7e8a496f39_lecnotes_04_08.pdf",
      "content": "21A.240\nRace and Science\nSpring 2004 MIT\n\nPART 2: REFORMULATING RACE: MAKING AND REMAKING THE IDIOMS OF\nSCIENCE\nLecture 9. April 8\n\nReview of first part of class. What is race?\n\nScientific American cover.\n\nAlternative Histories and Futures for the Racial Economy of Science\n\nWe're beginning the second half of the course now, and we're shifting gears. Let me\nmap out what our questions will be and where we're going. We're moving away from\nthinking so much about RACE as an OBJECT of scientific scrutiny to thinking about\nthe RACIALIZED context and content of scientific and technological practices more\ngenerally.\n\nIn other words, we want to think not just about how SCIENCE shapes RACE -- our\nconcern in the first half of the course -- but also how RACE can shape SCIENCE.\nHere's how I put it on the syllabus:\n\nThe second portion of this class, \"Reformulating Race: Making and Remaking\nthe Idioms of Science,\" looks more keenly at the place of race in formulating\nthe problems, approaches, and epistemologies animating scientific work more\ngenerally, even when it is not centrally about race as such. We try to\nunderstand how the practice of science -- and the fashioning of technologies\n-- can be racially marked in both oppressive and liberatory ways, by both\ndominant and marginalized groups. We want to know, for example, how\n\"whiteness\" might get written into science, and whether doing science from\nhistorically subordinated racial positions might allow us to see science and\ntechnology as well as the history of science and technology, differently. We\nexamine these questions with particular attention to North American political\ncontexts and racial formations.\n\nWhat does all that mean? I think the best way to begin is with history, with\n\nSchiebinger, Londa. 1993. Who Should Do Science? In Nature's Body: Gender in the\nMaking of Modern Science. Boston: Beacon Press, pp. 184-200.\n\nLet's start very simply with the title of this chapter: Who should do science?\n\nSchiebinger uses the question to organize two historical inquiries.\n\n1. The first into European debates about \"the race of those who invented the\nsciences.\"\n\nHumours (p. 186)\nMeasurement of crania (p. 188): racial science used to make judgments\n\n2. The second into debates about whether white women and black men could\nbe scientists.\n\nRecall the arguments about the role of analogy in science; comparisons\nbetween African men and European women\n\nNow, Schiebinger organizes much of her discussion around Martin Bernal's\nargument in Black Athena. What was that?\n\nOK, WHY would \"Afroasiatic\" contributions to science be neglected?\n\nRise of racial science retroactively used to determine \"race\" of ancient\nEgyptians through craniometry, etc. where these progenitors of science \"black\nor white\"?\n\nSchiebinger claims that the main contribution of Black Athena has been to\nquestion why Europeans were unwilling to grant an African ancestry to\nWestern science. Fine. But what are some problems with Bernal's argument?\n\nHis Afrocentrism actually reinscribes Eurocentrism, enfranchising Egyptians\n(as black) traditions into the lineage leading toward Western science. So both\nTHE WEST/EUROPE and SCIENCE are the ultimate reference points and\ndestiny in this argument. (p. 189)\n\nThis brings up problem of what counts as science. Recall Voltaire about\nwhether women had made any contributions to science -- which Voltaire\ncalled art, and by which he meant such things as \"things mechanical,\ngunpowder, printing, and the clock.\" He said, \"all the arts have been invented\nby man, not by woman.\" Aside from being potentially false, this statement\nrigs the game by positing a narrow definition -- only admitting things\nculturally associated with masculine enterprise as science. It's a circular\ndefinition, seen this way.\n\nThis connects up with education: \"Excluded from centers of learning, women\nan Africans could say little about their own nature, at least not in the idiom of\nmodern science.\" (p. 100)\n\nSo, the representation issue is actually linked to the question of who could do\nscience, who could count as a scientific knower.\n\nHarding refers to this bundle of assumptions and social effects as a RACIAL\nECONOMY:\n\n\"By 'racial economy,' I mean those institutions, assumptions, and practices\nthat are responsible for disproportionately distributing along racial lines the\nbenefits of Western sciences to the haves and the bad consequences to the\nhave-nots, thereby enlarging the gap between them. By 'Eurocentrism,' I\nmean the assumption that Europe functions autonomously from other parts of\nthe world; that Europe is its own origin, final end, and agent, and that Europe\nand people of European descent in the Americans and elsewhere owe nothing\nto the rest of the world\" (p. 2).\n\nCan someone try to put this into their own words?\nCan someone try to rephrase this/bring it into dialogue with Omi and Winant's\nnotion of racial formation?\n\n\"we argue that racial formation is a process of historically situated projects in\nwhich human bodies and social structures are represented and organized.\" (p.\n56). \"from a racial formation perspective, race is a matter of both social\nstructure and cultural representation\" (p. 56). Racial formations are made of\nracial projects. A racial project is \"simultaneously an interpretation,\nrepresentation, or explanation of racial dynamics, and an effort to reorganize\nand redistribute resources along particular racial lines\" (p. 56).\n\nOK, So Schiebinger writes that \"Excluded from centers of learning, women an\nAfricans could say little about their own nature, at least not in the idiom of\nmodern science\" (p. 100) -- this phrase \"the idiom of modern science\"\nconnects us directly to:\n\nStepan, Nancy Leys and Sander L. Gilman. 1993. Appropriating the Idioms of\nScience: The Rejection of Scientific Racism. In The \"Racial\" Economy of Science:\nToward a Democratic Future, Sandra Harding, ed. Bloomington: Indiana University\nPress, pp. 170-193.\n\n\"Since racial science was invariably a science of inequality, produced by\nEuropean men in an age of widespread racism, to a large (but not\npredetermined) extent, the scientists' own racial identities and identifications\nprevented them from asking critical questions about their own science -- its\nassumptions, methods and content\" (p. 171).\n\n\"One place one encounters a 'critical tradition' in relation to scientific racism is\nin the writings of those stereotyped by the sciences of the day\" (p. 171).\n\ne.g. Antenor Fermin\n\n\"How could science be used to transform the racial valuations built into\ndiscussions of human variation? Can we discern in the writings of minorities a\nvariety of different tactics, and if so what were they?\" (p. 172).\n\nWhat is scientific resistance and what forms did it take in response to\nscientific racism?\n\nAPPROPRIATING the IDIOMS\n\n\"Exclusion from the academy meant exclusion from the authoritative use of\nthe idioms of science. Whenever racial minorities and women wrote critically\nabout the sciences of themselves, their writing ran the risk of being ignored\nor dismissed because it came from 'outside' professional science, and was\ntherefore by definition 'unscientific.' ... For the African-American or Jew\nwriting as a scientist, or from within science, the writer's own status as\nobjective observer was at stake. The problem of both using science as a\nlanguage of self-assertion and identity, while exposing its essential political\ncharacter in relation to racial claims, was rarely addressed by resisting groups\nbecause rarely recognized\" (p. 178).\n\n1. internalization of scientific idiom (p. 179) self-hatred, and sometimes\ndeflections of stereotypes onto others within one's stigmatized group (e.g.\nwomen)(note that race and gender are difficult to separate!)\n\n2. transvaluation (reverse stereotyping) (p. 181)\n\n3. recontextualization (p. 183): questioning data to produce new facts,\nquestioning contexts of explanations for facts (e.g. Kelly Miller's analysis\nof Hoffman's work on Race Traits and Tendencies of the American Negro,\nalso Du Bois' work on health) and universalizing traits thought specific to\none group (Dr. Martin Delany's claim in 1879 Principia of Ethnology that\n\"The color of the blackest African is produced by identically the same\nessential coloring matter that gives the 'rose cheeks and ruby lips' to the\nfairest and most delicate beautiful white lady\" Today, this would be\nphrased as: we all have melanocytes, they just have different degrees of\nactivity. Skin color is something that unites, not divides us.)\n\nSo, three strategies:\n\n1. question the facts, generate new facts on which different claims could be\nmade.\n2. question the explanation of the facts e.g. on Negro health (not innately\nfragile, but socially compromised: Du Bois' The Health and Physique of the\nNegro American)(p. 184)\n3. universalization; a trait assigned to one race and held as negative gets\napplied to all humans and made positive (Delany's work)\n\n4. alternative ideology not made by \"appropriation and reassemblage of\nelements of the existing science, but by positing a radically different world\nview, with different perceptions of reality, goals, and points of reference\"\n(p. 185).\n\nSo, racially stigmatized people knew that science was political.\n\nThis is the idea of an ALTERNATIVE SCIENCE.\n\nSo, go back to Omi and Winant's idea of Racial Formation, a social\norganization that allocates different privileges to different sorts of persons,\nimagined as having essential difference (also a RACIAL ECONOMY). Our\nquestion now becomes how racial formations themselves shape science --\nwe've already seen this IMPLICITLY with all the stuff we've looked at so far --\nbut we want to see how far we can theorize these influences.\n\nWe want to think about how RACE can shape SCIENCE, and not just how\nSCIENCE shapes RACE.\n\nAnd in lots of different ways! For ill or good. What does the history of science\nlook like if we think, for example, about African and African-American\ncontributions to knowledge? What does science look like when we compare it\nwith Native American knowledge systems -- particularly with regard to\nenvironmentalism. What do scientists look like when we think about\nstereotypes of Asian-Americans as good at math and physics?\n\nThese are tremendously complicated questions. There are a few different\nways we can phrase the question\n\n1. CRITIQUE OF UNDERREPRESENTATION: people who have been racially\nsubordinated have been and are still largely excluded from the practices of\nscience, which happens to be a highly authoritative way of knowing with a\ngreat deal of social power. This critique questions the REPRESENTATION\nof different kinds of people in science.\n\n2. CRITIQUE OF RACIAL \"BIAS\": the fallout of the under-representation of\npeople from racially subordinated locations has been BIAS in the choice\nand definition of problems. Sociology of African-American communities\nwould look different if done by people who were participating in those\ncommunities; racial science might look different -- and, in fact, think\nabout how BOAS saw race in the US from his vantage point.\n\n3. CRITIQUE OF VIEWS OF NATURE IN WESTERN SCIENCE: modern Western\nscientific traditions, which have crucially taken shape amidst racist racial\nformations, have taken on board visions of \"nature\" that are racially\ncharged and that have effects on how humans and nonhumans are\nunderstood. Africa, called the \"dark\" continent by colonial powers, has\nbeen stereotyped as \"wild\"\n\n\"Africanized bees\"\n\nHarding (pp. 4, 10)\n\n4. ALTERNATIVE SCIENCES/HISTORY: Closely linked to previous critique is\nthe notion that there are \"alternative sciences,\" a claim we'll want to\nexamine in more depth.\n\nAn African American Science\nGeorge Washington Carver: \"the content of his scientific research was deeply\ninfused with his concerns for poor farmers in the south, particularly African-\nAmericans, who still labored under King Cotton and the legacy of slavery\" (p.\n45) reconstructing content: Carver developed products for the peanut and\npotato. invented dehydrate peanut products.\n\nHess writes about RECONSTRUCTION\n\nAnd WHOSE knowledge practices should count as \"science\" to begin with?\nRacism has carefully excised some practices from being considered science at\nall. Just as midwifery, practiced predominantly by women, was carefully\nexcluded from the SCIENCE of MEDICINE with the rise of OBSTETRICS as a\nmale enterprise (facilitated by commitments to detached, dispassionate,\ndisembodied, objective knowing and technological mediation-- all\ncharacteristics assigned both to elite masculinity and science), so some\nknowledge practices, because they have been associated with racially\nsubordinated groups, have been disqualified as science. We're going to look\nat claims like these in the weeks to come.\n\nNot being aware of these is a sign of what Harding would call Eurocentric\nScientific Illiteracy.\n\nThese are complicated questions -- look at syllabus.\n\nHow should we think about these questions. David Hess gives us some\npointers; think about his notion of TECHNOTOTEMS.\n\nHess, David. 1995. The Cultural Construction of Science and Technology. In Science\nand Technology in a Multicultural World: The Cultural Politics of Facts and Artifacts.\nNew York: Columbia University Press, pp. 18-53.\n\nWe can look at METAPHORS, for example\n(the role of analogy in science: whose analogies?)\n\nHess discusses a lot, from statistics to cell biology. Let's look at Haraway for\ncase study...\n\nHaraway, Donna. 1989. Apes in Eden, Apes in Space: Mothering as a Scientist for\nNational Geographic. In Primate Visions. New York: Routledge, pp. 133-156.\n\nNature parks. Whose nature is this?\n\nHaraway gives us an extended bit of the history of primatology and seeks to\nalert us to the racial imaginary animating such practices as white Western\nwomen showing up in the \"wilds of Tanzania\" to do science on nonhuman\nprimates.\n\nShe starts with this very nice Gulf Oil ad, metonymic of the logics she seeks\nto unpack.\n\nShe argues that primatology has operated according to a \"triple code\" of\ngender, science, and race. What does she mean? How do these work in what\nHaraway calls the National Geographic system of primatology?\n\n\"when may (white) women represent (species) man? (p. 135).\n\nhow does whiteness work in the stories of Jane Goodall, et al.?\n\nKEY: \"White cannot be said out loud or it loses its crucial position as a\nprecondition of vision and becomes the object of scrutiny\" (p. 152).\n\nAfrica coded as ape, giving redeeming touch. African people coded as not part\nof the human world into which lone white women primatologist travels. She is\n\"alone.\""
    },
    {
      "category": "Lecture Notes",
      "title": "lecnotes_04_15.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-240-race-and-science-spring-2004/ffb38da3db455dd89471fa7d57f409ef_lecnotes_04_15.pdf",
      "content": "21A.240\nRace and Science\nSpring 2004 MIT\n\nPART 2: REFORMULATING RACE: MAKING AND REMAKING THE IDIOMS OF\nSCIENCE\nLecture 10. April 15\n\nPAPER # 2 DUE\n\nLand, Science, and Knowledge in Native America\n\nQuick reminder about histories of RACE in UNITED STATES, why these categories in the\nsyllabus\n\nBlacks/African Americans become a RACE through middle passage, slavery, racial terror,\nsegregation\n\nWhites become a RACE through immigration laws, citizenship rules, invention of Caucasian\n\nAsian Americans become a RACE through exclusion acts, war relocation camps\n\nIndians/Native Americans become a RACE through genocide, forced removal from land\n\nIn all these cases, different kinds of people are homogenized\n\nThe primary themes that emerge in these texts for today:\nNATURE\nENVIRONMENT\n\nENVIRONMENTAL RACISM/JUSTICE\n\nHow can we understand these? Go back to list of four critiques of race and science:\n\n1. CRITIQUE OF UNDERREPRESENTATION: people who have been racially\nsubordinated have been largely excluded from science, which happens to\nbe a highly authoritative way of knowing with a great deal of social power.\nThis critique questions the REPRESENTATION of different kinds of people\nin science.\n\ne.g. The American Indian Science & Engineering Society web site\n\n2. CRITIQUE OF RACIAL \"BIAS\": fallout of the under-representation of\npeople from racially subordinated locations: BIAS in the choice and\ndefinition of problems.\n\n3. CRITIQUE OF VIEWS OF NATURE IN WESTERN SCIENCE: modern Western\nscientific traditions, which have taken shape amidst racist racial\nformations, have taken on board visions of \"nature\" that are racially\ncharged and that have effects on how humans and nonhumans are\nunderstood.\n\ne.g. views of nature as something separate from culture with the\nArctic\n\nscientists versus the Inuit case.\n\nOuter space as Frontier\n\n4. ALTERNATIVE SCIENCES/EPISTEMOLOGIES\nClosely linked to previous critique is the notion that there are \"alternative\nsciences,\" And WHOSE knowledge practices should count as \"science\" to\nbegin with? Racism has carefully excised some practices from being\nconsidered science at all.\n\nSo, is Inuit knowledge, for example, science?\n\nAnother way to understand the themes of the readings today is through HISTORY.\nThere's a danger of romanticizing Native Americans as \"close to nature.\" Question\nIS: HOW did this stereotype come into being? This is where HISTORY can help us,\nparticularly the history of the EXPROPRIATION OF LAND FROM NATIVE PEOPLES by\nTHE US and CANADA. This IS something that many Native groups have in common.\n\nThe very production of \"Indians\" as a RACIAL group is bound up in the history of\nLAND, and the collision of different epistemologies of PROPERTY in the context of\nCOLONIAL ENCOUNTERS and ADMINISTRATION.\n\nFor this reason I want to begin JAIMES and build from political economy toward\nepistemological arguments. I think political economy complicates articles about Cree,\nInuit.\n\nJaimes, M. Annette. 1992. Federal Indian Identification Policy: A Usurpation of\nIndigenous Sovereignty in North America. In The State of Native America: Genocide,\nColonization, and Resistance. M. Annette Jaimes, ed. Boston: South End Press, pp.\n123-138.\n\nWhat's the story here?\n\nTreaties: production of Native \"nations\"\n\nGeneral Allotment Act 1877: unilateral dissolving of Native land holdings; redeeded\nback to individual \"Indians.\"\n\n\"Indians\" now defined on basis of blood-quantum.\n\nHow do you read what's happening here?\nWell, there are different ideas about property at stake, for one thing.\n\nAnglo-American government/settlers see land as something to be \"improved\" through\nthe kind of rational labor that produces property.\n\nThis also hooks into the notion of \"manifest destiny\" for the white American nation...\n\nNative peoples hold the land communally, as a \"nation\" (owing to treaties).\n\nUS gov't in an attempt to bring these two together, but also as a way of getting more\nland, designates peoples' membership in \"nation\" based on lineage/genealogy. Rise of\nbiologistic/evolutionary/hereditarian thinking. Skulls are measured; blood.\n\nThe result, interestingly, is a particular racialization of Native Americans.\n\nTied to the POLITICAL ECONOMY of LAND.\n\nIndians get citizenship: 1924. This makes them bound by laws of US, so negotiations\nnow happen not between members of different nations, but between citizens.\n\nIndian Reorganization Act 1934: Part of the New Deal. All recognized Native groups\nare to have tribal councils, recognized by the US government. This again brings them\ncloser to being under the thumb of US nation state.\n\nwhat else is happening with LAND?\n\nNative Americans moved to marginal agricultural land then, various minerals are\ndiscovered. And, importantly, at mid20th century, uranium;\n\nas Winona la Duke points out (pp. 128-129), Indians don't get wealthy from this.\n\nIn fact, as the Churchill and LaDuke article points out, they get very sick! Let's talk\nabout the\n\nChurchill, Ward and Winona LaDuke.1992. Native North America: The Political\nEconomy of Radioactive Colonialism. In The State of Native America: Genocide,\nColonization, and Resistance. M. Annette Jaimes, ed. Boston: South End Press, pp.\n241-266.\n\nEnvironmental racism.\n\nwhat was the story of Shiprock? (p. 247)\n\nNational Sacrifice Areas?\n\nEnvironmental justice.\n\nOK, NOW, I think we have a few more TOOLS for examining the stuff about NATURE\nthat comes up in \"Science for the West, Myth for the Rest? The Case of James Bay\nCree Knowledge Construction,\" and in \"Inuit Indigenous Knowledge and Science in the\nArctic.\" It seems to me that the history of LAND is a better way of getting at this stuff\nthan speculations about essential cultural differences in EPISTEMOLOGIES of NATURE.\n\nThere may be different epistemologies of nature at work, but I'd argue that they often\nprecipitate most immediately out of different epistemologies of property -- which, in a\nway, only become visible as such in the context of colonialism.\n\nScott, Colin. 1996. Science for the West, Myth for the Rest? The Case of James Bay\nCree Knowledge Construction. In Naked Science: Anthropological Inquiry into\nBoundaries, Power, Knowledge. Laura Nader, ed. New York: Routledge, pp. 69-86.\n\nWhat's Scott's argument here?\n\n\"I focus on the particular task of exploring how practical, empirical knowledge flows\nfrom root metaphors (paradigms) that are not generally associated with scientific\nresults in Western thought\" (p. 70). So, he's saying that what counts as empirical is so\nwith respect to an experiential context that has metaphysical, cultural commitments\nbuilt into it.\n\nSets up differences between scientific knowledge and Cree knowledge as differences in\nmetaphysics. But he also sees them as similar precisely because both are lodged in\nmetaphysical commitments.\n\nOne contrast is: \"In Cree, there is no word corresponding to our term 'nature' (p. 72).\n\nWhile, in Western science, \"Natural objects and nature at large are experienced as\ninnate; as 'naturally' separate from the scientific culture that represents them\" (p. 74).\n\nBUT \"the separation of culture from nature depends not on a preponderance of literal-\nmindedness per se, but on which metaphors are used to frame the literal\" (p. 74).\n\nvague claim, but we can use it to think about relations with land (this is a more\nconcrete way to talk about this than \"nature\" [Scott talks about \"nature\" in last two\nsentences]). For white settlers, land was thought of as something that could be\nproperty, something that could be bought and sold as one buys and sells objects. This\nidea of property is highly metaphorical -- depends on a comparison of land with other\nthings, and on the idea that it can be packaged (something that reflected in the idea of\nMAPS of LOTS). People started to think of this as LITERAL.\n\nThere were metaphors FRAMING the LITERAL; these in turn dictated what would count\nas \"practical, empirical, knowledge\" about LAND. \"How much of it is there\" makes\nmost sense when you imagine partitioning it from social relations, from sky...\n\n\"As certain root metaphors become conventionalized, as certain paradigms persist,\ntheir presence in observation language becomes less noticeable -- they become\nliterally implicit in the empirical description of experience\" (p. 72).\n\nBut Scott's argument, while it implicates land, is more about human/animal relations,\nespecially geese.\n\nSo, in Cree, \"practical, empirical knowledge\" about say \"the semiotic conventions of\ngeese\" flows from view of humans and animals as engaged in processes of\ncommunication, as embedded in a reciprocative network.\n\nYou might contrast this idea with the way in which \"practical, empirical knowledge\"\nabout nonhuman primate communication (like we saw in Primate Visions) was\npredicated on the idea that humans and apes are not constitutively in communication,\nbut that we must BRIDGE this GAP.\n\nBielawski, Ellen. 1996. Inuit Indigenous Knowledge and Science in the Arctic. In\nNaked Science: Anthropological Inquiry into Boundaries, Power, Knowledge. Laura\nNader, ed. New York: Routledge, 216-227.\n\ncomparison of different knowledge systems. again, though, there's a history of\ndisplacement which is crucial! The Inuit in this article have ecological knowledge, not\nbecause they're close to nature, or necessarily even have a different view of it (though\n\nwhy wouldn't they?), but because they had to survive in marginal environment to\nwhich they were relocated -- in a very different environment.\n\nMars in Nunavut\nSedna, after the goddess of the ocean.\n\nSpeaking of the ocean: Alien algae:\n\nAlien Invasion\n\nEvolutionary biologists classification of native and alien species:\nNATURE\n\nCULTURE\nnative\n\nalien / introduced\nendemic\n\naccidental\nindigenous\n\nintentional\n\ninvasive\n\nThe parallels in the rhetoric surrounding foreign plants and those of foreign\npeoples are striking. ... The first parallel is that aliens are 'other.' ... Second is\nthe idea that aliens/exotic plants are everywhere, taking over everything. ...\nThe third parallel is the suggestion that they are growing in strength and\nnumber. ... The fourth parallel is that aliens are difficult to destroy and will\npersist because they can withstand extreme situations. ... The fifth parallel is\nthat aliens are \"aggressive predators and pests and are prolific in nature,\nreproducing rapidly.\" ... Finally, like human immigrants, the greatest focus is\non their economic costs because it is believed that they consume resources\nand return nothing (pp. 29-30).\n\nNative Hawaiian parsing:\nNATURE\n\nCULTURE\nnative\n\nalien\nendemic\n\naccidental\nindigenous\n\nintentional\nintroduced by ancient Polynesians\ninvasive\ndeveloped over history of Hawaiian people"
    },
    {
      "category": "Lecture Notes",
      "title": "lecnotes_04_22.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-240-race-and-science-spring-2004/874a804b10b551ecff3177fd113be1b8_lecnotes_04_22.pdf",
      "content": "21A.240\nRace and Science\nSpring 2004 MIT\n\nPART 2: REFORMULATING RACE: MAKING AND REMAKING THE IDIOMS OF\nSCIENCE\nLecture 11. April 22\n\npaper topics; papers at end of class; handout Takaki\n\nAfrican-American Technoscientific Histories and Afrofuturist Projects\n\nToday, we're looking at African-American history and identity in relation to science,\nengineering, and mathematics. The readings fall into roughly two categories,\n\n1. the traditional history and policy papers --Hine on black women physicians,\nManning on Ernest Everett Just and funding, Malcolm on increasing the\nparticipation of black women in science and technology, and the interview with\nMIT physicist Shirley Jackson.\n\nThese are accounts of the struggles of African-American women and men to make it\nin medicine, biology, and physics. Some of these stories -- particularly that of the\nBlack Women Physicians -- have a kind of \"we shall overcome\" flavor to them --\nstories of people coming up out of the legacies of slavery, segregation,\ndiscrimination: overcoming obstacles. The Malcolm and the Jackson interview spell\nout how obstacles to scientific achievement are created, and focus attention on\ndismantling them, not just overcoming them.\n\nSo, basically we have -- recalling the four different claims about the effects of\nrace/racism on science -- which were\n\n1. CRITIQUE OF UNDERREPRESENTATION\n\n2. CRITIQUE OF RACIAL \"BIAS\"\n\n3. CRITIQUE OF RACIALIZED VIEWS OF NATURE/TECHNOLOGY IN\nDOMINANT WESTERN SCIENCE\n\n4. CALL FOR ALTERNATIVE HISTORY OF SCIENCE OR ALTERNATIVE\nSCIENCES\n\nWe have the first two critiques of the racial economy of science represented here.\nThe substance, again, of these critiques is that people who have been racially\nsubordinated have been and often still are largely excluded from the practices of\nscience, which happens to be a highly authoritative way of knowing with a great deal\nof social power. And this \"biases\" the outcome of scientific work -- most starkly of\ncourse when it comes to the sciences that treat of human difference. These readings\ndon't question the enterprise of science itself.\n\n2. the second set of readings, the Fouche and the Eglash and Bleecker are more\nradical, trying to rewrite what counts as the history of science itself. Fouche,\n\nthrough the example of DJing and of the repurposing of the turntable from a\ndevice of musical reproduction to one of production, explores the ways African\nAmericans have responded to and transformed dominant technologies, using\nwhat he calls \"vernacular technological creativity\" -- a kind of creativity that he\nsays is \"rooted in black cultural and aesthetic priorities\"\n\nEglash and Bleeker go further, arguing that reexamining the history of science\nthrough the lens of African history can reveal that there are African lineages for key\nconcepts in dominant mathematics and science. They forward the argument, for\nexample, that BINARY coding has a history in African counting and gaming systems\nthat may have influenced the history of logic in Europe.\n\nSo, Fouche and Eglash and Bleecker recall the critique from alternative history, the\nidea that racism has prevented proper historical inquiries into the origins and\ninfluences of tools and theories in Western science, directing our attention away\nfrom, say, the influence of indigenous knowledge systems in the history of\nmathematics and astronomy, distorting an accurate accounting of where ideas and\npractices have come from.\n\nSo, this is how I'd characterize our readings for today. Let me take up some of these\nthemes in a brief lecture.\n\nREPRESENTATION AND THE WE SHALL OVERCOME NARRATIVE\n\nHine, Darlene Clark. 1993. Co-Laborers in the Work of the Lord: Nineteenth Century\nBlack Women Physicians. In The \"Racial\" Economy of Science: Toward a Democratic\nFuture, Sandra Harding, ed. Bloomington: Indiana University Press, pp. 210-227.\n\nThis is a story about women who succeeded against great odds to become\ndoctors. a story of women worthies, inspirational, role model tale. this article\ndoes not so much question the constitution of medicine itself (for that, we\ncould look to Terry Kapsalis' story of the speculum) but is mostly concerned\nwith (important!) issues of enfranchisement (one reason the 14th amendment\nfigures in).\n\nat the same time, we do learn about the specific ways these people integrated\nmedicine into their lives; we learn that many black women physicians\npracticed at home and so medicine could be made consonant with gender\nexpectations.\n\nbut \"It is reasonable to conclude that the convergence of the triple forces of\nracism, sexism, and professionalization resulted in a significant reduction in\nthe number of black women physicians in the 1920s.\"\n\nthis meant that the home/office distinction, for one thing, solidified and these\nwomen could no longer practice at home.\n\nRace and gender expectations often marginalized the practices of these\nmedical people. Hines' story is one of recuperating these stories.\n\nManning, Kenneth. 1993. Ernest Everett Just: The Role of Foundation Support for\nBlack Scientists 1920-1929. In The \"Racial\" Economy of Science: Toward a\nDemocratic Future, Sandra Harding, ed. Bloomington: Indiana University Press, pp.\n228-238.\n\nMarine biologist Just worked too hard trying to keep all the demands placed\non him as a person, as a representative of his \"race\". But he overcame!\n\nMalcolm, Shirley. 1993. Increasing the Participation of Black Women in Science and\nTechnology. In The \"Racial\" Economy of Science: Toward a Democratic Future,\nSandra Harding, ed. Bloomington: Indiana University Press, pp. 249-253.\n\nthis piece, of course, as a piece of policy writing, seeks to understand how\n\"obstacles\" come into being and rather than thinking about how these might\nbe \"overcome,\" pitches the proposal at more proactive level of dismantling\nobstacles.\n\n\"Black women received a smaller proportion of their science degrees in the\nfields of engineering, mathematics, and physical sciences than women of any\nother racial/ethnic group.\" why?\n\n\"inadequate preparation in mathematics and lack of exposure to topics in the\nphysical sciences and technology consistently from pre-K throughout the\neducational pipeline.\"\n\nMalcolm proposes several things that can be done, including\n\n- math and science throughout the \"pipeline\"\n- hands-on involvement through activities such as science fairs and projects\n- contact with role models who are minority women\n- availability of appropriate career information\n- early exposure to research\n- address race, gender, and culture issues\n- work experience\n- support by peers (which means that peers need to be there!)\n\nsome websites of interest, Faces of Science, CS of Af Diaspora, Black Geeks\n\nNow, what these wesbites assume is that Afrodiasporic people, robbed of\nmemory and history through colonialism, chattel slavery, and segregation,\nhave a history separate from the history of mathematics, computer science,\netc. but that this should not prevent them from participating in these\nuniversal human enterprises. So, many of these websites are concerned with\nproducing ROLE MODELS.\n\nPeople like JUST, MORGAN, HARRIS, JACKSON\n\nWilliams, Clarence, ed. 2001. Interview with Shirley A. Jackson. In Technology and\nthe Dream: Reflections on the Black Experience at MIT, 1941-1999. Cambridge: MIT\nPress, pp. 220-230.\n\nWhile this kind of attention to scientists who struggled in a racist society is\nIMPORTANT and ESSENTIAL, it's also not the only way to come at the\nquestion of African Americans and science.\n\nMuch of thus work poses the question of African-American, Afrodiasporic\nparticipation as ONE OF ABILITY. So, on the \"Faces of Science: African-\nAmericans in the Sciences\" page, an excerpt from \"Graduate Education\nOpportunities for African-Americans in Chemistry\" argues that low numbers of\nAfro-Am chemists \"DO NOT reflect any lack of inherent capability in chemistry\nby African Americans\" -- which poses the issue in response to, but also in\nterms of, the racist framework that would claim that blacks are intellectually\ninferior to whites.\n\nLook at TECHNOLOGY AND THE DREAM\n\nALTERNATIVE HISTORIES and FUTURES\n\nThere's another way of thinking about this. Has the erasure of history suffered by\nthe Afrodiaspora also extended to an erasure of histories of science? How does the\nhistory of science relate to the histories of people of the Afrodiaspora?\n\nAMUCHMA newsletter, explicitly concerned with retrieving history.\n\nLet me give you another data point for this kind of historio-graphical enterprise. You\nmay recall from our reading that Boas spoke on the history of Africa at Atlanta\nUniversity in 1906, at the invitation of W.E.B. Du Bois.\n\nThinking about another HISTORY.\n\nYou'll recall that Londa Schiebinger, in the chapter of hers that we read called \"Who\nShould Do Science,\" gave us ample examples of how people from racially\nmarginalized positions were excluded from science -- and how standard history of\nscience became EUROCENTRIC.\n\nWhat if we started with African history? This is where the Eglash and Bleecker article\n\"The Race for Cyberspace\" comes in:\n\nEglash, Ron and Julian Bleecker. 2001. The Race for Cyberspace: Information\nTechnology in the Black Diaspora. Science as Culture 10(3):353-374.\n\nEglash and Bleecker complicate a simplistic association of technology with\nEuropean culture, which then dominates or is appropriated by Afrodiasporic\npeople.\n\nAs they put it in their intro:\n\n\"Focusing on the black diaspora, we broaden the category of 'information\ntechnology' to show how traditions of coding and computation from\nindigenous African practices and black appropriations of Euro-American\ntechnologies have supported, resisted, and fused with the cybernetic histories\nof the west, and provide a strong source for changes in reconstructing\n\nidentity, social position and access to power in communities of the black\ndiaspora.\" (p. 353).\n\nLet me unpack what this means.\n\nOn page 356, Eglash and Bleecker quote the title of African American poet\nAudre Lorde's poem \"The Master's Tools Will Never Dismantle the Master's\nHouse\"\n\nThe standard way to interpret this is: the tools of science, because they have\norigins in the same Western science that produced racism, cannot be used for\nblack or African American cultural priorities.\n\nBut, as we've seen -- particularly in Stepan and Gilman -- people can and do\ntake up these tools to resist or refashion their lives.\n\nFurther, we can ask the question: did the Master actually make all the tools?\n\nThey argue that \"it is important, when examining the appropriation of\ntechnology, to consider not only the down side of appropriation -- the\npossible disadvantages of attempting to 'use the master's tools' -- but also\nthe fact that Africans already had many technologies to begin with, and thus\nsome of the supposed appropriations may have had African influences in their\nown histories of invention.\" (p. 357)\n\nWe can go back in history, not just to find worthy precedessors for today's\nscientists, but also go back to see whether standard histories of science\nobscure, for example, African and Afrodiasporic contributions to the\nproduction of math, science, engineering.\n\nEglash and Bleecker give us one example, more fully documented elsewhere:\n\nThat mathematical BASE 2, binary notion, may have African histories\n\nThe modern binary code, essential to every digital circuit from alarm\nclocks to super-computers, was first introduced by Leibnitz around\n1670. Leibniz had been inspired by the binary-based \"logic machine\"\nof Raymond Lull, which was in turn inspired by the alchemists'\ndivination practice of geomancy. But geomancy is clearly not of\nEuropean origin. It was first introduced there by Hugo of Santalla in\ntwelfth century Spain, and Islamic scholars had been using it in North\nAfrica since at least the 9th century, where it was first documented in\nwritten records by the Jewish writer Aran ben Joseph. The nearly\nidentical system of divination in West Africa associated with Fa and Ifa\nwas first noted by Trautmann.\n\nBase 2 calculation ubiquitous in West Africa -- in practices like sand\ndivination\n\nEglash argues in AFRICAN FRACTALS that there is evidence that\ntraveled into Europe -- then Christendom -- through geomancy (note\nthat math and particularly what we would call probabilistic math was\n\nstill part of religion), from which people like Ramon Lull picked it up.\nThen Leibnitz\n\nDid it happen this way? There is some good evidence, but it's hard to\nknow for sure because of who has told the history of mathematics _\nand indeed, the definition of WHAT COUNTS as math at all.\n\nFear of 0.\n\nIn addition to the question of revisiting the history of science, there is also the\nmatter of appropriating the master's tools, engaging in what Fouche calls \"vernacular\ntechnological creativity\"\n\nThis comes to life in\n\nAFROFUTURISM.\n\nan alternative future, locating liberation in possible futures marked by\ntechnologies deployed for purposes culturally sympathetic to Afrodiasporic\npractice, culture, and history (which may nonetheless exceed it)\n\nexamples? Outer space as a zone of liberation (Sun Ra, Parliament\nFunkadelic); see Public Enemy's Fear of a Black Planet, a CD cover that\nracializes the planet (as against the whole earth pictures usually used to\ndepict 'one world'). The spaceship as mothership as mother Africa/mothership\nconnection.\n\nUtopias that prominently feature blackness as a value to be celebrated. Not\nlike the SimCity erasure of race that makes cities according to the white\nimagination.\n\nPromise? \"What is significant for the Afrofuturist movement -- artists and\ninventors alike -- is the ability to reveal the relations of social power in the\nconstruction of technoscience. It is the ways in which this syncretism can\npoliticize information technology that make Afrofuturism a powerful\ntechnocultural syncretism.\" What do they mean?\n\nLimits? \"If there is a downside to the Afrofuturist movement, it is the\ntendency to dwell too much in the imaginary spaces created by fiction and\nmusic, rather than work at fusing these domains with functional science and\ntechnology.\"\n\nEglash and Bleecker characterize Afrofuturism as Postmodern\n\nThe racial content of \"double consciousness\" \"has become etherialized and\nhas spread throughout the milieu I like to call electro-modernity.\" The color\nline as the line of code?"
    }
  ]
}