{
  "course_name": "Race, Ethnicity, and American Politics",
  "course_description": "This course explores the role of race and ethnicity in modern American politics. It focuses on social science approaches to measuring the effects of race, both at the individual level and more broadly. Topics include race and representation, measurement of racial and ethnic identities, voting rights and electoral districting, protest and other forms of political participation, and the meaning and measurement of racial attitudes.",
  "topics": [
    "Social Science",
    "Political Science",
    "American Politics",
    "Society",
    "African American Studies",
    "Social Science",
    "Political Science",
    "American Politics",
    "Society",
    "African American Studies"
  ],
  "syllabus_content": "Syllabus\n\nCourse Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nPrerequisites\n\nThere are no prerequisites for this course.\n\nCourse Description\n\nThis is an undergraduate class on the role of race and ethnicity in American politics.There are no official prerequisites, but a basic understanding of American political institutions (as would be gained from\n17.20 Introduction to American Politics\n) will be helpful, as will a willingness to engage with complex reading material. The focus will be on political science theories and research about race and politics, though we will also draw on work from sociology, history, and economics.\n\nWe will ask big social science questions about race in America: What is \"race\"? How could we possibly measure it, and does it really matter? What does it mean to say that a policy is discriminatory, and how have social scientists and courts tried to measure racial discrimination? What do Americans think about race in the 21st century, and how do these opinions shape their voting and protest behavior?\n\nAfter taking this course, students will be able to discuss different ways of imagining race and ethnicity, and their historical underpinnings. They will be able to describe and critique the ways in which racial attitudes are theorized and measured, and think about how these different attitudes are expected to shape political behavior. And they will be familiar with key debates about race in politics, and will be able to talk about the pros and cons of various social science approaches to studying race and its effects.\n\nExpectations and Coursework\n\nMy general expectation is that you will come to class prepared to fully participate. This means being on time and keeping electronic distractions to a minimum. It also means treating your classmates with respect, and listening to and engaging meaningfully with them when they speak.\n\nStudents are expected to complete all assigned readings and pre-class activities and come to class meetings. In addition, there will be two short papers (5-10 pages) assigned during the semester, and a final exam during exam period.\n\nThere will also be occasional reading quizzes, in which students will be asked to answer a few multiple choice questions about the readings before class begins. These will probably not be part of the final course grade, but are intended to help both students and teaching staff keep tabs on the students' comprehension of the material. However, if I get the sense that no one is doing the reading, I reserve the right to include the reading quizzes in the final exam grade. I hope not to.\n\nUnless an assignment is explicitly labelled as collaborative, I expect that each person will present only their own work. Any work completed for another class must be disclosed (don't turn in the same paper or assignment for two different courses without prior approval). No assignments will be accepted late unless a prior extension was granted, or where required by institute policy. Makeup exams will only be provided as required by institute policy.\n\nFor more information on the course assignments, see the\nAssignments\nsection.\n\nGrading Policy\n\nACTIVITIES\n\nPERCENTAGES\n\nPapers (2)\n\n50%\n\nFinal exam\n\n35%\n\nClass participation\n\n15%\n\nCalendar\n\nSES #\n\nTOPICS\n\nKEY DUE DATES\n\nModule I: What is Race?\n\nIntroduction\n\nHistory / International Comparisons\n\nThe American Racial Order\n\nA Little History: How Did We Get Here?\n\nMeasurement and Policy\n\nHow Do We Measure Race / Ethnicity?\n\nMeasurement Matters\n\nSocial Science Challenges\n\nDiscrimination and Causality\n\nPaper assignment 1 distributed\n\nSome Methods\n\nModule II: Public Opinion and Behavior\n\nRacial Attitudes: Measurement and Effects\n\nIntroduction to Racial Attitudes\n\nLinking Attitudes to Outcomes\n\nCampaigns, Advertising, Media\n\nPaper assignment 1 due\n\nRace in Context\n\nContext and Conflict\n\nContext and Attitudes / Action\n\nPatterns in Participation and Mobilization\n\nStylized Facts / Overview of Group Participation\n\nFactors in Turnout\n\nPaper assignment 2 distributed\n\nOther Political Behaviors\n\nDoes Protest Work?\n\nModule III: Political Elites and Institutions\n\nDescriptive Representation: Concept & Practice\n\nDescriptive Representation: Theory and Empirics\n\nMajority-Minority Districts\n\nPaper assignment 2 due\n\nVoting Rights and Electoral Districting\n\nOverview of Voting Rights and Electoral Districting\n\nRace and the Political System\n\nRace and Political Parties\n\nCourts; Broad Review\n\nRace and Policy\n\nOverview of Race and Policy\n\nCarceral State 1: Film Screening\n\nth\n. Directed by Ava Duvernay. Color, 100 min. 2016.\n\nCarceral State 2: Political Causes\n\nCarceral State 3: Political Consequences\n\nConclusion",
  "files": [
    {
      "category": "Assignment",
      "title": "17.269S17 Race, Ethnicity, and American Politics - Assignments: Paper 1: Race and Ethnicity Questions",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-269-race-ethnicity-and-american-politics-spring-2017/d7bda8140d431c931b4299e5a2cd5257_MIT17_269S17_RaceEthnicity.pdf",
      "content": "A More Informative Set of Race and Ethnicity Questions\nfor the United States Census\n\nMIT Student\n17.269 Race and Ethnicity\n14 March 2017\n\nWhy Race and Ethnicity?\nThe United States has had many motives for measuring race and ethnicity in the\npopulation across its short history. The three-fifths compromise of the late 1780s called for race\nto be measured to determine representation in Congress--with slaves (blacks) counting as 3/5\nof a white person. As time has passed, races have been added and removed on the census for\nvarious reasons ranging from changing concepts of racial makeup (delineating southern\nEuropeans from Northern Europeans in the 1880s to considering all Europeans as white today),\nracist and mal-intentioned motives (deportation), and even experimentation (measuring\nfertility of mixed-race individual to determine the truth of the superiority of \"biologically pure\"\nraces) (Desmond and Emirbayer, 2015; Sollors, 2002).\nToday, race is measured not because researchers believe it to be a biological reality (the\nfoundation upon which race was first conceptualized) but rather, as Tukufu Zuberi approaches\nit, as a social construct which has influenced the lives of Americans through history and which\ncontinues to have implications for modern day Americans (Zuberi, 2001). Individuals have been\ndenied opportunities and rights ranging from civil to social to political and educational based on\ntheir race and ethnicity (Blank et al., 2004), and therefore asking about race is necessary to\nunderstand cumulative discrimination and the lasting impact of these historical events as well\nas current discriminatory policies, such as New York's \"Stop-and-Frisk\" policy (Gelman et al.,\n2007).\nThe Current US Census\n\nThe current United States census employs two questions to gain data about the overall\nracial and ethnic make-up of the United States population. The first question (Figure 1 question\n\n8) asks the census taker about their\nethnicity. Rather than giving a wide\nrange of options for this question, the\ncensus only allows individuals to identify\nas having Hispanic, Latino, or Spanish\nethnic roots or not. Because Hispanic\norigins are not classified as races in this\ncensus, this is an opportunity for\nindividuals who are typically considered\nracially white to be able to differentiate\nthemselves from other white\npopulations such as those of Northern\nEuropean descent. This requires that\nresearchers must use both of these questions in tandem to form meaningful groups and to\ncompare those groups across a variety of variables such as life expectancy, average income,\nhomeownership, and others.\n\nThe second question on this topic (Figure 1, question 9) asks the individual to select one\nor multiple races. The option of selecting multiple races is a more recent development for the\ncensus, originating on the 2000 census. Individuals are given a selection of 12 races with the\noption of writing in any not listed. A common occurrence on this question is for individuals who\nmarked that they have Hispanic or Latino origins in question 8 to write in Hispanic or Latino for\nFigure 1 Current format of United States Census questions on race and\nethnicity.\n\ntheir race as well. This begs the question of whether it is necessary to have two separate\nquestions on race and ethnicity when individuals seem to consider them as the same.\n\nThere are several pros and cons to the current way that the census asks about race and\nethnicity. The current census assumes that only Hispanic, Latino, or Spanish ethnicities are\nsignificant enough to be worth asking about. Every other ethnic group is lumped into the\ncategory of \"not of Hispanic, Latino, or Spanish origin\" and those individuals are assumed to be\nprimarily defined by their race--whatever that means to them. This means that any variations\nin income, home ownership, or other information gathered by the census cannot be delineated\nby any other ethnic lines. This strongly limits the usefulness of the ethnic data by itself and does\nnot allow us to meaningfully answer how ethnicity in general affects the lives of Americans.\n\nThe current census questions are also vague in terms of what they are asking for. What\nmakes up race and racial identity is an ever-changing and ill-defined subject. Race has ties to\ngeography, personal identity, skin color, cultural identity, and more. Asking a single question\nabout race leaves the respondent to define the term on their own. Each census taker may take\ndifferent variables into account as they select which race they belong to. Because of this, it is\nquestionable to what degree one person's answer can be meaningfully compared to another's\nas individuals are unlikely to place the same weight on each component that can make up racial\nidentity.\n\nThese questions also present race and ethnicity as facts, rather than malleable concepts\nthat have the potential to change over time. Since the census has been shown to have broad\nimplications as to how Americans view race (Sollors, 2002), this wording has the potential to\n\ngive individuals the idea that race is a biological fact or well-defined truth--a historically\ndangerous concept.\nProposed Modifications to the Census\nQuestions\nThis paper proposes replacing the current census questions with six alternative\nquestions, presented in full in Appendix 1. Each of the proposed questions is formulated to ask\nabout a slightly different aspect of race and ethnicity. When combined, these questions will\nform a more holistic characterization of not only what racial and ethnic groups make up the US,\nbut how Americans themselves view race and ethnicity. These proposed questions are:\nQuestion 1 Person 1 considers themselves as from...\n(select one or more country)\n\nQuestion 2 Person 1 has ancestry in...\n(select one or more region)\n\nQuestion 3 Person 1 describes their race as...\n(select one or more race)\n\nQuestion 4 Others have (rightly or wrongly) described Person 1's race as...\n(select one or more race)\n\nQuestion 5 Person 1 describes their ethnicity as...\n(select one or more ethnicity)\n\nQuestion 6 Of the previous questions (1-5), Person 1's experiences are most strongly shaped by...\n(select one answer)\n\nEach of these questions approaches race and/or ethnicity from a slightly different\nperspective. Because race and ethnicity are such vague concepts, asking about specific aspects\nof race and ethnicity allows us to gather data that is more self-consistent in that respondents\nknow more clearly what the question is asking. This approach is less ambiguous in what it is\nasking from the respondent in each question and allows a more expansive exploration of the\nindividual's identity by isolating many possible definitions of race and ethnicity.\n\nThe first of the proposed questions is designed to touch on an individual's cultural\nupbringing. Which present-day country(s) the individual most strongly identifies with is\nexplored here. This question probes an aspect of ethnicity--one that seeks to capture broad\npresent-day influences on the individual that stem from the society(s) that they consider most\nformative for them as an individual.\nThe second question asks about the individual's ancestry. Companies such as\nancestry.com and 23andme are particularly drawn to this conception of race as being\ndelineated by early populations of different geographic regions. This question may be useful to\ntrack the implication of having a certain geographic ancestry in the United States. What is\nimportant to note about this question, however, is that it is not necessarily a reflection of an\nindividual's physical appearance. There may be an individual who marks that they have Native\nAmerican roots who has light skin and freckles. Additionally, the term \"ancestry\" suggests a\nlong time scale, but exactly how long is up to each respondent to determine. One individual\nwho puts Northern American ancestry may mean that they have Native American (Navajo for\nexample) ancestry, while another may mean their parents or grandparents lived in the United\nStates.\nThe third question explicitly asks about race. This question allows the individual to\nanswer based upon their personal conception of race. This question differs from the current\ncensus question on race in that it follows two other questions that touch on racial ideals.\nBecause the individual has already provided two answers that could contribute to their\ndefinition of race--geographic ancestry and geographic identification--they do not need to\nwonder if their definition of race \"needs\" to be rooted in either of these things. If their personal\n\nconception of race lies in their geographic ancestry, their answer to this question will be the\nsame as their answer to question 2. However, if race for the individual is more a function of\ntheir personal experiences or other factors, they can feel free to answer the question in that\nmanner as they have already provided their geographical ancestry and will not feel like they\nneed answer in that way because it might be what the surveyor means.\nThe fourth question attempts get at the individual's visual appearance and possible\ndiscrepancies in life outcome that may be a result of explicit cultural and systematic racism.\nAsking what race others have classified the person as allows researchers to explore whether\nrace as self-identification is most important for life outcome or if race as others perceive it is\nmost important. Does being classified by others as black or middle eastern put individuals at a\nfiscal disadvantage as compared to individuals who tend to be classified by others as white?\nThe fifth question allows the individual to provide their ethnic identity. This question\nwill include more response options than the current census' ethnicity question (see Appendix\n1), but the list of ethnic identities provided is certainly not exhaustive. Several options are given\nto allow the survey respondent to understand what could be considered an identity. If the\nrespondent feels strongly about having a cultural identity that is not included on the list, they\nare free to write it in the \"other\" option. If they do not feel strongly about their ethnicity, they\ncan select \"none\" or simply \"American.\" This question varies significantly from the current\nethnicity question in that it is not a binary choice between Hispanic or Latino and not, allowing\nfor a more fine-grained analysis of the possible effects of cultural identification in the United\nStates.\n\nThe sixth question helps to identify American attitudes towards race and ethnicity. If\nasked every census, a clearer perception of what components of racial identity are significant\nfor individuals at different time points in the United States and across different racial and ethnic\ngroups will be available.\nAnswers\nThe answer choices respondents are given can affect both response rate and quality of\ndata. Having more choices has been shown to decrease the response rate on questions\n(Tugend, 2010). Question 1 errs on the side of more options rather than fewer. The hope is that\nthe nature of the survey (the US Census) will encourage individuals to respond despite that\nlarge amount of questions. However, if a lower response rate is observed, fewer options should\nbe given on future iterations. With the multitude of options, more fine-grained data can be\nobtained. Additionally, simple data regressions can still be performed by grouping answers into\nlarger categories (such as using North American instead of American and Canadian separately).\nFor question 1, countries are divided into subregions based on the UNSD definition. Only\ncountries with populations over 1 million are included as possible answers, however individuals\nare free to write in other countries in a region under the \"other\" option in that region. The\nanswers to question 2 are divided into the same subregions as are present in question 1.\nConclusion\nThe current questions on race and ethnicity on the US Census, though elegantly simple,\nmiss potentially important and worthwhile aspects of race and ethnicity in the United States. By\nusing a more thorough set of questions, the proposed census questions will be able to create a\nmore accurate picture of the United States population without compromising the potential for\n\nsimple data. This set of data will not only allow research into how life outcomes vary with race,\nbut also will allow them to answer what aspects of race contribute most strongly to disparities\nin outcomes. With race and ethnicity being hazy subjects in their exact definition, collecting\nmore detailed data will allow researchers to understand how Americans conceptualize race and\nethnicity, and how this changes over time.\n\nSources\n\nBlank, Rebecca M. Dabady, Marilyn. Citro, Constance F (2004). Measuring Racial Discrimination.\nNational Research Council, 2004.\n\nDesmond, Matthew. Emirbayer, Mustafa (2015). Race in America. Norton, New York, 2015.\n\nGelman, Andrew. Fagan, Jeffrey. Kiss, Alex (2007). An Analysis of the New York City Police\nDepartment's \"Stop-and-Frisk\" Policy in the Context of Claims of Racial Bias. Journal of the\nAmerican Statistical Association, September 2007, Vol 201, No. 479.\n\nTugend, Alina (2010). Too Many Choices: A Problem That Can Paralyze. New York Times 26\nFebruary, 2010.\n\nSollors, Werner (2002). What Race are You?. The New Race Question: How the Census Counts\nMultiracial Individuals Ch. 11. Russell Sage Foundation, 2002.\n\nZuberi, Tukufu (2001). Thicker than Blood: How Racial Statistics Lie. Regents of the University of\nMinnesota, 2001.\n\nAPPENDIX 1\n\nProposed Census Questions\n\nEastern Africa\nBurundi\nEritrea\nEthiopia\nKenya\nMadagascar\nMalawi\nMauritius\nMozambique\nRwanda\nSomalia\nSouth Sudan\nTanzania\nUganda\nZambia\nZimbabwe\nOther ______________\nMiddle Africa\nAngola\nCameroon\nCentral African Republic\nChad\nDemocratic Republic of\nthe Congo\nEquatorial Guinea\nGabon\nRepublic of the Congo\nOther ______________\nNorthern Africa\nAlgeria\nEgypt\nLibya\nMorocco\nSudan\nTunisia\nOther ______________\nSouthern Africa\nBotswana\nLesotho\nNamibia\nSouth Africa\nSwaziland\nOther ______________\nNorth America\nBermuda\nCanada\nGreenland\nUnited States\nOther_______________\nCentral America\nCosta Rica\nClipperton Island\nEl Salvador\nGuatemala\nHonduras\nMexico\nNicaragua\nPanama\nOther ______________\nSouth America\nArgentina\nBolivia\nBrazil\nChile\nColombia\nEcuador\nParaguay\nPeru\nUruguay\nVenezuela\nOther_______________\nCaribbean\nCuba\nDominican Republic\nHaiti\nJamaica\nPuerto Rico\nTrinidad and Tobago\nOther_______________\nOceana\nAustralia\nFiji\nMicronesia\nNew Zealand\nPapua New Guinea\nSamoa\nSolomon Islands\nTonga\nOther ______________\nPolynesia\nMicronesia\nMelanesia\n\nSouthern Asia\nAfghanistan\nBangladesh\nIndia\nIran\nNepal\nPakistan\nSri Lanka\nOther ______________\nEastern Asia\nChina\nJapan\nMacau\nMongolia\nNorth Korea\nSouth Korea\nTaiwan\nOther ______________\nCentral Asia\nKazakhstan\nKyrgystan\nTajikistan\nTurkmenistan\nUzbekistan\nOther ______________\nSoutheastern Asia\nCambodia\nIndonesia\nLaos\nMalaysia\nMyanmar\nPhilippines\nSingapore\nThailand\nTimor-Leste\nViet Nam\nOther ______________\nNorthern Europe\nDenmark\nEstonia\nFinland\nIreland\nLatvia\nLithuania\nNorway\nSark\nSweden\nUnited Kingdom\nOther_______________\nWestern Europe\nAustria\nBelgium\nFrance\nGermany\nNetherlands\nSwitzerland\nOther ______________\nEastern Europe\nBelarus\nBulgaria\nCzech Republic\nHungary\nPoland\nRepublic of Moldova\nRomania\nRussia\nSlovakia\nUkraine\nOther_______________\nSouthern Europe\nAlbania\nBosnia and Herzegovina\nCroatia\nGreece\nItaly\nMacedonia\nPortugal\nSerbia\nSlovenia\nSpain\nOther_______________\n\nWestern Asia\nArmenia\nAzerbaijan\nBahrain\nGeorgia\nIraq\nIsrael\nJordan\nKuwait\nLebanon\nOman\nQatar\nSaudi Arabia\nPalestine\nSyria\nTurkey\nUnited Arab Emirates\nYemen\nOther ______________\n1) Person 1 considers themselves as from... (select one or more)\n\n2) Person 1 as ancestry in... (select one or more)\n\n3) Person 1 describes their race as...\n4) Others have (rightly or wrongly) described\nPerson 1's race as ...\n(select one or more)\n(select one or more)\n\n5) Person 1 belongs describes themselves as which\nethnicity... (select one or more)\n\nThe Americas\n(Native Populations)\nNorth America\nCentral America\nSouth America\nCaribbean\nUnknown Region\nEurope\nNorthern Europe\nWestern Europe\nEastern Europe\nSouthern Europe\nUnknown Region\nAfrica\nNorthern Africa\nMiddle Africa\nEastern Africa\nSouthern Africa\nUnknown Region\nAsia\nCentral Asia\nEastern Asia\nSouthern Asia\nSoutheastern Asia\nWestern Asia\nUnknown Region\nOceana\nWhite\nBlack or African American\nAmerican Indian or Alaska Native\nLatino/a\nMiddle Eastern\nAsian Indian\nChinese\nJapanese\nKorean\nFilipino\nVietnamese\nNative Hawaiian\nGuamanian or Chamorro\nSamoan\nOther Asian________________________________\nOther Pacific Islander ________________________\nSome other race ____________________________\nWhite\nBlack or African American\nAmerican Indian or Alaska Native\nLatino/a\nMiddle Eastern\nAsian Indian\nChinese\nJapanese\nKorean\nFilipino\nVietnamese\nNative Hawaiian\nGuamanian or Chamorro\nSamoan\nOther Asian_________________________________\nOther Pacific Islander _________________________\nSome other race _____________________________\nAmerican\nAmerican Indian or\nAlaskan Native\nArab\nArmenian\nBritish\nBulgarian\nCatalan\nCornish\nChinese\nCroat\nCzech\nDutch\nFrench\nGreek\nHispanic or Latino\nIndian\nIrish\nItalian\nJapanese\nJewish\n\nKurd\nNorwegian\nOromo\nPashtun\nPersian\nPunjabi\nRussian\nScottish\nSerb\nSlovak\nSpaniard\nSwede\nTibetan\nUkranian\nUzbek\nWelsh\nZulu\nOther\n___________________\nNone\n\n6) Of the previous questions (1-5) Person 1's experiences\nare most strongly impacted by... (select one)\n\nQuestion 1: geographic affiliation\nQuestion 2: ancestry\nQuestion 3: race\nQuestion 4: mistaken race\nQuestion 5: ethnicity\nQuestions 1-5 equally\nNone of these questions\n\nAPPENDIX 2 Theoretical Comparison of Question Sets\n\nTo see how the proposed system compares to the current one, take for example an Indian individual\nwho was born in the UK and moved to the United States when they were young. Let's call this individual P1. In\nanswering the current census questions, P1 would likely respond:\nTable 1. Possible answers to current census question by P1.\nQuestion 1\nNo, not of Hispanic, Latino, or Spanish origin\nQuestion 2\nAsian Indian\n\nWhen asking many individuals with a similar background these two questions, each one would likely respond\nthe same way (perhaps also identifying as racially white). This is positive as it allows for consistency between\nindividuals of similar backgrounds. However, it also lumps together individuals that may have significantly\ndifferent experiences even though they share the same race--what if race is not the most influential factor? A\nracially Indian individual born in India would mark the same responses as P1, but may not have the same\nexperiences and life outcome.\nWhen confronted with the proposed set of six questions, P1 may answer in a variety of ways, a few of\nwhich are explored in Table 2. In the current format, the individual is defined solely by their race with no\nregard for their cultural upbringing (except for Hispanic populations). In column A (Table 2), P1 describes their\nrace as Indian, but their ethnicity as British. In column B, they describe their ethnicity as American. These\ndifferent ways of answering give researchers insight into how Americans identify in terms of race and ethnicity\nand how that might affect their life. Having multiple questions allows the individual to express multiple facets\nof their identity, something that a single-question response does not allow for.\nTable 2. Possible answers to proposed census questions from P1\n\nA\nB\nC\nQuestion 1\nThe UK\nThe US\nThe UK and the US\nQuestion 2\nIndia and Europe\nIndia and Europe\nIndia and Europe\nQuestion 3\nIndian\nWhite\nWhite and Indian\nQuestion 4\nIndian\nIndian\nMiddle Eastern\nQuestion 5\nBritish\nAmerican\nIndian\nQuestion 6\nQuestion 1\nQuestion 3\nQuestion 4\n\nUnlike the current questions, which are most accurate when used together, the proposed questions\ncan each stand alone as an individual lens through which to view other data. More information can be\nexplored by using the questions together and comparing the magnitude of the effect of each of the questions.\n\nSpring\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n17.269 Race, Ethnicity, and American Politics\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    }
  ]
}