{
  "course_name": "Reading Poetry",
  "course_description": "“Reading Poetry” has several aims: primarily, to increase the ways you can become more engaged and curious readers of poetry; to increase your confidence as writers thinking about literary texts; and to provide you with the language for literary description. The course is not designed as a historical survey course but rather as an introductory approach to poetry from various directions – as public or private utterances; as arranged imaginative shapes; and as psychological worlds, for example. One perspective offered is that poetry offers intellectual, moral and linguistic pleasures as well as difficulties to our private lives as readers and to our public lives as writers. Expect to hear and read poems aloud and to memorize lines; the class format will be group discussion, occasional lecture.",
  "topics": [
    "Humanities",
    "Literature",
    "Comparative Literature",
    "Criticism",
    "Poetry",
    "Humanities",
    "Literature",
    "Comparative Literature",
    "Criticism",
    "Poetry"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nCourse Description\n\n\"Reading Poetry\" has several aims: primarily, to increase the ways you can become more engaged and curious readers of poetry; to increase your confidence as writers thinking about literary texts; and to provide you with the language for literary description. The course is not designed as a historical survey course but rather as an introductory approach to poetry from various directions - as public or private utterances; as arranged imaginative shapes; and as psychological worlds, for example. One perspective offered is that poetry offers intellectual, moral and linguistic pleasures as well as difficulties to our private lives as readers and to our public lives as writers. Expect to hear and read poems aloud and to memorize lines; the class format will be group discussion, occasional lecture.\n\nCourse Requirements\n\nClass and Conference Participation, Oral Presentation: 20%\n\nGiven that the class format will be group discussion, your preparedness and class participation comprise a significant component of your grade. Class and conference attendance as well as active participation in both are required. You are expected to read the poems under discussion many times and come to class prepared to talk about them. Students may miss two classes during the semester for any reason. More than two unexcused class absences will drop your grade by a letter. More than three unexcused absences will be considered as grounds for failing the course. Students may miss two classes during the semester for any reason.\n\nYou are required to present a talk in class (approximately eight minutes) on an assigned poem on its assigned date. You may choose to present on one poem, two poems by a single poet, or a comparison of two poems by different poets that treat a subject or theme in different ways.\n\nIn writing and speaking about a poem, the most important thing to remember is that a poem is not an essay or a \"message,\" it is a thing imagined. As Vendler states: See how the theme of the poem is being imagined: how the literal statement of the poet's feeling has been transformed. Like music, a poem unfolds itself in time; it also exists spatially and is comprised of parts set in relation to each other. What parts does it fall into and how do they relate to one another in size, feeling, tone and language? Keep your eyes on the prize: words -- their turns of syntax, verb tenses -- the poem's line breaks -- that which distinguishes poetry from prose, who is speaking -- these are a few ways to begin to approach any poem.\n\nYour presentation on \"The Emperor of Ice Cream\" by Wallace Stevens or several poems by Dickinson, for example, could become the basis for one of your papers. Avoid poems previously discussed in class or poems that Vendler analyzes. A good presentation should be rehearsed and gauged for time; you may refer to notes without relying on them exclusively. Begin by slowly reading the poem(s) aloud; then, following the structure of an essay, your presentation should have a logical structure. Open with a strongly stated idea that you then develop or several questions that you then proceed to answer. Conclude decisively by offering a new insight derived from your analysis of the poem. In your delivery, face the group, speak loudly enough for all to hear, maintain eye contact with your audience. In both the presentations and the papers, the poem will always be your essential evidence, saving you from making generalizations and loosely based opinions.\n\nWritten Work: 80%\n\nThere will be four papers including one revision during the semester. Late essays will result in 1/3 letter grade reduction for every day (not class) they are overdue. The paper assignments will follow that of the oral presentation; each will be grounded in your primary response and evolving analysis of a poem that leads you to larger considerations of the poem as a whole. One of the goals of such an essay is to support what you assert with the language of the poem for an audience of interested readers.\n\nEssays will be graded on the quality of\nyour\nideas about the work and your ability to persuade readers why they matter within an essay structure that presents your ideas with the clarity good ideas deserve. For this course, the primary texts are the only ones you will need. Though we will read additional essays and letters, no secondary research will be expected.\n\n\"Use the dictionary. It's better than the critics.\"\n\nElizabeth Bishop to her students\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nOral work\n\n20%\n\nWritten work\n\n80%\n\nRequired Texts\n\nVendler, Helen.\nPoems, Poets, Poetry: An Introduction and Anthology\n. 2nd ed. New York, NY: Bedford/St. Martin's, 2002. ISBN: 9780312257064.\n\nRecommended Texts\n\nMerriam-Webster Dictionary\n. Springfield, MA: Merriam-Webster, 2005 (paperback). ISBN: 9780877796367.\n\nStrunk, William and E. B. White.\nElements of Style\n. New York, NY: Penguin, 2007. ISBN: 9780143112723.\n\nHacker, Diana.\nA Writer's Reference\n. 6th ed. New York, NY: Bedford/St. Martin's, 2009. ISBN: 9780312593322.\n\nPaper Format\n\nPoem titles should be enclosed in quotation marks. Papers deserve carefully considered titles that direct readers to the endeavor of your paper.\n\nSchedule for Papers\n\nPaper 1 (2 pages, 500 words): due Week #4\n\nPaper 2 (1300 words): Group A: due Week #6\n\nPaper 3 (1300 words): due Week #11\n\nPaper 4 (revision of 2nd or 3rd paper): due Week #13\n\nStudents are required to write a minimum of twenty pages of revised writing spread over four essays and reading responses. One oral presentation, some memorization, as well as active class participation are also required. The fourth essay will be a revision of one of your earlier papers. There will be no examinations.\n\nMIT Literature Statement on Plagiarism\n\nPlagiarism--use of another's intellectual work without acknowledgement--is a serious offense. It is the policy of the Literature Faculty that students who plagiarize will receive an F in the subject, and that the instructor will forward the case to the Committee on Discipline. Full acknowledgement for all information obtained from sources outside the classroom must be clearly stated in all written work submitted. All ideas, arguments, and direct phrasings taken from someone else's work must be identified and properly footnoted. Quotations from other sources must be clearly marked as distinct from the student's own work. For further guidance on the proper forms of attribution, consult the style guides available at the\nWriting and Communication Center\nand the\nMIT Web site on Plagiarism\n.\n\nCalendar\n\nWEEK #\n\nTOPICS\n\nKEY DATES\n\nIntroductions\n\nDiscussion of list of poets for presentation\n\nAssignment for Week #2 handed out\n\nYeats, W. B. \"To A Young Girl.\"\n\n------. \"When You Are Old.\"\n\n------. \"To Ireland In The Coming Times.\"\n\n------. \"The Song of Wandering Aengus.\"\n\n------. \"The Second Coming.\"\n\n------. \"Easter 1916.\"\n\n------. \"Never Give All The Heart.\"\n\nRecite 10 lines of a poem by either Dickens, Yeats, Blake\n\nWordsworth observations due in Week #3\n\nAssignment due\n\nYeats, W. B. \"\nThe Lake Isle of Innisfree\n.\"\n\nBackground on sonnets assignment due\n\nReadings assignment due\n\nStevens, Wallace. \"The House Was Quiet And The World Was Calm.\"\n\nShort quiz in class\n\nPaper 1 due\n\nReadings assignment due\n\nAdrienne Rich. \"Mother-in-law.\"\n\nHopkins, Gerard Manley. \"Pied Beauty.\"\n\nChapter 3. \"Poems as Pleasures.\" In\nPoems, Poets, Poetry: An Introduction and Anthology\n.\n\nDonne, John. \"Holy Sonnet 14.\"\n\n------. \"Holy Sonnet 10.\"\n\nStevens, Wallace. \"The House Was Quiet And The World Was Calm.\" (cont.)\n\nHopkins, Gerard Manley. \"As Kingfishers Catch Fire, Dragonflies Draw Flame.\"\n\nKeats, John. \"Letter on Negative Capability, 1818.\"\n\nChapter 6. \"Constructing A Self.\" In\nPoems, Poets, Poetry: An Introduction and Anthology\n.\n\nWhitman, Walt. \"Beginning My Studies.\"\n\n------. \"Song of Myself.\"\n\nPaper 2 due\n\nColeman, Wanda. \"Wanda Why Aren't You Dead.\"\n\nWhitman, Walt. \"Vigil Strange I Kept on the Field One Night.\"\n\nEliot, T. S. \"The Love Song of J. Alfred Prufrock.\"\n\nBishop, Elizabeth. \"At the Fishhouses.\"\n\n------. \"One Art.\"\n\n------. \"In the Waiting Room.\"\n\nVendler, Helen. \"Sestina.\"\n\nEliot, T. S. \"The Love Song of J. Alfred Prufrock.\" (cont.)\n\nEliot, T. S. \"Tradition and the Individual Talent.\"\n\nRecite 15-25 lines of your choosing\n\nPaper 3 due\n\nWriting workshop\n\nWallace Stevens journal note\n\nBishop on Darwin\n\nLast class\n\nBring the original graded paper that you are revising.\n\nBring a printed copy of \"In the Waiting Room\" and the Vendler anthology.\n\nCome prepared to discuss Bishop's \"At the Fishhouses.\"\n\nPaper 4 due\n\nPaper 4 revision assignment due",
  "files": [
    {
      "category": "Resource",
      "title": "A Holy Paradox",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-004-reading-poetry-spring-2009/31050417901f32e9c266414d00294cf1_MIT21l_004s09_sw03_Lilys_Paper.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.004 Reading Poetry\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nXu 1\nMIT Student\n1L.004.02\nrof. Kimberly Vaeth\nP\n\nA Holy Paradox\nIn his fourteenth Holy Sonnet, John Donne suffers acute spiritual turmoil and\npresents an impassioned prayer to God. The speaker's pleas express a desire for religious\nfaith and spiritual union. The sonnet, centered on Christian faith, embodies a holy paradox,\nwhich states that although God gives us reason, reason itself is what contradicts our faith.\nDonne states exactly this paradox in lines seven to eight, the heart of the poem. \"Reason,\nYour viceroy in me, me should defend, / But is captived, and proves weak or untrue (7, 8).\"\nA paradox is a contradiction that contains some sort of truth. By presenting a series of\nsemantic paradoxes, Donne argues that the truth behind the paradox is that God can renew\nfaith without reason.\nWithin this one powerful statement, Donne mentions God's contribution of reason\nas a \"viceroy\", a word typically associated with power, to highlight its significance. He\nbelieves that reason, as a gift from God, should provide verification of his existence. Instead,\nreason \"proves weak or untrue\" (8), and the truth behind the paradox states that in terms\nof faith, reason is weak. In order to convey the weakness of reason and the power of faith,\nDonne presents four paradoxes in his sonnet, all of which are logically contradictory, but\nupon further analysis, reveal some degree of truth.\n\nThese four paradoxes are clustered in pairs and manifested in ways that transform\nthe movement of the poem. The first two are located in the opening quatrain before the\nspeaker bemoans the weakness of reason. Donne requests God to \"o'erthrow\" him so that\nhe \"may rise and stand.\" Donne juxtaposes this obvious contradiction with the holy\n\nXu\nparadox, which says reason, though given by God, contradicts faith. At first, the cause and\neffect seem contradictory. How does being overthrown help one rise and stand? However,\nthere is a hint of renewal and re-growth in this contradiction, just as there is renewal in\nfaith from God. Politically, person who has been overthrown can certainly fight their way\nback and \"rise and stand\" once more. Biblically, the act of rising and standing is often\nassociated with Jesus and the resurrection, which is another reference to renewal. Because\nthere is truth behind the contradiction that one being overthrown can rise and stand, the\nstatem\nent can be considered a paradox.\nThe intensity of the speaker's demands increase exponentially in the second\ncontradiction, which is located within the same sentence as the first contradiction involving\nbeing overthrown. The speaker continues to plea to God, \"bend / Your force to break, blow,\nburn, and make me new\" (5). One violent desire to be overthrown suddenly evolves into a\nslew of demands. Donne amplifies the amount and power of the demands by using\nalliteration in the words \"break, blow, burn\" to create a vigorously acute bum, bum, bum\nrhythm, which mimicks an actual physical beating. Once again, Donne uses the theme of\nrenewal. The speaker wants God to \"break, blow, burn\" him so that he can be made new.\nAgain, this statement is contradictory, but the theme of renewal persists as Donne implies\nthe emergence of a transformation very similar to the resurrection of Jesus.\nIn the second line, the speaker declares angrily that the only thing God does is\n\"knock, breathe, shine, and seek to mend (2).\" These acts refer to the three-personed God\nwho knocks upon a person's door for acceptance, breathes the breath of life, and shines the\nlight of truth. Although the holy trinity links and creates parallelism between the two\nphrases, \"knock, breathe, shine,\" and \"break, blow, burn,\" they are strikingly different. The\n\nXu 3\nwords \"breathe,\" \"shine,\" and \"seek to mend,\" are gentle, whereas the aggressiveness of the\nwords \"break, blow, burn\" foreshadow a continuation of the poem's brutality.\nThe second set of contradictions is located after the speaker has revealed his\nstruggle between reason and faith. \"Take me to you, imprison me, for I, / Except you\nenthrall me, never shall be free\" (12, 13). The speaker demands that God \"imprison (him)\"\nso that he \"shall be free.\" Much like the first contradictions where the speaker demands to\nbe overthrown, broken, blown, and burnt, the forceful actions he desires from God still do\nnot logically yield the results he desires. Being overthrown does not help one stand, and\nbeing broken does not make one new. Through the same logic, imprisonment does not lead\nto freedom. As a matter of fact, by stating that imprisonment is the exact opposite of\nfreedom, Donne ventures more boldly than before in his statements on the clash between\nreason and faith.\nThe second contradiction in the last quatrain turns out to be even more shocking.\n\"Nor ever chaste, except You ravish me\" (14). The speaker asks God to rape him so that he\nmay be chaste! These last contradictions surpass the standard criteria of violence and enter\na new realm involving sensual innuendo. Imprisonment and rape uncover and insinuate a\ngrossly romantic and sexual relationship between the speaker and God. In line ten, Donne\nalludes to marriage with the enemy to demonstrate the disconnect he feels from God. \"But\nam betrothed unto your enemy; / Divorce me, untie or break that knot again\" (10, 11).\nAgain, the speaker is requesting God to act in a sexual manner through divorce and\nmarriage. Whereas the first cluster of contradictions is composed of almost typical action\nwords such as overthrow, break, blow, and burn, Donne's second set explodes with\nperverseness. This intensification in both sexual content and word choice serves to\n\nXu 4\nstrengthen the passion of the sonnet and ultimately the contradiction within the holy\nparadox.\nTo conclude my idea that Donne uses contradictions to illustrate the holy paradox, I\nwould like to point out that the entire sonnet in itself could be considered an extended\nparadox that further validates the holy paradox in question. The poem can debatably be\nconsidered an argument between the speaker and God. However, the act of fighting for\nreligious faith contradicts the very principle of accepting God through faith. By providing\nnumerous logical contradictions, Donne confirms his idea of the holy paradox within\nChristianity. Each repetition proceeds to strengthen his argument, which states that reason,\ngiven by God, contradicts our very method of accepting God.\n\nBibliography\nVendler, Helen. Poems, Poets, Poetry: An Introduction and Anthology. Boston:\nBedford/St. Martins, 2002."
    },
    {
      "category": "Resource",
      "title": "Essay Guidelines",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-004-reading-poetry-spring-2009/0643e9587a28e83f48b1731f6f803711_MIT21l_004s09_assn05_essay.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.004 Reading Poetry\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nDo's and Don'ts for your essays\nNote: these are things you should think about after you've done most of the work of writing your\npaper. In other words, have ideas and build argument first, edit last.\n\nDo:\n\n1. Assume the reader knows the basics (e.g., Shakespeare is famous, a sonnet has 14 lines,\netc.).\n2. Be concise.\n3. Focus on the language of the poem.\n4. Write your introduction last, and use it to explain what, specifically, you will talk about in\nthe essay.\n5. Try reading your sentences out loud to see if they make sense, and whether you can think\nof a simpler/clearer way to phrase key points.\n\nDon't:\n\n1. Give your essay an uninformative title: e.g., \"To His Coy Mistress\". (As opposed to, say:\n\"To His Coy Mistress: A Convincing Argument for Sex\").\n2. Begin with the history of the world: e.g., \"Since the beginning of time, people have fallen\nin love.\"\n3. Dangle modifiers: e.g., \"Reading your paper, dangling modifiers struck my eye.\" The\nunderlined phrase (typically, modifying phrases begin with \"[verb]-ing\") modifies or describes\nthe grammatical subject of the sentence's main verb; here, the subject is \"modifiers\". Fix it so\nmodifier and subject match: e.g., 1. \"Reading your paper, I was struck by the number of dangling\nmodifiers\"; 2. \"As I read your paper, dangling modifiers struck my eye.\"\n4. Begin sentences with \"This\" as subject\": e.g., \"This is what the sonnet is really about.\" Fix\nthe problem by adding (at least) a noun: e.g., \"This conflict [+ between virtue and desire] is what\nthe sonnet is really about.\n5. Overuse forms of \"to be\" (only if you have time to edit for style): e.g., revise the above as\n\"this sonnet centers on the conflict between virtue and desire.\"\n6. Quote bits of poems such that the resulting grammar of either the quotation or your\nsentence isn't clear: e.g., \"Shakespeare writes `when in disgrace with' to say that he is sometimes\nlooked down on by others.\" Fix it so that meaning and grammar are clear by choosing a slightly\ndifferent bit to quote: \"Shakespeare writes that he is sometimes `in disgrace with fortune and\nmen's eyes,' or out of favor both with cosmic forces and other people.\""
    },
    {
      "category": "Resource",
      "title": "Murder me so I may Live: Donne’s Paradox of Redemption",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-004-reading-poetry-spring-2009/478374857875dfd342098cb45169810c_MIT21l_004s09_sw02_DannysPaper.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.004 Reading Poetry\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nKatz 1\nMIT Student\n21L.004: Reading Poetry\nProf. Kimberly Vaeth\n\nMurder me so I may Live: Donne's Paradox of Redemption\n\nJohn Donne's \"Holy Sonnet 14\" is concerned with supplication, action, and violence.\nThe speaker begs God to perform seemingly brutal actions against him, pleading with God to\n\"batter [his] heart\" (1), to \"break, blow, [and] burn\" (4) him, to \"imprison\" him (12), and to\n\"ravish\" him (14). Because the poem is in Petrarchan form, the octet poses the speaker's\npowerlessness in coming back to God from his 'marriage' with the \"enemy\" (11) and the\nsestet carries the reader to the speaker's vision of how he will be able to \"break that knot\" (11)\nwith the \"enemy\" and experience God in His entirety. As we are carried through this sestet,\nthe speaker asks God to \"divorce\" (11) him from this \"enemy,\" (10) - clearly temptation or\nsin - and to \"imprison\" him (12). In the last couplet, which serves as the poem's main focal\npoint, Donne uses sexual and war-like imagery and parallel structure to establish this vision\nwith a paradox; the speaker argues that he \"never shall be free\" unless God \"enthralls\" him\n(13) and that he will never be \"chaste\" unless God \"ravish[es]\" him (14). Essentially, God\nmust reduce the speaker to nothing through seemingly un-Christian actions so that he can be\n\"made new\" (4) and pure, as this reduction will lead the speaker to be reborn again with a\nnew purpose.\nThe form and structure of the poem largely shapes this vision of rebirth and influences\nthe meaning of the work. The poem has no clear recurring metric structure in the octet, and is\ncharacterized by many caesuras, like in line four, \"Your force, to break, blow, burn, and make\n\nKatz 2\nme knew\" (4). Donne's constant use of commas in this line breaks up the line and fragments\nit, which characterizes the octet as a whole. However, there is a shift at the beginning of the\nsestet, keyed by the word \"yet\" (9), as the speaker confesses his love for God. After this\nturning point, the poem becomes more and more metrically structured and uses increasingly\nfluent syntax until we reach the last couplet, with both lines composed in iambic pentameter,\nfinally giving the poem a structural pattern. The entire couplet has only two pauses, greatly\ncontrasting with the octet, which develops a sense of fluency. This increasing structure\nalludes to the development of the speaker's vision, as he strives for redemption.\n\nThis rebirth is contingent on the speaker being completely engulfed and \"captived\" (8)\nby God, which is established in the parallel structure of the last couplet. The first line reads\n\"Except You enthrall me, never shall be free\" (13) with God's action first and the\nconsequence for the speaker coming second. This pattern shifts in the second line, \"Nor ever\nchaste, except you ravish me\" (14), as we are first introduced to the ramifications for the\nspeaker and then we are given God's action. This disparity engenders a significant\nprogression that alludes to the speaker's vision. With a pattern of \"God, speaker, speaker,\nGod,\" God's actions clearly surround the speaker, hinting that this rebirth centers on the\nspeaker being \"imprisoned\" (12) and completely taken over by God's presence.\n\nThis 'takeover' in the climactic last two lines is explicitly characterized through the\nviolent war-like and sexual imagery in the couplet that seems to repeat itself throughout the\nentire poem, which sets the stage for the speaker's seemingly unusual vision of redemption\nby showing the extent he would go to if it would bring him closer to God and allow him to\nexperience God in His entirety, even if that meant enslavement. The first line of the couplet is\n\nKatz 3\ncharacterized by this war-like imagery, as the speaker argues that unless God \"enthralls\" him,\nhe \"never shall be free.\" Imprisonment imagery arises many times throughout the poem, as\nearly as the first line. The speaker begs with God to \"batter his heart,\" (1) which creates the\nimage of soldiers with a battering ram trying to break down gates. Essentially, from the onset\nof the poem, the speaker wants God to \"break down the walls\" that shield his heart so that his\ntrue emotions and passions can \"breathe\" and shine\" (2) and he can be \"made new\" (4). This\nimage of a battering ram is further characterized with the violence at the conclusion of the\nfourth line, with \"force,\" break,\" \"blow,\" and \"burn\" (4) painting a very brutal image while\ncarrying the reader to the speaker's new metaphor in line five. Now, the speaker elects to use\na new agent, as he likens himself to a \"usurped town.\" (5) The speaker argues that his\n\"Reason\" (7) is \"captived,\" (8) and pleads for God to \"takeover\" and \"o'erthrow\" (3) this\n\"town\" so that he may be true to God again. This imagery prepares the reader for the\nspeaker's vision, as these violent images clearly suggest that God must take drastic measures\n- \"break\" his heart\", \"overthrow\" his \"town,\" and even enslave him - so that the speaker may\nreach redemption and explore all that God has to offer.\n\nThis is further characterized through the sexual imagery throughout the poem as well, as\nthe author uses these sexual images to set the tone for the extremity of the last couplet,\nreaching a major climax when the speaker essentially asks God to rape him so that he may be\n\"chaste.\" However, this rape is implicit in much of the earlier imagery, which serves to\nprepare the reader for just how drastic of a solution the speaker proposes. This is especially\nevident in line three, where the author uses \"That I may rise and stand\" to signify an erection.\nHe carries this image throughout the line, as he begs with God to \"o'erthrow\" and \"blow\" (4)\n\nKatz 4\nhim, clearly referring to a sexual act. Interestingly, the author enjambs lines three and four, so\nthat although the author actually asks God to \"bend [His] force,\" we are given an image of\nthe speaker bent over in front of God, due to the line break. This sexual imagery is once again\nreferred to when the speaker compares himself to a \"usurped town.\" Here, the speaker argues\nthat he \"labors to admit\" (6) God, alluding to the pain involved in 'admitting' or 'letting God\nin' through sexual intercourse. This sexual imagery reaches its peak when the speaker begs\nGod to outright \"ravish\" him in the last line. Through this imagery, the author reveals the\nspeaker's desperate nature in his plea that God must commit radical actions so that he may be\npure again.\n\nThrough the parallel structure and violent imagery in the last couplet, we are given a\nmold of what the speaker feels is necessary for his rebirth in God's grace. The paradox in this\nlast couplet leads us to question the speaker's actual intentions in terms of his image of\nrebirth. Whether or not he truly wants God to capture him and rape him, it is quite clear that\nthese actions at least serve as a metaphor for the speaker's vision of what he needs for\nredemption. He ultimately realizes that he is 'married to the wrong person' in the sense that\nhe hasn't been leading the lifestyle he knows he should, and feels that going to God is a large\nstep in the direction toward being who he wants to be. He is willing to do whatever it takes,\neven offer himself up for enslavement or rape, as long as these actions would allow him to be\nwith God. Through actions typically associated with God's \"enemy\" (10), the speaker feels\nthat he may be able to \"break that knot\" (11) that unites him with temptation and sin, the\nembodiment of this \"enemy.\" By reducing the speaker to this level, where he has felt the pain\nand anguish of what union with sin can engender, he feels that he will have the power to\n\nKatz 5\n\"divorce\" (11) the enemy and to be \"made new\" and pure once again, finding his sought after\nredemption.\n\nWorks Cited\nVendler, Helen. Poems, Poets, Poetry: An Introduction and Anthology. 2nd. New York, New\nYork: Bedford-St. Martin's, 2002."
    },
    {
      "category": "Resource",
      "title": "Notes on the sonnet",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-004-reading-poetry-spring-2009/23cada3a6a2dd91649426cc66e9926b3_MIT21l_004s09_assn07_sonnets.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.004 Reading Poetry\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nNotes on the sonnet\n\nGenre\nA sonnet = 14 lines. Rhyme (and sometimes grammar) usually divides it into two\nparts: 8 + 6, or (4+4) + (3 +3), or (4+4) + (4 +2). The two most general sorts - the\nElizabethan form, with three quatrains and a couplet, or the Italian or Petrarchan\nkind, with an octave (abba, abba) and a sestet (various groupings of cde)\n\nHistory\nEnglish poets got the idea of writing this way from two Italians who wrote in the\n1300's: Dante and Petrarch. Dante's Vita Nuova was in autobiographical account\nin prose of his lifelong love for a young girl, Beatrice, beginning when they were\nchildren and continuing after her early death. Embedded in the narrative are a\nseries of poems inspired by this love, accompanied by Dante's own technical\ncommentary; the book is also an account of Dante's early career as a poet learning\nto write in his native language (as opposed to Latin). What he invented -- a\nsequence of vernacular love poetry addressed to a single object -- seems\noverwhelmingly obvious now. Really, that is a testament to the power and\ninfluence of Dante's innovation.\n\nA generation of poets some 50 years before Shakespeare worked at translating into\nEnglish another sequence of Italian sonnets, by Dante's successor Petrarch, and\nmastering in English formal requirements (rhyme scheme for example) that were\nfar easier to do in Italian (because many more words end with similar sounds).\nSpenser's sonnet 67, for instance, translates a poem by Petrarch which was also\ntranslated by Thomas Wyatt decades earlier (you can find it in the Norton as\n\"Whoso list to hunt\"). Think of it as akin to doing a cover of someone else's song;\nin any event, Dante and Petrarch's topic of a long, unrequited love and their form\nof tightly rhymed 14-line sonnets in groups proved inspirational to Shakespeare's\ngeneration.\n\nYeats and Wordsworth\nYeats' \"Leda and the Swan\" is a rhyming sonnet that seems to have been\nphysically traumatized. The first two quatrains float free, while the third quatrain\nis cleft crosswise, its final segment dangling precariously. Wordsworth's \"The\nWorld is Too Much With Us\" is a rhyming sonnet: abba, abba, cdcdcd; the rhyme\nscheme is Petrarchan or in two parts - 8 lines + 6 lines."
    },
    {
      "category": "Resource",
      "title": "Strategies for writing an effective introduction",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-004-reading-poetry-spring-2009/e7e430584db0a825da4f5a280720d2c3_MIT21l_004s09_assn06_revision.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.004 Reading Poetry\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nHandout taken from: http://www.unc.edu/depts/wcweb/handouts/introductions.html\nStrategies for writing an effective introduction\n-\nStart by thinking about the question. Your entire essay will be a response to the\nassigned question, and your introduction is the first step toward that end. Your\ndirect answer to the assigned question will be your thesis, and your thesis will be\nincluded in your introduction, so it is a good idea to use the question as a jumping\noff point. Imagine that you are assigned the following question:\n-\nEducation has long been considered a major force for American social change,\nrighting the wrongs of our society. Drawing on The Narrative of the Life of\nFrederick Douglass, discuss the relationship between education and slavery in\n19th-century America. Consider the following: How did white control of\neducation reinforce slavery? How did Douglass and other enslaved African\nAmericans view education while they endured slavery? And what role did\neducation play in the acquisition of freedom? Most importantly, consider the\ndegree to which education was or was not a major force for social change with\nregard to slavery.\n-\nYou will probably refer back to this question extensively as you prepare your\ncomplete essay, and the question itself can also give you some clues about how to\napproach the introduction. Notice that the question starts with a broad statement,\nthat education has been considered a major force for social change, and then\nnarrows to focus on specific questions from the book. One strategy might be to\nuse a similar model in your own introduction --start off with a big picture\nsentence or two about the power of education as a force for change as a way of\ngetting your reader interested and then focus in on the details of your argument\nabout Douglass. Of course, a different approach could also be very successful, but\nlooking at the way the professor set up the question can sometimes give you some\nideas for how you might answer it. Keep in mind, though, that even a \"big\npicture\" opening needs to be clearly related to your topic; an opening sentence\nthat said \"Human beings, more than any other creatures on earth, are capable of\nlearning\" would be too broad.\n-\nTry writing your introduction last. You may think that you have to write your\nintroduction first, but that isn't necessarily true, and it isn't always the most\neffective way to craft a good introduction. You may find that you don't know\nwhat you are going to argue at the beginning of the writing process, and only\nthrough the experience of writing your paper do you discover your main\nargument. It is perfectly fine to start out thinking that you want to argue a\nparticular point, but wind up arguing something slightly or even dramatically\ndifferent by the time you've written most of the paper. The writing process can be\nan important way to organize your ideas, think through complicated issues, refine\nyour thoughts, and develop a sophisticated argument. However, an introduction\nwritten at the beginning of that discovery process will not necessarily reflect what\nyou wind up with at the end. You will need to revise your paper to make sure that\nthe introduction, all of the evidence, and the conclusion reflect the argument you\nintend. Sometimes it helps to write up all of your evidence first and then write the\n\nintroduction--that way you can be sure that the introduction matches the body of\nthe paper.\n-\nDon't be afraid to write a tentative introduction first and then change it later.\nSome people find that they need to write some kind of introduction in order to get\nthe writing process started. That's fine, but if you are one of those people, be sure\nto return to your initial introduction later and rewrite if necessary.\n-\nOpen with an attention grabber. Sometimes, especially if the topic of your\npaper is somewhat dry or technical, opening with something catchy can help.\nConsider these options:\n1. an intriguing example (for example, the mistress who initially teaches\nDouglass but then ceases her instruction as she learns more about slavery)\n2. a provocative quotation (Douglass writes that \"education and slavery were\nincompatible with each other\")\n3. a puzzling scenario (Frederick Douglass says of slaves that \"[N]othing has\nbeen left undone to cripple their intellects, darken their minds, debase their\nmoral nature, obliterate all traces of their relationship to mankind; and yet\nhow wonderfully they have sustained the mighty load of a most frightful\nbondage, under which they have been groaning for centuries!\" Douglass\nclearly asserts that slave owners went to great lengths to destroy the\nmental capacities of slaves, yet his own life story proves that these efforts\ncould be unsuccessful.)\n4. a vivid and perhaps unexpected anecdote (for example, \"Learning about\nslavery in the American history course at Frederick Douglass High\nSchool, students studied the work slaves did, the impact of slavery on their\nfamilies, and the rules that governed their lives. We didn't discuss\neducation, however, until one student, Mary, raised her hand and asked,\n'But when did they go to school?' That modern high school students could\nnot conceive of an American childhood devoid of formal education speaks\nvolumes about the centrality of education to American youth today and\nalso suggests the significance of the deprivation of education in past\ngenerations.\")\n5. a thought-provoking question (given all of the freedoms that were denied\nenslaved individuals in the American South, why does Frederick Douglass\nfocus his attentions so squarely on education and literacy?)\n-\nPay special attention to your first sentence. Start off on the right foot with your\nreaders by making sure that the first sentence actually says something useful and\nthat it does so in an interesting and error-free way.\n-\nBe straightforward and confident. Avoid statements like \"In this paper, I will\nargue that Frederick Douglass valued education.\" While this sentence points\ntoward your main argument, it isn't especially interesting. It might be more\neffective to say what you mean in a declarative sentence. It is much more\nconvincing to tell us that \"Frederick Douglass valued education\" than to tell us\nthat you are going to say that he did. Assert your main argument confidently.\nAfter all, you can't expect your reader to believe it if it doesn't sound like you\nbelieve it!\n\nHow to evaluate your introduction draft\nAsk a friend to read it and then tell you what he or she expects the paper will discuss,\nwhat kinds of evidence the paper will use, and what the tone of the paper will be. If your\nfriend is able to predict the rest of your paper accurately, you probably have a good\nintroduction.\nFive kinds of less effective introductions\n1. The place holder introduction. When you don't have much to say on a given topic, it\nis easy to create this kind of introduction. Essentially, this kind of weaker introduction\ncontains several sentences that are vague and don't really say much. They exist just to\ntake up the \"introduction space\" in your paper. If you had something more effective to\nsay, you would probably say it, but in the meantime this paragraph is just a place holder.\nExample: Slavery was one of the greatest tragedies in American history. There were\nmany different aspects of slavery. Each created different kinds of problems for enslaved\npeople.\n2. The restated question introduction. Restating the question can be an effective\nstrategy, but it can be easy to stop at JUST restating the question instead of offering a\nmore effective, interesting introduction to your paper. The professor or teaching assistant\nwrote your questions and will be reading ten to seventy essays in response to them--he\nor she does not need to read a whole paragraph that simply restates the question. Try to\ndo something more interesting.\nExample: Indeed, education has long been considered a major force for American social\nchange, righting the wrongs of our society. The Narrative of the Life of Frederick\nDouglass discusses the relationship between education and slavery in 19th century\nAmerica, showing how white control of education reinforced slavery and how Douglass\nand other enslaved African Americans viewed education while they endured. Moreover,\nthe book discusses the role that education played in the acquisition of freedom. Education\nwas a major force for social change with regard to slavery.\n3. The Webster's Dictionary introduction. This introduction begins by giving the\ndictionary definition of one or more of the words in the assigned question. This\nintroduction strategy is on the right track--if you write one of these, you may be trying to\nestablish the important terms of the discussion, and this move builds a bridge to the\nreader by offering a common, agreed-upon definition for a key idea. You may also be\nlooking for an authority that will lend credibility to your paper. However, anyone can\nlook a word up in the dictionary and copy down what Webster says-- it may be far more\ninteresting for you (and your reader) if you develop your own definition of the term in the\nspecific context of your class and assignment. Also recognize that the dictionary is also\nnot a particularly authoritative work--it doesn't take into account the context of your\ncourse and doesn't offer particularly detailed information. If you feel that you must seek\n\nout an authority, try to find one that is very relevant and specific. Perhaps a quotation\nfrom a source reading might prove better? Dictionary introductions are also ineffective\nsimply because they are so overused. Many graders will see twenty or more papers that\nbegin in this way, greatly decreasing the dramatic impact that any one of those papers\nwill have.\nExample: Webster's dictionary defines slavery as \"the state of being a slave,\" as \"the\npractice of owning slaves,\" and as \"a condition of hard work and subjection.\"\n4. The \"dawn of man\" introduction. This kind of introduction generally makes broad,\nsweeping statements about the relevance of this topic since the beginning of time. It is\nusually very general (similar to the place holder introduction) and fails to connect to the\nthesis. You may write this kind of introduction when you don't have much to say--which\nis precisely why it is ineffective.\nExample: Since the dawn of man, slavery has been a problem in human history.\n5. The book report introduction. This introduction is what you had to do for your fifth-\ngrade book reports. It gives the name and author of the book you are writing about, tells\nwhat the book is about, and offers other basic facts about the book. You might resort to\nthis sort of introduction when you are trying to fill space because it's a familiar,\ncomfortable format. It is ineffective because it offers details that your reader already\nknows and that are irrelevant to the thesis.\nExample: Frederick Douglass wrote his autobiography, Narrative of the Life of\nFrederick Douglass, An American Slave, in the 1840s. It was published in 1986 by\nPenguin Books. He tells the story of his life.\nWorks consulted\nAll quotations are from Frederick Douglass, Narrative of the Life of Frederick Douglass,\nAn American Slave, edited and with introduction by Houston A. Baker, Jr., New York:\nPenguin Books, 1986.\n\nFrom: http://www.nd.edu/~writing/resources/TopicSentences.htm\nTopic Sentences\nWhat are they?\nNever underestimate the power of the Topic Sentence. Having little or no focus to your\nparagraph, or with-holding the point of your paragraph until the end of the paragraph\nmakes your essay seem like random babbling. You may have great ideas, killer words\nand concepts, but they are nothing without making your point clear. You will have a\nthesis for your paper. Topic Sentences derive from that thesis and are the supporting\npoints that develop it.\nTopic Sentences are like theses for your paragraphs. Each paragraph has a function, and\nso each paragraph must have a sentence that gives the paragraph direction, just as the\nthesis of your essay gives your essay direction. Usually they go at the beginning of your\nparagraphs, for the sake of clarity.\nYou should be able to read only your Introduction and the Topic Sentence for each\nparagraph - and be able to understand exactly how the argument unfolds\nWhat do they do?\nTopic Sentences verify and substantiate your thesis. One way to develop this habit is to\nuse key-terms from your thesis in each of your Topic Sentences. This reminds the reader\nthat they are on the right path, headed in the right direction, as well as where they have\nbeen and how they got where they are now. This need for clarity and connection makes\nthose transitional phrases so crucial in developing Topic Sentences.\nTopic Sentences should be in your own words. Topic Sentences should NEVER be\nsomeone else's words. While you need evidence to support every claim you make, it\nis your brilliance, and your brilliant ideas and thoughts that should lead (and close)\nevery paragraph. This will also help your flow.\nTopic Sentences should create a framework for the structure of your argument.\nIf your thesis is a road-map for your essay, then Topic Sentences are like the signs\nalong the freeway that tell you what's up ahead (in the paragraph) and, through careful\norganization, approximately when and what it will take to reach your destination\n(Conclusion).\nTopic Sentences reflect your organization, so if you can't make a clear Topic Sentence,\nthere's a pretty good change that your paragraph (and possibly your paper) needs re-\nthinking, and direction. One way of working with Topic Sentences is to create a Reverse\nOutline - an outline in which you write out your thesis, and follow that with the full and\ncomplete Topic Sentence for each paragraph, so that you can visually assess what needs\nre-organizing.\n\nSample Introductions\nNot-so-good introductions:\nIf to love is to live, then to love and have that love ignored is to live a life filled\nwith sorrow and doubt. Love is terrible and great and the worst is that it is unrelenting, no\nmatter how indifferent its intended recipient may be. The American Heritage dictionary\ndefines loves as: \"a feeling of intense desire and attraction toward a person.\" Sir Philip\nSidney's sonnet 31 from Astrophil and Stella is about the confusion and anguish that such\na one-sided love causes. Sidney uses literary techniques in his poem to talk about this\nconfusion and anguish of love.\n\n--\n\nThroughout history, love has been defined as some sort of intense emotional\nattachment or affection. However, it must be seen as an epic battle between the heart and\nthe mind. In sonnet 33 of Sir Philip Sidney's Astrophil and Stella, the speaker describes\nthe end of a constituent struggle.\n\nBetter Introductions:\n\nIn order for a poet to establish trust and a sense of purpose from his reader, he must\nestablish a certain \"sense of self.\" There are no limits on what type of speaker this \"self\"\nis derived from, (ie. the poet, a daughter, or an inanimate object) but it must be consistent\nand draw the reader into the poem. In many cases this \"self\" is a reflection of its writer.\nTwo examples of this are Elizabeth Bishop's \"In the Waiting Room,\" and Walt\nWhitman's \"Song of Myself\" (sections 1 and 24). In Bishop's poem, she adopts the\npersona of her six year old self and takes a journey through the waiting room of a\nWorcester, Massachusetts, dentist office. In contrast Whitman's \"Song\" is a celebration\nof his thirty seven year old self, all that he is and will become. Both poems exhibit a\nstrong sense of the poets' personality which ultimately drives a journey of self discovery,\nand thrusts the reader deeply into the ideas of the poem.\n\n--\n\n\"I Saw in Louisiana a Live Oak Growing\" by Walt Whitman and \"One Art,\" by\nElizabeth Bishop, are two differently structured poems concerned with diverse concepts\nand ideas. \"I Saw in Louisiana a Live Oak Growing,\" is a free verse poem concerned\nwith the speaker's fascination that a \"live-oak\" (1) can \"utter joyous leaves\" (16)\n\"without a friend\" or \"a lover near,\" (16) something which he realizes \"he could not [do]\"\n(7). In \"One Art,\" a villanelle, Bishop presents losing as an \"art\" (1) that can be\n\"master[ed],\" (1) but has trouble maintaining this stance when she must address \"losing\n\nyou,\" (16) clearly referring to a lover. Although these two poems are concerned with\ndifferent ideas and have vastly contrasting forms, both authors use a series of\nprogressions dealing with structure, form, punctuation, and verb tense that serve to\nmodify and extend the speaker's final conclusion. In \"I Saw in Louisiana a Live-Oak\nGrowing,\" Whitman uses these progressions to modify and strengthen his own speaker's\nconclusion, evolving from \"I knew I could not\" (7) to \"I know very well I could not\"\n(17). In \"One Art,\" Bishop uses these same progressions to cast doubt on her speaker's\ninitial conclusion rather than reinforce it, as she ultimately shifts from \"the art of losing\nisn't hard to master\" (1) to \"the art of losing's not too hard to master\" (18). Ultimately,\nboth authors employ these same techniques to work for a common goal - to present an\naltered and more developed version of the speaker's opening ideas by the poem's end."
    },
    {
      "category": "Resource",
      "title": "The house was quiet and the world was calm",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-004-reading-poetry-spring-2009/cccd21ba7a15ee0f857d8d38c5eb7de5_MIT21l_004s09_sw01_TonysPaper.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.004 Reading Poetry\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nTony McDonald\n21L.004 Reading Poetry\nProf. Kimberly Vaeth\nThe House Was Quiet And The World Was Calm\n\nThe house was quiet and the world was calm.\nThe reader became the book; and summer night\n\nWas like the conscious being of the book.\nThe house was quiet and the world was calm.\n\nThe words were spoken as if there was no book,\nExcept that the reader leaned above the page,\n\nWanted to lean, wanted much to be\nThe scholar to whom his book is true, to whom\n\nThe summer night is like a perfection of thought.\nThe house was quiet because it had to be.\n\nThe quiet was part of the meaning, part of the mind:\nThe access of perfection to the page.\n\nAnd the world was calm. The truth in a calm world,\nIn which there is no other meaning, itself\n\nIs calm, itself is summer and night, itself\nIs the reader leaning late and reading there.\n-Wallace Stevens\n\nIn his poem \"The House was Quiet and the World was Calm,\" Wallace Stevens uses a\ncombination of literal and abstract images to define truth. This approach may seem to be\ncumbersome, but Stevens expertly navigates it through the use of poetic devices and structure.\nAs the poem is read, a description of a \"reader\" on a \"quiet\" \"night\" unfolds into a concrete\ndefinition of \"truth.\" The description is driven through the use of repetition of concrete ideas.\nThe definition sharply contrasts the concreteness of the description and the turning point between\nthem adds emphasis to Stevens' definition.\nThrough the use of this turning point and concrete repetition, Stevens produces a poem which\n\ndefines truth in a believable and trustworthy manner.\n\nThe first twelve lines of \"The House was Quiet and the World was Calm\" read smoothly,\nalthough some of the metaphors introduced in them are quite complex. There are no clear\nchanges in verb tense, and the series of images are quite literal. Stevens begins with, \"The house\nwas quiet and the world was calm.\" Both images from this line are concrete and common. One\ncould easily imagine a quiet house and a calm world, or at least a calm area surrounding the\nhouse. The thirteenth line, which is: \"And the world was calm . The truth in a calm world,\"\ncontrasts sharply with the previous twelve. It is the first and only time in the poem in which a\nsentence begins in the middle of a line. Also it is the first time in which the subject of the\nsentence is not entirely tangible. The contrast becomes even clearer when the thirteenth line is\nread with the last three lines: \"The truth in a calm world, / In which there is no other meaning,\nitself/ Is calm, itself is summer and night, itself/ Is the reader leaning late and reading there.\"\nWhen compared to the first line, one can see a clear change in verbiage as Stevens transitions\nfrom the use of \"was\" to \"is.\" Also these lines repeat \"itself,\" which one could infer refers to\ntruth and through this repetition, Stevens engenders a clear and tangible definition for truth. In\nessence, Stevens uses the last four lines of the poem to state, \"the truth...is calm...summer and\nnight...[and,] the reader leaning late and reading [in the house].\" Although the two parts of\nStevens' poem can be easily separated and defined, their purpose is not self explanatory.\n\nOn a first read, Stevens' thirteen line description of a reader in a quiet house is quite\nconvoluted. The first six stanzas seem to make up a description, but their individual phrases are\ndifficult to interpret. For example in lines two and three Stevens writes, \"summer night/ was like\nthe conscious being of the book.\" The idea that a summer night and a book are conscious beings\nis difficult to digest, and thus it forces the reader to connect to the concrete images of the phrase,\n\nor \"summer night\" and \"the book.\" In fact, all of the phrases in the first six stanzas (thirteen\nlines) contain series of concrete images that resonate with the reader. In the first thirteen lines,\nthe words \"Summer,\" \"night,\" \"house,\" \"quiet,\" \"world,\" \"calm,\" \"reader,\" and \"book\" are all\nrepeated. This repetition causes these words to resound with the reader. Together they from an\nimage of a summer night in a calm world, where someone is reading a book in a quiet house.\nThis image is general and it allows almost every reader of this poem to connect to a time in their\nlife in which they read a book in a quiet warm house. This connection is incredibly important to\nthe poem because it opens the reader to accept Stevens' definition of truth.\n\nStevens ends with \"The truth in a calm world, / In which there is no other meaning, itself/\nIs calm, itself is summer and night, itself/ Is the reader leaning late and reading there.\" If taken\nout of context, the reader could question many aspects of the definition, for example where is\nthis calm world? Or where is this reader leaning late and reading? Yet in context the reader\nreturns to the images created by the first six stanzas to answer these questions. \"The truth in a\ncalm world\" becomes the truth in the scene in the readers mind. This personal connection\nstrengthens Stevens' definition because it allows the reader to posses the \"truth.\" Without this\nconnection, the truth is Stevens' idea and the question centers on whether or not the reader\naccepts his definition. With it the reader must question themselves or leave the definition\nunquestioned.\n\nAnother facet of Steven's definition is the aforementioned repetition of the word, \"itself.\"\nThe new sentence in the middle of line thirteen draws the reader's attention to its subject, \"truth.\"\nThus when the pronoun \"itself\" appears and is repeated, the reader immediately associates it with\n\"truth.\" The last three lines then become a series of direct linkages: \"the truth...is calm,\" \"the\ntruth...is summer and night.\" This allows the reader to easily connect the concrete images from\n\nearlier in the poem with the previously abstract notion of truth. As the definition finishes, the\ntruth itself becomes concrete.\n\nWallace Stevens' poem \"The House was Quiet and the World was Calm,\" begins with a\ndescription which contains a repeated series of concrete images. As the lines unfold, their\nrepetition produces a clear image of a reader leaning over a book in a quite house, surrounded by\na calm world. This image is broken temporarily in the thirteenth line, when Stevens begins a new\nsentence with the abstract notion of truth. This break represents a turning point that draws\nattention to the truth and allows Stevens to begin to define it. In the last three lines of the poem,\nStevens reunites the concrete images from his description into a concrete definition for truth.\nThis method leaves the reader with a clear and personal definition of truth."
    },
    {
      "category": "Resource",
      "title": "Paper #1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-004-reading-poetry-spring-2009/d5a922d3596ec0b83ec928b361738dd3_MIT21l_004s09_assn01_paper1.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.004 Reading Poetry\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nPaper #1 due 2 days after SES #5\nWrite a paper, 2 pages, 500 words, about either sonnet \"Leda and the Swan\" or The World Is Too Much\nWith Us.\"\nYou've Already Started\nYou started working on your paper when you first began to make plentiful observations. You continued\nto add to those observations as you heard and discussed new ones. Observations about a poem or work of\nliterature are concrete - something you can see that we can all see; they are what you notice - what strikes\nyou or what you remember when you close the book. Noticing the \"obvious\" is good and always\nimportant - probably something we took for granted without ever thinking about. Observations never\noccur in the order of the poem you have read.\nTo express your observations, you'll be using the language of description. You may notice tenses of\nverbs (controlling time), or which pronouns the poet uses (controlling point of view or who speaks) or\nhow he shifts from singulars to plurals, what kinds of connections he uses, whether the sentences (not the\nlines themselves) are long or short - these are just samples of what might strike your attention.\nYou may not be interested in verbs or pronouns (too bad). You may be noticing another sort of thing:\nhow much abstract or concrete there is, what sort of repetitions there are, grammatical structures, whether\nthere's a turn in what goes on, beginnings and endings.\nObservations don't summarize the work and don't interpret it.\n\nBeginning work on the paper\nNow you're ready to formulate an idea for a paper. Your collected observations are going to be the\nevidence for what you assert in your paper. Choose what speaks to you as the most interesting or\nluminous observations. Do at least a half an hour of prolific writing on that observation (or cluster) to get\nout on paper a body of language in which you can look for an expression of your idea. Don't be afraid to\nuse the language of the work. The Vendler chapter on \"Writing About a Poem\"\nThere are two \"nevers.\" Never begin writing about the poem by writing about its beginning. Always\nbegin with what you think is its heart. Never follow the order of the poem. Don't worry about covering it\ncompletely. Do speak the language of the work; it is a sign of authority. In poetry, we cannot substitute\nour own words for the poets' words. We respond to and work with his/her words.\nThe difference between observation and idea is that observations are recognizable by others, but an idea\nneeds to be explained. In writing about poem, it is your idea you are explaining, not the poet's. The\npoet's idea has been embodied; it does not need to be explained. Perhaps it will be a relief that your\nwriting must comprehend not the whole poem, but the whole of your idea about the poem.\nThis first paper is deliberately short in length to give you a chance to trust your full expression of your\nidea. Coleridge called ideas \"generative seeds.\" Because they exist in potentia, they ask to be acted on.\nThey take energy, patience, luck and a certain kind of faithfulness."
    },
    {
      "category": "Resource",
      "title": "Paper #2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-004-reading-poetry-spring-2009/ca75fe6067a5967aa7613690fcde3fa0_MIT21l_004s09_assn02_paper2.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.004 Reading Poetry\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nReading Poetry 21L.004.02\nVaeth\nPaper #2; Group A due SES #11; Group B due 2 days after SES #12\n\nPaper #2\n\nBecause poems happen in time, like music, they must change. As readers, we're in a\ndifferent place by the end of a poem. What changes? What is its fulcrum? Write a 3-5-page\npaper about one of the following poems: Stevens' \"The House Was Quiet and the World\nWas Calm\"; Hopkins' \"Pied Beauty\"; Donne's \"Holy Sonnet 14.\"\n\nYou have been noticing such elements as tense/time, pronoun/point of view, sentences (the\ngrammatical structures) and such other things as repetitions and patterns of syntax and of\nemphasis, shapes, parts, abstract/concrete (the rhetorical structures). You have your own\nprimary response to the poem; and you now have some basic terms of literary description and\nanalysis.\nYou need not worry about covering the poem completely; this is usually summary or paraphrase.\nNever follow the order of the work. The order of the paper is the order of your idea. Speaking\nthe language of the poem will make you aware of the relationship among its parts and is your\nessential evidence and authority. Be willing to move beyond announcing that something exists\n(there's a rhyme scheme; there's an image, it has sentences) by showing it and by telling your\nreaders why/how it matters.\nTrust the approach of many readings and making plentiful concrete observations as an invaluable\nendeavor for the work of the paper; giving yourself time to internalize the poem so that you can\nthen speak its language with authority is the goal of our work this semester.\nIt is important to remember that it is YOUR idea about a work that deserves expression and\ndevelopment; you are not obligated to explain Donne's idea or Stevens' idea but you are\nresponsible for explicating YOUR idea about Donne or Stevens. One of the goals of an\nacademic paper is to persuade an audience of readers (your intelligent classmates) to understand\nwhat you think is essential."
    },
    {
      "category": "Resource",
      "title": "Paper #3",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-004-reading-poetry-spring-2009/6df5612098cd02382a280c0620bfed8d_MIT21l_004s09_assn03_paper3.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.004 Reading Poetry\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\n21L.004.02 Reading Poetry\nPaper #3\nDue on SES #20\n6-7 pages; format, print on one side; staple pages: think formal attire\n\nDon't Skip: Approach for a Longer Essay\nAs with each of the earlier two papers, the poems themselves are the primary topos - the only topic; no\nsecondary sources are necessary. You have a growing repertoire of literary analysis to help you convey\nyour own responses to the poems. Root your ideas in its language and its form.\nAs the writer, make sure to place the needs of your readers first by thinking about what they require to\nunderstand your ideas when you are not there to explain them. One of your goals is to persuade your\nreaders to understand your essential point of view.\nThe two choices below simply direct you to think about pairs of poems by different poets or groups of\npoems by the same poet. A pairing will present you with two different poetic terrains to consider while a\ngroup of poems by the same poet will present you with some similarities about that poet's practice that\nyou can consider in-depth.\nContinue your practice of making concrete observations before beginning the paper (for example: the\npoem has three sentences or units of thought; each sentence has a different subject) that lead to develop\nyour own ideas that you fully explain and develop for readers.\nA good title alerts readers to the governing idea of your paper.\nA compelling introduction identifies the works and authors you are writing about and immediately states\nyour main idea (about the pairing or the grouping). Using language from the poem(s) can strengthen your\nidea and make the introduction come alive in such a way that draws readers into the rest of the paper.\nIn an academic paper of this kind, each subsequent new or supporting idea deserves to be stated\nimmediately in the topic sentence of the paragraph and then developed in the body of the paragraph. The\nclosing sentence of each paragraph brings that idea to its full conclusion.\nGood analysis involves moving beyond one-sentence announcements and demonstrates a willingness to\nlinger and pursue an idea as fully as you can. Good analysis is usually specific rather than general and\nstays connected throughout the essay to the artifact of the poem. Good analysis involves pushing beyond\nan observation that something exists (an image, a shift, a metaphor, a question, a rhyme scheme, a\nspeaker) to a rigorous consideration of why/how it matters to your point of view.\nAs always, do not feel obligated to \"cover\" the poem or to follow its order. Interesting papers always\nfollow the order of the writer's idea. Interesting papers resist pointing out every possible thing observed.\nWriters make choices about what to leave in and what to abandon as they begin to think about how to\nprioritize and shape a coherent order with foremost in mind.\nGood conclusions refuse to announce \"I'm way done now and have nothing more to say so I'll repeat\nwhat I've already said - gotta go, bye...\" but rather continue to advance the paper. Good conclusions\nreturn to the main idea by pushing for a new insight that you could not have discovered before you wrote\nthe paper.\nYou now know many poetic elements both from our discussions and from assigned readings in Vendler\nthat can help you think more deeply about how a poem does what it does. Gravitate to elements that\nengage the way you like to think and that draw you further into the poem. These particular elements are\nimaginative spurs rather than directives:\n\nthe speaker (who is speaking? does the discourse change? how does this matter?)\n\nspeech acts (how are things being said? so what?)\n\ntime and space axes (where are we? what changes? where do we go? what are the implications?)\ninternal and external forms and patterns (how does the poet use stanzas, the line, grammatical\nplay, and repetition, to name a few elements? what are the consequences?)\ntense change (do verbs shift tense? what are the consequences of the shift? or perhaps as in \"Holy\nSonnet 14\" the verbs both advance and dominate the poem)\nOne of the second papers investigated the word \"again\" in line 11 of Donne's \"Holy Sonnet 14\". The\nwriter saw the word as the poem's fulcrum and explained it as the paper's governing idea. A paper on one\npivotal word! I mention this choice in the hope that you will feel free to pursue your own governing idea.\nIf you are still having trouble incorporating quotations for lines, excerpts and titles, you'll have to slog\nyour way through an MLA handbook and get it right. Sadly, we do not possess the DNA codes for\ncomplete mastery of this. Consistent errors of this kind lower your grade. Allow enough time to\nproofread and print your paper.\nChoices\n1. Select two poems by different poets that you have not yet written about from among the following list:\nYeats, (\"Leda and the Swan\"); Wordsworth (\"The Worlds Is Too Much With Us\"); Donne (\"Holy\nSonnets\" 14, 10, \"Valediction\"); Eliot (\"Prufrock\") Bishop (\"Sestina,\" \"In the Waiting Room,\" \"One\nArt,\" \"At the Fishhouses\"); Stevens (\"The House Was Quiet and the World Was Calm\"); Whitman\n(\"Vigil,\" \"Song of Myself\" excerpt 1 and/or 24, \"Beginning My Studies\"), Coleman (\"Wanda Why\nAren't You Dead\"); Hopkins (\"Pied Beauty,\" \"As Kingfisher's Catch Fire\"). Rereading Vendler's\n\"Writing about Poems,\" Chapter 10 will be valuable here.\nUse the pairing as a way to think about how one poem sheds light on the different or similar qualities in\nthe other - Donne/Hopkins? Stevens/Bishop? Coleman/Whitman? Whitman/Eliot? Eliot/Hopkins?\nChoose any pairing. What does one poetic pursuit show us about the other? Similar or different use of the\nspeaker?\nYou will ratchet up your analysis by explaining how an element matters rather than simply announcing\nthat it exists. For example, stating that Stevens and Bishop (in \"Sestina\") both use repetitions in their\nrespective poems is true but not yet an idea that makes a substantive claim. How does each poet use\nrepetition and how does it matter to the poem? You need to synthesize your analysis in a comparison\npaper by addressing what you learn from both techniques.\n2. Write about a group of two or three poems by Donne (Holy Sonnets 14 and 10 and/or \"Valediction\")\nor three by Bishop (any three of the four on the syllabus) or three by Whitman (\"Beginning My Studies,\"\n\"Vigil,\" \"Song of Myself,\" 1 and 24). Vendler's \"Studying Groups of Poems,\" Chapter 11 will be\nvaluable here.\nLaunch your initial writing by thinking about what intrigues you about the poet's practice or vision. Is\nthere a common theme? How does this poet use form? What kind of voice comes through each poem?\nHow does this poet view the world?\n\nGood luck."
    },
    {
      "category": "Resource",
      "title": "Paper #4",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-004-reading-poetry-spring-2009/d20c8d581d448404dbfdd8ecb8e865bb_MIT21l_004s09_assn04_paper4Rev.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.004 Reading Poetry\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nReading Poetry\nPaper #4 Revision, 5-6 pages\nDue: SES #26\nRewriting and Revision: A Distinction\nChoose the paper with the lowest grade to revise. If you have equal grades, choose the paper that\nyou most want to reconsider. If that paper is Paper #1, part of your task will be to reconsider\nyour original idea and develop it in a longer paper.\nYou have plentiful writing experience and control of basic essay structures. You understand that\nthe poem itself is your one true authority and that in its surfaces lie the wonderful depths that can\ncontinue to open meanings for you as readers and thinkers, as you consider the various\napproaches of internal/external structures, space and time, who speaks, language, grammar and\nsyntax, among others.\nIn rewriting, a writer rereads and rewrites a draft of the whole - clarifying and extending the\nfitness of its parts in a whole structure. In rewriting, the writer becomes aware of the\nrelationship of parts (paragraphs) to whole (essay). For example, a good conclusion reflects the\nhypothesis of the beginning and the development of that by the middle. Further, it strives for a\nnew idea derived from you analysis that could not have realized before writing the paper.\nIn revision, the writer has a new vision of his/her idea and, to incorporate the vision or put it into\nperspective, recasts the whole. Such discovery depends on luck and readiness; luck is\nungovernable, but rewriting, because it is a state of readiness intensified by slowed pace and\nclose focus, may be the occasion of a new vision.\nRevision means that the writer has discovered a deeper or more original idea, hidden but implicit\nin his/her mind and his/her writing. Attentive rewriting can find it and bring it out onto the page.\nRewriting involves establishing correctness of spelling, syntax, and punctuation, including\nparagraphing. It is a given that you will resolve any recurring issues of grammar and syntax.\nGood writing is made of consequential sentences. Good paragraphs begin with a decisive topic\nsentence idea that governs it throughout.\nOf these, it is revision that can move the work most radically forward, sometimes changing it\nprofoundly. It is also a step we cannot demonstrate exactly or require anyone to take. There\nshould be significant changes to your essay, and I should not need to look very hard to see that\nthere are significant changes. Be bold.\nWith that understanding, good luck with your final paper."
    },
    {
      "category": "Resource",
      "title": "Beginning My Studies",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-004-reading-poetry-spring-2009/a82f5d28ba982a549e1aaa6f35a4c05d_MIT21l004s09read03whitman.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.004 Reading Poetry\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nBeginning My Studies\n\nFrom Leaves of Grass, 1891 - 92\nby Whitman, Walt\n\nBeginning my studies the first step pleas'd me so much,\nThe mere fact consciousness, these forms, the power of motion,\nThe least insect or animal, the senses, eyesight, love,\nThe first step I say awed me and pleas'd me so much,\nI have hardly gone and hardly wished to go any farther,\nBut stop and loiter all the time to sing it in ecstatic songs.\n\nWalt Whitman"
    },
    {
      "category": "Resource",
      "title": "Beginning My Studies",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-004-reading-poetry-spring-2009/fa65de3ba0cfa5f9a9491c521f88c8f6_MIT21l_004s09_read03_whitman.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.004 Reading Poetry\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nBeginning My Studies\n\nFrom Leaves of Grass, 1891 - 92\nby Whitman, Walt\n\nBeginning my studies the first step pleas'd me so much,\nThe mere fact consciousness, these forms, the power of motion,\nThe least insect or animal, the senses, eyesight, love,\nThe first step I say awed me and pleas'd me so much,\nI have hardly gone and hardly wished to go any farther,\nBut stop and loiter all the time to sing it in ecstatic songs.\n\nWalt Whitman"
    },
    {
      "category": "Resource",
      "title": "Keats' Negative Capability",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-004-reading-poetry-spring-2009/ac0ae84b3bc639fb588a3c7c8f144880_MIT21l004s09read02keats.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.004 Reading Poetry\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nKeats' Negative Capability\n\nSunday [21 Dec. 1817]\nHampstead Sunday\nMY DEAR BROTHERS,\nI must crave your pardon for not having written ere this. ***\nI saw Kean return to the public in 'Richard III.', and finely he did it, and, at the request of\nReynolds, I went to criticize his Luke in Riches. The critique is in to-day's 'Champion', which I\nsend you, with the Examiner, in which you will find very proper lamentation on the obsoletion of\nChristmas Gambols and pastimes: but it was mixed up with so much egotism of that drivelling\nnature that pleasure is entirely lost. Hone, the publisher's trial, you must find very amusing; and,\nas Englishmen, very encouraging-his Not Guilty is a thing, which not to have been, would have\ndulled still more Liberty's Emblazoning-Lord Ellenborough has been paid in his own coin-\nWooler and Hone have done us an essential service-I have had two very pleasant evenings with\nDilke, yesterday and to-day, and am at this moment just come from him, and feel in the humour\nto go on with this, began in the morning, and from which he came to fetch me. I spent Friday\nevening with Wells, and went next morning to see Death on the Pale Horse. It is a wonderful\npicture, when West's age is considered; But there is nothing to be intense upon; no woman one\nfeels mad to kiss, no face swelling into reality-The excellence of every art is its intensity, capable\nof making all disagreeables evaporate, from their being in close relationship with Beauty and\nTruth. Examine 'King Lear', and you will find this exemplified throughout; but in this picture we\nhave unpleasantness without any momentous depth of speculation excited, in which to bury its\nrepulsiveness-The picture is larger than 'Christ rejected'.\nI dined with Haydon the Sunday after you left, and bad a very pleasant day, I dined too (for I\nhave been out too much lately) with Horace Smith, and met his two Brothers, with Hill and King\nston, and one Du Bois. They only served to convince me, how superior humour is to wit in\nrespect to enjoyment-These men say things which make one start, without making one feel; they\nare all alike; their manners are alike; they all know fashionables; they have a mannerism in their\neating and drinking, in their mere handling a Decanter-They talked of Kean and his low company\n-Would I were with that Company instead of yours, said I to mvself! I know such like\nacquaintance will never do for me and yet I am going to Reynolds on Wednesday. Brown and\nDilke walked with me and back from the Christmas pantomime. I had not a dispute but a\ndisquisition, with Dilke on various subjects; several things dove-tailed in my mind, and at\nonce it struck me what quality went to form a Man of Achievement, especially in\nLiterature, and which Shakespeare possessed so enormously - I mean Negative Capability,\nthat is, when a man is capable of being in uncertainties, mysteries, doubts, without any\nirritable reaching after fact and reason-Coleridge, for instance, would let go by a fine\nisolated verisimilitude caught from the Penetralium of mystery, from being incapable of\nremaining content with half-knowledge. This pursued through volumes would perhaps take\nus no further than this, that with a great poet the sense of Beauty overcomes every other\nconsideration, or rather obliterates all consideration.\nSbelley's poem is out, and there are words about its being obiected to as much as \"Queen Mab\"\nwas. Poor Shelley, I think he has his Quota of good qualities, in sooth la!! Write soon to your\nmost sincere friend and affectionate Brother\nJohn [Keats]"
    },
    {
      "category": "Resource",
      "title": "Keats' Negative Capability",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-004-reading-poetry-spring-2009/3f376145c3acc6c20fa95019b6ef2f23_MIT21l_004s09_read02_keats.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.004 Reading Poetry\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nKeats' Negative Capability\n\nSunday [21 Dec. 1817]\nHampstead Sunday\nMY DEAR BROTHERS,\nI must crave your pardon for not having written ere this. ***\nI saw Kean return to the public in 'Richard III.', and finely he did it, and, at the request of\nReynolds, I went to criticize his Luke in Riches. The critique is in to-day's 'Champion', which I\nsend you, with the Examiner, in which you will find very proper lamentation on the obsoletion of\nChristmas Gambols and pastimes: but it was mixed up with so much egotism of that drivelling\nnature that pleasure is entirely lost. Hone, the publisher's trial, you must find very amusing; and,\nas Englishmen, very encouraging-his Not Guilty is a thing, which not to have been, would have\ndulled still more Liberty's Emblazoning-Lord Ellenborough has been paid in his own coin-\nWooler and Hone have done us an essential service-I have had two very pleasant evenings with\nDilke, yesterday and to-day, and am at this moment just come from him, and feel in the humour\nto go on with this, began in the morning, and from which he came to fetch me. I spent Friday\nevening with Wells, and went next morning to see Death on the Pale Horse. It is a wonderful\npicture, when West's age is considered; But there is nothing to be intense upon; no woman one\nfeels mad to kiss, no face swelling into reality-The excellence of every art is its intensity, capable\nof making all disagreeables evaporate, from their being in close relationship with Beauty and\nTruth. Examine 'King Lear', and you will find this exemplified throughout; but in this picture we\nhave unpleasantness without any momentous depth of speculation excited, in which to bury its\nrepulsiveness-The picture is larger than 'Christ rejected'.\nI dined with Haydon the Sunday after you left, and bad a very pleasant day, I dined too (for I\nhave been out too much lately) with Horace Smith, and met his two Brothers, with Hill and King\nston, and one Du Bois. They only served to convince me, how superior humour is to wit in\nrespect to enjoyment-These men say things which make one start, without making one feel; they\nare all alike; their manners are alike; they all know fashionables; they have a mannerism in their\neating and drinking, in their mere handling a Decanter-They talked of Kean and his low company\n-Would I were with that Company instead of yours, said I to mvself! I know such like\nacquaintance will never do for me and yet I am going to Reynolds on Wednesday. Brown and\nDilke walked with me and back from the Christmas pantomime. I had not a dispute but a\ndisquisition, with Dilke on various subjects; several things dove-tailed in my mind, and at\nonce it struck me what quality went to form a Man of Achievement, especially in\nLiterature, and which Shakespeare possessed so enormously - I mean Negative Capability,\nthat is, when a man is capable of being in uncertainties, mysteries, doubts, without any\nirritable reaching after fact and reason-Coleridge, for instance, would let go by a fine\nisolated verisimilitude caught from the Penetralium of mystery, from being incapable of\nremaining content with half-knowledge. This pursued through volumes would perhaps take\nus no further than this, that with a great poet the sense of Beauty overcomes every other\nconsideration, or rather obliterates all consideration.\nSbelley's poem is out, and there are words about its being obiected to as much as \"Queen Mab\"\nwas. Poor Shelley, I think he has his Quota of good qualities, in sooth la!! Write soon to your\nmost sincere friend and affectionate Brother\nJohn [Keats]"
    },
    {
      "category": "Resource",
      "title": "Poems by Yeats",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-004-reading-poetry-spring-2009/51b0fc94998de3b722f48ed2209b34b8_MIT21l004s09read01yeats.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.004 Reading Poetry\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nPoems by Yeats, W. B.\n\nTo A Young Girl\nMY dear, my dear, I know\nMore than another\nWhat makes your heart beat so;\nNot even your own mother\nCan know it as I know,\nWho broke my heart for her\nWhen the wild thought,\nThat she denies\nAnd has forgot,\nSet all her blood astir\nAnd glittered in her eyes.\n\nWhen You Are Old\nWHEN you are old and grey and full of sleep,\nAnd nodding by the fire, take down this book,\nAnd slowly read, and dream of the soft look\nYour eyes had once, and of their shadows deep;\n\nHow many loved your moments of glad grace,\nAnd loved your beauty with love false or true,\nBut one man loved the pilgrim soul in you,\nAnd loved the sorrows of your changing face;\n\nAnd bending down beside the glowing bars,\n\nMurmur, a little sadly, how Love fled\nAnd paced upon the mountains overhead\nAnd hid his face amid a crowd of stars.\n\nTo Ireland In The Coming Times\nNOW, that I would accounted be\nTrue brother of a company\nThat sang, to sweeten Ireland's wrong,\nBallad and story, rann and song;\nNor be I any less of them,\nBecause the red-rose-bordered hem\nOf her, whose history began\nBefore God made the angelic clan,\nTrails all about the written page.\nWhen Time began to rant and rage\nThe measure of her flying feet\nMade Ireland's heart begin to beat;\nAnd Time bade all his candles flare\nTo light a measure here and there;\nAnd may the thoughts of Ireland brood\nUpon a measured quietude.\n\nNor may I less be counted one\nWith Davis, Mangan, Ferguson,\nBecause, to him who ponders well,\nMy rhymes more than their rhyming tell\nOf things discovered in the deep,\nWhere only body's laid asleep.\nFor the elemental creatures go\nAbout my table to and fro,\n\nThat hurry from unmeasured mind\nTo rant and rage in flood and wind;\nYet he who treads in measured ways\nMay surely barter gaze for gaze.\nMan ever journeys on with them\nAfter the red-rose-bordered hem.\nAh, faeries, dancing under the moon,\nA Druid land, a Druid tune!\n\nWhile still I may, I write for you\nThe love I lived, the dream I knew.\nFrom our birthday, until we die,\nIs but the winking of an eye;\nAnd we, our singing and our love,\nWhat measurer Time has lit above,\nAnd all benighted things that go\nAbout my table to and fro,\nAre passing on to where may be,\nIn truth's consuming ecstasy,\nNo place for love and dream at all;\nFor God goes by with white footfall.\nI cast my heart into my rhymes,\nThat you, in the dim coming times,\nMay know how my heart went with them\nAfter the red-rose-bordered hem.\n\n\"To Ireland in the Coming Times\" is reprinted from The Rose. W.B. Yeats. 1893.\n\nI WENT out to the hazel wood,\n\nBecause a fire was in my head,\n\nAnd cut and peeled a hazel wand,\n\nAnd hooked a berry to a thread:\n\nAnd when white moths were on the wing,\n\nAnd moth-like stars were flickering out,\n\nI dropped the berry in a stream\n\nAnd caught a little silver trout.\n\nWhen I had laid it on the floor\n\nI went to blow the fire aflame,\n\nBut something rustled on the floor,\n\nAnd some one called me by my name:\n\nIt had become a glimmering girl\n\nWith apple blossom in her hair\n\nWho called me by my name and ran\n\nAnd faded through the brightening air.\n\nThough I am old with wandering\n\nThrough hollow lands and hilly lands,\n\nI will find out where she has gone,\n\nAnd kiss her lips and take her hands;\n\nAnd walk among long dappled grass,\n\nAnd pluck till time and times are done\n\nThe silver apples of the moon,\n\nThe golden apples of the sun.\n\nThe Second Coming\nTURNING and turning in the widening gyre\nThe falcon cannot hear the falconer;\nThe Song Of Wandering Aengus\n\nThings fall apart; the centre cannot hold;\nMere anarchy is loosed upon the world,\nThe blood-dimmed tide is loosed, and everywhere\nThe ceremony of innocence is drowned;\nThe best lack all conviction, while the worst\nAre full of passionate intensity.\n\nSurely some revelation is at hand;\nSurely the Second Coming is at hand.\nThe Second Coming! Hardly are those words out\nWhen a vast image out of Spiritus Mundi\nTroubles my sight: somewhere in the sands of the desert\nA shape with lion body and the head of a man,\nA gaze blank and pitiless as the sun,\nIs moving its slow thighs, while all about it\nReel shadows of the indignant desert birds.\nThe darkness drops again; but now I know\nThat twenty centuries of stony sleep\nWere vexed to nightmare by a rocking cradle,\nAnd what rough beast, its hour come round at last,\nSlouches towards Bethlehem to be born?\n\n\"The Second Coming\" is reprinted from Michael Robartes and the Dancer. W.B. Yeats.\nNew York: Macmillan, 1921.\n\nEaster 1916\nI HAVE met them at close of day\nComing with vivid faces\nFrom counter or desk among grey\nEighteenth-century houses.\nI have passed with a nod of the head\n\nOr polite meaningless words,\nOr have lingered awhile and said\nPolite meaningless words,\nAnd thought before I had done\nOf a mocking tale or a gibe\nTo please a companion\nAround the fire at the club,\nBeing certain that they and I\nBut lived where motley is worn:\nAll changed, changed utterly:\nA terrible beauty is born.\n\nThat woman's days were spent\nIn ignorant good-will,\nHer nights in argument\nUntil her voice grew shrill.\nWhat voice more sweet than hers\nWhen, young and beautiful,\nShe rode to harriers?\nThis man had kept a school\nAnd rode our winged horse;\nThis other his helper and friend\nWas coming into his force;\nHe might have won fame in the end,\nSo sensitive his nature seemed,\nSo daring and sweet his thought.\nThis other man I had dreamed\nA drunken, vainglorious lout.\nHe had done most bitter wrong\n\nTo some who are near my heart,\nYet I number him in the song;\nHe, too, has resigned his part\nIn the casual comedy;\nHe, too, has been changed in his turn,\nTransformed utterly:\nA terrible beauty is born.\n\nHearts with one purpose alone\nThrough summer and winter seem\nEnchanted to a stone\nTo trouble the living stream.\nThe horse that comes from the road,\nThe rider, the birds that range\nFrom cloud to tumbling cloud,\nMinute by minute they change;\nA shadow of cloud on the stream\nChanges minute by minute;\nA horse-hoof slides on the brim,\nAnd a horse plashes within it;\nThe long legged moor-hens dive,\nAnd hens to moor-cocks call;\nMinute by minute they live:\nThe stone's in the midst of all.\n\nToo long a sacrifice\nCan make a stone of the heart.\nO when may it suffice?\nThat is Heaven's part, our part\nTo murmur name upon name,\n\nAs a mother names her child\nWhen sleep at last has come\nOn limbs that had run wild.\nWhat is it but nightfall?\nNo, no, not night but death;\nWas it needless death after all?\nFor England may keep faith\nFor all that is done and said.\nWe know their dream; enough\nTo know they dreamed and are dead;\nAnd what if excess of love\nBewildered them till they died?\nI write it out in a verse-\nMacDonagh and MacBride\nAnd Connolly and Pearse\nNow and in time to be,\nWherever green is worn,\nAre changed, changed utterly\nA terrible beauty is born\n\nSeptember 25, 1916\n\nNever Give All the Heart\n\nNever give all the heart, for love\nWill hardly seem worth thinking of\nTo passionate women if it seem\nCertain, and they never dream\nThat it fades out from kiss to kiss;\nFor everything that's lovely is\nBut a brief, dreamy, kind delight.\n\nO never give the heart outright,\nFor they, for all smooth lips can say,\nHave given their hearts up to the play.\nAnd who could play it well enough\nIf deaf and dumb and blind with love?\nHe that made this knows all the cost,\nFor he gave all his heart and lost."
    },
    {
      "category": "Resource",
      "title": "Poems by Yeats",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-004-reading-poetry-spring-2009/1c2a6af94fabde6ddfd9cfbbb46cdb53_MIT21l_004s09_read01_yeats.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.004 Reading Poetry\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nPoems by Yeats, W. B.\n\nTo A Young Girl\nMY dear, my dear, I know\nMore than another\nWhat makes your heart beat so;\nNot even your own mother\nCan know it as I know,\nWho broke my heart for her\nWhen the wild thought,\nThat she denies\nAnd has forgot,\nSet all her blood astir\nAnd glittered in her eyes.\n\nWhen You Are Old\nWHEN you are old and grey and full of sleep,\nAnd nodding by the fire, take down this book,\nAnd slowly read, and dream of the soft look\nYour eyes had once, and of their shadows deep;\n\nHow many loved your moments of glad grace,\nAnd loved your beauty with love false or true,\nBut one man loved the pilgrim soul in you,\nAnd loved the sorrows of your changing face;\n\nAnd bending down beside the glowing bars,\n\nMurmur, a little sadly, how Love fled\nAnd paced upon the mountains overhead\nAnd hid his face amid a crowd of stars.\n\nTo Ireland In The Coming Times\nNOW, that I would accounted be\nTrue brother of a company\nThat sang, to sweeten Ireland's wrong,\nBallad and story, rann and song;\nNor be I any less of them,\nBecause the red-rose-bordered hem\nOf her, whose history began\nBefore God made the angelic clan,\nTrails all about the written page.\nWhen Time began to rant and rage\nThe measure of her flying feet\nMade Ireland's heart begin to beat;\nAnd Time bade all his candles flare\nTo light a measure here and there;\nAnd may the thoughts of Ireland brood\nUpon a measured quietude.\n\nNor may I less be counted one\nWith Davis, Mangan, Ferguson,\nBecause, to him who ponders well,\nMy rhymes more than their rhyming tell\nOf things discovered in the deep,\nWhere only body's laid asleep.\nFor the elemental creatures go\nAbout my table to and fro,\n\nThat hurry from unmeasured mind\nTo rant and rage in flood and wind;\nYet he who treads in measured ways\nMay surely barter gaze for gaze.\nMan ever journeys on with them\nAfter the red-rose-bordered hem.\nAh, faeries, dancing under the moon,\nA Druid land, a Druid tune!\n\nWhile still I may, I write for you\nThe love I lived, the dream I knew.\nFrom our birthday, until we die,\nIs but the winking of an eye;\nAnd we, our singing and our love,\nWhat measurer Time has lit above,\nAnd all benighted things that go\nAbout my table to and fro,\nAre passing on to where may be,\nIn truth's consuming ecstasy,\nNo place for love and dream at all;\nFor God goes by with white footfall.\nI cast my heart into my rhymes,\nThat you, in the dim coming times,\nMay know how my heart went with them\nAfter the red-rose-bordered hem.\n\n\"To Ireland in the Coming Times\" is reprinted from The Rose. W.B. Yeats. 1893.\n\nI WENT out to the hazel wood,\n\nBecause a fire was in my head,\n\nAnd cut and peeled a hazel wand,\n\nAnd hooked a berry to a thread:\n\nAnd when white moths were on the wing,\n\nAnd moth-like stars were flickering out,\n\nI dropped the berry in a stream\n\nAnd caught a little silver trout.\n\nWhen I had laid it on the floor\n\nI went to blow the fire aflame,\n\nBut something rustled on the floor,\n\nAnd some one called me by my name:\n\nIt had become a glimmering girl\n\nWith apple blossom in her hair\n\nWho called me by my name and ran\n\nAnd faded through the brightening air.\n\nThough I am old with wandering\n\nThrough hollow lands and hilly lands,\n\nI will find out where she has gone,\n\nAnd kiss her lips and take her hands;\n\nAnd walk among long dappled grass,\n\nAnd pluck till time and times are done\n\nThe silver apples of the moon,\n\nThe golden apples of the sun.\n\nThe Second Coming\nTURNING and turning in the widening gyre\nThe falcon cannot hear the falconer;\nThe Song Of Wandering Aengus\n\nThings fall apart; the centre cannot hold;\nMere anarchy is loosed upon the world,\nThe blood-dimmed tide is loosed, and everywhere\nThe ceremony of innocence is drowned;\nThe best lack all conviction, while the worst\nAre full of passionate intensity.\n\nSurely some revelation is at hand;\nSurely the Second Coming is at hand.\nThe Second Coming! Hardly are those words out\nWhen a vast image out of Spiritus Mundi\nTroubles my sight: somewhere in the sands of the desert\nA shape with lion body and the head of a man,\nA gaze blank and pitiless as the sun,\nIs moving its slow thighs, while all about it\nReel shadows of the indignant desert birds.\nThe darkness drops again; but now I know\nThat twenty centuries of stony sleep\nWere vexed to nightmare by a rocking cradle,\nAnd what rough beast, its hour come round at last,\nSlouches towards Bethlehem to be born?\n\n\"The Second Coming\" is reprinted from Michael Robartes and the Dancer. W.B. Yeats.\nNew York: Macmillan, 1921.\n\nEaster 1916\nI HAVE met them at close of day\nComing with vivid faces\nFrom counter or desk among grey\nEighteenth-century houses.\nI have passed with a nod of the head\n\nOr polite meaningless words,\nOr have lingered awhile and said\nPolite meaningless words,\nAnd thought before I had done\nOf a mocking tale or a gibe\nTo please a companion\nAround the fire at the club,\nBeing certain that they and I\nBut lived where motley is worn:\nAll changed, changed utterly:\nA terrible beauty is born.\n\nThat woman's days were spent\nIn ignorant good-will,\nHer nights in argument\nUntil her voice grew shrill.\nWhat voice more sweet than hers\nWhen, young and beautiful,\nShe rode to harriers?\nThis man had kept a school\nAnd rode our winged horse;\nThis other his helper and friend\nWas coming into his force;\nHe might have won fame in the end,\nSo sensitive his nature seemed,\nSo daring and sweet his thought.\nThis other man I had dreamed\nA drunken, vainglorious lout.\nHe had done most bitter wrong\n\nTo some who are near my heart,\nYet I number him in the song;\nHe, too, has resigned his part\nIn the casual comedy;\nHe, too, has been changed in his turn,\nTransformed utterly:\nA terrible beauty is born.\n\nHearts with one purpose alone\nThrough summer and winter seem\nEnchanted to a stone\nTo trouble the living stream.\nThe horse that comes from the road,\nThe rider, the birds that range\nFrom cloud to tumbling cloud,\nMinute by minute they change;\nA shadow of cloud on the stream\nChanges minute by minute;\nA horse-hoof slides on the brim,\nAnd a horse plashes within it;\nThe long legged moor-hens dive,\nAnd hens to moor-cocks call;\nMinute by minute they live:\nThe stone's in the midst of all.\n\nToo long a sacrifice\nCan make a stone of the heart.\nO when may it suffice?\nThat is Heaven's part, our part\nTo murmur name upon name,\n\nAs a mother names her child\nWhen sleep at last has come\nOn limbs that had run wild.\nWhat is it but nightfall?\nNo, no, not night but death;\nWas it needless death after all?\nFor England may keep faith\nFor all that is done and said.\nWe know their dream; enough\nTo know they dreamed and are dead;\nAnd what if excess of love\nBewildered them till they died?\nI write it out in a verse-\nMacDonagh and MacBride\nAnd Connolly and Pearse\nNow and in time to be,\nWherever green is worn,\nAre changed, changed utterly\nA terrible beauty is born\n\nSeptember 25, 1916\n\nNever Give All the Heart\n\nNever give all the heart, for love\nWill hardly seem worth thinking of\nTo passionate women if it seem\nCertain, and they never dream\nThat it fades out from kiss to kiss;\nFor everything that's lovely is\nBut a brief, dreamy, kind delight.\n\nO never give the heart outright,\nFor they, for all smooth lips can say,\nHave given their hearts up to the play.\nAnd who could play it well enough\nIf deaf and dumb and blind with love?\nHe that made this knows all the cost,\nFor he gave all his heart and lost."
    },
    {
      "category": "Resource",
      "title": "Wallace Stevens journal note",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-004-reading-poetry-spring-2009/035c862d93a31bb664c0a06b7a5cf968_MIT21l004s09read04stevens.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.004 Reading Poetry\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nI thought, on the train, how utterly we have forsaken the Earth, in the sense of excluding it from\nour thoughts. There are but few who consider its physical hugeness, its rough enormity. It is still\na disparate monstrosity, full of solitudes & barrens & wilds. It still dwarfs & terrifies & crushes.\nThe rivers still roar, the mountains still crash, the winds still shatter. Man is an affair of cities.\nHis gardens & orchards & fields are mere scrapings. Somehow, however, he has managed to shut\nout the face of the giant from his windows. But the giant is there, nevertheless.\n\nWallace Stevens\nSouvenirs and Prophecies, ed. Holly Stevens (New York: Knopf, 1977), note of April 18,\n1904, p. 134."
    },
    {
      "category": "Resource",
      "title": "Wallace Stevens journal note",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-004-reading-poetry-spring-2009/0e990c4bd61dd5c2bd3e939fef7e5a4b_MIT21l_004s09_read04_stevens.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.004 Reading Poetry\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nI thought, on the train, how utterly we have forsaken the Earth, in the sense of excluding it from\nour thoughts. There are but few who consider its physical hugeness, its rough enormity. It is still\na disparate monstrosity, full of solitudes & barrens & wilds. It still dwarfs & terrifies & crushes.\nThe rivers still roar, the mountains still crash, the winds still shatter. Man is an affair of cities.\nHis gardens & orchards & fields are mere scrapings. Somehow, however, he has managed to shut\nout the face of the giant from his windows. But the giant is there, nevertheless.\n\nWallace Stevens\nSouvenirs and Prophecies, ed. Holly Stevens (New York: Knopf, 1977), note of April 18,\n1904, p. 134."
    }
  ]
}