{
  "course_name": "Reading Cookbooks: from The Forme of Cury to The Smitten Kitchen",
  "course_description": "In this course students will visit the past through cookbooks to learn about what foodstuffs and technologies were available and when, and how religious and nutritional concerns dictated what was eaten and how it was cooked. Students will also learn about the gender dynamics of culinary writing and performances and the roles people played in writing and cooking recipes.",
  "topics": [
    "Humanities",
    "History",
    "Literature",
    "Society",
    "Gender Studies",
    "Humanities",
    "History",
    "Literature",
    "Society",
    "Gender Studies"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nPrerequisites\n\nTwo subjects in Literature or permission of the instructor.\n\nCourse Description\n\n\"In some fundamental sense [reading cookbooks] taught me about active reading, about reading for the ideas at the edge of a narrative as well as those in the centre. It showed me that books can mean more than they intend. It started me looking for the importance embedded in the apparently trivial and unregarded, the things a culture takes for granted.\"\n\n- Nicola Humble,\nCulinary Pleasures: Cookbooks and the Transformation of British Food\n\n\"The extent to which we take everyday objects for granted is the precise extent to which they govern and inform our lives.\"\n\n- Margaret Visser,\nMuch Depends on Dinner\n\nIron chefs and home cooks; molecular gastronomy and farm-to-table dining; grain-based and protein-based diets: a time traveler from the future would learn a lot about us from our cookbooks, blogs, and Food Network. When we visit the past through cookbooks, we too learn about the worlds that produced such strange and quirky dishes as Tartes of Flesh and Gooseberry Fools. We learn about what foodstuffs and technologies were available and when; about how religious and nutritional concerns dictated what was eaten and how it was cooked; about who was doing the cooking and who was writing the recipes; about the gender dynamics of culinary writing and performances.\n\nPrimary Sources\n\nObviously, we can't read all the following cookbooks cover to cover, so we'll be focusing, rather, on selected chapters and recipes. All the books, except for the 20th-21st century ones, are available online, in reprints, and/or in free ebook editions.\n\nPegge, Samuel.\nThe Forme of Cury: A Roll of Ancient English Cookery Compiled, about A.D. 1390\n. CreateSpace Independent Publishing Platform, 2012. ISBN: 9781470074852. [Preview with\nGoogle Books\n]\n\nPlat, Hugh.\nDelightes for Ladies to Adorn their Persons, Tables, Closets, and Distillatories: with Beauties, Banquets, Perfumes and Waters\n. EEBO Editions, ProQuest, 2010. ISBN: 9781171310464.\n\nMarkham, Gervase.\nThe English Housewife\n. Edited by Michael R. Best. McGill-Queen's University Press, 1994. ISBN: 9780773511033. [Preview with\nGoogle Books\n]\n\nMay, Robert.\nThe Accomplisht Cook: or the Art & Mystery of Cookery\n. CreateSpace Independent Publishing Platform, 2015. ISBN: 9781516986583.\n\nGlasse, Hannah.\nThe Art of Cookery Made Plain and Easy: The Revolutionary 1805 Classic\n. Reprint edition. Dover Publications, 2015. ISBN: 9780486795768. [Preview with\nGoogle Books\n]\n\nActon, Eliza.\nModern Cookery for Private Families\n. Quadrille Publishing, 2011. ISBN: 9781844009596. [Preview with\nGoogle Books\n]\n\nSoyer, Alexis Benoit.\nCharitable Cookery; or, The Poor Man's Regenerator\n. Nabu Press, 2014. ISBN: 9781293760000. [Preview with\nGoogle Books\n]\n\nFrancatelli, Charles Elme.\nA Plain Cookery Book for the Working Classes\n. Reprint edition. The History Press, 2011. ISBN: 9780752459059.\n\nBeeton, Isabella.\nMrs. Beeton's Book of Household Management\n. Edited by Nicola Humble. Abridged edition. Oxford World's Classics, 2008. ISBN: 9780199536337. [Preview with\nGoogle Books\n]\n\nKenney-Herbert, Wyvern.\nCulinary Jottings for Madras\n. Facsimile edition. Prospect Books, 2007. ISBN: 9781903018538. [Preview with\nGoogle Books\n]\n\nWhite, Florence.\nGood Things in England: A Practical Cookery Book for Everyday Use\n. Persephone Books Ltd., 1999. ISBN: 9781903155004.\n\nDavid, Elizabeth.\nA Book of Mediterranean Food\n. 2nd edition. New York Review Books, 2002. ISBN: 9781590170038. [Preview with\nGoogle Books\n]\n\nGrigson, Jane.\nEnglish Food\n. 4th edition. Penguin UK, 1998. ISBN: 9780140273243.\n\nLawson, Nigella.\nHow to Eat: The Pleasures and Principles of Good Food\n. Houghton Mifflin Harcourt, 2002. ISBN: 9780471257509.\n\nFearnley-Whittingstall, Hugh.\nThe River Cottage Cookbook\n. Ten Speed Press, 2008. ISBN: 9781580089098.\n\nRequired Secondary Sources\n\nColquhoun, Kate.\nTaste: The Story of Britain Through Its Cooking\n. Bloomsbury, 2007. ISBN: 9781596914100. [Preview with\nGoogle Books\n]\n\nEssays in the Readings section\n\nRequirements\n\nEssays & Assignments:\n\nFive essays on various topics\n\nClass presentations on cookbooks & recipes\n\nOptional (but much appreciated): preparation of selected historic recipes\n\nYour final grade will be determined roughly as follows:\n\nACTIVITIES\n\nPERCENTAGES\n\nWritten work\n\n60%\n\nClass presentations\n\n25%\n\nClass participation\n\n15%",
  "files": []
}