{
  "course_name": "Reading Fiction: Imaginary Journeys",
  "course_description": "Great works of fiction often take us to far-off places; they sometimes conduct us on journeys toward a deeper understanding of what’s right next door. We’ll read, discuss, and interpret a range of short and short-ish works: The reading list will be chosen from among such texts as “Gilgamesh,” Homer’s Odyssey (excerpts), Bunyan’s The Pilgrim’s Progress (excerpts), Swift’s Gulliver’s Travels, Mary Shelley’s Frankenstein, Conrad’s Heart of Darkness, Saleh’s Season of Migration to the North, Woolf’s To the Lighthouse, John Cheever’s “The Swimmer,” Coetzee’s The Life and Times of Michael K, Irving’s “Rip Van Winkle,” Toni Morrison’s Jazz, H. G. Wells’ The Time Machine, Twain’s The Adventures of Huckleberry Finn, Beckett’s How It Is, Calvino’s Invisible Cities, Forster’s A Passage to India. As a CI-H class, this subject will involve substantial practice in argumentative writing and oral communication.",
  "topics": [
    "Humanities",
    "Literature",
    "Comparative Literature",
    "Fiction",
    "Humanities",
    "Literature",
    "Comparative Literature",
    "Fiction"
  ],
  "syllabus_content": "Course Meeting Times\n\nSessions: 2 sessions / week, 1.5 hours / session\n\nCourse Description\n\nGreat works of fiction often take us to far-off places; they sometimes conduct us on journeys toward a deeper understanding of what's right next door. We'll read, discuss, and interpret a range of short and short-ish works: The reading list will be chosen from among such texts as Gilgamesh, Homer's Odyssey (excerpts), Bunyan's Pilgrim's Progress (excerpts), Swift's Gulliver's Travels, Mary Shelley's Frankenstein, Conrad's Heart of Darkness, Saleh's Season of Migration to the North, Woolf's To the Lighthouse, John Cheever's \"The Swimmer,\" Coetzee's The Life and Times of Michael K, Irving's \"Rip Van Winkle,\" Toni Morrison's Jazz, H.G. Wells' The Time Machine, Twain's The Adventures of Huckleberry Finn, Beckett's How It Is, Calvino's Invisible Cities, Forster's A Passage to India. As a\nCI-H subject\n. As such, this subject will involve substantial work in argumentive writing, revision, and oral presentation.\n\nStudent Work\n\nAs a CI-H class, 21L.003 requires substantial practice in analytical writing and speaking.\n\n3 essays totaling at least 5000 words for the semester.\n\nA substantial revision of either of your first two essays. You will meet with me outside of class to plan your revision; when submitted it must be accompanied by a one-page statement reflecting on what you found necessary to change and what improvements you attempted to make.\n\nTwo oral reports.\nThe first\nwill be on a topic relevant to one of our readings, and your function will be to inform your fellow students about it clearly and concisely (you will have 5 minutes). For\nthe second\n, given during the final weeks of term, you will give a brief report on a contemporary story of your choice (in any medium) organized around the idea of a journey and compare and contrast it with at least three of the works covered in the class.\n\nClass Rules\n\nYour attendance in this class is mandatory. You are allowed a maximum of two unexcused absences. Beyond that, you will fail the class.\n\nClass begins at five minutes past the hour. You are expected to come to class on time having done the appropriate reading for each day and with the appropriate text(s). I may charge you an unexcused absence if you frequently arrive late or without your book. I will give unannounced quizzes on the readings at my discretion.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nWritten Work (Quizzes, Essays, Revisions)\n\n75%\n\nOral Report, Class Participation, Preparedness, Overall Good Citizenship\n\n25%\n\nWriting and Communications Center\n\nThe\nWCC at MIT\n(Writing and Communication Center) offers\nfree\none-on-one\nprofessional\nadvice from communication experts (MIT lecturers who all have advanced degrees and who are all are published writers). The WCC works with MIT\nundergraduate students, graduate students\nand\npost-docs\n.\n\nThe WCC helps you strategize about all types of academic, creative, job-related, and professional writing as well as about all aspects of oral presentations (including practicing your presentations & designing slides).\nNo matter what department or discipline you are in,\nwe help you think your way more deeply into your topic, help you see new implications in your data, research and ideas. The WCC also helps with all\nEnglish as Second Language\nissues, from writing and grammar to pronunciation and conversation practice, from understanding genre conventions to analyzing what particular journals require.\n\nOn the Use of External Sources\n\nYou should have no need to consult any outside sources when you write your essays for this class. The essays are opportunities for you to solidify and demonstrate your grasp of the material we have covered in class. You will draw upon our class discussions, your notes, your imagination and memory.\n\nLiterature Faculty Policy on Plagiarism\n\nThe Literature Section has formulated this statement and policy for all plagiarism cases: Plagiarism--the use of another's intellectual work without acknowledgement--is a serious offense. It is the policy of the Literature Faculty that students who plagiarize will receive an F in the subject, and that the instructor will forward the case to the Committee on Discipline. Full acknowledgement for all information obtained from sources outside the classroom must be clearly stated in all written work submitted and in all oral presentations, including images or texts in other media and for materials collected online. All ideas, arguments, and direct phrasings taken from someone else's work must be identified and properly footnoted. Quotations from other sources must be clearly marked as distinct from the student's own work. For further guidance on the proper forms of attribution, consult the style guides available in the\nWriting and Communication Center\n, review their\nplagiarism policy\n, and review\nMIT's online Academic Integrity Handbook\n.",
  "files": [
    {
      "category": "Resource",
      "title": "Advice on writing",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-003-reading-fiction-imaginary-journeys-fall-2015/4056653c361d666f70509fb432397c5b_MIT21L_003F15_AdviceWritin.pdf",
      "content": "Advice on writing:\n\n1) Many of us probably think that writing works this way: you \"have an idea\" and\nthen you \"write it down.\" I want you to question that assumption. In an\nimportant sense, you don't really know what your ideas are until you've written\nthem down and phrased them just right. Writing can be a process of discovering\nwhat it is you have to say, not just of communicating a prefabricated idea that's\nsitting up there in your brain. As long as it's up there in your brain, the idea\ndoesn't really exist in any form communicable to another. It exists, at best, in\npotential, but it hasn't been subjected to the rigorous test of enunciating it. So use\nyour writing to figure out what you want to say and how you should link each\nthought to the next. This may mean that, rather than making a complete outline of\nyour argument and then filling it in with your prose, you simply start writing and\nsee where you go. As you proceed, you may find (you're likely to find) that you\nactually want to move in directions different from the one you originally imagined\nyourself taking. That's fine. But when you're done, go back to the beginning and\nmake sure the introduction of the essay fits the directions you actually wound up\ntaking.\n\n2) I have little doubt that if I were to ask you merely to summarize the plot of a work\nwe're reading in this class, most if not all of you could do that in perfectly\nacceptable clear prose. I find, however, that when I add the significantly greater\nconceptual burden of requiring students to write argumentative essays that defend\nparticular theses, the quality of many students' prose declines markedly. Let's\nappreciate the correlation: if a student is confused about her thesis or the proper\nway to argue for it, she is likely to write worse than she would if she were simply\nsummarizing. A student arguing from a clear and cogent thesis, on the other\nhand, is much more likely to write well. Developing a worthy thesis statement is\ntherefore crucial: you should try to present a one-sentence statement of the\nargument you will be making. (Sometimes the statement of your thesis may run\nto more than a single sentence.) Often this appears at the end of the essay's first\nparagraph. The statement needs to claim something that it is possible to doubt\n(otherwise it would be so obvious that one wouldn't need to argue for it) but that\ncan be made plausible by careful marshaling of evidence. In this class, your\nevidence comes from the text(s) you will be writing about, so be prepared to\nquote a good deal. In keeping with point #1 immediately above, you may find\n(you probably will find) that you are not ready to articulate your thesis statement\nright away, but that you have to write a bit in order to discover what it is you want\nto argue. So give yourself time to discover your thesis, then put it where it\nbelongs near the start of your essay.\n\n3) Don't assume that you can't use the first-person voice. \"I think\" or \"it seems to\nme\" is OK, as long as you have reasons to back up what you think. I'd rather\nhave you sound like a distinct individual than an impersonal bureaucratic\ncommittee. This advice also applies to the passive voice: make active voice\nconstructions your default ones, and reserve passive for the rare times it really\n\ncomes in handy.\n\n4) Begin your work process by saying to yourself, \"In order to assemble a persuasive\nargument about this topic, the passages in the work I'm writing about that would\nreally need to be looked at are ....\" In other words, make a list of all the\npotentially useful passages in the work that address the question you're trying to\nanswer. Then prioritize your list to focus on those that seem most important, i.e.,\nleast permissible to omit from a short essay. This exercise provides training in\nqualitative assessment of information. It can also help safeguard you against the\ncriticism that you have omitted passages that might seem to contradict your\nargument.\n\n5) Quote from and/or paraphrase portions of the text to support your claims as much\nas possible. Don't think of your task as one of arriving at the tersest statement of\na book's \"meaning\"; think of it as one of engaging with some issue raised by the\nbook in sufficiently satisfying detail. Occam's razor doesn't apply here. Back up\nand/or illustrate your assertions by showing how they are borne out by the work\nyou're discussing. More richly detailed essays, those that take the trouble to\nrespond very fully to the text and to the questions posed in the assignment, will\nreceive higher marks than those that give minimal or very general responses. And\nit never hurts to write more than the bare minimum number of words required, so\nlong as all your words count toward enriching your argument and none of them is\njust there as filler.\n\n6) In high school, many of you may have been taught the model of the \"5-paragraph\nessay\" (opening paragraph, 3 paragraphs of \"body,\" closing paragraph). That was\nfine then. College-level work takes on more complex subjects or looks more\ndeeply into subjects you may have encountered earlier. This means that the 5-\nparagraph model, rather than helpfully providing structure, can become a cage,\ninvolving a boredom-inducing level of repetition (here's what I will say, here I am\nsaying it, here's what I have said). You want to persuade your readers, not hit\nthem over the head. Acknowledge the greater sophistication of your material,\nyour approach, and your imagined audience by bidding the 5-paragraph model a\ngrateful farewell.\n\n7) Don't write for the professor. Write for an imaginary reader who is somewhat\nfamiliar with the text you're discussing but needs some reminding about what\nhappens when and so forth. When you discuss a particular passage or incident in\nthe text, make sure to contextualize it for this imaginary reader. When you move\nfrom one part of the text to another, help the reader move with you by providing a\nsufficient transition. Always be asking yourself if what you're saying will be\nclear and persuasive to the imaginary reader.\n\n8) Keep your opening paragraph focused on the specific claim your paper is making.\nDon't begin with vast generalizations (e.g. \"Throughout the history of Western\n\nliterature\") when your real subject is something specific about a particular text.\n\n9) People often think that academic writing is unlike the kind of writing they might\nneed to do in the \"real world.\" But one way in which the writing in this class is\nexactly like the writing you might do in a professional context is that it is being\nread by someone busy who has a lot of other things to read and who will hold you\naccountable for what you present.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.003 Reading Fiction: Imaginary Journeys\nFall 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Guidelines for all essays",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-003-reading-fiction-imaginary-journeys-fall-2015/ace5d5b5d8bd48b25efbdc3d655690f2_MIT21L_003F15_GuidelinesEs.pdf",
      "content": "Guidelines for all essays\n\n1) Submission, grading, and format: you will submit your essays and receive comments\nand grades back from me in electronic form. Please double-space your essays and\nformat them in Courier New 12. Send them as .doc or .docx files (not as pdfs). (I know\nCourier is ugly, but its size makes it easier to work with than some of the alternatives.) I\nwork in MS Word and will use the Track Changes and Insert Comment functions.\n\n2) Lateness and extensions: Essays turned in late without prior approval will receive an\nF. I am happy to grant brief extensions, but you must contact me in advance of the due\ndate to request one.\n\n3) Revision: You are required to revise one of your first two essays for this class.\na) Revision means more than simply correcting problems I found (or, on revisiting the\nessay, you found) on the original version; it means taking the opportunity to give the\noriginal version a complete reconsideration. Whatever survives from the original in the\nrevised version should have been subjected to scrutiny: does it really serve the purpose it\nneeds to serve, as effectively as possible? I want to see evidence that you have subjected\nyour original version to this type of scrutiny.\nb) When you decide to revise, you will need to schedule a meeting with me shortly after\nreceiving the original graded version back, to discuss strategies for revision. You are\nresponsible for coming to this meeting with your original essay showing my full\ncomments, either on screen or printed out. You should be prepared to talk specifically\nabout my comments and what you hope to improve (other than your grade). It's a good\nidea to choose one or two passages of the essay to focus on in our discussion, as\nexamples of things you might improve. If you fail to bring your essay to prepare for the\nmeeting, I will not be able to help you prepare for your revision.\nc) The grade for the revision will replace the original grade, but there is no guarantee of a\nhigher grade on the revision than the original version received.\n\n4) First page: Your essay doesn't need a cover sheet, but at the top of the first page it\nshould give your name, the class, and which topic you have chosen. It should also\nfeature a good title and a pledge stating that the paper is entirely your own work.\n\n5) Please number your pages.\n\n6) Quotation: you will need to quote a good deal from the text(s) you are discussing.\nWhen you quote, follow your quotation with a parenthetical citation giving the work's\nname (the first time; after that, if you're quoting only one work, it's not necessary to keep\nrepeating it) and the page number. You don't need footnotes or endnotes, or a \"Works\nCited\" list or bibliography. Quotations of longer than 5 lines should be set in on both\nsides and should be double-spaced. They do NOT need quotation marks around them\n(the setting-in indicates that it's a quotation). They don't need an extra blank line before\nand after them. Quotations from poetry should reflect the line breaks in the quoted poem.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.003 Reading Fiction: Imaginary Journeys\nFall 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Topics for essay #1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-003-reading-fiction-imaginary-journeys-fall-2015/b9d5e2fcb37c33f19cb43cc9d5fc1380_MIT21L_003F15_FirstEsayTop.pdf",
      "content": "21L.003 Reading Fiction: Imaginary Journeys\nTopics for essay #1\nEssay length: 2500-3000 words\n\nChoose one of the following:\n\n1. Explain why Odysseus feels it necessary, at the risk of his own life and the lives of his\ncrew, to call out his name to the Cyclops Polyphemus after blinding him and escaping\nfrom his cave. Why does Lancelot seem not to care as much that people should know\nwho he is?\n\n2. Consider the role of the hero's ambivalence in both Odyssey Books 9-12 and \"The Knight\nof the Cart.\" In Homer, the hero is motivated both by the desire to return home and by\nthe desire to gain glory; in Chretien, the hero hesitates to get into the cart because he still\nretains a care for his honor, even as he is devoted to the Queen. How does each work\nsuggest that the hero's divided loyalties are to be handled or resolved?\n\n3. Suppose you wanted to argue that Chretien de Troyes did not really like or believe in the\ncourtly love ideas of his patroness, Marie de Champagne. What portions of \"The Knight\nof the Cart\" could you point to as supporting this idea? Make the strongest case you can\nthat Chretien wanted to distance himself from the story he was telling at Marie's\ncommand. This might involve, for example, finding passages where Lancelot's devotion\nto the Queen could appear to cross over into the realm of parody.\n\n4. The moment we recognize that the Kingdom of Gorre may be the underworld, \"The\nKnight of the Cart\" promises to turn from being a story about a particular knight and his\nlady-love to being an allegory about the triumph over death, and Lancelot's actions can\nbe seen to parallel those of Christ (in particular, Christ's harrowing of hell and his dying\nto take away our sins and give us eternal life). Yet Chretien's tale remains one of an\nidealized but adulterous love. How reconcilable do you find it with Christianity? What\nperspective would you have to take in order to be able to see it as reconcilable?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.003 Reading Fiction: Imaginary Journeys\nFall 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Topics for essay #2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-003-reading-fiction-imaginary-journeys-fall-2015/1053cae1191a5ccba59c7dcd3d0dce41_MIT21L_003F15_SecondEsayTo.pdf",
      "content": "21L.003 Reading Fiction: Imaginary Journeys\nTopics for essay #2\nEssay length: 2500 words\n\nChoose one of the following:\n\n1. In the Prologue to Don Quixote, Cervantes' friend declares that \"this work of yours is\nonly concerned to destroy the authority and influence that books of chivalry enjoy in the\nworld and among the general public.\" In the sections that we read for class, are there\nsigns that this may not be the only purpose of the book? Can you identify any scenes or\npassages in which Don Quixote, rather than being mocked for believing in books of\nchivalry, actually appears rather noble because of that belief? Similarly, in Part IV of\nGulliver's Travels, Swift presents the Houyhnhnms' society as a rational and natural one\nand uses it to launch satirical critique against the societies of Europe. Gulliver is so won\nover by the Houyhnhnms' superior ways that he can hardly fit in once he's back home\nand prefers the company of his horses to that of other people (or Yahoos). But are there\nsigns that the Houyhnhnms' way of life may not be all that perfect? For each book, show\nhow there may be an unacknowledged other side of the story from the ostensible one.\n\nNOTE: for question #1, if you find you have enough material from either one of the\nbooks to fill up the word count for this assignment, you may write about that one book\nalone if you wish.\n\n2. Compare the kind of satire mainly used in Part I of Gulliver's Travels with that mainly\nused in Part IV. What important differences do you see between the two approaches\ntaken toward satire in these two parts? Provide plenty of examples to make your case.\n\n3. Don Quixote is about a man who lives a life out of medieval romance literature in a\nsociety that is on the path toward modernity. What contrasts arise from this\njuxtaposition? Consider such things as: what different institutions or activities are central\nto medieval and modern societies? What is the relationship between author and audience\nin both periods? How does the change from medieval to modern manifest itself in terms\nof literary style? (You may think of additional questions to address as well.)\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.003 Reading Fiction: Imaginary Journeys\nFall 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}