{
  "course_name": "Reading Fiction: Dysfunctional Families",
  "course_description": "No description found.",
  "topics": [
    "Humanities",
    "Literature",
    "Criticism",
    "Fiction",
    "Humanities",
    "Literature",
    "Criticism",
    "Fiction"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nCourse Description\n\nThis course explores the form, content, and historical context of various works of fiction specifically through the thematic lens of \"dysfunctional families.\" We will focus primarily on questions pertaining to the structure, language, story, and characters of these fictional works.\n\nCourse Requirements\n\nActive participation\n\nTwo 3-page papers\n\nThree 5-page papers\n\nA revision\n\nAs a subject falling under the category of literary studies, 21L.003 does count toward HASS-D (Humanities and Social Sciences Distribution)\nand\nCI-H (Communication Intensive) credit, which means that the course fulfills the communication requirement to \"plan, organize, draft, and revise a series of assignments based on course material\" leading to a total of at least 20 pages of writing. A minimum of 1 hour a week (out of 3) will be dedicated to class discussion. The class will have no more than 25 enrolled students.\n\nThe Skills You'll Learn\n\nHow to analyze fiction\n\nHow to argue a case about a literary text\n\nHow to preserve the memory of your (pleasurable) reading experiences\n\nAnd, indeed, how to find pleasure in reading, in the first place\n\nHow to proselytize effectively to your friends about the joys of reading fiction\n\nHow You'll Learn Those Skills\n\nParticipation\n\nRegular attendance and active participation in class. Participation includes responding to questions or points raised in discussion and generating discussion. You may miss 2 classes without penalty, for any reason. Each miss beyond 2 will count for 2/3 of a letter grade taken off of your final grade (i.e. B to C+). More than 6 misses may mean no credit for the course (missed classes due to college athletics, religious holy days, or serious illness must be cleared with me). Two late arrivals to class will count as one absence, so please do and do try to be on time.\n\nAssigned Readings\n\nAll readings (books) for the class are available at the bookstore. These readings must be completed by the date they appear in the\nreadings\ntable.\n\nAssigned Writings\n\nYour assignments for class are recorded on the syllabus and listed in the\nassignments\nsection. Unless otherwise directed, assignments must be submitted by 5pm in my mailbox on the due date. All papers should follow the\nMLA format\n. These papers should be typed, double-spaced, paginated, titled (no title page necessary), and in 12-point font (Times New Roman) with 1-inch margins on all sides.\n\nWriting Sessions\n\nYour final grade for two of the writing assignments is ultimately determined by three factors: the strength of your argument, the clarity of your writing style, and whether or not you attended a writing session with the writing specialist assigned for this class. Your essay grade will be reduced by 2/3 if you do not attend a writing session for Essay #1 and one for the Revision (attending a session for the other writing assignments, although highly recommended, is not required).\n\nMeeting times with the writing specialist are by appointment. To make an appointment for your 30-minute writing session, please request a time when she is in class or by email. In advance of each paper she will also circulate a sign-up sheet in class. If you need to cancel the appointment, please be considerate and give her enough notice either by phone or via e-mail. We\nstrongly discourage\nyou from canceling appointments, so please try your best to make each appointment you schedule. A successful writing session depends on your preparations for it, so please come to them ready with questions and ideas you have about your draft or your planning for a draft. Additionally, please e-mail her a draft of your paper before you meet with her.\n\nGrading\n\nREQUIREMENTS\n\nGRADING\n\nParticipation\n\n10%\n\nEssay 1\n\n10%\n\nEssay 2\n\n15%\n\nEssay 3\n\n20%\n\nRevision\n\n20%\n\nEssay 4\n\n25%\n\nCalendar\n\nSES #\n\nTOPICS\n\nKEY DATES\n\nIntroduction\n\nLeo Tolstoy\n\n3-4\n\nMary Shelley\n\nEdgar Allan Poe\n\nEssay 1 due\n\n6-7\n\nNathaniel Hawthorne\n\nWorkshop: Crafting an argument\n\n9-10\n\nE. M. Forster\n\nD. H. Lawrence\n\nEssay 2 due\n\n12-13\n\nVirginia Woolf\n\n14-15\n\nWilliam Faulkner\n\nEssay 3 due in Ses #15\n\n16-17\n\nJames Baldwin\n\nCarson McCullers\n\nWorkshop: Revising a paper\n\n19-20\n\nFlannery O'Connor\n\nRevision due\n\n21-22\n\nCristina Garcia\n\n23-24\n\nToni Morrison\n\n25-26\n\nArundhati Roy\n\nEssay 4 due",
  "files": []
}