{
  "course_name": "Relativistic Quantum Field Theory III",
  "course_description": "This course is the third and last term of the quantum field theory sequence. Its aim is the proper theoretical discussion of the physics of the standard model. Topics include: quantum chromodynamics; the Higgs phenomenon and a description of the standard model; deep-inelastic scattering and structure functions; basics of lattice gauge theory; operator products and effective theories; detailed structure of the standard model; spontaneously broken gauge theory and its quantization; instantons and theta-vacua; topological defects; introduction to supersymmetry.",
  "topics": [
    "Science",
    "Physics",
    "Particle Physics",
    "Quantum Mechanics",
    "Relativity",
    "Theoretical Physics",
    "Science",
    "Physics",
    "Particle Physics",
    "Quantum Mechanics",
    "Relativity",
    "Theoretical Physics"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nDescription\n\nThis course is the third and last term of the quantum field theory sequence. Its aim is the proper theoretical discussion of the physics of the standard model.\n\nPrerequisite\n\n8.324\n(Quantum Field Theory II)\n\nGrading\n\nYour grade will be based on problem sets to be given out roughly every 2 weeks. There are no exams.\n\nTextbooks and References\n\nThe required textbook is:\n\nPeskin, Michael E., and Daniel V. Schroeder.\nAn Introduction to Quantum Field Theory (Frontiers in Physics)\n. New York, NY: HarperCollins Publishers, 1995. ISBN: 9780201503975. (Corrections page:\nAn Introduction to Quantum Field Theory\n.)\n\nPlease see the\nreadings\npage for other recommended texts.\n\nSubjects and Topics\n\n1. Introduction to the Standard Model\n\nFields, particle content, and symmetries.\n\n2. Renormalization Group\n\nWilsonian flow and fixed points. Renormalization group equations and anomalous dimensions. β & γ-functions in the standard model (SM) scheme. Quantum chromodynamics (QCD) β-function and asymptotic freedom. Renormalization of composite operators.\n\n3. Spontaneous Symmetry Breaking\n\nReview of Goldstone's theorem. The σ-model and chiral symmetry breaking in QCD. Pions as goldstone bosons. Standard model Higgs mechanism and electroweak gauge symmetry.\n\n4. Flavor Sector\n\nCabibbo-Kobayashi-Maskawa (CKM) matrix, flavor & mass eigenstates. Weak interactions, flavor-changing neutral currents & Glashow-Iliopoulos-Maiani (GIM) mechanism. CP-violation in Kaon and B-decays. Heavy quark symmetry. Dirac & Majorana Neutrinos. See-Saw mechanism.\n\n5. Collider Phenomenology (Large Hadron Collider (LHC))\n\nStandard model Higgs production and decay. Parton distribution functions and deep inelastic scattering. Jets in QCD. Infrared safety.\n\n6. Anomalies\n\nGlobal anomalies, triangle diagrams, symmetries of the path-integral. Anomalies in chiral gauge theory. Index theorem and zero-modes. π\n→ γγ.\n\n7. Topological Sectors in Gauge Theory and Instantons\n\nLarge gauge transformations,θ-vacuua, Instantons and U(1)\nA\nbreaking.\n\n8. Confinement and Lattice QCD\n\nWilson loops, area law for confinement. Lattice action for gluons. Strong coupling expansion. Fermions on the lattice.\n\n9. Standard Model Problems\n\nNaturalness and hierarchy problem. SU(5) and grand unified theories. Coupling unification and supersymmetry. Proton decay.",
  "files": [
    {
      "category": "Resource",
      "title": "homework1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-325-relativistic-quantum-field-theory-iii-spring-2007/08324c26404b77e0743d25511a25505b_homework1.pdf",
      "content": "8.325 Homework 1\nIain Stewart, February 11, 2007\nDue: In lecture Feb. 22.\nProblem 1) Practice with Local and Global Symmetry\nConsider the theory\nL = L1 + L2 = ψ1 i /D1 ψ1 + ψ2 i /D2 ψ2\n(1)\nwhere iDj\nμ = i∂μ + gAa\nμTj\na . In terms of the Pauli matrices we have\nσa\nT1\na =\n,\n(2)\nand\nσ2\nσ3\nσ1\nT2\n1 =\n,\nT2\n2 =\n,\nT2\n3 =\n.\n(3)\nLet Aμ be the gauge-bosons that ensure the L1 part of the Lagrangian is invariant under\na\na local SU(2) gauge symmetry. Show that L2 is also SU(2) gauge invariant. L1 + L2 also\nhas a global SU(2) flavor symmetry. Find the generators of this global symmetry. [This\nproblem is from Georgi.]\nProblem 2) Practice with Fadeev-Popov in QCD and QED\nIn Peskin & Schroeder you will find the Fadeev-Popov procedure applied to QCD in gen\neralized Lorentz gauge ∂μAa\nμ = 0 with gauge-fixing parameter ξ. In the first part of this\nproblem you will repeat the steps but use a generalized axial gauge, nμAμ\na = 0 with n2 < 0\nand gauge-fixing parameter ξ.\na) Derive the generalized axial-gauge QCD Lagrangian including gauge-fixing and ghost\nterms.\nb) Usually \"axial-gauge\" is reserved for the case n · A = 0 which can be obtained from\nthe ξ → 0 limit. Derive the form of the gluon-propagator in this limit and show that\nthe ghost fields from part a) decouple.\nUsually one does not worry about ghost interactions in QED. However, this does depend\non the gauge choice.\nc) Consider the gauge choice G(A) = ∂μAμ + λAμAμ in QED. Derive the Feynman\nrule for the ghost-photon interaction.\n\nProblem 3) Positronium Decay\nPositronium is a non-relativistic bound state of an e- and an e+ . The S-wave bound\nstate has spin S = 0 (para-positronium) or S = 1 (ortho-positronium).\na) Use charge conjugation to show that para-positronium decays to either two or three\nphotons, and that ortho-positronium does the opposite.\nb) The probability that the e+ and e- are at the same spacetime point is determined\nby the non-relativistic wavefunction for the bound state, ψ(x). Derive a formula for the\ndecay rate Γ for positronium to two-photons. Your result should involve ψ, and M, where\nM is the appropriate e+e- → γγ amplitude. (The discussion in Peskin around eq.(5.43)\nmight be useful.)\nc) Compute |M|2 at lowest order and thus determine Γ in terms of me and the QED\ncoupling α."
    },
    {
      "category": "Resource",
      "title": "homework2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-325-relativistic-quantum-field-theory-iii-spring-2007/e828d2b94d08889f162c48eadb687f4f_homework2.pdf",
      "content": "8.325 Homework 2\nIain Stewart, Feb. 23, 2007\nDue: In lecture March 8.\nProblem 1) MS beta-function with multiple dimensionful couplings\nConsider a field theory with a set of couplings g1, g2, . . ., g`, . . . which we'll call ~g. Your\ngoal is to derive an expression for the beta-functions in the MS-scheme that is valid at any\norder in perturbation theory. (It will also be valid for both renormalizable theories and \"non\nrenormalizabile\" theories with irrelevant operators.) Let Δl(d) = Δ` + ρ` be the dimension of\nthe bare coupling g`\nbare in d = 4 - 2 dimensions. We can define a dimensionless running coupling\nin the MS-scheme by\ng`\nbare μ -Δ`(d) = g`(μ, d)Zg` (~g),\nwhere g`(μ, d) is analytic in d and Zg` is a series in 1/. Prove that the beta-function for\ng` ≡ g`(μ, d) is\nβ(g`, d) = μ d g` = -ρ` g` - Δ` g` + g`\nX da1\n` (~g)ρmgm ,\n(1)\ndμ\nm\ndgm\nwhere a1\n` is the coefficient of the 1/ pole term in Zg` . Find a recursion relation for the coefficients\nof the higher poles, ak(~g). How are these results modified in the MS-scheme? [Side Remark: in\nthis notation the standard beta-function is β(g`) = β(g`, 4).]\nProblem 2) Scheme and gauge dependence of beta-functions\nConsider a renormalizable non-abelian gauge theory. Let g(μR) and β(g) be the renormalized\ncoupling and beta-function in a mass-independent renormalization scheme. This could be the\nMS-scheme or an offshell momentum subtraction scheme, etc.\na) Prove that in any scheme the first term in the series expansion of β(g) is gauge independent.\nb) Prove that the first two terms in the series expansion of β(g) are scheme independent.\nc) Finally, prove that in the MS-scheme the renormalized coupling is gauge independent. Thus\nin this scheme all terms in β(g) are gauge independent. Use this result to strengthen the\nstatement in a).\nProblem 3) QCD beta-function in background field gauge\nUsing background field gauge derive the lowest order beta-function for QCD in a massless scheme\nby carrying out the computation of the 3 diagrams discussed in lecture. Express your result in\nterms of the quadratic adjoint Casmir CA and the number of quark flavors nf . What is the\nbeta-function for an SU(2) gauge theory with 6 flavors?\n\nProblem 4) The QCD running coupling and thresholds\nWe originally motivated the discussion of mass-independent renormalization schemes by consid\nering μ m. However, these schemes are well defined regardless of the relation between μ and\nm, and so we can consider using them for μ ' m and for that matter μ ≤ m. In this problem\nwe'll explore how this works in QCD at one-loop order.\nIn lecture you saw that in a mass-dependent scheme for QED the electron \"decouples\" from\nthe beta-function as we go below its mass scale, falling off quite rapidly, β(μ m) ∼ μ2/m2 .\n-\n-\nHowever, if you consider the mass-independent QED beta-function with an e , μ-, and τ\nthen\napriori you have the same beta-function for me μ mμ, μ mτ , or any other value of\nμ. The issue with a mass-independent scheme is that α(μ) is not smart enough to know that\nheavy particles in the field theory should decouple. This is an important piece of physics that\nwe're going to build into the mass-independent schemes by hand. To do this consider evolving\nthe coupling down from a μ mτ with the beta-function with 3-leptons, n` = 3. When we\nreach μ = mτ we'll decree that the tau is removed from our theory, so that below this scale we\nswitch to using a beta function with n` = 2. Lets call the coupling in the theory with n` leptons\nα(n`)(μ). To ensure that this process does not disturb our field theory too much, we'll demand\nthat scattering amplitudes computed in the theory with n` = 3 and n` = 2 are the same at\nμ = mτ . At lowest order in perturbation theory this just implies continuity of the coupling at\nthe boundary, α(3)(mτ ) = α(2)(mτ ). At each mass-threshold we'll repeat the above procedure to\nbuild in the decoupling by hand.1\nLets apply the same logic to QCD to give couplings αs\n(nf )(μ) which satisfy the mass-\nindependent beta-function equation for nf -flavors. From αs\n(nf )(μ) we can define the integration\n(nf )\nconstant ΛQCD.\na) Let αs\n(5)(mZ ) = 0.118 with the physical Z-boson mass be your initial condition. Lets\ntake the mass of the bottom and charm quarks to be mb = 5 GeV and mc = 2 GeV\n(slightly heavier than in nature). Using the decoupling procedure described above, compute\nαs\n(3)(μ = 1.5 GeV). Compare it numerically to αs\n(5)(μ = 1.5 GeV).\nb) Consider QCD with mu = md = ms = 0 and note that in this theory the proton-mass\nis dominated by non-perturbative dynamics of these three quarks. Hence we expect the\n(3)\n(6)\n(3)\nproton mass mp ∝ ΛQCD. Derive a relation between ΛQCD and ΛQCD that only involves\nheavy-quark masses. Now imagine that the strong coupling is fixed at some very high scale\n(eg. at a unification scale ∼ 1016 GeV), and predict how much the proton-mass changes if\nyou double the b-quark mass.\n1In the context of effective field theory this procedure of removing particles is known as \"integrating out\" a\nmassive degree of freedom, and ensuring the continuity of the S-matrix elements is known as \"matching\"."
    },
    {
      "category": "Resource",
      "title": "homework3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-325-relativistic-quantum-field-theory-iii-spring-2007/460f13de23a5ae849d41bb1474b8699f_homework3.pdf",
      "content": "8.325 Homework 3\nIain Stewart, Mar. 10, 2007\nDue: In lecture March 22.\nProblem 1) Composite Operator Renormalization\nIn lecture we discussed the renormalization of parameters in a Lagrangian. Often one is inter\nested in studying a local current built from a product of fields at the same space-time point. For\nexample, consider Jμν = ψ (0)σμν ψ(0) in QED. External operators like Jμν may require renor\nmalization beyond that associated with the field ψ(0) (you discussed an example of this type in\nsection). In this problem I want you to compute the anomalous dimension for Jμν . To turn this\ninto a problem you know how to solve, consider adding a term\n\nLint = C0\nμν ψ0σμν ψ0\n(1)\nto the QED Lagrangian. By switching from bare to renormalized coefficients and fields as usual,\ncompute the anomalous dimension for Cμν in MS to order e2 . [Hint: Remember you only need\nthe 1/o poles. Compare eqs.18.10 and 18.11 in Peskin. You can use Zψ from Peskin without\ncomputation.] Now write Lint = Cμν (μ)Jμν (μ) to define the renormalized current, and use the\nanomalous dimension for Cμν (μ) to find the anomalous dimension of Jμν (μ).\nProblem 2) The decay π-\nμ-ν μ\n→\nAt low energy, p2\nmW\n2 = (80 GeV)2 we can expand the W -boson propagator, 1/(p2\nmW\n2 ) =\n≪\n-\n-1/m2 + . . .. Keeping the first term gives the effective four-fermion interaction\nW\nGF\n\nLeff = √\n2 Vud [dγα(1 -γ5)u][ νμγα(1 -γ5)μ] + h.c.\n(2)\nwhich allows ud\nμ-ν μ and hence π-\nμ-ν μ. Define the decay constant for the pion as\n→\n→\n⟨0|uγ\n\nαγ5d|π-(pπ)⟩= -i fπ pπ\nα ,\n(3)\nand show that the rate for π-\nμ-ν μ is\n→\nG2\n\nm2 2\nΓ = 8π\nF |Vud| 2 m μ\n2 mπfπ\n2 1 -m2 π\nμ\n.\n(4)\nComparing with data, and taking Vud\n1, determine a value for fπ. There are two common\n≃\nnormalization conventions for fπ in the literature.\nThe one in this problem agrees with the\nconvention in the chiral Lagrangian in problem 3 below, fπ = f.\nThe other convention is\nJα,a\nα δab\n\n⟨0|\n|πb(pπ)⟩= -i Fπ pπ\nwhere J5\nα,a = ψγαγ5(τ a/2)ψ. Derive the relation between Fπ and\nfπ.\n\nProblem 3) The decays π-\nπ0e-ν e and K-\nπ0π0e-ν e\n→\n→\nIn lecture we derived a Feynman rule for the π- to W - transition by starting from the gauged\nSU(2) chiral Lagrangian,\nf 2\nh\ni\nLχ = 8 tr DμΣDμΣ+ ,\n(5)\nwhere DμΣ = ∂μΣ + ilμΣ and lμ = -g2/\n√\n2 W μT + + h.c. [for simplicity we'll assume Vud = 1 in\n+\nthis problem].\na) By carrying out this expansion to higher order in the pion fields derive the amplitude for\nπ-\nπ0e-ν e.\n→\nb) Now generalize to the SU(3) case. Draw the tree level Feynman diagrams that can con\ntribute to K-\nπ0π0e-ν e. Derive the Feynman rules that you would need to compute\n→\nthis amplitude (in the charged Goldstone-boson basis). Recall that Lχ has a four-boson\ninteraction. Feel free to use a program like Mathematica to take the traces. You may also\nuse results given in lecture."
    },
    {
      "category": "Resource",
      "title": "homework4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-325-relativistic-quantum-field-theory-iii-spring-2007/7d195f3b0b11337fcd3e60be038050d1_homework4.pdf",
      "content": "8.325 Homework 4\nIain Stewart, Mar. 23, 2007\nDue: MONDAY April 9.\nProblem 1) Peskin & Schroeder 20.1 (Spontaneous Breaking of SU(5))\nProblem 2) Peskin & Schroeder 20.2(b) (Z-Decays)\nProblem 3) Peskin & Schroeder 20.5 (A Model with Two Higgs)\nProblem 4) Peskin & Schroeder pg.775, (Final Project on Higgs Decay)\na) Do part a) on pg.776.\nb) Do part b) on pg.776, but only do the decay h0\nW +W - and not h0\nZ0Z0 .\n→\n→\nc) Do part c) on pg.776. Note that you can leave the answer in terms of Feynman parameters,\nbut that you should verify the asymptotic properties that Peskin mentions.\nd) Continuing from part c), in fact Peskin's I(m2\nh/m2\nq ) = F(x) where x = 4m2\nq /m2\nh and\nF(x) = x[1 + (1 -x)f(x)]\n(1)\n\n[ sin-1(1/√x)]\nfor x ≥1\nh\n\ni2\nwith f(x) =\n√\n\n1 ln 1+√1-x -iπ\nfor x < 1\n-\n1-\n1-x\nConsider the h0\ngg decay rate through the dominant top-quark loop, dropping the other\n→\nterms. What is the decay rate in the limit m2\nt ≫m2\nh? Using F(x) and your answer in c),\nhow good is this approximation for the range of Higgs masses we expect to probe at the\nLHC? (You should look up what this range is if you do not know it and cite your source.)"
    },
    {
      "category": "Resource",
      "title": "homework5.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-325-relativistic-quantum-field-theory-iii-spring-2007/0c0e1d2cddfa2a7ad273388fbeab9ba6_homework5.pdf",
      "content": "X\n8.325 Homework 5\nIain Stewart, April 7, 2007\nDue: Thur. April 19.\nProblem 1) Higgs Self-Coupling\nConsider the beta-function for the Higgs self-coupling\nd\nμ 2\ndμ2 λ = 16π2 12λ2 -5g ′ 2λ -9g 2λ + 100g ′ 4 + 10g ′ 2 g 2 + 4g 4 + 4Tλ -4H\n(1)\n′\nwhere g, g are the gauge couplings for SU(2) × U(1), and in terms of the Yukawa matrices gu,\ngd, and ge we have T = tr[3gu\n+gu + 3gd\n+ gd + ge\n+ge] and H = tr[3(gu\n+gu)2 + 3(gd\n+ gd)2 + (ge\n+ge)2]. Draw\nthe Feynman diagrams that contribute for each of the terms in Eq.(1) in unitary gauge.\nProblem 2) The CKM matrix for n-families\na) Consider the CKM matrix V , but with n-families instead of three.\nBy repeating the\nsteps carried out in lecture, determine the number of physical parameters. In particular\ndetermine the number of angles and the number of CP-violating phases as a function of n.\nb) It would be nice to determine the number of physical parameters directly from the original\nquark Yukawa couplings. Consider the G = U(n) × U(n) × U(n) symmetry of the free\nquark kinetic terms. This symmetry is broken by the Yukawa matrices down to U(1)baryon,\nso the number of physical parameters can be obtained by taking the number in the original\nn-family Yukawa coupling matrices and subtracting the number of parameters in G/U(1).\nVerify that this gives the same number of real parameters and phases for V as in a).\nProblem 3) CP violation in B\nππ\n→\na) Explain what symmetry forbids B decays to a |ππ⟩I=1 state, where I is isospin. Define\n|π+π-⟩S = (|π+π-⟩+ |π-π+⟩)/\n√\n2 and a similar equation for |π0π-⟩S, then work out the\ndecomposition of these states and |π0π0⟩in terms of two pion states with I = 0 and I = 2.\nb) Integrating out the top and W-boson gives the following two operators in the weak Hamil\ntonian which are relevant for B\nππ decays,\n→\n\nO1 =\n( uγμPLb)(dγμPLu) ,\nO3 =\n(dγμPLb)\n( qγμPLq) ,\n(2)\nq\nwhere the sum is over q = u, d, s, c, b. Here O1 is called a current-current operator and is\ngenerated from W-exchange taken at low energy. O3 is called a QCD penguin operator\nand is generated by the penguin diagram mentioned in lecture, but with a top-quark in\nthe loop (draw it). What CKM factors come along with these two operators? (There are\nin fact twelve four quark operators Oi relevant for B\nππ, but we will only study two\n→\n\nof them in this problem.) A single insertion of O1 or O3 mediates the B\nππ transition.\n→\nUse isospin and classify O1 and O3.\nNext use your results in a) and determine which\noperators contribute for decays to the different charged pion final states. How many strong\ninteraction parameters does isospin allow for these decays?\nc) Ignoring the QCD penguin operator, determine which weak phase of the unitary triangle is\nfound by measuring Im λ from the time-dependent asymmetry in B\nπ+π- decays. The\n→\nparameter λ was defined in lecture in our discussion of CP-violation in interference with\nand without mixing.\nd) Add the penguin contribution and explain what this does to your result in part c). What\nnon-CKM information do we now need to know to extract information about weak phases\nfrom Im λ? [Aside: In fact, if we had precise measurements of branching ratios and CP-\nasymmetries for the different charge channels in b) then it can be shown that this would\nallow us to simultaneously determine the strong interaction parameters and the phase you\nfound in c).]"
    },
    {
      "category": "Resource",
      "title": "homework6.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-325-relativistic-quantum-field-theory-iii-spring-2007/1d3ff652121f505cbcfcb0795997d4c4_homework6.pdf",
      "content": "8.325 Homework 6\nIain Stewart, April 20, 2007\nDue: Thur. May 3.\nProblem 1) Peskin & Schroeder, Problem 19.1, page 686-687\nProblem 2) Axial-Anomaly in Dimensional Regularization\nCompute the axial anomaly for QED in four-dimensions from the triangle diagram using dimen\nsional regularization (show all your steps ie. not just those displayed in Peskin). Demonstrate\nthat your result is equivalent to a matrix element of the operator equation\n∂μJμ5 = - e\nF αβ F αβ\n(1)\n16π2\nwhich we discussed in two different ways in lecture.\nProblem 3) Baryon and Lepton Number\nLet Bμ be the current for baryon number, and Lμ be the current for lepton number. Show that\nBμ has an anomaly, but that Bμ - Lμ does not.\nProblem 4) The decays π0 → γγ and η → γγ\na) Compute the matrix element and the decay rate Γπ0 for π0 → γγ through the anomaly.\n(You may use results from lecture.) Using the experimental values for mπ and fπ compare\nyour result with the experimental value for the decay rate in the PDG (http://pdg.lbl.gov/).\nb) Consider η0, the 8'th Goldstone boson of the spontaneous symmetry breaking SU(3)L ×\nSU(3)R → SU(3)V in QCD. Assume that the decay η0 → γγ also preceedes through the\naxial anomaly and compute Γη0 /Γπ0 ."
    },
    {
      "category": "Resource",
      "title": "homework7.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-325-relativistic-quantum-field-theory-iii-spring-2007/0836842e8128f3c44915edaa95c65bcb_homework7.pdf",
      "content": "8.325 Homework 7\nIain Stewart, May 6, 2007\nDue: Thur. May 17.\nProblem 1) Some algebra used to study θ-vacua and instantons\na) Let G μν = oμναβ Gαβ and\nh\n2i\ni\nKμ = 2oμαβγ Tr GαβAγ +\nAαAβAγ\n(1)\nand show that ∂μKμ = Tr[Gμν G μν ]. Feel free to use the Bianchi identity, DμG μν = 0,\nwithout proof.\nb) Show that the instanton\nr2\n+\nx4 + ix · σ\nAμ =\n(-i)g ∂μg,\ng =\n(2)\nr2 + ρ2\nr\nwhere r2 = x4\n2 + x2 satisfies the Euclidean field equations DμGμν = 0.\nProblem 2) Scalar production, e + e -\nqS\n→ q\nPeskin & Schroeder, page 596, Problem 17.2, part a).\nProblem 3) Deep inelastic scattering from a photon.\nPeskin & Schroeder, page 649, Problem 18.4 parts a), b), c)."
    }
  ]
}