{
  "course_name": "Renaissance To Revolution: Europe, 1300-1800",
  "course_description": "This course provides an introduction to major political, social, cultural and intellectual changes in Europe from the beginnings of the Renaissance in Italy around 1300 to the outbreak of the French Revolution at the end of the 1700s. It focuses on the porous boundaries between categories of theology, magic and science, as well as print. It examines how developments in these areas altered European political institutions, social structures, and cultural practices. It also studies men and women, nobles and commoners, as well as Europeans and some non-Europeans with whom they came into contact.",
  "topics": [
    "Humanities",
    "History",
    "European History",
    "History of Science and Technology",
    "Philosophy",
    "Political Philosophy",
    "Religion",
    "Humanities",
    "History",
    "European History",
    "History of Science and Technology",
    "Philosophy",
    "Political Philosophy",
    "Religion"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nPrerequisites\n\nThere are no prerequisites for this course.\n\nCourse Description\n\nThis subject provides a selective introduction to major political, social, cultural and economic changes in Europe from the beginnings of the Renaissance in Italy around 1300 to the outbreak of the French Revolution at the end of the 1700s. Throughout we will focus on the porous boundaries between the categories of theology, magic and science, as well as the impact of various technologies of print. In this iteration of the class, we will pay special attention to these questions in seventeenth-century England, where the strains of civil war and religious disputation made issues of theology, science, magic, and censorship central to basic political and philosophical debates.\n\nCourse Requirements\n\nActive class participation is central to our work together. Attendance is mandatory, and students are expected to arrive in lecture and recitation on time and prepared to discuss common readings. Students will write two 1250 word papers, due during Session 5 and Session 24. A mandatory 1250 word rewrite of the first paper will be due during Session 9. Students will write one 2500 word paper, due during Session 18. Finally, each student will participate in an in-class debate, during either Session 19 or Session 20. There will be no midterm and no final.\n\nGrading Policy\n\nACTIVITIES\n\nPOINTS\n\nClass Participation\n\n25 points\n\nDebate\n\n25 points\n\nTwo 1250 Word Papers\n\n60 points (30 points each)\n\nRewrite of First 1250 Word Paper\n\n30 points\n\nOne 2500 Word Paper\n\n60 points\n\nTotal\n\n200 points\n\nEach assignment will be weighted as shown in the table above in the calculation of the final grade, although these calculations will also take into account improved performance during the course of the semester.\n\nFor further detail, please see the\nAssignments\nsection.\n\nRequired Reading\n\nAll readings are listed in the table in the\nReadings\nsection.\n\nIf you want more background reading on this period in European history, consult:\n\nHunt, Lynn, Thomas R. Martin, et al.\nThe Making of the West: Peoples and Culture-A Concise History, Vol. I: To 1740\n. 3rd ed. Bedford / St. Martin's, 2010. ISBN: 9780312554590.\n\nGinzburg, Carlo.\nThe Cheese and the Worms: The Cosmos of a Sixteenth-Century Miller\n. Translated by John and Anne Tedeschi. John Hopkins University Press, 1992. ISBN: 9780801843877. [Preview with\nGoogle Books\n]\n\nDescartes, Rene.\nDiscourse on Method\n. 3rd ed. Hackett Publishing Company, Incorporation, 1998. ISBN: 9780872204225. [Preview with\nGoogle Books\n]\n\nWriting Help\n\nThe\nWriting and Communication Center\nat MIT offers\nfree\none-on-one\nprofessional\nadvice from lecturers (who all have advanced degrees and who are all are published writers) about all types of academic, creative, and professional writing and about all aspects of oral presentations (including practicing your presentations). We help you think your way more deeply into your topic, no matter what department or discipline you are in.\n\nCheating and Plagiarism\n\nThe web now hosts many sites which offer college level papers of varying quality on a variety of topics. I am well acquainted with these sites, and with others that offer detection services to professors. Buying a paper written by someone else and submitting it as your own work is cheating. Copying sections from someone else's print or online work into your own without an acknowledgement is plagiarism. MIT has strict policies against both activities that I will fully enforce. For the appropriate MIT definitions and policies, visit\nAcademic Integrity at MIT: A Handbook for Students\n. If you are uncertain about what constitutes cheating or plagiarism, please contact me before submitting the work in question.",
  "files": [
    {
      "category": "Assignment",
      "title": "21H.141S15 Renaissance To Revolution: Assignments - Debate 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-141-renaissance-to-revolution-europe-1300-1800-spring-2015/89ddb279d773921974d170b863941fc5_MIT21H_141S15_Debate1.pdf",
      "content": "21H.141\nSpring 2015\n\nFIRST DEBATE RESOLUTION & FORMAT\n\nDebate resolution:\n\n\"By the end of the seventeenth century, it was inevitable that theology would no longer\nplay a decisive role in the politics of the various European states.\"\n\nDivision of teams:\n\nPro: Three MIT students\n\nCon: Three MIT students\n\nRound 1\n\n- Pro side presents its argument (5-7 minutes)\n- Con side presents its argument (5-7 minutes)\n\n5-minute break to prepare rebuttals\n\nRound 2\n\n- Questions from debaters and audience (30-45 minutes)\n\n5-minute break to prepare closing statements\n\nRound 3\n\n- Closing statements by con and pro sides, in that order (3 minutes each)\n- Vote by class to determine winner\n- Awarding of \"Age of Reason\"-themed prize!\n\n*******************************\n\nDebate teams may want to meet ahead of time to prepare the arguments they will use\nduring the debate. Teams should also anticipate their opponent's arguments and\n\nquestions from the floor, and prepare rebuttal points. Each team should designate ahead\nof time who will a) deliver the opening argument; b) respond to questions; and c) make\nthe closing statement. Each speaker should stand when presenting an argument, and\nshould speak slowly and clearly. If possible, practice your presentations before the day\nof the debate.\n\nFinally, at the start of the debate each participant is required to turn in a single-sided, one-\npage position statement. This statement should also include two questions you might ask\nthe other team during the Q & A part of the debate. Each team member will be graded\nindividually.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.141 Renaissance To Revolution: Europe, 1300-1800\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "21H.141S15 Renaissance To Revolution: Assignments - Debate 2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-141-renaissance-to-revolution-europe-1300-1800-spring-2015/859721ebeef064b85c1803797fc13d91_MIT21H_141S15_Debate2.pdf",
      "content": "21H.141\nSpring 2015\n\nSECOND DEBATE RESOLUTION & FORMAT\n\nDebate resolution:\n\n\"Sir Isaac Newton was the last of the great Renaissance humanists, not the first modern\nscientist.\"\n\n[N.B. Be sure to consult the readings for Session 18, as well as \"The Newton Project\" web\nsite. You may wish to read more from Dobb's and Jacob's Newton and the Culture of\nNewtonianism]\n\nDivision of teams:\n\nPro: Three MIT students\n\nCon: Three MIT students\n\nRound 1\n\n- Pro side presents its argument (5-7 minutes)\n- Con side presents its argument (5-7 minutes)\n\n5-minute break to prepare rebuttals\n\nRound 2\n\n- Questions from debaters and audience (30-45 minutes)\n\n5-minute break to prepare closing statements\n\nRound 3\n\n- Closing statements by con and pro sides, in that order (3 minutes each)\n- Vote by class to determine winner\n- Awarding of \"Renaissance to Revolution\"-themed prize!\n\n*******************************\n\nDebate teams may want to meet ahead of time to prepare the arguments they will use\nduring the debate. Teams should also anticipate their opponent's arguments and\nquestions from the floor, and prepare rebuttal points. Each team should designate ahead\nof time who will a) deliver the opening argument; b) respond to questions; and c) make\nthe closing statement. Each speaker should stand when presenting an argument, and\nshould speak slowly and clearly. If possible, practice your presentations before the day\nof the debate.\n\nFinally, at the start of the debate each participant is required to turn in a single-sided, one-\npage position statement. This statement should also include two questions you might ask\nthe other team during the Q & A part of the debate. Each team member will be graded\nindividually.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.141 Renaissance To Revolution: Europe, 1300-1800\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "21H.141S15 Renaissance To Revolution: Assignments - Editing Suggestions",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-141-renaissance-to-revolution-europe-1300-1800-spring-2015/2517fba1ccf12e2fa1135b2e62dea4e9_MIT21H_141S15_Suggestions.pdf",
      "content": "EDITING SUGGESTIONS\n\nThe writing process includes rigorous editing practices. Below are some points to keep in\nmind as you re-read and edit your papers before turning them in. You may also wish to\nlook at the brief guide to writing by W. Strunk and E.B. White called the The Elements\nof Style (available online at http://www.bartleby.com/141/.)\n\nSome Rules\n\n1. Avoid passive constructions. \"The chair was seen by me,\" is not as forceful as \"I\nsaw the chair.\"\n2. Use the past tense when describing historical individuals and events, not the\npresent tense.\n3. Avoid unnecessary words. After you have drafted your essay, set it aside for a day\nor two. Then reread it, eliminating every word that is redundant or does not add to\nyour meaning. Prime candidates for deletion are adverbs such as \"very,\" \"quite,\"\n\"extremely.\"\n4. Never use the phrase \"I feel that....\" This lends a subjective air to your argument\nthat tends to discredit you. Write \"I think that....\"\n5. Learn how to use the spell-checker on your computer program.\n\nSix Questions to Ask Before Turning in Your Paper\n\n1. Is the title of my essay informative?\n2. Do I state my thesis point soon enough, perhaps even in the first sentence, and\nkeep it in view throughout the paper? Is the opening paragraph interesting, and by\nits end, have I focused on the topic?\n3. Is my organization clear? Does each point lead into the next, without irrelevances\nand without anticlimaxes?\n4. Is each paragraph unified by a topic sentence or topic idea?\n5. Are sentences concise, clear and emphatic? Are needless words and inflated\nlanguage eliminated?\n6. Is the final paragraph conclusive without being repetitive?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.141 Renaissance To Revolution: Europe, 1300-1800\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "21H.141S15 Renaissance To Revolution: Assignments - Long Essay",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-141-renaissance-to-revolution-europe-1300-1800-spring-2015/2af20586f3b4dc3bcabe2bf1c98e5bae_MIT21H_141S15_LongEssay.pdf",
      "content": "21H.141\nSpring 2015\n\nLong Essay Assignment:\nEnglish Books and Periodicals in the Seventeenth Century\n\nA. Requirements\n\n1) Write an essay in response to one of the two prompts below. Your paper must be 2500\nwords (around 8-10 pages) long, using 12-point font and one inch margins. Please submit\nthe paper during Session 18.\n\n2) You must submit a prospectus that is at least one paragraph long to me by Session 17. The\nparagraph should specify which of the prompts below you have selected, the text or periodical\nyou have chosen to analyze, and a one-sentence summary of the thesis you intend to pursue. I\nwill give you feedback on your proposal by the end of the following day.\n\n3) Your paper must be computer-processed. Please give your paper a title, and write your\nname on the back of the last page. Do not write your name elsewhere on the paper. All\npages should be numbered. Refer to the editing handout for further editing suggestions.\nYou may also consult with tutors at the Writing Center or with me about your paper.\n\n4) Citations to the primary text you analyze should be made in parentheses in your paper.\nFor example, if you refer to a passage on page 3 of John Reeve, A General Epistle from the\nHoly Spirit, indicate this in the following manner at the end of your sentence, after the\nperiod: (Reeve, Holy Spirit, 3). Full citations to any work not assigned in class should be\nmade in footnote or endnote form.\n\nB. Topics\n\n1) Study a seventeenth-century printed English book. Select one of the books in the\nMIT Rare Books collection that I have listed below. All eleven books are also available\nvia the Early English Books Online (EEBO) website.\n\nOnce you have selected your book, please read it, or a portion of it that we mutually\nagree upon. Then write an essay in which you explain how this book adds to, modifies,\nor contradicts the understanding of seventeenth-century English politics, religion or\nnatural philosophy that we have been developing in class. You must clearly state that\nunderstanding before you describe your book's relation to it. Along the way, you should\naddress the following issues, not necessarily in this order:\n\n- If the information is available, where and when was the book published, and who\nwere the author and publisher?\n- If the information is available, what is the book's format - folio, quarto, octavo,\nduodecimo, etc.? Why do you think the publisher chose this format?\n- Does EEBO indicate that other editions of the book were published in the\nseventeenth century? If so, briefly browse these editions to determine if any\nchanges were made to the book. If changes were made, offer some suggestions as\nto why.\n- Who did the author and publisher have in mind as the intended reader of the\nbook?\n- Are there any annotations in the book that tell you something about how it was\nread?\n- In no more than a page or two, summarize the content of the book.\n- Does this book remind you of some of the themes from seventeenth-century\nbooks we have read together in class? If so, which ones, and how?\n\n2) Study a seventeenth-century English newspaper, or set of excerpts from the\nEnglish press of the period. You may choose to read and study one of the chapters in\nJoad Raymond, ed. Making the News: An Anthology of the Newsbooks of Revolutionary\nEngland, 1641-1660 (The Windrush Press: Gloucestershire, 1993). Or you may select\none of the periodicals of the period that is reproduced on the EEBO web site. For a list of\nthese periodicals, consult http://eebo.chadwyck.com/about/ped_list.htm. If you choose\nan EEBO periodical, there must be at least six issues of the periodical available via\nEEBO.\n\nOnce you have selected your periodical or periodical excerpts from the Raymond volume,\nread it and then write an essay in which you explain how this material adds to, modifies,\nor contradicts the understanding of English politics, religion or natural philosophy that\nwe have been developing in class. You must clearly state that understanding before you\ndescribe your book's relation to it. Along the way, you should address the following\nissues, not necessarily in this order:\n\n- Who did the publisher have in mind as the intended reader of the periodical?\n- In no more than a page or two, summarize the content of the periodical or the set\nof periodical excerpts.\n- Does this book remind you of some of the themes from seventeenth-century\nbooks we have read together in class? If so, which ones, and how?\n\nC. List of Relevant English Books, 1633-1666, in the MIT Rare Books Collection\n\n1) Author unknown, Mathematicall recreations, or, A collection of sundrie problemes\nextracted out of the ancient and moderne philosophers, as secrets in nature and\nexperiments in arithmeticke, geometrie, cosmographie, horologographie,\nastronomie, navigation, musicke, opticks, architecture, staticke, machanicks,\nchimestrie, waterworkes, fireworks, &c. : not vulgarly made manifest untill this\ntime, fit for schollers, students, and gentlemen that desire to know the\nphilosophicall cause of many admirable conclusions : usefull for others to acuate\nand stirre them up to the search of further knowledge, and serviceable to all for\nmany excellent things, both for pleasure and recreation / most of which were\nwritten first in Greeke and Latine, lately compiled in French, by Henry Van Etten,\nGent., and now delivered in the English tongue, with the examinations,\ncorrections and augmentations. (1633)\n\n2) Samuel Ward, The wonders of the load-stone, or, The load-stone newly reduc't\ninto a divine and morall use. 1640.\n\n3) John Wilkins, Mathematicall magick, or, The wonders that may be performed by\nmechanicall geometry : in two books, concerning mechanicall powers, motions :\nbeing one of the most easie, pleasant, usefull, and yet most neglected part of\nmathematicks : not before treated of in this language. 1648.\n\n4) Jean Baptiste van Helmont, Deliramenta catarrhi, or, The incongruities,\nimpossibilities, and absurdities couched under the vulgar opinion of defluxions /\nthe author, that great philosopher, by fire, Joh. Bapt. Van Helmont, &c. ; the\ntranslator and paraphrast Dr. Charleton, physician to the late king. 1650.\n\n5) Jean Baptiste van Helmont, A ternary of paradoxes : the magnetick cure of\nwounds : nativity of tartar in wine : image of God in man / written originally by\nJoh. Bapt. Van Helmont, and translated, illustrated, and ampliated by Walter\nCharleton, doctor in physick, and physician to the late King. 1650.\n\n6) Nicolas Hunt, New recreations, or, A rare and exquisite invention, for the\nexercising of acute wits, and industrious dispositions : replenished with mysteries,\nsecrets, and rarities, both arithmeticall and mathematicall : whereby any one of\nmean capacitie, may readily and infallibly finde out the Christian names of men and\nwomen, their titles of honour, ages, offices, trades or callings of life, places of birth,\nhouses of residence appertaining to scholars, either in the universities of Oxford or\nCambriage [sic], or the inns of court and chauncerie : with many other things both\npleasant and profitable, newly added / by Nich. Hunt, Mr of Arts. 1651.\n\n7) Johann Rudolf Glauber, A description of new philosophical furnaces, or, A new\nart of distilling : divided into five parts : whereunto is added a description of the\ntincture of gold, or the true aurum potabile : also, the first part of the mineral\nwork : set forth and published for the sakes of them that are studious of the truth /\nby John Rudolph Glauber ; set forth in English by J.F. D.M. 1651.\n\n8) Thomas Fuller, The Holy State. 1652.\n\n9) Meric Casaubon, A treatise concerning enthusiasme : as it is an effect of nature,\nbut is mistaken by many for either divine inspiration or diabolical possession / by\nMeric Casaubon, D. D. 1654.\n\n10) Inigo Jones, The most notable antiquity of Great Britain, vulgarly called Stone-\nHeng, on Salisbury plain restored / by Inigo Jones, Esquire ... 1655.\n\n11) Joseph Wilson, The vanity of humane inventions : held forth in a brief\nexercitation upon the controverted ceremonies, managed in certain queries : first\ndrawn up for the satisfaction of some private friends, and now made publick for\nthe good of others. 1666.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.141 Renaissance To Revolution: Europe, 1300-1800\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "21H.141S15 Renaissance To Revolution: Assignments - Paper 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-141-renaissance-to-revolution-europe-1300-1800-spring-2015/fb564b07215e1329632f99cae6f3e776_MIT21H_141S15_Paper1.pdf",
      "content": "21H.141\nSpring 2015\n\nFir s t S h o r t Paper : T o pic s\n\nRequirements\n\n1) Write an essay in response to ONE of the topics below. Your paper must be 1250 words\n(around five pages) long, using 12-point font and one inch margins. Please hand in hard copy to\nme at the start of class during Session 5.\n\n2) Your paper must be computer-processed. Please give your paper a title, and write your name on\nthe back of the last page. Do not write your name elsewhere on the paper. All pages should be\nnumbered. Refer to the editing handout for further editing suggestions. You may also consult with\ntutors at the Writing Center or with me about your paper.\n\n3) Citations to texts read in this course should be made in parentheses in your paper. For example,\nif you refer to a passage on page 13 of Erasmus' Paraclesis, indicate this in the following manner at\nthe end of your sentence, after the period: (Paraclesis, 13). Full citations to any work not assigned in\nclass should be made in footnote or endnote form, but for this paper you do not need to consult any\noutside readings.\n\nTopics\n\n1. The 1302 Papal Bull Unam Sanctum is an uncompromising statement of Papal authority in\nspiritual and temporal affairs. As we learned in class, the King of France at the time did not\nagree with the Pope's claims. In your essay, discuss the extent to which some of the authors\nwe have read in class so far implicitly endorse or dispute this claim of Papal power. You\nmust discuss at least two of the following text excerpts we have read for class: Nicole\nOresme, \"The Diurnal Rotation of the Earth;\" Petrarch, \"The Ascent of Mount Ventoux;\"\nLorenzo Valla \"Discourse on the Forgery of the Alleged Donation of Constantine;\"\nNicholas Copernicus, \"The Revolutions of the Celestial Spheres.\"\n\n2. Petrarch lived approximately a century before the appearance of movable-type printed books\nin Europe, yet he is usually considered the first major Renaissance humanist. At the critical\nmoment in his essay \"The Ascent of Mount Ventoux\" when he opens his copy of Saint\nAugustine, Petrarch portrays himself as a reader. What type of reader is he? Is he closer to\nthe medieval reader evoked by the historian Michael Clanchy in his essay on books before\nthe printing press? Or is he more like the humanist reader described by the historian Anthony\nGrafton in the essay you read?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.141 Renaissance To Revolution: Europe, 1300-1800\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "21H.141S15 Renaissance To Revolution: Assignments - Paper 1 Revision",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-141-renaissance-to-revolution-europe-1300-1800-spring-2015/532da2a5d1a21e2ba963bd78e9183ce6_MIT21H_141S15_Paper1Rev.pdf",
      "content": "21H.141\nSpring 2015\n\nFir s t S h o r t Paper : R e v i s i o n\n\nRequirements\n\n1) Revise your first essay following the prompts below. If you wrote on the Unam Sanctum\ntopic, you must respond to the first prompt. If you wrote about Petrarch as a reader, you must\nrespond to the second prompt. Your paper must be 1250 words (around five pages) long, using\n12-point font and one inch margins. Please hand in hard copy to me at the start of class during\nSession 9. At that time, please also turn in the hard copy of your first paper with my remarks.\n\n2) Your paper must be computer-processed. Please give your paper a title, and write your name on\nthe back of the last page. Do not write your name elsewhere on the paper. All pages should be\nnumbered. Refer to the Editing Suggestions document in the Assignments section or to Strunk and\nWhite, The Elements of Style, for further editing suggestions. You may also consult with tutors at the\nWriting Center or with me about your paper.\n\n3) Citations to texts read in this course should be made in parentheses in your paper. For example,\nif you refer to a passage on page 13 of Erasmus' Paraclesis, indicate this in the following manner at\nthe end of your sentence, after the period: (Paraclesis, 13). Full citations to any work not assigned\nin class should be made in footnote or endnote form, but for this paper you do not need to consult\nany outside readings.\n\nTopics\n\n1. In your first paper, you considered the extent to which at least two authors we have read in\nclass endorse or dispute papal claims of spiritual and temporal authority as they are stated\nthe 1302 Papal Bull Unam Sanctum. In your revision, focus exclusively on authors who\nclearly challenged papal supremacy in spiritual or temporal affairs. You must consider at\nleast one of the following two excerpts: Lorenzo Valla Discourse on the Forgery of the\nAlleged Donation of Constantine; Nicholas Copernicus, The Revolutions of the Celestial\nSpheres. You must also consider the excerpt from Martin Luther's response to Erasmus in\ntheir debate over the freedom of the will (the reading for Session 8). How are their\nchallenges to the papacy similar? In what ways, if any, do they differ?\n\n2. In your first paper, you considered whether the Petrarch of The Ascent of Mount Ventoux\nwas more of a medieval or a humanist reader, as historians Michael Clanchy and Anthony\nGrafton defined those categories. In your revision, consider the continuities and\ndiscontinuities between the way Petrarch read his Augustine at the summit of Mount\nVentoux and Erasmus, in The Paraclesis, wanted Christians to read the Bible. You may\nbring in Clanchy or Grafton's categorizations of readers if you wish.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.141 Renaissance To Revolution: Europe, 1300-1800\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "21H.141S15 Renaissance To Revolution: Assignments - Paper 2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-141-renaissance-to-revolution-europe-1300-1800-spring-2015/62764a3d45f1b54dfd0d1030ffd781dd_MIT21H_141S15_Paper2.pdf",
      "content": "21H.141\nSpring 2015\n\nSec o nd Short Paper : T o pic s\n\nRequirements\n\n1) Write an essay in response to ONE of the topics below. Your paper must be 1250 words\n(around five pages) long, using 12-point font and one inch margins. Please submit your essay\nby Session 24.\n\n2) Your paper must be computer-processed. Please give your paper a title, and write your name on\nthe back of the last page. Do not write your name elsewhere on the paper. All pages should be\nnumbered. Refer to the editing handout, posted on the stellar web site, for further editing\nsuggestions. You may also consult with tutors at the Writing Center or with me about your paper.\n\n3) Citations to texts read in this course should be made in parentheses in your paper. For example,\nif you refer to a passage on page 13 of Erasmus' Paraclesis, indicate this in the following manner at\nthe end of your sentence, after the period: (Paraclesis, 13). Full citations to any work not assigned in\nclass should be made in footnote or endnote form, but for this paper you do not need to consult any\noutside readings.\n\nTopics\n\n1) Read the Encyclopedie article \"Sunday\" by Joachim Faiguet de Villeneuve. Discuss in\ndetail his proposal to reform the way the French spend their Sundays. None of the earlier\nauthors we have read this semester would have made this argument. What has changed by the\nmiddle of the eighteenth century that makes it possible for Faiguet to commit this proposal to\nprint?\n\n2) Read Ken Alder's article on the history of the meter during the French Revolution, then compare\nthe adoption of the meter in France in the 1790s to the spread of movable-type printing in Europe\nbeginning ca. 1450. Does the standardization of texts and measurements contribute to the progress\nof human history? Or are they the means by which religious movements and political regimes are\nincreasingly able to control the thought and labor of individuals?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.141 Renaissance To Revolution: Europe, 1300-1800\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "21H.141S15 Renaissance To Revolution: Assignments - Student Example 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-141-renaissance-to-revolution-europe-1300-1800-spring-2015/b9199b3ab4b074626eb8ef4e36d46384_MIT21H_141S15_MathRecreats.pdf",
      "content": "Jean Leurechon's Mathematical Recreations in the Context of Early 17th Century Europe\nEuropean thinkers in the 17th century revolutionized humanity's understanding of nature.\nDiffering from the humanists who focused largely on works from long ago, the new wave of\nscientists looked ahead to great inventions based on discoveries about the world. Breaking away\nfrom the philosophy of Aristotle, thinkers such as Francis Bacon and Rene Descartes introduced\nideas that led to the modern scientific method and spurred the later scientific revolution.\nAstronomers such as Galileo Galilei and Johannes Kepler put these ideas into practice,\nfundamentally altering humanity's understanding of the cosmos. In the midst of this scientific\nrevolution was a humble book, Mathematical Recreations, originally published in French as\nRecreations Mathematiques in 1624. The book was written by Jean Leurechon under the\npseudonym Hendrik Van Etten and first appeared in English print in 1633, translated by William\nOughtred .\n1 It was printed in octavo form, with pages in sets of 16, and measured 4 inches wide\nand 6.5 inches tall. The book itself consisted of over 100 \"problems,\" demonstrations of\nscientifically based tricks or facts. Importantly, Leurechon wrote Mathematical Recreations for a\nbroad audience, likely hoping to expose people across Europe to scientific wonders. Analysis of\nits contents illuminates not only the early state of scientific understanding, but also the political\nand religious conditions of the world it helped influence.\nFor centuries, studying the natural world had been considered a fringe interest, only\nsuitable for isolated scholars. The early 17th century, however, saw the beginnings of change\nfrom this view. The English philosopher and scientist Francis Bacon was at the fore in\npopularizing learning. In his famous The Advancement of Learning, published in 1605, Bacon\n1 chaaf, William. \"Number Game.\" Encyclopedia Britannica Online. Encyclopedia Britannica. Web. 18 Apr. 2015.\n\ndefended learning for its own sake, especially study of the natural world .\n2 He considered five\ncommon worries: that learning is close to original sin, that learning leads to worry and\nunhappiness, that learning leads to atheism, that learning leads to an unwillingness to fight, and\nthat learning makes people unfit for governing. Calmly but confidently, he responded to each in\nturn. The original sin was the desire to abandon God, not the thirst for knowledge. Applications\nof knowledge would lead to improvements in life, not unhappiness. While a small amount of\nlearning might tempt a man away from God, a thorough education would bring him back to\nreligion. If learning were so bad for fighting, how could Caesar and Alexander the Great have\nbeen educated but also great generals? Finally, Bacon argued that learning is essential for\ngoverning for the same reason that a doctor must understand the human body in order to be\neffective. By clearly articulating and responding to a host of concerns against learning, Bacon\nmade learning feel more acceptable to Europeans.\nThe early 17th century also saw a move away from the ideas of Aristotle. Refined into\nscholasticism, Aristotle's philosophical methods had dominated Europe for centuries .\n3 acon\ndisliked the abstractness of scholasticism and argued instead for greater reliance on data and\nevidence. He asserted that this empiricism would allow for refutation of incorrect theories, so\nthat nature could be studied inductively. Bacon also believed that scientific advances could lead\nto improvements for mankind, an idea that led to the later founding of the London Royal Society\nin 1660. Though he never made any significant scientific discoveries himself, Bacon's advocacy\nof empiricism and applicability was instrumental in the development of modern science .\n2 Francis Bacon, The Advancement of Learning, ed. W. A. Wright (Oxford: Clarendon Press, 1880)\n3 Pieper, Josef. \"Scholasticism.\" Encyclopedia Britannica Online. Encyclopedia Britannica. Web. 20 Apr. 2015.\n4 \"Francis Bacon.\" Bio. A&E Television Networks, 2015. Web. 16 Apr. 2015.\n\nThe Frenchman Rene Descartes also contributed to the shift away from Aristotelianism.\nIn his 1605 work Discourse on Method, he cautioned against accepting as true what one did not\nknow for certain. Descartes also criticized existing philosophy, complaining that philosophers\ndebated endlessly but agreed on nothing. He therefore argued that philosophical results could not\nbe trusted, and he proposed a system of slow, careful reasoning in order to find statements he\nknew to be true. Since these results would be established for certain, they could be used to\ndiscover new truths without worry or hesitation . The ideas of men like Bacon and Descartes\ninitiated the development of modern science, the first steps of the European scientific revolution\nthat would see advances in mechanics, mathematics, optics, chemistry, and more throughout the\n17th century.\nMathematical Recreations, published after Bacon's The Advancement of Learning but\nbefore Descartes' Discourse on Method, likely played a similar but smaller role in the advance of\nscience. The book contains a vast assortment of facts, tricks, and techniques, all based in math\nand science. These \"problems,\" as Leurechon called them, spanned a wide range of topics such\nas mathematics, physics, astronomy, and even fireworks. Unlike Bacon and Descartes,\nLeurechon did not propose new systems of reasoning. Rather, he helped expose Europeans to\nscientific applications and tricks, likely increasing general scientific awareness among the\neducated.\nDiffering from the writings of Bacon and Descartes, Mathematical Recreations was\nintended to appeal to anybody with an interest in science. Leurechon himself described the book\nas \"Fit for scholars, students, and gentlemen that desire to know the philosophical cause of many\n5 Descartes, Rene. Discourse on Method and Meditations on First Philosophy, 4th ed. Indianapolis: Hackett, 1998. 5.\nPrint.\n\nadmirable conclusions\" (Leurechon, Mathematical Reflections, cover). The\ncover appealed to a wide audience, depicting the range of topics touched on\nin the book and calling them \"useful and recreative.\" Also to appeal to a\nlayperson, Leurechon made a point of omitting detailed, technical\nexplanations for the problems, stating in the introductory \"By way of\nadvertisement\" section, \"Those which understand the mathematics can\nconceive them easily;; others for the most part will content themselves only\nwith the knowledge of them\" (Leurechon, Mathematical Reflections, \"By\nway of advertisement\"). Probably attempting to improve the casual reader's experience,\nLeurechon switched rapidly between topics. Later editions of the book also included a table of\ncontents, perhaps because the constant topic-changing made finding specific problems difficult\notherwise. The reader certainly had the option of delving deeper into the science behind the\ndemonstration, but Leurechon's goal seems to have been to impress rather than to instruct. This\nappeal to a wide audience led to a commercial success: Mathematical Recreations went through\nover 30 editions by the end of the century .\nHandwriting inside the copy of Mathematical Recreations found at the MIT library offers\nanother glimpse into its appeal. We can tell that the owner, Thomas Soewitt, highly valued his\ncopy of the book because an early page prominently displays his name. Arithmetic calculations\nscribbled on another page show he tried to work through some problems for himself. Despite\nprobably being a scientific layman, he took a keen interest in the material. It seems that Thomas\nSoewitt found reading Mathematical Recreations engaging and thoughtful as well as enjoyable.\n6 Schaaf. \"Number Game.\" Britannica.\nThis image is in the\n\npublic domain.\n\nThe book's introduction also illuminates the divide at the time between science and\nhumanism. Humanism was an intellectual movement from the 1400's that emphasized\nwidespread education and especially focused on ancient texts. The humanist ideas still held\nstrong influence in Europe in the early 17th century, and many prominent scientists were\nhumanists as well. The famous astronomer Johannes Kepler, also dabbled in poetry and history,\nsubjects championed by the humanists . Despite this, humanists and scientists took\nfundamentally different approaches in their studies. Humanists studied the past, striving to\nimprove society and restore the glory of the ancient world. Scientists, by contrast, sought to\ninvent and discover machines and ideas that were fundamentally new.\nRather than take a moderate stance, Leurechon made it clear that he prefered science to\nhumanism. In his \"Epistle to the Reader\" he described Mathematical Recreations as \"an\ninvitation and motive to the search of greater matters, and to employ the mind in useful\nknowledge, rather than to be bullied in vain pamphlets, play-books, fruitless legends, and\nprodigious histories that are invented out of fancy, which abuse many noble spirits, dull their\n7 Anthony Grafton. Defenders of the Text. Cambridge: Harvard University Press.\nThis image is in the public domain.\nThis image is in the public domain.\n\nwits, and alienate their thoughts from laudable and honourable studies.\" (Leurechon,\nMathematical Reflections, \"Epistle to the Reader\") Leurechon scathingly dismissed a great deal\nof humanist study as a waste of time and brainpower, asserting the superiority of \"useful\"\nscientific study. His disdain for these long-entrenched ideas is similar to that of Descartes, who\nin his Discourse expressed disenchantment with many existing fields of study.\nIn the book, the problems themselves span a variety of topics. Many problems consist of\npractical, useful tricks based in science. Problem 48 explains how to measure the weight of an\nunfamiliar object using a small set of known weights (Leurechon, Mathematical Reflections, 71).\nThe method uses the base-3 number system and would likely have been useful to merchants.\nProblem 50 consists of a trick for lifting bottles: one needs simply to bend a straw, insert it into\nthe bottle, and pull up (Leurechon, Mathematical Reflections, 74). The potentially very useful\nproblem 124 showcases a trick to improve candle lifetimes. The idea is to float lit candles on\nwater. The water absorbs the fire's heat, slowing the wax's melting (Leurechon, Mathematical\nReflections, 259). Demonstrations like these would have been especially impressive to a\nlayperson, and helped make science more relevant to the public.\nOther problems were likely meant as mere curiosities without much significance at all.\nProblem 1 is a collection of arithmetic tricks. The first such trick, for example, can be rephrased\nin modern mathematical language as the identity 4x+2y - y = 2 x (Leurechon, Mathematical\nReflections, 21). Problem 122 simply asserts that a heated anvil can be destroyed with a gunshot\n(Leurechon, Mathematical Reflections, 259). Problem 97 points out the fact that on the surface of\na sphere, triangles can have 3 right angles, even though this is impossible on a flat surface\n(Leurechon, Mathematical Reflections, 234). This last problem, interestingly, is actually highly\n\nsignificant from today's perspective: the development of non-Euclidean geometry in the 19th\ncentury made such examples of lines on curved surfaces fundamentally important .\nSeveral of Leurechon's problems, seen today, illuminate the fledgling state of scientific\nknowledge at the time. For example, in problem 13, Leurechon explains that to find the mass of\nthe smoke given off in a fire, all one must do is measure the lost mass in wood;; the mass of the\nsmoke produced must equal the mass of the wood consumed (Leurechon, Mathematical\nReflections, 27). Despite the appealing logic, this reasoning is invalid because of the oxygen in\nthe air, which contributes to the reaction of the burning and must be accounted for in any sort of\ncalculation. Though it seems incredible today, scientists at the time had no concept of oxygen;;\nuntil over a century later, scientists believed that combustible material contained a special\nelement, phlogiston, that allowed for burning . Problem 130 appears today as silly as alchemy or\nwitch-craft. Explaining a method to harden metal, it begins, \"Quench your blade or other\ninstrument seven times in the blood of a male hog mixed with goose-grease\" (Leurechon,\nMathematical Reflections, 263). Such a procedure seems ridiculous given modern knowledge,\nbut would have been seen as scientific in Leurechon's day.\nThe politics and religion of the time also affected Leurechon's book, in particular his\nwriting on astronomy. For centuries before, the accepted and Church-supported position had\nbeen that the universe was centered at the Earth, with the Sun and planets orbiting it in perfect\nspheres. As early as 1543, Copernicus challenged this idea with a heliocentric model, arguing\nthat the Earth revolved around the Sun, which was itself stationary10. Though little attention was\n8 Henderson, David. \"Non-Euclidean Geometry.\" Encyclopedia Britannica Online. Encyclopedia Britannica. Web. 18\nApr. 2015.\n9 \"Phlogiston.\" Encyclopedia Britannica Online. Encyclopedia Britannica. Web. 18 Apr. 2015.\n10 Ross, James, and Mary McLaughlin. \"The Revolutions of the Celestial Spheres.\" The Portable Renaissance Reader.\nNew York: Viking. 583-593. Print.\n\ngiven to Copernicus at first, further developments began to appear by the end of the 1500's. The\nDanish astronomer Tycho Brahe proposed an intermediate model called a geo-heliocentric\nsystem;; in his theory, the Moon and the Sun orbited Earth while the other planets orbited the Sun\n11. The Italian Galileo Galilei used a powerful telescope to observe Venus and the moons of\nJupiter. His findings, published in the 1610 Starry Messenger, were inconsistent with\ngeocentrism and lent support to Copernicus's heliocentric model12. Brahe's student Johannes\nKepler further challenged the Church's position with his explanation of the strange, sometimes\nbackwards motion of Mars in the sky. He suggested, correctly, that this unusual orbit could be\nexplained by a heliocentric model in which planetary orbits were elliptical rather than perfectly\ncircular 13 .\nThe Church responded severely to these dissenting astronomical views. In 1616, a\ncommittee brought together by the Church declared that heliocentrism was \"foolish and absurd\nin philosophy, and formally heretical since it explicitly contradicts in many places the sense of\nHoly Scripture.\" The Church also personally warned Galileo to stop defending heliocentrism.\nGalileo did not stop, and in fact published Dialogue concerning the two chief world systems\nwhich subtly mocked both geocentrism and the Pope himself. Infuriated, the Church brought\nGalileo before the Inquisition and threatened him with torture. Forced to recant, Galileo lived\nunder house arrest until his death14. Heliocentrism, though scientifically promising, had become\nperilous to support.\n11 Hatch, Robert. \"Early Geo-Heliocentric Models.\" The Scientific Revolution Webpage. Web. 19 Apr. 2015.\n12 Wudka, Jose. \"Galileo and the Inquisition.\" Web. 17 Apr. 2015.\n13 \"Johannes Kepler: The Laws of Planetary Motion.\" Web. 20 Apr. 2015.\n14 Wudka. \"Galileo\"\n\nLeurechon touches on astronomy in problem 88. The problem, broken into 8 parts,\nattempts to convey the enormity of several astronomical distances and speeds. In the second part,\nhe asserts that \"if a bird should fly round about it [Earth] in two days, then must the motion be\n450 miles in an hour\" (Leurechon, Mathematical Reflections, 221). By expressing such a vast\ndistance as the Earth's circumference in terms of more familiar quantities, Leurechon hopes to\nimpress the reader with the vast scale of the world. In other parts of the same problem, he\nexplains the huge distances to the Sun and the Moon in similar terms.\nIn part 7 of problem 88, Leurechon describes the speed of the Sun, giving us an indirect\nglimpse of the Church's influence on astronomy. He writes that \"[The Sun] moves more than\nseven thousand five hundred and seventy miles in one minute of time\" (Leurechon,\nMathematical Reflections, 221). By taking the Sun's motion for granted, Leurechon is siding\nwith the Church's geocentrism. Later Leurechon dismisses Copernicus's heliocentric theory as\nwell-intentioned but misguided, \"This made Copernicus, not unadvisedly, to attribute this\nmotion...to the earth...for it is beyond human sense to apprehend or conceive the rapture and\nviolence of that motion being quicker than thought\" (Leurechon, Mathematical Reflections, 222).\nBeing well-versed in science, he would have been aware of the substantial evidence for a\nheliocentric model, but likely took the geocentric position to avoid the Church's ire. The contrast\nwith Leurechon's dismissal of history and other subjects in the introduction further underlines\nthe strength the Church's influence must have had;; Leurechon has demonstrated that he is not\nafraid to anger historians, but he still feebly submits to the Church's threats. We can imagine that\nthe Church's censorship had similar effects on a great deal of other scientific writing at the time.\n\nDespite these quirks, Leurechon's exposition is generally solid, revealing a broad\nunderstanding of scientific and mathematical principles. In part 19 of problem 85, Leurechon\ndemonstrates an elegant trick to determine which of two fluids is denser, essentially using\nArchimedes' buoyancy principle (Leurechon, Mathematical Reflections, 206). The idea is to\nfloat a piece of wax in the first liquid, and then slowly add lead to the wax until the solid just\nbarely floats. The resulting solid now has the same density as the first liquid, so by submerging it\nin the second liquid, one can compare the densities. More theoretical, problem 63 describes the\nancient yet still fascinating notion of perfect numbers. Perfect numbers are equal to the sum of\ntheir factors: 6 is perfect as 6 = 1 + 2 + 3 , while 10 is not because 10 = 1 + 2 + 5 (Leurechon,\nMathematical Reflections, 92). In these problems and many more, Leurechon's presentation is\ncompletely correct and would have excited many a curious reader.\nLeurechon's Mathematical Recreations was only a small part of the scientific revolution\nthat swept through Europe in the 1600's. The book was published at the dawn of a plethora of\nexciting and new ideas and exposed many people across Europe to its scientific wonders. A\nproduct of its time, Mathematical Recreations also gives us a glimpse into the scientific and\npolitical state of Europe in the early 17th century.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.141 Renaissance To Revolution: Europe, 1300-1800\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "21H.141S15 Renaissance To Revolution: Assignments - Student Example 2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-141-renaissance-to-revolution-europe-1300-1800-spring-2015/a5856154246fa8045189003183234581_MIT21H_141S15_Ecstasies.pdf",
      "content": "21H.141 Long Paper\nNatural Enthusiastick Ecstasies and Revelations\nCasaubon's Humanistic Attack on the 'Revelations' of the Sectaries\nIn 1640, King Charles I of England convened a new parliament to try and pass a budget for his\nwars with religious rebels in Scotland. This \"Long Parliament,\" which sat from 1640 to 1658, quickly\nshowed their independence from royal control, eventually sparking off the English Civil Wars and the\ndecade long Interregnum. In 1641, they abolished the Star Chamber, a judicial body which, among other\nduties, enforced the royal control of the press. This breakdown of literary censorship immediately\nsparked a rash of new written materials, many of which expressed religious beliefs which ranged from\nthe mildly controversial to the outright heretical. Several of the more radical publications included the\nclaim that their authors, often leaders of relatively large groups of radicals, had received a direct\nmessage from God which showed them the right way. The Parliamentarians cracked down upon these\ngroups upon seizing control of England, and reinstituted censorship in 1643 with the Licensing Order,\nwhich reestablished the majority of the controls of the Star Chamber in a new format. Nonetheless,\nthose three years of uncensored publishing made a great impact upon the religious and intellectual\nlandscape of Parliamentary England, and even after the reinstitution of censorship radical publications\ncontinued to be published at a greater pace than before 1640. Meric Casaubon, a classical scholar and\npriest, wrote a Treatise Concerning Enthusiasme in 1654 which denied the possibility that these radicals\nhad congress with the Holy Spirit, while nonetheless holding out the basic possibility of such\ncommunication. Casaubon's Treatise Concerning Enthusiasme looked back to a fundamentally\nHumanistic tradition of scholarship in addressing the contemporary problem of radical sectarian groups.\nIn the Treatise Concerning Enthusiasme Casaubon investigated the phenomenon where a person\nfeels himself possessed or communicated to by supernatural forces. Casaubon separated 'enthusiasm'\n\ninto two distinct categories: the natural and the supernatural. Natural enthusiasm he defined as \"an\nextraordinary, transcendent, but natural fervency, or pregnancy of the soul, spirits or brain, producing\nstrange effects apt to be mistaken for the supernatural\" (Casaubon, 17). Casaubon believed that most of\nthose who claimed to be possessed or to have received guidance from God were fakers or misguided.\nHe did not, however, \"dispute...whether the most illiterate among Christians, whether men or women,\nmay not attain sometimes by God's special power, and real holinesse and sanctity, to the highest\nmysteries of Christian religion\" (Casaubon, 118). Casaubon did not focus on this possibility, but rather\ninvestigated cases of supposed religious revelation that he believed to have other explanations.\nCasaubon separated the natural enthusiasms into eight categories, but he focused the bulk of his book\non what he termed philosophical or contemplative enthusiasm -\"all kind of Enthusiasme having and\ndependence from the intention or contemplation of the mind\" (Casaubon, 60). The 'revelations'\nproclaimed by Sectarians like Reeve and Muggleton fell into this category, as they arose from\ncontemplation of the nature of God. Casaubon described many examples of those who claimed to have\nreceived communication with angels or God, and explained why each most likely exhibited either fakery\nor a 'distemper' or 'melancholick disposition.'\nThe 1650s were a time of reestablishing the authority that had been stripped from the Anglican\nChurch and reinstituting the mechanisms of censorship and public order. After the Act of Habeus Corpus\nin 1641 and the abolishment of the Star Chamber, underlying religious dissent and discussion quickly\nsprouted up into published materials. During the tumultuous decade of the Civil War, groups like the\nLevellers, Ranters, Muggletonians and Diggers proliferated across England. The Levellers had a large\npresence in the New Model Army, which greatly concerned members of the landed classes, as well as\nthe clergy, who feared a rebellion and anarchy. When after the execution of King Charles in 1648 Oliver\nCromwell's instated himself as Lord Protector and purged the Levellers from the Army, many hoped that\nstability had returned to the British Isles. Although censorship controls were not as effective as they had\n\nbeen before the Civil War, they were nonetheless reinstated, and with a government firmly in place\nnatural philosophers turned to justifying the existing order against radical groups such as the Levellers.\nFundamentally, there were three major divisions of thought in England after the Civil Wars,\ncrossing across politics, religion and natural philosophy. The first strand was the radicals, ranging from\nradical Puritans to the Levellers who campaigned for a communitarian state. These groups were\nfragmented, without any central authority or argument, but generally desired an overthrow of the\nestablished order and significant changes to be made in England. In some ways, they can be compared\nto the Magesterial Reformers in Germany in the 1500s, although unlike in Germany, the\nParliamentarians didn't turn on radical groups like the Levellers until after the war was won. Opposing\nthese radical groups, the second main division supported a central Church, with the authority to\nestablish at least a semblance of unity over religious matters as well as influence in secular matters.\nThose supporting the central church ranged from the mainstream Puritans, who, though separate from\nthe main body of Anglican power structures, still interacted significantly with them, to the Anglicans\nthemselves. They were supported by natural philosophers such as Boyle and others. Finally, the third\nstrand, essentially different than either of the other two, wanted a strong central power of the sort\nrepresented equally by Cromwell or a King, and either ignored or actively denigrated the idea of the\nChurch having power in secular matters. This segment was epitomized by Thomas Hobbes, who actively\ndespised the Anglican Church as having a negative effect on the stability of the Kingdom. Thomas\nHobbes, a natural philosopher and political theorist, wrote The Leviathan, making a case for a strict and\nmonolithic government to overcome the natural tendency of human life to be \"nasty, brutish and\nshort.\" He saw no role for the Church, whether Anglican or Roman Catholic, in this ordeal, and was thus\nopposed by other philosophers, such as David Boyle, who wanted to oppose the Levellers but still\nensure a place for God and the Church in affairs of the State.\n\nFollowing the English Civil Wars, the concept of enthusiasm became associated with fanaticism\nand radical groups such as Anabaptists and Ranters, some of whom claimed to have received direct\nguidance from God. In 1653, John Reeve \"declare[d] from the Holy Spirit of the Lord Jesus, that my God\nthe man Jesus from his Throne of glory, spake to me John Reeve, his third and last Witness\", and\ncondemned those who did not follow him or his cousin Muggleton as wicked and ignorant. Casaubon\nand other scholars classified such claims as 'enthusiasm,' a term which kept its negative connotation\nunto the 1740s when David Hume wrote that for the enthusiastic man,\nhuman reason, and even morality are rejected as fallacious guides: and the fanatic\nmadman delivers himself over, blindly and without reserve, to the supposed illapses of\nthe spirit, and to inspiration from above. Hope, pride, presumption, a warm\nimagination, together with ignorance, are, therefore, the true sources of ENTHUSIASM\"\n(Hume, Essay X1).\nThus, Casaubon's interpretation of enthusiasm as a naturally occurring human frailty targeted groups\nsuch as the Muggletonians by helping to discredit the foundational understanding of their message\ndirect from God. He believed that \"it is no lesse than absolute renunciation of the Gospel and Faith of\nChrist... after the Gospel and faith of Christ once delivered to pretend to new lights and to seek after\nRevelation in matters of Faith and Doctrinne\" (Casaubon, 87). Thus, his writing fit into the second strand\nof political and religious thought of the time, as his partisanship for the Anglican Church shows, despite\nParliament stripping him of his benefice at Canterbury Cathedral. He strongly opposed radical groups\nsuch as the Ranters, Levellers and Diggers. He is careful, however, not to imply any support for the views\nrepresented by Hobbes, as he continuously affirms his belief that miracles and actual supernatural\nenthusiasms can happen.\n\n1 Hume, David. \"Essay X: Of Superstition and Enthusiasm.\" Essays Moral, Political and Literary. 1754.\n\nCasaubon's intended audience was clearly not the common people who were likely to be\nswayed by publications like the Ranter's Declaration. Nor was his Treatise directed at low clergy and lay\nministers as were Reeve's Epistle, directed \"unto all Prophets, Ministers, or Speakers in the world\"\n(Reeve, 1), or the less radical and controversial position papers of Anthony Wotton. The Treatise\nConcerning Enthusiasme is clearly directed at a rather more learned class of individuals, people who\nwould not blink an eye at references to Hippocrates, Plato and Socrates, and who would find good\njustification for a position from such Ancient authors. When Parliament removed him from his benefice\nat Canterbury Cathedral in 1643 for not acknowledging Parliament's authority, Casaubon retired to the\ncountryside near Oxford, and in that retirement read many books. In his preface, Casaubon stated that\nhe wrote his Treatise in response to Sister Katharine of Jesus; Nunne of the Order of Our Lady, a book\nprinted in Paris in 1628 about the \"raptures and enthusiasms, that had happned unto a melancholick, or\nif you will, a devout Maid\" (Casaubon, Preface p. 10). Casaubon did not find the stories contained within\nthat volume interesting or worth particular notice, but he did find with some dismay \"besides a long\ndedication to the Queen of France, made by a Cardinal,... the Approbations of one Bishop, one\nArchbishop, besides Sorbonists and Doctors of Divinity, no lesse than four\" (Casaubon, Preface p. 9).\nCasaubon is troubled not by the contents of the book, nor by the thought that the common man on the\nstreet could read it and find it interesting, but that bishops, archbishops and people who study theology\ncould read it and be convinced by the contents therein. \"For ignorant people to be bold and confident,\nand in their confidence to deceive themselves and others,\" he states,\nis no wonder at all, a man had need but open his eyes, to see such sights at every door.\nThat which I (not without some indignation sometimes) have wondered at, is that even\nlearned men, yea men of great fame and credit in the world for their parts and\nperformances in other kinds, have in this particular of Ecstasies and Raptures, been so\napt in all ages to be gulled\" (Casaubon, 78).\n\nHe aims to convince members of the literate and learned class, particularly those learned in\ntheology, that the \"enthusiasms' of the type experienced by Sister Katharine were in fact natural\noccurrences, not legitimate Divine works. This goal was not merely theoretical or academic in\nnature. Rather, it had a very specific and practical reason - to try and prevent such high clergy or\neducated laymen from believing the claims of Reeves or his ilk. The Anglican Church could easily\nstand against small groups of Ranters and Levellers, even if their followers genuinely believed\nthat their leaders were inspired by the Holy Spirit and that God had directly spoken to them. If a\nbishop or archbishop on the other hand, were to become convinced by Reeves that the\nMuggletonians were correct, than it could throw that part of England into chaos. He finds\nnothing \"so strange [as] what Germany hath seen, and other Countrey may, where\nAnabaptisticall Enthusiasts are tolerated, and from toleration come in time to prevail and rule\"\n(Casaubon, 101). Small wonder, then, that Casaubon was so appalled by the credulity of the\nFrench clergy who lauded Sister Katharine of the Order of Jesus so heavily. If they believe the\nrevelations of a nun in Paris, what might their equivalents in England make of a minister like\nReeve in London?\nCasaubon showed some departure from the prevalent views of his time in his willingness to\naccept that false prophets were deceived rather than deceivers. There was no shortage of responses to\nthe 'enthusiastick' groups of the 1640s. Publications such as the Ranters Declaration of 1650 and Plain\nEnglish, or the Sectaries Anatomized from 1646, attacked the Sectarian groups of England, by claiming\ntheir leaders to be evil men who deceived their followers, led them astray and did the work of Satan.\nUnlike these texts, the Treatise Concerning Enthusiasme expressed the possibility that the preachers and\nso-called prophets of various groups might be inherently good and Christian men who were led astray\nby their own enthusiasm. In what was surely a breach with common belief at the time, Casaubon even\nmade the claim that where the common assumption was \"that Mahomet [sic] did assume to himself\n\ndivine authority by feigned Enthusiasm...but whether feigned, I make some question\" (Casaubon, 11).\nFor a writer of his time period, this belief is rather surprisingly tolerant. In this period, Islam was very\nmuch the mortal threat to Christendom. Even as he wrote, English ships were fighting with Dutch ships\nand Venetian galleys in the Mediterranean to keep the Ottoman Empire from seizing Crete. Not twenty\nyears later, Ottoman armies marched as far as Vienna itself, marking the high tide of Ottoman\nconquests. The idea that Mohammed, the founder of Islam, could be viewed in a favorable light at all,\neven if only that he was duped rather than deceiver, is surprising. Of course, Casaubon does not \"make\nany question, but that the Devil was a chief actor in the progresse of [Islam]\" (Casaubon, 131), no matter\nwhether Mohammed was a willing accomplice or unwilling dupe of the Devil.\nUnlike Hobbes, Boyle and their fellows, Casaubon was certainly not a Natural Philosopher. By\ninclination and training, he was a classical scholar, rooted in a deeply Humanistic mindset, not a\nscientific one. Accordingly, his Treatise Concerning Enthusiasme is a text fundamentally Humanistic in\nnature. Casaubon relied heavily on Ancient authors to make his points, quoting liberally from Plato,\nSocrates and Aristotle, as well as other Greek philosophers, Romans and even a few writers from the\nEast. This should not surprise us, for Casaubon was a classical scholar at Oxford when he wrote his\nTreatise, yet it nonetheless points to a fundamentally older style of scholarship than was developing\nelsewhere in England. Where one of his contemporaries, Descartes, had broken out of the Humanistic\nmold and attempted to develop and describe a philosophy from first principles, Casaubon attempts to\nform a consensus view from accepted wisdom of the past. This creates an interesting divergence from\nthe natural philosophers and theorists such as Bacon, Boyle, Newton and even Hobbes. Of course, his\ncontemporaries still based their scholarship on ancient writings, such as the Atomists for Boyle and the\nStoics for Newton, but they both made distinct intellectual departures from their ancient predecessors.\nOn the other hand, Casaubon refused to make any deviation from the views of an older authority\nwithout further backing from another. He tells the reader \"that wherein I differ from Baronius ... I do it\n\nnot altogether in mine own judgement (though chiefly grounded upon S. Jerom and S. Augustine) but\nhave also the same Franc. Junius his authority to oppose against Baronius, and some others\" (Casaubon,\n69).\nThe Treatise Concerning Enthusiasme was originally published in 1654, and there is a copy of it\nin the MIT library. However, there is a high quality electronic copy of the 1655 edition, from which the\nquotes used in this paper were drawn, due to the increased ease in reading and searching. The 1655\nedition was printed in London, and consists of 228 pages. The citations and short passages inserted into\nthe margins by making gaps in the text reveal in some ways how the text was meant to be read. In due\nreverence to the Humansitic tradition, Casaubon expected his readers to know the names of the Ancient\nathors he cited. However, some passages and sentences were so important that he, or his editors, felt it\nnecessary to include more detailed instructions on their location. Perhaps a reader would keep copies of\nPlato, Aquinas and Aristotle open beside him as he read, allowing him to flip to the indicated page when\nprompted. Or, perhaps, he would merely write down the passage number in a notebook, to look up at\nhis leisure later. In other cases, the marginal notes serve the same purpose as that of footnotes in\nmodern times, to add in an additional point which the author wants to make but cannot fit into the main\ntext.\nWhile the content of Casaubon's Treatise fits quite firmly within the contemporary context of\nlate 17th Century England, the style of the writing and the nature of its scholarship seems to be much\nmore rooted in the 15th and 16th centuries. The references to ancient authorities does not make the\nTreatise Concerning Enthusiasme unique compared to its contemporaries by any means, but the sheer\nvolume of references and the scholastic methods expressed in the book showcase the Humanistic\ntradition. The text shows that a fundamentally modern view - that 'revelations' from God are more\nlikely to arise from disease than from Divine intervention - can nonetheless be adeptly expressed\nthrough ancient sources.\n\nReferences\n\nCasaubon, Meric. A Treatise on Enthusiasme. London, 1654. MIT Rare Books Collection.\n--. A Treatise on Enthusiasme. London, 1655. Boston Public Library.\n<https://archive.org/details/treatiseconcerni00casa>.\nHume, David. \"Essay X: Of Superstition and Enthusiasm.\" Essays Moral, Political and Literary. 1754.\nLake, Peter and David Como. \"Orthodoxy and its Discontents: Dispute Settlement and the Production of\nConsensus in the London Puritan Underground.\" Journal of British Studies (2000): 34-70.\nReeve, John. A General Epistle from the Holy Spirit unto all prophets, ministers, or speakers in the world.\n1653.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.141 Renaissance To Revolution: Europe, 1300-1800\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "21H.141S15 Renaissance To Revolution: Assignments - Student Example 3",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-141-renaissance-to-revolution-europe-1300-1800-spring-2015/c37de40478ec9f5150617d26408b3f3d_MIT21H_141S15_Roman.pdf",
      "content": "Roman Stonehenge and the English Renaissance\nIn the year 1534, in order to annul his marriage to Catherine of Aragon and\nlegitimize one to Anne Boleyn, King Henry VIII of England broke with the Roman\nCatholic Church and established the Church of England, declaring himself the\necclesiastical head. The result was over a century of political, religious, and intellectual\ntumult following his death in 1547. When his son, the nominally protestant King Edward\nVI died in 1553, it was Henry's Catholic daughter Mary, nicknamed \"Bloody,\" who took\nthe throne, and earned her epithet in a ruthless attempt to purge the Protestant presence\nfrom England through arrests, torture, and execution. She was succeeded by her more\ntolerant, Protestant half-sister Elizabeth I, who brought about a period of peace\nperpetuated by her own successor, the Scottish King James I, a master in the delicate act\nof balancing the factitious English godly community, as well as the divided\nParliamentarians. Yet by 1649, the political landscape of England had again devolved,\nwith a civil war between Parliament and James' son, King Charles I, leading to a period\nof renewed bloodshed and division that would not finally settle until the arrival of\nWilliam and Mary of Orange in 1688.\n\nThe result of these decades of turmoil and division was a great influx of religious,\npolitical, and intellectual diversity into the English school of thought. With the onset of\nyears of political division and, eventually, civil war, the overarching political and\nreligious authority weakened, taking with it the censorship of previous years, and leaving\nbehind a print and intellectual culture less burdened by the restrictions of government\nauthority. Radical religious groups began to emerge among the English people. New\n\nways of thinking appeared, and in the tumult of Henry VIII's successors, knowledge and\ninformation became disseminated and available to an unprecedented degree.\n\nIn this environment lived Inigo Jones. Well traveled, and a devoted student of the\narts, Jones was the Architect General for King James I in the early seventeenth century, at\nthe height of English factitiousness. His great surviving literary work, The Most Notable\nAntiquity of Great Britain, vulgarly called Stoneheng, on Salisbury Plain, was\ncommissioned by James in the year 1620 both as an analysis of the structure, and as a\ncritical attempt to determine who built it, and for what purpose. Through Jones's writing,\none is able to catch a glimpse of England in the seventeenth century. Jones' work\ndeveloped an understanding of 17th Century England as intellectually fissiparous and\ndiverse by conveying to what great extent knowledge was disseminated, rationalized an\nanalysis of seventeenth century English intellectualism as situated squarely within the\nphilosophy of Renaissance Humanism, and contradicted the impression of seventeenth\ncentury England as a chaotic hotbed of radical, mob-mongering literature and\nscholasticism.\n\nWhile King James commissioned the analysis of Stonehenge in 1620, Jones's\nwork on the subject was not published until after both he and his monarch had passed.\nThe writing that remains today is, in fact, merely a collection of Jones's notes on the\nantiquity, compiled by John Webb and published by John Flesher in London, 1655. In his\nwork, Jones first addressed competing theories concerning the builders of Stonehenge.\nHe dismissed the suggestion that it was constructed as a temple by the ancient Druids, on\nthe grounds that \"...their Temples' and sacred structures, they consisted not in variety of\nformes, costlinesse of materials, or perfection of humane Arts, but were of Natures own\n\nframing...\" (Stoneheng, 5). Jones rejected the proposal that it was built by the Britons for\na similar reason: namely that they maintained no knowledge of the art of building with\nstone.\n\nHaving repudiated all existing theories concerning the builders of Stonehenge,\nJones did not immediately present his own thoughts. Instead, he conducted a sweeping\nanalysis of the structure itself. He described to the reader the layout of the stones, the\narrangement of the entryways and the trench. He noted the appearance of patterns within\nthe arrangement, of hexagons that can be drawn between the principal monoliths within\neach layer. And with his detailed descriptions, Jones paired illustrations. Included within\nthe text itself are vivid diagrams of Stonehenge. The structure of the antiquity is laid out\nclearly, from multiple angles, complete with Jones's labels for the different sections, and\nannotations concerning the patterns he observed.\n\nIt is only after he discounted alternative thoughts on the structure's builders, and\npresented the reader with a clear picture of Stonehenge itself, that Jones put forth his own\ntheory. \"Stoneheng in my judgment was a work, built by the Romans, and they the sole\nFounders thereof.\" (Stoneheng, 66). Jones insisted that Stonehenge could only be the\nwork of the Romans because only they, he said, had the knowledge and the skill in\narchitecture to create such a structure. He asserted that nowhere but in the former\nprovinces of Rome had he seen marvels that rival Stonehenge in the enormity of its\nconstruction. \"Among the gyptian Antiquities, or those Eastern Nations from whom the\nGrcians deduced their learning, I find not any such composure ever used: or with the\nGreeks themselves...\" Jones wrote. (Stoneheng, 65).\n\nThroughout his book, Jones made frequent and repeated references to authors\nfrom both his own age, and from antiquity. His denial of the claim that the Druids built\nStonehenge was grounded in the works of classical authors such as Caesar, Tacitus,\nPliny, Strabo, and even those as little known today as Pomponius Mela, as well as more\ncontemporary writers like Humphrey Lloyd, who all tell of how the Druids, far from\nbuilding magnificent shrines of stone, worshipped instead within Nature itself. \"The\nDruids chose of purpose (saith Pliny) such groves for their divine Service as stood only\nupon Okes; nay they solemnized no Sacrifice, nor performed any sacred Ceremonies\nwithout the branches, and leaves thereof.\" (Stoneheng, 5). Furthermore, his refusal to\naccept that it was instead the Britons who built the structure was drawn from the works of\nHerodian, Dion of Xiphiline, and Sir Walter Raleigh, who vindicated the suggestion that\nthe British were a barbarous people devoid of the ability to produce a work such as\nStonehenge; \"As for their manner of living, the Britans were then a savage and barbarous\npeople, knowing no use at all of garments. Vestis usum non cognoscunt (saith Herodian.)\nNow, if they destitute of the knowledge even to clothe themselves, much less knowledge\nhad they to erect stately structures...\" (Stoneheng, 7).\nEven his own claim, that the Romans in fact constructed Stonehenge, was shored\nup by the writings of Camden, Leyland, Pausanias, and others who spoke of similarly\nbuilt structures known to be of Roman origins. Jones did not just know of these writers,\nhe was intimately familiar with them and many others, and was able to cite their thoughts\nextensively. This suggests access to and dissemination of a quantity and a variety of\nknowledge and information unlike anything anyone in England had experienced before. It\ncommunicates the many and varied forms of enlightened thought, and the several\n\ncontrasting viewpoints presented by Jones within his book alone illustrate for an observer\nthe diverse nature of English intellectualism in the seventeenth century.\n\nThis culture of literary promulgation exposed the seventeenth century English to\nall manner of philosophies and ideologies. For the first time, the Renaissance beliefs of\nFrance, Italy, and the rest of mainland Europe found an audience among the English\npeople. For the first time, the English were able to encounter and adopt the doctrines and\ndogmas of earlier European thinkers, and to produce thinkers of their own. Men like\nFrancis Bacon consulted the humanists of old, and tackled the tough questions about God\nand the cosmos. Fascination and interest in antiquity experienced a revival.\nUnquestioning faith gave way to skepticism and critical analysis, and the intellectual\nclimate of seventeenth century England became encircled by the ideology and doctrine of\nthe Renaissance humanists. Inigo Jones' book The Most Notable Antiquity of Great\nBritain, vulgarly called Stoneheng, on Salisbury Plain contributes to this interpretation of\nseventeenth century English intellectualism through its own revived interest in classical\nantiquity, as well as its characteristically humanist use of fact, reason, and observation to\nboth support its own claims and discount the opposition.\n\nInigo Jones was a devoted student of classical antiquity. He traveled through\nmuch of Europe to study the architectural works of the ancients, and is knowledgeable of\nthe written record. \"I passed into forrain parts to converse with the great Masters thereof\nin Italy; where I applied myself to search out the ruines of those ancient Buildings...\"\n(Stoneheng, 1). Upon returning to England, his desired to study architecture so that he\nmight come to understand those great works of antiquity that adorned his own country.\n\"...I applied my minde more particularly to the study of Architecture. Among the ancient\n\nmonuments whereof, found here, I deemed no one more worthy the searching after, then\nthis of Stoneheng.\" (Stoneheng, 1). Throughout his book, Jones demonstrated his\nknowledge of ancient writers, and cited a great number of them, including Caesar,\nTacitus, Pliny, and Strabo, as mentioned. The text is full of quotes set in italic type to\ndifferentiate them from the rest, and followed by the phrases \"saith Tacitus.\" (Stoneheng\n6) or \"as Strabo\" (Stoneheng 8). Jones himself gives us a glimpse into the obsessions of\ncontemporary English intellectuals. His own fascination with the ancients and his\ncommitted study of such conveys and image of England in the midst of a classical\nrevival. It supports an impression of English intellectuals as focused on their own history,\non the time of antiquity. In other words, as humanist.\n\nFurthermore, Jones based all his arguments in observation and the interpretation\nof fact. He was utterly rational, discarding opposing arguments only when he was able to\nshow that they were unsupported by the facts and the history. For instance, he rejects the\ntheory that Stonehenge was built by the Druids because it does not fit with the historical\nobservation that they worshipped and operated not only in woods, but also in a different\npart of the island \"For, their ancient seat was in the Isle of Mona...\" (Stoneheng, 6).\nLater, he employs reason to conclude that it could not have been the Britons, since they\nwere not known to have any knowledge of stonework. As well, he proposes even his own\ntheory, that the Romans were the builders, on a foundation of reason and observation. He\nnotes similarities between the arrangement of Stonehenge and several temple models\nknown to have been employed by the Romans: \"But to come to their sacred works, which\nin regard of this Antiquity are (it's true) of most concernment, I find the Romans used (as\nVitruvius witnesseth) such manner of Temples...he delivers, there were amongst others\n\ntwo forms of round Temples, commonly in use amongst them, the one called Monopteros,\nthe other Peripteros...the other made open, and instead of a wall encompassed with a\nrow of pillars only, having no enclosed Cell within it at all...\" (Stoneheng, 77-78). Jones\neven went on to provide diagrams of the Monopteros placed right alongside the\nschematic of Stonehenge itself, to better convey to the reader the ground on which his\nconclusion was based (Stoneheng, 83, 85). Inigo Jones conducted a careful analysis. He\nwas rational, and interpreted only factual record and observation in a manner reminiscent\nof none so much as Lorenzo Valla. Jones represented an intellectual step away from\nfaith-based reason, towards a more rational, enlightened manner of thought. He\napproached his study of Stonehenge with the delicacy and critical scrutiny of a humanist,\nand his methodical, reasoned approach coupled with his fascination and interest in the\nage of antiquity supports an understanding of seventeenth century English intellectualism\nas distanced from earlier, faith-based ideology, and squared securely within the sphere of\nRenaissance Humanism.\n\nAs diverse and fissiparous as the intellectual landscape of seventeenth century\nEngland was, the political climate was worse. Henry VIII's schism with the Roman\nCatholic Church left decades of upheaval in its wake, destroying the cohesion of doctrine\nthat held Catholic institutions together and opening the door to religious and political\nradicalism once held in check by a unified central authority. The result was a surge of\noutspoken radical thinkers, who debated political and religious doctrine loudly and to no\nend, declaring their own way the only way, and those who contradicted them heretics and\nblasphemers. The print culture of England became one of pamphleteers. Publications\nwere made rapidly, and produced en masse, to reach the greatest number of people in the\n\nshortest time and at the lowest cost. Treatises were aimed to please the mob, to garner\nrenown for the author among the people as a thinker or a preacher. It was a print culture\nof fast motion, rapid writing, and relative chaos.\n\nInigo Jones did not fit in this mold. His text was no pamphlet, rushed quickly\nfrom the shop and handed out on street corners while the ink was still damp. A book of\nimpressive size, more than one hundred pages long, it was a work of a refined and elite\nnature. Elegantly constructed and well bound, the book was a luxury item. It was fitted\nwith nearly twenty-five illustrations and diagrams; schematics and architectural plans of\nStonehenge and similar temples were placed side by side with artistic impressions of the\nwonder, and there was even an illustration of the author himself (Stoneheng, 1). The text\nwas set in many different types, with the appearance of italics and even the old Gothic\nscript. It was not a text meant for popular consumption, but a work written by a member\nof the intellectual elite, for the intellectual elite. The very physical nature of Jones's text\ncontradicted the environment of rapid-fire, cheap print culture that surrounded it, and\ndemonstrated that, though censorship was vanishing and central authority weakening, the\nupper level of English intellectualism retained stability and grace.\n\nInigo Jones lived, studied, and wrote in a period of English upheaval and turmoil.\nThe nature of his country and environment was apparent in his book, The Most Notable\nAntiquity of Great Britain, vulgarly called Stoneheng, on Salisbury Plain. In it, Jones\ncontradicted an understanding of English print and scholastic culture as rapid, cheap, and\nchaotic, and instead supported an impression of stability retained, despite political tumult,\namong the elite intellectuals. As well, Jones' text upheld an interpretation of England in\nthe seventeenth century as intellectually diverse, varied, and fissiparous through his\n\nfrequent citation of a great number of classical and contemporary authors who at times\ncontradict both each other, and Jones himself. Finally, Jones's own repeated reference to\nand admiration for the period of antiquity, as well as his critical, factual, and reason-\nbased approach to his task rationalized a perception of English intellectualism as\ngrounded in the philosophy of the Renaissance humanists. All together, Jones's book\nconveyed an understanding of seventeenth century England as transitioning, despite\npolitical and religious division and turmoil, into an era of Renaissance thought, and one\nof enlightened and progressive intellectualism.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.141 Renaissance To Revolution: Europe, 1300-1800\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "21H.141S15 Renaissance To Revolution: Lecture Slides - Book of Hours",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-141-renaissance-to-revolution-europe-1300-1800-spring-2015/203a7f810a12292cd87dfefe74a72621_MIT21H_141S15_Bookofhour.pdf",
      "content": "Images from Book of Hours\nUse of Paris, ca. 1450\nMIT Rare Books\nand Special Collections\nThis image is in the public domain.\n\nFirst page with text.\nThis image is in the public domain.\n\nFirst page listing saints days.\nThis image is in the public domain.\n\nText page.\nThis image is in the public domain.\n\nTransitional scribe page.\nThis image is in the public domain.\n\nAnnunciation?\nThis image is in the public domain.\n\nJesus, Mary, and Joseph\nin the manger.\nThis image is in the public domain.\n\nThe Three Magi\nThis image is in the public domain.\n\nCrucifixion of Christ\nThis image is in the public domain.\n\nThe Holy Spirit\nThis image is in the public domain.\n\nFinal Judgement\nThis image is in the public domain.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.141 Renaissance To Revolution: Europe, 1300-1800\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "21H.141S15 Renaissance To Revolution: Lecture Slides - Charles I",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-141-renaissance-to-revolution-europe-1300-1800-spring-2015/9cd1f4525a83c53674e1aa946b2e9752_MIT21H_141S15_Charles1.pdf",
      "content": "The Execution of Charles I\n\nPortrait of Charles I,\nAnton van Dyck, 1636\nPortrait of Louis XIV,\nHyacinth Rigaud, 1701\nThis image is in the public domain.\nThis image is in the public domain.\n\nContemporary German Engraving of the Execution\nThis image is in the public domain.\n\nEnglish Woodcut Engraving of the Execution\nThis image is in the public domain.\n\nJohn Weepol, Execution of Charles I, ca. 1649\nThis image is in the public domain.\n\nFrontispiece to\nEikon Basilike\n(The Royal Portrait),\nThis image is in the public domain.\n\nEikon Basilike,\nTitle Page, 1649\nJohn Milton, Eikonoklastes\nTitle Page, 1649\nThis image is in the public domain.\nThis image is in the public domain.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.141 Renaissance To Revolution: Europe, 1300-1800\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "21H.141S15 Renaissance To Revolution: Lecture Slides - Christian Humanism",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-141-renaissance-to-revolution-europe-1300-1800-spring-2015/8a8806a8ceaeac761aaacd79810618bf_MIT21H_141S15_Christian.pdf",
      "content": "Northern Europe,\nChristian Humanism,\nCatholic Reform ca. 1500\n21H.141\nSpring 2015\n\nRaphael, Pope Julius II, 1511-12\nPope Boniface VIII, issuing Unam Sanctum in 1302.\nThis image is in the public domain.\n\nThe tomb of the humanist\nLeonardo Bruni, 1370-1444.\nBasilica of Santa Croce, Florence\nCourtesy of jean louis mazieres on flickr. License CC BY-NC-SA.\n\nN. Copernicus,\nOn the Revolutions\nof the Heavenly\nSpheres, 1543.\nThis image is in the public domain.\n\nVesalius,\nOn the\nFabrication of\nThe Human\nBody, 1543.\nThis image is in the public domain.\nThis image is in the public domain.\nThis image is in the public domain.\nThis image is in the public domain. 5\n\nThe sale of indulgences\nThis image is in the public domain.\n\nSatire on the\nsale of indulgences\nThis image is in the public domain.\n\nDecrees of Pope Gregory IX, 1227-41. Paris Edition, 1507. MIT Rare Books.\nThis image is in the public domain.\nThis image is in the public domain.\n\nHans Holbein the Younger,\nErasmus, 1523\nAlbrecht Durer, Erasmus, 1526\nThis image is in the public domain.\nThis image is in the public domain.\n\nHans Holbein the Younger,\nSir Thomas More, 1527\nThis image is in the public domain.\n\nHolbein\nthe Younger,\nThe\nAmbassadors,\nThis image is in the public domain.\n\nErasmus, Novum Instrumentum, 1516 edition, first and last pages.\nThis image is in the public domain.\n\nComplutense Polyglot Bible, 1522\nThis image is in the public domain.\n\nRaphael, Pope Julius II, 1511-12\nPope Boniface VIII, issuing\nUnam Sanctum in 1302.\nRaphael, Pope Julius II, 1511-12\nThis image is in the public domain.\nThis image is in the public domain.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.141 Renaissance To Revolution: Europe, 1300-1800\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "21H.141S15 Renaissance To Revolution: Lecture Slides - Descartes",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-141-renaissance-to-revolution-europe-1300-1800-spring-2015/b8d42b0998fc12e663f042a4e8cbe2c3_MIT21H_141S15_Descartes.pdf",
      "content": "Descartes' Discourse on Method\n1668 Paris Edition\nMIT Rare Books Collection\n21H.141\nSpring 2015\nThis image is in the public domain.\nThis image is in the public domain.\n\nThis image is in the public domain.\nThis image is in the public domain.\n\nAbraham Bosse, La Galerie du palais, 1638\nThis image is in the public domain.\nThis image is in the public domain.\n\nThis image is in the public domain.\n\n\"I think, therefore\nI am.\"\nThis image is in the public domain.\n\nAlso in the 1668 Paris edition\nof the Discourse on Method\nThis image is in the public domain.\nThis image is in the public domain.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.141 Renaissance To Revolution: Europe, 1300-1800\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "21H.141S15 Renaissance To Revolution: Lecture Slides - Encyclopedie I",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-141-renaissance-to-revolution-europe-1300-1800-spring-2015/fd087bd1bd20bdfcc6d838e95f6cf119_MIT21H_141S15_Encycloped1.pdf",
      "content": "Title page of the first\nvolume of the\nEncyclopedie,\npublished in 1751.\nThis image is in the public domain.\n\n\"Map of the System\nof Human Knowledge\"\n\n(Volume 1, 1751)\nThis image is in the public domain.\n\nEncyclopedie,\nFrontispiece, 1772\n(Bound with Volume 1,\n1751.)\n\nThis image is in the public domain.\n\n\"The section on the mechanical arts required no fewer\ndetails and no less care. Never, perhaps, has there been\nsuch an accumulation of difficulties, and, to conquer them,\nso little help from books. Too much has been written on\nthe sciences; not enough has been written well on the\nmechanical arts. For what is the scanty information available\nin the various authors, compared to the extent and\nrichness of the subject?\"\n\"But there are some trades so unusual and some operations\nso subtle that unless one does the work oneself, unless one\noperates a machine with one's own hands, and sees the work\nbeing created under one's own eyes, it is difficult to speak of\nit with precision. Thus, several times we had to get possession\nof the machines, to construct them, and to put a hand to the\nwork. It was necessary to become apprentices, so to speak,\nand to manufacture some poor objects ourselves in order to\nlearn how to teach others the way good specimens are made.\"\nDiderot & D'Alembert,\nPreliminary Discourse,\nEncyclopedie\n\nIn effect, these guilds have their own laws, which are nearly always opposed\nto the general good....The first and most dangerous are the barriers to\nindustry caused by the high costs and formalities of admission....In some\nguilds, where the number of members is restricted or where admission\nis reserved for sons of masters, one sees a monopoly contrary to the laws\nof reason and state....[E]ven worse many are indifferent to making progress\nin the Arts, even in the very ones they practice.\nDiderot, \"Guilds,\" 1753\nIt is especially when he [the editor] will have toured the workshops for awhile,\nmoney in hand, and one will have made him pay dearly for the most ridiculous\nfalsehoods, that he will know what sort of people these Artists are, especially\nat Paris, where the fear of taxes holds them perpetually in mistrust, and\nwhere they consider anyone who questions them with curiosity as an\nemissary of the farmers general [tax collectors] or as a worker who wants\nto set up shop.\nDiderot, \"Encyclopedia,\" 1755\n\nSeventeenth-Century\nImages of Work\nAbraham Bosse, \"Printshop,\" 1642\nNicolas de Larmessin,\nPastrymaker, late 17th century\nThis image is in the public domain.\nThis image is in the public domain.\n\nNineteenth-century\nImages of Work\nIron-forging, mid-19th century\nShoe-making, mid-19th century\nThis image is in the public domain.\nThis image is in the public domain.\n\nNeedlemaker\nPinmaker\nThis image is in the public domain.\nThis image is in the public domain.\n\nTapestry workers,\nGobelins Factory\nBasketweavers\nThis image is in the public domain.\nThis image is in the public domain.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.141 Renaissance To Revolution: Europe, 1300-1800\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "21H.141S15 Renaissance To Revolution: Lecture Slides - Encyclopedie II",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-141-renaissance-to-revolution-europe-1300-1800-spring-2015/76a38146d0aa3a6fcb9534ad73156bb8_MIT21H_141S15_Encycloped2.pdf",
      "content": "The Encyclopedie of Diderot\nand d'Alembert\n\nTailor of Suits, I\nThis image is in the public domain.\nThis image is in the public domain.\n\nTailor of Suits, II\nThis image is in the public domain.\nThis image is in the public domain.\n\nImprimerie 1\nThis image is in the public domain.\n\nImprimerie 2\nThis image is in the public domain.\n\nImprimerie 3\nThis image is in the public domain.\n\nImprimerie 4\nThis image is in the public domain.\n\nChirurgie 1\nThis image is in the public domain.\n\nChirurgie 2\nThis image is in the public domain.\n\nChirurgie 3\nThis image is in the public domain.\n\nChirurgie 4\nThis image is in the public domain.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.141 Renaissance To Revolution: Europe, 1300-1800\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "21H.141S15 Renaissance To Revolution: Lecture Slides - Newton",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-141-renaissance-to-revolution-europe-1300-1800-spring-2015/f84bd39eadc4faaa60c746225e42dacf_MIT21H_141S15_Newton.pdf",
      "content": "Images of Isaac Newton\n\nPortrait of Isaac Newton,\nGodfrey Kneller, 1689\nThis image is in the public domain.\n\nPortrait of Isaac Newton,\nJames Thornhill, 1712\nThis image is in the public domain.\n\nNewton, William Blake, 1795\nThis image is in the public domain.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.141 Renaissance To Revolution: Europe, 1300-1800\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "21H.141S15 Renaissance To Revolution: Lecture Slides - Nuremberg Chronicle",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-141-renaissance-to-revolution-europe-1300-1800-spring-2015/bbe7bd1d8fada38908e8d2afb1c7caad_MIT21H_141S15_NurembergI.pdf",
      "content": "Images from The Nuremberg\nPart I\n\nChronicle, 1493,\nMIT Rare Books & Special\nCollections\n\nThis image is in the public domain.\nThis image is in the public domain.\n\nThe Seven Ages of the World, as presented in the Nuremberg Chronicle:\n\nFirst age: from creation to the Deluge\nSecond age: up to the birth of Abraham\nThird age: up to King David\nFourth age: up to the Babylonian captivity\nFifth age: up to the birth of Jesus Christ\nSixth age: up to the present time (the largest part)\nSeventh age: outlook on the end of the world and the Last Judgement\n\n\"Title page\", with inscriptions\nfrom previous owners\nThis image is in the public domain.\n\nFirst page of table of contents\nThis image is in the public domain.\n\nIntroductory page\nwith missing rubrication\nThis image is in the public domain.\n\nOne of two colored illustrations\nin the MIT copy.\nThis image is in the public domain.\n\n\"In the beginning, God\ncreated the heavens\nand the earth.\"\nThis image is in the public domain.\n\n\"On the seventh day, God rested.\"\nThis image is in the public domain.\n\nNotations on a page discussing\ncosmology and history. Note the\n\"nota bene\"annotation in the middle\nMargin, and the pointing finger\nbelow it. The notations in the right\nmargin count the ages of the world.\nThis image is in the public domain.\n\nGod creates Eve from Adam's rib\nin the first age of the world.\nThis image is in the public domain.\n\nAdam and his progeny,\nfirst age of the world.\nThis image is in the public domain.\n\nNoah's Ark, and\nthe Rainbow Covenant.\nSecond age of the world.\nThis image is in the public domain.\n\nHumans and monsters,\nSecond age of the world.\nThis image is in the public domain.\n\nWorld map, 1493.\nThis image is in the public domain.\n\nAges of man, beginning with Noah. Second age of the World.\nThis image is in the public domain.\n\nJerusalem.\nSecond Age of the World.\nThis image is in the public domain.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.141 Renaissance To Revolution: Europe, 1300-1800\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "21H.141S15 Renaissance To Revolution: Lecture Slides - Nuremberg Chronicle",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-141-renaissance-to-revolution-europe-1300-1800-spring-2015/2b0118e1b45c37110a89fc3f23ac92a2_MIT21H_141S15_NurembergII.pdf",
      "content": "Images from The Nuremberg\nPart II\nChronicle, 1493,\nMIT Rare Books & Special\nCollections\n\nThis image is in the public domain.\nThis image is in the public domain.\n\nTroy & kings of the Trojan War.\nThird Age of the World.\nThis image is in the public domain.\n\nBabylonian kings\n& the fall of Babylon.\nFifth Age of the World.\nThis image is in the public domain.\n\nJohn baptising Christ,\nlower left corner.\nBeginning of the\nSixth Age of the World\nThis image is in the public domain.\n\nRome\nThis image is in the public domain.\n\nConstantinople\nThis image is in the public domain.\n\nNuremberg\nThis image is in the public domain.\n\nColored image of Nuremberg from The Nuremberg Chronicle, Wikipedia Commons.\nThis image is in the public domain. Source: Wikimedia Commons.\n\nWoodblock image repetition\nThis image is in the public domain.\n\nBurning of heretics, 1300s.\nThis image is in the public domain.\n\nIllustration of so-called Jewish \"blood libel.\"\nThis image is in the public domain.\n\nApocalypse.\nSeventh Age of the World\nThis image is in the public domain.\n\nDance of Death. Seventh Age of the World.\nThis image is in the public domain.\n\nFinal Judgement.\nThis image is in the public domain.\n\nPope and Holy Roman Emperor meet.\nThis image is in the public domain.\n\nMap of Europe, ca. 1493\nThis image is in the public domain.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.141 Renaissance To Revolution: Europe, 1300-1800\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "21H.141S15 Renaissance To Revolution: Lecture Slides - Nuremberg Chronicle",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-141-renaissance-to-revolution-europe-1300-1800-spring-2015/325e4def5d8d2e8bf29db8bdc512ab9e_MIT21H_141S15_Reformation.pdf",
      "content": "REFORMATION IMAGES\n21H.141\nSpring 2015\n\nRaphael, Pope Julius II, 1511-12\nRaphael, Pope Julius II, 1511-12\nJulius Exclusis, 1513 engraving\nThis image is in the public domain.\nThis image is in the public domain.\n\nThe sale of indulgences\nThis image is in the public domain.\n\nSatire on the\nsale of indulgences\nThis image is in the public domain.\n\nPassions of the Christ\nand Anti-Christ\nThis image is in the public domain.\n\nThe Papacy and Luther as seven-headed\nmonsters, From the Book of Revelations.\nThis image is in the public domain.\nThis image is in the public domain.\n\nAlbrecht Durer, Proposed\nMonument to the Victims\nof the German Peasants'\nWar, 1525\nThis image is in the public domain.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.141 Renaissance To Revolution: Europe, 1300-1800\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}