{
  "course_name": "Research Topics in Architecture: Citizen-Centered Design of Open Governance Systems",
  "course_description": "In this seminar, students will design and perfect a digital environment to house the activities of large-scale organizations of people making bottom-up decisions, such as with citizen-government affairs, voting corporate shareholders or voting members of global non-profits and labor unions. A working Open Source prototype created last semester will be used as the starting point, featuring collaborative filtering and electronic agent technology pioneered at the Media Lab. This course focuses on development of online spaces as part of an interdependent human environment, including physical architectures, mapped work processes and social/political dimensions.\nA cross-disciplinary approach will be taken; students with background in architecture, urban planning, law, cognition, business, digital media and computer science are encouraged to participate. No prior technical knowledge is necessary, though a rudimentary understanding of web page creation is helpful.",
  "topics": [
    "Engineering",
    "Systems Engineering",
    "Systems Design",
    "Fine Arts",
    "Architecture",
    "Environmental Design",
    "Media Studies",
    "Digital Media",
    "Social Science",
    "Public Administration",
    "Engineering",
    "Systems Engineering",
    "Systems Design",
    "Fine Arts",
    "Architecture",
    "Environmental Design",
    "Media Studies",
    "Digital Media",
    "Social Science",
    "Public Administration"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 2 hours / session\n\nCourse Overview\n\nImagine if networked computers and other devices could unleash full democratic real-time participation in official decisions by all stakeholders. To date, member-led debate and decision-making has always been subject to physical limits in space, time and numbers of participants. Current technologies and business practices can allow architects and planners to break through the traditional constraints to member involvement in the agoras of our public and private institutions. The implications for corporate transparency and accountability, as well as for more responsive government are provocative.\n\nIn this seminar, students will design and perfect a digital environment to house the activities of large-scale organizations of people making bottom-up decisions, such as with citizen-government affairs, voting corporate shareholders or voting members of global non-profits and labor unions. A working Open Source prototype created last semester will be used as the starting point, featuring collaborative filtering and electronic agent technology pioneered at the Media Lab. This course focuses on development of online spaces as part of an interdependent human environment, including physical architectures, mapped work processes and social/political dimensions.\n\nA cross-disciplinary approach will be taken; students with background in architecture, urban planning, law, cognition, business, digital media and computer science are encouraged to participate. No prior technical knowledge is necessary, though a rudimentary understanding of web page creation is helpful.\n\nThis seminar will be project-based, and will apply user-centered-design principles in the creation of our final working online environment. To this end, MIT has identified various Massachusetts towns that will collaborate on this project to facilitate citizen-led local government decision-making (known as \"Open Town Meetings\"). Students will work with officials, activists and citizen-participants from these towns. In addition, MIT has concluded agreements with member-led non-profit organizations that will also act as beta testers and participate in the user-centered design process, including LegalXML.org. Students may propose additional organizations willing to act as collaborators in bringing their member-led decision-making processes online.\n\nDesign Requirements: Electronic Self-Governance Through Collaborative Filtering & Open Source Code\n\nThere are two basic principles guiding the design of this Participatory Governance Environment: 1. that collaborative filtering can be used to leapfrog the barriers to very large yet effective groups of individuals actively participating in the governance process; and 2. that Open Source Code can be used to ensure that ownership and control remains in the hands of those who consent to use and be governed through it. Our Design Principles Page details the reasoning and approach associated with these dual imperatives.",
  "files": [
    {
      "category": "Resource",
      "title": "Oct01Name.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-285-research-topics-in-architecture-citizen-centered-design-of-open-governance-systems-fall-2002/7d075be260105d9577ae6d2a20594130_Oct01Name.pdf",
      "content": "Name and Identity\nWhat is a name?\nA designation. We used to assume name AÆ person/thing (1 to 1) - but not necessarily.\nLecture first (authentication, identity) - then look at flows - decision-making processes.\nAre we going to focus on one user? Town Meeting? We'll decide within the next wk.\nList of questions - today or tomorrow, by email.\nGovernment sequence of adopting web technologies\n(Increasing time and increasing complexity)\n1. Publish - just give information\n2. Interact - quick query - discussion board, etc.\n3. Transact - business interaction - purchases. Link up to other organizations (credit\ncards). Identity becomes important.\n4. Integrate - Put transactions together - diff organizations. Business hires someone - 7\ndifferent agencies in MA. Fill out one form on front end - redistributes. Faster, cheaper,\nbetter. Companies are just starting to integrate now. Database itself becomes the\n'agency'. \"Intentions-based design\" - just go to the database.\n5. Transform - theoretical - merging agencies due to integration - reorganization on the\nback end.\nSolutions:\n1. PKI - Public Key Infrastructure - symmetric key, asymmetric (public/private)\ncryptography. If you know formula - single key formula - incrypt/decrypt - but don't\nknow if someone has 'cracked' it. How can we deal with people securely without first\ngiving them the 'code' first. Two formulas -public and private - anything encrypted with\none key can only be decrypted with the other. Simply authenticate identity. SSL (secure\nsockets layer) - amazon - first tcp/ip - then html - then ssl.\nHow do you know that it is Amazon in the first place (how to initially get the public\nkey)? PGP (pretty good privacy) - 'web of trust' - history of relationship (Phil\nZimmerman) - keychain. Trusted 3rd Party (Santa Claus) - signature. i.e. certificate\nauthority (CA) is given private key by everyone - they sign all data (name, key, etc) -\nthen amazon presents to customer and decrypts CA's encrypted data - therefore identity\nis confirmed. Today and future - all politics is local (Tip O'Neill) - all identity is local.\nRelationships are context-driven.\nCore ID - Central National Authority - link all IDs back to this Core ID - in order to use\nthe same 'certificate' for all transactions. What is the underlying problem statement?\nMust ensure there is only one Core ID per person.\nLoss of autonomy with Core ID - privacy and liberty problem. So alternative system is\none of 'various realms of identity' - innocent citizen - have identity as a employee, as a\ncitizen, as a consumer, as a parent, etc.\n\nName is only part of identity. English Common Law - you can change your name - as\nlong as you are not trying to deceive. So who defines you? Yourself? Multinational\ncorp? Gov't? This is the Liberty Alliance System.\nApplication to Our System\nHow should identity be managed in our system?\n1. Do these users know each other in physical world? If no: strict ID is more important.\nIf yes: more important to be anonymous.\n2. ID should be configurable to sub-communities (alias/pseudonym)\n3. Site design must track the underlying community norms w/ respect to ID.\n4. Gradient of identities - flexible IDs (1.chatroom - 2.tv - 3.newspapers - 4.bank) -\ndepends on the topic and you input (like, if you criticize someone)\na) users should be able to select levels of ID, unless\nb) community requires certain level for particular action\nsample levels: a) anonymous\nb) anon., unless accuse, then ID\nc) initial ID, then anon./pseudonym\nd) total ID\nWhat is the meaning of ID in these contexts?\nWhat about mimesis, simulacra, doppelganger, clones - are these are exceptions?\nReminders:\nTell Dan to send out website - public/private key.\nTell Dan to send link to Liberty Alliance Technical.\nTell Dan to send article by Dan G. on 'opting out'."
    },
    {
      "category": "Resource",
      "title": "F__Working_4_4285_Collabo.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-285-research-topics-in-architecture-citizen-centered-design-of-open-governance-systems-fall-2002/eee04567988f0984481e2fcf8342e902_F__Working_4_4285_Collabo.pdf",
      "content": "This seminar is specifically exploring the role of collaborative filtering as a technical ... Page 1 of 1\nCollaborative Filters for Community and Governance:\n\"Can We All Now Finally Talk At Once?\"\nThis seminar is specifically exploring the role of collaborative filtering as a technical means to\nenable large and dynamic communities of users to collaboratively brain storm, generate many\nproposals; and reach decisions through aggregated preferences and ratings of the group. This is a\nnew application of a well established technology, and will require creative thinking to fit the needs of\ngovernance rather than commerce, e-mail management, publishing and chat - the areas where\nfilters are typically used (for more background, see:\nhttp://directory.google.com/Top/Reference/Knowledge_Management/Information_Overload/Relevanc\nThe types of collaborative filters specifically explored in this seminar find their genesis in such sites\nas slashdot.com and netslaves.com. These sites regenerate themselves according to automated\n\"filters\" that collected and map the demonstrated interest of their user populations. In addition, sites\nsuch as Amazon.com have successfully used a type of collaborative filter to suggest books that may\nbe of interest to you based upon an automated lookup of the books that were also of interest to\nother users who purchased the same book that you did. This very simple algorithm is quite\neffective. In addition, the eBay.com site uses a type of collaborative filter whereby purchases rate\ntheir experience with sellers. Over time, these ratings become a very important source of\ninformation about a communities experience and judgment with individuals. As with the Amazon\nfilters, this automated information is at once very simple yet quite effective and predictive.\nThe design of a collaboratively filtered site supporting self-governance and participatory democracy\nwill use the technology to facilitate generation of ideas; discussion; determination of which ideas are\npopular and worthy enough to proceed to a formal decision; and finally to actually come to decision\non any ideas requiring action - such as a budget, a policy statement, or a contract. In the corporate\ngovernance arena, the types of decisions requiring group agreement are usually determined by a\nBoard of Directors or by the larger community of Shareholders. In the case of a government with\nlegislative powers (such as a Massachusetts Town Meeting, a state or national chamber), the voting\nmembers could also use this system to create ordinances, zoning bylaws, statutes, advice/consent\nor declarations.\nThe technologies supporting collaborative filtering, when applied in the self-governance context,\nmay more aptly be deemed \"Community Filtering\" (a term coined by Professor Michael Froomkin, of\nthe Miami School of Law) or \"Governance Filtering\" (coined at the MIT eCommerce Architecture\nProgram). For purposes of this seminar, the system has been designed to operate in two basic\nphases (described above). The first phase, where ideas are generated and discussed and\nbrainstorming occurs, is best described as \"Community Filtering\". This phrase connotes the broad,\ngeneral and potentially open-ended dialogs that can happen in any community at large. The\nsecond phase, in which only those matters requiring a formal and binding decision by eligible voting\nmembers of the group; is best described as \"Governance Filtering\". Different types of filtering and\nratings occur at each phase, because the context and objectives vary according to where in the life-\ncycle of a discussion the community exists."
    },
    {
      "category": "Resource",
      "title": "F__Working_4_4285_Echoes4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-285-research-topics-in-architecture-citizen-centered-design-of-open-governance-systems-fall-2002/f00e3fae7f5072e9fba69f218ffa3a23_F__Working_4_4285_Echoes4.pdf",
      "content": "Governance and Participatory Decision Making\nPage 1 of 4\nEchoes from History:\nLanguage of Participatory Democracy and Self-Governance\nThe rhetoric surrounding Open Source initiatives has something in common with the\npassionate and upending debates accompanying the revolutionary phase of American\nhistory. Unfortunately, it is not uncommon for Open Source rhetoric to be found lacking\nreason, wisdom and a sense of strategic direction. However, many well considered\ncommentators and advocates have also made constructive contributions to the emerging\ndebate on the proper role of Open Source Code. Stanford Law Professor Lawrence Lessig\nhas opined on this subject at length - at once scolding the overreaching of some advocates\nof Open Source while at the same time persuasively presenting a thesis in its favor. The\nfundamental premises supporting Open Source Code deserve serious consideration and\nare worthy of attempted application to many types of software - especially Participatory\nGovernance Environments.\nMassachusetts Constitution\nIt is helpful to consider the foundational texts supporting public sector self-governance in\nthe United States as a reference point. The Constitution of the Commonwealth of\nMassachusetts (one of the original 13 colonies whose constitution predates that of the\nUnited States); has much to say on the question of participatory democracy and self-\ngovernance.\nOn the topic of representative government, Article V of the Massachusetts Constitution\nprovides:\nAll power residing originally in the people, and being derived from them, the several\nmagistrates and officers of government, vested with authority, whether legislative,\nexecutive, or judicial, are their substitutes and agents, and are at all times\naccountable to them.\nThis text strongly curtails the discretion of elected and appointed government officials by\nrestraining them to act only according to the express desired of the people they represent.\nDespite the fact that this language exists within the Constitution itself - the basic controlling\nsocial compact enabling the state government - it is now common knowledge that\ngovernment does not resemble this provision. In fact, as of the middle of this semester, the\nMassachusetts legislature is embroiled in a law suit by backers of an initiative petition\ncreating \"clean elections\" enacted into law by a substantial majority of voters during the last\nelection. This ballot question method is a recognized manner of enacting law in\nMassachusetts - and yet the House of Representative of the state has nonetheless\ndecided not to fund the law. The Massachusetts Supreme Judicial Court has ruled that the\npublicly funded elections must be given adequate financial disbursement or the legislature\nmust act to repeal the law. However this particular contest ends, it stands as clear\nevidence that government does not always act as the humble, responsive and accountable\nservant of the people that was envisioned and commanded under the Constitution.\nWhat is supposed to happen when representative government fails? The Massachusetts\nConstitution contains at least two clear solutions. First, Article VIII instructs citizens of the\nCommonwealth to clean out the house. Article VIII provides:\nIn order to prevent those, who are vested with authority, from becoming oppressors,\nthe people have a right, at such periods and in such manner as they shall establish\nby their frame of government, to cause their public officers to return to private life;\n\nGovernance and Participatory Decision Making\nPage 2 of 4\nand to fill up vacant places by certain and regular elections and appointments.\nSecond, in the event that elections are not working Articles IV and VII of the Massachusetts\nConstitution instruct citizens that they own government, and they can and must change the\ngovernment when it fails them in a fundamental manner. Respectively, these articles\nprovide:\nArticle IV. The people of this commonwealth have the sole and exclusive right of\ngoverning themselves, as a free, sovereign, and independent state; and do, and\nforever hereafter shall, exercise and enjoy every power, jurisdiction, and right, which\nis not, or may not hereafter, be by them expressly delegated to the United States of\nAmerica in Congress assembled.\nArticle VII. Government is instituted for the common good; for the protection, safety,\nprosperity and happiness of the people; and not for the profit, honor, or private\ninterest of any one man, family, or class of men: Therefore the people alone have an\nincontestable, unalienable, and indefeasible right to institute government; and to\nreform, alter, or totally change the same, when their protection, safety, prosperity\nand happiness require it.\nWhile having incumbents wantonly maintain an impervious stance toward legitimate and\nmajority backed \"clean elections\" laws does not constitute a failure to assure protection,\nprosperity, safety AND happiness - it is nonetheless deeply vexing to many citizens. In the\nspirit of the founders, it is possible that the answer to these insults to the public can be\nfound in the \"reform and alteration\" of some aspects of government. Could the use of\nonline eDemocracy software - if it were sufficiently accessible, robust and tied to legally\nbinding decision making, form the basis of better citizen participation in government and\nmore responsive and accountable government? Does the advent of the information age\nopen new opportunities to more fully realize the Constitutional imperatives that lie at the\ncornerstone of our system?\nSale of Self-Governance Computer Code: Absurd and Unnatural?\nInterestingly, the Massachusetts Constitution indirectly sheds some light upon topic of\nOpen Source Code versus Private Property Code. If it is true, as Dean Mitchell posits, that\n\"Code is Law\", then it should be troubling that this software, owned by a corporation or\nindividual, is in effect \"passed down\" from generation to generation. Code is handed down:\nfrom CEO to CEO; passed from Non-Profits to NGO; from start up to acquiring\nconglomerate; from Copyright Owner to family or other beneficiaries named in the Owner's\nlast will and testament or through probate. Intellectual property, whether copyrighted,\ntrademarked or patented, is personal property - pure and simple. And Congress\ncontinually extends the numbers of decades during which the monopoly can be enforced\nunder copyright laws. In any case, software code revisions and other repackaging methods\nentitle the software to new copyright protections - in effect restarting the clock for copyright\nall the time. Article VI of the Massachusetts Constitution, using language reminiscent of the\npolemics employed by Open Source advocates of the day, holds that it is \"absurd and\nunnatural\" to have a corporation or any person transfer or inherit the right to act as \"law\ngiver or judge\". Specifically, Article VI provides:\nNo man, nor corporation, or association of men, have any other title to obtain\nadvantages, or particular and exclusive privileges, distinct from those of the\ncommunity, than what arises from the consideration of services rendered to the\npublic; and this title being in nature neither hereditary, nor transmissible to children,\nor descendants, or relations by blood, the idea of a man born a magistrate, lawgiver,\n\nGovernance and Participatory Decision Making\nPage 3 of 4\nor judge, is absurd and unnatural.\nDoes ownership of code in fact open the door to overreaching by the code proprietor in\nways that are undesirable and perhaps incompatible with self-governing communities -\nespecially in the public sector? Is the act of making design and functionality determinations\nabout how the code supporting a digital participatory decision making processes work\ntantamount to setting the procedural law governing that community? If so, then it may be\nunconstitutional to permit such power to be transferred as part of a commercial IP\nassignment or through a gift or probate transfer. In fact, it may even be termed \"absurd and\nunnatural\". Rather, the community itself should exercise final authority and opinion\nregarding the framework and methodologies by which government operates.\nDeclaration of Independence\nThe same thread of political philosophy runs through the Declaration of Independence. The\nconcept that free people must govern themselves, and that only the governed can\ndetermine the nature and methods of such government through their fashioning, consent,\noversight and participation is replete in early American political texts. In relevant part, the\nDeclaration of Independence reads as follows:\nGovernments are instituted among Men, deriving their just powers from the consent\nof the governed, --That whenever any Form of Government becomes destructive of\nthese ends, it is the Right of the People to alter or to abolish it, and to institute new\nGovernment, laying its foundation on such principles and organizing its powers in\nsuch form, as to them shall seem most likely to effect their Safety and Happiness.\nPrudence, indeed, will dictate that Governments long established should not be\nchanged for light and transient causes; and accordingly all experience hath shewn,\nthat mankind are more disposed to suffer, while evils are sufferable, than to right\nthemselves by abolishing the forms to which they are accustomed. But when a long\ntrain of abuses and usurpations, pursuing invariably the same Object evinces a\ndesign to reduce them under absolute Despotism, it is their right, it is their duty, to\nthrow off such Government, and to provide new Guards for their future security.\nModern Applications\nIn this context, the open source licensing agreement is akin to a constitution or declaration\nof independence and the software configuration/Filter setup decisions are akin to laws and\nregulations implementing the constitution. As such, the members of communities using the\nMIT eCommerce Architecture Program's \"Participatory Governance Environment\" to\nexercise their affairs will be entitled to assure that the manner in which the Code supports\nand reflects the governance of the community is at all times in synch with the needs of the\ncommunity, implemented according to the consent and creativity of the community, and that\nthe processes by which the code evolves is transparent, accountable and responsive to\nmembers of the community. Complex Code that has been long established should not be\nchanged for light and transient reasons, and users of even low quality, unsecure and bug-\nridden code have demonstrated an aversion to migrate to other packages; but when the\nneeds of a Community require a change to the Code, it must always be the Right of that\nCommunity to make whatever change it deems appropriate without ever having to answer\nto an external corporation or other vendor. Therefore, if the manner in which the Code is\nimplemented or evolves ever becomes destructive of the desired processes or aims of the\nMembers, it is the Right of the Members - including any subset among them - to alter or to\nabolish it, and to institute new Code, laying its foundation on such principles and organizing\nits powers in such form, as to them shall seem most likely to realize their aims, provided\nthat such new Code is made freely and openly available to any person or legal entity.\n\nGovernance and Participatory Decision Making\nPage 4 of 4\nRights and Duties and Enforcement\nThe basic governance texts from antiquity carry far more than an irritated recitation of\nrights. They also describe duties and responsibilities. Paying taxes, providing for the\ncommon defense of the community, abiding by rules made \"fair and square\" through the\ncommunity governance methods, etc. Will members of digital governance systems\nparticipate to the degree necessary to actually maintain continuity and quality? Will they\ncarry out the duties of the community?\nThe tailoring of these and other principles of self-governance to an online decision making\nforum in meaningful ways remains an emergent enterprise. The first field trip this semester\nto a Town Meeting (in the town of Westborough) revealed that every session of the meeting\nincludes at least one on-duty police officer. This uniformed, armed officer of the law stands\nat the back of the room. The elected Town Meeting Moderator has, in his job description,\nthe ability to rule participants \"out of order\". That job description also allows the Moderator,\nif need be, to order an unruly participant to be removed from the meeting environment. If\nthe participant refuses, and the mere paper and rhetoric proves insufficient, then the\nModerator is authorized to have the police remove the participant. If there are multiple\nunruly participants, then more police can be quickly assembled. If necessary, police from\nneighboring municipalities can be summoned under reciprocal agreements among towns.\nIf a real pinch, the Governor can mobilize the National Guard, including armored divisions,\nheavy weapons, jet fighters and so forth. In short - the full power of the state lies behind\nthe gavel of the Moderator. That power can be used to compel any user of the existing\n\"Participatory Governance Environment\" to play by the community rules. Or else. Same\ngoes for the obligation to pay taxes, abide by the criminal and civil statutes, and so on.\nOf course, this power also stands behind the enforcement of the rights of community\nmembers. If someone continually bothers you - eventually they can be put behind bars\nand their bank accounts can undergo forced funds transfer to your account. Those same\nuniformed, armed police and the rest of the state power apparatus serves to protect as well\nas to coerce.\nWhat equivalent methods exist in - or applied to - the digital arena? At what point will\ndigital tools be used as official methods of decision making in official governance\nchannels? If a shareholder at a corporate meeting is unruly, eventually the police are\nauthorized to use whatever force is necessary to remove that person - just as in a Town\nMeeting. When online environments house the virtual presence of participants, how can\ncommunity norms be efficiently and effectively enforced?"
    },
    {
      "category": "Resource",
      "title": "F__Working_4_4285_OpenGov.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-285-research-topics-in-architecture-citizen-centered-design-of-open-governance-systems-fall-2002/0f42b8a980e036208a554575129183f1_F__Working_4_4285_OpenGov.pdf",
      "content": "Perspectives on the Central Role of Open Source Code for Participatory Governance\nPage 1 of 3\nPerspectives on the Central Role of Open Source Code for\nParticipatory Governance:\nHuman Laws / Coded Conditionals\nThe social, legal, political and economic ramifications of using Open Source Code as the basis for\nthe Participatory Governance Environment are profound. At core - \"self governance\" is about a\ncommunity taking responsibility for ownership and control of that community. In the foundational\nbook City of Bits, William Mitchell, Dean of the MIT School of Architecture and Planning (and Patron\nSaint of the MIT eCommerce Architecture Program) was the first scholar to reveal and describe the\ninterplay between computer code and the laws by which we govern ourselves. In the aptly named\nsection \"Human Laws / Coded Conditionals\" Dean Mitchell sets out the challenge in four seminal\nparagraphs:\nOut there on the electronic frontier, code is the law. The rules governing any computer-\nconstructed microworld-of a video game, your personal computer desktop, a word processor\nwindow, an automated teller machine, or a chat room on the network-are precisely and\nrigorously defined in the text of the program that constructs it on your screen. Just as\nAristotle, in Politics, contemplated alternative constitutions for city-states (those proposed by\nthe theorists Plato, Phaleas, and Hippodamos, and the actual Lacedaemonian, Cretan, and\nCarthaginian ones), so denizens of the digital world should pay the closest of critical\nattention to programmed polity. Is it just and humane? Does it protect our privacy, our\nproperty, and our freedoms? Does it constrain us unnecessarily or does it allow us to act as\nwe may wish?\nAt a technical level, it's all a matter of the software's conditionals -those coded rules that\nspecify if some condition holds, then some action follows. Consider, for example, the\nfamiliar ritual of withdrawing some cash from an ATM. The software running the machine\nhas some gatekeeper conditionals; if you have an account and if you enter the correct PIN\nnumber (the one that matches up, in a database somewhere, with the information\nmagnetically encoded on your ATM card), then you can enter the virtual bank. (Otherwise\nyou are stopped at the door. You may have your card confiscated as well.) Next the program\npresents you with a menu of possible actions -just as a more traditional bank building might\npresent you with an array of appropriately labeled teller windows or (on a larger scale) a\ndirectory pointing you to different rooms: if you indicate that you want to make a withdrawal,\nthen it asks you to specify the amount; if you want to check your balance, then it prints out a\nslip with the amount; if you want to make a deposit, then yet another sequence of actions is\ninitiated. Finally, the program applies a banker's rule; if the balance of your account is\nsufficient (determined by checking a database), then it physically dispenses the cash and\nappropriately debits the account.\nTo enter the space constructed by the ATM system's software you have to submit to a\npotentially humiliating public examination-worse than being given the once-over by some\nsnotty and immovable receptionist. You are either embraced by the system (if you have the\nright credentials) or excluded and marginalized by it right there in the street. You cannot\nargue with it. You cannot ask it to exercise discretion. You cannot plead with it, cajole it, or\nbribe it. The field of possible interactions is totally delimited by the formally stated rules.\nSo control of code is power. For citizens of cyberspace, computer code-arcane text in highly\nformalized language, typically accessible to only a few privileged high-priests-is the medium\nin which intentions are enacted and designs are realized, and it is becoming a crucial focus of\npolitical contest. Who shall write the software that increasingly structures our daily lives?\nWhat shall that software allow and proscribe? Who shall be privileged by it and who\n\nPerspectives on the Central Role of Open Source Code for Participatory Governance\nPage 2 of 3\nmarginalized? How shall the writers of the rules be answerable?\nThe theory underlying the work of this semester's seminar is that code used for self-governance\nshould - perhaps \"must\" - be owned by those who use it. Unlike a social chat room or hobby club,\nthe code being designed by through our graduate seminar is intended to be used for serous, formal\nand legally binding decisions. For example, a municipality might use it to set ordinances and\nbylaws; a Union might use it to debate and vote upon a multi-year contract; the Share Holders of a\ncorporation could use it to make decisions governing the corporation they own; or members of a\npolitical party could use it to set their platform and hold conventions at which their candidates are\nchosen to hold the party banner in elections. These business contexts - whether in the public or\nprivate sectors - involve substantial and solemn transactions. Legal rights and duties of users of\nthe system can be significantly affected by the outcomes. This \"problem statement\" was\ndeliberately chosen precisely because it is challenging. It is hoped that modeling these difficult and\nformal processes will result in the development of code that is broadly useful to a variety of self-\ngoverning communities.\nWhat the Internet has made possible - tens of thousands of people working on the same topic over\na simultaneous and collaborative system, pushing decision making power down to many individuals\nworking over a \"many to many\" network - was not practical outside of the laboratory until recently.\nEven a couple of years ago, it would have been unthinkably audacious to seriously model these\ntypes of transactions. The technology was not yet mature enough; the models did not exists;\ninstitutional openness to embracing these core technologies was not yet ripe; market adoption and\nfacility with networked software - while noteworthy - was not yet sufficient to make such a system\npractical for most communities. Today, the eCommerce Architecture Program has met with much\nsuccess in finding ready partners in the public and private sectors for user-testing of our system,\nrequirements gathering and eventually for early deployments.\nClearly, the answer to Dean Mitchell's rhetorical question \"Who shall write the software that\nincreasingly structures our daily lives . . . how shall the writers of the rules be answerable\", will differ\ndepending upon the context in which it is applied. In the case of ATM software, the answer would\nseem to be that the Bank owns and controls the code. Yet, even in this context there are a myriad\nof oversight and regulatory authorities with the power to compel banks to modify the code to reflect\ncertain public policies. For example, some areas have prohibited excessive charges for the use of\nATM machines by non-card issuing banks. Predictably, banks have exercised their political power\nwith executive and legislative branch authorities and their ability to mount legal challenges through\nthe courts to fight against this lessening of fees exacted from users. In this context, as in nearly\nevery other example of private proprietary ownership of code used for serious transactions, the\nowner largely or exclusively calls the tune and the users must dance accordingly. And under this\nsystem, the market is largely working. The system of private property in code, enforced through\ncopyright, trademark, patent and trade secrets, is fulfilling the public policy deal underlying\nIntellectual Property (IP) laws. The IP owners, secure in their government enforced monopoly on\nthe code; have incentives to innovate, to invest in growing a market for the code, and in making\ncode (slowly) better. The Goods and services are ever more abundant and useful. Theoretically, in\nthe event of a truly unconscionable overreaching by code makers, users may hold the coder owner\naccountable through some legal remedy - perhaps a tort or through the intervention of a\ngovernment regulator in the public interest. There is also a theoretical connection between an\nability of users to \"vote with their wallet\" (by buying competitors code that is more suitable to their\nneeds) and thereby to hold the writers of the code \"answerable\". However, some have argued that\nthe software monopolies and other entrenched interests which largely control the market for such\ncode are only glacially moved by these types of user-accountability and responsiveness measures.\nNonetheless, this private ownership based system of code creation has no apparent superior\nalternative for most types of software. But is this the best - or even a tolerable - answer for code\nthat is used for self-governance rather than for commercial purposes?\nThe operating thesis of this semester's graduate seminar curriculum is that Open Source Code - of,\nby and for the users - is a superior approach for communities to enable their online self-\ngovernance. In this way, Dean Mitchell's challenge is answered by putting the users in control of\nthe \"law making\". This is the clearest expression of self-governance. The eCommerce Architecture\nProgram will make the final code implementing this semester's design freely available to any person\n\nPerspectives on the Central Role of Open Source Code for Participatory Governance\nPage 3 of 3\nor community via our Internet web site: http://ecitizen.mit.edu/ The Open Source code software\nlicense will require that users openly and freely share any enhancements or other modifications they\nmake to our code. Our code is expected to include and build upon other Open Source code,\npotentially including slashcode, mysql or php. The special role of self-governance and participatory\ndemocracy require that this code be subject to Open Source principles. Self-governance is a\nunique and important aspect of any free-society and open economy. The software used by a\ncommunity to self-govern itself can become inextricably tied to the autonomy of the community\nitself. The \"logical\" location (as opposed to the \"physical\" location) housing the community, along\nwith the processes of interacting and the methods by which members are \"virtually present\" in the\ncommunity are all fundamental aspects of the group. Self-governance software is unlike a physical\nbuilding in which debate and votes occur, where a community can move to a different physical\nlocation if a landlord unduly raises rent, makes unreasonable demands or otherwise fails to provide\nfor the needs of the occupants. Self-governance software, by contrast to a physical location, may\nembody the very way a community defines itself and the processes by which it exists. The software\nand surrounding technologies are the coded instantiation of the community and its laws, such as the\nbalances between privacy and authentication; the unique algorithms underlying filters and the\nhistory of user ratings and filtering results; the honed features and flows through the system\nresulting from accumulated experience of the users; and even the newly evolving parliamentary\nprocesses by which decisions are made, archived, and the knowledge managed.\nA central component of self-governance is the right to create, use and change the methods by\nwhich that governance occurs. This is the centerpiece of autonomy and sovereignty. As such,\nallowing the code that supports and reflects a community's self-governance to be owned externally\n(whether by a for-profit vendor, or any other form of private ownership based upon the proprietary\npower to exclude use except upon exaction of the terms of the owner) would permit that external\nparty to in effect govern the community through feature selection, support and enhancement\ndeterminations; pricing policy and other methods. Ownership is the ultimate trump. It provides the\nright to prevent others from using the property and the right to designate how, when and by whom\nthe property may - or may not - be used. While the policy premises favoring private property are\nwell know and certainly can be applied to such intangibles as software, databases and even\nbusiness methods, it is the contention of this academic research initiative that such property\nmechanisms are not well suited to the needs of open self-governance. For these reasons, it is\nposited as a design principle for the work of this seminar, that self-governance software is best\ndesigned to be Open Source. This emergent political philosophy enjoys echoes from debates and\ndocuments surrounding the founding of the American republic."
    },
    {
      "category": "Resource",
      "title": "F__Working_4_4285_orincip.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-285-research-topics-in-architecture-citizen-centered-design-of-open-governance-systems-fall-2002/637d32304ee129c177fe1d7a2b081fda_F__Working_4_4285_orincip.pdf",
      "content": "First Principles and Design Requirements:\nPage 1 of 1\nFirst Principles and Design Requirements:\nCollaborative Filtering & Open Source Code for Electronic Self-\nGovernance\nThere are two basic principles guiding the design of this Participatory Governance Environment: 1.\nthat collaborative filtering can be used to leap frog the barriers to very large yet effective groups of\nindividuals actively participating in the governance process; and 2. that Open Source Code can be\nused to assure ownership and control remains in the hands of those who consent to use and be\ngoverned through it. Our Design Principles Page details the reasoning and approach associated\nwith these duel imperatives.\nCollaborative Filtering:\nTheoretically, the use of collaborative filtering technologies can unleash the genius of the\ncommunity acting through all its members by availing them of simple means to express their\nreactions and preferences in a \"machinable\" manner. By \"machinable\", what is meant is that the\ndata is in a digital form and is structured in according to predictable standards. In this way, the\nresults of inputs from hundreds of thousands or even millions of people could be received, collated\nand utilized immediately - limited only by bandwidth and CPU power. By contrast, gatherings of\npeople in physical spaces to discuss, debate and reach agreement on matters is limited to hundreds\nat the most, without resort to very significant dedication of time (amounting to many days, weeks or\nlonger) and difficulty in maintaining order and flow. More information about our use of collaborative\nfiltering technologies is available on our \"Can We All Finally Talk At Once\" page.\nOpen Source:\nSelf-governance is a unique and important aspect of any free-society and open economy. The\nsoftware used by a community to self-govern itself can become inextricably tied to the autonomy of\nthe community itself. For that reason, it was decided that Open Source Code, and the affiliated\nbottom-up code generation practices, would be the best fit for this software project. The social,\nlegal, political and economic ramifications of using Open Source Code as the basis for the\nParticipatory Governance Environment are detailed in more depth on our \"Open Source and\nParticipatory Governance\" page."
    },
    {
      "category": "Resource",
      "title": "F__Working_4_4285_Overvie.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-285-research-topics-in-architecture-citizen-centered-design-of-open-governance-systems-fall-2002/a626c64a592df3bf0d93b2bc1cddfd55_F__Working_4_4285_Overvie.pdf",
      "content": "In this seminar, students will design a digital environment to house the activities of lo... Page 1 of 2\nMIT E-Commerce Architecture Project\nGraduate Seminar Series\nDigital & Physical Place, Process and Presence\nCourse Overview:\nIn this seminar, students will design a digital environment to house and facilitate self-governance in\nprivate online communities and participatory democracy in the public sector. Graduate students\nparticipating in this seminar will work as a team to 1. Develop the design concept and models of a\nParticipatory Governance Environment; 2. Create working open source code implementing that\ndesign; and 3. Work closely with stakeholders and testers as part of user-centered design for\nrequirements gathering and usability.\nThe final design and code will be generic enough to support various types of self-governing\ncommunities, from local governments to global NGO's; from Unions to Shareholders. To ground the\ndesign, Massachusetts's local form of government, known as \"Open Town Meeting\" (OTM), will be\nmodeled as an example. OTM requires all interested townspeople to get together once a year and\ndetermine basic issues like the tax rate, zoning/development questions or allowing sex education in\nschools. The thesis of this seminar is that self-governance in general - including the very old form\nof direct democracy used in Massachusetts municipalities - can be facilitated, enhanced and made\nmore broadly accessible by enabling users who are virtually present via the network to fully\nparticipate in the decision making process. A longer course announcement and overview are\navailable online.\nDesign Requirements: Electronic Self-Governance Through Collaborative Filtering & Open\nSource Code\nThere are two basic principles guiding the design of this Participatory Governance Environment: 1.\nthat collaborative filtering can be used to leap frog the barriers to very large yet effective groups of\nindividuals actively participating in the governance process; and 2. that Open Source Code can be\nused to assure ownership and control remains in the hands of those who consent to use and be\ngoverned through it. Our Design Principles Page details the reasoning and approach associated\nwith these duel imperatives. Here is our \"unofficial\" open source development page. This will be\nrefined and included on our site soon . . .\nFinal-Term Design Concept for Participatory Governance Environment\nThis is a powerpoint slide presentation of the student's final design concept for the Open\nGovernance Environment.\nMid-Term Design Concept for Participatory Governance Environment\nThis is a powerpoint slide presentation representing the culmination of student work thus far in the\nsemester. It consists primarily of scanned images of paper sketches we have assembled to rough\nout our design concepts.\n\nIn this seminar, students will design a digital environment to house the activities of lo... Page 2 of 2\nLink to Design History\nInitial sketch of some of the basic features and functions that might be present in a Participatory\nGovernance Environment (coming soon)\nFurther sketch\nFurther sketch\nFirst Visit to New England Town Meeting\nThese photographs chronicle our first field trip to a working Open Town Meeting. Thanks to the\nfacilitation of the elected Town Meeting Moderator Joe Harrington, participating graduate students\nwere able to open discussions with several active Town Meeting voting members. Some of these\nindividuals will be assisting this project as user testers and focus group participants."
    },
    {
      "category": "Resource",
      "title": "Nov05Transactions.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-285-research-topics-in-architecture-citizen-centered-design-of-open-governance-systems-fall-2002/7f458bd2426b2d4f7873d36b56dc18f5_Nov05Transactions.pdf",
      "content": "Class Notes\n- Official transactions - deconstruct systems requirements so that it works well 4\npeople.\n- 'Electronic Signature' - how do you define this?\no It's ambiguous.\no Piece of info that can identify you - but more than this.\no Highly personalized registration mark.\no Some action that you do.\no 'Common Law' definition: any symbol or method executed or adopted by\na person with an attempt to authenticate or intend to be bound by a record.\n('/S/' Dan Greenwood).\no Electronic - \"electronic sound, symbol or process attached to or logically\nassociated with a record executed or adopted by a person with the intent to\nsign the record.\"\no What if you are 'crazy'?\n- Esra article.\n- Send out media.mit.edu"
    },
    {
      "category": "Resource",
      "title": "Oct08Project.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-285-research-topics-in-architecture-citizen-centered-design-of-open-governance-systems-fall-2002/e16cff97ae0f5a3b5cae8b98b3e2e69e_Oct08Project.pdf",
      "content": "Class Notes\nWhat is the project going to be and how are the pieces going to fit together?\nShould everyone to participate on same project but different pieces?\nStelios\n- Site architecture, user interface.\n- slashdot.com\n- Pros\no bi-directional communication with users.\no filtering capabilities\n- Cons\no design - falls into 'digital newspaper' (bad)\no doesn't handle complexity well\n- the brain\n- Pros\no good overall visual info\no constant frame of reference\n- Cons\no unbalanced - upper part gets too much attention\no not dynamic - can't create own links? (not true?)\no limited game play factor\n- -source forge.net\n- Pros\no similar - all members working on same project\no something for all users - low or high tech\no any user can post project idea, others join in\n- Cons\no bad interface design - lost in information in seconds\n- smart money.com\n- Pros\no global data visualization\n- Cons\no soon lost in details - not supported\n- starry night\n- Pros\no transforms info into visual patterns (constellations)\no like brain - shows links globally\n- Cons\no non-functional - cannot find information\no no search capability\n- what kind of model to use? Community model or business model?\n- is there 'gravity' to the conversation or just 'talk'?\n- sacred obligation or they do it for themselves?\n\n- how many clicks can lead to chaos?\n- how to linearize the complexity (instead of rising quickly - exponentially)?\n- form vs. function in the design?\n- communication scheme? Synchronous - same space but different time.\n- (Dan - answers to some extent depend on the specific context that software is\nused. Start with group that already has the ability (or obligation) to make\ndecisions.)\n- Characteristics of nodes, pts on a constellation, etc.:\n- Position, size, color, texture, movement.\n- Sawako\n-\nhttp://www.theyrule.net\no corporate managers - where the donate etc.\n- sony bank?\n- starry night - type of constellations - create icon for yourself and drag/drop to\ndifferent groups - different colors of people for different groups\n- Donald\n- think about home users - have 17\" monitor - how to reduce visual clutter?\n- (will present next week)\n- (Dan - different interfaces for different parts of the site?)\n- Class - Oct 22 - with Bill Mitchell, refine into presentation to be presented on\nlaptop - any format - html, powerpoint, jpg, etc. Send Greg files a couple days\nprior - upload to a site.\n- Mitch\n- amazon.com - books to interest you. 'Filter of reason' - not relationship filters,\nbut personal issues.\n- mimesis - act of mimicry ex. Chameleon\n- doppelganger - twinning, similar to clone\n- simulacra - copy of a copy\n- World Trade Center charrette (http://www.archinode.com/WTC.html)- may not\nbe one database but draws upon the plurality of information already 'out there' on\nthe web.\n- How do you address those realms of identity in a system?\n- Esra\n- how are we going to answer mitch's questions? What is being forced on people\nand what is being made invisible?\n- interested in users - how info sharing processes work in physical world? What do\nuser see themselves as? What roles? What identities? How to prepare a\n\nquestionnaire? Interested in Town Meeting. Graduate Students in Housing is\nanother possibility (Graduate Student Council).\nJohanne\nMedia - potential for communication. Aesthetics - design aspect - visual aspect - wants\nto continue to work on Town Meeting.\n(will present next week)\nJeremy\n(will present next week)"
    },
    {
      "category": "Resource",
      "title": "Nov12Disputes.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-285-research-topics-in-architecture-citizen-centered-design-of-open-governance-systems-fall-2002/053a3d2970096cdd11611dd68975f901_Nov12Disputes.pdf",
      "content": "Class Notes\n1. LambdaMOO\nDispute Resolution:\n- Formalizers\n- Judicial Bd\n- Similar to constitutional board, bill of rights\n- Social Club, Separate Country\n- Wizards reverted to old system in 1998\n- More democratic in 1993-1996\n- Relationship between our system and physical world\n- When do you know when the proposal has been \"finalized\"?\n- Amendment process?\n2. Dan: why revert back to oligarchy? Star Trek episode (virtual war) - disconnect\nbetween pushing a button and reality. Not surprising since LambdaMOO is not real.\nUnlike real social club - people are invested in it.\n3. \"Business hates uncertainty\" - prefer stability. People don't like uncertainty.\n4. UDRP - Uniform Domain Name Dispute Resolution - first come, first served.\nTrademarks - first and right. Dog - gets two bites - then put down - next court must use\nthis as basis - common law. Not true in online dispute resolution. Arbitrators have\ncompletely different results. Makes it unpredictable. If there was, then arbitrators would\nbe coming up with rules (unelected).\n5. Wetnap - \"charity for attack on America\". Nuances are lost if devoid of context and\nyou just have the words.\n6. What sorts of rules should be considered (in the abstract)? General context:\nBill Mitchell - \"Ideas from Left Field\"\n1. Relationship between Information and Space, Decisions and Space.\n2. Networks can begin to change these relationships.\n3. Spatially distributed decision processes.\n4. Continuous spatial decision envt vs. asynchronous decision making.\nSpread across time - when is the decision point?\n5. What happens when you lay wireless technology across this?\n- Fundamental distinction in the use of space.\n- Network (Fixed Infrastructure) - get collection of points (i.e. water\nsupply) - gets uses related to them - fixed structure of distribution.\n- Digital networks similar - phones. Athena clusters.\n- Wireless gives continues fields of presence - activity no longer needs to\ncluster i.e. make a phone call. Fixed location to fixed location. Now call\n\nperson rather than a place - don't know where they are. Activity no\nlonger restricted to a place (living room, phone booth).\n- Information no longer tied to place\n6. Space/Information/decision-making\nPre-network - needed to be in space to get info (floor of parliament, in your office\nfor files, library etc). Also needed to be in right place to make decision - often to\nestablish legitimacy of decision-making processes.\nNow have network - technology not limiting factor.\n7. Often first experience = cellphone - city divided into 'cells' - base in center - get\npassed from cell to cell as you move through city. Top-down, centralized system of\ninfrastructure. (similar to other kinds of infrastructure).\n802.11b technology: spatially and politically different. Can do bottom-up\nstrategies (just hook up base station to collection). Begin to engage in very different kind\nof urban design strategy.\n1st - pts vs. continues\n2nd - how you get them set up/connected.\n8. MIT - wiring the dorms. Exacerbate 'geek' factor at MIT - not particularly social.\nIncreased roommate conflicts. Now - move away from fixed desktop to wireless laptops.\nCreates a lot of demand for informal gathering spaces - that can be appropriated. Piazza\n- tradition meeting place. When to piazza at particular time - bump into friends. Now -\ncellphones, lead to ad-hoc meetings - identify place where you can meet. Creates a\ndemand for lots of identifiable meeting places. Piazza looks the same but operates very\ndifferently - different times of day. Different social practices. New overlays on\nfunctions of space - Starbucks, airports, hotel lobbies.\n9. The decline and fall of the architectural program. Spaces - typically have fixed,\ndefined uses of space. Modern architectural plans - labeling living room, dining room,\netc. Not true of Palladio's plans. Particular activities require specific infrastructure -\nbathroom fixtures. Classroom - blackboard. Architectural program = modern idea.\nAdjacent requirements, etc. Start with program, move forward. 'Electronomadic space'\n- not necessarily the way to think about it. Ad-hoc patterns of space - almost a pre-\nindustrial occupation of space - design for the occupation of people vs. functional.\nWhat does this mean for decision-making spaces? \"Me++\"\n10. Markets - used to be a physical place - \"market\" used to be a physical place. Now -\n\"market\" not associated with place. Think about extending this same thing to decision-\nmaking process. Used to be square in front of the building."
    },
    {
      "category": "Resource",
      "title": "Nov19Digitalspace.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-285-research-topics-in-architecture-citizen-centered-design-of-open-governance-systems-fall-2002/3c93f022856a5f1a0a20d4ac2813be7b_Nov19Digitalspace.pdf",
      "content": "Class Notes\nSawako/Stelios\n- 'Rooms' - lobby, private room, registration room\n- Should there be a minimum participation standard before you can enter 'voting\nroom'?\n- Should there be a 'lobby' for each subject?\n- Should there be a timeline or countdown clock?\n- How to set an appropriate time for each issue? (Currently set one time for all\nissues)\n- 'Petition' - to extend time (OK in some parliamentary bodies, not in others).\n- How long is it extended and what % of body is needed?\nJeremy\n- 'fitness' of information\n- writer and user defined identities\n- info-peacock - less visible peacocks get suppressed - but introduction of other\nthing into the ecology (coyote?) might mean extinction.\n- having minorities (i.e. less visible peacocks) makes the group stronger.\n- what it fitness? (how decides what this is?)\nJohanne\n- use spatial metaphor\n- 'map of town hall' - takes to plan (right side) - left side = people\n- 'auditorium' - where discussion take place\nMitch\n- organic chemistry analogy - some 'nodes' that are open (actions, opinions, traits,\netc) and some are private (family, finances, ethnic, etc)\n- nodes can be many things\nenvironment's impression of your identity is part of your identity\n- 'visual lie' - misimpressions of yourself - are there 'traces' of your actions?\n- how do you recognize if you aren't acting truthfully?"
    },
    {
      "category": "Resource",
      "title": "finalslideshowS02.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-285-research-topics-in-architecture-citizen-centered-design-of-open-governance-systems-fall-2002/e9303683ad7b9a821cbf50e4ec15f5e7_finalslideshowS02.pdf",
      "content": "l online l\nMIT\nE-Commerce\nArchitecture\nProject\nOpen Governance Environment\nDigital & Physical Place, Process and Presence\n\nintroduction\n\nconclusion"
    },
    {
      "category": "Resource",
      "title": "slideshowS02.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-285-research-topics-in-architecture-citizen-centered-design-of-open-governance-systems-fall-2002/96665e918cb96dd59e4aae7d182c2c7c_slideshowS02.pdf",
      "content": "MIT ECAP\ne-commerce and architecture project\nhttp://ecitizen.mit.edu\nDigital and Physical Place, Process and Presence\n\nIntroduction\nIn this seminar, students will design a digital environment to\nhouse and facilitate participatory democracy. To ground the\ndesign, Massachusetts's local form of government, known as\n\"Open Town Meeting\" (OTM), will be modeled as an example.\nOTM requires all interested townspeople to get together once\na year and determine basic issues like the tax rate,\nzoning/development questions or allowing sex education in\nschools. The thesis of this seminar is that this very old form of\ndirect democracy can be facilitated and made more broadly\naccessible by allowing remote users to participate in the\ndecision rooms and by unleashing the right technology in and\naround those physical rooms.\nThis rough design slide presentation sketches a possible\ninterface, flow and function set for the remote users.\n\nINTRODUCTION/LOG-IN\nProvide information on purpose of site;\nallow user to access site as guest. Allow\nthem to register (linking to registration\ninformation. Log-In.\nREGISTRATION\nFill in preferences for use of site; provide\nprofile information and filtering criteria,\netc.\nyourPORTAL\nPortal which can include: Links to local\nnews,\ncollaborative\nd/or\nrsonal\nfiltering,\ntact\nst,\na\nbiography\n(optional),\nterests, privacy controls\n(log\n\nwith\nalias,\nfull\nname\nor\nanonymously) and other customization\nfeatures.\nPOST\nObjectively\nresent\nissue that\nconcerns you and your community.\nMust\npecify\ny\nof\nbject\nmatter, as a new idea, reaction to an\nidea. Anonymity function allowed.GV\nDEBATE/DISCUSS\nMembers of community can address\nthe\nraised\nsue,\npresent\ntheir\narguments for or against the proposed\nidea.\nHave\nprivate\ndiscussions.\nLimitation of 2 debate entries, no\nmore than 100 words. Here comments\nare rated (eg. 'redundant', 'uncivil',\n'agree', 'disagree') by other users and\nthen\ncollaboratively\nltered\nand\nappear in the\nckground\nection.\nAnonymity function allowed.GV\nQUERY\nSearch\nthe\nre\nte\nncluding\narchives) according to certain search\ncriteria. Anonymity function allowed.\nGU/GV\nVOTE\nIn phase 1 members vote on whether\nit should go to a vote. In phase 2,\nMembers of community can vote for,\nagainst\nor\nchoose\nto\nabstain.\nAnonymity function NOT allowed\nAPPEALS\nThis are will provide information\nfor any overturned decisions and\nprovide the related legal notes.\nGV\nMEMBER PROFILES\nCan access the member profiles from\na query or by linking from a post or\ndebate entry. NOT accessible\na\nanonymous\nlink\nrom\nGVL\nHELP\nCan post\ninquiries. Also\nprovides\ninformation on\nany function of\nthe site.\nTERMS OF USE\nRules and\nregulation son\nuse of site and\nproper user\nconduct.\nBACKGROUND\nMember of community who posts an\nissue\n\ndebate\nst\nprovide\nobjective contextual and background\ninformation. The page will feature the\nhighest\ned\narguments\nagainst\nthe\nposed\ndea.\nHave\nprivate\ndiscussions.\nAnonymity\nfunction\nnot\nallowed.\nGV\nAccessibility to Guests\nGU=Guest Usable\nGV=Guest Viewable\nGVL=Guest View\nLimited\nARCHIVE\nStorage Area of all recorded information:\npost, debate, vote results and appeals.\nan\npe\ncon\nli\nin\nin\np\nan\ns\ncategor\nsu\nis\nfi\nba\ns\nenti\nsi\n(i\nvi\nf\npost.\nfor\nmu\nrat\nand\nfor\npro\ni\n\nElectronic Town Meeting\nAn Example of embedding MSN Messenger\nChatting\nVotes\nStatistics\nCommunity\nFriend\nConf.\nTown\nMeeting\nInstant\nvoice\nfiles\nphone\nvideo\nemail\nAgree\nDisagree\nOthers\nParties\nFriends\nEtc.\nThe social interaction aspect of town\nmeetings constitutes around 80~90% of the\nmeeting.\nThe goal of embedding a synchronous or\nasynchronous interaction device is to\nenhance the experience of creating a sense\nof community.\nCommunity\n\nNEXT STEPS\nUser testing\nSoftware development (open source)\nU.I.\nPress\nAmendments Process"
    }
  ]
}