{
  "course_name": "Resolving Public Disputes",
  "course_description": "This course is an introduction to real-world dynamics of public policy controversies. Topics to be considered include national, state, and local policy disputes, such as smoking, hazardous waste, abortion, gun control, and education. Using a case study approach, students study whether and how those disputes get resolved. Students conduct debates and simulations in addition to writing a series of short essays.",
  "topics": [
    "Social Science",
    "Political Science",
    "Public Administration",
    "Public Policy",
    "Social Science",
    "Political Science",
    "Public Administration",
    "Public Policy"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nCourse Description\n\nThis course introduces students to the American policymaking process through the lens of public policy disputes. At the heart of the course are two questions: Why and how do we fight over social problems? And how do the processes we use to resolve those disputes affect the distribution of power, the use of information, and most importantly, outcomes? A key premise is that politics is largely about persuasion; thus, we begin by focusing on how people decide what they care about and how they persuade others to see the world as they do. In the second part of the course, we examine how problems get defined and solutions devised, paying particular attention to the role of values, information, and money in those processes. In Part III, we look at how public disputes typically get resolved in the U.S. - in the legislature, agencies, courts, and local forums. Finally, we consider some less traditional but increasingly popular approaches to resolving public disputes, such as direct democracy, regulatory negotiation, and consensus building. Throughout the course, we link theoretical discussions about public disputes to actual policy debates over such issues as same-sex marriage, smoking, education, terrorism, genetically modified foods, globalization, campaign finance, and pollution control. In addition to helping students understand the dynamics of policy-making in the U.S., the course aims to help students formulate and articulate - both orally in and writing - their own views about politics and how public issues ought to be resolved.\n\nCourse Requirements\n\nThis is a seminar course, so students\nmust\ncome to class prepared to contribute thoughtfully to a discussion of the assigned reading. In addition, students are required to read a reputable daily newspaper - preferably either the\nNew York Times\nor the\nWashington Post\n(student rates are available for the\nNew York Times\n). Finally, students participate in debates and simulations and write four short essays over the course of the semester.\n\nEvaluations of Student Achievement\n\nStudents are evaluated on the quality of their contribution to the class as well as on their written work. Grades are based on the following\napproximate\nformula:\n\nACTIVITIES\n\nPERCENTAGES\n\nClass Participation (Attendance is mandatory. Missed classes are reflected here.)\n\n20%\n\nFour Short Essays (Late papers lose 1/2 grade/day.)\n\n80%\n\nReading Material\n\nMost of the reading materials for the course are available on MIT server. In addition, the following book, which is required reading, is also available:\n\nStone, Deborah.\nPolicy Paradox\n. Revised ed. New York: W.W. Norton, 2001. ISBN: 0393976254.\n\nFormat Notes / Writing Essays\n\nFormat\n\nAll essays should be doubled spaced and printed in 12-point type.\n\nPage limits are firm; I will not read beyond the assigned length.\n\nMake sure that you number each page.\n\nYou do\nnot\nneed to create a cover page, but make sure your name and the date appear on page 1.\n\nUse\nreference-list format\nfor all cited work. That means that the citation in the text would look like this: (Jones 1995, 3). (You list the author's last name and the date; if you are quoting, you provide the page number; and the entire parenthetical expression appears before the punctuation.) In your reference list, which appears at the end of the document, you list the source (in this case, a book) as: Jones, Bob.\nThe Complete Works\n. Cambridge, MA: MIT Press, 1995. You can find a more complete guide to reference-list format in the\nChicago Manual of Style\n, which is available at every library.\n\nStyle\n\nUse short, simple sentences rather than long, complicated ones.\n\nUse the active voice rather than passive voice whenever possible.\n\nMake direct, concrete statements rather than vague, indirect statements.\n\nWrite for an educated general audience, not for me or for members of this class, who have read the material.\n\nAvoid jargon.\n\nAbove all, make everything you write lively and interesting!\n\nOther\n\nAll deadlines are firm. Please get in touch with me\nin advance\nif you anticipate a serious problem in getting an essay to me by the due date and time.\n\nPlease be vigilant about plagiarism, as it is an extremely serious offense and quite easy to avoid. When you quote another author, or simply paraphrase her ideas, you\nmust\ncite the source. There are no exceptions.",
  "files": [
    {
      "category": "Resource",
      "title": "peer_editing.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-007-resolving-public-disputes-spring-2005/0594474b15e5d1dd26945d637cfa8c83_peer_editing.pdf",
      "content": "11.007 Resolving Public Disputes:\nEditing Worksheet\nSpring 2005\n\nPlease fill in the following worksheet for the essay you are editing. While it is important\nto identify the strengths of the essay, it is also essential that you suggest places where and\nways in which the author can improve it. Do not be afraid to suggest major changes if\nyou perceive a serious flaw in the essay (such as key points missing, an unclear or\nnonexistent argument, illogical organization).\n\nBegin by reading the essay through once (you can mark things in pencil that jump out at\nyou). Then, go back to the beginning and proceed through the essay, doing the\nfollowing:\n\nMAJOR CONCERNS\n\nTitle. Does the author's title make sense? Does it convey the main point of the essay?\n\n--Suggest changes.\n\nArgument. Identify and mark the author's argument in the essay [ARG]. Is the\nargument stated clearly and concretely at the beginning of the essay? Is there any way\nthe author could improve the argument (e.g., by changing vague words to more concrete\nwords, by making his/her point more simply)?\n\n--Suggest improvements. (Even better, paraphrase the author's argument below,\nin your own words.)\n\nOrganization. Identify and mark the author's supporting points [PUT CIRCLED\nNUMBERS NEXT TO EACH POINT]. Does the author's argument proceed in a logical\nway? Is each point linked to the previous one? Is each point obviously linked to the\nlarger argument of the essay? (Hints: Each paragraph should make one main point; the\nremainder of the paragraph should support that point. Ideally, the author states the\nparagraph's main point in the first sentence.)\n\n--If the author's argument does not seem to proceed logically, suggest an\nalternative organization. If the author seems to have missed a key point or key\npoints, suggest what those are. Identify any extraneous--or not obviously\nrelevant--points the author makes.\n\nEvidence. Mark the evidence the author uses to support her/his claims [EVIDENCE].\nDoes the author make claims (s)he does not support with evidence but could have? Does\n(s)he rest claims on evidence that is not persuasive (e.g., incomplete, clearly biased,\npoorly documented)?\n\n--Suggest the kinds of evidence the author might have used.\n\nRebuttal. If the author rebuts the strongest counter-argument, mark that rebuttal\n[REBUT]. Has the author really chosen the strongest counter-argument, or has (s)he\ntaken on a straw man argument? Has (s)he effectively rebutted the counter-argument?\n\nConclusion. Mark the author's conclusion [CONC]. Is the conclusion provocative--that\nis, does it raise at least one thought-provoking implication of the essay's main argument?\nOr does the conclusion merely restate the main argument of the essay?\n\n--Suggest a direction the author might take in thinking of a more provocative\nconclusion.\n\nSTYLE POINTS\n\nEditing. If you have time, identify any of the following, using editing marks:\n\nRepetition/reduncancy (\"R\"); wordiness (\"W\"), vague language (\"vague\"), inappropriate\nword choice (\"wc\"); awkward phrase (\"awk\"), spelling error (\"sp\"), jargon (circle the\nword and suggest a simpler one), passive voice (\"passive\").\n\nFinally, don't forget to tell the author what you like about the essay. Write a\nsummary of your comments on the back of his/her essay, and provide your name and\nemail address so (s)he can contact you with questions."
    },
    {
      "category": "Resource",
      "title": "essay_1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-007-resolving-public-disputes-spring-2005/de65536f100f0a628a637a2a22fbec80_essay_1.pdf",
      "content": "11.007 Public Policy Disputes\nEssay Assignment #1\nSpring 2005\nDue Session 5\n\nArguably, all four of the goals we have been discussing--equity, efficiency, liberty, and\nsecurity--are at stake in formulating trade policy. How do opposing advocates define the\ngoals of globalization? Drawing on the reading and class discussions to date, write a 4-5\npage (5-page maximum, not including a page for references) essay that makes an\nargument about the debate over globalization and the appropriate goals of U.S.\ninternational trade policy. (From the essay it should be clear that you have read and\nunderstood both Deborah Stone's arguments about policy goals and the policy pieces on\nglobalization. Your goal is to use Stone's framework to analyze the globalization\ndebate.)\n\nThe bulk of the essay should consist of an analysis of the globalization debate, not an\nargument for one policy or another. However, you may conclude with a normative\nargument about what you think should be the goals of trade policy and why.\n\n--For example, you might make an argument that takes the form: \"The opposing\nsides in the globalization debate have fundamentally different views about the\ngoals of U.S. trade policy. One side thinks...\"\n\nSome hints for developing your argument:\n\n--Make sure you define what you mean by the goals you discuss.\n\n--Think about what tradeoffs are being made among goals, if any.\n\n--Remember to support any claims you make with logic and/or empirical\nevidence.\n\nStyle/Format:\n\n--Be sure to re-read the points in the syllabus about format and style and follow\nthem!\n\n--The page limit does not include a cover page (which is optional and not\nrecommended--just make sure your name, the date, and the class number is on\nthe front of the essay). The page limit also does not include the reference list--\nthat can be p.5.\n\nSources:\n\n--Sources of information on the goals of trade policy/globalization will be handed\nout in class; others are available on the MIT server for the course. You are free to\nfind other materials as well. Keep in mind, though, that the main purpose of the\nessay is to apply the concepts we've been discussing to a real policy area and, in\ndoing so, to demonstrate your understanding of those concepts. So you don't\nwant to spend too much time doing research. Your time is better spent thinking\nabout how to formulate a persuasive argument and revising your essay so that it\nconveys the quality of your thinking."
    },
    {
      "category": "Resource",
      "title": "essay_2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-007-resolving-public-disputes-spring-2005/5b56ad61aee2fabbdb871c3aff1301b5_essay_2.pdf",
      "content": "11.007 Public Policy Disputes\nEssay Assignment #2\nDue Session 12\n\nDuring the last few weeks we have focused on how participants in policy disputes define\nproblems, devise solutions to those problems, and try to attach solutions to problems in\nthe policymaking process. Write a 4 to 5-page (double spaced, 12-point type) in which\nyou make and defend an analytic (not a normative) argument about efforts by\nparticipants in the Social Security debate define the problem and link a solution to that\nproblem.\n***\nIn crafting your argument, think about what we've learned about how the policy process\nworks; how advocates use symbols, numbers, and causal stories to define problems; how\ndifferent kinds of solutions are developed; and how solutions are attached to problems.\n(Although the material we studied on policy goals is obviously relevant to this topic, it\nshould not be the focus of this essay. You may incorporate--very briefly-- relevant\nideas from the first couple of weeks of class, but please focus your energies on the\nmaterial we've been studying since you wrote your previous essay.)\n***\nThe goal, here, is to write an analytic essay, not a normative one. That is, you are\nanalyzing the debate over Social Security, not advocating one solution over another.\nYour conclusion may include speculation about what you think is likely to happen and\nwhy, or it may express your views on the debate itself, but you should refrain from\nmaking this essay an advocacy piece for one approach or another. (We can talk in class\nabout what you actually think about Social Security reform.)\n***\nAs you review your notes from the last few weeks, you should find that you have a\nsubstantial array of concepts to help you analyze the Social Security (or any other policy)\ndebate. On the specifics of this case, I have provided you with a set of easily accessible\nreferences (see the syllabus for a list of articles and the web sites where you can find\nthem), which you should read. There are also some articles on the MIT server that you\nshould read. You are free to search for additional materials, particularly recent\nnewspaper articles, but make sure you leave yourself plenty of time for crafting an\nargument, writing and editing.\n***\nRemember, the overarching purpose of this assignment is to write an interesting,\ncompelling essay (aimed at intelligent peers who are not taking this course). But an\nimportant secondary purpose is to demonstrate that you have done the reading and can\nuse the concepts we've been discussing to analyze a real policy dispute.\n***\nFinally, please review the format notes in the syllabus. And be aware that essays that\ncome in late will be marked down. Similarly, if you are not in class the day an essay is\ndue, and you do not have an excuse that has been cleared by me, your essay is considered\nlate and marked down."
    },
    {
      "category": "Resource",
      "title": "essay_3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-007-resolving-public-disputes-spring-2005/1d2738996a09a83467509ed2cc3a439d_essay_3.pdf",
      "content": "11.007 Public Policy Disputes\nEssay Assignment #3\nDue Session 20\n\nWe all would like to believe that our public disputes get resolved at least partly on the\nbasis of the best available information. Said differently, we'd like to believe that the\nmore we know about a problem, the better able we are to solve it. But we have learned\nthat policymaking is a little more complicated than that, and the process doesn't really\nlook as rational as this model would suggest. We know, in fact, that in our adversarial\nsystem disputants in public policy debates are divided by fundamentally different values\nand that they frame information in ways that are consistent with their values and their\npreferred solutions. This raises an empirical question: What role does information play in\nthe policymaking process?\n\nWrite a 4- to 5-page (5-page maximum) essay that makes an analytic argument about the\nrole of information in resolving public policy disputes. Said a little differently, your\nargument should make a claim about how information affects public policy decisions.\nRely primarily on the reading you've done and class discussions we've had since the last\nessay to construct and support your argument. Think about both the general points we've\ncovered about how decisions are made by legislators, administrators, and judges, as well\nas by local government officials. And use evidence from the cases (tax reform, spotted\nowl, desegregating schools, hazardous waste) to support your argument.\n\n***\n\nTo repeat what I've said before:\n\n- Essays are due at the beginning of class. You must be in class on time, with your\nessay, to get full credit.\n\n- Please review the format notes in the syllabus. As a reminder, I ask you to use\n12-point type and double spacing and to cite sources using a reference-list format.\nAnd please remember to number pages!\n\n- Do your best, while editing, to make your prose clear, concrete, lively and\ninteresting. If you have been struggling with your writing, make an appointment\nnow to see someone at the writing center a couple of days before your essay is\ndue. They should be able to help you edit your draft so that the final version is\nmore polished. (Remember, your audience is an intelligent peer who has not\ntaken this class, so anyone should be able to understand your essay.)"
    },
    {
      "category": "Resource",
      "title": "essay_4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-007-resolving-public-disputes-spring-2005/0c7e7e277c90e25f96fe197245ead1a2_essay_4.pdf",
      "content": "11.007 Public Policy Disputes\nEssay Assignment #4\nDue Session 25\n\nProponents of deliberative, consensus-based processes contend that such approaches can\nmitigate some of the pathologies of the conventional approaches to resolving public\ndisputes and hence improve the quality of public decisions. Given what you know about\nthe policy process, and drawing on all the material we've covered this semester, write a\n5-page essay in which you make an argument that addresses the following question:\n\nTo what extent is employing deliberative, consensus-based processes to\nresolve public disputes likely to improve the quality of our public\ndecisions?\n\nKey to making a successful argument will be your ability to (1) define what you mean by\ndeliberative, consensus-based processes, (2) differentiate these from other approaches to\ndecision making and (3) explain what you think constitutes a high-quality decision. Your\nargument will be more persuasive if you rebut the best argument(s) against you with logic\nand, if possible, evidence.\n\nIn formulating your argument, you should consider the following questions:\n\n- What are the main sources of disagreement that lead us to have public disputes in\nthe first place? To what extent are consensus-based approaches likely to\nameliorate those differences?\n\n- How do public disputes typically get resolved, and where do consensus-based\nprocesses fit into the larger scheme of public dispute resolution?\n\n- How does deliberation or consensus building change the dynamics of decision\nmaking? How do they change the outcomes of decisions, at least in theory?\n\n- Are consensus-based approaches likely to be more appropriate for some kinds of\nissues, or some circumstances, than others?\n\nAs always, please pay close attention to the format and style guidelines on the syllabus!\n(For instance, please remember that I ask you to use reference-list format, not footnotes.\nAlso, be sure to number pages and staple the final document to ensure that pages don't go\nmissing.)"
    },
    {
      "category": "Lecture Notes",
      "title": "lect_2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-007-resolving-public-disputes-spring-2005/112e324e70164e25dfc8b5e4bcb97327_lect_2.pdf",
      "content": "Judy Layzer\n11.007 Day 2 Notes: Public vs. Private\n\nTWO VIEWS OF THE ROLE OF GOVERNMENT\n\nOur discussion today will be loosely organized around the following questions:\n\n--Is being a citizen = being a consumer in the marketplace?\n\n--How do we know which problems are \"public\" problems--to be solved by\ngovernment--and which are \"private\" problems--to be solved by the market?\n\n--What do we mean by \"quality of life,\" and to what extent should we rely\ngovernment, as opposed to markets, to provide it?\n\nWhat you read for today gave you two very different views of government and, hence, of\nthe answers to these questions.\n\nMilton Friedman: A Market Model of Politics\n\nWhat is Friedman's basic argument?\n\nHow does Friedman defend this claim?\n\n--What historical evidence does he use? Is it credible? Why, or why not?\n\n--What is the logic of his argument of his argument? Is it compelling? Why, or\nwhy not?\n\nWhat, according to Friedman, is the appropriate role of government in a free society, and\nwhy?\n\n--What are his assumptions?\n\n--If we accept Friedman's argument, what sorts of things would government do?\n\nKuttner/Stone: The Polis\n\nWhat is Kuttner's argument? How does he respond to Friedman?\n\n--What assumptions does he make?\n\n--What is the logic of the argument, and what evidence does he bring to bear?\n\n--Is Kuttner's argument compelling?\n\nWhat is Deborah Stone's view of government?\n\n--What is Stone's critique of the market model of politics?\n\n--What's her alternative model--what are its features?\n\n--Is this a compelling view? Why, or why not?\n\n--How does Stone's approach change the way you think about politics?"
    },
    {
      "category": "Lecture Notes",
      "title": "lect_3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-007-resolving-public-disputes-spring-2005/e40dc72c9c9b81391985264c8df6c81d_lect_3.pdf",
      "content": "Judy Layzer\n11.007 Day 3 Notes: Policy Goals--Equity/Efficiency\n\nPOLICY GOALS: EQUITY & EFFICIENCY\n\nWhat does Stone say, in general, about such policy goals as equity, efficiency, security\nand liberty?\n\nEquity\n\nEquity concerns are at the heart of most distributive conflicts (who gets what). What\nsorts of issues involve distributive conflicts?\n\nStone points out that each of the main goals she discusses have a basic definition. What's\nthe general definition of equity?\n\nThe general definition masks some important questions:\n\n--What things are like one another?\n\n--What does equal treatment consist of?\n\nMore generally, people tend to fall into one of two camps in their views on distributive\nquestions. What are the elements of each camp's position? What are the dimensions\nalong which they differ?\n\nEfficiency\n\nWhat's a general definition of \"efficiency\"?\n\nWhat's missing from those simple definitions? What's wrong with those definitions?\n\nEquity vs. Efficiency\n\nIs there a tradeoff between equity and efficiency? How might you answer \"yes\" to this\nquestion? How might you answer \"no\" to it?\n\nCASE: WELFARE REFORM\n\nWhat is welfare, and how was the federal welfare program reformed in 1996?\n\nWhat were some of the assumptions underpinning the 1996 welfare reform with respect\nto equity and efficiency? Does it appear that those assumptions were valid?"
    },
    {
      "category": "Lecture Notes",
      "title": "lect_4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-007-resolving-public-disputes-spring-2005/98d44702b7d47e4169a8535b52748aa0_lect_4.pdf",
      "content": "Judy Layzer\n11.007 Day 4 Notes: Policy Goals--Liberty/Security\n\nPOLICY GOALS: SECURITY & LIBERTY\n\nAs was the case with equity and efficiency, we all want security, and we all want liberty.\n\nBut, as was the case with equity and efficiency, security and liberty are ambiguous\nconcepts whose meanings are defined differently by different people.\n\nSecurity\n\nWhat's a general definition of security?\n\nWhat is concealed--or fuzzed over--by that general definition?\n\nWhat do we \"need\" to feel secure? The following are examples of policy questions that\nat heart concern security:\n\nStone focuses our attention on the concept of \"need\" that underpins a yearning for\nsecurity. She explains, however, that the notion of absolute needs is a political one and\nintroduces the concept of \"relative need.\" What does this mean, and why is it relevant to\npolitics and policy?\n\nStone also introduces the concept of \"instrumental need.\" What is this?\n\nWe often justify policy in terms of future need. Such policies often come in the form of\nprotection from potential harms in the future, or protection from risk.\n\nFinally, Stone points out that some policies are aimed at addressing \"relational needs\"--\nthat is, our need for dignity, community, belonging, etc. Can you think of some examples\nof this?\n\nThe point is that these are different conceptions of need, and they lead to competing\npolitical claims about security (97). As Stone says, \"In the polis, the boundary between\nneeds and wants is unclear, unstable, and constantly contested\" (97).\n\nLiberty\n\nWhat is the conventional American definition of liberty?\n\nWhat is fuzzed over in this definition?\n\nAgain, what's important here is that what constitutes harm, and which harms we ought to\nrestrict individual liberty to protect against, are political claims.\n\nFurthermore, every decision to limit an individual's or firm's activity to protect others\nfrom harm involves a decision about equity: Whom will we protect? Who will bear the\ncost of that protection?\n\nIn reality, we as a society limit individuals' liberty far more than any simple definition of\nliberty would suggest. We limit individuals' liberty to achieve things we think are good\nfor society as a whole.\n\nTradeoffs\n\nIs there a tradeoff between security and efficiency? If so, why?\n\nIs there a tradeoff between liberty and security? If so, why?\n\nIs there a liberty-equity tradeoff? If so, why? Doesn't it depend on how you define\nliberty?"
    },
    {
      "category": "Lecture Notes",
      "title": "lect_5.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-007-resolving-public-disputes-spring-2005/e92038d7857554b65c4715d5d45f2924_lect_5.pdf",
      "content": "Judy Layzer\n11.007 Day 5 Notes: Globalization\n\nGLOBALIZATION\n\nWhat do we mean by economic globalization?\n\nWhat, according to pro-globalization advocates, are the benefits (i.e., goals) of unfettered\neconomic globalization, and what evidence do they cite to support their arguments?\n\n--Go through each policy goal (equity, efficiency, liberty, security) and lay out the\nargument and evidence used to support it.\n\nWhat, according to anti-globalization advocates, are the drawbacks of unfettered\neconomic globalization, and what evidence do they cite to support their arguments?\n\n--Go through each policy goal.\n\nHow do advocates reach such different conclusions when looking at the same data?"
    },
    {
      "category": "Lecture Notes",
      "title": "lect_7.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-007-resolving-public-disputes-spring-2005/00753d611bddcd4484ed02d25af506e2_lect_7.pdf",
      "content": "Judy Layzer\n11.007 Day 7 Notes: The Policymaking Process\n\nTHE POLICY PROCESS\n\nWhat is a model?\n\nWhy do we use models?\n\nRational Model\n\nWhat is the \"rational comprehensive\" model of the policy process?\n\nWhat is wrong with the rational model? Why is it not especially helpful?\n\nIncremental Model\n\nWhat is an incremental model of the policy process?\n\nWhat is useful about the incremental model?\n\nWhat is wrong with the incremental model? Said differently, what are its weaknesses?\n\nThe Garbage-Can Model\n\nWhat portion of the policymaking process does Kingdon focus on?\n\nWhat is the basis for Kingdon's model of the policy process?\n\nHow, then, does Kingdon model the policy process?\n\nWhat are the junctures at which the \"coupling\" of problems and policies occur?\n\nWhat are the characteristics of policy windows?\n\nWhat are policy entrepreneurs, and what are their attributes?"
    },
    {
      "category": "Lecture Notes",
      "title": "lect_8.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-007-resolving-public-disputes-spring-2005/5a337a526a516027c41c3cca1165c3e8_lect_8.pdf",
      "content": "Judy Layzer\n11.007 Day 8 Notes: Defining Problems--Symbols, Numbers, & Causal Stories\n\nDEFINING PROBLEMS\n\nWhat do we mean by the phrase \"problem definition\"?\n\nWhy do people engage in strategic representation?\n\nWhy is problem definition, or strategic representation so important in politics?\n\nSymbols and Numbers\n\nWhat sorts of things are likely to bring a problem to the attention of government officials,\naccording to Kingdon?\n\nAccording to Stone, what sorts of political decisions do indicators conceal?\n\nSymbols are central to effective problem definition. What are some aspects of symbolic\nrepresentation?\n\nCausal Stories\n\nCausal reasoning in politics is not just about understanding how things work, although\nthere are genuine struggles over this. Causal reasoning in the polis also involves\nassigning blame or responsibility, forging alliances, and distributing benefits and costs.\n\nDevising causal stories, in turn, entails strategic crafting, using symbols and numbers.\n\nWhat are the different types of causal stories that advocates employ?\n\nStone is not saying that problems don't have real causes or that advocates are just making\nthings up to suit their political needs. But she is saying that every explanation must be\nframed in order to be potent in politics. So the real question is why do some stories get\nadopted as the story, while others do not?\n\nWhat kinds of political impacts can causal stories have?\n\nThink about the different causal stories you could tell about gun control, depending on\nwhich side you are on."
    },
    {
      "category": "Lecture Notes",
      "title": "lect_9.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-007-resolving-public-disputes-spring-2005/a409816878cff1cac987e7fd90b80848_lect_9.pdf",
      "content": "Judy Layzer\n11.007 Day 9 Notes: Policy Entrepreneurs and Attaching Solutions to Problems\n\nEXPERTS/POLICY COMMUNITIES\n\nWhere do our policy solutions come from, and why do some make it onto the short list,\nwhile others do not?\n\nWhat are policy communities?\n\nWho promotes policy ideas, and why?\n\nThe process by which alternatives survive is \"evolutionary\": Ideas combine and\nrecombine, and only the \"fittest\" survive. What makes some ideas \"fit\"? Why do some\nideas survive?\n\nWhy is one idea chosen from the short list of ideas? What causes a consensus to form\nwithin a policy community around one solution?\n\nTIPPING POINTS\n\nWhat does Malcolm Gladwell say about why some ideas catch on, while others do not?\n\nHow do the concepts he describes -- about messengers, the message, the context -- help\nexplain the phenomenon of teen smoking?"
    },
    {
      "category": "Lecture Notes",
      "title": "lect_10.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-007-resolving-public-disputes-spring-2005/82e9d5a57917dd6a5abf9a60b6c6a1d9_lect_10.pdf",
      "content": "Judy Layzer\n11.007 Day 10 Notes: Defining Problems--Interests, Experts, and the Media\n\nINTERESTS, EXPERTS, AND THE MEDIA\n\nToday we're talking about the role of interests, experts, and the media in defining\nproblems in politics.\n\nUp until now, we've been talking about problem definition, but we've been pretty vague\nabout who is doing the defining and how exactly a definition gets crafted and\ndisseminated.\n\nInterests\n\nWhat do we mean by \"interests\" in politics?\n\nWhat are the implications of this definition--what do interests do?\n\nIf you have an interest in a policy, what's the first step in getting your voice heard by\ngovernment?\n\nWhy is organizing so important?\n\nWhat's the main challenge to organizing interests in politics?\n\nSo let's think about how interest groups influence politics. If interest groups' main\npurpose is to achieve their policy objectives, what sorts of things do you expect to see\nthem doing and why?\n\nWho, according to West and Loomis, is likely to be advantaged in the struggle among\ninterests to influence policy, and why?\n\nWhat, if any, are public-interest groups' advantages?\n\nWhy do politicians listen to interest groups?\n\nExperts\n\nWhat's the role of experts in all of this?\n\nThe Media\n\nWhat role do the media play?\n\nWhy are the media so important?\n\nWhat sorts of factors determine whether or not the media is likely to disseminate your\nversion of a story?\n\nCASE: HEALTH CARE\n\nUse the ideas developed in the reading so far to explain the fate of President Clinton's\nhealth care plan.\n\nWhat, objectively, was the condition of health care at the beginning of the 1990s?\n\nAs we know, deteriorating conditions are not enough to make something a\npublic/political problem. How did health care get on the national political agenda?\n\nHow did the Clinton administration define the problem of health care?\nHow did the opposition define the problem?\n\nWhat role did the media play in determining which definition would prevail?\n\nWhat sorts of proposals were floating around in the policy community in the early 1990s?\n\nThe Clinton administration put together a task force led by Hillary Clinton and Ira\nMagaziner to develop its own approach. What did this approach look like?\n\nWhat, according to the administration, were the goals of its approach?\n\nWhat was the window of opportunity the administration was hoping to capitalize on?\n\nWhy weren't supporters of the health care plan able to capitalize on this WOO--to link\ntheir preferred solution to the problem?"
    },
    {
      "category": "Lecture Notes",
      "title": "lect_11.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-007-resolving-public-disputes-spring-2005/7f0fbd1ea9a0469baafc4cc708a883a1_lect_11.pdf",
      "content": "Judy Layzer, 11.007 Lecture Notes\nSolutions--Inducements, Rules, Facts, Rights, Power\n\nSOLUTIONS\n\nPolicy instruments, as Deborah Stone points out, are ways of exerting power--of getting\npeople to do what they otherwise might not do.\n\nNote that each of the five types of solutions you read about for today is an \"ideal type.\"\nAll policy strategies combine elements of these ideal types. But dividing them this way\nis analytically useful.\n\nInducements\n\nHow would you define inducements?\n\nHow do inducements work?\n\nWhat assumptions does the theory of inducements rest on, and why might these\nassumptions be problematic in practice?\n\nKEY POINT: Incentives/inducements involve the exercise of power, notwithstanding the\nrhetoric that portrays them as non-coercive; they work by capitalizing on the weakness of\ntargets, not by empowering them: \"one party sets the terms, makes the rules, monitors\nthe other's behavior, and decides when and whether to dispense the consequences\" (271).\n\nHow do you make inducements work in the polis?\n\nRules\n\nWhat are rules? (definition)\n\nHow do rules work?\n\nWhat's a good rule? What's the tradeoff between precision and flexibility?\n\nHow do we make rules in the polis?\n\nFacts/Persuasion\n\nWhat is the relationship between facts and persuasion in politics?\n\nWhat does it mean to \"frame\" information?\n\nRights\n\nWhat is a right?\n\nHow is a legal right a policy solution?\n\nWhat are the various kinds of rights?\n\nHow are new rights \"made\" in the polis?\n\nPowers\n\nWhy do people in politics struggle over the appropriate level of government at which to\nmake decisions, or the appropriate process to use?\n\nWhat are the three different types of \"constitutional engineering?\""
    },
    {
      "category": "Lecture Notes",
      "title": "lect_12.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-007-resolving-public-disputes-spring-2005/085fb5c29de66ebc8cd9dd146f099f64_lect_12.pdf",
      "content": "Judy Layzer\n11.007 Day 12 Notes: Social Security\n\nSOCIAL SECURITY\n\nHow does Social Security work?\n\nWhat has prompted efforts to overhaul the system?\n\nWhat is the Bush administration proposing?\n\nWhat are his opponents saying/proposing?\n\nHow is each side trying to persuade you?\n\nWhat interests are on which side?\n\nWhat resources do the two sides have?\n\nWhich side is more persuasive to you, and why?"
    }
  ]
}