{
  "course_name": "Riots, Rebellions, Revolutions",
  "course_description": "This course examines different types of violent political conflict. It compares and contrasts several social science approaches (psychological, sociological, and political) and analyzes their ability to explain variation in outbreak, duration and outcome of conflict. Incidents such as riots in the U.S. during the 1960’s, riots in India, the Yugoslav wars, and the Russian Revolution, as well as current international events are discussed.",
  "topics": [
    "Humanities",
    "History",
    "Social Science",
    "Political Science",
    "Humanities",
    "History",
    "Social Science",
    "Political Science"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nPrerequisite\n\nThere are no prerequisites for this course.\n\nCourse Description\n\nThe course aims to enhance the student's ability to analyze contentious and violent political events. The first section addresses four different individual level mechanisms that drive individual participation in these events--rationality, psychological forces, social norms, and emotions. The second section examines how these individual level forces aggregate and combine. The third section applies the lessons from the first two sections to analyze variation in U.S. riots over the course of the Twentieth Century. The fourth section examines contentious events, both in violent and non-violent forms, during the course of the collapse of Communism in Eastern Europe. The fifth section discusses major social revolutions. The sixth section applies the course theories and methods to the Arab Spring and current conflict in Mali.\n\nGrading Policy\n\nACTIVITES\n\nPERCENTAGES\n\nClass attendance and participation\n\n20%\n\nIn-class quiz\n\n15%\n\nIn-class presentation of an agent-based modeling exercise\n\n15%\n\nIn-class presentation of a comparative analysis of some aspect of the Arab Spring\n\n15%\n\nFinal exam\n\n35%\n\nRequired Books\n\nThe books listed below are required reading for this course.\n\nElster, Jon.\nExplaining Social Behavior: More Nuts and Bolts for the Social Sciences\n. Cambridge University Press, 2007. ISBN: 9780521777445. [Preview with\nGoogle Books\n]\n\nJudah, Tim.\nKosovo: What Everyone Needs to Know\n. Oxford University Press, 2008. ISBN: 9780195373455. [Preview with\nGoogle Books\n]\n\nMcAdam, Doug, Sidney Tarrow, and Charles Tilly.\nDynamics of Contention\n. Cambridge University Press, 2001. ISBN: 9780521011877. [Preview with\nGoogle Books\n]\n\nSkocpol, Theda.\nStates & Social Revolutions: A Comparative Analysis of French, Russia, & China\n. Cambridge University Press, 1979. ISBN: 9780521294997. [Preview with\nGoogle Books\n]\n\nAdditional readings come from a variety of sources and are detailed in the\nReadings\nsection.",
  "files": [
    {
      "category": "Exam",
      "title": "17.581S13 Riots, Rebellions, Revolutions: Final Exam",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-581-riots-rebellions-revolutions-spring-2013/d77532870cd6df5e40006608ef443cd4_MIT17_581S13_FinalExam.pdf",
      "content": "Riots, Rebellions, Revolutions\nPolitical Science 17.581\nFinal Exam\n\nQuestion 1:\nWriting from her structural perspective, Theda Skocpol argues that \"Revolutions are not made; they\ncome.\" In explaining the outbreak and course of the Arab Awakenings, do you agree with Skocpol? Is\nshe right in some of the cases but not in others? In your answer, refer both to information on the fact\nsheet and to the short biography of Tawakkul Karman, Yemen's Nobel-prize winning \"mother of the\nrevolution.\" What is the relationship between larger structural forces and the ideas and leadership of\nindividuals?\n\nQuestion 2:\nRead the short essay by Gada Mahfud, written for the Libya Herald. Do you agree with the author's view\non the critical role of social media in the Arab Awakening? Please refer to class theories in your\nassessment of the essay.\n\nQuestion 3:\nWhy were some cases violent while others were peaceful?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n17.581 Riots, Rebellions, Revolutions\nSpring 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "17.581S13 Riots, Rebellions, Revolutions: Quiz",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-581-riots-rebellions-revolutions-spring-2013/f933e7be12660cc3f69a30705458d60f_MIT17_581S13_Quiz.pdf",
      "content": "Quiz March 7, 2013\nAfter reading the outline of events below, please address the following questions. You can write some of\nyour answers on the provided illustrated sheets.\nPuzzles to be Explained\nWhich theories from class best explain participation in Greek demonstrations? Why? Which theories are\nless useful?\nWhich theories from class best explain participation in violent protest (riots)? Why? Which theories are\nless useful?\nWhat might explain the observed mix of peaceful and violent protests?\nWhat other information is necessary to more fully answer these questions?\nField of Variation\nDecember 2008: Riot (student death)\nMay 5, 2010: 100,000+ diverse crowd, calls for nation-wide strike Riot (3 dead, fires at bank, tear gas)\nFebruary 23, 2011: 100,000 call for removal of loan program\nMay 25, 2011: Protests across Greece, diverse participation, little evidence of political party or union\norganization. Peaceful.\nJune 5, 2011: 200,000+ in Athens\nJune 28, 2011: New package of austerity measures Violence in Athens, 270 injured, vandalized shops\nJune 30, 2011: Demonstrations in Athens, other locations in Greece\nOctober 5, 2011: General strike, non-violent, only 10 arrests\nOctober 17, 2011: strikes, anarchists try to enter parliament, 1 dead\nNovember 17, 2011: 50,000 in Athens\nFebruary 7, 2012: General Strike, 80,000 against passing of austerity measures, Riot, 45 building on fire\n25 protestors and 40 police injured\n\nA\ngrap\nh ill\nustra\nting\nthe G\nDP Pe\nr Ca\npita\nin\nUS D\nolla\nrs a\nt co\nnsta\nnt p\nrices si\nnce 2000\n.\nBackground of the 2010 protests\nIn the early-mid 2000s, the government took advantage of Greece's strong economy by running a large\ndeficit. As the world economy cooled in the late 2000s, Greece was hit hard because its main industries--\nshipping and tourism--were sensitive to changes in the business cycle. As a result, the country's debt\nbegan to pile up rapidly. In early 2010 policy makers suggested that emergency bailouts might be\nnecessary.\nAusterity measures\nOn 1 May, Prime Minister George Papandreou announced a fourth round of austerity measures by the\nGreek government, described as \"unprecedented\".[ These include more public sector pay cuts, pension\nreductions, new taxes on company profits, an increase on luxury and sin taxes, and an increase of the\nvalue added tax. The proposed changes, which aim to save €30 billion through 2012, represent the biggest\ngovernment overhaul in a generation. The cuts are in line with the EU-International Monetary Fund loan\nproposals, which demand that Greece liberalise its economy.\nThe Hellenic Parliament was expected to vote on the proposed austerity measures on 6 May. New\nDemocracy, the conservative minority party, vowed to vote against the bill, but the bill was expected to\npass due to the Panhellenic Socialist Movement's large 160-seat advantage in Parliament. The\ngovernment has pleaded with demoralized staff not to retire, fearing that a surge in benefits requests could\nfurther drain the public treasury.\nIn separate votes on 29 and 30 June, Parliament approved the austerity measures.\nRelationship to the 2008 Greek riots\nThe 2008 Greek riots started on 6 December 2008, when Alexandros Grigoropoulos a 15-year-old\nstudent, was killed by two policemen in the Exarcheia district of central Athens. While the unrest was\ntriggered by the shooting incident, commentators described the reactions as expressing deeper causes,\nespecially a widespread feeling of frustration in the younger generation about the economic problems of\nthe country (partly as a result of the global economic crisis), a rising unemployment rate among young\npeople and a perception of general inefficiency and corruption in Greek state institutions.\nImage by MIT OpenCourseWare.\n\n2010 protests\nBefore 5 May 2010\nOn May Day there were protest marches in Athens and Thessaloniki, by many unions, left-wing, anarchist\nand communist party supporters. Violent clashes broke out when riot police were sent out to contain the\nprotestors.\nOn 4 May, members of the Communist Party of Greece broke into the Acropolis of Athens and hung\nbanners: \"Peoples of Europe Rise Up\".\n5 May 2010 strike and demonstrations\nIn response to the proposed spending cuts and tax increases, a nation-wide strike was called for 5 May.\nStarting at midnight, airplane, train, and ferry traffic in and out of the country ceased. Schools, some\nhospitals, and many private businesses were closed. The demonstrations are seen by some as the most\nwidespread since the end of the Greek military junta of 1967-1974.\nAn estimated 100,000 people marched through Athens, with some estimates stretching to 500,000. As\nprotests gained momentum, a large group tried to storm the parliament building in Syntagma Square in\nAthens, where they scuffled with police, causing some of the Evzones (ceremonial guards) to flee from\nthe Tomb of the Unknown Soldier. The protesters accused members of parliament of being \"thieves\".\nRiot police were able to push the crowds back with tear gas, flash bombs and smoke bombs. Nearby\nbuildings, including a finance ministry building, were set on fire. Prime Minister George Papandreou\nresponded \"Nobody has the right to violence and particularly violence that leads to murder. Violence\nbreeds violence.\"[\nProtesters set fire to a Marfin Bank branch on Stadiou Street with Molotov cocktails; witnesses said that\nprotestors marching past the bank ignored the employees' cries for help, while others chanted anti-\ncapitalist slogans. Most of the bank's employees managed to escape the burning building, but two\nemployees who jumped from the second-story balcony were injured and two women and a man were\nfound dead after the fire was extinguished. It was reported that fire crews had difficulty reaching the\nscene because of demonstrations moving through the area. The victims died of asphyxiation from toxic\nfumes when they were unable to escape from a roof exit that was blocked. They had gone to work despite\nthe general strike over fears of losing their jobs. They have been identified as Paraskevi Zoulia, 35,\nAngeliki Papathanasopoulou, 32 (who was four months pregnant), and Epaminondas Tsakalis, 36.\nPapandreou called the incident a \"murderous act\". Michalis Chrysohoidis, the Minister for the Protection\nof the Citizen, declared that \"today is a black day for democracy ... undemocratic forces have [latched on\nto] a peaceful demonstration of workers and now petrol bombs have killed three of our citizens and put an\nimmediate danger to the lives of others.\" He also stated that \"the killers will be caught and punished\naccordingly\". Police started a widespread search, with the help of closed-circuit television footage in\norder to detect and arrest the suspects. The police blamed \"hooded youth\" for the incident, while one\nprotestor who spoke to BBC blamed police brutality for the escalation of violence which was started\nwhen protestors threw Molotov cocktails at police; the police responded with pepper spray and tear gas\nElsewhere in Athens, some demonstrators threw rocks, bottles, and pieces of marble at the police.\nNumerous trash bins were lit on fire. Some broke windows, threw petrol bombs, and committed other\nacts of vandalism. Other protesters set up barricades and burned cars. Across Athens, at least 12 people\nwere injured, and more than 70 people were detained for questioning.\n\nIn Thessaloniki, 37 people were arrested as a result of the protests.\nAftermath of the 5 May protest\nOn 5 and 6 May 2010, the Hellenic Parliament passed the proposed austerity measures, claiming they\nshow the Greek government's commitment to tackling its budget deficit, amongst continued protests.\nBackground of the 2011 protests\nA\ngr\naph\nil\nlu\nst\nr\natin\ng Gr\neek\ndebt\ncom\npare\nd to the E\nurozone average\n.\n\nThe first round of austerity in 2010 failed to stop Greece's rising debt, which is expected to go up by 10%\nin 2011.\nThe memorandum signed between Greece and the IMF became largely unpopular in Greece, with some\npolls showing that 62% believe it was a bad decision. This memorandum came into action 7 October\n2011. Amid accusations that the government has not achieved its goals according to the IMF\nmemorandum, some countries in the European Union have stated that they will not be lending Greece any\nmore money if the IMF does not do so, including the Netherlands, Germany and Sweden. Some European\nofficials went so far as to say that Greece should start selling away its assets to other European nations in\norder to receive loans, and the Dutch Minister of Finance said that the Greek parliament would not like\nthis proposal and characterized the opinion of the Greek parliament as \"a sensibility\" that no one can\nconsider at this time. Meanwhile, unemployment exceeded 15%, while a large percentage of full-time\nworkers only receive the minimum wage of 592 Euros, or less. Rumours in regards to Greece's exclusion\nfrom the Eurozone also added to frustration, but these were categorically rejected by the Greek\ngovernment, the European Central Bank, the Bank of Greece and IMF-director nominee, and French\nFinance Minister, Christine Lagarde. On 29 June 2011, amid violent protests, the second austerity\npackage was passed with 155 votes in favor in the 300-seat parliament. The next day, the Office of the\nHigh Commissioner for Human Rights of the United Nations reported an independent UN expert's\nwarning that the austerity measures could result in violations of the Greek people's human rights, such as\n\"rights to food, water, adequate housing and work under fair and equitable conditions\". Meanwhile, other\ninternational media have questioned the necessity of a second austerity package, when the first one\nbrought in no results.\nApart from the economic crisis, there is also a developing political crisis in the country. The European\nCommission asked the major parties in Greece to come to an agreement in regards to the new set of\nausterity measures, but twice the major parties failed. In a poll published on 29 May 2011, the two major\nImage by MIT OpenCourseWare.\n\nparties (the ruling Panhellenic Socialist Movement and the main opposition New Democracy) gathered\nslightly under 40% of the total number of votes, with the ruling party having 19%, while the opposition\ncame first with 19.5%. In another poll published the same day, the ruling party came first with 20.7%\nwhile the opposition came second with 20.4%. According to the polls, neither of the two parties could\nform a government, even if they combined forces. The lack of co-ordination within the government (with\nconflicting government officials stating opposite 'government positions') also fueled the protests.\n2011 protests\nFebruary 2011\nOn 23 February 2011, there was a recurrence of violent protests and strikes, involving up to 100,000\npeople as German Chancellor Angela Merkel called for a renewal of the loan programme to Greece[ that\nhad been conditioned on fiscal tightening. The measures adopted by Greece were considered harsh by the\nprotesters.\nThe \"Indignant Citizens Movement\" (May-August)\nAs of 25 May 2011, there is a peaceful demonstration in Athens and other major cities, protesting the new\nausterity measures proposed by the government, in the same spirit as the 2011 Spanish protests. The\ndemonstrations include most major Greek cities:Athens, Thessaloniki, Larissa, Patras, Volos, Rethymno,\nTripoli and Kalamata. The demonstration in Athens is coordinated by the Facebook page\n\"Αγανακτισμενοι Στο Συνταγμα\" (Indignants at Syntagma). Currently, it is reported that over 90,000\npeople have registered on the page,[87] and thousands (reportedly over 30,000) have gathered outside the\nGreek Parliament in Syntagma square. The demonstration in Greece's second-largest city, Thessaloniki, is\nco-ordinated by the Facebook page \"Αγανακτισμενοι στον Λευκο Πυργο\" (Indignants at the White\nTower), and over 35,000 people have said they would 'attend' the protest. Some of the most popular\nslogans at the 25 May protest were:\n-\nError 404, Democracy was not found.\n-\nI vote, You vote, He votes, She votes, We vote, You vote, They steal.\n-\nGreece your turn has come, you have to stop burying your children.\n-\nOust! (Greek interjection of a negative nature, meaning \"leave\")\n-\nThe maid resisted. What do we do? (Reference to an alleged sex scandal involving former IMF\ndirector Dominique Strauss-Kahn)\nThis series of demonstrations differed from almost all other demonstrations in Greece's metapolitefsi era\n(1975-present) in that it was a protest organized without political or trade union affiliations.\nDemonstrators who expressed political party affiliation during the demonstrations were condemned by the\nmajority of the demonstrators, as the organizers claimed that there was no room for political affiliation or\nviolence in the demonstrations. The focus of the protesters was against the government and the current\ndriving forces of Greek politics, and the International Monetary Fund. As a response to the Spanish\nslogan \"Be quiet, the Greeks are sleeping\" (which was allegedly heard at the 2011 Spanish protests), a big\nbanner was raised in front of the Spanish embassy in Athens reading \"¡Estamos despiertos! ¿Que hora es?\n¡Ya es hora de que se vayan!\" (We've woken up! What time is it? Its time they left!). There was also a\nstrong sense of disapproval for the Prime Minister of Greece, George Papandreou, and the vice-president\nof the government, Theodoros Pangalos.\nThe demonstrations continued nation-wide for a second day on 26 May. Despite heavy rainfall in central\nAthens, reportedly over 14,000, people gathered in front of the Greek parliament for a second day in a\n\nrow. The media reported that half of the people gathered at Syntagma Square in Athens were youth,\nwhereas the other half were over 40, including families and children. In line with the Spanish quote of\n\"Be quiet, the Greeks are sleeping\" which triggered the Greek protests, two new banners appeared, one in\nFrench (Silence! Les Francais dorment! Ils revent de '68, Silence! The French are sleeping! They are\ndreaming of (May) '68) and one in Italian (Zitti che svegliamo gli Italiani... Be quiet, you will wake up the\nItalians...). An information center and a \"book of ideas\" have also been set up at Syntagma Square.\nAdditionally, a number of people were banging pots and pans. In Thessaloniki, Greece's second city and\nsecond-largest center of demonstrations, the protesters hung a huge For Sale sign from the city's main\nlandmark, the White Tower, as a protest against the government's massive denationalization schedule,\nwhich they perceived as \"selling away our country's assets\". Although the demonstrations in Thessaloniki\nwere visibly smaller on 26 May, with around 2,500 people participating, competing with a major football\ngame between the city's two major teams and the shops and markets open until late that evening. Some\npeople set up encampments\nDemonstrations continued for a third consecutive day on 27 May. Thousands of people gathered in front\nof the Greek parliament, again in heavy downpour, joined by the \"I'm Not Paying\" movement. As a\nmeans of protesting, people wearing white masks formed a human shield around the Tomb of the\nUnknown Soldier, in Syntagma Square. The demonstrations continued peacefully, and when one protester\nshouted a slogan against the police, he was heavily condemned by other demonstrators. On 27 May, the\nproceedings of the first people's assembly on Syntagma Square were published by the Real Democracy\nNow! movement. Among them:[106]\n-\nAny corrupt politician should either be sent home or to jail.\n-\nWhen we, the people, start discussions without fear, fear grips them, inside the parliament\nbuilding.\n-\nThis is not just the politician's fault. It's all our faults, with our selfish attitudes.\n-\nDemonstrations should take place every evening at 6 pm and an assembly at 9 pm.\n-\nTheir democracy guarantees neither Justice nor Equality.\n-\nThe taxation system is not the same for the rich and the poor. Equal rights for everyone.\n29 May was set as a day of peaceful pan-European demonstrations. It was estimated that the\ndemonstration in Athens alone attracted more than 100,000 demonstrators in front of the Greek\nparliament, while others put the estimates around 80,000. Demonstrations included people of all ages and\nfinancial backgrounds. The oldest person at the demonstration was a 102-year-old grandmother looking\nafter her granddaughter, who also spoke at the people's assembly in support of the demonstrations. An\nestimated 10,000 people gathered in front of the White Tower of Thessaloniki in Greece's second city,\nand demonstrations were also held in many other Greek cities.[117] Some of the most popular slogans that\nwere heard on 29 May were \"the worst form of violence is poverty\" and \"a magical night, like in\nArgentina, lets see who gets in the helicopter first!\", a reference to Argentine President Fernando de la\nRua's resignation and escape from the presidential mansion using a helicopter in 2001. Some of the\ndemands that the Real Democracy Now! movement has formulated during the assemblies at syntagma\nSquare include:\n-\nAdoption of a new constitution, written by the people and not the members of parliament\n-\nRefusal to pay debt which members of the movement consider to be odious\n-\nCancellation of the memorandum signed between Greece and the International Monetary Fund\n-\nHarder taxation on the rich.\n30 May saw continued demonstrations in Athens and other cities around Greece, although visibly smaller\nthan the demonstrations of 29 May. More than 4,000 people demonstrated in front of the Greek\n\nparliament on 30 May, with some sources claiming that over 10,000 people were present. The\ndemonstrators also set up a set of gallows in front of the parliament, demanding that those responsible for\nthe crisis be sent to justice.\n31 May marked seven days since the start of the protests, and the University of Athens hosted an anti-\ngovernment protest with the aid of famous Greek composer and anti-dictatorship fighter Mikis\nTheodorakis, while the dean of the University was also a key speaker at the event. Once the protest at the\nuniversity was over, the 10,000 protesters joined forces with the demonstrators already in front of the\nparliament, totalling between 25,000 and 50,000. The demonstrators surrounded the Greek parliament,\nmaking it impossible for MPs and workers inside the building to exit. while Eight MPs escaped through\nthe adjacent National Gardens. Later riot police created a passage in order to enable MPs to exit the\nparliament, to the loud condemnation of 1,000 protesters gathered at the side entrance.\nJune\nDemonstrations continued on 1 June. In Athens, more than 15,000 people gathered in front of the\nparliament to protest for an eighth day in a row. This time they were also joined by the Society for the\nProtection of Citizens by the Arbitration of Banks, and also a group of motorcyclists who also showed\ntheir support for the protests. Earlier that evening the riot police had closed up the streets leading up to the\nembassy of Egypt. In order to avoid being blockaded inside the parliament like on 31 May, the members\nof parliament left early on 1 June. Among thousands of protesters in Syntagma square, 32 Greek scientists\naddressed a letter to the members of parliament calling them to announce the whole truth of the situation.\n5 June was set as a second day of pan-European demonstrations and marked the 12th continuous day of\ndemonstrations. It is estimated that well over 200,000 gathered at Athens' Syntagma Square that evening\nto protest against the government. Some sources put the number of people in front of the parliament to\nover 300,000 while the organizers claim that over 500,000 people took part in the demonstration, making\nit the largest demonstration in Athens since the 1980s. At the people's assembly a direct connection with\nMadrid's Puerta del Sol was made via Skype. Some tension occurred on 5 June, as protesters were\nprevented from heading towards Syntagma Square by riot police, which had put together large metallic\nbarriers to close off streets. Police also brought a water cannon to the protests. Demonstrations also took\nplace in Thessaloniki, Patras and Heraklion, as well as many other Greek cities. Some of the most popular\nslogans of that day included:\n-\nBread-Education-Freedom - the dictatorship didn't fall in '73!\n-\nWe do not owe, we will not sell away, we will not pay.\n-\nMinister of culture, minister of censorship\nDemonstrations continued throughout June, both at Syntagma Square and other squares in cities across\nthe country. On 28 June 2011, Greek unions, including those whose members dominate the country's\nhealth, transportation, education, and government jobs began a 48-hour strike, in protest of the\ndeteriorating economic situation and suggestions on the part of the government of new austerity\nmeasures. The walkout led to the freezing of a number of public services. Journalists and a number of\nartists also stopped working in solidarity with the protest. That day demonstrations turned violent as\nprotestors clashed with police in front of the Greek parliament and other areas of central Athens. Violence\ncontinued during the night and on 29 June, the day when a new package of deeply unpopular austerity\nmeasures was passed. The police attempted to evacuate Syntagma Square of protesters, as well as other\nkey protest points in Athens, by driving through the crowds on motorbikes and throwing stun grenades\nwhile making extensive use of tear gas. Media also mention that the police used unnecessary violence\nagainst protesters. Officials from the Athens Metro also said that the police had fired tear gas inside the\n\nSyntagma Square metro station. Police also stormed Monastiraki, as well as the streets around the\nAcropolis, randomly hitting people eating at taverns and making extensive use of chemicals and stun\ngrenades. Doctors at the infirmary set up at Othonos Square said the police had attacked them using\nstones and pieces of marble. Earlier, two members of the Teacher's Association were attacked by police\nand were injured, one of them on the head. Police also tried to deny access to the square to an ambulance\nattempting to transport heavily injured civilians to a hospital. A total of about 270 people were injured on\n28 June alone, and over 500 visited the Syntagma Square metro station infirmary on 29 June. The\nMinistry of Health reported that 99 people were sent to hospitals on 29 June. The damage caused to\nAthens' historic city center is estimated to be over 500,000 euro, as shop fronts were vandalized by\nhooded youth. Three of Greece's most famous hotels located on Syntagma Square were forced to evacuate\ntheir guests and personnel in view of the uncontrollable situation, something that the media say has not\nhappened since the events of December 1944, which started the Greek Civil War.\nDespite the violent protests and use of tear gas by police to evacuate Syntagma Square the previous\nevening, peaceful protests continued on 30 June with thousands of people gathered in front of the Greek\nparliament. Demonstrations also took place in Greece's second city, Thessaloniki.\nJuly\nProtests across the country continued in July, marking 5 weeks and 2 days of protest on 1 July. Despite\nthe fact that the austerity measures had been passed, a large crowd, but smaller than on previous days,\ngathered in front of the Greek parliament to protest peacefully on 2 July.[146]\nPolitical reactions\nIn an interview for the Greek newspaper Ethnos on 29 May 2011, the vice-president of the Greek\ngovernment, Theodoros Pangalos, against whom various slogans had been shouted during the\ndemonstrations, adopted an ironic stance towards the movement. He said that \"the formation of a political\nmovement, however much the people who follow the technological trends don't want to hear this, does\nnot depend on how many 'likes' or 'dislikes' it gets on Facebook\". He added that \"movements without\nideology and organization, that is to say movements based on anger, can only lead to either an ineffective\nrelease [of tension], which at the end of the day is of no interest to the political world, or pave the way for\nan undemocratic change of regime by organized minorities\". In response, the demonstrations addressed\nmany chants to the vice-president, like \"the country is sinking, Theodore, lose some weight!\" and other\nmore vulgar ones.\nOn 29 May, the spokesman of the Greek government, Giorgos Petalotis, spoke out against Pangalos,\nsaying that Pangalos should remember that when he took part in demonstrations against the dictatorship\nas a member of the Communist Party in 1973, \"some people considered these demonstrations\nprovocative\". He furthermore added that not only does the Indignant Citizens Movement have a clear\nideology (even if it is a \"technology trend\" as Pangalos described it), but that it also \"reflects the real\nneeds of the Greek society\". He pointed out that \"denial [of the system] and no proposals lead nowhere\".\nOn 1 June, the Prime Minister of Greece, George Papandreou, commented in regards to the Indignant\nCitizens Movement saying that \"today protesters in Greece and the world are demonstrating against\nmatters of national governance which are more weak than they used to be and, despite their inner\nweaknesses, are trapped by the global powers and the changes of a global system\".\n\nOn 28 June 2011, amid violent protests in the square outside parliament, the Hellenic Parliament voted in\nfavor of passing a new set of austerity measures with a marginal majority of 155 seats in the 300-seat\nparliament. The measures themselves had attracted much criticism both from the Greek public and within\nthe country's political scene. Between June and July 2011, Panhellenic Socialist Movement (PASOK)\nwent from an 156-seat majority to a 154-seat one, while New Democracy also lost one seat.\nThe allegations of police brutality by Greek and foreign media as well as Amnesty International sparked\nheated debate in the Hellenic Parliament, with all parties in the house asking the government for\nexplanations, including MPs of the ruling PASOK party. The leader of the opposition, Antonis Samaras,\ncharacterized the situation as almost that of a \"parastate\", while George Karatzaferis of the Popular\nOrthodox Rally accused the government of \"not being able to control 200 thugs in central Athens\". The\nCoalition of the Radical Left party accused the government of \"abolishing the very principles of\ndemocracy\" and filed a complaint against the government for \"cheering while at the same time outside\nthe building tear gas was being overly used\". Members of the parliamentary group of PASOK\ncharacterized the actions of the police as \"barbaric\" Christos Papoutsis, the Minister for Citizen\nProtection, denied all accusations claiming that \"it's the police that operates, not the government\nPublic perception and media coverage\nIn a survey published in June 2011 by Public Issue on behalf of the Greek TV channel Skai, 98% of\npeople asked said they were informed about the protests. Additionally, 95% of people asked said they\nhad positive impressions about the movement. When asked about their overall opinion of the movement,\n86% replied either positive (76%) or probably positive (10%) while 6% replied negative, with an\nadditional 2% as probably negative. 35% of the people asked said they had participated in at least one\nprotest. When asked about their opinion in regards to the media coverage of the events, 53% replied\nnegative and 39% positive. 51% thought the demonstrations are a \"very important\" event, while 34% felt\nit was \"quite important\", with 12% replying they viewed it as either not very important or not important at\nall. When asked if they believe that the protests may have been politically orchestrated by a political\npower within the country, 80% replied no and 16% yes. Finally, 52% believed that the protests will bring\nresults, while 39% believed they will not.\nOctober\nOn 5 October 2011, there was a general strike. During the demonstrations police clashed with youth and\nmade 10 arrests. Police are also investigating claims by journalists that they were assaulted by police\nofficers. The police officer who assaulted the journalist was arrested, but then released on 6 October until\nconclusive evidence is found.\nThere were demonstrations in coordination with the Occupy Wall Street movement on 15 October. Only\n7,000 demonstrators, according to estimates by local media, gathered on Syntagma square in a peaceful\ndemonstration.[183] Further protests and strikes were organized for 19 and 20 October.\nThe strikes in fact began on 17 October, when the seaman's union walked off the job for 48 hours,\nshutting down the ferry services between the islands. Customs officials who clear fuel refinery deliveries\nalso held a 24-hour strike that day. The shortage of fuel and goods in the Greek islands due to the strike of\nferry and fuel services has already begun to manifest itself.\nOn 28 October (a national holiday in Greece), protests occurred nationwide. In Thessaloniki, where a\nnational military parade is held annually, protesters prevented the parade from officially taking place (the\nfirst time this occurred since the parade was first held in 1941) and shouted slogans against Karolos\n\nPapoulias,[187] the President of Greece, who was forced to leave. However, the civilian part of the parade\nalong with the conscriptees marched as planned, acclaimed by the crowd. In Athens, during the annual\nstudent parade, several schools turned their heads away from the officials present (which included Anna\nDiamantopoulou, the Minister of Education), while of the members of the band of the Municipality of\nAthens attached black ribbons to their instruments. Additionally, a crowd of people had gathered in front\nof Hotel Grand Bretagne in central Athens (close to the VIP stand) and shouted slogans against the\neconomic crisis.\nNovember\nOn 17 November, as part of the ongoing protests that led to the resignation of the Papandreau\ngovernment, over 50 thousand people marched in Athens\nDecember\nOn 6 December, to mark an anniversary of the death of Alexandros Grigoropoulos, thousands of people\nmarched on the Parliament building, throwing Molotov Cocktails at the police, who responded with tear\ngas.\n2012 protests\nOn 12 February, as many as 500,000 protesters gathered in Athens outside the Parliament House to voice\nopposition to Lucas Papademos' caretaker cabinet's austerity measures which were being debated in\nParliament. The passing of the austerity measures is a precondition for the next €130 billion lending\npackage from the European Union and the International Monetary Fund to the Greek government, without\nwhich the country would face sovereign default by 20 March. Police used large amounts of tear gas and\nflash grenades, while protesters hurled stones and Molotov cocktails. In total 45 buildings were set ablaze\nand 25 protesters and 40 officers were injured. The protests had been preceded by a 24-hour nationwide\ngeneral strike on 7 February, when the two largest labour unions in Greece said the proposed measures\nwould \"drive Greek society to despair.\"\nSpeaking to members of Parliament, Papademos called for calm and urged members to pass the plan\nwhile asserting that violence and vandalism had no place in democracy. He also stated to the lawmakers\nthat if the majority of them chose to vote against the austerity measures there would be several onerous\nconsequences, including that the government would not be able to pay the salaries of its employees. On\n13 February, the Greek Parliament subsequently approved this latest round of austerity measures by a\nvote of 199 to 74. On 20 March, the government finally announced they have defaulted and rejected\nanother package from Brussels Bailout and are starting to reform the system. April 5, People once again\nrose up against the government after a pensioner named Dimitris Christoulas committed suicide by\nshooting himself, refusing to share the fate of those people who have had to search for food in garbage.\n\nMuller and Opp Public Goods Model\n\nThe full model, including public goods and soft selective incentives may be written as\nE(R) = (pg + pi)V + E(F) + E(A) + E(O) - E(Cr)\nwhere E(F) is the expected entertainment or \"fun\" value of participation in rebellious collective action;\nE(A) is the expected social affiliation value of participation; and E(O) is the expected value of conforming\nto behavioral norms of important others.\n\nDavies J-Curve\nA\nmodel with\ntwo\nperpendicular\nlines labeled\nSatisfaction and\n\nTime, with t\nhe words Expectations, and Reality on lines springing from the center.\n}\nImage by MIT OpenCourseWare.\n\nA\nfigur\ne\n\nw\nith the\nwords Emot\nion, A\nction,\nBe\nli\nef\n, Desires, and Information connected by arrows.\n\n(c) Cambridge University Press. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\nA figu\nre with the\nwords\nAction\n,\nBe\nli\nef, Desires, and Information connected by arrows.\nImage by MIT OpenCourseWare.\nImage by MIT OpenCourseWare.\n\nA\n\ng\nr\na\np\nh\n\ni\nl\nlu\nst\nra\nti\nng\nthe\ncr\nop\nyie\nlds\n\na\nn\nd\n\nc\nl\na\ni\nm\ns\non p ea sa nt i\nnc\nom\ne.\n\nImage by MIT OpenCourseWare.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n17.581 Riots, Rebellions, Revolutions\nSpring 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}