{
  "course_name": "Sailing",
  "course_description": "The purpose of this class is to tell you something about our Tech Dinghy and how to sail it. This OCW site is arranged as a series of skills, explained both with lecture notes and videos. Please do not think of these skill checks as tests, but instead, as measures of your understanding of our sport. We don’t expect perfection from our beginners, but only that our members be able to safely handle the boats and themselves on the Charles. For those who wish it, there will be much more that can be learned about other boats and other waters, but what can be learned here will provide the basis to build on. For more detail, a text on sailing the Tech Dinghy is provided in the readings section.",
  "topics": [
    "Health and Medicine",
    "Physical Education and Recreation",
    "Health and Medicine",
    "Physical Education and Recreation"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 session / week for 6 weeks, 1 hour / session\n\nThe purpose of this class is to tell you something about our Tech Dinghy and how to sail it. This OCW site is arranged as a series of skills, explained both with\nlecture notes\nand\nvideos\n. Please do not think of these skill checks as tests, but instead, as measures of your understanding of our sport. We don't expect perfection from our beginners, but only that our members be able to safely handle the boats and themselves on the Charles. For those who wish it, there will be much more that can be learned about other boats and other waters, but what can be learned here will provide the basis to build on. For more detail, a text on sailing the Tech Dinghy is provided in the\nreadings\nsection.\n\nAbout the Instructor\n\nFran Charles is the Sailing Master at the MIT Sailing Pavilion. Fran has been instrumental in organizing New England Intercollegiate Sailing. He served multiple years as the scheduling coordinator and the graduate secretary.\n\nLiving in Marshfield with his wife, Susan, and four children, Fran remains an active competitor in Star boats. This summer he vied for a position on the U.S. Star team at the 2000 World Championship with an eye towards the U.S. Olympic trials.\n\nFran graduated from Tufts University in 1980. During his four years at Tufts, Fran was a member of the Tufts team that went to the National Championships in both dinghies and team racing. During that time he was a member of the U.S. Olympic 470 team winning U.S. and North American titles, went to the Pan American Games and won a Silver Medal as well as finishing 4th, 6th and 8th in World Championships. He has won both the Interclub Frostbite Dinghy Nationals and the 210 Class Nationals twice.\n\nFran was the recipient of the 1998 Distinguished Service to Sailing Award given by the Mass Bay Sailing Association for his contributions to the sport as a volunteer, professional and competitor.",
  "files": [
    {
      "category": "Resource",
      "title": "Sailing and the Tech Dinghy: Instruction Manual",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/pe-810-sailing-spring-2007/f7fdc138336e2a0437c598c7f789d6d8_booklet.pdf",
      "content": "Technical information supplied by\nHarold \"Hatch\" Brown, MIT Sailing Master;\nMITNA Staff; and Members.\nPrepared by J. Bisbee, P. Halloran and N. Larkin.\nLATEX edition by Patrick Lam, starting from Nondini Naqui (Wellesley '02)'s HTML edition.\nPublished 1 April 1981\nRevised 1 April 1995\nMassachusetts Institute of Technology\nCambridge, Massachusetts\n\nContents\nForeword\nThe Tech Dinghy\nThe Charles River Basin\nBasic Sailing\nThe Wind\nSail Trim\nHelming the Boat\nTrimming the Boat\nTacking and Jibing\nBeating to Windward\nGetting out of Irons\nShoving off or Landing at the Dock\nThe Centerboard\nCrew's Position in the Boat\nPoints of Sailing\nA Few Odds and Ends\nThe Basic Course\nRules of the Road\nPrecautions (from Provisional sheet)\nMan Overboard Procedure (Fig. 6)\nA short list of Nautical Terms\nAnchors\nFittings\nAnchoring\nWhipping and Splicing\nSome extra tips that may help\nKnots\n\nForeword\nthe most popular of the college racing classes.\nThe fittings and adjustments on the Tech per-\nThe purpose of this booklet is to tell you some\nmit the skilled sailor to fine tune the boat for\nthing about our Tech Dinghy and how to sail\ntop performance. The Tech is so well balanced\nit, and specifically to provide you with the in-\nit is possible to sail the boat without a rudder\nformation necessary to pass the Nautical As-\nwith only minute adjustments to trim.\nsociation's Provisional, Crew and Helmsman.\nPlease do not think of these skill checks as\ntests, but instead, as measures of your under\nstanding of our sport. We don't expect per\nThe Charles River Basin\nfection from our beginners, but only that our\nmembers be able to safely handle the boats and\nFew colleges have such a charming body of wa\nthemselves on the lake. For those who wish it,\nter right on campus. The Charles was the birth\nthere will be much more that can be learned\nplace of intercollegiate sailing, and there isn't\nabout other boats and other waters, but what\na similar body of water anywhere in the world\ncan be learned here will provide the basis to\nwhere more people have learned to sail. The\nbuild on.\nriver isn't always as clean as we would like, but\nit is not as bad as some would have you believe.\nThe river is cleaner than it was 10 years ago\nThe Tech Dinghy\nbut not as clean as it will be 10 years from now.\nIt is justifiably famous, however, for its shifty\nThe Tech was designed specifically for MIT\nwinds. The many buildings that surround us\nby Professor George Owen, and the first boats\nplay strange tricks with the wind, but few re-\nwere made for the opening of the Sailing Pavil\nalize even this is somewhat offset by the little\nion in 1935. These boats were build of wood,\nknown fact that Boston is one of the windiest\nlapstrake construction by the famous Her-\ncities in the United States -- far windier than\nreshoff Yard in Bristol, Rhode Island.\nThey\nChicago, the \"Windy City\".\nfeatured a movable mast so they could be ei\nther sloop or cat rigged. A large half model of\nthese early boats still exists in the stairway at\nthe Pavilion. In 1953 the first fiberglass Techs\nBasic Sailing\nwere build by Beetle Boat of Cape Cod, and\ntheir construction marked a pioneering effort\nThe basic concept of sailing is quite simple,\nin this material that would soon take over the\nand sailing is something many people learn by\nboat building industry. These boats had a rel\nthemselves through trial and error. Young chil\natively low freeboard and were famous for their\ndren are often the quickest to learn, because\nrugged construction. Our present Techs were\nthey do not try to complicate matters. It will\nbuilt in 1993 by OSP Composites of Wiscon\nbe easier to discuss what is involved, however,\nsin, and the design was modified by yacht de-\nif we use some standard nautical terms and the\nsigned Halsey Herreshoff, grandson of the orig\nspecific names for the parts of the boat. Re\ninal builders. The boats are 12 1\n2 feet long, cat\nfer to the 'Short List of Nautical Terms' at the\nrigged, weigh about 200 pounds, and represent\nback of the booklet and figures 1 and 2 for clar\nthe best technology in heavy duty fiberglass\nification. Don't try to completely absorb all of\nconstruction. Although it is designed as a be-\nthe material at once, but instead get some on-\nginner's boat and for casual recreational use,\nthe-water experience. You can then come back\nthe Tech is a popular boat for racing and one of\nto this material for a fuller understanding.\n\nFigure 1.\n\nFigure 2.\nIn its simplest form, to sail you do little more\nthan point the boat where you want to go and\npull in the sail enough to keep it from luffing\n(i.e., keep it from shaking like a flag).\nIt is\nnot possible to sail straight into the wind, so if\npulling in the sail does not stop the sail from\nluffing, the bow of the boat must be turned\nfurther away from the wind direction. When\nthis is done the sail will automatically seek the\nleeward side of the boat (the side away from\nthe wind). As you can see, it is important that\nyou keep track of the wind at all times, partic\nularly what your course is relative to the wind\ndirection. Each change of the wind's angle to\nthe boat requires a sail adjustment.\nThe Wind\nSince the sailboat can not sail directly to\nward the wind, and because all our maneuvers\nshould be thought of in relation to the wind di\nrection, our first step is to determine the exact\ndirection the wind is coming from. Wind di\nrection can be determined in many ways; flags,\nsmoke, ripples on the water.\nBut the most\ncommon method is by watching your telltales\n(pieces of yarn or other light material fastened\nto the wire stays). The exact angle of the wind\nto your boat is something you must be aware of\nat all times if you are to intelligently and safely\nmaneuver your boat. Every few moments you\nshould be rechecking the wind's relative angle\nto your boat. Although you may be using your\ntelltales most of the time, it is also important\nto watch the water upwind so you will have ad\nvance warning of a change in the wind direction\nor strength. An added puff of wind will darken\nthe surface of the water, and you will be able\nto watch the progress of the pufftoward your\nboat.\nIn this way you can be ready to take\nappropriate action.\nSail Trim\nThe proper sail trim is to have the sail pulled\nin only enough to prevent luffing.\nThe sail\nworks like a bird's or an airplane's wing in that\nthe wind flows into the sail over the leading\nedge (the luff of the sail), and the wind is bent\nslightly as it flows along the curved surface of\nthe sail and out over the back edge (the leech\nof the sail). When the sail is pulled in enough,\na force is formed on the leeward side of the sail\nas the wind speeds up over the curved surface.\nThe centerboard negates the sideway portion\nof this force, and the boat is driven forward\nthrough the water. Luffing occurs when the\nsail is not pulled in enough, and it may result\nin the whole sail shaking if the sail is all the\nway out, or it may be only a gentle pulsing of\nthe sail in the center of the luff of the sail when\nthe sail is almost (but not quite) in enough.\nSince luffing starts at the luff of the sail, and\nthe last point to stop luffing is the luff of the\nsail, this is an important spot to give your at\ntention. You will find the sail must be kept\nwell in toward the centerline of the boat when\nthe wind is coming from the forward part of\nthe boat, and can be, and should be, well out\nwhen the wind is toward the back, or stern, of\nthe boat. Remember, the sail should only be\npulled in enough to keep it from luffing. To\npull the sail in beyond this point will break up\n\nthe wind flow on the leeward side of the sail\nand cause undesirable side effects.\nIn a very strong wind it may be necessary to\nease out the sail a few inches and sail with a\ncontrolled amount of luff in the forward part of\nthe sail to avoid excessive heeling to leeward.\nIt may also be necessary to temporarily let the\nsail out even further if you are tipped quickly\nin a strong puff of wind.\nHowever, keep in\nmind that a little tipping is natural, and if you\nare too timid and luff the sail too much to the\npoint where the boat is not moving forward\nthrough the water, you will lose your ability to\ncontrol the boat's course.\nHelming the Boat\nSteering the boat takes a little practice before\nyou really feel comfortable. You will quickly\nlearn you must move the tiller the opposite way\nfrom the way you would like the bow to go.\nThe best way to get started is to pick a course\nthat will take you at right angles to the wind\ndirection and pick a target on the far shore\nto aim at.\nThis would be sailing on a beam\nreach. Sit on the windward side of the boat\n(the side the wind is coming from - also the\nside opposite the sail) so you can see the luff of\nthe sail and also balance the natural tendency\nof the wind to tip the boat to leeward. Also sit\nfar enough forward in the boat so the tiller will\npass by your body as you move the tiller from\nside to side. A good spot to sit is on the thwart\nwith both feet in back of this seat. If the wind\nincreases and the boat tips to leeward you can\nmove to sit on the gunwale (side). How the\nboat sits in the water will have a strong effect\non how the boat steers, so perhaps we should\ndiscuss \"Trim of the Boat\".\nTrimming the Boat\nThe stability of our small sail boat depends\nlargely upon the weight of one or two people\nsailing in the boat as ballast and working to\nbalance the pressure of the wind on the sail.\nWithout this additional weight of people, the\nboat itself would not have the stability to sup\nport the sail even in a very light breeze. The\nalmost constant shifting of your body position\nas you maneuver the boat is essential to skill\nful sailing. Watch to windward for the dark\npatches where fresh puffs of wind darken the\nwater with small ripples. These give advance\nwarning to the skipper of increased winds soon\nto reach his boat. An alert skipper is always\naware of what sort of winds will strike his boat\nin the next few moments.\nThe athwartship level or side to side trim\nof the boat particularly, (and the fore and aft\nlevel to a lesser degree) has a very noticeable\ninfluence on the steering and balance of our\nboat. If the boat tips down to leeward slightly,\nthe boat will have the desirable tendency to\nturn toward the wind, called weather helm.\nIf the boat is tipped more, this tendency in\ncreases to an undesirable degree and excessive\nrudder angle must be used to keep the boat on\na straight course. The boat is said to have a\nheavy weather helm or too much weather helm.\nConversely, if one heels the boat to windward,\nthe boat has a tendency to turn away from\nthe wind or create a lee helm which is con\nsidered undesirable at all times. Remember -\nif the boat is tipped either way, you must re\ntain a hold on the tiller or the boat will spin\naround.\nIf you should panic at the tipping,\nyou need only to let go of the sail to equalize\nthe situation. The alteration in steering forces\nis of course influenced by the distorted shape\nof the immersed part of the hull as well as by\nthe greater turning forces on the sail due to\nthe increased inclination from the supporting\nhull.\nTo become familiar with this effect of\nshifting weight, experiment with your weight\nin different positions on some of your early\nsails. Move your weight to windward or lee\nward and adjust your sail trim to control the\nhelm. You will soon become familiar with the\neffect of heel on the pressure against the rud\n\nder and learn to anticipate and compensate in\nstinctively and thus become a better helmsman\nvery early. The skipper should never sit on the\nstern flotation tank as his weight is too far aft\nfor proper balance, and he is in the way of\nhis tiller and cannot easily steer a course to\nleeward without jamming the tiller against his\nbody.\nTacking and Jibing\nIf you started off across the river or lake on a\nreach as we suggested for your initial sail, you\nwill eventually reach a point where you must\nturn and head back. If the turn changes the\nwind from one side of the boat to the other,\nyou will have tacked or jibed. It will be a tack\n(also called coming about) if you turn the bow\nof the boat through the eye of the wind, and\nit will be a jibe if you turn the stern through\nthe eye of the wind. Since the sail reacts quite\ndifferently to the two types of turns, it is of\nthe utmost importance that you know which\nmaneuver you are performing.\nIn a small boat such as the Tech Dinghy, the\ntack is a safer maneuver so you should start\nwith the tack rather than the jibe. The closest\nangle you can expect to sail toward the wind is\na 45* angle, so to perform a tack you must turn\na minimum of 90* to complete the tack. If you\nare going from a beam reach in one direction to\na beam reach in the opposite direction, a 180*\nturn will be required.\nSince the sail will be\nluffing during most of the tack it is important\nthe boat have good speed (relative to the given\nwind speed) through the water. If the sail is\nwell out or luffing, trim the boom into the back\ncorner of the hull if you can do so without caus\ning excessive tipping to leeward. Ideally the\nsail should be trimmed as the turn into the\ntack is started, however, during the learning\nprocess it would be permissible to trim in first.\nEase the tiller to leeward to start the tack, but\nkeep your body weight to windward initially to\navoid throwing the boat out of balance. Watch\nthe sail and when the boom starts toward you,\nduck under the boom and move toward the new\nwindward side by standing momentarily and\npivoting around facing the bow (it is impor\ntant to be able to watch the luffof the sail and\nsee just where your bow is pointing).\nBring\nyour hand holding the sheet (the rope which\ncontrols the sail) behind your back to collect\nthe tiller, letting the sheet slide through your\nhand and maintaining only enough pressure on\nthe line to keep it from running out. Do not\nstraighten the tiller until the sail stops luffing\nor until the boat swings further to some point\nyou now wish to head for. Straightening the\ntiller before the sail stops luffing will leave the\nboat stuck in irons (stopped headed into the\nwind). Failure to straighten the tiller after the\ntack will cause the boat to keep turning un\ntil it jibes. After the tack, adjust your weight\nfor good boat trim and take the sheet in the\nforward hand, and adjust the sail to assure it\nis properly trimmed for the course you have\nselected (so it is just on the verge of luffing).\nJibing is the opposite of tacking, and as we\nsaid earlier, involves a turn that moves the\nstern through the eye of the wind. Unlike the\ntack, the sail will cross quickly to the new side\nwithout any luffing, and in a strong wind this\nsudden change of wind pressure from one side\nof the boat to the other can cause a capsize\nif precautions are not taken. Also, unlike the\ntack, a large change of course is not necessary\nfor a jibe to occur. If the boat is already sail\ning on a run (a course where the wind is at the\nstern) a change of course of a few degrees - or\na wind shift of a few degrees, can cause a jibe.\nTo perform a controlled jibe, move the tiller\nto windward (away from the sail) and imme\ndiately reach around behind your back with\nthe forward hand to hold the tiller to wind\nward.\nAt the same time move your weight\nto the centerline of the boat again facing to\nward the bow. The maneuver of moving your\nweight can be done with you in a deep knee\nsquat, thus keeping your head low and out of\n\nthe way of the boom.\nAs you become more\nconfident, you can stand and duck at the ap\npropriate time and be in a better position to\nmove your weight to keep the boat level. In\na larger, more stable boat you would trim the\nsail all the way in and ease it out again on\nthe new leeward side to cushion the shock of\nthe boom snapping from one side to the other.\nIn a boat as small as the Tech, trimming the\nsail more than half way in may cause excessive\ntipping to leeward, however, it is desirable to\ntrim the sail half way in so the wind can get\nbehind the leech of the sail and force the sail\nacross without your having to sail too much\nby-the-lee (where the wind is striking the lee\nward side of the boat). You should watch the\ntelltale on the stay to see when you are by-\nthe-lee and watch the leech of the sail since it\nwill fold toward you just before the boom is\nblown across. If it is quite windy, get the tiller\nback to the centerline of the boat as soon as\nyou see the sail start to move across so you will\nnot end your jibe on a beam reach and conse\nquently be tipped excessively to leeward. Also\nease out the sail as soon as it crosses the boat\nto prevent tipping. After the jibe, adjust your\nweight for good boat trim and also check your\nsail for proper trim.\nBeating to Windward\nTo take a boat upwind is the most demanding\ntask for the sailor. In a race, this is the leg\nwhere the good sailors will most easily move\npast the beginners. We already know we can\nnot sail closer than 45* to the wind direction,\nso if our destination is somewhere upwind, we\nmust sail close hauled on one tack then come\nabout and continue close hauled on the new\ntack. Sailing close hauled is different from all\nother points of sailing because the sail is set at\na particular place over the boat and the whole\nboat is moved toward or away from the wind\nto keep the sail on the verge of luffing.\nFor\nthe Tech, the end of the boom should be kept\nover the stern corner, perhaps where one end\nof the traveler line comes through the stern\ndeck. If the wind is very light, it will be bet\nter to keep the boom further outboard of this\npoint, and if the wind is stronger, the boom\ncan be trimmed inboard of this point if you\ncan hike the boat down and keep it from heel\ning excessively to leeward. For any given wind\nstrength, it is while close-hauled that you will\ntip the most. Learn how to hook a toe under\nthe thwart seat so you can hike (lean out) and\napply some leverage to hold the boat down.\nPerhaps now is the time to start using the tiller\nextension (Figure 1) so you can get your weight\nover the side and still keep the tiller near the\ncenterline of the boat. The tiller extension is\nnot recommended for your early sails because\nit can get caught in various places and interfere\nwith your steering. However, once mastered,\nthe tiller extension is a valuable tool and es\nsential in boats like the Larks and Lasers used\nat MIT.\nIn a puff it may be necessary to spill some\nwind by easing out the sail to avoid exces\nsive heel or weather helm.\nOnce the puff\nhas passed, or you have moved your weight\nto windward to offset the force of the wind,\nthe sail must come back in if you expect to\nsail your highest possible course at maximum\nspeed. Furthermore, the luff of the sail must\nbe watched about 90 percent of the time and\nthe tiller kept in constant but gentle movement\nas you seek the optimal course. You will soon\nlearn that minute changes of course as well as\nminute changes in sail trim (even as little as 1\ninch) can be major factors in performance.\nGetting out of Irons\nIn irons or in stays is the condition where a\nboat is luffing in the wind without forward mo\ntion and, therefore, without ability to steer or\nwithout steerage way.\nTo get a boat out of\nirons, push the tiller toward the side in which\nyou want the bow to turn and wait for the boat\n\nto make sternway, then steer the boat out to a\ncourse where the sail can be trimmed. Stern-\nway can also be started by holding the boom\nout over the side into the wind. You can also\nuse the rudder as a paddle to give you headway\nby making quick movements to one side or by a\ncombination of both. It should be evident that\nforward or backward movement of the boat is\nnecessary to get response from the rudder.\nShoving off or Landing at\nthe Dock\nWhen the Tech is at the front of the dock, it\nshould be headed along the dock in the direc\ntion that allows the bow to be pointed closest\ninto the wind and with the sail luffing.\nTo\nget away from the dock, check the wind to see\nwhere you must head to be able to fill the sail,\nand determine what will be the windward side\nso you will know where to sit. Get the boat\nmoving along the dock so the tiller will work\nand steer onto the course you have determined\nis necessary to fill your sail. You can start by\nsitting in the boat and pulling yourself along to\nget some speed while you steer away with the\nother hand, or you can stand on the dock hold\ning the stay, take a few steps along the dock\nto develop speed, giving one final push out as\nyou step into the departing boat. As you might\nimagine, the latter method takes a little more\nagility and understanding of the hull's stabil\nity. Keep your sail luffing until the momentum\nof your push carries the boat to a course which\nwill allow the sail to seek the leeward side.\nTo make a landing, you must again carefully\ncheck the wind on the club's flag to determine\nwhich direction is most upwind. Approach to\nthe leeward side of the spot you expect to land\nin so you will have room to turn up into your\nspot. Since you have no brakes, you must be\nprepared to luffyour sail to slow down. If you\nmisjudge when to let out the sail and let it\nout too soon (and lose your headway before\nyour destination is realized), you will lose the\nability to steer. Try to touch the dock with the\npart of your hull where the stay goes through\nthe gunwale, and as soon as you touch, move\nthe tiller away from the dock to increase the\nfriction and thus stop the boat quicker. A final\nword of advice avoid the tendency of making\nyour turn too early and thus using up all your\nturning room. Also, in the first few landings,\nselect a spot with plenty of room on either side\nin which to land.\nThe Centerboard\nThe hull of the boat has a flat and compar\natively wide immersed underbody which re\nquires a retractable blade, called a centerboard,\nto prevent the boat form sliding sideways and\nto force the hull to progress forward when wind\npressure is applied through the sails.\nThis\nboard may be left lowered at all times while\nlearning to sail, however, it is usually retracted\npartially or wholly when sailing off the wind\nwhen racing to reduce the resistance or drag\nand increase the boat's speed.\nThe center\nboard may also be raised slightly to adjust the\nbalance between sail and underwater shape to\nmake steering easier. The novice should leave\nthe centerboard down until he has mastered\nmore important details of sailing. Raising the\ncenterboard will increase rolling and reduce the\nboat's stability.\nLarger boats, such as MIT's Rhodes 19's,\nhave a fixed keel in place of the centerboard.\nThis heavy keel gives the boat the additional\nadvantage of much more stability and makes\nit difficult to capsize. It has the disadvantage\nof making the boats difficult to take out of the\nwater.\nCrew's\nPosition\nin\nthe\nBoat\nThe crew should sit forward of the cross seat\nor thwart but preferably fairly close to it since\n\nweight in the bow or narrow part of the boat\ndepresses the bow, makes the boat harder to\nsteer, and also allows waves to slap in. If two\npersons are carried besides the helmsman, they\nshould sit on the floor on either side of the cen\nterboard with their backs resting against the\nseat. Their weight will then be in the center\nof the boat and evenly dispersed. If a single\ncrew is carried in light air, his weight probably\nwould be best to leeward (the side the sail is\ncarried on), but in a stronger wind he should\nmove across to help keep the boat heeled only\nslightly to leeward.\nPoints of Sailing\nThe points of sailing (shown in Figure 3) are\nterms of general reference with the wind at dif\nferent angles to the centerline of your sailboat.\nThe purpose of this section is to provide a re\nview of earlier instruction and an overview of\nthe basic concepts. Starting with the No. 1\nposition, the boat is shown headed into the\nwind with the sail luffing as it would be when\nat the mooring. The boat in position No. 2\nis sailing as close to the wind as possible, ac\ntually 45 degrees from the wind direction or\naxis. When sailing close hauled (position No.\n2) the sails are hauled in to the stern corner of\nthe boat as far and as flat as possible and still\nhave draft (curve) enough to propel the boat.\nSince the sail luffs when the boat reaches 45\ndegrees from the wind's axis, it is evident that\nthere is a total angle of 90 degrees in which it\nis not possible to sail. To reach a destination\nin this quadrant it is necessary to make a se\nries of tacks with the wind first on one side of\nthe boat then on the other, zigzagging at an\ngles 45 degrees from the wind's axis. This is\ncalled beating to windward and the boat is said\nto be close hauled or on the wind. The tech\nnique used in sailing to windward is to leave\nthe sail trimmed in the same position over the\ncorner of the stern and adjust the course of\nthe boat to any variations in the wind's direc\ntion while keeping the sail at the luffing point.\nThe sail should be let out only if the boat tips\nexcessively to leeward. The boat in position\nNo. 3 is reaching with the wind at right angles\nto the boat's course. The point of sailing is a\nbeam reach and is off-the-wind or sailing free.\nThe technique for sailing a course is to keep\nthe boat on a straight course and adjust the\nsail until it is trimmed in just enough to keep\nit from luffing. Luffing will start at the section\nof the sail near the mast and it is this section\nwhich must be watched closely. To check sail\ntrim, let the sail out until it starts to luff and\nthen trim it in only enough to stop luffing. The\nsail is adjusted to variations in the wind's di\nrection and the course is kept steady. It should\nbe noted that in the case of boat No. 2, sail\ning to windward, close hauled, the course of\nthe boat is altered with the variations in the\nwind's direction while in the case of boat No.\n3, on a reach, the trim of the sails is altered\nand the boat's course held steady. In both in\nstances the luffof the sail near the mast is kept\njust at the luffing point. Boat No. 4 is headed\non a course 135 degrees away from the wind's\naxis with the wind blowing over the stern quar\nter. This point of sailing is called broad reach\ning and may also be designated as off-the-wind,\na term used to designate all courses not close\nhauled.\nPosition No.\n5 shows the boat sailing di\nrectly before the wind. Since the wind's axis\ncorresponds with the centerline and course of\nthe boat, the sail could be carried on either\nside. The maneuver of changing the sail from\none side to the other is called jibing (also gy\nbing). Jibing is accomplished by moving the\ntiller away form the sail and trimming in the\nsail and then letting it run out quickly on the\nother side. When the wind is blowing slightly\nover the same side that the sail is on, you are\nsailing-by-the-lee. If sailed too much by the lee,\nthe boat may accidentally jibe when the skip\nper does not expect it.\nAccidental jibes are\nour most frequent cause of swampings because\n\nFigure 3. Points of Sailing\n\nthe skipper is caught off balance and is on the\nwrong side of the boat.\nBoat No.\n6 having jibed, is shown broad\nreaching, as was boat No. 4, but on the star\nboard tack. No. 7 boat is shown on the star\nboard tack and is on a beam reach correspond\ning to No 3. Boat No. 8 is shown on a close\nreach which is similar to the beam reach shown\nin position No. 3, but with sails almost close\nhauled.\nTacking is the maneuver of turning the bow\nof the boat through the eye of the wind so the\nsail swings from one side to the other and is\nshown by the three positions, Nos. 8, 1, and 2.\nA Few Odds and Ends\nIf you have passengers (a crew), let them know\nwhat you want from them in advance of any\nmaneuver. If they need to move their weight\nor help with the sails on a larger boat, explain\nwhat you want and give a warning. For tack\ning, the traditional hail is ready about and for\njibing, prepare to jibe.\nMany beginners have trouble trimming sail\nbecause one hand appears completely occupied\nin steering the boat. Use your thumb and fore\nfinger of the tiller hand to grasp the sheet tem\nporarily when you have to haul the sail in.\nMany sails have yarn taped to both sides\nof the middle of the sail just back from the\nluff. These sail ticklers are used to gauge wind\nflow along the sail, and when they are work\ning ideally, they will be parallel and stream\nback toward the leech. If the windward yarn\nis spinning about, the sail is about to luff and\nyou should trim in or, if already trimmed into\nclose-hauled, turn the boat away from the wind\ndirection. If the leeward yarn is spinning about\nas you observe it through the translucent sail,\nyour sail is in too tight and should be eased or\nyour course altered toward the wind.\nAn improper sail set is a sure sign of an inex\nperienced sailor. On the Tech it is very impor\ntant to get the sail to the top of the mast. If the\nboom vang is tight or the downhaul made fast\nwhen you raise the sail, the sail will not go to\nthe top of the mast. If the sail is not to the top,\nyour boom will be lower than it should be, and\nthere will be insufficient room between the tack\nof the sail and the gooseneck to apply tension\nto the luff of the sail. The downhaul should\nbe tensioned enough to remove any wrinkles\nthat radiate from the luff toward the clew of\nthe sail. These wrinkles indicate the draft (the\nmaximum point of curvature in the sail) has\nmoved too far aft. The stronger the wind, the\nmore tension you will need on the downhaul to\nkeep out the wrinkles when the sail is full and\npulling. The outhaul should also be adjusted\naccording to the strength of the wind. For light\nwinds or rough water you want to develop more\ndrive in the sail by leaving 6 to 8 inches of\ncurve between the point of maximum curve of\nthe foot of the sail and the boom. As the wind\nincreases and the boat becomes overpowered,\ncontinue to tighten the outhaul and reduce the\ncurve in the sail to reduce the heeling force.\nEven if possible, it would never be desirable to\ncompletely flatten the sail, since the sail would\nnot work if it was completely flat. The purpose\nof the boom vang is to prevent the top of the\nleech from twisting too far off to leeward and\nspilling the wind. A little twist in the leech\nis desirable in light winds, so the vang should\nnot be set up tight in these conditions. The\nvang will be most important on reaches and\nruns when the main sheet isn't effective in ap\nplying a downward force on the sail. As the\nwind increases, continue to tighten your vang\nto control leech twist. The traveler line should\nalways be light enough so the traveler blocks\nnever come close to the boom blocks, and in\nactual practice, most sailors will set the line\ntight enough so the traveler blocks just clear\nover the top of the tiller on tacks and jibes.\nLight winds present special problems. If the\nwind is too light to tip the boat to leeward, you\nmust move your own weight to leeward so grav\nity and the weight of your boom will hold the\n\ndesired shape in the sail. Sit on the thwart and\nhold the sheet directly from the boom block so\nyou can make the many adjustments which are\nnecessary in the light variable wind. Set your\nsail up for maximum fullness and watch your\ntell tale on the stay for changes in wind direc\ntion. Watch the water for wind puffs.\nStrong winds also present problems, and the\nHelmsman's rating checkoff consists of single\nhanded sailing in these strong winds. It is of\nutmost importance to quickly and constantly\nmove your body weight back and forth from\nthe thwart to the gunwale and often to a full\nhiked out position. Many quick adjustments in\nthe sail trim must be made to parry the puffs\nand keep the boat on its feet and thus prevent\nexcessive weather or leeward helm. Use of the\nhiking stick or tiller extension is a necessity.\nHold the sheet from the centerboard trunk's\nratchet block (with the click turned on) for best\nsail control. Be especially alert to puffs of wind\nmoving toward you so you will be ready to hike\nout, let out the sheet, or both together.\nThe tiller extension can be a great aid in\nhandling the boat once you have learned how\nto keep from getting it stuck unintentionally\nwhen you are doing your tacks or jibes. A good\nway to accomplish the switch over is to slide\nyour hand in along the extension, toward the\ntiller, just as you move your body around the\ntiller. As you move your body, flip the exten\nsion toward the stern and around to the new\nside, so it will be ready to grab behind your\nback as you pivot your body around and settle\non the new windward side.\nThe Basic Course\nOur method of teaching novices to sail at\nMIT's Shore School is to start on the easiest\npossible course. To do this, a reaching course\nis set up between two buoys and the novice\nis required to tack around each buoy (Figure\n4).\nSince other boats will probably be sail\ning this course, you must know the right-of\nway rules, because the boats approach head\non. Concentrate on sailing a straight course to\ndevelop a reflex action response for using the\ntiller.\nConcentrate on boat balance and sail\ntrim. Remember, letting out the sail will stop\nthe boat from tipping. A variation of the two\nbuoy course is to travel around the buoys in a\ncircular direction so that you tack at one end\nof the course and jibe at the other end.\nAfter the novice has become proficient on\nthe simple two-buoy course, a third buoy is put\nout to windward so that it becomes necessary\nto sail close hauled and beat-to-windward to\nget to and turn the buoy (Figure 5). It will be\nnecessary to jibe at one of the buoys after a run\nor broad reach unless we wish to sail beyond\nthe buoy, turn up into the wind close hauled,\nand then tack. This maneuver is used when\nthe wind is too strong for the novice to jibe\nor if he feels insecure and wishes to make the\nsafest kind of turn.\nRules of the Road\nWhen two sailing vessels are approaching one\nanother so as to involve risk of collision, one\nof them shall keep out of the way of the other\nas follows:\n1. Boats sailing on the port tack give way\nto boats sailing on the starboard tack. A\nboat is on the tack corresponding to the\nside over which the wind blows, the side\nopposite to which the main boom is car\nried. A boat is on the port tack when the\nboom is on the starboard side (or right\nside).\n2. Of two boats on the same tack, the wind\nward boat keeps clear.\n3. In addition, any vessel overtaking any\nother shall keep out of the way of the\novertaken vessel. Every vessel coming up\non another vessel from any direction more\nthan 22 degrees (2 points) abaft her beam\n\nFigure 4. Beginner's Reaching Course\nFigure 5. Expanded Course with Windward Buoy\nshall be an overtaking vessel. If the over\ntaking vessel cannot determine with cer\ntainty whether she is forward of or abaft\nthis direction from the other vessel, she\nshall assume that she is an overtaking ves\nsel and keep out of the way.\n4. Crew shells and rowboats generally have\nright of way over sail and power boats.\n5. Sail generally has right of way over power\nboats -- but do not always count on get\nting it.\nFigure 13.\nThere are exceptions to these rules such as\nboats towing something and large ships in a\nnarrow channel.\nPrecautions (from Provi\nsional sheet)\n1. Helmsmen\nare\nresponsible\nthat\nnon-\nswimmers are not taken out in boats\n\n(MITNA Rule No. 1).\n2. Proper method of cleating halyard is to\nuse the slip hitch rather than half hitch\nwhen fastening to clean.\n3. Maximum number of people in boats:\nDinghies, 3; R-19s, 8; Larks, 420s & FJs,\n2; Finns and Lasers, 1.\n4. Procedure after capsize:\nMost important -- stay with the boat! If\nthe boat is floating on its side, get out\nof the boat to keep it from turning up\nside down (called turtling the boat), and\nswim to the centerboard. Avoid hanging\non the hull so that the hull will float with\nmaximum buoyancy.\nThen pull on the\nend of the centerboard to roll the boat\nupright.\nClimb back into the hull over\nthe windward side; raise the centerboard\nhalfway and sit well back so the water\nwon't surge back and forth and tend to\nsteer the boat. With careful balancing you\nshould get back to the dock where you can\npump out the boat.\nIf you are unsuccessful in sailing back full\nof water, drop the sail and the launch will\ncome out to make a rescue. The launch\ndriver will instruct you how to assist for\nthe tow in.\n5. Explain recall signals (MITNA Rule No.\n16).\n6. Care of the boat at the dock -- tie boat\nclear of other boats in the water, and make\nsure your boom does not beat against\nboats on the dock. Boats should not be\nleft unattended at the dock. Sails should\nnot be left up in a strong breeze while boat\nis at dock because stitching in the sail can\nbe damaged.\nMan Overboard Procedure\n(Fig. 6)\nIf you lose a crew member overboard you want\nto get back to him quickly but be able to stop\ncompletely when you arrive back to where he\nis in the water. To get back to your crew over\nboard, sail away from him on a beam reach for\na distance of 3 to 4 boat lengths, and then ex\necute a quick, tight jibe, and let the sail luff.\nYou can now proceed back toward the person\nin the water on a beam reach and trim sail if\nyou are not returning quickly enough or push\nthe sail (boom) to leeward and against the\nwind to slow the boat if you are going to arrive\nwith too much speed. The boat should be just\nabout stopped when the person is abeam the\nboat. Make the pickup on your windward side\nso you can control the tipping. This maneuver\nis normally practiced with the life jacket which\nyou can of course whip out of the water while\nstill travelling at a good clip. Instead, try to\nimagine this life jacket is a 200 pound person,\nwho, if you attempt to pickup with too much\nspeed, will grab the boat, act as a sea anchor,\npull the side he is holding to leeward, and cap\nsize the boat. With too much speed you might\nalso run over an injured person you are trying\nto rescue.\nA short list of Nautical\nTerms\nwindward The side the wind is coming from\nor the side of the boat opposite the boom.\nleeward Opposite of windward.\nstarboard The right side as you face the bow\n(from inside the boat).\nport The left side.\nforward Toward the bow.\naft Toward the stern.\n\nFigure 6. Man Overboard\nhead up To turn the boat toward the wind\n(also called luffing up ).\nbear off To turn the boat away from the\nwind.\njibe A turn whereby the wind moves from one\nside of the boat to the other across the\nstern and causes the sail to change sides.\ntack (come about) Same as above except wind\nmoves across the bow.\nby the lee Running with the wind blowing\nover the leeward quarter (boat is in danger\nof accidentally jibing).\non the wind Sailing close hauled.\nbroad reach Sailing free with the wind over\nthe windward back quarter.\nsailing free All points of sailing other than\nclose hauled.\nease To let the sail out.\ntrim (of boats) A boat is in proper trim when\nit sites on its waterline when in the water.\nready about Command preparatory to tack\ning.\nprepare to jibe Command\npreparatory\nto\njibing.\npinching Sailing too close to the wind (in a\nstalled position).\nhiking Leaning out to windward in order to\nhold the boat in proper trim.\nshooting to windward A\nmaneuver\nwhereby the boat is turned into the\nwind and control of the boat is dependent\non the momentum left before the sails\nwere luffed.\nweather helm When the tiller must be held\nto windward of the centerline to keep the\nboat on course.\nlee helm Opposite of weather helm.\nheavy weather Strong winds.\nheeling Tipping of the boat to windward or\nleeward.\nAnchors\nAn anchor is used to tie a boat to the bot\ntom.\nTo accomplish this it must either be\nheavy or very effective at digging its flukes into\nthe bottom.\nFour common types of anchors\n(Navy, Mushroom, Kedge and Danforth) are\ndescribed; however, many other varieties exist.\nNavy Anchor\n(Figure 7) The navy anchor\ndigs in only slightly and relies largely on its\nweight. Because of this, it is almost useless in\nany size that could be carried on a small boat\nand is used only for large ships.\n\nFigure 7.\nMushroom Anchor\n(Figure 8) The mush\nroom anchor is used for permanent moorings,\nis heavy, and takes a long time to bury itself.\nOnce buried, however, it is almost impossible\nto pull out.\nA sixteen foot sail boat might\nuse a mushroom anchor (weighing 100 lbs) for\nmooring.\nFigure 8.\nKedge Anchor\n(Figure 9) The kedge is the\ntraditional small boat anchor. It has a mov\nable stock so that it can be folded into a more\nconvenient shape. This style of anchor, while\nheavy for its holding power, is very reliable\nin almost any type of bottom since its flukes\ndig in easily and deeply. Some care is needed\nnot to foul the anchor line on the protruding\narm and stock when the boat swings to wind\nchange. A sixteen foot boat might use a kedge\nanchor weighing 20 pounds. Its main drawback\nis that even relatively light kedge anchors take\nconsiderable space to store away.\nFigure 9.\nDanforth Anchor\n(Figure 10) The Dan\nforth is a lightweight anchor that has very good\nholding power because of the large size of its\nflukes. It will foul easily in kelp and weeds and\nneeds a good length of chain to keep the shank\nfrom being lifted too high which can result in\nbreaking out the anchor. It holds best in sand,\nless well in mud, and is unreliable on a rocky or\nweedy bottom. A sixteen foot boat might use\na 10 pound anchor of this type. Because of its\ncompact size, this anchor is most popular for\ncasual mooring. A shift in the wind direction,\nhowever, may cause the Danforth to pull out\nand skim along the bottom before the flukes\ncan catch again.\nFigure 10.\n\nFittings\nIn addition to the fittings shown in the diagrams of the Tech Dinghy (Figures 1 and 2), the following\nfittings exist on some of our other boats. For the crew rating one must be able to identify and\nunderstand the use of all fittings shown or listed.\nchain plate\nwinch\nturnbuckle or shroud adjuster\ncable or rope thimbles\njib hank or snap halyard lock\nclevis pin\nspinnaker-pole, mast ring and topping lift\nshackle\nhiking straps\ncotter pin\nleech lines\ncleats (different types)\nspinnaker sheet or guy\nself bailers and scuppers\nguy or reaching hook\ntwing line\nsnap hook\nsail ticklers\neye strap\n\nAnchoring\nAny anchor works best when a length of chain\nabout 1\n3 the length of the boat is fastened be\ntween the anchor and line.\nThis lessens the\nshock of the boat's movements which can break\nthe anchor loose. For this reason also, nylon,\nwhich stretches, works best for the anchor line.\nThis line should be 3 to 7 times the depth of\nthe water at high tide (see Figure 11).\nTo lower the anchor, wait until the boat has\nstopped moving forward, then lower the anchor\nand line hand over hand at a steady rate as the\nboat begins to drift back. When about 2 times\nthe depth has been let out, a gentle tug on the\nline will set the anchor and the full scope or\nlength can be let out and the line made fast.\nThere should, of course, be plenty of water for\nthe boat to swing in a full circle around the\nanchor.\n\nFigure 11.\n\nWhipping and Splicing\nWhipping and splicing are difficult to depict\ngraphically. However, there is a display board\nin the Shore School Classroom, and the staff is\nalso happy to assist you on a one-to-one basis.\n25.1\nWhipping\nRope ends, if left unbound, tend to unravel. To\nprevent this we bind or \"whip\" the ends with\na fine, waxed yarn or twine before the rope\nis used. There are several methods for whip\nping rope ends; the easiest and least durable is\ncalled Ordinary Whipping; slightly more dif\nficult, but more permanent, is Needle Whip\nping. Modern lines of synthetic material can\nbe melted with a match or soldering iron caus\ning the fibers to fuse together to form a tem\nporary fastening.\n25.1.1\nOrdinary Whipping (Figure 12)\nAn ordinary whipping is made by placing the\nend of the yarn at the end of the rope and\nlaying a loop along the rope.\nThe yarn is\nthen tightly wound around both loop and rope,\nbinding them together.\nWind to a length\nroughly equal to two diameters of the rope you\nare whipping.\nThe whipping is finished by putting the\nwinding end B through the loop, then pulling\nend A tight until the loop is drawn back out of\nsight. Both A and B should be trimmed flush\nwith the whipping and the rope then cut to\nlength.\nFigure 12.\n25.1.2\nSewn or Needle Whipping (Fig\nure 13)\nThe sewn or needle whipping is the best\nmethod of assuring your line or rope stays\ntightly wrapped and strong. Make a knot in\nthe end of a section of twine that you have\nthreaded through a sail needle. Tuck the whip\nping twine under a strand and pull the knot\nup inside the rope so there will be no bump\nunder the wraps.\nMake your wrappings to\nward the end of the line until you have enough\nwraps to equal one diameter of the rope you\nare whipping. Bring the needle under a strand\nand bring your whipping twine back over your\nwrapping following the valley or twist in the\nrope, and tuck the needle under a strand on\nthe inside edge of the wrappings.\nContinue\nthis process until all valleys (3) are covered.\n\nYour twine should now be back on the inside\nend of your wrapping.\nTo finish your whip\nping, sew the needle back through the interior\nof the line making a number of insertions un\ntil the twine is 3\"-4\" in from your wrappings.\nTrim the twine close to the line and trim the\nline below the whip for a neat job. When done\nproperly it should be difficult to see where the\nwhipping starts or finishes.\nThe whipping is often done with a doubled\nwhipping twine to speed the process.\nFigure 13.\n25.2\nSplicing\nThere are many different kinds of splices for\nspecific uses, but the average small-boat skip\nper generally needs but two -- the eye splice\nfor forming a permanent loop, as in the dock\nline, and the short splice for joining two lines\nwithout a knot.\nThe traditional three-ply\ntwisted line is the type generally used. Prac\ntice line is available in the Shore School Room.\n25.2.1\nEye Splice (figure 14)\nTo get started on the eye splice unlay the end of\nthe line for about 6\" and locate the top center\nstrand (strand b in Figure 14(1)). The whip\nping shown in the diagrams is optional and not\nnecessary on our own practice rope.\nDecide\nhow big a loop you want in your eye splice and\nslightly untwist the rope at the point where\nyou plan to rejoin the loop. Form a loop and\ntuck the top center strand under one strand of\na portion of the line that you have untwisted\nslightly (see Figure 14(2)).\nAllow the other\ntwo strands to straddle this portion of the line.\nNext, take strand A, go over the strand it is\nresting on and tuck under the next strand --\nstarting in where your first strand, B, is com\ning out (Figure 14(3)). To make fast the last\nstrand C, turn your half-completed loop over\nso strand C is on top (Figure 14(4)).\nTuck\nstrand C under where strand A is coming out,\nbut once again make the tuck with the strand\ntoward the left (Figure 14(5)). With one set\nnow tucked, each strand should be exiting from\na different opening, and all should be at the\nsame level in the line. Tighten each strand so\nthere is no slack where the strands join the line,\nand continue to make at least two more sets of\ntucks going over and under with each strand\nas in Figure 14(3) and (6). Be sure to rotate\nthe line and make each tuck to the left. Tucks\nare only made under strands from the interior\nportion of the line and never under sections of\nthe strands which are actually being tucked.\n\nFigure 14.\n25.2.2\nShort Splice (figure 15)\nThe short splice should now be simple for you.\nUnlay about 4\" from two ends of rope and\njoin the lines so each strand is separated by\nstrands from the other line. See Figure 15(1).\nMove the lines together until the joint is firm\nand wrap or tape the joint as shown in Figure\n15(2).\nRefer to Figure 15(3)-(6) for the re\nmaining steps. The strands radiating from the\njoint area should look just like the eye splice\nafter you have completed the first set of tucks.\nDo two or three sets of tucks on each side of\nthe joint taking extra care to assure the line\nis firm and tight at the joint. Roll the com\npleted splice back and forth in the palms of\nyour hands to improve the symmetry of the\nsplice, and trim or burn excessive ends for a\nneat job.\nFigure 15.\n\nSome extra tips that may\nhelp\n1. If you are used to larger, more stable\nboats you might have a problem with\nour lighter boats.\nAdjustment of your\n(and your crew's) weight is paramount.\nIf you can sail, but are not experienced\nin small boats, we can spot you immedi\nately and we worry about you! Read the\nparagraph in this booklet regarding body\nmovements.\n2. Using the tiller extension gives the skipper\nfar greater flexibility in moving around\nin the boat.\nLearn to use it!\nHold the\nextension in front of your stomach (not\nat your hip).\nGrasp the extension with\nyour thumb pointed toward the end of the\nextension (not pointed toward the tiller).\nThis allows the tiller hand to also double\nup on trimming the mainsheet. If you are\nnot hiked out, choke up on the extension\nand keep both hands comfortably in front\nof your body where you will have maxi\nmum range of movement.\n3. If you go aground on the Boston shore try\nto protect the rudder and centerboard --\npull them up. Exercise caution on step\nping out. The stones are slippery and un\nstable -- there can be broken glass. Most\nboats that go aground have gotten too\nclose and messed up their tack. If you are\nluffing your sail in strong wind and waves\nyou may not have enough momentum to\npunch through the wind. Leave yourself\nenough room for a second tack after you\nhave trimmed your sail and regained some\nspeed.\n4. If you are uncertain that you have rigged\nyour boat up optimally please ask us to\ncheck it over. This is not an inconvenience\nfor us -- we want to do it for you.\n5. We want you to do your Provisional check\noff (or any part of it) as soon as you think\nyou can. Without this rating we may not\nlet you sail if we think it is too windy or\nmay ask you to put on a small sail. Once\nyou have the provisional try the Laser (ask\nfor help in getting a Laser ready for the\nfirst time). The Laser is even more weight\nsensitive but it's a lot of fun. If you do\ntip over it is easy to tip back upright\nand at least the boat will be dry.\nYou\nneed the Helmsman rating to take out our\nother boats and you need your crew rating\nfor the Helmsman to be punched on your\ncard.\nKnots\nDouble Half Hitch\nFor tying up when the\nline is already under tension.\nFisherman's Knot\nA more permanent way\nto join any two lines -- hard to undo. Two\nsimple overhand knots tied around the accom\npanying line.\nSquare Knot\nFor tying together two ends\nof the same diameter.\n\nSheet Bend\nFor tying together two ends of\nAnchor Bend\nA knot which closes tightly\ndifferent diameter.\nand reduces chafe by doubling the loop around\nthe anchor ring.\nBowline\nMakes a loop in the line which will\nnot slip.\nFigure Eight\nA stop knot which can be used\nto keep a line from coming out of a block.\nRolling Hitch\nFor tying a line or a post\nwhen the knot must not slip in direction of\narrow.\nClove Hitch\nFor tying a line to a post; can\nwork loose if it is slacked and loaded.\nStunsail Tack Bend\nMakes the loop in the\nend of a line which will slip closed, making a\nneat, tight knot.\n\nSailboat Rigs\nCoiling and Heaving a Line"
    }
  ]
}