{
  "course_name": "Schubert to Debussy",
  "course_description": "This course is a survey of developments in Western musical style, 1815-1915. Students will study works by 35 composers, including the romantics: Schubert, Chopin, and Schumann; the post-romantics: Wagner, Verdi, and Brahms; the turn-of-the-centurians: Mahler, Debussy, and Ravel; and the Americans: Gottschalk, Beach, and Joplin. Score-reading ability is beneficial.",
  "topics": [
    "Fine Arts",
    "Music",
    "Music History",
    "Fine Arts",
    "Music",
    "Music History"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nCourse Structure\n\nPart 1: Intimacy and the (Self-) Portrait: Piano Music and Songs (4 weeks)\n\nPart 2: Romantic Chamber Music (2 weeks)\n\nPart 3: Drama in the Theater and the Church: Opera and Church Music (2 weeks)\n\nIntermezzo: Nationalism (1 day)\n\nPart 4: Orchestral Music: Programatic and Absolute (4 weeks)\n\nPart 5: Romanticism in America (1 day)\n\nFinale: Salons (1 week)\n\nListening\n\nListening assignments are the focus of 21M.250. You are expected to listen to each assignment before and/or after each class. Listening, as demonstrated in class participation, is worth 40% of your grade. Consequently attendance is expected at all classes. If you miss a class you are required to submit at the following class a one page listening report on the material covered in the missed class.\n\nBooks\n\nTextbook\n\nHonour, Hugh.\nRomanticism\n. Boulder, CO: Westview Press, 1979. ISBN: 9780064300896.\n\nScores (in Dover Miniature Editions)\n\nBrahms, Johannes.\nSymphony No. 4\n. Mineola, NY: Dover Publications, 1997. ISBN: 9780486298917.\n\nMahler, Gustav.\nSymphony No. 3\n. Mineola, NY: Dover Publications, 2002. ISBN: 9780486421384.\n\nSchubert, Franz.\nSymphonies No. 8 and 9\n. Mineola, NY: Dover Publications, 1997. ISBN: 9780486299235.\n\n------.\nString Quintet\n. Mineola, NY: Dover Publications, 1998. ISBN: 9780486406435.\n\nIt is strongly recommended that you purchase this text and scores. Additional scores will be distributed during the class.\n\nIt is also suggested that you read or at least skim the appropriate entries for the given composers in the\nNew Grove Dictionary of Music and Musicians\n.\n\nExams\n\nThe class will include two quizzes, each 90 minutes long. They will cover the concepts presented and the music assigned during one-half of the semester. They represent 40% of your grade.\nThere is no final exam.\n\nConcert Reports\n\nConcert reports constitute the written component of the class. Three are required, and each is expected to be about 5 pages long. Reports I and II are due no later than Lec #14, while the third and final report is due by Lec #24. I suggest that you hand in reports early and often, and it is critical that you write up the report very soon after having attended the concert, recital, ballet or opera. I expect that at least one of the concerts occur \"off-campus\" and that at least two involve professional musicians. It is rare for a concert to feature only Romantic music, however those you choose to write about should present at least one major work by a composer in our syllabus. It never hurts to check with me about the appropriateness of an event before hand. Please note that neither collegiate a cappella nor \"Cats\" falls within the purview of this class.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nListening (Demonstrated through Class Participation)\n\n40%\n\nQuizzes\n\n40%\n\nConcert Reports\n\n20%\n\nComposers: A Handy Chronology\n\n1770 -1827 Ludwig van Beethoven\n\nAlthough will not \"officially\" study him, all 19th century music is essentially a response to his towering achievement. Beethoven remains the model of the 'Romantic\" genius, and both the miniature and colossal strains of 19th century music are dependant on his example. Remember that Liszt as a child prodigy was kissed by him, Wagner thought he was almost as great as Wagner himself, and Schumann hailed the unfortunate young Brahms has his heir. Only at the end of the century could Debussy simply be indifferent to him.\n\nThe Early Romantics\n\n1786-1826 Karl Maria von Weber (Germany)\n\n1797-1828 Franz Schubert (Austria)*\n\n1797-1848 Gaetano Donizetti (Italy)*\n\n1803-1869 Hector Berlioz (France)\n\n1809-1847 Felix Mendelssohn (Germany)\n\n1810-1849 Frederic Chopin (Poland/France)\n\n1810-1856 Robert Schumann (Germany)*/**\n\n1811-1886 Franz Liszt (Hungary/France/Italy/Germany)\n\nThe Middle Romantics\n\n1813-1883 Richard Wagner (Germany)\n\n1813-1901 Giuseppe Verdi (Italy)\n\n1818-1893 Charles Gounod (France)\n\n1819-1896 Clara Wieck Schumann (Germany)\n\n1822-1890 Cesar Franck (Belgium/France)\n\n1824-1884 Bedrich Smetana (Czechoslovakia)*\n\n1824-1896 Anton Bruckner (Austria)\n\n1826-1864 Stephen Foster (USA)\n\n1829-1869 Louis Moreau Gottschalk (USA/France)\n\n1833-1897 Johannes Brahms (Germany/Austria)**\n\n1835-1921 Camille Saint-Saens (France)\n\n1838-1875 George Bizet (France)\n\n1839-1881 Modeste Mussorgsky (Russia)\n\n1840-1893 Peter Ilych Tchaikowsky (Russia)\n\n1841-1904 Antonin Dvorak (Czechoslovakia)\n\n1843-1907 Edvard Grieg (Norway)\n\nThe Late and Post-Romantics\n\n1845-1924 Gabriel Faure (France)\n\n1853-1937 Arthur Foote (USA)\n\n1854-1931 George Chadwick (USA)\n\n1860-1903 Hugo Wolf (Austria)*\n\n1860-1911 Gustav Mahler (Austria)\n\n1862-1918 Claude Debussy (France)***\n\n1864-1949 Richard Strauss (Germany)\n\n1865-1957 Jean Sibelius (Finland)\n\n1867-1944 Amy Beach (USA)\n\n*Presumed to have died of Syphillis\n\n** In love with Clara Wieck Schumann\n\n***Claimed as leader of a secret society sworn to protect the descendants of Jesus and Mary Magdalene in a recent, wildly popular novel.",
  "files": [
    {
      "category": "Resource",
      "title": "Second Concert Report",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-250-schubert-to-debussy-fall-2006/9f2259752b534190716d84014cb54b98_report_ilten.pdf",
      "content": "Second Concert Report\nPhilip J. Ilten\nMay 1, 2007\nThe overture to Die Meistersinger von Nurenburg, one of Wagner's less than typical\noperas, began the 2006 MITSO season to what could very will be one of MITSO's less than\ntypical years. Transitioning from the permanent directorship of Dante Anzolini to Paul\nBiss, an interim director, must certainly have a significant effect on the returning players,\nand even newcomers. Despite this Biss has a season of heavy hitters lined up, including\nBeethoven's 5th, Mahler's 5th, and Tchaikovsky's 5th, along with works by Mussgorsky,\nWagner, Shostakovich, and Bartok not to mention the Dvorak's 8th and Hanson's 2nd on\nthis concert.1 While Anzolini certainly drew from the core repretoire for symphony, he\ncertainly never attempted this many large symphonic works within one season, especially\nwith respect to the brass and wind section. It will be interesting to hear throughout the\nseason, how MITSO handles these pieces, with a new director, but if the first concert is\nany indicator of things to come it looks like MITSO is in for a good season.\nDie Meistersinger is what I would consider to be Wagner's third most famous piece,\nfalling behind Walkurenritt (Ride of the Valkyries) and the overture to Der Fliegende\nHollander (The Flying Dutchman). Sandwiched between these two great works of Wagner,\nDie Meistersinger departs from the typical fantastic settings of Wagner and enters the real\nworld town of Nurenberg, with the main subject of the opera, die Meistersinger, being a\nreal group of musicians and poets.2 Not only does the subject matter deal with the real\nworld, but the opera is Wagner's one and only comedy! Dealing with a typical (non-epic)3\nlove story, the plot is similar in fashion to The Barber of Sevilleor La Boheme. Atypical4 ,\nfor many reasons, Die Meistersinger also departs from many Wagner's musical conventions\n1Midway through summer Professor Biss sent out an email to the mit-musicians list, which is why I\nknow what he is planning to play. The repretoir that he was planning on hitting almost stole me away from\nWind Ensemble, until I realized that Beethoven's 5th, while being the first symphony to use trombone,\nreally did not use trombone all that much. I still would have loved to play with MITSO this season, but I\njust don't have time. Maybe I should drop my physics major...\n2New Grove Musical Dictionary\n3By non-epic I mean that the story deals with normal people, having normal everyday problems, instead\nof dealing with gods falling in love with humans and epic love fueds involving people being smitten by gods,\netc. Not that I do not dissaprove of these stories at all, but this is a huge departure for Wagner\n4The story and style may be atypical, but it is still typical in Wagnerian length coming in at over five\nhours.\n\nand introduces the use of arias and recitative, along with ballet. In many ways this opera\nalmost seems like it is an oppurtunity for Wagner explore many of the operatic devices\nthat so vehemently opposed.\nListening to the overture, without knowing the composer to be Wagner, one could\nmistake it as an overture to some tragic opera, but certainly not a comedy. Comparing it to\nother Wagnerian overtures however, makes Die Meistersinger seem downright lighthearted.\nWagner as usual makes use of the brass, but restrains them much more than usual, using\na much less edgy tone, and counterbalancing them with use of the woodwind section and\nthe string section. The beginning, rather than opening with a full brass fanfare, begins\nrather with a full string fanfare, which is tempered by use of the horn section the tubas5 ,\nand the timpani. As the piece moves forward the opening fanfare transitions into a lyrical\nsection and back to the fanfare theme, this time with the help of trombones and trumpets.\nHowever the tone at this point still has no edge, which was especially the case in this\nperformance by MITSO. The music transitions back into another more lyrical section and\ngoes through a series of variations between the lyrical theme and the fanfare theme. One\nof the more interesting variations of the fanfare theme comes after a large build up in the\nstrings, to what one would expect to be the return of the brass with the fanfare. Instead\nthe clarinets and flutes enter with a very quiet and intricate variation on the fanfare in an\nalmost fugue form.\nI remember first hearing this piece as a freshman in high school, sight-reading it in\nWind Ensemble (a version arranged for Wind Ensemble of course). We went on to play\nDie Meistersinger at a concert, and it was by far my favorite piece on the program. One\nof the things that drew me to it was its excellent use of the trombone section.6 Needless\nto say, in ninth grade I played these great trombone lines with a lot of exuberance without\nlistening to a recording of the piece. In hindsight it would seem that I may have used a\nlittle too much of a brassy edge, but then again my director never told me to play more\nquietly. This leads me to what I consider to be one of the most difficult aspects of this piece:\nintensity and tone balance. In my experience, symphonies, even professional symphonies,\nlose intensity as edge is taken off the sound, in both the strings and the winds. This edge on\nthe sound is most prominent in the brass, but is also noticeable in the other instruments.\nThe beginning of this piece is almost certainly meant to be intense, but without a noticeable\nedge.7 In this regard MITSO did a great job. There was a high intensity at the start, and\n5Wagner's use of the tuba has always fascinated me, especially his use of the Wagner Tuba which no\nlonger is commonly used. The Wagner Tuba was only used briefly by Wagner, and not in this opera.\n6Maybe that was just from the arrangement but it seems to me that in the original scoring by Wagner,\nthe trombones also have a pretty cool part. Wagner was always very good with the way that he used\ntrombones.\n7I am entirely basing this assumption off the fact that the piece is a comedy and from listening to\nthe recording by the Chicago Symphony Orchestra, directed by Sir Georg Solti. The low brass section\nof the CSO is considered to be one of the more aggressive low brass sections in the world of professional\nsymphonies (it certainly blows the BSO low brass out of the water!), and in the opening of the recording,\nthey are using almost absolutely no edge. Maybe my analysis here is flawed, but when it comes down to\n\nthe edge was minimal. Unfortunately, as the piece progressed, the intensity was lost at\na rather alarming rate. The piece does use the same theme over and over, which can be\ntaxing on the players, but makes keeping the intensity up that much more critical. By\nthe time the intricate fugue section in the winds appeared it was lack-luster because so\nmuch intensity had been lost by that point. By the end of the piece I was hoping that the\nintensity might come back with the help of a little edge from the brass, but neither came.8\nHanson's Romantic symphony was the complement to Die Meistersinger for the first\nhalf of the program. Interestingly enough the Romantic was commissioned by the BSO for\nits fiftieth anniversry and was premiered in 1930. This puts it well outside the accepted\ntime period for the Romantic era of music, but here is what Howard Hanson has to say\nabout it himself:\nIt was a genuine expression of romanticism and a protest against the growing\nSchoenbergism of the time the cold music and I wanted to write something\nthat was warm and young, vigorous and youthful.9\nWhile the piece is a far cry from Schoenberg, it is also certainly not Romantic yet is\nstill Romantic in nature. Use of winds, especially of the horns, provides many of the\nintroductions of the themes in the first movement. This reflects the trends of the late\nnineteenth and early twentieth century composers of shifting the emphasis in the symphony\nfrom dominant strings to equal footing for both strings and winds. The use of high principle\ntrumpet in this seemed to be extraodinary taxing (especially judging from the grimices that\nthe principle player was making), and the use of low brass was at times very Wagnerian10 .\nMy first impression of this piece was that it was a very early predecessor to a film score\nwritten by John Williams or Hans Zimmer. I think that in actuality many film scores take\nthe ideas of the Romantic era and imitate them, but with more emphasis on wind lines,\nand the concept behind this symphony was similar.\nWhat surprised me was the fact that Professor Biss used a score for this piece while,\nnot using a score for the Wagner or Dvorak. While this is understandable, since I am sure\nhe has directed the Wagner and Dvorak many times before, it gave the impression that the\nHanson was less rehearsed than the Dvorak or the Wagner. In reality I do not think that\nthis was the case, but I think that it might have given many people that impression. In\nthe end I felt that the Hanson was performed very well. I do think that it might have been\nwiser to place it before Die Meistersinger so that the trumpets would have been fresher,\nbut I think that musically it was logical to place it after Die Meistersinger. In any case, the\ninstensity of this piece, along with the musicality was much better than Die Meistersinger.\nhow to play low brass orchestral excerpts, I feel the CSO low brass is the best example out there.\n8In the CSO recording the end has quite a bit of edge. Of course it is rather unfair to hold MITSO to\nthe standards of the CSO, and Biss to the standard of Solti, but still, I think it can be useful.\n9S. Smith, Liner Notes to Music of Howard Hanson, [1998]\n10On a side-note I found the opening of the second movement to be very very similar to the opening of\nthe overture to Der Fliegende Hollander.\n\nThe dynamic contrast led to a more emotive piece, and I felt that some very good solo\nwork on various instruments motivated the symphony to greater levels of musicality.\nDvorak's Symphony No. 8 came after the intermission and constituted the entire second\nhalf of the concert. Of the three pieces performed, this, in my opinion, was by far the most\nRomantic of them all. Since Romantic is difficult to describe, as we found out on the second\nday of class, I can not give very many specific details as to why I feel this way, but rather\njust vague ideas. The entire piece (at least the first movement) is much less rhythmically\ndriven then Die Meistersinger and many parts of the Romantic. The contrasting dynamic\nthemes and use of rubato11 made the entire symphony seem very emotional, much more\nso than Die Meistersinger. This is also possible because it seemed as if the symphony\nenjoyed playing this work more than the other two, and put more emotion into the piece.\nIn general I felt that the strings and woodwinds put much more effort into this piece. This\nwas most apparent to me in the first movement, where the theme is quietly stated in the\nflutes and is answered in direct contrast with a forte violin line. The brass on the other\nhand seemed as if they were tired (which is quite possibly the case considering the lineup\nfor the concert). At the end of the Allegro ma non tropo the low brass seemed to have\ncompletely run out of steam and was not able to match the exuberant horn runs. I did\nfind the horns did an excellent job at the end, raising their bells and producing a massive\nwall of sound (albeit slightly out of tune wall of sound, although for the volume they were\nplaying at the intonation was very impressive). This was not matched in the trombones or\nthe trumpets, which is somewhat unfortunate since it left the ending a little lopsided.\n11I could not tell if the rubato was written into the music, or was conducted. It seemed like it was\nconducted, but then again, many conducters do not just beat strict time."
    },
    {
      "category": "Exam",
      "title": "Quiz I",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-250-schubert-to-debussy-fall-2006/ba9cd53f87291b9420bc35fd041394ef_quiz1.pdf",
      "content": "QUIZ I\n\nName:\nSchubert to Debussy\nFall 06\n\nemail:\n\nPart I: (30 minutes) A musical example will be played. Answer the following questions.\n\n1. Title______________________________ Composer_____________________\n\nGenre_______________________\n\nThis work is.........\na. a folkloric charm to catch a mouse.\nb. an allegory of the loss of sexual innocence.\nc. typical of the composer's elaborate piano writing, chromaticism and careful text\nsetting.\nd. \"a\" and \"c\" above.\n\nQuestions 2 and 3 form a pair.\n\n2. Title______________________________ Composer_______________________\n\nGenre____________________________\n\n3. Title_______________________________ Composer_____________________\n\nGenre_____________________________\n\nBoth these works borrow the following from folk traditions.\na. Bell-like colors from Estonian and Southeast Asian traditions\nb. Rhythmic and melodic material derived from Polish and African-\nAmerican music.\nc. Scottish Bag-pipe playing and traditional Spanish Flamenco.\nd. None of the above.\n\n4. Title______________________________________ Composer_____________\n\nGenre.________________________\n\nThis work.....\na. may have been begun as the first movement of a symphony.\nb. is said to have been suggested by the sight of little girls playing on a Merry-go-\nround in a public park.\nc. is, as is typical of its composer, a purely abstract piece without programmatic\nintent.\nd. \"a\" and \"c\" above.\ne. All of the above.\n\n5. Title___________________________________________Composer___________\n\nGenre__________________________________\n\nThis work was designed to.....\na. draw attention to the nationalist struggles of the Polish people.\nb. depict--- in musical terms--- the plot of Goethe's ballad \"Der Rote Igel\"\nc. appeal to the growing middle-class market for works designed for amateur\nperformance.\nd. Help the performer develop a previously unimaginable level of technical and\nmusical virtuosity.\n\nPART II: (15 minutes) Answer one of the following. Please indicate your choice by\ncircling the question.\n\n1. Compare and/or contrast the Nocturnes by Chopin and Faure in terms\nof their forms, textures and melodic constructions. To what extent is\nthe Faure dependant on the Chopin?\n2. Compare and/or contrast any of the assigned Preludes by Chopin to\nany of the assigned Preludes of Debussy.\n3. Discuss the relationship between \"Chopin\" from Schumann's\n\"Carnaval\" and the work by Chopin (in our syllabus) that you believe\nit most closely resembles.\n\nPART III: (15 minutes)\n\nDescribe the ways in which Schubert characterizes---in musical terms---the narrator,\nfather, son and Elf-king in his song \"Erlkonig\".\n\nPART IV: (25 minutes)\n\nCompare and contrast the scherzo movement of Schubert's String Quintet and the Piano\nQuintet by Brahms. Pay careful attention to form/structure( both within each section and\nwithin the whole), texture, rhythm, and key (harmonic) relationships within each piece.\nDiscuss, in particular, the impact on the listener of the endings."
    },
    {
      "category": "Exam",
      "title": "Quiz II",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-250-schubert-to-debussy-fall-2006/f988076ea2e7640e87bb111ee6240df8_quiz2.pdf",
      "content": "QUIZ II\n\nName:\nSchubert to Debussy\nFall 06\n\nemail:\n\nPart I: (25 minutes) A musical example will be played. Answer the following questions.\n\n1. Title_____________________________\nComposer____________________\n\nIn this example...\na. one hears an \"idee fixe\" associated with an English actress.\nb. a fragment of an astounding work by a 17-year-old composer.\nc. A short motive that acts as a framing device--though it is harmonically\nreinterpreted each time--- through out the course of the piece.\nd. of a work, the performance of which was forbidden in Nazi Germany.\ne. \"b\", \"c' and \"d\" above.\nf. A musical portrait of the composer's huntin' buddy.\n\n2. Title_________________________________ Composer_____________________\n\nIn the following example...\na. an angry father attempts to come to terms with his now adult daughter.\nb. the King of the Gods summons forth the God of Fire.\nc. Desdemona is sung to sleep by her husband, a Moorish general.\nd. \"a \" and \"b\" above.\n\n3. Title 1_______________________________ Composer 1_________________\n\nTitle 2_______________________________ Composer 2_________________\n\nTwo openings of musical works will be heard. The following statement is true.\na. Both are programmatic in intent.\nb. Neither a programmatic in intent.\nc. Though both suggest Austrian folk-tunes, only the second contains\nprogrammatic elements.\n\n4. Title__________________________________Composer____________________\n\nThis work is an example of....\na. Russian nationalism, with typically irregular rhythmical structures, modal\nharmonies, and melodies developed from repeating cellular units.\nb. a fascination with musical cryptograms. The secondary theme actually spells\nout the name of Clara Schumann's pug, Ernestine.\nc. Bohemian nationalism, with its characteristic focus on polka rhythms.\nd. the gentle pentatonicism, so evocative of the folk fiddle traditions, in the\ncomposer's native Norway.\ne.\n\n5. Title_________________________________ Composer____________________\n\nThis work is a musical depiction of....\na. \"Nimrod\", a code-name for the composer's lover. The agitated wind parts\nrepresent his angry wife.\nb. Ernestine von Fricken and her pug, Clara. Clara's erratic temperament is\nsuggested by the bassoons.\nc. \"***\" a mysterious friend of the composer's who is associated with an ocean\nvoyage, hence the quotation from Mendelssohn's \"Calm Sea and Prosperous\nVoyage\" Overture.\nd. \"G.R, S\" an organist friend of the composer who has thrown a stick into a river\nfor his bulldog \"Dan\" to fetch. Though Dan has some trouble with the fairly\nstrong current he is, fortunately, able to prevail.\n\nPart II. (25 minutes) An unknown musical example will be played. Please answer the\nfollowing questions.\n\nExample 1. The translation is included below.\n\nCOUNT OF LERMA (entering)\n\nThe Grand Inquisitor.\n(Exit Lerma. The Grand inquisitor, ninety years old and blind, enters, assisted by\ntwo Dominicans.)\nINQUISITOR\nAm I before the king?\nPHILIP\nYes, I need your help, my father, enlighten me. Carlos has filled my heart\nwith bitter sadness. The prince has rebelled in arms against his father.\nINQUISITOR\nWhat have you decided to do about him?\nPHILIP\nEverything...or nothing!\nINQUISITOR\nExplain yourself!\nPHILIP\nHe must go away...or by the sword..\nINQUISITOR\nWell then?\nPHILLIP\nIf I strike down the prince, will your hand absolve me?\nINQUISITOR\nThe peace of the world is worth the blood of a son.\nPHILLIP\nCan I as a Christian sacrifice my son to the world?\nINQUISITOR\nGod sacrificed his own, to save us all.\nPHILLIP\nCan you justify in all cases such a harsh faith?\nINQUISITOR\nWherever a Christian follows the faith of Calvary\nPHILIP\nWill the ties of nature and blood remain silent in me?\nINQUISITOR\nEverything bows and is silent when faith speaks!\nPHILLIP\nIt is well!\nINQUISITOR\nPhillip II has nothing more to say to me?\nPHILLIP\nNo!\n\nINQUISITOR\nThen I shall speak to you, Sire!\nIn this beautiful land, untainted by heresy,\nA man dares to undermine the divine order.\nHe is a friend of thee king, his intimate confidant,\nThe tempting demon who is pushing him to the brink.\nThe criminal intent of which you accuse the prince\nIs but child's play compared to his,\nAnd I, the Inquisitor, I, as long as I raise\nAgainst obscure criminals the hand which wields the sword,\nWhile forgoing my wrath against those with power in the world,\nI let live in peace this great wrongdoer...and you!\n\n(Note: And you thought your family was messed up!)\n\nWhich composer from our syllabus most likely composed this work? List three\nsignificant reasons for your attribution.\n\nExample 2.\n\nWhich composer from our syllabus most likely composed this work? List two\nsignificant reasons for your attribution. Does any part of this material resemble\nthe work of another composer we have studied? If so name the composer and\nwork in question.\n\nExample 3. The translation is included below.\n\nTasty vegetables of every kind\n\ngrow in heaven's garden:\n\nGood asparagus, beans,\n\nand whatever we want.\n\nWhole dishfuls are ready for us!\n\nGood apples, pears and grapes;\nThe gardeners let us have anything.\nIf you want deer or hare\non an open spit\nthey come running up.\nShould a fast-day occur\nall fish gladly swim along!\nSt Peter already hurries\nwith his net and bait\ninto the heavenly fishpond.\nSt. Martha must be the cook.\n\nWhat composer from our syllabus most likely composed this work? List three\nsignificant reasons for your attribution.\n\nPart III. (25 minutes) There are two methods for taking this part of the quiz:\nA: You may take the final 25 minutes of the exam to answer the question based\non the notes you have prepared. Open book.\nB: You may prepare a mini-essay, chart, etc. of no more than three pages\nmaximum. You will simply hand this in after Part II and leave.\n\nChoose ONE of the following topics:\n\n1. Imagine that you are a film composer/arranger. You have been asked to\nscore a new film version of Tolkien's \"The Lord of the Rings\". The\ndirector is a Wagner freak and wants you to use music from Act II of\nWalkure in the film. Which parts of Wagner's music do you match up to\nwhich of Tolkien's characters and/or events.\n\n2. Vienna 1875. You are a rabid young partisan of either the Savior of\nGerman music---Richard Wagner, or the Savior of German Music---\nJohannes Brahms. In a short but vicious pamphlet convince me (based on\nreferences to their works) of the utter superiority of your Hero.\n\n3. Discuss the impact on you, as a listener, of the \"narratives\" of three\nprogrammatic pieces in our syllabus. How does the knowledge of the\nprogram affect your experience of the piece? Is it important, or could your\ndo without it? In short, how important a component is the program in each\nof your three selections."
    }
  ]
}