{
  "course_name": "Science, Technology, & World",
  "course_description": "This class is an introduction to studies in science, technology, and society (STS), through examining a series of issues, events, conflicts, and problems as illuminated by STS approaches. This iteration includes units on the Aaron Swartz case, photography, and utopia / dystopia. There are regular guest speakers, and several field trips to encourage hands on learning.",
  "topics": [
    "Fine Arts",
    "Visual Arts",
    "Photography",
    "Social Science",
    "Anthropology",
    "Communication",
    "Sociology",
    "Fine Arts",
    "Visual Arts",
    "Photography",
    "Social Science",
    "Anthropology",
    "Communication",
    "Sociology"
  ],
  "syllabus_content": "Course Meeting Times\n\nSeminars: 2 sessions / week, 1.5 hours / session\n\nDescription\n\nThis is a brand new class intended as an Introduction to STS Studies for undergraduates--something the STS Program has never offered before. You have the opportunity to take the class on its maiden voyage. This class was designed in detail by other MIT undergraduates who were enrolled in an upper-class STS seminar last fall. The team project throughout the term was to design an Intro to STS subject for undergraduates. In numerous ways the features of STS.004 reflect the collective wisdom of your fellow students, and you can add to that wisdom by giving the subject its first full workout.\n\nOfficial Catalog Description: STS.004 introduces students to multidisciplinary studies in Science, Technology, and Society (STS), using four case studies to illustrate a broad range of approaches to basic principles of STS studies. Case studies vary from year to year, but always include a current MIT event. Other topics are drawn from legal and political conflicts, and arts and communication media. Teaching modes include guest presenters, discussion groups, field activities, visual media, and a practicum style of learning.\n\nPrerequsites\n\nNone.\n\nAttendance\n\nRequired.\n\nIf you miss any class due to an unavoidable conflict (such as a job interview), you need to discuss make-up work with the instructor in advance.\n\nLaptop Policy\n\nPlease bring copies of your written work and of any readings to class, whether on a computer or in hard copy. You are welcome to use a computer in class so long as it is for class-related work only.\n\nAcademic Honesty\n\nWe will discuss MIT's principles and procedures as summarized in\nMIT's Academic Integrity Handbook\n, especially the sections on Academic Writing.\n\nCollaboration is encouraged in discussing the work of the class. The work itself (writing papers, preparation of oral reports, taking quizzes) must be done on your own.\n\nAssignments\n\nNote that some short assignments are due the morning of the class day. This will allow time for the instructor to review them before class discussion in the afternoon.\n\nPapers\n\nSession 3: Current event as STS\n\nSession 12: Op-ed on Swartz case [required revision due by session 24.]\n\nOral Presentations\n\nSession 14: Further background / comment on Asilomar / Cambridge City Council\n\nWritten and Oral\n\nSession 6: MIT 150\nth\nExhibit examples (3 items)\n\nSession 20: Photography project\n\nSessions 25, 26: Student final reports\n\nQuiz\n\nSession 7: Key words and concepts\n\nThere is no final exam\n\nGrading\n\nAll written work will be graded for content, organization, clarity, and correctness. If the work is careless, sloppy, or otherwise unacceptable, you will be required to revise it. One paper (the op-ed assignment) must be revised. All papers may be revised, with permission from and preliminary discussion with the instructor.\n\nACTIVITIES\n\nPERCENTAGES\n\nOp-ed (on Swartz case)\n\nOp-ed revision\n\nPhotography project\n\nFinal reports\n\nQuiz\n\nCurrent Event As STS (paper)\n\nFurther background / comment on Asilomar / Cambridge City Council\n\nMIT 150 Examples\n\nOther assignments\n\nAttendance and participation\n\nClass Schedule\n\nSES #\n\nTOPICS\n\nKEY DATES\n\nUnit 1: Introduction to Studies in Science, Technology, and Society\n\nIntroduction to Content and Format of the Class\n\nBasic questions, terms, and approaches of STS studies\n\nStudent generation of examples\n\nIntroduction to Key Words and Concepts\n\nFurther discussion of key words\n\nCurrent Examples of STS Questions\n\nWriting due: Short paper (750-850 words) on a current event as an STS issue\n\nIntroduction to key words and concepts (cont.)\n\nSTS at MIT\n\nQuiz preparation\n\nSTS at MIT (cont.)\n\nGuest Speaker: Debbie Douglas, Director of Collections and Curator at the MIT Museum\n\nWritten and oral presentation: MIT 150\nth\nExhibit examples (students choose three items and explain how each illustrates the intersection of science, technology, and the world)\n\nQuiz\n\nQuiz on key terms / concepts\n\nDiscussion of quiz\n\nUnit 2. MIT and the Law: The Prosecution of Aaron Swartz\n\nThe Swartz Case and the Abelson Report\n\nDiscussion (groups): What did you learn about this case? What questions do you have? Discussion of Swartz case as an STS issue. Mapping exercise: actor network, with attention to institutions and audiences\n\nPublic Responses\n\nOptional: Questions for Hal Abelson (in addition to class-generated questions)\n\nVisit from Hal Abelson, MIT Professor and Writer of the Abelson Report\n\nEditing exercise\n\nDeveloping ideas / rough drafts for opinion piece (self-taught)\n\nScience and Self-regulation\n\nPaper due: Opinion pieces\n\nVisit to MIT Archives\n\nLegal Issues (cont.)\n\nShort presentations to class on opinion pieces.\n\nScience and Self-regulation (cont.)\n\nShort presentations to class on further research into Asilomar Conference of 1975 or Cambridge City Council resolutions of 1976.\n\nUnit 3: Photography as Information Delivery System\n\nPhotography as technological innovation\n\nUsers, Consumers, and Producers\n\nDiscussion of technical means, audience, motivations, impact\n\nField trip to Stata Center\n\nFrom Analog to Digital\n\nGuest: Karin Rosenthal, Photographer\n\nPhotography as Time Travel\n\nVisit to Kurtz Gallery: Stanley Greenberg: Time Machines exhibit\n\nPhotography and Science\n\nGuest: Gary Van Zante, MIT Museum Curator of Architecture & Design, on works of Berenice Abbott\n\nStudent project due\n\nPresentation and writing due: Photograph and commentary\n\nUnit 4: The Sense of an Ending\n\nWhere Are We Headed?\n\nFinish up discussion of photography projects\n\nLetter to Abelson: Class work\n\nWhere Are We Headed? (2) (cont.)\n\nLetter to Abelson: Class work\n\nAlso discussion of final projects\n\nA Deaf Utopia and Other Utopias\n\nGuest: Sheila Xu, MIT Alum and Deaf Advocate\n\nBack to the Beginning: What Is STS?\n\nLast date to turn in revision of opinion piece on Swartz case\n\nEndings and beginnings\n\nStudent final reports: What did you learn? Favorite topics? Last favorite? Why? How do you see yourself using information or skills from this class in the future?\n\nEndings and beginnings (cont.)\n\nStudent final reports\n\nClass evaluations (done in class)",
  "files": []
}