{
  "course_name": "Scientific Visualization across Disciplines: A Critical Introduction",
  "course_description": "This subject exposes students to a variety of visualization techniques so that they learn to understand the work involved in producing them and to critically assess the power and limits of each. Students concentrate on areas where visualizations are crucial for meaning making and data production. Drawing on scholarship in science and technology studies on visualization, critical art theory, and core discussions in science and engineering, students work through a series of case studies in order to become better readers and producers of visualizations.",
  "topics": [
    "Engineering",
    "Computer Science",
    "Graphics and Visualization",
    "Social Science",
    "Communication",
    "Engineering",
    "Computer Science",
    "Graphics and Visualization",
    "Social Science",
    "Communication"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 3 hours / session\n\nAssignments and Expectations\n\nStudents will have several readings to complete each week and will also be expected to write about them.\n\nStudents must also be prepared to present in class on readings on two different weeks. Specifically, bring to class a visualization and discuss it.\n\nStudents will also be expected to actively participate in class by raising questions and leading discussions.\n\nThere are three assigned papers:\n\nProject 1: Archaeology of a Visualization\n\nProject 2: Interview with a Visualizer\n\nProject 3: Visualization Teaching and Counter-Visualization\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nProblem Sets\n\n20%\n\nProject 1\n\n20%\n\nProject 2\n\n20%\n\nProject 3\n\n30%\n\nPresentation\n\n10%",
  "files": [
    {
      "category": "Resource",
      "title": "Instruction Guide",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-067-scientific-visualization-across-disciplines-a-critical-introduction-spring-2005/a870757cb448ab9b39b2d055788334ad_instr_guide.pdf",
      "content": "Instruction Guide\n\nIf you are presenting one of the required readings, then you should prepare a short\ndiscussion (about 5 minutes), describing the article, what you think the author's aim was\nin writing it, a 2-3 key arguments that you found persuasive or not (and why you found\nthem so), and finally a set of 3-4 questions that you would like to pose for discussion.\n\nIf you are not presenting, send to the TA two paragraphs in which you use concepts from\ntwo of the readings to discuss how the graph or images are used in the Lancet article.\n\nHere are some concepts to get you started, but please feel free to discover additional\nones: making real, gaze specific to genetics (or another technical field), looking without\ntouching (from Keller); selection, mathematization, \"making into facts, and other more\nspecific forms of transformation and translation (from Lynch); too much faith in pictures,\naccuracy versus quality of information, and seeing a problem versus understanding it\n(from Gladwell); and other concepts from my chapter.\n\nThe idea is that you are becoming more specific and analytic about how visualizations are\nconstructed and deployed. This is not always a criticism of the use, it can also be an\nappreciation of how a point was made visible, enhanced, or further specified through\nthese concepts.\n\nFeb 8"
    },
    {
      "category": "Assignment",
      "title": "Problem Set 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-067-scientific-visualization-across-disciplines-a-critical-introduction-spring-2005/4b9614d1de50b75074d27e22a2b1ce53_pset1.pdf",
      "content": "Problem Set 1\n\nPlease visit:\nhttp://www.cybergeography.org/atlas/atlas.html\nand look through the many visualizations organized on this site. Click through to the\nlarger pictures, locate their home pages.\n\nBy Monday night at 10, post on MIT server (under Discussion) a couple of paragraphs\ndescribing which visualization you think provides the most meaningful account of the\ninternet, and exactly why: what does it do well? What does it make meaningful? Why\ndo other visualizations not do such a good job? What does it assume about the internet\nthough? What definition of the internet does it suggest? What does it leave out?\n\nAgain, please use at least two concepts from the readings this week or last week's, to\nmake your evaluation more specific.\nFeb 15"
    },
    {
      "category": "Assignment",
      "title": "Problem Set 2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-067-scientific-visualization-across-disciplines-a-critical-introduction-spring-2005/ffb45d8c342f84703270d4e382aaf6d6_pset2.pdf",
      "content": "Problem Set 2\n\nPlease bring to class a copy of the visualization you are working on for your first project\nand be prepared to discuss it and your approach to researching it.\n\nPlease visit the various Visible Human projects on the web. Here is the starting point:\nhttp://www.nlm.nih.gov/research/visible/visible_human.html\n\nPlease write a paragraph (and post on MIT server) in which you identify a claim about visual\npower in each of the articles in this week's required reading, and then describe the\nevidence used by each author to make their argument and in a second paragraph: what\nkind of experiment or study you think would generate better evidence (or a better\nargument).\n\nFebruary 22"
    },
    {
      "category": "Assignment",
      "title": "Problem Set 3",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-067-scientific-visualization-across-disciplines-a-critical-introduction-spring-2005/454df375d545801552e0ebc08e8979c0_pset3.pdf",
      "content": "Problem Set 3\n\nOnline, please discuss Hacking's concept of \"seeing,\" Kaiser's of \"realism,\" and\nGalison's of \"no raw data\" in terms of the visualization you are working on for your first\nproject. Begin with a paragraph defining at least two of these concepts (or others from the\nreadings) in your own language, and then in a second paragraph, illustrate how they can\nbe use with your visualization as an example.\n\nMarch 1"
    },
    {
      "category": "Assignment",
      "title": "Problem Set 4",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-067-scientific-visualization-across-disciplines-a-critical-introduction-spring-2005/17d738795de80db3777311450cda0362_pset4.pdf",
      "content": "Problem Set 4\n\nPlease visit BioClips.com\nhttp://www.bioclips.com/festival.php3?id_rubrique=3\n\nPlease view a few of the different clips and in your MIT server posting, discuss them in light\nof the readings. What does motion add to photographs, diagrams, and description? What\ncosts are there? Be sure to answer these questions specifically in relation to a clip and an\narticle.\nMarch 15"
    },
    {
      "category": "Assignment",
      "title": "Problem Set 5",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-067-scientific-visualization-across-disciplines-a-critical-introduction-spring-2005/0ab8c4c138e7b3242759a4583974f2fc_pset5.pdf",
      "content": "Problem Set 5\n\nTake a moment to look at the Protein Data Bank\nhttp://www.rcsb.org/pdb/\nand if you need a refresher, check out:\n\nProtein Structure Basics\nhttp://www-structure.llnl.gov/Xray/tutorial/protein_structure.htm\n\nthis is from Crystallography 101\nhttp://www-structure.llnl.gov/Xray/101index.html\n\nand to see the many kinds of modeling challenges, glance at:\n\nJudging the Quality of Macromolecular Models\nhttp://www.usm.maine.edu/%7erhodes/ModQual/\n\nProfessor Catherine Drennan of the Chemistry dept. will be our guest speaker.\n\nPlease look these sites over:\n\nhttp://www.umass.edu/molvis/francoeur/levinthal/lev-index.html\n\nand there are quicktime movies at:\nhttp://www.umass.edu/molvis/francoeur/movgallery/moviegallery.html\n\nWorth a look to compare with what is being done today.\n\nPlease post on the MIT server a discussion of what these three authors mean by \"models\" and what\nthey would say the relationship is between a \"model\" and a \"visualization\". The idea\nhere is to come up with some distinctions among them. For each, you might want to\nquote a sentence and then explain how the term is used in the context of the rest of the\narticle.\n\nMarch 29"
    },
    {
      "category": "Assignment",
      "title": "Problem Set 6",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-067-scientific-visualization-across-disciplines-a-critical-introduction-spring-2005/05329e9d563a4961f2fc8ba778b1d13a_pset6.pdf",
      "content": "Problem Set 6\n\nLinks to Pymol and the Protein Data Bank\nhttp://pymol.sourceforge.net/\nhttp://www.rcsb.org/pdb/\n\nPost on the MIT server about your experiences with the following land cover assignment by Sara\nFriedman (or if you can't get your computer to handle them -- about another visualization\nprogram you have used), being sure to bring in at least one concept or thesis from\nEdwards or Schienke. extra points if you try both experiments.\n\nStart an internet browser - make sure you know how to enable pop-ups (on IE, hold\nControl key down).\nGo to http://seamless.usgs.gov/\nClick on the United States map to \"View and Download United States Data\"\nIt may take awhile to load. Be patient.\n\nWhen you move the mouse onto the map, cross-hairs appear. Click and drag to outline\nan area you wish to find images of - for example, your hometown. When you draw your\nbox, the map zooms in to the extent of the box. Continue zooming in until you can see\nthe name of your town and some neighboring towns.\n\nOn the left of your screen, you can see two tabs: Display and Download. Play around\nwith the Display tabs to see what kinds of images are available in your area at the\nresolution of your map.\n\nYou may find that you are too zoomed-in to see some of the images very well. Above the\nDisplay and Download tabs is a Scale bar. Make sure you are a little to the left of the\nmiddle of the scale. Click on the zoom-out or zoom-in icons around the bar to change the\nscale.\n\nClick on the Download tab. Deselect the elevation data and any other preselected data\nyou don't want. Click on Land Cover -> NLCD 1992 Land Cover.\n\nTo the left of the map on your screen, see Zoom, Query, Download, Documents with\nlittle icons under each heading. Under the Download heading, click on the arrow/box\nicon.\n\nNow when you select your box, you will be selected the areal extent of your downloaded\nimage.\n\nA screen pops up showing the files for the data you selected. (Sometimes this doesn't\nwork. Make sure you have selected the right dataset on the Download tab and you are at\nApril 5\n\na reasonable scale. Worst comes to worst, start over.)\n\nClick on \"Download.\" A screen appears telling you the progress in filling your request.\nAt this point, enable popups and make sure popups stay enabled throughout the extraction\nand download process. Otherwise it will fail and you have to go back and send the\nrequest through again. The file comes up as a file named <string of digits>.zip. Save the\nzip file to disk.\n\nInside the zipped file is a *.TIFF image. This kind of file can be viewed with standard\nimage viewers. Extract the tiff and take a look. Can you recognize your local woods\n(green), lakes and waterways (blue), and developed areas (pink/red)?\n\nTo learn about where the data comes from (satellites and models) and how the\nclassifications (i.e. colors) are assigned, check out:\nhttp://landcover.usgs.gov/prodescription.asp"
    },
    {
      "category": "Assignment",
      "title": "Problem Set 7",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-067-scientific-visualization-across-disciplines-a-critical-introduction-spring-2005/7e4625c7aee318c4574aa9686d0b4c1b_pset7.pdf",
      "content": "Problem Set 7\n\nI want to continue the question of visualization and models on climate change more\nbroadly, addressing the issue of audiences and forms of persuasion. Here are four ways\nof writing about models and debate. Read them and then go online and look at different\nways of presenting data on climate change. Pick at least two that you find persuasive\n(these can be visualizations or websites) and discuss on the MIT server why you found them\npersuasive and whether or not the Oreskes Science article helped you thinking about this\n-- be sure to bring in at least one concept from the readings.\nApril 12"
    },
    {
      "category": "Assignment",
      "title": "Problem Set 8",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-067-scientific-visualization-across-disciplines-a-critical-introduction-spring-2005/267d9ed2e8d10e6c5ed1b72d20b888b3_pset8.pdf",
      "content": "Problem Set 8\n\nOnline, please visit a pharmaceutical website and discuss on the MIT server how visuals are used\non the site using concepts from these readings.\nApril 26"
    },
    {
      "category": "Assignment",
      "title": "Problem Set 9",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-067-scientific-visualization-across-disciplines-a-critical-introduction-spring-2005/6a69cf5ab0c9bfbf8bc2c3f2508b65d8_pset9.pdf",
      "content": "Problem Set 9\n\nPlease post on the MIT server a discussion of the visualization you did one of your projects on, and\nwhat sort of evidentiary concerns the court should have about it. Be sure to use concepts\nfrom the readings.\nMay 3"
    },
    {
      "category": "Resource",
      "title": "Project 1: Archaeology of a Visualization",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-067-scientific-visualization-across-disciplines-a-critical-introduction-spring-2005/9df281ebb47c6a2c8709165921a95125_project1.pdf",
      "content": "Project 1: Archaeology of a Visualization\nDue Date: 7 days after session 5, 10 pm\n1. Pick a visualization, start with a single example of one, ideally printed, or a screen shot\nif it is never printed. A detailed paragraph describing it. How much information can you\npack into a paragraph?\n2. Who made it? How may people were involved? What were their roles? Does this\nreflect a division of labor along training lines (students, grads, postdocs) or technical\n(specific technicians, outsourced work). How much of it could be done by one person?\nWho is being trained on the job?\n3. What made it? How many machines of all sorts were involved? What software\npackages? Where were these made? Were they bought, made, modified, off-the-shelf,\ninvented here? How was the original data made - experiments?\n4. How was it made? (could be combined with 3) How many processes can you identify\nand outline? What assumptions can you identify or guess at in these processes? How long\ndoes each step take? How long does the visualization take to make? Are some of these\nprocesses very new, being invented on the fly?\n5. Where does it go? Where is this visualization used? Does it travel to popular culture?\nDoes it travel alone (as visual) or with captions or with text? How does it interact with\nthe text it is with - does one take priority over the other? Does the visual itself change\nwhen it travels? Do the assumptions it invokes change? How?\n6. What series is it part of? Are there other visualizations just like it? Does it have\nsiblings at the same lab? Is it one of a whole brood? Does it have ancestors - prior\nvisualizations that anticipate it? Does it have cousins at other labs? What differences are\nthere among its relatives?\n7. Conclusions you have about the visualization. The point is to get as specific as possible\nabout how the assumptions are used, the advantages and limitations of them, and your\nown evaluations of this. You are not necessarily criticizing the visualization but restoring\nthe work put into it and the context it requires.\nIf there are some questions you can't answer, suggest ways you could get the answer.\nLength: At least 1600 words (approx 5 pages). You are not to quote more than a phrase or\nshort sentence at a time and no summaries. Don't forget Bibliography of your sources.\n\nGrading:\n- A: Excellent writing, careful descriptions with citations, critical use of concepts\nfrom class with citation, use of secondary or contextual literature (other articles).\n- B: Good writing, flow of paragraphs, respond to all questions, identification of\nassumptions, use of concepts from class.\n- C: Good grammar, Good descriptions."
    },
    {
      "category": "Resource",
      "title": "Project 2: Genealogy of a Visualizer",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-067-scientific-visualization-across-disciplines-a-critical-introduction-spring-2005/fb0d8c6cdef07e461e96d39187b41e47_project2.pdf",
      "content": "Project 2: Genealogy of a Visualizer\nDue Date: 3 days after session 6, 10 pm\n1. Pick a visualizer, someone who produces or works with scientific visualizations.\nShould be at least a grad student, ideally a professor or post-doc. Do some preliminary\nresearch about them online, etc., you may have done this already based on your previous\nassignment.\n2. Contact them and ask if they would be willing to be interviewed. The interview will be\nshort 30min or one hour max. You are interested in their experience in their field, as a\nresearcher. This is a class assignment, it will be taped if they are willing. It will not be\nshared beyond the class without their complete permission. They don't have to answer\nany questions they don't want to. If they agree, ask for a CV and research them so you\ncan ask intelligent questions.\n3. Begin the interview by asking them how they chose their research career. From\nundergrad to grad, from grad to post-grad. Etc. Did they change topics or fields? Did\ntopics or fields change around them? Were there safer or riskier choices? Has that\nchanged today? Are there changes in gender, race or nationality that have happened? Do\nthey have an explanation?\n4. How were they trained? Did they learn techniques that have since been automated?\nHow valuable was that training (do they understand more than current students because\nof it)? Do they 'see' things differently because of their training? Do they/will they train\nothers in the same way (even if technically unnecessary)?\n5. What changes in research practice have they observed over the past 5 or 10 years - in\nhow labs are organized, in who is in labs (computer scientists, physicists, etc.), in the use\nof computers and simulations and programs? Have there been changes in authorship -\nmore people authoring papers, or less (e.g. in experimental physics)? Were these changes\nchallenging - did the field split? Have there been large changes in funding opportunities\n- has this shaped the sorts of questions asked? In IP (intellectual property) awareness?\n6. How interdisciplinary are their labs? Are there cultural or social differences as well as\nepistemological ones among the disciplines - what are they? Are new hybrid disciplines\ncoming into being?\n7. Are there differences in the presentation and use of visualizations in different labs?\nHow are students trained to recognize these? Are there standards for the presentation of\nvisualizations? What are the standards bodies? Are there disputes over standards? Are\nthere attempts to collect data in more raw format (ie. PDB) and how has this affected\npublication and lab networking?\n\n8. How are computer programs incorporated into research? (In house or off-the-shelf -\nAre these constantly changing or relatively static? Are there vendor relationships? Is\ncomputer programming and data storage a challenge for the lab? Is it a bottleneck? Has it\nalways been so?\n9. How is interaction/networking with other labs mediated - collaboration in person or\nonline, through conferences, only through publications?\n10. Thank them in person and with a followup email. Transcribe the interview or\nimmediately type up your notes. Write an essay, at least 1600 words (approx 5 pages,\nmight be longer). Describe the person and the field. It is understood that this is just one\nperson's perspective. You can bring in other sources if you wish. You must use and cite\nconcepts from class (including page numbers!).\nSubmit the paper and the transcript/notes by Mar 18, 10 pm.\nGrading:\n- A: Clear description of issues involved (many of the above sections covered).\nExcellent writing including critical use of concepts from class with citation.\n- B: Very good writing, flow of paragraphs, use of concepts from class.\n- C: Good grammar, Good account."
    },
    {
      "category": "Resource",
      "title": "Project 3: Visualization Teaching and Counter-Visualization",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-067-scientific-visualization-across-disciplines-a-critical-introduction-spring-2005/d85510b54302f316499a2d1686d79f55_project3.pdf",
      "content": "Project 3: Visualization Teaching and Counter-Visualization\nDue Date: 6 days after session 11, 10 pm\nThe ideal point of this project is to produce a visualization of a visualization that could be\nread by a senior high school student to learn from. Using the concepts we have discussed\nin this class, you can:\n1. Produce a web page or interactive analysis of a visualization. While you cannot use the\nsame visualization you made your first archaeology project on, you can choose one from\nthe same field. I do not want to see the same sentences either. Your page should introduce\nthe reader to the concepts you are covering, show how to analyze and critique a\nvisualization, and draw conclusions about reading other ones. It might illustrate the work\nthat went into it, the algorithms used along the way, the software programs, other related\nvisualizations and so on.\nThere should be total of at least 4 pages (1200 words) of text involved, and at least two\nconcepts and citations of readings from class. This might mean that after your illustrative\npage with captions, callouts, links to other pages, etc., you can have a few pages of just\ntext discussing the visualization more. In other words, the most minimal form of this\nproject would be a visualization followed by four pages written in a clear manner helping\na new student understand how to read the visualization.\n2. Instead of a web page, you can make a word doc, PDF or poster, following the same\nguidelines for 1.\n3. You can also choose to produce a counter-image: your own visualization that either\nworks against another visualization (such as a very misleading chart or map), or your\nown visualization that makes a teaching point about how visualizations persuade. This\nshould include 4 pages of writing as well.\nObviously I'm looking for creative approaches. You're all good at critiquing images. This\nproject is a challenge to produce your own visualization that helps others learn.\nWe will share them in class on May 10th."
    }
  ]
}