{
  "course_name": "Science, Politics, and Environmental Policy",
  "course_description": "This class examines the role of science in the US environmental policy-making process. It investigates the methods scientists use to learn about the natural world, the way scientific knowledge accumulates, the treatment of science by advocates and the media, and the role of science in legislative, administrative and judicial decision making. It also considers how other political systems use science in an effort to put the US approach in comparative perspective.",
  "topics": [
    "Social Science",
    "Political Science",
    "American Politics",
    "Comparative Politics",
    "Public Administration",
    "Environmental Policy",
    "Public Policy",
    "Science and Technology Policy",
    "Social Science",
    "Political Science",
    "American Politics",
    "Comparative Politics",
    "Public Administration",
    "Environmental Policy",
    "Public Policy",
    "Science and Technology Policy"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 3 hours / session\n\nDescription\n\nAll sides of the debate agree that environmental policy should be based on \"sound science.\" But adversaries disagree on what constitutes sound science, as well as on the extent to which we can and should rely on science to furnish answers to policy questions. The goal of this course is to gain a deeper understanding of the role of science and scientists in environmental policymaking. We begin by investigating the methods scientists use to learn about the natural world and the way scientific knowledge about the environment accumulates. We then examine the treatment of science by advocates and the media, as well as the role science typically plays in legislative, administrative and judicial decision making. We also look briefly at the extent to which science shapes international environmental regimes, as well as how other political systems use scientific information, in an effort to discern which attributes of the U.S. approach arise out of our peculiar institutional arrangements and which are more universal. Finally, we consider the potential benefits and drawbacks of mechanisms to increase public participation in both science-based decision making and decisions about which scientific endeavors government ought to fund.\n\nCourse Requirements\n\nThis is a seminar course, so students must come to class prepared to contribute thoughtfully to a discussion of the assigned reading. To that end, students will write a 2- to 3-page essay on the reading each week (please take careful note of the style and format points below). Students can skip essays for any two of the 12 weeks for which short essays are assigned.\nHard copies of weekly essays are due on Mondays at 5 p.m.\n(Late essays will get only partial credit; no essays will be accepted after 5 p.m. on Tuesday.) In addition to writing short weekly essays, students will write a 7- to 8-page final essay.\n\nEvaluations of Student Achievement\n\nStudents will be evaluated on the quality of their contribution to the class as well as on their written work. Grades will be based on the following,\napproximate\n, formula:\n\nACTIVIITES\n\nPERCENTAGES\n\nClass Participation\n\n20%\n\nWeekly Essays\n\n50%\n\nFinal Essay\n\n30%\n\nFormat Notes for Writing Essays\n\nAs you compose your weekly and final essays, please keep the following points in mind:\n\nFormat\n\nAll essays should be doubled spaced and in 12-point type. Please number pages and staple them.\n\nPage limits are firm; I will not read beyond the assigned length.\n\nUse reference-list format for all cited work. (You can find a guide to reference-list format in the\nChicago Manual of Style\n.)\n\nStyle\n\nShort, simple sentences are always better than long, complicated ones.\n\nActive voice is always preferable to passive voice.\n\nDirect, concrete statements are better than vague, indirect statements.\n\nWrite for an educated general audience, not for me or for classmates who have read the material.\n\nAlong the same lines, avoid jargon.\n\nAbove all, make everything you write lively and interesting!\n\nOther\n\nWeekly essays must be turned in by 5 p.m. on Monday. Late essays will lose partial credit (1 grade per day); no essays will be accepted after noon on Wednesday.\n\nThe 7th day after Lec #13 is the absolute last day to turn in the final essay.\n\nFinally, be vigilant about plagiarism, as it is an extremely serious offense and quite easy to avoid. When you quote another author, or simply paraphrase her ideas, you\nmust\ncite the source. There are no exceptions.",
  "files": [
    {
      "category": "Resource",
      "title": "11_373_day_1_cou.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-373-science-politics-and-environmental-policy-fall-2004/a7b0e65382925cd9a90b4f846bb91495_11_373_day_1_cou.pdf",
      "content": "11.373 Science, Politics, and Environmental Policy\nDay 1: INTRODUCTION TO THE COURSE\nI.\nRationale for the Course\nMy view is that:\n--This is one of the most important topics in the field of environmental policy. It's\ncritically important for practicing scientists, policymakers, advocates, and anyone\nwho's interested in understanding what happens in this realm. So this is a very\npractical course: It will help you understand the context in which you are\nworking, whatever area you are in.\n--I also think that graduate students--especially masters students--make a\nmistake in approaching graduate school simply as a time for acquiring \"practical\"\nskills. It should also be an opportunity to gain new perspectives and to become a\nmore thoughtful, reflective person. This class gives you the chance to step back\nfrom the kinds of \"how to\" courses you are taking and think about what difference\nknowledge actually makes in the world and why.\nWhy take this course with me?\n--This is a topic I've been thinking, reading, and writing about for about ten years,\nsince I started my dissertation in the mid-1990s. My perspective is that of a\npolitical scientist, not a natural scientist. That means I'm able to maintain a fairly\nbroad view of the roles that science can and cannot play in politics.\nII.\nGoals of the Course\nTo make you think about the relationship between science and politics and science and\npolicy--both empirically and normatively.\n--The picture we'll get is going to be complex and emergent, in the sense that I\ndon't have a fixed set of ideas I intend to push.\nMore generally, to help you become a more critical reader and thinker.\nAnd to help you become more articulate in talking and writing about what you've thought\nand read.\n--This is a discussion class, and I am going to try to help each of you to be clear\nand concise and logical in expressing your ideas, both orally and in writing. This\nis an explicit, rather than an implicit, goal of the course, so we'll actually have\nperiodic discussions about communicating more effectively.\n\nIII.\nThe Syllabus\nYou'll notice that there is a series of questions under each topic. You can use these to\nguide your reading and writing, but don't feel constrained by them. If you find something\nparticularly interesting in the reading, you are free to focus on that.\nI try to assign readings that give you a variety of perspectives.\nI also try to choose readings that are interesting and well written. This limits my choices\nconsiderably, as you can imagine.\nAt the end of each class, I'll give you a little background on the reading for the next class,\nand I'll tell you which pieces you can skim and which you need to read more closely.\nHere are some suggestions on how to approach the reading to make sure you are efficient.\n--What is the author's main argument, in a nutshell?\n--How does she defend that argument, logically? What empirical support does she\noffer?\n--If applicable, what are some of the major weaknesses, gaps, or inconsistencies\nin the argument?"
    },
    {
      "category": "Resource",
      "title": "11_373_day_10_in.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-373-science-politics-and-environmental-policy-fall-2004/e49416123bef3f1806a6ac5fcbf6d75c_11_373_day_10_in.pdf",
      "content": "11.373 Science, Politics, and Environmental Policy\nDay 10: SCIENCE IN THE INTERNATIONAL ARENA\nI.\nScience In The International Arena\nWhat general points do you get from the reading about international policymaking?\nWhat does the Social Learning Group conclude about the impact of science on policy\nover time, based on its review of policymaking in a variety of different countries?\nII.\nComparative Policymaking\nWe see from the reading that the very same evidence can lead to divergent results in\ndifferent countries. Why do different countries react differently to the same science?\n--What seem to be the key factors shaping how a particular country responds to\nscientific information?\n--Why, for example, might developing countries react differently than developed\ncountries to climate change science?\nWhat are some of the particular attributes of the U.S. political system that shape our use\nof scientific information?"
    },
    {
      "category": "Resource",
      "title": "11_373_day_11_co.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-373-science-politics-and-environmental-policy-fall-2004/59c20763789375796a5a1bb0ef3a67bd_11_373_day_11_co.pdf",
      "content": "11.373 Science, Politics & Environmental Policy\nDay 11: ADVOCACY SCIENCE VS. COLLABORATIVE SCIENCE\nI.\nWhy Collaborate?\nAccording to its critics, what's wrong with our traditional approach to environmental\npolicymaking--at least with respect to the use of science?\nWhat do you think of these critics--are they valid?\nBased on what we've read this semester, what do you think is good and what's bad about\nadvocacy science?\nHow do collaborative approaches to decision making remedy the deficiencies of the\nconventional approach, at least in theory?\n\n--Collaborative science (joint fact finding)\n--Collaborative policymaking (of which JFF may or may not be a part)\nWhat are some of the potential pitfalls of collaborative approaches to science (JFF) and to\ndecision making more generally?\nHow would you design empirical tests of the efficacy of adversarial vs. collaborative\nscience?"
    },
    {
      "category": "Resource",
      "title": "11_373_day_12_lo.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-373-science-politics-and-environmental-policy-fall-2004/aacb96d3796a658d1f3907ce517109a7_11_373_day_12_lo.pdf",
      "content": "11.373 Science, Politics, & Environmental Policy\nDay 12: LOCAL KNOWLEDGE AND POPULAR EPIDEMIOLOGY\nI.\nLocal Ecological Knowledge\nWhat, exactly, is local ecological knowledge?\nWhy do its proponents think LEK is so useful? What is the rationale for using it to make\npolicy decisions?\nCan you give some examples of LEK's utility?\nWhy should scientists be receptive to it? Why might they resist incorporating LEK?\nHow can scientists integrate LEK into their practice?\n--Modeling complex natural systems?\n--Does doing so require a major culture shift on the part of scientists?\nII.\nPopular Epidemiology\nWhat is popular epidemiology, and what was the impetus for it?\nWhat are the strengths and weaknesses of popular epidemiology as an approach to\nunderstanding environmentally caused health concerns?"
    },
    {
      "category": "Resource",
      "title": "11_373_day_13_ad.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-373-science-politics-and-environmental-policy-fall-2004/19d240526af4727bada2e21c5ce01968_11_373_day_13_ad.pdf",
      "content": "11.373 Science, Politics, & Environmental Policy\nDay 13: UNCERTAINTY, ADAPTIVE MANAGEMENT, AND\nTHE PRECAUTIONARY PRINCIPLE\nBoth adaptive management and the precautionary principle are ways of dealing with the\nuncertainty that is inherent in regulatory/environmental science.\nI.\nAdaptive Management\nWhat is adaptive management?\nWhat are the steps involved in doing adaptive management?\nHow is local knowledge related to adaptive management, at least according to Berkes?\nWhat are some of the potential (political) barriers to adaptive management?\nII.\nThe Precautionary Principle\nWhat, exactly, is the precautionary principle?\nWhy is the application of precaution so rare?\nWhat is the relationship between precaution and adaptive management, if there is one?"
    },
    {
      "category": "Resource",
      "title": "11_373_day_2_pol.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-373-science-politics-and-environmental-policy-fall-2004/38dc03243b6248d2fe348ed4a76cbaa4_11_373_day_2_pol.pdf",
      "content": "11.373 Science, Politics, and Environmental Policy\nDay 2: THE POLICY PROCESS AND THE POLITICAL DEBATE OVER\n\"SOUND SCIENCE\"\nI.\nThe Political Debate\nThe first few pieces we read for this week consisted of commentary on how science is\nused in politics. What are each of the authors arguing? What is each author's bias, or\nperspective? How does each author construct his/her argument? And what evidence does\nhe/she bring to bear?\nNote that the model of politics on which each of the authors' arguments rests is implicitly\na rational one, in which if we just got the science right, our policy decisions would make\nsense.\nII.\nThe Rational Model\nWhat would a rational model of policymaking look like?\nWhat role would we expect science play in policymaking if the rational model did\nprovided an accurate depiction of reality?\nWhat are some of the problems with the rational model?\nIII.\nThe Incremental Model\nKingdon presents a popular alternative to the rational model: The incremental model.\nWhat is the incremental model?\nWhat's wrong with this model? What doesn't it explain?\nIV.\nThe \"Powerful Interests\" Or \"Material Interest\" Model\nA model that is popular among political scientists it the \"material interests\" model, which\nemphasizes the ability of powerful material interests to achieve their aims in politics.\nThis is a model you'd have to deduce from Stone and from the rhetoric you hear all the\ntime. What would a model that emphasized the importance of conventional means of\nexerting political power look like?\nWhat role would science play in a material interests model?\n\nAgain, this model clearly captures quite a bit about politics. Can you see any problems\nwith this model?\nV.\nThe Garbage Can/Problem Definition Model\nBy combining the chapters you read in Kingdon and Stone, you can develop an\nalternative model of policymaking that focuses your attention on aspects of the process\nthat are ignored in the models we've talked about so far.\nWhat are the key elements of a problem definition/garbage can model of policymaking,\naccording to John Kingdon?\nHow does Deborah Stone's work add detail to the garbage-can model?\nHow do you get power in the polis?\nOur goal over the semester will be to figure out how this alternative model of politics and\npolicymaking, which emphasizes the role of ideas and persuasion as well as the\nsomewhat serendipitous nature of the process, helps us to understand the role of science\nin environmental policymaking.\n\nVII.\nFOR NEXT WEEK\nYou can write the essay for next week in one of two ways:\n--You can write a conventional essay that draws out very clearly what you regard\nas the major points of contention between scientists and sociologists of science\nwith respect to what scientific knowledge is, or you can write a dialogue that\nachieves the same purpose.\n--You should think about what seems to you to be a realistic position on what the\npractice of science is, what scientists do, and what scientific knowledge consists\nof.\nIn addition, I'd like the scientists in the class [identify them] to come prepared to talk\nduring the second part of the class about what they do and how they do it.\n--You might want to describe some research you're involved in and what it\nentails. But also, think about how you know what you know in science and why\nyou trust (or don't trust) that knowledge.\nThe non-scientists should be prepared to challenge the scientists from the perspective of a\nsociologist."
    },
    {
      "category": "Resource",
      "title": "11_373_day_3_sci.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-373-science-politics-and-environmental-policy-fall-2004/68877da3b89601205c099b736ea3c21d_11_373_day_3_sci.pdf",
      "content": "11.373 Science, Politics, and Environmental Policy\nDay 3: WHAT IS SCIENCE?\nI.\nWhat is Science?\nLet's begin by breaking down the two main, competing perspectives on what science is.\n--What is social constructivism? What are the premises that underpin this\napproach, and what's the basic argument that constructivists make about science?\n--Many practicing scientists consider themselves pragmatic realists, or\n\"essentialists\". How would you describe the position of practicing scientists, as\narticulated by Peter Medawar, a physician, and Ernst Mayr, a biologist? (Note\nthese are both life scientists. Several physicists, such as Roger Newton and Alan\nChalmers, have also written on this subject, but they are a little less compelling,\nmore positivistic.)\nII.\nQUESTIONS TO CONSIDER\nIs science superior to other fields/approaches in providing reliable and valid knowledge\nabout the world? If it is, why? If not, why not?\nDo scientists \"create\" facts, or do they discover them?\nAre prevailing scientific theories simply the ones that threaten the fewest scientists'\nprofessional well being, or are they supported by something other than socially\nconstructed consensus?\nWhy are these important questions? If scientists know what they are doing it science,\nwhy does it matter what anyone else thinks?"
    },
    {
      "category": "Resource",
      "title": "11_373_day_4_exp.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-373-science-politics-and-environmental-policy-fall-2004/32197497b793cfe534c62f08f51e0527_11_373_day_4_exp.pdf",
      "content": "11.373 Science, Politics, & Environmental Policy\nDay 4: REGULATORY SCIENCE, EXPERTS, AND EXPERTISE\nI.\nValues and Uncertainty in Environmental Science\nA main point that comes out of the readings you did for today is that science and values\nare inextricable in the practice of regulatory science.\nWhat is regulatory science?\nHow do values influence the practice of environmental science in terms of the approach\ntaken and the concepts that are developed?\n--How, for example, have values, social factors, etc., shaped the practice of\necology?\n--In what ways have values, etc., shaped the practice of climate science?\nAs the reading made clear, it's not just that social values shape the practice of science;\nscience also shapes values. How, for example, has the practice of ecology (or other\nenvironmental sciences) shaped values?\nValues also enter into the practice of environmental science as a result of uncertainty.\nWhat are some of the sources of uncertainty in environmental science?\nHow does the uncertainty inherent in the practice of environmental science relate to the\ninteraction between values and science? (Think, for example, about risk assessment or\nclimate modeling.)\nThe overall message in the reading is that there is no way of doing regulatory science that\nis not influenced by values in a variety of ways. In light of this, how do environmental\nscientists deal with these enormous uncertainties in practice? What are some general\nways you can keep the science \"scientific\"--that is, rigorous, defensible, credible--while\nacknowledging enormous uncertainties?\nII.\nScientists as Experts/Scientists as Advocates\nWhat is trans-science?\nWhat is an expert?\nWhat is the value of expert judgment?\nWhat makes a scientist credible as an expert?\nIn general, how do scientists maintain their credibility as experts in the policy process?\n\nWhat role do expert panels play in policy making?\nHow, exactly, do organizations like the NAS and other expert advisory panels maintain\ntheir credibility and authority to speak on policy issues?"
    },
    {
      "category": "Resource",
      "title": "11_373_day_5_adv.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-373-science-politics-and-environmental-policy-fall-2004/9600bfa3d9733b101f192fbf80da37f8_11_373_day_5_adv.pdf",
      "content": "11.373 Science, Politics, & Environmental Policy\nDay 5: ADVOCATES' USE OF SCIENCE\nI.\nProblem Definition and Causal Stories\nWhat are advocates and what do they do in politics?\nWhat are some of the general techniques advocates use to have a political impact?\nWhat is problem definition--also sometimes referred to as \"framing\"?\n--What are causal stories, which are so critical to the success or failure of a\nproblem definition?\n--What else is involved in problem definition, besides telling causal stories?\nWhy do advocates need causal stories? What are their political functions?\nIn the policy world, there is always choice about which causal factors in the lineage of\npossible factors to address, and different choices locate the responsibility and burden of\nreform differently (296).\nCan you use Deborah Stone's typology to analyze the causal stories crafted by advocates\nin the cases we read for today? (Be clear, though, that the boundaries among these types\nare fuzzy.)\nWhat kinds of stories are both compelling and credible? Why do some stories seem to\nwork better than others?\nStone points out that science exercises some kind of constraint on the successful assertion\nof causal theories. But what, exactly, is that constraint? How does it work?\nII.\nApplying Concepts to Cases\nLet's look at how advocates define problems and use science to tell causal stories in each\nof the cases we read for today:\nHow do Bolch and Lyons define the problem of climate change? (Hint: What do they say\nabout environmentalists' definition of the problem? What do they think we ought to focus\non?)\nWhat do Sarewitz and Pielke say about the way environmentalists have defined the\nproblem of climate change?\n\nHow does Wildavsky define the Alar problem? (Note that his formulation is very similar\nto Bolch and Lyons'.)\nThe Ehrlich's retaliate against work like Wildavsky's and Bolch and Lyons', which they\nsay is responsible for a \"brownlash.\" What are they trying to explain with respect to the\nrole of science in how environmental problems get defined?\nIII.\nGeneralizations\nBased on this discussion, let's try to formulate some generalizations about the role of\nscience in environmental problem definition:"
    },
    {
      "category": "Resource",
      "title": "11_373_day_6_med.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-373-science-politics-and-environmental-policy-fall-2004/29f23bd6d61df3f6bbb5124540d1e62e_11_373_day_6_med.pdf",
      "content": "11.373 Science, Politics, & Environmental Policy\nDay 6: MEDIA COVERAGE OF SCIENCE AND ENVIRONMENTAL RISK\nI.\nMedia Influence on Politics\nIn general, how do journalists decide what stories to cover and how to cover them?\nHow do editors influence journalists' choice of stories?\nHow do the media influence public views on issues?\nHow do the media influence policymakers?\nHow, even more generally, do the media shape the political context and hence political\naction?\nNote that there are feedbacks between the media and public officials and between the\nmedia and advocates; this is not just a one-way street.\nII.\nMedia Coverage of Science and Environmental Risks\nWhat generalizations can we make about the way the media covers science and\nenvironmental risks?\n--What sources do journalists typically rely on?\n--How do journalists treat environmental issues in their reporting?\nHow does media coverage influence public perceptions of science and environmental\nrisk?\nHow might media coverage of environmental risks affect politics and policy?\n--For example, what sorts of things have prompted media coverage of global\nenvironmental issues (like climate change or biodiversity loss)?\n--What has been the nature of the coverage of global environmental issues?\n--What do you think has been the impact of media coverage of these issues, and\nwhy?"
    }
  ]
}