{
  "course_name": "Science Writing in Contemporary Society",
  "course_description": "This class addresses the craft of writing about science in and for contemporary society, both its pleasures and its challenges. We will read essays, reportage, op-eds, and web-based articles on a variety of topics concerning science, technology, medicine and nature. Readings by contemporary writers such as Elizabeth Kolbert, Atul Gawande, and Michael Pollan will serve as examples of the craft and sources of ideas for our own writing.",
  "topics": [
    "Humanities",
    "Literature",
    "Academic Writing",
    "Creative Writing",
    "Criticism",
    "Nonfiction Prose",
    "Humanities",
    "Literature",
    "Academic Writing",
    "Creative Writing",
    "Criticism",
    "Nonfiction Prose"
  ],
  "syllabus_content": "Course Meeting Times\n\n2 sessions / week, 1.5 hours / session\n\nPrerequisites\n\nNone\n\nCourse Description\n\n\"Lively writing about science and nature depends less on the offering of good answers, I think, than on the offering of good questions.\"\n\n- David Quammen\n\n\"To write nonfiction, whether 'science writing' or any other kind, is an act of intimacy. You are inviting the reader into your world--into your mind, no less.\"\n\n- Elise Hancock\n\nThis class addresses the craft of writing about science in and for contemporary society, both its pleasures and its challenges. We will read essays, reportage, op-eds, and web-based articles on a variety of topics concerning science, technology, medicine and nature. Readings by contemporary writers such as Elizabeth Kolbert, Atul Gawande, and Michael Pollan will serve as examples of the craft and sources of ideas for our own writing. Some themes we may focus on: explaining what is and isn't science; understanding and communicating contexts; handling controversial topics; keeping \"the human element\" (Hancock) in sight; shaping longer narratives; appreciating the affordances and limitations of various media for telling stories about science.\n\nThe main work of this class is our own writing, which will include revision of each major assignment. Peer review and comments from the instructor will be plentiful. Principal writing assignments include 3 essays and a reading journal. An oral presentation will also be required.\n\nNotes:\n\nThis is not a technical writing class.\n\nThis class is normally required for majors in science writing\n\nOverview and Class Policies\n\nObjectives and Assignments\n\nThe primary work of this class is to:\n\nDevelop your skills in writing and speaking clearly and effectively;\n\nHelp you become aware of your own purposes as writers; and\n\nHelp you become aware of the audience(s) you are writing for.\n\nMore particularly, some of the goals of this class are to teach students to:\n\nCreate and shape texts in relation to different purposes, audiences, and rhetorical situations\n\nDevelop strategies for reading analytically, managing and structuring information, drafting, and revising\n\nEvaluate sources of information, integrate sources effectively for specific rhetorical purposes, and understand reasons for and systems of source citation in academic writing\n\nUnderstand how to critique other writers' texts constructively and to use the peer review process to develop their own texts\n\nDevelop the flexibility in word-choice and sentence construction necessary for conveying complex ideas coherently.\n\nMajor assignments\n. The Major writing assignments for this class are 3 essays, a reading journal, and an oral presentation. The longest of the 3 essays will be revised, with the option to revise the other 2.\n\nOur major assignments and when they are due are outlined in the\nAssignments\nsection.\n\nIn addition, shorter writing assignments will occasionally be given as homework.\n\nPortfolios\n. At our last class meeting I'll collect a portfolio of written work for our class--so don't throw any of your drafts or homework away!\n\nClass participation\n. Class participation includes attendance, class discussions and workshopping. Discussion is part of the oral work of a communications-intensive class: all students are expected to participate in class discussions.\n\nDiscussion should demonstrate not just familiarity with assigned readings, but also critical thinking and clear expression of ideas.\n\nFor good discussions, aim to build on each others' points, not just jump in with random points.\n\nAll students are also expected to respond to classmates' drafts thoughtfully.\n\nClass participation will make up 10% of your grade.\n\nReading Materials\n. Most class readings will be available via our class site. Some readings will be handouts or available through web links. Print out all readings--preferably before you read them!--and bring them to class so that you can participate actively in class discussions. It is not acceptable to read assignments on your cell phone.\n\nNote: Assignments are posted under \"Assignments,\" while the readings themselves are posted under \"Readings.\" There are no required books for this class, but if you have not already read it, I highly recommend\nIdeas into Words\nby Elise Hancock.\n\nHancock, Elise.\nIdeas into Words: Mastering the Craft of Science Writing\n. Foreward by Robert Kanigel. First Printing edition. Johns Hopkins University Press, 2003. ISBN: 9780801873300. [Preview with\nGoogle Books\n]\n\nDictionaries\n. Mac computers have a decent computer on board (via \"Tools\"), which you can access by highlighting words in texts you're reading or writing. Even better is the Dictionary app: on my Mac it's the New Oxford American Dictionary, and by keeping it on your dashboard, you'll be able to use it seamlessly. For those of you interested in learning more about words, or for whom English is a second language, I strongly encourage you to have, and use, a good\nhardcover\ndictionary.\n\nCourse Policies\n\nAttendance\n. This class is structured more like a workshop or seminar than a lecture class. Therefore, attendance is important: your responsibility in the class is not only to be a writer, but also to read and respond to classmates' work and to participate in discussions.\n\nIf you miss more than two classes for any reason, you risk getting a lower grade.\n\nIf you miss class on a workshop day, it will count as two absences.\n\nWith six unexcused absences you will be withdrawn from the class.\n\nSleeping in class will be counted as an absence.\n\nIt is your responsibility to let me know why you are absent and to keep up with assignments when you do miss class.\n\nLateness is discourteous to your classmates and to your professor. If you are 10 minutes late three times it will count as an absence.\n\nConferences\n. Because it's often more efficient and effective for us to have a conversation about your writing than to communicate via comments on papers, conferences are an important part of our work together. Bring specific questions about your writing, such as how to focus your topic or how to connect the ideas in your essay. You are also welcome to use conference time to continue discussions begun in class or try out ideas sparked by your reading.\n\nMIT students are required to have one conference with me but may have more.",
  "files": []
}