{
  "course_name": "Selected Topics in Architecture: Architecture from 1750 to the Present",
  "course_description": "This class is a general study of modern architecture as a response to important technological, cultural, environmental, aesthetic, and theoretical challenges after the European Enlightenment. It focuses on the theoretical, historiographic, and design approaches to architectural problems encountered in the age of industrial and post-industrial expansion across the globe, with specific attention to the dominance of European modernism in setting the agenda for the discourse of a global modernity at large. It explores modern architectural history through thematic exposition rather than as a simple chronological succession of ideas.",
  "topics": [
    "Fine Arts",
    "Architecture",
    "Architectural History and Criticism",
    "Fine Arts",
    "Architecture",
    "Architectural History and Criticism"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nCourse Description\n\nThis course is a general study of modern architecture as responses to important technological, cultural, environmental, aesthetic and theoretical challenges after the European Enlightenment. It begins with the archaeological digs into a classical past (Rome, Greece, Egypt) as well as exploratory travels into the \"others\" of Europe to examine the modern origins of architectural history itself within the profession. It ends with the contemporary era of \"globalization\" and the politics of \"development\" in the North and South and the relevance of such politics to self-titled trans-national practitioners such as Rem Koolhaas.\n\nThe course will subsequently reprise the history of architecture through its use of contemporary ideologies, such as organicism and technology, its provenance within administrative and legal structures, the changing conditions of the practice in response to economic conditions and structures of production, and their role in shaping and understanding social and aesthetic processes at large. Topics cover a wide range of debates on color, drawing, ornament, structure, construction, material, inhabitation, gender, class, race, nationalism, etc. in architecture.\n\nIn setting up these constraints, the course will also focus on aspects of architectural theory, historiography, and design in their complicity and resistance with texts of power, specifically with regard to the immense transformations wrought in different cultural contexts by colonial, industrial and post-industrial expansions, and the complicity of the ideas of European modernism in securing these arenas. The course therefore seeks to establish new conceptual relationships between canonical themes of modernity framed within a certain \"Europe\" in relation to the emergence of a global modernity in the world at large. The course explores modern architectural history and buildings through thematic exposition rather than as simple chronological succession of ideas.\n\nRequirements\n\nWeekly Assignments: 1 page response to readings and questions, due on weekends (9 required).\n\nClass Presentation.\n\nFinal Paper with original research content.",
  "files": [
    {
      "category": "Resource",
      "title": "responses_2_1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-645-selected-topics-in-architecture-architecture-from-1750-to-the-present-fall-2004/eaa393583444481931c88ee3aa0f209f_responses_2_1.pdf",
      "content": "2-1. Explain how the logic of the \"Big House\" and \"Slave Quarters\" might have\nstructured an entire territorial system in the United States.\nSprawl - the New Mt. Vernon\nOphelia Wilkins\nI read the phrase \"territorial system\" on two levels: a physical configuration such as the\njuxtaposition of the \"Big House\" to the \"Slave Quarters\"; Or an attitude of territoriality -\nan obsession with privacy and property which both the \"Big House\" and the \"Slave\nQuarters\" sought, but neither achieved. While specific physical configurations\nreminiscent of the \"Big House\"/\"Slave Quarters\" dichotomy exist in the U.S.,\nterritoriality is the lasting legacy of southern estates in our communities.\nCarl Anthony presents the \"Big House\"/\"Slave Quarters\" dichotomy in his description of\nMt. Vernon: \"The mansion is flanked by large trees, emphasizing the importance of the\nbig house, making it distant and monumental, while at the same time screening the\ndependencies.\" Anthony quotes a guidebook as saying \"only a carefully developed plan\ncould have subordinated them [the slaves] in such proximity to the main household and,\nat the same time, incorporated them as harmonious units of the group.\" Therefore, my\nliteral read of \"territorial system\" is a physical juxtaposition of social strata resulting in\ntension.\nIn Washington D.C., urban areas with some of the worst living conditions in the country\nare physically adjacent to government headquarters. Most likely, many who live in these\npoor neighborhoods are societal servants, allowing the city - and therefore the nation's\ngovernment - to function smoothly. Not surprisingly, D.C. consistently has one of the\nhighest crime rates in the country. Ironically, Anthony quotes Washington Irving as\nsaying \" A large Virginia estate was a little empire. The mansion house was the seat of\ngovernment, with its numerous dependencies, such as kitchens, smoke house, [etc.]\"\n(article 1, p. 13). Although this urban condition is prevalent throughout the U.S., it is not\nunique to the U.S. Rather, it occurs all over the world wherever social stratification is\nsuperimposed on density.\nOne consequence of density + subordination on large southern estates was complete lack\nof privacy. The slaves were watched at all times, although Anthony comments that the\ntypical screening of the dependencies \"was probably welcomed by the slaves because it\nafforded them some privacy from the activities of the main house.\" (article 1, p. 13). For\nslaves, a lack of privacy was equivalent to a lack of freedom. Slave owners, on the other\nhand, became oppressed by their own system. When estates often housed ten slaves for\nevery white person, the slaves infiltrated every facet of daily life, which many estate\nowners including Jefferson found \"annoying\". As one slave owner described: \"From\nmorning to night, wherever we turn, their faces meet our eyes.\" (article 2, p. 13).\nThe single territorial system unique to and most characteristic of the U.S. is sprawl.\n\nSprawl exemplifies our national obsession with privacy. In sprawling suburbs, everyone\nowns their own house, their own beautiful lawn, and their own car. Planned communities\nhave a greater sense of isolation than \"community\". We strive for a life of leisure, where\nwe want everything handed to us on a silver platter, regardless of how it got there. We\nrefuse to acknowledge the systems which support our livelihoods, perpetuating the least\nsustainable lifestyles in the world. We want to live in the Big House.\n\"The architecture of slavery ... tells of the hunger to create at any price an illusion of\nwealth, beauty, ease and graciousness in a land of harsh realities.\" (article 1, p. 9).\nMcMansions, anyone?\n\nJimmy Shen\nAn aspect of the relationship between the \"Big House\" and \"Slave Quarters\" can perhaps\nbe described as a boundary where the front side of the grounds serves to communicate a\npublic face and hidden behind the mechanism that sustains it. Everything about the \"Big\nHouse\" is designed to convey an image of importance and wealth. From the lengthened\napproach to the entrance from the driveway, to the flanking of the mansion with large\ntrees to draw emphasis to its grandeur, the \"Big House\" can be compared to the\ncontemporary American Facade. The \"Slave Quarters\" would be the building itself\nfunctioning to sustain the image of the facade. It can be seen as Venturi's culture of the\nsign where the maximum amount of energy in the design is put into the creation of this\nfacade and the building that is supporting the facade is created with only utilitarian\nconcerns in mind. With the facade there is also the will to create an idyllic world, one that\nexists only in fantasy designed to hide the rawness of the reality. It is a processed space\nthat is experienced, like the contemporary amusement park, the space used to generate\nand support the illusion is much more extensive than the amusement space itself. This\nfrontal structuring can be seen throughout the US extending even to the urban scale\nwhere whole streets are lined with facades that describe much less substantial buildings.\nPlaces like Los Angeles and Las Vegas for example are cities that are designed so that a\ntypical tourist visits the image rather than the reality. The whole experience has been\npredefined by capitalist interest. Entire areas of cities are designed to similar affect where\ninvestment is placed upon tourist destinations and major transportation nodes and lines,\nexisting almost as islands of development often with clear boundaries that delineate these\nspaces from poorer areas where there is minimal economic interest, places visited only by\nthose that reside there.\nThis model can be extended to the whole of the United States with its relationship with its\noverseas territories and commonwealths like Guam and Porto Rico. And perhaps on a\ngreater scale including the international economic and political relationships of its\nmultinational corporations with countries like China or Saudi Arabia for example. The\nmodel of the \"Big House\" and the \"Slave Quarters\" is prevalent everywhere in multiple\nscales in architectural and urban space, but the forces of capitalism prevent us from\npeaking behind its barriers. And perhaps these barriers are more impermeable today than\never before."
    },
    {
      "category": "Resource",
      "title": "responses_2_2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-645-selected-topics-in-architecture-architecture-from-1750-to-the-present-fall-2004/38dc07769f95eb21afdc5e76f6b30efd_responses_2_2.pdf",
      "content": "2-2. Inasmuch as Jeremy Bentham's proposal described a concrete proposal for a prison,\nthe French writer Michel Foucault has emphasized that the key innovation of the\npanopticon lay in the voluntary submission of its participants. Can you give one or two\ncontemporary examples of a panoptical mechanism? Elucidate in detail. (Hint: Airports,\nSurveillance cameras, university dormitories).\nMichael Ramage's response\nIf the true innovation of the panopticon is the voluntary submission of its participants,\nthen modern surveillance cameras in cities cannot be considered innovative in the same\nmanner, as submission to their use cannot be considered voluntary. Similarly, can one in\nfact consider the submission of prisoners in The Penitentiary voluntary?\nThe then-modern panopticon, in its subtle and unseen exercise of voyeurism and power,\nwas to be sure an improvement over the crowded, stale prisons that preceded it. Which\nalready incarcerated individual would not give up some personal freedom for such\nimproved conditions? The same line of reasoning is used in modern surveillance systems.\nJust last week, in a New York Times article on Chicago's new surveillance system, the\npolice officer in charge, Ron Huberman, was quoted as saying \"The value we gain in\npublic safety far outweighs any perception by the community that this is Big Brother\nwho's watching. The feedback we're getting is that people welcome this. It makes them\nfeel safer.\"\nThe innovation in modern panoptical devices is not the total surveillance of people, but\nthe processing of images allowed by new software. No longer are we just being watched,\nour behavior is being recorded and studied and, most importantly, compared to what is\nconsidered acceptable. As long as we believe that the powers designing and defining\n\"normal\" are a benevolent force, this system can be seen to act in the public good and be\na powerful panoptical device that lets \"them\" help \"us.\" But as soon as those powers\nbecome a controlling force, in fact or in perception, the panoptical device moves to\nbecome one that lets \"them\" help \"themselves.\"\nThat line is equally as blurry as the line which separates voluntary submission to\nsurveillance to unavoidable involuntary evil.\n\nKatherine James\nOne peculiar version of the panoptical device in modern society is the \"Your Speed is...\"\nroadside sign. This sign, by reflecting one's speed, essentially performs the same function\nas the dashboard speedometer, but externally and on a very large scale. The strange\ndichotomy of this device is that it works as an indicator of police omnipresence while\nsimultaneously being an exact replacement of that (human) presence. (One never sees a\npolice officer next to the sign, as the two are redundant).\nThe panopticon here, the \"all-seeing eye,\" induces voluntary behavior modification by\nmaking drivers understand the external recognition of their speed. Even beyond\nrecognition, the driver's behavior is also judged through the juxtaposition of the actual\nspeed limit and the \"Your Speed\" reading. All of this takes place with full knowledge of\nthe lack of human police presence, one that could cause ramifications for misbehaviors.\nThe sign can't take action beyond reflecting behaviors, yet people consistently slow\ndown in its presence.\nIn this way, the sign acts like a shadow the prisoner in the Panopticon prison would see\nhis own misbehavior in. He thereby realizes that this behavior is also seen by others and\nexposed to judgment. In the Panopticon prison, it is a moot point whether the police are\nactually present in the shadow or not--the fact that they could be is the behavior-guiding\nprincipal. With the road sign, the driver is actually quite certain that the police eyes are\nnot present, but the machine is so powerful an indicator of monitoring, that behavior is\nmodified nonetheless.\nInterestingly, a car radar detector- a seeming way out of the panoptical trap, makes no\ndistinction between an actual police officer monitoring speed and the sign doing the\nsame. This goes to show that devices can fool other devices, and that in fact there is no\ndifference in the monitoring technique and procedure. The difference is the implied\nconsequence. However, this difference seems completely irrelevant in terms of the\neffectiveness of the behavior modification.\n\nThe Voting Booth\nCatherine Fowlkes\nMichel Foucault's reading and analysis of Jeremy Bentham's panopticon focused in on\nthe voluntary submission aspect of the design. His observations align with a\ncontemporary society rampant with panoptical mechanisms in our physical space and in\ncyberspace.\nOne many-layered example of a contemporary panoptical mechanism is the voting booth.\nPhysically, it is an individualized space - designed for, and not allowed to be occupied by\nmore than, one person. The body that uses it is well documented through registration of\nsex, name, location and beliefs (party affiliation), and thus becomes highly\nindividualized.\nBy engaging in the act of voting, an individual is voluntarily submitting themselves to\nsurveillance on several levels. Though they are sequestered from other voters, they are\nassuming the gaze of a higher authority. This gaze is not direct - it is in fact invisible to\nthem - but it is implicit that their actions will eventually be viewed at a removed place\nand time and will have repercussions. The time and place of this viewing and\ndocumenting is not known, but the individual's behavior - that of voting - assumes that\nthis viewing will take place.\nAside from the space of the voting booth, voting itself is the ultimate act of self\nregulation. It is engaging in the system of government and discourse that exercises\nauthority. It doesn't just engage this system of authority, but supports it, perpetuates it,\nshapes it, advocates it, demands it.\nA rejection of this notion would not be to vote for a radical candidate or government, but\nrather to not register to vote, to not show up and not be accounted for.\nA voting society is a society that asks to be self regulated and has faith that this\nsurveillance is working. A demonstration of this faith was illustrated by the outrage of\nFlorida voters in the last Presidential election when their actions were not accounted for -\nwhen they realized no one was watching them.\n\nSpyware\nElizabeth Nguyen\nIn Discipline & Punish: The Birth of the Prison Michel Foucault emphasizes that the\nvoluntary submission of its participants is the key innovation of the Jeremy Bentham's\nPanopticon prison architecture. This submission through fear of surveillance is also true\nof how we use our electronic communications today. Surveillance of the internet is more\ninsidious than the Panopticon however, for instead of suppressing communication\nthrough separation of the subjects, it the surveillance of an intensely communicative\napparatus which allows for the separation of the collective crowd into a collection of\nseparated and controlled individualities.\nIn this comparison, the internet is not the new technology; but rather it is the development\nof increasingly sophisticated \"spyware\" that is used to monitor individual behavior for\npolitical, military, and commercial enterprises. According to Foucault, it is the formation\nof a body of knowledge that is highly specific to the individual that allows both the\ngrowth of control over masses of people and the mutually dependent growth of capital.\nProducts advertised as \"data security and management tools\" allow managers to track\nkeystrokes, email messages, and chat discussions within the private sphere of the office,\nthus improving the efficiency of the workers. The FBI's \"leaked\" memos regarding it's\nability to install spyware via an email virus, as well as the legalization of it's email and\nURL tracking software known as CARNIVORE in the Patriot Act of the U.S. Congress,\nis part of an overall scare tactic to curb the use of the networked communication devices\nin the service of political protests that occurs today on a global scale (for example, in\n2003 the global \"day\" of protests against the U.S. invasion of Iraq). Spyware may also be\nused by corporations to track the access of URL's of anyone who visits a particular\nwebsite and allows \"cookies\" to be installed. The food metaphors for data collection are\nindicative of the insatiable appetite for more knowledge, which in turn allows more\ncontrol. For example, a cookie may instruct a website as to which advertisements you\nwill be shown when you access the site at a later date.\nThrough the above examples, three specific criteria Foucault establishes relate closely\nwith the functioning of internet surveillance by the state and commercial enterprise.\nThese are 1) obtain the exercise of power at the lowest cost - economically and\npolitically through its discretion and relative invisibility; 2) bring the effects of this social\npower to maximum intensity and extend them as far as possible; and 3) link this growth\nof power with the institutional apparatuses (in this case, commercial enterprise and state\ncontrol).\nHowever, just as Bentham brought light and individual separation to a previously\ndungeon-based imprisonment system in order to improve discipline, the strategies for\ninternet surveillance must allow communication among the masses. What was once a\nweakness now becomes the means to expose criminal and/or unethical activity or\npolitical dissent. We have come to describe the accumulation of knowledge as the\nInformation Age. In a democratic sense, this term connotes the dissemination of power to\n\nthe masses, but the new technologies of spyware allow for the inverse centralization of\npower through vast repositories of knowledge in the service of commercial growth and\nstate control."
    },
    {
      "category": "Resource",
      "title": "responses_2_3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-645-selected-topics-in-architecture-architecture-from-1750-to-the-present-fall-2004/fb2d28e8d5e32133cead80e9132ddc7c_responses_2_3.pdf",
      "content": "2-3. Last week, in the session on archaeology, we observed how the disinterring of ruins\ncreated the positive terms for constructing a memory for the nation-state. Hortense\nSpillers' theorization of the \"vestibular space\" in the trans-Atlantic slave ship suggests\nthat, for some populations at least, such positive terms of patrimony may have become\nirrevocable in their emergence into modernity. Expand on this concept. Can you think of\nany other examples of such vestibular spaces? Qualify.\nThe vestibule, the body, and the closet\nNicole Vlado\nA site of institutional dislocation, Spillers describes the trans-Atlantic slave ship as a\nspace of cultural deconstruction. The slave ships embodied the site of a massive industry\nintended for the dehumanization of the slave. This was achieved through the erasure of\nthe identity of the individual through violent acts of detachment from all things familiar --\nlanguage, family, and comfort (spatial, cultural). Slavery in the United States would\nproliferate through an institutional system of control, produced in the form of social and\nlegal codes necessary for the physical and emotional rule over the slave; a process\ndescribed by Hortense Spillers as the transformation of \"personality into property\".\nThe slave-body became an object of commerce lacking an associative being. It was seen\nas mere flesh. In the case of female slaves, this distinction would be used to construct a\nsocial awareness of the body of white women, imbued with value, and seen as bodies in\nneed of protection and preservation. Conversely, the body of black women would\ndisempower that of black men, as they would lose their role as fathers in the\ndeconstruction of normative kinship patterns. Thus, the construction of the body of the\nfemale slave as a \"vestibular space\" provided the space through which white women were\nprotected, black men were castrated, and black women were (inversely) empowered\nwithin the constructs of a culture of slavery. It is through the body of the female slave\nthat new discourses of identity (African-American, feminist) emerge in the form of\ncounter-narratives within American history.\nThe term \"vestibule\", like threshold or doorway, implies passage through, or transition\nfrom, terms which can be associated with movement, both physical and cultural (as in the\ncase of the Civil Rights Movement and other cultural/social revolutions). The term recalls\nsacrificial symbolism, by which one body provides the opportunity for another body to\nbenefit. The body of the mother or the organ donor comes to mind as examples of\ncorporeal vestibules. However, both the mother and the organ donor lack the symbiosis\nof the female slave, whose vestibularity provides benefits to one group at the expense of\nthe other. This quality is not described by Hortense Spiller as a requisite attribute of\n\"vestibular space\" but it provides a complexity that allows the term a specificity within\nthe article \"Mama's Baby, Papa's Maybe; An American Grammar Book\".\nSpillers' use of the architectural term the \"vestibule\" reminds me of the space of the\n\"closet\" described by Henry Urbach in his discussion of concealed gay identity. In his\n\narticle, \"Closets, Clothes, disClosure,\" Urbach engages the idea of the closet as a space of\nstorage hidden from sight, existing outside of the boundaries of the room. Urbach\nhistoricizes the emergence of the closet as a space intended for the concealment of\nexcessive \"material acquisition\". In addition to this history, the relationship of the space\nbetween the closet and the room, the \"threshold\", is given great importance as a space of\ntransition that allows both the concealment and display of the closet's interior. These\ntheories serve as metaphors for gay identification, \"closeted\" behavior, and the coded\nlanguage emerging from the need to keep the door closed, as it were. Like Spillers'\nvestibule, the closet presents the social constructs that control the formation of identity.\nAnd here the complexity/symbiosis emerges, as the closet requires/insists on the\nconcealment of gay identity, but can only be constructed in the presence of that which is\nnon-closeted or public."
    },
    {
      "category": "Resource",
      "title": "responses_3_2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-645-selected-topics-in-architecture-architecture-from-1750-to-the-present-fall-2004/8a16355b11479e6e280a8c323255eca3_responses_3_2.pdf",
      "content": "3-2. Comment on the different ways in which the \"natural\" was constructed in eighteenth\nand nineteenth century speculations on landscape.\nKatherine James' response\nNaturalization, the oxymoronic term describing a process that re-inscribes the essence of\na subject to be natural, was widely applied in the eighteenth and nineteenth. Trends of\ndesigning the natural were found in politics, art, and landscape. Of course, all were\nparallels in a conversation about fundamental issues of nature and morality in the modern\nsociety. \"The great revolution in science and technology we associate with Sir Isaac\nNewton was followed by a massive shift in prevailing ideas about man's relation to\nnature\"(Marx, 74).\nThe French Revolution was a challenge to the pseudo-natural hierarchy of society, and\nembodied sharp ideas about individual identity and liberties across class lines. French\nprincipals of an ordered society were restaged as a result.\nWhat was challenged in France in politics was challenged in landscape as well: the\ndisparity between the representation of principals in an oversimplified, sterilized way and\nthe less systemized, more organic realities. The new world, in its rawness and relative\npurity from human intervention, was the new ideal of Europeans. \"If unimproved nature\nis the location of all that we desire, (as embodied by the new world) then civilization as\nEuropeans have known it can only signify a fall or lowering of man's estate.\" (Marx, 76)\nWith this, picturesque gardens abounded, meant to emulate this powerful natural\nabundance. Of course, the \"wild,\" \"overgrown\" gardens were designed specifically so.\nThis naturalization of the garden parlayed into the visual representations of this subject.\nAs Bermingham discusses at length, visual representation was on yet another parallel\ncritical path. We see Hearne and others demonstrating a leap to picturesque\nrepresentation, rebelling against a flattening of detail and instead representing\nindividualities of natural elements. Issues of true versus constructed scenes were played\nout. Artists of the picturesque would add detail, complicate a drawing rather than\nsimplify or abstract it.\n\"Naturalization denied the (visual) sign's arbitrary nature and made it appear to be a pure,\nimmediate, and transparent reflection of the referent\" (Bermingham, 88).\" In all of these\ncases of naturalization, the product was troubled by its process. A subject was presented\nas organic when it was in fact many steps removed from the organic essence it was\nclaiming to embody.\nThis debate finds another iteration in the field of architecture today. As the non-standard\nconference at MIT demonstrated, the use of the computer to program organic design\nevents is a complicated proposition. Only though challenging the process and being\nhyper-aware of the level of naturalization in this design process can these works be\njustified.\n\nJimmy Shen's response\nThe construction of the \"natural\" in the eighteenth and nineteenth century was\nfundamentally a struggle with the artificial nature of the pursuit of designing landscapes.\nThe two basic approaches can be characterized as one of simplifying and the other of\npreserving complexity of nature. In either case, because one can not deny the fact that\ndesigning and representing the \"natural\" landscape has always been a construction of\nman the contradiction gives an apt opportunity to ponder the relationship between control\nand freedom as ideological attitudes pertaining to politics and society. Landscape is\ntherefore seen as a metaphor of society and the techniques of representation provide a\nvisual and spatial expression of the prevailing ideologies of the time.\nTo the British the French Revolution embodied an attitude towards man that was too\nsimplistic. The revolution produced an idea of government that was based on abstract\nprinciples that were seen to gloss over the intricacies of reality where people are much\nmore complex and their habits unpredictable. Therefore a change can be seen in the\ndevelopment of the British attitude towards landscape where once the views were very\nmuch constructed and controlled an appreciation for the chaotic and the overgrown\nbecame a desired characteristic. An example of this change is the development of the\nappreciation for those small shrubby, untrimmed, gardens where nature appeared in its\nrough and offered small narrow views, moving away from the aesthetic of gardens by\ndesigners such as Lancelot Brown and Humphrey Repton which were typically\ncharacterized by panoramic views of rolling hills and well trimmed lawns. The\npicturesque garden is mean to narrow the view of the distance in order to enhance the\nappreciation of the diverse characteristics found in the intricate detail of the foreground.\nThe tendency was to move away from the effect of generalization by placing all things\ninto an all encompassing whole.\nBut the pursuit of what is truly natural never the less is still contaminated by the hand of\nthe man, of the need to create and control. Despite the intention to be less heavy handed\nin the creation of the landscape, it is still designed and artificial. The effect is only one of\ndisguising the construction and manipulation. It perhaps celebrates individual\ncharacteristics of the surrounding landscape and its parts but gardens are far from truly\nwild. Therefore the criticism from the British of the French Revolution can perhaps be\nseen as one that is only rhetorical but in any case represents a specific attitude during a\nvolatile time in history.\n\nLilly Donohue's response\nIn the early 18th century, weary of the overt formality of French landscape design, the\nEnglish celebrated a new concept in landscape which was driven both by a fascination of\nlandscape painting and an idealization of the simplicity of country life. This picturesque\nstyle of gardening was viewed as a celebration of the \"natural\" beauty of landscape in\nopposition with the French desire to dominate over nature itself. However, the\npicturesque was no less artificial in its construct of the \"natural\" than the highly ordered\nFrench geometry it aimed to criticize.\nThis new style of gardening was originally pioneered (at least in part) by William Kent\nwhose designs still clung to a sense of symmetry inspired by French and Italian gardens.\n\"Capability\" Brown was one of the first to attempt to reject these notions in favor of what\nappeared to be a \"natural\" attitude towards landscape. Brown condemned Kent's use of\nwater elements as \"a disgusting display of art.\" Instead he was inspired to create what he\ncalled \"natural\" lakes. Similarly he enjoyed carefully positioning clumps of trees to\nappear natural in the landscape. (\"Paradise on Earth\", Gabrielle Van Zuylen, p.89) The\ndesire was to create sweeping views of the surroundings which gave the impression of a\nvast and \"natural\" land to be appreciated. The fact that this gardening was no less\ncontrived was somehow irrelevant as long as the effect of \"nature\" was conveyed.\nIn \"English Landscape Around 1795\", Anne Bermingham writes of how the British\npolitical atmosphere began to dictate a shift from the panoramic views of \"Capability\"\nBrown to a more rugged and varied sense of \"the natural\". Uvedale Price, another British\ngardener viewed Brown's equalization of the landscape as a symbol of compliance with\nthe tenets of the French revolution. In order to reflect the English politics favoring class\ndistinction, he proposed a reading of nature that highlighted the aspect of individuality\nand variety, writing, \"I own it does surprise me, that in an age and in a country where the\narts are so highly cultivated, one single plan, and such a plan, should have been so\ngenerally adopted; and that even the love of peculiarity should not sometimes have\nchecked this method of leveling all distinctions, of making all places alike...\" (as quoted\nin \"English Landsape Drawing Around 1795, Ann Bermingham, p. 80)\nDespite the continued use of the landscape as a symbolic ploy, (in this case, by the\nFrench royalty to demonstrate domination, then by the English to romanticize philosophy\nand lifestyle, and subsequently to justify political agendas) it remains throughout an\nartificial construct. It is never \"natural\" or untouched by man, and consequently the\nrepeated attempt to use this synthetic nature as evidence of an underlying proof that\nstrengthens the given agenda is without foundation. Whether the garden can be perceived\nas false is irrelevant, it is in each case an equally careful manipulation of nature, and\nnever truly natural."
    },
    {
      "category": "Resource",
      "title": "responses_3_3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-645-selected-topics-in-architecture-architecture-from-1750-to-the-present-fall-2004/3537c1ea328cc70dc8b55cb2a87413f4_responses_3_3.pdf",
      "content": "3-3. Speculate on, by way of example, how the creation of maps, inasmuch as they\ndocument the existing state of the ground, relies as much on the pre-existing conceptions\nand interests of the mapmaking persons and institutions involved.\nMichael Ramage's response\nMaps are information, and information is power. Maps are of primary interest to the\nmilitary and to trade, both of which have been inextricably linked throughout human\nhistory. Maps are difficult to make, due to the amount of information they contain and the\narea they encompass. This makes them expensive, and even today they are a dear\ncommodity, especially in the forefront of mapmaking and digital data.\nBecause of the great effort and expense in their making, mapping is sponsored by those\nwith the appropriate resources, both financial and technical. Witness the European traders\nof the sixteenth century, who had accurate maps of the African coastline, as that was their\nprimary interest. The accuracy of the maps increased with the volume of trade and the\nextension of the route east to India. These maps were certainly closely guarded secrets,\nbut also, interestingly, of little to no use to Africans. The interest of the traders was\ncoastal routes, and only with beginnings of inland trade and colonization did mapping of\nthe interior of the continent begin, again for the benefit of the newcomers.\nMaps are sponsored by power, so they are inevitably bent in that direction. An example\nof this is one of the 20th century's unique contribution to mapping, global positioning\nsystems (GPS). Originally developed for missile guidance, the military discovered it had\ntremendous potential for mapping and locating troops and vehicles on the ground. Only\nwhen a Korean Airlines flight was shot down over the Soviet Union in 1984 (something\nwhich would have been preventable had the pilot had GPS and known exactly where he\nwas) did the government consider opening the system to commercial use . The\ncommercial applications of GPS became widespread, but with a caveat: the military\nintentionally degraded the signal and called it Selective Availability) to any non-military\nGPS unit. Even though accuracy to the level of a centimeter was possible with the\ntechnology, anyone other than the US military had to make do with accuracy only to 100\nmeters, so the technology couldn't be used against us. During the first Gulf War the\nmilitary had to change their policy, because there weren't enough military-grade GPS\nunits to serve the troops, but commercial units worked fine when the military stopped\naltering the satellite signals. Immediately following the war the government re-activated\nSelective Availability. Competition from other countries and the opportunities for\nlicensing the technology eventually convinced the military to stop degrading the signal.\n\nJames Smith's response\nMaps are representations of land and water surfaces. The technology of map making has\nsignificantly improved since the use of aerial photography. Early Maps relied on the\narticulation of site measurements and ground data by highly skilled, but relatively\nunknown cartographers. Maps were a representation of the cartographer and the\ninstitution they represented.\nEarly maps lacked the standardization that modern maps employ. Each map was a unique\ntestament of the author with a variety of symbols and scales used to articulate the mapped\narea. The variety in the maps influenced the way people read and understood the mapped\nsurface. The large variety of maps that were produced in the 18th and 19th century\ninfluenced the development of the \"language of maps' which allowed all data to be\nmatched, compared and compiled together.\"\nEarly maps \"responded to the pressing needs, particularly transportation information:\ncanal maps in the 1820's and 1830's, railroad maps and travelers' guides from the 1830's\nto the turn of the century, large scale county maps in the mid 1800s, cyclists' and\nthematic (economic and geological) maps by the 1890's.\" They represented the particular\ninterests of the institution developing the maps. For example early colonial maps of New\nEngland developed by the French, Dutch and English are examples of the distinct variety\nfound in colonial maps. According to David Y. Allen, the Dutch, influenced by their\n\"water-born trading empire\" provided detailed maps and charts of the coastline and major\nrivers. They also included information about their \"Indian trading partners.\" English\nmaps were preoccupied with boundaries and land ownership, reflecting their desire to\nacquire large amounts of land. French maps included detailed information of inland areas,\nfocusing on \"fur trading, missionary activities, exploration, and building their vast\nempire.\" Information concerning military posts, inland routes and native settlements were\nhighlighted in most of their maps. French maps were highly detailed representations that\nrequired a great deal of resources. Unlike the Dutch or British, French efforts were much\nmore \"centralized and under state control\" supported by Governmental resources.\nMaps that were produced in the 18th and 19th century throughout the World are not only\nrepresentations of land and water surfaces, but they are representations of their authors.\nEach map is a careful articulation of what the map-makers deem significant. They each\ninclude large quantities of information represented by various symbols, scales and\ntechniques of representation. Maps controlled information, and influenced political,\nreligious and military thought. The authors represented particular interests and articulated\ncertain pre-existing conceptions that reflected those interests.\n1:Edney, Matthew. \"Surveying and Mapmaking,\" Chapter 3 in Mapping an Empire; The\nGeographical Construction of British India. Chicago: The University of Chicago Press,\n1997. pg.96\n2: Mano, Margaret Jo. \"Annotated Bibliography of Selected New York State Maps:\n1793-1900\" http://www.nysl.nysed.gov/msscfa/mapsbibl.htm\n\n3: Allen David Y. \"French Mapping of New York and New England, 1604-1760\"\nhttp://www.sunysb.edu/libmap/french/frenchne.htm\n\nIndigenous Authority in the Relaciones Geograficas of Mexico\nElizabeth Nguyen\nPrior to Britain's 18th century mapping and documentation of India and its other\ncolonies, the Spanish Crown likewise required a detailed understanding of the land and\nresources it held in the Americas. In the 16th century however, the growing fields of\nmilitary and civil engineering, honed in the mapping of Britain and its territories, did not\nas yet exist. Spain instead relied upon a series of written questions posed to the\nindigenous leaders of Middle America (predominantly present-day Mexico) beginning in\n1577. Information requested included such topics as population, demographics, political\njurisdictions, languages spoken, physical terrain, and native vegetation. The illustrated\nand textual responses are collectively known as Las Relaciones Geograficas (examples of\nthe maps can be viewed online at http://www.lib.utexas.edu/benson/rg/index.html). These\nmaps expose the competing institutions of Spanish and indigenous authority.\nJust as the Spanish project came from a desire to maximize their extraction of resources\nfrom the colony and politically dominate its subjects, the indigenous leaders drew up a\nvision of their own military conquests and right to authority. The languages used to\ndefine place names are still contested-- some maps name with Spanish glosses, others\nonly native languages. Catholic Churches figure prominently, as do sacred places in the\nnative traditions. The technique of mapping differs from one to another map, sometimes\nmore expressive of the imposed colonial grid, and at other times a map of both the natural\nworld with very few churches of the city.\nThe indigenous conception of territory and land is inextricable from their myths of\ncreation and kingship. Representations of regional royal lineage are traced onto the\nterritory, sometimes including signs of significant military conquests and the submission\nof subjects. These mapping conventions belong to a long tradition of sacred texts (mostly\ndestroyed by Spanish priests) in which extended narratives are illustrated visually and\nphonetic symbols merge with iconic images of kingship and conquest. In these texts and\nthe maps of the Relaciones Geograficas Subjects are shown bringing offerings to the\nkings representative of the industry of their regions. The movement of the narrative is\nalways associated with a movement through space and time in these books, and thus the\nrepresentations of specific places in the mode of a European \"map\" belong to a highly\ncodified narrative of indigenous power and authority.\n\nSubjectivity and Cartography\nRobert Campos\nAmong cartographers, it is a given that maps contain a degree of distortion, and\nsubjectivity, that cannot be designed or computed out. It can be argued in fact, that\ncartography is a process of calculated distortion: a given projection will minimize error in\nshape of surface features at the expense of area, or vice versa, but never both--and never\nmind that the earth is not perfectly spherical to begin with but rather \"spheroid\". While\nthe advent of GIS technology has changed the nature of how we measure and represent\nthe earth's surface and its features, the problem of how we translate \"raw\" geographic\ninformation into the semiotic system of cartography, and how maps are interpreted and\nused by different interest groups, has not disappeared.\nBooks such as Maps and Politics by Jeremy Black and How to Lie with Maps by Mark\nMonmonier are rife with examples such as this one: during the height of the Cold War, a\nworld map hanging behind the desk of an evening news program in the U.S. used a\nprojection featuring the Eurasian continent at the center of view, true in shape but with an\nexaggerated area, so that the Soviet Union loomed large and menacing to viewers at\nhome. It is paramount to understand that the choice of a map projection, and its\norientation etc.., is in every case a subjective one. There are dozens, if not hundreds, of\nprojections one could choose to display on a wall for a given purpose; that the map in the\nabove example, in this context, was chosen can surely be read as symptomatic.\nIn general, \"accuracy\" in mapmaking was not a preoccupation of Western mapmakers\nuntil the 18th century. Enlightenment philosophy and its imperialist/colonialist\nassumptions required maps of a different sort than the Ptolemaic which had survived\nrelatively unchanged since Hellenic times. With the prospect of vast \"new\" worlds to\nexplore, new subjects, terrain, new markets, came the demand for new ways of making\nmaps.\nFor the British East India Company, the process of surveying and mapping the\nSubcontinent was inseparable from that of establishing hegemony over the colony. But as\nEdney demonstrates in detail, the available methods of \"route survey\", \"traverse\", and\neven trigonometrical survey contained flaws which undermined the Orientalist conceits\nof the British, and underscored the role in which human subjectivity plays in most any\nseemingly \"scientific\" endeavor. The route survey or traverse, for example, conducted\noften by a lone technician in difficult surrounds, was a measure of overland segments\nwhich change direction at their endpoints. Just where those endpoints happened to be\nlocated, however, depended \"only [on] when the surveyor's sense of direction and his\nexperiential sense of place tell him that the road has changed\" (Edney, 95). The territory\nwas reduced to a series of interconnected Picturesque vistas, with temples, hills, bridges,\nand the like serving as \"natural\" landmarks for the survey."
    },
    {
      "category": "Resource",
      "title": "responses_4_1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-645-selected-topics-in-architecture-architecture-from-1750-to-the-present-fall-2004/660da05e42af47fc05af19bf611c8623_responses_4_1.pdf",
      "content": "4-1. Compare and contrast Walter Benjamin's and Sigfried Giedion's respective\ninterpretations of iron construction.\nGiedion as Benjamin's History\nOphelia Wilkins\nTo compare Benjamin's and Giedion's interpretations of iron construction is neither to\ncorrelate nor contrast the two, but to observe the evolutionary mechanism of history at\nwork. Giedion's interest is to document the role of iron as a new building material which\nprecipitated the advancement of an era. Benjamin, writing in the midst of two world\nwars, and an international depression, seems to be seeking lessons from history at a time\nwhen the whole world is looking for hope, and finds the inspiration he is looking for in\nGiedion's writings on iron construction.\nIn \"Building in Ferroconcrete\" Giedion presents the emergence and evolution of iron as\nhe has observed it, reporting with journalistic fidelity the controversies and discussions\nsurrounding the material throughout. Perhaps because he lived through this dynamic era,\nhe takes the opportunity to ruminate on a lifetime, pausing occasionally to extract grains\nof truth and to underscore moments of historical gravity he hopes not to be forgotten. For\nexample, he witnesses history repeating itself within his own life and suggests: \"It seems\nthat in the human organism certain attitudes develop that only later crystallize in reality.\nJust as industry was recognized as the fulcrum of the century before the development of\nmechanical engineering, so, too - on a reduced scale - is a housing form today emerging\nbefore the social structure is ready for it.\" (p. 102). And to assure that no one fails to\nrealize the profound momentum technological advancement has gained in so short a time,\nhe gives a comparison of scale we can identify with even today: \"To ascertain at what\npoint we now stand in this development, consider the fact that the same requirements\narchitects then used for the design of the individual new building tasks are today applied,\nwith the same words, to the design of the entire city.\" (p. 112).\nGiedion's tome becomes the discovery of Benjamin's research and his material of study.\nIn his \"Arcades Project,\" Benjamin sets out to research the multi-faceted architectural\nand social phenomenon of the arcades of the 19th century. As he learns about iron as a\nprecipitator of change, he discovers the roots of his present day with apparent awe.\nThrough his research, he uncovers history in even greater breadth than what appears in\nGiedion's writing.\n** He uncovers the mystique which was once associated with the new material: \"The\nAusterlitz Bridge was one of the first iron structures in Paris. With the lightning flash\nabove, it becomes an emblem of the dawning technological age.\" (p. 151).\n** He engages in an extended conversation with history on the debate surrounding iron as\nan \"artificial\" building material and yet one having inherent qualities for design: \"\"Iron\ninspired a certain distrust just because it was not immediately furnished by nature, but\n\ninstead had to be artificially prepared as a building material.\" ... A.G. Meyer, Eisenbauten\n(Esslingen, 1907), p. 14.\" And subsequently: \"And their distinctiveness [of forms in\niron], ... is the product and expression of teh natural properties of the building material,\nsince such properties have been technically and scientifically developed and exploited\nprecisely for these forms.\" ... A.G. Meyer, Eisenbauten (Esslingen, 1907), p. 23.\" (both,\np. 157)\n** He unveils the wonder of innovation: \"\"The ... conditions of the material ... are\nvolatilized in 'limitless possibilities,'\" A.G. Meyer, Eisenbauten, p. 11.\" Iron as a\nrevolutionary building material!\" (p. 157).\nBenjamin's \"Arcades Project\" seems primarily to be an investigation of how advance of\nany kind interacts with the flow of time. Throughout his research, and through his\nextrapolations on history, we perceive overtones of wonder and a voracity for optimism,\nas if he were looking to the past to find hope for the future, exultant that maybe this will\nall happen again."
    },
    {
      "category": "Resource",
      "title": "responses_4_2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-645-selected-topics-in-architecture-architecture-from-1750-to-the-present-fall-2004/d53e041bf55a368128223b1d57964d8b_responses_4_2.pdf",
      "content": "4-2. As the essay by Wohlfarth tried to suggest, the key crisis faced by architects and\naesthetes in the 19th century was not a function of technology but of the aesthetic.\nArchitects and aesthetes were both at a loss when faced with the effects of technology\nand mass reproduction. What are the kinds of problems that we are talking about here?\nDisenchantment and (Dis)Honesty\nElizabeth Nguyen\nIn his essay \"'Construction has the Role of the Subconscious': Phantasmagorias of the\nMaster Builder (with Constant Reference to Giedion, Weber, Nietzsche, Ibsen, and\nBenjamin)\", Irving Wohlfarth constructs a narrative of the aesthetic implications of\ntechnology and mass reproduction in 19th century Europe.(1)\nWeber's theory of the disenchantment of the world (from his 1919 lecture Wissenschaft\nals Beruf) and Walter Benjamin's Arcades Project provide the underpinning of\nWohlfarth's study.(2) Both Weber and Benjamin locate the aesthetic crisis of the 19th\ncentury in a loss of sublime meaning and monumentality precipitated by the dislocation\nof the value of the original, hand-wrought object as craft became mechanized and the\ntechnology of construction overtook the art of design.\nIn the case of architecture and aesthetics, the loss of the value of the original object\n(Benjamin's loss of aura, or Baudelaire's halo) came from a transition from\ncraftsmanship to machine-produced kits-of-parts. The steel and concrete buildings of the\n19th century seemed to lack of the labor-intensive craft traditionally associated with\nbeauty, a fact that was often covered up with the 'phantasmagorias' of Wohlfarth's title.\nAs Wohlfarth notes, \"architecture was beginning to emancipate itself from art in its use\nof iron construction\" and the separation of building from art presented an aesthetic\nchallenge.(3)\nOne early response to this challenge was the covering up of this substitution of the\nlocation of value from man to machine. The bourgeoisie's (as Wohlfarth cites Giedion's\nphrase) \"historicizing masks\", result in a denial of the substructure and thus the new\ntechnology through various ornamental devices, but also through a cultural fixation upon\ninwardness and interiority. Wohlfarth attributes the interiority to Weber, Baudelaire,\nMarx and Benjamin's warning that \"[T]he failure to acknowledge this basic world-\nhistorical fact of \"disenchantment\" is likely to result in a surrogate re-enchantment of the\nworld.\"(4) Wohlfarth notes that for Weber and Baudelaire, \"phony spirituality is equated\nwith reified materiality\" as the traces of dwelling are systematically erased from the\npublic sphere and the home becomes a shrine for the signs of occupation.(5) This interior\ncoziness masks a discomfort with the cold structure that underlies the interior, be it the\nFreudian subconscious, or literally steel girders. What would become recognized later as\nthis \"dishonest relation\" between facade and substructure can be witnessed, for example,\nin Gustave Eiffel's Statue of Liberty, wherein the \"art\" is a superstructural envelope\nhiding the technology that made it possible.\n\nBy examining early modern writings on architecture and aesthetics, Wohlfarth connects\nthe underpinnings of modernism with the its critiques of the 19th century architecture,\nwhich were in turn based upon 19th century philosophical ideas about the aesthetic\nimperatives of the industrial revolution and the alienation of labor. The legacies of\n\"honesty\", of uniting substructure and superstructure, of exposing the interior to\ntransparency, and of creating works representative of the age of their production stem\nfrom the critiques that Wohlfarth assembles for us.\n1. Wohlfarth, Irving. \"'Construction has the Role of the Subconcious': Phantasmagorias\nof the Master Builder (with Constant Reference to Giedion, Weber, Nietzsche, Ibsen, and\nBenjamin),\" in Wohlfarth, Irving, and Kostka, Irving (eds.). Nietzsche and \"An\nArchitecture of Our Minds.\" Los Angeles: The Getty Research Institute.\n2. Benjamin, Walter. The Arcades Project. Trans. Howard Eiland and Kevin McLaughlin.\nCambridge, MA: The Belknap Press, 1999.\nWeber, Max. \"Science as Vocation,\" in From Max Weber: Essays in Sociology, ed. and\ntrans. H. Gerth and C. Wright Mills (New York: Oxford Univ. Press, 1958.)\n3. Wohlfarth, p.145.\n4. Wohlfarth, p.146.\n5. Wohlfarth, p. 147.\n\nCatherine Fowlkes response\nThe \"crisis\" faced by architects and aesthetes in the 19th century was not solely a\nfunction of the aesthetic, but a function of the aesthetic as a result of new technology and\nthe modern age.\nThe aesthetic in the modern age was complicated by several conditions, beginning with a\nclinging to the past in the face of new technologies. Benjamin describes this condition of\nrefusing to recognize what lies ahead in reference to a painting by Paul Klee, \"This storm\nirresistibly propels him into the future to which his back is turned...\" (Frampton p58)\nThe advances in iron construction were initially simply applied to old methods of\nbuilding. \"The use of iron in place of stone did not immediately lead to profound changes\nin the general design of the building, its system of equilibrium, or even its appearance.\nThe creative formulas of the past were not rejected. Architects did not yet envision a new\ntype of building.\" (Francastel p90) Because architecture and technology were seen as\nseparate endeavors - illustrated in architecture's inclusion in L'Ecole des Beaux-Arts\nrather than the Ecole Polytechnique, alliances between the two were slow in coming.\nGiedion further explains this lack of collaboration; \"With the expansion of industry\naround the middle of the century, one senses how the 'artist-architect' feels his privileged\nposition to be threatened. Out of this there gradually grew the frantic emphasis on his\n'artistry'.\" (Wohlfarth p153)\nA separate, concurrent condition, \"What (Max) Weber called the 'disenchantment of the\nworld,' Baudelaire, Marx and Benjamin described as 'the loss of the halo' or the 'decline\nof aura' (Wohlfarth p146) - reduced aesthetics to \"more modest proportions.\" (Wohlfarth\np143).\nBut just as these more modest proportions could align with and honesty and truth in\narchitecture, \"that is, with a building style that no longer masks iron girders as Pompeian\ncolumns\" (Wohlfarth p144), so it was also \"accompanied by a tendency to mask the new\nnakedness with obsolete drapery.\" (Wohlfarth p145)\nThe former seems to have remained an idea that theoretically complicated the role of\narchitecture, \"What, then, might an 'honest,' truly disenchanted architecture look like?\"\n(Wohlfarth p144) The latter manifested itself as a concerted focus on the interior and the\ndomestic, the result of a \"surrogate re-enchantment of the world\" - one example of the\n\"phantasmagorias of nineteenth-century bourgeois society.\" (Wohlfarth p146)\nThese parallel notions of aesthetic stasis in the face of new developments and the\ncomplex notion of a 'disenchantment of the world' - along with the reactionary\n\"historicizing masks\" - contributed to a confusing and hypocritical climate for the 19th\ncentury architect and aesthete.\n\nthe aesthetic of society\nNicole Vlado\n\"To return to Benjamin for a moment, it is instructive to note that when he declares to\nKracauer that he is in the arcades, he is in fact in the Bibliotheque Nationale in Paris. The\nmanner in which Benjamin's own archive is produced is illuminated by flanerie.\"(1)\n\"The Arcade Project\", composed by Walter Benjamin in the 1920s, displays the\nchallenges of the transformed space of the city beginning in the 1830s. One chapter in\nBenjamin's book focuses primarily on the emergence of iron construction in the built\nenvironment, and acts as a catalogue of the opinions of historians over a century. This\nbegins at a time when iron structures appear in cities like Paris; at a time when the\nproduction and proliferation of a new building material would result in the formation of\nparallel discourses around aesthetics and culture. Moving away from the forces of gravity\nand towards an era of ready-made architecture, iron construction proved to change not\nonly the way in which buildings were made, but how the built environment at various\nscales (domestic, industrial, urban) was conceived.\nNew perceptions about the home, the factory, and the city were based on new aesthetics\nthat grew out of changes in industry. Besides the obvious shift from stone/timber to iron\nconstruction, or the shift from handcrafted to prefabrication, was the shift in the\nconception of the interior and the exterior -- changes in the social fabric of 19th century\nEurope. An example of these changes is displayed in the work of \"The Arcade Project\"\nthrough Benjamin's study of the flaneur. He suggests that the emergence of new\ntypologies in the built environment, such as the department store, reformulate social\nspaces within cities such as Paris. Benjamin's work depicts a loss of the arcade as an\nexterior social space. Benjamin implies that the interiorized form of the department store\nreplaced the arcade at a loss to the flaneur(2) - to whom this space functioned in defining\nan identity and lifestyle.\nThe department store, the demise of the flaneur, was a new typology that rose out of\nadvances in technology. In Paris, this new form was the Magasin au Bon Marche,\ndesigned in 1876 by L.A. Boileau and Gustave Eiffel. The building is not only a new\ntypology responsible for a shift in lifestyle patterns (namely those affecting an upper\nclass, as in the case of the flaneur); it was also an example of a new aesthetic growing out\nof the proliferation of iron construction. Here such construction is celebrated through the\ndesign of Baroque staircases, light metal catwalks, and bridges.(3)\nThe style in which the department store was designed presents another dilemma within\nthe discourse of aesthetics following the use of iron in building construction, namely\n\"honesty\" as described by Irving Wohlfarth in his essay \"Construction Has the Role of\nthe Subconscious\". The challenge of the use of iron is an aesthetic one, with architecture\ngrappling for an identity between its former identity and a new machine identity of the\nengineer. Boileau and Eiffel do not design Weber's \"iron cage\" of modernity, rather they\nuse iron to design a hybridized form of revivalist architecture (Baroque stairwells) that\n\nmasks its location in history without masking its structure with \"obsolete drapery\"(4) . It\nis both honest and dishonest in its aesthetic as a built space.\nA struggle for a new aesthetic would remain a struggle that contemporary architecture\nface today, that of the mediation between form and function. The challenged posed in the\n1830s with the emergence of iron construction in Europe reflected deeper shifts in\nphilosophy, and more practically in the (re)construction of social relationships within the\ncity. This is made clear in the work of Wohlfarth, whose study borrows (\"with constant\nreference\") from philosophers dealing with issues not only of art, industry, and aesthetics,\nbut of class structures (the bourgeois, the flaneur), relations, and identity.\n(1) David Frisby, Cityscapes of Modernity: Critical Explorations (Cambridge: Polity\nPress, 2001) 13.\n(2) Frisby 32.\n(3) Kenneth Frampton & Yukio Futagawa, Modern Architecture 1851-1945 (New York:\nRizzoli, 1983) 36.\n(4) Irving Wohlfarth, \"Construction Has the Role of the Subconscious\": Phantasmagorias\nof the Master Builder (with Constant Reference to Giedion, Weber, Nietzsche, Ibsen, and\nBenjamin), in Wohlfarth, Irving and Kostka, Irving (eds.). Nietzsche and \"An\nArchitecture of Our Minds.\" (Los Angeles: The Getty Research Institute, 1999) 145.\n\nThe Unheimlich\njimmy shen\nThe crisis that architects and aesthetes were presented with in the 19th century as\nmanifest in the aesthetics resulting from the effects of technology can be examined using\nwhat Marx terms \"substructure\" and \"superstructure.\" If we can consider substructure as\ntechnology representing the iron skeleton of the modern building and superstructure as\nwhat Walter Benjamin calls the \"collective consciousness\" of society, as represented as\nthe facade that enclosed the skeleton, we can begin to understand that the architectural\npredicament of the time was two fold. Society was struggling with the secularizing\neffects of the scientific and industrial revolutions as well as wrestling with the technology\nof the time, namely the limitations that characterized mass production.\nThere was an inability to synthesize technology into the social structure due to the\nspiritual void left behind after the enlightenment. Weber refers to this as a\n\"disenchantment of the world.\"(1) With power no longer held by centers of religion and\ndispersed to the newly formed bourgeois class, the significance of monumental structures\nof worship diminished. In metaphorical terms, this left the modern man without the\ncomfort of a home. Wohlfarth asks \"Could dwellings still be built for men where they\ncould no longer be erected for the gods?\"(2)\nThe immediate reaction to this condition by the bourgeois was to resort to symbolic\nelements born from the myths of the past. With the modern house and its mass produced\nindustrial parts came the fear of losing the soul. And as a protective measure, the near\nsighted solution was to mask the interior with facades of ornament in order to remove the\n\"uneasiness (Unbehagen) provoked by the idea of inhabiting steel cages - buildings held\ntogether by iron girders.\"(3)\nWith new technology came the difficulty in manipulating these industrial products. A\ndichotomy existed between mass-reproduction and the traditional role of the craftsman\nand the making of unique parts. With the lack of an appropriate socio-cultural\nsignificance there was also the rigidity mass production presented by its use of repetitive\nparts, further complicating the aesthetic problem of the time. Wohlfarth cites Jugendstil\nas an example of a failed attempt at synthesizing technology into the interior, becoming\njust another use of the \"superstructure\" to cover the \"substructure.\" It is its inability to\nallow for what Benjamin calls \"leaving traces\" that prevents the \"bourgeois room\" from\nallowing the machine to have a soul.(4)\nThis superficial aesthetic in turn produces what Wohlfarth, borrowing from Freud, calls\nthe \"unhomely (unheimlich) and the uncanny;\" the result of the illicit act of reaching in\nthe past for what is already dead. It is the haunted house where one is holding onto an\nempty carcass of a memory, attempting to live in a deception that isn't meant to be. The\ndanger of this is perfectly expressed by Nietzsche stating that people have\n\"indiscriminately crammed themselves with the dead knowledge of past cultures and\nhave thereby deprived themselves of the possibility of creating a living, organic culture of\n\ntheir own.\" (5)\n1. Wohlfarth, Irving. \"'Construction has the Role of the Subconcious': Phantasmagorias\nof the Master Builder (with Constant Reference to Giedion, Weber, Nietzsche, Ibsen, and\nBenjamin),\" in Wohlfarth, Irving, and Kostka, Irving (eds.). Nietzsche and \"An\nArchitecture of Our Minds.\" Los Angeles: The Getty Research Institute, p. 146\n2. Wohlfarth, p.145.\n3. Wohlfarth, p.147.\n4. Wohlfarth, p.148.\n5. Wohlfarth, p. 149."
    },
    {
      "category": "Resource",
      "title": "responses_4_3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-645-selected-topics-in-architecture-architecture-from-1750-to-the-present-fall-2004/eaf4e7e18c3f73bf81d31f5d0517ae3c_responses_4_3.pdf",
      "content": "4-3. How do you explain the \"webbing\" and \"filigree\" in buildings like Eiffel's 1889\nTower and the Galerie des Machines in the context of the engineering advances of the\nnineteenth century?\nMichael Ramage's response\nThe webbing and filigree of Eiffel's tower and exhibition hall fall squarely within the\naesthetics and engineering of the late 19th century. They continue a long tradition of\ninterplay between technology, structural engineering, and architectural taste. It is evident\nin the first iron bridge, completed in 1779 in Coalbrookdale on the Severn River in\nBritain. The cast-iron bridge was a major advance in metallurgy because of its sheer size,\nbut it was not advanced structurally. The metal bridge was built and detailed as if it were\nof wood, as that was the familiar construction of the time. Society was skeptical of the\nnew use of the material, and it was not until the bridge withstood a major flood that\nwashed out every other bridge on the Severn that iron began to gain a foothold as a\nwidely accepted material for bridges. The divisions seen in Eiffel's buildings are already\napparent at Coalbrookdale, where the details evoke the carpentry tradition, the aesthetic is\nfrom the strongly ornamental 18th century, and the structure is poorly understood.\nEiffel's work a century later is a further example of the tension between engineering and\naesthetic. His tower was designed to have less filigree, but it didn't fit the aesthetic of the\nlate 18th century, so graceful arches were added between the legs. Structurally the\nwebbing in his wrought iron trusses of the Galerie des Machines may be overkill, but the\nanalytical tools available to engineers at the time were not as strong as their imaginations.\nThus much of what was designed and built was over engineered, because collapse would\nbe not only catastrophic for people immediately involved, but also for the fledgling\ndiscipline of engineering which was responsible for the safety of these buildings.\nSocietal aesthetics and advances in structural engineering once again collided in the first\ncommission given to Robert Maillart, the Stauffacher Bridge in Zurich. Maillart designed\nthe bridge to be a simple three-hinged arch in reinforced concrete. Armed with a new\nmaterial and great advances in structural analysis, Maillart proposed a thin, graceful, and\naltogether new bridge form to span the Sihl River. The simplicity of his design was too\nmuch for the chief architect of the city, who had the bridge clad in stone and added\nornamental piers at either end.\nIn this context one can explain Eiffel's webbing and filigree as necessary both for\nengineering and aesthetics. The engineering advances were significant, but the structural\nanalysis could not keep pace with the demand for larger and bolder structures. At the\nsame time, society's taste turned toward a cluttered aesthetic, one which conveniently fit\nthe designer's need to over engineer.\n\nIron Crochet\nNathalie Westervelt\nIt seems unlikely that the interlaced iron work of the Galerie des Machines and the Eiffel\nTower could be examined in terms of aesthetic taste, especially because of the initial\nadverse response to the Eiffel Tower in particular. What seems more likely is that the\nfiligree and webbing were more dependent upon the new materiality of iron, its structural\nrequirements and society's need for and development of mass production.\nIf aesthetics were at all an issue, it could be argued that by the use of elements of iron that\nwere non-structural in these constructions, aesthetics were a concern. The forms that were\nused in the arcades and the Gothic-inspired Eiffel Tower are recognizable.\nIn the Arcades Project, Benjamin states that technology is often aesthetically developed\nalong recognizable lines: \"In the beginning, railroad cars look like stagecoaches,\nautobuses like omnibuses, electric lights like gas chandeliers, and the last like petroleum\nlamps.\" (p.167 Benjamin) Thus the arches that were recreated in iron were of Gothic and\nRoman influence.\nThese new arches, however, were not stone and therefore reached soaring heights with\nless material than before. The open-air structure of the Eiffel Tower inspired \"The\nsensation of being enveloped by a floating airspace while walking through tall structures\nadvanced the concept of flight before it had been realized and simulated the formation of\nthe new architecture.\" (p.102 'Ferro Concrete Construction') The visitor to the Eiffel\nTower is encased in a cage of trusses and introduced to what was, when it was built, a\nnew experience of the built environment.\nTruss, according to New Webster's Dictionary, 1992: 'truss (trus) n. 2 A braced\nframework of ties, beams or bars, usually arranged in a series of triangles.\" The very\nconfiguration of a truss, although structural in intention would yield visually what could\nbe signified as webbing.\nEach element of this webbing had a fine grain due to the fact that it was a repeated\nelement of the same proportions as each other. Iron was useful as a material of mass-\nproduced elements. \"As the population shifted from rural to urban in the industrializing\ncountries... nations had to build more working and living space. The only way to do this\nwas to mass-produce buildings and infrastructure, and this meant that building methods\nhad to change.\" (p.35 Peters)\n\"Repetitive structure, modular elements, system thinking, monolithic structure, and\nmodern statics and material science all made their debut in this period.\" (p.35 Peters)\nAdvancements in iron work were continuous and \"it did not take them long to discover\nhow inappropriate wedged, pegged and mortised cast-iron connections were...it was\nbetter to cast lugs and flanges on the components, as boilermakers did, and join them\nwith wrought-iron bolts and rivets.\" (p.38 Peters)\n\nFormwork for iron could be reused, therefore it is logical to create patterns of repeatable\nelements that then could be bolted together.\nThe result is a certain kind of webbing, mechanical by nature was later transfigured into\nthe human-made organic Art Nouveau (which was, as far as I know, a Belgian\nmovement, Jugendstil or no Jugendstil).\nThe machined nature of iron elements is evident in three bridges bult in the 1800's\n(Wilson's Wear Bridge, Renne's Thames Bridge and Telford's Mythe Bridge). These\nwere designed with \"a bottom-up design process, standardizing the members and\nconnections as they went and arranging them into an assembly. Their \"kit of parts\"\ndetermined the final form as much as the form influenced the parts - a form of matrix\nthinking.\" (p. 40 Peters))\nAgain, the multiple repeated parts, like bones of a skeleton or stitches of crochet, create\nthese web-like structures. The argument for the need for mass production and the\ndemands of loads on the structure which were answered by trusses and diagonal bracing,\nseem more important to the filigreed result than any simple aesthetic reaction. In this\ninstance, aesthetics seem to have been less important to the webbing that resulted than\ndriving force of technology's promise to create more, faster.\n\nJames Smith's response\nThe construction of the Eiffel Tower and the Galerie des Machines symbolize the\nadvancement of Iron and steel construction since Joseph Paxton's 1851 design for the\nCrystal Palace. Paxton utilized two major innovations of the Industrial Revolution, mass\nproduction of pre-fabricated building components and the use of iron and glass in\nstructures. Elements such as \"webbings\" and \"filigrees\" in Eiffel's Tower and the Galerie\ndes Machines can be explained through the development of Iron in structures and the\nconstruction process that resulted in the advancement of iron as a primary building\nmaterial.\nAdvancements in the use of iron as a primary construction material can be seen in the\nintricate design and use of iron found in the Eiffiel Tower. Gustave Eiffel's design for a\n300 meter tower in Paris for the 1889 Worlds Fair incorporated the ideas of design and\nconstruction formulated by Paxton. The detailed design forced an evolution of the\nconstruction process that Paxton had developed for the Crystal Palace. According to Tom\nPeters, \"The primacy of connection technology in iron changed the way designers\nthought about construction.\"(Peters 42) Designers were forced to produce detailed\ndesigns that enabled workers to pre-fabricate iron components off site. \"Iron construction\nis therefore the process of assembling pre-fabricated components and pre-fabricated\nconnectors.\" (42) The formation of mass-production techniques, using and reusing cast\nmolds resulted in the design of structures which utilized repeating elements. \"Repetitive\nelements and standardized connections characterize a system approach to design that\nimplies organizing component hierarchies rather than composing forms. In this way the\nmaterial, iron, brought forth a new concept, the construction system.\"(42)\nWrought-Iron components were easy to standardize, primarily because wrought-Iron is as\ngood in tension as in compression. This allows for a uniform dimension that is easier to\nwork with. As iron construction developed in the 19th century following Paxton's Crystal\nPalace a new field of science was emerging that dramatically affected our understanding\nof materials and their properties, Material Sciences. According to Peters this \"promoted\nexperimentation with cast-iron components in which engineers would locally increase the\ncross section of highly stresses areas, giving them highly attractive, sculptural\nqualities.\"(44)\nThe Eiffel Tower and the Galerie des Machines symbolize the advancement of industrial\ntechnology since London's Crystal Palace Exhibition in 1851 by Joseph Paxton.\nConstructed of 7000 tons of wrought-iron, Eiffel's Tower became a symbol of the\nIndustrial Revolution. Located at the base of Eiffel's Tower the Galerie des Machines\nwas a quarter mile long, 460 feet wide and had the largest open floor area of any building\never made.\n\nOrnament, Iron, and the 19th Century Bourgeoisie\nRobert Campos\n\"For a long time, the magnificent views of the city provided by the new iron\nconstructions were accessible only to the workers and engineers. For who at that time,\nother than the engineer and the proletarian, climbed the steps that gave sole access to\nwhat was decisively new about these buildings--their spatial feeling?\" From Walter\nBenjamin, Gesammelte Schriften,, quoted in Wohlfarth, 183 [emphasis added]\nThe webbing and filigree which embellish the Galerie des Machines and the Tour\nd'Eiffel are not structural, but rather quasi-structural ornament. The bareness of the new\niron structures was disturbing to the new bourgeois class who, unable to reconcile new\nmeans of production with the new relations of production these changes engendered (and\nthe inevitability, at least to Marx and his followers, of proletarian revolution), retreated\ninto the interiority of their overstuffed homes (Wohlfarth). The unmitigated exteriority of\nthe new iron construction, with its skeletal structure, its \"disenchentanted\" display of\nnaked metal, was both the \"immense turbulence...of industry\" that had to be kept \"at\nbay\", (Wohlfarth quoting Dolf Sternberger, 153) and the very (well-upholstered) \"iron\ncage\" which keeps those forces at bay, i.e. out of the home. Filigree and webbing are the\nupholstery, rendered in iron, that interiorizes the Tower and the Galerie for consumption\nby the bourgoisie.\nIf the above quote describes a latent (structural?) alliance between the proletarian and the\nengineers within the territory afforded by new technologies, and thereby the means and\nrelations of its production (the Marxian dialectic), then Jugendstil is the bourgeoisie's\nreclaiming of that territory. Ornamented iron is the architectonic manifestation of that\nreclaiming, a \"false consciousness\" constructed for the proletariat. Benjamin again:\n[Jugendstil's] recourse to technical motifs derives from the attempt to sterilize them by\nway of ornament.\" (Quoted in Wohlfarth, 157). Ornament is the \"phantasmagoria\" which\nmasks the \"scaffolding\" or \"armature\" of the bourgeois class \"at the moment that it\nshows its first signs of decline.\" (Benjamin, passim). Surrealism, psychoanalysis,\nhistorical materialism, all sought to peel away the \"filigree and webbing\" from the iron\nstructure, or \"iron cage\" of (modern) reality."
    },
    {
      "category": "Resource",
      "title": "responses_5_1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-645-selected-topics-in-architecture-architecture-from-1750-to-the-present-fall-2004/f59e025a76b6454b198d6d7c205f4fd4_responses_5_1.pdf",
      "content": "5-1. Can you discern some critical distinctions between critiques of ornament in the 19th\ncentury and those in the 20th? Describe by using one building that you would offer as an\nexample of each.\nA condemnation of ill-founded form making\nNathalie Westervelt\nAttitudes towards ornament change from 19th - 20th centuries from the creation of\npattern books and analytical cataloging of those patterns to the use of morphology, a\ndirect relationship between biological patterns and ornament, to the negation of ornament\nby Modernists.\nThe \"European fascination with Islamic ornament\" or ornament in general \"had its roots\nin the medieval and renaissance periods\" and \"it reached its peak in the nineteenth\ncentury.\" (Necigoplu 1) part of the impetus of the importation and analysis of new\nornament stemmed from the imports from the European colonies to Europe. With the\nimported objects came the fascination of the other and the desire to scientifically\nunderstand that other. Gulru Necigoplu cites Gayet's l'art arabe \"this is not a art of a\nreligion but or of a people, but that of a race.\" Gayet continues - \"contemplative and\necstatic, the Arab distances himself from the human form\" instinctually. He speaks of the\nArabs with their \"innate spirituality and mysticism\" - naturally, prefer abstract forms.\nThus Gayet is attempting to categorize and analyze Arab patterns, the Arabesque, and\ncatalogue them as the ornaments of Classical architecture were by Vitruvius. The\nornament or Arabia held no symbolic meaning for the European - therefore it was easily\nappropriated. In the formulation of these books was \"a study of patterns [appropriated]\nfor their universal relevance rather than as systems of signification, at the expense of their\ncultural associations and contextual meanings.\" The pattern books used \"a taxonomic\nmethod of classification according to inner structure- based on the fundamental geometric\nelements that generated them.\" Use of patterns may be seen in the Victorian ornament of\nMark Twain and Harriet Beecher Stowe's houses in Hartford, CT.\nFrom here to indirect representations of nature took hold. (Whitney Keyser 120) 'Art\nbotany' (127) and morphology (Goethe) were an accepted genesis of ornament and\narchitectural elements for Art Nouveau (here on could consider anything by van de Velde\nor Horta). Ornament, however, was seen as style and denounced by both historians and\nmodernists. \"Historians of modern architecture here presupposed the same condemnation\nof fashion.\" (Wigley 168)\nModernism rejected fashion and used a formal logic that aspired to be international and\nsimply reveal the function of the spaces inside (here you could look at Villa Savoye). In\nPrograms and Manifestos on 20th Century Architecture, Adolf Loos states \"every age\nhad its style, is our age alone to be refused a style? By style, people meant ornament.\nThen I said: Weep not! See, therein lies the greatness of our age, that it is incapable of\n\nproducing a new ornament.\" (Loos 20)\nThus the movement from ornament to none was rooted in historicism and the lack thereof\nas well as the displacement of symbolism from adapted geometries, adapted\nunderstandings of molecular structures, and affected formal logics that attempt to follow\nthe function inside without taking into account the change in architectural function over\ntime."
    },
    {
      "category": "Resource",
      "title": "responses_5_2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-645-selected-topics-in-architecture-architecture-from-1750-to-the-present-fall-2004/f7519a5672af0bca92cfa825b025bee5_responses_5_2.pdf",
      "content": "5-2. Describe the grounds on which the critique of decoration describes a modernist\nagenda in architecture.\nUndecorated Space\nOphelia Wilkins\nThe modern movement grew out of the Industrial Revolution, so it is only logical that we\nmake a natural and direct link between modern architecture and new methods of\nconstruction. However, what defines modern architecture on par with advances in\ntechnology is the \"subordinated surface.\" As technology becomes an enabler of creative\nfreedom, the subordinated surface serves to delineate revolutionary intentions.\nToday we fundamentally think of architecture in terms of quality of space. If we look\nback in time, this was not always the case. Think of slave ships, plantations, panopticons,\nand European landscapes. Architecture was about configuration, organization and even\npolitics, but not pure space.\nNew means of production introduced new formal possibilities, leading to new\nconceptions of architecture. As Wigley states: \"Each subsequent change ... has to be\ndifferentiated from fashion by being tied to the logic of a fundamental break necessitated\nby new materials and the technologies by which they are assembled. Construction and\nfunction must be seen to immobilize and thereby subordinate all the surfaces of\narchitecture.\" He concludes his point by stating that \"it is the exhibition of the\nsubordinated surface, rather than an exhibition of the new means of production, that\nrenders architecture modern.\" (both White Out, p. 155). The confluence of new means of\nproduction with the subordinated surface redefined the essence of architecture as a purely\nspatial experience.\nIf ornament used to be the \"concealment of an internal disorder,\" (White Out, p. 154), the\nneutral surface exposes spatial order. We see this clearly in William Curtis' praise of Le\nCorbusier's Villa Savoye: \"Even a scrupulous inspection of photographs and drawings\ncannot hope to recreate the feeling of space, the sense of rising up into an illuminated\nrealm, or the intensive lyricism of sun-lit geometries seen through layers of semi-\nreflecting glass. The building imposes its own order on the senses through sheer\nsculptural power ... windows, tiles, pilotis and other naked facts are raised to a new level\nof significance through an intense abstraction.\" (\"Le Corbusier Ideas and Forms\", p. 96).\nThe modernist critique of ornament is a wake-up call to abandon the comfort of\nfamiliarity, in order to redefine the future of architecture in which anything is possible.\nThrough the work of Corbusier and others, the neutral undecorated surface becomes the\nmedium of re-invention.\nCurtis, William J.R., Le Corbusier ideas and Forms; Phaidon, New York : 1986.\n\nCritique of Decoration: Language\nJames Smith\nIt is difficult to understand the impact the critique of decoration had on the modernist\nagenda in architecture without understanding what the definition of the modern agenda\nwas at the beginning of the 20th century. Artists in both England and Europe disputed the\nmeaning of modern design between the last decade of the 19th century and the first two\ndecades of the 20th century. At this time Modern Design does not have a clear agenda, or\ndefinition, it is in a suspended state defined loosely through independent written\ntestimonies. It held different meanings defined through the visual arts, literature,\narchitecture and urban design. Many would argue that the truest examples of the modern\nare defined by the work of the Bauhaus in Germany, the Italian Futurists, and the Russian\nConstructivists. It is through the definition of the modern that the distinction between\ndecoration and design evolve.\nThe terms decoration and design are both subjective and are both described though a\nsubjective language. Peter Wollen argues that language has obscured the role decoration\nhas played \"in the development of modernism.\" This language is expressed though\ncultural opposite terms, \"function/decorative, useful/wasteful, natural/artificial....\nmachine/body, masculine/feminine, west/east.\" The dictionary defines decoration as\nsomething that \"adorns, enriches, or beautifies; something added by way of\nembellishment; ornament.\" It could be described as a creation of a pattern on a surface or\ncanvas. Matisse defined it through the term composition, which he said was \"the art of\narranging in a decorative manner the diverse elements at the painters command to express\nhis feelings.\" He was supported by the work of the Art Nouveau and the Vienna\nWorkshops. Victor Horta, an Art Nouveau designer from Belgium, believed that\n\"decoration enhanced architecture by helping the viewers eyes notice features and\ncontours in space or a building.\"\nThe opposite view point held by architects such as Adolf Loos, Walter Gropius, Mies van\nder Rohe and Le Corbusier, as well as various artists and writers critiqued decoration for\nits complicated tendencies and labeled it has a distraction to space. They argued for\nsimple, rational and machine made designs. Decoration was a waste of time and should\nbe replaced though the use of mass production techniques and a machine aesthetic.\nAdolf Loos argued against decoration through economical and historical reasons. He\nargued for intelligence and reason, economy and effectiveness, speed and purity,\nbelieving that decoration was both primitive and damaging to modern culture and posed a\nthreat to masculinity. He labels the decorative arts as \"degenerate\" and \"unmodern.\"\nModern design is seen through the lens of masculinity. Decoration is old fashioned and\nfeminine. This is a sexist reaction to the increasing role of the female designer at the turn\nof the century.\nThe critique of decoration can be viewed as a critique of language, rather than a critique\nof design. In this language, a new modern agenda was defined. Words like, simple,\n\nrational, production, pure, economy, masculinity, defined the early 20th century\nmodernist. They were in reaction to words such as wasteful, excessive, pattern, artificial,\nbody. They described the \"old-fashioned feminine.\" Through language we define\ndecoration and design.\n1,3,4,5,6: Day, Maria A, \"The Ideal Home Rompus\": Disputing Modernist Design in\n1913, http://www.eiu.edu/~modernity/day.html\n2: http://dictionary.reference.com/search?q=decoration\n\nKatherine James' response\nThe modern movement in architecture was nominally an ascendance from the 'styles' of\npre-industrialism. Modernism proclaims absolute purity in building, a supreme state that\nthereby declares immunity from the temporality of fashion. Le Corbusier states: \"Purism\nstrives for an art free of conventions which will utilize plastic constants and address itself\nabove all to the universal properties of the senses and the mind\" (Wigley, 153).\nModernism is the universal end- the solution to the long-contemplated problem of what a\nbuilding should look like.\nThe problem with the declaration of universality and corollary rejection of fashion/\nornament is that this precise stance is created in response to the ornamental tendencies\nthat preceded industrialism. This reactive nature immediately marries modernism to the\ntimeline of styles that it wishes to ascend, and it's placement on that timeline means that\nmodernism is, and always will be, fashion despite the fact that \"Modern architecture was\nindeed explicitly launched against fashion\"(Wigley,152).\nWhat happens when a group declares universality and tries to escape the timeline of\nstyle? The ego of the movement begins to chip away at its very credibility. Looking at a\nsituation like the Farnsworth House, a modernist glass and concrete residence, we see\nboth where the building succeeds as modernism--by purely expressing its structure and\navoiding any superfluous ornament, and where it fails as architecture--by being virtually\nuninhabitable precisely because of its unmediated transparency and the refusal of the\narchitect to allow the extraneous and ornamental window dressing to be introduced for\nfear that it would ruin that exact purity. Mies and his client bitterly disagreed not about\nthe design of the house, but about it's method of occupation. Any personal object is seen\nas a subversion of the purity of the architecture. People must adjust themselves to the\nbuilding in this ultimatum, rather than the building accommodating its occupants. We see\nthis again with van de Velde, who designs clothing for his clients to match his buildings.\n\"Woe to the lady who would enter such a room in a dress that was not artistically\nsuitable\" (Wigley, 186). There is fear of offending the building with the crudities of\ninappropriate style. (But aren't people meant to live in buildings, not to fear them?!)\nAnd this is precisely the point at which modernism shoots itself in the foot; the stringent\nand often inappropriate application of the universal and absolute eventually makes\nmodernism a logical strategy for no one individual. Decoration becomes everything\nbesides the perfect, pure building itself, including the occupants, and the impracticality of\nthis conclusion flies in the face of modernism's tenants of functionality and efficiency.\n\nsurface\nNicole Vlado\n\"Everywhere the discourse of modern architecture turns on the privileged status of the\nsmooth surface.\" (Wigley, 228)\nThe critique of decoration within the discourse of architectural modernism begins a larger\ndebate around the role of \"surface\". As documented by Wigley in his article \"White Out:\nFashioning the Modern\", the surface is stripped of decoration in search of its new\nidentity, one defined by Le Corbusier as \"revitalized\" and reinterpreted by Wigley as that\nwhich embodies \"discipline\"(Wigley, 233). This \"discipline\" is the rigorous\nsystemization of the modernist movement in architecture - a movement responsible for\nthe editing of form (from decorated to functional). In modern architecture, the smooth\nwhite wall replaces all other surfaces, through the active removal of surface decoration,\nseen as the \"old clothes\" of the past (these \"old clothes\" can be likened to Gideon's\n\"historical masks\" of an earlier debate around methods of construction, where now the\nfocus is on the skin rather than the structure within architecture).\nAs a movement, these beliefs were not intended a mere shift in architectural styles, but\nrather reflected a shift in ideology as represented within influential texts (propaganda,\nperhaps) produced by such key figures as Le Corbusier (Towards a New Architecture)\nand Adolf Loos (Ornament and Crime). Many of the ideas presented in the literature\nwritten by and for (revolutionary) architects grew out of the culture of the industrial\nrevolution. In his manifesto, Loos describes ornament as \"wasted labour power\", a claim\ndeeply rooted in the ideals of efficiency emerging from the factory production of\nmaterials. Utilitarianism and production are embraced by such movements as the\nBauhaus. There begins a shift in architecture from mere space making towards a more\ncreative innovation of use (here, industrial design and modern architecture begin to\nmerge, as we see in the products created by the Bauhaus, and phenomenon that would\ncontinue to present day).\nThese thoughts followed an era (the mid to late 19th century) in which \"ornament\"\nbecame \"pattern\" within the factory setting. This phenomenon is described by both\nBarbara Whitney Keyser and Gulru Necipoglu through their observations of industrial\nBritish pattern making. The systemization and mechanization of ornament in the factory,\ntranslated natural forms unto flat surfaces through the production of repeat patterns.\nTherefore, we see, decades before the radical shift to the smooth, white surface of Le\nCorbusier, a shift to towards flatness. The British patterns remained two-dimensional, and\nas a medium could be prefabricated and applied to a surface as wallpaper/fabric. Soon the\nwallpaper would be removed to reveal the smooth, white wall of modernist architecture.\nRather than a radical reinvention of architecture, the white wall slowly emerged over a\nperiod of close to 50 years of transformation.\nStill the impressions left by Le Corbusier and Adolf Loos were profound, and decorated\nforms are rarely found among contemporary examples. What has continued in the\n\ndiscourse of architecture has been a fascination with surface, and now dynamic and\nresponsive surfaces provide an example by which we can begin to discuss new modes of\ndecoration.\nNote: I find the discourse around the \"surface\" troubling (reductive?), and highlight it in\nregards to my own understanding of decoration within my current studio. I present\nWigley's quote regarding the privileged status of the smooth surface in modernist\narchitecture to begin discussion around the \"privileged status\" of new surfaces\n(responsive, complex, etc). Currently, these new surfaces are isolated moments within\narchitecture, and my concern is (if) when/where these \"surfaces\" will act to reinsert\nthemselves into the discourse/practice of space making. Perhaps a study of non-surface\ndecoration would enlighten such though (not necessarily that within structural design -\nhere decoration/pattern exists at a scale often to large to experience at the human scale).\n\nCatherine Fowlkes\nThe tactic of criticizing decoration allowed for a clear and tangible illustration of\nmodernist ideas. The ornament itself could represent the culprit and the act of stripping\naway decoration enabled the revelation of a constructed prehistory that validated modern\narchitecture. \"By systematically uncovering the fundamental condition of modern life\nthat lies beneath the dissimulating layers of fashion, the historian can facilitate the\nemergence of the 'new order' without anxiety.\" (Wigley p.162)\nIf modern architecture was to reflect the true spirit of the day, it needed to do more than\nbe erected with new techniques and materials. It needed to outwardly show its new\nmodes of construction. Ornament was seen to cover and complicate these achievements.\nIn order to shed the \"historicizing masks\" of the past, ornament and decoration had to be\npared down.\nDecoration and ornament were seen as too closely linked to fashion - and in order to give\nmodern architecture weight and validity, to underscore that it was not a reflection of\nchanging whims and merely a style, it had to be distanced from decoration. \"The newness\nof contemporary architecture had to be seen as the product of logic rather than the\ndictates of fashion.\" (Wigley, p. 204)\nAdolf Loos' critiques in Ornament and crime above all posited modern architects as\npracticing an evolved, and thus superior, form of architecture. Decoration and ornament\nwere stagnated, \"The ornament that is manufacture today has no connexion with us, has\nabsolutely no human connexions, no connexion with the world order. It is not capable of\ndeveloping.\" (Loos, p.22) Those that prefered ornamentation and were horrified with the\nmodern were \"stragglers\" who \"slow down the cultural evolution of the nations and of\nmankind...\" (Loos, p.21)\nNot only were these stragglers retarding the evolution of man, they were not very\npractical. Modern architecture celebrated the utilitarian, the functional, the efficiency of\nthe machine. The production of ornament was in direct contrast to this. \"The ornamentor\nhas to work twenty hours to achieve the income earned by a modern worker in\neight...omission of ornament results in a reduction in the manufacturing time and an\nincrease in wages.\" (Loos, p.22)\nIn addition to contrasting with the efficiency of the machine, this exploitation of the\nworker did not reflect the social ideas surrounding modern architecture, rather, the\nmanner of production \"inevitably entailed a punitive form of craft slavery...\" (Kenneth\nFrampton, 'Adolf Loos and the crisis of culture 1896-1931')\nThe pointed criticisms as well as the act of criticism itself positioned the modern as\nembodying a superior, evolved and inevitable architecture."
    },
    {
      "category": "Resource",
      "title": "4_645_week_01.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-645-selected-topics-in-architecture-architecture-from-1750-to-the-present-fall-2004/5160fdd8ac2dc074860336908eea4d8f_4_645_week_01.pdf",
      "content": "Week 01 - Constructing the Past\n\nGiovanni Battista Piranesi: \"Ancient Intersection of the Via Appia and Via Ardeatina\"\nFrontispiece, from Le Antichita Romane II.\n\nGiovanni Battista Piranesi: \"Ancient Circus of Mars with neighbouring monuments\nviewed from the Via Appia\"\nFrontispiece, from Le Antichita Romane III.\n\nFrontispiece of Mausoleum in Museo by Johann Christoph Olearius. 1701.\nHere the classic image of the pyramid is linked to a new class of antiquities, symbolized\nby the three piled urns and the shard placed at the base of the pyramid.\n\nConnected finds by Leonhard David Hermann.\nLeonhard David Hermann, in his Maslographia, was one of the first to show connected\nfinds: each object was associated to its context, depending on its state of preservation in\nthe soil. This form of illustration revealed an anatomical interest in deposits.\n\nLandscape notes at Stonehenge.\nDrawn by the British antiquarian and draftsman William Stukeley in 1723.\n\nNotes on the lie of the land at Avebury.\nDrawn by William Stukely in 1724.\n\nOverhead view of Avebury.\nDrawn by William Stukely in 1723. Stukely was to produce an overall plan of Avebury, a\nDruidical site in Britain, complete with detailed topographic survey. The drawings\ncompel as much by their precision as by their quality.\n\nStudies of megaliths in and near the village of Aurille (Poitou).\nCompiled by the Comte de Caylus in 1762. Caylus was one the most enthusiastic,\nsystematic and well-to-do of the antiquaries in France in this period. He was interested in\nA'Gallic antiquities', and collected illustrations which he commissioned from the\nengineers employed on bridges and railways.\n\nStudies of megaliths in and near the village of Aurille (Poitou).\nCompiled by the Comte de Caylus in 1762. Caylus was one the most enthusiastic,\nsystematic and well-to-do of the antiquaries in France in this period. He was interested in\nA'Gallic antiquities', and collected illustrations which he commissioned from the\nengineers employed on bridges and railways.\n\nElevations of Mount Georgovie.\nExecuted for the Comte de Caylus by Dijon, an engineer in the province of Auvergne.\nThe precision of the topographical studies carried out under Caylus' supervision by\nbridge and highway engineers demonstrates the operation of rigorous standards.\n\nPlan of Mount Georgovie.\nExecuted for the Comte de Caylus by Dijon, an engineer in the province of Auvergne.\nThe precision of the topographical studies carried out under Caylus' supervision by\nbridge and highway engineers demonstrates the operation of rigorous standards.\n\nPlan of the amphitheatre at Grand, Lorraine.\nMade for the Comte de Caylus.\n\nPlan of the fountain of NA(r)mes.\nDrawn by Damun for the Comte de Caylus. The monument at the site of the spring was\ndiscovered in 1738.\n\nRoman building known as the Temple of Vasso at Clermont-Ferrand, from Antiquites\nd'Auvergne by Pierre de Beaumesnil, c.1780.\nBeaumesnil combined the taste for antiquities with a sense of landscape: his drawings\nwere more picturesque than that of engineers.\n\nThe 'Tour Magne' at Nimes.\nA drawing from Recits des anciens monuments by Anne de Rulman (1625). This\ncompilation formed the basis of a survey of Gallo-Roman antiquities.\n\nBreton megaliths.\nDrawings from Christophe-Paul de Robien's compilation, Alsaciae illustratae, celtica,\nromanica, francica (1751).\n\nBreton megaliths.\nDrawings from Christophe-Paul de Robien's compilation, Alsaciae illustratae, celtica,\nromanica, francica (1751).\n\nTopographical map of the town of Chatelet.\nFrom Pierre-Clement Grignon, Bulletin of Excavations Carried out by Order of the King\nof a Roman Town, on the Little Mountain of Chatelet. (1774.).\n\nGeneral plan of the excavations of Chatelet.\nFrom Pierre-Clement Grignon, Bulletin of Excavations Carried out by Order of the King\nof a Roman Town, on the Little Mountain of Chatelet. (1774).\n\nRuins of a temple near the mound of Troy.\nComte de Choiseul-Gouffier, Voyage pittoresque de la GrA ce (1782).\n\nMegalithic Tomb.\nWatercolour by Wilhelm Tischbein the younger, 1820, a friend of Goethe.\n\nThe Skeleton Cave, Caspar David Friedrich, 1803.\n\nEntrance to the cave at Gailenreuth and mandible of a cave bear.\nDrawings from a work by J. F. Esper published in 1774.\n\nSection through the Paviland cave, found in 1822.\nDrawing from William Buckland's Reliquae diluvianae (1823). Note human skeleton on\nbottom of cave floor.\n\nRhinoceros skeleton found in a cave in a mine at Callow.\nDrawing from William Buckland's Reliquae diluvianae (1823).\n\nTraces of the Flood.\nA plate from Physica sacra by Johann Jacob Scheuchzer (1731).\n\nThe discovery of Herculaneum.\nDrawings from Voyage pittoresque de Naples et de Sicile by the Abbe Saint-Non,\npublished in 1782.\n\nView of the main street in Pompei.\nDrawings from Voyage pittoresque de Naples et de Sicile by the Abbe Saint-Non,\npublished in 1782.\n\nLas Incantadas, Thessalonica, by James Stuart.\nA Corinthian colonnade surmounted by a pillared storey; second century AD.\n\nMonument of Philopappus.\nFrom The Antiquities of Athens, by James Stuart and Nicholas Revett (1761). One of the\nearliest Western Europeans to travel and document sites in Greece, their travels and\nsurveys revealed a new image of the country.\n\nDescription and sketches of Temple of Deus Rediculus and Grotto of Egeria.\nFrom John Mitford, Manuscript Diary of 1822.\n\nJames \"Athenian\" Stuart, Autograph Letter to Jacob Hinde, 20 March 1745.\n\nFrontispiece Plate and Title Page of Giacomo Barri, The Painter's Voyage of Italy, 1679.\n\nTitle page of Thomas Coryat, \"Coryat's Crudities hastily gobbled up in five moneths\ntravells in France, Savoy, Italy, Rhetia, commonly called the Grisons country, Helvetia\nalias Switzerland, some parts of High Germany, and the Netherlands, 1611.\"\n\nEarly travelers at the Phlegrean Fields.\nFrom George Sandys, A Relation of a Journey begun An: Dom: 1610. Foure Books\ncontaining a description of the Turkish Empire, of Aegypt, of the Holy Land, and of the\nRemote parts of Italy, and Ilands adjoining, 1615.\n\nThe Cascade and Temple of the Sibyl at Tivoli.\nPlate 38 of James Hakewill, A Picturesque Tour of Italy, 1820.\n\nEruption of Mount Vesuvius 9 August 1779.\nPlate III of Sir William Hamilton, Campi Phlegraei supplement, 1779.\n\nThe eruption of Vesuvius in 1774.\nDepicted by Philip Hackert.\n\nDetail of the Uffizi.\nPlate XX of Giuseppe Zocchi.\n\nAncient Subterranean Tomb near Pozzuoli.\nPlate XXXIII of Paolo Antonio Paoli, Antichita di Pozzuoli, 1768.\n\nAncient Bath at Baiae.\nPlate LIV of Paolo Antonio Paoli, AntichitA di Pozzuoli, 1768.\n\nArch of Titus.\nVolume I, Plate II of Taylor & Cresy, The Architectural Antiquities of Rome, 1821-1822.\n\nThe Tribuna in the Uffizi gallery by John Zoffany.\nZoffany, beneath the array of paintings on the walls, portrayed numerous English tourists\nwho were in Florence in the 1770s.\n\nGiovanni Pannini's \"Ancient Rome\"\nThe walls of an imaginary gallery covered with pictures of the city's most famous ancient\nmonuments. 1757.\n\nGiovanni Pannini's \"Modern Rome\"\nThe city of the Renaissance and the Baroque. 1757.\n\n\"The Golden Asses\"\nThomas Patch's largest group painting of Grand Tourists in Florence, 1761. He painted\nhimself astride the statue of a golden ass on the right.\n\nNumismatists at work, plate from La Science des medailles, by Louis Jobert, 1739.\nThe spaciousness and luxury of this cabinet attests to the craze for medal collecting.\n\n\"Lake Albano\"\nFrom AntichitA d'Albono e di Castel Gandolfo, 1764.\n\nGiovanni Battista Piranesi: \"Ruins of the ancient fortifications of the mountainside and of\nthe city of Cori in Latium\"\nFrom Antichita di Cora. 1764.\n\nGiovanni Battista Piranesi: \"Illustrations of the emissarium of Lake Albano\"\nFrom Descrizione dell'Emissario del Lago Albano. 1762.\n\nGiovanni Battista Piranesi: \"Illustrations of the emissarium of Lake Albano\"\nFrom Descrizione dell'Emissario del Lago Albano. 1762.\n\nGiovanni Battista Piranesi: \"Plan of Rome\"\nFrom Le Antichita Romane I. 1756.\n\nGiovanni Battista Piranesi: \"Fragments of the marble plan of Ancient Rome\"\nFrom Le Antichita Romane I. 1756.\n\nGiovanni Battista Piranesi: \"Plan of a spacious and magnificent college\"\nFrom Opere Varie I. 1750.\n\nGiovanni Battista Piranesi: \"Plan of a spacious and magnificent college\"\nFrom Opere Varie I. 1750.\n\nGiovanni Battista Piranesi: Frontispiece, \"The Campus Martius of Ancient Rome\"\nFrom Il Campio Marzio dell'Antica Roma. 1762.\n\nGiovanni Battista Piranesi: \"Ichnographia,\" or plan of the Campius Martius.\nFrom Il Campio Marzio dell'Antica Roma. 1762.\n\nGiovanni Battista Piranesi: Detail, \"Ichnographia,\" or plan of the Campius Martius.\nFrom Il Campio Marzio dell'Antica Roma. 1762.\n\nGiovanni Battista Piranesi: \"View of the Theaters of Balbus and Marcellus\" and\n\"Elevation of the amphitheater of Statitilius Taurust\"\nFrom Il Campio Marzio dell'Antica Roma. 1762.\n\nGiovanni Battista Piranesi: \"View of the Pantheon and other buildings in its vicinity\"\nFrom Il Campio Marzio dell'Antica Roma. 1762.\n\nExcavations and reconstructions around Trajan's column and Trajan's forum.\n\nVendome Column, Paris.\nNapoleon had the VendA me Column erected in Paris, modeling it on Trajan's column.\n\nSlaves clearing ruins in Rome, 1830.\n\nDrawing depicting the Napoleonic excavation of the Roman Forum.\n\nDrawing depicting the Napoleonic excavation of the Roman Forum.\n\nThe clearing of the Temple of Vespasian.\nKnown at the time as the Temple of Jupiter Tonans (the Thunderer), this was one of the\nmost spectacular achievements of the French administration of Rome.\n\nSpace stretching from the Temple of Antoninus to the Curia.\nIn August 1899 it was decided to clear the whole of the space that stretched from the\nTemple of Antoninus to the Curia. An enormous amount of earth was removed, and a\nlarge number of houses were demolished.\n\nDrawing of catacomb.\nFrom Giovanni Battista de'Rossi, Underground Christian Rome. 1877.\n\nDrawings of catacomb.\nFrom Giovanni Battista de'Rossi, Underground Christian Rome. 1877.\n\nCeremony in a catacomb in the 19th century.\n\nThe pickax in this photograph symbolizes perfectly the way the Fascists massacred\nRome.\nHere, Mussolini himself wields the ax to open the excavation of the Via Dell'Impero.\n\nEtienne-Louis Boullee: Cenotaphe dans le Genre Egyptien, 1785.\n\nEtienne-Louis Boullee: Project for a cenotaph erected in memory of a national military\nhero.\n\nDrawing of the pyramid at Cheops by Benoit de Maillet, French Consul-General in Egypt\nunder Louis XIV.\nFrom his Description of Egypt, Containing Many Strange Observations on the Ancient\nand Modern Geography of this CountryA... 1735.\n\nWatercolor map of Egypt by Father Claude Sicard.\nSicard , a Jesuit priest who traveled throughout Egypt, made the first map of the country,\nalthough with the intent of retracing the route of the Biblical Exodus on his journey.\n1717.\n\nThe capture of Alexandria.\nThe French fleet arrived on 1 July 1798, and the governor surrendered on the 3rd.\nDrawing by Epinal.\n\nLouis Francois Lejeune: The Battle of the Pyramids, 1806.\nNapoleon reportedly exhorted his troops with the following words, \"Soldiers, from the\nheights of these pyramids forty centuries are watching you.\"\n\nA fantasy portrait of Vivant Denon in the role of scholar-sage, surrounded by antiques\nfrom the Louvre collections.\nDrawing by Benjamin Zix, 1811.\n\nView of the Institut d'Egypte, drawn by Protain in 1798.\nThe Institut was inaugurated by Bonaparte.\n\nVivant Denon measuring the Great Sphinx at Giza.\nFrom Denon, Picturesque Travels in Upper and Lower Egypt, 1802.\n\nFrontispiece. A panoramic view, showing the principal monuments of Egypt.\nFrom Alexandria to the Cataract. Edme Jomard: Recueil des observations des recherches\nqui ont EtE faites en Egypte pendant l'expEdition de l'armee francaise, 1809-1822.\n\nThe Grand Gallery in the Great Pyramid.\nFrom The Description of Egypt, 1809-1822.\n\nThe Grand Gallery in the Great Pyramid.\nFrom The Description of Egypt, 1809-1822.\n\nIllustrations of daily life in contemporary Egypt: Methods of irrigation.\nFrom The Description of Egypt, 1809-1822.\n\nIllustrations of daily life in contemporary Egypt: Making pipe cleaners; grinding tobacco;\nbasket making, unwinding wool and spinning.\nFrom The Description of Egypt, 1809-1822.\n\nThe pyramids of Giza.\nLuigi Mayer: Views in Egypt, 1804.\n\nIllustration from the Panorama and Nubia.\nPublished in 1838 by the French architect Hector Horteau. Showing (with any regard for\ndistances) the principal monuments of Egypt, from Pompey's Pillar at Alexandria (bottom\ncenter) to Philae (top), via the Giza pyramids, Karnak and Edfu.\n\nA peasant woman searching for antiquities in a Theban tomb to sell to Europeans or\nwealthy Cairenes.\nWater colour by Sir John Gardener Wilkinson.\n\nTrading in antiquities began in Cairo in the early 19th century, with local peasants acting\nas the suppliers.\nHere a wealthy Egyptian is being shown a sarcophagus complete with mummy and a\nstatue. Luigi Mayer: Views in Egypt, 1804.\n\nBust of the young Memnon being removed from Ramesseum.\nGiovanni Belzoni: Voyages in Egypt and Nubia, 1823.\n\nSometimes entire tombs were taken, but they also spurred new studies in these areas.\nTomb of Seti I.\nGiovanni Belzoni: Voyages in Egypt and Nubia, 1823.\n\nThe removal of \"Cleopatra's Needle\"\nThe removal of \"Cleopatra's Needle\" from the beach of Alexandria to the banks of the\nThames, London.\n\nEgyptian government staking claim to its antiquities.\nEventually, under the tutelary imperial politics of the French, the Egyptian government\nitself started to stake claim to its antiquities for its own museums.\n\nFrederick L. Norden: Ruins of the Palace of Memnon.\nTravels in Egypt and Nubia.\n\nQuatremere de Quincy: Views of Thebes, after Norden. De l'architecture Egyptienne,\n1802.\n\nPortrait of Jean-Francois Champollion.\n\nThe Rosetta Stone.\n\nWords deciphered using Rosetta Stone.\nChampollion first deciphered the two words \"Ptolemy\" and \"Cleopatra\" on the cuneiform\nscript.\n\nWords deciphered using Rosetta Stone.\nUsing the alphabets from the first two words, he further deciphered the words\n\"Alexander,\" \"Berenice,\" \"Tiberius,\" \"Nero,\" \"Vespasian,\" and \"Trajan.\"\n\nDisplacement of the colossal temples of Abu Simbel to higher ground during the building\nof Aswan High Dam, 1956.\n\nQueen Nefertiti's temple, Abu Simbel. Gau.\nAntiquitie de la Nubie, 1822.\n\nIllustrations by Gustave Dore.\nGustave Dore's illustrations for the French journalist Edmond About's book The King of\nthe Mountains (1856), where he humorously castigates Greek bandits.\n\nClandestine excavations at Corinth in 1877.\nThis scene could also illustrate the activity of the robbers of antiquities in Boeotia, where\nmore than eight thousand tombs were opened from 1870 to 1873. From the Illustrated\nLondon News, 1877.\n\nKarl Friedrich Schinkel: The Apogee of Greece, 1825.\nCopy attributed to Wilhelm Ahlborn, 1836. This painting could be seen as a visual\nexpression of Winkelman's and Goethe's theories on Greek art.\n\nThe Parthenon. Photography by Alfred Eisenstadt.\n\nPlan of the western part of the Acropolis as it existed at the end of the fifth century B.C.\n\nDrawing (one of four hundred) made by the French artist Jacques 1676, indicating the\nstate of preservation until that point.\nDetails of west pediment (left side).\n\nDrawing (one of four hundred) made by the French artist Jacques 1676, indicating the\nstate of preservation until that point.\nDetails of east pediment (left side).\n\nDrawing (one of four hundred) made by the French artist Jacques 1676, indicating the\nstate of preservation until that point.\nDetails of west pediment (right side).\n\nDrawing (one of four hundred) made by the French artist Jacques 1676, indicating the\nstate of preservation until that point.\nDetails of east pediment (right side).\n\nThese two views of the Parthenon reveal the scale of the destruction.\nThe first, by the painter William Gell, dates from 1801; the second painting is dated\n1810.\n\nFrieze of horsemen from the \"Elgin\" marbles, kept in the British Museum.\n\nReconstruction of the pediments by Ernst Berger, using Carrey's drawings\n\nFrieze of horsemen and a boy from the \"Elgin\" marbles, kept in the British Museum.\n\nFrieze of horsemen and a boy from the \"Elgin\" marbles, kept in the British Museum.\n\nTomb of the Han general Huo Qubing identified by European archaeologists in 1914.\n\nMeeting of the Geological Survey of China, 1936.\n\nTicket to the mausoleum of Qin Shi Huangdi (circa 3rd century BC).\nRoughly 6000 of these terracotta soldiers were discovered in 1974.\n\nNew forms of cultural politics.\n\nJohn Soane's house-museum at Lincoln's Inn Fields.\n\nJohn Soane's house-museum at Lincoln's Inn Fields.\n\nFrontispiece. A panoramic view, showing the principal monuments of Egypt."
    },
    {
      "category": "Resource",
      "title": "4_645_week_02.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-645-selected-topics-in-architecture-architecture-from-1750-to-the-present-fall-2004/247e3acec58b086124cc59017edd1013_4_645_week_02.pdf",
      "content": "Week 02 - Transatlantic Slave\nJeremy Bentham's Panopticon.\nJeremy Bentham's Panopticon.\nThe different kingdoms of West Africa at the beginning of the slave trade.\n18th century British map of Africa.\nWinneba fort, near Accra, and James Fort, Accra.\nWinneba fort, near Accra, and James Fort, Accra. cape Coast Castle and Dixcove Fort,\nnear Cape Coast, showing gardens.\nA slaver's house in interior Africa.\nA coffle: captives.\n\nA Slave market in Algiers.\nSlave awaiting transportation.\nSlave awaiting transportation.\nElmina Castle, 1948, looking east.\nElmina Castle, 1948, looking north.\nElmina Castle, Ground Level Plan.\nElmina Castle, First Floor Plan.\nElmina Castle, 1948, looking south.\nElmina Castle, South corner.\n\nWest bastion and colonnade.\nCape Coast Castle, Ground Floor Plan, April 1756.\nCape Coast Castle, looking west.\nCape Coast Castle, illustration from 1682.\nCape Coast Castle, Plan of Southern Battery and Slave-Prisons.\nPrincetown: Gross-Friedrichsburg.\nBeraku: Fort Good Hope\nDixcove Fort, 1948, looking north-west.\nIron-door of slave prison, Dixcove Fort.\n\nSekondi: Fort Orange. Upper plan, Feb. 1791.\nSekondi: Fort Orange. Upper plan, Feb. 1791.\nA Liverpool slave ship, about 1780, by William Jackson.\nInsurrection on board a slave ship.\nInside of slave ship.\nSlave quarters.\nSections of the \"Brooke.\"\nThe \"Brooke\"\nModel of ship showing slaves in Middle passage.\n\nModel of the Watt, a slave ship built in Britain in 1797.\nCorbusier's comparison of the Aquitania to iconic Western architecture.\nThe \"Aquitania\", from Le Corbusier's extended discussion on ships.\nFr. Schuster: Kitchen nook in Vienna's public housing. (Winarskihof)\nHans Schmidt, Proposal for cooperative houses in Basel, 1928.\nJosef Polasek, Municipal housing colony in Kralov Pole in Brno, 1931-32, former\nCzechoslovakia\nOssendorf-Pozemny-Tenzer, Houses with minimum apartments, 1930.\nJosef Polasek, Urban apartment houses in Brno, 1930-31. Erstwhile Czechoslovakia.\n\nK. Kupka, Furnishing a minimum flat (50 sq. mts.), 1928, First prize in competition.\nWarehouses, St. George's Dock, Liverpool, by Samuel Austin, 1829.\nSugar and rum being unloaded on London's West India docks.\nLancaster shipping alongside St. George's Quay, about 1790, by G. Yates.\nSlave shipyard in Lancaster, by J. C. Ibbetson, 1807.\nA Dutch slave auction in New Amsterdam, the future New York.\nTreating for Slaves published in 1798.\nPoster advertising the sale of slaves.\nA slave \"pen\" belonging to dealers in Alexandria, Virginia.\n\nBranding irons.\nSlaves fell ripe sugarcane with machetes during harvest in the Barbados.\nProcessing of sugarcane.\nRollers squeezing juice out of cane.\nSugarcane being processed into rum and sugar in boiling hot vats.\nA print of Roehampton estate, in Jamaica.\nA print of Old Montpellier estate, in Jamaica.\nCompound building, Guinea rainforest.\nA Mendi village in Sierra Leone.\n\nThatched wattle-and-daub housing in Jamaica, about 1860.\nThatched wattle-and-daub housing in Jamaica, about 1860.\nBig House of the Noruega Plantation.\nBig House of the Noruega Plantation.\nPlan of Uncle Sam's Plantation, St. James Parish, Louisiana.\nBayou block plantation. Louisiana.\nSite plan of Hayes Manor, Chowan County, North Carolina.\nOak-lined approach to Boone Hall, Berkeley County, South Carolina.\nAerial view of Uncle Sam plantation, St. James Parish, Louisiana.\n\nFront elevation of the mansion at Uncle Sam plantation.\nSlave quarter at the Hurt house, Macon county, Alabama.\nFront elevation, plan, of the slave quarter at the Hurt house.\nSlave quarter at The Forks of Cypress, Lauderdale County, Alabama.\nFloor plan of the slave quarter at the Forks of Cypress.\nHouse of Bakongo slave, near Edgefield, South Carolina.\nKongo house type, Angola, 1910.\nRestored log slave house at Sotterley Plantation, St. Mary's County, Maryland.\nFloor plan of restored log slave house at Sotterley.\n\nMount Vernon - residence of George Washington.\nUnidentified log house, photographed near the turn of the century, presumably near\nRichmond, Virginia.\nLog rain barrel, a common artefact around the houses of slaves.\nKitchen garden, Mount Vernon.\nDrawing of Monticello.\nPlan of Monticello.\nPhoto of economic migrants in Europe by Jean Mohr.\nPhoto of economic migrants in Europe by Jean Mohr."
    },
    {
      "category": "Resource",
      "title": "4_645_week_03.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-645-selected-topics-in-architecture-architecture-from-1750-to-the-present-fall-2004/369cbf11646b7e688f89434a83420472_4_645_week_03.pdf",
      "content": "Week 03 - Landscape\nGary Larson, cartoon.\nChatsworth House and gardens.\nStowe, Plan of the estate, designed by Charles Bridgeman, 1720s.\nSuccessive stages of landscaping at Stowe.\nStowe: the Temple of British Worthies.\nStowe: the Temple of Ancient Virtue.\nStowe, The Rotunda.\nStowe, Gothic Temple, 1741, by James Gibbs.\n\nStowe.\nStowe.\nStowe: garden project by Charles Bridgeman, 1720.\nStowe: the Rotondo, by Sir John Vanbrugh, with Charles Bridgeman's \"ha-ha\" to the\nright.\nClaude Lorrain, Landscape near Rome with a View of the Ponte Molle, 1645.\nChiswick House from the west in 1753, showing the cascade, by William Kent, early\n1730s.\nTwickenham, Alexander Pope's villa, remodeled after 1718.\nTwickenham, Alexander Pope's villa, remodeled after 1718.\nChiswick House: plan of the garden by Burlington, 1720s, and William Kent, early\n1730s.\n\nChiswick House: project for the Great Walk and Exedra, by William Kent.\nPraeneste Terrace, by William Kent.\nThe Vale of Venus, by William Kent.\nH. A. S. Dearborn and Alexander Wadsworth: Plan of Mount Auburn Cemetery,\nCambridge, MA. 1836.\nView of Mount Auburn cemetery, looking across Garden Pond.\nCapability Brown: Ugbrooke, South Devon.\nCapability Brown: Grimsthorpe.\nThe shape of the lakes at Luton Hoo is a perfect example of Brown's treatment of water.\n\nCapability Brown, overflow at Weston Park.\nCapability Brown: Clumps of trees at Petworth, West Sussex.\nCapability Brown: Trentham, 1795.\nCapability Brown: plan of Blenheim Park, probably his largest project.\nCapability Brown: Blenheim Park.\nA selection of gardeners' tools, engraving by Liger, 1723.\nMen scything the grass to create lawns of a perfectly smooth, gently undulating surface.\nOne of two engravings (\"before\") by Thomas Hearne.\nOne of two engravings (\"after\") by Thomas Hearne.\n\nDownton Castle, by Richard Payne Knight, 1772.\nBarnbarrow, Dumfries, Illustration - 'before' the proposed alterations.\nBarnbarrow, Dumfries, Illustration - 'after' the proposed alterations.\nHumphry Repton: inside front cover of the Red Book for Blaise Castle, with trade card in\nthe middle.\nHumphry Repton: Blaise Castle, \"before\" and \"after\" views.\n\"Ichal map with a blue knot,\" 1784.\n\"Trompe l'oeil with butterflies,\" 1793.\nOutlines of trees for maps, 1793.\nKirn, map study, 1792.\n\nG. Bremontier, canal project at summit level, drawing exercise at the Ecole\nPolytechnique.\nRiche de Prony, Atlas des Marais Pontins (1822).\nHodges, William: Gate of the Caravenserai, Rajmahal.\nHodges, William: The Mosque at the Hadaf, Rajmahal.\nHodges, William: Part of the Palace of Shah Shuja, Rajmahal.\nHodges, William: Tomb and Distant View of the Rajmahal hills.\nChinnery, George: Sunlit Tomb with Figures Drawing Water.\nChinnery, George: Bathers by a Ruined Tomb.\n\nIllustrations of funerary monuments and an iron-smelting bellows.\nW. Prinsep: View in the Kasya Hills, 1831.\nHerbert B. Edwardes, \"Lieut. Lake. Engr., ascertaining the capabilities of the Guggur\nRiver for irrigation.\" 1845.\nGodfrey Thomas Vigne, \"Major Everest G. T. Survey of India pulling up Trigon. Mast of\nChur Mtn.\": 10th October, 1834.\nAlexander Boileau, Survey of a route from Putpurgunj (Delhi) to Aligarh.\nThe Survey of India's determination of the longitude of Kanyakumari.\nField book entry of part of village boundary traverse.\nMap of the boundary traverse shown in the field book entry.\nSame map with interior detail added.\n\nJ. B. Norris, \"Plan Table Maps of the Nagpur Survey,\" 1821-1831.\nTriangulations documenting the surveyed areas of India until 1843.\nDormitory township, Soweto.\nDormitory township, Soweto.\nMonticello, perspective drawing.\nMonticello, plan of garden.\nMonticello, general plan of house and gardens.\nMonticello, plan of orchard by Thomas Jefferson, 1778.\n\nMonticello, survey by Jefferson showing houses, offices and four roundabouts, 1803.\nAndrew Ellicott, plan of Washington D. C.\nIrrigated Fields in Desert. Holtville, California.\nSquare-Lot Homestead, Fargo Area, North Dakota.\nThe Survey Landscape from the Air. Castleton, North Dakota.\nRemnant Beach Ridges across the Grid. Reynolds, North Dakota.\nPedological Drift, Faiville, North Dakota, 14X20\".\nRailroads across the Survey Landscape. Castleton, North Dakota.\nRailroads across the Northern Plains. 14X20\".\n\nRoad grid correction jog. Castleton, North Dakota.\nGrid correction lines. 14X20\".\nDrumlin Settlement. Williamson, New York.\nDrumlin fields, Williamson, New York. 12X16\".\nMississippi long-lots. Hermitage, Louisiana.\nLong-lots along the Mississippi. Ascension Parish, Louisiana. 12X16\".\nDesert Grid, Mojave Desert, California.\nDesert-Oasis Housing Development. Mojave Desert, California.\nGhost Development plot. Near Santa Fe, New Mexico.\n\nEarthworks for Hillside Housing. Near Los Angeles, California.\nForest clear-cut. Northern Maine.\nGlen Canyon Dam, Colorado River, Arizona.\nDrainage Dikes along Roadside, Arizona.\nWindmill Row with Roads, Tehachapi, California.\nCluster of Pivot Irrigators. Tuscarora, Nevada.\nBurning wheat furrows, Snake River Valley, Idaho.\nField with tractor lines, Munich, North Dakota.\nV. L. A. dish at end of track. Magdalena, New Mexico.\n\nWheat strips on Plateau, Cutbank, Montana.\nWheat fields on tablelands cut by the Marias river. Cutbank, Montana.\nNavaho Spring-Line fields. Tuba-city, Arizona. 12X16\".\nNavaho Spring-Line fields. Tuba-city, Arizona.\nIntaglio marking, Blythe City, California.\nIntaglio marking, Blythe, California.\nCahokia mounds. Collinsville, Illinois.\nHopi village and horizon. Hopi Indian reservation, Arizona.\nRobert Smithson, Spiral Jetty, 1970. Great Salt Lake, Utah.\n\nRobert Smithson, Spiral Jetty, 1970. Great Salt Lake, Utah.\nRobert Morris, Observatory, 1971. Oostelijk Flevoland, the Netherlands.\nRobert Morris, Observatory, 1971. Oostelijk Flevoland, the Netherlands.\nAnt Farm (Chip Lord, Hudson Marquez, Doug Michels): Cadillac Ranch, 1974.\nAmarillo, Texas.\nDavid Nash. Running Table, 1978. Grizedale Forest, Cumbria, England.\nNancy Holt. Sun Tunnels, 1973-76. Lucin, Utah.\nNancy Holt. Sun Tunnels, 1973-76. Lucin, Utah.\nCharles Simonds. Dwelling, P.S.1, Long Island City, New York, 1975.\n\nCharles Simonds. Age, 1982-83, detail. Installation at the Guggenheim Museum, New\nYork.\nChristo, Running Fence, Sonoma and Marin Counties, California, 1972-1976.\nChristo, Running Fence, Sonoma and Marin Counties, California, 1972-1976.\nWalter De Maria, The Lightning Field, 1977.\nWalter De Maria, The Lightning Field, 1977.\nMichael Heizer, Effigy Tumuli, Turtle, 1985. Buffalo Rocks, Illinois.\nMichael Heizer, Effigy Tumuli, Turtle, 1985. Buffalo Rocks, Illinois.\nHomeland consolidation plans, 1973\nForced removals of populations between African homelands, 1970.\n\nTwo kinds of land owner in North America\nTypical quadrant of the U.S. Public Land Survey\nThomas and William Daniell, \"Sankry Droog\" - May 1792\n\"Fort, Sankaridurg\": Antonio Martinelli, August 1996."
    },
    {
      "category": "Resource",
      "title": "4_645_week_05.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-645-selected-topics-in-architecture-architecture-from-1750-to-the-present-fall-2004/5eae772e9232e9444453141dd4fb27af_4_645_week_05.pdf",
      "content": "Week 05 - Ornament (Crime?)\nChristopher Dresser\nChristopher Dresser\nChristopher Dresser\nChristopher Dresser\nChristopher Dresser\nChristopher Dresser\nWilliam Morris, \"Daisy\" wallpaper\nCrystal Palace, 1851\nCrystal Palace, 1851"
    },
    {
      "category": "Resource",
      "title": "4_645_week_07.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-645-selected-topics-in-architecture-architecture-from-1750-to-the-present-fall-2004/5cbf031a5622e36fa75698d4ca5fe3df_4_645_week_07.pdf",
      "content": "Week 07 - Gender & Domesticity\nDomesticity; Gender in Space\nDaniel Goodwin House, Chicago.\nFrank W. Palmer House, Chicago.\nLiving-dining room from Modern Homes.\nPrecut model house from Modern Homes.\nThe parlor of the Dr. Bailey House in Santa Ana, California, 1876.\n\"Finishing Pants,\" a Jacob Riis photograph of tenement homework, 1898.\nRobson, Latchmere Road School, 1889.\nManual Training Center , Old Palace School, 1892.\n\nWoodworking Center, Bellenden Road School, Camberwell.\nDomestic Economy Center, Surrey Lane School, West Lambeth.\nHousewifery Center, Modern Terrace School, Greenwich. 1889.\nHousewifery Center, Denmark Hill School, Camberwell\nCookery Center, Kilburn Lane School, Paddington.\nLaundry Center, Beaufort House School, Camberwell.\nMetalwork Center, Blackheath Road School, Greenwich.\nBoys atdrill, Upper Road School, Islington, 1906.\n\nToynbee Hall.\nToynbee Hall.\nDrawing room of Toynbee house.\nDining room of Toynbee house.\nHenry Walker, drawing of Oxford Hall, London, 1896.\nElijah Hoole, Bermondsey Settlement, 1892.\nMaypole Dance, 1907.\nProgramme illustration.\nPotraits from McClintock, Imperial Leather.\n\nPotraits from McClintock, Imperial Leather.\nPotraits from McClintock, Imperial Leather.\nPotraits from McClintock, Imperial Leather.\nPotraits from McClintock, Imperial Leather.\nPotraits from McClintock, Imperial Leather.\nPotraits from McClintock, Imperial Leather.\nPotraits from McClintock, Imperial Leather.\nThe disappearing act of labor from McClintock, Imperial Leather.\nIllustration from McClintock, Imperial Leather.\n\nThe boot fetish from McClintock, Imperial Leather.\nIllustration from McClintock, Imperial Leather.\nPage layout from Journal, 1914.\nAd with an image of a white domestic servant from Ladies' Home Journal, 1918.\nAd with an image of an African-American domestic servant from Ladies' Home Journal,\n1924.\nAd from Ladies' Home Journal, 1925.\nAd from Ladies' Home Journal, 1913.\nAd from Ladies' Home Journal, 1924.\nAd from Ladies' Home Journal, 1921.\n\nAd from Ladies' Home Journal, 1920.\nAd from Ladies' Home Journal, 1915.\nAd from Ladies' Home Journal, 1920.\n\"A Home in a Prairie Town\"\nFrank Lloyd Wright's first model house for the Ladies' Home Journal, 1901.\nQuadruple block plan by Frank Lloyd Wright from the Ladies' Home Journal, 1901.\nMiniature suburb constructed by children at a Chicago playground, 1922.\nFrank Lloyd Wright's third model house for the Ladies' House Journal, 1907.\n\nA San Francisco house of 1915 modeled on Wright's house for the Ladies' House Journal,\n1907.\nCheney house, diagrammatic drawing by William Hook.\nFrank Lloyd Wright, Cheney House, 1904\nDiagram from Hildebrand, The Wright Space.\nFrank Lloyd Wright, Robie House, 1908-10.\nDiagram from Hildebrand, The Wright Space.\nFrank Lloyd Wright, Taliesin, Hillside, Wisconsin, 1911.\nDiagram from Hildebrand, The Wright Space.\nFrank Lloyd Wright, Freeman House, Los Angeles, 1923-24\n\nDiagram from Hildebrand, The Wright Space.\nDiagram from Hildebrand, The Wright Space.\nAd for a water system, 1936.\nRural water supply, 1906.\nAd for Pearline Soap, 1892.\nThis photograph from a 1932 ad for coffee shows a supposed \"time and motion study\" in\noperation.\nThe plans are from an article on minimal space planning.\nBuckminster Fuller's proposal for a Mechanical Core,\" which services the bathroom and\nthe kitchen to be delivered as a fixed unit.\n\nA 1930 ad for Standard Sanitary Mfg. Co.\n1934 ad for Armstrong Linoleum Floors.\nThis 1944 ad from Standard presents a cut-away view of the \"Duo-Use\" bathroom that\nallows for multiple access and simultaneous use.\n1945 ad from the Briggs Mfg. Company.\nBathroom from Richard Neutra's 1935 Von Sternberg House in Northridge, California.\nContinuous kitchen in ad for linoleum.\nChristine Frederick's Inefficient Kitchen.\nChristine Frederick's Inefficient Kitchen.\nFrankfurt Kitchen, 1925. Margarete Schutte-Lihotsky.\n\nEarlier models of full kitchen dressers.\nKitchen furniture.\nCentral image, Westinghouse kitchen interior, c. 1940.\nMies van der Rohe, Farnsworth House, Plano, Illinois, 1945-51.\nMies van der Rohe, Farnsworth House, Plano, Illinois, 1945-51.\nThe Familistere, or Social Palace, Guise (by Jean-Baptiste Godin), France, begun in\n1859.\nThe Familistere, or Social Palace, Guise (by Jean-Baptiste Godin), France, begun in\n1859.\nMies van der Rohe, Edith Farnsworth House, 1946-51\n\nMies van der Rohe, Edith Farnsworth House, 1946-51\nRaymond Unwin and Barry Parker, site plan for housing with central kitchen, dining\nroom, and laundry for Yorkshire workers, 1901.\nUnwin and Parker, plan of five bedroom houses.\nAlice Constance Austin showing her kitchenless house to clients, 1916, Austin, first floor\nplan for a kitchenless house at Llano del Rio, California, 1916.\nAustin, site plan for a sector at Llano."
    },
    {
      "category": "Resource",
      "title": "4_645_week_09.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-645-selected-topics-in-architecture-architecture-from-1750-to-the-present-fall-2004/4c8eb7c3c68c1fb463303f9727a6da6f_4_645_week_09.pdf",
      "content": "Week 09 - Body Talk\nMuscles of the hand and forearm from Govard Bidloo, Anatomia Humani Corporis, 1685.\nSelf-demonstrating anatomy from Juan Valverde's Historia de la composision del cuerpo\nhumano, 1556.\nIllustration from Vesalius's Fabrica.\nIllustration from Vesalius's Fabrica.\nPaulo Mascagni (1755-1815) Images of Universal Anatomy.\nPaulo Mascagni (1755-1815) Images of Universal Anatomy.\nAndre'-Pierre Pinson, 1780.\nFrancesco Calenzuoli (1796-1829).\n\nFrancesco Calenzuoli (1796-1829).\nAndre'-Pierre Pinson, 1780.\nAnatomical Statue, 1600. Roudillon Collection.\nMRI Scans\nA simple method based on the projection on the projection of luminous grillwork.\nA 'virtuous Negro''s head.\nHead of the parricide Martin executed at Paris.\nIllustration from Philippe Comar: Images of the Body.\nIllustration from Philippe Comar: Images of the Body.\n\nG. B. della Porta.\nCharles le Brun, Eagle and Man.\nLeonardo da Vinci's 1490's Vitruvian Man.\nLe Corbusier's modular system\nOskar Schlemmer's 1920's costume.\nYves Klein, Anthropometrics, 1960.\nIllustration from Philippe Comar, Images of the Body.\nJean-Paul Goude, The French Correction, 1972.\nIllustrated in Dominique Laporte, History of Shit.\n\nSanitation in the middle ages.\nHouses with every sanitary arrangement faulty. (Teale, Dangers to Health, 1881).\nSection of House no. 2 (Drysdale and Hayward, Health and Comfort in House Building).\nDiagram of the Banner system of house drainage (Banner, Wholesome Houses, 37).\nA properly plumbed house-Woman's Sphere (Plunkett, Women, Plumbers and Doctors).\nTest for faulty material.\nTest for putty joints.\nIllustration of a pregnant woman.\n\nPlans of laying-in rooms by W.S. Playfair.\nObjects of confinement.\nInfection of lying-in room following childbirth.\nInterim Office of Architecture.\nUntitled, 1991-1993.\nInterim Office of Architecture, View of non-functioning urinals.\nInterim Office of Architecture, View of the sink wall with lights above.\nKennedy and Violich Architecture, Women's bathroom and detail of puckered tile and\nDrain Microbe Tile.\nKennedy and Violich Architecture, Men's bathroom and detail of text tile from building\ncode.\n\nIllustration from M. Feher, R. Naddaff, and N. Tazi, (ed.): Zone, Fragments for a History\nof the Human Body, Part 2.\nCompression Chair.\nIllustration from M. Feher, R. Naddaff, and N. Tazi, (ed.): Zone, Fragments for a History\nof the Human Body, Part 2.\nIllustration from M. Feher, R. Naddaff, and N. Tazi, (ed.): Zone, Fragments for a History\nof the Human Body, Part 2.\nA group of Algerian women arranged by a postcard photographer to evoke a harem\nscene, 1915.\nAnge Tissier, An Algerian and her Slave, 1860.\nArab women.\nMoorish women\n\nScenes and types. Moorish women.\nYoung Moorish women.\nScenes and types. Moorish women taking a walk.\nAlgiers. Moorish women on their way to the cemetery.\nEugene Delacroix, Women of Algiers in their room, 1834.\nPablo Picasso, 1955.\nFemmes Kabyles. Postcard bought by Le Corbusier in Algiers in 1931.\nLe Corbusier's sketch from the postcard, 1932.\nSketches from Le Corbusier: Poeste sur Alger.\n\nSketches from Le Corbusier: Poeste sur Alger.\nSketches from Le Corbusier: Poeste sur Alger.\nAriel view of Algiers, showing the junction of the Casbah on the left and the French city,\non the right.\nSketches from Le Corbusier: Poeste sur Alger.\nSketches from Le Corbusier: Poeste sur Alger.\nLe Corbusier's sketch 1917.\nLe Corbusier's sketch 1951.\nLe Corbusier painting one of the murals.\n\nLe Corbusier's sketch.\nDiagram from the Triate de Passions of Rene Descartes.\nOn a decouvert le terrain.\nLe Plan est installe, 1954.\nRio de Jsneiro, 1942.\nVilla Savoye.\nVilla Savoye.\nVilla Savoye.\nCharlotte Perriand in the chaise-longue against the wall.\n\nCullwick as an angel & race and gender transvestism: Cullwick as a male slave.\nCullwick as a drudge.\nCindy Sherman, Untitled Film Still # 35, 1979.\nCindy Sherman, Untitled Film Still # 48, 1979.\nCindy Sherman, Untitled # 93, 1981.\nCindy Sherman, Untitled # 95, 1981.\nCindy Sherman, Untitled # 126, 1983.\nCindy Sherman, Untitled # 122, 1983.\nCindy Sherman, Untitled # 250, 1992.\n\nRobert Mapplethrope, Man in Polyester Suit, 1980.\nAnonymous, Orgy Scene from the masquis de Sade's Justine, 1761.\nPaul Cadmus, Y.M.C.A. Locker Room, 1933.\nWest Street, New York, 1977.\nSteve Jaycox, An Anonymous Gay Bar Interior, 1996.\nSteve Jaycox, Sex Club Interior, 1996.\nMap of Gay Residential Areas in San Francisco, 1977.\nFloor plan and axonometric of Changing 'Cabanas'\nView of changing room doors.\n\nStraight peep show.\nBuilding cross section.\nPage layout from Joe Sanders (ed.): Stud: Architecture of Masculinity.\nPage layout from Joe Sanders (ed.): Stud: Architecture of Masculinity.\nPage layout from Joe Sanders (ed.): Stud: Architecture of Masculinity.\nPage layout from Joe Sanders (ed.): Stud: Architecture of Masculinity.\nItalian 18 C. mechanical marionette with internal strings.\nUnfinished marionettes by W.A. Dwiggins.\n\nTime clocks.\nA mechanical frog.\nProsthesis of legs, hand and arm from the time of Ambroise Pare. 1888.\nFrom Musee d'Art et d'Histoire, Neuchatel.\nJulien de La Mettrie, Man a Machine, 1747.\nA device from the early 20th century.\nFrom La Nature, 1800.\nA vibrating helmet used for the curing of nervous system.\nFemale students performing floor exercises, Bauhaus, Dessau.\n\nMuscle-stimuli experiments on frogs\nMarcel Duchamp - Nude Descending a Staircase\nOskar Schlemmer, Costumes\nOskar Schlemmer, Costumes\nOskar Schlemmer, Costumes\nOskar Schlemmer, Costumes\nOskar Schlemmer, Costumes\nOskar Schlemmer, Costumes\nOskar Schlemmer, Costumes\n\nOskar Schlemmer, Costumes\nOskar Schlemmer, Costumes"
    },
    {
      "category": "Resource",
      "title": "4_645_week_10.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-645-selected-topics-in-architecture-architecture-from-1750-to-the-present-fall-2004/30e16729514b344a86d6ef612ebaf2d7_4_645_week_10.pdf",
      "content": "Week 10 - Ludic Spaces\nExposition Universelle, Paris, 1867. Birds eye view.\nExposition Universelle, Paris, 1867. Restaurant and promenade along thr exterior of the\nMain Building.\nExposition Universelle, Paris, 1869. Eiffel Tower during a light show.\nExposition Universelle, Paris, 1869.\nWorld's Colombian Exposition, Chicago, 1893.\nExposition Universelle, Paris, 1900.\nLouisiana Purchase Exposition, St. Louis, 1904.\nExposition Universelle et Internationale, Brussels, 1910.\n\nPanama-Pacific International Exposition, San Francisco, 1915.\nExposicion General d'Espana, Barcelona, 1929-30.\nThe Luna Park.\nS Century of Progress Exposition, Chicago, 1933.\nNew York World's Fair, New York, 1939.\nExposition Universelle et Internationale, Brussels, 1958.\nCentury 21 Exposition, Seattle, 1962.\nCentury 21 Exposition, Seattle, 1962.\nUniversal and International Exhibition, Montreal, 1967.\n\nHabitat, architect Moshe Safdie.\nUniversal and International Exhibition, Montreal, 1967.\nJapan World Exhibition, 1970.\nJapan World Exhibition, 1970.\nJapan World Exhibition, 1970.\nJeremy Bentham, Panopticon building, 1791.\nCross-section and ground plan of the Diorama building, London. Louis Jacques Mande\nDaguerre, 1822.\nCross-section of Barker's panorama, 1792.\n\nPassage des Panorama, 1800.\nAn early 'Bioscope Show' 1897.\nIllustration from David Braithwaite, Fairground Architecture.\nDetail of Right Bank, plan, Paris.\nSite of the Passage des Panoramas, Paris.\nPassage des Panoramas, Paris, 1810.\nPassage des Panoramas, Paris.\nPassage Choiseul, Paris.\nPassage Jouffroy, Paris, 1845-47.\n\nPassage Choiseul, Paris, 1967.\nPassage Choiseul, Paris.\nParis, Bon Marche, woodcut, 1880.\nKaisergalerie,Berlin.\nFriedrichstrassenpassage,Berlin.\nCleaveland Arcade.\nThomas Cook's add for Cook's Excursionist, 1851.\nIgnace Isidore Gerard Grandville, 'Flaneur of the Universe, 1844.\nA Coney Island guidebook, 1904.\n\nSteeplechase Park.\nCrowds on Coney Island's Bowery, 1903.\nAmusement sites, early 20th century.\nLuna Park at night, 1904.\nThe Kaleidoscopic Tower, Luna Park, 1904.\nDreamland Park, 1905.\nThe \"Human Whirlpool\" at Steeplechase Park.\nVisitors can sit on the rim of a giant cocktail glass.\nToyland, castle of cards.\n\nThe Maya Pyramid.\nGrand Canon\nReproduction of the Ben Holladay stagecoach.\nPentence Station.\nImages of the profile of the enclosure, with the minaret.\nCentral Plaza.\nSki Dome.\nBalcony used as a waiting area.\nKihoku Museum of Astronomy.\n\nItakeskus Swimming Baths.\nThe Florida Aquarium.\nThe Florida Aquarium.\nEPCOT Center, 1971.\nSleeping Beauty Castle Disneyland.\nWalt Disney World Master Plan.\nSite plan, wonder world.\nIllustration from Karal Ann Marling (ed.): Designing Disney's Theme Parks.\n\nGoofy's gas, Mickey's toontown, Disneyland.\nView of Mickey's house.\nIllustration from Karal Ann Marling (ed.): Designing Disney's Theme Parks.\nRedesigned Tomorrowland of Disneyland.\nDisneyland.\nDisneyland.\nDisneyland.\nFremont Street, Las Vegas.\nFremont Street, Las Vegas.\n\nThe Riviera sign, Las Vegas.\nPassegiata, Las Vegas style.\nLas Vegas.\nLu Dive, Las Vegas.\nMGM Grand Hotel, Casino and Theme Park.\nStratosphere Tower by Gary nelson, 1996.\nCollages by Peter Taylor and Peter Cook, 1963.\nLiving City Exhibition, 1963.\n'Interchange' project 1963, Ron Herron and Warren Chalk.\n\nCollage from Archigram 5.\nSpace Probe: article from Archigram 4, 1964.\n'CSB 63.4' 1964 David Greene. A mechanized Pod House.\nSpace Probe: article from Archigram 4, 1964.\nSpace Probe: article from Archigram 4, 1964.\nMontreal Tower, Peter Cook, 1963.\nPlug-in City, Peter Cook, 1964.\nPlug-in City, Peter Cook, 1964.\nPlug-in City, Peter Cook, 1965-6.\n\nWalking City 1964, Ron Herron.\nLiving Pod: detail 1965, David Greene.\nLiving Pod: detail 1965, David Greene.\nThe Cushicle, Mike Webb, 1966-67.\nControl and Choice Project.\nSuitaloon 1968 Michael Webb.\nInstant City in a field: 1969, Peter Cook.\nInstant City in a field: 1969, Peter Cook.\nBournemouth 'Steps' Project, 1970-71, Peter Cook.\n\nIt's a ..., 1972 Ron Herron.\nGuy Debord, \"Life continues to be free and easy,\" 1959.\nGuy Debord with Asger Jorn, Guide psychogeographique de Paris, 1956.\nGuy Debord with Asger Jorn, The Naked City, 1957.\nCassen and Albert, University of Paris, Faculty of Sciences, 1962.\nRalph Rumney, Psychogeographic Map of Venice, 1957.\nGuy Debord with Asger Jorn, page from Memoires, 1959.\nGuy Debord with Asger Jorn, page from Memoires, 1959.\nSuperstudio, A Journey from A to B, 1969.\n\nNew Babyloniens, 1971.\nIllustration from Jean-Clarence Lambert: New Babylon Constant.\nIllustration from Jean-Clarence Lambert: New Babylon Constant.\nIllustration from Jean-Clarence Lambert: New Babylon Constant.\nIllustration from Jean-Clarence Lambert: New Babylon Constant.\nIllustration from Jean-Clarence Lambert: New Babylon Constant.\nIllustration from Jean-Clarence Lambert: New Babylon Constant.\nIllustration from Jean-Clarence Lambert: New Babylon Constant.\nIllustration from Jean-Clarence Lambert: New Babylon Constant.\n\nIllustration from Jean-Clarence Lambert: New Babylon Constant.\nIllustration from Jean-Clarence Lambert: New Babylon Constant.\nIllustration from Jean-Clarence Lambert: New Babylon Constant.\nIllustration from Jean-Clarence Lambert: New Babylon Constant.\nIllustration from Jean-Clarence Lambert: New Babylon Constant.\nIllustration from Jean-Clarence Lambert: New Babylon Constant.\nIllustration from Jean-Clarence Lambert: New Babylon Constant.\nIllustration from Jean-Clarence Lambert: New Babylon Constant.\n\nIllustration from Jean-Clarence Lambert: New Babylon Constant.\nIllustration from Jean-Clarence Lambert: New Babylon Constant.\nIllustration from Jean-Clarence Lambert: New Babylon Constant.\nIllustration from Jean-Clarence Lambert: New Babylon Constant.\nIllustration from Jean-Clarence Lambert: New Babylon Constant.\nIllustration from Jean-Clarence Lambert: New Babylon Constant.\nIllustration from Jean-Clarence Lambert: New Babylon Constant.\nIllustration from Jean-Clarence Lambert: New Babylon Constant.\nIllustration from Jean-Clarence Lambert: New Babylon Constant.\n\nCentre Beaubourg, Paris, 1972-77, Piano\nCentre Beaubourg, Paris, 1972-77, Piano\nCentre Beaubourg, Paris, 1972-77, Piano\nCentre Beaubourg, Paris, 1972-77, Piano\nBernard Tschumi, James Joyce's Finnegans Wake, 1976.\nBernard Tschumi, Joyce's Gardenn 1976-77.\nBernard Tschumi, an urban park for the 21st century.\nBernard Tschumi, General \"Urbanism\" Document.\nBernard Tschumi, superimposition points/ lines/ surfaces, 1982.\n\nBernard Tschumi, General \"Urbanism\" Document, Ariel view.\nBernard Tschumi, Combination Models, 1983.\nBernard Tschumi, Sequences, 1984.\nBernard Tschumi, Sequences, 1984.\nBernard Tschumi, programmatic Deconstruction, 1983.\nBernard Tschumi, Mechanical Axonometrics, 1983.\nBernard Tschumi, North-South Gallery, 1986.\nBernard Tschumi, Ideograms.\nPalais Royal\n\nPalais Royal, Galeries de Bois, 1786-1788, demolished 1828\nPalais Royal, Galeries de Bois, plan, cross section, roof plan\nPalais Royal, galleries, shown in a watercolor, La Sortie du Numero 113, 1815"
    },
    {
      "category": "Resource",
      "title": "4_645_week_11.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-645-selected-topics-in-architecture-architecture-from-1750-to-the-present-fall-2004/928dfd1119372a7b697fa86d106fe410_4_645_week_11.pdf",
      "content": "Week 11 - Architecture of State\nParis in the time of Louis XIII.\nParis in 1852.\nParis, the quarter of the Palais Royal.\nThe Gallery d'Orleans, Palais Royal, 1830.\nPlan of Paris during the three days of July, 1830.\nPlan of Paris during the three days of July, 1830.\nA barricade, July 1830.\nThe revolution of 1830.\n\nVictor Hugo, barricade in the faubourg Sainte-Antonie, 1848.\nVictor Hugo, barricade in the faubourg Sainte-Antonie, 1848.\nGalignani's Plan of Paris, 1839.\nJoanne's Plan of Paris, 1876.\nBuilding works at the place du Carrousel, 1852.\nThe facades of Boulevards des Italiens and Montmarte, 1852.\nBarron Haussmann, the boulevards of Saint Michel, 1853-60.\nBarron Haussmann, the avenue and place de Wagram, 1860-63.\nBarron Haussmann, the boulevard Richard Lenoir, 1861-63.\n\nThe boulevard Richard Lenoir, 1861-63.\nThe construction of a barricade, 1871.\nParis burnt, after the Commune.\nPlan of Paris, 1871.\nPlan of Paris, 1871.\nVienna before redevelopment, 1844.\nLeaflet announcing the Ringstrasse development, 1860.\nRingstrasse, 1888.\nRingstrasse, 1888.\n\nRathaus, by Friedrich Schmidt, 1872-83.\nHofburgtheater by Semper and Hasenauer, 1874-88.\nUniversity by Heinrich Ferstal,1873-84.\nReichstrat by Hansen, 1874-83.\nAthena fountain before the parliament by Hansen and Kundmann, 1896-1902.\nKartner Ring.\nReichsratsstrasse.\nSchwartzenbergplatz.\nVille nouvelle and medina, Casablanca, 1926.\n\nZoning plan of Casablanca, 1917.\nWarehouses made of thin concrete arches, Casablanca,1959.\nTypical streetscape in Casablanca, 1914.\nInitial sketch of the Boulevard du IV Zouaves, by Henri Prost, 1914.\nThe Place de France, Casablanca, 1913.\nCentral post office, Casablanca, by Adrien Laforgue, 1920.\nAriel view of the Residence de France and the colonial administrative Quarter, Rabat,\n1930.\nResidence de France, by Adrien Laforgue, 1918.\nView of the Boulevard de la Gare, Casablanca, 1930.\n\nPlan of Saigon, 1878.\nThe Governer-General's palace, Saigon.\nEcole des Jeunes Filles Annamities, Saigon, 1919.\nLycee Sarraut, Hanoi, 1919.\nStandardized warehouses in Haiphong's main harbor district, 1925.\nView of the local port of Haiphong, 1925.\nWe are Building Socialism by Iurii pimenov, 1927.\nCover for SSSR na Stroike, by Alexander Rodchenko, 1933.\nLeningrad Hotel, by Andrei Boretsky, L. Polyakov, 1948.\n\nWaldorf-Astoria, Schulze and Weaver, 1931.\nGiuseppe Terragni\nGiuseppe Terragni\nGiuseppe Terragni\nGiuseppe Terragni\nGiuseppe Terragni, Veduta dall'alto della copertuna.\nGiuseppe Terragni, opera completa 1925-1943.\nDeutsche Sportshalle, 1950-51 by Richard Paulick.\nStalinalle by Egon Hartmann.\n\nPalace of Culture.\nCasa Scinteii by Horia Maicu,Nicolae Badescu, Marcel Locar, and Mircea Alifanti, 1950-\n56.\nDimitrovgrad, Tolbukhin distict.\nPoruba district of Ostrava.\nGiuseppe Terragni\nGiuseppe Terragni\nGiuseppe Terragni\nGiuseppe Terragni\n\nGiuseppe Terragni, Veduta dall'alto della copertuna.\nGiuseppe Terragni, opera completa 1925-1943.\nDeutsche Sportshalle, 1950-51 by Richard Paulick.\nStalinalle by Egon Hartmann.\nPalace of Culture.\nCasa Scinteii by Horia Maicu,Nicolae Badescu, Marcel Locar, and Mircea Alifanti, 1950-\n56.\nDimitrovgrad, Tolbukhin distict.\nPoruba district of Ostrava.\nLutyen's Government House disappears behind Baker's Secretariat blocks.\n\nLutyen's Government House from the Great Place.\nViceroy's House and the Mughal Gardens.\nViceroy's House, Delhi.\nRaisina, including the viceregal Estate, Lutyens.\nKing's Way in Delhi.\nCouncil House, Delhi, by Baker.\nCouncil House, Delhi, by Baker.\nChandigarh, Le Corbusier, 1958.\nChandigarh, Le Corbusier, 1958.\n\nChandigarh, Le Corbusier, 1958.\nChandigarh, Le Corbusier, 1958.\nDawn Palace.\nThe presidential chapel.\nPlaza of the three powers.\nPlaza of the three powers.\nNational Congress.\nPlateau Palace.\nSupreme Federal Court.\n\nMinisterial Buildings.\nMuseum.\nCathedral.\nThe routes taken by the Japanese division.\nThe imperial army heading for Zhongshanling, 1937.\nAiming for the Zhonghua gate, 1937.\nJapanese soldiers entering Nanjing through Zhongshan ate, 1937.\nQuarters in Nanjing charged by the Japanese.\n\nQuarters in Nanjing charged by the Japanese.\nQuarters in Nanjing charged by the Japanese.\nQuarters in Nanjing charged by the Japanese.\nSettlement of Ramot, near Jerusalem, 1979.\nSettlement of Ramot, near Jerusalem, 1979.\nSidon, South Lebanon, 1983.\nGaza, 1979, refugee camp.\nRobert Frank, Photograph from Dominique Edde, (foreword): Beyrouth, Centre Ville.\nRene Burri, Photograph from Dominique Edde, (foreword): Beyrouth, Centre Ville.\n\nGebriele Basilico, Photograph from Dominique Edde, (foreword): Beyrouth, Centre\nVille.\nRaymond Depardon, Photograph from Dominique Edde, (foreword): Beyrouth, Centre\nVille.\nGebriele Basilico, Photograph from Dominique Edde, (foreword): Beyrouth, Centre\nVille.\nGebriele Basilico, Photograph from Dominique Edde, (foreword): Beyrouth, Centre\nVille.\nSarajevo, Oslobodjenje newspaper building, 1992.\nIllustration from Lebbeus Woods: War and Architecture.\nIllustration from Lebbeus Woods: War and Architecture.\nIllustration from Lebbeus Woods: War and Architecture.\n\nIllustration from Lebbeus Woods: War and Architecture.\nIllustration from Lebbeus Woods: War and Architecture.\nIllustration from Lebbeus Woods: War and Architecture.\nIllustration from Lebbeus Woods: War and Architecture.\nAlbert Speer, Zeppelin Field, Nuremberg, 1934-6.\nHochbauamt Nurnberg (Brugmann), Technical Drawing of the German Stadium\nConstruction Site, Nuremberg\nLudwig and Franz Ruff, Construction of the Interior of the Congress Hall, Nuremberg, c.\n1941.\nChandigarh, Le Corbusier, 1958.\nChandigarh, Le Corbusier, 1958.\n\nChandigarh, Le Corbusier, 1958.\nChandigarh, Le Corbusier, 1958.\nChandigarh, Le Corbusier, 1958.\nChandigarh, Le Corbusier, 1958.\nNational Assembly, Dhaka, Louis Kahn, 1965-1984.\nNational Assembly, Dhaka, Louis Kahn, 1965-1984.\nNational Assembly, Dhaka, Louis Kahn, 1965-1984.\nNational Assembly, Dhaka, Louis Kahn, 1965-1984.\nBrasilia.\n\nDawn Palace."
    },
    {
      "category": "Resource",
      "title": "4_645_week_12.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-645-selected-topics-in-architecture-architecture-from-1750-to-the-present-fall-2004/5b1f72741d4032f766d361f25f5a071e_4_645_week_12.pdf",
      "content": "Week 12 - Development\nEcological Regionalism\" I.\n\"Ecological Regionalism\" II.\n\"Ecological Regionalism\" III.\n\"Ecological Regionalism\" IV.\nMumford and MacKaye's concept of urban development within the framework of natural\nfeatures of the land.\nRuseell Van Nest Black's plan for the metropolitan Philadelphia.\nMap from Jean Gottmann: Megalopolis.\nMap from Jean Gottmann: Megalopolis.\n\nAutobahn, 1937.\nAutobahn, 1930's.\nCover of Die Strasse, 1937.\nPaul Wolff, 1920's-1930's.\nWomen picknicking beside the Autobahn.\nRoadside rest station, 1940.\nKevin Miller, Icon of the sprawl.\nKevin Miller, Icon of the sprawl.\nKevin Miller, Icon of the sprawl.\n\nKevin Miller, Icon of the sprawl.\nKevin Miller, Icon of the sprawl.\nKevin Miller, Icon of the sprawl.\nLevittown, Long Island.\nLevittown, Long Island.\nFreeway to San Francisco.\nIllustration from Bill Owens: Suburbia.\nIllustration from Bill Owens: Suburbia.\nIllustration from Bill Owens: Suburbia.\n\nIllustration from Bill Owens: Suburbia.\nIllustration from Bill Owens: Suburbia.\nIllustration from Bill Owens: Suburbia.\nIllustration from Bill Owens: Suburbia.\nIllustration from Bill Owens: Suburbia.\nIllustration from Bill Owens: Suburbia.\nAdvertisement for FLIT insect repellant, 1943.\nAdvertisement for Parke, Davis & Company for imunization against tetanus, 1945.\n\n\"Fogging from helicopter into lawns and forests around hotel at Old Forge, N.Y.\" 1948.\n\"Hotel Utopia\" Life, 1946, by Bernard Hoffman.\nOriginal page from the MOWBOT brochure used by David Greene.\nAmbiance, from the Archigram Monte Carlo Project, 1970.\nDiagrams from Georges Teysett, (ed.): The American Lawn.\nDiagrams from Georges Teysett, (ed.): The American Lawn.\nLevittown, Long Island, 1995, by Ezra Stoller.\nCover of House Beautiful, 1942.\nThe first Holiday Inn, Memphis, Tennessee.\n\nIllustration from John Baeder: Gas, Food and Lodging.\nThe Windham Grill, Willimantic, Connecticut.\nIllustration from John Baeder: Gas, Food and Lodging.\nGood Luck Inn, on Roosevelt Highway, near Towanda, PA.\nTexaco station.\nIllustration from John Baeder: Gas, Food and Lodging.\nIllustration from John Baeder: Gas, Food and Lodging.\nGreyhound Bus Terminal, Fort Wayne, Indiana.\nGreyhound Bus.\n\nIllustration from John Baeder: Gas, Food and Lodging.\nIllustration from John Baeder: Gas, Food and Lodging.\nRobert Moses.\nJones Beach.\nHenry Hudson Parkway.\nHenry Hudson Parkway.\nVerrazano-Narrows Bridge.\nLandscape by Robert Moses.\nMoses' 1964-65 World's Fair and the Grand Central Parkway.\n\nMoses' housing project in Harlem.\nIllustration from Robert A. Caro: The Power Broker.\nThe Cross-Bronx Expressway.\nAlexander Hamilton Bridge.\nIllustration from Robert A. Caro: The Power Broker.\nThe grand central parkway bridge.\nThe grand central parkway bridge.\nMoses' Power Dam at Massena and Niagara.\n\nPart of St. Lawrence Power Project.\nOrchard Beach by Moses.\nJacob Riis Park by Moses.\nJones Beach by Moses.\nIllustration from Robert A. Caro: The Power Broker.\nPhiladelphia study by Kahn.\nTeam 10's manifesto for town planning. Berlin plan.\n'Urban re-identification' first diagram, P.D.S., 1952.\nZone scheme.\n\nIllustration from Alison Smithson (ed.): Team 10 Primer.\nIllustration from Alison Smithson (ed.): Team 10 Primer.\n\"Urban Reidentification\" grid presented at CIAM, 1952, A. & P. Smithson.\nSketch of the \"scales of association\" from Geddes's Valley section. A. & P. Smithson.\n1954.\nTown-planning advisory scheme for Berlin.\nBerlin project by A. & P. Smithson in collaboration with Gunter Nitschke.\nMARS group, plan for London, 1942.\nProject for the competition in the Golden Lane neighborhood in London, 1952 by A. & P.\nSmithson.\nGrid presented at CIAM 9, 1953, A. & P. Smithson.\n\nSchool designs by Herfordshire County Coucil Architects Department, 1951 and A. & P.\nSmithson, 1954.\nGrid presented at Dubrovnik, 1956, MARS group with A. & P. Smithson.\nGrid presented at Dubrovnik, 1956, MARS group with A. & P. Smithson.\n\"Lost Identity\" grid presented at CIAM , 1956 by Aldo van Eyck.\nNagele project, 1947-54, by Aldo van Eyck with the De 8 group.\nNagele project, 1947-54, by Aldo van Eyck with the De 8 group.\n\"Dijkstratt\" playground in Amsterdam, 1956 by Aldo van Eyck.\nBook cover, 1955.\n\nMichel Ecochard, development plan for Casablanca, 1951.\nService de l'Urbanisme panels for presenting at CIAM 9.\nJean Hentch, Andre Studer, \"housing type for Muslims\", 1953-55. And ATBAT-Afrique,\ntheoretic project for a housing type for Islarialites and Muslims, 1954.\nG. Candilis, S. Woods and others, folding grid, 1953.\nG. Candilis, S. Woods and others, folding grid, 1953.\nGrid presented at CIAM, 1953.\nLevitttown grid presented at CIAM, 1953.\nChildren's home, Aldo van Eyck, Amsterdam.\nChildren's home, Aldo van Eyck, Amsterdam.\n\nChildren's home, Aldo van Eyck, Amsterdam.\nChildren's home, Aldo van Eyck, Amsterdam.\nProposal for evolutional habitation by G. Candilis, A. Josic and S. Woods, in Paris.\nProposal for evolutional habitation by G. Candilis, A. Josic and S. Woods, in Paris.\nProposal for evolutional habitation by G. Candilis, A. Josic and S. Woods, in Paris.\nProposal for evolutional habitation by G. Candilis, A. Josic and S. Woods, in Paris.\nGeneral view of Matera, South Italy.\nTypical streets, Matera, South Italy.\nShops and Apartment buildings in Matera, South Italy by Giancarlo de Carlo.\n\nShops and Apartment buildings in Matera, South Italy by Giancarlo de Carlo.\nMexico, 1934.\nSteel mill construction workers in Wuhan.\n\"'volunteers' for the Ming tomgs Dam near Peking\"\n\"'Sweat equality' approach,\" from Patrick Geddes: UNCHS: The Roleof Community\nparticipation.\nQueenstown.\nUN Report, November, 1963.\nKenzo Tange, Tokyo Bay Project.\n\n\"Asian city of Tomorrow\".\n\"Asian city of Tomorrow\".\nUrban views from Rem Koolhaas and Bruce Mau: S, M, L, XL.\nSingapore.\nDome and vault construction.\nVilla at Gourna by Fathy.\nThe mosque, village hall and the Khan by Fathy.\nGourna family unit and bazar by Fathy.\n\nGujrat State Fertilizers Corporation, by Balkrishna Doshi, 1964-69.\nGujrat State Fertilizers Corporation, by Balkrishna Doshi, 1964-69.\nGandhi Labor Institute, Ahmedabad, by Balkrishna Doshi, 1980-84.\nGandhi Labor Institute, Ahmedabad, by Balkrishna Doshi, 1980-84.\nAranya Low-Cost Housing, Indore, 1983-86.\nAranya Low-Cost Housing, Indore, 1983-86.\nBelapur Housing, New Bombay, by Charles Correa 1983-86.\nBelapur Housing, New Bombay, by Charles Correa 1983-86.\nPrevi Experimental Housing, Lima, Peru by Charles Correa 1969-73.\n\nPrevi Experimental Housing, Lima, Peru by Charles Correa 1969-73.\nBus company advertisement stating stops in Transkei.\nSunday taxi to Transkei.\nImage from Mamphela Ramphele: A Bed Called Home.\nA hostel 'door.'\nImage from Mamphela Ramphele: A Bed Called Home.\nResidents in the Prebuilt Co. Hostel.\nInmates of the I & J Co. Hostel.\nMamiya in her room."
    },
    {
      "category": "Resource",
      "title": "4_645_week_13.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-645-selected-topics-in-architecture-architecture-from-1750-to-the-present-fall-2004/fd1ad2840c0d62726ffcebbd12ef5f1a_4_645_week_13.pdf",
      "content": "Week 13 - no title\nVillage Project, James Sterling, 1955.\nVillage Project, James Sterling, 1955.\nHouse studies by James Sterling, 1956\nChurchill College by James Sterling, 1958.\nSchool Assembly Hall, Camberwell, South London by James Sterling, 1958-61.\nSchool Assembly Hall, Camberwell, South London by James Sterling, 1958-61.\nLeicester University Engineering Building by James Sterling, 1959-63.\nLeicester University Engineering Building by James Sterling, 1959-63.\n\nPostal stamp for Leicester University Engineering Building by James Sterling.\nPainting by Nils Ole Lund.\nCambridge University History Faculty Building, 1964.\nCambridge University History Faculty Building, 1964.\nLeicester University Engineering Building by James Sterling, 1959-63.\nCambridge University History Faculty Building, 1964.\nResidential expansion for St. Andrews University, Scotland by James Sterling, 1964-68.\nResidential expansion for St. Andrews University, Scotland by James Sterling, 1964-68.\nResidential expansion for St. Andrews University, Scotland by James Sterling, 1964-68.\n\nResidential expansion for St. Andrews University, Scotland by James Sterling, 1964-68.\nStaatsgalerie New Building and Chamber Theater, Stuttgart by James Sterling, 1977-83.\nStaatsgalerie New Building and Chamber Theater, Stuttgart by James Sterling, 1977-83.\nStaatsgalerie New Building and Chamber Theater, Stuttgart by James Sterling, 1977-83.\nStaatsgalerie New Building and Chamber Theater, Stuttgart by James Sterling, 1977-83.\nMalcontenta and Garches. Analytical diagrams.\nGarches\nVilla Capra-Rotonda, Vicenza. Andrea Palladio, 1550-60 & Villa Savoye, Poissy, Le\nCorbusier, 1929-31.\nVilla Stein & Villa Malcotenta.\n\nVilla Stein & Villa Malcotenta.\nMaison Domino & Altes Museum.\nAltes Museum.\nPalace of the Assembly.\nHouse I, Peter Eisenman.\nHouse I, Peter Eisenman.\nHouse II, Peter Eisenman.\nHouse II, Peter Eisenman.\nHouse II, Peter Eisenman.\n\nHouse II, Peter Eisenman.\nHouse III, Peter Eisenman.\nHouse III, Peter Eisenman.\nHouse IV, Peter Eisenman.\nHouse IV, Peter Eisenman.\nHouse IV, Peter Eisenman.\nHouse IV, Peter Eisenman.\nHouse IV, Peter Eisenman.\n\nHouse IV, Peter Eisenman.\nHouse VI, Peter Eisenman.\nHouse VI, Peter Eisenman.\nHouse VI, Peter Eisenman.\nHouse VI, Peter Eisenman.\nMonument to the Resistance, Competition Design, Italy, 1962.\nMonument to the Resistance, Competition Design, Italy, 1962.\nMonument to the Resistance, Competition Design, Italy, 1962.\nMonumental Foundation, Competition Design, Italy, 1962.\n\nCentro Direzionale, Competition Design, Italy, 1962.\nCentro Direzionale, Competition Design, Italy, 1962.\nPilotta Square and Paganini Theater, Closed Competition Design, Italy, 1964.\nCity Hall Square, Segrate, Italy, 1965.\nGallaratese 2, Milan Italy, 1969-73.\nGallaratese 2, Milan Italy, 1969-73.\nCemetery of San Cataldo, Italy, 1971-84.\nCemetery of San Cataldo, Italy, 1971-84.\nCemetery of San Cataldo, Italy, 1971-84.\n\nCemetery of San Cataldo, Italy, 1971-84.\nCemetery of San Cataldo, Italy, 1971-84.\nCemetery of San Cataldo, Italy, 1971-84.\nCemetery of San Cataldo, Italy, 1971-84.\nCemetery of San Cataldo, Italy, 1971-84.\nRegional Administrative Center, Competition Design, Italy, 1974.\nStudent House, Competition Design, Italy, 1974.\nCentro Direzionale, Competition Design, Italy, 1977.\nRoma Interrotta, 1977.\n\nLittle Scientific Theater, 1978.\nSudliche Friendrichstadt, Closed Competition Design, West Germany, Berlin, 1981.\nThe Teatro against factory.\nEntrance Portal, Venice Biennale, 1980.\nTheoretical examples of kinked or deformed buildings.\nHistorical examples of kinked buildings.\nTheoretical example of dividing and breaking.\nHistorical examples of disconnected buildings.\nGeometries and Spaces.\n\nInterior and semi-enclosed spaces.\nStaircase studies.\nStaircase studies.\nStudy of square buildings.\nStudy of square buildings.\nStudy of L-shaped Ground-Plans\nStudy of U-shaped Ground-Plans and Towers.\nStudy of outside staircases.\nStudy of outside staircases.\n\nHouse Typology by Rob Krier.\nHousibg in the Tiergarten, Berlin 1980 by Rob Krier.\nUniversita di Bielefeld, 1968.\nCentro civico di Derby, 1970.\nRoyal Mint a Londra, 1974.\nCatalogue of Peter Eisenman, 1977.\nSmall public squares.\nDiagram from Christopher Alexander: A Pattern Language.\n\nDiagram from Christopher Alexander: A Pattern Language.\nDiagram from Christopher Alexander: A Pattern Language.\nPath shapes.\nIntimacy gradient in a house.\nRome, the imperial fora.\nImperial Rome, model.\nVersailles, plan.\nHodrian's villa, plan after Luigi Canina.\nLe Corbusier, Shohan House, Ahmedabad.\n\nHawksmoor, Christ Church, Spitalfields.\nMichelangelo, Rear facade, Palazzo Farnese, Rome.\nPiazza S. Marco, Venice & Times Square, New York.\nVenturi and Rauch, Pennsylvania Avenue Project.\nVenturi and Rauch, Dixwell Fire Station, New Haven.\nVenturi and Rauch, Hotel-Casinos in Atlantic City.\nFranklin Court.\nVenturi and Short, Guild House, Philadelphia.\nVanna Venturi House.\n\nHaus D'Agostino Project.\nStrandhaus fur G. L. Hersey.\nBenjamin Franklin Bridge at night.\nView of the Sainsbury Wing.\nChildren's museum, Houston 1989-92.\nExpo '92 Pavillion.\nWhitehall Ferry Terminal, New York, 1992-96.\nFire Station, The Walt Disney Company, Florida, 1992-93.\nThe Las Vegas Strip, looking southwest.\n\nMap of Las Vegas Strip.\nStudies of the Strip from Robert Venturi, Denise Scott Brown, Steven Izenour: Learning\nfrom Las Vegas.\nStudies of the Strip from Robert Venturi, Denise Scott Brown, Steven Izenour: Learning\nfrom Las Vegas.\nStudies of the Strip from Robert Venturi, Denise Scott Brown, Steven Izenour: Learning\nfrom Las Vegas.\nStudies of the Strip from Robert Venturi, Denise Scott Brown, Steven Izenour: Learning\nfrom Las Vegas.\nPage layout from Robert Venturi, Denise Scott Brown, Steven Izenour: Learning from\nLas Vegas.\nViews of Las Vegas Strip.\nPage layout from Robert Venturi, Denise Scott Brown, Steven Izenour: Learning from\nLas Vegas.\n\nPage layout from Robert Venturi, Denise Scott Brown, Steven Izenour: Learning from\nLas Vegas.\nLas Vegas tourist brochure.\nA comparative analysis of pleasure zones.\nImages from Robert Venturi, Denise Scott Brown, Steven Izenour: Learning from Las\nVegas.\nImages from Robert Venturi, Denise Scott Brown, Steven Izenour: Learning from Las\nVegas.\nImages from Robert Venturi, Denise Scott Brown, Steven Izenour: Learning from Las\nVegas.\nImages from Robert Venturi, Denise Scott Brown, Steven Izenour: Learning from Las\nVegas.\n\nImage from Robert Massin: Letter and Image.\nImage from Robert Massin: Letter and Image.\nImage from Robert Massin: Letter and Image.\nImage from Robert Massin: Letter and Image.\nImage from Robert Massin: Letter and Image.\nImage from Robert Massin: Letter and Image.\nUrban views from Peter Blake: God's Own Junkyard; The Planned Deterioration of\nAmerica's Landscape.\nViews from Peter Blake: God's Own Junkyard; The Planned Deterioration of America's\nLandscape.\nUrban views from Peter Blake: God's Own Junkyard; The Planned Deterioration of\nAmerica's Landscape.\n\nUrban views from Peter Blake: God's Own Junkyard; The Planned Deterioration of\nAmerica's Landscape.\nViews from Peter Blake: God's Own Junkyard; The Planned Deterioration of America's\nLandscape.\nUrban views from Peter Blake: God's Own Junkyard; The Planned Deterioration of\nAmerica's Landscape.\nImage from Robert Massin: Letter and Image.\nImage from Robert Massin: Letter and Image.\nImage from Robert Massin: Letter and Image.\nImage from Robert Massin: Letter and Image.\nImage from Robert Massin: Letter and Image.\n\nImage from Robert Massin: Letter and Image.\nUrban views from Peter Blake: God's Own Junkyard; The Planned Deterioration of\nAmerica's Landscape.\nViews from Peter Blake: God's Own Junkyard; The Planned Deterioration of America's\nLandscape.\nUrban views from Peter Blake: God's Own Junkyard; The Planned Deterioration of\nAmerica's Landscape.\nUrban views from Peter Blake: God's Own Junkyard; The Planned Deterioration of\nAmerica's Landscape.\nViews from Peter Blake: God's Own Junkyard; The Planned Deterioration of America's\nLandscape.\nUrban views from Peter Blake: God's Own Junkyard; The Planned Deterioration of\nAmerica's Landscape.\n\nView of a parking lot from Peter Blake: God's Own Junkyard; The Planned Deterioration\nof America's Landscape.\nViews of junkyard from Peter Blake: God's Own Junkyard; The Planned Deterioration of\nAmerica's Landscape.\nEvery building on the Sunset Strip.\nEvery building on the Sunset Strip.\nEvery building on the Sunset Strip.\n\"Strip communication images,\" 1972, series of photographs from Las Vegas study.\nNine swimming pools and a broken glass.\nReal Estate Oppurtunities.\nA few Palm trees.\n\nDutch details.\nArchitectural example from Louis I. Kahn.\nArchitectural example from Louis I. Kahn.\nSalk Institute of Biological Studies, California, Louis I. Kahn, 1959-65.\nSalk Institute of Biological Studies, California, Louis I. Kahn, 1959-65.\nKimbell Art Museum, Texas, Louis I. Kahn, 1966-72.\nKimbell Art Museum, Texas, Louis I. Kahn, 1966-72.\nLibrary, Phillips Exeter Academy, New Hampshire, Louis I. Kahn, 1967-72.\nLibrary, Phillips Exeter Academy, New Hampshire, Louis I. Kahn, 1967-72.\n\nMinoru Yamasaki, Pruitt-Igoe Housing, St. Louis, 1952-55.\nEvolutionary Tree."
    }
  ]
}