{
  "course_name": "Seminar in Ethnography and Fieldwork",
  "course_description": "No description found.",
  "topics": [
    "Humanities",
    "Philosophy",
    "Ethics",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology",
    "Ethnography",
    "Humanities",
    "Philosophy",
    "Ethics",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology",
    "Ethnography"
  ],
  "syllabus_content": "Course Meeting Times\n\n1 meeting / week, 2 hours / meeting\n\nCourse Description\n\nThis advanced course in anthropology engages closely with discussions and debates about ethnographic research, ethics, and representation.\n\nRequirements\n\nStudents are required to give two seminar presentations, in which they offer a critical evaluation of positions represented in readings for their chosen days. Written documentation of those presentations will be due the week following the presentation. A final research paper of 15-20 pages will be due on Ses #12. Prospectus for this paper due on Ses #5.\n\nGrading\n\nGrading will be based on:\n\nACTIVITIES\n\nPERCENTAGES\n\nClass participation\n\n50%\n\nFinal paper\n\n50%\n\nRequired Books\n\nPlease see the\nreadings\npage for a schedule and list of readings. Look for used or new copies online or in local bookstores.\n\nCalendar\n\nSES #\n\nTOPICS\n\nMeeting to construct syllabus\n\nEthnographic method and writing\n\nEthics and engagement\n\nAnthropological controversies: military uses of anthropology\n\nAnthropological controversies: the truth of other worlds, from Mead to Menchu\n\nNationalism and indigeneity\n\nActivist anthropology / double presentation day\n\nComparison / double presentation day\n\nMobility and/or nomadism / double presentation day\n\nGlobal environments\n\nEngineering culture\n\nClass presentations\n\nFinal paper",
  "files": [
    {
      "category": "Resource",
      "title": "Deciding Who May Choose: The construction of Personhood During Ethical Decisions in a Biomedical Context",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-112-seminar-in-ethnography-and-fieldwork-spring-2008/0e9516466b46cb1e973df0e5c87e4fb2_martini.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n\n21A.112 Seminar in Ethnography and Fieldwork\nSpring 2008\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nDeciding Who May Choose:\nThe construction of Personhood During\nEthical Decisions in a Biomedical Context\n\nLaura Martini\n21A. 112 Final Paper\nProfessor Helmreich\n15 May 2008\n\nThe concept of ethics is often discussed as if it is a universal entity that applies\nequally to all people in all situations. The very concept of ethics, however, is created and\nenforced by humans, and therefore is an entirely social construction that must be\ncontinually re-constructed and re-defined in order to apply to new situations. In this paper\nI will use the framework employed by Margaret Locke in examining role of brain death in\nthe construction of personhood (2002), and apply it to the contrasting concepts of\npersonhood drawn upon and created by families, ethics boards, biomedicine and courts as\nthey make decisions about and for individuals with disabilities in the United States. In\naddition to published sources, I will draw on personal experience as well as interviews I\nconducted with psychologist Dr. Don Brunnquell, director of the office of ethics at\nChildren's Hospitals and Clinics of Minneapolis and St. Paul (hereafter referred to as\nChildren's).\n\nI am drawn to this topic by personal experience: my older sister, Sarah, has\nundergone more than a dozen surgeries to correct a host of physical problems she suffers\ndue to a rare genetic disorder she has, called Rubinstein Taybi Syndrome. The first\nmedical decision my parents made for Sarah was to allow her to undergo lifesaving open-\nheart surgery as a baby, which coincidentally took place at Children's. Since then they\nhave faced both easy medical decisions, like whether to correct her ingrown toenails, and\ndifficult ones, such as whether to have Sarah undergo a second open-heart surgery when\nshe was nine. Among these surgeries only one, the hysterectomy she had in her mid-\nteens, has required consultation with an ethics committee. Although my parents have had\nlittle formal interaction with these committees, at every surgery and decision throughout\nmy sister's twenty-five years they have grappled with ethical dilemmas, both small and\n\nlarge, and have lived daily with the ramifications of their decisions. I personally find it\ninteresting that the hospitals did not require an ethics committee consultation before any\nof her major surgeries, after which she spent a week or more in intensive care - such as\nthe lifesaving ones to repair her heart, and later to straighten her spine from scoliosis -\ndid not require ethics committee consultations, whereas the medically minor\nhysterectomy did require consultation. Part of this discrepancy may have stemmed from\nthe fact that the hysterectomy was elective, whereas all other surgeries were done to\ncorrect a problem that was causing her pain or would have killed her. I would like to\nargue that the different ethical treatment of Sarah's surgeries is much more complex, and\nserves to illuminate the basic assumptions of personhood within the United States.\nThrough this paper I will explore the construction of this personhood within the context\nof American biomedicine.\n\nThe elemental concept of ethics influences all definitions of personhood in\nbiomedical contexts. In anthropology, ethics is considered essential to all interactions\nbetween ethnographers and their interlocutors. The American Anthropological\nAssociation's Code of Ethics \"provides a framework, not an ironclad formula, for making\ndecisions.\" An important element of this framework is obtaining \"informed\nconsent\"(Code of Ethics of the American Anthropological Association), a requirement\nthat is problematic because informed consent is difficult to quantify. Although there are\ncertainly instances where one can be assured that a person is or isn't capable of\nconsenting - be it to an anthropological interview or to surgery - there are also times\nwhen it is tricky, if not impossible, to determine one's ability to give truly informed\nconsent. It is at these boundaries that the very essence of personhood is illuminated.\n\nIt is important to note that despite its implied universality, ethics isn't ever\nsocially, politically or culturally neutral. Ethics committees must take into account the\npersonal beliefs of a person and their family, such as religion when giving guidance.\nCommittees and courts are an attempt at the secularization of morality in that they serve\nmembers of all religious and ethnic backgrounds, and all stages of life. Although ethics\ncommittees strive for neutrality in their recommendations, a critical element of their\nconsultation is their ability to balance an individual's beliefs with societal standards.\n\nIn order to grasp how ethics boards function, it is important to understand how\nthey came to be. Before there were ethics boards, there were families and doctors in\ndialogue, with only the courts to mediate points of contention or ambiguity. It is easy to\nsee how this system was problematic; drawing the legal system into in any matter is\nlengthy, expensive and involved, and moves the situation beyond the private sphere\nwhere the family has agency and into the public sphere. When Sarah was born in the\nearly 1980s, the movement for ethics boards was also in its infancy. Medical advances in\nthe second half of the 20th century meant that suddenly there were more decisions that\ncould be, and there for needed to be made. Previously, babies with severe physical\ndefects simply couldn't be saved, now there were surgeries and techniques that enabled\nthem to live (Rapp 2000: 269). My parents have recounted to me many times that the\nopen-heart surgery that saved Sara's life had only been developed during the decade\nbefore she was born. As a child, I had always thought that my family was extremely\nlucky that my sister was born during an era when doctors knew how to save her. I now\nrealize that this was a mixed blessing, as the availability of lifesaving technologies forced\nmy parents into the role of \"moral pioneers\" (ibid. 3) as they confronted life-and-death\n\ndecisions about Sarah. In an era of new medical technologies that necessitated an\nincreasing number of medical decisions for parents and families of mentally retarded\nindividuals, it became obvious that patients, their families and their doctors needed\nguidance in navigating their options.\n\nAt this point, all hospitals have ethics committees or \"some other mechanism for\nresolving ethical dilemmas\", as mandated by the Joint Commission on Accreditation of\nHealthcare Organizations (Steinberg 2007: 7). In general, the importance of ethics in\nbiomedical decisions has become much more mainstream since Sarah was born. \"Most\nAmerican medical schools teach medical ethics, and national board exams test candidates\nfor their understanding of key ethical principles. And now, interactive sites on the\nInternet provide immediate instruction and counsel for vexing ethical dilemmas\" (ibid.).\nThe ethics committee at Children's is composed of \"20 people...- 6 physicians, 3 nurses,\na social worker, 2 chaplains, 4 parent members (whose children have received services at\nChildren's), an outside clergy person, an outside ethicist, an outside lawyer, an\nadministration representative, [Dr. Brunnquell], and two emeritus members\" (Brunnquell\n2008). It is interesting to note that many of the committee members have no formal\nmedical training.\n\nThis committee, as is legally required of all ethics committees, functions as a\ndecision-affecting body, not a decision-making one. The committee at Children's\noperates under the assumption that the family is the central decision-making unit,\nmeaning that they only take on cases when their advice is sought. In these cases, the\ncommittee acts as a sounding board for doctors, patients and families who come to them\nfor advice (Brunnquell 2008). In Sarah's case, it was the gynecologist performing the\n\nsurgery who sought the counsel of the ethics board and presented Sarah's case on behalf\nof her and my parents.\n\nDiscussion of mentally retarded individuals in biomedical contexts illuminates\nmany interesting aspects of societal assumptions about personhood. One major question\nthat must be answered is whether, and to what extent, a person is capable of making\nmedical decisions for themselves. In the United States adult persons are assumed to have\nautonomy unless they are deemed unable to make decisions for themselves. This concept\nis often referred to as self-determination. \"A right of self-determination flows from the\nprinciple that persons are autonomous agents whose considered judgments deserve\nrespect. The Catholic church, for example, has generally acknowledged the right of\ncompetent patients to refuse treatment even in cases where the refusal itself is not\nethically justifiable\" (Veatch 241). Not too long ago, mentally retarded individuals were\nthought to be incapable of any level of agency, and were often locked away in\ninstitutions. The pendulum has swung in the opposite direction, meaning that courts now\nview individuals with mental retardation as deserving of autonomy when it is possible to\naccord them these rights (Simon 2002). The question then becomes where to draw the\nline in determining the extent of their competency to make informed decisions, and in\nwhich circumstances\n\nBiomedicine and law have looked to IQ in order to help answer this question.\nThis model assumes a level of agency that can be taken away only if a person's IQ is\ndeemed too low. Although this measurement, when applied to biomedical decisions, has\nthe unfortunate history of being associated with eugenic interests (Davis 2006: 8), this\nnumerical measurement is legally defensible and easy to apply uniformly. This method is\n\nproblematic, however, in that \"It does not describe the level and nature of the person's\nexperience and functioning in aspects of community life\" (Simon 2002: 147). This\ndefinition also assumes that IQ tests will accurately measure the intelligence of a\nmentally retarded person. When Sarah underwent the IQ tests needed to qualify for\ngovernment assistance, she was so distrustful of the person administering the test that she\nrefused to talk, resulting in what I can only assume to be an IQ score that underestimates\nher abilities. In some respects, my parents were fortunate that they never had to deal with\nthe ethical dilemma of whether Sarah is capable of giving her informed consent; it has\nalways been clear that, regardless of what the IQ tests might say, she does not have the\nmental ability needed to project into the future in order to understand the consequences of\nher choices, a critical element of informed consent.\n\nIt is interesting to note that even though the measurement of IQ is relatively static\nover time, the ways in which society chooses to employ and interpret this measure is not.\n\"Parental experiences of childhood impairment have been shaped, since the 1960s, by\nchanges in social attitudes and policy, including the independent living movement, ... the\nAmericans with Disabilities Act, and programs for early intervention (Public Law 99-\n457) and inclusive Education Act (IDEA)\" (Casper and Laine 2005: 183). These\nmovements embody the evolution in attitudes about mentally retarded persons throughout\nthe past century, from isolation to integration. Ethics committees must act within this\never-changing societal construction of personhood for the mentally retarded. Medical\nadvances and societal acceptance of the mentally retarded have co-evolved; as more\nmedically-treated, mentally retarded individuals have survived, they have been able to\nlead (and society has created institutions which allow them to lead) increasingly\n\nintegrated lives with the rest of society. In Sarah's case, she has lived in a group home\nsince she was nineteen. She currently attends a day program through which she has a job\nputting food in vending machines, and enjoys weekly visits with my parents. Although\nSarah is happy and, arguably, a productive member of society, when my parents were\nmaking the first big medical decision when Sarah was a baby, there was no way for them\nor doctors to know what the future would hold for her. There were no guarantees that\nnecessary programs would be in place for Sarah when she grew up, allowing her to be an\nintegrated member of society. In fact, had Sarah lived in a district without the\ninfrastructure like the group home she lives in and the day program she attends, my\nparents would have had few options other than to care for her indefinitely or place her in\nexisting care facilities like nursing homes, which are ill-equipped to deal with the needs\nof young people (Santora 2008). Doctors, families, courts and ethics committees all\noperate within a framework of unknowns. These institutions all are bound to, but\nsimultaneously help to create, the landscape in which they are making decisions.\n\nWhen patients and their family members are making medical decisions, there is a\ncertain framework of norms, past precedents, and legal standards to which they are\nconfined. This framework \"acknowledges the guardian's central role, but at the same\ntime sets limits\" (Veatch 1986:251). It is often necessary for decision-makers to justify\ntheir decisions. There are varying opinions on what justifications are acceptable, a\ncriterion that depends on who is making the decision. I will return to this discussion later.\n\nAnother factor that influences the decision-making process is the very language\nwith which this discussion takes place. Just as Rapp describes the experience of pregnant\nwomen who feel restricted by the medical vocabulary that they must use in order to\n\nconvey their wishes (2002: 5), the decision-makers for mentally retarded individuals can\nfeel limited by the very way the question is framed. I would like to employ Rapp's\nframework of distinguishing choices from decisions: choices are made from among any\nnumber of possibilities whereas decisions are made from a very limited set of options\n(2002). For example, when it comes to schooling, parents must make a decision from a\nlimited set of options: \"Parents have discretion to choose among competing school\nsystems, but they cannot go too far. In other words, they can choose military or\nexperimental or parochial schools, but they cannot choose no schooling at all\" (Veatch\n1985: 246). When my parents confronted their first ethical dilemma with Sarah, her open-\nheart surgery, my parents had to decide between lifesaving surgery and a future filled\nwith painful follow-up procedures or no surgery and certain death. Although their\ninformed consent was required in the form of a signature, my parents have emphasized\nthat they are not entirely sure they had any other options. The cardiologist and surgeon\nnever specifically discussed with them whether they wanted the surgery done - weighing\nthe ethical complexities of the option not to do it, and let Sarah die. As first-time parents,\nthey were dealing with a complex mixture of grief, anxiety, and future unknowns. The\nmomentum of the Minnesota medical environment in 1982 was to do whatever heroics\ncould be done medically. The longer-term impacts to families and the impact of the\nfamily's decision might have on the larger society weren't explored, or even mentioned.\nAt the time, the ethics committee at Children's had just been formed (Brunnquell 2008),\nindicating that my parents were truly moral pioneers. Although families of mentally\nretarded individuals are required to give their informed consent, they must give this\nconsent within a very narrow range of options.\n\nBy enacting the decision-making process, families, hospitals, review boards and\ncourts each construct their own vision of personhood. There is nothing inherent about\nsomeone that one can point to as the essential element of personhood that signifies the\ncutoff point between those who are and aren't capable of making decisions about\nthemselves. Personhood is a social construction, \"a process conferred, attenuated,\ncontested, and withheld by the collective. It does not reside in the physical or cognitive\nattributes of individuals\" (Kaufman and Morgan 2005: 321). The four decision-affecting\nbodies I am examining in this paper all have different definitions for an individual:\nfamilies see a person within the context of the needs of the parents and siblings of a\nmentally retarded person, whereas ethics boards see the individual as a patient with\nhuman rights to protect; courts focus on the person as having legal rights they must\nenforce, whereas biomedicine emphasizes a patient's biological needs. At the heart of the\nissue is the construction of what an individual is and what treatment they ought to be\naccorded. The word 'individual' is frequently used, but has been interpreted differently\nby various institutions and throughout in history.\n\nOne of the reasons that mentally retarded individuals raise difficult questions in\nAmerican biomedicine can be explained by the fact that the brain lies at the heart of a\nperson's identity (Locke 2002: 95). The brain is often synechdochic for an individual,\nand thought of as the site in which a person is internally constructed. Without a fully-\nfunctioning brain, it is impossible for one to have an \"individual interest\" (ibid. 7).\nAlthough it's impossible for mentally retarded individuals to enact many elements of\npersonhood, especially those needed for agency in a biomedical context, the universal\nconcept of human rights assures respect towards all individuals (Kopelman 1984: 19).\n\nRegardless of a person's ability to make a decision, they are guaranteed their fundamental\nrights (Jordan 1985: 100). I will now explore the reasoning behind the rights given to\nmentally retarded persons.\n\nThroughout American history, a person has been defined as an individual\ndeserving of \"inalienable\" natural and human rights (Kopelman and Moskop 1984: 21) .\nIn a medical context, this is interpreted as an entity who has a \"best interest\" which is\nsupposedly \"self evident\" to a \"rational person\". In the United States law, an individual is\nconsidered self-contained until a situation like mental retardation removes their agency\nand places it under the control of a bigger body like a family or the courts. Throughout\nhistory, the rhetoric of human needs has evolved into that of human rights. A right that is\nundoubtedly problematic in the context of persons with disabilities is that of \"lifelong\ngood health [which] is clearly included in these expectations\" (Locke 2002: 33). This\nsentiment helps to illuminate why Sarah's painful and involved lifesaving surgeries were\nnot questioned, whereas the hysterectomy that did not directly assure her of better health\nwas questioned. Within this system of rights, mentally retarded individuals are accorded\nlittle, if any, ability to make their own decisions. \"If there are rights here, they will for the\nmost part be rights to a certain kind of paternalistic protection\" (Kopelman and Moskop\n1984; 10). While the American biomedical system operates within the framework of a\nperson as an autonomous entity - though guardians of adults with mental retardation\nlegally make these decisions on behalf of the individual - it is important to note that such\nautonomy is not granted in all societies (Locke 2002). For example, in countries such as\nChina and Japan where \"the 'best interest of the patient' is not seen from the view of the\npatient, but of the healthcare team and all the family members\" (Steinberg 2007: 261).\n\nThis emphasis on communal rights has been detrimental to the disabled communities in\nthose contries, meaning that \"the disabled have had to struggle to be heard\" (Locke 2002:\n174).\n\nThe American framework of autonomous individuals deserving of rights\nnecessitates enacting the idea of individual interests and leads to the concept of informed\nconsent. \"This means receiving adequate information about the risks, having adequate\nmental capacity to process that information, and finally, not being coerced or unduly\npressured\" (Steinberg 2007:211). This concept of coercion is interesting; what may count\nas coercion in the United States (a family pressuring one of their members) may be\nexpected behavior in a different country, like Japan. In addition, \"The quality of [one's]\ninformed consent or refusal hinges on the quality of provided information as well as\n[one's] ability to assimilate this information\" (ibid.: 213). In a litigious society like ours,\ninformed consent has taken on a legal meaning (Locke 2002:173). Informed consent must\nbe enacted by filling out paperwork and giving one's legally-binding signature.\n\nThis rhetoric - of the United States being a confederacy of autonomous\nindividuals - while oft-repeated and employed, obscures the social reality of persons as\nmembers of families and society. \"In many families the emphasis on individual autonomy\nand control is culturally inappropriate. Thus, family members and community\nrepresentatives often are involved in medical decisions\" (Steinberg 2007: 257). This\nfamily membership entails certain obligations and these embedded social relationships\nfrequently affect what is considered to be a person's \"best interest\". By virtue of being a\nmember of a family, the decisions about a person will be affected, for better or worse.\n\"Some argue that being a family member, by its very nature, puts one in a coerced\n\nposition\" (ibid.: 211), and families are important for constructing the identities of their\nmembers: \"the family still remains an indispensable substrate for the ongoing\nconstruction of the identity of all its members\" (Caron 2007: 216). Although families\nhelp to create a person, it is a matter of contention as to whether it is acceptable to take\ninto account the needs of the other members of the family when deciding a person's best\ninterest. I will return to this topic later.\n\nMuch discussion about bioethics rests on the assumption that the actor is rational,\nbut this definition is problematic because there is no such thing as a set of decisions that\nwould be made the same by every rational person (Kopelman 1984: 19). \"Rational people\ndisagree all the time because they operate on the basis of different premises, knowledge,\nand values. For some doctors, a concern with patient rationality and autonomy is\nparamount. But that concern may interfere with their ability to understand and relieve the\ndesperation that underlies the request for death\" (Steinberg 2007: 248). Once one begins\nto examine the gray areas of biomedicine in which there is no simple answer to what\ncourse of treatment is best, it becomes clear that the framework in which Americans\noperate is not so self-evident. The debate surrounding medical treatment for mentally\nretarded persons illuminates how this framework undergirds the American biomedical\nsystem, but does little to resolve the questions that this system inevitably raises. On some\nlevel, \"best interest\" can be interpreted as what is best for society; people are supposed to\ncontrol themselves without outside intervention. This expectation is generally assumed,\nand is only made explicit when an individual is deemed not capable of making decisions\nfor themselves. The fact that there is no such thing as objective rationality means that\n\nhumans must construct a system to make decisions for those who cannot make them\nthemselves.\n\nIdeally a person is able to comprehend a medical situation and act on their own\nbest interest in order to make medical decisions. In lieu of that, another body must step in\nand make decisions on their behalf. Despite the differences in the way they define\npersonhood, all four bodies are in agreement that the family should be the first to make\ndecisions when a person is deemed incapable. Each institution fills a role, and none of\nthem would be sufficient in every situation. \"Each is inadequate because the very nature\nof the institutions themselves renders them unable to reach a decision which is essentially\nmoral and each of these institutions is, by its nature, public, objective, and scientific or\ndemocratic\" (Jordan 1985: 106).\n\nIn the United States the nuclear unit, consisting of parents and siblings, is the\nmost often used definition of family. Families are considered the base unit for decision-\nmaking, even when ethics boards and courts get involved; while a family's decision may\nbe questioned, their right to make the decision rarely is (Veatch 1985: 248). Although\ncourts may eventually overrule a family's wishes, the prevailing mindset is that families\nare entitled to act on behalf of a mentally retarded individual. Brunnquell explains that at\nChildren's \"The ethics consultation is not the actual decision-maker- that role remains\nwith the parents with the input from the health care team; the ethics committee can advise\nbut not command\" (2008). This mindset is universal. The role of ethics committees in\nthe United States is to provide a support system and aid parents and hospital staff as they\nare facing difficult medical decisions (Greer 2004, Steinberg 2004, Laura and Ashman\n1985). An important element of this consultation process is to apply some level of\n\nuniformity to how everyone involved interprets the situation - \"to help families and staff\nmembers understand the information in the same way\" (Greer 2004). Because ethics\ncommittees must encompass a wide range of beliefs and take into account the cultural,\nreligious and historical beliefs of a patient and their family, their construction of\npersonhood is the most situational of the institutions I am examining in this paper.\n\nThere is a certain set of choices that families are allowed, as well as a limited set\nof reasons on which they are allowed to base these decisions; where a patient would have\ngotten to choose from the entire alphabet, other decision makers only have the options of\nA, B or C. There is some disagreement between those who feel that a family's needs\nshould be taken into account, and those who believe that it is only right to consider the\nchild's interests. Although families are allowed to make decisions when their members\ncannot, they are not given the same set of choices as those individuals would have been\nallowed if making the decision themselves. Veatch contends that \"While the individual\nautonomy of the competent patient is unlimited in medical choices, familial autonomy\ncannot be\" (1985: 246). As I mentioned previously, when my parents consented to the\nfirst of many lifesaving surgeries for Sarah, they were more restricted in their options\nthan Sarah would likely have been were she to have been capable of giving the consent\nherself. While Sarah could have refused the surgery, my parents are not entirely sure that\nthey would have been allowed that option.\n\nOthers take a more nuanced approach than Veatch with regard to the treatment of\npersons with mental retardation. Where Veatch thinks that taking the needs of others into\naccount is morally reprehensible in all but the rarest of circumstances, others advocate for\na balance. One example of this reasoning is as follows:\n\n\"the final reality of decision-making is tied to a complex balancing test of\nweighing economic costs of nonmaintenance against the social benefits of\nmaintenance. Stated another way, decisions of this scope and dimension\nare reached by balancing the gravity of the economic harm that will accrue\nin a particular case of maintenance against the utility for the social good\nthat will occur for non maintenance\" (Laura and Ashman 1985: 130).\nI think that this framework is overly simplistic; I merely offer it to contrast with Veatch's\napproach. Laura and Ashman also offer another framework for decision-making, that\ngiving by vitalists. Their position is that \"such decisions should be made on medical\ngrounds alone, that 'quality of life' considerations are irrelevant. This position is called\n'vitalism'. By contrast, anti-vitalists think that life need not be prolonged when\nprolonging it is not in the infant's best interest, although they may differ widely on what\nthat is\" (1985: 102). This framework is closer to that laid out by Veatch, in that it only\ntakes the patient's rights into account. However, this latter construction does allow for the\nfact that a person's best interest may be affected by those around him or her. There is a\ndissonance between the actuality of the importance of a family in constructing a person's\nidentity and self-interest, and the philosophical discussion of a family's proper role.\n\nIt is interesting to think that one might be able to de-couple an individual's rights\nfrom a family's rights in this manner. Does it make sense to assess a person within a\nvacuum, when their very identity is formed by their surroundings? If morality is\ndependent on what societal groups the individual belongs to (Jordan 1985: 56) then why\nis it not relevant to take the needs of others into consideration? If the child will end up\ncausing a divorce or financial hardship for a family and thus cause harm to their siblings\n\nand parents, why is that not a legitimate factor to consider? Why is it that logically\nirrational choices, such as refusing blood transfusions based on religious beliefs, are\nallowed, but arguably rational decisions - such as refusing lifesaving treatment because a\nchild would lead a life filled with expensive but life-saving (not to mention painful)\nsurgery - are not allowed? This limited set of acceptable reasons is not universal. For\nexample, in China, decisions like whether to remove life support can be based on\neconomic rather than ethical considerations (Steinberg 2007: 260).\n\nIn contrast to family, where all decisions will inherently be made within the\nframework within an individualized set of beliefs, the state's role is that of impartiality;\nthey are charged with implementing a secular morality. The courts are \"unbiased arbiters\nwhose impartial deliberations issue in decisions which most closely approximate justice\"\n(Jordan 1985: x). In some respect, the courts have the final say in the decision-making\nprocess, by virtue of being able to appoint a legal guardian for any person deemed\nincapable of making decisions for themselves. In actuality, this power is only enacted in\nthe rare situations where doctors, hospitals and families escalate particularly difficult\ndecisions to that level.\n\nAlthough the courts strive to be impartial, in truth they are subject to their own\nbiases. These biases change over time, which is good; since the courts are socially\nconstructed to begin with: it would be a terrible thing if they didn't evolve over time\nalong with the societal norms they are enforcing. As society recognizes the importance of\nrights for mentally retarded individuals, institutions like courts need to be reshaped in\norder to \"accord them their rights\" (Kopelman and Moskop 1984: 57). It is very rare that\ncourts need to become involved in cases pertaining to medical decisions for mentally\n\nretarded individuals, but they do have the ability to intervene. \"Under the doctrine of\nparens patriae, the state has a right, indeed, a duty to protect children... [but] it has a\nserious burden of justification before abridging parental autonomy by substituting its\njudgment for that of the parents\" (Veatch 1985: 248). If no family opinion is available, a\ncourt may be called in to act on a patient's behalf (Steinbberg 2007: 197). The court's\nrole is mainly that of defining norms: the courts are involved in only a small fraction of\nmedical decisions for mentally retarded persons, but those cases which they do hear\nbecome the basis for decisions made within families. Court decisions provide a way to\nformalize societal beliefs.\n\nThe final institution that I would like to discuss is the doctors themselves.\nThrough their lens, a mentally retarded person is first and foremost a patient. Doctors are\ntrained to provide medical counsel, but the related ethical counsel has been delegated to\nethics committees. Doctors are caregivers, not moral decision-makers (Jordan 1985: 87);\nin lieu of having a patient's family make decisions, they will often defer to another body\nwithin the hospital, or appeal to the courts in order to have a legal guardian instated\n(Steiberg 2007: 210). The modus operandi in the past has been to save whomever\ntechnology could allow to live. There's some evidence that this is changing, and that\nhospitals are understanding that its their duty to let some patients die. Brunnquell\nexplains that there are some decisions when the committee advocates for cessation of\n\"aggressive life sustaining treatment for [a] child that is very invasive and painful\"\n(2008).\n\nThese definitions of personhood organize and anchor the way in which families\nand individuals ultimately make biomedical decisions. Each institution fills a role, and\nnone of them would be sufficient in every situation. Every line of thought brings new\nideas to the discussion, and helps to develop the constantly evolving concept of\npersonhood. The concept of self-determination for individuals with mental retardation is\nin flux; in the past half century it has gone from a far too few rights to perhaps too many:\nSimon feels that mentally retarded individuals like her sister are given the opportunity for\nagency that is beyond the scope of their capability, which ultimately ends up conflicting\nwith their best interest (2002: 180). She explains that \"We are in an age of new rules, and\nno one quite knows how to use them\" (284). The rules, power relationships and societal\nnorms Simon invokes are formalized in the institutions I have discussed in this paper.\nIn these institutions, one must draw the line between two distinct categories (e.g. able to\ngive consent or not able to give consent) even if those lines don't naturally exit. By\nlooking at who is drawing the line, and how they are drawing it, one can define the notion\nof personhood that these institutions are constructing.\n\nWORKS CONSULTED\nCaron, Andre and Letizia Caronia. Moving Cultures: Mobile Communication in\nEveryday Life. McGill-Queen's University Press: 2007.\n\nCasper, Monica J. and Laine, Heather Talley, eds. 2005. Special Issue: Ethnography and\nDisability Studies. Journal of Contemporary Ethnography 34(2), selections.\n\nCode of Ethics of the American Anthropological Association. June 1998.\n\nDavis, Lenard J. The Disability Studies Reader, Second Edition. Routledge: New York,\n2006.\n\nGreer, Mark. \"The Bioethics Niche\". Monitor on Psychology: Volume 35, No. 10\nNovember 2004.\n\nJordan, Shannon M. Decision Making for Incompetent Persons: The Law and Morality of\nWho Shall Decide. Charles C. Thomas: Springfield, Illinois, 1985.\n\nKopelman, Loretta and Moskop, John C. Philosophy and Medicine 15: Ethics and Mental\nRetardation. D. Reidel Publishing Company: Dordrecht, Holland, 1984.\n\nLaura, Ronald S. and Ashman, Adrian F. Moral issues in mental retardation. Croom\nHelm: Dover, NH: 1985.\n\nLock, Margaret. Twice Dead: Organ Transplants and the Reinvention of Death.\nUniversity of California Press. 2002.\n\nRapp, Rayna. Testing Women, Testing the Fetus: The Social Impact of Amniocentesis in\nAmerica. Routledge: New York, 1999.\n\nLaura, Ronald S. and Ashman, Adrian F. Moral issues in mental retardation. Croom\nHelm: Dover, NH: 1985.\n\nKaufman, Sharon R. and Morgan, Lynn M.. Anthropology of the Beginnings and Ends of\nLife. Annual Review of Anthropology. 2005. 34:317-41.\n\nMoskop, John C. and Kopelman, Loretta. Ethics and Critical Care Medicine. D. Reidel\nPublishing Company: Boston, 1985.\n\nSantora, Marc. \"For the Disabled, Age 18 Brings Difficult Choices\". New York Times.\n14 May 2008.\n\nSilvers, Anita; Waserman, David and Mahowald, Mary B. Disability, Difference,\nDiscrimination: Perspectives on Justic in Bioethics and Pubic Policy. Rowman &\nLittlefield Publishers, Inc.: New York, 1998.\n\nSimon, Rachel. Riding the Bus with my Sister. Houghton Mifflin Company: Boston,\n2002.\n\nSteinberg, David, M.D. Biomedical Ethics: A Multidisciplinary Approach to Moral\nIssues in Medicine and Biology. University Press of England: Hanover and London,\n2007.\n\nVeatch, Robert. \"Chapter 11: Persons with Severe Mental Retardation and the Limits of\nGuardian Decision-making\". Dokecki, PR and Zaner, RM. Ethics of Dealing with\nPersons with Severe Handicaps Toward a Research . Paul H Brookes Publishing Co.,\n1986."
    },
    {
      "category": "Resource",
      "title": "Preserving and Forgetting: How the Indigenous Mexican Minorities Translate to United States' Minority Politics, Discourse, and Education of Language",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-112-seminar-in-ethnography-and-fieldwork-spring-2008/7022433c92da3472f078ea585b992693_pmaceves.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n21A.112 Seminar in Ethnography and Fieldwork\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms .\n\nPreserving and Forgetting:\nHow the Indigenous Mexican Minorities Translate to\nUnited States' Minority Politics, Discourse, and Education of Language\nPatricia Martinez\n21A.112 ---May 21, 2008\n\nPatricia Martinez\n21A.112 -- May 21, 2008\nIn the United States, immigration is a big issue, especially\nimmigration from Mexico. What to do with the immigrants (and their\nchildren) already in the United States is, arguably, an even bigger issue.\nIt is plastered all over the news: should they go to public schools? should\nthey be allowed to work legally? should they get healthcare? Should they\nbe eligible for drivers' licenses? should they be able to find resources in\ntheir native language? should immigrants be sent back? As members of\nAmerican communities, we get barraged with these debates every day.\nOne of the more evident problems with many of these debates is\ntheir tendency to refer to immigrants as if they weren't here, or didn't\nhave a say, or were things---to infantilize or dehumanize them. One of\nthe, by its very nature, less obvious problem is the tendency to treat\nimmigrants as being of a set type: they are illegal or legal, first generation\nor second, Mexican or Puerto Rican.\nIn Mexico the situation is little better: Maybe the issues were a\nlittle less publicized, less debated, but the history of symbolic violence\nand ethnic resistance (Hernandez Castillo 2001: 46-47), with various\ninfantilizing and dehumanizing policies (2001: 46-74) and eventually a\nwar (xiv) speaks volumes about the problems that Mexico has in dealing\ncivilly with its minorities.\nFrom these two cases, it seems that being a minority involves\nmarginalization and power struggles no matter where you are. But what\n\nPatricia Martinez\n21A.112 -- May 21, 2008\nabout those immigrants that are minorities in the country they're coming\nfrom? Surely, if Mexico has such marked minority classes, that structure\nand social hierarchy would migrate with the people to the United States?\nThis paper attempts to analyze the experience of Mexican cultural\nminorities that have migrated to the United States, specifically those in\nthe Latino neighborhoods of the San Francisco Bay Area, and how the\ndiscourse, social structure, and lived experience in Mexico affects and\nblends with the new discourse, social structure, and experience in the\nSan Francisco Bay Area (SFBA).\nI.\nParallels and Leaps of Logic: Extrapolating from other Contexts\nFirst, to establish context, I looked at similar dynamics of class\nand ethnicity. Two of these, of course, are the experience of Spanish-\nspeaking Mexican immigrants in the United States, and the experience of\nnon-Spanish-speaking indigenous peoples in Mexico. These two\nscenarios are not as different as they would seem at first: in both, a\nminority, lower class and from a poorer country, is expected to assimilate\nand work for meager amounts of money and small amounts of respect\n(Hernandez-Castillo 2001; Keiser 2000). In both, national politics greatly\naffect what minorities are `supposed' to be, what language(s) they are\nexpected to speak, how they are going to be educated, and what rights\n\nPatricia Martinez\n21A.112 -- May 21, 2008\nthey have (Hernandez-Castillo 2001; Adamson 2005). Recently, after a\nfew generations of people believing that it was good to adapt to the\nlanguage of the majority, several movements have been put in place so\nthat future generations can learn the language of their parents and\ngrandparents, and not \"lose their roots\" (Hernandez-Castillo 2001:131;\nAdamson 2005; Snow 1990). Parents and community leaders fall on\nboth sides of the debate: should children be bilingual and speak our\nnative language, or should they acculturate to where they are now, and\nlearn the language of the country they live in?\nA third similar context is the case of the Yucatec Maya\ncommunities in Cayo, Belize (Colas 2007). This might seem like it would\nhave less similarities than the first two synechdochic scenarios, but is\nactually a lot more similar: Yucatec Maya emigrated out of Mexico after\nindigenous rebellion, settling in an English-speaking country with\nSpanish-speaking minorities (and surrounded by Spanish-speaking\ncountries). These Maya communities thus settled into a tri-lingual\nsetting, code switching from the English spoken by the majority, the\nSpanish spoken by minorities from the surrounding Latin-American\ncountries, and the local Yucatec spoken at home (Colas 2007). Though\npeople did not want to talk about their history, they continued to use\nYucatec as a form of cultural resistance against the forces of\nglobalization and Belizean nationalism (Colas 2007). However, when the\n\nPatricia Martinez\n21A.112 -- May 21, 2008\ncommunities split into separate churches, they stopped speaking\nYucatec to each other, and spoke only Spanish with Yucatec Maya of\nother communities. Thus, the people born within 1985 and 1995 were\nnot taught Yucatec, or stopped learning Yucatec at an early age, because\nSpanish fulfilled the role that Yucatec had in separating their identity\nfrom the nationalistic, Belizean one. This weakened sense of ethnic\nidentity allowed them to receive outside influence to a higher degree,\nwhich led to further loss of ethnic memory and folk practices. In short:\nin this rather precarious trilingual system, only two languages could be\nsustained, and when learning Spanish became more practical than\nlearning Yucatec, the rates of spoken Yucatec went way down.\nIt seems that the initial situation in Cayo was similar to the initial\nsituation of indigenous Mexican people in the United States. The\nquestion is: what happens then? Is there a pattern of replacing their\nnative language with Spanish? A pattern of acclimating completely to\nEnglish-speaking? A successful trilingual community?\nII.\nLiterature on Mexican Indigenous Minorities\nJohn U. Ugbu (1991) speaks of two types of minority frameworks:\nthe immigrant framework and the `involuntary minority' framework.\nWhile the immigrant framework involves being \"motivated by the hope of\n\nPatricia Martinez\n21A.112 -- May 21, 2008\neconomic success or political freedom\" (1991:23), the involuntary\nminorities \"conclude that they are worse off then [sic] they ought to be\nbecause of the way they are treated by the dominant group\" (1991:23). It\nseems to me that indigenous Mexican immigrants show traits of both:\nthey were involuntary minorities in Mexico, but traveled to the United\nStates as immigrants. Thus, given a community of Mexican immigrants,\nthey would be exposed to some discourses and social class markers of\nMexico (where they were an involuntary minority) and some discourses\nand social class markers of the United States (where they are willing\nimmigrants). Furthermore, \"internal differentiation within the\ncommunity's Mexican-descent population reflects differences between\nimmigrants and nonimmigrants in terms of both social and structural\ncontexts in which they operate, as well as social class differences...\"\n(Matute-Bianchi 1991:213), leading to very complex nets of American\nand Mexican parallel (but often contradictory) discourses of class, race1,\nsocial status, and economic status.\nWhen speaking strictly of the recent Mexican immigrant in the\nschool system (or the children of such an immigrant), Matute-Bianchi\nfound that recent immigrant students \"make distinctions among\nthemselves, using the class-based reference framework of Mexico (e.g.,\n1 In Mexico, the main racial markers, left over from colonial days, are between Ladino (Spanish-descent),\nMestizo (mixed Spanish and indigenous descent), Indio (indigenous), Mulato (mixed Spanish and African\ndescent), and Zambo (mixed African and indigenous descent), with ladinos on top and zambos at the very\nbottom. The most common categories are ladino, meztizo, and indio, and so the indio is usually at the\nbottom of the social ladder.\n\nPatricia Martinez\n21A.112 -- May 21, 2008\nrural versus urban, upper class versus working class, mestizo versus\nindio)\" (1991:216). She also found, however, that among students this\nchanged after about five years or so. Thus, the status markers of Mexico\ndiminished in importance over time, as new markers were acquired and\nnew skills (and discourses) were learned. A more lasting correlation was\nthat of language, since \"among these recent immigrants, those who are\nrelatively proficient in Spanish (both oral and written) tend to be more\nacademically successful than those who are functioning well below grade\nlevel in Spanish\" (Matute-Bianchi 1991:216). Indigenous Mexican\nimmigrants, then, are at a disadvantage, since their primary language is\nnot Spanish and they may speak it poorly or with an accent, and\nsometimes not write it at all (Hernandez-Castillo 2001). Matute-Bianchi\nfurther argues that \"educational intervention programs and policies\naimed at improving academic achievement among Mexican-descent\nstudents assume a cultural homogeneity that does not exist and typically\nfocuses on single-cause assessments and solutions to perceived\nproblems\" (1991:242), thus not only missing to help the indigenous\nMexican students, but failing to notice that those are the students that\nthe educational intervention programs are missing---an issue that\naggravates the problem.\nIII.\nFieldwork and Data: From the Words of a Teacher\n\nPatricia Martinez\n21A.112 -- May 21, 2008\nHaving not found very much specific information when I turned to\nthe literature, I next turned to doing fieldwork firsthand. I interviewed\nMartina Martinez, a bilingual teacher of the San Francisco Bay Area.\nBesides having worked with students and parents who spoke only\nSpanish, she had also worked with students who spoke neither Spanish\nnor English, as well as parents who spoke Spanish and their native\ntongue, but whose kids spoke neither Spanish nor English.\nAs a teacher of several bilingual programs, she spoke of how\nparents influence what the kids learn. Some parents, fearing\ndiscrimination, don't want their kids to learn their native language.\nOthers don't want their child to learn their native language because they\nfeel that their native language connotes lower class status, and they are\n(or want to be) moving up in the world. Still others don't want their child\nto learn their native language because of the (she believes, mistaken) idea\nthat children will become traumatized and confused if asked to learn (or\nknow) more than one language at a time. These last are parents who are\nafraid that if their children do not learn English, they will not be able to\nmake a life for themselves in the United States.\nMartina's opinion on all of these views, from what she has seen of\nthe students, is that the most traumatized students are those with the\n\nPatricia Martinez\n21A.112 -- May 21, 2008\nmost severe restrictions on who they can or can't socialize with, or what\nlanguages they can or can't speak in. Martina talks about how some\nkids, afraid to speak in the only language they feel comfortable with, will\nbecome too afraid to speak, even to ask for help finding the bathroom,\nmuch less asking for help in the classroom. Others will become afraid of\nlanguage in general, and will refuse to learn English, not speaking at all.\nMartina relates how such kids are often put in the same classes as the\n`mentally challenged' or retarded students, rather than in the typical ESL\n(English as a Second Language) programs, because ESL only supports 4\n8 common foreign languages, depending on the school. As a teacher's\naide, she had to teach some of these students that spoke neither English\nnor Spanish by holding up flashcards of animals and simple pictures\nthat she hoped would be shared concepts across cultural boundaries.\nFurthermore, such kids were eventually integrated back into the main\ncurriculum, despite the parents' objections.\nFrom grades kindergarten to third grade, parents have a very large\npart in whether or not their children learn their native language, and\nwhether their children also learn Spanish. From third grade to fifth\ngrade, children often develop an opinion of their own, often based on\ndiscourse they picked up from their parents, but not always coming to the\nsame conclusions. In middle school, the immigrant parents cannot\neffectively control who their children will choose to socialize with, and so\n\nPatricia Martinez\n21A.112 -- May 21, 2008\nthe child may pick up Spanish or lose his or her native language, often\ndepending on his peers. In high school, the children often will choose to\nenroll themselves in Spanish classes if this has been prohibited from\nlearning it or make an effort to keep parents from showing up to\nmeetings if they have been raised to only speak English and their parents\ncannot speak it or cannot speak it well (sometimes the child will do\nboth).\nMartina's opinion, from what she has seen of the parents, is that\nparents can be categorized into two groups, based on their lived\nexperience: those that left never intending to go back (often because of\nheavy persecution) and want to forget and not reproduce anything\nrelating to their past, and those parents who immigrated to improve their\nlife but have family and rots back home, and so want to reproduce, if not\nlanguage, at least the ideas of their home village or community.\nFurthermore, Martina has been trying to work with the local\nMexican consulate to introduce books and material in various indigenous\nlanguages both into the bilingual classroom and into the homes of\nindigenous parents. However, her experience was that indigenous\nMexican parents would accept her help as a community leader, but not\nas a teacher, and would stop returning her calls, if she mentioned that\nshe had books from the Mexican consulate. All this suggests that there\nmight still be some animosity towards the Mexican government and\n\nPatricia Martinez\n21A.112 -- May 21, 2008\nparticularly its use of teachers to acculturate and assimilate indigenous\npeoples.\nIV.\nReformulating Questions and Analyzing Data\nMartina's experiences meeting indigenous Mexican parents (of her\nstudents) at la pulga (Mexican flea market) reinforces the idea that \"On\nthe one hand, there are observable differences between the various\ngroups in terms of behavior (dress, language, self-presentation, etc.) and\nattitudes; on the other hand, there is a sense of collective peoplehood as\nmembers of a generic Mexican 'family' \" (Matute-Bianchi 1991:214).\nWhile I would not go as far as to use the word `family' as Matute Bianchi\ndid, I believe that in many ways the class dynamic of Mexico, translated\nto the United States, is in some ways `safer' than looking beyond the\nMexican community microcosm at the complete integrated community, of\nwhich the Mexican subculture is such a tiny part. Martina's opinion on\nthis same matter was that not only was it `safer', but also that it was\nmore familiar, being similar to markets in Mexico and therefore also a\ngood place for people who speak the same language to meet each other.\nAmong other things, she noticed various people would come up to her\nand tentatively speak this language or that2, seemingly hoping to get a\n2 When asked, she could not tell me what those languages had been, only that they had been neither English\nnor Spanish, and had been spoken by people sporting traditional indio dress.\n\nPatricia Martinez\n21A.112 -- May 21, 2008\nresponse in the same language. This last interpretation seems to evoke a\nmuch larger sense of agency, as well as a sense not only to socialize with\nother Mexican immigrants, but specifically other Mexican immigrants\nwho share their culture.\nHowever, Martina's stories of the indigenous children do not tell\nsuch a sociable tale: she claims that parents' intentions for their children\nto not socialize with those children who speak Spanish leads them to fail\nto socialize at all, since (especially at smaller or better integrated schools)\nthe odds of finding other children who speak their same native language\nis unlikely, and often it is the Spanish-speaking children who will have\nmore cultural markers in common, or who will be more accepting of a\npeer who speaks an indigenous language3. Matute Bianchi claims that\n\"differences in parental aspirations for their children, as well as family\nideology about preparing for the future and one's place in it, appear to be\nsignificant in the messages that are communicated...to successful\nimmigrant Mexicano students\" (Matute-Bianchi 1991:235). This seems\nparallel to Martina's point that a parent will aspire to preserve or forget\ntheir parent culture depending on the circumstances of their emigration,\nand will proceed to socially reproduce their cultural background or not\ndo so, accordingly.\n3 She claims that this is actually more traumatic to children than other things a parent might do, since at that\nage (preschool) neither the child nor his peers are likely to understand or care about the racist discourses\nheld by the parents, and that, in fact, socializing might be very beneficial for all of the children.\n\nPatricia Martinez\n21A.112 -- May 21, 2008\nMatute-Bianchi further argues, as Martina Martinez did, that\nparents' opinions of how their children should be educated is of\n``critical importance'' (1991:235). Matute-Bianchi further recognizes a\n\"need to collect much more extensive data in this domain,\" (1991:235),\nwhich I believe is a problem which has not been addressed in the 17\nyears since Matute-Bianchi's article was written. It seems that rather\nthan study the adults and children in completely different contexts, it\nmight actually be beneficial to study the indigenous Mexican\nimmigrants as family units (or even extended family groups!) in order to\nunderstand what factors are actually affecting children's success in\nschool. While I am not able to look into this issue further, I believe that\nmuch more research is necessary in this area.\nV.\nA Dose of Reflexivity\nOne of the main problems with the firsthand field research I was\nattempting to do was one of access. The research, as intended was going\nto be three interviews: one with a teacher who has interacted with\nparents and children of indigenous Mexican descent, one with an\nindigenous Mexican parent, and one with someone at the Mexican\nconsulate (preferably de Education branch) at San Francisco.\n\nPatricia Martinez\n21A.112 -- May 21, 2008\nEven with this intended research, there was one very big problem:\nI am on the other side of the country, and so all of my contact (and\norganization for contact) was going to be by phone. Why is this a\nproblem? It seems that not only is the social dynamic complex and\ninteresting, but there is a great deal of mistrust from all parties involved\n--an in-person, informal interview might have been a much more effective\nand informative one. Furthermore, Martina remarked varies times about\nthe interesting code-switching that occurred at la pulga (the local\nMexican flea market), and being able to take time to observe such\ninteractions would also have helped me understand the social dynamics.\nWhich people spoke Spanish to each other? Which people spoke English\nto each other? Which people spoke to each other in their native\nlanguage? How were these people dressed (did they wear traditional\ndress when they went)? Observational fieldwork at the school (when the\nchildren are picked up and taken home---the main time when mothers\ntalk to each other at school) might also have been helpful, even if\nobserving the classroom were out of the question. Furthermore, such\nobservational fieldwork could have helped me meet parents, and thus\nfind a parent willing to trust me enough to talk to me.\nThat leads to the second major issue: one of trust. Of the three\nphone interviews I attempted, only one was completed: the one with a\nteacher (Martina Martinez, my mother, see Appendix A). The San\n\nPatricia Martinez\n21A.112 -- May 21, 2008\nFrancisco Mexican Consulate, even though it answered my phone calls in\ncourteously, refused to answer my questions, for a variety of reasons (see\nAppendix B). I would introduce myself, and that was fine, but as soon as\nI got to \"I'd like to ask you some questions...\" I was almost immediately\ninterrupted and referred to someone else who would \"know how to\nanswer my questions better\" or whose opinion was \"more relevant.\" As I\nalluded to previously, my attempts to get in contact with a parent failed\nwithout my even getting to contact any of them. In retrospect, part of the\nreason why this occurred was that I supposed that Martina would be\nable to get me in contact with some of these parents. However, she could\nnot give me their name or information without their agreement to such a\ndisclosure. Given their distrust of her and her role as `teacher', she was\nhaving communication trouble already---no one she asked was willing to\ntalk to me.\nMy attempts at gathering information firsthand, then, were not met\nwith much success. Had I not been so far away, I would have resorted to\nparticipant observation, going to places and events where some of the\ninteractions I was interested in might be taking place---and potentially\nmeeting people who would subsequently become interlocutors, or at least\nbe willing to talk to me for a few minutes.\nWhile I had originally meant to study the use of language\ncomparatively, with the study of trilingual indigenous Mexican minority\n\nPatricia Martinez\n21A.112 -- May 21, 2008\nimmigrants (which I hoped to find in he literature) as a backdrop for\nfieldwork on the different choices on the part of the parents of what to\nteach or not teach their children, I eventually found that this subject was\nmuch to specific: there were no studies I could find on trilingual\nindigenous Mexican minority immigrants in America. Finding such a\ngap, I resolved to see what I could find out firsthand on the topic.\nHowever, what I found was much an area much too broad, complex, and\nfraught with political animosity for the scope of this paper or the means\nand time available to me.\nVI.\nApplications and Ethical Concerns\nOne of the biggest questions I had while conducting my research--\nboth of the literature and firsthand---was `Why have these questions not\nbeen brought up before? It seems that there is a real gap in the\nliterature: there is an amazingly large quantity of books and articles on\nHispanic or Latino or Chicano or recent Mexican immigrant culture,\neducation, and language use---but none at all that I could find on\nMexican minorities coming to the United States, and their use of their\nnative languages here. It seems that part of the reason might be\npolitical: the United States needs to think of Mexican immigrants as one\nor two (legal vs. illegal) categories in order to build policy around the,,\n\nPatricia Martinez\n21A.112 -- May 21, 2008\nand Mexico is trying to unify, thus choosing to portray---and impose---a\nnational, `Mexican' identity (Hernandez-Castillo 2001).\nBut pinning it all down to political reasons robs the indigenous\nMexican minority immigrants of agency and social self-determination.\nAfter all, these are people who chose to immigrate, who choose from day\nto day who to talk to, what to say, how to say it, and what language to\nsay it in. They are people who choose how to teach their children and\nwhat to teach them, and people who choose how to dress themselves and\ntheir children, and what cultural capital to flaunt or hide.\nIt seems that, just perhaps, hiding their indigenous Mexican identity is\nintentional, an attempt at bridging the class gap between themselves and\nother Mexican immigrants. If Matute-Bianchi is right, and \"the bonding\nagent in this community among the Mexican-descent people is their\nsense of sharing a common stigma as a low-status subordinate minority\ngroup,\" (1991), then it would behoove the indigenous Mexican immigrant\nto not perform their indigenous identity when seeking help from the\nMexican or Latino communities.\nHowever, according to Martina, at least some of these indigenous\npeople are also forming groups of parents with their native language in\ncommon, and otherwise choosing to not teach their children Spanish, but\nrather their own native languages. It seems, then, that socially\nreproductive work may be being done by these families to preserve their\n\nPatricia Martinez\n21A.112 -- May 21, 2008\nlanguage and way of life, but by markedly non-official means. What does\nthis mean, exactly? For one thing, that the parents are not in\ncommunication with the consulate or the educational system---both of\nwhich seem to think that they know what's best for the indigenous\nMexican peoples in the United States.\nOne question that should be brought up at this point: should\nsomething be done about this failure in communication? Rigoberta\nMenchu said \"they have always said `poor indios that can't speak for\nthemselves: then many others speak for them'; that's why I decided to\nlearn Spanish\" (Burgos 1985:183). So should anthropologists be\nfacilitating the intervention of the educators and the Mexican government\nin the lives of these indigenous Mexican immigrants? What if they don't\nwant anything to do with Mexico anymore? What if education would be\ngood for them?\nIt seems to me that while further study into the matter might shed\nlight on the situation, it should not be done with the intention to\nfacilitate intervention by either the United States or Mexico---it shouldn't\nbe done with any sort of agenda in mind, for that matter. While it seems\nthat the relocation of these people to the United States has softened their\nrelations with those peoples of Mexican descent, it has not completely\nreplaced the old hurts from years of mistreatment in Mexico, and so the\nsocial dynamic, although ameliorated by the newly shared class status,\n\nPatricia Martinez\n21A.112 -- May 21, 2008\nis not going to be entirely friendly, or as much like a `family' as Matute-\nBianchi would like.\n\nPatricia Martinez\n21A.112 -- May 21, 2008\nVII.\nBibliography\nAdamson, H. D. 2005. Language Minority Students in American Schools:\nAn Education in English. University of Arizona.\nBurgos, Elizabeth. 1985. me llamo Rigoberta Menchu y asi me nacio la\nconciencia. Siglo xxi editores, s.a. de c.v.\nColas, Pierre Robert. 2007 \"Community and Communication: The\nYucatec Maya of San Antonio, Cayo District, Belize,\" Proceedings of\nthe 5th Annual Belize Archaeology Symposium: Postclassic Maya\nCulture In Belize, Belize National Institute Of Culture and History.\nHernandez-Castillo, Rosalva Aida. 2001. Histories and Stories from\nChiapas: Border Identities in Southern Mexico. University of Texas\nPress.\nKaiser, Richard A. 2000. \"The Changing Structure of Minority Group\nPolitical Opportunities: Looking Ahead to the Twenty-first\nMillennium,\" In Minority Politics at the Millennium, ed. Richard\nKaiser and Katherine Underwood. Garland Publishing, Inc., pp. 1\n18.\nLevi, Jerrold. 1999. \"Hidden transcripts among the Raramuri: culture,\nresistance, and interethnic relations in northern Mexico.\" American\nEthnologist, 26(1): 90-113.\nMatute-Bianchi, Maria E. 1991. \"Situational Ethnicity and Pattern of\nSchool Performance among Immigrant and Nonimmigrant\nMexican-Descent Students,\" In Minority Status and Schooling: A\nComparative Study of Immigrant Minorities and Involuntary\nMinorities, ed. Margaret A. Gibson and John U. Ogbu. Garland\nPublishing.\nOgbu, John U. 1991. \"Immigrant and Involuntary Minorities in\nComparative Perspective,\" In Minority Status and Schooling: A\nComparative Study of Immigrant Minorities and Involuntary\nMinorities, ed. Margaret A. Gibson and John U. Ogbu. Garland\nPublishing.\n\nPatricia Martinez\n21A.112 -- May 21, 2008\nSnow, Catherine E. 1990. \"Rationales for Native Language Instruction:\nEvidence from Research,\" In Bilingual Education, ed. Amado M.\nPadilla et al, Sage Publications, pp. 60-74.\nSuarez-Orozco, Marcelo O. 1991. \"Immigrant Adaptation to Schooling: A\nHispanic Case,\" In Minority Status and Schooling: A Comparative\nStudy of Immigrant Minorities and Involuntary Minorities, ed.\nMargaret A. Gibson and John U. Ogbu. Garland Publishing.\nValdez Fallis, Guadalupe. 1977. \"Spanish Language Programs for\nHispanic Minorities: Current Needs and Priorities,\" In Minority\nLanguage and Literature, ed. Dexter Fisher, Modern Language\nAssociation of America, pp. 86-98.\n\nPatricia Martinez\n21A.112 -- May 21, 2008\nVIII.\nAppendix A: Interview With Martina Martinez\nMartina Martinez is a teacher and my mother. She has taught grades\nfrom preschool through high school, as well as working in the ESL\n(English as a Second Language) program, being a teaching assistant for\nlanguage minority students, and teaching adult classes for language\nminority parents. She started the integrated bilingual preschool\nprogram, and has since moved on to running a bilingual childcare\nservice for kids ages 2-5 and taking on voluntary advocacy roles within\nthe Mexican-American community. The schedule of questions is below,\nand the fieldnotes are attached. Note: the interview was informal, and as\nsuch the questions flow from one to the next (see attached.)\nSchedule of Questions\nHola.\nQue experiencias has tenido ensenando a ninos con padres que hablan\nlenguas indigenas, lenguas que hablan lenguas que no son ni Ingles ni\nEspanol? (What experiences have you had teaching children with parents\nthat speak indigenous languages from Mexico?)\nPreSchool--\nElementary--\nMiddle School--\nHigh School--\nCual es tu opinion acerca de ensenarles a estos ninos Ingles? (What is\nyour opinion about teaching these children English?)\nY que tal Espanol? (What about Spanish?)\n\nPatricia Martinez\n21A.112 -- May 21, 2008\nCual es tu opinion acerca de padres que no quieren que sus hijos\naprendan Ingles? (What is your opinion of parents that don't want their\nchildren to learn English?)\nCual es tu opinion acerca de padres que no quieren que sus hijos\naprendan Espanol? (What about parents who don't want their kids to\nlearn Spanish? )\nEn tu experiencia, que puntos negativos tiene que el nino aprenda estos\nidiomas? (In your experience, what are the negative points of teaching\nkids these languages?)\nEn tu experiencia, que puntos positivos tiene que el nino aprenda estos\nidiomas? (What about positive points?)\nQue mas me quieres decir? (Anything else you want to tell me?)\nResponse (attached)\n\nPatricia Martinez\n21A.112 -- May 21, 2008\nIX.\nAppendix B: Other Planned Interviews\na. Interview with Eva Pisano, San Francisco Mexican Consulate\nThis interview didn't happen. Every other person I talked to at the\nconsulate told me to go talk to Eva Pisano, but she never answered my\ncalls or called me back (see section on self-reflexivity). The schedule of\nquestions that was planned is included below.\nAlso relevant were the array of answers I got from other people at\nthe consulate: people who thought they weren't qualified to give opinions,\npeople who thought they didn't really know the topic, people who didn't\nknow if they were supposed to talk about the topic, one person who said\nthey didn't know how to talk about it... It is interesting, since none of the\npeople told me that they were too busy or that they did not want to talk\nto me (both reasons that would give the speaker more control over their\nchoice to not speak to me).\nSchedule of Questions\nHola, muchas gracias...\nMe llamo Patricia --estudiante, antropologa -- reporte acerca de lenguaje\ny educacion, educacion bilingue en California,\nPreguntas acerca de usted,\n1a) Cual es su nombre? (What is your name?)\n1b) Y su trabajo? (And your job?)\n\nPatricia Martinez\n21A.112 -- May 21, 2008\n1c) Cual es su opinion acerca de la educacion bilingue en California?\n(What is your opinion on the bilingual education systems in place in\nCalifornia?)\n2) Como cree que afecta a los hijos de padres que hablan lenguas\nindigenas, o que inmigran sin hablar espanol? (How do you think they\naffect the children of parents who speak their indigenous languages, or\nwho immigrate without learning Spanish?)\n3) Que problemas ve usted con el sistema de educacion de estos grupos\nde gentes? (What problems do you see with the systems of education set\nin place for these sets of people?)\n4) Y si usted pudiese, como los mejoraria? (What do you think could be\ndone to fix them?)\n5) Que problemas ve usted con la comunicacion con las gentes\nindigenas en California? (What problems do you see with the systems of\ncommunication set in place for these sets of people?)\n6) Si usted pudiese, como mejoraria esos problemas? (What do you think\ncould be done to fix them?)\n7a) Que mas le gustaria decirme acerca de este tema? (What else World\nyou like to tell me about this topic?)\n7b) Que puntos cree usted que son importantes? (What do you think are\nthe important points?)\n7c) Que asuntos cree usted hay que considerar para entender y mejorar\nla situacion de padres e hijos indigenas en California? (What points do\nyou think one must consider when attempting to understand and better\nthe situation of indigenous parents and children in California?)\nMuchas gracias por contestar mis preguntas y ayudarme con este\nproyecto. (Thanks for answering my questions and for your help.)\nAlgunas dudas? (Any questions?)\n\nPatricia Martinez\n21A.112 -- May 21, 2008\nb. Interview with Parents\nSince I could not in good conscience talk to children for ethical and\npractical reasons, I decided to try talking to parents whose primarily\nlanguage was neither Spanish nor English, but some non-colonial\nlanguage native to Mexico. This plan also failed, because I only had\naccess to this demographic by proxy (Martina Martinez and the Mexican\nConsulate at San Francisco), and the parents I was trying to contact\ndidn't trust the former while the latter didn't trust me. Again, the\nSchedule of Questions is appended (in English; the plan was to ask the\nquestions in either Spanish or English, if the informant/interlocutor\nknew either---unlike the two previous informants, which I knew I would\nbe speaking with in Spanish).\nSchedule of Questions\nHello, nice to meet you.\nWhat is your native language?\nWhat part of Mexico are you from?\nWhat language is your primary language?\nWhat is your opinion about teaching this language to your children?\nDo your children speak [your primary language]?\nIF SO: Did you teach them? If not, how did they learn?\n\nPatricia Martinez\n21A.112 -- May 21, 2008\nWhen do your children speak [your primary language]? (Response I'm\ninterested in: when do you let your children speak [your primary\nlanguage]?)\nIF NOT: How would you feel about your children learning [your primary\nlanguage]? Why?\nDo you speak Spanish? (ask only if this interview isn't in Spanish)\nIf so, in what situations do you speak Spanish?\nDo your children speak Spanish?\nIF SO: Did you teach them? If not, how did they learn?\nWhen do your children speak Spanish? (Response I'm interested in:\nwhen do you let your children speak Spanish?)\nIF NOT: How would you feel about your children learning Spanish?\nWhy?\nDo you speak English? (ask only if this interview isn't in English)\nIf so, in what situations do you speak English?\nDo your children speak English?\nIF SO: Did you teach them? If not, how did they learn?\nWhen do your children speak English? (Response I'm interested in: when\ndo you let your children speak English?)\nIF NOT: How would you feel about your children learning English? Why?"
    },
    {
      "category": "Resource",
      "title": "Understanding Bodies: Haitian vodou as a lens for understanding conceptions and healing practices of the body",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-112-seminar-in-ethnography-and-fieldwork-spring-2008/4628abc7f603ff636654b2d04b0a9070_rshyam.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n\n21A.112 Seminar in Ethnography and Fieldwork\nSpring 2008\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nUnderstanding Bodies:\nHaitian vodou as a lens for understanding\nconceptions and healing practices of the body\n\nRagini Shyam\nMay 14, 2008\n21A.112 Prof. Helmreich\n\nWhat is Voodoo1? Its devotees have asked\nwhat men have always asked of religion:\nremedy for ills, satisfaction of needs and the\nhope for survival.\n-Alfred Metraux, 1959\n\nThe life of one human being differs from another on scales as vast as the\nimmensity of this world. Therefore, there is little that is common to the experience of\nbeing human. Most would agree, however, that there is something we all share - our\nbodies. The human body is a universal standard; it must be maintained by every person,\nthough in varying ways, throughout a lifetime. While conceptions of what the body is\nand what it means are constantly changing and differing from each other across and\nwithin cultures and over time, they are still an integral part of being human. Because of\nthe critical importance our bodies hold, we put a considerable emphasis on keeping them\nfunctional. In the article, \"Culture, Critical Theory, and Reproductive Illness Behavior in\nHaiti,\" Merrill Singer, et. al. recognize illness as an \"[expression of] an experience over\nwhich we exercise little control, but it does so through a language and set of meanings\nwhich we either create ourselves or borrow\" (1988: 380). So, necessarily, when our\nbodies have problems, we seek - or do not seek - different methods of healing whether\nthey are created or borrowed. To get a better look at this phenomenon, a case study will\nhelp illustrate the circumstances by which people come to\n\n1There are various ways of spelling vodou that I have encountered in my research. The term\n\"voodoo\" is the Anglicized spelling which Farmer uses throughout his book. Brodwin prefers the\nspelling \"vodoun\" closely related to the original word \"vodun.\" I have used the term \"vodou\"\nthroughout my paper because it seems to resemble most closely the spelling and pronunciation\npreferred in Haitian Creole.\n\nShyam\n\nvalue and make decisions about their body. In this paper I will discuss how and why\nmany Haitians use vodou to understand and mediate their bodily experiences.\n\nWhy Haitian Vodou?\n\nWhile there are many frameworks within which people choose to construct ideas\nabout their body, I chose Haitian vodou for a few reasons. First, to understand a\nuniversal concept, it is best to look through a lens that is different from your own. The\nconcepts of Western biomedicine are too embedded in the hegemonic discourse of my\nlife to extract myself from their influence. Rather, by looking at something vastly\ndifferent, though inextricably connected to my own ideas about my body, I am able to\ntake a fresh perspective. While it would be a mistake to say my analysis would be purely\nobjective, I can argue that my thought processes are not as deeply affected by Haitian\nvodou as they are by Western biomedicine.\n\nThe two biggest influences on bodily perceptions are science and religion. If I,\nfor the sake of argument (though the issue is much more complex), construct a spectrum\nwith science at one extreme and religion at the other, many medical discourses would fall\nclose to either end. Vodou, as it is used for healing, however, would fall away from the\nextremes. It is an intriguing mix of both science and religion that lends important insight\ninto both systems of belief and how they relate to conceptions of the body.\n\nVodou has also been well-researched and has a large body of work devoted to its\nstudy. In the past, vodou practices have been largely misunderstood, particularly by\nShyam\n\nNorth Americans. Many anthropologists, among others, have contributed to upsetting\nthese incorrect notions of the practices surrounding vodou. This paper will draw largely\nfrom two main works, AIDS and Accusation: Haiti and the Geography of Blame by Paul\nFarmer and Medicine and Morality in Haiti: The contest for healing power by Paul\nBrodwin. Both of these individuals, as well as their colleagues, have contributed\nsignificantly to modern understandings of Haitian vodou. Both their fieldwork and\nresulting ethnographies have been great resources.\n\nVodou as Resistance\n\nThe history of Haitian vodou is a complex set of facts, often in contraiction. The\nreligion itself has no official texts, so, in an effort to understand its origins, one must\npiece together a fragmented history. In the early 1500s, the Portuguese began selling\nAfrican slaves to the Spanish. All the way through the 1600s, the slave trade expanded to\nother European nations. The French were first involved in the 1700s carrying slaves\nfrom the Western coast of Africa to start the Caribbean colony of Saint-Domingue. By\n1789, the colony of Saint-Domingue had grown to about 500,000 slaves from all of the\ncountries in West Africa. Through the process of \"maronnage,\" slaves would escape\ninhumane treatment on the plantations. These \"maroons\" would gather in groups and\nbegin the process of \"re-Africanization.\" As Roland Pierre describes in \"Caribbean\nReligion: The Voodoo Case,\" the masters forced their slaves to give up their culture and\nShyam\n\naccept a new one, that of the masters. Therefore, the \"maroons\" felt compelled to reverse\nthe influence through the use of vodou. \"This is what gives the Voodoo its aspect of a\nreligion of deportees which, therefore, could only be a religion of protest and social\nredemption\" (1977: 29). Vodou continued to live up to its rebellious reputation as it\nspread throughout the Caribbean landing in many places, including Haiti.\n\nThe Body Extends into and is Permeated by the Environment\n\nOne of the first questions to ask when thinking about the body is: \"where are its\nbounds?\" To make sense of something, one must know everything that is included and\nexcluded by the parameters of the object. Using a vodou conception of the body\ncomplicates an idea of the self being limited to the physical body. Brodwin says that\n\"[people] articulate their experience of social conflict through local medical discourses,\nand hence open up more room to maneuver in their constricted worlds\" (1996: 194). By\nviewing the body as much larger than just the physical body, some people feel comforted\nknowing that they have a bigger framework in which to understand themselves.\nDeeply embedded within vodou discourse about the causes of diseases and how to\ntreat them is the idea that the physical self reproduces imbalances in the environment.\nErica James, in her article \"Haunting Ghosts: Madness, Gender, and Ensekirite in Haiti in\nthe Democratic Era\" from the book Postcolonial Disorders writes that in vodou, \"the\nrelationship between the interior and exterior of the body, the blood, and the emotions is\nShyam\n\ndynamic. Thus, when one considers the impact of local behavior ecologies on mental\nhealth, the bounds of the self must be viewed as extended or permeable\" (2008: 146). So,\nthe health of the body is tied to how it is treated as it extends into and is permeated by its\nenvironment.\n\nThe concept explained by James is echoed in Farmer's book, as well. In his\nfieldwork, he chronicles the stories of the three individuals in the central Haitian village\nof Do Kay who have been struck with sida (the Haitian term for HIV/AIDS). The ideas\nabout AIDS and AIDS-causation in Do Kay are somewhat incongruous among the\nvillagers. The general sense is that AIDS can be \"caught\" in more than one way. Two of\nFarmer's ethnographic subjects, Manno and Dieudonne believe that their sida was a\n\"sent\" sickness, or that it was sent to them by another individual for reasons of jealousy.\nA third subject of Farmer's, Anita, believes her sida was transmitted physically to her\nfrom her husband, who died of sida. Anita and her friends and family do believe that her\nhusband was a victim of a \"sent\" sickness, however. These three individuals represent\ntwo ways in which the villagers of Do Kay believe they were sent their illness. The\ncommonality among them, as expressed by Dieudonne, is that \"sida most made sense as a\n\"jealousy sickness,\" a sickness emblematic of a nation of poor people distracted from\n\"the real struggle\" by the hurt they inflict on one another\" (19922: 109). Dieudonne, as\nwell as some other villagers who expressed the same point, believes that sida and its\n\n2 The most recent version of Farmer's AIDS and Accusation was published in 2006. The edition\nwhich I read and from which I am quoting was published in 1992.\nShyam\n\ncausation is inextricably tied to their social and geographical location in the world. This\nenvironment, he argues, has specific physical repercussions on his body.\nNot only does the body extend into the environment, as illustrated earlier, but it is\nalso believed in vodou to be open to inhabitance or temporary possession. Brodwin\ndescribes the story of Jerline, a young female teacher who had been afflicted with an\nunknown illness. Jerline believed that the spirit of a dead person had been sent upon her.\nShe lost her ability to be socially engaged, she had a \"wild look\" in her eyes and she had\nto be restrained due to occasional violent physical outbursts. Brodwin, as he observed\nJerline, was asking himself if Jerline was present or absent from her body. According to\nBrodwin, her actions contained no recognizable hints of her former self. However, at one\npoint, she communicated by writing a French word; this message was an indication that\nJerline, as one of the few people in the village who spoke or understood French, must still\nbe inhabiting her body in some way. Brodwin concluded that \"the local\nphenomenological account of her condition (as well as her own reported experiences)\ncast her as present in her body but not in control of it; as crowded by this other entity\"\n(1996: 160). The understanding is that an individual in Jerline's environment sent her,\nperhaps without physical contact, an invisible entity which entered her body and exerted\nsome form of physical control. In order for Jerline and her fellow villagers to subscribe\nto this description of the vodou concept, maladi satan3, they must believe the body is not\n\n3As described by Brodwin, maladi satan is \"an \"illness of satan,\" typically sent upon the victim\nby her/his human enemies out of jealousy or the desire for revenge\" (1996: xvi).\nShyam\n\nonly physically influenced indirectly by the extension into the environment but also\npermeable to objects of intangible nature.\n\nWhen Jerline's mother and the other members of her therapy managing group\ncame to the agreement that Jerline's condition was a maladi Satan, Jerline's mother went\nstraight to a houngan4 in the village, a local vodou healer. Pierre Morin, the houngan,\nhad many sessions with Jerline described by Brodwin as \"time-consuming affairs.\"\nBrodwin noticed that Morin's sessions did not seem to have any discernible order. Morin\nwould (in a seemingly arbitrary way) sing songs, recite prayers, and administer remedies.\nHe also asked Marie, Jerline's mother, specific tangible treatment. For example, he told\nMarie to give Jerline small items to wear, paint symbols above her doors and windows,\nand give her certain herbs to drink. Brodwin writes that \"Morin constructs the satan\ninhabiting [Jerline] as an essentially amoral entity: the lifeless vehicle of a human\nenemy's murderous designs. Therefore his healing techniques are externally directed: the\ngoal of the treatment is to guard Jerline against the enemy located somewhere in her\nsocial world\" (1996: 167). In other words, none of Morin's treatments (whether tangible\nor not) were attending to biological problems within Jerline's physical body; rather they\nwere focused on that which was affecting the extension of Jerline's body into her social\nworld.\n\nIn understanding how vodou shapes the way that Haitians view their bodies, it\n\n4As described by Brodwin, a houngan is a male \"religious specialist in serving the spirits whose\npractice includes healing, services for ancestors, and yearly ceremonies for the lwa [spirits].\" The\nfemale counterpart is called a mambo (1996: xv).\nShyam\n\nbecomes clear that the environment of the individual is an important factor. It is\nsignificant in that the body of the individual interacts with the environment by extending\nintangibly into it and by being intangibly permeated by it. Both of these interactions may\ninfluence the body physically; the impacts are sometimes negative. To mediate\nthe effects of these interactions, vodou, as a medical discourse, must address the source of\ndisease causation.\n\nSorcery5 Accusations and Guilt\nBecause, in vodou, it is believed that an external actor may have caused a disease, as\nopposed to something that necessarily had physical contact with the body at some point,\nidentifying the causative factor becomes more difficult. In the fieldworkof both Farmer\nand Brodwin, neither Haitian community had a clear process for determining the cause of\na disease. As I mentioned earlier, all three cases of sida in Farmer's ethnography had\nsome connection to a \"sent sickness.\" However, the determination of a \"sent sickness\"\nwas not clearly defined and who, why, or how the sickness was sent was often disagreed\nupon among the villagers. Brodwin also had similar experiences. What is implicit,\nthough, is that an individual's actions may contribute to physical effects on his or\nsomeone else's body. In order to use vodou to heal a \"sent sickness,\" the identity of\n\n5 Farmer devotes some of his book to describing the nuanced differences between sorcery and\nvodou. This discussion is beyond the scope of this paper. For the purposes of my argument, the\nterms \"sorcery\" and \"vodou\" can be used interchangeably.\nShyam\n\nthe sender or the reason for sending must be known. This leads to accusation and\nfeelings of guilt.\n\nIn Jerline's case, simply naming her disease in the context of vodou had serious\nmoral repercussions. It is necessary for the houngan to name her sickness, though, if he\nwere to develop a plan for healing. For Jerline, her options were either to remain ill or\nsuffer the social scrutiny of her potential guilt. Brodwin writes that \"to say that Jerline's\nsickness was sent upon her by someone else left unsettled the question of her innocence\nor guilt. Innocent people, I often heard, are generally less likely to become victims of\n\"sent sickness\" (1996: 158). Given the general understanding that someone who has\nbeen \"sent\" a sickness is most likely to be guilty in some way, Jerline's innocence was\nquestioned. Because vodou places the body in an inextricably social context, the question\nof healing is also becomes tied to questions of morality. If Jerline wants the best\ntreatment from her houngan, he would need to identify the source of her illness. This\nmay, however, put her in a situation where her morals are questioned. In this way, vodou\nplaces the fate of the physical body in a subjective framework where an individual may\nbe held morally responsible.\n\nAn individual's social status, the likelihood that he or she is innocent, and past\nincidences of a disease are also yardsticks against which symptoms are measured in\npursuit of a diagnosis. Initially for Farmer's subject, Anita, a diagnosis of sida was\nrejected. Many of the villagers agreed that Anita was \"too innocent.\" The idea is that\n\"sorcery is never random; it is sent by enemies. Most people make enemies by inspiring\nShyam\n\njealousy or by their own malevolent magic\" (1992: 87). Anita, however, was too poor to\ninspire jealousy or afford to pay a houngan to perform malevolent magic for her. On top\nof that, the only previous case of sida in the village was Manno, who was believed to\nhave caught his sida from sorcery. So, at that point, sida was believed to be caused by\nsorcery and since Anita could not possibly be the victim of sorcery, she could not have\nsida. In Anita's case, common (though, perhaps, incorrect) understandings about how\nsorcery works to affect the physical body changed the nature of her diagnosis. Such\npervasive notions shape the ways that Haitians view their bodies regularly and, in Anita's\ncase, under stress.\n\nDespite the moral underpinnings of sorcery accusations, Farmer argues that vodou\nis used, primarily, for the purpose of healing. There must be some question of direct\nhuman agency for a houngan to be called and the illness must also be feared to be fatal\nbut this is only necessary in the name of treating the physical body. \"In short, sorcery\naccusations, for all their flaws, are often triggered by severe sicknesses because they\nspeak to questions of etiology, pathogenesis, and socially sanctioned therapeutic\nresponse\" (1992: 247). Farmer's argument is that other types of accusation, such as\nAIDS-related discrimination and conspiracy theories, which are not associated with\nvodou, are \"macrosociological\" models. They not only assign blame but do not answer\n\"the inevitable question of how AIDS comes to be embodied in the afflicted\" (1992:\n247). Therefore, although vodou tends toward the necessity to accuse someone or\nsomething of causing illness, the ultimate focus is the healing of the physical body.\nShyam\n\nIn a research report \"Arrested Pregnancy Syndrome in Haiti: Findings from a\nNational Survey,\" Jeanine Coreil, et. al. examined the \"arrested pregnancy syndrome\" in\nconnection with infertility. In their interpretation of data, the authors found it useful to\nlook at vodou conceptions of the body and how they relate to fertility. They found that in\nHaitian vodou beliefs, fertility cannot be altered but the intrauterine growth of a child\ncould be affected. \"Through this diagnostic redefinition of the problem, control of a vital\nsocial process within the folk sector of care was maintained\" (1996: 427). By looking at\nparticular bodily conceptions in terms of vodou, the authors were provided specific\ninsight into their study. The cultural norms of viewing how the body can be altered and\nby whom had profound implications on the physical bodies of the women in their study.\nLocating the potential agent behind the \"arrested pregnancy\" was important to\nunderstanding the pathogenesis of the condition.\n\nOnce the etiology of a disease has been determined within the vodou framework\nand an agent has been defined (or accused, as Farmer argues), a course of treatment is\nthen determined. This treatment will essentially be aimed at the root of the cause. In\nvodou this \"root\" is often another human.\n\nVodou and Biomedicine\nThe decision to use vodou to treat an illness in Haiti is a complicated one that is\nnot always defined by set parameters. While vodou is one option, it is heavily steeped in\nShyam\n\nsubjective moral and social discourse. Taking the assumption that individuals always\nwant to choose the best care for themselves that is within their means, Haitians, who\nplace a considerable emphasis on their physical bodies, are careful with this decision. As\nBrodwin describes it, \"people in Jeanty [a rural Haitian village and the site of his\nfieldwork] predictably seek out a biomedical cure in hopes to avoid the diagnosis of\nmaladi Satan\" (1996: 190). This shows a particular awareness of the link between the\nmaintenance of the physical body and the maintenance of the social person. Decisions\nabout which medical modality is most appropriate is not just about the physical body but\nalso about the connotations that are associated with each healing method.\nBrodwin describes a situation in which an individual, upon learning the nature of\nhis illness, makes a decision about which medical treatment to proceed with. \"Several\nhoungan reported that some people who arrive for a consultation are already too sick for\nthem to treat.... [They conclude] that the client has a maladi dokte, that is, one which\nrequires a doctor's care. In these cases, houngan may refer their clients to biomedical\nsettings\" (1996: 214). This shows that houngan, do not view their conceptions of the\nbody as incompatible with biomedicine. In fact, it is evidence that these houngan believe\nbiomedicine is a complementary skill set to their own. A view of the body in the context\nof Haitian vodou does not necessitate the treatment of illness in the context of Haitian\nvodou.\nSimilarly, Farmer describes the moment of decision-making for a person with an\nillness in Haiti. \"More often, [it] is not an either/or decision...in the event of grave\nShyam\n\nillness, many rural Haitians will faithfully avail themselves of the services of both\nhoungan and dokte \" (1996: 198-9). What Farmer describes is an illustration of the\nextent to which an individual is willing to go to sustain the physical body. The ability of\nvodou to treat the physical body is satisfying in most cases but, under severe\ncircumstances, an individual will forgo their faithfulness to one practice in the name of\nsaving his or her life.\nBrodwin explains why the decision is so difficult. He writes that in Jeanty, the\nethnography if illness and healing has shown that it does not adhere to the assumptions\nmade by others who study medically pluralistic situations. These assumptions are that\n\"(1) individuals are rational and voluntaristic actors, and (2) the \"health care sectors\" of a\ncommunity form a stable set of discourses and treatments which exist distinct from the\nsubject\" (1996: 190). Here Brodwin acknowledges that individuals do not always have\nagency in their decisions; while it may seem as though there is the freedom of choice, it is\nactually a mask for larger societal forces that strip the individual of will. He also makes\nthe point that individuals do not always make decisions based on rational thought; in fact,\nin case of a human making a decision about his or her body, there are other non-logical\nthought processes at play. The second assumption which is being negated is that the\nmedical discourses that are available to choose from are neatly defined and\ncompartmentalized so that individuals can make completely objective decisions. As long\nas these assumptions remain false, the decisions will remain difficult.\n\nShyam\n\nHealing Power\nOver the course of understanding the body through the lens of Haitian vodou, the\nquestion remains: why does vodou work? How come vodou can be used to treat illnesses\nof the physical body? There are several answers to this question. First, those illnesses\nwhich vodou can successfully treat are constructed, to begin with, in a vodou framework.\nIn other words, vodou cannot be used to treat an illness that is not first described within\nthe discourse of vodou. For example, in order for a houngan to treat an individual with\nAIDS, the biomedical definition which places a \"microbe\" as the disease-causing agent\nwill not work. The houngan must identify the sida as a \"sent-sickness\" and he will then\ntreat it as a \"sent-sickness.\" That which is healed is not AIDS as it is caused by a\n\"microbe\" but the \"sent-sickness\" which was constructed using the language of vodou.\nTherefore, although some medical modalities can work together (in this case, vodou and\nbiomedicine) they must be able to construct the illness in their own frameworks to be\nsuccessful.\nSecondly, the ability of a medical modality to be effective is a conglomeration of\nsocial and physical factors that interact with each other. Brodwin explains that \"[healing\npower] connotes clinical effectiveness, moral authority, political coercion and\nopportunity, and a resource for collective identity\" (page 192). The ability of a system of\nhealing to successfully treat an illness is only one piece of reasoning by which an\nindividual chooses that system. Brodwin also mentions the moral, political, and social\nneeds a healing system must fill to be effective. If there is a system which is both\nShyam\n\nclinically effective and fills the moral, political, and social needs well, it will grow to be a\npowerful system of healing.\nPerhaps the most important and underestimated quality in the effectiveness of a\nmedical modality is belief. An individual who does not subscribe to the methods of his\nhealer has been clinically shown to have less success. In their article, \"Belief as\nPathogen, Belief as Medicine: \"Voodoo Death\" and the \"Placebo Phenomenon\" in\nAnthropological Perspective,\" Robert Hahn and Arthur Kleinman argue that \"the\nphysical world within and without us does not affect us directly, uncharted, but is itself\nvitally affected by the ways in which we construct it\" (1983: 19). Our physical bodies do\nnot just exist but are created by us and viewed through whichever lens we choose.\n\nShyam\n\nBibliography\n\nBrodwin, Paul. Medicine and Morality in Haiti: The contest for healing power.\n\nCambridge: Cambridge University Press, 1996.\n\nCoreil, Jeanine, Debora L. Barnes-Josiah, Antoine Augustin, and Michel Cayemittes.\n\n\"Arrested Pregnancy Syndrome in Haiti: Findings from a National Survey.\"\n\nMedical Anthropology Quarterly, New Series, Vol. 10, No 3. (Sep., 1996), pp.\n\n424-436.\n\nFarmer, Paul. AIDS and Accusation: Haiti and the Geography of Blame. Berkeley and\n\nLos Angeles: University of California Press, 1992.\n\nHahn, Robert A. and Arthur Kleinman. \"Belief as Pathogen, Belief as Medicine:\n\n\"Voodoo Death\" and the \"Placebo Phenomenon\" in Anthropological\n\nPerspective.\" Medical Anthropology Quarterly, Vol. 14, No. 4 (Aug., 1983), pp.\n\n3-19.\n\nJames, Erica C. \"Haunting Ghosts: Madness, Gender, and Ensekirite in Haiti in the\n\nDemocratic Era.\" Postcolonial Disorders. Ed. Mary-Jo DelVecchio Good,\n\nSandra Teresa Hyde, Sarah Pinto, and Byron J. Good. Berkeley and Los Angeles:\n\nUniversity of California Press, 2008.\n\nMetraux, Alfred. Voodoo in Haiti. Oxford: Oxford University Press, 1959.\n\nPierre, Roland. \"Caribbean Religion: The Voodoo Case.\" Sociological Analysis, Vol.\n\n38, No. 1 (Spring, 1977), pp. 25-36.\n\nSinger, Merrill, Lani Davison, and Gina Gerdes. \"Culture, Critical Theory, and\n\nReproductive Illness Behavior in Haiti.\" Medical Anthropology Quarterly, New\n\nSeries, Vol. 2, No. 4, Gramsci, Marxism and Phenomenology: Essays for the\n\nDevelopment of Critical Medical Anthropology (Dec., 1988), pp 370-385.\nShyam"
    },
    {
      "category": "Resource",
      "title": "Writing Against MIT Culture",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-112-seminar-in-ethnography-and-fieldwork-spring-2008/7d7b82b848962171c45d3b5751d7b412_rubinc.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n\n21A.112 Seminar in Ethnography and Fieldwork\nSpring 2008\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nCaroline Rubin\n21A.112 Helmreich\nFinal Paper\nMay 10, 2008\nWriting Against MIT Culture\n\"Maybe we need to educate these East Campus freaks that their isolation from the rest of\nthe world ends when they leave campus... freaks... [live] in east campus. Ideas and cultures,\nwhat a bunch of bullshit... One day when you grow up, you'll realize that the rest of the world\ndoes not operate on east campus principles. No hair dye, crossdressing, and trying to push free\nspeech to the limit...\"\nMIT student Mario Zunino, email to dorm discussion list, September 21, 2008\nOn September 21, 2008, MIT sophomore Star Simpson walked into Boston's Logan airport\nwearing several LEDs on a circuit board and a battery pinned to her sweatshirt. She was promptly\nsurrounded by armed policemen, arrested, and is currently awaiting trial for charges of disorderly\nconduct and possession of a hoax device (Brett 2007). What ensued in the days and weeks following the\nincident was a heated debate about Simpson's explanation that her sweatshirt was simply wearable\nelectronic \"art,\" with her detractors arguing that her actions were malicious and indefensible (e.g.\nMcPhee 2007) and her supporters that they were perfectly normal within the context of \"MIT\nculture\" (e.g. Csikszentmihalyi 2007). But what exactly is \"MIT culture\"? As the above email excerpt\nmakes clear, the question is contentious even within the MIT student population itself. Lauded for\npromoting virtues from scientific genius to entrepreneurship, and blamed for causing problems from\nstifled creativity to student suicides, \"MIT culture\" is used to corral the nebulous sense that MIT's\ninhabitants are somehow \"other\" into one coherent catchphrase. But as anthropologist Gary Downey\n\npoints out, \"every image makes some things visible while hiding other things\" (1998: 5). So what does\nthe image of \"MIT culture\" hide? To answer this question, we must first explore how the idea of \"MIT\nculture\" came to be.\nA Brief History of \"MIT Culture\"\n\"For students must work, and scholars must weep,\nAnd there's so much to learn, there is no time to sleep,\nAnd the Prof's are always pushing.\"\n-\nExcerpt from \"Three Seniors\" poem, Technique (MIT's yearbook), 1887\nWhen MIT was founded by William Barton Rogers in 1861, it had too few students and too\nmany financial troubles to lay claim to anything as wellestablished and seemingly distinguished as a\nunique culture all its own. Still, in the first MIT President's Report in 1873, the groundwork of many\ntraits later associated with \"MIT Culture\" was already being lain. In a section entitled \"Physiology and\nHygeine\" the student body is found to be lacking:\n...these students remain in the building all day, and seldom take the proper exercise... except\nwhat is got in traveling to and from their rooms, and homes. This want of exercise and a proper\nmidday meal... is having effect upon the health of our students, and is a much more serious\nmatter than hard study. Where the health of one student is injured simply by overstudy, the\nhealth of many is injured by want of exercise, or other preventable causes, while overstudy is\nusually the only cause assigned.\n(MIT President's Report 1875: xii)\nAnd the report of the Institute's first, and for many years only, English professor is equally disparaging\nwith respect to the writing ability of the earliest MIT students:\nThe question of the best method of adjusting my instruction to the real wants of the students of\n\nthe Institute has been, from the beginning a very perplexing one. The imperfect preparation for\nthe scientific studies of the course which the students bring with them lays a heavy pressure\nupon them in that direction; and, on the other hand, the deficiencies of too many of them in\nEnglish studies require attention to rudimentary drill, especially in composition, which should\nproperly have been completed before admission.\n(Atkinson 1875: 79)\nThese sentiments seem eerily predictive of characteristics that would continue to be associated with the\nMIT population nearly 150 years later, yet at the time they were attributed to external factors (lack of an\nMIT gymnasium for the former, insufficiently rigorous high school preparation for the latter) rather\nthan some inherent quality of MIT students.\nAs time wore on and the Institute's student population grew, a sense of camaraderie among the\nstudents began to grow. The editorial at the beginning of MIT's first yearbook, issued in 1887, describes\nthis transformation in its explanation of why the students elected to begin creating a yearbook:\nWhen the pioneer students in high scientific training were at the Institute, there was no need of\nanything in the line of an annual; but now that hundreds of brave hearts beat where there were\nbut a small number a few years ago, there is a demand for such an article. (Technique 1887: 7)\nAt the same time, the difficulty of establishing enough of a common ground between these \"brave\nhearts\" to form the content of a yearbook is readily acknowledged:\nNearly eight hundred professors and students, scattered all over Boston and vicinity, meeting\nonly in classroom, shop, and laboratory, with abundance of work for hand and brain, truly have\nbut a few things in common of a social or jovial nature. But you may ask, standing side by side\nat work day after day, are there not many hits given and taken worthy of repetition? Yes, indeed;\nbut they are mostly local, and only the comparatively few would understand them. (Technique\n1887: 8)\nSo while it seems that these early MIT students spent enough time together to establish what would\nnow be called \"inside jokes,\" the overall sense of campus unity in matters \"social or jovial\" implied by\n\nthe concept of \"MIT culture\" was still lacking.\nThis lack of campus unity changed in 1913, when MIT moved across the Charles river from its\nsmall campus in Boston to a much larger site in Cambridge. Students, instead of being \"scattered all\nover Boston and vicinity,\" for the first time lived in MIT dormitories. It is perhaps not coincidental that\n1913 also marked the first year that students made and distributed a handbook for incoming freshmen to\n\"help, as much as possible, each new freshmen in understanding the customs and activities of the\nInstitute, and to assist him in fitting his life into the career of a real Technology man\" (Foreword to The\nHandbook, 1929). Early Handbooks included sections on the history of MIT, the school colors, \"Tech\nSongs,\" student clubs, honors societies, athletics, and \"Advice for Freshmen,\" which as early as 1919\nincluded the imperative to \"GO OUT FOR SOME ACTIVITY. DON'T BE DEAD\" (The Handbook,\n1919: 7). This command would later transform into \"Study Hard, Play Hard\" in the 1928 Handbook,\nand eventually into the \"Work Hard, Play Hard\" mantra that is often associated with contemporary\n\"MIT culture.\" Also emerging in the 1920s Handbooks was a clearly articulated sense of the purpose of\nan MIT education, and the type of graduates the Institute intended to produce:\nThe Massachusetts Institute of Technology is interested not only in turning out well trained\nengineers, but makes every endeavor to develop in its students those attributes of character that\ndistinguish the well rounded and educated man from the merely technically trained engineer.\nDevelopment of Technology spirit, of a real pride in the position of our school in the collegiate\nworld and the formation of lasting friendships is fostered as much as possible by the\nundergraduates.\n(The Handbook, 1931: 15)\nYet despite the growing sense of there being a set of characteristics specific to MIT students, there is\nstill no mention of an \"MIT culture.\" The only \"culture\" mentioned at all during this period is of the\n\ncapitalized and singular variety, as when the 1941 President's report recommends that the cafeteria\nservice in the dining hall be replaced with table service to \"[promote] social and cultural development\namong our students\" (MIT President's Report 1941: 29)1.\nBy 1969, however, there was enough official recognition of the unique extracurricular\nproclivities of the students to warrant two new sections in the annual President's Report \"Student\nAffairs\" and \"The Living Environment,\" both of which appeared under the heading of \"Institute\nRelations\" (MIT President's Report 1969). And while the specific term \"culture,\" still was not applied\nto the students and their behaviors, they were beginning to be discussed in quasianthropological terms,\nas when then Dean for Student Affairs Kenneth Wadleigh reported on the first MIT student protests of\nthe Vietnam war:\nMIT had not experienced open protests prior to that time (We had, of course, 'tuition riots' and\n'panty raids,' but I think it would be safe to characterize these latter events as a form of young\nmales' springtime fertility rites and not as serious protests).\n(501)\nThis lay ethnographic analysis is concerned more with collegeaged males in general, however, not with\nMITspecific cultural traits.\nIn 1996, MIT established the Presidential Task Force on Student Life and Learning, in order to\nperform a \"comprehensive review of MIT's educational mission on the threshold of the 21st\ncentury\" (http://web.mit.edu/committees/sll/). It is in the section of this report labeled \"Community\"\nthat it is stated in an official MIT document for the first time that \"MIT is a special place, with a\n1 This understanding of Culture is still present to some extent in contemporary MIT - for instance, the graduate dormitory\nSidney Pacific has a \"Cultural Committee,\" which is \"charged with the organization and encouragement of activities for\nthe cultural enrichment of Members\" via activities such as museum visits and trips to the Boston Ballet\n(http://s-p.mit.edu/committees.php?comm_name=sp-cultural-chair)\n\ndistinct mission, history, and culture.\" The report goes on to elaborate:\nEach of us is an example to our peers and colleagues; through professional, recreational, and\nsocial interaction with one another we build a culture of discovery and learning that\ndistinguishes MIT from other universities. Hence informal personal interaction can be\nconsidered the life of the 'community': student activities, casual social gettogethers, cultural\nevents, and daily encounters with friends and colleagues are a few general categories of such\ninteraction. (1998: 33, emphasis added)\nThus the official concept of \"MIT culture\" was born.\n\"MIT Culture\" from Outside the Institute\n\"An MIT student's idea of having fun is cramming a semester's worth of braindraining work\ninto three days.\"\nClaudia Glenn Dowling, on MIT's annual Mystery Hunt\nAs the Star Simpson incident made clear, MIT students and their \"culture\" are not always\nperceived the same way from outside the campus as they are from within it. As early as 1912, there is\nacknowledgment on the part of students that, \"the world at large, unfortunately, knows but little of\nUndergraduate Technology, of the opportunities - educational and social - which the Institute has to\noffer.\" Their proposed solution was a book, \"Concerning the Massachusetts Institute of Technology,\"\nwhich would detail those opportunities for the edification of those outside of MIT. Apparently the book\ndid not achieve its mission; however, for thirty years later, in the 1942 MIT yearbook, the students still\nbemoan the fact that \"the massive structures of its buildings, the somber expressions on the faces of its\nfaculty, and the harried looks of its students all tend to give the impression that MIT is a place to work\n- never to play\" (Technique 1942). When asked to describe their culture themselves, as all members of\n\nMIT's undergraduate dormitories were asked to do recently in a series of \"Culture Reports\" for MIT's\nHousing Strategy Group, MIT students describe themselves as, \"enthusiastic, social, oft loud,\nsometimes harmonious, but always easy going people\" (Ranade and Hopp 2008: 8), and \"very\ncomfortable with each other and ourselves despite coming from different backgrounds\" (ibid.: 14).\nThey proudly proclaim that, \"we learn together, we cook together, and we do household chores together.\nMostly, though, we figure out how to navigate the behemoth that is MIT\" (Le Maison Francaise 2008:\n1).\nMIT students' sense that they are perceived differently by outsiders than by each other is not\nmisinformed. Outsiders' descriptions of MIT students typically confirm their suspicions, as when\nanthropologist Sherry Turkle described MIT computer science students as inhabiting, \" a culture of\nloners who are never alone\" (1984: 213), or when science writer Fred Hapgood claims:\nIt is true that a person walking into MIT might well feel the culture bending a degree or two in\nthis [nerdy] direction. As compared to the general population, eye contact might be a bit more\nglancing and the role of facial expression, voice, tone, and body language narrowed a touch. The\nstyle lends itself to precision, interruption, and contradiction. It does have an edge. (1993: 83)\nThis disjunction between MIT students' perceptions of themselves and outsiders' perceptions of them\nneatly illustrates the first problem with referring to \"MIT culture\" what the phrase means depends on\nwho is doing the referring. Former Dean of Undergraduate Education Rosalind Williams experienced\nthis discrepancy firsthand when she invited students to join the meetings of the Committee for Student\nLife and Learning:\nInstead of being represented through the eyes of the faculty, they represented themselves.\nInstead of being faces in an 8.01 lecture hall, or even in a humanities classroom, they became\n\nvisible as young adults, whose lives, while dominated by classes and homework, also included\nroommates, hall mates, friends, lovers, meals, sports, parties, worship, families, and dreams for\nthe future.\n(Williams 2002: 159)\nAs anthropologist Lila AbuLughod explains, \"culture is the essential tool for making other\" (1991:\n470). While MIT students see each other as college students with friends, lovers, and families, who are\nsimply trying to \"figure out how to navigate the behemoth that is MIT,\" most outsiders see them as\nmembers of an elite group, as \"wizards\" (Lombreglia 2007: 136) that are \"intimidating\" (Brandon 2007:\n1), and hence quite other. By categorizing them as members of \"a culture of loners who are never\nalone,\" this sense of difference can be captured, labeled, and put to rest.\nIn addition to creating an artificially heightened sense of otherness, the language of culture also\nserves to \"freeze difference\" (AbuLughod 2002: 470). Hence, even though women make up nearly half\nof MIT's undergraduate student population (Women at MIT 2008), it is not uncommon for female\nstudents to be met with incredulous looks by outsiders when they mention where they go to school,2\neven (or perhaps especially) when they inform their audience of the Institute's neareven undergraduate\ngender ratio (e.g. Anahtar 2008). The situation is often similar for students who fall into other groups\nnot commonly associated with \"nerd culture,\" such as Hispanic or Black students (see Williams 2001),\ndespite the steadily increasing proportion of minority students at MIT (MIT Minority Community\n2008). Since outside perceptions of what constitutes \"MIT culture\" were \"frozen\" long before these\ndemographic shifts in the MIT population took place, women and minority students are frequently put\n2 I vividly recall when, almost immediately after being accepted, I proudly put on my new \"MIT\" tshirt for a celebratory\nfamily dinner at a restaurant, only to be stopped in the parking lot by a woman who excitedly exclaimed, \"Oh, my son\nwent to MIT! Does your brother go there?\"\n\nin the position of being seen as outsiders in their own home - they are MIT students, but not fully part\nof traditional \"MIT culture.\" It is surely not coincidental that neither Turkle nor Hapgood mention\nfemale or minority students in their descriptions of \"MIT culture,\" despite the presence of members of\nboth groups on campus at the times of their respective writings.\nMarketing \"MIT Culture\"\nIt's true that students work very hard at MIT, and you can probably count on pulling a few all\nnighters in your four years. On the average night, however, students can get plenty of sleep if\nthey manage their time wisely. Of course, sometimes it's more fun not to manage time wisely\nwhen your floormates start a heated argument about the superiority of pi over e (or a battle of\nthe sexes, or a discussion about the politics of race and gender, or a whipped cream and\nchocolate fight) at 2 AM on a school night, you'll put off that problem set for another time. And\nit will be okay.\nThe MIT Admissions website on the \"Work/Play Balance at MIT\"\nMIT students are not the only ones aware of the discrepancy between inside and outside\nperceptions of \"MIT culture;\" the MIT Admissions Office actively campaigns to educate prospective\nstudents about contemporary MIT undergraduates in order to attract them to the university. The MIT\nAdmissions homepage links to a page on \"Student Life and Culture,\" which boasts:\nAt MIT, students work hard and play hard together. And many of the most important lessons\nyou learn here about collaboration, negotiation, leadership, empathy, joyful curiosity and how\nto have a good time while still passing physics you will learn in part outside the classroom.\nYou and your friends may organize cookins and cookouts, surprise parties, Sunday brunches,\ntheme suppers, dinner cruises on Boston Harbor, white water rafting trips to Maine, shopping\ntrips to factory outlets. Ski trips and skydiving are increasingly popular. Arriving from such a\nrich array of ethnic and cultural backgrounds, students often get to sample each other's home\ncooked meals, discover new musical instruments and play intriguing new games and sports.\nSpurofthemoment pleasures include strolling into Boston, playing volleyball or starting a\n\nsnowball fight.\n(Student Life and Culture 2008, emphasis in original)\nHacks, piano drops, and homemade disco dance floors are touted by the admissions office as evidence\nof the funloving culture of genius at play that prospective students can become a part of by enrolling at\nMIT, and statistics about current student demographics are proudly displayed on the homepage and in\nthe recruitment literature in attempts to \"unfreeze\" more stereotypical beliefs about MIT and its\nstudents.\nWhile this take on MIT culture is closer to the descriptions provided by contemporary\nundergraduates, it is not without problems. As Lila AbuLughod points out:\n...cultural theories also tend to overemphasize coherence... Organic metaphors of wholeness and\nthe methodology of holism that characterizes anthropology both favor coherence, which in turn\ncontributes to the perception of communities as bounded and discrete.\n(1991: 471)\nIndeed, the MIT culture of the admissions office literature is nowhere to be found on MIT's actual\ncampus, which is made up of multiple distinct dormitories and independent living groups, each with\ntheir own history, traditions, and selfdefined \"culture\" (hence the previously mentioned dormitory\nspecific \"Culture Reports\" for the Housing Strategy Group). The main divide between the dormitories\nis between those in the East, which are older and are seen as having more wellestablished traditions\nand \"cultures,\" and those in the West, which are newer and are seen as being more typical of a regular\ncollege campus. As science writer Claudia Dowling, who spent several weeks \"going native\" among\nMIT students and their culture, puts it:\n\n\"East Campus people are 'eccentric,'\" [a student] says, delicately. 'West Campus people probably\nblend in better when they're off campus.' Both groups use the word normal to describe West\nCampus, the Easterners somewhat disparagingly, the Westerners somewhat defensively...West is\nsoft tech, biology, and economics; East is hard tech, math, and engineering. 'Windows Me to our\nLinux,' says one of [the student's] friends. West is Starbucks Frappuccino; East is Mountain\nDew.\n(2005: 2)\nHacking is practiced mainly by students living in on the East half of campus, the piano drop is done by\na dorm on the West side. The disco dance floor was built by a living group from the East side, but not a\ngroup that participates in hacking. Of course, there are Westerners who hack and Easterners who study\nbusiness and drink Starbucks, and some dorms don't quite fit this neat categorization scheme (such as\nRandom Hall, which is \"West by geography and East by affinity\" [ibid.]), but regardless, there is no\nunified, homogeneous group of MIT students that participates in all facets of the \"MIT culture\"\nadvertised by the admissions office. Furthermore, within any given living group only so much time is\nspent carrying out elaborate hacks and dropping pianos off buildings, so the admissions propaganda has\nthe tendency to create an \"onslaught of incoming freshmen who are under the impression that the MIT\nof lore and the MIT of daily life are one and the same\" (Lin 2007). New freshmen are often\ndisappointed to realize how much time MIT students spend on mundane, \"culturefree\" activities like\ndoing homework and studying, as those tasks are not listed on the \"Student Life and Culture\" page.\nThe concept of a unified \"MIT culture\" homogenizes more than variations across student living\ngroups, however. \"MIT culture\" may be described as belonging anywhere on a spectrum from \"nerdy\"\nto \"technofetishistic\" (Csikszentmihalyi 2007), but it is rarely, if ever, described as intellectual.\nRosalind Williams, who in addition to being the former Dean of Undergraduate Education is currently a\n\nProfessor of the History of Science and Technology at MIT, phrases it as, \"MIT people are smart, but\nthey are generally not very intellectual in the sense of being interested in ideas\" (2002: 164). The 160\nother professors (Molina 2008) and 481 students (MIT Registrar's Office 2008) in MIT's School of\nHumanities, Arts, and Social Sciences (HASS) would probably object to this characterization of\nthemselves and their work - unless, of course, the intended interpretation is that they do not count as\nreal \"MIT people.\"3 As Sherry Turkle points out, \"within every culture, even a culture that wears a\ncollective badge of selfdenigration, there is a hierarchy\" (1984: 199), and students of disciplines that\ndo not fall into the welladvertised \"MIT culture\" of elaboratelyengineered hacks and homemade\nrobots may well find themselves feeling like they are at the bottom of this ranking. In the words of one\nWriting major:\n[T]here is the unspoken agreement that HASS classes aren't real classes; they're not the meat\nand potatoes of the 'tvte. 8.02 [Physics II]? Real. 18.03 [Differential Equations]? A little too\nreal. 21W.345 [Generic Writing course number]? Not real: HASS ... I have all this work to do\nfor my HASSes, and I can't even complain about it! The moment I try to speak up...someone\nelse says, \"Yeah, but that doesn't count, it's for a HASS.\" Like the Trix bunny, I hear nothing\nbut, \"Silly Bill, humanities aren't for real.\" (Andrews 2005)\nAs with the women and minority students who found themselves outsiders in the popular image of\n\"MIT culture\" that is frozen in time, humanists at MIT often find themselves conspicuously absent\nfrom the \"MIT culture\" advertised by the admissions office.\n3 My sophomore year I was invited to an Anthropology department presentation on the topic of Jews in Turkey, who often\nhide their religion from their nonJewish neighbors and coworkers. Asked if the Turkish Jewish experience was at all\nsimilar to the experience of being Black in America, the presenter replied, \"Not really, because you can't necessarily tell\nif someone is Jewish by looking at them. It's more like being gay in America,\" to which a professor chimed in, \"Or like\nbeing a humanist at MIT!\"\n\nHumanists are not the only group excluded from the homogeneously nerdy MIT of admissions\nadvertisements. Due to the the contemporary popular ideal of science as a secular mode of thinking that\nis \"explicitly grounded in rationalism and naturalism\" (Toumey 1994:19), students who subscribe to\nmodes of thinking that are not popularly perceived as being explicitly grounded in rationalism - such as\nreligion - also often feel like they do not belong in the sciencecentered MIT of lore. The difficulties\nChristian students at MIT have in reconciling their religious beliefs with their identities as scientists or\nengineers to their nonreligious classmates has been documented (Rubin 2007); it is not surprising that\nthey feel alienated from the popular ideal of \"MIT culture\" as based solely in science and technology,\ngiven that this ideal informs the (often negative) attitudes of other members of the MIT community\ntowards them. Consider a recent letter to the editor in MIT's student newspaper from MIT Professor Joe\nHaldeman:\nI was dismayed to read that MIT has decided, after a hundred years without, that it needs a\nchaplain.\nMIT is about science and engineering and mathematics. There is no place for belief in those\ndisciplines, only doubt -- we accept evidence but constantly test it.\nOur students, especially the ones from America, have grown up in cultures saturated with\nreligiosity. We should give them a little break from it while they're here.\nMIT needs religion like a bull needs mammaries.\n(Haldeman 2008)\nThis condemnation of religion as against the scientific principles of MIT is especially surprising given\nthat Haldeman is not a professor of science or engineering, but of Writing and Humanistic Studies.\nPerhaps this is simply a case of a member of one marginalized group condemning members of another\n\nmarginalized group to gain credibility with the dominant group (in this case, scientists and engineers),\nbut regardless of Haldeman's personal motivations, he could not have thought to submit such an\nunapologetically antireligion letter if faith was seen as an acceptable component of \"MIT culture.\" It is\ntelling that his letter did not receive any responses in defense of religion at MIT (or at least no\nresponses that were published). Along with the humanists, MIT students and professors who are\nreligious are not included in the homogeneously technoscientific \"MIT culture\" that is marketed to\npotential students.\n\"MIT Culture\" from Inside the Institute\nAn MIT surveyor once found the gates of Hell\nHe looked the devil in the eye, and said \"You're looking well\"\nThe devil looked right back at him, and said \"Why visit me\nYou've been through Hell already; you went to MIT!\"\n-\nVerse from MIT's fight song, We Are The Engineers\nWhile members of the MIT community often have a more nuanced understanding of MIT\nculture than that marketed by the admissions office, the way they use the term to explain MIT-related\nphenomena has a tendency to ignore the ways in which experiences have been constructed historically\nand have changed over time, [and] to rely on notions of authenticity and the return to positive values not\nrepresented by the dominant other in a way that has the potential to erase history (Abu-Lughod\n1991: 471).\nThis reductionist tendency is reflected in discussions of the culture of MIT's housing system. As\n\npreviously discussed, the undergraduate dormitories are divided into East and West, and Eastern\ndormitories are seen as having more history and traditions, or culture, than Western dormitories.\nDormitory culture is heavily influenced by each year's incoming freshmen class all freshmen are\nrequired to live in dormitories, and during the Residence Exploration portion of freshmen orientation\neach dormitory puts on a variety of events to showcase their unique culture and recruit freshmen who\nwould fit into it well, since freshmen are allowed to choose where they live. However, this system was\nnot always the case. Until 1998 freshmen also had the option of living in a fraternity or sorority, a\npolicy influenced by MIT's shortage of dormitory space for undergraduates (Resiberg 1998). But the\n1997 fatal alcohol poisoning of freshman Scott Krueger during a fraternity initiation resulted in the\npolicy being changed to the current requirement that all freshmen live in Institute dormitories.\nDiscussions of MIT dormitory culture often ignore the influence of this particular historical event on\nthe current housing policy, and speak of the cultures of different dormitories as if they always existed in\nthe form they currently do. Even discussions of dormitory culture and the housing system that include\nthe Scott Krueger incident tend to ignore the broader context of his death and its repercussions. They\nspeak of the time before his death as a glorious period of student independence, and accuse the MIT\nadministration of babying them in the freshmen on campus policy (e.g. Editorial in the Tech,\nNovember 8 2002). They ignore, or are unaware of, the fact that freshmen only used to be allowed to\nlive in fraternities as a cheap fix to MIT's housing shortage, and that the administration's decision to\nmandate on-campus housing for freshmen was not made in a vacuum. Rosalind Williams, who was\nDean for Undergraduate Education at the time of the incident and the ensuing freshmen on campus\n\ndecision, explains:\nWhile the MIT 'community' was deeply divided over the virtues of the MIT housing system, the\nsurrounding world the 'communities' of Boston and Cambridge concluded that the Institutes\nhad been irresponsible in its supervision of student living 'communities.' Whether through\nlicensing procedures, the criminal justice system, or insurance regulations, the demands of the\nlarger community proved more potent than any debates within MIT. In particular, Boston and\nCambridge authorities made clear their conviction that MIT freshmen had to live in a more\nsupervised setting.\n(2002: 161)\nAhistorical discussions of MIT dormitory culture obscure the historical and political events that shaped,\nand continue to shape, the reality of undergraduate life at MIT.\nMIT culture is used in a way that even more seriously obscures the influence of outside\nfactors in discussions of student suicides, a phenomenon that is perceived to be more prevalent at MIT\nthan at other universities4. Brain Hapgood summarizes the popular explanation for the prevalence of\nsuicides at MIT as:\nEvery institution has a certain range of acts that illuminate and amplify its cultural essence (in\nthe view of some fractions of the population) hazing incidents in fraternities, corruption in\nlegislatures, price fixing by businesses, etc. At MIT these are suicides...General interest\nreporters, who privately suspect that all that math would make anyone suicidal, never tire of\nplaying up the 'cost of excellence' angle, with its reassuring subtext about the dangers of\nworking hard in school. 'It's the John Wayne mentality, writ large,' one associate dean for student\naffairs said in an interview. 'Students put a lot of pressure on themselves here.'\n(1993: 19)\nThe conception that MIT culture forces students to put an unbearable amount of pressure on\nthemselves, pressure that some students feel can only be relieved by suicide, masks several factors that\ncomplicate the issue of suicides at MIT. For one thing, numerous studies have shown that MIT students\n4 When I decided to go to MIT my mother was distraught \"But you're so happy,\" she protested, \"I don't want you to kill\nyourself!\"\n\naren't actually more likely to commit suicide than students at other colleges (Jeffreys 2000) but the\npublicity received by several MIT student suicides (namely Elizabeth Shin, who set herself on fire in\n2000, and Julia Carpenter, who ingested cyanide in 2001) obscures that fact. But more importantly, the\nexplanation of the suicides that do occur as being a result of MIT culture ignores multiple factors that\ninfluence the rate of student suicides. After the publicity of the Shin and Carpenter suicides, MIT\ninstituted a number of suicide-prevention policies they increased the walk-in hours the mental health\ndepartment of MIT Medical was open, began programs to screen students for suicide risk, piloted a\nprogram to train MIT community leaders (including Graduate Resident Tutors, faculty, and\nadministrators) in suicide prevention, and launched a massive publicity campaign to make the student\nbody aware of the free, confidential mental health services they are entitled to at MIT Medical.\nUnsurprisingly, the rate of undergraduate suicides has decreased since the implementation of these\nchanges (Turner 2008), even though the idea of MIT culture as demanding excellence from students\nhas not changed. Furthermore, psychiatrists agree that most suicides are the result of clinical\ndepression, a neurochemical imbalance in the brain that may be exacerbated by a person's environment,\nbut is not entirely caused by it (National Institute of Mental Health 2004). Blaming student suicides on\nMIT culture implicitly ignores the underlying structural and biological causes of the problem and\nthereby implies that the problem is intractable, as when student Mike Hall decries MIT Medical's\noutreach campaign because it is spending money on the impossible task of changing our\nculture (2001). The success of the program, however, clearly does not support such a conclusion.\nLastly, internal Institute discourses of MIT culture as consisting of the traditions of student\n\nliving groups or an Institute-wide pressure for excellence obscures a critically important fact about the\nwork that occurs at MIT science and engineering are rooted in culture too. But discussions of MIT\nculture take for granted that science and engineering are context-free and completely objective, and\ntherefore good. Technological advancement is seen as a culture-free way to solve messy societal\nproblems (Downey 1998); in the words of Rosalind Williams, I cannot imagine a more pro-technology\nplace than MIT. At its core is a deep belief in the value of technology as the basis for human\nimprovement, and in technological analysis as the basis for problem solving (2002: 13). As numerous\nanthropologists and sociologists of science have demonstrated, technology is indeed deeply rooted in\nculture (e.g. Downey 1998), and the idea that science is a culture of no culture is patently untrue\n(Traweek 1988). Discussions of MIT culture are confined to the dormitories at the expense of\ndiscussing its impact in the laboratories, thereby perpetuating the myth that science and engineering\nexist in a world without loose ends, without temperament, gender, nationalism, or other sources of\ndisorder...a world outside human space and time (ibid.: 162).\nConclusion: Writing Against MIT Culture\nIn the words of Gary Downey, every image makes some things visible while hiding other\nthings (19998:5). The outside image of MIT culture as consisting of science and engineering nerds\nwho do nothing but work hides the existence of MIT students who do not conform to this outdated\nstereotype, such as women and minorities. The MIT culture that is marketed by the MIT Admissions\n\ndepartment makes visible the diversity of MIT students and the non-academic activities they engage in,\nbut homogenizes the complexity of the MIT dormitory system and hides the existence of humanists and\nreligious people at MIT. And the more nuanced version of MIT culture that is discussed within the\nInstitute hides the historical and political contextuality of MIT-related phenomena such as the housing\nsystem and student suicides, as well as obscures the culturally-influenced nature of science and\ntechnology itself. These problematic undertones of homogeneity, coherence, and timelessness (Abu-\nLughod 1991: 476) all indicate that it is time to begin writing against MIT culture.\nWorks Cited\nAbuLughod, Lila. 1991. Writing Against Culture. In Anthropology In Theory: Issues in Epistemology,\ned. Henrietta Moore and Todd Sanders. Blackwell, 2005, 466 - 479.\nAnahtar, Melis. \"NY Times Article on Women in Science.\" MIT Admissions Blogs.\nhttp://www.mitadmissions.org/topics/life/women_at_mit/ny_times_article_on_women_in_s.shtml\nAccessed 11 May 2008.\nAndrews, Bill. 18 October 2005. Imminent Collapse: Kickin' My HASS. The Tech, 125(47).\nAccessed 12 May 2008.\nAtkinson, W. P. 1875. \"Report on the Instruction in the Department of English.\" In MIT President's\nReport, 1873 - 1874. Boston: Press of A. A. Kingman.\nBrandon, Emily. 2007. MIT: Think of a Number. US News and World Report: America's Best Colleges\n2008.\nBrandon, Emily. 27 August 2007. MIT: Think of a Number. U.S. News and World Report,\n143(6), 105-106.\nBrett, Bill. 21 September 2007. \"MIT Student Arrested at Logan in Bomb Scare.\" Boston Globe,\nhttp://www.boston.com/news/globe/city_region/breaking_news/2007/09/mit_student_arr.html.\nAccessed 10 May 2008.\nhttp://tech.mit.edu/V125/N47/IC0547.html\n\nConcerning the Massachusetts Institute of Technology, Second Edition. 1912. Published by\nUndergraduates. New York: J. F. Tapley Co.\nCsikszentmihalyi, Chris. 22 September 2007. \"Star Simpson Helps Me Reanimate My Blog.\"\nhttp://web.media.mit.edu/~csik/edgy/?p=85, Accessed 10 May 2008.\nDowling, Claudia Glenn. 6 May 2005. MIT Nerds. Discover Magazine.\nhttp://discovermagazine.com/2005/jun/mitnerds/ Accessed 11 May 2008.\nDowney, Gary. 1998. The Machine in Me: An Anthropologist Sits Among Computer Engineers. New\nYork: Routledge.\nEditorial. 8 November 2002. \"The Reality of Freshmen on Campus.\" The Tech 122(54).\nAccessed 14 May 2008.\nHaldeman, Joe. 9 January 2008. Letter to the Editor: MIT Does Not Need a Chaplain. The Tech,\nccessed 12 May 2008.\nHall, Mike. 20 November 2001. Better State of Mind. The Tech, 121(61).\nAccessed 14 May 2008.\nHapgood, Freed.1993. Up the Infinite Corridor: MIT and the Technical Imagination. Reading, MA:\nAddisonWesley Publishing Company.\nJeffreys, Kathryn. 18 February 2000. MIT Suicides Reflect National Trends. The Tech, 120(6).\nAccessed 14 May 2008.\nLe Maison Francaise. 2008. Report to the Housing Strategy Group.\nhttp://mit.edu/dormcon/docs/culturalreports/french08.pdf Accessed 11 May 2008.\nLin, Michael T. 25 September 2007. Drunk With Culture: Signs You've Had Too Much. The Tech\n127(4\nAccessed 11 May 2008.\nLombreglia, Ralph. September 2007. \"The Turnaround is at Hand.\" Esquire, 134 - 147.\nMIT Minority Community. 2008. MIT Admissions: Explore and Discover MIT.\nhttp://www.mitadmissions.org/topics/life/the_mit_minority_community/index.shtml\n127(62) http://tech.mit.edu/V127/N62/letters.html\nA\nhttp://tech.mit.edu/V122/N54/edit54.54e.html\n\nA\nhttp://tech.mit.edu/V121/N61/col61mikeh.61c.html\nhttp://tech.mit.edu/V120/N6/comp6.6n.html\n1)\nhttp://tech.mit.edu/V127/N41/MichaelLin.html\n\nAccessed 11 May 2008.\nMIT President's Report, 1873 1874. Boston: Press of A. A. Kingman, 1875.\nMIT President's Report, 1941 - 1943. Published by the Institute: Cambridge.\nMIT President's Report, 1969 - 1970. Published by the Institute: Cambridge.\nMIT Registrar's Office. 2008. http://web.mit.edu/registrar/ Accessed 13 May 2008.\nMcPhee, Michele. 24 September 2007. \"Schools Baby Kids Born Under Lucky Star.\" Boston Herald,\nhttp://news.bostonherald.com/news/regional/general/view.bg?articleid=1033642,\nAccessed 10 May 2008.\nMolina, Jennifer. 2008. Personal Correspondance.\nNational Institute of Mental Health. 13 December 2004. Press Release: Mutant Gene Linked to\nTreatmentResistant Depression. http://depression.about.com/od/causes/a/mutantgene.htm\nAccessed 14 May 2008.\nRanade, Vinayak, and Hopp, Sarah. 2008. East Campus Culture Report 2008.\nhttp://web.mit.edu/vinayak/Public/EC/East_Campus_Culture_Report_2008.pdf\nAccessed 11 May 2008.\nReisberg, Leo. 6 November 1998. MIT's Inaction Blamed for Contributing to Death of a Freshmen.\nThe Chronicle of Higher Education. http://chronicle.com/free/v45/i11/11a05701.htm\nAccessed 12 May 2008.\nRubin, Caroline. 2007. 21A.218 Paper 3: Faith. Unpublished.\nAccessed 12 May 2008.\nStudent Life and Culture. 2008. MIT Admissions: Explore and Discover MIT.\nhttp://www.mitadmissions.org/topics/life/student_life_culture/index.shtml \\\nAccessed 11 May 2008.\nTaskforce on Student Life and Learning. http://web.mit.edu/committees/sll/\nTask Force on Student Life and Learning [committee report], September 1998\nhttp://ocw.mit.edu/NR/rdonlyres/Anthropology/21A-218JSpring-2007/E720A66F-D238-\n4769-BB01-7EE986E61382/0/paper3_faith.pdf\n\nTechnique Number 1. 1887.\nTechnique. 1942.\nThe Handbook of the Massachusetts Institute of Technology. 1918.\nThe Handbook of the Massachusetts Institute of Technology. 1928.\nThe Handbook of the Massachusetts Institute of Technology. 1929.\nThe Handbook of the Massachusetts Institute of Technology. 1931.\nToumey, Christopher P. 1994. God's Own Scientists: Creationists in a Secular World. Princeton: Rutgers\nUniversity Press.\nTraweek, Sharon. 1988. Beamtimes and Lifetimes: The World of High Energy Physicists. Cambridge,\nMA: Harvard University Press.\nTurkle, Sherry. 1984. The Second Self: Computers and the Human Spirit. New York: Simon and\nSchuster.\nTurner, Elijah Jordan. 13 May 2008. MIT Medical Works to Identify, Address Causes of Suicide. The\nTech, 128(26)\nhttp://tech.mit.edu/V128/N26/health/suicides.html\nAccessed 14 May 2008.\nWilliams, Clarence G. 2001. Technology and the Dream: Reflections on the Black Experience at MIT,\n1941 - 1999. Cambridge, MA: The MIT Press.\nWilliams, Rosalind. 2002. Retooling: A Historian Confronts Technological Change. Cambridge, MA:\nThe MIT Press.\nWomen at MIT. 2008. MIT Admissions: Explore and Discover MIT.\nhttp://www.mitadmissions.org/topics/life/women_at_mit/index.shtml Accessed 11 May 2008.\nWork/Play Balance at MIT. 2007. MIT Admissions: Explore and Discover MIT.\nhttp://www.mitadmissions.org/topics/life/workplay_balance_at_mit/index.shtml\nAccessed 12 May 2008."
    }
  ]
}