{
  "course_name": "Seminar in Geophysics: Mantle Convection",
  "course_description": "No description found.",
  "topics": [
    "Science",
    "Earth Science",
    "Geochemistry",
    "Geology",
    "Geophysics",
    "Physics",
    "Thermodynamics",
    "Science",
    "Earth Science",
    "Geochemistry",
    "Geology",
    "Geophysics",
    "Physics",
    "Thermodynamics"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 3 hours / session\n\nCourse Overview\n\nThese are exciting times for studies of the structure, composition, and evolution of Earth's deep interior. Seismic imaging, geodynamical modeling, and nobel gas analyses have provided spectacular new insight in the nature and scale of mantle convection. But despite the increased understanding and consensus within research groups there are significant outstanding issues, whose resolution requires cross-disciplinary study. For instance, geophysicists begin to concur on some form of whole mantle flow, whereas many geochemists favor a layered structure, with the lower and upper mantles separated from each other over long periods of geological time.\n\nFormat\n\nEach week faculty members of Harvard, Woods Hole Oceanographic Institution (\nWHOI\n), or MIT will lecture on the basic physics and chemistry pertinent to the topic of that particular week. These lectures will be followed by literature discussions under leadership of (groups of) students. In this way we aim to cover the basic science as well as digest a substantial fraction of the pertinent literature; the group structure stimulates student interaction and helps reducing communication problems that often complicate cross-disciplinary discussion.\n\nStudents work together in small (less than 4 students) cross-disciplinary, cross-institutional teams in order to improve the understanding and communication of multidisciplinary topics. The groups participate in the following activities:\n\nEvery week, one group is responsible for summarizing the faculty/staff lecture and the related discussions and for preparing material that can be posted on-line;\n\nEvery week, two (other) groups have a reading assignment (one or more papers, depending on length and difficulty) on the topic of the faculty/staff lecture. The students read and discuss the material; the student closest to the topic at hand (e.g., geochemistry) often has to educate his/her fellow students (who may be more familar with concepts of, say, seismology, mineral physics, or geodynamics) - and they present a 15 min summary to the rest of the class.\n\nThere is a mid-term assignment for the groups, which consists of summarizing the issues discussed during the first half of the semester and of working on a small research problem.\n\nThe final assignment takes the form of writing a \"research proposal.\" For this the students taking the class for credit need to reflect on the class, identify which problem are still open, and propose a research project that would address them.\n\nGrading\n\nGrades will depend on quality of the mid-term and final assignments, the group presentations, the lecture notes, and general participation in the discussions, and they are determined in a final meeting of all staff responsible for the class.",
  "files": [
    {
      "category": "Resource",
      "title": "030398_notes.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-570-seminar-in-geophysics-mantle-convection-spring-1998/7f02e4cc6ac42e0395ff2f26ad931c9e_030398_notes.pdf",
      "content": "Isotope systems and geochemistry\nLecture by Stan Hart\nJoint MIT, Harvard and WHOI seminar \"Mantle Convection\"\nSpring 1998\nNotes Prepared by Jamie Kellogg\nBulk Composition of the Earth\nRefractory Lithophile Elements\nTo understand the development of the Earth chemically, we must have some idea of\nwhere we started. The vast majority of the Earth is hidden from us, so we are left\ninferring the initial composition from more indirect sources. The classical approach is to\ninvestigate chemical trends in upper mantle-derived lherzolites (the depleted products of\nmantle differentiation) and meteorites. Specifically, ratios of Mg/Si, Al/Si, and Ca/Si are\nplotted against one another and a two reasonable linear trends are observed, one\nterrestrial and the other meteoritic. The intersection of the two trends is taken to represent\nthe primary upper mantle (PUM) composition. The intersection falls somewhere near the\nordinary CI carbonaceous chondrites, leading to the common statement that these reflect\nthe bulk composition of the Earth. There are two obvious weaknesses with this widely\napplied argument. The first is that we have no idea what process creates the meteorite\narray. The second is that in order to make a decent straight-line fit through the meteorite\narray, one is forced to ignore CM2, CV, and CO chondrites. There is no clear justification\nfor doing so. In fact, it is entirely possible that the meteorite array does not form a linear\ntrend at all, but rather curves. This would have rather profound impact on our\nunderstanding of the Earth. Brad Hager noted that these problems potentially reduce this\narea of geochemistry to the level of \"numerology.\"\n\nOxygen Isotopes\nAn alternative approach involves the use of oxygen isotopes. This data suggests that the\nbulk Earth more closely resembles enstatite chondrites, with only the upper mantle being\nrepresented by the composition described above. This view, which indicates a dramatic\nshift in composition from the upper to lower mantle, strongly favors a two-layered\nconvective system. In this case, the lower mantle would consist primarily of high-silica\nenstatite rather than perovskite. It is not obvious what the density contrast, and therefore\nthe propensity towards maintaining a sharply layered system, would be.\nPlumes and Mantle Taxonomy\nIf true in its purest interpretation, the two-layered picture of mantle convection would\ndeny us surface-dwellers any direct information whatsoever of its composition.\nConvention has it, however, that we do have at least one window to the lower mantle.\nPlumes, currently held responsible for hot spot volcanism around the world, carry\n\nmaterial from some thermal boundary layer (commonly taken to be the core mantle\nboundary (CMB) but sometimes suggested to be the 670 km discontinuity) and entrain\nmaterial on their way. This presents us with some integrated picture of the material in\nbetween. These plumes are much more heterogeneous than the source region for mid\nocean ridges, as evidenced by the much wider variation in isotopic composition of ocean\nisland basalts (OIB). When viewed in 10-dimensional isotopic space, consistent trends\nemerge in the data (due to similar methods of fractionation) and we find that we only\nneed 4 end member compositions to create the full range in basalts. Data are usually\nplotted based on their Sr, Nd, and Pb isotopic compositions, as these systems are\nrepresentative of the other isotopic dimensions. The extreme compositions are as follow:\n\nMid-Ocean Ridge Basalts\nMORB represents the most depleted (lacking in incompatible trace elements) of the\nbasalts. As such, it is characterized by low 87Sr/86Sr and high 143Nd/144Nd. MORBs\nare generally much more homogeneous than OIBs, although the Indian Ocean is notably\nmore heterogeneous and enriched in incompatible trace elements than either the Pacific\nor the Atlantic.\n\nHIMU\nHimu basalts are so named for their high U/Pb ratios, giving them anomalously high\n206Pb/204Pb and 207Pb/204Pb ratios. Sr and Nd ratios plot very close to the PUM\ncomposition. Type-islands include Tubuaii, Mangaia, and St. Helena.\n\nEM1\nThe first of the enriched (in incompatible trace elements) end members has extremely\nlow 143Nd/144Nd, moderately high 87Sr/86Sr, and very low 207Pb/204Pb and\n206Pb/204Pb ratios. Common examples are Pitcairn and the Walvis Ridge.\n\nEM2\nThere are very few samples which typify this intermediate Pb, extremely low\n143Nd/144Nd, extremely high 143Nd/144Nd basalt. Samoa and Taha (Societies) are\ngood examples, and Kerguelen trends towards EM2.\n\nWe can also look at the compositions for individual islands in more detail. Assuming that\nlinear trends (or \"worms\" in higher dimensional space) represent mixing lines, we can try\nto piece together the entrainment history of the plumes. Surprisingly, we commonly find\nthat these trends do not commonly implicate MORB as a mixing component, but rather\nsuggest that a poorly defined fifth composition is prevalent. This composition, called\nFOZO (for focal zone) or C (for common) is closer to the inferred bulk earth composition\nand may represent the dominant material in the lower mantle.\n\nFinally, we can look for deeper meaning in the isotopic signal through spatial correlation\nwith other observables. The simplest observation is that there is an isotopic bias,\nindicating higher levels of enrichment and greater heterogeneity in the southern\nhemisphere, concentrated near the equator. If we compare the geography of this \"DUPAL\nanomaly,\" we find that it correlates very well with lower mantle tomography, the geoid,\n\netc. However, one should be cautious of spherical harmonics based on a very limited\nnumber of sampling points.\n\nNote: Brad Hager also spoke in class on this day. His notes can be found in the Mantle\nConvection module of Geosystems home page."
    },
    {
      "category": "Resource",
      "title": "100298_notes.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-570-seminar-in-geophysics-mantle-convection-spring-1998/5e072934fe97903bc09fc782c90911fe_100298_notes.pdf",
      "content": "Accretion and core formation adds heat\nto the Earth, while mantle convection\nremoves it from the Earth's interior\n\nFormation of the Earth's mantle at about 4.6-4.5 Ga is\nthe result of a series of processes, including planetary\naccretion and core separation. These processes\ncollectively lead to a very hot outer shell of the Earth\nthat convected vigorously in order to remove heat from\nthe planet's interior. Below are some considerations\nregarding the the initiation of mantle convection.\n\n1 INITIAL STATE OF THE SOLAR\nNEBULA -- HOT\n-\nThe formation of our solar system was likely to be initiated by a supernova\ntrigger, causing the rotation and gravitational collapse of the proto-solar cloud to\nform a star (the sun).\n-\nThe presence of correlated short-lived isotope species in meteorites is most\nconsistent with a rapid Sun formation (< 1 Ma). These short-lived radio-nuclides\nwere likely to have been produced in a TP-AGB star (thermally pulsing -\nasymptotic giant branch star) and then injected into our proto-solar cloud.\n-\nThus, the inner solar system (e.g., 3- 4 AU) experienced high temperature\nprocessing, including the melting of grains, inclusions, and chondrules (high\ntemperature components of meteorites). These melted materials are likely\nproducts of bi-polar jets (@ ~ 3-4 AU) surrounding our early and rapidly formed\nsun.\n\n2 CONDENSATION AND ACCRETION\n-- HOT:\n-\nThe initial accretionary materials formed out of the solar cloud included high\ntemperature condensates of oxides, metals, and silicates. The earliest formed\nmaterials are chondrules and Ca-Al-inclusions (CAI), both with formation ages on\nthe order of < 3 Ma of T0 (where T0 = 4.6Ga, the age of our solar system).\n-\nThese initial condensates coalesced to form grains and larger sized fragments, and\nlater then planetismals and ultimately planets. Collisions of smaller planetismals\nto form larger ones and ultimately planets adds significantly to the energy budget\nof planets, much of this kinetic energy is converted to thermal energy and must be\ndissipated from the planet's interior.\n-\nMoon formation: it is commonly suggested that the Moon formed from a giant\nimpact event; a commonly invoked model considers a Mars-sized body hitting the\nEarth at about 4.5 Ga, with a fraction of the total mass fissioning off to form the\nMoon. In addition to the many other effects of such a process, this impact event\nhad enormous consequences for the heating of the Earth.\n-\nIf the Earth had a significant gaseous envelope surrounding it throughout most of\nits accretion, then this would have enhanced the chances of the upper portion of\nthe mantle having been wholly molten. The presences of such an atmosphere\nreduces the radiation of the Earth's internal heat to space and produces a magma\nocean scenario for the early Earth. Alternatively, if there is no surrounding\natmosphere, the planet'sheat is then rapidly lost to space by radiation and one\nmight expect little to no extensive melting of the mantle.\n3 CORE FORMATION:\n-\nThe Earth is assumed to have initially accreted as a mixture of silicates and metal\nparticles, with core separation following rapidly after much of the planet's\naccretion.\n-\nSeparation of the Earth Core heats up the mantle! Urey '52 (and later Elsasser '63;\nBirch '65; Flasar and Birch '73) realized that the gravitational energy released by\ncore formation would be converted into thermal energy (best estimate: ~640\ncal/gm), which would be enough to heat up the mantle by about 1000- 2000° C -\nthus driving mantle convection!\n-\nCore Formation is early: Elsasser '63 and Birch '65 both assumed that core\nformation was late, ~0.5 Ga after accretion. However, recent studies on short-\nlived radio-nuclides (e.g., 182Hf, 98Tc) constrain core formation to being on the\norder of 1-5*10E7 years.\n-\nChemical observations of the relative abundances of elements in the mantle are\nconsistent with the separation of an Fe-Ni alloy at mid to upper mantle conditions\ndue to intense heating of the planet. It is also likely that this alloy contained sulfur\n\nand other light element components, which reduces the melting temperature of\nthis alloy phase.\n4 MANTLE DIFFERENTIATION:\n-\nThe above considerations leads to the suggestion that the Earth's mantle\nexperienced large scale melting during accretion and core formation. Together\nthese processes start the convective engine for the mantle.\n-\nGiven the likely event of the outer portion of the mantle as having experienced\nglobal melting, then one would expect that the mantle would have also\nexperienced some degree of differentiation (crystal-liquid separation).\n-\nHowever, there is no geochemical and/or isotopic evidence, based on a wide\nspectrum of crustal and mantle rocks (including peridotites and komatiites), in\nsupport of this global differentiation process.\n-\nThus, if differentiation of the mantle occurred in the Hadean, then its effects have\nbeen completely erased by the processes of rapid and vigorous convection.\n5 ORIGIN OF THE NOBLE GASES IN\nTHE EARTH:\n-\nThe nature, origin, and composition of the Noble Gas (i.e., He, Ne, Ar, Kr, Xe)\nsignature in the present-day mantle and in the early Earth is not well understood.\nMuch of our discussion throughout this semester will rely on the models we\nassume for the past and present Noble Gas signature of the mantle.\n-\nDuring accretion Noble Gases were trapped in the incoming materials and some\namount of gases were ingassed into the planet from an assumed gaseous\nenveloped that was likely to have surrounded the early Earth. However, there are\nlarge gaps in our understanding of these early conditions and processes.\nMoreover, it is widely believed that presently we have degassed a substantial\namount (perhaps >95%) of our inherited gas component.\n-\nThe most powerful observation recently is that of Honda's et al (1992), in which\nthey demonstrated that the He-Ne isotopic systems are linked which means that,\nat least for these isotopes, the Earth inherited this gases from a solar component.\nThere still remains a question of whether the heavier Noble Gases have planetary\nor solar compositions.\n-\nThere are also considerable questions surrounding the amounts of Noble Gases in\ndifferent mantle reservoirs and, more importantly, the isotopic compositions of\nthese gases in the different mantle reservoirs. At best we are only placing limits\non the isotopic compositions of the Noble Gases in the mantle.\n\n6 COMPOSITION OF CHONDRITES\nAND PLANETS (an aside):\n-\nThe rocky planetary bodies (including the Earth) are assumed to be composed of\nchondritic materials. There are many different types of chondrites that contain\nvariable amounts of volatile components (see also the handout). Note: chondrites\nare made of a mixture of CAI and chondrules and differening amounts of matrix\nmaterial, which is where most of the volatile element component is found.\n-\nThe refractory elements (e.g., Ca, Al, Ti, Sc, Sr, Zr, Mo, REE, Re, Os, Th, U) are\nthose elements whose 50% condensation temperatures are above ~1300 K for an\nassumed partial pressure of oxygen (e.g., 10-4 atmospheres). Ratios of refractory\nelements (e.g., Ca/Al, Sm/Nd) are essentially equal in all the chondritic\nmeteorites, and by assumption the rocky planets.\n-\nThe non-refractory elements include, Mg, Si, Fe, O, and Ni as the major elements\nand, for example, Na, K, Rb, S, Cu, and Pb as trace elements. In chondritic\nmeteorites these elements show marked variations in absolute and relative\nabundances with respect to each other and with respect to the refractory elements.\nTherefore, there is a range of K/Rb, Rb/Sr and K/U values in chondritic\nmeteorites. Because of this the abundances of the non-refractory elements in\nplanets must be derived through various models.\n-\nThe refractory elements show isotopic homogeneity in meteorites, Earth, Moon\nand other planets. For example, the Earth and chondritic meteorites all have the\nsame Nd isotopic composition and likewise the same Hf isotopic composition,\nbecause they share chondritic ratios for Sm/Nd and Lu/Hf.\n-\nHowever, the non-refractory elements do not always show isotopic homogeneity.\nFor example, there is a considerable range of oxygen isotopic compositions in\nmeteorites. Oxygen is not considered a refractory element and thus the\nheterogeneity seen in O isotopes, like the heterogeneous distribution of volatile\nelements (inner rocky planets) reflect some of the nebula wide processes\nassociated with its early and rapid phase of initial cooling down and planetary\nformation stages. (Note, some of the variation seen in oxygen isotopic\ncompositions are due to parent body processes.)"
    },
    {
      "category": "Resource",
      "title": "100298_notes(2).pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-570-seminar-in-geophysics-mantle-convection-spring-1998/9ef7b6a62dbb9867dacf6722d21c0154_100298_notes%282%29.pdf",
      "content": "Accretion and core formation adds heat\nto the Earth, while mantle convection\nremoves it from the Earth's interior\n\nFormation of the Earth's mantle at about 4.6-4.5 Ga is\nthe result of a series of processes, including planetary\naccretion and core separation. These processes\ncollectively lead to a very hot outer shell of the Earth\nthat convected vigorously in order to remove heat from\nthe planet's interior. Below are some considerations\nregarding the the initiation of mantle convection.\n\n1 INITIAL STATE OF THE SOLAR\nNEBULA -- HOT\n-\nThe formation of our solar system was likely to be initiated by a supernova\ntrigger, causing the rotation and gravitational collapse of the proto-solar cloud to\nform a star (the sun).\n-\nThe presence of correlated short-lived isotope species in meteorites is most\nconsistent with a rapid Sun formation (< 1 Ma). These short-lived radio-nuclides\nwere likely to have been produced in a TP-AGB star (thermally pulsing -\nasymptotic giant branch star) and then injected into our proto-solar cloud.\n-\nThus, the inner solar system (e.g., 3- 4 AU) experienced high temperature\nprocessing, including the melting of grains, inclusions, and chondrules (high\ntemperature components of meteorites). These melted materials are likely\nproducts of bi-polar jets (@ ~ 3-4 AU) surrounding our early and rapidly formed\nsun.\n\n2 CONDENSATION AND ACCRETION\n-- HOT:\n-\nThe initial accretionary materials formed out of the solar cloud included high\ntemperature condensates of oxides, metals, and silicates. The earliest formed\nmaterials are chondrules and Ca-Al-inclusions (CAI), both with formation ages on\nthe order of < 3 Ma of T0 (where T0 = 4.6Ga, the age of our solar system).\n-\nThese initial condensates coalesced to form grains and larger sized fragments, and\nlater then planetismals and ultimately planets. Collisions of smaller planetismals\nto form larger ones and ultimately planets adds significantly to the energy budget\nof planets, much of this kinetic energy is converted to thermal energy and must be\ndissipated from the planet's interior.\n-\nMoon formation: it is commonly suggested that the Moon formed from a giant\nimpact event; a commonly invoked model considers a Mars-sized body hitting the\nEarth at about 4.5 Ga, with a fraction of the total mass fissioning off to form the\nMoon. In addition to the many other effects of such a process, this impact event\nhad enormous consequences for the heating of the Earth.\n-\nIf the Earth had a significant gaseous envelope surrounding it throughout most of\nits accretion, then this would have enhanced the chances of the upper portion of\nthe mantle having been wholly molten. The presences of such an atmosphere\nreduces the radiation of the Earth's internal heat to space and produces a magma\nocean scenario for the early Earth. Alternatively, if there is no surrounding\natmosphere, the planet'sheat is then rapidly lost to space by radiation and one\nmight expect little to no extensive melting of the mantle.\n3 CORE FORMATION:\n-\nThe Earth is assumed to have initially accreted as a mixture of silicates and metal\nparticles, with core separation following rapidly after much of the planet's\naccretion.\n-\nSeparation of the Earth Core heats up the mantle! Urey '52 (and later Elsasser '63;\nBirch '65; Flasar and Birch '73) realized that the gravitational energy released by\ncore formation would be converted into thermal energy (best estimate: ~640\ncal/gm), which would be enough to heat up the mantle by about 1000- 2000° C -\nthus driving mantle convection!\n-\nCore Formation is early: Elsasser '63 and Birch '65 both assumed that core\nformation was late, ~0.5 Ga after accretion. However, recent studies on short-\nlived radio-nuclides (e.g., 182Hf, 98Tc) constrain core formation to being on the\norder of 1-5*10E7 years.\n-\nChemical observations of the relative abundances of elements in the mantle are\nconsistent with the separation of an Fe-Ni alloy at mid to upper mantle conditions\ndue to intense heating of the planet. It is also likely that this alloy contained sulfur\n\nand other light element components, which reduces the melting temperature of\nthis alloy phase.\n4 MANTLE DIFFERENTIATION:\n-\nThe above considerations leads to the suggestion that the Earth's mantle\nexperienced large scale melting during accretion and core formation. Together\nthese processes start the convective engine for the mantle.\n-\nGiven the likely event of the outer portion of the mantle as having experienced\nglobal melting, then one would expect that the mantle would have also\nexperienced some degree of differentiation (crystal-liquid separation).\n-\nHowever, there is no geochemical and/or isotopic evidence, based on a wide\nspectrum of crustal and mantle rocks (including peridotites and komatiites), in\nsupport of this global differentiation process.\n-\nThus, if differentiation of the mantle occurred in the Hadean, then its effects have\nbeen completely erased by the processes of rapid and vigorous convection.\n5 ORIGIN OF THE NOBLE GASES IN\nTHE EARTH:\n-\nThe nature, origin, and composition of the Noble Gas (i.e., He, Ne, Ar, Kr, Xe)\nsignature in the present-day mantle and in the early Earth is not well understood.\nMuch of our discussion throughout this semester will rely on the models we\nassume for the past and present Noble Gas signature of the mantle.\n-\nDuring accretion Noble Gases were trapped in the incoming materials and some\namount of gases were ingassed into the planet from an assumed gaseous\nenveloped that was likely to have surrounded the early Earth. However, there are\nlarge gaps in our understanding of these early conditions and processes.\nMoreover, it is widely believed that presently we have degassed a substantial\namount (perhaps >95%) of our inherited gas component.\n-\nThe most powerful observation recently is that of Honda's et al (1992), in which\nthey demonstrated that the He-Ne isotopic systems are linked which means that,\nat least for these isotopes, the Earth inherited this gases from a solar component.\nThere still remains a question of whether the heavier Noble Gases have planetary\nor solar compositions.\n-\nThere are also considerable questions surrounding the amounts of Noble Gases in\ndifferent mantle reservoirs and, more importantly, the isotopic compositions of\nthese gases in the different mantle reservoirs. At best we are only placing limits\non the isotopic compositions of the Noble Gases in the mantle.\n\n6 COMPOSITION OF CHONDRITES\nAND PLANETS (an aside):\n-\nThe rocky planetary bodies (including the Earth) are assumed to be composed of\nchondritic materials. There are many different types of chondrites that contain\nvariable amounts of volatile components (see also the handout). Note: chondrites\nare made of a mixture of CAI and chondrules and differening amounts of matrix\nmaterial, which is where most of the volatile element component is found.\n-\nThe refractory elements (e.g., Ca, Al, Ti, Sc, Sr, Zr, Mo, REE, Re, Os, Th, U) are\nthose elements whose 50% condensation temperatures are above ~1300 K for an\nassumed partial pressure of oxygen (e.g., 10-4 atmospheres). Ratios of refractory\nelements (e.g., Ca/Al, Sm/Nd) are essentially equal in all the chondritic\nmeteorites, and by assumption the rocky planets.\n-\nThe non-refractory elements include, Mg, Si, Fe, O, and Ni as the major elements\nand, for example, Na, K, Rb, S, Cu, and Pb as trace elements. In chondritic\nmeteorites these elements show marked variations in absolute and relative\nabundances with respect to each other and with respect to the refractory elements.\nTherefore, there is a range of K/Rb, Rb/Sr and K/U values in chondritic\nmeteorites. Because of this the abundances of the non-refractory elements in\nplanets must be derived through various models.\n-\nThe refractory elements show isotopic homogeneity in meteorites, Earth, Moon\nand other planets. For example, the Earth and chondritic meteorites all have the\nsame Nd isotopic composition and likewise the same Hf isotopic composition,\nbecause they share chondritic ratios for Sm/Nd and Lu/Hf.\n-\nHowever, the non-refractory elements do not always show isotopic homogeneity.\nFor example, there is a considerable range of oxygen isotopic compositions in\nmeteorites. Oxygen is not considered a refractory element and thus the\nheterogeneity seen in O isotopes, like the heterogeneous distribution of volatile\nelements (inner rocky planets) reflect some of the nebula wide processes\nassociated with its early and rapid phase of initial cooling down and planetary\nformation stages. (Note, some of the variation seen in oxygen isotopic\ncompositions are due to parent body processes.)"
    },
    {
      "category": "Resource",
      "title": "170298_notes.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-570-seminar-in-geophysics-mantle-convection-spring-1998/c09a947e1783b6fd12df74cd35ac0704_170298_notes.pdf",
      "content": "Melting in the mantle\nLecture by Timothy L. Grove\nJoint MIT, Harvard and WHOI seminar \"Mantle Convection\"\nSpring 1998\nNotes Prepared by Clint Conrad, Mary Agner and Thorsten Becker\nIntroduction\nMelting in the mantle is a complex process which produces variable amounts of melted\nmaterial of different mineral composition depending on the conditions during the\nformation. Important points are:\n-\nThe melting process itself. Three melting styles are usually considered: Batch,\nfractional, and assimilative melting. Since melts react with solids as they ascend,\nthe time scale of melting becomes important.\n-\nThe temperature needed to melt mantle rock increases with pressure and hence\ndepth.\n-\nVolatiles (such as the best studied one, water) decrease the melting temperature.\nMelting is an inverse problem\nOne assumption involved in the interpretation of melt processes is that the melt samples\nthe conditions in which it was created directly prior to segregation.\nPetrologists determine the temperature when a rock is totally liquid for a given pressure\nin order to create a liquidus curve for that material. Basalts are liquids resulting from such\nmelting processes. The temperature at which basalts coexist with many crystals on the\nliquidus curve equals the temperature of melt extraction. (This concept is more complex\nthen noted by Herzberg and Zhang, 1996). Also, petrologists melt peridotites to\ndetermine the first melt composition.\nMelts of the mantle have different composition than the parent body. Peridotites are\nfound in stable cratons, extensional environments, and mid ocean ridges.\nThe problems in determining what exactly happens in the mantle when material melts\nare:\n-\nmelts are not \"batches\" from mantle resulting from one temperature and depth\n-\nmelt freezes as it rises and will crystallize out other minerals, altering the\ncomposition of the melt\n-\nmelt assimilates the mantle around it: It is not in equilibrium with the neighboring\nrock, since the melt temperature is above the solidus\n-\nmelt composition does not equal basalt composition\n\nBecause there are different pressure-temperature slopes for adiabatically ascending\nbodies and melting curves. We assume that the convection taking place in the mantle\nimplies adiabatic rise. The change in temperature with depth for silicate is around 0.3\ndegrees Celsius per kilometer. The slope for the melting curve, however, ranges from 1.3\ndegrees Celsius per kilometer to 5 degrees Celsius per kilometer. A decompression of 1\nGPa will give 90 degrees Celsius of superheat. This implies an output of work about 30\ncalories per gram. Using a change in enthalpy of fusion of 150 calories per gram, this\nimplies about 20% melt. Another assumption is that the time-scales in mid ocean ridges\nare approximately equal to spending rates.\nMelting Models\nThe two end-member cases are:\n-\nEquilibrium Batch Melting: Melt remains in contact with residual crystals at all\ntimes, so the bulk composition remains constant.\n-\nFractional Melting: Melt leaves the system as soon as it is formed, so the bulk\ncomposition of the residual solid changes continuously. Fractional melting\nrequires that the melt pockets get completely interconnected as soon as they are\nformed. In addition, the density of most melts is lighter than the residual only at\npressures less than about 8 GPa (250 km), with a large degree of possible\nvariation in this number. Thus, if melt occurs below this depth in a high\npermeability rock, the melt will sink and not rise to the surface. Melt connectivity\nis a function of the dihedral angle at edges of melt regions.\nBased on melt connectivity and permeability, and observations by Johnson et. al., 1990,\nfractional melting seems more likely to occur at ridges than batch melting. Most\nexperimental observations, however, assume batch melting, so it can be unclear how to\nrelate them to the earth.\nEquilibrium in Fe and Mg bearing systems\nMelt formation kinetics (and the final concentration of FeO and MgO in melts) can be\ndescribed by equilibriums constants as a function of activity parameters. They depend on\nthe temperature but to first order not on the pressure. Hence, deep melts from regions\nwith high temperatures are high in MgO and FeO as a temperature effect.\nEffects of Water\n-\nAdditional water lowers the melting temperature - adding only a little bit of water\ncan lower the melting temperature significantly\n-\nWater also allows melt to occur over a wider temperature range. The effects of\nwater depend critically on how much water you add and how you do it.\n-\nAdding water to the system almost completely erases the effect of pressure on\nmelt.\n-\nAdding water decreases the amount of FeO and MgO which goes into the melt.\nWhy does the mantle melt?\n\n-\nComputing the composition of the residual and the melt for fractional melting\nwith water begins to get very complicated. Back-computing the composition of an\noriginal rock from a residuum and a melt is even more complicated.\nReferences to papers\n-\nInoue, T. (1994): Effect of water on melting phase relations and melt composition\nin the system Mg_2SiO_3-MgSiO_3-H_2) up to 15GPa. PEPI, 85, 237-263\n-\nHerzberg, C. and Zhang, J. (1996): Melting experiments on anhydrous peridotite\nKLB-1: Compositions of magmas in the upper mantle and transition zone. JGR,\n101, B4, 8271-8295\n-\nJohnson, K. T. M., Dick, H. J. B. and Shimizu, N.(1990): Melting in the oceanic\nupper mantle: an ion microprobe study of diopsides in abyssal peridotites. JGR,\n95, B3, 2661-2678"
    },
    {
      "category": "Resource",
      "title": "170398_notes.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-570-seminar-in-geophysics-mantle-convection-spring-1998/6a3e68b129eb81fd706e80e98cd1f2ff_170398_notes.pdf",
      "content": "Mantle Convection and Plate Tectonics\nLecture by Shijie Zhong\nJoint MIT, Harvard and WHOI seimnar \"Mantle Convection\"\nSpring 1998\nNotes Prepared by Working Groups 1 and 2.\nBasic Features of Plates\nConvection in the mantle is bounded above by mechanically strong plates. These plates\nmove coherently, with uniform velocity within each plate and strong derivitives in\nvelocity at plate boundaries. These derivitives manifest themselves in plate convergence\n(subduction, thrust faulting), divergence (ridges, normal faulting), or horizontal sliding\n(strike-slip, transform faulting). The first two motions produce poloidal (convergence)\nmotion, while the latter produces toroidal (spin) motion. Toroidal motion is possible\nbecause the surface boundary layer is strong. Plate boundaries can migrate with respect to\nthe mantle and each other as the plates are consumed or produced, meaning that the plates\nchange in shape and size with time. The size of the plates, as a result, is highly variable.\nSmall plates such as the Cocos or Juan de Fuca plates have length scales of 1000 km or\nless while the Pacific plate is over 10000 km wide. The large plates mean that in some\nparts of the mantle, convection is occurring with a large aspect ratio. Because an aspect\nratio of one is energetically favorable for convection, we can ask the question: Why do\nwe have large plates? The answer certainly lies in the strength of the plates.\nPlate Rheology\nIt is of interest to try to apply a rheology to the lithosphere which will generate plate-\ntectonic behavior. If we simply use highly temperature-dependent viscosity, the cold\nupper thermal boundary layer will freeze and convection will occur only under a \"rigid\nlid\". If the temperature dependence is not strong enough, however, upwellings and\ndownwellings are not sufficiently localized at the surface and divergence and\nconvergence occurs in the interior of a plate. Stress-dependent (non-Newtonian power\nlaw) rheology is a possibity, but this rheology also allows divergence and convergence\nwhich is not completely localized at the plate boundaries. Another possibility is to impose\nweak zones at plate boundaries, but this requires that the location of these plate\nboundaries be determined before the calculation begins. It is also difficult to determine\nhow these plate boundaries can evolve with time, and how new plate boundaries can be\ngenerated. Thus, imposing plate boundaries with a different rheology than that of the\nplate interior is somewhat ad-hoc and not as satisfying as the achievement of a rheology\nwhich produces dynamically generated plate boundaries, as the Earth does.\n\nAnother rheology which can be used to generate plate tectonics is a stick-slip rheology,\nwhich is simply a non-Newtonian power law rheology with a power law exponent of -1.\nThis allows stress to decrease with increasing strain rate, so when stresses build up\nbeyond a certain point, the material is weakened and allows strain rates to increase, which\nfurther weakens the material. As a result, localized plate boundaries are formed, and the\nplates between them behave in a plate-like way. One problem with this rheology is that it\nis an instantaneous rheology - the plate boundaries have no memory of their past history.\nWe would expect real faults to be weaker than the surrounding material and to stay that\nway over long periods of time. The reimposition of stress on these faults should\nreactivate the fault. Thus, by imposing weak zones and by allowing these weak zones to\ncontinue to be weak and to move with the plates, we should be able to generate plate\ntectonics. Thus, we have two rheologies which give platelike behavior - one in which\nfaults are permanently weak (imposed weak zones) and one in which faults temporarily\nweak while they are being deformed (stick-slip rheology) but can be healed\ninstantaneously if the stresses go away. Reality probably lies somewhere in between, with\nfaults healing over some long period of time. How fault healing affects the style of plate\ntectonics is a somewhat open question.\nThe Dynamics of Slab Penetration of a Phase Change at 670 km\nThe endothermic phase change at 670 km depth (for slabs going downwards) offers\nresistance to slab penetration . Because the slab is colder than the surrounding mantle, it\ndoes not go through the phase change until it is deeper than 670 km. As a result, the\nportion of the slab below 670 km should slow the slab penetration. If this effect is strong\nenough, it could prevent slabs from penetrating the 670 seismic discontinuity and force\nthe upper and lower mantles to convect separately. The ability of a plate to descend past\n670 km depends on several quantities. First, a strong plate can more easily push through\nthe boundary because it will not be easily deflected at the phase change. Second, small\naspect ratio convection will be more affected by the phase change because small plates\nhave less negative driving buoyancy than do large plates due to the short cooling period\nthey have at the surface. Large plates have time to acquire thick thermal boundary layers,\nso their driving buoyancy may be enough to penetrate the boundary layer. An\nintermediate case between penetration and no penetration of the phase change is\nintermittent penetration in the form of \"avalanches\". Finally, the pattern of layered\nconvection has important implications for the interpretation of seismic tomography data.\nIf the cold temperatures at the base of slabs in the upper mantle are sufficient to generate\na downwelling in the lower mantle below the downwelling in the upper mantle, cold\ntemperatures should occur in an unbroken line which extends through the depth of the\nmantle. This line of cold material should show up in seismic tomography and could be\nincorrectly interpreted as whole mantle convection. This pattern of convection, however,\nrequires the upper and lower mantles to flow in opposite directions on either side of the\nphase change, a pattern which requires significant shearing of highly viscous mantle\nmaterial. As a result, we expect downwellings in the upper mantle to overly upwellings in\nthe lower mantle, which would be more energetically favorable and would not require\nshear across the phase change. If this layered convection pattern were to occur in the\nearth, it should be evident from seismic tomography, which does not appear to be.\nDynamically Generated Plate Boundaries"
    },
    {
      "category": "Resource",
      "title": "240298_notes.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-570-seminar-in-geophysics-mantle-convection-spring-1998/566808bbe0baae22c11bcaa6e89060f4_240298_notes.pdf",
      "content": "The lecture notes by Rick O'Connell follow below. Some\nof what Brad Hager covered (and much more!) can be\nfound in the Mantle Convection module of MIT's\nGeosystems home page (in particular, go to the syllabus\nand check out the lecture notes on \"Plate Tectonics\")."
    },
    {
      "category": "Resource",
      "title": "310398_notes.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-570-seminar-in-geophysics-mantle-convection-spring-1998/90bbbf6d0e14a1a04e7f9a19f4aba0c8_310398_notes.pdf",
      "content": "Subduction zones\nLecture by Rob van der Hilst\nJoint MIT, Harvard and WHOI seimnar \"Mantle Convection\"\nSpring 1998\nNotes Prepared by the group.\nObservations from seismology\nSubduction of oceanic lithosphere is one of the major driving forces of plate tectonics.\nOne result from these forces acting are earthquakes. The nature and location of these\nearthquakes and the resulting data coverage for tomography give us some very tangible\naspects of the convective mantle flow. Majority of earthquakes happen at plate margins\nand the deepest ones happen in subduction zones. Slabs penetrating into the mantle can\nbe traced and delineated simply by plotting the location of earthquake sources. These\nobservations can show some of the geometry of subduction, for example angle of\nsubduction and in some cases some flattening of the slab at depth.\nThe distribution and mechanisms of earthquakes\nThe distribution of earthquakes with depth is also very interesting. The first observations\nis that there are no earthquakes deeper than 700 km. This sharp cutoff in seismicity has\nsometimes been interpreted as evidence for layered convection, the slab simply doesn't\npenetrate deeper. Mechanism for stopping it could be a very steep clapeyron slope or a\nhigh density difference between the two layers. In either case one would expect some\ndeflection of the discontinuity on the order of few hundred kilometers and seicmicity\nshould be observed from those depths too. Very substantial piling up of material would\nalso occur above the phase transition. Other explanation that don't require the slab to be\nconfined to the upper mantle are for example that stress is released as the slab goes\nthrough the phase change, possibly because of reduction in grain size. These explanations\nseem more in accord with seismic observation that see fast material way beneath deepest\nearthquakes and possibly a change in the dip of slabs occurring around the same depth.\n\nThere is also a pronounced minimum in earthquake occurrence frequency around 300 km\ndepth. Earthquakes are often divided into two groups around this minimum, shallow and\ndeep. The earthquake mechanisms themselves along with locations are indicative of the\nstress state in the slab. Shallow earthquakes in slabs are predominantly tensional down\ndip and the deeper ones compressional down dip. In both cases the tensional/pressure axis\ntends to be oriented like the plate. A classical explanation for this observation has been\nthat as a cold slab goes through the exothermic phase change at around 410 km an extra\n\nload is created, pulling the plate down. The opposite happens at the endothermic 660 km\ndiscontinuity and the slab is retarded. Even though the slab is still sinking under its own\nweight at 660, it sinks slower than at 410, creating compression in the middle.\n\nThe focal mechanisms that seem to best fit those data is double coupling for earthquakes\nat all depths. For shallow earthquakes this can simply be explained with brittle failure. At\ndepth, temperatures and pressures are to high for brittle failure. The mechanics of deep\nearthquakes remain enigmatic but one explanation for the existence of fault planes at this\ndepth is large surfaces of metastable olivine collapsing to stable spinel. The subducted\nplate goes too fast through the 410 km discontinuity to let the olivine spinel transition\ntake place in equilibrium. The latent heat released by the first olivine to go through the\ntransition can even decrease the viscosity and increase the rate of subduction. The interior\nof the slab is colder than the surface and a metastable olivine wedge is created within it. It\nis buoyant creating compressional forces. Since the olivine can be way beyond its\nstability field at depth, the transformation to spinel can be very abrupt and sudden over\nlarge volume. Furthermore, volume decreases with the transformation and a surface can\nbe created with little mechanical coupling between the two sides giving rise to an\nearthquake, often with high stress drops. The frictional heat resulting from the movement\nalong the plane probably melts the surroundings, giving further lubrication. The fault\nplane area of deep earthquakes is often huge, sometimes larger than can be explained\nwith wedges inside a slab with thickness similar to a oceanic plates. This argument can be\ncircumvent with thickening of the slab above the 660, like mentioned before.\n\nLayered vs. whole mantle convection\n\nThe discontinuity at approximately 660 km is caused by the transformation of spinel to\nperovskite and magnesiowustite. It has often been postulated that this barrier of increased\ndensity and viscosity splits the mantle up in two convection cells, upper and lower\nmantle, with very little or no material flux across the boundary. The main arguments for\nthis have been some geochemical observations and the cutoff in seismicity around 700\nkm depth.\n\nImages from seismic tomography have on the other hand suggested that there is a lot of\nexchange of material between the upper and lower mantle. Some of them show a\ncontinuos, faster than average, structures stretching from known areas of subduction at\nthe surface and down to the core mantle boundary. Faster materials are generally\nconsidered to be colder than the surroundings. This is attributed to the change in elastic\nconstants, the resulting change in density goes in the other direction. It is difficult to\nexplain these images with thermal coupling between the two layers, since it is a relatively\nslow process. Continuous flow across the boundary is a lot simpler explanation and\ncorrelation with subduction history is often very good. This has been interpreted as\nevidence for whole mantle convection scheme, with no significant contributions from the\ndiscontinuities in the overall picture.\n\nWhen looked upon closer the style of mantle convection doesn't follow one of the end\nmember models completely. In the simplest cases with stationary trenches and well\ndefined geometries the slabs seem to go straight into the lower mantle. There may\nhowever be a slight hesitation and some thickening of the slab before it gains enough\nweight to cross the boundary.\n\nIn more complex situations there are other factors that determine some aspects of the\nflow. A plate that is overridden by a fast migrating trench is more likely to be flattened\nout and laid down along the 660 discontinuity. The exact position of the flattening seems\nto vary, above, along or beneath the discontinuity. In the end it looks like the pull of\ngravity overcomes the viscosity difference and the slabs penetrate into the lower mantle.\nThis control of lateral displacements on the surface has been confirmed with both\nnumerical and analog experiments. In this way the transition zone, coupled with rapid\nmotions and various geometries on the surface, distort the flow and makes it transient in\nnature. This complex feedback system with lot of short lived features can make it hard to\ndetermine a general style of subduction. The material flux between the upper and the\nlower mantle can be very uneven and change a lot in a relatively short time.\n\nMantle convection is very complicated and with many controlling factors. The two end\nmember models are not adequate in explaining all the observations. Some kind of a\ncompromise between them seems to be the best working model."
    },
    {
      "category": "Resource",
      "title": "reading_030398.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-570-seminar-in-geophysics-mantle-convection-spring-1998/f6e862f25d14a4d63e395c9800300ada_reading_030398.pdf",
      "content": "Reading assignments Stan Hart\n(03/03/1998)\nThe following papers will be discussed on Tuesday,\nMarch 17\n1. Hoffman, A., Mantle geochemistry: the message from oceanic volcanism, Nature,\n385, p. 219-229, 1997.\n2. Carlson, R.W. Mechanisms of Earth differentiation: consequences for the\nchemical structure of the mantle, Reviews of Geophysics, 32, p. 337-362, 1994.\n(Concentrate on the first section of the paper, pp338-345, titled \"Differentiation\naccompanying planet formation\", with the main questions to be asked being Are\nthe upper and lower mantles the same chemical composition or not? and Why is\nthis issue important for the discussion of the scale of mantle convection?.)\n3. Javoy, M., The integral enstatite chondrite model of the Earth Geophys. Res.\nLett., 22, 2219-2222, 1995.\n\nN.B. There is no class on Tuesday March 10th: instead of class, study\ncarefully the Davies & Richards '92 (see last week's assignment) and the\nCarlson '94 and Hoffman '97 (see below) papers. These are good overviews\nand we'll come back to them several times during this course.\nOther useful review articles that I can recommend are:\n-\nSilver, Carlson, and Olson, Deep slabs, geochemical heterogeneity, and the large\nscale structure of mantle convection: investigation of an enduring paradox, Rev.\nEarth Planet. Sci. 16, 477-541, 1988.\n-\nMontagner Can tomography tell us anything about convection in the mantle? Rev.\nGeophys., 32, 115-138, 1994."
    },
    {
      "category": "Resource",
      "title": "reading_050598.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-570-seminar-in-geophysics-mantle-convection-spring-1998/336e5c25157f1b02732d66e777402624_reading_050598.pdf",
      "content": "Reading assignment Tom Jordan\n(05/05/1998)\nIn the last regular session of this course/seminar series Tom Jordan will\npresent a lecture on seismological evidence for or against mantle\nstratification.\nNB: The format is different than used so far; please study the following\npaper and prepare questions that pertain either to this paper specifically\nor to the issues discussed in earlier sessions.\nThere are NO student presentations.\n- Puster, P. and T.H. Jordan, How stratified is mantle convection? J.\nGeophys. Res., 102, 7625-7646, 1997.\nYou can pick up reprints from the file holder on my door."
    },
    {
      "category": "Resource",
      "title": "reading_070498.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-570-seminar-in-geophysics-mantle-convection-spring-1998/c1478d10daea1c68427e604e022938a9_reading_070498.pdf",
      "content": "Reading assignment Louise Kellogg and\nStein Jacobsen (07/04/1998)\nFollowing are the papers that will be discussed on Tuesday April 14th.\nFor general reading:\nHarper and Jacobsen, Noble gases and earth's accretion, Science, 273,\n1814-1818, 1996.\n\nIf you want some supplementary reading containing more complex models\nof degassing than are contained in the assigned papers:\n- Kellogg and Wasserburg, The role of plumes in mantle helium\nfluxes, Earth Planet. Sci. Lett., 99, 276-289, 1990.\n- Porcelli and Wasserburg, Mass transfer of xenon through a steady-\nstate upper mantle, Geochim. Cosmochim. Acta, 59, 1991-2007, 1995\n(which takes the same approach using Xenon).\nPapers to be discussed:\nAs a pair:\n- Allegre, Hofmann, and O'Nions, The argon contraints on mantle\nstructure Geophys. Res. Lett., 23, 3555-3557, 1996.\n- Turcotte and Schubert, Tectonic implications of radiogenic noble\ngases in planetary atmospheres, Icarus, 74, 36-46, 1988.\n\nand\n- Farley, Natland, and Craig, Binary mixing of enriched and\nundegassed (primitive?) mantle components (He, Sr, Nd, Pb) in\nSamoan lavas, Earth Planet. Sci. Lett., 111, 183-199, 1992."
    },
    {
      "category": "Resource",
      "title": "reading_100298.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-570-seminar-in-geophysics-mantle-convection-spring-1998/c9cc359b94a98573d7a1122d85c61e90_reading_100298.pdf",
      "content": "Reading assignments: Introduction (10/02/1998)\nIn contrast to all subsequent meetings, there will be NO student\npresentations for the simple reason that student groups have not yet been\nformed. (This will be done at the first meeting.) Instead we have two\nlectures. However, to give you a flavor of some of the issues that will be\ndiscussed we assign the following reading material:\n● Van der Hilst et al., Evidence for deep circulation from global tomography, Nature , vol. 386, p.\n578-584, (April 10) 1997.\n● Masters, Tracking slabs in the lower mantle, Nature (News and Views), vol 386, p. 558, 1997.\n● Levi, B. G., Earth's upper mantle: How low can it flow?, Physics Today, vol. 50, p. 17-20, 1997."
    },
    {
      "category": "Resource",
      "title": "reading_140498.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-570-seminar-in-geophysics-mantle-convection-spring-1998/3b61435a2c7cc4020b0a5280f52e879e_reading_140498.pdf",
      "content": "Reading assignment Van der Hilst (14/04/1998)\nIn the week of 27 April 1998 we will have an open discussion on issues\npertinent to the scale of convection. The discussion will be triggered by\narguments pro and con layered convection as presented by two group of\nstudents.\nAs some additional reading, please study the following papers that use\nseismic images to support their view of the scale of mantle flow:\n● Wen, L., and D. L. Anderson, The fate of slabs inferred from seismic tomography and 130\nmillion years of subduction, Earth Planet. Sci. Lett., 133, 185-198, 1995.\n● Richards, M. A., and D. C. Engebretson, Large scale mantle convection and the history of\nsubduction, Nature, 355, 437-440, 1992.\n● Phipps Morgan, J., and P. M. Shearer, Seismic constraints on mantle flow and topography of the\n660-km discontinuity: evidence for whole-mantle convection, Nature, 365, 506-511, 1993."
    },
    {
      "category": "Resource",
      "title": "reading_170298.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-570-seminar-in-geophysics-mantle-convection-spring-1998/a6ea89aa59fcc1d53d92d397c61e9589_reading_170298.pdf",
      "content": "Reading assignments Grove (17/02/1998)\nThe following 3 papers provide a nice balance to the talk that Tim Grove will\ngive on Tuesday 17 Feb 1998. (N.B. The papers will be discussed on\nTuesday 24 Feb 1998.)\nOn depth of melting....\n● Herzberg and Zhang (1996) J. Geophys. Res. 101, 8271 - 8295.\nOn the effects of water....\n● Inoue (1994) Phys of Earth and Planet Interiors 85, 237-263.\nOn melting style....\n● Johnson et al. (1990) J. Geophys. Res. 95, 2661-2678."
    },
    {
      "category": "Resource",
      "title": "reading_170398.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-570-seminar-in-geophysics-mantle-convection-spring-1998/edd5b6429f00a2716240793518e52a9d_reading_170398.pdf",
      "content": "Reading assignment Hager and O'Connell\n(17/03/1998)\nAll should read pp. 164-180 of the Davies and Richards (1992) paper.\nInteraction of slabs with transition zone.\n● Kincaid, C. and P. Olson, An experimental study of subduction and slab migration, J. Geophys.\nRes., 92, 13832-13840, 1987.\n● Christensen,U.R., Influence of chemical buoyancy on the dynamics of slabs in the transition\nzone, J. Geophys. Res., 102, 22435-22443, 1997.\nAvelanges ....\n● Solheim, L. P. and W. R. Peltier, Avalanche effects in phase transition modulated thermal\nconvection: A model of Earth's mantle, J. Geophys. Res., 99, 6997-7018, 1994.\n● Tackley, P. J., D. J. Stevenson, G. A. Glatzmaier and G. Schubert, Effects of an endothermic\nphase transition at 670 km depth in a spherical model of convection in the Earth's mantle, Nature,\n361, 699-704, 1993.\nEffect of Plates and radial variations in viscosity.\n● Puster, P., B.H. Hager, and T.H. Jordan, Mantle convection experiments with evolving plates,\nGeophys. Res. Lett., 22, 2223-2226, 1995.\n● Bunge, H.-P., M.A. Richards, and J.R. Baumgardner, The effect of viscosity stratification on\nmantle convection, Nature, 379, 436-438, 1996."
    },
    {
      "category": "Resource",
      "title": "reading_240298.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-570-seminar-in-geophysics-mantle-convection-spring-1998/e0dc60ce6fb71ac29306e6f305824c62_reading_240298.pdf",
      "content": "Reading assignments O'Connell and\nHager (24/02/1998)\nThe following papers will be discussed on Tuesday, March 3, (N.B.\nEveryone should read the 1st & 3rd and skim the 2nd.)\nDavies, G. F., and M. A. Richards, Mantle Convection, J. Geol., 100, 151 - 206, 1992. [A\ngood general reference - we will discuss only pp 151- 164 next week - the rest will be\ndiscussed later.]\nParsons, B., and J. G. Sclater, An analysis of the variation of ocean floor bathymetry and\nheat flow with age, JGR, 82, 803 - 827, 1977.\nStein, S., and C. A. Stein, Sea-Floor depth and the Lake Wobegon effect, Science, 275,\n1613 - 1614, 1997.\nGroup 1:\n-\nStein, C. A., and S. Stein, A model for the global variation in oceanic depth and\nheat flow with lithospheric age, Nature, 359, 123 - 129, 1992.\nGroup 2:\n-\nMarty, J. C., and A. Cazenave, Regional variations in subsidence rate of oceanic\nplates: a global analysis, EPSL, 94, 301-315.\nGroup 3:\n-\nDoin, M. P., and L. Fleitout, Thermal evolution of the oceanic lithosphere: An\nalternative view, EPSL, 142, 121-136, 1996."
    },
    {
      "category": "Resource",
      "title": "reading_240298(2).pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-570-seminar-in-geophysics-mantle-convection-spring-1998/edb561730ace886231a4647d66c1d8d7_reading_240298%282%29.pdf",
      "content": "Reading assignments O'Connell and\nHager (24/02/1998)\nThe following papers will be discussed on Tuesday, March 3, (N.B.\nEveryone should read the 1st & 3rd and skim the 2nd.)\nDavies, G. F., and M. A. Richards, Mantle Convection, J. Geol., 100, 151 - 206, 1992. [A\ngood general reference - we will discuss only pp 151- 164 next week - the rest will be\ndiscussed later.]\nParsons, B., and J. G. Sclater, An analysis of the variation of ocean floor bathymetry and\nheat flow with age, JGR, 82, 803 - 827, 1977.\nStein, S., and C. A. Stein, Sea-Floor depth and the Lake Wobegon effect, Science, 275,\n1613 - 1614, 1997.\nGroup 1:\n-\nStein, C. A., and S. Stein, A model for the global variation in oceanic depth and\nheat flow with lithospheric age, Nature, 359, 123 - 129, 1992.\nGroup 2:\n-\nMarty, J. C., and A. Cazenave, Regional variations in subsidence rate of oceanic\nplates: a global analysis, EPSL, 94, 301-315.\nGroup 3:\n-\nDoin, M. P., and L. Fleitout, Thermal evolution of the oceanic lithosphere: An\nalternative view, EPSL, 142, 121-136, 1996."
    },
    {
      "category": "Resource",
      "title": "reading_310398.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-570-seminar-in-geophysics-mantle-convection-spring-1998/26135a6f5d36be3e46e7419ec90fb4f6_reading_310398.pdf",
      "content": "Reading assignment Van der Hilst (31/03/1998)\nFollowing are three short papers for the presentations. In addition to this, all\nshould read the review paper by Thorne Lay:\nLay, T., The fate of descending slabs, Annu. Rev. Earth Planet. Sci. , 22, 33\n61, 1994.\nNB. With the exception of the Wick & Richards paper, copies of all paper are\nin the file holder at my door (Rm 54-514). If you take these to make xeroxes,\nPLEASE RETURN THEM so that others can use them too!\nInteraction of slabs with transition zone:\n● Van der Hilst, Complex motphology of subducted lithosphere in the mantle beneath the Tonga\ntrench, Nature, 374, 154-157, 1995.\nTopography of 660 km discontinuity:\n● Wicks, Jr., C. W, and M. A. Richards, A detailed map of the 660-km discontinuity beneath the\nIzu-Bonin subduction zone, Science, 261, 1424-1427, 1993.\nChemical boundary?\n● Castle, J., and K. C. Creager, Seismic evidence against a mantle chemical discontinuity near 660\nkm depth beneath Izu-Bonin Geophys. Res. Lett., 24, 241-244, 1997."
    }
  ]
}