{
  "course_name": "Semiconductor Manufacturing",
  "course_description": "6.780 covers statistical modeling and the control of semiconductor fabrication processes and plants. Topics covered include: design of experiments, response surface modeling, and process optimization; defect and parametric yield modeling; process/device/circuit yield optimization; monitoring, diagnosis, and feedback control of equipment and processes; and analysis and scheduling of semiconductor manufacturing operations.",
  "topics": [
    "Engineering",
    "Chemical Engineering",
    "Process Control Systems",
    "Electrical Engineering",
    "Electronics",
    "Materials Science and Engineering",
    "Electronic Materials",
    "Systems Engineering",
    "Computational Modeling and Simulation",
    "Engineering",
    "Chemical Engineering",
    "Process Control Systems",
    "Electrical Engineering",
    "Electronics",
    "Materials Science and Engineering",
    "Electronic Materials",
    "Systems Engineering",
    "Computational Modeling and Simulation"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nCourse Expectations\n\nClass Meetings\n\nThe class meets twice a week for 1.5 hours a session. In-class activities will include both lecture and discussion on specific topics. There is no required text for the course; handouts will include excerpts from literature papers and appropriate references. Recommended texts will be noted.\n\nProblem Sets\n\nStudents will be expected to complete the assigned problem sets on the related lecture material. These are essential to building familiarity with the methods and techniques of semiconductor manufacturing. These are due at the beginning of class, usually on Wednesday.\n\nQuizzes\n\nTwo quizzes are planned, to be held in class during the regularly scheduled class time. They are scheduled for Wednesday, after lecture #9 and Wednesday, after lecture #19. No final exam is scheduled.\n\nCritical Paper Review\n\nTo encourage the ability to read - carefully and with a critical eye - the technical literature in semiconductor manufacturing, each student will be asked to write a critical review on one paper of interest to the student, from a selection of recent technical journal issues.\n\nFinal Project\n\nA final project in the last four weeks of the term will be undertaken rather than a final exam. Projects will be proposed by students, and should emphasize the collection (e.g. via the literature or other means) and analysis of manufacturing data (which may be equipment, factory, or operational in nature). Projects where the methods and techniques from the course are applied are of key interest. The final project will include (1) submission of a short project definition (one page maximum); (2) preparation of a final written report in a technical paper format; these reports will be compiled and issued to the class as a take-home artifact from the course; and (3) an oral presentation by each student.\n\nPolicy on Team Work and Collaboration\n\nTeam learning and problem solving are encouraged. However, it is important, particularly on the problem sets, that each student fully understand the material and complete their own write up of solutions to be handed in. Collaboration on the quiz is not allowed. Team projects of a substantial nature will be considered.\n\nAcknowledgements and Inspirations\n\nEE290H - Costas Spanos and Kameshwar Poolla\n\nImportant sections of this course, particularly elements on statistical background, statistical process control charts, and experimental design methods are drawn from material developed by Prof. Costas Spanos in his course EE290H \"Special Topics in Semiconductor Manufacturing,\" at UC Berkeley. The development of that course serves as inspiration and a shining example, in addition to the source for specific lecture material, for this course at MIT.\n\nMany of the statistical and control charting figures in both the MIT and Berkeley courses are drawn from the reference\nIntro to Statistical Quality Control\n, D. C. Montgomery, Wiley, 1985.\n\nMIT Leaders for Manufacturing\n\nThe LFM Research Program, including RG4 - Variation Reduction, RG5 - Manufacturing Systems, and the LFM/SIMA Remote Monitoring and Diagnosis Project are key research resources that helped drive development of this course. Case materials from LFM internship projects are also utilized in this course. The contribution of curriculum development funds in 1997 by LFM is gratefully acknowledged.\n\nNSF/SRC Engineering Research Center on Environmentally Benign Semiconductor Manufacturing\n\nMaterial on the environmental and factory issues in semiconductor manufacturing draw on course development work at the University of Arizona, in collaboration with research partners at MIT, Stanford, and UC Berkeley, in the NSF/SRC Engineering Research Center on Environmentally Benign Semiconductor Manufacturing. In particular, a course under the leadership of Tom Peterson at the Univ. of Ariz. is an important interaction with this course.",
  "files": [
    {
      "category": "Resource",
      "title": "crit_review.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-780-semiconductor-manufacturing-spring-2003/07db8b67e3acda2b972ffcbc8cd5dca5_crit_review.pdf",
      "content": "6.780\nSemiconductor Manufacturing\nSpring 2003\nCritical Paper Review\nIssued: Friday, March 21, 2003\nDue: Wednesday, April 16, 2003\nThe purpose of this assignment is for you to demonstrate an ability to read, with a critical eye, the current\ntechnical literature in semiconductor manufacturing. You will select a paper of your choice from a recent\njournal (e.g. IEEE Trans. on Semiconductor Manufacturing) that makes use of statistical analysis or mod-\neling methods. You can access the Transactions and several other related journals through the MIT librar-\nies. From libraries.mit.edu, access Vera, and then search for \"semiconductor manufacturing\". If you\nwould like to browse a set of hard copies, recent volumes of the Trans. on Semiconductor Manufacturing\nwill be available in my office.\nYou will summarize the goals and statistical/analytical methods used in the paper you are reviewing. You\nshould also analyze the effectiveness of these methods, and make suggestions as to improvements or next\nsteps in these methods or research that might be appropriate.\nYour critical review should be approximately 8 to 12 pages in length, and you should feel free to include\nan appropriate subset of figures from the paper you are reviewing, with citation of course. The submis-\nsion of your critical review will be made electronically.\nI will assemble the collection of these critical reviews and make them available to the entire class; thus an\nimportant part of the review is to convince your audience of the valuable ideas or aspects of the paper you\nare reviewing, as well as to provide any insight you develop into the limitations or extensions of these\nmethods.\nDeadlines:\n-\nFriday, April 4: email with a citation for the paper you are reviewing.\n-\nWednesday, April 16: submit your critical review write up."
    },
    {
      "category": "Resource",
      "title": "ps1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-780-semiconductor-manufacturing-spring-2003/bcaef9ad5208af217723ae58a041b8f3_ps1.pdf",
      "content": "Problem Set #1\nIssued: Friday, Feb. 7, 2003\nDue: Wednesday, Feb. 12, 2003\nPlease write and hand in solutions to the following problems or scenarios. Write your solutions from the\nperspective of an engineer sending an explanation to a coworker (or a customer, or a supplier) of your\nsolution. That is to say, you must write supporting text explaining equations and formulas that you use; a\nfew mathematical expressions and a number or plot at the end will not earn full credit.\nProblem 1\nA random sample of 20 die is non-destructively examined from each wafer lot at the end of the process.\nGiven that the die yield of the process is 97%, calculate the probability that we will find less than three\ndefective die in this sample.\nProblem 2\nPart a. Use a statistics or mathematics package (e.g. JMP, Splus, Excel, Matlab) to generate 20 samples\nxi, i = 1 to 20, where each xi is independent and identically distributed as a normal distribution with mean\n11 and standard deviation 2, i.e.\n. We will take these as measurements of the dielectric con-\nstant of the polysilicon layer on each wafer in a 20 wafer lot. Prepare a table with your sample measure-\nments, and calculate , the sample mean, and\n, the sample standard deviation. Plot (using your stats/\nmath package) a histogram of your 20 values. Does the distribution appear normal?\nPart b. Generate a sample yi, i = 1 to 100 from the same assumed distribution,\n. You do not\nneed to show the specific 100 values, but plot a histogram of the observed values. Are the sample mean\nand sample standard deviation\ncloser to the \"true\" population values of 11 and 2 than with your earlier\nsample of size 20? Does this surprise you?\nPart c. Treat the measurements from part a as samples from lot 1. Create nine more 20 sample data sets;\nall together, these ten sets of 20 measurements represent the measurements from each of lots j = 1 to 10.\nPrepare a table showing your ten sample means\nand sample standard deviations\n, as well as the\nsample variances\n.\nPart c-1: Plot a histogram of your ten sample means. What is the mean and standard deviation across the\nobserved values\n? What would you ideally expect for the form (as well as the mean and standard devi-\n6.780\nSemiconductor Manufacturing\nSpring 2003\nxi\nN 11 4\n,\n(\n)\n∼\nx\nsx\nyi\nN 11 4\n,\n(\n)\n∼\ny\nsy\nxj\nsxj\nsxj\nxj\n\nation) of the distribution of your histogram, given the \"true\" population distribution from which the orig-\ninal measurements came?\nPart c-2: Plot a histogram of your ten sample variances. What would you ideally expect for the form of\nthe distribution of your histogram of variances, given the \"true\" population distribution from which the\noriginal measurements came?\nProblem 3\nThis problem is almost the same as problem 2, except in this case the underlying \"true\" distribution is a\nPoisson distribution, representative of the number of particles detected on each wafer.\nPart a. Use a statistics or mathematics package (e.g. JMP, Splus, Excel, Matlab) to generate 20 samples\nxi, i = 1 to 20, where each xi is independent and identically distributed as a Poisson distribution with mean\n4, i.e.\n. We will take these as measurements of the number of particles greater than 1μm in size\ndetected on each wafer in a 20 wafer lot. Prepare a table with your sample measurements, and calculate\n, the sample mean, and\n, the sample standard deviation. Plot (using your stats/math package) a histo-\ngram of your 20 values. Does the distribution appear normal? Poisson? Does the sample mean and stan-\ndard deviation you calculated for your set of 20 values support the idea that the underlying distribution is\nPoisson distributed?\nPart b. Generate a sample yi, i = 1 to 100 from the same assumed distribution,\n. You do not\nneed to show the specific 100 values, but plot a histogram of the observed values. Are the sample mean\nand sample standard deviation\ncloser to the \"true\" population values (4 and 2 for the mean and stan-\ndard deviation, respectively) than with your earlier sample of size 20? Does this surprise you?\nPart c. Treat the measurements from part a as samples from lot 1. Create nine more 20 sample data sets;\nall together, these ten sets of 20 measurements represent the measurements from each of lots j = 1 to 10.\nPrepare a table showing your ten sample means\nand sample standard deviations\n.\nPart c-1: Plot a histogram of your ten sample means. What is the mean and standard deviation across the\nobserved values\n? What would you expect for the approximate form (as well as the mean and standard\ndeviation) of the distribution of your histogram, given the \"true\" population distribution from which the\noriginal measurements came?\nxi\nP 4\n( )\n∼\nx\nsx\nyi\nP 4\n( )\n∼\ny\nsy\nxj\nsxj\nxj"
    },
    {
      "category": "Resource",
      "title": "ps2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-780-semiconductor-manufacturing-spring-2003/31052f8ec056daf99d2bc73a3a67a3e6_ps2.pdf",
      "content": "6.780\nSemiconductor Manufacturing\nSpring 2003\nProblem Set #2\nIssued: Wednesday, Feb. 12, 2003\nDue: Friday, Feb. 21, 2003\nPlease write and hand in solutions to the following problems or scenarios. Write your solutions from the\nperspective of an engineer sending an explanation to a coworker (or a customer, or a supplier) of your\nsolution. That is to say, you must write supporting text explaining equations and formulas that you use; a\nfew mathematical expressions and a number or plot at the end will not earn full credit.\nProblem 1\nWe are considering the recalibration of a low-pressure chemical vapor deposition (LPCVD) furnace. The\nfurnace will be shut down for repairs if a significant difference is found between the thermocouple read\nings that are controlling the deposition temperature at the two ends of the tube. The following tempera\ntures have been measured during a test run:\nTable 1: Measured Left/Right Temperatures in LPCVD Test Run (°C)\nLeft\n606.5\n605.0\n605.5\n605.5\n606.2\n606.5\n603.7\n607.7\n607.7\n604.2\nRight\n604.0\n604.5\n605.5\n605.7\n605.5\n605.2\n606.0\n606.5\n607.7\n604.2\nPart a. Do these temperatures have the same mean on both ends of the tube? (α = 0.05)\nPart b. Find the 90% confidence interval of the ratio of the two variances (Left/Right).\nPart c. Find the sample size needed to confirm a 1°C deviation with a β of 10% when the σ is known to\nbe 1°C (assuming α = 0.05 as in part a).\nProblem 2\nA normally distributed quality characteristic is monitored by a control chart with 3-σ control limits.\nPart a. Develop a general expression for the probability that a point will plot outside the control limits\nwhen the process is really in control.\nPart b. Develop a general expression for the probability that 2 out of 3 consecutive points will lie on the\nsame side of the center line, but outside the 2-σ line, when the process is really in control (this is the\nWECO #2 rule)."
    },
    {
      "category": "Resource",
      "title": "ps2sol.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-780-semiconductor-manufacturing-spring-2003/a3bcee421f2cdc101cd0a0f505c4688f_ps2sol.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "PS3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-780-semiconductor-manufacturing-spring-2003/5ec2c1cb495bbfbd0e50367ac1d5dc63_PS3.pdf",
      "content": "Problem Set #3\nIssued: Monday, Feb. 24, 2003\nDue: Monday, March 3, 2003\nProblem 1\nAn In-Situ Particle Monitor (ISPM) is a device used in the exhaust of vacuum processing equipment such\nas plasma etchers, LPCVD tubes, etc. The ISPM employs a laser beam to count particles with a certain\nsize range. In applying the device to a plasma etcher, suppose we find that the average number of parti-\ncles (>0.20μm in diameter) is 5/minute during the main etch step, and a total of 35 during the purge step.\nDesign an appropriate SPC scheme that will use the particle count information from these two steps and\nwill generate false alarms 1% of the time. Explain all the assumptions that you make.\nProblem 2\nControl charts for and R are maintained for the thickness (in Angstroms) of a copper seed layer used\nprior to copper electroplating. The sample size is n=7 and , and R are computed for each sample. After\n35 samples, we have found that\n(a) Set up and R charts using these data.\n(b) Assuming that both charts exhibit control, estimate the process mean and standard deviation.\n(c) If the seed thickness is normally distributed and if the specifications are\n, can the process\nmeet the specifications? What is the process capability ratio? Estimate the fraction nonconforming.\n(d) Assuming the variance to remain constant, where should the process mean be located to minimize the\nfraction nonconforming? What would be the value of the fraction nonconforming under these conditions?\nThe process capability ratio under the same conditions?\n6.780\nSemiconductor Manufacturing\nSpring 2003\nx\nx\nxi\ni\n=\n∑\n=\nand\nRi\ni\n=\n∑\n=\nx\n±\n\nProblem 3\nThe following and S charts based on n=4 have shown statistical control:\n(a) Estimate the process parameters μ and σ.\n(b) If the specifications are at\n, and the process output is normally distributed, estimate the frac-\ntion nonconforming.\n(c) For the chart, find the probability of a type I error, assuming σ is constant.\n(d) Suppose the process mean shifts to 693 and the process standard deviation simultaneously shifts to 12.\nFind the probability of detecting this change on the chart on the first subsequent sample. What is the\naverage run length (ARL) for detecting this shift?\n(e) For the shift of part (d), find the probability of type II error.\nProblem 4\nPhotoresist thickness is spun on wafers during photolithographic sequences. After the spin, any wafer\nwith resist thickness less than 1.6μm is cut out of the wafer track for possible rework. The resist thick-\nnesses of 25 successive wafer are shown below. Set up a moving range control chart and a control chart\nfor individuals. Estimate the mean and standard deviation of the resist thickness. If the process remains in\ncontrol at this level, what percentage of wafers will be reworked?\nchart\nS chart\nUCL = 710\nUCL = 18.08\nCL = 700\nCL = 7.979\nLCL = 690\nLCL = 0.000\nWafer #\nResist\nThickness\nWafer #\nResist\nThickness\nWafer #\nResist\nThickness\n1.611\n1.610\n1.612\n1.608\n1.609\n1.610\n1.612\n1.607\n1.608\n1.610\n1.613\n1.607\n1.610\n1.612\n1.611\n1.611\n1.610\n1.613\n1.612\n1.608\n1.610\n1.609\n1.613\n1.612\n1.615\nx\nx\n±\nx\nx\n\nProblem 5\nIn the semiconductor industry, the production of integrated circuits involves many steps, some of which\noccur on batch processing equipment, and some of which take place on single wafer processing equip-\nment. In each case, a production lot consisting of typically 25 wafers travels the process sequence\ntogether. It is usually necessary to estimate several components of variation: within-wafer, between\nwafer, between lot, and the total variation. For this problem, you can assume that the lot to lot variation is\nrandom and normal, the wafer to wafer variation is random and normal, but the site to site (or within\nwafer) variation has both a fixed systematic spatial component as well as random and normal variation.\n(a) Suppose that one wafer is randomly selected from each lot and that a single measurement on a critical\ndimension of interest is taken (assume that the same location is measured on each seclected wafer).\nWhich components of variation could be estimated with these data? What type of control charts would\nyou recommend?\n(b) Suppose that the randomly selected wafer from the lot is instead tested at five locations (say, the cen-\nter and four points at the circumference). The average and range of these within-wafer measurements are\nxWW and RWW, respectively. What components of variability are estimated using control charts based on\nthese data?\n(c) Suppose that one measurement point on each wafer is used (again, assume this is at some fixed loca-\ntion on the wafer) and that this measurement is recorded for three randomly selected wafers from each\nlot. The average and range of these between-wafer measurements are xBW and RBW, respectively. What\ncomponents of variability are estimated using control charts based on these data? Would it be necessary\nto run separate and R charts for all five locations on the wafer?\n(d) Consider the question in part (c). How would your answer change if the test sites on each wafer were\nrandomly selected and varied from wafer to wafer?\n(e) What type of control charts and rational subgroup scheme would you recommend to control the lot-to-\nlot variability?\nAcknowledgements: Problems 3 and 4 are based on Exercises 5-44 and 5-45 in D. Montgomery, \"Intro-\nduction to Statistical Quality Control,\" Third Edition, Wiley, 1996.\nx"
    },
    {
      "category": "Resource",
      "title": "ps3sol.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-780-semiconductor-manufacturing-spring-2003/851eeb6899aef43f0759af5ca613363c_ps3sol.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "PS4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-780-semiconductor-manufacturing-spring-2003/143f9d1c9a54e34bd62e4ef490d613b3_PS4.pdf",
      "content": "Problem Set #4\nIssued: Monday, March 3, 2003\nDue: Wednesday, March 12, 2003\nProblem 1\nWorking with an excimer laser stepper, you have determined that linewidth measurements and random\nvariation show a standard deviation of 0.04 μm. Using a mask with 0.18 μm lines, the average measured\npolysilicon linewidth is 0.20 μm. You are contemplating a switch to a different photoresist, hoping it will\ngive you linewidths closer to the mask pattern. You will be willing to switch to the new resist only if you\nsee a 0.02 μm improvement (i.e. your measured pattern goes from 0.20 μm to 0.18 μm) with α=0.05 and\nβ=0.05. How many samples done with the new process do you need for this experiment?\nProblem 2\nA process engineer determined the following entries in an ANOVA table for some data he collected from\na randomized block design (to guard against differences in the different tools used to conduct the experi-\nment). The treatment averages for the responses were 55, 68, 56, 66, and 55.\n(a) Complete the ANOVA table. (Note: it is possible to determine all non-shaded entries.)\n(b) Based on the probability of observing the F-ratio for the treatments, does the engineer have evidence\nthat there is a treatment effect (that is to say, that the treatment as a whole matters)? A block effect?\n(c) Construct and describe the relevant reference distribution for the treatment averages. That is to say,\nwe would like to know how\nis distributed (where the subscript t indicates which treatment was used),\nand the parameters of that distribution. Once you know this distribution, you can draw conclusions about\nindividual treatments (rather than the treatment effect as a whole as in part b). For each of the five treat-\nments, indicate whether or not you believe that specific treatment has an effect.\n(d) How should the experiment be conducted to allow valid conclusions to be drawn?\nsource of\nvariation\nsum of\nsquares\ndegrees of\nfreedom\nmean\nsquare\nF ratio\nPr > F\naverage\nblocks\ntreatments\nresidual\ntotal\n6.780\nSemiconductor Manufacturing\nSpring 2003\nyt\n\nProblem 3\nDo Problem 3 on pg. 222 of Drain. Show an ANOVA table with your explanations.\nProblem 4\nDo Problem 4 on pg. 222-223 of Drain. Again show your ANOVA table.\nAcknowledgments: Problems are inspired by C. Spanos, and by Box, Hunter, and Hunter. Problems 3\nand 4 from D. Drain."
    },
    {
      "category": "Resource",
      "title": "ps4sol.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-780-semiconductor-manufacturing-spring-2003/358f7905c7c0ab64f3959a0f97e0c39a_ps4sol.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "PS5.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-780-semiconductor-manufacturing-spring-2003/ca6254b989ddfa633c28a120f512d288_PS5.pdf",
      "content": "Problem Set #5\nIssued: Wednesday, March 12, 2003\nDue: Monday, March 31, 2003\nProblem 1\nA process engineer is about to begin a comprehensive study to determine the effects of five variables on\nthe etch rate of polysilicon.\n(a) if a two level, five factor factorial design with no replicates were used, how many runs would be\nmade?\n(b) If σ2 is the experimental error variance of an individual observation, what is the variance of the main\neffect?\n(c) Write an expression for the 99% confidence interval for the main effect of variable 1, in terms of cal-\nculated averages and the experimental error standard deviation σ.\n(d) On the basis of some previous work it is believed that σ=200 A/min. If the experimenter wants 99%\nconfidence intervals for the main effect and interactions whose length are equal to 50 A/min, (i.e. the\nupper limit minus the lower limit of the confidence interval is equal to 50 A/min), how many replications\nof the 25 factorial design will be required? (Note: this may take some thought.)\nProblem 2\nTests were carried out on a newly designed chemical-mechanical polisher. Four variables were studied as\nfollows:\nThe immediate object was to find the effect of these alternatives on the total thickness of oxide removed\n(in microns) during an extended polish cycle. The following results were obtained\nVariable\n-\n+\nA - pad conditioning\nbefore polish\nduring polish\nB - polishing pad type\nstacked\nhard\nC - table temperature\nchilled\nroom temp.\nD - slurry recirculation\nnone\nengaged\nA\nB\nC\nD\noxide removed (μm)\n-\n+\n+\n+\n0.82\n-\n-\n+\n-\n0.17\n-\n-\n-\n+\n0.62\n6.780\nSemiconductor Manufacturing\nSpring 2003\n\n(a) Stating any assumptions, analyze the data using a multivariate analysis of variance (MANOVA) table\napproach.\n(b) A MANOVA table uses the F distribution. Describe equivalent tests that make use of the student-t dis-\ntribution to check significance of effects. To what level of confidence is factor B significant? Factor C?\n(c) Comment on the differences and similarities of this analysis compared to the basic factorial analysis\nmethod in which effects are calculated, together with the standard error of those effects.\nProblem 3\nThe goal is to develop a response surface model for some response as a function of two input or inde-\npendent variables\nand\n. A central composite design with 5 center point replications has been per-\nformed, and the results summarized in Table 1 (where we have already normalized\nand\nto the\ninterval -1 to +1).\n+\n-\n-\n-\n0.30\n+\n-\n+\n+\n0.68\n+\n+\n+\n-\n0.50\n-\n+\n-\n-\n0.38\n+\n+\n-\n+\n0.93\nTable 1: Central Composite Design and Results\nExperiment\nComment\n-1\n-1\nFF\n3.7\n-1\nFF\n0.1\n-1\nFF\n5.5\nFF\n2.2\n-1.41421\nAxial\n4.9\n1.414214\nAxial\n7.5\n-1.41421\nAxial\n2.9\n1.414214\nAxial\n-3.2\nCenter-Ax\n-0.2\nCenter-Ax\n0.2\nCenter-Ax\n0.2\nCenter-Ax\n0.4\nCenter-Ax\n-0.3\nA\nB\nC\nD\noxide removed (μm)\ny\nx1\nx2\nx1\nx2\nx1\nx2\ny\n\nThe purpose of this problem is for you to gain familiarity with a statistical or data analysis package of\nyour choice. Reasonable alternatives include Matlab (especially with the statistics toolbox) or Splus, both\nof which are available on Athena. The JMP sotftware (available on PCs and Macs) is very good for\nexploratory analysis. Spreadsheet programs (such as Excel) also provide somewhat more limited but usu-\nally sufficient data and statistical analysis options and graphics plotting capability.\n(a) Construct a response surface model using a linear least squares fit for a model of the form:\nYour analysis package should be capable of expressing the results of the regression model in an ANOVA\nformat. What are your estimates for the three model parameters? Are the coefficients significant? What is\nthe overall R2 for your model?\n(b) Is there any evidence of lack of fit in your model? Plot the residuals versus y, versus\nand versus\n.\nDoes the form of the residuals suggest any additional model terms?\n(c) Construct a response surface model using a linear least squares fit to the form:\nNote: some packages do not explicitly support construction of higher order models; you may need to cre-\nate additional columns holding the values\n,\n, and\nto supply data for the regressions.\nNow what are your estimates for these model coefficients? Which, if any, of the model coefficients are\nsignificant? What is the overall R2 for your model now? Is there any evidence of lack of fit?\n(d) In a pure factorial design (particularly one without replicates) if a problem arises during the execution\nof the experiment and we have missing data, the simple factor effect analysis is no longer easily accom-\nplished, because we no longer have a balanced experiment. Response surface designs, however, are fairly\nrobust to incomplete experiments or small amounts of missing data. Assume that experiment #1 failed to\ncomplete and this data point is missing. Refit the model of part (c), and compare the model coefficients to\nthose of part (c).\nAcknowledgments: Problems are inspired by C. Spanos, and by Box, Hunter, and Hunter.\nyˆ\nβ0\nβ1x1\nβ2x2\n+\n+\n=\nx1\nx2\nyˆ\nβ0\nβ1x1\nβ2x2\nβ12x1x2\nβ11x1\nβ22x2\n+\n+\n+\n+\n+\n=\nx1x2 x1\nx2"
    },
    {
      "category": "Resource",
      "title": "ps5sol.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-780-semiconductor-manufacturing-spring-2003/3be93bc2c360140d559334f97e50b83f_ps5sol.pdf",
      "content": ""
    },
    {
      "category": "Exam",
      "title": "quiz1solutions.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-780-semiconductor-manufacturing-spring-2003/2ad054c9846803335935d802c948e9db_quiz1solutions.pdf",
      "content": ""
    },
    {
      "category": "Exam",
      "title": "quiz2solutions.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-780-semiconductor-manufacturing-spring-2003/e53a88b6a9814ef1f15d81b0395793f3_quiz2solutions.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "costcycle.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-780-semiconductor-manufacturing-spring-2003/7d0ee4fb16dd213382980321ded9fdfc_costcycle.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "regression.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-780-semiconductor-manufacturing-spring-2003/51a30d00677b639d9d32f48561d78128_regression.pdf",
      "content": "Copyright 2003 (c) Duane S. Boning.\nSMA 6304 / MIT 2.853 / MIT 2.854\nManufacturing Systems\nLecture 10: Data and Regression\nAnalysis\nLecturer: Prof. Duane S. Boning\nAgenda\n1.\nComparison of Treatments (One Variable)\n-\nAnalysis of Variance (ANOVA)\n2.\nMultivariate Analysis of Variance\n-\nModel forms\n3.\nRegression Modeling\n-\nRegression fundamentals\n-\nSignificance of model terms\n-\nConfidence intervals\nCopyright 2003 (c) Duane S. Boning.\nld\n10 11 12 13 14 15 16 17 18 19 20\nA\nA\nA\nA\nA\nA\nA\nA\nA\nA\nB\nB\nB\nB\nB\nB\nB\nB\nB\nB\nCopyright 2003 (c) Duane S. Boning.\nIs Process B Better Than Process A?\nyie\ntime order\ntime\norder\nmethod\nyield\n89.7\n81.4\n84.5\n84.8\n87.3\n79.7\n85.1\n81.7\n83.7\n84.5\n84.7\n86.1\n83.2\n91.9\n86.3\n79.3\n82.6\n89.1\n83.7\n88.5\n\nσ2\nof\nν\nof\nCopyright 2003 (c) Duane S. Boning.\nTwo Means with Internal Estimate of Variance\nMethod A\nMethod B\nPooled estimate of\nEstimated variance\nwith =18 d.o.f\nEstimated standard error\nSo only about 80% confident that\nmean difference is \"real\" (signficant)\nComparison of Treatments\nPopulation A\nPopulation C\nSample A\nSample B Sample C\nPopulation B\n-\nConsider multiple conditions (treatments, settings for some variable)\n- There is an overall mean μ and real \"effects\" or deltas between conditions τ.i\n- We observe samples at each condition of interest\n-\nKey question: are the observed differences in mean \"significant\"?\n- Typical assumption (should be checked): the underlying variances are all the\nsame - usually an unknown value (σ0\n2)\nCopyright 2003 (c) Duane S. Boning.\nSteps/Issues in Analysis of Variance\n1. Within group variation\n-\nEstimates underlying population variance\n2. Between group variation\n-\nEstimate group to group variance\n3. Compare the two estimates of variance\n-\nIf there is a difference between the different treatments,\nthen the between group variation estimate will be inflated\ncompared to the within group estimate\n-\nWe will be able to establish confidence in whether or not\nobserved differences between treatments are significant\nHint: we'll be using F tests to look at ratios of variances\nCopyright 2003 (c) Duane S. Boning.\n\n-\nσ0\nt\nithin tth\n-\ni\nth\nj\n-\nwi\n-\ni\n(\nCopyright 2003 (c) Duane S. Boning.\n(1) Within Group Variation\nAssume that each group is normally distributed and shares a\ncommon variance\n-\nSS = sum of square deviations w\ngroup (there are k groups)\nEstimate of w thin group variance in t\ngroup ( ust variance formula)\nPool these (across different conditions) to get estimate of common\nthin group variance:\nThis is the w thin group \"mean square\" variance estimate)\n-\nμ1 = μ2\nμk\n-\nnd\nof σ2\n-\nsT\nl\nτt\nCopyright 2003 (c) Duane S. Boning.\n(2) Between Group Variation\nWe will be testing hypothesis\n= ... =\nIf all the means are in fact equal, then a 2\nestimate\ncould be formed based on the observed\ndifferences between group means:\nIf all the treatments in fact have different means, then\nestimates something larger:\nVariance is \"inf ated\" by the\nreal treatment effects\n-\nibiliti\nT\n2,\nF\n-\nCopyright 2003 (c) Duane S. Boning.\n(3) Compare Variance Estimates\nWe now have two different poss\nes for s\ndepending on whether the observed sample mean\ndifferences are \"real\" or are just occurring by chance\n(by sampling)\n- Use statistic to see if the ratios of these variances\nare likely to have occurred by chance!\nFormal test for significance:\n\n-\nF\ni\n- Use F\n-\ni\ni\nα\nbetter\nCopyright 2003 (c) Duane S. Boning.\n(4) Compute Significance Level\nCalculate observed\nratio (w th appropriate\ndegrees of freedom in numerator and\ndenominator)\ndistribution to find how likely a ratio this\nlarge is to have occurred by chance alone\nThis is our \"signif cance level\"\n- If\nthen we say that the mean differences or treatment\neffects are s gnificant to (1- )100% confidence or\n-\nCopyright 2003 (c) Duane S. Boning.\n(5) Variance Due to Treatment Effects\nWe also want to estimate the sum of squared\ndeviations from the grand mean among all\nsamples:\nF0\naverage\nPr(F0)\ndegrees\nof\nfreedom\nsquares\nvariation\nAl\nCopyright 2003 (c) Duane S. Boning.\n(6) Results: The ANOVA Table\nmean square\nTotal about\nthe grand\nWithin\ntreatments\nBetween\ntreatments\nsum of\nsource of\nso referred to\nas \"residual\" SS\n\nExample: Anova\nA\nB\nC\nA\nB\nC\ni\ni\nA\nB\nC\nf\niati\ndf\nF\nit\nWi\nl\nCopyright 2003 (c) Duane S. Boning.\nAnova: S ngle Factor\nSUMMARY\nGroups\nCount\nSum\nAverage\nVar ance\n\nANOVA\nSource o Var\non\nSS\nMS\nP-value\nF cr\nBetween Groups\n4.5\n0.064\n5.14\nthin Groups\nTota\nExcel: Data Analysis, One-Variation Anova\n-\ni\nmodel:\n-\nμt\n-\nτt\n- Wi\nεti\nσ0\n2)\n-\n-\n-\ni\n-\n-\nCopyright 2003 (c) Duane S. Boning.\nANOVA - Implied Model\nThe ANOVA approach assumes a s mple mathematical\nWhere\nis the treatment mean (for treatment type t)\nAnd\nis the treatment effect\nth being zero mean normal residuals ~N(0,\nChecks\nPlot residuals against time order\nExam ne distribution of residuals: should be IID, Normal\nPlot residuals vs. estimates\nPlot residuals vs. other variables of interest\n-\n-\nCopyright 2003 (c) Duane S. Boning.\nMANOVA - Two Dependencies\nCan extend to two (or more) variables of interest. MANOVA\nassumes a mathematical model, again simply capturing the means\n(or treatment offsets) for each discrete variable level:\nAssumes that the effects from the two variables are additive\n\n-\ni\nli\nli\n-\nl\nDF\nTube\nGas\nDF\nGas\nTube\nC\nB\nA\n-1\n-2\n-3\n-5\n-5\n-5\nCopyright 2003 (c) Duane S. Boning.\nExample: Two Factor MANOVA\nTwo LPCVD deposit on tube types, three gas supp ers. Does supp er matter\nin average particle counts on wafers?\nExperiment: 3 lots on each tube, for each gas; report average # particles added\nModel\nError\nC. Tota\nSource\n1350.00\n28.00\n1378.00\nSum of Squares\n450.0\n14.0\nMean Square\n32.14\nF Ratio\n0.0303\nProb > F\nAnalysis of Variance\nSource\nNparm\n150.00\n1200.00\nSum of Squares\n10.71\n42.85\nF Ratio\n0.0820\n0.0228\nProb > F\nEffect Tests\nFactor 1\nFactor 2\n-10\n-10\n-10\n-10\n-\n(\nσ2)\ni\nl\nl\n)\nj\n-\nl\nCopyright 2003 (c) Duane S. Boning.\nMANOVA - Two Factors with Interactions\nCan split out the model more explicitly...\nIID, ~N 0,\nAn effect that depends on both\nt & factors simultaneously\nt = first factor = 1,2, ... k\n(k = # eve s of first factor\ni = second factor = 1,2, ... n (n = # levels of second factor)\nj = replication = 1,2, ... m\n(m = # replications at t, th combination of factor levels\nMay be interaction: not simp y additive - effects may depend\nsynergistically on both factors:\nEstimate by:\nF0\nthe grand\naverage\nWi\n(Error)\nPr(F0)\ndegrees\nof\nCopyright 2003 (c) Duane S. Boning.\nMANOVA Table - Two Way with Interactions\nmean square\nTotal about\nthin Groups\nBetween levels\nof factor 1 (T)\nfreedom\nsum of\nsquares\nsource of\nvariation\nBetween levels\nof factor 2 (B)\nInteraction\n\n-\n-\ni\ni\nj\n-\n(\nl\n-\n-\ni\ni\n-\ni\nl).\nll νR = νD - νT\nCopyright 2003 (c) Duane S. Boning.\nMeasures of Model Goodness - R\nGoodness of fit - R\nQuest on cons dered: how much better does the model do that ust\nusing the grand average?\nThink of this as the fraction of squared deviations from the grand\naverage) in the data which is captured by the mode\nAdjusted R\nFor \"fair\" comparison between models w th different numbers of\ncoefficients, an alternat ve is often used\nThink of this as (1 - var ance remaining in the residua\nReca\nRegression Fundamentals\n- Use least square error as measure of goodness to\nestimate coefficients in a model\n- One parameter model:\n- Model form\n- Squared error\n- Estimation using normal equations\n- Estimate of experimental error\n- Precision of estimate: variance in b\n- Confidence interval for β\n- Analysis of variance: significance of b\n- Lack of fit vs. pure error\n- Polynomial regression\nCopyright 2003 (c) Duane S. Boning.\n-\n-\nl:\n-\nl\nβ wi\n-\n-\ni\ninimi\ni\n-\nl\nCopyright 2003 (c) Duane S. Boning.\nLeast Squares Regression\nWe use least-squares to estimate\ncoefficients in typical regression models\nOne-Parameter Mode\nGoa is to estimate\nth \"best\" b\nHow define \"best\"?\nThat b wh ch m\nzes sum of squared\nerror between predict on and data\nThe residua sum of squares (for the\nbest estimate) is\n\n-\nequations\n-\nl\nβ\ni\nle\n-\ni\nl\n-\n-\ni\n2 of σ2\nCopyright 2003 (c) Duane S. Boning.\nLeast Squares Regression, cont.\nLeast squares estimation via normal\nFor linear problems, we need not\ncalcu ate SS( ); rather, d rect solution for\nb is possib\nRecognize that vector of res duals will be\nnormal to vector of x va ues at the least\nsquares estimate\nEstimate of experimental error\nAssum ng model structure is adequate,\nestimate s\ncan be obtained:\n-\nCopyright 2003 (c) Duane S. Boning.\nPrecision of Estimate: Variance in b\nWe can calculate the variance in our estimate of the slope, b:\n-\nWhy?\n\nβ\n-\ni\ni\nα\n-\n-\ni\n-\ni\nβ\nβ\n-\nion)\ni\nCopyright 2003 (c) Duane S. Boning.\nConfidence Interval for\nOnce we have the standard error in b, we can calculate confidence\nntervals to some des red (1- )100% level of confidence\nAnalysis of variance\nTest hypothes s:\nIf conf dence interval for\nincludes 0, then\nnot significant\nDegrees of freedom (need in order to use t distribut\np = # parameters est mated\nby least squares\n\nDF\n8836.6440\n64.6695\n8901.3135\n8836.64\n8.08\n1093.146\nio\nl\nage\nZeroed\n0.500983\n0.015152\n.\n33.06\nt Ratio\n.\n|t|\nage\nDF\n8836.6440\n1093.146\nio\ni\ni\ni\ni\nCopyright 2003 (c) Duane S. Boning.\nExample Regression\nModel\nError\nC. Total\nSource\nSum of Squares\nMean Square\nF Rat\n<.0001\nProb > F\nTested against reduced mode : Y=0\nAnalysis of Variance\nIntercept\nTerm\nEstimate\nStd Error\n<.0001\nProb>\nParameter Estimates\nSource\nNparm\nSum of Squares\nF Rat\n<.0001\nProb > F\nEffect Tests\nWhole Model\nncome Leverage Res duals\nage Leverage, P<.0001\nAge\nIncome\n6.16\n\n9.88\n14.35\n24.06\n30.34\n32.17\n42.18\n43.23\n48.76\n- Note that this s mple model assumes an intercept of\nzero - model must go through origin\n- We w ll relax this requirement soon\n-\n-\n-\ni\ni\n-\nl\n-\ni\nSSR\ni\nSSL\ni\nSSE\nCopyright 2003 (c) Duane S. Boning.\nLack of Fit Error vs. Pure Error\nSometimes we have replicated data\nE.g. multiple runs at same x values in a designed experiment\nWe can decompose the res dual error contribut ons\nThis al ows us to TEST for lack of fit\nBy \"lack of fit\" we mean evidence that the linear model form is\nnadequate\nWhere\n= res dual sum of squares error\n= lack of f t squared error\n= pure replicate error\n- Model form\n-\nCopyright 2003 (c) Duane S. Boning.\nRegression: Mean Centered Models\nEstimate by\n\ne\ni\n)\nl\nDF\nit\nDF\nx\n|\nParameter Estimates\nx\nDF\nCopyright 2003 (c) Duane S. Boning.\nPolynomial Regression\n- Generated using JMP package\nRSquare\nRSquare Adj\nRoot Mean Sq Error\nMean of Response\nObservat ons (or Sum Wgts\n0.936427\n0.918264\n2.540917\n82.1\nSummary of Fit\nModel\nError\nC. Tota\nSource\n665.70617\n45.19383\n710.90000\nSum of Squares\n332.853\n6.456\nMean Squar\n51.5551\nF Ratio\n<.0001\nProb > F\nAnalysis of Variance\nLack Of F\nPure Error\nTotal Error\nSource\n18.193829\n27.000000\n45.193829\nSum of Squares\n6.0646\n6.7500\nMean Square\n0.8985\nF Ratio\n0.5157\nProb > F\n0.9620\nMax RSq\nLack Of Fit\nIntercept\nx*x\nTerm\n35.657437\n5.2628956\n-0.127674\nEstimate\n5.617927\n0.558022\n0.012811\nStd Error\n6.35\n9.43\n-9.97\nt Ratio\n0.0004\n<.0001\n<.0001\nProb>|t\nx*x\nSource\nNparm\n574.28553\n641.20451\nSum of Squares\n88.9502\n99.3151\nF Ratio\n<.0001\n<.0001\nProb > F\nEffect Tests\n-\n-\n-\nNext Time\n-\nTi\n-\nCopyright 2003 (c) Duane S. Boning.\nSummary\nComparison of Treatments - ANOVA\nMultivariate Analysis of Variance\nRegression Modeling\nme Series Models\nForecasting"
    },
    {
      "category": "Resource",
      "title": "forecasting1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-780-semiconductor-manufacturing-spring-2003/4eba4776bce664bdf54bdcad3e366b8d_forecasting1.pdf",
      "content": "Copyright 2003 (c) Duane S. Boning.\nSMA 6304 / MIT 2.853 / MIT 2.854\nManufacturing Systems\nLecture 11: Forecasting\nLecturer: Prof. Duane S. Boning\n\nAgenda\nCopyright 2003 (c) Duane S. Boning.\n1.\nRegression\n-\nPolynomial regression\n-\nExample (using Excel)\n2.\nTime Series Data & Regression\n-\nAutocorrelation - ACF\n-\nExample: white noise sequences\n-\nExample: autoregressive sequences\n-\nExample: moving average\n-\nARIMA modeling and regression\n3.\nForecasting Examples\n\nRegression - Review & Extensions\nCopyright 2003 (c) Duane S. Boning.\n-\nSingle Model Coefficient: Linear Dependence\n-\nSlope and Intercept (or Offset):\n-\nPolynomial and Higher Order Models:\n-\nMultiple Parameters\n-\nKey point: \"linear\" regression can be used as long as the model is\nlinear in the coefficients (doesn't matter the dependence in the\nindependent variable)\n\nPolynomial Regression Example\n- Replicate data provides opportunity to check for lack of fit\ny\nx\nFit Mean\nLinear Fit\nPolynomial Fit Degree=2\nBivariate Fit of y By x\nCopyright 2003 (c) Duane S. Boning.\n\nGrowth Rate - First Order Model\n- Mean significant, but linear term not\n- Clear evidence of lack of fit\nCopyright 2003 (c) Duane S. Boning.\n\nGrowth Rate - Second Order Model\n- No evidence of lack of fit\n- Quadratic term significant\nCopyright 2003 (c) Duane S. Boning.\n\nPolynomial Regression In Excel\n- Create additional input columns for each input\n- Use \"Data Analysis\" and \"Regression\" tool\nCopyright 2003 (c) Duane S. Boning.\n-0.097\n-0.158\n2.2E-05\n-9.966\n0.013\n-0.128\nx^2\n6.582\n3.943\n3.1E-05\n9.431\n0.558\n5.263\nx\n48.942\n22.373\n0.0004\n6.347\n5.618\n35.657\nIntercept\nUpper\n95%\nLower\n95%\nP-value\nt Stat\nStandard\nError\nCoefficients\n710.9\nTotal\n6.456\n45.194\nResidual\n6.48E-05\n51.555\n332.853\n665.706\nRegression\nSignificance F\nF\nMS\nSS\ndf\nANOVA\nObservations\n2.541\nStandard Error\n0.918\nAdjusted R Square\n0.936\nR Square\n0.968\nMultiple R\nRegression Statistics\nx\nx^2\ny\n\nPolynomial Regression\n- Generated using JMP\nRSquare\nRSquare Adj\nRoot Mean Sq Error\nMean of Response\nObservations (or Sum Wgts)\n0.936427\n0.918264\n2.540917\n82.1\nSummary of Fit\nModel\nError\nC. Total\nSource\nDF\n665.70617\n45.19383\n710.90000\nSum of Squares\n332.853\n6.456\nMean Square\n51.5551\nF Ratio\n<.0001\nProb > F\nAnalysis of Variance\nLack Of Fit\nPure Error\nTotal Error\nSource\nDF\n18.193829\n27.000000\n45.193829\nSum of Squares\n6.0646\n6.7500\nMean Square\n0.8985\nF Ratio\n0.5157\nProb > F\n0.9620\nMax RSq\nLack Of Fit\nIntercept\nx\nx*x\nTerm\n35.657437\n5.2628956\n-0.127674\nEstimate\n5.617927\n0.558022\n0.012811\nStd Error\n6.35\n9.43\n-9.97\nt Ratio\n0.0004\n<.0001\n<.0001\nProb>|t|\nParameter Estimates\nx\nx*x\nSource\nNparm\nDF\n574.28553\n641.20451\nSum of Squares\n88.9502\n99.3151\nF Ratio\n<.0001\n<.0001\nProb > F\nEffect Tests\nCopyright 2003 (c) Duane S. Boning.\n\nAgenda\nCopyright 2003 (c) Duane S. Boning.\n1.\nRegression\n-\nPolynomial regression\n-\nExample (using Excel)\n2.\nTime Series Data & Time Series Regression\n-\nAutocorrelation - ACF\n-\nExample: white noise sequences\n-\nExample: autoregressive sequences\n-\nExample: moving average\n-\nARIMA modeling and regression\n3.\nForecasting Examples\n\nTime Series - Time as an Implicit Parameter\n- Data is often\ncollected with a\ntime-order\n- An underlying\ndynamic process\n(e.g. due to physics\nof a manufacturing\nprocess) may create\nautocorrelation in\nthe data\n-10\n-5\ntime\nx\n-2\ntime\nx\nuncorrelated\nautocorrelated\nCopyright 2003 (c) Duane S. Boning.\n\nIntuition: Where Does Autocorrelation Come From?\n-\nConsider a chamber with volume V, and with gas flow in and\ngas flow out at rate f. We are interested in the concentration x at\nthe output, in relation to a known input concentration w.\nCopyright 2003 (c) Duane S. Boning.\n\nKey Tool: Autocorrelation Function (ACF)\n- Time series data: time index i\n- CCF: cross-correlation function\n- ACF: auto-correlation function\n⇒ACF shows the \"similarity\" of a signal\nto a lagged version of same signal\n-4\n-2\ntime\nx\n-1\n-0.5\n0.5\nlags\nr(k)\nCopyright 2003 (c) Duane S. Boning.\n\nStationary vs. Non-Stationary\n-10\n-5\ntime\nStationary series:\nProcess has a fixed mean\nx\nCopyright 2003 (c) Duane S. Boning.\n-10\ntime\n\nWhite Noise - An Uncorrelated Series\n-\nData drawn from IID gaussian\n-\nACF: We also plot the 3σ limits -\nvalues within these not significant\n-\nNote that r(0) = 1 always (a\nsignal is always equal to itself\nwith zero lag - perfectly\nautocorrelated at k = 0)\n-\nSample mean\n-\nSample variance\n-4\n-2\ntime\nx\n-1\n-0.5\n0.5\nlags\nr(k)\nCopyright 2003 (c) Duane S. Boning.\n\nAutoregressive Disturbances\nCopyright 2003 (c) Duane S. Boning.\n-10\n-5\ntime\nx\n-1\n-0.5\n0.5\nlags\nr(k)\n- Generated by:\n- Mean\n- Variance\nSlow drop in ACF with large α\nSo AR (autoregressive) behavior\nincreases variance of signal.\n\nAnother Autoregressive Series\n- Generated by:\nCopyright 2003 (c) Duane S. Boning.\nSlow drop in ACF with large α\n-10\n-5\ntime\nx\n-1\n-0.5\n0.5\nlags\nr(k)\nSlow drop in ACF with large α\nBut now ACF alternates in sign\n- High negative autocorrelation:\n\nRandom Walk Disturbances\n- Generated by:\nCopyright 2003 (c) Duane S. Boning.\n-10\ntime\nx\n-1\n-0.5\n0.5\nlags\nr(k)\n- Mean\n- Variance\nVery slow drop in ACF for α = 1\n\nMoving Average Sequence\nCopyright 2003 (c) Duane S. Boning.\n-4\n-2\ntime\nx\n-1\n-0.5\n0.5\nlags\nr(k)\n- Generated by:\n- Mean\n- Variance\nSo MA (moving average) behavior\nalso increases variance of signal.\nr(1) ≈β\nJump in ACF at specific lag\n\nARMA Sequence\nCopyright 2003 (c) Duane S. Boning.\n-10\n-5\ntime\nx\n-1\n-0.5\n0.5\nlags\nr(k)\n- Generated by:\n- Both AR & MA behavior\nSlow drop in ACF with large α\n\nARIMA Sequence\n- Start with ARMA sequence:\n-200\ntime\nx\n-1\n-0.5\n0.5\nlags\nr(k)\n- Add Integrated (I) behavior\nSlow drop in ACF with large α\nrandom walk (integrative) action\nCopyright 2003 (c) Duane S. Boning.\n\nPeriodic Signal with Autoregressive Noise\n-10\ntime\nx\n-1\n-0.5\n0.5\nlags\nr(k)\nOriginal Signal\n-5\ntime\nx\n-1\n-0.5\n0.5\nlags\nr(k)\nAfter Differencing\nSee underlying signal with period = 5\nCopyright 2003 (c) Duane S. Boning.\n\nAgenda\nCopyright 2003 (c) Duane S. Boning.\n1.\nRegression\n-\nPolynomial regression\n-\nExample (using Excel)\n2.\nTime Series Data & Regression\n-\nAutocorrelation - ACF\n-\nExample: white noise sequences\n-\nExample: autoregressive sequences\n-\nExample: moving average\n-\nARIMA modeling and regression\n3.\nForecasting Examples\n\nCross-Correlation: A Leading Indicator\nCopyright 2003 (c) Duane S. Boning.\n-10\n-5\ntime\nx\n-10\n-5\ntime\ny\n-1\n-0.5\n0.5\nlags\nrxy(k)\n- Now we have two series:\n- An \"input\" or explanatory\nvariable x\n- An \"output\" variable y\n- CCF indicates both AR and lag:\n\nRegression & Time Series Modeling\nCopyright 2003 (c) Duane S. Boning.\n- The ACF or CCF are helpful tools in selecting an\nappropriate model structure\n- Autoregressive terms?\n- xi = α xi-1\n- Lag terms?\n- yi = γ xi-k\n- One can structure data and perform regressions\n- Estimate model coefficient values, significance, and\nconfidence intervals\n- Determine confidence intervals on output\n- Check residuals\n\nStatistical Modeling Summary\nCopyright 2003 (c) Duane S. Boning.\n1.\nStatistical Fundamentals\n-\nSampling distributions\n-\nPoint and interval estimation\n-\nHypothesis testing\n2.\nRegression\n-\nANOVA\n-\nNominal data: modeling of treatment effects (mean differences)\n-\nContinuous data: least square regression\n3.\nTime Series Data & Forecasting\n-\nAutoregressive, moving average, and integrative behavior\n-\nAuto- and Cross-correlation functions\n-\nRegression and time-series modeling"
    },
    {
      "category": "Resource",
      "title": "ln1statsa.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-780-semiconductor-manufacturing-spring-2003/eca541d5b18f7161dafe0b4c66b6b35b_ln1statsa.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "ln2estimation.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-780-semiconductor-manufacturing-spring-2003/74d1cd3f7b1ac620d21700c2a7c43355_ln2estimation.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "ln4controlchatc.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-780-semiconductor-manufacturing-spring-2003/9f855a2fddd3ffcd6a4d98b0c9b59021_ln4controlchatc.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "ln5advcontrol.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-780-semiconductor-manufacturing-spring-2003/310e2dd096a82137361d4bbfb3bd1c59_ln5advcontrol.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "ln6experimenta.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-780-semiconductor-manufacturing-spring-2003/00c213f3a725d4f4d38649aa07355172_ln6experimenta.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "ln7manova.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-780-semiconductor-manufacturing-spring-2003/fdcb269ea2ee49d55df67820e81b3979_ln7manova.pdf",
      "content": ""
    },
    {
      "category": "Lecture Notes",
      "title": "lecture9_3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-780-semiconductor-manufacturing-spring-2003/5a0144749f4cd6523449bf32f3136945_lecture9_3.pdf",
      "content": "Copyright 2003 (c) Duane S. Boning.\nSMA 6304 / MIT 2.853 / MIT 2.854\nManufacturing Systems\nLecture 9: Statistical Inference\nLecturer: Prof. Duane S. Boning\nAgenda\n1. Review: Probability Distributions & Random Variables\n2. Sampling: Key distributions arising in sampling\n-\nChi-square, t, and F distributions\n3. Estimation:\nReasoning about the population based on a sample\n4. Some basic confidence intervals\n-\nEstimate of mean with variance known\n-\nEstimate of mean with variance not known\n-\nEstimate of variance\n5. Hypothesis tests\nCopyright 2003 (c) Duane S. Boning.\nll\nDiscrete Distribution: Bernoulli\n-\ni\n-\nx\np\n1 - p\n1⁄4\n3⁄4\nCopyright 2003 (c) Duane S. Boning.\nBernoulli trial: an experiment w th two outcomes\nProbability mass function (pmf):\nf(x)\n\nll\nDiscrete Distribution: Binomial\n-\n- n\n- p\n- x\nCopyright 2003 (c) Duane S. Boning.\nRepeated random Bernoulli trials\nis the number of trials\nis the probability of \"success\" on any one trial\nis the number of successes in n trials\nll\nDiscrete Distribution: Poisson\n-\ni\nn is\nlarge and p\n-\n-\ni\n)\n-\nl\n-\n-\nCopyright 2003 (c) Duane S. Boning.\nPoisson is a good approximation to B nomial when\nis small (< 0.1)\nExample applications:\n# m sprints on page(s of a book\n# transistors which fai on first day of operation\nMean:\nVariance:\nll\n-\n-\n-\ni\nCopyright 2003 (c) Duane S. Boning.\nContinuous Distributions\nUniform Distribution\nNormal Distribution\nUnit (Standard) Normal D stribution\n\nll\n- pdf\nx\na\nb\nx\na\nb\nCopyright 2003 (c) Duane S. Boning.\nContinuous Distribution: Uniform\n- cdf\nll\nx\na\nb\nx\na\nb\nx si\ni\nin\nx\nCopyright 2003 (c) Duane S. Boning.\nStandard Questions You Should Be Able To Answer\n(For a Known cdf or pdf)\n- Probability\nts w th\nsome range\n- Probability less than or\nequal to some value\nContinuous Distribution: Normal (Gaussian)\n- cdf\n0.84\n0.5\n0.16\n- pdf\nCopyright 2003 (c) Duane S. Boning.\n\nll\nContinuous Distribution: Unit Normal\n-\n-\n-\n- pdf\nCopyright 2003 (c) Duane S. Boning.\nNormalization\n- cdf\nMean\nVariance\nll\n-\nl\ndistri\ntails\nCopyright 2003 (c) Duane S. Boning.\nUsing the Unit Normal pdf and cdf\nWe often want to ta k about\n\"percentage points\" of the\nbution - portion in the\n0.1\n0.5\n0.9\nll\nreasoning\nfrom\n-\n-\n-\n-\nidence:\n-\n-\n-\nCopyright 2003 (c) Duane S. Boning.\nPhilosophy\nThe field of statistics is about\nin the face of\nuncertainty, based on evidence\nobserved data\nBeliefs:\nDistribution or model form\nDistribution/model parameters\nEv\nFinite set of observations or data drawn from a population\nModels:\nSeek to explain data\n\nll\nMoments of the Population\n-\n-\n-\n-\n-\nCoefficient\nPopulation\nCopyright 2003 (c) Duane S. Boning.\nvs. Sample Statistics\nMean\nVariance\nStandard\nDeviation\nCovariance\nCorrelation\nSample\nSampling and Estimation\n- Sampling: act of making observations from populations\n- Random sampling: when each observation is identically\nand independently distributed (IID)\n- Statistic: a function of sample data; a value that can be\ncomputed from data (contains no unknowns)\n- average, median, standard deviation\nCopyright 2003 (c) Duane S. Boning.\nll\nl\nili\nion)\nl\n)\nn = 20\nn = 10\nn = 2\nl\ni\nCopyright 2003 (c) Duane S. Boning.\nPopulation vs. Sampling Distribution\nPopu ation\n(probab ty density funct\nSamp e Mean\n(statistic\nSamp e Mean\n(sampling d stribution)\n\nll\nSampling and Estimation, cont.\n-\n-\n-\n- A statistic\n-\nwill be di\nill\nibution\n-\ni\n-\ni\nCopyright 2003 (c) Duane S. Boning.\nSampling\nRandom sampling\nStatistic\nis a random variable, which itself has a\nsampling distribution\nI.e., if we take multiple random samples, the value for the statistic\nfferent for each set of samples, but w be governed by\nthe same sampling distr\nIf we know the appropriate sampling distr bution, we can\nreason about the population based on the observed\nvalue of a statistic\nE.g. we calculate a sample mean from a random sample; in what\nrange do we think the actual (population) mean really s ts?\nll\n-\ni\n-\nn\n-\n-\ni\nμ\nCopyright 2003 (c) Duane S. Boning.\nSampling and Estimation - An Example\nSuppose we know that the thickness of\na part is normally distributed w th std.\ndev. of 10:\nWe sample\n= 50 random parts and\ncompute the mean part thickness:\nFirst question: What is distribution of\nSecond question: can we use\nknowledge of distr bution to reason\nabout the actual (population) mean\ngiven observed (sample) mean?\nll\n-\n-\n-\n-\nl\n- Mini\ni\ni\nll\n-\n-\ni\n-\nCopyright 2003 (c) Duane S. Boning.\nEstimation and Confidence Intervals\nPoint Estimation:\nFind best values for parameters of a distribution\nShould be\nUnbiased: expected value of estimate should be true va ue\nmum var ance: should be estimator w th sma est variance\nInterval Estimation:\nGive bounds that contain actual value w th a given\nprobability\nMust know sampling distribution!\n\nll\n-\nσ\ni\nl\n-\n(\nα\n-\nl\ni\n-\nl\nCopyright 2003 (c) Duane S. Boning.\nConfidence Intervals: Variance Known\nWe know , e.g. from h storica data\nEstimate mean in some interval to 1- )100% confidence\n0.1\n0.5\n0.9\nRemember the unit norma\npercentage po nts\nApply to the sampling\ndistribution for the\nsamp e mean\nll\ni\ni\nα\nExample, Cont'd\n-\ndistribution to\nμ\nn = 50\nion\nli\ni\nσ\nCopyright 2003 (c) Duane S. Boning.\n95% conf dence nterval,\n= 0.05\nSecond question: can we use knowledge of\nreason about the actual (population) mean\ngiven observed\n(sample) mean?\n~95% of distribut\nes w thin +/- 2\nof mean\nll\n-\ndistri\n-\n-\n-\nl\ni\niation or σ\n-\n-\ni\ni\n- F\n-\ni\ni\nCopyright 2003 (c) Duane S. Boning.\nReasoning & Sampling Distributions\nExample shows that we need to know our sampling\nbution in order to reason about the sample and\npopulation parameters\nOther important sampling distributions:\nStudent-t\nUse instead of norma distr bution when we don't know actual\nvar\nChi-square\nUse when we are ask ng about var ances\nUse when we are ask ng about ratios of var ances\n\nll\n-\ns2\nl\nion\nli\nl\ni\n0.01\n0.02\n0.03\n0.04\n0.05\n0.06\n0.07\n0.08\n0.09\n0.1\nCopyright 2003 (c) Duane S. Boning.\nSampling: The Chi-Square Distribution\nTypical use: find distribution\nof variance when mean is\nknown\n-\nEx:\n\nSo if we calculate\n, we can use\nknow edge of chi-square distribut\nto put bounds on where we be eve\nthe actual (popu ation) variance s ts\nll\n-\nσ\nk →inf, tk → N(0,1)\n-\nxi ~ N(μ, σ2)\n-\n(\ni\nCopyright 2003 (c) Duane S. Boning.\nTypical use: Find distribution of average when\nis NOT known\n-\nFor\n\nConsider\n. Then\nThis is just the \"normalized\" distance from mean normalized\nto our estimate of the sample var ance)\nSampling: The Student-t Distribution\nll\n-\n-\nn\n-\n-\nμ\ni\nion:\ni\ni\ni\nion)\nCopyright 2003 (c) Duane S. Boning.\nBack to our Example\nSuppose we do not know either the variance or the mean in\nour parts population:\nWe take our sample of size\n= 50, and calculate\nBest estimate of population mean and variance (std.dev.)?\nIf had to pick a range where\nwould be 95% of time?\nHave to use the appropriate sampling d stribut\nIn th s case - the t-distribut on (rather than normal\ndistr but\n\nll\n-\n-\n-\nith\n(1-α)\nibuti\ni\ni\ni\ni\nCopyright 2003 (c) Duane S. Boning.\nConfidence Intervals: Variance Unknown\nCase where we don't know variance a priori\nNow we have to estimate not only the mean based on\nour data, but also estimate the variance\nOur estimate of the mean to some interval w\n100% confidence becomes\nNote that the t distr\non is slightly w der than the normal\ndistribut on, so that our conf dence interval on the true mean is\nnot as t ght as when we know the variance.\nll\nExample, Cont'd\n-\nl\nμ\nσ?\nn = 50\nis\nl\ni\ni\ni\ni\nl\nCopyright 2003 (c) Duane S. Boning.\nThird question: can we use know edge of\ndistribution to\nreason about the actual (population) mean\ngiven observed\n(sample) mean - even though we weren't told\nt distribution\nslight y w der than\ngauss an d stribut on\n95% confidence interva\nll\n-\nCopyright 2003 (c) Duane S. Boning.\nOnce More to Our Example\nFourth question: how about a confidence interval on our\nestimate of the variance of the thickness of our parts, based on\nour 50 observations?\n\nll\n-\ni\n-\nχ2 i\nCopyright 2003 (c) Duane S. Boning.\nConfidence Intervals: Estimate of Variance\nThe appropriate sampling distribution is the Ch -square\nBecause\ns asymmetric, c.i. bounds not symmetric.\nll\n90 100\n0.005\n0.01\n0.015\n0.02\n0.025\n0.03\n0.035\n0.04\n0.045\nExample, Cont'd\n-\nsT\n2 =\nith n\nCopyright 2003 (c) Duane S. Boning.\nFourth question: for our example (where we observed\n102.3) w\n= 50 samples, what is the 95% confidence interval\nfor the population variance?\nll\n-\nl\n- x ~ N(μx, σ2\nx)\n1, x2\nn\n- y ~ N(μy, σ2\ny)\n1, y2\nm\n-\nor\nCopyright 2003 (c) Duane S. Boning.\nSampling: The F Distribution\nTypical use: compare the spread of two populations\n- Examp e:\nfrom which we sample x\n, ..., x\nfrom which we sample y\n, ..., y\nThen\n\nll\n-\ndistributed population\n-\npopulation\n-\nsi\n-\nio of\n⇒ F distribution\n-\n-\nx\n-\nn = 20\n-\nl\nl\n-\nio\nio!\nCopyright 2003 (c) Duane S. Boning.\nConcept of the F Distribution\nAssume we have a normally\nWe generate two different\nrandom samples from the\nIn each case, we calculate a\nsample variance\nWhat range will the rat\nthese two variances take?\nPurely by chance (due to\nsampling) we get a range of\nratios even though drawing\nfrom same population\nExample:\nAssume ~ N(0,1)\nTake samples of size\nCa cu ate s\nand s\nand take ratio\n95% confidence interval on rat\nLarge range in rat\nll\n-\ni\n- H0\n-\n-\ni\nly\n- H1\n-\nl\n)\nl)\n-\nj\nH0\nl to\n) H0\ni\nCopyright 2003 (c) Duane S. Boning.\nHypothesis Testing\nA statistical hypothesis is a statement about the parameters of a\nprobability distr bution\nis the \"null hypothesis\"\nE.g.\nWould ind cate that the machine is working correct\nis the \"alternative hypothesis\"\n- E.g.\nIndicates an undesirab e change (mean shift in the machine\noperation (perhaps a worn too\nIn general, we formulate our hypothesis, generate a random\nsample, compute a statistic, and then seek to re ect\nor fai\nreject (accept\nbased on probabilities associated w th the\nstatistic and level of confidence we select\nll\nx From?\n-\n-\n-\niss\"\n-\n)\nider H1 an\ni\ni\nle α, β risks\nider H0\nl\n-\n-\ni\nCopyright 2003 (c) Duane S. Boning.\nWhich Population is Sample\nTwo error probabilities in decision:\nType I error: \"false alarm\"\nType II error: \"m\nPower of test (\"correct alarm\"\nCons\n\"alarm\" condition\nSet decis on po nt (and\nsample size) based on\nacceptab\nCons\nthe\n\"norma \" condition\nControl charts are hypothesis tests:\nIs my process \" n control\" or has a significant change occurred?\n\nll\ni\ni\ni\n2.\ni\ni\ni\nli\n-\n3.\nEsti\ni\ni\ni\n4.\nls\n-\ni\n-\ni\n-\n5.\ni\n1.\ni\n⇒\nl\ni\ni\n)\n2.\n)?\n⇒\nCopyright 2003 (c) Duane S. Boning.\nSummary\n1.\nRev ew: Probability Distr butions & Random Var ables\nSampling: Key d stribut ons aris ng in samp ng\nChi-square, t, and F distributions\nmat on: Reason ng about the populat on based on a sample\nSome basic confidence interva\nEstimate of mean w th variance known\nEstimate of mean w th variance not known\nEstimate of variance\nHypothes s tests\nNext Time:\nAre effects (some variable) s gnificant?\nANOVA (Ana ys s of Var ance\nHow do we model the effect of some variable(s\nRegression modeling"
    },
    {
      "category": "Resource",
      "title": "cai_xie_rep.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-780-semiconductor-manufacturing-spring-2003/c1030d348cb22173d315956d16c0fa9d_cai_xie_rep.pdf",
      "content": "C\n6.780 SEMICONDUCTOR MANUFACTURING TERM PROJECT, MAY 12 2003\nCopper Electrochemical Deposition\nTopography Regression\nHong Cai, and Xiaolin Xie\nAbstract-- In this term project paper, new models to\npredict the pattern dependent topography after copper\nelectroplating are developed by fitting the sequential data\nsets. The basic strategy is to choose the appropriate model\nitems with the aids of CEAC model, a simple physical\nelectroplating feature scale model. By screening the\nparameter candidates proposed by the physical model,\nregression of each experiment is carried.\nFrom the\nsignificance of each model parameter, we propose a new\nintegrated model. The fitting goodness of the new models is\ncompared with the previous model.\nIndex Terms--Regression, Response Surface Regression,\nElectroplating, Electrochemical Deposition (ECD), Chemical-\nMechanical Polishing or Planarization (CMP), Topography,\nJMP.\nI. INTRODUCTION\nopper interconnect fabrication is an active and critical\narea of research and development in industry and\nacademia to meet performance requirements for future\nadvanced\ninterconnect\ntechnologies\nwith\nsub-micron\ndimensions. However, there are some fabrication problems in\nrealizing the high yield and economic copper wiring in key\nprocess steps including copper deposition, patterning and\nplanarization. Tradition aluminum interconnect fabrication\ntechnology cannot be transplanted to copper directly. In order\nto solve the fabrication problems, several new technologies are\ndeveloped and introduced. Now dual damascene with\nchemical-mechanical polishing or planarization (CMP) and\nelectrochemical deposition (ECD) is the predominant\nfabrication techniques for copper.\nCMP provides local and global planarization ability to\nsubstitute for dry etching of copper, which suffers from the\nlimited volatile copper compounds. ECD is very efficient to\nfill the damascene structure without voids and seams. The\nsuperconformal filling or superfilling ability is hard to be\nachieved by other copper deposition methods, like PVD.\nHong Cai is with the Microsystems Technology Lab, Massachusetts\nInstitute of Technology, Cambridge, MA 02139 USA\n\nXiaolin Xie is with the Microsystems Technology Lab, Massachusetts\nInstitute of Technology, Cambridge, MA 02139 USA\n\nHowever, copper CMP suffers from problems of dishing and\nerosion, which are heavily dependent on underlying layout\npatterns such as pattern density or pattern pitch. The copper\nelectroplated profile also suffers from pattern dependence. The\ninitial non-uniform topography has a directly impact on the\nCMP polishing behavior and can further affect the non-\nuniformity problem in CMP. The polishing non-uniformity\nprimarily results from the dishing and erosion, which is shown\nin Fig. 1, leads to considerable surface topography\ncontributing\nto\npotential\nyield,\nreliability\nand\nmanufacturability problems as well as process integration\ndifficulties with other processes such as lithography.\nFig. 1. Pattern Dependent Problems of Dishing and Erosion in Copper CMP\n[1].\nIn order to model the pattern dependence in copper\ninterconnect\nfabrication\nprocesses,\nthe\nas-deposited\ntopography is required as an input of the CMP modeling. In\nthis paper, we will discuss the ECD topography regression by\nimplementing the data from a cooperation project with an\noutside company.\nExperiments are performed using MIT/SEMATECH 854\nmultilevel test mask, which has copper line arrays of feature\nsizes in the range of 0.18 μm to 100 μm and layout densities in\nthe range of 1% to 99% [1]. This test mask set has the ability\nto characterize the coupled pattern dependencies in copper\nelectroplating and CMP processes. The mask and test structure\nlayout are shown in Fig. 2.\nLine width and line space are the key factors to affect the\nelectroplated topography, which is characterized by two\nquantities (Step Height and Array Height), as shown in Fig. 3.\nStep height is defined as the bottom depth of each line with\nrespect to the nearby surface, and the array height is defined as\nthe top surface height of copper over an array region with\nrespect to the flat copper field region over a wide oxide area\n\nCai et al.: COPPER ELECTROCHEMICAL DEPOSITION TOPOGRAPHY REGRESSION\n[1]. Tae developed semi-empirically analytical functions of\nline width and line space to express the electroplated\ntopography, in terms of step height and array height.\nFig. 2. Multilevel Test Mask Layout [1].\nMetal 1: Blue (Dark); Metal 2: Magenta (Light).\nThe following content is organized into four sections. In\nSection 2, previous Park's regression models are review and\nimplemented into the data for 5 splits with different copper\nthickness. Each split has two replicates. In Section 3, the\noptimum regression models for each step height and array\nheight are searched from the candidate parameters derived\nfrom a physical electrochemical deposition model. Then,\nintegrated models for SH and AH are presented in Section 4.\nThe relations between the coefficients and the deposited\ncopper thickness are briefly discussed. Finally, the new models\nare compared to Tae's models and a brief discussion is\nprovided in Section 5.\nII. PREVIOUS MODELS\nA. Review\nTo characterize as-deposited copper topography variation, a\nwafer is patterned with MIT 845 test mask and electroplated.\nStep height and array height are measured across many test\npattern arrays and isolated features using a surface profiler.\nThe absolute copper thickness is measured for translating\nrelative surface height measurements into absolute thickness.\nThe measured data is modeled as an empirical function of\nspecific\nlayout\nfeatures\nby\nconsidering\nkey\npattern\ndependencies. After the model parameters are extracted, the\nelectroplating pattern dependent model is calibrated and is\nready to be used to perform chip-scale simulations for the\nelectroplated surface topography for other chips fabricated\nusing the calibrated electroplating process. The simulation\nresult can be used as the initial input to MIT's CMP model.\nTae's electroplating pattern dependency model is based on a\nresponse surface regression [1]. This approach enables us to\nachieve the goal of chip-scale simulation, especially in dealing\nwith random layouts. The following response models are used\nto capture step height and array height variations:\nSH = A * lw + B * lw -1 + C * lw 2 + D * ls + E * lw * ls + Const.\n(1)\nAH = Ae * lw + Be * lw-1 + Ce * lw-2 + De * ls + Ee * lw * ls + Conste.\n(2)\nwhere SH is step height and AH is array height as defined Fig.\n3. lw and ls are line width and line space, respectively, and A,\nB, C, D, E, Const, Ae, Be, Ce, De, Ee, and Conste are model\ncoefficients. The interaction effect of lw and ls is reflected in\nthe lw*ls non-additive item.\nPark assigns any line widths greater than 10μm as 10μm\nand any line spaces greater than 10μm as 10μm. His argument\nis that if the line width is greater than the critical line width\n10μm or the line space is greater than critical space 10μm, the\nSH and AH behavior remains almost constant, as shown in Fig.\n4 and Fig. 5. Another reason is that some extraordinary line\nwidth and line space data make regression difficult. The new\ndata set shows the same pattern, so the same line width and\nline space transformation is applied in the new model\nregression.\n1000.00\n500.00\n0.00\n-500.00\nStep Height\n-1000.00\n-1500.00\n-2000.00\nIsolated Lines\nSeries1\n-2500.00\n-3000.00\n-3500.00\nFig. 3. Topography in Superfilling Copper Electroplating [1].\n-4000.00\n0.10\n1.00\n10.00\n100.00\nLine Width (μm)\nFig. 4. Step Height vs. Line Width for CPT104-slot1.\n\n6.780 SEMICONDUCTOR MANUFACTURING TERM PROJECT, MAY 12 2003\nArray Height\n1000.00\n500.00\n0.00\n-500.00\n-1000.00\n-1500.00\n-2000.00\n0.10\n1.00\n10.00\n100.00\nLine Width (μm)\nFig. 5. Array Height vs. Line Width for CPT104-slot1.\nB. Process Conditions\nThese wafer stack information for the wafers is Wafer film\nstack Si/AP-CVD TEOS 5000A/AP-CVD PE-SiN 500 A /AP\nCVD 3000 A /PVD Ta 300 A /Cu seed 1500 A /Cu EP. The\nelectroplated copper thickness data are shown in Table 1. The\ntrench depth is 3500 A.\nTABLE I\nCOPPER FILM THICKNESS\nWafer Number\nCopper\nThickness (A)\nSeed Layer\nThickness (A)\nEP Copper\nThickness (A)\nI: CPT115-slot1, 2\nII: CPT104-slot1, 2\nIII: CPT115-slot4, 5\nVI: CPT105-slot1, 2\nV: CPT115-slot7, 8\nC. Model Implementation\nJMP 4.1 is used to implement the previous models to fit the\nstep height and array height for the new data sets. The results\nare summarized in Table II and Table III.\nTABLE II\nSTEP HEIGHT REGRESSION RESULTS\nSplit\nR2\nI\n0.965\nII\n0.973\nIII\n0.968\nVI\n0.970\nV\n0.949\nR2\nadj\n0.963\n0.971\n0.965\n0.968\n0.945\nLack of fit\n32.295\n10.738\n10.661\n7.687\n18.437\nEst.\n599.664\n1602.657 1179.359 1510.908\n746.353\nCONST.\nt\n4.62\n11.87\n9.66\n11.21\n5.42\nProb>| t |\n<.0001\n<.0001\n<.0001\n<.0001\n<.0001\nEst.\n-1140.785 -1235.590 -798.109\n-965.676\n-501.056\nlw\nt\n-22.48\n-23.43\n-16.74\n-18.34\n-9.32\nProb>| t |\n<.0001\n<.0001\n<.0001\n<.0001\n<.0001\nEst.\n-52.793\n-268.138\n-228.850\n-268.953\n-163.640\nlw-1\nt\n-1.63\n-7.98\n-7.54\n-8.02\n-4.78\nProb>| t |\n0.1064\n<.0001\n<.0001\n<.0001\n<.0001\nEst.\n83.758\n88.120\n55.024\n65.808\n32.216\nlw2\nt\n19.02\n19.26\n13.30\n14.40\n6.91\nProb>| t |\n<.0001\n<.0001\n<.0001\n<.0001\n<.0001\nEst.\n-5.629\n25.789\n29.894\n14.622\n43.711\nls\nt\n-0.56\n2.47\n3.16\n1.40\n4.10\nProb>| t |\n0.5773\n0.0158\n0.0022\n0.1651\n<.0001\nEst.\n-6.568\n-16.269\n-18.927\n-18.662\n-20.698\nlw*ls\nt\n-3.17\n-7.55\n-9.71\n-8.67\n-9.42\nProb>| t |\n0.0022\n<.0001\n<.0001\n<.0001\n<.0001\nTABLE III\nARRAY HEIGHT REGRESSION RESULTS\nSplit\nI\nII\nIII\nVI\nV\nR2\n0.685\n0.796\n0.881\n0.861\n0.908\nR2\nadj\n0.642\n0.768\n0.865\n0.841\n0.896\nLack of fit\n5.081\n20.801\n24.873\n12.658\n12.105\nEst.\n-435.685 -1283.287 -1579.862 -1626.250 -1455.446\nCONST.\nt\n-3.13\n-5.68\n-7.82\n-6.88\n-7.71\nProb>| t |\n0.0035\n<.0001\n<.0001\n<.0001\n<.0001\nEst.\n-10.027\n-8.099\n-29.371\n-32.084\n-78.773\nlw\nt\n-0.51\n-0.25\n-1.03\n-0.96\n-2.95\nProb>| t |\n0.4486\n0.0152\n0.0004\n0.0004\n0.0002\nEst.\n-88.919\n479.959\n659.297\n772.792\n660.584\nlw-1\nt\n-0.77\n2.55\n3.92\n3.93\n4.20\nProb>| t |\n0.4486\n0.0152\n0.0004\n0.0004\n0.0002\nEst.\n23.907\n-37.132\n-57.459\n-76.130\n-63.347\nlw-2\nt\n1.25\n-1.20\n-2.08\n-2.35\n-2.45\nProb>| t |\n0.2182\n0.2380\n0.0450\n0.0242\n0.0193\nEst.\n82.087\n154.354\n170.082\n174.375\n154.276\nls\nt\n5.92\n6.87\n8.46\n7.42\n8.21\nProb>| t |\n<.0001\n<.0001\n<.0001\n<.0001\n<.0001\nEst.\n-1.656\n-1.325\n0.188\n1.430\n4.401\nlw*ls\nt\n-0.78\n-0.39\n0.06\n0.40\n1.53\nProb>| t |\n0.4389\n0.7017\n0.9515\n0.6926\n0.1335\nAs we seen in the next two tables, the previous model woks\nwell only for the step height regression. The lowest R2 for the\narray height regression is up to 0.685.\nIII. INDIVIDUAL REGRESSION OPTIMIZATION\nA. Physical Model Review\nThe previous models are not very good for the array height\ndata sets. Furthermore it is hard to find physical meanings for\nthe lw*ls item. Improvement the model with more physical\nreasoning is needed. A simple ECD physical model is\nreviewed for the new model design.\nFig. 6. Filling contours predicted by the simple model (left) and the level-set\ncode (right) [2]\nIn order to explain the superfilling behavior in\nelectroplating with multi-component additives in the bath,\nJosell proposed a similar model named curvature enhanced\naccelerator coverage (CEAC) [2] to explain bump formation in\na specific superfilling recipe. All adsorbed additives are\nassumed to keep on or float at the surface during deposition.\nThe accumulation of adsorbed accelerator results from\n\nCai et al.: COPPER ELECTROCHEMICAL DEPOSITION TOPOGRAPHY REGRESSION\nreduction of surface area related to local surface curvature\n(10)\nduring growth. At the region of high positive curvature like the\n(C\nD -δυ)\nCu\nCu\nCu\ns\nDCu\nCu\n\n(w- 2x)\nΩ\nΩ\n(h+ x- y)\n( )t\nC b = -\n× C\n\nδυs\n[2(h+ x- y)υ + (w- 2x)υ ]\ns\nb\n-\nCu\nbottoms of small vias, increased local velocity is observed. A\nsimple geometrical model can reduce the simulation time to\nless than one second by capturing the fundamentals of the\nnear-optimized filling mechanics and using a first-order\ndifferential equation, as shown in Fig. 6.\nFig. 7. A Schematic of the Approximate Geometry for the Simple Model [2]\nStraight vertical and horizontal lines simplify the time\ndependent interface shape in the trench, as shown Fig. 7. The\nlocal growth rate is experimentally derived and expressed in\nterms of the surface coverage of accelerator θ, overpotential η,\nthe cupric ion concentration C at the interface and the bulk\ncupric concentration Ccu in the electrolyte:\n= C υ o ( )\nθ\n( )\nF\nθ\nα\n(3)\n( η\nθ\nυ\n)\nC\nAll these equations describe the simplified trench filling\nprocess.\nB. Individual Optimization Strategy\nAs we seen in the physical model review, the accumulation\nof adsorbed accelerator results from reduction of surface area\nrelated to local surface curvature during growth and the local\ngrowth velocity is a function of the accumulation of adsorbed\naccelerator. So the sidewall growth velocity, υs, and the bottom\ngrowth velocity, υb, will decide the as-deposited topography.\nSo we can use lw-3 , lw-2 , lw-1 , const and even lw to express the\nlocal curvature. After integration, they are lw-2 , lw-1 , ln(lw), lw\nand lw2. That means that we can these items to express the as-\ndeposited topography, or SH and AH. At the same time, we\nneed to consider the cupric ion and additive concentration\nmass transportation and the effective cupric ion and additive\nconcentration might depend on density (lw/(lw+ls)). As for the\nisolated lines, we assign 150 A as the nominal line space only\nfor density computation. Some non-addictive effects between\nls and lw might be incorporated in to density denoted as den.\nIN park's models, ls*lw item is used to account for the non\naddictive effects.\nls\nTherefore, we propose to choose lw-2 , lw-1 , log(lw), lw, lw2 ,\n-1 , log(ls), ls, and den as regression model item candidates.\nThe individual regression model optimization for each split\nwill be implemented in the selected item range.\nC. Optimization Implementation\nexp -\nη\n\nThe evolution of accelerator coverage on the top, sidewalls\n\n, ,\nAccounting for the effects of cupric ion depletion, the cupric\nProb>| t |\n0.0055\n0.0016\n<.0001\n0.0281\nion concentration for the sidewalls Cs and the cupric ion\nEst.\n371.976\n4.01\nconcentration for the sidewalls Cs are written as (9) and (10)\nden\nt\nrespectively.\nProb>| t |\n0.0001\n(9)\ns\nC ( ) = C\n-\nδυ\ns t\nCu\nΩ Cu DCu\nThe individual regression optimization results are list in\nC\nRT\nCu\nTABLE VI\nSTEP HEIGHT REGRESSION RESULTS\nand bottom of the trench is expressed in terms of the\nSplit\nI\nII\nIII\nVI\nV\nconcentration of the accelerator CAccelerator, the diffusion\nR2\n0.973\n0.953\n0.928\n0.941\n0.890\nR2\nadj\n0.972\n0.951\n0.925\n0.938\n0.885\ncoefficient DAccelerator, the number of available sites Γ(1-θ), a\npotential dependent rate constant k(η), the sidewall growth rate\nLack of fit\n23.082\n19.553\n25.480\n16.788\n40.480\nEst.\n-88.117\n1944.545 1577.098 1903.084 1181.318\nυs and the bottom growth rate υb in (4), (5) and (6) .\nCONST.\nt\n-1.22\n11.7\n9.29\n10.76\n6.27\nProb>| t |\n0.2247\n<.0001\n<.0001\n<.0001\n<.0001\ndt\n1 + δΓ k(1-θ ) / D\nEst.\n-978.618\n-281.505\n-244.400\n-284.286\n-180.646\ndθ t =\nC\nr\nAccelerato k(1-θ )\n(4)\nt\nt\nr\nAccelerato\nlw-1\nt\n-15.78\n-6.42\n-5.46\n-6.1\n-3.64\ndθ s\nC\nr\nAccelerato k(1-θ s )\n(5)\nProb>| t |\n<.0001\n<.0001\n<.0001\n<.0001\n0.0005\n=\ndt\n1 + δΓ k (1-θ ) / D\ns\nr\nAccelerato\nEst.\n-6843.032\n\ndθb =\nC\nr\nAccelerato k(1-θ b )\n2θ sυ b + 2θ bυ s\n(6)\nlog(lw)\nt\n-22.16\n\n+\nProb>| t |\n<.0001\ndt\n1 + δΓ k (1-θ ) / D\nw - 2x\nw - 2x\nEst.\n372.460 -1305.478 -879.414 -1045.843 -589.971\nb\nr\nAccelerato\nThe horizontal displacements of the sidewalls and the vertical\nlw\nt\n12.57\n-19.24\n-12.68\n-14.49\n-7.67\ndisplacement of the bottom surface are expressed in (7) and\nProb>| t |\n<.0001\n<.0001\n<.0001\n<.0001\n<.0001\n(8).\nEst.\n82.532\n48.524\n59.398\n25.106\n(7)\nlw2\nt\n13.98\n8.05\n9.46\n3.75\nt\nt\n[θ\nυ\nt ,\n( )] dt\n(t\nx )\n( )\n( )dt\nt\nυ s\n∫\n∫\nt\n∫\n∫\nt\nC t\n=\n=\ns\ns\nProb>| t |\n<.0001\n<.0001\n<.0001\n0.0003\n(8)\n[θ\nυ\nt ,\n( )] dt\nEst.\n-28.363\n-33.104\n-47.495\n-25.184\n(t\ny )\n( )\n( )dt\nt\nυ b\nC t\n=\n=\nb\nb\nls\nt\n-2.86\n-3.26\n-4.49\n-2.24\n\n6.780 SEMICONDUCTOR MANUFACTURING TERM PROJECT, MAY 12 2003\nTable VI and Table V.\nthan the previous model. The lowest R2 for the array height\nThe R2 for the array heights is improved dramatically. The\nregression is equal to 0.864. The lack of fit in the array height\nresults show that it is possible to build new integrated models\nis insignificant. What we need pay attention is that the t values\nto cover a broad rang of deposited copper thickness.\nare overestimated due to the under-estimation of the pure\nerror. The calculated pure error is 100A or so, however the\nraw data noise level is 200~300A. The new items of log(lw)\nTABLE V\nand log(lw) make the new model reflect more physical process\nARRAY HEIGHT REGRESSION RESULTS\nin feature scale.\nSplit\nI\nII\nIII\nVI\nV\nR2\n0.892\n0.937\n0.949\n0.923\n0.970\nTABLE VI\nR2\nadj\n0.880\n0.931\n0.944\n0.915\n0.967\nSTEP HEIGHT REGRESSION RESULTS\nLack of fit\n0.539\n4.788\n8.954\n5.763\n2.554\nSplit\nI\nII\nIII\nVI\nV\nEst.\n-717.607\n117.668 -1230.939 -1171.685 -885.757\nR2\n0.961\n0.953\n0.928\n0.941\n0.890\nCONST.\nt\n-13.47\n1.26\n-15.17\n-10.87\n-9.47\nR2\nadj\n0.959\n0.951\n0.925\n0.938\n0.885\nProb>| t |\n<.0001\n0.2147\n<.0001\n<.0001\n<.0001\nLack of fit\n35.174\n19.553\n25.480\n16.788\n40.480\nEst.\n-11.947\nEst.\n737.683\n1944.545 1577.098 1903.084 1181.318\nlw-2\nt\n-2.83\nCONST.\nt\n5.71\n11.70\n9.29\n10.76\n6.27\nProb>| t |\n0.0074\nProb>| t |\n<.0001\n<.0001\n<.0001\n<.0001\n<.0001\nEst.\n64.596\n277.803\n426.910\nEst.\n-58.189\n-281.505\n-244.400\n-284.286\n-180.646\nlw-1\nt\n2.06\n9.16\n14.36\nlw-1\nt\n-1.71\n-6.42\n-5.46\n-6.10\n-3.64\nProb>| t |\n0.0465\n<.0001\n<.0001\nEst.\n\n-1908.121 -2190.742\nlog(lw)\nt\n-9.53\n-8.24\nProb>| t |\n<.0001\n<.0001\nProb>| t |\n0.0916\n<.0001\n<.0001\n<.0001\n0.0005\nEst.\n-1168.999 -1305.478 -879.414 -1045.843 -589.971\nlw\nt\n-22.16\n-19.24\n-12.68\n-14.49\n-7.67\nEst.\n247.519\n132.612\n159.388\n-331.084\nlw\nt\n4.85\n5.37\n4.86\n-8.45\n\nProb>| t |\n<.0001\n<.0001\n<.0001\n<.0001\n\nEst.\n24.909\n\nlw2\nt\n7.31\n\nProb>| t |\nProb>| t |\n<.0001\n<.0001\n<.0001\n<.0001\n<.0001\nEst.\n81.502\n82.532\n48.524\n59.398\n25.106\nlw2\nt\n17.77\n13.98\n8.05\n9.46\n3.75\nProb>| t |\n<.0001\n<.0001\n<.0001\n<.0001\n0.0003\nEst.\n-27.490\n-28.363\n-33.104\n-47.495\n-25.184\nls\nt\n-3.56\n-2.86\n-3.26\n-4.49\n-2.24\n<.0001\nProb>| t |\n0.0006\n0.0055\n0.0016\n<.0001\n0.0281\nEst.\n265.834\n262.165\n224.528\nls-1\nt\n4.08\n4.78\n3.08\nTABLE VII\nProb>| t |\n0.0002\n<.0001\n0.0039\nARRAY HEIGHT REGRESSION RESULTS\nEst.\n1693.294\n1673.217 1709.023 1376.121\nlog(ls)\nt\n7.46\n16.22\n12.47\n25.58\nSplit\nI\nII\nIII\nVI\nV\nR2\n0.864\n0.936\n0.949\n0.923\n0.961\nProb>| t |\n<.0001\n<.0001\n<.0001\n<.0001\nR2\nadj\n0.845\n0.927\n0.942\n0.912\n0.956\nEst.\n-94.337\nLack of fit\n1.201\n5.306\n9.638\n6.193\n4.122\nls\nt\n-4.54\nProb>| t |\n<.0001\nEst.\n-694.6\n-1116.0\n-1226.3\n-1159.6\n-1141.8\nCONST.\nt\n-11.0\n-12.9\n-13.5\n-9.6\n-13.5\nEst.\n-2754.783\nProb>| t |\n<.0001\n<.0001\n<.0001\n<.0001\n<.0001\nden\nt\n-20.83\nProb>| t |\n<.0001\nEst.\n376.3\n582.8\n-17.2\n-44.4\n64.1\nlw-1\nt\n3.9\n4.3\n-0.1\n-0.2\n0.5\nProb>| t |\n0.0005\n0.0001\n0.9032\n0.8137\n0.6277\nEst.\n789.5\n-231.3\n-1951.2\n-2301.7\n-2010.4\nIV. INTEGRATED MODELS\nlog(lw)\nt\n2.8\n-0.6\n-4.8\n-4.3\n-5.3\nProb>| t |\n0.0081\n0.5555\n<.0001\n0.0001\n<.0001\nBased on the results of individual regression optimization,\nEst.\n-58.5\n33.2\n135.6\n167.1\n125.6\nthe new integrated models are presented in the following two\nlw\nt\n-2.4\n1.0\n3.9\n3.6\n3.9\nequations:\nProb>| t |\n0.0210\n0.3269\n0.0004\n0.0009\n0.0004\nSH = A * lw-1 + B * lw + C * lw2 + D * ls + Const.\n(11)\nls-1\nEst.\n-100.3\n-215.9\n273.5\n253.6\n142.4\nt\n-1.3\n-2.1\n2.5\n1.8\n1.4\nAH = Ae * lw-1 + Be log(\n*\nlw) + Ce * lw + De * ls-1 + Ee log(\n*\nls) + Conste.\nProb>| t |\n0.1879\n0.0432\n0.0155\n0.0845\n0.1638\n(12)\nEst.\n565.9\n1031.7\n1684.2\n1737.2\n1572.0\nwhere SH is step height and AH is array height, lw and ls are\nlog(ls)\nt\n5.9\n7.8\n12.2\n9.5\n12.3\nline width and line space, respectively, and A, B, C, D, Const,\nProb>| t |\n<.0001\n<.0001\n<.0001\n<.0001\n<.0001\nAe, Be, Ce, De, Ee, and Conste are model coefficients. Table\nVI and Table VII show the regression results of the new\nWe plot the residuals of array height fitting with Tae's\nintegrated models.\nmodel and our integrated model in Fig. 8 and Fig. 9. The\nCompared to the previous models, the only difference for\nresidual of the integrated model is more uniformly packed\nthe step height regression is that there is no lw*ls item. The\naround zero compared with that of Tae's model.\nexclusion of the non-physical item affects little in the fitting\nGenerally, the coefficients are roughly consistent in the sign\ngoodness except the last split. The results justify our strategy\nand magnitude except the first split with the thinnest\nto introduce more physical meaning in the model design. On\nelectroplated copper film. There is no surprise for this\nthe other hand, the new models fit the array height much better\nextraordinary result. In fact the coefficients for the fist split\n\nCai et al.: COPPER ELECTROCHEMICAL DEPOSITION TOPOGRAPHY REGRESSION\nreflect the initial deposition stage. One reasonable derivation\nThe fitting goodness of the new models is presented with the\nfrom the physical model is that the topography can be kept in\nprevious model results. The apparent improvement in physical\nsome steady state or quasi-steady state after certain deposited\nbasis brings the power to fix the defect in the array height\nfilm thickness due to the final additive concentration\nmodeling in the previous work.\nequilibrium. The direct results are the similar coefficients in\nFurther research on the qualitative relation between the\nthe last four splits. Some variations in their coefficients can be\ncoefficients and the deposited film thickness is desired. It will\nexplained by the data contamination due to the measurement\ngive us more freedom to predict the topography without the\ntool limits.\ntedious experiments and the ability to co-optimize the CMP\nand ECD processes and then decrease the environment load.\n-400\n-300\n-200\n-100\n-1000\n-600-400\n0 200 400 600 800\nAH array Predicted\nAH array Residual\nHowever, more high-resolution data are necessary for such a\ntask.\nACKNOWLEDGMENT\nThe author would like to thank the Hynix collaborators and\nproject manager, Hyungjun Kim. They would also like to\nthank Joshua Tower and Mario Tongol of Philips Advanced\nMetrology Systems, Inc. At last, the author would like to thank\nTae Park for the generous assistance and discussion. Without\nthe help from all of them, the authors could not finish the term\nproject.\nFig. 8. Residual plot for AH of CPT104 using Tae's model\nREFERENCES\n[1] T. Park, \"Characterization and Modeling of Pattern dependencies in\n-300\n-200\n-100\n-1000 -500\nAH array Predicted\nAH array Residual\nFig. 9. Residual plot for AH of CPT104 using the integrated model\nCopper Interconnects for Integrated Circuits,\" Ph.D. Thesis, Electrical\nEngineering and Computer Science, MIT, May 2002.\n[2] D. Josell, D. Wheeler, W. H. Huber, J. E. Bonevich, and T. P. Moffat, \"A\nSimple Equation for Predicting Superconformal Electrodeposition in\n\"\nsubmicrometer Trenches\", J. Electrochem. Society, Vol. 148, No. 12,\npp. 767-773, 2001.\nHong Cai received the dual B.S. degrees in materials science & engineering\nand economics from Tsinghua University, Beijing, P.R.C., in 1998, and the\nM.S. degree in materials science & engineering from Tsinghua University. He\nis currently pursuing the Ph.D. degree in the Department of Materials Science\nand Engineering, MIT.\nFrom 1997 to 2000, he worked on composite multilayer ceramic capacitor.\nIn the following two year, his research interest was non-lead ferroelectrics\nproject supported by NSF and DARPA. Since 2002, he has been a member of\nMicrosystems Technology Lab, MIT. His current research is focus on the\nmultilevel metallization modeling and simulation and chemical- mechanical\npolishing (CMP) test mask design.\nV. CONCLUSION\nIn this term project paper, new models to describe the\npattern dependent topography after copper electroplating are\ndeveloped for fitting the sequential data sets. The basic\nstrategy is to choose the appropriate model items with the aids\nof a simple physical electroplating feature scale model. By\nscreening the item candidates proposed by the physical model,\nindividual regression optimization are carried. The results\nprovide the guidance for the desired integrated models, which\ncan cover a broad range of copper film thickness. The new\nmodels are helpful to implement the CMP modeling in the\nfurther research.\nXiaolin Xie received B.S. degree in physics from Caltech in 2000. He is\ncurrently pursuing the Ph.D. degree in the Physics Department, MIT.\nFrom 2000 to 2001, he studied transport property of artificial solid. He\njoined Microsystems Technology Lab at the beginning of 2002. His current\nresearch is focus on modeling of STI chemical mechanical polishing (CMP)\nmodeling and nanotopography in CMP."
    },
    {
      "category": "Resource",
      "title": "cai_xie_talk.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-780-semiconductor-manufacturing-spring-2003/cd2730f51a142ecf4f25eeadb3b2e27e_cai_xie_talk.pdf",
      "content": "6.780\n6.780 Term Project\nTerm Project\nCopper Electrochemical Deposition Topography\nCopper Electrochemical Deposition Topography\nRegression\nRegression\nHong Cai and Xiaolin Xie\nInstructor: Prof. Duane Boning (EECS)\nMicrosystems Technology Laboratory\nMassachusetts Institute of Technology\nCambridge, MA\n\nPresentation Overview\n- Introdcution\n- Copper technology\n- Electroplating\n- Review of previous electroplating model\n- Proposed model\n- Characterization Mask and Measurements\n- Re-examine model parameters\n- Investigate the significance of model parameters\n- Integreated model\n- Conclusion\n\nIntroduction\nMultilevel Copper Metallization:\n- Critical Interconnect Technology\n- Dual Damascene:\nChemical-Mechanical Polishing\nElectrochemical Deposition\n- Advantages:\nLocal and Global Planarization\nSuperfilling Ability\nLower Cost\n- Problems:\nDishing & Erosion in Copper CMP\nPattern Dependence of ECP\nMultilevel Interconnect Structure\n- Modeling of Multilevel Metallization\nMultilevel Process Sequence\nT. Park, \"Characterization and Modeling of Pattern\ndependencies in Copper Interconnects for Integrated\nCircuits,\" Ph.D. Thesis, MIT, May 2002\n\nLiterature Review - ECD models\nCopper Electroplating:\n- Superfilling\n- Organic Additives:\n- Accelerators\n- Suppressors w/ Chloride Ions\n- Levelers\n- Models:\nDiffusion-Adsorption Mechanism\nAndricacos; West; Cao etc.\nSingle-component to Multi-component\nLeveler Absent\nWest \"Accelerator-Accumulation Model\"\nMoffat \"Curvature Enhanced Accelerator\nCoverage Model\"\nEvolution of hole filling with different deposition conditions\nR. Rosenberg, D. C. Edelstein, C.-K. Hu, and K. P. Rodbell,\nAnnu. Rev. Mater. Res., Vol. 30, pp. 229-262, 2000.\n\nLiterature Review - Tae's ECD Model\nStep Height: Bottom Depth of Each Line with respect to the Nearby Surface\nArray Height: Top Surface Height of Copper over an Array Region with respect to\nthe Flat Copper Field Region over a Wide Oxide Area\nTopography in Superfilling Copper Electroplating\nT. Park, Ph.D. Thesis, Electrical Engineering and Computer Science, MIT, May 2002.\n.\n*\n*\n*\n*\n*\n*\nConst\nls\nlw\nE\nls\nD\nlw\nC\nlw\nB\nlw\nA\nSH\n+\n+\n+\n+\n+\n=\n-\n.\n*\n*\n*\n*\n*\n*\nConste\nls\nlw\nEe\nls\nDe\nlw\nCe\nlw\nBe\nlw\nAe\nAH\n+\n+\n+\n+\n+\n=\n-\n-\n\nCharacterization Mask\nIntegrated Chip-Scale ECD/CMP Model :\n- Developed by Park and Tugbawa\n- Extension to the Multilevel Metallization\nAddition of a Interlevel Dielectric Deposition\nModel\nOther Extensions to Accommodate a Pre-\nexisting Surface Topography Created by\nprevious CMP\n- MIT/SEMATECH 854 Multilevel Test Mask:\n- Feature Sizes 0.18 μm to 100 μm\n- Layout Densities 1% to 99%\n- Physical and Electrical Measurement\nMetal 1: Blue (Dark); Metal 2: Magenta (Light)\nMultilevel Test Mask Layout\n\nECD Experiments\n- Several Electroplated Wafers with different target copper\nthickness\n# of Split\n# of\nWafers\nTarget Copper\nThickness (μm)\nMeasured Copper\nThickness (μm)\n~0.4\n~0.7\n~0.9\n~1.15\n~1.5\n0.27\n0.86\n1.04\n1.17\n1.46\n- Each split has 21 measurement sites\n\nExperiment Data for Split 1\n-4000.00\n-3500.00\n-3000.00\n-2500.00\n-2000.00\n-1500.00\n-1000.00\n-500.00\n0.00\n500.00\n1000.00\n0.10\n1.00\n10.00\n100.00\nLine Width (μm)\nStep Height\nIsolated Lines\nSeries1\n-2000.00\n-1500.00\n-1000.00\n-500.00\n0.00\n500.00\n1000.00\n0.10\n1.00\n10.00\n100.00\nLine Width (μm)\nArray Height\nStep height vs. Line width\nArray height vs. Line width\n\nFit with Tae's Model- Array Height\nAH\n0.4\n0.7\n0.9\n1.15\n1.5\nR_square\n0.685\n0.796\n0.881\n0.861\n0.908\nR_square_adj\n0.642\n0.768\n0.865\n0.841\n0.896\nLack of fit\n5.081\n20.801\n24.873\n12.658\n12.105\nEst.\n-435.685\n-1283.287\n-1579.862\n-1626.250\n-1455.446\nt\n-3.130\n-5.680\n-7.820\n-6.880\n-7.710\nProb>|t|\n0.0035\n<.0001\n<.0001\n<.0001\n<.0001\nEst.\n-10.027\n-8.099\n-29.371\n-32.084\n-78.773\nt\n-0.510\n-0.250\n-1.030\n-0.960\n-2.950\nProb>|t|\n0.6140\n0.8014\n0.3110\n0.3435\n0.0056\nEst.\n-88.919\n479.959\n659.297\n772.792\n660.584\nt\n-0.770\n2.550\n3.920\n3.930\n4.200\nProb>|t|\n0.4486\n0.0152\n0.0004\n0.0004\n0.0002\nEst.\n23.907\n-37.132\n-57.459\n-76.130\n-63.347\nt\n1.250\n-1.200\n-2.080\n-2.350\n-2.450\nProb>|t|\n0.2182\n0.2380\n0.0450\n0.0242\n0.0193\nEst.\n82.087\n154.354\n170.082\n174.375\n154.276\nt\n5.920\n6.870\n8.460\n7.420\n8.210\nProb>|t|\n<.0001\n<.0001\n<.0001\n<.0001\n<.0001\nEst.\n-1.656\n-1.325\n0.188\n1.430\n4.401\nt\n-0.780\n-0.390\n0.060\n0.400\n1.530\nProb>|t|\n0.4389\n0.7017\n0.9515\n0.6926\n0.1335\nLw*Ls\nLs\nLw^-2\nLw^-1\nLw\nConst\n\nFit Tae's Model- Step Height\nSH\n0.4\n0.7\n0.9\n1.15\n1.5\nR_square\n0.965\n0.973\n0.968\n0.970\n0.949\nR_square_adj\n0.963\n0.971\n0.965\n0.968\n0.945\nLack of fit\n32.295\n10.738\n10.661\n7.687\n18.437\nEst.\n599.664\n1602.657\n1179.359\n1510.908\n746.353\nt\n4.620\n11.870\n9.660\n11.210\n5.420\nProb>|t|\n<.0001\n<.0001\n<.0001\n<.0001\n<.0001\nEst.\n-1140.785\n-1235.590\n-798.109\n-965.676\n-501.056\nt\n-22.480\n-23.430\n-16.740\n-18.340\n-9.320\nProb>|t|\n<.0001\n<.0001\n<.0001\n<.0001\n<.0001\nEst.\n-52.793\n-268.138\n-228.850\n-268.953\n-163.640\nt\n-1.630\n-7.980\n-7.540\n-8.020\n-4.780\nProb>|t|\n0.1064\n<.0001\n<.0001\n<.0001\n<.0001\nEst.\n83.758\n88.120\n55.024\n65.808\n32.216\nt\n19.020\n19.260\n13.300\n14.400\n6.910\nProb>|t|\n<.0001\n<.0001\n<.0001\n<.0001\n<.0001\nEst.\n-5.629\n25.789\n29.894\n14.622\n43.711\nt\n-0.560\n2.470\n3.160\n1.400\n4.100\nProb>|t|\n0.5773\n0.0158\n0.0022\n0.1651\n<.0001\nEst.\n-6.568\n-16.269\n-18.927\n-18.662\n-20.698\nt\n-3.170\n-7.550\n-9.710\n-8.670\n-9.420\nProb>|t|\n0.0022\n<.0001\n<.0001\n<.0001\n<.0001\nLw*Ls\nLs\nLw^-2\nLw^-1\nLw\nConst\n\nWe Want More Physical Insights\nA Simple Geometrical Model :\n- Based on CEAC Model\n- Straight Vertical and Horizontal Lines\n- Local Growth Rate\n- Horizontal and Vertical Displacement\nA Schematic of the Approximate Geometry for a Simple Model\nD. Josell, D. Wheeler, W. H. Huber, J. E. Bonevich, and T. P.\nMoffat, J.E.S. , Vol. 148, No. 12, pp. 767-773, 2001.\n\nRe-examine Model Parameters\nJosell suggests growth rate\n~ curvature\n- In trench\ngrowth rate ~ lw-3,lw-2, lw-1,\nconst, lw\n-Raised area\ngrowth rate ~ ls-2, ls-1, const\n- Density (lw/(lw+ls))\nModel parameters\nlw-2\nlw-1\nlog(lw)\nlw\nlw2\nls-1\nlog(ls)\nls\nden\n∫\n\nStep Height Regression\nSH\n0.4\n0.7\n0.9\n1.15\n1.5\n0.973081\n0.95349\n0.928218\n0.940541\n0.890403\n0.971718\n0.951135\n0.924584\n0.93753\n0.884853\n23.0819\n19.5529\n25.4797\n16.7879\n40.4799\nEst.\n-88.11664\n1944.5453\n1577.0976\n1903.0837\n1181.3182\nt\n72.00722\n11.7\n9.29\n10.76\n6.27\nProb>|t|\n0.2247\n<.0001\n<.0001\n<.0001\n<.0001\nEst.\n372.45984\n-1305.478\n-879.4136\n-1045.843\n-589.9706\nt\n29.64162\n-19.24\n-12.68\n-14.49\n-7.67\nProb>|t|\n<.0001\n<.0001\n<.0001\n<.0001\n<.0001\nEst.\n82.531919\n48.523615\n59.398313\n25.106428\nt\n13.98\n8.05\n9.46\n3.75\nProb>|t|\n<.0001\n<.0001\n<.0001\n0.0003\nEst.\n-978.6177\n-281.5053\n-244.4001\n-284.2856\n-180.6464\nt\n62.0174\n-6.42\n-5.46\n-6.1\n-3.64\nProb>|t|\n<.0001\n<.0001\n<.0001\n<.0001\n0.0005\nEst.\n-28.36327\n-33.10376\n-47.49509\n-25.18388\nt\n-2.86\n-3.26\n-4.49\n-2.24\nProb>|t|\n0.0055\n0.0016\n<.0001\n0.0281\nEst.\n-6843.032\nt\n308.7443\nProb>|t|\n<.0001\nEst.\n371.97591\nt\n92.70221\nProb>|t|\n0.0001\nden\nlog(Lw)\nLw2\nLw-1\nLs\nR_square_adj\nLack of fit\nConst\nLw\nR_square\n\nArray Height Regression\nAH\n0.4\n0.7\n0.9\n1.15\n1.5\n0.892074\n0.937413\n0.949214\n0.92293\n0.970162\n0.880407\n0.930647\n0.943724\n0.914598\n0.966936\n0.5386\n4.7878\n8.9538\n5.7626\n2.5536\nEst.\n-717.6067\n117.668\n-1230.939\n-1171.685\n-885.7573\nt\n-13.47\n1.26\n-15.17\n-10.87\n-9.47\nProb>|t|\n<.0001\n0.2147\n<.0001\n<.0001\n<.0001\nEst.\n247.51906\n132.6121\n159.38763\n-331.0837\nt\n4.85\n5.37\n4.86\n-8.45\nProb>|t|\n<.0001\n<.0001\n<.0001\n<.0001\nEst.\n24.909473\nt\n7.31\nProb>|t|\n<.0001\nEst.\n64.596456\n277.80282\n426.91038\nt\n2.06\n9.16\n14.36\nProb>|t|\n0.0465\n<.0001\n<.0001\nEst.\n-11.94738\nt\n-2.83\nProb>|t|\n0.0074\nEst.\n-94.33653\nt\n-4.54\nProb>|t|\n<.0001\nEst.\n265.83364\n262.16547\n224.52839\nt\n4.08\n4.78\n3.08\nProb>|t|\n0.0002\n<.0001\n0.0039\nEst.\n-1908.121\n-2190.742\nt\n-9.53\n-8.24\nProb>|t|\n<.0001\n<.0001\nEst.\n1693.2938\n1673.2166\n1709.0233\n1376.1209\nt\n7.46\n16.22\n12.47\n25.58\nProb>|t|\n<.0001\n<.0001\n<.0001\n<.0001\nEst.\n-2754.783\nt\n-20.83\nProb>|t|\n<.0001\nden\nR_square\nR_square_adj\nLack of fit\nConst\nLw\nLw-1\nLw-2\nLs\nLw2\nLs-1\nlog(Lw)\nlog(Ls)\n\nIntegrated Step Height Model\nModel parameters: lw-1, lw, lw2 ,ls\nSH\n0.4\n0.7\n0.9\n1.15\n1.5\n0.961\n0.953\n0.928\n0.941\n0.890\n0.959\n0.951\n0.925\n0.938\n0.885\n35.174\n19.553\n25.480\n16.788\n40.480\nEst.\n737.7\n1944.5\n1577.1\n1903.1\n1181.3\nt\n5.7\n11.7\n9.3\n10.8\n6.3\nProb>|t|\n<.0001\n<.0001\n<.0001\n<.0001\n<.0001\nEst.\n-1169.0\n-1305.5\n-879.4\n-1045.8\n-590.0\nt\n-22.2\n-19.2\n-12.7\n-14.5\n-7.7\nProb>|t|\n<.0001\n<.0001\n<.0001\n<.0001\n<.0001\nEst.\n81.5\n82.5\n48.5\n59.4\n25.1\nt\n17.8\n14.0\n8.1\n9.5\n3.8\nProb>|t|\n<.0001\n<.0001\n<.0001\n<.0001\n0.0003\nEst.\n-58.2\n-281.5\n-244.4\n-284.3\n-180.6\nt\n-1.7\n-6.4\n-5.5\n-6.1\n-3.6\nProb>|t|\n0.0916\n<.0001\n<.0001\n<.0001\n0.0005\nEst.\n-27.5\n-28.4\n-33.1\n-47.5\n-25.2\nt\n-3.6\n-2.9\n-3.3\n-4.5\n-2.2\nProb>|t|\n0.0006\n0.0055\n0.0016\n<.0001\n0.0281\nR_square\nLw2\nLw-1\nLs\nR_square_adj\nLack of fit\nConst\nLw\n\nIntegrated Array Height Model\nModel parameters: lw-1, log(lw), lw, ls-1 ,log(ls)\nAH\n0.4\n0.7\n0.9\n1.15\n1.5\n0.864\n0.936\n0.949\n0.923\n0.961\n0.845\n0.927\n0.942\n0.912\n0.956\n1.201\n5.306\n9.638\n6.193\n4.122\nEst.\n-694.6\n-1116.0\n-1226.3\n-1159.6\n-1141.8\nt\n-11.0\n-12.9\n-13.5\n-9.6\n-13.5\nProb>|t|\n<.0001\n<.0001\n<.0001\n<.0001\n<.0001\nEst.\n-58.5\n33.2\n135.6\n167.1\n125.6\nt\n-2.4\n1.0\n3.9\n3.6\n3.9\nProb>|t|\n0.0210\n0.3269\n0.0004\n0.0009\n0.0004\nEst.\n376.3\n582.8\n-17.2\n-44.4\n64.1\nt\n3.9\n4.3\n-0.1\n-0.2\n0.5\nProb>|t|\n0.0005\n0.0001\n0.9032\n0.8137\n0.6277\nEst.\n-100.3\n-215.9\n273.5\n253.6\n142.4\nt\n-1.3\n-2.1\n2.5\n1.8\n1.4\nProb>|t|\n0.1879\n0.0432\n0.0155\n0.0845\n0.1638\nEst.\n789.5\n-231.3\n-1951.2\n-2301.7\n-2010.4\nt\n2.8\n-0.6\n-4.8\n-4.3\n-5.3\nProb>|t|\n0.0081\n0.5555\n<.0001\n0.0001\n<.0001\nEst.\n565.9\n1031.7\n1684.2\n1737.2\n1572.0\nt\n5.9\n7.8\n12.2\n9.5\n12.3\nProb>|t|\n<.0001\n<.0001\n<.0001\n<.0001\n<.0001\nLs-1\nlog(Lw)\nlog(Ls)\nLw\nLw-1\nR_square\nR_square_adj\nLack of fit\nConst\n\nConclusion\n- We re-examine the physical meaning of model parameters\nof previous ECD model\n- Integrated model proposed uses parameters with more\nphysical meaning: lw-1, log(lw), lw, lw2, ls-1 ,log(ls), ls\n- The integrated model performs better in the array height\nprediction and comparable in the step height compared\nwith Tae's electroplating model\n- Further study on the relationship between the regression\ncoefficients and film thickness is desired"
    },
    {
      "category": "Resource",
      "title": "chen_rep.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-780-semiconductor-manufacturing-spring-2003/cd50f04b4f880d3b04d1f4d9bab59622_chen_rep.pdf",
      "content": "Improvement in Mechanoluminescence intensity\nof Ca2Al2SiO7: Ce by statistical approach\nMay 14, 2003\nJianglong Chen\nAbstract--The mechanoluminescence phenomena of the\nCa2Al2SiO7 : Ce prepared under designed experiment conditions\nwere investigated by fractional factorial design and ANOVA. The\nmechanoluminescence behavior is shown strongly influenced by\nthe amount of Ca2+ and Si4+ cations in the crystal. Optimal\ncomposition of the oxide compounds was obtained and the\nmechanoluminescence intensity was fitted with a first order\nlinear model. Intense blue light, which was clearly visible to the\nnaked eye, was emitted when the sample of the Ca2Al2SiO7 :Ce\nwas pressed.\nIndex term --Mechanoluminescence, Fractional Factorial\nDesign, ANOVA\nI. INTRODUCTION\nechanoluminescence\nrefers\nto\nthe\nlight\nMemission from a material induced by stress that\ncaused deformation or fracture of solids. This\nphenomenon has been known to exist in silica and\nquartz, sugar, rocks, alkali halide, II-VI compounds\nand polymer crystals [1]. However, the mechano\nluminescence intensities of these existing materials\nare not strong enough for practical usage.\nRecently it was found that rare-earth-doped\noxides emit comparatively intensive visible light\nwhen stress is applied to these oxides, such as\nBaAl2Si2O8: Ce, Sr3Al2O6: Eu, and SrAl2O4:Eu, etc.\nIn this study, the author explored Ca2Al2SiO7: Ce\nand optimized the mechanoluminescence intensity\nusing Factorial Design and Analysis of Variance\n(ANOVA) methods. The effects of eight control\nfactors\nwere\ninvestigated\nand\ncompared\nto\ndetermine which factors are significant to affect the\nmechanoluminescence intensity.\nII. BACKGROUND\nMechanoluminescence (ML) materials could be\nused as stress indicators. The goal of the\ndevelopment of mechanoluminescence materials is\nto achieve either a luminous paint or film coating\nthat can be applied on the surface of objects under\nstress, so that the distribution of stress can be\nvisualized.\nEven though there have been some efforts to\nobserve stress distribution using the bending or\ncontraction of monotonously shaped mechano\nluminescence samples (bar or sphere), it is difficult\nto see the actual shape of stress distribution in the\ncentered region because of abundant light emission\non the contact area with the loading device. In\naddition, no such effort has ever been made for the\nconventional samples widely used for mechanical\ntests such as tensile specimens, compact tension\n(CT) specimens, etc [1].\nMechanoluminescence is associated with a trap-\ninvolved process, in which electrons (or holes)\ndwell in the trap for some time and then recombine\nwith the luminescence center either by traveling in\nthe conduction band (or valence band) or by\nelectron (or holes) tunneling. As for mechano\nluminescence\nmaterials,\nin\nparticular,\nthe\nrecombination\nprocess\nis\nfacilitated\nby\nthe\nassistance of dislocation in the crystal [2]. The light\nemission model has been suggested. Eu2+ ions were\nfound to emit a bright green light under 365 nm\nexcitation, while Ce2+ has a blue color.\nIII. EXPERIMENTAL PROCEDURES\nOxides powders were mixed and sintered at\nvarious temperatures in different atmospheres. Test\nsamples were made by molding a consistent amount\nof prepared powders (1.0 g) with 3.5g epoxy resin\nin a Φ25mm × 15mm die. Then the mechano\nluminescence intensity was measured with a\nphotomultiplier tube. The test data were in the unit\nof cps (count per second).\nEight experimental parameters were selected\nand set at different level as shown in Table 1. Factor\n1.\n\nA (atmosphere) was set at two levels (Level0 and\nLevel1) and the rest seven factors were at three\nlevels. They were labeled as Level0, Level1 and\nLevel2. As it is seen from the design of this\nexperiment, 2137 = 4374 trials are required to\ncomplete the whole experiment, which is unfeasible\nin practice. Orthogonal main effect design is\nappropriate because the size of the design is limited\nand there are mixed levels [3]. Thus, an L18 (21·37)\northogonal array design was utilized to reduce the\ntrial number down to eighteen. In this design, the\neight main effects are orthogonal, which means that\nthe estimate of one main effect is independent of the\nother main effects. The data were then analyzed by\nANOVA method.\nTable 1. Experimental factors and their levels\nFactors\nLevels\nA\nAtmosphere\nAr\nAr+H2(5%)\n-\nB\nTemperature(°C)\nC\nSintering time (h)\nD\nCeO2 (mol)\n0.00001\n0.00005\n0.00010\nE\nAl2O3 (mol)\n0.009\n0.010\n0.011\nF\nSiO2 (mol)\n0.009\n0.010\n0.011\nG\nCaCO3 (mol)\n0.018\n0.020\n0.022\nH\nH3BO3 (mol)\n0.001\n0.002\n0.003\nIn this parameter design methodology, each row\nof the orthogonal array represents a run, which is a\nspecific set of factor levels to be tested. This L18\northogonal array accommodates one factor at two\nlevels and seven factors at three levels in total\neighteen runs, and the underline distribution of each\nresponse is assumed to be normal distribution with\nsame\nvariance,\nwhich\ncomplies\nwith\nthe\nrequirements\nfor\nANOVA.\nHowever,\nthe\ncomplexity of this design, particularly when three\nlevel factors are used, will lead to partial\nconfounding of two-factor interactions with main\neffects. Usually the comfouding pattern is so\ncomplicated that even two-factor interactions are\nnot considered, and higher level interactions are\nassumed negligible. If any two-factor interactions\nare large, this may end in an incorrect analysis of\nthe experiment [4].\nTaguchi argued that it is not necessary to\nconsider two-factor interactions explicitly [5]. It is\npossible to eliminate these interactions either by\ncorrectly specifying the response and design factors\nor by using a sliding setting approach to choose\nfactor levels. In practice, unless we obtain high\nlevel of process knowledge, these two approaches\nare usually difficult to implement. Therefore, the\nlack of provision for thoroughly dealing with\npotential interactions between the experimental\nfactors is a major weakness of this approach.\nIV. DATA ANALYSIS AND DISCUSSION\nThe mechanoluminescence intensities were\ntested after the L18 design of experiment was\naccepted and the data are shown in Table 2. The\nintensity varied in a range from 44 cps to 13324\ncps, which indicated that the combination of these\neight\nfactors\nlargely\nimpacts\nthe mechano\nluminescence intensity of this material.\nTable 2. L18 orthogonal array design and test result\n#\nA\nB\nC\nD\nE\nF\nG\nH\nCps\nThese data were then subjected to ANOVA (in\nMatlab) to estimate the significance of each factor,\nas shown in Table 3. And the mean square values\nwere then compared with the residual/error term.\nAccording to the F distribution, we can thus obtain\nthe possibility of rejecting a hypothesis that each\nfactor is statistically significant.\n2.\n\nSource\n(104)\nd.f.\n(104)\nF\nP(F)\nA. Atmosphere\n39.35\n39.4\n6.5\n0.13\nTable 3. ANOVA table of ML intensity\nS. S.\nM. S.\nB. Temperature\n283.8\n141.9\n23.5\n0.04\nC. Sintering time\n3.74\n1.87\n0.3\n0.76\nD. CeO2\n138.8\n69.40\n11.5\n0.08\nE. Al2O3\n79.41\n39.71\n6.6\n0.13\nF. SiO2\n383.6\n191.8\n31.7\n0.03\nG. CaCO3\n768.8\n0.007\nH. H3BO3\n96.28\n48.14\n7.9\n0.11\nError\n12.08\n6.04\nTotal\nR2\n99.5%\nR2\nadj\n96.0%\nThe degree of freedom of the two-level factor is\none, while that of the three-level factor is two. The\ntotal eight factors would need fifteen degrees of\nfreedom, and left two degrees of freedom for the\nerror term, which is probably unsatisfying for\nsignificance estimation. It is observed from table 3\nthat factor A and factor C have less influence on the\nintensity of this material. So we pooled these two\nitems into the error term and reran the ANOVA for\nbetter estimation of the error term. The new results\nare shown in Table 4.\nTable 4. Adjusted ANOVA table of\nmechanoluminescence intensity\nSource\nS. S.\nd.f.\nM.S.\nF\nP(F)\nB. temp\n283.8\n141.90\n12.9\n0.01\nD. CeO2\n138.8\n69.40\n6.3\n0.04\nE. Al2O3\n79.4\n39.71\n3.6\n0.10\nF. SiO2\n383.6\n191.80\n17.4\n0.006\nG. CaCO3\n768.75\n69.7\n0.000\nH. H3BO3\n96.28\n48.14\n4.4\n0.08\nError\n55.17\n11.03\nTotal\nR2\n98%\nR2\nadj\n92.7%\nThe F value of the analysis indicates that the\nCaCO3 amount is the most important control factor\nin the examined experimental range. The amount of\nSiO2 and sintering temperature are also statistically\nsignificant. On the other hand, the F statistics of the\nAl2O3 concentrations is 3.6, which is smaller than F\n(2,8:5%) of 4.46, thus the effect of Factor E (Al2O3)\nis not statistically significant in this study.\nAccordingly, the same conclusion also applied to\nFactor H (H3BO3) and the content of H3BO3 is not\nstatistically significant.\nFig. 1. Crystal structure of Ca2Al2SiO7\nTo explain the effects of those significant\nfactors, it is necessary to directly relate these factors\nto the structure of the material. The structure of\nCa2Al2SiO7 [6] is shown in Fig. 1. The structure is\ncomprised of layers and spacing between layers.\nWithin each layer structure, the tetrahedral unit is\nconnected via Al3+and Si4+. These layers are linked\ntogether by the large cation Ca2+, which is\nsurrounded with five tetrahedral and located in\nirregular octahedrons. It was suggested that the Ca2+\nand Si4+ ions of Ca2Al2SiO7 strongly influence the\nmechanical properties, because the Ca2+ ions link\nthe layers and the Si4+ ions connect the tetrahedra in\nthe crystal structure, which can explain why the\nCaCO3 and SiO2 are significant control factors for\nthe mechanoluminescence intensity. When the\nsintering temperature is high, the crystal quality is\nimproved.\nThe individual effect of factors was summarized\nin table 5 according to the following equations:\n∆yij = 1 ∑ yijk - y\nn\nk\nn -- the run number of each effect at the same level;\n∑ yijk -- the sum intensity of factor i at level j;\nk\ny -- the average intensity of the 18 runs;\n3.\n\n--\nThe mechanoluminescence intensity as a\nTable 5. Effect of individual factor\nfunction of individual effect of each factor at\nEffect\nLevel 0\nLevel 1\nLevel 2\nDifference\nA\n-467.6\n467.4\n935.00\nB\n-1696.8\n396.8\n2996.8\nC\n1.66\n175.5\n-177.5\n353.00\nD\n-1006.8\n-126.5\n2139.8\nE\n-928.2\n589.7\n338.2\n1517.9\nF\n-1763.2\n-48.8\n1811.7\n3574.9\nG\n4123.3\n-1816.2\n-2307.5\n6430.8\nH\n-925.5\n862.7\n62.5\n1788.2\nThe effect is defined as the difference between\nthe mean value of intensities of same factor at the\nsame level and the grant average, which is about\n2726 cps in the measurements. It is shown that\neffect A and effect C are less significant than the\nrest other effects. The intensity difference of effect\nC is only 353, and effect A 's intensity difference is\nonly 935. These observations agree with the\nANOVA results.\ncps\n5 103\n4 103\n3 103\n2 103\n1 103\n-1 103\n-2 103\n-3 103\nA\nB\nC\nD\nE\nF\nG\nH\n2 Level\nFig. 2. Individual effect of factors at each level\ndifferent levels is illustrated in Fig. 2. It is easy to\nsee that although most of the effect will lead to a\nhigher mechanoluminescence intensity from Level0\nto Level2, factor G actually achieved the highest\nintensity at Level0 and the lowest at Level2.\nThe overall optimal intensity of this material\ncould be extrapolated from this plot if we assume\nthat it equals to a first-order linear combination of\nthe effect of all main factors at their maximum\nvalues. This is a strong assumption because no\ninteraction terms between the main effects are\nincluded in this combination and they are simply\nneglected. Thus, optimal intensity can be achieved\nin the following conditions, as shown in table 6.\nThe maximum predicted by this assumption is:\ncps _ max = ∑max(effecti )\ni=1\n= 467 +1300 +176 +1133 + 590 +1812\n+ 4123 + 863 + 2726\n≈ 13200\nTable 6. Optimal experimental conditions\nby first-order approximation\nFactor\nLevel\nReal Value\nA\nSintering atmosphere=Ar+5%H2\nB\nSintering temperature=1400oC\nC\nSintering time=3 hours\nD\nCeO2=0.0001mol\nE\nAl2O3=0.01mol\nF\nSiO2 = 0.011mol\nG\nCaCO3 = 0.018mol\nH\nH2BO3 =0.002mol\nA first-order response surface model is created\nto test the validity of first-order approximation\nassumption and to fit these effects by the least\nsquares estimation of parameters. Note that since\nthis is only a first order approximation, higher order\nof main effects and their interactions were neglected\nin this model.\nIn this response surface model, the relationship\nbetween the true mean response and eight main\nfactors is established [7]:\n4.\n\nY = β + ∑β i X i + ε\nExperimental data (cps)\ni=1\nY is the measured intensity value in each trial\nwith different combination of main factors. β i is\nthe unknown fitting parameters, and ε is a random\nerror number. If ε has a zero mean, the systematic\nportion of the model represents the true mean\nintensity cps, that is,\ncps = β + ∑β i X i\ni=1\nXi is coded as the level of factor i. Note that\nfactor D (the amount of CeO2) is not evenly\ndesigned.\nThe coded variables and the measured intensity\nvalues are given in table 2. The fitted first-order\nmodel for the mechanoluminescence intensity is\ngenerated in Matlab:\ncps = 1000 × ( 0799\n.\n+ A × 9351\n.\n+ B ×\n.\n- C × 0896\n.0\n+ D ×\n.1\n+ E × 6332\n.0\n+\nF ×\n.\n- G × 2154\n.3\n+ H × 4940\n.0\n)\nIf Factor A and Factor C are excluded from the\nregression, the linear model becomes:\n=\ncps 1000 ×\n1.0699\n*\nD\n+\n1.4989\n*\nB\n+\n(0.4579\n0.4940)\n*\nH\n+\n3.2154\n*\nG\n-\n1.7874\n*\nF\n+\n0.6332\n*\nE\n+\nThe R2 values in these two regressions exceed\n0.9, which could indicate a good fit in both cases,\nand the validity of first-order approximation is\nconfident. Although Factor A and C are excluded\nfrom the model, the R2 values only change about\n1% which means Factor A and C are not important\nin the fitting model.\nIt is also found in this model that the optimal\nexperimental condition is [1 2 0 2 2 2 0 2], and the\nmaximum value of the mechanoluminescence\nintensity is 12917 cps, which are very close to the\nexperimental result in the 2137 test (run number 16)\nor result in the linear combination approximation.\nThe regression model is shown in Fig. 2.\n1.4 10\n1.2 104\n1 10\n8 103\n6 10\n4 103\n2 103\n-2 103\n1.2 104\nModel (cps)\n(a). Regression model with all factors\nExperimental data\n2 =\nR\n.0\n1.4 104\n1.2 104\n1 104\n8 10\n6 103\n4 103\n2 103\n-2 103\n1.2 10\nModel\n(b). Regression model without Factor A and C\nFig. 2. Comparison of model\n2 =\nR\n.0\n5.\n\nAfter the significances of Factor G, F and B are\nconfirmed, the author tended to fine-tune these three\nparameters in the vicinity of the \"predicted\nmaximum intensity\" point. The center point is\ndefined as the composition of Ca2Al2SiO7 at the\nhighest mechanoluminescence intensity. Then the\ncontents of CaCO3, SiO2 and the sintering\ntemperature were changed, and the samples were\ntaken mechanoluminescence measurement as shown\nin Fig. 3.\nThe starting composition is SiO2\n=0.011mol. When the intensity achieved the highest\nvalue, the amount of CaCO3 should be 0.018(1-\n5%)mol because the ideal CaCO3 shifted 5mol%\nfrom the optimal composition of Ca2Al2SiO7, which\nwas found in the first-order model. Then the SiO2\nalso varied and the highest intensity was gained\nwhen SiO2 is 0.011(1-5%)mol. It is seen that if the\nsintering temperature rises to 1450oC, the intensity\nis the highest.\nFig. 3. Fine-tune the effect of main factors\nThis above process is essential to compensate\nthe loss of consideration of two-factor interaction\nduring the first-order approximation. For example,\nboth the amount of CaCO3 and SiO2 should reduce\nabout 5% from the predicted ideal composition,\nwhen their effects have to be considered at the same\ntime. Thus the potential weakness of this statistical\napproach, mixed level experiment design by L18\northogonal array, is inhibited.\nFig. 4. Comparison of mechanoluminescence\nintensities before and after optimization\nAs a result, the optimal condition to achieve the\nmaximum mechanoluminescence intensity is listed\nin table 7. Fig. 4 shows how the intensity changes\nbefore and after the optimization process.\nTable 7. Optimal experimental conditions\nFactor\nReal Value\nA\nSintering atmosphere\nAr+5%H2\nB*\nSintering temperature\n1450oC\nC\nSintering time\n3 hours\nD\nCeO2 (mol)\n0.0001\nE\nAl2O3 (mol\n0.01\nF*\nSiO2 (mol)\n0.01045\nG*\nCaCO3 (mol)\n0.0171\nH\nH2BO3 (mol)\n0.002\n* important experiment condition.\n6.\n\nV. CONCLUSIONS\nThe\nmechanoluminescence\nintensity\nof\nCa2Al2SiO7: Ce was improved by statistical\napproaches. Eight experimental control factors were\ninvestigated on their effects on the mechano\nluminescence intensity of this oxide material by\nfactorial design and ANOVA. L18 orthogonal array\nwas adopted in the design of experiment and the test\nresults show that three main factors, the amount of\nCaCO3, the amount of SiO2, and the sintering\ntemperature are statistically important control\nfactors on the mechanoluminescence intensity.\nUnder the first-order approximation assumption, the\noptimal experimental conditions were explored and\nthe maximum intensity was predicted. Then the\ninteraction effects, particularly between the three\nsignificant control factors, were included into the\nconsideration and the final experimental parameters\nwere determined. It is clearly seen that the\nmechanoluminescence intensity was improved\norders of magnitude. The application of statistical\napproach\nis\nsuccessful\nin\nthe\nexperimental\nprocedure.\nREFERENCES\n[1].Sohn, K.S. et al, Direct observation of crack tip stress field\nusing the mechanoluminescence of SrAl2O4:(Eu,Dy,Nd). J.\nof Am. Ceram. Soc., 85 (2002) 712-714\n[2]. M. Akiyama, et al, Recovery Phenomenon of\nMechanoluminescence from Ca2Al2SiO7:Ce by Irradiation\nwith Ultraviolet Light, Appl. Phys. Lett., 75 (1999) 2548\n[3]. T. J. Lorenzen, et al, Design of Experiments, Marcel\nDekker, New York 1993, p. 298\n[4]. D. C. Montgomery, Design and Analysis of Experiments,\n4th ed., John Wiley Sons, New York 1997, p. 625-641\n[5]. D. M. Byrne and S. Taguchi, The Taguchi Approach to\nParameter Design, Quality Progress, Dec. (1987), pp. 19-\n[6]. S. I. Kubota, et al, J. Alloys Compd. 283, 95 (1999)\n[7]. A. I. Khuri, et al, Response Surfaces, Marcel Dekker, New\nYork 1987, p. 72\n7."
    },
    {
      "category": "Resource",
      "title": "chen_talk.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-780-semiconductor-manufacturing-spring-2003/3991f1efc66194c510a506d30e0f10ea_chen_talk.pdf",
      "content": "6.780 term project\nImprovement in Mechanoluminescence\nIntensity of Ca2Al2SiO7: Ce by the\nStatistical Approach\nJianglong Chen\nMay 14, 2003\n\nIntroduction\nWhat is\nWhat is Mechanoluminescence\nMechanoluminescence? ?\nMechano = apply force/stress\nLuminescence = light emission\nMechanoluminescence refers to the light emission from a material\ninduced by stress that caused deformation or fracture of solids.\n\nBackground\nMechanoluminescence phenomena exist in silica and\nquartz, sugar, rocks, alkali halide, II-VI compounds and\npolymer crystals. However, the mechanoluminescence\nintensities of these existing materials are not strong enough\nfor practical usage.\nRecently it was found that rare-earth-doped oxides emit\ncomparatively intensive visible light when stress is applied to\nthese oxides, e.g. Ce2+ (blue), Eu2+ (green), etc\n\nBackground\nApplications of mechanoluminescence materials\nStress sensor to visualize stress distribution in macro and micro-scale\n\nNew ML type stress sensors\n\nUltrafine spherical particles\n\nPlasma displays\n\nNovel mechano-display\n\nPoison-free lighting\n\nBackground\nComplex of mechanoluminescence design and\noptimization. Multiple factors and their interactions\nwill lead to numerous experiment runs and tremendous\ncosts.\nStatistical approach will dramatically reduce the size\nof experiment runs.\nThe price to pay is a decrease in the recognition of the\nsignificance of the interactions between main effects.\nHigh level of the process knowledge is essential for\nthe judgement\n\nExperimental procedures\nDesign of experiment - mixed 2137 factorial design\nOne factor at two levels, seven factors at three levels.\nFactors\nLevels\nA\nAtmosphere\nAr\nAr+H2(5%)\n--\nB\nTemperature(°C)\nC\nSintering time (h)\nD\nCeO2 (mol)\n0.00001\n0.00005\n0.00010\nE\nAl2O3 (mol)\n0.009\n0.010\n0.011\nF\nSiO2 (mol)\n0.009\n0.010\n0.011\nG\nCaCO3 (mol)\n0.018\n0.020\n0.022\nH\nH3BO3 (mol)\n0.001\n0.002\n0.003\n\nExperimental procedures\nL18 orthogonal array design and test result\n#\nA\nB\nC\nD\nE\nF\nG\nH\nCps\nAdapted from D. C. Montgomery, Design and Analysis of Experiments, 4th ed., John Wiley Sons, New York 1997,\np. 625-641\n\nExperimental procedures\nANOVA table of mechanoluminescence intensity\nThe amount of Ca2+ and Si4+ cations are most important factors !\nANOVA table\nSource\nS.S.\nd.f\nM.S.\nF\nP(F)\nB. temp\n283.8\n141.9\n12.9\n0.01\nD. CeO2\n138.8\n69.4\n6.3\n0.04\nE. Al2O3\n79.4\n39.71\n3.6\n0.1\nF. SiO2\n383.6\n191.8\n17.4\n0.006\nG. CaCO3\n768.75\n69.7\nH. H3BO3\n96.28\n48.14\n4.4\n0.08\nError\n55.17\n11.03\nTotal\nR\n98%\nCrystal structure of Ca2Al2SiO7\nS. I. Kubota, et al, J. Alloys Compd. 283, 95\n(1999)\n\nExperimental procedures\nIndividual effect of each factor\n-2 103\n2 103\n4 103\n6 103\n8 103\n1 104\n1.2 104\n1.4 104\n-2000\n1 104\n1.2 104\n1.4 104\nExperimental data (cps)\nModel (cps)\nFirst order linear model\n.\n)\nH\n.\nG\n.\nF\n.\nE\n.\nD\n.\nC\n.\nB\n.\nA\n(\n.\nc\np\ns\n×\n+\n×\n-\n×\n+\n×\n+\n×\n+\n×\n-\n×\n+\n×\n+\n×\n=\n\nConclusion\nOrders of magnitude increase in the\nmechanoluminescence intensity\nThe mechanoluminescence intensity is\nsensitive to the crystal structure, which is\nhighly influenced by the amount of Ca &\nSi cations in the crystal\nFirst order linear model fits the\nexperimental data well"
    },
    {
      "category": "Resource",
      "title": "hung_chan_rep.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-780-semiconductor-manufacturing-spring-2003/1691f427313027a92584e5f673ac2155_hung_chan_rep.pdf",
      "content": "Analysis of Variation Sources in Ring Oscillator\nLayouts (May 2003)\nThomas Chandler and Shion Hung, Non-Members, IEEE\nAbstract--this document elaborates on work done by Gonzalez-\nValentin to extract and determine variation sources that are due\nto layout differences. We will be creating models and performing\nmultivariate analysis when relevant data exists. In particular, we\nwill examine in more detail the effect of polysilicon density,\nvertical structures, greater spacing between lines and a single\nfinger structure. Finally, we will do some comparisons of single\nchips to the grand average of all chips in the study.\nIndex Terms--ring oscillators, analysis of variance, polysilicon\ndensity (effects of), vertical layout, finger spacing, single finger\nlayout, semiconductor manufacturing\nI. INTRODUCTION\nA\nNALYSIS of the variation caused by layout decisions is\nan important task that can enable better design decisions\nthrough understanding the effects of certain structures.\nOur work is an extension of original research performed by\nKaren M. Gonzalez-Valentin in her Master's Thesis titled\n\"Extraction of Variation Sources due to Layout Practices\". In\nher work, Mrs. Gonzalez-Valentin developed a test chip\nconsisting of several specifically designed ring oscillator (RO)\ntest structures, which exercised common layout parameters\nthat many design engineers manipulate today. An abbreviated\nlist of her design modifications are below:\nTABLE I\nRING OSCILLATOR TYPES AND QUANTITIES\nRing Oscillator Types\nNumber per Chip\nSingle Finger\nSmall Single Finger\nCanonical FEOL\n2 Fingers, 1.5x Minimum Length\n4 Fingers, Minimum Length\n2 Fingers, 2x Minimum Length\nSingle Finger, 4x Minimum\nLength\nManuscript received May 14, 2003. This work was created as part of the\n6.780 Semiconductor Manufacturing class taught at the Massachusetts\nInstitute of Technology by Professor Duane Boning.\nThomas Chandler is a stellar student in the Leaders for Manufacturing\nProgram at the Massachusetts Institute of Technology in Cambridge, MA.\n\nShion Hung is also a stellar student in the Leaders for Manufacturing\nProgram at the Massachusetts Institute of Technology in Cambridge, MA\n\n1.5x Spacing Between Poly\nLines\n2x Spacing Between Poly Lines\n3x Spacing Between Poly Lines\n1.2x Spacing Between Poly\nLines\nVertical Canonical FEOL\nVertical, 3x Spacing Between\nPoly Lines\nVertical Single Finger\n0% Polysilicon Density\n12% Polysilicon Density\n25% Polysilicon Density\n50% Polysilicon Density\nCanonical At End Of Density\nStructures\nGonzalez-Valentin's test chip consisted of over 2000 ring\noscillator positions that were tested for frequency using a scan\nchain. Of particular interest to us in our analysis, however, are\nthe ring oscillator types shown in italics. We will discuss each\nof these in more detail later in this section. Additionally, the\nexperiment consisted of 36 identical chips distributed\nthroughout the top half of a wafer. A spatial mapping of her\nchip placements can be seen in Figure 1.\nGonzalez-Valentin initiated some work to understand\nwhether each of the Front-End-of-Line (FEOL) device\nstructures and Back-End-of-Line (BEOL) structures were\nsignificant. Of particular interest was her ANOVA execution,\nwhich demonstrated that many of the structure did have a\nsignificant effect on the output (frequency). She also suggests\nthat spacing between polysilicon fingers can shift ring\noscillator frequency by 4.4%, and polysilicon density can alter\nfrequency by 2.1%.\nMuch of Gonzalez-Valentin's analysis was done on a\n'superchip' level, meaning that she aggregated the responses\nof multiple chips to obtain her results. Though this analysis is\nvalid and increases the number of results used in the analysis,\nthis approach also leaves some significant areas in which to\nexplore further.\nWe have chosen to pursue some analysis on an individual\nchip level, comparing the analyses achieved by Gonzalez-\nValentin to the results on a per chip basis. Furthermore, we\nwill perform some multivariate analysis as appropriate on\ndifferent oscillator properties. Specifically, we will look at the\nfollowing issues:\n\n- Model fit for the effect of polysilicon density on ring\noscillator performance\n- Multivariate analysis of effect of vertical and of 3x\nspacing\n- Multivariate analysis of effect of vertical and of\nsingle finger\n- Comparison of 'superchip' versus individual chips\nfor polysilicon density model\nWe will discuss each of these analyses and their significance\nFig. 1. Spatial positioning of the test chips on the top half of the wafer.\nbriefly below:\nA. Fit Model for Polysilicon Density Effects\nGonzalez-Valentin discovered that global density around a\nring oscillator did have a significant effect on frequency of\n2.1%. The hypothesis is that the presence of more conductive\nmaterial around the oscillator will create a capacitive load,\nreducing the frequency of the structure.\nFig. 2. Polysilicon Density around the ring oscillator was varied from 0% to\n50%.\nWe will try multiple models and find the best fit to correctly\npredict the effects of polysilicon on the oscillation frequency.\nB. Correlation of Vertical RO's and 3x spacing\nC. Correlation of Vertical RO's and single finger RO's\nMany of the experiments placed on the chip only tested one\nspecific attribute and are ill-suited to look for correlation\nbetween multiple parameters. However, a few select designs\nwere set up to allow for a two-way multivariate analysis using\na design of experiments (DOE) format. Both of these\ninstances include the effect of vertical ring oscillators.\nGonzalez-Valentin recognized a significant difference in the\nspeed of vertically placed (rotated 90 degrees) FEOL ring\noscillators. In general, these oscillators were slower than their\nhorizontal brethren. The difference was attributed to variation\nin ion implantation, mask scan, or perhaps other direction\ndependent manufacturing processes.\nSome structures on the chip were not only were placed in\nvertical orientation, they also designed with another property.\nIn this case, we can perform a multivariate analysis to see what\nthe main effects are and whether cross or second order effects\nare significant. We pursue this experiment with the FEOL ring\noscillators with minimum and 3x minimum spacing AND with\nFEOL ring oscillators with a single gate (finger) that is 3 times\nthe minimum gate length.\nD. Polysilicon Density Differences between chips and grand\nFig. 3. The single finger has the same effective gate length as the canonical\nFEOL. Theoretically, the single finger should output a frequency that is\nnominally identical to the canonical structure.\naverage\nThe polysilicon density effects given in the thesis were for\nthe 'superchip'. Therefore, some analysis can be done on\nwhether the results of the superchip actually hold for the\nindividual chips. We will take a sampling of individual chips\nand see if the same trends (intercept, slope) exist and to what\nextent.\nII. MATERIALS AND METHODS\nA. Polysilicon Density Effects\nWe examined several aspects of polysilicon density. In\nparticular, we looked at creating a fit model that suggests the\nrelationship between the density of polysilicon and the effect\non frequency. Figure 4 shows the mean and the 95%\nconfidence intervals for the four values of polysilicon density.\nThis graph clearly shows a decrease in frequency as the\ndensity increases. We will fit a model to this 'superchip' data\n\nthat is a combination of all individual chips superimposed into\none chip. We expect the model to predict this trend with a\nhigh level of confidence.\nFig. 4. Global Polysilicon Density effect with standard deviations.\nB. Correlation of Vertical RO's and 3x spacing\nFor this experiment, we began by taking data from sample\nchips located in different sections of the wafer and isolated the\nfollowing structure types:\n- Canonical FEOL - The standard ring oscillator style.\n- Vertical Canonical FEOL - This is just the standard\nring oscillator constructed at a 90 degree rotation from\nthe Canonical FEOL.\n- 3x Spacing between Poly lines - Three times the\nminimum spacing between the polysilicon gates that\nform the transistors.\n- Vertical, 3x Spacing between Poly Lines - Same as\nabove, but with a vertically constructed structure.\nEach chip had many instances of each structure. Therefore\nthe results could be analyzed with a high degree of confidence.\nThe design of the experiment was a full factorial 22 design\nwith multiple replicates for each. The purpose of the analysis\nwas to look at the main effects and any potential two-factor\ninteractions that are present. The factors were normalized in\nthe following manner:\nCanonical FEOL (-1) to Vertical Canonical FEOL (+1)\n3x Spacing between poly (-1) to Vertical, 3x Spacing (+1)\nJMP-IN was used in a stepwise fashion to determine\nsignificant effects (first-order, second-order and two way). In\naddition, parameter estimates were recorded to understand\nmagnitude of effect, and the R2 was calculated to ascertain\nmodel fit.\nWe compared the different model parameters and R2 values\nfor several chips, including Chips #5, #12, #20, and #26,\nrepresenting the left, right, top and middle of the wafer. We\nalso looked at the 'superchip' to see how it compares with the\nresults of individual chips.\nC. Correlation of Vertical RO's and single finger RO's\nVery similar to the methods described in section B above,\nwe will be performing a multivariate analysis to look for\ncorrelations between vertical ring oscillators and the finger\nsize. Our data consisted of:\n- Canonical FEOL - The standard ring oscillator style.\n- Vertical Canonical FEOL - This is just the standard\nring oscillator constructed at a 90 degree rotation from\nthe Canonical FEOL.\n- Single Finger - The canonical FEOL has three fingers\nof equal width. In this case, these three fingers are\nreplaced with a single finger with three times the\nwidth. The nominal frequency of the single finger\nshould be similar to that of canonical FEOL, though\nthe total variation on gate length may decrease.\n- Vertical, Single Finger - Same as above, but with a\nvertically constructed structure.\nAgain, we compared the fit model and magnitudes of several\nindividual chips with each other and the 'superchip'. The\nfactors were normalized in the following manner:\nCanonical FEOL (-1) to Vertical Canonical FEOL (+1)\nSingle Finger (-1) to Vertical, Single Finger (+1)\nD. Polysilicon Density Differences - individual versus\naggregate\nAfter fitting the linear model to the aggregate data from all\nof the chips, we further explored some of the differences\nbetween individual chips and the 'superchip.' We wanted to\ndetermine if the 'superchip' model for slope and intercept\nagrees with the actual individual chips.\nThis was\naccomplished by looking at 17 out of the 34 individual chips\nand comparing them to the aggregate. The 17 chips were\nselected to sample the largest variety of sights possible with\nthe given data.\nIII. STUDY RESULTS\nA. Polysilicon Density Effects\nThe polysilicon density data was limited to only four\ndiscrete increments of increasing poly density. With only four\ndata points the best model to predict the data is a simple line.\nfrequency = 4.477 - 0.213*density\nWith additional data points there is the possibility of a more\ncomplex equation to model this effect. This equation\nrepresents the best fit for this 'superchip' with the detailed\nANOVA analysis is show in Table II:\nTABLE II\nFIT MODEL FOR POLYSILICON SUPERCHIP\nRSquare\n0.212123\nRSquare Adj\n0.211255\nRoot Mean Square Error\n79410.49\nMean of Response\nObservations (or Sum Wgts)\nTerm\nEstimate\nStd Error\nt Ratio\nProb>|t|\nIntercept\n4477505.7 4207.551 1064.2\n0.0000\n\nTerm\n\nEstimate\nStd Error\nt Ratio\nProb>|t|\nDensity\n\n-213493.7 13654.55\n-15.64\n<.0001\n\nThe R2 value for the proposed model is only 0.21, so the\nmodel does not explain all of the data. However the model\ncoefficients have high t-Ratios, so we are highly confident that\nthe model is predicting a trend that is dependent upon the\npercentage of polysilicon surrounding the ring oscillators.\n\nThis is best observed in figure 5 which shows the results\nthat the model predicts plotted against the actual data points.\nThere is a definite trend of decreasing frequency with\nincreased polysilicon density.\n\nIt is clear that there is a wide amount of variation within the\naggregate sample set. It is not obvious where this variation\ncomes from, but some deviation may be due to spatial\nvariation that was not considered in this study. In section D,\nwe investigate the variation of the intercept and slope of the\nsingle chips and how they compare with the 'superchip'.\n\nB. Correlation of Vertical RO's and 3x spacing\nIn our assessment, we determined that the effects of second\norder terms and cross terms are not significant. Consider the\nexample of the 'superchip':\n\nTABLE III\nFIT MODEL FOR SUPERCHIP FOR VERTICAL VS. 3X SPACING\nRSquare\n0.686508\nRSquare Adj\n0.686447\nRoot Mean Square Error\n97104.33\n\nTerm\nEstimate\nStd Error t Ratio\nProb>|t|\nIntercept\n4314655.4\n943.9751 4570.7\n0.0000\nvertical\n-31345.26\n847.9452\n-36.97\n<.0001\n3x spacing\n-159322.7\n885.1775\n-180\n0.0000\n(vertical+0.38776)*(3x\nspacing+0.46939)\n-880.4651\n959.4333\n-0.92\n0.3588\n\nThe effect of vertical ring oscillators and the triple spacing\nare both very visible. However, there does not seem to be any\nreal interaction between the two main effects.\nAlso notice that the fit as noted by the R2 term is fairly low.\nIf we look more closely at the some of the individual chips, we\nsee that the fit is much better. For example, Chip 12 (right\nside of wafer) had a tighter model:\n\nTABLE IV\nFIT MODEL FOR CHIP 12 FOR VERTICAL VS. 3X SPACING\nRSquare\n0.924248\nRSquare Adj\n0.923728\nRoot Mean Square Error\n39560.94\n\nTerm\nEstimate\nStd Error t Ratio\nProb>|t|\nIntercept\n4327950.2\n2312.474 1871.6\n0.0000\nvertical\n-23797.62\n2312.474\n-10.29\n<.0001\n3x spacing\n-154705.7\n2312.474\n-66.90\n<.0001\nvertical*3x spacing\n-2104.802\n2312.474\n-0.91\n0.3632\n\nThis result, along with several other analyses of individual\nchips, seems to indicate that the 'superchip' model is not a\nparticularly good description of the effects of vertical RO's or\ntriple spacing. However, all of the individual chips sampled\ndemonstrated that there were no significant cross effects.\nC. Correlation of Vertical RO's and single finger RO's\nCorrelating the effect of vertical ring oscillators and single\nfingers turned out to have a surprising effect. There appears to\nbe a significant cross effect between these two attributes,\nthough the overall impact of the effect is minor relative to the\nlarge effect the two main effects have.\nFirst, we looked at the 'superchip' results:\n\nTABLE V\nFIT MODEL FOR SUPERCHIP FOR VERTICAL VS. SINGLE FINGER\nRSquare\n0.442632\nRSquare Adj\n0.442533\nRoot Mean Square Error\n121798.8\n\nTerm\nEstimate\nStd Error t Ratio\nProb>|t|\nIntercept\n4363792.7\n1153.876 3781.9\n0.0000\nvertical\n-22979.12\n1153.876\n-19.91\n<.0001\nsingle finger\n-110366.5\n1153.876\n-95.65\n0.0000\n6571428.6\n9857142.9\nY Actual\n4000000 7000000 10000000 13000000\nY Predicted P0.0000 RSq=0.44\nRMSE=121799\n\nFig. 6. Actual by Predicted Plot for the 'superchip' based on a two-way\nmodel for vertical and single finger. Notice the four points that are\nsignificant outliers.\nColumn 2 Actual\nColumn 2 Predicted P<.0001 RSq=0.21\nRMSE=79410\n\nFig. 5. Actual versus predicted for the 'superchip' model fit.\n\nIntercept Confidence Intervals\n4,350,000\n4,400,000\n4,450,000\n4,500,000\n4,550,000\n4,600,000\nsuperstar\nchip 5\nchip 26\nchip 20\nchip 8\nchip 28\nchip 4\nchip 18\nchip 27\nchip 24\nchip 35\nchip 7\nchip 11\nchip 29\nchip 30\nchip 23\nchip 16\nchip 9\nmean estimate\nupper\nlower\nmean\n`\nTerm\nEstimate\nStd Error t Ratio\nProb>|t|\nvertical*single finger\n7898.9525\n1153.876\n6.85\n<.0001\nIt is immediately apparent that the vertical FEOL, the single\nfinger and the cross effect between them are ALL significant\nfactors.\nHowever, it is equally as important to note that\nmagnitude of the cross effect is very small in comparison to\nthe other effects. Pulling out the term from the model fit only\naffects the R2 metric minimally. In fact, if you pull out the\ncross term, the R2 becomes 0.441096.\nAgain, the fit as measured by R2 for the 'superchip' is very\nlow. Some of this lack of fit may be attributed to some very\nsuperchip\nchip 5\nchip 26\nchip 20\nchip 8\nchip 28\nchip 4\nchip 18\nchip 27\nchip 24\nchip 35\nchip 7\nchip 11\nchip 29\nchip 30\nchip 23\nchip 16\nchip 9\ni\nupper\nSlope Coefficient Confidence Intervals\n-500,000\n-450,000\n-400,000\n-350,000\n-300,000\n-250,000\n-200,000\n-150,000\n-100,000\n-50,000\nslope est mate\nlower\nmean\nFig. 7. Polysilicon Density Effects - slope confidence intervals. The slope\non the 'superchip' is on the far left. The horizontal bars are the 95%\nabnormal measurements that ranged from 6 MHz to over 15\nMHz (See Figure 5).\nThese outliers come from two chips, namely Chip #1 and\nChip #4. Unfortunately, these chips are not close together, so\nwe cannot make an immediate link regarding the reason for the\nstrange measurements.\nWe observed that the individual chips had much better fits\nfor their separate models. A good example is chip #5 (far left\nhand side):\nTABLE VI\nconfidence intervals around the slope.\nfigure 8 with significantly different results. The 95%\nconfidence interval for the 'superchip' only overlapped with a\nsmall percentage of the individual chips. There is some effect\nthat affects the intercept that is not being captured with this\nmodel. It would be interesting to do some type of spatial\nanalysis to determine if the intercept is affected by some\ncombination of wafer location and polysilicon density.\nFIT MODEL FOR CHIP 5 FOR VERTICAL VS. SINGLE FINGER\nRSquare\n0.928747\nRSquare Adj\n0.928303\nRoot Mean Square Error\n35882.55\nTerm\nEstimate\nStd Error t Ratio Prob>|t|\nIntercept\n4454921.1\n2011.099 2215.2\n0.0000\nVertical\n-12433.88\n2011.099\n-6.18\n<.0001\nsingle finger\n-133722.7\n2011.099 -66.49\n<.0001\nvertical*single finger\n6887.2237\n2011.099\n3.42\n0.0007\nAll of the effects still appear to be very significant.\nWe also looked at the slopes of the lines to see if any of the\nmagnitude of the effects of the individual chips were\ndramatically different than those of the 'superchip'. From our\nanalysis of six different chips, we saw many slopes that were\nsuperstar\nchip 5\nchip 26\nchip 20\nchip 8\nchip 28\nchip 4\nchip 18\nchip 27\nchip 24\nchip 35\nchip 7\nchip 11\nchip 29\nchip 30\nchip 23\nchip 16\nchip 9\nupper\n`\nIntercept Confidence Intervals\n4,350,000\n4,400,000\n4,450,000\n4,500,000\n4,550,000\n4,600,000\nmean estimate\nlower\nmean\nFig. 8. Polysilicon Density Effects - intercept confidence intervals. The\nintercept on the 'superchip' is on the far left. The horizontal bars are the\nover two standard errors away from the 'superchip' slope.\nD. Polysilicon Density Differences - individual versus\naggregate\nWe first looked at the confidence interval for the slope and\nthen compared it to the confidence intervals from 17 of the\nindividual chips as shown in figure 7. The 95% confidence\ninterval for the 'superchip' contained the entire confidence\ninterval for 16 out of the 17 individual chips. This was a little\nbit surprising since there was so much variation in the\nindividual points. We conclude from this that the 'superchip'\nprovides a good representation of the slope confidence interval\nfor the individual chips.\nNext we looked at the confidence interval for the 'superchip\nmean and compared it to the 17 individual chips as shown in\n95% confidence intervals around the intercept.\nIV. CONCLUSIONS\nOur analysis allows us to make three conclusions:\n1. All main effects inspected in paper were significant\n2. Density has a consistent linear effect over multiple\nindividual chips\n3. There is a significant but small interaction between\nvertical RO's and single finger\nThe significance of the main effects was first noted by\nGonzalez-Valentin, and we were able to affirm her findings\nthrough our analysis.\nNext, we were able to fit a model for the effect of\npolysilicon density. The effect of density appears fairly\nconsistent across all of the sample chips, though there is\ncertainly still some variation. What remains unclear is what\nother factors may be contributing to variation, though\n\naccounting for chip location on the wafer may prove to be a\nsignificant factor.\nFinally, we concluded that there is no interaction between\nvertical layout ring oscillators and line spacing, but there is\nsome cross effect between vertical layout ring oscillators and\nthe number of fingers used in layout.\nFor the vertical versus singer finger case, the interaction\nbetween them is in the opposite direction of the main effects.\nMore specifically, the effects of a vertical layout and a single\nfinger are both negative on frequency. The interaction,\nhowever, has a slight positive effect on frequency. We\nrationalize this observation by the fact that a single finger is\nless susceptible to gate length variation than the multiple gates\nin the canonical FEOL. Any direction dependent\nmanufacturing processes would affect a three-finger structure\napproximately three times as much as a single finger structure.\nFor future research into the topic of the effect of layout\nvariation, we envision the following possibilities:\n- More ring oscillator structures with multiple effects,\nenabling the experimenter to quantify effect\ninteractions. For example, identify cross effects\nbetween polysilicon density and the number of fingers.\n- Fabrication of test chips on multiple wafers, to account\nfor the possibility of systemic problems with the\noriginal test wafer.\n- Fabrication of test chips on more randomly spaced\nlocations throughout the wafer, reducing the likelihood\nof spatial effects.\n- Studies on whether there is a spatial relationship to the\nvariances in polysilicon density effect slope or\nintercept.\n- Effect of spatial relationships on vertical ring\noscillators, spacing differences and the use of\nfewer/more fingers with equivalent gate lengths.\n- Increase the number of different percentages of\npolysilicon to enable possible higher order models\nREFERENCES\n[1] K. M. Gonzalez-Valentin, \"Extraction of Variation Sources Due to\nLayout Practices.\" Thesis, Massachusetts Institute of Technology,\nCambridge, MA, 2002.\n[2] D. Boning, Lecture Notes from 6.780 - Semiconductor Manufacturing,\nMassachusetts Institute of Technology, Cambridge, MA, 2003."
    },
    {
      "category": "Resource",
      "title": "hung_chan_talk.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-780-semiconductor-manufacturing-spring-2003/9817caa6432558bc003f30f11e7db4cf_hung_chan_talk.pdf",
      "content": "14 May 2003\n14 May 2003\n6.780 Term Project\n6.780 Term Project\nAnalysis of Variation\nAnalysis of Variation\nSources in Ring Oscillator\nSources in Ring Oscillator\nLayouts\nLayouts\nThomas Chandler and Shion Hung\nThomas Chandler and Shion Hung\nNon\nNon--Members, IEEE\nMembers, IEEE\n\n14 May 2003\n14 May 2003\n6.780 Term Project\n6.780 Term Project\nAgenda\nAgenda\nAcknowledgment of Original work\nAcknowledgment of Original work\nMethods\nMethods\nAreas for Exploration\nAreas for Exploration\nPolysilicon\nPolysilicon Density Effects\nDensity Effects\nSingle chips vs.\nSingle chips vs. ''superchip\nsuperchip''\nTwo way effects\nTwo way effects\nResults\nResults\nConclusions\nConclusions\n\n14 May 2003\n14 May 2003\n6.780 Term Project\n6.780 Term Project\nAcknowledgement of Original Work\nAcknowledgement of Original Work\nBased on Karen M. Gonzalez\nBased on Karen M. Gonzalez--Valentin\nValentin''ss\nMaster thesis:\nMaster thesis: \"\"Extraction of Variation\nExtraction of Variation\nSources due to Layout Practices\nSources due to Layout Practices\"\"\nMultiple ring oscillator structures on 35\nMultiple ring oscillator structures on 35\nchips\nchips\nConclusions:\nConclusions:\nPoly Density changes frequency by 2.5%\nPoly Density changes frequency by 2.5%\nFinger spacing has significant effect\nFinger spacing has significant effect\nVertical ring oscillators also significant\nVertical ring oscillators also significant\n\n14 May 2003\n14 May 2003\n6.780 Term Project\n6.780 Term Project\nMethods\nMethods\nCompiled data for aggregate\nCompiled data for aggregate ''superchip\nsuperchip''\nUsed JMP\nUsed JMP--IN\nIN\nFit model for\nFit model for polysilicon\npolysilicon density\ndensity\nTwo way interactions\nTwo way interactions -- least squares\nleast squares\nregression\nregression\nCompared whether individual results\nCompared whether individual results\nwithin\nwithin ''superchip\nsuperchip'' confidence interval\nconfidence interval\n\n14 May 2003\n14 May 2003\n6.780 Term Project\n6.780 Term Project\nAreas for Exploration\nAreas for Exploration --\nPoly Density Effects\nPoly Density Effects\nDetermine a model for the effect of\nDetermine a model for the effect of\npolysilicon\npolysilicon density on frequency\ndensity on frequency\nBased on measurements for poly density =\nBased on measurements for poly density =\n0%, 12.5%, 25%, 50%\n0%, 12.5%, 25%, 50%\nRing Oscillator\nPoly\nPoly\nPoly\nPoly\nPoly\nPoly\nPoly\nPoly\n\n14 May 2003\n14 May 2003\n6.780 Term Project\n6.780 Term Project\nFit Model for Poly Density\nFit Model for Poly Density\ndensity\nfrequency\n*\n.0\n.4\n-\n=\n\n14 May 2003\n14 May 2003\n6.780 Term Project\n6.780 Term Project\nActual by Predicted Poly Density\nActual by Predicted Poly Density\nColumn 2 Actual\nColumn 2 Predicted P<.0001 RSq=0.21\nRMSE=79410\n\n14 May 2003\n14 May 2003\n6.780 Term Project\n6.780 Term Project\nSingle chips vs.\nSingle chips vs. ''superchip\nsuperchip''\nAny differences between individual chip\nAny differences between individual chip\nbehavior and the aggregate\nbehavior and the aggregate ''superchip\nsuperchip''??\n\n14 May 2003\n14 May 2003\n6.780 Term Project\n6.780 Term Project\nResults\nResults -- Poly Density\nPoly Density\nSlope Coefficient Confidence Intervals\n-500,000\n-450,000\n-400,000\n-350,000\n-300,000\n-250,000\n-200,000\n-150,000\n-100,000\n-50,000\nsuperchip\nchip 5\nchip 26\nchip 20\nchip 8\nchip 28\nchip 4\nchip 18\nchip 27\nchip 24\nchip 35\nchip 7\nchip 11\nchip 29\nchip 30\nchip 23\nchip 16\nchip 9\nslope estimate\nupper\nlower\nmean\n\n14 May 2003\n14 May 2003\n6.780 Term Project\n6.780 Term Project\nIntercept Confidence Intervals\nIntercept Confidence Intervals\nIntercept Confidence Intervals\n4,350,000\n4,400,000\n4,450,000\n4,500,000\n4,550,000\n4,600,000\nsuperstar\nchip 5\nchip 26\nchip 20\nchip 8\nchip 28\nchip 4\nchip 18\nchip 27\nchip 24\nchip 35\nchip 7\nchip 11\nchip 29\nchip 30\nchip 23\nchip 16\nchip 9\nmean estimate\nupper\nlower\nmean\n`\n\n14 May 2003\n14 May 2003\n6.780 Term Project\n6.780 Term Project\nAreas for Exploration\nAreas for Exploration --\nTwo way effects with Vertical\nTwo way effects with Vertical RO\nRO''ss\nGonzalez\nGonzalez--Valentin\nValentin''ss demonstrated that\ndemonstrated that\nVertical\nVertical RO\nRO''ss may be different (lower\nmay be different (lower μμ, ,\nlarger\nlarger σσ))\nMay be due to mask making bias or ion\nMay be due to mask making bias or ion\nimplantation effect\nimplantation effect\nNext question:\nNext question:\nAre these vertical effects truly significant?\nAre these vertical effects truly significant?\nAre there any effect interactions in the data\nAre there any effect interactions in the data\nset?\nset?\n\n14 May 2003\n14 May 2003\n6.780 Term Project\n6.780 Term Project\nVertical\nVertical RO\nRO''ss versus 3x spacing\nversus 3x spacing\nDoes line spacing have a significant effect\nDoes line spacing have a significant effect\non frequency?\non frequency?\nSignificant interaction with Vertical\nSignificant interaction with Vertical RO\nRO''ss??\nPoly\nPoly\nPoly\n\n14 May 2003\n14 May 2003\n6.780 Term Project\n6.780 Term Project\nVertical\nVertical RO\nRO''ss vs\nvs Single Finger\nSingle Finger\nCanonical RO has multiple fingers\nCanonical RO has multiple fingers\nDoes a single finger with same effective gate\nDoes a single finger with same effective gate\nlength have a different effect?\nlength have a different effect?\nSignificant interaction with Vertical\nSignificant interaction with Vertical RO\nRO''ss??\n\n14 May 2003\n14 May 2003\n6.780 Term Project\n6.780 Term Project\nTwo way interactions\nTwo way interactions\nVertical vs. 3x spacing\nVertical vs. 3x spacing\nBoth main effects are significant (<0.001)\nBoth main effects are significant (<0.001)\nCross term not significant\nCross term not significant\nVertical vs. single finger\nVertical vs. single finger\nBoth main effects are significant (<0.001)\nBoth main effects are significant (<0.001)\nCross term is\nCross term is significant\nsignificant (<0.001), but\n(<0.001), but\nmagnitude is minimal\nmagnitude is minimal\n\n14 May 2003\n14 May 2003\n6.780 Term Project\n6.780 Term Project\nRSquare\nRSquare Adj\nRoot Mean Square Error\nMean of Response\nObservations (or Sum Wgts)\n0.442632\n0.442533\n121798.8\nSummary of Fit\nIntercept\nvertical\nsingle finger\nvertical*single finger\nTerm\n4363792.7\n-22979.12\n-110366.5\n7898.9525\nEstimate\n1153.876\n1153.876\n1153.876\n1153.876\nStd Error\n3781.9\n-19.91\n-95.65\n6.85\nt Ratio\n0.0000\n<.0001\n0.0000\n<.0001\nProb>|t|\nParameter Estimates\nAvg. RSquare for\nindividual chips:\n0.887206\n\n14 May 2003\n14 May 2003\n6.780 Term Project\n6.780 Term Project\nFit of\nFit of ''superchip\nsuperchip'' poor\npoor\n''Superchip\nSuperchip'' RR22 values were much worse\nvalues were much worse\nthan the individual chips\nthan the individual chips\nFit affected by some significant outliers:\nFit affected by some significant outliers:\n6571428.6\n9857142.9\nY Actual\n4000000 7000000 10000000 13000000\nY Predicted P0.0000 RSq=0.44\nRMSE=121799\n\n14 May 2003\n14 May 2003\n6.780 Term Project\n6.780 Term Project\nConclusions\nConclusions\nAll main effects inspected in paper were\nAll main effects inspected in paper were\nsignificant\nsignificant\nModel fit for\nModel fit for polysilicon\npolysilicon density effect\ndensity effect\n50%\n50% ∆\n∆ in density = 3%\nin density = 3% ∆∆in frequency\nin frequency\nDensity has a consistent effect over multiple\nDensity has a consistent effect over multiple\nindividual chips\nindividual chips\nSignificant but small interaction between\nSignificant but small interaction between\nvertical\nvertical RO\nRO''ss and single finger\nand single finger\n\n14 May 2003\n14 May 2003\n6.780 Term Project\n6.780 Term Project\nQuestions?\nQuestions?"
    },
    {
      "category": "Resource",
      "title": "lyons_noh_rep.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-780-semiconductor-manufacturing-spring-2003/01962e9a0397bce85da79472401e8c0e_lyons_noh_rep.pdf",
      "content": "2003 Spring - 6.780 Semiconductor Manufacturing Term Project Paper\nStatistical Analysis of In-Situ End-Point Detection\nin Copper Chemical-Mechanical Polishing\nKyungyoon Noh and Elizabeth Lyon\nAbstract--This paper presents statistical techniques for analysis\nin-situ end-point data in Cu CMP. An optical reflectance sensor is\nemployed on a rotary polishing tool to measure the surface re\nflectance of patterned Cu wafers. Statistical models are developed\nto determine the surface condition based on the characteristics of\nthe sample reflectance data. A nested variance model is proposed\nto decouple the variance components of within-wafer and\nwithin-die non-uniformity. This information may be employed to\ncontrol the process parameters to improve the material removal\nrate and the within-wafer uniformity. Algorithms based on the\nchanges in mean, variance, range and distribution of the surface\nreflectance are examined for their effectiveness in process moni\ntoring and end-point detection.\nIndex Terms--Chemical-Mechanical Polishing (CMP),\nEnd-Point Detection (EDP) and Statistical Process Control (SPC).\nC\nI. INTRODUCTION\nontinuing advances in ultra-large-scale integration (ULSI)\ntechnology require the fabrication of submicron-size fea\ntures of higher resolution, denser packing and multi-layer\ninterconnects. In the past decade, chemical-mechanical pol\nishing (CMP) has been successfully employed to smooth sur\nface topography of inter-level dielectrics (ILD) and multi-level\nCu damascene structures. Over the past several years, copper\nhas emerged as the optimal interconnect material because of its\nlow electrical resistivity and resistance to electromigration.\nPatterned Cu lines are produced by a damascene scheme,\ncomprising oxide trench patterning and Cu deposition, followed\nby CMP. The current success in producing high resolution\ninterconnects is due to the excellent local and global planari\nzation capabilities of the Cu CMP process.\nThe main challenge for most of CMP applications is to con\ntrol non-uniformities of the surface topography to meet the more\nstringent wafer- and die-level planarity requirements for various\nsubstrate materials. These non-uniformities will vary the cycle\ntime, or the end-point, of the Cu CMP and affect the process\nyield. In order to reduce the variance of uniformity, it is nec\nessary to integrate an in situ sensing and end-point detection\nElizabeth Lyon is a graduate student in the Department of Materials Science\nand Engineering, Massachusetts Institute of Technology, MA 02139 USA.\n\nKyungyoon Noh is a graduate student in the Department of Mechanical\nEngineering, Massachusetts Institute of Technology, MA 02139 USA\n.\ntechnique with the process optimization schemes to improve\nprocess performance.\nThe ideal wafer-level end-point for Cu CMP process may be\ndefined as the time when the excess Cu and barrier layers are\nfully cleared on all dies of a wafer. Due to polishing nonuni\nformity, however, all the dies on a wafer generally will not reach\nthe end-point at the same moment. Some of the dies may be\noverpolished. Thus the end-point of CMP can be a representa\ntion of the optimal polishing time when the number of\nout-of-specification dies reaches a minimum. However, the\nremaining Cu thickness in each die area is difficult to measure in\nreal-time due to its dynamic environments.\nAmong the current end-point detection techniques, the opti\ncal sensing techniques of interferometry and reflectance meas\nurement provide the localized means for detecting the\nend-point. Specially, the reflectance measurement is ideal for\ndetecting the surface topography and the metal area fraction on\nthe surface. Most of end-point methods are limited in practical\napplications by lack of reliability and high noise-to-signal ratio.\nThese techniques focus mainly on average information over a\nrelative large area, usually wafer-level [2, 6, 8, 10].\nSeveral issues must be resolved to fully utilize the reflec\ntance measurement technique. The signal from the sensor\ncannot be unambiguously interpreted because it contains both\nsystematic and random attributes of the surface condition of the\npolished surface and the polishing environment. The reflectance\nvaries across the wafer due to the nonuniform pattern layout and\nwithin-wafer nonuniform polishing. These effects must be de\ncoupled to gain information for polishing uniformity control. In\naddition to the interpretation of the signal, the sensor kinematics\nmust be studied to map the data onto the wafer surface to gain\nboth wafer- and die-level information. An adequate spatial\nresolution for indicating local conditions can be achieved\nthrough sensor trajectory design. Such information will increase\nthe confidence level of interference about the wafer surface\ncondition, and will lead to a more accurate and repeatable de-\ncision-making for the end-point detection.\nThis research employs the in-situ reflectance measurement\ntechnique on patterned Cu wafers in Cu CMP. A statistical\nmodel is developed to decouple the variation of the surface\nreflectance and to estimate the variance components contributed\nby nonuniform polishing due to pattern variation and\nwithin-wafer nonuniform polishing. Algorithms for utilizing\nthose two techniques in process end-point monitoring and con\ntrol are also discussed.\n\n2003 Spring - 6.780 Semiconductor Manufacturing Term Project Paper\n\nII. THEORY\nA. Reflectance in a Cu damascene structure\nIn the Cu damascene structure, the number of possible modes\nfor the scattering field is limited by the surface condition. If the\nwavelength of the incident light is close to the waviness of the\npattern, there will be only one mode and the surface will reflect\nsecularly regardless of the surface topography. For the submi-\ncron Cu patterns employed in the current design, the reflectance\nmeasured at the onset of the process end-point by a light source\nwith comparable or larger wavelength will essentially indicate\nthe Cu area fraction only. The slight surface topography due to\noverpolishing and dishing will not significantly affect the re-\nflectance. The surface reflectance R, proportional to the square\nof the reflection coefficient, of the composite surface at the\nonset of end-point therefore can be written as:\n;\n)\n+\n%.\n&\nc\n@r\nc\nLufab\nO\n>O\n> O\n(1)\nwhere, Af is the area fraction of Cu interconnects, and Rcu and\nRoxide the reflectances of Cu and TEOS, respectively, in specula\nreflection.\nB. Sensor Kinematics\nThe sensor loci on the rotating wafer surface can be deter-\nmined by the relative velocity of the sensor to the wafer and the\ninitial position of the sensor, as shown in Fig. 1. The relative\nvelocity of the sensor on the rotating wafer can be obtained by\ntwo steps: find the relative velocity of the sensor to the sta-\ntionary X, Y coordinates fixed at the center of the wafer and then\nperform a coordinate transformation with respect to the wafer\nrotation. The velocity components for the sensor, vX,s, and vY,s,\nand the wafer, vX,w, and vY,w, in X, Y coordinates can be ex-\npressed as:\n\nu\nu\no\n; +\n)\n+ \"\n)\n-\npfk%\n&\nUp\np m\nm\n``\ns\no\nq\no (2)\n\nu\nu\no\n;\n)\n)\n-\n`lp%\n&\nVp\np m\nm\ns\no\nq\n\nu\no\n; +\n)\npfk\nUt\np t\ns\no\n\nu\no\n;\n+\n)\n%\n`lp\n&\nVt\nt\np\n``\ns\no\no\nwhere, rs is the offset of the sensor from the center of the\nplaten, rcc the offset of the centers of the wafer and the platen, ww\nand wp are the angular velocity of the wafer and the platen, and q\nthe angle of the sensor with respect to the X coordinate.\nWhen the angular velocities of the wafer and the platen are\nthe same, the sensor enters the wafer/pad interface at the same\npoint on the periphery of the wafer. It always produces the same\nlocus on the wafer surface. But in practice, the angular velocity\nof the wafer must be slightly offset from the platen so that the\nsensor can scan over the entire wafer surface in different radial\ndirections as shown in Fig. 2. As illustrated, the sampling den-\nsity will be much higher at the center of the wafer, and lower at\nthe edge where more dies are located. The lower sampling\ndensity on the edge dies might result in bias inference for the\noverall surface condition. Therefore, the way to design sensor\nloci to sample enough data on a desired surface area should be\ndiscussed.\n\nFig. 1. Schematics of sensor kinematics\n\nC. Sampling Strategy\nThree levels, wafer-, die- and device- or subdie-level, of\ninformation can be obtained from the reflectance measurements.\nThe spot size of the sensor is chosen so that it is comparable to\nor smaller than the subdie area but still much larger than the\ndimensions of interconnects. Therefore, an individual meas-\nurement represents the reflectance on the specific device or\npattern area on the wafer, from which the surface topography\nand Cu area fraction can be inferred. It is difficult to map the\nmeasurement results onto the exact location of a particular\ndevice or pattern because of wafer slippage inside the carrier.\nThe individual datum can only be mapped onto the surface\nwithin a grossly defined area. Similarly, the die-level informa-\ntion may be obtained along a specific segments corresponding\nto the die location on the loci. Moreover, wafer-level informa-\n-50\n-50\nx , mm\ny , mm\n\nFig. 2. The simulated locus for the reflectance sensor across the\nwafer at the condition u\nu\n; .+-2\nt\nm and\n;\np\n``\no\no .\n\n2003 Spring - 6.780 Semiconductor Manufacturing Term Project Paper\ntion can be retrieved either from a single or multiple scans\nacross the wafers. In end-point detection, it is preferable to take\nsamples from multiple loci so that the surface condition over a\nspecific region or the entire wafer surface can be determined\nfrom the pooled dataset. The more loci employed, the larger,\nmore uniform samples can be taken. Therefore, a higher level of\ninference can be achieved. However, there is a possibility that\nthe surface condition may change significantly during the long\nsampling period needed for multiple scans. This may affect the\nreliability of the inference and will delay decision making and\nfeedback control. The moving average method is used to esti\nmate the average reflectance on the surface to eliminate this\nproblem. The sensor scans the wafer surface once per platen\nrevolution. If the reflectance sampled at the j-th point along the\nlocus at the i-th time period, each time period is equal to the\nduration for one revolution of the platen, denoted as xij. If total n\npoints are taken along each locus, the mean reflectance along\nthe locus at the i-th period, uf , is:\nk\n. ∫ufg\n(3)\nuf ; k g ;.\nSuppose the number of loci to cover the entire wafer surface\nor a area of interest is w, the moving average of the sampling\nreflectance at the i-th period, Mi, is defined as:\nuf ) uf+. ) ÷ ) uf+t ).\n(4)\nJf ;\nt\nThat is, at the i-th time period, the observations from the\nnewest one scan and the previous (w-1) scans are employed to\nestimate the mean reflectance of the entire wafer or the surface\nof interest. Thus, the surface condition as inferred from the\nreflectance measurements can be updated every scan. The\nmoving average can capture the change of surface reflectance\ndue to both the change of surface topography and the change of\nCu area fraction within a short period, in this case in less than\none second. However, it may still smooth over the rapid change\ndue to the partial oxide exposure on small portions of the wafer\nsurface near the onset of end-point by averaging the current data\nwith the previous data.\nThe total variance of the surface reflectance at i-th time pe\n/\nriod, Pf , can be estimated based on the same pooled dataset\nemployed in the moving average:\nf\nk\n∫ ∫%ufg + Jf &/\nf+t ). g ;.\nPf\n/ ;\n(5)\nK + .\nwhere, N is the total number of samples in the moving av\nerage subset (N = wn). The total variance is calculated based on\nthe deviation of the reflectance at each sampling point relative\nto the total estimated mean of the surface of interest, as esti\nmated by the moving average. In addition to the total variance,\nthe variance along each locus, the range of data, and their\nmaximum and minimum must be tracked to identify the rapid\nchange of surface reflectance at the moment when the barrier or\noxide layer is exposed. The variance can determine the percent\nof overpolished area on the wafer surface at the end of the\nprocess. Additionally, the distribution of the data can determine\nthe regime of polishing.\nD. Spatial Nonuniformity\nIn this research, we will measure the spatial variation using a\nmetric which normalizes the variation by the mean. The fun\ndamental ratio that we will consider is:\nq '\nK\nf i& k\n; Pf\n(6)\nf\nJf\nwhere q is the observed standard deviation and k is the\nobserved mean of one reflectance path. This ratio is commonly\nused as a expression of wafer-level non-uniformity [3, 5].\nE. Variance Components of the Surface Reflectance\nThe surface reflectance of a patterned wafer varies with the\nsurface roughness, pattern topography and area fraction, and\noptical properties of the coatings. Due to the within-wafer\nnonuniform material removal, the surface topography and the\nremaining fraction of Cu during polishing may vary among\ndifferent dies across the wafer. The within-wafer nonuniform\npolishing usually results from certain systematic sources, such\nas nonuniform velocity distribution, pressure distribution, in\nterfacial temperature distribution, slurry flow, and contact\nconditions. Their effect on polishing always follows a system\natic pattern which tends to be repeatable between wafers of the\nsame lot. The wafer-level nonuniformity affects the pattern\nevolution on the same die with a similar trend. The relative rates\nof material removal between different patterns on a die will\nremain similar to another die at different location because the\nfactors that affect wafer-level nonuniformity will have less\ninteraction with the die- or device-level polishing behavior. For\ninstance, die-level polishing is mostly affected by the pattern\ngeometry, such as linewidth and area fraction. Therefore, the\nvariation of reflectance measurements on a die tends to follow\nthe same distribution and is nested within the die. Based on this\nassumption, a two-level nesting variance structure is employed\nto decompose the effects of within-wafer and die-level non\nuniform polishing [5]. Assuming that the reflectance at each\nlevel is normally distributed, the reflectance at location j of die i\non the wafer, Rij, can be written as:\nOfg ; k )T ) Ag f\n(7)\nf\n% &\nwhere, μ is the average reflectance within the wafer from\nmultiple loci, Wi the die-to die (or within-wafer) effect on die i,\nand Dj(i) the within-die effect at location j on die i. The total,\nwithin-wafer and within-die variances of surface reflectance are\n/\n/\n/\nexpressed as qQ , qT , q\nrespectively. Additionally, the\nA\nwithin-die effect, Dj(i), is assumed to be normal and the\ntwo-level variance components are assumed to be independent\n/\nto each other. Therefore, the total variance of reflectance, qQ ,\ncan be written as:\n\n2003 Spring - 6.780 Semiconductor Manufacturing Term Project Paper\n/\nq ; q/ ) q/\n(8)\nQ\nT\nA\nIf the sampling plan is balanced, i.e., same number of meas\nurements are taken at each level on each sample, the variances\nof each level can be estimated by the following analysis. The\n/\nvariance component for within-die effect, PA , can be estimated\nby:\nj\nk %uf g + uf &/\n/\n.\nPA ;\n∫∫\n(9)\nk + .\nj f ;. g ;.\nWhere m is the number of dies sampled, n the sample size at\neach die, uf the mean of reflectance at die i. The within-wafer\n/\nvariance q\ncan be obtained by using the relation between the\nT\nvariance of die means, q/ , which can be represented as:\nT\nq/ ; q/ ) q/ , k\n(10)\nT\nT\nA\n/\nThe variance of die means q/ can be estimated by P :\nT\nT\nj\n/\nP / ;\n%uf + u E&\n(11)\nT\n∫ j + .\nf ;.\nwhere u E is the grand mean of the measurements, the moving\naverage of multiple scans over a given span in this case.\nFinally, we can use a F-ratio analysis between wafer-level\nvariance and die-level variance to as one of reference to check\nend-point [3].\n/\nPT\nC ;\n/\n(12)\nPA\nIII. EXPERIMENTS\nAn optical sensor unit comprising of light-emitting diodes\n(LEDs), bundled glass fibers for light transmission and re\nceiving, and an amplifier detected the conditions of the wafer\nsurface based on surface reflectance. Table 1 lists the specifi\ncations of the sensor.\nTABLE 1\nSPECIFICATIONS OF THE REFLECTANCE SENSOR\nItem\nSpecification\nLight Source\nHigh Intensity LED\nWavelength (nm)\n780-990 (μ=880, s=50)\nSpot Diameter (mm)\n1.6\nLight Beam Spread (°)\nOperation Distance (mm)\n0-6.35\nStability (%)\n<0.1% full scale\nFrequency Response (kHz)\n< 20\nThe sensor unit was installed on the platen base with the tip\nembedded inside a holder through the platen. A translucent\nplastic window allowed the sensor view the wafer surface\nthrough the polyurethane polishing pad stacked on the platen.\nPatterned Cu wafers were employed for experiments to verify\nthe capability of the sensor and to determine the detection\nschemes. A detailed layout of the pattern is shown in Fig. 3. This\npattern is transferred into a 1.5 μm thick TEOS coating with\ntrenches etched to a depth of 1 μm on a 200 mm silicon sub\nstrate. A 20 nm Ta layer followed by a 1 μm thick PVD Cu layer\nwas deposited on the top of the patterned oxide surface. Table 2\nlists the experimental conditions.\nFig. 3. Mask pattern for Cu CMP\nTABLE 2\nEXPERIMENTAL CONDITIONS\nExperimental Parameters\nExperimental Conditions\nDiameter of Wafer (mm)\nNormal Load (N)\nNormal Pressure (kPa)\nRotational Speed (rpm)\nLinear Velocity (m/s)\n0.70\nDuration (min)\n1 - 6\nSliding Distance (m)\n42 - 252\nSlurry Flow Rate (ml/min)\nAbrasive\nθ-Al2O3\nAbrasive Size (nm)\npH\nIV. RESULTS AND DISCUSSION\nA. Off-Line Measurements on Blanket and Patterned Wafers\nFig. 5 and Fig. 6 show the effects of surface topography on\nreflectance. These data were obtained off-line on patterns at the\ncenter die with various linewidths between 0.5 and 100 μm and\nconstant Cu area fractions of 0.5. The normalized reflectance is\ndefined as the ratio of the measured reflectance on each sub-die\nto the reflectance of the unpolished blanket Cu surface. By six\nminutes, most of the high features were removed and the surface\nwas planarized. The smaller the pitch, the more light scatters on\nthe surface and reduces reflectance. This can be explained by\nthe less reflective Cu surfaces on low features due to the\nroughness from the deposition process. After two minutes of\npolishing, the normalized reflectance decreased about 0.1. The\nreflectance of each pattern increased gradually after the initial\ndrop and then finally reached a steady value due to the pla\nnarization of high features.\nOxide erosion occurred after the onset of oxide exposure.\nThe reflectance kept decreasing until all the excess Cu and\nbarrier materials were removed. After the end-point, the re\nflectance remained constant, regardless of the slight nonuni\nformity of topography due to dishing of the soft Cu lines and\nrounding and erosion of the adjacent oxide regions. This again\nagrees with the earlier results in that the employed sensing\n\n2003 Spring - 6.780 Semiconductor Manufacturing Term Project Paper\ntechnique is insensitive to the small variation of the step-height.\nHence, the variation of the reflectance in this regime was mainly\ndue to the different area fraction of Cu interconnects. The areas\nwith higher Cu area fraction are more reflective. However, the\nexperimental values were lower than the theoretical prediction\nof reflectance for all patterns, especially for those with high area\nfractions as shown in Fig. 6.\n(a)\n(b)\n(c)\nFig. 4. Photos of blanket wafer polishing at (a) t=2min, (b) t=3min\nand (c) t=4min\nli\nl\n0.2\n0.4\n0.6\n0.8\nNorma zed Mean Ref ectance\nTime, min\nFig. 5. Evolution of surface reflectance for the blanket wafer\npolishing.\nli\nl\nμm\nμm\nμm\nμm\n0.2\n0.4\n0.6\n0.8\nNorma zed Ref ectance\n0.5\n2.0\n100.0\n25.0\nB. In Situ Measurements on Patterned Wafers\nFig. 7 shows the time revolution of wafer-level reflectance\ndata distribution and Fig. 8 shows its histogram distribution.\nThe maximum reflectance occurred in the middle of Cu clearing\nregime, at about 200 secons of polishing in this case. The low\nend of reflectance distribution, between 0.8 to 1.0, indicates the\npresence of oxide layer. As polishing time increases, this lower\nreflectance region expands, which represents the sub-die area\non which the oxide is exposed and the peak of histogram moves\nto the lower limit.\nFig. 7. Time evolution of reflectance signal for patterned wafer\nFig. 9 is an example of in situ measurement on a patterned Cu\nwafer. Because the Cu was removed nonuniformly due to the\ninitial pattern layout and the variation of the coating thickness,\nthe underlying oxide was gradually exposed on the surface. The\nmean dropped less steeply compared with data on a specific die,\nsuch as the center die. The onset of wafer-level end-point was\nabout seven minutes in this experiment. The mean kept de\ncreasing, but at a slower rate, after the end-point with the\ngradual increase of surface roughness due to overpolishing and\ndishing. Due to the effect of slurry and the variation of wa-\nfer-to-wafer uniformity, the mean at the onset of end-point\nvaries in each run. Besides, the mean does not drop rapidly at\nTime, min\nFig. 6. The results of off-line measurements at various process\nthe onset of end-point because the Cu is removed nonuniformly\nin different sub-dies and not all the dies reach the end-point at\nregimes on the pattern with 0.5 area fraction.\nthe same time. A clear sign of change in mean is lacked for\n\n2003 Spring - 6.780 Semiconductor Manufacturing Term Project Paper\nend-point indication. The mean serves only as a rough indica\ntion of the onset of process end-point.\nFig. 8. Histogram of reflectance signal for patterned wafer pol\nishing.\nFig. 9. Results in-situ measurements of the moving average of\nwafer-level surface reflectance.\nFig. 10 plots the standard deviation of the pooled data in the\nmoving sampling set and its wafer-level and die-level compo\nnents based on the nested variance analysis. Because the varia\ntion of the reflectance is mostly due to the pattern geometry and\nCu area fraction, the distribution is generally not normal. The\ninitial shape of the distribution represents the initial surface\ntopography of the wafer. Ideally, there are two peaks of the\nstandard deviation during polishing. The first peak occurs at the\nbeginning of the process corresponding to the minimum mean\nreflectance in the Cu planarization regime. This results from the\ninitial surface topography and surface roughening. The standard\ndeviation in the planarization regime reached a minimum when\nthe majority of the pattern has been smoothed down and the\nmean reaches a maximum. The surface condition at this stage is\nsimilar to that of a blanket wafer. The variation of the surface\nreflectance is affected by the surface roughness, slurry scatter\ning, and random error of measurement.\nBut in the patterned wafer, this standard variation analysis\ndoes not agree well with the actual data as shown in Fig. 10.\nThis is mainly because the reflectance value is also dependent\non the pattern geometry and its variation is not negligible.\nFig. 10. Results of in-situ measurements of the standard deviation\nof wafer-level surface reflectance and its components at wafer-level\nand die-level.\nThe results of decomposition of estimated variance compo\n/\n/\nnents, PT and PA with respect to the in situ measured data are\nalso plotted in Fig. 10. Fig. 11 shows the value of each F ratio,\n/\ndefined as PT , P / , for every wafer path to examine the sig-\nA\nnificance of within-wafer nonuniformity on the variation of\nsurface reflectance. Additionally, the polishing results for all\ndies at the same radius are assumed to be similar and are com\nbined into a subset for estimation of the die-level variation. The\nhigh F ratio on the wafer before polishing indicates that the\nwithin-die means at different radii are different. This is due to\nthe variation of initial step-height from the deposition process.\nThe within-wafer nonuniformity decreases after polishing starts,\nand remains at a low level with respect to the total variation.\nThis suggests that the surface is planarized uniformly or to\npography becomes more uniform across the wafer through the\nCMP process. The within-wafer variance and the F ratio even\ndrop to very low levels after the wafer-level end-point is\nreached. This is because the underlying oxide surface is harder\nthan Cu and can retain the surface planarity and the wafer-level\npolishing uniformity. On the other hand, the within-die effect\ncontributes significantly to the total variance of surface reflec\n\n2003 Spring - 6.780 Semiconductor Manufacturing Term Project Paper\ntance throughout the process. The process end-point can be\ndetermined based on the change of within-die variance com\nponent as a result of the drastic change of Cu area fraction. In\npractice, the total variance might be employed to approximate\nthe within-die variance to determine the process end-point. The\nsmall effect of within-wafer nonuniformity will not affect the\naccuracy of detection.\nFig. 11. Calculation of F-ratio between wafer-level and die-level\nvariances during the polishing.\nMoreover, within-wafer variance is just an indication of the\nnonuniform reflectance of the surface. It may not directly cor\nrelate with the uniformity of the remaining Cu thickness.\nHowever, it directly represents the uniformity of surface con\ndition. This information can be used to monitor the across-wafer\nsurface condition and uniformity. It may also be employed in a\nfeedback control loop to adjust the process parameters, such as\npressure distribution and velocities of wafer carrier and platen,\nto improve the uniformity of polishing.\nLast index for detecting end-point is the Non-Uniformity,\nwhich is defined as the ratio between the standard deviation and\nmean of reflectance value. Fig. 12 shows NU changes as time\nincreases. Distribution of NU is almost close to the standard\ndeviation distribution in Fig. 10 but this can indicate the\nend-point better because NU value shows more flatten data.\nFig. 12. Results of Non-Uniformity calculation during the polishing.\nV. CONCLUSION\nA statistical analysis for in situ reflectance sensing tech\nnique in the Cu CMP process was developed. Experiments on\nthe patterned Cu wafers studied the effects of light scattering\nresult due to surface roughness and the slurry particles on sur\nface reflectance. A better decision for determining the end-point\ncould be made based on the understanding of these systematic\nsources of variation.\nThe kinematics of the sensor was studied and its loci on the\nwafer were designed to cover the desired sampling area. Based\non mapping the reflectance onto the wafers, a more local means\nof detecting the surface condition in polishing was developed.\nCompared with other global detection techniques, this method\nprovides better spatial resolution and reliability in detecting the\nend-point. Additionally, information regarding the within-wafer\nnonuniform polishing was determined based on localized\nmeasurements and statistical analyses. This information may\nserve as feedback to control process parameters in real time to\nimprove polishing uniformity.\nMoreover, metrics for detecting process end-point, such as\nthe mean, the variation, the range and the distribution of the\nsurface reflectance, were developed and their effectiveness\nexamined by experiments. The ratio s/μ, the standard deviation\ndivided by the mean reflectance, can effectively determine both\nthe global and the local end-points. The ratio reaches a mini\nmum when the end-point is achieved no matter what the pattern\ndesign is. The characteristics of various schemes with respect to\ndifferent stages of polishing were also discussed. These will\nprovide additional information for process monitoring and\ncontrol for improving the quality and performance of the Cu\nCMP process.\nREFERENCES\n[1]\nBanet, M.J., Fuchs, M., Rogers, J.A., Reinold, J.H., Knecht, J.M.,\nRothschild, M., Logan, R., Maznev, A.A., and Nelson, K.A., 1998,\n\"High-Precision Film Thickness Determination Using a Laser-Based\nUltrasonic Technique,\" Appl. Phys. Lett., Vol. 73, pp. 169-171.\n[2]\nBibby, T. and Holland, K., 1998, \"End-point Detection in CMP,\" J.\nElectronic Materials, Vol. 27, pp. 1073-1081.\n[3]\nDrain, D., 1997, Statistical Methods for Industrial Process Control,\nChapman and Hall, New York.\n[4]\nLitvak, H.E. and Tzeng, H.-M., 1996, \"Implementing Real-Time\nEnd-point Control in CMP,\" Semiconductor International, Vol. 19, pp.\n259-264.\n[5]\nMontgomery, D.C., 1996, Introduction to Statistical Quality Control, 3rd\ned., John Wiley & Sons., Inc., New York, pp. 101-111.\n[6]\nMurarka, S., Gutmann, R., Duquette, D., and Steigerwald, J, U.S. Patent\n#5,637,185, June 10, 1997.\n[7]\nPark, T., Tugbawa, T., Boning, D., Chung, J., Hymes,, 1999, \"Electrical\nCharacterization of Copper Chemical Mechanical Polishing,\" Proc. 1999\nCMP-MIC Conf., pp. 184-191.\n[8]\nSmith, W.L., Kruse, K., Holland, K., and Harwood, R., 1996, \"Film\nThickness Measurements for Chemical Mechanical Planarization,\" Solid\nState Technology., Vol. 39, pp. 77-86.\n[9]\nStine, B.E., 1997, \"A General Methodology for Acessing and Charac\nterizing Variation in Semiconductor Manufacturing\", Ph.D. Thesis ,\nMassachusetts Institute of Technology.\n[10] Zeidler, D., Plotner, M., and Drescher, K., 2000, \"End-point Detection\nMethod for CMP of Copper,\" Microelectronic Engineering, Vol. 50, pp.\n411-416."
    },
    {
      "category": "Resource",
      "title": "lyons_noh_talk.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-780-semiconductor-manufacturing-spring-2003/ee3c4a2b24ad1ca536b6f04697b4fd7a_lyons_noh_talk.pdf",
      "content": "Statistical Analysis of\nEndpoint Detection in CMP\n6.780 Term Project\nKyungyoon Noh and Zil Lyons\n5/14/2003\n\nIntroduction: CMP Process\n(Chemical Mechanical Polishing)\nRemoves material from uneven topography on wafer surface, planarizing.\nPrimarily for the interconnect structure of the chip\nCritical for fabricating copper-based semiconductors.\nOverpolishing can cause problems: dishing and erosion.\n\nDetecting Endpoint with Reflectance\nω\nωp\nw\nrs\nrcc\nrcc\n.\nθo\nX\nY\n\nEndpoint detection: Ideal\nClears at edges first.\nAverage Reflectance drops\nsharply once areas begin to clear\nEasy to declare finish point!\n\nCMP Process\nTime evolution of a blanket Cu wafer\n(t=2, 3, 4 min)\nEffect on a patterned wafer\n\nEndpoint detection: Nonideal\nReflectance profiles for two wafers do not\nresemble the ideal profile!\n0.5\n1.5\nx (-r to r)\nReflectance\nDa ta S e t #3\n100s\n200s\n300s\n400s\n500s\n0.2\n0.4\n0.6\n0.8\n1.2\n1.4\n1.6\n1.8\nDa ta se t #4\nx (-r to r)\nReflectance\n100s\n300s\n500s\n700s\n\nVariance Analysis\n)\n(i\nj\ni\nij\nD\nW\nR\n+\n+\n= μ\nD\nW\nT\nσ\nσ\nσ\n+\n=\n∑∑\n=\n=\n-\n-\n=\nm\ni\nn\nj\ni\nij\nD\nn\nx\nx\nm\nS\n)\n(\nn\nD\nW\nW\n/\nσ\nσ\nσ\n+\n=\n∑\n=\n-\n-\n=\nm\ni\ni\nW\nm\nx\nx\nS\n)ˆ\n(\nSensor Path\n)\n#\n(\n,....,\n)\n#\n(\n,....,\ndie\none\nin\nt\nmeasuremen\nof\nn\nn\ni\npath\none\nin\ndies\nof\nm\nm\nj\n=\n=\n=\n=\n\nVariance Analysis - Results\n0.1\n0.2\n0.3\n0.4\n0.5\n0.6\nData s et #1\nTime(s ec)\nStandard Deviation\nTotal\nDie\nWafer\n0.1\n0.2\n0.3\n0.4\n0.5\n0.6\nData s et #2\nTime(s ec)\nStandard Deviation (moving average)\nTotal\nDie\nWafer\n0.1\n0.2\n0.3\n0.4\n0.5\n0.6\nData s et #3\nTime(s ec)\nStandard Deviation (moving average)\nTotal\nDie\nWafer\n0.1\n0.2\n0.3\n0.4\n0.5\n0.6\nData s et #4\nTime(s ec)\nStandard Deviation (moving average)\nTotal\nDie\nWafer\n\nWafer Polishing Data:\nAverage, Standard Deviation\nSeries 2\n0.000000\n0.500000\n1.000000\n1.500000\n2.000000\n2.500000\n3.000000\n3.500000\n28 55 82 109136163190217244271298325352379406433460487514541568595\nTime\nSeries 1\n0.000000\n0.500000\n1.000000\n1.500000\n2.000000\n2.500000\n3.000000\n3.500000\nTime\nReflectance - Avg\n0.000000\n0.100000\n0.200000\n0.300000\n0.400000\n0.500000\n0.600000\nReflectance - StDev\nAvg\nStd\nSeries 3\n0.000000\n0.500000\n1.000000\n1.500000\n2.000000\n2.500000\n3.000000\nTime\nReflectance - Avg\n0.000000\n0.050000\n0.100000\n0.150000\n0.200000\n0.250000\n0.300000\n0.350000\n0.400000\n0.450000\nReflectance - StDev\nAvg\nStd\nSeries 4\n0.000000\n0.500000\n1.000000\n1.500000\n2.000000\n2.500000\n3.000000\nTime\nReflectance - Avg\n0.000000\n0.050000\n0.100000\n0.150000\n0.200000\n0.250000\n0.300000\n0.350000\n0.400000\nReflectance - StDev\nAvg\nStd\n\nWafer Polishing - Refined Data\n- Moving Avg\nCharts of\nAverage, StDev\n- Average not ideal\n- Initially: StDev of\n0.4\n- Doesn't work for\nall sets\nCont rol Chart\nUWMA of Avg\n1.8\n1.9\n2.0\n2.1\n2.2\n2.3\n2.4\n2.5\n2.6\n2.7\n2.8\nMoving Avg of Avg\n20 24\n52 56\nSample\nUWMA of St d\n0.20\n0.25\n0.30\n0.35\n0.40\nMoving Avg of Std\n20 24\n52 56\nSample\nCont rol Chart\nUWMA of Avg\n1.0\n1.5\n2.0\n2.5\n3.0\nMoving Avg of Avg\n18 27\n36 45 54 63 72 81 90 99 108\nSample\nUWMA of St d\n0.15\n0.20\n0.25\n0.30\n0.35\n0.40\n0.45\nMoving Avg of Std\n18 27\n36 45 54 63 72 81 90 99 108\nSample\nCont rol Chart\nUWMA of Avg\n1.2\n1.3\n1.4\n1.5\n1.6\n1.7\n1.8\n1.9\n2.0\n2.1\n2.2\n2.3\n2.4\nMoving Avg of Avg\n99 108\nSample\nUWMA of St d\n0.05\n0.10\n0.15\n0.20\n0.25\n0.30\n0.35\n0.40\n0.45\nMoving Avg of Std\n99 108\nSample\nCont rol Chart\nUWMA of Avg\nMoving Avg of Avg\n98 112\nSample\nUWMA of St d\n0.10\n0.15\n0.20\n0.25\n0.30\nMoving Avg of Std\n98 112\nSample\n\nSignal To Noise Ratio\nCont rol Chart\nUWMA of NU\n0.05\n0.10\n0.15\n0.20\n0.25\nMoving Avg of NU\nSample\nCont rol Chart\nUWMA of NU\n0.05\n0.10\n0.15\n0.20\n0.25\n0.30\nMoving Avg of NU\n18 27\n36 45 54 63 72 81 90 99 108\nSample\nCont rol Chart\nUWMA of NU\n0.05\n0.10\n0.15\n0.20\n0.25\n0.30\nMoving Avg of NU\n99 108\nSample\nCont rol Chart\nUWMA of NU\n0.05\n0.10\n0.15\n0.20\n0.25\nMoving Avg of NU\n98 112\nSample\n\nConclusion\n- Endpoint best measured with standard\ndeviation, although this metric is vulnerable\nto shifts, especially with off-center data.\n- NU, average not reliable criteria\n- More sophisticated analysis techniques\nmight improve detection algorithm -\npossibly multivariable."
    },
    {
      "category": "Resource",
      "title": "smith_sarg_rep.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-780-semiconductor-manufacturing-spring-2003/3ac459bb4c735a3ae42681e116787f46_smith_sarg_rep.pdf",
      "content": "6.780 - Semiconductor Manufacturing, Spring 2003, Professor Duane Boning\n6.780 - Semiconductor Manufacturing\nTerm Project - Data Analysis\n[Integrated Model-Based Run-to-Run Uniformity Control for Epitaxial Silicon Deposition]\nAaron Elwood Gower-Hall\nRoland Sargeant (LFM '03), Erik Smith (LFM '03)\nAbstract-- This paper analyzes data taken by Gower-Hall for his\nMIT PhD thesis. In his thesis, Gower-Hall examines run-to-run\ncontrol of epitaxial film deposition by way of thickness and\nresistivity measurements of the film deposited. Our main focus is\nanalysis of the resistivity data captured from the experiments.\nWe give an overview of the thesis, confirm Gower-Hall's findings\nof the main factors influencing resistivity with basic data analysis,\nand then extend the analysis of the resistivity measurements.\nIndex Terms-- ANOVA modeling, design of experiments,\nepitaxial deposition, resistivity, factorial experiment, spatial\nmodeling, spatial thickness, uniformity.\nI. INTRODUCTION\nG\nower-Hall proposes in his thesis a testbed system for\nintegrated model-based, run-to-run control of epitaxial\nsilicon (epi) film deposition, incorporating a cluster tool with a\nsingle-wafer epi deposition chamber, an in-line epi film\nthickness measurement tool, and off-line thickness and\nmeasurement systems.[1] He performs a large set of designed\nexperiments to gather information about the system and build\nprocess models. The resulting data is analyzed in terms of\nprocess stability and noise, process model construction and\nprocess optimization. He then presents simulated run-to-run\ncontrol scenarios using the resulting noise characteristics,\ntime-based models for thickness, and linear models for\nresistivity.\nIt is the models for resistivity that this study verifies and\nimproves upon. In accomplishing this aim this paper first\ngives\na\ndescription\nand\nsummary\nof\nGower-Hall's\nexperimental design, results and findings related to resistivity.\nNext a 'first-level' analysis is performed that duplicates and\nverifies the original Gower-Hall resistivity findings.\nThis\nanalysis is then improved by incorporating positional\ninformation as an explicit parameter in the experimental\nanalysis. These findings are then compared to Gower-Hall's.\nThe paper concludes with a summary of findings and\ntakeaways from this exercise.\nII. EXPERIMENT DESIGN\nA. Physical Experiment\nEpitaxial deposition is a process whereby a thin single\ncrystal film is grown on a single crystal substrate. Chemical\nVapor Deposition (CVD) was performed using an Applied\nMaterials Centura system with an epi deposition chamber as\nthe deposition tool.\nThe physical and electrical properties of the epitaxial film\nare important to the functionality of the final device. Physical\nproperties for the epi layer include surface quality,\ncrystallographic defects and film thickness. Important\nelectrical properties include minority carrier lifetimes and film\nresistivity.\nFilm resistivity (Ω-cm) is the focus of this paper and is\ndirectly related to the concentration of dopant material in the\nepi layer through the relation\nρ =\n(Equation. 2-1)\nqnμ\nwhere q is the electronic charge (Coulombs), n is the doping\nconcentration (atoms/cm3) and μ is the carrier mobility (cm2/v\nsec).\nThe resistivity measurements were taken in four repetitions\nof a single diameter scan (with 21 sites) as shown in Figure 2\n1. The four scans were reviewed and the \"best\" one selected\nfor each wafer. This best scan was averaged, where there was\na single center point and two measurements for all other radii,\nresulting in 11 radial site resistivities. Only 10 sites were\nretained\nfor\nanalysis\nsince\nthe\noutermost\nresistivity\nmeasurements demonstrated high variation that was not well\nmodeled.\nB. Design of Experiment (DOE)\nGower-Hall's DOE was composed of 128 two-level\nfractional factorial design points, 18 axial points, 8 center\npoints, and 4 additional replicates of a randomly chosen\nfractional design point, for a total of 158 runs1. There were\nnine parameters, excluding deposition time, which was held\nconstant across all of the experiments.\nA full factorial design with 9 parameters at two levels would\n1 An important note is that the team only had a portion of this data to work\nwith. Specifically, only 112 data groups were provided, one group for each\nseparate treatment or experimental run, with 19 sites per data group.\n\n-\n-\n-\n-\n6.780 - Semiconductor Manufacturing, Spring 2003, Professor Duane Boning\nrequire 512 experiments, but a 1⁄4 fractional design was used to\nselect only 128 design points. Table 2-1 below shows the\nparameters and levels used in the experimental design.\nFIGURE 2-1: Resistivity Measurement Map\nfor fine tuning resistivity, he includes it in his model. He also\nnotes that Dopant Ratio has by far the strongest effect on the\noutputs, and that all others have significantly weaker effects.\nFigure 2-2 below plots the modeled resistivity for each radial\nsite as a first-order function of the significant inputs. These\nplots are taken directly from Gower-Hall's thesis.\nTABLE 2-2: Noise estimates for the DOE Replicates\nReplicate Type\nType of Noise\nStd. Dev. Of\nNoise\nThickness\nStd. Dev. Of\nNoise\nResistivity\nCenter\nMean shift\nnoise\n∧\nσ μ\n0..46%\n2.87%\nCenter\nSite Noise\nsite\n∧\nσ\n0.14%\n1.34%\nFractional\nFactorial\nMean\nshift\nNoise\n∧\nσ μ\n0.35%\n2.57%\nFractional\nFactorial\nSite Noise\nsite\n∧\nσ\n0.12%\n2.13%\nTABLE 2-1: DOE Input Levels\nC. Experimental Results and Findings\nGower-Hall first shows that there is much more variation in\nthe outputs in terms of mean-shift noise and individual site\nnoise for resistivity than for thickness. (See Table 2-2) The\nstandard deviation of the noise appears to be considerably\nhigher for resistivity than for thickness measurements.\nMore importantly, Gower-Hall determines that the inputs\nmost significantly affecting resistivity are:\nDopant Ratio\nH2 Flow\nTCS Flow\nDeposit Temperature\nGower-Hall notes that even though Dopant Main Flow is\nnot a significant effect, since it is known to be a control knob\nFIGURE 2-2: First-order functions in terms of inputs\nDopant Ratio\nH2 Flow\nTCS Flow\nDeposit Temperature\nDopant Main Flow\nGower-Hall then describes some possible mechanisms why\neach of these parameters affects the output in the way that they\ndo.\nWith the unadjusted DOE data, the first order (linear)\nmodels capture and average of 91.9% of the variation while\nthe second order polynomials capture approximately 97.6%.\nHe finds that neither first order nor second order models\nrepresent the resistivity data as well as the thickness data.\n\n6.780 - Semiconductor Manufacturing, Spring 2003, Professor Duane Boning\nPossible reasons given for this phenomenon are the high\nmeasurement and process noise and that the response surface\nmay require a high order model.\nGower-Hall also notes that the models do not demonstrate\nstrong controls for manipulating the resistivity uniformly\nacross the surface of the wafer. That is, the plots demonstrate\nan ability to shift the resistivity profile up and down but do not\nindicate that the resistivity near the wafer's center can be\nadjusted relative to the resistivity near the wafer's edge.\nAnother important observation is that, while the film may be\nnon-uniform in thickness, film thickness has little effect on\nresisitivity. Resistivity can still be relatively uniform even\nwhen film thickness varies since film composition is\nresistivity's most important determinant.\nIII. VERIFICATION OF GOWER-HALL'S RESULTS\nA. Design of Experiment\nThe method for verifying Gower-Hall's results was similar to\nthat followed by Gower-Hall himself. In brief, the research\nteam used Gower-Hall's data, analyzing the same factors to\ndetermine the best model for estimating resistivity. For each\nexperiment treatment, the team \"threw away\" position data by\naveraging across all nineteen positions to obtain an average\nvalue for that experiment.\nUsing the JMPIn statistical package, the team ran a Fit\nModel instruction that determined initial estimates and their\nsignificance. Non-significant factors were iteratively removed\nfrom the model until only significant factors affecting\nresistivity remained.\nB. Results and Findings\nThe model obtained does not include Dopant Main Flow as\nan important figure because it was clearly not significant in the\nanalysis (the resulting t-Ratio for Dopant Main Flow was -0.72\nand the Prob >|t| was 0.4732).\nHowever, as mentioned\npreviously, Gower-Hall felt inclined to include it in because it\nis a well-known control knob for fine tuning resistivity.\nApart from this discrepancy, the resulting model from this\nanalysis verified the significance of Deposit Temperature,\nDopant Ratio, H2 Flow and TCS Flow as sensitive main effect\ninputs to film resistivity. (In this model, these input\nparameters are respectively termed x1, x2, x3, and x4).\nHowever, the team also determined that there are three\nsignificant one-way interactions:\n-\nDeposit Temperature * TCS Flow [x1*x4]\n-\nDeposit Temperature * Dopant Mix [x1*x2]\n-\nDopant Mix * H2 Flow [x2*x3]\nThe model for resistivity is Equation 3-1:\ny = 3.345 - 0.446x1 - 2.236x2 - 0.292x3 + 0.376x4 -\n0.270x2x4 + 0.321x1x2 + 0.198x2x3\nAdjusted R-squared for this model is 95.6244%, which\nshould convince the reader of the model's overall efficacy.\nA summary of this model's coefficients including relevant\nstatistics that demonstrate each coefficient's significance is\nprovided in Table 3-1.\nTABLE 3-1: Preliminary model Estimates\nTerm\nEstimate\nStd Error\nt Ratio\nProb>|t|\nIntercept\n3.34485\n0.044178\n75.71\n< .0001\nDep. Temp (x1)\n-0.4457\n0.048131\n-9.26\n< .0001\nDop. Mix (x2)\n-2.2359\n0.048926\n-45.7\n< .0001\nDil. H2 (x3)\n-0.2919\n0.048298\n-6.04\n< .0001\nTCS Flow (x4)\n0.37592\n0.047820\n7.86\n< .0001\nDep Temp * Dop Mix\n0.32050\n0.049333\n6.5\n< .0001\nDop Mix * Dil H2\n0.19822\n0.049519\n< .0001\nDop Mix * TCS\n-0.27007\n0.049299\n-5.48\n< .0001\nIt is important to note that the interaction between Outer Gas\nFlow and Percent Inner Power seemed to be significant but\nindividually, their main effects were not significant. The team\nbelieves this to be a limitation of the statistical application\n(JMP). That is, the package does not allow interaction terms\nto be included in a model without its corresponding first-level\neffects also being included. Since this interaction term had a\nrelatively minor effect, and for the sake of simplicity (seven\nmodel terms instead of ten terms), the team chose to exclude it\nfrom the model.\nFigure 3-1 gives the ANOVA summary of the error\nassociated with the model and lack-of-fit.\nDF\n528.59914\n75.5142\n347.5453\nError\n22.59698\n0.2173\n551.19612\nDF\n9.957507\n0.663834\n4.6743\nError\n12.639468\n0.142016\n22.596975\n0.9771\nFIGURE 3-1: ANOVA Summary Statistics\nAnalysis of Variance\nSource\nSum of Squares\nMean Square\nF Ratio\nModel\nProb > F\nC. Total\n< .0001\nLack of Fit\nSource\nSum of Squares\nMean Square\nF Ratio\nModel\nProb > F\nC. Total\n< .0001\nMax RSq\nThe very low probability of Lack of Fit gives further\nevidence for the model's usefulness in describing the\nrelationship between the control parameters and the underlying\ndata.\nThe analysis to this point verifies Gower-Hall's results with\nthe noted omission of Dopant Main Flow as a control\nparameter. In addition, it actually extends Gower-Hall's\nanalysis slightly by explicitly quantifying these effects, which\n\n6.780 - Semiconductor Manufacturing, Spring 2003, Professor Duane Boning\n\nGower-Hall does only indirectly by means of the plots\ndisplayed in Figure 2-2.\n\nIV. SECOND-LEVEL ANALYSIS\nA. Design of Experiment\nAt this point, instead of blindly fitting more models to the\ndata, the team took a step back and simply looked at the raw\ndata in the hopes of gaining further intuition into the\nunderlying dynamics governing resistivity. The result of this\nwas the hypothesis that the resistivity model might have a\npositional component - specifically, the team surmised that\nradial distance from the center of the wafer might affect\nresistivity.\n\nFigure 4-1 below shows a plot of all 112 experiments in the\nprovided data set, with each arrangement of colored connected\npoints representing a different experiment, and each point\nrepresenting a measurement at the indicated position. In the\ndata provided, each experiment or treatment has a total of 19\nseparate measurements sites. These sites are located in a line\nacross the wafer diameter with radial distances from -87.3 to\n+87.3 cm in 8.7 cm increments.\n\nA naive analysis of the data suggests that there might be a\npositional trend in the data, with the resistivity peaking at the\ncenter of the wafer. This observation prompted the team to\nplot the average resistivity by site. This is shown in Figure 4-\n2. At first glance, it appears that resistivity may peak in the\ncenter of the wafer and that radial displacement from the\ncenter of the wafer may affect resistivity.\n\nThis led the team to ask the question \"If there is some effect\ndue to radial displacement from the center of the wafer, what is\nthat effect?\"\n\nB. Results and Findings\nThe team's first attempt to investigate positional effects was\nto perform an analysis, where we built a separate model for\neach of the nineteen points (in contrast, the model developed\nbefore was an aggregate model across the surface of the wafer\nsince it averaged data for each experiment across those\nnineteen points). See Figure 4-3 below.\n\nThis analysis yielded the results summarized in Table 4-1,\nwhere each row provides the coefficients for a separate site on\nthe wafer (for instance, the site at -87.3cm or the site at\n+29.1cm) for Equation 4-1:\n\nTable 4-1 illustrates that there is a large degree of disparity in\nthe model coefficients for individual sites. In the best case, the\nminimum amount of difference between the maximum and\nminimum coefficients between the 19 site models is 9.70%\n(β1, Dep Temp), and in the worst case this difference is\n48.67% (β2β3, one-way interaction of Dop Mix Ratio and Dil\nH2 Flow).\n\nFIGURE 4-1: Plot of Raw data across the Wafer\n\nFIGURE 4-2: Plot of Average Resistivity by Position\n\nFIGURE 4-3: Individual Model for Nineteen Points\n\n-100\n-80\n-60\n-40\n-20\n3.\nx\nx\nx\nx\nx\nx\nx\ny\nβ\nβ\nβ\nβ\nβ\nβ\nβ\n+\n+\n+\n+\n+\n+\n=\n-\n6.\nx\nx\nx\nx\nx\nx\nx\ny\nβ\nβ\nβ\nβ\nβ\nβ\nβ\n+\n+\n+\n+\n+\n+\n=\n-\n9.\nx\nx\nx\nx\nx\nx\nx\ny\nβ\nβ\nβ\nβ\nβ\nβ\nβ\n+\n+\n+\n+\n+\n+\n=\n-\n...\n3.\nx\nx\nx\nx\nx\nx\nx\ny\nβ\nβ\nβ\nβ\nβ\nβ\nβ\n+\n+\n+\n+\n+\n+\n=\n6.\nx\nx\nx\nx\nx\nx\nx\ny\nβ\nβ\nβ\nβ\nβ\nβ\nβ\n+\n+\n+\n+\n+\n+\n=\n9.\nx\nx\nx\nx\nx\nx\nx\ny\nβ\nβ\nβ\nβ\nβ\nβ\nβ\n+\n+\n+\n+\n+\n+\n=\n...\n-100\n-80\n-60\n-40\n-20\n3.\nx\nx\nx\nx\nx\nx\nx\ny\nβ\nβ\nβ\nβ\nβ\nβ\nβ\n+\n+\n+\n+\n+\n+\n=\n-\n6.\nx\nx\nx\nx\nx\nx\nx\ny\nβ\nβ\nβ\nβ\nβ\nβ\nβ\n+\n+\n+\n+\n+\n+\n=\n-\n9.\nx\nx\nx\nx\nx\nx\nx\ny\nβ\nβ\nβ\nβ\nβ\nβ\nβ\n+\n+\n+\n+\n+\n+\n=\n-\n...\n.\nx\nx\nx\nx\nx\nx\nx\ny\nβ\nβ\nβ\nβ\nβ\nβ\nβ\n+\n+\n+\n+\n+\n+\n=\n6.\nx\nx\nx\nx\nx\nx\nx\ny\nβ\nβ\nβ\nβ\nβ\nβ\nβ\n+\n+\n+\n+\n+\n+\n=\n9.\nx\nx\nx\nx\nx\nx\nx\ny\nβ\nβ\nβ\nβ\nβ\nβ\nβ\n+\n+\n+\n+\n+\n+\n=\n...\nAverage Resistivity by Position\n4.95\n5.05\n5.1\n5.15\n5.2\n5.25\n5.3\n5.35\n-100\n-50\nPosition (cm)\nAverage Resistivity (ohms*cm\nPlot of Raw Data\n-100\n-50\nPosition (cm)\nResistivity (ohms*cm)\nx\nx\nx\nx\nx\nx\nx\ny\nβ\nβ\nβ\nβ\nβ\nβ\nβ\n+\n+\n+\n+\n+\n+\n=\n\n6.780 - Semiconductor Manufacturing, Spring 2003, Professor Duane Boning\nTABLE 4-1: Individual Site Model Parameter Estimates\nparameter, are provided in Table 4-2 below. Results for an\nInt\nβ1\nβ2\nβ3\nβ4\nβ1β 2\nβ 2β 3\nβ 2β 4\n0.897\n<0.0001\n0.909\n<0.0001\n0.940\n<0.0001\n0.954\n<0.0001\n0.969\n<0.0001\n0.967\n<0.0001\n0.967\n<0.0001\n0.959\n<0.0001\n0.942\n0.0005\n0.953\n<0.0001\n0.948\n<0.0001\n0.958\n<0.0001\n0.968\n<0.0001\n0.968\n<0.0001\n0.967\n<0.0001\n0.967\n<0.0001\n0.956\n<0.0001\n0.941\n0.0003\n0.924\n0.0221\nR\n2-adj Prob LOF\n3.184 -0.414 -2.117 -0.317\n0.388\n0.298\n0.232\n-0.283\n-87.3\n3.212 -0.435 -2.138 -0.321\n0.383\n0.319\n0.230\n-0.279\n-77.6\n3.276 -0.432 -2.192 -0.313\n0.369\n0.315\n0.213\n-0.265\n-67.9\n3.319 -0.429 -2.216 -0.320\n0.357\n0.300\n0.223\n-0.250\n-58.2\n3.346 -0.449 -2.244 -0.304\n0.348\n0.321\n0.196\n-0.256\n-48.5\n3.364 -0.456 -2.249 -0.286\n0.348\n0.328\n0.192\n-0.244\n-38.8\n3.360 -0.456 -2.256 -0.285\n0.355\n0.334\n0.188\n-0.252\n-29.1\n3.401 -0.440 -2.282 -0.280\n0.389\n0.309\n0.189\n-0.280\n-19.4\n3.440 -0.470 -2.280 -0.242\n0.424\n0.330\n0.156\n-0.313\n-9.7\n3.493 -0.450 -2.327 -0.258\n0.425\n0.327\n0.173\n-0.311\n3.441 -0.462 -2.296 -0.252\n0.418\n0.331\n0.166\n-0.307\n9.7\n3.392 -0.430 -2.276 -0.285\n0.380\n0.308\n0.192\n-0.277\n19.4\n3.369 -0.448 -2.258 -0.283\n0.359\n0.325\n0.190\n-0.256\n29.1\n3.374 -0.454 -2.264 -0.281\n0.362\n0.326\n0.182\n-0.259\n38.8\n3.385 -0.458 -2.269 -0.290\n0.358\n0.329\n0.190\n-0.251\n48.5\n3.361 -0.455 -2.250 -0.295\n0.360\n0.328\n0.200\n-0.247\n58.2\n3.329 -0.441 -2.230 -0.312\n0.361\n0.315\n0.214\n-0.250\n67.9\n3.280 -0.450 -2.190 -0.307\n0.378\n0.326\n0.214\n-0.271\n77.6\n3.227 -0.441 -2.149 -0.316\n0.382\n0.323\n0.226\n-0.278\n87.3\nmax 3.493 -0.414 -2.117 -0.242\n0.425\n0.334\n0.232\n-0.244\n0.969\n0.0221\nmin 3.184 -0.470 -2.327 -0.321\n0.348\n0.298\n0.156\n-0.313\n0.897\n0.0003\n% diff 9.70% 13.37% 9.89% 32.89% 22.22% 12.13% 48.67% 28.09%\nAn interesting result from this analysis is that each one of\nthe site models contains the same four main effects and three\none-way interactions previously found to be significant in the\nprevious model, where position data was averaged.\nIn\naddition, none of these individual site models has any\nadditional terms besides these seven.\nAnother important observation is that the 19 models, for the\nmost part, do a decent job of describing the influence that the\ninput parameters have on resistivity at each site. Despite this,\nthere is a fair degree of variation in the \"goodness\" of the\nmodels, with the models' ability to describe the underlying\nprocess appearing to fall off towards the edge of the wafer\nsurface. In the most cases, towards the wafer center, R2-adj is\nbetween 94 and 96%, while towards the edges R2-adj appears\nto fall off, being just just 89.7% at position -87.3cm and\n92.4% at +87.3cm. Similarly, most site models have a very\nlow probability of Lack of Fit - <0.0001%. However, some\nmodels, including one near the center, have slightly higher\nprobabilities, with the model at position +87.3cm having a\n2.21% probability of a Lack of Fit.\nThus, although the 19 models do a decent job of describing\nwhat is occurring in regards to resistivity for each site, there is\nsignificant variation between each of the models. In addition,\nthis method has two clear disadvantages of practical\nconsequence to the engineer who wishes to understand the\nunderlying behavior in the system. In the first place, it is\ndifficult to keep track of coefficients for all 19 models. When\nthe intercept for each model is included, the engineer must\ndeal with a total of 152 (8*19) model coefficients. A second\ndisadvantage of this method is that it is not clear how to\ninterpolate between the 19 discrete sites.\nThe team's second attempt at analyzing the data was fitting\na model including position on the wafer as an additional\nexplicit parameter. In effect, the team transposed position data\nfor each experiment into another column in the dataset.\nModel coefficients for this analysis, where the team used\nradial distance from the center of the wafer as the explicit\nintermediate analysis in which position was considered as a\nparameter (as opposed to radial distance) are not discussed.\nTABLE 4-2: Parameter Estimates for Full Model\nIncluding Radial Position as an Explicit Parameter\nParameter Estimates\nTerm\nEstimate t Ratio Prob>|t|\nIntercept\n2.797\n168.47\nCenter Gas Flow Valve\n-0.014\n-1.64\n0.1006\nOuter Gas Flow Valve\n0.005\n0.56\n0.5771\nDep Temp\n-0.438\n-54.33\nDop Mix Ratio\n-2.256\n-266.9\nDop Main Flow\n-0.017\n-2.03\n0.0423\n% Lower Power\n0.007\n0.9\n0.3691\n% Inner Power\n0.034\n4.14\n<.0001\nDil H2 Flow (slm)\n-0.303\n-36.46 <.0001\nTCS flow (slm)\n0.363\n45.26\nRadial Xformed\n-0.119\n-10.1\n<.0001\n(Dop Mix Ratio+0.00893)*(Dop Mix Ratio+0.00893)\n0.698\n37.52\n<.0001\n(Center Gas Flow Valve-0.08036)*(Dop Mix Ratio+0.00893)\n-0.039\n-4.54\n<.0001\n(Center Gas Flow Valve-0.08036)*(Dop Main Flow-0.00893)\n0.028\n3.15\n0.0017\n(Center Gas Flow Valve-0.08036)*(% Lower Power+0.00893)\n-0.037\n-4.35\n<.0001\n(Center Gas Flow Valve-0.08036)*(% Inner Power+0.02679)\n0.022\n2.41\n0.0161\n(Center Gas Flow Valve-0.08036)*(TCS flow (slm)-0.02679)\n-0.029\n-3.33\n0.0009\n(Center Gas Flow Valve-0.08036)*(Radial Xformed-0.05263)\n-0.035\n-2.61\n0.0092\n(Outer Gas Flow Valve+0.13095)*(Dep Temp-0.02679)\n0.068\n8.03\n<.0001\n(Outer Gas Flow Valve+0.13095)*(Dop Main Flow-0.00893)\n-0.065\n-7.35\n<.0001\n(Outer Gas Flow Valve+0.13095)*(% Inner Power+0.02679)\n-0.127\n-14.12 <.0001\n(Outer Gas Flow Valve+0.13095)*(Dil H2 Flow (slm)+0.04464)\n-0.046\n-5.21\n<.0001\n(Outer Gas Flow Valve+0.13095)*(TCS flow (slm)-0.02679)\n0.076\n8.54\n<.0001\n(Outer Gas Flow Valve+0.13095)*(Radial Xformed-0.05263)\n0.045\n3.31\n0.001\n(Dep Temp-0.02679)*(Dop Mix Ratio+0.00893)\n0.310\n37.37\n<.0001\n(Dep Temp-0.02679)*(Dop Main Flow-0.00893)\n0.068\n7.97\n<.0001\n(Dep Temp-0.02679)*(% Inner Power+0.02679)\n0.045\n5.33\n<.0001\n(Dep Temp-0.02679)*(Dil H2 Flow (slm)+0.04464)\n0.118\n14.1\n<.0001\n(Dep Temp-0.02679)*(TCS flow (slm)-0.02679)\n-0.054\n-6.52\n<.0001\n(Dop Main Flow-0.00893)*(% Inner Power+0.02679)\n-0.040\n-4.68\n<.0001\n(Dop Main Flow-0.00893)*(TCS flow (slm)-0.02679)\n0.034\n3.85\n0.0001\n(Dop Mix Ratio+0.00893)*(% Lower Power+0.00893)\n0.026\n3.14\n0.0017\n(Dop Mix Ratio+0.00893)*(Dil H2 Flow (slm)+0.04464)\n0.171\n19.26\n<.0001\n(Dop Mix Ratio+0.00893)*(TCS flow (slm)-0.02679)\n-0.254\n-30.27 <.0001\n(Dop Mix Ratio+0.00893)*(Radial Xformed-0.05263)\n0.081\n6.18\n<.0001\n(% Lower Power+0.00893)*(Dil H2 Flow (slm)+0.04464)\n-0.079\n-9.16\n<.0001\n(% Lower Power+0.00893)*(TCS flow (slm)-0.02679)\n0.050\n6.02\n<.0001\n(% Inner Power+0.02679)*(TCS flow (slm)-0.02679)\n0.023\n2.78\n0.0055\n(Dil H2 Flow (slm)+0.04464)*(Radial Xformed-0.05263)\n-0.031\n-2.42\n0.0155\n(% Inner Power+0.02679)*(Radial Xformed-0.05263)\n0.048\n3.78\n0.0002\nFIGURE 4-3: Full Model ANOVA Summary Statistics -\nRadial Distance Included as an Explicit Parameter\nSummary of Fit\nRSquare\n0.978321\nRSquare Adj\n0.977916\nRoot Mean Square Error\n0.331037\nMean of Response\n3.392218\nObservations (or Sum Wgts) 2128\nAnalysis of Variance\nSource\nDF\nSum of SquaresMean Square\nModel\n10325.661\n264.761\nError\n228.815\n0.11\nC. Total\n10554.476\nLack Of Fit\nSource\nDF\nSum of SquaresMean Square F Ratio\nLack Of Fit\n216.53874\n0.216539\n17.2471\nPure Error\n12.27616\n0.011283\nProb > F\nTotal Error\n228.81491\n<0.0001\nMax RSq\n0.9999\nAs Table 4-2 demonstrates, 36 main effects and one-way\ninteractions were significant to at least 95%, with 25 of these\n\n6.780 - Semiconductor Manufacturing, Spring 2003, Professor Duane Boning\nterms being significant to <0.0001%.\nAn interesting\nobservation is that, although the main effects of Center Gas\nFlow, Outer Gas Flow, and % Lower Power are not\nsignificant, several of their interaction terms are. The full\nmodel performs very well with an R2-adj of 97.8% and\nprobability of a Lack of Fit of <0.0001%. Summary statistics\nfor the model are shown in Figure 4-3.\nAlthough this model demonstrates that many more\nparameters affect the final parameter of interest - resistivity -\nit is likely that an engineer would find it of little practical use\nsince it has so many terms. The exception to this, however,\nmight be if that engineer could develop an automated system\nthat could use the full model to control a process.\nWith this in mind, the research team pared the model down\nto include just eight terms - the seven significant terms from\nthe previous analyses and radial distance. The results for this\nmodel (Table 4-2 and Figure 4-4) illustrate that even with just\nthese eight terms, little resolution is lost in explaining the\nunderlying variation; R2-adj is still a respectable 95.2%, and\nprobability of a Lack of Fit is still <0.0001%.\nTABLE 4-2: Parameter Estimates for Simplified Model\nIncluding Radial Distance\nTerm\nEstimate\nStd Error\nT Ratio\nProb>|t|\nIntercept\n3.3511\n0.0106\n316.15\n0.0000\nDep Temp\n-0.4457\n0.011506\n-38.74\n<.0001\nDop Mix Ratio\n-2.2360\n0.011696\n-191.2\n0.0000\nDil H2 Flow\n(slm)\n-0.2919\n0.011546\n-25.28\n<.0001\nTCS flow (slm)\n0.3759\n0.011432\n32.88\n<.0001\n(Dep Temp-\n0.02679)*(Dop\nMix\nRatio+0.00893)\n0.3205\n0.011793\n27.18\n<.0001\n(Dop Mix\nRatio+0.00893)*\n(Dil H2 Flow\n(slm)+0.04464)\n0.1982\n0.011838\n16.74\n<.0001\n(Dop Mix\nRatio+0.00893)*\n(TCS flow\n(slm)-0.02679)\n-0.2701\n0.011785\n-22.92\n<.0001\nRadial Xformed\n-0.1186\n0.01723\n-6.88\n<.0001\nV. CONCLUSION\nIn this paper, we verified the findings of Gower-Hall with\nregards to the significant parameters affecting resistivity.\nFurthermore we determined that position, though being\nsignificant in the model, contributes some variation to\nresistivity.\nCurrently, the pattern map used by Gower-Hall to measure\nresistivity is a one-dimensional line of points across the wafer\ndiameter. An improved map would be any kind of two-\ndimensional pattern, such as the pattern used for thickness.\nThis method would provide a better estimate of the effect of\nresistivity variance as a function of radial displacement from\nthe wafer center. This would also facilitate analysis of\nresistivity nonuniformity across the face of the wafer.\nFIGURE 4-4: ANOVA Summary Statistics for\nSimplified Model Including Radial Distance\nSummary of Fit\nRSquare\n0.952635\nRSquare Adj\n0.952456\nRoot Mean Square Error\n0.485717\nMean of Response\n3.392218\nObservations (or Sum Wgts)\nAnalysis of Variance\nSource\nDF\nSum of Squares Mean Square\nModel\n10054.559\n1256.82\nError\n499.918\n0.24\nC. Total\n10554.476\nLack Of Fit\nSource\nDF\nSum of Squares Mean Square\nLack Of Fit\n203.0612\n0.918829\nPure Error\n296.85636\n0.156405\nTotal Error\n499.91756\nAreas that merit further research include the following:\nIt would have been useful to have data for all\nF Ratio\n5.8747\nProb > F\n<0.0001\nMax RSq\n0.9719\nexperimental runs. The team probably lost some resolution in\nthe analysis as a result of the lack of this data.\nIn the data provided, deposition time was kept constant at\n50 sec. As a result, it is not clear what effect time might have\non resistivity. Further experimentation might help establish\nwhat, if any, relationship might be present.\nThe research team accepted Gower-Hall's assumption that\nthickness and resistivity are not correlated. Despite this, the\nteam feels that this relationship, or lack thereof, warrants\nfurther investigation.\nREFERENCES\n[1] A. E. Gower-Hall, \"Integrated Model-Based Run-to-Run Uniformity\nControl for Epitaxial Silicon Deposition,\" MIT Thesis, 2001\nRoland Sargeant (BS'97-SM'03 - MBA '03) hereafter referred to as Sarge.\nSarge likes to hang out on the beach in Barbados with his plastic arm floaties\n(he can't swim).\nErik Smith (BS'94-SM'03-MBA'03) hereafter referred to as Skipper.\nSkipper can swear like a sailor."
    },
    {
      "category": "Resource",
      "title": "smith_sarg_talk.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-780-semiconductor-manufacturing-spring-2003/2c01cf2f6bfd32ffde3260afbe14fa99_smith_sarg_talk.pdf",
      "content": "Data Analysis\nIntegrated Model-Based Run-to-Run Uniformity Control for Epitaxial Silicon Deposition - A. Gower-Hall\nErik Smith, Roland Sargeant\n6.780 Semiconductor Manufacturing\nProf. Duane Boning\n\nAgenda\n- Overview of Thesis DOE\n- Thesis Findings\n- First Stage - Verification of Findings\n- Individual Position Model\n- Absolute Radial Position Model\n\nData Analysis focuses on Resistivity Measurements\nOverview of Thesis\n-\nData Taken by Aaron Gower-Hall for PhD Thesis\n-\nRun-to-Run Uniformity Control of Thickness and Resistivity for\nEpitaxial Silicon Deposition\nDesign of Experiment\n-\nMulti Variable Fractional Factorial Design\n-\n9 changing variables (inputs)\n-\n19 measurement posits (-87.3 to +87.3 cm)\n-\n112 Experimental Trials\n-\nTotal of 2128 data points (19*112)\nData Analysis focuses on Resistivity Measurements\n\nResistivity as function of Radial Displacement?\nResistivity Map\n-80\n-40\n92.15 cm\nResistivity as function of Radial Displacement?\n-100\n-60\n-20\n100 cm\n\nLarge DOE with several input parameters\nInput Parameters (9)\nI\nH\nG\nF\nE\nD\nB\nB\nA\n1090-1150 (deg C)\nDeposition Temperature\n30-60 (slm)\nDilutant H2 Flow (slm)\n10-14 (slm)\nTrichlorosilane (TSC) flow\n40-60 (%)\n% Inner Power\n45-55 (%)\n% Lower Power\n40-260 (sccm)\nDopant Main Flow\n20-80 (%)\nDopant Mix Ratio (%)\n60-100 (Accusett outer)\nOuter Gas Flow Valve\n115-155 (Accusett inner)\nCenter Gas Flow Valve\nLarge DOE with several input parameters\n\nDataset required some manipulation\nVisualization of Experimental Design and Results\nInputs\nOutputs\nChanging Variables\nPosition (cm)\nExp\nA\nB\nC\nD\nE\nF\nG\nH\nI\n-87.3\n-77.6\n...\n87.3\nAvg\n\n2.5314\n2.5892\n...\n2.5199\n2.6490\n1.667\n3.1463\n3.1400\n...\n3.1407\n3.2000\n-1.571\n\n2.6352\n2.6454\n...\n2.6357\n2.7020\n1.571\n\n2.6825\n2.6715\n...\n2.6910\n2.7391\n1.5\n\n2.4573\n2.4644\n...\n2.4428\n2.5052\n... ...\n...\n...\n...\n...\n...\n...\n...\n...\n...\n...\n...\n...\n...\n-1\n-1\n-1\n-1\n\n4.9896\n4.9734\n...\n0.9224\n0.9485\nAvg\n3.2327\n3.2616\n...\n4.9698\nDataset required some manipulation\n\nTrying to understand Resistivity relation with position\nApproach\n- Looked at Plots of Raw Data\n- Looked at Raw Data Averages\n- Verified Gower-Hall's Findings\n- Built Explicit Models for Each of 19 points\n- Included Position as an Explicit Variable\nTrying to understand Resistivity relation with position\n\nVisualization of Experimental Design and Results\nInputs\nOutputs\nChanging Variables\nPosition (cm)\nExp\nA\nB\nC\nD\nE\nF\nG\nH\nI\n-87.3\n-77.6\n...\n87.3\nAvg\n\n2.5314\n2.5892\n...\n2.5199\n2.6490\n1.667\n3.1463\n3.1400\n...\n3.1407\n3.2000\n-1.571\n\n2.6352\n2.6454\n...\n2.6357\n2.7020\n1.571\n\n2.6825\n2.6715\n...\n2.6910\n2.7391\n1.5\n\n2.4573\n2.4644\n...\n2.4428\n2.5052\n... ...\n...\n...\n...\n...\n...\n...\n...\n...\n...\n...\n...\n...\n...\n-1\n-1\n-1\n-1\n\n4.9896\n4.9734\n...\n0.9224\n0.9485\nAvg\n3.2327\n3.2616\n...\n4.9698\n\nPlot of Raw Data\n-100\n-50\nPosition (cm)\nResistivity (ohms*cm)\nRaw Data\n\nVisualization of Experimental Design and Results\nInputs\nOutputs\nChanging Variables\nPosition (cm)\nExp\nA\nB\nC\nD\nE\nF\nG\nH\nI\n-87.3\n-77.6\n...\n87.3\nAvg\n\n2.5314\n2.5892\n...\n2.5199\n2.6490\n\n1.667\n3.1463\n3.1400\n...\n3.1407\n3.2000\n\n-1.571\n\n2.6352\n2.6454\n...\n2.6357\n2.7020\n\n1.571\n\n2.6825\n2.6715\n...\n2.6910\n2.7391\n1.5\n\n2.4573\n2.4644\n...\n2.4428\n2.5052\n... ...\n...\n...\n...\n...\n...\n...\n...\n...\n...\n...\n...\n...\n...\n-1\n-1\n-1\n-1\n\n4.9896\n4.9734\n...\n0.9224\n0.9485\n...\nAvg\n3.2327\n3.2616\n4.9698\n\nAverage Resistivity across wafer\nAverage Resistivity by Position\n)\nAverage Resistivity (ohms*cm\n4.95\n5.05\n5.1\n5.15\n5.2\n5.25\n5.3\n5.35\n-100\n-50\nPosition (cm\n\nMRS Experimental Design and Results\nInputs\nOutputs\nChanging Variables\nPosition (cm)\nExp\nA\nB\nC\nD\nE\nF\nG\nH\nI\n-87.3\n-77.6\n...\n87.3\nAvg\n\n2.5314\n2.5892\n...\n2.5199\n1.667\n3.1463\n3.1400\n...\n3.1407\n-1.571\n\n2.6352\n2.6454\n...\n2.6357\n1.571\n\n2.6825\n2.6715\n...\n2.6910\n1.5\n\n2.4573\n2.4644\n...\n2.4428\n... ...\n...\n...\n...\n...\n...\n...\n...\n...\n...\n...\n...\n...\n-1\n-1\n-1\n-1\n\n4.9896\n4.9734\n...\n0.9224\nAvg\n3.2327\n3.2616\n...\n4.9698\n...\n2.6490\n3.2000\n2.7020\n2.7391\n2.5052\n0.9485\nWhat factors influence the output with 95% or better significance?\nAssn: Only main effects, one-way interactions, and 2nd-degree polynomial\nterms are significant.\n\nSignificant Effects and Interactions\nDeposition Temperature\nB\nx1\n\nDopant Mix Ratio (%)\nD\nx2\nDilutant H2 Flow (slm)\nH\nx3\nTrichlorosilane (TSC) flow\nI\nx4\n3 Significant One-Way Interactions\nDop Mix*TCS\nx2*x4\nDep Temp*Dopant Mix\nx1*x2\nDopant Mix * Dil H2\nx2*x3\n\nResults\nParameter Estimates\nTerm\nEstimate Std Error t Ratio Prob>|t|\nIntercept\n3.3448562 0.044178 75.71\n<.0001\nDep Temp\nx1\n-0.445737 0.048131\n-9.26\n<.0001\nDop Mix\nx2\n-2.235974 0.048926\n-45.7\n<.0001\nDil H2\nx3\n-0.291859 0.048298\n-6.04\n<.0001\nTSC\nx4\n0.3759196\n0.04782\n7.86\n<.0001\nDep Temp * Dop Mix x1*x2 0.3205027 0.049333\n6.5\n<.0001\nDop Mix * Dil H2\nx2*x3\n0.19822\n0.049519\n0.0001\nDop Mix * TCS\nx2*x4 -0.270065 0.049299\n-5.48\n<.0001\ny = 345\n.3\n- 446\n.0\nx - 236\n.2\nx 2 - 292\n.0\nx 3 + 376\n.0\nx 4\n- 270\n.0\nx\nx\n4 + 321\n.0\nx\nx\n2 + 198\n.0\nx\nx\n\nSummary Statistics\nAnalysis of Variance\nSource\nDF Sum of Squares Mean Square F Ratio\nModel\n528.59914\n75.5142\n347.5453\nError\n22.59698\n0.2173\nProb > F\nC. Total 111\n551.19612\n<.0001\nLack Of Fit\nSource\nDF Sum of Squares Mean Square F Ratio\nLack Of Fit 15\n9.957507\n0.663834\n4.6743\nPure Error 89\n12.639468\n0.142016\nProb > F\nTotal Error 104\n22.596975\n<.0001\nMax RSq\n0.9771\nR-sq (Adj) = 96.5244\n\nExperimental Design and Results\nInputs\nOutputs\nChanging Variables\nPosition (cm)\nExp\nA\nB\nC\nD\nE\nF\nG\nH\nI\n...\n...\n...\n...\n...\n...\n...\n...\n...\n...\n2.5314\n2.5892\n2.5199\n3.1463\n3.1400\n3.1407\n2.6352\n2.6454\n2.6357\n2.6825\n2.6715\n2.6910\n2.4573\n2.4644\n2.4428\n4.9896\n4.9734\n0.9224\n-87.3\n-77.6\n...\n87.3\nAvg\n2.6490\n1.667\n\n3.2000\n-1.571\n\n2.7020\n1.571\n\n2.7391\n1.5\n\n2.5052\n... ...\n...\n...\n...\n...\n...\n...\n...\n...\n...\n-1\n-1\n-1\n-1\n\n0.9485\nAvg\n3.2327\n3.2616\n...\n4.9698\nWhat factors influence the output with 95% or better\nsignificance?\nAssn: Only main effects, one-way interactions, and 2nd-degree\npolynomial terms are significant.\n\n-100\n-80\n-40\nx\nx\nx\nx\nx\nx\nx\ny\nβ\nβ\nβ\nβ\nβ\nβ\nβ\n+\n+\n+\n+\n+\n+\n=\n-\nx\nx\nx\nx\nx\nx\nx\ny\nβ\nβ\nβ\nβ\nβ\nβ\nβ\n+\n+\n+\n+\n+\n+\n=\n-\nx\nx\nx\nx\nx\nx\nx\ny\nβ\nβ\nβ\nβ\nβ\nβ\nβ\n+\n+\n+\n+\n+\n+\n=\n-\n...\nx\nx\nx\nx\nx\nx\nx\ny\nβ\nβ\nβ\nβ\nβ\nβ\nβ\n+\n+\n+\n+\n+\n+\n=\nx\nx\nx\nx\nx\nx\nx\ny\nβ\nβ\nβ\nβ\nβ\nβ\nβ\n+\n+\n+\n+\n+\n+\n=\nx\nx\nx\nx\nx\nx\nx\ny\nβ\nβ\nβ\nβ\nβ\nβ\nβ\n+\n+\n+\n+\n+\n+\n=\n...\n-60\n-20\n.\n.\n.\n.\n.\n.\n\ny = β1 x1 + β 2 x2 + β 3 x3 + β 41 x4 + β12 x12 + β 23 x23 + β 24 x14\nInt\nβ1\nβ2\nβ3\nβ4\nβ 1β 2\nβ 2β 3\nβ 2β 4\nR\n2-adj Prob LOF\n-87.3\n-77.6\n-67.9\n-58.2\n-48.5\n-38.8\n-29.1\n-19.4\n-9.7\n9.7\n19.4\n29.1\n38.8\n48.5\n58.2\n67.9\n77.6\n87.3\n3.184 -0.414 -2.117 -0.317\n0.388\n0.298\n0.232\n-0.283\n3.212 -0.435 -2.138 -0.321\n0.383\n0.319\n0.230\n-0.279\n3.276 -0.432 -2.192 -0.313\n0.369\n0.315\n0.213\n-0.265\n3.319 -0.429 -2.216 -0.320\n0.357\n0.300\n0.223\n-0.250\n3.346 -0.449 -2.244 -0.304\n0.348\n0.321\n0.196\n-0.256\n3.364 -0.456 -2.249 -0.286\n0.348\n0.328\n0.192\n-0.244\n3.360 -0.456 -2.256 -0.285\n0.355\n0.334\n0.188\n-0.252\n3.401 -0.440 -2.282 -0.280\n0.389\n0.309\n0.189\n-0.280\n3.440 -0.470 -2.280 -0.242\n0.424\n0.330\n0.156\n-0.313\n3.493 -0.450 -2.327 -0.258\n0.425\n0.327\n0.173\n-0.311\n3.441 -0.462 -2.296 -0.252\n0.418\n0.331\n0.166\n-0.307\n3.392 -0.430 -2.276 -0.285\n0.380\n0.308\n0.192\n-0.277\n3.369 -0.448 -2.258 -0.283\n0.359\n0.325\n0.190\n-0.256\n3.374 -0.454 -2.264 -0.281\n0.362\n0.326\n0.182\n-0.259\n3.385 -0.458 -2.269 -0.290\n0.358\n0.329\n0.190\n-0.251\n3.361 -0.455 -2.250 -0.295\n0.360\n0.328\n0.200\n-0.247\n3.329 -0.441 -2.230 -0.312\n0.361\n0.315\n0.214\n-0.250\n3.280 -0.450 -2.190 -0.307\n0.378\n0.326\n0.214\n-0.271\n3.227 -0.441 -2.149 -0.316\n0.382\n0.323\n0.226\n-0.278\n0.897\n<0.0001\n0.909\n<0.0001\n0.940\n<0.0001\n0.954\n<0.0001\n0.969\n<0.0001\n0.967\n<0.0001\n0.967\n<0.0001\n0.959\n<0.0001\n0.942\n0.0005\n0.953\n<0.0001\n0.948\n<0.0001\n0.958\n<0.0001\n0.968\n<0.0001\n0.968\n<0.0001\n0.967\n<0.0001\n0.967\n<0.0001\n0.956\n<0.0001\n0.941\n0.0003\n0.924\n0.0221\nmax 3.493 -0.414 -2.117 -0.242\n0.425\n0.334\n0.232\n-0.244\n0.969\n0.0221\nmin 3.184 -0.470 -2.327 -0.321\n0.348\n0.298\n0.156\n-0.313\n0.897\n0.0003\n% diff 9.70% 13.37% 9.89% 32.89% 22.22% 12.13% 48.67% 28.09%\n\n-100\n-80\n-40\nHow to interpolate\nbetween points?\n-60\n-20\n\nSolution: Make Position an Explicit Parameter\nInputs\nOutputs\nChanging Variables\nPosition (cm)\nExp\nA\nB\nC\nD\nE\nF\nG\nH\nI\n-87.3\n-77.6\n...\n87.3\nAvg\n\n2.5314\n2.5892\n...\n2.5199\n2.6490\n\n1.667\n3.1463\n3.1400\n...\n3.1407\n3.2000\n\n-1.571\n\n2.6352\n2.6454\n...\n2.6357\n2.7020\n\n1.571\n\n2.6825\n2.6715\n...\n2.6910\n2.7391\n1.5\n\n2.4573\n2.4644\n...\n2.4428\n2.5052\n... ...\n...\n...\n...\n...\n...\n...\n...\n...\n...\n...\n...\n...\n...\n-1\n-1\n-1\n-1\n\n4.9896\n4.9734\n...\n0.9224\n0.9485\nAvg\n3.2327\n3.2616\n...\n4.9698\n\nInputs\nChanging Variables\nExp\nA\nB\nC\nD\nE\nF\nG\nH\nI\nPosit (cm)\n\n-87.3\n\n-77.6\n\n...\n...\n\n87.3\n\n1.667\n\n-87.3\n\n1.667\n\n-77.6\n\n...\n...\n\n1.667\n\n87.3\n\n...\n...\n...\n-1\n-1\n-1\n-1\n-87.3\n-1\n-1\n-1\n-1\n-77.6\n...\n...\n-1\n-1\n-1\n-1\n87.3\nOutput\n2.5314\n2.5892\n...\n2.5199\n3.1463\n3.1400\n...\n3.1407\n...\n4.9896\n4.9734\n...\n0.9224\n\nResults\n- Position Transformed to Absolute Radial\nDistance\n\nResults - \"Pared Down\" Model\nParameter Estimates\nTerm\nEstimate Std Error t Ratio Prob>|t|\nIntercept\n3.3448562 0.010676 313.31\nDep Temp\n-0.445737 0.011631 -38.32 <.0001\nDop Mix Ratio\n-2.235974 0.011823 -189.1\nDil H2 Flow (slm)\n-0.291859 0.011672 -25.01 <.0001\nTCS flow (slm)\n0.3759196 0.011556\n32.53\n<.0001\n(Dep Temp-0.02679)*(Dop Mix Ratio+0.00893)\n0.3205027 0.011921\n26.88\n<.0001\n(Dop Mix Ratio+0.00893)*(Dil H2 Flow (slm)+0.04464)\n0.19822\n0.011967\n16.56\n<.0001\n(Dop Mix Ratio+0.00893)*(TCS flow (slm)-0.02679)\n-0.270065 0.011913 -22.67 <.0001\nSummary of Fit\nRSquare\n0.951576\nRSquare Adj\n0.951416\nRoot Mean Square Error\n0.491\nMean of Response\n3.392218\nObservations (or Sum Wgts)\nLack Of Fit\nSource\nDF Sum of Squares Mean Square F Ratio\nLack Of Fit\n189.19264\n12.6128\n82.49052\nPure Error 2105\n321.89971\n0.1529\nProb > F\nTotal Error 2120\n511.09235\n<0.0001\n\nConclusions\n- Verified and Quantified Gower-Hall's\nFindings\n- Confirmed that Radial Position does have\nan effect on Resisitivity\n- The way that you \"cut\" data effects\nsignificance of results and analysis\n\nThank You\nQUESTIONS?\n\nNo Evidence of large non-uniformity\nUniformity Analysis\ni\n)\nNo Evidence of large non-uniformity\nNonuniformity by Wafer Position\n2.245\n2.25\n2.255\n2.26\n2.265\n2.27\n2.275\n2.28\n2.285\n2.29\n2.295\n-100\n-50\nPos tion (cm\nNonuniformity"
    }
  ]
}