{
  "course_name": "Seminar in Environmental Science",
  "course_description": "Required for all Earth, Atmospheric, and Planetary Sciences majors in the Environmental Science track, this course is an introduction to current research in the field. Stresses integration of central scientific concepts in environmental policy making and the chemistry, biology, and geology environmental science tracks. Revisits selected core themes for students who have already acquired a basic understanding of environmental science concepts. The topic for this term is geoengineering.",
  "topics": [
    "Science",
    "Earth Science",
    "Climate Studies",
    "Environmental Science",
    "Social Science",
    "Public Administration",
    "Environmental Policy",
    "Science",
    "Earth Science",
    "Climate Studies",
    "Environmental Science",
    "Social Science",
    "Public Administration",
    "Environmental Policy"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 2 hours / session\n\nCourse Description\n\nThis term's theme is geoengineering - the deliberate large-scale manipulation of the environment to counter the effects of increased carbon dioxide in the atmosphere. Topics include: geology, geochemistry and the politics of nuclear waste disposal; responsible environmental practices for planetary exploration; responsible coastal land-use policy; international regulations for protecting the open-ocean environment; the ecological impact of environmental change; and effective policy for dealing with natural hazards near major cities.\n\nStudent Assignments\n\nStudents are required to read and discuss scientific literature, assemble and analyze relevant data, formulate and criticize quantitative theories, and provide weekly oral reports on their progress. They are also required to provide weekly written summaries of approximately one page, accompanied by a list of references. At the end of the term, each student has to present a synthesis of their work to the group, both orally and in a written report of approximately 10-15 pages.\n\nPrerequisites\n\nEnvironmental Earth Science Field Course (12.120), and Strange Bedfellows: Science and Environmental Policy (12.103), or permission of instructor\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nClass participation\n\n33%\n\nWeekly reports\n\n33%\n\nFinal report\n\n34%",
  "files": [
    {
      "category": "Resource",
      "title": "International Environmental Institutions and Geoengineering",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-085-seminar-in-environmental-science-spring-2008/9b76004db16ac5542896480d4b4c629b_fantone_w12.pdf",
      "content": "Dennis Fantone\n12.085\n5/2/08\nInternational Environmental Institutions and Geoengineering\nGeo-engineering represents a new and significant problem in the international community. Two\napproaches must be looked at for how to govern geo-engineering. The first is that of proactively\nsolving climate change. In this case, the international community must see climate change as an issue\nthat must be addressed and see geo-engineering as the solution. Implementation then becomes the key\nissue. The second is that of regulatory measures. Some forms of geo-engineering can be profitable,\nsuch as iron fertilization which can target rich philanthropists and possibly countries for carbon credits\nin the future. In this case, laws must be put in place to protect the environment from potential negative\nside effects of geo-engineering. Since the precedent for setting up regulatory environmental laws has\nalready been established, I will focus on pursuing pro-active geo-engineering.\nIn terms of pro-actively pursuing geo-engineering, new organizations must be set up. Right\nnow the most powerful authority on international environmental issues seems to be the UN. Being the\nlargest body of international law, it overrides smaller more regional international laws. Thus it is only\nlogical that for a project of global scale, such as geo-engineering, that it should be done through the\nUN. The UN has already declared that \"necessary and timely action should be taken to deal with\nclimate change within a global framework\". Thus if geo-engineering is somehow done through the\nstructure of the UN it may avoid the possible downfall that an \"injured state is entitled to obtain\ncompensation from the state which has committed and internationally wrongful act for the damage\ncaused by it\". Avoiding this legal issue is key, as any geo-engineering process will most likely change\nthe climate in different ways for different parts of the globe and almost certainly be detrimental\nsomewhere.\nAs far as I can tell, the best way to implement geo-engineering through the UN is to get\ninterested parties to form a Multilateral Environmental Agreement (MEA). This agreement could study\neffects of geo-engineering and perhaps suggest action to be approved by the general assembly.\nHowever, it would still be up to individual states to fund these projects."
    },
    {
      "category": "Resource",
      "title": "Law, Policy, and Logistics of Iron Fertilization",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-085-seminar-in-environmental-science-spring-2008/72402f1981213456c40e7d10d0b907bd_fantone_w6.pdf",
      "content": "Dennis Fantone\n3/17/08\n12.085\nLaw, Policy, and Logistics of Iron Fertilization\nIron fertilization will take place in international waters\n-London Convention\nLondon Convention- governing bodies decided to regulate iron fertilization Jan. 9, 2008\n-Current knowledge insufficient to justify large scale operations.\n-Currently figuring out how to regulate\ndecide what legal issues need to be addressed. How do they apply to london convention\nand protocol?\nwhat would be \"contrary to the aims of the convention/protocol\"?\nNeeded for scientific questioning...\nwhat is meant by \"large scale\"\nJustification for large experiments (40000 km^2)\nassessment of impacts of experiments\nWhat scientific groups need to evaluate\nimpacts of iron and other materials resulting from release of iron\n-gases\nimpact of bacteria decay and phytoplankton blooms\n-reduced oxygen concentrations\nmarine impacts\ntimescales of sequestration\ncarbon mass balance\nHow will Iron fertilization be used and governed?\n-probably done by private companies\n-how to regulate companies out of non treaty countries?\n-impose will on others (tariffs?)\n-scientific impartiality concerns?\n-different markets\n-voluntary market\n-small, but hard to regulate\n-regulated market (iron fertilization for carbon credits?)\n-permanent\n-additional\n-no leaks\n-accountable (accurate monitoring of sequestered carbon)"
    },
    {
      "category": "Resource",
      "title": "Solar Radiation Reduction and International Space Law",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-085-seminar-in-environmental-science-spring-2008/46dc0290bb2b942fcc97b629518335c5_fontone_w8.pdf",
      "content": "Dennis Fantone\n3/31/08\n12.085\nSolar Radiation Reduction and International Space Law\nPrinciples:\n1. Use of outer space is to be carried out for the benefit of all countries\n2. National activity bears international responsibility\nLiability\nDamage- includes loss of life, personal injury, property loss and damage.\nLaunching state responsible for damages caused by space object.\nJointly launched objects also carry joint responsibility.\nIncludes state whose territory it was launched from, not just parties involved with space\nobject\nMaking a claim\n-state which suffers damages may present a claim to the launching state within one year\nof when damages are discovered (even if full extent unknown).\n-If settlement is not arrived to a claim commission is formed\n-1 member from each party or group on each side (groups only get 1) and a third\nagreed upon member\n-majority vote\nProblem: claim commissions decision is only final and binding if both parties agree.\nAgain this brings out the challenge of semi-self-regulation while dealing with\ninternational law. However, when dealing with geo-engineering, the risks for damage\nmay be so great that countries involved would be deterred by the potential massive\nhumanitarian crisis.\nLegal to launch?\nIt seems that it would be legal to launch devices to reduce solar radiation into orbit or space.\nCountries or groups would have to simply go through proper registration channels that do not\nfunction as regulatory on the international level.\nConclusion: Launching solar reflectors into space or orbit could be done entirely legally. Countries\ninvolved would face the risk of claims coming against them from countries that may be harmed by\nsubsequent climate or weather changes. However, the exact effects of the change would be hard to\ndetermine, thus making any legal battles difficult at best. Additionally, there is another loop-hole in\nwhich countries could simply not agree to a binding claim commission decision, thus making all\nlegislation in place basically worthless."
    },
    {
      "category": "Resource",
      "title": "Solar Scattering",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-085-seminar-in-environmental-science-spring-2008/e7d0f0ae13d49b0cb167d1b5d8147357_fantone_w3.pdf",
      "content": "Dennis Fantone\n2/24/08\n12.085\nSolar scattering\n~ $1 billion per year, 2 orders of magnitude less then limiting fossil fuel energy\nResonance scattering seems most effective method ($.3-.75 billion per year)\nthree methods of deployment\nTerrestrial stratosphere\nleast expensive\n5 year residence time\nLow Earth Orbit\nlonger term\nless cost effective at this point\nEarth-sun lagrange point\nless material needed\ncould deflect light towards or away from earth as needed\nProposals\nSub-microscopic oxide particulates (SO2)\nConducting sheets in stratosphere or low earth orbit\nQuasi-resonant scatterers (stratosphere)\nFine-grained insolation modulation\n-differentiate cooling and heating based on latitude`\nStanford Environmental law Journal-basically states that geoengineering should be looked at because if\ncarefully researched and done with caution it is low-risk. It is potentially economically and socially\ncost effective compared to reduction of greenhouse gases. Additionally, since more developed\ncountries would probably foot most of the bill it fixes the tragedy of the commons and uses a \"polluter\npays\" solution, keeping developing nations happy."
    },
    {
      "category": "Resource",
      "title": "Wind Power Costs and Installation",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-085-seminar-in-environmental-science-spring-2008/5b8da7e6e0c8db6ca308bcc1f25feb88_rigel_w7.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n\n12.085 Seminar in Environmental Science\nSpring 2008\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nAdam Rigel\n12.085\nDaniel Rothman\n3/31/08\nWind Power costs and installation\nAs of 2001, the total cost of production and installation of a utility grade\n(approximately 1.5-2 MW turbine) wind turbine exceeded $1.5 million. As of Aug 2007,\nthese costs rose as a result of rising material prices and shortage of turbine production.\nThese factors led to an increase in total costs to over $2.5 million for a typical 1.5 MW\nturbine1. The shortage of manufacturing is such that large developers have secured all\nturbines for the next couple years, leaving manufacters no supply for smaller, community\nwind projects of 10 MW or less. GE and Vestas are the top wind turbine manufacturers,\nbut more manufacturers have entered the market which may allow for turbine prices to\nstabilize in the coming years2.\nFor larger, utility scale turbines, the majority of materials needed to produce\nturbines are steel and fiberglass. Steel composes 95% of the tower, hub, and nacelle, and\n80% of the turbine machinery. Fiberglass composes of more than 95% of most turbine\nblades though newer turbines may use carbon fiber or other lightweight materials.\nHowever, turbine blades make up 10% of the Thus, the material cost of towers is closely\nrelated to steel prices3.\nWind turbines have an expected lifespan of around 30 years and its components\nare expected to survive 4*10^8 fatigue stress cycles, which is hardier than aircraft\ncomponents or many other man-made structures4.\nThe National Renewable Energy Laboratory in 2002 made a model to estimate the\ncost of manufacturing and installing single wind turbine towers and scaling the cost by\nthe size of the rotor diameter. This model took into account differences in turbine design\nby estimating the mass of the materials in each turbine and estimating each material's\ncost per kilogram. In addition, it takes account for installation and operation costs.\nThrough their estimates, normalized to the year 2002, they came up with a figure of about\n$1 million for the production of a 1.5 MW, land-based turbine and about $0.4 million for\nthe installation leading to an initial cost of capital of $1.4 million dollars. For upkeep and\noperation, including a typical land lease fee, there is a cost of around $50,000 each year.\nIn sum, this leads to a cost of $0.048/kWh which is only slightly more expensive than\ncoal at a cost of $0.04/kWh . This number will change based on all inputs plus the\nfinancing involved for the project. In addition, when the rotor diameter is increased to 90\nmeters to create a 3 MW turbine and the turbine is placed in shallow water, the cost\ndoubles since cost relates to the rotor length cubed in addition to the extra difficulty in\ninstalling turbines at sea5.\n1http://seattletimes.nwsource.com/html/businesstechnology/2003861483_windmillshortage31.html?syndica\ntion=rss\n2http://seattletimes.nwsource.com/html/businesstechnology/2003861483_windmillshortage31.html?syndica\ntion=rss\n3 http://www.awea.org/pubs/factsheets/windpowertoday_2007.pdf\n4 http://www.awea.org/pubs/factsheets/windpowertoday_2007.pdf\n5 http://www.nrel.gov/wind/pdfs/40566.pdf\n\nAnother variable involved in pricing wind power relates to the size of a wind\nproject. Electricity from individual turbines will cost more than that from a group of\nturbines given that operation and maintenance costs can be spread over more turbines and\nthe cost of transmission decreases6.\nLastly, ownership of a wind turbine can affect electricity costs mostly based on\nthe financing available. A vast majority of wind power projects are owned by\nindependent, private power producers who do not get as good a deal on financing as large\nelectric utilities. The difference in financing can lead to up to a 30% increase in\nelectricity costs over large electric utilities7.\nAccording to DOE National Energy Survey, the US produced 4.6*10^8 kWh of\nelectricity, which at 5 cents a kWh would cost the nation $203 billion dollars a year. In\norder to place enough 1.5 MW wind turbines to produce that much electricity, the cost\nwould be around $690 billion dollars where each year the carrying cost would be on the\norder of $23 billion a year.\n6 http://www.awea.org/pubs/factsheets/EconomicsOfWind-Feb2005.pdf\n7 http://www.awea.org/pubs/factsheets/EconomicsOfWind-Feb2005.pdf"
    },
    {
      "category": "Resource",
      "title": "Homework #1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-085-seminar-in-environmental-science-spring-2008/d58afd953bb69986a82e45031b6b07a4_song_w2.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n\n12.085 Seminar in Environmental Science\nSpring 2008\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nLisa Song\n2-19-08\n12.085\n\nHomework #1\n\nKeith (2000) gave a good overview of the history of climate/geoengineering. I\nwas most interested in the section on fertilizing the oceans. In theory, the idea seems\nperfect: iron is a major limiting nutrient in the oceans, and its ratio with carbon is\n1:10,000 in the deep oceans. So the addition of extra iron would be very effective in\nburying extra carbon in the short term (Keith, 2000). The idea has already gone beyond\ntheory: small scale experiments have been conducted in the open ocean and scientists\nhave noted increased phytoplankton activity over a period of days or weeks. Several\ncommercial companies have expressed interest in conducting larger demonstration\nprojects; the companies are largely drawn by the potential to use ocean fertilization as\nglobal carbon credits (Chisolm et al., 2001).\n\nChisolm et al. (2001) argues strongly against using ocean fertilization for carbon\ncredits. The article is clearly biased and mentions only the negative consequences, but I\nthink its most compelling argument is that we can't predict the long-term consequences of\nlarge-scale ocean fertilization. There are researchers who spend their lives modeling\nplankton and bacteria behavior; we simply don't know what will happen if we perturb the\nocean's biogeochemical cycles. One serious side effect is the deoxygenation of the deep\noceans, which would kill off many organisms including fish. Some proponents believe Fe\nfertilization will help the fishing industry (Keith, 2000), but eutrophication would do the\nopposite. Another possible consequence is the increase of organisms that release CH4 or\nNO2. Both are greenhouse gases that warm the atmosphere more effectively than CO2, so\n\nocean fertilization could actually increase global warming. Lastly, there is the danger that\nfinancial incentives will outweigh the science. If ocean fertilization becomes\ncommercially profitable for carbon credits, everyone will want to try it, regardless of the\nenvironmental consequences (Chisolm et al., 20001). Just like global warming, ocean\nfertilization could turn into a situation where science has little power over economic\nforces.\n\nReferences:\nChisolm, S.W. et al. (2001), Oceans: Dis-Crediting Ocean Fertilization, Science\n294:5541, 309-310.\n\nKeith, D. (2000), Geoengineering the Climate: History and Prospect, Annu. Rev. Energy\nEnviron. 2000. 25:245-84."
    },
    {
      "category": "Assignment",
      "title": "Assignment 2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-085-seminar-in-environmental-science-spring-2008/1843c5c16853b8a88daef3a4bc4aabc9_song_w3.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n\n12.085 Seminar in Environmental Science\nSpring 2008\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nLisa Song\n2-25-08\n12.085 Assignment 2\nTeller et al. (1997) argues that it is much cheaper to combat global warming\nthrough geoengineering (specifically, scattering incoming solar radiation by injecting\nparticles into the atmosphere or Earth's orbit) than through limiting greenhouse gas\nemissions.\nThe paper discusses in detail the efficiency of various ways of deflecting sunlight\nfrom Earth. In particular, the focus is on the estimated cost for each method and the\nestimated mass of scatterers needed. One idea is to inject alumina particles into the\nstratosphere. The effects will be similar to injecting sulfates, but without the associated\nproblems of acid rain and air pollution. It's interesting that the estimated amounts of\nalumina (and SO2) needed are insignificant compared to the annual output from natural\nand anthropogenic activities. One disadvantage to this solution is the particles' short\nresidence time of 5 years in the stratosphere. The alumina would have to be re-injected\nmany times to achieve a long-term effect. This increases the cost associated with such a\nsolution, but it also offers opportunities for improvements over time. Other solutions such\nas placing reflective shields seem more risky in this aspect, due to the high initial cost\nand the difficulty in adjusting them if something goes wrong.\nI was surprised at the ambitious, almost arrogant tone of the paper. The authors\nstate in the abstract that their plans may be used to \"reduce or eliminate all climate\nfailures.\" We could have complete control over the climate. The most ambitious solution,\ncalled \"fine-grained insolation modulation,\" has the potential to warm or cool the surface\nat different latitudes, allowing for climate control on a regional scale. It could be used for\n\nstopping both global warming and future ice ages. Overall, I think the authors are too\noptimistic. Even if it becomes technically and economically feasible to control climate on\nlocal scales, the politics of the process will be messy. Everyone will have different ideas\nof what is the \"best\" climate for each region, and it will be nearly impossible to agree on\na plan.\nReferences:\nTeller et al., (1997), Global Warming and Ice Ages: Prospects for Physics-Based\nnd\nModulation of Global Change, Report for the 22\nInternational Seminar on Planetary\nEmergencies, Erice (Sicily), Italy, 20-23 August 1997."
    },
    {
      "category": "Resource",
      "title": "Week 2: Keith 2000",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-085-seminar-in-environmental-science-spring-2008/da28f7bba35c097f1f68a60d3c917cc7_stanley_w2.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n\n12.085 Seminar in Environmental Science\nSpring 2008\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nJessica Stanley\n2/18/08\n12.085\n\nWeek 2: Keith 2000\n\nIn Keith's review of geoengineering and the climate, he first defines\ngeoengineering as \"the intentional large-scale manipulation of the environment,\nparticularly manipulation that is intended to reduce undesired anthropogenic climate\nchange\" (245). He then summarizes the history of weather control and research into\ncontrolling climate, starting 1950s and 60s through to work in the 90s, and then gives a\nsummary of the different types of geoengineering which are currently getting attention\nincluding albedo modification through injection of aerosols into the upper atmosphere\nand placement of lenses or reflective material in space, carbon capture in terrestrial and\noceanic ecosystem, and sequestration. He then covered a brief evaluation of the more\nsocial aspects, the economics, risks, and politics.\n\nOne type of geoengineering which I had heard about before, but was interested to\nhear more about was capture in terrestrial ecosystems. I found it interesting that\ncroplands, lands we already modify, are actually more efficient at capture than forest\nlands. The idea of genetically modifying organisms to make capture more efficient is\nanother direction of research which could be really interesting. Keith also states that\n\"approximately one hectare per capita would be required for an energy system based\nentirely on terrestrial carbon fixation, roughly equivalent to the current use of cropland\nand managed forest combined\" (266). Does this mean that with more controlled\nmanagement of this land we could produce enough energy without fossil fuels? Is it\npossible to use land both for energy and for other uses like food production? I also\n\nwonder what effects would have to be considered in terms of soil and nutrient\nmanagement.\n\nThe other thing which caught my attention was in the political and social aspects\nof what happens if one day we have enough control of climate to create an \"optimum\nglobal climate\". Who gets to choose what is optimum? To some extent I think that is\nwhat is so morally confusing about geoengineering, if we are not just trying to reverse the\nchanges we have already made, who gets to decide what is best for the planet?"
    },
    {
      "category": "Resource",
      "title": "Week 3: Teller et al, 1997",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-085-seminar-in-environmental-science-spring-2008/d42878a48b079d3f7b26c6beb05fc6ca_stanley_w3.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n\n12.085 Seminar in Environmental Science\nSpring 2008\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nJessica Stanley\n12.085\n2/24/08\nWeek 3: Teller et al, 1997\nThe paper \"Global Warming and Ice Ages: Prospects for Physics-Based\nModulation of Global Climate Change\" submitted for the 22nd International Seminar on\nPlanetary Emergencies in 1997 discusses some interesting ideas for managing or\npreventing changes in climate. All methods discussed are methods to prevent ~1% of\nincoming solar radiation by scattering materials placed either in the stratosphere or space.\nThis is a different approach to the problem of global warming which most take, rather\nthan dealing with the cause of the problem, they instead look at counteracting the effects.\nThey cover several different methods of scattering light including injecting sulfate or\npossibly alumina aerosols into the stratosphere, dispersal of electrically conducting sheets\neither in the form of ultra thin sheets, mesh nets or tiny metallic walled balloons into\neither the stratosphere or low earth orbit, and emplacement of quasi-resonant scatterers\nmade of carbon caged alkali atoms or organic dyes into the stratosphere. They concluded\nthat these methods are well worth researching, and that they cost significantly less and\nwould be more politically feasible than large scale reduction in greenhouse gas emissions\nas a method for counteracting the current climate crisis.\nOne of the methods I thought was most interesting was the prospect of the\naluminum balloons placed in the stratosphere. Teller et al think it is practical because\nfrom a certain altitude they are self deploying and operating. They also claim that there is\nlittle to no environmental impact because the earth's crust is so aluminum rich, and the\naluminum would readily weather in the troposphere on the way down, the ballons\n\nessentially turn to powder and fall to earth without notice or large environmental changes.\nI think what interested me most about this proposal was the detail in which they\ndescribed the possibility of manufacturing these particles by using modified news paper\nprinting presses.\nMy major questions having read the article, which do not seem to be adequitly\naddressed are about the other effects of reducing the incident light by 1%. Would it have\na noticeable effect on agriculture or plant growth, or just to humans outside on a daily\nbasis? What about weather patterns and local climate? They briefly touch upon the\npossibility of modifying the climate lattitudinally, but they do not give any time to what\nthis might do to the weather patterns and other effects, and who would get to decide how\nthe climate was modified. My limited understanding of climate and weather leads me to\nbelieve that the pattern of incoming radiation drives the weather systems."
    },
    {
      "category": "Resource",
      "title": "HW 5",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-085-seminar-in-environmental-science-spring-2008/81892335d8048b0062a13c6f30e8c55f_song_w5.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n\n12.085 Seminar in Environmental Science\nSpring 2008\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nLisa Song\n3-17-08\n12.085 HW 5\nFor many geoengineering solutions, the cost of capturing and transporting CO2 is\na major limitation. Lackner et al. (1995) proposed using CO2 to synthesize solid\ncarbonates; their proposal would be much more feasible if the geoengineering site\nlocations were not constrained by their proximity to fossil fuel-burning plants. To solve\nthis problem, Lackner et al. (2001) showed that capturing CO2 directly from the air could\nbe cheaper and more efficient (in terms of overall CO2 mitigation) than using windmills.\nThe design of these CO2-collectors is based on cooling towers used for wind power in dry\nclimates (Bishop, 1993): water is pumped up the tower where it cools the air. The cooler\nair falls, generating much more energy than was needed for pumping the water up in the\nfirst place. In CO2-capture, the falling air would flow over CO2 sorbents instead of wind\nturbines. The capacity of each tower is 9,500 tons of CO2/day, or the total emissions from\nvehicles in a city of 700,000 people. The major challenge is to find the most optimal\nsorbent (Ca(OH)2 has been suggested) and develop a way to recycle the sorbent when\nextracting the CO2 from the sorbent (Lackner et al., 2001).\nPrototypes were created by Lackner and Global Research Technologies, LLC.\nThe news release doesn't have many technical details, but each completed tower could\nextract 1,000 tons of CO2/year, so millions would be needed to remove the estimated 25\nbillion tons that would stabilize CO2 levels at twice that of pre-industrial times (The Earth\nInstitute at Columbia University, 2007).\nI think this approach to CO2 extraction is both appealing and ominous--the\nadvantage is that extraction could be done anywhere, so that emissions from small,\n\nscattered sources (cars, for example) can be accounted for. The extracted CO2 can be re\nused for enhanced oil recovery, sequestered underground, or used to synthesize\ncarbonates. The danger is that it takes away any incentive for reducing emissions--\npeople will no longer be responsible for their emissions, since the CO2 extracted\noriginates from a variety of sources from all around the world.\nReferences:\nBishop, J.E. (1993), Wind power may yield cheap power, The Wall Street Journal, June\n9, 1993.\nThe Earth Institute at Columbia University (2007), First Successful Demonstration of\nCarbon Dioxide Air Capture Technology Achieved by Columbia University Scientist and\nPrivate Company, April 24, 2007.\nLackner et al. (1995), Carbon dioxide disposal in carbonate materials, Energy 20:11,\n1153-1170.\nLackner et al. (2001), 1st National Conference on Carbon Sequestration, Washington,\nDC, 2001 - 198.99.247.24,\nhttp://www.netl.doe.gov/publications/proceedings/01/carbon_seq/7b1.pdf"
    }
  ]
}