{
  "course_name": "Seminar in Historical Methods",
  "course_description": "This course is designed to acquaint students with a variety of approaches to the past used by historians writing in the twentieth century. The books we read have all made significant contributions to their respective sub-fields and have been selected to give as wide a coverage in both field and methodology as possible in one semester’s worth of reading. We examine how historians conceive of their object of study, how they use primary sources as a basis for their accounts, how they structure the narrative and analytic discussion of their topic, and what are the advantages and drawbacks of their various approaches.",
  "topics": [
    "Humanities",
    "History",
    "Comparative History",
    "Historical Methods",
    "Historiography",
    "Humanities",
    "History",
    "Comparative History",
    "Historical Methods",
    "Historiography"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 2 hours / session\n\nSyllabus Archive\n\nThe following syllabi come from a variety of different terms. They illustrate the evolution of this course over time, and are intended to provide alternate views into the instruction of this course.\n\nSpring 2008, David Ciarlo (\nPDF\n)\n\nSpring 2007, David Ciarlo (\nPDF\n)\n\nSpring 2005, David Ciarlo (\nPDF\n)\n\nSpring 2004, Anne McCants (\nPDF\n)\n\nSpring 2003, Jeffrey Ravel (\nPDF\n)\n\nSpring 2002, Elizabeth Wood (\nPDF\n)\n\nSubject Description\n\nThis course is designed to acquaint you with a variety of approaches to the past used by historians writing in the twentieth century. The books we will read have all made significant contributions to their respective sub-fields and have been selected to give as wide a coverage in both field and methodology as possible in one semester's worth of reading. We will examine how historians conceive of their object of study, how they use primary sources as a basis for their accounts, how they structure the narrative and analytic discussion of their topic, and what are the advantages and drawbacks of their various approaches.\n\nAssignments and Grading\n\nThe main written assignment for this course is a substantial research paper, on any reasonable subject of interest to you. These papers should be between 15-20 pages long, and should explore the given topic in substantial depth. History majors may use this paper to explore a possible thesis topic. The paper will be produced in the following stages:\n\nSES #\n\nKEY DATES\n\nStatement of topic interest and research proposal\n\nAnnotated bibliography\n\nBefore SES #10\n\nDraft\n\nFinal draft and class presentations",
  "files": [
    {
      "category": "Resource",
      "title": "dv_cat_mas.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-931-seminar-in-historical-methods-spring-2004/2c9aa9a28b5af29c6883ecb4dd620f0d_dv_cat_mas.pdf",
      "content": "1. The Great Cat Massacre\n\nI regret having to admit that this is another one of\nthose historical situations that is, well, funny. Awful,\ndisgusting, but funny nonetheless. Perhaps the humor\ncomes out of how absurd the whole situation is. The\nplanning of it, the execution. At no point did anyone\nsay hey, maybe this isn't such a good idea....those\npoor animals did us no harm¡.\n\nWould they have even said that? What I wonder is how\neveryone else treated Cats. It seems bizarre to just\nassume, as the author does, that some people venerated\nthese creatures while some saw it perfectly acceptable\nto kill them if the time comes. It wasn't seen as\nmurder. It was hardly even seen as cruel. What was cruel\nabout the massacre is that the Mistress's wife's pet was\nalso killed. The anguish caused to her is what we get,\nis what's described. The anguish caused to the cats as\nthey were being killed and stuffed in a bag and hanged\ndoes not seem to concern the people, or the author, all\nthat much.\n\nWhat is worthwhile is the analysis of history through\nminor acts and human mentality. And isn't that what\nhistory is all about to begin with? Taking of stories\nand seeing if they match and how they change. Beyond\nthat, however, is the idea of mentality, the thoughts of\nthe workers, the thoughts of the master and mistress,\nand how they can be expressed through the actions taken.\nI don't think people's thoughts and mentalities have\nchanged all that much from period to period. The way in\nwhich the laborers hated their master is not wholly\ndifferent from how workers may despise management.\nConflict between boss and employee have not changed,\nonly the surroundings in which these conflicts occur\nhave been altered, if ever so slightly."
    },
    {
      "category": "Resource",
      "title": "dv_mar_guer.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-931-seminar-in-historical-methods-spring-2004/296ba6cff196fc8b54f8d0a14e84292b_dv_mar_guer.pdf",
      "content": "1. The Return of Martin Guerre\n\nIn many instances history can be funny. Capturing 10\nscientists and holding them hostage can be viewed, in\nsome light, as hysterical, and so is the story of the\nfake Martin Guerre. This book doesn't exactly present it\nas the funniest thing that ever was, but the basic\noutlines of the story are nonetheless present. Who\nwouldn't want to take on a fake identity from time to\ntime?\n\nWhat I liked most about this narrative is that it was\nobvious from the very beginning that the writer is a\nwoman. The voice with which she described the characters\nseemed in some ways maternal. In addition, she was\n(perhaps overly) kind to the female characters.\nBertrande de Rols did deserve our sympathy, but she was\nalso just as misleading as everyone else involved. Yet\nDavis says of her that the obstinate and honorable\nBertrande does not seem a woman so easily fooled, not\neven by a charmer like Pansette. By the time she\nreceived him in her bed, she must have realized the\ndifference; as any wife of Artigat would have agreed,\nthere is no mistaking 'the touch of the man on the\nwoman'¡ (44). Bertrande is described very kindly. We\ndon't know for certain all these elements of her\ncharacter, Davis herself states in the introduction that\npainting peasant's lives and personalities is difficult\nfor lack of written texts, but regardless, she gives the\nwife the benefit of the doubt and assumes that because\nwe, today, would all know, then she must have been able\nto tell the difference. It is interesting that Davis\nmentions Pansette's charm in this phrase, to further\nemphasize just how smart Bertrande was (in looking past\nhis charms). The word honorable¡ seems a bit odd to add\nhere, since her doubting his identity, yet accepting him\nas her husband does not seem to fit that times'\ndefinition of honorable¡. Regardless, Davis describes\nthis woman of the house as an intelligent and courageous\none, who deserves not only our sympathy but our\nadmiration. I wonder if a male writer would have given\nthe same description."
    },
    {
      "category": "Resource",
      "title": "dvs_unred_cap.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-931-seminar-in-historical-methods-spring-2004/508d276205e46e09251e84684aa927a2_dvs_unred_cap.pdf",
      "content": "21H.931- Weekly responses\n\n1. The Unredeemd Captive\n\nWhat I enjoyed most about Demos' book was his portrayal of the\npeople as fictional characters. Historical narratives lend\nthemselves to be better understood by the fact that they are, in\nescense, stories. Sometimes these stories aren't interesting\nenough to be novels, but oftentimes when told in such a way they\nare much more relatable to the reader.\n\nWhat was a bit frustrating was his need to include his own\nre-interpretation of direct quotes. John William's words were\nnot hard to follow, and his telling of what was happening to\nEunice and where did not seem wholly complicated. However, after\neach description, Demos includes his own version a second time.\nThis just seems tedious and a tad annoying, and suggests to the\nfact that the direct quotes could mean something different than\nhow Demos is interpreting them. Wouldn't that just undermine his\nown ideas?\n\nIn addition, Demos does a lot of speculation. From things as\nlittle as assuming what days mean what to the characters, from\nhis description of the communities and how old they were,\neverything must be taken with a grain of salt. I personally\ncan't imagine just how he knew that a specific town's\narrangement was linear but broken near the center. Any sort of\nmap would not indicate how the town evolved over time, or what\nelse could have changed about it.\n\nThis story is most relatable possible due to the fact that it is\nset in Massachusetts, albeit 18th century Massachusetts. The\ntown of Deerfield is here; the rivers and forests are here; and\nwhile we don't live in the time when William's family was\ncaptured any description that even hinted at the weather or\nnatural landscape is very easy to picture."
    },
    {
      "category": "Resource",
      "title": "fah_eco_ind.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-931-seminar-in-historical-methods-spring-2004/a985abfe395719fced85b1a292362717_fah_eco_ind.pdf",
      "content": "Response to the Ecological Indian\n\nThe Ecological Indian by Steven Krech is an extremely interesting look at Native\nAmericans and their environment. The book starts by discussing the crying Indian,\nwhich is an ecology poster made in the early seventies that depicts an Indian with a tear\nrolling down his cheek. The slogan on the poster is \"pollution: it's a crying shame.\"\nThis poster is probably the most famous ecology poster every created. Krech's goal is to\ndisprove the belief that Indians lived in perfect harmony with their environment and that\nit was white people that caused the destruction of animal populations and the pollution of\nthe land. I found his chapters to be extremely interesting. Each one was an independent\nsection describing a different aspect of the environment that was impacted by the Indians.\nI found the first chapter particularly interesting, because I enjoy reading about the\nmigration to North America. The chapter takes a hard look at how the migration\noccurred focusing on when people moved down the American continents. I found his\ndiscussion of the killing off of big game animals to be interesting as well. I think that it is\na good place for him to start proving his point, because if the Indians had cared about\nkeeping the environment in balance, there would never be mass extinctions if the top\npriority was the environment. I did not really see how his second chapter added much to\nthe book. That chapter is a discussion of the Hohokam tribe and their massive irrigation\nsystem. It discussed the problems that the environment caused them, but lacks much of\nthe same material about actually impacting the land. All the subsequent chapters are\nabout different resource.\n\nI felt that the book was very well constructed and well supported through statistics\nand research. In the introduction Krech states that it is his goal to open the discussion on\nthe subject of the Indian impact on their environment. He definitely accomplishes this\ngoal. He does a good job of not going too far by making sweeping generalizations, but\ninstead sticks to his facts and the instances that he has researched. My only complaint\nabout the book is that I wished he could have had more of a purpose or a better\nconstructed thesis, and used each chapter to build on the previous one, tying it all\ntogether at the end of each chapter. This complaint is relatively minor in the scheme of\nthings and his book, being well research and well written was extremely enjoyable and\ninteresting."
    },
    {
      "category": "Resource",
      "title": "fah_sel_ess.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-931-seminar-in-historical-methods-spring-2004/93175d5c8e1c18cdef2d1420d7e3655e_fah_sel_ess.pdf",
      "content": "Fertility, Marriage and Culture:\n\nThis paper takes an interesting look at stereotypes people have about immigrant\nfamilies and birthrates. It makes the argument that the open lands in the west influenced\nthose regions demographics. Using data about marriage ages and birthrates the essay is\nable to show how there was an explosion in the fertility rates of settlers that slowly\nnormalized during the 19th Century. I felt the paper was extremely well grounded in\nfacts, as its numerous tables were extremely useful and helped back up the arguments\nmade in the writing. The paper does an excellent job of remaining concise as it takes just\nthree Norwegian communities in the Midwest and carefully analyzes the data collected\nfrom those groups. The conclusion does a nice job convincing the reader that it is logical\nto extrapolate these results to the majority of the settlements in the Midwest during the\n19th Century.\n\nJapan in War and Peace\n\nThis essay was extremely interesting. Currently I am also enrolled in John\nDower's class, History of World War II in Asia: Film, Fantasy, Fact, and just heard his\nlecture on the undercurrents of racism felt toward the Japanese during World War II and\nfound it fascinating. What I feel is so interesting about the subject is that it has been\nforgotten or overlooked. Today Americans tend to remember the Nazis with contempt or\nat least as being evil, but the hatred toward the Japanese is overlooked. I think that a\ncouple of graphics could have really improved the article. Prof. Dower showed the class\nResponse to Papers by Gjerde/McCants and Dower\n\nseveral such graphics and they are extremely powerful and really enhance the point of the\narticle, especially when showing Hitler, Mussolini, and 'the Jap'. I found the final part of\nthe article extremely interesting as well. I was really interested in his explanation of why\nwe seemed to forget our hatred of Japan during the postwar period. His line that we just\ntransferred our hate from the Japanese to the communists was an extremely interesting\nconclusion."
    },
    {
      "category": "Resource",
      "title": "knut_cs_lewis.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-931-seminar-in-historical-methods-spring-2004/e65985dfa5435073342e5b924ab507d5_knut_cs_lewis.pdf",
      "content": "Historical Methods\n3/17/04\nCS Lewis & J.J.R. Tolkien\nI really love C.S. Lewis's style of writing and though I am not religious at all I\nhave found his study and push of religion (especially in the Great Divorce) to be really\ncompelling. I had always heard of C.S. Lewis as a born again Christian, so it was\ninteresting to here another point from the article, yet I disagree with it in his work being\npessimistic. There is a strong feeling of darkness and human corruption and true evil, yet\nI don't see that as a pessimistic view of the world. The impression I got from the great\ndivorce was the feeling that salvation was all up to men; there was no reason people had\nto live in hell but by choice. It was sort of depressing that people would chose to be in\nhell but that they had the chance to keep changing their minds and go to heaven was what\ngot to me and how it was just accepting Gods love for you and the wish to better yourself\nthat got you there.\nI like how penetrating he is in some of his chapters to make you feel silly for\nyour own beliefs and so are better prepared to take on others. I found this especially in\nthe beginning of the Heavens chapter in The Discarded Image he tell how scientists then\ntalked about things having a liking to other things which we first would think as silly\nbecause they are not sentient. But then he goes on to make us feel silly for ascribing to\nour objects the ability to obey laws as if they had thought.\nI really liked how the article really tied their writing styles and thoughts the\nEnglish disenchantment and World Wars. The depression of the little man at the end of\n\nRings I feel really fits with the feelings of soldier depression when they were pushed\naway and not cared after instead of being heroes a lot more than any medieval\nconnections.\nI was wondering why you had us read the Discarded Image over one of Lewis's\nother books, especially after reading how the article believes it to be one of his worst.\nLewis and Tolkien seem to be described as dinosaurs holding on to the old\ntraditions but also as pioneers and breakers of traditions in many ways, breaking them to\ntry to get back to the old."
    },
    {
      "category": "Resource",
      "title": "knut_eco_ind.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-931-seminar-in-historical-methods-spring-2004/d494dad4f3d29f3856af5cfafeb615fd_knut_eco_ind.pdf",
      "content": "Historical Methods\n\nThe Ecological Indian\nI really liked the way Shepard Krech organized the book, with each chapter presenting new\ntheses about Indians and their connection with the environment, theses both supporting the idea\nof the ecological Indian and against it, then refuting the arguments against the theory of the\nNoble Indian giving reasons why these arguments were not true. He used numbers really well,\ngoing through where and how they had gotten the estimates of Indians before Columbus came to\nAmerica. I had not thought of the idea that the numbers could be skewed because an estimator\ncould be seen as racist if they gave a lower number. He goes over every argument finely and\npicks out the points of where they are wrong, and even where they are also right, giving both\nsides to the argument. I most liked the chapter about disease since I think he is right how people\nfully blame all the deaths of Indians by sickness on the Europeans. True, some Europeans used\ngerm warfare, yet he shows how, for most, it wasn't their intent to kill off the Indian population.\nThey even had selfish reasons to keep them alive, wanting them as slaves and for trade. The\nIndians were also partially to blame (even though it is thought as racist to say anything bad about\nthem like that now a days) since they also strongly wished to trade and would refuse to get\ninoculated to the disease when they could be. Some Indians and conservationists had fights over\nthe environment because of different beliefs, e.g. the idea that the animals reincarnate\nspecifically for human's food need. His conclusion was convincing because it showed that\nalthough, the ecological Indian ideal is in many of the Indian cultures, yet they do not always\nwant to be stereotyped to only feeling that way, they also have the human emotions of greed and\nambition over the earth."
    },
    {
      "category": "Resource",
      "title": "pov_coach_ru.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-931-seminar-in-historical-methods-spring-2004/c2c9237823382c9f3cf9200e437102a6_pov_coach_ru.pdf",
      "content": "Response 21H.931\n\nThe Coachman's Bare Rump and other Works from the MIT Faculty\n\nI don't claim to be full-blown historian (not yet at least) so there is a chance that I\nmissed some grand chain that connect the works of some of the history faculty together.\nBecause if there was one, I did miss it. As far as I'm concerned the only ties between the\npieces that I read were that they were written by MIT faculty. It was, however, very\ninteresting to read the works of the very people who have read mine, and graded mine. I\nhave had classes with Professor Dower, (who's paper I did not get a chance to read, there\nwere none left, but I have read a paper by him for a different class) Professor Ravel,\nProfessor Jacobs, and I am currently in your class. I must admit, though, that the pieces I\nread were quite intimidating. I, one day, want to be a high school history teacher, and\nalso attend graduate school for history. One of the things that struck me while reading\nthe papers was the tremendous amount of research and knowledge that it took to write\nthose twenty or thirty pages. When compared with anything that I have written so far,\nthere is such an extreme gap.\n\nI was also a little bit shocked by how bored I was with some of the papers.\n(Sorry, yes, your's too). Many of them, with the exclusion of Professor Ravel's (which\ncan be understood since it was originally a lecture), simply seemed too specific (not the\nright word, but my vocabulary is failing me right now) for me to enjoy. Maybe as a\nhistory student I should care more about the White Cattle of Britain, or the fertility of\nSwedish immigrants, but I really had a hard time refraining from just skipping to the end\nand reading the very last bits of these papers."
    },
    {
      "category": "Resource",
      "title": "pov_mediter.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-931-seminar-in-historical-methods-spring-2004/4b5c2d924d2362b5ab85281b4933f5da_pov_mediter.pdf",
      "content": "Response 3\n\nThe Mediterranean\n\nFernand Braudel's The Mediterranean was quite a bit different from our last two\nreadings. The Mediterranean was not a historical narrative, but rather (or at least it seemed to\nbe) a fairly complete historical analysis of the Mediterranean area in the age of Phillip II. I quite\nenjoyed the parts of the book that I read.\n\nMy first reaction to the section on mountains was along the lines of \"Why would I ever\nwant to know about the mountains surrounding the Mediterranean.\" I had imagined that it would\nbe a terribly long and boring chapter on geological and ecological concerns. I was pleasantly\nsurprised by the content. It was interesting, if a bit long.\n\nI also felt that sometimes Braudel tended to ramble when listing various examples of\nwhat he was talking about. It seemed that at some points he felt it was more important to list all\nof these examples, than to get his point across. I found this tendency to be a bit distracting at\ntimes, and I would sometimes have to go back to remember what point he was trying to make.\n\nI also found that this book was aimed at a more knowledgeable audience than myself.\nThe constant small historical references, such as the reference to \"snow water\" and its relation to\nSaladin and Richard the Lionheart, often went over my head. These references were so common\nthat I found it to be more than little distracting, in that I would want to know what he was talking\nabout, but all the footnotes were only to other books, never to explanations.\n\nAll in all, I found The Mediterranean to be both informative, and entertaining. It is a\n\ngood possibility that after the semester is over, I will read the entire book. It was also a nice\n\nchange of pace to read something other than a historical narrative."
    },
    {
      "category": "Resource",
      "title": "pov_tru_ab_hist.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-931-seminar-in-historical-methods-spring-2004/ea5212e6dccd6bc6edd2c98905b405ff_pov_tru_ab_hist.pdf",
      "content": "April 7th, 2004\n\nTelling the Truth About History\n\nI quite enjoyed the book Telling the Truth About History. The content of the book\nwas quite interesting and enjoyable to read, but more importantly, the book inspired me\nto think more about what I think of history. After reading the book, I sat for a while\nthinking about my thoughts on history. A couple of sections that I identified with came\nfrom the chapter on \"Competing Histories of America.\" The first quote that I found to be\nquite interesting, and mirrors some of my own thinking was Historians fashion the\nnation's collective self-understanding. I believe that this statement has a great deal of\ntruth to it, which is one reason for my desire to be a history teacher. There is a possibility\nthat this is simply something that historians think to make themselves feel important, but\nI feel that historians do play a large part in how people view their country, they certainly\nhave shaped how I feel about it.\n\nAnother statement that came from the same chapter was a quote \"'Tis all in\npieces, all coherence is lost.\" This statement is quite similar to part of the discussion\nfrom last week when we were talking about Plato to NATO versus specialization. I find\nthat sometimes in my history classes, so much of the time is focused on specialization,\nthat the big picture gets lost along the way. There is no doubt that specialization allows a\nhistorian to see what people were like, what an average person's life was like. To me,\nthough, this information is useless as history if I do not have a very good understanding\nof the times in general, and the big events. If all I want to know are the details, then I am\na sociologist, because if I don't have a clear view of the big picture, what I'm studying\ncould very well be happening now, not in the past. Another part of the book that has\n\nbeen a recurring topic in our class is whether things are relative to a certain time, like\npain. This is very similar to Herder's argument that each culture and every historical\nepoch has to be understood on its own terms.\nThe last part that I found interesting, and had to mention was the little bit about\nLeopold von Ranke. I found it interesting that at the University level, history is taught in\nthe same fashion as in the 1830's. Ranke invented the \"seminar\" in which students were\ntaught how to read and dissect historical documents. To me, that sounds very much like\nthis class."
    }
  ]
}