{
  "course_name": "Sensing Place: Photography as Inquiry",
  "course_description": "This course explores photography as a disciplined way of seeing or investigating urban landscapes, and expressing ideas. Readings, observations, and photographs form the basis of discussions on light, detail, place, poetics, narrative, and how photography can inform design and planning.\nThe current version of the class website for the course can be found here: Sensing Place: Photography as Inquiry.",
  "topics": [
    "Fine Arts",
    "Architecture",
    "Environmental Design",
    "Visual Arts",
    "Photography",
    "Social Science",
    "Urban Studies",
    "Urban Planning",
    "Fine Arts",
    "Architecture",
    "Environmental Design",
    "Visual Arts",
    "Photography",
    "Social Science",
    "Urban Studies",
    "Urban Planning"
  ],
  "syllabus_content": "Course Meeting Times\n\nSessions: 1 session / week, 4 hours / session\n\nLabs: 1 session / week, 1 hour / session\n\nCourse Overview\n\nThis course explores photography as a disciplined way of seeing, exploring landscapes, and expressing ideas. Readings, observations, and photographs will form the basis of discussions on landscape, light, significant detail, place, poetics, narrative, and how photography can inform design and planning, among other issues.\n\nStudents keep a journal of writings and images throughout the semester and develop a portfolio of photographs that explore the qualities of a particular place, sequenced as a web of narratives. Each student selects a site for the focus of their work in the course. The place may be anywhere in the Boston region--urban, suburban, or rural; it may be a studio site or place studied in another course. Work is in color slide film or digital format. Images are projected for class discussion and posted in an online gallery designed and maintained by each student. Late projects will receive a reduction in grade, and there will be no extensions without prior written consent.\n\nStudents must have a rudimentary understanding of photography and have access to a camera. Although this is not a lab course, the course includes an introduction to digital printing and its potential for adjusting contrast, hue, saturation, and other qualities. Prior experience with Adobe\n(r)\nPhotoshop\n(r)\nand web authoring is recommended, but not required.\n\nClass sessions are held regularly with occasional lab sessions. Reviews of assignments last for the full class period, and students are required to attend the entire review and to participate in the discussion of other students' work.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nClass Attendance and Discussions\n\n20%\n\nWeekly Journal (submitted via email)\n\n20%\n\nThree Shooting Assignments (due in class)\n\n30%\n\nFinal Photo Essay (posted online)\n\n30%",
  "files": [
    {
      "category": "Resource",
      "title": "Further Readings for 11.309J / 4.215J, Fall 2012",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-309j-sensing-place-photography-as-inquiry-fall-2012/0345168ea487222ad3ad1c430c573cc6_MIT11_309JF12_furtherreads.pdf",
      "content": "Further Readings for 11.309J / 4.215J, Fall 2012\nReading and Telling Landscape\nAdams, Robert. Beauty in Photography: Essays in Defense of Traditional Values. Aperture, 1981.\nBerger, John, and Jean Mohr. Another Way of Telling. Pantheon, 1982.\nClay, Grady. Close Up: How to Read the American City. University of Chicago Press, 1973.\nCollier, John, Jr., and Malcolm Collier. Visual Anthropology: Photography as a Research Method.\nUniversity of New Mexico Press, 1986.\nCosgrove, Denis, and Stephen Daniels, eds. The Iconography of Landscape: Essays on the Symbolic\nRepresentation, Design and Use of Past Environments. Cambridge University Press, 1988.\nCronon, William. \"A Place for Stories: Nature, History, and Narrative.\" Journal of American History 78,\nno. 4 (March 1992).\nElkins, James. How to Use Your Eyes. Routledge, 2000.\nLange, Dorothea. American Country Woman. Amon Carter Museum, 1967.\nLange, Dorothea, and Paul S. Taylor. An American Exodus: A Record of Human Erosion. Yale University\nPress, 1969.\nMeinig, D. W., ed. The Interpretation of Ordinary Landscapes. Oxford, 1979.\nPotteiger, Matthew, and Jamie Purinton. Landscape Narratives: Design Practices for Telling Stories.\nWiley, 1998.\nTuan, Yi-Fu. Topophilia: A Study of Environmental Perception. Prentice-Hall, 1974.\n\n------. Space and Place: The Perspective of Experience. University of Minnesota Press, 1977.\nWatts, May Theilgaard. Reading the Landscape of America. Collier, 1975.\n\nFurther Readings for 11.309J / 4.215J, Fall 2012\nLights of Day, in Season, in Place\nAdcock, Craig, and James Turrell. The Art of Light and Space. University of California Press, 1990.\nAlbers, Josef. Interaction of Color. Yale, 1963.\nCallahan, Harry. New Color: Photographs 1978-1987. Hallmark, 1988.\nFreeman, Michael. Light: Working with Available and Photographic Lighting. Amphoto, 1988.\nGage, John. Color and Culture: Practice and Meaning from Antiquity to Abstraction. University of\nCalifornia Press, 1993.\n\n------. Color and Meaning: Art, Science, and Symbolism. University of California Press, 1999.\nItten, Johannes. The Elements of Color. Van Nostrand Reinhold, 1970.\nLynch, David K., and William Livingston. Color and Light in Nature. Cambridge, 1995.\nMeyerowitz, Joel. Cape Light: Color Photographs. Boston Museum of Fine Arts, 1985.\n------. Aftermath: World Trade Center Archive. Phaidon Press, 2006.\n------. Bay/Sky. Bulfinch Press, 1993.\n------. St. Louis and the Arch. Little Brown, 1980.\nMinnaert, M. G. J. Light and Color in the Outdoors. Springer-Verlag, 1974.\nMisrach, Richard. The Sky Book. Arena, 2000.\nRossing, Thomas, and Christopher Chiaverina. Light Science: Physics and the Visual Arts. Springer, 1999.\nSmith, Eugene W., and Aileen M. Smith. Minamata. Holt, Rinehart, and Winston, 1975.\nStoraro, Vittorio. Writing with Light. Volume 1: The Light. Aperture, 2003.\nSwirnoff, Lois. Color of Cities: An International Perspective. McGraw-Hill, 2000.\nWhite, Minor. Light7: Photographs from an Exhibition on a Theme. MIT Press, 1968.\n\nFurther Readings for 11.309J / 4.215J, Fall 2012\nSignificant Detail\nAbell, Sam. The Life of a Photograph. National Geographic, 2008.\nAdams, Ansel. Examples: The Making of 40 Photographs. Little Brown, 1983.\nAdams, Robert. The New West. Colorado Associated University Press, 1974.\n- - -. From the Missouri West. Aperture, 1980.\nAgee, James, and Walker Evans. Let Us Now Praise Famous Men. Houghton-Mifflin, 1941.\nAlexander, Christopher, Sara Ishikawa, Murray Silverstein, et al. A Pattern Language: Towns, Buildings,\nConstruction. Oxford University Press, 1977.\nAppleton, Jay. The Experience of Landscape. Wiley, 1975.\nArnheim, Rudolf. \"Order and Complexity in Landscape Design.\" In Toward a Psychology of Art. University\nof California Press, 1966.\n------. Visual Thinking. University of California Press, 1969.\nBalmori, Diana, and Margaret Morton. Transitory Gardens, Uprooted Lives. Yale University Press, 1993.\nBaltz, Lewis. Park City. Artspace Press, 1980.\nBerger, John, and Jean Mohr. Another Way of Telling. Pantheon, 1995.\nCaponigro, Paul. Paul Caponigro. Aperture, 1967.\n- - -. Landscape: Photographs. McGraw-Hill, 1975.\n------. Wise Silence. Little Brown, 1983.\nCartier-Bresson, Henri. City and Landscapes. Bullfinch, 2001.\n------. The Mind's Eye: Writings on Photographs and Photographers. Aperture, 1999.\n------. The Europeans. Little Brown, 1998.\nClay, Grady. Close Up: How to Read the American City. University of Chicago Press, 1973.\n\nFurther Readings for 11.309J / 4.215J, Fall 2012\nCorner, James, and Alex S. MacLean. Taking Measures Across the American Landscape. Yale University\nPress, 1996.\nDavidson, Bruce. East 100th Street. Harvard University Press, 1970.\nDoisneau, Robert, and Blaise Cendrars, La Banlieue de Paris. Pierre Seghers, 1949.\nEvans, Walker. American Photographs. Doubleday, 1938.\nEvans, Terry. Prairie: Images of Ground and Sky. Kansas, 1986.\nFrank, Robert. The Americans. Grossman, 1969.\nFriedlander, Lee. Factory Valleys: Ohio and Pennsylvania. Callaway, 1982.\nFuchs, R.H. Richard Long. Thames and Hudson, 1986.\nGoldsworthy, Andy. A Collaboration with Nature. Abrams, 1990.\nHayden, Dolores. The Power of Place: Urban Landscape as Public History. MIT Press, 1995.\nHeaney, Seamus. \"The Sense of Place.\" In Preoccupations. Farrar, Straus and Giroux, 1980, pp. 131-149.\nHood, Walter. Urban Diaries. Spacemaker, 1997.\nHorn, Roni. To Place. (Multiple volumes on Iceland published by various presses, 1990-2001.)\nHoskins, W.G. The Making of the English Landscape. Penguin, 1970.\nJackson, J. B. The Essential Landscape: The New Mexico Photographic Survey. University of New Mexico\nPress, 1985.\nKenna, Michael, and Eric T. Haskell. Le Notre's Gardens. RAM Publications, 1997.\nKlett, Mark. Revealing Territory: Photographs of the Southwest. University of New Mexico Press, 1992.\nKlett, Mark, Rebecca Solnit, and Byron White. Yosemite in Time. Trinity University Press, 1992.Lynch,\nKevin. Image of the City. MIT Press, 1960.\nLambert, Phyllis. Viewing Olmsted: Photographs by Robert Burley, Lee Friedlander, and Geoffrey James.\nMIT Press, 1996.\nLynch, Kevin. What Time Is This Place? MIT Press, 1972.\n\nFurther Readings for 11.309J / 4.215J, Fall 2012\nMeyerowitz, Joel. Foreword in Creating a Sense of Place. Smithsonian Institution Press, 1990.\n- --. St. Louis and the Arch. Little Brown, 1985\nMorris, Wright. The Inhabitants. Scribner's, 1946.\nMorrison, Philip, and Phylis, Morrison, and the Office of Charles and Ray Eames. Powers of Ten. Scientific\nAmerican, 1982.\nOwens, Bill. Suburbia. Straight Arrow Books, 1973.\nSiskind, Aaron. Harlem Photographs 1932-1940. Smithsonian, 1990.\nSmithson, Robert. Photo Works. Los Angeles County Museum of Art, 1993.\nSoth, Alex. Niagara. Steidl, 2006.\nStrand, Paul, and Basil Davidson. Tir a Mhurain: Outer Hebrides. MacGibbon and Kee, 1962.\nStrand, Paul, and Claude Roy. La France de Profil (A Profile for France). La Guilde du Livre, 1952.\nStrand, Paul, and Nancy Newhall. Time in New England. Oxford University Press, 1950.\nSzarkowski, John. Looking at Photographs: 100 Pictures from the Collection of The Museum of Modern\nArt. Museum of Modern Art, 1973.\nThomas, Ann, ed. Beauty of Another Order: Photography in Science. Yale University Press, 1997.\nVanderbilt, Paul. Between the Landscape and Its Other. Johns Hopkins University Press, 1993.\nWard, Alan. American Designed Landscapes. Spacemaker, 1998.\nWatts, May Theilgaard. Reading the Landscape of America. Collier, 1975.\nWelty, Eudora. One Time, One Place: Mississippi in the Depression. University Press of Mississippi, 1996.\nWesterbeck, Colin, and Joel Meyerowitz. Bystander: A History of Street Photography. Bullfinch, 1994.\n\nFurther Readings for 11.309J / 4.215J, Fall 2012\nLandscapes Poetics\nBourassa, Steven. The Aesthetics of Landscape. Belhaven, 1991.\nBye, A.E. Art into Landscape; Landscape into Art. PDA, 1983.\nCaponigro, Paul. Sunflower. Filmhaus, 1974.Dewey, John. Art as Experience. Capricorn, 1958.\nFowles, John, and Frank Horvath. The Tree. Little Brown, 1979.\nJussim, Estelle, and Elizabeth Lindquist-Cock. Landscape as Photograph. Yale University Press, 1985.\nLakoff, George, and Mark Johnson. Metaphors We Live By. University of Chicago Press, 1980.\nSzarkowski, John. Looking at Photographs: 100 Pictures from the Collection of The Museum of Modern\nArt. Museum of Modern Art, 1973.\nVanderbilt, Paul. Between the Landscape and Its Other. Johns Hopkins University Press, 1993.\nWhite, Minor. Mirrors Messages Manifestation. Aperture, 1969.\n\nFurther Readings for 11.309J / 4.215J, Fall 2012\nLandscape Narratives\nCronon, William. \"A Place for Stories: Nature, History, and Narrative.\" Journal of American History 78,\nno. 4 (March 1992).\nDouglas, Helen. Unravelling the Ripple. Morningstar, 2001.\nGroebli, Rene. Magie der Schiene (The Magic of the Tracks). Kubus Verlag, 1949.\nGossage, John. The Pond. Aperture, 1985.\nHayden, Dolores. The Power of Place: Urban Landscape as Public History. MIT Press, 1995.\nHolleley, Douglas. Photo-Editing and Presentation. Clarellen, 2009.\nHosoe, Eikoh. Kamaitachi. Gendaischicho-sha, 1969.\nLange, Dorothea. American Country Woman. Amon Carter Museum, 1967.\nMorris, Wright. Time Pieces: Photographs, Writing, and Memory. Aperture, 1989.\nMorrison, Philip, and Phylis, Morrison, and the Office of Charles and Ray Eames. Powers of Ten. Scientific\nAmerican, 1982.\nPotteiger, Matthew, and Jamie Purinton, Landscape Narratives: Design Practices for Telling Stories.\nWiley, 1998.\nSmith, Kevin. Structure of the Visual Book. Visual Studies Workshop, 1984.\nTucker, Anne Wilkes, ed. Target III: In Sequence. Houston Museum of Fine Arts, 1982.\nVanderbilt, Paul. Between the Landscape and Its Other. Johns Hopkins University Press, 1993.\nWatts, May Theilgaard. Reading the Landscape of America. Collier, 1975.\nWeifenbach, Terri. In Your Dreams. Nazraeli, 1997.\nWhite, Minor. Mirrors Messages Manifestation. Aperture, 1969.\n\nFurther Readings for 11.309J / 4.215J, Fall 2012\nStorytelling: Words and Images\nAgee, James, and Walker Evans. Let Us Now Praise Famous Men. Houghton-Mifflin, 1941.\nBerger, John, and Jean Mohr. Another Way of Telling. Pantheon, 1982.\nFowles, John, and Frank Horvath. The Tree. Little Brown, 1979.\nHorn, Roni. To Place. (Multiple volumes on Iceland published by various presses, 1990-2001.)\nMorris, Wright. Time Pieces: Photographs, Writing, and Memory. Aperture, 1989\nSommer, Frederick. Words and Images. Center for Creative Photography, 1984.\n- - -. \"1939-1962 Photographs.\" In Aperture 10, no. 4 (1962).\nStrand, Paul, and Claude Roy. La France de Profil (A Profile of France). La Guilde du Livre, 1952.\nWelty, Eudora. One Time, One Place: Mississippi in the Depression. University Press of Mississippi, 1996.\n\nFurther Readings for 11.309J / 4.215J, Fall 2012\nPhotography as Inquiry\nBanks, Marcus, and Howard Morphy, eds. Rethinking Visual Anthropology. Yale University Press, 1997.\nBecker, Howard S. Exploring Society Photographically. Mary and Leigh Block Gallery, Northwestern\nUniversity, 1981.\n- - -. \"Photography and Sociology.\" In Doing Things Together. Northwestern University Press, 1986.\nCollier, John, Jr., and Malcolm Collier. Visual Anthropology: Photography as a Research Method.\nUniversity of New Mexico Press, 1986.\nElkins, James, ed. Artists with PhDs. New Academia, 2009.\nFrost, Robert. \"The Figure a Poem Makes.\" In Collected Poems of Robert Frost. Holt, 1939.\nJanis, Eugenia Parry, and Wendy MacNeil, eds. Photography within the Humanities. Addison House,\n1977.\nKnowles, Caroline, and Paul Sweetman, eds. Picturing the Social Landscape: Visual Methods in the\nSociological Imagination. Routledge, 2004.\nMacleod, Katy, and Lin Holdridge, eds. Thinking Through Art: Reflections on Art as Research. Routledge,\n2010.\nPink, Sarah. Doing Visual Ethnography. Sage, 2007.\nPink, Sarah, Laszlo Kurti, and Ana Isabel Afonso, eds. Working Images: Visual Representation in\nEthnography. Routledge, 2004.\nProsser, Jon, ed. Image-based Research. Routledge, 1998.\nRose, Gillian. \"Making Photographs as Part of a Research Project.\" In Visual Methodologies. Sage, 2007.\nThomas, Ann, ed. Beauty of Another Order: Photography in Science. Yale University Press, 1997.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n11.309J / 4.215J Sensing Place: Photography as Inquiry\nFall 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Recommended Reading List for 11.309J / 4.215J, Fall 2012",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-309j-sensing-place-photography-as-inquiry-fall-2012/641438f6297d5f5890a090096501651d_MIT11_309JF12_recomndreads.pdf",
      "content": "Recommended Reading List for 11.309J / 4.215J, Fall 2012\nThis following list of books and essays provides a mere glimpse into an enormous literature on\nphotography and on the landscape of place. You should browse through these and augment them with\nyour own list of readings and photographers.\nAbell, Sam. The Life of a Photograph. Washington, DC: National Geographic, 2008.\nAdams, Ansel. Examples: The Making of 40 Photographs. Boston: Little, Brown, 1983.\nAdams, Ansel. Ansel Adams in Color. Edited by Harry Callahan. Boston, MA: Little Brown, 1993.\nAdams, Robert. The New West. Boulder: Colorado Associated University Press, 1974.\n-----. Beauty in Photography. Millerton, NY: Aperture, 1981.\n-----. Listening to the River. Millerton, NY: Aperture, 1994.\nAdcock, Craig. James Turrell: The Art of Light and Space. Berkeley, CA: University of California Press,\n1990.\nAgee, James, and Walker Evans. Let Us Now Praise Famous Men. Boston: Houghton-Mifflin, 1941.\nAlexander, Christopher. Sara Ishikawa, and Murray Silverstein. A Pattern Language: Towns, Buildings,\nConstruction. New York: Oxford University Press, 1977.\nAppleton, Jay. The Experience of Landscape. London: John Wiley and Sons, 1975.\nArnheim, Rudolf. \"Order and Complexity in Landscape Design.\" In Toward a Psychology of Art, 123-35.\nBerkeley, CA: University of California Press, 1966.\n------. Visual Thinking. Berkeley, CA: University of California Press, 1969.\nBalmori, Diana, and Morton, Margaret. Transitory Gardens, Uprooted Lives. New Haven: Yale University\nPress, 1993.\nBaltz, Lewis. Park City. Albuquerque: Artspace Press, 1980.\nBarthes, Roland. Camera Lucida. New York: Hill and Wang, 1975.\nBeahan, Virginia, and McPhee, Laura. No Ordinary Land: Encounters in a Changing Landscape. New York:\nAperture, 1998.\nBerger, John. Ways of Seeing. London: Penguin Books, 1977.\n------. About Looking. New York: Pantheon Books, 1980.\n------. Sense of Sight. New York: Random House, 1985.\n\nRecommended Reading List for 11.309J / 4.215J, Fall 2012\n------, and Mohr, Jean. Another Way of Telling. New York: Pantheon, 1982.\nBlatner, David, and Conrad Chavez. Real World Photoshop CS4. Berkeley, CA: Peachpit Press, 2008.\nBourassa, Steven C. The Aesthetics of Landscape. London: Belhaven Press, 1991.\nBrassai. Paris by Night. New York: Pantheon, 1987; original edition, 1933.\nBrown, Julia, ed. Occluded Front: James Turrell. Larkspur Landing, CA: Lapis Press, 1985.\nBye, A.E. Art into Landscape; Landscape into Art. Mesa, AZ: PDA Publishers, 1983.\nGreenough, Sarah. Harry Callahan. Washington: National Gallery of Art, 1996.\nCaponigro, Paul. Paul Caponigro. New York: Aperture, 1967.\n------. Landscape. New York: McGraw Hill, 1975.\n------. Meditations in Light. Morris Press.\n------. Sunflower. New York: Filmhaus, 1974.\nCaponigro, John Paul. Adobe Photoshop Masterclass. San Francisco: Peachpit Press, 2000.\nCartier-Bresson, Henri. The Decisive Moment . New York: Simon and Schuster, 1952.\n-----. The Mind's Eye: Writings on Photographs and Photographers. New York: Aperture, 1999.\n------. City and Landscapes. Bullfinch Press, 2001.\n------. The Europeans. Boston: Little, Brown, 1998.\nClark, Kenneth. Landscape into Art. New York: Harper and Row, 1979.\nClay, Grady. Close Up: How to Read the American City. Chicago, IL: University of Chicago Press, 1973.\nCollier, John Jr., and Malcolm Collier. Visual Anthropology: Photography as a Research Method.\nAlbuquerque, NM: University of New Mexico Press, 1986.\nCorner, James, and Alex S. MacLean. Taking Measures Across the American Landscape. New Haven, CT:\nYale University Press, 1996.\nCosgrove, Denis and Stephen Daniels eds. The Iconography of Landscape. Cambridge: Cambridge\nUniversity Press, 1988.\nCronon, William. \"A Place for Stories: Nature, History, and Narrative.\" Journal of American History 78:4\n(March 1992).\n\nRecommended Reading List for 11.309J / 4.215J, Fall 2012\nDavidson, Bruce. East 100th Street Cambridge: Harvard University Press, 1970.\nDeCarava, Roy, and Langston Hughes. The Sweet Flypaper of Life New York: Hill and Wang, 1967, original\nedition 1955.\nDoisneau, Robert, and Blaise Cendrars. La Banlieue de Paris. Paris: Pierre Seghers, 1949.\nDouglas, Helen.Unravelling the Ripple. Edinburgh: Morningstar, 2001.\nEggleston, William.William Eggleston's Guide. New York: MOMA, 1976.\nEvans, Terry. Prairie: Images of Ground and Sky. Lawrence: University of Kansas Press, 1986.\nEvans, Walker. American Photographs. Garden City, NY: Doubleday, 1938.\nFowles, John, and Horvath, Frank. The Tree. Boston: Little and Brown, 1979.\nFrank Robert. The Americans. New York: Grossman, 1969.\nFraser, Bruce. Real World Color management. Peachpit Press, 2004.\nFreeman, Michael. Light. Amphoto Photography Workshop Series. New York: Amphoto, 1988.\nFriedlander, Lee. Factory Valleys. New York: Callaway, 1982.\nFuchs, R.H. Richard Long. New York: Thames and Hudson, 1986.\nGerster, Georg. Below from Above. New York: Abbeville, 1986.\nGoldsworthy, Andy. A Collaboration with Nature. New York: Harry N. Abrams, 1990.\nGossage, John. The Pond. Millerton, NY: Aperture, 1985.\nGroebli, Rene. Magie der Schiene. Zurich: Kubus Verlag, 1949. The Magic of the Tracks.\nHayden, Dolores. The Power of Place: Urban Landscape as Public History. Cambridge, MA: MIT Press,\n1995.\nHeaney, Seamus. \"The Sense of Place.\" In Preoccupations: Selected Prose 1968-1978. New York: Farrar,\nStraus, Giroux, 1980.\n------. Sweeney's Flight, with photographs by Rachel Giese. New York: Farrar Straus Giroux, 1992.\nHockney, David. Hockney on Photography. New York: Harmony Books, 1988.\nHood, Walter. Urban Diaries. Washington, DC: Spacemaker Press, 1997.\n\nRecommended Reading List for 11.309J / 4.215J, Fall 2012\nHorn, Roni. To Place(multiple volumes on Iceland published by various presses, 1990-2001).\n------. Another Water (The River Thames, for example). Steidl, 2000.\nHoskins, W.G. The Making of the English Landscape. Baltimore, MD: Penguin Books, 1970.\nHosoe, Eikoh. Kamaitachi. Tokyo: Gendaischicho-sha, 1969.\nJackson, John Brinckerhoff. The Essential Landscape: The New Mexico Photographic Survey.\nAlbuquerque, NM: University of New Mexico Press, 1985.\n------. Discovering the Vernacular Landscape. New Haven, CT: Yale University Press, 1984.\n------. A Sense of Place, A Sense of Time. New Haven, CT: Yale University Press, 1994.\n------. Landscape in Sight: Looking at America. New Haven, CT: Yale University Press, 1997.\nJussim, Estelle, and Elizabeth Lindquist-Cock. Landscape as Photograph. New Haven: Yale University\nPress, 1985.\nKepes, Gyorgy. Language of Vision. Chicago, IL: Paul Theobald, 1944.\nKlett, Mark, Rebecca Solnit, and Byron White. Yosemite in Time. San Antonio: Trinity University Press,\n1992.\nKlett, Mark. Revealing Territory: Photographs of the Southwest. Albuquerque: University of New Mexico\nPress, 1992.\nLange, Dorothea. Dorothea Lange Looks at the American Country Woman. Fort Worth, TX: Amon Carter\nMuseum, 1967.\n------, and Taylor, Paul S. American Exodus. New York: Reynal & Hitchcock, 1939.\n------, and Taylor, Paul S. American Exodus. New Haven: Yale University Press, 1969.\nLevi-Strauss, Claude. Saudades do Brasil: A Photographic Memoir. University of Washington Press, 1995.\nLynch, David K., and Livingston, William. Color and Light in Nature. Cambridge: Cambridge University\nPress, 1995.\nLynch, Kevin. Image of the City. Boston, MA: MIT Press, 1960.\n------. What Time Is This Place? Cambridge, MA: MIT Press, 1972.\nLyons, Nathan. Notations in Passing. Cambridge, MA: MIT Press, 1974.\nMacLean, Alex. Designs on the Land: Exploring America from the Air (Thames and Hudson, 2003)\n\nRecommended Reading List for 11.309J / 4.215J, Fall 2012\nMaynard, Patrick. Thinking through Photography. Ithaca: Cornell University Press, 1997.\nMeinig, D.W., ed. The Interpretation of Ordinary Landscapes. New York: Oxford University Press, 1979.\nMeiselas, Susan. Nicaragua: June 1978-July 1979 (Aperture, 1981).\nMeyerowitz, Joel. Cape Light. Boston: Museum of Fine Arts, 1985.\n------. St. Louis and the Arch. Boston: Little, Brown (New York Graphic Society), 1980.\n------. La natura delle citta. Motta Editore, 1994.\nMinnaert, M. G. J. Light and Color in the Outdoors. New York: Springer-Verlag, 1974.\nMisrach, Richard. Golden Gate . New York: Aperture Foundation, 2004.\nMitchell, William J. The Reconfigured Eye: Visual Truth in the Post-Photographic Era. (Cambridge, MA:\nMIT Press, 1992.\nMorris, Wright. Time Pieces: Photographs, Writing, and Memory. New York: Aperture, 1989.\n------. The Inhabitants. New York: Scribner's, 1946.\nMorrison, Philip, Morrison, Phylis, and the Office of Charles and Ray Eames. Powers of Ten. New York:\nScientific American Books, 1982.\nOwens, Bill. Suburbia. San Francisco: Straight Arrow Books, 1973.\nPfahl, John. A Distanced Land. Albuquerque: University of New Mexico Press, 1990.\nPotteiger, Matthew, and Jamie Purinton. Landscape Narratives: Design Practices for Telling Stories. New\nYork: John Wiley, 1998.\nRowell, Galen. Mountain Light. Sierra Club, 1986.\nShore, Stephen. Uncommon Places. Millerton, NY: Aperture, 1982.\nSiskind, Aaron. Harlem Photographs 1932-1940. Introduction by Gordon Parks. Washington, DC:\nSmithsonian, 1990.\nSmith, Eugene W., and Aileen M. Smith. Minamata. (New York: Holt, Rinehart, and Winston, 1975.\nSmith, Kevin. Structure of the Visual Book. Rochester, NY: Visual Studies Workshop, 1984.\nSmithson, Robert. Photo Works. Albuquerque: University of New Mexico Press, 1993.\nSommer, Frederick. \"1939-1962 Photographs,\" Aperture 10:4 (1962).\n\nRecommended Reading List for 11.309J / 4.215J, Fall 2012\nSoth, Alec. Sleeping by the Mississippi. Steidl, 2004.\n------. Niagara. Steidl, 2006.\nSpirn, Anne Whiston. The Language of Landscape. New Haven: Yale University Press, 1998.\n------. Daring to Look: Dorothea Lange's Photographs and Reports from the Field. Chicago: University of\nChicago Press, 2008.\nSternfeld, Joel. American Prospects. New York: Times Books, 1987.\nStoraro, Vittorio. Writing with Light. Part One: The Light. Millerton, NY: Aperture, 2003.\nStrand, Paul, and Nancy Newhall. Time in New England. Millerton, NY: 1980; original edition, 1950.\n------, and Claude Roy. La France de Profil. Lausanne: La Guilde du Livre, 1952. A Profile of France.\n------, and Basil Davidson. Tir a Mhurain: Outer Hebrides. London: MacGibbon and Kee, 1962.\nSwirnoff, Lois. The Color of Cities. New York: McGraw-Hill, 2000.\nSzarkowski, John. Looking at Photographs. New York: Museum of Modern Art, 1973.\n------. American Landscapes. New York: Museum of Modern Art, 1981.\n------. Atget. New York: Museum of Modern Art, 2000.\nThomas, Ann, ed. Beauty of Another Order: Photography in Science. New Haven: Yale University Press,\n1997.\nTice, George. Paterson. New Brunswick: Rutgers University Press, 1972.\nTrager, Philip. Changing Paris. Arena, 2000.\nTuan, Yi-Fu. Topophilia. Englewood Cliffs, NJ: Prentice-Hall, 1974.\n------. Space and Place. Minneapolis, MN: University of Minnesota Press, 1977.\nVanderbilt, Paul. Between the Landscape and Its Other. Baltimore: Johns Hopkins, 1993.\nVergara, Camilo Jose. The New American Ghetto. New Brunswick, NJ: Rutgers University Press, 1995.\nVergara, Camilo Jose. American Ruins. New York: Monacelli Press, 1999.\nViewing Olmsted: Photographs by Robert Burley, Lee Friedlander, and Geoffrey James. Cambridge, MA:\nMIT Press, 1996.\n\nRecommended Reading List for 11.309J / 4.215J, Fall 2012\nWard, Alan. American Designed Landscapes. Washington, DC: Spacemaker Press, 1998.\nWeifenbach, Terri. In Your Dreams. Portland, OR: Nazraeli, 1997.\nWelty, Eudora. One Time One Place: Mississippi in the Depression. University Press of Mississippi, 1996\n(reprint).\nWesterbeck, Colin, and Joel Meyerowitz. Bystander: A History of Street Photography. Boston: Little,\nBrown, 1994.\nWhite, Minor. Mirrors Messages Manifestation. New York: Aperture, 1969.\n------. Light 7: Photographs from an Exhibition on a Theme. Cambridge, MA: MIT Press, 1968.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n11.309J / 4.215J Sensing Place: Photography as Inquiry\nFall 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}