{
  "course_name": "Sexual and Gender Identities in the Modern United States",
  "course_description": "This course provides an introduction to the history of gender, sex, and sexuality in the modern United States, from the end of the 19th century to the present. It surveys historical approaches to the field, emphasizing the changing nature of sexual and gender identities over time. It traces attempts to control, construct, and contain sexual and gender identities. In addition, it also examines the efforts of those who worked to resist, reject, and reform institutionalized heterosexuality and mainstream configurations of gendered power.",
  "topics": [
    "Humanities",
    "History",
    "Society",
    "Gender Studies",
    "Women's Studies",
    "Humanities",
    "History",
    "Society",
    "Gender Studies",
    "Women's Studies"
  ],
  "syllabus_content": "Course Meeting Times\n\nSeminars: 1 session / week, 3 hours / session\n\nPrerequisites\n\nThere are no prerequisites for this course.\n\nCourse Description\n\nThis subject offers an introduction to the history of gender, sex, and sexuality in the modern United States, focusing on the period spanning from the end of the nineteenth century to the beginning of the twenty-first. It begins with an overview of historical approaches to the field, emphasizing the changing nature of sexual and gender identities over time. The remainder of the course flows chronologically, tracing the expanding and contracting nature of attempts to control, construct, and contain sexual and gender identities--and the efforts of those who worked to resist, reject, and reimagine the meanings and lived experiences of sex, sexuality, and gender.\n\nRequired Texts\n\nAll required readings for the course can be found in the\nReadings and Films\nsection.\n\nGraded Assignments\n\nThis subject is conducted as a discussion-based seminar. Students should complete all assigned reading, and view any assigned films, before our class meets each week. Each student's course participation grade is calculated according to the following formula: active and engaged participation during class sessions (20% of overall course grade); weekly participation on the course discussion forum (10% of overall course grade).\n\nStudents write two one-page response papers over the course of the term. (Students may choose which weeks to do so, but must submit at least one response paper by Session 6.) These responses should provide thoughtful analysis of weekly assigned materials and are due by 5 p.m. on the day class meets. More information about response papers will be provided at the start of the term.\n\nIn addition to these brief response papers, each student (as a part of a group) will be responsible for launching and moderating one weekly forum discussion, writing one short (1,000-1,500 word) paper, and producing one final paper or project. There will be no midterm or final exam in this course.\n\nFurther information on papers and projects can be found in the\nAssignments\nsection.\n\nGrading Policy\n\nACTIVITIES\n\nPERCENTAGES\n\nCourse Participation\n\nIn-class participation (20%)\n\nWeekly forum participation (10%)\n\n30%\n\nResponse Papers\n\nResponse 1 (5%)\n\nResponse 2 (5%)\n\n10%\n\nDiscussion Forum Moderation\n\n15%\n\nShort Paper\n\n20%\n\nFinal Project/Paper\n\n25%\n\nResources and Policies\n\nAttendance and Participatio\nn\n\nAttendance for this subject is mandatory except in cases of illness, religious observance, or personal or familial emergencies. Absences from class will be handled on a case-by-case basis. If you have questions regarding attendance or think you will need to miss class for any reason, please contact me as far in advance as possible. The participation grade, worth 30% of the total grade for the course, is based on student contributions to conversations both in class and on the course discussion forum. To receive full credit for in-class participation, students should arrive on time, having completed all assigned materials, and having prepared to discuss them. To receive full credit for participation on the course discussion forum, students should post at least one thoughtful comment a week.\n\nNote on Content\n\nOver the course of the semester we will discuss events and concepts that may be disturbing or traumatizing to some students. Please read the syllabus closely before the start of the term. If you suspect that specific material is likely to cause distress, I will be happy to discuss any concerns you may have before the topic comes up in class.\n\nCheating and Plagiarism\n\nMIT has strict policies concerning plagiarism. In academic writing, it is considered plagiarism to use any idea or any language from someone else without adequately crediting that source. It doesn't matter if the source is a published author, a website without clear authorship, a generative AI, or another student. Taking credit for work that is not one's own is unacceptable in all academic situations, whether you do it intentionally or by accident. Many cases of plagiarism are not intentional, and instead arise out of confusion concerning what counts as plagiarism and how to avoid it. To protect yourself from accidentally becoming a plagiarist, and to learn more about what constitutes plagiarism, visit\nAcademic Integrity at MIT: A Handbook for Students\nor contact me directly.\n\nWriting Assistance\n\nThe\nWriting and Communication Center (WCC)\noffers free professional advice from lecturers who are published writers and experienced teachers. The WCC offers help with all forms of academic, creative, and professional writing--including papers, applications, and theses. They also offer oral presentation assistance and help with English as Second Language questions.\n\nCalendar\n\nUnit 1--Ebbs and Flows: Gender and Sexual Identities as Moving Targets\n\nWeek 1: First Day of Class\n\nWeek 2: Thinking Historically about Gender, Sex, and Sexuality\n\nWeek 3: Before the Modern Era: Race, Reproduction, Intimacy, Violence\n\nUnit 2--The Tempest: Contesting Sexual Order, c. 1900-1920\n\nWeek 4: Sex and the City: Working Class Sexuality and the Crusade against Vice\n\nWeek 5: The Birth of Feminism, Women's Suffrage, and the Politics of Reproduction\n\nUnit 3--Locks and Dams: Creating and Policing Boundaries, c. 1920-1960\n\nWeek 6: Regulating Sexuality and Gender through the Jazz Age, Depression, and War\n\nWeek 7: Creating, Containing, and Resisting \"Normal\" in Post-War America\n\nShort paper due\n\nUnit 4--The Flood: Breaking Barriers, c. 1960-1980\n\nWeek 8: Revolutions I: Civil Rights, the Pill, and the Emergence of Second Wave Feminism\n\nWeek 9: Revolutions II: Feminism as a Mass Movement and the Emergence of Gay Liberation\n\nIn-class screening:\n\nScreaming Queens: The Riot at Compton's Cafeteria\n.\nDirected by Victor Silverman and Susan Stryker. Color and black-and-white, 2005. 56 min.\n\nUnit 5--Changing Tides: Gender and Sexuality as Battlegrounds, c. 1980-2000\n\nWeek 10: The Religious Right and the AIDS Epidemic\n\nWeek 11: Law and Economy at Century's End\n\nUnit 6--Sexuality and Gender in the 21\nst\nCentury: Diverging Currents?\n\nWeek 12: New Trajectories in the Politics of Gender and Sexuality\n\nWeek 13: Last Day of Class\n\nFinal project due",
  "files": [
    {
      "category": "Resource",
      "title": "Readings and Films Guide Week 2: Thinking Historically about Gender, Sex, and Sexuality",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/wgs-110j-sexual-and-gender-identities-in-the-modern-united-states-spring-2024/mitwgs_110j_s24_readingguide02.pdf",
      "content": "Reading Guide Week 2\nThinking Historically about Gender, Sex, and Sexuality\nGender, sex, and sexuality are important areas of research for scholars across the humanities\nand social sciences, as well as many scientific fields, including medicine. Historians have\nplayed a crucial role in changing the way we understand these topics. The readings for this\nweek have been selected to introduce you to some of the ways historians approach and\nanalyze gender, sex, and sexuality, and also to help you begin thinking historically yourself.\nRequired Texts:\n- Nancy Cott, \"What is Gender History?\" Speech delivered at the American Historical\nAssociation Conference (January 2005) 1-5.\n- Jeffrey Weeks, \"The Social Construction of Sexuality,\" in Major Problems in the History\nof American Sexuality, Peiss, ed. (2002) 2-9.\n- John D'Emilio, \"Capitalism and Gay Identity\" in The Lesbian and Gay Studies Reader,\nAbelove et al eds. (1993) 467-476.\n- Jack Halberstam, \"Trans*: What's in a Name,\" in Trans* (2018) 1-21.\nQuestions to Consider:\nNancy Cott is a preeminent historian of gender and women's history. What distinctions does\nshe make in her short speech between the history of gender and the history of women?\nAccording to Cott, in what ways has thinking about gender contributed to and changed the\nway we understand US history? How might using the lens of gender help us understand other\nhistorical topics Cott doesn't mention?\nIn classic essays penned in the 1980s, both Weeks and D'Emilio argue that sexual identities\nare \"constructed\" under particular social and historical contexts. D'Emilio, for example, claims\nthat homosexuality and heterosexuality, as categories of identity, were \"invented\" only\nrecently. Do you find this argument compelling? Why or why not? What historical contexts or\nforces have shaped sexuality and sexual identities in the United States, according to these\nauthors?\nJack Halberstam is a professor of Gender Studies and English at Columbia University. In the\nfirst chapter of their book Trans* they address the question of language and naming as it\nrelates to trans identity and experience. In what ways do the terms we use to name and\nidentify sexual and gender identities matter? Halberstam also makes distinctions between\ntrans history and lesbian and gay history. How does trans history differ from LGB history or\nfrom the history of gender? What role does science and medicine play in trans history, for\nexample?\nBonus Questions:\nMany historians of gender, sex, and sexuality are activists as well as scholars. Consider as you\nread this week the ways in which history can contribute to social movements. Can simply\nwriting the history of lesbians, transpeople, or gender identities be considered a form of\nactivism? Why or why not?\n21H.108J/WGS.110J- Week 2\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\nWGS.110J / 21H.108J Sexual and Gender Identities in the Modern United States\nSpring 2024\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Readings and Films Guide Week 3: Before the Modern Era: Race, Reproduction, Love, and Intimacy",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/wgs-110j-sexual-and-gender-identities-in-the-modern-united-states-spring-2024/mitwgs_110j_s24_readingguide03.pdf",
      "content": "Reading Guide Week 3\nBefore the Modern Era: Race, Reproduction, Love, and Intimacy\nHuman life and experience were shaped by sex, sexuality, and gender long before the modern era. Though our\ncourse focuses on the modern period (beginning around 1900), it is useful to learn about what came before -- to\nconsider how the ideas and experiences of early Americans differed from, informed, and helped shape modern\nunderstandings of sexual and gender identities.\nThe readings for this week cover roughly 300 years of history. As this is much too long a period to cover with\nany depth during a single class period, we will focus our energies on specific themes historians identify as\nparticularly important to the history of gender and sexuality in early America: the bounded nature of sex and\nreproduction during the colonial era; the connections forged between race, slavery, and sexual coercion in\nantebellum America; and the blurring of lines distinguishing friendship, love, and intimacy in the Victorian era.\nRequired Texts\n-\nJohn D'Emilio and Estelle Freedman, \"The Reproductive Matrix, 1600-1800\" in Intimate Matters, Third\nEd. (2012) 3-52.\n-\nStephanie McCurry, \"Reconstructing Belonging: The Thirteenth Amendment at Work in the World,\" in\nIntimate States: Gender, Sexuality, and Governance in Modern US History, eds. Canaday, Cott, and Self (Chicago:\nUniversity of Chicago Press, 2021) 19-40.\n-\nCarroll Smith-Rosenberg, \"The Female World of Love and Ritual: Relations Between Women in\nNineteenth-Century America,\" Signs 1, no. 2 (Autumn 1975) 1-29.\n-\n\"Harriet Jacobs Relates Incidents in the Life of a Slave Girl, 1861,\" in Major Problems in the History of\nAmerican Sexuality, Peiss, ed. (2002) 147-152.\n-\n\"Baron Lahontan Describes Love and Marriage Among the Hurons, 1703,\" in Major Problems in the\nHistory of American Sexuality, Peiss, ed. (2002) 27-31.\n-\n\"John Lawson on Native American Women, North Carolina, 1709,\" in Documenting Intimate Matters:\nPrimary Sources for a History of Sexuality in America, Foster ed. (2012) 14-18.\n-\n\"Two-Spirit,\" Wisconsin Pride, PBS, June 1, 2023, 3m41s.\nQuestions to Consider\nJon D'Emilio and Estelle Freedman's groundbreaking 1988 book, Intimate Matters, was the first to cover the\nentire history of sexuality in America in a single study. This week you read the first section of the book, which\ncovers the 1600-1800 period. What major themes jump out at you as important structuring elements for\nAmerican thinking about sex and sexuality during this period? Which historical groups or actors do D'Emilio and\nFreedman think are especially important? Read the Lahontan and Lawson primary documents alongside\nD'Emilio and Freedman. Watch the short \"Two-Spirit\" documentary and compare it the Lawson and Lahontan.\nStephanie McCurry is a professor of history at Columbia University who specializes in the American Civil War\nand Reconstruction. What can her study of the Thirteenth Amendment - and emancipation - tell us about\nfamily, intimacy, and sexual coercion under slavery? What actions did formerly enslaved people take to\nreconstruct families after Emancipation? What barriers did they face? Read the Jacobs primary source alongside\nMcCurry.\nCarroll Smith-Rosenberg's \"Female World of Love and Ritual\" is a classic text in women's history and the\nhistory of gender and sexuality. How, according to Smith-Rosenberg, did the gendered ideology of the\nnineteenth century shape (some, middle-class, white) women's relationships with other women? How do ideas\nabout privacy and publicity fit into her story? As you read, keep in mind our conversation from week one. This\nessay was written in 1975... what kinds of social/cultural/political interventions might Smith-Rosenberg have\nhoped to make in conducting a study of this nature?\nWGS.110J/21H.108J - Week 3\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\nWGS.110J / 21H.108J Sexual and Gender Identities in the Modern United States\nSpring 2024\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Readings and Films Guide Week 4: Sex and the City: Working Class Sexuality and the Crusade Against Vice",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/wgs-110j-sexual-and-gender-identities-in-the-modern-united-states-spring-2024/mitwgs_110j_s24_readingguide04.pdf",
      "content": "WGS.110J/21H.108J\nWeek 4 Reading Guide\nSex and the City: Working Class Sexuality and the Crusade Against Vice\nThis week we launch into Unit 2 of the course, \"The Tempest: Contesting Sexual Order, c. 1900-1920.\"\nFor the next two class sessions we will examine the ways in which commercialization, industrialization,\nurbanization, immigration, and other historical processes at the turn of the twentieth century led to\nmassive changes in the sexual lives and gender identities of Americans. This period of rapid change is\nsometimes referred to as the \"progressive era,\" because it witnessed a sharp rise in activism geared\ntoward what was called at the time \"progressive social change.\" Much of this activism addressed\nsexuality and gender directly (the moral reformers that show up throughout this week's reading are\nparticipants in this movement). Progressive politics in the twenty-first century differ in important ways\nfrom the politics of reformers at the start of the twentieth, but as you read this week you might\nconsider some continuities that unite \"progressives,\" then and now.\nIn class we will focus on the lives and choices of urban, working people, as well as the reformers who\nsought to contain and contest the tempest unleashed by modernization and urbanization in its many\nforms. As you read, think about how changing urban landscapes in the United States lead to changes in\nAmerican thinking about publicity/privacy, gender identity, and sexuality (including its\ncommercialization).\nRequired Texts\n- Sarah Deutsch, \"The Moral Geography of the Working Girl (And New Woman)\" from Women\nand the City: Gender, Space, and Power in Boston (2000) 78-114.\n- Kathy Peiss, \"Charity Girls and City Pleasures,\", Vol. 18, No. 4 (July 2004) 14-16.\n- Jeffrey Escoffier, Whitney Strub, and Jeffrey Patrick Colgan, \"The Comstock Apparatus,\" in\nIntimate States: Gender, Sexuality, and Governance in Modern US History, eds. Cannaday, Cott, and Self\n(Chicago: University of Chicago Press, 2021) 41-59.\n- George Kneeland, \"Commercialized Prostitution in New York City\" [1913], in Documenting\nIntimate Matters: Primary Sources for a History of Sexuality in America, Foster ed. (2012) 104-107.\n- Emily Skidmore, \"Life as a Trans Man in Turn-of-the-Century America,\" Literary Hub,\nSeptember 22, 2017.\n- Alva French and Channing Joseph, \"How a Former Slave Became the World's First Drag\nQueen,\" BBC, February 1, 2023.\n- OPTIONAL (for more info on Swann): Cari Shane, \"The First Self-Proclaimed Drag Queen\nWas a Formerly Enslaved Man,\" Smithsonian, June 9, 2023.\nQuestions to Consider:\nSarah Deutsch is a professor of history at Duke University. The selection you read by her this week\noffers a close examination of the lives of working women in the Boston area around the turn of the\ntwentieth century. Pay attention to her treatment of race, ethnicity, and the \"moral implications\" of\npublic and private space.\nWGS.110J/21H.108J - Reading Guide Week 4\n\nKathy Peiss is a cultural historian whose research on turn-of-the-century working-class sexuality\nemphasizes key differences in the experiences of women from differing class backgrounds. The short\narticle you read by her this week examines the role of leisure in the lives of young working women and\nthe emerging culture of \"treating\" in urban America. What choices were available for young, urban,\nworking women around the turn of the twentieth century? What strategies did they use to navigate the\nchaotic, public world of the city, removed from the restraints and protection of home and family? Read\nthe Kneeland primary source alongside Deutsch and Peiss.\nThe co-authored article on the \"Comstock Apparatus\" examines the history of moral reform and \"vice\nsuppression\" during this era within a legal and political framework. As you read, think back to our\nconversation from last week about the regulation of sexuality and gender from earlier periods in\nAmerican history. What changes and continuities do you notice between \"Comstockery\" around the\nturn of the twentieth century and efforts to police/regulate/contain sexuality and gender during the\ncolonial era and the early-mid nineteenth century?\nEmily Skidmore is Assistant Professor of History at Texas Tech University. Compare her short article\non the lives of transmen around the turn of the twentieth century with the video (and optional article)\nabout William Dorsey Swann. How do early queer communities and the lives of Harry Gorman and\nothers like him, \"fit\" into what you've learned this week about the shifting landscape of gender and\nsexuality in the US?\nWGS.110J/21H.108 J- Reading Guide Week 4\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\nWGS.110J / 21H.108J Sexual and Gender Identities in the Modern United States\nSpring 2024\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Readings and Films Guide Week 5: The Birth of Feminism, Women’s Suffrage, and the Politics of Reproduction",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/wgs-110j-sexual-and-gender-identities-in-the-modern-united-states-spring-2024/mitwgs_110j_s24_readingguide05.pdf",
      "content": "WGS.110J/21H.108J\nReading Guide for Week 5\nThe Birth of Feminism, Women's Suffrage, and the Politics of Reproduction\nIn our last class meeting we examined working-class sexuality in rapidly expanding, urban centers. We\nalso discussed progressive reform and attempts by middle-class Americans to contain sexuality and\ngender expression through the control \"vice,\" broadly defined. This week we continue our focus on\nearly twentieth-century contestations over sexual order by looking closely at the emergence of feminism\nas a radical social movement, the political campaign for women's suffrage, and connected debates over\nthe politics of reproduction.\nRequired Texts\n- Nancy Cott, \"The Birth of Feminism,\" from The Grounding of Modern Feminism (1987) 12-50.\n- Linda Gordon, \"Birth Control and Social Revolution,\" in Major Problems in the History of American\nSexuality, Peiss, ed. (2002) 320-327.\n- Molly Ladd Taylor, \"Eugenics, Sterilization, and Social Welfare,\" in Major Problems in the History\nof American Sexuality, Peiss, ed. (2002) 327-336.\n- PERUSE: Thomas Dublin, Kathryn Kish Sklar, Judy Tzu-Chun Wu, and Rebecca Jo Plant,\n\"Women's Voting and U.S. Empire,\" Module 2 from The Empire Suffrage Syllabus, 2024. Focus\nspecifically on Weeks 5 and 6: \"Civilizing Missions and Voting Rights,\" and \"The Struggle for\nWomen's Suffrage in U.S. Colonies\"\n- PBS Digital Short, \"The Ongoing Fight\" (2020) ~10min.\n- Mary Church Terrell, \"The Progress of Colored Women,\" Address delivered before the\nNational American Women's Suffrage Association (1898) 1-8.\n- Caves [1896], Sanger [1917], SCOTUS [1927], Letters to Sanger, [1924-1936], in \"The Politics\nof Reproduction\" Document Collection, in Major Problems in the History of American Sexuality,\nPeiss, ed. (2002) 310-318.\n- OPTIONAL: Iron-Jawed Angels (2004) 120 min.\n- OPTIONAL: \"Frances Willard Equates Learning to Ride a Bicycle with Opening New\nFrontiers for Women,\" in Modern American Women, Ware, ed, (1989) 15-19.\nQuestions to Consider:\nHistorian Nancy Cott is a familiar figure from week one. This week we read her account of the\nemergence of feminism in the United States during the first decades of the twentieth century. What\nhistorical contexts helped shape the early development of feminism in the US? What kinds of women\nand men embraced feminism? Which movements/philosophies/figures influenced and inspired early\nAmerican feminists? As you read, think back to previous weeks. How do familiar themes (essentialized\nconceptions of gender, racial and class differences, notions of publicity and privacy, and so on) play out\nin Cott's chapter? What do you think accounts for these changes or continuities?\nLinda Gordon and Molly Ladd-Taylor are both leading historians of American social policy. Gordon's\nessay examines the radical roots of the early twentieth-century birth control movement, and the links\nearly activists like Margaret Sanger made between birth control and social, political, and economic\nrevolution. Ladd-Taylor explores the darker side of birth control activism during a slightly later period.\nAs you read, consider the ways that race, class, and gender shaped arguments about who should be able\nWGS.110J/21H.108J - Reading Guide for Week 5\n\nto control fertility, and how. What roles do science and medicine play in both accounts? Read \"The\nPolitics of Reproduction\" primary source collection (Caves, Sanger, SCOTUS, and letters to Sanger)\nalongside Gordon and Ladd-Taylor.\nThe Fifteenth Amendment to the United States Constitution was passed in 1870. It granted all men the\nright to vote (including formerly enslaved Black Americans), but failed to include women in the\nelectorate. Disappointed by this failure, many white woman's rights activists (including many former\nabolitionists) made a strategic choice to push for suffrage for white women specifically. As the\nmovement to achieve suffrage commenced during the final decades of the nineteenth-century, race\nbecame a central and divisive issue. Some white antisuffragists argued that opening the vote to all\nwomen would increase the Black voting population. Some white suffragists, for their part, argued that\nwhite women voters would help to uphold white racial supremacy. Mary Church Terrell, a daughter of\nformer slaves, was one of the first African American women in the United States to earn a college\ndegree, and later helped to found the National Association of Colored Women. As the organization's\nfirst president, she became nationally known for her support of women's suffrage, and her opposition\nto racial prejudice. In her 1898 speech to the National American Woman Suffrage Association, Terrell\noutlines the achievements of African American women. What motivations might have led her to do so\nfor this audience? What rhetorical moves does she make in her speech? In what ways do her concerns\nand her language fit into the larger themes and social contexts we've been exploring over the past two\nweeks? Read Terrell's speech alongside the PBS digital short documentary and the Women's Voting\nand US Empire website.\nWGS.110J/21H.108J - Reading Guide for Week 5\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\nWGS.110J / 21H.108J Sexual and Gender Identities in the Modern United States\nSpring 2024\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Readings and Films Guide Week 6: Regulating Sexuality and Gender through the Jazz Age, Depression, and War",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/wgs-110j-sexual-and-gender-identities-in-the-modern-united-states-spring-2024/mitwgs_110j_s24_readingguide06.pdf",
      "content": "Week 6 - Reading Guide - Regulating Sexuality and Gender through the Jazz Age, Depression, and War\nIn Unit 2 we examined the 1900-1920 period, an era characterized by a loosening of restrictions on sexual\nexpression and sexual identities, and an expansion of opportunities for individuals to challenge previously rigid\ngender binaries.\nThis week we begin Unit 3 of the course, \"Locks and Dams: Creating and Policing Boundaries, 1920-1960.\" The\nmiddle decades of the twentieth century differed significantly from the tempestuous period we studied in Unit 2.\nAfter American women achieved the vote in 1920, the nation witnessed an extended period of contraction in the\nrealms of sexual freedom and expression. During the 1920-1960 period, a variety of American institutions\nlaunched new campaigns to tighten controls over sexuality, and to create and police new boundaries around sexual\nand gender identities.\nIn our Week 6 class meeting we will focus on a period that spans from the 1920s to the 1940s. The readings that\ncover this period are divided into three thematic/chronological eras: the Jazz Age (late 1910s-1920s), the Great\nDepression (1930s), and WWII (1940s). As you read this week (and next week), pay close attention to the ways in\nwhich new boundaries were constructed, and the roles played by a variety of institutions in policing gender and\nsexuality.\nRequired Texts\n-\nChristina Simmons, \"Modern Sexuality and the Myth of Victorian Repression\" in Gender and American\nHistory Since 1890, Melosh, ed. (1993), 17-36.\n-\nGeorge Chauncey, \"Christian Brotherhood or Sexual Perversion?: Homosexual Identities and the\nConstruction of Sexual Boundaries in the World War I Era,\" Journal of Social History 19 (1985), 189-212.\n-\nAlice Kessler Harris, \"Designing Women and Old Fools: Writing Gender into Social Security Law,\" in\nWomen's America: Refocusing the Past, Kerber, ed. (2004), 435-446.\n-\nMabel Hampton, \"Lesbian Life in the 1920s and 1930s,\" in Major Problems in the History of American\nSexuality, Peiss, ed. (2002), 345-346.\nNOTE: We will watch the film Coming Out Under Fire (1994), which examines the lives and experiences of gay\nand lesbian veterans who served in WWII, in class.\nQuestions to Consider\nThe Simmons, Chauncey, and Harris texts cover the period spanning from WWI to the 1930s. Each emphasize\nthe emergence of \"types,\" or categories, that were used to define, construct, and contain sexual behaviors and\ngender identities.\nSimmons focuses on what she calls \"the myth of Victorian repression.\" What does she mean by this? What was\nthe ultimate function of this myth, according to Simmons?\nChauncey examines a slightly earlier period, and is also interested in types. What kinds of difficulties did naval\ninvestigators encounter when attempting to draw boundaries around sexual relationships, acts, and identities?\nHow, according to Chauncey, did sexual subcultures interact with institutions like the church and the military\nwhen it came to defining these boundaries?\nThe Kessler-Harris reading is dense, but worth your time and attention. In this excerpt from a larger book,\nKessler-Harris addresses a different kind of boundary construction. What kinds of assumptions, categories, and\nclassifications did policy makers draw on in the 1930s when crafting Social Security legislation? Who or what,\naccording to Kessler-Harris, drove these decisions? What were their consequences?\nRead the Mabel Hampton primary source alongside Simmons, Chauncey, and Harris - what similar themes do\nyou notice?\nWGS.110J/21H.108J - Reading Guide for Week 6\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\nWGS.110J / 21H.108J Sexual and Gender Identities in the Modern United States\nSpring 2024\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Readings and Films Guide Week 7: Creating, Containing, and Resisting “Normal” in Post-War America",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/wgs-110j-sexual-and-gender-identities-in-the-modern-united-states-spring-2024/mitwgs_110j_s24_readingguide07.pdf",
      "content": "Creating, Containing, and Resisting \"Normal\" in Post-War America\nReading Guide for Week 7\nThis week we close out the third unit of the course, \"Locks and Dams: Creating and Policing\nBoundaries, 1920-1960.\" Last week we examined change over time in the ways institutions (and\nespecially the military) understood and regulated sexuality from the 1910s through the 1940s. This week\nwe continue that conversation into the post-WWII era. As you for read for class this week, pay close\nattention to the ways various historical actors discuss \"normal\" sexuality and gendered behavior. How\nwas \"normalcy\" defined, and what made it appealing? Finally, what strategies did people use to resist\nand contest it?\nAs always, try to keep in mind the \"three Cs\" of historical thinking: context, continuity, and change.\nWhat historical contexts helped shape American thinking about gender and sexuality during the post-\nWWII era? What continuities and enduring themes from previous weeks do you notice? What changed\nduring this period? What was new, or different?\nRequired Texts\n- Elaine Tyler May, \"Explosive Issues: Sex, Women, and the Bomb,\" in Recasting America: Culture\nand Politics in the Age of Cold War, May, ed. (1989) 154-168.\n- Sarah Igo, \"Surveying Normal Selves,\" from The Averaged American: Surveys, Citizens, and the\nMaking of a Mass Public (2007) 191-233.\n- Craig Loftin, \"Unacceptable Mannerisms: Gender Anxieties, Homosexual Activism, and the\nSwish in the United States, 1945-1965,\" Journal of Social History 40: 3 (2007), 577-596.\n- Joanne Meyerowitz, \"Transforming Sex: Christine Jorgensen in the Postwar U.S.,\" OAH\nMagazine of History 20:2 (March 2006) 16-20.\n- \"Alfred Kinsey Reports on Americans' Sexual Behavior, 1948-1953,\" in Major Problems in the\nHistory of American Sexuality, Peiss, ed. (2002) 368-373.\n- \"Employment of Homosexuals and Other Sex Perverts, 1950,\" in Documenting Intimate Matters:\nPrimary Sources for a History of Sexuality in America, Foster ed. (2012) 144-147.\nQuestions to Consider\nElaine Tyler May is an historian of the postwar United States. The essay we read by her this week\nexplores connections between Cold War political ideology, gender, and family life. Why, according to\nMay, did so many Americans rush into marriage and childbearing after WWII? What role did \"experts\"\nplay in helping shape trends like early marriage and rising birthrates? What does May mean by the term\n\"sexual containment,\" and why did some Americans think it was necessary?\nSarah Igo is a cultural and intellectual historian. Her book, The Averaged American, traces the history of\nsocial surveys and polling in the twentieth-century US. The chapter we read this week from her book\nfocuses on Alfred Kinsey, one of many \"experts\" who achieved fame and authority during the postwar\nera. How, according to Igo, did Kinsey justify his research, and what strategies did he use to claim\nexpert status? Why did Kinsey choose to include some Americans, and not others, in his published\nstudies? After learning about Kinsey, how would you describe his project's relationship to \"normal\"\nsexual behavior? Did his studies challenge \"normal\"? Create it? Something else?\nWGS.110J/21H.108J - Reading Guide for Week 7\n\nCraig Loftin is an historian of 1950s and early 1960s gay and lesbian activism (referred to as\n\"homophile\" organizing). In \"Unacceptable Mannerisms\" he examines how ideas about gender - and\nespecially masculinity - shaped homophile politics. Why, according to Loftin, did authors and readers\nof magazines like ONE think \"swishes\" were a problem? What consequences (both positive and\nnegative) does Loftin associate with the increased visibility of homosexuality in American culture during\nthis era?\nThe short article by Joanne Meyerowitz examines the life and celebrity of Christine Jorgenson, widely\nrecognized as the first \"trans celebrity\" in the US. What, according to Meyerowitz, made Jorgenson's\nstory attractive to postwar Americans? Knowing what we know about \"sexual containment\" (from\nMay), and the atmosphere of fear and repression surrounding homosexuality during this era (from\nLoftin), how can we account for Jorgenson's celebrity, and the initially warm reception she received\nfrom the public? What role does science play in Meyerowitz's account? How about law?\nThe two primary sources assigned this week are discussed repeatedly in the other assigned materials. As\nyou read selections from Kinsey's studies and \"Employment of Homosexuals and Other Sex Perverts\nin Government,\" pay close attention to language and tone. What recurring themes and patterns do you\nnotice in these documents? Looking forward to your Short Paper (due this week), attempt a \"practice\nanalysis\" of one of these primary sources. How do these documents challenge, complicate, or clarify the\nclaims made by May, Igo, Loftin, and/or Meyerowitz?\nWGS.110J/21H.108J - Reading Guide for Week 7\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\nWGS.110J / 21H.108J Sexual and Gender Identities in the Modern United States\nSpring 2024\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Readings and Films Guide Week 8: Revolutions I: Civil Rights, The Pill, and The Emergence of Second Wave Feminism",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/wgs-110j-sexual-and-gender-identities-in-the-modern-united-states-spring-2024/mitwgs_110j_s24_readingguide08.pdf",
      "content": "Week 8 - Reading Guide - Revolutions I: Civil Rights, The Pill, and The Emergence of Second Wave\nFeminism\nToday we begin the fourth unit of the course, \"The Flood: Breaking Barriers, c. 1960-1980.\" For the next two weeks\nwe will examine one of the most tumultuous and revolutionary eras in American history. Following a period of\nboundary-policing and tightening of regulations placed on sexual and gender identities between the 1920s and the\n1950s, the 1960s and 1970s witnessed an explosion of political and social activism - much of which revolved around\nsexuality and gender. This week, we will examine the beginnings of this period, focusing on civil rights activism, the\nso-called \"the sexual revolution\" of the 1960s, and the emergence of a new wave of American feminist activism.\nAssigned Materials\n-\nRickie Solinger, \"The Population Bomb and Sexual Revolution,\" in Reiss, American Sexual Histories, second\ned. (2012) 320-335.\n-\nBetty Friedan, \"The Problem that Has No Name,\" from The Feminine Mystique [1963] 57-78.\n-\nCasey Hayden and Mary King, \"Sex and Caste: A Kind of Memo\" [1965], in Takin' It to the Streets: A Sixties\nReader, Bloom and Brienes, eds. (1995) 133-136.\n-\nNY Radical Women, \"No More Miss America!\" [1968] Redstockings Online Archive, 1-2.\n-\nCarol Hanisch, \"The Personal is Political\" [1969], and forward from author (2009) 1-5.\n-\nBlack Unity Party, \"Birth Control and Black Children\" and \"Response from Black Sisters\" [1968], from The\nChicago Women's' Liberation Union Herstory Archive, 1-2.\n-\nWATCH FILM BEFORE CLASS: Brother Outsider: The Life of Bayard Rustin (2003), 83 min.\nQuestions to Consider\nCivil Rights: As you watch the documentary about the life of Bayard Rustin, consider how gender and sexuality\nmattered in the long Black Freedom struggle in the US. How does a focus on Rustin complicate what you have\nlearned about the Civil Rights Movement in other venues (for example, in high school classes or mainstream\nmovies)? Why is it important to know about Rustin, and what can his life teach us?\nPopulation and the Pill: Read Solinger's essay on the \"population bomb\" alongside the document from the Black Unity\nParty and the response from Black Sisters. How do these documents fit into what we already know from class, about\nthe history and politics of reproduction in the United States? How did the ways Americans understood the politics\nof reproduction change over the course of the twentieth century?\nEmergence of Second Wave Feminism: Casey Hayden and Mary King were activists who participated extensively in the\nCivil Rights Movement (what they simply call \"the movement\"). As you read their \"kind of memo,\" pay close\nattention to tone and style. What are they asking for? How are they asking for it? Betty Friedan was a journalist and\nlabor activist before founding the National Organization for Women (NOW) and becoming a central figure of the\nWomen's Movement. As you read Friedan, try to think back to our last class session - in what ways did the social\nand cultural atmosphere of the 1950s lead to the emergence of a new feminist consciousness in the 1960s? Compare\nHayden and King's \"Memo\" to Friedan's take on the challenges faced by mid-century housewives. Both documents\nare credited with \"launching\" the \"second wave\" of American feminism. In what ways do these sources differ from\nor complement each other? Finally, read \"No More Miss America!\" and Hanisch's classic essay \"The Personal is\nPolitical\" closely. Are the goals and motivations of these documents the same as those of Friedan, Hayden, and\nKing?\nIf we read these documents in chronological order from 1963 to 1969, what kind of picture emerges? How would\nyou characterize the development of feminism in the US from the early to the late 1960s?\nWGS.110J/21H.108J - Week 8 Reading Guide\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\nWGS.110J / 21H.108J Sexual and Gender Identities in the Modern United States\nSpring 2024\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Readings and Films Guide Week 9: Revolutions II: Feminism as a Mass Movement and the Emergence of Gay Liberation",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/wgs-110j-sexual-and-gender-identities-in-the-modern-united-states-spring-2024/mitwgs_110j_s24_readingguide09.pdf",
      "content": "Reading Guide for Week 9\nRevolutions II: Feminism as a Mass Movement and the Emergence of Gay Liberation\nToday we conclude the fourth unit of the course, \"The Flood: Breaking Barriers, c. 1960-1980.\" Last\nweek we looked at the emergence of second wave feminism and its roots in other mid-century social\nmovements and the highly gendered social structure of postwar America. This week, we will discuss\nthe impacts of second wave feminism, and the challenges it faced, as it grew into a mass movement.\nWe will also explore the development of LGBTQ activism during this era.\nTo capture the flavor, complexity, and diversity of mass-movement feminism and the early years of\nGay Liberation, I have assigned a large number of primary sources for the week. They are listed on\nCanvas in chronological order. Some of these sources are longer and more dense than others - I\nrecommend taking a brief glace at all of them (so you know what you're in for) before diving into\nreading. Several additional sources, listed as \"optional\" are also available on Canvas for students\neager to learn more about identity, activism, and organizing during this era.\nAssigned Texts\n-\nNancy Rosenstock, \"Second-Wave Feminism: Accomplishments and Lessons,\" Against the\nCurrent v. 211 (March/April 2021).\n-\nLibrary of Congress, \"1969: The Stonewall Uprising,\" in LGBTQIA+ Studies: A Resource\nGuide\n-\nCarl Whitman, \"A Gay Manifesto,\" The Red Butterfly, 1969.\n-\nBoston Women's Health Collective, Preface to Our Bodies, Ourselves [1973], in Modern\nAmerican Women, Ware, ed, (1989) 417-422.\n-\nCombahee River Collective, \"A Black Feminist Statement\" [1977], in Modern American\nWomen, Ware, ed, (1989) 354-364.\n-\nAngela Davis, \"The Approaching Obsolescence of Housework: A Working-Class\nPerspective,\" from Women, Race, and Class [1981].\nOptional\n-\nRadicallesbians, \"What is a Lesbian?\" [1970], in Women's America: Refocusing the Past, Kerber,\ned. (2004) 580-582.\n-\nThird World Gay Liberation, \"What We Want, What We Believe\" [1971], in in Takin' It to the\nStreets: A Sixties Reader, Bloom and Brienes, eds. (1995) 502-506.\n-\nBarbara Ehrenreich, \"What is Socialist Feminism?\" Win Magazine [1976], 1-6.\n-\nKPFA Radio, Audio Recording, \"Asian American Women vs. The Women's Movement,\"\n1979.\nQuestions to Consider\nNancy Rosenstock is a feminist activist who participated in the Women's Liberation Movement of\nthe 1970s. In her essay assigned this week she offers a broad overview of second-wave feminism.\nWhat challenges did feminist activists in the 1960s and 1970s face? What strategies did they use to\nconfront these challenges? What is the legacy of second-wave feminism, and why do you think it\nmatters?\n\nRead the front page of LOC's collection on the 1969 Stonewall Uprising, then peruse the rest of the\nsite. We will watch a documentary, Screaming Queens (2005), about a similar uprising that took place in\nSan Francisco three years before Stonewall. Compare these two moments of queer resistance. Why\nhas Stonewall become a part of popular historical memory while other uprisings from the era (and\nearlier) have not?\nCarl Whitman was a member of Students for a Democratic Society (SDS) and an activist for Gay\nrights. His 1969 manifesto presents a radical program for the Gay Liberation movement. Which of\nhis claims did you find particularly surprising, inspiring, or important? How does this manifesto\nstand the test of time, 55 years after it was written?\nThe Boston Women's Health Collective was founded in 1969 and authored one of the most\nimportant founding texts of the women's health movement, Our Bodies, Ourselves, A self-help guide\nfor women seeking to take charge of their own health and bodies. Why did the BWHC think such a\ntext was necessary? What can we learn from this group (and others we explore this week) about\ncollective action and organizing?\nThe Combahee River Collective was a group of black feminist activists who formed in Boston in the\n1970s. Their statement on Black Feminism is another essential document from the American\nWomen's Movement, and is widely credited with popularizing the concept of intersectionality. What\ndoes the collective mean by \"the most profound and potentially most radical politics come directly\nout of our own identity\"? How do they interpret the idea that \"the personal is political\"?\nAngela Davis is a Marxist feminist activist and a distinguished Professor of the History of\nConsciousness and Feminist Studies at UC Santa Cruz. \"The Approaching Obsolescence of\nHousework: A Working-Class Perspective,\" is the final chapter of her pathbreaking 1981 book,\nWomen, Race, and Class. Why does Davis think housework matters? What does it have to do with\ncapitalism? Feminism? What do you think of her proposed response to the problem of housework?\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\nWGS.110J / 21H.108J Sexual and Gender Identities in the Modern United States\nSpring 2024\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Readings and Films Guide Week 10: The Religious Right and the AIDS Epidemic",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/wgs-110j-sexual-and-gender-identities-in-the-modern-united-states-spring-2024/mitwgs_110j_s24_readingguide10.pdf",
      "content": "Week 10 - Reading Guide - The Religious Right and the AIDS Epidemic\nToday we begin the fifth unit of the course, \"Changing Tides: Gender and Sexuality as\nBattlegrounds, c. 1980-2000.\" This period follows the tumultuous era we covered in unit four, which\nwitnessed a flowering of civil rights, feminist, and LGBT activism, as well as a general expansion of\nsexual freedom and expression. Many Americans during the 1960s and 1970s stepped outside of\nimposed boundaries, embraced new sexual and gender identities, and participated in revolutionary\nmovements that sought to radically remake the world.\nNot everyone welcomed these movements - or the changes they brought to American life. During\nthe 1980s and 1990s political conservatives and various newly united religious groups fought\ntogether to contain the transformations wrought by the previous decades, building a powerful\ncounterrevolution that emphasized gender and sexuality as cultural battlegrounds. In the process,\nthis new conservative coalition reshaped the American political landscape in ways that remain\nrelevant to this day.\nWhat historians now call \"the rise of the right\" was accompanied by the rise of an unknown and\nterrifying epidemic that ravaged gay communities during its earliest stages. The HIV/AIDS epidemic\nfundamentally altered the lives of LGBT Americans and gave rise to new forms of discrimination...\nand activism. This week, we will discuss these developments and their impacts on sexual and gender\nidentities in the 1980s and 1990s.\nAssigned Texts\n-\nMargot Canaday, \"The AIDS Crisis on the Job,\" in Queer Career: Sexuality and Work in Modern\nAmerica (Princeton: Princeton University Press, 2023) pp. 187-226.\n-\nSusan Faludi, selections from Backlash: The Undeclared War Against American Women [1991], in\nFeminism in Our Time: The Essential Writings, WWII to the Present, Schneir, ed. (1994) pp. 454\n468.\n-\nPhyllis Schlafly, Interview with The Washington Star [1976], in The Rise of Conservatism in\nAmerica, 1945-2000: A Brief History with Documents, Story and Laurie, eds. (2008) 103-107.\n-\nLarry Kramer, \"1,112 and Counting,\" New York Native, Issue 59, March 14-27 (1983) 1-8.\n-\nRebecca Walker, \"Becoming the Third Wave,\" Ms. 2:4 (1992) pp. 39-41.\n- FILM: How to Survive a Plague (2012) 110 min.\nQuestions to Consider\nMargot Canaday is an historian of gender and sexuality whose research focuses on the legal and\npolitical-economic processes that have shaped queer life in the modern US. The chapter you read\nthis week is from her recent, award-winning book, Queer Career: Sexuality and Work in Modern America.\nDoes Canaday's focus on workplaces change the ways you have thought previously about\nHIV/AIDS and its history? How about queer activism?\nSusan Faludi is a journalist and author of numerous popular books. This week we read an excerpt\nfrom her 1991 book, Backlash: The Undeclared War Against American Women, which examines the rise\nof anti-feminism in the 1980s. What role, according to Faludi, did popular media play in fueling\nbacklash? What forms did the backlash take, and how did it portray feminism? Read Rebecca\n\nWalker's call for a feminist \"Third Wave\" alongside Faludi. Walker's article was written less than a\nyear after publication of Backlash, and drew inspiration from the controversial confirmation of\nClarence Thomas to the US Supreme Court - despite credible allegations of sexual harassment from\nhis former employee (now Professor of Social Policy, Law, and Women's Studies at Brandeis\nUniversity) Anita Hill. What do these texts by Walker and Faludi tell us about the politics of\nsexuality and gender in the 1980s and 1990s?\nPhyllis Schlafly was a conservative activist who gained fame for her efforts to prevent ratification of\nthe Equal Rights Amendment in the early 1980s. In this interview she explains her opposition to the\nERA. What do you think of her argument? Why might it have been appealing to some American\nwomen and men?\nLarry Kramer was an author, playwright, and queer public health activist. His 1983 article, \"1,112\nand Counting\" was one of the first published accounts of the AIDS epidemic's impacts on the gay\ncommunity, and it is widely credited with launching the grassroots movement to combat the disease.\nHow would you describe the tone of this article? What response does he call for?\nWe will not have time to view the outstanding 2012 documentary, How to Survive a Plague, in class.\nPlease make sure to view it before we meet. Try to connect this film to other assigned materials this\nweek. Bring questions and comments related to the film to class.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\nWGS.110J / 21H.108J Sexual and Gender Identities in the Modern United States\nSpring 2024\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Readings and Films Guide Week 11: Law and Economy at Century’s End",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/wgs-110j-sexual-and-gender-identities-in-the-modern-united-states-spring-2024/mitwgs_110j_s24_readingguide11.pdf",
      "content": "21H.108J/WGS.110 J- Reading Guide for Week 11\nLaw and Economy at Century's End\nThis week we close out Unit 5 of the course, \"Changing Tides: Gender and Sexuality as Battlegrounds.\" Last\nweek we examined opposition to the expansion of gender and sexual expression and identities in the 1960s\nand 1970s, focusing on cultural \"backlash\" to feminism, the failure of attempts to legislate gender equality,\nand rising repression during the HIV/AIDS epidemic during the 1980s and 1990s.\nThis week we examine legal and economic trends at the end of the twentieth century and the beginning of the\ntwenty-first. This period witnessed a massive shift in American thinking about sexuality and its regulation.\nDecades of social and legal activism finally bore fruit during this era, leading to the decriminalization of\nsodomy and the passage of laws guaranteeing marriage rights to same-sex couples. As the Chauncey and\nMintz readings assigned this week make clear, the efforts of historians were crucial in these legal battles.\nThese early twenty-first-century triumphs were offset, however, by a stalling, or even reversal, of progress in\nefforts to improve the lives of women. The continuing feminization of poverty, a persistent wage gap\nbetween female and male earners, and dwindling access to contraception and abortion for women living in\nmany parts of the nation combined with what the feminist philosopher Nancy Fraser calls a \"crisis of care,\" a\ngeneral breakdown of social reproduction - society's ability to ensure care for its members. As Fraser\ndescribes, the burden of this crisis has largely fallen on women in the US and abroad, though its impacts can\nbe felt by all.\nHow can we make sense of the diverging fortunes of queer activism and feminist/women's movements at the\nstart of the twenty-first century? Do you think these trends may be changing today? If so, how and why?\nAssigned Materials\n-\nGeorge Chauncey, \"What Gay Studies Taught the Court: The Historians Amicus Brief in Lawrence\nv. Texas\" GLQ 10:3 (2024) pp 509-538.\n-\nSteven Mintz, \"The Role of History in the Supreme Court Decision on Gay Marriage,\" Inside\nHigher Ed (July 2013) 1-3.\n-\nNancy Fraser, \"Contradictions of Capital and Care,\" New Left Review 100 (July Aug 2016) pp. 99-117.\nKey Themes for the Week\n1. The Role of History: Historians and historical analysis played an important role in shaping the law,\nespecially in cases relating to sexuality - a development Chauncey and Mintz emphasize in their\narticles. Beyond the courts, history has mattered in myriad ways throughout the twentieth and\ntwenty-first centuries. Most crucially, it has served as a tool for those who have worked to resist,\nreject, and reform institutionalized heterosexuality and mainstream configurations of gendered\npower. How would you characterize the changing role of history in these efforts? Or in other\nwords... how have the uses of history changed? Why do you think history matters?\n2. The Role of Capitalism: Fraser is a philosopher and political theorist who has written extensively\nabout capitalism and social justice. Much of her recent work focuses on social reproduction (raising\nchildren, maintaining households, caring for the young/sick/old), which she sees as necessary for\ncapitalism to function, but also endangered by capitalism istelf. How does her brief sketch of\nhistorical \"regimes of capitalism\" fit with the history of gender and sexuality we have learned this\nsemester? This is a challenging read, but try to come up with at least one \"take-away\" idea to discuss\nin class.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\nWGS.110J / 21H.108J Sexual and Gender Identities in the Modern United States\nSpring 2024\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Final Project/Paper Guidelines",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/wgs-110j-sexual-and-gender-identities-in-the-modern-united-states-spring-2024/mitwgs_110j_s24_finalproject.pdf",
      "content": "WGS.110J/21H.108J - S2024\nFinal Project/Paper Guidelines\nFor the last assignment of the course you will be asked to produce a final project or paper on a topic of your\nchoosing. This topic should relate in some way to the history of sexuality and gender in the United States, and\nto the major themes we have addressed in class over the course of the semester.\nAn informal, ungraded paragraph describing your final project, and the kinds of materials you might analyze\nto produce it, will be due by Week 10.\nRequirements\nAll projects must include analysis of primary sources related to your topic. These sources can include\nnewspaper articles, advertisements, diaries, memoirs, oral histories, manifestoes, government documents,\npopular cultural productions like tv shows or films, or a wide variety of other materials. You will be\nresponsible for locating these sources, but I will be happy to assist you in your search.\nFinal projects can take many forms (see the below list of potential final projects). Regardless of what format\nyou choose, all projects should provide evidence that you have thought carefully about assigned course\nmaterials and themes. Projects should also present one or more original ideas or arguments. These ideas or\narguments should be unique (of your own making), compelling, (they should communicate something\ninteresting or important), and clearly articulated (a reader/viewer should have no problem identifying your\ncontributions or claims). In crafting your project, you should draw on lectures, discussions, and readings from\nclass, as well as your own ideas about the history of sex, sexuality, and gender developed over the course of\nthe term.\nFinal projects in the form of paper should be 1800-2500 words in length, double-spaced, and written in a 12\npoint font. They should include page numbers, properly formatted footnotes with accurate citations, and a\ntitle that reflects the paper's argument. Final projects that take other forms should reflect an equivalent\namount of work as a paper that is 1800-2500 words long. I will chat individually with students who choose\nnot to write formal papers in order to make sure that projects fulfill the basic requirements of the assignment.\nLate submissions from students who have not contacted me in advance will receive a penalty of one third of a\ngrade for each day the paper is late after the official due date.\nProjects will be graded according to:\n-\nThe relevance of the project to course themes\n-\nThe quality, clarity, and originality of the ideas or arguments presented\n-\nThe strength of the evidence marshaled in support of those ideas\n-\nThe caliber of analysis of primary sources\n-\nThe clarity and quality of written or other forms of expression (for papers, this includes style,\ngrammar, and proper citation)\nWGS.110J/21H.108J Final Project Assignment\n\nPotential Final Project Options\nThis list is not exhaustive - students who would like to pursue other options should contact me\nAnalytical Essay: This classic option is much like the Short Paper, assigned earlier in the semester. Instead of\ndrawing only on assigned readings from class, a final analytical essay should include original research based on\nprimary sources selected by students from any number of sources. A list of online databases that house\nprimary sources can be found at the end of this document.\nShort Fiction: Students may write a piece of short fiction that is relevant to course themes and that draws on\nprimary historical materials. If you select this option, you will need to include a brief bibliographic essay or\nannotated bibliography that describes the sources and materials you have drawn on to craft your narrative.\nReview and Analysis of Popular Cultural Productions: For this option, students should draw on knowledge\ngained in class and additional independent research to analyze one or more popular television shows, films,\nwebsites, or books. A great number of recent popular cultural productions depict either historical periods or\nkey themes we have studied in class. Do these productions present accurate accounts of the eras they depict?\nWhy or why not? What do they miss? What kinds of historiographical claims do they make?\nVideo Lecture: Using PowerPoint, Prezi, or some other program, students should produce a video lecture\nthat introduces and explains an historical event, person, social movement, or phenomenon that we did not\ndiscuss in class (or that we discussed only briefly). This lecture should include visual and/or media sources\nand a discussion of why the topic you have chosen matters to the history of gender and sexuality. This option\nis a good alternative to the analytical essay if the sources you hope to analyze are visual in nature, or if you\nwould like your research to reach audiences beyond our course. Be sure to cite all of your sources (even visual\nones) in the lecture or in a bibliography at the end.\nOral History: For this option, students should conduct an informal oral history interview with one or more\nwilling interlocutors who were alive for at least two decades during the twentieth century. These interviews may\nfocus on a particular event or topic (a good option if you interview more than one person), or they can focus\non a single individual's experience of change in the realms of gender and sexuality over the course of their\nlifetime. After completing any interviews, students should craft an essay that places the experiences of their\ninterview subject(s) in historical context. These essays should include citations and a bibliography that\ndescribes the sources you have drawn on to contextualize your interview(s).\nManifesto: Drawing on examples from class, students who select this option should craft a manifesto that\nprovides a platform for future activism in the realms of gender and/or sexuality. Students who select this\noption should include citations and a brief bibliographic essay or annotated bibliography that describes the\nsources and materials you have consulted to craft your manifesto.\nGuide for Social Activism in the Twenty-First Century: This option is similar to the Manifesto option above.\nRather than state specific goals and demands, however, this final project option should offer analysis of social\nmovements from the past with a focus on what worked (or did not work) in movements that attempted to\ncreate social/political/cultural change in the realms of gender and sexuality. It should also offer some kind of\nvision for what you think is necessary to create lasting and successful movements in the future.\nWGS.110J/21H.108J Final Project Assignment\n\nSelected Online Databases Housing Primary Source Documents\nThis list in not exhaustive - students who hope to use databases not listed here should contact me\nMIT Libraries WGS Site: https://libguides.mit.edu/c.php?g=175868&p=1160561\nIncludes links to several primary source databases offered through the MIT Libraries, as well as\nonline.\nOut History Archives: http://www.outhistory.org/\nDiscovering American Women's history Online:\nhttp://digital.mtsu.edu/cdm/landingpage/collection/women\nChicago Women's Liberation Union History Online: http://www.cwluherstory.org/\nHartman Center for Sales, Advertising, and Marketing History Digitized Collections:\nhttp://library.duke.edu/rubenstein/hartman/digitized\nThis is a particularly rich resource. I went to \"Ad*Access,\" then clicked the \"Subject\" tab, then\nselected \"Beauty and Hygiene,\" and got access to over 2,300 digitized ads from 1911-1955!\nACT UP Oral History Project: http://www.actuporalhistory.org/interviews/index.html\nAIDS Education Posters Online: http://aep.lib.rochester.edu/\nBefore Roe v. Wade: Voices that Shaped the Abortion Debate http://documents.law.yale.edu/before-roe\nDigital Transgender Archive: https://www.digitaltransgenderarchive.net/\nFeminist Majority Foundation Feminist Chronicles, 1953-1993:\nhttp://www.feminist.org/research/chronicles/chronicl.html\nDigital Public Library of America - LGBT:\nhttp://dp.la/search?q=lgbt&subject[]=LGBT&utf8=%E2%9C%93\nWomen's Liberation Movement Print Culture: http://library.duke.edu/digitalcollections/wlmpc/\nLesbian Herstory Archives - Mabel Hampton Oral History:\nhttp://herstories.prattinfoschool.nyc/omeka/exhibits/show/mabel-hampton-oral-history\nWGS.110J/21H.108J Final Project Assignment\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\nWGS.110J / 21H.108J Sexual and Gender Identities in the Modern United States\nSpring 2024\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    }
  ]
}