{
  "course_name": "Signals and Systems",
  "course_description": "This course was developed in 1987 by the MIT Center for Advanced Engineering Studies. It was designed as a distance-education course for engineers and scientists in the workplace.\nSignals and Systems is an introduction to analog and digital signal processing, a topic that forms an integral part of engineering systems in many diverse areas, including seismic data processing, communications, speech processing, image processing, defense electronics, consumer electronics, and consumer products.\nThe course presents and integrates the basic concepts for both continuous-time and discrete-time signals and systems. Signal and system representations are developed for both time and frequency domains. These representations are related through the Fourier transform and its generalizations, which are explored in detail. Filtering and filter design, modulation, and sampling for both analog and digital systems, as well as exposition and demonstration of the basic concepts of feedback systems for both analog and digital systems, are discussed and illustrated.",
  "topics": [
    "Engineering",
    "Electrical Engineering",
    "Digital Systems",
    "Signal Processing",
    "Systems Engineering",
    "Computational Modeling and Simulation",
    "Engineering",
    "Electrical Engineering",
    "Digital Systems",
    "Signal Processing",
    "Systems Engineering",
    "Computational Modeling and Simulation"
  ],
  "syllabus_content": "",
  "files": [
    {
      "category": "Lecture Notes",
      "title": "Lecture 1, Introduction",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/res-6-007-signals-and-systems-spring-2011/e6c75426e220f1a406b0b9be1f55bbc1_MITRES_6_007S11_lec01.pdf",
      "content": "Introduction\nThis first lecture is intended to broadly introduce the scope and direction of\nthe course. We are concerned, of course, with signals and with systems that\nprocess signals. Signals can be categorized as either continuous-time signals,\nfor which the independent variable is a continuous variable, or discrete-time\nsignals, for which the independent variable is an integer. Examples of con-\ntinuous-time signals include the sound pressure at a microphone as a function\nof time or image brightness as a function of two spatial variables. In the first\ncase the signal is a one-dimensional signal, in the second a two-dimensional\nsignal. Common examples of discrete-time signals are economic time series,\nsuch as the daily or weekly stock market index, antenna arrays, etc. While\nthese examples include both one-dimensional and two-dimensional signals,\nour detailed discussions in this course focus only on one-dimensional signals.\nMany of the general concepts and results, however, will be illustrated with\ntwo-dimensional signals, specifically images.\nThere are some very strong similarities and also some very important dif-\nferences between discrete-time signals and systems and continuous-time sig-\nnals and systems. Discussing both classes together provides an opportunity to\nshare intuition and to use both the similarities and the differences as a further\nemphasis of important concepts. Furthermore, as we will see as the course\nproceeds, current technology provides an important mechanism-through\nthe concept of sampling-for converting between continuous-time and dis-\ncrete-time signals. It is often very advantageous to process continuous-time\nsignals by first converting them to discrete time.\nFor the most part, our discussion of systems throughout is restricted to a\nspecific class, namely linear, time-invariant systems. Extremely powerful\ntools and techniques exist for both analysis and design of this class of sys-\ntems. In particular, in discussing this class of systems we develop signal and\nsystem representations in both the time domain and thefrequency domain.\nThese two domains of representation are tied together through the Fourier\ntransform, which we discuss and exploit in considerable detail.\nAs I emphasize in this lecture, it is extremely important to use both the\ncourse text and the video course manual in conjunction with watching the\ntapes. The material presented in the lectures is very closely tied to the text. In\n\nSignals and Systems\n1-2\naddition, the recommended and optional problems in the video course man-\nual have been carefully chosen to emphasize and amplify important issues\nraised in the associated lecture. Consequently, it is extremely important that,\nin addition to watching a taped lecture, you do the accompanying suggested\nreading and recommended problems before proceeding to the next lecture.\nSuggested Reading\nChapter 1, page 1\nSection 2.0, Introduction, page 7\nSection 2.1, Signals, pages 7-12\n\nIntroduction\nMARKERBOARD\n1.1 (a)\nDEMONSTRATION\n1.1\nAn example of an\nimage. [Jean Baptiste\nJoseph Fourier from\nOeuvre de Fourier,\nVol. II (Paris: Gauthier-\nVillars et Fils, 1890).]\nI\n\nSignals and Systems\nDEMONSTRATION\n1.2\nAerial photograph of\nroads with cloud\ncover.\nI\n\nIntroduction\nTRANSPARENCY\n1.1\nDow Jones weekly\nstock market index\nover a i-year period.\nI\n\nSignals and Systems\n1-6\nMARKERBOARD\n1.2 (a)\nXSt)\n--.\ns\nk\nRekittw\nxtn~j\nDEMONSTRATION\n1.3\nDemonstration of the\nenhancement of\nCaruso recordings.\n\nJan\nJan\nJan\nJan\nJan\nJan\nIntroduction\nJan\nJan\n350-\nd\n-\nt\nt\nt\nt\nJan\nJan\nJan\nJan\nJan\nJan\nJan\nt\nt\nt\nt\nt\nt\nJan\nJan\nJan\nJan\nJan\nJan\nJan\nTRANSPARENCY\n1.2\nDow Jones weekly\nstock market index\nover a 10-year period.\nTRANSPARENCY\n1.3\nThe effect of filtering\nthe Dow Jones weekly\nstock market index.\nt\nt\nt\nt\nt\nt\nt\nt\nt\n\nSignals and Systems\nDEMONSTRATION\n1.4\nAerial photograph of\nroads with cloud\ncover.\nDEMONSTRATION\n1.5\nEnhancement of the\naerial photograph\nshown in Demon-\nstration 1.4.\n\nIntroduction\nMARKERBOARD\n1.2 (a)\nxt s\nx 4EWlI\n(veo v-\nrkim m AW\nL\nMARKERBOARD\n1.2 (b)\nem*\nt, zaH\nMmercomv'edtiw*\n4eebo~\n\nSignals and Systems\nDEMONSTRATION\n1.6\nPreview of inverted\npendulum\ndemonstration.\nx l\nra~~ed toi~\nAvmlgs'if, asrd\nRe Pr~cnto I\n)(Cf\nLae aTcr s.-\nWk\nf\ni~-n S\nr Wx\nMARKERBOARD\n1.2(c)\n\nIntroduction\n1-11\nDEMONSTRATION\n1.7\nPreview of\nglockenspiel note\ndemonstration.\nI\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nResource: Signals and Systems\nProfessor Alan V. Oppenheim\nThe following may not correspond to a particular course on MIT OpenCourseWare, but has been\nprovided by the author as an individual learning resource.\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture 2, Signals and Systems: Part I",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/res-6-007-signals-and-systems-spring-2011/b061322022d65a4bc2ed2e2d3c54d3c5_MITRES_6_007S11_lec02.pdf",
      "content": "Signals and Systems:\nPart I\nIn this lecture, we consider a number of basic signals that will be important\nbuilding blocks later in the course. Specifically, we discuss both continuous-\ntime and discrete-time sinusoidal signals as well as real and complex expo-\nnentials.\nSinusoidal signals for both continuous time and discrete time will be-\ncome important building blocks for more general signals, and the representa-\ntion using sinusoidal signals will lead to a very powerful set of ideas for repre-\nsenting signals and for analyzing an important class of systems. We consider a\nnumber of distinctions between continuous-time and discrete-time sinusoidal\nsignals. For example, continuous-time sinusoids are always periodic. Further-\nmore, a time shift corresponds to a phase change and vice versa. Finally, if we\nconsider the family of continuous-time sinusoids of the form A cos wot for dif-\nferent values of wo, the corresponding signals are distinct. The situation is\nconsiderably different for discrete-time sinusoids. Not all discrete-time sinu-\nsoids are periodic. Furthermore, while a time shift can be related to a change\nin phase, changing the phase cannot necessarily be associated with a simple\ntime shift for discrete-time sinusoids. Finally, as the parameter flo is varied in\nthe discrete-time sinusoidal sequence Acos(flon + 4), two sequences for\nwhich the frequency flo differs by an integer multiple of 27r are in fact indistin-\nguishable.\nAnother important class of signals is exponential signals. In continuous\ntime, real exponentials are typically expressed in the form cet, whereas in dis-\ncrete time they are typically expressed in the form ca\".\nA third important class of signals discussed in this lecture is continuous-\ntime and discrete-time complex exponentials. In both cases the complex ex-\nponential can be expressed through Euler's relation in the form of a real and\nan imaginary part, both of which are sinusoidal with a phase difference of 'N/2\nand with an envelope that is a real exponential. When the magnitude of the\ncomplex exponential is a constant, then the real and imaginary parts neither\ngrow nor decay with time; in other words, they are purely sinusoidal. In this\ncase for continuous time, the complex exponential is periodic. For discrete\n\nSignals and Systems\n2-2\ntime the complex exponential may or may not be periodic depending on\nwhether the sinusoidal real and imaginary components are periodic.\nIn addition to the basic signals discussed in this lecture, a number of ad-\nditional signals play an important role as building blocks. These are intro-\nduced in Lecture 3.\nSuggested Reading\nSection 2.2, Transformations of the Independent Variable, pages 12-16\nSection 2.3.1, Continuous-Time Complex Exponential and Sinusoidal Signals,\npages 17-22\nSection 2.4.2, Discrete-Time Complex Exponential and Sinusoidal Signals,\npages 27-31\nSection 2.4.3, Periodicity Properties of Discrete-Time Complex Exponentials,\npages 31-35\n\nSignals and Systems: Part I\n2-3\nIDAL SIGNAL\nTRANSPARENCY\n2.1\nContinuous-time\nsinusoidal signal\nindicating the\ndefinition of ampli-\ntude, frequency,\nand phase.\n0W0\nt\niallest To\nTRANSPARENCY\n2.2\nRelationship between\na time shift and a\nchange in phase for a\ncontinuous-time\nsinusoidal signal.\n\nSignals and Systems\nTRANSPARENCY\n2.3\nIllustration of the\nsignal A cos wot as an\neven signal.\nx(t) = A cos wot\nA\nPeriodic:\nEven:\n2r\nWO A\nx(t) = x(-t)\nTRANSPARENCY\n2.4\nIllustration of the\nsignal A sin wot as an\nodd signal.\nA cos (w t - -ff)\n-\nx(t) =\nA sin wot\nA cos [ w(t-\n)]\nPeriodic:\nx(t) = x(t + TO)\nx(t) =-x(-t)\nOdd:\n-----------\nr\nV\n\nSignals and Systems: Part I\nTime Shift => Phase Change\n= A cos [Mnn + E20n0]\nTRANSPARENCY\n2.5\nIllustration of\ndiscrete-time\nsinusoidal signals.\nTRANSPARENCY\n2.6\nRelationship between\na time shift and a\nphase change for\ndiscrete-time\nsinusoidal signals. In\ndiscrete time, a time\nshift always implies a\nphase change.\nA cos [920(n + no)]\n\nSignals and Systems\n2-6\nTRANSPARENCY\n2.7\nThe sequence\nA cos flon illustrating\nthe symmetry of an\neven sequence.\np = 0\nx[n] =A cos 0 n\n.00\neven:\nx[n] = x[-n]\nTRANSPARENCY\n2.8\nThe sequence\nA sin flon illustrating\nthe antisymmetric\nproperty of an odd\nsequence.\nA cos (En -\n)\nx[n] =\nA sin E2 n\nA cos [W2(n - no)]\nn =I\nodd: x[n] = -x [-n]\n0ee\nn\n71'\n\nSignals and Systems: Part I\n2-7\nTime Shift => Phase Change\nA cos [20(n + no)]\nTime Shift\n= A cos [Mon + 9 0n0 ]\n<=\nA cos [92 0(n + no)] =\nPhase Change\nA cos [2 n ++J\nTRANSPARENCY\n2.9\nFor a discrete-time\nsinusoidal sequence a\ntime shift always\nimplies a change in\nphase, but a change in\nphase might not imply\na time shift.\nx[n] = A cos (Wn + #)\nPeriodic?\nx[n] = x [n + N]\nA cos [20(n + N) + #]\nsmallest integer N\n= A cos [20\n= period\nn + 2 N + #]\ninteger multiple of 27r ?\nPeriodic = > 920 N\n27rm\n27rm\nN,m must be integers\nsmallest N (if any) = period\nTRANSPARENCY\n2.10\nThe requirement onne\nfor a discrete-time\nsinusoidal signal to be\nperiodic.\n\nSignals and Systems\nTRANSPARENCY\n2.11\nSeveral sinusoidal\nsequences illustrating\nthe issue of\nperiodicity.\nS31\np= 0\nTI\nI\n00T0I 1IT,.\nTRANSPARENCY\n2.12\nSome important\ndistinctions between\ncontinuous-time and\ndiscrete-time\nsinusoidal signals.\nA cos(oot + #)\nDistinct signals for distinct\nvalues of wo\nPeriodic for any choice of o\nA cos(E 0n + G)\nIdentical signals for values of\nEo separated by 27r\nPeriodic only if\n_ 21rm\no\nN\nfor some integers N > 0 and m\n'T\nTI TI\nI\n~TI\nH,.TT~\nGo*\nn\nese\n\" 1 0 1\n- a\nIn\nI 1 0 1\n\nSignals and Systems: Part I\nSINUSOIDAL SIGNALS AT DISTINCT FREQUENCIES:\nContinuous time:\nx 1 (t) = A cos(w 1 t +)\nx 2 (t) = A cos (w 2t +)\nDiscrete time:\nx, [n] = A cos [M, n + ]\nx2 [n] = A cos[2 2n + #]\nIf\nw2\nThen x2 (t) # x1 (t)\nIf 22\n1 + 27rm\nThen x2 [n] = x, [n]\nTRANSPARENCY\n2.13\nContinuous-time\nsinusoidal signals are\ndistinct at distinct\nfrequencies. Discrete-\ntime sinusoidal signals\nare distinct only over a\nfrequency range of 2,.\nREAL EXPONENTIAL: CONTINUOUS-TIME\nx(t) = Ceat\nC and a are real numbers\nX (t)\nC\na >0\na <0\nTRANSPARENCY\n2.14\nIllustration of\ncontinuous-time real\nexponential signals.\nTime Shift <=> Scale Change\nCea(t + to) = Ceato eat\n\nSignals and Systems\n2-10\nTRANSPARENCY\n2.15\nIllustration of\ndiscrete-time real\nexponential\nsequences.\nREAL EXPONENTIAL: DISCRETE-TIME\nx[n] = Ceon = Can\nC,a are real numbers\na <\nn a l\nTRANSPARENCY\n2.16\nContinuous-time\ncomplex exponential\nsignals and their\nrelationship to\nsinusoidal signals.\nCOMPLEX EXPONENTIAL: CONTINUOUS-TIME\nx(t) = Ceat\nC and a are complex numbers\nC= ICI ej6\na = r + jo\nx(t) = 0 e jo e (r + jcoo)t\n= ICI ert ej(wot + 0)\nEuler's Relation: cos( 0t + 0) + j sin(w ot + 0) = ej(wot + 0)\nx(t) = IC i ert cos(cot + 0) + jl |C ert sin(wot+ 0)\nL a >0\na>0\nn Jal <1\n\nSignals and Systems: Part I\n2-11\nTRANSPARENCY\n2.17\nSinusoidal signals with\nexponentially growing\nand exponentially\ndecaying envelopes.\nCOMPLEX EXPONENTIAL: DISCRETE-TIME\nx[n] = Can\nC and a are complex numbers\nC = ICI eji\na= 1al ei\nx [n] = C e j (lal ejo)\nn\n= IC 1al n e j(\non + 0)\nEuler's Relation: cos(2 0n + 0) + j sin(&20 n + 0)\nx[n] = ICI lal n cos(92on + 0) + j IC I|al n sin(92on + 0)\n|al = 1 => sinusoidal real and imaginary parts\nCe jon periodic ?\nTRANSPARENCY\n2.18\nDiscrete-time complex\nexponential signals\nand their relationship\nto sinusoidal signals.\n\nSignals and Systems\n2-12\nTRANSPARENCY\n2.19\nSinusoidal sequences\nwith geometrically\ngrowing and\ngeometrically\ndecaying envelopes.\n|al > I\nlal <I\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nResource: Signals and Systems\nProfessor Alan V. Oppenheim\nThe following may not correspond to a particular course on MIT OpenCourseWare, but has been\nprovided by the author as an individual learning resource.\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture 3, Signals and Systems: Part II",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/res-6-007-signals-and-systems-spring-2011/a21157f121ca5ba3d946766a5d387018_MITRES_6_007S11_lec03.pdf",
      "content": "Signals and Systems:\nPart II\nIn addition to the sinusoidal and exponential signals discussed in the previous\nlecture, other important basic signals are the unit step and unit impulse. In\nthis lecture, we discuss these signals and then proceed to a discussion of sys-\ntems, first in general and then in terms of various classes of systems defined\nby specific system properties.\nThe unit step, both for continuous and discrete time, is zero for negative\ntime and unity for positive time. In discrete time the unit step is a well-defined\nsequence, whereas in continuous time there is the mathematical complication\nof a discontinuity at the origin. A similar distinction applies to the unit im-\npulse. In discrete time the unit impulse is simply a sequence that is zero ex-\ncept at n = 0, where it is unity. In continuous time, it is somewhat badly be-\nhaved mathematically, being of infinite height and zero width but having a\nfinite area.\nThe unit step and unit impulse are closely related. In discrete time the\nunit impulse is the first difference of the unit step, and the unit step is the run-\nning sum of the unit impulse. Correspondingly, in continuous time the unit im-\npulse is the derivative of the unit step, and the unit step is the running integral\nof the impulse. As stressed in the lecture, the fact that it is a first difference\nand a running sum that relate the step and the impulse in discrete time and a\nderivative and running integral that relate them in continuous time should not\nbe misinterpreted to mean that a first difference is a good \"representation\" of\na derivative or that a running sum is a good \"representation\" of a running inte-\ngral. Rather, for this particular situation those operations play corresponding\nroles in continuous time and in discrete time.\nAs indicated above, there are a variety of mathematical difficulties with\nthe continuous-time unit step and unit impulse that we do not attempt to ad-\ndress carefully in these lectures. This topic is treated formally mathematically\nthrough the use of what are referred to as generalized functions, which is a\nlevel of formalism well beyond what we require for our purposes. The essen-\ntial idea, however, as discussed in Section 3.7 of the text, is that the important\naspect of these functions, in particular of the impulse, is not what its value is\nat each instant of time but how it behaves under integration.\n\nSignals and Systems\n3-2\nIn this lecture we also introduce systems. In their most general form, sys-\ntems are hard to deal with analytically because they have no particular prop-\nerties to exploit. In other words, general systems are simply too general. We\ndefine, discuss, and illustrate a number of system properties that we will find\nuseful to refer to and exploit as the lectures proceed, among them memory,\ninvertibility, causality, stability, time invariance, and linearity. The last two,\nlinearity and time invariance, become particularly significant from this point\non. Somewhat amazingly, as we'll see, simply knowing that a system is linear\nand time-invariant affords us an incredibly powerful array of tools for analyz-\ning and representing it. While not all systems have these properties, many do,\nand those that do are often easiest to understand and implement. Consequent-\nly, both continuous-time and discrete-time systems that are linear and time-\ninvariant become extremely significant in system design, implementation, and\nanalysis in a broad array of applications.\nSuggested Reading\nSection 2.4.1, The Discrete-Time Unit Step and Unit Impulse Sequences, pages\n26-27\nSection 2.3.2, The Continuous-Time Unit Step and Unit Impulse Functions,\npages 22-25\nSection 2.5, Systems, pages 35-39\nSection 2.6, Properties of Systems, pages 39-45\n\nSignals and Systems: Part II\nS[n\nu [n] -u[n-i]\nn\nO0I\nu [n]\nu [n - I]\nu [n]-u [n-1]\nTRANSPARENCY\n3.1\nDiscrete-time unit step\nand unit impulse\nsequences.\nTRANSPARENCY\n3.2\nThe unit impulse\nsequence as the first\nbackward difference\nof the unit step\nsequence.\n\nSignals and Systems\n3-4\nTRANSPARENCY\n3.3\nThe unit step sequence\nas the running sum of\nthe unit impulse.\nTRANSPARENCY\n3.4\nThe unit step sequence\nexpressed as a\nsuperposition of\ndelayed unit impulses.\nn\nu[n]=\nS 8[m]\nms-C(\nn < 0\n8 Im]\nn\nO\nn>O\n8[Im]\n\nSignals and Systems: Part II\nUNIT STEP FUNCTION: CONTINUOUS -TIME\n{0\nt < 0\nu (t)=\nt > 0\nu(t )\nt\nO (\nt\nu(t) = u(t) as A -\nUNIT IMPULSE FUNCTION\n-du(t)\n6(t)\ndd t\n5(t)\n6 (t)\nduA(t)\ndt\n= 5A(t) as\nTRANSPARENCY\n3.5\nThe continuous-time\nunit step function.\nTRANSPARENCY\n3.6\nThe definition of the\nunit impulse as the\nderivative of the unit\nstep.\nA--0\n\nSignals and Systems\n3-6\nTRANSPARENCY\n3.7\nInterpretation of the\ncontinuous-time unit\nimpulse as the limiting\nform of a rectangular\npulse which has unit\narea and for which\nthe pulse width\napproaches zero.\nTRANSPARENCY\n3.8\nThe unit step\nexpressed as the\nrunning integral of the\nunit impulse.\nt)\nA\n8 (t)\no\nt\nk8(t)\narea\n=\nI\nheight = \" 00 \"\nwidth = \"0\"\narea\n=\nI\n\nSignals and Systems: Part II\n3-7\nTRANSPARENCY\n3.9\nDefinition of a system.\nx (t )\nx (t)\nx[n]\nx[n]\nContinuous -time\nsystem\n10y (t )\n-0\ny(t)\ny [n]\n-e\ny[n]\nTRANSPARENCY\n3.10\nInterconnection of\ntwo systems in\ncascade.\nCascade\nXI\nO\nyI\nxi\nSystem\nyI\n~ I\ny\nY2a X1\nyI\n\nSignals and Systems\nTRANSPARENCY\n3.11\nInterconnection of\ntwo systems in\nparallel.\nTRANSPARENCY\n3.12\nFeedback inter-\nconnection of two\nsystems.\nfeedback\nxI x+y2\nx2 =\n\nSignals and Systems: Part II\n6n(FYI Y-\nC-=E39\n(tA\nP 10-\n-t s*'0\nT N\\ ERTAILMT(\nXr~3\nML'\n-V\n?\nT=crse o1 A\nN\n~y)\nCo\nkA%'Q4'\nepevsJi on\nom,-\n*\nPe ;o r\nor*\nIud\n+0\nAt\nTime\nOr .\nS4s4cm can,'t aAtic.,(AA\nor *\nA, C4 --\n'Z C+)\nSame\nFo\nda5rttv-\nTI me\n'\\\nAeo\n\"e\nss.\nEva\"'\nIe-.\nIr3\nCXn&-,3\nt xt\nEt7)\nx Lo3\nl\ni\nex\\\nd\nJr\n-z> -For everbouvded\ninput 'de o ,p\ni\nb outnd ed\nft.t\n-i-i-TILL--- ~rL'\nL-A2\nI'\n~\ny+)IM\nS4-obe.\nMARKERBOARD\n3.1\nC\nLO\nt\nC4 k\n, AC\nd~~c\nP.\nMARKERBOARD\n3.2\n'A\n(T)J-L\n. I j-A tr al LM) +\nILVl\nGO11,11,0111-1\n\nSignals and Systems\n3-10\nSTvnvariaic.\nc (t)-w\nt)\n(~C~\nIyy3: ~\nI Me Tvarw~\n,\nO4\nb\n0 )\n,6,ts'cawst\nLo\nTvt1frl'w\nDEMONSTRATION\n3.1\nIllustration of an\nunstable system.\nMARKERBOARD\n3.3\n~)C.h1hpk\nC-.. 4 OTr\n__j\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nResource: Signals and Systems\nProfessor Alan V. Oppenheim\nThe following may not correspond to a particular course on MIT OpenCourseWare, but has been\nprovided by the author as an individual learning resource.\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture 4, Convolution",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/res-6-007-signals-and-systems-spring-2011/27da9a018e92fc06d2cf1fbce5cd3e71_MITRES_6_007S11_lec04.pdf",
      "content": "Convolution\nIn Lecture 3 we introduced and defined a variety of system properties to\nwhich we will make frequent reference throughout the course. Of particular\nimportance are the properties of linearity and time invariance, both because\nsystems with these properties represent a very broad and useful class and be-\ncause with just these two properties it is possible to develop some extremely\npowerful tools for system analysis and design.\nA linear system has the property that the response to a linear combina-\ntion of inputs is the same linear combination of the individual responses. The\nproperty of time invariance states that, in effect, the system is not sensitive to\nthe time origin. More specifically, if the input is shifted in time by some\namount, then the output is simply shifted by the same amount.\nThe importance of linearity derives from the basic notion that for a linear\nsystem if the system inputs can be decomposed as a linear combination of\nsome basic inputs and the system response is known for each of the basic in-\nputs, then the response can be constructed as the same linear combination of\nthe responses to each of the basic inputs. Signals (or functions) can be decom-\nposed as a linear combination of basic signals in a wide variety of ways. For\nexample, we might consider a Taylor series expansion that expresses a func-\ntion in polynomial form. However, in the context of our treatment of signals\nand systems, it is particularly important to choose the basic signals in the ex-\npansion so that in some sense the response is easy to compute. For systems\nthat are both linear and time-invariant, there are two particularly useful\nchoices for these basic signals: delayed impulses and complex exponentials.\nIn this lecture we develop in detail the representation of both continuous-\ntime and discrete-time signals as a linear combination of delayed impulses\nand the consequences for representing linear, time-invariant systems. The re-\nsulting representation is referred to as convolution. Later in this series of lec-\ntures we develop in detail the decomposition of signals as linear combina-\ntions of complex exponentials (referred to as Fourier analysis) and the\nconsequence of that representation for linear, time-invariant systems.\nIn developing convolution in this lecture we begin with the representa-\ntion of discrete-time signals and linear combinations of delayed impulses. As\nwe discuss, since arbitrary sequences can be expressed as linear combina-\ntions of delayed impulses, the output for linear, time-invariant systems can be\n\nSignals and Systems\n4-2\nexpressed as the same linear combination of the system response to a delayed\nimpulse. Specifically, because of time invariance, once the response to one\nimpulse at any time position is known, then the response to an impulse at any\nother arbitrary time position is also known.\nIn developing convolution for continuous time, the procedure is much\nthe same as in discrete time although in the continuous-time case the signal is\nrepresented first as a linear combination of narrow rectangles (basically a\nstaircase approximation to the time function). As the width of these rectan-\ngles becomes infinitesimally small, they behave like impulses. The superposi-\ntion of these rectangles to form the original time function in its limiting form\nbecomes an integral, and the representation of the output of a linear, time-in-\nvariant system as a linear combination of delayed impulse responses also be-\ncomes an integral. The resulting integral is referred to as the convolution in-\ntegral and is similar in its properties to the convolution sum for discrete-time\nsignals and systems. A number of the important properties of convolution that\nhave interpretations and consequences for linear, time-invariant systems are\ndeveloped in Lecture 5. In the current lecture, we focus on some examples of\nthe evaluation of the convolution sum and the convolution integral.\nSuggested Reading\nSection 3.0, Introduction, pages 69-70\nSection 3.1, The Representation of Signals in Terms of Impulses, pages 70-75\nSection 3.2, Discrete-Time LTI Systems: The Convolution Sum, pages 75-84\nSection 3.3, Continuous-Time LTI Systems: The Convolution Integral, pages\n88 to mid-90\n\nc-7T:\nX1I\nTkiv%\n\\\nr\n-\nL ,tY%3\n- InAvr\n-\ncausal\n'4s~w\nSTM rEcY:\n% clecorpose\npt 5 pwL\ninvo\nGL Lineer\ncomet'ncL4Zo1.\no C\n0'sM\nbaSic\nV\nSina\n-tha. respolase\neqs\nto\nLT I SWs ens-\ne\ng\nConvo\n+\nCo,\nx[-I] x[0] 1\nx[2]\n-l IOJ\nfr 2\nx[0]\nx[O]8a[n]\n-.- e--.-0-\nn\n-1 0 I2\nX[1] x[1]8[n-1]\n-1 0 I 2\nx[-I]8[n+1]\n0-0\n--\n*-\nn\n-1 0 I 2\nX[-] x [-2]8[n +2]\n0--0-0\nn\n-1 0 1 2\nx[o]8[n]+x(I] 8[n -1]\n+ x [-I]8[n+ ]+.--\n+X kr\n=2 x[k]8[n-k]\nk= -c\nTRANSPARENCY\n4.1\nA general discrete-\ntime signal expressed\nas a superposition of\nweighted, delayed unit\nimpulses.\nConvolution\nMARKERBOARD\n4.1\n/9\nvA\n6.~i\nI\nrkv\"O' \"TVNVQI;Q,,c.I,\n\nSignals and Systems\nTRANSPARENCY\n4.2\nThe convolution sum\nfor linear, time-\ninvariant discrete-time\nsystems expressing\nthe system output as a\nweighted sum of\ndelayed unit impulse\nresponses.\njj )x[\nx[2]\n-1 0 I 2\nX 10{\nx[0]8[n]\nn\n-I 0 1 2\nX x[1]8[n+1]\nx[ 2 ]\nx[-2]8[n+2]\n91T\nn\n-1 0 i 2\n-0-0-0-0--\nm-\nx [0] h [n]\nx [ 1] h [n-I]\nx [-I] h [n+1.\nx [-2] h [n.2]\nTRANSPARENCY\n4.3\nOne interpretation of\nthe convolution sum\nfor an LTI system.\nEach individual\nsequence value can be\nviewed as triggering a\nresponse; all the\nresponses are added\nto form the total\noutput.\nx[n] =E\nk = -o\nx[k] S[n-k]\nLinear System:\n+0n\ny [n] =E\nk = - 010\nx[k] hk [n]\nIf Time-invariant:\nhk [n] = h [n-k]\nLTI: y[n] + o0\n=E\nx[k] h[n - k]I\nConvolution Sum\n5 [n - k] -\nh [n]\n\nConvolution\n4-5\nx(-2A)\nx(-2A)&a(t+2A)A\n-2A -A\nt\n-A 0\nt\nI X (0)\nX (0) BA\nt A\n0 A\nt\n- xA)\nx (A) 86 (t-A)\nA 2A\nt\nx(o) 6A(t) A + x(A) 6A(t\n+ x(- A) 6A(t + A)A+...\nx(k A) 6,(t - k A) A\n= lim 1\nx(k A) S(t - k A) A\nA+O k=-oc\nTRANSPARENCY\n4.4\nApproximation of a\ncontinuous-time signal\nas a linear\ncombination of\nweighted, delayed,\nrectangular pulses.\n[The amplitude of the\nfourth graph has been\ncorrected to read\nx(O).]\nTRANSPARENCY\n4.5\nAs the rectangular\npulses in Trans-\nparency 4.4 become\nincreasingly narrow,\nthe representation\napproaches an\nintegral, often referred\nto as the sifting\nintegral.\nx(t)\nX(t)\nx(t)\n+W\nf\nx(,r) 6(t -,r) d-r\n--00\n\nSignals and Systems\n4-6\nTRANSPARENCY\n4.6\nDerivation of the\nconvolution integral\nrepresentation for\ncontinuous-time LTI\nsystems.\nx(t) =\nEim\n(\nx(k A)\n'L+0 k=-o\nLinear System:\n+o\ny(t) =\nx(kA)\n+O k=- o\n+00\n=f\nxT) hT(t) dr\nIf Time-Invariant:\nhkj t) = ho(t - kA)\nh,(t)\n= he (t - r)\nLTI:\n56(t - kA) A\nhk(t)\nA\n+01\nv(t)\nf x(r) h(t-7) dr-\n-0\nConvolution Integral\nTRANSPARENCY\n4.7\nInterpretation of the\nconvolution integral as\na superposition of the\nresponses from each\nof the rectangular\npulses in the\nrepresentation of the\ninput.\nx(t)\nti\nt\nx (0)\nx(A)\nx(kA)\nAA\nt\nx(t)\nt\nx (0) h Mt\nkA\nt\ny(t)\noA\ny(t)\noA\n\nConvolution\n4-7\nConvolution Sum:\n+0o\nx[n] =E x[k]\nk= -0ok\ny [n]\n=\nx [k]\nk= -o00\nS[n-k]\nh[n-k] =x[n] * h[n]\nConvolution Integral:\nx(t)\ny(t)\n+00\n=f\nx(-) 6(t-r) dr\n+fd\n=\nX(r) h(t-,r) dr- = x(t) -* h(t)\ny [n]\nZ\nx[k]h [n-k]\nx [n]= u [n]\nh[n]=an u[n]\nn\nt\nk\nn\nk\nx [n]\nh [n]\nx [k]\nh [n-k]\nTRANSPARENCY\n4.8\nComparison of the\nconvolution sum for\ndiscrete-time LTI\nsystems and the\nconvolution integral\nfor continuous-time\nLTI systems.\nTRANSPARENCY\n4.9\nEvaluation of the\nconvolution sum for\nan input that is a unit\nstep and a system\nimpulse response that\nis a decaying\nexponential for n > 0.\n\nSignals and Systems\nTRANSPARENCY\n4.10\nEvaluation of the\nconvolution integral\nfor an input that is a\nunit step and a system\nimpulse response that\nis a decaying\nexponential for t > 0.\ny(t)f\nx(r)h(t-r)dr\nx(t)\nu (t)\nh (t )=e~43\nu t)\nO\nt\nr\nt\nT\nMARKERBOARD\n4.2\nx (t)\nh (t)\nx (r)\nh (t-r)\n\nConvolution\nMARKERBOARD\n4.3\nv4egva.z:\nt).\nCt\nk Lt-T)aT\nt (0\nov0\nC-t\nTe\nLk (t - -C jT\no-\neoverkp ~3et ee\nh*O\nt,<0o\nt\nE J\nr) t\nL\nt\n1 U -e\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nResource: Signals and Systems\nProfessor Alan V. Oppenheim\nThe following may not correspond to a particular course on MIT OpenCourseWare, but has been\nprovided by the author as an individual learning resource.\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture 5, Properties of Linear, Time-Invariant Systems",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/res-6-007-signals-and-systems-spring-2011/431b597316940ea786c72a16b8cd6371_MITRES_6_007S11_lec05.pdf",
      "content": "Properties of Linear,\nTime-Invariant\nSystems\nIn this lecture we continue the discussion of convolution and in particular ex-\nplore some of its algebraic properties and their implications in terms of linear,\ntime-invariant (LTI) systems. The three basic properties of convolution as an\nalgebraic operation are that it is commutative, associative, and distributive\nover addition. The commutative property means simply that x convolved with\nh is identical with h convolved with x. The consequence of this property for\nLTI systems is that for a system with a specified input and impulse response,\nthe output will be the same if the roles of the input and impulse response are\ninterchanged. The associative property specifies that while convolution is an\noperation combining two signals, we can refer unambiguously to the convolu-\ntion of three signals without concern about how they are grouped pairwise.\nAs demonstrated in the lecture, the associative property combined with\nthe commutative property leads to an extremely important property of LTI\nsystems. Specifically, if we have several LTI systems cascaded together, the\noutput generated by an input to the overall cascade combination does not de-\npend on the order in which the systems are cascaded. This property of LTI\nsystems plays an extremely important role in system design, implementation,\nand analysis. It is generally not true for arbitrary systems that are not linear\nand time-invariant, and it represents one very important consequence of ex-\nploiting the properties of linearity and time invariance. The distributive prop-\nerty states that a signal convolved with the sum of two signals is identical to\nthe result of carrying out the convolution with each signal in the sum individ-\nually and then summing the result. The consequence of this for the intercon-\nnection of LTI systems is that a parallel combination can be collapsed into a\nsingle system whose impulse response is the sum of the two individual ones.\nIn looking at and understanding the algebraic properties of convolution, it is\nworthwhile to recognize that convolution as an algebraic property relates to\naddition in exactly the same way that multiplication relates to addition: that\nis, multiplication is commutative, associative, and distributive over addition.\n\nSignals and Systems\n5-2\nIn Lecture 3 we defined system properties in addition to linearity and\ntime invariance, specifically properties of memory, invertibility, stability, and\ncausality. While these properties are independent of linearity and time invar-\niance, for LTI systems they can be related to properties of the system impulse\nresponse. For example, if an LTI system is memoryless, then the impulse re-\nsponse must be a scaled impulse. If a system with impulse response h is in-\nvertible, then the impulse response hi of the inverse system has the property\nthat h convolved with hi is an impulse. For LTI systems an equivalent condi-\ntion to stability is that the impulse response be absolutely summable (discrete\ntime) or absolutely integrable (continuous time). If an LTI system is causal,\nthen its impulse response must be zero for t (or n) < 0; furthermore, if the im-\npulse response has this property, then the system is guaranteed to be causal.\nIn the process of discussing these properties for LTI systems, we discuss\nanother very important consequence of linearity-the fact that for a linear\nsystem (whether or not it is time-invariant), if the input is zero for all t (or n),\nthen the output is zero also.\nIn this lecture we illustrate the properties discussed above with some\nsystems. The problems associated with this lecture provide the opportunity to\nexplore these properties further.\nIn Lecture 3 in discussing the continuous-time impulse function, we indi-\ncated some inherent difficulty with defining the impulse simply as the limiting\nform of a rectangular pulse. We also suggested that the important properties\nof impulses relate not to what they are at each instant of time but to how they\nbehave under integration. Specifically, in the context of signal and system\nanalysis, the important property of impulses and what we call higher-order\nsingularity functions is not what they are but what they do under convolution.\nThis operational definition of impulses and derivatives of impulses is briefly\ntouched on at the end of this lecture.\nSuggested Reading\nSection 3.2, Discrete-Time LTI Systems: The Convolution Sum, pages 84-87\nSection 3.3, Continuous-Time LTI Systems: The Convolution Integral, pages\n90-95\nSection 3.4, Properties of Linear Time-Invariant Systems, pages 95-101\nSection 3.7, Singularity Functions, pages 120-124\n\nProperties of Linear, Time-Invariant Systems\nConvolution Sum:\n+00\nx[n] =\nx[k] 5[n-k]\nk= - \"\n+00\ny[n] =J x[k] h[n-k] =x[n] * h[n]\nk=-o\nConvolution Integral:\n+xt\nx1(t)\n=f\nx (r) 8 (t -T) dT\n-00\n+00\ny(t)\n=f\nX(T)\n-00\nh(t-T) dT = x(t)\n* h(t)\nTRANSPARENCY\n5.1\nThe convolution sum\nand convolution\nintegral.\nCommutative:\nx[n] * h [n]\n= h[n] *x[n]\nx(t) * h(t)\nu[n] -> au[n]\nu(t) * eatu(t)\n=\nh(t) *x(t)\n=anu[n] * u[n]\n= e-atu(t) *u(t)\nTRANSPARENCY\n5.2\nThe commutativity\nproperty of\nconvolution.\nI-\n\nSignals and Systems\n5-4\nTRANSPARENCY\n5.3\nThree algebraic\nproperties of\nconvolution.\nCommutative:\nx * h\nh * x\nAssociative:\nx *Ih 1* h2\n= x *h, I*\nh2\nDistributive:\nx * h + h2 =x *\n+ x * h 2\nTRANSPARENCY\n5.4\nAn interpretation of\nthe commutativity\nproperty.\nCommutative\ny= x* h\ny= h *x\nLTI System: output the some\nif input and impulse\nresponse interchanged\n\nProperties of Linear, Time-Invariant Systems\nTRANSPARENCY\n5.5\nOne consequence of\nthe algebraic\nproperties of\nconvolution is that LTI\nsystems can be\ncascaded in any order.\nTRANSPARENCY\n5.6\nOne consequence of\nthe distributive\nproperty of\nconvolution is that LTI\nsystems in parallel can\nbe collapsed into a\nsingle LTI system.\n\nSignals and Systems\nI\n-\n)\nIt\n0 ov ,vro o.4 (4\n->4-k\n(V~ -T\nXNVEMTlI L M\n~400\nV,00\nK0\np4mnpd eSPMC\noJt\nU\n'.~O\n-~Or\nU\nat\n-46~\n-ov- LII\n~ievs\ntV(*)O\nt<0o\nL\\T ea'\n'-t4ety\n,\nvx\n,c \\\n+9A 6\nS0\n-T\nQ74'0\nPcc\ndo.tov-:\n~\n-00\n,j\\n\n,kT-Y3\nYJi~V t\n0 ::::: cz\n00o\nnIIt\\\nCe\n>~ v~oI\n~z\n~-~~*'\n= JL\"N-13 + Nr-v'J\nMARKERBOARD\n5.1\nMARKERBOARD\n5.2\nI\nCOIIASOL I +\n\nProperties of Linear, Time-Invariant Systems\nXCO3\na(cL=8t\nAt+2*Sc*'\nu2 t\ntt\nSCn3*8tn3= 4(t\nS0y zc\"\n-T-\n8t*)\na- f |\nopera.*iadol De4ny+I'OW\njs)\ndXCJ\n+)t\n(;\nC4)\nd t\nXuc+\n* U)\ndt\nMARKERBOARD\n5.4\n\nSignals and Systems\nMARKERBOARD\n5.5\ndkxt)\nd kx(t)\nNote that dxjt\nshould read dt)\nin both places.\ndt\ndtk\nL 0Ct) 8tt)\n-A)\n_ d\nLA. +) =8C4)\nu. C-0= u,\nU\nt)Ut\n+\nkvtYO.Yrnf\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nResource: Signals and Systems\nProfessor Alan V. Oppenheim\nThe following may not correspond to a particular course on MIT OpenCourseWare, but has been\nprovided by the author as an individual learning resource.\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture 6, Systems Represented by Differential and Difference Equations",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/res-6-007-signals-and-systems-spring-2011/c7ac1086bd3994495536c05eb68d9afb_MITRES_6_007S11_lec06.pdf",
      "content": "Systems Represented by\nDifferential and\nDifference Equations\nAn important class of linear, time-invariant systems consists of systems rep-\nresented by linear constant-coefficient differential equations in continuous\ntime and linear constant-coefficient difference equations in discrete time.\nContinuous-time linear, time-invariant systems that satisfy differential equa-\ntions are very common; they include electrical circuits composed of resistors,\ninductors, and capacitors and mechanical systems composed of masses,\nsprings, and dashpots. In discrete time a wide variety of data filtering, time se-\nries analysis, and digital filtering systems and algorithms are described by dif-\nference equations.\nIn this lecture, we review the time-domain solution for linear constant-\ncoefficient differential equations and show how the same basic strategy ap-\nplies to difference equations. While this review is presented somewhat quick-\nly, it is assumed that you have had some prior exposure to differential\nequations and their time-domain solution, perhaps in the context of circuits\nor mechanical systems. In any case, in Lecture 9 after we have developed the\nFourier transform, we will see some more efficient (at least mathematically)\nways of obtaining the solution.\nIn considering the time-domain solution to linear constant-coefficient\ndifferential and difference equations, we should recognize a number of impor-\ntant features. Foremost is the fact that the differential or difference equation\nby itself specifies a family of responses only for a given input x(t). In particu-\nlar we can always add to any solution another solution that satisfies the\nhomogeneous equation corresponding to x(t) or x(n) being zero. Thus, for\nunique specification of a system, in addition to the differential or difference\nequation some auxiliary conditions (for example, a set of initial conditions)\nare needed that will specify the arbitrary constants present in the homo-\ngeneous solution.\nIn Lecture 5 we showed that a linear, time-invariant system has the prop-\nerty that if the input is zero for all time, then the output will also be zero for all\ntime. Consequently, a linear, time-invariant system specified by a linear con-\nstant-coefficient differential or difference equation must have its auxiliary\n\nSignals and Systems\n6-2\nconditions consistent with that property. If, in fact, the system is causal in ad-\ndition to being linear and time-invariant, then the auxiliary conditions will\ncorrespond to the requirement of initial rest; that is, if the input is zero prior to\nsome time, then the output must be zero at least until the same time. In the\ncontext of RLC circuits, for example, this would correspond to an assumption\nof no initial capacitor voltages or inductor currents prior to the time at which\nthe input becomes nonzero.\nAn important distinction between linear constant-coefficient differential\nequations associated with continuous-time systems and linear constant-coef-\nficient difference equations associated with discrete-time systems is that for\ncausal systems the difference equation can be reformulated as an explicit re-\nlationship that states how successive values of the output can be computed\nfrom previously computed output values and the input. This recursive proce-\ndure for calculating the response of a difference equation is extremely useful\nin implementing causal systems. However, it is important to recognize that ei-\nther in algebraic terms or in terms of block diagrams, a difference equation\ncan often be rearranged into other forms leading to implementations that may\nhave particular advantages. For example, as illustrated in the lecture, the\nmost direct representation of a difference equation in terms of a block dia-\ngram or algorithm is often not the most efficient. Since the order in which lin-\near, time-invariant systems are cascaded is not important to the overall input-\noutput response, the most direct representation can be rearranged so that its\nimplementation requires significantly less memory or, equivalently, delay reg-\nisters. In addition, there are many other rearrangements, each having particu-\nlar advantages and disadvantages. Similar kinds of rearrangements of the\nblock diagrams also apply to the block diagram realizations of linear con-\nstant-coefficient differential equations for continuous-time systems.\nSuggested Reading\nSection 3.5, Systems Described by Differential and Difference Equations,\npages 101-111\nSection 3.6, Block-Diagram Representations of LTI Systems Described by Dif-\nferential and Difference Equations, pages 111-119\n\nDifferential and Difference Equations\nLINEAR CONSTANT-COEFFICIENT DIFFERENTIAL EQUATION\nNth Order:\nN\nE: a k\nk=0\ndk y(t)\ndtk\nM\nk=0\ndkx(t)\ndt k\nLINEAR CONSTANT-COEFFICIENT DIFFERENCE EQUATION\nOrder:\nak y[n-k]\nN\nE\nk=0\nM\n=E\nk=0\nbk x[n-k]\nTRANSPARENCY\n6.1\nNth-order linear\nconstant-coefficient\ndifferential and\ndifference equations.\nNE\nk=0\nN\nk=0\ndky(t)\nM\na\n= -E\ndtk\nk=O\ndkyh(t)\nk\nk\ndt\ndkx(t)\nk\ndtk\n(1)\n(Homogeneous Equation)\n(2)\nGiven x(t), if y (t) satisfies (1) then so does\ny,(t) + yh(t) where yh (t) satisfies (2)\nyp(t) A Particular solution\nyh (t) = Homogeneous solution\nTRANSPARENCY\n6.2\nFamily of solutions for\na linear constant-\ncoefficient differential\nequation.\nNth\n\nSignals and Systems\n6-4\nTRANSPARENCY\n6.3\nForm of the\nhomogeneous\nsolution.\nHOMOGENEOUS SOLUTION\nN\ndkYh(t)\nak\ndtk\nk0O\n\"guess\" solution of the form\nYh (t) = Aest\nN\nE ak A s k est = 0\nk=0\nN\nak s k = 0\nk=0\nN roots s i\ni = 1, ... , N\nYh(t) = A1 esit + A 2 es2t + ... + ANeSNt\nTRANSPARENCY\n6.4\nRequirements on the\nauxiliary conditions\nfor a linear constant-\ncoefficient differential\nequation to corre-\nspond to a linear\nsystem or to a causal\nLTI system.\nNeed N auxiliary conditions, e.g.\ndy(t)\ny(t),\ndt\nN\n-1\nV(t)\n, \"\" '\n..N - 1\ne Linear system <=> auxiliary conditions = 0\neCausal, LTI <=> initial rest:\nif x(t)\nthen y(t)\nat t = t\n= 0 t <to\n= 0 t<t\n\nDifferential and Difference Equations\ne + a\no\ndt~\nA e\nC% :SOk\" 4 t'Ov% ts\nct I\n' ikt LL\nCLo\n+\nLV\nukt)\nS CO\nL\nLt)\nC\nL\no\nCt\nCO\n~&\n'K\nOt\n1 t~~43L&L*\nTRANSPARENCY\n6.5\nFamily of solutions for\na Nth-order linear\nconstant-coefficient\ndifference equation.\nMARKERBOARD\n6.1\n\nSignals and Systems\n6-6\nTRANSPARENCY\n6.6\nForm of the\nhomogeneous\nsolution.\nTRANSPARENCY\n6.7\nRequirements on the\nauxiliary conditions\nfor a linear constant-\ncoefficient difference\nequation to corre-\nspond to a linear\nsystem or to a causal\nLTI system.\n\nDifferential and Difference Equations\n6-7\nENCE EQUATION\nTRANSPARENCY\n6.8\nRecursive causal\nsolution to a linear\nconstant-coefficient\ndifference equation.\nMARKERBOARD\n6.2\n\nSignals and Systems\n6-8\nx [n] -\ny [n]\nD\nD\nTRANSPARENCY\n6.9\nx [n1-|A\ny [n -1)\nDevelopment of the\nblock diagram\nrepresentation of the\nrecursive solution.\nD\nD\nDelays associated with\nthe input and output.\nx [n-2]\ny [n-2]\nD\nD\nx [n-N]\ny[n-N]\nx[n]\nb-\nI\ny[n]\nD\nD\nTRANSPARENCY\nb\n6.10\nx[n-]\ny[n-1)\nIncorporation of the\ncoefficient\nmultiplication.\nD\nD\nx [n-2]\nb-a\ny [n -2)\nx [n -N]\ny [n -N]\n\nDifferential and Difference Equations\nTRANSPARENCY\n6.11\nForming the sums of\nthe weighted, delayed\nsequences.\nTRANSPARENCY\n6.12\nComplete block\ndiagram. This form is\noften referred to as\nthe direct form I\nimplementation.\nx [n\ny [n]\nx [n\n[n-N]\n\nSignals and Systems\n6-10\nTRANSPARENCY\n6.13\nInterchanging the\norder in which the\ntwo segments of the\nblock diagram of\nTransparency 6.12\nare cascaded.\nTRANSPARENCY\n6.14\nResult of combining\nthe two chains of\ndelays in Trans-\nparency 6.13. This\nform is often referred\nto as the direct form II\nimplementation.\ny n\n\nDifferential and Difference Equations\n6-11\nMARKERBOARD\n6.3 (a)\nTRANSPARENCY\n6.15\nDirect form I block\ndiagram represen-\ntation of a linear\nconstant-coefficient\ndifferential equation.\n\nSignals and Systems\n6-12\nTRANSPARENCY\n6.16\nResulting block\ndiagram when the\norder of the two\nsubsystems in\nTransparency 6.15 is\nreversed.\nTRANSPARENCY\n6.17\nThe result of\ncombining the two\nchains of integrators\nin Transparency 6.16.\nThis form is often\nreferred to as the\ndirect form II.\n/\nN\nbN\ny( t)\nx (t\n\nDifferential and Difference Equations\nMARKERBOARD\n6.3 (b)\nCA\n~\n<Vt\nci vt~\ncii~L*~\n<5\n7~ tsKt4Y&~4t)\nS\nI\nK\nC\nvat.\nL~i I\nLii\n-t\n((K\nA\nej$Adit*w 6,\nicl sti t 0'\n-\nNeedt wkber\nkinit A C-&Aflmde%5\n7.TI %46\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nResource: Signals and Systems\nProfessor Alan V. Oppenheim\nThe following may not correspond to a particular course on MIT OpenCourseWare, but has been\nprovided by the author as an individual learning resource.\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture 7, Continuous-Time Fourier Series",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/res-6-007-signals-and-systems-spring-2011/24eca8c9c36bf5931c022e17fd44dbfc_MITRES_6_007S11_lec07.pdf",
      "content": "Continuous-Time\nFourier Series\nIn representing and analyzing linear, time-invariant systems, our basic ap-\nproach has been to decompose the system inputs into a linear combination of\nbasic signals and exploit the fact that for a linear system the response is the\nsame linear combination of the responses to the basic inputs. The convolution\nsum and convolution integral grew out of a particular choice for the basic sig-\nnals in terms of which we carried out the decomposition, specifically delayed\nunit impulses. This choice has the advantage that for systems which are time-\ninvariant in addition to being linear, once the response to an impulse at one\ntime position is known, then the response is known at all time positions.\nIn this lecture, we begin the discussion of the representation of signals in\nterms of a different set of basic inputs-complex exponentials with unity\nmagnitude. For periodic signals, a decomposition in this form is referred to as\nthe Fourier series, and for aperiodic signals it becomes the Fourier transform.\nIn Lectures 20-22 this representation will be generalized to the Laplace trans-\nform for continuous time and the z-transform for discrete time.\nComplex exponentials as basic building blocks for representing the input\nand output of LTI systems have a considerably different motivation than the\nuse of impulses. Complex exponentials are eigenfunctions of LTI systems;\nthat is, the response of an LTI system to any complex exponential signal is\nsimply a scaled replica of that signal. Consequently, if the input to an LTI sys-\ntem is represented as a linear combination of complex exponentials, then the\neffect of the system can be described simply in terms of a weighting applied to\neach coefficient in that representation. This very important and elegant rela-\ntionship between LTI systems and complex exponentials leads to some ex-\ntremely powerful concepts and results.\nBefore capitalizing on this property of complex exponentials in relation\nto LTI systems, we must first address the question of how a signal can be rep-\nresented as a linear combination of these basic signals. For periodic signals,\nthe representation is referred to as the Fourier series and is the principal top-\nic of this lecture. Specifically, we develop the Fourier series representation\nfor periodic continuous-time signals. In Lecture 8 we extend that representa-\ntion to the representation of continuous-time aperiodic signals. In Lectures 10\nand 11, we develop parallel results for the discrete-time case.\n\nSignals and Systems\n7-2\nThe continuous-time Fourier series expresses a periodic signal as a lin-\near combination of harmonically related complex exponentials. Alternatively,\nit can be expressed in the form of a linear combination of sines and cosines or\nsinusoids of different phase angles. In these lectures, however, we will use al-\nmost exclusively the complex exponential form. The equation describing the\nrepresentation of a time function as a linear combination of complex expo-\nnentials is commonly referred to as the Fourier synthesis equation, and the\nequation specifying how the coefficients are determined in terms of the time\nfunction is referred to as the Fourier series analysis equation. To illustrate\nthe Fourier series, we focus in this lecture on the Fourier series representa-\ntion of a periodic square wave.\nThe fact that a square wave which is discontinuous can be \"built\" as a lin-\near combination of sinusoids at harmonically related frequencies is some-\nwhat astonishing. In fact, as we add terms in the Fourier series representa-\ntion, we achieve an increasingly better approximation to the square wave\nexcept at the discontinuities; that is, as the number of terms becomes infinite,\nthe Fourier series converges to the square wave at every value of T except at\nthe discontinuities. However, for this example and more generally for period-\nic signals that are square-integrable, the error between the original signal and\nthe Fourier series representation is negligible, in practical terms, in the sense\nthat this error in the limit has zero energy. In the lecture, some of these con-\nvergence issues are touched on with the objective of developing insight into\nthe behavior of the Fourier series rather than representing an attempt to fo-\ncus formally on the mathematics.\nThe Fourier series for periodic signals also provides the key to represent-\ning aperiodic signals through a linear combination of complex exponentials.\nThis representation develops out of the very clever notion of representing an\naperiodic signal as a periodic signal with an increasingly large period. As the\nperiod becomes larger, the Fourier series becomes in the limit the Fourier in-\ntegral or Fourier transform, which we begin to develop in the next lecture.\nSuggested Reading\nSection 4.0, Introduction, pages 161-166\nSection 4.1, The Response of Continuous-Time LTI Systems to Complex Ex-\nponentials, pages 166-168\nSection 4.2, Representation of Periodic Signals: The Continuous-Time Fourier\nSeries, pages 168-179\nSection 4.3, Approximation of Periodic Signals Using Fourier Series and the\nConvergence of Fourier Series, pages 179-185\n\nContinuous-Time Fourier Series\nx ( ]\nx [n]\ny (t)\ny [n]\nIf:\nx(t) = a, 0, (t) + a2 0 2 (t) +\nek(t)\nk(t)\nand system is linear\nThen: y(t) = a, 0 1 (t) + a2 0 2 (t) +\nIdentical for discrete-time\nx= a, 1 +a2 02 +.\nThen: y = a, 01 + a2+'...\nChoose $k (t) or $k [n] so that:\n- a broad class of signals can be\nconstructed as a linear combination\nOf $k's\n- response to #k's easy to compute\nTRANSPARENCY\n7.1\nThe principle of\nsuperposition for\nlinear systems.\nTRANSPARENCY\n7.2\nCriteria for choosing a\nset of basic signals in\nterms of which to\ndecompose the input\nto a linear system.\nIf:\n\nSignals and Systems\nTRANSPARENCY\n7.3\nChoice for the basic\nsignals that led to the\nconvolution integral\nand convolution sum.\nLTI SYSTEMS:\ne C-T: $k (t) = 5(t - kA)\n4 k(t) = h(t - kA)\n=> Convolution Integral\neD-T: #k [n] = 6 [n - k]\nk[n] =h[n-k]\n=> Convolution Sum\nTRANSPARENCY\n7.4\nComplex exponentials\nas a set of basic\nsignals.\n$k (t)\n= eskt\nk [n] = Zk n\nsk complex\nzk complex\nFourier Analysis:\n*C-T:\nsk ~ jwk\n*D-T:\nIzkI = 1\nskcomplex\nzk complex\nk (t)\n= eikt\nkk [n] = e 9kn\n=> Laplace transforms\n=> z-transforms\n\nContinuous-Time Fourier Series\nMARKERBOARD\n7.1\nProos 0\n\"\n~Pr, O;5,\n*yj\n-\np\ne -r-\n1 .o or ',\nC*T ;earier Seeres\nWct -'At+T.)-\nTOU\ne ?\npe i4-\n'I\nPer lea,\nC'\ncV\nk\n.t\na.+\n' Ak cs(k\nw.4+ ev\nkms\noL'\nF'13 GuO0MVe4\n*\nr\niv>'\n.\nThe minus sign at the beginning of the exponent at the bottom of column 1 is incorrect; dt should\nbe included at the end of the analysis integral at the bottom of column 2.\n&dt\n=\no\n0o\na, e\nT6k\nMARKERBOARD\n7.2\nO e\ndt\nC-.. 16\n0 T\n'k~\n___j\n\nSignals and Systems\nTRANSPARENCY\n7.5\nDetermination of the\nFourier series\ncoefficients for an\nantisymmetric\nperiodic square wave.\nANTISYMMETRIC PERIODIC SQUARE WAVE\nx(t)\nT o\nTo\nak\n1-(-1)e-jk\nTfot\ndt +\nt\n(+ 1) e- jkwot dt\nj\n-(-1)ki\nk/#0\na\nx(t) e- jkwot dt=\nf x(t) dt = 0\nTo\nTOTo\nTRANSPARENCY\n7.6\nThe Fourier series\ncoefficients for an\nantisymmetric\nperiodic square wave.\nANTISYMMETRIC PERIODIC SQUARE WAVE\nJ7rak\n-2/5\n-2/3\nao =0;\nak = 1\nk\n(-1) k}\ne odd harmonic\noak imaginary\neak = -a- k (antisymmetric)\nk#0\nsine series\noo\nx(t) = ao + , 2j aksinkwoOt\nk=1\nI\nI\nF----\"\n\nContinuous-Time Fourier Series\nx(t) = E\nak ejkot\nk= - oo\nXN (t) $j\nk=-N\n=27r\nvo-To\nak e jkc)ot\nSymmetric square wave: ak =\nk\nN\nXN (t) = + , 2ak cos kwot\nk=1\nA 4\nX ItM\nK\nA\nx (t)\nTRANSPARENCY\n7.7\nFourier series\ncoefficients for a\nsymmetric periodic\nsquare wave.\nSYMMETRIC PERIODIC SQUARE WAVE\nExample 4.5:\nx(t)\n7r/ 2\n1/5\n-1/3\nak\n1/5\ne\nI\n1/2\nk\nsin (rk/2)\nk# 0\n7rk\n-1/3\n\" odd harmonic\nak real\noak = a-k(symmetric)\ncosine series\nx(t) = ao + [\n2akcoskoot\nk=1\nTRANSPARENCY\n7.8\nIllustration of the\nsuperposition of terms\nin the Fourier series\nrepresentation for a\nsymmetric periodic\nsquare wave.\n[Example 4.5 from the\ntext.]\nF 71\nI\nA\nr\\\nA\n.\n.\n\nSignals and Systems\nTRANSPARENCY\n7.9\nPartial sum\nincorporating\n(2N + 1) terms in the\nFourier series.\n[The analysis equation\nshould read ak -\n1/Tfx(t)e -jk\"ot dt\n+00\nx(t) =\nak ejkwot\nsynthesis\nk =-00\na\n=\nx(t) eikcoot analysis\nkT\nTo\nXN (t)\nN\nk=-N\nak e jkwot\neN (t) =x(t) - XN (t)\nDoes eN (t) decrease as N increases?\nTRANSPARENCY\n7.10\nConditions for\nconvergence of the\nFourier series.\nCONVERGENCE OF FOURIER SERIES\n*X(t) square integrable:\nif f |X(t)12 dt <00\nT0\nthen j\nIeN (t)|2 dt--O\nTo\nas N -\noo\noDirichlet conditions.\nif f Ix(t) I dt < 00 and x(t) \"well behaved\"\nTo\nthen eN (t) -*. 0 as N -\noo\nexcept at discontinuities\n\nContinuous-Time Fourier Series\nFOURIER REPRESENTATION OF APERIODIC SIGNALS\nx (t)\n-TI\nTi\nt\n(t)=x(t)\nAs To --. oo\nTx\n_R(t) -\nX t)\n- use Fourier series to represent x(t)\n- let To-oo to represent x(t)\nTRANSPARENCY\n7.11\nAn aperiodic signal to\nbe represented as a\nlinear combination of\ncomplex exponentials.\nFOURIER REPRESENTATION OF APERIODIC SIGNALS\nX (t)\n-TI\nX(t) = x(t)\nT1\nTO\nIti< 2\nAs To -- oo\ni(t)\nx(t)\n- use Fourier series to represent x(t)\n- let T0-o-ooto represent x(t)\nTRANSPARENCY\n7.12\nRepresentation of an\naperiodic signal as the\nlimiting form of a\nperiodic signal with\nthe period increasing\nto infinity.\n- TO\ncll*. ,\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nResource: Signals and Systems\nProfessor Alan V. Oppenheim\nThe following may not correspond to a particular course on MIT OpenCourseWare, but has been\nprovided by the author as an individual learning resource.\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture 8, Continuous-Time Fourier Transform",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/res-6-007-signals-and-systems-spring-2011/3730bb94a928490f9726ff18b8760e67_MITRES_6_007S11_lec08.pdf",
      "content": "Continuous-Time\nFourier Transform\nIn this lecture, we extend the Fourier series representation for continuous-\ntime periodic signals to a representation of aperiodic signals. The basic ap-\nproach is to construct a periodic signal from the aperiodic one by periodically\nreplicating it, that is, by adding it to itself shifted by integer multiples of an\nassumed period To. As To is increased indefinitely, the periodic signal then ap-\nproaches or represents in some sense the aperiodic one. Correspondingly,\nsince the periodic signal can be represented through a Fourier series, this\nFourier series representation as To goes to infinity can be considered to be a\nrepresentation as a linear combination of complex exponentials of the aperi-\nodic signal. The resulting synthesis equation and the corresponding analysis\nequation are referred to as the inverse Fourier transform and the Fourier\ntransform respectively.\nIn understanding how the Fourier series coefficients behave as the peri-\nod of a periodic signal is increased, it is particularly useful to express the\nFourier series coefficients as samples of an envelope. The form of this enve-\nlope is dependent on the shape of the signal over a period, but it is not depen-\ndent on the value of the period. The Fourier series coefficients can then be\nexpressed as samples of this envelope spaced in frequency by the fundamen-\ntal frequency. Consequently, as the period increases, the envelope remains the\nsame and the samples representing the Fourier series coefficients become in-\ncreasingly dense, that is, their spacing in frequency becomes smaller. In the\nlimit as the period approaches infinity, the envelope itself represents the sig-\nnal. This envelope is defined as the Fourier transform of the aperiodic signal\nremaining when the period goes to infinity.\nAlthough the Fourier transform is developed in this lecture beginning\nwith the Fourier series, the Fourier transform in fact becomes a framework\nthat can be used to encompass both aperiodic and periodic signals. Specifical-\nly, for periodic signals we can define the Fourier transform as an impulse train\nwith the impulses occurring at integer multiples of the fundamental frequency\nand with amplitudes equal to 27r times the Fourier series coefficients. With\nthis as the Fourier transform, the Fourier transform synthesis equation in fact\nreduces to the Fourier series synthesis equation.\n\nSignals and Systems\n8-2\nAs suggested by the above discussion, a number of relationships exist be-\ntween the Fourier series and the Fourier transform, all of which are important\nto recognize. As stated in the last paragraph, the Fourier transform of a peri-\nodic signal is an impulse train with the areas of the impulses proportional to\nthe Fourier series coefficients. An additional relationship is that the Fourier\nseries coefficients of a periodic signal are samples of the Fourier transform of\none period. Thus the Fourier transform of a period describes the envelope of\nthe samples. Finally, the Fourier series of a periodic signal approaches the\nFourier transform of the aperiodic signal represented by a single period as the\nperiod goes to infinity.\nWe now have a single framework, the Fourier transform, that incorpo-\nrates both periodic and aperiodic signals. In the next lecture, we continue the\ndiscussion of the continuous-time Fourier transform in particular, focusing\non some important and useful properties.\nSuggested Reading\nSection 4.4, Representation of Aperiodic Signals: The Continuous-Time Four-\nier Transform, pages 186-195\nSection 4.5, Periodic Signals and the Continuous-Time Fourier Transform,\npages 196-202\n\nContinuous-Time Fourier Transform\nFOURIER REPRESENTATION OF APERIODIC SIGNALS\nx Mt\n(\"\"N\nx(t) = x(t)\nT1\nTO\nIt' <\nAs To -- o\nx(t) -- x(t)\n- use Fourier series to represent x(t)\n- let To---ooto represent x(t)\nTRANSPARENCY\n8.1\nRepresentation of an\naperiodic signal as a\nperiodic signal with\nthe period increasing\nto infinity.\nMARKERBOARD\n8.1(a)\nCw%-nwnsA -TWAe\nFerio.\nSAsDg\nNce\npevb~e.t.\nT\n. 4,)\nr.\n.4\n(00,\n-TO\n\nSignals and Systems\nTRANSPARENCY\n8.2\nFourier series\nrepresentation of the\naperiodic signal 2(t).\n(N\nx(t) = x(t)\n+00~\nX~t\nak e jkwot\nk=-co\nTo /2\nak=\n+f0\na To\nfX\n(t)\nT,\n21r\n=0\n-T\ni(t) e -jkwot dt\ne-jkwot\nTRANSPARENCY\n8.3\nRepresentation of\nthe Fourier series\ncoefficients as\nsamples of the\nenvelope X(w).\n__1\naTO\nDefine:\nThen:\n+ co\nfX(t) e- jkco 0t d\n+ 00\nX(W)\nf x (t) e-i\"\ndt\n-00\nToak\nX(W) I=kcoo\nX(w) is the envelope of To ak\n+00\nk=-co\ne jkoot =\nX(kwO) ejkwot\nk=-00\n+00\nx(t) = 27\nX(kco)\nk\nk=-Oo\nr-KT\n-TI\nT\n(0- .\nT,\n\nContinuous-Time Fourier Transform\n+00\nX(o) =\nx(t) ei jWt dt\nx(t) =\nE X(kwo)\nejkwo tWO\nk=-0O\nFourier transform\n- analysis\nAs To-- oo,\ncoo -* 0 1x t) -\nx (t), we\ndoE -\n+a(\nx(t) = 2\n-2o\nX(o) e jcot dco\nInverse\nFourier transform\n- synthesis\nTRANSPARENCY\n8.4\nThe analysis and\nsynthesis equations\nassociated with the\nFourier transform.\nx(t)\nT,\nX w)\n-- e\" --\n% N\n\\\nI\n\\~\n,.\nTRANSPARENCY\n8.5\nTransparencies 8.5-\n8.7 illustrate that the\nFourier series\ncoefficients of 2(t) are\nsamples of the Fourier\ntransform of one\nperiod. As the period\nTo increases, the\nsamples become more\nclosely spaced. Here is\nshown x(t) (i.e., one\nperiod of :(t)) and its\nFourier transform.\n\nSignals and Systems\nTRANSPARENCY\n8.6\nz(t) and its Fourier\nseries coefficients\nwith To = 4T1. [As the\nfigure is drawn, To and\nT1 are not to scale.]\nsee\nT,\nTO\nX(w)\nT, - 4T1\nTRANSPARENCY\n8.7\n(t) and its Fourier\nseries coefficients\nwith To = 8T1. [As the\nfigure is drawn, To and\nT, are not to scale.]\nJT\nx(t)1\n-T1\nT,\nTo\n/\n'it/I\nF7-1 *..\nT,1X(W)\nt V T - S T\nt. e\nI\n\nContinuous-Time Fourier Transform\nOCAvhawA&-Tt-&\nfoe~ar\nTpiwd\n.\n4S\nSIV4\n3is\nX..\nXvt~*-b\nIS\nExCapkt (Td' 4.'1)\ne.e\n~-~-\nI\nI~\n~ c*w-+ a4-30&\n=i\n)\n-i\n-\ne.\nExample 4.7: eat u(t) +-+\na > o\na+)j>\nTRANSPARENCY\n8.8\nAn exponential time\nfunction and its\nFourier transform.\n[Example 4.7 from the\ntext.]\nV~V\nMARKERBOARD\n8.1(b)\nIX(MOI\n1/aV2\n-a\na\n-a\nvr/2\n1/4\n- r/2\n\nSignals and Systems\nTRANSPARENCY\n8.9\nBode plot\nrepresentation of the\nFourier transform of\nan exponential time\nfunction.\nB20 log10 iX()I =' decibels (dB)\nBode Plot4X(W)\n0 dB\n-20\n-40\n-601\nI\nI\n-r/4\n-~ /2\n-37r/4\n0.1a\n0.1a\n10a\n100a\n10a\n100a\nfrequency (CO )\nTRANSPARENCY\n8.10\nRelationship between\nthe Fourier series\ncoefficients of a\nperiodic signal and the\nFourier transform of\none period.\nFourier Series coefficients equal\n1 times samples of Fourier\nTo\ntransform of one period\n7(t)\n27>\nT /2\nx(t) = one period of x(t)\nx(t) +\nk\nx(t) -)\nX((I)\n-\n_\n~\n_\n~\nI\nI\n.111 1\n.\n.\nr\n__\n\nContinuous-Time Fourier Transform\nx(t)\nsee\nX(w)\nT, - 4T,\nTRANSPARENCY\n8.11\nThe Fourier transform\nof x(t) as the envelope\nof the Fourier series\ncoefficients of 2(t).\nAs the period To\nincreases, the samples\nbecome more closely\nspaced. This\ntransparency shows\nx(t) and its Fourier\ntransform.\n[Transparency 8.5\nrepeated]\nTRANSPARENCY\n8.12\n(t) and its Fourier\nseries coefficients\nwith To = 4T1.\n[Transparency 8.6\nrepeated]\nT1\nSX( )\n-1 -\n-.\nI\nN.\nI\n-\n-..\n~\n\\ '\n.'/\nW-K\n-.01\n\nSignals and Systems\n8-10\nTRANSPARENCY\n8.13\n2t(t) and its Fourier\nseries coefficients\nwith To = 8T 1.\n[Transparency 8.7\nrepeated]\nI(t)1\n- TO\n-T,\nT,\nT,\n-r-IN.\n/\nii'\nXlw)t - 1\nTok\nT\nTRANSPARENCY\n8.14\nRepresentation of the\nFourier series in terms\nof the Fourier\ntransform.\nFOURIER TRANSFORM OF A PERIODIC SIGNAL R(t)\n(t) +\nak\nN(t)\nX\nFourier series\ncoefficients\nFourier transform\n+00\ni(t)\n-\nX(o) eict dw\n21r _ .,\n+00\n2r k=- 00\n+00\n27r ak f\n(w-kco0 ) e- jet dw\nI71 19,1\n\nContinuous-Time Fourier Transform\n8-11\n1. x(t) APERIODIC\n- construct periodic signal x(t) for\nwhich one period is x(t)\n- x(t) has a Fourier series\n- as period of 'x(t) increases,\nxM(t)-.x(t) and Fourier series of\nx(t)-- Fourier Transform of x(t)\nTRANSPARENCY\n8.15\nIllustration of the\nFourier series\ncoefficients and the\nFourier transform for\na symmetric square\nwave.\nTRANSPARENCY\n8.16\nSummary of the\ndevelopment of the\nFourier transform\nfrom the Fourier\nseries. [The periodic\nsignal has been\ncorrected here to read\no(t),\nnot x(t).]\n\nSignals and Systems\n8-12\nTRANSPARENCY\n8.17\nSummary of the\nrelationship between\nthe Fourier transform\nand Fourier series for\na periodic signal.\n2. x(t) PERIODIC, x(t) REPRESENTS ONE PERIOD\n- Fourier series coefficients of x(t)\n= (1/To) times samples of\nFourier\ntransform of x(t)\n3. S(t) PERIODIC\n-Fourier transform of x(t) defined as\nimpulse train:\n+oo\n27rak 6(W - kwo)\nTRANSPARENCY\n8.18\nSummary example\nillustrating some of\nthe relationships\nbetween the Fourier\nseries and Fourier\ntransform.\nX(W)\n=\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nResource: Signals and Systems\nProfessor Alan V. Oppenheim\nThe following may not correspond to a particular course on MIT OpenCourseWare, but has been\nprovided by the author as an individual learning resource.\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture 9, Fourier Transform Properties",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/res-6-007-signals-and-systems-spring-2011/403577752d3007ed4ea30e8c61cf90d7_MITRES_6_007S11_lec09.pdf",
      "content": "Fourier Transform\nProperties\nThe Fourier transform is a major cornerstone in the analysis and representa-\ntion of signals and linear, time-invariant systems, and its elegance and impor-\ntance cannot be overemphasized. Much of its usefulness stems directly from\nthe properties of the Fourier transform, which we discuss for the continuous-\ntime case in this lecture. Many of the Fourier transform properties might at\nfirst appear to be simple (or perhaps not so simple) mathematical manipula-\ntions of the Fourier transform analysis and synthesis equations. However, in\nthis and later lectures, as we discuss issues such as filtering, modulation, and\nsampling, it should become increasingly clear that these properties all have\nimportant interpretations and meaning in the context of signals and signal\nprocessing.\nThe first property that we introduce in this lecture is the symmetry prop-\nerty, specifically the fact that for time functions that are real-valued, the Four-\nier transform is conjugate symmetric, i.e., X( - o) = X*(w). From this it fol-\nlows that the real part and the magnitude of the Fourier transform of real-\nvalued time functions are even functions of frequency and that the imaginary\npart and phase are odd functions of frequency. Because of this property of\ncorjugate symmetry, in displaying or specifying the Fourier transform of a\nreal-valued time function it is necessary to display the transform only for\npositive values of w.\nA second important property is that of time and frequency scaling, spe-\ncifically that a linear expansion (or contraction) of the time axis in the time\ndomain has the effect in the frequency domain of a linear contraction (expan-\nsion). In other words, linear scaling in time is reflected in an inverse scaling in\nfrequency. As we discuss and demonstrate in the lecture, we are all likely to\nbe somewhat familiar with this property from the shift in frequencies that oc-\ncurs when we slow down or speed up a tape recording. More generally, this is\none aspect of a broader set of issues relating to important trade-offs between\nthe time domain and frequency domain. As we will see in later lectures, for\nexample, it is often desirable to design signals that are both narrow in time\nand narrow in frequency. The relationship between time and frequency scal-\ning is one indication that these are competing requirements; i.e., attempting\n\nSignals and Systems\n9-2\nto make a signal narrower in time will typically have the effect of broadening\nits Fourier transform.\nDuality between the time and frequency domains is another important\nproperty of Fourier transforms. This property relates to the fact that the anal-\nysis equation and synthesis equation look almost identical except for a factor\nof 1/27r and the difference of a minus sign in the exponential in the integral. As\na consequence, if we know the Fourier transform of a specified time function,\nthen we also know the Fourier transform of a signal whose functional form is\nthe same as the form of this Fourier transform. Said another way, the Fourier\ntransform of the Fourier transform is proportional to the original signal re-\nversed in time. One consequence of this is that whenever we evaluate one\ntransform pair we have another one for free. As another consequence, if we\nhave an effective and efficient algorithm or procedure for implementing or\ncalculating the Fourier transform of a signal, then exactly the same procedure\nwith only minor modification can be used to implement the inverse Fourier\ntransform. This is in fact very heavily exploited in discrete-time signal analy-\nsis and processing, where explicit computation of the Fourier transform and\nits inverse play an important role.\nThere are many other important properties of the Fourier transform,\nsuch as Parseval's relation, the time-shifting property, and the effects on the\nFourier transform of differentiation and integration in the time domain. The\ntime-shifting property identifies the fact that a linear displacement in time\ncorresponds to a linear phase factor in the frequency domain. This becomes\nuseful and important when we discuss filtering and the effects of the phase\ncharacteristics of a filter in the time domain. The differentiation property for\nFourier transforms is very useful, as we see in this lecture, for analyzing sys-\ntems represented by linear constant-coefficient differential equations. Also,\nwe should recognize from the differentiation property that differentiating in\nthe time domain has the effect of emphasizing high frequencies in the Fourier\ntransform. We recall in the discussion of the Fourier series that higher fre-\nquencies tend to be associated with abrupt changes (for example, the step dis-\ncontinuity in the square wave). In the time domain we recognize that differen-\ntiation will emphasize these abrupt changes, and the differentiation property\nstates that, consistent with this result, the high frequencies are amplified in\nrelation to the low frequencies.\nTwo major properties that form the basis for a wide array of signal pro-\ncessing systems are the convolution and modulation properties. According to\nthe convolution property, the Fourier transform maps convolution to multi-\nplication; that is, the Fourier transform of the convolution of two time func-\ntions is the product of their corresponding Fourier transforms. For the analy-\nsis of linear, time-invariant systems, this is particularly useful because\nthrough the use of the Fourier transform we can map the sometimes difficult\nproblem of evaluating a convolution to a simpler algebraic operation, namely\nmultiplication. Furthermore, the convolution property highlights the fact that\nby decomposing a signal into a linear combination of complex exponentials,\nwhich the Fourier transform does, we can interpret the effect of a linear, time-\ninvariant system as simply scaling the (complex) amplitudes of each of these\nexponentials by a scale factor that is characteristic of the system. This \"spec-\ntrum\" of scale factors which the system applies is in fact the Fourier trans-\nform of the system impulse response. This is the underlying basis for the con-\ncept and implementation of filtering.\nThe final property that we present in this lecture is the modulation prop-\nerty, which is the dual of the convolution property. According to the modula-\ntion property, the Fourier transform of the product of two time functions is\n\nFourier Transform Properties\n9-3\nproportional to the convolution of their Fourier transforms. As we will see in\na later lecture, this simple property provides the basis for the understanding\nand interpretation of amplitude modulation which is widely used in communi-\ncation systems. Amplitude modulation also provides the basis for sampling,\nwhich is the major bridge between continuous-time and discrete-time signal\nprocessing and the foundation for many modern signal processing systems\nusing digital and other discrete-time technologies.\nWe will spend several lectures exploring further the ideas of filtering,\nmodulation, and sampling. Before doing so, however, we will first develop in\nLectures 10 and 11 the ideas of Fourier series and the Fourier transform for\nthe discrete-time case so that when we discuss filtering, modulation, and sam-\npling we can blend ideas and issues for both classes of signals and systems.\nSuggested Reading\nSection 4.6, Properties of the Continuous-Time Fourier Transform, pages\n202-212\nSection 4.7, The Convolution Property, pages 212-219\nSection 6.0, Introduction, pages 397-401\nSection 4.8, The Modulation Property, pages 219-222\nSection 4.9, Tables of Fourier Properties and of Basic Fourier Transform and\nFourier Series Pairs, pages 223-225\nSection 4.10, The Polar Representation of Continuous-Time Fourier Trans-\nforms, pages 226-232\nSection 4.11.1, Calculation of Frequency and Impulse Responses for LTI Sys-\ntems Characterized by Differential Equations, pages 232-235\n\nSignals and Systems\nTRANSPARENCY\n9.1\nAnalysis and synthesis\nequations for the\ncontinuous-time\nFourier transform.\nCONTINUOUS - TIME FOURIER TRANSFORM\n=1\nX(t)\n+00\nX(G)= f\n+00\nX(co) e jot dco\nx(t) e~jot dt\nx(t) +->.\nsynthesis\nanalysis\nX(W)\nX(w) = Re IX(w)\n+ j\n= IX(eo)ej x(\"\nIm\n(j)[\nTRANSPARENCY\n9.2\nSymmetry properties\nof the Fourier\ntransform.\nPROPERTIES OF THE FOURIER TRANSFORM\nX(t)\nX(j)\nSymmetry:\nx(t) real\nRe X(o)\n=> X(-w)\n= X*()\n=\nRe X(-o)\neven\nIX(co)I\n= IX(-w)I\nIm X(o)\n'4X(o)\n=\n-Im X(-4)\nodd\n\nFourier Transform Properties\n9-5\nExample 4.7: eat u(t)\na > o\na+jcw\nTRANSPARENCY\nIxMe)\n9.3\n1/a\nThe Fourier transform\n1/a/2\nfor an exponential\n-\n--\ntime function\nillustrating the\nproperty that the\nFourier transform\nmagnitude is even and\n1/a\n-a\na\nthe phase is odd.\n7r/4\n-7/4\nIT/2\nTime and frequency scaling:\nTRANSPARENCY\n\\9.4\nx(at)\n-+\nX\nThe property of time\nand frequency scaling\nExample:\nfor the Fourier\ntransform.\n&>tut)~1\n_1\ne- at Ut L\n-I-\n-\na+jo\na 1+ j (J\n1/a\nx(t)\ne\nt\nC\n\nSignals and Systems\nDEMONSTRATION\n9.1\nTime and frequency\nscaling. A glockenspiel\nnote is recorded and\nthen replayed at twice\nand half speed.\nTRANSPARENCY\n9.5\nThe property of\nduality.\nI\n\nFourier Transform Properties\nExample 4.11:\n2sin wt\n2 2rt\nExample 4.10:\nX(W)\nw\nw\nX((o)\nco\nTRANSPARENCY\n9.6\nIllustration of the\nduality property.\n+00\nf\nIx(t)|2dt\nif\nI'(t)I12dt\n0O\n27r\n+00)\nf\n-00\n+00\nk=- 00\nIX(c) |2do\nlak12\nTRANSPARENCY\n9.7\nParseval's relation for\nthe Fourier transform\nand the Fourier series.\nParseval's relation:\n\nSignals and Systems\n9-8\nTRANSPARENCY\n9.8\nSome additional\nproperties of the\nFourier transform.\nTime shifting:\nx(t-t )\n.-\ne-jwto X(o)\nDifferentiation:\ndx(t)\ndt\njw X(W)\nIntegration:\nf tf00\n-\nX(W) + 7r X(O) b(w)\nJco\nLinearity:\nax (t) + bx 2 (t)\n-.\naX1 (w) + bX 2 (w)\nTRANSPARENCY\n9.9\nTransparencies 9.9\nand 9.10 illustrate the\nconvolution property\nand its interpretation\nfor LTI systems. This\ntransparency indicates\nthe response to an\nimpulse.\nx(T)dr\n4-+\n\nFourier Transform Properties\nCONVOLUTION PROPERTY\nh(t) * x(t)\nH (w) X( )\nx(t)\nh(t)\nh(t) * x(t)\nX(W)\nH(w)\nH(w) X(W)\ne*Jcot H(w o )\nH(w) = frequency response\nTRANSPARENCY\n9.10\nResponse to a\ncomplex exponential.\nFILTERING\nIdeal lowpass filter:\n-I\nDifferentiator:\ndx(t)\ny(t) =t\n=> H(co) = jco\nTRANSPARENCY\n9.11\nFiltering as an\nillustration of the\ninterpretation of the\nconvolution property\nfor LTI systems.\nCo\nCo\nIH(M)I\nOppo\n\nSignals and Systems\n9-10\nDEMONSTRATION\n9.2\nLowpass filtering of an\nimage.\nDEMONSTRATION\n9.3\nEffect of\ndifferentiating an\nimage.\n\nFourier Transform Properties\n9-11\nMODULATION PROPERTY\ns(t) p(t)\ns(t) p(t)\nConvolution:\ns(t) * p(t)\n1-- [S(o) * P(w)]\n27r\n-- [S(w) * P(co)]\n27r\nS(co) P(W)\nTRANSPARENCY\n9.12\nThe modulation\nproperty for the\nFourier transform.\n_+)+ Gt (t) =At\n(7): (V\nj.\nJ)j\n&o\n,e\n-t\n%~,\n%~'\nI\nI\nY~wj~\njQ4I\n-\nI\nI\n=,ji342.\nJh~+I\nt ~\nModulation:\nMARKERBOARD\n9.1\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nResource: Signals and Systems\nProfessor Alan V. Oppenheim\nThe following may not correspond to a particular course on MIT OpenCourseWare, but has been\nprovided by the author as an individual learning resource.\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture 10, Discrete-Time Fourier Series",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/res-6-007-signals-and-systems-spring-2011/cf3874410d609d71d6036e7572525222_MITRES_6_007S11_lec10.pdf",
      "content": "Discrete-Time\nFourier Series\nIn this and the next lecture we parallel for discrete time the discussion of the\nlast three lectures for continuous time. Specifically, we consider the represen-\ntation of discrete-time signals through a decomposition as a linear combina-\ntion of complex exponentials. For periodic signals this representation be-\ncomes the discrete-time Fourier series, and for aperiodic signals it becomes\nthe discrete-time Fourier transform.\nThe motivation for representing discrete-time signals as a linear combi-\nnation of complex exponentials is identical in both continuous time and dis-\ncrete time. Complex exponentials are eigenfunctions of linear, time-invariant\nsystems, and consequently the effect of an LTI system on each of these basic\nsignals is simply a (complex) amplitude change. Thus with signals decom-\nposed in this way, an LTI system is completely characterized by a spectrum of\nscale factors which it applies at each frequency.\nIn representing discrete-time periodic signals through the Fourier series,\nwe again use harmonically related complex exponentials with fundamental\nfrequencies that are integer multiples of the fundamental frequency of the pe-\nriodic sequence to be represented. However, as we discussed in Lecture 2, an\nimportant distinction between continuous-time and discrete-time complex\nexponentials is that in the discrete-time case, they are unique only as the fre-\nquency variable spans a range of 27r. Beyond that, we simply see the same\ncomplex exponentials repeated over and over. Consequently, when we con-\nsider representing a periodic sequence with period N as a linear combination\nof complex exponentials of the form efkOn with\no = 27r/N, there are only N\ndistinct complex exponentials of this type available to use, i.e., efoOn is period-\nic in k with period N. (Of course, it is also periodic in n with period N.) In many\nways, this simplifies the analysis since for discrete time the representation in-\nvolves only N Fourier series coefficients, and thus determining the coeffi-\ncients from the sequence corresponds to solving N equations in N unknowns.\nThe resulting analysis equation is a summation very similar in form to the syn-\nthesis equation and suggests a strong duality between the analysis and syn-\nthesis equations for the discrete-time Fourier transform. Because the basic\n10-1\n\nSignals and Systems\n10-2\ncomplex exponentials repeat periodically in frequency, two alternative inter-\npretations arise for the behavior of the Fourier series coefficients. One inter-\npretation is that there are only N coefficients. The second is that the sequence\nrepresenting the Fourier series coefficients can run on indefinitely but re-\npeats periodically. Both interpretations, of course, are equivalent because in\neither case there are only N unique Fourier series coefficients. Partly to retain\na duality between a periodic sequence and the sequence representing its\nFourier series coefficients, it is typically preferable to think of the Fourier se-\nries coefficients as a periodic sequence with period N, that is, the same period\nas the time sequence x(n). This periodicity is illustrated in this lecture through\nseveral examples.\nPartly in anticipation of the fact that we will want to follow an approach\nsimilar to that used in the continuous-time case for a Fourier decomposition\nof aperiodic signals, it is useful to represent the Fourier series coefficients as\nsamples of an envelope. This envelope is determined by the behavior of the\nsequence over one period but is not dependent on the specific value of the pe-\nriod. As the period of the sequence increases, with the nonzero content in the\nperiod remaining the same, the Fourier series coefficients are samples of the\nsame envelope function with increasingly finer spacing along the frequency\naxis (specifically, a spacing of 2ir/N where N is the period). Consequently, as\nthe period approaches infinity, this envelope function corresponds to a Four-\nier representation of the aperiodic signal corresponding to one period. This is,\nthen, the Fourier transform of the aperiodic signal.\nThe discrete-time Fourier transform developed as we have just described\ncorresponds to a decomposition of an aperiodic signal as a linear combina-\ntion of a continuum of complex exponentials. The synthesis equation is then\nthe limiting form of the Fourier series sum, specifically an integral. The analy-\nsis equation is the same one we used previously in obtaining the envelope of\nthe Fourier series coefficients. Here we see that while there was a duality in\nthe expressions between the discrete-time Fourier series analysis and synthe-\nsis equations, the duality is lost in the discrete-time Fourier transform since\nthe synthesis equation is now an integral and the analysis equation a summa-\ntion. This represents one difference between the discrete-time Fourier trans-\nform and the continuous-time Fourier transform. Another important differ-\nence is that the discrete-time Fourier transform is always a periodic function\nof frequency. Consequently, it is completely defined by its behavior over a fre-\nquency range of 27r in contrast to the continuous-time Fourier transform,\nwhich extends over an infinite frequency range.\nSuggested Reading\nSection 5.0, Introduction, pages 291-293\nSection 5.1, The Response of Discrete-Time LTI Systems to Complex Expo-\nnentials, pages 293-294\nSection 5.2, Representation of Periodic Signals: The Discrete-Time Fourier\nSeries, pages 294-306\nSection 5.3, Representation of Aperiodic Signals: The Discrete-Time Fourier\nTransform, pages 306-314\nSection 5.4, Periodic Signals and the Discrete-Time Fourier Transform, pages\n314-321\n\nDiscrete-Time Fourier Series\n10-3\nMARKERBOARD\n10.11\nNote that dt should be added at the end of the last equation in column 1.\nMARKERBOARD\n10.2\n\nSignals and Systems\n10-4\nTRANSPARENCY\n10.1\nExample of the\nFourier series\ncoefficients for a\ndiscrete-time periodic\nsignal.\nExample 5.2:\nx[n] = 1 + sin  0n + 3 cos 2 0 n\n+ cos (2E2 0n +\n)\nRe ak\niak\nk\nN\nN\n*-IIi\nI:,\na1\n\"1--\n0/\nN\nN\n<%ak\nir/2\n0-TI\n- -\n--I\n- N\nTRANSPARENCY\n10.2\nComparison of the\nFourier series\ncoefficients for a\ndiscrete-time periodic\nsquare wave and a\ncontinuous-time\nperiodic square wave.\nk\nk\n\nEnvelope:\nsin[(2N1 + 1) 92/2]\nsin (W/2)\n-F.1N\n- 20\nNa.\nNao\n27r\nDiscrete-Time Fourier Series\n10-5\nTRANSPARENCY\n10.3\nIllustration of the\ndiscrete-time Fourier\nseries coefficients as\nsamples of an enve-\nlope. Transparencies\n10.3-10.5 demonstrate\nthat as the period\nincreases, the\nenvelope remains the\nsame and the samples\nrepresenting the\nFourier series\ncoefficients become\nmore closely spaced.\nHere, N = 10.\nTRANSPARENCY\n10.4\nN = 20.\n\nSignals and Systems\n10-6\nTRANSPARENCY\n10.5\nN = 40.\nTRANSPARENCY\n10.6\nA review of the\napproach to\ndeveloping a Fourier\nrepresentation for\naperiodic signals.\nNao\nEnvelope:\nsin[(2N1 + 1) 92/2]\nsin (92/2)\nAfr~r . 2i\n1. x(t) APERIODIC\n- construct periodic signal X(t) for\nwhich one period is x(t)\n- x(t) has a Fourier series\n- as period of x(t) increases,\nx(t) -- x(t) and Fourier series of\nx(t)\nFourier Transform of x(t)\nN - 40\n\nDiscrete-Time Fourier Series\n10-7\n1. x[n] APERIODIC\n- construct periodic signal x[n]for\nwhich one period is x[n]\n-x[n]has a Fourier series\n- as period of x[n] increases,\ni I[n] -.-x[n] and Fourier series of\nx[n] --\nFourier Transform of x[n]\nFOURIER REPRESENTATION OF APERIODIC SIGNALS\ninJ\n...\n*jaaTTT?? nTTITTT.\n?TTTATTTTTTL\n??T????TTr\n-N\n-N1\nN1\nN\nn\nx[n] = x[n]\nIn I < 2\nAs N -+oo\nx[n]\no x[n]\n-\nlet N -+\noo to represent x[n]\n- use Fourier series to represent x[n]\nTRANSPARENCY\n10.7\nA summary of the\napproach to be used to\nobtain a Fourier\nrepresentation of\ndiscrete-time\naperiodic signals.\nTRANSPARENCY\n10.8\nRepresentation of an\naperiodic signal as the\nlimiting form of a\nperiodic signal with\nthe period increasing.\n\nSignals and Systems\n10-8\nTRANSPARENCY\n10.9\nTransparencies 10.9-\n10.11 illustrate how\nthe Fourier series\ncoefficients for a\nperiodic signal\napproach the\ncontinuous envelope\nfunction as the period\nincreases. Here, N =\n10. [Example 5.3 from\nthe text.]\nExample 5.3:\n-NI?.. - N 0\n-N\n-N,\nN,\n//\nU\nN\nNao\nEnvelope:\nsin[ (2N 1 + 1)\n/2]\nsin (W/2)\nNai\n2r\nTRANSPARENCY\n10.10\nN = 20. [Example 5.3\nfrom the text.]\nExample 5.3:\n-N\nNao\n-'T\nNNai\n//\n0 2w\n-N,\nEnvelope:\nsin( [(2N 1 + 1) R/2]\nsin (fl/2)\nn\nN = 10\nN\n-.--\nn\nN - 20\nI\nI*\nA'.ft\n-\n-\n- W\n6 0 9 -1\n\nDiscrete-Time Fourier Series\n10-9\n-N\nNa1\n-1 1 N1\nN11?\n...\n-N1\nN1\nN\nEnvelope:\nsin [(2NI + 1) 2/2)\nsin (U/2)\nN - 40\nTRANSPARENCY\n10.11\nN = 40. [Example 5.3\nfrom the text.]\nin]\n=\nI\nk=<N>\nX(kg2o) = N ak =\nAs N\noo\nFourier Transform:\nx[n] = 2'r 2ir\n1XWkn) e jkE2Gn go\nn= N/2\nn /\nx[n] e-jk on\nn=-N/2\nX(92) ein\" d92\n+oo\nX(92) =\nx[n] e-in\"\nn =- oc\nTRANSPARENCY\n10.12\nLimiting form of the\nFourier series as the\nperiod approaches\ninfinity. [The upper\nlimit in the summa-\ntion in the second\nequation should be\nn = (N/2) - 1.]\n//\n\nSignals and Systems\n10-10\nTRANSPARENCY\n10.13\nThe analysis and\nsynthesis equations\nfor the discrete-time\nFourier transform. [As\ncorrected here, x[n],\nnot x(t), has Fourier\ntransform X(D).]\nDISCRETE-TIME FOURIER TRANSFORM\nx [n]\n-\nX(E2) en\" d\n+ o\nX (2)\n=\nn=-oo\nx[n]\nsynthesis\nanalysis\nx[n] <\nXG\nX(2)\n=\ne X(2)\n+ j Im I X(&)4\n=\n|X(S2)1 ei\"(2)\nTRANSPARENCY\n10.14\nThe discrete-time\nFourier transform for\na rectangular pulse.\nX (W)\n27r\n1-2\nx [n]I IoI\n-2\nn\n-27r\n\nDiscrete-Time Fourier Series\n10-11\nx[n]= an u[n]\nO < a < 1\nan u[n]e-inn\nan e-j2n\nTRANSPARENCY\n10.15\nThe discrete-time\nFourier transform for\nan exponential\nsequence.\nanu[n] 0<a<1\n1a e-iW\n1 X()| I\n27r\n, X(W)\ntan~ (a/v'Y 2)\nTRANSPARENCY\n10.16\nIllustration of the\nmagnitude and phase\nof the discrete-time\nFourier transform for\nan exponential\nsequence. [Note that a\nis real.]\nX( W)\n+00\nn=-00\nn= 0\n1 -a\nx[n]\nX(2)\n-2r\n-7\n\nSignals and Systems\n10-12\nTRANSPARENCY\n10.17\nA review of some\nrelationships for the\nFourier transform\nassociated with\nperiodic signals.\n2. R(t) PERIODIC, x(t) REPRESENTS ONE PERIOD\n- Fourier series coefficients of 2(t)\n= (1/T) times samples of\nFourier.\ntransform of x(t)\n3. 2*(t) PERIODIC\n-Fourier transform of x(t) defined as\nimpulse train:\n+oo\nX(W) =\n27rak 6 (o - ko)\nTRANSPARENCY\n10.18\nA summary of some\nrelationships for the\nFourier transform\nassociated with\nperiodic sequences.\n2. '[n] PERIODIC, x[n] REPRESENTS ONE PERIOD\n- Fourier series coefficients of 2[n]\n= (1/ N ) times samples of\nFourier\ntransform of x [n]\n3. X[n] PERIODIC\n-Fourier transform of x[n]defined as\nimpulse train:\n27rak 5 (2 - k2 0 )\nk=I-oo0\nX(n) =\n\nDiscrete-Time Fourier Series\n10-13\nFourier series coefficients equal\n-\ntimes samples of Fourier\ntransform of one period\nx~nJ??TYATTTT?\nflT??,??TTTT\n-N,\nN1\nN\nn\nx [n] 6 one period of x[n]\nx [n]\nx [n]\no ak\n0X (9)\nk N\n2irk\nN\nTRANSPARENCY\n10.19\nThe relationship\nbetween the Fourier\nseries coefficients of a\nperiodic signal and the\nFourier transform of\none period.\nTRANSPARENCY\n10.20\nIllustration of the\nrelationship in\nTransparency 10.19.\n-N\n\nSignals and Systems\n10-14\nTRANSPARENCY\n10.21\nA summary of some\nrelationships for the\nFourier transform\nassociated with\nperiodic sequences.\n[Transparency 10.18\nrepeated]\nTRANSPARENCY\n10.22\nIllustration of the\nFourier series\ncoefficients and the\nFourier transform for\na periodic square\nwave.\n2. *[n] PERIODIC , x[n] REPRESENTS ONE PERIOD\n- Fourier series coefficients of *[n]\n= (1/ N ) times samples of\nFourier\ntransform of x [n]\n3. #x[n] PERIODIC\n-Fourier transform of xIn]defined as\nimpulse train:\n27rak 5(2 - k2 0 )\n..1111I\nN1\nN1\n~T1111\"\n__\n-11111\nX (9) =\nn\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nResource: Signals and Systems\nProfessor Alan V. Oppenheim\nThe following may not correspond to a particular course on MIT OpenCourseWare, but has been\nprovided by the author as an individual learning resource.\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Problem Set 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/res-6-007-signals-and-systems-spring-2011/d367a3c05c298bed00aae37754dd2631_MITRES_6_007S11_hw01.pdf",
      "content": "I Introduction\nRecommended\nProblems\nP1.1\nEvaluate each of the following expressions for the complex number z =2e'/.\n(a) Re{z}\n(b) Im{z)\n(c) IzI\n(d) <z\n(e) z*(* denotes complex conjugation)\n(f) z + z*\nP1.2\nLet z be an arbitrary complex number.\n(a) Show that\n+ z*\nRe{z}\nz\n(b) Show that\njIm{z}\n- 2\nP1.3\nUsing Euler's formula, ei\" -\ncos 0 + j sin 0, derive the following relations:\n(a) cos 0=\ne\"-\nei\"\n(b) sin 0 =\n2j\nP1.4\n(a) Let z = rei\". Express in polar form (i.e., determine the magnitude and angle for)\nthe following functions of z:\n(i)\nz*\n(ii)\nz 2\n(iii)\njz\n(iv)\nzz*\n(v\nz\nz\n(vi)\nz\nP1-1\n\nSignals and Systems\nP1-2\n(b) Plot in the complex plane the vectors corresponding to your answers to Problem\nP1.4a(i)-(vi) for r = 3, 0 =r/6.\nP1.5\nShow that\n(1 - el\") = 2 sin (a)e i-(a ir)/2\nP1.6\nFor x(t) indicated in Figure P1.6, sketch the following:\n(a) x(-t)\n(b) x(t + 2)\n(c) x(2t + 2)\n(d) x(1 -\n3t)\nx(t)\n0F\nFigure P1.6\nP1.7\nEvaluate the following definite integrals:\n(a) fe-2tdt\n(b)\ne dt\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nResource: Signals and Systems\nProfessor Alan V. Oppenheim\nThe following may not correspond to a particular course on MIT OpenCourseWare, but has been\nprovided by the author as an individual learning resource.\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Problem Set 2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/res-6-007-signals-and-systems-spring-2011/8fbf4451c622e6efbcf7452222d21ea5_MITRES_6_007S11_hw02.pdf",
      "content": "2 Signals and Systems: Part I\nRecommended\nProblems\nP2.1\nLet x(t) = cos(wx(t + rx) + Ox).\n(a) Determine the frequency in hertz and the period of x(t) for each of the follow\ning three cases:\n(i)\nr/3\n21r\n(ii)\n3r/4\n1/2\n7r/4\n(iii)\n3/4\n1/2\n1/4\n(b) With x(t) = cos(wx(t + rx) + Ox) and y(t) = sin(w,(t + -r,)+ 0,), determine for\nwhich of the following combinations x(t) and y(t) are identically equal for all t.\nWX\nT\n0x\nWY\nTY\nOy\n(i)\nr/3\n2r\nir/3\n- r/3\n(ii)\n3-r/4\n1/2\n7r/4\n11r/4\n37r/8\n(iii)\n3/4\n1/2\n1/4\n3/4\n3/8\nP2.2\nLet x[n] = cos(Qx(n + Px) + Ox).\n(a) Determine the period of x[n] for each of the following three cases:\nOx\nPX\nOx\n(i)\nr/3\n27r\n(ii)\n3-r/4\nr/4\n(iii)\n3/4\n1/4\n(b) With x[n] = cos(Q,(n + PX) + Ox) and y[n] = cos(g,(n + Py) + 6,), determine\nfor which of the following combinations x[n] and y[n] are identically equal for\nall n.\nQX\nPX\nOxX,\nQ,\nPO\n(i)\nr/3\n8r/3\n(ii)\n37r/4\nw/ 4\n3r/4\n-ir\n(iii)\n3/4\n1/4\n3/4\nP2.3\n(a)\nA discrete-time signal x[n] is shown in Figure P2.3.\nP2-1\n\nSignals and Systems\nP2-2\nx [n]\n-3 -2 -1\n1 2\nFigure P2.3\nSketch and carefully label each of the following signals:\n(i)\nx[n -\n2]\n(ii)\nx[4 -\nn]\n(iii)\nx[2n]\n(b) What difficulty arises when we try to define a signal as.x[n/2]?\nP2.4\nFor each of the following signals, determine whether it is even, odd, or neither.\n(a)\n(b)\nFigure P2.4-1\n(c)\nx(t)\n(d)\nx [n ]\nFigure P2.4-3\nt\n-2\nF3\nx~nn\nP2.44n\n1 2 3\nFigure P2.4-4\n\nSignals and Systems: Part I / Problems\nP2-3\n(e)\n(f)\nx [n]\nx[n]\n-3 -2 -1\n1 2 3 4\nn\n-3 -2 -1\nFigure P2.4-5\nFigure P2.4-6\nP2.5\nConsider the signal y[n] in Figure P2.5.\ny[n]\n2'.\ne\nn\n-3 -2-1\nFigure P2.5\n(a) Find the signal x[n] such that Ev{x[n]} = y[n] for n > 0, and Od(x[n]} = y[n]\nfor n < 0.\n(b) Suppose that Ev{w[n]} = y[n] for all n. Also assume that w[n] = 0 for n < 0.\nFind w[n].\nP2.6\n(a) Sketch x[n] = a\"for a typical a in the range -1 < a < 0.\n(b) Assume that a = -e-' and define y(t) as y(t) = eO'. Find a complex number #\nsuch that y(t), when evaluated at t equal to an integer n, is described by\n(-e- )\".\n(c) For y(t) found in part (b), find an expression for Re{y(t)} and Im{y(t)}. Plot\nRe{y(t)} and Im{y(t)} for t equal to an integer.\nP2.7\nLet x(t) = \\/2(1 + j)ej\"14 e(-i+2 ,). Sketch and label the following:\n(a) Re{x(t)}\n(b) Im{x(t)}\n(c) x(t + 2) + x*(t + 2)\n\nSignals and Systems\nP2-4\nP2.8\nEvaluate the following sums:\n(a) T 2(3n\nn=0\n(b)\nb\nb\nn=2\n2n\n(c)Z\n-~3\nn=o\nHint:Convert each sum to the form\nN-1\nC ( a' = SN\nor\nCn\nn=o\nn =0\nand use the formulas\nSN = C\naN\n1 C\nfor lal < 1\n1a\n1-a\nP2.9\n(a) Let x(t) and y(t) be periodic signals with fundamental periods Ti and T2, respec\ntively. Under what conditions is the sum x(t) + y(t) periodic, and what is the\nfundamental period of this signal if it is periodic?\n(b) Let x[n] and y[n] be periodic signals with fundamental periods Ni and N 2,\nrespectively. Under what conditions is the sum x[n] + y[n] periodic, and what\nis the fundamental period of this signal if it is periodic?\n(c) Consider the signals\nx(t) = cos-t + 2 sin\n'\ny(t) = sin irt\nShow that z(t) = x(t)y(t) is periodic, and write z(t) as a linear combination of\nharmonically related complex exponentials. That is, find a number T and com\nplex numbers Ck such that\nz(t) =\njce(21'/T'\nk\nP2.10\nIn this problem we explore several of the properties of even and odd signals.\n(a) Show that if x[n] is an odd signal, then\n+o0\n( x[n] = 0\nn=-00\n(b) Show that if xi[n] is an odd signal and x2[n] is an even signal, then x,[n]x 2[n] is\nan odd signal.\n\nSignals and Systems: Part I / Problems\nP2-5\n(c) Let x[n] be an arbitrary signal with even and odd parts denoted by\nxe[n] = Ev{x[n]},\nx[n] = Od{x[n]}\nShow that\n~x[n] =\n[n] + ~3X'[n]\n(d) Although parts (a)-(c) have been stated in terms of discrete-time signals, the\nanalogous properties are also valid in continuous time. To demonstrate this,\nshow that\nJx 2 (t )dt =\n2x(t)dt + J\n2~(t) dt,\nwhere xe(t) and x,(t) are, respectively, the even and odd parts of x(t).\nP2.11\nLet x(t) be the continuous-time complex exponential signal x(t) = ei0O' with fun\ndamental frequency wo and fundamental period To = 27r/wo. Consider the discrete-\ntime signal obtained by taking equally spaced samples of x(t). That is, x[n] =\nx(nT) = eswonr\n(a) Show that x[n] is periodic if and only if T/TO is a rational number, that is, if and\nonly if some multiple of the sampling interval exactly equals a multiple of the\nperiod x(t).\n(b) Suppose that x[n] is periodic, that is, that\nT\np\n-\n,\n(P2.11-1)\nTo\nq\nwhere p and q are integers. What are the fundamental period and fundamental\nfrequency of x[n]? Express the fundamental frequency as a fraction of woT.\n(c) Again assuming that T/TO satisfies eq. (P2.11-1), determine precisely how many\nperiods of x(t) are needed to obtain the samples that form a single period of\nx[n].\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nResource: Signals and Systems\nProfessor Alan V. Oppenheim\nThe following may not correspond to a particular course on MIT OpenCourseWare, but has been\nprovided by the author as an individual learning resource.\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Problem Set 3",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/res-6-007-signals-and-systems-spring-2011/5ef8ecc5a7d42a418c1db014c951ac9c_MITRES_6_007S11_hw03.pdf",
      "content": "3 Signals and Systems: Part II\nRecommended\nProblems\nP3.1\nSketch each of the following signals.\n(a) x[n] = b[n] + 3[n -\n3]\n(b) x[n] = u[n] -\nu[n -\n5]\n(c) x[n] = 6[n] + 1n\n+ (i)2 [n -\n2] + (i)ag[n -\n3]\n(d) x(t) = u(t + 3) - u(t - 3)\n(e) x(t) = 6(t + 2)\n(f) x(t) = e-'u(t)\nP3.2\nBelow are two columns of signals expressed analytically. For each signal in column\nA, find the signal or signals in column B that are identical.\nA\nB\n(1)\n6[n + 1]\n(a)\nt[k]\n(2)\n(I)\"U [n]\nk=-0\n(3) 6(t)\n(b) du(t)\n(4) u(t)\n(5) u[n]\n(C)\n6[k]\n(6) b[n + 1]u[n]\nk=O\n(d) L (I)k[n\n- k]\nk=O\n(e) J\nt6(r) dr\n(f) u[n]\n(g)\nE\n(I)kb[n\n-\nk]\nk= -oo\n(h) b[n + 1]\n(i) $\nP3.3\n(a) Express the following as sums of weighted delayed impulses, i.e., in the form\nx[n] = (\nako[n -\nk]\nk= -o\nP3-1\n\nSignals and Systems\nP3-2\nx [n]\n4?\n-3 -2 -1\n-2\nFigure P3.3-1\n(b) Express the following sequence as a sum of step functions, i.e., in the form\ns[n] =\n(\naku[n -\nk]\nk= -00\ns[n]\n-3 -2\n-6-5-4\n-110 0\n1- 1\nn\n-1\n\nFigure P3.3-2\nP3.4\nFor x(t) indicated in Figure P3.4, sketch the following:\n(a) x(1 -\nt)[u(t + 1) -\nu(t -\n2)]\n(b) x(1 -\nt)[u(t + 1) -\nu(2 -\n3t)]\nx(t)\nFigure P3.4\n\nSignals and Systems: Part II / Problems\nP3-3\nP3.5\nConsider the three systems H, G, and F defined in Figure P3.5-1.\nx [n]\nH\ny[n]=x2 [nJ\nx[n]\nG\n. y[n]=x[n]-x[n-1]\nx [n\nF\ny[n]=2x[n]+x[n-1]\nFigure P3.5-1\nThe systems in Figures P3.5-2 to P3.5-7 are formed by parallel and cascade combi\nnation of H, G, and F. By expressing the output y[n] in terms of the input x[n],\ndetermine which of the systems are equivalent.\n(a)\n(b)\nH\nG\nx\n+\ny\nx\n+\ny\nH\nFigure P3.5-2\nFigure P3.5-3\n(c)\n(d)\nx--\nG\nH\nY\nX-\nH\n--\n+\nG\n--\nWY\nFigure P3.5-4\nFigure P3.5-5\n(e)\n(f)\nx\nG\nF\nY\nx --\nF\nG\nY\nFigure P3.5-6\nFigure P3.5-7\nP3.6\nTable P3.6 contains the input-output relations for several continuous-time and dis\ncrete-time systems, where x(t) or x[n] is the input. Indicate whether the property\nalong the top row applies to each system by answering yes or no in the appropriate\nboxes. Do not mark the shaded boxes.\n\nSignals and Systems\nP3-4\nProperties\ny(t), y[n]\nMemoryless\nLinear\nTime-Invariant\nCausal\nInvertible\nStable\nTable P3.6\nP3.7\nConsider the following systems\nH:\ny(t) =\nx(r) dr\n(an integrator),\nG:\ny(t) = x(2t),\nwhere the input is x(t) and the output is y(t).\n(a) What is H-', the inverse of H? What is G- ?\n(b) Consider the system in Figure P3.7. Find the inverse F-1 and draw it in block\ndiagram form in terms of H-1 and G-1.\nx(t) ---\nH\nG\nw(t)\nx(t)\nF\n---\no w(t)\nFigure P3.7\n\nSignals and Systems: Part II / Problems\nP3-5\nOptional\nProblems\nP3.8\nIn this problem we illustrate one of the most important consequences of the prop\nerties of linearity and time invariance. Specifically, once we know the response of a\nlinear system or of a linear, time-invariant (LTI) system to a single input or the\nresponses to several inputs, we can directly compute the responses to many other\ninput signals.\n(a) Consider an LTI system whose response to the signal x 1(t) in Figure P3.8-1(a)\nis the signal y 1(t) illustrated in Figure P8-1(b). Determine and sketch carefully\nthe response of the system to the input x 2(t) depicted in Figure P3.8-1(c).\nx1 (t)\nY1(t)\nt\n(a)\n(b)\nx 2(t)\nx3 (t)\ni\nt4-101\n-1\n(c)\n(d)\nx(t\n(e)\nFigure P3.8-1\n(b) Determine and sketch the response of the system considered in part (a) to the\ninput x3(t) shown in Figure P3.8-1(d).\n\nSignals and Systems\nP3-6\n(c) Suppose that a second LTI system has the following output y(t) when the input\nis the unit step x(t) = u(t):\ny(t) = e-'u(t) + u(-1 -\nt)\nDetermine and sketch the response of this system to the input x(t) shown in\nFigure P3.8-1(e).\n(d) Suppose that a particular discrete-time linear (but possibly not time-invariant)\nsystem has the responses yi[n], y2[n], and yAn] to the input signals xi[n], x2[n],\nand x[n], respectively, as illustrated in Figure P3.8-2(a). If the input to this\nsystem is x[n] as illustrated in Figure P3.8-2(b), what is the output y[n]?\nx, [n]\ny, [n]\n-\n.\nn\na\nn\n0 1 2 3\nX2 [n]\nY 2 [n]\n0 1\n0 1\nx3 [n]\ny 3 [n]\n. 1\n2 4\n.\n0p\n0pop0\no\nn\n-..-\nn\n-1\n-1\n(a)\nx[n]\nn\n-1 0\n-2\n(b)\nFigure P3.8-2\n(e) If an LTI system has the response y1[n] to the input xi[n] as in Figure P3.8-2(a),\nwhat would its responses be to x 2[n] and x3[n]?\n(f) A particular linear system has the property that the response to t' is cos kt.\nWhat is the response of this system to the inputs\nx 1(t) = ,r + 6t 2 -\n47t 5 + \\/et6\n1+\nt0\nx 2(t) = 1 +t 2\n\nSignals and Systems: Part II / Problems\nP3-7\nP3.9\n(a) Consider a system with input x(t) and with output y(t) given by\n+0o\ny(t) = (\nx(t)b(t -\nnT)\n(i)\nIs this system linear?\n(ii)\nIs this system time-invariant?\nFor each part, if your answer is yes, show why this is so. If your answer is no,\nproduce a counterexample.\n(b) Suppose that the input to this system is x(t) = cos 27rt. Sketch and label care\nfully the output y(t) for each of the following values of T: T = 1, 1, 1, 1, -. All\nof your sketches should have the same horizontal and vertical scales.\n(c) Repeat part (b) for x(t) = e' cos 27rt.\nP3.10\n(a) Is the following statement true or false?\nThe series interconnection of two linear, time-invariant systems is itself a lin\near, time-invariant system.\nJustify your answer.\n(b) Is the following statement true or false?\nThe series connection of two nonlinear systems is itself nonlinear.\nJustify your answer.\n(c) Consider three systems with the following input-output relations:\nx[n/2],\nn even\nSystem 1:\ny[n] = 1o,\nn odd\nSystem 2:\ny[n] = x[n] + 1x[n - 1] + ix[n -\n2]\nSystem 3:\ny[n] = x[2n]\nSuppose that these systems are connected in series as depicted in Figure P3.10.\nFind the input-output relation for the overall interconnected system. Is this sys\ntem linear? Is it time-invariant?\nx[n]\nSystem 1\n-\nSystem 2\nSystem 3\ny[n]\nFigure P3.10\n(d) Consider a second series interconnection of the form of Figure P3.10 where the\nthree systems are specified by the following equations, with a, b, and c real\nnumbers:\nSystem 1:\ny[n] = x[-n]\nSystem 2:\ny[n] = ax[n -\n1] + bx[n] + cx[n + 1]\nSystem 3:\ny[n] = x[-n]\n\nSignals and Systems\nP3-8\nFind the input-output relation for the overall interconnected system. Under\nwhat conditions on the numbers a, b, and c does the overall system have each\nof the following properties?\n(i)\nThe overall system is linear and time-invariant.\n(ii)\nThe input-output relation of the overall system is identical to that of sys\ntem 2.\n(iii) The overall system is causal.\nP3.11\nDetermine whether each of the following systems is linear and/or time-invariant.\nIn each case, x[n] denotes the input and y[n] denotes the output. Assume that\nx[] > 0.\n(a) y[n] = x[n] + x[n -\n1]\n(b) y[n] = x[n] + x[n -\n1] + x[O]\nP3.12\n(a) Show that causality for a continuous-time linear system implies the following\nstatement:\nFor any time to and any input x(t) such that x(t) = 0 for t < to, the correspond\ning output y(t) must also be zero for t < to.\nThe analogous statement can be made for discrete-time linear systems.\n(b) Find a nonlinear system that satisfies this condition but is not causal.\n(c) Find a nonlinear system that is causal but does not satisfy this condition.\n(d) Show that invertibility for a discrete-time linear system is equivalent to the fol\nlowing statement:\nThe only input that produces the output y[n] = 0 for all n is x[n] = 0 for all n.\nThe analogous statement is also true for continuous-time linear systems.\n(e) Find a nonlinear system that satisfies the condition of part (d) but is not\ninvertible.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nResource: Signals and Systems\nProfessor Alan V. Oppenheim\nThe following may not correspond to a particular course on MIT OpenCourseWare, but has been\nprovided by the author as an individual learning resource.\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Problem Set 4",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/res-6-007-signals-and-systems-spring-2011/cab2602ff858c51113591d17321a80fc_MITRES_6_007S11_hw04.pdf",
      "content": "4 Convolution\nRecommended\nProblems\nP4.1\nThis problem is a simple example of the use of superposition. Suppose that a dis\ncrete-time linear system has outputs y[n] for the given inputs x[n] as shown in Fig\nure P4.1-1.\nInput x[n]\nOutputy [n]\nIII\nxn]\nyi[n]\nn\nn\n-1\n-2\n-1\nx2[n]\n2[n]\nn\nn\n-1\n-1\n2 1\nX3 [n]\ny3[n]\n.-.\nn\n-n\n-1\n-1\nFigure P4.1-1\nDetermine the response y4[n] when the input is as shown in Figure P4.1-2.\nI\nx4[n]\n-1\n-1\nFigure P4.1-2\n(a) Express x 4[n] as a linear combination of x 1[n], x 2[n], and x 3[n].\n(b) Using the fact that the system is linear, determine y4[n], the response to x 4[n].\n(c) From the input-output pairs in Figure P4.1-1, determine whether the system is\ntime-invariant.\nP4-1\n\nSignals and Systems\nP4-2\nP4.2\nDetermine the discrete-time convolution of x[n] and h[n] for the following two\ncases.\n(a)\nh[n]\nx[n]\n0 .11 1 11\n11J\nFiur P42-\n-1\n-1\n3 4\nFigure P4.2-1\n(b)\nh[nI\nx [n ]\nX17\n1 2\n-1\nFigure P4.2-2\nP4.3\nDetermine the continuous-time convolution of x(t) and h(t) for the following three\ncases:\n(a)\nx(t)\nh (t)\nt\nt\nFigure P4.3-1\n\nConvolution / Problems\nP4-3\n(b)\nx(t)\nh (t)\n1-- -(t-\n1) u (t - 1)\nu(t+1\nt\nt\n-1\nFigure P4.3-2\n(c)\nx(t)\nh (t)\nF6(t-2)\n-l\nFigure P4.3-3\nP4.4\nConsider a discrete-time, linear, shift-invariant system that has unit sample re\nsponse h[n] and input x[n].\n(a) Sketch the response of this system if x[n] = b[n -\nno], for some no > 0, and\nh[n] = (i)\"u[n].\n(b) Evaluate and sketch the output of the system if h[n] = (I)\"u[n] and x[n] =\nu[n].\n(c) Consider reversing the role of the input and system response in part (b). That\nis,\nh[n] = u[n],\nx[n] = (I)\"u[n]\nEvaluate the system output y[n] and sketch.\nP4.5\n(a) Using convolution, determine and sketch the responses of a linear, time-invar\niant system with impulse response h(t) = e-t 2 u(t) to each of the two inputs\nx 1(t), x 2(t) shown in Figures P4.5-1 and P4.5-2. Use yi(t) to denote the response\nto x 1(t) and use y2(t) to denote the response to x 2(t).\n\nSignals and Systems\nP4-4\n(i)\nX1(t) = u(t)\nt\nFigure P4.5-1\n(ii)\nx2(t)\nt\nFigure P4.5-2\n(b) x 2(t) can be expressed in terms of x,(t) as\nx 2(t) = 2[x(t) - xi(t -\n3)]\nBy taking advantage of the linearity and time-invariance properties, determine\nhow y 2(t) can be expressed in terms of yi(t). Verify your expression by evalu\nating it with yl(t) obtained in part (a) and comparing it with y 2(t) obtained in\npart (a).\nOptional\nProblems\nP4.6\nGraphically determine the continuous-time convolution of h(t) and x(t) for the\ncases shown in Figures P4.6-1 and P4.6-2.\n\nConvolution / Problems\nP4-5\n(a)\nh(t)\nx(t)\nt\nt1\n(b)\nFigure P4.6-1\nh (t)\nx(t)\nt\nFigure P4.6-2\nt\nP4.7\nCompute the convolution y[n] = x[n] * h[n] when\nx[n] =au[n],\nO < a< 1,\nh[n] =#\"u[n],\n0 < #< 1\nAssume that a and # are not equal.\nP4.8\nSuppose that h(t) is as shown in Figure P4.8 and x(t) is an impulse train, i.e.,\nx(t) = (\noft-kT)\nk= -o0\n\nSignals and Systems\nP4-6\n(a) Sketch x(t).\n(b) Assuming T = 2, determine and sketch y(t) = x(t) * h(t).\nP4.9\nDetermine if each of the following statements is true in general. Provide proofs for\nthose that you think are true and counterexamples for those that you think are\nfalse.\n(a) x[n] *{h[ng[n]} = {x[n] *h[n]}g[n]\n(b) If y(t) = x(t) * h(t), then y(2t) = 2x(2t) * h(2t).\n(c) If x(t) and h(t) are odd signals, then y(t) = x(t) * h(t) is an even signal.\n(d) If y(t) = x(t) * h(t), then Ev{y(t)} = x(t) * Ev{h(t)} + Ev{x(t)} * h(t).\nP4.10\nLet 1 1(t) and 2 2(t) be two periodic signals with a common period To. It is not too\ndifficult to check that the convolution of 1 1(t) and t 2(t) does not converge. However,\nit is sometimes useful to consider a form of convolution for such signals that is\nreferred to as periodicconvolution.Specifically, we define the periodic convolution\nof t 1(t) and X2(t) as\nTO\ng(t) =\nT\n1 (r)-\n2 (t -\nr) dr = t 1(t)*\nt 2(t)\n(P4.10-1)\nNote that we are integrating over exactly one period.\n(a) Show that q(t) is periodic with period To.\n(b) Consider the signal\na + T0\nPa(t)\n1(rF)t2(t\n-\nr) dr,\n=\nfa\nwhere a is an arbitrary real number. Show that\n9(t) = Ya(t)\nHint:Write a = kTo -\nb, where 0\nb < To.\n(c) Compute the periodic convolution of the signals depicted in Figure P4.10-1,\nwhere To = 1.\n\nConvolution / Problems\nP4-7\net\n-1\nR2 (t)\nt\n-1\n-\nFigure P4.10-1\n(d) Consider the signals x1[n] and x 2[n] depicted in Figure P4.10-2. These signals\nare periodic with period 6. Compute and sketch their periodic convolution using\nNo = 6.\nIT I '1\nx, [n]\nI II T II..\n...\nI-61 1 6\n0II\nX2 [n]\n2 1? 11\n-6\nFigure P4.10-2\n(e) Since these signals are periodic with period 6, they are also periodic with period\n12. Compute the periodic convolution of xi[n] and x2[n] using No = 12.\nP4.11\nOne important use of the concept of inverse systems is to remove distortions of some\ntype. A good example is the problem of removing echoes from acoustic signals. For\nexample, if an auditorium has a perceptible echo, then an initial acoustic impulse is\n\nSignals and Systems\nP4-8\nfollowed by attenuated versions of the sound at regularly spaced intervals. Conse\nquently, a common model for this phenomenon is a linear, time-invariant system\nwith an impulse response consisting of a train of impulses:\nh(t) = [\nhkb(t-kT)\n(P4.11-1)\nk=O\nHere the echoes occur T s apart, and hk represents the gain factor on the kth echo\nresulting from an initial acoustic impulse.\n(a) Suppose that x(t) represents the original acoustic signal (the music produced\nby an orchestra, for example) and that y(t) = x(t) * h(t) is the actual signal\nthat is heard if no processing is done to remove the echoes. To remove the dis\ntortion introduced by the echoes, assume that a microphone is used to sense\ny(t) and that the resulting signal is transduced into an electrical signal. We will\nalso use y(t) to denote this signal, as it represents the electrical equivalent of\nthe acoustic signal, and we can go from one to the other via acoustic-electrical\nconversion systems.\nThe important point to note is that the system with impulse response given\nin eq. (P4.11-1) is invertible. Therefore, we can find an LTI system with impulse\nresponse g(t) such that\ny(t) *g(t) = x(t)\nand thus, by processing the electrical signal y(t) in this fashion and then con\nverting back to an acoustic signal, we can remove the troublesome echoes.\nThe required impulse response g(t) is also an impulse train:\ng(t) = (\ngkAot-kT)\nk=O\nDetermine the algebraic equations that the successive gk must satisfy and solve\nfor gi, g2, and g3 in terms of the hk. [Hint: You may find part (a) of Problem 3.16\nof the text (page 136) useful.]\n(b) Suppose that ho = 1, hi = i, and hi = 0 for all i > 2. What is g(t) in this case?\n(c) A good model for the generation of echoes is illustrated in Figure P4.11. Each\nsuccessive echo represents a fedback version of y(t), delayed by T s and scaled\nby a. Typically 0 < a < 1 because successive echoes are attenuated.\nx(t)\n\ny(t)\nDelay\nT\nFigure P4.11\n(i)\nWhat is the impulse response of this system? (Assume initial rest, i.e.,\ny(t) = 0 for t < 0 if x(t) = 0 for t < 0.)\n(ii)\nShow that the system is stable if 0 < a < 1 and unstable if a > 1.\n(iii)\nWhat is g(t) in this case? Construct a realization of this inverse system\nusing adders, coefficient multipliers, and T-s delay elements.\n\nConvolution / Problems\nP4-9\nAlthough we have phrased this discussion in terms of continuous-time systems\nbecause of the application we are considering, the same general ideas hold in\ndiscrete time. That is, the LTI system with impulse response\nh[n] = (\nhkS[n-kN]\nk=O\nis invertible and has as its inverse an LTI system with impulse response\n(g\n[nkN]\nk=O\ng[n] =\n\nIt is not difficult to check that the gi satisfy the same algebraic equations as in\npart (a).\n(d) Consider the discrete-time LTI system with impulse response\nh[n] = ( S[n-kN]\nk=-m\nThis system is not invertible. Find two inputs that produce the same output.\nP4.12\nOur development of the convolution sum representation for discrete-time LTI sys\ntems was based on using the unit sample function as a building block for the rep\nresentation of arbitrary input signals. This representation, together with knowledge\nof the response to 5[n] and the property of superposition, allowed us to represent\nthe system response to an arbitrary input in terms of a convolution. In this problem\nwe consider the use of other signals as building blocks for the construction of arbi\ntrary input signals.\nConsider the following set of signals:\n$[n] = (i)\"u[n],\n#[n ] =\n[n -\nk],\nk = 0,\n1,\n2 3, ....\n(a) Show that an arbitrary signal can be represented in the form\n+ 00\nx[n] =\n(\nak4[n -\nk]\nk=\nby determining an explicit expression for the coefficient ak in terms of the values\nof the signal x[n]. [Hint:What is the representation for 6[n]?]\n(b) Let r[n] be the response of an LTI system to the input x[n] = #[n]. Find an\nexpression for the response y[n] to an arbitrary input x[n] in terms of r[n] and\nx[n].\n(c) Show that y[n] can be written as\ny[n] = 0[n] * x[n] * r[n]\nby finding the signal 0[n].\n(d) Use the result of part (c) to express the impulse response of the system in terms\nof r[n].Also, show that\n0[n] *#[n] = b[n]\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nResource: Signals and Systems\nProfessor Alan V. Oppenheim\nThe following may not correspond to a particular course on MIT OpenCourseWare, but has been\nprovided by the author as an individual learning resource.\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Problem Set 5",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/res-6-007-signals-and-systems-spring-2011/7b78bd1fa3c324d9fc38d2cd4712fa85_MITRES_6_007S11_hw05.pdf",
      "content": "5 Properties of Linear,\nTime-Invariant Systems\nRecommended\nProblems\nP5.1\nConsider an integrator that has the input-output relation\ny(t) =\nx(r) dr\nDetermine the input-output relation for the inverse system.\nP5.2\nThe first-order difference equation y[n] -\nay[n -\n1] = x[n], 0 < a < 1, describes a\nparticular discrete-time system initially at rest.\n(a) Verify that the impulse response h[n] for this system is h[n] = a'u[n].\n(b) Is the system\n(i)\nmemoryless?\n(ii)\ncausal?\n(iii)\nstable?\nClearly state your reasoning.\n(c) Is this system stable if |a I > 1?\nP5.3\nThe first-order differential equation\ndy(t) + 2y(t) = x(t)\ndt\ndescribes a particular continuous-time system initially at rest.\n(a) Verify that the impulse response of this system is h(t) = e - 2 u(t).\n(b) Is this system\n(i)\nmemoryless?\n(ii)\ncausal?\n(iii)\nstable?\nClearly state your reasoning.\nP5-1\n\nSignals and Systems\nP5-2\nP5.4\nConsider the linear, time-invariant system in Figure P5.4, which is composed of a\ncascade of two LTI systems. u(t) is a unit step signal and s(t) is the step response\nof system L.\ns(t)\nu(t) -\nL\nd/dt\ny(t)\nFigure P5.4\nUsing the fact that the overall response of LTI systems in cascade is indepen\ndent of the order in which they are cascaded, show that the impulse response of\nsystem L is the derivative of its step response, i.e.,\nh(t) = ds(t)\ndit\nP5.5\nConsider the cascade of two systems shown in Figure P5.5. System B is the inverse\nof system A.\nx(t)\nLTI\ny(t)\nSystem\nw(t)\nInput\nSystem\nA\nB\nOutput\nFigure P5.5\n(a) Suppose the input is b(t). What is the output w(t)?\n(b) Suppose the input is some more general signal x(t). What is the output w(t) in\nterms of x(t)?\nOptional\nProblems\nP5.6\n(a) Consider again the cascade of two systems presented in Problem P5.5. Suppose\nan input x1(t) produces yi(t) as system A output and an input x 2(t) produces\ny2(t) as system A output. What is w(t) if the input is such that y(t), the output\nof system A, is ay 1(t) + by 2(t) with a, b constants?\n(b) Suppose an input x 1(t) produces yi(t) as system A output. What is w(t) if x(t)\nis such that y(t) = y 1(t - r)?\n(c) Is system B an LTI system? Justify your answer.\n\nProperties of Linear, Time-Invariant Systems / Problems\nP5-3\nP5.7\nConsider the three discrete-time signals shown in Figure P5.7.\nx[n]\ny[n]\ne---\nn\nn\n-1\n-1\nw[n]\ne\ne\nn\n0 1\nFigure P5.7\n(a) Verify the distributive law of convolution:\n(x + w) * y = (x * y) + (w * y)\n(b) You may have noticed a similarity between the convolution operation and mul\ntiplication, but they are not equivalent. Verify that\n(x * y) - w # x * (y - w)\nP5.8\nLet y(t) = x(t) * h(t). Show the following.\ndy(t)\ndh(t)\ndx(t)\n(a)\nt=\nx(t) *\n=t d\n*h(t)\ndt\ndt\ndt\n(b) y(t) = (J'_ x(r) dr) * h'(t)\n(c) y(t) = f'_[x'(r) * h(r)] dr\n(d) y(t) = x'(t) *J'_,h(r)dr\nP5.9\nDetermine if each of the following statements concerning LTI systems is true or\nfalse. Justify your answers.\n(a) If h(t) is the impulse response of an LTI system and h(t) is periodic and non\nzero, the system is unstable.\n\nSignals and Systems\nP5-4\n(b) The inverse of a causal LTI system is always causal.\n(c) If Ih[n] 5 K for each n, where K is a given number, then the LTI system with\nh[n] as its impulse response is stable.\n(d) If a discrete-time LTI system has an impulse response h[n] of finite duration,\nthe system is stable.\n(e) If an LTI system is causal, it is stable.\n(f) The cascade of a noncausal LTI system with a causal one is necessarily\nnoncausal.\n(g) A continuous-time LTI system is stable if and only if its step response s(t) is\nabsolutely integrable, i.e.,\n|s(t)I dt < oo\n(h) A discrete-time LTI system is causal if and only if its step response s[n] is zero\nfor n < 0.\nP5.10\nIn Section 3.7 of the text we characterized the unit doublet through the equation\nx(t) * u 1(t) =\nx(t -\nr)ui(r)dr = x'(t)\n(P5.10-1)\nfor any signal x(t). From this equation we derived the fact that\nf+\ng(r)ui(r)d-r = -g'(0)\n(P5.10-2)\n(a) Show that eq. (P5.10-2) is an equivalent characterization of ui(t) by showing\nthat eq. (P5.10-2) implies eq. (P5.10-1). [Hint:Fix t and define the signal g(r)\nx(t -\nr).]\nThus we have seen that characterizing the unit impulse or unit doublet by how\nit behaves under convolution is equivalent to characterizing how it behaves under\nintegration when multiplied by an arbitrary signal g(t). In fact, as indicated in Sec\ntion 3.7 of the text, the equivalence of these operational definitions holds for all\nsignals and in particular for all singularity functions.\n(b) Let f(t) be a given signal. Show that\nf(t)ui(t) = f(0)ui(t) - f'(0)3(t)\nby showing that both have the same operational definitions.\n(c) Determine the value of\nJ\nX(r)u 2(r) dr\n(d) Find an expression for f(t)u2(t) analogous to that considered in part (b) for\nf(t)ui(t).\n\nProperties of Linear, Time-Invariant Systems / Problems\nP5-5\nP5.11\nConsider the cascade of two systems H and G as shown in Figure P5.11.\n-1\nH\nG\nFigure P5.11\n(a) If H and G are both LTI causal systems, prove that the overall system is causal.\n(b) If H and G are both stable systems, show that the overall system is stable.\nP5.12\nFind the combined impulse response of the LTI system in Figure P5.12. Recall that\nx(t)* h(t) * h-1(t) = x(t).\nx(t)\nh2]--N\nh2\n+\nh1\nh-2\ny(t)\nr..\n..\n\nh\nFigure P5.12\nP5.13\nFind the necessary and sufficient condition on the impulse response h[n] such that\nfor any input x[n],\nmax {Ix[n]I} > max {Iy[n]|},\nwhere y[n] = x[n] * h[n].\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nResource: Signals and Systems\nProfessor Alan V. Oppenheim\nThe following may not correspond to a particular course on MIT OpenCourseWare, but has been\nprovided by the author as an individual learning resource.\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Problem Set 6",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/res-6-007-signals-and-systems-spring-2011/f459a0f4f110bfbe4014ac71638a963b_MITRES_6_007S11_hw06.pdf",
      "content": "6 Systems Represented by\nDifferential and Difference\nEquations\nRecommended\nProblems\nP6.1\nSuppose that y 1(t) and y 2(t) both satisfy the homogeneous linear constant-coeffi\ncient differential equation (LCCDE)\ndy(t) + ay(t) = 0\ndt\nShow that y 3(t) = ayi(t) +\n3y2(t), where a and # are any two constants, is also a\nsolution to the homogeneous LCCDE.\nP6.2\nIn this problem, we consider the homogeneous LCCDE\nd2yt + 3 dy(t) + 2y(t) = 0\n(P6.2-1)\ndt2\ndt\n(a) Assume that a solution to eq. (P6.2-1) is of the form y(t) = es'. Find the qua\ndratic equation that s must satisfy, and solve for the possible values of s.\n(b) Find an expression for the family of signals y(t) that will satisfy eq. (P6.2-1).\nP6.3\nConsider the LCCDE\ndy(t) + 1 y(t) = x(t),\nx(t) = e- t u(t)\n(P6.3-1)\ndt\n(a) Determine the family of signals y(t) that satisfies the associated homogeneous\nequation.\n(b) Assume that for t > 0, one solution of eq. (P6.3-1), with x(t) as specified, is of\nthe form\ny 1(t) = Ae-,\nt > 0\nDetermine the value of A.\n(c) By substituting into eq. (P6.3-1), show that\ny 1(t) = [2e -t/2 -\n2e-']u(t)\nis one solution for all t.\nP6-i\n\nSignals and Systems\nP6-2\nP6.4\nConsider the block diagram relating the two signals x[n] and y[n] given in Figure\nP6.4.\nx[n]\n+\n1 y[n]\nFigure P6.4\nAssume that the system described in Figure P6.4 is causal and is initially at rest.\n(a) Determine the difference equation relating y[n] and x[n].\n(b) Without doing any calculations, determine the value of y[ -5] when x[n] = u[n].\n(c) Assume that a solution to the difference equation in part (a) is given by\ny[n] = Kanu[n]\nwhen x[n] = b[n]. Find the appropriate value of K and a, and verify that y[n]\nsatisfies the difference equation.\n(d) Verify your answer to part (c) by directly calculating y[O], y[l], and y[2].\nP6.5\nFigure P6.5 presents the direct form II realization of a difference equation. Assume\nthat the resulting system is linear and time-invariant.\nx[n]\nO +\nr0n]\ny[n]\nD\n+1\n-2\nFigure P6.5\n(a) Find the direct form I realization of the difference equation.\n(b) Find the difference equation described by the direct form I realization.\n(c) Consider the intermediate signal r[n] in Figure P6.5.\n(i)\nFind the relation between r[n] and y[n].\n(ii)\nFind the relation between r[n] and x[n].\n(iii)\nUsing your answers to parts (i) and (ii), verify that the relation between\ny[n] and x[n] in the direct form II realization is the same as your answer\nto part (b).\n\nSystems Represented by Differential and Difference Equations / Problems\nP6-3\nP6.6\nConsider the following differential equation governing an LTI system.\ndytt)\ndx(t)\ndt + ay(t) = b di\n+ cx(t)\n(P6.6-1)\ndt\ndt\n(a) Draw the direct form I realization of eq. (P6.6-1).\n(b) Draw the direct form II realization of eq. (P6.6-1).\nOptional\nProblems\nP6.7\nConsider the block diagram in Figure P6.7. The system is causal and is initially at\nrest.\nr [n]\nx [n]\n+\ny [n]\nD\n-4\nFigure P6.7\n(a) Find the difference equation relating x[n] and y[n].\n(b) For x[n] = [n], find r[n] for all n.\n(c) Find the system impulse response.\nP6.8\nConsider the system shown in Figure P6.8. Find the differential equation relating\nx(t) and y(t).\nx(t)\n+\na\nr(t)\n+\ny t\na\nb\nFigure P6.8\n\nSignals and Systems\nP6-4\nP6.9\nConsider the following difference equation:\ny[n] - ly[n -\n1] = x[n]\n(P6.9-1)\nwith\nx[n] = K(cos gon)u[n]\n(P6.9-2)\nAssume that the solution y[n] consists of the sum of a particular solution y,[n] to\neq. (P6.9-1) for n\n0 and a homogeneous solution yjn] satisfying the equation\nYh[flI -\n12Yhn -\n1]\n=0.\n(a) If we assume that Yh[n] = Az\", what value must be chosen for zo?\n(b) If we assume that for n\n0,\ny,[n] = B cos(Qon + 0),\nwhat are the values of B and 0? [Hint: It is convenient to view x[n] =\nRe{Kej\"onu[n]} and y[n] = Re{Ye\"onu[n]}, where Y is a complex number to be\ndetermined.]\nP6.10\nShow that if r(t) satisfies the homogeneous differential equation\nm d=r(t)\ndt\nand if s(t) is the response of an arbitrary LTI system H to the input r(t), then s(t)\nsatisfies the same homogeneous differential equation.\nP6.11\n(a) Consider the homogeneous differential equation\nN\ndky)\nk~=0\n(P6.11-1)\ndtk\nk=ak\nShow that if so is a solution of the equation\nN\np(s) = E akss = 0,\n(P6.11-2)\nk=O\nthen Aeso' is a solution of eq. (P6.11-1), where A is an arbitrary complex\nconstant.\n(b) The polynomial p(s) in eq. (P6.11-2) can be factored in terms of its roots\nS1, ...\n,S,.:\np(s) = aN(S -\nSI)1P(S -\nS2)2 .\n.\n. (S -\nSr)ar,\nwhere the si are the distinct solutions of eq. (P6.11-2) and the a are their mul\ntiplicities.Note that\nU1 + o2 +\n+ Ur = N\nIn general, if a, > 1, then not only is Ae''' a solution of eq. (P6.11-1) but so\nis Atiesi' as long as j is an integer greater than or equal to zero and less than or\n\nSystems Represented by Differential and Difference Equations / Problems\nP6-5\nequal to oa -\n1. To illustrate this, show that if ao = 2, then Atesi is a solution\nof eq. (P6.11-1). [Hint:Show that if s is an arbitrary complex number, then\nN\nak dtk\n= Ap(s)te't + A\nestI\nThus, the most general solution of eq. (P6.11-1) is\np\nci-1\n(\nAesi ,\ni=1 j=0\nwhere the Ai, are arbitrary complex constants.\n(c) Solve the following homogeneous differential equation with the specified aux\niliary conditions.\nd 2 y(t)\ndy(t)\n2 + 2\n+ y(t) = 0,\ny(0) = 1, y'() = 1\ndt2\ndt\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nResource: Signals and Systems\nProfessor Alan V. Oppenheim\nThe following may not correspond to a particular course on MIT OpenCourseWare, but has been\nprovided by the author as an individual learning resource.\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Problem Set 7",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/res-6-007-signals-and-systems-spring-2011/bab467e6b94d56a6db87db20008f79e3_MITRES_6_007S11_hw07.pdf",
      "content": "7 Continuous-Time Fourier Series\nRecommended\nProblems\nP7.1\n(a) Suppose that the signal ei\" is applied as the excitation to a linear, time-invar\niant system that has an impulse response h(t). By using the convolution inte\ngral, show that the resulting output is H(w)ew, where H(w) = f\". h(r)e-jw dr.\n(b) Assume that the system is characterized by a first-order differential equation\ndy(t) + ay(t) = x(t).\ndt\nIf x(t) = ejw\" for all t, then y(t) = H(w)eo\" for all t. By substituting into the\ndifferential equation, determine H(w).\nP7.2\n(a) Suppose that z\", where z is a complex number, is the input to an LTI system that\nhas an impulse response h[n]. Show that the resulting output is given by H(z)z\",\nwhere\nH(z) =\nE\nh[n]z-\".\n(b) If the system is characterized by a first-order difference equation,\ny[n] + ay[n -\n1] = x[n],\ndetermine H(z).\nP7.3\nFind the Fourier series coefficients for each of the following signals:\n(a) x(t) = sin (lort +\n(b) x(t) = 1 + cos (21rt)\n(c) x(t) = [1 + cos (27rt)] [sin (1ort +\nHint: You may want to first multiply the terms and then use appropriate trigo\nnometric identities.\nP7.4\nBy evaluating the Fourier series analysis equation, determine the Fourier series for\nthe following signals.\nP7-1\n\nSignals and Systems\nP7-2\n(a)\nx(t)\n-4\n-3\n-2\n-1\n-1 - -\n\\\nt\n(b)\nFigure P7.4-1\nx( t)\n-3\n-1\n-2\nFigure P7.4-2\nP7.5\nWithout explicitly evaluating the Fourier series coefficients, determine which of the\nperiodic waveforms in Figures P7.5-1 to P7.5-3 have Fourier series coefficients with\nthe following properties:\n(i)\nHas only odd harmonics\n(ii)\nHas only purely real coefficients\n(iii)\nHas only purely imaginary coefficients\n(a)\ncos t\nFu\n|\n|\n27r\nt\nFigure P7.5-1\n\nContinuous-Time Fourier Series / Problems\nP7-3\n(b)\nt\nS\nFigure P7.5-2\n(c)\n-5\n-6\n-4\n-3\n-l\n1 2\n3 4\n6 7\nFigure P7.5-3\nOptional\nProblems\nP7.6\nSuppose x(t) is periodic with period T and is specified in the interval 0 < t < T/4\nas shown in Figure P7.6.\nx(t)\n{t\nT\nT\nFigure P7.6\nSketch x(t) in the interval 0 < t < T if\n(a) the Fourier series has only odd harmonics and x(t) is an even function;\n(b) the Fourier series has only odd harmonics and x(t) is an odd function.\nP7.7\nLet x(t) be a periodic signal, with fundamental period To and Fourier series coeffi\ncients a,. Consider the following signals. The Fourier series coefficients for each can\n\nSignals and Systems\nP7-4\nbe expressed in terms of the ak as in Table 4.2 (page 224) of the text. Show that the\nexpression in Table 4.2 is correct for each signal.\n(a) x(t -\nto)\n(b) x(-t)\n(c) x*(t)\n(d) x(at), a > 0 (Determine the period of the signal.)\nP7.8\nAs we have seen in this lecture, the concept of an eigenfunction is an extremely\nimportant tool in the study of LTI systems. The same can also be said of linear but\ntime-varying systems. Consider such a system with input x(t) and output y(t). We\nsay that a signal #(t) is an eigenfunction of the system if\n#(t) - Xt)\nThat is, if x(t) = #(t), then y(t) = k(t), where the complex constant Xis called the\neigenvalue associatedwith #(t).\n(a) Suppose we can represent the input x(t) to the system as a linear combination\nof eigenfunctions $j(t), each of which has a corresponding eigenvalue Xk.\n *\nxMt\n=\n>7\nCAMx(\nk= -o\nExpress the output y(t) of the system in terms of {Ck}, {O(t)}, and {Xk}.\n(b) Show that the functions #(O\n= tk are eigenfunctions of the system character\nized by the differential equation\nd x(t)\ndx(t)\ndt'\ndt\nFor each $k(t), determine the corresponding eigenvalue Xk.\nP7.9\nIn the text and in Problem P4.10 in this manual, we defined the periodic convolution\nof two periodic signals 21(t) and 2 2(t) that have the same period To. Specifically, the\nperiodic convolution of these signals is defined as\n9(t) = 21(t) @ 22 (t) =\n21(r)t 2 (t - r) dr\n(P7.9-1)\nAs shown in Problem P4.10, any interval of length To can be used in the integral in\neq. (P7.9-1), and 9(t) is also periodic with period To.\n(a) If 21(t), t 2(t), and 9(t) have Fourier series representations\n+o+o0\n+o0\n=\naike2r/o~t,\n2(t) = (\nbkeik( 2,rot,\ntt) = (3\nce2.rot\nk=-o0\nk=-o0\nk=-o\nshow that Ck = Toakbk.\n(b) Consider the periodic signal t(t) depicted in Figure P7.9-1. This signal is the\nresult of the periodic convolution of another periodic signal, 2(t), with itself.\n\nContinuous-Time Fourier Series / Problems\nP7-5\nFind z(t) and then use part (a) to determine the Fourier series representation\nfor 1(t).\nx(t)\n-5\n-3\n-2\nFigure P7.9-1\n(c) Suppose now that x 1(t) and x 2(t) are the finite-duration signals illustrated in\nFigure P7.9-2(a) and (b). Consider forming the periodic signals 2 1(t) and 2 2 (t),\nwhich consist of periodically repeated versions of x 1(t) and x 2(t) as illustrated\nfor 2 1(t) in Figure P7.9-2(c). Let y(t) be the usual, aperiodic convolution of x 1(t)\nand x 2(t),\ny(t) = x 1 (t) * X2(),\nand let P(t) be the periodic convolution of t 1(t) and t 2(t),\nX0t\n=\n21l(t) @ 2t2(t)\nShow that if To is large enough, we can recover y(t) completely from one period\nof P(t), that is,\n9(t),\n|t| 5 To/2,\nYM-\n0,\n|t | > To/2\nx1 (t)\nI\nI\nI\nt\n-T\nT\n(a)\nx2(t)\net\ne\n-T\nT\n(b)\nx1 (t)\n\"t\nTo\n-T\nT\nTo\n(c)\nFigure P7.9-2\n\nSignals and Systems\nP7-6\nP7.10\nThe purpose of this problem is to show that the representation of an arbitrary peri\nodic signal by a Fourier series, or more generally by a linear combination of any set\nof orthogonal functions, is computationally efficient and in fact is very useful for\nobtaining good approximations of signals. (See Problem 4.7 [page 254] of the text\nfor the definitions of orthogonal and orthonormal functions.)\nSpecifically, let {#o(t)}, i = 0, + 1, i 2, . . . , be a set of orthonormal functions on\nthe interval a\nt\nb, and let x(t) be a given signal. Consider the following approx\nimation of x(t) over the interval a\nt -\nb:\n+N\nN~t\n=\najo(t),\n(P7. 10-i1)\ni=-N\nwhere the a, are constants (in general, complex). To measure the deviation between\nx(t) and the series approximation tN(t), we consider the error eN(t) defined as\neN(t) = x(t) -\ntNAht)\n(P7.10-2)\nA reasonable and widely used criterion for measuring the quality of the approxi\nmation is the energy in the error signal over the interval of interest, that is, the\nintegral of the squared-error magnitude over the interval a - t 5 b:\nE =\nleN(t) 2 dt\n(P7.10-3)\n(a) Show that E is minimized by choosing\nai = f\nb\nx(t)$7(t) dt\n(P7.10-4)\nHint: Use eqs. (P7.10-1) to (P7.10-3) to express E in terms of aj, 4i(t), and x(t).\nThen express ai in rectangular coordinates as ai = bi + jci, and show that the\nequations\n9E\nOE\n-\n= 0\nand\n-=0,\ni = 0, +1, +2,\n. .. , iN,\nabi\naci\nare satisfied by the ai as given in eq. (P7.10-4).\n(b) Determine how the result of part (a) changes if the {#o(t)} are orthogonal but not\northonormal, with\nAi =\n|fa\nI\n)|12 dt\n(c) Let #n(t) = e \"Oo'and choose any interval of length To = 27r/wo. Show that the ai\nthat minimize E are as given in eq. (4.45) of the text (page 180).\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nResource: Signals and Systems\nProfessor Alan V. Oppenheim\nThe following may not correspond to a particular course on MIT OpenCourseWare, but has been\nprovided by the author as an individual learning resource.\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Problem Set 8",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/res-6-007-signals-and-systems-spring-2011/f6a14de1d6c3b5579ddc8216a9f59449_MITRES_6_007S11_hw08.pdf",
      "content": "8 Continuous-Time\nFourier Transform\nRecommended\nProblems\nP8.1\nConsider the signal x(t), which consists of a single rectangular pulse of unit height,\nis symmetric about the origin, and has a total width T1.\n(a) Sketch x(t).\n(b) Sketch t(t), which is a periodic repetition of x(t) with period To = 3T 1/2.\n(c) Compute X(w), the Fourier transform of x(t). Sketch IX(w) I for Iw s 6w/Ti.\n(d) Compute a,, the Fourier series coefficients of t(t). Sketch ak for k = 0 +1,\n+2,\n3.\n(e) Using your answers to (c) and (d), verify that, for this example,\nak = 1-XM\n(w) /\n(f) Write a statement that indicates how the Fourier series for a periodic function\ncan be obtained if the Fourier transform of one period of this periodic function\nis given.\nP8.2\nFind the Fourier transform of each of the following signals and sketch the magni\ntude and phase as a function of frequency, including both positive and negative\nfrequencies.\n(a) b(t -\n5)\n(b) e -a'u(t),\na real, positive\n(c) e (-I+j2 )tu(t)\nP8.3\nIn this problem we explore the definition of the Fourier transform of a periodic\nsignal.\n(a) Show that if x3(t) = axi(t) + bx 2(t), then X3(w) = aXi(w) + bX 2(w).\n(b) Verify that\ne-=\n-\n2,7b(w -\nwo)ej-t dw\nFrom this observation, argue that the Fourier transform of eiwO' is 27rb(w -\nwo).\n(c) Recall the synthesis equation for the Fourier series:\nk= -00\nP8-1\n\nSignals and Systems\nP8-2\nBy taking the Fourier transform of both sides and using the results to parts (a)\nand (b), show that\n2irk\nk~)= 2ra\nT\n(d) Sketch X(w) for your answer to Problem P8.1(d) for I oI\n4ir/To.\nP8.4\n(a) Consider the often-used alternative definition of the Fourier transform, which\nwe will call X,(f). The forward transform is written as\nXa(f) = f\nx(t)e\n-j 2 ft dt,\nwhere f is the frequency variable in hertz. Derive the inverse transform formula\nfor this definition. Sketch X(f) for the signal discussed in Problem P8.1.\n(b) A second, alternative definition is\n.\nXb(v) =\nx(t)ej\" dt\nFind the inverse transform relation.\nP8.5\nConsider the periodic signal t(t) in Figure P8.5-1, which is composed solely of\nimpulses.\nX(t)\n'e\n'\nt\n-7\n-6\n-S\n-4\n-3\n-2\n-1\nFigure P8.5-1\n(a) What is the fundamental period To?\n(b) Find the Fourier series of I(t).\n(c) Find the Fourier transform of the signals in Figures P8.5-2 and P8.5-3.\n(i)\nI\nI\n\nContinuous-Time Fourier Transform / Problems\nP8-3\n(ii)\nx 2(t)\n2t\nFigure P8.5-3\n(d) 2(t) can be expressed as either xi(t) periodically repeated or x 2(t) periodically\nrepeated, i.e.,\n)=\nxi(t -\nkTi),\nor\n(P8.5-1)\nk=--00\nX)= E x 2(t - kT2)\n(P8.5-2)\nk= -oo\nDetermine T, and T2 and demonstrate graphically that eqs. (P8.5-1) and\n(P8.5-2) are valid.\n(e) Verify that the Fourier series of X(t) is composed of scaled samples of either\nXI(w) or X 2(w).\nP8.6\nFind the signal corresponding to the following Fourier transforms.\n(a) X.(w) =\n.\n(b)\nXb(W)2-\n-7\nFigure P8.6-1\n(c) Xe(W) = 9 + W2\nSee Example 4.8 in the text (page 191).\n(d) Xd(w) = X.(x)Xb(w), where X(w) andXb(w) are given in parts (a) and (b), respec\ntively. Try to simplify as much as possible.\n\nSignals and Systems\nP8-4\n(e)\nIXe(Co)l\n4 Xe o\n1 -\n-1\n+1\nFigure P8.6-2\nOptional\nProblems\nP8.7\nIn earlier lectures, the response of an LTI system to an input x(t) was shown to be\ny(t) = x(t) * h(t), where h(t) is the system impulse response.\n(a) Using the fact that\ny(t) = x(t) * h(t) =\nx(r)h(t -\nr) dr,\nshow that\nY(w) = f f x(r-)h(t -\nr)e j dr dt\n(b) By appropriate change of variables, show that\nY(w) = X(w)H(w),\nwhere X(w) is the Fourier transform of x(t), and H(w) is the Fourier transform\nof h(t).\nP8.8\nConsider the impulse train\np(t) =\n( ot\n-\nkT)\nk=-0\nshown in Figure P8.8-1.\n\nContinuous-Time Fourier Transform / Problems\nP8-5\np (t)\nt\n-2T\n-T\nT\n2T\nFigure P8.8-1\n(a) Find the Fourier series of p(t).\n(b) Find the Fourier transform of p(t).\n(c) Consider the signal x(t) shown in Figure P8.8-2, where Ti < T.\nx( t)\n-T\n_T\nT1\nT\nFigure P8.8-2\nShow that the periodic signal t(t), formed by periodically repeating x(t),\nsatisfies\n2(t) = x(t)* p(t)\n(d) Using the result to Problem P8.7 and parts (b) and (c) of this problem, find the\nFourier transform of t(t) in terms of the Fourier transform of x(t).\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nResource: Signals and Systems\nProfessor Alan V. Oppenheim\nThe following may not correspond to a particular course on MIT OpenCourseWare, but has been\nprovided by the author as an individual learning resource.\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Problem Set 9",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/res-6-007-signals-and-systems-spring-2011/3eda274513d541c44c8f8e1820810bc7_MITRES_6_007S11_hw09.pdf",
      "content": "9 Fourier Transform Properties\nRecommended\nProblems\nP9.1\nDetermine the Fourier transform of x(t) = e-t/u(t) and sketch\n(a) IX(w)I\n(b) <tX(w)\n(c) Re{X(w)}\n(d) Im{X(w)}\nP9.2\nFigure P9.2 shows real and imaginary parts of the Fourier transform of a signal\nx(t).\nRe Ix (C)\n]In I(X(O))\n-W\nW\n-W\nW\nFigure P9.2\n(a) Sketch the magnitude and phase of the Fourier transform X(W).\n(b) In general, if a signal x(t) is real, then X(-w) = X*(w). Determine whether x(t)\nis real for the Fourier transform sketched in Figure P9.2.\nP9.3\nDetermine which of the Fourier transforms in Figures P9.3-1 and P9.3-2 correspond\nto real-valued time functions.\n(a)\nIX(W)|\n4 X(co)\nCF\nCO\nFigure P9.3-1\nP9-1\n\nSignals and Systems\nP9-2\n(b)\nRel X()t = XR (W)\nIm IX(W)= X, (W)\n2lr\n-W\nW\nI\nFigure P9.3-2\nP9.4\n(a) By considering the Fourier analysis equation or synthesis equation, show the\nvalidity in general of each of the following statements:\n(i)\nIf x(t) is real-valued, then X(o) = X*(-c).\n(ii)\nIf x(t) = x*(- t), then X(w) is real-valued.\n(b) Using the statements in part (a), show the validity of each of the following\nstatements:\n(i)\nIf x(t) is real and even, then X(o) is real and even.\n(ii)\nIf x(t) is real and odd, then X(w) is imaginary and odd.\nP9.5\n(a) In the lecture, we derived the transform of x(t) = e -'u(t).Using the linearity\nand scaling properties, derive the Fourier transform of e -\"t = x(t) + x(- t).\n(b) Using part (a) and the duality property, determine the Fourier transform of\n1/(1 + t2\n(c) If\nr(t) = 1 + (3t) 2\nfind R(w).\n(d) x(t) is sketched in Figure P9.5. If y(t) = x(t/2), sketch y(t), Y(w), and X(w).\nx(t)\nA\n-T\nT\nFigure P9.5\n\nFourier Transform Properties / Problems\nP9-3\nP9.6\nShow the validity of the following statements:\n(a) x(O) =\n-\nX(w) dw\n27r\n-o\n(b) X(O) =\nx(t) dt\nP9.7\nThe output of a causal LTI system is related to the input x(t) by the differential\nequation\nly(t) + 2y(t) = x(t)\ndt\n(a) Determine the frequency response H(w) = Y(w)/X(w) and sketch the phase and\nmagnitude of H(w).\n(b) If x(t) = e- tu(t), determine Y(w), the Fourier transform of the output.\n(c) Find y(t) for the input given in part (b).\nP9.8\nBy first expressing the triangular signal x(t) in Figure P9.8 as the convolution of a\nrectangular pulse with itself, determine the Fourier transform of x(t).\nx (t)\nt\n-2\nFigure P9.8\nOptional\nProblems\nP9.9\nUsing Figure P9.9-1, determine y(t) and sketch Y(w) if X(w) is given by Figure\nP9.9-2. Assume w, > wo.\n\nSignals and Systems\nP9-4\nx(t)\nI\nN y(t)\ncos (wet)\nFigure P9.9-1\nX(W)\n-W0\nW0\nFigure P9.9-2\nP9.10\nCompute the Fourier transform of each of the following signals:\n(a) [e~a cos wotlu(t),\na > 0\n(b) e\n31 sin 2t\n(C) sin irt\nsin 2irt\nrt\nrt\nP9.11\nConsider the following linear constant-coefficient differential equation (LCCDE):\ndy(t) + 2y(t) = A cos wet\ndt\nFind the value of wo such that y(t) will have a maximum amplitude of A/3. Assume\nthat the resulting system is linear and time-invariant.\nP9.12\nSuppose an LTI system is described by the following LCCDE:\nd'ytt)\n2dytt)\n4dx(t)\ndt2\n+\ndt\n+ 3y(t) =\ndt\n- x(t)\n\nFourier Transform Properties / Problems\nP9-5\n(a) Show that the left-hand side of the equation has a Fourier transform that can\nbe expressed as\nA(w)Y(w),\nwhere Y(w) = J{y(t)}\nFind A(w).\n(b) Similarly, show that the right-hand side of the equation has a Fourier transform\nthat can be expressed as\nB(w)X(w),\nwhere X(w) =\n{x(t)}\n(c) Show that Y(w) can be expressed as Y(w) = H(w)X(w) and find H(w).\nP9.13\nFrom Figure P9.13, find y(t) where\nx(t) = sin(wot)\nt\nand\nh(t) = sin(2wot)\nt\nx(t)\nh(t)\nyt)\nFigure P9.13\nP9.14\n(a) Determine the energy in the signal x(t) for which the Fourier transform X(w) is\ngiven by Figure P9.14.\n(b) Find the inverse Fourier transform of X(w) of part (a).\n\nSignals and Systems\nP9-6\nP9.15\nSuppose that the system F takes the Fourier transform of the input, as shown in\nFigure P9.15-1.\nx(t)\ni\nF\n-\ny(t)=2nX(--w)\nFigure P9.15-1\nWhat is w(t) calculated as in Figure P9.15-2?\nxt)M\nF\nO\nF\nF\n0 w(t)\nFigure P9.15-2\nP9.16\nUse properties of the Fourier transform to show by induction that the Fourier trans\nform of\ntn-i\nx(t) = (n -\n- 1)!1-U(t),\na > 0\nX(w) = (a + jo)\"\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nResource: Signals and Systems\nProfessor Alan V. Oppenheim\nThe following may not correspond to a particular course on MIT OpenCourseWare, but has been\nprovided by the author as an individual learning resource.\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Problem Set 10",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/res-6-007-signals-and-systems-spring-2011/d3e4ed69c3cbba40a820e233c1b165c9_MITRES_6_007S11_hw10.pdf",
      "content": "10 Discrete-Time Fourier Series\nRecommended\nProblems\nP10.1\nConsider a discrete-time system with impulse response\nh[n] = (I)\"U[n]\nDetermine the response to each of the following inputs:\n(a) x[n] = (-1)\" = e-i'n\nfor all n\n(b) x[n] = ein/4)\nfor all n\n(c) x[n] = cos\n+ 8\nfor all n\nP10.2\nConsider the following two periodic sequences:\n!,[n] = 1 + sin 2rn\n(P10.2-1)\n210 J\n22[n] = 1 + sin\nn + I\n(P10.2-2)\n(a) Determine the period of xi[n] and of x2[n].\n(b) Determine the sequence of Fourier series coefficients alk for xi[n] and a 2k for\nX2[fl].\n(c) In each case, the sequence of Fourier series coefficients is periodic. Determine\nthe period of the sequence ai, and the sequence a2k.\nP10.3\nDetermine the Fourier series coefficients for the three periodic sequences shown in\nFigures P10.3-1 to P10.3-3. Since these three sequences all have the same nonzero\nvalues over one period, we suggest that you first determine an expression for the\nenvelope of the Fourier series coefficients and then sample this envelope at the\nappropriate spacings in each case.\n(a)\nP10-1\n\nSignals and Systems\nP10-2\n(b)\n2 [n]\n(c)\n-1 0\nFigure P10.3-2\nIII*****1 1\n-1\nFigure P10.3-3\n00-*p\n*see n\nP10.4\n(a) Determine and sketch the discrete-time Fourier transform of the sequence\nFigure P10.4-1.\nin\nx [n]\n(b)\nT 2\nn\nFigure P10.4-I\nUsing your result in part (a), determine the discrete-time Fourier series of the\ntwo periodic sequences in Figure P10.4-2.\n-2[ I\nn\nn\nFigure P10.4-2\n\nDiscrete-Time Fourier Series / Problems\nP10-3\nP10.5\nConsider the signal x[n] depicted in Figure P10.5. This signal is periodic with period\nN = 4. The signal x[n] can be expressed in terms of a discrete-time Fourier series:\nx[n] =\nakejk(2r/4)n\n(P10.5-1)\nk=O\nAs mentioned in the text, one way to determine the Fourier series coefficients is to\ntreat eq. (P10.5-1) as a set of four linear equations [eq. (P10.5-1) for n = 0, 1, 2, 3]\nin the four unknowns (aO, ai, a 2, and a3).\nx[n]\nn\n-8 1-4\nFigure P10.5\n(a) Explicitly write out the four equations and solve them directly using any stan\ndard technique for solving four equations in four unknowns. (Be sure to first\nreduce the complex exponentials to the simplest form.)\n(b) Check your answer by calculating the coefficients ak directly, using the Fourier\nseries analysis equation\nak =\nMne-k( 2/4)n\n4n=O\nP10.6\nFigure P10.6 shows a real periodic signal x[n]. Using the properties of the Fourier\nseries and without explicitly evaluating the Fourier series coefficients, determine\nwhether the following are true for the Fourier series coefficients ak.\n(a) a, = a +10\nfor all k\n(b) a = a _\nfor all k\n(c) akejk(2,/) is real for all k\n(d) ao = 0\nx [n]\nu 1 2\n3 4\n7 8\n- 5 - 4 - 3 -2 - 15\nFigure P10.6\n\nSignals and Systems\nP10-4\nOptional\nProblems\nP10.7\nIn parts (a)-(d) we specify the Fourier series coefficients of a signal that is periodic\nwith period 8. Determine the signal x[n] in each case.\n(a) ak = cos (k 4)+ sin (3k 4)\nsin kr\nk - 6\n(b) ak =\n( 3)\n10,\nk =7\n(c) ak as in Figure P10.7(a)\n(d) ak as in Figure P10.7(b)\n111-111\nn\n.111 ~I II~I 111111111 III~I II\n-8\nFigure P10.7\nP10.8\n(a) Consider a linear, time-invariant system with impulse response\nh[n] = (1)I\"I\nFind the Fourier series representation of the output 9[n] for each of the follow\ning inputs.\nf/37rn\\\n(i)\nt[n] = sin 34)\n(ii)\n1[n] =\n[n -\n4k]\nk= -0\n(iii)\n1[n] is periodic with period 6, and\n1[n]= 1, n = 0, 1\n0,\nn = 2,\n3, 4\n(iv)\n1[n] = j\"\n+\n(-\n1)\"\n\nDiscrete-Time Fourier Series / Problems\nP10-5\n(b) Repeat part (a) for\n1,\nO ns2\n-\nh[n]=\n<\n1,\n-2\n! n\n-1\notherwise\nP10.9\nLet I[n] be a periodic sequence with period N and Fourier series representation\n2[n] = 1\nakejk(2/N)n\n(P10.9-1)\nk=(N)\nThe Fourier series coefficients for each of the following signals can be expressed in\nterms of the coefficients ak in eq. (P10.9-1). Derive these expressions.\n(a) I[n -\nno]\n(b) 1[n] - 2[n -\n1]\n(c) 2[n] - I\nN]\n(assume that N is even)\n(d) I[n] + x\nN]\n(assume that N is even; note that this signal is periodic\nwith period N/2)\n(e) 2*-n]\nP10.10\nConsider two specific periodic sequences t[n] and 9[n]. X[n] has period N and 9[n]\nhas period M. The sequence '[n] is defined as W[n] = I[n] + 9[n].\n(a) Show that 7b[n] is periodic with period MN.\n(b) Since I[n] has period N, its discrete Fourier series coefficients ak also have\nperiod N. Similarly, since 9[n] has period M, its discrete Fourier series coeffi\ncients bk also have period M. The discrete Fourier series coefficients of qb[n], Ck,\nhave period MN. Determine Ck in terms of a and bk.\nP10.11\nDetermine the Fourier series coefficients for each of the following periodic discrete-\ntime signals. Plot the magnitude and phase of each set of coefficients a.\nsin 7r'n 1\n(a) x[n] =\n(b) x[n] = cos (2;n)\n(c) x[n] = cos (4b n\n3)\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nResource: Signals and Systems\nProfessor Alan V. Oppenheim\nThe following may not correspond to a particular course on MIT OpenCourseWare, but has been\nprovided by the author as an individual learning resource.\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Problem Set 1 Solutions",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/res-6-007-signals-and-systems-spring-2011/e7e527598f89cf8dbd91432500ac53b3_MITRES_6_007S11_hw01_sol.pdf",
      "content": "I Introduction\nSolutions to\nRecommended Problems\nS1.1\n(a) Using Euler's formula,\n,r4\n1r\n\\IE\nS\nr\nF\ne\ncos\n+ j sin-4\nSince z = iej\"/4\nRe{z}=\nRe\n'2 +\n(b) Similarly,\nIm{z}= Im\n(c) The magnitude of z is the product of the magnitudes of 2 and eJT/4. However,\nI| = i, while Iei\"| = 1 for all 0. Thus,\nIzI =\ne\n-=I ie\n4 | -\n1 =\n(d) The argument of z is the sum of the arguments of i and e'\"/4. Since 4\n= 0 and\n4 ei\" = 0 for all 0,\n= 4\ne\n=\n+\n+es\"=\n(e) The complex conjugate of z is the product of the complex conjugates of 1 and\nei\"/4. Since * =\nand (ej\")* = e ~i' for all 0,\nz*\n=*\n*\n=i\n-i'/4\n(f) z + z*is given by\n1r/4\n. 4\nej\"/4 + e\n/4\nVr2\\/\nz + z* =e\n+\ne-/4 =\n= cos\n\nAlternatively,\nz+ z*\nRefz}\n2,\nor\nz + z* = 2Re{z}= 2 4\nS1.2\n(a) Express z as z = a + jQ, where Re{z} = a and Im{z} = Q. Recall that z* is the\ncomplex conjugate of z, or z* = a - jQ. Then\nz + z*\n(a+jQ)+ (o -jQ)\n2a + 0\n(b) Similarly,\nz - z*\n(a +fj)\n- (a -jQ)\n_\n+ 2jQ _.\nS1-1\n\nSignals and Systems\nS1-2\nS1.3\n(a) Euler's relation states that e'\" = cos 0 + j sin 0. Therefore, e-o = cos(-0) +\nj sin (-0). But, cos (-0) = cos 0 and sin (-0) = -sin 0. Thus, e-j\" = cos 0\nj sin 0. Substituting,\ne\" + e -\n_ (cos 0 + j sin0) + (cos 0 - j sin0)\n2 cos 0\n(b) Similarly,\nej\"-\ne -_\n(cos 0 + j sin0) - (cos 0 - j sin0)\n2j sin0\ns\n=\n=-sin 6\n2j\n2j\n2j\nS1.4\n(a) (i)\nWe first find the complex conjugate of z = re'\". From Euler's relation,\nrej\" = r cos 0 + Jr sin 0 = z. Thus,\nz* = r cos 0 - jr sin 0 = r cos 0 + jr (-sin 0)\nBut cos 0 = cos (-0) and -sin 0 = sin (-0). Thus,\nz* = r cos (-0) + jr sin (-0) = re -j\"\n(ii)\nz 2 = (re'\")2 = r2(ejo) 2 = r2ei20\n(iii) jz = er/ 2reo = reO+<,/2)\n(iv) zz* = (re\")(re-jo) = r 2em-0 )>= r2\nz\nrej\"\ne o+)e20\n() z*\nre ~j\"\n=\nj__=\ne -\ne\n(vi)\nz\nre\nr\n(b) From part (a), we directly plot the result in Figure S1.4-1, noting that for z =\nre\", r is the radial distance to the origin and 0 is the angle counterclockwise\nsubtended by the vector with the positive real axis.\nIm{z}\njr/6\nRe(z}\nFigure S1.4-1\n\nIntroduction / Solutions\nS1-3\n(i)\n(ii)\nIm z)\nz2 = 4 ej/3\nRez)\nFigure S1.4-3\n(iii)\nIm Iz\njz= 2 ej27/3\n21r\nRefz)\nFigure S1.4-4\n(iv)\nIndz)\nFigure S1.4-5\n\nSignals and Systems\nS1-4\n(v)\nz*\nItnzl\nl =\nz\nRejzj\nFigure S1.4-6\n(vi)\nReWjz\n7T\n--6\n3 -jn/6\nz\nFigure S1.4-7\nS1.5\nThis problem shows a useful manipulation. Multiply by e +a/ 2e-ja/2 = 1, yielding\ne+ja/\n2e -ja/2( 1 -\neja)\nja/\n2(e -ja/\n_ eia/\n2 )\nNow we note that 2j sin (-x)\n= - 2j sin x = e-x -\nex. Therefore,\n1 -\nel\" = ei\" 2 (-2j sin 2)\nFinally, we convert -j to complex exponential notation, -j = e -jr/2. Thus,\n1 -\neia = ea/\n2e -j/2 sin\n= 2 sin\nejt(a-7r)/21\nS1.6\nThere are three things a linear scaling of the form x(at + b) can do: (i) reverse\ndirection => a is negative; (ii) stretch or compress the time axis =\na I # 1; (iii) time\nshifting => b # 0.\n\nIntroduction / Solutions\nS1-5\n(a) This is just a time reversal.\nNote: Amplitude remains the same. Also, reversal occurs about t = 0.\n(b) This is a shift in time. At t = -2, the vertical portion occurs.\nx(t + 2)\nt\n-2\nFigure S1.6-2\n(c) A scaling by a factor of 2 occurs as well as a time shift.\nx(2t + 2)\nt\n-1\nFigure S1.6-3\nNote: a > 1 induces a compression.\n(d) All three effects are combined in this linear scaling.\nx(1 -3t)\nt\nFigure S1.6-4\n\nSignals and Systems\nS1-6\nS1.7\nThis should be a review of calculus.\n(a)\ne 2tdt = -e\n- 2\n-2a\n[-e 2(0)\n=\n-2a\n(b)\nJf2 e -3' dt = -i\n= lim (-e\nt-o0\n31 )\nie-3(2>\nTherefore,\nfe\n-3 dt = 0 + 1e 6\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nResource: Signals and Systems\nProfessor Alan V. Oppenheim\nThe following may not correspond to a particular course on MIT OpenCourseWare, but has been\nprovided by the author as an individual learning resource.\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Problem Set 2 Solutions",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/res-6-007-signals-and-systems-spring-2011/dfac4e2a745cc45c870bba07aa55885b_MITRES_6_007S11_hw02_sol.pdf",
      "content": "2 Signals and Systems: Part I\nSolutions to\nRecommended Problems\nS2.1\n(a) We need to use the relations w = 21rf, where f is frequency in hertz, and\nT = 2w/w, where T is the fundamental period. Thus, T = 1/f.\nw /3\n(i)\nf=-=\n=-Hz, T-\n6s\n2r\nf\n3r/4\n(ii)\nf =\n=-Hz, T=-s\n2w\n3/4\n8-x\n(iii)\nf = 2r\n= 87r Hz,\nT = 3-s\nNote that the frequency and period are independent of the delay r, and the\nphase 0_.\n(b) We first simplify:\ncos(w(t + r) + 0) = cos(wt + wr + 0)\nNote that wT + 0 could also be considered a phase term for a delay of zero.\nThus, if w, = w, and wX, + 0, = wor, + 6, + 2xk for any integer k, y(t) = x(t)\nfor all t.\n(i)\nWx = o ~\nW,mr+Ox=\n2 W,\nWyr, +O ,=\n3 1\n- 3 =O0+ 2wk\nThus, x(t) = y(t) for all t.\n(ii)\nSince wx # w,, we conclude that x(t) # y(t).\n(iii)\nCOX=\ncoy,\nomr, +\n6X\n= ((i) + i #343(1) + a + 2,7k\nThus, x(t) # y(t).\nS2.2\n(a) To find the period of a discrete-time signal is more complicated. We need the\nsmallest N such that UN = 21k for some integer k > 0.\n(i)\nN = 2wk =* N = 6,\nk = 1\n(ii)\nN = 2rk =o N = 8,\nk = 2\n(iii)\n2N = 2wk => There is no N such that aN = 2wk, so x[n] is not periodic.\n(b) For discrete-time signals, if Ox = Q, + 2rk and Qxrx + Ox = Qr, + O, + 2k, then\nx[n] = y[n].\n(i)\n'\n81r + 2wk (the closest is k = -1),\nso x[n] # y[n]\n(ii)\nOx =\nI3,\n(2) +\n=r\n-\nr + 2k, k = 1, so x[n] = y[n]\n(iii)\nOx=\n1,,((1) + i = ((0) + 1 + 27rk,\nk = 0, x[n] = y[n]\nS2-1\n\nSignals and Systems\nS2-2\nS2.3\n(a) (i)\nThis is just a shift to the right by two units.\nx[n-2]\n-1\nFigure S2.3-1\n(ii)\nx[4 -\nn] = x[-(n -\n4)], so we flip about the n = 0 axis and then shift\nto the right by 4.\nx[4-n]\n0 2~l\nn\n-1\n1 2\n5 6\nFigure S2.3-2\n(iii)\nx[2n] generates a new signal with x[n] for even values of n.\nx [2n]\nn\nFigure S2.3-3\n(b) The difficulty arises when we try to evaluate x[n/2] at n = 1, for example (or\ngenerally for n an odd integer). Since x[i] is not defined, the signal x[n/2] does\nnot exist.\nS2.4\nBy definition a signal is even if and only if x(t) = x(-t) or x[n] = x[-n],\nwhile a\nsignal is odd if and only if x(t) = -x(-\nt) or x[n] = -x[-n].\n(a) Since x(t) is symmetric about t = 0, x(t) is even.\n(b) It is readily seen that x(t) # x(- t) for all t, and x(t) K -x(-\nt) for all t; thus\nx(t) is neither even nor odd.\n(c) Since x(t) = -x(-\nt), x(t) is odd in this case.\n\nSignals and Systems: Part I / Solutions\nS2-3\n(d) Here x[n] seems like an odd signal at first glance. However, note that x[n] =\n-x[-n] evaluated at n = 0 implies that x[O] = -x[O] or x[O] = 0. The analo\ngous result applies to continuous-time signals. The signal is therefore neither\neven nor odd.\n(e) In similar manner to part (a), we deduce that x[n] is even.\n(f) x[n] is odd.\nS2.5\n(a) Let Ev{x[n]} = x[n] and Od{x[n]} = x[n]. Since xe[n] = y[n] for n >_ 0 and\nxe[n] = x[ -fn], x,[n] must be as shown in Figure S2.5-1.\nXe[n]\n4 1 4\nn\n-5 -4\n-3 -2 -1\nFigure S2.5-1\nSince x[n] = y[n] for n < 0 andx[n] = -x,[-n], along with the property that\nx0[O] = 0, x[n] is as shown in Figure S2.5-2.\nXo [n]\n1 2\n4 0 n\n-4\n-3\n-2\n-1\nFigure S2.5-2\nFinally, from the definition of Ev{x[n]} and Od{x[n]}, we see that x[n] = x,[n] +\nx[n]. Thus, x[n] is as shown in Figure S2.5-3.\n\nSignals and Systems\nS2-4\n(b) In order for w[n]\nS2.5-4.\nto equal 0 for n < 0, Od{w[n]} must be given as in Figure\nOdfw[n]}\n-4 - 3 --2 --\n1 2 3 4\nn\nFigure S2.5-4\nThus, w[n] is as in Figure S2.5-5.\nw[n]\np\n-3\ne\n-2\n-\n-1\nFigure S2.5-5\nn\nS2.6\n(a) For a = -ia\"is as shown in Figure S2.6-1.\nx[n]\nFigure S2.6-1\n(b) We need to find a # such that e#' = (-e-')\". Expressing -1 as ei\", we find\ne on = (ej'e -)T\nor\n0 = -1 + jr\nNote that any # = -1 + jfr + j27rk for k an integer will also satisfy the preced\ning equation.\n\nSignals and Systems: Part I / Solutions\nS2-5\n(c) Re{e(-1 +')t )\n= e -Re{ej'\"}\n= e -\" cos rn,\nIm~e (- 1+j}\nn = e -\"Im{e'\"} = e~\" sin in\nSince cos 7rn = (- 1)' and sin 7rn = 0, Re{x(t)) and Im{y(t)} for t an integer are\nshown in Figures S2.6-2 and S2.6-3, respectively.\nRefe (-1 + ir)n\n-1\n1In\nn\n-e\n-e\nFigure S2.6-2\nImfe (-\n+j7T)n I\n-nf\n-2 -1\nFigure S2.6-3\nS2.7\nFirst we use the relation (1 + j) = \\/Tej\"!' to yield\nx(t ) = \\/\n\\/ej'4eJ\"/4e(-I+j2*)t = 2eir/2e(-1+j2 )t\n(a) Re{x(t)} = 2e-'Re{ew\"!ej'i'} = 2e-' cos( 2t + 2)\nRe{x (t)}\nenvelope is 2e-r\n2-\n-\nFigure S2.7-1\n\nSignals and Systems\nS2-6\n(b) Im{x(t)) = 2e-'Im{ejr/2e 21rt} = 2e-' sin 27rt\nImIx (t)}\nenvelope is 2et\n2 -\nFigure S2.7-2\n(c) Note that x(t + 2) + x*(t + 2) = 2Re{x(t + 2)}. So the signal is a shifted\nversion of the signal in part (a).\nx(t + 2) + x*(t + 2)\n, 4e 2\nFigure S2.7-3\nS2.8\n(a) We just need to recognize that a = 3/a and C = 2 and use the formula for SN,\nN = 6.\n=2\n=32\n-a)\na /3\\\n_\n(3)a\n(b) This requires a little manipulation. Let m = n -\n2. Then\n1-\nnb= nb=\n=0 bm\"\"2=b2(b=2\n=\n\nn=2\nm=O\nM=0\n-b\n\nSignals and Systems: Part I / Solutions\nS2-7\n(c) We need to recognize that (2)2n = (1)'. Thus,\n-\n-\n= o-4\nsince\nS2.9\n(a) The sum x(t) + y(t) will be periodic if there exist integers n and k such that\nnT1 = kT 2, that is, if x(t) and y(t) have a common (possibly not fundamental)\nperiod. The fundamental period of the combined signal will be nT1 for the small\nest allowable n.\n(b) Similarly, x[n] + y[n] will be periodic if there exist integers n and k such that\nnN = kN2. But such integers always exist, a trivial example being n = N2 and\nk = N1. So the sum is always periodic with period nN, for n the smallest allow\nable integer.\n(c) We first decompose x(t) and y(t) into sums of exponentials. Thus,\nei(16Tt/ 3)\n-j(16irt/3)\nx(t) = 1 ej(\n21t/\n3 ) +\n-e j(21rt/3) + e\ne\n__A6r3\n____\nj\nY(\njrt -e-jrt\n2j\nMultiplying x(t) and y(t), we get\nz(t)\n-\ne (\n-+/3 -\ne-j5w/s)\n)t(+\n/3)t\n-j\n1/3\n4j\n4j\n4j\n4j\n1 ej(19r/3)t+ 1 ej(13 r/3)t + 1 e j(13r/3)t -\n-j(19/3)t\nWe see that all complex exponentials are powers of e j(/3). Thus, the funda\nmental period is 2 7r/(7r/3) = 6 s.\nS2.10\n(a) Let\n7 x[n] = S. Define m = -n and substitute\nn = -oo\nSx[-m] = - Z x[mI\nM= -OO\nM= -QO\nsince x[m] is odd. But the preceding sum equals -S. Thus, S = -S, or S = 0.\n(b) Let y[n] = x 1[n]x2[n]. Then y[-n] = x1[-n]x 2[-n]. But x1[-nj = -xl[n] and\nx2[-n] = x 2[n]. Thus, y[-n] = -x1[n]x2[n] = -y[n]. So y[n] is odd.\n(c) Recall that x[n] = x[fn] + x[n]. Then\nE\nx2[n] = E\n(xe[nl + x.[n])2\n= x[n] + 2 E\nXe[flx]Xfl + >7 x2[n]\nn= -co\nn=\no\nn= -0\nBut from part (b), x,[nxo[n] is an odd signal. Thus, using part (a) we find that\nthe second sum is zero, proving the assertion.\n\nSignals and Systems\nS2-8\n(d) The steps are analogous to parts (a)-(c). Briefly,\n(i)\nS =f\nx0(t)dt =\nx,(-r)dr\n=0\nx 0(r) dr = -S,\nor S = 0,\nwhere r = -t\n(ii)\n(iii)\ny(t) = Xo(t)xe(lt),\ny(-t)\n= xo(-t)x(-t)\n- y(t),\nx 2(t) dt = f\n= -xo(t)xo(t)\ny(t) is odd\n(X(t) + x0(t)) 2 dt\n=\nx(t) dt + 2\nXe(t)xo(t)dt +\nx 2(t)dt,\nwhile 2r\nx(t)xo(t) dt = 0\nS2.11\n(a)\n(b)\nx[n] = ewonT -\nei2 nTTo. For x[n] = x[n + N], we need\nx[n + N] = ej 2x(n +N)T/To\neji[ 2 n(T/To) + 2rN(T/To)] = ej2nT/To\nThe two sides of the equation will be equal only if 27rN(T/TO) = 27rk for some\ninteger k. Therefore, TITO must be a rational number.\nThe fundamental period of x[n] is the smallest N such that N(T/TO) = N(p/q)\n= k. The smallest N such that Np has a divisor q is the least common multiple\n(LCM) of p and q, divided by p. Thus,\nN\nLCM(p, q);\np\nnote that k = LCM(p, q)\nq\nThe fundamental frequency is 2ir/N, but n = (kT0)/T. Thus,\n(c)\nQ = 2\n=\n=\nWT =\nq\nT\nN\nkT,,\nk\nLCM(p, q)\nWe need to find a value of m such that x[n + N] = x(nT + mT). Therefore,\nN = m(T./T), where m(T./T) must be an integer, or m(q/p) must be an integer.\nThus, mq = LCM(p, q), m = LCM(p, q)/q.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nResource: Signals and Systems\nProfessor Alan V. Oppenheim\nThe following may not correspond to a particular course on MIT OpenCourseWare, but has been\nprovided by the author as an individual learning resource.\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Problem Set 3 Solutions",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/res-6-007-signals-and-systems-spring-2011/aa6f4739cf29d78a12a23fcf2033e298_MITRES_6_007S11_hw03_sol.pdf",
      "content": "3 Signals and Systems: Part II\nSolutions to\nRecommended Problems\nS3.1\n(a)\nx[n]= 8[n] + 8 [n -\n3]\nn\n0 1 2 3\nFigure S3.1-1\n(b)\nx[n] = u[n]-u[n-- 5]\n0041T\n-1\nFigure S3.1-2\n(c)\nx [n]=S[n] + -1 [n --\n+(_1)2S[n] +(_1)3 5[n -3]\nn\n-3 -2 -1\n1 2 3 4 5 6 7\nFigure S3.1-3\n(d)\nx(t)= u(t +3) - u(t - 3)\nt\n-3\nFigure S3.1-4\nS3-1\n\nSignals and Systems\nS3-2\n(e)\nx(t) =6(t + 2)\n-2\nFigure S3.1-5\nt\n(f)\nS3.2\n(1)\n(2)\n(3)\n(4)\n(5)\n(6)\nh\nd\nb\ne\na, f\nNone\nS3.3\n(a)\n(b)\nx[n] = b[n -\n1] -\n26[n -\n2] + 36[n -\n3]\ns[n] = -u[n + 3] + 4u[n + 1] -\n4u[n\n-\n26[n 4]\n2] + u[n -\n+ b[n -\n4]\n5]\nS3.4\nWe are given Figure S3.4-1.\n\nSignals and Systems: Part II / Solutions\nS3-3\nx(-\nt) and x(1 -\nt) are as shown in Figures S3.4-2 and S3.4-3.\nx (-t)\n-12\nFigure S3.4-2\nx(1--t)\nx1-0\n(a)\n-11\nFigure S3.4-3\nu(t + 1) - u(t -\n2) is as shown in Figure S3.4-4.\nHence, x(1\n-1\n-\nt)[u(t + 1)\nFigure S3.4-4\n- u(t -\n2)]1 looks as in Figure S3.4-5.\nt\n-1\nFigure S3.4-5\nt\n\nSignals and Systems\nS3-4\n(b) -u(2 -\n3t) looks as in Figure S3.4-6.\nt\nHence, u(t + 1)\nFigure S3.4-6\n-\nu(2 -\n3t) is given as in Figure S3.4-7.\nSo x(1 t)[u(t +\nFigure S3.4-7\n1) - u(2 - 3t)] is given as in Figure S3.4-8.\nS3.5\n(a) y[n]\n(b) y[n]\n(c) y[n]\n(d) y[n]\n=\n=\n=\n=\nx2[n] + x[n] -\nx2[n] + x[n] -\nH[x[n] x[n -\nx 2[n] + x 2[n -\nG[x 2[n]]\nx 2[n] -\nX 2 [n -\nx[n\nx[n\n1]]\n1] -\n-\n1]\n-\n1]\n2x[nJx[n 1]\n\nSignals and Systems: Part11/ Solutions\nS3-5\n(e) y[n] = F[x[n] - x[n -\n1]]\n= 2(x[n] - x[n -\n1]) + (x[n -\n1] -\nx[n -\n2])\ny[n] = 2x[n] - x[n -\n1] - x[n -\n2]\n(f) y[n] = G[2x[n] + x[n -\n11]\n= 2x[n] + x[n -\n11 -\n2x[n -\n1] - x[n -\n= 2x[n] - x[n -\n1] - x[n -\n2]\n(a) and (b) are equivalent. (e) and (f) are equivalent.\nS3.6\nMemoryless:\n(a) y(t) = (2 + sin t)x(t) is memoryless because y(t) depends only on x(t) and not\non prior values of x(t).\n(d) y[n] = Ek=. x[n] is not memoryless because y[n] does depend on values of\nx[-] before the time instant n.\n(f) y[n] = max{x[n], x[n -\n1], ...\n, x[-oo]} is clearly not memoryless.\nLinear:\n(a)\ny(t) = (2 + sin t)x(t) = T[x(t),\nT[ax1(t) + bx 2(t)] = (2 + sin t)[axi(t) + bx 2(tt)\n= a(2 + sin t)x 1(t) + b(2 + sin t)x 2(t)\n= aT[x 1(t)] + bT[x 2(t)]\nTherefore, y(t) = (2 + sin t)x(t) is linear.\n(b)\ny(t) = x(2t) = T[x(t)],\nT[ax 1(t) + bx 2(t)] = ax1(2t) + bx 2(t)\n= aT[x1(t)) + bT[x 2(t)]\nTherefore, y(t) = x(2t) is linear.\n(c)\ny[n] =\n(\nx[k] = T[x[n]],\nk=\nT[ax1 [n] + bx2[n]] = a T x1[k] + b L x 2[k]\nk= -x\nk=-w\n= aT[x1[n]] + bT[x2[n]]\nTherefore, yin] = E=_ x[k] is linear.\n(d) y[n] =\n>\nx[k] is linear (see part c).\nk= -o\ndxt\nd\nT[ax1(t) + bx 2(t)] = -[ax 1(t)+bx2(t)]\n= a dxdt\n1(t) + b dxdt2(t)\n= aT[x 1(t)] + bT[x 2(t)]\nTherefore, y(t) = dx(t)/dt is linear.\n(f)\ny[n] = max{x[n], . . . , x[-oo]} = T1x[n]],\nT[ax1[n] + bx2[n]] = max{ax1[n] + bx 2[n], . . . , ax 1[-oo] + bx2[ - o]}\n# a max{x[n], . . . , x1[-oo]} + b max{x 2[n], . . . , X2[-00])\nTherefore, y[n] = max{x[n], .. . , x[-oo]} is not linear.\n\nSignals and Systems\nS3-6\nTime-invariant:\n(a)\ny(t) = (2 + sin t)x(t) = T[x(t)],\nT[x(t -\nT0)] = (2 + sin t)x(t -\nT0 )\n9 y(t -\nT0) = (2 + sin (t -\nT0))x(t -\nT0)\nTherefore, y(t) = (2 + sin t)x(t) is not time-invariant.\n(b)\ny(t) = x(2t) = T[x(t)],\nT[x(t -\nT0 )] = x(2t -\n2T0) # x(2t -\nTO) = y(t -\nT 0)\nTherefore, y(t) = x(2t) is not time-invariant.\n(c)\ny[n] = (\nx[kJ = T[x[n]],\nT[x[n -\nNO]J =\n(\nx[k -\nNO] = y[n -\nN 0 ]\nTherefore, y[n] = Ek'= _.x[k] is time-invariant.\n(d)\ny[n] = E x[k] = T[x[n]],\nk=\nn\nn-NO\nT[x[n -\nNO]] = E x[k - N] =\nx[l] = y[n - N0 ]\nk=-\n=-w0\nTherefore, y[n] = E\" _.x[k] is time-invariant.\n=dx(t)\n(e)\ny(t)\ndt\nT[x(t)],\nd\nT[x(t -\nTo)] =\nx(t -\nTo) = y(t -\nTo)\ndt\nTherefore, y(t) = dx(t)/dt is time-invariant.\nCausal:\n(b) y(t) = x(2t),\ny(1) = x(2)\nThe value of y(-) at time = 1 depends on x(-) at a future time = 2. Therefore,\ny(t) = x(2t) is not causal.\n(d) y[n] = (\nx[k]\nk=\nYes, y[n] = E\n.x[k] is causal because the value of y[-] at any instant n\ndepends only on the previous (past) values of x[-].\nInvertible:\n(b) y(t) = x(2t) is invertible; x(t) = y(t/2).\n(c) y[n] = E\n_.x[k] is not invertible. Summation is not generally an invertible\noperation.\n(e) y(t) = dx(t)/dt is invertible to within a constant.\nStable:\n(a) If Ix(t) I < M, Iy(t) I < (2 + sin t)M. Therefore, y(t) = (2 + sin t)x(t) is stable.\n(b) If |x(t)| < M, |x(2t)I < M and ly(t)| < M. Therefore, y(t) = x(2t) is stable.\n(d) If |x[k]| 5 M, ly[n]j 5 M - E_,, which is unbounded. Therefore, y[n] =\nE\"Lx[k] is not stable.\n\nSignals and Systems: Part II / Solutions\nS3-7\nS3.7\n(a) Since H is an integrator, H-1 must be a differentiator.\nH~':\ny(t)\ndx(t)\n=\nddt\nG:\ny(t) = x(2t)\nG\n1:\ny(t) = x(t/2)\n(b)\nSolutions to\nOptional Problems\nS3.8\n(a) x 2(t) = xi(t) - xi(t -\n2)\n2(t) =\n1(t)\ny)(t -\n2)\nFigure S3.8-1\n\nSignals and Systems\nS3-8\n(b) xA(t) = Xi( t) + xI(t + 1)\ny3(t)=y (t)+y 1 (t + 1)\n(c) x(t) = u(t -\n1)\n-1\n- u(t -\n2)\nFigure S3.8-2\ny(t)=e-(t-1)u\n-1)+u(-t)+\nu(t\n-2)-u(1\n-t)\nt\n(d) y[n] = 3y 1[n]\np\n2y2[n] +\np14\nFigure S3.8-3\n2y3[n]\np\nn\n-3\n-2\n-1\n-4\nFigure S3.8-4\n\nSignals and Systems: Part11/ Solutions\nS3-9\n(e) y2[n] = y,[n] + yi[n -\ny2 [n]\n__\nFigure S3.8-5\nY3[n] = y 1 [n + 1]\n-1 0\n2 3 4\nFigure S3.8-6\n(f) From linearity,\ny1(t) = 1r + 6 cos(2t) -\n47 cos(5t) + '/e cos(6t),\n1 +\n0t\n4\"\nx 2(t) = 1 + t2 =\n(-t 2 )\".\nn=O\nSo y 2(t) = 1 -\ncos(2t) + cos(4t) -\ncos(6t) + cos(8t).\nS3.9\n(a) (i)\nThe system is linear because\nTlaxi(t) + bx 2(t)] =\n3 [ax1(t) + bx 2(t )](t - nT)\nn=\n= a T3 x 1(t)b(t - nT) + b (\nxst\n- nT)\n= aT[xi(t)] + bT[x 2(t)]\n(ii)\nThe system is not time-invariant. For example, let xi(t) = sin(22rt/T).\nThe corresponding output yi(t) = 0. Now let us shift the input xi(t) by\nr/2 to get\n+r = cos (2)\nx 2 (t) = sin (\nNow the output\n+00\nY2(0\n>7 b(t - nT) =Ay,\n+ 2=\nn = -oo\n\nSignals and Systems\nS3-10\n(b) y(t) =\nE\nx(t)b(t - nT)\n= E cos(2,rt)b(t -\nnT)\ncos(27rt)\n0<\nt\nFigure S3.9-1\nT = 1\nI\n~11\ntt\nFigure S3.9-2\n\nSignals and Systems: Part II / Solutions\nS3-11\ny (t)\nT=\nT~__\nt\nt\n-1\nFigure S3.9-5\ny(t)\n(c) y(t) =\netcos(27rt)b(t\nFigure S3.9-6\n-\nnT)\netcos(2nrt)\nFigure S3.9-7\net\nt\nT = I\ny (t)\nT=1\ntt\nFigure S3.9-8\n\nSignals and Systems\nS3-12\ny (t)\nT= Ie3\n-e1/2\nI\nI\n2-\nI\n3/2\nt\nFigure S3.9-9\nT=\n4t\ny (t)\nYWe3\nF\nr2\n-el2\n-e 3 12\nFigure S3.9-10\nT=\nY3\ny~t)\nFigure S3.9-12\nS3.10\n(a) True. To see that the system is linear, write\ny2 (t) = T2 [T1 [x(t)]]\nT[x(t)],\nT1[ax1(t) + bx 2(t)] = aT1 [x1(t)] + bT[x 2(t)]\nT2[T1[ax1(t) + bx 2 (t)]] = T2[aT1[x1(t)] + bT1[x 2(t)]I\n= aT2[T1 [x1(t)]] + bT2[(T[x2t)]]\n= aT[x1(t)] + bT[x 2(t)J\n\nSignals and Systems: Part 11/ Solutions\nS3-13\nWe see that the system is time-invariant from\nT 2[T1[x(t -\nT)]] = T 2[y1(t -\nT)l\n= y 2(t -T),\nTx(t -\nT)] = y 2(t -\nT)\n(b) False. Two nonlinear systems in cascade can be linear, as shown in Figure S3.10.\nThe overall system is identity, which is a linear system.\nx(t)\ni\nReciprocal\n-\nx(t)\nReciprocal\n0 y(t)=x(t)\nFigure S3.10\n(c) y[n] = z[2n] = w[2n] + {w[2n -\n1] + {w[2n -\n= x[n] + {x[n -\nThe system is linear and time-invariant.\n(d) y[n] = z[-nl = aw[-n 11 + bw[-n] + cw[-n + 1]\n= ax[n + 11 + bx[nl + cx[n -\n1]\n(i)\nThe overall system is linear and time-invariant for any choice of a, b,\nand c.\n(ii)\na= c\n(iii) a= 0\nS3.11\n(a) y[n] = x[n] + x[n -\n11 = T[x[n]]. The system is linear because\nT[ax1[n] + bx2 [n]| = ax1[n] + ax1[n -\n1] + bx 2[n] + bx2[n - 1]\n= aT[x1 [n]] + bT[x 2[n -\n1]]\nThe system is time-invariant because\ny[n] = x[n] + x[n -\n1] = Tjx[n]],\nT[x[n -\nN]] = x[n -\nN] + x[n 1 -\nN]\n= y[n -\nN]\n(b) The system is linear, shown by similar steps to those in part (a). It is not\ntime-invariant because\nT[x[n\nN]] = x[n -\nN]\n# y[n -\nN]\n+ x[n - N -\n1] + x[O]\n= x[n\nN] + x[n - N -\n1] + x[-NJ\nS3.12\n(a) To show that causality implies the statement, suppose\nx1(t) - yl(t)\n(input x1(t) results in output y 1(t)),\nx 2(t) -\ny2),\nwhere y 1(t) and y2(t) depend on x1(t) and x 2(t) for t < to. By linearity,\nxI(t) -\nx 2(t) -+ y 1(t) -\ny 2(t)\n\nSignals and Systems\nS3-14\nIf Xi(t) = x 2(t) for t < to, then y1(t) = y2 (t) for t < to. Hence, if x(t) = 0 for\nt < to, y(t) = 0 for t < to.\n(b) y(t) = x(t)x(t + 1),\nx(t) = 0\nfor t < to =* y(t) = 0,\nfor t < to\nThis is a nonlinear, noncausal system.\n(c) y(t) = x(t) + 1 is a nonlinear, causal system.\n(d) We want to show the equivalence of the following two statements:\nStatement 1 (S1): The system is invertible.\nStatement 2 (S2): The only input that produces the output y[n] = 0 for all n is\nx[n] = 0 for all n.\nTo show the equivalence, we will show that\nS2 false\nS1 false\nand\nS1 false\nS2 false\nS2 false == S1 false:\nLet x[n] # 0 produce y[n] = 0. Then cx[n] == y[n] = 0.\nS1 false\nS2 false:\nLet xi => yi and x 2 =* Y2. If x 1 # X2 but y1 = Y2, then\nX1 -\nX2 0 0 but yi -\nyi = 0.\n(e) y[n] = x 2[n] is nonlinear and not invertible.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nResource: Signals and Systems\nProfessor Alan V. Oppenheim\nThe following may not correspond to a particular course on MIT OpenCourseWare, but has been\nprovided by the author as an individual learning resource.\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Problem Set 4 Solutions",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/res-6-007-signals-and-systems-spring-2011/0a374ee9df1ba2a9cd985807c735afa6_MITRES_6_007S11_hw04_sol.pdf",
      "content": "4 Convolution\nSolutions to\nRecommended Problems\nS4.1\nThe given input in Figure S4.1-1 can be expressed as linear combinations of xi[n],\nx 2[n], X3[n].\nx,[ n]\n0 2\nFigure S4.1-1\n(a) x 4[n] = 2x 1 [n] -\n2x 2[n] + x3[n]\n(b) Using superposition, y 4[n] = 2yi[n] -\n2y 2[n] + y3 [n], shown in Figure S4.1-2.\n-1\nFigure S4.1-2\n(c) The system is not time-invariant because an input xi[n] + xi[n -\n1] does not\nproduce an output yi[n] + yi[n -\n1]. The input x,[n] + xi[n -\n11 is xi[n] +\nxi[n -\n1] = x2[n] (shown in Figure S4.1-3), which we are told produces y 2[n].\nSince y 2[n] # yi[n] + yi[n -\n1], this system is not time-invariant.\nx 1 [n] +x 1 [n-1] =x2[n]\nn\nFigure S4.1-3\nS4-1\n\nSignals and Systems\nS4-2\nS4.2\nThe required convolutions are most easily done graphically by reflecting x[n] about\nthe origin and shifting the reflected signal.\n(a) By reflecting x[n] about the origin, shifting, multiplying, and adding, we see\nthat y[n] = x[n] * h[n] is as shown in Figure S4.2-1.\n(b) By reflecting x[n] about the origin, shifting, multiplying, and adding, we see\nthat y[n] = x[n] * h[n] is as shown in Figure S4.2-2.\ny[n]\nFigure S4.2-2\nNotice that y[n] is a shifted and scaled version of h[n].\nS4.3\n(a) It is easiest to perform this convolution graphically. The result is shown in Fig\nure S4.3-1.\n\nConvolution / Solutions\nS4-3\ny(t) = x(t) * h(t)\n4-\n|\nt\nFigure S4.3-1\n(b) The convolution can be evaluated by using the convolution formula. The limits\ncan be verified by graphically visualizing the convolution.\ny(t) =\n7x(r)h\n(t -\nr)dr\n=\ne-'-Ou(r -\n1)u(t -\nr + 1)dr\nt+\ne (-\ndr,\nt > 0,\n-0,\nt < 0,\nLet r' = T -\n1. Then\ny( )\ne- d r\n-e\nt > 0,\n0 ,\nt < 0\n(c) The convolution can be evaluated graphically or by using the convolution\nformula.\ny(t) =\nx(r)6(t -\n, -\n2) dr = x(t -\n2)\nSo y(t) is a shifted version of x(t).\ny(t)\nIt- I\n/ \\,\nt\nFigure S4.3-2\n\nSignals and Systems\nS4-4\nS4.4\n(a) Since y[n] = E=-oox[m]h[n -\nm],\ny[n] =\n6b[m -\nno]h[n -\nm] = h[n -\nno]\nm= -oO\nWe note that this is merely a shifted version of h[n].\ny [n] = h1[12 I\na e|41\nn\n(n\n1) no\n(n1+ 1)\nFigure S4.4-1\n(b) y[n] = E =_c(!)'u[m]u[n m]\nFor n > 0:\ny[n] =\n+\n= 2( 1\ny[n] = 2 -\n(i)\"\nForn < 0:\ny[n] = 0\nHere the identity\nN-i\nN\n_\nT am\nMr=O\na\nhas been used.\ny[n]\n2--\nFigure S4.4-2\n(c) Reversing the role of the system and the input has no effect\nbecause\ny[n] = E x[m]h[n m] = L h[m]x[n m]\nm=-oo\nThe output and sketch are identical to those in part (b).\n,\non the output\n\nConvolution / Solutions\nS4-5\nS4.5\n(a) (i)\nUsing the formula for convolution, we have\ny 1 (t) =\nx(r)h(t -\nr) dr\n=\nr(-)-2u(t -\nr) dr\nt\n=\ne -( -\n2dr,\nt > 0,\n2e\n= 2(1\ne\nt > 0,\ny(t) = 0,\nt < 0\ny1 (t)\n-\n2 -\nt\nFigure S4.5-1\n(ii)\nUsing the formula for convolution, we have\ny2(t) =\n2e-(t-r)/2 dr,\nt>- 0,\ny2 (t)\n=4(1 - e-t/2),\n= {\n2e-(-\n/2 d-,\nt : 0,\nt >_3,\nS4e (t-r)/2\n4(e\n-(t-3)/2\n_ e-t/2\n= 4e- t/2(e'/ 2 -\n1),\nt\n3,\ny 2(t) = 0,\nt\ny 2 (t)\n0 1\n5 6\nFigure S4.5-2\n\nSignals and Systems\nS4-6\n(b) Since x 2(t) = 2[xl(t) - xl(t -\n3)] and the system is linear and time-invariant,\ny 2(t) = 2[yi(t) -\ny1(t -\n3)].\nFor 0 s t s 3:\ny 2(t) = 2yi(t) = 4(1 - e-'/2)\nFor 3\nt\ny 2(t) = 2y,(t) - 2yi(t -\n3)\n= 4(1 -\ne-1/2\n4(1 -\ne- t\n-3)2)\n= 4e- t/2 e3 / 2\n_ 1\nFort< 0:\ny2(t) = 0\nWe see that this result is identical to the result obtained in part (a)(ii).\nSolutions to\nOptional Problems\nS4.6\n(a)\nx(T)\nT\nFigure S4.6-1\nh(-1 -r)\n2,\n-2\nT\n--1\n--1 '\nFigure S4.6-2\n\nConvolution / Solutions\nS4-7\nh(0-r)\nFigure S4.6-3\nh(1-- )\nFigure S4.6-4\n\nSignals and Systems\nS4-8\nUsing these curves, we\nFigure S4.6-6.\nsee that since y(t) = x(t) * h(t), y(t) is as shown in\n(b) Consider y(t) = x(t) * h(t) =\n--\n---\nf0x(t -\nr)h(r)dr.\ny(t)\n1 W\nFigure S4.6-6\nt\nh(r)\nFor 0 < t <\nFigure S4.6-7\n1, only one impulse contributes.\nx(t -r)\nFor 1 <\nFigure S4.6-8\nt < 2, two impulses contribute.\nx(t )\nFigure S4.6-9\n\nConvolution / Solutions\nS4-9\nFor 2 < t < 3, two impulses contribute.\nx(t- r)\nFigure S4.6-10\nFor 3 < t < 4, one impulse contributes. t)\nx(t\nFigure S4.6-11\nFor t < 0 or t > 4, there is no contribution, so y(t) is as shown in Figure\nS4.6-12.\ny(t)\n3 -\nI-\nU'\nFigure S4.6-12\nS4.7\ny[n] = x[n] * h[n]\n= 1 x[n - m]h[m]\nnO\n=-\n-\nn\n0,\nanmm,\n>\nM=0\n\nSignals and Systems\nS4-10\ny[n] = a\"\n= a\" L (la)\na n+1\n_\nn+1\na -\n#\nn > 0,\ny[n] = 0,\nn < 0\nS4.8\n(a) x(t) = E_=\n-\nkT) is a series of impulses spaced T apart.\nx(t)\nt\n-2T\n-T\nT\n2T\nFigure S4.8-1\n(b) Using the result x(t) *(t\n-\nto) = x(to), we have\ny(t)\n.. t\n-2\n-1\nFigure S4.8-2\nSo y(t) = x(t) *h(t) is as shown in Figure S4.8-3.\ny(t)\n-2\n-3\n-1\n-j\nFigure S4.8-3\n\nConvolution / Solutions\nS4-11\nS4.9\n(a) False. Counterexample: Let g[n] = b[n]. Then\nx[n] * {h[n]g[n]} = x[n]\nh[0],\n{x[n]* h[n]}g[n] = b[n] [x[n] *h[n]]\nn=0\nand x[n] may in general differ from b[n].\n(b) True.\ny(2t) = fx(2t\n-\nr)h(r)dr\nLet r' = T/ 2 . Then\ny(2t) = f\nx(2t - 2r')h(2r')2dr'\n= 2x(2t)* h(2t)\n(c) True.\ny(t) = x(t) * h(t)\ny(- t) = x(-t) * h(-t)\n-f\nx(-t\n+ r)h(-r)dr = f\n[-x(t -\nr)][ -h(r)] dT\n=f\nx(t -\nr)h(r)dr\nsince x(-) and h(-) are odd fu ictions\n-\ny(t)\nHence y( t) = y(-t), and y(t) is even.\n(d) False. Let\nx(t)\n= b(t -\n1)\nh(t) = b(t + 1)\ny(t) = b(t),\nEv{ y (t)} = 6(t)\nThen\nx(t) *Ev{h(t)} =b(t\n-\n1) *i[b(t + 1) + b(t -\n1)]\n= i[b(t) + b(t -\n2)],\nEv{x(t)} * h(t) =1[6t -\n1) + b(t + 1)] * b(t + 1)\n= 1[b(t) + b(t + 2)]\nBut since 1[6(t -\n2) + b(t + 2)] # 0,\nEv{y(t)} # x(t) *Ev{h(t)} + Ev{x(t)} *h(t)\nS4.10\n(a)\n9(t) = J\nro\nTO21 (r)22(t - r) dr,\nO\nD(t + T0) = J\n2 1 (T)- 2(t + To - r) d-r\n=\nTO 1 (r)\n2 (t -\nr)dr =\n(t)\n\nSignals and Systems\nS4-12\n(b)\n9a(t) =\nT\na+TO\n2 1(i)2\n2(t\n-\n-) dr,\na\n9a(t)\n=\n=\nkTo + b,\nwhere 0\n(k+1)T0+b\n2 1(r)A 2(t -\ni)\nkT0+b\nTO+b\nb -\ndr,\nTo,\nPa(t)\n=\nfb\n2 1(i)\n2(t\n-\nr) di,\ni'\n= i -\nb\nFTo\nT7 0+b\n=\nT1()-\nt -\nr) dr +\n1&)2(t\n-\nr) di\nb\nTO\nTb ()A\n-\nr) d1\n2-\n) di\n=\n)\nT)TO\n=\n)12( t\nT ) dr =q\nt )\nt(-r\n\n(c) For 0 s t - I\nft e-\nI\n9(t) =\ndi + Tie-'di\n0e\n+\ne/2+t1/2+1\n=(-e-' t + (-e-T\n11/2+t)\n(t)\n= 1 -\ne~' + e-(*1/2) -\ne-1 = 1 -\ne-1 + (e 1/2 -\n1)e-\nFor\ns\nt < 1:\n=\nftt(t)\ne-' di = e- (\n1/2) - e\n-\n1/2\n)e\n(d) Performing the periodic convolution graphically, we obtain the solution as\nshown in Figure S4.10-1.\nX1[n] *x2[n]\n-16\n(one period)\nFigure S4.10-1\n\nConvolution / Solutions\nS4-13\n(e)\nS4.11\n(a) Since y(t) = x(t) *h (t) and x(t) = g(t) *y(t), then g(t) *h(t) = 6(t). But\ng(t )*h (t) =\ngrob t -\nkT\nhboTr -\nlT d,\nwk=0\n1=0\n=\nT\ngkhlo(t -\n(1+ k)T)\nk=O 1=0\nLet n = 1 + k. Then\n= n -\nk and\ng(t)* h (t) =\nYgkhn\nt - n\nn=0 \\k=0\nn\nF,\nn = 0,\nk=0\nn\nO\nTherefore,\ngo = 1/h 0 ,\ngi = -- hi/ho,\n1 (-hl\nh2)\no\nho\nho\n(b) We are given that h0 = 1, hi = I, hi = 0. So\n= 1,\ng1 =\n-i)\ng2=+(1)2,\ng2 =\n-()\n\nSignals and Systems\nS4-14\nTherefore,\ng(t) = (\n(-)\nk=O\n(tkT)\n(c) (i)\nEach impulse is delayed by T and scaled by a, so\nh(t) =\nk=O\n(t -kT )\n(ii)\nIf 0 < a < 1, a bounded input produces a bounded output because\ny(t) = x (t)* h (t),\n| y(t)| < Zak\nk=0\n<\na\nk=O\nf\n6(r kT)x(t - r) di\n-w\n_(T\n- kT)Ix(t -\nT)I dr\n-w\nLet M = maxlx(t)|. Then\nI y(t) < M\nak= M\n,\nal < 1\nk=O\nIf a > 1, a bounded input will no longer produce a bounded output. For\nexample, consider x(t) = u(t). Then\nt\nyt)\n= Ta\nf\n6(,r - kT) dr\nk=O\n-w\nSince f\n6(r - kD di = u (t-kT ),\ny(t) = ( aku(t-kT)\nk=O\nConsider, for example, t equal to (or slightly greater than) NT:\nN\ny(NT) = Z ak\nk=O\n(iii)\nIf a > 1, this grows without bound as N (or t) increases.\nNow we want the inverse system. Recognize that we have actually solved\nthis in part (b) of this problem.\ngi = 1,\ng2 = -a\ngi = 0,\ni # 0, 1\nSo the system appears as in Figure S4.11.\ny(t)\n_0_\nx(t)\nDelay T\nFigure S4.11\n\nConvolution / Solutions\nS4-15\n(d) If x[n] = 6[n], then y[n] = h[n]. If\nx[n] = go[n] + iS[n-N],\nthen\ny[n] = -h[n] + -h[n],\ny[n] = h[n]\nS4.12\n(a)\nb[n] = #[n] - -4[n -\n1],\nx[n] =\n(\nx[k][n -\nk] =\n(\nx[k]Q([n -\nk] -\n-p[n -\nk -\n1]),\nk=--\nk=--w\nx[n] =\nE\n(x[k] - ix[k -\n1])4[n-\nk]\nk= -w\nSo ak = x[k] -\nlx[k -\n1].\n(b) If r[n] is the response to #[n], we can use superposition to note that if\nx[n] =\n(\nakp[n -\nk],\nk=\nthen\ny[n] = Z akr[n - k]\nk= -w\nand, from part (a),\ny[n] = (\n(x [k] -\nfx[k - 1])r[n -\nk]\nk=\n(c) y[n] = i/[n] *x[n] * r[n] when\n[n] = b[n] - in-\n1]\nand, from above,\n3[n]\n4[n] -\n-[-\n1]\nSo\n/[n] = #[n] -\n-#[n -\n11 -\n1(#[n -\n11 -\n-$[n -\n2]),\n0[n] = *[n] - *[n -\n1] + {1[n -\n2]\n(d)\n4[n] -\nr[n],\n#[n -\n1] -\nr[n -\n1],\nb[n] = 4[n] - -1[n-\n1] -\nr[n] - fr[n -1]\nSo\nh[n] = r[n] - tr[n -1],\nwhere h[n] is the impulse response. Also, from part (c) we know that\ny[n] = Q[n] *x[n] *r[n]\nand if x[n] = #[n] produces r[n], it is apparent that #[n] * 4[n] = 6[n].\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nResource: Signals and Systems\nProfessor Alan V. Oppenheim\nThe following may not correspond to a particular course on MIT OpenCourseWare, but has been\nprovided by the author as an individual learning resource.\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Problem Set 5 Solutions",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/res-6-007-signals-and-systems-spring-2011/1e8612f9dfd2b6b1c7fc293d862efbef_MITRES_6_007S11_hw05_sol.pdf",
      "content": "5 Properties of Linear,\nTime-Invariant Systems\nSolutions to\nRecommended Problems\nS5.1\nThe inverse system for a continuous-time accumulation (or integration) is a differ\nentiator. This can be verified because\nd[\nx(r) dr =x(t)\nTherefore, the input-output relation for the inverse system in Figure S5.1 is\ndy(t)\nx(t) =\ndt\ny(t\nF h(t)\nx x(t)\nFigure S5.1\nS5.2\n(a) We want to show that\nh[n] -\nah[n -\n11 = b[n]\nSubstituting h[n] = anu[n], we have\nanu[n] - aa\"-u[n\n-\n1] = a\"(u[n] - u[n -\n1])\nBut\nu[n] - u[n -\n1] = b[n] and an6[n] = ab[n] = b[n]\n(b) (i)\nThe system is not memoryless since h[n] # kb[n].\n(ii)\nThe system is causal since h[n] = 0 for n < 0.\n(iii)\nThe system is stable for Ia I < 1 since\n|al\"\n1 -\n|a\nis bounded.\n(c) The system is not stable for |al > 1 since E\"o 1a|\" is not finite.\nS5.3\n(a) Consider x(t) = 6(t) -+ y(t) = h(t). We want to verify that h(t) = e -2u(t), so\ndy(t) -\n-2e- 2 u(t) + e -' 6(t), or\ndt\ndy(t) + 2y(t)\n-21 6(t),\n=e\ndt\nS5-1\n\nSignals and Systems\nS5-2\nbut ed' b(t) = 6(t) because both functions have the same effect on a test func\ntion within an integral. Therefore, the impulse response is verified to be correct.\n(b) (i)\nThe system is not memoryless since h(t) # kb(t).\n(ii)\nThe system is causal since h(t) = 0 for t < 0.\n(iii)\nThe system is stable since h(t) is absolutely integrable.\nIhtI dt =\ne 2 t dt = -le -2t\nS5.4\nBy using the commutative property of convolution we can exchange the two systems\nto yield the system in Figure S5.4.\nu(t) -\nd/dt\nL\ny(t)\nFigure S5.4\nNow we note that the input to system L is\ndu(t)\n= 6(t ),\ndt\nso y(t) is the impulse response of system L. From the original diagram,\nds(t)\ndt\n= yt)\nTherefore,\nh(t) = ds(t)\ndt\nS5.5\n(a) By definition, an inverse system cascaded with the original system is the iden\ntity system, which has an impulse response h(t) = 6(t). Therefore, if the cas\ncaded system has an input of b(t), the output w(t) = h(t) = 6(t).\n(b) Because the system is an identity system, an input of x(t) produces an output\nw(t) = x(t).\nSolutions to\nOptional Problems\nS5.6\n(a) If y(t) = ayi(t) + by 2(t), we know that since system A is linear, x(t) = ax,(t)\n+ bx 2(t). Since the cascaded system is an identity system, the output w(t) =\nax1(t) + bx 2(t).\n\nProperties of Linear, Time-Invariant Systems / Solutions\nS5-3\nay1(t + by 2(t)\nB\naxI(t) + bx 2(t)\nFigure S5.6-1\n(b) If y(t) = y 1(t -\nr), then since system A is time-invariant, x(t) = x,(t -\n-) and\nalso w(t) = xi(t -\nr).\nyI(t -r)\nB\n-\nxI(t- r)\nFigure S5.6-2\n(c) From the solutions to parts (a) and (b), we see that system B is linear and time-\ninvariant.\nS5.7\n(a) The following signals are obtained by addition and graphical convolution:\n(x[n] + w[n]) * y[n] (see Figure S5.7-1)\nx[n] * y[n] + w[n] * y[n] (see Figure S5.7-2)\nx[n] +w[n]\nyInI\n1?\n-\nn\n- 1\n-1\n(x[n] +w[n]) *y[n]\n-l\n-3 6\nFigure S5.7-1\n\nSignals and Systems\nS5-4\nx[n] *y[n]\nn\n-0\nn\n-1\n-1\n-2\nx[n] *y[n] +w[n] *y[n]\n-I\n-2<\n-3\nFigure S5.7-2\nTherefore, the distributive property (x + w) * y = x * y + w * y is verified.\n(b) Figure S5.7-3 shows the required convolutions and multiplications.\n(x[n] *y[n])-w[n]\nx[n] *(y[n] -w[n])\nn\nn\n-1 0\n-1\n-1\n-2\nFigure S5.7-3\nNote, therefore, that (x[n] * y[n]) - w[n] # x~n] * (y[n] - w[n]).\n\nProperties of Linear, Time-Invariant Systems / Solutions\nS5-5\nS5.8\nConsider\ny(t) = x(t) * h(t) = J-\nx(t - r)h(r)dr\n=\nx(r)h(t - r) dr\n(a) y'(t) =\nx'(t -\nr)h(r) d-r = x'(t) * h(t)\n=\nx(r)h'(t -\nr) dr = x(t) * h'(t),\nwhere the primes denote d/dt.\n(b) y(t) = x(t) * h(t),\ny(t) = x(t) * u\n1(t) * ui(t) * h(t),\ny(t) =\nx(r) dr * h'(t)\n(c) y(t) = x(t) * h(t),\ny(t) = x(t) * ui(t) * h(t) * u _ 1(t),\ny(t) =\nx'(r)\n* h(r)\ndr\n(d) y(t) = x(t) *h(t)\n= x(t) * u(t)\n* h(t) * n 1(t),\ny(t) = Xt) *\nh(r) dr\nS5.9\n(a) True.\nf0 |h(t)| dt =\nfT |h(t)| dt = oo\n(b) False. If h(t) = 3(t -\nto) for to > 0, then the inverse system impulse response\nis b(t + to), which is noncausal.\n(c) False. Suppose h[n] = u[n]. Then\nZ Ih[n]| = [\nu[n] = c\nn= -oo\nn= -oo\n(d) True, assuming h[n] is finite-amplitude.\n0o\nL\nZh[n]I = E Ih[n] = M (a number)\nn=-co\nn=-K\n(e) False. h(t) = u(t) implies causality, but J\nu(t) dt = oo implies that the sys\ntem is not stable.\n\nSignals and Systems\nS5-6\n(f) False.\nhi(t) = 6(t -\nti),\nti > 0\nCausal\nh 2(t) = b(t +\n2),\nt2 > 0\nNoncausal\nh(t) = hI(t) * h 2(t) = 6(t + t 2 -\nti),\nt 2 !- t 1\nCausal\n(g) False. Suppose h(t) = e-'u(t). Then\ne - tu(t)dt = -e-'\n-1\nStable\nThe step response is\nu(t - r)e -T u(r) d-r\ndr\ne -T\n= (\n(1\n-\ne~')u(t),\n(1 -\ne -') dt\n=t + e-'1\n= oo\n(h) True. We know that u[n] = E=O b[n -\nk] and, from superposition, s[n] =\nEf=0 h[n - k]. If s[n] # 0 for some n < 0, there exists some value of h[k] # 0\nfor some k < 0. If s[n] = 0 for all n < 0, h[k] = 0 for all k < 0.\nS5.10\n(a)\nJg(r)u1(r) dr = -g'(0),\ng(r) = x(t -\nr),\nt fixed,\n-\nx(t\n-\n)u1(r) dr=\ndg(r)\n_\n_\ndx(t -\n-r)\nJodr\nr=o\ndr\nt=0\ndx(t -\nr)\ndx(t)\ndt\nr=O\ndt\n(b)\ng(t)f(t)uj(t) dt\n-\ndt [gt)ft)]_\n=\n= -[g'(t)ftt)  g(t)f'(t)]__\n- IgMAO+Xt 1(l It =0\n= -[g'(O)f(O) + g(0)f'(0)],\nT g(t)[f(O)ui(t) - f'(0)S(t)] dt = -f(0)g'(0) - f'(0)g(0)\nSo when we use a test function g(t), f(t)ui(t) and f(O)ui(t) - f'(0)6(t) both\nproduce the same operational effect.\n(c)\nx(r)u 2(r) dr = x(r))\n- f -u (r)dr\n-- o\n_Y6\n_.dr\n*~dx\ndx/\nd2X\n-J\n-uir) dr =\n)\n+\nd2U0(r) dr\nd2x\ndr2\nr=0\n(d) f g(r)fr)u 2(r) dr = g\"(r)f(r) + 2g'(r)f'(r) + g(r)f\"(r)\n\nProperties of Linear, Time-Invariant Systems / Solutions\nS5-7\nNoting that 2g'(7r)f'(r) ,= = - 2f'(O) fg(r)ui(r)dr, we have an equivalent oper\national definition:\nf(r)u 2(r) = f(O)u 2(r) - 2f'(0)ui(r) + f\"(O)b(r)\nS5.11\n(a) h(t) * g(t) = J'. h(t - r)g(r) dr = f' h(t -\n)g(r) dr since h(t) = 0 for t < 0\nand g(t) = 0 for t < 0. But if t < 0, this integral is obviously zero. Therefore,\nthe cascaded system is causal.\n(b) By the definition of stability we know that for any bounded input to H, the out\nput of H is also bounded. This output is also the input to system G. Since the\ninput to G is bounded and G is stable, the output of G is bounded. Therefore, a\nbounded input to the cascaded system produces a bounded output. Hence, this\nsystem is stable.\nS5.12\nWe have a total system response of\nh = {[(h, * h 2) + (h 2 * h 2 ) -\n(h 2 * hl)] * hi + h-i} * hl\nh = (h 2 * h) + (hi 1 * h 2 ')\nS5.13\nWe are given that y[n] = x[n] * h[n].\ny[n] =\n(\nx[n -\nk]h[k]\nk= -w\nIy[n]I = E x[n -\nk]h[k]\nk=-Oo\nmax {y[n]|} = max\nx[n - k]h[k]\nk=-o\n< E\nmax {Ix[n-\nk]|}h[k]|\nk= -o\n=maxm{x n]l} z: lh[k]|\nk= -o\nWe can see from the inequality\nmax{Iy[n]|)\nmax{|x[n]|} Z Ih[k]|\nk= -o0\nthat E\nIh[k]| 5 1\nmax {Iy[n]|} s max {Ix[n]|}. This means that E\nIh[k]I\n-\n1 is a sufficient condition. It is necessary because some x[n] always exists that\nyields y[n] = E=_\nIh[k]1. (x[n] consists of a sequence of +1's and -l's.) There\nfore, since max {x[n]} = 1, it is necessary that E=\nh[k] 1 5 1 to ensure that y[n]\nS max {Ix[n]I} = 1.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nResource: Signals and Systems\nProfessor Alan V. Oppenheim\nThe following may not correspond to a particular course on MIT OpenCourseWare, but has been\nprovided by the author as an individual learning resource.\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Problem Set 6 Solutions",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/res-6-007-signals-and-systems-spring-2011/9a3b227f76df51d979c2a45dcb5cc013_MITRES_6_007S11_hw06_sol.pdf",
      "content": "6 Systems Represented by\nDifferential and Difference\nEquations\nSolutions to\nRecommended Problems\nS6.1\nWe substitute ya(t) = ay1(t) + Oy2(t) into the homogeneous differential equation\ndya(t)\nd\ndt + ay3(t)= d [ay 1(t) + #y2(t)] + a[ayi(t) + #y 2(t)]\ndt\ndt\nSince differentiation is distributive, we can express the preceding equation as\nady t) +0dy2t) + aay1(t) + afly2(t)\nddty\nddty\naa _ di( + ay1(t)\n+\ndt + ay2(t)\ndt\nI\ndt\nay()\nHowever, since both y1(t) and y2(t) satisfy the homogeneous differential equation,\nthe right side of the equation is zero. Therefore,\ndy3(t) + ay3(t) = 0\ncit\nS6.2\n(a) We are assuming that y(t) = es'. Substituting in the differential equation yields\nd 2\nd\nd (es') + 3\n(e t) + 2e\" = 0\nso that\ns2e\"t + 3se' + 2e\" = es'(s 2 + 3s + 2) = 0\nFor any finite s, e\" is not zero. Therefore, s must satisfy\n0 = s2 + 3s + 2 = (s + 1)(s + 2),\ns = -1,\n-2\n(b) From the answer to part (a), we know that both yi(t) = e-' and y2(t) = e-2\nsatisfy the homogeneous LCCDE. Therefore,\nys(t) = Kie~' + K 2e\n2,\nfor any constants K1, K2, will also satisfy the equation.\nS6.3\n(a) Assuming y(t) of the form\ny(t) = Kest,\nwe substitute into the LCCDE, setting x[n] = 0:\ndy(t)\n1 s\n0=\n+ y(t) =Ksel+K-7es = Ket\ndt\nS6-1\n\nSignals and Systems\nS6-2\nSince K # 0 and e\" # 0, s must equal --. K then becomes arbitrary, so the\nfamily of y(t) that satisfies the homogeneous equation is\ny(t) =Ke-12\n(b) Substituting into eq. (P6.3-1) y1(t) = Ae' for t > 0, we find\ndy1(t)\n~\nt\ndy\nI 1y t)= -Ae-'+\nAe'=e-'\nt >0\nSince e-' never equals zero, we can divide it out. This gives us an equation\nfor A,\nA\nasA = -2\n(c) For y 1(t) = (2e -t/ 2 -\n2e- t)u(t),\ndyi(t)\n[2 (-\n-) e -1/2 -\n2(-1)e -'],\nt > 0\ndt\nt0,\nt <0,\n1 2\n-t) + 1 (2e-' 2\ndyi(t)\nF(-e t\n+ 2e\n-\n2e- t) = e-',\nt > 0\ndt\n0,\nt <\n= x(t)\nS6.4\n(a) Note that since y[n] is delayed by one sample by the delay element, we can label\nthe block diagram as shown in Figure S6.4.\nx [n] -\n1y [n[-1\n_1\nFigure S6.4\nx[n]\n+y[n\nThus y[n] =\n-\n-\n1], or y[n] + ly[n -\n1] = x[n].\n(b) Since the system is assumed to be causal, y[n] must be zero before a nonzero\ninput is applied. Therefore, x[n] = 0 for n < 0, and consequently y[n] must be\nzero for n <0. Thus, y[-5] = 0.\n(c) Since x[n] = [n] = 0 for n < 0, y[n] must also equal zero for n <0. For n = 0,\nwe have y[0] + ly[-1] = 1 or, substituting for y[n],\nKa~u[0] + Ka-lu[-1] = 1,\nK + i- 0 = 1, or K=1\nFor n > 0, we have\ny[n] + ly[n -\n1] = 0 or an + ia\"-1 = 0\n\nSystems Represented by Differential and Difference Equations / Solutions\nS6-3\nsince K = 1. Thus, a must equal --\nfor a\" + -a1\nto equal 0 for all n > 0.\nTherefore, y[n] = (-1)\"u[n]. Substituting into the left side of the difference\nequation, we have\n(-2)\" u[n] +\n(1)\"-1\nu[n-1] = (-2)\" u[n] -\n(-2)\"\nu[n-1]\n1,\nn=0\notherwise\n-0,\n(d) We can successively calculate y[n] by noting that y[ -1]\n= 0 and that\ny[n] = -1y[n -\n1] + b[n]\nn=0,\ny[0] = --\n- 0 + 1 = 1\nn = 1,\ny[1] = -\n1 + 0 = -1\nn = 2,\ny[2] =\n-i\n(-)+0\n=i\nWe see that these correspond to the answer to part (c).\nS6.5\n(a) Performing the manipulations in inverse order to that done in the lecture (see\nFigure S6.5-1) yields the system shown in Figure S6.5-2.\nx[r\n-\n[n]\ny [n]\nD\nFigure S6.5-1\nx [n]\ny [n]\n-l___\n- - -\n- ---\nL _\n-\nA\nB\nFigure S6.5-2\n\nSignals and Systems\nS6-4\nSince the system is linear and time-invariant, we can exchange the order of the\ntwo boxes A and B, yielding the direct form I shown in Figure S6.5-3.\nx [n]\n+\ny [n]\nD\n|\n|D\nx [n -1\n-2\n1y[n-1\nB\nA\nFigure S6.5-3\n(b) From the direct form I, we see that the intermediate variable q[n] is related to\nx[n] by\nq[n] = x[n] -\n2x[n -\n1]\nThe signal y[n] can be described in terms of q[n] and y[n -\n11 as\ny[n] = q[n] + iy[n -\n1]\nCombining the two equations yields\ny[n] = iy[n -\n1] + x[n] -\n2x[n -\n11,\nor\ny[n] - iy[n -\n11 = x[n] -\n2x[n -\n1]\n(c) (i)\nFigure S6.5-4 shows that if we concentrate on the right half of the dia\ngram of direct form II given in Figure P6.5, we see the relation\ny~n] = r[n] -\n2r[n -\nr [n]\ny[n]\nD\nr[n-\n1]\n-2\nFigure S6.5-4\n(ii)\nSimilarly, Figure S6.5-5 shows that if we concentrate on the first half of\nthe diagram, we obtain the relation\nr[n] = x[n] + ir[n -\n1],\nor x[n] = r[n] - ir[n -\n1]\n\nSystems Represented by Differential and Difference Equations / Solutions\nS6-5\nr [n]\nx [n]\n-\n+\nr[n- 1]\nFigure S6.5-5\n(iii)\nFrom the two equations obtained in parts (i) and (ii),\nx[n] = r[n] - ir[n -\n(S6.5-1)\nand\ny[n] = r[n] -\n2r[n -\n1],\n(S6.5-2)\nwe solve for r[n],obtaining\nr[n] = fx[nJ -\nky[n]\nSubstituting r[n] into eq. (S6.5-1), we have\nx[n] = ,x[n] -\ny[n] -\n}{5xfn -\n1] - iy[n -\n1]},\nwhich simplifies to\ny[n] - iy[n -\n1] = x[n] -\n2x[n -\n1]\nS6.6\n(a) Integrating both sides of eq. (P6.6-1) yields\ny(t) + afy(t) dt = bx(t) + c fx(t) dt, or\ny(t) = -a fy(t) dt + bx(t) + c fx(t) dt\nThus, we set up the direct form I in Figure S6.6-1.\nx(t)\nP. y(t)\n+\n+\nC\n-a\nFigure S6.6-1\n\nSignals and Systems\nS6-6\n(b) Since we are told that the system is linear and time-invariant, we can inter\nchange boxes A and B, as shown in Figure S6.6-2.\n-'-4\nb\n-a\nc\nL-_-\n--\n___._\nB\nFigure S6.6-2\nCombining the two integrators yields the final answer, shown in Figure S6.6-3.\nx(t)\nb\n+\n-1y\nt)\n-a\nC\nFigure S6.6-3\nSolutions to\nOptional Problems\nS6.7\n(a) In Figure S6.7 we convert the block diagram from Figure P6.7 to direct form I.\nx [n]\n+\nq [n]\n+\nP y [n]\nD\nD\n-4\nFigure S6.7\n\nSystems Represented by Differential and Difference Equations / Solutions\nS6-7\nq[n] is given by\nq[n] = x[n] + x[n -\n1]\nwhile\ny[n] = q[n] -\n4y[n -\n1]\nSubstituting for q[n] yields\ny[n] + 4y[n -\n11 = x[n] + x[n -\n1]\n(b) The relation between x[n] and r[n] is r[n] = -4r[n -\n1] + x[n]. For such a\nsimple equation, we solve it recursively when a[n] = x[n].\nn\nb[n]\nr[n -\n1]\nr[n]\n<0\n-4\n-4\n-64\nWe see that r[n] = (-4)\"u[n].\n(c) y[n] is related to r[n] by\ny[n] = r[n] + r[n -\n1]\nNow y[n] = h[n], the impulse response, when x[n] = 6[n], and\nh[n] = (-4)\"u[n] + (-4)\"-Iu[n -\n1]\nThis expression for h[n] can be further simplified:\nh[n] = (-4)\"u[n] + (-4)\"-Iu[n -\n1]\nor\nh[n] =\n0'\n1,\nn\n=0\nFor n > 0,\nh[n] = (-4)\" + (-4)\"-1\n-3(-4)\"-1\nThus,\nh[n] = b[n] - 3(-4)\"1 u[n -\n1]\nS6.8\nNote that the system in Figure P6.8 is not in any standard form. Relating r(t) to x(t)\nfirst, we have\nf a[x(t) + r(t)] dt = r(t),\nor\n(S6.8-1)\ndr(t) - ar(t) =\ndt\nrepresented in the system shown in Figure S6.8.\n\nSignals and Systems\nS6-8\nx(t)\nr(t)\nx(t)+r(t)\nf\na\nFigure S6.8\nThe signal y(t) is related to r(t) as follows:\nr(t) + bf r(t) dt = y(t),\nor\n(S6.8-2)\ndr(t)\ndy(t)\n+ br(t) =\ndt\ndt\nSolving for dr(t)/dt in eqs. (S6.8-1) and (S6.8-2) and equating, we obtain\ndy(t)\nar(t) + ax(t) = -br(t) + dtdt\nTherefore,\n-a\ndy(t)\n(S6.8-3)\nr(t) = a~x(t)\n+a\nbd86-3\na +b\na +b\ndt\nWe now substitute eq. (S6.8-3) into eq. (S6.8-1) (or eq. S6.8-2), which, after simpli\nfication, yields\ndy2(t)\ndy(t)\ndx(t)\ndt2dt-a\ndt\n= dta\nd\nt+abx(t)\nS6.9\n(a) Substituting y[n] = Az\" into the homogeneous LCCDE, we have\nAz\" - -Azo ' = 0\nDividing by Azo\"\nyields\nzo -i=\n0,\nor\nz=\n(b) For the moment, assume that the input is I[n] = Kej\"0\"u[n] and the resulting\noutput is P[n] = Yei\"Ou[n]. Thus,\nP4n] - iPn -\n11 = t[n]\nSubstituting for P[n] and .{n] yields\nYeJ\"\n-\neKe\"0\"\nfor n > 1\nDividing by e \"o\", we get\nY\ne-j\"\n- Y = K\n\nSystems Represented by Differential and Difference Equations / Solutions\nS6-9\nThus\nK\nK\nY=\n=\\/\n-\ncos 0 e j tan- 1(sin no)/(2-cos go)1\nor\ny n\ne -j tan-n](sin\ne)e(2\"cos\nno)\ncos 0\n\\/\no\nKK\nTherefore,\ny[n]\nu[n]]\na_ Ko~\nKK\nCoSjU~f\n= Re[Ye' 0\n=\nRetei 'On tan l[(sin Oo)/(2-o\nK\n= B cos( 0 n + 0),\nwhere B =\n\nsin g0\n0 = -tan-'(\no\no\nS6.10\nThe important observation to make is that if [dtr(t)]/dti is the input to the system\nH, then [dis(t)]/dt' will be the output. Suppose that we construct a signal\nM\nd'r(t)\nq(t) = (a\ni= 1\nThe response of H to the excitation q(t) is\nM\np(t) = ( a\ndit\ni=1\nHowever, q(t) = 0 for all t. Therefore, p(t) = 0 for all t. Thus,\nM ad's(t) =0\naidt\nS6.11\n(a) Substituting y(t) = Aeso' into the homogeneous LCCDE, we have\nN\ndky(t)\nN\ndk\nak\nd\n=(a\nk(Ae)=0\nk=0\nk=0\n=\naks\nAet\n=0\n\\k=\n0)/\nSince A # 0 and esot # 0, we get\nN\np(so) = (\naks\n= 0\nk=0\n(b) Here we need to use a rather subtle trick. Note that\nd\nAte\" = -- (Ae')\nds\n\nSignals and Systems\nS6-10\nUsing this alternative form for Ate\", we obtain\nN\ndk/d~\n[N\nAk\nak dt\nk=O\nd\nd Ae t\ncis\n=\ncis\nk=\naI dt (Aest\n= d\n-\n[p(s)Ae\"]\nds\n= Atp(s) + A dp(s) est\nds\nFor s = so, p(so) = 0. Also, since p(s) is of the form\np(s) = (s -\nso) 2q(s),\nwe have\ndp(s)\nds\n=S=\nTherefore, AteO' satisfies the homogeneous LCCDE.\n(c) Substituting y(t) = est , we get the characteristic equation\ns2 + 2s + 1 = 0,\nor\nsO = -1\nThus, y(t) = Ke~' + K 2te~'. For y(0) = 1 and y'(0) = 1, we need K, = 1 and\nK 2 - Ki = 1, or K2 = 2. Thus,\ny(t) = e~' + 2te\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nResource: Signals and Systems\nProfessor Alan V. Oppenheim\nThe following may not correspond to a particular course on MIT OpenCourseWare, but has been\nprovided by the author as an individual learning resource.\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Problem Set 7 Solutions",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/res-6-007-signals-and-systems-spring-2011/f8aec247fda51db827fccb48e79d75d6_MITRES_6_007S11_hw07_sol.pdf",
      "content": "7 Continuous-Time Fourier Series\nSolutions to\nRecommended Problems\nS7.1\n(a) For the LTI system indicated in Figure S7.1, the output y(t) is expressed as\ny(t) =f\nh(r)x(t - r) dr,\nwhere h(t) is the impulse response and x(t) is the input.\nLTI\nx(t)\nON h(t)\ny (t)\nFigure S7.1\nFor x(t) = ew',\ny(t) = f\nh()ew(- T) dr\n= ejwt {\nh(r)e-j' dr\n= e+iwtH(w)\n(b) We are given that the first-order differential equation is of the form\ndy(t) + ay(t) = x(t)\ndt\nFrom part (a), when x(t) = eiw', then y(t) = ej\"'H(w). Also, by differentiating\ny(t), we have\ndy(t)\ndt)\n= jcoej\"'H(co)\nSubstituting, we get\njwewtH(w) + aejw'H(w)\newt\nHence,\njwH(o) + aH(w) = 1,\nor\nH(w) = a + jw.\nS7.2\n(a) The output of a discrete-time LTI system is given by the discrete-time convo\nlution sum\ny[n] = (\nh[k]x[n -\nk]\nk\nS7-1\n\nSignals and Systems\nS7-2\nIf x[n] = z\", then\ny[n] = (\nh[k]z\"-k\nk\n= z\"\nh[k]z -k\nk\n= z\"H(z)\n(b) We are given that the first-order difference equation is of the form\ny[n] + ay[n -\n1] = x[n]\nFrom part (a), if x[n] = z\", then y[n] = z\"H(z). Hence,\ny[n -\n1] = z\"-1H(z).\nBy substitution,\nz\"H(z) + az\"- H(z) =z\"\nwhich implies\n(1 + az-')H(z) = 1,\nH(z)\n=\n_\n1 + az-1\nS7.3\n(a) x(t) = sin (lort + 6\n=\nj2xt5 _\n-j21t5\n2j\n2j\nWe choose wo, the fundamental frequency, to be 21r.\nx(t) =\na eik-ot,\nk\nwhere\nejr/6\n__e -jr/6\na5 =a_5\n2j\n2j\nOtherwise ak = 0.\n(b) x(t) = 1 + cos(27rt)\nej2xt\ne-j2wt\n=1+\n+ejit\nFor wo = 2 7r, a_\n= ai = -, and ao = 1. All other ak's = 0.\n(c) x(t) = [1 + cos(27rt)] [sin(lort +\n= sin(10it +\n+ cos(2irt)sin( 10irt +\n2 t 5\n=\ne /6 ej2rt5\ne 2\ne -j2t5)\nj2+rt + le -j2+ t\neji( 6 e r\n__e 2* e -j27rt5\n-_ 2j\n.\n_}15_ 2j\ne\n-j2xts +\n4j\nej 2 t6\n_\n4j\ne-j2xt4\n+\ne\nj21rt4\nee\n-j2t6\n4j\n4j\n\nContinuous-Time Fourier Series / Solutions\nS7-3\nTherefore,\nx(t) = ( ake*4'\nwhere wo = 2 1r.\nejr/6\na4 =-\n.\n43j\na-4\n.\n4j\na5 = ejr/6\n-,\n2j\na-5,\n_ e-ir\n-2j\n/6\nI\nejr/6\n_e-jr16\na6 -\n4j\na_6 =\n.\n4j\nAll other ak's = 0.\nS7.4\n(a)\nNote that the period is To = 6. Fourier coefficients are given by\nak = -\nx(t)e -jk\" 0t dt\nWe take wo = 27r/To = r/3. Choosing the period of integration as -3 to 3, we\nhave\n1 F2\nak = 6\ne\njk( /3)t\n-\n-jk(r/3)t dt\n6 f 1\n_\n_\ne\n-jk(r/3)t\n-jk(ir/3)t\n6 -jk(7r/3)\n6 -jk(7r/3)\n[e +j(7/3)k _ e +j(2r/3)k -\ne-j(21/3)k + e\nj(-/3)kI\n-j27rk\ncos(2ir/3)k\ncos(7r/3)k\njrk\njrk\nTherefore,\n7r\nx(t) =\nakejkwot\nk\nand\ncos(27r/3)k -\ncos(r/3)k\nak =\njrk\n\nSignals and Systems\nS7-4\nNote that ao =\nnoting that\n0, as can be determined either by applying L'H6pital's rule or by\n(b)\nx(t)\nao = (1|T0 ) f x(t)dt.\nFigure S7.4-2\nThe period is To = 2, with wo = 2-x/2 = r. The Fourier coefficients are\nak =\n-\nfTO x(t)e -iko'dt\nTo\no\nChoosing the period of integration as -i2 t o -2, we have\na\n3/2\nk= 2\nx(t)e -ikot dt\n-1/2\n3/2\n1/2 [6(t) -\n26(t -\n1)]eikO' dt\n.\n1.\ne-k-o = -\n(e-i-)k\nTherefore,\na o\n-\n2,\nak =\n-\n()k\nIt is instructive to plot ak, which we have done in Figure S7.4-3.\n\nContinuous-Time Fourier Series / Solutions\nS7-5\nS7.5\n(a) (i) and (ii)\nFrom Problem 4.12 of the text (page 260), we have\nx {t - T)= -x(t),\nwhich means odd harmonics. Since x(t) is real and even, the waveform has real\ncoefficients.\n(b) (i) and (iii)\n-x(t) = x\nt\nwhich means odd harmonics. Since x(t) is real and odd, the waveform has imag\ninary coefficients.\n(c) (i)\nW~\nT)\n-x(t) = x t 4 )'\nwhich means odd harmonics. Also, x(t) is neither even nor odd.\nSolutions to\nOptional Problems\nS7.6\nx(t) is specified in the interval 0 < t < T/4, as shown in Figure S7.6-1.\nx(t)\n|\nt\nT\nT\nFigure S7.6-1\n(a) Since x(t) is even, we can extend Figure S7.6-1 as indicated in Figure S7.6-2.\nx (t)\nt\n_T\n_T\nT\nT\nFigure S7.6-2\n\nSignals and Systems\nS7-6\nSince x(t) has only odd harmonics, it must have the property that x(t -\nT/2)\n= -x(t), as shown in Figure S7.6-3.\nx(t) in\nx(t - T) = -x(t)\nFigure S7.6-2 shifted\nT\nT\nT\n-x(t) in /\nFigure S7.6-2\nFigure S7.6-3\nSo we have x(t) as in Figure S7.6-4.\nx(t)\n_T\nT\nT\n3T\nT\n-1-\nFigure S7.6-4\n(b) In the interval from t = 0 to t = T/4, x(t) is given as in Figure S7.6-5.\n\nContinuous-Time Fourier Series / Solutions\nS7-7\nSince x(t) is odd, for - T/4 < t < T/4 it must be as indicated in Figure S7.6-6.\nx(t)\nT\nT\nT\nFigure S7.6-6\nSince x(t) has odd harmonics, x[t -\n(T/2)] = -x(t). Consequently x(t) is as\nshown in Figure S7.6-7.\nx(t)\nT\nT\nT\nT\n-1\nFigure S7.6-7\nS7.7\nak = -\nx(t)e -jkw 0t dt\nTO\nTO\n(a) alk = -\nx(t -\nto)e-jk\" 0t dt\nT0\nfTO\nSubstituting r = t -\nto, we obtain\n1F\nak = -\nI x(r)eikwor dr - e -jkoto\nOTO\n= ake -jk\"0'0o\n-\n(b) ak =\nf17O x(- t)e jkwot dt\nT0O\nSubstituting r = - t, we have\nak = -\n= a-k\nT0OfT0 x(T)e kwOdr\n\nSignals and Systems\nS7-8\n(c)\n= - 0x*(t)e -jk 0t dt\n50TO\n=\nT0\nx(t)ekwot dt = ak,\n6k = ak\n(d) a(d) =\nfi\nx(at)eik(2 ra/T)t dt\n0 To\nla\nLet r = at. Then\nak =\n-\nx(r)e -jk(2\"/To)' dr = ak\nTO\nTo\nTherefore,\na\nS7.8\n(a) Since O4(t) are eigenfunctions and the system is linear, the output is\ny(t) = L XkCk'k(t).\nk=-00\nd2x(t)\ndx(t)\n(b)\ny(t)=t 2 dt 2\n+t\ndt2\ndt\nkk(t) = tk,\nd0k(t)\nktk1_\ndt\n'\nd2 dtk(t)\n\"k-Jt2\ndt 2\n= ktk -\n1)tk-2\nSo if k(t) = x(t), then\ny(t) = t 2k(k -\n1)tk-2 + tktk I\n= k(k -\n1)tk + ktk\n= kotk = k 4k(t)\nThe eigenfunction 4k(t) has eigenvalue Xk = k 2\nS7.9\n(a) 9(t) = 2 1(t) * 2 2(t)\n=\nfT\nI 1(r)A2(t -\nr) dr\nThe Fourier coefficients for P(t) are given by\nCk = --\nI\n1(r)\n2(t\n-\nr) dre\n-jk(2wTot)t\n50TO\nTOL\n= --1 J\n1(r)e-<k(2./T 0)Tr\nF\n-r)e jk(2r T0)(t-) dt\nToakbk\n\nContinuous-Time Fourier Series / Solutions\nS7-9\n(b) Since z(t) * z(t) =x(t),\nS7.9-2.\nas shown in Figure S7.9-1, then 2(t) is shown in Figure\nz(t)\nz(t)\nx (t)\n-1\nt\n-1\nt\nFigure S7.9-1\n-2\nt\nIn Figure S7.9-2, To = 5. Hence,\nT(t ) -\nToz' = 4 sinc\n(c) Without explicitly carrying out the convolutions, we can argue that the aperi\nodic convolution of x 1(t) and x 2 (t) will be symmetric about the origin and is\nnonzero from t = -2T to t = 2T. Now, if 1 1(t) and 2 2(t) are periodic with period\nTo, then the periodic convolution, P(t), will be periodic with period To. If To is\nlarge enough, then q(t) is the periodic version of y(t) with period To. Hence, to\nrecover y(t) from P(t) we should extract only one period of P(t) from t =\n-TO/2\nto t = TO/2 and set y(t) = 0 for ItI > TO/2, where TO/2\n2T, or To\n-\n4T.\nS7.10\n(a) The approximation is\nN\nN(t)=\nk=-N\nakk(t\nwith the corresponding error signal\neN(t) =\n=\nx(t)\nx(t) -\nNt)\nN\n( akk(t)\nk=-N\n\nSignals and Systems\nS7-10\nHence,\n|eN(t)I = x(t) -\nkk\nx*()\na*t)\n= |x(t)| 2 - (\nakx(t)4k(t) - z akx(04k() + ( (\naka14k(M 1()\nk\nk\nk\nI\nIf we integrate, f\neN(t) 12 dt, and use the property that\nk = 1,\na\n1,\notherwise,\nwe get\nb=\nE = fb Ix(t) I'dt\na\n- Za*\nk\nx(t)kp(t) cit\n-\nT\nak\nX*(tk(t)dt + T\n|akI\nk\na\nk\nSince ai = bi + jc,\n=E\nr\nOC\nx*(t)Oi(t) dt + 2bi\nan d\nx(t)k7(t) dt\nand\n-_\n= j\nx(t)(t)dt - j f x*(t)i(t) dt + 2c,\naci\nSetting\n-=\nand\n= 0,\nwe can multiply the second equation byj and add the two equations to get\n(E\naE\nab +\n- = 0\nBy substitution, we get\nbi + jci =\nax(t)O(t)\ndt\n= a,\n(b) If {4(t)} are orthogonal but not orthonormal, then the only thing that changes\nfrom the result of part (a) is\nTab\na\nqk*~c(t) dt Z IakIAk\nab\nk1\nk\nk\nIt is easy to see that we will now get\na =\nfbx(t)4it)\ndt\n\nContinuous-Time Fourier Series / Solutions\nS7-11\n(c) Since\nfTo+a einwot e-jnwot dt =\nfor all values of a, using parts (a) and (b) we can write\nai =\na\nx(t)e-\"nwo' dt\n_ 1\n=-\nx(t)e-nwot dt\nT0 fTo\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nResource: Signals and Systems\nProfessor Alan V. Oppenheim\nThe following may not correspond to a particular course on MIT OpenCourseWare, but has been\nprovided by the author as an individual learning resource.\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Problem Set 8 Solutions",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/res-6-007-signals-and-systems-spring-2011/e51acadc431ffca5d005c4cbdc2954bc_MITRES_6_007S11_hw08_sol.pdf",
      "content": "8 Continuous-Time\nFourier Transform\nSolutions to\nRecommended Problems\nS8.1\n(a)\nx(t)\nt\nTj\nTj\nFigure S8.1-1\nNote that the total width is T,.\n(b)\ni(t)\nt\n3T1 -- T1\nTo\nT1\nT1\nTo Tl\n3 T 1 =O\nFigure S8.1-2\n(c) Using the definition of the Fourier transform, we have\nX(w) =\nox(t)e -j\ndt =\nTi/2 le-j\" dt since x(t) = 0 for ItI>\nTil\nsin wTi\n=\ne -\n(e -jwTI1/2\n_ eT1/\n2) =\nJW\n-T1/2\n(e\nSee Figure S8.1-3.\nS8-1\n\nSignals and Systems\nS8-2\n(d) Using the analysis formula, we have\nak = T f\nX(t)e ~jk\n0t dt,\nwhere we integrate over any period.\n_ 1\nak -T\ne -jk(2/T\n)t dt\nf T (t)e -jk(2w/T)t dt = f T1 /2\nO\n- To12\nTO\n-T 1 /2\nTo1\nak =\n(e\njkirToT 0\n--\neikir1/TO) = sin kr(T1 /T 0 ) _ sin ,r(2k/3)\nTO\n,rk\n7rk\n-jk 2,\nNote that ak = 0 whenever (27rk)/3 = irm for m a nonzero integer.\n(e) Substituting (21rk)/To for o, we obtain\nT_1X(\n=2)T\n1 2 sin(7rkT1 /T0)\nsin rk(T1/T 0 )\nak\nTO\nI\"=(21rk)/ To\nTo\n2,rk/To\n,rk\n=\n(f) From the result of part (e), we sample the Fourier transform of x( t), X(w), at\nw = 2irk/To and then scale by 1/To to get ak.\n\nContinuous-Time Fourier Transform / Solutions\nS8-3\nS8.2\n(a) X(w) = fx(t)e\n-j4t dt =\n(t -\n5)e -j' dt = e ~j\n= cos 5w - j sin 5w,\nby the sifting property of the unit impulse.\nIX(w)| = |ej5wI = 1\nfor all w,\n<tX(w)\n= tan-'\ntan\n-sin5wo)\n= -5w\nLIM{X(xc)}\nRe{X(co)}\ncos 5w\n(b) X(w) =\ne -a tu(t)e -i\"' dt =\ne -ate -j't dt\ne - (a+jo)t\n- (a+jw)t dt\n-1\na+jw\no\nSince Re{a} > 0, e -at goes to zero as t goes to infinity. Therefore,\n-1\nX(W) =\n1(0\n-\n1) = a +jw\na + jw\nIX(W)I = [X(W)X*(w)]l/ 2 =\na +ja\n-jw)]\n+o2\n>\n\\/\nX(w) + X*(O)\na\nRe{X(w)} =\na\n2 + (2\ni\nIm{X(W)}\n= X(W) -\nX*(W)\n-W\na2 + w2'>\nIm{X(W))\n_ w\n-X(O)\n= tan-\n= -tan\na\nThe magnitude and angle of X(w) are shown in Figure S8.2-2.\n\nSignals and Systems\nS8-4\nIX(w)I\n-a\na\n4X(W)\nTro\n-aa\n2T\nFigure S8.2-2\n(c) X(o) =\ne\n1+12)tU(t )e -'''dt =\ne(-1+ 2)te -jct dt\n[ 1-+j(2-)t\n1 + j(2 -\n)0\nSince Re{-1 + j(2 - w)} < 0, lim,\ne[- 1+j(2-w)\n= 0. Therefore,\n1 + j(o -\n2)\nIX(wO)| = [X(x)X*(W)]11 2 =\n\\/1\n+ (ow-\n2) 2\nX(w) + X*(W)\nRe{X()}\n=\n1 + (w -\n2)2\nX(w) -\nX*(co)\n-(o\n- 2)\nIm{X(W)} =\n1 + ((A -2)2\nX()\n= tan-' ImX(W)\n-tan-'(w -\n2)\nLRe{X(w)}\nThe magnitude and angle of X(w) are shown in Figure S8.2-3.\n\nContinuous-Time Fourier Transform / Solutions\nS8-5\nX(w)I\n4X(W)\nFigure S8.2-3\nNote that there is no symmetry about w = 0 since x(t) is not real.\nS8.3\n(a) X3(w) =\nX3(t)e -' dt\nSubstituting for x3(t), we obtain\nX3(() = J\n[ax 1(t) + bx 2(t0)e 1-'dt\n=f\nax1(t)e -wt dt +\nbx 2(t)e -jwt dt\n= af\nx1(t)e -j dt + b f\nx 2(t)e -- ' dt = aX1(w) + bX 2(w)\n(b) Recall the sifting property of the unit impulse function:\nf\nh(t)b(t -\nto) dt = h(t o)\nTherefore,\n21rb(w -\nwo)ej-' do = 2rewot\n\nSignals and Systems\nS8-6\nThus,\n1-\n2 7rb(w -\nwo)ei-' dw = ei-o'\n2,r\n-\"oo\nNote that the integral relating 2-7rS(w -\nwo) and e-o' is exactly of the form\nx(t) = -\nX(w)ej- t dw,\nwhere x(t) = e jot and X(w) = 2-7rb(co -\nwo). Thus, we can think of ei-o' as the\ninverse Fourier transform of 2 7rb(w -\nwo). Therefore, 27rb(o -\nwo) is the Fourier\ntransform of eiwo'.\n(c) Using the result of part (a), we have\n=\nX(M) = 7{x(t )} = 51\n1 ake 2r j\nT,\na, 5T {eik( 2,rs/t\nFrom part (b),\n5{eik(2,rT)t\n= 2,irb ( W\n-21rk)\nTherefore,\nZ(w) =\n27rab ( W\nk = -00\n(d)\nX(w)\n2 sin\n2 sin 2\nT o\nFigure S8.3\nS8.4\n(a) We see that the new transform is\nXa(f) = X(w)\nW=2,wf\nWe know that\nx(t) = - f\nX(w)e'j t do\n\nContinuous-Time Fourier Transform / Solutions\nS8-7\nLet w = 2irf. Then dw = 21rdf, and\n=\nx(t)\nX(21rf)ej 2\"2ir df =\nXa(f )ei2 ,\"f df\nf= -o\nThus, there is no factor of 21r in the inverse relation.\nIXa(f)I\nTI\nTI\nTI\nTF\nT,\nFigure S8.4\n(b) Comparing\nXb(V) = -1\nx(t)e jv' dt\nand\nX(w) =\nx(t\n-j~\" dt,\nwe see that\nXb(V) =\nX(W)\nor\nX(w) = \\7\nX(w)\nV2_\n-V\n7r\nThe inverse transform relation for X(w) is\nx(t)\n-\n*0 X(w)e\nj\ndw = 1\nX2r(w)ej- dw\n=1\nXb(v)e jvt dv,\nwhere we have substituted v for w. Thus, the factor of 1/2-x has been distributed\namong the forward and inverse transforms.\nS8.5\n(a) By inspection, To = 6.\n(b) ak = 1\nTO )e -k(2 /To)t dt\nTO J T0\nWe integrate from -3 to 3:\n1 1\nak=\n(ti + 1)+\n6(t) + -6(t\n-\n+ c\nJ- 2\n(1\n= 1\n+l 1 + 'je\n-Jlk6..\nCos 2k\n\nSignals and Systems\nS8-8\n(t) =\n6(\n+ Cos 27rk eik(2 /6)t\n(c) (i)\nX1(w) =\nx 1(t)e -\"' dt\n-\n[6(t + 1) + b(t) + -1(t -\n1)]e -j't dt\n- ie * + 1 + ie -\"1\n+ cos w\n(ii)\nX 2(w) =\nx 2(t)e -''' dt =\n[3( t) + it(t -\n1) + -3(t -\n5)]e -\ndt\n= 1 + ie -j + le -i5w\n(d) We see that by periodically repeating x 1( t) with period Ti = 6, we get t(t), as\nshown in Figure S8.5-1.\nx1(t)\nt\n-1\nx 1 (t -\n6)\nxl(t + 6)\n2 t\nt\n|tt)\nt\n-7\n-6\n-5\nx(t)\n-7\n-6\n-5\n-1\nFigure S8.5-1\nSimilarly, we can periodically repeat x 2(t) to get 1(t). Thus T2 = 6. See Figure\nS8.5-2.\n\nContinuous-Time Fourier Transform / Solutions\nS8-9\nx 2(t)\ntilt\nt\nX2 (t -6)\nt\nt\nt\nx2(t  6)\nt2~\n-6-5\nX(t)\nIL\nt2 tIt\nt\n-6 -5\n-1\nFigure S8.5-2\n(e) Since I(t) is a periodic repetition of x 1(t) or X 2(0), the Fourier series coefficients\nof t(t) should be expressible as scaled samples of X,(co). Evaluate X1(0) at w=\n21rk/6. Then\nco-=\nk*k2rk\n(27rk\\\nSimilarly, we can get ak as a scaled sample of X2(w). Consider X2(21rk/6):\nX2-\nj2k/6 +\n5e\ne\nX1(x)\n=irk1\n=6,rk\nn\nX\nx\n+2o\nBut e\nnjlOrk6\ne j(lOrk/62rk)\n2rkI6. Thus,\n=\ne\nX2\n= 1 + cos\n-\n=\n6 a.\nA\nX6\nAlthough X,(w) # X 2(w), they are equal for w =27rk/6.\n\nSignals and Systems\nS8-10\nS8.6\n(a) By inspection,\nThus,\ne -atu(t)\n7 9\n1 .\na + jw\n(b)\n7I\ne- 7tu(t)\n7 + jw\nDirect inversion using the inverse Fourier transform formula is very difficult.\nXb(w) = 26(w + 7) + 26(o -\n7),\nXb(t) =\n-\nXb(w)ej do =\n-\n2 [6(w + 7) + 6(w\n.\ne-It +\ne\n= cos 7t\n- 7)]ei-' dw\n(c) From Example 4.8 of the text (page 191), we see that\n2a\ne\nalti\n_2a\na 2 + W2\nHowever, note that\nsince\nax(t)\naX(w)\nax(t)e -j\" dt = a\nx(t)e -jw dt = aX(w)\nThus,\n(d)\n-\n-e\n-\" l\n2a\na2 + (02\nor\n9 + .2\nXa(w)Xb(W)\n= Xa(w)[26(o + 7) + 26(w -\n7)]\n= 2X(-7)(co + 7) + 2Xa(7)6(w -\n7)\nXdCO)=\n-\n(w +7) +\nb(o7)\n7 - j7\n7 +j7\n1f*[2\n7+\nxaOt =\nf-\n.7 6(o + 7) +\nb(co\n27r--\n7 -37\n7 +j7\n1 1\n.\n1 1\n.\nXA(t) =\n-\ne 7' + -\nej_ '\nir7-j7\nxr7+j7\nNote that\n-\n7)\nej\" do\n- e\n-31t\nThus\n7 +j7\n7 2\n-jr/4\n7 -j7\n1=\n=_ (\n,\n+jir/4\nXA(t) = -\n-\nr7\n-2 [e -j(7t -/4)\n+ ei( 7t-/4)] = --\n77r cos\n7t -\n-)4\n\nContinuous-Time Fourier Transform / Solutions\nS8-11\nwe ~j3w,\n0 5 w < 1,\n(e) Xe(w) =\nwe -j3 w,\n-1\n! (O\n0,\nt0,\nelsewhere,\nx(t) =\nf\nX(w)e-' dw = i [J'we -jamei'\ndo -\nwe ~i3-ejwl dw\nNote that\ne ax\nxe\"f\ndx =\n, -(ax\nax\n-1)\nSubstituting a = j(t -\n3) into the integrals, we obtain\nj(t\n- 3)w\nI\negj(t - 3)w\n= - L(\n(j(t - 3)w - 1)\n(j )) 2 (j(t -\n3)w -\n1) J\nx(t)\n21r (j(t - 3))\n(j(t -\n3))\nwhich can be simplified to yield\n1 [ cos (t - 3) -\nsin (t - 3)\nx(t)\n=\n7r\n(t -\n3)2\n+\n(t -\n3)_\nSolutions to\nOptional Problems\nS8.7\n(a)\nY(w) =\ny(t)e -j\ndt\nx(r)h(t -\n-) dr e -j'' dt\nS ft x(,r)h(t - 1)e -j\"' dr dt\n(b) Let r\nt -\nT and integrate for all r and r. Then\nY(w) =\nTT=-\n.fro\nx(r)h(r)e -jw( r-+*T) dr dr\n=\nx(r)e -'\nd-r {r=-0\nh(r)e ~'j dr\n= X(w)H(w)\nS8.8\n(a) Using the analysis equation, we obtain\nrT/2_\nIlk\n=\nI T/\ne(t)e -jk(21r/T) t dt-T\nT\n-T/2\nT\nThus all the Fourier series coefficients are equal to 1/T.\n(b) For periodic signals, the Fourier transform can be calculated from ak as\nX(w) = 21\nak\nw-T\nk=-00\n\nSignals and Systems\nS8-12\nIn this case,\n2rk\nPM=T\nT\nP(wj)\n21Tr\nT\n_47\n_ 2n\n2_\nT\nT\nT\nT\nFigure S8.8\n(c) We are required to show that\n2(t) = x(t )* p(t)\nSubstituting for p(t), we have\nx(t)* p(t) = xt\n*\nkT)\nk\nOt\n\nUsing the associative property of convolution, we obtain\nx(t) *p(t) = T, [x(t) * b(t -\nkT)]\nk= -o\nFrom the sifting property of b(t), it follows that\nx(t)* pX)O\nx(t -\nkT) =t(t)\nk=\nThus, x(t) * p(t) is a periodic repetition of x(t) with period T.\n(d) From Problem P8.7, we have\nX(w) = X()P(x)\n27rk\n= X(-)\n-\n-T\nk=\n2xk\n=jI -- X(w)5(c\nSince each summation term is nonzero only at w = 27rk/T,\n*0 27r\n2rk\n2xk\ni =\ny=)\nT X( T\nB\nFrom this expression we see that the Fourier series coefficients of t(t) are\n-\n,\nak =\nX\nT i\nT\nwhich is consistent with our previous discussions.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nResource: Signals and Systems\nProfessor Alan V. Oppenheim\nThe following may not correspond to a particular course on MIT OpenCourseWare, but has been\nprovided by the author as an individual learning resource.\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Problem Set 9 Solutions",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/res-6-007-signals-and-systems-spring-2011/5644da4d019dc13df5474608ba1a86d5_MITRES_6_007S11_hw09_sol.pdf",
      "content": "9 Fourier Transform Properties\nSolutions to\nRecommended Problems\nS9.1\nThe Fourier transform of x(t) is\nX(w) =\nx(t)e -jw dt = fe-t/2 u(t)e\ndt\n(S9.1-1)\nSince u(t) = 0 for t < 0, eq. (S9.1-1) can be rewritten as\nX(w) =\ne-(/ 2+w)t dt\n+2\n1 + j2w\nIt is convenient to write X(o) in terms of its real and imaginary parts:\nX(w)\n1-j2\n2 -j4w\n1 + j2w 1 -j2wJ\n1 + 4W2\n.\n4w\n1 + 4W2\n1 + 4W2\nMagnitude of X(w) =\n/V1 ++4w 2\nX(w) = tan-'(-2w) = -tan-' (2w)\n+2\n-4w\nRe{X()} = 1+4w2 ,\nIm{X(w)} = 1 +4W 2\n(a)\nIX(w)I\nFigure S9.1-1\n(b)\n4X(O)\n1T\n____________________4\nFigure S9.1-2\nS9-1\n\nSignals and Systems\nS9-2\n(c)\nRelX(w)t\n(d)\nIm\nFigure S9.1-3\nX(o)\nFigure S9.1-4\nS9.2\n(a) The magnitude of X(w) is given by\nIX~)|I = /X2(w) + XI(W),\nwhere XR(w) is\nfollows that\nthe real part of X(w) and X(w) is the imaginary part of X(w). It\n|X(W)| =\nIwI < W,\nIwI >W\nIX(co)|\nThe phase of X(w) is given by\n<X(w) = tan-'\nX\n=wtan-'(1),\n'\\XRGA))/\nw\ni\nW\nFigure S9.2-1\nIWI < W\n\nFourier Transform Properties / Solutions\nS9-3\n4X(w)\niT\n|\nCo\n-W\nW\nFigure S9.2-2\n(b)\n1M+\njwIl<W\nX(- C) = 0,L l\nI0\notherwise\notherwise\n0,1 + j,\n|w l < W\n0,\notherwise\nHence, the signal is not real.\nS9.3\nFor x(t) to be real-valued, X(w) is conjugate symmetric:\nX(-w) = X*(W)\n(a) X(w) = X(w)|eiX(W)\n= IX(w) Icos(4IX(w)) + j IX(w) Isin(4X(x))\nTherefore,\nX(-o) = |X(-w)|cos(4X(-w)) + j|X(-w)|sin(4X(-w))\n= |X(w) Icos(4X(w)) - j IX(w) Isin(4X(w))\n= X*(W)\nHence, x(t) is real-valued.\n(b)\nX(w) = XR(w) + jXw)\nX(-w) = XR(-W) +jX,(-W)\n= XR(w) + j[ -X(w) + 2,r]\nfor w > 0\nX*(w) = XR(w) -\njX 1(\nTherefore,\nX*(w)\nX(-W)\nHence, x(t) is not real-valued.\nS9.4\n(a) (i)\nX(,w) =\nx(t)e i* dt\nWe take the complex conjugate of both sides to get\nX*(w) = f-x*(t)ej-' dt\n\nSignals and Systems\nS9-4\nSince x(t) is real-valued,\nX*(W) =\nx(t)ei-t dt\nTherefore,\nX*(-o)= f\nx(t)e -\ndt\n= X(W)\n(ii) x(t) = -\nX(w)ej\" dw\nTaking the complex conjugate of both sides, we have\nx*(t) = -\nX*(w)e -w\"dw\nTherefore,\nx*(-)\n=0\nX*(w)ej\"\" do\nSince x(t) = x*(-t), we have\n-\nX(co)ei\" dw = -f\nX*(w)ejw\" dw\nThis shows that X(w) must be real-valued.\n(b) (i)\nSince x(t) is real, X(w) = X*(-w). Since x(t) is real and even, it satisfies\nx(t) = x*(-t) and, therefore, X(w) is real. Hence, X(w) = X*(-w)\n=\nX(-w). It follows that X(o) is real and even.\n(ii)\nIf x(t) is real, X(w) = X*(-w). Since x(t) is real and odd, x(t) =\n-x*(-t); an analysis similar to part (a)(ii) proves that X(w) must be\nimaginary. Hence, X(w) = X*(-\nw) = -X(-\nc). It follows that X(w) is also\nodd.\nS9.5\n(a) 5{e~\"\"'} = 5{e-\"'u(t) + e\"'u(-t)}\n_\na +jw\na-\njo\n2a\na2 + W2\n(b) Duality states that\ng(t)\n-G(w)\nG(t)\n-21rg(-w)\nSince\nea\n2a\ne\na 2 +\nW2,\n\nFourier Transform Properties / Solutions\nS9-5\nwe have\nc7\n1 + t2\ns\nx\n(C) 1 + (3t) 2\n-3-e\nsince x(at)\n-\n|al\nX\na\n\n(d) We are given Figure S9.5-1.\nx (t)\nA\nt\n-T\nT\nFigure S9.5-1\nrT\nA\nX(w) = A\ne--'' dt -\n. (e -jwT\n-\ne\n)wT\n-r\n-Jw\n- 2j sin coT\n=A\nw\nsin(wT)\n=2TA\nT\neT\nSketches of y(t), Y(w), andX(w) are given in Figure S9.5-2.\nX(<o)\n/\nN\n10---.--CO\nT\nT\ny(t)\n4TA\n2T\n22T\nFigure S9.5-2\n\nSignals and Systems\nS9-6\nSubstituting 2T for T in X(w), we have\nY(w) = 2(2T) sin(w2T)\nThe zero crossings are at\nw,2T = nr,\nor\nw = n\nS9.6\n(a) x(t) = -\nSubstituting t\nX(w)e- t dw\n= 0 in the preceding equation, we get\nx(0) = 1\n27r\n-- X( ) de\n(b) X(w) = f\nx(t)e -jwt dt\nSubstituting o = 0 in the preceding equation, we get\nX(0) =x(t)\ndt\nS9.7\n(a) We are given the differential equation\ndy(t) + 2y(t) = x(t)\ndt\nTaking the Fourier transform of eq. (S9.7-1), we have\njwY(w) + 2Y(w) = X(w)\nHence,\nY(w)[2 + jw] = X(w)\nand\nY(w)\n_\nH(w) =\n=\nX(W)\nH(w) =\n2 + jw\n4 + (,)2\n2 + jw'\n=\n1 c 2 - jo\n2+j 2-jo)\n-1 3\n+ x2 '\n2 -\njw\n4 + W2\n(S9.7-1)\n\nFourier Transform Properties / Solutions\nS9-7\nS2\n)\n4 +2\nIH(W)1 2 = (4 + c2)2 + (4 +\nW2)2\n(4 + W2)2>\nIH(w)I = \\4 + W\n(b) We are given x(t) = e~'u(t). Taking the Fourier transform, we obtain\nX(W)= 1+j.,\nHx)= 2 +jW\nHence,\n(\n1 1\n+ j)(2\n+ j)\n1 + jo\n2 + jo\n-(1\n(c) Taking the inverse transform of Y(w), we get\ny(t) = e-u(t) -\ne -2u(t)\n\nSignals and Systems\nS9-8\nS9.8\nA triangular signal can be represented as the convolution of two rectangular pulses,\nas indicated in Figure S9.8.\nSince each of the rectangular pulses on the right has a Fourier transform given\nby (2 sin w)/w, the convolution property tells us that the triangular function will\nhave a Fourier transform given by the square of (2 sin w)/w:\n4 sin\n2 w\nX(()) =\n(0).)2\nSolutions to\nOptional Problems\nS9.9\nWe can compute the function x(t) by taking the inverse Fourier transform of X(w)\nx(t) = 27r f-. ire'' dw\n(ei-\ne\nt~(j)\nsin oot\nt\nTherefore,\n[sin (wot) 1\ny(t) = cos (wet)\ns\nI\nI t\nI\n\nFourier Transform Properties / Solutions\nS9-9\nFrom the multiplicative property, we have\nY(w) = X(W) * [r(o -\nW) -\n7r(WO + (0,]\nY(o) is sketched in Figure S9.9.\nI\nT2C Iw\ncj\n-\nW()\nWc\nWc  W()ic\nC\nCj\nC0 u\ncj(  (W)\nFigure S9.9\nS9.10\n(a) x(t) = e -\ncos wotu(t),\na > 0\n= e -\"'u(t)cos(wot)\nTherefore,\nX(w) =\n. * [7r(w\n-\nwo) + 76(w + WO)]\n2r a + Jw\n1/2\n1/2\na + j(W -\nWO)\na + j(w + wo)\n(b)\nx(t) = e -31' sin 2t\ne- 3itiI\n9 + w2\nsin 2t\n- [6(-\nwo) -\n6(w + wo)],\nwo = 2\nTherefore,\nX(w)X()=1 (6\n.\n+ Wo)]\n=\n-\n2)*\n7-[S(o\n-\nwo) -\nb(W\n21r 9 + w2\nj3\nj3\n9 + (w + 2)2\n9 + (w -\n2)2\n(c) x(t) = sin wt (sin 2wt\nX(W) = -\nXI)\n* X2(W),\nwhere\nXi(w)XM=1,\nIwI < 7,\n=\n0,\notherwise\nIwI < 27,\n=\nl\nX2(W)\n10,\notherwise\n\nSignals and Systems\nS9-10\nHence, X(w) is given by the convolution shown in Figure S9.10.\nXI)\nX2 (W)\nT\n-w\n7T\n-\no---I\nX(W)\n-21T\n27T\n-3\n-2r\n-7\nF\nr\n2r\nFigure S9.10\nS9.11\nWe are given the LCCDE\ndy(t)\ndt +2ytt)\n=Acos oot\nWe can view the LCCDE as\ndy(t) + 2y(t) = x(t),\ndt\nthe transfer function of which is given by\nH(w) =\n.\nand\nx(t) = A cos oot\n2 + j\nWe have already seen that for LTI systems,\ny(t) = |H(wo)I A cos(oot + 4),\nwhere # = <H(wo)\n= \\4\n-+wA cos(wot + $)\n\nFourier Transform Properties / Solutions\nS9-11\nFor the maximum value of y(t) to be A/3, we require\n_1\n0+w\nTherefore, wo = \nS9.12\n(a d2y(t)\n2dy(t) +\n3y(t)\n= -w 2Y(W) + 2jwY(w) + 3Y(w)\n(a) 51\ndt2\n+\ndt\n=\n(-W2\n+ j2w + 3)Y(o),\nA(w) = -o 2 +j2w + 3\n(4dx(t)\n(b)~ 3dt\nx(t) I = 4jwX(w) -\nX(w)\n= (j4w -\n1)X(w),\nB(o) = j4w -\n1,\nA(w)Y(w) = B(w)X(o),\nB(o)\nY(W)\n= A(w) X(x)\n= H(o)X(w)\nTherefore,\n- B(w)\n-1\n+ j4w\nH(o)\nA(w)\n-W 2 + 3 +j2w\n1 - j4w\n2 _ 3 -j2w\nS9.13\nsin W t\n-W\nW\nFigure S9.13-1\nX(w)\nsin\n0 t\nit\n-W0\nFigure S9.13-2\n\nSignals and Systems\nS9-12\nH(w)\nsin (2o 0t)\nh(t)=i\nr\nt\n-2w0\nFigure S9.13-3\n2w0\nY(w) = X(W)H(w) =\nY(w)\n7r\n-wo\n-o0\nFigure S9.13-4\nww\n\"0\nTherefore, y(t) = sin(ot)\nt\nS9.14\n(a) Energy = -\n27r\n|X(W)|2 dw\n-o\nArea = (4)(2) + (2)(1)(1)\n= 10\nEnergy = -\nTr\n\nFourier Transform Properties / Solutions\nS9-13\n(b)\n-1\n-2\nFigure S9.14-2\nsin t\nsin 2t\nirt\nrt\nS9.15\nGiven that\nyi(t) = 2rX(-w)|,\nwe have\nyi(t) = 2 1\nx(u)ejtu du\nSimilarly, let y2(t) be the output due to passing x(t) through F twice.\nY2)\n= 21-0\n21f\nx(u)evu du eitv dv\n= (21r)2 fw -Gx(u)fv\neft+u)vdv du\n= (2_)2 f\n-0 x(u)(27r)b(t + u) du\n= (21)' X(-t )\nFinally, let y(t) be the output due to passing x(t) through F three times.\nyAt\n= w(t) = 271-\n(2 7r)x(-u)ej'\"du\n= (21r)'f\ne -'u x(u) du\n= (2.)'X(t)\nS9.16\nWe are given\nx(t) =\nn-\ne -'u(t),\na > 0\n(n -\n1)!\n\nSignals and Systems\nS9-14\nLet n = 1:\nx(t) = e~\"'u(t),\na > 0,\nX(w) = a + jw\n.\nLet n = 2:\nx(t) = te~\"u(t),\nX(w) = j -\n.\nsince\ntx(t)\nd-\nj-X(w)\ndwa +jw\ndw\n__\n(a + jw)2\nAssume it is true for n:\n1-atu(t),\nx(t)\n= (n -\n1)!\ne~\"'\nX(w) = (a + jw)\"\nWe consider the case for n + 1:\nx(t) =\n- e- at)\nn!\nj d\nX(w) =\nd\n(a +jw)\nn\n_j\nddo [(a + j,)\"n\nn dw\n= (-n)(a + jo)-\"-Ij\nn\n(a + jo)\"+I\nTherefore, it is true for all n.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nResource: Signals and Systems\nProfessor Alan V. Oppenheim\nThe following may not correspond to a particular course on MIT OpenCourseWare, but has been\nprovided by the author as an individual learning resource.\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Problem Set 10 Solutions",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/res-6-007-signals-and-systems-spring-2011/2d02f68732ba1bbc5636f6b0e592bb1e_MITRES_6_007S11_hw10_sol.pdf",
      "content": "10 Discrete-Time Fourier Series\nSolutions to\nRecommended Problems\nS10.1\nThe output of a discrete-time linear, time-invariant system is given by\ny[n] =\nj\nh[kjx[n -\nk],\nk=\nwhere h[n] is the impulse response and x[n] is the input. By substitution, we have\nthe following.\n(a) y[n] =\n)k\nk=0\nejwn\n1 -\ni-\nk\nk)4\n]\n(b) y[n] =\n(1ke j,(n-\nej Cr 4\nk=0\nk=0\n1 - fjir/4)\n(c) y[n]\ne\n8) i(n -)/4)\n+ 1e\n''r8e - '''\"- k)/41\nwhere we have used\n=\n()k[\n2e\n-\nEuler's relation\ne (/8) e(rn/4)\n[e 3 (w/4 )1 k +21-e -j(/ 8)e -j(rn/4)\ne 2\n]\nk=0\nk=0\nIej[(1/ 8)+(in/4)]\nS -j[(/8)+(rn/4)]\n2e\n\n-j(r/4)\n+\n(,r/4)\nCos (\nn +\n-) 2Cos (4n\n-o-\nO s \"4\nS1O.2\n(a) 1 1[n] = 1 + sin( 10f)\nTo find the period of t 1[n], we set 21[n] = 1 1[n + N] and determine N. Thus\n27r\n1 + sin 21rn\n1 + sin [1 0 (\nN\n= 1 + sin\nn +\nN)\nSince\n2s\n27n\nsin (0n\n+ 2r) =sin 10n\nS10-1\n\nSignals and Systems\nS10-2\nthe period of t1n] is 10. Similarly, setting t 2[n] = t 2[n + N], we have\nns\n20ir (i\n1+ sin (212 n +-2\n= 1+ sin\n2(n +N)\n+-2\n7+\n20-)\n-1+\nsin 20-x n + - +\n-N\n(12\nHence, for -irN to be an integer multiple of 21r, N must be 6.\nu rn\n(b) 21[n] = 1 + sin (21\nUsing Euler's relation, we have\nx 1 [n] = 1 +\ne27non _\ne J(2r/10)n\n(S10.2-1)\n2j\n2j\nNote that the Fourier synthesis equation is given by\n21l[n] =. T\nakejk(2x/N)n\nk= (N)\nwhere N = 10. Hence, by inspection of eq. (S10.2-1), we see that\n-1\nao =\n2j\nall =\nand\n2j\nalk = 0,\n2 s k - 8,\n-8 : k -\n-2\nSimilarly,\nt2[n] = 1 +\n1 e -j(-/2>e-j(20Y/12>\n2j\nTherefore, N = 12.\na 2 0\n1,\na 2 -1\ne -fir/2)\na 2 1\n-\n-\near/2> =\n-, 1\nand\n=\n2j\n2'\na2  2, . . . , a2=\n(c) The sequence alk is periodic with period 10 and a 2k is periodic with period 12.\nS10.3\nThe Fourier series coefficients can be expressed as the samples of the envelope\nsin[(2Ni + 1)9/2]\nak\n-\nwhere N, = 1 (see Example 5.3 on\nN\nsin (9/2)\n0=2wk/N\npage 302 of the text)\nsin (39/2)\nN\nsin (0/2)\n0=2irk/N\n(a) For N = 6,\nsin 3(2k)]\nsin (2)\n1 sin [26/) 1\nak =- 6\nsin\n1 2r\nsini (k\n-- )\n\nDiscrete-Time Fourier Series / Solutions\nS10-3\n(b) For N = 12,\n.i [3 (27rk{\n1 sin\n/\nak =\n-\n___________\n[112\n(c) For N = 60,\n.i [\n(27rk\nsin\n. -grk\n2n 60)]\ns 20)\nk\n[1 (2ck\nsin\nsin\nS10.4\n(a) The discrete-time Fourier transform of the given sequence is\nX(Q) = (\nx[n]e -'\"\"\nn= -o\n= leit + 1 + ie\n= 1 + cos Q\nX(Q) is sketched in Figure S10.4.\nX(E2)\nIT\nIT\nFigure S10.4\n(b) The first sequence can be thought of as\n9,[n] = x[n] * T,\n6[n -\n3k]I\nLk =0-Go\nHence\n0\"\n2,rk\nYI(Q) = X(Q)\n- 3 ,\nTherefore, the Fourier series of y 1[n] is given by\n(2\nk\n1(\n2 k\\\nak=--Y1--3 kJ=-1+cos\n,\nfor all k\n\nSignals and Systems\nS1O-4\nThe second sequence is given by\ny 2[n] = x[n]*\n[n -\n5k]\nSimilarly, the Fourier series of this sequence is given by\nak = 5 - 1 1 + cos (5\n,\nfor all k\nThis result can also be obtained by using the fact that the Fourier series coeffi\ncients are proportional to equally spaced samples of the discrete-time Fourier\ntransform of one period (see Section 5.4.1 of the text, page 314).\nS10.5\n(a) The given relation\nx[n] =\nake k(2r'')\"\nk=o\nresults in the following set of equations\nao + ai + a2 + a3 = x[O] = 1,\nao + aie^,fir/2> + a2e'\" + aej(3 /2) = x[1] = 0,\nao + alei\" + a2e 2 ' + a3e3v = x[2] = 2,\nao + aie(3 /2) + a2e3'\n+ asej(9/2) = x[3] = - 1\nThe preceding set of linear equations can be reduced to the form\nao + a1 + a 2 + a3 = 1,\nao + jai -\na 2 -ja 3\n= 0,\nao -\na1 + a 2 - a 3 = 2,\nao - jai -\na 2 + ja 3 = -1\nSolving the resulting equations, we get\nao = 1 ,\na-\n__1+j\n,\na2 = +1,\na=\n-\n1-j4\n(S10.5-1)\nBy the discrete-time Fourier series analysis equation, we obtain\nak =\n1 + 2e -ik\n-\ne -j(3rk/2)j,\nwhich is the same as eq. (S10.5-1) for 0\nk - 3.\nS10.6\n(a) ak = ak+10 for all k is true since t[n] is periodic with period 10.\n(b) ak = a_, for all k is false since I[n] is not even.\n(c) akeik(21/) is real. This statement is true because it would correspond to the Four\nier series of t[n + 2], which is a purely real and even sequence.\n(d) ao = 0 is true since the sum of the values of I[n] over one period is zero.\n\nDiscrete-Time Fourier Series / Solutions\nS10-5\nSolutions to\nOptional Problems\nS10.7\nThe Fourier series coefficients of x[n], which is periodic with period N, are given by\n=\nNI\n-jk(2w/N)n\nak\n- T x[n]e j(wNf\nn=O\nForN = 8,\nak = E x[n]e-k(/ 4 )n\n(S10.7-1)\n8n=0\n(a) We are given that\nak = cos (-)+ sin 3k,\n(4\n(S10.7-2)\nak = .1ej(wk/4) + -e -j(ik/4) + 1 e-t3rk/4)\n_\n- e -(3rk/4)\n2j\n2j\nHence, by comparing eqs. (S10.7-1) and (S10.7-2) we can immediately write\nx[n] = 46[n -\n1] + 46[n -\n7] - 4jb[n -\n3 ] + 4jb[n -\n51,\nn !5 7\n(b) x[n]\nk(2r/8)\nk jk(/4)n\nk=O\nk=O\nei(kr/3)\n-\n1e-j(kr/3)]\njk(/4)n\nk=O\nII\nk=O\n1 [e(\n1 1\n[(7n/4)--(7r/3)\n7wn/ 4)+(7r/3)\n2j 1 -\n4)+(-/ 3)]\nj[(rn/4)-(/3)\n[eJ(rn/\nS[(7n/4)+(7r/3)]\n{ (7-n/ 4)-(7-/3)j\ne[(rn/4)+(v/ 3)\nj[(n/4)-(r/3)j\n2j\ne\nSx[n]\nk jk(2/8)\nakjk(w/4)n\nk=O\nk=O\n1 + ej(/ 4)n + ej(3-/ 4)n + ejrn + ej(51/ 4 )n + ej(7r/ 4)n\n=1++ (-)\n+2cos (n\n+ 2 cos\nn\nn\n(d) Using an analysis similar to that in part (c), we find\nx[n] = 2 + 2 cos4 n+\nco\n+\nCos\nn,\nS10.8\nThe impulse response of the LTI system is\nh[n] = (i)'\"\n\nSignals and Systems\nS10-6\nThe discrete-time Fourier transform of h[n] is\n~\"\nH(Q) =\n(-\ne -j\"\" +\n(\n~) -- 1\nn=O\nn=-o\n1+\n1 -i\n-1\ne~\"\n5 - 4 cos 0\n(a) (i)\nx[n]\nsin\nn\n-e3r!4)n\n=\n3r= 1j\n1 e -j(3,/4)n\n-\n2j\n2j\nThe period of x[n] is\nsin ( n) = sin\n- (n + N)\nThus\ni 3\n3)\nsi 4r\nsin\n(43r n + -rN)\nWe set 37rN/4 = 21rm to get N = 8 (m = 3). Hence, the period is 8.\nx[n]\nT akejk(2w/8)n\nk=O\nTherefore,\na3 =\n=- a5\nAll other coefficients a, are zero. By the convolution property, the Fourier\nseries representation of y[n] is given by bk, where\nbk = aJH(C\nT\ns0=(2k)/8\nThus\nb 2j 5 -\n4 cos(3r/4)\n=b*\nAll other bk are zero in the range 0\nk -\n7.\n(ii)\nI[n] =\n6[n -\n4k]\nk= -o\nThe Fourier series of t[n] is\nak =\nt4n~e -jk<2/4>\n= 1,\nf r all k\nn=O\nAnd the Fourier series of D[n] is\nbk\nakH(Q)I\n=\n-=-\nfor all k\n4 5 -\n4 cos[(2r/2)k]\n\nDiscrete-Time Fourier Series / Solutions\nS10-7\n(iii)\nThe Fourier series of f[n] is\nak =\n1 + 2 cos (k),\n0 s k - 5\nand the Fourier series of 9[n] is\nbk = akH(Q)\n+ 2cos Irk\n(3)5 -\n4 cos[(7r/3)k]\n(iv) x[n] = j\" + (-1)\"\nThe period of k[n] is 4. x[n] can be rewritten as\nx[n] = [ej(r/2)n + (e'\")\"\nT\nk jk(2/4)n\nk=O\nHence,\nao = 0,\nai = 1,\na2 = 1,\na3 = 0\nTherefore, bo = b = 0 and\nbi\n5 -\n4 cos(7r/2)\nE\n=\nb 2\n5 - 4 cos r\n(b) h[n] is sketched in Figure S10.8.\nh [n ]\n-2 -1 0 1 2\nFigure S10.8\nH(Q) =\nE\nh[n]e-\"a\"\n-_,;2\n-\ne'o + 1 + e-~\"\n+ e-j2Q\nn = -00\nH(Q) = 1 -\n2j sin 0 -\n2j sin 20\nIt follows from part (a):\n3-7r\nb3 = --j H(Q)\n-\nsin -\n-sin\n--2 = b*\n=31r/4\n2j\nAll other coefficients bk are zero, in the range 0\nk 5 7.\n\nSignals and Systems\nS10-8\n(ii)\nbk = H)\n1 j.\nrk-j\nsin-\n-\n4 2\nsin\nk =- 1\nj .7rk\n-\n-sin\n(iii)\n(iv)\nbk\nb0\nb1\n=\n=\n=\n-\n0,\nH(Q)\n+ 2 cos (\n=1\nk\nH(Q)\n- 2j,\nf=rk/3\nb 2\nb=\n= H(Q)\n=1,\nS10.9\nx[n]\nak\n(a)\n(b)\n(c)\nk\njk(2w/N)n0\nx[n\n-no]\n-E2= ake-j(/Nn\nx[n] -\nx[n -\nak[l -\ne -j(2rk/N)\nN\n-jr\nx[n] -\nx [n\n. ak(l - ei-*),\nN even\n0,\nk even,\n2ak,\nk odd\n(d) x[n] + x n + -],\n=\nperiod N\n(\n2 (NI\nx[nI +\nNn=O\n2 a2k\nx\nn + -\ne -jk(4/N)n\na* =\n)\nL =*[-\nNn=O\n1 N-i1\nN\ne -jk( 2 /N)n\njk( 2 /N)n\n1-N+1\n=- ~Lx[n]e -jk(2/N)n\nak\nTherefore, ak = atk.\nS10.10\n(a)\ni'i[n] = I[n] + 9[n],\ni[n + NM]= .[n + NM] + P[n + NM]\n= t[n] + 9[n]\n= f>[n]\nHence, ?ID[n] is periodic with period NM.\n\nDiscrete-Time Fourier Series / Solutions\nS10-9\nNM-I\nNM-1\n(b)\nCk =\nZ\nn\njk(2W/NM)n\nE\n[N[n] + P[n]]e jk(2T/NM)n\nNMn=0\n=\nNM-1\nNM=1\nN\njk(2/NM)n\n=\nZ\n[nje -jk(2/NM)n +\nn=0\nn=0\nNMn4N\n>3 :P4nje-j(/N\nN-1\nM-1\nM-1\nN-1\nNM\n[n] E e -jk(2./NM)(n+LN)\n+ N\nik(2/NM)(n+IM)\nn\n1=0\nNMnO\n1=0\n'1\nN akIM + 1bk/N,\nfor k a multiple of M and N,\nakIM,\nfor k a multiple of M,\n1 bk/N,\nfor k a multiple of N,\n0,\notherwise\nS10.11\n(a) t[n] = sin [(4\nTo find the period, we set g[n] = T[n + N]. Thus,\nsin [(n - 1)]\ni(n\n+ N - 1)\nsin [(n - 1)+\nN\nLet (7rN)/4 = 21i, when i is an integer. Then N = 8 and\n1[n]\n1 e~ir(n-\n1 )/\n41 -\n1 e -il(n\n-- 1)/41\n2j\n2j\n1 e j(w/4) j(rn/4)\nj(/4)\n-j(,rn/4)\n2j\n2j\nTherefore,\ne -j(i/4)\n2j\n2j\nAll other coefficients ak are zero, in the range 0 : k -\n7. The magnitude and\nphase of ak are plotted in Figure S10.11-1.\nlak I\n4ak\n2 3 4 5 6\nI\nk\n- 31r1\nFigure S10.11-1\n\nSignals and Systems\nS10-10\n(b) The period N = 21 and the Fourier series coefficients are\n=\n=\n=\n=\n\na 7\na14\na3\na, 8\n2j\nThe rest of the coefficients ak are zero. The magnitude and phase of ak are given\nin Figure S10.11-2.\n|ak\nk\n19 20\n4ak\n-k\nFigure S10.11-2\n(c) The period N = 8.\na 3 = a* = e -j(-/3)\nThe rest of the coefficients ak are zero. The magnitude and phase of ak are given\nin Figure S10.11-3.\nakk\n0 1 2345 6 7\n4ak\nk\nFr\nFigure S10.11-3\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nResource: Signals and Systems\nProfessor Alan V. Oppenheim\nThe following may not correspond to a particular course on MIT OpenCourseWare, but has been\nprovided by the author as an individual learning resource.\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}