{
  "course_name": "Single-Molecule Imaging: Capturing Nanoscale Cellular Machines in Action",
  "course_description": "Did you know that we have approximately 2 meters of DNA packed in our cells, which are less than 10 μm diameter? Or that to replicate DNA it is copied at a rate of 70,000 basepairs per second by a cellular apparatus that coordinates at least six different enzymes? Or that microtubules form greater than 1 meter long “railways” upon which molecular machines transport cargo within nerve cells? In this course, we will explore how single-molecule imaging techniques capture the mega-cellular machines working in real-time.\nThis course is one of many Advanced Undergraduate Seminars offered by the Biology Department at MIT. These seminars are tailored for students with an interest in using primary research literature to discuss and learn about current biological research in a highly interactive setting. Many instructors of the Advanced Undergraduate Seminars are postdoctoral scientists with a strong interest in teaching.",
  "topics": [
    "Science",
    "Biology",
    "Biochemistry",
    "Cell Biology",
    "Molecular Biology",
    "Science",
    "Biology",
    "Biochemistry",
    "Cell Biology",
    "Molecular Biology"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 2 hours / session\n\nPrerequisites\n\nA general knowledge of molecular biology, biochemistry or biophysics will be helpful. MIT students should consult the instructor on the first day of class if unsure about their background.\n\nCourse Description\n\nDid you know that we have approximately 2 meters of DNA packed in our cells, which are less than 10 μm diameter? Or that to replicate DNA it is copied at a rate of 70,000 basepairs per second by a cellular apparatus that coordinates at least six different enzymes? Or that microtubules form greater than 1 meter long \"railways\" upon which molecular machines transport cargo within nerve cells? In this course, we will explore how single-molecule imaging techniques capture the mega-cellular machines working in real-time.\n\nInside the cell, thousands of events are happening via dynamic interactions among single molecules, traveling through different compartments, and creating higher-order macromolecular behaviors. The organization and dynamics of these macromolecule structures -such as the replisome complex that mediates DNA replication; the RNA polymerase complex (RNAP) for transcription elongation; or the dynein complex that \"walks\" on microtubules and carries essential signals and organelles - are often regulated through complex rules involving short-lived, weak, and highly dynamic interactions. Although biochemical assays have provided remarkable insight into the various activities of individual proteins and their collective action in these processes, monitoring the kinetics of individual steps is challenging, if not impossible using such assays. This limitation is primarily because biochemical assays of complex multicomponent events are intrinsically asynchronous, and these short-lived and dynamic interactions in complex multicomponent events are usually concealed when averaged over the ensemble.\n\nIn 1873, Ernst Abbe determined that the maximum resolution of a traditional optical microscopy cannot get better than 0.2 micrometer (200 nanometer). In 2014 Eric Betzig, Stefan W. Hell, and William E. Moerner were awarded with Nobel Prize in Chemistry for having bypassed this optical limit by developing super-resolution microscopy (also referred as single-molecule microscopy). In 2018, Arthur Ashkin was awarded the Nobel Prize in Physics for the invention of optical tweezers (also known as optical traps) which allowed him to grab living cells without harming them. The development of single-molecule experiments has allowed scientists to study the detailed dynamics of individual biochemical events. Using precision nanotechnology techniques such as fluorescence microscopy, single-molecule FRET, magnetic tweezers, optical traps, super resolution microscopy - all of which work at the level of single molecules - scientists can now monitor the individual movements of proteins, and their one-on-one interactions with each other as they function. For example, we can see how fast and for how long each step of the process takes, monitor interactions of each protein (or even protein subunits!), reveal important differences between individual cellular machines, and determine how these machines deal with barriers on their path. Additionally, by combining approaches from physics, engineering, chemistry and biology, single-molecule tools possess an incredible power to discover the principles underlying intracellular order and mechanics, revealing new information about the fundamental physical and biochemical properties of living cells.\n\nFormat\n\nThe class will be held weekly for two hours. Each week before the class, students will read two papers from the primary research literature and submit 2-3 questions online to the instructor. Students should analyze each article and think about their responses (additional questions or comments, etc.) before class begins. These responses will be addressed in the class discussion. Through a small group discussion, students will critically evaluate these papers focusing on experimental design, control experiments, methods, and interpretation of the data. This will be achieved by asking questions such as:\n\nWhat are the key experiments of the paper?\n\nIs there anything that you could not understand (methodology, etc.)?\n\nAre there any questionable figures or data?\n\nAre the data presented sufficiently convincing to support the conclusion? If not, what other experiments would be needed to support the conclusion?\n\nIs the interpretation of the data clear and rational?\n\nThe final 10 minutes will be dedicated to next week's topic. The instructor will introduce the problem and methods to be addressed by next class' papers and offer some background about the state of the field at the time the paper was published.\n\nObjectives\n\nThis course will introduce students how to read, discuss, and critically evaluate scientific findings in the primary research literature. We aim to achieve this by focusing on how cutting-edge single-molecule technologies are being used to reveal intrinsic details of fundamental cellular processes (primarily focusing on DNA replication, transcription, and cytoskeletal elements of cells); advances and limitations of single-molecule techniques; and how to identify, discuss, and propose experiments to address open questions in the field.\n\nGrading\n\nThe course will be graded as \"pass \"or \"fail.\" A passing grade will be given to those who attend the class, participate actively in discussions, submit questions and complete both assignments.\n\nCalendar\n\nWeek #\n\nTopics\n\nKey Dates\n\nIntroduction to Single Molecule Imaging Techniques\n\nSingle Optical Traps\n\nMagnetic tweezers\n\nDouble optical traps\n\nTotal Internal Reflection Fluorescence Microscopy (TIRFM)\n\nSingle-Molecule FRET (smFRET)\n\nDNA Curtains and Extensions by Flow\n\nFleezers: Combining Fluorescence with Optical Tweezers\n\nMidterm Written Assignment due\n\nFleezers 2.0-Dual Traps Combined with Confocal Microscopy\n\nOptical Traps Meet both Confocal and FRET\n\nStochastic Optical Reconstruction Microscopy (STORM)\n\nPhotoactivation Localization Microscopy (PALM) and Stimulated Emission/Depletion (STED)\n\nStructured Illumination Microscopy (SIM) and Single-Molecule Localization Microscopy (SMLM)\n\nOral Presentations and final discussions\n\nFinal Oral Assignment due",
  "files": []
}