{
  "course_name": "Slavery and Human Trafficking in the 21st Century",
  "course_description": "This course explores the issue of human trafficking for forced labour and sexual slavery, focusing on its representation in recent scholarly accounts and advocacy as well as in other media. Ethnographic and fictional readings along with media analysis help to develop a contextualized and comparative understanding of the phenomena in both past and present contexts. It examines the wide range of factors and agents that enable these practices, such as technology, cultural practices, social and economic conditions, and the role of governments and international organizations. The course also discusses the analytical, moral and methodological questions of researching, writing, and representing trafficking and slavery.",
  "topics": [
    "Social Science",
    "Anthropology",
    "Ethnography",
    "Social Anthropology",
    "Economics",
    "Labor Economics",
    "Political Science",
    "International Relations",
    "Sociology",
    "Social Justice",
    "Society",
    "Gender Studies",
    "Global Poverty",
    "Social Science",
    "Anthropology",
    "Ethnography",
    "Social Anthropology",
    "Economics",
    "Labor Economics",
    "Political Science",
    "International Relations",
    "Sociology",
    "Social Justice",
    "Society",
    "Gender Studies",
    "Global Poverty"
  ],
  "syllabus_content": "Course Meeting Times\n\nSeminars: 2 sessions / week, 1.5 hours / session\n\nPrerequisites\n\nThere are no prerequisites for this course.\n\nCourse Description\n\nBefore the World Cup held in Brazil in Summer 2014, many fans saw billboard posters and social media ads featuring the silhouette of a naked woman standing on a playing field, her feet clad in red high heels with chains shackled to her ankles. The ad was promoted by an anti-trafficking organization claiming sporting events like the World Cup become periodic \"hot spots\" for sex trafficking and exploitation, as millions of fans, athletes, and affiliated sponsors flock to major cities. However, the ad was met with protest from a number of organizations, especially sex workers' rights organizations, that such publicity merely increased policing and police brutality around the event, and no increase in trafficking was actually reported. They claimed that the overwhelming focus on sex trafficking detracted from deeper and more systemic exploitation issues: What about the Brazilians under debt bondage and exploitative labor to construct the World Cup sites? The children and adults who are exploited in the forced begging industry as tourists streamed into Brazilian cities? The hopeful young athletes who might themselves be locked into smuggling and extortive schemes?\n\nIn this class we will use \"slavery and human trafficking\" as starting points to help us critically analyze the relationships between sex, gender, and human rights; race, colonialism, and political economy (thinking about the Atlantic slave trade, the Gulf kafala system, and South Asian caste structures); capitalism and labor exploitation (especially in the food and agriculture industry); public health and bodily violence (focusing on organ transplants and commercial surrogacy); and new technologies used by police and workers alike. Our case examples will include issues that receive high media publicity--forced sex work, child labor in construction and clothing, and the illicit trade in organs--but also pay attention to \"less sexy\" forms of trafficking and exploitation. These include exploitation and sexual violence in strawberry fields and American beef farms, debt bondage in Thai shrimp processing plants, abuses of Bangladeshi construction workers and Filipina domestic workers in the Gulf region, smuggling and exploitation after major natural disasters and post-war conflicts, and the exploitation of Dominican baseball players and Siberian fashion models alike.\n\nWe will discuss the intimate entanglements of gender, sexuality, race, and class and remain attuned to these entanglements as we read, listen, view, and engage with the texts, both literary and visual, in this class. Students will have the opportunity for impact outside the classroom through small group meetings and action project opportunities with a United Nations agency and an international non-governmental organization.\n\nLearning Goals and Class Groups\n\nThis course requires students to keep an open mind. For each week I have assigned readings that will give you case studies on the class theme and theoretical framing to stimulate critical thinking. I will assign videos, music, poetry, and other multimedia pieces to engage with the topic. By the end of this course students will have an introduction to thinking critically about the relationships between knowledge production; identity politics; community engagement and cultural specificity; governance, policing, and bureaucracy; technoscience and the politics of aid and development; and systems of capitalism and political economy.\n\nWe will be dealing with some difficult texts--texts that are visual, tactile, and may be emotionally triggering, that deal with sexual and emotional violence, child abuse, and war and mass violence. Please talk to me at any point as we work through the topics this semester. Building a community with your classmates will also be integral. To this end, students will form small groups for the semester, culminating in a final presentation at the end of the semester.\n\nSmall groups will meet every other week and discuss the readings, and / or view the film assigned for that week. The small group will agree by consensus on a regular, convenient time and location to meet, to be reported to the instructor. In your group you will discuss the guiding questions for the week and / or watch film clips as assigned. You may skip a maximum of 2 small group meetings during the semester, for academic or personal reasons.\n\nAction Project Opportunities\n\nThis is such a live, timely, and rich issue. \"Trafficking\" illuminates the interconnectedness of multiple systems of inequality and injustice-I want you to consider the ways in which your particular skills and ideas could be useful outside of the classroom. To this end, I have set up external partnerships with two different agencies working on anti-trafficking issues. Two of the small groups will have the opportunity to frame their final project around these partnerships.\n\nUN Action for Cooperation Against Trafficking in Persons\n(\nUN-ACT\n)\n\nOne group will do their project in coordination with the UN-ACT Project, based at the UN in Bangkok. This group will focus on labor, agriculture / fishing, migration, and Southeast Asia: Further details to be discussed with UN-ACT.\n\nEnd Child Prostitution And Trafficking\n(\nECPAT International\n)\n\nAnother group will have the opportunity to do their project with ECPAT's Programme on Sexual Exploitation of Children Online (SECO). This group will focus on commercial sexual exploitation of children, child abuse images (\"child pornography\"), and sexual abuse online.\n\nGrading and Requirements\n\nACTIVITIES\n\nPERCENTAGES\n\nAttendance, Preparation, and Participation\n\n20%\n\nWeekly Response Memos\n\n20%\n\nSmall Group Meetings\n\n10%\n\nSmall Group Final Presentation\n\n10%\n\nTerm Paper Outline & Bibliography\n\n20%\n\nTerm Paper (Revised Draft)\n\n20%\n\nFor more detail on the weekly response memos, the small group final presentations, and the term paper, see the\nAssignments\nsection.\n\nReadings and Films\n\nAll required reading and viewing materials can be found in the\nReadings and Films\nsection. I have included recommended reading for students who are interested in pursuing the topic further; these resources might come in handy as you develop your term paper.\n\nFor some texts we will be reading various chapters throughout the semester; students who are interested may wish to purchase these books for personal use (not required):\n\nKempadoo, Kamala, Jyoti Sanghera, and Bandana Pattanik, eds.\nTrafficking and Prostitution Reconsidered: New Perspectives on Migration, Sex Work, and Human Rights\n. 2nd ed. Paradigm Publishers, 2011. ISBN: 9781594519895.\n\nMahdavi, Pardis.\nGridlock: Labor, Migration, and Human Trafficking in Dubai\n. Stanford University Press, 2011. ISBN: 9780804772204. [Preview with\nGoogle Books\n]\n\nGrant, Melissa Gira.\nPlaying the Whore: The Work of Sex Work\n. Verso, 2014. ISBN: 9781781683231.\n\nResources\n\nThe Writing and Communication Center at MIT\noffers free 1-on-1 professional advice from lecturers about all types of academic, creative, and professional writing and about all aspects of oral presentations. We help you think your way more deeply into your topic, no matter what department or discipline you are in.",
  "files": [
    {
      "category": "Resource",
      "title": "21A.445JS15 Slavery & Human Trafficking - Final Paper, Religious Education",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-445j-slavery-and-human-trafficking-in-the-21st-century-spring-2015/30894d9c1fed521199415270ed2f0586_MIT21A_445JS15_Religious.pdf",
      "content": "Religious Education in Pakistan's Madrassas & the Facilitation of Child Trafficking: A\nFlaw in Western Perceptions\n\nBy Zehra Naviwala\n\nNaviwala 2\nIntroduction\nFrom the late 70s to 80s, a critical phenomenon was triggered by the military ruler,\nGeneral Zia-ul-Haq, in his objective to achieve the Islamization of Pakistan: religious education\nbecame the prime source of education in Pakistan. It was integrated into the armed forces;\ngraduates of seminaries, or the madrassa, were granted diplomas that held the same value as\nuniversity degrees; and the civil service was opened up to those with a strictly religious\neducational background (Dilip 2012). The number of opening madrassas--which varied among\nreligious sects--shot up as General Haq provided state funding and free land (Dilip 2012: 162-\n63). These were madrassas registered as charitable organizations--thus exempt from all taxes--\nand they were staffed by well-qualified and passionate clerics (Dilip 2012). As funding boosted\nthe growth of madrassas all over Pakistan, with its impassioned sect leaders, the numbers leapt\nfrom 181 madrassas in 1947, to 2,801 after General Haq's 11 years of Islamic rule (Dilip 2012).\nAccording to Dilip Hiro, author of Apocalyptic Realm: Jihadists in South Asia, enrollment in\nmadrassas increased due to the deteriorating state school system and Pakistan's stagnant\neconomy (Dilip 2012). The madrassas were concentrated mostly in Punjab, Khyber\nPakhtunkhwa, and the metropolis of Karachi--today, all locations stocked with non-state\nmilitant group members (Dilip 2012).\nAs the number of madrassas continues to rise in Pakistan, in more recent years,\nparticularly since 9/11, a widely accepted controversy linked to the Pakistani madrassa has begun\nto develop within the world's Western hegemon--the United States. The Western\nconceptualization of ideas such as freedom, liberalization, and humanitarianism is manifested in\nthe United States' pride in being a democracy where church and state are independent entities--a\npurely religious education cannot go hand-in-hand with liberal thought. The U.S.' main concern\n\nNaviwala 3\nregarding freedom has to do with their belief that freedom is violated without religious tolerance.\nAlthough Pakistan's political leadership is structured secularly, it is an Islamic republic that still\nincludes elements of sharia, or Islamic law, in its penal code, with Sharia courts still taking\ncharge of criminal cases.\nYet, just because church and state have converged in Pakistan, freedom is not necessarily\nat stake, and religious intolerance is not omnipresent--something Western thought might\nchallenge in the context of madrassas. The United States' views on child agency, choice, and\ninformed consent within the context of child trafficking has conjured up its \"rescue culture\"\nalongside the rise of soft imperialism, ever since the United States began its hunt for non-state\nmilitant groups engaging in acts of terror in Pakistan. To the West, in a place where religion\ncould be a possible tool of carrying out child trafficking--in the madrassa--that is where the\nmilitants lie.\nThis paper will argue that although the U.S. is not wrong in being concerned about\nrecruitment in madrassas, there isn't a direct correlation between the madrassa as an institution\nand militancy, although militants do take advantage of some madrassas, which will be discussed\nin a later section. As an American-Pakistani, I made the error of making an uninformed, quick\nleap of logic and assuming that there is a linear connection between madrassas and militancy in\nPakistan, and therefore \"child trafficking\" as defined by the Trafficking Victims Protection Act\n(TVPA) in the United States, must be rampant within madrassas--militant magnets. While many\npolitical fronts in Pakistan that are allies of larger networks, such as the Taliban and Al-Qaeda,\ndo employ ideological indoctrination through misconstrued teachings of jihadism in madrassas to\nradicalize children, and then proceed to recruitment or child trafficking, this is not the case with\nall madrassas, and there is not always a linear correlation between the two. That is, as the number\n\nNaviwala 4\nof students attending madrassas increases, militancy does not increase with it (Bergen and\nPandey 2006: 118). In fact, among the well-known Islamic militants who have contributed to\ncarrying out attacks, only 11% attended madrassas, and the majority attended universities\n(Bergen and Pandey 2006: 118). Instead, a crucial question must be posed by not only myself,\nbut academic scholars and politicians in the United States to challenge their perception: Is the\nmadrassa an institution that fosters the teachings of Islamic radicalism to young minds through\nindoctrination, recruitment and coercion, or can it serve as a reasonable alternative to the lack of\neducation provided by the Pakistani government? This question will be answered through the\nfollowing structure:\n1. The definition of child trafficking and policies in both the West and Pakistan\n2. The non-state militant groups currently active in Pakistan\n3. An analysis of the madrassa as an institution\n4. The West's imperialist propensity to link all religious education through the\nmadrassa in Pakistan to terrorist recruitment\n5. The region of southern Punjab as an outlier for madrassas\n6. Cases that constitute child trafficking\n7. Rehabilitation for child victims\n\nTrafficking Policies in the US & Pakistan\nThe United States and Pakistan are both signatories of the United Nations Office on\nDrugs and Crime's (UNODC) Article 3 of the \"Protocol to Prevent, Suppress and Punish\nTrafficking in persons, especially Women and Children.\" It defines child trafficking as the\nfollowing:\n1. \"The recruitment, transportation, transfer, harbouring or receipt of a child for the purpose\nof exploitation shall be considered \"trafficking in persons.\"\n2. \"Child\" shall mean any person under eighteen years of age (UNODC 2005: 42-43).\n'Debt bondage' and 'involuntary servitude' are terms defined in the United States' Trafficking\nVictims' Protection Act of 2000 (TVPA), and may pertain to students in southern Punjab's\n\nNaviwala 5\nmadrassas because of radical Islamic groups who offer payment and debt relief to families who\nagree to send their children to the madrassas (Horgan 2015).\nSection 103, Part A of the United States' Trafficking Victims' Protection Act of 2000\n(TVPA), under \"involuntary servitude\" mentions any \"scheme, plan, or pattern\" intended to have\nan individual believe that there are severe repercussions for not entering or continuing with the\ncondition (U.S. State Department 2000). The schemes that these political groups use is emotional\nmanipulation, or even direct threats--if the madrassa student does not participate in their concept\nof jihad, that is, they fail to fulfill their religious \"duty\", they are told that they will be sent to\nHell for eternity. Although the \"serious harm\" or \"physical restraint\" here is more vicarious, as it\nhas to do with the afterlife, it instills just as much fear and distress in the individual; it is\ncoercion.\nTaking a look at the U.S. State Department's Trafficking in Persons (TIP) report can be\nuseful. Pakistan is not a party to the 2000 TIP Protocol, but is listed as a \"Tier 2\" country,\nrecently graduated from \"Tier 3.\" The difference between the two tiers has to do with the amount\nof effort that is being put to address the issue of all categories of trafficking--Tier 2 implies\nsome effort, whereas Tier 3 implies none at all. Within the report there is mention of non-state\nmilitant groups coercing families into giving up their children to \"spy, fight, or die as suicide\nbombers in Pakistan and Afghanistan\" (TIP Report 2000); the results of abuse, and rehabilitation\nof child victims that comes out of such trafficking and coercion is an area with a lot of potential\nfor development in Pakistan today.\nAlthough Pakistan is not a party to the 2000 TIP Protocol, Pakistan passed the Prevention\nand Control of Human Trafficking Ordinance 2002 (PACHTO) as a response, which aims to\nprosecute any who are involved in transnational trafficking crimes, such as people smuggling;\n\nNaviwala 6\nPakistan's penal code also includes punishments for domestic violations such as slavery, selling\nof a child for prostitution, and unlawful, compulsory labor. Pakistan's national policy, however,\nis notorious for weak implementation, sustainability, and effectiveness with poor documentation\n(TIP Report 2014).\nBefore moving further it is key to clarify the smuggling-trafficking dichotomy in the\ncontext of the madrassa. In the UN Protocol, smuggling has to do with migrants being entered\ninto a state transnationally, of which the individual is not a citizen or resident; although there is\nroom for it to be consensual, and is more ambiguous compared to trafficking, it is not applicable\nin this context (UNODC 2014).\nRadical Parties Involved\nThere has been a rise of activity among terrorist networks in Pakistan such as Al-Qaeda\nand Tehreek-e-Taliban (TTP), particularly in the Federally Administered Tribal Areas (FATA),\nNorthwest Frontier Province, and southern Punjab--areas where the national government has a\nweak foothold and recent attacks have occurred. The four major militant groups involved the\nmost in recruitment are Sipah-e-Sahaba (SSP), Lashkar-e-Taiba (LeT), Lashkar-e-Janghvi (LJ),\nJaish-e-Mohammad (JeM), that are selective in their recruitment processes, with a preference for\n\"better-educated militants\" from public sector schools and universities (Siddiqa 2015). The\nfigure below is a map of areas in Pakistan where these groups hold the most power (Majidyar\n2011).\n\nNaviwala 7\nFigure 1: Area with high concentration of non-state militant groups\nSSP is a group that was founded in Punjab in 1985, a time of rising tensions between Sunnis and\nShias in Pakistan. They received support from Zia-ul Haq's regime for standing firmly against\ngrowing Shia solidarity in Pakistan (Stanford University 2012). Lashkar-e-Jhangvi is also an\nanti-Shia Islamist organization, while Lashkar-e-Taiba and Jaish-e-Mohammed are Kashmir-\nbased organizations that were involved in attacks against India (Afridi 2009).\nThe majority of madrassas in Pakistan are more helpful than damaging in providing some\nform of education, as well as non-radical and non-militant in nature (Winthrop and Graff 2015).\nHowever, those madrassas that are controlled by local militant groups are a huge threat to\nPakistan's youth. The presence of SSP, LJ, LeT, and JeM in the southern Punjab region of\nPakistan is expanding immensely, as they use madrassas as hubs for youth exploitation.\nIt is the strategy employed by these groups to benefit monetarily through such\nexploitation in madrassas located in areas like southern Punjab that has led the U.S. to mistake it\nfor a fault in the madrassa itself. Given that the U.S. possesses a fear of religious education being\nthe main source of education for over 2 million students, even if the religious education being\nMajidyar, Ahmad. \"Could the Taliban Take Over Pakistan's Punjab Province?\" Middle Eastern Outlook:\nAmerican Enterprise Institute for Policy Research 2 (2010): 1 - 8. (c) American Enterprise Institute for\nPolicy Research. All rights reserved. This content is excluded from our Creative Commons license.\nFor more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\nNaviwala 8\nconveyed doesn't oppose the Western idea of religious tolerance (Delavande and Zafar 2013),\nthe fact that recruitment by radical parties is also taking place through public sector schools and\nuniversities, is disregarded (Siddiqa 2015).\nThe Madrassa as an Institution\nPakistani defense analyst and civilian military scientist, Ayesha Siddiqa, recently\npublished an article, \"The Madrassa Mix: Genesis and Growth,\" where she elaborates on four\ngenerations during which the madrassa, as an institution, has grown and evolved. Madrassas in\nPakistan today are often referred to as \"modern\" or \"contemporary\" madrassas, and make up the\nfourth generation of madrassas in Pakistan (Siddiqa 2015). The first generation dates all the way\nback to the end of the 10th century, when they were seminaries that were more than schools just\nfor religious education--in addition to \"Quranic\" sciences they excelled in teaching various\nother subjects such as math, literature, and science (Siddiqa 2015). It was \"institutionalized\neducation\" that didn't appear in Europe until the 13th century (Siddiqa 2015). The second\ngeneration of madrassas underwent a reform by Deobandis in India, in the mid-1800s, focusing\nmore on the teachings of hadith, or sayings of the Prophet Muhammad, rather than rational\nsciences (Siddiqa 2015). The evolution of the madrassa to one that confined itself primarily to\nreligion was purportedly a reaction to British colonialism at the time, and \"colonial policy\" of\nseparating religion from education; fortunately, in the fourth generation of madrassas, referred to\nby Siddiqa as the \"hybrid-madrassa,\" can hardly be differentiated from a secular state school\nbecause of its expansion of teachings (Siddiqa 2015).\nToday, the term \"Madrassa\" is used by the Government of Pakistan to refer to an Islamic\neducation institution that starts at the primary level, and goes up to the twelfth grade; hybrid-\nmadrassas even offer O' and A' levels (Siddiqa 2015). The madrassa continues on to the\n\nNaviwala 9\nuniversity level where a Bachelor's, Master's, and postgraduate degree can all be attained.\nStudents who pursue advanced study become Islamic scholars or teachers, also known as Alims,\nand often look for work in the religious sector in Pakistan. (Borchgrevink 2011) Some research\nclaims that students attending madrassas typically come from modest socio-economic\nbackgrounds, and others claim that madrassas also cater to both the middle and upper classes of\nsociety (Siddiqa 2015). At the same time, some claim that students who study at madrassas have\nvery limited exposure to Western thought in their education, and all of their course content is\nstudied in Urdu based on religious texts (Delavande and Zafar 2013: 2). The madrassas have no\nadmission or age requirements, and the students are taught to read and memorize the Qu'ran at\nthe earlier levels (Delavande and Zafar 2013: 9). The controversy claimed by the West is that the\nmajority of madrassas \"do not impart any secular or vocational training, but they have rigid\ncurricula emphasizing rote memorization...[and] they deliberately educate their students in\nnarrow worldviews and rejection of Western ideas\" not training them for the real world\n(Delavande and Zafar 2013). The concept of the hybrid-madrassa, however, conflicts with this\nargument. A study carried out by the United States Commission on International Religious\nFreedom (USCIRF) on public schools and madrassas, claimed that like public school teachers,\nthere were isolated cases where \"madrassa teachers even specified a religiously-based rejection\nof suicide bombing and other violent techniques. Madrassa teachers also demonstrated a stronger\nsense than their public counterparts that other 'Religions of the Book' were acceptable...\"\n(Hussein and Naveed 2011: 16).\nThe critical allegations made by the U.S. against madrassas also have to do with the idea\nof them harboring religious fundamentalists in the making. These allegations include linear links\nbetween madrassas and militancy; that is, students are socialized into adopting a \"jihadi\" mindset\n\nNaviwala 10\ndue to the \"strategic placement\" of madrassas in socioeconomically underdeveloped locations,\nwith an overall poor quality of education offered in the madrassa itself. But, the majority of\nmadrassas are not in any way institutions conducive to producing \"jihadists,\" as some madrassas\nare even willing to add regular subjects that are not religiously affiliated into the curriculum, but\nclaim that it is the Pakistani government that is not willing to trust them with that responsibility\n(Borchevink 2011: 2).\nGovernment officials, popular press, and other sources of mainstream media in the\nUnited States have created a nexus between poverty, the madrassa, and militancy. However,\naccording to the World Bank's data on religious school enrollment in Pakistan, \"There is weak\nevidence to support the hypothesis that poorer and less-educated families are more likely to send\na child to a madrassa, and somewhat stronger findings that poor children in settlements without a\nschool use madrassas more often. There is no evidence for explanations based on household\npreferences such as religiosity\" (Andrabi 2004). Rather, there are even high-income families that\nprefer to send their children to religious schools, and sometimes as a supplement to their other\nforms of schooling. Interestingly, the World Bank discovered that it is more complex than that--\n\"families who are not interested in madrassa education abandon the education system altogether\nrather than sending their children to a religious school\" indicating that the parents who do choose\nan Islamic education for their children do so because it offers a different, Islamic alternative\n(Borchgrevink 2011: 2).\nFurther, when assessing the potential of certain madrassas facilitating trafficking, it is key\nto acknowledge that not all major terrorists were educated in madrassas. In a study by Bergen\nand Pandey, The Madrassa Scapegoat, it is revealed that the most renowned terrorists in the\nworld were high profile and secularly educated individuals. That is, \"missions undertaken by Al\n\nNaviwala 11\nQaeda and its affiliated groups are not the work of impoverished, undereducated madrassa\ngraduates, but rather of relatively prosperous university graduates with technical degrees that\nwere often attained in the West\" (Bergen and Pandey 2006: 117-25). This argument is further\nstrengthened by Winthrop and Graff who concluded, \"the majority of madrasas have neither a\nviolent nor an extremist agenda,\" and \"contrary to popular belief, madrasas have not risen to fill\nthe gap in public education supply and have not been one of the primary causes of the recent rise\nin militancy\" (Graff and Winthrop 2010: 18). An American academic, C. Christine Fair, asserted\nthat since 9/11, there has actually been \"a growth in private schools, while madrassa growth has\nstayed relatively flat\" (Fair 2009).\nIn her article, Siddiqa mentions a study carried out by C. Christine Fair, who found that\nout of her sample of 141 jihadis, the majority had not been trained in madrassas (Siddiqa 2015).\nIn fact, only 12 percent had been trained in madrassas. In regard to recruitment to militancy, 35\npercent were instated in radical groups due to family and friends, 19 percent through an Islamic\nreligious movement called \"tableegh,\" and the rest from mosques (Siddiqa 2015). A scholar,\nMasooda Bano, also conducted a similar study, where she found that in her sample of 50 jihadis,\n60 percent belonged to relatively affluent social groups, and 30 percent having studied abroad\n(Siddiqa 2015).\nA valuable research study conducted by the Federal Reserve Bank of New York Staff on\nthe behavior of madrassa students involved madrassa students who were presumably staunch in\nreligious practices, and exposed to teachings condemning Western ideas of religious tolerance,\ninteracting with students from \"Liberal\" and \"Islamic\" universities who came from more diverse\nreligious and socioeconomic backgrounds. The study results showed that compared to groups of\nstudents from Islamic and Liberal universities, \"while there is a high level of trust among all\n\nNaviwala 12\ngroups, students enrolled at Madrassas exhibit the most trusting behavior compared to all other\ngroups.\" This is deduced through an experiment that included renowned trust games in\npsychology. The study rules out any chance of madrassa students promoting distrust or anti-\nsocial behavior, which counters the claim made by numerous political scholars that madrassas\npreach hatred and ideological extremism as a part of their default curriculum, not including those\nmadrassas that are controlled by non-state militant groups.\nProfessor Christopher Candland, a Political Science professor at Wellesley College,\nestimates that nearly two million students in Pakistan attend madrassas. He admits, however, that\nthe numbers are always ambiguous because not all madrassas are registered, but continue to run\n(Delavande and Zafar 2011). For example, in 2009, half of Pakistan's madrassas, roughly 6,000,\nwere purportedly in Punjab, but experts estimated even higher numbers because one-fifth of the\nprovince refused to register their madrassas (Tavernise 2009). By the end of 2010, the number of\nregistered madrassas leaped to roughly 19,500, with the overall total including non-registered\nmadrassas, at 30,000 (Borchgrevink 2011: 2). Despite these numbers, it is important to\nacknowledge that scant data is available on the students that actually attend the madrassa,\nmaking reliance on quantitative data not ideal when attempting to accurately gauge their national\nand international influence; qualitative data is more useful. Further, in a 2005 report, the World\nBank analyzed current available data on madrassas, and concluded that it is in mainstream\nmedia--such as newspapers and television news networks--that the same headlines and content\nbased primarily on interviews and secondary sources are circulated. It goes on to claim that the\nactual percentage of Pakistan's students that attend madrassas is less than 1% of all enrollments\nin Pakistan (Andrabi 2004).\n\nNaviwala 13\nRelating Western Thought on Freedom & Agency to Flawed Perceptions\nWhat if pursuing a religious education in a madrassa offers a sense of security and escape\nfor children? Do these children in particular need rescuing? Laura Agustin, an anthropologist and\nauthor, discusses in her article on soft imperialism how military actions in Vietnam, Iraq, and\nAfghanistan were all \"morally convenient exceptions\" made by the United States. \"The\nexception says This Time It's Different. This time we have to go in. We have to step up and take\nthe lead, show what real democracy is. In the name of freedom, of course\" (Agustin 2012). In\n2006, one of the worst incidents of the US' drone strike campaign in FATA took place: sixty-\nnine children under the age of 17 were killed in a drone strike on a madrassa--the youngest\nbeing seven years old (Woods 2011). The target was the headmaster of the religious seminary,\nwho may have been a militant.\nSoft imperialism has multiple forms of function: in this context, because of the United\nStates' view of religious education in madrassas as a threat, it has taken on two forms--\"The\nRescue Industry\" (carried out by a variety of American constituents, such as journalists) and\nmilitarized humanitarianism (enforced by both State and activist). The Rescue Industry was born\nand raised in the past ten years, framed around U.S. policy on human trafficking. This industry is\noften reinforced by worldwide renowned journalists, like Nicholas Kristof, whose career is based\non investigating cases of human trafficking in developing nations and justifying the rescue of\npeople for a chance at a better life (Agustin 2012). In one case, he physically raided a brothel in\nIndia to save young girls, after which he published an article documenting his account of the\nexperience (Kristof 2011). The recruitment and coercion of children in madrassas carried out by\nterror groups like LJ and SSP, is without a doubt a case not only of trafficking and exploitation,\nbut also often physical abuse that should be prevented. However, the United States' concept of\n\nNaviwala 14\nmilitarized humanitarianism, \"a mode of activist intervention,\" as regarded by Elizabeth\nBernstein, is not the answer (Bernstein 2010: 47). In her research it has become clear that the\nWest is a \"carceral state\" predisposed to using a very punitive, rather than redistributive,\napproach when dealing with threats of trafficking; it is a part of a military culture within the\nUnited States. Likewise, neither is The Rescue Industry an appropriate approach, which Agustin\nclaims, \"relies on an image of the barbaric Other\" (Augstin 2012). Rather, it feeds the West's\nview of a previously colonized country in need of soft imperialism. A parallel can be drawn to a\ncommentary by Chinua Achebe made on Conrad's Heart of Darkness: Africa was used as a\n\"metaphysical battlefield devoid of all recognizable humanity, into which the wandering\nEuropean enters at his peril...The real question is the dehumanization of Africa and Africans\nwhich this age-long attitude has fostered and continues to foster in the world (Agustin 2012).\nTo mention The Rescue Industry in the context of Pakistan, without acknowledging the\nprevalence of Orientalism--an idea created by author Edward Said in 1978, that an overly\ncohesive and condescending understanding of Islam, South Asia, and the Middle East was a\nresult of \"invested interests of European colonial powers\"--would be leaving out a crucial part\nof the flawed perception (MacDonald 2010). It is, again, a presumption that Pakistan, as a part of\nSouth Asia, can be molded to be \"corrected\" and fit an ideal model created by the West: one\nwhere religious institutions seemingly contradict the concept of freedom, and thus should not\nthrive.\nIf madrassas in Pakistan deserve a chance to be expanded back to the madrassa from the\npast that used to include all subjects and provide more than just religious education, then\nacceptance of the United States' self-righteous and well-intentioned credence that the actual\n\nNaviwala 15\nmuch-needed madrassas must be shut down, would be disastrous for Pakistan's education sector,\nespecially when a correlation between the madrassa and militancy has yet to be made.\nBecause madrassas are legal institutions in Pakistan, the United States views them as\ncontributing to structural violence in the country. The problem with the United States' anti-\ntrafficking law, TVPA, is that it is a legal structure affecting people on the ground in other\ncountries, lower tier countries being mostly Muslim countries like Pakistan (Class notes 2015).\n\nFurther, according to a study carried out by the United States Commission on\nInternational Religious Freedom, the United States' feels that there is a lack of religious\ntolerance in madrassas, and that it must be instated if there is to be development in Pakistani\nsociety--one that values religious freedom and diversity. Although increased religious tolerance\nin Pakistan would certainly lead to a decrease in sectarian violence, the United States sounds\nvery much condescending in its description of Pakistani society; again, as the barbaric and\nbackward \"Other.\"\n\nMasooda Bano, a Pakistani scholar, contributes to clearing of the West's perception of\nthe madrassa: \"in the emphasis on the political outcomes of the madrasas, their social milieu is\ncompletely ignored. In fact, even today the madrasa remains primarily a spiritual and social\nentity in which the Alim builds his authority through continual interaction with the community:\nthere are substantial checks on that authority since the community's support for a madrasa is not\nmotivated by blind ideological conviction, but by very rational calculations about his efficiency\nand personal commitment (Bano 2007).\nContextualizing Southern Punjab as an Outlier\n\nNaviwala 16\n\nFigure 2: Map of southern Punjab (IDSA)\nUnlike other parts of Pakistan, and the Punjab province, southern Punjab is especially\nlagging in the following areas: infrastructure, communication networks, social services\ninstitutions--including public schools--preventive and curative healthcare, agricultural inputs,\nand municipal services--such as addressing issues within water supply and sanitation (Mehboob\n2011: 5). Social injustice is also very common in the region as many groups are socially\nmarginalized and excluded from society based on their ethnic background, gender, land\nownership, class, and caste (Mehboob 2011: 1). It is because of the lack of government\nleadership and tolerance for these issues that non-state militant groups have been able to\ndominate the region with such ease.\n\nAccording to a report by the Center for Strategic and International Studies (CSIS),\napproximately one-fourth of the people living below the poverty line in Pakistan, live in southern\nPunjab. For southern Punjab, poverty is characterized by \"low income levels, a weak asset base,\nand barriers against efforts to reduce discrimination,\" which essentially contributes only to the\nperpetuation of poverty (Mehboob 2011: 1). CSIS also believes that the high number of\n(c) Institute for Defence Studies and Analyses. All rights reserved. This content is excluded from our\nCreative Commons license. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\nNaviwala 17\nmadrassas existing in southern Punjab cannot be linked to the militant presence in the region,\nalthough militants do seek out support from families by offering free education with boarding\nand lodging for their children, as well as cash transfers for the entire family. There is speculation\nthat strong anti-U.S. sentiment due to counter-extremism activities carried out by both the U.S.\nand Pakistan government in the region is affiliated with rise in militancy in the area, while it\ncould also have to do with militant groups decoying families with their offering of community\nservices and political activism (Mehboob 2011: 5). What makes southern Punjab an outlier\ncompared to other regions in Pakistan that also have a high concentration of militant groups--\nsuch as Swat, KP, and FATA--is that many members of Pashtun groups and Al-Qaeda have\nbeen fleeing ever since the U.S. began its drone campaign.\n\"Last year, the police attempted to arrest a JeM commander in a Bahawalpur hospital after he\nhad been wounded in a U.S. predator strike, but they backed down after his fighters threatened\nto blow up police stations and schools if the arrest went ahead. A JeM madrasa in Bahawalpur\nthen offered him safe haven. He had many madrasas from which to choose: the district has the\nlargest number of religious seminaries in Pakistan, housing over eighty thousand students\"\n(Majidyar 2011: 4).\n\nDespite the Pakistani government's attempts at putting in large investments to improve\naccess to public education, a focus on higher education has nonetheless been missing from the\nsystem. This is a province of Pakistan where large amounts of both army and militant\nrecruitment takes place due to the state-created anti-India militant groups that initially were\nunder state patronage, such as LeT, and JeM (Perlez 2010, Laub 2013). The CSIS claims that to\nprevent recruitment in these areas, the Pakistani government can strategize to create a system\nwhere there is widespread placement, counseling, and career advice for youth to increase job\nopportunities, therefore lowering the need for families to give in to militant groups in the area.\nThere has yet to be a link between social welfare groups, education programs, and local civil\nsociety organizations--all of which can guide families away from falling victim to the alluring\n\nNaviwala 18\noffers of politically driven militant groups. \"The Islamic schools are also seen as employment\nopportunities. 'When someone doesn't see a way ahead for himself, he builds a mosque and sits\nin it,' said Jan Sher, whose village in southwestern Punjab, Shadan Lund, has become a militant\nstronghold (Tavernise 2009).\nSabrina Tavernise, a journalist for The New York Times, claimed that out of 12,000\nregistered madrassas in Pakistan, roughly half are located in Punjab. However, \"Experts estimate\nthe numbers are higher: when the state tried to count them in 2005, a fifth of the areas in this\nprovince refused to register\" (Tavernise 2009). Southern Punjab is apparently also very rural--\nTavernise claims that \"Though madrassas make up only about 7 percent of primary schools in\nPakistan, their influence is amplified by the inadequacy of public education and the innate\nreligiosity of the countryside, where two-thirds of the people live\" (Tavernise 2009).\nStill, because southern Punjab and some provinces in the Northwest are outliers, the issue\nof madrassas flourishing in southern Punjab needs to be addressed by the government, without\ncompletely shutting down the model of the madrassa. They need to work on getting rid of the\nstigma attached to them in the international community, such as generalizing the madrassa as a\nplace where intolerance is taught and glorification of a false interpretation of jihad or \"holy war\"\ntakes place. That is, the assumption that a strictly extreme interpretation of Islam is taught in all\nmadrassas.\nCases that constitute child trafficking\nIn an article published by The Guardian, four Afghani children raised in Pakistan\nattended what is referred to as the \"hate madrassa\" that is described as a place that bred in them a\nhatred for American soldiers in Afghanistan (Boone 2011). This serves as an example of one of\nthe strategies employed by non-state militant groups: the grooming technique. Grooming is often\n\nNaviwala 19\nused in the context of child sexual trafficking, to reshape a child's definition of what is normal,\nand morally acceptable, through processes of violence, and often degradation; it is a full\nsystematic process (Class notes 2015). Grooming occurs from a young age, and also can be\napplied to those madrassas at which recruitment takes place. \"All the time in Friday prayers the\nmaulavi talked about the Americans in Afghanistan and he told us that we should do jihad,\nespecially on Fridays,\" said one of the nine year-old boys (Boone 2011). This is how it\nhappened: after being coerced into joining the Taliban through threats of violence and failure to\nbecome martyrs, the boys were supposedly told to travel to Kabul by Maulavi Marouf, a mullah\nin charge of a madrassa, and told to unload a delivery of car batteries--manual labor which for\nsome reason demanded \"physically weak children\" (Boone 2011). The fear is that the\nindoctrination that allegedly takes place at these 'hate madrassas,' can turn children into\nbombers. However, one of the boys stated his reason to be financial: \"Our family is very\npoor...when I was promised 50,000 rupees to go to Afghanistan, I went immediately\" (Boone\n2011). Essentially, it is being conveyed that their recruitment is carried out through both physical\nand emotional coercion, and it can lead to their recruitment into the Taliban to participate in\nsuicide bombing.\nFurther, Owais Tohid, a correspondent for the Christian Science Monitor, wrote about a\nsixteen year-old boy named Arshad Khan who, after surviving a drone strike in North\nWaziristan, was sent home to Karachi by the Taliban. It turns out that Khan was a \"former\nmadrasa student-turned-suicide-bomber\" who was \"recruited by a network of Taliban\ncommanders from the country's many unregulated religious madrasas\" (Tohid 2011). When\ninterviewed at the age of eighteen, Arshad Khan explained how he had wanted to become both\nan engineer and a \"good Muslim\" by going to both a school and a madrassa; but, it was the\n\nNaviwala 20\nTaliban that \"shattered my ambitions and changed my life\" (Tohid 2011). A suicide bomb-\nrecruiter himself was arrested in Karachi in 2011: Abdur Razzaq, after his arrest, led the police to\nan \"Islamic militant ring involved in the recruitment of teenage madrasa students...to be trained\nas suicide bombers in North Waziristan\" (Tohid 2011).\nAn article from CNN by John Horgan provided reason as to why actions like these\nconstitute child trafficking: younger children are easily influenced by terrorists and lack the\ncapability to say no out of fear for their safety or the punishment of their families. Given that\nmarijuana grows throughout Swat in Pakistan, children who suffer from drug abuse are perfect\noccasions for Tehreek-i-Taliban (TTP) members to approach their families with offers of a\npromising future, even a safe haven, filled with opportunities to find belonging, purpose, and\nmost importantly: work. This kind of deception would constitute a \"scheme,\" by the TVPA (U.S.\nState Department 2000). In other situations, the Taliban are more aggressive and use forms of\nfinancial pressure, such as debt bondage, to coerce families into virtually selling their children to\nthe group. According to Horgan, families had the choice of either surrendering the child, or\npaying a financial tax that equated to double the annual wage (Horgan 2013).\nChild trafficking can include physical abuse--Horgan reported that beyond the madrassa,\nand into the training camp, children \"were locked in a 4x5 meter room\" after a day filled with\nperforming menial tasks for TTP members. Some recalled being beaten and sexually assaulted\nrepeatedly by senior figures. Interestingly, others had positive experiences with the TTP because\nof entire families being drawn in; \"For them, adventure, camaraderie, and a sense of purpose\nproved all too real. Terrorism was the family business...\" If the UNODC were to try and pin\ndown an age for these children, it would be a challenge, as they don't have birth certificates and\ncan't provide an age themselves (Horgan 2013).\n\nNaviwala 21\nRehabilitation for child victims & Solutions\n\nConsequentially, for those children who have experienced trafficking in more conflicted\nareas like Southern Punjab, FATA, KP, and Swat, rehabilitation programs are vital. I have\nobserved such programs developing, particularly after the recent Peshawar shootings. There is a\nstrong stigma attached to mental disorders such as Post-Traumatic Stress Disorder (PTSD)\ndepression, and schizophrenia in Pakistan, so rehabilitation for children who were trafficked via\nextremist recruiters is accompanied by a challenge to face countless families and organizations in\nPakistan. Fortunately, many Pakistani non-governmental organizations aimed solely at assisting\nchildren with overcoming their trauma have been launched in locations such as Swat Valley. One\nparticular rehabilitation school, Sabaoon, or \"New Dawn\" located in Malakand, has treated at\nleast 180 young men since 2009 (McCarthy 2011). Here, they share stories of how they were\ntrafficked through techniques of grooming, coercion, and kidnapping. One boy said that the\n\"terrorists\" kidnapped him and beat him very badly, ultimately showing him \"the way of suicide\nbombing\" (McCarthy 2011). The school is staffed by child psychologists and receives funding\nfrom UNICEF and the Pakistani government (Coughlin 2012). One clinical neuropsychologist at\nSabaoon, Feriha Peracha, posed the following question:\n\"An adolescent, libido high, and you tell him, 'Look, to kill a Pakistan army guy, you are going\nto get 70 beautiful women immediately. Immediately, you do it and there they are, waiting for\nyou. And there is milk and honey.' ... So why should he not do that?\"\n\nSabaoon then provides mainstream academics, rather than a strictly religious education, which\naims to provide the boys with a high-school level degree and eventually vocational training for a\njob as an electrician or repairman, and after the \"de-radicalization program\" they are closely\nmonitored in jobs or local schools (McCarthy 2011). Reporter, John Horgan, with CNN\ninterviewed one particular child who attended Sabaoon and has set an example for the others--\n\nNaviwala 22\nnow eighteen years old, he has excelled academically at Sabaoon, received a scholarship to a\nuniversity, and returns to Sabaoon to speak with boys currently undergoing rehabilitation\n(Horgan 2013). The Pakistani military also continues to run a rehabilitation program for children\nwho have been exploited by extremist groups in Swat. However, there is little information\navailable on the number of trafficking victims assisted, whether the government encouraged\nvictims of trafficking to launch investigations against their traffickers, or pursue retribution for\ntheir exploitation (Mehboob 2011).\n\nWhat is the role of the West in finding a solution? Do we need more Greg Mortensons\ntraveling to Pakistan to build schools rather than madrassas? A controversy that arose against the\nauthor of Three Cups of Tea, and founder of the Central Asia Institute, was that a lot of his\nclaims and experience--of being kidnapped by the Taliban, finding refuge in a village, and\noffering to build schools for residents--were fabricated and filled with exaggerations (Court,\nLivelli, and Usman 2011). In an interview by 60 Minutes, the host asked a man from the village\nin which Mortensen claimed to build schools, \"Why do you think Mortensen would write this?\"\nThe man responded, \"To sell his book.\" This exhibits what Agustin suggests to be the crux of the\nissue of The Rescue Industry: the motivation behind the acts of American writers,\nphilanthropists, and journalists is a skewed perception of what it means to be altruistic and rather\nunproductive. This is not to say that schools that are not madrassas should not be built, as they\nshould, but this is a role for Pakistan to take on. Rehabilitation after trauma is a sensitive area,\nand those who could be the most helpful would most likely be native Pakistanis who are familiar\nwith the culture, language of Urdu, and current political and socio-economic conditions.\nAssessing the need for \"de-radicalization\" is something that should be left to Pakistanis like\nParacha--whether they were radicalized in the madrassa, or whether it was post-trafficking.\n\nNaviwala 23\nExpert Responses with Opposing Views\n\nA previous employee of the US Institute of Peace stated, \"the phrase 'madrassas are not a\nproblem' has become the politically correct answer in the West. There was research, I think by a\nwoman named Rebecca at the Brookings Institute who backed it up by saying that madrassas\nconstitute just 1% or so of schools in Pakistan. Liberal elites in Pakistan do perceive that\nmadrassas are a problem and they are prevalent, but it's hard to go against data collected by US\nthink tankers by using popular perceptions.1 She explained that what many American professors\nare looking at is solely the religious education aspect while it's taboo in the US to say it is\nviolent, despite the fact that many people in Pakistan believe it is--especially in southern Punjab.\nIn a personal conversation with Ayesha Siddiqa, she made the assertion \"that there is no\nblack and white.\" She claims that patterns of recruitment are very nuanced, even in southern\nPunjab. From her perspective, although militants do recruit from public and private schools,\n\"madrassas are an important stop over.\" She also stated, \"Madrassas are very central to\nradicalization of the community, which could later lead to encouraging violent extremism. My\nown research showed that they were closely tied. Madrassas may not be central to recruitment,\nbut are critical to indoctrination.2\nConcluding thoughts\n\nThe United States' perception of the madrassa existing as an institution that only fosters\nthe transfer of extremist ideology from one generation to the next is a flawed one. It is rooted in\nthe West's conceptualization of freedom as being the separation of religion and public education,\nthus trumping child agency in Pakistan. A U.S. drone attack in 2006, killing sixty-nine children\n\n1 Personal conversation with a previous member of the U.S. Institute of Peace (USIP), April 15,\n2015.\n2 Letter to author, May 4, 2015.\n\nNaviwala 24\nunder the age of seventeen, goes to show that both ideas of militarized humanitarianism and the\nRescue Industry are being employed relentlessly to act against an institution that is a scapegoat\nfor inducing terror. The children being educated in madrassas do not need saving by the West;\nrather there should be a focus on the militant groups, Lashkar-e-Taiba, Sipah-e-Sahaba, Lashkar-\ni-Janghvi, and Jaish-e-Mohammed, which are gaining stability and power in Punjab through\nstructural underdevelopment, allowing them to radicalize provincial madrassas. The United\nStates' concept of religious freedom is undermined especially because it feels the need to\nintervene in the running of religious seminaries in Pakistan.\nThere are clearly conflicting views among scholars in both Pakistan and the U.S.\nregarding the relationship between militancy, recruitment, and religious education in Pakistan.\nThere is a plethora of worthy sources and qualitative evidence comprised of personal stories to\nholistically defend the role of the madrassa as a crucial source of education in a country with\nstructural conditions mitigating the possibility of better access to a public education. Although\nchild trafficking by non-state militant groups certainly takes place, research shows it is mostly\nconcentrated in southern Punjab and provinces in the Northwest making them outliers. The\nmadrassa is therefore an institution that teaches through religious education, not one that\nfacilitates child trafficking, but one that can be manipulated and used as a tool to recruit and\ncoerce children into working for terror organizations.\nWithin Pakistan, the issue of madrassas flourishing in southern Punjab needs to be\naddressed by the government without completely shutting down the model of the madrassa itself.\nInstead, it must work towards eliminating the stigma attached to madrassas within the\ninternational community, and generalizations of the madrassa as a breeding ground for\nintolerance and glorifier of the false interpretations of jihad, or \"holy war.\" Accountability and\n\nNaviwala 25\ndialogue are needed for religious seminaries to be distinguished from those controlled by the\nradical--Pakistan simply does not have the infrastructure to cope with the consequence of them\nall shutting down, especially when they are advantageous for socioeconomic development, and\ndo a better job of providing food, shelter, and activities for children who would otherwise be on\nthe streets. U.S. military intervention in campaigns active in areas like FATA, aimed at militant\ngroups exclusively, is a different discussion in and of itself. If the U.S. wants to carry out the\n\"humanitarian\" act of assisting Pakistan, the best route for them is to provide organizations based\nin Pakistan with the funding they need to further develop and continue campaigns for education\nand rehabilitation for children. At a time like this, there is no room for Western bias, skewed\naltruism, and the imperialistic imposition of Western models for structural development.\n\nNaviwala 26\n\nWorks Cited\n\nAfridi, Jamal. \"Kashmir Militant Extremists.\" Council on Foreign Relations. 9 July, 2009. Web.\n5 May, 2015.\n\nAndrabi, Tahir, Jishnu Das, Asim I. Khwaja, and Tristan Zajonc. \"Religious School Enrollment\nin Pakistan: A Look at the Data.\" 2004. World Bank, n.d. Web. 27 Mar. 2015.\n\nAgustin, Laura Maria. \"The Soft Side of Imperialism: Kristof and the Rescue\nIndustry.\" 25 January 2012. Counterpunch Magazine.\n\nBano, Masooda. \"Beyond Politics: the reality of a Deobandi madrasa in Pakistan.\" Journal of\nIslamic Studies (2007), 18 (1): 43-68.\n\nBergen, Peter, and Swati Pandey. \"The Madrassa Scapegoat.\" The Washington Quarterly 29.2\n(2006): 117-25. The Center for Strategic and International Studies and Massachusetts\nInstitute of Technology. Web.\n\nBernstein, Elizabeth. (2010). \"Militarized Humanitarianism Meets Carceral\nFeminism: The Politics of Sex, Rights, and Freedom in Contemporary Antitrafficking\nCampaigns.\" Signs Vol. 36, No. 1: 45-71.\n\nBoone, Jon. \"Groomed for Suicide: How Taliban Recruits Children for Mass Murder.\" The\nGuardian. The Guardian, 17 May 2011. Web. 12 Apr. 2015.\n\nBorchgrevink, Kaja. \"Pakistan's Madrasas: Moderation or Militancy? The Madrasa Debate and\nthe Reform Process.\" NOREF Report (2011): 2. Peacebuilding. Norwegian Peacebuilding\nResource Centre, June 2011. Web. 26 Mar. 2015.\n\nBorchgrevink, Kaja and Kristian Berg Harpviken. \"Taking Stock: Madrasa Reform in Pakistan.\"\nNOREF Policy Brief (2011): 2. Norwegian Peacebuilding Resource Centre, July 2011.\nWeb. 26 Mar. 2015.\n\nCorinne, Graff, and Rebecca Winthrop. \"Beyond Madrasas: Assessing the Links Between\nEducation and Militancy in Pakistan.\" Center for Universal Education at Brookings\n(2010): 18. Center for Universal Education at Brookings, June 2010. Web. 24 Mar. 2015.\n\nCoughlin, Con. \"Pakistan School Offers Hope for Children Rescued from the Taliban.\" The\nTelegraph. Telegraph Media Group, 5 Oct. 2012. Web. 14 Apr. 2015.\n\nDelvande, Adeline, and Basit Zafar. \"Stereotypes and Madrassas: Experimental Evidence from\nPakistan.\" Staff Reports 501 (n.d.): 2. FRBNY Staff Reports. Federal Reserve Bank of\nNew York, Jan. 2013. Web. 20 Mar. 2015.\n\nNaviwala 27\nFair, Christine C, Tahir Andrabi, Jishnu Dasand, and Asim Ijaz Khwaja. \"The Madrasa Myth.\"\nForeign Policy Magazine. 01 June, 2009. Web. 05 May, 2015.\n\nHiro, Dilip. Apocalyptic Realm: Jihad in South Asia. New Haven, CT: Yale, UP 2012. 161-62.\nPrint.\n\nHorgan, John. \"Child Suicide Bombers Find Safe Haven.\" CNN. Cable News Network, 27 Mar.\n2013. Web. 13 Apr. 2015.\n\nHussein, Azhar, Ahmad Salim, and Arif Naveed. \"Connecting the Dots: Education and Religious\nDiscriminiation in Pakistan: A Study of Public Schools and Madrassas\" (2011): n. pag.\n16 United States Commission on International Religious Freedom, Nov. 2011. Web. 5\nMay 2015.\n\nInternational Crisis Group. \"Pakistan: The Militant Jihadi Challenge.\" Asia Report 164 (2009):\n11. Crisis Group. International Crisis Group, 13 Mar. 2009. Web. 23 Mar. 2015.\n\nKristof, Nicholas. \"Raiding a Brothel in India.\" The New York Times. 25 May, 2011. Web. 15\nApr. 2015.\n\nLaub, Zachary. \"Pakistan's New Generation of Terrorists.\" Council on Foreign Relations. 18\nNov. 2013. Web. 05 May, 2015.\n\nMacDonald, Myra. \" 'Orientalism' in Afghanistan and Pakistan.\" 22 Oct. 2010. Web. 07 May\n2015.\n\nMajidyar, Ahmad. \"Could the Taliban Take Over Pakistan's Punjab Province?\" American\nEnterprise Institute. 17 June, 2010. Web. 5 May, 2015.\n\nMcCarthy, Julie. \"Pakistan Bids To Change The Minds Of Swat Radicals.\" NPR. NPR, 25 July\n2011. Web. 13 Apr. 2015.\n\nPerlez, Jane. \"Official Admits Militancy's Deep Roots in Pakistan.\" The New York Times. 02\nJune 2010. Web. 07 May 2015.\n\nSiddiqa, Ayesha. \"The Madressa Mix: Genesis and Growth.\" Dawn News. 01 Mar. 2015. Web.\n05 May 2015.\n\n\"Sipah-e-Sahaba Pakistan.\" Stanford University.15 Feb. 2012. Web. 16 Apr. 2015.\n\nTavernise, Sabrina. \"Pakistan's Islamic Schools Fill Void, but Fuel Militancy.\" The New York\nTimes. 03 May 2009. Web. 2 Apr. 2015.\n\nTohid, Owais. \"Pakistani Teen Tells of His Recruitment, Training as Suicide Bomber.\" The\nChristian Science Monitor. The Christian Science Monitor, 16 June 2011. Web. 16 Apr.\n2015.\n\nNaviwala 28\n\n\"United Nations: Convention Against Transnational Organized Crime and the Protocol Thereto.\"\nOffice on Drugs and Crime (2005): 42-43. UNODC. United Nations, Dec. 2005. Web. 21\nMar. 2015.\n\nWoods, Chris. \"The day 69 children died.\" The Express Tribune. 12 Aug. 2011. Web. 05 May,\n2015.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21A.445J / WGS.272J Slavery and Human Trafficking in the 21st Century\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "21A.445JS15 Slavery & Human Trafficking - Final Paper, Student 2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-445j-slavery-and-human-trafficking-in-the-21st-century-spring-2015/65b5817370e3d6a5554bf712cc492420_MIT21A_445JS15_Sexting.pdf",
      "content": "Sexting, Abolitionism and Technophobia\n\nThe criminalization and moral policing of young women's sexuality is not a new concept.\nWith new technologies such as social media and smart phones, young people have started\nsharing every aspect of their lives on the Internet, including their sexual thoughts and\nexpressions. \"Sexting,\" the practice of sharing self produced explicit photos with a partner via\ntext message, can be a useful outlet for girls to gain control over their sexuality when adults and\nthe media are telling them they shouldn't have any sexual thoughts at all. Public discourse\nsurrounding sexting, like slut-shaming, blames women for the sexualization of society while in\nthe same breath positions them as the only ones capable of stopping it. With new technologies\ncome new questions about consent and agency. The solution: a full reconstruction of sexting\nlegislation based on consent and educational methods that encourage safe use of new\ntechnologies.\n\nA History of Sex Work Discussions in the U.S.\n\nSpeaking out against anti-trafficking campaigns is like speaking out against the abolition\nof slavery. Trafficking is a horrible phenomenon and its victims should be getting protection\nfrom NGOs and the government alike. Yvonne Zimmerman, a religious studies scholar, has\nnoted that no one could possibly be \"for\" sex trafficking. But the problem is that anti-trafficking\ncampaigns do not always lobby to end human trafficking, but instead strive to police female\nsexuality. The annual Trafficking in Persons Report (TIP) produced since 2001 by the United\nStates government rates countries on three tiers based on their progress in combatting trafficking.\nThe lower the rating, the less funding a country's government will receive from the U.S. Laura\n\nAgustin criticized the TIP's misguided 'trafficking crusades' saying, \"grading everyone else on\nmoral grounds is highly offensive, particularly when such grades are accompanied by threats of\npunishment if the line isn't toed\" (Agustin 2007). By focusing so much attention on\nsensationalized cases of sex trafficking, domestic problems, like poverty and hunger, are\nforgotten. The producers of this report imagine that the worst scenario is selling sex, when in\nreality, in some countries it pays women more money than any other opportunities afforded to\nthem.\n\nInstead of acknowledging that sex work is a legitimate choice of labor for some women,\nthe U.S. government, in its Trafficking Victims Protection Act (TVPA), cites three pillars to help\nvictims of trafficking: Protection, Prosecution and Prevention. Victims are protected, but only if\nthey make the choice to not engage in sex work - otherwise they are prosecuted as traffickers.\n\nIn the TVPA, trafficking is defined to include sweatshop labor and agricultural work as\nwell as sex trafficking. Even though the number of people affected by sex trafficking is less than\nthe number affected by the trafficking of migrant workers, for example, the trafficking of women\nand children has generated the most concern and moral panic among the public, and gives the\nmedia more viewership. When actually speaking with sex workers about their experiences\nresearchers have discovered that this coercion narrative is the exception rather than the norm, but\nfighting against sex trafficking is a much more media-friendly goal than fighting against\nprostitution. The media focuses on sexual violation rather than the \"structural preconditions of\nexploited labor\" (Bernstein 2010:49). This is because sexual violence, especially against women\nand children, is much more sensationalized, and to discuss structural violence would necessitate\naccepting that these structures exist and perpetuate the violence we aim to stop.\n\nStructural violence, \"the systematic ways in which social structures harm or otherwise\ndisadvantage individuals\" (structuralviolence.org), limits individual agency and the choices\navailable to women. Instead of researching the power structures that lead to women to choose\nsex work despite its many legal repercussions, researchers choose to focus on statistics, though\nthere is still little viable data on this subject. Numbers get thrown around arbitrarily, often\nconflicting with one another and based on little actual data. One number that is for certain is that\nthe U.S. has the highest rate of incarceration in the world, with 2 million people in prison.\n\nThe Stigmatization of Sex Work\n\nThe word 'trafficking' has become almost synonymous with the word 'prostitution'- not\njust forced, but voluntary. What is a prostitute? What is sex work? The term sex work was\ncoined in 1978 as a way to end the stigma associated with prostitution. However, Agustin\nhighlights that this issue still exists:\n\n\"Contemporary movements against slut-shaming, victim-blaming and rape culture clearly\n\nshow how whore stigma is applied to women who do not sell sex at all, so the claim is\n\nfeeble. Instead, abolitionism's aversion to prostitution probably strengthens the stigma,\n\ndespite the prostitute's demotion to the status of victim rather than the transgressor she\n\nonce was\" (Agustin 2013).\n\nIn 1973, Margo St. James founded the group \"Call Off Your Old Tired Ethics\" to equate sex\nwork with any legitimate form of labor. The group argued that sex work was stigmatized because\nof male standards of ethics, which demand preservation and purity of the female body. Three\nyears later, this group filed a lawsuit against the state of Rhode Island, charging that police\nofficers were selectively prosecuting more female sex workers than their male customers.\nAlthough the case was dismissed, the group was given some credit in decriminalizing\nprostitution in Rhode Island; this ruling was reversed in 2009.\n\nSex work is stigmatized. Conversations about sex work focus on the laws and regulations\naround it rather than recognizing that some women do choose sex work over other forms of\nwork. Sex workers have been known victims of serial killers dating back to Jack the Ripper in\n1888. Peter Sutcliffe, Gary Ridgway, Robert Hansen, Joel Rifkin, Robert Pickton, and Steve\nWright are collectively suspected of murdering 130 sex workers since 1975. The Attorney\nGeneral in the Sutcliffe case stated, \"some were prostitutes, but perhaps the saddest part of this\ncase is that some were not\" (Agustin 2013). If sex work were not illegitimized by the stigma\nsurround it, would sex workers be in so much danger in their everyday lives? Some argue that,\n\"If prostitution were abolished, whore stigma would disappear\" (Agustin 2013). Under current\nlaws - prohibition of all forms of sex work - sex work is criminalized. This criminalization\ndirectly leads to it being stigmatized.\n\nNew York City's 2013 \"No Condom's as Evidence\" bill represents how closely related\nthe stigmatization of sex work is with the stigmatization of female sexuality. Until recently,\ncondoms could be used as evidence of prostitution. This reversal bill was passed, but like stop-\nand-frisk laws, even though it was outlawed, the police still practice it, often using race, class,\ngender and age to single out potential workers. One citizen who was stopped by police based on\nthis law was Monica Jones, a black trans woman stopped by police for \"walking while trans.\"\nThe laws that are, in theory, meant to protect, are actually victimizing those already marginalized\nin society.\n\nModern Day Abolitionists\n\nEvangelical Christians have teamed up with liberal feminists in the fight against sex\ntrafficking. Neoliberalism, or the concept of free market solutions to state problems, was the first\n\nshared commitment between Evangelicals and feminists. The idea was that 'modern-day slavery'\nis the \"antithesis of low-wage work in the purportedly free market\" (Bernstein 2010:47). The\n'new abolitionists' have united under a common goal, arguing that sex work is a gendered social\nexchange identical to slavery. These groups use this message to claim that all forms of sex work\nare sex trafficking. Even though they occasionally mention other forms of modern day slavery\n(such as sweatshop labor), their main purpose is to abolish all forms of sex work, a regressive\nmove in the grand scheme of feminism. By arguing that sex work is inherently trafficking, these\ngroups take away any agency the sex workers have in their livelihoods.\n\nHow are these two groups able to align on an anti-sex-trafficking agenda when they have\nhistorically had such different goals? Modern day evangelicals are moving leftward, away from\n'isolationist' issues like abortion and gay marriage and more toward universal issues like ending\nsex trafficking. Many feminists are moving to the right, towards a carceral, or linked to the\nprison system, model of justice.\n\nLeft wing feminists argue that the alliance between Evangelicals and anti-trafficking\nfeminists is based on traditional ideas of gender and sexuality. In fact, their activism is actually\nunited based on \"a shared commitment to carceral paradigms of social, and in particular gender,\njustice...and to militarized humanitarianism as the permanent mode of engagement by the state.\"\n(Bernstein 2010:47).\n\nEvangelical Christians\n\nThe modern day abolitionists have begun to practice militarized humanitarianism. This\nmeans that to achieve their humanitarian goal of ending sex trafficking, the proposed solution is\nputting perpetrators (pimps and johns) into jail and victims into a free market, capitalist\n\neconomy. The irony is that the capitalist economy is what's driving much of modern day slavery,\nbut by only focusing on sex trafficking, the abolitionists effectively ignore a huge portion of the\npeople they are trying to help.\n\nThe Evangelical Christian groups allied with feminist groups are not the Evangelicals of\nthe past. They are young, highly educated, and affluent. They push the themes of social justice\nand women's rights while backing away from sexual politics that other Christian groups have\nfought against such as abortion. Their social justice, like the feminist social justice, is directly\nlinked to criminal justice. Using a model called \"rescue-and-restore,\" men frame themselves as\nsaviors and crime fights, leading raids on brothels that are far removed from the United States.\nAfter the men \"save\" the sex workers, the Christian groups set up rehabilitation centers for the\nwomen to go to, where they are given safer, alternative forms of work like sewing and craft-\nmaking. These products can then be purchased by supporters from the safety of their homes. This\ntransaction \"solidifies the distinction between freedom and slavery\" (Bernstein 2010:64) as\neconomical.\n\nIn her fieldwork, sociologist Elena Shih studied these \"saved\" women and found that\nmany of them were not trafficked but chose to engage in sex work and left only once they had\nenough money to support their families. They actually found that working for the evangelicals\ngranted them less autonomy than they had as sex workers. They were forced to go to prayers and\ncouldn't visit friends in certain areas of the city, and many ended up running away from the\n'saviors.'\n\nWhile attending a screening of an Evangelical group's film on sex trafficking, scholar\nElizabeth Bernstein noted that the main characters portrayed in the film were from regular sex\nwork scenarios, voluntarily participating in the trade. The characters \"offer[ed] the audience a\n\ndecontextualized and sensationalistic focus upon trafficking as rape and sacrificed virginity.\"\n(Bernstein 2010:49).\n\nFeminists\n\nCarceral feminism is more than just incarceration-it is the idea that punishment and\njustice are tightly linked and the use of this link as a framework for activism. One example of\nanother time period where evangelicals and feminists allied for sexual reform using a guise of\naiding helpless victims was in 1986, in the Attorney General's Commission on Pornography.\nThis report, at almost 2,000 pages long, detailed the effects of pornography and the connections\nbetween pornography and organized crime.\n\nThe carceral feminists are quick to blame certain demographics of people for sex\ntrafficking, mainly people of color involved in street-based sex work. Although feminists on the\nopposite end of the spectrum argue that modern day slavery is the prison system itself, not\nprostitution, for carceral feminists, \"the responsibility for slavery is shifted from structural\nfactors and dominant institutions onto individual, deviant men: foreign brown men...or African\nAmerican men living in the inner city.\" (Bernstein 2007:144) They forget about global poverty,\nthe dynamics of migration, and structural and economic factors that have led these women to\nseek out sex work, and instead focus on how nuclear families can prevent sex trafficking. While\nthey insist that the best way to end sexual slavery is by the incarceration of pimps and johns,\ntheir campaigns have actually been more successful in further criminalizing marginalized\npopulations and enforcing border control than they have been at providing solutions to situations\nthat lead to sex work in the first place.\n\nPolicing Sexuality\n\nWhat militarized humanitarian and carceral feminist groups are actually discussing is not\nsex trafficking, but rather promiscuity and sexuality. Contemporary campaigns have adopted\nsimilar language to that used by 1980s anti-abortion groups, which connected stories of slavery\nand rescue to their causes in order to produce rage in the media and commitment by the public.\nBut sex work is not the issue. The issue is actually sexual culture and modern day technology,\nwhich has allowed this phenomenon to become so widespread and visible. And what these\ngroups are suggesting as a solution is a regress to traditional gender roles and heteronormative\nrelationships, with the suppression on nontraditional sexual expressions and sexual freedom.\nKaraian discusses how this regress is presented to young women in the media. \"The mainly\nwhite, middle-class, heterosexual teenage girls at the center of media representations and case\nlaw have been interpolated as always already disempowered and duped victims of sexualization\nof youth, as self-sexually exploiting or as asexual subjects\" (Karaian, 2012:57). The solution is\nfocused on the middle class white heterosexual individual rather than the minority victim that\nthese groups report they are trying to help. They say that the only way to combat sex trafficking\nis to follow their strict views regarding sexuality.\n\nOrientalism in the Media\n\nAnother aspect of the evangelical approach is the mass-media-orientated model of\nactivism. Often times their brothel raids are conducted with both law enforcement and the media\npresent. The media has helped further the idea of orientalism and anti-sex work that these groups\nare asserting. They are \"embodying a form of political engagement that is consumer- and media-\nfriendly and saturated in the tropes and imagery of the sexual culture it overtly opposes--a\n\nfeminine, consumptive counterpart to the masculine politics of militaristic rescue.\" (Bernstein\n2010:63).\n\nThe Evangelical groups use moral panic to push their political agendas. The media has\nunfortunately played into these goals by broadcasting stories of women and children in Africa\nand East Asia trying desperately to earn a respectable living and being coerced or kidnapped into\nforced prostitution. In stories that are nationally broadcasted on CNN or NBC, women are\nrescued and taken out of slavery by heroic white American men. Stories narrated by modern day\nabolitionists like Nick Kristof further this idea that sex work is fundamentally similar to slavery\nand that women must be rescued, stripping any voluntary sex worker of her agency. These\nstories are so removed from the white, middle class groups who are consuming them that they\nenable women to safely connect with sexually deviant culture without actually risking anything.\nThe modern day slavery cause in the past has served feminists in pushing forward other ideas\nlike social purity and moral reform, and even suffrage.\n\nMembers of these groups believe that they are helping women by forcing them into\nconsumerist economies. During field work with evangelical groups, Bernstein noted the\n\"frequent reference to the backward traditionalism of third-world cultures as one of the primary\ncauses of sex trafficking, a framework that helps them to define and reinforce their own\nperceived freedom and autonomy as Western women\" (Bernstein 2010:63).\n\nBy only sensationalizing the raids that happen in the east, the media is contributing to\norientalism, or the othering of the east in terms of the western experience. This is also an\nexample of what Laura Agustin calls \"soft imperialism,\" using carceral logics (relying on law\nenforcement to solve problems) to drive neo liberal problem solving. It's soft because of their\n\nmission - it's not overly exploitative nor are they attempting a cultural imposition on those they\nare trying to save. But by using market driven solutions to solve problems created by the market\nsystem, the problem is perpetuated.\n\nOnline Red Light Districts\n\nThe Internet is a powerful tool that can bring all aspects of life into the digital age,\nincluding commerce. You can buy and sell anything you want on the Internet, including sex.\nInternet forums like Craigslist and Backpage allowed sex workers a space to sell their services\nnext to other legitimate commercial products. Sex workers could vet potential clients from the\nsafety of their homes. This eliminated a need for a pimp for protection on the street.\n\nSites like Craigslist have become online red light districts. Although anti-trafficking\ngroups claim that these sites support trafficking, their real harm is that they put sex work onto\nsuch a public forum. Real life red light districts like San Francisco's North Beach or New York\nCity's Times Square used to be areas where sex workers could maintain anonymity in their work\nby working alongside other businesses. Even though they were known to be areas where one\ncould go to buy sex you could also go there to buy anything else. When these areas became\ngentrified of streetwalkers, it only served to push the sex workers farther into the shadows and\nmake their work more dangerous. Instead of protecting the workers, by policing these public\nareas sex workers now have to work in private, \"illegal work only\" areas with no protection at\nall.\n\nThe term 'red-light district' is not, however, an unbiased term. By calling these sites\nonline red-light districts, the media has given them a sex work connotation, even if they sell\nmore than just sex. The term originated in the late 19th century by railroad workers who would\n\nleave a lit red lantern outside of brothels they visited so their coworkers could find them in case\nof an emergency. Today, it's meant to \"convey what we're to understand as a troublesome\ngrowth and spread of commercial sex, though little evidence is offered for this alleged upsurge\"\n(Gira Grant 2014:71).\n\nSurveillance\n\nThe sex work regulation industry has always been one that straddled the line between\nsurveillance for the protection of its participants and voyeurism. The protection, however, is\naimed at only a specific class of people, that being the 'general public' that does not engage in\nsex work. The sex workers themselves get none of the protection, even though the anti sex\ntrafficking groups often use sex workers as campaign tools to gain support. Anti sex trafficking\ngroups argue that surveillance of sex workers is the only way to ensure protection of those who\nmight be exploited. However as Melissa Gira Grant puts it in her book Playing the Whore \"such\nsurveillance isn't meant to expand the public knowledge of the lives of sex workers; it's to\ninvestigate some form of harm to the public that's believed to originate with them\" (Gira Grant\n2014:60).\n\nOn sites like Backpage.com, women would advertise pictures of their hair or breasts,\nsomething specific that they offered, rather than their faces to maintain anonymity and privacy.\nThis interfered with law enforcement's objective of surveillance. They too have benefitted from\nthe movement of the sex industry online because it's enabled easier gathering of data of\nprostitutes, pimps and victims of sex trafficking. In their Trafficking-Technology Nexus, Jennifer\nMusto and danah boyd suggest that instead of the State Department's current 4P method\n(preventing, protecting, prosecuting, and cultivating partnerships) we should follow a 4A\n\nmethod- awareness and visibility of online sites that promote trafficking, amassment of data, and\nadvancement of technological innovations in the form of automated or algorithmic techniques.\nThese methods would focus on protecting victims of sexual exploitation rather than blindly\npunishing everyone who posts a sex ad online.\n\nBut because forums like Craigslist were so public, anti sex trafficking groups moved in\non them and claimed that they were allowing and even promoting sex trafficking.\nThere have not been any concrete studies about how many victims of trafficking are posting\nonline versus legitimate sex workers. Some studies have been attempted and funded by anti sex\ntrafficking groups, but because there is no way to accurately differentiate between sex work and\nsex trafficking in online ads, the researchers are being paid to practice surveillance, much like\nthe johns that they're so adamantly against do.\n\nTechnophobia\n\nTechnology never exists in isolation- people's ideas influence what gets developed.\n\"Prostitution itself is a technology, a communication system, as much and at times more than a\nsystem for organizing sexuality\" (Gira Grant 2014:70-71). But saying that new technologies are\nencouraging of sex trafficking is just technophobia. The false idea was that \"The Internet makes\nsex for sale easier to see, so the Internet must be increasing the number of people who buy and\nsell sex-because now we see more of them\" (Gira Grant 2014:71).\n\nWithout a trafficker to blame, anti sex trafficking organizations blamed the publishers\nlike Village Voice (Backpage) and Craigslist. Petitions have claimed that, \"Village Voice must\nends its complicity in the rape and exploitation of girls and women...Craigslist...is the Walmart\nof sex trafficking...it is terrible that anyone is being sold\" (Gira Grant 2014:64). But what if that\n\nperson is choosing to sell themselves? By framing their argument against sex workers in general\nthese groups have proven their true objective of forcing sex workers to move out of public\nspaces, even if these public spaces are the Internet. They will cause widespread moral panic until\ntheir goal is achieved. \"Their anguish over advertisements has less to do with concerns for how\npeople in them might be treated in the course of their work and much more to do with expressing\ntheir own negative feelings about sex work\" (Gira Grant 2014:65).\n\nAll of the public shaming worked, and in 2012 Village Voice announced that anyone\nplacing an ad would need to use \"face shots\". This targeted the sex workers directly and made it\nimpossible for them to maintain privacy in their jobs. The consequence was not on Village Voice\nbut on the sex workers themselves. The editor stated, \"Many of us here at Voice wish that the ads\nwould just go away. There is not much doubt that the new rules are going to make us less\nappealing to this kind of customer. That is price we are willing to pay.\" There is no 'price' for\nVillage Voice or for the customer, but for the sex worker alone, who now has to weigh the price\nof public shaming and possible legal repercussions because their face is available to law\nenforcement versus the need to make a living and the desire to do so safely.\n\nAnti sexting advocates say that the Internet is to blame for the sexuality of youth. They\nargue that, \"For girls, a dominant fear is that the immediacy and ease of mobile media\ncommunication undermines their supposedly innate desires for chastity\" (Hasinoff 2012:453).\nThis puts all of the blame on technology, and on its female participants, not focusing at all on the\nmale participants or the importance of privacy and consent. The argument that teenage girls are\n'victims' of sexualization by the media removes all the blame from actual perpetrators of sexual\nviolence.\n\nYouth Ideas On Privacy\n\nThe policing of sex workers on the Internet and the idea that everything that is posted\nonline is inherently public is a difficult concept to teach to today's youth, who have grown up\nwithout such a massive divide between the digital world and the real world. Teens must balance\nwhat danah boyd calls watching (in the form of reality television) and being watched (social\nmedia). Participating in social media means that you are accepting that you are being watched,\nbut teens today do not see this as inherently bad. Being watched is a good thing; you can get\nattention and know that people are watching you. You also have control over what they see\nbased on what you decide to post. Social media means public-by-default, private-through-effort,\nand instead of trying to convince young people that social media is bad because they are being\nsurveilled, it would be more constructive to teach them, and their parents, about privacy in the\ndigital era.\n\nIn a 2014 study on young people's privacy norms and expectations, Amy Hasinoff and\nTamara Shepherd found that most young people expect the same privacy in online sexual\nsituations that they expect in sexual situations offline. New anti-sexual assault campaigns have\nsuggested affirmative consent as the only solution to remove any blame from the victim. If\nsexting legislation were to follow the same pattern, the burden is then shifted from the sexter to\nthe forwarder. Even though the respondents agreed that showing sexts is a violation of privacy,\nthey also said it was the senders responsibility to control their privacy, a discrepancy which is\nstill common in sexual assault myths that hold victims responsible. The message to young\nwomen is that they must protect themselves from Internet predators, contributing to the myth that\nstrangers are the most common perpetrators of sexual assault and blaming girls who produce\n\ncontent online if assaults do occur. The law should focus on resisting the impulse to blame\nvictims for privacy violations.\n\nOne of the main pieces of legislation regarding the Internet and young people, The\nChildren's Online Privacy Protection Act (COPPA), was signed into law in 2000, four years\nbefore Google went public and the Internet completely changed. But COPPA actually\nencourages parents to help their children lie about their ages online.\n\nThirteen is the age at which COPPA requires that a website obtain consent from parents\nbefore gathering user data. Because actual regulation would be too costly and not time effective,\nsites like Facebook include an age restriction in their terms of service, getting around the COPPA\nrule. Then the site assumes that its users are being truthful about their age. Young people aren't\nbeing educated about why these laws and exist, and neither are parents. All users should take\nmore responsibility about protecting their data, especially when it's sensitive, but instead of\neducating people about the Internet we've framed it as something to be afraid of.\n\nThere are so many different definitions of 'child' that it is hard to come up with anything\nconcrete. In the United States, a minor is anyone under 18, but the age of sexual consent varies\nby state, getting at low as 16. Childhood is marked by innocence and naivety. Therefore\nadulthood is defined by maturity, decision-making capacity, responsibility and agency. The UN\nConvention on the Rights of a Child defines a child as \"every human being below the age of 18\nyears unless, under the law applicable to the child, majority is attained earlier.\"\n\nIntent Means Everything\n\nThere is a huge disconnect between what is sexy, what is sexually explicit, and what is\nnon-sexual nudity. Conservative groups have tried to police the Internet, but the public is\n\nfighting back with campaigns such as 2014's \"Free The Nipple\" which called out the media for\nsexualizing female breasts and banning images of breast-feeding based on violations of content.\nWith minors, the question of sexy versus sexually explicit becomes more complicated. Some\nargue that \"any sexual depiction of a teenager, regardless of consent or the conditions of its\nproduction, contributes to the sexual objectification of children and thus promotes sexual\nviolence against them\" (Hasinoff 2014:106).\n\nThe intentions behind sharing sexted images are incredibly important for minors and law\nenforcement. Megan's Story is an educational video produced by ThinkUKnow, a child\nexploitation and online protection center in Australia. The video is about a 16 year old girl\nnamed Megan who experiences the stereotypical sexting-gone-wrong scenario of girl shares\npicture with boy, boy forwards picture to public, girl is publicly shamed and humiliated. The\ngoal was to \"stimulate discussion of...consequences of creating and sharing something in a\ndigital format\" (Albury and Crawford 2012:465). Instead of focusing on the sharer who violated\nMegan's trust, this video demonstrates the risk management model of sexual violence- putting\nthe responsibility on the woman to prevent assault from happening to them.\n\nCurrent Standing\n\nCurrently sexting legislation puts all the blame on young women. By punishing the\nfemale sexters so publicly, the media can escape the blame for the sexualization of youth. Instead\nof accepting that young people want to express themselves sexually using technology, we say\nthat \"modern sexual culture and technology...constitute the fundament of slavery, and traditional\nsex and gender roles...best encapsulate what it means to be 'free'\" (Bernstein 2007:134).\nProsecutors are choosing to charge young women with child pornography violations to teach\n\nthem a lesson, but is this a lesson about privacy or about what is an acceptable outlet of\nsexuality?\n\nCriminalization of young women's sexuality, moral policing, is more closely related to\nsexual expression than it is sexual violence. The central question should be consent, but right\nnow anti-sexting laws turn every sext into child pornography. Child pornography in the E.U. is\nreferred to as child sexual abuse images. This is a much better term than child pornography,\nbecause calling exploitation of children pornography criminalized pornography created by\nconsenting adults. It also enforces that these images are only illegal if they are created as\ndocumentation of sexual abuse, rather than documentation of consensual sex. Laws in the U.S.\nvary by state. The Pennsylvania law saws child porn is \"nudity depicted for the purpose of sexual\nstimulation or gratification of any person who might view such depiction,\" (Sacco 2010:11)\nplacing the blame directly on producers rather than consumers, no matter the original intent of\ncreation. The U.S. made two separate rulings related to child pornography, one in 1978 and\nanother in 1982. In 2002, however, in Ashcroft v. Free Speech Coalition the ruling \"suggests that\nchild pornography is exempt from First Amendment protection only because there is harm to a\nchild at the moment of production\" (Sacco 2010:16). Efforts to protect youth should not exclude\nthem from public life. In sexting cases, consent and intention must be a central focus of\ninvestigations before law enforcement gets involved.\n\nSensationalization has strongly influenced popular perception of sexting. News coverage\npresents sexting as teenage sexuality, youth rebellion, and online risk. \"Moral panic fueling and\nfueled by media constructions of sexting are themselves the product of determinations about\nwhat is, and what is not, the acceptable sexual speech of youth in general, and respectable female\nyouth in particular\" (Karaian 2012:60).\n\nConflating sexualization with sexuality erases female agency. As victims, they cannot\nmake any choices, but they also have the responsibility of solving the problem of sexualization\nby abstaining from 'sexually objectifying themselves,' which actually means doing anything\nsexual. When sexting is criminalized as child pornography it promotes the idea that female\nsexuality is to blame for sexual exploitation. Fighting against the objectification of women in the\nmedia is a great cause, but when one argues that the solution is conforming to a certain standard\nof sexuality, women lose their agency all over again.\n\nConclusion\n\"Discussing sexualization can be a distraction from the continuing challenge to promote sexual\nethics based on consent and pleasure and to apply this conversation to mediated sex acts like\nsexting\" (Hasinoff 2014:114). Legislators must focus on redefining child pornography to both\nempower victims of sexual abuse and give agency to young people experimenting sexually. The\nmedia is not something that we can hope to change, but we can prevent ourselves from being\npassive consumers with formal education. Women have always been over sexualized in the\nmedia; they have always been given contradictory messages telling them to act like a naive\nvixen. What has changed is that with social media, there is finally a way of seeing firsthand the\neffects of the messages sent to young women. Sexualization is not to blame for sexting--nor are\nyoung women the ones responsible for stopping improper sexting. The only way to move\nforward is a full reconstruction of educational methods that address young peoples' use of\ntechnology to express themselves sexually that focuses on privacy and consent.\n\nBibliography\nAlbury, Kath, and Crawford, Kate\n\n2012 Sexting, consent, and young people's ethics: Beyond Megan's Story.\n\nContinuum: Journal of Media & Cultural Studies 26(3):463-473.\n\nAgustin, Laura\n\n2007 What's Wrong with the Trafficking Crusade? Well-meaning interference? The\n\nPhiladelphia Inquirer, July 1:Op-Ed.\n\nAgustin, Laura\n\n2012 The Soft Side of Imperialism: Kristof and the Rescue Industry. Counterpunch\n\nMagazine, January 25:\n\nhttp://www.counterpunch.org/2012/01/25/the-soft-side-of-imperialism/\n\nAgustin, Laura\n\n2013 Prostitution Law and the Death of Whores. Jacobin.\n\nhttps://www.jacobinmag.com/2013/08/prostitution-law-and-the-death-of-whores/,\n\naccessed April 30, 2015\n\nBernstein, Elizabeth\n\n2007 The Sexual Politics of the \"New Abolitionism.\" A Journal of Feminist\n\nCultural Studies 18(3):128-151.\n\nBernstein, Elizabeth\n\n2010 Militarized Humanitarianism Meets Carceral Feminism: The Politics of Sex,\n\nRights, and Freedom in Contemporary Antitrafficking Campaigns. Signs: Journal of\n\nWomen in Culture and Society 36(1):45-71.\n\nBond, Emma\n\n2010 The mobile phone = bike shed? Children, sex and mobile phones. New Media and\n\nSociety 13(4) 587-604.\n\nboyd, danah, Casteel, Heather, Thakor, Mitali, Johnson, Rane\n\nHuman Trafficking and Technology: A framework for understanding the role of\n\ntechnology in the commercial sexual exploitation of children in the U.S. Microsoft\n\nResearch.\nboyd danah\n\n2011 Dear Voyeur, meet Flaneur...Sincerely, Social Media. Surveillance & Society 8(4):\n\n505-507\n\nboyd danah, Hargittai Eszter, Schultz Jason, Palfrey John\n\n2011 Why parents help their children lie to Facebook about age: Unintented\n\nconsequences of the 'Children's Online Privacy Protection Act'. First Monday 16(11).\n\nhttp://journals.uic.edu/ojs/index.php/fm/rt/printerFriendly/3850/3075, accessed April 12,\n\nboyd danah\n\n2011 Teen Sexting and Its Impact on the Tech Industry. Read Write Web2WAY\n\nConference. New York, NY, June 13.\n\nboyd, danah and Thakor, Mitali\n\n2013 Networked Trafficking: reflection on technology and the anti-trafficking movement.\n\nDialect Anthropol (2013) 37:277-290.\n\nBulger, Monica\n\n2014 Sexting, Minors and US Legislation: When Laws Intended to Protect Have\n\nUnintented Consequences. Internet Monitor: Platforms and Policy:\n\nhttp://medium.com/internet-monitor-2014-platforms-and-policy\n\nGira Grant, Melissa\n\n2014 The Debate and The Peephole in Playing the Whore: The Work of Sex Work. New\n\nYork: Verso.\n\nGordon-Messer, Deborah, Bauermeister, Jose Arturo, Grodzinski Alison, Zimmerman Marc\n\n2013 Sexting Among Young Adults. Journal of Adolescent Health 52(3): 301-306.\n\nHasinoff, Amy Adele\n\n2012 Sexting as media production: Rethinking social media and sexuality. New Media\n\n& Society 15(4) 449-465.\n\nHasinoff, Amy\n\n2013 Information and Consent. Selected Papers of Internet Research 14.0, 2013:\n\nDenver, USA\n\nHasinoff, Amy Adele, and Shepherd, Tamara\n\n2014 Sexting in Context: Privacy Norms and Expectations. International Journal of\n\nCommunication 8(2014):2932-2415.\nHasinoff, Amy Adele\n\n2014 Blaming Sexualization for Sexting. Girlhood Studies 7(1):102-120.\n\nKaraian, Lara\n\n2012 Lolita speaks: 'Sexting,' teenage girls and the law. Crime Media Culture 8(1) 57-\n\n73.\n\nLivingstone, Sonia\n\n2008 Taking risky opportunities in youthful content creation: teenagers' use of social\n\nnetworking sites for intimacy, privacy and self-expression. New media & society 10(3)\n\n393-411.\n\nMusto, Jennifer, and boyd, danah\n\n2014 The Trafficking-Technology Nexus. Social Politics: International Studies in Gender,\n\nState and Society 21(3) 461-483.\n\nSacco, Dena T., with Rebecca Argudin, James Maguire, Kelly Tallon\n\n2010 Sexting: Youth Practices and Legal Implications. Youth and Media Policy\n\nWorking Group Initiative, Berkman Center for Internet & Privacy, Harvard\n\nUniversity.\nStrangio, Chase\n\n2014 Arrested for Walking While Trans: An Interview with Monica Jones. ACLU\n\nApril 2: https://www.aclu.org/blog/arrested-walking-while-trans-interview-monica-jones\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21A.445J / WGS.272J Slavery and Human Trafficking in the 21st Century\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "21A.445JS15 Slavery & Human Trafficking - Weekly Memo 12, Student 4",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-445j-slavery-and-human-trafficking-in-the-21st-century-spring-2015/425062d3eb767ef5094fe2b05f553e37_MIT21A_445JS15_Memo12a.pdf",
      "content": "Legally a child, for general purposes, is defined as an individual below the age of 18. For specific\ninstances or circumstances this varies. For example, drinking age, driving age, age of consent, etc. may\nbe above or below the age of eighteen, with the age varying by country. In terms of maturity, or the\nability to make responsible decisions and bear responsibility for the consequences of those decisions or\nactions, I would say it varies by person. For example, in general, due to the way or rate at which\ndifferent genders develop, men can make more mature decisions later than women can start making\nmore mature decisions. But again, there are exceptions. So the question is at what age is the best to\ngeneralize and say 'on average, people cross this line into maturity at this age'? It is important to also\nnote that there is no 'maturity line,' where we wake up one day and would no longer constitute a child.\nAnd because of all of the above reasoning, then I would say sometimes children can make labor and\nsexual decisions, and sometimes they cannot. I do understand the logic of having some age boundary,\nwhich even while it may not be appropriate to everyone, would in general increase the safety of both\nsociety and the 'children.' But at the same time, it also severely limits individuals who are considered\nchildren and who are mature enough to make decisions such as how to sustain themselves. For\nexample, if a responsible child would like to be a sex worker to earn money because they are financially\nstruggling, and are not abused in the industry, I would say that is ok. But if this was legally endorsed, I\nthink we would have a similar problem like we do nowadays with non-child sex work, where children\nwho are abused in the sex industry will not be treated as victims, as in they would not receive the\nsupport they needed because society would think \"they brought it on themselves.\" Also, non-sex worker\nchildren who were sexually abused could be put into the category of sex workers, with all of the\naforementioned implications possibly preventing them from accessing resources.\nI think the current system might be the best, because victims of sexual abuse who are children can get\nsupport, while children who decide to go into the sex industry and are exploited will also get support (I\nthink) because they will be treated as a victim. I do recognize, however, that this makes work for child\nsex workers harder to come by due to the illegal nature of what they are doing.\nIn terms of labor not involving sex work, I definitely think children can make these decisions, so long as it\nis clear that the child is making these decisions and not the parent forcing them to make these decisions.\nI would say most labor doesn't pose ethical dilemmas, and so children can definitely make these\ndecisions if they choose to.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21A.445J / WGS.272J Slavery and Human Trafficking in the 21st Century\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "21A.445JS15 Slavery & Human Trafficking - Weekly Memo 4, Student 3",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-445j-slavery-and-human-trafficking-in-the-21st-century-spring-2015/59d2c02e54930c1cbb38cf9eb573b1df_MIT21A_445JS15_Memo4a.pdf",
      "content": "21A.445*\n\nWe\n\nek\nIn America (and as an American-born, American-\nly Memo #4\nnational view I have been privy to, through media reports,\nraised citizen\nlaws and government statements, personal interactions, etc.), t\ninstit\nhe idea\nutiona\n, this is the only\nof \"\nlized\nchea\nstereot\np and docil\nypes,\nand physically capable bodies is overwhelmingly tied to the idea of the \"Othered\"\ne\"\nimmigrant. The migrant worker in America is frequently conceptualized as\nwho submits to the responsibilities of his labor without objection, works jobs that no one\nspeaking, 20-50-year-old, racially \"Hispanic\" (often Mexican) man - a weath\na\ne\nnon\nred wo\n-Engl\nrke\nish\nr,\n-\nel\n\nse can or will, and, of course, is \"illegal.\"\n(and out of curiosity), I attempted to find\nAs an effort to confirm my perception of the American concept of the migrant worker\nInternet. The results are included below as scr\n\"proo\neenshots.\nf\" of this \"image\" o\ndescription I give above, and of course, bring up mor\nThey overwhelmingly suppor\nn the ever-impressive\ne questions.\nt the\n\nIn all of these images, the migrant worker is performing manual labor (farm\ncenturies. In the United States of America's colonial history, indigenou\nmost commonly) - an idea that has associated with \"Othering\" in Western dis\nwork,\nAfricans were enslaved because (this among many other similarly ridiculous justifications,\ns peopl\nco\nes\nur\nand\nse f\nthen\nor\nof course) it\nPseudoscience support\nwas considered \"\ned this b\nna\ny spreading propagand\ntural\" for these \"kinds\" of people to do this \"kind\" of labor.\nsociety, it seemed absurd that these Europeans had to perform grueling manual labor,\nsuperiority of white Europeans to all others. Given their\na th\neleva\nat \"pr\nted\no\np\nve\nosit\nd\" th\nion\ne bi\nin\no\ncol\nlogi\nonia\ncal\nl\ndoing\nwhen th\nit w\ner\nel\ne we\nl. In this\nre bo\nway, they wer\ndies at their di\ne d\nspo\ne\ns\nhumanized and reduced to bodies.\nal that were already doing that awf\nthere were many other issues at play here besides race - including, for example, an\nWe\nul wo\n(Of\nrk\nco\n-\nur\nand\nse\n\n,\nex\nToday, we continue to understand human trafficking, slavery, and other related crimes\ntraordinary language barrier, spiritual/religious differences between various parties, etc.\nthrough\n\nthe lenses of various identities and their intersections.)\nare se\nWomen, too, work in the fields. Their bodies, like the bodies of male migrant workers,\nsexualized. Women are therefore particularly \"useful\" tools to have, as they serve two\nen as objects, tools - but unlike their male counterparts, these bodies are often\npurpos\n\nes - manual farm work, and sexual favors (rapes).\n- they are domestic/private forms of labor, like childcare, cooking, and cleaning.\nThe other forms of labor available for migrant women are often gendered as feminine\nthe merchandising of human relations and the cohort o\nof a specific \"form\" of childcare, babysitting, Jose Luis R\nf\nocha\nservices\nwrites, \"Babysitters embody\nSpeaking\nHere,\nassociated with them.\"\nth\n\neor\n\ny\nw\no\ne\nf ali\nonce a\nenati\nga\no\nin\nn o\nsee the commodification of the worker - reminding me of Karl Marx's\nf labor.\n\nhave examined are considered \"illegal\" by many descriptions, \"undocumented\" or\nMigration complicates labor for a number of reasons. Many of the migrant workers we\n\"unauthorized\" by others, and even \"alien\" by some. Would we \"un-complicate\" the issue of\nlabor (specifically \"cheap and docile\" manual\nSummarized perfectly by Jose Luis Rocha with regards to workers in strawberry fields, the\nlabor) by legalizing these workers?\nissue is t\n\"The argument is that legalization programs only keep workers in agricultural\nhis:\noccupations for a while: as soon as they're ha\nThe sol\nppily l\nsystem: a good supply of workers who are undocumented keeps them captive in the\nleave agriculture for better paying jobs [...]\nut\nega\nion is t\nlized t\no st\nhey're very l\nick with th\nik\ne c\nel\nur\ny t\nr\no\nent\n\nlowest paying activities\n\nand those in which they're less susceptible to being detected.\"\n\nGoogle Image search: immigrant worker (first four rows of images)\n\n(c) Various copyright holders. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\nGoogle Image search: migrant worker (first images)\nStraw\nare \"1\nberry Fields and Undocumented Workers Forever?\nI found these particularly interesting, as the additional search terms Google s\n30s,\" \"Dorothea Lange,\" and \"Great Depression\" (\na\nr\ns\necalli\nuggests\nto which Rocha refers), and \"Mexican\" (which seems to right along with w\nwell\nng th\nas the\ne o\nJohn\npeni\nSt\nng o\neinb\nf Ro\neck\nch\nw\na's\nork\n\ns\nabo\nhat I discussed\n\nve)\n\n(c) Various copyright holders. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21A.445J / WGS.272J Slavery and Human Trafficking in the 21st Century\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "21A.445JS15 Slavery And Human Trafficking - Week 1 Response Memo",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-445j-slavery-and-human-trafficking-in-the-21st-century-spring-2015/3d2b05ea04bc7ca1c0a27f0e057e3fae_MIT21A_445JS15_Week1memo.pdf",
      "content": "WEEK 1 RESPONSE MEMO TOPIC\nNo written memo due this week. Instead, on Thursday bring in a current news article of your choice\n(published between January 2014-present) covering trafficking, slavery, and/or one of the topics from this\nclass. Topic is flexible--whatever interests you! What do you like or dislike about the reporter's approach\nand representation of the topic?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21A.445J / WGS.272J Slavery and Human Trafficking in the 21st Century\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "21A.445JS15 Slavery And Human Trafficking - Week 10 Response Memo",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-445j-slavery-and-human-trafficking-in-the-21st-century-spring-2015/a7b8abc68786cda94afd8520407ed110_MIT21A_445JS15_Week10memo.pdf",
      "content": "WEEK 10 RESPONSE MEMO TOPIC\nThink back to our unit on border policing (Week 5): Is the policing of sex workers different? If so (or if\nnot), how and why? How do people use, describe, and feel about technology, as it relates to sex work and\npolicing?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21A.445J / WGS.272J Slavery and Human Trafficking in the 21st Century\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "21A.445JS15 Slavery And Human Trafficking - Week 11 Response Memo",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-445j-slavery-and-human-trafficking-in-the-21st-century-spring-2015/87d84327bbd710552848f844a06eac8c_MIT21A_445JS15_Week11memo.pdf",
      "content": "WEEK 11 RESPONSE MEMO TOPIC\nOption 1\nReflect on The Urban Institute's \"LGBTQ Youth in the Sex Trades\" study, and other ethnographies we\nhave read in class, e.g. Mahdavi, Bernstein): How do researchers study sex work and sex trades? What do\nyou find interesting? What kinds of methods do you find significant, and what might you do differently\nwere you to conduct fieldwork-based research yourself?\nOption 2\nReflect on the technology & trafficking readings (\"Trafficking-Technology Nexus,\" \"The Peephole,\" and\nKristof NY Times article): How do people use, describe, and feel about technology, as related to the\npolicing of sex work and sex trafficking? How do we reconcile issues of online safety, with concerns\nabout data privacy and increasing surveillance?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21A.445J / WGS.272J Slavery and Human Trafficking in the 21st Century\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "21A.445JS15 Slavery And Human Trafficking - Week 12 Response Memo",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-445j-slavery-and-human-trafficking-in-the-21st-century-spring-2015/b93a8679c92bfada28ea28a0950f6199_MIT21A_445JS15_Week12memo.pdf",
      "content": "WEEK 12 RESPONSE MEMO TOPICS\nHow do we define 'child?' Can children make labor and sexual decisions? What are the risks?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21A.445J / WGS.272J Slavery and Human Trafficking in the 21st Century\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "21A.445JS15 Slavery And Human Trafficking - Week 13 Response Memo",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-445j-slavery-and-human-trafficking-in-the-21st-century-spring-2015/b5751678bb5d59b4b64138298a0b2029_MIT21A_445JS15_Week13memo.pdf",
      "content": "WEEK 13 RESPONSE MEMO TOPIC\nBring in the same news article you brought to class during Week 1. Be prepared to discuss how your\nunderstanding and interpretations of the story have changed or remained the same since the first time you\nread it. Based on the readings and analysis styles you've learned in class, now what do you like or dislike\nabout the reporter's approach and representation of the topic? What would you have done differently?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21A.445J / WGS.272J Slavery and Human Trafficking in the 21st Century\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "21A.445JS15 Slavery And Human Trafficking - Week 2 Response Memo",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-445j-slavery-and-human-trafficking-in-the-21st-century-spring-2015/877b2c957a09a46e51cd976b1748fbe4_MIT21A_445JS15_Week2memo.pdf",
      "content": "WEEK 2 RESPONSE MEMO TOPIC\nIn her famous speech given at Amherst in 1980, Audre Lorde said,\n\"The old patterns, no matter how cleverly rearranged to imitate progress, still condemn us to\ncosmetically altered repetitions of the same old exchanges, the same old guilt, hatred, recrimination,\nlamentation, and suspicion. For we have, built into all of us, old blueprints of expectation and response,\nold structures of oppression, and these must be altered at the same time as we alter the living conditions\nwhich are a result of those structures. For the master's tools will never dismantle the master's House.\"\nThis week we discuss slavery past and present--from Black slavery in the Americas and Caribbean, to\npre-colonial caste-based slavery in the South Asian subcontinent, to fears of \"white slavery\" during the\nturn of the 20th century. How do the different authors this week understand Age, Race, Class, and Sex,\nand how do they (if at all) understand intersections between categories of identity? (e.g. 'old, Indian,\npoor, male').\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21A.445J / WGS.272J Slavery and Human Trafficking in the 21st Century\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}