{
  "course_name": "Small Wonders: Media, Modernity, and the Moment: Experiments in Time",
  "course_description": "The “small wonders” to which our course will attend are moments of present time, depicted in the verbal and visual media of the modern age: newspapers, novels and stories, poems, photographs, films, etc. We will move between visual and verbal media across a considerable span of time, from eighteenth-century poetry and prose fiction to twenty-first century social networking and microblogging sites, and from sculpture to photography, film, and digital visual media. With help from philosophers, contemporary cultural historians, and others, we will begin to think about a media practice largely taken for granted in our own moment.",
  "topics": [
    "Fine Arts",
    "Media Studies",
    "Visual Arts",
    "Film and Video",
    "Humanities",
    "Literature",
    "Comparative Literature",
    "Fiction",
    "Periodic Literature",
    "Fine Arts",
    "Media Studies",
    "Visual Arts",
    "Film and Video",
    "Humanities",
    "Literature",
    "Comparative Literature",
    "Fiction",
    "Periodic Literature"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 1.5 hours / session\n\nCourse Description\n\nThe \"small wonders\" to which our course will attend are moments of present time, depicted in the verbal and visual media of the modern age: newspapers, novels and stories, poems, photographs, films, etc. We will move between visual and verbal media across a considerable span of time, from eighteenth-century poetry and prose fiction to twenty-first century social networking and microblogging sites, and from - sculpture to photography, film, and digital visual media. With help from philosophers, contemporary cultural historians, and others, we will begin to think about a media practice largely taken for granted in our own moment.\n\nCourse Requirements\n\nClass Format\n\nThis course offers a close examination of a coherent set of short texts and/or visual works. The selections may be the shorter works of one or more authors (poems, short stories or novellas), or short films and other visual media.\n\nReadings\n\nReadings are organized under the following topics: The Digital Present, The Lyric Present, the Pictographic Present, The Photographic Present, The Cinematic Present. Please see the Readings page for a list of Readings.\n\nMIT Statement on Plagiarism\n\nPlagiarism -- use of another's intellectual work without acknowledgment -- is a serious offense. It is the policy of the Literature Faculty that students who plagiarize will receive an F in the subject, and that the instructor will forward the case to the Committee on Discipline. Full acknowledgment for all information obtained from sources outside the classroom must be clearly stated in all written work submitted. All ideas, arguments, and direct phrasings taken from someone else's work must be identified and properly footnoted. Quotations from other sources must be clearly marked as distinct from the student's own work. For further guidance on the proper forms of attribution, consult the style guides available at the\nWriting and Communication Center\nand the\nMIT Website on Plagiarism\n.\n\nCalendar\n\nWEEK #\n\nTOPICS\n\nAugustine. \"Time and Eternity.\"\n\nUsing whatever media you have available in class today (pen and paper, chalk and blackboard, laptop, smartphone, etc.), take 5-10 minutes to document the present moment in time. What do you see and hear around you? What is the \"atmosphere\" like? What are you thinking and feeling at this moment? When you have finished, we will reflect on similarities and differences between accounts, and consider how and to what effect various media are used to record or evoke the passing present.\n\nThe Digital Present\n\nMayer-Schonberger, Victor. \"Of Power and Time - Consequences of the Demise of Forgetting.\" In\nDelete: The Virtue of Forgetting in the Digital Age\n.\n\nBell, Gordon, and Gemmell, Jim. \"Vision.\" In\nTotal Recall: How the E-Memory Revolution Will Change Everything\n.\n\nJameson, Fredric. \"The End of Temporality.\"\n\nThe Lyric Present\n\nSwift, Jonathan. \"A Description of the Morning\", \"A Description of a City Shower\", \"The Progress of Beauty\", \"The Lady's Dressing Room\", \"A Beautiful Young Nymph Going to Bed\", \"Strephon and Chloe\".\n\nHunter, Paul J. \"Journalism: The Commitment to Contemporaneity.\"\n\nColeridge, Samuel Taylor. \"Effusion XXXV\", \"Frost at Midnight\", \"The Nightingale\", \"This Lime-Tree Bower My Prison\", \"Dejection: An Ode\".\n\nWordsworth, William. \"Lines, Written a Few Miles Above Tintern Abbey.\"\n\nWordsworth, William. \"Residence In London.\"\n\nKeats, John. \"Ode to Melancholy\", \"Ode to a Nightingale\", \"To Autumn\".\n\nThe Pictographic Present\n\nSketches by Constantin Guys.\n\nBaudelaire, Charles. \"The Painter of Modern Life\", \"To a Passer-by\".\n\nKern, Stephen. \"The Present.\"\n\nThe Photographic Present\n\nImages from Eadweard Muybridge and Etienne-Jules Marey.\n\nBraun, Marta. \"The Expanded Present: Photographic Movement.\"\n\nCanales, Jimena. \"Introduction\" and \"Conclusion.\"\n\nBarthes, Roland.\nCamera Lucida: Reflections on Photography\n.\n\nThe Cinematic Present\n\nEdison, Thomas and Lumiere Bros.\nLandmarks of Early Film, Vol. 1\n.\n\nBenjamin, Walter. \"The Work of Art in the Age of its Technological Reproducibility.\"\n\nGunning, Tom. \"The Cinema of Attractions\", \"An Aesthetic of Astonishment: Early Film and the (In)Credulous Spectator\".\n\nVertov, Dziga.\nThe Man with the Movie Camera\n.\n\nCharney, Leo. \"In a Moment: Film and the Philosophy of Modernity.\"\n\nPresentations\n\nStudent Project Presentations\n\nStudent Project Presentations (cont.)",
  "files": [
    {
      "category": "Resource",
      "title": "Sketching the Present",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-325-small-wonders-media-modernity-and-the-moment-experiments-in-time-fall-2010/fc2a33d1faba1b3b7e893e82ad43f567_MIT21L_325F10_assn01.pdf",
      "content": "Sketching the Present\nCONTEXT\nConstantin Guys\nIn his essay \"The Painter of Modern Life\", Baudelaire\ncomments on Guys' artistic process. His drawings\ntake on the impression of sketches and reflect the\nfleeting nature of the present. This project attempts\nto prescribes a ruleset to this act of capturing the\npresent moment through a series of sketches.\nTehching Hsieh, Time Clock (April 11, 1980-1981)\nHsieh's performance year-long performance piece,\nin which he punches a time card every hour for a\nyear, illustrates a systematic representation of the\npassing present. He presents it as a documentation\nof his life. Similarly, this project serves as a record of\na day in the artists' lives, as shown through a series\nof moments taken in the present.\nCONCEPT\nThis project explores the question of how close one can come to capturing\nthe present through hand drawings. Sketches of the present not only offer\nreal-time information about the current moment, but also include the artist's\nown perspective at that point in time. Such drawings are then encoded with\na duality of information about the present. Consequently, a series of sketches\noffers the possibility of a comprehensive portrayal of both what the artist sees\nas well as insight into the artist himself.\nCONSTRAINT\n- Drawings will be made in blue or black ink on a 5.5 x 8.5-inch piece of\ndrawing paper, held landscape.\n- Drawings from all artists will be made at predetermined time intervals\nduring the same 24-hour period.\n- No drawings will be skipped, unless the artist is sleeping during that\nparticular moment.\n- The duration that the artist may spend on the drawing must fall within one\nto three minutes.\nCONSEQUENCE\nUpon execution of this project, a variety of observations on captuing the\npresent surfaced:\n- A comprehensive depiction of the present result from a balance between\ntime and detail. Spending time to capture the exact details of the present\nremoves the artist from the present, such that the image becomes only a\nrepresentation of the past. However, adhering to real time forces the\nremoval of detail at the discretion of the artist, and is a fundamentally\nincomplete description of the present.\n- The mere act of documenting the present creates a heightened awareness\nof the passage of time. Time, in some way, is experienced at a greater level\nof consciousness.\n- There is the dilemma of describing the present during the times set aside\nfor sleep. Is it possible to avoid this \"loss\" of the present? Perhaps the only\nsolution is to recover this time through another individual's record of the\npresent through his eyes. Even then, there is an inherent interpretation in\nthis record.\n- Though this iteration of the project does not contain the occurence of\nintersecting timelines (two individuals recording the same moment at the\nsame physical location), the notion of such intersections implies a larger\nnetwork of interwoven timelines that form the fabric of the present.\n21L.325\nNovember 29, 2010\nCREATION\nThe participants in this project include myself and a fellow student.\nOn Wednesday, November 17, 2010 each of us produced a drawing from our\nfield of vision every half an hour starting from 12:15am.\nMy Timeline\n\nHer Timeline\n12:15am\n12:45am\n1:15am\n1:45am\n2:15am\n2:45am\n3:15am\n3:45am\n4:15am\n4:45am\n5:15am\n5:45am\n6:15am\n6:45am\n7:15am\n7:45am\n8:15am\n8:45am\n9:15am\n9:45am\n10:15am\n10:45am\n11:15am\n11:45am\n12:15pm\n12:45pm\n1:15pm\n1:45pm\n2:15pm\n2:45pm\n3:15pm\n3:45pm\n4:15pm\n4:45pm\n5:15pm\n5:45pm\n6:15pm\n6:45pm\n7:15pm\n7:45pm\n8:15pm\n8:45pm\n9:15pm\n9:45pm\n10:15pm\n10:45pm\n11:15pm\n11:45pm\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.325 Small Wonders: Media, Modernity, and the Moment: Experiments in Time\nFall 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n."
    },
    {
      "category": "Resource",
      "title": "1000 Words is Nothing: The Photographic Present in Relation to Informational Extraction",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-325-small-wonders-media-modernity-and-the-moment-experiments-in-time-fall-2010/0aec6effd0246905ebb1f6118a410233_MIT21L_325F10_assn02.pdf",
      "content": "MIT Student\n1000 Words is Nothing:\nThe Photographic Present in Relation to Informational Extraction\nThe moment is a funny thing. It is simultaneously here, gone, and arriving shortly. We all\nexperience it continually, yet understanding what the moment actually contains troubles the\nminds of philosophers and scientists alike. The information encapsulated within each moment\nof our existence, and the best methods by which to extract that information, have served as the\ntopic of debate for the past several millennia. Plato, Descartes, Wordsworth, Muybridge, and\nBarthes have contributed to understanding the moment through the lenses of their respective\nfields, and it is through the these varied viewpoints' use of scientific analysis and critical\ninterpretation that the present and photographic moments may bear be understood.\nPlato was one of the first thinkers to consider the present moment as a window into the\nworkings of the world. He hypothesized that the sensory data inputted from the present may not\ncreate an accurate representation of the structure of the universe. In his works, he delineates the\ntrue nature of an object (called a Form) from its physical appearance (known as a Particular), and\nhypothesized that while Forms are reality, humans are only able to interact with the Particulars\nthat appear in their stead (Phaedo 37). In this way, humanity is only able to view degraded\nvisions of reality, and the present moment is unable to reveal the actual constitution of the\ncosmos. For this reason, Plato argues, that \"The soul of the philosopher utterly disdains the body\nand flees from it, seeking rather to come to be alone. (Phaedo 28)\" Therefore, the moments we\nperceive prove insufficient to properly elucidate the workings of the world, leaving humanity\nunable to inductively comprehend natural phenomena. Plato argues that extracting information\nfrom sensory data is futile; the moment (from an informational standpoint) is useless, and\nknowledge can only be derived through rationalism.\n\nThis problem echoed through philosophy, and was again addressed in the 17th century by\nRenee Descartes. Descartes uses a separate (and far more robust) line of reasoning to arrive at\nhis argument against using sensory information to understand the world. He states that, \"How\noften, asleep at night, am I convinced . . . that I am here in my dressing gown, sitting by the fire,\nwhen in fact I am lying undressed in bed! . . . As I think about this more carefully, I see plainly\nthat there are never any sure signs by means of which being awake can be distinguished from\nbeing asleep. (Meditations 1)\" Descartes attempts to justify his beliefs and opinions in light of\nthis dreaming argument, but his inability to find an absolute natural cornerstone upon which to\nbuild a theory damns his search for certitude. Only able to establish his own existence, \"cogito\nergo sum\" is the sum of seven Meditations worth of work. The moment, the true, unadulterated\nmoment, appeared to be forever hidden from our purview.\nDescartes's writing appeared to forever distort the moment into complete subjectivity, making\nany information within it undiscoverable. The fact that this essay is currently stored on a\nmachine capable of calculating the orbits of all eight planets to an accuracy of 0.00001% ,\nhowever, serves as an apparent contradiction to claims of informational ignorance. Humanity\nhas, in spite of Descartes' remonstrations, extracted enough data from the moments it viewed to\nsplit the atom, send men to the moon, and describe the fundamental forces that govern the\nuniverse. This paradox of accomplishment in the face of uncertain information does not\ndisprove Descartes' conclusions. Descartes remains correct that it is impossible to be sure of any\nspecific information, but certainty is not necessary for the technological achievements of the past\ntwo millennia. By observing the natural world, finding correlations, and analyzing empirical\nevidence, the imperfect data sets gathered through our interactions with the visible world have\n\nallowed for these feats. Science embraces the precept of incompleteness, tames the ambiguities\nof the moment, and forms the provisional truths that allow for all that man has created.\nScience's ideas on empiricism did not come without its detractors. The latter half of the 18th\ncentury contained a movement that fought against the deductive concepts of the scientific\nmethod. Known as the Romantic period, those involved fought against the idea of analyzing and\nquantifying all of the natural world (\"Romantics\"). The Romantics argue that the objectification\nof the moment removes its inherent wonder; raw, unfiltered emotion is the best method to\nacquire knowledge. William Wordsworth exemplifies the mindset in his poem \"The Tables\nTurned.\" In it, Wordsworth argues for the reader to \"quit your books\" and cease attempting to\nextract information via logical deductions and observation. Instead, he contends that interacting\nwith nature \"may teach more of man . . . than all the sages can.\" He questions humankind's\nintellectual ability to understand the moment via reasoning alone. According to Wordsworth,\n\"[nature] has a world of ready wealth,/Our minds and hearts to bless--/Spontaneous wisdom\nbreathed by health/ Truth breathed by cheerfulness.\" Nature spontaneously transfers information\nwhen viewed; the moment need not be analyzed, only experienced, in order to learn. The raw\nemotive force arising from communing with nature is, in Wordsworth's opinion, enough to\ninform. Wordsworth claims \"Our Meddling intellect/Mis-Shapes the beauteous forms of things\n(\"The Tables Turned\").\" He fights against what he feels is the corruptive force of science and\nempiricism on the inherent beauty of the world, and argues that the present moment need not by\nanalyzed to be appreciated.\nMany of the Romantic notions of discovery in the moment are paralleled in the writings of\nRoland Barthes. In his essay \"Camera Lucida,\" Barthes elucidates the method by which he\nanalyzes a photograph for meaning. He begins by establishing two separate properties inherent\n\nto photographs, known as the studium and punctum (Camera Lucida 27). The first is the overall\nimpression that the photograph imparts to the viewer. Much like the \"vernal wood\" of\nWordsworth, this impression serves as a necessary backdrop for the understanding of the\nphotograph. Unlike nature, however, the studium requires that the viewer bring preconceived\nnotions to the photograph. Barthes makes clear that the studium serves as an \"extension of a\nfield, which I perceive quite familiarly as a consequence of my knowledge, my culture (Camera\nLucida 26).\" It is only through this previously-held information that Barthes is able to decode\nthe information within the photograph, and bring to life the moment captured on camera. This\nintegration of information with the photographic medium produces the overall initial impression\nfor the viewer, and serves as the first \"moment\" of interacting with the work.\nBarthes then describes his conception of the punctum. Resonating perfectly with the\nRomantic conceptions of intuition, he states that \"it is not I who seek it out. It is the element\nwhich rises from the scene, shoots out of it like an arrow, and pierces it to me (Camera Lucida\n28).\" The punctum is a raw emotive response to the photographic stimulus; it requires no\nprevious knowledge, and forces its presence upon the viewer. It is the same \"spontaneous\nwisdom\" that Wordsworth praises. It is the punctum that Barthes describes as being necessary\nfor a photograph to truly touch him, and it is the punctum that forces the attention of the viewer.\nIt is the interactions of these two elements, that allows for the extraction of emotional meaning\nfrom photography.\nThe empiricists are not without their own champions in photography. As Marta Braun\nexplains in Beauty of Another Order, scientists were quick to utilize photography as a method of\ndata extraction, since this \"instantaneous photography of moving objects established a world that\nis unavailable to our vision--a world beyond the reach of our senses (Beauty 150).\" For the first\n\ntime, dynamic systems could be frozen in time and inspected, allowing for the elucidation of\npreviously unknown mechanics. It is by this method Edward Muybridge established that, during\ngalloping, horses at one point have all four hooves on the ground, and Etienne-Jules Marey\nphotographed the progression of avian flight (Beauty of Another Order 154). The photographic\nmoment therefore also can contain physically relevant data; just like the present moment, the\nphotograph moment yields insights into the interactions of the world.\nDescribing, analyzing, and quantifying the moment has led to the perpetual frustration of those\nattempting the feat. Plato rejected the sensory present entirely, Descartes showed the\nimpossibility of certainty in those same sensory inputs, science demonstrated the power of\naccepting that ambiguity, and the romanticism challenged science's hold on discovering meaning\nin the moment. The photographic present mirrors these complications; photography illuminates\npreviously undiscovered physical phenomena just as well as it can produce an emotional\nresponse from its viewers. The current informational valuation of a picture at 1000 words is an\nunderstatement; the photographic moment, just like the present moment, is able to yield\ninformation about the world we inhabit, and serves to increase our understanding of both\nourselves and the world around us.\n\nWorks Cited\nBarthes, Roland. Camera Lucida. New York: The Noonday Press, 1981.\nBraun, Marta. Beauty of another Order: Photography in Science. New Haven: Yale University\nPress, 1998.\nDescartes, Renee. Meditations on First Philosophy. Ed. Louis Pojman, Classics of Philosophy\n2nd Ed. New York: Oxford University Press, 2003.\nPlato. Phaedo. Ed. Louis Pojman, Classics of Philosophy 2nd Ed. New York: Oxford\nUniversity Press, 2003.\nSchwartz, Robert. \"The Romantic Era.\" Mount Holyoke College. 2 December 2010.\n<http://www.mtholyoke.edu/courses/rschwart/hist255/jkr/romanticism.html>.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.325 Small Wonders: Media, Modernity, and the Moment: Experiments in Time\nFall 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}