{
  "course_name": "Social Theory and the City",
  "course_description": "This course explores how social theories of urban life can be related to the city’s architecture and spaces. It is grounded in classic or foundational writings about the city addressing such topics as the public realm and public space, impersonality, crowds and density, surveillance and civility, imprinting time on space, spatial justice, and the segregation of difference. The aim of the course is to generate new ideas about the city by connecting the social and the physical, using Boston as a visual laboratory. Students are required to present a term paper mediating what is read with what has been observed.",
  "topics": [
    "Social Science",
    "Anthropology",
    "Social Anthropology",
    "Sociology",
    "Urban Studies",
    "Social Science",
    "Anthropology",
    "Social Anthropology",
    "Sociology",
    "Urban Studies"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 2 hours / session\n\nCourse Description\n\nThis course is a research seminar in which students will share their own work in order to stimulate their thinking about the relation between social theories of urban life and the city's architecture and spaces. Class discussion will be grounded in classic or foundational writings about the city addressing such topics as the public realm and public space, impersonality, crowds and density, surveillance and civility, imprinting time on space, spatial justice, and the segregation of difference. Students are required to develop their own theoretical approach to their research and must present a work in progress to stimulate class discussion. These presentations will make up the majority of the course.\n\nRequirements\n\nStudents are required to attend every class and complete any assigned readings before the class in which they will be discussed. The success of the course depends on the contribution of students in discussing and evaluating the ideas presented by their peers. Coming to class prepared is essential. There are two principal requirements on the basis of which students will be evaluated:\n\nResearch paper and presentation.\n\nParticipation in class discussions.",
  "files": [
    {
      "category": "Resource",
      "title": "felix_1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-329-social-theory-and-the-city-fall-2005/d4054a039570f4c1ccbaf1c2eb8476d8_felix_1.pdf",
      "content": "Elliot Felix\n14 September 2005\n11.329 Social Theory and the City\nBetween Center and Edge.\nThe experience of the city through a subway system is fragmentary. Disassociated from\nthe light, orientation, and mnemonics above, subterranean transportation environments\ncompel us to experience the world as discrete stops. As motivations vary, so do our\ndestinations. Over time, the result is a kind of mental mapping of the city in network of\nloosely-related nodes, each formed in concentric circles that are sized by how far we need\nor want to venture out. Activity, habit, and happenstance help construct this network, but\nour experience is structured through an understanding of centers and edges. Some of the\nmost interesting experiences in the city result not from our clear understanding of these\nterms, but from a kind of a productive ambiguity which situates us somewhere between\ncenter and edge. In this in-between zone, we are active interpreters of the city.\nOn a subway map, each stop is a point, a point around which activity, people, and\nmemory pivot. As such, it is a center, one that may have both centripetal and centrifugal\nforce. But, with all that is revolving around it, this point has a sphere of influence; for\nexample, communities can forge their identities in reference to subway stops and\nneighborhoods form around them. Thus, just as the 'center' in political terms connotes a\nzone of opinion, a center may also describe an area - an area that could be presence,\nabsence, or anything in between. And as in biology, a center can also express a grouping\nof elements, implying a less rigid set of geometrical relationships. So, though its\nhierarchy might be clear, a center may have area or none at all, may be a beginning as\nwell as an end, and may be defined or nebulous.\nAs with centers, edges have an embedded ambiguity and a reflexive definition. An edge\nmay be the boundary of something as well as that incisive quality which penetrates such a\nlimit. On the subway, an edge might equally be a terminus station or one's comfort zone\n\naround a particular stop. So, an edge can be both a border as well as zone adjacent to one\nIt can even be the condition of occupying such a zone, in the case of being 'on edge.' An\nedge may also be the difference between two things - or more commonly, people - as\nwell as the line dividing them. It is a term replete with ambiguity, both in the abstract as\nwell as in application.\nThe relationship between center and edge is as intertwined and multivalent as the\nindividual terms. Center as zone requires an edge. Where center stops and edge begins is\nthe crux of the conundrum, and this is a function of context, memory, and perspective. A\nsubway stop can just as easily be defined as the territory from which entry is visible as it\ncould in the physical barriers or property boundaries defining the stop. Interestingly, once\na number of stops or centers are considered, their areas might overlap and intersect as\nwave patterns in ponds do, producing new zones that may be center, edge, or neither. So,\nan edge may define a center, it may be a center, and it may interact with other edges to\nproduce new centers.\nIf experiencing the city can be thought of as the search for centers and edges, then\nambiguity between them forces us to play active roles in the formation of this experience.\nWhen the conditions are clear - at water's edge, at the center of a plaza, or below a\ndome's oculus - we are passive observers of the environment. But, if for example after\nremoving the subway's blindfold and venturing into the city, we force ourselves to infer\nconnections between disparate experiences, to find legible edges and transitions, and to\ndefine our own centers and edges, then we discover and construct the city for ourselves."
    },
    {
      "category": "Resource",
      "title": "foxe_1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-329-social-theory-and-the-city-fall-2005/28c1049873a8d96a44b54a4a7da30980_foxe_1.pdf",
      "content": "David M. Foxe\nSocial Theory and the City\nProf. Sennett\nAssignment 1\n10 September 2005\n\nThe difference between the center and the periphery is primarily characterized by\nproximity and circumference. A place which is determined, designed, or\ndescribed as a center in its purest form reduces to a point with zero\ncircumference, a location, a concentrated place. This decreasing circumference\nmeans that being at the center means being inherently proximal, being close to\neverything and everyone else at or near the center.\n\nMeanwhile, that which is designated as the periphery constitutes a group of\nplaces arranged outward, expanding to a large circumference. It is not a single\nlocation but rather many locations at distance from one another, a distribution.\nThe periphery is relative to a particular center, but one may conceive paths which\npass from point to point among locations within the periphery without traversing\nthe center.\n\nBoth the center and the periphery are referential, however, in that they are\nrelative to the viewer's perceptions. Being very close to the center within one\nframe of reference could seem highly peripheral if the frame of reference\nbecomes much more narrowly defined. At one point in time a place that seems\nhighly peripheral based on the speed of transport, the geography, or the means\nof communication, might change in time so that that same place could be\nconceived as not nearly as peripheral; the gradient of centeredness is fluid in\ntime and in its perception. This is particularly evident with respect to\ncircumferential paths or fortifications that ring a settlement; they are frequently\nconcentric with human habitation at one time having been consistent with a\nparticular outer (peripheral) limit, but with development or habitation at another\n(often later) time being pushed out beyond the wall, road, or moat, so that the\ncircumferential path is expanded to define a new outer periphery.\n\nI believe this spatial organization does not necessarily correlate with hierarchical\norder, however. The center's importance, relevance or popularity, frequency or\nactivity, meaning or interest relative to the periphery should not be assumed to\nbe greater. While traditional theoretical models of urban settlement (and of\nhumans' belief structures and countless other aspects of life) may require a\ncentered point or idea to orient the relationships therein, it is entirely possible for\nthat which is understood as peripheral to nevertheless encompass and include\nsufficient importance and relevance, of people, places, and resources. In this\ncondition the center can become correspondingly irrelevant, abandoned, or\nvapid, a black hole. The ever-increasing geometric area of the extense periphery,\nand the correspondingly intense but spatially limited center, mean that the\nperiphery can quickly eclipse the center in capacity and range of possibilities. If\n\nthe desire for a single place of physical proximity (a center) is not great, the\ndistributed arrangement within the periphery becomes a given and normative\nrelationship. This poses the question of whether proximity to the center is\nrelevant to the periphery given the many hierarchical possibilities\n\nThis is the challenge taken up by a polynuclear conception of community\nstructure, urban form, and human relationships therein. Such a network, which is\nbased upon the presence of multiple centers within the chosen field of view,\nallows for a distributed sea of peripheral \"stuff\" punctuated by identifiable centers.\nThis enables the periphery to be understood as highly differentiated, with places\nand inhabitants having simultaneous relationships to many different points of\nfocus rather than maintaining a feudal tether to a single particular center. This\ndoes not negate the importance of proximity, but rather articulates the distinction\nbetween the center and the periphery as a continuum of multiple proximities. This\ncontinuum therefore exists between having a single idea, point, or place as an\nexplicit, proximal focus at the center, and having a variety of polyvalent\npossibilities in various proximities as potential foci at the periphery.\n\n11.329 Social Theory and the City, Exercise 1\nAssigned: Session 1; Due: Session 2\nWhat is the distinction between center and periphery?\nGenerate no more than 2 pages of theoretical writing on the above question without citing any sources or\nusing any real-world examples. Do not fall into the trap of comparing and contrasting in a descriptive essay\nbut rather develop a theoretical argument to answer the question. The objective of this exercise is for you to\nexplore your own thoughts and assert yourself in the theoretical realm without hiding behind someone\nelse's ideas."
    },
    {
      "category": "Resource",
      "title": "moga_1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-329-social-theory-and-the-city-fall-2005/f98800ce788b84cf309281ea92b3c70d_moga_1.pdf",
      "content": "11.329 Social Theory and the City\nExercise 1: Center and Periphery\nSteven T. Moga\nSeptember 13, 2005\nUrban planning's concern with concepts of center and periphery relates to the spatial\nrelationships between elements of urban form and how these elements are perceived by people.\nThese concepts can be applied to the scale of the region, the city, and the district. This brief\ndiscussion focuses on notions of city center and periphery.\nAt the scale of the city, physical elements of the urban environment include buildings,\nneighborhoods, commercial and industrial areas, natural features, schools, pathways and\ntransportation routes, open spaces, and myriad other components. The difference between center\nand periphery is a difference of location within the geographic area of the city and of spatial\nrelationships.\nThe center represents the concentration of particular social, economic, political, and cultural\nactivities. The periphery, in contrast, is defined by distance from the center, physically, socially,\nor economically. As such, center and periphery are linked by an understanding of what is, and\nwhat is not, central to economic relations, cultural life, and/or political power.\nCity center and periphery are often defined by architectural expressions, symbols in the built\nworld. These fixed elements, as material forms, represent what takes place in a certain space and\nwho belongs there. Thus, the glass and steel towers of the twentieth century downtown express\nthe city center as a concentration of corporate power, while at the same time serving as a symbol\nof the city as a whole, as a skyline. The periphery is the edge, where the city meets ocean or\nmountain, or where it physically unwinds and scatters out. From here, one may be able to view\nthe center while at the same time one has a sense of being distant from it. In this way, symbols\nare used to reinforce notions of power.\nHowever, centers are not always expressed with the blunt visual force of the skyscraper or the\ncorporate downtown. Centers of activity or culture or economy may be expressed in other forms-\nin civic monuments, in public spaces, in infrastructure- or they may be hidden, or only known to\nprivileged few. As such, the meaning of center and periphery differ based on perception. These\n\nperceptions may differ by individual or by group, based on understandings of what is significant\nand where it occurs.\nAnd although built forms encourage, celebrate, or privilege certain activities over others, cultural\nforms can be independent of architectural forms. Thus, people, unlike buildings and other fixed\nmaterial features can move across urban spaces, across neighborhoods and commercial districts,\nbetween public and private spheres. One may travel from one part of the city to another and\nhuman activity may be distributed across space in ways that are not necessarily reflected in the\nbuilt form. Understanding the city in this way requires an understanding of culture and social\nrelations. The downtown skyline may symbolize one sort of center, while a park or plaza or even\na basement or a garage may be a center, too.\nConcepts of center and periphery can also stand for cultural understandings of what it means to be\nan insider versus and outsider. While the insider may have a good idea of what activities take\nplace in the center, this view may be particular or short-sided. In a crowded public place, for\nexample, being at the center may mean being surrounded by others, but unaware of what the\nlarger crowd is doing. The view from the periphery may yield a better understanding of the\ncrowd and the place. In this way, too, center and periphery are linked together. The state of\nbeing an outsider is defined by the fact that others are insiders.\nConcepts of center and periphery appear and reappear in the realm of planning practice, in studies\nof land values, open space, economic agglomerations and firm location, and public space. As\nplanners, we might reconsider how these terms are employed and what connotations they carry."
    },
    {
      "category": "Resource",
      "title": "oles_1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-329-social-theory-and-the-city-fall-2005/1e699249c17b35b584b343550a159315_oles_1.pdf",
      "content": "Thomas Oles, 11.329, 13 September 2005\nRationally we know that no single point in space is more or less central than any other. The nuclei of the\ncells that make up our own and every living body; the fixed points of our settlement on the land; the earth\nwhere we build these settlements; the sun around which this planet will turn for the length of human\nhistory--none is truly a 'center' of anything. We are adrift on an infinite windless sea that is older than the\nuniverse.\nAnd yet this knowledge leaves us cold. Another knowing--that of our hearts and of our bodies--\ntells us that there is ground both more and less integral to the unfolding of our own lives or to the life of our\nsocieties. In the broadest sense this deeper knowledge of centrality issues from encasement in our own\nflesh, from the unique human awareness of mortality: the arc of our lives describes the only center we\nfinally can know. Empiricism be damned, the universe goes forth from the origin of consciousness in the\nself. The periphery is that realm--psychic, physical, temporal--most distant from the prison of our own\nsubjectivity. Where I am is always, ineluctably, the center of the world.\nEven if right, this does not help us either. Surely centrality is a matter not of solipsism but of its\nopposite: we know certain things as centers and other things as edges because others in a particular place\nand time know or have known them in the same way, and because we talk to each other. It is through\npersonal and social dialogue (not always with the living) that we invest space with degrees of centrality or\nliminality by imbuing it with experience and memory. In doing so, we make places. From megacity to\nstone cairn, a place is always a center and vice versa: like consciousness itself, it marks that point from\nwhich all the world falls away.\nThe making of places cannot be separated from the processes of building and representing form.\nBoth the fence around the graveyard and the city boundary drawn on a paper map are formal acts. But a\nmore capacious notion of centrality must always admit of change, history, and social ecology. Unlike\nconsciousness, fixed always at the point of the body in space, centers move, become peripheries, become\ncenters again, then vanish entirely. A place forgotten in the life of a society is no longer a center even\nwhere its formal delineation in space persists.\nOur definition of center and edge must therefore both engage and transcend form. If the body is\none such formal trap--the illusion of a single point of origin--assuredly the city itself is another: 'center' is\ntoo often rooted in an atavistic mental picture of walled redoubt in a hostile landscape. While clearly\n\ncentrality has much to do with our ability to see things as distinct from other things--to distinguish figure\nfrom ground, fenced settlement from land around it--we must think of centrality in ways that do not\nprivilege this visual information. To that end I propose an alternative notion of the center grounded not in\nwhat is seen but rather in what is overheard:\nCenters are places of displaced dialogue; they are places where, eavesdropping, we understand.\nWhat is more, we do not have a choice in the matter: in the center we are forced--whether by dint of\nphysical proximity or social convention--to attend to the voices of others. Whether at a headstone or in the\nmiddle of a city, it is impossible to turn away from these voices, whether of strangers or friends, even\nwhere the body itself recoils. The degree to which we do not understand--and thus find it possible to turn\naway in confusion or disgust--is the degree to which a place may truly be said to be peripheral or strange.\nIn contrast, the center is that place where we have no choice but to admit the overheard voice into the\nprison of our own consciousness; that place where we become most aware of the conditionality of our\nown solipsism and, in doing so, come closest to transcending it. The center is therefore the place of\nempathy amid indifference."
    },
    {
      "category": "Resource",
      "title": "sawhney_1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-329-social-theory-and-the-city-fall-2005/e7417d6176de7e7a730e4001d82c4feb_sawhney_1.pdf",
      "content": "11.329 Social theory and the City\n\nAssignment 1 ..Nomita Sawhney.. September 14, 2005\n\nThe centre vs. periphery\n\nThe creation of a point which acts as a concentration of purposes and rituals\n\nforms a nodal point of interaction and encounter. This point in an abstract space\n\nbecomes a concentration of many activities which are timed to exist in different\n\ntimes but exist within the same spatial confines. These activities could be located\n\nin different locations but for some reason they chose to co-exist at this one point.\n\nThe point acts as a magnet to form and shape. And it creates a diversion\n\nin other forms to become a point of heightened magnified intensity. Due to its\n\nacquired high intensity it becomes a centre. Controlling authority through its aura\n\nand not its position in space.\n\nIn the nature of its charisma it attracts many formations which become\n\nattuned to the new possibility of being a part of a conglomeration of activity and\n\na centre. Perceived from an external point of view the centre becomes a\n\nwhirlpool of events and a spontaneous projection of uncoordinated rhythms which\n\nhave an orchestrated harmony. They are all interconnected in a mass of apparent\n\nconfusion but yet seem to have an intrinsic sense of harmony which may not be\n\napparently visible. This series of interconnections in abstract forms which may be\n\ninvisible creates a sense of a whirlpool of nothing or the presence of everything.\n\nThe presence of everything and the interconnectedness of formations in a complex\n\nharmony create a power of control and a sense of a centre for the system.\n\nThe existence of the edge becomes a point of flight.\n\nThe periphery becomes an outward projection of the settled system which has no\n\nneed to be positioned in a central location. To say that it exists by itself is\n\ncontradictory as the reason for its nature of existence is a constant connection to\n\nthe centre which it cannot function without.\n\nThe requirement to connect to a centre is imperative for its\n\nexistence. The periphery cannot exist without the centre.\n\nThe peripheral existence of a system of flows also has a need to act as a\n\nbase of encounter for the outside. It mediates a common ground between the\n\nexternal system and the centre, acting as a bridge or a restricted border.\n\nAs the condition applies to a system, the bridge acts as an in-between product of\n\nthe external and the internal system. Acting as a common ground of activity and\n\nembodying the character of both worlds (external and centralized). This also spells\n\na myriad confusion of intensity co-existing with an external system of flows\n\nwhich have reduced intensity. Creating a system of where any system can exist.\n\nThus the periphery spells a position in space which has the possibilities to reject\n\nthe centre or accommodate it and have a strong spatial and spiritual connection to\n\nits being. The rejection of the centre shall create a possibility where the systems\n\nin the periphery become an opposite to the centre. Bearing only physical linkages\n\nto the centre but creating a mass of encounters which become an anti space to\n\nthose established in the centre, creating a restricted set of events of its own."
    },
    {
      "category": "Resource",
      "title": "touloumi_1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-329-social-theory-and-the-city-fall-2005/039da9a76723deb588d64642aa8631f7_touloumi_1.pdf",
      "content": "11.329 Social Theory and the City\nProf: Richard Sennett _ Fall 2005\n\nOlga Touloumi\nH.T.C. S.M.Arch.S Candidate\n\nExercise 1\nWhat is the distinction between center and periphery?\nGenerate no more than 2 pages of theoretical writing on the above question without citing any sources or\nusing any real-world examples. Do not fall into the trap of comparing and contrasting in a descriptive essay\nbut rather develop a theoretical argument to answer the question. The objective of this exercise is for you to\nexplore your own thoughts and assert yourself in the theoretical realm without hiding behind someone\nelse's ideas.\n\nThe terms center and periphery appear frequently in discourse about the urban\nfabric. Their usage is usually constrained to their geometrical position in space. Every\ncenter is defined towards its periphery. Departing from this exact geometrical point, one\ncould say that a center is defined by a periphery that encompasses it, and, simultaneously,\nthe presence of a periphery immediately implies a center. Observing carefully the\nevolution of the geometrical center and the functions it historically hosted, an association\nwith the display of power and the empowered class is revealed. In ancient Greece the\ngeometrical center of the city coincides with the marketplace as a public (demos) space of\ndecision making, in the medieval era the city's center is occupied by religious functions\nas monasteries and churches, while the early twentieth century city center circulates\naround a central square with City Hall.\nThe role of both center and periphery changes through history, nonetheless\nremaining in close relationship with their spatial context. It is only recently that the\nintroduction of the terms \"centralized periphery\" and \"marginalized center\" provided the\ngrounds for the unchain of the terms center and periphery from their geometrical place\nand opened the discussion on them as basic theoretical concepts. How can a periphery be\n\ncentralized and vice versa? What does this inversion imply about the distinction between\ncenter and periphery?\n\nThe discourse on the \"centralized periphery\" indicates a shift of interest from the\ncenter to the periphery. Centralized is used so as to accentuate an on-going desire towards\nthe center, or, to be more precise, towards the milieu of the center. Center, and thus\nperiphery as well, turns out to indicate more than a location. The spatial center in the\nhistory of Western cities functioned mainly as the site of political discourse where\nsovereign power was launched and displayed. One could claim that this is the essential\ncharacteristic that maintained even in the discussion about a \"centralized periphery\". The\ndesire towards the center is a desire towards the display of power, power per se and the\npractice of control. Periphery emerges then as the milieu where power is displayed\nthrough its phenomenological absence. Thus, periphery becomes essential to the\nexistence of the center as the threshold of this power, the threshold of the center. It bears\nthe trace of the difference; it is the \"other\" necessary for the center's identity and\nfunction.\n\nWith the \"centralized periphery\" and \"marginalized center\" inversion, center and\nperiphery continue to bear this difference in power as their distinctive mark. The notion\nof the center appears dislocated from the shrunk city-center and re-located in the\nsprawled periphery, as a trace of the center-desire. The periphery becomes now\ncentralized as it offers the space for an absolute control of the boundaries of the private\nsphere and the taming of the public through its interiorization. The unexpected, the\ndangerous, will take place elsewhere; either in the city-center, or in the vast void of the\nperiphery."
    },
    {
      "category": "Resource",
      "title": "whitlow_1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-329-social-theory-and-the-city-fall-2005/6d6843e870899a17a52c2bbb70aa4863_whitlow_1.pdf",
      "content": "11.329 Social Theory and the City\n\nAnnis Whitlow\nAssignment 1\n\nQ. What is the distinction between Center and Periphery?\n\n'Center' and 'periphery' exist in a spatial relationship that can be metaphorically\napplied to social relationships. In the context of urban landscapes, where social dynamics\noverlay spatial relationships, understanding the distinction between center and periphery\nrequires consideration of both the literal and metaphoric. In fact, because social\nrelationships can actually change the patterning of spatial relationships, the meaning of\ncenter and periphery relevant to this discussion must be discerned from the interlacing of\nthe metaphoric with the literal.\nCenter, as an abstract spatial term, is a point defined by its relative distance from\na set of related points surrounding it. It is the point that best represents the relationship\nand connection between all the other points. It is marked by such characteristics as\nbalance and stability because its periphery may exist in any number of arrangements. In\ncontrast, peripheral points are marked by their ability to fluctuate without necessarily\naltering the center; they may be unstable and bear little or no relation to each other\nbesides the common connection to the center. This is not to say that the peripheral points\nhave no power to alter the center point, but because the center is defined in relation to the\nentire periphery, it can only be moved if the majority of the periphery shifts to favor a\ndifferent center point.\nThis spatial distinction on its own, however, is an incomplete and misleading\nguide to understanding the distinction between the spatial-social center and periphery in\n\nurban landscapes. The center of a city need not be the geometric center within a city's\nboundaries (though it often is close), and social peripheries often occupy spatial centers\nsuch that those at \"the margins of society\" can live in \"the heart\" of a city that itself is\nconsidered the center of capitalism, democracy, creativity, etc.\nOverlaid with its social implications, the spatial distinction between center and\nperiphery becomes more complex. The social center locates itself spatially at social\ngathering points, so social centers can simultaneously occupy multiple locations. In many\nwestern cities, social power centers are located where the powerful people live (often\noutside the center city) and work (often within it). Social-spatial centers build on the\nenergy of social and cultural exchanges and communication, facilitated by physical\nproximity.\nThe periphery, on the other hand, is a place of diffusion (literally in the case of\nsuburban and rural peripheries, but also metaphoric in terms of the social distance\nbetween groups at the social periphery) and difference. The social periphery in the spatial\ncenter is created by social exclusion in the form of linguistic, economic, and institutional\nbarriers. As with the physical periphery of urban areas, communication and exchange at\nthe social periphery is limited because it must be mediated by the identity of the center -\nthe identity that connects different peripheral populations. While the center is defined by\na strong, unified identity that develops through a high density of social exchange, at the\nperiphery resistance to the values and identity of the center emerges in terms of both\nurban form (i.e. building types, street widths, landscaping, etc.) and social behavior.\nAlternate, competing interpretations of the central identity emerge, many with their own\nsub-centers occupying territory in the spatial-social periphery."
    },
    {
      "category": "Resource",
      "title": "belkind_2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-329-social-theory-and-the-city-fall-2005/f735662c041b2839e7e7aee96483de3a_belkind_2.pdf",
      "content": "Lara Belkind\n11.329 Social Theory and the City\nProf. Sennett\nSeptember 20, 2005\nAssignment #2: \"Up, Down, on the Ground\"\nAs social animals, humans are ever conscious of hierarchy. Social position, or at\nleast the individual's perception of his/her relationship to \"the group\" - to other\nindividuals sketched anonymous and en masse, the atom to the molecule - is readily,\nconsistently translated from the intangible social into clear-cut slicing of space. In cities,\nsocial metaphor becomes crystallized in the design and construction of buildings. And\nmuch of this crystallization occurs along the vertical \"z-axis\" in space.\nHowever, with shifts in cultural values and technology, the perceived social value\nof being located \"up, down, or on the ground\" shifts as well.\nPre-20th century European urban consciousness favored a position in space that,\nthough not on the ground plane, was not far from it. The ground plane of the city\nrepresented the public, the social realm, and visibility in this realm, even while avoiding\ndirect engagement, was essential to the upper classes. Manifested in typologies such as\nthe piano nobile, the grand living spaces of apartments for the wealthy imposed\nthemselves on the street environment just above eye-level, while poorer renters were\nobligated to climb stairs out of sight to upper-level apartments and the poorest were\nrelegated to the attic.\nExceptions emphasized social exclusivity, such as the basement-level side\nentrances to the Paris Opera, for members only.\n\nModern consciousness (and high-speed elevators), in contrast, emphasized\nanonymity, autonomy, and abstraction in the urban realm. Being apart from the social\nmilieu, high above ground in a penthouse office or apartment (or in a house hovering\nabove ground on piloti) became desirable - looking out to clouds and sky, to a city\nabstracted below into a composed skyline swathed in flows of yellow cabs, with people\ntoo small to identify.\nSocial hierarchy in modern transportation was frankly ranked along the z-axis,\nwith popular transit taking place below ground in subways, private cars moving along the\ncity's surface, and airplanes flying elusively overhead.\nFrom the 1970s onward, a new \"groundedness\" seems to have entered built\nenvironment consciousness, with the autonomy emphasized in modern cities transformed\ninto an idea of supreme self-sufficiency. This quality is seen in a vast, underground\nfuturistic utopia constructed outside Flagstaff, and the proliferation of a desire to live in\nan earth-berm house under a grass roof. In such schemes, \"ground\" is frequently less a\nsignifier of the social than it is of a \"nature\" that exists with few people."
    },
    {
      "category": "Resource",
      "title": "felix_2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-329-social-theory-and-the-city-fall-2005/4b9e75e393cbae74d244b1dd54854ba2_felix_2.pdf",
      "content": "Elliot Felix\n11.329\n21 September 2005\nUp, Down, and On the Ground.\nAssigning value to containers based on their contents is faulty. There is nothing buoyant\nabout the nature of a balloon: one can just as easily be filled with water as helium. Words are\nsimilar containers. They are neutral until filled with meaning and value according to different\ncontexts and standards. Up, down, and on the ground are terms which each denote myriad spatial\nand social relationships, but each acquires meaning in association with overcoming resistance\nthrough demonstrations of force and ability.\nGravity, ubiquitous and uncompromising, is perhaps the most fundamental force that we\ncan perceive. As a result, we laud going up. It means we've accomplished something and that\nwe've overcome gravity's resistance - either metaphorically or in reality. Climbing a ladder and\ngoing uphill are colloquial testaments to this. Skyscrapers are built manifestations of it, and are\nvalued proportionally to their distance from the ground. The views from them are just some of\nthe secondary spoils of the labor. As small victories over gravity, even jumps have competitions\nand rewards. By contrast, going down to the ground harnesses gravity, and so we view this as\nbarely any achievement at all. It happens naturally, proves nothing, and rarely comes with\nreward. Occupying the ground is a neutral and unexceptional condition in which gravity is\nconstant and no one wins.\nJust as moving up takes effort against gravity, going down below ground requires\novercoming the similar resistance of material as well fear of the unknown. Digging, whether in a\nphysical or an intellectual sense, takes effort and risk. As such, when we uncover something or\nacquire a deep knowledge of something, it is seen as an accomplishment. Here too, vision seems\nto be another reward from the uncovering but this time as the result of a subtraction rather than\nan addition. Familiar expressions are replete with such a sentiment. Beyond fundamental notions\nof understanding, getting 'to the bottom of' something is always important. Moreover, terms like\n'foundations' and 'infrastructure' also allude to gravity's dictum that 'above' must ultimately be\nsupported from 'below.'\nTransgressing the resistance of physiology also grants particular values to kinds of vision.\nLike gravity, native sight can be thought of as neutral and commonplace. However, the ability to\n\nsee at exceptional scales above and below this norm is imbued with value. An overview, one in\nwhich macroscopic insight is obtained at the expense of some surface-level detail, is valued for\nits overarching perspective. Similarly, the ability to see underlying structure through the\nmicroscope compounds the notion of a depth of understanding to epitomize an aspect in which\ngoing down, this time in scale, is granted cultural import.\nDistance is also a force to be surmounted. While going up may offer an overview and\ngoing down may reveal the foundations of an idea or a place, neither view is proximal. The\nimmediacy, directness, and everyday aspects of locating oneself 'on the ground' make it a\nvaluable perspective for its surmounting the forces of removal that distance implies. The\nrelevance implied in this position as well its connotations of compromise render it useful. Rather\nthan find value in abstraction, this perspective finds it in concrete understanding and balance\nbetween near and far, above and below, foreground and background.\nAs with material forces, words gain significance by connoting the overcoming of socio-\ncultural forces. Often the latter can be more potent than the former. The pressure to conform is\namong the strongest exerted, and aberrations draw scrutiny and censure. The ability to resist this\nforce is responsible for creating both the cult of individuality as well as the notion of an\n'underground' culture. Thus, a path downward to avoid the mainstream's stabilizing forces tends\nto produce non-conformity and its corollary, uniqueness. Both of these are valued as\ndemonstrations of overcoming social pressures.\nIn conclusion, notions of up, down, and ground are constructed in reference to value\nsystems. The forces that shape these systems combine physical phenomena, material forces,\nphysiological limits, and societal pressures, and their interaction begets varying and contextual\ndefinitions. What is constant, however, is that ideas of up, down, and on the ground gain or lose\nvalue relative to the transgressing of boundaries and overcoming of obstacles. Societies set limits\nin order to create metrics of success and failure in economic, physical, and intellectual terms.\nWhen forces such gravity and conformity are defeated in order to surpass such limits, we create\nshared values with which terms can be imbued."
    },
    {
      "category": "Resource",
      "title": "foxe_2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-329-social-theory-and-the-city-fall-2005/34a4b85892620c988534a821aa0baabe_foxe_2.pdf",
      "content": "David M. Foxe\nSocial Theory and the City\nProf. Sennett\nAssignment 2\n17 September 2005\n\nUnequal vertical elevation is one of the few universal traits of sites across the\nearth. Not all places use comparable measures of distance and time, vegetation\nand climate varies widely, and the horizontal area and organization of\nsettlements exhibits great variation. But the condition of elevation makes some\nplaces inevitably higher than others: we can measure whether the land or a built\nsurface are on the same plane, or if one is higher and one is lower.\n\nParallel to this, the struggle against gravity is ubiquitous; aside from negligible\nvariation of a few microseconds due to the distance from the center of the earth\nto differing heights on the earth's crust or while flying in the air, we and our\nenvironment are constantly subject to 9.8 meters per second squared of\ngravitational acceleration. Ever since Galileo and his contemporaries showed\nthat all objects fall at the same rate of acceleration regardless of material and\n\"natural state\" or divine ordination, gravitational attraction has been understood\nas a great equalizer that does not discriminate.\n\nYet when the force of gravity and variety in elevation conspire, the resulting\neffects are hardly neutral. Water flows down and fills valleys and marshes with\nnutrients and irrigation; floodwaters accumulate in low ground and the high\nground peaks above deluges, remaining dry. Cumulonimbus clouds form as air\ntraverses mountain ranges, weather systems spin their spiraling trajectories\nacross the globe. Elevation changes as monumental as mountain ranges divide\nsettlements, cultures, nations, and peoples. Even if one's physical displacement\nremains zero in crossing a mountain or a ravine - that is, if the start and end are\nat the same numerical elevation - the geography still causes great strain to\nphysically fighting gravity and the stability of being on sloping land, ascending\nand traversing such inequalities. Difficulty of access means that the physical\ninequality directly implies and causes unequal opportunity for movement, use of\nresources, and other aspects of human life.\n\nTherefore while transportation may have made horizontal distances far easier to\ntraverse, and elevators and escalators and even simple machines provide\nmechanical means of ascending and descending, we cannot ignore the varying\nelevation of our settlements and the gravity of their consequences. Those places\non the same plane are immeasurably more accessible and proximal and ready to\nhand than those that require ascending or descending. Our own plane is our\nframe of reference, determining whether we see a glacially molded landscape as\na group of equal planes with fissures between, or the view from those incised\nlowland corridors walled on either side.\n\nThe condition of being elevated brings increased amounts of territory to visibility,\nwhile the opposite situation in low ground means being overseen from higher\nplaces. The reciprocity of surveying from above and being visible from below\nsupports the impulse for monuments and places of power to capitalize upon and\nbe exaggerated by placing human constructions atop naturally elevated\ntopography.\n\nEven when physical elevation is not possible, conventions of language enable us\nto speak of \"moral\" high ground to avoid taking the \"low road\" in a situation.\nSimilarly, finding oneself \"in a hole\" makes reaching the \"top of the heap\"\nsimilarly challenging. \"High street retail\" occurs regardless of the location's\nelevation, even if the goods for sale are in an establishment that seems\n\"beneath\" the shopper's desired level. In a capitalist society where innate\ndifferences of status and class tend to be verbally smoothed over so that\neveryone aspires to be some form of \"middle class,\" even that English term in its\nFrench and German origins derives directly from the urban businessmen and\nartisans who dwelt not on the top of the hill or mountain in a central palace, nor\noutside the city in the fertile, protected agricultural valleys, but in the middle.\n\nAt the intersection of physical and social topographies, ups and downs are not\nmerely a consequence of personal description or of simple scenic variety.\nRather, they are fundamental to the way in which we conceive our world and\noperate within it. While traditional ritual topographies of civic and sacred events\nhave lost their currency in many places, along with the analogy of earth's surface\nas a level plane midway between paradise above and damnation below in literal\nphysical terms, elevation still connotes. The social, physical, and mental\ndefinition of locations as both spaces and places, requires the information of\nrelationships to surrounding land. Even if the vertical axis no longer implies a\nvertical teleology, the subtleties of topographic variation do a great deal to\ndetermine the desirability of real estate, the potential risk of settlement, the many\nnatural and human systems which our built environment capitalizes upon or\nstruggles against. Topography informs many relationships and consequences,\nwhich become manifest tacitly as local knowledge and memory of what has\nhappened in a place over time, of why certain social relationships, equalities and\ninequalities correspond or contrast the physical land. In this capacity the\ndescriptive capacity of topography moves toward the analysis and knowledge of\ntopology, as a way of linking the ground (topos) and the language (logos)\nsurrounding our places and relationships in the world."
    },
    {
      "category": "Resource",
      "title": "ssn1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-329-social-theory-and-the-city-fall-2005/99c8037529945c44e652a59dc337ecee_ssn1.pdf",
      "content": "11.329 Social Theory and the City\n\nSession 1: Introduction to the Class\n\nInstructor Background:\n\nRichard Sennett is Chair of the Cities Program at the London School of\nEconomics (LSE). He has begun a joint appointment that allows him to spend his\nfall semesters at MIT teaching this course. His presence here is part of an effort\nto bring MIT into a network of urban studies scholars based in schools around\nEurope.\n\nCourse Introduction:\n\nThis course is a seminar on social theory and the city. It will not be a set of\nlectures but rather will be driven primarily by discussion and student input. The\nclass itself is loosely structured into 3 parts:\n1. Theory of the City\n2. Map of Theoretical Issues\n3. Collaborative Student Work\n\nTheory of the City\n1. Why is theory an issue? Why is it necessary?\na. Because most social practices are unknowing, or tacit.\ni. Michael Polanyi's idea of tacit practices argued that\npractices that are a part of moving in space, working through\nboundaries and groups don't become habits but \"knowledge\npractices\" that don't need to be examined.\nb. Urban conditions depend on this \"tacit knowledge\"\ni. There is little discursive interaction between strangers in\ncities. It is not necessary for people to tell each other what\nthey are doing and why.\nii. Urban space is regulated through willed unknowing.\niii. Order is created by relying on keeping things tacit.\nc. Theory's role is to force into explicit discussion these tacit habits: to\nmake explicit what is held tacit.\ni. \"Theory\" - in scare quotes - is a highly undemocratic and\nself-referential activity.\n1. Its role is to close off discussion from the mass of\npeople involved in the unknowing practices discussed.\n2. It is characterized by oppression and fear.\nii. Theory, in this new conception, requires a political\ncommitment to reveal and expose tacit practices without\nhumiliation.\n1. Doing theory is a project of expression that\n\na. Puts an enormous burden on the person doing\nit, and\nb. Creates a profound ethical / political dilemma:\nHow do you theorize - make explicit that which\nis tacit - without humiliating those who are\nengaged in the unknowing, tacit practices?\n\nMapping Urban Theory (as it now exists)\n1. The discourse about what cities are in terms of social and political theory\nis only about 1 century old.\na. Though cities are thousands of years old, changes in the last\ncentury meant that modern cities have no real reference in terms of\nscale and politics to what had come before.\n2. Part 1: 3 schools of urban studies took form over the century:\na. The Berlin School\ni. Max Weber, Georg Simmel (T.A. to Weber), and Walter\nBenjamin\nii. Not marked by one shared philosophical pre-supposition\niii. The experience of Berlin itself gave rise to 3 sets of\nfoundational problems:\n1. Weber: The relationship between urban places and\nthe status of law.\nc. Rights and place are tied to cities.\n2. Simmel: The city as a point of reflection of sociology\n3. Benjamin: The city as a site for thinking about\nnarrative cultural practices and narrative imaging.\nb. The Chicago School (at the University of Chicago before WWI)\ni. Founder: Robert Park, a journalist who studied with Simmel\nin Germany. Included Louis Wirth and Ernest Burgess (who\ngenerated the study of urban ecology)\n1. The School looks at the spatializing of social and\neconomic differences.\n2. Its theoretical proposition: How territory cuts loose\nfrom natural difference; how social and economic\ndifferences are imposed on the natural geography of\nthe place; how traditional ideas in social / political\ntheory get instantiated.\nc. The Paris School (1950s - 1970s)\ni. Major players :\n1. Henri Lefebvre - tried to create democratic socialism\nusing the city as a space of production ;\n2. Guy Debord and the Situationists - a rebellion against\nthe Communist left ;\n3. Michel de Certeau - a priest who passed through the\nCommunist party ; and\n4. Michel Foucault - a deeply anti-Marxist thinker.\n\nd. All were recovering from Marxism and its inability to address the\ncondition of the city.\ni. All three schools have focused more on space than on built\nform (i.e. they are more about geography than architecture).\nii. They attempt to imagine the city as space, not solid\nsubstance.\niii. They have exhausted this path of inquiry.\nb. A new line of inquiry can now be opened that deals not with space,\nbut with built form.\ni. Its questions include:\n1. What is a just factory office?\n2. What is a school building that improves education?\n3. What is a democratic window?\nii. In my own work, I am trying to deal with how theory can deal\nwith things rather than location.\niii. If the last century of thinking has been characterized by the\ntendency to dematerialize the city, disembody it, this new\nproject aims to rematerialize our understanding of cities by\nfocusing on built form.\n3. Part 2: Cities have best engaged 4 types of theorizing:\na. Marxism\ni. It makes claims about the material word that social scientists\nmust take seriously (unlike Adam Smith's theories, which\nfocused on process)\nii. Its irony is that while it provides an analysis of what goes\nwrong in the capitalist city, it does not provide any vision for\nan ideal Communist city\niii. The emergence of Post Colonial theorists in the 1960s who\nequated cities with colonization short circuited Marxist theory\naway from the idea of the cosmopolitan as a project for\nCommunism\nb. Public Realm Theory\ni. 3 versions of the public realm:\n1. Juergen Habermas (derived from Weber): the public\nrealm is constituted by the ways people reason about\ntheir social/economic/gender/etc. status.\n2. Hannah Arendt: eschews the notion of identity in the\ncity. The city is a place where people ideally ought to\nbe equal because they are strangers to one another.\nActual identity is unknown, so it should not bring\nabout inequalities in the public realm.\n3. Walter Benjamin: A dramaturgical approach to the\npublic realm that emphasizes the conditions under\nwhich strangers become expressive to one another in\ncrowds. The public realm is a place of presence and\ndisplay rather than a place of decision making.\n\nc. Difference Theory\nii. Deals with the question \"How can we get unlike people to\nshare a common culture?\"\niii. Pierre Bourdieu: The process by which people distinguish\nthemselves is a kind of constructivism, an act of establishing\ninequality and contest.\n1. \"The Misery of the World\" is a study of how people at\nthe bottom of the economic ladder use the built\nenvironment to distinguish themselves culturally.\nd. Critical Realism - The Frankfurt School\ni. Walter Benjamin: The city offers a space of display that\ninvites the eye to criticize.\n1. The data we have for a critique of society must be\ndisplayed in some imagistic form such that the image\nis the site for criticism of the city.\nii. Foucault takes this up and subverts it by claiming that the\neye is incapable of functioning as a critical organ.\ne. Two additional movements are relevant but haven't been taken up\nby sociology:\ni. Natural Communities Theory (Biology)\n1. Founder: Humberto Maturana\n2. Emphasizes the natural world of the city and the\necology of man-made communities\n3. It is currently highly biological and not yet taken up by\nsociologists\nii. Narrative Theory (Humanities)\n1. When we talk about the relationship between time\nand place, time has no agency in telling stories, i.e.\nno person or persons are active in the telling.\n\nCollaborative Student Work\n1. This course is intended to teach students not simply how to read theory\nand discuss theorists as subjects, but rather to help them develop\nthemselves as thinkers and writers.\na. We will use this seminar as a workshop for students' works in\nprogress.\ni. We will work out the theoretical implications of each other's\nwork as a group\nii. We will function as a workshop rather than a lit review\nb. We will grapple with what is theoretically at stake: i.e. how do you\nmove from a theoretical proposition into the realm of cities?\n2. I would like to get the seminar involved in the network in Europe as well.\nStudents should remain connected to this group even after the semester is\nover.\n3. The purpose is to enable the current generation of urbanists to become\npublic intellectuals through:\n\na. Communicating with others\nb. Learning to be collaborative rather than competitive\nc. Learning how to be colleagues"
    },
    {
      "category": "Resource",
      "title": "ssn2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-329-social-theory-and-the-city-fall-2005/b66326337ee7f75e5a219bc3e3755f0d_ssn2.pdf",
      "content": "11.329 Social Theory and the City\n\nSession 2: Center vs. Periphery\n\nThe class focused on developing the theoretical arguments presented in student\nresponses to the first assignment. Student volunteers read aloud their responses,\nand the class was asked to discuss their theoretical propositions and arguments\naround a set of basic questions:\n\n1. What are the underlying assumptions that this argument relies on?\n2. Are additional criteria needed to strengthen the argument?\n3. What challenges to the theoretical propositions in the argument need to be\naddressed in its elaboration?\n4. How do the arguments differ from one another?\n5. What common ground do the different arguments share, if any?"
    },
    {
      "category": "Resource",
      "title": "ssn3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-329-social-theory-and-the-city-fall-2005/844a436e2cfa149903dba9128e439002_ssn3.pdf",
      "content": "11.329 Social Theory and the City\n\nSession 3: Up vs. Down\n\nThe class discussed the theoretical positions presented in student responses to\nthe second assignment. Student volunteers read aloud their responses, and the\nclass was asked to react to the papers. Issues raised in the discussion are listed\nbelow.\n\nPaper 1 - Lara Belkind:\n-\nThe paper gave the classic story of the evolution of the meaning of up and\ndown as a power relationship\no At one time (pre 20th c.), being near the ground but not on it allowed\nfor the dramatization of power\no Later (20th c.), removal from the ground plane and the visual\ndramatization became an expression of power\n-\nThis experience can be made sense of in terms of cones of vision\n-\nMorphology plays a role in the relationship\n-\nThe role of technologies in getting up and how they influenced the change\nin the dynamic of power was discussed (e.g. the elevator, the airplane)\n-\nEven in the 20th c. there is still a notion that being above is not simply an\nescape:\no Pan-optic control exists through vision.\n-\nAn alternate view of down (here presented as degraded space) can be\nfound in Roman culture, where below was a significant symbolically\norienting direction.\no This led to a discussion of the difference between the Greek and\nRoman concepts of the grid:\nGreek: each place in the grid is equal in value to all other\nplaces;\nRoman: certain places in a grid are of greater symbolic\nimportance than others.\n\nPaper 2 - Annis Whitlow:\n-\nHer theoretical project explored the subject's perception of itself\no Up: self-magnification\no Ground: contingency\no Down: self-protection\n-\nThis is a procedure of how Simmel described the mental life of the\nmetropolis.\n-\nThe underlying assumption is that humans have an interpretive dynamic,\nthat they carry a measure of internal tools they apply to specific conditions\n-\nDiscussion of the revulsion of the \"oversocialized\" view of man (Dennis\nWrong).\no Ian Hacking wrote The Social Construction of What?, which\ndiscusses the limits of social construction\n\n-\nThe issue the piece raises is: What are the limits of buildings in shaping\nthe experience of someone else? How powerful is the built environment in\nshaping people?\no Has profound implications for the design profession\no Response 1: Negative Determinism: Design can prevent humans\nfrom hurting themselves but cannot actualize them\no Response 2: Objectivism: A designer must act on his/her own\nexperience and not on the experience of others."
    },
    {
      "category": "Resource",
      "title": "ssn4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-329-social-theory-and-the-city-fall-2005/285824331632d8776e231b8ce7d289e5_ssn4.pdf",
      "content": "11.329 Social Theory and the City\n\nSession 4: \"Homo-Faber\"\n\nThe class discussed a draft work-in-progress written and presented by the\nInstructor. Homo-Faber is the first of a three-volume series dealing with the issue\nof how people learn about themselves by negotiating with things, and it examines\n\"craftsmanship\" specifically. The piece examines the process of learning in the\nprocess of designing or playing musical instruments as one characterized by\ninterpretation and enquiry, control, and release. Students were asked to\ncomment on, criticize, and present their questions about the theoretical content\nof the piece."
    },
    {
      "category": "Resource",
      "title": "ssn5_belkind.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-329-social-theory-and-the-city-fall-2005/ec82b0a0a7749884c0f4ed5cef22465c_ssn5_belkind.pdf",
      "content": "11.329 Social Theory and the City\n\nSession 5: \"Stealth Gentrification: Camouflage and Commerce on the Lower East\nSide\"\n\nThe class discussed a draft work-in-progress written and presented by the\nstudent Lara Belkind. Lara provided a summary presentation of her work, which\nlooked at the way that artists and representatives of counter-culture have subtly\ntransformed marginal neighborhoods into sites of gentrification by appropriating\nthe urban form of those communities to give themselves authenticity as people\noutside the mainstream culture. Students were asked to comment on, criticize,\nand present their questions about the theoretical content of the piece.\n\nTheoretical issues underpinning the content:\n-\nAuthenticity: What does it mean to be authentic?\n-\nMediation: What is being mediated? Who is mediating?\n-\nInvisibility\n-\nCenter vs. Periphery (vertical/horizontal)\n-\nBoundary"
    },
    {
      "category": "Resource",
      "title": "ssn6_felix.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-329-social-theory-and-the-city-fall-2005/2b9de5156fe64d19020fafba2ea53188_ssn6_felix.pdf",
      "content": "11.329 Social Theory and the City\n\nSession 6: \"Between Production and Consumption: Spaces of Knowledge within\nthe New York City Subway.\"\n\nThe class discussed a draft work-in-progress written and presented by student\nElliot Felix. Elliot provided a summary presentation of his work, a text that\nprovides theoretical basis for his current Master's thesis in Architectural Design.\nHe began by describing the city through its multiplicity leading to specialization,\n(over)stimulation, and a kind of intellectual grayness in which one has more\nallegiance to pace than place. These conditions lead to a heightened awareness\nof difference and of \"Self\" versus \"Other\" and thus an understanding of \"the\nstranger\" as a kind of permanent condition of the city - you are always a stranger\nto someone, and you are always surrounded by those who are strangers to you.\nHe then posited that the New York City Subway system functions as a\nintensification of that city in terms of movement, artificiality, disorientation, and\ndislocation, and as an underground space, the subway can be thought of as a\nprophetic condition providing a glimpse of what is to come above-grade in terms\nof how people relate to each other and their environment. Toward this end, he\nproposed taking unused or \"vestigial\" subway platforms within currently operating\nstations and transforming them into spaces of knowledge production and\nconsumption in a new kind of public library that would leverage the existing\nculture of reading on the subway, provide places of interaction among people\nand artifacts, and further the democratization of knowledge.\n\nTheoretical issues underpinning the content:\n\n-\nThe stranger and the uncanny\n-\nThe prophetic nature of underground activity\n-\nKnowledge vs. information\n-\nMobility - Social and Physical\n-\nDemocratization of Knowledge/content Production\n-\nDesign: Form vs. Program\n\nImportant Questions:\n\n1. Is the notion of the 'stranger' a productive way in to larger ideas about the\ncity? If not, how might the design thinking be better related to these larger\nideas?\n2. Is this an opportunity to make more libraries or is the end-point of the\ndesign for people to learn more about the subway (and by the same token\nabout other libraries)?\n3. Is it a purely a 'reflexive' project? Does it matter what is inserted into the\nsubway context or that it's a library or does the mere insertion of anything\naberrant tell one something about that thing and the subway?\n\n4. How does one inspire people (with architecture) to get more knowledge?\n5. Can the subway be understood as a communication system?"
    },
    {
      "category": "Resource",
      "title": "ssn7_nilina.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-329-social-theory-and-the-city-fall-2005/55a2c57f01152468f244d8c65ecc1362_ssn7_nilina.pdf",
      "content": "11.329 Social Theory and the City\n\nSession 7: \"Theorizing a Center for Universal Design.\"\n\nThis class session embarked on the project of working from a design brief to a\ntheoretical proposition underpinning the project. Nadya Nilina presented the brief\nfrom which she is building her M.Arch thesis project: a request for design\nproposals for an art center on Roosevelt Island in the East River between\nManhattan and Queens that would be universally accessible to patients at the\nColer-Goldwater Hospital, the Roosevelt Island Visual Arts Society, and other\nresidents wishing to use the facilities. The site is at the southern tip of the Island\nin the ruins of the Smallpox Hospital, which was closed in 1955. Class discussion\nexamined the issue of universal access; individual versus collective spaces, and\nhow to create limits for the design project.\n\nTheoretical issues underpinning the content:\n-\nUniversal vs. Democratic\no Inclusion vs. Participation\n-\nExposure (of disability) vs. Integration (of disabled) vs. Distraction (from\ndisability)\n-\nReversal: creating a universally unpleasant space\n-\nIndependence and isolation\no How to design for community?\n-\nSennett, The Fall of Public Man\no Haussman's Parisian streets\no Serendipity can follow sweeping gestures"
    },
    {
      "category": "Resource",
      "title": "ssn8_whitlow.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-329-social-theory-and-the-city-fall-2005/52ad71ed6541fd89f23a0ba499259821_ssn8_whitlow.pdf",
      "content": "11.329 Social Theory and the City\n\nSession 8: \"The Racial Politics of Urban Celebrations: A Comparative Study of\nPhiladelphia's Mummers Parade and Odunde Festival\"\n\nAbstract:\n\nDiscourses about the construction of identity, the politics of identity, and the role\nof design in controlling human behavior and expressing power have thus far\nbeen confined to separate realms of inquiry. This thesis will examine where these\ndiscourses intersect and how their intersection plays out in society as old\nconceptions of race and identity are challenged by demographic shifts and new\nimmigrant populations. Festivals, as spatial expressions of identity that image city\nspaces, provide an important perspective on this topic. Philadelphia, as a former\ncapital city that continues to struggle with race and identity in its politics, acts as\na compelling backdrop for my case studies. The Mummers Parade and the\nOdunde Festival are two New Year's celebrations that mediate racial/political and\nethnic/cultural identities for the city's white and black populations respectively.\nThis thesis considers both festivals from their historical context and compares\ntheir current form in terms of spatial and non-spatial indicators (route,\ndemographics, funding, and organizational structure). From this analytic\nframework emerges a picture of how political identities are constructed spatially,\nhow the process of identity construction both challenges and reinforces the\ndominant political structure, and how the process can bridge political differences\nand maintain them.\n\nTheoretical issues underpinning the content:\n\n-\nSociological/Anthropological theory can structure the phenomenon\nobserved in the thesis.\no Rituals of space and inequality\n\"Dramaturgical sociology\"\nMasks and Inverted Domination\nRole Playing\nRituals of Recovery\no Ritual vs. Spectacle\nRitual is identity\nSpectacle is a debasement of public life"
    },
    {
      "category": "Resource",
      "title": "ssn9_foxe.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-329-social-theory-and-the-city-fall-2005/59331d29977cf8662405a9c248c8885c_ssn9_foxe.pdf",
      "content": "11.329 Social Theory and the City\n\nSession 9: \"Structuring Beyond Architecture\" - DRAFT, M.Arch Thesis, David M.\nFoxe\n\nAbstract:\n\nThis project investigates ways to conceive and design positive\nrelationships between internal structure and the urban realm; to analyze\nhow the structuring of individual projects can contribute to the whole of\ncommunities and cities rather than remaining isolated resolutions of internal\nconcerns. Often infrastructure - literally something which is beyond the scale of a\ntypical structure - is conceived within the realm of engineering, and tasks of\nstructural design are therefore isolated into discrete, optimized solutions.\nDrawing on precedents of Technological Modernism at various scales, this\nproject seeks to focus on how individual architectural works can use the process\nand design of structure to become catalysts beyond their literal limits, to show the\nimportance of structuring beyond architecture.\n\nUnder this framework structural technology becomes a means for elements of\narchitectural design to become interdependent, and therefore greater than their\nsum, rather than a collection of independent, unrelated ideas. This investigation\nthus situates the role of technology within a proposal for architectural quality at\nthe intersection of value structures, physical structures, and urban structures.\nArchitecture is therefore the boundary, the liminal space between the scales of\nstructure within a place, and urban life beyond a project.\n\nExamples cited in thesis proposal:\nUnit Block System by Alden Dow\nMonsanto House of the Future\nShore (Belt) Parkway, Brooklyn, NY\nby Robert Moses/Aymar Embury/Gilmore Clarke\nSpodek and other works by Waclaw Zalewski\nMilwaukee Art Museum by Santiago Calatrava\n\nTheoretical issues underpinning the content through the course of the discussion:\n\n-\nForm as a result of metamorphosis vs. rupture\no Rupture as a reversal\no Resiliency of physical/political power\no Designed rupture as a statement\nIs rupture always a bad thing?\n- Lefebrve: Build social fabric through conflict\n- Coser: Conflict creates stronger bonds than\nagreement\no Possibilities for metamorphosis as organicism\n\no Biological models, not biological forms\n-\nPhysicality of form and memory\n-\nWhat are the norms? What is the community (that is being impacted by\nthe structures)? Consider (and perhaps contrast) these various other\napproaches:\no Christopher Alexander. A Pattern Language: Towns, Buildings,\nConstruction. New York, NY: Oxford University Press, 1977. ISBN:\n0195019199.\no William Whyte. City: Rediscovering the Center. New York,\nNY: Doubleday, 1988. ISBN: 0385054580.\n-\nThe degree to which dissonance is built into design\n-\nForm as a result of process.\n\nFocal Examples:\n-\nLes Halles, Paris\n-\nMarkets generally\n\nSuggested Exercise:\nTake the theoretical propositions of the piece and order them using no examples.\nCan the theory hold itself up through these propositions alone? What is the logic\nthat emerges from these propositions?"
    },
    {
      "category": "Resource",
      "title": "ssn10_touloumi.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-329-social-theory-and-the-city-fall-2005/79b5ea8ac05d516fea4d4e1b35517552_ssn10_touloumi.pdf",
      "content": "11.329 Social Theory and the City\n\nSession 10: \"The Architecture of Repression: war machines and state apparatus\nin the EU summit meeting, Thessaloniki,\"\n\nSummary:\n\nThe class discussed a draft work-in-progress written and presented by Olga\nTouloumi. In her paper Olga explored the physical transformation of Thessaloniki\nduring the 2003 European Union Summit, which took place there, in terms of\nGilles Deleuze and Felix Guattari's (D&G) distinctions of war machine and State\napparatus and smooth versus striated space. She analyzed the impact of the\nphysical barriers erected around the city as well as the police lines guarding the\nlocation of the meeting as striations and analyzed the movement and actions of\nthe protestors to determine whether they were able to smooth the space as\nD&G's theory would suggest. The class discussion examined what alternative\ntheories might also help illuminate the questions raised in the paper about power\nand space.\n\nTheoretical issues underpinning the content:\n\n-\nFoucault's theories of inversions of power\n-\nRitual in protest\n-\nPanopticon\n-\n\nAdditional References:\n-\nGustave Le Bon, The Crowd: A Study of the Popular Mind.\n-\nSigmund Freud, Mass Psychology\n-\nElias Cannetti, Crowds and Power.\n-\nCharles Tilly\n-\nGeorge Rude, The Crowd in History.\n\nExercises:\n-\nCreate diagrams of crowd movements.\n-\nAnalyze the morphology of the barriers that were present.\n-\nCompare the ways that the forms of protests have changed over time."
    },
    {
      "category": "Resource",
      "title": "whitlow_thesis.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-329-social-theory-and-the-city-fall-2005/19bff7a471760a8270c249533324d049_whitlow_thesis.pdf",
      "content": "The Racial Politics of Urban Celebrations: A Comparative Study of Philadelphia's Mummers\np\ny\np\nParade and Odunde Festival\nBy\nAnnis Whitlow\nBA in Architecture\nYale University\nNew Haven, CT (2001)\nSubmitted to the Department of Urban Studies and Planning\nin partial fulfillment of the requirements for the degree of\nMaster in City Planning\nat the\nMASSACHUSETTS INSTITUTE OF TECHNOLOGY\nJune 2004\n(c) 2004 Annis Whitlow.\nAuthor_________________________________________________________________\nDepartment of Urban Studies and Planning\nMay, 2004\nCertified by _____________________________________________________________\nProfessor Lawrence Vale\nDepartment of Urban Studies and Planning\nThesis Supervisor\nAccepted by____________________________________________________________\nProfessor Dennis Frenchman\nChair, MCP Committee\nDepartment of Urban Studies and Planning\n\nACKNOWLEDGEMENTS\nThank you to my advisor Larry Vale for his continual guidance and support and to J. Phillip\nThompson for his insights into racial politics and Philadelphia history. Thanks also to my father,\nBill Whitlow for his help and encouragement. I would like to particularly thank Oshunbumi\nFernandez, Carol Simmons, Lois Fernandez, and Odunde, Inc., for providing me with invaluable\ninformation and insight into the inner-workings of Odunde. Dr. Cati Coe also provided me with\ncrucial feedback and encouragement. Thank you also to the staff at the Temple Urban Archives,\nthe Philadelphia Folklore Project, the Free Library of Philadelphia, the makers of Strut!, and all\nof the Philadelphia area newspapers, without whom this thesis would not have been possible.\nA few friends and colleagues have taken the time to help me structure my ideas and thoughts,\nand to these people I am especially grateful: Ariel Bierbaum, Ryan Allen, Jeff Hebert, James\nAlexander, and Michael Lee Poy. For his unrelenting encouragement, patience, love and support,\nI extend deep gratitude to Shomit Sengupta. Lastly, I send my deepest appreciation to my mother\nEdith Whitlow, my twin sister Kirsten Whitlow, and all my friends and family for their constant\nlove and support.\n\nThe Racial Politics of Urban Celebrations: A Comparative Study of Philadelphia's Mummers\nParade and Odunde Festival\nby\nAnnis Whitlow\nSubmitted to the Department of Urban Studies and Planning\non May 18, 2004 in partial fulfillment of the\nrequirements for the Degree of Master of City Planning\nABSTRACT\nDiscourses about the construction of identity, the politics of identity, and the role of design in\ncontrolling human behavior and expressing power have thus far been confined to separate realms\nof inquiry. This thesis will examine where these discourses intersect and how their intersection\nplays out in society as old conceptions of race and identity are challenged by demographic shifts\nand new immigrant populations. Festivals, as spatial expressions of identity that image city\nspaces, provide an important perspective on this topic. Philadelphia, as a former capital city that\ncontinues to struggle with race and identity in its politics, acts as a compelling backdrop for my\ncase studies. The Mummers Parade and the Odunde Festival are two New Year's celebrations\nthat mediate racial/political and ethnic/cultural identities for the city's white and black\npopulations respectively. This thesis considers both festivals from their historical context and\ncompares their current form in terms of spatial and non-spatial indicators (route, demographics,\nfunding, and organizational structure). From this analytic framework emerges a picture of\nhow political identities are constructed spatially, how the process of identity construction both\nchallenges and reinforces the dominant political structure, and how the process can bridge\npolitical differences and maintain them.\nThesis Supervisor: Lawrence Vale\nTitle: Professor of Urban Studies and Planning; Department Head, DUSP\n\nTable of Contents\nChapter 1. Introduction\nMethodology\nChapter 2. Acting our Difference: Space, Race, and Identity in Politics\nImaging the City and Politicizing Spaces\nConstructions of Identity: Architecture and Politics\nThe Politics of Spatial Practice: Festival Culture and American Identity\nConclusion\nChapter 3. Riot and Revelry: The Mummers Parade and the Spatial Construction of White\nIdentity\n1901 Parade Inception\n1964 Blackface Controversy\n1990s Move to Market Street\nConclusion\nChapter 4. Odunde and the Spatial Marginalization of Black Identity\nAfrican American Settlement and Celebration, 1776-1950\nCivil Rights, Afrocentrism and the Politics of the Street, 1950-1975\nConstructing a Contemporary African American Identity in Philadelphia, 1975-2004\nConclusion\nChapter 5: Comparative Spatial Practice in Racial Identity Construction\nRoute\nDemographics\nOrganizational Structure\nFunding and Sponsorship\nConclusion\nIMAGE REFERENCES\n\nThe Racial Politics of Urban Celebrations: A Comparative Study of Philadelphia's\nMummers Parade and Odunde Festival\nAnnis Whitlow, Massachusetts Institute of Technology\nIn short, we the black and the white deeply need each other here if we are really to become a\nnation--if we are really, that is, to achieve our identity, our maturity, as men and women. To create\none nation has proved to be a hideously difficult task; there is certainly no need now to create two,\none black and one white.\nJames Baldwin1, 1963\nComing to Philadelphia had made no real difference in my life. The racial barriers were just as\nstrong here as they'd been down South. The political and social system was controlled just as\nrigidly by white folks here as it had been down South. I wasn't farming, but I was still treated like\na sharecropper in a world controlled by white people.\nW.Wilson Goode2 1992\nChapter 1. Introduction\np\nMy interest in race, identity and politics stems from my experiences growing up in the New\nJersey suburbs of Philadelphia and Camden. As a white little girl in a mostly-white upper middle\nclass town, I remember learning from a young age not to judge people superficially and that\nracism is wrong. Yet by the time I was an adolescent, my sense of racial identity as a white\nperson was so strong that I couldn't listen to rap music without the sense that it wasn't for me\nbecause I was white. I felt deeply disconnected from African American culture even as I was\nbeing influenced by it. And as much as I felt that this sense of separation and disconnection was\nwrong, I couldn't name why, and I couldn't escape it.\nThe residents of my town didn't talk about being white very often, and when race came up it\nwas usually to make a comment against racism. Yet, all know they are white, and the desire to\nunderstand how these racially identities are constructed and maintained non-verbally led me to\nthe topic of my thesis. An interest in the power relationships between groups also influenced the\ndirection my research has taken. Three research questions in particular drove the work of this\nthesis: 1. How are racial identities constructed through the manipulation of public space in cities?\n\n2. How is the spatial construction of racial identity related to racial politics? and 3. How do\nchanging demographics impact these practices?\nI chose to focus on Philadelphia, PA, partly because I am familiar enough with its context to\nfeel confident in my observations and analysis. Racial politics are highly contextual and vary\nsignificantly from place to place. Previous research into Philadelphia history with these concerns\nin mind generated a base of material that I have built on in this thesis. I have researched the\nMummers Parade and the Odunde Festival. Both are based in South Philadelphia, both celebrate\nthe new year, but the former serves a mostly white population on January 1st and the latter a\nmostly black population on the second Sunday of June. Each, intentionally or unintentionally,\nplays a role in shaping Philadelphia's racial identities, and each speaks to the state of racial\npolitics in the city.\nPublic identity in the United States has always been constructed in public spaces. This is\nparticularly true of racial identity. Public celebrations have always worked in partnership\nwith local media to build public identity and political will among the racialized groups of the\nUnited States. Even today, in a culture dominated by media, public celebrations bring a spatial\ncomponent to the symbolic language of race propagated by national media conglomerates. They\nuse that symbolic language to give a racial identity to public spaces.\nThe symbolic language of race is today so embedded in popular, public culture as to be nearly\ninvisible to the average white observer. Over three hundred years of public culture designed to\npromulgate a dominant identity of whiteness has left our country with a symbolic landscape that\nspeaks to the success of that project.\nBlatant racism, racist hatred, has fallen out of public favor nationally, but concern for racial\nidentity has not faltered. Recent work on the construction of white identity has begun to break\ndown the myth that white identity is a more legitimate, natural identity than black identity,\n\nwhich is generally understood as constructed because of the break in cultural continuity that\nslavery imposed. Racial identities are inherently tied to national identity because they are defined\npolitically within a national context. Racial identity structures do not necessarily translate\nbetween nations, and a person traveling in a new country must often place herself in a new racial\ncontext - though this often seems less true of white than non-white identity, it remains valid\nbecause the meaning of whiteness shifts according to what its negations are.\nRacial identity requires an amalgamation of various ethnic identities under a singular, nationally\ndefined racial category. Ethnicity, on the other hand, operates at once at a more local and also a\nmore global scale than race. Ethnic identities are tied to local places, foods, dress, and cultural\npractices; however, they also unite people who are widely dispersed but who have maintained\nties to some or all of those characteristics of ethnic identity. Ethnic identities defy national\nidentities on two scales: 1. on the local level, they have the potential to deviate from whatever\nstandard national identity has been propagated, and 2. on the super-national level, they create ties\nbetween globally dispersed groups of people that are not linked under a single national identity.\nIn this thesis, I will argue that the Mummers parade, in the form it has assumed throughout the\ntwentieth century, is a festival that has constructed and maintained a white racial identity that has\nconnected Philadelphians of European descent across divisions of ethnicity, class, and religion.\nThe Odunde festival, on the other hand, attempts to break down a monolithic, nationally defined\nblack racial identity into an ethnic African American identity. It then uses this ethnic identity to\nbuild political consciousness around issues of race in the city.\nPhiladelphia, as the birthplace of our nation, provides a poignant backdrop for the construction\nof racialized national identities in its public spaces. This thesis will explore the historic process\nof articulating the spaces of white and black identities in Philadelphia, and how these processes\nhave changed and evolved into the Mummers and Odunde festivals of the early twenty-first\ncentury. In Philadelphia, individual race relations have never conformed to a singular, uniform\n\npattern. Despite the highly territorial nature of Philadelphia's various neighborhoods, their\ngridded permeability has meant that diverse groups have intermingled peacefully for years at\na time. Plate 1 shows a map of Philadelphia showing major neighborhood boundaries. This\npeaceful co-existence has been interspersed with periods of public conflict that have been much\nmore instrumental in building layers of meaning that tell Philadelphians what spaces are intended\nfor whom. Because these public celebrations have strong historic ties to political identity and\nmobilization, the spaces that are most politically symbolic and contested have also become the\nmost racially charged.\nAn example of this phenomenon is the recent controversy surrounding the recent redesign of\nIndependence Mall. In the first few years of the twenty-first century, a new pavilion was designed\nto house the Liberty Bell and a new visitors center and Constitution center were designed to\nfill the empty lots that never quite lived up to the expectations of Edmund Bacon's 1963 plan.\nBy 2002, it had become clear that the Liberty Bell would stand a mere five feet from the site of\nGeorge Washington's slave quarters and the Constitution Center would build a bus depot over\na historically important free black community without first excavating it. Figure 1 shows the\nThe public outcry over these two affronts to Philadelphia's African American population forced\nthe National Park Service to address issues of slavery and the role of the black community in\ntheir exhibition and the Constitution Center to allow an archeological dig that produced over\na million artifacts about the history of black Philadelphia.3 This example demonstrates not\nonly the contested nature of some of Philadelphia's most historically and politically important\nterritory, but also the first response on the part of the developers (representative of the city's\nwhite community) that unearthing African American history is not a priority. Only after\npersuasion from some of the city's major churches did the Constitution Center and National\nPark Service change their decisions.4 After hundreds of years' presence in Philadelphia, African\nAmericans are only just beginning to see themselves represented in the major public buildings\nof the city. In the past, African American identity was embodied in buildings that served only\n\nigure 1. This map, reprinted from the\ner\nPhiladelphia Inquirer, shows the siting of the Lib\nthe black community: churches, lodges, schools, etc. It was only visible to Philadelphia's white\ncommunity, however, through parades and an ephemeral presence in the street.\nImage removed for copyright purposes.\nFigure 1. This map, reprinted from the Philadelphia Inquir , shows the siting of the Liberty Bell Pavil\nion relative to George Washington's slave quarters and the Constitution Center bus depot relative to James\nDexter's home, an excavation of which has led to the retrieval of over 1 million historical artifacts.\nI will focus my inquiry on two different, but also politically significant sites: Broad Street\nand South Street, the procession routes for the Mummers Parade and Odunde Festival\nrespectively. Figure 2 shows Philadelphia divided into its four primary neighborhoods: Center\n\nImage removed for copyright purposes.\nFigure 2. This map shows the four main neighborhood divisions in Philadelphia: North, South, West, and\nCenter City. South Street and Broad Street, the sites of the Odunde festival and Mummers Parade respec\ntively are highlighted.\nCity, North Philadelphia, South Philadelphia, and West Philadelphia. Broad Street, highlighted\nin orange, is the north-south axis that runs from South Philadelphia through the middle of Center\nCity up to, around, and then beyond City Hall at Market Street. Once the primary city parade\n\nFigure 3. Beside a dollar store on the south-facing side of west South Street stands a large, recently renovated resi\ndence with ironwork window boxes and private garage. This mix of uses indicates that South Street is a contested\nboundary space.\nroute, it no longer serves that function with a few exceptions, including the Mummers Parade.\nThrough the nineteenth and early twentieth century, African Americans' presence on Broad\nStreet was often greeted with open hostility and sometimes violence. South Street, highlighted in\nblack, forms the southern boundary of Center City and has never held the same civic prominence\nas Broad Street. It has for many years been a social and commercial zone claimed by the\nneighborhoods both to its north and to its south. In the 1950s, the street was slated to become a\nhighway, causing massive disinvestment in the area. In the 1960s, residents organized an effort\nto block the highway plan and developed a counter-proposal for revitalization. Today the effects\nof that plan are visible in the form of high-end residential apartments, a Whole Foods Market,\nthe expansion of the Graduate Hospital, and a thriving retail corridor at its eastern edge. To\nthe east, facades alternate between newer residential development projects, older, rehabilitated\nhousing stock, upscale boutiques, dollar stores, and pubs. This interplay of elements speaks to\nthe contested nature of the street as a boundary zone. Figure 3 illustrates this difference.\nContent Overview\nThese are issues that I will examine in greater depth later in this thesis. In Chapter 2, I will\nreview the literature that discusses political identity in the context of the built environment.\nI will review the work of J. Mark Schuster on urban ephemera and their role in generating\n\nimages by which to read the city. I will compare this work with F.R. Ankersmit's approach to\nrepresentation in Aesthetic Politics, which suggests that collective action in space gives political\nmeaning to that space. Murray Edelman also addresses the relationship between the design of\nspaces and the political meanings communicated through their use. Within that framework, I\nwill explore the way that physical design of spaces and festival use of those spaces support and\nimpact formations of national identity. For that discussion I will review Lawrence Vale's work\nin Architecture, Power, and National Identity, with reference to Christine Boyer's work on the\nformation of collective identity through architectural and urban design. I will also examine\nDolores Hayden's Power of Place, which addresses the issue of whose identity and whose\nhistory is being communicated through design projects. The work of David Waldstreicher and\nSimon Newman provides an overview of the role festivals and festival culture has played in\ndefining national identity in the United States.\nIn Chapter 3, I will introduce the context of Philadelphia's history as a framework for\nunderstanding how the Mummers Parade helped build and reinforce racial identities in the city.\nI will begin my study in the early nineteenth century, before South Philadelphia was annexed\ninto the city in 1854. This period demonstrates the tension between ethnic immigrant populations\nliving outside the city boundaries and the elite, Anglo residents of the city proper. It also marks\nthe beginning of violent confrontations between European ethnic groups and African Americans\nin the city. After the city's consolidation and the Civil War, white immigrant groups began to\nmove in the direction of assimilation, and this intention strongly influenced the celebrations\nthat would become the Mummers Parade. During this period in the late nineteenth century, the\nMummers' dude and wench blackface couple came out of the minstrel show tradition. In my\nstudy of the Mummers in the twentieth century, I will show how they developed a language of\nexclusion that articulated their collective membership in a racially white Philadelphia while\nsimultaneously asserting their commitment to distinct ethnic identities.\n\nIn Chapter 4, I will discuss African American formations of identity in the public space of the\ncity from the late eighteenth century through the present form of the Odunde festival. National\nand international struggles against slavery starting with the end of the slave trade through\nsuccessful West Indian slave revolts and finally ending with the Civil War will provide a context\nfor African Americans' shifting perception of identity and their shifting use of the street. I will\nshow how with each attempt to enter mainstream society, they were spatially marginalized\nand excluded. White Philadelphians could either exclude black participation in their festivals\nand events (such as the Mummers Parade) or could antagonize them when they occupied the\ncity's ceremonial spaces (such as Broad Street or Independence Mall). I will discuss how the\nsimultaneous desire to integrate into American society while embracing separateness as a\nstrategy for achieving equality (in response to the oppression and exclusion the community\nfaced) manifested itself spatially in its public presence. The black nationalist movement of the\n1960s and 1970s is the most recent manifestation of this dichotomy and provides the immediate\ncontext for the birth of Odunde. Finally, I will argue that the festival does not create geographies\nof racial exclusion. Rather it attempts to shape an ethnic identity for Philadelphia's African\nAmerican community that asserts a political presence in the street to battle racial inequality in\nthe form of gentrification.\nChapter 5 will provide a more thorough comparison of the two celebrations. I will compare the\nroutes of the two parades in relation to the ceremonial spaces of the city. I will argue that the\nOdunde festival's location follows the pattern of marginalization laid out at the beginning of\nChapter 4 and that the Mummers Parade route is connected to the historical effort to claim major\npublic spaces for whites. Then I will explore the demographics of the two parades and their\nhistories of exclusion or acceptance in the context of the city's demographics as a whole. Here\nI will also account for trends in immigration and population changes since 1990. Third I will\ncompare their organizational structures, and finally I will look at their funding and sponsorship\nto understand to whom each group is accountable. This chapter will focus on the parades as they\n\nrelate to the current population of the city, though it will draw on their historical contexts. At the\nend of the chapter, a conclusion will synthesize the information of the last three chapters and\narticulate the role that these festivals have played in the formation of racial identities. Finally, I\nwill demonstrate that trends in the city's racial politics are clearly communicated through the two\nfestivals.\nMethodology\ngy\nMy primary resources for this thesis are secondary sources. Four dissertations about the\nMummers Parade have been written and represent years of field work and in-depth interviewing.\nThey have been a wealth of information. I chose not to replicate the methodology of those\ndissertations because my time was considerably more limited and because information about\nOdunde had not yet been compiled into any major research project. To supplement the work\nof these dissertations, I studied histories of Philadelphia and of black Philadelphia (they are\nrarely in the same source). I also used newspaper articles written about the Mummers over\nthe last ten years as well as the documentary Strut! released in 2002. For Odunde, I relied\nheavily on newspaper articles, and looked at every article mentioning the festival from the early\neighties until the present in The Philadelphia Inquirer, The Philadelphia Daily News and The\nPhiladelphia Tribune (the city's African American newspaper). A major source of information\nabout the festival's early history came from an oral history recorded by the Temple University\nUrban Archives of Lois Fernandez, Odunde's founder. I also reference essays written for the\nPhiladelphia Folklore Project's magazine, Works in Progress. This proved a useful source as\nit included scholarly commentary as well as direct quotes from participants and organizers.\nAnother major source was Oshunbumi Fernandez, executive director of Odunde, and the\ndaughter of Lois Fernandez.\nChoosing not to do ethnographic research limits my ability to speak to the meaning participants\nfind in the festivals beyond what is articulated in newspaper articles. As I make arguments, I\n\ndo not provide festival organizers or participants a voice in the discussion. While I appreciate\nthe importance of letting people speak for themselves and making sure that everyone's voice is\nheard with equal weight, I was disappointed in the way that the dissertations I read handled the\ncontroversial subject of race in the parade. Though blacks have participated in the parade by\nproviding musical accompaniment since the earliest years, their participation as Mummers ended\nwith the Depression. So, the fact that the writers interviewed only parade participants (including\nthe black musicians) meant that they presented a biased perception of the parade's meaning. In\ndiscussing the significance of the 1960s controversy over the Mummers using blackface, the\nresearchers completely neglected the perspective of black Philadelphians who might have been\noffended by the practice because they would not have been among the participants. Conducting\nethnographic research with such a poorly defined population as black Philadelphians who do\nnot participate in the Mummers parade is understandably difficult even within the scope of a\ndissertation. For a Master's thesis, such intensive research would have required more time and\nattention than I could dedicate. I would have liked to use ethnographic methods to research the\nOdunde festival because no comprehensive work has yet been done, but limited time and the fact\nthat I am based in Boston likewise made such research virtually impossible. I believe, however,\nthat the resources available to me provided ample support for my thesis.\n(Endnotes)\n1 Baldwin, James. The Fire Next Time. (New York: Dell, 1963).\n2 Goode, W. Wilson. In Goode Faith. (Valley Forge, PA: Judson Press, 1992). Goode served as mayor of\nPhiladelphia from 1984 to 1992.\n3 Salisbury, Steven. \"Slavery in the heart of freedom.\" The Philadelphia Inquirer. June 29, 2003. From www.philly.\ncom\n4 Salisbury, Steven. \"Site of ex-slaves home to be excavated.\" The Philadelphia Inquirer. February 06, 2003. From\nwww.philly.com.\n\nChapter 2. Acting our Difference: Space, Race, and Identity in Politics\np\ng\np\n,\n,\ny\nWhen most people hear the word politics, they first think of politicians. In his book Cultural\nGeographies, Don Mitchell finds that even the dictionary limits politics to \"the science of\ngovernment; that part of ethics which relates to the regulation of government of a nation or\nstate for the preservation of safety, peace, and prosperity; political affairs, or the conduct and\ncontests of political parties.\"1 In fact, political reality extends far beyond these tightly prescribed\nboundaries. Many political struggles occupy the cultural sphere as well as more explicit political\nforums. Television networks often become heated battlegrounds for political controversies from\ngay rights and the representation of homosexuality on television to televised campaigns and their\nassociated commercials. Mitchell suggests that the power of cultural politics lies in its ability to\n\"transgress\" these defined (and therefore official) boundaries, and while this speaks to the power\nof subtle influences, it is not a satisfying response to the question of how culture and identity are\nrelated to politics.\nRace and the politics of spatial practice, the other subjects of this thesis, also occupy different\nspheres. On January 16th and 17th, 2004, I attended a conference held at the Yale School of\nArchitecture entitled, \"Black Boxes: Enigmas of Space and Race.\" Organized by an M.Arch.\nstudent, Jennifer Newsom, it brought together eminent speakers who presented on topics ranging\nfrom the preservation of African American landmarks in Harlem (Michael Henry Adams),\nto a semiotic theory of blackness in architecture (Darrell Fields). Felicia Davis of Cornell\nUniversity presented historic walking tours of New York City and Robert Farris Thompson of\nYale University highlighted the presence of African architecture in the Americas. The conference\nfocused on the importance of marking and preserving the presence of African Americans' historic\ncontributions to society in the urban landscape and of rewriting our theory to acknowledge the\ninfluence that Africa has had in Western art and architecture throughout history. The conference\ndid not touch on politics at all, or how the topics presented related to identity and power in our\n\nsociety. The intersection of spatial practice, race, identity and politics is the subject I will explore\nin this thesis.\nMy perspective is grounded in the fields of architecture and urban studies, and I do not pretend to\nbe well versed in political science. For this reason my research is grounded in urban and cultural\nstudies, with references to only the work of only two political scientists: F.R. Ankersmit and\nMurray Edelman. In this chapter, I will review Mark Schuster's work on urban ephemera in light\nof Ankersmit's political theory to demonstrate how \"imaging the city\" is related to politicizing\nit. Following this, I will review Larry Vale's work on national identity and capital construction,\nM. Christine Boyer's work on collective memory, and Dolores Hayden's work on the \"Politics\nof Space.\"2 Next, I will examine the political nature of spatial practices linked to identity\nconstruction. I will use the example of festival culture in post-Revolution American nation-\nbuilding to examine how festivals can 1) challenge and alter dominant political ideologies and 2)\ncan reinforce a political order and exclude various groups from political participation.\nImaging the City and Politicizing Spaces\ng g\ny\ng\np\nA workable image requires first the identification of an object, which implies\nits distinction from other thing, its recognition as a single entity. This is called\nidentity... Second, the image must include the spatial or pattern relation of the\nobject to the observer and to other objects. Finally, this object must have some\nmeaning for the observer, whether emotional or practical.\nKevin Lynch3\nSpaces and buildings that exhibit clear formal identity and structure attract efforts to make them\nmeaningful. This is the connection between form and meaning that Kevin Lynch avoids making\nin Image of the City, but which is crucial to understanding the politics of urban design. Highly\nlegible public spaces often develop contested or contradictory meanings. The act of using those\nspaces becomes an act of meaning-making. The book Imaging the City, edited by Lawrence\nJ. Vale and Sam Bass Warner, Jr., branches out from Lynch's legacy and tackles questions of\n\nmeaning that Lynch himself would not touch. Using the term \"Imaging\" to replace Lynch's\n\"Image\" already refocuses the discussion on actors rather than just spaces, and this new focus\ncarries through the book. \"City imaging,\" Warner and Vale tell us in their introduction, \"is the\nprocess of constructing visually based narratives about the potential of places.\"4 Visual narratives\nimply the existence of a narrator, and thus of a particular perspective that may be challenged.\nVisual narratives that image the city need not only be spatial. Many of these narratives are\nconveyed through the media: newspapers, magazines, television, film, photography. Those that\nare spatial, often involve use of space rather than the creation of spatial form. J. Mark Schuster\ndelves into the role of what he terms \"urban ephemera\" in city imaging. He includes \"spectacles,\npageants, rituals,\" and celebrations in this classification as well as other, less prominent events\nthat contribute to the character of cities.5 While Schuster acknowledges that media coverage\nof ephemera contributes to its effect on city image, he emphasizes that most ephemera are\nnot generated for the media: \"they are shaped by citizens and passed along by local practices,\ncustoms, and word of mouth.\"6 These events shape the way that residents experience the city\nand the way that tourists visualize the city. In doing so, they convey meanings about the city's\nidentity and whom its spaces serve, though this is a point that Schuster does not address. He\nonly goes so far to say, \"Ephemera, like any other social activity, have the potential for serving\ncertain interests while conveniently ignoring others.\"7 Here he acknowledges that the meanings\nconveyed by ephemera do not necessarily represent the reality of the city. They convey a\nparticular image, and often they may be altered because the image they convey is not the image\nthat city decision-makers want to convey. Within this dynamic, the politics of ephemera and\nurban spaces emerge.\nAs meaning lies at the heart of city imaging, the most important lesson to take from Aesthetic\nPolitics by F.R. Ankersmit is that meaning and interpretation also lie at the heart of political\nreality. Ankersmit posits that aesthetics, rather than ethics, is the appropriate lens through which\nto understand political representation, and thus politics. He argues that \"political power has\n\nits origin neither in the people represented nor in the representative, but in the representation\nprocess itself.\"8 The representation process is one in which the meaning of representation is\ncreated and the identity of the representative in relation to the represented constructed. It is a\nprocess he likens to that of a painter representing a landscape:\nThe painting the artist makes of a landscape is not identical to the landscape\npainted, and still we do not speak of a conflict. The difference between the\nlandscape itself and its artistic representation is not a mere mistake in or\nshortcoming of the painting--on the contrary, precisely in this difference\noriginates all that might aesthetically please us. Hence, political 'reality,'...\ncomes into being in the hollow or the lee, so to speak, which political aesthetic\nrepresentation generates between the representative and the person represented. 9\nWhile this comparison is not exact in that it requires political representatives to assume the\nrole of both artist and painting, it illuminates a reality of politics that is missing from older\npolitical theory. In electoral politics, elected politicians usually represent diverse groups\nlinked only by the narrative consistency of a party platform10. That narrative emphasizes or\ngenerates connections between constituent groups so they will all elect to be represented by\nthe same politicians. The narrative also signifies the meaning behind that representation. Few\npeople believe that their representative is an exact replica of themselves, but as long as the\nrepresentatives' actions remain true to the overarching narrative, constituents are satisfied with\ntheir representation.\nThe relationship of urban design to politics is linked to the latter's need for expressions of\nmeaning. Political identities linked by super-narratives need two types of expression: first, they\nmust visually and spatially reinforce their unity and strength and second, they must allow their\nvarious factions to express individuality and variation within the context of that narrative. The\nformer may be accomplished through politically sponsored and organized events. The latter\ntype of expression is generally embedded in the cultural sphere so as not to weaken the power\nof its political identity. The hierarchical nature of public spaces in cities contributes to the\nspatialization of politics. The importance of space to politics is demonstrated by the constant\n\nredrawing of Congressional voting districts to ensure that those in power stay in power. Spaces\nthat have formal identity and legibility attract layers of meaning as competing groups attempt to\nclaim them. Controlling the most visible territory in a city is one of the most potent means that\nconstituent groups express political power.\nThese spatial and visual expressions of political power form the basic theoretical content of this\nchapter. I will examine first the politics of designing buildings and open space, and second,\nthe politics of using space, or the politics of spatial practice. The process of designing the built\nenvironment involves negotiations among politicians, designers, and other interest groups. It\nconstructs a visual representation of power, and can become a site of conflict. This section will\ndemonstrate the connection between formal considerations and the political identity of spaces.\nThe term \"spatial practice\" is used by Michel de Certeau in his book The Practice of Everyday\nLife to describe the way that the average person's experience of space is as important to shaping\nthe meaning of the space as was the intention of the designer, and that in fact a kind of dialogue\nexists between them.11 This section will examine the ways that meanings are imposed on\nspaces and challenged in spaces through de Certeau's \"spatial practice\" and Schuster's \"urban\nephemera.\"\nConstructions of Identity: Architecture and Politics\ny\nIn his book, Architecture, Power and National Identity, Lawrence J. Vale explores these issues\nin the context of building capital cities and capitol complexes. He draws on Ernest Gellner's\nwork on nationalism to support his own research into the politics that have shaped capitol design.\nGellner's observation that \"If the nationalism prospers it eliminates the alien high culture, but\nit does not then replace it by the old local low culture; it revives, invents, a local high (literate,\nspecialist-transmitted) culture of its own, though admittedly one which will have links with the\nearlier folk styles and dialects,\"12 underscores the problem of what symbolism a regime will\nchoose as a basis for its invented high culture. This is even more problematic in nations that are\n\nnot composed of homogeneous populations with a single, national \"low culture\" for inspiration.13\nIn such cases, the design of space is as much a site of conflict as it is a site to make power\nsymbolically visible. Most often the conflict is resolved in favor of the preferences of those in\npower in a manner that is not truly inclusive of the whole population:\nIn most places... the bold venture of capital city construction has been connected\nto the ruling elites' attempts to consolidate national unity and cultivate national\nidentity in the face of multiple contending groups located in rival urban centers.14\nHere Vale observes that while construction of capital cities is associated with building national\nidentity, the identity expressed in those cities is limited to only a portion of the population.\nBecause of this gap between who the city purports to represent and who it actually represents,\nthe city stands as a visual reminder of who holds the power in the country. If that representation\nexcludes or alienates some portion of the populace, that is simply another expression of its\npower. It is not far removed from the aesthetic gap of Ankersmit's political theory wherein the\npolitical representatives (and their visual expressions of power) do not accurately represent the\npublic. As Murray Edelman tells us in his book, From Art to Politics, \"Spaces affirm established\nroles by encouraging those who act and those who look on to respond to socially sanctioned\ncues and to ignore incompatible empirical ones. Spaces reaffirm a dialectic of hierarchical\ndistinctions.\"15 The built forms of capitol complexes are spaces that are infused with symbolism\nand meaning. They create a backdrop that, however architecturally explicit, provides only subtle\ncues to a populace about their place in a national identity, and through this subtlety, they act as a\npowerful political device.\nCapitols are not the only built form that carries political weight and meaning, however. M.\nChristine Boyer and Dolores Hayden both have explored the politics of identity expressed in\nurban space generally. In Boyer's book The City of Collective Memory, she writes about the\nways in which the urban form captures the past and creates a collective sense of memory and\nidentity. Aside from the \"vernacular landscapes\" that reflect \"local identity,\" she writes, \"there\n\nare... civic compositions that teach us about our national heritage and our public responsibilities\nand assume that the urban landscape itself is the emblematic embodiment of power and\nmemory.\"16 The process of creating these \"civic compositions\" is not static, however, because\nthe process of historical preservation is as political as the process of deciding what and where\nto build new. Boyer recognizes the inherently political nature of city design in all of its forms,\nand remarks on the fact that the power to control design is held in the hands of the few rather\nthan the many: \"Paradoxically, we seem to recognize that struggles over good city design are\nalways multistructured, requiring alternative viewpoints and spectator positions, and we do seem\naware of the exclusions our matrix17 engenders, but then we allow dominant voices to impose\nmeaning and to control the politics of representation.\"18 This observation resonates back to Vale's\nrecognition that the shape of capitols is more reflective of those who construct them than of the\npopulace. What Boyer recognizes is that the process of city planning and design is faced with\nsimilar constraints: a specific group of people working with a political administration to design\nspaces for a wider populace.\nDolores Hayden, in her book, The Power of Place, writes about how to capture social history in\ncities. Preservationist movements tend to focus on preserving buildings for their aesthetic rather\nthan social qualities of buildings and spaces, and Hayden presents an argument between Ada\nLouise Huxtable and Herbert Gans in the New York Times of 1975 to illustrate this distinction.19\nHayden is less concerned with cataloguing how memory is stored in the city than with how to\nexpand the city's \"civic compositions\" to include the identities and struggles of those who are\nmost often excluded: poor and working class residents, women, and minorities. She argues\nthat \"a politically conscious approach to urban preservation must go beyond the techniques of\ntraditional architectural preservation (making preserved structures into museums or attractive\ncommercial real estate) to reach broader audiences. It must emphasize public processes and\npublic memory.\" 20 Later in the book, she presents examples of projects that fall into this new\ncategory of preservation from \"Rediscovering an African American Homestead,\" which traces a\n\nproject to mark the midwife Biddy Mason's home, to \"Reinterpreting Latina History at Embassy\nAuditorium,\" which \"discusses the reinterpretation of a union hall used by Latina and Russian\nJewish garment workers.\"21 These projects are notable because they fall outside the normal\ncontemporary pattern of preservation. They memorialize the presence of outsiders--women\nand minorities--and they interpret their sites through a lens of social history rather than simply\narchitectural quality. These projects serve as a visual response to the perceived exclusionism of\nthe existing built environment, and they are the voice of the people, representing themselves to\nthose in power. This scenario is the exception to the rule, however, and for the most part, our\nurban landscape reflects the reality of the power dynamics that infuse our political system.\nThe Politics of Spatial Practice: Festival Culture and American Identity\np\ny\nPast work on the politics of urban design has focused primarily on built projects ranging from\nthe scale of a room in a building to that of a city. Unfortunately, this is too narrow a scope in\nwhich to consider questions of identity politics because the character of the built environment is\ngenerally controlled by only a small segment of society. Buildings and plans are manifestations\nof power and image the dominant political identity in cities and nations. In the context of nation-\nbuilding, Vale recognizes the limitations of built projects and planning schemes to articulate an\ninclusive national identity:\nCapital cities and the parliamentary buildings constructed within them would\nseem to be ready purveyors of national identity, since they are ostensibly built to\nserve and symbolize a nation-state as a whole. Frequently, however, since their\nsiting and appearance are chosen by the leadership rather than by the populace,\nthe resultant place hardly resembles a truly national identity. Architecture and\nplanning are often used as tools for promoting something called national identity,\nbut many dimensions of this phenomenon remain unarticulated.22\nBy expressing only the symbols of a country's most powerful groups, national architecture\nreinforces their power. As discussed earlier, architecture and planning turn space into a\nrepresentation of power and order. As such, they may be actively challenged or reinforced by\n\ncollective action within the space. An imbalanced expression of political identity in the built\nenvironment does not mean that other competing identities disappear from view entirely. Rather,\nthey emerge through spatial activity, which may either be explicitly political, cultural, or both.\nMichel de Certeau's concept of spatial practice illuminates the power of expressing political\nidentity through actions in space. Certeau writes in The Practice of Everyday Life, that \"the\nordinary practitioners of the city... walk; they are walkers,\" and he introduces a concept of\nspatial practice grounded in the way that people who do not design space use it, and the ways\nthat their movements activate and transform designed spaces.23 Certeau compares the act of\nwalking to the act of speaking in his chapter \"Walking the City\":\nThe act of walking is to the urban system what the speech act is to language or\nto the statements uttered... it is a process of appropriation of the topographical\nsystem on the part of the pedestrian (just as the speaker appropriates and takes\non the language); it is a spatial acting-out of the place (just as the speech act is\nan acoustic acting-out of language); and it implies relations among differentiated\npositions... (just as verbal enunciation is an 'allocution,' 'posits another opposite'\nthe speaker and puts contracts between interlocutors into action). It thus seems\npossible to give a preliminary definition of walking as a space of enunciation.24\nThus walking is the expression of the multitudinous voices represented by a government that\nexpresses its power visually through the design of its buildings and public spaces. The actions\nof every individual in an urban landscape are inherently political. However, this definition need\nnot be confined to the actions of a solitary walker. Group movements through public spaces,\nespecially those that challenge expectations about how certain spaces might be used and by\nwhom (those that \"transgress... the trajectories [they] speak\"25), must also carry significant\npolitical weight. Hayden recognizes this as well: \"Festivals and parades also help to define\ncultural identity in spatial terms by staking out routes in the urban cultural landscape. Although\ntheir presence is temporary, they can be highly effective in claiming the symbolic importance of\nplaces.\" 26 The use of spatial practice to assert political identity is not confined to those groups\n\nwho lack power or representation. The same groups who articulate power through construction\noften reinforce that power through other mechanisms as well. Vale observes that \"public\nstatements of collective identity take many forms and make use of many kinds of symbols for\nsupport... Objects and events, monuments and ceremonies, all contribute meaningful symbols to\nthe production and consolidation of the 'we.'\"27\nThe festival or parade, as spatial practice, engages in two political dynamics: 1. as an act of\ndeviance and conflict, it may challenge the existing political order; and 2. as a sign/representation\nit may reinforce the existing political order and articulate the spatial exclusion of particular\ngroups from that order. Festivals may engage in one or the other or both of these dynamics.\nIn a democratic society where parades have some popular local base many engage, either\nintentionally or unintentionally, in both. Even political parades in the United States often\nincorporate a popular, local component that allows for celebratory variations, some of which may\ndirectly challenge the idea of national political identity. In contrast, authoritarian governments\nuse highly regulated public processions to spatially and visually express a national identity to\nwhich all citizens would be expected to conform.\nDon Mitchell interprets spatial practices as potential acts of resistance or challenge to the social\norder. He writes that, \"numerous studies of everyday life have redefined 'resistance' as any act\nthat occurs in a way not fully intended by the 'powers that be.'\"28 He also considers the fact that\nresistance according to this definition is not a politically powerful act unless it has an audience.\n\"Resistance really can't be private,\" he says, \"What would be the point?\"29 What he calls\n\"oppositional power\" must be visible and collective:\n...for a resistant movement to be effective it must surely be social\nsocial rather than\nindividual; and certainly social movements must engage in strategic resistance.\nTo do otherwise would be simply to cede all power to those the movement\nopposes. If 'power is bound by its visibility,' as de Certeau (p.37) hopes, it is also\nmade possible by its visibility. And this is no less true of oppositional - resistant\n- power than of state or corporate power.30\n\nor\ngiven\nIn its collectivity, this power enters the realm of politics and in its visibility, the realm of\nspatial practice. Festivals fall into this category of spatial practice if they originate in popular\nmovements--de Certeau's definition of spatial practice is disconnected from power structures.\nHis practitioners are individuals or small collectivities operating outside the political realm.\nFestivals of resistance must also challenge social norms or at least be interpreted as doing so:\n'Resistance' can exist outside the intentions of those practicing it, but only if it is\n(usually later) organize\nganized as resistance, or given meanin\nmeaning by some influential group\nor another as resistance.31\nThese festival resistance activities create a visible representation of collective identity in\nopposition to the dominant identity associated with the built environment and thus politicize\nthose spaces as a challenge to that order.\nAnne Norton, author of Republic of Signs, argues that all festivals must reinforce the social order\nbecause they are embedded in it. She claims that \"the dissident can--and has--appropriated\naspects of the dominant culture to argue, mythically, for its subversion, yet they are hampered\nin such arguments by the inseparability of these myths from a history and a mythic frame that\nentails the dissident's reaffirmation of their marginality.\" 32 Cultural practices occurring within\nspace are likewise subject to the dominance of the physical domain. In his book From Art to\nPolitics, Murray Edelman notes the role of spaces in reinforcing social norms: \"Spaces affirm\nestablished roles by encouraging those who act and those who look on to respond to socially\nsanctioned cues and to ignore incompatible empirical ones. Spaces reaffirm a dialectic of\nhierarchical distinctions.\"33 For this issue, carnival is an interesting case-in-point because of\nits explicit subversion of cultural norms in the space of the street. According to Norton and\nothers, the fact that inverting of social norms is sanctioned for a single day (or week) reinforces\nthe social order that remains in place for the rest of the year. Don Mitchell acknowledges the\n\nof the Str\n\ntheory of carnival that categorizes it as means of controlling dissent in society. He refers to Tim\nCresswell's In place/out of place when he observes that \"carnivalesque moments... temporarily\ninvert the world: the moment is either officially limited (as with Mardi Gras) or their subversive\npower is reabsorbed into dominant structures of power and ordered norms of culture.\"34 As much\nas its form gives space and opportunity to social and political transgressions, it also places them\nin a marginal relation to the power structures of society. However, the fact that such festivals\ndo not overturn basic political and societal structures is crucial to their continued existence.\nThey are sites of resistance rather than revolution, and as such, they simultaneously affirm\nand challenge the spaces they occupy and the social norms enforced in those spaces. A more\ninteresting example of how social norms are enforced through festivals is one that is organized\nby the dominant social group or one that explicitly articulates national identity.\nOne such example of how spatial practices can both reshape and reinforce a national power\nstructure is seen in United States history: in the late eighteenth and early nineteenth centuries,\nDemocratic Republicans used public celebrations to popularize political support for their party\nand wrest control of the government from the Federalists. The texts Parades and the Politics\nof the Street\neet by Simon P. Newman and In the Midst of Perpetual Fetes by David Waldstreicher\nexplore this topic in great detail.35 The example is important for two reasons: first, it demonstrates\nthat control of popular, public celebrations is as important to politics as controlling architectural\nsymbolism, and second, it demonstrates how control of those celebrations can further isolate and\ndisenfranchise portions of society (in this example, blacks and women).\nPolitical celebrations after the American Revolution gave working class white men a space of\nopposition from which to challenge the elite Federalists. The Democratic Republican Party,\nwhich represented those men, quickly realized the opportunity local celebrations offered for\npopularizing politics and building a larger constituency.36 Newman notes:\nWith remarkable rapidity, ordinary Americans developed a shared symbolic\n\nand ritual language of political expression, and celebrations of Washington's\nBirthday, Independence Day, and the French Revolution assumed common forms\nthroughout the nation... While on the one hand this new, shared language of\npolitical activity bound Americans together, on the other it furnished them with\nthe means to wage partisan political warfare against one another in the streets and\npublic places of the new republic.37\nBy using celebrations to develop new political identities, Democratic Republicans were able to\neffectively challenge a power structure dominated by elites. In fact, they were so successful in\ntheir efforts, that Federalists eventually abandoned such nationally important public celebrations\nas the Fourth of July, choosing instead to satirize the Republican celebrations.38 Their celebration\nof the Fourth was decried by Democratic Republicans as \"hypocritical\" because they did not\nactually support the basic tenets of the Declaration of Independence.39 Contrary to the Anne\nNorton's argument that their control of festivals could only emphasize their marginality in a\nnational power structure, it actually \"fortified... their [Democratic Republicans'] struggle to\nwin control of the polity itself.\" By 1801, the Democratic Republicans had elected their first\ncandidate to office: Thomas Jefferson, and continued to control the White House until 1829. In\nthis example, celebratory practices actually amassed political power.\nThose same practices, however, also reinforced aspects of the dominant culture. Despite claiming\nto celebrate Independence for \"we the people\" instead of \"we the noble, chosen, privileged\nfew,\"40 the Democratic-Republican celebrations promoted a unified national identity that\npurposefully excluded blacks and women. The territories of their celebrations actually became\nsites of conflict. As Waldstreicher says, \"If elections were wars, then every celebration was a\nbattle,\"41 and each battle determined with greater certainty who would be a part of the national\nidentity.\nThe battle was waged both in terms of whose festivals were adopted as part of the nationalist\ncause, and who attended (and spoke at) popular nationalist celebrations. So while French\nRevolution festivities were quickly incorporated into the Democratic Republican repertoire,\n\n\"African American innovations, especially the early nineteenth-century celebrations of the\nanniversary of Haitian Independence Day and the end of the slave trade, were marginalized by\nthe Democratic Republican coalition in an attempt to exclude them from the discourse of early\nnational popular political culture.\"42 This exclusion was supplemented and amplified with efforts\nto keep blacks from participating in national freedom celebrations. Newman writes:\nThe Fourth of July commemorated the republican rights and freedoms secured\nby American white men in a long and bloody revolutionary war between king\nand subjects. When black revolution erupted in Haiti in 1791, white Americans\nfeared that the contagion of liberty and violent revolution might spread to the\nsubordinate black peoples of the United States. As a result of these white fears,\nthe dramatic expansion of Independence Day during the 1790s was accompanied\nby a systematic exclusion of black Americans from celebrations of the Fourth.43\nAs blacks struggled to create a national public identity for themselves celebrating the promise\nof freedom and equality, their public presence at Democratic Republican celebrations could\nattract a violent response. In Philadelphia in 1805, for example, black Philadelphians were\ndriven violently from the square in front of Independence Hall and physically excluded from the\nfestivities. The year before, African Americans had terrified Philadelphia's white citizenry: \"After\nforming themselves into unofficial military units, parodying the white militia parades seen earlier\nin the day, they marched through the city, beating white citizens who crossed their paths, and\n'damning the whites and saying they would shew them St. Domingo.'\"44 White Philadelphians,\ndespite their tolerant, Quaker heritage, did not support granting African Americans full freedom\nand equal rights and the Caribbean slave revolts of the late eighteenth and early nineteenth\ncenturies threatened their preferred social order. By repressing black celebrations of these events\nand excluding blacks from any freedom celebrations, the Democratic Republicans promoted a\nnational identity that reinforced the status quo of racial inequality.\nConclusion\nPopular celebrations construct meaning in space. They form, challenge, and reinforce cultural\n\nand political narratives of identity. Understanding a parade or festival as a site of political\nrepresentation requires consideration of how it resists and affirms a political order. The primary\npurpose of the festival--either challenging or reinforcing an existing political order--suggests\nthe relationship between the identities constructed within the festival and the dominant national\nidentity. Analysis of a festival's political significance involves examining five components:\n1) its historic socio-political context (as has already been mentioned) both locally and in\nrelation to national discourses; 2) the location of the festival or parade route in relation to the\nmost prominent public spaces in the city; 3) the demographics of who participates and who is\nexcluded; 4) the organizational structure and its connection or disconnection from city politics;\nand 5) who funds and sponsors the festival. Chapters 3 and 4 will provide the historical context\nfor the case studies of this thesis: the Mummers Parade and the Odunde Festival. Chapter 5 will\nperform a comparative analysis of the last four criteria.\n(Endnotes)\n1 Don Mitchell, Cultural geography: a critical introduction, (Oxford; Malden, MA: Blackwell Publishers, 2000) p.\n158.\n2 Dolores Hayden, The Power of Place. (Cambridge, MA: The MIT Press, 1996). p. 14.\n3 Kevin Lynch. Image of the City. (Cambridge, MA: The Technology Press and Harvard University Press, 1960). p.\n8.\n4 Warner, Sam Bass Jr. and Vale, Lawrence J. Imaging the City. (New Brunswick, NJ: Center for Urban Policy\nResearch, Edward J. Bloustein School of Planning and Policy, 2001). p. 8.\n5 Ibid. Schuster, Mark. \"Ephemera, Temporary Urbanism, and Imaging.\" p. 362.\n6 Ibid. p. 378.\n7 Ibid. p. 393.\n8 F.R. Ankersmit Aesthetic Politics. (Stanford, CA: Stanford University Press, 1996). p. 53.\n9 Ibid. p. 50.\n10 This phenomenon can be seen in the ability of the Republican Party to link religion conservatism with fiscal\nconservatism in the latter half of the twentieth century, a process discussed at length by Lisa McGirr in Suburban\nWarriors. (Princeton, NJ: Princeton University Press, 2001).\n11 Certeau, Michel de. The Practice of Everyday Life. (Berkeley, CA: University of California Press, 1984). Part III.\n\"Spatial Practices.\"\n12 Lawrence J. Vale, Architecture, Power, and National Identity. (New Haven: Yale University Press, 1992). p. 53.\n13 Ibid. p. 49.\n14 Ibid. p. 44.\n15 Murray Edelman, From Art to Politics: how artistic creations shape political conceptions. (Chicago: University of\nChicago Press, 1995). p. 80.\n16 M. Christine Boyer, The City of Collective Memory. (Cambridge, MA: The MIT Press, 1994) p. 321.\n17 \"Designers of urban projects, especially in the 1970s and 1980s, seemed intent on arranging and detailing\nornamental places of the city until a matrix of well-designed fragments appeared.\" M. Christine Boyer. The City of\nCollective Memory.\n\n18 Boyer, M. Christine. The. p.2.\n19 Hayden. p. 3-5.\n20 Ibid. p. 11\n21 Ibid. p. xiii\n22 Vale, p. 47.\n23 Certeau. Part III. \"Spatial Practices.\"\n24 Ibid. pp. 97-98.\n25 Ibid. p. 99.\n26 Hayden. p. 38.\n27 Vale, p. 47\n28 Mitchell. p. 148.\n29 Ibid. p. 151.\n30 Ibid. p. 153. Referencing Michel de Certeau. The Practice of Everyday Life.\n31 Ibid. p. 159.\n32 Anne Norton, Republic of Signs: liberal theory and American popular culture. (Chicago: University of Chicago\nPress, 1993). p. 166.\n33 Edelman. p. 80\n34 Mitchell. p. 162. Tim Cresswell, In place/out of place: geography, ideology, and transgression. (Minneapolis:\nUniversity of Minnesota Press, 1996).\n35 Newman, Simon P. Parades and the Politics of the Street. (Philadelphia: University of Pennsylvania Press, 1997).\nand Waldstreicher, David. In the Midst of Perpetual Fetes: The Making of American Nationalism 1776-1820.\n(Chapel Hill: University of North Carolina Press, 1997).\n36 Newman, p. 186\n37 Ibid.\n38 Waldstreicher. p. 207\n39 Ibid. p.206\n40 Ibid.\n41 Ibid. p. 196\n42 Newman. p. 191.\n43 Ibid. p. 103\n44Ibid.\n\nChapter 3. Riot and Revelry: The Mummers Parade and the Spatial Construction of White\np\ny\np\nIdentity\nOn or about the first day of every year, there is a lilt in the air, a song on the town;\nprinces and clowns, columbines and harlequins dance in the streets. Serpents and\ndevils; angels and sinners; young and old; blend into one massive, undulating\nbright colored throng. Blue, red, and yellow capes; white satin daisies; plush-red\nroses; laughter and life cover the city. The sound comes before the sight--Oh,\nDem Golden Slippers, barely heard, then swelling as thousands of banjos and\nglockenspiels feed out of the narrow lively streets into Broad Street. They come\nout of the heart of Philadelphia, these unique \"Shooters\" in their stunning and\nincongruous magnificence, and the rest of Philadelphia--at least a million and\na quarter people--stand to watch them: a Viking carrying a hundred square feet\nof costume, a Fancy Captain with a train a block long, uncountable clowns in\nindescribable array, a myriad of musicians--the work of a year expended on one\nday of glory.\nCharles E. Welch1\nThe Philadelphia Mummers Parade is an amalgam of tradition and innovation, play and politics,\nan event that cannot ever be fully described. The \"heart of Philadelphia\" referenced above by\nCharles E. Welch (the pre-eminent Mummers scholar and author of Oh, Dem Golden Slippers)\nis South Philadelphia, extending from South Street to the point at which the Delaware and\nSchuylkill Rivers meet. The population of this section of the city has always been predominantly\nworking-class, and the area has been a major point of entry into Philadelphia for immigrant\nfamilies. The traditions of today's Mummers grew out of the mixing of folk traditions brought\nover from Europe by the immigrants who settled in the city. Originally known as Shooters for\nthe Swedish practice of shooting guns in the air to ring in the new year, they were also called\n\"Mummers\" after the German \"Mumme\" or \"mask\" because their celebrations incorporated\nmasquerade as groups of men would visit homes and asking for food and drink in exchange\nfor short performances. Mummers, or \"rustic actors wearing outrageous disguises\" were also\ncommon in England throughout the nineteenth century.2\nToday's parade retains only vestiges of those original traditions, the most prominent of which\nis the practice of masquerading. Today's Mummers are split into three divisions: Comic Clubs\n\nImage removed for copyright purposes.\nFigure 4. 2002 Mummers Comic Club\nImage removed for copyright purposes.\nFigure 5. 2002 Mummers String Band\nImage removed for copyright purposes.\nFigure 6. 2002 Mummers Fancy Division\nImage removed for copyright purposes.\nFigure 7. 2002 Mummers Fancy Brigade\n(Fig. 4), String Bands (Fig. 5), and Fancy Clubs\n(Fig. 6). Fancy Brigades (Fig. 7) still perform in the\nConvention Center, but they are no longer part of\nthe Philadelphia New Years Shooters and Mummers\nAssociation (PNYSMA). Each has its own rules and\njudging criteria, but all Mummers dress in costumes\ncoordinated to present a theme to the audience. A\nprize purse that grew from $1,625 in 1901 to almost\n$400,000 in 2003 is controlled by the city and is\nused as leverage to censor the content of the parade's\nperformances.3 The grandeur of the costumes and\nperformances and the working class background of\nmost Mummers inspired Welch to dub them \"Kings\nfor a Day,\" and encouraged the city to celebrate the\nparade as an event of carnivalesque role-reversal. The\nmost famous character in Comic Clubs is the wench,\na man dressed in women's clothing (Figure 8). The\nwench was originally part of a couple: the Dude and\nWench: a blackface couple who disappeared in the\nmid 1960s when the use of blackface was banned by\ncity officials in response to protest from the city's\nblack population. The parade has a long history of\nexclusion. Until 1980, no women were allowed to\nparticipate in the parade in any capacity. Blacks\nparticipated as Mummers in the parade's earliest\nyears, but by the Depression were limited to musical\naccompaniment. Many of the brass bands that gave\n\nthe Comic Clubs music to strut to are dominated by black musicians. Though blacks are no\nlonger barred from participating in the parade as Mummers, few have joined the festivities in\nthat capacity.4 Welch's description captures the spirit of the parade, and reflects the romanticism\nwith which the Mummers themselves tend to characterize their celebration. It does not, however,\ncapture the conflict and controversy that has surrounded the Mummers throughout their history.\nImage removed for copyright purposes.\nFigure 8. This explanation of the Mummers' Wench character was originally featured in the Phila\ndelphia Daily News and is now hosted on a number of Wench Brigade websites.\n\nThe Philadelphia New Year's Day Mummers Parade has been characterized as an opportunity\nfor white ethnic (Swedish, Irish, German, Polish, Italian, etc.) working class Philadelphians to\nrule the streets of a city historically characterized by strong class divisions.5 Because the parade\nwas born out of a tradition of challenging social norms in the public space of the street, its\nhistory provides insight into middle and upper class Philadelphians' insecurities about the street\nthroughout the nineteenth and twentieth centuries.6 This chapter will contextualize the Mummers\nparade in terms of class and racial tensions in the city by focusing on three major turning points:\nthe 1901 sponsorship of the parade by the city, the 1964 controversy over the use of blackface\nin the parade, and the 1994-1999 controversy over moving the parade to Market Street. It will\nexamine each intervention first in terms of the wider context of insecurity and conflict over\nthe street, and then in terms of the city's response to that insecurity through measures directly\naffecting the parade. On a broader scale, this paper will illuminate how urban design politics\n(especially the politics of race and identity) are played out in the ritualized use of public spaces\n(e.g. parades) not just in the control of constructed forms.\n1901 Parade Inception\np\nIf a city's streets are safe from barbarism and fear, the city is thereby tolerably\nsafe from barbarism and fear. When people say that a city, or part of it, is\ndangerous or is a jungle what they mean primarily is that they do not feel safe on\nthe sidewalks.\nJane Jacobs7\nUnderstanding the importance of the city's decision to sponsor the parade in 1901 requires\nrecognition of the historical tensions in Philadelphia. As discussed in the previous chapter, the\nearly nineteenth century was marked by the need to claim territory both literally and figuratively\nwithin a developing national identity. Because working class and black populations dominated\nSouth Philadelphia neighborhoods, those neighborhoods and the public space within them\nbecame highly contested territory between blacks, immigrants and 'native' working class, all\ncompeting for entry into the newly formed nation. In contrast, in Center City (which outlined\n\nthe city limits until 1854), the elite classes dominated public life, if not public celebrations.\nThe rowdiness of South and North Philadelphia came to Center City in the form of working\nclass people, and that rowdiness inspired great insecurity. When the City Council decided\nto include the Mummers, South Philadelphia at its most flamboyant, in Philadelphia's 1901\nMillennium celebration and officially sanction their antics, the desire to control such behavior\ndoubtless swayed its choice. After a century of public conflict and contestation, city streets\nembodied insecurity and their control a sign of civilization and good government. This conflict\nand insecurity took many forms, but this chapter will focus on the conflict expressed as rioting\nagainst blacks and immigrant Irish, especially in the first half of the century, and insecurity\nexpressed by the settlement patterns of Philadelphia's elite classes and the city's efforts to\nregulate South Philadelphian Shooter's celebrations.\nRiots during the early nineteenth century were a source of increasing insecurity for\nPhiladelphians. Two types of riots marred Philadelphia's early history. First, the 1830s witnessed\na series of riots against Philadelphia's black population in South Philadelphia and the Northern\nLiberties. 8 Then, the year 1844 marked the bloodiest riots in the city's history of Protestant\nnatives against Irish Catholics, in neighborhoods both north and south of downtown. As long\nas its ramifications remained confined to the streets and residents outside Center City, however,\nrioting did not raise much public outcry. Only the riots of 1842-- when the rioters against\nblacks in North Philadelphia turned on a sheriff's posse who had come in to protect the black\nresidents--and 1844--when rioters invaded the streets of Center City after destroying a Catholic\nChurch in Kensington--inspired a concerted effort by the city to restore public order.9 This last\nriot was so disturbing to the populace that all of Philadelphia County was brought under martial\nlaw in order to bring the violence to an end and eventually led to the consolidation of the county\ninto a single municipality under civil law in 1854. A statement made by General Patterson while\nhe controlled the county with his militia in 1844 demonstrates the force of response against the\nrioting and associated insecurity:\n\nOrder must be restored, life and property rendered secure. The idle, the vicious, the\ndisorderly must be curbed and taught to understand and respect the supremacy of the law\nand, if they will not take warning, on their own heads be the consequences.10\nThe city's consolidation of 1854--and the standing police force associated with it--greatly\nreduced violence in the city streets, though some outbreaks continued. The most notable of these\nis the election riots of 1871, in which black voters were systematically murdered to ensure that\nImage removed for copyright purposes.\nFigure 9. Spatial Analysis 1811. All settlement is still concentrated in the east. \"Respectable,\" \"Doubtful,\" and Afri\ncan American neighborhoods all penetrate beyond the South Street Boundary.\ncity Democrats stayed in power. The murder of Octavius V. Catto, an educator and leader in the\nblack community who had worked to ensure that blacks exercised their newly regained suffrage,\nmarked the end of the riots and inspired sympathy from white Philadelphia (this event will be\ndiscussed in greater detail in Chapter 4).11\n\nThe spatial articulation of this growing insecurity can be seen in the residential settlement\npatterns of the nineteenth century. These have been traced in an article written by Norman J.\nJohnston for the Journal of the American Institute of Planners in 1966. Johnston shows that the\nProtestant churches of Philadelphia were highly stratified by class. He compares the occupations\nand incomes associated with each congregation to demonstrate the presence of class distinctions.\nImage removed for copyright purposes.\nFigure 10. Spatial Analysis 1838. Settlement is pushing west. Only \"Doubtful,\" and African American neighbor\nhoods penetrate beyond the South Street Boundary.\nThen he maps the residential distribution of each congregation in his study, and a distinctly\nclass-based spatial distribution emerges. This distribution is characterized by \"Fashionable,\"\n(those neighborhoods dominated by the upper-class congregations of Christ Church and First\nPresbyterian Church) \"Respectable,\" (those neighborhoods dominated by the middle-class\n\ncongregations of First Baptist Church) and \"Doubtful\" neighborhoods (those dominated by\nthe lower-class congregations of St. George's Methodist Episcopal Church) as well as what\nhe terms a \"Negro Enclave.\" The pattern that emerges of the Fashionable and Respectable\nneighborhoods dominating the Center City supports the understanding that the areas to the\nnorth and south were a source of insecurity to the middle and upper classes, which continually\nImage removed for copyright purposes.\nFigure 11. Spatial Analysis 1856. Settlement has pushed west of Broad Street. African American neighborhoods\ndominate the South Street Boundary.\nchose to live near the center. Figures 9, 10, and 11 are taken directly from the article and show\nthat the \"Fashionable\" and \"Respectable\" city neighborhoods shifted from a concentration in\nthe east along the Delaware River and Market Street in 1811 to a concentration along the city's\ntwo major axes: Broad Street and Market Street by 1856. It is interesting to note that after 1811,\n\n\"Respectable\" neighborhoods do not ever extend south of South Street. Also important to note\nis that these maps do not include a study of Catholic congregations, and thus do not account for\nthe city's growing Irish-Catholic population, which settled primarily in Kensington (north) and\nSouthwark and Moyamensing (south) districts, all of which would be considered by 1856 (Figure\n5) to be \"Doubtful\" areas.12 The presence of a growing immigrant Catholic population likely only\nheightened the tension between the central city and its peripheral neighborhoods.\nYule-time celebrations practiced by residents of South Philadelphia reinforced these feelings\nof insecurity even after they were transformed into more organized parade activities with the\ninception of New Year's Shooters Associations in the 1880s. Early celebrations have been\nclassified as charivari (shivaree) by Anthony B. Newkirk in his dissertation on the Mummers\nParade. Charivari, an Italian word, demonstrates the influence of yet another immigrant\ngroup. Newkirk defines it as \"'rough music'... ritualized acts of personal violence or property\ndestruction.\"13 In Philadelphia, charivari was expressed through the practice of men and boys\ndressing in costume and going from house to house to sing and perform in exchange for food\nand drink. On New Year's Day these revelers would celebrate by shooting guns in the air (hence\nthe name 'Shooters'). The nineteenth century was characterized by regular (unsuccessful) efforts\nto ban or severely limit working class charivari practices, and upper class diaries record the\ndistaste held for the Shooters' celebrations. In 1805, Elizabeth Sandwich Drinker, the wife of a\nQuaker merchant and local politician, recorded in her diary hearing \"a dull heavy thumping...\n[and] after listening concluded that the... noise was a Kittle-drum [sic]--a strange way of\nkeeping Christmas.\"14 In 1808, the Anti-Masquerade Act was passed, though in its 51 years of\nexistence no arrests for masquerading in Philadelphia were recorded, though upper-class distaste\nfor the practice continued to grow. In 1845 the Public Ledger\nPublic Ledger ran a condemnation of Christmas\nrevelers, calling them \"demons.\"15 Not until the city's consolidation in 1854 did regulation of\nChristmas and New Year's celebrations enjoy any measure of success. When the city outlawed\nthe practice of \"playing of horns and 'horse fiddles' in public\" in 1868, over one hundred people\n\nwere arrested the next year, and over the next few years, \"loud curbside Christmas celebrations\nsubsided sharply.\"16\nDuring the second half of the nineteenth century, especially in the 1880s, major changes in\nthe structure of the celebrations occurred, but they did not lessen public insecurity. By the\n1880s, South Philadelphian immigrant groups who had struggled for a place in the national\nidentity for half a century began to use Mummers activities as a vehicle for assimilation and\nAmericanization. New Year's Shooters Associations formed. Only nominally related to their\npredecessors (the Shooters of the early nineteenth century), these groups provided social\nsupport to their member families, engaged in civic boosterism, and organized informal parades\nof Mummers in their neighborhoods.17 Minstrel shows inspired the dude and wench blackface\ncharacters that would form the backbone of the comic performances. Although the use of\nblackface can be traced to European masquerading traditions not inherently tied to racial\nconstructs, its use in the Mummers Parade stemmed from American minstrel practices of the\nlate nineteenth century that were directly tied to social constructions of race. Figure 12 shows\nan early photograph of Mummers in blackface. This tradition was brought to Philadelphia\nin the person of Frank Dumont, who owned Dumont's minstrels and composed minstrel-\nshow music that was published and available to musicians and music schools for purchase.\nHis nephew, Charles Dumont brought knowledge of this minstrel music to the New Year's\nAssociations, several of which he played with as a musician.18 Many important elements of the\nparade have derived from this tradition from the famous Mummers' strut (supposedly derived\nfrom the cakewalk) to \"Oh, Dem Golden Slippers,\" their signature song. Though this song\nwas written by James Bland, an African American, it was part of the minstrel tradition (this is\nevident from the cover of the sheet music in Figure 13).19 The influence of the minstrel show\non the parade is important because as a national phenomenon, it shaped negative stereotypes of\nAfrican Americans in the minds of whites. Within the context of the Mummers parade, it was\ninstrumental in promoting ideas of 'whiteness' that had been used to assimilate Irish, Polish,\n\nFigure 12. This photograph depicts Mummers dressed\nas wenches in blackface before it was banned from the\nparade in 1968.\nFigure 13. Despite being composed by an African\nAmerican, the Mummers theme \"Oh Dem Golden\nSlippers\" demonstrates the influence of minstrelsy on\nthe Mummers of the 20th century.\nand Italian immigrants into the Anglo political\npower structure during the nineteenth century.20\nThough it never presented a unified position on\nAmericanization and Anglophilia, the parade\nwas a forum for white ethnic Philadelphians to\nparticipate in that discourse and reinforced the\ndominant social order.\nThese efforts at assimilation did not eliminate\nconflict and violence from the street celebrations.\nDressed in women's clothes and painted in\nblackface, Mummers of the late nineteenth\ncentury could safely engage in public\ndrunkenness, bawdiness, and general rowdiness\nwithout fear of reprisal. And their performances\nattracted crowds of spectators. As these practices\ngrew, businesses began to offer prizes to\nencourage parading (with its associated group of\nspectators) on their streets. Rivalries abounded,\nand violence was common. One year, a group\nof businesses in Frankford and Kensington\nraised $1000 in prize money to lure a group of\nMummers who didn't come, and the next year\nexacted their revenge by throwing projectiles\nat any Mummer not from their neighborhood.21\nAccording to Frank Zampetti, Sr., the decision\nfor the city to sponsor the parade was intimately\n\ntied to the disorderly conduct of the Associations:\n[T]he politicians... [said]... 'get them off the neighborhood streets fighting with\neach other'--they really did get in fights [when] one section would try to rip the\ncostumes off the other one--'let them parade [through] the whole city and we'll\ngive prize money out.' And that sort of cooled them down.22\nAs the parade has evolved under the supervision of City Hall, its rowdier side has become\nritualized into tamer forms of expression. For example, one Mummer recalls how excited he was\nto be a Mummer as a teenager because the parade was the one day when it was okay to French\nKiss girls.23\nH. Bart McHugh was the theatrical agent for local string bands who made the suggestion to J.\nHampton Moore, secretary to Mayor Ashbridge, that the city invite the Mummers to parade\nthrough the city for the 1901 New Year. Although the true motives of the city officials who\nfollowed through on Bart McHugh's24 suggestion have been obscured in history, the move\neffectively brought the Mummers' street celebrations within the control of City Hall. Prize\nmoney that had been provided by businesses in neighborhoods since the late 1880s was suddenly\ncontrolled by City Hall and taken from city tax dollars. The activities of the Shooters and\nMummers, once scattered throughout neighborhood streets on the periphery of Center City,\nwere now confined to a straight route lined by a police presence on either side. This presence is\na reminder of the authority of City Hall, which looms over Broad Street as the Mummers parade\ntowards it.\nWhile City Hall is the endpoint of the official parade, and the location of the judging stands,\nthe parade continued on to Columbia Avenue (renamed Cecil B. Moore Avenue in 1987), well\ninto North Philadelphia, then turned down Columbia and returned to South Philly by way of\nTwo Street through the 1920s. Tension between the parade and the city's black community is\nevident this early in the twentieth century by the fact that the Mummers shortened that unofficial\nroute back to Girard Avenue around 1927 in response to an influx of African American residents\n\ninto the neighborhoods around their original route. Though this would be the first time these\ntensions would alter the parade spatially or visually, it would not be the last. Andrea Ignatoff\nRothberg, in her dissertation, titled Philadelphia Mummery: Individual Rewards and Social\nInteraction, demonstrates this relationship by comparing the parade route changes with shifts in\nthe racial composition of the adjacent wards.25 Figure 14 shows the official parade route in solid\nred ending at City Hall, and the unofficial route continuing north along dotted lines. The shaded\nareas represent the black population percentage in Philadelphia neighborhoods circa 1940. As\nthe neighborhood around Columbia Avenue (now Cecil B. Moore Avenue) shifted to a black\nmajority, the parade route shifted south to Girard Avenue and a neighborhood still less than 50$%\nblack.\nFigure 14. Percentage of black population in Philadelphia neighborhoods in 1940 overlaid with Mummers parade\nroutes. The route shifted south away from a growing black population around the original route.\n\nCity Hall does not simply loom over the parade, but also serves as a literal site of judgment\nwhere the doling of rewards is decided. The city's control of the parade's prize money has given\nit real leverage by which to regulate the Mummers' behavior since the early years, and the city\ndid not hesitate to exercise this power when it saw fit. The city rarely issued direct threats, and\nneeded only urge the Mummers to act according to their wishes. In his dissertation on the parade,\nAndrew B. Newkirk notes that\nIn the 1930s [parade director George B.] McClernand and the PNYSMA26\ncomplied with City Council admonitions to downplay \"controversial\" issues\nand stress \"good-humored\" ones instead. This meant avoiding biting criticisms\nof local government, the Republican and Democratic Parties on the local and\nnational levels, domestic public policies, U.S. foreign relations, and world events.\nWhile many Mummers' acts, placards, and floats referred to concrete issues, the\noverwhelming majority were so trivial as to be inane.27\nThen, in 1942, the city enacted a wage tax, and issued a statement condemning Mummers' satire\nof the levy: \"Don't poke fun at the wage tax. After all, many city employees have received and\nmerited and needed pay increases from the tax. It isn't a proper subject for caricature...\"28 A\nmore recent example of the city's control over the parade is the controversy over a Mummers\nclub's intention to parody the Catholic Church's sexual abuse scandals in the 2003 parade. Mayor\nJohn Street issued a statement saying \"I am personally offended by this and regret that under the\nConstitution I am limited by what I am able to do about it,\" in early January (the parade that year\nwas postponed until January 4th). The Mummers subsequently dropped the skit (it never actually\nwent up the street), claiming that \"it was a hoax all along.\"29 Other restrictions have limited the\nmachinery of floats, the types of props that can be used, and a variety of other parade elements.\nThe consistent effort on the part of City Council to regulate controversy out of the public space\nof the street reflects an understanding of the street as a place of instability that must be kept free\nof potentially inflammatory messages. This is seen more clearly during the 1964 controversy\nover the parade's use of blackface.\n\nRev. John T\n1964 Blackface Controversy\nUnfortunately, some persons, for their own purposes, seized on this issue of an Al\nJolson type of theatrical makeup, distorted it out of all reasonable perspective,\nand used it as an instrument to fan the fires of intolerance, prejudice, and bigotry.\nLawrence H. Eldredge30\nIt has to go. To some it may sound like quibbling but when it's judged in relation\nto the whole picture it takes on a different light... Negroes associate it with\nsomething that runs deep in them: the dignity of the person and equality with\nother individuals.\nRev. John T. Mitchell\n. Mitchell31\nBy the mid-twentieth century, most public appropriation of the street in Philadelphia was\nheavily regulated by a strong police presence. Conflicts during this period often played out\nbetween residents (often protestors) and the police. Some, as in the case of the Mummers Parade\nblackface controversy, played out as much in public discourse as in the space of the street itself.\nExamining stories of the controversy reveals evidence of a pervasive public insecurity about\nconflict over control of the street.\nSince the late nineteenth century and the return of suffrage to African Americans, black\ncommunities across the country had begun working to increase their political power in order to\nbreak down the inequality and prejudice they faced. Organizations like the NAACP made huge\nstrides in securing civil rights legislation that guaranteed protection of African Americans under\nthe Constitution. Organizations such as the Urban League worked simultaneously to promote\nthe economic advancement of blacks. By the middle of the twentieth century, however, the\nlimited success of both efforts led to the increasing popularity of direct-action strategies. Sit-ins,\nboycotts, and demonstrations brought an African American political presence into the streets of\ncities across the country in a highly visible manner. In the 1950s, Rosa Parks refused to move\nto the back of the bus and The National Advisory Commission on Civil Disorders observes that\n\"a 'new Negro' had emerged in the South--militant, no longer fearful of white hoodlums and\nmobs, and ready to use his collective weight to achieve his ends.\"32 In Philadelphia around the\n\nsame time, black religious leaders began a campaign to end the use of blackface in the Mummers\nParade. They argued that the city's prize money is taken from taxpayers, and that black\nPhiladelphians' money should not go to reward an activity that publicly insults them. J. Charles\nShort, an attorney sitting on the Philadelphia Bar Association Panel on Community Tensions\nexplained in a newspaper article that \"Negroes... are asking whites to 'refrain from labeling the\nNegro as a buffoon and forcing him to live down the image of a clown.'\"33 As this tension built,\nthe Mummers shortened their parade a second time from Girard Avenue to Spring Garden Street\nin 1959 in response to the increased proportion of blacks living in the wards surrounding Girard\n(Figure 15).34 Though the City Council did respond to black residents by adopting a resolution\nthat would end the use of blackface in the parade, they quickly backed away from the decision\nFigure 15. Percentage of black population in Philadelphia neighborhoods in 1960 overlaid with Mummers parade\nroutes. The route shifted further south in 1959 in response to the changing racial composition of North Philadelphia\nneighborhoods east of Broad Street.\n\nwhen the Mummers threatened to move their parade to New York City. The issue was not\nrevisited until 1963, when Cecil Moore became head of the local NAACP.35\nThis time around, after seeing the failure of measures in the 1950s to stop the use of blackface,\nthe NAACP was not satisfied with the city's request that judges not award prizes to paraders\nwearing blackface makeup. Instead, Cecil Moore took their argument that \"black taxpayers\ndid not want to pay for their own ridicule,\" to court, asking for an injunction to stop blackface\nMummers from participating in the parade. When the injunction was denied, the Congress of\nRacial Equality (CORE) declared their intention to picket the length of the parade, accepting any\nviolence that might be levied against them. In response the Philadelphia Council of Churches\ntook the position that violence should be avoided, warning that \"bloodshed was possible because\nof the deep hatred that had built in blacks over the years toward the practice.\"36 This was a\nposition that reversed the assumption that white Philadelphians would respond to black protestors\nviolently, as the statement by CORE had suggested, and one that grew to overshadow the initial\ndebate over whether blacks should have to fund their own ridicule. The racial insecurity in\nPhiladelphia in the early 1960s is illuminated in this dialogue around the use of blackface in the\nparade and black Philadelphians' intention to protest the practice in the street.\nRace riots in Philadelphia broke out in the summer of 1964, so it should come as no surprise that\nalready by the end of 1963 these insecurities were coming to the fore. At the final hearing before\nthe parade, Police Commissioner Howard Leary testified that CORE was recruiting protestors\nfrom Harlem in New York City and \"that the police were advised to watch 'the rooftops because\nthat is the way the people from New York operate.'\" This testimony was obviously intended to\nplay on public fears about blacks as a threat to public safety in the streets. The final decision\nhanded down stripped all parties of their First Amendment rights and prohibited both blackface\nmarchers and protestors. 37\n\nDespite city officials' long history of using their control of prize money to censor and regulate\nthe parade, James Tate, the mayor of Philadelphia during the blackface controversy, was hesitant\nto issue a statement regarding the use of blackface. Rather, the conflict was brought before the\ncourt, whose decision clearly demonstrated that the city's first priority was the maintenance of\n'public order'--or, in other words, control of the street--even at the expense of constitutionally\nprotected rights. When a decision was finally handed down by the courts, it was based on the\nfact that \"the court could not allow individuals to exercise their constitutional right to march\nin blackface if, by so doing, they would create public disorder.\"38 In response to the threat of a\npermanent injunction, the threat to move the parade to New York City was reissued, as well as a\nthreat to move the parade into a stadium where admission would be charged. Not until November\nof 1964 did Mayor Tate announce the city's \"firm policy that public funds should not be used\nas prize money for any individual or group which causes conceivable embarrassment to any\nrace, creed, or color\" thus bringing a permanent end to the use of blackface in the parade.39 By\nthat time, the conflict that already illuminated the underlying fears of Philadelphians about the\ndangers of public space and the underlying tensions of its multiple populations.\n1990s Move to Market Street\nThe City and especially ED RENDELL would love nothing more than to see the\nCOMICS disappear. They seem to forget that we are the originals and deserve a\nlot more respect then we get. The day Rendell leaves offi ce will be the greatest day\nin the history of Mummery. He took a great parade and attempted to ruin it. Well,\ntoo bad, it ain't happening.\nAnonymous40\nDuring the first half of the twentieth century, the Mummers Parade united the city's ethnic\nworking class populations with its elites under the white racial category, but this racial unity\nobscured the fact that those ethnic populations were neither unified nor in control of the city.\nDuring the 1950s and 1960s, white working class residents had to fight against urban renewal\nplans with their African American neighbors. By 1947, a ring of highways around Center City\nhad been designed by the Planning Commission.41 This system included highways along Vine\n\nStreet, 2nd Street, the South Street-Bainbridge corridor, and the Schuylkill Expressway, and its\nfunding was approved by Congress in the mid-1950s.42 Figure 16 shows Edmund Bacon's 1963\nplan for Philadelphia, which depicts this highway network. While the Vine Street and Schuylkill\nRiver highways met little resistance or opposition, organized resistance to the location of\nInterstate 95 along Second Street succeeded in moving the highway between Front Street and the\nDelaware River and eliminated the South Street Expressway completely. The fact that Interstate\n95 was originally scheduled to run the length of Two Street in the 1950s indicates just how little\nthe decision makers in City Hall really identified with the Mummers' constituency.\nImage removed for copyright purposes.\nFigure 16. Taken from Bacon's 1963 Plan for Philadelphia, this image shows a highway plan in place since the late\n1940s. The red road network around Center City is the highway proposal. Other colors indicate land-use, public\ntransportation and activity centers.\nIn the 1960s, Philadelphia struggled to reconcile two opposing forces. City officials saw the\ndecline that accompanied de-industrialization and decided to target middle-class suburbanites in\ntheir urban renewal strategies at the expense of their working class populace. Edmund Bacon's\nplan for Center City ruthlessly carved out swaths of dense, working-class housing to create\nshopping centers, tourist attractions, middle- to upper-income housing, and transportation\nfacilities. At the same time, community organizations began to grow and pressure the city to\n\nchange its policies. Demonstrations were staged. Riots broke out. And as the urban renewal\nstrategies began to bring newcomers into the city and the character of neighborhoods began to\nchange, the pressure and tension increased.\nAt the same time, the 1960s signaled a major shift in population and control of the city. Many\nof the city's old Anglo elite had left for the suburbs (the same elites the city was trying to\nattract), and a mayor from an immigrant background came to office in 1962: James Tate was\nPhiladelphia's first Irish mayor. From that point onward, all the major 2-term mayors in the city\nwould be either an ethnic white or an African American. In 1967, Frank Lazarro Rizzo became\nthe city's first Italian Police Commissioner, who would later be elected mayor in 1972. Born\nand raised in South Philadelphia, Rizzo came from a Mummer community and would become\nthe Mummers' strongest city representative. Philadelphia's African American community\nmobilized politically and made their presence felt in the 1960s as well. It continued to move into\nthe white-ethnic working class neighborhoods of North Philadelphia, and in 1968, the unofficial\nparade route shifted southward a third time (Figure 17). In keeping with the historical tensions\nbetween African Americans and white ethnic groups, as both groups began to assert themselves\npolitically, the city's landscape of racial politics changed dramatically. This section will compare\nthe Mummers' relationship to Frank Rizzo and Ed Rendell, the city's two most prominent white\nmayors from the latter-half of the twentieth century, in terms of the city's racial politics with a\nfocus on Rendell's effort to move the parade to Market Street.\nDespite the fact that both Rizzo and Rendell come from white ethnic communities (Rizzo, Italian\nand Rendell, Jewish), each earned a distinct reputation with the African American community,\nand each took a different position about the relationship between Center City and its neighbors\nto the north, south, and west. Rizzo's inflammatory language and law-and-order policy as well\nas his inability to \"distinguish between black criminals and black activists\" earned him the\nreputation of a racist and enemy to Philadelphia's black community.43 His loyalty to his home\n\nFigure 17. Percentage of black population in Philadelphia neighborhoods in 1980 overlaid with Mummers parade\nroutes. In 1968 the unofficial route moved to Arch Street, no longer in North Philadelphia, and well south of major-\nity-black neighborhoods.\nterritory meant that his presence was felt as strongly in the neighborhoods surrounding Center\nCity as in Center City itself (and some black residents might say his presence was stronger\noutside the central city). Rendell, on the other hand, billed himself as a friend to the black\ncommunity. He is known for going into the homes of white suburbanites and telling them that\ntheir reason for disinvesting in Philadelphia is that they associate the city with blacks and that\nthey were wrong to do such a thing. Such was his method of fundraising. Unlike Rizzo, however,\nRendell did not see any hope for the neighborhoods outside of Center City. They were too poor\nand had too many problems for him to be successful helping them. So he focused his energies on\ncreating a tourist city whose main attraction would be Center City.\n\nIn 1972, the city elected Police Commissioner Frank Rizzo to be its mayor. Rizzo is best known\nfor two things: for being a South Philadelphia native who is a champion for the Mummers\nand for being an unapologetic racist. As the former Police Commissioner and with a highly\ncharismatic persona, Rizzo mobilized the working class of Philadelphia to get him into office\nand keep him there for two terms. His appointment as Police Commissioner under James Tate\nallowed Tate to attract both a white constituency who believed that Rizzo would maintain the\nsocial order and a black constituency that routinely voted for the Democratic candidate. As\nmayor, Rizzo was careful to be racially balanced in his political appointments while encouraging\na violent police response to signs of unrest in the black community--including civil rights\ndemonstrations. \"free Mumia\" graffiti scrawled across Rizzo's mural in South Philadelphia in\n2004 (over 10 years after his death) highlights the conflicted relationship between Rizzo and\nPhiladelphia's black community. Rizzo's relationship with the Mummers is quite different.\nDuring Rizzo's two mayoral terms, the Mummers received a surge in prize money from the\ncity and funding for their very own Museum at Second and Washington Streets, and no doubt\ncould remain that the Mummers, now embodied in the city's mayor, were a truly Philadelphian\ninstitution.44 Even after his last term as mayor, Rizzo's prominence in the city only enhanced\nthe Mummers' reputation, and not until after his death in 1991 did the parade begin to notice a\nprecipitous decline in spectatorship.45\nThat decline also coincided with Ed Rendell's mayoral victory (Rizzo had been running against\nRendell at the time of his death). Rendell's interest in promoting Center City as a tourist\nattraction and the much-publicized decline in spectators along the Broad Street route worked\ntogether to move the parade to Market Street intermittently from 1995 to 1999 and permanently\nfrom 1999 to 2003. Rendell's project to turn South Broad Street in Center City into the Avenue of\nthe Arts precipitated the initial move to Market Street in 1995. He did not hide his desire to turn\nthe parade into a tourist attraction easily accessible to commuter transit and the new Convention\n\nCenter, but he was politically savvy enough to leave the decision to the Mummers themselves.\nNewspapers, however, consistently framed Rendell's effort to move the parade route to Market\nStreet in terms of the debate about spectatorship and its decline. The issue of crowd size was\nso critical to the debate that the police estimate for 1994 was revised up from 22,000 spectators\nto 60 or 70,000 in response to criticism from the Mummers.46 A general agreement exists that\nthe crowds have dropped significantly in the last decade from 200,000 to 300,000 during the\n1980s and early 1990s to current estimates that are consistently below 100,000. This decline has\nbeen attributed to the out-migration of Philadelphia's white-ethnic working class population to\nthe suburbs and to its color broadcast on local television stations, but also, importantly, to the\nparade's inability to appeal to the remaining population of the city.47 A comparison of Figures\n13 and 14 shows the change in the percent of white population in Philadelphia's census tracts\nbetween 1990 and 2000. This population continues to decline relative to Philadelphia's nonwhite\npopulation especially in South Philadelphia. In his dissertation, Andrew B. Newkirk includes\ninformation from an interview with James F. Kenney, a Mummer and City Councilman in which\nhe commented on this trend and its relation to the parade:\n\"[T]he people who used to watch and care about [the Parade] either died or\nmoved away and we never reached out to any other group of people in the city.\"\nIt has been for this reason and the availability of television, argues Kenney, that\nfewer Philadelphians line Broad Street on New Year's Day today than was the\ncase fifty years ago.48\nKenney's thoughts are telling because a great deal of the conversation about moving the\nparade centered on the decline in spectators coming out to watch the parade. The cost of\npolicing 2.5 miles of parade route was beginning to seem disproportionate to the benefit\naccrued to the city through revenues to businesses.\nRendell's clash with the Mummers over their parade route reinforced their ethnic\nSouth Philadelphian identities and their white Philadelphian identity. As a mayor who\nfocused his money and policies on Center City and its affluent business community,\n\nJeff Ferr\nthe Mummers' rejection of him spoke to their neighborhood loyalties. By framing\nthat rejection in terms of their celebration of Frank Rizzo (not uncommon), however,\nthey associated themselves with the racially polarized rivalry between the two mayors\nemphasizing their white racial identity. Rendell's focus on turning the Mummers into a\ntourist attraction, a visual representation of Philadelphia to visitors and residents alike,\nreinforced their identity as a Philadelphian institution. Moving the parade to Market\nStreet, with its connection to commuter transit systems and to the Convention Center, also\nmeant looking outside the city boundaries to the suburbs that the city's white population\ncontinues to seek rather than to its nonwhite populations within. The parade's role in\nreinforcing racial hierarchies of the early twentieth century and the Mummers' conflict\nwith the city's black population in the 1960s are markers in the parade's history that\nindicate why the parade has been unable to successfully market itself to the city's non\nwhite population. Moving the parade to Market Street responded to the problem of low\nspectator turnout but avoided addressing what the parade really means to the city. Mayor\nJohn Street's decision to ring in his second term by returning the parade to its Broad\nStreet home was appropriate because he is perhaps more committed to the neighborhoods\nsurrounding Center City than to the central city itself.\nConclusion\nFrom Disney's Times Square to Dunier's sidewalk vendors, the city's public\nspaces--parks, streets and street corners, shopping districts, residential\nenclaves--function not only as utilitarian arrangements, but also as deep\nrepositories of meaning for those who own them, occupy them, move through\nthem. Put simply, public space always becomes cultural space, a place of\ncontested perception and negotiated understanding, a place where people of all\nsorts encode their sense of self, neighborhood, and community.\nJeff Ferrell\nell49\nThe moments in which the Mummers Parade in Philadelphia becomes a site of change, conflict\nand controversy are the moments that expose the breaking points of the city's encoded sense of\n\n\"self, neighborhood, and community.\" The reaction of the city government against the charivari\nbeginnings of the parade exposed the tensions between the different economic classes of the\ncity. Because these classes were spatially distinct from one another as demonstrated by Norman\nJ. Johnston, tensions between the center city and its outlying areas were also expressed in\nthe nineteenth century conflict between the city and the Shooters. Race riots and the threat of\nviolence throughout the nineteenth century shaped the upper class central city's understanding\nof South Philadelphia neighborhoods as unsafe, unstable places. This understanding was\nunderscored by a fear of violence stemming from racial and ethnic clashes and a growing desire\nfor public order at all costs.\nThe formation of New Years Associations in the late nineteenth century and the organization\nof their celebrations into neighborhood parades was part of a trend of Americanization of\nimmigrants but still allowed Shooters to use the public space of the street as a site of conflict and\npolitical protest. When the city sponsored the parade in 1901, it physically inserted the authority\nof City Hall into the parade by running the parade route up a police-patrolled South Broad Street\nto the judges' stands at City Hall before allowing the parade to continue up to the businesses\non Girard Street and Spring Garden. In this way, the city eliminated violence and political\ncontroversy from the street space. What they were left with then, was a public vehicle by which\nto demonstrate a non-violent social hierarchy. The portrayal of blacks, Asians, and Native\nAmericans as simple, harmless, exotic, and entertaining was a way of reinforcing their status as\nlower class Americans, while simultaneously reinforcing the political construct of \"whiteness\"\nthat would unite native Anglo Americans with incoming European immigrants (thus lessening\nthe threat of violent clashes between them). 50\nBy the 1960s however, the parade's portrayal of blacks was no longer acceptable to the black\ncommunity of Philadelphia, especially because the parade's prize money was taken from taxes\npaid as much by blacks in the city as by whites. The nature of the conflict over the parade's use\n\nof blackface highlighted the very same insecurities that had developed during the nineteenth\ncentury: the expectation of violence as a result of racial conflict in the street (as opposed to\npeaceful protest) and the valuing of public order above the protection of individual rights. The\nargument used by the Mummers for continuing the practice was that it was a part of the parade's\ntradition. Justifications cite the use of lamp-black as a means of disguise for light-skinned people\nas flour has been used for dark-skinned people, but these justifications overlook the strong\ninfluence of minstrelsy on the parade in the late nineteenth century. That influence profoundly\naltered the meaning communicated by the use of blackface in the parade, such that as late as\n1984, black and white photographs depicting Mummers in dark makeup (the photographer\nclaimed it was blue and green) were removed from a City Hall exhibit because of its resemblance\nto blackface. ''They don't belong anywhere in City Hall,'' said Mayor W. Wilson Goode, \"They\nare an insult to black people and should be removed.''51 The political significance of the use of\nblackface by the Mummers remains so strong that records of it have been virtually erased from\npublic view.\nThe racial dynamics of today's parade are different from those of the early twentieth century. The\nMummers have developed an identity that unites their various ethnic identities in a white racial\ncategory, but they still retain their distinction from the Anglo identity of Philadelphia's historic\nelite. Ed Kirlin, Associate Producer of Strut!, the Mummers' documentary, notes, \"The Mummers\nare almost like their own ethnicity. We have every ethnicity in the parade, but Mummers\nthemselves sometimes think of themselves more as Mummers sometimes than they think of\nthemselves as Irish, Lithuanian, or Polish.\" Today these almost-assimilated, mostly-white\nMummers parade up Broad Street in whiteface or two-toned makeup and are accompanied by\nblack musicians and drill teams. Comic Club themes like the club Froggy Carr's \"Jamaican me\nFroggy\" (2004) still appear on occasion but they are in the minority (Figure 18). In that theme\nin particular, some blackface Mummers made an appearance but were reprimanded and asked to\nremove their makeup before reaching the judges stands. Fancy Brigades perform mini-Broadway\n\nshows in the Philadelphia Convention Center featuring\nthemes like \"The Wonders of Ancient Egypt\" presented\nby the Shooting Stars (2004), and \"The Isle of Doctor\nMoreau,\" the winning presentation by the Jokers (2004).\nImage removed for copyright purposes\nPotential new Mummers groups must lobby City Hall to\nparticipate in the parade but few are granted permission\nbecause of the length of the existing parade.52 The\nGoodtimers, a club started in the 1980s, is the only\nblack-owned comic club, but nevertheless marches with\nFigure 18. Froggy Carr Jamaican\nmostly white Mummers taken from other groups. As\nTheme, 2004.\nthe proportion of whites in Philadelphia declines, the\nparade is less capable of adapting itself. Throughout the twentieth century, its primary adaptation\nstrategy had been changing the parade route to avoid areas with growing black populations,\nbut as the city continues to waffle about whether the parade will be on Market Street or Broad\nStreet, it remains unclear whether that intervention is sufficient to regain parade spectators. The\nparade's intimate connection to the racial politics of the city--embodied in Frank Rizzo and Ed\nRendell--only weakens its ability to appeal to a broader audience. The parade has always been a\nrepresentation of the white communities in South Philadelphia, and as those communities shrink\nin proportion to non-white communities, the question remains whether or not the parade can hold\npositive meaning for multiple groups in the city.\nThe Mummers parade can be most accurately read as a reflection of popular American culture\ntransformed into a day of revelry and masquerade. While the comics and even occasionally\nthe fancies may include political satire in their repertoire, the string bands and fancy brigades\nare much more whimsical than either comical or political. They pick themes that will allow\nthem to create ornate costumes and entertaining dance routines and set pieces. In Strut, the\nMummers documentary, Mickey Adams, captain of The Shooting Stars, likens the fancy brigade\n\nperformances to a Broadway show condensed into four and a half minutes, and the influence of\nBroadway and other popular entertainments is clearly visible in the dancing, set pieces, and even\nthe themes.53 Themes featured in Strut\nStrut included \"The Wonders of Ancient Egypt\" presented by\nthe Shooting Stars, and \"The Isle of Doctor Moreau,\" the winning presentation by the Jokers.\nThe characters included Egyptians and \"natives\" of Dr. Moreau's South Seas Island portrayed\nwith a kind of nineteenth century exoticism not uncommon on Broadway itself. The brigades are\njudged on costumes, performance, production, and overall effect. The Mummers' self-proclaimed\nprimary motivation is \"bragging rights in the neighborhood.\"54\nWhile the parade does not articulate its intentions as racial or even political for that matter, it\nasserts a multi-ethnic, racially white identity on Broad Street year after year. Its performances\nand costumes reflect the current waves of popular culture, which for better or worse still bear the\nmarks of a segregated society despite efforts at integration. And whether on Broad Street, Market\nStreet or inside the Convention Center, the Mummers are a representation of Philadelphia, and\nthey make it quite clear that being a true Philadelphian means being white.\n(Endnotes)\n1 Welch, Charles E. The Philadelphia Mummers Parade: A Study in History, Folklore, and Popular Tradition.\nDissertation in Folklore and Folklife. University of Pennsylvania, 1968.\n2 http://www.compulink.co.uk/~l-hodges/wadard/mummers.htm\n3 Welch, Oh Dem Golden Slippers, p. 48; also Newkirk, Anthony B. The Philadelphia New Year's Day Parade: A\nHistory of Urban Carnival and Culture. Dissertation. Temple University, 1998.\n4 \"String Band Request Rejected,\" The Washington Post. December 27, 1984. First Section; Around the Nation; A6.\n5 Charles E. Welch, Oh Dem Golden Slippers\n6 For discussion about the challenging of social norms in the street, see Newkirk, Anthony B. The Philadelphia New\nYear's Day Parade: A History of Carnival and Culture; and Rothberg, Andrea Ignatoff. Philadelphia Mummery:\nIndividual Rewards and Social Interaction. University of Wisconsin, May 1980.\n7 Jacobs, Jane. The Death and Life of Great American Cities. (Random House: New\nYork, 1961) pp. 29-30.\n8 Willis, Arthur B. Cecil's City: A History o f Blacks in Philadelphia 1638-1979. (New York: Carlton Press, Inc.). p.\n9 Willis, p. 25. Also, Feldberg, Michael. The Philadelphia Riots of 1844. Contributions in American History, no. 43.\n(Westport, CT: Greenwood Press, 1975). p. 114 \"The burning of St. Augustine's marked the last major outbreak\nin the Kensington riots. The transfer of the rioting to the city, home of Philadelphia's elite, seems to have marked a\nturning point... [A]fter the violence had struck close to home, Philadelphia's leading citizens started taking measures\nthat would not only end the Kensington riots but eventually transform the city from a preindustrial battleground to a\ncharacteristically modern, urban bastion of state-enforced order.\"\n\n.\n10 Feldberg, p. 115.\n11Willis. pp. 39-40. Though this marked the last time that blacks were systematically persecuted on a large scale, it\ndid not guarantee their general safety: \"The election riot of 1871 was the last time that the interiors of private homes\nwere consistently violated. By the 1890s, although a black man in a largely black district might still be assaulted on\nhis own doorstep by a passing white stranger, the district itself was safe from invasion.\" from Lane, Rodger. The\nRoots of Violence in Black Philadelphia, 1860-1900. (Cambridge: Harvard University Press, 1986). p. 20.\n12Johnston, Norman J. \"The Caste and Class of the Urban Form of Historic Philadelphia,\" Journal of the American\nInstitute of Planners, November 1966, pp. 341, 345, 347. and Feldberg, Michael. The Philadelphia Riots of 1844: A\nStudy of Ethnic Conflict. Contributions in American History Number 43. (Westport, CT: Greenwood Press) 1975.\n13 Newkirk, p. 10.\n14 Taken from Newkirk dissertation, pages 32, 41-42. Newkirk also notes that \"Devout Quakers especially had little\nregard for plebian street celebrations because they were signs of 'riot and dissipation.'\"\n15 Ibid. p. 44-45.\n16 Newkirk, Andrew The Philadelphia New Year's Day Parade: A History of Carnival and Culture. pp.47-48.\n17 Ibid.\n18 Newkirk, 1998. p. 93-95; and Valania, Jonathan. \"The Mummers vs. the Men of the Cloth.\" The Philadelphia\nWeekly, Vol. XXXII, No. 2. January 8, 2003. http://www.philadelphiaweekly.com/archives/article.asp?ArtID=4969\n19 http://mywebpages.comcast.net/wench/graphics/wench.gif. Also see Newkirk, p. 11-12.\n20 For a detailed discussion of the parade's role in the Americanization process, see Newkirk, Chapter 3 \"Rituals of\nAssimilation: The Parade Takes Shape,\" pp. 60-111, Chapter 4 \"The Shooters and Civic Pageantry,\" p. 112-150 and\nChapter 5 \"'Harmony of Color': The Shooters, Americanization, and Nativism,\" pp.151-187. For more information\non minstrelsy's influence on whites' perceptions of blacks, see White, Shane \"It Was a Proud Day,\" The New African\nAmerican Urban History. Kenneth W. Goings, Raymond A. Mohl, ed. (Thousand Oaks, CA: SAGE Publications,\n1996).pp. 32-34.\n21 Rothberg, Andrea Ignatoff. Philadelphia Mummery: Individual Rewards and Social Interaction. Dissertation.\nUniversity of Wisconsin-Madison, 1980. pp. 70-71.\n22 Newkirk. 1998. p. 60.\n23 Ed Kirlin. Strut! Max L. Raab Productions; 2002 Sidmax Productions.\n24 This action has also been credited to Jacob Seeds, the City Council Chairman at the time. See Newkirk, p. 96\nand Masters, Patricia Anne. The Philadelphia Mummers Parade: A Sociological Study of Play and Community.\nDissertation. American University: Washington, DC, 1998 p. 125.\n25 Rothberg, Andrea Ignatoff. Philadelphia Mummery: Individual Rewards and Social Interaction. University of\nWisconsin, May 1980. pp. 73-76 and Appendices A, B, C.\n26 Philadelphia New Year's Shooters and Mummers Association\n27 Newkirk, p. p. 204-205. Referencing \"Politics Banned by Mummers,\" Evening Bulletin December 19, 1939, 1.\n28 Welch, Charles E. Oh, Dem Golden Slippers. (Thomas Nelson Inc: New York, 1970). p. 134-135.\n29 \"Mummers Group Skips Clergy Sexual Abuse Skit,\" The New York Times. January 5, 2003. Section 1; Page\n21; Column 1; National Desk. also, \"Mummers Club Drops Controversial Priest Parody,\" CBS-3, KYW-TV\nPhiladelphia, January 4, 2003. http://kyw.com/news/local_story_004194146.html.\n30 Eldredge, Lawrence H. \"A Legal Dissent.\" The Philadelphia Bulletin. January 7, 1964.\n31 Quoted by Martin J. Herman, \"Priest Suggests Blackface be Dropped by Mummers.\" The Philadelphia Bulletin.\nNovember 17, 1964.\n32 From Rueter, Theodore. The Politics of Race: African Americans and the Political System. (Armonk, NY: M.E.\nSharpe, 1995). Chapter 2, \"Rejection and Protest: An Historical Sketch.\"\n33 \"Blackface Ban For Mummers\" The Philadelphia Inquirer. November 11, 1964.\n34 Rothberg, pp. 73-76, Appendices A, B, C.\n35 Willis, pp. 75-76.\n36 Willis, p. 133-134. \"Louis Smith, chairman of CORE, said, \"We will picket the full length of the parade. If there\nis violence and we get beat[en], then we will take our beating.\" Referenced from \"CORE Threatens Mummers with\nHuman Chain,\" Philadelphia Bulletin, December 30, 1963, p.1.\n37 Willis, p. 135, referenced in \"Court Bans Blackface, Pickets from Broad Street,\" Philadelphia Bulletin, January 4,\n1964.\n38 From Willis, p. 135.\n39 Willis, 137.\n\n40 This quote was taking from a Mummers site that allowed viewers to post their responses. The site is http://www.\nwrybread.com/gametone/mummers/memories.shtml, and the quote was posted January 23, 1999.\n41 Levy, Paul R. Queen Village--the eclipse of community: A case study of gentrifi cation and displacement in a South\nPhiladelphia neighborhood. (Philadelphia: Institute for the Study of Civic Values, 1978). p. 55.\n42 Ibid.\n43 Daughen, Joseph R. and Binzen, Peter. The Cop Who Would Be King. (Boston: Little, Brown & Company, 1977).\np. 132.\n44 Odom, Maida. \"The Spirited Offerings of Odunde.\" Philadelphia Inquirer. June 10, 1991. Local, p. B02.\n45 Attendance estimates are highly subjected and controlled by the police department. Rizzo's connections to that\ndepartment (as former Police Commissioner) and his loyalty to the Mummers suggest that he may have helped\nmaintain attendance estimates reaching into the 300,000 range.\n46 Woestendiek, John. \"A Mummer's Flap Over Crowd Size,\" The Philadelphia Inquirer. Monday, January 3, 1994.\nSection B, Page 1, Column 2.\n47 Von Bergen, Jane. \"The Marketing of the Mummers,\" The Philadelphia Inquirer. Tuesday, December 29, 1998.\nSection A, Page 1, Column 3.\n48 Newkirk. 1998. p. 210.\n49 Ferrell, Jeff. Tearing Down the Streets. (Palgrave, New York: 2001) p. 12.\n50 Newkirk, Andrew B. in his dissertation The Philadelphia New Year's Day Parade: A History of Urban Carnival\nand Culture. Dissertation. Temple University, 1998; discusses the parade's role in the Americanization process in\ngreat detail. See esp. Chapter 3 \"Rituals of Assimilation: The Parade Takes Shape,\" pp. 60-111 and Chapter 5 \"\n'Harmony of Color': The Shooters, Americanization, and Nativism,\" pp.151-187.\n51 \"Mummers Pictures Rejected,\" The New York Times. December 31, 1987. Section C, Page 15, Column 2.\n52 \"String Band Request Rejected,\" The Washington Post. December 27, 1984. First Section, Around the Nation; A6.\n53 Strut! Max L. Raab Productions; 2002 Sidmax Productions.\n54 Fred Keller, Ibid.\n\nChapter 4. Odunde and the Spatial Marginalization of Black Identity\np\np\ng\ny\nI never really understood why we stood perched together on the South Street\nBridge throwing fruit, flowers, honey, and money into the murky Schuylkill River,\nbut it was fun, exciting and mysterious. The walk to the river had something\nto do with Oshun. Oshun, the Yoruba deity of rivers was a concept I did not\ncomprehend. Did she live in the river? I didn't know, not at the age of 10... Year\nafter year, my mother and I would stay the entire day until we limped home after\nhaving our fill of fried fish sandwiches, lemonade, fruit cups, and bean pies.\nOdunde was always hot, crowded, noisy, and friendly. People you would see on\nthe streets at other times of the year with frowns on their faces were now smiling,\nlaughing, and dancing in the streets. It was African magic!\nKwame Warrington1\nEvery second Sunday of June in Philadelphia, \"Odunde!\" \"Oh-doon-day!\" rings out: a song of\ncelebration echoing off the walls, echoing through the street, echoing over the throngs of people\ngathered to honor Yoruban orisha Oshun (Oh-shoon) and celebrate African American identity.\nStilt walkers and enormous, colorful umbrellas stand above the crowds, hundreds of bodies move\nto the river to make their offerings and open the festivities, vendors fill the air with the smell of\ncurries, fried fish and funnel cake and tempt the eyes with colorful fabrics and crafts, and the\nmilling crowd grows and grows, filling South Street from 21st Street to the Schuylkill River and\nGray's Ferry Avenue from 23rd Street and Lombard to 24th Street and Christian.\nSome residents of West South Street are taken aback by the crowds: they peer out from behind\ntheir curtained windows at the throng below: Nigerians, African Americans from California,\nAfrican Americans from Washington, DC, African Americans from Baltimore, and most of all,\ntheir own neighbors: African Americans living in and around Philadelphia. Whites, Latinos,\nand Asians dot the crowd, joining in the celebration. The newer residents (those who arrived\npost-1980) complain to reporters about the years without public latrines when their newly\nbleached steps were stained with human waters. Meanwhile, near the festival's southern edge,\nHattie Thelmon serves Southern home cooking under the slogan \"Stomach Joy\" in front of her\n\ndaughter's apartment. As afternoon reaches its height, the crowd swells toward the South Street\nstage to watch the Washington DC Hand Dancers take on Philly in an annual competition that\nhas helped win \"The Bop\" its prestigious title as the Official Dance of Philadelphia, and then\nrelax again when the show starts--drawn in by the dancers' rhythmic movement and casual\nflair. \"Everyone who comes to ODUNDE, participates,\" Oshunbumi Fernandez, the festival's\nExecutive Director tells me. She is in this crowd too, relaxing with friends, keeping watch over\nthe activity, and stopping every now and then to talk to her mother, one Ms. Lois Fernandez, the\nSouth-Philadelphia born activist whose energy and enthusiasm have kept this festival going since\n1975.\nThe Odunde festival, despite its resemblance to and association with other ethnic festivals in\nPhiladelphia is in fact intimately tied to racial politics in the city. The festival connections to\nthe Nigerian Oshun Festival and the Philadelphia Block Party allow it to construct an ethnic\nAfrican American identity. This ethnic identity then becomes a form of racial resistance to\na political structure that has encouraged the replacement of African Americans with upper-\nmiddle class whites. The festival is rooted in the historic struggles of the Philadelphia black\ncommunity. This community has always embraced the goal of gaining equal entry to American\nsociety while maintaining a nationalism and separatism that has allowed it to protest and resist\nconditions that fall short of its goal. This chapter will trace the public presence of the black\ncommunity throughout its history to contextualize the Odunde festival. First it will examine the\nspatial marginalization imposed on that community through the threat of violence and rioting\nduring the eighteenth and nineteenth centuries. In this period, the conflict between separatist/\nnationalist philosophy and the uplift/integrationist philosophy will first emerge. Then the mid-\ntwentieth century will provide the immediate context for the development of Odunde. The black\ncommunity's increasing use of public protest and demonstrations as well as the resurgence of\nAfrocentrism and black nationalism in response to persisting inequalities together paved the\nway for a new celebratory culture that could build political consciousness. Finally, this chapter\n\nwill show how the festival has participated in the racial politics of the city by constructing a new\npublic identity for African Americans.\nAfrican American Settlement and Celebration, 1776-1950\n,\nIn the course of conversation, the Governor spoke of the prejudice against colour\nprevailing here as much stronger than in the slave States. I may add, from my own\nobservation, and much concurrent testimony, that Philadelphia appears to be the\nmetropolis of this odious prejudice, and that there is probably no city in the known\nworld, where dislike, amounting to hatred of the coloured population, prevails\nmore than in the city of brotherly love.\nJoseph Sturge2\nIn the late eighteenth and early nineteenth centuries, the formative years of this nation, free\nblacks struggled to assert their identity as Americans but found their efforts thwarted and\ntheir identity marginalized. Because Philadelphia functioned as the United States' capital until\n1800, the struggle there carried greater significance for blacks and whites everywhere. Chapter\n2 demonstrated how the Democratic Republicans used public ceremony to assert a popular,\ni.e. working-class, political identity that challenged the elite Federalists and excluded blacks\nand women from participation. This section will focus on the spatial practices of African\nAmericans during from that time to the mid-twentieth century to demonstrate how their spatial\nmarginalization is tied to their political marginalization.\nAs free black identity in Philadelphia developed, it struggled with two important dichotomies.\nOn the one hand, a 'double consciousness' developed and demanded that African Americans see\nthemselves at once as American and as Other, with that Otherness implying an inferiority in the\neyes of whites. In the words of W.E.B. DuBois:\nOne ever feels his two-ness,--an American, a Negro; two souls, two thoughts,\ntwo unreconciled strivings; two warring ideals in one dark body, whose dogged\nstrength alone keeps it from being torn asunder... The history of the American\nNegro is the history of this strife,--this longing to attain self-conscious manhood,\nto merge his double self into a better and truer self. In this merging he wishes\nneither of the older selves to be lost. He would not Africanize America, for\n\nAmerica has too much to teach the world and Africa. He would not bleach his\nNegro soul in a flood of white Americanism, for he knows that Negro blood has\na message for the world. He simply wishes to make it possible for a man to be\nboth a Negro and an American, without being cursed and spit upon by his fellows,\nwithout having the doors of Opportunity closed roughly in his face.3\nIn Philadelphia racial politics, as in other areas of the country, this 'double consciousness'\nmanifested itself in two different approaches to achieving equal entry into white society:\na black nationalist and separatist movement (historically based in the lower classes)\nand a moral uplift and integrationist movement based in the middle and upper classes\nof the black community. Because black Philadelphians formed separate churches for\ntheir worship practices in the eighteenth century, their community was also faced with\nthe question of what identity to construct publicly versus privately. While the church\nprovided a space protected from the scrutiny of whites where elements of African identity\ncould be safely preserved, proponents of moral uplift attempted to suppress public\nactivities that resembled slave culture and embodied the racial stereotypes that class was\nbattling. Despite their different tactics, both the black nationalists and the integrationists\nshared the same goal, and this meant that both were committed to participating in\nAmerican national identity and to demanding equality and freedom for all their brethren.\nThese two goals set both groups at odds with the white majority of the city and the recent\nimmigrants who found themselves in direct competition for jobs and status in American\nsociety. The violence directed at African Americans during the nineteenth century further\nmarginalized their public identity and public presence.\nFor most of the eighteenth century African Americans in Philadelphia had almost no\nspace in which to develop a unified identity. The only public space available to the\nblack community in these early years was located at the periphery of the city in what\nis today Washington Square Park. At that time it was a potter's field or \"Strangers'\nBurial Ground,\"4 located at the corner of 6th Street and Walnut Street in the southeastern\n\nFigure 19. 1762 map of Philadelphia showing Washington Square, which served as the African\nAmerican burial ground, on the periphery of the city.\nquadrant of Center City. As the burial ground for blacks in Philadelphia it also served as\ntheir outdoor social center and was later dubbed, \"Congo Square.\" Figure 19 shows the\nsquare in 1762 on the periphery of development in Philadelphia. Slaves and free blacks\ngathered on its grounds to speak their common languages together, dance and sing.5\nCelebrations and dancing in the square often attracted white Philadelphians as well, and\nit was probably the most prominent public expression of identity available to the black\ncommunity for much of its early existence. The importance of the square to free blacks\nis evidenced by the fact that they petitioned in 1782 for permission to fence in the area\ncontaining their burial ground.6 When Richard Allen and Absalom Jones broke from\nthe white Methodist Episcopal congregation and built the first separate black church in\n1794, they gave the black community a place to socialize, worship, dance, celebrate, and\norganize politically away from the scrutiny of white Philadelphia.7\nThe philosophy of racial uplift profoundly affected African American identity in Philadelphia\n\nand its public expression. Absalom Jones, who led the St. Thomas African Episcopal Church,\naffiliated himself closely with this philosophy. The Free African Society he formed with Richard\nAllen when they first broke from the Methodist Episcopal Church embodied this philosophy,\nand when Allen broke off to form a new Methodist Congregation, Jones continued to adhere\nto it. This worked in the interest of his congregation: the black elite who were at that time\ntrying to gain equal entry into white society. These members of the black community distanced\nthemselves from slave culture and celebration to prove themselves worthy Americans in a culture\nthat consistently attempted to justify slavery by racializing and dehumanizing blacks. Free\nblack societies formed, and the black Masons paraded on the streets of Philadelphia for the first\ntime in 1797 and continued to do so through the nineteenth century.8 Even as members of the\nblack elite embraced ideas of racial uplift, they also remained committed to the struggle against\nslavery and commemorating its victories. In 1808, Jones declared January 1st a \"day of publick\nthanksgiving,\" for Congress's abolition of the slave trade. The day also coincided with Haiti's\nIndependence Day, and thus allowed free blacks to celebrate both the abolition of slavery and the\npromise of emancipation.9 These celebrations brought together black Philadelphians from a wide\nrange of cultural and class backgrounds. Many participants were more closely connected to slave\nculture than to the more European culture of public behavior valued and espoused by the black\nleadership.10 In his study of black freedom celebrations, Festivals of Freedom, Mitch Kachun\nnotes that \"Attempts to control public behavior illustrate the intertwining of the cultural and the\npolitical, since blacks' public decorum had a direct bearing on the political goals of abolition and\ncitizenship.\" Blacks who believed in moral uplift saw any public display of disorder, violence\nor immorality as working against the movement to abolish slavery and admit blacks as equal\ncitizens. For this reason, as black leaders sought to nurture an African American political identity,\nsome also fought to marginalize African forms of celebration.\nOne black leader who did not marginalize African forms of celebration was Richard\nAllen. Ordained a Bishop in the 1790s, he believed that Methodism was the sect best\n\nsuited to African American religious practices and was strongly influenced by ideas that\nwould later form the basis of Black Nationalism and Pan-Africanism.11 His Bethel African\nMethodist Episcopal Church encouraged the integration of African forms of worship\nand attracted the poorest members of the black community, many of whom were likely\nrecent migrants from the South. Black nationalist philosophy found its expression in\npublic spaces as well, especially during the era of West Indian slave revolts. The violent\noverthrow of slavery in Haiti became a source of inspiration for blacks and heightened\nwhite insecurities. Public parades that asserted a strong black identity seeking universal\nemancipation threatened the social order of racial hierarchy that European immigrants\nembraced as part of their own assimilation. These parades were further reinforced by\nformal commitment to the cause of abolition. At the first black political convention,\nhosted by Allen and held in 1831, Philadelphia's black community decided to take a firm\nabolitionist stance they never wavered on despite their knowledge that such a stance\nwould put them at a political disadvantage.12 When they lost their right to vote in 1837,\nblack leaders drafted a formal appeal against the decision and directly questioned whether\nit resulted from their firm commitment to abolition.13 This commitment to abolition also\nfound itself expressed in freedom celebrations like a Society Hill gathering of 1842 to\ncommemorate West Indian abolition of slavery. These festivities created a public political\npresence for black communities and attracted not only the elite, but also the under classes\nwhose separation from the realities of slavery may have been tenuous at best.\nAs blacks asserted a public political presence appealing to either uplift or nationalist\nphilosophies, they met with increasingly violent resistance from the city's white communities.\nThat same August 1st, 1842, celebration, which attracted 1000 black Philadelphians to Society\nHill, was assaulted by an Irish mob. Not only were the black participants beaten, but their homes\nwere attacked, and their churches and public institutions burned, leaving behind a sense of\ndisillusionment and hopelessness.14 The riot was but one in a two-decade period characterized\n\nby severe race riots. Any public display of blacks challenging the racial order seems to have\nbeen vulnerable to attack. In Forging Freedom, Gary Nash recounts that \"in 1828, white ruffians\ngathered on South Street outside a dancing assembly hall, where a black subscription ball\nwas being held, and assaulted women as they stepped from coaches, insulting them, tearing\ntheir gowns, and throwing guests into the gutter,\" because they \"resented the status inversion\nsymbolized by the arrival of black couples in coaches with white drivers and footmen.\"15\nPatterns of residential segregation placed the heart of the African American community in\nCenter City (the city of Philadelphia until the 1854 consolidation) immediately adjacent to\nthe European immigrant communities that had settled in South Philadelphia. Black Episcopal\nchurches and their middle-class congregants settled around Washington Square and between\nLombard Street and South Street.16 Figure 20 shows this pattern in 1838. The class distinctions\nbetween Philadelphia's marginalized black community and the immigrant communities of South\nPhiladelphia further fueled the racial tensions of the 1820s and 1830s. The 1838 amendment\nto Pennsylvania's constitution revoking suffrage for free blacks received \"decisive\" support\nacross party lines.17 Not only were they spatially marginalized through violence and residential\nsegregation, but they were politically marginalized as well.\nThe consolidation of Philadelphia County under one municipal government in 1854 greatly\nreduced rioting, and the end of the nineteenth century was marked mostly by subtler forms of\nmarginalization. After the Civil War, inter-racial alliances supporting the cause of abolition\nwere not strong enough to last far beyond the victory of emancipation. White abolitionists were\nnot united behind the cause of racial equality, and as blacks pursued this goal after the war,\nthey could not rely on assistance from their former allies. In fact, African Americans found\nthemselves further marginalized in public culture:\nAs Reconstruction waned and the age of Jim Crow set in, public commemorations\ngenerally became more racially circumscribed events. African Americans were\nincreasingly excluded from national public rituals, and whites withdrew from\nblacks' commemorations of emancipation... After the early 1870s biracial public\ncelebrations took place less frequently; increasingly, black commemorations were\n\nImage removed copyright purposes.\nFigure 20. Distribution of African American population in 1838 by congregation. St. Thomas and African Presbyteri\nan represent the wealthiest African Americans. African Baptist areas represent the middle class of African Americans\nand Bethel African Methodist Episcopal the lowest class.\nattended by more racially uniform crowds in a more racially segregated public\nsphere.18\nIn Philadelphia, schools, public facilities, and street cars were segregated. Even African\nAmerican soldiers returning home were refused admittance to streetcars, and women \"were\nforced to walk miles to visit soldiers in the hospital.\"19 In response, African American public\nculture during this time focused on achieving equal rights. The long association between black\nleaders and the Quakers meant that violence was never advocated and rarely employed by the\nblack community. In 1865, the newly formed Pennsylvania State Equal Rights League enacted a\n\npublic campaign to desegregate streetcars by having black women and clergymen enter streetcars\nto be forcibly removed and black men assemble at stops in order to fill the cars before any whites\ncould enter. That fight, spearheaded in the African American community by the Pennsylvania\nState Equal Rights League, began the process of claiming equal right to the city's public spaces\nand services. In the following years, activists involved in the effort, namely Jonathan C. Gibbs\nand Octavius V. Catto, petitioned the state government to reinstate voting rights for blacks.\n20 Pervasive racism frustrated their efforts, however, and even the Fifteenth Amendment to\nthe national constitution could initially persuade Philadelphia to admit African Americans into\npolitics:\n\"At a time when black Louisianans and Mississippians were electing their fellows\nto statewide offices and even the Senate of the United States, the Afro-American\nresidents of Pennsylvania, far from the action, still had no right to vote at all.\nNeither Catto's eloquence nor the varied activities of the Equal Rights League\ncould mask the fact that the state was one of the last in the North to override its\nown constitution and ratify the Fifteenth Amendment. The first attempt to do so,\nin 1868, was defeated in the House of Representatives by a margin of 68 to 14.\"21\nThe efforts of Philadelphia's black population were far from futile, however. Their increased\npresence in the city's major thoroughfare, Broad Street served as a visual reminder of their\nprogress. When the Fifteenth Amendment was finally ratified in Pennsylvania, the Union League\npresented Catto with a silk banner and led a celebratory procession from their headquarters down\nBroad Street to Horticultural Hall where nationally recognized African Americans Frederick\nDouglass and Robert Purvis spoke along with Catto and various white leaders.22 Catto's death\nwas also commemorated with a Broad Street parade to Mount Lebanon Cemetery that \"included\none infantry brigade, three regiments, eight other military detachments, and 125 carriages.\"23 The\nstreet was \"packed with spectators on both sides,\" with black and white Philadelphians coming\ntogether to pay their respects. 24\nResistance to the efforts of the black community took two forms: violent and non-violent. The\n\npresence of blacks on streetcars often incited a violent reaction from the white passengers,\nand the courts upheld segregation to avoid \"breaches of the peace.\"25 The return of suffrage to\nPhiladelphia's black citizens incited the bloodiest riot in the city's history. Despite the fact that\nthe riot brought the death of Catto, one of the most important leaders of the black community\nat that time, no violence was reciprocated. The black leadership maintained their commitment\nto nonviolence and won the support of many white Philadelphians.26 As violence in the streets\nwaned, and black political participation increased, black Philadelphians still found themselves\nmarginalized spatially. Black organizations, now politically enfranchised, participated in\nmore national parades and events, but always in brought up the rear. The Republican National\nConvention of 1900 exemplifies this treatment:\n\"The affair was a far cry from the last Republican Convention in Philadelphia\nin 1872. The party's colored delegates from the deep South states were asked\ndirectly whether they were in it only for the patronage... Most of them were\ndenied hotel rooms, and many had trouble in public restaurants and were forced\nto board with local families... At the grand parade on June 18, the Citizens'\nRepublican Club marched under its official banner, \"We Believe in Education,\nMorality, and Equality under the Law.\" They were bunched toward the back,\nhowever, with the southerners and other colored organizations from around the\ncountry. The viewers had largely exhausted their applause on the cakewalkers,\nwho led off.\" 27\nThis description highlights important points about the marginalization of blacks in spatial\npolitics. Not only were \"colored organizations\" relegated to the back of the procession, but\nthe delegates were excluded from the city spaces commensurate with their political status. By\ndenying them entry into hotels and restaurants, white Philadelphians demonstrated their lack\nof respect for African American political figures. The description of the slogan banner is also\ntelling: emphasis on education and morality reinforce the emphasis black leadership of the\ntime placed on assimilation. That the club would publicly assert its belief in \"equality under\nthe law\" also suggests its recognition that such had not yet been achieved. Finally, the fact that\nthe crowd had \"exhausted\" its \"applause on the cakewalkers,\" highlights a national cultural\ntension emerging at that time. The minstrel tradition and corresponding influence of southern\n\nblack culture on American popular culture worsened exacerbated existing tensions in the black\ncommunity.\nAs political culture subsided and popular entertainment became a more prominent form of public\nexpression, African Americans found themselves a new entrance into the national identity, but\none that chose their identity for them. Public cultural events allowed struggles over identity to\ncontinue, but masked them in the guise of humor and play. Chapter 3 discussed the role of the\nMummers parade in solidifying a white racial identity for Philadelphia's European immigrants\nby drawing on minstrel traditions. The description of the Republican National Convention of\n1900 highlights the conflict African American leadership faced because of these new forms of\nentertainment. The white public much preferred the image of blacks as clowns and buffoons to\nthe image of African American statesmen and politicians. Here the issue of double-consciousness\nreemerged in the public sphere. Blacks sought both to participate in the new entertainment\nculture, which co-opted the image of African American culture that black leaders had been trying\nto suppress and also to assert a new, politically active, image of equality. Even those blacks who\nbecame famous entertainers during this period found themselves struggling with the desire to\nportray more complex African American identities but unable to find support in doing so.28\nThe first half of the twentieth century marked a decline in Freedom Day celebrations as blacks\nfocused on developing new institutions to combat racism. While American popular culture\ninsisted on displaying a stereotyped African American identity, and Jim-Crow era spatial\nsegregation took hold, African Americans developed their own society separate, but parallel to\nthat of whites. The struggle between Black Nationalism and uplift was now embodied by the\nnational figures of Booker T. Washington, who strongly espoused moral uplift, W.E.B. DuBois,\nwho encouraged and fought for equal rights as well as black self-reliance, and the radical Marcus\nGarvey, who embodied a militant, Pan-Africanist, black nationalist identity. All three men built\nimportant institutions for the black community: theTuskegee Normal and Industrial Institute\n(Washington), the Niagara Movement and the NAACP (DuBois), which fought to establish\n\ncivil rights and legal protections for African Americans, and the Universal Negro Improvement\nAssociation founded by Garvey who is best known for his insistence that \"the black man develop\n'a distinct racial type of civilization on his own and... work out his salvation in his motherland\n[Africa].'\"29 Political participation and agency strengthened through these various organizations,\nand social organizations grew as well.30 African Americans still avoided Market Street altogether,\nand expected the stones and garbage thrown and at their Broad Street parades, but the Elks\ncontinued to successfully host them annually. Their largest event, a 1945 war bond rally, attracted\n200,000 people to Broad Street and featured 65 different lodges as well as 39 bands.31 Together\nwith the black churches, these organizations would eventually develop the leverage to confront\nthe inequality and segregation of American society.\nCivil Rights, Afrocentrism and the Politics of the Street, 1950-1975\ng\n,\n,\nOnce, xiv\nthen there was/ the/ picture of/ the bleak-eyed/ little black/ girl/ waving the/\nAmerican/ flag/ holding it/ gingerly/ with/ the very/ tips/ of her/ fingers.\nAlice Walker32\nThe Odunde festival grew out of the African American political context of the mid-twentieth\ncentury. The period between 1950 and 1975 marked a major shift in African American public\npresence in Philadelphia. The marginalization of black communities through mid-twentieth-\ncentury national housing policies mobilized African Americans' political will against the\ncontinuing inequality they faced. Uplift strategies, and even the efforts of the NAACP, were\nnot moving the black community toward the equality they had been fighting for over so many\nyears, and this period marked a swing toward direct-action strategies and a greater emphasis on\nBlack Nationalism and Afrocentrism. Though African American religious and political leaders\nstill embraced a more conservative path for the black community, radical movements energized\nPhiladelphia's black political presence in the 1960s. The Black Panthers, SNCC, and MOVE\n(a radical, back-to-nature group) all maintained a strong political presence in the city. Civil\nrights activists and Cecil Moore, the dynamic leader of Philadelphia's NAACP chapter held\n\ndemonstrations throughout the 1960s as well as the conventions, despite animosity from the\ncity's Police Commissioner, Frank Rizzo. By the early 1970s, however, national and local events\nconspired to transform African American public identity from explicitly political to more cultural\nforms.\nOdunde's growth in the 1970s was a response to patterns of spatial marginalization through\nresidential segregation and Jim Crow policies that reached their apogee during the 1950s. The\nPhiladelphia black community's spatial segregation allowed it to develop a vibrant, thriving\ncommunity but also left it vulnerable to mid-century planning policies geared toward attracting\nwhites back to the city. Cheap, subsidized mortgages made suburban living possible for the white\nworking class residents, while red-lining caused massive disinvestment in city neighborhoods,\nespecially those with African American residents. During the 1950s, South Philadelphia resident\nFalaka Fattah recalls, \"When people came up, when they migrated into Philadelphia, the\nsaying was, 'Walk South Street and find a friend.' Find somebody from home, a homeboy, and\ninevitably you would. You would connect up with somebody from home, whether that home was\nGeorgia or North Carolina or Virginia.\"33\nThe city's 1947 plan to develop the South Street-Bainbridge corridor into a highway caused\nmassive disinvestment in the area throughout the 1950s. By the time local community groups\ncame together in the 1960s to successfully oppose the highway construction, the disinvestment\nhad left the corridor vulnerable to gentrification. The community-based counter-proposal\napproved by the city effectively took \"the fate of South Street west of Broad... out of the hands\nof the neighborhood people and small family-business owners\" and put it into the hands of\n\"a new group of people: developers, speculators, the ever-expanding Graduate Hospital, and\nindividual property-owners--largely newcomers, white, and gentry.\"34 Philadelphia's plan to\nattract the middle class whites who had abandoned the city for the suburbs removed African\nAmericans from their historic home-ground on the outskirts of Center City around Society Hill\n\nand South Street and pushed them further into the margins. The decision to locate Odunde at\nthe western edge of South Street became a statement for the black community that \"we shall not\nbe moved.\"35 In the thirty years since its founding, west South Street has seemed to resist some\ngentrification pressures. Compared with the eastern edge, which started from the same position\nof disinvestment in the 1950s and is now the heart of a wealthy, white residential area, the census\nblock groups at its western edge have successfully maintained a degree of residential diversity.\nOdunde grew out of the African American political agenda of the mid-twentieth century, which\nembraced Afrocentrism and demanded equality in all facets of society. One of the major political\naccomplishments for African Americans during this period was the reclaiming of public space\nand public identity. Arthur C. Willis notes in his history of Philadelphia that \"By the time the\n1950s arrived, blacks in the city had struggled and opened up public places in Philadelphia. The\nlocal branch of the NAACP had led the fight to open the movie houses, restaurants, skating rinks,\nand other public places to all on a non-segregated basis.\"36 The major battles of the 1950s and\n1960s were the struggles to desegregate swimming pools in the city, to integrate Girard College,\nand to remove blackface from the Mummers parade.37 All three of these were struggles over\naccess to space and expressions of public identity and used (or threatened to use) spatial as well\nas strictly political strategies to succeed.38 During this time African Americans created a much\nmore complex public identity for themselves than they had ever previously enjoyed.\nThe Afrocentrism that had been present in Philadelphia's black community since the country's\nfounding strengthened in the 1960s, and this too influenced the Odunde festival. The national\npolitical climate of the 1960s, however, popularized Afrocentric cultural expression and\nunited--on a national level--highly disparate black communities. Willis notes that \"it was not\nlong before the movement for freedom had created a revolutionary lifestyle to go along with\nthe new mood and new thinking... The term, 'soul,' was put to use to define the new concept of\nblackness... Blacks discovered a new racial identity: 'Black was truly beautiful.' A catharsis of\n\nthe spirit of black folk was taking place.\"39 As this new way of thinking permeated Philadelphia,\none of the first to embrace it was South Philadelphia resident, activist and Odunde founder Lois\nFernandez.40\nUnderstanding the ways that Afrocentrism influenced Fernandez and the Odunde festival requires\nan understanding of the term itself. In his book Afrotopia, Wilson Jeremiah Moses defines\nAfrocentrism as \"the belief that the African ancestry of black peoples, regardless of where they\nlive, is an inescapable element of their various identities--imposed both from within and from\nwithout their own communities.\"41 He is as interested in acknowledging the development of\nAfrocentric ideas in popular culture as in examining when and through whom those ideas rose to\nliterary prominence. So while he notes that \"'Afrocentrism' was not invented until the 1960s,\"\nhe expounds that \"the idea of discussing African American culture as a survival of African\nculture was well established in sociological and anthropological literature before the Second\nWorld War. The idea that African Americans were essentially African, and that the solutions to\ntheir problems must be discovered within a Pan-African context is nothing new.\"42\nMoses also demonstrates that contemporary figures in African American studies are connected\nto Afrocentric traditions of thought developed in the 1930s by Melville Herskovits. \"Sterling\nStuckey, like Henry Louis Gates, represents a continuation of the Herskovits tradition in\nAfrocentric studies... Both view African American culture as an African culture, which came\ninto being as a process of fusing numerous African cultures during the slavery period.\"43 Lois\nFernandez's father transferred a tradition of Afrocentrism to his daughter. Although Moses is\ncritical of many of Garvey's Egyptocentric and at times Imperialist positions, he notes that \"his\ncultural program was simply a repetition of ideas that African American populations had featured\nsince the early nineteenth century.\"\nIn her efforts to bring a Yoruban festival to the streets of Philadelphia as a means of educating\n\nAfrican Americans on African cultural traditions (and thus construct a culturally African\nidentity), Lois Fernandez allies herself more closely with an anthropological Afrocentrism rooted\nin the work of scholars like August Meier, Roger Abrahams, Sterling Stuckey, and Robert Farris\nThompson.44 In his book, Flash of the Spirit, Thompson traces the influence of Yoruban orishas\non the religions of surrounding African communities and on Caribbean vodun beliefs, which\ncombine African spiritual practices with European Catholicism.45 In their book Osun Across the\nWaters, Joseph M. Murphy and Mei-Mei Sanford take this a step further and trace the influence\nof the orisha Osun (also spelled Oxun, Oshun, and Ochun) in the African Diaspora. They write\nthat \"with the catastrophic mass enslavement of Yoruba men and women in the late eighteenth\nand early nineteenth centuries, Osun traditions were carried across the Atlantic and redeveloped\nin Cuba and Brazil. Under conditions of enslavement and marginalization, Osun traditions\nbecame a key feature of African American strategies of adaptation and resistance to European\nvalues and spirituality.\"46 They theorize that the influx in Caribbean immigration to the United\nStates has resulted in an increased popularization of Oshun and her associated Yoruban religious\npractices47, an idea that is supported by Odunde's growing popularity, attracting worshippers and\nnon-worshippers alike. Though its core is a religious ceremony, its appeal is in its promotion of\na secular, African ethnicity. In fact, its religious component attracts worshippers from Caribbean\nand Latin American backgrounds who might more readily associate with a Hispanic than an\nAfrican American identity. 48\nAs the 1960s reached their close and social upheaval tore through the nation's major cities,\nPhiladelphia's African American population gradually transformed their public presence from\npolitically militant to culturally determined. Police Commissioner Rizzo ruled the city streets\nwith a \"roving army of policemen\" and buses that could transport 150 officers at a time to any\npoint in the city.49 Even after the assassination of Martin Luther King, Jr. in 1968, Philadelphia's\nblack community remained quiet as they watched their sister city, Camden, NJ, burning on the\nother side of the Delaware river. The city's African American citizens were familiar with Rizzo's\n\nbrutal response to their peaceful demonstrations and did not provoke him further with violence of\ntheir own. Instead, they began to adopt new, cultural strategies to achieve their goal of equality.\nConstructing a Contemporary African American Identity in Philadelphia, 1975-2004\ng\np\ny\ny\np\n,\n[Odunde] helps our sense of identity, not just as black people, but as African\nAmericans. Let's face it, there is no country called black.\nGwen Winfrey50\nRizzo's rise to mayor in the early 1970s coincided with a shift from highly charged political\ndemonstrations to cultural expressions of African American identity. The Philadelphia Odunde\nfestival asserted an African American identity that emphasized the African as much as the\nAmerican and took a stand against the spatial marginalization of blacks in Philadelphia. By\ncalling itself \"Odunde,\" a New Year celebration, the festival set itself in direct opposition to\nthe Mummers Parade and its connection to white political structures in the city. As Odunde has\ngrown over almost thirty years, it has become a symbol of strength and identity for the African\nAmerican community as well as venue for national and international political mobilization. By\nuniting a Yoruba religious procession with the form of a Philadelphia block party that brings\ntogether vendors from throughout the African Diaspora, the Odunde festival has helped to create\na vibrant ethnic American identity for Philadelphia's black community. This identity is all the\nmore powerful because it transcends boundaries of class, religion, and even neighborhood for\none day a year.\nThe Odunde festival is an explicit attempt to use ethnicity to build political consciousness and\nan image of Blackness for South Street. Like the Mummers Parade, however, it emphasizes that\nit is open to all Philadelphians, and anyone who wishes to participate in the festival is welcomed\nto do so. Its founder, Lois Fernandez, is an African American activist and social worker from\nSouth Philadelphia whose parents connected her both to Afrocentric cultural traditions (her\nBahamian born father was a follower of Marcus Garvey) and Philadelphia political traditions\n\n(her mother was active in city politics). 51 She founded the festival in 1975 with the intention of\nhelping African Americans connect with their ethnic African heritage while acknowledging their\nracialized American heritage. The festival is derived from the Oshun festival in Osogbo, Nigeria.\nThere the festival performs a kingship ritual that reaffirms the city's foundation. During the\ncelebration, a processional makes offerings to the orisha (a Yoruban spirit) Oshun by throwing\ngifts, fruit, and flowers into the Oshun River. Odunde's version brings gifts of to the Schuylkill\nRiver in a procession led by Yoruba priests and priestesses. That procession kicks off eight hours\nof a large-scale block party replete with live music and dance performances (Figure 21). The\nimage of Afrocentric identity is further accentuated by the fact that many participants come in\ntraditional African dress (Figure 22), a practice actively encouraged by festival organizers. Food\nvendors from many African countries as well as the Caribbean, South America and different\nregions of the United States also build an image of African-American identity for festival-goers.\nVendors selling a variety of crafts and specialty items add political as well as cultural meaning\nto the event. Newspaper articles during the 1980s and early 1990s mention the availability of\nMalcolm X t-shirts and products encouraging the end of South African apartheid.52\nBy locating itself in the contested territory of west South Street, Odunde provided a highly\nvisible forum for the adjacent African American community to fight gentrification and further\nmarginalization. It also embraced marginality by rejecting the formal, more centralized\nImage removed for copyright purposes.\nImage removed for copyright purposes.\nFigure 21. Drummers are some of the most impor-\nFigure 22. Lois Fernandez in African dress exempli\ntant performers at the festival. This bata battery led\nfies the spirit of the festival.\nthe 1992 procession to the river.\n\ncelebratory spaces in the city, but this point will be discussed in greater detail in Chapter 5.\nBy 1975, the year that the first ODUNDE festival was held, the gentrification of South Street\neast of Broad was well underway. An article in a Progressive Architecture Journal published\nin 1976 notes that \"Today, a part of South Street is going through the self-revitalization of\nits New York counterpart, Soho, survivor of a similar battle.\"53 During the 1970s and early\n1980s, while the festival was still relatively small--a few thousand at most--it slid beneath\nthe radar of the city and maintained a persistent but quiet African American identity along the\nborder between white, gentrifying Center City and black, gentrifying South Philadelphia. The\nfestival's procession actually enters territory that had historically been off-limits to blacks: 26th\nand South is still known as \"the Pocket\" a white community settled in the corner of a black\nneighborhood.54 Initially, Fernandez's neighbors were wary of using the South Street bridge as\nwell: they told her, \"They ain't doing to let you go across. No black folks go across no South\nStreet bridge.\"55 As the festival grew, tensions increased between the historical importance of\nSouth Street to Philadelphia's black community and the desire of its new (wealthy, European-\nAmerican) residents to claim (and control) it as their territory. These tensions became visible in\nthe political confrontations recorded in the major city papers between the ODUNDE festival and\nsome community residents in the late 1980s and early 1990s. Fernandez used the opportunity\nto publicly decry city policies that encouraged gentrification and the marginalization of black\nresidents. The conflict built through the 1980s and came to a head in 1994, when the city\nattempted to move the parade south to Washington Avenue after a shooting incident near 24th and\nBainbridge, at the 1993 festival's periphery.56\nThe city's effort to move the parade and Odunde's insistence on staying on South Street highlight\nthe festival's connection to Philadelphia's racial politics. In response to the assertion that it\nshould be moved to Penn's Landing or the Benjamin Franklin Parkway where other ethnic\nfestivals are held, Fernandez would say: \"Have the Mummers left Broad Street? We're staying.\"57\nThis invocation, repeated in the press, implies that certain (white) groups in the city are given\n\npreferential treatment while likening Odunde to Philadelphia's most prominent celebration.\nAfter the shooting incident, Fernandez immediately responded to newspapers associating the\nshooting with the festival by stating that \"we lived in violent time and we could no longer stop\nthat incident no more so than they stopped the most guarded, the most important man in this\nworld, the President.\"58 Despite her stance that it was not Odunde's incident, the city seriously\nconsidered the possibility of moving the festival further south to Broad and Washington, and in\n1994 Fernandez found herself meeting with \"the mayor [Ed Rendell], his chief of staff, the head\nof city council, police commissioner, the fire commissioner, managing director, everyone was\nthere.\"59 She brought her own entourage to the meeting, and they refused to discuss moving the\nfestival. In that meeting, John F. Street, then City Council President and a major figure in the\nblack community, supported Odunde's decision to stay on South Street, and with his backing, the\nfestival held its ground and even expanded.60\nBy allying itself with the city's African American leadership and setting itself in opposition\nto the Mummers parade, Odunde actively participates in the racial politics of the city. It is a\nforum for African American political mobilization. In 1991, a Philadelphia Inquirer reporter\nnoted that \"State Rep. David P. Richardson Jr. (D., Phila) peppered his presentation of a state\nproclamation commending Odunde--for a festival 'marked by joy and hope,'--with remarks\nabout local politics and a movement by some black leaders to back former Mayor Frank Rizzo\nin this year's mayoral election... 'We cannot go back to Frank Rizzo, and anybody that tells you\nthat is sick and crazy and out of their minds.'\"61 Its alliance with mayor Street further politicizes\nits identity, especially because no such alliance was formed with former mayor cum governor,\nEd Rendell. Street, Philadelphia's second African American mayor, won the favor of Odunde\nwhen he helped them win their right to stay on South Street in 1994. 62 He also honored Lois\nFernandez for her work with Odunde as a \"Drum Major for Community Empowerment\" at\na 2004 Press Conference honoring the life and work of Dr. Martin Luther King, Jr.63 He has\nattended the festival himself and has even spoken words of encouragement: \"We have had a\n\nwonderful festival in this city for 26 years,\" he told festival-goers in 2001, \"We have a wonderful\nheritage... This is a national, international event. People come from all over the world to join in\nthis celebration with us.\"64 The only other mayor quoted from any festival year was the city's first\nAfrican American mayor, W. Wilson Goode.65\nConclusion\nThe Philadelphia Odunde festival is a spatial manifestation of identity politics. It constructs\nan African ethnic identity that unifies the black community in Philadelphia across class and\nterritory, and it builds political consciousness about the racial inequalities of gentrification,\nhighlighting the spatial marginalization of African Americans. Because its route lies at the border\nbetween white Center City and black South Philadelphia, it is visible to both communities and\nimplicates both in its politics. The Yoruban identity that it enacts directly challenges the upper-\nmiddle class European heritage that characterizes South Street's newest population. Its highly\nvisible conflict with that population gave the African American community a voice to oppose city\npolicies that encourage gentrification. In this way, Odunde has been a response to the dynamics\nof race and class shaping Philadelphia to the disadvantage of its poorer and darker residents. As\nthe city's largest and now oldest continuous African American celebration, it has also become a\nvehicle that unites a diverse and diffuse African American population, creating opportunities for\ndirect political mobilization and outreach.\nBy connecting to Philadelphia's black leadership, promoting an ethnic American identity, and\nrejecting the city's central spaces, Odunde strengthens African American racial-political identity\nand embodies its marginalization. While Odunde is used as a benchmark for measuring the\nsuccess of other large-scale African American events in Philadelphia, it is only a benchmark\nfor African American events. It symbolizes an African American identity that is not only\nseparate and distinct from a mainstream Philadelphian identity but also located at the margins of\nPhiladelphia. Even news articles on events as highly politicized as the Million Woman March\n\nmake sure to mention whether the event is supported by Lois Fernandez, who is known as an\nimportant figure in the African American community. These references are only made in relation\nto African American events in the city. Despite attracting crowds up to 400,000 people, at least\n4 times the size of current Mummers spectatorship, Odunde remains virtually unknown to white\nsuburbanites and ignored by white Philadelphians, and thus continues the historic pattern of\nmarginalization that African Americans face.\n(Endnotes)\n1 Warrington, Kwame. \"Odunde: It's in the blood.\" The Philadelphia Tribune. June 11, 1993. p. 1B\n2 From A Visit to the United States in 1841; quoted in Stevick, Philip. Imagining Philadelphia: Travelers' Views of\nthe City from 1800 to the Present.(Philadelphia: University of Pennsylvania Press, 1996).\n3 DuBois, W.E.B. The Souls of Black Folk. (Chicago: A.C. McClurg, 1931).\n4 Nash, Gary B. Forging Freedom: The Formation of Philadelphia's Free Black Community, 1720-1840.\n(Cambridge, MA: Harvard University Press, 1988). p. 94\n5 Dubin, Murray. \"Local African Americans left two centuries of landmarks.\" The Philadelphia Inquirer. Wednesday,\nMarch 17th, 2004. Also, Nash, Gary B. Forging Freedom: The Formation of Philadelphia's Free Black Community,\n1720-1840. (Cambridge, MA: Harvard University Press, 1988). p. 13.\n6 Nash, p. 94.\n7 Willis.\n8 White, Shane. \"It Was a Proud Day.\" The Journal of American History. (Bloomington: June 1994). Vol. 81, Issue 1,\np. 13.\n9 Kachun, Mtch Festivals of Freedom: Memory and Meaning in African American Emancipation Celebrations,\n1808-1915. (Amherst, MA: University of Massachusetts Press, 2003). p. 16.\n10 Ibid, p. 35-37.\n11 http://www.africana.com/research/encarta/tt_643.asp\n12 Willis, p. 24.\n13 Willis, p. 30.\n14 Dubin, \"Local African Americans left two centuries of landmarks.\"\n15 Nash, p. 254.\n16 Nash, p. 267-269.\n17 Brown, Ira V. \"Pennsylvania and the Rights of the Negro, 1865-1887.\" Pennsylvania History. (University Park,\nPA: Pennsylvania Historical Association). January 1961. Vol. XXVIII, No. 1.\n18 Kachun, p. 7.\n19 Lane, Roger. Roots of Violence in Black Philadelphia, 1860-1900. (Cambridge, MA: Harvard University Press,\n1986). p. 48.\n20 Brown. pp. 47-53.\n21 Lane, p. 53\n22 Ibid.\n23 Ibid, p. 46.\n24 Ibid.\n25 Willis, p. 38.\n26 Ibid. p. 40.\n27 Lane. p. 76.\n28 Lorini, Alessandra. Rituals of Racce: American Public Culture and the Search for Racial Democracy.\n(Charlottesville, VA: University Press of Virginia, 1999). Chapter 5, \"From Stage to Street: Rituals of Color\nConsciousness\" provides a good overview of this conflict.\n\n29 Ibid. p. 36.\n30 Kachun, p. 258.\n31 Buchholz, Karen. \" 'The right to assemble:' African American uses of public space.\" Works in Progress.\n(Philadelphia: Philadelphia Folklore Project). Vol. 6, No. 2. Spring 1993.\n32 Alice Walker. Once: poems. (London: Women's Press, 1986, c. 1968).\n33 Excerpted from Murray Dubin's South Philadelpha: Mummers, Memories, and the Melrose Diner. p. 77.\n34 Fernandez, Lois. \"Origins: why we shall not be moved.\" Works in Progress. (Philadelphia: The Philadelphia\nFolklore Society). Volume 6. Number 2. Spring 1993. pp. 2-3.\n35 Ibid.\n36 Willis, p. 65.\n37 Ibid. p. 67-76.\n38 Cecil Moore actively promoted public expressions of political will, regularly staging rallies and demonstrations\nthat grew rowdy and (especially if police were involved violent). His strategies, while in many ways effective, won\nhim the enmity not only of city whites, but also of other leaders of the black community.\n39 Ibid. p. 130.\n40 Oral History, p. 156-158.\n41 Ibid. p. 6.\n42 Ibid. p. 12-13.\n43 Ibid.\n44 Ibid. p. 11-12.\n45 Thompson, Robert Farris. Flash of the Spirit. (New York: Vintage Books, 1983). p. 163.\n46 Murphy, Joseph M. and Mei-Mei Sanford. Osun Across the Waters: A Yoruba Goddess in Africa and the Americas.\n(Bloomington, IN: Indiana University Press, 2001). p. 4-5.\n47 Ibid. p. 5.\n48 Lucas, Renee V. \"ODUNDE - 'Happy New Year' fest is also a reunion.\" The Philadelphia Daily News. June\n8, 1984. Features, p. 51. \"Of course everybody is welcome, as with any ethnic festival. You'll see European-\nAmericans, and many Hispanics... The religious aspect of the festival unites us.\" Lois Fernandez.\n49 Daughen and Binzen. p. 140.\n50 West Philadelphia resident quoted in Leigh Jackson, \"African Fest on South Street Odunde has Roots in Nigerian\nRite.\" The Philadelphia Daily News. June 10, 1991. Local, p. 3.\n51 Macklin, William R. \"ODUNDE Festival: A vision realized/the joy of Africa's Yoruba Culture has been the\npassion of Lois Fernandez for two decades. And today, she'll celebrate again.\" Philadelphia Inquirer. June 11, 1995.\nFeatures, Style. p. M01. Also, Oral History.\n52 For example: Odom, Maida. \"The Spirited Offerings of Odunde.\" The Philadelphia Inquirer. June 10, 1991. p.\nB01.\n53 Ibid.\n54 Buchholz, p. 8.\n55 Oral History, Temple Urban Archives. P. 161.\n56 Oral History, p. 166.\n57 Dribben, Melissa. \"Odunde Fete Enlivens South Street.\" The Philadelphia Inquirer. June 12, 1989. Local, p. B01.\n58 Be Prepared: Oral History Interview with Lois Fernandez. Prepared by Margaret Jerrido. Urban Archives, Paley\nLibrary, Temple University, Philadelphia. 1999.\n59 Ibid. p. 167\n60 Ibid.\n61 Odom, Maida. \"The Spirited Offerings of Odunde,\" The Philadelphia Inquirer. June 10, 1991. Local, p. B02.\n62 Oral History. p. 167.\n63 http://www.philamlk.org/MLK_2004_Luncheon_PR.pdf\n64 Meltzer, Mark. \"Annual Odunde festival draws thousands.\" Philadelphia Daily News. June 11, 2001. Local. p. 09.\n65 Gillin, Beth. \"The Sun Shines on Tribute to African River Goddess.\" Philadelphia Inquirer. June 11, 1984. Local,\np. B03.\n\nChapter 5: Comparative Spatial Practice in Racial Identity Construction\np\np\np\ny\nWhile Chapters 3 and 4 contextualized the meanings of the Mummers Parade and Odunde\nfestival in terms of Philadelphia's history, this chapter will seek to contextualize their current\nmeaning through a comparison of their salient features. First, a comparison of their parade routes\nand festival spaces will be analyzed in terms of the city's civic structure to understand the spatial\nmeanings each seeks to convey. This route analysis will be supplemented by a demographic\ncomparison that examines the racial makeup of neighborhoods bordering each parade route.\nThis comparison will then examine participant demographics for each festival. Finally this\nsection will look at demographics of gentrification, comparing east and west South Street in their\nability to withstand development pressure. The final two sections will compare the festivals'\nconnections to city politics and racial politics by examining their organizational structures and\nlastly their funding and sponsorship.\nRoute\nThe Mummers Parade traverses a route through the city that uses spatial symbolism to signify\nthe racial assimilation of white ethnic groups into a white Philadelphian identity. Its official and\nunofficial paths now route the parade through two prominent civic corridors: Broad Street and\nArch Street. The Broad Street corridor is most significant because it is the official route and\nbecause it connects the Mummers' neighborhoods to City Hall. The Odunde festival, on the\nother hand, stakes a claim on marginal territory in the southwest corner of Center City. No major\ncity institutions serve as a focal point for the festival, though the Center City skyline (including\nthe top of City Hall) is visible from the starting point of the procession (Figure 23) and from\nthe bridge on the return (Figure 24). By establishing a neighborhood presence and rejecting the\ncity's ceremonial spaces, Odunde rejects assimilation into a white Philadelphian identity and\ninstead asserts an ethnic African American identity. Simultaneously, it supports a historic pattern\nwhereby African American culture is visible only on the city's periphery.\n\nFigure 23. Starting point of procession. Odunde ban\nners hang from light posts and Center City Philadel\nphia is visible in the background.\nFigure 24. Returning from the River, participants are\nreminded of Center City's close proximity with its\nwealth and disproportionately white population.\nAlthough Broad Street was Philadelphia's first major ceremonial boulevard, it has become a\nminor ceremonial pathway in the city. Its width accommodates two lanes of traffic in either\ndirection and three lanes of parking (one on each side and one in the middle). It ties the city's\nnorthern and southern boundaries together in a straight line through City Hall, which is visible\nalong much of its route. Until the Benjamin Franklin Boulevard was completed in 1918, Broad\nStreet was the only logical choice for major civic processions in the city, and--as discussed in\nprevious chapters--was racially defined \"white\" territory. Today the official City Parade Route\nbegins at Logan Circle, runs down the Parkway to 16th and Market Street, then turns around\nand comes back up the Parkway to reviewing stands on the western side of Logan Circle before\ndispersing between 20th and 22nd Streets and the Parkway (Figure 25). This route is used for\nmost of the city's ethnic parades including the St. Patrick's Day Parade, the Pulaski Day Parade\n(Polish), the Puerto Rican Festival Parade, the General Von Steuben Parade (German). The\nColumbus Day Parade, which had been using the City Parade Route, recently switched to a\nSouth Broad Street route. These ethnic festivals are distinct from Odunde in that they do not use\nthe parade to make a strong political statement. Other major events on the Parkway are Unity\nDay, the Boscov's Thanksgiving Day Parade and the Philadelphia College Festival.\n\nDespite the fact that Broad Street\nis no longer the main ceremonial\nboulevard for the city, it still\nprovides a spatially symbolic\nImage removed for copyright purposes.\nbackdrop for the Mummers\nparade. City Hall is visible from\nits starting point, over 2 miles\nsouth at Oregon Street, and\nFigure 25. The official Philadelphia City Parade Route.\nafter the official route leads the\nMummers past many of the city's\ncenters of society and culture--including the University of the Arts, the Kimmel Performing\nArts Center, the Academy of Music, the Merriam Theater, the Park Hyatt at the Bellevue, and\nthe Ritz Carlton Hotel--the unofficial parade along Arch Street is lined with major civic and\nhistorical buildings: the Convention Center, the Federal Reserve Bank and United States Federal\nBuilding, Independence Mall and the new National Constitution Center, the United States Mint,\nBenjamin Franklin's Grave, and the Betsy Ross House. The fact that the Philly Phlash Visitor\nBus traces this same path suggests that it is also a significant tourist destination. The final\nunofficial stretch down Two Street (Second Street) is only interesting in the fact that I.M. Pei's\nSociety Hill Towers interrupt the Mummers pathway, diverting them along Dock Street from\nWalnut Street to Spruce. The effect of the entire movement is that white South Philadelphia\nrenews its connection to Center City in a New Year's ritual that weaves itself through and into\nCenter City's most significant civic spaces.\nOdunde's location on South Street places it at one of the most contested boundaries in\nPhiladelphia. Its early significance as the southern boundary of the city is evident by the fact\nthat its original name \"Cedar Street\" was accompanied by the moniker \"South Street\" on\nmaps published as early as 1762. As mentioned earlier, it became the site of a major struggle\n\nbetween neighborhood residents and city planners in the 1960s because it was the site of a\nproposed highway. The gentrification pressures that resulted from the community's successful\nopposition to the highway illuminate the tensions between Center City and South Philadelphia,\nboth of which lay claim to the street. Unlike Broad Street, South is not particularly wide. Traffic\nflows one-way: from west to east in two lanes running between curbside parking. It is home to\nthe Graduate Hospital, the Waters Memorial A.M.E. Church, and two theaters, but is mostly\nknown for its eclectic mix of shops and restaurants running from 6th Street to Front (this strip is\nmentioned in Insight Map Philadelphia's top ten \"Sights You Shouldn't Miss\"1). The western\nedge of South Street is virtually invisible to the average tourist, unless that person was coming\ninto the city from University of Pennsylvania on the other side of the South Street Bridge.\nOtherwise, traffic patterns in the area do not bring heavy traffic to the festival's location, which\nis 11 blocks from the nearest subway station. Center City, on the other hand, still asserts a visual\npresence over the site from a number of vantage points.\nBecause this choice of location was deliberate, it does not represent a willful exclusion of\nthe festival on the part of the city. Rather, by choosing this location, the festival asserts its\ncommitment to a specific population and its belief that this population is not represented by\nthe city's primary ceremonial spaces. Karen Buchholz frames this assertion in economic terms:\n\"Community-rooted festivals bring people and their dollars to neighborhoods. In contrast,\nparades that march down the central spaces of the city--the Parkway, Broad Street, Chestnut\nStreet--draw crowds, media attention, and dollars to the city's political, bureaucratic, and\nfinancial centers of power. While it may be easier for the city to serve and manage such\nevents, and to promote them to tourists, this represents yet another strategy of disinvestment in\nneighborhoods.\"2 Presumably, generating dollars for the city's \"centers of power\" would not\nbe in conflict with bringing money into neighborhoods if those centers of power adequately\nrepresented and attended to those neighborhoods. The Mummers' objections to the Market Street\nmove followed similar lines and demonstrated that the city's white ethnic populations in South\n\nPhiladelphia also do not feel fully represented by the Center City power structure.\nTourist maps of Philadelphia illustrate the strength of this divide. The area of South Street\noccupied by Odunde is virtually invisible to Philadelphia's average tourist. Many tourist\nmaps end abruptly just below South Street, and those that do not highlight only the location\nof the Old Navy Home and the Graduate Hospital as potential sites of interest. The maps in\nPhiladelphia PATCO Speedline (the train to South Jersey suburbs) Stations cover the area with\na list of \"Information Numbers,\" (Figure 26) and Streetwise Philadelphia locates its scale just\nbelow Odunde's unmarked headquarters (Figure 27). The Mummers' route is somewhat better\nrepresented because it traverses Center\nCity's southern boundary, but at least half\nits route is usually cut off. Even the ADC\nThe Map People map of Philadelphia,\nImage removed for copyright purposes.\nwhich depicts the Odunde festival's\nlocation in its entirety, stops short of\nOregon Avenue in South Philadelphia,\nthe starting point of the Mummers' String\nFigure 26. Map in PATCO stations. The key in the lower\nBands (the Comic and Fancy Club starting\nleft corner covers the site of Odunde.\npoints, which are not so far south, are\nvisible however).\nDemographics\ng p\nImage removed for copyright purposes.\nAside from the formal symbolism of the\nroute selection, both the Mummers Parade\nroute and the Odunde's processional route\noccupy racial boundaries with symbolic\nFigure 27. Streetwise Philadelphia map. The map's scale lies\non the site of Odunde.\nstatements of racial identity. Odunde's\n\nInquir\nroute patrols the border of an African American neighborhood at the edge of Center City (Figure\n28). It has a double purpose: to provide a route to the Schuylkill River from South Philadelphia\nand to remind the city that South Street is a historically African American community that\nremains vibrant and alive. The Mummers parade The Mummers' Broad Street route also traces\nFigure 28. The solid red line indicates the procession route and the dotted line indicates the extent of the\nfestivities. Its location on a boundary zone is critical to its political meaning.\nthe boundary between east South Philadelphia, which is predominantly white and west South\nPhiladelphia, which is predominantly black (Figure 29). In response to complaints about the\n2004 Mummers parade from African American city residents, Inquirer columnist Stu Bykofsky\nnoted: \"You make it sound like South Philly is as white as Glasgow, Scotland. There are huge\nnumbers of blacks living west of Broad, don't you know that? It's a pity more black people\ndon't come out to watch it, but that may be because they share your distorted view of the\n\nparade [i.e. that it is racist].\" 3 By tracing this boundary, today's Mummers present themselves\nas accessible to different racial groups; however, this assertion denies the history of exclusion\nthat accompanied the parade's development. After establishing itself as a white celebration and\nclaiming Broad Street as white territory over three-quarters of a century, it cannot reasonably\nexpect a sudden reversal.\nFigure 29. The solid red line indicates the official parade route (2004) and the dotted line indicates the unof\nficial route. The pronounced difference between racial demographics east and west of South Broad Street\nis clearly evident. Because the black and white populations are approzimately equal across the city, they\nexhbit almost exactly oppostie patterns (i.e. block groups that are 0-20% black will be 80-100% white.\nAs a parade that was brought to its Broad Street route by the city government, the Mummers\nparade represented the assimilation of European immigrants into Philadelphia's older Anglo\npopulace. For at least 60 years, it also asserted that these European, \"white\" populations\n\ncould dominate the street. Black residents who came to Broad Street to watch the parade\nwere harassed and provoked,4 and today a noticeable majority of the parade's spectators are\nstill white, especially in Center City. Blacks and women were explicitly excluded from the\nparade for many years, and though neither is any longer, the resultant disconnection from\nthe city's black community remains un-bridged and unresolved. In a period when the city's\npopulation is almost evenly split between white and black residents (46% white and 44% black\nin 2000) the overwhelming presence of white spectators at a parade whose main participants\nare predominantly white, the Mummers, \"a Philadelphia institution\"5 continues to present an\nincredibly distorted picture of who Philadelphia is and what it means to be Philadelphian.\nOdunde's rejection of the option of moving--even to the city's Parkway route or Penn's\nLanding--is further illuminated by a demographic analysis of those spaces. The City Parade\nRoute follows an even more racially specific pattern (Figure 30). No census block group\nbordering that route is less than 60% white and some lie in the range of 80 - 100% white. The\narea around Penn's Landing from Market Street all the way down to South Street is no more than\n20% African American and ranging between 80 and 100% white. A proposal to move the festival\ndown to Washington Street would have put it in an area surrounded by block groups comprised\n80 - 100% by African Americans. While that move would not have alienated the city's black\ncommunity, it would have greatly reduced the festival's visibility and defeated its battle against\ngentrification. Given the intention of the Odunde Festival, it is unsurprising that it would reject\nsuch racially undifferentiated ceremonial spaces.\nPreliminary demographic analysis suggests that while west South Street certainly faces\ngentrification pressures, it has seen significantly less drastic changes than east South Street. In\nthe neighborhood lying west of Broad Street and just to the south of South Street, the white\npopulation increased by about 11% between 1990 and 2000 while the African American\npopulation fell by about 7%. During the period between 1996 and 2000 for this same\n\nFigure 30. Philadelphia's official parade route along the Benjamin Franklin Parkway is only adjacent to\nblock groups that are no more than 40% African American.\nneighborhood, the average residential sale price increased by approximately 58% -- the largest\nincrease for any neighborhood in Southwest Philadelphia.6 The neighborhood remains almost\n70% African American (at least this was its makeup in 2000), but clearly it is facing pressures\nof gentrification and population change. The neighborhoods east of Broad Street and South of\nSouth Street, which were also predominantly African American in the 1950s and 1960s and\nentirely working class are now almost uniformly white. Median household income is much more\nuniform in the block groups to the north and south of east South Street than in the west (Figure\n31). On the western edge, median household income in block groups south of South Street is\nalways at least one quantile below the same indicator for block groups north of South Street. This\npronounced distinction demonstrates that South Philadelphia blocks bordering South Street to\n\nFigure 31. Although the distinction between east and west Philadelphia is not so pronounced in terms of\nhousehold income, the eastern edge shows a more uniform pattern to the north and south of South Street\nthan does the western edge.\nthe west of Broad Street have been more successful than those east of Broad at prolonging the\ngentrification process.\nA demographic comparison of spectators at Odunde and the Mummers parade supports the thesis\nthat the two festivals reinforce and cater to distinct racial identities. Odunde attracts hundreds of\nthousands of African Americans, 80% of whom are from the Philadelphia area. Because Odunde,\nwhich is a New Year's festival based in South Philadelphia just like the Mummers Parade, can\nattract such a large body of African Americans, it highlights the low level of African American\nspectatorship at the Mummers' New Year's parade. The festival gives African Americans in\n\nPhiladelphia a New Year's celebration that is free from negative historical associations of racism\nand oppression. With attendance estimates reaching 200,000 to 250,000, even up to 400,000\npeople, the parade is probably attracting about 20% of Philadelphia's entire African American\npopulation (if we assume that approximately 80% of those attending are African American7).\nThis is a far higher percentage than attend the Mummers parade, whose recent attendance\nlevels have been comparable to Odunde, but whose spectators are probably only 20% African\nAmerican, if that.\nOrganizational Structure\ng\nThe organizational structure of the Mummers parade gives its participants an opportunity to\nconnect into city politics that Odunde participants do not enjoy. Because the Mummers grew\nout of grassroots celebrations held by loosely affiliated organizations, they have developed a\nrepresentative structure extending up to the Philadelphia New Years Shooters and Mummers\nAssociation (PNYSMA), which directly coordinates with the Philadelphia Department of\nRecreation. A diagram included in Rothberg's dissertation illustrates this structural organization\nas it existed in the late 1970s. While the parade has undergone a number of structural changes,\nthe idea is still the same: Clubs are grouped into Division Associations (separated by Comic,\nFancy, String Band, and Fancy Brigades). These are \"legislative and rule enforcement\" bodies\nfor their members.8 Clubs send representatives both to the Divisional Associations and to the\nPNYSMA, except for the Fancy Brigades, which are no longer part of the umbrella organization.\nBecause the number of clubs in each division is not proportional, however, the string bands,\nwhich still make up the largest division, control much of the decision making.9 Despite the\ninternal squabbles among Mummers Divisions and Clubs, the structure establishes political\nconnections between the Mummers and City Hall, and no decision about the parade can be made\nwithout input from the PNYSMA. Even during the 1990s controversy over the parade route,\nRendell always emphasized that the final decision lay in the hands of the Mummers.\n\nThe structure of Odunde, Inc. on the other hand, is not connected into the city's political\nstructure. Run with a staff of five and a six-member Board of Directors (due to some overlap,\nnine total), the organization's President and Executive Director are Lois and Oshunbumi (her\ndaughter) Fernandez respectively. In our interview, Oshunbumi explained that the vision for the\nfestival is held by the Fernandez family and they are wary of others trying to co-opt the festival\nfor other purposes.10 Because the festival's structure is determined solely by Odunde, Inc. and\nattended by unaffiliated residents and visitors, the organization does not provide the direct\nconnection to city government for its participants that the Mummers parade does. The result of\nthis disconnection is evident in the controversy over the festival's location. When city officials\ninvited Lois Fernandez to a meeting about the festival, she approached it like a battle and brought\nall of her allies with her to the table.11 Because no formal communication structure between\nthe parade and the city existed, Fernandez found that she depended on the unexpected support\nof then-City-Council-President John Street to win her case.12 That she succeeded in staying on\nSouth Street while the Mummers moved off Broad Street to Market illustrates how funding and\nsponsorship can both empower an organization and make it more vulnerable to outside forces.\nFunding and Sponsorship\ng\np\np\nBecause the Department of Recreation and the Mummers collaborate to organize the parade each\nyear and because the city contributes so much money to the prize purse (not to mention the much\nsmaller allocations to individual clubs), it has a stake in promoting the parade and encouraging\nattendance. This partnership has another side to it, and the fact that the city provides so financial\nsupport to the Mummers means that it has some leverage over parade decisions. The Mummers\ngenerate most of their income outside of city support, but the prize purse ($386,448 in 2002)\noffered by City Hall is the carrot that keeps the parade moving up Broad Street. The partnership\nthat the Mummers have with the Department of Recreation means that the city has input into\nwhat themes can go up the street and which street they go up.\n\nOdunde, Inc., which receives a city allocation that is but a small fraction of the Mummers' prize\npurse, is not beholden to the city for resources, but must also struggle to meet its expenses. For\nthe Mummers, if an individual club is not profitable, it will fold without disrupting the flow of\nthe event. If Odunde, Inc. cannot maintain financial solvency, however, the entire festival is\nendangered. While the festival has courted a number of partners and sponsors and cultivated\nrelationships with private donors, its primary income source is its vendor fees. By charging its\nvendors fees above those required for a city permit, Odunde is able to use the crowds it generates\nto help support itself. 13\nWhile the reliance of each event on city funding illustrates its connection (or disconnection)\nto city politics, a comparison of their additional program partners and sponsors reinforces\ntheir racial identities. The Mummers' radio sponsor is WTHK-FM (94.5), playing classic\nrock. Odunde, on the other hand, identifies itself with the radio stations WDAS-FM (105.3),\nspecializing in R&B and Soul, and WUSL-FM (Power 99 FM), which is Philly's main hip-hop\nmusic station. This difference in radio-station sponsorship speaks volumes to the difference in\npopulations that each event is serving. Odunde's alliance with other African American cultural\norganizations reaffirms its commitment to African American identity. Both organizations are also\nsponsored by major, non-racially specific Philadelphia organizations: SEPTA transit authority\nand the WB television station sponsor the Mummers and a variety of Philadelphia organizations\nsuch as the Philadelphia Cultural Fund, the Philadelphia Convention and Visitors Bureau, and\nthe Greater Philadelphia Tourism and Marketing Corporation sponsor Odunde. These sponsors\nwould seem to suggest that both celebrations are major Philadelphia events and obscures the fact\nthat Odunde still occupies marginal territory in the space of the city and the minds of many of its\n(white) residents.\nOne of the major differences between Odunde funding and Mummers funding is that a significant\nproportion of Odunde funding comes from state and national sources. The National Endowment\n\nfor the Arts (NEA) provided Odunde with the money it needed to renovate 2308 Grays Ferry\nAvenue and establish a headquarters at the festival location. The Pennsylvania Council on the\nArts and The Commonwealth of Pennsylvania are both important contributors. These sponsors\nreinforce Odunde's connection to conversations about African American identity that transcend\nthe local politics of Philadelphia.\nConclusion\nJust the fact that Philadelphia hosts two separate South-Philly based New Year's festivals that\ndraw participants from the city's two largest racial groups speaks volumes about the character\nof racial politics in the city. The city is clearly divided along racial lines. Independent observers\ncharacterized the 2003 mayoral race as racially charged. Larry Ceisler, a political consultant,\nwas quoted in The Philadelphia Daily News saying, \"We risk confirming all of the former\nimpressions of Philadelphia, as a city rife with corruption and racially polarized - not a place\nwhere you'd want to be.\"14 However, this observation does not answer the questions laid out in\nthe introduction about the spatial construction of racial identities and how it is related to politics.\nThis thesis demonstrates how racial identities are constructed and expressed in festival settings.\nFestivals communicate meaning through who they allow to participate and who to watch,\nthrough how they are advertised and promoted, through the symbols and images with which\nthey associate, through their funding and sponsorship, and through the performances that define\nthem. They act out meaning in spaces, and when that meaning draws on symbols associated with\nracial constructs and unites populations along racial lines, festivals construct and maintain racial\nidentity.\nThe Mummers parade in its original form drew intentionally excluded women and African\nAmericans. At the same, by performing caricatures of those groups' identities, Mummers had\nlicense to engage in raucous behavior that would be unsanctioned under normal circumstances.\nSponsored by the elite Anglo power structure, the parade's exclusion of African Americans'\n\nindicated an alliance between the European immigrant populations in the city and the native\nAnglo population. This alliance continues to serve as the backbone of white racial identity.\nAntagonism of African American spectators along Broad Street further alienated that population,\nand created a racialized backdrop of spectators for the parade as well. The parade's direct\nuse of characters, music, and dance from minstrel traditions, however, is its most significant\ncontribution to the formation of racial identity in Philadelphia. Blackface minstrels were\nnationally recognized for their impersonating performances of black culture. They allowed\nwhites to receive black culture from other whites, and by defining blackness as otherness, they\ndefined whiteness as normality.\nOdunde also draws on symbols that are part of national and international conceptions of\nAfrican American identity. Its visual language in posters and advertisements, as well as the\nAfrican dress encouraged by festival organizers are part of a larger structure of Afrocentric\nsymbolism developing in the United States since the mid-twentieth century. The primary\nactivity of Odunde--the procession to the river to honor Oshun--is a tradition adapted from\nits contemporary form in Nigeria and also part of the Afrocentric project for black identity.\nUnlike the racial identity constructed through the Mummers parade, this Afrocentric African\nAmerican identity works to develop an ethnic identity for African Americans that is at once\nboth Philadelphian and local and also connected internationally to the African Diaspora. Such\nethnic identification is a rejection of national racial categories while its construction is an\nacknowledgement of them.\nThis Afrocentric identity is reinforced in a number of other ways as well. Although no one is\nformally or officially excluded from participating in the festival, most participants are African\nAmerican. This phenomenon illuminates the divide between white and black populations in\nPhiladelphia, but it is not wholly accidental. Though in the last few years, Odunde has been\npromoted through banners hung across Market Street, for many years it was advertised almost\n\nexclusively through word-of-mouth and a few posters distributed across the city. Since the mid\n1980s, it has been announced in The Philadelphia Daily News and The Philadelphia Inquirer,\nbut The Philadelphia Tribune, the city's African American newspaper, is given a special\nadvertising section by Odunde, Inc. While corporate sponsorship changes from year to year,\nthe festival's first sponsor was an African clothing boutique in South Philadelphia run by Lois\nFernandez. Other participant-run businesses have continued to support the festival over the years,\nemphasizing its ownership by the community rather than the city.\nRacial identities have historically been political identities. Their primary purpose is to establish\nlines of exclusion within a political process. This division of political identity and its associated\nimbalance of power carry over into the social mores and are reinforced spatially through festivals\nand celebrations. Festivals tie symbolic representations of identity to the hierarchical public\nspaces of the city. In Philadelphia, the Mummers parade excluded women and blacks from\nparticipating (at least on significant, publicly visible scale). White men, acting out a caricature\nof those whom they excluded, filled the streets. But they did not fill just any streets. Since 1901,\nthey occupied Broad Street, the city's ceremonial avenue, leading to City Hall, the center of\nmunicipal authority. Over the course of the twentieth century, they shifted their route time and\nagain in response to a rising African American population along their unofficial route through the\nnorthern section of the city back to Second Street. These spaces form part of a spatial hierarchy\nthat defines the city's civic structure as separate from its urban fabric (or neighborhoods).\nThe Mummers Parade occupies the space of Broad Street, which, living up to its name, is the\nwidest street in Penn's original city plan. It is the city's spine, connecting South Philadelphia and\nNorth Philadelphia to City Hall, the city's tallest building until Willard G. Rouse III built One\nLiberty Place in 1987. To parade on Broad Street, especially in the early twentieth century, is to\nbe an important piece of Philadelphia culture. The Mummers parade, it a movement of powerful\nphysical symbolism, connected the working class immigrants in South Philadelphia to the power\n\nstructure of City Hall.\nThe physical connection between South Philadelphia and City Hall indicated a political\nconnection between the two populations. However, it did not establish a connection for everyone\nin South Philadelphia. Broad Street was also a territory dominated and controlled by white\nPhiladelphians for most of its history, and the Mummers Parade very intentionally excluded\nAfrican Americans from that new political access. African American public ceremonies on\nBroad were consistently met with hostility, and even an African American spectator presence\nwas met with threat and intimidation. Today the Mummers parade's Center City stretch is lined\nalmost entirely with white spectators. Though African Americans may no longer feel threatened,\nmany prefer to watch the show on television than stand in eight hours in the cold. It is not\ntheir tradition. The result of this disconnection is that white Philadelphians, many living in the\nsuburbs, see themselves in the context of a white Philadelphia.\nThe fact that the Mummers Parade prize purse is controlled by the city's Department of\nRecreation is yet another way that the parade and its participants are tied to the power structure\nof the city. The prize purse gives the city a greater amount of control over the content of\nthe parade, and it also provides an incentive for Mummers to participate in city politics. The\nstructure of working with the Department of Recreation in making decisions about the parade\nhas created a political structure amongst the participants. The Philadelphia New Years Shooters\nand Mummers Association is made up of representatives from each Division in the parade. Each\ndivision comprises representatives from each club in a complicated, and not always uniform,\ndecision-making structure. These interactions and connections with City Hall ensure that the\nidentity of the Mummers is not only racial, but political as well.\nDespite the increased political power of African Americans in the city--made manifest by its\nelection of two African American mayors, each serving two terms in the mayor's office--African\n\nAmericans still consider themselves politically marginalized. They continue to have virtually no\nsymbolic presence in Center City. The recent fight to include African American identity in the\nredesign of the Liberty Bell exhibition and the new Constitution Center indicates that they still\nhave an uphill battle to achieve an equal political presence in the city. South Street is a border\nbetween Center City and South Philadelphia. Despite the historic presence of African Americans\non and around South Street, the western edge of the street is at the periphery of many historically\nsignificant sites, which tend to cluster east of Broad Street. Odunde's position at this location\nfollows a trend of African American celebrations occupying marginal spaces, border spaces.\nSouth Street is the southern edge of William Penn's Philadelphia. It is not an insignificant street,\nbut it is also not well connected to the power structure of the city.\nCurrently the face of the mayor is one of the only images of African American identity that\noccupy City Hall and Center City. Even in terms of residential population, the city remains\nhighly segregated with the highest concentrations of whites living in Center City and blacks\nliving outside. Racial politics in the city are strongly influenced by this divide. Ed Rendell, the\ncity's first Jewish mayor, was known for his candid conversations with white suburbanites about\nrace and the city accusing them of pulling away from the city because of the black communities\nliving there. Yet, he focused his policies almost exclusively on Center City. Mayor John Street,\nthe city's second African American mayor, also known for his abrasive candidness about race,\nhas focused his attention and policy on the neighborhoods surrounding Center City.\nOdunde, though it receives some support from the city budget, funds itself primarily through its\nvendor fees and grants from the National Endowment for the Arts. Because its funding sources\nare national and international (many vendors come from various countries in Africa and South\nAmerica), it is not inherently tied to city politics. It's interactions with city government are\nsituational rather than on-going. Festival leaders met with city leaders when local residents were\npressuring the city to move Odunde from South Street, and again when they were unable to\n\npay a city fee. These interactions are often characterized by arguments that the festival should\nbe shown equal treatment as the Mummers, who are guaranteed city sponsorship and their\nparade route. Though the festival is an important city event, and a site of political engagement\non local, national, and international issues, it is not connected to the city in a mechanism for\ncivic engagement. It does not challenge the notion that African American political identity in\nPhiladelphia is marginalized, but rather continues that pattern of marginalization.\nOne of the most difficult tasks in studying festivals is extracting conclusions when their\nmeanings and contexts are constantly shifting. One of the most important contextual shifts for\nboth the Mummers and Odunde is the city's changing demographics. The increase in African\nAmerican populations along the northern stretches of the Mummers' unofficial parade route is\nanother indication of the changing demographic context of the parade. The increased presence\nand visibility of African Americans in the city put greater pressure on the parade to be more\ninclusive. The blackface controversy demonstrated that the parade did not hold the same meaning\nfor all Philadelphians, and it succeeded in removing the most offensive reference to minstrelsy\nfrom the faces of the Mummers.\nOdunde has also been impacted by the changing demographics of the city. It has grown\ntremendously since its 1975 inception, owing much of its success to the influx of Caribbean\nimmigrants in the United States since the 1960s. Caribbean immigrants in 2000 made up the\nsecond largest immigrant population entering Philadelphia County totaling 19,716 people.\nThis trend is significant because Lois Fernandez, the festival's founder is herself of Bahamian\nheritage, and the festival draws on Caribbean as well as African traditions. The festival is also a\nresponse to the new wealthy populations that are moving back into Center City, so its meaning is\nvery much tied to those demographic shifts as well.\nA potentially important question about demographics for both festivals, however, is how the\n\nAsian population, which is the fastest growing population in South Philadelphia, will affect the\nevents. At this point Asians make up such a small percentage of the population as to have little\neffect, but their presence is increasingly visible as areas once dominated by Italian stores and\nrestaurants now cater to various Asian populations. While Caribbean immigrants are moving to\nPhiladelphia, they are concentrating west of the Schuylkill River. For most of the census tracts\nof South Philly, the greatest population growth is in the Asian community. How this will impact\nthe meaning of the two festivals examined in this thesis remains to be seen. Will that population\nadopt one or both festivals as its own? Will it assert a new Asian racial identity or multiple,\ncompeting ethnic identities in the spaces of South Philadelphia? On January 1st, 2004, the comic\ngroups strutted up Broad Street. A Flintstones float passed by me blaring music, and right behind\nit came a array of yellow dresses and ribbons waving as a Falun Gong group came by passing\nout flyers and CDs. They were most certainly not Mummers, but they had made a space for\nthemselves in the parade and a space for themselves on Broad Street. The political nature of their\npresentation and presence doubtless foreshadows the future of celebratory practices in South\nPhiladelphia.\n(Endnotes)\n1 Insight Map Philadelphia. Maps: (Fuerstenfeldbruck, Germany: Berndtson & Berndtson GmbH, 2003); Text:\n(Singapore: APA Publications GmbH & Co. Verlag KG, 2003).\n2 Buchholz, p. 9.\n3 Ibid.\n4 Buchholz, Karen. pp. 8-9.\n5 Bykofsky, Stu and Dan Gross. \"The racial prism: We See Everything in Black and White.\" The Philadelphia Daily\nNews. January 6, 2004. Features, p. 33.\n6 Philadelphia Neighborhood Information Systems database and US Census from 1990, 1996 and 2000.\n7 This percentage is based on a comparison with the 2000 Census figures that include anyone who claims African\nAmerican as part of their racial composition.\n8 Rothberg, p. 125-128.\n9 Ibid.\n10 Interview with Oshunbumi Fernandez. February 16, 2004.\n11 Oral History, p. 167 \"I brought in my troops too.\"\n12 Ibid.\n13 http://www.odunde.org/licenses.htm.\n14 Davies, Dave. \"What Street Faces.\" The Philadelphia Daily News. November 05, 2003.\n\nIMAGE REFERENCES\nAcknowledgements:\ng\nOdunde (top left): Thomas B. Morton. Courtesy of Works in Progress (Philadelphia: The\nPhiladelphia Folklore Project). Volume 5, Number 2, Spring 1992. p. 1.\nMummers (bottom right): Golden Sunrise New Year's Association\nhttp://philadelphia.about.com/library/gallery/bl2002mummers171.htm\nChapter 1.\np\nFigure 1: Courtesy of Philadelphia Inquirer http://www.philly.com/images/philly/inquirer/6168/3\n8049712520.jpg\nFigure 2: Composite image created by author. Base map courtesy of Philadelphia Murals and the\nstories they tell. (Philadelphia: Temple University Press, 2002).\nFigure 3: Photography by author.\nChapter 3.\np\nFigure 4: Murray Comics http://philadelphia.about.com/library/gallery/bl2002mummers115.htm\nFigure 5: Fralinger String Band\nhttp://philadelphia.about.com/library/gallery/bl2002mummers48.htm\nFigure 6: Golden Sunrise New Year's Association\nhttp://philadelphia.about.com/library/gallery/bl2002mummers171.htm\nFigure 7. http://www.robbender.com/photos/philadelphia/mummers2002/\nFigure 8. http://mywebpages.comcast.net/wench/graphics/wench.gif\nFigures 9-11: Johnston, Norman J. \"The Caste and Class of the Urban Form of Historic\nPhiladelphia,\" Journal of the American Institute of Planners, November 1966, pp. 341, 345, 347.\nFigure 12: (web) Reference lost.\nFigure 13: http://www.stephen-foster-songs.de/Amsong35.htm.\nFigures 14-15: Composite image created by author. Base map courtesy of University of\nPennsylvania Neighborhood Information Systems: http://cml.upenn.edu/nbase/. Demographic\noverlay courtesy of Goode, Judith and JoAnne Snyder. Reshaping Ethnic and Racial Relations in\n\nPhiladelphia: Immigrants in a Divided City. Temple University Press: Philadelphia, 1994. p. 41\nFigure 16: Courtesy of Center City Plan. (Philadelphia: Philadelphia City Planning Commission,\n1963).\nFigure 17: Composite image created by author. Base map courtesy of University of Pennsylvania\nNeighborhood Information Systems: http://cml.upenn.edu/nbase/. Demographic overlay courtesy\nof Goode, Judith and JoAnne Snyder. Reshaping Ethnic and Racial Relations in Philadelphia:\nImmigrants in a Divided City. Temple University Press: Philadelphia, 1994. p. 41\nFigure 18: http://www.froggycarr.homestead.com/Mvc-019s.jpg\nChapter 4.\np\nFigure 19: Base map courtesy of Historic Urban Plans, Ithaca, NY, 1969.\nFigure 20: Johnston, Norman J. \"The Caste and Class of the Urban Form of Historic\nPhiladelphia,\" Journal of the American Institute of Planners, November 1966,\nFigure 21: Thomas B. Morton. Courtesy of Works in Progress. (Philadelphia: Philadelphia\nFolklore Project). Volume 8, Number 3, Summer/Fall 1995. p. 22.\nFigure 22: Thomas B. Morton. Courtesy of Works in Progress. (Philadelphia: Philadelphia\nFolklore Project). Volume 6, Number 2, Spring 1993. p. 6.\nChapter 5.\np\nFigures 23-24: Photography by author.\nFigure 25: http://www.polishamericancenter.org/ParadeRoute.htm\nFigure 26: Photography by author.\nFigure 27: Streetwise Philadelphia Map. 2004.\nFigures 28-31: Composite image created by author. Base map courtesy of University of\nPennsylvania Neighborhood Information Systems: http://cml.upenn.edu/nbase/. US Census 2000\ndemographic data."
    }
  ]
}