{
  "course_name": "Social Movements in Comparative Perspective",
  "course_description": "This course seeks to provide students with a general understanding of the form of collective action known as the social movement. Our task will be guided by the close examination of several twentieth century social movements in the United States. We will read about the U.S. civil rights, the unemployed workers’, welfare rights, pro-choice / pro-life and gay rights movements. We will compare and contrast certain of these movements with their counterparts in other countries. For all, we will identify the reasons for their successes and failures.",
  "topics": [
    "Humanities",
    "History",
    "Comparative History",
    "Philosophy",
    "Political Philosophy",
    "Social Science",
    "Political Science",
    "Comparative Politics",
    "Sociology",
    "Humanities",
    "History",
    "Comparative History",
    "Philosophy",
    "Political Philosophy",
    "Social Science",
    "Political Science",
    "Comparative Politics",
    "Sociology"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nCourse Description\n\n\"The people united will never be defeated,\" is a chant frequently heard at many a public rally. Yet, what motivates people to act collectively? And, are their efforts likely to be successful? Is there such a thing as \"people power\" that matters to how we explain political, economic, and social change?\n\nThis course seeks to provide students with a general understanding of the form of collective action known as the social movement. Our task will be guided by the close examination of several twentieth century social movements in the United States. We will read about the U.S. civil rights, the unemployed workers', welfare rights, pro-choice / pro-life and gay rights movements. We will compare and contrast certain of these movements with their counterparts in other countries. For all, we will identify the reasons for their successes and failures.\n\nCourse Requirements\n\nClassroom participation is a basic requirement of this course. Contributing usefully to classroom discussions requires that students read the assigned texts. There will be one take-home essay (3-5 pages), one in-class mid-term exam and one final research paper. The research paper (8-10 pages) may be on a social movement not covered by the course materials or on some aspect of the course's concerns. Students will present their papers during the final class meetings on session 9. It is strongly advised that students meet individually with the instructor to discuss their paper topics.The final grade will be calculated as follows:\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nClassroom Participation\n\n20%\n\nMidterm In-class Exam\n\n20%\n\nTake-home Essay\n\n25%\n\nFinal Research Paper\n\n35%",
  "files": []
}