{
  "course_name": "Solid Mechanics Laboratory",
  "course_description": "This course introduces students to basic properties of structural materials and behavior of simple structural elements and systems through a series of experiments. Students learn experimental technique, data collection, reduction and analysis, and presentation of results. Students generally take this subject during the same semester as 1.050, Solid Mechanics.",
  "topics": [
    "Engineering",
    "Civil Engineering",
    "Structural Engineering",
    "Mechanical Engineering",
    "Solid Mechanics",
    "Engineering",
    "Civil Engineering",
    "Structural Engineering",
    "Mechanical Engineering",
    "Solid Mechanics"
  ],
  "syllabus_content": "Course Meeting Times\n\nLabs: 2 sessions / week, 3 hours / session\n\nPrerequisites\n\nSolid Mechanics,\n1.050\n\nDescription\n\nIn Solid Mechanics Laboratory, 1.105, you will have the opportunity to assemble and test a variety of structural elements. You will subject them to loading, and observe and measure their behavior using both crude and relatively sophisticated instruments. Foci include:\n\nTesting of statements made and conclusions derived in the companion subject, 1.050;\n\nStudy force/displacement, stiffness behavior of structural elements;\n\nFailure modes and mechanisms;\n\nIntroduction to instrumentation, resolution, range, transducer response, signal conditioning;\n\nCoping with uncertainty; methods of data analysis;\n\nExperiment design; and\n\nReport writing.\n\nLaboratory Conduct\n\nEach lab session will begin with an orientation. The lab instructor will respond to questions and convey essential, tacit, knowledge regarding the smooth conduct of the experiment. The lab instructor will be available throughout the three hours to provoke your thinking in response to questions that you pose.\n\nThe laboratory exercise is not a test. It is a 'hands-on' experience meant to show the relevance of theoretical concepts to understanding the behavior of real hardware and instrumentation and, at the same time, reveal how non-ideal conditions and some very 'un-theoretical' events can obscure the theoretical behavior.\n\nThere are four test frames in the lab. You will work in groups of two or three. While you are to collaborate in setting-up and running the experiments, each of you individually will be responsible for a report of your experiences. Procedures for each experiment, other than the first, are to be read before the start of lab even though these can only sketch out what needs to be done to effect a measurement. Certain constraints are printed in bold within these descriptions. These constraints are to be strictly observed. In part this is for safety reasons, in part because we do not want to fail a test specimen or overload an instrument. If you are not sure, ask your lab instructor.\n\nThe most successful experiments in science and engineering are those in which you know what the outcome will be before you start. Indeed, you cannot design an experiment without knowing something about the range of possible deflections, a safe loading of the structure, an instruments sensitivity to some external, disturbance, and the like. So while the experiment is in progress, one of your team should do a rough data reduction and sketch out the behavior e.g., load vs. deflection, as you go along. Make the most of your time to ensure that you have 'quality' data by checking it with expectations. At the same time you must resist letting your expectations color or bias your readings; if your reading looks 10% low, don't try to reduce the difference; on the other hand if it is off by a factor of 10, you had better stop everything and check your experimental setup, your theoretical deductions, or your data analysis procedures.\n\nReport Content and Format\n\nYou will record your activities in the lab in a lab notebook. You are to use ink, make no erasures. Draw a line through that text which you find faulty or erroneous. Sketches of apparatus may be made in pencil. Make sure you record all relevant dimensions, variables, settings, (don't neglect to record the units) and information that will enable you to write the report without coming back to the lab to check up on the value of a critical parameter.\n\nIf you use a laptop computer to record data, you must still print out pages to paste into your lab notebook. The report should include the following:\n\nSummary - a one page summary of purpose, method and main results;\n\nIntroduction, including objectives;\n\nExperimental procedure;\n\nResults;\n\nConclusions; and\n\nAppendices.\n\nThe amount of detail to include in these sections varies depending upon your audience. For our purposes, think of your audience as a fellow student who has not yet done the experiment but will do so within a few days. You can assume they are familiar with the theoretical concepts of 1.050. With respect to instrumentation, assume this student is aware of the basic principle of operation of the transducer but is not familiar with the particular application you are making. Results should not include excessive detail. Put the full data record in the appendices. Appendices are also the place for background theory, manufacturer's specifications and the like.\n\nGrading\n\nThis is a 6 unit subject. There are seven in-lab experiments.\n\nExperiment 5 - 10%;\n\nThe remaining six experiments are 15% each; and\n\nThere is no final exam.",
  "files": [
    {
      "category": "Resource",
      "title": "leastsqrs.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-105-solid-mechanics-laboratory-fall-2003/49291a7fab46346d2e5ac7fdcecf764c_leastsqrs.pdf",
      "content": "1.105 Solid Mechanics Laboratory\nLeast Squares Fit of Straight Line to Data\nWe start with a data set of n points, xj, yj, through which we\nwish to fit a straight line\ny = mx\nb\n\n+ .\nIn the figure, we show 11 pairs of x,y values, xj,yj where n is the\nnumber of points, n = 11. A jth point is shown as a shaded cir\ncle.\nSay we try to fit a line by eye; we might draw a line as dis\nplayed in the next graph.\nThe aim now is to set m, the slope of our \"best fit\" line and b, its\njth point\nxj\nyj\njth point\nxj\nyj\ny(xj)\n(yj - y(xj))\ny\ny = mx+b\nintercept with the y axis. The criteria we use is to minimize the\n\"least square error\" of the y coordinate. (This is not the only cri\nterion that might be usefully applied. Can you think of\nanother?) That is we seek to choose m and b to minimize the\nquantity\nn\n(\n)\n\n- yj]\nError = ∑[y xj\nx\nj = 1\nWe can imagine moving the line around to minimize this sum. That's in effect what is going through my mind as I\n\"eyeball\" a best fit line. You might, hold the slope, m, constant and slide the line up and down until it looks good. Or\nyou might pin the line at its y intercept, b, at x= 0 and rotate the line around until it looks even better. Or, better yet, we\ncan rely upon the differential calculus and set the partial derivatives of this Error sum with respect to both m and b to\nzero - they are independent variables - in order to find their values exactly. This we do now. We have:\nn\nn\n∂m\n∂ Error = ∑ 2\nmx j +\n[\n⋅\nb\ny\n\nj\n-\n] x j\n⋅\n= 0\nand\n∂b\n∂ Error = ∑ 2\nmx j\n[\n⋅\n+ b\ny\n\nj\n-\n] 1\n⋅\n= 0\nj = 1\nj = 1\nGiven the n pairs of points xj,yj , these can be taken as two linear equations for determining the slope and intercept.\nRewriting, canceling the common factor, 2, we have\nn\n⎞\nn\n⎛\n⎛ n\n⎞\n⎜\n⎜\n⎜∑ x2\nj\n⎟\n⎟ ⋅ m + ⎜∑ x ⎟⋅ b = ∑ x ⋅ yj\nj⎟\nj\n⎝ j = 1\n⎠\n⎝ j = 1 ⎠\nj = 1\nand\nn\n⎞\nn\n⎛\n⎛ n\n⎞\n⎜\nxj\n⎟\n⎟ ⋅ m + ⎜\n1⎟\n⎟ ⋅ b = ∑ yj\n⎜∑\n⎜∑\n⎝ j = 1 ⎠\n⎝ j = 1 ⎠\nj = 1\nSeptember 24, 2003\nLL Bucciarelli\n1.105\n\n---\n---\n---\n---\n---\n---\n---\n---\n------------------------------------------------------------------------------------------------------\n⋅\n⋅\nDividing all by n, the number of points, and noting that the sum of 1, n times is just equal to n, we have two linear\nequations for the unknowns m and b. The coefficients appearing in these two are set by the values of the data point\npairs, xj,yj .\nn\nn\nn\n-- ∑ x2\nj ⋅ m + -- ∑ x ⋅ b = -- ∑ x ⋅ yj\nj\nn\nn\nj\nn\nj = 1\nj = 1\nj = 1\nand\nn\nn\n-- ∑ x ⋅ m\nb\n+\n= -- ⋅∑ yj\nn\nj\nn\nj = 1\nj = 1\nThe solution is:\nn\nn\nn\nn\n--\nyj ⋅ -- ∑ x2 - --\nx\n⋅ n ∑ x ⋅ yj\nn ∑\nn\nj\nn ∑ j\nj\nj = 1\nj = 1\nj = 1\nj = 1\nb = ----------------------------------------------------------------------------------------------------------------------------------------\nm =\nn\nx j\nj\n=\nn\n∑\nn\nx j\nj\n=\nn\n∑\n-\nand\nn\nx j y j\n⋅\nj\n=\nn\n∑\nn\nx j\nj\n=\nn\n∑\nn\ny j\nj\n=\nn\n∑\n⋅\n-\nn\nx j\nj\n=\nn\n∑\nn\nx j\nj\n=\nn\n∑\n-\n-\nn\nn\nn\nn\nor, letting\nx = --\nx\ny = --\nxy = --\nx ⋅ yj\nx2 = --\nx\nrecognizing\nn ∑ j\nn ∑ yj\nn ∑ j\nn ∑\nj\nj = 1\nj = 1\nj = 1\nj = 1\nthe first sum is just the mean of xj, the second, the mean of yj, etc., we have more simply:\ny x - x xy\nxy - x ⋅ y\nb = ---------------------------------\nand\nm = ----------------------\nx\nx\nx - [ ]\nx - [ ]\nExample 1.\nGiven the three pairs of points:\nx\ny\nThe \"averages\" compute to those\nshown at the right. With these we\nfind\nb = 3.43\nand\nm = - 0.143\nThe best fit line is shown.\ny = 3\nxj\nyj\nx = 3\nx = 3\nn = 3\nand\nx = 3\ny = 3\nxy = 3\nSeptember 24, 2003\nLL Bucciarelli\n1.105\n\nYou might have expected another result, e.g., a line through the origin, passing through the point 1,1. But consider the\ncriterion we applied: The error we minimize is proportional to the vertical distance between the data point and the line.\nTry computing the error of the best fit line and compare it with a line through 0,0 and 1,1.\nWe note that the best fit line goes through a point defined by the mean of xj and yj. You can verify this, in general,\nchecking to see if, when you put x = x, you obtain y from y = mx\nb\n\n+\n.\nTry adding another point or two to the set of three given. E.g., the points 0,0 and/or 6,6. What happens to the best fit\nline?\nSeptember 24, 2003\nLL Bucciarelli\n1.105"
    },
    {
      "category": "Resource",
      "title": "exp2_03.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-105-solid-mechanics-laboratory-fall-2003/32aa7cdbd934914f045b17a219b3b155_exp2_03.pdf",
      "content": "1.105 Solid Mechanics Laboratory\nFall 2003\nExperiment 2\nExperiment 2 consists of two separate experiments. In the first experiment, 2.1 you will verify static\nequilibrium consequences for a weight(s) suspended from a cable.\nIn the second experiment, 2.2, you will determine the force/deflection relationship for a redundant\nstructure built up of cables under pretension. Your report on this experiment will be due at the\nbeginning of your lab session the week of 1 October.\nIn both experiments you will be using some standard weights, large ones painted grey, smaller\nones painted red. At the outset, measure and record the values of these weights using the balance\nscale on the cabinet near the entrance to the lab. Do a sampling of values of each weight and\ninclude an estimate of uncertainty in your measurement.\nExperiment 2.1a\nThe figure shows the experimental set-up for\nthe first part (of the first experiment). A cable\nis supported by two pulleys and loaded by\ntwo equal weights at its extremes, A and B.\nTake WA=WB = Wbig = One of the big\nweights.1\nWA\nW\nC\nL\nx\nθ\nB\nA\nA third weight, which you will vary, is sus\npended from the cable at midpoint. The\nweight W is not quite free to slide along the\ncable so you will have to ensure it remains at\nWB\nmidpoint by adjusting on occasion.\nL/2\nYou will apply the load using a light chain and\nnot so light pail hooked to point C. Since the\nchain and pail have weight, they will deflect the cable some. Hence your first reading for x, the ver\ntical displacement from level, will be with the chain plus pail. Don't forget to measure their weight.\nIncrementally increase the weight W, continuing from this point, adding the smaller red weights to\nthe pail. Measure, using the meter stick, the corresponding values of the vertical displacement x.\nContinue until the latter in nondimensional form, x/L, is in the vicinity of 1/2.\nUnload the system incrementally, again measuring and recording the displacement x.\nExperiment 2.1b\nIn this part of the experiment we keep the interior weight (W0 in the figure) constant, equal to one\nof the big weights. and, in addition, fix the point of application to the cable2. The weights at the\n1. Be careful with units. Your rough data in your lab notebook should record measurements in the units of the\ninstrument you are using, e.g., the dial gage indicator reads in increments of .001\". Make conversions and\nreport your results using a consistent system, either metric or english.\n2. This requires some hardware adjustments which your instructor will take care of.\n1.105 Solid Mechanics Laboratory\nSeptember 15, 2003\n\nends of the cable, as in the prior experiment, are initially the same - hence the initial configuration,\nall three weights are equal, and each equal to one of the big weights.\nNow increment the weight WB at the right, start\ning from W0. using the smaller red weights.\n(Use the chain hanging from the bottom hook of\nB and attach the smaller weights to the links of\nthe chain underneath the grill structure).\nB\nMake measurements of both distances x and y\n(or L- y), at each loading using the meter stick.\nMake sure you associate an uncertainty with\nWB\neach kind of reading.\nA\nL\nx\nθA\nθB\ny\nW0\n=\nWA\nW0\nUnload incrementally and record x and y again.\nWhen finished, remove the middle weight and\nthe chain for the weight at B but leave the two\nbig weights attached to the ends.\nReport Contents 2.1\nYour report should be in the format:\nSummary (One or two paragraphs)\nIntroduction\nExperimental Method\nResults (including comparison with theory)\nConclusion\nAppendix\nIn your results for 2.1a, you are to plot W/Wbig versus x/L (i.e., in nondimensional form). Compare\nto theory. (The tensions in the cable on either side of midpoint, assuming frictionless pulleys, are\nequal to Wbig. Static equilibrium of an isolation of the midpoint where the load is applied then gives\na relationship between the tensions in the cable and the applied load. But the angle theta neces\nsarily enters into this equation. Theta, in turn is a function of x - a relationship derived from the\ngeometry of the deflected configuration. In this way you can construct a theoretical relationship\nbetween x/L and W/Wbig, (the tensions being known)\nFor part 2.1b, make two plots of the data obtained, one for WB/W0 versus x/L and another for the\nratio WB/w0 versus y/L. Show what theory predicts for these relationships on the same graphs. In\nthis, make use of the analysis found in Appendix A. One way to proceed is as follows:\ni) pick a value for θB\nii) from the fact that FA=WA=W0 and the relationship FA = W ⋅ cos θB ⁄ sin (θ A + θB) derived from\no\nequilibrium as in the appendix, compute a value for θA.\niii) The ratios x/L and y/L can then be found from the geometry of the deflected configuration for\nthese values of θB and θA.\niv) The other equation derived from equilibrium gives WB/W0 (or FB/W0 ).\nFB = W ⋅ cos θ A ⁄ sin (θ A + θB)\no\nFall 2003\nSeptember 15, 2003\n\n(Note: The analysis of Exercise 2.3 of the textbook, has a notation difference from that which is\nincluded in the Appendix. The notation in the Appendix is consistent with the notation used\nabove).\nElaboration of these cryptic instructions will be given in a session of 1.050, the companion subject.\nExperiment 2.2\nHere, we test the force-deflection behavior of a\nplanar structure which includes two pre-ten-\nsioned cables for support. Slots in the support at\nC will allow you, with the assistance of the lab\ninstructor, to pretension cable BC. Since the\nsupport at D is a frictionless pin, or as close to\nthat condition as we can come, this will preten\nsion cable AB as well.\nUsing a meter stick measure the dimensions\nbetween all pins.\nExperiment 2.2a\nA\nB\nC\nP, ∆\nD\nFirst we will leave cable BC slack and incre\nmentally increase the load W at B and measure the corresponding deflection ∆ using the dial gage\nindicator. This will enable you to calculate the \"stiffness\" at B (in the vertical direction) of this, now\nstatically determinate system.\nThe dial gage indicator should be \"preloaded\" to some positive displacement, > .020 in. During\nloading, this will decrease. Record the actual scale reading. Compute the displacements later.\nIn loading, use the red weights as increments and do not exceed ten, (10) pounds. Use the chain\nand pail to hold the loads. (Measure their weight before you start) Although the structure should\nnot fail at this loading, the person reading the dial gage should wear safety glasses.\nUnload incrementally, recording displacements as you go. Record the zero load displacement.\nRepeat the proceedure, taking another data set.\nExperiment 2.2b\nNow, with the dial gage still in place, and all loading removed, adjust the support at C to take up\nthe slack, then pretension BC until the dial gage indicates a vertical displacement of around .025\".\nDo not exceed .035\".\nNow again load the structure, using the chain and pail, at point B. Again use one pound incre\nments but go to 20 pounds. Do not exceed 20 pounds. You should see the cable BC go slack\nbefore you reach this maximum load.\nUnload incrementally, recording displacements as you go. Record the zero load displacement.\nRepeat the proceedure, taking another data set.\nFinally, release the pretension by loosening the support at C, and read and record the dial gage.\nReport Contents 2.2\nFollow the same format as in Experiment 2.1.\nFall 2003\nSeptember 15, 2003\n\nIn your results section, for 2.2a, plot load P versus deflection ∆ and determine the stiffness - i.e.,\nthe value of K in\nP= K ∆\nby \"best\" fitting a straight line to the plotted data.\nIn your results section for 2.2b, the pretensioned, statically indeterminate system, plot load P ver\nsus deflection ∆. How does this plot differ from that of experiment 2.2a?\nAt maximum loading conditions, how much has the angle the cable AC makes with the horizontal\nmember changed?\nFall 2003\nSeptember 15, 2003\n\nAppendix A\nExercise 2.3- Show that the forces in cable AC and CB are given by\nFB = W cos θ A ⁄ sin (θ A + θB)\no\nand\nFA = W cos θB ⁄ sin (θ A + θB)\no\nWe first isolate the system, making it a particle. Point C, where the line of action of the weight vec\ntor intersects with the lines of action of the tensions in the cables becomes our particle.\nThe three force vectors, FA, FB and Wo\nthen must sum to zero for static equilibrium. Or\nagain, the resultant force on the isolated particle\nmust vanish. We meet this condition on the vector\nsum by insisting that two scalar sums - the sum of\nthe horizontal (or x) components and the sum of\nthe vertical (or y) components - vanish indepen\ndently. For the sum of the x components we have,\ntaking positive x as positive:\nW\nθB\nθA\nFB\nFA\nx\ny\nC\n-FA cos θ A + FB cos θB = 0\nand for the sum of the y components,\nFA sin θ A + FB sin θB - W = 0\no\nA bit of conventional syntax is illustrated here in setting the sums to zero rather than doing other\nwise, i.e., in the second equation, setting the sum of the two vertical components of the forces in the cables\nequal to the weight. Ignoring this apparently trivial convention can lead to disastrous results, at least early on\nin learning one's way in Engineering Mechanics. The convention brings to the fore the necessity of isolat-\ning a particle before applying the equilibrium requirement.\nWe see that what we need to know to determine the force in cable AC and in cable CB are the\nangles θA and θB and the weight of the block, Wo. These are the givens; the magnitudes of the two forces, FA\nand FB are our two scalar unknowns. We read the above then as two scalar equations in two scalar\nunknowns. We have reduced the problem... show that... to a task in elementary algebra. To proceed requires\na certain versatility in this more rarefied language.\nThere are various ways to proceed at this point. I can multiply the first equation by sinθA, the sec\nond by cosθA and add the two to obtain\nFB ⋅( sin θ A ⋅ cos θB + sin θB ⋅ cos θ A) = W cos θ A\no\nMaking use of an appropriate trigonometric identity, we can write:\nFB = W ⋅ cos θ A ⁄ sin (θ A + θB)\no\nSimilarly, we find:\nF = W ⋅ cos θB ⁄ sin (θ A + θB)\nA\no\nFall 2003\nSeptember 15, 2003\n\nAppendix B\nWe want to determine the stiffness k of the cable alone. For this statically determinate structure,\nderive an expression for the force in the cable AB as a function of the structure geometry and the\napplied load from equilibrium considerations. Derive then the extension, δ, in the cable AB as a\nfunction of ∆, the vertical displacement of point B from compatibility of deformation. With these in\nhand, and using the measured values for the applied load and ∆, calculate pairs of values for the\nforce in the cable, fAB and its elongation δ and plot fAB versus δ. From this plot, determine the\nslope, the stiffness, k, of the cable.\nNote: For small deflections and rota\ntions, the extension of the cable AB is\ngiven by the projection of the vertical\ndisplacement of point B onto the cable.\nThat is, compatibility of deformation\nrequires:\nδ = ∆ sin φ\n∆\nδ\nφ\nφ\n= ∆ sinφ\nA\nB\nfAB\nfBC\nφ\nP\nThe force in the cable AB, fAB, in terms\nof the measured, applied load at B, is\nfound from equilibrium of the \"pin\" at B.\nThe stiffness, k, of the cable is then\nfound from the slope of the graph of fAB\nversus δ.\nfAB =kδ\nFall 2003\nSeptember 15, 2003"
    },
    {
      "category": "Resource",
      "title": "exp3_03.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-105-solid-mechanics-laboratory-fall-2003/0f895868598a52276cafb4875f9c277b_exp3_03.pdf",
      "content": "1.105 Solid Mechanics Laboratory\nSeptember 30, 2003\n1.105 Solid Mechanics Laboratory\nFall 2003\nExperiment 3 The Tension Test\nOur objective is to measure the Elastic Modulus of steel. The experiment comes in two parts.\nIn the first, you will subject a steel rod speciman to a tension test using an Instron testing machine\ndesigned specifically for that purpose. An \"extensometer\" will be used to obtain a measure of\nstrain and a \"load cell\" used to obtain a measure of stress.\nIn the second part of the experiment. you will do a tension test of a stainless steel wire, loading the\nspecimen using the dead weights available in the lab but measuring displacement using the LVDT,\nLinearly Variable Differential Transformer.\nYou will use the pages that follow in reporting your results. You will fill in the blanks with\nthe data you collect, with the results of the calculations specified herein, draw or paste in\ngraphs in the spaces provided, and provide an analysis of your results when requested.\nThis then is your report.\n2.1 Tension Test of a steel rod.\nThe INSTRON machine is built specifically to sub-\nject structural elements to tension or compression.\nThe schematic at the right indicates how it works.\nA double acting piston drives the table up, or down,\nwhen pressurized hydraulically. The test specimen\nis fixed relative to the top bar and the shaded cross\nbar by the grips; the shaded cross bar is fixed in\nspace. Hence, the specimen is subject to a tensile\nload as the table moves downward.\nTest Sequence - Overview1\nMeasure and record the diameter of the test speci-\nmen.\nFix the specimen in the grips of the machine.\nAttach the extensometer, recording the gage length\n(below)\nSet up the Instron for \"ramp\" increase of load, setting the actuator control for a table motion of\n0.2in / min.\nDo \"automatic calibration\" to set full scale values for load and displacement and output voltages.\nRecord load and displacement factors. (below)\nEnsure the Data Acquisition System is set to record.\nLoad specimen to rupture. Wear safety glasses.\n1. Steve Rudolph and Pong will set up and run the test machine. You are responsible only for the first step.\ntable\npiston\nspecimen\nINSTRON Machine\ndouble\nacting\nextensometer\nLoad Cell\n\nFall 2003\nSeptember 30, 2003\nParameters for determining tensile stress.\nThe load is sensed by a load cell at the top bar. It puts out a voltage proportional to the load. For\nour purposes, all you need know is the scaling factor for converting the voltage to tensile force.\nThis is obtained from a \"full scale\" setting, the \"automatic calibration\" of the load cell. At full scale,\nthe signal output is 4.0 Volts and the corresponding load is 100 KN or ___________ Kips1.\nThe load factor is then:\nKnowing the cross-sectional area of the test specimen, we can, knowing the load, compute the\ntensile stress in the bar. We record that the diameter of the specimen as:\nSo the cross sectional area is\nThe bar, made of ___________steel, has a\nFor our specimen then, we expect large deformations and failure at a load of\nThis suggests that our output voltage will range from zero to\nOur goal is to graph how the tensile stress varies with the tensile strain. We need, then to go one\nstep further and construct the factor for tensile stress in terms of voltage. Dividing the force by the\narea we obtain:\nTo compute the corresponding values of the strain, we need to measure the change in length of\nthe specimen. The strain is then the ratio of the change in length to the original length.\n1. 1 Kip is 1000 pounds.\nKN/volt\nLoad factor =\nKips/volt\nor =\n+/- ? mm or = ___________________+/- ? in.\nDiameter =\nmm2 or _____________________ in2\nArea =\nyield stress of ______ ksi. and an ultimate stress of ________ ksi\nlb. or _________________ KN\nExpected Failure ~\nvolts.\nAnticipated load voltage at failure =\nPascals/volt\nStress factor =\npsi/volt\nor =\n\nFall 2003\nSeptember 30, 2003\nParameters for determining tensile strain.\nAn extensometer will be used to measure the change in length between two points located on the\nsurface of the cylindrical specimen. The two knife edges, which are held in place against the spec-\nimen by simple elastic bands, are initially spaced a preset distance apart. This \"gage length\" is\nThe gage factor is determined from \"full scale\" conditions. The extensonmeter we will use can\naccomodate a full scale displacement of +/- 0.2 inches. The full scale output voltage is 4.0 volts.\nHence, the scale factor for displacement is\nThe strain factor is then, dividing by the gage length\nWe anticipate, at loading near yielding where the strain is but ____________ in/in, the voltage out-\nput of the extensometer will be _____________ volts.\nData Collection and Analysis\nData will be recorded via the computer (equipped with analogue to digital conversion hardware).\nAn ASCI text file will be produced in three column format. The first dozen or so readings will show\nnegative values for the displacement and load as the speciman \"takes up the load\".\nTime\nDisplacement\nLoad\n(sec)\n(volts) (volts)\nResults\nOnce we have a plot, we determine the slope in the elastic range. This slope, if taken directly from\nthe graph, will have the units of inch/inch. We follow the trail back through all the scale factors to\ncompute the slope as a ratio of tensile stress to tensile strain. We obtain in this way the following\nexperimentally determined value for E, the elastic, or Young's modulus:\nImport the graph from your spread sheet or simply, physically cut and paste it into this document\non the next page.\nin or mm\nGage Length =\nmm/volt\nDisplacement factor =\nin/volt or\nmm/mm/volt\nStrain factor =\nin/in/volt or\n+/- ? psi or +/-? Pascals\nE, the elastic, or Young's modulus =\n\nFall 2003\nSeptember 30, 2003\nA graph of the stress-strain curve, ranging up to four times the strain at yield is shown below.\nThe slope is indicated on the graph.\nReasons for this discrepancy include:\n[Here attempt to explain this discrepancy and deviations from linearity.]\nStress versus strain - Uniaxial Tension Test\nSteel Bar Date:\nStress\npsi\nStrain, in/in\n%\nIt differs from the \"book value\" by ~\n\nFall 2003\nSeptember 30, 2003\n2.2 Tension test of a steel rod.\nWe return to the lab and subject a thin, stainless steel rod to tension. We again measure pairs of\nvalues of applied loading and displacement but we do not take the specimen to failure. We will\nremain in the elastic range, then unload.\nCalibration of the LVDT.\nWe first calibrate the LVDT. [Actually a dc voltage input/output device]. The attached specifications\nare for the case when the instrument maker's core is used. We use a home-made core which will\nallow us to load the specimen directly through the LVDT.\nWe lay the LVDT down on its side, on a\nsheet of graph paper as shown at the\nright.\nThe Hewitt Packard power supply is off.\nWe make sure the red lead of the LVDT\nis attached to the plus (+) 20v output\nterminal, the black lead to the minus (-)\n20v terminal. The tracking knob is set all\nthe way around to the right to the \"fixed\"\nposition.\nWe attach the clip leads of the digital\nmulti-meter to the blue and green leads of\nthe LVDT. The polarity is not critical. We\nset the multimeter to the DC volts scale.\nAfter checking with the lab instructor, we turn on the power supply and adjust the plus 20 volt\nknob to five, 5, volts (read directly from the meter of the power supply) or as close as we can\ncome. Pushing the - 20v meter selection button, we see, because of the tracking feature, a nega-\ntive voltage of the same magnitude is present at the minus 20v output terminal.\nWe do not change these settings for the duration of the experiment.\nWe choose some reference point for the location of the extreme right end of the core such that the\nLVDT voltage output, as read by the digital meter, is in the vicinity of zero.\nWe record pairs of LVDT output voltage/core-position values over a volatage range which extends\nfrom one side of zero to the other. As per the instrument's specifications,\nwe note that the working range (with the original core) is specified as\nhence our calibration data extends over a relative displacement of inches.\nX\nreference\nhome made core\nred\nblack\n-20v\n+20\nblue\ngreen\ndigital meter\nvolts\nLVDT supply voltage, +/-\nLVDT Model Number\nLVDT working range = +/- in\n\nFall 2003\nSeptember 30, 2003\nThe table below shows measured pairs of LVDT output voltage/core position values.\nA plot of the voltage/position pairs is shown below.\nLVDT Calibration\nLVDT output\nX Position\n[Units?]\n[Units?]\n[+/-??]\n[+/-??]\nX position\nLVDT output voltage\n\nFall 2003\nSeptember 30, 2003\nA straight line fit to the working range of the instruments yields a slope of\nSetup of test specimen.\nThe schematic at the right shows the test setup. Follow these\nsteps to assemble the arrangement displayed:\nSwitch off and unplug the power supply, and remove the digital\nmultimeter clip leads from the blue and green outputs of the\nLVDT. Move the power supply and the LVDT with its red and\nblack leads still attached to the +/- 20 volt output terminals to\nthe top of the biege supply cabinet at the side of the test bed.\nWe measure the diameter of the specimen... and the length\nbetween the heads of the threaded fastners at each end.\nMeasure also the length of the core which contributes to your\nmeasure of strain. (See Appendix).\nAt this point, make an estimate of a \"safe\" maximum load for the specimen based upon\n-\nthe yield stress of the tension test observed in the first part of the experiment.\n-\nthe yield stress of 1020 Cold Rolled steel ~90,000 psi\n-\nthe yield stress of 1020 Hot Rolled steel ~ 40,000 psi\nLVDT sensitivity = volts/inch\nfixed\nLVDT\nW\nspecimen\nharness ring\nchain\nL0\nstand\nAl\nfixture\nSpecimen diameter = +/- ?? [units]\nSpecimen length = +/- ?? [units]\nSafe Load = lbs.\nSafe Load = lbs.\nSafe Load = lbs.\n\nFall 2003\nSeptember 30, 2003\nThread the custom core through the LVDT so that the threaded end of the core protruds from that\nend of the LVDT from which all lead wires emerge. With this same end facing the floor, fit the\nLVDT thru the cylindrical hole in the aluminum piece which has already been attached to the\nstand. Locate the fixture about midpoint of the LVDT and tighten the wing nut.\nSlide the small harness ring over the threaded end of the core, locate the washer, then the nut and\nturn down the latter until the threads of the core extend beyond the face of the nut.\nNow align the fixture and stand such that the test specimen and LVDT are vertical and in line. Do\na sighting from two othogonal directions. You can adjust the relative position of the fixture with\nrespect to the stand and you can adjust the location of the stand on the test bed.\nNow plug in the power supply and attach the clip leads of the multimeter to the output leads of the\nLVDT. Do not turn the power supply on. Have your lab instructor verify the setup.\nAdjust the vertical position of the fixture and LVDT relative to the stand such that the reading on\nthe multimeter (DC volts scale) is in the vicinity of zero. Switch to the 400mv DC volt range and\nadjust further until the meter reads near zero or, better yet, on that side of zero which will\napproach, and go through zero as load is applied.\nRecheck the verticality.\nAttach the chain to the harness ring using a \"heavy\" S hook.\nAttach the pail to the other end of the chain hanging below the test bed again using a heavy S\nhook. Make sure the chain passes through the appropriate slot in the test bed to minimize friction.\nThe bottom of the pail should hang but a half inch off the mat on the floor. Although the\nexperiment should not take the specimen to failure, we want to make sure that, if failure did occur,\nthe thick end of the custom core does not impact the LVDT from above. Again, have your lab\ninstructor verify the setup.\nWe now load the specimen, using the big weights, each of which measures\nUnit weight = +/- ?? [units]\n\nFall 2003\nSeptember 30, 2003\nWe do not exceed an applied load of 70 pounds. We take data upon unloading as well.\nThe two columns on the right included data taken in the lab. The remaining columns were com-\nputed subsequently.\nTABLE 1. Tension Test Data Date:\nLoad\nLVDT\noutput\nRelatve\nLVDT out\nDisplcmnt\nStrain\nε\nStress\nσ\n[units]\n[units]\n[units]\n[units]\n[units]\n[units]\n+/- ???\n+/-\n+/-\n+/-\n+/-\n+/-\nChain +pail\n\nFall 2003\nSeptember 30, 2003\nResults\nThe plot below shows the stress strain curve obtained. We also redraw the curve obtained for the\nsteel rod on the same plot.\nThe slope of the stress/strain curve in the linear elastic range gives a value for the elastic modulus\nfor the rod of\nAgain, we see this is (above, below?) the book value by a (significant, small?) amount. This differ-\nence (can, can not ?) be accounted for by uncertainty in our making of measurements.\n[Here add more discussion]\nConclusions and Recommendations\n[Here add your conclusions and recommendations]\nStress versus strain - Uniaxial Tension Test\nSteel Bar & Rod\nStress\npsi\nStrain, in/in\n+/- ?? psi\nE, the elastic, or Young's modulus =\n\nFall 2003\nSeptember 30, 2003\nAppendix - Uniaxial Tensile Stress, Strain and Linear Springs.\nThe tension test.\nThe tension test is a standard test1for characterriz-\ning the behavior of a material under uniaxial load.\nThe test consists of pulling on a circular shaft, nomi-\nnally a centimeter in diameter, and measuring the\napplied force and the relative displacement of two\npoints on the surface of the shaft in-line with its axis.\nAs the load P increases from zero on up until the\nspecimen breaks, the relative distance between the\ntwo points increases from L0 to some final length\njust before separation. The graph at the right indi-\ncates the trace of data points one might obtain for\nload P versus ∆ where\nIf we double the cross-sectional area, A, we expect to have to double the load to obtain the same\nchange in length of the two points on the surface. That indeed is the case. Thus, we can extend\nour results obtained from a single test on a specimen of cross sectional area A and length L0 to\nanother specimen of the same length but different area if we plot the ratio of load to area, the ten-\nsile stress, in place of P.\nSimilarly, if, instead of plotting the change in length, ∆, of the two points, we plot the stress against\nthe ratio of the change in length to the original length between the two points our results will be\napplicable to specimens of varying length. The ratio of change in length to original length is called\nthe extensional strain. We designate the tensile stress by σ and the extensional strain by ε. The\ntensile stress is defined as\nand the extensional strain by.\nThe figure below left shows the results of a test of 1020, Cold Rolled Steel. Stress, σ is plotted ver-\nsus strain ε. The figure below right shows an abstract representation of the stress-strain behavior\nas elastic, perfectly plastic material.\nObserve:\n1. Standard tests for material properties, for failure stress levels, and the like are well documented in\nthe American Society for Testing Materials, ASTM, publications. Go there for the description of how to conduct\na tensile test.\nLo\nL\nP\nP\nA\n∆\nP\n∆\nL\nLo\n-\n=\nσ\nP A\n⁄\n≡\nε\n∆Lo\n⁄\n≡\nε = ∆/Lo\nσ = P/A\n0.002\n600MN/m2\nε\nσ\nσY\nE\n\nFall 2003\nSeptember 30, 2003\n- The plot shows a region where the stress is proportional to the strain. The linear\nrelation which holds within this region is written\nwhere E is the elastic, or Young's modulus.\n- The behavior of the bar in this region is called elastic. Elastic means that when\nthe load is removed, the bar returns to its original, undeformed configura-\ntion. That is L returns to L0. There is no permanent set.\n- The relative displacements of points -- the strains in the elastic region -- are\nvery small, generally insensible without instruments to amplify their magnitude. To\n\"see\" a relative displacement of two points originally 100 mm apart when the\nstress is on the order of 400 Mega Newtons/m2 your eyes would have to be capa-\nble of resolving a relative displacement of the two points of 0.2 mm! Strains in\nmost structural materials are on the order of tenths of a percent at most.\n- At some stress level, the bar does not return to its undeformed shape after\nremoving the load. This stress level is called the yield strength. The yield strength\ndefines the limit of elastic behavior; beyond the yield point the material behaves\nplastically. In the graphs above, we show the yield strength defined at a 2% offset,\nthat is, as the intersection of the experimentally obtained stress-strain curve with a\nstraight line of slope, E, intersecting the strain axis at a strain of 0.002. Its value is\napproximately 600 MN/m2.\n- Loading of the bar beyond the yield strength engenders very large relative dis-\nplacements for relatively small further increments in the stress, σ.\nA solid bar as a linear spring.\nFor a linear spring, we write\nwhere k is\nthe spring stiffness and has the dimensions force per\nlength.\nWe can treat our solid bar, subject to uniaxial tension,\nas a linear spring if we substitute for the strain, its rep-\nresentation in terms of ∆ and L (drop the subscript 0),\nand for the stress, its representation in terms of F and\nA, the cross-sectional area. We obtain:\nσ\nE ε\n⋅\n=\nF\n∆\nk\n∆\nF\nF\nk ∆\n⋅\n=\nF\nAE L\n⁄\n(\n) ∆\n⋅\nk ∆\n⋅\n=\n=\n\nFall 2003\nSeptember 30, 2003\nTwo linear springs in series ~ a tensile test specimen + elastic test machine.\nIf we join two linear springs of different stiffness in series, we\ncan, using the principles of solid mechanics, determine the\nequivalent stiffness of the combination.\nFrom equilibrium considerations, the force in each of the\nsprings is the same, F. Their extensions, ∆1 and ∆2, are dif-\nferent; from the constitutive equations, we have\nAnd compatibility of deformation requires\nFrom all of this we derive an expression for the equivalent system of the whole system, namely\nk1\nk2\n∆1\n∆\n∆2 (Not shown)\nF\n∆2\nF k2\n⁄\n=\nand\n∆1\nF k1\n⁄\n=\n∆\n∆1\n∆2\n+\n=\nF\nK\n∆\n⋅\n=\nwhere\nK\nk1 k2\n⋅\nk1\nk2\n+\n----------------\nk2\nk2 k1\n⁄\n+\n(\n)\n----------------------------\n=\n="
    },
    {
      "category": "Resource",
      "title": "pasta_03.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-105-solid-mechanics-laboratory-fall-2003/0d5bf5fff0c4fd9c3ce528bb8d25fd6c_pasta_03.pdf",
      "content": "The Bending Strength of Pasta\n1.105\nLab #1\nLouis L. Bucciarelli\n9 September, 2003\nLab Partners:\n[Name1]\n[Name2]\nData File: Tgroup3.txt\nOn the cover page, include your name, the names of your lab partners, the name of\nthe data file which you will email (or have emailed) to me - [See Important Note on\npage 7] - the date the lab was performed, any other information you think\nbelongs on a cover page.\n.\nThe Bending Strength of Pasta\nSeptember 9, 2003\n\n1.0 Summary\nThe objective of this experiment is to determine the ultimate strength of spaghetti in bend\ning as defined by the maximum strain a strand can endure. We also (were meant to) learn\nabout the \"propagation of uncertainty\", i.e., how uncertainty in the measurements we\nmake propagate through and give us estimates of uncertainty in the value of the maximum\nstrain.\nThe experimental determination of the maximum strain a strand can endure draws upon\nthe theory describing the large deflections of an elastic lamina; a strand of spaghetti can be\nconsidered as such. ...\nThe procedure was (is) simple; the loading of the strand was (is) done \"by hand\". The\nmid-span deflection of the strand at failure was (is) measured by the naked eye. This mea\nsure and our measure of the original length was(is) all that was(is) needed, together with\nthe theory, to predict the minimum radius of curvature of the strand at failure. To compute\nthe strain, we also needed (need) to .....\nOur data shows that the maximum strain a strand of pasta can endure is ..... +/- ......\nIn this summary of your report you state your objectives, present an overview of\nprocedure, and describe the main results you obtained, using words alone. You\ncan include numerical results but only for the most significant variables. This is\nbest kept to a paragraph or two.\nThe Bending Strength of Pasta\nSeptember 9, 2003\n\n2.0 Introduction\nSpaghetti is not usually considered a structural material. People eat spaghetti; they don't\nuse it to build bridges or space robots. But pasta to a person responsible for its production,\npackaging and distribution might very well be concerned with when a single strand might\nfail. No one wants their spaghetti but two inches long. Optimum twirling requires at least\n20 centimeters of uniform length.\nFor a long, slender, uniform structural member, failure is generally due to bending. Know\ning what strain -- as measured by the ratio of the radius of the member to the deformed\ncurvature of its centerline -- can be tolerated is essential to controlling and avoiding fail\nure.\nEuler's 18th century analysis of the large deflections of an elastic lamina - the elastica\nwill provide the basis for a determination of the maximum extensional strain at fracture. It\nis not clear whether Euler himself addressed this particular phenomenon, that is, whether\nhe put spaghetti to the test, but certainly he must have consumed a pound or two.\nIn the Introduction, describe the motivations for the experiment. If the experiment,\nhas a theoretical basis, give the reader enough of a description of the theory so\nthat they can locate the experiment within that framework. (You can refer to the\nAppendix about the \"Elastica\"- the pdf file which you can append).\nIt is very important that you have in mind your audience. The general instructions\nfor 1.105 describe for whom you are writing the report - a fellow student who has\nnot yet done the experiment but will do so in the near future. In the \"real\" world,\nsome audiences will be more knowledgeable than others. Hence your report may\nnot need to be as detailed nor as lengthy as it would be were you writing for some\none less experienced in the study of the engineering mechanics of structures. Of\ncourse the \"real\" audience is the professor, but you get the idea.\nThe Bending Strength of Pasta\nSeptember 9, 2003\n\n3.0 Experimental Method\nHere you describe your experimental method. While you can not possibly describe\neverything you did, you should provide sufficient information so that a knowlege\nable reader, e.g., a fellow student in Course 1C, could make an attempt at repeat\ning what you did, and do so with some reasonable chance of success.\nTo determine the ultimate strain in bending, we use the following procedure: A single\nstrand is placed on a sheet of linear graph paper with scale of appropriate resolution\n(1mm). The noodle is aligned with one of the heavy, longer lines. (See Fig. 3.1)\nInclude a figure, hand drawn is fine, which shows the original and deflected state\nof the speciman, atop the graph paper. This figure should be something like the\none in the Appendix.\nEqual and opposite loads are applied to the ends of the specimen, holding one end fixed\nagainst a stop cemented to the paper and applying a force, directed perpendicular to the\nsupport, at the other end. The strand, if of sufficient length, will deflect transversely.\nBefore loading, the diameter and length of straight strand are measured. Then measure\nments of the horizontal distance, s, between the ends and the corresponding vertical dis\nplacement, h, are made just prior to fracture.\nTwo different kinds of pasta are tested in the order below:\n- Prince Spaghetti\n- Prince Thin Spaghetti1\nThe sequence of test for each kind of pasta is as follows:\n-First, measurement of the diameter of the kind is made. Take several mea\nsurements i) on a single strand, ii) of several strands of the kind. An esti\nmate of uncertainty, as well as the diameter, is recorded.\n-A full-length strand is loaded to failure, h and s recorded at the instant just\nprior to failure.\n-The strand ordinarily breaks into two pieces of roughly the same length.\nThe biggest of the two is then loaded to failure and measurements of h and\ns at fracture recorded. (Do not forget to measure the original length of the\nhalf strand).\n-A second, full-length strand is next... and so on through 10 to 20 speci\nmens.\n-Estimates of uncertainty in measuring the original length L, and h and s at\nfailure are made and recorded.\n1. Note: Your types of spaghetti may differ from these.\nThe Bending Strength of Pasta\nSeptember 9, 2003\n\nAll data is recorded in the quadrille composition book, or equivalent lab notebook.\nAllow one page for each kind of spaghetti, making a table of 9 columns. The first\nfour columns are for\n1) the Specimen # ,\n2) its original Length L,\n3) the deflected height, h, and\n4) deflected span, s; the latter two are the values measure at fracture.\nThe next two columns - namely\n5) h/L,\n6) R/L, are for computations required in order to compute\n7) the corresponding strain values at failure.\nInclude also columns for\n8) the measured ratio s/L at failure and\n9) the \"theoretical value\" obtained from the graph.\nTABLE 1. Data Sheet Format - included in an Appendix\nSpc\n#\nLength, L\nHeight, h\nSpan, s\nh/L\nR/L\ne|max\ns/L\nmm\nmm\nmm\nmeasd.\ngraph\n+/\nmm\n+/\nmm +/\nmm +/\n+/\n+/\n+/\nYou should carry a few of these computations through in the lab period, to see that\nyou are on the right track, but completion of the table can be left for later.\nPhotocopy your data from your lab notebook and include in an appendix. Show\nalso in the appendix, sample calculations of the failure strain, s/L ratio, etc.\nNote: You may have the resources to enter the raw data directly into a laptop. In\nwhich case, make sure your lab partners obtain the data file as well as soon after\nlab as possible. Include a print out of the data in the above format in your lab\nnotebook and in an appendix to your report.\nThe Bending Strength of Pasta\nSeptember 9, 2003\n\n4.0 Results\nUsing the theoretical relationships for the shape of the elastica, provided in the Appendix,\nwe determined a set of values for the ultimate strain in bending for different length speci\nmens. The original data and calculations leading to values of strain at failure are included\nin Appendix yy..\nHere you present your results. Most times this will include graphs and tables. Do\nnot include your raw data here. Detailed data reduction and uncertainty calcula\ntions, with accompanying explanation, belong in the appendix with your raw\ndata.. But here you may briefly summarize in words the relationships you used to\ndetermine the strain at failure.\nInclude histograms showing the frequency distributions for the different kinds of\nspaghetti. If you hand draw these, photocopy the original, reducing them if you\nlike, cut out and paste or tape to the page in this section. Otherwise use a spread\nsheet and plot from there (or your TI calculator, or whatever technology you have\navailable to make and print out a graph)..\nMake sure you say something about the these results - e.g., the differences in fail\nure strain for different types of spaghetti. Do the experiments verify the theory?\nHow did the measured ratio of span to length compare with the theoretical? You\nwant to explain likely sources of uncertainty and scatter. Is the spread in results\nexplained by the uncertainties in making measurements?\nThe Bending Strength of Pasta\nSeptember 9, 2003\n\n5.0 Conclusions & Recommendations\nSpaghetti fails at a strain of xxx +/- yy in bending. ...\nWe recommend further experiments to\n-Determine the effect, if any, of variations in composition from one type of\nnoodle to another, one manufacturer to another.\n-...\nA final summary of the main result goes here along with recommendations for further\nwork.\nAll Important Note:\nEach group is to produce a text file -\"Tgroup[n].txt\" or \"Rgroup[n].txt\" where T is for\nTuesday and R is for Thursday and n is your group number - of your raw data which\nincludes two header lines:\n-The first gives the kind of sphagetti and your group id\n- the second gives the diameter in millimeters and the number of samples\nThen follows the raw data of the first four columns of your data sheet: i.e., Speciman #,\nOriginal Length, L, height h at failure and span s at failure.\nAll dimensions to be in mm.\nThin Sphagetti Group 3\nDiameter = x.x mm\nN=30\n3 etc\nEach group should email me their text file.\nThe Bending Strength of Pasta\nSeptember 9, 2003\n\n6.0 Appendix - The Elastica\n6.1 General Remarks\nAn elastic lamina is a slender element,\nuniform in its geometric and physical\nproperties along its length, - e.g., a long\nrod, or beam- and capable of supporting a\ncompressive or a tensile load. When sub\nject to an axial compressive force, if the\nlength is sufficiently long, the lamina will\nbend out of line as shown in the figure.\nAn analysis of equilibrium and deforma\ntion of the lamina, based upon the princi\nples of Solid Mechanics, produces an\nordinary, but nonlinear differential equa\ntion whose solution describes the geome\ntry of the deformed lamina. We present here only the essential results of the analysis; we\ndefer a more complete presentation until later in the subject. The solution yields expres\nsions for the height h and the span s in terms of two parameters, one related to the slope at\nthe ends\nh\nL\ns\nP\nR\nP\nα\nThe Elastica, deformed.\n(1)\nk ≡ sin (α ⁄ 2)\nwhich is dimensionless, and a second related to the applied force\nP and the bending stiffness, EI1 .\n(2)\nc ≡ EI\n\n⁄ P which has the dimensions of length. The solution gives:\nk\nk\n(3a)\ns = 2c ⋅[2 ⋅ F1( ) - F2( )]\n(3b)\nh = 2ck\n(3c)\nL = 2c F2( )\n⋅\nk\n(3d)\n= c ⁄ h = h ⁄ (4k2 )\nRmin\nRmin in the above is the minimum radius of curvature which occurs at mid-span. L is the\noriginal straight length of the lamina.\nIn these, F1(k) and F2(k) are functions of the parameter k alone and are defined by the fol\nlowing two, definite, so called \"elliptic integrals\". Values of F1 and F2 for a range of val-\nπ ⁄ 2\nπ ⁄ 2\n⁄\nk\nk\n⁄ [\n⁄\nF1( ) ≡∫[1 - k2 ⋅ sin z 2 ]\n1 2 z\nd\nand\nF2( ) ≡∫(1\n1 - k2 ⋅ sin z 2 ]\n1 2) z\nd\n1. of which we will learn more later on in the subject.\nThe Bending Strength of Pasta\nSeptember 9, 2003\n\nues of k have been computed and are available from almost any book of mathematical\ntables.\nIn our experiment, we want the maximum strain the lamina can withstand before fracture.\nThe strain is a function of the radius of the lamina and the radius of curvature. It is\nproportional to the former and inversely proportional to thelatter.1 Hence the maximum\nstrain occurs where the radius of curvature is a minimum, i.e.,\nε\n⁄\n= r Rmin\nmax\nSo, to determine the maximum strain in bending we need to measure the radius (diameter)\nof the lamina and determine the minimum radius of curvature from equation (3d). This,\nmeans we need to know\ni) the value of k and\nii) the value of h.\nThe value of h is measured in the experiment. In the next section, we show how to deter\nmine the value of k.\n6.2 The Elastica - Useful Results\nIn the lab experiment, we measure the span, s, the mid-span height, h, at fracture. We mea\nsure the original straight length, L, before applying the end loads. From equations (3b) and\n(3c) on the previous page we can eliminate c, which remains an unknown, and write\nk\n(4a)\nk = (h ⁄ L) ⋅ F2( )\nI have found the roots of this expression for a range of values of (h/L); think, of k as a\nfunction of h/L. (Note: I do not show what this relationship looks like). With these values\nof k for a given ratio (h/L), the above relationship for the radius of curvature may be\nrewritten, normalizing with respect to L:\n⁄\n(4b)\nR L = -----------\n⁄\nh L\n4 ⋅ k2\nSo measuring and knowing h/L then fixes k and the ratio R/L, hence the radius of curva\nture. Having measure the radius of the strand we also can compute the maximum strain\ndue to bending.\nFrom equations (3a) and (3b), we can also write an expression for the span, again normal\nF1( )\nk\nized with respect to L.\n(4c)\n(s L) = 2 ⋅ --------------\n-\n⁄\nF2( )\nk\n1. Again, this is the subject of a later part of our course, that devoted to the analysis of the bending of beams.\nThe Bending Strength of Pasta\nSeptember 9, 2003\n\nAgain, once having a value of k, for some h/L, we can compute, or obtain from the tables,\nthe definite integrals F1(k) and F2(k) and so compute the span. This will serve as a check\nsince we independently have measured and recorded s at fracture.\nPlots of (s/L) and (R/L) as a function of (h/L), determined in accord with the above rela\ntionships are shown below. It is this plot you will use to directly obtain values for the two\nratios s/L and R/L having measured h and L.\nh/L\nh\nL\ns\nF\nF\nR\ns/L & R/L\ns/L\nR/L\ns/L & R/L versus h/L\nThe Elastica, deformed.\nThe Bending Strength of Pasta\nSeptember 9, 2003"
    },
    {
      "category": "Resource",
      "title": "pasta03_uncertainty.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-105-solid-mechanics-laboratory-fall-2003/74bad2d2b61a948282ebf4a1e8061a8d_pasta03_uncertainty.pdf",
      "content": "1.0 Appendix - Dealing with Uncertainty\n1.1 Theory\nIn making measurements, in doing experiments to evaluate the behavior of a structure, or\nmore simply to determine the value of a property, the instruments we use, whether unaided\neyesight or laser interferometer, have a limited resolution. There will always be some\nuncertainty in the measured value which is on the order of the fineness of scale. When we\nmake a measurement, we should record an estimate of the associated uncertainty. This is\npart and parcel of a value, as inseparable as the measured quantity's units.\nWe might indicate the uncertainty in the Data Sheet below, as in your Pasta report, in the\nthird row as +/- ?? mm and the units of the column quantity in the second row.:\nTABLE 1. Data Sheet Format\nSpc\n#\nLength, L\nHeight, h\nSpan, s\nh/L\nR/L\ne|max\ns/L\nmm\nmm\nmm\nmeasd.\ngraph\n+/- ? mm\n+/-\n? mm\n+/-\n?mm\n+/-\n+/-\n+/-\n+/-\nThe question marks are to be filled in by the one(s) taking the measurement. Generally one\nestimates an uncertainty as one number, to be representative of a whole set of specimans\nsubject to that measurement. For example, for the long strands, after measuring the\nlengths of several, make an estimate of uncertainty. That one number goes at the top of the\ncolumn, replacing the questionmark. (You may want to record another estimate for the\nshort specimans).\nUltimately we want to know the uncertainty in the quantity we seek to determine - the\nstrain at fracture. The question then can be put: How do all the uncertainties of these indi\nvidual, measurements combine and affect the uncertainty in the bending strain? Alterna\ntively, and more in line with the lingo of the trade: How do these uncertainties propagate\nthrough to final result?\nConsider a first step in moving from the measured values to the value for the ratio h/L.\nGiven the measurements of L and h and associated estimates of uncertainties, call them uL\nand uh, what is the uncertainty in the ratio, h/L, or uh/l?\nSeptember 15, 2003\n\nWe proceed as follows: For any group of specimans of like kind - e.g., plain spaghetti\nstrands in their long, original state - we expect the measurements of length L and of the\ndeflected height h to show only small variations in the neighbohood of some nominal val\nues, Ln hn. In this case, the value of the change in the quantity (h/L) can be aproximated,\nusing a Taylor expansion, by\n∂ f\n∂ f\n∆(h L) = ⎛\n⎞⋅∆L + ⎛\n⎞⋅∆h\n⁄\n⎝\n⎠\n\n⎝\n⎠\n∂L\n∂h\n⁄\n⁄\n∆(h L)= (-h L2 ) ⋅∆L + (1 ⁄ L) ⋅∆h\nConsider, for a moment, how one estimates the mean and variance of a linear function of\ntwo random variables.1 If Y depends upon X1 and X2 according to\nY = a1 ⋅ X1 + a2 ⋅ X2\nthen the mean, or expected value of Y, computed according to\nn\nY = -- ⋅∑ Y i = E Y\n( )\nn\ni = 1\nis a linear function of the means of the variables X1 and X2. If we now interpret our small\nchanges in h and L as random variables, of zero mean, i.e., in the notation of the equation\n⁄\n⁄\nimmediately above:\n∆(h L)= (-h L2 ) ⋅∆L + (1 ⁄ L) ⋅∆h\nWith\n∆L = 0 and\n∆h = 0\nthen the mean of ∆(h/L) is also zero. In this case ,\nwe must push further to obtain an uncertainty estimate for the latter. We will use the vari\nance.\nReturning to our general case, the variance of Y is given by:\n( ) = E Y\nVar Y\n(\n)\n\n- Y\nVar Y\n(\n(\n(\n,\n)\n( ) = a1\n2 ⋅ Var X1 ) + a2 ⋅ Var X2 ) + 2a1a2 ⋅ Cov X1 X2\nIn this, the covariance of X1 and X2 is computed according to\nCov X1 X2\n[(\n(\n,\n) = E\nX1 - X1 ) ⋅( X2 - X2 )]\nNow if X1 and X2 are independent random variables, (as are the measurements h and L,\ni.e., we would not expect our measurement of h to be influenced by our measurement of L,\n1. Ang, A., Tang, Wilson, Probability Concepts in Engineering Planning and Design, Vol. I, John Wiley and\nSons, New York, 1975, p191 ff.\nSeptember 15, 2003\n\nassuming we are working with one set of specimans), then the covariance is zero and the\nlast term vanishes from the expression for the variance.\nWe now make a crucial step: We associate (or define, if you like) the uncertainty in an\nexperimental value with its variance. In this way we can write:\n⁄\nVar(∆(h L)) = a1\n2 ⋅ Var(∆L) + a2 ⋅ Var(∆h)\nor\nuh L\n⁄\n⁄\n= (h L2 )\n2 ⋅ uL + (1 ⁄ L)2 ⋅ uh\nwhere we have equated the uncertainties to the variances and, from our expression for the\nlinear sum, identified\n⁄\na1 = (-h L2 )\nand\na2 = (1 ⁄ L)\nThe above gives us a way to compute the uncertainty in the ratio h/L having (independent)\nestimates of the uncertainties of h and L, uh and uL\nIn general, if Y is a function of X1, X2,....Xn, and the X's are all independent, we can\nwrite:\n⎛∂Y ⎞\n⎛∂Y\n⎛∂Y ⎞\n⋅ u1 + ⎝∂ X2⎠⋅ u2........+⎝∂ X ⎠\n⎞ ⋅ u n\nuY = ⎝∂ X1⎠\nn\n1.2 Example: Two Resistors in Parallel\nTaking an example from electrical cir\ncuits (we will be building some when\nwe use strain gages), consider two resis\ntors in parallel. Without too much loss\nin generality, we take them to be equal,\nsay 10 kilo-ohms each.\nAn estimate of the uncertainty in the\neffective resistance R where\nR2\nR2\nR= R1*R2/(R1+R2\n= 10 kohm\n= 10 kohm\n) = 5 Kohm\nSeptember 15, 2003\n\nR = ------ + -----\nR1\nR2\nis, after taking the partial derivatives, and noting they\nor\nR = (R1 ⋅ R2) ⁄ (R1 + R2 )\n⎞\n⎞\n⎛\nR2\n⎛\nR1\nare squared:\nu R = ------------------\n⋅ u2\n+\n------------------\n⋅ u2\n⎝ R1 + R2⎠\n⎝ R1 + R2⎠\nIf R1 = R2, this simplifies and can be written as; (check it out): (uR ⁄ R) = ------- ⋅(u1 ⁄ R1 )\nThis says that the uncertainty in the effective resistance, of the two in parallel is less than\nthe uncertainty (expressed as a percentage) of either of the two taken alone! Can you\nexplain this, perhaps counter-intuitive result?\n1.3 Example: Propagation of Uncertainty with Pasta.\nWe consider, as an example, estimating the uncertainty in the bending strain at failure of\nthe thickest pasta and only the case where the length is the original length. Our goal is to\nsee how uncertainties in the measured values of L, h, and r, (actually 2r, the diameter),\npropagate through to produce an uncertainty in the bending strain, ε. We can then see if\nthis brackets the results obtained from experiment on the 15 specimen. If so, then we have\nsome confidence that our theory of failure is correct and that we have not overlooked some\nimportant factor - in the physical composition and behavior of the pasta and/or in our mea\nsurement technique that might explain a broader range of values of ε.\n2r\nh\ns\nL\nTo determine the maximum bending strain at\nfailure, we first make several measurements of\nthe diameter, d, along a single strand to check\nits uniformity and across several different-\nstrands. This produces, not just a nominal\nvalue for the diameter, e.g., 1.9 mm, but also a\nvalue for the associated uncertainty1, e.g.,\n0.1mm.\n1.3.1 Setting Uncertainties of Measured Values.\nFor each of the 15 strands tested, we measured the original length L, e.g., 240.0 mm, and\nestimated an associated uncertainty, e.g., 1mm. [Note: Strands of different length, L, of the same\nradius, will fail at different heights, h. But theory states that the radius of curvature should be the same,\n1. The uncertainty in this instance may be taken as, not just the uncertainty due to the limited resolution of\nthe calipers and our imperfect interpolation capabilities, but also the variability in diameter from speci\nmen to specimen. In a more detailed experiment we might be required to pin down more precisely the\ncharacteristics of the distribution of the diameter (radius) considered as a random variable.\nSeptember 15, 2003\n\nacross all specimens. The uncertainty in this instance should not include the variation in original length. If,\nafter analyzing the outcome of the experiments on the shorter strands of the same radius, we find our propa\ngated uncertainty does not bracket the range of ε, we can conjecture that length does matter in some way and\nlook for a physical or experimental reason why].\nApplying the end load, we carefully noted the height, h, e.g., 40 mm, and span, s, e.g., 220\nmm, just prior to fracture. After several trials, we made estimates of their associated\nuncertainties, e.g., +/- 2 mm and +/- 2 mm respectively.\nSummarizing, letting the bold represent nominal values (later to be replaced by mean val\nues), we write1\nd = d + ud = 1.9 +/- 0.1 mm\nL = L + uL = 240 +/- 1.0 mm\nh = h + uh = 40 +/- 2.0 mm\ns = s + us = 220 +/- 2.0 mm\n1.3.2 Propagation of Uncertainties.\nAs the simplest example of \"propagation of uncertainty\" consider how we obtain the\nuncertainty in the radius once having estimated the uncertainty associated with our mea\nsurement of the diameter. The radius is linearly related to the diameter; it's just one-half\nthe diameter. Our variance of the radius is then given in terms of the variance of the diam\neter by 2\nVar(r) = (1/2)2 Var(d)\nor, since we interpret the variance as the square of the uncertainty, we have ur = (1/2) ud ,\nand so\nr = r + ur = 0.95 +/- 0.05 mm.\nThis, at first sight, appears strange, i.e., we have a smaller uncertainty in the radius than\nthe diameter. But note that the uncertainty relative to the nominal value is the same, for\nur/r = ud/d =.05/.95 (or 1.0/1.95) = .053 = 5.3%\nRepresenting uncertainties as percentages of their nominal values will be pursued in what\nfollows.\nRecall the process for finding the strain: For each specimen, we compute the ratio of the\nheight, h, at failure to the original length, L. With a value in hand for this ratio, we go to\nthe graph and determine a value for the ratio of the radius of curvature at mid span, R, to\n1. The nominal values are, to a certain extent, artificial; the estimates of uncertainty more real.\n2. There is nothing approximate about this relationship in this instance since the relationship between diam\neter and radius is linear.\nSeptember 15, 2003\n\n-----\nthe original length. Knowing L, we can determine R. Knowing R and the radius, r, we can\ndetermine the strain.\nOur propagation of uncertainty follows this same route. As a first step we determine an\nuncertainty to associate with the ratio (h/L).\nWe have from before:\n⎛\n⎞2\n⎛⎞2\n1 2\nh\n⁄\nuh L\n⎝\n⎠\n\n--L\n⁄\n=\n------\n⋅uL + ⎝⎠⋅uh\nL2\nDividing both sides by (h/L) we can write this in terms of uncertainties relative to the\nnominal values of their associated quantities.\nuh L\nuL 2\nuh 2 1 2\n⁄\n⎛\n⎞\n⁄\n---------------- = ⎛\n⎞+ ----\n(h L)\n⎝\n⎠\n⎝\n⎠\n⁄\nL\nh\nWith\nuL/L = 1/240 = .0042\n(note: less than 1%),\nand\nuh/h = 2/40 = .050 (5.0%)\nwe obtain\nuh L\n\n⁄\n---------------- = 0.0502\n(5%)\n(h L)\n⁄\n(Note how the uncertainty in h predominates relative to the uncertainty in L).\nWith the ratio of the nominal values (h/L) = 40/240 = 0.167, the uncertainty of the ratio\nitself is\nuh/L = 0.0084\nNext, we propagate this measure through to an uncertainty of R/L using the graph. To do\nso, think of the plot of R/L versus h/L as a one-to-one functional relationship, which it is,\nto which we can fit a linear approximation in the vicinity of h/L = 0.167 by graphical\nmeans.\nSeptember 15, 2003\n\nThis I have done, drawing a line tangent to the curve at this point.\nh/L\nR/L\ns/L\nR/L\n1.18\n0.322\n0.167\n0,569\nWe have, as a linear approximation,\nR/L = 1.18 - (1.18/.322)* (h/L) = 1.18 - 3.66(h/L)\nInterpreting the square of the uncertainty as the variance and noting that\n∂\nh L\n⁄\n(\n)\n∂\nR L\n⁄\n(\n) = 3.66\n-\nwe have\nuR L\n⁄\n=\n3.66\n(\n)2\n[\n⋅ uh L\n⁄\n(\n)2 ]\n1 2\n⁄\n= 0.0307\nand with\nR/L = .568,\nuR/L / (R/L) = .054\n(5.4%)\nI suggest another uncertainty associated with reading the graph. Think of the ordinate\nscale as a measuring stick. Its resolution is .05. There is some additional uncertainty in fix\ning R/L due to inaccurate readings of the scale, e.g., +/- 0.02. How to account for this?\nSeptember 15, 2003\n\n-----\nOne way is to think of the intercept of our linear approximation as being another indepen\ndent random variable, z, (or if you like, it bounces up and down from one reading to\nanother). Write\nR/L = z - 3.66(h/L) where\nz = z + uz = 1.18 +/- 0.02\nThen our estimate of uncertainty in R/L becomes, according to our consideration of vari\nance of the sum of two random variables,1\n2 1 2\nuR L = [1 ⋅u 2 + (3.66) ⋅uh L ]\n⁄\n= 0.0367\n⁄\nz\n⁄\nuR L\n⁄\nSo ---------------- = 0.0645\n( 6.5%)\n(R L)\n⁄\nTo find the uncertainty in the strain, which is our goal, we need to take this process one\nstep further. Writing\nε = r/R = (r/L) / (R/L)\nwe have for the uncertainty in the strain:\n2 1 2\n⁄\n⁄\n⁄\nuε\n⎛ur L⎞\n+ ⎛uR L⎞\n----- =\n----------\n-----------\nε\n⎝r L⎠\n⎝R L⎠\n⁄\n⁄\nso we need one additional bit of information, namely\nur L\nu\nuL 2 1 2\n⁄\nr\n⎛\n⎞\n⁄\n---------- = ⎛\n⎞+ -----\nr L\n⎝\n⎠\n⎝\n⎠\n⁄\nr\nL\nwhich with\nr= r + ur = 0.95 +/- .05 mm and L = L + uL = 240 +/- 1mm\ngives\nur L\n⁄\n---------- = 0.053 (5.3%)\nr L\n⁄\nWith this, and our already determined uncertainty for R/L, our final result of this propaga\ntion of uncertainties gives\nue/ε = 0.084 (8.4%)\nwhich, with our nominal value of strain\nε = r/R = 0.95/136.5 = 6.96 E-03\nwhich says that our values should lie within the range 6.4E-03 to 7.6 E-03.\n1. Note we can not express this in terms of relative values so neatly.\nSeptember 15, 2003"
    },
    {
      "category": "Resource",
      "title": "exp4_03.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-105-solid-mechanics-laboratory-fall-2003/de47fb896118d41132a5d00f2fe351d8_exp4_03.pdf",
      "content": "1.105 Solid Mechanics Laboratory\nFall 2003\nExperiment 4\nThe linear, elastic behavior of a Truss.\nThe objectives of this experiment are\n-\nTo study the linear elastic behavior of a truss structure; to measure the struc-\nture's stiffness at two nodes.\n-\nTo compare measurement with theoretical prediction; in particular, to explore\nhow behavior deviates from a frictionless pinned structure.\n-\nTo introduce the strain gage, the bridge circuit and its function, the op amp\nand its necessity, and the sensitivity of the instrumentation to temperature drift\nand other \"disturbances\".\nThe truss shown will be supported at its four corners and loaded at mid span. Two dial gages will\nbe used to measure nodal displacements in the vertical direction. The strain gage instrumentation\nwill measure the strain, and hence the load, in one member of the truss.\n.\na\nb\nc\nd\ne\nf\ng\nh\ni\nExperiment Procedure\nMeasure all relevant dimensions of the structure. In this, envison the joints as frictionless pins\nlocated at the intersections of the members.\nMake sure the structures rests on all four support points. Adjust one of the adjustment screws at\nthe four corners if necessary to eliminate rocking.\nThe bucket should be suspended by an S hook slung on the chain and centering mechanism\nbelow the mid span nodes. Load the bucket up to, but do not exceed, 60 lbs.\nMake sure you include a stop to limit excessive vertical displacement at the mid span nodes in\ncase a member or joint fails. This should not be the case but we want to make sure we do not ren\nder the truss unusuable in the future.\n1.105 Solid Mechanics Laboratory\nOctober 16, 2003\n\nYou will make two runs with the truss loaded at the center nodes. The figure shows the\ntest set-up.\nRuns 1 & 2\nstrain gages\n(or on member 3-4)\nInstrumentation Preparation\nDial Gages\nTwo dial gages should be positioned to measure the vertical displacement of the two mid span\nnodes. Make sure the stands which support the gages are held fast against the bench by loading\ndown their bases with the weights provided.\nDo not try to zero the gage. Record your initial, no load (with bucket and chain attached) reading\nthen, as you load, the subsequent readings. Leave the calculation of actual nodal displacements\nto later.\nStrain gage/op amp\nThe measurement of the strain - hence the stress, hence the load - in a member is done using a\nstrain gage - a physically small foil, electrical resistance fixed firmly to the member. As the mem\nber stretches (or contracts) the resistance increases (or decreases) a small amount. Actually two\ngages are used on one member to double the sensitivity.\nAn appendix describes the \"bridge circuit\" used to obtain a millivolt signal for a change in resis\ntance of .01% and less!\nStill the signal must be amplified. The circuit includes then an \"op-amp\" with a gain which you will\nmeasure.\nThe figure below shows the layout of the components, including the strain gage input terminals ,\nthe power supply input terminals, the (internal) bridge output points, and the op-amp output lead\nFall 2003\nOctober 16, 2003\n\nwire. A variable resistance, a potentionmeter for \"balancing\" the strain gage bridge is found lower\nop-amp\npot\namp\npot\n+10 v\nV+\n+10 v\n-10 v\ninput\ninput\ne1\ne2\neo op amp output\nbridge\nV bridge supply\nop amp supply\nV- op amp supply\nstrain gage\nstrain gage\n(bridge output)\nright; another for nulling the amplifier output is just to the right.\nWith the power supply disconnected, set the output of the +20v supply to positive one ( +1) volt,\nor some small amount. The -20v supply output terminal should then read minus one volt.\nConnect the strain gage leads to the input terminals on the circuit board. The polarity doesn't mat\nter nor does it matter which gage you connect to the top two terminals, which to the bottom two.\nTurn the power supply off and connect the positive 20v supply terminal to both the V+ op amp\nsupply and the V bridge supply. Use a short jumper wire at the circuit board input terminals to\navoid stringing two leads.\nConnect the \"common\" terminal of the power supply to the ground terminal of the circuit board.\nConnect the negative 20v supply terminal to the V- op amp supply terminal on the circuit board.\nCheck that you have the positive 20v supply going to the +10v op amp supply and the negative 20v\nsupply going to the -10v op amp supply.\nTurn on the power supply and adjust the +20v supply to +10 volts. NOTE: If you experience into\nerable drift in bridge output signal due to temperature variations of the bridge resistors, you may\nreduct your supply voltage to reduce current flows, hence, to reduce heat generation ( i2R), hence\nto reduce temperature changes.\nFall 2003\nOctober 16, 2003\n\nConnect the ground of the digital multimeter to the ground on the board. Measure the voltages at\nthe strain gage input terminals. Do they conform to what you expect?\nConnect the digital multi meter to the bridge output terminals and balance the bridge using the\npotentiometer. Make sure you end up on the dc millivolt scale.\nConnect the digital multimeter ground to ground on the board. (Any point will do). Measure the out\nput of the op amp and using the op amp potentiometer, null the output of the amplifier.\nNow generate an input to the op amp by offsetting the balance of the bridge until the output of the\namplifier reads 400 mv. Using the multimeter, measure the output of the bridge and calculate the\ngain of the amplifier. Repeat this several times at different amplifier outputs.\nBalance the bridge.\nCheck op-amp null.\nConnect the digital multimeter to measure op-amp output. You are now ready to load the structure.\nReport\nStart with a one paragraph executive summary of the purpose, the method, the results of the lab\ntests.\nInclude a short section on experiment procedure which, rather than reproduce the steps set out\nabove, describes the method in your own words, making note of any particular difficulties you\nencountered and how you managed to overcome them. Included in this section your op-amp cali\nbration data and your calculation of amplifier gain.\nIn your section on \"results\", you will compare experiment with theory. \"Theory\" includes:\n-\nthe results of a two-dimensional, matrix analysis of the structure, modeled as\na truss. You are to do the truss matrix analysis using Trussworks. Please use the\nnode numbering scheme shown in the figure on page 2, above. See comments\non next page for instructions.\n-\nthe results of a two-dimensional matrix analysis of the structure modeled as a\nspace frame made up of beam elements rigidly connected at the nodes. The\nspace frame matrix analysis is included in an appendix.\n-\nthe results of a fully three dimensional matrix analysis of the structure using\n\"Trussworks 3D\". This analysis is included in the appendix. Note that distances\nwere input 10 times actual (a work-around of a deficiency in the program) but this\nwas compensated for by setting member area to be 10 times actual.\nFall 2003\nOctober 16, 2003\n\nRe: constructing a two-dimensional truss model W\nWe showed in class how we might model the three-dimensional structure as a planar truss. In this,\nwe fix the cross sectional area of the diagonal members, 1,3; 2,3; 4,5; etc. so that the stiffness of\nthe top node, e.g., #3, in the x and y directions, is identical to that of node a in the fully three\ndimensional structure.\nd\na\nb\nc\nf\ng\nh\ni\nj\nx\ny\ne\nIf we let A3d be the Area of the 3D truss members, then for equivalence\nAdiag-2d = 1.089 A3d\nIn the same way we attempt to replicate the stiffness of the bottom members of the 3D structure in\nthe horizontal direction by adjusting the cross sectional area of members 1,2; 2,4; ...etc. We found\nwe should set\n= 2.35 A3d\nAbot-2d\nWith these, you are to carry out a planar analysis of the truss.\nInclude then in your results:\n-\nA plot of load versus deflection for the two runs with the load applied at mid-\nspan. Plot also the linear behavior as determined from theory - e.g., the 3D truss\nanalysis.\n-\nCompute the force in the member bearing the strain gages. (See Appendix)\nCompare this with the value determined from theory.\n-\nA comparison of the two dimensional truss analysis with the two dimensional-\nspace frame analysis.\n-\nA comparison of the two dimensional analysis with the three dimensional\nanalysis.\nIn a \"conclusions\" section, include recommendations for improvement of the experience.\nFall 2003\nOctober 16, 2003\n\nAppendix\nA 2 dimensional model of the 3 dimensional truss.\nIn the lab, we load the truss structure, supported at its ends, at mid-span, and measure the deflec\ntion at a mid-span node (e.g., \"g\" in the figure below). We seek to construct an equivalent two\ndimensional model of the structure to analyze and determine the force-displacement behavior (as\nwell as the forces in the members).\nd\nb\nc\nf\ng\nh\ni\n2a\na\na\ne\n2a\na\nWe need to establish an equivalent stiffness for the pairs of diagonal members joined at the top\nnodes and for the pairs of the bottom members.\nFor the pairs of diagonal members: We replace the two members shown on the left by a single\nmember, inclined at 45o. We adjust this single member's cross-sectional area so that the stiffness\nmatrix relating the two force components, X,Y, to the two displacements, u,v, is the same as in the\nfully three dimensional structure.\n2a\na\na\na\na\n3 a\n⋅\n2 a\n⋅\nX, u\nX, u\nY, v\nY, v\nFall 2003\nOctober 16, 2003\n\nTo get the stiffness matrix, we write out equilibrium, compatibility of deformation, and the constitu\ntive equations, then back substitute and obtain the equilibrium equations in terms of displace\nments.\n2a\na\na\nX, u\nf3\nf2\nt3\nt2\na\nX, u\nf\nt\na\nj\ni\nk\nY, v\nY, v\nThe unit vectors:\nt2 = 1 ⁄ 3 ⋅ i + 1 ⁄ 3 ⋅ j + 1 ⁄ 3 ⋅ k\nt3 = 1 ⁄ 3 ⋅ i + 1 ⁄ 3 ⋅ j 1\n-\n\n⁄ 3 ⋅ k\nt = 1 ⁄ 2 ⋅ i + 1 ⁄ 2 ⋅ j\nSo equilibrium in matrix form gives\nf 2\nf 3\n⋅\nX\nY\n=\nf\n⋅\nX\nY\n=\n3D structure\n2D model\nSo compatibility is:\nδ 2\nδ 3\nu\nv\n⋅\n=\nδ\nu\nv\n⋅\n=\n3D structure\n2D model\nAnd with the force/deformation relations:\nf 2 = k3D ⋅δ 2\nf = k2D δ\n⋅\nf 3 = k3D ⋅δ 3\nFall 2003\nOctober 16, 2003\n\nThe stiffness matrices for the two are:\nu\nv\n⋅\nX\nY\n=\nu\nv\n⋅\nX\nY\n=\nSo, for equivalent stiffness,\n= ??? k3D\nk2D\nand, since the lengths are related by\n= ????? L3D\nL2D\nthe cross-sectional areas must be in the ratio\n= ????? A3D\nA2D\nThe same process is followed to obtain an equivalent stiffness for the bottom, parallel\nmembers (plus the diagonal). Again we show the 3D structure on the left and the 2D model on the\nright.\nY, v\n2a\nX, u\n2a\n2 2 a\n⋅\nX, u\n2a\nWe assume the deformation is such that the shaded members move as rigid bodies and translate\nin the X direction.\nImportant note: To obtain the force in the member instrumented with the strain gages, we must\ncalculate f2 (or f3), of the three dimensional structure in terms of the f of the two-dimensional\nmodel. This will be done in class.\nFall 2003\nOctober 16, 2003\n\nSpace Frame 2D Matrix Analysis\nNODE\nCOORDINATES\nDISPLACEMENTS\nx\ny\nu\nv\nq\nin\nin\nin\nin\nrad\n====== ======== ======== ======= ========\n0.000E+00\n4.000E+00\n-1.148E-03\n0.000E+00\n-1.183E-03\n8.000E+00\n4.000E+00\n-8.605E-04\n-9.150E-03\n-1.008E-03\n4.000E+00\n8.000E+00\n2.695E-03\n-4.719E-03\n-1.030E-03\n1.600E+01\n4.000E+00\n0.000E+00\n-1.445E-02\n0.000E+00\n1.200E+01\n8.000E+00\n1.347E-03\n-1.223E-02\n-5.838E-04\n2.400E+01\n4.000E+00\n8.605E-04\n-9.150E-03\n1.008E-03\n2.000E+01\n8.000E+00\n-1.347E-03\n-1.223E-02\n5.838E-04\n3.200E+01\n4.000E+00\n1.148E-03\n0.000E+00\n1.183E-03\n2.800E+01\n8.000E+00\n-2.695E-03\n-4.719E-03\n1.030E-03\nNODE\nAPPIED LOADS\nREACTIONS\nFall 2003\nOctober 16, 2003\n\nFx\nFy\nMz\nFx\nFy\nMz\nlb\nlb\nlb ft\nlb\nlb\nlb ft\n========\n========\n========\n========\n========\n========\n1 0.000E+00\n0.000E+00\n0.000E+00\n0.000E+00\n3.000E+01\n0.000E+00\n2 0.000E+00\n0.000E+00\n0.000E+00\n0.000E+00\n0.000E+00\n0.000E+00\n3 0.000E+00\n0.000E+00\n0.000E+00\n0.000E+00\n0.000E+00\n0.000E+00\n4 0.000E+00\n-6.000E+01\n0.000E+00\n0.000E+00\n0.000E+00\n0.000E+00\n5 0.000E+00\n0.000E+00\n0.000E+00\n0.000E+00\n0.000E+00\n0.000E+00\n6 0.000E+00\n0.000E+00\n0.000E+00\n0.000E+00\n0.000E+00\n0.000E+00\n7 0.000E+00\n0.000E+00\n0.000E+00\n0.000E+00\n0.000E+00\n0.000E+00\n8 0.000E+00\n0.000E+00\n0.000E+00\n0.000E+00\n3.000E+01\n0.000E+00\n9 0.000E+00\n0.000E+00\n0.000E+00\n0.000E+00\n0.000E+00\n0.000E+00\nMEMBER\nLENGTH\nPROPERTIES\ni-j\nL\nA\nE\nI\nYmax1\nin\nin2\npsi\nin4\nin\n======== ========\n========\n========\n========\n1-2 8.000E+00\n2.883E-02\n2.900E+07\n6.570E-05\n4.782E-02\n1-3 5.657E+00\n1.336E-02\n2.900E+07\n1.418E-05\n3.259E-02\n2-3 5.657E+00\n1.336E-02\n2.900E+07\n1.418E-05\n3.259E-02\n2-4 8.000E+00\n2.883E-02\n2.900E+07\n6.570E-05\n4.782E-02\n2-5 5.657E+00\n1.336E-02\n2.900E+07\n1.418E-05\n3.259E-02\n3-5 8.000E+00\n1.227E-02\n2.900E+07\n1.198E-05\n3.125E-02\n4-5 5.657E+00\n1.336E-02\n2.900E+07\n1.418E-05\n3.259E-02\n4-6 8.000E+00\n2.883E-02\n2.900E+07\n6.570E-05\n4.782E-02\n4-7 5.657E+00\n1.336E-02\n2.900E+07\n1.418E-05\n3.259E-02\n5-7 8.000E+00\n1.227E-02\n2.900E+07\n1.198E-05\n3.125E-02\n6-7 5.657E+00\n1.336E-02\n2.900E+07\n1.418E-05\n3.259E-02\n6-8 8.000E+00\n2.883E-02\n2.900E+07\n6.570E-05\n4.782E-02\n6-9 5.657E+00\n1.336E-02\n2.900E+07\n1.418E-05\n3.259E-02\n7-9 8.000E+00\n1.227E-02\n2.900E+07\n1.198E-05\n3.125E-02\n8-9 5.657E+00\n1.336E-02\n2.900E+07\n1.418E-05\n3.259E-02\n1. These values for Ymax are off by a factor of 2.\nFall 2003\nOctober 16, 2003\n\nMEMBER\nSHEAR\nTENSILE\nBENDING MOMENT\nTENSILE\nMAX BEND\ni-j\nFORCE\nFORCE\nnode i\nnode j\nSTRESS\nSTRESS\nlb\nlb\nlb ft\nlb ft\npsi\npsi\n==== ========\n========\n========\n========\n========\n========\n1-2 -1.715E-02\n2.999E+01\n2.247E-03\n9.190E-03\n1.040E+03\n8.026E+01\n1-3 5.586E-03\n-4.241E+01\n-2.247E-03\n-3.865E-04\n-3.174E+03\n-6.197E+01\n2-3 3.168E-03\n4.239E+01\n-6.171E-04\n-8.762E-04\n3.173E+03\n-2.417E+01\n2-4 -5.673E-02\n8.993E+01\n-1.102E-03\n3.892E-02\n3.119E+03\n3.399E+02\n2-5 2.079E-02\n-4.235E+01\n-7.471E-03\n-2.329E-03\n-3.170E+03\n-2.061E+02\n3-5 -8.628E-03\n-5.997E+01\n1.263E-03\n4.490E-03\n-4.887E+03\n1.405E+02\n4-5 -2.377E-02\n4.232E+01\n9.138E-03\n2.065E-03\n3.168E+03\n2.521E+02\n4-6 5.673E-02\n8.993E+01\n-3.892E-02\n1.102E-03\n3.119E+03\n-3.399E+02\n4-7 2.377E-02\n4.232E+01\n-9.138E-03\n-2.065E-03\n3.168E+03\n-2.521E+02\n5-7 0.000E+00 -1.198E+02\n-4.226E-03\n4.226E-03\n-9.767E+03\n1.323E+02\n6-7 -2.079E-02\n-4.235E+01\n7.471E-03\n2.329E-03\n-3.170E+03\n2.061E+02\n6-8 1.715E-02\n2.999E+01\n-9.190E-03\n-2.247E-03\n1.040E+03\n-8.026E+01\n6-9 -3.168E-03\n4.239E+01\n6.171E-04\n8.762E-04\n3.173E+03\n2.417E+01\n7-9 8.628E-03\n-5.997E+01\n-4.490E-03\n-1.263E-03\n-4.887E+03\n-1.405E+02\n8-9 -5.586E-03\n-4.241E+01\n2.247E-03\n3.865E-04\n-3.174E+03\n6.197E+01\nFall 2003\nOctober 16, 2003\n\nStrain-gage Circuit Analysis\nTwo strain gages are fixed to one of the members. They both will measure the extension or con\ntraction along the length. A bridge circuit is used to avoid attempting to measure the small differ\nence of two large numbers and their placement in the bridge also should eliminate the effects of\nbending - although we anticipate that to be small.\nThe values of the resistances are:\nVsupply = +10 v\nRa = 352 +/- 5% ohms\nRg+∆R\nRg+∆R\nRa\nRb\nRpot\ne1\ne2\nRb = 561 +/- 5% ohms\nRg = 350 +/-0.2% ohms\nRpot = 1 kohm (max)\nThe ouput of the bridge as a function of the\nchange in resistance, ∆R,\ne1 - e2 = (Vsupply /2)(∆R/Rg)\nThe strain as a function of change in resistance is\ngiven by\nε = (1/Fgage)(∆R/Rg)\nwhere Fgage is the \"gage factor\" stated by the\nmanufacturer1 to be\nFgage =2.07 +/- 0.5%\nWith these, you can compute the strain in the member, given the voltage difference e1-e2.\nThe voltage difference e1 - e2 is obtained from your measured values at the op-amp output by\ndividing by the amplifier gain.\n1. BLH Electronics, Inc.\nFall 2003\nOctober 16, 2003\n\n3D Results\nFall 2003\nOctober 16, 2003\n\nStructure 3D Output\nNode Coordinates(x,y,z) and Nodal Displacements(u,v,w) - inches\nx\ny\nz\nu\nv\nw\nNode 0: -4.00E+01\n+0.00E+00\n+0.00E+00\n+0.00E+00\n+0.00E+00\n+0.00E+00\nNode 1: +4.00E+01\n+0.00E+00\n+0.00E+00\n+2.60E-04\n+0.00E+00\n+1.19E-03\nNode 2: +4.00E+01\n+0.00E+00\n-8.00E+01\n+1.14E-03\n-8.43E-03\n+9.31E-04\nNode 3: -4.00E+01\n+0.00E+00\n-8.00E+01\n+1.22E-03\n-8.56E-03\n-2.60E-04\nNode 4: +0.00E+00\n+4.00E+01\n-4.00E+01\n+6.26E-04\n-4.42E-03\n-2.91E-03\nNode 5: +4.00E+01\n+0.00E+00\n-1.60E+02\n+1.77E-03\n-1.36E-02\n+7.20E-05\nNode 6: -4.00E+01\n+0.00E+00\n-1.60E+02\n+2.45E-03\n-1.36E-02\n-1.12E-03\nNode 7: +0.00E+00\n+4.00E+01\n-1.20E+02\n+1.61E-03\n-1.12E-02\n-1.72E-03\nNode 8: +4.00E+01\n+0.00E+00\n-2.40E+02\n+3.00E-03\n-8.56E-03\n-7.87E-04\nNode 9: -4.00E+01\n+0.00E+00\n-2.40E+02\n+3.08E-03\n-8.43E-03\n-1.98E-03\nNode 10: +0.00E+00\n+4.00E+01\n-2.00E+02\n+2.61E-03\n-1.12E-02\n+6.73E-04\nNode 11: +4.00E+01\n+0.00E+00\n-3.20E+02\n+4.23E-03\n+0.00E+00\n-1.04E-03\nNode 12: -4.00E+01\n+0.00E+00\n-3.20E+02\n+3.96E-03\n+0.00E+00\n-2.24E-03\nNode 13: +0.00E+00\n+4.00E+01\n-2.80E+02\n+3.60E-03\n-4.42E-03\n+1.87E-03\n------------------------------------------------------------------------------------\n------------------------------------------------------------------------------------\nApplied Loads(Lx, Ly, Lz) and Reaction Forces(Rx, Ry, Rz) - pounds\nLx\n:\nLy:\nLz:\nRx:\nRy:\nRz:\nNode 0: +0.00E+00\n+0.00E+00\n+0.00E+00\n-4.26E-14\n+1.69E+01\n-5.68E-14\nNode 1: +0.00E+00\n+0.00E+00\n+0.00E+00\n+0.00E+00\n+1.30E+01\n+0.00E+00\nNode 2: +0.00E+00\n+0.00E+00\n+0.00E+00\n+0.00E+00\n+0.00E+00\n+0.00E+00\nNode 3: +0.00E+00\n+0.00E+00\n+0.00E+00\n+0.00E+00\n+0.00E+00\n+0.00E+00\nNode 4: +0.00E+00\n+0.00E+00\n+0.00E+00\n+0.00E+00\n+0.00E+00\n+0.00E+00\nNode 5: +0.00E+00\n-3.00E+01\n+0.00E+00\n+0.00E+00\n+0.00E+00\n+0.00E+00\nNode 6: +0.00E+00\n-3.00E+01\n+0.00E+00\n+0.00E+00\n+0.00E+00\n+0.00E+00\nNode 7: +0.00E+00\n+0.00E+00\n+0.00E+00\n+0.00E+00\n+0.00E+00\n+0.00E+00\nNode 8: +0.00E+00\n+0.00E+00\n+0.00E+00\n+0.00E+00\n+0.00E+00\n+0.00E+00\nNode 9: +0.00E+00\n+0.00E+00\n+0.00E+00\n+0.00E+00\n+0.00E+00\n+0.00E+00\nNode 10: +0.00E+00\n+0.00E+00\n+0.00E+00\n+0.00E+00\n+0.00E+00\n+0.00E+00\nNode 11: +0.00E+00\n+0.00E+00\n+0.00E+00\n+0.00E+00\n+1.69E+01\n+0.00E+00\nNode 12: +0.00E+00\n+0.00E+00\n+0.00E+00\n+0.00E+00\n+1.30E+01\n+0.00E+00\nNode 13: +0.00E+00\n+0.00E+00\n+0.00E+00\n+0.00E+00\n+0.00E+00\n+0.00E+00\n------------------------------------------------------------------------------------\n------------------------------------------------------------------------------------\nMember Properties\nL in\nA in2\nE lbs/in2\nMember 0 - 1:\n+8.00E+01\n+1.33E-01\n+3.00E+07\nMember 1 - 2:\n+8.00E+01\n+1.33E-01\n+3.00E+07\nMember 2 - 3:\n+8.00E+01\n+1.33E-01\n+3.00E+07\nFall 2003\nOctober 16, 2003\n\nMember 3 - 0:\n+8.00E+01\n+1.33E-01\n+3.00E+07\nMember 0 - 4:\n+6.92E+01\n+1.33E-01\n+3.00E+07\nMember 4 - 3:\n+6.92E+01\n+1.33E-01\n+3.00E+07\nMember 4 - 1:\n+6.92E+01\n+1.33E-01\n+3.00E+07\nMember 4 - 2:\n+6.92E+01\n+1.33E-01\n+3.00E+07\nMember 0 - 2:\n+1.13E+02\n+1.33E-01\n+3.00E+07\nMember 2 - 5:\n+8.00E+01\n+1.33E-01\n+3.00E+07\nMember 5 - 6:\n+8.00E+01\n+1.33E-01\n+3.00E+07\nMember 6 - 3:\n+8.00E+01\n+1.33E-01\n+3.00E+07\nMember 5 - 7:\n+6.92E+01\n+1.33E-01\n+3.00E+07\nMember 7 - 6:\n+6.92E+01\n+1.33E-01\n+3.00E+07\nMember 7 - 2:\n+6.92E+01\n+1.33E-01\n+3.00E+07\nMember 7 - 3:\n+6.92E+01\n+1.33E-01\n+3.00E+07\nMember 4 - 7:\n+8.00E+01\n+1.33E-01\n+3.00E+07\nMember 3 - 5:\n+1.13E+02\n+1.33E-01\n+3.00E+07\nMember 5 - 8:\n+8.00E+01\n+1.33E-01\n+3.00E+07\nMember 8 - 9:\n+8.00E+01\n+1.33E-01\n+3.00E+07\nMember 9 - 6:\n+8.00E+01\n+1.33E-01\n+3.00E+07\nMember 8 - 10:\n+6.92E+01\n+1.33E-01\n+3.00E+07\nMember 10 - 9:\n+6.92E+01\n+1.33E-01\n+3.00E+07\nMember 10 - 6:\n+6.92E+01\n+1.33E-01\n+3.00E+07\nMember 10 - 5:\n+6.92E+01\n+1.33E-01\n+3.00E+07\nMember 6 - 8:\n+1.13E+02\n+1.33E-01\n+3.00E+07\nMember 7 - 10:\n+8.00E+01\n+1.33E-01\n+3.00E+07\nMember 8 - 11:\n+8.00E+01\n+1.33E-01\n+3.00E+07\nMember 11 - 12:\n+8.00E+01\n+1.33E-01\n+3.00E+07\nMember 12 - 9:\n+8.00E+01\n+1.33E-01\n+3.00E+07\nMember 11 - 13:\n+6.92E+01\n+1.33E-01\n+3.00E+07\nMember 13 - 12:\n+6.92E+01\n+1.33E-01\n+3.00E+07\nMember 13 - 8:\n+6.92E+01\n+1.33E-01\n+3.00E+07\nMember 13 - 9:\n+6.92E+01\n+1.33E-01\n+3.00E+07\nMember 10 - 13:\n+8.00E+01\n+1.33E-01\n+3.00E+07\nMember 9 - 11:\n+1.13E+02\n+1.33E-01\n+3.00E+07\n------------------------------------------------------------------------------------\nMember Forces - pounds\nMember 0 - 1:\nMember 1 - 2:\nMember 2 - 3:\nMember 3 - 0:\nMember 0 - 4:\nMember 4 - 3:\nMember 4 - 1:\nMember 4 - 2:\nMember 0 - 2:\nMember 2 - 5:\nMember 5 - 6:\n+1.30E+01\n+1.30E+01\n-3.85E+00\n+1.30E+01\n-2.93E+01\n+2.93E+01\n-2.26E+01\n+2.26E+01\n+5.45E+00\n+4.30E+01\n-3.38E+01\nFall 2003\nOctober 16, 2003\n\nMember 6 - 3:\n+4.30E+01\nMember 5 - 7:\n+2.26E+01\nMember 7 - 6:\n+2.93E+01\nMember 7 - 2:\n-2.26E+01\nMember 7 - 3:\n-2.93E+01\nMember 4 - 7:\n-6.00E+01\nMember 3 - 5:\n+5.45E+00\nMember 5 - 8:\n+4.30E+01\nMember 8 - 9:\n-3.85E+00\nMember 9 - 6:\n+4.30E+01\nMember 8 - 10:\n-2.93E+01\nMember 10 - 9:\n-2.26E+01\nMember 10 - 6:\n+2.26E+01\nMember 10 - 5:\n+2.93E+01\nMember 6 - 8:\n+5.45E+00\nMember 7 - 10:\n-1.20E+02\nMember 8 - 11:\n+1.30E+01\nMember 11 - 12:\n+1.30E+01\nMember 12 - 9:\n+1.30E+01\nMember 11 - 13:\n-2.93E+01\nMember 13 - 12:\n-2.26E+01\nMember 13 - 8:\n+2.93E+01\nMember 13 - 9:\n+2.26E+01\nMember 10 - 13:\n-6.00E+01\nMember 9 - 11:\n+5.45E+00\n------------------------------------------------------------------------------------\n------------------------------------------------------------------------------------\n** Note on Sign Convention used:\n+tive Member Force = Tension\n-tive Member Force = Compression\nFall 2003\nOctober 16, 2003\n\nStructure 3D Input\n<!DOCTYPE StructureXML\n[\n<!ELEMENT StructureXML (units, uniqueJoints, members)>\n<!ELEMENT units EMPTY>\n<!ATTLIST units length (meters | centimeters | feet | inches) #REQUIRED\nforce (newtons | kiloNewtons | pounds | kips) #REQUIRED>\n<!ATTLIST graphics zoomScale CDATA #REQUIRED\noriginX CDATA #REQUIRED\noriginY CDATA #REQUIRED>\n<!ELEMENT uniqueJoints (Joint*)>\n<!ELEMENT Joint (coordinates, constraints, loads)>\n<!ATTLIST Joint JointID ID #REQUIRED>\n<!ELEMENT coordinates EMPTY>\n<!ATTLIST coordinates x CDATA #REQUIRED\ny CDATA #REQUIRED\nz CDATA #REQUIRED>\n<!ELEMENT constraints EMPTY>\n<!ATTLIST constraints Rx (true | false) #REQUIRED\nRy (true | false) #REQUIRED\nRz (true | false) #REQUIRED\nMx (true | false) #REQUIRED\nMy (true | false) #REQUIRED\nMz (true | false) #REQUIRED>\n<!ELEMENT loads EMPTY>\n<!ATTLIST loads Fx CDATA #REQUIRED\nFy CDATA #REQUIRED\nFz CDATA #REQUIRED\nFMx CDATA #REQUIRED\nFMy CDATA #REQUIRED\nFMz CDATA #REQUIRED>\n<!ELEMENT members (Member*)>\n<!ELEMENT Member (properties, memberRelease)>\n<!ATTLIST Member jStart CDATA #REQUIRED jEnd CDATA #REQUIRED>\n<!ELEMENT properties EMPTY>\n<!ATTLIST properties A CDATA #REQUIRED\nJ CDATA #REQUIRED\nIy CDATA #REQUIRED\nIz CDATA #REQUIRED\nE CDATA #REQUIRED\nG CDATA #REQUIRED\nB CDATA #REQUIRED>\n<!ELEMENT memberRelease EMPTY>\n<!ATTLIST memberRelease sMR (true | false) #REQUIRED\nFall 2003\nOctober 16, 2003\n\neMR (true | false) #REQUIRED>\n]\n>\n<StructureXML>\n<!-- Valid length attributes are meters, centimeters, feet, inches -->\n<!-- Valid force attributes are newtons, kiloNewtons, pounds, kips -->\n<units length = \"inches\" force = \"pounds\"></units>\n<graphics zoomScale = \"1.00\" originX = \" 350\" originY = \" 275\"></graphics>\n<uniqueJoints>\n<Joint JointID = \"J:0\">\n<coordinates x = \"-40.00\" y = \" 0.00\" z = \" 0.00\"></coordinates>\n<constraints Rx = \"true\" Ry = \"true\" Rz = \"true\"\nMx = \"false\" My = \"false\" Mz = \"false\"></constraints>\n<loads Fx = \"0.0\" Fy = \"0.0\" Fz = \"0.0\"\nFMx = \"0.0\" FMy = \"0.0\" FMz = \"0.0\"></loads>\n</Joint>\n<Joint JointID = \"J:1\">\n<coordinates x = \"40.00\" y = \" 0.00\" z = \" 0.00\"></coordinates>\n<constraints Rx = \"false\" Ry = \"true\" Rz = \"false\"\nMx = \"false\" My = \"false\" Mz = \"false\"></constraints>\n<loads Fx = \"0.0\" Fy = \"0.0\" Fz = \"0.0\"\nFMx = \"0.0\" FMy = \"0.0\" FMz = \"0.0\"></loads>\n</Joint>\n<Joint JointID = \"J:2\">\n<coordinates x = \"40.00\" y = \" 0.00\" z = \"-80.00\"></coordinates>\n<constraints Rx = \"false\" Ry = \"false\" Rz = \"false\"\nMx = \"false\" My = \"false\" Mz = \"false\"></constraints>\n<loads Fx = \"0.0\" Fy = \"0.0\" Fz = \"0.0\"\nFMx = \"0.0\" FMy = \"0.0\" FMz = \"0.0\"></loads>\n</Joint>\n<Joint JointID = \"J:3\">\n<coordinates x = \"-40.00\" y = \" 0.00\" z = \"-80.00\"></coordinates>\n<constraints Rx = \"false\" Ry = \"false\" Rz = \"false\"\nMx = \"false\" My = \"false\" Mz = \"false\"></constraints>\n<loads Fx = \"0.0\" Fy = \"0.0\" Fz = \"0.0\"\nFMx = \"0.0\" FMy = \"0.0\" FMz = \"0.0\"></loads>\n</Joint>\n<Joint JointID = \"J:4\">\n<coordinates x = \" 0.00\" y = \"40.00\" z = \"-40.00\"></coordinates>\n<constraints Rx = \"false\" Ry = \"false\" Rz = \"false\"\nMx = \"false\" My = \"false\" Mz = \"false\"></constraints>\n<loads Fx = \"0.0\" Fy = \"0.0\" Fz = \"0.0\"\nFMx = \"0.0\" FMy = \"0.0\" FMz = \"0.0\"></loads>\n</Joint>\nFall 2003\nOctober 16, 2003\n\n<Joint JointID = \"J:5\">\n<coordinates x = \"40.00\" y = \" 0.00\" z = \"-160.00\"></coordinates>\n<constraints Rx = \"false\" Ry = \"false\" Rz = \"false\"\nMx = \"false\" My = \"false\" Mz = \"false\"></constraints>\n<loads Fx = \"0.0\" Fy = \"-30.0\" Fz = \"0.0\"\nFMx = \"0.0\" FMy = \"0.0\" FMz = \"0.0\"></loads>\n</Joint>\n<Joint JointID = \"J:6\">\n<coordinates x = \"-40.00\" y = \" 0.00\" z = \"-160.00\"></coordinates>\n<constraints Rx = \"false\" Ry = \"false\" Rz = \"false\"\nMx = \"false\" My = \"false\" Mz = \"false\"></constraints>\n<loads Fx = \"0.0\" Fy = \"-30.0\" Fz = \"0.0\"\nFMx = \"0.0\" FMy = \"0.0\" FMz = \"0.0\"></loads>\n</Joint>\n<Joint JointID = \"J:7\">\n<coordinates x = \" 0.00\" y = \"40.00\" z = \"-120.00\"></coordinates>\n<constraints Rx = \"false\" Ry = \"false\" Rz = \"false\"\nMx = \"false\" My = \"false\" Mz = \"false\"></constraints>\n<loads Fx = \"0.0\" Fy = \"0.0\" Fz = \"0.0\"\nFMx = \"0.0\" FMy = \"0.0\" FMz = \"0.0\"></loads>\n</Joint>\n<Joint JointID = \"J:8\">\n<coordinates x = \"40.00\" y = \" 0.00\" z = \"-240.00\"></coordinates>\n<constraints Rx = \"false\" Ry = \"false\" Rz = \"false\"\nMx = \"false\" My = \"false\" Mz = \"false\"></constraints>\n<loads Fx = \"0.0\" Fy = \"0.0\" Fz = \"0.0\"\nFMx = \"0.0\" FMy = \"0.0\" FMz = \"0.0\"></loads>\n</Joint>\n<Joint JointID = \"J:9\">\n<coordinates x = \"-40.00\" y = \" 0.00\" z = \"-240.00\"></coordinates>\n<constraints Rx = \"false\" Ry = \"false\" Rz = \"false\"\nMx = \"false\" My = \"false\" Mz = \"false\"></constraints>\n<loads Fx = \"0.0\" Fy = \"0.0\" Fz = \"0.0\"\nFMx = \"0.0\" FMy = \"0.0\" FMz = \"0.0\"></loads>\n</Joint>\n<Joint JointID = \"J:10\">\n<coordinates x = \" 0.00\" y = \"40.00\" z = \"-200.00\"></coordinates>\n<constraints Rx = \"false\" Ry = \"false\" Rz = \"false\"\nMx = \"false\" My = \"false\" Mz = \"false\"></constraints>\n<loads Fx = \"0.0\" Fy = \"0.0\" Fz = \"0.0\"\nFMx = \"0.0\" FMy = \"0.0\" FMz = \"0.0\"></loads>\n</Joint>\n<Joint JointID = \"J:11\">\n<coordinates x = \"40.00\" y = \" 0.00\" z = \"-320.00\"></coordinates>\n<constraints Rx = \"false\" Ry = \"true\" Rz = \"false\"\nMx = \"false\" My = \"false\" Mz = \"false\"></constraints>\n<loads Fx = \"0.0\" Fy = \"0.0\" Fz = \"0.0\"\nFall 2003\nOctober 16, 2003\n\nFMx = \"0.0\" FMy = \"0.0\" FMz = \"0.0\"></loads>\n</Joint>\n<Joint JointID = \"J:12\">\n<coordinates x = \"-40.00\" y = \" 0.00\" z = \"-320.00\"></coordinates>\n<constraints Rx = \"false\" Ry = \"true\" Rz = \"false\"\nMx = \"false\" My = \"false\" Mz = \"false\"></constraints>\n<loads Fx = \"0.0\" Fy = \"0.0\" Fz = \"0.0\"\nFMx = \"0.0\" FMy = \"0.0\" FMz = \"0.0\"></loads>\n</Joint>\n<Joint JointID = \"J:13\">\n<coordinates x = \" 0.00\" y = \"40.00\" z = \"-280.00\"></coordinates>\n<constraints Rx = \"false\" Ry = \"false\" Rz = \"false\"\nMx = \"false\" My = \"false\" Mz = \"false\"></constraints>\n<loads Fx = \"0.0\" Fy = \"0.0\" Fz = \"0.0\"\nFMx = \"0.0\" FMy = \"0.0\" FMz = \"0.0\"></loads>\n</Joint>\n</uniqueJoints>\n<members>\n<Member jStart = \"0\" jEnd = \"1\">\n<properties A = \"0.1336\" J = \"0.0\" Iy = \"0.0\" Iz = \"0.0\"\nE = \"3.0E7\" G = \"0.0\" B = \"0.0\"></properties>\n<memberRelease sMR = \"false\" eMR = \"false\"></memberRelease>\n</Member>\n<Member jStart = \"1\" jEnd = \"2\">\n<properties A = \"0.1336\" J = \"0.0\" Iy = \"0.0\" Iz = \"0.0\"\nE = \"3.0E7\" G = \"0.0\" B = \"0.0\"></properties>\n<memberRelease sMR = \"false\" eMR = \"false\"></memberRelease>\n</Member>\n<Member jStart = \"2\" jEnd = \"3\">\n<properties A = \"0.1336\" J = \"0.0\" Iy = \"0.0\" Iz = \"0.0\"\nE = \"3.0E7\" G = \"0.0\" B = \"0.0\"></properties>\n<memberRelease sMR = \"false\" eMR = \"false\"></memberRelease>\n</Member>\n<Member jStart = \"3\" jEnd = \"0\">\n<properties A = \"0.1336\" J = \"0.0\" Iy = \"0.0\" Iz = \"0.0\"\nE = \"3.0E7\" G = \"0.0\" B = \"0.0\"></properties>\n<memberRelease sMR = \"false\" eMR = \"false\"></memberRelease>\n</Member>\n<Member jStart = \"0\" jEnd = \"4\">\n<properties A = \"0.1336\" J = \"0.0\" Iy = \"0.0\" Iz = \"0.0\"\nE = \"3.0E7\" G = \"0.0\" B = \"0.0\"></properties>\n<memberRelease sMR = \"false\" eMR = \"false\"></memberRelease>\n</Member>\n<Member jStart = \"4\" jEnd = \"3\">\n<properties A = \"0.1336\" J = \"0.0\" Iy = \"0.0\" Iz = \"0.0\"\nE = \"3.0E7\" G = \"0.0\" B = \"0.0\"></properties>\nFall 2003\nOctober 16, 2003\n\n<memberRelease sMR = \"false\" eMR = \"false\"></memberRelease>\n</Member>\n<Member jStart = \"4\" jEnd = \"1\">\n<properties A = \"0.1336\" J = \"0.0\" Iy = \"0.0\" Iz = \"0.0\"\nE = \"3.0E7\" G = \"0.0\" B = \"0.0\"></properties>\n<memberRelease sMR = \"false\" eMR = \"false\"></memberRelease>\n</Member>\n<Member jStart = \"4\" jEnd = \"2\">\n<properties A = \"0.1336\" J = \"0.0\" Iy = \"0.0\" Iz = \"0.0\"\nE = \"3.0E7\" G = \"0.0\" B = \"0.0\"></properties>\n<memberRelease sMR = \"false\" eMR = \"false\"></memberRelease>\n</Member>\n<Member jStart = \"0\" jEnd = \"2\">\n<properties A = \"0.1336\" J = \"0.0\" Iy = \"0.0\" Iz = \"0.0\"\nE = \"3.0E7\" G = \"0.0\" B = \"0.0\"></properties>\n<memberRelease sMR = \"false\" eMR = \"false\"></memberRelease>\n</Member>\n<Member jStart = \"2\" jEnd = \"5\">\n<properties A = \"0.1336\" J = \"0.0\" Iy = \"0.0\" Iz = \"0.0\"\nE = \"3.0E7\" G = \"0.0\" B = \"0.0\"></properties>\n<memberRelease sMR = \"false\" eMR = \"false\"></memberRelease>\n</Member>\n<Member jStart = \"5\" jEnd = \"6\">\n<properties A = \"0.1336\" J = \"0.0\" Iy = \"0.0\" Iz = \"0.0\"\nE = \"3.0E7\" G = \"0.0\" B = \"0.0\"></properties>\n<memberRelease sMR = \"false\" eMR = \"false\"></memberRelease>\n</Member>\n<Member jStart = \"6\" jEnd = \"3\">\n<properties A = \"0.1336\" J = \"0.0\" Iy = \"0.0\" Iz = \"0.0\"\nE = \"3.0E7\" G = \"0.0\" B = \"0.0\"></properties>\n<memberRelease sMR = \"false\" eMR = \"false\"></memberRelease>\n</Member>\n<Member jStart = \"5\" jEnd = \"7\">\n<properties A = \"0.1336\" J = \"0.0\" Iy = \"0.0\" Iz = \"0.0\"\nE = \"3.0E7\" G = \"0.0\" B = \"0.0\"></properties>\n<memberRelease sMR = \"false\" eMR = \"false\"></memberRelease>\n</Member>\n<Member jStart = \"7\" jEnd = \"6\">\n<properties A = \"0.1336\" J = \"0.0\" Iy = \"0.0\" Iz = \"0.0\"\nE = \"3.0E7\" G = \"0.0\" B = \"0.0\"></properties>\n<memberRelease sMR = \"false\" eMR = \"false\"></memberRelease>\n</Member>\n<Member jStart = \"7\" jEnd = \"2\">\n<properties A = \"0.1336\" J = \"0.0\" Iy = \"0.0\" Iz = \"0.0\"\nE = \"3.0E7\" G = \"0.0\" B = \"0.0\"></properties>\n<memberRelease sMR = \"false\" eMR = \"false\"></memberRelease>\n</Member>\nFall 2003\nOctober 16, 2003\n\n<Member jStart = \"7\" jEnd = \"3\">\n<properties A = \"0.1336\" J = \"0.0\" Iy = \"0.0\" Iz = \"0.0\"\nE = \"3.0E7\" G = \"0.0\" B = \"0.0\"></properties>\n<memberRelease sMR = \"false\" eMR = \"false\"></memberRelease>\n</Member>\n<Member jStart = \"4\" jEnd = \"7\">\n<properties A = \"0.1336\" J = \"0.0\" Iy = \"0.0\" Iz = \"0.0\"\nE = \"3.0E7\" G = \"0.0\" B = \"0.0\"></properties>\n<memberRelease sMR = \"false\" eMR = \"false\"></memberRelease>\n</Member>\n<Member jStart = \"3\" jEnd = \"5\">\n<properties A = \"0.1336\" J = \"0.0\" Iy = \"0.0\" Iz = \"0.0\"\nE = \"3.0E7\" G = \"0.0\" B = \"0.0\"></properties>\n<memberRelease sMR = \"false\" eMR = \"false\"></memberRelease>\n</Member>\n<Member jStart = \"5\" jEnd = \"8\">\n<properties A = \"0.1336\" J = \"0.0\" Iy = \"0.0\" Iz = \"0.0\"\nE = \"3.0E7\" G = \"0.0\" B = \"0.0\"></properties>\n<memberRelease sMR = \"false\" eMR = \"false\"></memberRelease>\n</Member>\n<Member jStart = \"8\" jEnd = \"9\">\n<properties A = \"0.1336\" J = \"0.0\" Iy = \"0.0\" Iz = \"0.0\"\nE = \"3.0E7\" G = \"0.0\" B = \"0.0\"></properties>\n<memberRelease sMR = \"false\" eMR = \"false\"></memberRelease>\n</Member>\n<Member jStart = \"9\" jEnd = \"6\">\n<properties A = \"0.1336\" J = \"0.0\" Iy = \"0.0\" Iz = \"0.0\"\nE = \"3.0E7\" G = \"0.0\" B = \"0.0\"></properties>\n<memberRelease sMR = \"false\" eMR = \"false\"></memberRelease>\n</Member>\n<Member jStart = \"8\" jEnd = \"10\">\n<properties A = \"0.1336\" J = \"0.0\" Iy = \"0.0\" Iz = \"0.0\"\nE = \"3.0E7\" G = \"0.0\" B = \"0.0\"></properties>\n<memberRelease sMR = \"false\" eMR = \"false\"></memberRelease>\n</Member>\n<Member jStart = \"10\" jEnd = \"9\">\n<properties A = \"0.1336\" J = \"0.0\" Iy = \"0.0\" Iz = \"0.0\"\nE = \"3.0E7\" G = \"0.0\" B = \"0.0\"></properties>\n<memberRelease sMR = \"false\" eMR = \"false\"></memberRelease>\n</Member>\n<Member jStart = \"10\" jEnd = \"6\">\n<properties A = \"0.1336\" J = \"0.0\" Iy = \"0.0\" Iz = \"0.0\"\nE = \"3.0E7\" G = \"0.0\" B = \"0.0\"></properties>\n<memberRelease sMR = \"false\" eMR = \"false\"></memberRelease>\n</Member>\n<Member jStart = \"10\" jEnd = \"5\">\n<properties A = \"0.1336\" J = \"0.0\" Iy = \"0.0\" Iz = \"0.0\"\nFall 2003\nOctober 16, 2003\n\nE = \"3.0E7\" G = \"0.0\" B = \"0.0\"></properties>\n<memberRelease sMR = \"false\" eMR = \"false\"></memberRelease>\n</Member>\n<Member jStart = \"6\" jEnd = \"8\">\n<properties A = \"0.1336\" J = \"0.0\" Iy = \"0.0\" Iz = \"0.0\"\nE = \"3.0E7\" G = \"0.0\" B = \"0.0\"></properties>\n<memberRelease sMR = \"false\" eMR = \"false\"></memberRelease>\n</Member>\n<Member jStart = \"7\" jEnd = \"10\">\n<properties A = \"0.1336\" J = \"0.0\" Iy = \"0.0\" Iz = \"0.0\"\nE = \"3.0E7\" G = \"0.0\" B = \"0.0\"></properties>\n<memberRelease sMR = \"false\" eMR = \"false\"></memberRelease>\n</Member>\n<Member jStart = \"8\" jEnd = \"11\">\n<properties A = \"0.1336\" J = \"0.0\" Iy = \"0.0\" Iz = \"0.0\"\nE = \"3.0E7\" G = \"0.0\" B = \"0.0\"></properties>\n<memberRelease sMR = \"false\" eMR = \"false\"></memberRelease>\n</Member>\n<Member jStart = \"11\" jEnd = \"12\">\n<properties A = \"0.1336\" J = \"0.0\" Iy = \"0.0\" Iz = \"0.0\"\nE = \"3.0E7\" G = \"0.0\" B = \"0.0\"></properties>\n<memberRelease sMR = \"false\" eMR = \"false\"></memberRelease>\n</Member>\n<Member jStart = \"12\" jEnd = \"9\">\n<properties A = \"0.1336\" J = \"0.0\" Iy = \"0.0\" Iz = \"0.0\"\nE = \"3.0E7\" G = \"0.0\" B = \"0.0\"></properties>\n<memberRelease sMR = \"false\" eMR = \"false\"></memberRelease>\n</Member>\n<Member jStart = \"11\" jEnd = \"13\">\n<properties A = \"0.1336\" J = \"0.0\" Iy = \"0.0\" Iz = \"0.0\"\nE = \"3.0E7\" G = \"0.0\" B = \"0.0\"></properties>\n<memberRelease sMR = \"false\" eMR = \"false\"></memberRelease>\n</Member>\n<Member jStart = \"13\" jEnd = \"12\">\n<properties A = \"0.1336\" J = \"0.0\" Iy = \"0.0\" Iz = \"0.0\"\nE = \"3.0E7\" G = \"0.0\" B = \"0.0\"></properties>\n<memberRelease sMR = \"false\" eMR = \"false\"></memberRelease>\n</Member>\n<Member jStart = \"13\" jEnd = \"8\">\n<properties A = \"0.1336\" J = \"0.0\" Iy = \"0.0\" Iz = \"0.0\"\nE = \"3.0E7\" G = \"0.0\" B = \"0.0\"></properties>\n<memberRelease sMR = \"false\" eMR = \"false\"></memberRelease>\n</Member>\n<Member jStart = \"13\" jEnd = \"9\">\n<properties A = \"0.1336\" J = \"0.0\" Iy = \"0.0\" Iz = \"0.0\"\nE = \"3.0E7\" G = \"0.0\" B = \"0.0\"></properties>\n<memberRelease sMR = \"false\" eMR = \"false\"></memberRelease>\nFall 2003\nOctober 16, 2003\n\n</Member>\n<Member jStart = \"10\" jEnd = \"13\">\n<properties A = \"0.1336\" J = \"0.0\" Iy = \"0.0\" Iz = \"0.0\"\nE = \"3.0E7\" G = \"0.0\" B = \"0.0\"></properties>\n<memberRelease sMR = \"false\" eMR = \"false\"></memberRelease>\n</Member>\n<Member jStart = \"9\" jEnd = \"11\">\n<properties A = \"0.1336\" J = \"0.0\" Iy = \"0.0\" Iz = \"0.0\"\nE = \"3.0E7\" G = \"0.0\" B = \"0.0\"></properties>\n<memberRelease sMR = \"false\" eMR = \"false\"></memberRelease>\n</Member>\n</members>\n</StructureXML>\nFall 2003\nOctober 16, 2003"
    },
    {
      "category": "Resource",
      "title": "exp5_03.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-105-solid-mechanics-laboratory-fall-2003/9e00fc51effcad3c64873613974d0ff0_exp5_03.pdf",
      "content": "1.105 Solid Mechanics Laboratory\nFall 2003\nExperiment 51\nCompressive and Tensile Strength of Concrete\nObjective:\nThis lab is designed to develop your understanding of standard measurement techniques for\ndetermining the compressive and tensile strengths of concrete.\nOverview:\nSeveral cylindrical concrete specimens have been prepared for testing to failure: Two of them will\nbe subjected to compression. One will be subjected to a loading which engenders failure in ten\nsion, albeit indirectly.\nThe specimens are cylinders four (4) inches in diameter and eight (8) inches in height. The speci\nmens were cast and cured for _______ days2.\nThe compressive strength is given as\n_____________ psi, or _____________ MPa.\nTests will be conducted using one of the heavy testing machines in the Rock Mechanics Labora\ntory, room 1-034. A computer will automatically record the data for load level and displacement.\nYou are to record all supplementary data \"by hand\", process the data, plot and describe results\naccording to the directions and suggestions included in what follows and do so within the three\nhours allotted for this lab. (Leave laptop at home for this session but bring a calculator)\nExperiment 5.1: Compression Test\nThe standard for compression testing of concrete can be found in ASTM standard: D39, [1]\nThe test specimen will be subjected to an axial load, i.e., along the axis of the cylinder, between\nthe two platens of the testing machine. The specimens are first subjected to seating load (less\nthan 50 lbs) at the outset to eliminate the effects of contact surface mis-alignment and any slack\nwithin the internal mechanism of the machine.\nTwo extensionmeters will be used to measure the displacement over a gage length of 1 inch. You\nwill average the two readings to obtain a single measure of strain.\nFor safety reason, you must wear a safety glass. A plastic shatter shield will be put in place prior\nthe starting of the subsequent loading stage to contain any flying debris.\nThe computer will record more data than you will need to construct a plot of stress versus strain.\n(You will need to sample pairs of load-displacement values over the full test range). The test will be\nstopped when specimen fail (load clearly decreased and deformation continues). You will need to\nsketch the failure geometry. Note any failure planes and angles.\n1. Formerly, Experiment #5\n2. Download the Quikrete Specs (Fast-Setting Concrete #1004-50) at (http://www.firstsourceonl.com/members/\nresult.asp?key=quikrete) to see how the strength is thought to vary with curing time.\n1.105 Solid Mechanics Laboratory\nNovember 4, 2003\n\nData1:\nCylinder Dimensions:\nDiameter:\nHeight:\nArea =\nExtens. 1\nExtens. 2\nLOAD\nStress\nStrain\nSecant Modulus\nin.\nin\nlbs.\n1. Make sure 1) You indicate units of ALL quantities and 2) You include an estimate of uncertainty\nFall 2003\nNovember 4, 2003\n\nData Cylinder #2.\nCylinder Dimensions:\nDiameter:\nHeight:\nArea =\nExtens. 1\nExtens. 2\nLOAD\nStress\nStrain\nSecant Modulus\nin.\nin\nlbs.\nFall 2003\nNovember 4, 2003\n\nResults\nCompressive Stress, psi\nStrain, in/in\nStress versus strain - Uniaxial Compression Test\nConcrete Cylinder\nObservations and Discussion\nFall 2003\nNovember 4, 2003\n\nExperiment 5.2: Indirect Tension Test\nIn this test, you will perform an indirect tension test. The\nfigure shows the how the cylinder is loaded with a dis\ntributed load along diametrically opposed, sides of the\ncylinder. These line loads engender a uniform tensile\nstress distributed within the cylinder over the plane sec\ntion A-A', bisecting the cylinder - except within the vicin\nity of the circumference. This tensile stress can be\nshown to be\nσx = 2P/(πLD)\nwhere L is the length (or height) of the cylinder along\nwhich the load P is distributed, and D is the cylinder\ndiameter.\nA compressive stress on planes orthogonal to A-A' is\nalso engendered at each point. This can be shown to be\nequal to\nr\nD-r\nP\nP\nA\nA'\nσx\nσy\nTension\n2P\nD2\nσ\n= ----------- ⋅ --------------------\n-\ny\nπLD\nr D - r)\n(\nFor this test you will record only the displacement at fracture and the failure load, and\ncompare the failure stress in tension with the failure stress in compression obtained in experiment\n6.1.\nData\nCylinder Dimensions:\nDiameter:\nHeight:\nFailure Load:\nPounds\nTensile Stress, σx =\nThe failure stress in tension is __________% +/- of the failure stress in compression.\nCompressive stress, σy , at r=D/2 = _________ ;\nat r=D/4 = _________ .\nObservations and Discussion\nReferences:\n1 ASTM standards: D39\n2 Neville A.M., 1963, Properties of Concrete, John Wiley and Sons, Inc., New York.\nMurdock L.J., Brook K.M., and Dewar J.D., 1991, Concrete: Materials & Practice, Edward Arnold, a\ndivision of Hodder & Stoughton, London.\nFall 2003\nNovember 4, 2003"
    },
    {
      "category": "Resource",
      "title": "exp6_03.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-105-solid-mechanics-laboratory-fall-2003/e79c7a8ed23892a59ec5446c63edd466_exp6_03.pdf",
      "content": "1.105 Solid Mechanics Laboratory\nFall 2003\nExperiment 6\nThe linear, elastic behavior of a Beam\nThe objectives of this experiment are\n-\nTo experimentally study the linear elastic behavior of beams under four point\nbending.\n-\nTo compare the stiffness of beams of the same length and cross-sectional\narea but having different profiles.\n-\nTo measure the extensional strain in the top and bottom fibers of the beam\nspecimens and compare with the prediction of engineering beam theory.\nEach beam specimen, made of Aluminum and 24 inches long, will be simply supported at its ends\nand loaded at two points symmetrically disposed with respect to midspan, each 3 inches off cen\nter. This \"four point bending\" produces \"pure bending\" (no shear) over the midspan section. Two\ndial gages will be employed, one to measure midspan deflection, the other will be positioned to\nmeasure vertical displacement roughly half the distance between midspan and one of the ends.\nTwo strain gages are mounted on the top and on the bottom at midspan. The beams will be loaded\nusing dead weights as in the previous experiment. You will compare bending strain and beam stiff\nness to theory.\nBeam Specimens\nThe figure below shows a beam specimen under four point bending. To the right we show the\ncross sections of the two Aluminum specimens. The material is 6061-T6 as is clearly indicated on\nthe beams' sides.\nSame areas\nThe two have the same cross sectional area as you can verify.\nMeasure all the relevant dimensions, e.g., the length of the span between the supports, all cross-\nsection dimensions, the location of the two load points relative to the supports.\nYou will test the I beam in one orientation, as indicated in the figure. You will test the beam with\nrectangular cross section in two orientations - in the orientation indicated in the figure and with the\nbeam lying flat on the supports. You will make a total of three runs minimum. Multiple runs are\nsuggested, especially with the first specimen, to acclimate yourself to the beam's behavior and\ninstrumentation performance.\n1.105 Solid Mechanics Laboratory\nNovember 13, 2003\n\nProcedure - Instrumentation Setup\nBefore placing a specimen on the end supports, mark off two points, three inches to the left and\nright of the end of one of the two mid span strain gages. This end of the gage, away from the leads,\nwill become the midspan point. Mark both the top and bottom flanges at these load points.\nPosition the specimen (we will first test the I beam) so that a dial gage can be positioned at mid-\nspan without resting on the strain gage but as close as possible to the end of the gage away from\nthe leads and adjust the end supports so that this point is truly midspan.\nLoop the thin cables with eye hook ends over the beam at the two symmetrically disposed loading\npoints, three inches off center.\nConnect the cables to the horizontal bar below the test bed with s hooks. Let this be your \"no load\"\ncondition. (Before hooking up the bucket).\nPosition the dial gages as indicated in the figure on the previous page.\nop-amp\npot\namp\npot\n+10 v\nV+\n+10 v\n-10 v\ninput\ne1\ne2\neo op amp\nopen\noutput\nbridge\nV bridge supply\nop amp supply\ngage #1 input\ngage #2\n(bridge output)\nV- op amp supply\nConnect the strain gages to the ter\nminals on the circuit board as per the\nfigure below. You will note that one of\nthe leads of one of the gages is sol\ndered to one of the leads of the other\ngage. Only three terminals on the\nboard are used in this experiment\nand they are to be connected as\nshown in the figure. (See appendix\nfor the bridge circuit layout).\nWith the power supply disconnected\nfrom the circuit board, set the +20v\nsupply to +10v and verify that the\n20v supply is set to -10v (with the full\ntracking nob turned all the way clock\nwise). Turn off the power supply.\nConnect the +10v supply leads to the\ntwo terminals as indicated in the fig\nure. Connect the common and the\n10v supply to the two terminals also\nas indicated in the figure.\nTurn on the power supply and, with the Digital Multimeter, check the voltages at the strain gage\ninput terminals. One should read +10v, another approximately +5v and the third should read 0v.\nBalance the bridge.\nNull the amplifier.\nCalibrate the amplifier by resetting the bridge balancing pot so that the output of the bridge (which\nis the input to the amplifier) is on the order of 10 mv, then measure the output of the amplifier to\nobtain the gain.\nRepeat this for a bridge output of approximately 20mv.\nFall 2003\nNovember 13, 2003\n\nBalance the bridge and null the amplifier.\nPress down lightly on the beam to verify setup. Op amp output should be on the order of 10 mv.\nProceedure - Loading Sequence\nWeigh the bucket and other supporting hardware still to be attached.\nNow load the I beam specimen but do not exceed 50 lbs. total.\nTake data while unloading too.\nBe sure too note any drift in the op-amp output and estimate uncertainties in all measured quanti\nties.\nNow position the beam of rectangular cross-section so that the long dimension of the cross-sec-\ntion is vertical.\nLoad the specimen but again, do not exceed 50 lbs. total.\nRepeat if you deem worthwhile.\nNow position the beam of rectangular cross-section flat on the supports, so that the short dimen\nsion of the cross-section is vertical.\nYou need not record the strain-gage output. (But note any interesting output).\nLoad the specimen.\nbut do not exceed 30 lbs. total.\nWhen done, turn off the power supply but leave all connections as is.\nReport\nStart with a one paragraph executive summary of the purpose, the method, the results of the lab\ntests.\nInclude a short section on experiment proceedure which, rather than reproduce the steps set out\nabove, makes note of any particular difficulties you encountered and how you managed to over\ncome them. Included in this section your op-amp calibration data and your calculation of amplifier\ngain.\nIn your section on \"results\", you will compare experiment with engineering beam theory. The rela\ntionships summarized in the Appendix will allow you to deduce and evaluate:\n-\nThe bending stiffness, EI\n-\nThe bending moment, hence the normal stress, hence the extensional strain\nat the top and bottom of the beams.\n-\nThe deflection as a function of the geometry and bending stiffness.\nFall 2003\nNovember 13, 2003\n\nInclude then in your results:\n-\nA plot of displacement versus load for each of the three beam specimens.1\nPlot also the off center displacement versus midspan load. Show on each plot the\nresults of engineering beam theory.\n-\nPlot the strain at the top (or bottom) versus load for each of the three speci\nmens. Show on each plot the results of engineering beam theory.\n-\nA table showing the bending stiffnesses obtained from the strain measures.\n(From the strain you can compute the curvature. From the load values and\nlengths measured you can compute the bending moment in the mid section. The\nratio is the bending stiffness). Include in the table the \"theoretical values\".\nIn a \"conclusions\" section, include recommendations for improvement of the experience.\n1. We consider the two orientations of the beam of rectangular cross-section as two different beam speci\nmens.\nFall 2003\nNovember 13, 2003\n\nAppendix\nEngineering Beam Theory\nEngineering beam theory shows that the\nmost significant stress is the normal stress\ncomponent on an \"x face\"; σx in the example\nat the right. It is related to the applied loads\nby\nMb ⋅ y\nσ\n= ---------------\nx\nI\nwhere y is the distance from the \"neutral\naxis\" which, for a doubly symmetric beam, is\nat the center of the cross-section and I is the\nmoment of inertia of the cross section.\nI = ∫ y 2 A\nd\nA\nFor a rectangular cross-section of width b\nand height h, this is I = bh3/12\nThe applied loads come in through the bend\ning moment Mb. The convention for positive\nshear and bending moment is shown in the\nfigure.\nThe extensional strain, from the stress/strain\nrelations is just:\nx\na\na\nP\nP\nL\nv\nσx , εx\ny,\nx\ny\nV\nMb\nR\nMb.\nMb.\nε\n= σ ⁄ E\nwhere E is the Elastic Modulus. In terms of the geometry of deformation,\nx\nx\nthe extensional strain is given by εx = -y ⁄ R where R is the radius of curvature of the neutral\naxis. (1/R) is the curvature.\nThe \"bending stiffness\" is defined as the product E I as it appears in the \"moment-curvature\" relation\nEI\n---\nship Mb = (\n) ⋅⎛⎞\nwhere the curvature, for small deflections, is related to the vertical\n⎝⎠\nR\ndisplacement of the neutral axis by, (1/R) = d2v/dx2 .\nAn integration of the differential equation obtained from the moment curvature relation gives, for\nthe case where the beam is loaded as shown, the mid-span deflection\n= - -----------\nv\n⎛ Pa ⎞⋅(3L2 - 4a )\nmidspan\n⎝24EI⎠\nFall 2003\nNovember 13, 2003\n\nx\nWhile this is not required of you, to deter\nmine the displacement at some point other\nL\nthan the mid-span, you can use the relation-\nP\nships below and the superpositioning of two\nv\nsymmetrically placed, loads P, to obtain an\na\nb\nexpression for v(x).\nNote that the origin of the x axis is located at\nthe left end of the beam.\nFor x < a:\nPb\nv x\n( ) = ⎛ -------------⎞⋅[- x + (L2 - b ) ⋅ x]\n⎝ 6LEI⎠\nFor x > a:\nPb\nL\nv x\n--\n-\n( ) = ⎛-------------⎞⋅ ⎛⎞⋅( x\na) - x + (L2 - b ) ⋅ x\n⎝6LEI⎠\n⎝⎠\nb\nLater in the semester we will make use of the program, Fameworks, to model these three beams,\nthen compare the computer results with experiment.\nFall 2003\nNovember 13, 2003\n\nStrain-gage Circuit.\nTwo strain gages are fixed to top and bottom flanges. The top will experience contraction, the bot\ntom extension. The bridge circuit is used to avoid attempting to measure the small difference of\ntwo large numbers and their placement in the bridge effectively doubles the sensitivity. The\nassumption is that the beam shows a doubly symmetric section so the magnitudes of the two\nstrains are equal.\nThe circuit you used in Experiment 3 has been altered to give us the measures we seek.\nThe values of the resistances are:\nVsupply = +10 v\nRa = 348 +/- 5% ohms\nRa\nRg+∆R\nRb\nRpot\ne1\ne2\nRg - ∆R\nRb = 561 +/- 5% ohms\nRg = 350 +/-0.2% ohms\nRpot = 1 kohm (max)\nThe ouput of the bridge as a function of the\nchange in resistance, ∆R,\ne1 - e2 = (Vsupply /2)(∆R/Rg)\nThe strain as a function of change in resistance is\ngiven by\nε = (1/Fgage)(∆R/Rg)\nwhere Fgage is the \"gage factor\" stated by the\nmanufacturer1 to be\nFgage =2.07 +/- 0.5%\nWith these, you can compute the strain in the member, given the voltage difference e1-e2.\nThe voltage difference e1 - e2 is obtained from your measured values at the op-amp output by\ndividing by the amplifier gain.\n1. BLH Electronics, Inc.\nFall 2003\nNovember 13, 2003"
    },
    {
      "category": "Resource",
      "title": "exp7_03.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-105-solid-mechanics-laboratory-fall-2003/2efb80105093e97d5cafa257d08926f2_exp7_03.pdf",
      "content": "1.105 Solid Mechanics Laboratory\nNovember 19, 2003\n1.105 Solid Mechanics Laboratory\nFall 2003\nExperiment 7 Elastic Buckling.\nThe objectives of this experiment are\n-\nTo study the failure of a truss structure due to local buckling of a compres-\nsion member.\n-\nTo compare measurement with theoretical prediction.\n-\nTo again monitor force in one member using a strain gage and an opera-\ntional amplifier and compare with theory.\nThe truss shown will be supported at its four corners and loaded at mid span. Two dial gages will\nbe used to measure nodal displacements in the vertical direction at midspan (front and back). The\nstrain gage instrumentation will measure the strain, and hence the load, in one member of the\ntruss. The truss will be loaded until the top, midspan member \"fails\" due to buckling..\nExperiment Procedure\nUsing your data from Experiment 3, check and record all relevant dimensions of the structure.\nNote: The midspan, top member has been replaced with one of smaller diameter. Make sure you\nmeasure and record this dimension.\nMake sure the structures rests on all four support points. Adjust one of the adjustment screws at\nthe four corners if necessary to eliminate rocking.\nThe bucket should be suspended by an S hook slung on the chain and centering mechanism\nbelow the mid span nodes.\nMake sure you include the stop to limit excessive vertical displacement at the mid span nodes.\nHave the lab instructor check the clearance and adjust if necessary.\na\nb\nc\nd\ne\nf\ng\nh\ni\nDiameter members ab, bc, cd = __________ in.\nArea = ____________ in2\n\nFall 2003\nNovember 19, 2003\nYou will make but one run with the truss loaded at the center nodes.\nInstrumentation Preparation\nInstrument preparation is much the same as it was in Experiment 3. The layout of the circuit board,\nshowing power supply and strain gage connections is repeated here for your convenience.\nstrain gages\nop-amp\nbridge\npot\namp\npot\nV bridge supply\n+6 v\nV+ op amp supply\n+6 v\nV- op amp supply\n-6 v\nstrain gage\ninput\nstrain gage\ninput\ne1\ne2\n(bridge output)\neo op amp output\n\nFall 2003\nNovember 19, 2003\nReport\nThis document will serve as your report. Fill in the tables, plot your results on the formatted but\nempty graphs included, and add explanation and discussion where indicated.\nOp amp Gain\nLoad, Deflection, OpAmp Output Data\nLoad the structure at midspan in the increments shown. Try to keep track of the difference in dis-\nplacement increments once you switch to the red weights to note any deviation from linearity.\ne1-e2\ne0\nGain\nLoad\nDial gages.\nDispl.\ne0\nε, Strain\nForce a\na. The area of the diagonal member is\nAdiag.= __________in2\nlbs.\nx10-3 in\nx10-3 in\nmv\nlb\nBucket\n\nFall 2003\nNovember 19, 2003\nMidspan Load Versus Midspan Displacement\nThe plot above shows the measured load-displacement; it shows also the linear behavior as deter-\nmined from an equivalent 2 dimensional model run on Trussworks2D. (See Appendix).\nAlso shown is the linear behavior of the truss as it was observed in Experiment 3, that is with the\ntop members having the same diameter as all the others.\nThe values of the mid-span, applied load which would produce buckling of the top member bc,\ntreated as a pinned-pinned column and as a pinned-fixed column, are also indicated.\n0 10 20 x 10-3 in\n35 lb\nLOAD\nDISPLACEMENT\n\nFall 2003\nNovember 19, 2003\nDeflected Shape\nSketch the deflected shape at maximum loading conditions.\nDiscussion - Load/Deflection Behavior\n\nFall 2003\nNovember 19, 2003\nMember Force\nWe compare the force in one of the diagonal members, as determined experimentally from the\nstrain gage readings, with the predictions based upon a two-dimensional, matrix truss analysis as\nwe attempted before.\nThe appendix shows how we model the three-dimensional structure as a planar truss. In this, we\nfix the cross sectional area of the diagonal members, 1,3; 2,3; 4,5; etc so that the stiffness of the\ntop node, e.g., #3, in the x and y directions, is identical to that of node a in the fully three dimen-\nsional structure.\nIf we let A3 be the Area of the 3D truss members, then for equivalence\nA2 = 1.089 A3\nIn the same way we attempt to replicate the stiffness of the bottom members of the 3D structure in\nthe horizontal direction by adjusting the cross sectional area of members 1,2; 2,4; ...etc.\nWith these equivalent areas, and the new area of the top members as presented on page 1, a\nTruss2D run was conducted. From the Truss2D results, we find that the force in member 2-5 is\nf2D = _____________ for a midspan load of 30 lbs.\nFrom the appendix, we have that the force in the 3 dimensional structure is related to this value by\nthe following\nf3D = ________ * f2D\nSo the force in the three dimension structure, member fb, for a midspan load of 30 lbs is\nf3D = ________ lbs.\nThe force in member fb was also determined from experiment via strain gage(s) - the last column\non page 3.\nThe plot on the next page shows how the this member force varies with displacement. The experi-\nmental data pairs are shown, so too the linear behavior as obtained from Truss2D.\na\nb\nc\nd\ne\nf\ng\nh\ni\nj\nx\ny\n\nFall 2003\nNovember 19, 2003\nPlot of Member Force against Displacement.\nDiscussion - Member Force, Experiment & Theory.\n0 10 20 x 10-3 in\n35 lb\nMember Force\nDISPLACEMENT\n\nFall 2003\nNovember 19, 2003\n\nFall 2003\nNovember 19, 2003\nAppendix The 2D Truss Model.\nTo model the truss shown as a two dimensional planar truss structure, we need to establish an\nequivalent stiffness for the pairs of diagonal members and for the pairs of bottom members..\n3D Stiffness\nWe redraw the members of interest and their two-\ndimensional equivalent. Motion in the \"z\" direction,\nperpendicular to the xy plane is taken as zero.\nWe want to match the elements of the 2 x 2 stiffness\nmatrix of the 2D model with the elements of the 2 x 2\nstiffness matrix of the 3D structure.\nFor the 3D structure, equilibrium of the node gives\nwhere the member forces are assumed positive in\ntension and the bold indicates I am treating them as\nvectors. (i, j,k are unit vectors in the x, y and z directions respectively). I show also a unit vector,\ntj, lying along the member j but directed oppositely to fj . The unit vector, using the Pythagorean\nformula (twice) is\nSo equilibrium gives\nWe need now the extension of each member for a unit displacement in the x and in the y direc-\ntions. The extension is found by projecting the unit displacement onto the member; the extensions\nof member j due to a unit displacements in the x and y directions are\na\nb\nc\nd\ne\nf\ng\nh\ni\nj\nfj\nY, v\nX,u\n2a\na\nY, v\nX,u\na\na\nf\n3D\n2D\nk3\nk2\nfe\ni\nj\nk\ntj\nf j\nf e\nXi\nYj\n+\n(\n)\n=\n+\n+\nt j\n------- i⋅\n-------\nj\n⋅\n------- k\n⋅\n+\n+\n=\nso\nf j\nf 3D\n---------\n-\ni⋅\nf 3D\n---------\nj\n⋅\n-\nf 3D\n--------- k\n⋅\n-\n=\nand\nf e\nf 3D\n---------\n-\ni⋅\nf 3D\n---------\nj\n⋅\n-\nf 3D\n--------- k\n⋅\n+\n=\nf 3D\n---------\n-\nf 3D\n---------\n-\nX\n+\n=\nand\nf 3D\n---------\n-\nf 3D\n---------\n-\nY\n+\n=\nδj u\n=\n1i\nt j\n-\n-------\n=\n=\nand\nδj v\n=\n1j\nt j\n-\n-------\n=\n=\n\nFall 2003\nNovember 19, 2003\nwhile for member e , for a unit displacement in the x direction and in the y direction respectively\nThe extensions, because of symmetry, just as the member forces, are equal, so we replace the\nmember subscript with the notation \"3D\" and write, for arbitrary displacements u and v\nThe member force, f3D, is related to the member's deformation, δ3D, by\nso equilibrium in terms of the displacements, u and v, becomes\n2D Stiffness\nFor the 2D stand-in, we go thru the same analysis; equilibrium in the x and y directions gives\nwhile compatibility of deformation yields\nand with the same form for force/deformation relation,\nwe put equilibrium in terms of displacement and obtain\nWe see that, in order to make the stiffness of the 2D model equivalent to that of the 3D structure\nwe must have\nδe u\n=\n1i\nt e\n-\n-------\n=\n=\nand\nδe v\n=\n1j\nt e\n-\n-------\n=\n=\nδ3D\n------- u\n⋅\n------- v\n⋅\n+\n=\nf 3D\nk 3D δ\n⋅\n3D\n=\nwhere\nk 3D\nA3E\nL3\n-----------\n=\n2k 3D\n-------------\n⎝\n⎠\n⎛\n⎞\nu\n2k 3D\n-------------\n⎝\n⎠\n⎛\n⎞\nv\n⋅\n+\n⋅\nX\n=\nand\n2k 3D\n-------------\n⎝\n⎠\n⎛\n⎞\nu\n2k 3D\n-------------\n⎝\n⎠\n⎛\n⎞\nv\n⋅\n+\n⋅\nY\n=\nf 2D\n---------\n-\nX\n+\n=\nand\nf 2D\n---------\n-\nY\n+\n=\nδ2D\n------- u\n⋅\n------- v\n⋅\n+\n=\nf 2D\nk 2D δ\n⋅\n2D\n=\nwhere\nk 2D\nA2E\nL2\n-----------\n=\nk 2D\n----------\n⎝\n⎠\n⎛\n⎞\nu\nk 2D\n----------\n⎝\n⎠\n⎛\n⎞\nv\n⋅\n+\n⋅\nX\n=\nand\nk 2D\n----------\n⎝\n⎠\n⎛\n⎞\nu\nk 2D\n----------\n⎝\n⎠\n⎛\n⎞\nv\n⋅\n+\n⋅\nY\n=\nk 2D\n----------\n2k 3D\n-------------\n=\nor\n2---\nA2E\nL2\n-----------\n⋅\n3---\nA3E\nL3\n-----------\n⋅\n=\nwhere\nL2\n2 a\n⋅\n=\nL3\n3 a\n⋅\n=\n\nFall 2003\nNovember 19, 2003\nwhich, when we substitute for the lengths, gives for the ratio of the areas\nThere remains the question - How to interpret the results for the member force computed in the 2D\nmodel? What we need is the ratio of f3D to f2D for the same displacement set u and v. This is\nobtained from the force/deformation relations, expressing the deformations in terms of the dis-\nplacements. We have\nwhich gives\nor, finally\nA2\nA3\n------\n⋅\n⋅\n--------------\n=\nor\nA2\n1.089 A3\n⋅\n=\nf 3D\nk 3D\n----------\nu\nv\n+\n(\n)\n⋅\n=\nand\nf 2D\nk 2D\n----------\nu\nv\n+\n(\n)\n⋅\n=\nf 3D\nf 2D\n---------\n-------\nk 3D\nk 2D\n----------\n⋅\n=\nor\nf 3D\n------- 3\n4--- f 2D\n⋅\n⋅\n=\nf 3D\n0.612 f 2D\n⋅\n=\n\nFall 2003\nNovember 19, 2003\nTruss2d Model\nHere is the results of a Truss2D model of the three dimensional structure with the top member\nareas now reduced to .0069 in2.\nNODE COORDINATES DISPLACEMENTS\nx y u v\nin in in in\n======== ======== ======== ======== ========\n1 .000E+00 4.000E+00 -5.747E-04 0.000E+00\n2 1.200E+01 4.000E+00 -4.310E-04 -6.679E-03\n3 8.000E+00 8.000E+00 2.399E-03 -3.412E-03\n4 2.000E+01 4.000E+00 0.000E+00 -1.039E-02\n5 1.600E+01 8.000E+00 1.199E-03 -8.748E-03\n6 2.800E+01 4.000E+00 4.310E-04 -6.679E-03\n7 2.400E+01 8.000E+00 -1.199E-03 -8.748E-03\n8 3.600E+01 4.000E+00 5.747E-04 0.000E+00\n9 3.200E+01 8.000E+00 -2.399E-03 -3.412E-03\nNODE APPIED LOADS REACTIONS\nFx Fy Fx Fy\nlb lb lb lb\n======== ======== ======== ======== ========\n1 0.000E+00 0.000E+00 0.000E+00 1.500E+01\n2 0.000E+00 0.000E+00 0.000E+00 0.000E+00\n3 0.000E+00 0.000E+00 0.000E+00 0.000E+00\n4 0.000E+00 -3.000E+01 0.000E+00 0.000E+00\n5 0.000E+00 0.000E+00 0.000E+00 0.000E+00\n6 0.000E+00 0.000E+00 0.000E+00 0.000E+00\n7 0.000E+00 0.000E+00 0.000E+00 0.000E+00\n8 0.000E+00 0.000E+00 0.000E+00 1.500E+01\n9 0.000E+00 0.000E+00 0.000E+00 0.000E+00\n\nFall 2003\nNovember 19, 2003\nLENGTH PROPERTIES\ni-j A E\nin in2 psi\n1-2 8.000E+00 2.880E-02 2.900E+07\n1-3 5.657E+00 1.336E-02 2.900E+07\n2-3 5.657E+00 1.336E-02 2.900E+07\n2-4 8.000E+00 2.880E-02 2.900E+07\n2-5 5.657E+00 1.336E-02 2.900E+07\n3-5 8.000E+00 6.900E-03 2.900E+07\n4-5 5.657E+00 1.336E-02 2.900E+07\n4-6 8.000E+00 2.880E-02 2.900E+07\n4-7 5.657E+00 1.336E-02 2.900E+07\n5-7 8.000E+00 6.900E-03 2.900E+07\n6-7 5.657E+00 1.336E-02 2.900E+07\n6-8 8.000E+00 2.880E-02 2.900E+07\n6-9 5.657E+00 1.336E-02 2.900E+07\n7-9 8.000E+00 6.900E-03 2.900E+07\n8-9 5.657E+00 1.336E-02 2.900E+07\nTENSILE TENSILE\ni-j FORCE STRESS\nlb psi\n======== ======== ========\n1-2 1.500E+01 5.208E+02\n1-3 -2.121E+01 -1.588E+03\n2-3 2.121E+01 1.588E+03\n2-4 4.500E+01 1.562E+03\n2-5 -2.121E+01 -1.588E+03\n3-5 -3.000E+01 -4.348E+03\n4-5 2.121E+01 1.588E+03\n4-6 4.500E+01 1.562E+03\n4-7 2.121E+01 1.588E+03\n5-7 -6.000E+01 -8.696E+03\n6-7 -2.121E+01 -1.588E+03\n6-8 1.500E+01 5.208E+02\n6-9 2.121E+01 1.588E+03\n7-9 -3.000E+01 -4.348E+03\n8-9 -2.121E+01 -1.588E+03\n\nFall 2003\nNovember 19, 2003\nEuler Buckling Loads\nThe Euler Buckling Loads for a column with different boundary conditions are shown in the figure.\nFor a circular cross section of radius r I = πr4/4.\nPcrit. = π2EI/L2\nPcrit. = 20.2EI/L2\n.\npinned pinned\nfixed pinned\nfixed fixed\nPcrit. = 4π2EI/L2\n.\n\nFall 2003\nNovember 19, 2003\nStrain-gage Circuit Analysis\nTwo strain gages are fixed to one of the members. They both will measure the extension or con-\ntraction along the length. A bridge circuit is used to avoid attempting to measure the small differ-\nence of two large numbers and their placement in the bridge also should eliminate the effects of\nbending - although we anticipate that to be small.\nThe values of the resistances are:\nRa = 352 +/- 5% ohms\nRb = 561 +/- 5% ohms\nRg = 350 +/-0.2% ohms\nRpot = 1 kohm (max)\nThe ouput of the bridge as a function of the\nchange in resistance, ∆R,\ne1 - e2 = (Vsupply /2)(∆R/Rg)\nThe strain as a function of change in resistance is\ngiven by\nε = (1/Fgage)(∆R/Rg)\nwhere Fgage is the \"gage factor\" stated by the\nmanufacturer1 to be\nFgage =2.07 +/- 0.5%\nWith these, you can compute the strain in the member, given the voltage difference e1-e2.\nThe voltage difference e1 - e2 is obtained from your measured values at the op-amp output by\ndividing by the amplifier gain.\n1. BLH Electronics, Inc.\nRg+∆R\nRg+∆R\nRa\nRb\nRpot\nVsupply\ne1 e2"
    }
  ]
}