{
  "course_name": "Soviet and Post-Soviet Politics and Society, 1917 to the Present",
  "course_description": "This course explores the political and historical evolution of the Soviet state and society from the 1917 Revolution to the present. It covers the creation of a revolutionary regime, causes and nature of the Stalin revolution, post-Stalinist efforts to achieve political and social reform, and causes of the Soviet collapse. It also examines current developments in Russia in light of Soviet history.",
  "topics": [
    "Humanities",
    "History",
    "European History",
    "Military History",
    "Society",
    "European and Russian Studies",
    "Humanities",
    "History",
    "European History",
    "Military History",
    "Society",
    "European and Russian Studies"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nPrerequisites\n\nThere are no prerequisites for this course.\n\nCourse Description\n\nAs Russian President Vladimir Putin once said, \"Whoever does not miss the Soviet Union has no heart. Whoever wants it back has no brain.\" But what was the Soviet Union? How did it develop out of Imperial Russia? What happened in the Russian Revolution? What were the various efforts at reform, sometimes moderate (the New Economic Policy), sometimes violent (the purges of the 1930s)? How did the country deal with WWI and WWII? How did it deal with nationalities? What led to the rapid transformation under Gorbachev and the breakup of the USSR in 1991? How has the country continued to evolve under Yeltsin and Putin?\n\nThis course is a\nCI-H\nclass (category S). Accordingly, students will write three papers over the course of the semester: 1\nst\npaper (4-5 pages) due during\nSession 6\n; rewrite due during\nSession 10\n; 2\nnd\npaper (3-5 pages), due during\nSession 16\n; and 3\nrd\npaper (15 pages), due during\nSession 21\n. You will also have a short written outline due on the Putin and symbolic politics due during\nSession 25\n(2 pages).\n\nThe class will be broken into roughly six subgroups (three persons each). In your subgroups you will be responsible for one area of Soviet (and later post-Soviet life) and will regularly post interesting articles you find relating to your area to the class website. These articles may also form the basis of your final paper.\n\nGrading Policy\n\nACTIVITIES\n\nPERCENTAGES\n\nAttendance, participation, and postings to the class website\n\n15%\n\nDebate and oral reports on your research\n\n5%\n\nPaper 1\n\n20%\n\nPaper 2\n\n20%\n\nPaper 3\n\n30%\n\nTwo-page outline on Putin's symbolic politics\n\n10%\n\nFor more information on the class activities, see the\nAssignments\nsection.\n\nPolicy on Academic Integrity\n\nPlagiarism and other forms of academic dishonesty are serious offenses and will be dealt with according to MIT policy and procedures. All students are expected to be familiar with MIT's policies and guidelines on academic integrity as outlined in\nAcademic Integrity at MIT: A Handbook for Students\n. Please review all the guidelines in the handbook, including the information on responsible paraphrasing.\n\nRequired Text\n\nFitzpatrick, Sheila.\nThe Russian Revolution\n. 3rd edition. Oxford University Press, 2008. ISBN: 9780199237678. [Preview with\nGoogle Books\n]\n\nJenks, Andrew L.\nThe Cosmonaut Who Couldn't Stop Smiling: The Life and Legend of Yuri Gagarin\n. Northern Illinois University Press, 2013. ISBN: 9780875806990.\n\nLedeneva, Alena V.\nHow Russia Really Works: The Informal Purchases That Shaped Post-Soviet Politics and Business\n. Cornell University Press, 2006. ISBN: 9780801473524. [Preview with\nGoogle Books\n]\n\nSakwa, Richard, ed.\nThe Rise and Fall of the Soviet Union, 1917-1991 (Routledge Sources in History)\n. Routledge, 1999. ISBN: 9780415122900.\n\nWeinberg, Robert, and Laurie Bernstein.\nRevolutionary Russia: A History in Documents (Pages from History)\n. Oxford University Press, 2010. ISBN: 9780195337945.\n\nWood, Elizabeth A., William E. Pomeranz, et al.\nRoots of Russia's War in Ukraine\n. Woodrow Wilson Center Press / Columbia University Press, 2015. ISBN: 9780231704533. [Preview with\nGoogle Books\n]\n\nFor details on the course readings, see the table in the\nReadings\nsection.",
  "files": [
    {
      "category": "Resource",
      "title": "21H.245J Soviet and Post-Soviet Politics and Society - Advice on Writing for Paper 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-245j-soviet-and-post-soviet-politics-and-society-1917-to-the-present-spring-2016/57612fcd30a54e96fb7a416d05213ade_MIT21H_245JS16_Paper1Advic.pdf",
      "content": "Advice on Writing\nWhat to look for in your paper\n-\nTitle: Does your title have an argument? Will it make me want to read the paper?\n\n-\nArgument: Have you carefully formulated your argument in the first paragraph? Making sure your argument is\nclear and well-formulated will help you in all the rest of your writing.\n\n-\nBackground: Does your paper have the right amount of background but not too much? You can assume that I\nknow the basics about the Russian revolutionary events so you do not need to repeat them.\n\n-\nEvidence: Does your evidence clearly support your argument? Have you carefully read the primary sources\navailable and chosen a few that support your argument? This is the second most important part of the paper\n(after the argument). Be sure to quote them judiciously (i.e., not excessively), providing careful analysis to\nexplain what they show. You should have from one to three or four primary sources, depending on their length\nand complexity. You will also want to consult one or two secondary sources (i.e., articles by historians) for this\npaper to supplement your understanding of your main character and/or the problem they were grappling with.\n\n-\nVerb tenses: Have you used consistent verb tenses, with past tenses for actions in the past and present tense\nfor what any authors you quote are saying/writing/expressing?\n\n-\nCitations: Are they clear and complete? They do not have to be in a particular style, but you must give the full\nname of the document, its author and date, and page number.\n\n-\nParagraphs and transitions: are they clear so that each paragraph has a dominant idea and the transitions\nbetween them are easy to follow?\n\n-\nBe careful of sweeping generalizations: Have you tried to say more than you can provide evidence for?\nSuggestions for rewriting\n\nBe sure to state your argument clearly and persuasively in your opening paragraph. Reread and perhaps even\nrewrite that paragraph after you have finished the entire draft of your paper. It is the most important paragraph in your\npaper. Be sure you have not overstated your argument. Be sure as well that you have not understated it in the sense of\nsaying something that is so obvious as to be uninteresting. Be sure it is logical and not so equivocal that it becomes\nmeaningless. Here is an example of a problematic thesis statement: \"Lenin used logical fallacies, but he was a great\nwriter.\" What do you mean by \"great writer\"? How can the second part of the sentence square with the first part?\n\nI would recommend rereading your sources now that you have a first draft. Have you captured the drama of the\nlanguage? What assertions in them can you analyze in more depth, especially questions of word use, phrasing, diction?\n\nTry to reread your whole paper, watching for word use and grammar. You may want to read your paper out\nloud. That is how I catch a lot of my own mistakes.\n\nAlso, reread the first sentences of each of your paragraphs. Do they progress logically, building from one point\nto the next? A couple of you had trouble trying to pack completely unrelated points into the same paragraph. Also\n\ntypically it is best to construct your paragraphs so they progress forward chronologically. Occasionally you may need a\nflashback to make your point. Try to make it as clear as possible.\n\nTry also to put your points in order of importance. I often outline my articles before I write them so I can be\nsure of the order in which I am writing. And, believe it or not, I often outline or re-outline them in mid-stream if I think I\nhave gone astray.\n\nBe very careful of redundancy and repetition. I usually pick up on your point the first time.\nTry to avoid what I would call fillers, e.g., empty phrases that you have not fully thought through: \"History was\nmoving on.\" \"The Russian Revolution was one of the most momentous events of the 20th century.\"\n\nIt is usually better to paraphrase than to quote from secondary sources. Once in a great while it can be useful to\nuse a quotation to convey an author's exact phrasing if he or she has said something particularly noteworthy, but that is\nrare.\nSome classic grammar points\n\nProvisional Government - both words should be capitalized\n\nbourgeoisie - collective noun; bourgeois - adjective (not a noun!)\n\n\"it's\" means \"it is\"; \"its\" is the grammatical equivalent of \"his\" and \"her.\"\n\nBe careful of excessively colloquial language. Words to throw out: thing; stuff; people; really.\nAlso avoid \"natural\" and \"inevitable\" - nothing is entirely natural or inevitable from a historian's point of view.\nAvoid \"very\" and exclamation points if at all possible. Contractions are also too colloquial.\nMost evaluative words can be thrown out: even good and bad, but definitely wonderful, fabulous, awesome.\nBe careful with the word \"however.\" It has to be used in a complete phrase and it has to be separated from the\npreceding complete phrase by a semi-colon or a period. Phrases beginning with \"while\" cannot be used on a stand-alone\nbasis (e.g., \"while he was writing his paper, he had a great insight\" - is fine; but \"While writing his paper\" by itself is not\nokay).\n\nAvoid passive voice: ask yourself who was acting, what was happening? Instead of \"the people were influenced\nby Lenin,\" try to think about whether you mean \"the people allowed themselves to fall under Lenin's influence\" or\n\"Lenin persuaded the people,\" and then ask yourself which people you have in mind. Do you mean workers or peasants\nor members of the intelligentsia, for example? Or do you mean members of the Central Committee of the Communist\nParty?\n\nFinally, let me make a pitch for proofreading, proofreading, proofreading. I grow tired of seeing grammar\nmistakes that could easily have been avoided. Sometimes I have to guess what students mean. I want to know what\nyou really mean. Consider me a very positive reader. I like reading your papers. I enjoy seeing your arguments, your\nideas, your ways of thinking and phrasing. Do your best!\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n21H.245J / 17.57J / 21G.086J Soviet and Post-Soviet Politics and Society, 1917 to the Present\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "21H.245J Soviet and Post-Soviet Politics and Society - Paper 1: Revolutionary Year, 1917",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-245j-soviet-and-post-soviet-politics-and-society-1917-to-the-present-spring-2016/01f505a983d71571b3e477e2f5815b49_MIT21H_245JS16_Paper1.pdf",
      "content": "Paper No. 1 - The Revolutionary Year, 1917\n\nThe Russian Revolutions of February and October 1917 have been extensively\nresearched by a wide range of scholars so we now have elaborate chronologies of what\nhappened on a day-by-day basis. Through concerted efforts scholars have collected primary\ndocuments in the form of letters, petitions, diary entries, and the like.\n\nYour mission will be to consult the volumes listed below, some of which are available\non the Internet. You will each find from one to three documents [depending on their length]\nthat you think particularly vividly describe the viewpoint of an individual from one of the\nfollowing social groups:\n\na) Royal family/nobility - Sources: the Alexander Time Machine,\nhttp://www.alexanderpalace.org/palace/. Mark Steinberg, The Fall of the Romanovs,\n1995. Marie, Grand Duchess of Russia, 1890-1958. Education of a princess, a memoir\nNY, 1930.\nb) Mikhail Rodzianko -leading Octobrist; noble; chair of the Fourth Duma and the first\nProvisional Committee of the State Duma; played a major role in the abdication of Tsar\nNicholas II [writings in Browder & Kerensky;\nhttp://www2.stetson.edu/~psteeves/classes/rodzianko.html; The reign of Rasputin: an\nempire's collapse: Memoirs of M. V. Rodzianko [1927?]. See also SAC, esp.\nhttp://pages.uoregon.edu/kimball/sac.1904.1917.htm#1912fe26.\nc) Alexander Guchkov - leader of the Octobrist Party; from a merchant family [SAC]\nd) Nationalist monarchist Vasilii Shul'gin, close to main events, wrote memoirs. SAC\nGRH:258-77, 407-410 |Excerpted TXT].\ne) General Mikhail Vasil'evich Alekseev, Tsarist Chief of Staff [sources in McC2 (below);\nGRH, Chamberlin; see SAC]\nf) Pavel Miliukov - leading Kadet, historian. See SAC and refs to GRH, 323:24, 333-34,\nMcC2: 45-47. Author, The Russian Revolution. 1978, and Political memoirs, 1905-\n1917. 1967. In Russian Istoriia vtoroi russkoi revoliutsii. Tom I, vyp. 1-3.\ng) Ariadna Tyrkova - leading Kadet, feminist, journalist, elected to the Petrograd city\nDuma. Author, From liberty to Brest-Litovsk, the first year of the Russian revolution,\nand Na putiakh k svobode. Excerpt on \"The Emancipation of Women\" in Russian\nWomen, 1698-1917.\nh) Prince Georgii L'vov - first head of the Provisional Government, SAC, GRH 396-97\ni) Alexander Kerensky - author, The Kerensky memoirs: Russia and history's turning\npoint. 1966. The prelude to bolshevism; the Kornilov rising. 1919, and\nhttp://www.archive.org/details/preludetobolshev008537mbp. Also SAC; Browder and\nKerensky.\nj) V. D. Nabokov (father of the novelist), leading Kadet, served in the Chancellery of the\nProvisional Government: V. D. Nabokov and the Russian Provisional Government,\n1917. 1976.; also shorter documents in Browder and Kerensky\nk) N.S. Chkheidze - head of the Soviet; Georgian Social Democrat SAC\nl) Irakli Tsereteli, chair of the Petrograd Soviet after Chkeidze; also a Georgian SD\nm) N.N. Sukhanov, SR, author of The Russian Revolution, a vivid memoir,; or selections in\n\nThe Russian revolution; an anthology, edited by M. K. Dziewanowski. New York,\nCrowell [1970].\nn) Eduard Dune, skilled worker, joins the Red Guards; Notes of a Red Guard / Eduard M.\nDune; translated and edited by Diane P. Koenker and S.A. Smith. Urbana [Ill.]\nUniversity of Illinois Press, 1993.\no) Sergei Melgunov, historian; aristocrat; opponent of the Bolshevik seizure of power; The\nred terror in Russia / by Sergey Petrovich Melgounov. Westport, Conn. : Hyperion\nPress, 1975.\np) Martov, Yulii, Menshevik. In Russian: Obshchestvennoe dvizhenie v Rossii v nachalie\nXX-go vieka / Pod red. L. Martova, P. Maslova i A. Potresova. S.-Peterburg, Tip. T-va\n\"Obshchestvennaia polza,\" 1909-14. [try ch section called \"Главнеишие моменты\"].\nAkselrod, P. B. (Pavel Borisovich), 1850-1928. Pisma P. B. Aksel'roda i IU. O.\nMartova. 1967.\nIn English: some documents in Bunyan and Fisher (below)\nq) Lenin: http://marxists.org/archive/lenin/works/index.htm\nspecifically those for 1917: http://marxists.org/archive/lenin/works/date/1917.htm\nr) Trotsky: http://marxists.org/archive/trotsky/works/index.htm\ns) Stalin: http://marxists.org/reference/archive/stalin/works/decades-index.htm\nt) Alexandra Kollontai, the most prominent female member of the Bolshevik Party and a\ngifted agitator - http://www.marxists.org/archive/kollonta/index.htm\nu) Nikolai Bukharin, one of the youngest members of the inner circle of Bolsheviks; very\ninterested in theoretical implications of the revolution -\nhttp://www.marxists.org/archive/bukharin/library.htm\nv) General Lavr Kornilov, appointed commander in chief by Kerensky, July 18. SAC\nw) Nikolai Podvoiskii, report on the military organization of the Social Democratic Party,\nSAC; report in The Russian Revolution, edited by Robert V. Daniels, 37-41 [see below].\nx) Petr Garvi, SD - Garvi, Petr A. (Petr Abramovich), 1881-1944. Title: Vospominaniia\nsotsialdemokrata : stati o zhizni i deiatelnosti P.A. Garvi / 1946\n\nAnalyzing your documents\n\nOnce you have found a document that you think is particularly interesting, your job will\nthen be to study it closely, keeping in mind as well the other documents we have been reading\nfor the course and other documents available from the time. If you would like to study a pair of\ndocuments that either take complementary or opposing points of view, that is also fine. Or it\ncould be two documents that show change in views over time. If you find a source that is, say,\na whole book, choose one chapter for close analysis. In creating your analysis, I would like\nyou to consider the following questions (though not necessarily in this order):\n\n- Who is the author addressing? How did they choose the person(s) to whom they are\nwriting? Is this a diary, a memoir, a letter, a petition, a newspaper article, a polemic?\nHow does their choice of audience affect what they have to say?\n\n- What does the document tell you about the author's understanding of the nature of\npower [vlast'] and authority at this time? What does he/she think about revolution\nitself? Do they discuss \"democracy,\" \"the people,\" \"the state\"? Are they pro- or anti-\nmonarchist, pro- or anti-Bolshevik? This is by no means an exhaustive list of possible\npoints of view. Pay close attention. Some may be subtle.\n\n- What kind of language is your subject using? Think about both phrasing and tone. Are\nthey deferential or defiant? How do they refer to third parties? Is their language formal\nor informal? Do you see signs of religious language and/or language that strikes you as\nparticular to a social estate?\n\n- What is the significance of your document(s)? How do you think it fits in the context of\nother documents from the same time? Is the author being polemical (i.e., arguing with\nothers)? Is he/she using emotional language to appeal to others?\n\n- What do you know about the author(s) of this document? Are there relevant\ndemographic factors that affect the person's perspective (social class, geographic\nlocation, sex, age, position in the revolutionary government)?\n\n- What does this document tell you overall about the problems of authority and social\nchange in this tumultuous period in Russian history?\n\nYour paper\n\nYour paper should be roughly 4-5 pages long, double-spaced, with normal margins, and\nshould carefully analyze everything you know about this source and the context in which it was\nwritten. You will need to consult at least one scholarly article through Google Scholar to find\nout a bit more about your author and their perspective. Most of your analysis should be your\nown close reading of the document, but the question of context is also crucial. You must\ncarefully footnote any research findings that you make. I expect you to footnote at least two\nsecondary articles by historians.\n\nYou will submit your paper on the class site during Session 6, as well as bringing two\ncopies to class that day.\n\nNote on grading\n\nPlease note that you will be graded on both this first draft and on your rewrite. I will\nthen average the grades of the two drafts. If you receive an A on your first draft, it will mean\nthat you probably will have only a few cosmetic changes to make to your paper. If you receive\nanything less than a full A, I will expect you to make serious revisions to your paper. If you\nfail to make improvements, your second grade can go down. Your final grade for this paper\nwill be an average of the two grades. This means you have every incentive to write an A paper\nfrom the beginning. I want to warn you, though, that I tend to be quite tough on this first paper\nas it is our best moment to think about how to write like historians. So please be prepared to\nreceive some serious criticism. I give very few A's on this paper precisely so I can encourage\nyou to think and write like historians.\n\nMeeting for discussion\n\nDuring Session 6, we will devote the bulk of our class time to discussing our sources\nand papers in pairs and small groups. Please remember that one of the most important rules of\nfeedback is always to look for ways to help. This means a) accentuating what is already good;\nb) helping the writer to see the argument she or he may have embedded in the paper but which\nhas not fully come out yet; c) offering constructive criticism in the most supportive manner\npossible.\n\nCreating the website\nYour revised essay will be due on during Session 10. I am not yet sure whether we will\nbe able to add these papers to the class website, but I would like to do so if we can. Hence, I\nwould particularly like you to write your paper with hyperlinks to both the scholarly articles\nand any other primary documents that are on line. When you turn in your paper during Session\n6, you must also turn in a scan of your primary document (try to get the best quality you can).\nYou should then scan or link to any additional documents (including secondary sources) for\nSession 10.\n\nYou must provide accurate and detailed bibliographical information for all sources that\nyou use. Any attempts at plagiarism are completely unacceptable and will be found out. This\nis going to be a public website and any use of other's materials without attribution is\ncompletely unacceptable. Any attempts to plagiarize will prompt a failing grade on this\nassignment and a warning in the person's file at MIT.\n\nI also want to strongly recommend that you consider visiting the Writing and\nCommunication Center for help at any stage with your writing. They offer free, one-on-one,\nprofessional advice from lecturers who are published writers about all types of academic,\ncreative, and professional writing and about all aspects of written and oral presentations.\n\nCollective goal\nOur collective goal will be to develop a composite picture of 1917 from a variety of\npolitical and estate perspectives. If possible, we will also add to the timeline in ways that show\nsome of the enormous variation among the complaints and demands of each of these groups\nand the ways in which their demands changed over time. Each of you will be providing\nanalysis of one small document or a pair of documents in ways that will add to the viewers'\nunderstanding of the revolution and how it developed over time. Visitors to our timeline will\nbe able to read both \"across\" the documents to follow a particular line of development (e.g., the\nmutiny of the soldiers, the uprisings of the peasants, and so on) and \"down\" the document (i.e.,\nat a particular moment time).\nPrimary sources in print form\nJonathan Daly and Leonid Trofimov, Russia in War and Revolution, 1914-1922\n(Indianapolis/Cambridge: Hackett Publishing, 2009)\nMark D. Steinberg, Voices of Revolution, 1917 (New Haven, CT : Yale University Press, 2001)\nEdward Acton and Tom Stableford, eds., The Soviet Union: A Documentary History (2005)\nRobert P. Browder and Alexander F. Kerensky, The Russian Provisional Government, 1917:\nDocuments (Stanford University Press, 1961) [partially available on line]\nhttp://books.google.com/books?id=LzWsAAAAIAAJ&dq=browder+kerensky+russian+provisi\nonal+government&printsec=frontcover&source=bl&ots=DSY1VAMI6G&sig=90rIUDyQLauL\nsvwtRXDCYMB0k&hl=en&ei=IZdDS_7UEdPN8QaD0_CDBQ&sa=X&oi=book_result&ct=r\nesult&resnum=5&ved=0CBoQ6AEwBA#v=onepage&q=&f=false\nV. P. Butt, ed., The Russian Civil War: Documents from the Soviet Archives (New York: St.\nMartin's Press, 1996)\nMartin McCauley, ed., The Russian Revolution & the Soviet State, 1917-1921: Documents\n(New York: Barnes & Noble, 1975) [McC2]\nRonald Grigor Suny, ed., The Structure of Soviet History. Essays and Documents (Oxford\nUniversity Press, 2003), esp. pp. 32-39, 42-48 [documents by Kerensky, Tsereteli, Lenin]\nOther Primary Sources and Websites with Primary Documents from this Period\nJames Bunyan and H. H. Fisher. The Bolshevik revolution, 1917-1918; documents and\nmaterials. 1961, c1934].\nRobert V. Daniels, ed., The Russian Revolution. 1972.\nGolder, Frank Alfred, 1877-1929. Documents of Russian history, 1914-1917. Transl. Emanuel\nAronsberg. Gloucester, Mass., P. Smith, 1964 [c1927] [GRH]\n\nMichael C. Hickey, Competing voices from the Russian Revolution .\n\n\"The Russian Revolution\" - http://www.barnsdle.demon.co.uk/russ/rusrev.html\n\nhttp://www.historyguide.org/europe/rusrev_links.html\n\nhttp://www.fordham.edu/halsall/mod/modsbook39.html\n\nNicholas II's 1917 diaries and letters, as well as those of other members of the royal family;\nNicholas II's abdication; the order for his arrest; interrogation of some members of the royal\ncourt in 1917: http://www.alexanderpalace.org/palace/\n\nThe All-Russian Congress of Soviets: http://www.marxists.org/glossary/events/a/arcs.htm\n\nWorld War I documents relating to Russia:\nhttp://wwi.lib.byu.edu/index.php?title=Special%3ASearch&search=russia&go=Go\nincluding the Abdication of Nicholas II:\nhttp://wwi.lib.byu.edu/index.php/The_Abdication_of_Nicholas_II\n\n\"Face of Russia\" (PBS timeline) http://www.pbs.org/weta/faceofrussia/timeline-index.html\n\n\"Seventeen Moments in Soviet History\" http://www.soviethistory.org/ [You have to register to\nuse this site, but it is free and has many useful primary documents, including some film clips\nand art as well as political manifestoes and the like.]\n\nOn-Line Chronologies of the Russian Revolution\n\nhttp://pages.uoregon.edu/kimball/sac.1917.1920.htm - \"Students' Annotated Chronology\"\n\nhttp://www.barnsdle.demon.co.uk/russ/datesr.html\nhttp://europeanhistory.about.com/od/russiaandukraine/a/rrevstimeline1.htm\nhttp://en.wikipedia.org/wiki/Russian_Revolution_(1917)\nhttp://www.indopedia.org/Russian_Revolution_of_1917.html#Brief_Chronology_leading_to_R\nevolution_of_1917\nhttp://www.marxists.org/history/ussr/events/timeline/1917.htm\nhttp://web.archive.org/web/19991103122911/www.departments.bucknell.edu/russian/chrono3.\nhtml\n\nBibliography of Secondary Sources\nEdward Acton et al., eds., Critical Companion to the Russian Revolution 1914-1921 (Indiana\nUniversity Press, 1997)\nJames H. Bater, Studies in Russian Historical Geography\nEdward Hallett Carr, The Bolshevik Revolution (3 vols.) (1950-1978)\nWilliam Chamberlin, The Russian Revolution (2 vols.) (1935)\nOrlando Figes, A People's Tragedy, The Russian Revolution 1891 - 1924 (Pimlico, 1996)\nOrlando Figes, Peasant Russia, Civil War: The Volga Countryside in Revolution, 1917-1921\n(Oxford University Press, 1989)\n------ and Boris Kolonitskii, Interpreting the Russian Revolution: The Language and Symbols of\n1917 (Yale University Press, 1999)\nSheila Fitzpatrick, The Russian Revolution (Oxford University Press, 1982, 2008)\nAnna Geifman, Russia Under the Last Tsar: Opposition and Subversion, 1894-1917\nAnna Geifman, Thou Shalt Kill: Revolutionary Terrorism in Russia, 1894-1917 (1993)\nDaniel H. Kaiser, ed., The Workers' Revolution in Russia, 1917: The View from Below\n(Cambridge University Press, 1987)\nJ.L.H. Keep, The Russian Revolution\nDavid Mandel, The Petrograd Workers and the Soviet Seizure of Power: From the July Days,\n1917 to July 1918 (Studies in Soviet History and Society)\nMartin A. Miller, The Russian Revolution: The Essential Readings (Blackwell Essential\nReadings in History)\nBernard Pares, The Fall of the Russian Monarchy (1939)\nRichard Pipes, The Russian Revolution (Vintage, 1991)\n------, Three Whys of the Russian Revolution (Pimlico, 1995)\nAlexander Rabinowitch, The Bolsheviks Come to Power: The Revolution of 1917 in Petrograd\n(NY: Norton, 1976)\n-------. Prelude to Revolution. The Petrograd Bolsheviks and the July Revolution\n(Bloomington: Indiana Univ. Press, 1968)\nM. Rendle, Defenders of the Motherland: The Tsarist Elite in Revolutionary Russia (2009)\nHarold Shukman, ed., The Blackwell Encyclopedia of the Russian Revolution (1988)\nRobert C. Tucker, Stalin as Revolutionary, 1879-1929 (1973)\nAdam B. Ulam, The Bolsheviks (1965)\nDmitri Volkogonov, Lenin: a New Biography (1994)\nRex A. Wade, The Russian Revolution, 1917 (Cambridge, 2000)\nAlan Wildman, The End of the Russian Imperial Army (Princeton University Press, 1980)\nBertram D. Wolfe, Three Who Made a Revolution: A Biographical History (1948,1964)\nAlan Wood, The Origins of the Russian Revolution (Routledge, 2003)\nThe Longman Companion to Imperial Russia 1689 - 1917 by David Longley\nThe Longman Companion to Russia since 1914 by Martin McCauley\nhttp://cominganarchy.com/2009/06/02/political-geography-of-the-russian-revolution/\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n21H.245J / 17.57J / 21G.086J Soviet and Post-Soviet Politics and Society, 1917 to the Present\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "21H.245J Soviet and Post-Soviet Politics and Society - Paper 2: Final Paper Research Proposal",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-245j-soviet-and-post-soviet-politics-and-society-1917-to-the-present-spring-2016/72aa9d7605a699da11319dad712f1abe_MIT21H_245JS16_Paper2.pdf",
      "content": "21H.245J/17.57J\n\nPaper #2\n\nYour second paper will be a research proposal (3-5 pages) for your final paper (see Paper #3\nprompt). This will be due during Session 16. In this research proposal you will include several elements:\n-\nA one-paragraph statement of your topic, indicating what you will be researching, the years your\ntopic will cover, and perhaps who will be some of the central figures.\n-\nA second paragraph indicating the key questions you hope to be able to answer in your paper.\nWhat makes this topic inherently interesting? What can it tell us about how Russia works? Can\nyou see parallels to key Soviet policies, events, and developments?\n-\nYour third paragraph should consider your proposed argument. What do you think will make this\ntopic interesting and provocative? Try to make a gainsayable hypothesis, i.e., one that could be\ndisproved if other scholars found confounding evidence. (We will discuss this in class.)\n-\nThe next section of the paper will discuss the types of sources you will use for your paper and\nhow you will find them. (I understand that almost all of you will have to use English language\nmaterials. That is fine.)\n-\nThe final section will contain a bibliography of some of your primary and secondary sources (we\nwill discuss this in class) with annotations indicating what the main ideas they contain.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n21H.245J / 17.57J / 21G.086J Soviet and Post-Soviet Politics and Society, 1917 to the Present\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "21H.245J Soviet and Post-Soviet Politics and Society - Paper 3: Current Events and Their Historical Roots",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-245j-soviet-and-post-soviet-politics-and-society-1917-to-the-present-spring-2016/6efbfd9e0a0a243aa6f9b8b846bae15a_MIT21H_245JS16_Paper3.pdf",
      "content": "21H.245J/17.57J\n\nThird Paper Topic - Current Events and Their Historical Roots\n\nYour mission is to pick a current event or phenomenon (1999 to the present) and show both its\nsignificance and what might be its historical roots in the Soviet history we have studied this semester.\nBelow is a list of suggested topics you might consider. I have also listed a number of links to\nInternet sources you may find useful. In addition, I have also posted a number of \"seed articles\" on the class\nwebsite under three rubrics: \"Current Events and their Historical Roots\"; \"Ideas for last paper\" (slightly\nolder articles, but very interesting); and \"Chechnya and Central Asia\" (this barely scratches the surface of a\nfascinating area for research).\nYour third and final paper (15 pages long) is due in class during Session 21. An excellent final\npaper will be one that uses a wide variety of sources, carefully culling data from them, and arranging it to\nform a clear analysis and argument. (Remember, as always, that your argument should appear in the first or\nsecond paragraph of your paper.) I recommend that, as you are doing your research, you create for yourself a\ntimeline of key dates so you will be able to follow the changes you see. Where are the changes coming\nfrom? Who is initiating them? How are they being justified? Also be sure to avoid passive voice at all\ntimes. I want to hear who is taking the actions unless you absolutely cannot find that out. (You can include\nthis timeline as an appendix to your paper if you like.)\n\nPossible topics\n1. Russian protests against Putin (2011 to 2012), sometimes known as the white or snow revolution\n\n2. The Kremlin's creation of an appearance of autocracy under Putin (1999-2012)\na. Putin has consistently denied that anyone is creating a cult of personality around him. Yet there\nare many signs of one. What can you find out about, for example, his use of masculine imagery\nand his stance as a strong and solo leader?\n\n3. The election of President Dmitri Medvedev in March 2008\na. How did Putin's naming of his successor in December 2007 compare with Brezhnev's seizure of\npower in 1964, with Gorbachev's accession to power in 1985 and Putin's own accession to\npower in December 1999 as Yeltsin's \"heir\"?\nb. Why did the switch in Medvedev and Putin's position (castling on Sept. 24, 2011) lead to\nprotests?\nc. The Putin-Medvedev tandem: how did they rule together?\n\n4. The struggle between the Kremlin and former regions of the Soviet Union or Eastern Europe, forces\npushing the regions apart, yet keeping them together\na. Pipelines, railroads, infrastructure\nb. Currencies -which currencies in the C.I.S. are tied to the ruble and which are not?\nc. Colored revolutions (Orange, Rose, Tulip, Maidan) - What has Russia's role and reaction been?\n\n5. Russia's relationship with Ukraine\na. What was Russia's involvement in the Orange Revolution in Ukraine and what is the Kremlin's\nview of Ukraine today?\nb. The arrest and imprisonment of Ukrainian leader Yulia Timoshenko\n\n6. Russia's response to the crisis and civil war in Syria (2011-present)\n\n7. Russia's responses to the events in Kosovo in 1999 (NATO bombings) and the establishment of Kosovo\nindependence. How has the Russian state used pan-Slavic rhetoric?\n\n8. The Nuclear Non-Proliferation Treaty (signed in 1968): efforts today by the Obama administration to\nstrengthen it, including discussions with Medvedev and Putin about cutting nuclear stockpiles\na. how do the efforts today relate to Khrushchev's and Brezhnev's efforts under the doctrine of\n\"peaceful coexistence\"?\n\n9. The Kremlin's struggle for control in the Yukos oil case and the trial of Mikhail Khodorkovsky in 2004\nand again in 2010/2011, 2015/16 - How does it compare to the show trials of the late 1930s ?\n\n10. Russia's relationship with Iran - why has Russia been accused of supplying Iran with nuclear materials?\nWhat are the historical roots of this relationship?\n\nOther possible topics\n\n1. Politics\na. Creation of \"parties\" like United Russia which are really vehicles for the president himself\nb. Increases in the president's powers from 1993 (under Yeltsin) through Putin's rule until today\nc. Kremlin relations with the Duma (Parliament)\nd. Kremlin relations with the governors\ne. Kremlin relations with restive regions (Yakutia, Krasnodar, Tatarstan)\n\n2. Economics\na. Controls over the oligarchs (some famous examples include Khodorkovsky, Gusinsky, Abramovich,\nBerezovsky)\nb. The use of taxes as a way of reining in private companies\nc. Centralization of banking\n\n3. Media\na. Control over the television stations (particular stories might include NTV, Media-Most, ORT) and\nnewspapers (Novaia gazeta, Moscow News, Kommersant)\nb. March 2012 - restrictions on the independent radio station, Ekho Moskvy\nc. Restrictions on coverage of specific issues (the war in Chechnya, the school tragedy in Beslan in\n2004, the war in Ukraine)\n\n4. Judiciary\na. Public trials as show trials\nb. Human rights issues\n\n5. War and conflict\na. Use of wars as an excuse for centralization\nb. Crackdowns on supposed \"terrorists\"\n\n6. FSB and siloviki (military, secret service)\na. Roles of Putin's cronies from the secret services who have positions in government\n\n7. Society\n\na. Creation of \"Nashi\" (Ours), a pro-Putin youth group\nb. Right-wing nationalism\nc. Hooliganism and hate crimes against peoples of certain nationalities\nd. Crackdown on NGOs (non-governmental organizations)\ne. Uses of the \"law on extremism\" and the foreign agents law as tools to crack down on critics\n\nLinks to Internet sources in English\n1. Radio Free Europe/Radio Liberty - http://www.rferl.org/\n2. Moscow Times - http://www.themoscowtimes.com/index.php\n3. The Jamestown Foundation (an excellent source of information) - https://jamestown.org\n4. http://www.eurasianet.org/\n5. BBC, NYTimes, Washington Post, Guardian\n6. Russia Press Digest\n7. http://www.russianews.net/\n\nPlease be extremely careful to cite all of your sources. Plagiarism includes using another's arguments\nwithout acknowledging them, borrowing text wholesale, paraphrasing text in excessive quantity without\nattribution, borrowing someone else's arguments and merely rearranging them. Plagiarism of any kind will\nbe severely punished, up to and including not only flunking the paper, but also having a letter placed in your\nfile at the Institute.\nThere are two main reasons why I am strict about plagiarism: 1) This course is an excellent place for you to\nlearn to hone your reasoning and writing skills. As with everything else in your education, the only way to\ndo that is to do it yourself. I am committed to helping you in every way I can. 2) This course also contains\na kind of contract between you, the student, and me, the instructor. I commit to give you my very best efforts\n- to be clear, smart, up-to-date, informative, and respectful. I expect you to do the same - give your best\nefforts and smarts, not borrowing anyone else's work without attribution. I have every confidence that you\ncan do this.\nThe Writing and Communication Center offers MIT students free individual consultation about any\nwriting difficulty, from questions about grammar to matters of style, including difficulties common to\nwriters, such as overcoming writer's block, organizing materials, writing drafts, revising one's work, and\nmaking public presentations. You can visit the Center during any stage of the writing process: prewriting,\nwriting a first draft, revising, or editing. The Center provides specialized help to those for whom English is\na second language. I hope all of you will visit the Writing Center at least once during the semester and\nprovide me with a written note to that effect.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n21H.245J / 17.57J / 21G.086J Soviet and Post-Soviet Politics and Society, 1917 to the Present\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    }
  ]
}