{
  "course_name": "Spanish I",
  "course_description": "Spanish I is very different from other classes at MIT. The central component of the text and workbook is a series of 26 half-hour video episodes. The videos allow students to learn authentic Spanish and experience its cultural diversity while following a good story full of surprises and human emotions. Students also listen to an audio-only program integrated with the text and workbook.\nIn the classroom, students do a variety of activities and exercises, which include talking in Spanish about the video program, practicing pronunciation and grammar, and interacting in Spanish with classmates in pairs and small groups. The class is conducted in Spanish as much as possible, but English is used where necessary for clarity and efficiency. This course deals with all basic language skills: aural comprehension, speaking, reading, and writing. This class assumes no previous knowledge of Spanish.",
  "topics": [
    "Humanities",
    "Language",
    "Spanish",
    "Humanities",
    "Language",
    "Spanish"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 4 sessions / week, 1 hour / session\n\nGeneral Description\n\nSpanish I will be very different from your other classes at MIT: The central component of the \"\nDESTINOS\n\" text and workbook is a series of 52 half-hour video episodes (you see the first 26 in Spanish I, the rest in Spanish II).\nDESTINOS\nis, in effect, a soap opera that allows you to learn authentic Spanish and experience its cultural diversity while following a good story full of surprises and human emotions (love, death, war, sex, ...). You can watch these episodes outside of class in our departmental Language Learning and Resource Center.\n\nThe complete\nDestinos: An Introduction to Spanish\nvideo series with practice exercises is available free online from Annenberg Learner.\n\nIn the classroom, you will do a variety of activities and exercises, which include talking in Spanish about the video program, practicing pronunciation and grammar, and interacting in Spanish with classmates in pairs and small groups. The class is conducted in Spanish as much as possible, but English is used where necessary for clarity and efficiency.\n\nIn this course we deal with all basic language skills: aural comprehension, speaking, reading, and writing. Naturally, understanding spoken Spanish is especially stressed at the beginning. Grammar is studied not so that you can recite grammar rules, but rather so that you gain an understanding of how the language works. You must speak in order to learn to speak. Some students may feel inhibited about making mistakes in front of others. We will work together to make the class atmosphere as tension-free as possible. You must not be concerned about the instructor, or others, judging you at every moment.\n\nThis class assumes no previous knowledge of Spanish; however, some of your classmates may have studied Spanish in high school or elsewhere, but not enough to go into Spanish II. Do not let this initial inequality disturb you; the advantage of a head start diminishes quickly.\n\nRequired Books\n\nVanPatten, Marks, and Teschner.\nDESTINOS\n. Text and Workbook/Study Guide 1 (Lecciones 1-26). McGraw Hill, 2002.\n\n[For OCW online learners: the complete\nDestinos: An Introduction to Spanish\nvideo series with practice exercises is available free online from Annenberg Learner.]\n\nRecommended\n: A good Spanish-English Dictionary.\n\nEvaluation/Grades\n\nGrading is on the basis of frequent relatively small evaluations rather than on one or two major hurdles:\n\n1.\nClass Attendance and Participation\n: 35%\n\nYour presence and active participation are essential in each and every session. This will be the most significant part of your grade since it's in the class interactions with other students that your communicative abilities in Spanish will develop and improve. Your grade will be determined daily by the quality and quantity of your preparation and participation in group or pair activities and class discussions.\nWARNING\n: Since the emphasis of this class is on daily oral practice and this is impossible to make-up with extra work,\nunexcused absences will result in a lowering of the final class grade. For every four (4) unexcused absences there will be a 5% reduction of the final grade. Additionally, more than eight (8) unexcused absences will result in an \"F\" in class participation\n. Exceptions require a letter from a medical doctor, a dean's excuse, or other extraordinary circumstances. In case of questions or anticipated problems, please do not hesitate to contact your instructor.\n\n2.\nWritten Work\n: lesson worksheets, written reports and assignments from the Web and short one-page compositions. (30%)\n\n3.\nTests\n: 4 in- class quizzes (35%). The last quiz will be given in the last week of classes, not in the official Final Examination Period.",
  "files": [
    {
      "category": "Resource",
      "title": "SP I - Clave Corrección",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-701-spanish-i-fall-2003/8a4c7b4a411a4b38fd19f2e6d8f7b8b5_MIT21G_701F03_corrkey.pdf",
      "content": "CLAVE PARA LA CORRECCION DE TRABAJOS ESCRITOS\nSIMBOLO ERROR\nVERSION EQUIVOCADA\n(wrong version)\nVERSION CORREGIDA\n(revised version)\nCON\nConcordancia:\ngenero, numero,\nsujeto y verbo)\n(Agreement )\nEl dia es muy fria.\nLa gente son amables.\nElla y yo pueden.\nMe gusta los animales.\nEl dia es muy frio.\nLa gente es amable.\nElla y yo podemos.\nMe gustan los animales.\nCT\nContraccion\nVoy a el cine.\nVengo de el campo.\nVoy al cine.\nVengo del campo.\n\nG\nGenero\n(Gender)\nLa problema; muchos\npartes; el foto; el clase; la dia\nLa cuenta es muy\ninteresante.\nEl problema; muchas partes;\nla foto;\nla clase; el dia\nEl cuento es muy interesante.\nM\nMayuscula /\nminuscula. Uso\nincorrecto.\n(Capital - lower\ncase)\nElla es Mexicana.\nVolvere en Septiembre.\nEl Senor gomez esta aqui.\nEstudio Espanol.\nElla es mexicana.\nVolvere en septiembre.\nEl senor Gomez esta aqui.\nEstudio espanol.\nOrt\nOrtografia\n(Spelling)\nQuarenta, fisicomente,\noccurio, acceptar, qeda\nCuarenta, fisicamente,\nocurrio\naceptar, queda\n\nPA\nPalabra ausente;\nfalta una palabra\n(Missing word)\n¿Conoces Juanita?\nTengo estudiar mas.\nViolencia es mala.\nAcuesto a las diez.\n¿Conoces a Juanita?\nTengo que estudiar mas.\nLa violencia es mala.\nMe acuesto a las diez.\nPE\nPalabra\nequivocada.\n(Wrong word)\nEs muerto.\nEstan diez estudiantes en la\nclase.\nEn lunes tomo una clase de\nespanol.\nA MIT yo estudio mucho.\nNo vi a alguien.\nFue una grande fiesta.\nEsta muerto\nHay diez estudiantes en la\nclase.\nTengo prisa.\nEl lunes tomo una clase de\nespanol.\nEn MIT yo estudio mucho.\nNo vi a nadie.\nFue una gran fiesta.\n\nVC\nVerbo :\nConjugacion\n(Verb\nconjugation)\nYo sabo\nNosotros duermimos\nYo jugo\nDespues de salgo\nYo se.\nNosotros dormimos\nYo juego\nDespues de salir\nVT\nVerbo: Tiempo\n(Tense)\nAyer voy a mi clase.\nDijo que fueron las diez.\nYo puedo nado.\nAyer fui a mi clase.\nDijo que eran las diez.\nYo puedo nadar.\n¿ ?\nNo se entiende.\nPor favor\nescribir\nnuevamente.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.701 / 21G.751 Spanish I\nFall 2003\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Comp.1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-701-spanish-i-fall-2003/6c06faea2dc49e33626ce085ce2b0c03_MIT21G_701F03_comp1.pdf",
      "content": "Composicion 1\nMini-autobiografia\nEscribe sobre ti mismo/a usando el vocabulario estudiado hasta el momento.\nExtension : 10-12 oraciones. Trata de usar el vocabulario y los verbos de las\nlecciones 1-4 (W. pg.26).\nEstas son algunas preguntas que pueden ayudarte a organizar tu composicion.\nUsalas como una guia, no es necesario responder a todas ellas.\n¿Cuantos anos tienes? ¿de donde eres? ¿donde vives? ¿con quien?\n¿que estudias? ¿tus asignaturas favoritas? ¿que deseas hacer en el\nfuturo? ¿como eres? ¿debes estudiar mucho? ¿sacas buenas notas?\n¿escribes muchos reportes? ¿como son tus clases ?\n¿Donde trabajas? ¿cuantas horas trabajas? ¿debes trabajar mucho?\n¿es interesante tu trabajo? ¿buscas un trabajo? ¿donde deseas\ntrabajar?\n¿Que haces en tu tiempo libre? ¿visitas a tus amigos? ¿hablas por\ntelefono? ¿caminas por la ciudad? ¿practicas un deporte? ¿miras la\ntelevision? ¿comes en restaurantes? ¿escribes cartas a tus amigos?\n¿vas al cine? ¿viajas mucho? ¿adonde deseas viajar?\n¿Que deseas tener ? ¿Un perro? ¿un gato? ¿mucho dinero? ¿mucho\ntiempo? ¿una casa o una hacienda? ¿una familia grande o pequena?\n¿un trabajo interesante? ¿un coche (auto) elegante o deportivo? ¿una\nbicicleta? ¿un apartamento grande?\n¿Como es tu familia? ¿cuantas personas hay? ¿que hacen? ¿donde\nestan? ¿ves a tu familia frecuentemente?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.701 / 21G.751 Spanish I\nFall 2003\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Español 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-701-spanish-i-fall-2003/9262e471eab2f74edb4c6593e53d55c9_MIT21G_701F03_comp2.pdf",
      "content": "Espanol 1\nComposicion 2\n\"Mis vacaciones en Madrid\"\nImagina que esta en Madrid y vas a escribir a tus amigos (y a tu profesora) en M.I.\nT. sobre tus maravillosas vacaciones en esta ciudad espanola. ¿Que haces cada\ndia? ¿Adonde vas? ¿Que comes? ¿Cuando te acuestas? Todos somos muy curiosos\ny queremos saber todo lo que haces y planeas hacer. No omitas ningun detalle. A\ncontinuacion hay una lista de verbos (OJO: algunos de ellos son reflexivos) que te\npueden ayudar en tu narracion. Tambien hay una serie de palabras para organizar\nlo que vas a contar. En tu narracion usa el presente de los verbos. Para dar\nrealismo a tus vacaciones madrilenas puedes referirte a una de estas guias de\nMadrid:\nSoftGuia de Madrid.\nWebMadrid\nLa guia XXI de Madrid\nAl terminar y antes de entregar tu composicion revisa los siguientes aspectos:\n● Genero de los sustantivos (gender of nouns)\n● concordancia (agreement) de adjetivos y sustantivos\n● concordancia (agreement) de sujeto y verbo\nIncluye en tu narracion 15 de los siguientes verbos como minimo:\n\nLevantarse\nDespertarse\nVestirse\nBanarse /\nducharse\nAcostarse\nDormirse\nOlvidarse\nAcordarse\nLeer\nIr\nEncontrar\nSaber\nLlegar\nDesayunar\nAlmorzar\nCenar\nPoder\nSalir\nHacer\nOir\nSentarse\nSentirse\nVenir\nConocer\nIrse\nQuerer\nEmpezar\nTerminar\nPensar\nPerder\nVolver\nDar\nVer\nDivertirse\nProbar (ue) =to\ntry, to taste\nTraer\nAlgunas palabras utiles para organizar tu narracion:\nprimero\nluego\ndespues\npor fin\npor la manana\npor la tarde\npor la noche\na veces (sometimes)\nsiempre\ntambien\npero\npor eso\ncada dia\ntodos los dias\ntodo el tiempo (all the time)\ndespues de\nantes de\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.701 / 21G.751 Spanish I\nFall 2003\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Comp.3",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-701-spanish-i-fall-2003/810044d2ccddcd238a5efd108ea42c0d_MIT21G_701F03_comp3.pdf",
      "content": "Composicion 3\nMis recuerdos\nNarracion autobiografica. Escribe una historia sobre tu vida y un evento\nimportante en ella. Vas a combinar el preterito y el imperfecto. Recuerda que se\nusa el imperfecto para describir en el pasado y para acciones habituales en el\npasado. No importa cuando comenzaron ni cuando terminaron. El Preterito se usa\npara hablar de acciones limitadas o completas o cuando quieres enfatizar el\ncomienzo o el final de la accion.\nAqui hay una lista de frases que se combinan frecuentemente con el imperfecto:\n● Todos los dias, fines de semana, anos, etc.\n● Cada vez que\n● Cada hora, dia, noche, semana\n● Mientras\n● Por lo general\n● Con frecuencia, frecuentemente\n● A veces\n● De vez en cuando\n● En aquel entonces\nFrases que se combinan con el Preterito:\n● Una vez\n● Cinco (diez, veinte, etc. ) veces\n● De repente\n● De pronto\n● Inmediatamente\n● Por un ano, Por diez ( veinte, cuarenta ,etc). anos\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.701 / 21G.751 Spanish I\nFall 2003\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}