{
  "course_name": "Spanish IV",
  "course_description": "Course Sequences\nSpanish IV aims at developing and improving student’s oral and written communication through the continued study of the language, literature and culture of Spain, Latin America and Hispanic communities in the United States. It also seeks to improve students’ ability to read and appreciate literary and non-literary texts in Spanish, deepening this way students’ awareness and understanding of the cultural diversity of the Spanish-speaking world. The course is organized by themes based on contemporary social, political and cultural issues of Spanish-speaking societies such as: cultural identity, the changing roles of women and family, economic development and its effects on cultural heritage and environment, and the individual’s rights in the political system.",
  "topics": [
    "Humanities",
    "Language",
    "Spanish",
    "Humanities",
    "Language",
    "Spanish"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 4 sessions / week, 1 hour / session\n\nCourse Description and Goals\n\nSpanish IV aims at developing and improving student's oral and written communication through the continued study of the language, literature and culture of Spain, Latin America and Hispanic communities in the United States. It also seeks to improve students' ability to read and appreciate literary and non-literary texts in Spanish, deepening this way students' awareness and understanding of the cultural diversity of the Spanish-speaking world. The course is organized by themes based on contemporary social, political and cultural issues of Spanish-speaking societies such as: cultural identity, the changing roles of women and family, economic development and its effects on cultural heritage and environment, and the individual's rights in the political system.\n\nClass activities will consist of discussions, reports, debates and simulations emphasizing problem-solving, and decision-making through the negotiation of meanings and opinions. Written expression will be perfected through frequent essays and short written assignments. Students are responsible for reviewing the assigned grammar structures and completing the exercises in the grammar review text. Practice of the grammatical structures and new vocabulary will be done in the context of the class activities and through the written assignments.\n\nThis course uses a large selection of materials from the Internet. The course's online syllabus contains the links to readings, radio programs and video materials that will be discussed during the semester and upon which class activities are based. It is important to consult the online syllabus daily since it is there that any announcements or last minute changes will appear.\n\nRequirements and Evaluation\n\nClass Attendance and Participation: 35%\n\nStudents are responsible for preparing all lessons at home (readings, videos, grammatical or vocabulary exercises) according to the provided schedule. Regular attendance and active participation is an extremely important requirement for completing this course successfully.\nStudents will be evaluated daily on their preparation and participation in class\n.\n\nWarning:\n\nSince the emphasis of this class in on daily oral practice and this is impossible to make-up with extra work,\nunexcused absences will result in a lowering of the final class grade. For every four (4) unexcused absences there will be a 5% reduction of the final grade. Additionally, more than eight (8) unexcused absences will result in an \"F\" in class participation\n. Exceptions require a letter from a medical doctor, a dean's excuse, or other extraordinary circumstances. In case of questions or anticipated problems, please do not hesitate to contact your instructor.\n\nTardiness:\n\nRepeated tardiness will also affect your final grade. Three late arrivals will count as one absence.\n\nAttending Different Sections:\n\nYou must regularly attend the class section in which you are registered, unless you have made official arrangements with the instructors at the beginning of the semester. Only in an emergency and with previous notification to the instructor will you be permitted to attend a different section from your regular one. You must notify your instructor at least a day in advance to obtain his/her permission in the case of such an emergency or other extraordinary circumstances.\n\nHomework and Written Work: 30%\n\nThere will be a series of\nshort written assignments\nto practice the grammar and vocabulary. The syllabus indicates when these assignments have to be handed in to your professor.\n\nYou will also write\nfour\n(2 page) compositions. You will write\ntwo drafts\nof each compositions; the first draft will be marked for errors using a correction key (\nclave de correccion\n) and returned to you for revision. The compositions will be graded on the basis of the 2 drafts. The first draft will be worth\n70%\nof the grade and the revised draft will be worth\n30%\n. If anyone submits only one draft, the total score will be the score of the first composition\nminus 30%\n. From the moment that your instructor hands back the first draft, you will have one week to submit the second draft of the composition. Both drafts must be handed in\non time\n. Compositions handed in late will not receive full credit.\n\nPlagiarism Clause:\n\nAccording to Webster's New Collegiate Dictionary, to\nplagiarize\nis \"to steal and pass off (the ideas or words of another) as one's own: use (a created production) without crediting the source ~vi: to commit literary theft: present as new and original an idea or product derived from an existing source.\"\n\nThis includes copying something out of a book, newspaper, journal or any other printed source, as well as electronic resources such as the World Wide Web without the appropriate acknowledgement. According to this definition, plagiarism would also include the following:\n\nUsing material created by another student at your school or anywhere else and passing it off as your own (with or without their consent).\n\nUsing a paper-writing \"service\" which offers to sell written papers for a fee.\n\nTranslations (with or without translation software) of texts from other languages and submitting them as your own work.\n\nPlagiarism is an extremely serious academic offense. Students should be aware that they will be severely penalized if caught engaging in any form of plagiarism. If you have any questions or doubts about how to document the sources of your ideas, please consult your instructor. For further information you can consult the MIT Libraries: What is plagiarism and how to avoid it.\n\nGroup Video Project: 5%\n\nYou will write, act in, film, and edit a video based on the novel we read in class. You will work in groups (maximum 5 students per group) and create a video which will be presented during the final week of the semester. You will film using digital video with the DV cameras available in the LLARC. You can also use iMovie to edit your video, add transitions, sound effects, music, voiceover, etc. Some class time will be allowed for the early organizing stages. The edited video should be no more than 10 minutes. More detailed instructions will be given by your instructor.\n\nTests: 30%\n\nThere will be 4 tests during the semester covering vocabulary, grammatical structures as well as the materials discussed in class.\n\nGrading\n\nAll grades (tests, compositions, class and final grades) are based upon a traditional ten-point scale. Students are not in competition with each other; each student will receive the grade he or she earns.",
  "files": [
    {
      "category": "Resource",
      "title": "CLAVE PARA LA CORRECCIÓN DE TRABAJOS ESCRITOS",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-704-spanish-iv-spring-2005/319394442ce5ee2c558a9f06e927e25c_MIT21G_704S05_clave_correc.pdf",
      "content": "CLAVE PARA LA CORRECCION DE TRABAJOS ESCRITOS\nGramatica, vocabulario, ortografia, puntuacion\nSIMBOLO\nERROR\nVERSION\nEQUIVOCADA\nVERSION\nCORREGIDA\nAC\nAcento (falta, sobra un acento\no esta mal puesto)\n¿Que te pasa?\nPara mi .\n¿Que te pasa?\nPara mi.\nART\nArticulo (equivocado,omitido o\ninnecesario)\nDoctor Perez es mi\npadre.\nEstudio el espanol.\nEl doctor Perez es mi\npadre.\nEstudio espanol.\nCON\nConcordancia: genero, numero,\nsujeto y verbo)\nEl dia es muy fria.\nLa gente son\namables.\nElla y yo podian.\nMe gusta los\nanimales.\nEl dia es muy frio.\nLa gente es amable.\nElla y yo podiamos.\nMe gustan los\nanimales.\nCT\nContraccion\nVoy a el cine.\nVengo de el\ncampo.\nVoy al cine.\nVengo del campo.\nEST\nEstructura\nAna gusta cantar.\nPedro faltan dos\nlibros.\nA Ana le gusta cantar.\nA Pedro le faltan dos\nlibros.\nG\nGenero\nLa problema;\nmuchos partes; el\nfoto\nLa cuenta es muy\ninteresante.\nEl problema; muchas\npartes; la foto\nEl cuento es muy\ninteresante.\n\nLEX\nLexico: seleccion equivocada\nde la palabra o expresion,\nanglicismo o traduccion literal\ndel ingles.\nRealizo su error.\nAprendio la\nnoticia.\nMi sujeto favorito\nes espanol.\nEl es el solo hijo de\nla familia.\nEscribi un papel\npara mi clase de\ningles.\nLe escribi una letra\na mi amigo.\nNo estoy cierto.\nTuve un buen\ntiempo.\nSe dio cuenta de su\nerror.\nSe entero de la noticia.\nMi asignatura favorita\nes espanol.\nEl es el unico hijo de la\nfamilia.\nEscribi un trabajo ( un\nensayo, una\nmonografia) para mi\nclase de ingles.\nLe escribi una carta a\nmi amigo.\nNo estoy seguro.\nLa pase bien, (Me\ndiverti.)\nM\nMayuscula / minuscula. Uso\nincorrecto.\nVolvere en\nSeptiembre.\nEl senor gomez\nesta aqui.\nVolvere en septiembre.\nEl senor Gomez esta\naqui.\nN\nNumero equivocado (singular /\nplural)\nLos pieses; las\nflors ;\nlos anos sesentas\nLos pies; las flores;\nlos anos sesenta.\nO\nOrtografia\nQuarenta,\nfisicomente,\noccurio, acceptar,\npage\nCuarenta, fisicamente,\nocurrio , aceptar, pague\nOP\nOrden de palabras\nequivocado o construccion\ndefectuosa de la frase.\nTraduccion literal del ingles.\nYo quiero se lo\ndar.\nEs un muy\ninteligente\nYo se lo quiero dar. Yo\nquiero darselo.\nEs un estudiante muy\ninteligente.\nTengo tres amigos\n\nestudiante.\nTengo tres mas\namigos.\nEse es el chico yo\nfui a la fiesta con.\nmas.\nEse es el chico con\nquien yo fui a la fiesta.\nP\nPuntuacion equivocada o que\nfalta\nUno, dos, y tres.\nDonde vives?\nUno, dos y tres.\n¿Donde vives?\nPA\nPalabra ausente; falta una\npalabra\n¿Conoces Juanita?\nTengo estudiar\nmas.\n¿Conoces a Juanita?\nTengo que estudiar\nmas.\nPE\nPalabra equivocada.\nNo vi a alguien.\nMe lavo mis\nmanos.\nFue una grande\nfiesta.\nLos estudiantes\nquienes salieron\nmal en el examen\nno estudiaron\nmucho.\nEl es rico y\ninteligente.\nNo vi a nadie.\nMe lavo las manos.\nFue una gran fiesta.\nLos estudiantes que\nsalieron mal en el\nexamen no estudiaron\nmucho.\nEl es rico e inteligente.\nPI\nPalabra innecesaria\nUna otra persona.\nUn mil personas.\nHay los edificios.\nOtra persona.\nMil personas.\nHay edificios.\nPREP\nPreposicion (equivocada,\nomitida o innecesaria)\nJulieta se enamoro\ncon Romeo.\nDepende en eso.\nEllos aprenden\nJulieta se enamoro de\nRomeo.\nDepende de eso.\nEllos aprenden a nadar.\n\nnadar.\nBuscamos por un\napartamento.\nBuscamos un\napartamento.\nPRON\nPronombre equivocado,\nomitido o innecesario\nMi familia y mi\nvamos al cine.\nA nos les gusta.\nCompre el libro a\nellos.\nLe los compre.\nEllos levantan muy\ntemprano.\nMi familia y yo vamos\nal cine.\nA nosotros nos gusta\ncantar.\nLes compre el libro a\nellos.\nSe los compre.\nEllos se levantan muy\ntemprano.\nVC\nVerbo : Conjugacion\nyo vio;\nnosotros\nduermimos;\ntu veniste;\nyo conduci\nyo vi;\nnosotros dormimos;\ntu viniste;\nyo conduje.\nVM\nModo Verbal\nEl modo (infinitivo, indicativo,\nsubjuntivo, condicional o\nimperativo) esta equivocado\nYo puedo nado.\nQuiero que me lo\ndices.\nViajare mucho\ncuando terminare\nla universidad.\nEl dijo que vendra\nmanana.\nBailando es\ndivertido.\nYo puedo nadar.\nQuiero que me lo\ndigas.\nViajare mucho cuando\ntermine la universidad.\nEl dijo que vendria\nmanana.\nBailar es divertido.\nVS\nEs muerto.\nEsta muerto.\n\nVT\nTiempo del verbo equivocado\nVerbo: Seleccion\n(seleccion verbal equivocada;\nespecialmente : ser / estar /\nhaber / tener / hacer)\nMe dijo que no\nhaga eso.\nSi yo tenga dinero\nviajaria\nSoy 25 anos.\nEstan diez\nestudiantes en la\nclase.\nEsta calor hoy.\nTengo 25 anos.\nHay diez estudiantes en\nla clase.\nHace calor hoy.\nAyer voy a mi\nclase.\nDijo que fueron las\ndiez.\nAyer fui a mi clase.\nDijo que eran las diez.\nMe dijo que no hiciera\neso.\nSi yo tuviera dinero\nviajaria.\n¿ ?\nNo se entiende. Por favor\nescribir nuevamente.\nContenido, organizacion y estilo\nTESIS\nIdeas o tesis no claras; repetitiva o redundante\nVAR\nFalta de variedad en el vocabulario\nINTRO? Falta de introduccion o introduccion debil\nORG\nCONC? Falta de conclusion o conclusion debil\nOrganizacion confusa\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.704 Spanish IV\nSpring 2005\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Entrevistas: Voces de inmigrantes",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-704-spanish-iv-spring-2005/f7e0d9468acea96ccda3bdf3ba31b09f_MIT21G_704S05_vocesinmigra.pdf",
      "content": "Entrevistas: Voces de inmigrantes\nEscucha las entrevistas en Voces de inmigrantes y toma nota para responder a lo siguiente:\n1. Lugar de origen:\n2. Motivos para salir de su pais y venir a los Estado Unidos.\n3. Primeras impresiones. Diferencias entre su vida aqui y la que tenia en su pais.\n4. Dificultades u obstaculos para adaptarse. ¿Que fue lo mas dificil de su experiencia como\ninmigrante? Por ejemplo:\nz idioma\nz trabajo\nz choques culturales\nz deseo de regresar al pais de origen\nz asimilacion\n5. Identidad: ¿Como se define a si mismo/a? ¿Mantiene su herencia cultural? ¿Le es importante\nmantener su identidad como latino o latina? ¿Por que si o no?\n6.¿Que relacion guarda con su pais de origen? ¿Se identifica con la vida y la gente de su pais?\nExplica.\n7. ¿Te sorprendio algo de alguna de las entrevistas? ¿Que?\n8. Menciona algo que aprendiste de ellas.\n9. En base a lo que escuchaste, comenta lo siguiente: Segun encuestas ( polls ) nueve de cada\ndiez hispanos piensa que es importante cambiar para integrarse a la sociedad americana. Y\nnueve de cada diez piensa que es esencial para ellos mantener su cultura propia. ¿Crees que\nesto es posible? Es decir, ¿es posible integrase a la manera de vida americana y preservar su\npropia identidad? ¿Crees que la asimilacion implica la obliteracion de la identidad etnica?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.704 Spanish IV\nSpring 2005\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "España de cerca : Imágenes y estereotipos",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-704-spanish-iv-spring-2005/13234e0aab60987527d3f98e6113c588_MIT21G_704S05_imagenes.pdf",
      "content": "Espana de cerca : Imagenes y estereotipos\nVocabulario:\nel topico = el cliche, el estereotipo\nlas castanuelas = castanets\nestar de cachondeo = estar de broma; no tomarse las cosas en serio (to live it up; to have a good time)\ndesmadrados = descontrolados, fuera de control, pasado del limite\nen plan fiesta = siempre de diversion\nla pandilla = grupo de gente que se reune para hacer algo en comun (clique, gang)\ntacano = alguien a quien no le gusta gastar dinero\nregatear = cuando el comprador y el vendedor debaten el precio de algo (to bargain)\nlos vaqueros = jeans\nDespues de escuchar las entrevistas en \"Espana de cerca\" en la seccion \" Imagenes y estereotipos\" responde a lo siguiente:\n¿Cuales son algunos de los topicos o imagenes que tienen los espanoles de los norteamericanos? Escribe por lo menos tres\nmencionados.\n¿Cuales son algunos de los estereotipos que los espanoles dicen existen sobre ellos?\nLuego, escribe un breve comentario sobre lo que escuchaste. Puedes considerar algunas de estas preguntas:\n¿Que opinas tu de estas imagenes?\n¿Te parecen justificadas? ¿exageradas? ¿te sorprendio alguna ?\n¿A que crees que se deben algunas imagenes o impresiones que tienen los espanoles de los norteamericanos ? ¿De donde\nproceden las imagenes que tenemos de otros?\n¿Como responderias tu a una pregunta similar ?\nEn clase, discutiras tus comentarios con tus companeros /as y entregaras lo que escribiste a la profesora.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.704 Spanish IV\nSpring 2005\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "España de cerca: Temas familia y mujer",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-704-spanish-iv-spring-2005/ae973c34f37f03b47a95f9e41b338b0f_MIT21G_704S05_familia_y_mu.pdf",
      "content": "Espana de cerca: Temas familia y mujer\n)\n)\nmarginados = aislados\nVocabulario:\ncriar = to raise, to bring up\nla crianza = upbringing\nlos quehaceres domesticos = chores\ncompartir = share\nel porcentaje = percentage\nla pareja = couple\nla brecha generacional = las diferencias entre las\ngeneraciones (generation gap\nla fachada = la apariencia\npermisivo = tolerante\nconsentidos = mimados (spolied\nquedarse estancado = no progresar\nlas guarderias = centros de cuidado\ninfantil\nresidencias de ancianos\nla tutela = la proteccion\nconsumo ciega = consumerism blinds\n\"anclada en el pasado\" = anchored in\nthe past\n\"queda mucho por superar\" = there is a\nlot to be overcome\nGuia de preguntas\nz ¿Que aspectos son caracteristicos de la familia espanola segun los entrevistados?\nz ¿Que cambios ha habido en las relaciones entre padres e hijos o en las relaciones entre\nlas parejas?\nz ¿Como describen la crianza de los hijos?\nz ¿Hay diferencias entre la crianza y el trato a los ninos y las ninas? ¿cuales?\nz En opinion de los entrevistados ¿que logros ha alcanzado la mujer en Espana y que\nproblemas tiene todavia?\nz ¿Cuales son algunas de las profesiones tipicas para las mujeres?\nz ¿como ha cambiado la vision sobre el matrimonio para las mujeres? ¿Que consecuencias\nha tenido esto?\nz ¿Notaste alguna diferencia entre el punto de vista de los hombres y el de las mujeres?\nz ¿Que semejanzas o diferencias observas entre estas familias espanolas y la familias\nnorteamericanas que conoces?\nz ¿En que aspectos es semejante o diferente la situacion de la mujer espanola a la de las\nmujeres en los Estados Unidos?\nz ¿Te sorprendio algo de lo que escuchaste? ¿que? ¿por que?\nAl reportar las opiniones de las personas que escuchaste, trata de usar expresiones como:\nz En palabras de...X...\nz Segun...X...\nz De acuerdo con...X...\nz .. X.. afirma que...\nz ...X ...declara que...\nz ...X...asegura que....\nz ...X ...confiesa que...\nz ...X... admite que ....\nz ...X...agrega que ...\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.704 Spanish IV\nSpring 2005\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Formación de mandatos y verbos reflexivos",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-704-spanish-iv-spring-2005/ca6192d8201d6a437a9a2102d6127988_MIT21G_704S05_mandatos.pdf",
      "content": "Formacion de mandatos y verbos reflexivos\nRepasa la formacion de los mandatos (el imperativo) (MG, pp.174-179) ) y como se forman los\nmandatos afirmativos y negativos de los verbos reflexivos de la lista a continuacion.\nEscribe una carta breve de uno de los personajes de la pelicula \"Mujeres al borde de un\nataque de nervios\". a otro, expresando sus sentimientos sobre la otra persona o acusandolo/a,\npidiendole perdon, dando disculpas o explicaciones, consejos, recomendaciones, etc. En esta\ncarta debes incluir :\nz 5 mandatos (afirmativos y negativos)\nz 5 expresiones que requieren el subjuntivo (influencia, emocion, duda, etc.)\nz por lo menos 10 de los verbos reflexivos de la lista.\narriesgarse a\nasustarse de\navergonzarse de\nequivocarse\nenojarse\nescaparse\nhacer\nmentir\nmeterse en\nrebelarse\nreirse de\nvestirse\nacostumbrarse a\nalegrarse de\nalejarse de\narrepentirse de\natreverse a\nburlarse de\ncalmarse\ncasarse con\nconfiar en\nconvertirse en\ndarse cuenta de\ndecir\ndespedirse de\nenamorarse de\nenganar\nenfrentarse a\nentrometerse en\nentristecerse\nfiarse de\nfugarse =\nirse = marcharse =\nlargarse\nllorar\nnegarse a\nolvidarse de\noponerse a\npelearse con\nperdonar\nponerse\npreocuparse por\nquedarse\nquejarse de\nquitarse\nresignarse a\ntener confianza en\ntanquilizarse\nser\nsonar con\nsufrir\ntener ... (paciencia, fe,\ncalma, cuidado etc.)\nvengarse\nvolverse (loco/a)\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.704 Spanish IV\nSpring 2005\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Gerundio o infinitivo?",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-704-spanish-iv-spring-2005/ecd42bb89ff4a8d03bb57979d016b49e_MIT21G_704S05_gerundio_inf.pdf",
      "content": "¿Gerundio o infinitivo?\n1. Es probable que mucha gente en el pueblo odiara a Santiago Nasar por ____________(ser)\narabe y rico.\n2. Mucha gente presencio el crimen sin ____________(hacer) nada al respecto.\n3. A mucha gente les gusta _______________(mirar) espectaculos violentos.\n4. La muerte de Santiago era una manera de _____________(reestablecer) el honor de la\nfamilia Vicario y por eso, ______________(matar) a Santiago se convirtio en el destino de los\ngemelos.\n5. A pesar de estar muy borrachos, los gemelo siguieron _____________(beber), pues tenian\nmiedo de no _____________(tener) valor para _______________(matar) a Santiago.\n6. Cuando vieron a Santiago salieron _______________(correr) hacia el.\n7. La gente anda _________________(decir) que los gemelos Vicario estan\n________________(prepararse) para __________________(matar) a Santiago Nasar, pero yo\nse que ellos no son capaces de _________________(matar) a nadie.\n8. El obispo paso __________________(saludar ) al pueblo, pero rehuso ________________\n(bajar) de su buque.\n9. No dejare de _______________(investigar) este asunto hasta _______________(averiguar)\nla verdad. No puedo seguir _______________(vivir) sin\n___________________(saber) quien deshonro a Angela. _________________(encontrar) al\nverdadero culpable se ha convertido en mi obsesion.\n10. Me da miedo ________________(confesar) la verdad, pero _______________(mentir) no\nes la solucion al problema. No puedo continuar __________________(callar) mi secreto.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.704 Spanish IV\nSpring 2005\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Los inmigrantes",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-704-spanish-iv-spring-2005/89003d6147176223c5f60dd8253c0f75_MIT21G_704S05_los_in_v_llo.pdf",
      "content": "Los inmigrantes\nMario Vargas Llosa\nVocabulario:\nacoger\nacogida\nacudir = ir\naislados = marginados (\n=\napertura = opening\n=\ncauces =\nciudadano/ a =\ndar por descontado\ndesarrollar =\ndesvalido\n= pobre\nto\n)\n=\n(wetbacks)\n=\nmagnet)\n)\nmezclar\nmix)\nmezquino\n)\n=\n=\nes\npedir asilo =\n=\n= remittance\n=\n)\n=\n= recibir, dar la bienvenida\n= welcome\nisolated)\nagravar = empeorar\na largo plazo = long term\namenaza, la\nthreat\na reganadientes = de mala gana,\nsin entusiasmo, sin querer hacerlo\natajar = impedir el paso, detener\nbendicion\nblessing\nvias, camino\ncitizen\n= take for\ngranted\ndevelop\ndesheredado = pobre, sin fortuna\n= que no tiene quien el\nayude, desamparado\nempobrecido\nemprendedor = enterprising\nestancarse = no progresar (\nstagnate\nel atraso =falta de desarrollo; lo\nopuesto a progreso\nel chivo expiatorio = persona o\ngrupo acusada de todos los males\nde la sociedad\nel Tercer Mundo\nThird World\nespaldas mojadas = ilegales que cruzan en\nRio Grande para entrar a los EE.UU.\nextranjero\nalien, foreigner\nimantar = atraer (como un iman=\ningresos = income\nla frontera = el limite de un estado o pais\nla mano de obra = la fuerza de trabajo\nla marea = el flujo, la ola (tide\n= combinar (\n= no generoso (mean, stingy\npaises desarrollados o industrializados\ndeveloped countries\npaises en vias de desarrollo\ndeveloping\ncountri\nask for asylum\nperjudicar = hacer dano\npolitica\npolicy, politics\nponer coto = restringir, limitar\npuerta trasera = back door\nrefugiado = refugee\nremesas\nreto, el\nchallenge\nsacar provecho = beneficiarse\nsalvaguardar = proteger; defender\nsocavar = destruir (undermine\nsofocar =dominar, extinguir, limitar\nsueldo, el\nsalary\nxenofobia = hostilidad hacia los extranjeros\nComenta las siguientes ideas expresadas por Mario Vargas Llosa en su articulo \"Los\ninmigrantes\". ¿Estas de acuerdo? ¿en desacuerdo? ¿hasta que punto?\n1. Los que cruzan clandestinamente las fronteras ejercitan un derecho natural y moral que\nninguna norma juridica deberia tratar de sofocar: el derecho a la vida, a la supervivencia...\"\n2. Mejor aceptar la inmigracion, aunque sea a reganadientes, porque bienvenida o malvenida,\nno hay manera de pararla. No hay manera de poner coto o restringir la marea migratoria que\ndesde el Tercer Mundo rompe contra el mundo desarrollado.\n3. El inmigrante se ha convertido en los ultimos anos en el chivo expiatorio de todas las\ncalamidades.\n4. Las politicas antiinmigratorias .....tienen el efecto perverso de socavar las instituciones\ndemocraticas del pais que las aplica y de dar una apariencia de legitimidad a la xenofobia y al\nracismo y de abrirle las puertas de la ciudad al autoritarismo.\n\n5. Los inmigrantes no pueden ser atajados con medidas policiales por una razon muy simple:\nporque en los paises a los que ellos acuden hay incentivos mas poderosos que los obstaculos\nque tratan de disuadirlos de venir.\n6. La inmigracion se reducira cuando los paises que la atraen dejen de ser atractivos porque\nestan en crisis o saturados o cuando los paises que la generan ofrezcan trabajo y oportunidades\nde mejora a sus ciudadanos.\n7. El inmigrante no quita trabajo, lo crea y es siempre un factor de progreso, nunca de atraso.\nLa inmigracion de cualquier color y sabor es una inyeccion de vida, energia y cultura y los\npaises deberian recibirla como una bendicion.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.704 Spanish IV\nSpring 2005\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Mujeres al borde de un ataque de nervios",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-704-spanish-iv-spring-2005/96acde6fc1e773f7fd574e989bd52813_MIT21G_704S05_subjuntivo.pdf",
      "content": "Mujeres al borde de un ataque de nervios\nPractica del Subjuntivo\nCompleta con la forma del Indicativo o Subjuntivo segun sea necesario:\n1. Pepa le exige a Ivan que......\n2. Es probable que Ivan ......\n3. Me parece que Pepa....\n4. Al principio Pepa no puede creer que Ivan....... pero finalmente se da cuenta de que Ivan.....\n5. El medico le recomienda a Pepa que......\n6. Pepa incendia su cama despues de que.....\n7. Lucia cree que Pepa e Ivan.....\n8. Candela teme que la policia....\n9. Es una lastima que las mujeres en esta pelicula.....\n10. Pepa espera ansiosamente junto al telefono en caso de que.....\n11. Pepa insiste en que Ivan _____________ (subir) al apartamento para que ....\n12. Marisa se queda dormida despues de que....\n13. Pepa se da cuenta de que Carlos es hijo de Ivan cuando.....\n14. Pepa dejara de sufrir por Ivan en cuanto ....\n15. Los hombres se aprovechan de Candela sin que...\n16. Candela siempre se relaciona con hombres que...\n17. Carlos sera como su padre a menos que....\n18. Creo que Pepa todavia ___________(querer) a Ivan a pesar de que el.....\n19. Dudo que Pepa _________________ (ser) feliz mientras.....\n20. En la pelicula no hay mujeres que.......\n21. Pepa quiere llegar al aeropuerto antes de que......\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.704 Spanish IV\nSpring 2005\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Pronombres relativos",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-704-spanish-iv-spring-2005/9b381bd952493a613b9547bd001bb357_MIT21G_704S05_relativos_cr.pdf",
      "content": "Pronombres relativos\nCompleta el parrafo con:\nlos pronombres relativos:\n(a) que\n(d) cuyo,cuya, cuyos,cuyas\n(b) quien, quienes\n(e) lo que\n(c) el / la / los / las que (el/la cual, los/las (f) donde\ncuales)\no los interrogativos:\n(a) que\n(b) quien/quienes\nSantiago Nasar era un hombre _____________ parecia tenerlo todo, pero _____________\ndestino estaba escrito desde el principio de la novela. El es el personaje alrededor de\n______________ gira toda la historia. Es un hombre _________________ estaba\nacostumbrado a hacer todo _____________ queria. Sin embargo fue a el a ______________\nAngela acuso de su deshonra y sobre ________________ cayo asi una condena de muerte.\nSantiago era el unico __________________ no sabia que los hermanos Vicario, con\n________________ el estuvo bebiendo esa madrugada lo iban a matar. ________________ a\nel le interesaba era saber cuanto habia costado la boda de Bayardo. El nunca supo la razon por\n________________ los gemelos querian matarlo. Aunque mucha gente sabia ______________\nlos gemelos Vicario iban a hacer, nadie impidio que mataran a Santiago, ____________ muerte\nhabia sido anunciada por todo el pueblo. Los cuchillos con _____________ los gemelos iban a\nmatar a Santiago eran cuchillos de matar cerdos. Los gemelos estaban esperandolo en la tienda\nde Clotilde Armenta, frente a __________________ estaba la casa de Santiago.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.704 Spanish IV\nSpring 2005\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "REMARKS OF HIS EMINENCE ROGER CARDINAL MAHONY",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-704-spanish-iv-spring-2005/0486f0cccfb6942dff0aca7629156a64_MIT21G_704S05_mahony-cardi.pdf",
      "content": "Cardinal\nMahony Speech\non Immigration\nJusticefor\nimmigrants.org\n202-541-3214\n3211 Fourth Street, NE\nWashington, DC\nREMARKS OF HIS EMINENCE ROGER\nCARDINAL MAHONY\nArchbishop of Los Angeles\nMarch for America: Change takes Courage and Faith\nMarch 21, 2010\nI am so proud to be here today.\nTHIS IS THE FACE OF IMMIGRATION REFORM!\nCitizens, residents, immigrants... We are here today to call upon our lawmak\ners to fix a broken and immoral immigration system -- one which preys upon the\nvulnerability of immigrants and their families; one which benefits from their labor\nwithout offering the protection of our laws; and one which drives human beings\ninto the hands of smugglers and to their deaths in the desert!\n¡El presente sistema de inmigracion NO ESTA TRABAJANDO!\n¡Tenemos un sistema inmoral que toma ventaja de los inmigrantes y sus familias;\nun sistema que beneficia de su labor sin la proteccion de nuestras leyes; y un\nsistema que manda a seres humanos a las manos de coyotes y hasta la muerte!\nHoy estamos aqui -- ciudadanos, residentes, inmigrantes -- todos unidos para que\nnuestros lideres puedan escuchar claramente la voz de nuestro pueblo inmigrante\ny de los millones de Americanos quienes apoyan una reforma migratoria.\nNosotros hemos visto el impacto de las leyes migratorias y las continuas redadas:\nNuestras comunidades inmigrantes viven con miedo...\nNinos estan siendo separados de sus padres...\nTrabajadores estan siendo explotados por un sistema que los mantiene como una\npermanente\nclase inferior que vive en las sombras de la sociedad.\nHoy compartimos con nuestros lideres y la nacion esas historias que vemos todos\nlos dias.\nHistorias como la de Maria y Juan quienes vinieron a este pais cuando eran\nninos. Tienen hijos nacidos aqui, hablan ingles, trabajan duro, pagan impuestos,\ny contribuyen en su comunidad como voluntarios. Son ejemplos del sueno Ameri\ncano, pero viven cada dia con el miedo que pueden ser separados de sus hijos.\n\nEsa es una pesadilla que fue hecha realidad para la familia de Gabby, una nina de solo catorce\nanos. Ella y sus hermanos, todos ciudadanos, perdieron a su padre que fue deportado hace\ncinco anos y ahora viven con el miedo que su mama tambien sera deportada dejando a los seis\nninos completamente solos.\nWe are all here because we have seen first hand the impact of our immigration laws and\ncontinued workplace raids:\nOur immigrant communities are living in fear...\nChildren are being left without their mother or father or both...\nWorkers are being exploited by a system that keeps them as a permanent underclass living in the\nshadows of society.\nToday, we want our leaders in Washington to hear those immigrant stories we experience\neveryday.\nStories like that of Maria and Juan who were brought to this country when they were just\nchildren. Juan works the graveyard shift as a security guard. Maria works and takes care of their\nchildren who are US citizens. They speak English, they pay taxes, they volunteer in their\ncommunity -- they work day and night to provide for their children. Their lives are here in the\nUnited States. They could be the picture of the American Dream, but they live each day with the\nfear that they will be taken away from their children.\nSomething that happened to little Gabby, an American citizen, who's father was taken away at 5\na.m. from their own home when she was just nine and her baby brothers were only two. While\nmost 14 year olds spend their free time hanging out with their friends, Gabby spends her free\ntime taking care of her brothers while their mother tries to make ends meet, and all of the\nchildren have nightmares that one day \"La Migra\" will come and take their mother too.\nBut regardless of their pain and suffering Gabby's mom holds out hope that Congress and the\nPresident will pass immigration reform, so her children, after five years, can once again feel the\nwarmth of their father's embrace and never again have nightmares that they will be left alone.\nAs Americans, as a nation of immigrants, we can't just turn our backs on our immigrant brothers\nand sisters. We can do better...We must do better... We must pass comprehensive immigration\nreform!\nOn behalf of the U.S. Catholic bishops, I want you to know that the Catholic Church stands with\nyou and is in this fight until the end. We will not stop advocating on behalf of our immigrant\nbrothers and sisters, and we will continue to defend their right to be full members of our\ncommunities and nation.\n\nComo una nacion de inmigrantes, no podemos rechazar a nuestros hermanos inmigrantes.\nPodemos y debemos mejorar esta situacion. ¡La solucion es una reforma migratoria ESTE ANO!\nLes aseguro que la Iglesia Catolica seguira luchando a lado de todos ustedes hasta que se\nrealice una reforma. No vamos a parar de abogar por los inmigrantes y seguiremos\ndefendiendo sus derechos como miembros de nuestras comunidades y esta nacion. ¡Vamos a seguir llamando a\nnuestros lideres que paren con la politica antiinmigrante y pasen leyes migratorias humanas!\nMe despido con las palabras de Raul, un estudiante universitario de Los Angeles con un futuro\nen el limbo por falta de papeles. El me dio este mensaje en ingles para nuestros lideres y la\nnacion.\nI leave you with the words of Raul, a university student who was brought to this country when he\nwas only one year old. He wants to contribute all his talents and skills to this country -- the only\nhome he's ever known. Through no fault of his own he is undocumented, and his future is now\nin limbo. Raul gave me this message for our elected officials and our nation:\n\"View us as human beings; view us as brothers and sisters... We're here to work hard and\ncontribute to society... We don't want to harm anyone... We want to come together as one for a\nbetter future.\"\nDespite the fact that our broken immigration system is failing Raul, he dreams of a better future\nnot just for immigrants, but for all of us.\nI ask you to remember Raul, Juan, Maria, little Gabby and the millions more who continue to\nsuffer.\nThis is not about politics...\nThis is about real human beings.\nYou are in my prayers, and God bless you all.\nTodos ustedes estan en mis oraciones, y que Dios los bendiga.\n#####\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.704 Spanish IV\nSpring 2005\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "Español IV- Examen 2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-704-spanish-iv-spring-2005/2986c3f5090da7f05e1684145b9437d6_MIT21G_704S05_sp4_exam2.pdf",
      "content": "Espanol IV- Examen 2\nGramatica:\nz Preterito e imperfecto\nz Verbos como gustar\nz Usos de \"se\" para expresar acciones \"accidentales\"\nz Imperfecto del subjuntivo\nLecturas:\nz \"Los chicos\"\nz \"Cajas de carton\"\nz Poema: \"Convocacion de palabras\"\nz \"Un senor muy viejo con unas alas enormes\"\nPelicula : Diarios de motocicleta\nVocabulario:\n)\nroad\n)\nwall\n(canine teeth; fangs)\n(dare\nto)\nmano de obra:\ng\n)\n(\n)\n)\nnaufrago, el = castaway\n(decrepit)\nabolladuras, las = dents; bumps\nacontecimiento, el = el evento\nacoger= recibir, dar la bienvenida\nadvertir = to notice; to warn\naislado = marginado (isolated)\namenazar (amenaza, la) = to threaten (threat)\npor azar = por casualidad - by chance\ncobrar = to charge\ncompartir = share\nconfiar en = tener confianza en= to trust\ndesconfiar de = no confiar (desconfianza, la)\ncreencia, la = belief\ndespreciar = to scorn\nempeorar = agravar, hacer peor\nculpar = echar la culpa a (to blame\nfecundidad, la = la fertilidad, la abundancia\nirresoluto = indeciso (sin voluntad propia)\ntenaz = perseverante, firme\nsanciones, las = los obstaculos, las prohibiciones\ndeshacerse de = to get rid of\ntrama, la = plot\npersonaje, el = character in a play, film, story.\nNUNCA caracter\ncarretera, la =\naldea, la = village\nchabola, la = la choza (shack\ncueva, la = cave\nmuro, el =\njornal, el = el salario diario\ncolmillos, los =\natreverse = tener el valor de hacer algo\npolitica, la: policy; politics\nla frontera: border\ncruzar: to cross\ntrabajadores migratorios = trabajadores\nagricolas que migran de un lugar a otro de\nacuerdo con las cosechas\nworkforce\nchocita, la (la choza)= la chabola\nmudanza, la = cambio de una casa a otra\nmudarse = cambiar de casa o de lugar de\nresidencia\nempacar = hacer las maletas\nolla, la = vasija redonda\npena, la = el dolor, lastima\npizcar = reco er, cosechar principalmente el\nmaiz o el algodon\ncosechar, (la cosecha) = to harvest\ncosecha, la = los frutos y otros productos\nque se obtienen del cultivo de la tierra\ntemporada, la = epoca del ano\nmella, la = dent\ndarse por vencido = rendirse (to give up\nriesgo,el = el peligro\ntener que ver con = tener relacion con\nhave to do with\nasombro, el = sorpresa (astonishment\nasombrado = amazed\nasombrarse de = sorprenderse\nencerrar= to lock up\nplumas, las = feathers\ngallinazo, el = buitre (vulture)\ndecrepito = muy viejo\n\nla verguenza =\nembarassed\navergonzarse de =\nsangrar = to bleed\ntrap\narrastrar =\n(\n)\ninheritance\n)\n)\njo\nestupor =asombro\najeno (estar\nwise)\nraza: race\n)\nshame (sentir verguenza)\nestar avergonzado /a = be ashamed,\nbe ashamed of\nfanfarron, el = bully\nharapiento = in rags\ndescalzo = sin zapatos\natrapar =\ndrag\npunos, los = fists\ngentuza, la =despectivo para \"gente\"\npreso, el = el prisionero, el penado\nla pena: el sufrimiento; el castigo\nde subito = de pronto\nfrontera, la = el limite de un estado o pais\nborder\nheredar = to inherit\nherencia, la =\nlograr = alcanzar (accomplish, achieve\nlogros = exitos (accomplishments\nrescatar = salvar, recuperar (to rescue)\nbracero, el = campesino que emigra a una\nregion prospera para emplearse como jornalero.\ncarcacha, la (carcanchita) = automovil muy vie\ny en malas condiciones\nchivo expiatorio,el = scapegoat\ndesplumadas = sin plumas\nla feria = el circo\najeno a lo que ocurre) = no\nsaber lo que pasa; no estar prevenido de lo\nque ocurre.\nser ajeno = ser de otra persona\nparroco, el = el cura, el sacerdote\nsabio/a = que sabe mucho (\nla peste = el mal olor\napestar = to stink\nestorbo, el = molestia, inconveniente\nnavegante, el = viajero\npesadilla, la = nightmare\nhazana, la: hecho heroico\ntomar conciencia: darse cuenta de una\nsituacion\nrelato: cuento, narracion\npeones: trabajadores\nintrospectivo: meditativo\nlabia, la: elocuencia\ncompromiso : commitment\nconmoverse: to be moved; to be stirred; to\nbe shaken\nlabia, la : elocuencia\nlepra= leprosy\nleproso: leper\nmezcla: combinacion (blend\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.704 Spanish IV\nSpring 2005\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "Español IV Material para el examen 4",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-704-spanish-iv-spring-2005/d1a846cb15636b2e4ae85ae3bfaf153e_MIT21G_704S05_sp4_exam4.pdf",
      "content": "Espanol IV Material para el examen 4:\nGramatica:\n-\nPreposiciones y Por y Para (MG. Cap. 4)\n-\nPronombres relativos (MG. Cap.3)\n-\nGerundio e Infinitivo (MG. Cap. 6)\n-\nExpresiones problematicas (MG. Cap.8)\nMateriales discutidos:\n-\nPoemas: La United Fruit Co. y Presuntamente\n-\nCuento : Los mejor calzados\n-\nPeliculas: Machuca y Azucar amarga\n-\nParadoja\nVocabulario que debes conocer:\nrepartir = distribuir\nanfitrion = (host)\nla opera bufa = la farsa\nel/la modelo = model\nlas moscas = flies\npromover (fomentar, estimular) = promote, encourage\namaestrado/a = entrenado/a\ndesalentar, desanimar = discourage\nenajenar los albedrios = quitar la libertad\natraer =to attract\nun racimo = bunch\nlos medios de comunicacion = la prensa, television,\netc. (media)\nel titere = puppet (un gobierno titere)\nlos anuncios, la publicidad, la propaganda =\narrasar = raze to the ground\nadvertisements\nexplotar = exploit\nel entretenimiento = la distraccion\nrodar = (to roll)\ndisturbios, los; motines, los = riots\npodrido/a = rotten\nlas manifestaciones = demonstrations\nel golpe de estado = coup d'etat\nel / la manifestante = persona que participa en una\nmanifestacion\ncuartel = quarters, barracks;\nla pancarta= cartel que llevan los manifestantes\nel levantamiento = la rebelion\nla guerrilla; los guerrilleros\nderrocar (un gobierno o un regimen) = tumbar,\nderribar, hacer caer (overthrow)\nel desempleo = unemployment\nla junta militar\nel sindicato= la union de trabajadores\nel ejercito = las fuerzas armadas\nla huelga = labor strike\nlos militares = los miembros del ejercito\natentado,el = ataque\nel / la subversivo /a = subversive\nsabotear = to sabotage\nreprimir = to repress; to supress\nla bancarrota (declarar la bancarrota) = bankruptcy\n\nrepresivo = repressive\nel regimen = regime\nperseguir = to persecute, to harass\nvigilar = to police, to patrol\ncriticar= cuestionar, objetar, protestar\nsecuestrar = llevarse a alguien a la fuerza (to kidnap,\nabduct)\nencarcelar = poner en la carcel\nlos desaparecidos\nel / la transeunte = passer-by\naglomerarse = reunirse, formar una masa de gente\nel semaforo = luz de trafico\nabundar (la abundancia) = haber mucho de alguna\ncosa\nsobrar= haber en exceso, ser mas que suficiente\nlos mendigos = beggars\ncalzado = que lleva zapatos\nasomar (la cabeza) = to show, stick out\njactarse de = to brag\nla libertad de palabra, de expresion, de prensa\nla censura\nhacer cola= hacer fila\nagredir = atacar (agredido/a =atacado)\nescasez , la = la falta de algo (shortage)\npropina, la = tip\nsueldo, el = salary\ncarecer de = no tener algo\nracionar = limitar (to ration)\nestar a favor; ser partidario de = apoyar, respaldar,\nsimpatizar con\nestar en contra = oponerse a; los que se oponen, los\ncriticos, los detractores\nlas ganancias = profits\nlas perdidas, tener perdidas = losses\nel ahorro, ahorrar = savings, to save\ninvertir (las inversiones) = invest (investments)\nlos inversionistas = investors\nenriquecerse = hacerse rico\nempobrecerse =hacerse pobre\nlos impuestos = taxes\nlos gastos = expenses\nla deuda = debt (la deuda extranjera= foreign debt)\nel prestamo = loan\nprestar = to lend\ntomar prestado o pedir prestado= to borrow\nel presupuesto = budget\nlas (companias, empresas) multinacionales,\ntransnacionales\nel desarrollo = development ; desarrollar = to develop\nmejorar = to improve\nempeorar = to worsen\nlos recursos naturales = natural resources\nla mano de obra = workforce\nel mitin = reunion publica de propaganda sobre\ncuestiones politicas o sociales\nel partido politico = political party\nla campana politica = political campaign\nlos discursos = speeches\nel lema (del partido) = slogan\nlas elecciones (limpias, sucias)\nelegir = elect\nvotar (por) = vote for\narrestar = detener\n\nel concurso = contest\nperturbar o alterar el orden o la paz\nlas concursantes, las participantes, las candidatas =\nrepartir volantes (fliers) de propaganda\ncontestants\nel desfile, el corso = parade\ncompetir en el concurso = concursar\nlos reclamos = (demands)\nel premio = prize\nviolar los derechos= infringe the rights\nla beca = scholarship\nel partido = political party\nlos auspiciadores, los patrocinadores = los que cubren\nlos gastos de un concurso, un programa de radio o\ntelevision, un evento deportivo a cambio de anunciar\nla politica = (policy, politics)\nsus productos, servicios, etc. (sponsors)\nauspiciar = to sponsor\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.704 Spanish IV\nSpring 2005\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "Español IV - Primavera 2005- Material para el Examen #1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-704-spanish-iv-spring-2005/7de3e2a467e8c9668a66756f696cbfdf_MIT21G_704S05_sp4_exam1.pdf",
      "content": "Espanol IV - Primavera 2005- Material para el Examen #1\nI. Material:\n-\nEspana de cerca\n-\nEl etnografo\n-\nMujeres al borde de un ataque de nervios\nII. Vocabulario de las lecturas\nIII. Gramatica:\n-\nSer - Estar - Haber - Hacer - Tener (Manual de gramatica , MG, Cap. 7) *Repasar adjetivos y\nexpresiones que solo se usan con Ser, Estar o Tener\n-\nExpresiones de tiempo con Hace que ... y Llevar\n-\nSubjuntivo: clausulas nominales (con verbos de influencia, duda, emocion y valor) , en clausulas\nadjetivales y adverbiales (MG, p. 209-223)\n-\nMandatos (Imperativos) (MG, p. 174-179)\nIV. Tipos de ejercicios:\n1. Llenar blancos\n2. Completar oraciones (como los ejercicios con el subjuntivo para \" Mujeres al borde...\")\n3. Escribir usando ciertos verbos y expresiones con el subjuntivo o mandatos\n4. Oraciones usando \"hace que...\" y \"llevar\".\n5. Una pregunta de ensayo sobre los temas discutidos en clase: Espana de cerca, el cuento \"El etnografo\" y la\npelicula \"Mujeres al borde de un ataque de nervios\".\n-\ntopico, el = el cliche (NUNCA el tema)\n-\nengreido = arrogante, esnob, demasiado\norgulloso, altanero\n-\nlos medios de comunicacion = the media\n-\nfiel = leal, constante, devoto, confiable\n-\ndescreer = desconfiar\n-\nfrio, = insensible; apatico\n-\nemprender = iniciar, empesar\n-\ngalante = obsequioso, atento\n-\nprever = predecir\n-\nhipocrita = falso, enganoso, mentiroso\n-\ndoblar = to dub (filmes)\n-\nhonesto = decente, honrado, justo\n-\nel doblaje = dubbing\n-\nincompetente = ineficiente, inutil\n-\nel contestador = answering machine\n-\ninfiel = falso, desleal, enganoso\n-\nel somnifero = sleeping pill\n-\ningenuo/a = inocente, credulo\n-\nel/ la amante = lover\n-\ninseguro = indeciso, dudoso\n-\nenganar = to cheat\n-\ninsensible = indiferente, duro, frio\n-\nfingir = to pretend\n-\nmalcriado = mimado, consentido, infantil\n-\nexigir = to demand\n-\nmujeriego = donjuan, conquistador\n-\nestar harto/ a = to be fed up with\n-\nreceloso = desconfiado, temeroso\n-\ncoquetear = flirtear\n-\nsensato (sensible)= prudente, juicioso,\n-\nla pareja = couple; partner\npensativo, sosegado, tranquilo\n-\nla pandilla = grupo de gente; gang\n-\nsensible (sensitive) = impresionable, que\n-\nregatear = to bargain\nse emociona con facilidad; que se deja\n-\ncriar = to raise\nllevar por los sentimientos\n-\nla crianza = upbringing\n-\nsereno = tranquilo, calmado, cuerdo,\necuanime\n-\nmimado = malcriado/a; consentido/a\n-\nsincero = franco\n-\nlos quehaceres = las tareas domesticas\n-\nsinverguenza: canalla, pillo (someone\n-\ntrama, la = plot\n\nshameless, scoundrel)\n-\npersonaje, el = character in a play, film, story.\nNUNCA caracter\n-\ntacano = que no le gusta gastar dinero\n-\ncaracter, el = character en el sentido de las\n-\ntemperamental = que tiene reacciones\ncualidades de una persona, su conducta. Ej. Mi\nintensas; que cambia frecuentemente de\namigo tiene muy mal caracter, se enoja muy\nestados de animo y de humor\nfacilmente.\n-\ntimido = inseguro, callado\n-\nprotagonista, el /la = el personaje principal de una\n-\ntorpe = no muy listo; clumsy\nnovela, cuento, pelicula, etc. (NUNCA el caracter)\n-\nvanidoso= vano, coqueto, presumido\n-\nla casualidad= la coincidencia\n-\nzalamero = empalagoso, adulador ( que\n-\nel azar = chance\ndemuestra carino afectadamente)\n-\nla verguenza = shame (sentir verguenza)\n-\nVerbos reflexivos:\n-\nestar avergonzado/a = be ashamed, embarassed\n-\nacostumbrarse a = get used to\n-\nla venganza = revenge (vengarse)\n-\nalegrarse de\n-\ntraicionar= betray\n-\naprovecharse de = take advantage of\n-\nlos celos= jealousy\n-\narrepentirse de = to repent\n-\nAdjetivos descriptivos:\n-\nasustarse de= to be scared of\n-\naltruista = (que piensa en los otros) generoso,\n-\natreverse a = to dare to\ndesinteresado\n-\navergonzarse de = to be ashamed of\n-\namable = afectuoso, cortes, atento\n-\nburlarse de = to make fun of\n-\nantipatico = desagradable, pesado\n-\ncalmarse, tranquilizarse\n-\napacible = sereno, sosegado\n-\nconvertirse en = to become\n-\napasionado = impetuoso, irreflexivo, emotivo,\n-\ndarse cuenta de = to realize\nimpulsivo\n-\ndespedirse de = decir adios\n-\natrevido = daring or fresh\n-\nequivocarse = to make a mistake\n-\nbondadoso = compasivo, humanitario,\n-\nenamorarse de = to fall in love with\n-\nceloso = que tiene celos\n-\nenfrentarse a = hacer frente a; dar la\n-\nreceloso = desconfiado\ncara\n-\ncobarde = temeroso, de poco animo\n-\nfiarse de = confiar en, tener confianza en\n-\ncomplaciente = obliging\n-\nfugarse = escaparse\n-\ncomprensivo = tolerante, (understanding)\n-\nirse = marcharse = largarse\n-\ncredulo = confiado, ingenuo, candido\n-\nnegarse a = refuse to\n-\ndesbalanceado = loco, desequilibrado, desquiciado,\n-\nolvidarse de = to forget\ntrastornado\n-\npreocuparse por = to worry about\n-\ndesmadrado/a = descontrolado/a\n-\nquedarse = to stay\n-\ndeshonesto = inmoral, amoral, libertino\n-\nquejarse de = to complain\n-\ndespistado = distraido, desorientado, que no se da\ncuenta de lo que ocurre a su alrededor;\n-\nreirse de\n-\nresignarse a = to resign oneself to\nfresco\n-\ndesvergonzado = sin verguenza (shame), cinico,\nsomething\n-\nvolverse (loco/a) = become crazy\n-\negoista = que solo piensa en si mismo; interesado\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.704 Spanish IV\nSpring 2005\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}