{
  "course_name": "Spanish III",
  "course_description": "This course is the first intermediate-level course in Spanish, with a focus on grammar review, additional vocabulary, writing of essays in Spanish and enhancement of cultural awareness. Group activities and projects, and conversation are emphasized. There are detailed simulation activities, readings about literature and art from Latin America and Spain, activities with music videos and interviews, and viewings of recent films such as El espinazo del diablo, Juana la loca, and María llena eres de gracia. Students also participate in the MITUPV Exchange project, a multimedia-centered Web site that deals with university life at MIT, the Universidad Politécnica de Valencia in Spain, and other universities.",
  "topics": [
    "Humanities",
    "Language",
    "Spanish",
    "Humanities",
    "Language",
    "Spanish"
  ],
  "syllabus_content": "Hay una lista de las actividades diarias de la clase en el\ncalendario\n.\n\nCourse Meeting Times\n\nLectures: 4 sessions / week, 1 hour / session\n\nTextos\n\nSandstedt, Lynn A., Ralph Kite, and John G. Copeland.\nLiteratura y arte: Intermediate Spanish\n. 8th ed. Boston, MA: Thomson/Heinle, 2004. ISBN: 0838457819.\n\nGill, Mary McVey, Brenda Wegmann, and Teresa Mendez-Faith.\nEn contacto: Gramatica en accion\n. 7th ed. Boston, MA: Thomson/Heinle, 2003. ISBN: 003034722X.\n\nEl proposito\n\nEl proposito de esta asignatura es el mejoramiento y la ampliacion de su espanol oral, auditivo y escrito, y la adquisicion de nuevos conocimientos y perspectivas culturales. Las actividades tipicas de esta clase son: discutir las lecturas y los videos; trabajar en grupos y presentar sus ideas a la clase; hacer presentaciones orales; redactar composiciones sobre varios temas; hacer ejercicios de gramatica y de vocabulario; conversar sobre diversos temas y participar en juegos, minidramas y otras actividades.\n\nTrabajos escritos\n\nDurante la primera parte del semestre, habra dos etapas en la redaccion y entrega de los trabajos escritos. Primero, se entrega un borrador (\"first draft\") escrito en la computadora, con espacio doble. Usted recibira de vuelta el borrador con los errores corregidos o subrayados y ocho dias despues, entregara la version final con las correcciones y revisiones. Esta version recibira la nota. (Si el borrador requiere pocos cambios, recibira una nota sin necesidad de hacer una segunda version). A partir de la tercera composicion, se eliminara la etapa del borrador.\n\nProyecto MITUPV\n\nTambien habra componentes orales y escritos en su participacion en el proyecto MITUPV, pagina Web programada aqui en MIT. Es un proyecto de intercambio virtual con alumnos de la Universidad Politecnica de Valencia (Espana) y, a veces, con estudiantes de otras universidades. Su participacion en este proyecto consistira en:\n\ncontribuir material\nen texto redactado en castellano y en ingles, a los Foros (Bulletin Boards) y a la seccion de Comentarios sobre Multimedia;\n\nagregar enlaces (links), subir (\"upload\")\nfotos\ny hacer un\nvideo\ncon discursos y entrevistas en ambas lenguas (hay que mandarle email al profesor Morgenstern sobre el tema del video; Ud. le entrega el cassette mini dv a su profesor, asi que no tiene Ud. que editar el video);\n\nhacer una contribucion a la seccion\nTeach me/Ensename\n;\n\nhacer\nreportes orales\n(de 1-2 minutos) y\nescritos\n(de 1-2 paginas) sobre sus contribuciones e impresiones.\n\nLa evaluacion\n\nLa nota final consta de estos elementos:\n\nELEMENTOS\n\nPORCENTAJES\n\nLa participacion diaria en clase, incluyendo las presentaciones orales\n\n30%\n\nLa participacion en el proyecto MITUPV\n\n25%\n\nLos examenes escritos y orales\n\n25%\n\nLos trabajos escritos\n\n20%\n\nLa asistencia\n\nLa Asistencia a clase es de muchisima importancia. Si un alumno falta mas de\ncuatro\nveces, recibira una \"F\" en la asignatura. Las excepciones requieren una carta de su medico o del decano, u otras circunstancias extraordinarias. Deberia usted hablar con su profesor con anticipacion si tiene que hacer un viaje, etc. Si usted no ha preparado la leccion, es mejor venir a clase de todos modos y decirnoslo, que estar ausente. En este caso, usted puede pedir que no le hagamos preguntas durante la clase. Recibiremos sus sugerencias con mucho gusto. Una sugerencia con respecto a las lecturas es que no debe usted pasar horas buscando palabras en el diccionario; en muchas circunstancias es mejor adivinar (\"guess\") y hacer suposiciones basadas en el contexto o en el sentido comun. En clase trate de hablar lo mas posible y no tenga miedo de cometer errores: los errores son una parte natural del proceso de aprendizaje de un segundo idioma.\n\nVideo de actividades\n\n(\nMP4 - 12 MB\n)\n\nAqui esta un video con segmentos de las siguientes actividades:\n\nLa universidad utopica (clase 25)\n\nGregorio y Maria (clase 45)\n\nActividad de dos paises (clase 46)\n\nCalendario\n\nAqui esta una lista de las actividades diarias de la clase. Por favor visite\nreadings\ny\nassignments\npara ver el todo de la tarea.\n\nCLASES\n\nACTIVIDADES DIARIAS\n\nIntroduccion; actividad: \"Convivencia\"; recibir hojas (letra de canciones).\n\nTrabajar en grupos con canciones (pronosticar); mirar videos de canciones.\n\nGramatica\n, capitulo 1.\n\nLit. y arte\n, Unidad 1.\n\nGramatica\n, capitulo 2.\n\nEmpezar pelicula\nEl espinazo del diablo\n.\n\nLit. y arte\n, Unidad 2; seguir con\nEl espinazo del diablo\n.\n\nGramatica\n, capitulo 3.\n\nSeguir con\nEl espinazo del diablo\n.\n\nDar resumen oral de su parrafo; seguir con\nEl espinazo del diablo\n.\n\nSeguir con\nEl espinazo del diablo\n.\n\nAcabar con\nEl espinazo del diablo\n.\n\nActividad: \"Engano.\"\n\nMirar segmentos del video filmado en Galicia (Espana); actividad de grupo con el video.\n\nGramatica\n, capitulo 4.\n\nGramatica\n, capitulo 5.\n\nTrabajar en grupos con la hoja de las predicciones; firmar hoja para el Examen Oral.\n\nRepaso; conversacion sobre las noticias locales, nacionales o internacionales.\n\nExamen oral.\n\nExamen escrito.\n\nLit. y arte\n, Unidad 4.\n\nTrabajar en grupos con la hoja sobre \"Don Payasito.\"\n\nVer breve segmento de la pelicula\nJuana la Loca\n.\n\nRecibir videos de\nJuana la Loca\npara compartir y ver fuera de clase (hay que acabar la pelicula para el proximo semana).\n\nGramatica\n, capitulo 6.\n\nGramatica\n, capitulo 7.\n\nActividad: \"La universidad utopica.\"\n\nLit. y arte\n, Unidad 5; discutir\nJuana la Loca\n.\n\nExamen escrito.\n\nLit. y arte\n, Unidad 6.\n\nEmpezar la pelicula\nEn el tiempo de las mariposas\n.\n\nSeguir con\nEn el tiempo de las mariposas\n.\n\nSeguir con\nEn el tiempo de las mariposas\n.\n\nSeguir con\nEn el tiempo de las mariposas\n.\n\nGramatica\n, capitulo 8.\n\nAcabar\nEn el tiempo de las mariposas\n.\n\nGramatica\n, capitulo 9.\n\nVideo de Mana; actividad con entrevistas y canciones.\n\nRepaso de gramatica y/o conversacion.\n\nLit. y arte\n, Unidad 7.\n\nGramatica\n, capitulo 10; empezar la pelicula\nMaria llena eres de gracia\n.\n\nLit. y arte\n, Unidad 8; seguir con\nMaria llena eres de gracia\n.\n\nGramatica\n, capitulo 11; seguir con\nMaria llena eres de gracia\n.\n\nLit. y arte\n, Unidad 9; seguir con\nMaria llena eres de gracia\n.\n\nGramatica\n, capitulo 12; acabar\nMaria llena eres de gracia\n.\n\nLit. y arte\n, Unidad 10 y 11; firmar hoja para Examen Oral.\n\nExamen oral.\n\nActividad: \"Gregorio y Maria\"; recibir materiales para Actividad de los dos paises.\n\nActividad de los dos paises.\n\nRepaso para Examen.\n\nUltimo examen escrito.\n\nPresentar contribucion a Ensename.\n\nEmpezar a planear minidramas/minicomedias.\n\nSeguir planeando minidramas/minicomedias.\n\nSeguir planeando minidramas/minicomedias.\n\nPresentar minidramas/minicomedias.",
  "files": [
    {
      "category": "Resource",
      "title": "Adolfo Plasencia",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-703-spanish-iii-spring-2006/aa73186f615e79766b9098d7972123a0_MIT21G_703S06_adolfo.pdf",
      "content": "MITUPV EXCHANGE.\nTransformar la formacion humanistica mediante la tecnologia.\nVislumbrar la universidad virtual ideal.\nAdolfo Plasencia. Coordinador Proyecto en la UPV. Universidad Politecnica de Valencia.\nadolfo@mag.upv.es\nEl MITUPV EXCHANGE es una experiencia de intercambio y conocimiento compartido\nque esta desarrollandose entre alumnos y profesores de la ETSID de la Universidad\nPolitecnica de Valencia (Espana) y del MIT (Massachusetts Institute of Technology), cuya\nandadura se inicio en el curso 2000-2001 y al que en anos posteriores se incorporan\ngrupos de alumnos y profesores de la Universidad de Texas, en Austin, la Universidad de\nValencia, y la Universidad de Cambridge (Inglaterra). Como objetivos inmediatos, al\nmismo tiempo, el proyecto trata de que los alumnos desarrollen procesos de conocimiento\ncompartido entre las dos comunidades universitarias, sobre todo sus idiomas y culturas\nrespectivas, y tambien el conocimiento mutuo de las especialidades en las respectivas\ncarreras universitarias que estan cursando, asi como las tecnologias multimedia y de\nInternet (la base y herramienta principal de creacion de los contenidos). Como objetivo a\nlargo plazo pretende el desarrollo de modelos para una 'Universidad Virtual Ideal'\ndisenada de 'abajo a arriba', es decir pensados por los propios alumnos, para que luego\ndicho modelo sea considerado por los estamentos de direccion y planificacion docentes.\nLa Web del proyecto (http://mitupv.mit.edu) es una acumulacion de contenidos\ndesarrollados con formatos y tecnologias de textos, imagenes, archivos sonoros (mp3,\nmusica fractal), etc. y sobre todo video digital -en todas sus variantes (peliculas, imagenes\nnavegables interactivas y panoramas de realidad virtual, morphings, etc.) todo integrado\nen una robusta plataforma Web con hosting en el MIT (con una Web equivalente,\n_________________________________________________________\nCourtesy of Adolfo\nPlasencia. Used\nwith permission.\n\nactualmente en construccion en la UPV) que es el espacio virtual comun que deben usar\ncotidianamente en el proyecto.\nHay varias caracteristicas poco frecuentes en este proyecto, en relacion a otras iniciativas\nde este tipo: una es la articulacion o integracion de los conocimientos de humanidades con\nlas disciplinas de ingenieria, ciencia y tecnologia. El grupo de alumnos del MIT\nparticipantes en el proyecto (The Boston Side), que estan cursando en su mayor parte\ncarreras de ingenierias (de electrica, mecanica, aeronauticas, astrofisica, en biotecnologias,\netc.) participan en realidad como estudiantes de idioma y cultura espanola, es decir como\nse dice en Espana, son integrantes del proyecto en el momento en que son alumnos de\n'Letras' o 'Humanidades'.\nLinuRobots e ingenieria con teatro, biotecnologia, musica fractal, semiconductores y\nestructuras volantes.\nEn la parte espanola del proyecto (la llamamos The Valencia Side) en la que\nparticipan los alumnos de la Universidad Politecnica de Valencia (Espana) tambien hay\nesa participacion hibrida. Los alumnos del Prof. Adolfo Plasencia (coordinador del\nproyecto en la UPV) docente en formacion de postgrado, que se estan especializando en\ncreacion de contenidos con herramientas multimedia y de la Red (del Programa Master de\nAplicaciones Multimedia para Internet) trabajan en el proyecto en equipo con otro grupo\nde alumnos de ingenierias (Escuela Tecnica Superior de Ingenieria del Diseno) de la UPV\nque estan estudiando ingles y cultura anglosajona en pregrado en las clases del prof.\nRafael Seiz. De ahi que en la Web del Proyecto se pueden ver aportaciones creadas con\nvariantes muy espectaculares de la tecnologias multimedia para mostrar tambien\naportaciones de ingenieria y tecnologia avanzada, en las que lo humanistico, artistico y\ncultural (las aportaciones sobre Shakespeare de equipo de la UT de Austin/Universidad de\nValencia que dirige el prof. Vicente Fores) se entrecruza con lo tecnologico y lo cientifico.\nSe puede ver, esto en los videos en los que se muestra, por ejemplo, al LinuRobot, un\nrobot movil autonomo de tecnologia Linux construido en la UPV que habla ingles y\nespanol (y que cuando se aburre recita a quien encuentra en su camino, refranes antiguos\npopulares\ndel\nidioma\nespanol;\nes\nun\nrobot\ncon\n'buen\nhumor')\n[http://mitupv.mit.edu/multimedia-display.tcl?mitupv_mm_id=2625&section=university],\no tambien musica fractal creada por un artista que investiga arte a traves de las\n_________________________________________________________\n\nmatematicas\nen\nla\nUPV\n[http://mitupv.mit.edu/multimedia\ndisplay.tcl?mitupv_mm_id=2507&section=university], o los videos con estructuras\nvolantes\npara volar sin viento en\nun interior\nal ritmo\nde una\nmusica\n[http://mitupv.mit.edu/mitupv-uploads/2171.mov].\nEs decir, la Web del Proyecto MITUPV es un espacio en el que los participantes\nintercambian conocimientos propios de disciplinas de Ciencias, Tecnologia Multimedia;\nde creacion de contenidos en Internet, de todo tipo de Ingenierias y de Humanidades:\nliteratura y drama, culturas e idioma. Por ello, el espacio virtual de encuentro de todos\nellos es una Web, en la que hay videos mostrando laboratorios de semiconductores,\nbiotecnologias, ciencias quimicas, espacios de arquitectura, clases de arte, pintura y\nescultura, creacion de contenidos experimentales en multimedia e Internet; hay deportes,\ndiversion y ocio. Los participantes hasta el momento alcanzan ya los 900, acumulan mas\nde 40 nacionalidades diferentes y las mas variadas culturas originarias que van desde las\nasiaticas del norte y el sur hasta las iberoamericanas o las anglosajonas. La comunidad del\nMITUPV EXCHANGE es verdaderamente global.\nConceptos emergentes. Sincronico/asincronico. Textualizado/audiovisualizado.\nEl proyecto ha acumulado una experiencia ya de dos anos y lleva camino de pasar\nde ser un proyecto bipolar MIT-UPV a convertirse en un Proyecto en Red.\nComo conceptos emergentes ya se pueden detectar algunos de esta experiencia: la\narticulacion de un fondo de escenario o de suelo comun aportado por los nuevos medios\n(Internet y sus herramientas) y la tecnologias (multimedia como tendencia a la\naudiovisualizacion y la asincronia en las formas de compartir el conocimiento y la\ndiversidad cultural) y tambien a la disolucion en la barreras de separacion entre las\nHumanidades, las Ciencias y las Tecnologias pero tambien la aparicion de un universo\ncultural que, al tiempo, tiene un solo espacio comun para compartir el conocimiento\nmediante los nuevos medios y permite a las diversas cultura originarias de los\nparticipantes en las comunidad de ese universo cultural mantener su diversidad humana y\ncultural. De todo eso se puede percibir matices o muestras en las relaciones que, entre si,\nmantienen los participantes en este proyecto.\nLenguajes comunes. Diversidad Cultural. Tecnologia comun. Fuzzy Identity.\nEl proyecto ha acumulado muchos tipos de riqueza espiritual. Dentro de el se escribe, se\nhabla, tanto en idiomas espanol como ingles, pero tambien se comunica con imagenes,\nmusica (moderna, tradicional, jazz o fractal), sonidos o la voz de los robots. Pero no solo\nse aprende el idioma del 'otro'; si el idioma del 'otro' es el espanol o el ingles, las culturas\noriginarias del 'otro' son muchas mas: hay alumnos participantes de Boston, Nueva York,\nCalifornia, Austin o Valencia en Espana, pero tambien los hay de Sudafrica, India, Chile,\nCorea, Japon, o de diversos sitios de Europa que han idos a estudiar su carrera en la UPV\nen al MIT o en la UT Austin. La asociacion de estudiantes del Sur de Asia ensenan a los\nespanoles como es su folclore o su gastronomica mientas los valencianos de Espana\nmuestran a estadounidenses, coreanos o sudafricanos como se cocina la paella, el mas\nfamoso plato tipico de la gastronomia valenciana y espanola. Unos y otros, al tiempo que\naprenden sus lenguas respectivas, utilizan herramientas tecnologicas comunes. Comparten\n_________________________________________________________\n\nun espacio comun en Internet, en el que se lo cuentan todo en una ventana de Chat\nprogramada en lenguaje JAVA, sobre una arquitectura de navegacion de paginas html en\nla que depositan sus narraciones en video QuickTime, Windows Media, imagenes\nestaticas comprimidas en .jpg o en movimiento como GIF o dinamicas de realidad virtual\nQTVR o de fractales.\nSi sus 'linguas francas' es el ingles/espanol, su jerga compartida esta llenas de expresiones\nque incluyen html, Java, .mov, .wmv; chat; iMovie; Media Cleaner, Photoshop; www;\nhttp://; etc., todas estas expresiones tipograficas y sonoras son comunes en la comunidad\ndel MITUPV Exchange.\n\"Enviame un .jpg de esa playa en donde has estado el fin de semana\" -pide Leticia, un\nalumna mexicana de Sonora que estudia produccion de contenidos multimedia en\nValencia (Espana)- y Lodewyk, un alumno nacido en Pretoria, Sudafrica, que esta ahora\nestudiando en el MIT muestra orgulloso el fabuloso laboratorio MIT's Microsystems\nTechnology Laboratories en donde esta trabajando. Lodewyk dice en su curriculum de la\nWeb del MITUPV Exchange:... \"Originariamente soy de Sudafrica...\" y muestra en sus\naportaciones una identidad espiritual y cultural difusa, borrosa: una fuzzy identity, con\nvaliosos elementos comunes, combinados con poderosas muestras de la diversidad cultural\nde nuestro planeta, en el escenario de Internet que una propiedad comun de todos ellos.\nTambien podemos ver en el proyecto a los eCiclopes de la gran reunion de tecnologia en\nred llamada Campus Party, que cada verano reune a 3.000 jovenes en Valencia (Espana)\nconectados a una red\nATM de 155 MB/seg. [http://mitupv.mit.edu/multimedia\ndisplay.tcl?mitupv_mm_id=2906&section=university], creados en el proyecto ARQuark y\nque mostraron alli sus creadores: los jovenes tecnologos Benjamin Close and Wayne\nPiekarsky de la South Australia Univ. No puede ser un entorno mas variado y mas global.\nAprender y desaprender.\nObviamente el Proyecto es una herramienta de aprendizaje para los alumnos y lo esta\nresultando ser intensamente para los profesores. Pero, el corto periodo de tiempo que lleva\nya en marcha ha sido suficiente como para, obligados seguramente por la deriva de la ley\nde Moore y otros factores mas darwinianos de la vertiginosa evolucion tecnologica,\naprender a desaprender: adaptarnos a borrar de nuestra memoria tecnica\nformatos\ntecnologicos, herramientas de software que subitamente caen en desuso porque otras mas\nsimples, poderosas, eficientes y faciles de usar dejan en evidencia las que estamos usando\ny cuyas tecnicas habiamos aprendido, sobre todo, en tiempo robado al sueno y al\ndescanso. \"Esto es asi -dice Patricia, una alumna-: no hay que darle mas vueltas\". Pero eso\nes complicado cuando se persigue encontrar modelos con los que despues se aprenda, se\ncomunique y se consiga que trabajo de ensenar y aprender en las universidades se haga\nmas rapido, mas facil, con mayor rendimiento, mas universal, mas adaptado a la\ndiversidad global.\n_________________________________________________________\n\nLa universidad ideal. Presencial. Virtual.\n¿Como ha de ser la universidad ideal?, se plantan los alumnos y ¿como seria una\nuniversidad mas eficiente?, se preguntan los profesores en este proyecto. Hay ahora\nmuchas opiniones encontradas al respecto. ¿Ha de ser fisica, presencial? Si. ¿Ha de ser\nvirtual, abierta? Si. Ha de servir para aprender cosas utiles para los profesionales de\nfuturo? Claro. Pero, sorpresa: ha de servir tambien para aprender a desaprender. Ya lo\nestamos viendo en el proyecto. La herramientas que estamos utilizando ahora, los\nmetodos para comunicar el conocimiento, para acumularlo, no son las mismas que cuando\nempezamos, son cambiantes, pero al tiempo, comunes, han de ser comunes para alumnos\nde ingenieria, filosofia, literatura, arte, lenguaje, biotecnologia, arquitectura, organizacion\nde empresas. Alumnos de todas esas disciplinas los usan al mismo tiempo en este\nproyecto.\nAsincrono/Sincrono. Localizados/Deslocalizados. De dia/de noche.\nEn Clase/De Vacaciones.\nLa participacion en el proyecto no tiene por que ser desde un aula. Todo componente de la\ncomunidad virtual MITUPV Exchange puede hacerlo desde cualquier ordenador\nconectado a Internet: lo puede hacer desde un cibercafe, o desde su casa, desde su\nordenador personal conectado sin cables a una red Wi-fi; o desde un coche en movimiento\ncon ordenador a bordo conectado a Internet; o desde su propio telefono movil o PDA.\nEntre Valencia (Espana) donde esta la UPV y Boston donde esta el MIT hay uno\ndiferencia horaria de 6 horas y 7 con Austin, que es donde esta la Univ de Texas. Asi que\ncuando los alumnos estan trabajando en el proyecto a las 9:00 am. en Valencia, en Boston\nson las 3 de la madrugada y en Austin son las 2:00 am. Eso quiere decir que normalmente\ncuando los alumnos de la UPV trabajan temprano, sus companeros de Boston y Austin\nestan durmiendo (si no es epoca de examenes en que trabajan toda la noche). Entonces\ncolaboran en el proyecto en modo asincronico. Pero cuando tiene que hacer un chat, que\nes un modo sincronico, los alumnos espanoles han de participar asi a la hora de la cena en\nsu ciudad para que los alumnos de Boston y Austin los pueden hacer en su horario normal\nde trabajo. Es decir que la participacion sincronica requiere una muy buena coordinacion\n_________________________________________________________\n\nhoraria y tambien de calendarios ya que la posicion de los festivos, las vacaciones, los\nexamenes y los principios y finales de curso son en fechas diferentes en las universidades\nespanolas y las de EE.UU. Claro que tambien hay alumnos que ponen sus comentarios y\nparticipan desde sus lugares de vacaciones o viajes en donde tambien pueden encontrar un\nordenador conectado a Internet. Hay alumnos siempre predispuestos a presumir de que\nestan participando desde Bahamas o desde Honolulu. Esto no gusta nada a los que estan\ntrabajando duramente en las aulas. Porque a veces en una universidad europea, son\nvacaciones mientras que en otra de EE.UU se esta trabajando muy duro. Para eso esta la\nseccion del calendario interactivo en la Web del proyecto y el 'Tiempo Internet' que da el\nmismo horario en Internet para todo los lugares del planeta. Es ideal para programar chats\nen el proyecto.\nEconomia de la presencia. Economia de la atencion. Cronologias inversas.\nConocimiento acumulado.\nEl espacio virtual que la plataforma Web del MITUPV EXCHANGE es un ambito de una\ndimension considerable. En el 'hibernan' en stand-by multiples rastros de actos de\ncomunicacion, propuestas, comentarios, preguntas y respuestas asi como experiencias\nvitales: todo un enorme corpus de conocimiento intencionado codificado digitalmente en\nforma de texto, imagenes o video, cuyos items estan listos 24 horas al dia, 365 dias al ano\npara ser requeridos por nuestra atencion a traves de Internet en tiempo elegido por\ncualquier cibernauta o componente de la comunidad virtual.\nEsos rastros tambien lo son de presencia de los participantes de dicha comunidad virtual.\nPero la presencia virtual que insinuan, ademas, no es homogenea sino que a nuestra\npercepcion espacio-temporal y comunicativa nos llega ligada al codigo y medio digital\nque nos transmite el mensaje a traves de la Web. En la nueva jerga de la comunicacion\nvirtual y sobre todo en la de la ensenanza en la que se combina el e-learning con las clases\ntradicionales con profesor y alumnos en la clase en coincidencia espacio-temporal\ndistancia, se distinguen estas ultimas de las realizadas virtualmente denominado a las\ntradicionales 'clases presenciales' de las 'clases virtuales' que son las realizadas a traves\nde la Web o por medios electronicos y telematicos. La presencia fisica directa es o no es...\nno tiene grados intermedios, pero la 'presencia virtual' en la comunidad si los tiene. En la\n'vida' relacional de la comunidad virtual del MITUPV Exchange hay toda una\ncombinatorio comunicacional que para nuestra percepcion se muestra en una gradacion de\nniveles de 'presencia virtual' mediante la que los otros se muestran a nuestra percepcion y\na nuestra mente con una intensidad que es tanto mas intensa e 'inmediata' cuando la\ncomunicacion es mas cercana a lo que entendemos como una presencia fisica, por\nejemplo, un mensaje en forma de texto que alguien coloca en la web del proyecto y que\n'hiberna' asincronicamente hasta que alguien 'entra' en tiempo elegido en la Web y lo lee.\nEso implica una presencia virtual inducida que es mucho menos intensa que si el mismo\ntexto pertenece a una comunicacion sincronica en un chat ya que nuestros silenciosos\ncomentarios en forma de texto son respondidos por una 'presencia' que nos hace llegar a\nla ventana del chat de forma interactiva e instantanea. Es decir que una presencia virtual\nen condiciones de sincronia provoca un acto de percepcion mas intenso que un acto de\ncomunicacion asincronico aunque en los dos casos la comunicacion sea en forma de texto.\nY en la misma linea, una comunicacion en forma de video digital que se puede ver una\nvez bajada al disco duro desde la web, es una presencia virtual mas intensa aparentemente,\na pesar de que no tiene reciprocidad de forma instantanea y a su vez seria una presencia\n_________________________________________________________\n\nvirtual menos intensa si fuera una videoconferencia biunivoca, es decir, un 'chat\naudiovisual' en lugar de un chat en forma de texto.\nLa web del MITUPV Exchange es un 'lugar' virtual excelente para que los alumnos y\nprofesores aprendan a sacar partido a los medios virtuales con que tenemos que\ncomunicarnos en esta epoca que nos ha tocado vivir en que parte de nuestros actos de\ncomunicacion con otros han de ser mediante 'presencia' mediada electronicamente de\ndiversos grados o intensidades perceptivas.\nConforme la acumulacion de contenidos crecia mas y mas en cada una de las secciones del\nproyecto, se hacia necesario para los autores de los mensajes y contenidos desarrollar\nalgunos metodos y trucos para estimular y conseguir el redireccionamiento y la\nfocalizacion de la atencion de los otros participantes sombre los contenidos propios.\nAsi que aqui la atencion que le dedican los participantes a los mensajes de los demas y las\nrespuesta virtual que han generado los contenidos de 'los otros', a su vez, fluye en forme\nde toda una gama de valores e intensidades perceptivas. Podria usar el termino 'economia\nde la atencion' no solo en el sentido en que lo manejan, por ejemplo Thomas H.\nDavenport y John C. Beck en su conocido libro1 de gran predicamento en las empresas y\nel mundo del marketing sino tambien en el sentido que de la busqueda del maximo grado\nde reconocimiento que los demas integrantes de la comunidad virtual da al valor que ellos\nobtienen utilizando su tiempo y esfuerzo en descifrar cada aportacion de contenido y si\nsatisface su esfuerzo en 'premiarlo' con una respuesta personal.\nSobre los valores y grados de la economia de la atencion estamos experimentando en el\nMITUPV muchos metodos: en la semantica intentamos imaginar primero y utilizar\ndespues terminos en nuestros textos (desde palabra simpaticas hasta jergas intuidas en los\ndemas) que sean comprensibles para la combinatoria cultural, probablemente hibrida, que\nimaginamos en la mente de los otros participantes. Hemos inventado graficos (banners\nsobredimensionados), construidos con colores e imagenes pregnantes pero tambien con\ntrucos conceptuales avanzados propios de la comunicacion grafica y la publicidad, que\nintentan conseguir que los participantes centren su atencion en nuestros videos\ny\ncontenidos de texto contiguos que compiten con el resto en un inmenso acumulo de\ninformacion tambien accesible en el mismo contexto; hemos identificado con titulos\natractivos los videos en un tono proactivo y con palabras pregnantes en texto bilingue.\nTambien hemos utilizado metodos propios de la TV para con material complementario de\nla edicion crear videos sorprendentes: Tomas Falsas (OUTTAKES) que ha hecho\nidentificarse a los otros participantes ya que casi todo el mundo inexperto sufre graciosos\nbloqueos al hablar ante la camara. El mejor termometro para medir el exito de un\ncontenido concreto en le 'economia de la atencion' de nuestra web es el numero de\ncomentarios distintos que genera un determinado contenido e incluso las exclamaciones y\nonomatopeyas en el titulo de un comentario sobre un video. En una web en la que hay\ncentenares de videos, que uno de ellos provoque diez comentarios escritos distintos es un\ngran exito ya que no todos los que lo ven y escuchan luego escriben sobre ello ya que para\nun novato en idioma foraneo el comentario en el idioma 'del otro\" es un considerable\nesfuerzo.\n1 Attention Economy: Understanding the New Currency of Business, Thomas H. Davenport, John C. Beck\nHarvard Business School Press.\n_________________________________________________________\n\nCuando, por ejemplo Lodewyk Steyn nos muestra la 'salas blancas' del Microsystems\nTecnology Laboratory y entrevista a la directora de operaciones Virginia Duke\n[http://mitupv.mit.edu/multimedia-display.tcl?mitupv_mm_id=2875&section=university]\ny de igual manera Ferran Soriano dialoga en la UPV con Jose, creador y constructor del\nLinuRobot:\n[ http://mitupv.mit.edu/multimedia-display.tcl?mitupv_mm_id=2600&section=university ]\npretender comprobar si su esfuerzo en elegir un tema interesante; la poesia de Jim\nMorrison en espanol y en ingles se recombina perfectamente en armonia, de ello es una\nmuestra\nel\nvideo\n\"I\nam\nSpy\"\n[http://mitupv.mit.edu/multimedia\ndisplay.tcl?mitupv_mm_id=3384&section=university ]; y el poeta Luis Cernuda es\nsiempre un torrente de emocion, sobre todo en la voz de los jovenes, no hay mas que\nescuchar\n\"Estaba\ntendido\"\npara\ncomprobarlo\n[http://mitupv.mit.edu/multimedia\ndisplay.tcl?mitupv_mm_id=3432&section=university], los comentarios que los alumnos\nde varias orillas del Atlantico le dedican, lo demuestran. Obtener esos contenidos, hacer la\nfilmacion y en ella tratar de expresarse lo mejor posible en el idioma y la cultura de 'los\notros' sera recompensado con la atencion de los demas participantes y cuantos\nparticipantes y en que nivel ha interesado su mensaje. Vuelven despues ansiosos para\ndetectar en los comentarios de respuesta el rastro intelectual, la 'presencia' de la\ninteligencia de los demas que han compartido esa \"pildora de conocimiento\" intencionado\ny concreto que ellos depositaron en el MITUPV en forma de video y comentario.\nEs decir que Lodewyk, Ferran y tantos otros, estan intentando, aparte de 'aprender\nmientras lo hacen', obtener y atraer la mayor cantidad de atencion posible del resto de\nparticipantes de la comunidad virtual MITUPV por encima de todas las trabas que\nsuponen la distancia fisica de miles de millas/ kilometros; la asincronia de horarios,\ncalendarios docentes y sociales y, por supuesto la paralela asincronica cultural y vital que\ntambien de forma mas sutil genera la diferencia cultural originaria de los participantes\nnacidos en diversos paises que han llegado hasta esta comunidad virtual.\nConforme el numero de los items acumulados en la Web pasaba primero de decenas a\ncientos, y despues a miles, la cantidad general de atencion posible que los participantes\n(que aumentaban en numero en una escala mucho menor) podian dedicar disminuia como\nmagnitud en relacion a la cantidad de contenido a 'procesar' con la atencion requerida y\nasi la 'competencia' entre contenidos aumento de grado considerablemente. Esto ha tenido\nsus efectos y alguno de ellos se ha podido detectar por ejemplo en la modificacion de los\nmodos de redactar los textos de los comentarios, aumentando considerablemente, por\nponer un ejemplo significativo, el uso del imperativo como modo 'verbal' mas utilizado y\ntambien de modos de lenguaje escrito los mas proactivo posible. Incluso en algunos casos,\nutilizando el texto en mayusculas en todo un comentario (eso en Internet equivale a\ngritar), en intercambios sobre la guerra, por ejemplo.\nLa propias estructura de las webs en general y de la Web del MITUPV en particular tiene\nunas limitaciones y tambien unas ventajas para la 'vida' en nuestra comunidad virtual.\nHay reglas inducidas por uso conceptual del hipertexto: los links conducen a contenidos\nconcretos y el diseno concreto de la Web de nuestro proyecto en la que los contenidos en\nvideo estan accesibles a traves de la puerta de los links de hipertexto sin que los asociemos\na la ventana clasicas de un player de video que es el contesto grafico en donde los vemos\ny escuchamos finalmente.\n_________________________________________________________\n\nY esos links estan estructurados en las ventanas del navegador web en forma de columnas\nde listados textuales verticales de links de hipertexto, que son colocados automaticamente\npor la web en forma de listados de parrafos verticales con categoria de indices de items en\nforme de cronologia inversa (con una logica de lectura contraria a la que tenemos por\nejemplo en cualquier indice de un libro). Hemos comprobado que cuando, por las\nlimitaciones de el medio Internet y el ancho de banda, la narracion de un contenido hay\nque formatearlo en varias partes -no es conveniente que un video en el MITUPV tenga un\ntamano de mas de 75 MB- (por ejemplo la historia de LinuRobot, se alarga en 7 partes,\ncon versiones cada una en video QuicktTime y WindowsMedia), la cronologia inversa\ndificulta enormemente, si no impide, la lectura y decodificacion para que toda la historia\nse comprenda adecuadamente. Esto ha obligado a inventar un contexto coherente con\npropia secuencia lineal de lectura biformato, porque si no, la historia pierde sentido, asi\nque hay que crear una secuencia ordenada de denominacion de los videos de las distintas\npartes de la historia, acompanados de sus comentarios explicativos correspondientes,\nprecedida de una grafico y comentario-anuncio, como un bloque coherente en una\nsecuencia de cronologia normal, pero, a su vez dentro del contexto de la cronologia\ninversa que la pre-programacion de la Web MITUPV crea automaticamente en cada una\nde las secciones del proyecto. Aseguro que es un proceso que obliga a reflexionar bastante\nen cuanto a las formas de acceso a los contenidos a traves de Internet. El proyecto, en este\nsentido es un buen banco de pruebas sobre ello.\nY si todo esto es asi de complicado con tres universidades -le decia a Ferran Soriano, en\nuno de nuestro comentarios-, imagina lo que sera cuando el incluya a mas universidades\nen otros continentes... \"Sera complicado, si, pero mucho mas divertido -dice Ferran\nSoriano, un alumno de produccion Multimedia de la UPV- , ademas, en el futuro las\nuniversidades no seran solo fisicas, sino fisicas y virtuales al mismo tiempo, y su parte\nfisica no estara en un solo pais. De esa forma podremos estudiar ingenieria, o arte o\nliteratura o biologia en dos o tres paises al mismo tiempo. Una pasada\".\nAdolfo Plasencia\nProfesor y dir. de Proyectos Multimedia.\nMaster de Aplicaciones Multimedia para Internet.\nUniversidad Politecnica de Valencia. Espana\nE-Mail: adolfo@mag.upv\n_________________________________________________________\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.703 Spanish III\nSpring 2006\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Rafael Seiz Ortiz _Parrafito",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-703-spanish-iii-spring-2006/b1f65f02fab69e029b7371a712e3ceef_MIT21G_703S06_raf_se.pdf",
      "content": "Mi nombre es Rafael Seiz Ortiz, profesor titular de la Universidad Politecnica\nde Valencia y titulado en Filologia Inglesa por la Universidad de Valencia. Soy\ncoordinador docente del Proyecto MITUPV Exchange en la Universidad Politecnica\nde Valencia. Mis intereses investigadores se centran en la Ensenanza de Lenguas\nAsistida por Ordenador (el famoso CALL en ingles), sobre todo el analisis\nmetodologico de los recursos educativos que nos podemos encontrar en la\nmilagrosa Red de Redes o Internet. Doy clase de Ingles para Fines Especificos\nen la Universidad a estudiantes de Ingenieria Industrial (Electronica,\nElectricidad, Quimica, Mecanica y Diseno). Me apasiona ensenarles ingles en un\ncontexto, la Ingenieria, en la que tanto mis alumnos como yo podemos aprender\nunos de otros, lo cual dejo muy claro desde el principio de mis clases. En\nefecto, estoy en contra de la figura del profesor como dador absoluto de\nconceptos, y prefiero considerarme como alguien que intenta despertar en los\nalumnos, dentro de las limitaciones de tiempo y medios, ese interes que yo\nsiento por aprender y usar la lengua inglesa. Y lo hago ensenandoles algunas de\nlas herramientas de aprendizaje que me han servido a mi en el camino. Creo que\nestas estrategias de aprendizaje sin dida les ayudaran mas a ser aprendizes\nindependientes de lo que lo harian las clases teoricas magistrales de toda la\nvida... Por todo esto me interesa mucho el proyecto MITUPV Exchange, que he\nusado y pienso usar con casi todos mis alumnos, y para el que he grabado\nbastantes videos (sobre todo en 2002) sobre nuestras fiestas, las Fallas, mis\nalumnos, y mi universidad. Espero seguir colaborando, cada vez mas y motivar a\nmis alumnos en el fascinante proceso de aprender un idioma a traves de la\ninteraccion social.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.703 Spanish III\nSpring 2006\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Rafael Seiz Ortiz MITUPV",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-703-spanish-iii-spring-2006/92d28ec77d12ba857c35778025bf651a_MIT21G_703S06_rafael.pdf",
      "content": "El Proyecto MITUPV Exchange para la ETSID (UPV) de Valencia\nMITUPV Exchange es una experiencia educativa conjunta entre el Massachusetts Institute of\nTechnology y la Escuela Tecnica Superior de Ingenieria del Diseno (ETSID) de la Universidad\nPolitecnica de Valencia, entre otras instituciones (The University of Texas at Austin, The\nUniversity of Cambridge), que consiste en la utilizacion y gestion de un proyecto basado en la\nWeb para el aprendizaje e intercambio entre estudiantes de grado y posgrado de las dos\nuniversidades. El hecho de que convivan alumnos de grado y postgrado contribuye a dotar de\nmayor flexibilidad y amplitud de miras a la experiencia.\nInternet, en general, y la WWW en particular, representan un medio emergente en su aplicacion\na la ensenanza, con inmensas posibilidades en el aprendizaje de idiomas (Haworth 1995). Con la\nllamada Red de Redes estamos ante un formato innovador de presentacion e intercambio de la\ninformacion. Pero para que su aplicacion sea realmente fructifera, es necesario tener en cuenta\nuna serie de criterios pedagogicos y metodologicos, asi como una preocupacion investigadora\nen este sentido (Chapelle 1997, 1998). Los pilares pedagogicos que vertebran nuestro uso de la\nWWW en el proyecto son:\n- Aprendizaje comunicativo de idiomas. (Widdowson 1978).\n- Ensenanza basada en el estudiante. Son los propios estudiantes los que eligen tanto\nlos temas de la interaccion, en virtud de sus intereses personales, como el ritmo y\nformato de la misma (Nunan 1988; Levy 1997).\n- Autonomia en el aprendizaje. El alumno gestiona su aprendizaje y se responsabiliza\nde los contenidos de su formacion, en lugar de \"digerir\" la informacion de manera\npasiva.\n- Aprender haciendo (saber hacer). Para poder participar, los estudiantes deben\naprender, de una forma absolutamente practica, como desenvolverse en el nuevo\nmedio de Internet y los formatos multimedia (tratamiento de imagenes y video, etc.).\nEsto tiene mucho que ver con la filosofia docente de la ensenanza basada en la tarea,\ncuya conveniencia tambien ha sido destacada en el campo de la ensenanza de\nidiomas (Skehan 1996: 20).\n- Aprendizaje colaborativo. El estudiante se encuentra integrado en una comunidad de\naprendizaje e intercambio. La interaccion con los companeros es condicion basica\npara avanzar en el conocimiento.\n- Intercambio cultural. Los alumnos toman un contacto directo y de primera mano con\nla cultura y el entorno de sus companeros al otro lado del Atlantico.\nCiertas caracteristicas de la WWW la hacen un medio ideal para poner en practica estos pilares\nmetodologicos en un grado nunca antes posible. Ademas, Internet implica comunicacion, o, mas\nconcretamente, telecomunicacion, tanto sincronica como asincronica. Y facilita un tipo de\ncomunicacion hipervinculada con multitud de recursos y fuentes de informacion que se hacen\ndisponibles a un solo golpe de raton, de modo que se hacen compatibles los conceptos de\ndistancia y comunicacion (Jennings 1995: 26, 27). Este rasgo es fundamental en el proyecto, ya\nque no concebimos la formacion como una mera interaccion cerrada con una fuente tradicional\nproveedora de informacion (sea un libro, un profesor, o, incluso, una aplicacion multimedia en\nformato CD-ROM...), sino, mas bien, un proceso de interaccion dinamica y abierta, en la que\ntodas las partes tienen algo que ensenar y algo que aprender. En este sentido, el sitio Web de\nnuestro proyecto de intercambio constituye una plataforma de aprendizaje en la que cada\nindividuo (y grupo) que interviene aporta algo que quedara grabado para su utilizacion\nposterior, despues de cada renovacion de estudiantes en ambas universidades.\nEs importante destacar un aspecto que nos parece crucial en lo que respecta al tipo de\ninteraccion e intercambio que se lleva a cabo en el sitio Web del proyecto. Las aportaciones de\nlos estudiantes a la pagina son totalmente democraticas, ya que no vienen impuestas por el\nprofesor coordinador, ni por ningun grupo ajeno a los propios estudiantes. Estos deciden los\n\ntemas y contenidos, y tambien la forma en la que se interactua (bulletin boards, chats\nocasionales, correo electronico, etc.), de modo que tanto los intercambios comunicativos como\nel modelo ideal de universidad que puede surgir de los mismos, habran nacido \"desde abajo\"\n(los estudiantes), y nunca impuestos \"desde arriba\", como sucede en otros metodos tradicionales\nde aprendizaje. Se piensa, igualmente, que de esta forma se garantiza la necesaria motivacion y\nel interes por parte de los alumnos para comunicar y aprender. Y esta comunicacion y\naprendizaje se hacen posibles a traves de la interaccion social entre los mismos estudiantes. De\nnuevo, esta interaccion social implica por una parte contacto, el necesario para facilitar el\nintercambio selectivo de informacion y experiencias, y por otra distancia, la que se experimenta\nal poner culturas y sistemas sociales tan diferentes, hecho evidenciado en multitud de anecdotas\nque demuestran el enriquecedor efecto del contraste social y la tolerancia.\nOtra caracteristica interesante del sitio Web del proyecto es su flexibilidad, ya que se puede\naplicar a muy diversos tipos de clases practicas (no solo de idioma extranjero) en ambas\nuniversidades. Por citar solo algunos ejemplos de aplicacion, se puede usar la pagina como foro\nde debate (escrito o hablado) en torno a los multiples temas tratados en clases presenciales; o\npara una docencia mas tecnica, al solicitar al alumnado que elabore, edite y coloque objetos\nmultimedia en la pagina Web. Los limites de aplicacion docente vienen dados exclusivamente,\nsegun creemos, por la imaginacion y el ingenio de los instructores.\nEl proyecto, para la ETSID, tiene dos objetivos generales bien definidos y, en cierta manera,\ncomplementarios. Por una parte, se intenta facilitar un intercambio dinamico y comunicativo\nentre estudiantes que cursan ingles en la UPV y espanol en el MIT. Este intercambio, que tiene\ncomo base la mejora en la calidad de la formacion y el aprendizaje, tiene cuatro vertientes\nprincipales:\n- Linguistica: practica interactiva y comunicativa de un idioma extranjero.\n- Academica: conocimiento critico tanto del entorno universitario propio como de la\notra universidad. Intercambio de informacion valiosa dentro y fuera del curriculum\nuniversitario.\n- Social: establecimiento de relaciones personales y grupales entre alumnos de ambos\ncentros, sin olvidar el contexto social en sentido amplio en los dos paises.\n- Cultural: expresion y conocimiento del contexto cultural propio y el de otros paises,\nen su sentido mas amplio: tradiciones, fiestas, costumbres, arte, geografia,\ngastronomia, etc.\nPor otra parte, se trabaja para que todo este rico intercambio a diversos niveles sirva para que\nlos alumnos disenen un modelo de universidad ideal, \"desde abajo\" y de forma totalmente\ninteractiva y democratica. A traves del conocimiento del sistema universitario propio y del de\nlos companeros al otro lado del oceano, cada grupo de estudiantes estara equipado para realizar\nrazonadas propuestas de mejora en la calidad de la educacion superior. Se espera que estas\nideas, nacidas con espiritu critico y constructivo desde el propio alumnado, sean una\ninformacion valiosisima para ser tenida en cuenta por los grupos de gobierno de ambas\nuniversidades.\nAunque la experiencia nace como una manera ideal de practicar idiomas de una forma\ncontextualizada y comunicativa, entre alumnos nativos de ingles y de espanol, y, de hecho, su\nprimer marco de aplicacion se refiere a las asignaturas de idioma extranjero, el proyecto tiene\nmultiples posibilidades de aplicacion a la innovacion y la mejora educativa en un sentido\namplio.\nEl presente proyecto esta en pleno desarrollo, ademas de que, por sus propias caracteristicas ya\napuntadas, se encuentra abierto a la innovacion y el cambio continuo. Cualquier docente, sea\ncual sea su asignatura, cualquier estudiante, independientemente de su bagaje y perfil, incluso\ncualquier usuario invitado interesado en las nuevas tecnologias o la educacion a distancia, sabra\nutilizar, con un minimo de imaginacion, este sitio Web en su propio beneficio formativo. Por\n\nejemplo, el estudiante interesado en la tecnologia del automovil podra ponerse en contacto con\ncompaneros e incluso con expertos o enlaces interesantes a traves del proyecto. Analogos\nbeneficios obtendra el profesor de idiomas, que potenciara la faceta linguistica de la\nexperiencia, o el cargo directivo universitario al que le interese oir las criticas o sugerencias de\nmejora realizadas por los principales beneficiarios del sistema universitario. Y estos son solo\nalgunos ejemplos.\nEn el caso concreto de la ETSID (UPV), la experiencia puede ser plataforma (de hecho ya lo\nesta siendo) para la realizacion de interesantes Proyectos Final de Carrera en el ambito de la\nprogramacion y la ingenieria industrial.\nEl proyecto MITUPV Exchange constituye un punto de encuentro perfecto entre la innovacion\ndocente y la mejora de la calidad global de nuestros sistemas universitarios. En lo que respecta\nal primer aspecto (docente), significa una aplicacion contextualizada de la tecnologia emergente\nde Internet y la World Wide Web al aprendizaje y la formacion, tanto en idiomas extranjeros\ncomo en otras asignaturas mas tecnicas. En cuanto al segundo aspecto (calidad), es una\npoderosa herramienta para detectar necesidades, sugerencias y problemas en nuestra\nuniversidad, siempre desde el punto de vista de los estudiantes, principales destinatarios del\nsistema universitario.\nEsta flexibilidad hace que se pueda incluso ir mas alla del intercambio a traves de la WWW,\npara conseguir una colaboracion mas directa y personal entre los humanos (no solo entre los\nordenadores) de las dos universidades. En realidad, nos gustaria aplicar al proyecto MITUPV\nExchange las acertadas palabras de algunos investigadores de la Ensenanza Asistida por\nOrdenador, segun los cuales \"el aprendizaje se considera como un viaje, mas que como un mero\ndestino\" (Davey et al. 1995: 39, 42).\nAlgunas referencias\nChapelle, C. A. \"CALL in the Year 2000: Still in Search of Research Paradigms?\" Language\nLearning and Technology 1/1 (1997): 19-43.\nChapelle, C. A. \"Multimedia CALL: Lessons to be Learned from Research on Instructed SLA.\"\nLanguage Learning and Technology 2/1 (1998): 22-34.\nDavey, D. et al. \"Multimedia for Language Learning: Some Course Design Issues.\" Computer\nAssisted Language Learning 8/1 (1995): 31-44.\nGillespie, J. H. \"The Integration of CALL Tools into the Modern Languages Curriculum: a Case\nStudy.\" In Proceedings of Eurocall 94. Edited by B. Ruschoff and D. Wolff. Karlsruhe, 1994.\nGimeno, A. (ed.) Proceedings Eurocall 95. Valencia: Universidad Politecnica de Valencia,\n1995.\nHaworth, W. \"The Internet as a Language Learning Resource.\" In Proceedings Eurocall 95.\nEdited by A. Gimeno. Valencia: Universidad Politecnica de Valencia, 1995.\nJennings, C. \"Enriching the Distance Language Learning Experience through Telematics and\nMultimedia: a Case Study.\" ReCALL 7/1 (1995): 26-33.\nLevy, M. Computer-Assisted Language Learning. Context and Conceptualization. Oxford:\nClarendon Press, 1997.\nNunan, D. The Learner-Centred Curriculum. Cambridge: Cambridge University Press, 1988.\n\nSkehan, P. \"Second Language Acquisition Research and Task-based Instruction.\" Edited by J.\nWillis and D. Willis. 1996.\nWiddowson, H. G. Teaching Language as Communication. Oxford: Oxford University Press,\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.703 Spanish III\nSpring 2006\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}