{
  "course_name": "Special Topics at Edgerton Center:Developing World Prosthetics",
  "course_description": "D-Lab World Prosthetics is a collaboration between the Massachusetts Institute of Technology and the Jaipur Foot Organization to improve the design, manufacture, and distribution of rehabilitation devices in the developing world. The course welcomes individuals interested in physical rehabilitation to work on multidisciplinary teams of students with bioengineering, mechanical engineering, material science, and medical or pre-medical backgrounds. Students will learn about the basics of human walking, different types of gait disabilities, as well as the technologies that seek to address those disabilities. Patient perspectives and current research areas are presented. Lecture topics focus on lower-limb disabilities, including polio and above-knee and below-knee amputation, and will cover both developed and developing world techniques for overcoming these disabilities. Students form teams to design and prototype low-cost orthotic and prosthetic devices, and present their work at the end of the course.",
  "topics": [
    "Engineering",
    "Mechanical Engineering",
    "Mechanical Design",
    "Health and Medicine",
    "Biomedicine",
    "Public Health",
    "Society",
    "The Developing World",
    "Engineering",
    "Mechanical Engineering",
    "Mechanical Design",
    "Health and Medicine",
    "Biomedicine",
    "Public Health",
    "Society",
    "The Developing World"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 2 hours / session\n\nTeams meet informally outside of lecture sessions for an average of seven hours per week.\n\nCourse Goals\n\nGain awareness of communities in the developing world and the technical challenges they face\n\nLearn about appropriate prosthesis technologies for developing communities, their impact, and how they can be conceived, designed and implemented\n\nExplore the way MIT can take in order to help people in developing countries\n\nLearn the hands-on skills required to implement selected development projects\n\nCourse Structure\n\nIn the first half of the course, students learn through lectures the difficulties facing developing countries, available prosthetic technologies in these countries, advanced prosthetics concepts, and review previous D-Lab World Prosthetics student projects. In the second half of the course, students form teams of three to five students to design and prototype orthotic and prosthetic devices. Projects include a low-cost prosthetic knee, a pediatric extendable prosthetic leg, a cosmetic shell for prosthetic feet, and a vacuum-casting system. At the end of the course, teams present their outcomes in final written and presented reports.\n\nCourse Text\n\nThere is no textbook for this course. All required and optional readings are listed on the\nLectures and Readings\npage.\n\nAssignments\n\nThere are seven problem sets for this course to be completed by each student. Student teams also complete short (<20 minute) mid-term and final presentations to the class, and submit a two-page (minimum) written report to be shared with Jaipur Foot.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nClass participation\n\n15%\n\nHomework assignments\n\n15%\n\nMid-term presentation\n\n30%\n\nFinal presentation\n\n40%\n\nCalendar\n\nSES #\n\nTOPICS\n\nINSTRUCTORS\n\nKEY DATES\n\nClass overview, introduction\n\nKen Endo\n\nProject presentations by TAs\n\nKen Endo\n\nHomework 1 due\n\nDesign for the developing world\n\nKen Endo\n\nHomework 2 due\n\nChallenge map, idea generation\n\nKen Endo\n\nHomework 3 due\n\nCase study: Synergy foot\n\nKen Endo\n\nHomework 4 due\n\nThe Jaipur foot\n\nDr. Pooja Mukul\n\nHomework 5 due\n\nProsthetic technology in the United States\n\nBob Emerson\n\nMid-term presentations\n\nBob Emerson\n\nTranstibial prosthesis\n\nBob Emerson\n\nTransfemoral prosthesis\n\nBob Emerson\n\nHomework 6 due\n\nPediatric prosthesis\n\nBob Emerson\n\nHomework 7 due\n\nHuman biomechanics\n\nHugh Herr\n\nStanford Knee\n\nJoel Sadler\n\nMIT museum D-Lab showcase\n\nFinal report submission",
  "files": [
    {
      "category": "Assignment",
      "title": "Problem set 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-722-special-topics-at-edgerton-center-developing-world-prosthetics-spring-2010/7f4f721cec6b20799ca15a372548e46a_MITEC_722S10_pset1.pdf",
      "content": "SP.718 Developing World Prosthetics\nSpring 2010\nAssignment 1\nProblem 1: Human Biomechanics\nDownload and read Winter's paper \"Biomechanical Motor Patterns in Normal Walking\", and answer the following\nquestions.\n1. List major muscles for walking and describe each function.\n2. What is angle of maximum flexion during the stance phase for three different walking speeds?\n(Hint: see Fig.5)\n3. Why does human flex the knee joint after the heel strike? (Fig. 13 might be useful)\n4. What's EMG?\nProblem 2: SolidWorks(r) (optional)\nFollow this instruction and get used to SolidWorks(r). If you have already known how to use SolidWorks(r), try only\noptional question.\n1. Install SolidWorks(r) on your computer.\n2. Follow the tutorial (you can find the tutorial in 'Help'), and model/assemble these parts.\n3. Using COSMOSXpress, analyze the hook. (The design analysis tutorial shows everything to do).\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nEC.722 Special Topics at Edgerton Center:Developing World Prosthetics\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Problem set 2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-722-special-topics-at-edgerton-center-developing-world-prosthetics-spring-2010/9bb421e83a6e52a270e183c0c65895d5_MITEC_722S10_pset2.pdf",
      "content": "SP.718 Developing World Prosthetics\nSpring 2010\nAssignment 2\nProblem: What makes a design good or bad?\nConsider the objects and products you encounter every day while at MIT - all of these were designed.\nWhen looking at a design, it's important to be critical, but in a constructive manner. It's also important to\nrecognize that there are very few instances where a design is 100% great or 100% terrible; there are\ntypically good parts of a poor design, and vice versa.\nTake a picture of two very different objects or products, one that you believe is a relatively bad design,\nand one that is a relatively good design. Discuss the pros and cons of each design, and why you have\ncome to your overall \"good\" or \"bad\" conclusion. Also discuss what trade-offs and constraints the\ndesigners likely faced in developing these products, and how these challenges were managed.\nFinally, for the \"bad\" design, explain how you would improve it, providing a sketch to represent your\nidea, as well as accompanying text.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nEC.722 Special Topics at Edgerton Center:Developing World Prosthetics\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Problem set 3",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-722-special-topics-at-edgerton-center-developing-world-prosthetics-spring-2010/4da76aa65138628556356ffc9db0c70a_MITEC_722S10_pset3.pdf",
      "content": "SP.718 Developing World Prosthetics\nSpring 2010\nAssignment 3\nReading Assignment: ICRC technology\nSeven different materials related to ICRC are now on the website.\nIn this assignment, you need to pick 3 or 4 of the assigned readings for this lecture and compare and contrast\nICRC and Jaipur Foot technologies.You don't have to submit any report, but please be prepared for a class\ndiscussion.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nEC.722 Special Topics at Edgerton Center:Developing World Prosthetics\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Problem set 4",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-722-special-topics-at-edgerton-center-developing-world-prosthetics-spring-2010/e328828bcc4a813f796e99421719bb7b_MITEC_722S10_pset4.pdf",
      "content": "SP.718 Developing World Prosthetics\nSpring 2010\nAssignment 4\nProblem: What makes a design good or bad for developing countries?\nYou took a picture of two very different objects or products, one that you believe is a relatively bad\ndesign, and one that is a relatively good design for the assignment 2. Design them for people living in\ndevelop countries. (Hand sketch is enough) Be careful to choose materials, specify how to manufacture,\nand estimate the cost. Please also raise any expected problem, when you disseminate them.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nEC.722 Special Topics at Edgerton Center:Developing World Prosthetics\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Problem set 5",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-722-special-topics-at-edgerton-center-developing-world-prosthetics-spring-2010/125ac6e36f3f066747bc41f534eb018a_MITEC_722S10_pset5.pdf",
      "content": "SP.718 Developing World Prosthetics\nSpring 2010\nAssignment 5\nReading Assignment: Sand Casting\nRead the paper, \"CIR sand casting system for trans-tibial socket\" written by Dr. Wu Yeongchi et al.. This\nis not current version, but it's good to understand a basic idea of how vacuum system is used for making\npositive and negative molds. Dr. Pooja pointed out in the class that it turned out that this system costs\nmore than conventional way with plaster. She also pointed out that the shape of positive mold changes\nduring the process.\nIn this assignment, read this paper and list advantage and disadvantage of this system. How would you\nimprove this system?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nEC.722 Special Topics at Edgerton Center:Developing World Prosthetics\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Problem set 6",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-722-special-topics-at-edgerton-center-developing-world-prosthetics-spring-2010/8e6687f8ab852a2d7673599622d10b6c_MITEC_722S10_pset6.pdf",
      "content": "SP.718 Developing World Prosthetics\nSpring 2010\nAssignment 6\nProblem: Reading Assignments\nPlease read:\n1. Innovation in prosthetics and orthotics by J. Foort\n2. Lower Limb Prosthetic Research In The 21st Century by S. Zehedi\nWe will have a discussion session on these papers in the next lecture.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nEC.722 Special Topics at Edgerton Center:Developing World Prosthetics\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Problem set 7",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-722-special-topics-at-edgerton-center-developing-world-prosthetics-spring-2010/7fbdfb18704f94b0081c7889c7f1896c_MITEC_722S10_pset7.pdf",
      "content": "SP.718 Developing World Prosthetics\nSpring 2010\nAssignment 7\nProblem: Design Review Session\nD-lab event at MIT museum is scheduled on 5/8, and the final presentation in the class will be\non 5/12. This means we only have three weeks to go. We are thinking of Design Review Session\nin the class. Each team will show their progress and current design and discuss among the class\non 4/21.\nAs a group, prepare a 10 - 15 minute presentation about your project. Be sure to include the\nproblem definition, adequate (but not superfluous) background information, your approach to the\nproblem, progress from the mid-term presentation, and the details of your design. This will be\nthe last time to get feedback from the class.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nEC.722 Special Topics at Edgerton Center:Developing World Prosthetics\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Lego Knee team final",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-722-special-topics-at-edgerton-center-developing-world-prosthetics-spring-2010/7f08ebf19812267d69342294d7535ab7_MITEC_722S10_legoknee_fnal.pdf",
      "content": "LEGO KNEE\nStudents: Amber Houghstow, David Miranda-Nieves, Ryu Yoshida\nTAs: Jared Markowitz, Frieder Wittmann\nInstructor: Ken Endo\nTable of Contents\nLEGO KNEE ............................................................................................................................................ 1\nIntroduction............................................................................................................................................... 1\nOur Designs............................................................................................................................................... 2\nInitial Prototype: Single Four Bar Linkage Knee ................................................................................. 2\nAdvanced Prototype: Multiple Linkage Knee ...................................................................................... 6\nFirst Alignment Prototype ..................................................................................................................... 9\nSecond Alignment Prototype ............................................................................................................... 11\nAdvantages.............................................................................................................................................. 13\nSimpler Manufacturing ....................................................................................................................... 13\nSlimmer design ................................................................................................................................... 13\nThe Manufacturing Process .................................................................................................................... 13\nMaterials List ...................................................................................................................................... 14\nTools .................................................................................................................................................... 14\nCost ..................................................................................................................................................... 14\nIntroduction\nThere is currently a need for a high performance prosthetic knee that can be inexpensively\nmanufactured to international standards. The Stanford knee, originally developed in 2008 by a group of\nStanford students including Joel Sadler (now collaborating with us), was a response to this need. It was\npraised by its users at Jaipur Foot Organization, the world's largest limb fitting organization, as well as\nothers (e.g. Time Magazine's Top 50 Inventions for 2009) for its high gait performance in combination\nwith a much lower cost (about $30) than any comparable designs on the market.\nHowever, we believe that the design can still be improved radically in performance and price.\nOur innovative redesign leads to a lighter, slimmer, easier to manufacture, and less material consuming\nknee prosthesis without changing the already optimized kinematics. In addition, we are working on an\nalignment system and planning on adding pneumatic damper that will improve the gait of many\npatients. Therefore, our knee prosthesis should be able to provide unmatched performance in the low-\nto-medium cost segment.\nAn alignment system is an essential improvement to the Stanford knee because men and women\ntypically have different leg angles. Also, natural gait depends on the proper position of the knee and\nfoot. Furthermore, changing the angle of the leg changes the load on the hips. Therefore, by adding an\n\nalignment system to our design, the gait of the patient will improve significantly.\nA main characteristic of a knee joint is its kinematics. The Stanford design, along with many\nothers on the market, uses a four bar mechanism. In this design, the instantaneous center of rotation\nchanges during gait, very similar to an actual human knee. This yields dynamic damping during swing\nphase due to the changing of rotational inertia of the lower limb.\nOur team currently has two designs with the same four bar mechanism and the same kinematics\nas the Stanford knee. The first design is asymmetric. We have decreased the width of the previous\ndesign and eliminated a linkage (decreasing it from five to four). The second design is symmetric as it\nmaintains the five linkages like the Stanford knee. During the summer, our team will be testing both\nprototypes and will decide which is stronger.\nOur Designs\nInitial Prototype: Single Four Bar Linkage Knee\nOne of the first designs we created is an asymmetric model consisting of a single four-bar\nlinkage. The initial prototype for this design was made from two pieces of high density polyethylene,\nalong with two thin steel linkages. These were attached together using four quarter-inch bolts,\nsecured with four correspondingly sized lock washers. This prototype was capable of approximately\n90o of flexion. The assembled model is shown in Figure 1.\nFigure 1: Prototype of Single Four Bar Linkage. This prototype is a rough model used to better\nconceptualize the costs and benefits of using a knee with a single four bar linkage. It was\nmanufactured using solely a band saw, power sander, and drill press. The prototype is based on the\nwork of the Stanford team, following the polycentric design with similar measurements.\n\nFrom this model, we discovered that the torsional forces exerted on knees during common\nloading are large enough to bend the pieces of thin metal we used. We checked this by using the force\nof our hands to move the knee, pulling on it as the weight of a heavy foot might during swing phase.\nThis caused the knee to temporarily misalign. This bending happens when only a single linkage is\npresent. Team advisers therefore recommended making metal linkages thicker or adding more\nlinkages. Additionally, large washers could be placed at the sides to add more stability.\nSchematic drawings of this design's top and bottom components are shown in Figures 2 and 3.\nTo manufacture the prototype, measurements were made on a block of high density polyethylene with\narea 5cm by 5cm. The large outer curve was then traced out using a preconstructed curve of the\ndesired radius. Necessary straight cuts were then made on a vertical band saw, as well as a rough\nprofile of the curve. We used a drill press to create the holes and countersinks, and then smoothed the\nouter curve's profile using a power sander. The design was constructed entirely from flat pieces so\nthat a water jet could be used, when available, to recreate the same knee design with very high\nprecision.\nFigure 2: Upper Portion of Single Linkage Knee. Shown here is a three-section view of the knee's\nupper portion. This block may be fabricated using a band saw, power sander, and drill press, or\nalternatively a water jet and drill press. As shown by the dashed lines, countersunk holes are included\nto reduce the knee thickness. If it is deemed useful to include washers between the bolts and the\nplastic component, the countersunk holes could be enlarged. Adding washers might make it possible\nto tighten the bolts more without adding as much friction in the joint.\n\nFigure 3: Bottom Portion of Single Linkage Knee. Shown here is a three-section view of the knee's\nbottom portion. The accompanying physical part was manufactured via the same processes as the\nknee's upper portion.\nShown in Figures 4 and 5 are the designs for the metal linkages used to construct the single\nlinkage prototype. These were manufactured from a soft steel alloy. To create the linkages' curves,\nwe traced out the measurements on a sheet of steel. A rough curve profile was created using a band\nsaw before smoothing with a power sander. As with the plastic top and bottom of the knee, this\ndesign can also be recreated using a water jet, mill, or other tools.\n\nFigure 4: Larger Knee Linkage. This linkage was created from a piece of sheet steel using a band saw,\ndrill press, and power sander. This linkage is placed on the front right side of the knee when viewed\nhead on, as shown in Figure 6.\nFigure 5: Smaller Knee Linkage. This smaller linkage was created similarly to the large one. It is\nplaced on the back left side of the knee when viewed head on, as shown in Figure 6.\nOnce manufactured, the parts shown in Figures 2 through 5 can be assembled using four bolts\nwith accompanying lock nuts. We used 1⁄4\" diameter bolts in the prototype; however, it remains to be\ndetermined which bolt diameter is most appropriate for the knee, given the tradeoffs of cost and\nstrength. The final assembled model should appear as shown in Figure 6. Note that bolts that are\n\ntoo long may be shortened using a saw or rotary tool.\nFigure 6: Completed Assembly for Single Linkage Knee. This assembly includes two high-density\npolyethylene blocks, two steel linkages, four bolts, and four lock nuts. The pieces to be manufactured\nare described in Figures 2 through 5.\nBased on the performance possible with this design, we decided to follow two courses of action.\nOne is to strengthen the linkages and consider other ways of adding stability without width, which will\nbe undertaken and tested this summer. The second is to add extra linkages, which was pursued during\nthe end of the class this fall. The resulting multiple linkage prototype is described in Figures 7\nthrough 10.\nAdvanced Prototype: Multiple Linkage Knee\nThe second prototype we built is shown in Figure 7. In it, we took into account some of the\ndisadvantages of earlier prototypes and attempted to improve on them. This prototype, while it was\nmanufactured similarly to the single linkage design, was machined to smaller tolerances. As a result,\nit is quite stable and capable of 160 degrees of rotation. Other differences include the addition of 20\nwashers and the fact that, due to the additional linkages, only two of the bolt holes were countersunk.\nWe also decided to construct the linkages from aluminum instead of steel, due to aluminum's lower\ndensity. We will be testing the impact of these and other changes during the summer.\nNote that the linkages shown below are not symmetric. As can be seen in Figure 7, one of the\nlinkages may seem to be missing. The reason for this design decision is that a damper may later be\nplaced in the empty location. Alternatively, another aluminum linkage could be added. The impact\nof this symmetry decision and the material choices will be a focus of summer testing. However, the\ncurrent design still rotates well with minimal flexion. Prototype details are shown in Figure 7, while\ndrawings for manufacturing are shown in Figures 8 and 9.\n\nFigure 7: Prototype of Multiple Linkage Knee. This knee was manufactured similarly to the single\nlinkage knee. The primary differences were adding twenty thin washers for spacing, changing the\nlinkages to aluminum, and including only two countersunk holes.\nThe top and bottom components of the knee are manufactured similarly to those used in single\nlinkage prototype. As before, they can be created using a band saw, drill press, and sander; or a water\njet and drill press for the countersunk holes. Likewise, the dimensions are the same except for the\npresence of two rather than four countersinks, shown in Figures 8 and 9. Because the linkages are the\nsame as those used previously, the diagrams for those are not repeated.\nFigure 8: Upper Portion of Multiple Linkage Knee. Shown here is a three section view of our latter\nprototype's upper half. It is the same as that for the first prototype, except it contains two fewer\ncountersunk holes.\n\nFigure 9: Lower Portion of Multiple Linkage Knee. Shown here is a three section view of our latter\nprototype's lower half. It is the same as that for the first prototype, except it contains two fewer\ncountersunk holes.\nPictured below in Figure 10 are a SolidWorks assembly and drawing showing the final knee\nconstruction. In it are the same linkages as those used for the initial knee design, except the linkage\nmaterial is aluminum. Additionally, linkages of various materials and thicknesses may be included,\ndepending on the result of tradeoffs between price, strength, and durability. We will be investigating\nthe best balance of these tradeoffs this summer.\n\nFigure 10: Completed Assembly for Multiple Linkage Knee. This assembly includes two high-density\npolyethylene blocks, two steel linkages, four bolts, and four lock nuts. The pieces to be manufactured\nare described in Figures 4,5,8,and 9. Note that two out of eight holes are countersunk, and that the\ndesign currently includes only three linkages. We will be investigating the effects of adding another\nlinkage or damper in the same location this summer.\nFirst Alignment Prototype\nPictured here is the first alignment system we created to be used with our knee designs. It is\nan undersized (not to scale) model we used to determine the movement properties and constraints of\nsuch an alignment system. The design consists of one quarter-inch diameter bolt with accompanying\nnut, two large washers, and a short ring machined from Delrin. The ring is meant to be placed inside\na pylon having the same inner diameter. The bolt is meant to be inserted into the top of a knee, and\nthen the nut can be tightened once the desired alignment position has been determined. Then the ring\ncan be secured afterwards in the pylon at the top of the knee, using epoxy, smaller bolts, or other\nfastening methods.\nThe alignment system shown in Figure 11 currently provides approximately 1.5 cm of vertical\nand horizontal placement flexibility, combined with full 360o rotation. Although the current bolt size\nmay not be strong enough to support a person's full body weight, a similar but larger system could be\nsuccessfully used with a larger pylon to provide additional alignment. During the summer, a larger\nversion of the system will be tested, including the use of a thicker bolt and pylon, combined with longer\nrings of various kinds of plastic.\n\nFigure 11: Initial Alignment System. In the alignment system pictured here, a short ring of Delrin is\nused to support a moveable bolt, which is to be screwed into the top of a prosthetic knee joint. The\nalignment system is then tightened in the desired position and fastened to the end of a pylon.\nShown below in Figure 12 is a three-section view of the plastic ring used in the alignment\nsystem. This ring can be manufactured by drilling a hole directly into appropriately sized stock, or by\nusing a water jet to create concentric rings of the desired sizes. The dimensions shown below in\ncentimeters describe the small model we created. They could be scaled up proportionally to match the\nsize of the desired pylon and alignment system.\nFigure 12: Three Angle View of Alignment Ring. The above drawing shows the construction of our\ninitial alignment ring prototype. Dimensions, shown in centimeters, should be proportionally scaled\naccording to the necessary size of the alignment system. The alignment ring can be manufactured\nusing a drill press in one inch stock, as well as in a water jet from thick sheet plastic.\nShown in Figure 11 is the completed assembly of the initial alignment system we created. The\nassembly is to be secured in a pylon above and screwed into a knee device below. We hope to scale and\n\ntest the system this summer, as well as investigate its possible combination with more advanced\nalignment systems. In a later form, the prototype could potentially offer more freedom in alignment\npositioning.\nFigure 11: Initial Alignment Assembly. Shown here is the completed assembly for the initial knee\nalignment system. It is created from a ring of plastic, two washers, and a nut and bolt.\nSecond Alignment Prototype\nThe second alignment prototype functions quite differently from other alignment systems we\nhave seen. For this reason, we believe that although it has great potential, it would need to go\nincredibly rigorous testing, both for safety and to determine user appeal. This prototype, shown in\nFigure 12, shows a rough prototype of the system. It is again a small model used to determine the\ndegrees of motion provided by such a system. This model was successful in that it shows the system\nallows for height adjustment, 360o of rotation in the horizontal plane, and approximately 30o of rotation\nfrom the vertical plane in any horizontal direction.\nFigure 12: Second Alignment System. This alignment system, machined from a single piece of one\ninch tube stock, allows for both linear vertical and angular positioning.\n\nThis alignment system's construction is quite simple to make. To create the plastic piece\npictured in Figure 13, we began by taking a piece of one inch tube stock and using a drill to make a\nlarge hole in the center. Then, using a band saw, we cut the piece of tube stock in half down the center.\nThis created a flat edge for each half, on which we drew a circle. We used a power sander to remove\nthe material external to the circle. After this, we glued the two pieces back together, creating the\nprototype shown above. Note that this plastic piece has cross-sections with different shapes, two of\nwhich are circular and one of which is a square. Because of the piece's particular construction, it is\npossible to use tube stock instead of solid stock to save material. It is also possible to create the same\ndesign using a water jet if it is available. In that case, instead of drawing a circle and using a power\nsander to remove the external material, a water jet would be used to remove the excess.\nFigure 13: Plastic Slider for Second Alignment System: This piece allows the sliding inner bolt to\nattain 30o of angular alignment in the vertical direction and 360o in the horizontal direction. By\naltering the slider's placement in the pylon, additional degrees of vertical alignment may be attained.\nThe piece may be manufactured using a band saw, drill press, and sander, or using primarily a water\njet. As for the previous prototype, dimensions should be proportionally scaled to match the required\npylon and need for load bearing.\nFigure 14 shows the completed assembly for the second alignment prototype. The required\npieces are a plastic slider to be manufactured, two washers, a matching nut and bolt, and a pylon to fit\nthe slider piece.\n\nFigure 14: Second Alignment Assembly. This assembly requires only six pieces and can be easily\ntightened before positioning within the pylon. We plan to test the effectiveness of larger versions of the\nassembly this summer.\nAdvantages\nBoth designs have the following major advantages:\nSimpler Manufacturing\nFour bar designs like the one by the Stanford team contain parts that have a fairly complex three\ndimensional structure. This requires repositioning the parts during the manufacturing process in order\nto access all necessary areas with the tools. Also, a mill is required for creating the grooves, which\nincreases the cost substantially.\nSince our design is composed entirely of flat sheets, it can be easily manufactured with a saw,\ndrill, and sander. A laser cutter or water jet can also be used. Both are substantially less expensive\nthan a mill and available at FabLabs in many developing countries\nSlimmer design\nSince we use less material, we further reduce costs, the weight of the prosthesis, and impact on\nthe environment. In addition, the slimmer design will allow for a life-like cosmetic cover. The Stanford\nKnee's wide design (shown in Figure 2) currently exceeds the width to fit with the aesthetic covers\nused by Jaipur Foot. We solved this problem by reducing the number of required layers to three, as well\nas providing insets for the bolts.\nThe Manufacturing Process\nThe major improvement to the Stanford knee is the simplification of the manufacturing process.\nThe Stanford design requires advanced machinery that is not accessible everywhere on the globe. For\n\nthis reason, we have decided to simplify the manufacturing process to three simple steps.\n1. Make cuts to the materials with a saw based on the established measurements.\n2. Using a 1⁄4 drill bit make a hole on the place mentioned on the measurements section.\n3. Sand the edges until a complete rotation is possible.\nThe idea behind this simplification is that anybody with the materials and the basic tools can\nconstruct this Lego Knee. In the future, an instructional YouTube video on the manufacturing process\nof the knee may be created.\nMaterials List\n1. High Density Polyethylene\n2. Screws\n3. Spacers and Nuts\n4. Aluminum\nTools\n1. Saw\n2. Drill\n3. Sander\nHowever, if a water jet is available, it may also be used. Each part may be water-jetted.\nCost\nThe projected manufacturing cost for the knee is $14. The breakdown of the cost is as follows:\n1. Bolt, Nuts, and Washers: $4\n2. Metal and Plastic: $5\n3. Labor: $5\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nEC.722 Special Topics at Edgerton Center:Developing World Prosthetics\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Lego Knee team midterm",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-722-special-topics-at-edgerton-center-developing-world-prosthetics-spring-2010/2f0b674796f9cc3f49c8f8e7dfef002c_MITEC_722S10_lgoknee_mdtm.pdf",
      "content": "Ryu Yoshida, Amber Houghstow, David Miranda-Nieves\nMarch 17, 2010\n\nInfo abou\nt kn\nee\npros\nthe\nses.\nImage by MIT OpenCourseWare.\n\nInfo abou\nt kn\nee\npros\nthe\nses.\nImage by MIT OpenCourseWare.\n\nPolycentric\nGood gait-efficiency\nWithstands 2 million\ncycles (~2 years)\nAffordable (<$30)\nEngineering drawing of Stanford-Jaipur Knee\nremoved due to copyright restrictions.\n\nWide and bulky\nNoise (Click!)\nShock / Discomfort\nBetter\nmanufacturing?\nRequires milling or\nmolding\nEach site requires a\nmold\nPhoto of boy walking with Stanford-Jaipur Knee\nremoved due to copyright restrictions.\n\nRevise the Stanford-Jaipur knee\nNo milling, no molding\nBuild a prototype at Fab Lab\nAlso introduce small improvements\n(e.g. no bolts sticking out)\nTest our prototype\n\nEngineering drawing of LegoLeg courtesy of Giovanni Talei Franzesi,\nJacquelyn Kunkel, and Matthew Rodriguez. Used with permission.\n\nEasy to use\nFast\nEconomical\nCan slice carbon-\nfiber sheets into\nvarious shapes\nNo molds required\n\nAvailable at Fab\nLab\nOmax 2652 can\nhandle up to\n26in x 52in\n\nIs our modified Stanford-Jaipur knee as\ngood as the original?\nImages of MIT's Tim the Beaver and the Stanford Tree mascot\nhave been removed due to copyright restrictions.\n\nApply adduction\nmoment\n~3% x bw x ht\n=34.1 Nm\n2 million cycles\nImage of the Stanford-Jaipur Knee\nundergoing a stress test has been\nremoved due to copyright restrictions.\n\nApply adduction\nmoment\n~3% x bw x ht\n=34.1 Nm\n2 million cycles\nImage of the Stanford-Jaipur Knee\nundergoing a stress test has been\nremoved due to copyright restrictions.\n\nIncrease force at\n20N/s (1Nm/s)\nStanford knee\nfailed at 3500N\n(175Nm)\n\nWear from cyclical\nrotary motion\nwithin the knee\njoint bearing\nsurfaces\nImage of the Stanford-Jaipur Knee\nundergoing a wear test has been removed\ndue to copyright restrictions.\n\nWide and bulky\nNoise (Click!)\nShock / Discomfort\nBetter\nmanufacturing?\nRequires milling or\nmolding\nEach site requires a\nmold\n\nWide and bulky\nNoise (Click!)\nShock / Discomfort\nBetter\nmanufacturing?\nRequires milling or\nmolding\nEach site requires a\nmold\n\nViscous damping\nduring swing phase\nReduces impact\nPreserves joints\nNatural gait.\n\nMore suitable for low cost knee\ndesigns than are hydraulic\ndampers\nMedium is environmental air\nAlready incorporated\n\nPneumatic\nlow cost\nlong throw\nEngineering model of pneumatic device\nremoved due to copyright restrictions.\n\nStep 1: Redesign Stanford-Jaipur Knee\nNo milling, no molding\n\nStep 1: Redesign Stanford-Jaipur Knee\nNo milling, no molding\nStep 2: Build a prototype @Fab Lab & test\n\nStep 1: Redesign Stanford-Jaipur Knee\nNo milling, no molding\nStep 2: Build a prototype @Fab Lab & test\nStep 3: Build a pneumatic damper\n\nStep 1: Redesign Stanford-Jaipur Knee\nNo milling, no molding\nStep 2: Build a prototype @Fab Lab & test\nStep 3: Build a pneumatic damper\nStep 4: Introduce damper into the knee\n\nStep 1: Redesign Stanford-Jaipur Knee\nNo milling, no molding\nStep 2: Build a prototype @Fab Lab & test\nStep 3: Build a pneumatic damper\nStep 4: Introduce damper into the knee\nStep 5: Optimize the damper\n\nStep 1: Redesign Stanford-Jaipur Knee\nNo milling, no molding\nStep 2: Build a prototype @Fab Lab & test\nStep 3: Build a pneumatic damper\nStep 4: Introduce damper into the knee\nStep 5: Optimize the damper\n1~3 weeks per step\n\nStep 1: Redesign Stanford-Jaipur Knee\nNo milling, no molding\nStep 2: Build a prototype @Fab Lab & test\nStep 3: Build a pneumatic damper\nStep 4: Introduce damper into the knee\nStep 5: Optimize the damper\n1~3 weeks per step\nWe have 7 weeks after spring break\n\nDavid - research on pneumatic dampers\nAmber - modify design so that it can be\nwaterjetted\nRyu - incorporate improvements Dr. Pooja\nsuggested\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nEC.722 Special Topics at Edgerton Center:Developing World Prosthetics\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Pediatric Extendable Prosthetic Device team final",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-722-special-topics-at-edgerton-center-developing-world-prosthetics-spring-2010/1bc735f3b970f51638df2c57479743df_MITEC_722S10_pepd_final.pdf",
      "content": "Pediatric Extendable\nProsthetic Device\n\nCindy Oh, Deema Totah\nMay 2010\n\nOh, Totah 1\n\nAmputation can happen at any stage in life. As engineers, it's our job to be able to suit a\nperson's need, no matter how extreme they may be. The focus of an extendable prosthesis is a growing\nchild. In the states and well-developed countries, there is no such device because frequent trips to the\ndoctor or prostheticist's office are fairly common. However, in places such as India, amputees cannot\nafford to spend multiple days getting fitted for their limb, let alone make the trip for multiple return\nvisits. This creates an impasse for young amputees because of their high growth rate. Often times, a\nchild will outgrow his/ her limb within a couple of months, and is in need of a new one. These problems\nall point to the demand of an extendable child's prosthetic device.\n\nThe goals of this project are centered on the user. The leg must be user-modifiable and user-\nfriendly. The child, with the help of the family, must be able to know when and how to adjust the pylon.\nAdditionally, the leg must be robust and stable enough to support the activity of a dynamic child. Of\ncourse, there are also requirements for the engineer. These include using a non-toxic, environmental\nfriendly material, keeping the cost low, maintaining the device at a low-weight, and optimizing the\nstrength of the mechanism. All this is done keeping in mind the optimal production methods and\nmaterials available at the facility in India.\n\nKeeping these restrictions and requirements in mind, a primitive prototype was created. (Figure\nA) Some other designs we considered are shown in the appendix as well. The rotation-lock mechanism\nworks similarly to many mainstream devices. In the figure shown, there are two coaxial tubes. The inner\ntube has a knob which slides in the paths restricted by the outer one. By sliding the knob into the\nhorizontal paths the mechanism stays in place. (Figure B) A different mechanism was the binding-clamp\nring device. In this case, rings grasp divots on the pylon and restrict movement. (Figure C)\n\nThe chosen design was the saw-tooth mechanism held together by hose-clamps. The intention\nbehind this device was to create a self-supporting system in which the surface contact between the two\n\nOh, Totah 2\npieces provides a large magnitude of strength. In addition, it is very user-friendly and intuitive, so that\nthe patient/family need minimal training. After working out details such as extension intervals and\nmethod of cutting, a 6-inch rod of oil-filled nylon was cut with a water jet into 2 pieces with ridges. The\ntwo pieces were then held together by a hose-clamp. (Figure D)\n\nThe next step in this process was to test different materials and their properties. This was\nachieved through molding and casting. A template was created, by making a negative mold, and used to\nefficiently produce multiple pylons of different materials. After various pylons of different plastics were\ncreated, a stress test was performed. The maximum stress endured by the Polyurethane pylon was 1300\nN/m2. The pylon appeared to fail at the point where the ridges begin from the top - where the stress\nwas applied. This shows that the load on the prosthetic was concentrated at the point where the ridges\nare free, as was expected. Adding (lego-like) wedges in the empty space between the ridges was\nproposed as a solution to strengthen the pylon structure.\n\nAnother crucial aspect of this project was the making of pyramids. (Figure E) The Jaipur system\ncurrently doesn't use a pyramid to align the leg, but instead has a non-adjustable screw. (Figure F)\nPyramids will allow for slight adjustments in the XY plane for added comfort for the child as he/ she\nadjusts and adapts to the prosthesis making it a more personal experience. The original pyramid is made\nof steel, individually-milled, and extremely expensive. By molding and casting these as well, we were\nable to maintain the strength of a pyramid, yet reduce the weight by orders of magnitude. Plastic\npyramids (3D printed and casted) are shown in the appendix. (Figure G)\n\nFinally, as an ongoing project, the most important part is collaboration with young amputees. As\nteam members collaborate with Jaipur Foot, it will soon be discovered if the current device is adequate.\nIf strength or stability becomes a problem, and patients feel insecure in the device, the design will need\nto be altered to maximize these properties. This can be done by adjusting the mechanics behind the\n\nOh, Totah 3\nmechanism. One possible adjustment is rounded teeth so that the force can be dispersed and the risk of\ncracking can be reduced. This design suggestion might increase sustainability and yield strength.\n\nA project is only as successful as the user claims is to be. This project will always have room for\nimprovement, and engineers will always be able to adjust it according to what the amputee may want or\nneed. The extendable pediatric prosthetic device provides so many advantages to a growing child and\nhis/ her family. The hope for the future is that this design may open the door for a wide distribution of a\nmore individualistic product.\n\nOh, Totah 4\n\nAppendix I\nFigure A\n\nFigure C\n\nFigure B\n\nFigure D\n\nOh, Totah 5\n\nFigure E\n\nFigure G\n\nFigure F\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nEC.722 Special Topics at Edgerton Center:Developing World Prosthetics\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Pediatric Prosthetics midterm presentation",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-722-special-topics-at-edgerton-center-developing-world-prosthetics-spring-2010/87060c22cb2ae96bcd9199e7123213f2_MITEC_722S10_pepd_midterm.pdf",
      "content": "Pediatric Prosthe-cs\nNadya Peek\nCindy Oh\nDeema Totah\n\nObjec-ve\nAdjustable Child Prosthesis\nPhotos of an adjustable child prosthetic leg and a photo\nof a child with a prosthetic leg needing refitting have\nbeen removed due to copyright restrictions.\n\nRequirements\n- Easy to Use\n- Adjustable\n- Durable\n- ~ 3 Years\n- Compa-ble\n\nRestric-ons\n- Weight\nPhoto of various metal materials removed\n- Aesthe-c Cover\ndue to copyright restrictions.\n- Materials\n- Cost\n\nMechanisms\n1) Rota-on Lock\n\nMechanisms\n2) Binder -‐ Clamping\n\nMechanisms\n3) Crutch Leg\n\nMechanisms\n4) Saw-‐tooth Mechanism\n\nPyramids & Legos\n- Cost\n- Weight\n- Availability\n- Material\nPhoto of lego pirate with peg leg\nremoved due to copyright restrictions.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nEC.722 Special Topics at Edgerton Center:Developing World Prosthetics\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Shape & Roll team final",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-722-special-topics-at-edgerton-center-developing-world-prosthetics-spring-2010/9be8531430f698046fb74512be451984_MITEC_722S10_shpnrol_final.pdf",
      "content": "SHAPE & ROLL:\nCOSMETIC SHELL\n\nParhys L. Napier\nNicholas Torgerson\n\nSP.718: Developing World Prosthetics\nMay 14, 2010\n\nBACKGROUND\nJaipur is one of the most well-known organizations for prosthetic devices developing countries.\nThe Jaipur Foot is an easy to manufacture prosthetic foot that gives patients the ability to do\nmany things that they could do with an actual foot (running, climbing, etc.). The Jaipur Foot is\ncomprised of simple materials and can be colored to match the complexion of patients. It also\nallows for dorsiflexion like a biological foot.\n\nAlthough the Jaipur Foot is indeed a remarkable device, it is not without its faults. The Jaipur\nFoot lacks toe support, resulting in a shortened stride while walking. Also, the use of different\nmaterials in the Jaipur Foot causes deterioration when they rub against each other.\nAdditionally, the Jaipur Foot is quite heavy; its current design weighs roughly 800 g.\n\nFigure 1 - Shape & Roll Foot\n\nTo address the problems of the Jaipur Foot, the Shape & Roll foot (Figure 1) was created by a\nteam of researchers at Northwestern University in 2004. It was created for use in low-income\ncountries, as an alternative to the prosthetic feet commonly distributed. The S&R closely\nresembles the roll-over contour of a normal stride. The S&R is far lighter than the Jaipur Foot\n(made from polyethylene) and is low in cost to make.\n\nAttempts to make a cover for the S&R have been less than successful. Although the S&R can\noperate without a cover, a cover is desired so that the device is well-received by patients living\nin developing countries. Previous attempts of Shape & Roll feet with cosmetic covers have still\nbeen heavy. One cosmetic shell design was tested by researchers at Cornell University, but it\neventually wore out in a couple of months.\n\nGOALS\nOur main objective of this project was to create a cosmetic cover to coat the Shape&Roll\nprosthetic foot. This coating needs to be durable, and yet it also needs to be reasonably cheap.\nIn order for this project to work, we need to find a way to bond the Shape&Roll to the cosmetic\ncover in a secure fashion to reduce the rate of deterioration and wear. We also need to find a\nmaterial which is lightweight and flexible enough to avoid impeding the contour motion of the\nkeel, and yet be durable enough to withstand continual use in undesirable environments.\nPhoto of Shape and Roll Foot from Prosthetics Research Laboratory\nand Rehabilitation Engineering Research Program at Northwestern\nUniversity Feinberg School of Medicine has been removed due to copyright restrictions.\n\nOur second objective was to find a way to create a mechanical bond between the keel of the\nS&R and the cosmetic shell. Having a bond will reduce the amount of wear the Shape & Roll\nplaces on the cosmetic shell.\nCONCERNS\n- Using epoxy to bond S&R to sole - due to the difference in material (polyethylene vs.\nrubber), not sure if the epoxy will be able to bond the S&R to the keel.\n- Using cosmetic shell - the pieces inside the shell are likely to rub against each other and\ncause wear. One proposed method to prevent this is thermoforming the inner pieces to\nmake one unit. Heating plastic in a thermoform machine and vacuuming it over the\npieces inside the foot should prevent shifting while walking and water damage. In\naddition, wrapping the thermoformed piece with thin rubber would further prevent\ndamage and wear. Test trials would have to be done to see the effectiveness of this\nmethod. Exact methods to cover the hole of the shell have yet to be determined.\n\nMATERIALS\nNAME\nSUPPLIER\nPRICE\nQUANTITY\nPRODUCT NO.\nMold release\nAnywhere\n~$10\n1 can\n---\nFoam\nPolyurethane\nMcMasterr-Carr\n$27.86/sheet\n\n8997K531\nNeoprene rubber\nblock\nMcMasterr-Carr\n$4.63/block\n\n1457T22\nSuper Glue\nLoctite\n$5.49\n---\nTread rubber\nMcMasterr-Carr\n$13.00/sheet\n1 sheet\n3727T242\nTeflon PTFE\nsheets\nMcMasterr-Carr\n$36.21 for 2'\nsheet\n1 sheet\n8545K32\nEpoxy\nAnywhere\n~$5\n1 canister\n---\nSuper Sculpey\nFIRM Gray\npolymer clay\nSculpey III\n~$13/lb.\n2 lbs\n---\nPutty\npolyurethane\nrubber\nMcMaster-Carr\n$88.88\n4 lbs.\n8644K15\nLiquid fiberglass\nresin\nMcMasterr-Carr\n$31.79\n1 kit\n75325A1\nNeoprene/Cork\ngasket sheet\nMcMaster-Carr\n$29.80/sheet\n9607K65\n\n1. Polymer clay - the clay will be used to cast a mold of the foot. Polymer clay is relatively\ninexpensive and takes impression well.\n2. Mold release - necessary to remove foot from clay without distorting the impression\n\n3. Foam rubber - lightweight rubber that is good for shock absorption. Will be used as\nfiller for spaces in the foot and for making the toes and filling in gaps.\n4. Neoprene rubber - used for filler pieces\n5. Tread rubber - sole of the foot due to roughness\n6. Teflon PTFE - used to prevent seepage into cuts of the S&R\n7. Epoxy - used as adhesive between S&R and sole\n8. Putty polyurethane rubber - material used for cosmetic shell from the negative mold of\nthe foot. When allowed to cure overnight, the shell can be used and filled with the S&R\nand filler components.\n9. Liquid fiberglass resin - used to strengthen urethane. Polyurethane is not rigid when\ncured, so a layer of fiberglass resin will reinforce the rubber and add to its rigidity, as\nwell as increase strength and durability.\n\nPROCEDURE\nInner Core (Figure 2)\n\n1. Use polymer clay to mold left and right sides of sample Jaipur Foot. Spray foot with\nmold release before applying clay to leave lasting impression when foot is removed.\n2. 3D print a replica of each clay mold. Combine the replicas to have a negative mold of the\nfoot.\n3. Use the dimensions of the negative mold to cut out sole of the foot in the tread rubber.\n4. Score the base of the S&R and adhere it to the tread rubber sole using epoxy. Set aside\nto dry.\n5. Cut neoprene block into 2\" pieces, resulting in 3 smaller blocks. Cut each smaller block\ninto 0.125\" thick sheets.\n6. Use 24 2\" x 0.125\" neoprene rubber sheets to fill in the gaps on the sides of the foot.\nUse super glue to hold pieces together.\n7. Use neoprene/cork gasket to fill in the toes.\n\nFigure 2 - Inner Core\n\nOuter Core\n\n1. 3D print a replica of the same Jaipur Foot used for the inner core.\n2. Mix putty polyurethane. Use gloves and wear clothing that covers skin.\n\n3. Apply putty polyurethane onto replicated foot. Use mixing stick to smooth out lumps\nand air bubbles. Apply until desired thickness (0.25\").\n4. Allow to cure (24 hours).\n\nRESULTS\nA polyurethane cosmetic shell for the S&R cover was successfully created (Figures 3 and 4).\nAfter curing, the shell was removed from the replicated foot. The inner core was place inside\nthe foot and any remaining gaps were filled with polyurethane foam to reduce the amount of\nweight added to the foot.\n\nFigure 3 - Cosmetic Shell (Side View)\n\nFigure 4 - Cosmetic Shell\n\nTesting of the foot was not possible. Due to the inability to order the polyurethane putty early.\nBy the time the putty arrived, the time allotted for completion of the project had passed. Given\nthe amount of material used, the cost of the first prototype is estimated around $35.\n\nCHALLENGES\nDuring this project, we ran into a variety of challenges and problems. Our original design\nincluded an ankle mechanism to allow extreme dorsiflexion, but this design was later dropped.\nDue to that, we needed to re-design the shape of the foot. We also ran into problems finding\nthe polyurethane rubber to use as the cosmetic cover. We attempted to find non-solid forms\n(either liquid or putty), but found this to be difficult since most suppliers were out of stock and\nnot going to restock for months. This restricted our work progress to only the inner core.\n\nRECOMMENDATIONS\n\nIn future years for when this project is worked on, there are many things we suggest being\nattempted. First is to test the prototype we have created to see if it functions. The shape of\nthe Shape & Roll is also very low to the ground, and should be modified to more closely\nresemble the shape of an actual foot. Also, when creating the cosmetic cover, we recommend\nattempting vulcanization. This will act to solidify and waterproof the entire foot, however we\nwere unable to test this in class.\nREFERENCES\n1. The Shape & Roll Prosthetic Foot (Part I): Design and Development of Appropriate\nTechnology for Low-Income Countries\n2. The Shape & Roll Prosthetic (Part II): Field Testing in El Salvador\n3. Jaipur Foot Manual\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nEC.722 Special Topics at Edgerton Center:Developing World Prosthetics\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Shape and Roll midterm presentation",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-722-special-topics-at-edgerton-center-developing-world-prosthetics-spring-2010/03895d6cb5fcf397a93cf123b7a23667_MITEC_722S10_shpnrol_mdtrm.pdf",
      "content": "Jaipur Foot\nEasy to manufacture\nGives patients the\nability to do many of\nthe things they could\nwith an actual foot\nRunning, climbing trees, etc\nUses simple materials, and coloring can be\nmade to match the native skin color\nPhoto of Jaipur Foot removed due to copyright restrictions.\n\nProblems with Jaipur Foot\nLacks toe support\nLeads to shortened stride\nUse of different materials inside foot can\ncause deterioration\nHeavy: current design is roughly 800g\n\nGoals of the Shape & Roll Foot\nIncorporate a foot design to resemble\nthe dorsiflexion of a biological foot/ankle\nin stride\nReduce the weight of the foot while\nmaintaining the same durability\nAllow for easier squatting\n\nCurrent S&R Capabilities\nClosely\nresembles the\nroll-over\ncontour of a\nnormal stride\nFar lighter than\nthe Jaipur Foot\nLow in cost\nPhoto of Shape and Roll Foot from Prosthetics Research\nLaboratory and Rehabilitation Engineering Research Program\nat Northwestern University Feinberg School of Medicine\nhas been removed due to copyright restrictions.\n\nGoals for the Shape & Roll Project\n1. Create an ankle design to allow for\nextreme dorsiflexion while squatting\n\nEdward Sung\n2. Find a way to make a cosmetic cover\nfor the current S&R Foot\n\nParhys Napier and Nicholas Torgerson\n\nAnkle Joint Design\n~ 25 degrees range\nof motion\nMaterial cost < $20\nLabor cost > $50\n\nProcess:\nMachine grooves\nand angled sides\nSand/grind for\naesthetics\nFuture Plan\nDecide on\nactuation:\nWire\nPush-pull rod\nWork on interface\n\nGoal 2: Improving the Cosmetic\nCover\nCreate a mold around the S&R core and\nform the cosmetic cover directly on top\nof it (S&R-Jaipur Hybrid)\nFind a lightweight, flexible and durable\nmaterial for the cosmetic cover\n\nCurrent Problems\nPrevious attempts at S&R feet with\ncosmetic covers have still been heavy\nOne cosmetic shell design was tested\nby Cornell, but eventually wore out in a\ncouple of months\n\nMethods of Covering S&R\nMake a cosmetic sleeve, and slide the\nShape & Roll into it\nFill the empty spaces with a foam-like\nsubstance\nCreate a hybrid Jaipur Foot using the\nShape-and-Roll as the core\nThe cosmetic cover is molded directly onto\nthe S&R using a process similar to that of\nthe Jaipur foot\n\nCosmetic Shell\nAdvantages:\nDisadvantages:\nLightweight\nRapid process\nInexpensive\nPhoto of cosmetic shell for a prosthetic foot\nremoved due to copyright restrictions.\nRequires filling due to\nloose-fit\nNot waterproof\nDepending on the\nmaterial, sleeve can be\nabrasive on prosthetic\nNot as rigid as hybrid\nWould not allow for a\ngood bond between\nthe keel and the mold\n\nS&R-Jaipur Hybrid\nAdvantages:\nCompletely watertight\nMore durable than a shell\nLess chance for wear due\nto parts rubbing against\none another\nOne solid foot rather\nthan multiple pieces\nDisadvantages:\nHeavy\nDoes not allow for\nsquatting\nPhotos of hybrid Shape & Roll - Jaipur Foot\nremoved due to copyright restrictions.\n\nHybrid Foot Approach\nMaterials in S&R-Jaipur Hybrid\nRubber (vulcanized, natural, crepe) -\ndensity: 1100 kg/m^3\nTeflon - density: 2200 kg/m^3\nWooden block - density: ~ 650 kg/\nm^3\nWant to use a similar approach,\nbut use alternate materials for a\nlighter foot\nCombined with ankle mechanism,\nthe foot will allow for dorsiflexion\n\n~ $9/1'x1' .01\" sheet (McMaster-Carr)\nMaterials - First Prototype\nUrethane 60\nDurable, yet also flexible\nCan buy in bulk\nNot very toxic\n~ $105/gallon (Smooth-On, Inc.)\nFiber Reinforcement\nBy adding glass fibers to the Urethane 60,\nwe hope to reinforce the foot and make it\nmore durable\n\nCons: lacks hardness, susceptible to abrasion\nAdditional Materials\nComposite Materials\nEx: Carbon fiber\nPro: Lightweight, extremely durable\nCon: Potentially damaging to S&R foot\nSynthetic Rubbers\nEx: Neoprene\nPros: durability over wide temperature ranges; water\nresistant\nCons: price, local availability\nMicrocellular Rubber (MCR)\nPros: low density; lightweight; soft; high impact\nabsorption\n\nNeeds to be waterproof\nPossible material: urethane 40 (~$100/\ngallon)\nModification for New Ankle\nDesign\nUse a more flexible material to allow full\ndorsiflexion capabilities during squatting.\nLooking to use a something similar to a\nsleeve to cover the ankle.\nSleeve will be integrated into the mold to\nmake one piece.\n\nPlan to either use strong adhesive or integrate the\nkeel into the mold as one piece.\nMolding Modification\nCurrent methods use rubber blocks to fill in\ngaps around the S&R core\nWe plan to use a lighter \"filler\" to reduce\nweight\nFoam similar to the kind used in the toes\nMicrocellular Rubber (MCR)\nPolymers (like polyurethane)\nCork\nBonding between keel and mold\nReceived feedback on the importance of bonding the\nkeel to the mold (decreases movement and wear)\n\nPlan of Action\nWe hope to order materials and begin\nprototyping the week after spring break\n(3/29)\nBegin testing (durability, amount of flexion, etc.)\nCollect data/analyze (week of 4/5)\nModify the design and any failed materials with\nalternate materials/improved design (week of\n4/12)\nMake new prototype(s) based off of success of\nprevious prototype and resume testing (finish\ntentatively week of 4/26)\nIntegrate ankle mechanism with cosmetic mold;\ntest with ankle cover (late April, early May)\nFinish a final prototype by the end of the\nsemester.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nEC.722 Special Topics at Edgerton Center:Developing World Prosthetics\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Vacu-Cast System team final",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-722-special-topics-at-edgerton-center-developing-world-prosthetics-spring-2010/073d635a7afe026e59ed02b3081e04df_MITEC_722S10_vacucast_fnal.pdf",
      "content": "Final Project Report\nTeam Vacu-Cast System\nMatthew Todd Farrell, Marc Louis, Leslie Meyer, David Sengeh\nVacu-cast System:\nA cheap system for effective socket production.\nBackground:\nFor amputees all around the world, the defining attributes for a prosthetic limb is comfort.\nFor prosthesis to feel like a natural extension of the body, the socket, which is the part\nthat makes contact with the body, must be as comfortable as possible. The defining\ncharacteristics of a stump are important but a patient's continued use a system is\ndependent on the quality of the socket.\nThus, it is most important that a well-fitted socket is developed by prosthetists, especially\nin developing countries where the stumps are usually very basic. In the developed world,\nsockets are made from expensive carbon fiber or polyethylene using wet plaster of Paris\n(POP) mold. Our Vacu-cast team is however trying to improve on the vacuum casting\nsystem, which does not involve the use of POP for the molding.\nThis 'vacuum casting system' is cheaper, efficient and with minimal waste. Using a\nvacuum pump, a bag filled with polystyrene beads, negative molds could be readily\ncreated for a final socket production. Our team focuses particularly on testing different\nmaterials to make the polystyrene bag component of the system more self-contained and\ngreener. Our goal is to make the very comfortable sockets from accurate molds with the\ncheapest and most effective materials possible.\nInnovation in Technology:\nThe present Vacuum Casting System uses vacuum created about a bag containing\npolystyrene beads to produce the negative mold of a stump. However, two plastic bags\nare used in this process; one for hygienic reasons as the stump is not directly placed in\ncontact with the bag containing the beads and the other is used to contain the whole unit.\nOur focus is to make the whole process much more self-contained and thereby reduce the\namount of plastic bags used every time without jeopardizing the effectiveness and\nhygienic steps taken. Furthermore, our team was able to design a two-way cap, which is\nmeant to reduce inefficiencies developed by the loss of vacuum around the negative and\npositive molds. We have created a CAD image of the cap, which is ready to be 3-D\nprinted to begin with. After which, we aim to produce some units to test in the field. With\nthe cap, we can guarantee that the one-way valve is always well positioned (in the\nprevious system, the valve could get clogged with the plastic bag if not properly\npositioned) and we can create the best vacuum.\nProgress:\n\nFinal Project Report\nTeam Vacu-Cast System\nMatthew Todd Farrell, Marc Louis, Leslie Meyer, David Sengeh\nTo begin with, the Vacu-cast team tried to find different kinds of plastic bags apart from\nthe one presently used by Dr. Wu for the integrated system. We bought different kinds of\ntrash bags of different thickness in addition to a \"Stretchlon\" with which we ran\nexperiments. We cut each of the plastic bags so that they could perfectly fit around the\nbag containing the glass beads. We realized that the thicker plastic bags were not as ideal\nonce the vacuum was created because of the creases formed in the vacuum. This would\nnot be good for creating a perfectly fitting mould. The \"Stretchlon\" and plastic bags of\nsmaller thickness were the most effective for forming the kind of mould we imagined.\nIn addition we developed a new attachment for connecting trash bags and a hose to the\npolystyrene bag inside the trash bag. See below,\nThis attachement is an improvement since it improves the quality of the seal that is\nneeded to make a longer lasting negative mold. This project will be developed further as\ntime progresses by making 3D molds and other various connectors to improve the all in\none socket system.\nInitially, we had plans for multiple other projects. We originally wanted to work on\n\"Developing an Improved Pyramid for a Socket,\" using the \"Fablab Casting Method used\nfor production of cost effective sockets,\" and establishing a \"Force simulation of a\nsocket.\"\nFuture plans:\nOur team members are going to be working on this project over the next couple of years.\nDavid and Todd plan to work on this in graduate school whilst Leslie is considering\nbeing a UROP over the next couple of years to see this project to be developed. In our\nconversations with Dr. Wu, we have decided that with modifications on the product, we\nwill take the system to places as remote as India and Sierra Leone. Once we are able to\nget an improved version of this product, we plan to have studies\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nEC.722 Special Topics at Edgerton Center:Developing World Prosthetics\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Vacu-Cast System team midterm",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-722-special-topics-at-edgerton-center-developing-world-prosthetics-spring-2010/688fc7a8fd03f1c1f17a58123f9b38ca_MITEC_722S10_vacucast_mdtm.pdf",
      "content": "w\narr\nav\ner\nVacuum Casting\nVacuum Casting\nSystem\nSystem\nMarc Louis Matthe\nF\nell D\nid Sengeh Leslie Mey\nMarc Louis, Matthew Farrell, David Sengeh, Leslie Meyer\nMarch 30, 2009\n\nOriginal Ideas\nOriginal Ideas\n6 Fablab Casting Method used for\nproduction of cost effective sockets\np\n6 Developing an Improved Pyramid for\na Socket\na Socket\n6 Vacuum Cast Sockets for Cost\nEffective Socket Product\nEffective Socket Product\n6 Force simulation of a socket\n\ng\ny\nVacuum Casting System\nOverview\n\ne\nur\nWhere W C\nrentl Stand\nWhere We Currently Stand\n6 Integrated bag and Nozzle\n6 Replacement of beads with local\nmaterials\n6 Pump for vacuum creation\n6 Bike pumps\n6 Other sources of human power\n\ng\ng\nIntegrated Ba and Nozzle\nSystem\n6 Cheaper\n6 (no need to buy/keep replenishing plastic bags)\n(\ny\np\np\ng p\ng )\n6 - Greener\n6 (reusability)\n(reusability)\n6 - Self contained\n6 (easier to use)\n6 (easier to use)\n6 - More efficient\nM\nb\nff\nti\nt d b\nf l\ni l\n6 May be a more effective vacuum created because of less air loss\n(experimentation and examination needed)\ng\n\nDiagram of Integrated Nozzle\ng\ng\nand Bag System\nParts of the System\n1. Outer Non-Pourous Bag\n. Oute No\nou ous\nag\n2.Inner Pourous Bag\n3. Air Pump\n4. Screw Top\nEasy Fastening\n\ne\nMaterial R quirements\nMaterial Requirements\n6 Flexible\nFlexible\n(variable stumps)\nN\n6 No memory\n6 (can go back to default after air is added in)\nNot porous\n6 Preferably cheap and easily accessible\ny\np\ny\n6 Durability and Longevity\n6 No side effects\n6 (irritation, toxins etc)\n\nPossible Materials\nPossible Materials\n6 Material used in Airline pillows\n6 A porous material and soak into some\nkind of resin\n6 Balloon material\n6 Vacuum Storage Bag\n6 Vacuum Storage Bag\n6 Various plastic bags\n( hi k\n\ni i\n\n)\n6 (thickness, exact composition, etc)\n\no\nR ugh Timeline/ indicators\nRough Timeline/ indicators\nIdentify material\n-Identify material\n- Attaching Nozzle\n- Testing\n-- Product Modification (Prototyping)\n-- Testing\nd\n-- Product\n\na\ne\nQuestions nd Sugg stions\nQuestions and Suggestions\nF\nl f\nt\nk\nti\nFeel free to ask any questions\nor give any suggestions\nor give any suggestions\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nEC.722 Special Topics at Edgerton Center:Developing World Prosthetics\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}