{
  "course_name": "Special Topics in Cinematic Storytelling",
  "course_description": "This seminar explores approaches to representation for distributed cinematic storytelling. The relationship between story creation and story appreciation is analyzed. Readings are drawn from literary and cinematic criticism, as well as from descriptions of interactive, distributed works. Students analyze a range of storytelling techniques; they develop a proposal using visualization techniques; and they prototype a working story experience, culminating in a final project displayed at the end of the semester.",
  "topics": [
    "Fine Arts",
    "Media Studies",
    "Visual Arts",
    "Film and Video",
    "Humanities",
    "Literature",
    "Criticism",
    "Fine Arts",
    "Media Studies",
    "Visual Arts",
    "Film and Video",
    "Humanities",
    "Literature",
    "Criticism"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 sessions / week, 2 hours / session\n\nInstructors\n\nProf. Glorianna Davenport\n\nTA: Barbara Barry\n\nGuest Lecturers\n\nKevin Brooks, Push Singh, Barbara Barry, Tamiko Thiel, Pattie Maes, Orit Zuckerman, David Gatenby.\n\nStorytelling is widely recognized as a fundamental mode of human communication; it presents a structured representation of action and causality over time and in context. Stories are made and shared using live or recorded media. In the case of recorded media, the process of creating and presenting story can be enhanced and extended using various types of representation, computation, and powerful user interfaces. In this seminar, we present some basic building blocks of story construction and representation. Topics include: a comparison of information and story; representations used in story creation and playout; the author/story/audience interface; past experiments in computer-assisted storytelling systems; and, common-sense as an approach to representing the world. Students will develop their own short stories, scenarios, content, and hands-on experiments in cinematic presentation.\n\nRequirements\n\nThere are four assignments through the course of the semester, culminating in the final project which will be reviewed in the last class. Participation in the seminar and discussion of the readings are also critical to the success of the class.",
  "files": [
    {
      "category": "Resource",
      "title": "narrativeassign.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/mas-845-special-topics-in-cinematic-storytelling-spring-2004/3dd025871ce547e5c1e1c60e131b64a4_narrativeassign.pdf",
      "content": "Assignment for MAS 845\nSpring 2004\nDue Thursday 2/12\nThese readings provide a mini introduction to the philosophical, cultural,\nand technological issues surrounding the existence, creation, and reception\nof stories. They provide useful entry-points to an enormous corpus of human\nexpression: the art itself (stories expressed through a particular medium)\nand ruminations on the processes, forces, and constraints that shaped the\nmaking and sharing of that art.\nTo untangle our own perspective of story from this age-old web of signaled\ncommunications, we must seek out what others have thought and created, and\n-- most importantly -- we must practice the art for ourselves.\nAs you read these articles, think about a story you have just told someone.\nThink about your first remembered experience of story listening and of\nstorytelling. Think about a story that you have judged to be \"great:\" Why\ndoes it have the form it has? How does it reveal the story world? Think\nabout the multiple situations in which you use story as a structure for\nsocial exchange and memory: which use is more critical?\nThis assignment has two parts to help initiate your quest within the\ncontext of this course:\n1) An exercise to distinguish information from story.\nAssemble a small collection of information from your personal life. Weave\nthis information into a very short story. Post the information as such and\nthe story onto the class web site. Be prepared to present your journey in\nclass.\n2) An exercise in connecting theory to an actual artifact.\nCreate a short presentation that links your analysis of a movie of your\nchoosing to one of the readings. Remember that the representation you use\nfor your analysis will be key to communicating the relationship you wish to\nfocus on to other people in the class who have not seen the movie but have\nread the articles."
    },
    {
      "category": "Resource",
      "title": "wordscenassign.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/mas-845-special-topics-in-cinematic-storytelling-spring-2004/b6a35c180c423a80a1743eabc7e55504_wordscenassign.pdf",
      "content": "MAS845 Assignment 2\nWorld Scenario and Representation\nDue 2/26/04\nThe focus of this assignment is to develop a story set and a representation that can be\nused to explore different ways of sequencing the set. Later we combine the sets and\nexplore what types of representation might work across all of them. Students work in\nsmall teams.\nThe story:\nEach team creates a \"story\" with three characters. The story should be based in the\npresent and located in the Cambridge/Boston environs. The narrative structure for each\ncharacter will need to follow a specified (by the team) structure. The three character\nnarratives need to fit together into a single structured narrative. The end goal is to be able\nto navigate each team's project either on a character level or larger multi-character\nlevel. The multi-character level will need to represent different ways of looking at the\nworld - could be complementary or contradictory, but must be different. (The Carol\nPearson reading should help with this.)\nThe mission:\nThese stories have been commissioned for a space mission. A physical representation of\nthe story will be shot off into space, will our nearest star system, Alpha Centauri, and\nthen return toward Earth. Assuming that it is not intercepted by another life form, it will\nreturn to earth in 100 years. Aside from the vehicle's scientific duties, it will act as a\ntraveling time capsule to either represent present day life on earth to another life form or\nremind our descendants of what life was really like, how people really loved, hated,\nrelated, etc. This is important because any distant life form may already have intercepted\nradio signal representations of everything from Gilligan's Island to Jerry Springer, to\nFriends and Howard Stern. And assuming popular media recordings of ourselves will\nlikely still be around on earth in another century, here is an opportunity for us to\nrepresent ourselves differently, hopefully with more honest, and in a more \"parsable\" or\nnavigable way.\nThe presentation:\nThe teams will need to present or \"tell\" their project the following week. (The Lipman\nreading will help a little with this). Part of the telling will have to include the other parts\nof story representation, perhaps even an image that shows how to navigate the story.\n(Like the image etched into the side of Voyager\nhttp://voyager.jpl.nasa.gov/image/images/spacecraft/disc.jpg). This representation is\nimportant because it is provides a key by which future generations or other forms of life\ncan find, navigate and understand the story. The story needs to be well thought out,\ninternally consistant and can be presented using whatever combination of modes --\nstoryboards, written text, structural representations, etc. -- the authors feel best conveys\nthe story and its representation."
    },
    {
      "category": "Resource",
      "title": "assn3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/mas-845-special-topics-in-cinematic-storytelling-spring-2004/bb793ba813231e7aad1ff50d6e51ecab_assn3.pdf",
      "content": "MAS 845 - Cinematic Storytelling\nAssignment 3\nVideo Story Engine\n\nThe goal of this assignment is to develop a machine strategy that you think might be\nsuccessful in creating a story presentation from a small collection of video clips.\n\nThere are three aspects to the assignment: gathering story content, designing content\nknowledge representation and a designing a story engine (algorithm) for search and\npresentation of the story material.\n\nEach group should decide on a story topic and collect video material that would allow\nyou to make a few sequences. Based on your selection of topic, you will have a sense of\nwhether you story is about an event (a dinner party, a demonstration), a portrait (a person,\nan institution), an issue (abortion, stem cell research) or a process (creating a building, a\nmeal). Think about how you would want an audience to be able to explore this story.\nWhat are the criteria for content ordering? What are the properties of the content that the\nsystem knows about? How is the story constructed? How can the system and the audience\nmake decisions about what to show or see next?\n\nWhen you return with the footage, cull the material that you think makes a semi-coherent\ndatabase. Develop your algorithm and use it to assemble a set of sequences from the\nvideo material (each no longer than 5 minutes).\n\nThis assignment does not require that you implement the computational engine. Be\nprepared to describe your proposed system in detail to the class, a clear map for future\nimplementation. Discuss story representation and construction issues and solutions that\narose during your work."
    },
    {
      "category": "Resource",
      "title": "1amory.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/mas-845-special-topics-in-cinematic-storytelling-spring-2004/09b78e013f97ee96a31aa2bc2be552a2_1amory.pdf",
      "content": "Jonathan Amory\nOn My Mind\nAs I write this I am quite tired. This is because last night, although my body was\nworn out, my mind was off designing two sailboats and a pair of comfortable shoes. My\nmind takes every opportunity available to create new devices or design better mouse traps,\noften at the expense of the rest of my body. It is so keyed into what it is doing that I have\ntremendous difficulty multi tasking. For example if I were to be analyzing my walk in\norder to design a better shoe, I, in all likely hood, would not be able to chew gum at the\nsame time. Thus, last night, the poor part of my brain that was trying to communicate to\nthe rest of my brain that my body desperately needed sleep was blocked by two hydraulic\nrams that would be controlling the canting keel on my imaginary vessel.\nSo realistic are the designs and models I build in my head that I can control and\nmanipulate them with incredible accuracy. In examining this skill I discovered that I\ncould play entire games of chess in my mind, and with more skill than if I could see the\nboard. I believe the reason for this is that when I play in my head I am distinctly aware\nof every piece and its relation to the rest of the game. When I can see the board, however,\nI filter out pieces that do not have an impact on the play at that moment, which can be\ngood in a fast game, but leaves me susceptible to making silly mistakes. This is most\nlikely due to a strategy I developed in overcoming my dyslexia. When I read I am only\nable to absorb about 20% of the words on the page. As a result I have learned to pick\nwhich words to absorb and how to form the rest of the information or story from only that\n20%. This ability to form a whole picture from limited information has transferred over\nto almost all other areas of thinking for me. When searching on the web, for example, I\ncan fly though pages to find what I want by only reading a couple of words and\nevaluating whether the page is useful or not.\nAnother strategy I a developed for dealing with my dyslexia is to look inward at\nhow I think and learn. That is the reason I am able to write this. This is necessary to\nanalyze whether the techniques I am using to learn are working or not. One thing that is\ncurrently not working for me is finishing this paper. That is because I have just glanced\nover at a magazine which had a pair of snowshoes on the cover, and my brain is rapidly\n\ndesigning a better pair. Moreover, it is competing for resources with the part of my brain\nthat is trying to write this paper, and it is winning quite easily. Already I have built a\nparametric model and am trying to figure out the best way to mount the binding. So,\nwith the last part of my brain that is devoted to this paper I think it is a good thing I will\nbe able to go over this tomorrow.\n\"The Man Who Would Be King\" in the context of \"The Writer's Journey\"\nI. Introduction\nAs I read Vogler's \"The Writer's Journey\" I kept thinking of one of my favorite\nfilms and stories, \"The Man Who Would Be King\" by Rudyard Kipling. For the most\npart, the story closely follows Vogler's stages of a hero's journey; however, there are\nseveral interesting differences. The journey of the two flawed heroes in this story is more\ncomplex than Vogler's stages of a hero's journey. This is partly because there is\nultimately no reward, and their own hubris leads to their demise in the supreme ordeal.\nIn this presentation I will provide a short plot summary for those who do not know the\nstory, followed by a comparison of the stages of a hero's journey with the journey of our\nheroes. Finally I will highlight some key points and differences between the two\njourneys.\nII. Brief plot summery\nThe movie starts with two ex-army scoundrels, Daniel Dravot and Peachy\nCarnehan, seeking the advice of Rudyard Kipling about a plan they have to become kings\nin the distant and unknown land of Kafiristan, last known to be visited by Alexander the\nGreat. To get there they cross mighty rivers, befriend and fight natives and climb over\nthe giant mountains of the Himalayas. Upon their arrival they become generals of a small\nvillage, and during a battle with a nearby town, Daniel Dravot is mistaken for a god.\nThey get taken to a holy city where they become supreme rulers and are given great\nriches. While Peachy wants to leave with the wealth they have gotten, Daniel, who starts\nto view himself as a god, wants to remain king and take a bride. This results in Daniel's\ndeath, and Peachy's crucifixion. Peachy somehow survives and makes his way back to\nKipling in India and recites his story.\nIII. Comparison of the stages of a hero's journey with \"The Man Who Would Be\nKing\"\n-Stages 1 and 2\nIn \"The Man Who Would Be King\" our two heroes closely follow the formula of\nthe first two stages of a hero's journey; 1) the ordinary world and 2) the call to adventure.\nIt is evident that Peachy and Daniel have become restless in India and crave adventure.\nShortly thereafter, their goal to become kings of Kafiristan, is clearly established. \"The\nMan Who Would Be King\", however, starts to veer away from this formula in stages\nthree and four.\n\n-Stages 3 and 4\nThere really is no refusal of the call (stage 3) by our heroes, rather they are egger\nto set off on their journey. Likewise, they do not really have an actual mentor (stage 4),\nfor they are going to uncharted territory to seek an unknown adventure. The elements of\ntheses stages, however, are not completely lost, and can be seen in Kipling's character.\nWhile the heroes themselves do not refuse the call, Kipling begs them not to go, and says\nthat their journey is madness. Additionally, he tells them of Alexander the Great, the last\nwesterner to visit Kafiristan. Alexander the Great becomes a recurring theme, and Daniel\nand Peachey seek to follow in his 2000 year old footsteps. Furthermore, Daniel, when\nassumed to be a god, is thought to be the son of Alexander the Great (hailed as a god). In\nthis way the themes of a refusal of the call and the mentor are seen in the movie, although\nnot directly played out by the main characters.\n-Stages 5 and 6\nIn stages five and six, crossing the first threshold and test, allies and enemies,\n\"The Man Who Would Be King\" reconnects with the hero's journey. Crossing the first\nthreshold for Daniel and Peachy is their journey to Kafiristan, across the rivers and over\nthe mountains to reach their destination. This marks the turning point between their\ndecision to become kings, and their actions to achieve this goal.\nOnce they reach Kafiristan, they meet friends like Billy Fish, the English speaking\ngurkha. They wage wars and test their resolve, leadership, and values. This gives the\naudience a closer look at our heroes. We see the cleverness and determination of Peachy,\nand the likeability, and pride of Daniel.\n-Stage 7\nThe approach to the inmost cave, stage 7, is in many ways the crossing of the\nsecond threshold. It is here where Peachy and Daniel have been taken to the sacred and\nholy city and are forced to confront their claim that Daniel is a god. The city is very\nforeign to them, and they cannot rely on their army or guns to save them, as they have in\nthe past. As in many stories this stage has a very spiritual element to it. The heroes must\noften look inward or to some mystical force for guidance. In \"The Man Who Would Be\nKing\" it is Daniel's claim of being a deity that brings them to this place and it is the spirit\nof Alexander the Great that leads to their initial salvation.\n-Stages 8 through 12\nThe story does not directly follow the last stages of the hero's journey, 8) the\nsupreme ordeal, 9) reward, 10) the road back, 11) resurrections and 12) return with the\nelixir, but has all the elements of each of these stages. The supreme ordeal in this story\nhas two parts, its starts with the priest of the holy city challenging Daniel's godliness. He\nsurvives, and the supreme ordeal goes into a period of limbo. In this limbo the reward of\nvast quantities of gold and jewels is given to our heroes. Here is where the story has an\ninteresting twist. Instead of leaving with the reward, Daniel gets caught up in his own\nhubris of being a god, leading to his downfall and ultimately failing the second part of the\nsupreme ordeal. There is no reward in the end.\n\nIn \"The Man Who Would Be King\" the resurrection of Peachy takes place before\nthe road home. He his crucified for days, yet manages to survive. He then makes the\njourney home, back to Kipling, over the same route he came by. What is so powerful\nabout these stages in the movie is that these stages are not shown, rather they are briefly\ntold from what remains of an old, beaten man. Lastly Peachy gives Kipling the bag he\nhas been carrying, which contains Daniel's head with his crown. This \"returning with the\nelixir\" gives the ultimate verification of the story.\nIV. Key points\nOne of the interesting elements of the \"The Man Who Would Be King\" is that the\nrole of the mentor is played by the unseen spirit of Alexander the Great. It is the unseen\nhand of Alexander the Great that guides Daniel and Peachy's journey. During the\nsupreme ordeal it is ultimately Alexander's legacy that saves Daniel. Likewise, when\nDaniel, corrupted by power, sees himself as the ancestor to the deified Alexander the\nGreat, it is his undoing. This blurring view of Alexander between a great man and a god\nis the driving mystical force of the story. When viewed as a man, our heroes can follow\nhis accomplishments, for they are men as well. When viewed as a god who they try to\nemulate, however, they fail for they are not gods.\nAnother interesting piece of the \"The Man Who Would Be King\" is that there is\nultimately no reward. Our heroes are merely men, and although they accomplish\nincredible feats, it is their human flaws that defeat them. The hero's journey often\ninvolves superhuman characters, while they can struggle, they always seem to come back\nwith the reward. It is the human nature of Peachy and Daniel that inspires awe in us to\nthink of what we, as humans, can accomplish, and chill us as to what faults it can lead to.\nLastly, what is fascinating about \"The Man Who Would Be King\" is that the\nresurrection and road home are only expressed in a few sentences. Although we do not\nsee these stages, we can clearly imagine how horrific they were. The power comes from\nour knowledge of the difficulty of the initial journey to Kafiristan by two healthy men\nwith supplies and donkeys, and from seeing the result in Peachy of his journey home.\nWhat is interesting is that the most difficult part of the journey is essentially unseen."
    },
    {
      "category": "Resource",
      "title": "1bodle.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/mas-845-special-topics-in-cinematic-storytelling-spring-2004/3769a19ae6c6c4d6833f470ff39d01f8_1bodle.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "1chatz.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/mas-845-special-topics-in-cinematic-storytelling-spring-2004/ba076908b8af8a60807b40838830ccba_1chatz.pdf",
      "content": "MAS845\nASSIGNMENT01\nAND\n- I spent six months in Holland as an Erasmus student in TU Delft.\n- I enjoy traveling very much.\n- I am quite unorganized as far as bureaucratic procedures are concerned.\n- In England, people are very strict regarding those bureaucratic procedures that\nI do not really care about.\nMYPERSONALLIFE\nDuring the six months that I stayed in Holland, I tried to travel around Western Europe as much as possible. In one of my\ntrips, I visited London. As a Greek citizen and, therefore, as a European Union citizen, I thought that a valid passport will\nnot be necessary for my trip to England. That is the reason why I did not care to renew my expired passport before my\ndeparture.\nWhile I encountered no problems when I arrived in London, the situation became complicated right before the departure of my\nreturning flight: The airline employee refused to let me travel with an expired passport. It was 5.00am on a Sunday and, as the\nrest of my friends left with that flight, I found myself alone in Stansted Airport, about two hours away from London.\nMy first reaction was to call the Greek Embassy in London. Unfortunately, they were closed on Sundays. I decided to take the\nbus back to London in order to get to the train station. However, the bus driver was not helpful at all: the ticket was 7£, I\nonly had a 10£ bill and, as I was her first passenger, she did not have any change. She told me that I had 90 seconds\n(according to her scheduled departure time) to find change or else I could not take the bus. After a panic run to the nearby\ncafe I managed to get the change and catch the bus.\nAfter two hours I reached the train station. To my disappointment I was informed that there was no train going to Holland or\nBelgium. They told me to go to Dover, a small south-eastern English town, and to catch the ferry to Ostende, Belgium from\nthere. So I did, by paying 18£ of course.\nAfter another two hours, I was in Dover. As soon as I got off the train, I took a bus that brought me to the ferry embarking\npoint. I thought that my adventure was reaching the end. I was wrong. I soon found out that the ferries were only going to\nCale, France and not to Belgium. However, I was informed that the high speed ferries, the ones that were actually going to\nOstende, were located at the other end of Dover's waterfront. It took me 20 minutes of walking and a lot of sweat, due to my\nheavy luggage, to get there.\nAt the ticket desk, I found out that a round trip ticket to Ostende cost 17£ while a one way ticket cost 34£! When they\nrealized that I was not going to come back, they refused to issue me a round trip ticket. At that point, my frustration reached\nthe highest level. Nevertheless, there was more to come.\nDuring check in, and despite my silent prayers, my expired passport did not go unnoticed. At first, I was told that I could not\ntravel. Luckily, after a half hour interview with the immigration officer, I was granted permission to leave the country.\nCINEMATICSTORYTELLING\nINFORMATION\nSTORY\nINFORMATIONFROM\nPANAGIOTISCHATZITSAKYRIS\nSTORY\n\nMAS845\nASSIGNMENT01\nAND\nTheory: \"The Writer's Journey\" by Christopher Vogler (1992)\nArtifact: \"The Trial\" by Orson Welles (1963)\nIn the next pages we will try to analyze the film \"The Trial\", written and directed by Orson Welles, using\nthe storytelling patterns that are described in Volgler's book \"The Writer's Journey\". Although the film\nis based on the novel with the same title by F.Kafka, we will consider it as an autonomous artifact, free\nfrom any association with the original novel.\nIn a prologue, Welles describes the film as having the logic of a nightmarea world in which nothing can be\nmastered. Looking back at Welles' career and the struggles he had to keep his work intact, it makes sense\nthat he would identify so strongly with Joseph K's paranoia.\nInstead of beginning with the ordinary world, Welles chooses\nto begin straight away with the call to adventure. The hero,\nnamed Joseph K, is woken up by policemen to find out that he\nis accused for a crime. However, despite his efforts, he is\nunable to find out what the accusation is.\n1CALLTO\nAfter the departure of the policemen, we are introduced to\nthe ordinary world of the hero and we start to identify his\ncharacter. He is an honest and obedient bank clerk that works\nfor a bureaucratic and totalitarian government of some\nunnamed country and time.\nWORLD\nCINEMATICSTORYTELLING\nTHEORY\nARTIFACT\nADVENTURE\nORDINARY\n\nMAS845\nASSIGNMENT01\nAND\nIn this case, refusal of the call would mean that the\nhero could quietly accept his fate without fighting. He\nis accused of an unspecified crime and, although he\nstrongly refuses to admit that he has done anything\nwrong, we are not certain what his reaction would be.\n3REFUSALOFTHECALL\nThe hero meets with several other characters before he\ntakes his final decision: his landlady, the nightclub\ndancer that lives next door and for whom he has secret\nfeelings, his boss at the office... None of them seems to\nbelieve his innocence. His resultant frustration pushes\nhim to deny the charges and go against the established\nsystem. In this story the mentors, instead of helping,\nare pushing the hero even further, in order to make him\nreact.\n4MEETINGWITHTHE\nThe hero finds himself in the courtroom, in front of the\njudges. He barely lets them speak as he strongly declares\nhis innocence while at the same time he heavily\ncriticizes the established procedures. He commits to the\nadventure of pursuing the truth.\nTHEFIRSTTHRESHOLD\nCINEMATICSTORYTELLING\nTHEORY\nARTIFACT\nMENTOR\nCROSSING\n\nMAS845\nASSIGNMENT01\nAND\nJoseph K decides to dismiss his lawyer as the ultimate\nexpression of rejection of the system. However, the\nadvocate, in an attempt to alter the hero's decision,\ndemonstrates the helpless situation of over another\naccused person that \"his case has gone bad\". If the hero\ndoes not want to end up like him, he should accept the\nadvocate's help. It is the moment that Joseph K should\nconfront his fears and takes his decision. He finally\nstays with his initial choice of dismissing the advocate.\n8THESUPREMEORDEAL\nIn this case, the approach to the inmost cave is not\nspatial but physiological. The hero is gradually\ntransformed from an obedient clerk into a raged and angry\nrebel. He refuses to be seduced by the attractive women\nas his paranoia renders him incapable of responding. He\napproaches the point of rejecting all the other\ncharacters, as they are all part of the repressing\nestablished system.\nTOTHEINMOST\nJoseph K moves from one surrealistic encounter to\nanother, with his uncle, his advocate, the advocate's\nnurse, the courtroom guard's wife, the courtroom guard\nhimself, his cousin, another defendants - each one of\nthem giving him some piece of advice but ignoring his\nfrantic efforts to prove his innocence and assert his\ndignity as a human being.\n6TESTSALLIESANDENEMIES\nCINEMATICSTORYTELLING\nTHEORY\nARTIFACT\nAPPROACH\nCAVE\n\nMAS845\nASSIGNMENT01\nAND\nHis reward for surviving the advocate's psychological\npressure is the hint from the advocate's nurse that the\nartist can help him. However, this reward is only\ntemporary. He soon realizes that the uncomfortable and\nconstantly under surveillance room of the artist cannot\noffer him any answers.\n9REWARD\nThe hero meets the priest and the advocate for one last\ntime. They are both trying to persuade him to go along\nwith the system. The God and the Law want to tame this\nunconventional member of the society and bring back the\nbureaucratic totalitarian order. Joseph K escapes\nmentally as well as physically from their trap.\n11RESURRECTION\nAfter the meeting with the artist, Joseph K is engaged in\na surrealistic chase by lunatic agents of the state.\nNevertheless, unlike Vogler's analysis, he is not heading\ntowards his ordinary world. He is still trying to cope\npsychologically with the paranoia that surrounds him.\n10THEROAD\nCINEMATICSTORYTELLING\nTHEORY\nARTIFACT\nBACK\n\nMAS845\nASSIGNMENT01\nAND\nIn our case, the elixir is death. The physical death of\nthe hero leads to his mental and psychological liberation\nfrom the power of the government and all its agents. He\nknows that this is his choice and that he fought hard in\norder to acquire this freedom. This is his final reward.\nIt may look sad in comparison with other stories but\nafter watching the hero being the only sane in an insane\nworld for the entire movie, it is really a liberating and\ncathartic ending.\n12RETURNWITHTHEELIXIR\nCINEMATICSTORYTELLING\nTHEORY\nARTIFACT\nPANAGIOTISCHATZITSAKYRIS"
    },
    {
      "category": "Resource",
      "title": "1lee.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/mas-845-special-topics-in-cinematic-storytelling-spring-2004/0507fef4ae0bae19f97f9dcf8385a69b_1lee.pdf",
      "content": "Hyun-Yeul Lee\nMAS 845 - Assignment One\n\nSome information drawn from my personal life:\n1. I have two older sisters.\n2. My sister shaved one of my eyebrows off to see how a razor worked.\n3. My sister poured water in my bed while I was sleeping.\n4. I give my sister candy wrappers.\n5. I moved to different geographical locations every 2.5 - 3 years.\n\nMy Story: My Relationship with Chocolate\n\nChocolate is at its best when I savor the silky texture as it melts in my mouth; the texture and overall\ntaste of chocolate is simple yet complex. The problem is that once I start exploring other chocolates\nthan the ones I eat, some turn out to be good but some turn out to be just bad in taste. Regardless of\nhow a chocolate might taste, I have always loved chocolate. It is only my yearning for some more\nthat makes me realize my eagerness to get some more chocolate and that there is a moment of\nsadness when I notice that it was the last piece in the box.\n\nMoving every 2.5 to 3 years to an entirely different country was an interesting life experience. Every\ntime we moved, I faced a new culture, new people, and a new environment. When we moved to a\nnew place, it was this beginning period where it was quite apparent that our family was able to rely\non each other. My two sisters were much older than me but they were good friends only being a year\napart in age; in time as they met new friends on the block, I was pretty much on my own. However,\ntime-to-time my sisters enjoyed torturing and experimenting on me. My second sister in particular\nwas not shy with me. She decided one day to see how a razor worked. She tells me today this is\nbecause she used to see our father shave and was curious to see how it worked. So one day, she sat\nme down in the bathroom and shaved off one of my eyebrows. When she used to dislike me for no\nreason, she would pour water on my bed and tell my parents that I peed. In the end, it was my sister\nwho got in trouble for all her efforts! I seemed to have been fond of her anyway, because I remember\ntagging along anywhere or to anything she did. To this day my fondness towards her continues\nbecause I still give her the chocolate candy wrapper for her to put in the bin."
    },
    {
      "category": "Resource",
      "title": "1liapi.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/mas-845-special-topics-in-cinematic-storytelling-spring-2004/4c5097d258270c1e3662fcaa6be5e950_1liapi.pdf",
      "content": "Assignment 01\nby Marianthi Liapi\nMOVIE: Shrek [2001]\nREADING:\nriter\nour\nucture\nfor Story\nters [1992]\nChri\n*\nExercise 2\nDirected by Andrew Adamson and Vicky Jenson\nThe W\n's J\nney: Mythic Str\ntellers and Screenwri\nWritten by\nstopher Vogler\nSPRING 200 4\n\nSHREK_02\n\"Shrek\" is a story about society, relationships and\nself-esteem. It is a classic tale; a genuine myth, involving fantastic\ncreatures [special people that make society feel uncomfortable]\nleading them to Shrek's habitat. The dipole identified here is the fact\nthat Shrek deals with his insecurity by defending, while Farquaad by\natures in epic quests. But regardless of any visual representation,\nattacking.\ncre\nTHE CALL TO ADVENTURE\nTHE ORDIN A RY WORL D\nCROSSIN G THE FIR S T THRESHOL D\nTHE MENT OR\nREFUSAL OF THE CALL\nthe true meaning of the movie is that all personalities are repressed\nand restricted in their actions by fear, insecurity and social pressure,\nfacts that indubitably lead to unhappy, oppressed lives. Freedom can\nAll the aspects around the invasion of the banished creatures\ninto Shrek's world constitute his call to adventure. The arrival of the\nexiles is of a cataclysmic impact into his life. The solitary comfort of\nhis world is disturbed. All efforts to intimidate them fail. He must\nreact. Even though he usually prefers to ignore events in his\neveryday life, his harmonious living is now disrupted by\nevents/actions that are above him.\nbe unleashed only from the inner-self in order to flow into the journey\nof life.\nThe plot takes place into a fantastic realm where humans,\nanimals, ogres and other beings co-exist, all bearing human-like\nattributes [ability to speak, ability to feel]. The story begins with a\ndescription of the hero's [Shrek] natural habitat and his everyday\nA prelude of what is about to come is the meeting with the\nactivities. Shrek is a strong, capable, smart and decisive ogre, with\nfuture friend/mentor Donkey. Shrek by being isolated and on guard\nmany skills. Despite that, he is presented insecure because of his\ndoes not recognize the signs and he disregards the friendship attack\nof the Donkey. He considers the Donkey as a nuisance [despite the\nfact that he is showing emotional intelligence]. The Donkey is neither\nwise nor impressive. It is an unorthodox mentor. It is trying to bring\ndown Shrek's defenses that drive his life. It is trying to open Shrek's\nheart to the issues of love and understanding, to unveil his \"layers\".\nl appearance. This fact stands as a comment on the\npersona\nsuperficiality that renders the society unable to look deep into one's\nsoul. Shrek feels rejected and thus he is led to establish a living\nenvironment in isolation. Moreover, he is presented to have anti-\nheroic feelings which are signified as he is shown to ridicule and\nlaugh at the heroic stories of humans.\nIts motto is simple yet precious: everybody must be accepted as\nhe/she is; the real beauty is within. The only creature, though, that is\nSociety regards Shrek as a misfit, a danger, a mistake and\noffering magnanimously its help is not initially welcomed by Shrek.\nthere is a mass-mobilization to eliminate him. This hostile\npredisposition that is revealed at the beginning of the story implies\nrecurrence over periods of time. Furthermore, it manifests the fear of\nWith the acceptance of the Donkey as a companion, later on,\nand the formation of an adventuring party, the story crosses a clear\nfirst threshold. The party is unaware of the plans that Farquaad has\nwhile entering the plots of the devious ruler who seeks only social\nsuccess [thus acceptance]. Shrek is about to confront a test. He will\nenter it unwillingly but he will get it through while entering the road to\nhis supreme ordeal.\nle towards the different and the unknown. Shrek,\ncommon peop\nthough, always wins his adversaries and thus making the chasm\nbigger.\nThis xenophobic society is governed by a ruthless,\nperfectionist and ambitious monarch [Farquaad], who is also\nascribed with the characteristic of insecurity due to physical\nThe rising tension will end with an agreement between Shrek\nappearance [short height]. The impact of insecurity in this case is\nand Farquaad that suits them both. [At this moment they will both do\naggressive behavior. He forces away from his land all the magic\nanything to complete their plan: Shrek wants his privacy back at any\n\nSHREK_03\ncost, while Farquaad's plan is to ascend to kinghood by marrying a\nbackground, it reveals an essential story of incomplete love and\nPrincess. The only Princess \"available\" is Princess Fiona, who is\nsuppressed feelings between two incompatible elements.\nunder a state of captivity in a castle guarded by a dragon. Farquaad's\nplan to achieve greatness through others, through threat and\nUnder the pressure of the threat of physical life and death\nAPPROACH TO THE IN MOS T CA V E\nTES T S , ALL I ES AND EN EMIE S\nmanipulation, is working perfectly well and Shrek becomes his\nunwilling pawn. Shrek's strong emotions lead him to an adventure of\ngreat challenge and great peril - to rescue Princess Fiona from a\ndragon's lair and escort her back to Farquaad.\nTHE R O AD BACK\nREWARD\nTHE SU PRE M E ORDEA L\nthere is a definite clarification of properties. Fiona's need for\nromance, developed over the ages of imprisonment, is decapitated.\nBattle action and the instinct for survival take the premium role.\nRomance though, a form of struggle between the inner worlds of the\ncharacters, is the leading element of the movie. It appears as action\nThis is the moment where he is confronting his true rival; he\nscenes are degrading through humorous events.\nhas passed the test of the enemy and move forth to the most\nexhausting test of his allies. The slow invasion of the Donkey in his\npsyche is more difficult than the physical test of battle. He is neither\nwilling to open his heart to his mentor nor to himself. The feeling of\nincompleteness though is making him less defensive and the Donkey\nseems to unlock many sides of Shrek's inner self.\nThe importance of the inner struggle is emphasized through\nthe events at the supreme ordeal. Even if there was a constant threat\nof death in action, there is a prevailing feeling that an obvious threat\ncan be easily dealt with when one is able to control fear and be\ndecisive and clever. The accomplishment of such a task - the\nsuccessful ending of the supreme ordeal and the acquirement of the\nRegardless of the event that Shrek seems to be annoyed by\nthe Donkey, it is obvious that they have hardened their relationship\nand friendship. This is evident when they approach and see for the\nfirst time the dragon's lair. The Donkey, who shows its emotions\nreward [the rescue of Fiona] - is followed by relief, enjoyment and the\nrevelation of the true problem. Intense feelings from Fiona's\nshattered dreams and feelings of insecurity for Shrek's true identity\nare about to evolve and finally clash on the road back to the ordinary\nopenly, is horrified. It overcomes its fear though with the help of\nworld.\nShrek. Inside the castle the echoes of the approaching supreme\nordeal become evident.\nThere is an accelerating action that leads to a climactic\ntension, pausing only at moments of importance to add emphasis;\nAfter the initial shock, the road back is full of events and\ninteraction between the two main characters that signifies the\nbenefits of opening up, revealing feelings/emotions and looking\nbeyond appearances; breakfast by Fiona, the battle with Robin Hood\nthe dragon's appearance, Shrek's entrance to Fiona's room, the\nDonkey facing perish in front of the Dragon. It's the moment at the\nhalf of the battle when thrill is intense. Shrek found the Princess but\nthey are not safe yet and the Donkey is captured by the Dragon. In\nthese great moments all the skills and abilities must be used in order\ngang, the joyful day in the country with the ballooning of a toad and a\nsnake are the step by step procedures of a fruitful flirt. It is evident\nthat in a closed situation [without external/social elements] with good\n\"vibes\", everything seems to move to the right direction.\nto stay alive and complete the task. Shrek is employing his combat\nThis is the true \"battle\" - to win a girl's heart and at the same\nand intelligence skills to elude and escape an overwhelming enemy.\nThe Donkey is using its wit and its open heart to approach the\nfeelings of a dreadful enemy. Although the Donkey's act works as a\ntime be released from one's own haunting demons. The tension rises\nduring the night before the task is called to an end. The confrontation\nwith the hero's feelings seems greater than the battle with ten\n\nSHREK_04\ndragons. To add to this tension, hidden truths and strong fears stand\nas huge obstacles. The interference of the mentor is for the purpose\nof overcoming them; instead it leads to climactic misunderstandings\nand eventually to the worst possible end - the \"death\" of feelings.\nEverything gained until this moment is lost in a turmoil of fears while\ndefenses come up and walls arise fast and tall. Farquaad and his\nplans remained absent and forgotten during the past period of the\nsupreme ordeal and the road back. It was a time of freedom from\nexternal influences, such as social pressure and time, for them to\ncalm their souls. The arrival near these influences is one major factor\nof tension.\ntransform/release a person to its true form [self]. All the joined forces\nfrom the adventure [including the dragon] are to fight for this great\ncause.\nThe tension remains high while a verbal \"battle\" begins. The\nend of it finds Farquaad defeated. Farquaad remains as he was,\nsince he did not enter an adventure and a life-death process that\nupgraded the key characters to a higher level. The peak of the whole\nadventure comes with the transformation of Fiona to a female Ogre -\na true form revealed by a true love's kiss. The apocalypse of Fiona's\ntrue identity is showing that everybody should see each other with\nTHE EL IX IR\nRESURRECTION\nThe tranquility after the storm and the apparent fatal clash\nbetween Shrek-Fiona and Shrek-Donkey is the time period for\nthe eyes of the heart and therefore all creatures all equal. There are\nno differences in the heart. Difference exists only into minds. The\nstrong sentiment of love and the fall of a monarch that created a\nxenophobic society fueling the insecurities of people, lead to a\ncheering crowd that is freed from prejudice.\nThe feeling of love that knows no boundaries and frees\npeople is the elixir that Shrek and Fiona gained through their\nadventure. This elixir is distributed to everyone because the final\nconfrontation took place in front of a large audience and the two\ncharacters invite everybody to celebrate with them. It is the\nemergence/transformation of their lands to a happy and free place\nwhere everyone is equal to enjoy life. The closure of the movie\nmakes this point evident and clear. Everyone is opened up and sings\nand dance songs that are revealing his psyche in a big scale\ncelebration.\nThe message of this movie is a lesson to society to be\nhonest and caring. To let love and feelings identify characters in\ndepth, where the eyes can not see. Choices are not to made based\nonly on the commands of the retina. This strong message is cleverly\ntransmitted through a \"classic\" heroic tale with the vividness and the\ncolor of an animation movie.\nreflection of the past events. The emotionally-dead Shrek returns to\nhis empty habitat realizing suddenly the horror of loneliness. Fiona\nfaces the fear of a bad decision and a lost life. The Donkey is\nunhappy considering that some bridges can not be made possible.\nThis period is the prelude to resurrection. All the key characters,\nbeing richer from the experience gained from their adventure, are\nbeginning to see inner truths. They have matured. Shrek is\nsusceptible to its furious mentor's teachings and the intense moment\nof resurrection comes. The key to overcome this situation is\nDonkey's paradox flirt with the dragon. The brave move done firstly\nby the mentor/donkey is signifying that visual differences are not a\nreason of keeping distance and avoid following your heart. This\nknowledge is passed on to the hero with the ferocity of a fight.\nThe re-established unity of Shrek-Donkey [hero-mentor] is\nthe apocalyptic event of truth bright like the sun. Selfishness, pride,\nego and fear are surpassed with self-awareness and risen self-\nesteem leading to personal freedom. The need for companionship is\nnow obvious and \"hungry\". To maintain the avalanche of this event, a\nrace against time begins, caused by the actions of a \"foul\" self. The\nreal battle and the real prize are ahead. The elixir is the completed\nlove between Shrek and Fiona. It is the love that would"
    },
    {
      "category": "Resource",
      "title": "assn2temp.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/mas-845-special-topics-in-cinematic-storytelling-spring-2004/009fed0df64ab6f22f316d083f283f7c_assn2temp.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "3bodle.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/mas-845-special-topics-in-cinematic-storytelling-spring-2004/09032e0a665c5c1e5254ff91a488db4e_3bodle.pdf",
      "content": "Carrie Bodle\nVideo Story Engine\nAssignment 3\nMAS.845\nLately I have an obsession: my video enabled cellular phone.\nThis newest gadgetry allows me to conspicuously take 15 sec.\nvideos with limited audio and video quality anywhere/anytime.\nCollecting a massive amount of these video \"sketches\" I\nwould like to organize them into a video diary:\nI would like for this video diary to represent sketches of my\neveryday...the viewer becomes a voyeur into a sound/video\nrepresentation of my world and happenings. Creating a 3x3\nthumbnail grid the voyeur can choose from the 9 videos that\nare playing simultaneously. After choosing one video the\nviewer returns to the \"main menu\" of the 3x3 video grid.\nTo further complicate the viewer's s choice of videos and interest\nin material, the videos will constantly be changing--the 9\nvideo choices will be continuously different. The viewer\nwill be able to navigate through multiple video variations\nbefore engaging with the entire video diary."
    },
    {
      "category": "Resource",
      "title": "3gerts.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/mas-845-special-topics-in-cinematic-storytelling-spring-2004/dca0e997fd5e47139672cd2b845e80c1_3gerts.pdf",
      "content": "Dan Gertsacov\n04/01/04\nMAS 845, Assignment 3\nTitle:\n\"The Food Chain\"\nFormat:\nFilmed in Hi-8, edited on to VHS\nKey Questions:\nHow do I want an audience to be able to explore this story?\no My first reaction is that the audience should explore the story linearly, as\na cycle of life plays itself out - from beginning to end to beginning again.\nFrom the fish in its natural state, on to its selection and preparation, on to\nits eventual place as consumption in the food chain and then back again.\nAs I try to think through how this might be altered to allow for different\nvariations of story exploration, I had the thought of whether the scenes\ncan be shot and algorithm put together so that the dead fish has memory\nor the live fish has visions of the future, ie if the first shot chosen is the\nsushi preparation, then the second shot chosen is the fish swimming\naround (opposite of the traditional linear sequence), the system would call\nup an intermittent shot that implies the fish is thinking backwards or even\nforwards, if the case is that some steps are skipped (ie going from fish\nswimming to the happy consumer eating the fish.) I started playing\naround with the algorithm and inserting shots (albeit, in silent movie\n\"Charlie Chaplin\" style given my limited film/editing skills and\nexperience) that would allow for such a sequence to occur, at the\naudience's discretion.\nWhat are the criteria for content ordering?\no I have number the scenes 1 - 6, as they would happen in a linear\nsequence. Thus, if 1 is chosen, 1 leads to 2 to 3, etc. However, if 2 is\nchosen, an intermittent shot is displayed (depending on the sequence),\nthen going back to 1, then a repeat of the initial shot (3), then in the\ngeneral order on to 3, 4, etc.\nWhat are the properties of the content that the system knows about?\no\nThere are three primary properties the system would know about:\n1. Scene number (1 - 6)\n2. Primary focus (Fish or Sushi Chef or Sushi Eater)\n3. Mortal state (alive or dead)\nHow is the story constructed?\no As I stated, the idea is that the system forces the story back into a linear\nstate, starting from the beginning and continuing through to the end.\nWithout it, there is no context - just seeing a sushi eater die from eating\nsomething and then go on to the feeding of fish does not make much sense,\nbut it does make sense if you've already seen the fish swimming around,\nthen being prepared as sushi, etc.\n\nDan Gertsacov\n04/01/04\nMAS 845, Assignment 3\nHow can the system and the audience make decisions about what to show or see\nnext?\no The Audience decision is where to start the sequence, so there would be a\nhome page with a still of each shot that the viewer can choose (either\nthrough remote control or pressing on the screen [in an ideal world]).\nBeyond that, the system would take over, based on the algorithm provided\nand using the intermittent shots (backward or forward) to provide context.\nHow would I describe my proposed system in detail to the class?\no What I'm trying to do is portray my story about the food chain as a\ncircular model of life and death, using sushi as an example. From when a\nfish is swimming around in a fish tank, until it is prepared and sliced as\nsushi until it is eaten and (possibly) poisons the consumer and then the\nconsumer becomes fish food for other swimming fish, the cycle of life is\ncompleted or basically, starts afresh. However, as the audience can\nchoose where on this sequence to begin, the system will use what I'm\ncalling \"intermittent shots\" to provide context, so that if the sequence\nbegins with the fish being sliced, the system will insert a shot (in this case,\n\"the fish remembers\"), then insert the first sequence of the fish swimming\naround, starting the cycle from there. This will be true for any of the main\nfrozen shots the audience chooses as the beginning.\nHow would I define a clear map for future implementation?\no Beyond probably re-shooting and re-editing the shots for a better quality\nviewing experience (I'm a total novice - my first time using a camera, an\noutdated one at that), I would need to digitize each shot in order to both\nimplement the algorithm and to have a frozen shot from the beginning.\nThe \"home page\" (the first thing the viewer sees) would have the frozen\nshots in a circle or clockwise formation - so that it might be natural to\nchoose the first scene at the top (or 12:00 position), with scene two at 2\npm and so on. The screen would be interactive, allowing the viewer to\nchoose where to start the story. The intermittent shots would not be\nincluded in this initial menu, as they are used by the system to provide\ncontext. These intermittent shots could also be re-shot, so that instead of\nwords portraying the context, you could have squiggly lines portray a\ndream sequence. Sound would also be a key addition, choosing\nappropriate sounds or music to be included with each shot and reinforce\nthe context.\nHow would I discuss story representation and construction issues and solutions\nthat arose during my work?\no The use of an algorithm really threw me off initially, as I had initially\nconstructed my story as a linear representation, with a specific start and\nend. As I started to think through how it would be different if the audience\ncould choose where to begin, I realized that the context of my story was\nthe thing that was most missing, thus the creation of these intermittent\n\nDan Gertsacov\n04/01/04\nMAS 845, Assignment 3\nshots that the algorithm could use to force a linear story. Not an elegant\nsolution admittedly, but I think it works in most of the shots. I would also\nwant to improve the software I used (or lack thereof) for editing, as the\ntraditional way looked sloppy but I could not improve upon it. I feared\nthat not all logarithmic solutions made sense, so I might want to re-shoot\nand re-edit so that these are more seamless.\nScene Sequence and Labeling:\nScene 1: Swimming fish in a tank\no\n1, fish, alive\nScene 2: The sushi chef getting his \"station ready\", shots of sushi/dead fish\no\n2, fish, dead\nScene 3: The sushi chef making sushi\no\n3, sushi chef, dead\nScene 4: The sushi eater consuming the sushi\no\n4, sushi eater, alive\nScene 5: The sushi eater poisoned by the bad sushi\no\n5, sushi eater, dead\nScene 6: The sushi eater being fed to the swimming fish in a tank\no\n6, fish, alive\nIntermittent Scene 7: \"The Fish Remembers\"\nIntermittent Scene 8: \"The Fish Imagines the Future\"\nIntermittent Scene 9: \"The Man Remembers\"\nIntermittent Scene 10: \"The Man Imagines the Future\"\nIntermittent Scene 11: \"The End/Thank You\"\nAlgorithm System:\n-\nif scene 1 is chosen, find and insert scenes 2-6, then 1, then 11\n-\nif scene 2 is chosen, find and insert Scene 7, then insert scenes 1 - 6, then 1 then 11\n-\nif scene 3 is chosen, find and insert Scene 9, then insert scenes 1 - 6, then 1 then 11\n-\nif scene 4 is chosen, find and insert Scene 10, then insert scenes 5, then 1 - 6, then 1\nthen 11\n-\nif scene 5 is chosen, find and insert Scene 9, then insert scenes 1 - 6, then 1 then 11\n-\nif scene 6 is chosen, find and insert Scene 8, then insert scenes 5, 1 - 6, then 1 then 11"
    },
    {
      "category": "Resource",
      "title": "readings.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/mas-845-special-topics-in-cinematic-storytelling-spring-2004/729f8a3e34709d46f39bc3e354c36b9f_readings.pdf",
      "content": "Books\nAristotle. Poetics. Translated by Leon Golden. Englewood-Cliffs: Prentice-Hill, 1968.\nBachelard, G. The Poetics of Space. Translated by Maria Jolas. New York: The Orion\nPress, 1994.\nBailey, D. Improvisation: Its Nature and Practice in Music. US: Da Capo Press, 1993.\nBal, M. Narratology. Toronto/Buffalo/London: University of Toronto Press Inc, 1997.\nBarrett, E., and M. Redmond. Contextual Media: Multimedia and Interpretation.\nCambridge, MA: MIT Press, 1995.\nBarnouw, E. Documentary: A History of the Non-Fiction Film. New York: Oxford\nUniversity Press, 1993.\nBarsam, R. Nonfiction Film, Theory and Criticism. New York: Dutton, 1976.\nBarthes, R. Image, Music, Text. Translated by Stephen Heath. London: Fontana Press,\n1977.\nBlood, R. We've Got Blog: How Weblogs are Changing Our Culture. New York: Perseus\nPublishing, 2002.\nBonnet, J. Stealing Fire from the Gods. Michael Wiese Productions, 1999.\nBranigan, E. Narrative Comprehension and Film. London: Routledge, 1992.\nBrackage, S. Essential Brackage: Selected Writings on Filmmaking by Stan Brackage.\nNew York: McPherson and Company, 2001.\nBringsjord, S., and D. Ferrucci. Artificial Intelligence and Literary Creativity: Inside the\nMind of Brutus. Mahwah/London: Lawrence Erlbaum, 2000.\nBrooks, P. Reading for the Plot: Design and Intention in Narrative. New York:\nVintage/Random House, 1984.\nBruner, J. Acts of Meaning. Cambridge, MA/London: Harvard University Press, 1990.\n------. Actual Minds, Possible Worlds. Cambridge, MA/London: Harvard University\nPress, 1986.\nBurch, N. Theory of Film Practice. Princeton, NJ: Princeton University Press, 1981.\nBurnham, J. The Structure of Art. New York: G. Braziller, 1973.\n\nCage, J. Silence; Lectures and Writings. Cambridge: The MIT Press, 1966.\nCampbell, J. The Hero with a Thousand Faces. 1973 reprint of 2nd ed. Princeton:\nPrinceton University Press, 1968.\nChandler, Alfred D. Inventing the Electronic Century: The Epic Story of the Consumer\nElectronics and Computer Industries. New York: Free Press, 2001.\nChatman, S. Coming to Terms: The Rhetoric of Narrative in Fiction and Film.\nIthaca/London: Cornell University Press, 1990.\nChion, M. Audio-vision: Sound on Screen. Translated by Claudia Gorbman. New York:\nColumbia University Press, 1994.\nField, S. Screenplay: The Foundations of Screenwriting. Expanded version. New York:\nDell, 1994.\nFrost, A., and R. Yarrow. Improvisation in Drama. New York: St. Martin's Press, 1990.\nGenette, G. Narrative Discourse Revisited. Translated by Jane E. Lewin. Ithaka: Cornell\nUniversity Press, 1988.\n------. Narrative Discourse: An Essay in Method. Translated by Jane E. Levin. Ithaca:\nCornell University Press, 1980.\nClifford, G. The Interpretation of Cultures. USA: BasicBooks, A Division of\nHarperCollins Publishers, 1973.\n------. Local Knowledge. USA: BasicBooks, A Division of HarperCollins Publishers,\n1983.\nEisenstein, S. Film Form: Essays in Film Theory. New York: Harcourt, Brace, 1949.\nHanhardt, J. G. Nam June Paik. New York: Whitney Museum of American Art in\nassociation with W.W. Norton, 1982.\nHeble, A. Landing on the Wrong Note: Jazz, Dissonance, and Critical Practice. New\nYork: Routledge, 2000.\nGorbman, C. Unheard Melodies: Narrative Film Music. London: bfi Publ., 1987.\nHerman, D. Story Logic: Problems and Possibilities of Narrative. Frontiers of Narrative\nSeries. Lincoln/London: University of Nebraska Press, 2002.\nHillier, B. Space Is the Machine: A Configurational Theory of Architecture.\nCambridge/Melbourne/New York: Cambridge University Press, 1996.\n\nHillis, K. Digital Sensations: Space, Identity and Embodiment in Virtual Reality. Vol. 1,\nElectronic Mediations. Minneapolis/London: University of Minnesota Press, 1999.\nHockings, P. Principles of Visual Anthropology. The Hague, Netherlands: Mouton\nPublishers, 1975.\nHofstadter, D. R. Godel, Escher, Bach: An Eternal Golden Braid. New York: Vintage\nBooks, 1979.\nJohnstone, K. Impro for Storytellers: Theatresports and the Art of Making Things\nHappen. London: Faber and Faber, 1999.\n------. Impro: Improvisation and the Theatre. London: Methuen Publ., 1989.\nKearney, R. On Story. Thinking in Action Series. New York: Routledge, 2001.\nLakoff, G. \"Structural Complexity in Fairy Tales.\" In The Study of Man. Vol. 1. 1972, pp.\n128-150.\nLaurel, B. Computers as Theatre. 2nd ed. Reading: Addison-Wesley Publ., 1993.\nLevy, P. Collective Intelligence: Mankind's Emerging World in Cyberspace. Translated\nby Robert Bononno. New York and London: Plenum Press, 1997.\nLevi-Strauss, C. Structural Anthropology. Vol. 1, and 2. New York: Penguin, 1968.\nLipman, D. Improving Your Storytelling: Beyond the Basics for All Who Tell Stories in\nWork or Play. Little Rock: August House, 1999.\nLothe, J. Narrative in Fiction and Film: An Introduction. Oxford: Oxford University\nPress, 2000.\nLowe, R. Improvisation, Inc.: Harnessing Spontaneity to Engage People and Groups.\nSan Francisco: Jossey-Bass/Pfeiffer, 2000.\nMacdonald, K. Imagining Reality: The Faber Book of the Documentary. London, Boston:\nFaber and Faber, 1996.\nMacorelles, L. Living Cinema: New Directions in Contemporary Filmmaking. New York:\nPraeger, 1973.\nManovich, L. The Language of New Media. Cambridge, MA/London: MIT Press, 2001.\nLevin, R. Documentary Explorations: 15 Interviews with Film-makers. Garden City:\nDoubleday, 1971.\n\nMarshall, J. \"Filming and Learning.\" In The Cinema of John Marshall. Edited by J.\nRuby. Berkshire: Harwood Academic Press, 1993, pp. 1-21.\nMartin, W. Recent Theories of Narrative. Ithaca, NY: Cornell University Press, 1986.\nMcCloud, S. Understanding Comics. New York: HarperCollins Publishers, 1994.\nMay, R. The Courage to Create. New York: W.W. Norton & Company, 1976.\nMcAdams, S. \"Music: A Science of the Mind.\" In Contemporary Music Review. Edited\nby S. Mac Adams. London: Gordon & Breach, 1987.\nMcKee, R. Story: Substance, Structure, Style and the Principles of Screenwriting.\nLondon: Methuen Publ., 1998.\nMcLaughlin, T. Street Smarts and Critical Theory: Listening to the Vernacular. Madison,\nWis.: University of Wisconsin Press, 1996.\nMcLuhan, M. Understanding Media: The Extension of Man. 1997 reprint, New York:\nMcGraw-Hill, 1987.\nMinsky, M. Society of Mind. Simon & Schuster, 1988.\n------. The Emotion Machine. (To appear)\nPearson, C. S. The Hero Within - Six Archetypes We Live By. 2nd ed. New York:\nHarperCollins Publishers, 1989.\nPhilips, M. A., and C. Huntley. Dramatica, a New Theory of Story. 4th ed. Screenplay\nSystems, 2001.\nMulller, Erik T. \"Story Understanding.\" In Encyclopedia of Cognitive Science. Edited by\nLynn Nadel. London: Nature Publishing Group, 2002.\nMurray, J. Hamlet on the Holodeck: The Future of Narrative in Cyberspace. Cambridge,\nMA: MIT Press, 1997.\nNash, C. \"Narrative and Fact.\" In Narrative in Culture: The Uses of Storytelling in the\nSciences, Philosophy and Literature. New York: Routledge, 1990.\nNussbaum, Martha C. Love's Knowledge: Essays on Philosophy and Literature. New\nYork: Oxford University Press, 1990.\nPacker, R., and K. Jordan, eds. Multimedia: From Wagner to Virtual Reality. US: W.W.\nNorton & Company, 2001.\n\nPopper, F. Art of the Electronic Age. London: Thames and Hudson, 1993.\nPropp, V. Morphology of the Folktale. 2nd ed. Translated by Laurence Scott, and edited\nby Louis A. Wagner. University of Texas Press. Republished: Austin/London: University\nof Texas Press, (1968, 1969).\nRieser, M., and A. Zapp, eds. The New Screen Media: Cinema/Art/Narrative. London:\nBritish Film Institute, 2002.\nRoemer, M. Telling Stories. Maryland: Rowman & Littlefield Publishers Inc., 1995.\nRicoeur, P. Time and Narrative. 3 vols. Chicago: University of Chicago Press, 1984.\n------. \"Life in Quest of Narrative.\" In On Paul Ricoeur: Narrative and Interpretation.\nEdited by D. Wood. London: Routledge, 1991.\n------. Narrative Identity, Oneself as Another. Chicago: University of Chicago Press,\n1992.\n------. \"The Memory of Suffering.\" In Figuring the Sacred: Religion, Narrative and\nImagination. Minneapolis: Fortress Press, 1995.\nRowe, R. Interactive Music Systems: Machine Listening and Composing. Cambridge,\nMass.: MIT Press, 1993.\nRyan, M. L. Narrative as Virtual Reality: Immersion and Interactivity in Literature and\nElectronic Media. Parallax: Re-Visions of Culture and Society, Baltimore/London: The\nJohn Hopkins University Press, 2001.\n------. Possible Worlds: Artificial Intelligence and Narrative Theory. Bloomington:\nIndiana University Press, 1991.\nSalen, K., and E. Zimmerman. Rules of Play: Game Design Fundamentals. Cambridge,\nMa: MIT Press, 2003.\nSchank, R., and R. Abelson. Scripts, Plans, Goals, and Understanding. Hillsdale, NJ:\nEarlbaum Assoc., 1977.\nSchank, R. Explanation Patterns: Understanding Mechanically and Creatively. Hillsdale,\nNJ: Lawrence Erlbaum Associates Publisher, 1986.\n------. Dynamic Memory Revisited. 2nd ed. Cambridge University Press, 1999.\nScholes, R., and R. Kellogg. The Nature of Narrative. New York: Oxford University\nPress, 1966.\n\nSchon, D. Educating the Reflective Practitioner. Presentation to the American\nEducational Research Association in Washington, DC, 1987.\nSitney, P. A. Visionary Film: The American Avant-Garde. New York: Oxford University\nPress, 1974.\n------, ed. \"Autobiography in Avant-Garde Film.\" In The Avant-Garde Film: A Reader\nof Theory and Criticism. New York: New York University Press, 1978.\nShaw, J., and P. Weibel, eds. Future Cinema: The Cinematic Imaginary after Film. ZKM\ncenter for Art and Media, Karlsruhe. Cambridge, Ma: MIT Press, 2003.\nSherman, S. Documenting Ourselves: Film, Video and Culture. Lexington: University\nPress of Kentucky, 1998.\nSmith, H., and R. Dean. Improvisation, Hypermedia and the Arts Since 1945.\nAmsterdam, The Netherland: Harwood Academic Publishers, 1997.\nStanzel, F. K. A Theory of Narrative. Cambridge: Cambridge University Press, 1984.\nStooss, T., and T. Kellein, eds. Nam June Paik: Video Time, Video Space. New York: H.\nN. Abrams, 1993.\nRumelhart, D. \"Notes on a Schema for Stories.\" In Representation and Understanding:\nStudies in Cognitive Science. Edited by D. Bobrow, and A. Collins, New York: Academic\nPress, 1975, pp. 211-236.\nTabor, J., ed. Otto Laske: Navigating New Musical Horizons. [Contributions to the Study\nof Music and Dance, no. 53], Westport, Conn.: Greenwood Press, 1999.\nTarkovsky, A. Sculpting in Time: Reflections on the Cinema. Texas: University of Texas\nPress, 1989.\nTaylor, C. Sources of the Self: The Making of Modern Identity. Cambridge: Harvard\nUniversity Press, 1989.\nTodorov, T. Genres in Discourse. Translated by Catherine Porter. Cambridge: Cambridge\nUniversity Press, 1990.\n------. The Poetics of Prose. Translated by Richard Howard. Oxford: Basil Blackwell,\n1977.\nTolkien, J. R. R. The Tolkien Reader. Princeton NJ: Princeton University Press, 1968.\nTurkle, S. Life on the Screen: Identity in the Age of the Internet. New York: Simon &\nSchuster, 1995.\n\nVogler, C. The Writer's Journey: Mythic Structure for Storytellers and Screenwriters.\nStudio City: Michael Wiese Productions, 1992.\nVoytilla, S. Myth and the Movies: Discovering the Mythic Structure of 50 Unforgettable\nFilms. Studio City: Michael Wiese Productions, 1999.\nWalker, Steven F. Jung and the Jungians on Myth. New York/London: Routledge, 1995.\nWilson, George M. Narration in Light: Studies in Cinematic Point of View. 1992 reprint,\nBaltimore/London: The Johns Hopkins University Press, 1988.\nConference and Journal Papers\nBarry B., and G. Davenport. \"Documenting Life: Videography and Common Sense.\" In\nProceedings of IEEE International Conference on Multimedia. Maryland, New York:\nInstitute of Electrical and Electronics Engineers, 2003.\nBers, M. U. \"Narrative Construction Kits: Who am I? Who are You? What are We?\"\nProceedings of \"Narrative Intelligence\" Fall Symposium, AAAI'99. 1999, pp. 44-51.\nCrawford, C. \"Assumptions Underlying the Erasmatron Interactive Storytelling Engine.\"\nIn Proceedings of the AAAI Fall Symposium on Narrative Intelligence. 1999.\nDavenport, G. \"Your Own Virtual Storyworld.\" Scientific American 283, no. 5\n(November 2000): 79-82.\nDavenport, G., B. Bradley, S. Agamanolis, B. Barry, and K. Brooks. \"Synergistic\nStoryscapes and Constructionist Cinematic Sharing.\" IBM Systems Journal 39, no. 3-4\n(2000): 456-469.\nDavenport, G. Very Distributed Media Stories: Presence, Time, Imagination. Euro-Par\n'98 Parallel Processing, Proceedings. Springer-Verlag, 1998, pp. 47-54.\nGuignon, C. \"Narrative Explanation in Psychotherapy.\" American Behavioral Scientist\n14, no.4 (January 1998): 558-75.\nHayes-Roth, B. \"Directed Improvisation: A New Paradigm for Computer Games.\" In\nProceedings of the Computer Game Developers' Conference. Santa Clara, California,\n1995.\nLeacock, R. \"Ethnographic Observation and the Super-8 Millimeter Camera.\" 1977.\n(Unpublished Article)\n------. \"In Defense of the Flaherty Traditions.\" 1990. (Unpublished Article)\n\nMateas, M., and A. Stern. \"Architecture, Authorial Idioms and Early Observations of the\nInteractive Drama Facade.\" In Carnegie Mellon University Computer Science Technical\nReports, CMU-CS-02-198. 2002.\nMetcalfe, R. \"The Internet after the Fad.\" Remarks of Dr. Robert Metcalfe at the\nUniversity of Virginia. 1996.\nMinsky, M. \"Music, Mind, and Meaning.\" Computer Music Journal 5, no. 3 (1981): 28-\n44. MIT Press, Cambridge, Mass.\nMueller, Erik T. \"Story Understanding through Multi-representation Model\nConstruction.\" In Text Meaning: Proceedings of the HLT-NAACL 2003 Workshop.\nEdited by Graeme Hirst, and Sergei Nirenburg. East Stroudsburg, PA: Association for\nComputational Linguistics, 2003, pp. 46-53.\nNegroponte, N. The Impact of Optical Videodiscs on Filmmaking. 1979. (Unpublished\nPaper)\nOlson, S. R. Modes of Reception in World Media Markets. Hollywood Planet: Global\nMedia and the Competitive Advantage of Narrative Transparency. NJ: Erlbaum, 1999.\nPuckette, M. \"Combining Event and Signal Processing in the MAX Graphical\nProgramming Environment.\" Computer Music Journal 15, no. 3 (Fall 1991): 68-77.\nReed, David P. \"That Sneaky Exponential - Beyond Metcalfe's Law to the Power of\nCommunity Building.\" Context, 1999.\nRuby, J. \"The Image Mirrored: Reflexivity and the Documentary Film.\" Journal of the\nUniversity Film Association 29, no. 4 (1977).\nSchank, Roger C., and Robert P. Abelson. \"Knowledge and Memory: The Real Story.\" In\nAdvances in Social Cognition. Vol. 3. New Jersey: Lawrence Erlbaum Associates, 1995.\nSingh, P. \"Examining the Society of Mind.\" To appear in the journal Computing and\nInformatics (2004).\nSingh, P., and B. Barry. \"Collecting Common Sense Experiences.\" In the Proceedings of\nthe Second International Conference on Knowledge Capture (K-CAP 2003). Florida,\nUSA, 2003.\nStrohecker, C., K. Brooks, and L. Friedlander. \"Tired of Giving in: An Experiment in\nNarrative Unfolding.\" Available as Technical Report 99-16. Cambridge, MA: MERL - A\nMitsubishi Electric Research Laboratory.\nTames, D., and P. Apley. \"An Evening with David Reed: Bits are not Bites! Balkanizing\nSpectrum Creates Scarcity.\" Meeting Notes: MIT Wireless Forum, 2002.\n\nTheses\nBers, M. U. \"Identity Construction Environments: The Design of Computational Tools\nfor Exploring a Sense of Self and Moral Values.\" Ph.D. Thesis, MIT Media Laboratory,\n2001.\nBrooks, K. \"Metalinear Cinematic Narrative: Theory, Process, and Tool.\" Ph.D. Thesis,\nMIT Media Laboratory, 1999.\nGalyean, Tinsley A. \"Narrative Guidance of Interactivity.\" Ph.D. Thesis, MIT Media\nLaboratory, 1995.\nHalliday, Mark D. \"Digital Cinema: An Environment for Multi-threaded Stories.\" MS\nThesis, MIT Media Laboratory, 1993.\nMateas, M. \"Interactive Drama, Art and Artificial Intelligence.\" Ph.D. Thesis, Carnegie\nMellon University, 2002.\nMorgenroth, Lee H. \"Movies, Talkies Thinkies: An Experimental Form of Interactive\nCinema.\" MS Thesis, MIT Media Laboratory, 1992.\nMurtaugh, M. \"The Automatist Storytelling System: Putting the Editor's Knowledge in\nSoftware.\" MS Thesis, MIT Media Laboratory, 1996.\nRubin, B. \"Constraint-Based Cinematic Editing.\" MS Thesis, MIT Media Laboratory,\n1989.\nStrohecker, C. \"Electronic Collage: The Videodisc and Interactive Narrative.\" MS Thesis,\nMIT Media Laboratory, 1986.\nExemplary Materials\nLippman, Andy, et al. Aspen Movie Map. MIT Media Laboratory, 1978.\nDramatica. Screenplay Systems, 1993-2001.\nResnais, Alain. Last Year at Marienbad. 1961.\nMyst. Broderbund, 1993.\nDavenport, Glorianna, et al. New Orleans in Transition, 1983-1987. MIT Media\nLaboratory, 1987.\nKrizanc, John. Tamara. Theatre Event, First performed in 1981.\nSierra. The Colonel's Bequest. 1989.\nThe Sims. Electronic Arts Inc., 2001."
    }
  ]
}