{
  "course_name": "Statistical Thermodynamics of Complex Liquids",
  "course_description": "This course explores the theory of self-assembly in surfactant-water (micellar) and surfactant-water-oil (micro-emulsion) systems. It also introduces the theory of polymer solutions, as well as scattering techniques, light, x-ray, and neutron scattering applied to studies of the structure and dynamics of complex liquids, and modern theory of the liquid state relevant to structured (supramolecular) liquids.",
  "topics": [
    "Engineering",
    "Mechanical Engineering",
    "Fluid Mechanics",
    "Mathematics",
    "Probability and Statistics",
    "Science",
    "Physics",
    "Thermodynamics",
    "Engineering",
    "Mechanical Engineering",
    "Fluid Mechanics",
    "Mathematics",
    "Probability and Statistics",
    "Science",
    "Physics",
    "Thermodynamics"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 3 sessions / week, 1 hour / session\n\nThere is no lab component to the course.\n\nStudents are expected to spend an average of six hours a week on the course outside of class sessions.\n\nCourse Description\n\nTheory of self-assembly in surfactant-water (micellar) and surfactant-water-oil (micro-emulsion) systems. Introduction to the theory of polymer solutions. Introduction to scattering techniques, light, x-ray, and neutron scattering applied to studies of the structure and dynamics of complex liquids. Modern theory of the liquid state relevant to structured (supramolecular) liquids.\n\nInstructor\n\nProf. Sow-Hsin Chen\n\nLevel\n\nGraduate",
  "files": [
    {
      "category": "Assignment",
      "title": "Problem Set 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/22-52j-statistical-thermodynamics-of-complex-liquids-spring-2004/e8e747a80dd80bbcf92ed527935773af_52_hwi_chen_04.pdf",
      "content": "8.575J , 10.44J, 22.52J Statistical Thermodynamics of Complex Liquids\n(Spring 2004)\n\nProblem Set 1 (Prof. Chen)\n\nDue March 18.\n\n1. Given the following table for the scattering lengths of common elements:\n\nIsotope\nHydrogen\nDeuterium\nCarbon\nNitrogen\nOxygen\nbcoh (10-12 cm)\n-0.37423\n0.6674\n0.66484\n0.936\n0.5805\n\nestimate the molecular volume (from the molecular weight and density) and then calculate the scattering\nlength densities of the following molecules, in unit of1010 cm-2: H2O, D2O, Octane, Deuterated octane,\nand Pluronic P-84, a tri-block co-polymer, [(PEO)19 (PPO)43 (PEO)19], where PEO = -(CH2)2O-, having\na molecular volume 72.4 A3, and PPO = -(CH2)3O-, having a molecular volume 95.4 A3 .\n\n2. Show that the form factor of a spherical particle with an internal core of radius R1 and a scattering\nlength density (sld) ρ1, surrounded by a shell with an outer radius R2 and sld ρ2, immersed in a solvent\nof sld ρs, is given by:\n\nF2-shell(Q) = 4\n3 πR1\n3(ρ1 -ρ2) 3j1(QR1)\nQR1\n⎡\n⎣ ⎢\n⎤\n⎦ ⎥ + 4\n3 πR2\n3(ρ2 -ρs) 3j1(QR2)\nQR2\n⎡\n⎣ ⎢\n⎤\n⎦ ⎥\n\nUse this result to calculate and plot the normalized particle structure factor P (Q) of a co-polymer\nmicelle having an inner core radius R1 and an outer radius R2. In a core-shell model of the micelle [Y.C.\nLiu et al, Phys. Rev. E 54, 1698 (1996)], the inner and outer radii can be determined from the\naggregation (N) and hydration (H) numbers of the micelle. Plot the P (Q) for the case of N = 63 and H\n= 290.\n\n3. Show that the form factor of a randomly oriented prolate spheroid, with semi-major and minor axes\nof a and b, is given by:\n\nFellipsoid(Q) = 4π\n3 ab\n2(∆ρ) dμ 3j1(u)\nu\n⎡\n⎣ ⎢\n⎤\n⎦ ⎥\n1∫\nu = Q a\n2μ\n2 + b\n2(1-μ\n2)\n\n(2)\n\nwhere (∆ρ) is the contrast between the particle and the solvent, μ the cosine of the angle between the\nmajor axis of the spheroid and the Q-vector.\n\n4. Derive a normalized particle structure factor P (Q) of a uniform cylindrical particle of radius R and\n\nlength L. Assuming that the particle is randomly oriented with respect to the\nr\nQ vector.\n(A) Show that:\n\nP (Q) =< 1\nVp\ne i\nv\nQ ⋅v r d3r\nVp\n∫\n>= 1\ndμ\n-1\n1∫\nsinQLμ/ 2\nQLμ/ 2\n⎡\n⎣ ⎢\n⎤\n⎦ ⎥\n2 2J1(QR 1-μ2 )\nQR 1-μ2\n⎡\n⎣\n⎢\n⎢\n⎤\n⎦\n⎥\n⎥\n.\n(3)\n\nIn Eq.3, V p denotes the volume of the particle, v r the position vector of an arbitrary point in the\ninterior of the particle, and μ the cosine of the angle between the axis of the cylinder and the Q-\nvector. The bracket means that we are considering an average over random orientations of the\nparticle.\n(B) Show that for a long and thin cylinder, one has asymptotic formulae:\n\nP (Q)\nQL>2π\n→\nπ\nQL\n2J1(QR)\nQR\n⎡\n⎣ ⎢\n⎤\n⎦ ⎥\nQR<1\n→π\nQL e\n-1\n4Q 2R2\n\n(4)\n\n(C) Show that for a flat particle (a lamellar) of QR>>1,\n\nP (Q)\nQR>>1\n→\nQ2R2\nsinQL / 2\nQL / 2\n⎡\n⎣ ⎢\n⎤\n⎦ ⎥\nQL<1\n→\nQ2R 2 e\n-1\n12Q 2L2\n\n(5)\n\nwhere L is the thickness of the flat plate.\n\n(D) From Eq.4 and 5, one can conclude that for a long rod a ln[QI(Q)] vs Q2 plot, and for a flat disk,\na ln[Q2I(Q)] vs Q2 plot, will result in a straight line at large Q with slopes proportional to R2 /4 and\nL2/12 respectively. Explore additional system parameters you can extract from the intercept at Q =\n0.\n(E) In polymer literature, another approximate formula is often used. It is the limit when R goes to\nzero, the so called \"stiff thin rod\" limit. Show that:\n\nP (Q)\nR→0\n=\ndμ\n1∫\nsinQLμ/ 2\nQLμ/ 2\n⎡\n⎣ ⎢\n⎤\n⎦ ⎥\n=\ndμ\n1∫\nsin xμ\nxμ\n⎡\n⎣ ⎢\n⎤\n⎦ ⎥\n= 1\nx\nsinu\nu\ndu -sinx\nx\n⎛\n⎝ ⎜\n⎞\n⎠ ⎟\n2x\n∫\n. (6)\n\nExplore graphically the difference between approximations of the last equation and Eq. 3\n\n5. (This problem is added for your interest only. Your answer is optional. In case you solve it,\nyou will get a bonus points of 20/100)\nScattering intensity of a Gaussian chain. Consider a flexible polymer chain of a contour length L\n=Na, where N is the no. of segments and a is the Kuhn length. If the chain makes a random walk in\nspace, then the mean square end-to-end distance is R\n2 = Na\n2 . For this chain, the distribution of\ndistances between two links (i,j) is Gaussian, namely,\n\nP(Rij )dRij =\n2π Rij\n⎡\n⎣\n⎢\n⎢\n⎤\n⎦\n⎥\n⎥\n3/2\n4πRij\n2 exp -3Rij\n2 Rij\n⎡\n⎣\n⎢\n⎢\n⎤\n⎦\n⎥\n⎥\ndRij , where Rij\n2 = i -j a\n2 .\n(7)\n\nIn order to calculate the normalized particle structure factor of such chain. (a) Start from the\ndefinition:\n\nP (Q) = 1\nN\ne\ni\nr\nQ ⋅(\nr\nR i -\nr\nR j )\nj =1\nN\n∑\ni =1\nN\n∑\n= 1\nN\ne\ni\nr\nQ ⋅\nr\nR ij\ngaussian\nj =1\nN\n∑\ni=1\nN\n∑\n\n(8)\nso that we can evaluate the Gaussian average by integrating the exponential phase factor using the\ndistribution function given by Eq.7. (b) Show first that :\n\nP (Q) = 1\nN\nexp[-1\nj =1\nN\n∑\ni=1\nN\n∑\nRij\n2 ] = 1\nN\nexp[-1\nj =1\nN\n∑\ni =1\nN\n∑\nQ\n2a\n2 i -j\n\n(9)\n\n(c) Prove a theorem: For an arbitrary function f(x),\n\nf (|i -j|) = Nf (0)\nj =1\nN\n∑\ni =1\nN\n∑\n+ 2\n(N -n) f (n)\nn=1\nN -1\n∑\n\n(10)\n(d) Use the theorem to show that the sum in Eq.9 can be evaluated as:\n\nP (Q) = 1\nN\nN + 2(N -1)α -Nα\n2 + α\nN +1\n(1-α )\n⎡\n⎣ ⎢\n⎤\n⎦ ⎥\n\n(11)\n\nwhere α = exp( 1\n6Q\n2a\n2 ) ≈1-1\n6 Q\n2a\n2 , because Qa is much smaller than unity in practice.\n(e) Show that in the limit N →inf, P (Q) approach the Debye function\n\nP (Q) = 2\nx\n2 (x -1+ e\n-x), where x = 1\n6 Q\n2 R\n2 = 1\n6Q\n2a\n2 N\n\n(12)\n(f) Discuss the small and large Q behavior of Eq.12. In particular, show that:\n\nlim\nx→inf\nP(Q) = 1\n2 + 1\n12Q\n2R\n\n(13)"
    },
    {
      "category": "Assignment",
      "title": "Problem Set 2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/22-52j-statistical-thermodynamics-of-complex-liquids-spring-2004/87b3f2589f2b4e0c28490b9840d0ecc8_52_hwiichen04.pdf",
      "content": "10.44J, 22.52 J, 8-575J Statistical Thermodynamics of Complex Liquids\n(Spring 2004)\n\nProblem Set 2 (Prof. Chen)\nDue April 1.\n\n1. Starting from the general expression for the scattering field in VV geometry derived in the class:\n\nr\nE s(r r ,t) = k v\n4π\neikr\nr\nr\nE 0e-iωt∆ε(\nr\nQ ,t)\n\n(1)\nwhere kv = 2π\nλ0\nis the wave no of light in vacuum, and ∆ε(\nr\nQ , t) the Fourier transform of the dielectric\nconstant fluctuation in the fluid. We can calculate the differential cross section for the light scattering as:\n\ndσ\ndΩ=\nr E s(r r ,t) 2 r2\nr\nE i(r r ,t) 2\n= kV\n16π2 ε(\nr\nQ ,t) 2\n.\n\n(2)\n\nFor one-component liquids we can relate the dielectric fluctuation to the density fluctuation by:\n\n∆ε(r r ,t) =\n∂ε\n∂ρ\n⎡\n⎣ ⎢\n⎤\n⎦ ⎥\nT\nδρ(r r ,t) where δρ(r r ,t) = ρ(r r ,t) -ρ\n\n(3)\nis the number density fluctuation and ρ = N / V the average number of the fluid molecules per unit\nvolume. We can also Fourier transform Eq.3 to obtain\n\n∆ε(\nr\nQ ,t) =\n∂ε\n∂ρ\n⎡\n⎣ ⎢\n⎤\n⎦ ⎥\nT\nρ(\nr\nQ ,t)\n\n(3')\n\n(a) Show that the differential scattering cross section per unit volume can be transformed into a practical\nform:\n\ndΣ\ndΩ\n⎡\n⎣ ⎢\n⎤\n⎦ ⎥ VV\n≡1\nV\ndσ\ndΩ\n⎡\n⎣ ⎢\n⎤\n⎦ ⎥ VV\n= 4π2\nλ0\n4 n2 ∂n\n∂ρ\n⎡\n⎣ ⎢\n⎤\n⎦ ⎥\nT\n2 N\nVS(Q).\n\n(4)\n\n(b) Given the fluctuation theorem which states that:\n\nS(Q→0) = ρkBTχT = kBT ∂ρ\n∂p\n⎡\n⎣ ⎢\n⎤\n⎦ ⎥\nT\n\n(5)\nand the virial expansion:\n\np\nkBT = ρ + B2ρ2\n,\n\n(6)\nshow that\n\ndΣ\ndΩ\n⎡\n⎣ ⎢\n⎤\n⎦ ⎥ VV\n= 4π2\nλ0\n4 n2 ∂n\n∂ρ\n⎡\n⎣ ⎢\n⎤\n⎦ ⎥\nT\nρ\n1+ 2B2ρ ,\n\n(7)\n\nwhere\ndΣ\ndΩ\n⎡\n⎣\n⎤\n⎦ VV is called the Rayleigh ratio in the literature.\n\nFor two-component liquids such as a macromolecule of molecular weight Mw and index of\nrefraction n suspended in a solvent of index of refraction n0, one likewise expands the\nin terms\nof the concentration fluctuation\nas:\n∆ε(\nr\nQ ,t)\nC(\nr\nQ ,t)\n\n∆ε(\nr\nQ ,t) =\n∂ε\n∂C\n⎡\n⎣ ⎢\n⎤\n⎦ ⎥ T\nC(\nr\nQ ,t)\n\n(8)\nso that\n\n∆ε(\nr\nQ ,t) 2 =\n∂ε\n∂C\n⎡\n⎣ ⎢\n⎤\n⎦ ⎥ T\nC(\nr\nQ ,t)2\n\n(9)\n\n(c) Show that for Q\n,\n→0\n\nC(\nr\nQ ,t) 2\n= V2 ∆C 2\n\n(10)\n\nwhere ∆\nis the average concentration fluctuation over the volume V.\nC\n(d) For the two-component system we thus have:\n\ndΣ\ndΩ\n⎡\n⎣ ⎢\n⎤\n⎦ ⎥ VV\n= 4π2\nλ0\n∂ε\n∂C\n⎡\n⎣ ⎢\n⎤\n⎦ ⎥ T\nV ∆C 2\n\n(11)\n(e) Show from thermodynamic fluctuation theory that:\n\nV ∆C 2 = kBTC\n∂π\n∂C\n⎡\n⎣ ⎢\n⎤\n⎦ ⎥\nT\n\n(12)\nand use Vant Hoff's equation of the states\n\nΠ = NAkBTC\nMW\n\n(13)\nwhere NA is Avogadro's number and C the concentration of the solute in g/ml., the differential cross\nsection per unit volume is finally written as:\n\ndΣ\ndΩ\n⎡\n⎣ ⎢\n⎤\n⎦ ⎥ VV\n= 4π2\nλ0\n4 n0\n2 ∂n\n∂C\n⎡\n⎣ ⎢\n⎤\n⎦ ⎥ T\n2 MWC\nNA\n= HCMW.\n\n(14)\n\nwhere H is an experimental constant defined as:\n\nH = 4π2\nλ0\n4 n0\n2 ∂n\n∂C\n⎡\n⎣ ⎢\n⎤\n⎦ ⎥ T\nNA .\n\n(15)\n\nAn important point to observe is that for an ideal solution, the Q = 0 limit of the intensity is proportional\nto the molecular weight of the solute.\n\n(f) Extend the cross section formula to a more general non-ideal solution case where\n\nΠ\nNAkBT =\nC\nMW\n+ B2C2\n\n(16)\n\nand get the often quoted formula in the literature of light scattering\n\nHC\ndΣ\ndΩ\n⎡\n⎣ ⎢\n⎤\n⎦ ⎥\nVV\n=\nMW\n+ 2B2C\n\n(17)\n\nThe left hand side quantity vs C plot at a given temperature would be a straight line giving the molecular\nweight from the zero intercept, and the slope of the line gives the second virial coefficient. This is called\na Zimm plot in the literature.\n\n2. Consider small angle scattering from a disordered, isotropic material. Starting from the known\nexpression (derived in the class) for the scattering intensity per unit volume\n\nI(Q) = 1\nV\nblexp i\nr\nQ ⋅\nr\nR l\n(\n)\nl∑\n\n(18)\n(A) Show that one can transform the expression to a from\n\nI Q\n( )=\ndr4πr2 j0 Qr\n(\n)\ninf∫\nρ 0( )ρ r( ) ,\n\n(19)\nwhere ρ(r) is the scattering length density (sld) defined as\n\nρ r( ) =\nblδ r -Rl\n(\nl∑\n).\n\n(20)\nWe now specialize to a two-phase system. Let the scattering length density of phase 1 be ρ1 ≈ρw\n(\n) and that of\nthe phase 2, ρ\n, and denote by ∆ρ\n2 ≈ρo\n(\n)\n= ρ1 -ρ2 . The linear and square average scattering length densities of\nthe medium are given by:\n\nρ = Φ1ρ1 + Φ2ρ2\n\n(21)\n\nρ2 = Φ1ρ1\n2 + Φ2ρ2\n\n(22)\n\nwhere Φ and\nare the volume fractions of phase 1 and 2 respectively.\nΦ2\n(B)\nFrom these definitions and the fact that Φ1 + Φ2 = 1, derive a useful relation for the mean square\nfluctuation of the sld in the medium:\n\nρ r( )-ρ\n(\n)\n2 = ρ2 -ρ 2 = Φ1Φ2 ρ1 -ρ2\n(\n)\n2 = ∆ρ\n(\n)\n2Φ1Φ2\n\n(23)\n\nNext, consider fluctuation of the sld η(r) = ρ(r) -ρ\n(C)\nShow that\n\nρ 0( )ρ r( ) =\nη 0( )+ ρ\n(\n) η r( ) +ρ\n(\n)\n\n= η 0( )η r( ) + ρ\n2 .\n\n(24)\n\nTherefore, except at Q=0, we can write:\n\nI Q\n( )=\ndr4πr2 j0 Qr\n(\n)\ninf∫\nη 0( )η r( )\n\n= η2\ndr4πr2 j0 Qr\n(\n)\ninf∫\nη 0( )η r( )\nη2\n\n(25)\n\nwhere η2 = ∆ρ\n(\n)\n2 Φ1Φ2 according to Eq.23. We call Γ r( ) the normalized Debye correlation function defined\nas:\n\nΓ r( ) = η 0( )η r( )\nη2\n.\n\n(26)\n\n(D)\nShow from Eq.25, the existence of the \"invariant\",\n\nη2 =\n2π2\ndQQ2I Q\n( )\ninf∫\n.\n\n(27)\n\nThe most important properties of the Debye correlation function of a two-phase system are:\n\n(i)\n\n,\n.\n\n(28)\nΓ r = 0\n(\n) =1 Γ r →inf\n(\n) = 0\n\nThe latter condition follows from the fact that at large separation η 0( )η r( ) ≈η 0( ) η r( ) = 0 .\n\n(ii)\n\n′\nΓ r = 0\n(\n) = -\n4Φ1 1 -Φ1\n(\n)\nS\nV\n\n(29)\n\nwhere S/V is the total interfacial areas per unit volume in the medium, a very important property in a micro-\nphase- separated system or in a porous material. Try to prove this theorem (ii) by reading the lecture notes.\n\nThere are two simple models for the Debye correlation function in a porous materials or micro-phase-\nseparated systems which are only approximate:\n\n(a)\nDebye model (one parameter model): ΓD r( ) = exp -r / ξ\n(\n).\n(30)\n\n(b)\nTeubner-Strey model (two parameter model): ΓTS(r) = exp -r / ξ\n(\n)jo (kr)\n(31)\n\n(E)\nCalculate the scattering intensity (analytical expression) for each case and sketch its graphical form.\n\n(F)\nRelate the S/V to the model parameters in each case.\n\n3. In the lecture notes we derive Porod's law, which is asymptotically valid for any system with smooth\ninternal interfaces (i.e. for Q>> reciprocal of the persistence length of the surface). It can be stated as follows :\n\nI(Q →inf) = 2π(ρ1 -ρ2)2 S\nV\nQ4 .\n\n(32)\n\nIt was derived from consideration of the short distance behavior of Γ(r). In the following you are asked to\nderive it directly from the scattering intensity formula of neutrons or x-rays from a sharp interface separating a\nmedium with a sld ρ from another medium with a sld\nρ2 .Imagine a sample with a volume V, having a large,\nflat, internal interface of an area S. Take this interface to lie in the x-y plane. The scattering intensity for a given\ndirection of\nr\n(with respect to the surface normal) is, by definition,\nQ\n\nI(\nr\nQ ) = 1\nV F(\nr\nQ )\n\n(33)\n\nwhere the form factor is given by\n\nF(\nr\nQ ) = d3r ρ(r r\n∫\n)ei r\nQ ⋅r r = dx dy dzexp[i(Qxx + Qyy + Qzz)]\n∫\n∫\n∫\nρ(z).\n(34)\n\n(A)\nLet ρ(z) = ρ2, for z > 0; and ρ(z) = ρ1, for z < 0 . Integrate over z first to get\n\nF(\nr\nQ ) = (ρ1 -ρ2)\niQz\ndx dyexp[i(Qxx + Qyy)]\n∫\n∫\n= (ρ1 -ρ2)\niQz\n(2π) 2δ(Qx)δ(Qy).(35)\n\n(B)\nShow that\n\nI(\nr\nQ ) = 1\nV F(\nr\nQ )\n2 = (2π)2\nV\n(ρ1 -ρ2)2\nQz\nSδ(Qx)δ(Qy).\n(35)\n\n(C)\nNow, the measured intensity distribution I(Q) is the orientational average of the above calculated I(\nr\nQ ),\nnamely, one has to average over all directions of the Q-vector. Take the direction of the Q-vector to be\nin the direction defined by polar coordinates (θ,φ). Then,\n\nI(Q) =< I(\nr\nQ ) >= 1\nV < F(\nr\nQ )\n2 > = (2π)2\nV\n4π\ndφ\n2π\n∫\ndθsin θ\nπ\n∫\n(ρ1 -ρ2)2\nQ2 cos2 θ Sδ(Qx)δ(Qy).\n\nShow that the above integration leads to precisely the Porod's law given in the beginning of the\nproblem.\n\nThis particularly beautiful derivation of the Porot's law was first given by P. De Genne."
    },
    {
      "category": "Assignment",
      "title": "Problem Set 3",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/22-52j-statistical-thermodynamics-of-complex-liquids-spring-2004/0806f5a2cc6372845e401f47b6f4a628_52_hwiii_chen_04.pdf",
      "content": "8.575J, 10.44J, 22.52J Statistical Thermodynamics of Complex Liquids\n\nProblem Set 3 (Prof. Chen)\n\nDue May 11, 2004\n\n1. The simplest way of taking into account the excluded volume effect on the structure factor of a\nsystem of colloidal particles is to take the following approximate form of g(r):\n\ng(r) = 0\nr < σ\nr ≥σ\n⎧ ⎨\n⎩\n⎫ ⎬\n⎭\n\n(1)\nwhere σ is the equivalent hard sphere diameter of the particles. This is called a \"correlation hole\"\napproximation.\n\n(A) What exact features of g(r) does the correlation hole approximation capture?\n(B) Use the relation between S(Q) and g(r) to calculate the analytical form of S(Q).\n(C) Show that in the Q\nlimit,\n→0\n\n(2)\nS(0) = 1-8φ\nwhere φ is the volume fraction of the hard spheres. This is an exact result to 1st order in φ. Give a\nplausible reason that a drastic approximation such as Eq.(1) gives correct S(0) to first order in φ.\n\n2. Fourier's transformation of the direct correlation function of a sticky hard sphere model is given in\nan analytical form in the end of Chapter VI of the lecture note. This expression contains two parts: the\nfirst part, which is the purely hard sphere part and the second part, which comes from the stickiness.\nThis latter part contains a parameter λ which is the smaller root of eq.(6.36).\n\n(a) Show that the resulting structure factor S(Q), where Q = kd, can be expressed in a closed analytical\nform with a set of auxiliary equations. It is functions of two basic parameters, the volume fraction φ\nand the stickiness 1/ τ.\nS(Q) -1= 24φ αf2(Q)+βf3(Q)+ 1\n2 φαf5(Q)\n⎡\n⎣ ⎢\n⎤\n⎦ ⎥ +2φ2λ2f1(Q)-2φλf0(Q)\n(3)\n\nWhere various functions are defined as: f0(x) = sin(x)/x; f1(x) = (1-cos(x))/x2; f2(x) = (sin(x)-\nxcos(x))/x3; f3(x) = [2xsin(x)-(x2-2)cos(x)-2] / x4 ; f5(x) = [(4x3-24x)sin(x) - (x4-12x2 +24) cos(x) +\n24] / x6, and\n\nα = 1+ 2φ-μ\n(\n)2\n1-φ\n(\n)4\n, β =-\n3φ 2+φ\n(\n)2 -2μ 1+ 7φ+ φ2\n(\n)+ μ2 2+ φ\n(\n)\n2 1-φ\n(\n)4\n\n(4)\n\nμ= λ φ(1-φ), λ =\n6 ∆-\n∆2 -Γ\n(\n)\nφ\n, Γ= φ 1+ φ 2\n(\n)\n3 1-φ\n(\n)2 , ∆= τ+\nφ\n1-φ\n\n(5)\n\nThe hard sphere limit is obtained by setting 1/ τ → 0, λ → 0, μ → 0.\n\n(b) Calculate and plot the structure factor S(Q) at volume fraction φ = 0.1213 and at two stickiness\nparameters: 1 / τ = 1.0 and 1 / τ = 10. Compare the first case with the pure hard sphere case at the same\nvolume fraction. Discuss the small Q feature of the second case.\n\n3. This problem concerns the interpretation of light scattering data from a colloidal suspension.\nIt was stated in problem set 2 that the Rayleigh ratio at 90 scattering angle can be written as:\n\nR90 = K\ncRT\n∂π\n∂c\n⎡\n⎣ ⎢\n⎤\n⎦ ⎥\nT,P\n\n(6)\n\nwhere R\n, c is the concentration of the solute in g/ml and\n= N Ak B\n\nK = 4π 2n2\nNAλ0\n∂n\n∂c\n⎡\n⎣ ⎢\n⎤\n⎦ ⎥\nT\n\n(7)\n\nIf the colloidal particle is made of a spherical aggregate of polymers with total molecular weight M\n(molecular weight of the polymer times the average aggregation no. of polymers per colloidal particle,\ni.e. M = MwN ) and, to the first approximation, we can treat it as a hard sphere of diameter σ. Then\nshow that Canahan-Stirling formula for the pressure of a hard sphere system can be written as:\n\nπ = cRT\nM f1(c)\n\n(8)\nwhere\n\nf1(c) = 1+ qc + q2c2 -q3c3\n(1-qc)3\n, q = π\n6 σ3 NA\nM .\n\n(9)\n\nCalculate the Rayleigh ratio and plot it as a function of c in the range 0 to 0.4 g/ml. Take K as a constant\nand σ = 100 A and M = 310 KD.\n\nIf there is an attractive interaction with the potential u(r), in addition, one can use the perturbation\ntheory described in the lecture notes\n\nβA\nN = βAHS\nN\n+ 1\n2 βρ\ndr4πr2\ninf∫\nu(r)gHS(r)\n\n(10)\n\nto show that\n\nπ = πHS + cNA\nM\n⎡\n⎣\n⎤\n⎦\n2 ∂\n∂c 2πc\ndrr2u(r)gHS(r)\ninf∫\n⎡\n⎣\n⎤\n⎦\n= cRT\nM f1(c) + f2(c)\n.\n.\n\n(11)\n\nIf the attractive potential is very long-ranged, we can make an approximation,\n\n2π\ndrr2u(r)gHS(r)\ninf∫\n= 2π\ndrr2u(r)gHS(r)\nσ\ninf∫\n= -a\n\n(12)\n\nwhere a is called the van der Waal constant. Then,\n\nπ = cRT\nM f1(c) -a N A\nM\n⎡\n⎣\n⎤\n⎦\nc2\n\n(13)\n\nTake a\nkBT = 1.33x10-18cm3 and T = 293 K. Recalculate R90 and compare with the hard sphere result.\n\n4. Show that for a co-polymer solution of concentration c (in unit of g/ml), where the co-polymer\nmolecules are known to self-associate into spherical micelles of diameter σ, the general expression for\nthe Rayleigh ratio at finite k can be written as:\n\nRθ = KCMP (k)S(k) .\n\n(14)\n\nIn this equation, K is the constant defined already in problem 3, C=c - c.m.c. (in unit of g/ml), M the\naverage molecular weight of the micelles (in unit of g/Mol), P (k) the normalized particle structure\nfactor and S(k) the inter-micellar structure factor. Assuming that the micellar size σ is much smaller\ncompared to wave length of light so that effectively P (k)=1 and one can take k = 0 limit of S(k) to\nobtain\n\nRθ = KCMS(0).\n\n(15)\n\nA. show that for a hard sphere system\n\nS(0) = 1 + 4φ+ 4φ2 -4φ3 + φ4\n(1 -φ)4\n= 1+ 8φ + 30φ2 + 72φ3 +140φ4 +.....\n(16)\n\nwhere φ is the volume fraction of hard spheres.\n\nB. Show by plotting\nvs φ, for φ from 0 to 0.5, that\nLn(1 / S(k))\nS(0) ≈exp(8φ) to a very good\napproximation.\n\nC. We can put Eq.15 into a form\n\nLn KC\nR90\n⎡\n⎣ ⎢\n⎤\n⎦ ⎥ = Ln 1\nM\n⎡\n⎣\n⎤\n⎦ + Ln\nS(k)\n⎡\n⎣ ⎢\n⎤\n⎦ ⎥ .\n\n(17)\n\nAccording to the result of section B, if one plot Ln KC\nR90\n⎡\n⎣ ⎢\n⎤\n⎦ ⎥ vs C, one would obtain a straight line for a\nrange of C from 0 to 20 weight % of polymer or so. Considering that there is about 50% of hydration in\na co-polymer micelle, this would amount to a range of micellar volume fraction φ from 0 to 40%. Find\nout what information you can extract from this plot. This is a generalized \"Zimm plot\" which is well\nknown in light scattering literature.\n\nD. An example is given in the following from a light scattering investigation of a Pluronic tri-block co-\npolymer P104 [(PEO27 PPO61 PEO27), MW = 5900 DT] in water at 45°C (Y.C. Liu, S.H. Chen, J.S.\nHuang, Light Scattering Studies of Concentrated Copolymer Solutions, Macromolecules 31, 6226-\n6233 (1998)). It is known that the density of Pluronic polymers is 1.0 g/ml to a good approximation.\nCalculate the hydrated volume fraction and the aggregation number of the micelle."
    },
    {
      "category": "Exam",
      "title": "Quiz 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/22-52j-statistical-thermodynamics-of-complex-liquids-spring-2004/8492803ea5555d3c489b006849071945_52_quiz1_chen_4.pdf",
      "content": "10.44J, 22.52J, 8.575J Statistical Thermodynamics of Complex Liquids (Spring 2004)\nQuiz 1 (Part II, Prof. Chen)\n\nClose book (2 hr)\n\n1. This question is to ask you why hydrogen atom has an exceptionally large incoherent scattering cross\nsection but relatively small coherent scattering cross section, while deuterium atom has similar\nmagnitudes of incoherent and coherent scattering cross sections. You can answer this question by\nactually computing the cross sections according to the following definitions:\n\nσcoh = 4πb2\nσinc = 4π b2 -b2\n⎛\n⎝ ⎜\n⎞\n⎠ ⎟\nσsc = 4πb2 + 4π b2 -b2\n⎛\n⎝ ⎜\n⎞\n⎠ ⎟ = 4πb2\n,\n\n(1)\n\ngiven that\n\n(A) (8%) for a H atom, I=1/2,\nb+=1.03 ×10-12 cm, and b-= -4.74×10-12 cm,\n\n(B) (7%) but for a H atom, I=1, b+ = 0.95 x 10\n-12 cm and b- = 0.10 x 10-12 cm.\n\n2. Given that the particle structure factor for a randomly oriented cylinder with a cross-sectional radius\nR and length L is :\n\nP (Q) = 1\ndμ sin(QLμ / 2)\nQLμ / 2\n⎡\n⎣\n⎢ ⎢\n⎤\n⎦\n⎥ ⎥\n-1\n1∫\n2 2J1(QR 1 -μ2 )\nQR 1-μ2\n⎡\n⎣\n⎢\n⎢ ⎢\n⎤\n⎦\n⎥\n⎥ ⎥\n,\n\n(2)\n\n(A) (7%) make an argument (mathematical or physical), that when the particle is a long and thin rod,\none has an asymptotic form,\n\n2R\nQ\nQR\nQL\ne\nQL\nQR\n)\nQR\n(\nJ\nQL\n)\nQ\n(\nP\n-\n<\nπ\n>\nπ\n→\n⎥⎦\n⎤\n⎢⎣\n⎡\nπ\n→\n.\n\n(3)\n\n(B) (8%) Assuming that one has a dilute solution of mono-dispersed rod-like micelles, give a complete\nexpression for the scattering intensity I(Q) (in unit of cm-1). Show that a Guinier plot of\nwill yield a straight line, from the slope and the zero intercept of which one can extract\nrespectively the radius and the aggregation number per unit length of the micelle.\nln QI(Q)\n[\n] vs Q2\n\n3. It was shown in Chapter III that the scattering intensity from an isotropic porous material (a two-phase\nsystem) can be written succinctly as:\n\nI Q\n( )= η2\ndr4πr2 sin Qr\nQr\ninf∫\nΓ(r),\n\n(4)\n\nwhere η2 = ∆ρ\n( )2Φ1Φ2,\nis the difference in the sld's of the two phases,\ntheir respective volume\nfractions and Γ\nthe normalized Debye correlation. The Debye correlation function has the following three\nboundary conditions:\nρ\n∆\n1,Φ\nΦ\nr( )\n\n, Γ\n.\n\n(5)\n\nΓ r = 0\n(\n) =1\nr →inf\n(\n) = 0\n\n′\nΓ r = 0\n(\n) = -\n4Φ1 1 -Φ1\n(\n)\nS\nV .\n\n(6)\n\n(A).(10%) Now if the microstructure (morphology) of the medium is characterized by a unique length scale ξ,\nthen the Debye correlation function must be of the form Γ r\nξ\n⎛\n⎝ ⎜\n⎞\n⎠ ⎟ . Show that under this condition the scaled\nintensity distribution\nI(Q)\nη2 ξ3\n\n(7)\n\nis a function of the dimensionless scaling parameter\nξ\n= Q\ny\nonly. This implies that for a bunch of porous\nmaterials with different\n, if we plot the scaled intensity distributions as a function of the scaling parameter y,\nthey will all collapse into a single master curve.\nξ\n(B).(5%)Calculate the intensity I(Q) explicitly for the case of the Debye model which assumes that\nΓ(r) = e\n-r\nξ , and show the validity of the above theorem by calculating the scaled intensity.\n\nYou need the formula\n4πx2\ninf\n∫\nsinxy\nxy\ne-xdx =\n8π\n1+ y2\n(\n)\n2 .\n\n(8)\n\n(C)(5%) Show that in this case the unique length scale ξ in the system is given by\n\nξ = 4φ1φ2\nS\nV\n⎛\n⎝\n⎞\n⎠\n-1\n.\n\n(9)\nwhere S/V is the surface to volume ratio of the porous material."
    },
    {
      "category": "Exam",
      "title": "Quiz 2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/22-52j-statistical-thermodynamics-of-complex-liquids-spring-2004/ae8caa290af9878180cfad1fb4e43b24_52_quiz_2_chen_4.pdf",
      "content": "8.575J,10.44J, 22.52J Statistical Thermodynamics of Complex Liquids (2004)\n\nQuiz 2 (Prof. Chen)\n\nPart II.\n1. It is shown in chapter V of the class notes that the Ornstein-Zernike equation which is the starting\npoint for the theoretical computation of the total correlation function h(r) in liquids is an equation\nwhich connects h(r) to the direct correlation function c(r). In order to solve the O-Z equation, it is\nessential to give another relation which connects c(r), h(r) and the inter-particle pair potential\nfunction u(r). This latter relation is called the closure relation.\n(a)(5%) Write down two closure relations that you know and use them to justify that in the limit the\nnumber density\n, the pair correlation function g(r) is given simply by\n→\nρ\n\n(1)\n)r(\nu\ne\n)r(\ng\nβ\n-\n=\n\nwhere β\n. This is the exact low density limit of the pair correlation function.\n= 1/kBT\n\n(b) (3%) Consider the case of a hard sphere system where σ is the hard sphere diameter of the particles.\nSketch the pair correlation function in this limit. What exact features of g(r) does this approximation\ncapture?\n(c) (10%) Use the relation between S(Q) and g(r) to calculate the analytical form of S(Q).\nand show that in the Q\nlimit,\n→0\n\nS(\n\n(2)\n0) = 1 -8φ\n\nwhere φ is the volume fraction of the hard spheres. Is this an exact result to the first order in φ?\n\n2. It was shown in the class notes that light scattering intensity from a mono-dispersed micellar system\ncan be written as:\n\nR(Rayleigh Ratio) = KCMS(Q\n) [cm\n→0\n-1]\n\n(3)\n\nwhere K is an optical constant, C the concentration of the surfactant in solution, in g/ml, and M the\neffective molecular weight of the colloidal particle (a micelle in this case) in unit of g/Mol. It is\nimportant to know that\nlimit of the structure factor is related to the thermodynamic quantity\nof the solution through the \"compressibility theorem\".\nQ →0\n\n(a) (5%)Write down the compressibility theorem for the case of a colloidal solution. Use the virial\nexpansion to cast Eq.(3) into a form involving the second virial coefficient.\n(b) (5%)Use the equation derived above to illustrate the Debye Plot applicable for dilute colloidal\nsolutions. What useful quantities can you extract from the Debye plot?\n(c) (5%)One can show from Carnahan-Stirling equation of state for hard spheres that\n\nS 0( ) = 1+ 4η + 4η2 -4η3 + η4\n1-η\n(\n)4\n≈exp 8η\n(\n).\n\n(4)\n\nThe attached figure shows the log(CK/R) vs polymer concentration (in weight fraction) of Pluronic\nP104 tri-block copolymers dissolved in D2O. It is known that the copolymer and heavy water have\nthe same density.It is also known that in the temperature and concentration ranges studied, the\ncopolymers form mono-disperse d micelles, each of which has a dry PPO core and a hydrated\ncorona region.\nBy examining the zero concentration intercept of the line, what can you conclude about the\naggregation number of the micelle when the temperature rises?\n\n(d)(10%) Give the specific property of the micelle that one can extract from the slope of the line,\nassuming that one can approximate the inter-micellar interaction to be hard-sphere -like.\n\n3. The second virial coefficient can be measured easily by a light scattering experiment, so it is useful to\ncalculate it theoretically. In class we showed that given an inter-particle pair potential function u(r), one\ncan calculate the second virial coefficient B2(T). You are asked to calculate B2(T) for the adhesive\nsphere system. The adhesive sphere model is defined by a dimensionless inter-particle potential function\n\nβu(r) =\ninf\nif\nr < R -∆\n-Ω\nif\nR -∆< r < R\nif\nr > R\n⎧\n⎨ ⎪\n⎩ ⎪\n\n(5)\n\n(A) (10%) Show that\n\nB2(T) = 2\n3πR3 1-1\n4τ\n⎛\n⎝ ⎜\n⎞\n⎠ ⎟\n\n(6).\n\nwhere\nτ = 12∆\nR eΩ, for ∆\nR << 1.\n\n(7)\n\nInterpret the physical meaning of the two terms in Eq.6."
    }
  ]
}