{
  "course_name": "Statistical Thermodynamics of Biomolecular Systems (BE.011J)",
  "course_description": "This course provides an introduction to the physical chemistry of biological systems. Topics include: connection of macroscopic thermodynamic properties to microscopic molecular properties using statistical mechanics, chemical potentials, equilibrium states, binding cooperativity, behavior of macromolecules in solution and at interfaces, and solvation. Example problems include protein structure, genomic analysis, single molecule biomechanics, and biomaterials.",
  "topics": [
    "Engineering",
    "Biological Engineering",
    "Biomaterials",
    "Biostatistics",
    "Science",
    "Biology",
    "Biophysics",
    "Computation and Systems Biology",
    "Chemistry",
    "Physical Chemistry",
    "Physics",
    "Thermodynamics",
    "Engineering",
    "Biological Engineering",
    "Biomaterials",
    "Biostatistics",
    "Science",
    "Biology",
    "Biophysics",
    "Computation and Systems Biology",
    "Chemistry",
    "Physical Chemistry",
    "Physics",
    "Thermodynamics"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 3 sessions / week, 1 hour / session\n\nRecitations: 1 session / week, 1 hour / session\n\nPrerequisites\n\n8.02, 18.02\n\nCourse Objectives\n\nBiology is now probing molecular level systems, so the need for physical molecular are becoming prevalent. Understanding the physical properties of biological systems on the molecular level allows one to engineer them. This course was created for the development of a biological engineering major, and serves as a core course that teaches the fundamentals of thermodynamics and statistical mechanics necessary for upper level biological engineering courses. It is cross listed for mechanical engineers who wish to develop a molecular understanding, and serves as part of the bioengineering and nanotechnology tracks for mechanical engineering majors.\n\nSpecifically, this course serves as an introduction to the physical chemistry of biological systems and deals with the connection of macroscopic thermodynamic properties to microscopic molecular properties using statistical mechanics. It includes chemical and electrochemical potentials, equilibrium states, the behavior of macromolecules in solution and at interfaces, titration of macromolecules, and solvation. Example problems include protein structure, genomic analysis, single molecule biomechanics, and biomaterials.\n\nRecitation\n\nThere will be two 1-hour recitation sections per week. Students may choose any one recitation section most convenient for their schedule.\n\nText\n\nDill, K., and S. Bromberg.\nMolecular Driving Forces\n. New York, NY: Routledge, 2002. ISBN: 9780815320517.\n\nAdditional References\n\nHill, T. L.\nAn Introduction to Statistical Thermodynamics\n. New York, NY: Dover, 1987. ISBN: 9780486652429.\n\nvan Holde, K. E., W. C. Johnson, and P. S. Ho.\nPrinciples of Physical Biochemistry\n. Upper Saddle River, NJ: Prentice Hall, 1998. ISBN: 9780137204595.\n\nEisenberg, D., and D. Crothers.\nPhysical Chemistry with Applications to the Life Sciences\n. Menlo Park, CA: Benjamin/Cummings, 1979. ISBN: 9780805324020.\n\nKittel, C., and H. Kroemer.\nThermal Physics\n. 2nd ed. New York, NY: W.H. Freeman, 1980. ISBN: 9780716710882.\n\nMcQuarrie, D. A.\nStatistical Mechanics\n. New York: Harper Collins, 1976.\n\nAtkins, P. W.\nPhysical Chemistry\n. San Francisco: W. H. Freeman, 1997.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\n3 In-class Quizzes\n\n25% (each)\n\nFinal Exam\n\n25%\n\nAll examinations will be closed book. One page of notes is allowed.\n\nHomework Policy\n\nHomework will not be graded. Practice problems representative of those that will appear on exams will be assigned each week, along with solutions. Please attempt to work the homework on your own before looking at solutions and work all problems each week as they are assigned. Practice problems will be discussed in recitation sessions. Students who can work all practice problems easily without looking at notes or asking for help usually perform well on exams.",
  "files": [
    {
      "category": "Assignment",
      "title": "pset1_solutions.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-011j-statistical-thermodynamics-of-biomolecular-systems-be-011j-spring-2004/aad318ecefb02735eb3c7416e336e531_pset1_solutions.pdf",
      "content": "BE.011/2.772J\nStatistical Thermodynamics of Biomolecular Systems\nSpring 2004\nGriffith/Hamad-Schifferli\nProblem Set #1 Solutions\nDue: 2/11/04\n1.) Dill 1.1\n(a) The simplest way to solve this problem is to recall that when probabilities are\nindependent, and you want the probability of events A AND B, you can multiply them.\nWhen events are mutually exclusive and you want the probability of events A OR B, you\ncan add the probabilities. Therefore we try to structure the problem into an AND and OR\nproblem. We want the probability of getting into J or DSM or UCSF. But this doesn't\nhelp because these events are not mutually exclusive (mutually exclusive means that if\none happens, the other cannot happen). So we try again. The probability of acceptance\nsomewhere, P(a), is P(a) = 1- P(r), where P(r) is the probability that you're rejected\neverywhere. (You're either accepted somewhere or you're not.) But this probability can\nbe put in the above terms. P(r) = the probability that you're rejected at J AND at DSM\nAND at UCSF. These events are independent, so we have the answer. The probability of\nrejection at H is p(rH) = 1-0.5 = 0.5. Rejection at DSM is p(rDSM) = 1-0.3 = 0.7.\nRejection at UCSF is p(rUCSF) = 1-0.1 = 0.9. Therefore P(r) = (0.5)(0.7)(0.9) = 0.315.\nTherefore the probability of at least one acceptance = P(a) = 1-P(r) = 0.685.\n(b) This is the intersection of two independent events:\np(aH)p(aDSM) = (0.5)(0.3) = 0.15.\n2.) Dill 1.2\n(a) Each base occurs with probability 1⁄4. The probability of an A in position 1 is 1⁄4, of a in\nposition 2 is 1⁄4, of A in position 3 is 1⁄4, of T in position 4 is 1⁄4 and so on. There are 9\nbases. The probability of this specific sequences is (1/4)9 = 3.8 x 10-6.\n(b) Same answer as (a) above.\n(c) Each specific sequence has the probability given above, but in this case there are many\npossible sequences which satisfy the requirement that we have 4 A's, 2 T's, 2 G's, and 1\nC. How many are there? We start as we have done before, by assuming all nine objects\nare distinguishable. There are 9! Arrangements of nine distinguishable objects in a linear\nsequence. (The first one can be in any of nine places, the second in any of the remaining\neight places, and so on.) But we can't distinguish the four A's's, so we have over-counted\nby a factor of 4!, and must divide this out. We can't distinguish the two T's, so we have\n!9\n\nover-counted by 2! , and must also divide this out. And so on. So there are\n\n!1!2!2!4\n\nsequences having this composition. In parts a and b we found that each such sequence\noccurs with probability 0.259. So the overall probability of 4 A's, 2 T's, 2 G's, and 1 C is\n3780*(0.25)9 = 0.0144\n\n3.) Dill 1.6\n( )\n(a) We want to find a such that ∫\ndx\nx\np\n= 1. So we can plug in for p(x) and integrate:\na\nn\n( )\n∫\ndx\nx\np\n= ∫\ndx\nax\n= a x n+ 1\n=\n= 1\nn + 1\nn + 1\nSo, for normalization, we require that a = n + 1.\n(b) To find the mean <x> we use the standard formula, and plug in for p(x).\na\nn + 1\nx\n( )dx\nx\nxp\n= ax n+ 1dx =\na\nx\n=\n=\n= ∫\n∫\nn + 2\nn+ 2\nn + 2\nn + 2\n(c) To find the variance, again use the formula, and plug in for p(x).\n2 ( )\nσ\n= ∫ x\ndx\nx\np\n<\n-\nx > 2\n= ∫ ax n+ 2 dx -\nn + 1\na\nn+ 3\nn + 1\n=\nn + 2\nn + 3 x\n- n + 2\nn + 1 n + 1\nn + 1\n=\n=\nn + 3 - n + 2\n(n + )(\n3 n + 2)2\n4.) Dill 1.10\n(a) You have 20 distinguishable amino acids, and each sequence is n letters long. You have\none test sequence and s sequences in a database that you are testing against. The chance\nof matching is the chance of seeing a specific amino acid from your test sequence, so this\npart is like problem 2a since each position is independent. The probability of a perfect\nmatch of all n residues is pn. To find how many perfect matches there will be, just\nmultiply by the number of sequences you are trying to match to, s. (Since real numbers\nare easier, if the probability of a perfect match was 0.25, of 100 sequences you would\nn\nexpect to see 25 matches.) So, the average number of matches in s sequences = sp .\n(b) When there is one mismatch in a sequence, this means n - 1 positions match. You need to\nknow how many ways you can choose these (n-1) matches out of n amino acids. And for\nthe probabilities, you have a probability p for each of the (n-1) matches and a probability\n(1-p) for the one mismatch. The answer is given by the binomial distribution!\n\nn\n-1\n- 1\n1 =\np(one mismatch in a single comparison) =\n(1- p)\n(1- p)\nn\n\nnp n\np\nn - 1\nTo get the average number of single mismatches, again multiply by s as in part (a).\nAverage number of single mismatches in s comparisons = snpn-1(1-p).\nNote, in general, for k matches:\nP(k) = spk(1-p)n-k\nn!\nk!(n - k)!\n\n5.) Dill 1.11\nFirst, this problem assumes that all cysteines will be paired. In a real protein, although an\nunpaired cysteine is less favorable than a paired cysteine, your protein can still fold and function\nnicely even if there are a couple unpaired cysteines in it. But, in this problem, assume all\ncysteines must be paired.\nThere are two ways of doing this problem. The first way: number the individual sulfhydryl\ngroups along the chain. The first sulfhydryl along the sequence can bond to any of the other n-1.\nThis removes two sulfhydryls from consideration. The third sulfhydryl can then bond to any of\nthe remaining n-3. Four sulfhydryls are now removed from consideration. The fifth can now\nbond to any of the remaining n-5 sulfhydryls, etc., until all n/2 bonds are formed. Thus the total\npossible number of arrangements of disulfide bonds is a product of n/2 terms:\n= (n-1)(n-3)(n-3)...1. So in this case of 6 CYS residues, the answer is 5*3*1 = 15.\nAnother way: we write the names of all the cysteines on separate pieces of paper and put them in\na bag. We generate different possible pairings by drawing two pieces of paper from the bag at a\ntime until all of the papers have been drawn. (so, \"n choose 2\", then \"n-2 choose 2\", etc.) The\nnumber of ways we can do this is:\n- 2\n- 4\n4 2\n\n...\n\nn n\nn\n\n2 2\nwhere\nn!\nk!(n - k)!\n\nn\n\n=\nk\nexpresses the number of possible ways we can choose k items from a pool of n distinguishable\nitems without regard to order. We can simplify this expression.\nn!\n(n - )!\n!6\n!4\n!2\nn! 1\n1 1\nn!\n=\n=\n\n...\n\nn\n\n=\n...\n...\n/ 2\n!4!2\n!2!2\n!0!2\n!2 !2\n!2\n!2!2\n!2 (n - )!\n!2 (n - )!\nn\nThis is not our final answer! This expression actually overcounts the number of arrangements\nbecause pulling out Cys7-Cys26 as the first pair, for instance, counts separately from pulling it\nout as the tenth pair. We have overcounted by a factor of (n/2)! which is the number of possible\norderings of n/2 pairs. Therefore, the number of arrangements is equal to:\nn!\nn!\n\n!\n!\nAlthough these two equations were derived in very different ways, they are numerically identical\nfor all n! Pretty neat.\n6.) Dill 1.23\n(a) These chances of winning given in the problem are conditional probabilities, i.e. the\nprobability of winning, given that the weather is good or bad. The approach here is to\nelucidate the four mutually exclusive and collectively exhaustive outcomes, winning and\ngood weather, P(W,G), winning and bad weather, P(W,B), losing and good weather,\nP(L,G), and losing and bad weather, P(L,B). These joint probabilities can be related to\n\nn\n/\n=\n/ 2\nn\n\nn\n/ 2\n2n\n\nthe conditional probabilities, P(W|G), etc. and the weather probabilities, P(G) and P(B)\nby the following equations:\nP(W,G) = P(W|G)P(G) = (0.7)(0.4) = 0.28\nP(W,B) = P(W|B)P(B) = (0.2)(0.6) = 0.12\nP(L,G) = P(L|G)P(G) = (0.3)(0.4) = 0.12\nP(L,B) = P(L|B)P(B) = (0.8)(0.6) = 0.48\n(Note that P(L|G) was computed from using the fact that P(W|G) + P(L|G) = 1.)\n( ,\n(b) P(B|L) =\nB\nL\nP\n)\nL\nP )\n(\nP(L) = P(L|G)P(G) + P(L|B)P(B) = (0.3)(0.4) + (0.8)(0.6) = 0.6\nTherefore, P(B|L) = 0.48/0.6 = 0.8 - there is an 80% chance there was bad weather, given\nthat they lost.\n7.) You have 4 boxes and 3 different (i.e., distinguishable) balls, which are Red, Yellow, and\nBlue.\na) If there is no restriction on the number of balls per box, how many different ways can the balls\nbe put in the boxes?\nOne might think this is like the problem we did in lecture on 2/6 - we could consider the 4 boxes\nas 3 walls that can be distributed between the balls. These walls are indistinguishable, however.\nSo, we have 6 objects in 4 categories: wall, R, Y, B. And there are 3 walls, 1R, 1Y, 1B. So,\n!6\nW =\n= 120. BUT, this overcounts for many situations. For example, this considers RY in\n!1!1!1!3\none box separately from YR in that box. Since I interpreted this problem such that one shouldn't\nbe able to tell the difference between the arrangements RY and YR in a box, you would have to\ndivide out for all pairs like this... And then for all triples like this... And this starts getting ugly.\nWhy not think about it more simply? How many ways can you place the R ball? 4... How many\nways can you place the Y ball? 4... The B ball? 4... So there are 43 = 64 ways the balls can be\nput into the boxes.\nb) If we impose a restriction that the first box must contain 2 balls, and the second box must\ncontain 1 ball, how many ways can this be achieved? First, write out all the possibilities. Then,\nwrite out the general formula you would use to calculate it, and see if it matches.\nAll the possibilities:\nBoxes: 1\n4 (boxes 3 and 4 always contain 0 balls because of the constraint)\nRY\nB\n\nRB\nY\n\nBY\nR\nGeneral formula:\nConsider that we have only two boxes available to our three balls, so this problem can be\nrewritten as: how many ways can you choose 2 balls to put in box 1 (out of a possible 3 balls)?\nOR how many ways can you choose 1 ball to put in box 2 (of a possible 3 balls)? The answer is\n!3\ngiven by \"3 choose 2\" or \"3 choose 1\" or\n3. (\"3 choose 1\" gives the same\n=\n=\n!2 (3- )!\nanswer).\n\nc) What is the probability that the situation in b) (2 balls in box 1, 1 in box 2) was achieved if the\nballs were thrown in randomly, as in a)?\nIn part (b) we discovered that there were 3 possible ways to achieve this situation. And in part (a)\nwe found that there are 64 possible ways the balls could fall randomly. So, the probability of\nachieving this situation is 3/64 = 0.047.\n8.) You have a genome that is exactly 1 × 109 bases long. You would like to choose a DNA\nsequence out of the genome that is unique. What is the minimum length of the sequence such\nthat it could be unique (i.e., it is possible that it does not occur anywhere else in the genome)?\nYou want the probability of seeing that exact sequence to be not greater than 1 in 1× 109.\nFor a 14mer:\n1⁄4 14 = 3.725 × 10-9 so this is not long enough\nFor a 15mer:\n1⁄4 15 = 9.313 × 10-10 so this is long enough to be unique!"
    },
    {
      "category": "Assignment",
      "title": "pset1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-011j-statistical-thermodynamics-of-biomolecular-systems-be-011j-spring-2004/608e7f461ba10ab71b862e3ba3ca217b_pset1.pdf",
      "content": "BE.011/2.772J\nStatistical Thermodynamics of Biomolecular Systems\nSpring 2004\nGriffith/Hamad-Schifferli\nProblem Set #1\nDue: 2/11/04\n\n7.) You have 4 boxes and 3 different (i.e., distinguishable) balls, which are Red, Yellow, and\nBlue.\na) If there is no restriction on the number of balls per box, how many different ways can the balls\nbe put in the boxes?\nb) If we impose a restriction that the first box must contain 2 balls, and the second box must\ncontain 1 ball, how many ways can this be achieved? First, write out all the possibilities. Then,\nwrite out the general formula you would use to calculate it, and see if it matches.\nc) What is the probability that the situation in b) (2 balls in box 1, 1 in box 2) was achieved if the\nballs were thrown in randomly, as in a)?\n8.) You have a genome that is exactly 1 ? 109 bases long. You would like to choose a DNA\nsequence out of the genome that is unique. What is the minimum length of the sequence such\nthat it could be unique (i.e., it is possible that it does not occur anywhere else in the genome)?"
    },
    {
      "category": "Assignment",
      "title": "pset2_solutions.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-011j-statistical-thermodynamics-of-biomolecular-systems-be-011j-spring-2004/1a63801f1051dbdeed82152ea49c8950_pset2_solutions.pdf",
      "content": "BE.011/2.772J\nStatistical Thermodynamics of Biomolecular Systems\nSpring 2004\nGriffith/Hamad-Schifferli\nProblem Set #2 Solutions\nDue: 2/11/04\nDill 2.1, 2.2, 2.3, 2.4, 2.5, 2.6\nProblem 1\nIn this problem we are trying to find the number of ways that we can select 15 sites to\ncontain particles, out of V total sites. Thus, we have two types of sites, those containing\nparticles and those that do not.\na)\nV = 20 sites\nW (\n,\n) =\n=\n,\nb)\nV = 16 sites\nW ( 16\n,\n) =\n= 16\nc)\nV = 15 sites\nW ( 15\n,\n) =\n= 1\nProblem 2\nAs the problem states, it is likely easier to maximize ln(W) rather than W.\nn\nW = n!(N\nN\n-\n!\nn)! p (1- p) N - n\nln(W ) = ln\n\nn!(N\nN\n-\n!\nn)! p n (1- p) N - n\n\n-\nn -\nln(W ) = ln N\nln(\n!\nln\n!\nN - n)!+ n ln p + (N - n)\nln( - p)\nIf we make the assumption that both N and n are large, we can use Stirling's\nx\napproximation:\n!\nln = x ln x - x\nln(W ) ≈ N ln N - N - n ln n + n - (N - n)ln(N - n) + (N - n) + n ln p + (N - n)\nln( - p)\nln(W ) ≈ N ln N - n ln n - (N - n)ln(N - n) + n ln p + (N - n)\nln( - p)\nNow, we take the derivative.\n\nd ln(W ) -\n≈ ln n - 1 + ln(N - n) + 1 + ln p -\nln( - p)\ndn\nd ln(W ) ≈ ln N - n + ln p\ndn\nn\n1 - p\nTo get the maximum, n *, set the derivative equal to zero.\nd\ndn ln(W ) = 0 = ln N\nn\n-\n*\nn *\n+ ln1 -\np\np\n- ln N -\n*\nn *\n= ln p\nn\n1 - p\n*\nln\nn\n= ln p\nN - n *\n1 - p\n*\nn\np\n=\nN - n *\n1 - p\n*\n⇒ n = Np\nProblem 3\nIn order to find both the maximum and minimum of V(x), we must find the roots of it's\nderivative.\nV (x) = x + 5x 2\n- 24x\nd V (x) = x 2 + 5x - 24\ndx\nd V (x) = (x - )(\n3 x + 8)\ndx\nSo now we know the roots are x = -8, 3, and we need to figure out which corresponds to a\nmaximum, and which to a minimum. An easy way to do this is using the second\nderivative test. (Recall, a negative second derivative means the function is concave down,\nand thus the point corresponds to a maximum, and a positive second derivative means\nconcave up, and thus a minimum.)\nd 2\nV (x)\n= 2(- 8) + 5 -\n= 11\ndx 2\nx=- 8\nd 2\nV (x)\n= 2(3) + 5 = 11\ndx 2\nx= 3\nThus, we can see that x = -8 is a maximum, and x = 3 is a minimum.\nProblem 4\n\nIn this problem we are asked to show that p(N)/p(2N) decreases as N increases.\n4N\nN\nN\np\n) =\n\n5.0\n5.0\n3N = (4N )!\n5.0\n4 N\n(\nN\nN!(3N )!\n(4N )!\n5.0\n4 N\np(2N ) = 4N 5.0\n2 N 5.0\n2 N =\n2N\n(2N )!(2N )!\n(N\np\n)\n(2N )!(2N )!\n5.0\n4 N\n(4N )!\n⇒\n=\n×\n×\np(2N )\nN!(3N )!\n5.0\n4 N\n(4N )!\n(N\np\n)\n(2N )!(2N )!\n=\np(2N )\nN!(3N )!\nSince we are concerned about how this ratio changes as N increase, let us assume that N\nn\nn\nis large, and thus we can use Stirling's approximation ( n!≈( ) ).\n(\ne\n2 N\n2 N\nN\np\n)\n(2 N )\n(2 N )\ne\ne\n=\nN\nN 3 N 3N\np(2N )\n( ) (\n)\ne\ne\n(\n× N 4 N ×( )\nN\np\n)\n4 N\n1 4 N\ne\n=\np(2N )\n33N × N 4 N ×( )\n4 N\ne\nN\np\n)\nN\np(\n(\n2N ) =\nN\np\n)\nN\n(\n=\n\np(2N )\nSo we can see that\n(N\np\n)\nN\nlim\n= lim\n\n= 0\nN →inf p(2N )\nN →inf27\nSo the binomial distribution becomes narrower and narrower as N goes to infinity.\nProblem 5\nIn this problem we have 4V lattice sites, and 2V white particles and 2V black particles to\nfill these sites. The probability of de-mixing is given by the number of ways to arrange\nall the white particles on one side divided by the total number of possible configurations.\nFor any V, there are only 2 ways to achieve perfect de-mixing, all white on the left side\n(and all black on the right), or all white on the right side (and all black on the left).\n\nW\np(demixing) =\ntot\n,\n4V\n(4V )!\n\nwhere Wtot =\n2V\n= (2V )!(2V )!\np(demixing) = 2(2V )!(2V )!\n(4V )!\nAgain we can use Stirling's approximation to get\n2V )2V (2V )2V\ne\ne\np(demixing) ≈ 2(\n)4V\n4V\n(\ne\np(demixing) ≈ 2(2)4V\n(4)4V\np(demixing) ≈ 2 1\n4V\nFor large V,\n(\n4V\nlim p(demixing) ≈\n5.0\nlim\n)\n= 0\nV\ninf\n→\nV\ninf\n→\nThus, as the number of sites increases, it is increasingly unlikely that the particles will\nexist in an unmixed state.\nProblem 6\nThe first step is to determine the equilibrium points of the energy function. Again, we\nfind the roots of the derivative.\nd V (θ ) = - sin(θ )\ndθ\nd V (θ ) = 0\ndθ\n±\n±\n⇒θ = nπ for\n,\nn = ,0\n,1\n,...\nThe unstable equilibrium points are local maxima, and the stable equilibrium points are\nlocal minima. To determine which are maxima and minima, use the second derivative\ntest.\nd 2\nV (θ ) = - cos(θ )\ndθ\nSo for even values of n, the second derivative is negative, corresponding to local maxima.\nThusθ = nπ for\n,\nn = ,0\n,2\n...\n4 are unstable equilibrium points\n±\n±\nandθ = nπ for\n,\nn = ,1\n,3\n...\nare stable equilibrium points.\n±\n±\nOf course, this could be easily done by plotting out the energy function and identifying\nthe maxima and minima. For the energy function in this question, the stable and unstable\nequilibrium points can be easily obtained."
    },
    {
      "category": "Assignment",
      "title": "pset2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-011j-statistical-thermodynamics-of-biomolecular-systems-be-011j-spring-2004/cdf9a3ac235ce138e100010d96691cfa_pset2.pdf",
      "content": "BE.011/2.772J\nStatistical Thermodynamics of Biomolecular Systems\nSpring 2004\nGriffith/Hamad-Schifferli\nProblem Set #2\nDue: 2/11/04\nDill 2.1, 2.2, 2.3, 2.4, 2.5, 2.6"
    },
    {
      "category": "Assignment",
      "title": "pset3_solutions.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-011j-statistical-thermodynamics-of-biomolecular-systems-be-011j-spring-2004/b5d2f47349bb36ad73ed314059130c04_pset3_solutions.pdf",
      "content": "BE.011/2.772\nProblem Set 3\nDue March 3, 2004\n1. Dialysis is common laboratory procedure used to remove low molecular weight solutes from protein\nsolutions. Example situations include: removal of removal of free, unreacted label after\nfluorescently labeling a protein; and removal of urea from a denatured protein solution to allow\nrefolding of the protein. The protein solution is sealed inside a dialysis bag or tubing and placed in\ncontainer with a large excess of pure water, as shown in the figure. The system is then allowed to\ncome to equilibrium. For this problem, consider an idealized system where the only solute in the\ndialysis bag is the low molecular weight solute (i.e., no protein is actually present.)\nInitial state\nEquilibrium\nstate\n(a) Explain why the combined system of the protein solution (system \"A\") and the water (system \"B\")\nmay be considered to be an isolated system.\nThe combined system can be considered an isolated system because neither the total matter, energy\nor volume changes. System A or B individually are open systems.\n(b) Use a lattice model, with each individual water molecule occupying a single site in the lattice, to\nshow that the entropy of System B is zero at the start of the experiment. Designate the number of\nwater molecules NWB and the number of total lattice sites MB.\nW = M B\nM B!\nNwB\n\n= ( M - NwB ) !N !\nB\nwB\nSince this is a liquid, we can assume that a molecule must occupy every site, so MB=NwB, we get\nM B!\nW = ( M - M B ) !M ! = 1\nB\nB\nS = k lnW = 0\n(c) Use a lattice model to express the entropy of system A at the start of the experiment in terms of the\nnumber of water molecules in system A, NwA, the number of solute particles, Ns, and the total\n\nnumber of lattice sites in system A, MA. For your final expression, use an appropriate\napproximation to eliminate factorial expressions. You may assume that the water molecules and\nsolute molecules are comparable in size.\nAgain assume that a molecule must occupy every site, so MA=Ns+NwA, we get\nM A!\nW = N !NwA!\ns\nUsing Stirling's approximation,\nM A\nM A\nM A\n(\ne )\n(M )\nW =\n=\nA\nNwA\nNS(\ne )\nNS (NwA e )\nNwA\n(N )\nNS (N )\nS\nwA\nM A\n\n(M )\nA\nS = k lnW = k ln\n(N ) (N )\nNwA\n\nNS\nS\nwA\nBut MA=NS+NwA, so\nM A\n\n(M )\nA\nS = k lnW = k ln\nM A -NwA (N )\nNwA\n\n(M - NwA )\nA\nwA\n(d) Now write an expression for the entropy of the combined system under the conditions where water\nand solute can freely pass through the dialysis membrane. For every solute molecule that crosses\nover to system B, a water molecule must cross over to system A. (You may want to keep track of\nthe number of solute molecules by noting that NS =NSA+ NSB and the number of water molecules by\nnoting that NWA + NWB = NW).\n\nM A!\nM B!\n\nA\nS = k ln\nW\nW\nB = k ln(M - NSA )!N ! (M - NSB )!NSB!\nA\nSA\nB\n(e) Show that you can write the entropy expression in terms of one system variable (i.e., one parameter\nthat changes value during the progress of the experiment), and briefly describe how to determine the\nequilibrium condition in terms of that variable and constants in the system. [You do not need to\nwork out the equilibrium condition (lots of algebra involved) but feel free to predict what it is if you\nlike.]\nWrite entropy in terms of NSA.\nNS = NSA + NSB\nS = k ln\n\nM A!\nM B!\n\n(M - NSA )!N ! (M - NS + NSA )!(N - NSA )!\nA\nSA\nB\nS\nIn order to determine the equilibrium point, use Stirling's approximation to simplify the expression,\nand then take the derivative.\n\nM A\nM A\nM B - NS + NSA ( N - NSA )\nNS - NSA\nS = k ln\n( M - NSA )\nM A - NSA NSA\nNSA ( M - NS + NSA )\nM B\nM B\nA\nB\nS\n\nS\nk = M A ln M A -( M A - NSA ) ln( M A - NSA )- NSA ln NSA + M B ln M B\n-( M - NS + NSA ) ln( M - NS + NSA )-( N - NSA ) ln( N - NSA )\nB\nB\nS\nS\ndN\nk\n1 dS = 0 + ln( M A - NSA )+ 1- ln N - 1+ 0 - ln( M - NS + NSA )- 1+ ln( NS - NSA )+ 1\nSA\nSA\nB\n( M - NSA )( N - NSA )\nA\nS\n= ln NSA ( M - NS + NSA )\nB\nSet derivative equal to zero.\n( M - NSA )( N - NSA )\nA\nS\n0 = ln NSA ( M - NS + NSA )\nB\n⇒( M - NSA )( N - NSA ) = N ( M - NS + NSA )\nA\nS\nSA\nB\nDividing both sides by MAMB, and substituting in NSB=NS+NSA\n( M - NSA )( N )\nNSA ( M - NSB )\nA\nSB =\nB\nM\nM\nB\nM\nM\nB\nA\nA\n\n1- NSA NSB = NSA 1- NSB\n\nM A M B\nM A\nM B\nNSA\nNSB\n=\nM A\nM B\nWhen this is the case, the concentrations are equal.\n(f) Is work done in the approach to equilibrium? Explain why or why not.\nWork is not done in the approach to equilibrium, because there is no volume change associated with\neither system.\nδ w = pdV = .0\n(g) Does the internal energy U of the system change? Explain why or why not.\nSince we are assuming an isolated system, no energy or matter can flow in or out, so the internal\nenergy cannot change.\na) For a van der Waals gas, the work done is\nδ wvdW = - PdV\nV2\nV2\n= -∫ PdV = -∫\nRT - a\n2 dV\nwvdW\nV - b\nV\nV1\nV1\n= RT ln V1 - b\n+ a\n1 - 1\n\nV2 - b\nV1\nV2\n7.1\n\n7.3\nb) For an ideal gas, the work done is\nδ wideal = - PdV\nV2\nV2 RT\nwideal = -∫ PdV = -∫\ndV\nV\nV1\nV1\n= RT ln\nV1\n\nV2\nIf we are compressing the gas, then V1>V2, so\nln V1 - b\n< ln\nV1\n\nV2 - b\nV2\na 1\n-\n> 0\nV1\nV2\nThus we need to delve a little deeper to see which type of gas requires more work to compress. When\nthe gas is less dense, the volume is large, and the logarithmic term dominates. Since the logarithmic\nterm for the van der Waals gas' expansion is less than that for the ideal gas, at the low density limit it\ntakes less work to compress a van der Waals gas. When the density is high, the volume is low, so the\n1/V term is dominant, and thus the van der Waals gas requires more work to compress.\na) Here, we are considering change in volume (freezing) of water under constant (atmospheric)\npressure. So the work is given by\nδ w = - PdV\nV2\n(\nw = -∫ PdV = - V\nP\n2 - V )\nV1\nWe thus need to know the volume of the water before and after freezing. Since we are given the initial\nvolume, and the densities before and after freezing, this is a simple calculation.\n- 6\nV1 = ( 2cm) = 8cm3 = 8× 10 m\nm1 = m2 = m = ( 2cm) 000\n.1\ng\n= 8g\ncm\nV2 =\nm\ng\n= 743\n.8\ncm3 =\n.8\n- 6 m\n×\n.0\ncm\nNow it is a simple matter of plugging into the formula, and calculating out the result. Recall that 1 atm\nis 101 325 Pa, a Pascal is a\n×\n- 6\nNewton per meter squared, w = -( 1atm)(\n.8\nm - 8× 10- 6 m )\nand that a Joule is a\n= -( 101325\n×\nm\nN\n- 6\n)(\n.8\nm - 8× 10- 6 m )\nNewton meter.\n= - 074\n.0\nJ\nb) This is work done by the expansion of the water into ice, so 0.074J of work is done by the system, or\n-0.074J of work is done on the system.\n\n7.4\na) We start with the equation for differential entropy.\nP\ndS =\ndU +\ndV -∑\nμ j dN j\nT\nT\nT\nη RT\nFor dependence on V, assume dU=dNj=0. Also P =\nfor an ideal gas.\nV\nP\nη k\ndS =\ndV =\ndV\nT\nV\nV2ηk\n∆ S = ∫\ndV =ηk ln\nV2\n\nV1 V\nV1\nb) For the volume doubling, the entropy change is\n∆ S =ηk ln 2 = - 69\n.0\nηk\n7.5\nFrom 7.1, we have\nw =ηRT ln V1\n\nV2\n=ηRT ln 1 = - 69\n.0\nηRT\n7.7 Here will we assume that we are dealing with an ideal gas.\nStep 1 - Constant volume\nδ w1 = -PdV\nThere is no volume change, so w1=0.\nStep 2 - Constant pressure\nδ w2 = - PdV\nV2\n(\nw2 = -∫ PdV = - V\nP\n2 - V )\nV1\n= - (300atm 2\n)( cm3 - 1cm3)\n×\n- 6\n= -(\n*\nN )( 10\nm )\nm\n= -\n4.\n30 J\nStep 3\n\nAgain, there is no volume change, so w3=0.\nStep 4\nδ w2\n-\n= PdV\nV2\n(\nw2\n-\n= ∫ PdV\n-\n=\nV\nP\n2 - V1 )\nV1\n-\n= (100atm 1\n)( cm3 - 2cm3)\n-\n= (\n*\nN )(\n×\n-\n- 6 m )\nm\n=\n1.\n10 J\nSo,\n= w1 + w2 + w3 + w4\nwnet\n= 0 -\n4.\n30 J + 0 +\n1.\n10 J\n-\n=\n3.\n20 J\nThis means that 20.3J of work is done by the system.\n7.8\nTc\nFor a Carnot engine, the efficiency η is given by η\n-\n≤ 1\n.\nTh\na) for Th = 380K and Tc = 273K\nη\n-\n≤\n≤ 282\n.0\nb) for Th = 380K and Tc = 323K\nη\n-\n≤\n≤ 15\n.0"
    },
    {
      "category": "Assignment",
      "title": "pset3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-011j-statistical-thermodynamics-of-biomolecular-systems-be-011j-spring-2004/7f96309469d8dab01b612f9dc81243fc_pset3.pdf",
      "content": "BE.011/2.772\nProblem Set 3\nDue March 3, 2004\n1. Dialysis is common laboratory procedure used to remove low molecular weight solutes from protein\nsolutions. Example situations include: removal of removal of free, unreacted label after\nfluorescently labeling a protein; and removal of urea from a denatured protein solution to allow\nrefolding of the protein. The protein solution is sealed inside a dialysis bag or tubing and placed in\ncontainer with a large excess of pure water, as shown in the figure. The system is then allowed to\ncome to equilibrium. For this problem, consider an idealized system where the only solute in the\ndialysis bag is the low molecular weight solute (i.e., no protein is actually present.)\n(a) Explain why the combined system of the protein solution (system \"A\") and the water (system\n\"B\") may be considered to be an isolated system.\n(b) Use a lattice model, with each individual water molecule occupying a single site in the\nlattice, to show that the entropy of System B is zero at the start of the experiment. Designate\nthe number of water molecules NWB and the number of total lattice sites MB.\n(c) Use a lattice model to express the entropy\nof system A at the start of the experiment\nin terms of the number of water molecules\nin system A, NwA, the number of solute\nparticles, Ns, and the total number of lattice\nsites in system A, MA. For your final\nexpression, use an appropriate\napproximation to eliminate factorial\nexpressions. You may assume that the\nwater molecules and solute molecules are\ncomparable in size.\n(d) Now write an expression for the entropy of\nthe combined system under the conditions where water and solute can freely pass through the\ndialysis membrane. For every solute molecule that crosses over to system B, a water\nmolecule must cross over to system A. (You may want to keep track of the number of solute\nmolecules by noting that NS =NSA+ NSB and the number of water molecules by noting that\nNWA + NWB = NW).\n(e) Show that you can write the entropy expression in terms of one system variable (i.e., one\nparameter that changes value during the progress of the experiment), and briefly describe\nhow to determine the equilibrium condition in terms of that variable and constants in the\nsystem. [You do not need to work out the equilibrium condition (lots of algebra involved)\nbut feel free to predict what it is if you like.]\n(f) Is work done in the approach to equilibrium? Explain why or why not.\n(g) Does the internal energy U of the system change? Explain why or why not."
    },
    {
      "category": "Assignment",
      "title": "pset4_sol_pt2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-011j-statistical-thermodynamics-of-biomolecular-systems-be-011j-spring-2004/3832f1c1d99ada31d54e4ef6d434227c_pset4_sol_pt2.pdf",
      "content": "More problems from Dill: 8.8, 8.12, 8.13\n(Problem Set 4, part 2)\n8.8) Computing enthalpy and entropy with a temperature dependent heat capacity.\nThe heat capacity for liquid n-butane depends on temperature:\nT\nC\n) = a + bT , where\n(\nP\na=100LK-1mol-1 and b=0.1067JK-2mol-1, from its freezing temperature Tf=140K to\nTb=270K, its boiling temperature.\n(a) Compute ∆H for heating liquid butane from TA=170K to TB=270K.\nT 2\nT 2\nbT 2\n∆H = ∫\ndT\nC\n= ∫ adT + ∫ bTdT =\nT\na\n+\n∆\n=\np\nT1\nT1\nb\nkJ\na(270K - 170K) + 2 270\n[(\nK)2 - (170K)2] =\n.\nmol\n(b) Compute ∆S for the same process.\nT 2\nT 2\n∫\nC\nln\n\nT2\nT1\n\ndT\nb\na\n\na\nP\n∆S =\ndT\n+\nT\nb∆ =\n∫\n+\n=\n=\nT\nT\nT1\nT\nJ\nKmol\nK\nJ\n2 mol\nK\nJ\nKmol\n\nln\n\n+\n\n.0\n\n(100 K =\n)\n.\nK\n8.12) ∆S for an adiabatic expansion of a gas. In an adiabatic quasi-static expansion of\nan ideal gas, how do you reconcile the following two facts: (1) the increase in volume\nshould lead to an increase in entropy, but (2) in an adiabatic process, δq=0 so there\nshould be no change in entropy (since dS = δq = 0 )?\nT\nThe reason there is not a contradiction here is that the first statement is not the whole\nstory. Entropy is not only a function of volume but also of temperature. It is true that if\nwe increase the volume of a gas at constant temperature, the entropy should increase.\nHowever, this would not be a quasi-static, adiabatic process. In a process where δq=0,\nthere is a simultaneous reduction in temperature which decreases the entropy enough to\ncompensate for the entropy increase induced by the volume change. Mathematically we\ncan observe this phenomenon as follows, and observe how these volume and temperature\nchanges relate such that dS = 0. Expand the differential entropy element dS in terms of its\npartials and integrate:\nP\nCV\ndS\ndT\n\nV\ndT +\n\ndS\ndV\n\nT\ndV\n\n∫ dS = ∫\ndV\ndT\n= ∫\n+ ∫\n\nT\nT\nV 2 Nk\nT 2\nV 2\nT2\n= ∫ V dV + ∫\nCV dT = Nk ln\n+ CV ln\n= 0\nT\nV1\nT1\nV1\nT1\n8.13) A thermodynamics cycle for mutations in protein folding. Suppose that you can\nmeasure the stability of a wild-type protein, ∆G1 = Gfolded - Gunfolded, the free energy\n\ndifference between folded and unfolded states. A mutant of that protein has a single\namino acid replacement. Design a thermodynamic cycle that will help you find the free\nenergy difference ∆G2 = Gunfolded, mutant - Gunfolded, wildtype, the effect of the mutation on the\nunfolded state.\nBefore you see the solution, assume the following information as well, and try this\nproblem! (It's a pretty easy problem, they just left out some crucial information.) (1)\nAssume you can also measure ∆G1' = Gfolded, mutant - Gunfolded, mutant. This isn't too\nunreasonable considering that you can do it for the wildtype. (2) ALSO assume that you\ncan estimate ∆G2' = Gfolded, mutant - Gfolded, wildtype by computer simulation. You need this\ninformation to solve this problem. Make sure you understand WHY this information is\nneeded!\nWe know that G is a state function, so it does not depend on the path you use to get from\nstate-to-state. If you have measured how much energy it takes to get from state 1 to 2\nalong one path, then you can use this energy again to figure out the components of\nanother path. (As long as you have enough information to get your unknowns!)\n∆G2\nunfolded\nunfolded\nmut\nwt\n∆G1\n∆G1'\nfolded wt\nfolded mut\n∆G2'\n∆G1 + ∆G2' = ∆G1' + ∆G2 so:\n∆G2 = ∆G1 - ∆G1' + ∆G2'"
    },
    {
      "category": "Assignment",
      "title": "pset4_solutions.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-011j-statistical-thermodynamics-of-biomolecular-systems-be-011j-spring-2004/413e658d0bce09f219a88f111495fbb7_pset4_solutions.pdf",
      "content": "BE.011/2.772\nProblem Set 4 Solutions\nDue March 8, 2004\nDill 8.3, 8.4, 8.5, 8.6\n8.3) The difference between the energy and enthalpy changes in expanding an ideal\ngas. How much heat is required to cause the quasi-static isothermal expansion of one\nmole of an ideal gas at T = 500 K from PA = 0.42 atm, VA = 100 L, to PB = 0.15 atm? To\nstart with, we know that for an ideal gas in an isothermal process, dU = δ q + δ w = 0. For\nsuch a process, when it is also quasi-static, we also know that δ w = -PdV. Therefore\nnRT\nq = ∫ PdV . We substitute the ideal gas law for P and we get: q = ∫ V\ndV = nRT ln VA .\nVB\na) What is VB?\nV\nP\n*\n.0\nBy the ideal gas law, so PA = VB so VB =\nA\nA\n=\n= 280L\nPB\nVA\nPB\n.0\nWe can use VB to calculate the heat:\nnRT\nq\nln VA =\n1mol\n-\n8.314JK\n*\n1mol\n500Kln\n*\n-\n= 4280J\n=\nVB\nSince q is positive, heat is flowing into the system during the process. (Note that this\ncorresponds to work being done by the system.)\nb) What ∆ U for this process?\n∆ U = 0 for an isothermal process on an ideal gas since ∆ U = CV∆ T = 0.\nc) What ∆ H for this process?\nH = U+PV so ∆ H = ∆ U+∆( PV)\nWe already established that ∆ U = 0. For an ideal gas at constant temperature it's also\ntrue that PV is constant (PV = nRT). So, ∆ H = 0.\n8.4) The work and the heat of boiling water. For the reversible boiling of five moles of\nliquid water to steam at 1000C and 1 atm pressure, calculate q. Is w positive or negative?\nWe can get the answer from tables that give the heat of vaporization of water (the answer\nfor 1000C is given in example 8.7 but you could also use Google). Also, from the\nperiodic table we know that water weighs 18 g/mol.\nqboiling = -qcondensation = 1∆ Hcondensation\n= 540 cal 18 g\n5moles = 48600cal\ng\nmole\nV 2\n(\n(\nAt constant pressure, w\n-\n=\nPdV\n-\n=\nV\nP\n2 - V1)\n-\n=\nV\nP\ngas - Vliquid )\n∫V1\nAnd Vgas >> Vliquid, so Vgas - Vliquid is positive, so w is negative. Note that negative w\nmeans the system is doing work on the surroundings.\n\n8.5) The entropy and free energy of gas expansion. Two moles of an ideal gas undergo\nan irreversible isothermal expansion from VA = 100 liters to VB = 300 liters at T = 300K.\na) What is the entropy change for this process?\ndqrev\n∆ S = ∫ T\nSince S and U are state functions, we needn't be concerned that the actual process\nis irreversible (read: complicated). We can choose any path to calculate state\nfunctions so we invent an isothermal, quasi-static process to get qrev.\n∆ U = 0 ⇒ q\n-\n= w\n= nRT ln V2 .\nrev\nrev\nV1\nFor an isothermal process,\ncal\ncal\nrev\n∆ S = q\n= nRln V2 = (2moles 2\n)(\n)ln\n= 39\n.4\nT\nV1\nmolK\nK\nb) What is the Gibbs free energy change?\n-∆\n∆ G\n∆\n=\nS\nT\nH\n. For an isothermal process on an ideal gas, ∆ H=0. (Note that\n∆H\n∆\n= U\n∆\n+ (PV ) and for an isothermal process, ∆ U=0, and\n∆ (PV )\n∆\n= (nRT ) = 0 , so ∆ H=0.)\ncal\nS\nT\n-\n= (300K\n.4\n)(\n)\n-\n=\n.\ncal\n∆ G\n∆\n-\n=\nK\n8.6) The free energy and entropy of membrane melting. We have a phospholipid\nmembrane that \"melts\" at Tm = 410C = 314K. Reversible melting experiments indicate\nthat ∆ Hm = 9 kcal mol-1.\na) What is the entropy of melting?\nm\n∆ S\n= ∆ H\n= 9kcal * mol - 1\n=\n7.\n28 cal * mol - 1 K - 1\nm\nT\n314K\nb) What is the free energy of melting?\n∆ G = 0 because during a reversible phase transition, the two phases are in\nequilibrium. Also, ∆ G = ∆ H - T∆ S, and plugging in our numbers from above, ∆ G=0.\nc) Does the membrane become more or less ordered on melting?\n∆ Sm > 0 so the entropy increases as we melt the membrane. Thus it becomes less\nordered during melting.\nd) If there are 32 rotatable bonds in each phospholipid molecule, what is the increase\nin multiplicity on melting one mole of bonds?\nFirst, if there are 32 rotatable bonds in each molecule, then one mole of phospholipid\ncorresponds to 32 moles of bonds. Thus, the entropy change per mole of bonds during\nmelting is 28.7/32 = 0.897 cal mol-1 K-1.\n\nln\nW\nW = ∆ =\n=\nS\nK\n.0 897\n.2 71e23\n.3 30e - 24"
    },
    {
      "category": "Assignment",
      "title": "pset4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-011j-statistical-thermodynamics-of-biomolecular-systems-be-011j-spring-2004/a38017d70adce75ef69d0729b10e7dfc_pset4.pdf",
      "content": "BE.011/2.772\nProblem Set 4\nDue March 8, 2004\nDill 8.3, 8.4, 8.5, 8.6"
    },
    {
      "category": "Assignment",
      "title": "pset5_solutions.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-011j-statistical-thermodynamics-of-biomolecular-systems-be-011j-spring-2004/b82e32fb6e88f94cc2797b33cead325c_pset5_solutions.pdf",
      "content": "9.1\n\nBE.011/2.772\nProblem Set 5\nDue March 17, 2004\nDill 9.1, 9.3, 9.8 and 9.10\nT\na) We are given γ ( ) = b - cT , and the values of the constants b and c. We also know that\ndU = TdS - pdV +γ da . We want to get an expression for γ in terms of a derivative of the Gibbs free\nenergy, so we must first get an expression for the Gibbs free energy.\nG = H - TS = U + pV - TS\ndG = dU + pdV + Vdp - TdS - SdT\n-\n= SdT + Vdp +γ da\nTo get an expression for γ in terms of a derivative of the Gibbs free energy, we merely have to take the\nderivative of G with respect to a at constant T and p.\n∂ G\n\n= γ\n∂ a T\np ,\nb) We know that\n∂ S\n∂\n∂ G\n\n=\n-\n\n∂ a T\np\n∂ a\n∂ T\n,\nSwitching the order of the derivatives we get that\n∂ S\n∂ 2G\n∂\n∂ G\n∂γ\n\n-\n=\n\na\nT\n\n-\n=\n-\n\n-\n=\n\n∂ a T\np\n\n∂\n∂\n∂ T\n∂ a\n∂ T a\np\n,\n,\nerg\n= c =\n.\nBut we know that - ∂γ\nis non-other than c. So\n∂\n∂\nS\na\n\nT\np\ncm 2 deg .\n∂ T a\np\n,\n,\nc)\n∂ S\n∆ S ≈\n∆ a = c∆ a\n∂ a\nerg\n\no 1cm\n≈( 167\n.0\n) A\n8 o\ncm2 deg\n\nA\n\n≈ 68\n.\n× 10-\ndeg\nerg\n\n∂ U\n9.3\nWe are given that ∂ U = 0 , and we are asked to show that this implies that CV =\nis\n∂ V T\n∂ T V\n∂ ∂ U\nnot a function of V. For this, we need only prove that ∂ CV =\n\n= 0. But we know that we can\n∂ V\n∂ V ∂ T V\n∂ ∂ U\npermute the order of the derivatives, so we get that ∂ CV = ∂ ∂ U =\n\n= ∂( ) = 0 . Thus,\n∂ V\n∂ V ∂ T V\n∂ T ∂ V T\n∂ T\nthe constant volume heat capacity of an ideal gas is independent of volume.\n∂ f\n9.8 The first thing to note is that if we take the cross derivatives of dU, we end up getting\n\n∂ p\n,\n\n0 S\nE\nrather than\n\n∂\n∂\np\nf\n\nT\nE\nwhich we want. We need to first transform our equation to a new energy variable\n,\nX(T,f,E).\ndU = TdS + fdl + Edp0\nX = U - TS - fl - Ep0\ndX = SdT - ldf -\ndE\np0\nNow if we take the cross derivatives we can get an expression for ∂ p\n.\n∂ f\nT\nE,\n∂ p\n∂ l\n\n=\n∂ f T\nE\n∂ E\n,\n,\nT\nf\nThis is useful, because we are likely able measure how the length of the crystal changes with the field\n∂ l\n\n.\n∂ E\n,\nT\nf\n9.10\na) The first thing to note in this question is that we are considering T and p as variables (which we end\nup holding constant). That means that we need to use the Gibbs free energy.\nG = H - TS = U + pV - TS\ndG = dU + pdV + Vdp - TdS - SdT\n-\n= SdT + Vdp + fdl\nNow we want to create a Maxwell relation between S and f in order to get a function for S.\n\n∂ G ∂ G\n\nT\nl\n\n∂\n∂\n∂\n∂\n=\nl\nT\n∂ ∂ G\n∂∂ G\n\n=\n\n∂ l ∂ T p\nl\n∂ T ∂ l p\nT\n,\n,\n∂ S\n∂ f\n-\n\n=\n\n,\n,\n∂ l p\nT\n∂ T l\np\n∂ S\n-\n=\n∂(\nl\naT - l ))\n\n(\n∂ l p\nT\n∂ T\n,\n(\n-\n=\nl\na - l0 )\nl\n( ) = - l\na - dl\nl\nl\nS\n∫\n(\n)\nl0\n(\n( ) -\n=\nl\na - l0 )\nl\nS\nSo the entropy is proportional to the square of the extension distance.\nH = U + pV\ndH = dU + pdV + Vdp\n= TdS + Vdp + fdl\ndH\ndS\n\n= T\n\n+ f\n,\n,\ndl p\nT\ndl p\nT\n(\n(\n= T (- l\na - l ))+\nl\naT - l )\n= 0\nSo H is constant for all extensions l.\nb) Since we are told that it is an adiabatic process (δ q=0, so dU=δ w=fdl), we know that we need to start\nwith the expression for internal energy U. We also know that by definition, for constant volume\ndU=CvdT.\ndU = fdl\ndT\nC\n=\nl\naT - l0)dl\n(\nv\nCv dT =\nl\na - l0)dl\n(\nT\nT2 C\nl\n∫ T\nv dT = ∫ l\na - l0)dl\n(\nT1\nl0\n(\nC ln\nT2 =\nl\na - l0 )\nv\nT1\n(\nT2\nl\na - l0 )\nT1\n= exp\n\n2Cv"
    },
    {
      "category": "Exam",
      "title": "quiz1_rev_prob.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-011j-statistical-thermodynamics-of-biomolecular-systems-be-011j-spring-2004/fd23d6f0e79bc9b7e4dc9522573e8411_quiz1_rev_prob.pdf",
      "content": "Quiz Review Problems: 3.2, 6.1, 6.4, 6.10 Solutions\n3.2 Equalizing energies. For the two 10-particle two-state systems of Example 3.4,\nsuppose the total energy to be shared between the two objects is U = UA + UB = 4. What\nis the distribution of energies that gives the highest multiplicity?\nFor this problem, don't make any assumptions about the starting positions of the particles\n(as they have in example 3.4), you just want to know how to distribute the particles in the\ntwo systems so that the total U=4. However, we can assume the systems are of the same\nformat (the first energy level is e=0 and the second is e=1) and that there are again 10\nparticles in each system. And, let's denote the number of particles in state i by ni. So, the\nmultiplicity of each system individually is:\n\n!\nn !(10 - n )!\n\nW =\n\nso the total multiplicity is:\n\n(\n!\n10 ) 2\n!\n!\n=\nWtot\n=\n!(10 - n ,1 A)!\n!(10 - n ,1 B )!\n!(10 - n ,1 A)!(4 - n ,1 A)!(6 + n ,1 A)!\nn ,1 A\nn ,1 B\nn ,1\n\nA\nWe can evaluate this for all possible values of n1,A:\nn1,A\nW\n6.1 Calculating the entropy of dipoles in a field. You have a solutions of dipolar\nmolecules with a positive charge at the head and a negative charge at the tail. When there\nis no electris field applied to the solution, the dipoles point north (n), east (e), west (w), or\nsouth (s) with equal probabilities. The probability distribution is hown in Figure 6.7(a).\nHowever when you apply a field to the solution, you now observe a different distribution:\nthe dipole points north with probability 7/16, east or west with probability 1⁄4 and south\nwith probability 1/16.\n(a) What is the polarity of the applied field? (In which direction does the field have\nits most positive pole?)\nThe positive heads of the dipole should point away from the positive pole of the\nfield. Therefore the field must have its positive pole to the south.\n(b) Calculate the entropy of the system in the absence of the field.\nUse the formula: S\n-\n= k∑ p log p\ni\ni\ni\nSince all directions are equally likely, S = -k*4*(1⁄4 log 1⁄4) = klog4.\n(c) Calculate the entropy of the system in the applied field.\n16 log\n4 log\n16 log\n\n= k(\nlog\n- 7\nlog ) ≈ 228\n.1\n\nS\nk\n-\n=\n*\n2 (\n)\nk\n+\n+\n(d) Does the system become more ordered or disordered when the field is applied?\n\nThe entropy decreases when the field is turned on so the system becomes more\nordered.\n6.4 Calculating the entropy of mixing. Consider a lattice with N sites and n green\nparticles. Consider another lattice, adjacent to the first, with M sites and m red particles.\nAssume that the green and red particles cannot switch lattices. This is state A.\n(a) What is the total number of configurations WA of the system in state A?\nN !\nM !\nWA = WN *WM =\n-\n!(\nn !(\nn\nN\n)!\nM\nm\n- m )!\n(b) Now assume that all N+M sites are available to all the green and red particles.\nThe particles remain distinguishable by their color. This is state B. Now what is\nthe total number of configurations WB of the system?\nWB =\n(N + M )!\n! !(\n-\nN\nm\nn\n+ M -\nm\nn\n)!\nNow take N=M and n=m for the following two problems:\n(c) Using Stirling's approximation on page 56, what is the ratio WA/WB?\n2 N\n2 N - 2n\nN\ne\n\n2N - 2n\ne\n\n2 N - 2\nW\nW\nA\nB\n=\nN !\n\nN\n(n !) (2\nn\n-\n)!\nn\n\n≈ 2 - 2\n≈\n≈\nn\n\nn\nN\n)!\n-\n\n2 N\n2 N - 2\nN\nN\nn !(\n(2 )!\nn\n2N\ne\n\nn\nN -\ne\n\n(d) Which state, A or B has the greatest entropy? Calculate the entropy difference\ngiven by: ∆ S = SA - SB = kln(WA/WB).\nW\n≈\nso SA < SB.\n6.10 Maximum entropy for a three-sided die. You have a three-sided die, with\nnumbers 1,2 and 3 on the sides. (So the values we can observe are ε 1=1, ε 2=2, ε 3=3. For a\nseries of N dice rolls, you observe an average score <ε > per roll using the maximum\nentropy principle.\n(a) Write expressions that show how to compute the relative probabilities of\noccurrence of the three sides, n1*/N, n2*/N and n3*/N, if α is given.\nLike the example in the book, we can use the Boltzmann probabilities to maximize the\n-βε i\nentropy. So the general form for each probability is: p = e\ni\n∑\n-βε i\ne\ni = 1\nx\nx\nTo simplify, take x = e-β so p =\nx\n, p =\n, p =\nx + x 2 + x3 .\nx + x 2 + x\nx + x 2 + x\nx + 2x 2 + 3x 3\n\n- 2\nA\n=\n∆\nS\nS\nS\nk\nk\nnk\n-\nlog\nlog\n-\n≈ 2\nlog\nn\n<\n=\nA\nB\nWB\nε\nε\ni\ni p\nso α\nWe know that:\n= ∑\n=\nx + x 2 + x\ni = 1\nWe can solve this for x in terms of α by using the quadratic equation:\n\n)\n(\n)\n(\nα\nα\nα\nα\nα\nα\nα\n-\n+\n-\n+\n-\n=\n-\n-\n-\n-\n+\n-\n=\nx\n)(\n2(3-α)\n2(3 -α)\nTo get the probability of turning up a 1, 2, or 3, we would first calculate x and then\nplug back in to the equations for p1, p2, and p3.\n(b) Compute n1*/N, n2*/N and n3*/N if α=2.\nx=1 so p1=p2=p3 = 1/3.\n(c) Compute n1*/N, n2*/N and n3*/N if α=1.5.\n13 - 1\nx =\n≈ 4343\n.0\nso p1= 0.6162 p2= 0.2627 and p3 = 0.1162\n(d) Compute n1*/N, n2*/N and n3*/N if α=2.5.\n13 - 1\nx =\n≈ 3028\n.2\nso p1= 0.1162 p2= 0.2627 and p3 = 0.6162."
    },
    {
      "category": "Exam",
      "title": "quiz1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-011j-statistical-thermodynamics-of-biomolecular-systems-be-011j-spring-2004/07fbae8c84532642bbc0f39cea2ecc25_quiz1.pdf",
      "content": "Page 1 of 6\nName:\nBE.011/2772J\nSpring 2004\nQUIZ I\nFebruary 23, 2004\nYou have 1 hour for this exam.\nCLOSED BOOK\n1 page notes allowed\n1 (10points)\n2 (5 points)\n3 (25 points)\n4 (60 points)\ntotal (100 points)\nk = 1.38 × 10-23 J/K\nContinued on next page....\n\nPage 2 of 6\nName:\n1.) ( 10 points) ELVIS is everywhere\na.) Given 20 naturally occurring amino acids, what is the probability that the amino acid\nsequence ELVIS occurs in a stretch of a protein sequence?\nb.) What is the probability if the order of the amino acids did not matter, i.e., VLSEI, etc.?\n2.) (5 points) Protein folding.\na.) A protein is a linear chain of amino acids. The amino acid has two torsional angles than can\nvary around the α carbon, ψ and φ. Due to sterics, ψ and φ have 3 possible configurations apiece,\nyielding 3 × 3 = 9 possible configurations per amino acid. Pictured below is a three residue\npeptide:\nR\nH\nO\nR\n\nN\nH\nN\nN\nOH\nN\nH\nN\nN\nOH\nH\nO\nR\nH\nO\n\nIf a protein has n =100 amino acids, how many different configurations are possible?\n\nPage 3 of 6\nName:\n3.) (25 points) Conditional probabilities of the genetic code\na) A codon is a sequence of 3 nucleotides that specifies a particular amino acid. How many\ncodons are possible out of the 4 nucleotides?\nb) Using the table for the genetic code below, what is the joint probability of obtaining a G in the\nsecond position (G2) and A in the first (A1)?\nFirst\nSecond Letter\nThird\nLetter\nLetter\nU\nC\nA\nG\nUUU\nPhe\nUCU\nSer\nUAU\nTyr\nUGU\nCys\nU\nU\nUUC\nPhe\nUCC\nSer\nUAC\nTyr\nUGC\nCys\nC\nUUA\nLeu\nUCA\nSer\nUAA\nStop\nUGA\nStop\nA\nUUG\nLeu\nUCG\nSer\nUAG\nStop\nUGG\nTrp\nG\nCUU\nLeu\nCCU\nPro\nCAU\nHis\nCGU\nArg\nU\nC\nCUC\nLeu\nCCC\nPro\nCAC\nHis\nCGC\nArg\nC\nCUA\nLeu\nCCA\nPro\nCAA\nGln\nCGA\nArg\nA\nCUG\nLeu\nCCG\nPro\nCAG\nGln\nCGG\nArg\nG\nAUU\nIle\nACU\nThr\nAAU\nAsn\nAGU\nSer\nU\nA\nAUC\nIle\nACC\nThr\nAAC\nAsn\nAGC\nSer\nC\nAUA\nIle\nACA\nThr\nAAA\nLys\nAGA\nArg\nA\nAUG\nMet\nACG\nThr\nAAG\nLys\nAGG\nArg\nG\nGUU\nVal\nGCU\nAla\nGAU\nAsp\nGGU\nGly\nU\nG\nGUC\nVal\nGCC\nAla\nGAC\nAsp\nGGC\nGly\nC\nGUA\nVal\nVal\nGCA\nAla\nAla\nGAA\nGlu\nGlu\nGGA\nGly\nGly\nA\nGUG\nGCG\nGAG\nGGG\nG\nc) Calculate the degree of correlation for obtaining a Serine given G2. Is it negatively/\npositively/not correlated, or mutually exclusive?\n\nL\nL\nL\nL\nL\nL\nPage 4 of 6\nName:\n4.) (60 points) Protein ligand binding\nA protein has M = 3 sites for binding a ligand. The sites are indistinguishable from each other, as\nare the ligands.\nNL=0\nNL=1\nNL=2\nNL=3\n\nL\nL\nL\nL\nL\nL\na) Express the number of ways NL ligands can be arranged in M sites, W (M, NL).\nb)Calculate the multiplicity and also the entropy for the following states. NL= 1 means that one\nligand is bound, NL=0 means no ligands are bound, etc. You may leave the entropy in terms of\nthe Boltzmann constant, k.\n(i) NL =0\n(ii) NL = 1\n(iii) NL = 2\n(iv) NL = 3\n\nPage 5 of 6\nName:\nc) Plot the probability distribution as a function of the number of ligands, p(NL).\nd) Calculate the variance of the distribution.\n\nPage 6 of 6\nName:\ne) Upon addition of a cross linker, the protein can dimerize to form the following dimer (pictured\nbelow). The dimer can bind up to 4 ligands.\nNL=1\nNL=1\nNL=2\n\n+\n+\ncross linker\n+\n+\ncross linker\nWhat is the entropy of the dimeric protein where NL =2 (pictured)? You may leave in terms of k.\nf) Compare the entropy of two proteins as monomers (left) with NL=1 with the entropy of the\ndimer (right). What is the change in entropy, ∆S, going from monomeric to dimeric, in terms of\nk? Based on your calculation, is the system more likely to be in the monomeric or dimeric form?"
    },
    {
      "category": "Exam",
      "title": "quiz2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-011j-statistical-thermodynamics-of-biomolecular-systems-be-011j-spring-2004/1ab4c28bda85291db6ed87afb2c1ffb5_quiz2.pdf",
      "content": "1 of 4 pages\nNAME_____________________________________\nBE.011/2.772\nExam 2\n19 March 2004\nConversions & Constants\nk (boltzman constant) = 1.38017 x 10-23 J/K\nGas Constant R = Nk = 8.3144J/K-mol\nAvagadro's Number = 6.022 x 1023\n1 atm = 101,325 N/m2\n1 N = 1 J/m\n1 J = 0.23901 cal\n1. Home soda seltzer makers were popular in the Czech Republic during the early-mid 20th\ncentury, and can now be purchased from various high-end purveyors of kitchenware. To\nmake seltzer, a heavy-duty bottle (to withstand pressure) is filled with water, leaving a\nlittle air space on top. A charger/dispensing apparatus is screwed on to make a tight seal.\nA metal canister containing 10 cm3 of compressed CO2 is placed in a holder and screwed\nonto the charger/dispensing apparatus, piercing a metal membrane on the CO2 canister\nand releasing CO2 into the bottle, where approx 50cm3 air space is available.\na.\nIf the process occurs adiabatically, as expansion of the gas into the new\nvolume, what is the temperature of the gas at the end of the process? You\nmay consider that the air initially present in the bottle does not contribute to the\nfinal state; i.e., you may consider this adiabatic expansion of the CO2 into a new\nvolume of 60 cm3. The constant pressure heat capacity of CO2 at the starting\ntemperature, room temperature (25C) is Cp = 37.4 J/mol-K. You can assume this\nis an ideal gas, for which the molar heat capacity Cv = Cp - R.\n\n2 of 4 pages\nb. Frost forms on the metal canister. What does this indicate about the assumption\nthat the process is adiabatic? How much energy would be required to cool the\ncanister from room temperature (25C) to -10C and form ~1 gm (~0.05 mols) of\nice if the heat capacity of the canister (mass x Cp) is 4300J/k and the heat of\nfusion of ice ∆Hmelt ~ 6000 J/mol (you can neglect the heat associated with\ncooling the water vapor to -10C). How does that compare to what the enthalpy\nchange would be for cooling CO2 from room temperature to the temperature you\ncalculated in part a, if the cooling were done at constant pressure and the total\nnumber of moles of CO2 is 0.2?\n2. For the time being, it is still legal to \"Supersize\" your meal at MacDonald's. You order,\nand eat, the following SuperSize meal (data obtained from the MacDonald's web site)\n\"Double Quarter Pounder(r) with Cheese, 770 calories\nSuper Size(r) French Fries, 610 calories\nChocolate Triple Thick(r) Shake (32 fl oz cup), 1150 calories\nBaked Apple Pie, 260 calories\ntotal calories 2790\"\nThrough a freak accident, as soon as you finish the last morsel, you suddenly become an\nadiabatic system. How much does your body temperature rise if all of the calories in the\nmeal are converted to heat? Note that what is reported as \"calories\" are actually kcal\n(i.e., the total heat generated from the meal is 2790 kcal). For the calculation, estimate\nyour weight as 60 kg, and your average heat capacity Cp as 1.0 kcal/kg/K.\n\n3 of 4 pages\n3. Consider again the text example we discussed in class of collapse of a 4-mer polymer\nchain in a poor solvent. In that example, a simple 2-D lattice model was used to build an\nexpression for the free energy of the collapsed and open state, where the adjacent\nmonomers interact with energy U= -ε per monomer-monomer interaction. Free energy\narguments were then used to define the temperature T0 where half the chains are in the\ncollapsed state and half in the open state.\na. Does a 6-mer chain (see figure for possible open and collapsed configurations)\nmade of the same monomers have a higher or lower value of T0? Provide\nconvincing evidence of your answer, but you do not need to calculate the\nprecise value of T0. For these purpose, we can define a \"collapsed\" chain as\nhaving one or more monomer-monomer interactions. We emphasize that you do\nnot need to provide the precise value, just convincing evidence for whether T0 is\nhigher or lower for the 6-mer chain compared to the 4-mer.\nb. Can you generalize your answer for larger N?\n\n4 of 4 pages\n4. Chymotrypsinogen, secreted by the pancreas, is the precursor to chymotrypsin, a\ndigestive enzyme that acts in the small intestine (and is thus necessary for completion of\nthe activity described in problem 2). At 25C and pH 3, the enthalpy of denaturation of\nchymotrypsinogen is ∆H = 39 kcal/mol. At body temperature (37C), the denaturation\n∆H = 8 kcal/mol (also at pH 3). What is the change in heat capacity of the protein upon\ndenaturation? You may presume that all experiments were conducted at 1 atm pressure.\n5. Ice at 1 atm and 0C has a density of 0.917 gm/cm3. Water at the same T and P has a\ndensity of 0.9998 gm/cm3. At 1 atm and 0C, ∆Hmelt = 5.9176kJ/mol.\na. What is the entropy change on melting?\nb. What is ∆U during melting?"
    },
    {
      "category": "Exam",
      "title": "quiz3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-011j-statistical-thermodynamics-of-biomolecular-systems-be-011j-spring-2004/815526a07c96c4e299fb7f8e2f189a07_quiz3.pdf",
      "content": "Page 1 of 6\nName:\nBE.011/2772J\nSpring 2004\nQUIZ III\nYou have 1 hour for this exam.\nCLOSED BOOK\n3 pages notes allowed\n1 (45 points)\n2 (30 points)\n3 (25 points)\ntotal (100 points)\nSome formulas, constants, and conversions you may need:\nk = 1.38 × 10-23 J/K\nNA = 6.02 × 1023\n0°C = 273K\nContinued on next page....\n\nPage 2 of 6\nName:\n1.) DNA supercoiling\nWe saw that circular DNA plasmids can supercoil into right or left handed supercoils with τ\nnumber of turns:\nτ=-1\nτ = 0\nτ = 1\nThe energy in which it has τ turns is\nε = τ2B\nwhere B is a constant.\na) (10 pts) Draw the first few energy levels. Label the levels with their values of τ, and draw the\nenergy levels to scale as much as possible (or label with its value of ε). Include degeneracies.\nε\n\nPage 3 of 6\nName:\nb) (2 pts) What are the units of B?\nc) (18 pts) If T = B/k, what is the population of each of the energy levels at equilibrium? Which\nmicrostates are relevant (i.e., populated?). Levels which have less than 1% of the population can\nbe considered negligible. Make a plot of population vs. energy justifying this.\nContinued on next page....\n\nPage 4 of 6\nName:\nd) (5 pts) Calculate average energy per plasmid, <ε> at T = B/k. Use the same cutoff as you did\nin part c. Leave in terms of B.\ne) (5 pts) AFM is a technique which images the supercoils of DNA on a surface. It can\ndistinguish the molecules from one another. Let's say we have 100 of these plasmids at a\ntemperature of T = B/k. Calculate the entropy per plasmid.\n\nPage 5 of 6\nName:\n\nf) (5 pts) Calculate the free energy F of the entire system. Use the truncated form of the partition\nfunction you obtained in part c). Leave your answer in units of B.\n\n2.) Protein folding\nA 99 residue protein has only one folded α-helical conformation.\na) (10 pts) For the reaction\n\nα helix\n\nrandom coil\n\nCalculate ∆S assuming that each residue can have three different configurations. Is ∆S >, <, or =\n0? Does this make sense? Why?\n\nPage 6 of 6\nName:\nb) (10 pts) What is ∆H required for melting point to be 50°C? The melting point is defined as\nwhen the equilibrium constant is equal to 1.\nc) (10 pts) Suppose you do an experiment on a solution of this protein and find ∆S<0. Does this\nconcur with what you found in part a)? Why do you think this is?\n3.) (25 pts) Protein dimerization equilibrium\nYou are interested in the tendency of a certain protein to form dimers. You obtain data for the\nequilibrium between monomer and dimer at 20°C and °30C and then your equipment breaks.\nPredict the equilibrium constant at 37°C if you found that the values of K at 20C and 30 C were\nK20 = 18,000M-1 and K30 = 20,000M-1."
    },
    {
      "category": "Resource",
      "title": "2003_final_solns.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-011j-statistical-thermodynamics-of-biomolecular-systems-be-011j-spring-2004/585ba3fe9e7bc589a49d7318c0f123a8_2003_final_solns.pdf",
      "content": "Continued on next page...."
    },
    {
      "category": "Resource",
      "title": "2003_final.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-011j-statistical-thermodynamics-of-biomolecular-systems-be-011j-spring-2004/91fea08ae0702a62b562a3e5a61b999c_2003_final.pdf",
      "content": "Page 1 of 14\nName:\nBE.011/2.993J\nSpring 2003\nFINAL EXAM\nMay 19, 2003\nYou have 3 hours for this exam.\nCLOSED BOOK\n4 pages of notes allowed\n1. (60 points)\n2. (20 points)\n3. (10 points)\n4. (40 points)\n5. (65 points)\n6. (30 points)\ntotal (225 points)\nSome constants you may need:\nk = 1.38 ? 10-23 J K-1\nR = 8.314 J K-1 mol-1\nh = 6.626 ? 10-34 J s\n1atomic mass unit (amu) = 1.66 ? 10-27 kg\n\nPage 2 of 14\nName:\n1.) (60 points total) The protein below has four binding sites (? , ? , ?, ? ) for the ligand L (look\nfamiliar?). Assume that the association and dissociation constants are equal.\nL\nL\n+\nL\n+\n?\n?\n?\nL\nL\nL\nL\n?\n?\n?\n?\n?\n?\n?\n?\n?\n?\n?\n?\n?\n?\n?\n?\n?\nIt has energies associated with each macrostate L, where L is the # of ligands:\n#L\nenergy\n8?\n4?\n2?\n1?\n1a.) (10 points) Plot an energy level diagram, including all microstates. Label values on the y\naxis in terms of the energy unit ?.\nContinued on next page....\n\nPage 3 of 14\nName:\n1b.) (10 points) Write down an expression for the partition function q. Calculate its value at a\ntemperature where kT = 3?.\n1c.) (5 points) What is the highest macrostate that is populated at this temperature kT = 3?? How\nmany of the microstates in this macrostate are populated?\n1d.) (10 points) Calculate pL for L = 0,1,2,3,4 at a temperature where kT = 3?. What is ? LpL?\n\nPage 4 of 14\nName:\n1e.) (10 points) Calculate <E> at a temperature where kT = 3?, (you can leave it in terms of ?).\n1f.) (5 points) What is the entropy, S, at a temperature where kT = 3??\n1g.) (5 points) What is q as T? ? ?\n\nPage 5 of 14\nName:\n1h.) (5 points) What is S as T? ? ?\n2.)(20 points total) Heat capacity of a molecule\nYou have the molecule glucose, which has 66 degrees of vibrational freedom. Plot its heat\ncapacity as a function of temperature, making sure to denote on the plot\n·\nvalues for heat capacity (in units of R) on the y axis\n·\nwhere the rotational and vibrational temperatures, ?rot and ?vib, are on the x-axis.\nCv/R\nT\n\nPage 6 of 14\nName:\n3.) (10 points total) Ribonuclease A is a protein that has 124 amino acids.\n3a.) (5 points) What is the probability that this sequence is unique?\n3b.) (5 points) Assume that residues 1-20 are conserved (exactly the same). How many different\nhomologies are possible for RNase A?\n\nPage 7 of 14\nName:\n4.) (40 points total) Equilibrium between two states. The reaction\nA? ? B\nhas the equilibrium constant K. The energy levels for A and B are shown below:\nE\nA\nB\n8?0\n6?0\n6?0\n5?0\n4?0\n4?0\n3?0\n2?0\n2?0\n?=2?0\nA has a fixed energy level spacing of 2?0, with a ground state energy of 0. B has a fixed energy\nspacing of ?0 with a ground state energy of 2?0.\n4a.) (10 points) Calculate K for the reaction, assuming kT=2?0.\n\nPage 8 of 14\nName:\n4b.) (10 points) What is K as T? ? ?\n4c.) (5 points) What side of the reaction is favored as T? 0?\n4d.) (10 points) Now suppose the ground state energy of B was also 0 (i.e., ? =0). Calculate K\nusing kT=2?0 gain.\n\nPage 9 of 14\nName:\n4e.) (5 points) Let's pretend A? ? B is an isomerization reaction, i.e., a molecule changing only\nin shape such as Helix ? ? Coil, and that the energy levels are vibrational. Which form of the\nmolecule has stiffer bonds (higher bond spring constant, k)?\nContinued on next page....\n\nPage 10 of 14\nName:\n5.) (65 points total) We're going to test the effects of CO gas on cells. Our experiment utilizes a\nthin, two-dimensional gas of the diatomic molecule CO in a petri dish that has dimensions a ? b.\n5a.) (5 points) Write down an expression for the full partition function for the CO molecule in\nterms of constants (include all degrees of freedom).\n5b.) (10 points) Calculate a value for the qtrans using T = 37C, a = b = 3cm. Use the mass values\nof mO = 16 g/mol and mC = 12 g/mol.\n5c.) (10 points) What is the U per molecule (U/N)?\n\nPage 11 of 14\nName:\n5d.) (10 points) Now let's compare the rotational properties of CO with that of a DNA oligo.\nExperimentally you find that the first four energy levels for the diatomic CO to be the following\nenergies:\n0J\n7.64 ? 10-23 J\n2.29 ? 10-22 J\n4.58 ? 10-22 J\nDetermine the bond length for the molecule.\n5e.) (10 points) Calculate a value for qrot using T = 37?C. What is the rotational temperature for\nCO?\n\nPage 12 of 14\nName:\n5f.) (5 points) If we were make the same measurements in e) at a different temperature, what\nwould happen to the values of the energies observed?)\n5g.) (10 points) Now let's look at the DNA molecule. The oligo is 12 nucleotides long, and each\nstrand has a molecular weight of 3832 g/mol. Calculate the energy levels of the first four\nrotational states for the DNA oligo. Assume the length is 3.4 A per base pair. Also assume it is a\nrigid rod with rotation around the center as shown in the figure, so that I = 1/12 ML2, where L is\nthe entire length of the molecule.\n5h.) (5 points) Calculate the rotational temperature, ?rot, for this rotating DNA oligo. How does\nthis compare to the ?rot for CO?\n\nPage 13 of 14\nName:\n6.) (30 points total) Solutions and Mixtures.\n6a.) (10 points) Pure liquid hexane is suspended in a sealed container in the absence of gravity\n(ok, slightly fictitious! This situation does model a real situation mentioned at the end). The\ntemperature is constant. The hexane does not touch any of the surfaces of the container and is\nliterally suspended in space. Think back to our discussion of surface tension and the free energy\nassociated with creating surfaces of condensed phases. At equilibrium, what geometry (i.e.,\nshape) is the liquid hexane and why?\n6b.) (10 points) The hexane in part a is mixed with water and the mixture is suspended in the\nsealed container in a gravity-free environment, just as in part a. As you probably already\nintuitively know, wA-A >>> wBB > wAB where A refers to water and B to hexane, and w refers to\nthe bond energy (in fact, a negative number. We are following the convention of the text here to\nindicate that the A-A bonds are stronger, i.e., a bigger negative number). Sketch the equilibrium\nconfiguration of the system, presuming the liquids do not contact any of the container surfaces\nand are literally suspended in space. Where is the water relative to the hexane, and what\ngeometry (shape) does the liquid have? You may assume that there are comparable total volumes\nof water and hexane present.\n\nPage 14 of 14\nName:\n6c.) (10 points) You were not told anything about the relative volume of liquid to the total\nvolume. If the container is sealed after introduction of the liquids, and held at constant\ntemperature, are there any restrictions on how much liquid is added initially so that liquid is\npresent when equilibrium is reached?\nRelation to real problems: Malcolm Steinberg, a developmental biologist at Princeton\nUniversity, proposed that some forces controlling development of multicelluar organisms are\nanalogous to those described in part b. He in fact showed that when two cell types that express\nthe same cell-cell adhesion receptor are mixed in suspension, they behave pretty much the same\nas the liquids described in part b if cell type A has a lot more of the receptors than cell type B.\nThat's it! Have a great summer!!!"
    },
    {
      "category": "Exam",
      "title": "2003_quiz_2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-011j-statistical-thermodynamics-of-biomolecular-systems-be-011j-spring-2004/d7e62272adfae02c23eef179dcd2a441_2003_quiz_2.pdf",
      "content": "BE.011/2.772\nQuiz 2\nMarch 20, 2003\n1. Dialysis is common laboratory procedure used to remove low molecular weight solutes from protein\nsolutions. Example situations include: removal of removal of free, unreacted label after\nfluorescently labeling a protein; and removal of urea from a denatured protein solution to allow\nrefolding of the protein. The protein solution is sealed inside a dialysis bag or tubing and placed in\ncontainer with a large excess of pure water, as shown in the figure. The system is then allowed to\ncome to equilibrium. For this problem, consider an idealized system where the only solute in the\ndialysis bag is the low molecular weight solute (i.e., no protein is actually present.)\n(a) Explain why the combined system of the protein solution (system \"A\") and the water (system\n\"B\") may be considered to be an isolated system.\n(b) Use a lattice model, with each individual water molecule occupying a single site in the\nlattice, to show that the entropy of System B is zero at the start of the experiment. Designate\nthe number of water molecules NWB and the number of total lattice sites MB.\n(c) Use a lattice model to express the entropy of system A at the start of the experiment in terms\nof the number of water molecules in system A, NwA, the number of solute particles, Ns, and\nthe total number of lattice sites in system A, MA. For your final expression, use an\nappropriate approximation to eliminate factorial expressions. You may assume that the water\nmolecules and solute molecules are comparable in size.\n(d) Now write an expression for the entropy of the combined system under the conditions where\nwater and solute can freely pass through the dialysis membrane. For every solute molecule\nthat crosses over to system B, a water molecule must cross over to system A. (You may want\nto keep track of the number of solute molecules by noting that NS =NSA+ NSB and the number\nof water molecules by noting that NWA + NWB = NW).\n(e) Show that you can write the entropy expression in terms of one system variable (i.e., one\nparameter that changes value during the progress of the experiment), and briefly describe\nhow to determine the equilibrium condition in terms of that variable and constants in the\nsystem. [You do not need to work out the equilibrium condition (lots of algebra involved)\nbut feel free to predict what it is if you like.]\n(f) Is work done in the approach to equilibrium? Explain why or why not.\n(g) Does the internal energy U of the system change? Explain why or why not.\nInitial state\nEquilibrium\nstate\n\n2. In class we considered the text example of a \"polymer\" comprising 4 monomer units that can exist in\na \"compact\" state or an \"open\" state. The compact state arises from an attractive bond between the\nmonomers at the ends of the chain (see figure). This bond is characterized by an energy -ε. If this\nbond has an energy of 588 x 10-23 J, what is the free energy of the compact system at 310K? What is\nthe free energy of the open system at 310K? Will there be more open or compact chains at 310K?\nThe value of k is 1.38 x 10-23 J/K.\n3. One gram of water is heated in a calorimeter from 274K to 314K. The following data are obtained:\nTemperature\nCumulative Heat added (bomb\ncalorimeter)\nTotal Heat added (constant\npressure calorimiter)\n0 cal\n0 cal\n19.7 cal\n20 cal\n39.5 cal\n40 cal\nWhat is the change in entropy when the temperature of 1 gm of water is raised from 274 to 314K at\nconstant volume? At constant pressure?"
    },
    {
      "category": "Exam",
      "title": "2003_quiz1_solns.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-011j-statistical-thermodynamics-of-biomolecular-systems-be-011j-spring-2004/9542b606b7916b5922301c965c39eb56_2003_quiz1_solns.pdf",
      "content": "BE.011/2.993J\nSpring 2003\nQUIZ I SOLUTIONS\n1.) (20 points) DNA sequence\nYou have a genome that is exactly 1 × 109 bases long. You would like to choose a DNA\nsequence out of the genome that is unique. What is the minimum length of the sequence\nsuch that it could be unique (i.e., it is possible that it does not occur anywhere else in the\ngenome)?\nBasically, we want the probability of the sequence occurring to be less than 1/(1× 109). That\nmeans it has the probability of occurring only once in the genome, and thus could be unique.\nAnother way of looking at it is that if its probability were greater than 1/(1× 109), such as 2/(1×\n109), then it has the possibility of occurring twice in the genome and may not be unique.\nNow, for a sequence, the probability that it occurs is 1/4n, where n is the length of the sequence\n(remember the coin flips from Chapter 1? In that case, as well as here, order matters). The 4\ncomes from the 4 nucleotides we have to choose from (A,T,G,C).\nFor a 14mer:\n14 = 2.68 × 108\n1/414 > 1/(1× 109)\nso not long enough.\nFor a 15mer:\n15 = 1.07 × 109\n1/415 < 1/(1× 109)\nso long enough to be unique!\nBy the way, this is based on an experimental technique called antisense gene regulation. In that\ncase, a short \"antisense\" oligo is used to hybridize to mRNA over the start codon, prohibiting the\ngene from being translated. In this experiment, you'd like to choose an antisense oligo long\nenough so that it hybridizes to only one spot in the gene, and not anywhere else. If you look in\nthe literature, these antisense oligos are almost always 15-20 nucleotides long.\n2.) The protein below has four binding sites (α , β , γ , δ ) for the ligand L. We would like to\nfind its equilibrium binding population. For now assume that the association and\ndissociation constants are equal.\nL\nL\n+\nL\n+\nα\nγ\nδ\nL\nL\nL\nL\nβ\nα\nγ\nδ\nβ\nα\nγ\nδ\nβ\nα\nγ\nδ\nβ\nα\nγ\nδ\nβ\na) (15 points) Calculate W and the entropy (in units of k) for the situation in which\n\ni) 0 ligands are bound (NL = 0)\nOnly 1 way to arrange this.\nW = 4!/4!0!\nS = k ln(1) = 0\nii) 1 ligand is bound (NL = 1)\n4 ways to arrange: on α, β, γ, δ (by \"hand)\nor W = 4!/3!1!\nW = 4\nS = k ln(4) = 1.386k\niii) 2 ligands are bound (NL = 2)\n6 ways to arrange (by \"hand\"):\nαβ, αγ, αδ\nβγ, βδ\nγδ\nor W = 4!/2!2! = 6\nS = k ln (6) = 1.792k\niv) 3 ligands are bound (NL = 3)\n4 ways to arrange (vacant spot is on α, β, γ, δ)\nW=4!/1!3! = 4\nS = k ln (4) = 1.386k\nv) 4 ligands are bound (NL = 4)\nW = 4!/0!4! = 1\nS = 0k\nb) (5points) Which states have the highest entropy?\nNL = 2\nc) (5 points) Which states have the lowest entropy?\nNL = 0 and NL = 4\nd) (5 points) Which state will you find it in at equilibrium?\nNL = 2 (because it has the highest entropy)\ne) (20 points) Let's say that the binding constants are not equal, i.e., ligand L has a higher\nprobability of being bound:\npbound = 0.75\npunbound = 0.25\nPlot the probability distribution for all of the states, p(i).\nNow we have to use the formula for the Bernoulli trials (Dill, equation 1.28). Basically this\nmultiplies W by a term which accounts for the nonequal probabilities of a protein being bound:\nM-NL\nP(NL, M) = M!/NL!(M-NL)! pNL (1-p)\nfor NL ligands in M sites, which have a probability p of\n0.5\nbeing bound (and 1-p of being unbound). Note: this is\na little more like real life because proteins often have\n0.4\nunequal association-dissociation constants.\n0.3\nfor NL = 0:\nP= 4!/0!4! (0.75) (0.25)4 = 3.91×10-3\n0.2\nfor NL = 1:\nP = 4!/(1!3!) (0.75)1(0.25)3 = 4.69 × 10-2\n0.1\nfor NL=2:\n\nP = 4!/(2!2!) (0.75)2(0.25)2 = 0.211\nfor NL=3:\nP = 4!/(3!1!) (0.75)3(0.25)1 = 0.422\nfor NL=4:\nP = 4!/(4!0!) (0.75)4(0.25)0 = 0.316\nNote: the sum of all pi = 1.00, which is important!\n3.) DNA has 3 different possible configurations: A, B, and Z: Let the scores for each\nconfiguration εi be : εA = 1 , εB = 2, εZ = 3.\na) (10 points) Write down the partition function, q. (you may substitute x = e-β )\nq = Σi e-βεi\nq = x + x2 + x3\nb) (10 points) Write down the expressions for pA and pB and pZ.\npA = x1/q = x/(x + x2 + x3)\npB = x2/q = x2/(x + x2 + x3)\npZ = x3/q = x3/(x + x2 + x3)\nc) (10 points) What is the variance of the distribution, <σ\n2>, if all three configurations are\n<σ\nequally possible?\nIf all 3 configurations equally possible, then pA = pB = pZ = 1/3\nThen we need the formula for the variance:\n<σ> = <ε2> - <ε>2\nwhere\n<ε> = Σεi pi = 1(1/3)+2(1/3)+3(1/3) = 2\n<ε2> = Σεi pi = 1(1/3) + 4(1/3) + 9(1/3) = 4.67\n<σ> = 4.67-2 = 2.67"
    },
    {
      "category": "Exam",
      "title": "2003_quiz1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-011j-statistical-thermodynamics-of-biomolecular-systems-be-011j-spring-2004/36f9e56f3fb6a35eaf63e74e34bbb066_2003_quiz1.pdf",
      "content": "Page 1 of 4\nName:\nBE.011/2.993J\nSpring 2003\nQUIZ I\nFebruary 26, 2003\nYou have 1 hour for this exam.\nCLOSED BOOK\n1 page notes allowed\n1 (20 points)\n2 (50 points)\n3 (30 points)\ntotal (100 points)\n1.) (20 points) DNA sequence\n...GTAGCCGTGAATCGATGGTCCAAATACCG...\n|------->?\nYou have a genome that is exactly 1 · 109 bases long. You would like to choose a DNA\nsequence out of the genome that is unique. What is the minimum length of the sequence such\nthat it could be unique (i.e., it is possible that it does not occur anywhere else in the genome)?\n\nPage 2 of 4\nName:\n2.) The protein below has four binding sites (a, b, g, d) for the ligand L. We would like to find its\nequilibrium binding population. For now assume that the association and dissociation constants\nare equal.\nL\na\ng\nd\nb\na\ng\nd\nb\nL\na\ng\nd\nL\nL\nL\nL\nb\na\ng\nd\nb\na\ng\nd\nb\n+\nL\n+\na) (15 points) Calculate W and the entropy (in units of k) for the situation in which\ni) 0 ligands are bound (NL = 0)\nii) 1 ligand is bound (NL = 1)\niii) 2 ligands are bound (NL = 2)\niv) 3 ligands are bound (NL = 3)\nv) 4 ligands are bound (NL = 4)\n\nPage 3 of 4\nName:\nb) (5points) Which states have the highest entropy?\nc) (5 points) Which states have the lowest entropy?\nd) (5 points) Which state will you find it in at equilibrium?\ne) (20 points) Let's say that the binding constants are not equal, i.e., ligand L has a higher\nprobability of being bound:\npbound = 0.75\npunbound = 0.25\nPlot the probability distribution for all of the states, p(i).\nContinued on next page....\n\nPage 4 of 4\nName:\n3.) DNA has 3 different possible configurations: A, B, and Z:\nA\nB\nZ\nLet the scores for each configuration ei be : eA = 1 , eB = 2, eZ = 3.\na) (10 points) Write down the partition function, q. (you may substitute x = e-b )\nb) (10 points) Write down the expressions for pA and pB and pZ.\nc) (10 points) What is the variance of the distribution, <s2>, if all three configurations are\nequally possible?"
    },
    {
      "category": "Exam",
      "title": "2003_quiz2_solns.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-011j-statistical-thermodynamics-of-biomolecular-systems-be-011j-spring-2004/60d68842cb765cbae7d39775a4c80aa6_2003_quiz2_solns.pdf",
      "content": ""
    }
  ]
}