{
  "course_name": "Strategy and Information",
  "course_description": "This is an advanced course in game theory. We begin with a rigorous overview of the main equilibrium concepts for non-­cooperative games in both static and dynamic settings with either complete or incomplete information. We define and explore properties of iterated strict dominance, rationalizability, Nash equilibrium, subgame perfection, sequential, perfect and proper equilibria, the intuitive criterion, and iterated weak dominance. We discuss applications to auctions, bargaining, and repeated games. Then we introduce solution concepts for cooperative games and study non-­cooperative implementations. Other topics include matching theory and networks.",
  "topics": [
    "Social Science",
    "Economics",
    "Game Theory",
    "Social Science",
    "Economics",
    "Game Theory"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nRecitations: 1 session / week, 1 hour / session\n\nPrerequisites\n\nThe course is proof-based and assumes that students are comfortable with discrete mathematics, optimization, topology, and probability theory. Previous exposure to economic modeling is helpful. The prerequisite for the course is a substantial economics background or a strong math background with some economics coursework.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nClass attendance and participation\n\nFive problem sets\n\nIn-class midterm\n\nFinal assignment\n\nReadings\n\nThe following textbooks are useful references for various parts of the course:\n\nFudenberg, Drew, and Jean Tirole.\nGame Theory\n. MIT Press, 1991. ISBN: 9780262061414. [Preview with\nGoogle Books\n]\n\nOsborne, Martin J., and Ariel Rubinstein.\nA Course in Game Theory\n. MIT Press, 1994. ISBN: 9780262650403. [Preview with\nGoogle Books\n]\n\nRoth, Alvin E., and Marilda A. Oliveira Sotomayer.\nTwo-Sided Matching: A Study in Game-Theoretic Modeling and Analysis\n. Cambridge University Press, 1992. ISBN: 9780521437882. [Preview with\nGoogle Books\n]",
  "files": [
    {
      "category": "Exam",
      "title": "MIT 14.16 S14 Final Exam",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-16-strategy-and-information-spring-2016/de32dfa476669983536c44c7a2f513fa_MIT14_16S16_Final_Exam.pdf",
      "content": "14.16 STRATEGY AND INFORMATION\nFINAL ASSIGNMENT\nQuestion 1\nA seller uses the winner and loser pay auction to sell a good to one of n ≥2 buyers. In\nthis auction, buyers simultaneously submit bids and the highest bidder (ties are broken\nrandomly) obtains the good. However, both the highest and the lowest bidder(s) pay\ntheir own bids. Assume that each buyer i has a private value vi, which is independently\nand uniformly distributed in [0, 1].\n(a) Find a symmetric Bayesian Nash equilibrium described by a strictly increasing bid-\nding function (you do not have to argue that the identified strategies constitute an\nequilibrium).\n(b) Prove that the bid of every buyer type vi in the winner and loser pay auction does\nnot exceed the bid of type vi in the standard first-price auction. What buyer types\nbid exactly the same amount in the two auctions?\n(c) Which of the two auction formats discussed in (b) generates a higher revenue for the\nseller?\nQuestion 2\nConsider the following signaling game.\n-1, 0\n-3, -1\n0, 0\n-2, 1\n0, 0\n-2, -1\n-1, 0\n-3, -2\nr 0\nr\nr\nf\nf\nr\nr\nf\nf\nH\nB\n0.1\n0.9\nw\nw\ns\ns\nr\nr\nr\nr\nr\nr\nr\nr\nr\nr\nr\nr\nr\nr\n(a) Find a Nash equilibrium that is not a sequential equilibrium.\n\n14.16 STRATEGY AND INFORMATION\n(b) Find all sequential equilibria.\nQuestion 3\nTwo players repeatedly play the following simultaneous move game for T periods.\nAssume that both players observe all past actions and discount payoffs by δ ∈(0, 1).\nC\nD\nA\n5, 5\n-1, -2\nB\n6, -1\n0, -3\n(a) Find all subgame perfect equilibria of the game repeated for T = 2016 periods.\n(b) Assume now that T = inf, so that the stage game is played an infinite number of times.\nFor what values of δ does the following strategy profile, in which (A, C) is played along\nthe equilibrium path at every date, constitute a subgame perfect equilibrium? Play\nstarts in Phase I and evolves as follows.\n- In Phase I, player 1 is supposed to choose action A and player 2 chooses C. If\neither player deviates from Phase I, play switches to Phase II.\n- In Phase II, player 1 is supposed to play B and player 2 should play D for a\nsingle period. If both players comply with these strategies, play reverts to Phase\nI in the next period. Otherwise, play continues in Phase II. (Players are stuck in\nPhase II until (B, D) is observed.)\nQuestion 4\nConsider the following cooperative game between a capitalist c and a set of n ≥1\nworkers W. The capitalist owns a factory and workers can contribute with labor. Workers\ncannot produce anything by themselves; together with the capitalist, any group of w\nworkers can generate an amount of output that is worth f(w), where f : [0, inf) →[0, inf)\nis a concave increasing function with f(0) = 0. Formally, the set of players is N = {c}∪W\nand the value of a coalition S ⊆N is\nv(S) =\n\nif c /∈S\nf(|S ∩W|)\nif c ∈S\n.\n\n14.16 STRATEGY AND INFORMATION\n(a) Show that the core of this game is given by\nC =\n(\nx ∈RN | 0 ≤xi ≤f(n) -f(n -1), ∀i ∈W &\nX\ni∈N\nxi = f(n)\n)\n.\nInterpret the payoffs in this set. (Note: showing that the core coincides with the set\nC proceeds in two steps. One needs to argue that (1) any core point satisfies the\nproperties defining C; and (2) any payoffvector in C belongs to the core.)\n(b) Find the Shapley value of this game.\n(c) Are there any n and f satisfying the hypotheses such that the Shapley value does not\nbelong to the core?\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n14.16 Strategy and Information\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "14.16 S16 Strategy and Information Repeated Games with Perfect Monitoring Lecture Slides",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-16-strategy-and-information-spring-2016/6245454b7dd0a020f706aa31b52e6430_MIT14_16S16_Repeated.pdf",
      "content": "Repeated Games with Perfect Monitoring\nMihai Manea\nMIT\n\nRepeated Games\n▶normal-form stage game G = (N, A, u)\n▶players simultaneously play game G at time t = 0, 1, . . .\n▶at each date t, players observe all past actions: ht = (a0, . . . , at-1)\n▶common discount factor δ ∈(0, 1)\n▶payoffs in the repeated game RG(δ) for h = (a0, a1, . . .):\nUi(h) = (1 -δ) Pinf\nt=0 δtui(at)\n▶normalizing factor 1 -δ ensures payoffs in RG(δ) and G are on same\nscale\n▶behavior strategy σi for i ∈N specifies σi(ht) ∈∆(Ai) for every\nhistory ht\nCan check if σ constitutes an SPE using the single-deviation principle.\nMihai Manea (MIT)\nRepeated Games\nMarch 30, 2016\n2 / 13\n\nMinmax\nMinmax payoff of player i: lowest payoff his opponents can hold him down\nto if he anticipates their actions,\nvi =\nmin\nα-i∈Q\nj,i ∆(Aj)\n\"\nmax\nai∈Ai\nui(ai, α-i)\n#\n▶mi: minmax profile for i, an action profile (ai, α-i) that solves this\nminimization/maximization problem\n▶assumes independent mixing by i's opponents\n▶important to consider mixed, not just pure, actions for i's opponents:\nin the matching pennies game the minmax when only pure actions\nare allowed for the opponent is 1, while the actual minmax, involving\nmixed strategies, is 0\nMihai Manea (MIT)\nRepeated Games\nMarch 30, 2016\n3 / 13\n\nEquilibrium Payoff Bounds\nIn any SPE--in fact, any Nash equilibrium--i's obtains at least his minmax\npayoff: can myopically best-respond to opponents' actions (known in\nequilibrium) in each period separately. Not true if players condition actions\non correlated private information!\nA payoff vector v ∈RN is individually rational if vi ≥vi for each i ∈N, and\nstrictly individually rational if the inequality is strict for all i.\nMihai Manea (MIT)\nRepeated Games\nMarch 30, 2016\n4 / 13\n\nFeasible Payoffs\nSet of feasible payoffs: convex hull of {u(a) | a ∈A}. For a common\ndiscount factor δ, normalized payoffs in RG(δ) belong to the feasible set.\nSet of feasible payoffs includes payoffs not obtainable in the stage game\nusing mixed strategies. . . some payoffs require correlation among players'\nactions (e.g., battle of the sexes).\nPublic randomization device produces a publicly observed signal\nωt ∈[0, 1], uniformly distributed and independent across periods. Players\ncan condition their actions on the signal (formally, part of history).\nPublic randomization provides a convenient way to convexify the set of\npossible (equilibrium) payoff vectors: given strategies generating payoffs v\nand v′, any convex combination can be realized by playing the strategy\ngenerating v conditional on some first-period realizations of the device and\nv′ otherwise.\nMihai Manea (MIT)\nRepeated Games\nMarch 30, 2016\n5 / 13\n\nNash Threat Folk Theorem\nTheorem 1 (Friedman 1971)\nIf e is the payoff vector of some Nash equilibrium of G and v is a feasible\npayoff vector with vi > ei for each i, then for all sufficiently high δ, RG(δ)\nhas SPE with payoffs v.\nProof.\nSpecify that players play an action profile that yields payoffs v (using the\npublic randomization device to correlate actions if necessary), and revert\nto the static Nash equilibrium permanently if anyone has ever deviated.\nWhen δ is high enough, the threat of reverting to Nash is severe enough to\ndeter anyone from deviating.\n□\nIf there is a Nash equilibrium that gives everyone their minmax payoff\n(e.g., prisoner's dilemma), then every strictly individually rational and\nfeasible payoff vector is obtainable in SPE.\nMihai Manea (MIT)\nRepeated Games\nMarch 30, 2016\n6 / 13\n\nGeneral Folk Theorem\nMinmax strategies often do not constitute static Nash equilibria. To\nconstruct SPEs in which i obtains a payoff close to vi, need to threaten to\npunish i for deviations with even lower continuation payoffs. Holding i's\npayoff down to vi may require other players to suffer while implementing\nthe punishment. Need to provide incentives for the punishers. . . impossible\nif punisher and deviator have indetical payoffs.\nTheorem 2 (Fudenberg and Maskin 1986)\nSuppose the set of feasible payoffs has full dimension |N|. Then for any\nfeasible and strictly individually rational payoff vector v, there exists δ such\nthat whenever δ > δ, there exists an SPE of RG(δ) with payoffs v.\nAbreu, Dutta, and Smith (1994) relax the full-dimensionality condition: only\nneed that no two players have the same payoff function (equivalent under\naffine transformation).\nMihai Manea (MIT)\nRepeated Games\nMarch 30, 2016\n7 / 13\n\nProof Elements\n▶Assume first that i's minmax action profile mi is pure.\n▶Consider an action profile a for which u(a) = v (or a distribution over\nactions that achieves v using public randomization).\n▶By full-dimensionality, there exists v′ in the feasible individually\nrational set with vi < v′\ni < vi for each i.\n▶Let wi be v′ with ε added to each player's payoff except for i; for small\nε, wi is a feasible payoff.\nMihai Manea (MIT)\nRepeated Games\nMarch 30, 2016\n8 / 13\n\nEquilibrium Regimes\n▶Phase I: play a as long as there are no deviations. If i deviates,\nswitch to IIi.\n▶Phase IIi: play mi for T periods. If player j deviates, switch to IIj. If\nthere are no deviations, play switches to IIIi after T periods.\n▶If several players deviate simultaneously, arbitrarily choose a j among\nthem.\n▶If mi is a pure strategy profile, it is clear what it means for j to deviate. If\nit requires mixing. . . discuss at end of the proof.\n▶T independent of δ (to be determined).\n▶Phase IIIi: play the action profile leading to payoffs wi forever. If j\ndeviates, go to IIj.\nSPE? Use the single-shot deviation principle: calculate player i's payoff\nfrom complying with prescribed strategies and check for profitable\ndeviations at every stage of each phase.\nMihai Manea (MIT)\nRepeated Games\nMarch 30, 2016\n9 / 13\n\nDeviations from I and II\nPlayer i's incentives\n▶Phase I: deviating yields at most (1 -δ)M + δ(1 -δT)vi + δT+1v′\ni ,\nwhere M is an upper bound on i's feasible payoffs, and complying\nyields vi. For fixed T, if δ is sufficiently close to 1, complying produces\na higher payoff than deviating, since v′\ni < vi.\n▶Phase IIi: suppose there are T′ ≤T remaining periods in this phase.\nThen complying gives i a payoff of (1 -δT′)vi + δT′v′\ni , whereas\ndeviating can't help in the current period since i is being minmaxed\nand leads to T more periods of punishment, for a total payoff of at\nmost (1 -δT+1)vi + δT+1v′\ni . Thus deviating is worse than complying.\n▶Phase IIj: with T′ remaining periods, i gets\n(1 -δT′)ui(mj) + δT′(v′\ni + ε) from complying and at most\n(1 -δ)M + (δ -δT+1)vi + δT+1v′\ni from deviating. For high δ,\ncomplying is preferred.\nMihai Manea (MIT)\nRepeated Games\nMarch 30, 2016\n10 / 13\n\nDeviations from III\nPlayer i's incentives\n▶Phase IIIi: determines choice of T. By following the prescribed\nstrategies, i receives v′\ni in every period. A (one-shot) deviation leaves\ni with at most (1 -δ)M + δ(1 -δT)vi + δT+1v′\ni . Rearranging, i\ncompares between (δ + δ2 + . . . + δT)(v′\ni -vi) and M -v′\ni . For any\nδ ∈(0, 1), ∃T s.t. former term is grater than latter for δ > δ.\n▶Phase IIIj: Player i obtains v′\ni + ε forever if he complies with the\nprescribed strategies. A deviation by i triggers phase IIi, which yields\nat most (1 -δ)M + δ(1 -δT)vi + δT+1v′\ni for i. Again, for sufficiently\nlarge δ, complying is preferred.\nMihai Manea (MIT)\nRepeated Games\nMarch 30, 2016\n11 / 13\n\nMixed Minmax\nWhat if minmax strategies are mixed? Punishers may not be indifferent\nbetween the actions in the support. . . need to provide incentives for mixing\nin phase II.\nChange phase III strategies so that during phase IIj player i is indifferent\namong all possible sequences of T realizations of his prescribed mixed\naction under mj. Make the reward εi of phase IIIj dependent on the history\nof phase IIj play.\nMihai Manea (MIT)\nRepeated Games\nMarch 30, 2016\n12 / 13\n\nDispensing with Public Randomization\nSorin (1986) shows that for high δ we can obtain any convex combination\nof stage game payoffs as a normalized discounted value of a deterministic\npath (u(at)). . . \"time averaging\"\nFudenberg and Maskin (1991): can dispense of the public randomization\ndevice for high δ, while preserving incentives, by appropriate choice of\nwhich periods to play each pure action profile involved in any given convex\ncombination. Idea is to stay within ε2 of target payoffs at all stages.\nMihai Manea (MIT)\nRepeated Games\nMarch 30, 2016\n13 / 13\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n14.16 Strategy and Information\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "MIT 14.16 S16 Bayesian Games and Auction Lecture Slides",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-16-strategy-and-information-spring-2016/88a1631b5ed6512f32a2ef239830322a_MIT14_16S16_Bayesian.pdf",
      "content": "Bayesian Games and Auctions\nMihai Manea\nMIT\n\nGames of Incomplete Information\n▶Incomplete information: players are uncertain about the payoffs or\ntypes of others\n▶Often a player's type defined by his payoff function.\n▶More generally, types embody any private information relevant to\nplayers' decision making. . . may include a player's beliefs about other\nplayers' payoffs, his beliefs about what other players believe his\nbeliefs are, and so on.\n▶Modeling incomplete information about higher order beliefs is\nintractable. Assume that each player's uncertainty is solely about\npayoffs.\nMihai Manea (MIT)\nBayesian Games and Auctions\nFebruary 22, 2016\n2 / 49\n\nBayesian Game\nA Bayesian game is a list B = (N, S, Θ, u, p) where\n▶N = {1, 2, . . . , n}: finite set of players\n▶Si: set of pure strategies of player i; S = S1 × . . . × Sn\n▶Θi: set of types of player i; Θ = Θ1 × . . . × Θn\n▶ui : Θ × S →R is the payoff function of player i; u = (u1, . . . , un)\n▶p ∈∆(Θ): common prior\nOften assume Θ is finite and marginal p(θi) is positive for each type θi.\nStrategies of player i in B are mappings si : Θi →Si (measurable when Θi\nis uncountable).\nMihai Manea (MIT)\nBayesian Games and Auctions\nFebruary 22, 2016\n3 / 49\n\nFirst Price Auction\n▶One object is up for sale.\n▶Value θi of player i ∈N for the object is uniformly distributed in\nΘi = [0, 1], independently across players, i.e.,\np(θ\nθ\ni ≤\ni, ∀i ∈N) =\nY\nθ i, ∀θi\n,\n∈N\n∈[0, 1] i\ni\n∈N.\n▶Each player i submits a bid si ∈Si = [0, inf).\n▶The player with the highest bid wins the object (ties broken randomly)\nand pays his bid. Payoffs:\nui(θ, s) =\n\nθi-si\n\n|{j∈N|si=sj}|\nif si ≥sj, ∀j ∈N\notherwise.\nMihai Manea (MIT)\nBayesian Games and Auctions\nFebruary 22, 2016\n4 / 49\n\nAn Exchange Game\n▶Player i = 1, 2 receives a ticket on which there is a number from a\nfinite set Θi ⊂[0, 1]. . . prize player i may receive.\n▶The two prizes are independently distributed, with the value on i's\nticket distributed according to Fi.\n▶Each player is asked independently and simultaneously whether he\nwants to exchange his prize for the other player's prize:\nSi = {agree, disagree}.\n▶If both players agree then the prizes are exchanged; otherwise each\nplayer receives his own prize. Payoffs:\nui(θ, s) =\n\nθ\n\n3-i\nif s1 = s2 = agree\nθi\notherwise.\nMihai Manea (MIT)\nBayesian Games and Auctions\nFebruary 22, 2016\n5 / 49\n\nEx-Ante Representation\nIn the ex ante representation G(B) of the Bayesian game B player i has\nstrategies (s\nΘi\ni(θi))θi∈Θi ∈Si --his strategies are functions from types to\nstrategies in B--and utility function Ui given by\nUi\n\nsi(θi)\n\nθi∈Θi\n\ni∈N\n\n= Ep(ui(θ, s1(θ1), . . . , sn(θn))).\nMihai Manea (MIT)\nBayesian Games and Auctions\nFebruary 22, 2016\n6 / 49\n\nInterim Representation\nThe interim representation IG(B) of the Bayesian game B has player set\n∪iΘi. The strategy space of player θi is Si. A strategy profile (sθi)i∈N,θi∈Θi\nyields utility\nUθi((sθi)i∈N,θi∈Θi) = Ep(ui(θ, sθ1, . . . , sθn)|θi)\nfor player θi. Need p(θi) > 0. . .\nMihai Manea (MIT)\nBayesian Games and Auctions\nFebruary 22, 2016\n7 / 49\n\nBayesian Nash Equilibrium\nDefinition 1\nIn a Bayesian game B = (N, S, Θ, u, p), a strategy profile s : Θ →S is a\nBayesian Nash equilibrium (BNE) if it corresponds to a Nash equilibrium of\nIG(B), i.e., for every i ∈N, θi ∈Θi\nEp(·|θi) [ui (θ, si (θi) , s-i (θ-i))] ≥Ep(·|θi)\nh\nui\n\nθ, s′, s\nS\n-i (θ-i)\ni\n, ∀s′ ∈\ni.\ni\ni\nInterim rather than ex ante definition preferred since in models with a\ncontinuum of types the ex ante game has many spurious equilibria that\ndiffer on probability zero sets of types.\nMihai Manea (MIT)\nBayesian Games and Auctions\nFebruary 22, 2016\n8 / 49\n\nConnections to the Complete Information Games\nWhen i plays a best-response type by type, he also optimizes ex-ante\npayoffs (for any probability distribution over Θi). Therefore, a BNE of B is\nalso a Nash equilibrium of the ex-ante game G (B).\nBNE(B): Bayesian Nash equilibria of bayesian game B\nNE(G): Nash equilibria of normal-form game G\nProposition 1\nFor any Bayesian game B with a common prior p,\nBNE (B) ⊆NE (G (B)) .\nIf p (θi) > 0 for all θi ∈Θi and i ∈N, then\nBNE (B) = NE (G (B)) .\nMihai Manea (MIT)\nBayesian Games and Auctions\nFebruary 22, 2016\n9 / 49\n\nBusiness Partnership\nTwo business partners work on a joint project.\n▶Each businessman i = 1, 2 can either exert effort (ei = 1) or shirk\n(ei = 0).\n▶Each face the same fixed (commonly known) cost for effort c < 1.\n▶Project succeeds if at least one partner puts in effort, fails otherwise.\n▶Players differ in how much they care about the fate of the project: i\nhas a private, independently distributed type θi ∼U[0, 1] and receives\npayoff\nθi from success.\nHence player i gets\nθi -c from working,\nθi from shirking if opponent j\nworks, and 0 if both shirk.\ne2 = 1\ne2 = 0\ne1 = 1\nθ2\n1 -c, θ2\n2 -c\nθ2\n1 -c, θ2\ne1 = 0\nθ , θ\n2 -c\n0, 0\nMihai Manea (MIT)\nBayesian Games and Auctions\nFebruary 22, 2016\n10 / 49\n\nEquilibrium\ne2 = 1\ne2 = 0\ne1 = 1\nθ2\n1 -c, θ2\n2 -c\nθ2\n1 -c, θ2\ne1 = 0\nθ , θ\n2 -c\n0, 0\npj: probability that j works--sufficient statistic for strategic situation faced\nby player i\nWorking is rational for i if\nθi -c ≥p\njθ\n(\ni ⇐⇒1 -pj)θi ≥c. Thus i must\nplay a threshold strategy: work for\nθi ≥θi\n∗:=\nr\nc\n.\n1 -pj\nSince pj = Prob(θj ≥θ ) =\nθ\nj\n∗\n1 -\nj\n∗, we get\nθi\n∗=\ns\nc\nθ∗\nj\n=\nv\nt\nc\nq\nc\nθ∗\ni\n=\n4q\ncθ∗\ni ,\nso θ∗\ni =\n3√c. In equilibrium, i = 1, 2 works if θi\n√\n≥\n3 c and shirks otherwise.\nMihai Manea (MIT)\nBayesian Games and Auctions\nFebruary 22, 2016\n11 / 49\n\nAuctions\n▶single good up for sale\n▶n buyers bidding for the good\n▶buyer i has value Xi, i.i.d. with distribution F and continuous density\nf = F′; supp(F) = [0, ω]\n▶i knows only the realization xi of Xi\nMihai Manea (MIT)\nBayesian Games and Auctions\nFebruary 22, 2016\n12 / 49\n\nAuction Formats\n▶First-price sealed-bid auction: each buyer submits a single bid (in a\nsealed envelope) and the highest bidder obtains the good and pays\nhis bid. Equivalent to descending-price (Dutch) auctions.\n▶Second-price sealed-bid auction: each buyer submits a bid and the\nhighest bidder obtains the good and pays the second highest bid.\nEquivalent to open ascending-price (English) auctions.\nBidding strategies: βi : [0, ω] →[0, inf)\n▶What are the BNEs in the two auctions?\n▶Which auction generates higher revenue?\nMihai Manea (MIT)\nBayesian Games and Auctions\nFebruary 22, 2016\n13 / 49\n\nSecond-Price Auction\nEach bidder i submits a bid bi, payoffs given by\nxi -maxj i bj\nif bi > maxj i bj\nu\n,\ni =\n,\nif bi < maxj,i bj\nTies broken randomly.\nProposition 2\nIn a second-price auction, it is a weakly dominant strategy for every player\ni to bid according to\nII\nβ (\ni xi) = xi.\nMihai Manea (MIT)\nBayesian Games and Auctions\nFebruary 22, 2016\n14 / 49\n\nSecond-Price Auction Expected Payments\nY1 = maxi,1 Xi: highest value of player 1's opponents, distributed\naccording to G with G(y) = F(y n) -1\nExpected payment by a bidder with value x is\nmII(x) = Prob[Win] × E[2nd highest bid | x is the highest bid]\n= Prob[Win] × E[2nd highest value | x is the highest value]\n= G(x) × E[Y1|Y1 < x]\nMihai Manea (MIT)\nBayesian Games and Auctions\nFebruary 22, 2016\n15 / 49\n\nFirst-Price Auction\nEach bidder i submits a bid bi, payoffs given by\nxi\nbi\nif bi > maxj\nu\n,i bj\ni =\n\n-\nif bi < maxj,i bj\nTies broken randomly.\n\nClearly, not optimal/equilibrium to bid own value. Trade-off: higher bids\nincrease the probability of winning but decrease the gains.\nSymmetric equilibrium: βi = β for all buyers i. Assume β strictly increasing,\ndifferentiable.\nMihai Manea (MIT)\nBayesian Games and Auctions\nFebruary 22, 2016\n16 / 49\n\nOptimal Bidding\nSuppose bidder 1 has value X1 = x and considers bidding b. Clearly,\nb ≤β(ω) and β(0) = 0.\nBidder 1 wins the auction if maxi,1 β(Xi) < b. Since β is s. increasing,\nmaxi,1 β(X\ni) = β(maxi,1 Xi) = β(Y1), so 1 wins if Y1 < β-(b). His\nexpected payoff is\nG(β-1(b)) × (x -b).\nG′(β-1(b))\nFOC :\n-\n(x\nb) -G(β-(b)) = 0\nβ′(β-1(b))\nb = β(x) ⇒G(x)β′(x) + G′(x)β(x) = xg(x) ⇐⇒(G(x)β(x))′ = xg(x)\nβ(0) = 0 ⇒β(x) =\nx\nG(x)\nZ\nyg(y)dy\n= E[Y1|Y1 < x].\nMihai Manea (MIT)\nBayesian Games and Auctions\nFebruary 22, 2016\n17 / 49\n\nEquilibrium\nProposition 3\nThe strategies\nIβ (x) = E[Y1|Y1 < x]\nconstitute a symmetric BNE in the first-price auction.\nMihai Manea (MIT)\nBayesian Games and Auctions\nFebruary 22, 2016\n18 / 49\n\nProof\nWe only checked necessary conditions for equilibrium. . . Check that if all\nbidders follow strategy\nIβ then it is optimal for bidder 1 to follow it. Since\nIβ\nis increasing and continuous, it cannot be optimal to bid higher than\nIβ (ω).\nSuppose bidder 1 with value x bids b ∈[0\nI\n, β (ω)]. ∃z\nI\n, β (z) = b. Since\nbidder 1 wins if Y1 < z, his payoffs are\nΠ(b, x\nI\n) = G(z)[x -β (z)]\n= G(z)x -G(z)E[Y1|Y1 < z]\nz\n= G(z)x -\nZ\nyg(y)dy\nz\n= G(z)x -G(z)z +\nZ\nG(y)dy\nz\n= G(z)(x -z) +\nZ\nG(y)dy.\nThen\nz\nI\nΠ(β (x), x) -\nI\nΠ(β (z), x) = G(z)(z -x) -\nZ\nG(y)dy\nx\n≥0.\nMihai Manea (MIT)\nBayesian Games and Auctions\nFebruary 22, 2016\n19 / 49\n\nShading\nI\nβ (x)\n=\nx\nG(x)\nZ\nyg(y)dy\n=\nx -\nZ x G(y)\nG(x)dy\n=\nx -\nZ x\n\"F(y) n\nF(x)\n# -1\ndy\nShading, the amount by which the bid is lower than the value, is\nZ x\n\"F(y) n\nF(x)\n# -1\ndy.\nDepends on n, converges to 0 as n →inf(competition).\nMihai Manea (MIT)\nBayesian Games and Auctions\nFebruary 22, 2016\n20 / 49\n\nExample with Uniformly Distributed Values\nIf F(x) = x for x ∈[0\nn 1\n, 1], then G(x) = x -and\nI\nn\nβ (x) =\n-\nn\nx.\nMihai Manea (MIT)\nBayesian Games and Auctions\nFebruary 22, 2016\n21 / 49\n\nExample with Exponentially Distributed Values\nIf n = 2 and F(x) = 1 -exp(-λx) for x ∈[0, inf) (λ > 0) then\nI\n)\nβ (x) = x\nZ x F(y\n-\nF(x)dy\n= 1\nλ -\nx exp(-λx)\n1 -exp(-λx)\nNote that E[X] = 1/λ.\nTake λ = 1. A bidder with value $106 will not bid more than $1. Why?\nSuch a bidder has a lot to lose by not bidding higher but the probability of\nlosing is small, exp(-106).\nMore generally, for n = 2,\nIβ (x) = E[Y1|Y1 < x] ≤E[Y1] = E[X2].\nMihai Manea (MIT)\nBayesian Games and Auctions\nFebruary 22, 2016\n22 / 49\n\nRevenue Comparison\nExpected payment in the first-price auction by a bidder with value x is\nmI(x) = Prob[Win] × Amount bid = G(x) × E[Y1|Y1 < x]\nRecall that\nmII(x) = G(x) × E[Y1|Y1 < x],\nso both auctions yield the same revenue. Special case of the revenue\nequivalence theorem.\nMihai Manea (MIT)\nBayesian Games and Auctions\nFebruary 22, 2016\n23 / 49\n\nMechanism Design\nAn auction is one of many mechanisms a seller can use to sell the good.\nThe price is determined by the competition among buyers according to the\nrules set out by the seller--the auction format.\nThe seller could use other methods\n▶post different prices for each bidder, choose a winner at random\n▶ask various subsets of bidders to pay their own or others' bids\nOptions virtually unlimited. . .\nMyerson (1981): What is the optimal mechanism?\nMihai Manea (MIT)\nBayesian Games and Auctions\nFebruary 22, 2016\n24 / 49\n\nFramework\n▶single good up for sale, worth 0 to the seller\n▶buyers: 1, 2, . . . , n\n▶buyers have private values, independently distributed\n▶buyer i's value Xi distributed according to Fi\n▶supp(Fi) = [0, ωi] = Xi, density fi = Fi\n′\n▶i knows only the realization xi of Xi\n▶X = Qn\ni=1 X\nQ\ni\nn\n▶f(x) =\ni=1 fi(xi)\n▶f\nx\nf x\n-i( -i) = Q\nj,i j( j)\nMihai Manea (MIT)\nBayesian Games and Auctions\nFebruary 22, 2016\n25 / 49\n\nMechanisms\nA selling mechanism (B, π, μ)\n▶Bi: set of messages (bids) for buyer i\n▶allocation rule π : B →∆(N)\n▶payment rule μ : B →Rn\nThe allocation rule determines, as a function of all n messages b, the\nprobability πi(b) that i gets the object. Similarly the payment rule specifies\na payment μi(b) for each buyer i.\nDescribe first- and second-price auctions as mechanisms. . .\nEvery mechanism induces a game of incomplete information with\nstrategies βi : Xi →Bi.\nMihai Manea (MIT)\nBayesian Games and Auctions\nFebruary 22, 2016\n26 / 49\n\nDirect Mechanisms\nMechanisms can be complicated, no assumptions on the messages Bi.\nDirect mechanism (Q, M)\n▶Bi = Xi, every buyer is asked to directly report a value\n▶Q : X →∆(N) and M : X →Rn\n▶Qi(x): probability that i gets the object\n▶Mi(x): payment by i\nIf βi : Xi →Xi with βi(xi) = xi constitutes a BNE of the induced game then\nwe say that the direct mechanism has a truthful equilibrium or is incentive\ncompatible.\nMihai Manea (MIT)\nBayesian Games and Auctions\nFebruary 22, 2016\n27 / 49\n\nThe Revelation Principle\nProposition 4\nGiven a mechanism and an equilibrium for that mechanism, there exists a\ndirect mechanism in which (i) it is an equilibrium for each buyer to report\nhis or her value truthfully and (ii) the outcomes are the same as in the\ngiven equilibrium of the original mechanism for every type realization x.\nConsider a mechanism (B, π, μ) with an equilibrium β. Define\nQ : X →∆(N) and M : X →RN as follows: Q(x) = π(β(x)) and\nM(x) = μ(β(x)). The direct mechanism (Q, M) asks players to report\ntypes and does the \"equilibrium computation\" for them.\n(ii) holds by construction.\nTo verify (i): if buyer i finds it profitable to report zi instead of his true value\nxi in the direct mechanism (Q, M), then i prefers the message βi(zi)\ninstead of βi(xi) in the original mechanism.\nMihai Manea (MIT)\nBayesian Games and Auctions\nFebruary 22, 2016\n28 / 49\n\nIncentive Compatibility\nFor a direct mechanism (Q, M), define\nqi(zi)\n=\nZ\nQi(zi, x i)f i(x i\nX i\n-\n-\n-)dx-i\n-\nmi(zi)\n=\nZ\nMi(zi, x i)f i\nX-i\n-\n-(x-i)dx-i\nExpected payoff of buyer i with value xi who reports zi if other buyers\nreport truthfully\nqi(zi)xi -mi(zi)\n(Q, M) is incentive compatible (IC) if\nUi(xi) ≡qi(xi)xi -mi(xi) ≥qi(zi)xi -mi(zi), ∀i, xi, zi\nUi is convex because\nUi(xi) = max{qi(zi)xi -mi(zi) | zi ∈Xi}.\nMihai Manea (MIT)\nBayesian Games and Auctions\nFebruary 22, 2016\n29 / 49\n\nPayoff Formula\nSince\nqi(xi)zi -mi(xi) = qi(xi)xi -mi(xi) + qi(xi)(zi -xi)\n= Ui(xi) + qi(xi)(zi -xi),\nIC requires that\nUi(zi) ≥Ui(xi) + qi(xi)(zi -xi).\nHence\nqi(zi)(zi -xi) ≥Ui(zi) -Ui(xi) ≥qi(xi)(zi -xi).\nFor zi > xi,\nU\nqi(zi) ≥\ni(zi) -Ui(xi)\n)\nz\n≥q x\ni -x\ni( i ,\ni\nso qi is increasing. Since Ui is convex, it is differentiable almost\neverywhere,\nU (\ni\n′ xi) = qi(xi)\nZ xi\nUi(xi) = Ui(0) +\nqi(ti)dti\nMihai Manea (MIT)\nBayesian Games and Auctions\nFebruary 22, 2016\n30 / 49\n\nMonotonicity Condition\nIC implies monotonicity of qi.\nConversely, a mechanism where Ui satisfies\nxi\nUi(xi) = Ui(0) +\nZ\nqi(ti)dti\nwith qi increasing must be incentive compatible. IC condition\nUi(zi) -Ui(xi) ≥qi(xi)(zi -xi)\nboils down to\nZ zi\nqi(ti)dti\nxi\n≥qi(xi)(zi -xi).\nMihai Manea (MIT)\nBayesian Games and Auctions\nFebruary 22, 2016\n31 / 49\n\nRevenue Equivalence\nUi(xi) = Ui(0) +\nZ xi\nqi(ti)dti\nTheorem 1\nIf the direct mechanism (Q,M) is incentive compatible, then for all i and xi,\nxi\nmi(xi) = mi(0) + qi(xi)xi -\nZ\nqi(ti)dti.\nThe expected payments in any two incentive compatible mechanisms with\nthe same allocation rule are equivalent up to a constant.\nxi\nUi(xi) = qi(xi)xi -mi(xi) = Ui(0) +\nZ\nqi(ti)dti\nMihai Manea (MIT)\nBayesian Games and Auctions\nFebruary 22, 2016\n32 / 49\n\nFirst-Price Auction Revisited\nn symmetric buyers\nAssuming a symmetric monotone equilibrium β in first-price auction, the\nhighest value buyer obtains the good. Same allocation Q as in the\nequilibrium of the second-price auction. Buyers with value 0 bid 0, so\nUi(0) = 0 in both auctions. By Theorem 1,\nmI(x) = mII(x).\nSince\nmI(x)\n=\nG(x) × β(x)\nmII(x)\n=\nG(x) × E[Y1|Y1 < x],\nwe obtain β(x) = E[Y1|Y1 < x].\nMihai Manea (MIT)\nBayesian Games and Auctions\nFebruary 22, 2016\n33 / 49\n\nAll-Pay Auction\nn symmetric buyers. Highest bidder receives the good, but all buyers have\nto pay their bid (as in lobbying).\nAssuming a symmetric monotone equilibrium β in the all-pay auction, the\nhighest value buyer obtains the good. Same allocation Q as in the\nequilibrium of the second-price auction. Buyers with value 0 bid 0, so\nUi(0) = 0 in both auctions. By Theorem 1,\nmall-pay\nII\n(x) = m (x) = G(x) × E[Y1|Y1 < x].\nSince mall-pay(x) = β(x),\nβ(x) = G(x) × E[Y1|Y1 < x].\nUnderbidding compared to first- and second-price auctions.\nCan use revenue equivalence with the second-price auction to derive\nequilibrium in any auction where we expect efficient allocation.\nMihai Manea (MIT)\nBayesian Games and Auctions\nFebruary 22, 2016\n34 / 49\n\nIndividual Rationality\nA mechanism is individually rational (IR) if Ui(xi) ≥0 for all xi ∈Xi.\nxi\nUi(xi) = Ui(0) +\nZ\nqi(ti)dti\n≥0, ∀xi ∈Xi ⇐⇒Ui(0) = -mi(0) ≥0\nMihai Manea (MIT)\nBayesian Games and Auctions\nFebruary 22, 2016\n35 / 49\n\nExpected Revenue\nIn a direct mechanism (Q, M), the expected revenue of the seller is\nn\nE[R] =\nX\nE[mi(Xi)].\ni=1\nSubstitute the form\nE[mi(Xi)]\n=\nZula for mi,\nωi\nmi(xi)fi(xi)dxi\n=\nmi(0) +\nZ ωi\nωi\nxi\nqi(xi)xifi(xi)dxi\nqi(ti)fi(xi)dtidxi.\n-\nZ\nZ\nInterchanging the order of integration,\nZ ωi Z xi\nωi\nωi\nωi\nqi(ti)fi(xi)dtidxi =\nZ\nZ\nqi(ti)fi(xi)dxidti =\nZ\n(1-Fi(ti))qi(ti)dti\nti\nωi\nFi(xi)\nE[mi(Xi)] = mi(0) +\nZ\n\nxi\n-\n-\nqi(xi)fi(xi)dxi\nZ\nfi(xi)\n1 -Fi(xi)\n!\n= mi(0) +\nxi\nX\n-\nfi(xi)\n!\nQi(x)f(x)dx\nMihai Manea (MIT)\nBayesian Games and Auctions\nFebruary 22, 2016\n36 / 49\n\nOptimal Mechanism\nThe seller's objective is to maximize revenue,\nX\nn\nZ X\nn\n1 -Fi(xi)\nmi(0) +\nxi\nX\ni=1\ni=1\n-\nQ\nf\ni(xi)\n!\ni(x) (x)dx\nf\nsubject to IC and IR. IC is equivalent to qi being increasing for every i and\nIR to mi(0) ≤0. Clearly, need to set mi(0) = 0.\nMaximize\nZ X\nn\nFi(xi)\nψi(xi)Qi(x)f(x)dx\nwhere\nψi(xi) := xi\n-\nX i=1\n-\nfi(xi)\nsubject to qi being increasing for every i.\nψi(xi): virtual value of player i with type xi\nRegularity condition: assume ψi is s. increasing for every i\nMihai Manea (MIT)\nBayesian Games and Auctions\nFebruary 22, 2016\n37 / 49\n\nOptimal Solution\nIgnoring the qi monotonicity condition, maximize for every x\nX\nn\nψi(xi)Qi(x).\ni=1\nSet\nQi(x) > 0 ⇐⇒ψi(xi) = max ψj(xj)\n.\n∈N\n≥0\nj\nx\nTo obtain mi(xi) = mi(0) + qi(xi)x\ni\ni -\nR\nqi(ti)dti, define\nMi(x) = Qi(x)xi -\nZ xi\nQi(zi, x\n-i)dzi.\n(Q, M) is an optimal mechanism. Only need to check implied qi is\nincreasing. If zi < xi, regularity implies ψi(zi) < ψi(xi), which means that\nQi(zi, x-i) ≤Qi(xi, x-i).\nE[R] = E[max(ψ1(X1), ψ2(X2), ..., ψn(Xn), 0)]\nMihai Manea (MIT)\nBayesian Games and Auctions\nFebruary 22, 2016\n38 / 49\n\nOptimal Auction\nSmallest value needed for i to win against opponent types x-i:\nyi(x-i) = inf{zi : ψi(zi) ≥0 and ψi(zi) ≥ψj(xj), ∀j , i}\nIn the optimal mechanism,\n(\nQi(zi, x i) =\nif z\nx\n\ni > yi\n-i)\n-\n\n.\nif zi < yi(x-i)\nThen\nxi\nxi\nMi(x) = Qi(x)xi -\nZ\nQi(zi, x-i)dzi\n=\nZ\n(Qi(xi, x i)\nQi(zi, x i))dzi\n-\n-\n-\nyi(x i\nif\n-)\nQi(x) = 1\n=\n.\nif Qi(x) = 0\nThe player with the highest positive virtual v\n\nalue wins. Only the winning\nplayer has to pay and he pays the smallest amount needed to win.\nMihai Manea (MIT)\nBayesian Games and Auctions\nFebruary 22, 2016\n39 / 49\n\nSymmetric Case\nSuppose Fi = F, so ψi = ψ and\nyi(x i) = max\n\nψ-1(0\nmax\n-\n),\nxj\nj,i\n!\nIn the optimal mechanism,\nif zi > yi(x i)\nQi(zi, x-i) =\n-\nif zi < yi(x-i)\nand\n\nyi(x\n\ni)\nif Q\nMi(x) =\n-\ni(x) = 1\n\n.\nif Qi(x) = 0\nProposition 5\nSuppose the design problem is regular and symmetric. Then the\nsecond-price auction with a reserve price r∗= ψ-1(0) is an optimal\nmechanism.\nMihai Manea (MIT)\nBayesian Games and Auctions\nFebruary 22, 2016\n40 / 49\n\nIntuition for Virtual Values\nWhy is it optimal to allocate the object based on virtual values?\nConsider a single buyer whose value is distributed according to F. The\nseller sets price p to maximize p(1 -F(p)),\nFOC : 1 -F(p) -pf(p) = 0 ⇐⇒ψ(p) = 0.\nAlternatively, setting the probability (or quantity) of purchase q = 1 -F(p),\nseller obtains price p(q) = F-1(1 -q). The revenue function is\nR(q) = q × p(q) = qF-1(1 -q)\nwith\nq\nR′(q)\nF-1\n=\n(1 -q) -\n.\nF′(F-1(1 -q))\nSubstituting p = F-1(1 -q),\nR′(q) = p\n-F(p)\n-\n= ψ(p).\nf(p)\nThe seller sets the monopoly price p where marginal revenue ψ(p) is 0,\ni.e., p = ψ-1(0).\nMihai Manea (MIT)\nBayesian Games and Auctions\nFebruary 22, 2016\n41 / 49\n\nOptimal Auction and Virtual Values\nWhen facing multiple buyers, the optimal mechanism calls for the seller to\nset a discriminatory reserve price r∗\n-1\n= ψ\n(\ni\ni\n0) for each buyer i. If xi < ri\n∗\nfor every buyer i, the seller keeps the object. Otherwise, the object is\nallocated to the buyer generating the highest marginal revenue. The\nwinning buyer pays pi = yi(x-i), the smallest value needed to win.\nOptimal auction is inefficient: with positive probability, the object is not\nallocated to a buyer even though it is worth 0 to the seller and has positive\nvalues for buyers.\nMihai Manea (MIT)\nBayesian Games and Auctions\nFebruary 22, 2016\n42 / 49\n\nOptimal Auction Favors Weak Buyers\nTwo buyers with regular cdf's F1 and F2 s.t. supp F1 = supp F2 = [0, ω]\nand\nf1(x)\n1 -F1(x) <\nf2(x)\n, x\n1 -F2(x) ∀\n∈[0, ω].\nBuyer 2 is relatively disadvantaged because his value is likely to be lower.\nF1 first-oder stochastically dominates F2, i.e., F2(x) ≥F1(x) for x ∈[0, ω].\nCheck this by integrating the inequality above for x ∈[0, z] to obtain\n-log(1 -F1(z)) ≤-log(1 -F2(z)).\nReserve prices r1\n∗and r2\n∗satisfy\n1 -F1(r∗)\n-\nψ2(r ) = 0 = ψ\n∗\n1(r1\n∗) = r1\n∗\nf1(r∗\n1)\n< r∗\n1 -\n1 -F2(r∗\n1) = ψ\nf2(r1\n∗\n2(r1\n∗).\n)\nThen ψ2(r )\n∗< ψ2(r1\n∗) implies r2\n∗< r1\n∗.\nMihai Manea (MIT)\nBayesian Games and Auctions\nFebruary 22, 2016\n43 / 49\n\nMore on Discrimination and Inefficiency\nWhen both buyers have the same value x > r1\n∗, buyer 2 obtains the good in\nthe optimal mechanism because\n)\n0 < ψ1 x) = x\n-F\n-\n1(x\n(\nf1(x)\n< x -1 -F2(x) = ψ2(x).\nf2(x)\nFor small ε > 0, ψ1(x) < ψ2(x -ε) so buyer 2 gets the good even if\nx2 = x -ε when x1 = x.\nSecond type of inefficiency: object not allocated to the highest value buyer\nMihai Manea (MIT)\nBayesian Games and Auctions\nFebruary 22, 2016\n44 / 49\n\nApplication to Bilateral Trade\nMyerson and Satterthwaite (1983)\n▶seller with privately known cost C; cdf Fs, density fs > 0, supp [c, c]\n▶buyer with privately known value V; cdf Fb, density fb > 0, supp [v, v]\n▶c < v < c < v\nA direct mechanism (Q, M) specifies the probability of trade Q(c, v) and\nthe transfer M(c, v) from the buyer to the seller for every reported profile\n(c, v).\nIs there any efficient mechanism (Q(c, v) = 1 if c < v and Q(c, v) = 0 if\nc > v) that is individually rational and incentive compatible?\nMihai Manea (MIT)\nBayesian Games and Auctions\nFebruary 22, 2016\n45 / 49\n\nMore General Mechanisms\nUseful to allow for mechanisms (Q, Ms, Mb) where Ms denotes the transfer\nto the seller and Mb the transfer from the buyer. (Q, M) special case with\nMb = Ms.\nAlternative question: is there an efficient mechanism (Q, Ms, Mb) that is\nindividually rational and incentive compatible, which does not run a budget\ndeficit, i.e.,\nZ c\nc\nZ v\nv\n(Mb(c, v) -Ms(c, v))fb(v)fs(c)dvdc ≥0?\nIf the answer is negative, then the answer to the initial question is negative.\nMihai Manea (MIT)\nBayesian Games and Auctions\nFebruary 22, 2016\n46 / 49\n\nRevenue Equivalence\nqb(v) =\nZ c\nc\nQ(c, v)fs(c)dc\n&\nmb(v) =\nZ c\nc\nMb(c, v)fs(c)dc\nIncentive compatibility for the buyer requires\nUb(v) ≡qb(v)v -mb(v) ≥qb(v′)v -mb(v′), ∀v′ ∈[v, v].\nAs before,\nUb(v) = Ub(v) +\nZ v\nv\nqb(v′)dv′,\nwhich implies that mb(v) = -Ub(v) + f(v, Q).\nSimilarly, Us(c) = ms(c) -qs(c)c = Us(c) +\nR c\nc qs(c′)dc′ and\nms(c) = Us(c) + g(c, Q).\nFor every incentive compatible mechanism (Q, Ms, Mb),\nZ c\nc\nZ v\nv\n(Mb(c, v) -Ms(c, v))fb(v)fs(c)dvdc = -Ub(v) -Us(c) + h(Q).\nMihai Manea (MIT)\nBayesian Games and Auctions\nFebruary 22, 2016\n47 / 49\n\nThe Vickrey-Clarke-Groves (VCG) Mechanism\nFix efficient allocation Q and consider the following payments. If v > c\nthen set Mb(c, v) = max(c, v) and Ms(c, v) = min(v, c). Otherwise,\nMb(c, v) = Ms(c, v) = 0.\n(Q, Ms, Mb) is incentive compatible (similar argument to the second-price\nauction with reserve).\nSince Ub(v) = Us(c) = 0,\nh(Q)\n=\nZ c\nc\nZ v\nv\n(Mb(c, v) -Ms(c, v))fb(v)fs(c)dvdc\n=\nZ c\nc\nZ v\n(max(c, v\nc\n) -min(v, c))fb(v)fs(c)dvdc\n=\nZ c\nc\nZ v\nc\n(max(c, v) + max(-v, -c))fb(v)fs(c)dvdc\n=\nZ c\nc\nZ v\n(max(c\nc\n-v, v -v, c -c, v -c))fb(v)fs(c)dvdc < 0.\nMihai Manea (MIT)\nBayesian Games and Auctions\nFebruary 22, 2016\n48 / 49\n\nNegative Result\nSuppose (Q, Ms, Mb) is an efficient mechanism that is individually rational\nand incentive compatible.\nIn light of the VCG mechanism, efficiency and incentive compatibility imply\nh(Q) < 0. Individual rationality requires Ub(v), Us(c) ≥0. Then\nZ c\nc\nZ v\nv\n(Mb(c, v) -Ms(c, v))fb(v)fs(c)dvdc = -Ub(v) -Us(c) + h(Q) < 0.\nEvery efficient, individually rational, and incentive compatible mechanism\nmust run a budget deficit.\nTheorem 2\nIf c < v < c < v, there exists no efficient bilateral trade mechanism\n(Q, Mb, Ms) with Mb = Ms that is individually rational and incentive\ncompatible.\nMihai Manea (MIT)\nBayesian Games and Auctions\nFebruary 22, 2016\n49 / 49\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n14.16 Strategy and Information\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "MIT 14.16 S16 Cooperative Games Lecture Slides",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-16-strategy-and-information-spring-2016/934c419edafdd09ac7bb8835e17ff3ee_MIT14_16S16_cooperative.pdf",
      "content": "Cooperative Games\nMihai Manea\nMIT\n\nCoalitional Games\nA coalitional (or cooperative) game is a model that focuses on the behavior\nof groups of players. The strategic interaction is not explicitly modeled as\nin the case of non-cooperative games.\n▶N: finite set of players\n▶a coalition is any group of players, S ⊆N (N is the grand\ncoalition)\n▶v(S) ≥0: worth of coalition S\n▶S can divide v(S) among its members; S may implement any payoffs\n(xi)i\nwith\n∈S\nP\ni∈S xi = v(S) (no externalities)\n▶outcome: a partition (Sk)\nallocation\nk=1,...,k of N and an\n(xi)i∈N\nspecifying the division of the worth of each Sk among its members,\nk\nSj ∩Sk = ∅, ∀j , k &\nSk = N\nX\nk\n[\n=1\nxi = v(Sk),\ni∈S\n∀k ∈{1, . . . , k }\nk\nMihai Manea (MIT)\nCooperative Games\nApril 25, 2016\n2 / 32\n\nExamples\nA majority game\n▶Three parties (players 1,2, and 3) can share a unit of total surplus.\n▶Any majority--coalition of 2 or 3 parties--may control the allocation of\noutput.\n▶Output is shared among the members of the winning coalition.\nv({1}) = v({2}) = v({3}) = 0\nv({1, 2}) = v({1, 3}) = v({2, 3}) = v({1, 2, 3}) = 1\nFirm and workers\n▶A firm, player 0, may hire from the pool of workers {1, 2, . . . , n}.\n▶Profit from hiring k workers\nis f(k).\nf(|S| -1)\nif 0\nv(S) =\n∈S\notherwise\nMihai Manea (MIT)\nCooperative Games\nApril 25, 2016\n3 / 32\n\nThe Core\nSuppose that it is efficient for the grand coalition to form:\nk\nv(N) ≥\nX\nv(Sk) for every partition (Sk)k=1,...,k of N.\nk=1\nWhich allocations (xi)i∈N can the grand coalition choose? No coalition S\nshould want to break away from (xi)i N and implement a division of v\n∈\n(S)\nthat all its members prefer to (xi)i∈N.\nFor an allocation (xi)i\n, use notation x\nx . Allocation x\nis\n∈N\nS = P\ni∈S\ni\n( i)i∈N\nfeasible for the grand coalition if xN = v(N).\nDefinition 1\nCoalition S can block the allocation (xi)i∈N if xS < v(S). An allocation is in\nthe core of the game if (1) it is feasible for the grand coalition; and (2) it\ncannot be blocked by any coalition. C denotes the set of core allocations,\nC = (xi)i∈N\nxN = v(N) & xS ≥v(S), ∀S ⊆N .\nMihai Manea (MIT)\nCooperative Games\nApril 25, 2016\n4 / 32\n\nExamples\n▶Two players split $1, with outside options p and q\nv({1}) = p, v({2}) = q, v({1, 2}) = 1\nC = {(x1, x2)|x1 + x2 = 1, x1 ≥p, x2 ≥q}\nWhat happens for p = q = 0? What if p + q > 1?\n▶The majority game\nv({1}) = v({2}) = v({3}) = 0\nv({1, 2}) = v({1, 3}) = v({2, 3}) = v({1, 2, 3}) = 1\nC =?\n▶A set A of 1000 sellers interacts with a set B of 1001 buyers in a\nmarket for an indivisible good. Each seller supplies one unit of the\ngood and has reservation value 0. Every buyer demands a single unit\nand has reservation price 1.\nv(S) = min(|S ∩A|, |S ∩B|)\nC =?\nMihai Manea (MIT)\nCooperative Games\nApril 25, 2016\n5 / 32\n\nBalancedness\nWhich games have nonempty core?\nA vector (λS ≥0)S⊆N is balanced if\nX\nλS = 1,\nS N i S\n∀i ∈N.\n{ ⊆| ∈}\nA payoff function v is balanced if\nX\nλSv(S)\nS⊆N\n≤v(N) for every balanced λ.\nInterpretation: each player has a unit of time, which can be distributed\namong his coalitions. If each member of coalition S is active in S for λS\ntime, a payoff of λSv(S) is generated. A game is balanced if there is no\nallocation of time across coalitions that yields a total value > v(N).\nMihai Manea (MIT)\nCooperative Games\nApril 25, 2016\n6 / 32\n\nBalancedness is Necessary for a Nonempty Core\nSuppose that C , ∅and consider x ∈C. If (λS)S⊆N is balanced, then\nX\nλSv(S) ≤\nX\nλSxS =\ni\n⊆N\nS⊆N\nX\nx\nS\ni∈N\nX\nλS =\nS∋i\nX\nxi = v(N).\ni∈N\nHence v is balanced.\nBalancedness turns out to be also a sufficient condition for the\nnon-emptiness of the core. . .\nMihai Manea (MIT)\nCooperative Games\nApril 25, 2016\n7 / 32\n\nNonempty Core\nTheorem 1 (Bondareva 1963; Shapley 1967)\nA coalitional game has non-empty core iff it is balanced.\nMihai Manea (MIT)\nCooperative Games\nApril 25, 2016\n8 / 32\n\nProof\nConsider the linear program\nX :=\nmin\nX\nxi\ni∈N\ns.t.\nX\nxi ≥v(S), ∀S ⊆N.\ni∈S\nC , ∅⇐⇒X ≤v(N) (1)\nDual program\nY :=\nmax\nS\nX\nλSv(S)\n⊆N\ns.t.\nλS ≥0, ∀S ⊆N &\nX\nλS = 1, ∀i\nN\nS∋i\n∈\n.\nv is balanced ⇐⇒Y ≤v(N) (2)\nThe primal linear program has an optimal solution. By the duality theorem\nof linear programming, X = Y (3).\n(1)-(3): C , ∅⇐⇒v is balanced\nMihai Manea (MIT)\nCooperative Games\nApril 25, 2016\n9 / 32\n\nSimple Sufficient Condition for Nonempty Cores\nDefinition 2\nA game v is convex if for any pair of coalitions S and T,\nv(S ∪T) + v(S ∩T) ≥v(S) + v(T).\nConvexity implies that the marginal contribution of a player i to a coalition\nincreases as the coalition expands,\nS ⊂T & i < T =⇒v(T ∪{i}) -v(T) ≥v(S ∪{i}) -v(S).\nIndeed, if v is convex then\nv((S ∪{i}) ∪T) + v((S ∪{i}) ∩T) ≥v(S ∪{i}) + v(T),\nwhich can be rewritten as\nv(T ∪{i}) -v(T) ≥v(S ∪{i}) -v(S).\nMihai Manea (MIT)\nCooperative Games\nApril 25, 2016\n10 / 32\n\nConvex Games Have Nonempty Cores\nTheorem 2\nEvery convex game has a non-empty core.\nDefine the allocation x with xi = v({1, . . . , i}) -v({1, . . . , i -1}). Prove that\nx ∈C. For all i1 < i2 < · · · < ik,\nX\nk\nxij\n=\nj=1\nX\nk\nv( 1, . . . , ij\n1, ij )\nv( 1, . . . , ij\n1 )\nj=1\n{\n-\n} -\n{\n-}\nk\n≥\nX\nv({i1, . . . , ij 1, ij}) -v\ni\n-\n(\nj=1\n{ 1, . . . , ij-1})\n=\nv({i1, i2, . . . , ik}),\nwhere the inequality follows from {i1, . . . , ij-1} ⊆{1, . . . , ij -1} and v's\nconvexity.\nMihai Manea (MIT)\nCooperative Games\nApril 25, 2016\n11 / 32\n\nCore Tatonnement\nˆ\nConsider a game v with C , ∅.\n▶e(S; x) = v(S) -xS: excess of coalition S at allocation x\n▶D(x) ⊆2N: most discontent coalitions at x,\nD(x) = arg max w(S)e(S; x)\nS∈N\nwhere w : 2N →(0, inf) describes coalitions' relative ability of\nexpressing discontent and threatening to block\nFor any feasible allocation x0, consider the following recursive process.\nFor t = 1, 2, . . .\n▶if xt-1 ∈C, then xt = xt-1;\nt 1\nt 1\nt 1\n▶otherwise, one coalition S -\nD(x -) most discontent with x -is\nchosen and e St 1\n∈\n-\nxt-1 is transferred symmetrically from N \\ St-1\n(\n;\n)\nto\nSt-1,\nt 1\ne\n-1\n(St\n;xt-)\n+\nxt\ni\n\nx\n=\n\ni\n-\n\n|St-1|\nif i ∈St-1\nxt-1\ni\n-e(St-1;xt-1)\n|N\\St-1|\nif i ∈N \\ St-1 .\nMihai Manea (MIT)\nCooperative Games\nApril 25, 2016\n12 / 32\n\nCore Convergence Result\nTheorem 3\nThe sequence (xt) converges to a core allocation.\nFor intuition, view allocations x as elements of RN.\nxt\n▶(\n) is confined to the hyperplane {x|xN = v(N)}.\n▶Assume that (xt) does not enter C.\n▶At each step t, the reallocation is done such that xt+1 is the projection\nof xt on the hyperplane FSt, where FS = {x|xS = v(S) & xN = v(N)}.\n▶Distance from xt to FSt is proportional to e(St; xt).\n▶For any fixed c ∈C, since xt and c are on different sides of the\nhyperplane FSt and the line xtxt+1 is perpendicular to FSt, we have\nxt[\nxt+1c > π/2 and d(xt, c)\nt\n≥d\nt\n(x +1, c) for all t ≥0.\n▶lc := limt\nd\n→inf\n(x , c)\nMihai Manea (MIT)\nCooperative Games\nApril 25, 2016\n13 / 32\n\nContinuation of Proof Sketch\n▶For any limit point x of (xt), there exists a subsequence of (xt)\nconverging to x and a coalition S such that St = S along the\nsubsequence.\n▶The projection of the subsequence on FS converges to the projection\ny of x on S ⇒y is also a limit point.\n▶If x < FS (x , y), then for any c ∈C the segment xc is longer than yc\nbecause xyc > π/2. This contradicts d(x, c) = d(y, c) = lc.\n▶Therefore\nd\n, x ∈FS and e(S; x) = 0. Then x ∈C since, by continuity, S\nis one of the most discontent coalitions under x ⇒lx = 0.\n▶Any other limit point z satisfies d(z, x) = lx = 0, so z = x.\n▶(xt) converges to x ∈C.\nMihai Manea (MIT)\nCooperative Games\nApril 25, 2016\n14 / 32\n\nSingleton Solution Concepts\nTwo players split $1, with outside options p and q\nv({1}) = p, v({2}) = q, v({1, 2}) = 1\nC = {(x1, x2)|x1 + x2 = 1, x1 ≥p, x2 ≥q}\nWhat happens for p = q = 0? What if p + q > 1?\nThe core may be empty or quite large, which compromises its role as a\npredictive theory. Ideally, select a unique outcome for every cooperative\ngame.\nA value for cooperative games is a function from the space of games\n(N, v) to feasible allocations x (xN = v(N)).\nMihai Manea (MIT)\nCooperative Games\nApril 25, 2016\n15 / 32\n\nThe Shapley Value\nShapley (1953) proposed a solution with many economically desirable and\nmathematically elegant properties.\nDefinition 3\nThe Shapley value of a game with worth function v is given by\nS !( N\nS\n1)!\nφi(v) =\n|\nS\nX\n| |\n| -| | -\n⊆N\\{i}\n(v(S ∪{i}) -v(S)).\n|N|!\nInterpretation: players are randomly ordered in a line, all orders being\nequally likely. φi(v) represents the expected value of player i's contribution\nto the coalition formed by the players preceding him in line.\nWhy do values sum to v(N)?\nWhat's the Shapley value in the divide the dollar game?\nProposition 2⇒for convex games v, φ(v) is a convex combination of core\nallocations. Since C is convex, φ(v) ∈C. Not true in general.\nMihai Manea (MIT)\nCooperative Games\nApril 25, 2016\n16 / 32\n\nAxioms\nWhat is special about the Shapley value?\nAxiom 1 (Symmetry)\nPlayers i and j are interchangeable in v if v(S ∪{i}) = v(S ∪{j}) for all\nS disjoint from {i, j}. If i and j are interchangeable in v then φi(v) = φj(v).\nAxiom 2 (Dummy Player)\nPlayer i is a dummy in v if v(S ∪{i}) = v(S) for all S. If i is a dummy in v\nthen φi(v) = 0.\nAxiom 3 (Additivity)\nFor any two games v and w, we have φ(v + w) = φ(v) + φ(w).\nTheorem 4\nA value satisfies the three axioms iff it is the Shapley value.\nMihai Manea (MIT)\nCooperative Games\nApril 25, 2016\n17 / 32\n\nProof of \"If\" Part\nThe only axiom not checked immediately is symmetry. Suppose that i and\nj are interchangeable. Then\nS\nφi(v)\n=\nS⊆\nX\n| |!(|N| -|S| -1)!\nN\\{i}\n(v(S\ni\nN|!\n∪{ }) -v(S))\n|\n=\nX\n|S|!(|N| -|S| -1)!\nS⊆N\\{i,j}\n(v(S\n)\nN|!\n∪{i} -v(S))\n|\n( S + 1)!( N\n( S + 1)\n1)!\n+\nX\n| |\n| | -| |\n-\nS⊆N\\{i,j}\n(v(S\nj\nN|!\n∪{i, }) -v(S ∪{j}))\n|\nS !( N\nS\n1)!\n=\n|\nS\nX\n| |\n| -| | -\n⊆N\\{i,j}\n(v(S\n)\nN|!\n∪{j} -v(S))\n|\n( S + 1)!( N\n( S + 1)\n1)!\n+\nX\n| |\n| | -| |\n-\nS⊆N\\{i,j}\n|N|!\n(v(S ∪{i, j}) -v(S ∪{i}))\n=\nφj(v).\nMihai Manea (MIT)\nCooperative Games\nApril 25, 2016\n18 / 32\n\nProof of \"Only If\" Part\nSuppose that ψ satisfies the three axioms. We argue that ψ = φ.\nFor any non-empty coalition T, define the game\nT\n\nif S\nv (S) =\n⊇T\n.\notherwise\nFix a ∈R. By the symmetry axiom,\n\nψi(avT) = ψj(avT) for all i, j ∈T. By\nthe dummy player axiom, ψi(avT) = 0 for all i < T. Hence\na/ T\nif i\nT\nψi(avT) =\n\n| |\n∈\n\n,\notherwise\nso ψ(avT) = φ(avT).\nMihai Manea (MIT)\nCooperative Games\nApril 25, 2016\n19 / 32\n\nProof of \"Only If\" Part\nThe (2|N| -1) games vT span the linear space of all games. If we view\ngames as (2|N| -1)-dimensional vectors, it is sufficient to show that the\nvectors corresponding to the games\nT\n(v ) are linearly independent.\nFor a contradiction, suppose that\nT\nT N α vT = 0 with not all α's equal to\n⊆\nzPero. Let S be a set with minimal cardinality satisfying\nS\nα\n, 0. Then\nT\nT\nS\nS\nN α vT( ) = α\n, 0, a contradiction.\nP\n⊆\nThus any v can be written as v = P\nT\nT\nT N α v . The additivity of ψ and φ\n⊆\nimply\nψ(v) = ψ\nX\n\nT\nα vT\nT⊆N\n\nX\n\nT\n=\nvT\nvT\nψ(α\n) =\nX\nT\nT\nT\nφ(α\n) = φ\nα v\n= φ(v).\nT⊆N\nT⊆N\n\nT\nX\n⊆N\n\nMihai Manea (MIT)\nCooperative Games\nApril 25, 2016\n20 / 32\n\nAn Alternative Characterization\nEquity requirement: for any pair of players, the amounts that each player\ngains or loses from the other's withdrawal from the game are equal. For a\ngame (N, v), we denote by v|M its restriction to the players in M.\nDefinition 4\nA value ψ has balanced contributions if for every game (N, v) we have\nψi(v|N) -ψi(v|N \\ {j}) = ψj(v|N) -ψj(v|N \\ {i}), ∀i, j ∈N.\nTheorem 5\nThe unique value that has balanced contributions is the Shapley value.\nMihai Manea (MIT)\nCooperative Games\nApril 25, 2016\n21 / 32\n\nProof\nAt most one value has balanced contributions.\n▶For a contradiction, let φ′ and φ′′ be two different such values.\n▶Let (N, v) be a game with minimal |N| for which the two values yield\ndifferent outcomes.\n▶Then for all i, j ∈N, φ′(\ni v|N \\ {j}) = φ′′(\ni\nv|N \\ {j}) and\nφ′\nj(v|N \\ {i}) = φ′′(\nj\nv|N \\ {i}), along with the balancedness of φ′ and\nφ′′, imply φ′(v|N) -φ′′(v|N) = φ′(v|N) -φ (\ni\ni\nj\n′′\nj\nv|N).\n▶Since\ni N(φ′\ni(v\n∈\n|N) -φ′′(\ni\nv|N)) = 0, we obtain\nφi\n′(v|N\nP\n) -φ′′(\ni\nv|N) = 0, ∀i ∈N, or φ′(v|N) = φ′′(v|N), a contradiction.\nNext argue that the Shapley value has balanced contributions.\n▶The Shapley value φ is a linear function of the game, so the set of\ngames for which φ satisfies balanced contributions is closed under\nlinear combinations.\n▶Since any game is a linear combination of games vT, it is sufficient to\nshow that these games satisfy balanced contributions. . .\nMihai Manea (MIT)\nCooperative Games\nApril 25, 2016\n22 / 32\n\nThe Bargaining Problem\nThe non-cooperative approach involves explicitly modeling the bargaining\nprocess as an extensive form game (e.g., Rubinstein's (1982) alternating\noffer bargaining model).\nThe axiomatic approach abstracts away from the details of the bargaining\nprocess. Determine directly \"reasonable\" or \"natural\" properties that\noutcomes should satisfy.\nWhat are \"reasonable\" axioms?\n▶Consider a situation where two players must split $1. If no agreement\nis reached, then the players receive nothing.\n▶If preferences over monetary prizes are identical, then we expect that\neach player obtains 50 cents.\n▶Desirable properties: efficiency and symmetry of the allocation for\nidentical preferences.\nMihai Manea (MIT)\nCooperative Games\nApril 25, 2016\n23 / 32\n\nNash Bargaining Solution\nA bargaining problem is a pair (U, d) where U ⊂R2 and d ∈U.\n▶U is convex and compact\n▶there exists some u ∈U such that u > d\nDenote the set of all possible bargaining problems by B. A bargaining\nsolution is a function f : B →R with f(U, d) ∈U.\nDefinition 5\nThe Nash (1950) bargaining solution fN is defined by\n{fN(U, d)} = arg max(u1 -d1)(u2 -d2).\nu∈U,u≥d\nGiven the assumptions on (U, d), the solution to the optimization problem\nexists and is unique.\nMihai Manea (MIT)\nCooperative Games\nApril 25, 2016\n24 / 32\n\nAxioms\nAxiom 4 (Pareto Efficiency)\nA bargaining solution f is Pareto efficient if for any bargaining problem\n(U, d), there does not exist (u1, u2) ∈U such that u1 ≥f1(U, d) and\nu2 ≥f2(U, d), with at least one strict inequality.\nAxiom 5 (Symmetry)\nA bargaining solution f is symmetric if for any symmetric bargaining\nproblem (U, d) ((u1, u2) ∈U if and only if (u2, u1) ∈U and d1 = d2), we\nhave f1(U, d) = f2(U, d).\nMihai Manea (MIT)\nCooperative Games\nApril 25, 2016\n25 / 32\n\nAxioms\nAxiom 6 (Invariance to Linear Transformations)\nA bargaining solution f is invariant if for any bargaining problem (U, d)\nand all αi ∈(0, inf), βi ∈R (i = 1, 2), if we consider the bargaining problem\n(U′, d′) with\nU′\n=\n{(α1u1 + β1, α2u2 + β2) | (u1, u2) ∈U}\nd′\n=\n(α1d1 + β1, α2d2 + β2)\nthen fi(U′, d′) = αifi(U, d) + βi for i = 1, 2.\nAxiom 7 (Independence of Irrelevant Alternatives)\nA bargaining solution f is independent if for any two bargaining problems\n(U, d) and (U′, d) with U′ ⊆U and f(U, d) ∈U′, we have\nf(U′, d) = f(U, d).\nMihai Manea (MIT)\nCooperative Games\nApril 25, 2016\n26 / 32\n\nCharacterization\nTheorem 6\nfN is the unique bargaining solution that satisfies the four axioms.\nCheck that fN satisfies the axioms.\nPareto efficiency: follows from the fact that (u1 -d1)(u2 -d2) is\nincreasing in u1 and u2.\nSymmetry: if (U, d) is a symmetric bargaining problem then\n(fN(\n2 U, d), fN(\n1 U, d)) ∈U also solves the optimization problem. By the\nuniqueness of the optimal solution, fN\nN\n(\n1 U, d) = f (\n2 U, d).\nIndependence of irrelevant alternatives: if fN(U, d) ∈U′ ⊆U. The\nvalue of the objective function for (U′, d) cannot exceed that for\n(U, d\nN\n). Since f (U, d) ∈U′, the two values must be equal, and by the\nuniqueness of the optimal solution, fN(U, d) = fN(U′, d).\nInvariance to linear transformations: fN(U′, d′) is an optimal solution\nfor\nmax\n(u\nα\nβ\nα\nβ\n. . .\n′\n1d1\n1)(u2\n′\n2d2\n2)\n{(u1\n′ ,u2\n′ )|u1\n′ =α1u1+β1,u2\n′ =α2u2+β2,(u1,u2)\n-\n-\n-\n-\n∈U}\nMihai Manea (MIT)\nCooperative Games\nApril 25, 2016\n27 / 32\n\nProof\nShow that for any f that satisfies the axioms, f(U, d) = fN(U, d), ∀(U, d).\nFix a bargaining problem (U, d) and let z = fN(U, d). There exists\nαi > 0, βi such that the transformation ui →αiui + βi takes di to 0 and zi to\n1/2. Define\nU′ = {(α1u1 + β1, α2u2 + β2)|(u1, u2) ∈U}.\nSince f and fN satisfy the invariance to linear transformations axiom,\nf(U, d) = fN(U, d\nN\n) iff f(U′, 0) = f (U′, 0) = (1/2, 1/2). It suffices to prove\nf(U′, 0) = (1/2, 1/2).\nMihai Manea (MIT)\nCooperative Games\nApril 25, 2016\n28 / 32\n\nProof\nThe line {(u1, u2)|u1 + u2 = 1} is tangent to the hyperbola\n{(u1, u2) u1u2 = 1/4 at the point (1/2, 1/2). Given that\nfN\n|\n}\n(U′, 0) = (1/2, 1/2), argue that u1 + u2 ≤1 for all u ∈U′.\nSince U′ is bounded, we can find a rectangle U′′ with one side along the\nline u1 + u2 = 1, symmetric with respect to the line u1 = u2, such that\nU′ ⊆U′′ and (1/2, 1/2) is on the boundary of U′′. Since f is efficient and\nsymmetric, it must be that f(U′′, 0) = (1/2, 1/2).\nf satisfies independence of irrelevant alternatives, so\nf(U′′, 0) = (1/2, 1/2) ∈U′ ⊆U′′ ⇒f(U′, 0) = (1/2, 1/2)\nMihai Manea (MIT)\nCooperative Games\nApril 25, 2016\n29 / 32\n\nBargaining with Alternating Offers\n▶players i = 1, 2; j = 3 -i\n▶set of feasible utility pairs\nU = {(u1, u2) ∈[0, inf2) |u2 ≤g2(u1)}\n▶g2 s. decreasing, concave, g2(0) > 0\n▶disagreement point d = (0, 0)\n▶δi: discount factor of player i\n▶at every time t = 0, 1, . . ., player i(t) proposes an alternative\nu = (u1, u2) ∈U to player j(t) = 3 -i(t)\ni(t) =\n1 for\nt even\n2 for\nt odd\n▶if j(t) accepts the offer, game\n\nends yielding payoffs (δt\n,\n1u1 δt\n2u2)\n▶otherwise, game proceeds to period t + 1\nMihai Manea (MIT)\nCooperative Games\nApril 25, 2016\n30 / 32\n\nSubgame perfect equilibrium\nDefine g1 = g-1\n2 . Graphs of g2 and g1\n-1: Pareto-frontier of U\nLet (m1, m2) be the unique solution to the following system of equations\nm1\n=\nδ1g1 (m2)\nm2\n=\nδ2g2 (m1) .\n(m1, m2) is the intersection of the graphs of δ2g2 and (δ1g1)-1.\nSubgame perfect equilibrium in \"stationary\" strategies: in any period\nwhere player i has to make an offer to j, he offers u with uj = mj and\nui = gi(mj), and j accepts only offers u with uj ≥mj.\nMihai Manea (MIT)\nCooperative Games\nApril 25, 2016\n31 / 32\n\nNash Bargaining\nAssume g2 is decreasing, s. concave and continuously differentiable.\nNash bargaining solution:\n{u∗} = arg max u1u2.\nu∈U\nTheorem 7 (Binmore, Rubinstein and Wolinsky 1985)\nSuppose that δ1 = δ2 =: δ in the alternating bargaining model. Then the\nunique SPE payoffs converge to the Nash bargaining solution as δ →1.\nm1g2 (m1) = m2g1 (m2)\n(m1, g2 (m1)) and (g1 (m2) , m2) belong to the intersection of g2's graph\nwith the same hyperbola, which approaches the hyperbola tangent to the\nboundary of U (at u∗) as δ →1.\nMihai Manea (MIT)\nCooperative Games\nApril 25, 2016\n32 / 32\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n14.16 Strategy and Information\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "MIT 14.16 S16 Cooperative Games Lecture Slides",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-16-strategy-and-information-spring-2016/5ccdc7992234b518028d5714a582c7c8_MIT14_16S16_equilib_refine.pdf",
      "content": "Equilibrium Refinements\nMihai Manea\nMIT\n\nSequential Equilibrium\n▶In many games information is imperfect and the only subgame is the\noriginal game. . . subgame perfect equilibrium = Nash equilibrium\n▶Play starting at an information set can be analyzed as a separate\nsubgame if we specify players' beliefs about at which node they are.\n▶Based on the beliefs, we can test whether continuation strategies\nform a Nash equilibrium.\n▶Sequential equilibrium (Kreps and Wilson 1982): way to derive\nplausible beliefs at every information set.\nMihai Manea (MIT)\nEquilibrium Refinements\nApril 13, 2016\n2 / 38\n\nAn Example with Incomplete Information\nSpence's (1973) job market signaling game\n▶The worker knows her ability (productivity) and chooses a level of\neducation.\n▶Education is more costly for low ability types.\n▶Firm observes the worker's education, but not her ability.\n▶The firm decides what wage to offer her.\nIn the spirit of subgame perfection, the optimal wage should depend on\nthe firm's beliefs about the worker's ability given the observed education.\nAn equilibrium needs to specify contingent actions and beliefs.\nBeliefs should follow Bayes' rule on the equilibrium path.\nWhat about off-path beliefs?\nMihai Manea (MIT)\nEquilibrium Refinements\nApril 13, 2016\n3 / 38\n\nAn Example with Imperfect Information\nFigure: (L, A) is a subgame perfect equilibrium. Is it plausible that 2 plays A?\nMihai Manea (MIT)\nEquilibrium Refinements\nApril 13, 2016\n4 / 38\nCourtesy of The MIT Press. Used with permission.\n\nAssessments and Sequential Rationality\nFocus on extensive-form games of perfect recall with finitely many nodes.\nAn assessment is a pair (σ, μ)\n▶σ: (behavior) strategy profile\n▶μ = (μ(h) ∈∆(h))h∈H: system of beliefs\nui(σ|h, μ(h)): i's payoff when play begins at a node in h randomly selected\naccording to μ(h), and subsequent play specified by σ.\nThe assessment (σ, μ) is sequentially rational if\nui(h)(σi(h), σ-i(h)|h, μ(h)) ≥ui(h)(σ′\ni(h), σ-i(h)|h, μ(h))\nfor all information sets h and alternative strategies σ′.\nMihai Manea (MIT)\nEquilibrium Refinements\nApril 13, 2016\n5 / 38\n\nConsistency\nBeliefs need to be consistent with strategies.\nσ is totally mixed if supp(σ i(h)(h)) = A(h), i.e., all information sets are\nreached with positive probability.\nBayes' rule →unique system of beliefs μσ for any totally mixed σ .\nThe assessment (σ, μ) is consistent if there exists a sequence of totally\nmixed strategy profiles\nm\n(σ )m≥0 →σ s.t.\nm\n(μσ )m≥0 →μ.\nDefinition 1\nA sequential equilibrium is an assessment that is sequentially rational and\nconsistent.\nMihai Manea (MIT)\nEquilibrium Refinements\nApril 13, 2016\n6 / 38\n\nImplications of Sequential Rationality\nFigure: No belief rationalizes A. 2 plays B, 1 optimally chooses R.\nMihai Manea (MIT)\nEquilibrium Refinements\nApril 13, 2016\n7 / 38\nCourtesy of The MIT Press. Used with permission.\n\nImplications of Consistency\nFigure: By consistency, μ(y|h2) = μ(x|h1), even though D is never played.\nConsistency →common beliefs after deviations from equilibrium behavior.\nWhy should different players have the same theory about something not\nsupposed to happen?\nConsistency matches the spirit of equilibrium analysis, which assumes\nplayers hold identical beliefs about others' strategies.\nMihai Manea (MIT)\nEquilibrium Refinements\nApril 13, 2016\n8 / 38\nCourtesy of The MIT Press. Used with permission.\n\nExistence of Sequential Equilibrium\nTheorem 1\nA sequential equilibrium exists for every finite extensive-form game.\nFollows from existence of perfect equilibria, prove later.\nMihai Manea (MIT)\nEquilibrium Refinements\nApril 13, 2016\n9 / 38\n\nSequential Equilibrium Multiplicity\nTheorem 2\nFor generic payoff functions, the set of sequential equilibrium outcome\ndistributions is finite.\nSet of sequential equilibrium assesments often infinite\n▶Infinitely many belief specifications at off-path information sets\nsupporting some equilibrium strategies.\n▶Set of sequential equilibrium strategies may also be infinite. Off-path\ninformation sets may allow for consistent beliefs that make players\nindifferent between actions. . . many mixed strategies compatible with\nsequential rationality.\nMihai Manea (MIT)\nEquilibrium Refinements\nApril 13, 2016\n10 / 38\n\nExample\nSequential equilibrium outcomes: (L, l) and A\nUnique equilibrium leading to (L, l)\nTwo families of equilibria with outcome A. . . 2 must choose r with positive\nprobability\n2 chooses r with probability 1 and believes μ(x) ∈[0, 1/2]\n2 chooses r with probability in [2/5, 1] and believes μ(x) = 1/2\nMihai Manea (MIT)\nEquilibrium Refinements\nApril 13, 2016\n11 / 38\nCourtesy of The MIT Press. Used with permission.\n\nSequential Equilibrium Is Sensitive to the Extensive Form\n\"Strategically neutral\" changes in game tree affect equilibria.\nGame a: (A, L2) possible in a sequential equilibrium\nGame b: ((NA, R1), R2) unique sequential equilibrium strategies. In\nsubgame following NA, R1 strictly dominates L1. Then 2 chooses R2, and\n1 best responds with (NA, R1).\nMihai Manea (MIT)\nEquilibrium Refinements\nApril 13, 2016\n12 / 38\nCourtesy of The MIT Press. Used with permission.\n\nPerfect Equilibrium\nL\nR\nU\n1,1\n0,0\nD\n0,0\n0,0\nSelten (1975): (trembling-hand) perfect equilibrium\n▶Both (U, L) and (D, R) are Nash equilibria.\n▶(D, R) not robust to small mistakes: if 1 thinks that 2 might make a\nmistake and play L with positive probability, deviate to U.\nDefinition 2\nIn a strategic-form game, a profile σ is a perfect equilibrium if there is a\nsequence of trembles (σm)m≥0 →σ, where each σm is a totally mixed\nstrategy, such that σi is a best reply to σm\n-i for each m and all i ∈N.\nMihai Manea (MIT)\nEquilibrium Refinements\nApril 13, 2016\n13 / 38\n\nExistence of Perfect Equilibria\nDefinition 3\nσε is an ε-perfect equilibrium if ∃ε(si) ∈(0, ε], ∀i ∈N, si ∈Si s.t. σε is a\nNash equilibrium of the game where players are restricted to play mixed\nstrategies in which every pure strategy si has probability at least ε(si).\nProposition 1\nA strategy profile is a perfect equilibrium iff it is the limit of a sequence of\nε-perfect equilibria as ε →0.\nTheorem 3\nEvery finite strategic-form game has a perfect equilibrium.\nProof.\nA 1/n-perfect equilibrium exists by the general Nash equilibrium existence\ntheorem. By compactness, the sequence of 1/n-perfect equilibria has a\nconvergent subsequence as n →inf. The limit is a perfect equilibrium.\n□\nMihai Manea (MIT)\nEquilibrium Refinements\nApril 13, 2016\n14 / 38\n\nPerfection in Strategic Form ⇒Subgame-Perfection\nUnique SPE: (L1L′\n1, L2)\n(R1, R2) is perfect in strategic form, sustained by trembles s.t. after\ntrembling to L1, player 1 chooses R′\n1 vs. L′\n1 with probability ratio ≥1/5.\nCorrelation in trembles at different information sets. . . unreasonable.\nMihai Manea (MIT)\nEquilibrium Refinements\nApril 13, 2016\n15 / 38\nCourtesy of The MIT Press. Used with permission.\n\nPerfection in Extensive-Form Games\nSolution: agent-normal form\n▶A different player for every information set h.\n▶\"Player\" h has the same payoffs as i(h).\nDefinition 4\nA perfect equilibrium for an extensive-form game is a perfect equilibrium of\nits agent-normal form.\nMihai Manea (MIT)\nEquilibrium Refinements\nApril 13, 2016\n16 / 38\n\nConnection to Sequential Equilibrium\nTheorem 4\nEvery perfect equilibrium of a finite extensive-form game is a sequential\nequilibrium (for some appropriately chosen beliefs).\n▶σ: perfect equilibrium of the extensive-form game ⇒∃(σm)m≥0 →σ\ntotally mixed strategies in the agent-normal form s.t. σh is a best reply\nto σm\n-h for each m and all information sets h.\n▶By compactness, (μσm)m≥0 has a convergent subsequence, denote\nlimit by μ.\n▶By construction, (σ, μ) is consistent.\n▶σh is a best response to μσm(h) and σm\n-h for each m.\n▶By continuity, σh is a best response to μ(h) and σ-h.\n▶One-shot deviation principle: (σ, μ) is sequentially rational\nMihai Manea (MIT)\nEquilibrium Refinements\nApril 13, 2016\n17 / 38\n\nProper Equilibrium\nMyerson (1978): a player is infinitely more likely to tremble to better actions\nA player's probability of playing the second-best action is at most ε times\nthe probability of the best, the probability of the third-best action is at most\nε times the probability of the second-best. . .\nDefinition 5\nAn ε-proper equilibrium is a totally mixed strategy profile σε s.t. if\nui(si, σε\n-i) < ui(s′\ni , σε\n-i), then σε\ni (si) ≤εσε\ni (s′\ni ). A proper equilibrium is any\nlimit of ε-proper equilibria as ε →0.\nTheorem 5\nEvery finite strategic-form game has a proper equilibrium.\nProve existence of ε-proper equilibria applying Kakutani's fixed point\ntheorem to \"mistake hierarchy ε-best response\" correspondences, then\nuse compactness to find a limit point.\nMihai Manea (MIT)\nEquilibrium Refinements\nApril 13, 2016\n18 / 38\n\nProperness in Strategic Form ⇒Subgame Perfection\nMihai Manea (MIT)\nEquilibrium Refinements\nApril 13, 2016\n19 / 38\nCourtesy of The MIT Press. Used with permission.\n\nForward Induction\nEquilibrium: off-path observations interpreted as errors\nForward induction: players should believe in the rationality of their\nopponents even after observing deviations.\n▶When a player deviates from equilibrium strategies, the opponent\nshould believe that the player expects follow up play that makes the\ndeviation reasonable.\n▶The deviation is informative about the player's type or, in general\nextensive form games, about his future play.\nForward induction not an equilibrium concept: in equilibrium, all players\nexpect specified strategies to be exactly followed\nAn attempt to describe strategic uncertainty. . . no single, rigorous definition\nMihai Manea (MIT)\nEquilibrium Refinements\nApril 13, 2016\n20 / 38\n\nExample\n1 chooses between O, which generates payoffs (2, 2), or I, which leads to\nT\nW\nT\n0,0\n3,1\nW\n1,3\n0,0\nSPE: (OW, T). Reasonable?\n▶If 1 plays I, this suggests he does not intend to follow up with W: O\nyields a payoff of 2, while W leads to a payoff of at most 1 for player 1.\n▶Player 2, anticipating that 1 will play T, should play W.\n▶If 1 can convince 2 to play W, he gets the higher payoff from (T, W).\nMihai Manea (MIT)\nEquilibrium Refinements\nApril 13, 2016\n21 / 38\n\nForward Induction and Strict Dominance\nReduced normal form\nT\nW\nO\n2,2\n2,2\nIT\n0,0\n3,1\nIW\n1,3\n0,0\n(O, T) is a perfect (in fact, proper) equilibrium.\nIf we rule out IW because it is s. dominated by O, then the only perfect\nequilibrium is (IT, W).\nMihai Manea (MIT)\nEquilibrium Refinements\nApril 13, 2016\n22 / 38\n\nSignaling Games\n▶Two players: sender S and receiver R\n▶T: set of types for S\n▶p(t): probability of type t ∈T\n▶S privately observes his type t, then sends a message m ∈M(t)\n▶T(m) = {t | m ∈M(t)}: types that can send message m\n▶R observes m and chooses an action a ∈A(m)\n▶Payoffs uS(t, m, a) and uR(t, m, a)\nIf S plays m with probability 0, then any beliefs for R about t after\nobserving m are consistent. . . sequential equilibrium imposes no\nrestrictions on beliefs off the equilibrium path in signaling games.\nMihai Manea (MIT)\nEquilibrium Refinements\nApril 13, 2016\n23 / 38\n\nThe Beer-Quiche Game\n▶Player 1 is wimpy (w) or surly (s), with probabilities .1 and .9;\nT = {w, s}.\n▶1 orders breakfast: M = M(t) = {beer, quiche}, ∀t ∈T.\n▶Player 2 decides whether to fight: A(m) = {F, NF}, ∀m ∈M.\n▶1 gets utility 1 from having his favorite breakfast--beer if surly, quiche\nif wimp--but a disutility of 2 from fighting.\n▶When 1 is w, 2's payoff is 1 if he fights and 0 otherwise; when 1 is s,\npayoffs are reversed.\nMihai Manea (MIT)\nEquilibrium Refinements\nApril 13, 2016\n24 / 38\nCourtesy of The MIT Press. Used with permission.\n\nSequential Equilibria\nAll sequential equilibria involve pooling\n▶Compare σ2(F|beer) and σ2(F|quiche)\n▶Breakfast leading to a smaller probability of fighting must be selected\nwith probability 1 in equilibrium by player 1 type who likes it. . .\nClasses of sequential equilibria\nBoth types of player 1 drink beer.\nBoth types of player 1 eat quiche.\nPlayer 2 does not fight in equilibrium. Player 2 must fight with probability at\nleast 1/2 when observing the out-of-equilibrium breakfast. . . supported by\nany belief for player 2 placing probability at least 1/2 on w following the\nout-of-equilibrium breakfast.\nMihai Manea (MIT)\nEquilibrium Refinements\nApril 13, 2016\n25 / 38\n\nForward-Induction in Beer-Quiche\nQuiche equilibrium unreasonable\n▶Why would the wimp deviate to beer? No matter how 2 reacts, wimp\ncannot get more than 2, and he is already getting 3.\n▶Seeing beer, 2 should conclude that 1 is surly and not fight, which\nwould induce surly type to deviate.\nForward-induction argument does not rule out the beer equilibrium\n▶In the beer equilibrium, it is unreasonable for surly type to deviate to\nquiche, while reasonable for wimp.\n▶2's belief that 1 is wimpy if he orders quiche is reasonable.\nMihai Manea (MIT)\nEquilibrium Refinements\nApril 13, 2016\n26 / 38\n\nIntuitive Criterion\nCho and Kreps (1987): intuitive criterion\n▶Robustness to replacing the equilibrium path by its expected payoff\n▶Presumes that players are certain about play on the equilibrium path,\nbut there is uncertainty off the path\n▶If m can never lead to a higher payoff for t than his equilibrium payoff,\nthen equilibrium beliefs should assign probability 0 to type t following\nm.\nMihai Manea (MIT)\nEquilibrium Refinements\nApril 13, 2016\n27 / 38\n\nIrrational Strategies for the Receiver\nWhat if 2 can also pay a milion dollars to 1?\n▶It would be reasonable for both types to deviate.\n▶But 2 would never want to pay a million dollars.\n▶Assume 1 cannot expect 2 to play a irrational strategy.\nMihai Manea (MIT)\nEquilibrium Refinements\nApril 13, 2016\n28 / 38\n\nIntuitive Criterion\nFor any T′ ⊆T and any message m,\nBR(T′, m) = ∪μ | μ(T′)=1 BR(μ, m)\nfor strategies that R could rationally play after m and if he is certain that\nt ∈T′.\nConsider a sequential equilibrium\n▶u∗\nS(t): equilibrium payoff to type t\n▶ T(m) = {t | u∗\nS(t) > maxa∈BR(T(m),m) uS(t, m, a)}: types that do better\nin equilibrium than they could possibly do by sending m, no matter\nhow R reacts, as long as R is rational.\nThe equilibrium fails the intuitive criterion if ∃t′ ∈T, m ∈M(t′) s.t.\nu∗\nS(t′) <\nmin\na∈BR(T(m)\\ T(m),m)\nuS(t′, m, a).\nMihai Manea (MIT)\nEquilibrium Refinements\nApril 13, 2016\n29 / 38\n\nDiscussion\nThe equilibrium fails the intuitive criterion if some sender type is getting\nless than any payoff he could possibly get by playing m, assuming he\ncould convince the sender that he is not in T(m) because m does not\nmake sense for any of those types.\nIn the beer-quiche example, the quiche equilibrium fails this criterion.\nMihai Manea (MIT)\nEquilibrium Refinements\nApril 13, 2016\n30 / 38\n\nSpence's Signaling Mode\nSpence's (1973) job market signaling game\nNature chooses a worker type (ability) θ ∈{H, L} with H > L > 0;\nthe probability of H is p ∈(0, 1).\nType is revealed to the worker but not to the employer (firm).\nWorker chooses e ≥0 units of education, incurs disutility e/θ.\nFirm observes e, forms an estimate of θ, and pays the worker wage\nE(θ|e) (perfect competition: firm has 0 expected payoff).\nPayoff of type θ worker: E(θ|e) -e/θ. E(θ|e) endogenously derived from\nstrategies. . . depends on worker strategies and how they translate into\nbeliefs.\nIf worker chooses e with probability 0, then any belief about θ after\nobserving e is consistent. . . sequential equilibrium imposes no restrictions\non off-path beliefs.\nMihai Manea (MIT)\nEquilibrium Refinements\nApril 13, 2016\n31 / 38\n*The following slides are based on lecture notes by Debraj Ray.\n\nSingle Crossing\nLemma 1\nIf H and L choose e and e′, respectively, with positive probability in\nequilibrium, then e ≥e′.\n▶H does not have incentives to deviate from e to e′,\ne\nE(θ|e) -H ≥E(θ|e′) -e′\n.\nH\n▶L does not have incentives to deviate from e′ to e,\ne′\nE(θ|e′) -L ≥E(θ|e) -e\nL .\n▶Adding the two inequalities,\n(e -e′)\nL -1\nH\n!\n≥0.\nKey assumption: higher types have lower marginal cost (result holds for\ncost functions other than e/θ).\nMihai Manea (MIT)\nEquilibrium Refinements\nApril 13, 2016\n32 / 38\n\nSeparating Equilibrium\nEach type takes a different action (type perfectly revealed)\n▶L must choose e = 0, equilibrium wage L for equilibrium action\n▶H cannot mix, profitable deviation to lowest action in support\nIncentive constraints if H chooses e∗\n▶L does not want to imitate H\ne∗\nL ≥H -\ne\nL ⇒\n∗≥L(H -L) =: e1\n▶H does not want to imitate L\ne∗\nH -H ≥L ⇒e∗≤H(H -L) =: e2\nAny e∗∈[e1, e2] is possible in a sequential equilibrium with suitably\nchosen off-path beliefs. E.g.,, employer believes that any e < e∗comes\nfrom L, while e > e∗from H.\nMihai Manea (MIT)\nEquilibrium Refinements\nApril 13, 2016\n33 / 38\n\nPooling Equilibrium\nBoth types play the same action e∗(no information is revealed)\n▶Equilibrium wage: pH + (1-p)L\n▶Off-path wage? Depends on off-path beliefs.\n▶Strongest incentives to follow equilibrium play: if firm believes worker\nis type L for e , e∗, then wage should be L.\nNeither type should want to deviate to 0,\ne∗\npH + (1 -p)L -θ ≥L,\n∀θ ∈{H, L}.\nBinding constraint for θ = L,\ne∗≤pL(H -L).\nMihai Manea (MIT)\nEquilibrium Refinements\nApril 13, 2016\n34 / 38\n\nHybrid Equilibria\nOne or both types mix (partial info revelation). An example\n▶L chooses 0\n▶H chooses 0 with probability q and e with probability 1 -q for some\nq ∈(0, 1) and e > 0\n▶After observing e, firm believes worker type is H, offers wage H.\n▶After 0, worker type is H with probability qp/(qp + 1 -p), offers wage\nqp\nqp + 1 -p H +\n1 -p\nqp + 1 -p L.\n▶H must be indifferent between 0 and e (then L does not have\nincentives to deviate to e),\nqp\nqp + 1 -p H +\n1 -p\nqp + 1 -p L = H -e\nH .\n▶Off-path beliefs and wages as before\nMihai Manea (MIT)\nEquilibrium Refinements\nApril 13, 2016\n35 / 38\n\nIntuitive Criterion\nIn Spence's signaling model, all three types of equilibria--separating,\npooling, and hybrid equilibria--coexist.\nBeliefs freely assigned off the equilibrium path (consistency has no bite).\nApply the intuitive criterion to get sharper predictions.\nProposition 2\nA single equilibrium outcome survives the intuitive criterion--the\nseparating equilibrium in which L plays 0 while H plays e1 = L(H -L).\nThis is the most efficient separating equilibrium.\nMihai Manea (MIT)\nEquilibrium Refinements\nApril 13, 2016\n36 / 38\n\nProof\nFirst rule out pooling and hybrid equilibria. Suppose both H and L play e\nwith positive probability.\n▶λ: firm's posterior belief that worker is type H after e\n▶payoff of type θ after choosing e: λH + (1 -λ)L -e/θ\nLet e′ > e solve\ne′\nH -L = λH + (1 -λ)L -e .\nL\nChoose e′′ > e′ close to e′. The equilibrium fails the intuitive criterion for\ntype H and message e′′.\n▶L would not deviate to e′′ even if firm offers wage H after e′′,\ne\nλH + (1 -λ)L -L > H -e′′\nL .\n▶H would deviate to e′′ if firm was convinced of H after e′′,\nλH + (1 -λ)L -e\nH < H -e′′\nH .\nMihai Manea (MIT)\nEquilibrium Refinements\nApril 13, 2016\n37 / 38\n\nProof\nRule out other separating equilibria. Consider a separating equilibrium\nwhere L plays 0 and H plays e > e1. Fix e′ ∈(e1, e). The equilibrium fails\nthe intuitive criterion for type H and message e′.\n▶L would not deviate to e′ even if firm believes worker is type H after\ne′,\ne′\nH -L < H -e1\nL = L.\n▶H would deviate to e′ if that convinces firm that worker is type H,\nH -e\nL > H -e′\nL .\nMihai Manea (MIT)\nEquilibrium Refinements\nApril 13, 2016\n38 / 38\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n14.16 Strategy and Information\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "MIT 14.16 S16 Extensive Form Games Lecture Slides",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-16-strategy-and-information-spring-2016/8aba65347a9edb17b1e718c3c221e42a_MIT14_16S16_Form_Games.pdf",
      "content": "Extensive Form Games\nMihai Manea\nMIT\n\nExtensive-Form Games\n▶N: finite set of players; nature is player 0\nN\n▶\n∈\ntree: order of moves\n▶payoffs for every player at the terminal nodes\n▶information partition\n▶actions available at every information set\n▶description of how actions lead to progress in the tree\n▶random moves by nature\nMihai Manea (MIT)\nExtensive-Form Games\nMarch 2, 2016\n2 / 33\nCourtesy of The MIT Press. Used with permission.\n\nGame Tree\n▶(X, >): tree\n▶X: set of nodes\n▶x > y: node x precedes node y\n▶φ ∈X: initial node, φ > x, ∀x ∈X \\ {φ}\n▶> transitive (x > y, y > z ⇒x > z) and asymmetric (x > y ⇒y >x)\n▶every node x ∈X \\ {φ} has one immediate predecessor: ∃x′ > x s.t.\nx′′ > x & x′′ , x′ ⇒x′′ > x′\n▶Z = {z | ∃x, z > x}: set of terminal nodes\n▶z ∈Z determines a unique path of moves through the tree, payoff\nui(z) for player i\nMihai Manea (MIT)\nExtensive-Form Games\nMarch 2, 2016\n3 / 33\n\nInformation Partition\n▶information partition: a partition of X \\ Z\n▶node x belongs to information set h(x)\n▶player i(h) ∈N moves at every node x in information set h\n▶i(h) knows that he is at some node of h but does not know which one\n▶same player moves at all x ∈h, otherwise players might disagree on\nwhose turn it is\n▶i(x) := i(h(x))\nMihai Manea (MIT)\nExtensive-Form Games\nMarch 2, 2016\n4 / 33\n\nActions\n▶A(x): set of available actions at x ∈X \\ Z for player i(x)\n▶A(x) = A(x′) =: A(h), ∀x′ ∈h(x) (otherwise i(h) might play an\ninfeasible action)\n▶each node x , φ associated with the last action taken to reach it\n▶every immediate successor of x labeled with a different a ∈A(x) and\nvice versa\n▶move by nature at node x: probability distribution over A(x)\nMihai Manea (MIT)\nExtensive-Form Games\nMarch 2, 2016\n5 / 33\n\nStrategies\n▶Hi = {h|i h\ni}\n▶Si =\n▶si(h):\nQ\n( ) =\nh∈Hi A(h): set of pure strategies for player i\naction taken by player i at information set h ∈Hi under si ∈Si\n▶S = Q\ni N Si: strategy profiles\n∈\n▶A strategy is a complete contingent plan specifying the action to be\ntaken at each information set.\n▶Mixed strategies: σi ∈∆(Si)\n▶mixed strategy profile σ ∈\ni∈N ∆(Si) →probability distribution\nO(σ) ∈∆(Z)\n▶ui(σ) = E\nQ\nO(σ)(ui(z))\nMihai Manea (MIT)\nExtensive-Form Games\nMarch 2, 2016\n6 / 33\n\nStrategic Form\n▶The strategic form representation of the extensive form game is the\nnormal form game defined by (N, S, u)\n▶A mixed strategy profile is a Nash equilibrium of the extensive form\ngame if it constitutes a Nash equilibrium of its strategic form.\nMihai Manea (MIT)\nExtensive-Form Games\nMarch 2, 2016\n7 / 33\n\nGrenade Threat Game\nPlayer 2 threatens to explode a grenade if player 1 doesn't give him\n$1000.\n▶Player 1 chooses between g and ¬g.\n▶Player 2 observes player 1's choice, then decides whether to explode\na grenade that would kill both.\n(0, 0)\n,\n(-inf, -inf)\nA\n¬g\n(-1000, 1000)\n,\n(-inf, -inf)\nA\ng\nMihai Manea (MIT)\nExtensive-Form Games\nMarch 2, 2016\n8 / 33\n\nStrategic Form Representation\n(0, 0)\n,\n(-inf, -inf)\nA\n¬g\n(-1000, 1000)\n,\n(-inf, -inf)\nA\ng\nA, A\nA, ,\n,, A\n,, ,\ng\n-inf, -inf\n-inf, -inf\n-1000, 1000∗\n-1000, 1000\n¬g\n-inf, -inf\n0, 0∗\n-inf, -inf\n0, 0∗\nThree pure strategy Nash equilibria. Only (¬g, ,, ,) is subgame perfect.\nA is not a credible threat.\nMihai Manea (MIT)\nExtensive-Form Games\nMarch 2, 2016\n9 / 33\n\nBehavior Strategies\n▶bi(h) ∈∆(A(h)): behavior strategy for player i(h) at information set h\n▶bi(a|h): probability of action a at information set h\n▶behavior strategy bi ∈Q\nh Hi ∆(A(h))\n∈\n▶independent mixing at each information set\n▶bi outcome equivalent to the mixed strategy\nσi(si) =\nY\nbi(si(h)\nh∈H\n|h)\n(1)\ni\n▶Is every mixed strategy equivalent to a behavior strategy?\n▶Yes, under perfect recall.\nMihai Manea (MIT)\nExtensive-Form Games\nMarch 2, 2016\n10 / 33\n\nPerfect Recall\nNo player forgets any information he once had or actions he previously\nchose.\n▶If x′′ ∈h(x′), x > x′, and the same player i moves at both x and x′\n(and thus at x′′), then there exists xˆ ∈h(x) (possibly xˆ = x) s.t.\nxˆ > x′′ and the action taken at x along the path to x′ is the same as\nthe action taken at xˆ along the path to x′′.\n▶x′ and x′′ distinguished by information i does not have, so he cannot\nhave had it at h(x)\n▶x′ and x′′ consistent with the same action at h(x) since i must\nremember his action there\n▶Equivalently, every node in h ∈Hi must be reached via the same\nsequence of i's actions.\nMihai Manea (MIT)\nExtensive-Form Games\nMarch 2, 2016\n11 / 33\n\nEquivalent Behavior Strategies\n▶Ri(h) = {si|h is on the path of (si, s-i) for some s-i}: set of i's pure\nstrategies that do not preclude reaching information set h ∈Hi\n▶Under perfect recall, a mixed strategy σi is equivalent to a behavior\nstrategy bi defined by\nP\nσi(si)\ns\n(\n=\n{ i∈Ri(h)|si(h)=a\nb\n}\ni a|h)\n(2)\nσ\nsi∈\nP\ni(si)\nRi(h)\nwhen the denominator is positive.\nTheorem 1 (Kuhn 1953)\nIn extensive form games with perfect recall, mixed and behavior strategies\nare outcome equivalent under the formulae (1) & (2).\nMihai Manea (MIT)\nExtensive-Form Games\nMarch 2, 2016\n12 / 33\n\nProof\n▶h1, . . . , hk : player i's information sets preceding h in the tree\n▶Under perfect recall, reaching any node in h requires i to take the\nsame action ak at each hk,\nRi(h) = {si|si(hk) = ak, ∀k = 1, k }.\n▶Conditional on getting to h, the distribution of continuation play at h is\ngiven by the relative probabilities of the actions available at h under\nthe restriction of σi to Ri(h),\n{s\n|\ni|si(hk)=ak,∀k\nP\n=\nbi(a h) =\n1, k & si(h)=a}\nσi(si)\n{si|si(hk)=\nP\nak,∀k=1, k}\nσi(si)\n.\nMihai Manea (MIT)\nExtensive-Form Games\nMarch 2, 2016\n13 / 33\n\nExample\nFigure: Different mixed strategies can generate the same behavior strategy.\n▶S2 = {(A, C), (A, D), (B, C), (B, D)}\n▶Both σ2 = 1/4(A, C) + 1/4(A, D) + 1/4(B, C) + 1/4(B, D) and\nσ2 = 1/2(A, C) + 1/2(B, D) generate--and are equivalent to--the\nbehavior strategy b2 with b2(A|h) = b2(B|h) = 1/2 and\nb2(C|h′) = b2(D|h′) = 1/2.\nMihai Manea (MIT)\nExtensive-Form Games\nMarch 2, 2016\n14 / 33\nCourtesy of The MIT Press. Used with permission.\n\nExample with Imperfect Recall\nFigure: Player 1 forgets what he did at the initial node.\n▶S1 = {(A, C), (A, D), (B, C), (B, D)}\n▶σ1 = 1/2(A, C) + 1/2(B, D) →b1 = (1/2A + 1/2B, 1/2C + 1/2D)\n▶b1 not equivalent to σ1\n▶(σ1, L): prob. 1/2 for paths (A, L, C) and (B, L, D)\n▶(b1, L): prob. 1/4 to paths (A, L, C), (A, L, D), (B, L, C), (B, L, D)\nMihai Manea (MIT)\nExtensive-Form Games\nMarch 2, 2016\n15 / 33\nCourtesy of The MIT Press. Used with permission.\n\nImperfect Recall and Correlations\n▶Since both A vs. B and C vs. D are choices made by player 1, the\nstrategy σ1 under which player 1 makes all his decisions at once\nallows choices at different information sets to be correlated\n▶Behavior strategies cannot produce this correlation, because when it\ncomes time to choose between C and D, player 1 has forgotten\nwhether he chose A or B.\nMihai Manea (MIT)\nExtensive-Form Games\nMarch 2, 2016\n16 / 33\nCourtesy of The MIT Press. Used with permission.\n\nAbsent Minded Driver\nPiccione and Rubinstein (1997)\n▶A drunk driver has to take the third out of five exits on the highway\n(exit 3 has payoff 1, other exits payoff 0).\n▶The driver cannot read the signs and forgets how many exits he has\nalready passed.\n▶At each of the first four exits, he can choose C (continue) or E\n(exit). . . imperfect recall: choose same action.\n▶C leads to exit 5, while E leads to exit 1.\n▶Optimal solution involves randomizing: probability p of choosing C\nmaximizes p2(1 -p), so p = 2/3.\n▶\"Beliefs\" given p = 2/3: (27/65, 18/65, 12/65, 8/65)\n▶E has conditional \"expected\" payoff of 12/65, C has 0. Optimal\nstrategy: E with probability 1, inconsistent.\nMihai Manea (MIT)\nExtensive-Form Games\nMarch 2, 2016\n17 / 33\n\nConventions\n▶Restrict attention to games with perfect recall, so we can use mixed\nand behavior strategies interchangeably.\n▶Behavior strategies are more convenient.\n▶Drop notation b for behavior strategies and denote by σi(a|h) the\nprobability with which player i chooses action a at information set h.\nMihai Manea (MIT)\nExtensive-Form Games\nMarch 2, 2016\n18 / 33\n\nSurvivor\nTHAI 21\n▶Two players face off in front of 21 flags.\n▶Players alternate in picking 1, 2, or 3 flags at a time.\n▶The player who successfully grabs the last flag wins.\nGame of luck?\nMihai Manea (MIT)\nExtensive-Form Games\nMarch 2, 2016\n19 / 33\n\nBackward Induction\n▶An extensive form game has perfect information if all information sets\nare singletons.\n▶Can solve games with perfect information using backward induction.\n▶Finite game →∃penultimate nodes (successors are terminal nodes).\n▶The player moving at each penultimate node chooses an action that\nmaximizes his payoff.\n▶Players at nodes whose successors are penultimate/terminal choose\nan optimal action given play at penultimate nodes.\n▶Work backwards to initial node. . .\nTheorem 2 (Zermelo 1913; Kuhn 1953)\nIn a finite extensive form game of perfect information, the outcome(s) of\nbackward induction constitutes a pure-strategy Nash equilibrium.\nMihai Manea (MIT)\nExtensive-Form Games\nMarch 2, 2016\n20 / 33\n\nMarket Entrance\n▶Incumbent firm 1 chooses a level of capital K1 (which is then fixed).\n▶A potential entrant, firm 2, observes K1 and chooses its capital K2.\n▶The profit for firm i = 1, 2 is Ki(1 -K1 -K2) (firm i produces output Ki,\nwe use earlier demand function).\n▶Each firm dislikes capital accumulation by the other.\n▶A firm's marginal value of capital decreases with the other's.\n▶Capital levels are strategic substitutes.\nMihai Manea (MIT)\nExtensive-Form Games\nMarch 2, 2016\n21 / 33\n\nStackelberg Competition\n▶Profit maximization by firm 2 requires\nK2 =\n-K1 .\n▶Firm 1 anticipates that firm 2 will act optimally, and therefore solves\nmax\nK1\n(\nK1\n\n1 -K1\n-K\n-\n.\n!)\n▶Solution involves K1 = 1/2, K2 = 1/4, π1 = 1/8, and π2 = 1/16.\n▶Firm 1 has first mover advantage.\n▶In contrast, in the simultaneous move game, K1 = 1/3, K2 = 1/3,\nπ1 = 1/9, and π2 = 1/9.\nMihai Manea (MIT)\nExtensive-Form Games\nMarch 2, 2016\n22 / 33\n\nCentipede Game\n▶Player 1 has two piles in front of her: one contains 3 coins, the other\n1.\n▶Player 1 can either take the larger pile and give the smaller one to\nplayer 2 (T) or push both piles across the table to player 2 (C).\n▶Every time the piles pass across the table, one coin is added to each.\n▶Players alternate in choosing whether to take the larger pile (T) or\ntrust opponent with bigger piles (C).\n▶The game lasts 100 rounds.\nWhat's the backward induction solution?\nT\nT\nT\nT\nT\nC\nC\nC\nC\nC\n(103, 101)\n(3, 1)\n(2, 4)\n(5, 3)\n(101, 99) (100, 102)\nMihai Manea (MIT)\nExtensive-Form Games\nMarch 2, 2016\n23 / 33\n\nChess Players and Backward Induction\nPalacios-Huerta and Volij (2009)\n▶chess players and college students behave differently in the\ncentipede game.\n▶Higher-ranked chess players end the game earlier.\n▶All Grandmasters in the experiment stopped at the first opportunity.\n▶Chess players are familiar with backward induction reasoning and\nneed less learning to reach the equilibrium.\n▶Playing against non-chess-players, even chess players continue in\nthe game longer.\n▶In long games, common knowledge of the ability to do complicated\ninductive reasoning becomes important for the prediction.\nMihai Manea (MIT)\nExtensive-Form Games\nMarch 2, 2016\n24 / 33\n\nSubgame Perfection\n▶Backward induction solution is more than a Nash equilibrium.\n▶Actions are optimal given others' play--and form an\nequilibrium--starting at any intermediate node: subgame\nperfection. . . rules out non-credible threats.\n▶Subgame perfection extends backward induction to imperfect\ninformation games.\n▶Replace \"smallest\" subgames with a Nash equilibrium and iterate on\nthe reduced tree (if there are multiple Nash equilibria in a subgame,\nall players expect same play).\nMihai Manea (MIT)\nExtensive-Form Games\nMarch 2, 2016\n25 / 33\n\nSubgames\nSubgame: part of a game that can be analyzed separately; strategically\nand informationally independent. . . information sets not \"chopped up.\"\nDefinition 1\nA subgame G of an extensive form game T consists of a single node x\nand all its successors in T, with the property that if x′ ∈G and x′′ ∈h(x′)\nthen x′′ ∈G. The information sets, actions and payoffs in the subgame are\ninherited from T.\nMihai Manea (MIT)\nExtensive-Form Games\nMarch 2, 2016\n26 / 33\n\nFalse Subgames\nMihai Manea (MIT)\nExtensive-Form Games\nMarch 2, 2016\n27 / 33\nCourtesy of The MIT Press. Used with permission.\n\nSubgame Perfect Equilibrium\nσ: behavior strategy in T\n▶σ|G: the strategy profile induced by σ in subgame G of T (start play\nat the initial node of G, follow actions specified by σ, obtain payoffs\nfrom T at terminal nodes)\n▶Is σ|G a Nash equilibrium of G for any subgame G?\nDefinition 2\nA strategy profile σ in an extensive form game T is a subgame perfect\nequilibrium if σ|G is a Nash equilibrium of G for every subgame G of T.\n▶Any game is a subgame of itself →a subgame perfect equilibrium is a\nNash equilibrium.\n▶Subgame perfection coincides with backward induction in games of\nperfect information.\nMihai Manea (MIT)\nExtensive-Form Games\nMarch 2, 2016\n28 / 33\n\nNuclear Crisis\nRussia provokes the US. . .\n▶The U.S. can choose to escalate (E) or end the game by ignoring the\nprovocation (I).\n▶If the game escalates, Russia faces a similar choice: to back down\n(B), but lose face, or escalate (E).\n▶Escalation leads to nuclear crisis: a simultaneous move game where\neach nation chooses to either retreat (R) and lose credibility or\ndetonate (). Unless both countries retreat, retaliation to the first\nnuclear strike culminates in nuclear disaster, which is infinitely costly.\nMihai Manea (MIT)\nExtensive-Form Games\nMarch 2, 2016\n29 / 33\n\nThe Extensive Form\nUS\nRussia\nUS\nRussia\n(-5, -5)\nR\n(-inf, -inf)\n\nR\n(-inf, -inf)\nR\n(-inf, -inf)\n\nE\n(10, -10)\nB\nE\n(0, 0)\nI\nMihai Manea (MIT)\nExtensive-Form Games\nMarch 2, 2016\n30 / 33\n\nLast Stage\nThe simultaneous-move game at the last stage has two Nash equilibria.\nR\n\nR\n-5, 5∗\n-inf, -inf\n\n-inf, -inf\n-inf, -inf∗\nMihai Manea (MIT)\nExtensive-Form Games\nMarch 2, 2016\n31 / 33\n\nOne Subgame Perfect Equilibrium\nUS\nRussia\nUS\nRussia\n(-5, -5)\nR\n(-inf, -inf)\n\nR\n(-inf, -inf)\nR\n(-inf, -inf)\n\nE\n(10, -10)\nB\nE\n(0,0)\nI\nMihai Manea (MIT)\nExtensive-Form Games\nMarch 2, 2016\n32 / 33\n\nAnother Subgame Perfect Equilibrium\nUS\nRussia\nUS\nRussia\n(-5, -5)\nR\n(-inf, -inf)\n\nR\n(-inf, -inf)\nR\n(-inf, -inf)\n\nE\n(10,-10)\nB\nE\n(0, 0)\nI\nMihai Manea (MIT)\nExtensive-Form Games\nMarch 2, 2016\n33 / 33\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n14.16 Strategy and Information\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "MIT 14.16 S16 Matching Theory Lecture Slides",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-16-strategy-and-information-spring-2016/53dbe8d681978367f9c04182aa3c9b97_MIT14_16S16_Matching.pdf",
      "content": "Matching Theory\nMihai Manea\nMIT\nBased on slides by Fuhito Kojima.\n\nMarket Design\n▶Traditional economics focuses mostly on decentralized markets.\n▶Recently, economists are helping to design economic institutions for\ncentralized markets.\n▶placing students in schools\n▶matching workers to firms in labor markets\n▶matching patients to compatible organ donors\n▶allocating space, positions, tasks\n▶auctioning electromagnetic spectrum, landing slots at aiports\n▶The economics of market design analyzes and develops institutions.\nPractical solutions require attention to the details and objectives of\nconcrete markets.\nMihai Manea (MIT)\nMatching Theory\nJune 27, 2016\n2 / 53\n\nHospitals and Residents\n▶Graduating medical students are hired as residents at hospitals.\n▶In the US more than 20,000 doctors and 4,000 hospitals are matched\nthrough a clearinghouse, the National Resident Matching Program.\n▶Doctors and hospitals submit preference rankings and the\nclearinghouse uses an algorithm to assign positions.\n▶Some centralized markets succeed, while others fail. What makes a\ngood matching mechanism?\nMihai Manea (MIT)\nMatching Theory\nJune 27, 2016\n4 / 53\n\nSchool Choice\n▶School districts use centralized student placement mechanisms.\n▶School districts take into account the preferences of students and\ndecide the priorities each school assigns to students.\n▶What is a desirable student placement mechanism? Walking\ndistance, siblings, affirmative action, test scores. . .\nMihai Manea (MIT)\nMatching Theory\nJune 27, 2016\n5 / 53\n\nKidney Exchange\n▶Some patients who need a kidney find a willing donor. The patient\nmay be incompatible with the donor, in which case a direct transplant\nis not feasible.\nFigure : Blood type compatibility\n▶A kidney exchange matches two (or more) incompatible donor-patient\npairs and swaps donors.\n▶How to design efficient kidney exchange mechanisms? Incentive and\nfairness requirements?\nMihai Manea (MIT)\nMatching Theory\nJune 27, 2016\n6 / 53\n\nOne-to-One Matching\nMihai Manea (MIT)\nMatching Theory\nJune 27, 2016\n7 / 53\n\nThe Marriage Problem\nA one-to-one matching or marriage problem (Gale and Shapley 1962)\nis a triple (M, W, R), where\n▶M = {m1, ..., mp} is a set of men\n▶W = {w1, ..., wq} is a set of women\n▶R = (Rm1, . . . , Rmp, Rw1, . . . , Rwq) is a preference profile.\nFor m ∈M, Rm is a preference relation over W ∪{m}.\nFor w ∈W, Rw is a preference relation over M ∪{w}.\nPm, Pw denote the strict preferences derived from Rm, Rw.\nIn applications men and women correspond to students and schools,\ndoctors and hospitals, etc. Extend theory to the case where a woman can\nbe matched to multiple men, many-to-one matching.\nMihai Manea (MIT)\nMatching Theory\nJune 27, 2016\n8 / 53\n\nPreferences\nConsider a man m\n▶wPmw′: man m prefers woman w to woman w′\n▶wPmm: man m prefers woman w to being single\n▶mPmw: woman w is unacceptable for man m\nSimilar interpretation for women.\nAssumption: All preferences are strict.\nMihai Manea (MIT)\nMatching Theory\nJune 27, 2016\n9 / 53\n\nMatchings\nThe outcome of a marriage problem is a matching. A matching is a\nfunction μ : M ∪W →M ∪W such that\n▶μ(m) ∈W ∪{m}, ∀m ∈M\n▶μ(w) ∈M ∪{w}, ∀w ∈W\n▶μ (m) = w ⇐⇒μ(w) = m, ∀m ∈M, w ∈W.\nAssumption: There are no externalities. Agent i ∈M ∪W prefers a\nmatching μ to a matching ν iff μ(i)Piν(i).\nMihai Manea (MIT)\nMatching Theory\nJune 27, 2016\n10 / 53\n\nStability\nA matching μ is blocked by an agent i ∈M ∪W if iPiμ(i). A matching is\nindividually rational if it is not blocked by any agent.\nA matching μ is blocked by a man-woman pair (m, w) ∈M × W if both m\nand w prefer each other to their partners under μ, i.e.,\nwPmμ(m) & mPwμ(w).\nA matching is stable if it is not blocked by any agent or pair of agents.\nMihai Manea (MIT)\nMatching Theory\nJune 27, 2016\n11 / 53\n\nStability and the Core\nProposition 1\nThe set of stable matchings coincides with the core of the associated\ncooperative game.\nProof.\nA matching μ is in the core if there exists no matching ν and coalition\nS ⊂M ∪W such that ν(i)Piμ(i) and ν(S) ⊂S. . .\n□\nMihai Manea (MIT)\nMatching Theory\nJune 27, 2016\n12 / 53\n\nThe Deferred Acceptance (DA) Algorithm\nTheorem 1 (Gale and Shapley 1962)\nEvery marriage problem has a stable matching.\nThe following men-proposing deferred acceptance algorithm yields a\nstable matching.\nStep 1. Each man proposes to his first choice (if acceptable). Each\nwoman tentatively accepts her most preferred acceptable proposal (if any)\nand rejects all others.\nStep k ≥2. Any man rejected at step k -1 proposes to his next highest\nchoice (if any). Each woman tentatively accepts her most preferred\nacceptable proposal to date and rejects the rest.\nThe algorithm terminates when there are no new proposals, in finite time.\nEach woman is matched with the man whose proposal she holds (if any) at\nthe last step. Any woman who has never tentatively accepted someone or\nany man who has been rejected by all acceptable women remains single.\nMihai Manea (MIT)\nMatching Theory\nJune 27, 2016\n13 / 53\n\nExample\nPm1 : w2 ≻w1 ≻w3 ≻m1\nPm2 : w1 ≻w2 ≻w3 ≻m2\nPm3 : w1 ≻w2 ≻w3 ≻m3\n| {z }\nMen's Preferences\nPw1 : m1 ≻m3 ≻m2 ≻w1\nPw2 : m2 ≻m1 ≻m3 ≻w2\nPw3 : m2 ≻m1 ≻m3 ≻w3\n| {z }\nWomen's Preferences\nThe resulting matching is\nμ =\n\nm1\nm2\nm3\nw1\nw2\nw3\n!\n.\nMihai Manea (MIT)\nMatching Theory\nJune 27, 2016\n14 / 53\n\n▶Women get weakly better off and men get weakly worse off as the\nalgorithm proceeds.\n▶The algorithm eventually stops, producing a matching μ.\n▶μ is stable\n▶μ cannot be blocked by any individual agent, since men never propose\nto unacceptable women and women immediately reject unacceptable\nmen.\n▶Suppose the pair (m, w) blocks μ. Then wPmμ(m) implies that m\nproposed to w in the algorithm and, as they are not matched with each\nother, w rejected m in favor of someone better. But w gets weakly\nbetter throughout the algorithm, hence μ(w)Pwm, which contradicts the\nassumption that (m, w) blocks μ.\nMihai Manea (MIT)\nMatching Theory\nJune 27, 2016\n15 / 53\n\nStable Mechanisms in Real Markets\n▶Stability is theoretically appealing, but is it relevant in applications?\n▶Roth (1984) showed that the NRMP algorithm is equivalent to a\n(hospital-proposing) DA algorithm, so NRMP produces a stable\nmatching.\n▶Roth (1991) studied the British medical match, where various regions\nuse different matching mechanisms. Stable mechanisms outlast\nunstable ones.\nMihai Manea (MIT)\nMatching Theory\nJune 27, 2016\n16 / 53\n\nEvidence from the Medical Match\nMarket\nStable\nStill in use\nNRMP\nyes\nyes (new design 98-)\nEdinburgh ('69)\nyes\nyes\nCardiff\nyes\nyes\nBirmingham\nno\nno\nEdinburgh ('67)\nno\nno\nNewcastle\nno\nno\nSheffield\nno\nno\nCambridge\nno\nyes\nLondon Hospital\nno\nyes\nMihai Manea (MIT)\nMatching Theory\nJune 27, 2016\n17 / 53\n\nMen-Optimal Stable Matching\nTheorem 2 (Gale and Shapley 1962)\nThere exists a men-optimal stable matching that every man weakly\nprefers to any other stable matching. Furthermore, the men-proposing\ndeferred acceptance algorithm delivers the men-optimal stable matching.\nProof.\nWe say that w is achievable for m if there is some stable matching μ with\nμ(m) = w. For a contradiction, suppose a man is rejected by an\nachievable woman at some stage of the deferred acceptance algorithm.\nConsider the first step of the algorithm in which a man m is rejected by an\nachievable woman w. Let μ be a stable matching where μ(m) = w. Then\nw tentatively accepted some other man m′ at this step, so (i) m′Pwm.\nSince this is the first time a man is rejected by an achievable woman, (ii)\nwPm′μ(m′).\nBy (i) and (ii), (m′, w) blocks μ, contradicting the stability of μ.\n□\nMihai Manea (MIT)\nMatching Theory\nJune 27, 2016\n18 / 53\n\nThe Opposing Interests of Men and Women\nAnalagous to the men-optimal stable matching, there is a women-optimal\nstable matching (obtained by a version of the deferred acceptance\nalgorithm where women propose).\n▶μM: men-optimal stable matching\n▶μW: women-optimal stable matching\nTheorem 3 (Knuth 1976)\nμW is the worst stable matching for each man. Similarly, μM is the worst\nstable matching for each woman.\nExample with 2 men, 2 women, with \"reversed\" preferences\nMihai Manea (MIT)\nMatching Theory\nJune 27, 2016\n19 / 53\n\nProof of Opposing Interests\nSuppose there is a man m and stable matching μ such that\nμW(m)Pmμ(m).\nThen m is not single under μW. Let w = μW(m). Clearly, w , μ(m), so\nm , μ(w).\nBy the definition of μW, m = μW(w)Pwμ(w). But then (m, w) blocks μ,\nyielding the desired contradiction.\nMihai Manea (MIT)\nMatching Theory\nJune 27, 2016\n20 / 53\n\nRelevance of Opposing Interests\nThe result shows that different stable matchings may benefit different\nmarket participants. In particular, each version of the deferred acceptance\nalgorithm favors one side of the market at the expense of the other.\nThis point was part of a policy debate in NRMP in the 90s. The previous\nNRMP algorithm had hospitals proposing. Medical students argued that\nthe system favors hospitals over doctors and called for the\ndoctor-proposing version of the mechanism.\nMihai Manea (MIT)\nMatching Theory\nJune 27, 2016\n21 / 53\n\nAgents Matched at Stable Matchings\nμ(W) := μ(W) ∩M: set of men who are matched under μ\nμ(M) := μ(M) ∩W: set of women who are matched under μ\nTheorem 4 (McVitie and Wilson 1970)\nThe set of matched agents is identical at every stable matching.\nProof.\nLet μ be an arbitrary stable matching.\n▶| μM(W)| ≥| μ(W)| ≥| μW(W)|, since any man matched under μ (μW) is\nalso matched under μM (μ)\n▶similarly, | μW(M)| ≥| μ(M)| ≥| μM(M)|\n▶obviously, | μM(W)| = | μM(M)| & | μW(W)| = | μW(M)|, hence all\ninequalities hold with equality\n▶in particular, | μM(W)| = | μ(W)|; since any man matched under μ is\nalso matched under μM, we get μM(W) = μ(W)\n▶analogous argument for women\n□\nMihai Manea (MIT)\nMatching Theory\nJune 27, 2016\n22 / 53\n\nRelevance of the Result\nOne motivation is the allocation of residents to hospitals in rural areas.\nRural hospitals are not attractive to residents and have difficulties filling\ntheir positions. It has been argued that the matching mechanism should\nbe adjusted so that more doctors go to rural areas. The theorem shows\nthat this is not feasible if stable matchings are implemented.\nAlso, if some students were matched at some stable matchings and not\nothers, they would find it unfair if one of the matchings that do not include\nthem is selected.\nMihai Manea (MIT)\nMatching Theory\nJune 27, 2016\n23 / 53\n\nJoin and Meet\nDefinition 1\nFor any matchings μ and μ′, the function μ ∨M μ′ : M ∪W →M ∪W (join\nof μ and μ′) assigns each man the more preferred of his two assignments\nunder μ and μ′ and each woman the less preferred.\nM\n( μ(m)\nif μ(m)R\nμ ∨\nμ′(m\nmμ′(m)\n)\n=\n′ m\nif\n′ m P\nm\nμ ∨M μ′(w)\n=\n(\nμ (\n)\nμ (\n)\nmμ(\n)\nμ(w)\nif μ′(w)Rwμ(w)\nμ′(w)\nif μ(w)Pwμ′(w)\nμ ∧M μ′ : M ∪W →M ∪W (meet of μ and μ′) is defined analogously, by\nreversing preferences.\nMihai Manea (MIT)\nMatching Theory\nJune 27, 2016\n24 / 53\n\nExample\nPm1 :\nw1 w2 w3 m1\nPw1 :\nm2 m3 m1 w1\nPm2 :\nw2 w3 w1 m2\nPw2 :\nm3 m1 m2 w2\nPm3 :\nw2 w1 w3 m3\nPw3 :\nm1 m2 m3 w3\nμ\n=\n\nm1\nm2\nm3\nw\nw\nw\n!\nμ′\n=\n\nm1\nm2\nm3\nw3\nw1\nw2\n!\nThe join and meet of μ and μ′ are\nμ ∨M μ′\n=\n\nm1\nm2\nm3\nw1\nw2\nw3\nw1\nw\n\nw2\nm1\nm2\nm3\nM\nm1\nm2\nm3\nw\nw\n!\nμ ∧\nμ′\nw3\n=\nw3\nw1\nw3\nm2\nm3\nm1\n!\nNeither is a matching!\nMihai Manea (MIT)\nMatching Theory\nJune 27, 2016\n25 / 53\n\nThe Lattice Structure of the Set of Stable Matchings\nTheorem 5 (Conway)\nIf μ and μ′ are stable matchings, then μ ∨M μ′ and μ ∧M μ′ are\nmatchings\nstable.\nWe prove the result for the join. The proof for the meet is similar.\nMihai Manea (MIT)\nMatching Theory\nJune 27, 2016\n26 / 53\n\nProof of Part 1.\nμ ∨M μ′ is a matching\n▶The sets of single agents under μ and μ′ are identical (Theorem 4),\nhence also identical under μ ∨M μ′.\n▶If a man-woman pair are matched to each other under both μ and μ′,\nthis also holds under μ ∨M μ′.\n▶Consider a man m with different mates under μ and μ′. W.l.o.g.,\nassume w := μ(m)Pmμ′(m). Then μ ∨M μ′(m) = w.\n▶We need to show that μ ∨M μ′(w) = m. Else, m = μ(w)Pwμ′(w) and\nhence (m, w) blocks μ′, contradicting its stability.\n□\nMihai Manea (MIT)\nMatching Theory\nJune 27, 2016\n27 / 53\n\nProof of Part 2.\nμ ∨M μ′ is stable\n▶For a contradiction, suppose that (m, w) blocks μ ∨M μ′. W.l.o.g.,\nassume μ ∨M μ′(w) = μ(w).\n▶Then\nmPw[μ ∨M μ′(w)] = μ(w) and wPm[μ ∨M μ′(m)]Rmμ(m),\nso (m, w) blocks μ, contradicting its stability.\n□\nDiscuss median stable matchings.\nMihai Manea (MIT)\nMatching Theory\nJune 27, 2016\n28 / 53\n\nStrategic Behavior\n▶We know many desirable properties of stable matchings, given\ninformation about the preferences of market participants.\n▶But in reality, preferences are private information, so the\nclearinghouse needs to rely on the participants' reports.\n▶Do participants have incentives to state their preferences truthfully?\nMihai Manea (MIT)\nMatching Theory\nJune 27, 2016\n29 / 53\n\nDirect Mechanisms\nFix M and W, so that each preference profile R defines a marriage\nproblem.\nRi: set of all preference relations for agent i\nR = Q\ni∈M∪W Ri: set of all preference profiles\nR-i: set of all preferences for all agents except i\nM: set of all matchings\nA mechanism is a systematic procedure which determines a matching for\nevery marriage problem. Formally, a mechanism is a function φ : R →M.\nMihai Manea (MIT)\nMatching Theory\nJune 27, 2016\n30 / 53\n\nStable Mechanisms\nA mechanism φ is stable if φ(R) is stable for each R ∈R.\nφM (φW) : the mechanism that selects the men-(women-)optimal stable\nmatching for each problem\nMihai Manea (MIT)\nMatching Theory\nJune 27, 2016\n31 / 53\n\nPreference Revelation Games\nEach mechanism φ induces a preference revelation game for every\npreference profile R where\n▶the set of players is M ∪W\n▶the strategy space for player i is Ri\n▶the outcome is determined by the mechanism--if agents report R′,\nthe outcome is φ(R′)\n▶i's preferences over outcomes are given by his true preference Ri.\nA mechanism φ is strategy-proof if, for every (true) preference profile R,\ntruthful preference revelation is a (weakly) dominant strategy for every\nplayer in the induced preference revelation game.\nFormally, a mechanism φ is strategy-proof if\nφ(R-i, Ri)(i) Ri φ(R-i, Ri\n′)(i),\n∀i ∈M ∪W, ∀Ri, R′\n.\ni ∈Ri, ∀R-i ∈R-i\nMihai Manea (MIT)\nMatching Theory\nJune 27, 2016\n32 / 53\n\nφM (φW) is Not Strategy-Proof\n▶Let M = {m1, m2}, W = {w1, w2} and\nPm1 : w1, w2, m1\nPm2 : w2, w1, m2\nPw1 : m2, m1, w1\nPw2 : m1, m2, w2.\n▶When each agent reports his true preferences, φM produces\nφM(R) = {(m1, w1), (m2, w2)}.\n▶If w1 instead reports\nP′\nw1 : m2, w1, m1\nthen φM produces φM(R′) = {(m1, w2), (m2, w1)}, which w1 prefers to\nφM(R).\n▶Hence w1 has incentives to misreport her preferences and the\ndeferred acceptance mechanism is not strategy-proof.\nMihai Manea (MIT)\nMatching Theory\nJune 27, 2016\n33 / 53\n\nIncompatibility of Stability and Strategy-Proofness\nTheorem 6 (Roth 1982)\nThere exists no mechanism that is both stable and strategy-proof.\nProof.\nConsider the following 2 men, 2 women problem\nRm1 :\nw1 w2 m1\nRm2 :\nw2 w1 m2\nRw1 :\nm2 m1 w1\nRw2 :\nm1 m2 w2\nIn this problem there are only two stable matchings,\nμM =\n\nm1\nm2\nw1\nw2\n!\nand\nμW =\n\nm1\nm2\nw2\nw1\n!\n.\nLet φ be any stable mechanism. Then φ(R) = μM or φ(R) = μW.\nnext slide. . .\nMihai Manea (MIT)\nMatching Theory\nJune 27, 2016\n34 / 53\n\nProof (Continuation).\nSuppose that φ(R) = μM. If w1 misrepresents her preferences to be\nR′\nw1 : m2, w1, m1\nthen μW is the unique stable matching for the manipulated economy\n(R-w1, R′\nw1). Since φ is stable, it must be that φ(R-w1, R′\nw1) = μW. But then\nφ is not strategy-proof, as μW Pw1 μM.\nIf, on the other hand, φ(R) = μW then m1 can report false preferences\nR′\nm1 : w1, m1, w2\nand ensure that his favorite stable matching μM is selected by φ, since it is\nthe only stable matching for the manipulated economy (R-m1, R′\nm1).\n□\nMihai Manea (MIT)\nMatching Theory\nJune 27, 2016\n35 / 53\n\nA Stronger Negative Result\nEvery stable matching is Pareto efficient (proof?) and individually rational.\nTheorem 7 (Alcalde and Barbera 1994)\nThere exists no mechanism that is Pareto efficient, individually rational\nand strategy-proof.\nProof.\nFor R from the previous proof, any efficient and individually rational\nmechanism φ satisfies φ(R) = μM or φ(R) = μW. Suppose φ(R) = μM.\nMoreover, φ(R-w1, R′\nw1) ∈{μW, μ}, where μ = {(m2, w2)}.\nIf φ(R-w1, R′\nw1) = μW, we obtain a contradiction as before.\nSuppose φ(R-w1, R′\nw1) = μ. Consider R′\nw2 : m1, w2, m2. The only efficient\nand individually rational matching at (RM, R′\nW) is μW, so φ(RM, R′\nW) = μW.\nBut then m1 = φw2(RM, R′\nW) Rw2 φw2(R-w1, R′\nw1) = m2, and w2 has\nincentives to report R′\nw2 at (R-w1, R′\nw1).\n□\nMihai Manea (MIT)\nMatching Theory\nJune 27, 2016\n36 / 53\n\nIncentives of Men Under φM\nTheorem 8 (Dubins and Freedman 1981, Roth 1982)\nTruth-telling is a weakly dominant strategy for all men under the\nmen-optimal stable mechanism.\nSimilarly, truth-telling is a weakly dominant strategy for all women under\nthe women-optimal stable mechanism.\nMihai Manea (MIT)\nMatching Theory\nJune 27, 2016\n37 / 53\n\nMany-to-One Matching\nMihai Manea (MIT)\nMatching Theory\nJune 27, 2016\n38 / 53\n\nCollege Admissions Problems\nA college admissions problem (Gale and Shapley 1962) is a 4-tuple\n(C, S, q, R) where\n▶C = {c1, ..., cm} is a set of colleges\n▶S = {s1, ..., sn} is a set of students\n▶q = (qc1, . . . , qcm) is a vector of college capacities\n▶R = (Rc1, . . . , Rcm, Rs1, . . . , Rsn) is a list of preferences.\nRs: preference relation over colleges and being unassigned, i.e., C\ns\nR : preference relation over sets of students, i.e., 2S\n∪{ }\nc\nPc(Ps): strict preferences derived from Rc(Rs)\nMihai Manea (MIT)\nMatching Theory\nJune 27, 2016\n39 / 53\n\nCollege Preferences\nSuppose colleges have rankings over individual students. How should they\ncompare between sets of students?\nIf T is a set consisting of c's 2nd & 4th choices and T′ consists of its\n3rd & 4th choices, then T PcT′. If T′′ contains c's 1st & 5th, then T ?cT′′.\nMultiple Pc's are consistent with the same ranking of singletons, but this is\nnot essential for the definition of stability.\nRc is responsive (Roth 1985) if\n▶whether a student is acceptable for c\n▶the relative desirability of two students\ndo not depend on other students in the class.\nMihai Manea (MIT)\nMatching Theory\nJune 27, 2016\n40 / 53\n\nResponsiveness\nFormally, Rc is responsive if\nfor any T ⊂S with |T| < qc and s ∈S \\ T,\n(T ∪{s}) Pc T\n⇐⇒\n{s} Pc ∅\nfor any T ⊂S with |T| < qc and s, s′ ∈S \\ T,\n(T ∪{s}) Pc (T ∪{s′})\n⇐⇒\n{s} Pc {s′}.\nMihai Manea (MIT)\nMatching Theory\nJune 27, 2016\n41 / 53\n\nMatchings\nThe outcome of a college admissions problem is a matching.\nFormally, a matching is a correspondence μ : C ∪S ⇒C ∪S such that\nμ(c) ⊆S with |μ(c)| ≤qc for all c ∈C (we allow μ(c) = ∅),\nμ(s) ⊆C ∪{s} with |μ(s)| = 1 for all s ∈S, and\ns ∈μ(c) ⇐⇒μ(s) = {c} for all c ∈C and s ∈S.\nMihai Manea (MIT)\nMatching Theory\nJune 27, 2016\n42 / 53\n\nStability\nA matching μ is blocked by a college c ∈C if there exists s ∈μ(c) such\nthat ∅Pc {s}.\nA matching μ is blocked by a student s ∈S if s Ps μ(s).\nA matching μ is blocked by a pair (c, s) ∈C × S if\nc Ps μ(s) and\neither\nthere exists s′ ∈μ(c) such that {s} Pc {s′} or\n|μ(c)| < qc and {s} Pc ∅.\nA matching is stable if it is not blocked by any agent or pair.\nMihai Manea (MIT)\nMatching Theory\nJune 27, 2016\n43 / 53\n\nStable Matchings and the Core\n(c, s) blocks a matching μ if c Ps μ(s) and either\n▶there exists s′ ∈μ(c) such that {s} Pc {s′}, which means that the\ncoalition {c, s} ∪μ(c) \\ {s′} can weakly block μ in the associated\ncooperative game, or\n▶|μ(c)| < qc and {s} Pc ∅, hence the coalition {c, s} ∪μ(c) can weakly\nblock μ in the cooperative game.\nA coalition weakly blocks an outcome of a cooperative game if it has a\nfeasible action that makes every member weakly better off, with at least\none strict preference →core defined by weak domination (contained in\nthe standard core). This is the right concept of stability in many-to-one\nsettings, as colleges may block a matching by admitting new students\nwhile holding on to some old ones.\nProposition 2 (Roth 1985)\nThe weak domination core coincides with the set of stable matchings.\nMihai Manea (MIT)\nMatching Theory\nJune 27, 2016\n44 / 53\n\nThe Deferred Acceptance Algorithm\nThe following student applying deferred acceptance algorithm yields a\nstable matching.\nStep 1. Each student \"applies\" to her first choice college. Each college\ntentatively accepts the most preferred acceptable applicants up to its\nquota and rejects all others.\nStep k ≥2. Any student rejected at step k -1 applies to his next highest\nchoice (if any). Each college considers both the new applicants and the\nstudents held at step k -1 and tentatively accepts the most preferred\nacceptable applicants from the combined pool up to its quota; the other\nstudents are rejected.\nThe algorithm terminates when there are no new applications, in finite\ntime.\nMihai Manea (MIT)\nMatching Theory\nJune 27, 2016\n45 / 53\n\nThe Correspondence between Many-to-One and\nOne-to-One Matchings\nMany (but not all) results for the marriage problem extend to the college\nadmissions problem. The following trick is useful in proofs.\nFor any college admissions problem (C, S, q, R), construct the related\nmarriage problem as follows.\n▶\"Divide\" each college c into qc distinct \"seats\" c1, . . . , cqc. Each seat\nhas unit capacity and ranks students according to c's preferences\nover singletons. (This is feasible when Rc is responsive, and hence\nconsistent with a unique ranking of students. . . but not for more\ngeneral preferences.) C∗denotes the resulting set of college seats.\n▶For any student s, extend her preferences to C∗by replacing each\ncollege c in her original preferences Rs with the block c1, . . . , cqc, in\nthis order.\nMihai Manea (MIT)\nMatching Theory\nJune 27, 2016\n46 / 53\n\nExample\nThe college admissions problem defined by\nC = {c1, c2}, qc1 = 2, qc2 = 1, S = {s1, s2} and\nRc1\nRc2\n{s1, s2}\n{s1}\n{s2}\n{s2}\n{s1}\nRs1\nRs2\nc1\nc2\nc2\nc1\nμ =\n\nc1\nc2\ns2\ns1\n!\nis transformed into the marriage problem with M = {c1\n1, c2\n1, c2}, W = S and\nRc1\nRc2\nRc2\ns2\ns2\ns1\ns1\ns1\ns2\nRs1\nRs2\nc1\nc2\nc2\nc1\nc2\nc2\nμ∗=\n\nc1\nc2\nc2\ns2\nc2\ns1\n!\n.\nMihai Manea (MIT)\nMatching Theory\nJune 27, 2016\n47 / 53\n\nStability Lemma\nIn the related marriage problem\n▶each seat at a college c is an individual unit that has preferences\nconsistent with Pc\n▶students rank seats at different colleges as they rank the respective\ncolleges, whereas seats at the same college are ranked according to\ntheir index.\nGiven a matching for a college admissions problem, it is straightforward to\ndefine the corresponding matching for its related marriage problem: for\nany college c, assign the students matched to c in the original problem to\nseats at c, such that students ranked higher by Pc get lower indexed seats.\nLemma 1 (Roth 1985)\nA matching in a college admissions problem is stable if and only if the\ncorresponding matching for the related marriage problem is stable.\nMihai Manea (MIT)\nMatching Theory\nJune 27, 2016\n48 / 53\n\nFurther Results\nThe Stability Lemma can be used to extend many results from marriage\nproblems to college admissions.\n▶The student (college) proposing deferred acceptance algorithm\nproduces the student-(college-)optimal stable matching.\n▶Opposing interests, lattice structure.\n▶The rural hospital theorem also extends. The following stronger\nversion holds.\nTheorem 9 (Roth 1986)\nAny college that does not fill all its positions at some stable matching is\nassigned precisely the same set of students at every stable matching.\nMihai Manea (MIT)\nMatching Theory\nJune 27, 2016\n49 / 53\n\nPreferences over Stable Matchings\nAny two classes to which a college can be stably matched are ranked in\nthe following strong sense.\nTheorem 10 (Roth and Sotomayor 1989)\nIf μ and ν are stable matchings such that μ(c) Pc ν(c), then\n{s} Pc {s′}, ∀s ∈μ(c), s′ ∈ν(c) \\ μ(c).\nThe set of stable matchings depends only on colleges' ranking of individual\nstudents. The same is true about preferences over stable matchings.\nCorollary 1\nSuppose the preferences Pc and P′\nc are consistent with the same ranking\nof individuals and P-c is a preference profile for C ∪S \\ {c}. Let Σ denote\nthe common set of stable matchings for (Pc, P-c) and (P′\nc, P-c). Then\nμ(c) Pc ν(c) =⇒μ(c) P′\nc ν(c), ∀μ, ν ∈Σ.\nMihai Manea (MIT)\nMatching Theory\nJune 27, 2016\n50 / 53\n\nSome Properties Do Not Extend to Many-to-One Settings\nNot all properties carry over to many-to-one matchings, especially those\nconcerning incentives.\n▶No stable mechanism is strategy-proof for colleges (Roth 1985). In\nparticular, even the college-proposing deferred acceptance rule is not\nstrategy-proof for colleges. Intuition: a college is like a coalition of\nplayers in terms of strategies.\n▶On the contrary, student-proposing deferred acceptance is still\nstrategy-proof for students. Why?\n▶Colleges may benefit simply by misreporting capacities. Sonmez\n(1997) shows that no stable mechanism is immune to misreporting\ncapacities.\nMihai Manea (MIT)\nMatching Theory\nJune 27, 2016\n51 / 53\n\nIncentives for Colleges under Stable Mechanisms\nConsider the college admissions problem with\nC = {c1, c2}, qc1 = 2, qc2 = 1, S = {s1, s2} and the following preferences\nRc1\nR′\nc1\nRc2\n{s1, s2}\n{s2}\n{s1}\n{s2}\n∅\n{s2}\n{s1}\nRs1\nRs2\nc1\nc2\nc2\nc1 .\nEach of the problems (Rc1, R-c1) and (R′\nc1, R-c1) has a unique stable\nmatching,\n\nc1\nc2\ns1\ns2\n!\nand, respectively,\n\nc1\nc2\ns2\ns1\n!\n.\nHence college c1 benefits from reporting R′\nc1 instead of Rc1 under any\nstable mechanism (including the college-optimal stable one).\nMihai Manea (MIT)\nMatching Theory\nJune 27, 2016\n52 / 53\n\nManipulation of φC via Capacities\nConsider the college admissions problem with\nC = {c1, c2}, qc1 = 2, qc2 = 1, S = {s1, s2} and the following preferences\nRc1\nRc2\n{s1, s2}\n{s1}\n{s2}\n{s2}\n{s1}\nRs1\nRs2\nc1\nc2\nc2\nc1 .\nLet q′\nc1 = 1 be a potential capacity manipulation by college c1. We have\nφC(R, q) =\n\nc1\nc2\ns1\ns2\n!\nand φC(R, q′\nc1, qc2) =\n\nc1\nc2\ns2\ns1\n!\n.\nHence c1 benefits under φC by underreporting its number of seats.\nMihai Manea (MIT)\nMatching Theory\nJune 27, 2016\n53 / 53\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n14.16 Strategy and Information\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "MIT 14.16 S16 Networks Lecture Slides",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-16-strategy-and-information-spring-2016/2673fcadbd95125e520dcbd4f2afba56_MIT14_16S16_networks.pdf",
      "content": "Networks\nMihai Manea\nMIT\n\nNetworks in Economics\n▶Network: collection of nodes and links between them. . . local\ninteraction structure\n▶Social and economic networks: nodes are individuals or firms, links\nrelationships\n▶Many activities shaped by networks\n▶exchange of information and opinions\n▶trade of goods and services, intermediation\n▶job opportunities\n▶friendships, business partnerships, political/trade alliances\n▶risk-sharing, favors, cooperation\n▶innovation, technology adoption\n▶credit and financial flows\n▶peer effects: education, crime, voting\nMihai Manea (MIT)\nNetworks\nMay 9, 2016\n2 / 36\n\nOutcomes in Networks\nQuestions for economics\n▶How do networks form?\n▶Which network structures are likely to emerge?\n▶What is the impact of network architecture on economic outcomes?\n▶How does an individual's position in the network affect his actions and\nwelfare?\n▶Which networks are socially optimal?\nNetworks also constitute an important area of research in sociology,\ncomputer science, mathematics, and statistical physics.\nMihai Manea (MIT)\nNetworks\nMay 9, 2016\n3 / 36\n\nNotation\n▶players (or nodes, vertices): N = {1, . . . , n}\n▶network (or graph) with nodes N: (gij)i,j∈N with gij ∈{0, 1}, ∀i, j ∈N\n▶i has a link (or connection, relationship) to j iff gij = 1; alternative\nnotation, ij ∈g ⇐⇒gij = 1\n▶a network is undirected if gij = gji, ∀i, j ∈N; directed otherwise\nMihai Manea (MIT)\nNetworks\nMay 9, 2016\n4 / 36\n\nAmerican Politics\nFigure: Political blogs prior to the 2004 U.S. Presidential election: two\nwell-separated clusters (Adamic and Glance 2005). The web does not\nautomatically guarantee that each individual obtains a diversity of\nopinions. . . networks can increase \"herding\" instead of \"wisdom of the crowds.\"\nMihai Manea (MIT)\nNetworks\nMay 9, 2016\n5 / 36\n(c) Association for Computing Machinery. All rights reserved. This content is excluded from our\nCreative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/.\n\nSocial Contagion\nFigure: E-mail recommendations for a manga book: information cascade in the\nadoption of new products/technologies (Leskovec et al. 2007)\nMihai Manea (MIT)\nNetworks\nMay 9, 2016\n6 / 36\n(c) Association for Computing Machinery. All rights reserved. This content is excluded from our\nCreative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/.\n\nFlorentine Elite\nFigure: Structure of marriages between key families in 15th century Florence. The\nMedicis emerged as the most influential family, dominating Mediterranean trade,\neven though they were not as powerful or wealthy as other families. Their central\nposition in the intermarriage network explains why (Padgett and Ansell 1993).\nMihai Manea (MIT)\nNetworks\nMay 9, 2016\n7 / 36\n(c) Cambridge University Press. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/.\n\nBetweenness Centrality\nA measure of power\n▶P (i, j): # shortest paths connecting i to j\n▶Pk (i, j): # shortest paths connecting i and j that include k\n▶Betweenness centrality of node k\nBk =\n(n -1)(n -2)\nX\ni,j,k\nPk (i, j)\nP (i, j)\n▶Bk: fraction of paths between all pairs of nodes going through k\n▶Medicis have the highest betweenness centrality, 0.52. All other\nfamilies have centralities < 0.26.\nWhy only shortest paths?\nMihai Manea (MIT)\nNetworks\nMay 9, 2016\n8 / 36\n\nInternational Trade and R&D\nFranco, Montresor, Vittucci-Marzetti (2009)\nFigure: Betweenness centrality in international trade is correlated with indirect\nresearch and development spillovers (Franco, Montresor, and Marzetti 2009).\nMihai Manea (MIT)\nNetworks\nMay 9, 2016\n9 / 36\n(c) Social Science Electronic Publishing. All rights reserved. This content is excluded from our\nCreative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/.\n\nFinancial Networks\nFigure: Network of loans among financial institutions: how do financial\ninteractions affect the health of each bank and the whole system? Centrality is\ncorrelated with interest rates of loans (Bech and Atalay 2008).\nMihai Manea (MIT)\nNetworks\nMay 9, 2016\n10 / 36\nCourtesy of the Federal Reserve Bank of New York. Used with permission.\n\nBonacich (1972) Centrality\nA node's centrality depends on the centrality of its neighbors. . .\nFix α > 0. Solve the system\nxi = 1 + α\nX\ngijxj,\nj,i\n∀i ∈N\nto obtain x = (I -αG\n)-1 (inverse exists for small α), where G = (gij)i,j∈N.\nDefine\n+inf\nM(G, α) = (I -\nαG -\nk\n)\n=\nα Gk.\nk=0\nGk keeps track of paths of length k, and m\nX\nij(G, α) counts all weighted\npaths from i to j (length k paths weighted by\nk\nα ).\nDefinition 1\nThe Bonacich centrality bi(g, α) of node i in g for parameter α is the total\nweight of paths starting at i,\nbi(g, α) = mi1(G, α) + · · · + min(G, α).\nMihai Manea (MIT)\nNetworks\nMay 9, 2016\n11 / 36\n\nPeer Effects\nPlayer i ∈N selects effort xi ≥0. Player i's payoff for x = (xi)i∈N is\nui(x) = xi -\nx2 + α\n.\ni\nX\ngijxixj\nj,i\nα > 0, gij = 1: strategic complementarity between i and j,\nBRi(x-i) = 1 + α\nX\ngijxj.\nj,i\nIn a Nash equilibrium,\nxi = 1 + α\nX\ngijxj,\nj,i\n∀i ∈N ⇐⇒xi = bi(g, α).\nBonacich centrality measures influence. Connection exploited by\n▶Ballester, Calvo-Armengol, and Zenou (2006)\n▶Acemoglu, Carvalho, Ozdaglar, Tahbaz-Salehi (2012)\n▶Bramoulle, Kranton, and D'Amours (2014)\nMihai Manea (MIT)\nNetworks\nMay 9, 2016\n12 / 36\n\nBargaining Power\nFigure: The position with the greatest number of connections is not necessarily\nthe strongest (Manea 2012).\nMihai Manea (MIT)\nNetworks\nMay 9, 2016\n13 / 36\n\nIntermediation Power and Long Chains\nFigure: Trade does not take place along the shortest intermediation chain due to\nseller's incentives to exploit competition (Manea 2016).\nMihai Manea (MIT)\nNetworks\nMay 9, 2016\n14 / 36\n\nA Large Financial Network\nFedwire enables financial institutions to transfer funds electronically\n▶primary US network for large-value and time-critical payments\n▶operated by the Fed\n▶10,000 banks\n▶resilient and redundant\nIn 2007, average daily value of transfers over Fedwire was $2.7 trillion,\nand daily number of payments was 537,000.\nMihai Manea (MIT)\nNetworks\nMay 9, 2016\n15 / 36\n\nStructure of Observed Networks\n▶Degree distribution: number of connections is uneven and small on\naverage\nFedwire: 10,000 banks; average of 3 links per bank, a few banks with\n>1,000 links\n▶Clustering: a node's connections tend to be linked with one another\nCli(g) = |{jk ∈g|ij, ik ∈g}|\n|{jk|ij, ik ∈g}|\nWhat fraction of pairs of i's neighbors are linked to each other?\nFedwire: high clustering, average > .5\n▶Diameter: small average distance between nodes\nFedwire: average distance 2.6\nMihai Manea (MIT)\nNetworks\nMay 9, 2016\n16 / 36\n\nDo We Live in a Small World?\nIn a 1929 play, Frigyes Karinthy suggested we live in a small world: any\ntwo of the 1.5B people living then linked through at most 5 acquaintances.\nStanley Milgram (1967) \"The Small World Problem\"\n▶Participants asked to route letters to persons whom they did not know\ndirectly. Letters distributed to subjects in KS and NE. . . told the name,\nprofession, and residential details of target persons from MA.\n▶Subjects need to pass the letter on to someone whom they knew and\nwould be likely to know the target or pass it on to someone else, etc.,\nwith the objective of reaching the target.\n▶42 of the 160 letters made it to their target, with a median number of\nintermediaries equal to 5.5. . . six degrees of separation\nSimilar studies for other networks\n▶Albert, Jeong, and Barabasi (1999): diameter of the Internet in 1998\n(800M websites) was 11\n▶Watts and Strogatz (1998): average distance of 3.7 in actor network\nMihai Manea (MIT)\nNetworks\nMay 9, 2016\n17 / 36\n\nWhy Small Distances?\n▶Most people have thousands of acquaintances.\n▶Taking the conservative estimate that each individual has 100\nrelatives, friends, colleagues, and acquaintances with whom they are\nin regular contact, we end up with roughly 10,000 friends of friends\nand 1M friends of friends of friends.\n▶Moving out 4 links, we cover a nontrivial part of most countries.\n▶While this overestimates the reach of a network since it treats the\nnetwork like a tree and ignores clustering, it provides an idea of\norders of magnitude.\nMihai Manea (MIT)\nNetworks\nMay 9, 2016\n18 / 36\n\nSmall World Networks\nFigure: It only takes a small number of links randomly placed in a network to\ngenerate small diameter. . . combine with a regular and clustered base network to\ngenerate networks that simultaneously exhibit high clustering and low diameter\n(Watts and Strogatz 1998). Research inspired by synchronization of cricket\nchirps.\nMihai Manea (MIT)\nNetworks\nMay 9, 2016\n19 / 36\n(c) Cambridge University Press. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/.\n\nEconomic Models of Small Worlds\n▶Jackson and Rogers (2007): individuals form links in order with\nrandomly selected predecesors and then with randomly selected\nneighbors of their neighbors (e.g., meeting friends of friends)\n▶Iijima and Kamada (2015): individuals have multidimensional\ncharacteristics (e.g, ethnicity, job, location, opinions, hobbies) and\nform links with others who are close on k dimensions. . . homophily\nMihai Manea (MIT)\nNetworks\nMay 9, 2016\n20 / 36\n\nHomophily\nFigure: The National Longitudinal Adolescent Health Data Set--friendships\namong high school students coded by race (Currarini, Jackson and Pin 2008).\nHomophily: 52% of the students are white and yet 86% of whites' friendships are\nwith other whites. Similarly, 38% of the students are black but 85% of blacks'\nfriendships are with other blacks.\nMihai Manea (MIT)\nNetworks\nMay 9, 2016\n21 / 36\n(c) The Econometric Society. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/.\n\nHow Do People Find Jobs?\nGranovetter (1973) \"The Strength of Weak Ties\"\n▶Most people find jobs through acquaintances, not close friends.\n▶People have more acquaintances than friends.\n▶Clustering of strong ties: we become friends with close friends of our\nfriends.\n▶Workers are more likely to get referrals through an acquaintance than\na close friend to managers whom they do not know→importance of\nweak ties.\nMihai Manea (MIT)\nNetworks\nMay 9, 2016\n22 / 36\n\nStrategic Network Formation\nJackson and Wolinsky (1996): model of network formation where links\nrequire mutual consent\n▶explicitly model the costs and benefits from every network\n▶how do networks form?\n▶predict how individual incentives translate into network outcomes\n▶which networks are best for society?\n▶tension between individual incentives and social welfare due to\nnetwork externalities\nMihai Manea (MIT)\nNetworks\nMay 9, 2016\n23 / 36\n\nPayoffs\n▶N = {1, . . . , n}: players\n▶G: set of undirected networks with nodes in any N′ ⊆N\n▶value function v : G →[0, inf) assigns a total worth to any g ∈G\n▶v is component additive if v(g) =\nP\nconnected components h of g\nv(h)\n▶V: set of all component additive value functions\n▶an allocation rule u : G × V →[0, inf)n describes how the value of\nevery network is distributed among players\n▶ui(g, v): payoff of player i in network g for value function v\n▶u is component balanced if for all connected components h of g,\nX\ni is a node in h\nui(g, v) = v(h)\nDefinition 2 (Efficiency)\nA network g is efficient with respect to v if v(g) ≥v(g′), ∀g′ ∈G.\nMihai Manea (MIT)\nNetworks\nMay 9, 2016\n24 / 36\n\nPairwise Stability\nDefinition 3 (Pairwise stability)\nA network g is pairwise stable with respect to u if\n(i) for all ij ∈g, ui(g, v) ≥ui(g -ij, v) (and uj(g, v) ≥uj(g -ij, v));\n(ii) for all ij < g, if ui(g, v) < ui(g + ij, v) then uj(g, v) > uj(g + ij, v).\nPart (i): no player wants to delete a link unilaterally\nPart (ii): no pair of unlinked players finds it mutually beneficial to form a\nnew link. This accounts for the communication and coordination that are\nimportant in the formation of relationships in networks. . . not captured by\nstandard non-cooperative solution concepts.\nMihai Manea (MIT)\nNetworks\nMay 9, 2016\n25 / 36\n\nHow \"Stable\" Are Pairwise Stable Networks?\nPairwise stability is a necessary, but not sufficient, condition for a network\nto be stable over time.\n▶deviations by only one or two players\n▶changing a single link at a time\n▶myopic incentives; no foresight, no dynamics\nMihai Manea (MIT)\nNetworks\nMay 9, 2016\n26 / 36\n\nFirst Application\nA Distance Based Utility Model (Bloch and Jackson 2007)\nPlayers obtain utility from direct connections but also from indirect ones,\nand utility deteriorates with distance.\nThe payoff of player i in network g is\nui(g) =\nX\nj,i\nb (dij(g)) -ni(g)c\n▶dij(g) is the distance between players i and j in g (dij(g) = infif i and j\nare not connected by any path)\n▶b(k): benefit a player receives from a node k links away; b(inf) = 0; b\ns. decreasing\n▶ni(g): player i's number of neighbors in g\n▶c: cost of a link\nMihai Manea (MIT)\nNetworks\nMay 9, 2016\n27 / 36\n\nEfficiency vs. Stability in the Connections Model\nProposition 1\nSuppose that b(1) -b(2) < c < b(1) + (n/2 -1)b(2). Then the only\nefficient networks are stars encompassing all nodes. However, if b(1) < c\nthen stars are not pairwise stable.\nConsider a connected component of an efficient network. Suppose it has\nk players and m ≥k -1 links.\nThe value of direct connections due to m links is 2m (b(1) -c). This\nleaves k(k -1)/2 -m pairs of players with a distance ≥2. The value of\neach indirect connection ≤b(2). Total welfare at most\n2m (b(1) -c)+(k(k -1) -2m) b(2) = 2m (b(1) -c -b(2))+k(k-1)b(2)\nSince b(1) -c -b(2) < 0, if m ≥k -1 the expression above is maximized\nfor m = k -1. All bounds are binding iff the component is a star.\nMihai Manea (MIT)\nNetworks\nMay 9, 2016\n28 / 36\n\nContinuation of the Proof\nIf two stars, with k1 ≥1 and k2 ≥2 nodes, respectively, each lead to\nnon-negative welfare, then a single star with k1 + k2 nodes leads to higher\nwelfare.\nThen stars among all n players are the only efficient networks iff they\ngenerate positive payoffs, i.e.,\n(n -1) (2(b(1) -c) + (n -2)b(2)) > 0,\nwhich follows from our hypothesis.\nIf b(1) < c, stars are not stable because the center player would gain\nc -b(1) from deleting a link.\nMihai Manea (MIT)\nNetworks\nMay 9, 2016\n29 / 36\n\nDiscussion\n▶Efficient network formation is difficult to achieve in general.\n▶Forming a link creates a positive externality on others because it\nreduces the distance between other players.\n▶The externality is not internalized in a model with self-interested\nplayers. Stable networks have too few links.\nMihai Manea (MIT)\nNetworks\nMay 9, 2016\n30 / 36\n\nSecond Application\nA Coauthor Model\n▶Each player is a researcher who spends time writing papers.\n▶Two players linked in g work together on a project.\n▶The amount of time researcher i spends on a given project is\ninversely related to the number of projects ni(g) he is involved in.\n▶Player i's payoff is\nui(g) =\nX\n{j|ij∈g}\n\nni(g) +\nnj(g) +\nni(g)nj(g)\n!\n,\nfor ni(g) > 0 and ui(g) = 1 if ni(g) = 0.\nThe output of a project undertaken by i and j depends on the total time\n1/ni(g) + 1/nj(g) invested by the two collaborators and some synergy in\nthe production process, 1/(ni(g)nj(g)).\nLinks have negative externalities--each researcher prefers that his\ncoauthors have fewer links. Costs of forming links are implicit in diluted\nsynergies when efforts are spread among more projects.\nMihai Manea (MIT)\nNetworks\nMay 9, 2016\n31 / 36\n\nEfficiency vs. Stability in Coauthor Networks\nProposition 2\nIf n is even, then the efficient network consists of n/2 separate pairs.\nAny pairwise stable network can be partitioned into cliques. If m ≥m′\nare the cardinalities of two distinct cliques, then m > m′2.\nIt is sufficient to consider the case ni(g) > 0, ∀i ∈N. Total welfare satisfies\nX\ni∈N\nX\n{j|ij∈g}\n\nni(g) +\nnj(g) +\nni(g)nj(g)\n!\n=\n2n +\nX\ni∈N\nni(g)\nX\n{j|ij∈g}\nnj(g)\n≤\n2n +\nX\ni∈N\nni(g)ni(g)\n=\n3n,\nwith equalities iff g consists of n/2 disjoint links.\nMihai Manea (MIT)\nNetworks\nMay 9, 2016\n32 / 36\n\nProof of Part (2)\nSuppose g is pairwise stable and ij < g. Then i benefits form a link with j if\nnj(g) + 1\n\n+ ni(g) + 1\n!\n>\n\nni(g) -\nni(g) + 1\n! X\nh,ih∈g\nnh(g) ⇐⇒\nni(g) + 2\nnj(g) + 1\n>\nni(g)\nX\n{h|ih∈g}\nnh(g).\nSimilarly, if ik ∈g, i has incentives to maintain the link to k if\nni(g) + 1\nnk(g)\n≥\nni(g) -1\nX\n{h|h,k,ih∈g}\nnh(g).\n▶If k maximizes nk(g) and nj(g) ≤nk(g), then i would benefit from a\nlink to j.\n▶Since each of k's nk(g) neighbors are willing to coauthor with k, they\nalso want to coauthor with one another (their degrees do not exceed\nnk(g)). Then each of k's neighbors has nk(g) coauthors. . . clique.\nMihai Manea (MIT)\nNetworks\nMay 9, 2016\n33 / 36\n\nComparisons between the Two Models\nConnections and coauthorship models\n▶different strategic settings; simple structures of efficient networks\n▶pairwise stable networks tend to be inefficient due to externalities\n▶different sources of externalities\n▶connections model: when stars are efficient, the center may not have\nincentives to maintain links with solitary players; however, such links\nbring valuable indirect connections to other players; the indirect value is\nnot reflected in the payoffs of the center\n▶coauthor model: by forming additional connections, a player dilutes the\nvalue of his existing partnerships; the inefficiency stems from the fact\neach player sees more benefit from adding a link than the loss in value\nfor other links, while existing partners see only harm\n▶in either model, social and private incentives are not aligned\nMihai Manea (MIT)\nNetworks\nMay 9, 2016\n34 / 36\n\nGeneral Tension between Efficiency and Stability\nDefinition 4\nThe allocation rule u satisfies equal treatment of equals if\nui(g, v) = uj(g, v) for all i and j that share the same set of neighbors\noutside {i, j}.\nTheorem 1\nIf n ≥3, there exists no component balanced allocation rule u that satisfies\nequal treatment of equals s.t. for every value function v under which\nsingleton components generate the same value, at least one efficient\nnetwork is pairwise stable.\n[Example of component balanced u satisfying equal treatment of equals\nui(g, v) =\nv(h)\nnumber of nodes in h\nif i belongs to the connected component h of g.]\nMihai Manea (MIT)\nNetworks\nMay 9, 2016\n35 / 36\n\nProof\nIt is sufficient to consider the case n = 3. Suppose v(g) takes the values\n0, 1, 1 + ε and 1 depending on whether g has 0, 1, 2 or 3 links, resp.\nEfficient networks have two links. Suppose the network {12, 23} is stable.\nSince u is component balanced, u3({12}, v) = u3(∅, v) = v(∅) = 0. By\nequal treatment of equals,\nu3(∅, v) = u1(∅, v) = u2(∅, v) = 0\nu1({12}, v) = u2({12}, v) = 1/2\nu1({12, 23, 13}, v) = u2({12, 23, 13}, v) = u3({12, 23, 13}, v) = 1/3.\nPairwise stability of {12, 23} implies that player 2 does not want to delete a\nlink, u2({12, 23}, v) ≥u2({12}, v) = 1/2. Equal treatment of equals leads to\nu1({12, 23}, v) = u3({12, 23}, v) ≤1/4 + ε/2.\nContradiction with the stability of {12, 23} when ε < 1/6, since 1 and 3\nhave incentives to form a link,\nu1({12, 23, 13}, v) = u3({12, 23, 13}, v) = 1/3 > 1/4 + ε/2.\nMihai Manea (MIT)\nNetworks\nMay 9, 2016\n36 / 36\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n14.16 Strategy and Information\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "MIT 14.16 S16 Single-Deviation Principle and Bargaining Lecture Slides",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-16-strategy-and-information-spring-2016/bdbe3b6feffbd40a529dce1e1b73d81c_MIT14_16S16_single.pdf",
      "content": "Single-Deviation Principle and Bargaining\nMihai Manea\nMIT\n\nMulti-stage games with observable actions\n▶finite set of players N\n▶stages t = 0, 1, 2, . . .\n▶H: set of terminal histories (sequences of action profiles of possibly\ndifferent lengths)\n▶at stage t, after having observed a non-terminal history of play\nh\nt 1\nt = (a , . . . , a -) < H, each player i simultaneously chooses an\naction at\ni ∈Ai(ht)\n▶ui(h): payoff of i ∈N for terminal history h ∈H\n▶σi: behavior strategy for i ∈N specifies σi(h) ∈∆(Ai(h)) for h < H\nOften natural to identify \"stages\" with time periods.\nExamples\n▶repeated games\n▶alternating bargaining game\nMihai Manea (MIT)\nSingle-Deviation Principle and Bargaining\nMarch 9, 2016\n2 / 23\n\nUnimprovable Strategies\nTo verify that a strategy profile σ constitutes a subgame perfect equilibrium\n(SPE) in a multi-stage game with observed actions, it suffices to check\nwhether there are any histories ht where some player i can gain by\ndeviating from playing σi(ht) at t and conforming to σi elsewhere.\nui(σ|ht): expected payoff of player i in the subgame starting at ht and\nplayed according to σ thereafter\nDefinition 1\nA strategy σi is unimprovable given σ-i if ui(σi, σ-i| ht) ≥ui(σ′, σ\ni\nh\nfor\n-i|\nt)\nevery ht and σ′\ni with σ′\ni(h) = σi(h) for all h , ht.\nMihai Manea (MIT)\nSingle-Deviation Principle and Bargaining\nMarch 9, 2016\n3 / 23\n\nContinuity at Infinity\nIf σ is an SPE then σi is unimprovable given σ-i. For the converse. . .\nDefinition 2\nA game is continuous at infinity if\nlim\nt→inf\nsup\n{(h, h)|ht= ht}\n|ui(h) -ui( h)| = 0, ∀i ∈N.\nEvents in the distant future are relatively unimportant.\nMihai Manea (MIT)\nSingle-Deviation Principle and Bargaining\nMarch 9, 2016\n4 / 23\n\nSingle (or One-Shot) Deviation Principle\nTheorem 1\nConsider a multi-stage game with observed actions that is continuous at\ninfinity. If σi is unimprovable given σ-i for all i ∈N, then σ constitutes an\nSPE.\nProof allows for infinite action spaces at some stages. There exist versions\nfor games with unobserved actions.\nMihai Manea (MIT)\nSingle-Deviation Principle and Bargaining\nMarch 9, 2016\n5 / 23\n\nProof\nSuppose that σi is unimprovable given σ-i, but σi is not a best response\nto\nσ\nbe\n-i following some history ht. Let σi\na strictly better response and\ndefine\nε = ui(σ , σ\ni\n-i|ht) -ui(σi, σ-i|ht) > 0.\nSince the game is continuous at infinity, there exists t′ > t and\nσi s.t.\nσi is\nidentical to\n1 at all information sets up to (and including) stage t′,\nσ\nσ\ni\ni\ncoincides with σi across all longer histories and\n|u\ni(σ , σ-i|ht)\n,\ni\n-ui(σ\nσ\ni\n-i|ht)| < ε/2.\nThen\nu\ni(σ , σ\ni\n-i|ht) > ui(σi, σ-i|ht).\nMihai Manea (MIT)\nSingle-Deviation Principle and Bargaining\nMarch 9, 2016\n6 / 23\n\nProof\nσi : strategy obtained from\nσi by replacing the stage t′ actions following\nany history ht′ with the corresponding actions under σi\nConditional on any ht′, σi and\nσi coincide, hence\nu\ni(σ , σ\nσ\ni\nh\n-i| t′) = ui(σi,\n-i|ht′).\nAs σi is unimprovable given σ-i, and conditional on ht′ the subsequent\nplay in strategies σi and\nσi differs only at stage t′,\nui(σi, σ-i|ht′) ≥u\ni(σ , σ\ni\n-i|ht′).\nThen\nu\ni(σ , σ\ni\n-i|ht′) ≥u\ni(σ , σ\ni\n-i|ht′)\nfor all histories ht′. Since\nσi and\nσi coincide before reaching stage t′,\nu\ni(σ , σ\ni\n-i|ht) ≥u\ni(σ , σ\ni\n-i|ht).\nMihai Manea (MIT)\nSingle-Deviation Principle and Bargaining\nMarch 9, 2016\n7 / 23\n\nProof\nσ4\ni : strategy obtained from σ3\ni by replacing the stage t′ -1 actions\nfollowing any history ht′-1 with the corresponding actions under σi\nSimilarly,\nui(σ4\ni , σ-i|ht) ≥ui(σ3\ni , σ-i|ht) . . .\nThe final strategy σt′-t+3\ni\nis identical to σi conditional on ht and\nui(σi, σ-i|ht) = ui(σt′-t+3\ni\n, σ-i|ht) ≥. . .\n≥ui(σ3\ni , σ-i|ht) ≥ui(σ2\ni , σ-i|ht) > ui(σi, σ-i|ht),\na contradiction.\nMihai Manea (MIT)\nSingle-Deviation Principle and Bargaining\nMarch 9, 2016\n8 / 23\n\nApplications\nApply the single deviation principle to repeated prisoners' dilemma to\nimplement the following equilibrium paths for high discount factors:\n▶(C, C), (C, C), . . .\n▶(C, C), (C, C), (D, D), (C, C), (C, C), (D, D), . . .\n▶(C, D), (D, C), (C, D), (D, C) . . .\nC\nD\nC\n1, 1\n-1, 2\nD\n2, -1\n0, 0\nCooperation is possible in repeated play.\nMihai Manea (MIT)\nSingle-Deviation Principle and Bargaining\nMarch 9, 2016\n9 / 23\n\nBargaining with Alternating Offers\nRubinstein (1982)\n▶players i = 1, 2; j = 3 -i\n▶set of feasible utility pairs\nU = {(u1, u2) ∈[0, inf2) |u2 ≤g2(u1)}\n▶g2 s. decreasing, concave (and hence continuous), g2(0) > 0\n▶δi: discount factor of player i\n▶at every time t = 0, 1, . . ., player i(t) proposes an alternative\nu = (u1, u2) ∈U to player j(t) = 3 -i(t)\n1 for\nt even\ni(t) =\n\n2 for\nt odd\n▶if j(t) accepts the offer, game ends yielding payoffs (δt\n1u1, δt\n2u2)\n▶otherwise, game proceeds to period t + 1\nMihai Manea (MIT)\nSingle-Deviation Principle and Bargaining\nMarch 9, 2016\n10 / 23\n\nStationary SPE\nDefine g1 = g-1\n2 . Graphs of g2 and g-1\n1 : Pareto-frontier of U\nLet (m1, m2) be the unique solution to the following system of equations\nm1\n=\nδ1g1 (m2)\nm2\n=\nδ2g2 (m1) .\n(m1, m2) is the intersection of the graphs of δ2g2 and (δ1g1)-1.\nSPE in \"stationary\" strategies: in any period where player i has to make an\noffer to j, he offers u with uj = mj and ui = gi(mj), and j accepts only offers\nu with uj ≥mj.\nSingle-deviation principle: constructed strategies form an SPE.\nIs the SPE unique?\nMihai Manea (MIT)\nSingle-Deviation Principle and Bargaining\nMarch 9, 2016\n11 / 23\n\nIterated Conditional Dominance\nDefinition 3\nIn a multi-stage game with observable actions, an action ai is conditionally\ndominated at stage t given history ht if, in the subgame starting at ht,\nevery strategy for player i that assigns positive probability to ai is strictly\ndominated.\nProposition 1\nIn any multi-stage game with observable actions, every SPE survives the\niterated elimination of conditionally dominated strategies.\nMihai Manea (MIT)\nSingle-Deviation Principle and Bargaining\nMarch 9, 2016\n12 / 23\n\nEquilibrium uniqueness\nIterated conditional dominance: stationary equilibrium is essentially the\nunique SPE.\nTheorem 2\nThe SPE of the alternating-offer bargaining game is unique, except for the\ndecision to accept or reject Pareto-inefficient offers.\nMihai Manea (MIT)\nSingle-Deviation Principle and Bargaining\nMarch 9, 2016\n13 / 23\n\nProof\n▶Following a disagreement at date t, player i cannot obtain a period t\nexpected payoff greater than\nM0 = δ\ni\ni max ui = δigi(0)\nu∈U\n▶Rejecting an offer u with u\ni > Mi is conditionally dominated by\naccepting such an offer for i.\n▶Once we eliminate dominated actions, i accepts all offers u with\nui > M0\ni from j.\n▶Making any offer u with ui > M0\ni is dominated for j by an offer\nu = λu + (1 -λ) M0,\ni gj M0\ni\nfor λ ∈(0, 1) (both offers are accepted\nimmediately).\nMihai Manea (MIT)\nSingle-Deviation Principle and Bargaining\nMarch 9, 2016\n14 / 23\n\nProof\nUnder the surviving strategies\n▶j can reject an offer from i and make a counteroff\n\ner next period that\nleaves him with slightly less than gj M0\ni , which i accepts; it is\nconditionally dominated for j to accept any offer smaller than\nm1 = δ\nj\njg\nj\n▶\n\nMi\ni cannot expect to receive a continuation pa\n\nyoff greater than\nM1\nmax\n\ng m1\n=\nδ\ni\ni\ni\n, δ\n= δ\nj\ni Mi\nigi m1\nj\nafter rejecting an offer from j\n\nδigi\n\nm1\nj\n\n= δigi\n\nδjgj\n\nM0\ni\n\n≥δig\ni\n\ngj\n\nMi\n\n= δiMi ≥δi Mi\nMihai Manea (MIT)\nSingle-Deviation Principle and Bargaining\nMarch 9, 2016\n15 / 23\n\nProof\nRecursively define\nmk+1\nj\n=\nδjgj\n\nMk\ni\n\nMk+1\ni\n=\nδigi\n\nmk+1\nj\n\nfor i = 1, 2 and k ≥1. (mk\ni )k≥0 is increasing and (Mk\ni )k≥0 is decreasing.\nProve by induction on k that, under any strategy that survives iterated\nconditional dominance, player i = 1, 2\n▶never accepts offers with ui < mk\ni\n▶always accepts offers with ui > Mk\ni , but making such offers is\ndominated for j.\nMihai Manea (MIT)\nSingle-Deviation Principle and Bargaining\nMarch 9, 2016\n16 / 23\n\nProof\n▶The sequences (mk\ni ) and (Mk\ni ) are monotonic and bounded, so they\nneed to converge. The limits satisfy\nminf\nj\n=\nδjgj\n\nδigi\n\nminf\nj\n\nMinf\ni\n=\nδigi\n\nminf\nj\n\n.\n▶(minf\n1 , minf\n2 ) is the (unique) intersection point of the graphs of the\nfunctions δ2g2 and (δ1g1)-1\n▶Minf\ni\n= δigi\n\nminf\nj\n\n= minf\ni\n▶All strategies of i that survive iterated conditional dominance accept u\nwith ui > Minf\ni\n= minf\ni\nand reject u with ui < minf\ni\n= Minf\ni .\nMihai Manea (MIT)\nSingle-Deviation Principle and Bargaining\nMarch 9, 2016\n17 / 23\n\nProof\nIn an SPE\n▶at any history where i is the proposer, i's payoff is at least gi(mj\ninf):\noffer u arbitrarily close to (gi(mj\ninf), m )\nj\ninf, which j accepts under the\nstrategies surviving the elimination process\n▶i cannot get more than gi(mj\ninf)\n▶any offer made by i specifying a payoff greater than gi(mj\ninf) for himself\nwould leave j with less than mj\ninf; such offers are rejected by j under the\nsurviving strategies\n▶under the surviving strategies, j never offers i more than\nMi\ninf= δigi(mj\ninf) ≤gi(mj\ninf)\n▶hence i's payoff at any history where i is the proposer is exactly\ngi(mj\ninf); possible only if i offers (gi(mj\ninf), mj\ninf) and j accepts with\nprobability 1\nUniquely pinned down actions at every history, except those where j has\njust received an offer (ui, minf)\n<\nj\nfor some ui\ngi(mj\ninf). . .\nMihai Manea (MIT)\nSingle-Deviation Principle and Bargaining\nMarch 9, 2016\n18 / 23\n\nProperties of the equilibrium\n▶The SPE is efficient--agreement is obtained in the first period,\nwithout delay.\n▶SPE payoffs: (g1(m2), m2), where (m1, m2) solve\nm1\n=\nδ1g1 (m2)\nm2\n=\nδ2g2 (m1) .\n▶Patient players get higher payoffs: the payoff of player i is increasing\nin δi and decreasing in δj.\n▶For a fixed δ1 ∈(0, 1), the payoff of player 2 converges to 0 as δ2 →0\nand to maxu∈U u2 as δ2 →1.\n▶If U is symmetric and δ1 = δ2, player 1 enjoys a first mover\nadvantage: m1 = m2 and g1(m2) = m2/δ > m2.\nMihai Manea (MIT)\nSingle-Deviation Principle and Bargaining\nMarch 9, 2016\n19 / 23\n\nNash Bargaining\nAssume g2 is decreasing, s. concave and continuously differentiable.\nNash (1950) bargaining solution:\n{u∗} = arg max u1u2 = arg max u1g2(u1).\nu∈U\nu∈U\nTheorem 3 (Binmore, Rubinstein and Wolinsky 1985)\nSuppose that δ1 = δ2 =: δ in the alternating bargaining model. Then the\nunique SPE payoffs converge to the Nash bargaining solution as δ →1.\nm1g2 (m1) = m2g1 (m2)\n(m1, g2 (m1)) and (g1 (m2) , m2) belong to the intersection of g2's graph\nwith the same hyperbola, which approaches the hyperbola tangent to the\nboundary of U (at u∗) as δ →1.\nMihai Manea (MIT)\nSingle-Deviation Principle and Bargaining\nMarch 9, 2016\n20 / 23\n\nBargaining with random selection of proposer\n▶Two players need to divide $1.\n▶Every period t = 0, 1, . . . player 1 is chosen with probability p to make\nan offer to player 2.\n▶Player 2 accepts or rejects 1's proposal.\n▶Roles are interchanged with probability 1 -p.\n▶In case of disagreement the game proceeds to the next period.\n▶The game ends as soon as an offer is accepted.\n▶Player i = 1, 2 has discount factor δi.\nMihai Manea (MIT)\nSingle-Deviation Principle and Bargaining\nMarch 9, 2016\n21 / 23\n\nEquilibrium\n▶The unique equilibrium is stationary, i.e., each player i has the same\nexpected payoff vi in every subgame.\n▶Payoffs solve\nv1\n=\np(1 -δ2v2) + (1 -p)δ1v1\nv2\n=\npδ2v2 + (1 -p)(1 -δ1v1).\n▶The solution is\nv1\n=\np/(1 -δ1)\np/(1 -δ1) + (1 -p)/(1 -δ2)\nv2\n=\n(1 -p)/(1 -δ2)\np/(1 -δ1) + (1 -p)/(1 -δ2).\nMihai Manea (MIT)\nSingle-Deviation Principle and Bargaining\nMarch 9, 2016\n22 / 23\n\nComparative Statics\nv1\n=\n1 + (1-p)(1-δ1)\np(1-δ2)\nv2\n=\n1 +\np(1-δ2)\n.\n(1-p)(1-δ1)\n▶Immediate agreement\n▶First mover advantage\n▶v1 increases with p, v2 decreases with p.\n▶For δ1 = δ2, we obtain v1 = p, v2 = 1 -p.\n▶Patience pays off\n▶vi increases with δi and decreases with δj (j = 3\n▶\n-i).\nFix δj and take δi →1, we get vi →1 and vj →0.\nMihai Manea (MIT)\nSingle-Deviation Principle and Bargaining\nMarch 9, 2016\n23 / 23\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n14.16 Strategy and Information\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "MIT 14.16 S16 Strategy and Information Lecture Slides",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-16-strategy-and-information-spring-2016/3dd986ad07f77b3bb377485644378d68_MIT14_16S16_strategy.pdf",
      "content": "Strategy & Information\nMihai Manea\nMIT\n\nWhat is Game Theory?\nGame Theory is the formal study of strategic interaction.\nIn a strategic setting the actions of several agents are interdependent.\nEach agent's outcome depends not only on his actions, but also on the\nactions of other agents. How to predict opponents' play and respond\noptimally?\nEverything is a game. . .\n▶poker, chess, soccer, driving, dating, stock market\n▶advertising, setting prices, entering new markets, building a reputation\n▶bargaining, partnerships, job market search and screening\n▶designing contracts, auctions, insurance, environmental regulations\n▶international relations, trade agreements, electoral campaigns\nMost modern economic research includes game theoretical elements.\nEleven game theorists have won the economics Nobel Prize so far.\nMihai Manea (MIT)\nStrategy & Information\nFebruary 10, 2016\n2 / 57\n\nBrief History\n▶Cournot (1838): quantity setting duopoly\n▶Zermelo (1913): backward induction\n▶von Neumann (1928), Borel (1938), von Neumann and Morgenstern\n(1944): zero-sum games\n▶Flood and Dresher (1950): experiments\n▶Nash (1950): equilibrium\n▶Selten (1965): dynamic games\n▶Harsanyi (1967): incomplete information\n▶Akerlof (1970), Spence (1973): first applications\n▶1980s boom, continuing nowadays: repeated games, bargaining,\nreputation, equilibrium refinements, industrial organization, contract\ntheory, mechanism/market design\n▶1990s: parallel development of behavioral economics\n▶more recently: applications to computer science, political science,\npsychology, evolutionary biology\nMihai Manea (MIT)\nStrategy & Information\nFebruary 10, 2016\n3 / 57\n\nKey Elements of a Game\n▶Players: Who is interacting?\n▶Strategies: What are the options of each player? In what order do\nplayers act?\n▶Payoffs: How do strategies translate into outcomes? What are\nplayers' preferences over possible outcomes?\n▶Information/Beliefs: What do players know/believe about the\nsituation and about one another? What actions do they observe\nbefore making decisions?\n▶Rationality: How do players think?\nMihai Manea (MIT)\nStrategy & Information\nFebruary 10, 2016\n4 / 57\n\nNormal-Form Games\nA normal (or strategic) form game is a triplet (N, S, u) with the following\nproperties:\n▶N = {1, 2, . . . , n}: finite set of players\n▶Si ∋si: set of pure strategies of player i\n▶S = S1 × · · · × Sn ∋s = (s1, . . . , sn): set of pure strategy profiles\n▶S i = Q\nj,i Sj ∋s i: pure strategy profiles of i's opponents\n-\n-\n▶ui : S →R: payoff function of player i; u = (u1, . . . , un).\nOutcomes are interdependent. Player i ∈N receives payoff ui(s1, . . . , sn)\nwhen s = (s1, . . . , sn) ∈S is played.\nThe structure of the game is common knoweldge: all players know\n(N, S, u), and know that their opponents know it, and know that their\nopponents know that everyone knows, and so on.\nThe game is finite if S is finite.\nMihai Manea (MIT)\nStrategy & Information\nFebruary 10, 2016\n5 / 57\n\nRock-Paper-Scissors\nR\nP\nS\nR\n0, 0\n-1, 1\n1, -1\nP\n1, -1\n0, 0\n-1, 1\nS\n-1, 1\n1, -1\n0, 0\nMihai Manea (MIT)\nStrategy & Information\nFebruary 10, 2016\n6 / 57\n\nMixed and Correlated Strategies\n▶∆(X): set of probability measures (or distributions) over the\nmeasurable space X (usually, X is either finite or a subset of a\nEuclidean space)\n▶∆(Si) ∋σi: mixed strategies of player i\n▶σ ∈∆(S1) × · · · × ∆(Sn): mixed strategy profile, specifies a mixed\nstrategy for each player\n▶∆(S) ∋σ: correlated strategy profiles\n▶σ i ∈∆(S i): correlated belief for player i\nPla\nQ\n-\n-\n▶\nj,i ∆(Sj): set of independent beliefs for i\nyer i has von Neumann-Morgenstern preferences--expected\nutility--over ∆(S), i.e., ui extends to ∆(S) as follows:\nui(σ) =\nX\nσ(s)ui(s).\ns∈S\nMihai Manea (MIT)\nStrategy & Information\nFebruary 10, 2016\n7 / 57\n\nDominated Strategies\nAre there obvious predictions about how a game should be played?\nMihai Manea (MIT)\nStrategy & Information\nFebruary 10, 2016\n8 / 57\n\nAdvertising War: Coke vs. Pepsi\n▶Without any advertising, each company earns $5b/year from Cola\nconsumers.\n▶Each company can choose to spend $2b/year on advertising.\n▶Advertising does not increase total sales for Cola, but if one company\nadvertises while the other does not, it captures $3b from the\ncompetitor.\nPepsi\nNo Ad\nAd\nCoke No Ad\n$5b, $5b\n$2b, $6b\nAd\n$6b, $2b\n$3b, $3b∗\n▶What will the Cola companies do?\n▶Is there a better feasible outcome?\nMihai Manea (MIT)\nStrategy & Information\nFebruary 10, 2016\n9 / 57\n\nPrisoners' Dilemma (PD)\nFlood and Dresher (1950): RAND corporation's investigations into game\ntheory for possible applications to global nuclear strategy\n▶Two persons are arrested for a crime.\n▶There is not enough evidence to convict either.\n▶Different cells, no communication.\n▶If a suspect testifies against the other (\"Defect\") and the other does not\n(\"Cooperate\"), the former is released and the latter gets a harsh\npunishment.\n▶If both prisoners testify, they share the punishment.\n▶If neither testifies, both serve time for a smaller offense.\nC\nD\nC\n2, 2\n0, 3\nD\n3, 0\n1, 1∗\n▶Each prisoner is better off defecting regardless of what the other\ndoes. We say D strictly dominates C for each prisoner.\n▶The resulting outcome is (D, D), which is worse than (C, C).\nMihai Manea (MIT)\nStrategy & Information\nFebruary 10, 2016\n10 / 57\n\nModified Prisoners' Dilemma\nConsider the game obtained from the prisoners' dilemma by changing\nplayer 1's payoff for (C, D) from 0 to 2.\nC\nD\nC\n2, 2\n2, 3∗\nD\n3, 0\n1, 1\n▶No matter what player 1 does, player 2 still prefers D to C.\n▶If player 1 knows that 2 never plays C, then he prefers C to D.\n▶Unlike in the prisoners' dilemma example, we use an additional\nassumption to reach our prediction in this case: player 1 needs to\ndeduce that player 2 never plays a dominated strategy.\nMihai Manea (MIT)\nStrategy & Information\nFebruary 10, 2016\n11 / 57\n\nStrictly Dominated Strategies\nDefinition 1\nA strategy si ∈Si is strictly (s.) dominated by σi ∈∆(Si) if\nui(σi, s-i) > ui(si, s-i), ∀s-i ∈S-i.\nMihai Manea (MIT)\nStrategy & Information\nFebruary 10, 2016\n12 / 57\n\nPure Strategies May Be Dominated by Mixed Strategies\nL\nR\nT\n3, x\n0, x\nM\n0, x\n3, x\nB\n1, x\n1, x\nFigure: B is s. dominated by 1/2T + 1/2M.\nMihai Manea (MIT)\nStrategy & Information\nFebruary 10, 2016\n13 / 57\n\nThe Beauty Contest\n▶Players: everyone in the class\n▶Strategy space: any number in {1, 2, . . . , 100}\n▶The person whose number is closest to 2/3 of the class average wins\nthe game.\n▶Payoffs: one randomly selected winner receives $1.\nWhy is this game called a beauty contest?\nMihai Manea (MIT)\nStrategy & Information\nFebruary 10, 2016\n14 / 57\n\nKeynesian Beauty Contest\nKeynes described the action of rational actors in a market using an\nanalogy based on a newspaper contest. Entrants are asked to choose a\nset of 6 faces from photographs that they find \"most beautiful.\" Those who\npicked the most popular face are eligible for a prize.\nA naive strategy would be to choose the 6 faces that, in the opinion of the\nentrant, are most beautiful. A more sophisticated contest entrant, wishing\nto maximize the chances of winning against naive opponents, would guess\nwhich faces the majority finds attractive, and then make a selection based\non this inference.\nThis can be carried one step further to account for the fact that other\nentrants would each have their own opinions of what public perceptions of\nbeauty are. What does everyone believe about what everyone else\nbelieves about whom others find attractive?\nMihai Manea (MIT)\nStrategy & Information\nFebruary 10, 2016\n15 / 57\n\nThe Beauty Contest and the Stock Market\nIt is not a case of choosing those faces that, to the best of one's\njudgment, are really the prettiest, nor even those that average\nopinion genuinely thinks the prettiest. We have reached the third\ndegree where we devote our intelligences to anticipating what\naverage opinion expects the average opinion to be. And there\nare some, I believe, who practice the fourth, fifth and higher\ndegrees. (John Maynard Keynes, General Theory of\nEmployment, Interest and Money, 1936)\nKeynes suggested that similar behavior is observed in the stock market.\nShares are not priced based on what people think their fundamental value\nis, but rather on what they think everyone else thinks the value is and what\nthey think about these beliefs, and so on.\nMihai Manea (MIT)\nStrategy & Information\nFebruary 10, 2016\n16 / 57\n\nIterated Deletion of Strictly Dominated Strategies\nWe can iteratively eliminate dominated strategies, under the assumption\nthat \"I know that you know that other players know. . . that everyone knows\nthe payoffs and that no one would ever use a dominated strategy.\"\nDefinition 2\nFor all i ∈N, set S0\ni = Si and define Sk\ni recursively by\nSk\ni = {si ∈Sk-1\ni\n|∃σi ∈∆(Sk-1\ni\n), ui(σi, s-i) > ui(si, s-i), ∀s-i ∈Sk-1\n-i }.\nThe set of pure strategies of player i that survive iterated deletion of s.\ndominated strategies is Sinf\ni\n= ∩k≥0Sk\ni . The set of surviving mixed\nstrategies is\n{σi ∈∆(Sinf\ni )|∃σ′\ni ∈∆(Sinf\ni ), ui(σ′\ni, s-i) > ui(σi, s-i), ∀s-i ∈Sinf\n-i}.\nMihai Manea (MIT)\nStrategy & Information\nFebruary 10, 2016\n17 / 57\n\nRemarks\nIn a finite game, the elimination procedure ends in a finite number of steps,\nso Sinfis simply the set of strategies left at the final stage.\nIn an infinite game, if S is a compact metric space and u is continuous,\nthen one can use Cantor's theorem (a decreasing nested sequence of\nnon-empty compact sets has nonempty intersection) to show that Sinf, ∅.\nDefinition assumes that at each iteration all dominated strategies of every\nplayer are deleted simultaneously. In a finite game, the limit set Sinfdoes\nnot depend on the particular order in which deletion proceeds.\nOutcome does not change if we eliminate s. dominated mixed strategies at\nevery step. A strategy dominated against all pure strategies of the\nopponents iff it is dominated against all their mixed strategies. Eliminating\nmixed strategies for player i at any stage does not affect the set of s.\ndominated pure strategies for any j , i at the next stage.\nMihai Manea (MIT)\nStrategy & Information\nFebruary 10, 2016\n18 / 57\n\nDetour on Common Knowledge\n▶Is common knowledge a sensible assumption? What does the\ndefinition of S100\ni\nentail?\n▶Higher order beliefs, common knowledge of rationality. . .\n▶Why did the strategy of choosing 1 not win in the beauty contest?\nMihai Manea (MIT)\nStrategy & Information\nFebruary 10, 2016\n19 / 57\n\nThe Story of the Unfaithful Wives\n▶A village with 100 married couples and a high priest.\n▶The men had to pass a logic exam before being allowed to marry.\n▶It is common knowledge that the high priest is truthful.\n▶The men would gossip about adulterous relationships and each\nknows which of the other wives are unfaithful.\n▶No one would ever inform a husband about his cheating wife.\n▶The high priest knows that some wives are unfaithful and decides that\nsuch immorality should no longer be tolerated.\nMihai Manea (MIT)\nStrategy & Information\nFebruary 10, 2016\n20 / 57\n\nContinued Story\n▶The priest convenes all the men at the temple and publicly announces\nthat the integrity of the village has been compromised--there is at\nleast one cheating wife.\n▶He also points out that even though no one knows whether his wife is\nfaithful, each man has heard about the other unfaithful wives.\n▶He orders that every man certain of his wife's infidelity should shoot\nher at midnight.\n▶39 silent nights went by and. . . on the 40th shots were heard.\nHow many wives were shot? Were all the unfaithful wives murdered? How\ndid men learn of the infidelity of their wives after 39 nights in which nothing\nhappened?\nMihai Manea (MIT)\nStrategy & Information\nFebruary 10, 2016\n21 / 57\n\nRationalizability\n▶Solution concept introduced independently by Bernheim (1984) and\nPearce (1984).\n▶Like iterated dominance, rationalizability derives restrictions on play\nfrom common knowledge of payoffs and the fact that players are\n\"reasonable.\"\n▶Dominance: unreasonable to use a strategy that performs worse than\nanother (fixed) one in every scenario.\n▶Rationalizability: irrational for a player to choose a strategy that is not\na best response to some beliefs about opponents' strategies.\nMihai Manea (MIT)\nStrategy & Information\nFebruary 10, 2016\n22 / 57\n\nWhat is a \"Belief\"?\n▶Bernheim & Pearce: every player i's beliefs σ-i about the play of j , i\nmust be independent, i.e., σ-i ∈Q\nj,i ∆(Sj).\n▶Alternatively, allow player i to believe that the actions of opponents\nare correlated, i.e., any σ-i ∈∆(S-i) is a possibility.\n▶The two definitions have different implications for n ≥3.\nFocus on case with correlated beliefs. Such beliefs represent a player's\nuncertainty about his opponents' actions, not necessarily his theory about\ntheir deliberate randomization and coordination.\nPlayer i may place equal probability on two scenarios: either both j and k\npick action A or they both play B. If i is not sure which theory is true, then\nhis beliefs are correlated even though he knows that j and k are acting\nindependently.\nMihai Manea (MIT)\nStrategy & Information\nFebruary 10, 2016\n23 / 57\n\nBest Responses\nDefinition 3\nA strategy σi ∈Si is a best response to a belief σ-i ∈∆(S-i) if\nui(σi, σ-i) ≥ui(si, σ-i), ∀si ∈Si.\nMihai Manea (MIT)\nStrategy & Information\nFebruary 10, 2016\n24 / 57\n\nRationalizabile Strategies\nCommon knowledge of payoffs and rationality imposes restrictions on\nplay. . .\nDefinition 4\nSet S0 = S and let Sk be given recursively by\nSk\ni = {si ∈Sk-1\ni\n|∃σ-i ∈∆(Sk-1\n-i ), ui(si, σ-i) ≥ui(s′\ni , σ-i), ∀s′\ni ∈Sk-1\ni\n}.\nThe set of correlated rationalizable strategies for player i is Sinf\ni\n= T\nk≥0 Sk\ni .\nA mixed strategy σi ∈∆(Si) is rationalizable if there is a belief\nσ-i ∈∆(Sinf\n-i) s.t. ui(σi, σ-i) ≥ui(si, σ-i) for all si ∈Sinf\ni .\nThe definition of independent rationalizability replaces ∆(Sk-1\n-i ) and\n∆(Sinf\n-i) with Q\nj,i ∆(Sk-1\nj\n) and Q\nj,i ∆(Sinf\nj ), resp.\nMihai Manea (MIT)\nStrategy & Information\nFebruary 10, 2016\n25 / 57\n\nRationalizability in Cournot Duopoly\nTwo firms compete on the market for a divisible homogeneous good.\n▶Each firm i = 1, 2 has zero marginal cost and simultaneously decides\nto produce an amount of output qi ≥0.\n▶The resulting price is p = 1 -q1 -q2.\n▶Profit of firm i is qi(1 -q1 -q2).\nMihai Manea (MIT)\nStrategy & Information\nFebruary 10, 2016\n26 / 57\n\nRationalizability in Cournot Duopoly\nBest response of one firm if the other produces q is\nB(q) = max(0, (1 -q)/2) (j = 3 -i); B is decreasing. If q ⪋r then\nB(q) ⪌(1 -r)/2.\n▶Since q ≥q0 := 0, only strategies q ≤q1 := B(q0) = (1 -q0)/2 are\nbest responses, S1 = [\ni\nq0, q1].\n▶Then only q ≥q2 := B(q1\n) = (1 -q )/2 survives the second round of\nelimination, S2\n= [\n,\ni\nq\nq ]. . .\n▶We obtain a sequence\nq0 ≤q2 ≤\n2k\n2k\n. . . ≤q\n≤. . . ≤q\n+ ≤. . . ≤q ,\nwhere q2k\nk\nl\nk\n2k\n=\n2k\n/4 =\n/\n=\n(1 -1/4 ) 3 and q\n+ = (\n)\nl\n1 -q\n/2 s.t.\nS2k+1 = [\ni\nq2k,\nP\nq2k+1] and S2k\n= [q2k\nk 1\n,\n]\ni\nq\n-\nfor all k ≥0.\nlimk\nqk\n→inf\n= 1/3, so the only rationalizable strategy for firm i is qi = 1/3\n(the Nash equilibrium).\nWhat strategies are rationalizable with more than two firms?\nMihai Manea (MIT)\nStrategy & Information\nFebruary 10, 2016\n27 / 57\n\nNever Best Responses\nA strategy σi ∈∆(Si) is never a best response for player i if it is not a best\nresponse to any correlated belief σ-i ∈∆(S-i).\nRecall that σi ∈∆(Si) is s. dominated if ∃σ′\ni ∈∆(Si) s.t.\nui(σ′, s-i) >\n(\ni\nui σi, s-i), ∀s-i ∈S-i.\nTheorem 1\nIn a finite game, a strategy is never a best response iff it is s. dominated.\nCorollary 1\nCorrelated rationalizability and iterated strict dominance coincide.\nIf σi is s. dominated by σ′\ni , then σi is not a best response for any belief\nσ-i ∈∆(S-i): σ′\ni yields a higher payoff than σi for player i against any σ-i.\nLeft to prove that a strategy that is not s. dominated is a best response for\nsome beliefs.\nMihai Manea (MIT)\nStrategy & Information\nFebruary 10, 2016\n28 / 57\n\nProof\nSuppose σi is not s. dominated for player i.\n▶Define set of \"dominated payoffs\" for i by\nD = {x ∈RS-i|∃σi ∈∆(Si), x ≤ui(σi, ·)}.\nD is non-empty, closed, and convex.\n▶ui( σi, ·) does not belong to the interior of D because it is not s.\ndominated by any σi ∈∆(Si).\n▶By the supporting hyperplane theorem, ∃α ∈RS-i \\ {0} s.t.\nα · ui( σi, ·) ≥α · x, ∀x ∈D.\nIn particular, α · ui( σi, ·) ≥α · ui(σi, ·), ∀σi ∈∆(Si).\n▶Since D is not bounded from below, α has non-negative components.\n▶Normalize α so that its components sum to 1; α interpreted as a belief\nin ∆(S-i) with the property that\nui( σi, α) ≥ui(σi, α), ∀σi ∈∆(Si).\nThus σi is a best response to belief α.\nMihai Manea (MIT)\nStrategy & Information\nFebruary 10, 2016\n29 / 57\n\nIteration and Best Responses\nTheorem 2\nFor every k ≥0, each si ∈Sk\ni is a best response (within Si) to a belief in\n∆(Sk-1\n-i ).\nProof.\nFix si ∈Sk\ni ; si is a best response within Sk-1\ni\nto some σ-i ∈∆(Sk-1\n-i ). If si\nwere not a best response within Si to σ-i, let s′\ni be a best response.\nSince si is a best response within Sk-1\ni\nto σ-i and s′\ni is a better response\nthan si to σ-i, we need s′\ni < Sk-1\ni\n.\nThen s′\ni was deleted at an earlier stage, say s′\ni ∈Sl-1\ni\nbut s′\ni < Sl\ni for some\nl ≤k -1. This contradicts the fact that s′\ni is a best response in Si ⊇Sl-1\ni\nto\nσ-i ∈∆(Sk-1\n-i ) ⊆∆(Sl-1\n-i ).\n□\nCorollary 2\nIf the game is finite, then each si ∈Sinf\ni\nis a best response (within Si) to a\nbelief in ∆(Sinf\n-i).\nMihai Manea (MIT)\nStrategy & Information\nFebruary 10, 2016\n30 / 57\n\nClosed under Rational Behavior\nDefinition 5\nA set Z = Z1 × . . . × Zn with Zi ⊆Si for i ∈N is closed under rational\nbehavior if, for all i, every strategy in Zi is a best response to a belief in\n∆(Z-i).\nTheorem 3\nIf the game is finite (or if S is a compact metric space and u is continuous),\nthen Sinfis the largest set closed under rational behavior.\nProof.\nSinfis closed under rational behavior by Corollary 2. Suppose that there\nexists Z1 × . . . × Zn 1 Sinfthat is closed under rational behavior.\nConsider the smallest k for which there is an i such that Zi ⊆Sk\ni . It must\nbe that k ≥1 and Z-i ⊆Sk-1\n-i\n.\nBy assumption, every element of Zi is a best response to an element of\n∆(Z-i) ⊂∆(Sk-1\n-i ), contradicting Zi ⊆Sk\ni .\n□\nMihai Manea (MIT)\nStrategy & Information\nFebruary 10, 2016\n31 / 57\n\nNash Equilibrium\nMany games are not dominance solvable. Nevertheless, the involved\nparties find a solution.\nL\nR\nL\n1, 1\n0, 0\nR\n0, 0\n1, 1\nT\nS\nT\n3, 2\n1, 1\nS\n0, 0\n2, 3\nH\nT\nH\n1, -1\n-1, 1\nT\n-1, 1\n1, -1\nFigure: Coordination Game, Battle of the Sexes, Matching Pennies\nA Nash equilibrium is a strategy profile with the property that no player can\nbenefit by deviating from his corresponding strategy.\nDefinition 6 (Nash 1950)\nA mixed-strategy profile σ∗is a Nash equilibrium if for every i ∈N,\nui(σ∗\ni , σ∗\n-i) ≥ui(si, σ∗\n-i), ∀si ∈Si.\nMihai Manea (MIT)\nStrategy & Information\nFebruary 10, 2016\n32 / 57\n\nRemarks\n▶The fact that there is no profitable deviation in pure strategies implies\nthere is no profitable deviation in mixed strategies either.\n▶If in equilibrium a player uses a mixed strategy that places positive\nprobability on several pure strategies, he must be indifferent between\nall pure strategies in its support.\n▶Strategies that do not survive iterated strict dominance (or are not\nrationalizable) cannot be played with positive probability in a Nash\nequilibrium.\nMihai Manea (MIT)\nStrategy & Information\nFebruary 10, 2016\n33 / 57\n\nWhat Are the Assumptions?\n▶Nash equilibria are \"consistent\" predictions (or \"stable\" conventions)\nof how the game will be played.\n▶If all players expect that a specific Nash equilibrium will arise, then no\nplayer has incentives to play differently.\n▶Each player must have correct conjectures about the strategies of his\nopponents and play a best response to his conjecture.\n▶We interpret mixed strategies as beliefs regarding opponents' play,\nnot necessarily as deliberate randomization.\n▶Assumes knowledge of strategies (beliefs) and rationality.\nMihai Manea (MIT)\nStrategy & Information\nFebruary 10, 2016\n34 / 57\n\nDo Soccer Players Flip Coins?\nPenalty kicks\n▶Kicker's strategy space: {L,M,R}\n▶Goalie's strategy space: {L,M,R}\n▶What are the payoffs?\n▶What's the Nash equilibrium?\n▶Simultaneous move game? (125mph, 0.2 seconds reaction time)\n▶What do players do in reality?\nMihai Manea (MIT)\nStrategy & Information\nFebruary 10, 2016\n35 / 57\n\nPenalty Kicks\nChiappori, Levitt, and Groseclose (2002)\n▶459 kicks in French and Italian first leagues\n▶162 kickers, 88 goalies\nMihai Manea (MIT)\nStrategy & Information\nCourtesy of P.A. Chiapoori, S. Levitt, T. Groseclose, and the\nAmerican Economic Association. Used with permission.\nFebruary 10, 2016\n36 / 57\n\nTennis Service Game\nPlayer 1 chooses whether to serve to player 2's forehand, center or\nbackhand side, and player 2 chooses which side to favor for the return.\nUnique mixed strategy equilibrium, which puts positive probability only on\nstrategies C and B for either player.\nF\nC\nB\nF\n0, 5\n2, 3\n2, 3\nC\n2, 3\n0, 5\n3, 2\nB\n5, 0\n3, 2\n2, 3\n▶For player 1, playing C with probability ε and B with probability 1 -ε s.\ndominates F.\n▶If player 1 never chooses F, then C s. dominates F for player 2.\n▶In the remaining 2 × 2 game, there is a unique equilibrium, in which\nboth players place probability 1/4 on C and 3/4 on B.\nMihai Manea (MIT)\nStrategy & Information\nFebruary 10, 2016\n37 / 57\n\nStag Hunt\nEach player can choose to hunt hare by himself or hunt stag with the\nother. Stag offers a higher payoff, but only if players team up.\nS\nH\nS\n9, 9\n0, 8\nH\n8, 0\n7, 7\nThe game has two pure strategy Nash equilibria--(S, S) and (H, H)--and\na mixed strategy Nash equilibrium--(7/8S + 1/8H, 7/8S + 1/8H).\nMihai Manea (MIT)\nStrategy & Information\nFebruary 10, 2016\n38 / 57\n\nWhich Equilibrium is More Plausible?\n▶We may expect (S, S) to be played because it is Pareto dominant.\nHowever, if one player expects the other to hunt hare, he is much\nbetter off hunting hare himself; and the potential downside of\nchoosing stag is bigger than the upside--hare is the safer choice.\n▶Harsanyi and Selten (1988): H is the risk-dominant action--if each\nplayer expects the other to choose either action with probability 1/2,\nthen H has a higher expected payoff (7.5) than S (4.5).\n▶For a player to optimally choose stag, he should expect the other to\nplay stag with probability ≥7/8.\n▶Coordination problem may persist even if players communicate:\nregardless of what i intends to do, he would prefer j to play stag, so\nattempts to convince j to play stag are cheap talk.\nMihai Manea (MIT)\nStrategy & Information\nFebruary 10, 2016\n39 / 57\n\nEvolutionary Foundations\n▶Solution concepts motivated by presuming that players make\npredictions about their opponents' play by introspection and\ndeduction, using knowledge of their opponents' payoffs, rationality. . .\n▶Alternatively, assume players extrapolate from past observations of\nplay in \"similar\" games and best respond to expectations based on\npast observations.\n▶Cournot (1838) suggested that players take turns setting their outputs\nin the duopoly game, best responding to the opponent's last-period\naction.\n▶Simultaneous action updating, best responding to average play,\npopulations of players anonymously matched (another way to think\nabout mixed strategies), etc.\n▶If the process converges to a particular steady state, then the steady\nstate is a Nash equilibrium.\nMihai Manea (MIT)\nStrategy & Information\nFebruary 10, 2016\n40 / 57\n\nConvergence\nHow sensitive is the convergence to the initial state? If convergence\nobtains for all initial strategy profiles sufficiently close to the steady state,\nwe say that the steady state is asymptotically stable.\nMihai Manea (MIT)\nStrategy & Information\nFebruary 10, 2016\n41 / 57\nCourtesy of The MIT Press. Used with permission.\n\nShapley (1964) Cycling\nL\nM\nR\nU\n0, 0\n4, 5\n5, 4\nM\n5, 4\n0, 0,\n4, 5\nD\n4, 5\n5, 4\n0, 0\nMihai Manea (MIT)\nStrategy & Information\nFebruary 10, 2016\n42 / 57\n\nRemarks\n▶Evolutionary processes are myopic and do not offer a compelling\ndescription of behavior.\n▶Such processes do not provide good predictions for behavior in the\nactual repeated game, if players care about play in future periods and\nrealize that their current actions can affect opponents' future play.\nMihai Manea (MIT)\nStrategy & Information\nFebruary 10, 2016\n43 / 57\n\nExistence of Nash Equilibrium\nL\nR\nL\n1, 1\n0, 0\nR\n0, 0\n1, 1\nT\nF\nT\n3, 2\n1, 1\nF\n0, 0\n2, 3\nH\nT\nH\n1, -1\n-1, 1\nT\n-1, 1\n1, -1\nFigure: Coordination Game, Battle of the Sexes, Matching Pennies\n▶The coordination game and the battle of the sexes have multiple\nequilibria.\n▶Matching pennies does not have a pure strategy equilibrium. In the\nunique equilibrium, both players mix 50-50.\nTheorem 4 (Nash 1950)\nEvery finite game has an equilibrium (potentially in mixed strategies).\nMihai Manea (MIT)\nStrategy & Information\nFebruary 10, 2016\n44 / 57\n\nNash (1950)\nMihai Manea (MIT)\nStrategy & Information\nFebruary 10, 2016\n45 / 57\nRead John Nash, Jr.\"Equilibrium Points in N-Person Games.\"\nProceedings of the National Academy of Sciences of the\nUnited States of America 36 no. 1 (1949): 48-49.\n\nKakutani\nA long time ago, the Japanese mathematician Kakutani asked\nme why so many economists had attended the lecture he had\njust given. When I told him that he was famous because of the\nKakutani fixed-point theorem, he replied, 'What is the Kakutani\nfixed-point theorem?' (Ken Binmore, Playing for Real, 2007)\nMihai Manea (MIT)\nStrategy & Information\nFebruary 10, 2016\n47 / 57\n\nExistence of Nash Equilibria\nProve the existence of Nash equilibria in a more general setting.\n▶Continuity and compactness assumptions are indispensable, usually\nneeded for the existence of solutions to optimization problems.\n▶Convexity is usually required for fixed-point theorems.\nNeed some topology prerequisites. . .\nMihai Manea (MIT)\nStrategy & Information\nFebruary 10, 2016\n48 / 57\n\nCorrespondences\nTopological vector spaces X and Y\n▶A correspondence F : X ⇒Y is a set valued function taking elements\nx ∈X into subsets F(x) ⊆Y.\n▶G(F) = (x, y) |y ∈F (x) : graph of F\n▶x ∈X is a fixed point of F if x ∈F(x)\n▶F is non-empty/closed-valued/convex-valued if F (x) is\nnon-empty/closed/convex for all x ∈X.\nMihai Manea (MIT)\nStrategy & Information\nFebruary 10, 2016\n49 / 57\n\nClosed Graph\n▶A correspondence F has closed graph if G (F) is a closed subset of\nX × Y.\n▶If X and Y are first-countable spaces (such as metric spaces), then F\nhas closed graph iff for any sequence (xm, ym)m≥0 with ym ∈F (xm)\nfor all m ≥0, which converges to a pair (x, y), we have y ∈F (x).\n▶Correspondences with closed graph are closed-valued.\nMihai Manea (MIT)\nStrategy & Information\nFebruary 10, 2016\n50 / 57\n\nThe Maximum Theorem\nTheorem 5 (Berge's Maximum Theorem)\nSuppose that f : X × Y →R is a continuous function, where X and Y are\nmetric spaces and Y is compact.\nThe function M : X →R, defined by\nM (x) = max\ny∈Y f (x, y) ,\nis continuous.\nThe correspondence F : X ⇒Y,\nF (x) = arg max\ny∈Y f (x, y)\nis nonempty valued and has a closed graph.\nMihai Manea (MIT)\nStrategy & Information\nFebruary 10, 2016\n51 / 57\n\nA Fixed-Point Theorem\nTheorem 6 (Kakutani's Fixed-Point Theorem)\nLet X be a non-empty, compact, and convex subset of a Euclidean space\nand let the correspondence F : X ⇒X have closed graph and non-empty\nconvex values. Then the set of fixed points of F is non-empty and\ncompact.\nIn game theoretic applications, X is usually the strategy space, assumed\nto be compact and convex when we include mixed strategies.\nF is typically the best response correspondence, which is non-empty\nvalued and has a closed graph by the Maximum Theorem. To ensure that\nF is convex-valued, assume that payoff functions are quasi-concave.\nDefinition 7\nIf X is a convex subset of a real vector space, then the function f : X →R\nis quasi-concave if\nf(tx + (1 -t)y) ≥min(f(x), f(y)), ∀t ∈[0, 1], x, y ∈X.\nQuasi-concavity implies convex upper contour sets and convex arg max.\nMihai Manea (MIT)\nStrategy & Information\nFebruary 10, 2016\n52 / 57\n\nExistence of Nash Equilibrium\nTheorem 7\nConsider a game (N, S, u) such that Si is a convex and compact subset of\na Euclidean space and that ui is continuous in s and quasi-concave in si\nfor all i ∈N. Then there exists a pure strategy Nash equilibrium.\nThe result implies the existence of pure strategy Nash equilibria in\ngeneralizations of the Cournot competition game.\nTheorem 7 also implies the existence of mixed strategy Nash equilibria in\nfinite games.\nMihai Manea (MIT)\nStrategy & Information\nFebruary 10, 2016\n53 / 57\n\nProof\n▶Let Bi (s i) := arg maxs′ Si u(si\n′, s\nand define F\nS ⇒S,\n-\ni ∈\n-i)\n:\nF (s) = {(s1\n∗, . . . , sn\n∗)|s∗∈Bi (s\nB\n-i) , ∀i ∈N} =\nY\ni (\n)\ni\ns-i ,\ni∈N\n∀s ∈S.\n▶Since S is compact and the utility functions are continuous, the\nMaximum Theorem implies that Bi and F are non-empty valued and\nhave closed graphs.\n▶As ui is quasi-concave in si, the set Bi (s-i) is convex for all i and s-i,\nso F is convex-valued.\n▶Kakutani's fixed-point theorem ⇒F has a fixed point,\ns∗∈F (s∗) .\nsi\n∗∈Bi\n\ns∗\n-i\n\n, ∀i ∈N ⇒s∗is a Nash equilibrium.\nMihai Manea (MIT)\nStrategy & Information\nFebruary 10, 2016\n54 / 57\n\nExistence of Mixed-Strategy Nash Equilibrium\nCorollary 3\nEvery finite game has a mixed strategy Nash equilibrium.\nProof.\nSince S is finite, each ∆(Si) is isomorphic to a simplex in a Euclidean\nspace, which is convex and compact. Player i's expected utility\nui (σ) = P\ns ui (s) σ1 (s1) · · · σn (sn) from a mixed strategy profile σ is\ncontinuous in σ and linear--hence also quasi-concave--in σi. The game\n(N, ∆(S1) , . . . , ∆(Sn) , u) satisfies the assumptions of Theorem 7.\nTherefore, it admits a Nash equilibrium σ∗∈∆(S1) × · · · × ∆(Sn), which\ncan be interpreted as a mixed Nash equilibrium in the original game.\n□\nMihai Manea (MIT)\nStrategy & Information\nFebruary 10, 2016\n55 / 57\n\nContinuity of Nash Equilibrium\nFix N and S.\n▶X: compact metric space of payoff-relevant parameters\n▶S is a compact metric space (or a finite set)\n▶payoff function ui : S × X →R of every i ∈N is continuous in\nstrategies and parameters\n▶NE (x) and PNE (x): sets of Nash equilibria and pure Nash equilibria,\nresp., of game (N, S, u (·, x)) in which it is common knowledge that\nthe parameter value is x\n▶Endow the space of mixed strategies with the weak topology.\nTheorem 8\nThe correspondences NE and PNE have closed graphs.\nMihai Manea (MIT)\nStrategy & Information\nFebruary 10, 2016\n56 / 57\n\nProof\nConsider any sequence (sm, xm) →(s, x) with sm ∈PNE (xm) for each m.\nSuppose that s < PNE (x). Then\nui\n\ns′\ni , s-i, x\n\n-ui (si, s-i, x) > 0\nfor some i ∈N, s′\ni ∈Si. Then (sm, xm) →(s, x) and the continuity of ui\nimply that\nui\n\ns′\ni , sm\n-i, xm\n-ui\n\nsm\ni , sm\n-i, xm\n> 0\nfor sufficiently large m. However,\nui\n\ns′\ni , sm\n-i, xm\n> ui\n\nsm\ni , sm\n-i, xm\ncontradicts sm ∈PNE (xm).\nMihai Manea (MIT)\nStrategy & Information\nFebruary 10, 2016\n57 / 57\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n14.16 Strategy and Information\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT 14.16 S16 Strategy and Information-Median Stable Matchings Notes",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-16-strategy-and-information-spring-2016/5ae71c3b77fb295f53b665c61979efde_MIT14_16S16_medianmatch.pdf",
      "content": "14.16 STRATEGY AND INFORMATION\nMEDIAN STABLE MATCHINGS\nMIHAI MANEA\nDepartment of Economics, MIT\nConsider a one-to-one matching market, where M is the set of men and W is the set of\nwomen, and strict preferences for the men and women are given. Let μ and μ′ be any two\nstable matchings. Let μ ∨M μ′ be the function from M ∪W to M ∪W that assigns to\neach man m the more preferred of μ(m) and μ′(m), and assigns to each woman w the less\npreferred of μ(w) and μ′(w). Similarly, let μ ∧M μ′ be the function that assigns to each man\nm the less preferred of μ(m) and μ′(m), and assigns to each woman w the more preferred\nof μ(w) and μ′(w). We saw in the matching theory slides (Theorem 5) that μ ∨M μ′ and\nμ ∧M μ′ are again matchings, and moreover are stable.\nNow suppose we have any collection S = {μ1, . . . , μk} of stable matchings. Define supM(S)\nto be the function from M ∪W to M ∪W that assigns to each man m the most preferred\nof μ1(m), . . . , μk(m), and assigns to each woman w the least preferred of μ1(w), . . . , μk(w).\nWe can see that\nsupM(S) = (· · · ((μ1 ∨M μ2) ∨M μ3) ∨M · · · ) ∨M μk\nand therefore, by the preceding result, supM(S) is again a stable matching. Similarly, we\ncan define infM(S) to be the function from M ∪W to M ∪W that assigns to each man m\nthe least preferred of μ1(m), . . . , μk(m), and assigns to each woman w the most preferred of\nμ1(w), . . . , μk(w). Then infM(S) is again a stable matching.\nThis leads to the following result. The theorem is due to Teo and Sethuraman (1998), but\nour exposition follows the approach of Klaus and Klijn (2006).\nDate: April 27, 2016.\n\nMIHAI MANEA\nTheorem 1. Let μ1, . . . , μl be stable matchings, not necessarily distinct, and let k be any\ninteger with 1 ≤k ≤l. Consider the function ν : M ∪W →M ∪W given as follows. For\neach man m, order the matches μ1(m), . . . , μl(m) from most to least preferred (there may be\nsome repetitions in this list); let ν(m) be the kth entry in this list. For each woman w, order\nthe matches μ1(w), . . . , μl(w) from most to least preferred, and let ν(w) be the (l -k + 1)th\nentry in this list. Then ν is also a stable matching.\nFor a proof, note that μ1 := supM({μ1, . . . , μl}) has the desired property for k = 1,\nμ2 := supM({μ1, . . . , μl} \\ {μ1}) has the desired property for k = 2, and so on.\nIf {μ1, . . . , μl} is the set of stable matchings and l is odd, then applying the theorem for\nk = (l+1)/2 we obtain the median matching, in which every agent is assigned to the median\npartner over all stable matchings. This formally expresses the idea that we can choose a\nstable matching that balances the interests of men and women. If l is even, then there are\ntwo \"almost-median\" stable matchings, given by k = l/2 and k = l/2 + 1.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n14.16 Strategy and Information\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    }
  ]
}