{
  "course_name": "Strange Bedfellows: Science and Environmental Policy",
  "course_description": "12.103 explores the role of scientific knowledge, discovery, method, and argument in environmental policymaking from both idealistic and realistic perspectives. The course will use case studies of science-intensive environmental controversies to study how science was used and abused in the policymaking process. Case studies include: global warming, biodiversity loss, and nuclear waste disposal siting. Subject includes intensive practice in the writing and presentation of “position statements” on environmental science issues.",
  "topics": [
    "Engineering",
    "Environmental Engineering",
    "Environmental Management",
    "Science",
    "Earth Science",
    "Environmental Science",
    "Social Science",
    "Public Administration",
    "Environmental Policy",
    "Engineering",
    "Environmental Engineering",
    "Environmental Management",
    "Science",
    "Earth Science",
    "Environmental Science",
    "Social Science",
    "Public Administration",
    "Environmental Policy"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nOverview\n\nOur goal is to provide you with a sense of how science is - and sometimes is not - used to guide environmental policymaking. We will explore the contrasting languages and goals of science and civics in the context of case studies. These will be drawn from four options at the discretion of the class participants: Global Warming, Bioreserves (with a focus on fisheries), DDT/Malaria, and Nuclear Waste Disposal.\n\nStudents will divide into teams to explore how science was used or misused in the development of policy in these specific cases. Ultimately, we hope to brainstorm about better ways to inform policy through solid science.\n\nSubject Structure\n\nMeetings will include lectures, class discussions, tutorials, and team meetings.\n\nAssignments\n\nFor lectures and group discussions, we have assigned specific readings that are available in the\nreadings\nsection. In addition, there are three writing assignments and each paper must be revised and resubmitted by each student independently. Obviously, outside sources must be referenced appropriately, and each student must do his or her own work on the writing assignments. Each team will also be responsible for a final report on the case study assigned to them. This will be an oral report during one of the last sessions of the term.\n\nPrerequisites\n\nNone\n\nGrading\n\nactivities\n\npercentages\n\nClass Attendance and Participation\n\n30%\n\nWritten Assignments\n\n40%\n\nTeam Presentation\n\n30%",
  "files": [
    {
      "category": "Resource",
      "title": "ddt_presentation.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-103-strange-bedfellows-science-and-environmental-policy-fall-2005/41d39122e7f5a75936ccda95192e14b2_ddt_presentation.pdf",
      "content": "Dichlorodiphenyltricloroethane\n(DDT)\nRisks, Benefits and Public Perception\nEmma Bassein\nCassandra Roth\n\nOverview\n- History\n- Public Perception\n- Science: Risks and Uncertainty\n- Governmental, Intergovernmental, and\nNon-governmental Organizations\n- Policy\n\nDDT: History\n- First discovered in\n- Rediscovered in 1939\nas an insecticide\n- Used during WWII to\ncombat typhus and\nMalaria\n- Used post-war for\nagricultural insecticide\n-Apparently benign to\nhumans\nSource: http://markc1.typepad.com/relentlesslyoptimistic/images/ddt2.jpeg\n\nDDT is Good for Me!\n//\n/\nl\nSource: http: www.mindfully.org/Pesticide DDT-Househo d-\nPests-USDA-Mar47.htm\n\nSilent Spring: 1962\n- Single most influential\npublished piece about DDT\nBecause it caught the\npublic's attention\n- Compiled an enormous\namount of anecdotal\nevidence about the toxicity of\nSource:\npesticides\nhttp://www.mindfully.org/Pesticide/Rachel-\nCarson-Silent-Spring.htm\n\nUbiquity and Persistence\n- Every creature on earth\ncontains detectable levels\nof DDT in their body\n- DDT and its metabolites\npersist for decades\nCourtesy of US Fish and Wildlife Service.\n\nEvidence for toxicity: non-humans\n- Fish Kills\n- Reproduction inhibited in birds and other\nanimals\n- Feminization and other reproductive\ndysfunctions\nThe number of juvenile alligators per kilometer\nof shore line fell drastically in Lake Apopka\n(purple) when it was contaminated by DDT\nSource: www.darp.noaa.gov/southwest/\nSource: Guillete et al. (200?)\namtrader/photo.html\n\nEvidence of toxicity: humans\n- Long term DDT exposure is potentially linked to:\n-Cancer\n-Genetic Mutations\n-Preterm birth\n-Underweight at birth\n-Reduced lactation period\n-Spontaneous abortion/miscarriage\n-Increased rate of hermaphrodites\n- Studies lack controls and reproducibility\n\nDDT: Banned by Developed\nNations\nFirst banned in 1969: Denmark, Sweden, Hungary,\nand the state of Michigan\n1972: United States bans the use of DDT, but not\nthe export of it\n\"DDT posed unacceptable risks to the environment and\npotential harm to human health.\"\n-EPA Press Release, 12/31/1972\n\nPressure on Developing Nations\n- Reduction of aid for countries using DDT\nprograms\n- No importation of goods with DDT\nresidues into developed countries\n- Reduction in suppliers for malaria\nprograms\n\nInternational Malaria Epidemic\nImage removed for copyright reasons.\nPlease see: Hay, Simon, Carlos Guerra, Andrew Tatem, Abdisalan Noor, and Robert Snow. \"The global\ndistribution and population at risk of malaria: past, present and future.\" The Lancet: Infectious Diseases\nV4 (June 2004): 327-36.\n\nEffectiveness against Malaria\nReduction in DDT\ndirectly correlated to\nincrease in Malaria\nhttp://www.cdc.gov/ncidod/EID/\nvol3no3/roberts.htm\nAnnual Parasite Indexes (Y-axis one) and House\nSpraying Rates (Y-axis two) in American countries\nplotted against time show an inverse relationship\nbetween DDT use and parasite exposure\nSource: Roberts et al. (1997)\nSource:\n\nAlternative Malaria Control Options\n- Insecticide treated bed nets\n- House spraying with alternative pesticides\n- Land use modification\n- Vaccines, fast diagnosis and treatment\n- General health care improvements and\neducation\n\nIndoor Residue Spraying\nImage removed for copyright reasons.\nPlease see: Figure 1 in Walker, K. \"Cost Comparison of DDT and alternative insecticides for malaria control.\"\nMedical and Veterinary Entomology 14 (2000): 345-354.\n\nScientific Conclusion:\n- Wide spread use of DDT is harmful to the\nenvironment\n- No clear evidence of human health risk\n- DDT is the single most effective\nprevention method for malaria\n- DDT is the most cost effective method of\npreventing malaria\n\nPublic Policy & DDT\n1. Public perception of DDT: misinformed\n2. Stockholm Convention: balancing perception\n3. National organizations: USAID & bed nets\n4. WHO abandons DDT in favor of bed nets\nAction controlled by public perception\n\nPublic Perception of DDT\nEnvironment v Humans\nDeveloped Nations\nDeveloping Nations\nwww.habitat.org.uk\n- Eradicating bird and fish\nspecies\n- Cancer and endocrine\ndisruption in humans\n\"Unite against malaria\" www.unicef.org\n-3000 children / day, dead\n-300-600 million / yr, sick\n-Lost growth in economy\n\nReal Risks\nDDT Use: 1 unit of agriculture vs. 1 unit of house spraying\nAll houses in Guyana (800 thousand people) = 4 km^2 cotton field\n\nEradication to Reduction:\nPast funding failures\nNecessary for Malaria eradication:\n- Reducing malaria prevalence below critical\nlevel → requires DDT\n- Stop DDT use for agriculture\n- Funding from developed nations\n\nComparison of Methods\nMalaria Eradication Program\nRoll Back Malaria Program\n- Attack: house spraying\n- 60% use of bednets\nand treatment\n- 60% preventative\n- Consolidation: increased\ntreatment of pregnant\ntreatment, limited spraying\nwomen\n- Maintainence: vigil against\n- Maximum 2 weeks to\nreturn\noutbreak detection\nGoal: Global elimination\nGoal: Halve the malaria\nburden\n\nRepeating the Past:\nThe Stockholm Convention, 2001\nCountries that have signed in green and those\nthat have ratified in red\n\nUSAID Says...\n\"USAID and others have not seen DDT as a\nhigh priority component of malaria\nprograms for practical reasons...\nIt has been judged more cost-effective and\nappropriate to put US government funds\ninto preventing malaria through\ninsecticide-treated nets.\"\n\nCase Study: USAID & Funding\n10%\n85%\n5%\nConsultants\nPromotion of\nBed Nets\nOther\nDriessen, Paul. \"USAID could stop this epidemic.\" The Hill. November 2, 2005\n$80 million spent by USAID\n\nCase Study: USAID & Policy\n- DDT as weapon of last resort\n- Capitalist approach: private sale of bednets\n- Lack of infrastructure inhibiting\n\nWorld Health Organization\n- Staunch supporter of DDT\n- Stockholm Convention provides\nan opportunity to eliminate\nagricultural use\n- Developed countries withhold\nfunding\n- Situation in developing\ncountries worsens\nWHO\ncreates Roll\nBack Malaria\nprogram\n\nConclusions:\nPublic perception, not science, dictates the\naction of malaria control\nDDT should remain an integral part of malaria\ncontrol programs\n\nEducate the Public\nSuggested Solution"
    },
    {
      "category": "Resource",
      "title": "present_rubric.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-103-strange-bedfellows-science-and-environmental-policy-fall-2005/85b0e8a5306af3f97b7739b0c2b7bd1f_present_rubric.pdf",
      "content": "Student:\nGroup:\n\nGeneral impression:\n\nContent\nMessage\nResearch\nClarity\nInterpretation/synthesis\nSet up context for general audience\n\nTime: ____ min\n\nOrganization:\n\nFor the group:\n\nFor the individual:\n\nMain message explained at beginning and problem defined at beginning?\nEnough background for audience?\nReminded of main point throughout?\n\nVisuals:\nWere slides stand‐alone?\nWas visual presentation complementary or distracting?\nDid you describe figures and graphs by saying 1) what the figure is 2) what the\naxes labels are 3) what the trend shows?\n\nContent:\nGood examples and details to embellish and explain bulleted points?\nIs the main message interesting and clear?\nDemonstrate mastery of subject?\nEmphasize important points?\nExplain well?\nGood explanations of your points & good synthesis/judgement calls?\nDoes it keep audience engaged and interested?\n\nPersonal presentation:\nProfessional, non‐distracting appearance?\nEye contact?\nFluid, loud and clear speaking?\nData ARE not IS\nToo reliant on notes/screen?\n\nQuestions:\nDid group respond well to questions - organizationally (i.e., who is answering what) and\ncontent-wise?\nTake your time to use precise language, and give really good answers that show depth of\nknowledge and ability to synthesize and form informed opinions about the subject?\nSynthesized the implications and applications of your findings for the bigger picture?"
    },
    {
      "category": "Assignment",
      "title": "assignment_1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-103-strange-bedfellows-science-and-environmental-policy-fall-2005/c61ff7cb1bc763b53c97cdaa2767f053_assignment_1.pdf",
      "content": "Assignment I: Players, Problem Framing, and Science\nBefore understanding the extent to which a policy decision was or was not based on\n\"sound\" science, you must understand both the political and scientific landscapes. In this\nassignment, you are asked to write a 3- to 5-page paper (double-spaced) exploring the\nlandscapes of your group's topic. You should at least address these questions:\n- How and by whom was the policy problem framed?\n- What political, social, and economic issues were defined as fundamental to the\npolicy decision? By whom?\n- What scientific issues were defined as fundamental to the policy decision? By\nwhom?\n- Which scientific institutions or organizations were drafted by the cognizant\ngovernment agencies to do policy-relevant research? How was the research\ndistributed among these institutions or organizations?\n- To what extent were science issues defined differently by government, industry,\nand academic scientists?\n- In your opinion, did the science done adequately address the policy question as\nformally defined?\nBecause this is a team-based class, you are allowed to divide these questions among\nyourselves in the group, such that each of you does not have to address all six questions.\nHowever, you should indicate which questions you chose to tackle at the beginning of\nyour paper."
    },
    {
      "category": "Assignment",
      "title": "assignment_2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-103-strange-bedfellows-science-and-environmental-policy-fall-2005/c992cd5089de357c53c65f480e7723ff_assignment_2.pdf",
      "content": "Assignment II: Examining the Science\nGood science is defined by methodology as well as data. In this assignment, you are\nasked to write a 3- to 5-page paper (double-spaced) examining the quality of the science\ndone on your group's topic, and whether or not it was unbiased. You should at least\naddress these questions:\n- What key scientific hypotheses were proposed and examined in the scientific\nliterature?\n- Did the scientific community collect and analyze appropriate data to test those\nhypotheses? Were specific data not collected that could have been, or collected\nbut not analyzed?\n- How was modeling used by scientists to address the questions central to policy\ndecisions? Or did the scientific community simply generate data and leave the\npolicy up to the policymakers?\nRather than simply dividing these questions among the group as before, let's try\nsomething different. Each member of your group should adopt one key hypothesis and\nanswer the questions in that context. Note that the focus of this paper is on science, not\npolicy or politics."
    },
    {
      "category": "Assignment",
      "title": "assignment_3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-103-strange-bedfellows-science-and-environmental-policy-fall-2005/22f8f4eea243a9a3476352e8135532d1_assignment_3.pdf",
      "content": "Assignment III: The Nature of Uncertainty and Risk\nIn this assignment, you are asked to write a 3- to 5-page paper (double-spaced)\nexploring how uncertainty was treated in the science done on your group's topic, and how\nrisk was assessed in the making of policy. You should at least address these questions:\n- What uncertainties were acknowledged by the scientists involved?\n- How were these uncertainties quantified?\n- How were these uncertainties used in making policy decisions?\n- How might the uncertainties have been reduced?\n- How was risk characterized and measured in the policy arena?\n- Did the scientists involved in the study consider risk and probability in their\nanalyses?\nIn this case, each of you should try to answer all of these questions in your paper, but\nyour group can (and should) work together to identify the scientific uncertainties and\nrisks."
    },
    {
      "category": "Resource",
      "title": "12_103_paper1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-103-strange-bedfellows-science-and-environmental-policy-fall-2005/7c443bd6c4be311dfa898b92dbe72dc3_12_103_paper1.pdf",
      "content": "Indiscriminately From the Skies\nEmma Bassein\nAddressing Questions 1-3 and 6\nIntroduction\nThe 20th century brought with it the advent of modern chemistry; World War II bred\nthe apparently insatiable desire for chemicals that kill. In this race to synthesize the\ndeadliest weapon, there was one shining star that promised to bring life instead of death\nto the desperate soldiers on the front - Dichlorodiphenyltricloroethane (DDT). This\nsmall molecule, a member of the chlorinated hydrocarbon family, possessed the amazing\nqualities that it was both extremely toxic to insects, yet for all intents and purposes posed\nno immediate health threat to man. Since then, DDT has fallen out of favor with some\ncountries and institutions for various reasons, including environmental concerns and\npossible long term human effects such as cancer. Despite the changing attitude of world\nleaders towards DDT, the one constant is the complete control of developed countries\nover the use of DDT in the developing world.\nBackground\nDDT was discovered first in1873 by a German student, Othmar Zeidler, but no use\nwas found for it and he quickly moved on. It was rediscovered in 1939 by Paul Herman\nMuller during his search for the insecticide magic bullet. This virtually odorless, long\nlasting, highly effective and wide-reaching insecticide, which showed no immediate signs\nof mammal or plant health risk, met all of Muller's criteria for the perfect pesticide.\nAfter brief agricultural trials in Switzerland and the United States in the early 1940's,\nDDT met with fame when an outbreak of the louse-bourn disease typhus promised to kill\nthousand of civilians and soldiers in Naples, Italy. The typhus outbreak was halted when\nDDT was employed to delouse the city in January of 1944. In the following years DDT\nwas used widely in the South Pacific to control malaria and other insect born diseases for\nthe troops in those regions.1\nFollowing the war, DDT became a staple not only in malaria control programs\nthroughout the world, but was used heavily for agriculture and pest management in\ndeveloped nations. DDT production in the United States alone reached 3,000,000 lbs. per\n\nmonth by 1946. One enthusiastic writer in the introduction to his 1946 book DDT and\nthe Insecticide Problem declared that \"it [is] clear that DDT is here to stay. What follows\nwill, it is believed, make it equally clear that DDT will soon be recognized as our\nprinciple insecticide.\"2 This optimism was indicative of the whole world. Malaria cases,\npreviously counted in the tens of millions, by 1960 could be counted in the hundreds.\nVector control accounted for a small fraction of the DDT being used world wide.\nThe majority was being used as an agricultural, urban, or forest insecticide. Quantities\nranging from 0.5 to 5 lbs per acre were regularly spread over thousands of acres. Aside\nfrom specific insects that DDT did not affect, such as aphids, DDT had wide success in\ncontrolling the pest populations of the world. Titles of articles published in the early\n1940's included \"White Magic,\" \"The Conquest of Typhus,\" \"Gipsy moth wiped out,\"\n\"Very bad news for bugs,\" \"DDT a new weapon in the war against the insect enemies of\nmankind,\" \"Scientists view gun that won battle behind the lines in Italy.\"3 DDT was\nbeing included in such household items as paint, floor wax, and soap.\nDespite the excitement, however, reports of ecological and human harm caused by\nDDT were published even before the beginning of mass use. From 1944 alone the\nfollowing articles were published: \"Over-effective insecticide,\" \"DDT not universal\ninsecticide,\" \"DDT toxic to animals,\" \"DDT found highly toxic to fish and frogs,\" \"No\njoy in insect-free world,\" \"DDT poisonous to honey bees,\" \"Toxicity and potential\ndangers of aerosols, mists and dusting powders containing DDT,\" \"Toxic effects of DDT\nin man,\" and \"Insect war may backfire.\"4 Even DDT advocates, such as the one quoted\nabove, indicated tests which showed almost complete destruction of fish populations in\ntreated areas, bird losses, mild symptoms of nerve problems in people, and the disruption\nof natural predator controls through indiscriminate aerial spraying.5 These concerns,\nhowever, seemed to have little affect on the public's opinion of DDT. Aerial spraying\nprograms continued well in to the 1960's\nChanging Times, Changing Regulations\nThe public opinion of DDT in the developed world changed drastically during the\n1960's. Large spraying campaigns not only for agricultural purposes, but with the goal of\neradicating invasive pests such as the gypsy moth and the Japanese beetle had lead to\n\nlarge fish kills and a surprising reduction in birds.6 Most people consider the turning\npoint of the DDT debate to have occurred in 1962 when Rachel Carson published her\nbook, Silent Spring.7 The book compiled hundreds of studies regarding pesticides,\nincluding DDT, into a compelling written and entirely frightening account of the state of\nnature (interestingly, several of the studies she cited were also referred to in the 1946 pro-\nDDT book previously mentioned, DDT and the Insect Problem). Carson's book united\nthree primary groups of people in the fight against DDT and insecticides:\nEnvironmentalist (a quickly growing segment of the population with the advent of the\nSierra Club and loosely including wranglers and hunters), people concerned about\nchemicals in the human environment (which Carson emphasized could be the equivalents\nof nuclear radiation), and women, who have been the primary protectors of the home and\nfuture generations threatened by a poisoned environment.8\nUnited in favor of DDT, not surprisingly, were the chemical companies who\nmanufactured DDT (Allied Chemical, Diamond Shamrock, Olin Mattiesen, Lebanon,\nMonsanto, and Montrose Chemical Corp. in the US), along with the Department of\nAgriculture. Farmers fell on both sides of the argument. Notably, groups that were\nparticularly concerned with the well-being of developing countries, such as the World\nHealth Organization (WHO), and virtually all malaria infested nations still were strong\nsupporters of DDT\nBy 1969 Sweden and Denmark both banned DDT due to the discovery of residues\nin the milk of cows, and people, who had any exposure to the insecticide. Hungary\nbanned its use as well. The state of Michigan also banned DDT within its borders in\n1969 primarily motivated by public outcry regarding fish kills, including the\neconomically important Coho salmon. Several other states followed suit.9\nIn the United States and other developed countries, the primary issues in the DDT\ndebate during the 1960's and 70's involved wildlife and ecosystem damage; possible\ntoxicity of DDT over long exposure periods; bioaccumulation in fats (resulting in\nresidues in milk) and persistence; but also the recognition of a need for effective\npesticides for agriculture. The success of the campaign to ban DDT production and use\nhad much to do with the political times, both with the growing fear of carcinogens and\nthe bourgeoning environmental movement looking for a cause. In general, the science\n\nbehind the environmental arguments appeared more substantial by 1970 than the\nevidence for human harm.10 The newly formed EPA held hearings in 1971 to decide if\nDDT should be banned nationally. The hearings ultimately concluded that DDT was not\nan immediate threat to health. This decision was reversed in 1972 and a full ban on DDT\nfor use in the United States was implemented (except for emergency vector control\npurposes). This flip flop can be justified in two ways. The first is that the initial\ncommittee was biased towards the Pro-DDT side because members of the committee\ncame from the United States Department of Agriculture (USDA), traditionally very pro-\nDDT. From this point of view, the change in opinion was a correction of an initial\nimbalance of experts weighted towards agriculture. The second way to view it is that the\nscientific process of the committee was overturned for the sake of public opinion. The\ntruth lies somewhere in between and neither side had irrefutable evidence of their\ncorrectness. 11,12\nAlthough developing countries for the most part supported the continued use of\nDDT for malaria control, and were supported in this by WHO recommendations13, many\nwere nonetheless forced to reduce their use. Developed countries, which provide large\nquantities of aid to the developing world, began to refuse to support countries with DDT\nprograms and to refuse the importation of food stuffs with any DDT residue.\nConsidering that without foreign aid, most could not afford their DDT based anti-malaria\nprojects anyway, poor countries were forced to concede so as to continue to receive vital\nfunds.\nBy the time DDT was banned by individual countries in the late 1960's and early\n1970's, the vast majority of developed nations had already conquered malaria within their\nborders. This gave them the luxury to address environmental concerns and the possible\nlong term human effects related to DDT. Developing nations, who were still living with\nthe daily threat of Malaria, had entirely different issues in their cost-benefit analysis. The\npolicies, however, were handed down \"indiscriminately from the skies.\" Just as DDT\ndispersed from airplanes killed all insects, good or bad, developed nations inflicted DDT\nregulation without regard to the individual cost-benefit analysis of each situation.14\n\nRecent International Regulation\nWhen DDT was found in the artic, the scope of the DDT problem changed. This\nshowed that every corner of Earth was contaminated, no matter where the chemical use\noriginated. In 1989 Canada and Sweden instigated an intergovernmental task force to\naddress the global implications of persistent and far spread chemicals in the environment.\nIn the 1998 Aarhus Protocol drafted by the committee, DDT was classified along with 11\nother compounds as a Persistent Organic Pollutant (POP). No Latin or Central American\nand very few African countries were included among the signatories.15\nIn 2001, 151 countries signed the Stockholm Convention on Persistent Organic\nPollutants. The convention called for the universal ban of DDT, among other persistent\npollutants, except in registered cases of vector control (this allowance was made because\nthe WHO strongly objected to the treaty otherwise). 16,17\nDespite the allowance for vector control, the international treaties have virtually\neliminated all producers of DDT. This means that despite the formalities, the practical\ntruth is that DDT use for malaria control has drastically reduced and correspondingly\nmalaria levels are back on the rise.\nOver the last 30-40 years, nearly 800 papers per year have been published on some\naspect of DDT, yet little consensus has been reached.18 Papers have indicated increased\nDDT levels in mothers with preterm birth19; it has been shown to act as an endocrine\ndisrupter in various animals but has yet to be well linked to any form of human cancer;\nDDT is clearly a nerve toxin20, but the levels of safe exposure are debatable for humans,\nespecially when other factors are considered such as accumulation or reactions with\nsolvents; DDT has also been shown to cause liver damage. The activist climate of the\n1960's and 70's shifted the burden of proof to the chemical companies. For developed\ncountries using DDT primarily as an agricultural insecticide, the proven environmental\nconcerns combined with the suspected (though to this day not totally substantiated)\nhuman health risks were enough to warrant a ban on the substance under the\nprecautionary principle. The banning of DDT in developed countries, however, resulted\nin the unwilling removal of DDT from developing and malaria ridden countries. These\ncountries were not given an option and there is a compelling argument that, based solely\non the number of human lives lost to malaria each year, it was not in their best interest.\n\n1 James C. Leary, William I Fishbein, and Lawrance C. Salter. DDT and the Insect Problem (1946)\nMcGraw-Hill Book Company, New York.\n2 Ibid\n3 Division of U.S. Insecticide Investigation. A list of publications on 2, 2-bis(parachlorophenyl)-1, 1, 1-\ntrichloroethane (called DDT) List no.2, to Dec. 31 1944. (1945)\n4 Ibid\n5 James C. Leary, William I Fishbein, and Lawrance C. Salter. DDT and the Insect Problem (1946)\nMcGraw-Hill Book Company, New York.\n6 MacGillivray, Alex. Rachel Carson's Silent Spring. (2004) The Barron's Educational Series, New York.\n7 Carson, Rachel. Silent Spring. (1962) Houghton Mifflin Company, Boston.\n8 MacGillivray, Alex. Rachel Carson's Silent Spring. (2004) The Barron's Educational Series, New York.\n9 Ibid\n10 Fiedler, Heidelore (Editor). Persistent Organic Pollutants, The Handbook of Environmental Chemistry.\n(2003) Springer-Verlag, New York.\n11 MacGillivray, Alex. Rachel Carson's Silent Spring. (2004) The Barron's Educational Series, New York.\n12 Dunlap, Thomas. Science as a Guide in Regulating Technology: The Case of DDT in the United States.\nSocial Studies of Science, Vol.8, No.3 (Aug. 1978), 265-285\n13 WHO Position on DDT Use in Disease Vector Control under the Stockholm Convention on Persistent\nOrganic Pollutants. http://www.paho.org/common/Display.asp?Lang=E&RecID=7145\n14 Wright, James. DDT: It is Needed Against Malaria, but for the Whole Environment... Smithsonian\nNational Associates (1970)\n15 Fiedler, Heidelore (Editor). Persistent Organic Pollutants, The Handbook of Environmental Chemistry.\n(2003) Springer-Verlag, New York.\n16 WHO Position on DDT Use in Disease Vector Control under the Stockholm Convention on Persistent\nOrganic Pollutants. http://www.paho.org/common/Display.asp?Lang=E&RecID=7145\n17 The Stockholm Convention on Persistent Organic Pollutants. http://www.pops.int\n18 Ibid\n19 Matthew Longnecker, Mark Klebonoff, Haibo Zhou, and John Brock. Association between maternal\nserum concentration of the DDT metabolite DDE and preterm and small-for-gestational-age babies at\nbirth. The Lancet, Vol. 358, No, 9276 (July 2001) 110-114\n20 Fiedler, Heidelore (Editor). Persistent Organic Pollutants, The Handbook of Environmental Chemistry.\n(2003) Springer-Verlag, New York."
    },
    {
      "category": "Resource",
      "title": "12_103_paper2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-103-strange-bedfellows-science-and-environmental-policy-fall-2005/a02e55c9df0ad3fbd38900f68a9db5cb_12_103_paper2.pdf",
      "content": "DDT as an Endocrine Disruptor in Human and Nonhuman Test Cases\nEmma Bassein\n\"Aware of the health concerns, especially in developing countries, resulting from local\nexposure to persistent organic pollutants, in particular impacts upon women and, through\nthem, upon future generations.\"\n-Stockholm Convention on Persistent Organic Pollutants, 2001\nSince Rachel Carson's Silent Spring, the fear that bioaccumulating substances might\ncause genetic mutations or cancer has resonated with the international developed\ncommunity. Despite evidence that DDT does not cause permanent genetic mutations [1,\n2], International treaties as recent at the Stockholm Convention on Persistent Organic\nPollutants effective in 2004 [3] reference multigenerational consequences as a major\nselling point. If not specifically genetic, what could these health concerns be? One\nhypothesis is that DDT is an endocrine disruptor, possibly resulting in preterm birth,\nearly weaning, feminization and reduced fertility of male children, and sexual\nabnormalities of female children [1]. All of these could significantly affect future\ngenerations of a species, human or non-human, by increasing infant mortality, and\nhindering the next generation's ability to reproduce. Rogen and Chen [1] argue that these\nnegative effects might even be large enough to offset the benefits of DDT used for\nmalaria control in a pure human life comparison.\nConvincing evidence has been presented for the endocrine disrupting properties of\nDDT in non-human species, but evidence of the effects in humans is less clear. The\nnumber of international conferences on endocrine disruption indicates a commitment of\nhealth officials to clarify this problem [4].\n\nEndocrine Disrupting Effects in non-humans\nInfant mortality and gender related birth defects related to DDT (and its metabolites)\nexposure have been studied for a variety of nonhuman species ranging from gulls to\nmonkeys. Studies about DDT's endocrine disrupting effects emerged well before the ban\nin 1972. In 1968 Bitman et. al. compared the effects of treatment with DDT and estrogen\non rats. They showed that treatment with o,p'-DDT resulted in the same effects as\nestrogen on immature rat uteruses after 24 hours [6]. The dosage used however, 4mg of\no,p'-DDT per mouse, is significantly in excess of a normal exposure level. So although\nthis preliminary study indicated the estrogenic effect of o,p'-DDT on rats, it certainly\ndoes not have a direct application to environmental concerns.\nOf more relevance to natural endocrine disruption was a study conducted on gull\nembryos in Southern California. Fry and Toone [7] demonstrated that when o.p'-DDT\nlevels as low as 2ppm were injected into fertilized eggs, it resulted in feminization of 7\nout of 8 male hatchlings and abnormalities in 7 out of 9 female hatchlings (the control\nhad 0 out of 10 feminized males and 1 out of 21 abnormal females). The level of\nfeminization increased with the dose, strongly indicating a connection between o,p'-DDT\nand endocrine disruption in male gulls. The number of eggs sampled (264, 108 reaching\npipping; 46 for the control, and 14-27 eggs for each of 6 compounds tested) is small for\nstatistical significance, but presents an impressive picture.\nIn a study on an Alligator population in a DDT contaminated lake in Florida,\nGuillette et. al. demonstrated that both exposed males and females showed gonad\nabnormalities that greatly diminished their ability to reproduce [8]. This often sited paper\n\nis probably the most dramatic example of environmentally occurring levels of DDT\nresulting in an endocrine disrupting manner.\nThese papers are representative of the hundreds of in depth studies published\nrecording the endocrine disrupting nature of o,p'-DDT on nonhuman species. Many of\nthe scientists working on these studies have appeared before EPA and international\ncommittees on endocrine disruption and several have attempted to make a link between\nhormonal effects in their study species and possible human effects [4].\nEndocrine Disrupting Effects in Humans\nStudies that have tried to link DDT levels in humans directly to endocrine effects\nwere conducted in a much different way than those on other species. For one, the subject\ncannot be killed and dissected to look for more subtle variations in internal organ\nstructure. Neither can one gather children and raise them in a laboratory. Therefore the\nstudies that have been done about the effects of DDT on human subjects have been less\ncontrolled than their nonhuman counterparts.\nStudies, such as the one conducted by Longnecker et. al. [9], have looked for\ncorrelations between maternal serum concentrations of DDT and DDE during pregnancy\nand certain hormone regulated abnormalities (preterm labor, gonad formation, etc.) in\ntheir children. Longnecker et. al. used blood collected almost 40 years ago from women\nwho received prenatal care from university hospitals. They demonstrated a steadily\nincreasing trend of preterm birth with serum DDE concentrations.\nThe benefit of this method is the sample size. Because the blood has already been\ncollected along with a record of the women's and children's health, each additional\n\nsample is relatively little work. This allowed them to use a sample size of 2613 women.\nThe disadvantage is not being able to identify an accurate control group. Preterm birth\nhas been associated with several health factors besides DDT, including but not limited to\nsmoking, weight, height, and age. Separating the effects of DDT from other physical and\nsociological factors proves to be challenging problem. Although the authors of this study\nattempt to address it, it is difficult to know if they accounted for all of the other\nenvironmental factors that could lead to the observed outcome.\nDDT was concluded to act as a lactation suppressant in a study conducted by Rogan\net. al. [10]. In this case, soon to be mothers were asked to participate in the study and\nsubmitted breast milk and other samples on a regular basis for multiple years. The\nauthors took great care to address possible accidental correlations in a variety of ways\n(primarily resulting in the same outcomes as previously calculated).\nIn general the human case studies evaluating DDT as an endocrine disruptor have\nbeen compelling, but only show a correlation, not a causal relationship. Other\nassociations have been even less conclusive than the ones addressed here, such as seaman\ncount, menstrual cycle irregularity, and birth weight [1].\nThere are two possible reasons why the link between endocrine disruption, birth\nrelated problems, and gender related birth defects has been much more clearly\ndemonstrated in nonhuman species. The first might be that the species being studied are\nactually more susceptible to the endocrine disrupting properties of DDT and its\nmetabolites than humans are.\nThe second possibility is that it is impossible to subject human subjects to substantial\nquantities of a toxin, force them to mate, and then kill and dissect their offspring. These\n\nmethods that are used on animal subjects lead to much more comprehensive and\nconclusive results because they allow scientist to examine tissue and look for a causal\nrelationships.\nHowever, statements such as the one quoted at the beginning of this paper from the\nStockholm Convention on Persistent Organic Pollutants [3] indicate that international\npolicy makers are prepared to take leap from the scientific proof a correlation between\nDDT concentrations and hormonal induced effects in humans to the assumption of a\ncausal relationship.\n1. Rogen WJ, and Chen A. Health Risks and Benefits of bis(4-chlorophenyl)-1,1,1-trichloroethane (DDT).\nThe Lancet 2005; 366: 763-773.\n2. Turusov V, Rakitsky V, and Tomatis L. Dichlorodiphenyltrichloroethane (DDT): Ubiquity, Persistence,\nand Risks. Environmental Health Perspectives 2002; 110: 125-128.\n3. Stockholm Convention on Persistent Organic Pollutants. www.pops.int\n4. EPA Endocrine Disruptor Research Initiative. http://epa.gov/endocrine/pubs.html\n5. Anderson DW, Jehl JR Jr., Risebrough RW, Woods LA Jr., Deweese LR, and Edgecomb WG. Brown\nPelicans: Improved Reproduction off the Southern California Coast. Science 1975; 190: 806-808.\n6. Bitman J, Cecil HC, Harris SJ, and Fries GF. Estrogenic Activity of o,p prime-DDT in the Mammalian\nUterus and Avian Oviduct. Science 1968; 162: 371-372.\n7. Fry DM, and Toone CK. DDT-Induced Feminization of Gull Embryos. Science 1981; 213: 922-924.\n8. Guillette LJ Jr., Gross TS, Masson GR, Matter JM, Percival HF, and Woodward AR. Developmental\nAbnormalities of the Gonad and Abnormal Sex Hormone Concentrations in Juvenile Alligators from\nContaminated and Control Lakes in Florida. Environmental Health Perspectives 1994; 102: 680-688.\n9. Longnecker MP, Klebanoff MA, Zhou H, and Brock JW. Association between meteral serum\nconcentration of the DDT metabolite DDE and preterm and small-for-gestational-age babies at birth. The\nLancet 2001; 358: 110-114.\n10. Rogan WJ, et. al. Polychlorinated Biphenyls (PCBs) and Dichlorodiphenyl Dichloroehtene (DDE) in\nHuman Milk: Effects on Growth, Morbidity, and Duration of Lactation. American Journal of Public\nHealth 1987; 77: 1294-1297.\n11. Kelce WR, Stone CR, Laws SC, Gray LE, Kemppainen JA, and Wilson EM. Persistant DDT\nmetabolite p,p'-DDE is a potent androgen receptor antagonist. Nature 1995; 375: 581-585.\n12. Takayama S, Sieber SM, Dalgard DW, Thorgeirsson UP, and Adamson RH. Effects of long-term oral\nadministration of DDT on nonhuman primates. Cancer Res Clin Oncol 1999;125: 219-225"
    },
    {
      "category": "Resource",
      "title": "12_103_paper3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-103-strange-bedfellows-science-and-environmental-policy-fall-2005/4c9c5cba090f11d82eb8065fa41a6189_12_103_paper3.pdf",
      "content": "Lives on the Line: DDT, Malaria, and Infant Mortality\nBy Emma Bassein\nFor half of the world, Dichlorodiphenyltricloroethane (DDT) is a gift from God sent\nto remove the burden of death from the shoulders of the poor; for others, it was concocted\nin the fiery depths of hell to silence the birds and wreak untold havoc upon human\nreproduction. The often bitter international debate between these two factions has not\nonly focused on the question of what the risks of DDT are, but for whom do these risks\napply. In the late 1960's and early 1970's developed countries world wide curbed their\nheavy dependence on DDT. Through this act, policy makers demonstrated DDT's clear\nthreat to environmental health and the possible, but highly uncertain, risks for human\nhealth greatly outweighed the benefits as a pesticide and insecticide [1]. The subsequent\nrestrictions on DDT use imposed on developing countries did not properly address the\nrisks involved in discontinuing DDT use for vector control purposes [2,3].\nDeveloped nations, who universally do not use DDT [4], are faced with no immediate\nthreat of DDT incited, or controlled, diseases, the debate has shifted to the relative benefit\nof DDT within developing nations. The risks and uncertainties associated with either\nDDT's continued use or elimination are highly dependent on local conditions. This has\nbeen grudgingly acknowledged by the international community, as can be seen by the\nexceptions to the Stockholm Convention on Persistent Organic Pollutants that allow for\nsome use of DDT for vector control purposes [5].\n\nDDT Then: Risks and Uncertainty\nIn the late 1960's and 70's when countries began to ban DDT, malaria had been\neradicated in virtually all developed nations and its primary use in those countries was as\nan agricultural insecticide [6]. The most notable threats resulting from using DDT as an\nindustrial scale pesticide were environmental. By 1970 it had been clearly demonstrated\nthat DDT was directly responsible for reproductive failure in many species of birds and\nlarge fish kills throughout the United States [6].\nAlthough environmental concerns were the primary reason for banning DDT in many\ncountries, other concerns related to human health were also raised. Anecdotal studies\nregarding DDT as a carcinogen, mutagen, or nerve toxin further enforced the public's\nfear of this insecticide [7]. Despite that fact that most, if not all, of the studies relating\nhuman diseases to DDT exposure were statistically insignificant or irreproducible, the\nrisks appeared so great that policy makers invoked the precautionary principle and\npreceded with a ban on all uses of DDT, except in emergency cases of disease outbreak\n[1].\nDeveloping nations at this time, many of whom were still battling malaria, evaluated\nthe risk of DDT differently. There was little doubt that use of DDT for vector control\ndirectly correlated to reduced incidents of malaria. The lower life expectancy and higher\ninfant mortality in these nations reduced the relative risk of carcinogens and mutagens.\nTherefore in countries with a high malaria burden, the clear benefits of DDT use\noutweighed the highly uncertain long term affects of DDT exposure because the risk was\nhigher and the affect more direct [8].\n\nDDT Now: Risks and Uncertainty\nDDT has been universally banned in developed nations since before the Stockholm\nConvention on Persistent Organic Pollutants [4]. Because the import of foodstuffs with\nDDT residues was prohibited in the developed countries, use of DDT for agricultural\npurposes world wide was virtually eliminated. The result of this is that the only possible\nexposure to new sources of DDT for developed nations would be environmental transport\nof the substance across great distances. With the large reduction in agricultural use, the\nprobability and magnitude of this exposure route is vanishingly small.\nThe risks and benefits of DDT use lie solely in developing countries with high\nmalaria burden. The primary international debate is about using DDT in indoor spraying\nfor malaria vector control. Indoor house spraying of DDT with the standard rate of 2g/m2\n[9] could treat all of the houses of Guyana's high malaria risk population with the same\namount of DDT that would be used on 0.4 km2 for agricultural purposes [4] and only a\nfraction of this would be transported outside, so environmental effects can be considered\nnegligible from this source. To assess the relative risks of using DDT in domicile\nspraying campaigns for malaria control verses no malaria control, the worst case scenario\nin terms of human life have been calculated for each case based on the prevailing\nliterature.\n-\nRisks of no malaria control\n90% of deaths from malaria occur in sub-Saharan Africa, and the vast majority of\nthose deaths occur in children under the age of five [8]. Infant mortality directly caused\nby malaria has been estimated at 9 in 1000 per year in areas where malaria is prevalent\n[10]. DDT has not been widely used in sub-Saharan Africa because it was not deemed\nfeasible by the World Health Organization (WHO) [11]. DDT is currently being used in\n\n23 countries for malaria control [6]. Multiple studies have indicated that reduction in\nDDT use is correlated with malaria resurgence [12, 13], indicating that the risk of not\nusing DDT would also include the lives that would be lost in the rest of the world that\ncurrently has malaria under control. The total number of lives expected to be lost if DDT\nuse were to be discontinued is difficult to determine. Anti-malaria campaigns have\nroutinely included improved health care and other benefits that could be continued\nwithout DDT and have contributed substantially, but unquantifiable, to reductions in\nmortality [10]. Assuming perfect application and effectiveness, virtually all malaria\ncaused deaths could be avoided by DDT. Malaria also poses monetary risks for\ndeveloping nations, including but not limited to loss of revenue from tourism and loss of\nworker productivity.\n-\nRisks of DDT use\nLong term exposure to DDT has been tentatively correlated with numerous\nreproductive disorders in humans, including reduced semen quality, probability of\npregnancy, spontaneous abortion, preterm delivery, reduced birth weight, increased\nchance of gender-related birth defects, and shortened duration of lactation [10]. Women\nexposed to DDT only through indoor house spraying in Kwa-Zulu had as much as\n59.30ppm concentration of DDT and its derivatives in their milk fat. Calculating the\ndaily intake of infants consuming breast milk with the average concentrations of DDT\nfound in this study results in 0.376 mg/kg/day, almost 19 times the WHO Allowed Daily\nIntake (ADI) [9]. These values substantially exceeded those found to be associated with\nreduced lactation in Mexican and US women; concentrations of exposure related to\npreterm birth and spontaneous abortion are more difficult to compare because they are\nmeasured as micrograms/L of serum [10]. Assuming the worst case scenario that DDT\n\ndoes in fact cause these disorders, and combining these results with studies on the effects\nof preterm birth and reduced duration of lactation on infant mortality, continuous indoor\nDDT spraying could result in up to 20 deaths per 1000 live births in the affected\npopulation [14].\nDespite the large body of scientific literature surrounding DDT, no two studies have\nbeen able to directly confirm or refute each other. This is due primarily to conflicting\nstudy parameters, whether it be sample size, which isomer of DDT is being tested, or the\nlevel of concentration that is being examined [10]. Consequently, the uncertainty\nregarding DDT's negative affects on human health is large and unquantifiable because it\nconsists not only of the scientific uncertainty of each study, but also the unknown\nuncertainty regarding the works' validity.\nUncertainties and the Policy Response\nBoth scenarios have large, primarily unquantifiable uncertainties. DDT application in\nsub-Saharan Africa has been anything but perfect. Irregular spraying and plastering over\nor washing sprayed walls are some of the many things that reduce the effectiveness of\nDDT campaigns [15]. Yet in other regions, DDT has virtually eliminated transmission of\nmalaria, therefore approaching the perfect scenario[16]. The uncertainties related to the\neffectiveness of DDT spraying, therefore, arise primarily from societal differences that\nare so diverse that they are virtually impossible to quantify. The risk of not using DDT\nan also be diminished by implementation of alternative Malaria control methods, such as\nland management, aggressive health care initiatives, and other insecticides [8].\nThe uncertainties related to the negative effects of DDT exposure in humans are\nprimarily scientific. Time limitations, lack of controls, and methods of data collection\n\nhave greatly increased the uncertainties of effects on humans. Studies that could\naccurately track the relation of DDT exposure to long term effects in humans would\nrequire decades, something that is impractical for a variety of reasons. The alternative,\nwhich is to used data bases and census information from decades ago introduce\nunquantifiable uncertainty due to lack of necessary variables and variances in collection\ntechniques between different databases, making them difficult to compare. Short term\nstudies can give some insight, but for the most part have only been capable of showing\nexposure to DDT and correlations, not effects [17]. Some of the uncertainty could be\nreduced by independent researchers conducting studies using the same parameters as\nprevious studies so that the results could be directly compared.\nUncertainties have been used by proponents of both DDT house spraying and the\nbanning of DDT for all purposes. Scientists and policy makers in favor of continued\nDDT use cite the large uncertainty regarding the negative effects of DDT on people and\nthe relatively nonexistent uncertainty regarding DDT's lethality to mosquitoes. Scientists\nand policy makers in favor of ending DDT use emphasize the enormous risk of possible\nDDT induced disorders, the certainty of DDT's effects on the environment, the\nineffective use in parts of Africa, and growing mosquito resistance world wide as reasons\nto provoke the precautionary principle.\nThe risks and benefits of DDT use vary by region depending on the feasibility of\nsustained house spraying. In areas where DDT spraying has been successful, such as\nsignificant portions of South and Central America, and Asia, the risk of eliminating DDT\nfrom the malaria control program is large and there is little uncertainty that the number of\nmalaria cases is inversely related to DDT use. In areas where DDT house spraying has\nbeen deemed ineffective, discontinuing its use would present a lower risk. Risk/benefit\n\nanalyses of DDT use must be conducted independently for different regions and\nsituations, something that has been reluctantly acknowledged by the international\ncommunity of developed nations up to this point.\nSources\n1. DDT Ban Takes Effect. EPA pres release, December 31st 1972.\nhttp://www.epa.gov/history/topics/ddt/01.htm\n2. WHO Position on DDT Use in Disease Vector Control under the Stockholm Convention on\nPersistent Organic Pollutants. http://www.paho.org/common/Display.asp?Lang=E&RecID=7145\n3. Wright, James. DDT: It is Needed Against Malaria, but for the Whole Environment... Smithsonian\nNational Associates (1970)\n4. Attaran A, Roberts DR, Curtis CF, and Kilama WL. Balancing risks on the backs of the poor.\nNature Medicine 2000; 6: 729-731\n5. Stockholm Convention on Persistent Organic Pollutants. http://www.pops.int\n6. Turusov V, Rakitsky V, and Tomatis L. Dichlorodiphenyltrichloroethane (DDT): Ubiquity,\nPersistence, and Risks. Environmental Health Perspectives 2002; 110: 125-128.\n7. Carson, Rachel. Silent Spring. (1962) Houghton Mifflin Company, Boston.\n8. Rolling Back Malaria. World Health Organization 1999;\nhttp://www.who.int/whr/1999/en/whr99_ch4_en.pdf\n9. Bouwman H, Cooppan RM, Reinecke AJ, and Becker PJ. Levels of DDT and metabolites in\nbreast milk from Kwa-Zulu mothers after DDT application for malaria control. Bulletin of the\nWorld Health Organization 1990; 68: 761-768.\n10. Rogen WJ, and Chen A. Health Risks and Benefits of bis(4-chlorophenyl)-1,1,1-trichloroethane\n(DDT). The Lancet 2005; 366: 763-773.\n11. Trigg PI, and Kondrachine AV. Commentary: Malaria control in the 1990s. Bulletin of the World\nHealth Organization 1998; 76: 11-16.\n12. Roberts DR, Manguin S, and Mouchet J. DDT house spraying and re-emerging malaria. The\nLancet 2000; 356: 330-332\n13. Roberts D, Curtis C, Tren R, Sharp B, Shiff C, and Bate R. Malaria control and public health.\nEmerging Infectious Disease 2004; 10: 1170.\n14. Chen A, and Rogan WJ. Nonmalarial Infant Deaths and DDT Use for Malaria Control. Emerging\nInfectious Diseases 2003; 9 (8)\n15. Mnzava EAP, Ntuli MV, Sharp B, Mthembu JD, Ngxongo S, and Le Sueur D. House replastering\nas a reason to shift from DDT spraying to synthetic pyrethroids. South African Medical Journal\n1998; 88: 1023-1028.\n16. Attaran A, and Maharaj R. Doctoring malaria, badly: the global campaign to ban DDT. BMJ\n2000; 321: 1403-1404.\n17. Chen AM, and Rogan WJ. Malaria control and public health- In reply. Emerging Infectious\nDiseases 2004; 10: 1171."
    }
  ]
}