{
  "course_name": "String Theory for Undergraduates",
  "course_description": "This course introduces string theory to undergraduate and is based upon Prof. Zwiebach’s textbook entitled A First Course in String Theory. Since string theory is quantum mechanics of a relativistic string, the foundations of the subject can be explained to students exposed to both special relativity and basic quantum mechanics. This course develops the aspects of string theory and makes it accessible to students familiar with basic electromagnetism and statistical mechanics.",
  "topics": [
    "Science",
    "Physics",
    "Quantum Mechanics",
    "Theoretical Physics",
    "Science",
    "Physics",
    "Quantum Mechanics",
    "Theoretical Physics"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nPrerequisites\n\n8.033 (Relativity)\n,\n8.044 (Statistical Physics I)\n, and\n8.05 (Quantum Physics II)\n.\n\nTextbook\n\nZwiebach, Barton.\nA First Course in String Theory\n. New York, NY: Cambridge University Press, 2004. ISBN: 9780521831437.\n\nAdditional Reference\n\nA new readable book at the graduate level is:\n\nBecker, Katrin, Melanie Becker, and John H. Schwarz.\nString Theory and M-Theory: A Modern Introduction\n. Cambridge, UK: Cambridge University Press, 2007. ISBN: 9780521860697.\n\nHomework\n\nThere will be weekly homework. No late homework will be accepted. Students will be able to drop one homework - the one with the lowest grade - from their record.\n\nTests\n\nThere will be two tests and a final exam.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nHomework\n\n35%\n\nTest 1\n\n20%\n\nTest 2\n\n20%\n\nFinal exam\n\n25%\n\nCalendar\n\nSES #\n\nTOPICS\n\nKEY DATES\n\nAnnouncements, introduction\n\nLorentz transformations\n\nLight-cone coordinates\n\nEnergy and momentum\n\nCompact dimensions, orbifolds\n\nQuantum mechanics and the square well\n\nRelativistic electrodynamics\n\nGauss' law\n\nGravitation and Planck's length\n\nHomework 1 due\n\nGravitational potentials, compactification, and large extra dimensions\n\nNonrelativistic strings and lagrangian mechanics\n\nHomework 2 due\n\nThe relativistic point particle: Action, reparametrizations, and equations of motion\n\nArea formula for spatial surfaces\n\nHomework 3 due\n\nArea formula for spatial surfaces (cont.)\n\nChange of variables\n\nHomework 4 due\n\nRelativistic strings: Nambu-Goto action, equations of motion and boundary conditions\n\nHomework 5 due\n\nStatic gauge, transverse velocity, and string action\n\nMotion of free open string endpoints\n\nThe sigma-parametrization\n\nEquations of motion and virasoro constraints\n\nGeneral motion for open strings\n\nRotating open strings\n\nHomework 6 due\n\nTest 1\n\nPeriodicity conditions for the motion of closed strings\n\nThe formation of cusps\n\nConserved currents in E&M\n\nConserved charges in lagrangian mechanics\n\nMomentum charges for the string\n\nLorentz charges for the strings\n\nAngular momentum of the rotating string\n\nDiscuss alpha' and the string length l_s\n\nGeneral gauges: fixing tau and natural units\n\nHomework 7 due\n\nSolution of the open string motion in the light-cone gauge\n\nLight-cone fields and particles\n\nLight-cone fields and particles (cont.)\n\nHomework 8 due\n\nOpen strings\n\nHomework 9 due\n\nCritical dimension\n\nConstructing the state space\n\nTachyons\n\nClosed strings\n\nHomework 10 due\n\nWrap-up of closed strings\n\nSuperstrings\n\nTest 2\n\nSuperstrings (cont.)\n\nClosed strings\n\nHeterotic string theory\n\nDp-branes\n\nParallel Dp's\n\nHomework 11 due\n\nDp-branes (cont.)\n\nFinal exam review\n\nFinal exam week",
  "files": [
    {
      "category": "Resource",
      "title": "hwk1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-251-string-theory-for-undergraduates-spring-2007/0e66221f4e5a6e9fe2dcc3412f4436e1_hwk1.pdf",
      "content": "8.251 - Homework 1\nB. Zwiebach\nSpring 2007\nDue Tuesday, February 13.\n1. (10 points)\nQuick calculation 2.2 (p. 20).\nQuick calculation 2.3 (p. 24).\n2. (10 points) A matrix L that satisfies (2.44) defines a Lorentz transformation. Show that\n(a) If L1 and L2 are Lorentz transformations so is the product L1L2.\n(b) If L is a Lorentz transformation so is the inverse matrix L-1 .\n(c) If L is a Lorentz transformation so is the transpose matrix LT .\n3. (10 points) Problem 2.2, part (a) only.\n4. (10 points) Problem 2.3.\n5. (10 points) Consider the (x, y) plane described with a complex coordinate z = x + iy. We have\n2πi\nseen that the identification z ∼ e N z with N ≥ 2 a positive integer, can be used to construct a\ncone. Consider two relatively prime integers M and N, with M < N and the identification\n2πi M\nz ∼ e\nN z ,\nM, N ≥ 2 .\n(1)\nOne may naively believe that a fundamental domain is provided by the points that satisfy the\nconstraint 0 ≤ arg(z) < 2π M . Experiment with low values of M and N to convince yourself\nN\nthat this is not a fundamental domain. Determine a fundamental domain for the identification\nin (1).\nHint: There is a lovely theorem that follows from Euclid's algorithm for the greatest common\ndivisor: Given two integers a and b, relatively prime, there exist integers m and n such that\nma + nb = 1 (m and n are not unique). This result should be useful once you have thought a\nbit about the problem. Finding m and n is not easy unless you use Euclid's algorithm: try, for\nexample, solving 187m + 35n = 1, for some integers m and n.\n6. (10 points) Problem 2.4.\n7. (20 points) Problem 2.7"
    },
    {
      "category": "Resource",
      "title": "hwk2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-251-string-theory-for-undergraduates-spring-2007/1e3eddd432bf1a79cea26708b94bab52_hwk2.pdf",
      "content": "8.251 - Homework 2\nB. Zwiebach\nSpring 2007\nDue Wednesday, February 21.\n1. (10 points) Problem 3.1\n2. (10 points) Problem 3.2\n3. (10 points) Lorentz invariants and their densities.\nWe want to understand how the Lorentz invariance of charge (all Lorentz frames agree on the\nvalue of the charge in a system) implies that charge density is the zeroth component of a Lorentz\nvector.\nConsider two Lorentz frames S and S′ with S′ boosted along the +x direction of S with velocity v.\nIn frame S we have cubic box of volume L3 with edges, all of length L, aligned with the axes\nof the coordinate system. The box is at rest and is filled by a material, also at rest, that has\nuniform charge density ρ0. In this frame the current density vanishes j = 0.\nUse the Lorentz invariance of charge to calculate the charge density and current density (cρ′ ,j′)\nthat describe the material in the box according to frame S′ . Verify that the values (cρ0,0) and\n(cρ′ ,j′) behave as four-vectors jμ ≡ (cρ0,0) and j′μ ≡ (cρ′ ,j′), in the sense that the quantities\n(cρ′ ,j′) are obtained from the rest frame values (cρ0,0) by a Lorentz boost. Write a formula for\nthe current jμ in terms of ρ0 and the four-velocity of the box, and check that your result works\nboth for frames S and S′ .\n4. (10 points) Lorentz transformation of electric fields.\nConsider two Lorentz frames S and S′ with S′ boosted along the +x direction of S with velocity v.\nWe have a large parallel plate capacitor at rest in S, with uniform but opposite surface charge\ndensities ±σ0 on the plates. The capacitor can be aligned in two ways:\n(i) With the plates along planes of constant y, so that the resulting electric field E⊥ points in\nthe y direction, a direction transverse to the boost.\n(ii) With the plates along planes of constant x, so that the resulting electric field E∥ points in\nthe x direction, the direction along the boost.\nUse the Lorentz invariance of the charge to calculate the electric fields seen by the observer\nS′ in both cases (i) and (ii). Thus derive and state the transformation rules that relate the\nfields (E⊥, E∥) seen by S and the fields (E′ , E′ ) seen by S′ . Use the tensor transformation law\n⊥\n∥\nF ′μν = Lμ\nρLν\nσF ρσ to confirm your result. For this purpose take Ex = E∥ and Ey = E⊥ and\nassume no other field exists in the S frame.\n5. (10 points) Problem 3.8\n6. (20 points) Problem 3.9."
    },
    {
      "category": "Resource",
      "title": "hwk3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-251-string-theory-for-undergraduates-spring-2007/8111d4941a1acd97825409d83011d27d_hwk3.pdf",
      "content": "p\n8.251 - Homework 3\nB. Zwiebach\nSpring 2007\nDue Thursday, March 1.\n1. (5 points) Problem 4.1\n2. (10 points) Problem 4.2\n3. (15 points) Problem 4.3\n4. (10 points) Closed string motion.\nWe can describe a nonrelativistic closed string fairly accurately by having the string wrapped\naround a cylinder of large circumference 2πR on which it is kept taut by the string tension T0.\nWe assume that the string can move on the surface of the cylinder without experiencing any\nfriction. Let x be a coordinate along the circumference of the cylinder: x ∼ x+2πR and let y be\na coordinate perpendicular to x, thus running parallel to the axis of the cylinder. As expected,\nthe general solution for transverse motion is given by\ny(x, t) = h+(x - v0t) + h-(x + v0t) ,\nwhere h+(u) and h-(v) are arbitrary functions of single variables u and v with -inf < u, v < inf.\nThe string has mass per unit length μ0, and v0 =\nT0/μ0.\n(a) State the periodicity condition that must be satisfied by y(x, t) on account of the identification\nthat applies to the x coordinate. Show that the derivatives h′ (u) and h′ (v) are, respectively,\n+\n-\nperiodic functions of u and v.\n(b) Show that one can write\nh+(u) = αu + f(u) ,\nh-(v) = β v + g(v) ,\nwhere f and g are periodic functions and α and β are constants. Give the relation between α\nand β that follows from (a).\n(c) Calculate the total momentum carried by the string in the y direction. Is it conserved ?\n5. (10 points) Problem 5.3\n6. (10 points) Problem 5.4\n7. (10 points) Problem 5.5\nWhile not assigned, I think all students should know how to solve problem 4.6 and problem 5.1."
    },
    {
      "category": "Resource",
      "title": "hwk4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-251-string-theory-for-undergraduates-spring-2007/9b8e3b2a6f153963ac0b16cd0acbf603_hwk4.pdf",
      "content": "8.251 - Homework 4\nB. Zwiebach\nSpring 2007\nDue Wednesday, March 7.\n1. (10 points) Problem 5.6\n2. (15 points) Point particle action in curved space.\n(This problem is an elaboration of Problem 5.7 in the textbook.)\nIn Section 3.6 we considered the invariant interval ds2 = -gμν (x)dxμdxν in a curved space with\nmetric gμν (x). The motion of a point particle of mass m on curved space is studied using the\naction\n\nS = -mc\nds .\n(a) Show that the equation of motion takes the form\nd\ndxμ\n1 ∂gμν dxμ dxν\nds gρμ ds\n= 2 ∂xρ ds ds .\nThis equation of motion is called the geodesic equation. Although the action is simple, the\ngeodesic equation is nonetheless rather nontrivial. However, if the metric is constant, as in\nspecial relativity, then the right-hand side of the above equation vanishes, and we recover the\nfamiliar equation of motion of a free point particle.\n(b) Another form of the geodesic equation can be found by expanding the derivative on the\nleft-hand side, and then manipulating the result until one obtains an equation for d2xλ/ds2 .\nShow that this equation can be written as\nd2xλ\ndxμ dxν\n+ Γλ\n= 0 ,\nds2\nμν ds ds\nwhere\n\nΓλ\n1 λσ\n∂gσμ\n∂gσν\n∂gμν\nμν = g\n+\n-\n.\n∂xν\n∂xμ\n∂xσ\nThe Christoffel coefficients Γ are symmetric in the lower indices Γλ = Γλ , and they vanish if\nμν\nνμ\nthe metric is constant.\n3. (10 points) Schwarz inequality in R1,1 .\nConsider a two-dimensional vector space V with a constant metric such that there is a spacelike\nvector s′ (s′2 = s′ · s′ > 0) and a timelike vector t′ (t′2 = t′ · t′ < 0). As usual, we write\nv1 · v2 = gij v1\ni v2\nj , where gij are the components of the metric.\n(a) Prove that you can find vectors s and t such that s·s = 1, t·t = -1 and t·s = 0. The vectors\nt and s provide a canonical basis for V , which is now identified as the space R1,1. Namely, we\ncan say t = (1, 0), s = (0, 1) together with g00 = -1, g11 = 1 and g01 = g10 = 0.\n\n(b) Consider now two arbitrary vectors v1 and v2 in V . Prove that\n(v1 · v2)2 ≥v1\n2 v2\n2 ,\nwhere the equality only holds if the vectors v1 and v2 are parallel.\n4. (10 points) Metric on S2 from stereographic parameterization.\nConsider a unit sphere S2 in R3 centered at the origin: x2 + y2 + z2 = 1. Denote a point on the\nsphere by x = (x, y, z). In the stereographic parameterization of the sphere we use parameters\nξ1 and ξ2 and points on the sphere are (see (6.1)):\nx (ξ1, ξ2) = x(ξ1, ξ2) , y(ξ1, ξ2) , z(ξ1, ξ2) .\nGiven parameters (ξ1, ξ2), the corresponding point on the sphere is that which lies on the line\nthat goes through the north pole N = (0, 0, 1) and the point (ξ1, ξ2 , 0). Note that the north pole\nitself is not attained for any finite values of the parameters.\n(a) Draw a picture showing the above construction. What are the required ranges for ξ1 and ξ2\nif we wish to parameterize the full sphere (except for the north pole)?\n(b) Calculate the functions x(ξ1, ξ2), y(ξ1, ξ2), and z(ξ1, ξ2).\n(c) Calculate the four components of the metric gij (ξ) defined in (6.14). This is the metric on\nthe sphere, described using the ξ parameters The algebra here is a bit messy, although the result\nis quite simple - it is OK to use a symbolic manipulator, like MatLab, Maple, or Mathematica.\n(d) Check your result by computing the area of the sphere using (6.17).\n5. (10 points) Problem 6.2 (restated here for your convenience with added notation)\nExamine the Nambu-Goto action (6.39) for a relativistic string with endpoints attached at (0,0)\nand (a,0). Consider the non-relativistic approximation where |v⊥| ≪c and the oscillations are\nsmall (see (4.3), whose left-hand side should have an absolute value!).\nYou may denote by y the collection of transverse coordinates X2, . . . Xd and write y(t, x), where\nx is the coordinate corresponding to X1 .\nWork in the static gauge. Moreover, parameterize the strings using X1 = x = aσ/σ1. This\nparameterization is allowed for small oscillations. In fact, it is allowed for any motion in which\nX1 is an increasing function along the string.\nShow that the action reduces, up to an additive constant, to the action for a non-relativistic\nstring performing small transverse oscillations. What is the tension and the linear mass density\nof the resulting string? What is the additive constant?\n6. (10 points) Problem 6.5."
    },
    {
      "category": "Resource",
      "title": "hwk5.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-251-string-theory-for-undergraduates-spring-2007/e614374c0a1313d85c95e7034454c563_hwk5.pdf",
      "content": "8.251 - Homework 5\nB. Zwiebach\nSpring 2007\nDue Tuesday, March 13.\n1. (10 points) Problem 6.2 (restated here for your convenience with added notation).\nExamine the Nambu-Goto action (6.39) for a relativistic string with endpoints attached at (0,0)\nand (a,0). Consider the non-relativistic approximation where |v⊥| ≪ c and the oscillations are\nsmall (see (4.3), whose left-hand side should have an absolute value!).\nYou may denote by y the collection of transverse coordinates X2 , . . . Xd and write y(t, x), where\nx is the coordinate corresponding to X1 .\nWork in the static gauge. Moreover, parameterize the strings using X1 = x = aσ/σ1. This\nparameterization is allowed for small oscillations. In fact, it is allowed for any motion in which\nX1 is an increasing function along the string.\nShow that the action reduces, up to an additive constant, to the action for a non-relativistic\nstring performing small transverse oscillations. What is the tension and the linear mass density\nof the resulting string? What is the additive constant?\n2. (5 points) Consider a D1-brane in four-dimensional spacetime. The brane lies on the x3 = 0\nplane and it is rotated an angle θ with respect to the x1 axis in the counterclockwise direction.\nDescribe in full detail the boundary conditions that apply to open strings on this D-brane. Give\nyour answers as a set of conditions on Xμ(τ, σ∗) and Pμ\nσ(τ, σ∗), where μ = 0, 1, 2, 3.\n3. (10 points) Problem 6.4.\n4. (10 points) Problem 6.6.\n5. (15 points) Problem 6.7.\n6. (10 points) Problem 7.3.\n7. (10 points) Problem 7.4.\nI would recommend problem 7.2 for practice."
    },
    {
      "category": "Resource",
      "title": "hwk6.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-251-string-theory-for-undergraduates-spring-2007/33bf0bfc449e34da9d348797df3f4c5d_hwk6.pdf",
      "content": "8.251 - Homework 6\nCorrected 3/17/071\nB. Zwiebach\nSpring 2007\nDue Tuesday, March 20.\n1. (15 points) Three-dimensional motion of closed strings and cusps.\nWe considered in lecture the closed string motion described by\nX(t, σ) =\nF(u) + G(v) ,\nwith u = ct + σ , v = ct - σ .\n(1)\nHere σ ∼ σ + σ1, where σ1 = E/T0 and E is the energy of the string. We showed that\n|F(u)|2 = |G(v)|2 = 1 ,\n(2)\nF(u + σ1) = F(u)\nand G(v + σ1) = G(v) .\n(3)\nEquations (2) and (3) imply that F(u) and G(v) can be described as two independent closed\nparameterized paths on the surface of a unit two-sphere. We assumed that the paths intersect\nat u = u0 and v = v0\nF(u0) = G(v0) .\n(4)\nThe quantities u0 and v0 define a time t0 and position σ0. We showed that at t = t0, the point\nσ = σ0 on the string moves with the speed of light in the direction of F(u0).\n(a) We choose a coordinate system so that the cusp generated by (4) appears at the origin:\nF(u0) + G(v0) = 0. Use the Taylor expansions of F(u) and G(v) around u0 and v0 to prove\nthat for σ near σ0,\nX(t0, σ) = T(σ - σ0)2 + R(σ - σ0)3 + . . . ,\n(5)\nwhere the vectors Tand Rare given by\n\nT=\nF(u0) + G(v0) ,\nR=\nF(u0) - G(v0) .\n(6)\nAssume that the intersection of the paths on the two-sphere indicated in equation (4)\nis regular: the paths are not parallel at the intersection and neither F(u0) nor G(v0)\nvanishes. Explain why Tis non-zero and orthogonal to F(u0). In general Rdoes not\nvanish, but it may under special conditions.\n(b) One can use equation (5) to show that the cusp opens up along the direction of the vector\nTand is contained in the plane spanned by Tand R. For this, align the positive y axis\nalong T, position the x axis so that Rlies on the (x, y) plane, and demonstrate that near\nthe cusp y ∼ x2/3 . In what plane does the velocity of the cusp lie?\nProblem 1(d) was revised.\n\n(c) Consider the functions F(u) and G(v) given by\nF(u) = σ1 sin 2πu , - cos 2πu, 0 ,\nG(v) = σ1 sin 4πv , 0 , - cos 4πv .\n(7)\n2π\nσ1\nσ1\n4π\nσ1\nσ1\nVerify that the conditions in (2) and (3) are satisfied. For the cusp at t = σ = 0 give its\ndirection, the plane it lies on, and its velocity. Draw a sketch.\n(d) Show that the motion of the closed string has period σ1/(4c). How many cusps are formed\nduring a period? (Hint: recall that you found in Problem (7.3) an example of a situation\nin which the string returns to its original position in less time than the function F(ct + σ)\ntakes to repeat itself. In fact, any free closed string, when viewed in its rest frame, will\nreturn to its original position in time σ1/(2c), where σ1 is the period of the functions F\nand G.)\n2. (5 points) Gravitational lensing by a cosmic string\nA cosmic string produces a conical deficit angle ∆. An observer is a distance d from the cosmic\nstring and a quasar is a distance l from the cosmic string. The position of the quasar is such\nthat the observer sees a double image, separated by an angle δφ. Calculate δφ in terms of ∆, d,\nand l, in the approximation that ∆ is small.\n3. (10 points) Problem 7.5.\n4. (5 points) Problem 8.1.\n5. (10 points) Problem 8.3.\n6. (10 points) Problem 8.5.\nI recommend Problem 8.2 as good practice to reinforce concepts."
    },
    {
      "category": "Resource",
      "title": "hwk7.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-251-string-theory-for-undergraduates-spring-2007/51949ae14435789a2c06c879235d22ae_hwk7.pdf",
      "content": "8.251 - Homework 7\nB. Zwiebach\nSpring 2007\nDue Thursday, April 5.\n1. (10 points) Problem 8.6\n2. (10 points) Problem 9.2\n3. (15 points) Problem 9.3.\n4. (20 points) Problem 9.4."
    },
    {
      "category": "Resource",
      "title": "hwk8.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-251-string-theory-for-undergraduates-spring-2007/ce66f56d85495be4ef425a592bbe9238_hwk8.pdf",
      "content": "R\n8.251 - Homework 8\nB. Zwiebach\nSpring 2007\nDue Thursday, April 12.\n1. (15 points) Closed strings in the light-cone gauge.\nConsider a closed string for which\nX(2)(τ, σ) =\n√\n2α′\na sin(τ -σ) + b cos(τ -σ) + a sin(τ + σ) + b cos(τ + σ) ,\nand all other transverse coordinates XI(τ, σ) vanish. In the above, a, b, a , and b are real constants.\nNote that a and b are the coefficients of waves that propagate towards increasing σ while a and\nb are the coefficients of waves that propagate towards decreasing σ. As usual for closed strings,\nwe set X+(τ, σ) = α ′ p+τ and use σ ∈[0, 2π].\n(a) As it turns out, it is not possible to generate a solution of the equations of motion for\ncompletely arbitrary values of the constants a, b, a , and b.\nExamine the calculation of\nX-(τ, σ) and derive the constraint that the constants must satisfy.\n(b) Your constraint must allow a = b = a = b = r. Use these values to calculate X-(τ, σ) and\nto determine the mass of this string.\n2. (10 points) Problem 10.2.\n3. (10 points) Problem 10.5.\n4. (15 points) Problem 10.6.\n5. (20 points) Problem 10.7. A slightly improved version of the problem is reproduced here!\nThe purpose of this problem is to understand the massive version of Maxwell fields. We will see\nthat in D-dimensional spacetime a massive vector field has (D -1) degrees of freedom.\nConsider the action S =\ndDx L with\nL = -4\n1 FμνF μν -2\n1 m 2AμAμ -2\n1 ∂μφ ∂μφ + mAμ ∂μφ .\nThe first term in L is the familiar one for the Maxwell field. The second looks like a mass term\nfor the Maxwell field, but alone would not suffice. The extra terms show a real scalar field φ\nthat, as we shall see, is eaten to give the gauge field a mass.\n(a) Show that the Lagrangian L is invariant under the infinitesimal gauge transformation\nδAμ = ∂μo ,\nδφ = . . . ,\nwhere the dots denote an expression that you must determine. While the gauge field has\nthe familiar Maxwell gauge transformation, it is unusual to have a real scalar field with a\ngauge transformation.\n\n(b) Vary the action and write down the field equations for Aμ and for φ.\n(c) Argue that the gauge transformations allow us to set φ = 0. Since the field φ disappears\nfrom sight, we say it is eaten. What do the field equations in part (b) simplify into?\n(d) Write the simplified equations in momentum space and show that for p2 =\n2 there are\n\n-m\nno nontrivial solutions, while for p2 = -m2 the solution implies that there are D-1 degrees\nof freedom. (It may be useful to use a Lorentz transformation to represent the vector pμ\nwhich satisfies p2 = -m2 as a vector that has a component only in one direction.)"
    },
    {
      "category": "Resource",
      "title": "hwk9.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-251-string-theory-for-undergraduates-spring-2007/b12e9dac037667bc6c898ecece0c51b9_hwk9.pdf",
      "content": "8.251 - Homework 9\nCorrected 4/16/071\nB. Zwiebach\nSpring 2007\nDue Wednesday, April 18.\n1. (10 points) Problem 11.1.\n2. (10 points) Problem 11.2.\n3. (10 points) Problem 11.5.\n4. (15 points) Problem 11.6.\n5. (15 points) A modified version of Problem 11.7.\nTransformations generated by the light-cone gauge Lorentz generators M+- and M-I .\n(a) Calculate the commutator of M+- (defined in (11.86)) with the light-cone coordinates\nx+(τ), x-(τ), and xI (τ). Show that M+- generates the expected Lorentz transformations\nof these coordinates.\n(b) Calculate the commutator of M-I with the light-cone coordinates x+(τ), x-(τ), and xJ (τ).\nShow that M-I generates the expected Lorentz transformations together with a com\npensating reparameterization of the world-line. Calculate the parameter λ for this repa\nrameterization. [Hint: The reparameterization takes the \"hermiticized\" form δxμ(τ) =\n1 (λ ∂τ xμ + ∂τ xμ λ).]\n6. (10 points) Problem 12.1.\n1Problem 5(b) was fixed: \"from\" changed to \"form.\""
    },
    {
      "category": "Resource",
      "title": "hwk10.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-251-string-theory-for-undergraduates-spring-2007/8d9107e932e369c18a113953f77e6b34_hwk10.pdf",
      "content": "Z\n8.251 - Homework 10\nB. Zwiebach\nSpring 2007\nDue Friday, April 27.\n1. (10 points) Problem 12.3.\n2. (10 points) Problem 12.5.\n3. (10 points) Problem 12.6.\n4. (10 points) Problem 12.7.\n5. (10 points) Problem 12.8.\n6. (10 points) Problem 12.10.\n7. (10 points) Problem 13.1.\n8. (10 points) Problem 13.3.\n9. (10 points) Problem 13.4. As part of (a) also prove that\n2π\n∂X-\n+\nL ⊥\np\nL⊥\n-\ndσ\n=\n,\n-\n- 2π\n∂σ\nL ⊥\nwhich explains that classically L⊥\nmust satisfy the closed string periodicity condition. To do part (b) just use the result stated in\nProb. 8.7.\n10. (10 points) Problem 13.5.\nvanishes because X-, just like any other string coordinate,"
    },
    {
      "category": "Resource",
      "title": "practice.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-251-string-theory-for-undergraduates-spring-2007/9ecdcfceddc533f3d72c197fa2c7deb9_practice.pdf",
      "content": "8.251 - Practice Set\nB. Zwiebach\nSpring 2007\nNot due - solutions will be posted.\n1. Problem 14.4.\n2. Problem 14.5.\n3. Problem 14.8\n4. Problem 14.9\n5. Problem 15.1\n6. Problem 15.6\n7. Problem 17.6."
    },
    {
      "category": "Resource",
      "title": "test2_07p.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-251-string-theory-for-undergraduates-spring-2007/b01fc57a0482e5679b8fa522fd175165_test2_07p.pdf",
      "content": "8.251 Test\nB. Zwiebach\nWednesday May 2, 2007\nOnly personal 2-page notes allowed. Formula sheet on the last page. Test duration: 2 hours.\nPROBLEM 1. (15 points) Conserved current for a complex scalar field.\nConsider the following action for a complex scalar field φ\nS =\ndD xL ,\nL = - ηαβ (∂αφ ∗) (∂β φ) ,\nwhere φ∗ denotes the complex conjugate of φ.\n(a) Assume we change φ as\nφ(x) → e iθφ(x),\nwith θ an arbitrary real constant. What is the corresponding change in φ∗? Verify that these\nchanges are a symmetry of the theory.\n(b) Write the corresponding infinitesimal transformations δφ = . . . and δφ∗ = . . . that arise when\nθ = ε is small. Use these expressions to construct the conserved current jα associated with\nthe symmetry in (a). In using the formula for the conserved current it is possible to treat φ\nand φ∗ as independent fields.\n(c) Write φ(x) = A(x) + iB(x), where A and B are now real scalar fields. What is jα in terms\nof A and B?\nUseful formula: For a field transformation δφa = ε . . . the current is εjα = ∂(∂\n∂\nα\nL\nφa) δφa .\nPROBLEM 2. (25 points) Classical closed string motion in the light-cone gauge.\nA closed string described in light-cone gauge is performing motion in the (x2, x3) plane:\nX1(τ, σ) = 0 ,\nX2(τ, σ) = a cos σ cos τ ,\nX3(τ, σ) = a sin σ cos τ ,\nwhere a, assumed known, is a positive constant with units of length (recall σ ∈ [0, 2π]).\n-\n(a) Calculate X-(τ, σ) using the information about the transverse motion and x0 = 0.\n(b) Use X1(τ, σ) = 0 to solve for p+ in terms of a and α′ .\n(c) Calculate the mass-squared M2 of this string.\nUseful formulas: For closed strings in light-cone gauge:\nX+ = α′ p +τ , and X - ± X-′ = 2α\n′ p + (X I ± XI ′)2 .\n\nPROBLEM 3. Three short questions (20 points).\n(a) Consider the number of physical degrees of freedom needed to describe a graviton in a D-\ndimensional spacetime. Compare this number to the number of physical degrees of freedom\nneeded to describe a graviton together with a Maxwell field and a scalar in D - 1 dimensions.\n(b) Calculate the following commutators in the light-cone gauge quantization of the particle:\n+\n-\n-\n[x , p -] = . . . ,\n[p , x I ] = . . . ,\n[x0 , p +] = . . .\n(c) Express the open string state\nL⊥\n-1L⊥\n-1|p +, pT ⟩\nin terms of normal-ordered oscillators acting on the ground state.\nPROBLEM 4. (40 points) Dp-branes and orientifolds.\nIn order to discuss a Dp-brane we split the string coordinates into\nX+, X- , {Xi}, {Xa} ,\ni = 2, . . . , p, a = p + 1, . . . , d\nNote that we still use the light-cone gauge, but this time the transverse coordinates XI split into\ntwo groups, the coordinates Xi along the brane and the coordinates Xa orthogonal to the brane.\nX1 is taken as one of the coordinates along the brane.\nThe mode expansions for the coordinates Xi work just the same way as those for the XI coor\ndinates (both satisfy Neumann boundary conditions at the endpoints). The oscillators associated\nwith Xi are called αi\nn. As in the previous case of completely free boundary conditions, the con\nstraints ( X ± X′)2 = 0 and the light-cone gauge condition X+ = 2α′p+τ can be used to solve for\nthe derivatives of X-:\nL⊥-in(τ ±σ) ≡ X - ± X-′\n(X i ± Xi′\nXa ± Xa′)2\np+\nn e\n= 4α′p+\n)2 + (\n.\n(1)\nn∈Z\nThe derivatives of the Xi coordinates are expanded in the same way as we previously expanded\nthe XI coordinates, so\n√\n\nX i ± Xi′ =\n2α′\nαi\nne -in(τ ±σ) ≡ Ai(τ, ±σ)\nfor\n\nσ ∈ [0, π] .\n(2)\nn∈Z\nThe canonical commutation relations for Xi and Pτj = X i/(2πα′) then imply that\n\nd\nAi(τ, σ), Aj (τ, σ′) = 4πiα′ δij\nδ(σ - σ′)\nfor\n\nσ ∈ [-π, π] .\n(3)\ndσ\nThese relations in turn imply that the αi\nn obey the usual commutation relations, αn\ni , αm\nj\n=\nn δm+n,0 δij .\nThe Xa coordinates, however, have to be treated differently. Assuming the brane is located\na\nat x\n= 0, the mode expansion for the coordinates Xa(τ, σ) must satisfy the Dirichlet boundary\ncondition Xa(τ, σ∗) = 0 for σ∗ = 0, π. We take\n√\na\nXa(τ, σ) = 2α′\nαne -inτ sin nσ .\n(4)\nn\nn=0\na\na\nNote that there is no momentum p nor a conjugate coordinate x in the above expansion.\n\n(a) Calculate Xa′ ± X a and comment on the relation to (2). State the equal-time commutation\nrelations for the Xa and the Pτb . In analogy to (2), define\nXa′(τ, σ) ± X a(τ, σ) ≡Aa(τ, ±σ) .\nWrite the commutation relations that Aa(τ, σ) must obey. The correct commutation relations\nimply that the αa obey the usual commutation relations, αa , αb\n= n δm+n,0 δab .\nn\nn\nm\n(b) Use Eq. (1) to calculate the new operator L⊥\n0 , defined to be normal-ordered. The answer\nshould involve both the αi\nn and αa\nn oscillators. As before we have 2α′p+p- = L⊥\n0 -1 . Write\nthe new mass-squared formula.\n(c) What are the labels of the ground states of the theory? List all the states with N ⊥ = 0, 1,\nand 2. From the viewpoint of an observer who lives on the brane, what fields correspond to\nthe massless states of the theory?\nAn orientifold plane is obtained when one truncates the theory to the states invariant under an\noperation Ωp that reverses the orientation of all strings and reflects the coordinates normal to the\nplane. (A reflection of a coordinate x is a map x →-x.) Consider adding an orientifold Op-plane\ncoincident with our Dp-brane.\n(d) Fill in the blanks in the right-hand sides for the action of Ωp on the string coordinates\nXi(τ, σ) Ω-1 = . . .\nXa(τ, σ) Ω-1 = . . .\nΩp\np\nΩp\np\nGive the action of Ωp on the oscillators αi\nn and αa\nn.\n(e) What are the states of the orientifold theory for N ⊥ = 0, 1 and 2? Write the operator Ωp in\nterms of the operator N ⊥ .\n\nPossibly Useful Formulas\n\nLight-Cone Coordinates: x ± = √\nx 0 ± x 1 .\nRelativistic Point Particle in Light-Cone Coordinates: x + = p+\nτ , p\n- =\np I p I + m 2\n.\nm2\n2p+\nSlope Parameter: α′ =\n.\n2πT0\nLight-Cone Gauge:\n2 for open strings\nX+ = βα′ p + τ,\nwhere β =\n1 for closed strings ,\nPτμ =\nX μ ,\nPσμ = - 1\nXμ′ ,\n2πα′\n2πα′\n(X ± X′)2 = 0 =⇒\nX - ± X-′ = 2βα\n′p+\n\nX I ± XI ′2 ,\nX μ - Xμ ′′ = 0 .\n√\n√\nOpen String Expansion: Xμ(τ, σ) = xμ\n0 +\n2α′ αμ\n0 τ + i 2α′\nαμ\nn e -inτ cos nσ .\nn\nn=0\n√\nα′ e-inτ\n\nClosed String Expansion: Xμ(τ, σ) = x0\nμ +\n2α′ αμ\n0 τ + i\nαμ\nn e inσ + αμ\nn e -inσ .\nn\nn=0\n√\nα′\nMomentum: αμ\n0 =\n2α′ pμ (open strings) ,\nαμ\n0 =\npμ (closed strings).\nCommutators, Creation and Annihilation Operators:\n\n√\n\nαI , αJ\n= nδm+n,0 δIJ ,\nx0\nI , αJ =\n2α′ i δIJ ,\nx0\nI , αJ = 0 if n = 0 ,\n\nn\nm\nn\n√\n√\n\nfor n ≥ 1:\nαI =\nn a I ,\nαI\n=\nn a I+ ,\na I , a\nJ+ = δIJ δmn .\nn\nn\n-n\nn\nm\nn\nVirasoro Algebra (Open Strings):\ninf\n\nα- = √\nL⊥ ,\nwhere L⊥ ≡\nαI\nαI ,\nL⊥ , αJ = -nαJ\n,\nn\n2α′ p+\nn\nn\nn-p\np\nm\nn\nm+n\np=-inf\n\n√\nL⊥ , L⊥ = (m - n)L⊥\n+\nm(m 2 - 1)(D - 2)δ\nL⊥ , x\nI = -i 2α′ αI ,\nm\nn\nm+n\nm+n,0 ,\nm\nm\ninf\ninf\nL⊥ = α′ I\nI + N ⊥\nN ⊥\nαI αI\nI+\nI\np p\n,\n=\n-p\np =\nn an an ,\np=1\nn=1\nM 2 = -p 2 = 2 p + p - - p I p I = α′\n\nN ⊥ - 1\n\n.\nVirasoro Algebra (Closed Strings):\nαn\n- = p\n+\nα\n′ Ln\n⊥ ,\nα n\n- = p\n+\nα\n′ L n\n⊥ ,\nLn\n⊥ ≡ 1\ninf\nαn\nI\n-p αp\nI ,\nL n\n⊥ ≡ 1\ninf\nα n\nI\n-p α p\nI ,\np=-inf\np=-inf\ninf\ninf\nα′\n\nL⊥\nI\nαI αI\nI+\nI\n0 =\np p I + N ⊥ ,\nN ⊥ =\n-p\np =\nn an an ,\np=1\nn=1\ninf\ninf\nL ⊥ = α′\np I p I + N ⊥ ,\nN ⊥ =\n\nα I α I =\n\nn a I+ a I ,\n-p\np\nn\nn\np=1\nn=1\nM 2 = -p 2 = 2 p + p - - p I p I = 2\nN ⊥ + N ⊥ - 2\n\n,\nN ⊥ = N ⊥ .\nα′"
    },
    {
      "category": "Resource",
      "title": "midterm04_prac.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-251-string-theory-for-undergraduates-spring-2007/a5676c7cf00e100493ae9ba3b7341f58_midterm04_prac.pdf",
      "content": "8.251 Test\nB. Zwiebach\nThursday March 18, 2004\nOnly personal 2 page notes allowed.\nTest duration: 90 minutes.\nProblem 1. (20 points) 4 short questions (5 points each) - Correct answers suffice !\n(a) What are the units (M, L, T) of the Planck constant ti. Why does the Planck constant have\nthe same units in all numbers of spacetime dimensions ?\n(b) Consider the variation S+(X) of the field in the action\nCompute the variation of the action (dropping boundary terms) and write it as\nFind the terms inside the parenthesis.\n(c) Consider two static Dl-branes in four dimensional spacetime (ct, xl, x2, x3). The first one is\nat x1 = x2 = 0 - it stretches along the x3 axis. The second one is parallel to the first and\ngoes though x1 = 0, x2 = a > 0. Sketch the branes. Consider open strings with a E [O, all\nthat stretch from the first brane (a = 0 to the second brane (a = al). State the boundary\nconditions (Free or Dirichlet, with value) for the string coordinates Xp(t, a,) (list the eight\nconditions - p = 0,1,2,3 and a, = 0, 01).\n(d) Use the explicit (but general) expression for Pi (recall that P,\" = &$\n= . . .) to calculate\nthe value of P E X ~ . (Just in case: L = - ~ J ( x ' - x ) ~ - x ~ x ' ~ . )\nProblem 2. (20 points) Rotating open string.\nConsider an open string of energy E which ZE.\nrotates rigidly on a plane with angular velocity w.\nRecall that the length Y of such string is Y =\n(a) What is w in terms of E, To, and c.\n(b) Calculate the magnitude p of the relativistic momentum carried by any one-half of the string\nstretching from the middle point to the endpoint. Give your answer in terms of E and c.\n(c) Let q denote the momentum of a massless particle that carries half of the energy of the string.\nWhat is the value of plq?\n\nProblem 3. (20 points) Constructing the ~'12%~\norbifold (almost!)\nConsider the complex plane z = x + iy subject to the following two identifications\nz ~ T ~ ( z ) = z + l ,\nand ~ ~ T ~ ( z ) = z + e ~ ~ / ~ .\n(eiTl3 is a unit vector at an angle of n/3 with respect to the horizontal axis.) A fundamental domain\n(with its boundary) is the parallelogram with corners at x = 0,1, and einI3.\n(a) Where is the fourth corner of the parallelogram? Make a sketch (large please!) and indicate\nthe identifications on the boundary. Describe the space obtained by the identification.\n(b) Consider now the additional Z3 identification\nx - R(z) = e2\"i/3z.\nWe would like to determine the fixed points of the orbifold action on the parallelogram. One\nfixed point is the origin (which is identified with the other corners). The other two nontrivial\nfixed points zl and 22 (take lzll < lz21) lie on the long diagonal of the parallelogram. Find\nthem. [Hint: make a nice large sketch and examine the action of R on the diagonal.]\n(c) Does the composition TI o R of the R and Tl action leave invariant zl or zz?\nProblem 4. (40 points) Closed strings and time development.\nThe time development of closed strings in the static gauge is governed by usual wave equations and\nparameterization conditions:\n(a) Assume that\n(0,a) = 0, and write the general solution for a(t,\na) in terms of a vector\nfunction $(u) of a single variable.\n(b) What do the parameterization conditions require on @ ?\n(c) On a closed string the parameter a lives on the circle a N a + 01. What condition would you\nimpose on z ( t , a) to implement this feature? What does it imply for $?\n(d) Consider the closed string motion represented by:\n+\n2;lru\n~ ' ( u ) = @ = (-sin\n, cos -\n271u ) .\ndu\nDescribe the string at t = 0.\nConsider henceforth the closed string motion represented by:\n(-\nF]\n,\nF] ) ,\n>\n;lr\nP ( u ) =\nsin [y sin\ncos [y sin\ny\n.\n+\n(e) Find a simplified expression for the value of % 1 $$I\nfor arbitrary values of t and a.\n(f) Find an equation for the smallest time t, > 0 at which cusps suddenly appear.\n(g) Assume\n< y < 27r. What is the maximum number of cusps simultaneously present on the\nclosed string?"
    },
    {
      "category": "Resource",
      "title": "midterm_05_sols.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-251-string-theory-for-undergraduates-spring-2007/c7378c3bda798753a7defaa02f4c121d_midterm_05_sols.pdf",
      "content": "8.251 2005 Midterm Solutions\nQuestion 1\nx = x1\ny = x2\nz = x3\nσ = σ1\nσ = 0\n⎫\nX0(τ, 0),\nX0(τ, σ1) ⎬\nX1(τ, 0),\nX1(τ, σ1)\nall \"Free\"\nX2(τ, 0),\nX2(τ, σ1) ⎭\nX3(τ, 0) = a\nX3(τ, σ1) = 0\nDirichlet\nQuestion 2\nx\ny\ni\n(a)\n(b)\nz ∼ z + i\nF :\n0 ≤ y < 1\nM :\ninfinite cylinder\nz ∼ 2z\n\nZ\nZ\nZ\nZ\nThis scales z, keeping the argument unchanged.\nF : 1 ≤|z| < 2\nM :\ntorus\nTechnically we should also include the point z = 0.\nQuestion 3\nS =\nd3 x (A0F12 + A1F20 + A2F01)\nδS =\nd3 x (δA0F12 + A1(∂2δA0) - A2∂1(δA0))\n=\nd3 x (δA0F12 - δA0∂2A1 + (∂1A2)δA0)\nδS =\nd3xδA0(2F12)\nEOM:\nF12 = 0\nQuestion 4\nδ = 8πGT0\nδ should have no units with suitable c's and ~'s\n(a) Units of GT0?\nGM 2\nF =\nr2\nL2\nL L2\n[G] = [F ]\n= M\nM 2\nT 2 M 2\nL3\n[G] = T 2M\nML\n[T0] = T 2\n\nL4\n[GT0] =\nthus need a c 4\n→\nT 4\n8πGT0\nδ =\nc4\n(b) Mass density μ0 = T0\nc\n\nT0\nc2\n�\n3 × 108\n2π\n= δ\n=\n0.5\nc2\n· 8πG\n360 60 60\n2π 4 (6.67 × 10-11)\n·\n·\n·\n·\nT0\nkg\n= 1.30 × 1020\n!\nc2\nm\nQuestion 5\ndr\nr\n(a)\nv = ωr\n(dm)ωr\ndp = q\n1 - ω\nc\n2r2\ndE\nT0dr\nbut dm =\n=\nc2\nc2\nT0ω\nrdr\ndp =\nq\nc2\nω2 r2\n1 -\nc\nT0ω\nr2dr\ndJ = rdp =\nq\nc2\nω2r2\n1 -\nc\n(b)\nZ l/2 T0ω\nr2dr\nJ = 2\nq\nc2\nω2r2\n1 -\nc\nωr\nc\nlet:\n= x\nr =\nx\nc\nω\nT0ω Z 1 c 3\nx2dx\nJ = 2 c2 ·\nω\n√\n1 - x2\n\n|\n{z\n}\n\n|\n{z\n}\nT0c Z 1\nx2dx\nπ T0c\nJ = 2\n=\nω2\n√\n1 - x2\n2 ω2\nπ\nl\n2c\nω\n= c\nω =\nl\n2c\nπT0c\nω =\n=\n2 E\nE\nπ T0\nπ T0cE2\nE2\nJ =\n=\n2 π2T0\n2c2\n2πT0c\nQuestion 6\n\nX~ (t, σ) =\nF~(u) + G~(~v)\n(a)\nX~ (t, σ + σ1) = X~ (t, σ)\nF~(u, +σ1) + G~(v - σ1) = F~(u) + G~(v)\nF~(u + σ1) - F~(u) = G~(v) - G~(v - σ1)\n(b)\nf~(u + σ1) + α~(u + σ1) - f~(u) - α~(u) = ~g(v) + βv\n~ - ~g(v - σ1) + β~(v - σ1)\n~\n= β ~σ1\nασ1\nα~ = β~\n→\n\nX~ (t, σ) =\nf~(u) + ~\ng(u) + ~\nαu + ~\nαv\n\n= α~(u + v) +\nf~(u) + ~g(v)\n\nX~ (t, σ) = αct\n~\n+\nf~(u) + ~g(v)\n(c)\nP~τ\nT0 ∂~x\n= c2 ∂t\nP~τ = T0 α~ + T0\nf~0(ct + σ) + g~0(ct - σ)\n\nc\n2c\nP~\nZ σ1\nP~τ dσ = T0 σ1α~ + T0\nZ σ1 ∂\nf~(ct + σ) - ~g(ct - σ)\n\ndσ\nc\n2c\n∂σ\n0, by periodicity of f and g\nP~ = T0σ1 α~\nc\nSince σ1 = T\nE\n0 , we can also write:\nP~ = E α~\nc\n\nQuestion 7\nE1\nE2\nP\nO\nConsider an arbitrary point P on the string. If each crawler travels L/4, the two endpoints E1\nand E2 are separated along the ellipse by L/2. Moreover, they are opposite, and the midpoint of\nE1E2 is the origin. Thus Pwill go to the origin at t = L\nc . Since P is arbitrary, the ellipse collapses\nto the origin after time\nL\nc .\nComment: You may convince yourself that any curve C with inversion symmetry in the plane (if\n~a ∈C, then (-~a) ∈C) will collapse to zero size."
    },
    {
      "category": "Resource",
      "title": "midterm_05.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-251-string-theory-for-undergraduates-spring-2007/75bbca72c08586caeb343f4691c19ce7_midterm_05.pdf",
      "content": "8.251 Test\nB. Zwiebach\nWednesday March 16, 2005\nOnly personal 2 page notes allowed. Test duration: 60 minutes.\nProblem 1. (10 points) Boundary conditions for open strings.\nConsider two static D2-branes in four dimensional spacetime (ct, x1, x2, x3). The first one is at\nx3 = 0. The second one is parallel to the first and is located at x3 = a > 0. Sketch the branes.\nConsider open strings with σ ∈ [0, σ1] that stretch from the second brane (σ = 0) to the first brane\n(σ = σ1).\nState the boundary conditions (Free or Dirichlet, with value) for the string coordinates Xμ(t, σ )\n∗\n(list the eight conditions - μ = 0, 1, 2, 3 and σ = 0, σ1).\n∗\nProblem 2. (10 points) Spaces constructed by identifications.\nGive a (simple!) fundamental domain F and describe the resulting space M for each of the following\n(single) identifications acting on the complex plane z = x + iy:\n(a) z ∼ z + i.\n(b) z ∼ 2z.\nProblem 3. (15 points) Variation of an action\nConsider the Chern-Simons action for three-dimensional electromagnetism:\nS =\ndt\nd2 x A0F12 + A1F20 + A2F01 .\nRecall that the field strength Fμν = ∂μAν - ∂ν Aμ. Find the equation of motion resulting from\nthe variation of the gauge field component A0 (as usual, ignore boundary terms). The equation of\nmotion can be written fully in terms of field strengths.\nProblem 4. (10 points) How heavy is a cosmic string?\nA nearby relativistic cosmic string of tension T0 produces a cylindrical gravitational lens in which\ntwo images of a single faraway source would be separate by an angle\nδ = 8πGT0 .\n(1)\nThis formula is given in units where c and are set equal to one, the angle δ is measured in radians,\nand G ≃ 6.7 × 10-11 m3/kg s2 is Newton's constant (c = 3 × 108m/s, = 1.06 × 10-34 kg.m2/s.)\n·\n(a) Complete (1) by adding whatever factors of c and/or are needed.\n(b) A string produces the plausible value of δ = 0.5 arc-seconds (degree = 60 arc-minutes, arc-\nminute = 60 arc-seconds). What is the linear mass density of such string in kg/m?\n\nProblem 5. (20 points) Angular momentum of a rotating open string.\nAn open string of length l and energy E rotates rigidly with angular velocity ω. Recall that ω 2\nl = c\nand l = 2 E .\nπ T0\n(a) Introduce a radial length r along the string and let dr denote a small piece of string a distance\nr from the center. What is the magnitude dp of the (relativistic) momentum carried by this\nsmall piece of string ? What is the magnitude dJ of the angular momentum carried by this\nsmall piece of string? Both answers should be in terms of ω, T0, r, dr and constants.\n(b) Use integration to calculate the total angular momentum carried by the rotating string. Give\nyour answer in terms of the energy E of the string and the string tension T0.\nUseful integral:\n\n1 √x\n-\ndx\nx2 = π\n4 .\nProblem 6. (25 points) Momentum of closed strings.\nFor a free closed string we have\n\nX(t, σ) =\nF(u) + G(v) ,\nwith u = ct + σ , v = ct - σ .\n(1)\n(a) Demonstrate that the periodicity condition σ ∼ σ + σ1 (σ1 = E/T0) relates the lack of\nperiodicity of F(u) to the lack of periodicity of G(v).\n(b) We now write\nF(u) = f(u) +\nand\n\ng(v) +\nα u ,\nG(v) =\nβ v ,\nwhere fand g are strictly periodic functions with period σ1 and αand βare constant vectors.\nHow does the result in (a) relate αand β?\nPlug back in (1) to find X(t, σ) in terms of f(u),g(v), α, ct, and possibly σ.\n(c) The momentum density (per unit σ) carried of the string is Pτ = T\nc2\n0 ∂\n∂t\nX. Calculate the total\nmomentum pcarried by the string in terms of the vector αand other constants.\nProblem 7. (10 points) You learned that a closed string stretched along a circle and released with\nzero initial velocity will contract to zero size at some later time. Consider a closed string that is\nstretched along an ellipse and is released with zero initial velocity. Will it contract to zero size?\nIf yes, why? if not, why not? A complete answer requires a precise justification but, in fact, no\ncalculation."
    },
    {
      "category": "Resource",
      "title": "final_07.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-251-string-theory-for-undergraduates-spring-2007/1ac27d48fa5413f423aa295168f5af15_final_07.pdf",
      "content": "X\n\nY\n\n8.251 Final Exam\nB. Zwiebach\nWednesday May 23, 2007\nOnly personal 3-page notes allowed.\nFormula sheets on the last two pages.\nTest duration: 3 hours.\nPROBLEM 1. (25 points) Quantum version of the rotating open string.\nWe have learned that in the classical theory a rigidly rotating open string has angular momentum\nJ = α ′ M2 .\nIn this problem we explore how this relation is modified for general states in the\nquantum theory.\nWe focus on the (Hermitian) angular momentum operator J in the (x2, x3) plane:\ninf\nM23\n(2) α(3)\n(3) α(2)\nJ =\n= -i\nn α-n\nn -α-n\nn\n.\nn=1\nIn the relation\nα ′ M2 + 1 = N ⊥ ,\nwe separate out the contributions from the the x2 and x3 directions by writing\ninf\nN ⊥ =\n′ ,\n=\nX\nα(2) α(2) + α(3) α(3) ,\nN23 + N\nN23\n-n\nn\n-n\nn\nn=1\n′\nwhere N denotes the number operator for the other transverse directions.\nTo facilitate our analysis we introduce new oscillators αn and αn defined as\n(α(2) + iα(3)\n(α(2) -iα(3)\nαn ≡√\nn\nn ) ,\nα n ≡√\nn\nn ) .\nNote that (αn)+ = α -n.\n(a) Give the commutators of the αn and αn oscillators. Rewite J in terms of the αn and αn\noscillators. Rewite N23 in terms of the αn and α n oscillators.\n(b) Consider general states of the theory, now written in terms of the αn and αn oscillators:\ninf\n|λi = . . .\n(α-k)λk ( α-k)λk |p +, ~pT i\nk=1\nwhere λk and λ k are arbitrary positive integers and the dots represent products of oscillators\nin directions other than two and three. Give the eigenvalues of J and N23 on the state |λi.\n(c) Formulate and prove an inequality that relates the eigenvalues of J and those of 1 + α ′ M2 .\n[Suggestion: begin by comparing the eigenvalues of J to those of N23.]\n(d) Calculate both J and 1 + α ′ M2 for the state (α-1)N|p+, ~pT i.\n\nZ\nZ\nPROBLEM 2. (25 points) Cosmic string in de Sitter space.\nThe Nambu-Goto action on a curved spacetime with metric gμν(x) can be written as before\nq\nS = -2πα′\ndτdσ\n(X · X′)2 -(X )2(X′)2\nwhere all dot products use the metric gμν (instead of the flat Minkowski metric ημν)\nX\nX ′ = gμν(X)X μXν′ ,\n(X )2 = gμν(X)X μX ν ,\n(X ′ )2 = gμν(X)X ′ μX ′ν .\n·\nWe consider strings in an expanding four-dimensional de Sitter spacetime, for which the metric gμν\ncan be taken to be diagonal, with values\ng00 = -1 ,\ng11 = g22 = g33 = e 2Ht .\nWe are taking c = ~ = 1. The Hubble constant H has natural units of one over length (or one over\ntime) so that Ht is dimensionless.\n(a) Assume X0 ≡t = τ and write Xμ = {X0 , X~ }. Write the Nambu-Goto action in terms of t\nand σ derivatives of X~ .\n(b) Consider now a circular string on the (x1, x2) plane, namely\nX1(t, σ) = r(t) cos σ ,\nX2(t, σ) = r(t) sin σ ,\nσ ∈[0, 2π] ,\nwhere r(t) is a radius function to be determined. Use this ansatz to simplify the string action\nand perform the integration over σ. Write the resulting action as\nS =\ndt L( r(t), r(t); t)\nand give the explicit form of L( r(t), r(t); t), which is explicitly time dependent.\nBecause\nof the e2Ht factors in the metric, the physically measured radius of the string is actually\nR(t) = eHt r(t). Write the Lagrangian in terms of R and R .\n(c) Consider strings with constant R and use the Lagrangian to give the potential V (R) for such\nstrings. Plot this potential and verify that it is well-defined only if R ≤1/H. Find a critical\npoint of the potential and the corresponding value of R (in terms of H). Is this static string\nin stable equilibrium?\n(d) Use the Lagrangian for R and R to calculate the corresponding Hamiltonian, expressed as\na function of R and R . Simplify your answer. Is this Hamiltonian function conserved for\nphysical motion?\n\nX\nX\nX\n\nPROBLEM 3. Three short questions (20 points).\n(a) Express the open string state\nL⊥\n-2\n-2L⊥ |0i\nin terms of normal-ordered oscillators acting on the zero-momentum ground state |0i.\n(b) State the field content of the massless spectrum of a configuration of N coincident Dp-branes\n(let d denote the number of spatial dimensions). What happens to the massless spectrum\nwhen we add a coincident orientifold Op-plane?\n(c) Two infinite D2-branes intersect at right angles. Recalling that the light-cone gauge requires\nthat the X1 coordinate have Neumann boundary conditions at both ends, we take the first\nD2-brane to extend in the 1- and 2-directions, and the second D2-brane to extend in the 1\nand 3-directions. Calculate the value of M2 for all tachyons in the sector that contains the\nopen strings that stretch from one brane to the other. Where do these tachyons live?\nPROBLEM 4. (30 points) Counting states in Heterotic SO(32) string theory.\nIn heterotic (closed) string theory the right-moving part of the theory is that of an open super\nstring. It has an NS sector whose states are built with oscillators αI\nand bI\nacting on the NS\n-n\n-r\nvacuum. It also has an R sector whose states are built with oscillators αI\nand dI\nacting on the\n-n\n-n\nR ground states. The index I runs over 8 values. The standard GSO projection down to NS+ and\nR-applies.\nThe left-moving part of the theory is that of a peculiar bosonic open string. The 24 transverse\ncoordinates split into eight bosonic coordinates XI with oscillators α-\nI\nn and 16 peculiar bosonic\ncoordinates. A surprising fact of two-dimensional physics allows us to replace these 16 coordinates\nby 32 two-dimensional left-moving fermion fields λA, with A = 1, 2, . . . , 32. The (anticommuting)\nfermion fields λA imply that the left-moving part of the theory also has NS ′ and R ′ sectors, denoted\nwith primes to differentiate them from the standard NS and R sectors of the open superstring.\nThe left NS ′ sector is built with oscillators αI\nand λA acting on the vacuum NS ′ iL, declared\n-n\n-r\nto have (-1)FL = +1:\n|\n(-1)FL |NS ′ iL = +|NS ′ iL .\nThe naive mass formula in this sector is\nα ′ M2 = 1\nα I α I + 1\nr λA λA .\nL\n-n\nn\n-r\nr\n=0\nn\nr∈Z+ 1\nThe left R ′ sector is built with oscillators αI\nand λA\nacting on a set of R ′ ground states. The\n-n\n-n\nnaive mass formula in this sector is\nα ′ M2 = 1\nα I α I + n λA λA\n.\nL\n-n\nn\n-n\nn\n2 n=0\nMomentum labels are not needed in this problem so they are omitted throughout.\n\nP\n(a) Consider the left NS ′ sector. Write the precise mass-squared formula with normal-ordered\noscillators and the appropriate normal-ordering constant. The GSO projection here keeps the\nstates with (-1)FL = +1; this defines the left NS ′ + sector. Write explicitly and count the\nstates we keep for the three lowest mass levels, indicating the corresponding values of α ′ ML\n2 .\n[This is a long list.]\n(b) Consider the left R ′ sector.\nWrite the precise mass-squared formula with normal-ordered\noscillators and the appropriate normal-ordering constant. We have here 32 zero modes λA\n0 .\nAs usual, half of the ground states have (-1)FL = +1 and the other half have (-1)FL = -1.\nLet |RαiL denote ground states with (-1)FL = +1. How many ground states |RαiL are there?\nKeep only states with (-1)FL = +1; this defines the left R ′ + sector. Write explicitly and\ncount the states we keep for the two lowest mass levels, indicating the corresponding values\nof α ′ ML\n2 . [This is a shorter list.]\nAt any mass level α ′ M2 = 4k of the heterotic string, the spacetime bosons are obtained by\n\"tensoring\" all the left states (NS ′ + and R ′ +) with α ′ ML\n2 = k with the right-moving NS+ states\nwith α ′ MR\n2 = k. Similarly, the spacetime fermions are obtained by tensoring all the left states\n(NS ′ + and R ′ +) with α ′ ML\n2 = k with the right-moving R-states with α ′ MR\n2 = k. At any mass\nlevel where either left states or right states are missing, one cannot form heterotic string states.\n(c) Are there tachyonic states in heterotic string theory? Write out the massless states of the\ntheory (bosons and fermions) and describe the fields associated with the bosons. Calculate\nthe total number of states in heterotic string theory (bosons plus fermions) at α ′ M2 = 4.\n(This is a large number!)\n(d) Write a generating function fL(x) =\nr a(r)xr for the full set of (GSO truncated) states in\nthe left-moving sector (include both NS ′ + and R ′ + states). Use the convention where a(r)\ncounts the number of states with α ′ ML\n2 = r.\n\nX\nr\nr\n\nX\nX\nX\nX\nX\nPossibly Useful Formulas\nLight-Cone Coordinates: x ± = √\n2 x 0 ± x 1 .\nRelativistic Point Particle in Light-Cone Coordinates: x + = p+\nτ ,\np - =\n\np I p I + m 2\n.\nm2\n2p+\nSlope Parameter: α ′ =\n.\n2πT0\nLight-Cone Gauge:\nfor open strings\nX+ = βα ′ p + τ,\nwhere β =\nfor closed strings ,\nPτμ\n2πα′ X μ\nPσμ\n-2πα′ Xμ′\n=\n,\n=\n,\n(X ± X ′ )2 = 0\n= ⇒\nX - ± X-′ = 2βα\n′ p+\n\nX I ± XI ′2 ,\n\n′′\nXμ -Xμ\n= 0 .\nμ\n-inτ\nOpen String Expansion: Xμ(τ, σ) = x0 +\n√\n2α′ αμ\n0 τ + i\n√\n2α′\n1 αn\nμ e\ncos nσ .\nn\nn=0\nClosed String Expansion: Xμ(τ, σ) = x0\nμ +\n√\n2α′ α0\nμ τ + i\nα′ X e-inτ\nαn\nμ e inσ + α n\nμ e -inσ\n.\nn\nn=0\nαμ\nMomentum: αμ\n0 =\n√\n2α′ pμ (open strings) ,\n0 =\nα′\npμ (closed strings).\nCommutators, Creation and Annihilation Operators:\nαI\nI\ni δIJ\nI\n, αJ\n= nδm+n,0 δIJ ,\nx , αJ\n=\n√\n2α′\n,\nx , αJ\n= 0 if n 6= 0 ,\nn\nm\nn\nαI\nI\nαI\nI+\nI\nJ+\nfor n ≥1:\n= √n a\n,\n= √n a\n,\na\n, a\n= δIJ δmn .\nn\nn\n-n\nn\nm\nn\nVirasoro Algebra (Open Strings):\ninf\n\nα- = √\n2α′ p+ L⊥ ,\nwhere L⊥ ≡2\nαI\nαI ,\nL⊥ , αJ\n= -nαJ\n,\nn\nn\nn\nn-p\np\nm\nn\nm+n\np=-inf\n\nL⊥ , L⊥ =\nn)L⊥\n+\nm(m 2 -1)(D -2)δm+n,0 ,\nL⊥ , x I\n= -i\n√\n2α′ αI ,\nm\nn\n(m -\nm+n\nm\nm\ninf\ninf\nL⊥\nα ′\nI\nI\nN ⊥\nαI\nαI\nI+\nI\n0 =\np p + N ⊥ ,\n=\n-p\np =\nn a n a n ,\np=1\nn=1\nM 2 = -p 2 = 2 p + p - -p I p I = α\n′\n\nN ⊥ -1\n\n.\nVirasoro Algebra (Closed Strings):\nr\nr\ninf\ninf\nαn\n- = p\n+\nα\n′ Ln\n⊥ ,\nα n\n- = p\n+\nα\n′ L n\n⊥ ,\nLn\n⊥ ≡ 1\nαn\nI\n-p αp\nI ,\nL n\n⊥ ≡ 1\nα n\nI\n-p α p\nI ,\np=-inf\np=-inf\ninf\ninf\nα ′\nX\nX\nL⊥\nI\nI\nN ⊥\nαI\nαI\nI+\nI\n0 =\np p + N ⊥ ,\n=\n-p\np =\nn a n an ,\np=1\nn=1\ninf\ninf\nα ′\nX\nX\nL ⊥ =\np I p I + N ⊥ ,\nN ⊥ =\nα I\nα I =\nn a I+ a I ,\n-p\np\nn\nn\np=1\nn=1\nM 2 = -p 2 = 2 p + p - -p I p I = α\n′\n\nN ⊥ + N ⊥ -2\n\n,\nN ⊥ = N ⊥ .\n\nh\n\nY\nY\ni\n\nY\n\nNS-sector:\nGround state: (-1)F = -1 : |NSi.\nNormal ordering constant for NS fermion: aNS =\n-48.\nMass-squared: α ′ M2 = -2\n1 + N ⊥ .\nα ′ M2 = -1 , N ⊥ = 0 : |NSi ,\nα ′ M2 = 0 , N ⊥ = 1 : bI\nNSi ,\n-1/2|\nα ′ M2\n\nαI\nbJ\n\n=\n, N ⊥ = 1 :\n-1 , bI\n|NSi ,\n-1/2 -1/2\nα ′ M2\n\nαI\nbJ\nbK\n\n= 1 , N ⊥ =\n:\n-1bJ\n, bI\n, bI\nNSi .\n-1/2\n-3/2\n-1/2 -1/2 -1/2 |\nNS+ sector: (-1)F = +1. Integer α ′ M2 .\nR-sector:\n8 zero modes:\n4 creation + 4 annihilation. 4 creation\n24 = 16 ground states.\n→\n→\nGround states: (-1)F = -1 : |Rai, a = 1, . . . 8 ,\nand\n(-1)F = +1 : |Ra i, a = 1 , . . . 8 .\nNormal ordering constant for Ramond fermion: aR = + 24.\nMass-squared: α ′ M2 = N ⊥ .\nα ′ M2 = 0 :\n|Rai\n|Ra i\nα ′ M2\nαI\nαI\n= 1 :\n-1|Rai , dI |Ra i\n-1|Ra i , dI |Rai,\n-1\n-1\nα ′ M2 = 2 :\n{αI\n-1αJ\n-1dJ\n\n-2 , αI\n-1 , dI\nR\n-2 , αI\n-1 , dI\n{αI\n-1αJ\n-1dJ\n-1}|Rai\n\n-1}|\nai\n{αI\n-1 , dI\n{αI\n-1 , dI\n-1dJ\n-2}|Ra i\n-1dJ\n-2}|Rai\nLeft of bars: (-1)F = -1, the R-sector. Right of bars: (-1)F = +1, the R+ sector.\ninf\n1 + x n-1\n2 8\ninf\n1 - x n-1\n2 8\ninf\n1 + x n 8\nfNS+(x)\n= fR-(x)\n=\nxn\n2√x\n-\n=\n.\n1 -\n1 -xn\nn=1 1 -xn\nn=1\nn=1\nDp-brane: Oscillators: αi\nn,\ni = 2, 3, . . . , p and αa\nn ,\na = p + 1, . . . , d.\nGround states: |p+, ~pi ,\np~ = (p2 , . . . pp).\nMass-squared: α ′ M2 = -1 + Pinf\nαi\nαi + αa αa .\nn=1\n-n\nn\n-n\nn\nDp-brane and coincident Op:\nΩp action: Ωp αi Ω-1 = (-1)nαi ,\nΩp αa Ω-1 = (-1)nαa ,\nground states invariant.\nn\np\nn\nn\np\nn\nN parallel Dp-branes: Ground states |p+, ~p ; [j k]i ,\nj, k = 1, 2, . . . , N, p~ = (p2 , . . . pp).\nIf present, Ωp action on the ground states\nΩp|p+ , ~p ; [j k]i = |p+, ~p ; [k j]i\nNormal ordering constants: aNN = aDD = -24 ,\naND = aDN = + 48."
    },
    {
      "category": "Resource",
      "title": "midterm_07.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-251-string-theory-for-undergraduates-spring-2007/b22cc820187b199bed8ffcfa2fc60a1e_midterm_07.pdf",
      "content": "8.251 Test\nB. Zwiebach\nWednesday March 21, 2007\nOnly personal 2-page notes allowed. Test duration: 90 minutes.\nProblem 1. (10 points) Boundary conditions for open strings.\nConsider two static D2-branes in four dimensional spacetime (ct, x1, x2, x3). The first one is located\nat x3 = 0 and the second is located at x2 = 0. Sketch the branes. Consider open strings with\nσ ∈ [0, σ1] that stretch from the first brane (σ = 0) to the second brane (σ = σ1).\nState the boundary conditions (Free or Dirichlet, with value) for the string coordinates Xμ(t, σ∗)\n(list the eight conditions - μ = 0, 1, 2, 3 and σ∗ = 0, σ1).\nProblem 2. (20 points) Conical spaces\nConsider the complex z plane, with the identification\nz ∼ e 2πi/3 z .\n(a) On the diagram on the last page of the test, you are to draw a fundamental domain for this\nspace. One boundary of the fundamental domain is already drawn: the real z axis. The\nfundamental domain is to lie above this line. You are to draw the second boundary. For any\nline that you draw, you should indicate the numerical value of the angle that the line makes\nwith respect to one of the axes of the diagram. [BE SURE TO RIP OFF THE DIAGRAM\nAND TURN IT IN WITH YOUR SOLUTIONS!]\n(b) How many geodesics are there that connect the points A and B? Using a ruler if available,\ndraw these geodesics on the diagram. You may find it useful to draw points or lines outside\nthe fundamemental domain, but you should also show each of these geodesics within the\nfundamental domain.\nProblem 3. (10 points)\nObservations indicate that the expansion of the universe is currently accelerating, an effect\nwhich is possibly caused by a cosmological constant. Although Einstein did not look at it this way,\nthe cosmological constant that he defined is equivalent to assigning a nonzero mass density to the\nvacuum. The observed acceleration implies a vacuum mass density equal to 0.76 ± 0.05 times the\ntotal mass density of the universe, which gives\nρvacuum = 7.6 × 10-27 kg/m3 .\n(This is equal, by the way, to about 4.5 proton masses per cubic meter.) Some physicists are\nexploring ways to explain this effect by introducing modifications to gravity at short distances,\nso it is useful for them to know what length scales might be relevant to such an explanation. If\none assumes that the only relevant parameters are ρvacuum, , and c, one can construct a length\nparameter lvacuum by multiplying powers:\nlvacuum = ρα\nvacuum β c γ .\n(a) What must be the values of α, β, and γ in the above equation?\n\n(b) Given that = 1.055 × 10-34 J·s and c = 2.998 × 108 m/s, what is the numerical value of\nlvacuum? Express your answer in μm, where 1 μm = 10-6 m. (Note that m = meter, s =\nsecond, J = joule = newton·meter.)\nProblem 4. (20 points) The induced metric on a two-dimensional surface.\nA two-dimensional surface in flat three-dimensional space is described by the height function\nz = h(x, y).\nThis means that points on the surface take the form (x, y, h(x, y)). This surface is parameterized\nby x and y. Recall also the formula for the metric gij (ξ) induced on a surface parameterized by\n(ξ1, ξ2) and described by embedding functions x(ξ1, ξ2):\n∂x\n∂x\ngij (ξ) =\n·\n.\n∂ξi\n∂ξj\n(a) Calculate the components of the metric gij in terms of h and its derivatives. Write a formula\nfor gij of the form gij = δij + . . ..\n(b) Write the fully simplified appropriate form of the area integral (A =\ndξ1dξ2√ g).\nProblem 5. (40 points) Motion of an open string stretched between two parallel D2-branes.\nConsider two D2-branes located at z = 0 and z = a > 0 and an open string suspended between\nthem, with the point σ = 0 on the z = 0 brane and the point σ = σ1 on the z = a brane.\nIt is convenient to use a two-component vector x(t, σ) to describe motion in the x and y directions\nand a function z(t, σ) to describe the displacement along z. We then write general solutions of the\nwave equations as follows:\nx(t, σ) =\nF(ct + σ) + G(ct - σ) ,\nz(t, σ) =\nf(ct + σ) + g(ct - σ) .\n(a) Use the boundary conditions to express Gin terms of F, g in terms of f, and to obtain the\nrelevant periodicity conditions. Write your simplified formulae for x(t, σ) and z(t, σ).\n(b) Find the conditions implied by the parameterization conditions\n\n∂X\n1 ∂X\n±\n= 1 .\n∂σ\nc ∂t\nWe observe that the σ = 0 endpoint of the open string traces a circle of radius R on the D2\nbrane as it moves with constant angular velocity ω. The circle is centered around (x, y) = (0, 0).\nAssume that the string has the lowest possible energy consistent with given values of ω and the\nseparation a between the branes. As we will see, both this energy E and the radius R of the circle\nat the D-brane are determined by ω, a, and constants such as c and the string tension T0.\n(c) Write an explicit formula for F(u). Calculate the value of σ1.\n(d) Determine the function f. What is the radius R of the circle traced at the D-brane ? Write\nyour answer in the form ωR = . . ..\nc\n\nNAME\nDiagram for Problem 2, Conical Spaces:\nBE SURE TO RIP OFF THIS PAGE AND TURN IT IN WITH YOUR SOLUTIONS!"
    },
    {
      "category": "Resource",
      "title": "8251test2review.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-251-string-theory-for-undergraduates-spring-2007/8bcc5630863d39204a0dcc8e3c6a1eba_8251test2review.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\nPhysics Department\n8.251: String Theory for Undergraduates\nProf. Barton Zwiebach\nApril 30, 2007\nREVIEW NOTES FOR TEST 2\nNotes by Alan Guth\nI. World-Sheet Currents:\nNoether's Theorem:\nSuppose than an action of the form\nS =\ndξ0 dξ1 . . . dξk L(φa, ∂αφa)\n(1.1)\nis invariant under an infinitesimal variation of the fields\nφa(ξ) → φa(ξ) + δφa(ξ) ,\nwith δφa(ξ) = εiha\ni (φa, ∂αφa)\n(1.2)\nin the sense that the Lagrangian density is changed at most by a total derivative,\nδL = ∂\nεiΛα\n.\n(1.3)\n∂ξα\ni\nThen the currents ji\nα(ξ) defined by\nεiji\nα ≡ ∂(∂\n∂\nα\nL\nφa) δφa - εiΛα\ni\n(1.4)\nare conserved:\n∂αji\nα = 0\n5)\n(for each i).\n(1.\nThis implies that the corresponding charges,\nQi =\ndξ1 . . . dξk ji\n0(ξ) ,\n(1.6)\nare independent of time.\nThe proof is constructed by replacing δL in Eq. (1.3) by an expansion in terms of\nthe derivatives of L and the variation of the fields (1.2), and then using the Lagrangian\nequations of motion.\n\n8.251 REVIEW NOTES FOR TEST 2, SPRING 2007\np. 2\nSEC. I: WORLD-SHEET CURRENTS\nWorld-Sheet Application 1: Conservation of Momentum:\nIdentifying ξ0 ≡τ and ξ1 ≡σ, we can apply this theorem to the string world-sheet.\nDefining X μ ≡∂τ Xμ and Xμ′ ≡∂σ Xμ, the string action can be written\nS = - T0\nτf\ndτ\nσ1\ndσ\n(X · X′)2 -(X )2(X′)2 =\n\ndξ0 dξ1 L(∂0 Xμ, ∂1Xμ) , (1.7)\nc\nτi\nwhich is invariant under the symmetry\nδXμ(τ, σ) = εμ ,\n(1.8)\nwhich describes a uniform spacetime translation of the string coordinates Xμ. (Note that\nthis is really a family of D symmetries, one for each value of the spacetime index μ. But\nI will continue to describe it as one symmetry, in the sense that it forms one multiplet of\nsymmetries.) The corresponding conserved current is\njμ\nα ≡(jμ\n0, jμ\n1 ) =\n∂L ,\n∂L\n=\n\nPμ\nτ , Pμ\nσ\n.\n(1.9)\n∂X μ ∂Xμ′\nMore compactly,\njμ\nα = Pμ\nα .\n(1.10)\nThe conserved charge is the total spacetime momentum of the string:\nσ1\npμ =\nPμ\nτ (τ, σ) dσ .\n(1.11)\nThe above expression gives the conserved momentum as an integral over a line of constant\nτ , but the reparameterization invariance of the string suggests that there is nothing special\nabout such a line. In fact we found that the conservation equation ∂αjμ\nα = 0 implies,\nwith the use of the two-dimensional divergence theorem, that we can write\npμ =\n\nPμ\nτ dσ -Pμ\nσ dτ\n\n,\n(1.12)\nγ\nwhere γ describes a general curve. For open strings γ must begin at one end of the string\nand end at the other, and for closed strings it must wind once around the world-sheet.\n\n8.251 REVIEW NOTES FOR TEST 2, SPRING 2007\np. 3\nSEC. I: WORLD-SHEET CURRENTS\nWorld-Sheet Application 2: Lorentz Symmetry and its Currents:\nLorentz transformations can be described by\nδXμ = εμν Xν ,\nwhere εμν = -ενμ .\n(1.13)\nThe string Lagrangian is invariant under this symmetry, and with Noether's theorem one\nobtains the conserved world-sheet current\nMα\nPα -Xν Pα ,\nwhere\nα = 0 .\n(1.14)\nμν = Xμ\nν\nμ\n∂αMμν\nThe conserved charge is then\nMμν =\nMμν\nτ (τ, σ) dσ =\n\nXμPν\nτ -Xν Pμ\nτ\ndσ ,\n(1.15)\nwhere Mμν = -Mνμ, or it can be written as an integral over a general curve,\nMμν =\nMμν\nτ dσ -Mμν\nσ dτ\n,\n(1.16)\nγ\nanalogous to Eq. (1.12). Mμν is conserved for any spacetime dimension. For the familiar\ncase of four dimensions,\nLi = εijk Mjk\n(1.17)\nis the total angular momentum of the string. The M0i components can be evaluated\neasily in static gauge, giving\nMi0 =\n\nXiPτ0 -X0Pτi\ndσ = p 0\nXi -v i t\n\n,\n(1.18)\ncm\ncm\nwhere\nXi\n= 1\ndσXiPτ0 ,\nv i\n= p\ni\nc .\n(1.19)\ncm\ncm\np\np\nThus, the conservation of Mi0 gives an explicitly time-dependent conservation law, im\nplying that the center of mass position Xi\nmoves at the fixed velocity vi .\ncm\ncm\n\n8.251 REVIEW NOTES FOR TEST 2, SPRING 2007\np. 4\nSEC. II: TENSION, SLOPE PARAMETER, STRING LENGTH, h, AND c\nII. Tension, Slope Parameter, String Length, h, and c:\nBy analyzing the rigidly rotating open string, we found that the energy E and angular\nmomentum J are related by\nJ\n= α′E2 ,\n(2.1)\nh\nwhere\nα′ =\n.\n(2.2)\n2πT0 hc\nIt is traditional to express string quantities in terms of α′, rather than T0. We will also,\nfrom now on, use natural units, which means that we define\n\n(2.3)\nh ≡ c ≡ 1 .\nWe can then write α′ = 1/(2πT0). T0 has the dimension of energy/length, or (energy)2\nin natural units. α′ then has the dimension of 1/(energy)2, or equivalently (length)2, so\nit makes sense to define a \"string length\"\n√\nls =\nα′ .\n(2.4)\nIII. The String in Light-Cone Gauge:\n(If the next few pages seem familiar, it is because they were adapted from Homework 8\nSolutions, Problem 1.)\nWe begin by choosing the worldsheet parameter τ by setting it equal to a linear\ncombination of coordinate values,\nτ ≡\nn · X ,\n(3.1)\nλ\nwhere λ is an arbitrary constant. n is an arbitrary timelike or lightlike vector, where here\nwe will take\n\nnμ = nlc, μ ≡\n√ , √ , 0 , . . . , 0\n,\n(3.2a)\nso nlc · X = X+, and Eq. (3.1) is called the light-cone gauge condition. In Chapter 6 we\nused the same formalism, but with\nnμ = nstatic, μ ≡ (1, 0, . . . , 0) ,\n(3.2b)\nwhich leads to the static gauge condition. Until further notice, the equations here will\napply to both cases, except for statements that refer explicitly to + or - components.\n\n′\n′\n\n8.251 REVIEW NOTES FOR TEST 2, SPRING 2007\np. 5\nSEC. III: THE STRING IN LIGHT-CONE GAUGE\nTo choose a helpful parameterization of σ, we can first decide that we will define σ\nfor some initial value of τ, and then we will determine σ for other values of τ by insisting\nthat the lines of constant σ are orthogonal to the lines of constant τ. This condition is\nwritten mathematically as\n∂X ∂X\n·\n≡X · X′ = 0.\n(3.3)\n∂τ\n∂σ\nThe procedure for constructing such lines of constant σ is described in the textbook in\nthe last paragraph starting on p. 154, where it is used to construct the line σ = 0 for the\ncase of closed strings. But the procedure can be used for both open and closed strings\nand for all σ, except that for open strings the endpoints must be lines of constant σ, and\nhence we cannot impose this procedure to construct the lines σ = 0 or σ = σ1. We can\nshow, however, that Eq. (3.3) nonetheless holds at the endpoints, as a consequence of the\nstring boundary conditions. To do this we will assume that we always have Neumann\nboundary conditions in the direction of n,\nn · Pσ = 0 at open string endpoints,\n(3.4)\na condition necessary for the conservation of n · p, where p is the total momentum of the\nstring.\nWe need to make use of Eq. (3.4) without assuming Eq. (3.3), so that we can demon\nstrate that Eq. (3.3) holds at the endpoints. We begin by writing the general formulas for\nPτμ and Pσμ from Eqs. (6.49) and (6.50) in the textbook, using natural units ( h ≡c ≡1)\nand replacing T0 by 1/(2πα′) (as in Eq. (2.2):\n\nX · X\n\nXμ′ -\n\nX\n2 X μ\nPτμ = -\n\n,\n(3.5a)\n2πα′\nX · X′ 2 - X 2 X′ 2\n\nX · X′\nX μ -\n\nX 2 Xμ′\nPσμ = -\n\n.\n(3.5b)\n2πα′\nX · X′ 2 - X 2 X′ 2\n∂\n\nNote that Eq. (3.1) implies that ∂σ n·X = n·X′ = 0, and n·X = λ, so Eq. (3.5b) implies\nX · X′ λ\nn · Pσ = -2πα′\n\n2 .\n(3.6)\nX · X′\n- X\nX′\nThe denominator of the above expression is never infinite, and λ = 0. Thus, the vanishing\nof n · Pσ at the string endpoints implies that Eq. (3.3) holds at the endpoints, and\nhence holds everywhere for our parameterization. The validity of Eq. (3.3) at the string\nendpoints implies that the construction of lines of constant σ using orthogonality to lines\n\n8.251 REVIEW NOTES FOR TEST 2, SPRING 2007\np. 6\nSEC. III: THE STRING IN LIGHT-CONE GAUGE\nof constant τ will join smoothly with the evolution of the string endpoints, which have\nfixed values of σ.\nUsing Eq. (3.3), Eqs. (3.5) simplify to\n\nX′2 X μ\nPτμ =\n\n,\n(3.7a)\n2πα′\n- X 2 X′ 2\n\nX\nXμ′\nPσμ =\n\n,\n(3.7b)\n\n2πα′\n-\n\nX 2 X′\nfrom which it follows immediately (using Eq. (3.1)) that\n\nX′2 λ\nn · Pτ =\n\n,\n(3.8a)\n\n2πα′\n2 X′\n- X\nn · Pσ = 0 .\n(3.8b)\nFrom Eq. (3.8b) and the equations of motion\n∂Pτμ\n∂Pσμ\n+\n= 0 ,\n(3.9)\n∂τ\n∂σ\nit follows that\n∂ [n · Pτ] = 0 ,\n(3.10)\n∂τ\nor, in other words, n · Pτ is independent of τ.\nWe can simplify these equations further by making a special choice for the definition\nof σ for the initial value of τ. Specifically, we can insist that n · Pτ be a constant. Since\nthe total momentum p is given by\nσ1\nμ\np\n=\ndσ Pτμ ,\n(3.11)\nthe constant n·Pτ prescription is equivalent to assuming that the density of n·p = p+ is\nuniform in σ. From Eq. (3.8a), we see that this uniformity can be achieved by requiring\n\nX′\n\n= constant ,\n(3.12)\n-\n\nX 2\nX′2\n\n8.251 REVIEW NOTES FOR TEST 2, SPRING 2007\np. 7\nSEC. III: THE STRING IN LIGHT-CONE GAUGE\nwhere for convenience we will choose the constant to be one. Solving Eq. (3.12) for\n\nX′2\ngives\nX′ 2 = -X 2 ,\n(3.13)\na condition that can always be achieved by a redefinition of σ. That is, if the condition\ndoes not already hold, we can introduce a new variable σ′(σ) so that\n\n∂X\n∂X\ndσ\n=\n= -X 2 ,\n∂σ′\n∂σ\ndσ′\nor\n\ndσ′\nX′ 2\ndσ =\n-\nX 2 ,\n(3.14)\nwhich can be integrated to determine σ′(σ). Once the new σ′ is defined, the old σ can\nbe forgotten and the new parameter can be renamed σ.\nWith n · Pτ now constant at the initial time τ, Eq. (3.10) can be invoked to show\nthat n · Pτ has a constant value on the entire string worldsheet, which from Eqs. (3.8a)\nand (3.12) is given by\nn · Pτ =\nλ\n.\n(3.15)\n2πα′\nFrom Eq. (3.11),\nn · p = σ1λ .\n(3.16)\n2πα′\nIt is customary to choose σ1 = π for open strings, and 2π for closed strings, so we can\nwrite\n2π\nλ =\n(n · p)α′ = β(n · p)α′ ,\n(3.17)\nσ1\nwhere\n2 for open strings\nβ =\n(3.18)\n1 for closed strings .\nThe light-cone gauge condition (3.1) is then written in final form as\nn · X(τ, σ) = βα′(n · p)τ .\n(3.19)\nFurthermore, Eqs. (3.7) now simplify to\nPτμ =\n1 X μ ,\n2πα′\nPσμ = - 1 Xμ′ ,\n(3.20)\n2πα′\n\n8.251 REVIEW NOTES FOR TEST 2, SPRING 2007\np. 8\nSEC. III: THE STRING IN LIGHT-CONE GAUGE\nand the equation of motion (3.9) simplifies to the wave equation,\nX μ -Xμ ′′ = 0 .\n(3.21)\nThe full set of equations can be further simplified by combining the σ-τ orthogonality\ncondition of Eq. (3.3) with the constant n · Pτ condition of Eq. (3.13), giving\n\n′2\nX ± X\n= 0 .\n(3.22)\nEqs. (3.19), (3.21), and (3.22) then give the full set of equations of motion of the string\nin light-cone gauge. Eqs. (3.20) give simple expressions for the world-sheet momentum\ncurrent Pα in this gauge.\nμ\nUntil this point the equations were valid for any timelike or null vector n in the\ngauge condition of Eq. (3.17), but now we will specialize to the light-cone gauge, with\nn = nlc as defined by Eq. (3.2a), and\nx ± ≡√ (x 0 ± x 1) .\n(3.23)\nThe important advantage of light-cone gauge is that it allows us to use Eq. (3.22) to solve\nexplicitly for one of the components of Xμ. Specifically, Eq. (3.22) becomes\n-2\n\nX + ± X+ ′\nX - ± X-′\n+\n\nX I ± XI ′2 = 0 ,\n(3.24)\nwhere I is summed over the D-2 indices other than + and -. Eq. (3.19) implies that\n+\nX + = n · X = βα′ p\n,\nX+′ = 0 .\n(3.25)\nEq. (3.24) can then be solved for the derivatives of X-, giving\n\nX - ± X-′ = 2βα′p+ X I ± XI ′\n.\n(3.26)\nBy taking linear combinations of the above expression we can find X - and X-′, which\ncan be integrated to determine X-(τ, σ) up to an integration constant. Note that if we\nhad used static gauge we still could have formally expressed one component of Xμ in\nterms of the others, but the expression would involve a square root of a sum of operators,\nwhich is much more difficult to deal with.\n\n8.251 REVIEW NOTES FOR TEST 2, SPRING 2007\np. 9\nSEC. III: THE STRING IN LIGHT-CONE GAUGE\nClassical Solution for the Open String:\nWe begin by writing equations for the open string with a space-filling D-brane, so\nall the string coordinates Xμ satisfy free boundary conditions.\nThe wave equation (3.21) implies that the most general solution can be written as\nthe sum of an arbitrary wave moving to the left and an arbitrary wave moving to the\nright:\nXμ(τ, σ) =\nfμ (τ + σ) + gμ(τ - σ) ,\n(3.27)\nμ\nwhere fμ and g\nare arbitrary functions of a single argument. The boundary condition\nat σ = 0 implies that\n∂Xμ\n(τ, 0) =\nfμ′(τ) - gμ′(τ) = 0 ,\n(3.28)\n∂σ\nso fμ and gμ are equal up to a constant, which can be absorbed into a redefinition of f.\nEq. (3.27) can therefore be written as\nXμ(τ, σ) =\nfμ (τ + σ) + fμ(τ - σ) .\n(3.29)\nThe boundary condition at σ = π then implies that\n∂Xμ\n(τ, π) =\nfμ′(τ + π) - fμ′(τ - π) = 0 ,\n(3.30)\n∂σ\nwhich must hold for all τ, so fμ′ must be periodic with period 2π.\nSince fμ′ is periodic with period 2π, we can write it as a Fourier sum:\ninf\n√\n\nfμ′(u) = 2α′\nαn\nμ e -inu ,\n(3.31)\nn=-inf\nwhere reality implies that\nαμ = αμ∗ .\n(3.32)\n-n\nn\n√\nThe constant factor\n2α′ is inserted by convention, and serves the purpose of making the\nexpansion coefficients αμ\nn dimensionless. To see this, note that Xμ has units of length,\nσ and τ are dimensionless, and α′ has dimensions of (length)2. This Fourier expansion\ncan immediately be related to the expansion for the derivatives of Xμ(τ, σ), since from\nEq. (3.29) one can see that\nX μ ± Xμ′ = fμ′ (τ ± σ) ,\n(3.33)\n\n8.251 REVIEW NOTES FOR TEST 2, SPRING 2007\np. 10\nSEC. III: THE STRING IN LIGHT-CONE GAUGE\nfrom which it follows that\ninf\n√\n\nX μ ± Xμ′ =\n2α′\nαμ\nn e -in(τ±σ) .\n(3.34)\nn=-inf\nIntegrating Eq. (3.31) and inserting the result into Eq. (3.29), we have\n√\n√\nXμ(τ, σ) = xμ +\n2α′ αμ τ + i 2α′\nαn\nμ -inτ\n(3.35)\ncos nσ ,\ne\nn\nn=0\nwhere x\nEq. (3.35) holds for every component Xμ of the string coordinates, but the coefficients\nthat appear in the expansion are not all independent. One relationship comes from using\nEq. (3.35) to calculate the total momentum of the string, which is given by Eqs. (1.11)\nand (3.20) as\nπ\nX μ\nαμ\nμ is the constant arising from the integration of (3.31).\n2α′ ,\n(3.36)\npμ =\ndσ\n= √\n2πα′\nμ\nα0\nso\n√\n=\n2α′ pμ .\n(3.37)\nFor μ = +, the expansion is already fixed by the light-cone gauge condition (3.19),\nX+ = 2α′p+τ, so\n√\n+\nx\nrelation is a special case of Eq. (3.37). Furthermore, the μ = - components,\nexcept for the zero mode x -\n+\n= 0 ,\n2α′\n+\n+ = 0 for n = 0,\n(3.38)\nα\nα\n=\np\n,\nn\nwhere the α +\n, can be found from Eq. (3.26). Using Eq. (3.34) to re-express\nboth sides of Eq. (3.26), one finds that\nα-\nn =\n√\n2α′ p+ L⊥\nn ,\nwhere L⊥\nn ≡ 1\ninf\n\np=-inf\nαI\nn-p αI\np .\n(3.39)\nRecall that I is summed over the \"transverse\" indices, meaning all indices other than +\nor -. Thus, the complete solution is specified by choosing values for each of the αI\nn, for\nn ∈ Z and I = 2, 3, . . . , D - 1, subject to the reality constraint of Eq. (3.32), and also\nchoosing the values of x\np\nμ for μ = -, 2, 3, . . . , D - 1, and finally choosing the value of\n+ .\n\n8.251 REVIEW NOTES FOR TEST 2, SPRING 2007\np. 11\nSEC. III: THE STRING IN LIGHT-CONE GAUGE\nClassical Solution for the Closed String:\nThe closed string has the same equations of motion as the open string, but the\nboundary conditions are different. In analogy to Eq. (3.27), we can start with the general\nsolution to the wave equation,\nXμ(τ, σ) = Xμ(τ + σ) + Xμ (τ - σ) .\n(3.40)\nL\nR\n(The names we are using for the two functions are more elaborate than the simple f and\ng used in Eq. (2.27) for the open string, and there is a reason: these names will remain\nin use for longer, so we are choosing them to be more descriptive.) In this case we have\nno endpoint conditions, but we do insist on periodicity. We choose the period to be 2π,\nso\nXμ(τ, σ + 2π) = Xμ(τ, σ) for all τ and σ.\n(3.41)\nFor now our strings move in Minkowski space, and Eq. (3.41) is certainly the correct\nperiodicity condition in that case.\nIt is worth mentioning, however, that in Chapter\n17 we will consider strings that move in spaces that are not simply connected, spaces\nthat contain loops which cannot be continuously shrunk to a point. It is useful in such\ncases to use coordinates for the unshrinkable loops which are not single-valued, and then\nEq. (3.41) would need to be modified.\nDefining\nu ≡ τ + σ ,\nv ≡ τ - σ ,\n(3.42)\nthe periodicity condition becomes\nXμ(u + 2π) - Xμ(u) = Xμ (v) - Xμ (v - 2π) .\n(3.43)\nL\nL\nR\nR\nSince the left-hand side does not depend on v, and the right-hand side does not depend\non u, both sides must be constant. Thus neither XL\nμ(u) nor xR\nμ (v) are required to be\nperiodic, but the amount by which they change when their argument increases by 2π\nmust be the same for both functions, and independent of the argument. The derivatives\nof the functions must be strictly periodic, so we can expand\ninf\nXμ′(u) =\nα′\nα μe -inu\nL\nn\n2 n=-inf\n\n(3.44)\ninf\nXμ′(v) =\nα′\nαμe -inv .\nR\nn\n2 n=-inf\n\n8.251 REVIEW NOTES FOR TEST 2, SPRING 2007\np. 12\nSEC. III: THE STRING IN LIGHT-CONE GAUGE\nNote that the overbar in the above equation does not denote complex conjugation -- in\nstead the coefficients αn\nμ are a completely independent set of variables from the coefficients\nαμ\nn. Both obey reality conditions\nαμ = αμ∗ ,\nα μ = αμ∗ ,\n(3.45)\n-n\nn\n-n\nn\nand the condition (3.43) implies that\n= αμ\nαμ\n.\n(3.46)\nIntegrating and using Eq. (3.46), the string coordinates Xμ(τ, σ) can be expanded as\nXμ(τ, σ) = xμ\n√\n2α′ αμ\nα′ e-inτ\nn\ninσ + αμ -inσ\n(3.47)\nαμ\n+\nτ + i\ne\ne\n.\nn\nn\nn=0\nμ\nα0\nThe calculation of the total string momentum pμ is similar to the previous one, but\nthis time we integrate σ from 0 to 2π:\n2π\nX μ\n(3.48)\npμ =\ndσ\n=\n,\n2πα′\nα′\nμ\nα0\nso\nα′\n(3.49)\nμ\n=\np .\n+\nFor μ = +, the expansion is fixed by the light-cone gauge condition (3.19), so\nx\nα′\n+\n+\n+\n+\n= 0 ,\n= α = 0 for n = 0,\n(3.50)\nα\nα\n=\n2 p\n,\nn\nn\nrelation is a special case of Eq. (3.49). The coefficients of the X- expansion,\nwhere the α\n-\nexcept for x\ndifferent. From Eq. (3.40) one has\nX μ = Xμ′(τ + σ) + Xμ′(τ - σ)\nL\nR\n(3.51)\nXμ′ = Xμ′(τ + σ) - Xμ′(τ - σ) ,\nL\nR\n, are again determined by Eq. (3.26), but the explicit calculation is a bit\n+\n\n8.251 REVIEW NOTES FOR TEST 2, SPRING 2007\np. 13\nSEC. III: THE STRING IN LIGHT-CONE GAUGE\nso with Eqs. (3.44) one has\ninf\n√\n\n-in(τ+σ)\nX μ + Xμ′ = 2XL\nμ′(τ + σ) = 2α′\nα μ\nne\nn=-inf\n(3.52)\ninf\n√\n\nX μ - Xμ′ = 2Xμ′(τ - σ) = 2α′\nαμe -in(τ-σ) .\nR\nn\nn=-inf\nUsing the above relations to evaluate each side of Eq. (3.26), and recalling that β = 1 for\nclosed strings, one finds\nα-\nn = p\n+\nα\n′ L⊥\nn ,\nα -\nn = p\n+\nα\n′ L ⊥\nn ,\n(3.53)\nwhere\nLn\n⊥ ≡ 1\ninf\nαn\nI\n-p αp\nI ,\nL n\n⊥ ≡ 1\ninf\nα n\nI\n-p α p\nI .\n(3.54)\np=-inf\np=-inf\nFor the case of μ = -, Eq. (3.46) produces the nontrivial constraint\nL ⊥ = L⊥ ,\n(3.55)\na relation that has no analogue for the open string.\nFor the closed string, the complete solution is specified by choosing values for each\nof the αI\nn and αn\nI , for n ∈ Z and I = 2, 3, . . . , D - 1, subject to the reality constraints of\nEq. (3.45), and subject to the constraints αI\n0 = αI\n0 and L ⊥\n0 = L⊥\n0 . One must also choose\nthe values of x0\nμ for μ = -, 2, 3, . . . , D - 1, and also the value of p+ .\n\n8.251 REVIEW NOTES FOR TEST 2, SPRING 2007\np. 14\nSEC. IV: QUANTIZATION OF THE STRING IN LIGHT-CONE GAUGE\nIV. Quantization of the String in Light-Cone Gauge:\nQuantization of the Open String:\nBasic Operators and Commutation Relations:\nWe now discuss the quantization of the open string solution, corresponding to the\nclassical solutions described in Sec. III.\nThe beauty of the light-cone gauge is that we can treat the transverse components\nXI(τ, σ) of the string coordinates as unconstrained dynamical variables, while the μ = +\nand μ = - components are for the most part determined by the transverse components.\nWe found only two exceptions to this rule: x -\n0 and p+ were not determined by the\ntransverse operators. Since\n∂L\nPτI =\n(4.1)\n∂X I\nis the canonical momentum variable conjugate to XI, we will choose the following set of\nclassical variables to promote to Schr odinger operators:\nSchr odinger operators:\nXI(σ) , x\n-\n0 , PτI(σ) , p\n+\n.\nWe adopt the usual canonical commutation relations,\nXI(σ) , PτJ(σ′) = iηIJδ(σ - σ′) = iδIJδ(σ - σ′) ,\nXI(σ) , XJ(σ′) = PτI(σ) , PτJ(σ′) = 0 ,\n-\n+\nx0 , p = iη-+ = -i ,\n-\n- , PτI(σ)\n+ , PτI(σ)\nx0 , XI(σ) = x0\n= p + , XI(σ) = p\n= 0 .\n(4.2)\n(4.3)\n(4.4)\n(4.5)\n(4.6)\nTreating τ as the time variable for the system, we will also introduce Heisenberg operators\nwhich also depend on τ:\n-\nSchr odinger operators:\nXI(τ, σ) , x0 (τ) , PτI(τ, σ) , p\n+(τ)\n.\n(4.7)\nFrom the classical motion, however, we expect that x -\n0 (τ) and p+(τ) will actually be\nindependent of their arguments. For the Heisenberg operators, the nonzero commutators\nwill be\nXI(τ, σ) , PτJ(τ, σ′) = iηIJδ(σ - σ′) = iδIJδ(σ - σ′) ,\n(4.8)\n-\nx0 (τ) , p\n+(τ) = iη-+ = -i ,\n(4.9)\n\n8.251 REVIEW NOTES FOR TEST 2, SPRING 2007\np. 15\nSEC. IV: QUANTIZATION OF THE STRING IN LIGHT-CONE GAUGE\nwhere the other commutators are zero, as in Eqs. (4.4) and (4.6).\nThe Heisenberg fields Xμ(τ, σ) can be expanded exactly as in Eq. (3.35)\n√\n√\nXμ(τ, σ) = x0\nμ +\n2α′ α0\nμ τ + i 2α′\nαn\nμ e -inτ cos nσ ,\n(3.35)\nn\nn=0\nexcept now the coefficients xμ\n0 and αμ\nn are operators, rather than numbers. For μ = I,\nwe can treat them as independent operators, and we can use the canonical commutation\nrelations (4.7) and (4.8) to determine the commutation relations for the new operators\nαμ. The simplest link between the α's and the X's is found in Eq. (3.34),\nn\ninf\n√\n\nX μ ± Xμ′ =\n2α′\nαμ\nn e -in(τ±σ) .\n(3.34)\nn=-inf\nOur goal is to express the sum on the right in terms of Heisenberg operators Xμ(τ, σ),\nbut to get it right we must be careful about the range of σ. The sum on the right (for\neither the upper or lower sign) defines a function which is manifestly periodic in σ with\nperiod 2π, but the equation makes sense only for σ in its allowed physical range, which\nis σ ∈ [0, π]. Let us define\ninf\n√\n\nAI (τ, σ) ≡\n2α′\nαμ\nn e -in(τ+σ) .\n(4.10)\nn=-inf\nEq. (3.34) then implies that\nX I (τ, σ) + Xμ′(τ, σ) = AI (τ, σ) for σ ∈ [0, π],\n(4.11)\nbut also\nX I (τ, σ) - Xμ′(τ, σ) = AI (τ, -σ) for σ ∈ [0, π].\n(4.12)\nThe above equation can be rewritten as\nX I (τ, -σ) - Xμ′(τ, -σ) = AI (τ, σ) for σ ∈ [-π, 0].\n(4.13)\nEqs. (4.11) and (4.13) can then be used to write an equation for AI (τ, σ) that is valid\nover its full period, which can be taken as σ ∈ [-π, π]:\nX I (τ, σ) + Xμ′(τ, σ)\nif\n\nσ ∈ [0, π]\nAI (τ, σ) =\n(4.14)\nX I (τ, -σ) - Xμ′(τ, -σ)\nif\n\nσ ∈ [-π, 0].\n\n8.251 REVIEW NOTES FOR TEST 2, SPRING 2007\np. 16\nSEC. IV: QUANTIZATION OF THE STRING IN LIGHT-CONE GAUGE\nThe elementary commutator is found by differentiating Eq. (4.8) with respect to σ, and\nreplacing PτJ by X J /(2πα′), as specified in Eq. (3.20). Thus\nXI ′(τ, σ) , X J (τ, σ′) = 2πiα′ δIJ d δ(σ - σ′) .\n(4.15)\ndσ\nIf you are not familiar with the derivative of a δ-function, don't be frightened. Expres\nsions containing δ-functions are defined by what happens when one integrates over them,\nperhaps after multiplying by a smooth function. Derivatives of a δ-function are then\ndefined by an integration by parts. For example,\nd\ndF\ndF\ndxF(x)\nδ(x - a) = -\ndx\nδ(x - a) = -\n(a) .\n(4.16)\ndx\ndx\ndx\nBy combining Eqs. (4.14) and (4.15), one finds\n\nd\nAI (τ, σ) , AJ (τ, σ′) = 4πiα′ δIJ\nδ(σ - σ′) .\n(4.17)\ndσ\nTo check Eq. (4.17) one needs to consider four separate cases: (σ ∈ [0, π], σ′ ∈ [0, π]),\n(σ ∈ [0, π], σ′ ∈ [-π, 0]), (σ ∈ [-π, 0], σ′ ∈ [0, π]), and (σ ∈ [-π, 0], σ′ ∈ [-π, 0]). You\nshould find, however, that it works in each case. In evaluating this expression it helps to\nrecall that δ(x - y) = δ(y - x), and d δ(x - y) = - d δ(x - y).\ndx\ndy\nOne can then invert Eq. (4.10) to give\n2π\nαI =\n√\ndσ ein(τ+σ)AI (τ, σ) .\n(4.18)\nn\n2π 2α′\nUsing Eq. (4.17), the commutator is then given by\n\n2π\n2π\n\nαI , αJ\n=\ndσ′ e im(τ+σ )\ndσein(τ+σ) AI (τ, σ) , AJ (τ, σ′)\nn\nm\n8π2α′\n= 4πiα′\nδIJ\n2π\ndσ′ e im(τ+σ )\n2π\ndσein(τ+σ) d δ(σ - σ′)\n8π2α′\ndσ\n(4.19)\n= 2\ni\nπ δIJ\n\n2π\ndσ′ e im(τ+σ )(-in)e in(τ+σ )\n= nδIJ δm+n,0 ,\nso finally\nαI , αJ\n= nδm+n,0 δIJ .\n(4.20)\nn\nm\n\n8.251 REVIEW NOTES FOR TEST 2, SPRING 2007\np. 17\nSEC. IV: QUANTIZATION OF THE STRING IN LIGHT-CONE GAUGE\nGiven Eqs. (4.18) and (4.14), one sees that the αI\nn are constructed entirely from operators\nX I, and therefore they commute with x\nx\nXI ′\n-\nand\nand p + .\nTo find the commutators of the\nI we can start by rewriting the commutator\n,\nX J\nXI(τ, σ) , PτJ of Eq. (4.8) in terms of\nby using Eq. (3.20), and integrating σ\nfrom 0 to π to simplify the mode expansion of XI(τ, σ), as given by Eq. (3.35). Note\nthat although the cos nσ factor in Eq. (3.35) has period 2π and not π, it still vanishes\nwhen integrated from 0 to π. The result is\n\n√\n\nx\n2α′ αI\nτ , X J(τ, σ′) = 2α′iδIJ\nI\n(4.21)\n+\n.\nFrom Eq. (4.20) we know that αI\nthe expansion for\n0 commutes with the sum of αJ\nn operators that appear in\n\nXJ, so the only contribution comes from x\nfor X J ,\ninf\n\n√\nI. Inserting the expansion\nI , αJ\nn\n\ncos nσ′ e -inτ =\n2α′ i δIJ .\n(4.22)\nI\nI\nx\nn=-inf\nThis expression must hold for all τ, but the left hand side has the form of a Fourier\nexpansion in τ, with period 2π. Since Fourier expansions are unique, the two sides must\nmatch term by term. The right-hand side has only an\n= 0 term, so we have\nn\n√\n\nJ\nIJ\n′\n, α\nα i δ\n=\nx\nx\nRecalling that αJ\n, αn\nJ = 0 if n\n(4.23)\n= 0. .\n,\n√\n\n=\n2α′ pJ Eq. (3.37) , the first of the relations above is equivalent to\nI\nJ\nx\n= iδIJ ,\n(4.24)\n, p\nwhich is what we would expect.\nNote that the commutation relations (4.20) imply that the αI\nn behave essentially as\ncreation and annihilation operators, except that they are not normalized in the standard\nway. When quantized, the reality condition αμ = αμ∗ of Eq. (3.32) becomes\n-n\nn\nαI\n= αI+ ,\n(4.25)\n-n\nn\nand the αI\nn can be related to a new set of operators an, with\nαI = √ n a I ,\nαI\n= √ n a I+\nfor n ≥ 1,\n(4.26)\nn\nn\n-n\nn\nso that the commutation relations for the new operators are\na I , a\nJ+ = δIJ δ\n,\n(4.27)\nm\nn\nmn\nexactly the form of the standard commutation relations for creation and annihilation\noperators.\n\n8.251 REVIEW NOTES FOR TEST 2, SPRING 2007\np. 18\nSEC. IV: QUANTIZATION OF THE STRING IN LIGHT-CONE GAUGE\nSolving for X- and the Virasoro Algebra:\nNow that we understand the operators associated with the transverse coordinates\nXI (τ, σ), we can think about solving for the dependent X-(τ, σ) operators. The equa\ntions\n\nX - ± X-′ = 2βα\n′p+ X I ± XI ′\n(3.26)\nand\ninf\n√\n\n-in(τ±σ)\nX μ ± Xμ′ =\n2α′\nαμ\nn e\n(3.34)\nn=-inf\nare still expected to hold as operator equations, but Eq. (3.26) leads to ordering ambi\nguities, since X I and XI ′ do not commute. One can proceed to solve for α-\nn obtaining\nas before the result\nα-\nn =\n√\n2α′ p+ L⊥\nn ,\nwhere L⊥\nn ≡ 1\ninf\n\np=-inf\nαI\nn-p αI\np ,\n(3.39)\nbut now the ordering of the operator products in the expression on the right is ambiguous.\nFor n = 0 the operators commute, but for n = 0 they do not. Since the commutator is a\nc-number, the operator Lp0 is ambiguous in that it might contain an arbitrary c-number.\nTo be able to at least discuss the ambiguity quantitatively, we define\ninf\nL⊥\n0 ≡\n: αI\nn-pαI\np : ,\n(4.28)\n2 p=-inf\nwhere\n: expression : ≡ Normal ordered form of expression.\n(4.29)\nIn this notation, given Eq. (4.26), normal ordering means that positive indices are placed\nto the right. Given the normal ordering prescription, : αI\nn-pαI\np : has the same value for\np and -p, so L⊥\n0 can be expanded as\nL⊥\n1 αI\ninf\nαI αI = α′ I\nI +\ninf\nI+ I\n0 =\n0α0\nI +\n-p\np\np p\npap pp .\n(4.30)\np=1\np=1\n\n′\n\n′\n\n′\n\n8.251 REVIEW NOTES FOR TEST 2, SPRING 2007\np. 19\nSEC. IV: QUANTIZATION OF THE STRING IN LIGHT-CONE GAUGE\n-\n0 by writing\nWith this definition, we allow for the ambiguous c-number in α\n√\n\n√\nL\n-\n-=\n⊥\n=\n2α\n(4.31)\n+ a\n,\nα\np\nn\n+\n2α′ p\nwhere a is an as yet unknown constant. The constant a is intimately tied to the spectrum\nof states in string theory, since the invariant M2 for the string state can be written as\n+\nI\nI\n= -p 2 = 2 p\np - - p p = 1\nα L ⊥\n- p I\nI\np\n+ a\nM\n(4.32)\n\n⊥ + a\nN\n=\n,\nα\nwhere\ninf\nN⊥ ≡\nn a I\nn + a I\nn .\n(4.33)\nn=1\nNow that we have an unambigous definition of the operators L ⊥\nn , called the Virasoro\noperators, we can calculate their commutators. They are calculated in the textbook,\nand in a set of notes that are posted on the course home page, so I will not repeat the\ncalculation here. The result, however, is\n, L\n⊥\nn = (m - n)L ⊥\nm+n + 1\n12 m (m 2 - 1)(D - 2)δ\n⊥\nm+n,0 .\n(4.34)\nL m\nOther commutators that may prove useful are the following:\n, α\nJ\nJ\n= -nα\n(4.35)\nn\nm+n\n⊥\nL m\nand\n√\nL ⊥ , x\nI\n\n= -i 2α′ αI\nm .\n(4.36)\nm\n\n8.251 REVIEW NOTES FOR TEST 2, SPRING 2007\np. 20\nSEC. IV: QUANTIZATION OF THE STRING IN LIGHT-CONE GAUGE\nWhen the Virasoro generators act on string coordinates, they generate reparameteriza\ntions of the string:\nL⊥ , XI (τ, σ) = ξτ X I + ξσ XI ′ ,\n(4.37)\nm\nm\nm\nwhere\nξτ (τ, σ) = -ieimτ cos mσ ,\nm\n(4.38)\nξσ (τ, σ) = e imτ sin mσ .\nm\nThis is a reparameterization in the sense that the change in XI is proportional to the\nderivative of XI with respect to σ or τ, so the effect is the same as shifting these para\nmeters by an infinitesimal amount. That is,\nεL⊥ , XI (τ, σ) = XI (τ + εξτ , σ + εξm\nσ ) - XI (τ, σ) + O(ε2) .\n(4.39)\nm\nm\nTesting Lorentz Invariance:\nWe now confront an important issue, which is central to the question of whether this\ntheory is well-defined at all. The action that we started with was manifestly Lorentz\ninvariant, and we intended to construct a Lorentz-invariant theory, consistent with the\nfact that no violations of Lorentz invariance have ever been seen. In quantizing the theory,\nhowever, we found it convenient to ignore the Lorentz symmetry, choosing a light-cone\ngauge in which the 0 and 1-directions are treated in a special way. There is no guarantee,\ntherefore, that the theory that we have constructed is in fact Lorentz-invariant. To see if\nthe theory is invariant, we will attempt to construct the operators that generate Lorentz\ntransformations.\nWe begin to construct the Lorentz generators by using Eq. (1.15),\nMμν =\nMτ\nμν (τ, σ) dσ =\n\nXμPν\nτ - Xν Pμ\nτ\ndσ .\n(1.15)\nI guess we have not shown it in this course, but in general a quantity that is conserved by\nvirtue of a symmetry will also the generator of that symmetry. For example, angular mo\nmentum is conserved as a consequence of rotational invariance, and angular momentum\nin turn is the generator of rotations. Inserting the mode expansion (3.35) into Eq. (1.15),\nusing Eq. (3.20) for Pμ\nτ , one soon finds\ninf\n\nMμν\nμ\nν\nαμ αν\nαμ\n= x0 p ν - x0 pμ - i\n-n\nn - α-\nν\nn\nn\n.\n(4.40)\nn\nn=1\n\n8.251 REVIEW NOTES FOR TEST 2, SPRING 2007\np. 21\nSEC. IV: QUANTIZATION OF THE STRING IN LIGHT-CONE GAUGE\nWe consider in particular M-I , which to be consistent with Lorentz symmetry should\nsatisfy\nM-I , M-J = 0 .\n(4.41)\nFrom Eq. (4.40), the expression for M-I should be\nM-I = x - I - x I - - i\ninf 1\nα- αI - αI\nα-\n.\n(4.42)\n0 p\n0p\n-n\nn\n-n\nn\nn\nn=1\nThis expression is not Hermitian, however, since xI\n0 and p- do not commute. It can be\nmade Hermitian, however, by symmetrizing the product.\n-I\n- I - 1\nI - + p - I\ninf 1 -\nI\nI\n-\nM\n= x0 p\n(x0p\nx0) - i\nα-n αn - α-n αn\n.\n(4.43)\nn\nn=1\n-\nFinally, to clarify the meaning, we replace the αn operators by their expression in terms\nof Virasoro operators, including the constant a:\n\ni\ninf 1\n\n-I\n- I -\nI\n⊥\n⊥\nI\n⊥\nI\nI\n⊥\nM\n= x0 p\n4α′p+ x0 L0 + a + L0 + a x0 -√\n′ p+\nn L-n αn - α-n Ln\n.\n2α\nn=1\n(4.44)\nThe calculation of the commutator is too complicated to be included in the textbook,\nand I have not tried it yet myself, but the answer is claimed to be\nM-I , M-J = - α′ p\n+2\ninf\nα-\nI\nm αm\nJ - α-\nJ\nm αm\nI\nm=1\n(4.45)\n\n× m 1 -\n(D - 2) +\n(D - 2) + a\n.\nm 24\nThis quantity will vanish identically only if D = 26 and a = -1. Thus, we have found\nthat the bosonic string is a consistent Lorentz-invariant theory only in 26 dimensions!\nV. Unfinished Business:\nThere are still some important topics that I did not get to, including construction\nof the state space, tachyons and D-brane decay, and the quantization of closed strings.\nAlthough I didn't get that far, these topics are important. Be sure to study them on\nyour own. I also did not touch on the particle mechanics or field theory discussions of\nChapters 10 and 11."
    },
    {
      "category": "Lecture Notes",
      "title": "lec1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-251-string-theory-for-undergraduates-spring-2007/8eb3080396f00109ea631e4bd45223a0_lec1.pdf",
      "content": "X\nLecture 1\n8.251 Spring 2007\nLecture Topics\n- Announcements, introduction\nLorentz transformations\n-\n- Light-cone coordinates\nReading: Zwiebach, Sections 2.1-2.3\nStrings at Many Scales\nClassical strings, cosmic strings\nQCD strings, gluons or flux tubes hold quarks together as qq+\nFlux tube - String of 0.2 fm\nAdS/CFT\nAnti-desiltem/conformal field theory\nFundamental Strings\nStandard model of particle physics, cosmology, inflation\nZero thickness, mass, measure\nRelativistic Strings\nIntervals:\n(ct, x, y, z) ≡ (x 0 , x 1 , x 2 , x 3) ≡ xμ\nS\nS1\nEvent 1\nxμ\nx0μ\nEvent 1\nxμ + Δxμ\nx0μ + Δx0μ\n-Δs 2 = -Δx 02 +\nΔx i2 = gμvx v = xμx v\n= -Δx002 +i Δx0i2 = -Δs i2\ni\nΔs 2 = Δs i2\n> 0 timelike separated\nΔs 2 = = 0 lightlike separated\n< 0 spacelike separated\n\nLecture 1\n8.251 Spring 2007\nAgain, the interval:\n-ds2 = ημvdxμdvv\nημv symmetric by definition:\n⎞\n⎛ -1\nημv =\n⎜\n⎜\n⎝\n⎟\n⎟\n⎠\naμ → aμ = ημva v∀a\nGiven aμ, bμ, a b = aμbμ = ημv aμbv\n·\nInverse metric: ημv = (η-1)\nμv\nηvρηρμ = δμ\nv (summed over ρ)\nηρμbμ = ηρμημvbv = δρvbv = bρ\nLorentz Transformation:\nv\nβ =\n; γ =\nc\n√1 - βv\nx0 = (x - βct)γ\ny0 = y\nz0 = z\nct0 = γ(ct - βx)\nx 00 = γ(x 0 - βx1)\nx 10 = γ(-βx0 + x 1)\nx = x\nx = x\n\n| {z }\nLecture 1\n8.251 Spring 2007\nA linear invertible transform between xμ and x0μ that satisfies Δs2 = Δs02\nx0μ = Lμ\nv x v\nL is a Lorentz transfer of LT ηL = η\nLight cone coordinates:\nx , x ,\nx , x\nKeep these two\nx + = √\n2(x 0 + x 1)\nx- = √1\n2(x 0 - x 1)\nx± = √\n2(x 0 ± x 1)"
    },
    {
      "category": "Lecture Notes",
      "title": "lec2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-251-string-theory-for-undergraduates-spring-2007/061e1f35aad94b88fee585e928db8f61_lec2.pdf",
      "content": "Lecture 2\n8.251 Spring 2007\nLecture 2 - Topics\n- Energy and momentum\n- Compact dimensions, orbifolds\n- Quantum mechanics and the square well\nReading: Zwiebach, Sections: 2.4 - 2.9\nx± = √1\n2(x 0 ± x 1)\nx+ l.c. time\nLeave x2 and x3 untouched.\n-ds2 = -(dx0)2 + (dx1)2 + (dx2)2 + (dx3)2\n= ημvdxμdxv\nu, v = 0, 1, 2, 3\n2dx+dx- = (dx0 + dx1)(dx0 - dx1)\n= (dx0)2 - (dx1)2\n-ds2 = -2dx+dx- + (dx2)2 + (dx3)2\n= ηˆμvdxμdxv\nu, v = +, -, 2, 3\n⎤\n⎡\nηˆμν =\n⎢⎢⎣\n-1 0\n-1\n⎥⎥⎦\n\nLecture 2\n8.251 Spring 2007\nηˆ++ = ηˆ-- = ηˆ+I = ηˆ = -I\nI = 2, 3\nηˆ+- = ηˆ-+ = -1\nη22 = η33 = 1\nGiven vector aμ, transform to:\na± := √1\n2(a 0 ± a 1)\nEinstein's equations in 3 space-time dimensions are great. But 2 dimensional\nspace is not enough for life. Luckily, it works also in 4 dimensions (d5, d6, ...).\nWhy don't we live with 4 space dimensions?\nIf we lived with 4 space dimesnions, planetary orbits wouldn't be stable (which\nwould be a problem!)\nMaybe there's an extra dimension where we can unify gravity and ...\nMaybe if so, then the extra dimensions would have to be very small - too small\nto see.\nString theory has extra dimensions and makes theory work. Though caution:\nthis is a pretty big leap.\nTrees in a Box\nLook at trees in a box\nMove a little and see another behind it\n\nX\nLecture 2\n8.251 Spring 2007\nIn fact, see inf row that are all identical! Leaves fall identically and everything.\nDot Product\na b = -a*b* +\na ibi\n·\ni=1\n= -a +b- - a-b+ + a 2b2 + a 3b3\n= ηˆμν aμbν\naμ = ηˆμν a ν\na+ = ηˆ+ν a ν = ηˆ+-a- = -a-\na+ = -a-\na- = -a +\ndx-\nvlc = dx+\nLight rays a bit like in Galilean physics - go from 0 to inf.\n\nLecture 2\n8.251 Spring 2007\nEnergy and Momentum\nμ\nEvent 1 at x\nEvent 2 at xμ + dxμ (after some positive time change)\ndxμ is a Lorentz vector\nThe dimension along the room, row is actually a circle with one tree, so not\nactually infinity.\nSee light rayws that goes around circle multiple times to see multiple trees.\nCrazy way to define a circle\nThis circle is a topological circle - no \"center\", no \"radius\"\nIdentify two points, P1 and P2. Say the same (P1 ≈ P2) if and only if x(P1) =\nx(P2) + (2πR)n (n ∈ Z)\nWrite as:\nx ≈ x + (2πR)n\nDefine: Fundamental Domain = a region sit.\n1. No two points in it are identified\n2. Every point in the full space is either in the fundamental domain or has a\nrepresentation in the fundamental domain.\nSo on our x line, we would have:\n\np\nLecture 2\n8.251 Spring 2007\n-ds2 = -c 2dt2 + (d~x)2\n= -c 2dt2 + v 2(dt)2\n= -c 2(1 - β2)(dt)2\nds2 is a positive value so can take square root:\nds =\n1 - β2dt\nIn to co-moving Lorentz frame, do same computation and find:\n-ds2 = -c 2(dtp)2 + (d~x)2 = -c 2(dtp)2\ndtp: Proper time moving with particle. Also greater than 0.\nds = cdtp\ndxμ\n= Lorentz Vector\nds\nDefine velocity u-vector:\ncdcxμ\nuμ =\ndx\nDefinite momentum u-vector:\nm\ndxμ\ndxμ\npμ = muμ = p\n= mγ\n1 - β2 dt\ndt\nγ = p\n1 - β2\nRule to get the space we're trying to construct:\nTake the f\nd, include its boundary, and apply the identification\n·\n\nLecture 2\n8.251 Spring 2007\nNote: Easy to get mixed up if rule not followed carefully.\nConsider <2 with 2 identifications:\n(x, y) ≈ (x + L1, y)\n(x, y) ≈ (x, y + L2)\nBlue: Fundamental domain for first identification\nRed: Fundamental domain for second identification\n\n~\n\nLecture 2\n8.251 Spring 2007\ndx0 d~x\npμ = mγ\n,\ndt\ndt\n= (mcγ, mγ~v)\nE\n=\n, ~p\nc\nE: relativistic energy =\nμc\n√\n1-β2\np: relativistic momentum\nScalar:\nμ\np\npμ = (p 0)2 + (p~)2\n·\nE2\n= - c2 + ~p 2\n2 2\nm c\nm v\n= - 1 - β2 + 1 - β2\n2 2 1 - β2\nc\n= -m\n1 - β2\n2 2\nc\n= -m\nEvery observer agrees on this value.\nLight Lone Energy\nx0 = time, E\nc = p0\n+\nx\n= time, E\nc\nlc = p+? -¿ Nope!\nh\nJustify using QM: Ψ(t, ~x) = e\n-i (Et-p~0~x)\nCan think of the IDs as transformations - points \"move.\" Here's something that\n\"moves\" some points but not all.\nOrbfolds\n1.\nID: x ≈-x\nFD:\n\nLecture 2\n8.251 Spring 2007\nThink of ID as transformation x →-x\nThis FD not a normal 1D manifold since origin is fixed. Call this half time </Zz\nthe quotient.\n2.\nID: x ≈ x rotated about origin by 2π/n\nIn polar coordinates:\nz = x + iy\n2πi\nz\nn\nz ≈ e\nFundamental domain can be chosen to be:\n\nLecture 2\n8.251 Spring 2007\nCone!\nWe focus on these two since quite solvable in string theory.\np~ˆ = hr/i\nSE:\n∂Ψ\nE\nih\n=\nΨ\n∂x0\nc\nih ∂ Ψ = EΨ\nc ∂t\nSo for our x+, want ih ∂Ψ\n∂x+ = ElccΨ\nE\nEt - ~p ~x = -- ct + p~ ~x\n·\n·\nc\n= -p · x\n= -(p+x + p-x- + . . .)\nNow have isolated dependence on x+, so can take derivative:\n+i\nh\nΨ = e\n(p+x + + . . .)\n∂Ψ\nih\n= -p+Ψ\n∂x+\nSo:\nElc - p+ = p-\n=\nSuppose have line segment of length a. Particle constrained to this:\n\nLecture 2\n8.251 Spring 2007\nCompare to physics of world with particle constrained to thin cylinder of radius\nR and length a (2D)\nCan be defined as:\nwith ID (x, y) ≈ (x, y + 2πR)\nSo:\nSE = -h2\n∂2\n+ ∂2\n= EΨ\n2m\n∂x2\n∂y2\n1.\nkπx\nΨk = |{z} sin\na\n\nh2\nkπ\nEk = 2m\na\n2.\nΨe k,l = |{z} sin kπx cos ly\na\nR\nΨk,l = |{z} sin kπx sin ly\na\nR\nIf states with l = 0 then get same states as case 1, but if l = 0 get different E\n\nvalue from\nR\nl\ncontribution. Only noticeable at very high temperatures."
    },
    {
      "category": "Lecture Notes",
      "title": "lec3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-251-string-theory-for-undergraduates-spring-2007/184b1fe03c3d32c9ac0a860af62b877c_lec3.pdf",
      "content": "Lecture 3\n8.251 Spring 2007\nLecture 3 - Topics\n- Relativistic electrodynamics.\nGauss' law\n-\n- Gravitation and Planck's length\nReading: Zwiebach, Sections: 3.1 - 3.6\nElectromagnetism and Relativity\nMaxwell's Equations\nSource-Free Equations:\n1 ∂B~\nr × E~ = - c ∂t\n(1)\nr · B~ = 0\n(2)\nWith Sources (Charge, Current):\nr · E~ = ρ\n(3)\n1 ∂E~\nr × B~ - c ∂t = c J~\n(4)\nNotes:\n1. E and B have same units.\n3. ρ is charge density [charge/volume]. Here no 0 or 4π - those constants would\nget messy in higher dimensions.\n4. J~ is current density [current/area]\nE~, B~ are dynamical variables.\nd~p\n~\n~\ndt = q E + c~v × B\n\n( ~\n~\n\nLecture 3\n8.251 Spring 2007\nSolve the source free equations\nr · B~ = 0 solved by B~ = r × A~. (Used to have r × E~ = 0, E = -rΦ)\nTrue equation:\n1 ∂\n∂A~\nE +\nE +\nr × ~\nc ∂t (r × A~) = r × ~\nc r ×\n∂t\n1 ∂A~\n= r × E~ + c ∂t = 0\nSo:\n1 ∂A~\nE~ + c ∂t = -rΦ\n(Φ scalar)\nThus:\n1 ∂A~\nE~ = -rΦ - c ∂t\nE, B~) encoded as (Φ, A)\nΦ, A are the fundamental quantities we'll use\nGauge Transformations\nA~ → A~0 = A~ + r\nB~ 0 = r × A0 = r × (A + r) = B~\nfunction of ~x,t. r function = vector.\n1 ∂\nΦ → Φ0 = Φ - c ∂t\n1 ∂\n1 ∂\nE~ 0 = -r(Φ0) = -r Φ - c ∂t - c ∂t (A + r) = E~\nSo under gauge transformations, E~ and B~ fields unchanged!\n~\n↔\n~\n(Φ, A) g.t. (Φ0, A0)\n(Physically equivalent)\nSuppose 2 sets of potentials give the same E~'s and B~'s. Not guaranteed to be\ngauge-related.\nSuppose we have 4-vector Aμ = (Φ, A~) then Aμ = (-Φ, A~)\n\nLecture 3\n8.251 Spring 2007\nTake ∂x\n∂\nμ . Have indices from ∂x\n∂\nμ and from Aμ so will get a 4x4 matrix. Have\ntwo important quantities (E and B) with 3 components each\n6 important\nquantities. Hint that we should get a symmetric matrix.\n⇒\nFμν = ∂Aν\n∂Aμ = ∂μAν - ∂ν Aμ\n∂xμ - ∂xν\nFμν = -Fνμ\n1 ∂Ai\n∂\nFoi = c ∂t - ∂xi (-Φ) = -Ei\nF12 = ∂xAy - ∂yAx = Bz\n⎞\n⎛\n-Ex\n-Ey\n-Ez\nEx\nBz\n-By\nBx\nFμν =\n⎜\n⎜\n⎝\n⎟\n⎟\n⎠\nEy\n-Bz\nBy\nEz\n-Bx\nWhat happens under gauge transformation?\nAμ → Aμ\n0 = Aμ + ∂μ\nThen get:\nF 0\n= ∂μA0\nμν\nν - ∂ν A0\nμ\n= ∂μ(Aν + ∂ν ) - ∂ν (Aμ + ∂μ)\n= Fμν + ∂μ∂ν - ∂ν ∂μ\n= Fμν\nDefine:\nTλμν = ∂xFμν + ∂μFνλ + ∂ν Fλμ\nNote indices are cyclic.\nSome interesting symmetries:\nTλμν = -Tμλν\nTλμν = -Tλνμ\nSo Tλμν is totally antisymmetric. A totally symmetric object in 4D has only 4\nnontrivial components so Tλμν = 0 gives you 4 equations.\n\nLecture 3\n8.251 Spring 2007\nTλμν = 0 = ∂λ(-∂ν Aμ) + ∂μ(∂ν Aλ) + ∂ν (∂λAμ - ∂μAλ)\nCharge Q is a Lorentz invar. Not everything that is conserved is a Lorentz\ninvar. eg. energy. Since Q is both conserved and a Lorentz invar, (cρ, J~) form\na 4-vector Jμ\nNow let's do what a typical theoretical physicist does for a living: guess the\nequation!\nF μν ≈ Jμ\nNo, derivatives not right.\n∂F μν /∂xν ≈ Jμ\nNo, constants not right.\nF μν /∂xμ = Jμ\nCorrect, amazingly! (even sign)\nc\nμ = 0:\n∂F 0ν /∂xν = ρ\n∂F 0i/∂xi = ρ\nF0i = -Ei\nF 0i = Ei\nSo r · E~ = ρ verified!\nElectromagnetism in a nutshell:\nFμν = ∂μAν - ∂ν Aμ\n∂F μν\nJμ\n=\n∂xν\nc\nConsider electromagnetism in 2D xy plane. Get rid of Ez component:\n⎛\n⎞\n-Ex\n-Ey\nFμν = ⎝ Ex\nBz ⎠\nEy\n-Bz\nBut what about Bz? Doesn't push particle out of the plane (v × Bz with v in\nthe xy plane remains in xy plane) but rename Bz as B, a scalar.\n\nLecture 3\n8.251 Spring 2007\nHow about in 4D spatial dimensions?\n⎞\n⎛\nF =\n⎜\n⎜\n⎜\n⎜\n⎝\n-Ex\n-Ey\n-Ez\n-EN\n∗\n∗\n∗\n∗\n∗\n∗\n⎟\n⎟\n⎟\n⎟\n⎠\nSo get tensor B!\nIt's a coincidence that in our 3D spacial world E and B are both vectors.\nLet's look at r · E~ = ρ in all dimensions.\nNotation: Circle S0 is a 1D manifold, the boundary of a ball B2\nSphere S2(R) : x2\n3 = R2\n+ x + x\nBall B3(R) : x2\n3 ≤ R2\n+ x + x\n\nZ\nZ\nLecture 3\n8.251 Spring 2007\nWhen talking about S2(R), call it S2 (R = 1 implied)\nVol(S1) = 2π\nVol(S2) = 4π\nVol(S3) = 2π2\n2π\nd\nVol(Sd-1) = Γ( d\n2 )\nAll you need to know about the Gamma function:\nΓ(1/2) = √π\nΓ(1) = 1\nΓ(x + 1) = xΓ(x)\nΓ(n) = (n - 1)! for n ∈ Z\nΓ(x) =\ninf\ndte-ttx-1 for x > 0\nCalculating r · E~ in d = 3 and general d dimensions.\nd = 3:\nEd(vol) =\nρd(vol) = q\nr · ~\nThis represents the flux of E~ through S2(r)\nE(r) vol(S2(r)) = q\nB3(r)\nZ\nB3 (r)\n·\n\nZ\nZ\nLecture 3\n8.251 Spring 2007\nE(r) 4πr2 = q\n·\n1 q\nE(r) = 4π r2\nThis falls off much faster at large r and increases much faster as small r.\nGeneral d:\nEd(vol) =\nρd(vol) = q\nr · ~\nThis represents the flux of E~ through Sd-1(r)\nE(r) vol(Sd-1(r)) = q\nBd(r)\nBd(r)\n·\nΓ(d/2) q\nE(r) = 2πd/2 rd-1\nElectric field of a point charge in d dimensions.\nIf there are extra dimensions, then would see larger E at very small distances."
    },
    {
      "category": "Lecture Notes",
      "title": "lec4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-251-string-theory-for-undergraduates-spring-2007/e396b9a7aa6e59371bb55f00ad5d53c5_lec4.pdf",
      "content": "Lecture 4\n8.251 Spring 2007\nLecture 4 - Topics\n- Gravitational potentials\n- Compactification\n- Large extra dimensions\nReading: Zwiebach, Sections: 3.7 - 3.10\nGravitation\nNewtonian Gravity\nFm = -(GMm/r2) rˆ\n·\nWhen working in regime with high velocities or strong gravity fields, instead\nwork with:\nEinstein's Gravity\nWhen working in a regime with small distances or extremely strong gravity\nfields, instead work with:\nString Theory\n-ds2 = ημν dxμdxν GR\n= gμν (x)dxμdxν\n⇒-ds2\ngμν (x) = gνμ(x)\nStill symmetric, still invertible. Signature (-,+,+,+) (1 negative eigenvalue, 3\npositive eigenvalues)\n\n| {z }\nr\nr\nr\nLecture 4\n8.251 Spring 2007\nIf gravity weak, approximate gμν (x) = ημν +\nhμν (x)\nsmall fluctuation\nIn E & M, used Aμ(x): Aμ → Aμ + ∂μ\nCould define new coordinates:\nx0μ = xμ +μ (x)\nhμν = ημαηνβ hαβ\nhμν GT h0μν = hμν + ∂ν + ∂μ\n→\nμ\nν\nThere's a dramatic change of language when moving from Newtonian gravity\nto Einstein's gravity, but we'll use the same language for string theory as GR.\n(May eventually need to change language for string theory as we understand it\nbetter)\nPlanckian Units\n3 Fundamental Constants:\nG = 6.67 × 10-11\nkg\nm\ns2\n·\nc = 3 × 108 m\ns\n\nkg · m2\nh = 1.06 × 10-34\ns\nSuppose want fundamental length, mass, and time: lp, mp, and tp\nl3\nG = 1\np\n· mptp\nc = 1 lp\n· tp\n\nmplp\nh = 1 · tp\nG h\nlp =\n≈ 1.6 × 10-33cm\nc3\nhc\nmp =\nG ≈ 2.17 × 10-5g\ntp =\nlp ≈ 5.4 × 10-44s\nc\nNote: lp small, tp extremely small, mp fairly large.\n\n~\nLecture 4\n8.251 Spring 2007\nmp\nmpc\nmelectron\nmelectronc\nmproton\nmelectronc\n10-5g\n1019 GeV\n10-27 g\n0.5 MeV\n1 GeV\nNew accelerator LHC will accelerate protons to maximum of 7000 GeV which\nis much smaller than 1019 GeV.\nCosmological Constant\nEnergy density (mass density) ≈ 0.7 × 10-29 g\ncm\nNote critical mass density of universe (to make it flat) is ≈ 10-29g/cm3\nIn Planckian units, mp/l3 = 5.3 × 1093 g\np\ncm3\nPlanckiang vacuum energy = 5.3 × 1093\n= 7.6 ∗ 10122\nTrue vacuum energy\n0.7 × 10-29\nThat's quite an error! Odd because in an equation with order 1, expect solution\nto also be order 1 unless equation very peculiar.\nE & M:\nF = qE~\nE = ρ\nr · ~\nE = -rΦ\nr2Φ = -ρ\nGravity:\nF~ = m~g\ng = -rVg\n~g: gravitational field\nVg: gravitational potential (energy/mass) in all dimensions like E~ = (energy/charge)\nIn 4D:\nQ\nΦ = 4πr\nV (4) = -GM/r\ng\nr2V (4) = 4πGρm\ng\nIn D-dim: r2Vg\n(D) = 4πG(D)ρm (Note: D = number of space-time dimensions,\nd = number of space dimensions, D = d + 1)\nNote: not keeping G the same.\nLHS has units the same in all dimensions.\n\nLecture 4\n8.251 Spring 2007\nRHS's ρm has units that changes with dimension so G must too.\nr · ~g = -4πGρm\n[G(5)] M\nL4 = [G] M\nL3 ⇒ [G(5)] = L · [G]\nr\nlp =\nG h\nc3 ⇒ G = l2\npc3\nh ⇒ [G] = L2 c3\nh ⇒ [G(5)] = L3 [c3]\n[ h]\nG(5) = (l(5)\np )3 c 3/ h\nG(5)\n(l(5)\np )3\n=\nG\n(lp)2\nIn general:\nG(D)\n(lp\n(D))D-2\n=\nG\n(lp)2\nImagine a 5D world with a G(5). Compactify 1 dimension subject to effectively\n4D x1, x2, x3, x4\nr2V (5) = 4πG(5)ρ(5)\ng\nm\nρ(5) = m δ(x 1)δ(x 2)δ(x 3)\nm\n·\n(5)\nρm above has correct units, but correct value? Check by integrating over\nvolume:\nZ\nZ 2πR\ndx1dxxdx3\ndx4ρm = M\nFor a 4D observer:\nρ(4) = Mδ(x 1)δ(x 2)δ(x 3) = 2πρ(5)\nm\nm\n\nLecture 4\n8.251 Spring 2007\nG(5)\nr2\nVg (x1, x2, x3) = 4π 2πR ρ(4)\nx1,x2 ,x3\nm\nG = G(5)/2πR\nSo the extra length is 2πR =length of compact dimension lc\nIf had more compact dimestions, all circles, would get:\nG(D)\n= (lc)D-4 = volume of compact space\nG\nExperimental Implications\nWith current particle accelerators, have explored l ≈ 10-16 cm.\nSince E = hc/l, an l of ≈ 10-18 cm correlates to E = 20TeV.\nSay lp\n(D) = 10-18cm (lp = 10-33cm) for an acc. that could detect\nFind lc:\nG(D)\n(lp\n(D))D-2\n=\n= (lc)D-4\nG\nl2\np\nTake D = 5:\nlc = (lp\n(5))3/lp\n2 = (10-18)3/(10-33)2 = 1012cm = 107km\nIf this were the case, we would have seen this dimension already!\nTake D = 6:\nlc\n2 = (lp\n(6))4/lp\nlc = (lp\n(6))2/lp = 10-3cm\nAt least not laughable.\nBut people don't talk in 10-3 cm. They talk in microns. 1 μm = 10-6 cm =\n10-3 mm\nSo D = 6 gets us lc = 10μm. Note: light's λ ≈ 0.5μm.\n\nLecture 4\n8.251 Spring 2007\nString theory says we live in a D-brane. We and photons and electrons and all\nparticles are open string attached to the D-brane. Can't see out.\nGraviton is closed strings hanging out outisde the D-brane.\n5 years ago, asked experimenters how far had tested gravity. Answer: ≈ cm.\n2006 (hep-ph/0611184 Kapner et al) R ≥ 44μm. So possible that D = 6!"
    },
    {
      "category": "Lecture Notes",
      "title": "lec5.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-251-string-theory-for-undergraduates-spring-2007/0cca13a5a5fa624cb90d0b457692b8d6_lec5.pdf",
      "content": "p\n\nLecture 5\n8.251 Spring 2007\nLecture 5 - Topics\n- Nonrelativistic strings\n- Lagrangian mechanics\nReading: Zwiebach, Chapter 4\nNon-Relativistic Strings\nStudy nonrelativistic strings first to develop intuition and math notation before\nmoving to the relativistic strings that we actually care about.\nNon-relativistic string:\nCharacterized by:\nTension, T0: [T0] = [Force] = [Energy/Length] = M [v2]\nL\nMass/Length: μ0\nT0 ≈ μ0v\nNatural velocity: v =\nT0/μ0\nTransverse Oscillation: Mark point P on string and see it moving up and down:\ny(P, t), x(P, t) = x(P )\n(x not dependent on t)\nSmall Oscillation:\n<< 1\n∂x\n∂y (t, x)\nConsider small section of string:\n\np\np\np\nLecture 5\n8.251 Spring 2007\nApproximate tensions on endpoints as equal (good for transverse waves, terrible\nfor longitudinal)\ndFν = T0\n∂y (t, x + dx) - T0\n∂y (t, x)\n∂x\n∂x\n∂2y\n= T0\n(t, x)dx\n∂x2\n∂2y\n≈ μ0dx ∂t2\n∂2y\n∂2y\n∂x2 - T0/μ0 ∂t2 = 0\nThe Wave Equation! t, x are parameters. Motion described by y(t, x). (If had\nmotion in more than 1 dimension ~y(t, x))\nStretching of string:\nΔl =\ndx2 + dy2 - dx\n= dx( 1 + (dy/dx)2 - 1)\n= dx(dy/dx)2\n((small))\nGeneral form of wave equation:\n∂2f\n1 ∂2f\n∂x2 - v2 ∂t2 = 0\nv: velocity of wave, v =\nT0/μ0\nGeneral Solution:\ny(x, t) = h+(x - v0t) + h (x + v0t)\n-\nNote: the h's are function of 1 variable (x ± v0t) not 2 variables x and t inde\npendently.\nBoundary Conditions: Behavior of endpoints at all times (special points at all\ntimes)\nOpen string:\ny(t, x = 0) = 0\n(Dirichlet condition - for fixed end point)\n∂y (t, x = 0) = 0 (Free BD, Neumann condition)\n∂x\n\nLecture 5\n8.251 Spring 2007\nFor free endpoint (hoop on string), means string must be perp. here\nInitial Conditions: All points on string at some t0 (all points at special time)\ny(λ, t = 0)\n∂y (x, t = 0)\n∂x\nExample:\nFixed Endpoints:\ny(t, 0) = h+(-v0t) + h (v0t) = 0\nLet u = v0t\n-\n= h+(-u) + h-(u)\nh-(u) = -h+(-u)\ny(t, x = a) = 0 = h+(a - v0t) + h-(a + v0t)\nh+(a - v0t) = -h-(a + v0t) = h+(-a - v0t)\nLet u = -a - v0t\nh+(u + 2a) = h+(u)\nVariational Principle\nConsider point mass m doing 1D motion x(t).\nAssume x(ti) = xi, x(tf ) = xf . Under the influence of potential V (x)\nKnow:\n\nLecture 5\n8.251 Spring 2007\nPossible motions:\nNot possible:\nGiven a path:\n\nZ\nZ\n\nZ\n\nZ\n\nZ\n|\n{z\n}\nZ\n\nZ\nR\nLecture 5\n8.251 Spring 2007\nFunctional: S : x(t) ⇒< (not a function of time)\nHamilton's Principle: Principal path makes S stationary.\nCall true path x(t). Consider new path x(t) + δx(t)\nS[x(t) + δx(t)] = S[x] + θ[(δx)2]\nAssume δx(ti) = 0, δx(tf ) = 0\nLagrangian:\nL(t) = Kinetic Energy - Potential Energy\nt2\nt2 1\nS =\nL(t)dt =\nm( x(t))2 - V (x(t)) dt\nt1\nt1\ntf 1\nS[x + δx] =\nm( x + δx )2 - V (x + δx) dt\nti\ntf\n∂V\ntf 1\n= S[x] +\nm x - ∂x (x(t)δx(t)) dt +\n2 m(δ\n- 2 V 00(δx)2\nxδ\nx(t))2\nti\nti\nθ(δx2)\nNeed to eliminate second term.\nR tf\nxδ\n∂V\nti [m x - ∂x (x(t)δ(x(t)))]dt must go away for S[x + δx] = S[x] + θ[(δx)2] to\nbe true.\nCall this the variation δS\ntf\nd\nδS =\ndt\nxδx) - m\n(m\nxδx - V 0(x(t))δ(x(t))\ndt\nti\nIntegrate by parts\ntf\ndS = mx (tf )δx(tf ) - mx (ti)δx(ti) +\ndtδx(t)[-mx - V 0(x(t))]\nti\nδx(tf ) = δ(ti) = 0 from before.\nThe integral\ntf dtδx(t)[-mx - V 0(x(t))] must be 0 too, so:\nti\nmx = -V 0(x(t))\n\nZ\n\nZ\nZ\nZ\n\nZ\nZ\n\nLecture 5\n8.251 Spring 2007\nString Lagrangian\n\nT : Kinetic energy = 1 μ0dx\n∂y\n∂t\n\nPotential Energy = P\nΔlT0 =\nR a 1 dx\n∂y\nT0\nstring\n0 2\n∂x\na\nL =\ndx 2 μ0(∂y/∂t)2 - 2 T0(∂y/∂t)2\ntf\nS =\nL(t)dt\nti\nCall L: Lagrangian Density\n1 μ0(∂y )2\n1( ∂y )\nL = 2\n∂t\n- 2 ∂t\nSo:\ntf\na\n∂y ∂y\nS =\ndt\ndxL\n,\n∂t ∂x\nti\nδy(ti, x) = 0\nδy(tf , x) = 0\nDon't know δy(x = 0, t) or δy(x = a, t)\nδS =\ntf\ndt\na\ndx ∂L δy + ∂L δy0\nti\n∂y\n∂y0\n\nZ\nZ\n\nZ\nZ\nLecture 5\n8.251 Spring 2007\nLet:\nt\nP = ∂L/∂y\nPx = ∂L/∂y0\ntf\na\n∂(δy)\n∂(δy)\nδS =\nPt\n∂t\n+ Px\n∂x\nti\nZ\nZ\n\nZ\nZ\nδS =\ntf\ndt\na\ndx -δy(x, t) ∂Pt\n+ ∂Px\n+\na\ndxPt[δy]tf +\ntf\nx[δy]x=a\nti\nx=0\nti\nti\n∂t\n∂x\nP\nδy(ti) = δy(tf ) = 0\nMust have:\n∂Pt\n+ ∂Px\n= 0 = μ0\n∂2y - T0\n∂2y\n∂t\n∂x\n∂t2\n∂x2\nSome kind of conservation law like ∂μJμ = 0\ntf\ntf\ndtPx[δy]x=a =\ndt[Px(t, x = a)δy(t, x = a) -Px(t, x = 0)δy(t, x = 0)]\nx=0\nti\nti\nFor ∗∈ 0, a:\nPx(t, x∗)δy(t, x∗)\nDirichlet condition:\ny(t, x ) = fixed, δy(t, x ) = 0\n∗\n∗\nFree boundary condition:\nPx(t, x∗) = 0, ∂y/∂x = 0 (Neumann condition)"
    },
    {
      "category": "Lecture Notes",
      "title": "lec6.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-251-string-theory-for-undergraduates-spring-2007/ff2f84174d08a88ac0732145f00b3b7f_lec6.pdf",
      "content": "R\nZ\n\nLecture 6\n8.251 Spring 2007\nLecture 6 - Topics\n- The relativistic point particle: Action, reparametrizations, and equations\nof motion\nReading: Zwiebach, Chapter 5\nContinued from last time.\n∂Pt\n+ ∂Px\n= 0\n∂t\n∂x\nPt = μ0∂y/∂t\nPx = -T0∂y/∂x\nSimilar to ∂μJμ = 0, ∂ρ/∂t + r · J~ = 0, Q =\ndxρ\nFree BC (Neumann BC):\nZ\nPx(t, x∗) = 0 Z\na\nPy =\nμ0dx(∂y/∂t) =\ndxPt\nZ\n0Z\n0a\na\na\n∂Py/∂t =\ndx∂Pt/∂t = -\ndx∂Px/∂x = -[Px(t, x = a) -Px(t, x = 0)]\nConservation of momentum?\nFree Relativistic Particle\nNon-relativistic Action:\nS =\ndt\nmv 2\nCalculation: dv/dt = 0\nRelativistic Particles:\n\np\nZ\nZ\nR\np\nr\n| {z }\n= q\nLecture 6\n8.251 Spring 2007\nEveryone should agree on action. It's a Lorentz invar.\n-ds2 = -ημν dxμdxν\nds = cdt 1 - v2/c2 = cdτ\nds\ns = -mc 2\n= -mc\nds\nc\nP\nP\nSo: s = -mc2\ntf dt 1 - v2/c2\nti\nCheck:\nLagrangian:\nv2\nL = -mc 2\n1 - c2\n1 v2\n= -mc 2(1 -\n- . . .)\nTaylor Expansion\n2 c2\n= -mc 2 +\nmv 2\n| {z }\nrest energy\nkinetic energy\nMomentum:\n∂L\nP~ = ∂~v\n1 -2~v\n= -mc 2 q2 c2\n1 - c\n·\nv\nmv\n1 - v\nc\nHamiltonian:\nmc\nH = p~ ~v - L = . . . = q\n1 - c\n·\nv\nParameterization\nHave parameterization xμ(τ ) (the xμ's are functions of τ)\nds2 = -ημν dxμdxν\n\nZ\nZ\n\nLecture 6\n8.251 Spring 2007\ns\ndxμ dxν\nds =\n-ημν\ndτ\ndτ\ndτ\nZ tf r\ndxμ dxν\ns = -mc\nti\n-ημν dτ dτ dτ\nτ 0(τ ):\ndxμ\ndxμ dτ 0\n=\ndτ\ndτ 0 dτ\ns = -mc\nZ tf\nti\n= -mc\nZ tf\nti\ns\n-ημν\ndxμ\ndτ 0\ns\n-ημν\ndxμ\ndτ 0\ndxν\ndτ 0\ndτ 0\ndτ dτ\ndxν\ndτ 0\n\ndτ 0\nSo using a different parameter, τ 0 (instead of τ ) gets same action s. s is\nreparameterization-invariant.\nR q\nQuick calculation to find equation of motion from s = -mc\n1 - v\nc2\n2 dt. Should\nget derivative of rel. momentum with respect to time = 0.\nS = -mc\ndS\nδS = -mc\nδ(dS)\ndS2 = -ημν dxμdxν\ndxμ dxν\n(dS)2 = -ημν\n(dτ )2\ndτ dτ\n2(dS) · δ(dS) = -2ημν δ dxμ\ndτ\ndxν\ndτ (dτ)2\n\nLecture 6\n8.251 Spring 2007\nd\ndxν\nδ(dS) = -ημν\n(δxμ)\ndτ\ndτ\nds\nMust vary with dxμ/dτ and dxν /dτ , but since ημν is symmetric sufficient to\nvary just dxμ/dτ and multiply by 2.\nδ(dS) = - d (δxμ) dxμ dτ\ndτ\ndS\nZ τf\n\nd(δxμ)\ndxμ\nδS =\nmc\ndτ\ndτ\nds\nZ\nτi\nτf\n\n=\nd (δxμPμ) - δxμ dPμ dτ\ndτ\ndτ\nτi\nδxμ(τi) = δxμ(τf ) = 0\nZ τf\n\ndPμ\ndS = -\nδxμ(τ)\ndτ\ndτ\nτi\nEquation of Motion:\ndPμ = 0\ndτ\nThis means that Pμ constant on world-line. Constant as a function of any pa\nrameter!\ndPμ = dPμ\ndτ\n· dt\n|dt\n{z}\n|dτ\n{z} |{z}\n=0\nd\ndxμ\nd2\nTherefore: dτ\nds\n= 0, ds2 (dxμ) = 0 (if τ = s. Okay because τ is arbitrary.)\nBut can't assign s = τ : d2xμ/dτ 2 == 0.\nd\ndxμ\n= 0\nds\ndτ\n\nZ\nZ\nLecture 6\n8.251 Spring 2007\nCoupling to Electromagnetism\nLorentz Force Equation:\ndPμ\nq\ndxν\ndS = c · Fμν ds\ndPμ\nq\ndxν\ndτ = c · Fμν dτ\nS = -mc\ndS + q\nAμ(x(τ)) dxμ\ndτ\nc\ndτ\nP\nP\nA: Nevitz-Schwartz Tensor"
    },
    {
      "category": "Lecture Notes",
      "title": "lec7.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-251-string-theory-for-undergraduates-spring-2007/2ed11482f84c747194ee6a8bf3a226ce_lec7.pdf",
      "content": "Lecture 7\n8.251 Spring 2007\nLecture 7 - Topics\n- Area formula for spacial surfaces\nArea formula for spatial surfaces\n(\"spatial\" as opposed to \"space-time\")\nConsider 2D surface in 3D space\n3D Space\n~x = (x 1 , x 2 , x 3)\nParameter Space: ξ1 , ξ2 (directions along grid lines. Purely arbitrary. No con\nnection to distances.)\nDescribe surface:\n~x(ξ1, ξ2) = (x 1(ξ1, ξ2), x 2(ξ1, ξ2), x 3(ξ1, ξ2))\nWhat is area, A?\n\nLecture 7\n8.251 Spring 2007\nZ\nA =\ninfinitesimal rectangles\nξ1,ξ2\nMap to surfae:\nd~v1: infinitesimal vector corresponding to dξ1 on ξ1\nTo linear order, these 1, 2, 3, 4 points form a parallelogram\nd~v1: Mapping of bottom line of rectangle = ∂~x (ξ1, ξ2)dξ1\n∂ξ~1\nd~v2: Mapping of left line of rectangle = ∂~x (ξ1, ξ2)dξ2\n∂ξ~2\ndA = base height\n·\n= |d~v1\nd~v2 sin θ\np\n| · |\n|\n=\n|dv1 2 dv2 2 - (d~\nd~v2)2\nv1 ·\n|\ns\n|\n\n|\n\n= dξ1dξ2\n∂~x\n∂~x\n∂~x\n∂~x\n∂~x\n∂~x\n∂ξ1 · ∂ξ2\n∂ξ2 · ∂ξ2 - ∂ξ1 · ∂ξ2\n\nZ\n| {z }\n| {z }\nLecture 7\n8.251 Spring 2007\nA =\ndA\nImportant that this formula is reparameterization-invariant.\nReparam. Invariance\nChoose another coordinate par. (ξe1 , ξe2). Can write as functions of our (ξ1, ξ2)\ncoordinates. Must have:\nZ\ns\n\ndA =\ndξe1dξe2\n∂~x\n∂~x\n∂~x\n∂~x\n∂~x\n∂~x\n∂ξe1 ·\n∂ξe2\n∂ξe2 ·\n∂ξe2 -\n∂ξe1 ·\n∂ξe2\nMetric\nd~x = ∂~x dξ1 + ∂~x dξ2 =\n∂~x dξi\n∂ξ1\n∂ξ2\n∂ξi\nimplicit sum i=1,2\n∂~x ∂~x\nds2 = |d~x|2 = d~x · d~x =\n∂ξi ∂ξj\ndξidξj\nThis is the metric.\n= gij (ξ1, ξ2)dξ1dξ2\n∂~x ∂~x\nWhere metric gij = ∂ξi ∂ξj\nCalled the \"induced metric\" (induced because metric not made up but rather\ndetermined/inherited from the metric in the space the surface was embedded\nin).\n\"\n#\n∂~x\n∂~x\n∂~x\n∂~x\ngij =\n∂ξ1\n∂~x\n· ∂ξ1\n∂~x\n∂ξ2\n∂~x\n· ∂ξ1\n∂~x\n∂ξ1 · ∂ξ2\n∂ξ2 · ∂ξ2\n\nLecture 7\n8.251 Spring 2007\nZ\nA =\ndξ1dξ2√g\nwhere g = det(gij )"
    },
    {
      "category": "Lecture Notes",
      "title": "lec8.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-251-string-theory-for-undergraduates-spring-2007/e653d0e73146e6ba97242ad399e99366_lec8.pdf",
      "content": "p\nq\nq\nLecture 8\n8.251 Spring 2007\nIn general, A =\nR\ndξ1, dξ2√g\nNote a line moving along in ξ1 direction is not necessarily orthogonal to a line\nmoving in ξ2 direction.\nd~v1 = (dξ1 , 0)\nd~v2 = (0, dξ2)\n2D: no reference to 3D space, just 2D space param. by ξ1 and ξ2\ndA = |d~v1||d~v2| sin θ\n(d~v1)2 = gij dv1\ni dv1\nj = g11(dξ1)2\nd~v1 · d~v2 = gij dv1\ni dv2\nj = g12dξ1dξ2\ndA =\n[g11(dξ)2][g22(dξ2)2] - [g12dξ1dξ2]2\n= dξ1dξ2\ng11g22 - g12\n= dξ1dξ2\ndet(gij )\nWorks in any number of dimensions (though here proved only for 2)\n\nLecture 8\n8.251 Spring 2007\nGeneralization to n dimensions\nMetric always a square matrix with a determinant.\nConsider generalized parallelopiped in N dimensions. Volume in terms of corner\nvectors? (Standard from N-dim Euclidean geometry)\nVol = det[Vi\nk]\nwhere k is the vector index and i is the vi subscripts [1, . . . , N]\nCan construct orthogonal vector sets\nv2\n0 involves adding or subtracting as much of v1 to v2 to get orthogonality.\nShifts parallelopiped into rectangle without changing volume. Every operation\nis determinant-invar."
    },
    {
      "category": "Lecture Notes",
      "title": "lec9.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-251-string-theory-for-undergraduates-spring-2007/c274eeae40ff1caf3cefc003b7d243bc_lec9.pdf",
      "content": "Z\nZ\nZ\nLecture 9\n8.251 Spring 2007\nLecture 9 - Topics\n- Change of variable\n1. Change of Variables, 1 Variable\ndx(u)\nf(x)dx =\nfe(u)\ndu\ndu\ndx\nf(x)dx = fe(u)\ndu\ndu\nu = u(x). Assume invertible function x(u)\nfe(u) = f(x(u))\n2 Variables of Integration\nf(ξ1, ξ2)dξ1ξ2\n∂ξi\nLet Mij = ∂ξj\ndv1\ni =\n∂\n∂ξ\nξe1\ni\ndξe1\ndv2\ni = ∂ξi\ndξe2\n∂ξe2\nf(ξ1, ξ2)dξ1ξ2 = f(ξ1, ξ2)dA\ndA = |d~\nv2 sin θ\np\nv1||d~ |\n=\n|dv1||dv2 - (d~v1 · d~v2)\ns\n|\n\n∂ξi ∂ξi\n∂ξj ∂ξj\n∂ξi ∂ξi\ndξe1dξe2\n=\n∂ξe1 ∂ξe1\n∂ξe2 ∂ξe2 -\n∂ξe1 ∂ξe2\n\nq\nq\nq\n\nf f\nZ\nZ\nLecture 9\n8.251 Spring 2007\ndA =\n(Mi1 · Mi1)(Mj2 · Mj2) - Mi1Mi2Mj1Mj2dξe1ξe2\nM1i = (M T )i1\ndA =\n(M T M)11(M T M)22 - (M T M)2 dξe1dξe2 =\ndet(M T M)dξe1dξe2\ndet(M T M) = det(M T )det(M)\ndA = |det(M)|dξe1dξe2\nSo:\n∂ξi\nf(ξ1, ξ2)dξ1dξ2 = fe(ξe1 , ξe2)|det( ∂ξj )|dξe1dξe2\nThe goal is to verify: A =\nR\ndξ1dξ2√g where g = det(gij ) is reparam. invariant.\ngij (ξ) dξidξj = gepq (ξe)dξepdξeq\n·\n∂ξep\n∂ξeq\n= gepq (ξe)\ndξidξj\n∂ξi\n∂ξj\nLet f\n= ∂ξei\nMij\n∂ξj\ngij (ξ) = egpqMpiMpj\n= ( f\nf\nM T )ipgepq Mqj\nM T ef\n= ( f gM)ij\ng = det(gij ) = det(M\nfT )gdet\ne\n( f\ng|det( f |2\nM) = e\nM)\ndet( f\nM)\nM T ) = det( f\nA =\ndξ1dξ2√g =\ndξe1dξe2det(u)\np\ne\nM)\ngdet( f\n∂ξi ∂ξek\n∂ξi\n(M f\nf\n=\n=\nM)ij = MikMki\n∂ξek ∂ξj\n∂ξj\nIf i =6\nj, this equals 0. If i = j, this equals 1. Therefore, we have δj\ni .\n\nZ\np\np\nLecture 9\n8.251 Spring 2007\ndet(M) = det( f\nM)\nA =\ndξe1dξe2\neg\nGoal: Write area functional for spacetime surface. Just did this for a surface in\nEuclidean space. Now do for a surface in Mintowsk space (so there's a negative\nsign instead of all positive signs).\nChange of notation: (ξ1, ξ2)\n(τ, σ) where τ is \"like time\" and σ is \"like time\".\n→\nTarget space:\nxμ = (x 0 , x 1 , . . . , x d)\nD = d + 1 = space time dimension. d = spatial dimension.\nMapping:\nxμ(τ, σ) = Xμ(τ, σ)\nXμ sometimes called \"string coordinates\". σ has a finite range. For a closed\nstring, periodic. τ can have an infinite range.\ndXμ\ndXμ\nArea constructed from: dv1\nμ = dτ dτ , dv2\nμ = dσ dσ.\nBy analogy: dA =\n(dv1 · dv1)(dv2 · dv2) - (dv1 · dv2)2?\nThe problem is that the number under the square root is less than 0, and we\ndon't want an imaginary dA!\nStatic String:\nX0(τ, σ) = cτ\nXi(τ, σ) = f i(σ)\ndv1\nμ has only μ = 0 component.\ndv2\nμ has only μ = 0 components.\ndv1 · dv1 < 0\ndv2 · dv2 > 0\ndv1 · dv2 = 0\nTherefore:\n\ns\ns\nLecture 9\n8.251 Spring 2007\ndA =\n√\n< 0\nSo instead:\n\n∂X ∂X\n∂X ∂X\n∂X ∂X\ndA = dτdσ\n∂τ · ∂σ\n- ∂τ · ∂τ\n∂σ · ∂σ\n\n∂Xμ ∂Xμ\n∂Xμ ∂Xμ\n= dτdσ\n∂τ\n∂σ\n-\n∂τ\n∂τ\n· · ·\nConsider worldline xμ(τ): dxμ is timelike. Particle moves slower than light.\ndτ\nConsider point P on worldsheet of a string. Worldsheet described by τ and σ\nso:\nXp = Xμ(τP , σP )\nIf all points P on string ∃ a point P 0 on string at time Δt. uP 0,P is timelike\nthen string moving slower than light.\nThe worldsheet is the area swept out by the string over time.\n\nLecture 9\n8.251 Spring 2007\n1. ∀P ∃ spacelike tangent\n2. Just saw ∀P ∃ timelike tangent too.\nWill use 1 and 2 to show dA =\n√\n> 0.\nConsider tangent vectors at P spanned by ∂Xμ (P ), ∂Xμ (P ).\n∂τ\n∂σ\nConsider 1 parameter family of vectors.\n∂Xμ\n∂Xμ\nvμ(λ) =\n+ λ\n∂τ\n∂σ\nLinear combination of ∂Xμ/∂τ and ∂Xμ/∂σ with coefficients 1&λ. Most agreed\nwould have 2 arbitrary coefficients, but here only care about direction.\n\nv 2(λ) = λ2 ∂X\n+∂x ∂X ∂X + ∂X\n∂σ\n∂σ · ∂τ\n∂τ\nGet quadratic equation for λ\n-b ±\n√\nb2 - 4ac\nλ =\n2a\n\nLecture 9\n8.251 Spring 2007\nIf b2 - 4ac ≤ 0 will get complex (not real) roots. So b2 - 4ac > 0."
    },
    {
      "category": "Lecture Notes",
      "title": "lec10.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-251-string-theory-for-undergraduates-spring-2007/e338d09d623b05f00e2c0f7c43cbd736_lec10.pdf",
      "content": "Lecture 10\n8.251 Spring 2007\nLecture 10 - Topics\n- Relativistic strings: Nambu-Gotto action, equations of motion and bound\nary conditions\nReading: Section 6.1 - 6.5\nS ∝ world-sheet area (A)\nUnits of const. of proportionality\n[S] = [\nR\ndtL] = Energy × time = ML2\nT\n[World Sheet Area] = L2\n[Const. of Proportionality] = M\nT\nRecall for tension T0: [T0] = [Force] = ML .\nT0 = M . So let T0/c be constant\nT 2\nc\nT\nof proportionality for S ∝ A.\nNambu-Gotto Action\nZ τf\nZ σ1\nq\nS = - T\nc\nτi\ndτ\ndσ (X · X0)2 - (X )2(X0)2\nX μ\n∂Xμ\n∂Xμ\nwhere\n= dτ . X0 = dσ . The two tangents to the surface.\nThis defines the dynamics of the string.\nWorld sheet metric: Let ζ1 = τ , ζ2 = σ.\nDistance between 2 points on the worldsheet:\n-dx2 = dXμdXμ = ημν dXμdXν\n∂Xμ ∂Xν\n= ημν\ndζαdζβ\n∂ζα ζβ\n= γαβ (ζ)dζαdζβ\nwhere γαβ = ημν ∂Xμ dXν\n∂ζα ∂ζβ\nX 2\nXX0\nγαβ =\nXX0\n(X0)2\nString world-sheet metric. All signs from the η are in the X's. So:\n\nZZ\nq\nLecture 10\n8.251 Spring 2007\nT0\ndτdσ√-γ\nS = - c\nwhere γ = det(γαβ ). Lorentz invar., reparam invar.\nZ τf\nZ σ1\nX =\ndτ\ndσL(X μ, X0μ)\nτi\nLagrangian Density:\nL(X μ, X0μ) = - T0\n(X\nX0)2 - (X )2(X0)2\nc\n·\nδS = 0\nZ τf\nZ σi\n∂L ∂(δXμ) ∂L ∂(δXμ)\nδS =\ndτ\ndσ\n+\n∂X μ\n∂τ\n∂X μ\n∂σ\nτi\nδX μ = δ ∂Xμ\n∂τ\nDefine:\n∂L = Pμ\nτ = - T0 q(X · X0)Xμ\n0 - (X0)2X μ\n∂X μ\nc\n(X\nX0)2 - (X )2(X0)2\n·\nXX0)\n∂L\nσ\nT0 (\nXμ - (X )2Xμ\n∂X0μ = Pμ = - c\n√. . .\nThings will simplify soon.\nSo:\nZZ\n\nτ\nσ\nδS =\ndτdσ ∂ (δXμ\nτ ) + ∂ (δXμ\nσ ) - δXμ( ∂Pμ + ∂Pμ )\nμ\nμ\n∂τ\nP\n∂σ\nP\n∂τ\n∂σ\nδS = 0 so ...\nμ\nμ\n∂Pτ\n+ ∂Pσ\n= 0\n∂τ\n∂σ\nFor open strings:\nZ τf\nσ\ndτ [δX0(τ, σ1)Pσ(τ, σ1)-δX0(τ, 0)Pσ (τ, σ1)+δX1(τ, σ1)P σ)(τ,σ1 )-δX1(τ,0)P1 (τ,σ1)+...+δXd ...]\nτi\n2D Constraints.\n\nLecture 10\n8.251 Spring 2007\nFor most, get choice as to how the term vanishes since product of 2 terms (so\neither can be 0).\nFor μ = 0:\n1. Dirichlet BCs: Xμ(τ, σ ) =constant, δXμ(τ, σ ) = 0 (for σ = 0 or σ1)\n∗\n∗\n∗\n2. Free BCs: Pμ\nσ(τ, σ ) = 0 for σ = 0 or σ1.\n∗\n∗\nFor μ = 0:\n1. ∂X0/∂τ < 0 can't have Dirichlet.\n2. Free BCs. Pσ(τ, 0) = Pτ (τ, σ1) = 0."
    }
  ]
}