{
  "course_name": "Studies in Literary History: Modernism: From Nietzsche to Fellini",
  "course_description": "How do literature, philosophy, film and other arts respond to the profound changes in world view and lifestyle that mark the twentieth century? This course considers a broad range of works from different countries, different media, and different genres, in exploring the transition to a decentered “Einsteinian” universe.",
  "topics": [
    "Fine Arts",
    "Media Studies",
    "Humanities",
    "History",
    "Intellectual History",
    "Literature",
    "Comparative Literature",
    "Criticism",
    "Fine Arts",
    "Media Studies",
    "Humanities",
    "History",
    "Intellectual History",
    "Literature",
    "Comparative Literature",
    "Criticism"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nCourse Description\n\nHow do literature, philosophy, film and other arts respond to the profound changes in world view and lifestyle that mark the twentieth century? This course considers a broad range of works from different countries, different media, and different genres, in exploring the transition to a decentered \"Einsteinian\" universe.\n\nCourse Requirements\n\nClass Format\n\nThe class format for 21L.709 is group discussion with informal lectures by the instructor. Students are required to turn in a term paper (15 pp.) at the end of the term and a preliminary draft of this paper (5-7 pp.) midway in the term. The paper should present a detailed comparison of two works studied in the course. In addition, each student is asked to present a talk in class (12 min.) on an assigned work on its assigned date. The talk should help stimulate discussion by means of arguments and questions. Papers and talks are conceived as exercises in literary interpretation through close analysis. They should be focused on specific passages from the texts under consideration and should balance detail with generalization.\n\nReadings\n\nReadings for this course include works by the philosopher Friedrich Nietzsche, the painter Paul Cezanne, the composer Arnold Schoenberg, the fiction writers James Joyce and Franz Kafka, the film directors Fritz Lang and Federico Fellini, and others. For a list of readings, please refer to the\nReadings\npage.\n\nGrading\n\nThere will be no final exam.\n\nACTIVITIES\n\nPERCENTAGES\n\nPapers\n\n60%\n\nClassroom participation (including presentation)\n\n40%\n\nMIT Statement on Plagiarism\n\nPlagiarism--use of another's intellectual work without acknowledgment--is a serious offense. It is the policy of the Literature Faculty that students who plagiarize will receive an F in the subject, and that the instructor will forward the case to the Committee on Discipline. Full acknowledgment for all information obtained from sources outside the classroom must be clearly stated in all written work submitted. All ideas, arguments, and direct phrasings taken from someone else's work must be identified and properly footnoted. Quotations from other sources must be clearly marked as distinct from the student's own work. For further guidance on the proper forms of attribution, consult the style guides available at the\nWriting and Communication Center\nand the\nMIT Web site on Plagiarism\n.\n\nCalendar\n\nLEC #\n\nTOPICS\n\nKEY DATES\n\nIntroductory: What does \"modern\" mean?\n\nFriedrich Nietzsche,\nThe Will to Power\n\nNietzsche,\nThe Will to Power\n(cont.)\n\nKate Chopin,\nThe Awakening\n\nLawrence, D. H. \"\nOdour of Chrysanthemums\n\"\n\nFranz Kafka,\nThe Trial\n\nFranz Kafka,\nThe Blue Octavo Notebooks\n\nCezanne, Nijinsky, Schoenberg, Monk\n\nJames Joyce,\nUlysses\n\nVirginia Woolf, \"Modern Fiction\" in\nThe Common Reader\n\nJoyce,\nUlysses\n(cont.)\n\nWoolf, \"Modern Fiction\" in\nThe Common Reader\n(cont.)\n\nJoyce,\nUlysses\n(cont.)\n\nWoolf, \"Modern Fiction\" in\nThe Common Reader\n(cont.)\n\nJoyce,\nUlysses\n(cont.)\n\nWoolf, \"Modern Fiction\" in\nThe Common Reader\n(cont.)\n\nJoyce,\nUlysses\n(cont.)\n\nWoolf, \"Modern Fiction\" in\nThe Common Reader\n(cont.)\n\nMarcel Proust,\nSwann's Way\n\nPreliminary draft due\n\nProust,\nSwann's Way\n(cont.)\n\nVirginia Woolf,\nTo the Lighthouse\n\nWoolf,\nTo the Lighthouse\n(cont.)\n\nWalter Benjamin,\nBerlin Childhood around 1900\n\nBenjamin,\nBerlin Childhood around 1900\n(cont.)\n\nMartin Heidegger,\nPoetry, Language, and Thought\n(\"Building Dwelling Thinking\")\n\nMartin Heidegger,\nPoetry, Language, and Thought\n(\"The Thing\")\n\nFilm Theory\n\nLang, Fritz. M. (1931)\n\nCocteau, Jean. Beauty and the Beast (1946)\n\nFellini, Federico. 81⁄2. (1963)\n\nTerm paper due",
  "files": [
    {
      "category": "Resource",
      "title": "On growing up",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-709-studies-in-literary-history-modernism-from-nietzsche-to-fellini-fall-2010/db752c7a03d46662d4d1b69bc6843b15_MIT21L_709F10_assn03.pdf",
      "content": "MIT Student\nOn growing up.\nWalter Benjamin, Martin Heidegger, Friedrich Nietzsche\nMuch as the study of the human brain benefits from a close examination of its\ndevelopment, the study of the human psyche and thought process has much to gain from an\nanalysis of the thinker as he is growing up. It seems obvious, after all, that an individual‟s\nperception should be affected by his experiences. Our very understanding of the objects\naround us depends on our being able to name and categorize them, and to understand their\ninterrelation. We understand buildings, shelves, and water-glasses because we understand\ngravity, and we understand complex social situations by having had experience with\npeople. Most importantly, through interacting with the world and forming memories of it,\nwe come to understand the boundaries of our mental and physical self. For that reason, a\nchild who has not yet learned the delimitations of his existence uses his surroundings to\ngather meaning much as we use our memories.\nWalter Benjamin‟s Berlin Childhood around 1900 gives insight on the process by\nwhich the child narrows the generalizations with which he interprets the world around him.\nThis maturation of perception and understanding brings with it an enhanced ability to deal\nwith abstract concepts, to remove oneself from one‟s immediate situation and be able to\nconsider it at a metaphorical distance. There is also, however, something lost in this\nincreased systematization of thought. Though associative memory is useful for practical\n\napplications, the wildly associative perception of a child provides for him a rich\nimagination and fantasy, an interpretive power beyond that offered by logical analysis.\nBerlin Childhood laments the loss of this mental agility as much as it simply remembers.\nNot yet having learned to think of himself and of others in a way characteristic of\nhis time and place, little Walter is perhaps closer to the Nietzschean transcendence of his\nworld than can be any person deliberately trying to return to his state. Indeed, he\ncommunicates with the world around him in a way that is closely reminiscent of\nNietzsche‟s field theory of energy. The spaces of his mind and his imagination are\nsometimes even like those of Heidegger in his relationship to them. However, Walter uses\nlanguage and objects in a way that is not at all in keeping with Heidegger‟s theories. For a\nyoung mind that has not yet been cluttered with experience and history, the metaphysical\nand historical context of an object and its noun are insignificant in comparison to the\nfantastical plotline he, personally, weaves around them.\nBenjamin captures Walter at a state where he is not yet certain of the quality of his\nown existence, or of the language he uses to describe it. The lack of precision of words,\nhowever, holds in it a greater capacity for expression than does the original set of\nmeanings. While the correct grouping of the words Muhme Rehlen holds its own\nbackground, for instance, the child‟s interpretation of them is fantastically more significant.\nThe mummerehlen calls up not the academic reference to an \"old nursery rhyme that tells\nof Muhme Rehlen,\" but an allusion to a mythical creature that manifests its traces in \"the\n\ndiamond-shaped pattern... of barley groats or tapica,\" that draws connections between\nvarious experiences. \"The line is distorted,\" as it has strayed far from its original meaning,\n\"yet it contains all of childhood\" just as Proust‟s madeleine contained for him his memory\nof his. The child has not at this point learned to use language as a tool common to all that\nknow it to some degree of sophistication. Instead, his words hold for him associations\nformed by his previous interactions with the situations containing them. In a sense,\nlanguage becomes a vehicle for Proustian associative memory, as it is the first thing the\nchild finds present in all of his encounters, and therefore the first thing he allows himself to\ngeneralize.\nIn this associative function of language, there is also a creative and transformative\npower that is lost once the meanings and implications of words become more standard.\nWhen Benjamin says that he \"had learned to disguise [him]self in words, which really were\nclouds,\" he speaks for a highly subjective idea of language that is disconnected from the\nmature and largely grammatical distinctions of subject and object, proper and common\nnoun. To be able to imitate a piece of furniture and to allow it to \"distort\" is to give the\nfurniture more power and presence than one would usually presume furniture to have. The\nchild marks no separation between himself and the world of objects around him. Walter is,\nin fact, as much \"distorted\" by his surroundings as is the Muhme Rehlen‟s line \"distorted\"\nby his misunderstanding of the words.\nWalter‟s use of language also includes a transformative component that affects\npeople around him. \"As far as I was concerned, [the street my aunt lived on] was not yet\n\nnamed after Steglitz. It was the Stieglitz, the goldfinch, that gave it its name. And didn‟t my\ngood aunt live in her cage like a talking bird?\" Whereas most people will not be\nparticularly concerned with the street names of their acquaintances unless they are\nparticularly far into Cheapside, Walter uses this street name to associate with his aunt‟s\npresence a characterization of her personality, in terms of her knowledge of the people\naround her and her willingness to share it. This reappropriation of language does not\nrequire a modification of the constituent parts: the word, in this case is the same, and just\nits associations different. It is, however, arguably in a much more useful context than the\noriginally intended one: the qualification of the aunt‟s personality is more evocative than\nher mere physical location.\nThis freedom of language speaks against Heidegger‟s implication of a shared\netymological tradition that gives words their life and subliminal significance. It is, of\ncourse, possible to analyze the expressions of a child in terms of their implied roots: \"the\nOld High German word thing\" will still mean \"gathering\" regardless of its author. There\nwill always be a common implied set of meanings in language that comes from the process\nof the formation of the language being used. It does not make sense, however, to analyze a\nyoung child‟s language in terms of its historical context because a child‟s primary use of\nwords will be too subjective too be effectively summarized by anything common to anyone\noutside of his direct sphere of interaction. Heidegger‟s understanding of language is too far\nremoved from the intention of the speaker to truly be representative: the speaker becomes\nthe combined historical tradition of the Western world.\n\nIn most applications, it may be useful to examine a historical context for the\nlanguage being used, as it provides insight into the palpable meaning of the expressions.\nThis approach is more applicable, however, when the person in question has enough\nexperience with the language to be versed in its proper use. The condition of intelligibility\ndoes not apply to a child in the same way that it does to an adult for the simple reason that\nthe child may not be trying to express the same thing. As a person grows older, his\nexperience with language allows him to begin to participate in the tradition of its history.\nHis use of words will reflect the way that he has been taught to use them, and intuitively\ntherefore allow insight into the way he conceptualizes the ideas he is expressing. A child,\nhowever, will use language in a way that is personal to himself: in a sense, he can be said\nto use his own language and method of. Walter‟s mummerehlen has little to do with the\nMummer Rehlen regardless of its etymological roots.\nOf course, language is not the only thing allowing Walter his imaginative capacity:\nsome elements of pure fantasy intercede without assistance. Nothing is only what it seems,\nin his world: the shadow of a wolf‟s jaws are \"so vast and so gaping that they must have\ndenoted the wolf Fenrir, which I, as world destroyer, set prowling in the... room.\" The\nhippopotamus at the zoo \"dwelt in its pagoda like a tribal sorcerer on the point of merging\nbodily with the demon he serves.\" The presence of things novel to Walter‟s world inspire\nthe creation of a story for their existence. There is a curious blending of dream and reality\n\nthat shapes the world around him to reflect the emotional content of thoughts that he\nperhaps cannot yet put into words.\nSome visual hallucinations serve as better representations of Walter‟s feelings than\ncan any collection of words. His feeling of being reprimanded for being late to school, for\ninstance, is more succinctly served by the statement that \"the clock in the schoolyard wore\nan injured look because of [his] offense\" that it would have been by any verbal admission\nof guilt or penance. Modern-day expression of emotion is largely dependent on an ordered\nset of phrases that correspond to particular emotional states. These states can be crudely\ndescribed with one-word labels that hold specific but complicated meanings. Using any one\nof them to describe a state of being requires a separate set of qualifications. Walter‟s\nmethod of visual analogy is no less accurate in describing his state of mind than is a\ndetailed verbal description provided by someone more adult.\nImplied in the use of fictional scenarios to describe his emotion is a closer\nrelationship with the characters and objects involved than would be allowed by the adult\npsyche. The representation of mental states as physical occurrences is something that we\ntend towards only in metaphor, and yet it is quite commonplace in Walter‟s conception of\nself. It is possible that the child has not yet learned to make the distinction between himself\nand his surroundings to an extent that would allow him to disengage himself entirely from\nthem. Walter‟s incomplete definition of the boundaries of his existence and of the existence\nof things around him is more evocative of a Nietzschean perception of fields of energy than\nit is of a more traditional distinction of subject and object. Thus, Walter finds himself\n\ninteracting directly with things that are not within the adult‟s domain of conscious thought.\nThe snowflakes he observes through the window are not the symmetrical crystalline\nremnants of a distant cloud: they are individual in a way that one only truly comes to\nunderstand by studying many separate specimens, and yet that Walter intrinsically grasps.\nThe white monotony of their congregation develops into bands of snowflakes with which\nWalter is able to ally himself \"as intimately as possible.\"\nUnlike the spontaneous and involuntary memories and associations experiences by\nProust, however, Walter‟s incorporation of self into his surroundings has a strong voluntary\ncomponent. Walter‟s transcendence stems from his extreme awareness of the pure physical\npresence of the things he interacts with: when he sees something for its intended purpose\nand not for its presence in and of itself, his transformation does not occur. \"The dining\ntable under which he has crawled turns him into the wooden idol of the temple,\" a mask\nthat he cannot shake but with a violent \"cry of self-liberation.\" Walter is able to\ndeliberately forgo that arrangement by noticing the hiding places in his house for their\nvirtue as hiding places alone. However, there is a primal quality to the \"demon that has\ntransformed [him]\" that threatens to engulf him if he is not quick enough to escape,\nspeaking to a power inherent in these objects that the child alone can recognize because he\nis not yet limited to perceiving things in terms of their purpose alone.\nThe snowflakes can hardly be said to be just snowflakes at this point: they have\ntranscended their literal definition. Indeed, the child may be said to use words differently\n\nby sheer virtue of having a different understanding of their objects. It is also at this point\nimpossible to say that the child has a conception of objects that corresponds to Heidegger‟s\nfour-fold, as Heidegger‟s definition of an object rests largely on its function. Heidegger‟s\njug is a jug by virtue of containing and pouring out, while Benjamin‟s jug is likely to be the\njug on his grandmother‟s table.\nIt is surprising how much Walter is able to perceive and think of at once: while he is\npaying careful attention to the snowflakes, he is also able to feel the greater consequences\nof the snowstorm. \"Distance, when it snows, leads no longer out into the world by rather\nwithin,\" where the physical demarcation of one‟s environment presents an individual with\nthe situational security necessary for him to allow his mind to expand into other geographic\nfrontiers. Much as Virginia Woolf‟s candles draw reflections in the windows and bring\ntogether the guests at her dinner party into a finally cohesive whole, the white snow-shroud\nbrings all of Walter‟s stories to crowd around him and \"play familiarly among themselves,\nlike the snowflakes,\" from the gathering of which he is able to wander freely among the\ndistant lands he has imagined.\nThe books Walter reads and handles as a child are not to be merely read: they are\nentities in and of themselves, with landscapes of \"ridges and terraces\" and self-contained\npersonalities. Walter‟s memories of the stories within them are very personal and quite\nphysical in nature: one does not get the impression that he recalls characters frolicking in\nall of those diverse lands, but rather that he imagines his own presence in them. Perhaps he\n\nis always somewhat present in those distant lands, with his \"heart [that] has forever kept\nfaith with the well-thumbed volumes.\" As Heidegger allows for the perception and\npresence in space by his own peculiar sort of expansion that places him on both sides of his\nmetaphorical door, Benjamin‟s child is similarly present in all of the places that he has at\nsome point imagined. The distinction to be made is that Walter‟s presence in space is as\nmuch a presence in space that does not actually exist: boy‟s books of old with \"stormy\ngoings-on\" that exist in his dreams and yet are never opened are as much his dwelling place\nas is his physical inhabitation.\nThis subjectivity of perception, nevertheless, is not entirely lost in the process of\none‟s growing up. What is lost is more likely to be the reasoning behind a similar set of\nemotions. Walter‟s regard of the postcards sent by his grandmother and his resulting\nperception of the places they came from are not so hard to understand. Though it may be\ndifficult for a concretely-thinking person to look at the handwriting on a postcard and think\nthat the \"places as so entirely occupied by [his] grandmother that they become colonies of\"\nher residence, the sentiment is easy to relate to: not having been to the locations depicted\non the postcards, a person will likely draw his experience of them largely from these\npostcards. His thoughts and recollections of them, therefore, will be very much influenced\nby this initial experience with them. As an adult, one may use the logical train of thought to\narrive at a conclusion more or less similar to the one that Walter experienced initially- it is,\nhowever, a conclusion as detached from actual experience as is the representation of a\nfeeling in writing.\n\nAll of this is not to say that there is nothing gained from growing up. The gaining of\nexperience over time allows the individual an understanding of himself and of the world\naround him that while likely beginning on an academic level, will hopefully eventually\ntranscend to a true change in perspective. As one ceases to be a child, one learns to live by\nthe laws of the world around him. It takes more time, however, to learn that the laws\nconcerning thought and action are not the natural laws that mean \"that something cannot\nalso be something else ... that it is neither free nor the reverse, but merely thus or thus.\"\nThere are certain aspects of life and human interaction that children do not\nunderstand whose true conception seems to come only with experience and time. The\nCavalier‟s song that Walter is promised to \"understand when [he is] grown up\" does not\nhold any meaning to him until he is older, for instance, and has learned about the meanings\nof love and death and how they apply to him. Benjamin describes this to be a semantic\nunderstanding, however, more than it is meaningful in any real way: \"the empty grave and\nthe heart weighed in the balance [are] two enigmas to which life still owes [him] the\nsolution.\" It is not to be doubted that having an understanding of the process of death, a\nlengthy contemplation of its effects on self and others, allows one a greater familiarity with\nthe concept and perhaps even an acceptance of it. These are not, however, things that allow\nus to relate to its implications.\nThe little boy‟s admiration of Luise von Landau and her subsequent death were not\nthings that he, as a child, could fully comprehend. To compensate, he created a monument\n\nfor her in his imaginative interpretation of \"the flowerbed on the riverbank,\" a space\n\"resplendent and inviolable\" as his memory of her. As Walter was growing up, he \"never\nset foot\" on that distant and inviolable flower bank. He came back to it later, presumably\nhaving some greater understanding of his feelings, and yet was not able to glean any\ngreater consolation. When he came to \"pass quite close to the flowerbed,\" or to look love\nand death in the face, \"it seemed to bloom less often.\" His academic insight and dissection\nof spiritual phenomena gave him no real comfort, until he came to realize that\nunderstanding the Cavalier‟s song did not give him any insight into its true meaning.\nIn some sense, little Walter‟s relationship to love was as sophisticated as it could\nget. Walter understood very early the difference between idealistic expectation and the\nrealities of his world. \"How much was promised by the name „Court Hunters‟ Lane,‟ and\nhow little it held. How often I searched in vain among the bushes\" for something that only\nthere in imagination, and how often one finds himself disappointed by looking in another\nperson for something that one may only truly find within himself. Walter learns the\ninaccessibility of his ideals by being unable to reach the statues and crocuses of which he\ncomes to be enamored. He learns that the object of his true affections is unattainable, and\nthat his attempts to reach it will more likely than not fail to bring him the satisfaction he\nimagines. As a child, he cannot dream to walk up to his beloved statue because there is a\nstream in the way- and he cannot stray from his governess to explore the Luise‟s\nflowerbed. \"Thus, coldly, the princely had to rest upon the beautiful\" that was not to be\n\nreached. What is a physical reality translates to a mental one as well: the unattainable is,\nafter all, unattainable.\nAs an adult, Walter attempted to push the boundaries of his dominion and explore\nthe flowerbed, \"but now it seemed to bloom less often... and no longer did it know the\nname which we had once together honored.\" The unattainable was no less unattainable for\nattempts to attain it: indeed, the thing Walter came to forget as an adult is that it was he\nwho \"wove together [this garden plot] so intimately with the beloved name.\" The\nknowledge and understanding gained during his maturation in some cases served to\nundermine understanding that was already present.\nThough Nietzsche speaks of the individual in terms of a field of energy that\ninterpenetrates all the energy fields around it, he allows for a limitation of one‟s existence\nthrough the process of expansion and contraction. A child who is just begging to explore\nthe world around him will not have yet established the balance between these two functions\nof his self, and is thus able to lose himself with unfathomable ease. In terms of perception,\nthe child will generalize with insufficient specificity. Not yet aware of the full background\nof the words he uses, he creates his own associative language that serves him just as well.\nThe child, therefore, finds himself in a world quite different from that of the adults, and\nonly gradually introduces common terms that will lead him to a theoretically more\nenlightened state.\n\nGrowing up, while it allows the child to understand on a very mechanical level the\nworkings of the world around him, does not allow any more true insight into its\nmotivations and thoughts than was present in the child initially. What a child has lost in his\nmaturation is what philosophy attempts to gain through years of deep and arduous thought.\nHow long did it take Nietzsche to come up with the idea that all objects interact with each\nother, and all have the same basic capacity and power to affect change? A child will\nunderstand this, inherently, before he learns the names and interactions of the objects he\nencounters.\nOf course, an understanding of the world is insufficient in and of itself, as a child\ndoes not yet possess the tools to be able to explain the more contrived interactions around\nhim that are just as important by virtue of their presence. Heidegger‟s language comes to be\nuseful in this situation, as it allows a common context for the expression of thoughts\ncoming from different sources. The problem is that the etymological understanding of\nlanguage is limited in range to the subset of its users and audience who are likely to find it\nrelevant. A child who uses words in his own manner may very well find it more convenient\nto express himself with images and fantastical plotlines the moral of which we may be left\nto ponder, and in this may even speak with greater specificity.\nIt is, however, obviously not possible to express everything with images, and even\nless possible to create parables with morals corresponding to each message that one wishes\nto convey. What growing up really allows the individual, then, is the power of abstraction\nfrom his immediate context by use of a standardized set of tools in his perception and his\n\nlanguage. Some perceptual delicacies are lost in the acquisition of these tools, and perhaps\nfewer are gained. The process allows the individual to begin to recapture his original,\ninherent manner of thought and perception in a way that becomes directly applicable to\nboth the physical and metaphysical aspects of his surroundings. What is lost in fantasy is\nmade up by a more precise expression of emotion, and what is lost in associativity is\ncompensated by the accumulation of memories that converse among each other in a similar\nway. The adult, thus, is able to remain fundamentally the same person as the child, but\nlooks out through a different, ever-adjustable mask.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.709 Studies in Literary History: Modernism: From Nietzsche to Fellini\nFall 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Reading Nietzsche in Swann's Way and To the Lighthouse",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-709-studies-in-literary-history-modernism-from-nietzsche-to-fellini-fall-2010/c63ba2d2a37aab3e628a70921bad76a0_MIT21L_709F10_assn02.pdf",
      "content": "MIT Student\nReading Nietzsche in Swann's Way and To the Lighthouse\nIn The Will to Power Nietzsche describes the difference between what he calls the\nDionysian and Apollonian ways of understanding the reality of the world:\nApollo's deception: the eternity of beautiful form; the aristocratic\nlegislation, \"thus shall it be for ever!\"\nDionysus: sensuality and cruelty. Transitoriness could be interpreted as\nenjoyment of productive and destructive force, as continual creation. (The Will to\nPower, 1049)\nThis passage illustrates Nietzsche's understanding of time as an essential element in the\nindividual's relationship to the universe. Nietzsche understands the Apollonian mode as\nperforming a conflation of beauty and immortality, suggested by his situating the phrase that\ndescribes the relationship between the two entities, \"the eternity of beautiful form,\" in a mere\nsentence fragment that entirely avoids suggesting the sort of cause and effect relationship (that is,\na relationship by which eternity comes about logically through or because of beauty, or vice\nversa) that one usually uses in making aesthetic or moral judgments. Nietzsche's description of\nthe relationship between beauty and immortality as \"aristocratic\" suggests his belief that this\nrelationship is an arbitrary and false relationship enforced not by nature but by human authority.\nThe relationship between beauty and immortality is of course quite complicated, as the\nnotion of form suggests. Form, in a sense, can be understood as beauty (or aesthetic judgment)\nextended across time. Form compares objects with one another; it comes out of the similarities\nand differences that can be noted among objects and it essentially reduces the multiplicity of\nindividual entities and objects into a single trait. The beauty of an object perishes along with that\n\nobject; the beauty of a form, in contrast, exists across history, such that the beauty of the human\nbody today can be understood as the very same beauty that the first human body possessed. It is\na static and single beauty. To speak of the beauty of a body is to speak essentially of all bodies\nand thus no individual body at all.\nImportantly, the Apollonian concept of meaning extends beyond \"beauty\" to include any\nquality by which an object might be defined in comparison with other objects and experiences.\nNietzsche's choice to use \"beauty\"can be understood as somewhat arbitrary, since it is not the\nspecific quality under consideration but rather the way in which that quality becomes meaningful\nthat is important in Nietzsche's discussion.\nIn contrast with the Apollonian, which defines meaning by extension forwards and\nbackwards through time, to Nietzsche the Dionysian mode comes about through the recognition\nof the temporality of objects and meanings. Transitoriness, the inevitable yielding of all things to\ntime, is the result of a \"productive and destructive force\"-- destructive in that objects of the past\nare lost but productive in that it is only through the very loss of the past that the future can come\nabout. Nietzsche locates within the Dionysian process of continual destruction and rebirth an\neternal reality to replace the Apollonian \"deception\" of eternal beauty: \"the eternal will to\nprocreation, to fruitfulness, to recurrence; the feeling of the necessary unity of creation and\ndestruction\" (The Will to Power, 1050). In a sense we can understand the Apollonian mode as\nbeing concerned with the preservation of a quality (such as beauty) along the axis of time and as\nwilling to sacrifice the uniqueness of each object in the interest of preservation; likewise, we can\nunderstand the Dionysian mode as being concerned with the opposite function, a function that\neliminates the uniqueness of the discrete historical moment-- essentially reducing all moments in\ntime into a single endless moment, \"the abyss of transitoriness\"-- in order to explore and expand\n\nthe limitless, unique qualities of the objects that occupy it. Thus in Dionysian thought,\nmeaningful relationships between objects are based on their shared presence in the moment and\ntheir shared interactions with the force of change that both generates and destroys.\nInterestingly, and somewhat counterintuitively, Nietzsche's descriptions of these modes of\nthought reveal how the Apollonian effort to preserve meaning across time has the destructive\neffect of eliminating individual meaning, while the Dionysian embrace of the very transitoriness\nof the object and the moment opens up a wealth of new meanings based on an exploration of the\nways in which these objects navigate the force of change.\nOur readings of Proust and Woolf, because of the concern in their work for locating the\nmeanings of objects and experiences as they relate to the inevitable passing of time, can be\ninformed by Nietzsche's writings on the Dionysian and the Appollonian.\nThe first section of To the Lighthouse, entitled \"The Window,\" explores the thoughts and\nexperiences of various characters, paying close attention to the ways in which the characters\nderive satisfaction and meaning from their experiences in relation to one another. In the\nfollowing passage, for example, Lily Briscoe and William Bankes share the experience of\nwatching a boat on the water:\nThey both felt a common hilarity, excited by the moving waves; and then\nby the swift cutting race of a sailing boat, which, having sliced a curve in the bay,\nstopped; shivered; let its sails drop down; and then, with a natural instinct to\ncomplete the picture, after this swift movement, both of them looked at the dunes\nfar away, and instead of merriment felt come over them some sadness-- because\nthe thing was completed partly, and partly because distant views seem to outlast\n\nby a million years (Lily thought) the gazer and to be communing already with a\nsky which beholds an earth entirely at rest. (To the Lighthouse, p. 34)\nThere are several layers of meaning working in this passage. There are, of course, the\nphenomena that the characters witness, the ocean waves, the sailboat, the dunes, all of which\nseem to exist in an objective reality. Also present are the subjective emotional experiences that\nthese phenomena incite within the characters, namely, joy by the waves and the boat, and shortly\nthereafter sadness by the quiet landscape; this level of meaning exists within an individual\ncharacter. Additionally, there is a way in which the comparison of the subjective experiences of\nthe individual characters generates another level of meaning-- they feel a \"common hilarity\" and\nperform actions of response in unison (\"both of them looked at the dunes far away\"). The\nsuggestion of two characters experiencing identical emotions extends, in a sense, the significance\nof the emotion from being contained within a single character's subjectivity to being a part of the\nexperience of the universal human experience. At first this effect of broadening and\nuniversalizing the human emotional experience seems to be the most significant effect of the\npassage-- the general insularity of the characters' narration in To the Lighthouse has the effect of\ncreating a sense of personal isolation that infrequent moments of genuine connection tend to\nrelieve-- however, Lily's thoughts at the end of the passage have somewhat of the opposite effect\nin that they question the very value of human meaning in the first place.\nLily notices the absurdity of the fact that human beings tend to prioritize the meanings\nthey provide or generate in relation to nature over nature itself despite nature's certainty to outlast\nhumanity. She recognizes that, despite the seeming simplicity of the inherent meanings of the\nwaves or the dunes (specifically, that they are not meaningful at all but merely exist beyond\nquestion or purpose) in comparison to the complex human meanings that are situated in societal,\n\npsychological, or philosophical systems, these inherent meanings are in fact far more resilient.\nThe reality of the natural world is secure: man's attempts to fit nature into an ordered, subjective\nstructure of meaning can have no effect on a world \"entirely at rest.\"\nThe security of the natural world in this passage contrasts with the transitoriness of\nmeaning that Lily and William Bankes experience. The image of the sailboat letting fall its sails\nindicates a completion of an action; the phrase \"swift cutting race\" suggests the briefness and the\ninevitable end of all purpose and intention-- as a race only exists by its very ending, and only in\nbeing won, and thus in being exhausted of significance, comes to be completed, so any purpose\nby definition exists to be fulfilled and, in being fulfilled, is at once emptied. In such a way this\npassage addresses one of Nietzsche's main concerns in his discussion of the Apollonian and the\nDionysian, the concern with time and the temporality of existence. It is a realization of the\ntemporariness of human meaning and experience by Lily that reveals the permanent meaning of\nnature and the world in itself.\nThe middle section of Woolf's novel To the Lighthouse, entitled \"Time Passes\" describes\nthe changes that occur to the Ramsay family's summer house as the house stands abandoned for\nyears after Mrs. Ramsay's death. The characters whose thoughts and actions populate the first\nsection of the novel, \"The Window,\" disappear for most of \"Time Passes,\" reflecting the general\nconcern of each section: whereas \"The Window\" explores how meaning is created by the human\nsubject, \"Time Passes\" examines how meaning both continues and fails to function in the\nabsence of a thinking, perceiving subject.\nIn spring the garden urns, casually filled with wind-blown plants, were\ngay as ever. Violets came and daffodils. But the stillness and the brightness of the\nday were as strange as the chaos and tumult of the night, with the trees standing\n\nthere, looking before them, looking up, yet beholding nothing, eyeless, and so\nterrible. (To the Lighthouse, p. 203)\nAs in the previous passage, Woolf presents the objective world in great detail, naming the types\nof flowers growing in the garden; the mentions of \"spring\" and \"the brightness of day\"\nemphasize the gaiety that would be perceived by a human viewer. However, without a perceiver\nto comprehend and categorize them, the qualities of \"stillness\" and \"brightness\" that would be\nmeaningful to the human mind remain \"strange as the chaos and tumult of the night.\" Woolf\nrepresents the universe as a dichotomy between a natural, primordial chaos that exists beyond the\nscope and time of human society and a meaningful but artificially constructed human reality; her\nuse of images of darkness and light to describe the chaotic natural world and the human world\nrespectively suggests the absolute importance of perception in the generation of human meaning.\nDarkness, after all, cannot be seen and is, in fact, defined by the very way in which it resists sight\nand thus prevents the generation of knowledge, while light allows for perception and thus opens\nthe way to the creation of meaning. Thus whatever is not perceived by a human subject remains\nentirely chaotic, as the signs of the coming spring season in Woolf's passage that might under\nother circumstances be perceived as gay and bright remains \"strange.\" The final image of the\npassage, which describes the unthinking, unperceiving trees as \"terrible,\" performs a subjective\ninterpretation of the experience of chaotic reality. The narrator of this passage acknowledges the\nreality of a natural chaos that exists entirely outside human knowledge and is unable to resist\nmaking a subjective value judgment upon this reality, suggesting the impossibility of a true\ncomprehension of reality by human thought; the human subject will inevitably interfere in and\nalter the perception of reality it renders.\nWoolf's novel, then, can be understood as addressing Nietzsche's concepts of the\n\nApollonian and Dionysian worlds as discussed in the introduction to this paper. Both passages\nfrom To the Lighthouse discussed above demonstrate the way in which Woolf draws meaning out\nof the very obliteration of objects and perceptions: Lily's perceptions and emotions are transient\nand the human perceptions of the house and its garden are completely eliminated, but the passing\nof these temporary human meanings is necessary in order to reveal a glimpse of objective truth\nthat they cover, namely, the reality of chaos and darkness, a reality that resists human\nunderstanding: the Dionysian ocean of simultaneous destruction and creation, in which meaning\nonly exists without shape or form. The characters in To the Lighthouse consistently experience\nwhat Nietzsche might describe as the Apollonian anxiety of attempting to providing structure and\nmeaning to a chaotic world-- in a sense, this very struggle, that of the individual working to\ncontain the immensity of the universe within his or her limited subjective experience, can be\nunderstood as the primary conflict of the novel.\nEarly in \"The Window\" Mrs. Ramsay experiences the power of the chaos of the ocean:\n\"this sound which had been obscured and concealed under the other sounds suddenly thundered\nhollow in her ears and made her look up with an impulse of terror.\" In this moment she\nrecognizes a reality underneath that which she normally experiences, that of the Dionysian\nchaos, but it is a reality that seems to be \"hollow\" or without meaning. This recognition of the\nhollowness of objective truth poses a threat to the familiar concepts of human meaning (as,\nearlier in the passage, Mrs. Ramsay imagines the waves causing \"the destruction of the island\nand its engulfment in the sea\") and thus generates a negative sensation of fear.\nIt seems that Woolf fully recognizes Nietzsche's categories of Dionysian and Apollonian,\nrecognizes, in other words, the chaotic nature of the universe upon which human beings impose,\nthrough thought and language, the artificial structures of their societies and personal\n\nperspectives. However, Woolf engages with these categories in a different manner and with a\ndifferent attitude than Nietzsche. Nietzsche expresses through his writing a desire to embrace\n\"the world as it is, without subtraction, exception, or selection\" (The Will to Power, 1041) and a\nview of human consciousness as mere illusion caused by the appearance of causality; he writes\nof \"the absurd overestimation of consciousness, the transformation of it into a unity, an entity:\n'spirit,' 'soul,' something that feels, thinks, wills\" (The Will to Power, 529). To Nietzsche, any\nassertion of the Apollonian human perspective must necessarily perform violence against the\nDionysian truth. Woolf, in contrast, views the \"triumph of Apollo,\" the activity of human\nconsciousness and creativity in a chaotic world, as something to be celebrated. Each of the three\nsections of To the Lighthouse explores the challenges faced by human characters as they attempt\nto assert their individual wills and structured perspectives upon a fluid, chaotic world. In \"The\nWindow,\" the dinner party that occurs near the end of the book works as a figuration of the great\nconflict between structured, Apollonian human unity and the chaos of the world; \"they were all\nconscious of making a party together in a hollow, on an island; had their common cause against\nthat fluidity out there\" (To the Lighthouse, p. 147). It is upon the success of this dinner party that\nthe characters' senses of happiness and fulfillment depends. Indeed the entire novel ends with\nLily's victorious assertion of structure upon the natural world as she completes her work of art :\n\"with a sudden intensity, as if she saw it clear for a second, she drew a line there, in the centre\"\n(To the Lighthouse, p. 310). The way in which Woolf aligns the human capacity to achieve\npersonal fulfillment with the expansion and maintenance of human structures of meaning upon a\nchaotic world suggests that, in contrast with Nietzsche's perspective, it is in the very imposition\nof human subjectivity that meaning can be created. Whereas Nietzsche interprets human thought\nas a process that ignores and thus eliminates the uniqueness of each transcient moment and of the\n\nboundless reality occupying that moment, Woolf understands the process of generating\nApollonian meaning as being more valuable than the recognition the reality of the unstructured\nworld. Ultimately, the disagreement between Nietzsche and Woolf can be understood as being\nbased in a difference of priority: whereas Woolf's argument uses the tendencies of human nature\nas a measure of value-- essentially arguing that the value of the objective world comes from its\nability to serve human subjectivity-- Nietzsche prioritizes an understanding and acceptance of\nthe inherent chaos of the universe. Woolf understands the imposition of meanings upon the world\nas a testament to the power, courage, and value of the human subject-- she understands human\nmeaning to be arbitrary and artificial, but recognizes the expression of energy in the process of\ncreating meaning as being itself a sort of absolute meaning-- while Nietzsche takes the\nartificiality of human meaning to be proof of its insignificance.\nProust addresses the relationship between perception and reality in his novel Swann's\nWay. In particular Proust explores the nature of the process by which individuals create\nmeaningful experience. The following passage, in which the narrator Marcel describes his sexual\nexperiences as a youth, illustrates some of Proust's ideas about uniqueness and value:\nI was still, and must for long remain, in that period of life when one has\nnot yet separated the fact of this sensual pleasure from the various women in\nwhose company one has tasted it, when one has not yet reduced it to a general\nidea which makes one regard them thenceforward as the interchangeable\ninstruments of a pleasure that is always the same. (Swann's Way, pp. 221-222)\nProust describes in this passage how objects and the qualities they possess come to be removed\nfrom one another. The narrator identifies two very different ways he has appreciated the sexual\npleasure that women have provided for him: as a youth he understood pleasure as belonging\n\nindividually and uniquely to each of the women with whom he experienced it, while as an adult,\nin contrast, he experiences the different moments pleasure he experiences with each woman as\nbeing the same pleasure. In fact, the adult narrator is able to recognize only the uniformity of all\npleasure; the women have lost their individual values and have become mere \"interchangeable\ninstruments\" subordinate to the pleasure itself. Proust identifies in this passage the same process\nNietzsche associates with the violence of Apollonianism: the recognition an object for its form-\nthe recognition of which requires comparison to other objects-- and for the attributes it shares\nwith other objects instead of for its uniqueness and for the value of its being in and of itself. In\nother words, the value of a woman can be determined either by her individuality, in a Dionysian\nprocess in which case the value is located objectively in the woman herself and in the specific\npleasure she alone can provide or, alternatively, by the extent to which she conforms to\nsubjective expectation. This latter sort of value, the Apollonian value, locates the value of an\nobject in the subject that perceives it, in a sense obliterating any inherent value contained within\nthe object itself. In a sense, it is this process of creating Apollonian value, a value that prioritizes\nthe perception of the human subject over the reality of the world, that Woolf is interested in\nexploring and, arguably, promoting in To the Lighthouse. In contrast, Proust in Swann's Way\nattempts to locate the meaningfulness of existence in beauty and complexity of the Dionysian\nworld\nIn Swann's Way Proust figures the Dionysian appreciation of life as it is as a celebration,\nthrough emotional and sensory attentiveness and through description, of nature and of objects; as\nthe above passage illustrates, this Dionysian mode is associated closely for Proust with\nchildhood, while Apollonian categorization is associated with the adult world. In fact, Proust\nviews the adult world, particularly the world of society, as being formed entirely of subjective\n\ncategorizations:\nIn the end they come to fill out so completely the curve of his cheeks, they\nfollow so exatcly the line of his nose, they blend so harmoniously in the sound of\nhis voice as if it were no more than a transparent envelope, that each time we see\nthe face or hear the voice it is these notions which we recognize and to which we\nlisten. (Swann's Way, pp. 23-24)\nIn this remarkable passage Proust demonstrates the violence of subjective perception. As Proust\nunderstands it, this violence works through replacement; over time, human beings come to\nreplace the actual object with which they interact with their mental concept of that object. In the\npassage above, the actual material presence of the person under consideration, rendered in\nphrases like \"the curve of his cheeks,\" \"the line of his nose,\" comes to be replaced by mere\n\"notions,\" until it is only those subjective notions, and not at all the actual individual to whom\nthose notions seem to refer, with which the narrator interacts. The subjective mind, in other\nwords, is continually erasing actual objects and replacing them with artificial notions. To Proust,\nthe adult conception of reality is not founded in any sort of objective reality at all, but rather in\neach person's individually constructed notions of reality.\nImportantly, in Swann's Way this replacement of an objective Dionysian reality with the\nApollonian notion is a process that occurs over time, concurrent with and related to the process\nof growing up from a child into an adult; based on this logic Proust locates in the experience of\nhis childhood a sort of objectivity-- he seems to measure the value of his narrator's experiences\nlargely by his sense of their authenticity to the objects that participate in them, the extent to\nwhich they interact with and comprehend the unique, true objects themselves and not mere\nperceptions of those objects. Of course, it is impossible for Proust to escape subjective\n\nperception. In fact, he often measures the value of an object is by considering the amount of\nsubjective memories and feelings that the object yields; the evocation of these memories and\nfeelings, however, are distinctly treated not as a manipulation of the object by the subject's fitting\nit into a specific function but rather as a way in which the object comes to exert its power over\nthe perceiving subject. In other words, in Proust, the relationship between the human perceiver\nand the thing being perceived is not one of domination by the subject of a submissive object; it is\nrather a cooperative process in which the mutual energy of the perceiver and the object come\ntogether to produce a complex and continually changing set of perceptions, memories, thoughts,\nand feelings\nThe following description of a stained-glass window demonstrates the complexity of the\nrelationship between the human perceiver and object he perceives:\nThere was one among them which was a tall panel composed of a hundred\nlittle rectangular panes, of blue principally, like an enormous pack of cards of the\nkind planned to beguile King Charles VI; but, either because a ray of sunlight had\ngleamed through it or because my own shifting glance had sent shooting across\nthe window, whose colours died away and were rekindled by turns, a rare and\nflickering fire-- the next instant it had taken on the shimmering brilliance of a\npeacock's tail, then quivered and rippled in a flaming and fantastic shower that\nstreamed from the groin of the dark and stony vault down the moist walls, as\nthough it were along the bed of some grotto glowing with sinuous stalactites that I\nwas following my parents. (Swann's Way, pp. 81-82)\nThere is a remarkable fluidity of power in this passage. It remains unclear to Marcel, for\nexample, whether the change he notices in the brightness of the window is due to the natural\n\nenergy of the sun-- \"because a ray of sunlight had gleamed through it\"-- or is an effect of his\n\"own shifting glance.\" In other words, the powers of objectivity, represented here by the\nsunlight, and of Marcel's subjectivity are confused. Marcel never determines the cause of the\nchange and seems, in fact, quite unconcerned with doing so; he is much more interested in the\neffect itself. Proust describes in exquisite detail Marcel's perception of the colorful window; by\ncomparing the window to a \"peacock's tail\"-- a living animal-- and using verbs such as\n\"quivered\" and \"streamed\" that generate a sense of motion and energy, Proust emphasizes quite\ndramatically the vitality the window seems to possess. To young Marcel the window has a\ntremendous effect and causes him even to reinterpret his surroundings. In a reversal of the\ntraditional Apollonian subject/object relationship, in which it is the subject that acts upon the\nobject, fitting the object into a predetermined structure of meanings and eliminating the object's\nuniqueness, in this moment in Swann's Way it is the very object with which Marcel interacts-- the\nstained-glass window-- that subordinates him, using its power to remove him from the church\nand placing him into a \"grotto glowing with sinuous stalactites.\" It is almost as if the passage\nunder consideration is a description of the combination of Marcel's perception of the window and\nthe window's perception of Marcel.\nProust finds value in the processuality of perception, in the unexpected way that out of\nthe brief subjective perception of a seemingly simple object can spring an infinity of experiences\nand emotions; this process is explored in the narrative structure of Swann's Way, in which\nsensory perceptions, emotional recollections, character portraits, and stories are continuously\ninterwoven. In other words, to Proust meaning is generated not out a sense of direction towards a\ngoal of structure and knowledge but rather out of an understanding of the very transcience of\nexperience and knowledge-- objects are understood as being connected not by similarity of\n\nquality or form (a vertical, metaphorical similarity that effectively preserves a broad category or\nattribute over time), but by similarity of situation or context (a horizontal, metonymic similarity\nof being connected by place and action, of simply being alive and present, or, in Nietzsche's\nterms, of possessing \"the eternal will to procreation, to fruitfulness, to recurrence; the feeling of\nthe necessary unity of creation and destruction\"). This is in contrast with the way meaning is\ndefined in Woolf's To the Lighthouse, in which, as discussed above, value is generated through\nthe effort of the human subject to contain the object within structures of intellectual and social\nthought, an effort which has the effect of resisting the destructive effects of time.\nEven the titles of the two novels, Swann's Way and To the Lighthouse, when we examine\nthe significance of the image to which each title refers in the broader context of each novel,\nreflect the great philosophical differences between them. The title To the Lighthouse references a\ntrip to the island lighthouse near the Ramsay's house, the feasibility of which is questioned\nthroughout \"The Window,\" that is made only near the very end of \"The Lighthouse,\" the final\nsection of the novel. The title Swann's Way refers to a path, one of two, along which the narrator\ntakes frequent walks with his family. Both titles refer to journeys-- both novels are, after all,\nabout the \"journey\" of the human subject attempting to discover the meaning of experience-- but\nthe two journeys are remarkably different. Woolf's journey is unidirectional, a movement from\none place to another, without return and with a specific goal in mind; perhaps most significantly,\nit is a journey that exists for most of the novel entirely in the future. This suggests the inherent\nunachievability of Woolf's Apollonian generation of meaning-- its very existent depends on the\nconflict between human reason and natural chaos. Proust, in contrast, embraces natural chaos and\nthe transcience of subjective thought. Proust's journey is circular; the starting point and the\nending point are the same-- Marcel's home at Combray. In other words, it is a journey without a\n\ngoal (or a journey with a goal that is being constantly achieved), a journey for the pure sake of\nenjoyment, the significance of which is located not in a specific future destination to be reached\nbut rather in the continually recurring present moment of the journey and in the details and\npleasures to be found inhabiting that moment:\n...a sound of echoless footsteps on a gravel path, a bubble formed against\nthe side of a water-plant by the current of the stream and instantaneously\nbursting-- all these my exaltation of mind has borne along with it and kept alive\nthrough the succession of the years, while all around them the paths have\nvanished and those who trod them, and even the memory of those who trod them,\nare dead. (Swann's Way, p.259)\nThus it is apparent that Proust in Swann's Way and Woolf in To the Lighthouse, though they are\nboth concerned with meaning and the relationship of the human subject to the world, explore the\nproblems in markedly different ways.\n\nWorks Cited\nNietzsche, Friedrich. The Will to Power. New York: Random House, 1968.\nProust, Marcel. In Search of Lost Time, Volume 1: Swann's Way. New York: Random\nHouse, 2003.\nWoolf, Virginia. To the Lighthouse. New York: Harcourt, Brace & Company, 1955.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.709 Studies in Literary History: Modernism: From Nietzsche to Fellini\nFall 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Sex and Knowing in the Modern World",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-709-studies-in-literary-history-modernism-from-nietzsche-to-fellini-fall-2010/f1d5c0c98d7fcb1aede99fec31d61b75_MIT21L_709F10_assn01.pdf",
      "content": "MIT Student\nModernism\nSex and Knowing in the Modern World\nD.H. Lawrence's Odour of Chrysanthemums1 and Kafka's The Trial depict very different worlds.\nThe former is a portrayal of Elizabeth Bates, a woman confronted with the death of her coal miner\nhusband. It is largely a realistic story in that its physical and social dynamics closely mirror those of our\nown world. Indeed, many of the details are drawn from Lawrence's own life. In contrast, The Trial's\nprotagonist, K., attempts to navigate the surreally draconian workings of a modern bureaucracy. The\ntexts' tones similarly differ: Chrysanthemums's vivid descriptions of characters' thoughts and feelings\nconnect us to full‐fledged human beings whereas The Trial's elliptical factualness causes its characters to\nseem distant; the surreal nature of the events The Trial only increases their otherness. However, despite\nsuch differences, each work seeks to describe the barriers between the self and others, and, indeed, the\nbarriers within the self. Sex strengthens these barriers, primarily by giving the illusion of intimacy.\nElizabeth and K., however, meet with different fates. The death of Elizabeth's husband gives her a\nrenewed, albeit dark, understanding of the world, while K. is unable to transcend his ignorance and is\nexecuted. Ultimately, Chysanthemums and The Trial depict a common struggle to understand human\nnature in a world confused by sex and delimited by mechanistic and bureaucratic structure, but their\ndistinct tones lead their protagonists to different ends.\nChrysthanthemums depicts a woman coming to understand how little she knew of her husband.\nThe first part of the story is an indirect description of Elizabeth's perception of the relationship. She says\nto her daughter, \"if your father comes he'll carry on and say there never is a fire when a man comes\nhome sweating from the pit.--A public‐house is always warm enough\" (8). These bitter lines show that\nElizabeth expects an argument when her husband returns; to her, he seems ungrateful, preferring drink\n1 For the page numbers, I am using the online text from:\nhttp://odour.nottingham.ac.uk/view.asp?version=D&page=1 . This matches the version of the text linked to on the\nsyllabus, though it seems as though there are some other versions.\n\nto his family. From the outset, though, small pieces of evidence accumulate against her explanation for\nhis late return. When asking her daughter about her husband, her daughter replies \"Has he come up an'\ngone past, to Old Brinsely? He hasn't, mother, 'cos I never saw him\" (7). Elizabeth dismisses this fact,\nsaying \"he'd take care as you didn't see him, child\" (7). However, for a man who was \"heered... in the\n'Lord Nelson' braggin' as he was going to spend that b‐‐‐‐ afore he went\" (5), such caution seems\nstrange. Later, when she goes to visit the Rigleys, Mrs. Rigley says, \"Oh, Jack's been 'ome an 'ad 'is\ndinner long since\" (13), making her husband's disappearance even more disturbing. Elizabeth is not\noblivious to such clues, and her \"anger\" starts to become \"tinged with fear\" (12). However, she\nnonetheless perseveres with her explanation for her husband's lateness. As a consequence, she makes a\nnumber of predictions which ominously foreshadow his death. For instance, she says \"Eh, he'll not come\nnow till they bring him... He needn't come rolling in here in his pit‐dirt, for I won't wash him. He can lie\non the floor\" (10). Indeed, her husband is brought in and laid on the floor. Further, while Elizabeth\nintends \"pit‐dirt\" to refer to the mine, it also suggests the dirt of the pit where his body will eventually\nbe laid to rest. Elizabeth's predictions reflect her imperfect understanding of her husband: they are true\non a superficial level, but entirely wrong in their judgment of his character. Just as she does not predict\nwhy her husband will be \"brought in,\" so too is she ignorant of the troubles which impel him to quarrel\nand drink.\nThe second half of the story describes Elizabeth's realization of the vast distance between\nherself and her husband. When she sees his body, she knows that \"Life with its smoky burning gone\nfrom him, had left him apart and utterly alien to her\" (27). Devoid of life, his body takes on an aura of\notherness to her. Yet, this otherness had always been present in their relationship; it had only been\nmasked by the \"smoke\" of life: he was a \"separate stranger with whom she had been living as one flesh.\nWas this what it all meant--utter, intact separateness, obscured by the heat of living? ... Each time he\nhad taken her, they had been two isolated beings, far apart as now\" (27). Elizabeth thus comes to\n\nunderstand how little her knowledge of his body connected her with his mind. Indeed, her carnal\nknowledge of him actually \"obscured\" their separateness, tricking her into trusting a false knowledge of\nhim. Elizabeth's feeling of removal extends beyond her husband: she \"felt the utter isolation of the\nhuman soul, the child within her was a weight apart from her\" (26). Chrystanthemums is thus a story\nabout our inability to penetrate beyond the outermost shell of others, even those we should be closest\nto. We project onto their bodies images of drinking husbands or innocent children, but such images are\ninevitably simplistic, a reflection primarily of the gulf of separation between people.\nSuch separation is not limited to Elizabeth's relationship with her husband. The mother, for\ninstance, seems not to recognize either the man's faults or the horror of his last moments: \"He went\npeaceful, Lizzie,‐‐peaceful as sleep\" (27) she says of them. In contrast, the doctor says that he was \"\n'Sphyxiated... It is the most terrible job I've ever known... Clean over him, an' shut 'im in, like a mouse\ntrap'\" (23). Just as Elizabeth's former understanding of her husband centered on his body, so too is the\nmother's perception tied to his physical appearance. \"White as milk his, clear as a twelve‐month baby,\nbless him, the darling!\" she says, \"Not a mark on him, clear and clean and white, beautiful as ever a child\nwas made... Isn't he beautiful, the lamb?\" (27). Yet, we know from Elizabeth's memories that her\nhusband was quite capable of viciousness and drunkenness, traits that hardly suggest a \"lamb.\" The\nmother is instead seeing the man as the child he once was or she imagines he once was. She is aided in\nthis illusion by the deceptions of his body. His pale skin is caused by his death,2 yet the mother views it\nas a sign of innocence and purity. As was once true with Elizabeth, the mother uses the man's body to\nconfirm a superficial conception of his mind.\nThe gulf between perception and reality is also apparent with The Trial's K. and the numerous\ncharacters he meets. For instance, when K. is called for an initial inquiry, he entirely misunderstands the\n2 The skin or eyes of people who die from asphyxia are sometimes damaged from burst blood vessels, so it's\npossible the mother is deceiving herself on a more literal level. The narrator, though, describes the man as \"of\nhandsome body, and his face showed no traces of drink\" (26). Since no other disfigurement is noted, it seems that\nthe mother is probably not mistaken about his appearance.\n\nnature of the proceedings. K. immediately focuses on the difference between the left and right halves of\nthe crowd. The right half generally seems to be supportive, applauding K. when he speaks (43) while the\nleft half remains silent. From this, K. somehow concludes that \"The people in the party on the left, who\nwere in fact less numerous, may have been no more important than those in the party on the right, but\ntheir calm demeanor made them appear more so. As K. now started to speak, he was convinced that he\nwas expressing their thoughts\" (44‐45). Even early on, then, K.'s conclusions about the actors in this\nsituation seem strange. It is unclear, for instance, why K. should think that he was expressing the\nthoughts of the silent party. As is often the case in The Trial, the description of the scene is mysteriously\nelliptical in that we are presented with very few of the nuances which we would normally use to analyze\ntone; all the information is presented in a matter‐of‐fact and analytical style. Notably, the narration\nnever addresses the oddity of such a stark division in a public courtroom. As another example, when the\nmagistrate asks K. whether he is a house painter, K.'s reply--that he is \"the chief financial officer of a\nlarge bank\" (44)--provokes laughter from the right half of the hall. Yet, it is unclear what precisely is\nfunny. K., who joins in, clearly believes that they are laughing at the magistrate's error. However, it\nmight just as well be that they are laughing at K.'s indignation or at the humiliating position of one so\nsocially powerful. Such questions cannot be answered in The Trial: the narration tells us nothing of K.'s\ntone and only says of the laughter that it is \"hearty\" (44). Just as K. seems unable to understand others'\nactions, often viewing them only as they relate to him, the experience of reading The Trial similarly\ndistances us from the characters through its factual tone. The inquiry scene concludes by overturning\nK.'s assessment of the proceedings. After the washerwoman screams, K. realizes that \"They all had\nbadges, as far as he could see. They were all one group, the apparent parties on the left and right\" (52).\nK. thus badly misreads the situation at his inquiry, evincing little understanding of any of the actors or\ntheir purpose.\n\nFlirtation and sex similarly distort K.'s assessment of people. When K. returns to the scene of the\ninquiry, he once again meets the washerwoman who begins to flirt with him and offers to help him. K.\nresponds well to her grabbing his hand (56), but is repulsed by her complimenting his eyes, thinking \"So\nthat's all it is... she's offering herself to me; she's depraved, like everyone else around here... so she\naccosts any stranger who comes along with a compliment about his eyes\" (57‐58). He dismisses her,\nsaying \"I don't think you can help me\" (58). However, after she seductively \"[stretches] out her legs,\n[and pulls] her dress up to her knee\" (61), K.'s attitude changes. Suddenly, \"The woman did tempt him,\nand no matter how hard he thought about it, he could see no good reason not to give in to that\ntemptation. ... And her offer of help sounded sincere, and was perhaps not without value\" (62). Though\nlittle about the nature of her offer has changed, K.'s view changes dramatically and he \"easily brushed\naway\" \"the fleeting objection that the woman was ensnaring him on the court's behalf\" (61). As with\nElizabeth, sex gives K. a false sense of knowing.\nA counterargument to viewing K.'s interpretative ineptness as a personal failure would be to\nargue that this failure stems from the complicated and paradoxical world in which K. resides. In this\nview, the court system is an elaborate sham: K. never hears his charges, the magistrate mistakes him for\na house painter, and his lawyer never produces any tangible results in his defense. K.'s inability to\nunderstand this system that ensnares him is not his own failing, then, but rather the result of the\nmaliciousness and opacity of the society he lives in.\nWhile it is true that The Trial reflects many of the concerns with modern society, the\ncounterargument overlooks the personal nature of K.'s \"trial.\" Indeed, events relating to the trial\nsurreally pervade the most private spaces in K.'s life: his trial begins in his bedroom (3) and eventually\nviolates the safety and comfort of his workplace (80). Additionally, K. exhibits an internal\n\"bureaucratization\" which is often the cause of his problems rather than the bureaucracy of the court\nsystem. The first suggestion that K.'s issues are internal comes from the conversation with the inspector.\n\nOf K.'s situation, the inspector says \"you've misunderstood me; you're under arrest, certainly, but that's\nnot meant to keep you from carrying on your profession. Nor are you to be hindered in the course of\nyour ordinary life\" (17). Rather than being locked up by a repressive government, K. is simply informed\nthat he is \"under arrest\"--that is, restricted or in stasis in some way. Yet, until the executioners come at\nthe end of the novel, no physical restrictions are ever placed on him. K.'s \"arrest,\" then, is of a mental\nsort. Indeed, K. exhibits \"arrested\" thinking in a number of ways. First, his life is described as ordered\nand static. In his desk, \"everything lay in perfect order\" (7) and his days are dominated by routine: \"That\nspring, K. generally spent his evenings as follows: after work, if there was still time... he would take a\nshort walk.... Then go to a tavern... In addition, K. paid a weekly visit to a woman named Elsa\" (20).\nSimilarly, his thought processes reveal a bureaucratic thoroughness. When speaking to the magistrate,\nfor instance, he unnecessarily addresses technical objections to his statements, leaving them as\nconfusing and indirect as the proceedings against which he is protesting:\nYour question, Your Honor, about my being a house painter--and you weren't really asking at\nall, you were telling me outright--is characteristic of the way these proceedings against me are\nbeing conducted. You may object that these aren't proceedings at all, and you're certainly right\nthere, they are only proceedings if I recognize them as such. But I do recognize them, for the\nmoment, out of compassion, so to speak. One can only view them compassionately, if one\nchooses to pay any attention to them at all. I'm not saying these proceedings are sloppy, but I\nwould like to propose that that description for your personal consideration. (45)\nK.'s arrest is not manifested in the prison bars of a totalitarian state, but rather seems to be a comment\nabout K.'s state of mind. Like Kafka, K. is a bureaucrat, and The Trial is about his thinking rather than a\nbroken judicial system.\nK.'s \"bureaucratic\" thinking leads to much of his aimlessness and failure to defend himself in his\ntrial. He is resistant to change, and throughout the novel searches for an easy way to acquit himself. This\ndesire is apparent in K.'s conversation with Titorelli. The painter describes how \"there are three\npossibilities: actual acquittal, apparent acquittal, and protraction\" (152). The latter two involve constant\neffort over time, and consequently K. prefers the first option, speaking of it \"as if speaking to himself\n\nand to his hopes\" (154). Instead of seriously pursuing his defense, K. either does nothing or uselessly\npursues gimmicks he hopes will provide an easy resolution to his trial. When K.'s uncle comes to visit,\nthe uncle perceives that K. does not take his situation seriously: \"And you sit there calmly with a criminal\ntrial hanging over your head?\" the uncle exclaims (91). Even later on, K. still exercises little agency in his\ndefense. Though he believes \"these efforts must be continuous, with everything organized and\nsupervised\" (126), he finds \"the difficulty of composing the petition was overwhelming. At one point,\nabout a week ago, it was only with a sense of shame that he could even contemplate having to prepare\nsuch a petition some day; that it might be difficult had not even occurred to him\" (126). K. understands\nintellectually that vast efforts need to be put into his defense, yet he is pathetically ineffective at\nmotivating himself. When he is advised to consult the painter Titorelli, however, K. immediately goes to\nsee him, despite understanding that the hope for any real help is \"vague... and slender\" (139). K. thus\nfinds himself unequal to the task of his defense. Though he believes that \"all he had to do now was turn\nthe abilities that had made [his rise in the bank] possible partially toward his trial\" (125), he seems\nunable to adapt those skills to a new task. Instead, he is paralyzed by its difficulty, able only to dither\nabout a relatively unimportant petition. K.'s trial is thus as much of an internal struggle as an external\none, and the strange bureaucracy which characterizes the trial is similarly a reflection of the\nbureaucratic nature of K.'s own mind. As such, K.'s inability to understand the people he encounters\nshould be understood as a personal failing rather than the result of a sinister and manipulative society.\nK.'s bureaucratic nature is undoubtedly influenced by modern society, but The Trial is a story about an\nindividual.\nThe ominous foreshadowing of Odour of Chystanthemums and the frequently atonal exposition\nof The Trial both depict characters grappling with an inability to know others. Elizabeth Bates recognizes\nthat she \"[had] been fighting a husband who did not exist\" while \"He existed all the time\" (28). In other\nwords, her arguments had been with a projection of her husband, rather than the man himself whom\n\nshe did not see. She thus defined him primarily in relation to herself: a husband who left her for taverns\nand came home ready to fight her. In a similar fashion, K. mostly sees people in terms of his trial. Most\nof his sexual relationships, for instance, involve women who he believes can use their influence to free\nhim: \"He, or the women, or some other messengers, would have to besiege the officials day after day\nand force them to sit down at their desks\" (126). When thinking of them here, K. does not even view\nthem as individuals, but simply as \"the women.\" Sex appeal plays into this trait, often distorting his\nperceptions of these same women. Likewise, Elizabeth's relations with her husband obscured the\ndistance between them: \"If they met there, in the beyond, they would only be ashamed of what had\nbeen before\" (29). Despite significant differences in characters and tone, both texts thus seek to\nillustrate the distance between people.\nThough they face similar problems, Elizabeth and K.'s stories ultimately diverge. The death of\nElizabeth's husband, indeed, provokes a new understanding of herself and him. This understanding can\nbe seen in the contrast between Elizabeth and her mother‐in‐law. At first, the narration connects the\ntwo women in their common plight. As they wash him, \"They worked... in silence for a long time. They\nnever forgot it was death, and the touch of the man's dead body gave them strange emotions, different\nin each of the women; a great dread possessed them both, the mother felt the lie given to her womb,\nshe was denied; the wife felt the utter isolation of the human soul, the child within her was a weight\napart from her\" (26). Though they each experience \"different\" emotions, this passage emphasizes their\ncommonalities. Both share the \"great dread,\" and just as Elizabeth \"was driven away\" (25) so too is the\nmother \"denied.\" The two also share in feeling the falsity of motherhood and in being disconnected\nfrom their children. Moreover, by using plural pronouns, the passage portrays them as acting in unison\nrather than separately. For a while, at least, the two women seem connected in their common grief.\nHowever, Elizabeth, unlike her mother‐in‐law, possesses the courage and self‐awareness to face\nher situation lucidly. The mother \"[speaks] out of sheer terror... a faint, sibilant ecstasy of fear and\n\nmother love\" (26). The \"ecstasy\" of her speech implies a rapidity uninhibited by reflection. This lack of\nreflection is significant, for, as noted earlier, the mother's assessment of her son's character and manner\nof death is hardly discerning. Rather, she projects her conception of him as an innocent child onto his\nadult self. Elizabeth, in contrast, reflects heavily on her husband and seems to come to a truer\nunderstanding both of his character and of his end. The interspersion of passages relating her thoughts\nwith the mother's rambling has the effect of distancing the two women while depicting Elizabeth's\ncontemplativeness. For the next few pages (26‐29), the mother's questions only briefly interrupt her\nthoughts, illustrating her focus on the dead man. We are unable to hear what, if any, response Elizabeth\ngives, which puts further distance between herself and the mother. The tone of these pages shows\nElizabeth to be subsumed in thought, removed from the more naive comments made in the distance\nabove her consciousness.\nElizabeth, correspondingly, reaches starkly different conclusions about her husband than the\nmother does. Whereas the mother holds on to her conception of the man as a child, Elizabeth realizes\nthat \"she [Elizabeth] had been wrong. She had said he was something he was not; she had felt familiar\nwith him. Whereas he was apart all the while, living as she never lived, feeling as she never felt\" (28).\nWhile the mother reacts to the horror of the occasion by holding closer to her earlier views, Elizabeth\nreacts by realizing their shallowness. By doing so, she comes to a fuller understanding of her husband as\na person not merely as a projection. Making such a realization is difficult, however. When she picks up\nher husband's body, \"The horror of the distance between them was almost too much for her--it was so\ninfinite a gap she must look across\" (30). Yet, she is able to look, and ends the story \"with peace sunk\nheavy on her heart... making tidy the kitchen\" (30). After the spiritual agony of the night, she finds the\nstrength to return to the mundanity of daily life. The story's final note is not one of empowerment--\n\"from death, her ultimate master, she wince[s] with fear and shame\" (30)--but she is at last able to\nbreach the barriers between her husband and herself as well as those within herself.\n\nK., in contrast, is unable to achieve a realization about himself or others, and is consequently\nunable to defend himself in his trial, an inability that ultimately leads to his execution. K. exhibits his lack\nof personal growth when discussing the parable with the chaplain. As soon as the chaplain finishes, the\ntwo men have the following exchange:\n'So the doorkeeper deceived the man,' said K. at once, strongly attracted to the story. 'Don't be\ntoo hasty,' said the priest, 'don't accept another person's opinion unthinkingly. I told you the\nstory word for word according to the text. It says nothing about deception... He wasn't asked\nearlier... and remember he was only a doorkeeper and as such fulfilled his duty' (217).\nEven at the end of the novel, K. is unable to attribute blame to the man in the parable, and, by analogy,\nto himself. He much prefers the explanation of a simple deception to a nuanced interpretation. The\nchaplain, in vain, attempts to remind him that the parable, and by analogy life, does not offer\nstraightforward answers to the questions it raises. As noted earlier, K. generally looks for easy solutions\nto his problems, and arguing for an easy moral acquittal of the parable's protagonist shows he has\nlearned little from the experience of his trial. Consequently, when the men come to execute him, he at\nfirst resists, but ultimately leads them: \"Now all three of them, in total accord, crossed a bridge in the\nmoonlight, the men yielding willingly to K.'s slightest move\" (228). Though his executioners seem to be\nan instrument of outside repression, K. becomes complicit and even seems to take control over their\ndirection. This scene is thus, in a sense, a microcosm for the whole story's trajectory. K.'s trial likewise\nseems to be an unjust imposition from outside, but K.'s apathy toward his defense is ultimately\nresponsible for his execution. Indeed, it is natural for us to face \"trials\" which are unjust and\nunaccommodating of individual circumstances. It is expected of us to handle such trials with decisive\nmaturity, onerous though they may be. As with his response to the parable, this fact seems to be lost on\nK. Indeed, he much prefers to think of the \"legal system\" as invalid, publicly calling the room of the\nmagistrate's hearing a \"so‐called court\" (49). While this opinion is legitimate, it shows that K. does not\nhave the courage to take seriously the unfair proceedings against him. Unlike Elizabeth, he lacks the\n\nstrength to look across that \"infinite gap\" and appreciate the world as a complex and often irrational\nplace.\nOdour of Chrystanthemums and The Trial begin with the same struggle to understand others,\nbut end in different places. On the one hand, Elizabeth is able to escape her limitations and achieve a\ntrue moment of empathy with her husband. K., on the other, dies too weak to even give himself an\nhonorable death. As his executioners pass the knife back and forth,\nK. knew clearly now that it was his duty to seize the knife as it floated from hand to hand above\nhim and plunge it into himself. But he didn't do so... He could not rise entirely to the occasion,\nhe could not relieve the authorities of all their work; the responsibility for this final failure lay\nwith whoever had denied him the remnant of strength necessary to do so (230).\nTo the end, then, K. lacks the strength to handle his situation as he knows he should. Though this\n\"failure\" is a personal one, K. persists in blaming outside forces for it. While it is possible his initial\nstruggle with the guards wore him out, his attribution of blame is decidedly vague, implying that he has\nno plausible culprit in mind. As such, K.'s accusation is merely a final refusal to accept responsibility for\nhis actions. The flaws of K.'s character throughout the novel are also present at his execution. Just\nbefore he is killed, he sees a blurry figure reaching out and wonders \"Who was it? A friend? A good\nperson? Someone who cared? Someone who wanted to help? Was it just one person? Was it everyone?\nWas there still help? Were there objections that had been forgotten? Of course there were. Logic is no\ndoubt unshakable, but it can't withstand a person who wants to live\" (230‐31). As before, K. hopes for\nan easy solution in the form of a rescuer, yet that hope is hardly realistic. He is further focused on the\nunfairness of the situation, believing that there are still \"objections\" to be made. K. then dies, and \"the\nverdict\" is given as \"'Like a dog' ... it seemed as though the shame was to outlive him\" (231). He dies\nshamefully--\"like a dog\"--reinforcing the notion of his failure. K. never learns to understand the people\nor society around him, unjust as it may be, and his story is thus a tragedy of a static character.\nThe stories' divergence corresponds to the texts' differing tones and styles. The often\nimpersonal and atonal nature of The Trial limits the potential for character development. While\n\ncharacters need not be developed explicitly, The Trial is generally not concerned with an exposition of\nK.'s character. For instance, when K. attempts to bribe the flogger, it is unclear why he does so. On the\none hand, he seems motivated by vaguely moral reasons as \"It tormented him that he had been unable\nto prevent the flogging\" (85). Yet, these reasons are immediately qualified by \"but it wasn't his fault; if\nFranz hadn't screamed--of course it must have hurt terribly, but at critical moments you have to control\nyourself\" (85). K. is thus hardly an empathetic person, adding more questions as to the nature of his\ncharacter. This small, elliptical passage is the only indication The Trial gives as to K.'s motivations for the\nattempted bribe and no similar incident occurs later in the text. We are thus left with only this isolated\nincident to speculate about a large aspect of K.'s character. The flogging thus shows K. to be something\nof a moral man, but we have little idea to what extent; does K. excuse himself so easily because his\nmorals are not strong? Or is he a man of average moral fiber, but one who has trouble accepting blame?\nThese are questions The Trial does not allow us to answer fully. Of course, such ellipticism is justified in\nmany cases and can often be more evocative than a fully fleshed out description. However, this passage\nis typical rather than exceptional for The Trial, leaving many aspects of K.'s character as sketches instead\nof those of a full human being.\nThe Trial, while being the story about an individual, is not the story of an individual. Some\naspects of K.'s personality, such as his propensity to procrastinate, are developed throughout the story.\nYet, the omission of other aspects renders K. something of an abstraction. Indeed, we are never even\ngiven a physical description of K. Such abstraction is not inconsistent with The Trial's imagery and\nthemes. For instance, as a novel about modern people, K.'s abstraction allows The Trial to have general\nimplications; instead of focusing on K. as a person, the focus is on K.'s traits that are relevant to modern\npeople. However, abstraction does impose some limits on The Trial's focus. Namely, it limits the\nprospects for character change as such transformations are complemented by fully developed\ncharacters. The Trial's specific themes also discourage transformations. The Trial is about modern\n\nbureaucracy and a \"bureaucratic\" man, but bureaucracies are characteristically static. As such, it would\nbe difficult to imagine The Trial as the story of a man who, at the outset, is constrained in his\nunderstanding of others, but ultimately overcomes this difficulty. Not only would this story require the\nnew K. to radically change his fundamentally bureaucratic nature, but it would require a new focus on\nK.'s individuality. That focus, however, would run counter to the elliptical and impersonal tone set by\nThe Trial, a tone at the very heart of its statement about the modern world.\nIn contrast, Chrysanthemums is the story of an individual with the modern world as a backdrop.\nAs represented by the image of the locomotive and the colt from the outset (1), the technology of\nmodern society seems to ominously encroach upon nature and human lives. Indeed Elizabeth's life, like\nK.'s, is a product of the modern world. The \"locomotive engine, Number 4, came clanking, stumbling\ndown from Selston... The trucks thumped heavily past, one by one, with slow inevitable movement, as\nshe [Elizabeth] stood insignificantly trapped between the jolting black wagons and the hedge\" (1). The\nimagery of the story's beginning, then, portrays modern technology as an enclosing and stultifying force,\nand perhaps an isolating one as well. Elizabeth's temporary entrapment foreshadows her husband's in\nthe coal mine, the mine itself being another product of modern technology. Indeed, part of what\nseparates Elizabeth from her husband is his coal miner's lifestyle: he toils away underground and, for\nrelief, turns to drink before turning to her. From the outset, technology is marked by dark colors, and\nmany of the hues of Chrysanthemums also mark it was a dark story. The locomotive and its smoke are\nblack; the coal mine is in the darkness of the earth's depths and the coal itself is black or dark blue;\nElizabeth has \"definite black eyebrows\" (2), \"smooth black hair\" (2), and wears a \"big black bonnet\"\n(26). The forces of the modern world are thus quite present in Chrysanthemums and unnaturally trap or\nseparate characters. However, Chrysanthemums is first and last a story about a woman who, in losing\nher husband, begins to understand him. Unlike The Trial, Chrysanthemums gives us an in‐depth look into\nthe mind of an individual. The narration vividly depicts Elizabeth's emotions with phrases such as \"in her\n\nwomb was an ice of fear\" (27) or \"She drank her tea determinedly, and sat thinking. When she rose her\nanger was evident in the stern unbending of her head\" (8). The forces of the modern world are thus\nmerely the setting rather than the focus of the story. The relationship between Elizabeth and her\nhusband, for instance, is developed and full of idiosyncratic detail. Moreover, unlike K., Elizabeth\npossesses many traits which do not stem from being a product of the modern world. For instance, a\nsubstantial section of the story depicts her growing dread when her husband does not return home, a\ndread which grows despite the estrangement of their marriage. In this light, it is unsurprising that\nElizabeth undergoes such a stark transformation in Chrysanthemums. Not only do the details of her\ncharacter give the text a greater latitude to depict her changing, but the transformation is consistent\nwith Chrysanthemum's focus on Elizabeth as an individual.\nThe fates of the texts' protagonists ultimately stem from the tone each text establishes at the\noutset. The Trial opens with the line \"Someone must have slandered Josef K., for one morning, without\nhaving done anything truly wrong, he was arrested\" (3). From the outset, then, the narration blames\nexternal forces, yet the word \"truly\" implies that the statement is more protest than fact. Further, we\ncan already see the ellipticism and ambiguity of the narration: we will never find out what exactly K. did\nor did not do that was \"wrong.\" What is important for The Trial's purposes are not the details of its\nprotagonist's life or past, but the abstract notions of the \"arrest\" and \"wrongness.\" The Trial thus\nexplores these themes in the context of the modern world's bureaucracy and devotes less attention to\nK. as an individual. As a consequence, he is left on an unalterable trajectory to his death. In\nChrysanthemums, so too do the opening lines set the tone for the rest of the story. Just as the colt in can\ntemporarily \"outdistance\" (1) the train, so too is Elizabeth's outdistancing of death's coldness\ntemporary, as the text's last line suggests. Elizabeth's revelation is meaningful, but it is ultimately\nprivate; she communicates nothing of her understanding to the mother, and, indeed, \"strove to weep\nand behave as her mother‐in‐law expected\" (29). In this sense, her revelations are temporary as they\n\nwill end with her, and little will change outwardly because of them. Yet, the colt's athletic vibrancy\nsuggests that there is still room for nature and individuality in spite of the \"inevitability\" of the train.\nThis freedom philosophically grants her the ability to delay the \"shame\" of death, instead allowing her\nto renew her focus on life. The two texts, then, represent different approaches to the same fundamental\ndifficulty of human relations; complexity and nuance are at the heart of our natures, yet those very\nfeatures make truly knowing another an ever elusive end.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.709 Studies in Literary History: Modernism: From Nietzsche to Fellini\nFall 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}