{
  "course_name": "Studies in Poetry - British Poetry and the Sciences of the Mind",
  "course_description": "Do poems think? Recurrent images of the poet as an inspired lunatic, and of poetry as a fundamentally irrational art, have often fostered an understanding of poets and their work as generally extraneous to the work of the sciences. Yet poets have long reflected upon and have sought to embody in their work the most elementary processes of mind, and have frequently drawn for these representations on the very sciences to which they are thought to stand - and sometimes do genuinely stand - in opposition. Far from representing a mere departure from reason, then, the poem offers an image of the mind at work, an account of how minds work, a tool for eliciting thought in the reader or auditor. Bringing together readings in British poetry of the eighteenth and nineteenth centuries with writings from the emergent sciences of psychology and the physiology of the brain, this interdisciplinary course will explore the ways in which British poets, in years that witnessed the crucial development of these sciences, sought to capture an image of the mind at work. The primary aim of the course is to examine how several prominent genres of British poetry - the lyric, for instance, and the didactic poem - draw from and engage in this period with accounts of cognition within the sciences of psychology, physiology, and medicine. More broadly, the course aims to give undergraduates with some prior experience in the methods and topics of literary study an introduction to interdisciplinary humanistic research.",
  "topics": [
    "Humanities",
    "History",
    "Intellectual History",
    "Literature",
    "Comparative Literature",
    "Criticism",
    "Poetry",
    "Science",
    "Cognitive Science",
    "Social Science",
    "Psychology",
    "Humanities",
    "History",
    "Intellectual History",
    "Literature",
    "Comparative Literature",
    "Criticism",
    "Poetry",
    "Science",
    "Cognitive Science",
    "Social Science",
    "Psychology"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nDescription\n\nDo poems think? Recurrent images of the poet as an inspired lunatic, and of poetry as a fundamentally irrational art, have often fostered an understanding of poets and their work as generally extraneous to the work of the sciences. Yet poets have long reflected upon and have sought to embody in their work the most elementary processes of mind, and have frequently drawn for these representations on the very sciences to which they are thought to stand - and sometimes do genuinely stand - in opposition. Far from representing a mere departure from reason, then, the poem offers an image of the mind at work, an account of how minds work, a tool for eliciting thought in the reader or auditor. Bringing together readings in British poetry of the eighteenth and nineteenth centuries with writings from the emergent sciences of psychology and the physiology of the brain, this interdisciplinary course will explore the ways in which British poets, in years that witnessed the crucial development of these sciences, sought to capture an image of the mind at work. The primary aim of the course is to examine how several prominent genres of British poetry - the lyric, for instance, and the didactic poem - draw from and engage in this period with accounts of cognition within the sciences of psychology, physiology, and medicine. More broadly, the course aims to give undergraduates with some prior experience in the methods and topics of literary study an introduction to interdisciplinary humanistic research.\n\nRequirements\n\nStudents are required to attend all class sessions and to participate. I do not evaluate class participation in terms of how many brilliant things you say in the course of the semester, but I require you to have read the texts thoroughly and to come to class prepared to talk about them. In addition, every student will be required to deliver at least one presentation on an assigned work during the semester, and once again to discuss your final essay. These presentations, between 10-15 minutes in length, should be conceived as exercises in literary interpretation through close analysis, and should ideally help to stimulate a discussion through arguments and questions. Finally, there will be two essays, one 5-6 pages and the other 12-15 pages in length.\n\nMIT Literature Department Statement on Plagiarism\n\nPlagiarism - use of another's intellectual work without acknowledgement - is a serious offense. It is the policy of the Literature Faculty that students who plagiarize will receive an F in the subject, and that the instructor will forward the case to the Committee on Discipline. Full acknowledgement for all information obtained from sources outside the classroom must be clearly stated in all written work submitted. All ideas, arguments, and direct phrasings taken from someone else's work must be identified and properly footnoted. Quotations from other sources must be clearly marked as distinct from the student's own work. For further guidance on the proper forms of attribution consult the style guides available in the Writing and Communication Center.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nFirst Paper\n\n25%\n\nFinal Paper\n\n45%\n\nAttendance/Participation/Presentations/Peer Reviews\n\n30%",
  "files": [
    {
      "category": "Resource",
      "title": "final_essay.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-704-studies-in-poetry-british-poetry-and-the-sciences-of-the-mind-fall-2004/0f47461303589a5fdb4526866592f468_final_essay.pdf",
      "content": "\"The Torch of Experience\":\n\nUnderstanding the Didactic Poem through the Comparison of the Materialist Philosophy\nof La Mettrie's Man a Machine with the Dualist Philosophy of Armstrong's The Art of\nPreserving Health\n\nWilliam Walsh\n24L.704 - Final\n12/10/2004\nWalsh - 1 of 12\n\nThe eighteenth century didactic poem is founded on the ideas of observation, reason, and\nthe purpose to inform. Two examples of this form are La Mettrie's Man a Machine and\nArmstrong's The Art of Preserving Health. These works share common themes, namely\nthat each attempts to describe a philosophy--materialism and dualism, respectively--\nthrough the respective author's observation and discussion on the material and\nsubstantive nature of the universe, the relationship of man's mind and body, the way to\nbest approach medicine, and concepts of morality and the way to best ensure happiness.\nAnalysis of these two works reveals starkly contrasting philosophies, but appreciation on\na higher level reveals that the overall themes of the two works are in fact quite similar\nand that both are excellent examples of the didactic poem and its influence.\n\nJulien Offray de La Mettrie's didactic text, Man a Machine, exemplifies the\nphilosophy espoused by eighteenth century materialists. At the highest level, materialists\nbelieve that everything in the universe consists of one type of substance and that only\nvarying combinations or mutations of this substance accounts for all of the diversity of\nobjects and beings in existence. This crucial assumption is the foundation for the\nphilosophical, medical, and ethical ideas argued in Man a Machine. La Mettrie, a\nphysician by trade and the preeminent materialist of the eighteenth century, attempts to\nillustrate characteristically materialist views of matter, mind, body, morality, and\nhappiness in his work, his aim being to relate these ideas to support his assertion that\n\"man is a machine, and that in the whole universe there is but a single substance\ndifferently modified\" (pg. 148).\n\nThe method by which La Mettrie makes his argument is essential to the\nappreciation of his materialist stance. La Mettrie implores his readers to \"break the chain\nWalsh - 2 of 12\n\nof your prejudices, arm yourselves with the torch of experience\" (pg. 146). In doing so,\nLa Mettrie takes a Lockean epistemological position. La Mettrie believes that faith and\nprejudice, which he frequently refers to as \"fanaticism\", offers little when it comes to the\nacquisition of knowledge, especially in the realm of \"supernatural things,\nincomprehensible in themselves\" (pg. 88). Instead, when analyzing a highly enigmatic\narea, such as the nature of man, \"Experience and observation should therefore be our only\nguides here\" (pg. 88). La Mettrie observes that this rigorous, scientific method is \"found\nthroughout the records of the physicians who were philosophers, and not in the works of\nthe philosophers who were not physicians\" (pg. 88). He notes that it has been the\nphysicians who have most thoroughly explored the human body and since they know it\nthe best are the most likely to take an unbiased stance when evaluating its nature.\nTherefore, when determining the nature of man, La Mettrie bluntly states, \"Only the\nphysicians have a right to speak on this subject\" (pg. 89). The significance of these\nassertions strikes at the heart of materialism. The outright rejection of a faith-based\nphilosophy stems from La Mettrie's view that the supernatural or intangible offers no\ninsight into the operation of man. Man is composed of matter and matter is all that exists.\nSince La Mettrie believes that only experience can provide knowledge, who but the\nphysician has more experience with the raw material of man? Furthermore, one can\nconclude that La Mettrie believes that the mind and all of human action is solely a\nfunction of the material body. This is the materialist stance and explains why La Mettrie\nrejects traditional philosophy and believes that insight must come by the hands of\nphysicians. Even La Mettrie's writing and argumentative style show signs of his\nmaterialist view. Throughout the work, La Mettrie frequently draws medical analogies\nWalsh - 3 of 12\n\nand responds to criticism in a question and answer form. This integration of ideas and\ntheir immediate physical cause as supported by material, often physiological evidence is\nan argumentative and writing style that takes the very form of the materialist ideas La\nMettrie presents.\n\nThe belief that the mind is a mechanistic function of the body is crucial to the\nmaterialist belief and espoused in the work of La Mettrie. It is through this lens that La\nMettrie presents his medical arguments that range from the explanation of common\nmaladies to the nature of man's consciousness. La Mettrie begins the argument by\nacknowledging Descartes' claim that \"medicine alone can change minds and morals,\nalong with bodies\" (pg. 90). This again provides support for the view that the mind and\nbody are of unified substance. Medicine, which is material in nature and operates on the\nbody, will also affect the mind and even the morality of men. He continues by invoking\nthe theory of the humors as evidence of a physical cause for both personality and mental\ndisorders when he writes:\nIt is true that melancholy, bile, phlegm, blood, etc.--according to the\nnature, the abundance, and the different combination of these humors--\nmake each man different from another.\n* * *\nWhat was needed to change the bravery of Cauis Julius, Seneca, or\nPetronius into cowardice or faintheartedness? Merely an obstruction in\nthe spleen, in the liver, an impediment in the portal vein? Why?\nBecause the imagination is obstructed along with the viscera, and this\ngives rise to all the singular phenomena of hysteria and hypochondria.1\n\nIn doing so, La Mettrie makes the astounding claim that physical proportions of different\nmaterial substances in the body are not only the cause of somatic disorders, but that each\nman's mental temperament is a result of these very substances. While this view may\nanachronistically seem too simplistic, it is absolutely consistent with the materialist\n\n1 La Mettrie, Man a Machine pgs. 90-1\nWalsh - 4 of 12\n\nphilosophy, for according to a materialist what else could possibly dictate the actions of\nthe mind but its physical makeup? La Mettrie continues by relating this assertion to his\noriginal claim that man is deterministic when he states, \"As we are gay or brave;\neverything depends on the way our machine is running\" (pg. 95), or alternatively put,\n\"The diverse states of the soul are always correlative with those of the body\" (pg. 97).\nHe continues with many more examples to support this idea ranging from the claim that\nthe brains of the insane or imbecile are physically softer than normal to the assertion that\na person's countenance is indicative of their mental attributes. Great writers and thinkers\nhave \"strong faces and eagle eyes\", claims La Mettrie in arguing for his belief that the\nface of a man \"can always distinguish the man of talent from the man of genius, and often\neven an honest man from a scoundrel\" (pg. 96).\n\nLa Mettrie's theory on human morality and happiness follows a similar path\nconsistent with the materialist view. First, La Mettrie rejects outright the theory of innate\nideas when he replies to their proponents, \"I certainly would not give myself a quarter of\nthe trouble that M. Locke took, to attack such chimeras\" (pg. 111). Understandably, La\nMettrie does not subscribe to the belief that man is born with innate ideas for to do so\nwould ascribe these ideas to matter, the substance which La Mettrie clearly states cannot\nthink in and of itself. However, La Mettrie does not deny a fundamental natural law, and\nin fact, goes on to declare that this fundamental law exists in all animals. Through\nunderstanding La Mettrie's view on natural law one will see the means by which he\ndeduces his theory on the possibility of human happiness.\n\nThe bedrock upon which La Mettrie bases the following ideas is the notion that\nman is fundamentally an animal. He immediately assails the idea that men and animals\nWalsh - 5 of 12\n\nare somehow fundamentally different with man being enlightened and the animal not\nbecause as he sees things, man and beast are both machines with none fundamentally\nfavored over the other. He states, \"Man is not moulded from a costlier clay; nature has\nused but one dough, and has merely varied the leaven\" (pg. 117). He continues then by\ndescribing what he finds to be the common characteristic observed in all animals, namely\nthe feelings of empathy and remorse. He recalls the anecdote of a man who is thrown to\na lion, yet the lion does not attack because it recognizes the man as his benefactor.\nConversely, he asserts that it is known that humans feel empathy by a \"from the reader's\npersonal experience\" style argument. Therefore, since animals and man are made of the\nsame material, they must both have this faculty despite the fact that animals may at times\nnot display it to our understanding out of their necessity for pleasure. He proceeds to\ndescribe how a person will flinch when they witness another person being hit as an\nexample of the type of empathy that runs throughout men and animals. He deems that\nthis phenomenon is the natural law and argues that this law can be reduced to \"a feeling\nthat teaches us what we should not do, because we would not with it to be done to us\"\n(pg. 121). La Mettrie continues that fear is what motivates all of us and is the compass\nthat directs our morality.\n\nFrom here, La Mettrie offers his theory on human happiness when he asserts,\n\"Nature has created us all solely to be happy\" (pg. 121). According to La Mettrie, man is\ndenied happiness primarily because, \"With Pliny, he blushes over the wretchedness of\nour origin\" (pg. 87). This sentiment is harshly rebuffed by La Mettrie when he states,\n\"No; matter contains nothing base, except to the vulgar eyes which do not recognize her\nin her most splendid works; and nature is no stupid workman\" (pg. 145). The implication\nWalsh - 6 of 12\n\nhere is the concluding argument of Man a Machine, namely that accepting the materialist\nphilosophy does not destroy the prospect of happiness, but instead allows for permanent\nhappiness. According to La Mettrie, once man stops feeling ashamed of his animal\nancestry and his material composition, he can appreciate the glory of the complex\nmachines that surround him, including himself. This appreciation coupled with the\nunderstanding that he is \"designed for happiness\" rounds out La Mettrie's theory, namely\nthe materialist view of lasting happiness.\n\nHowever, La Mettrie's view of man and materialism were not without their\ncritics. During the same time period there existed another major school of thought\ntermed dualism. Whereas a materialist like La Mettrie believed in a single substance that\ncomposed all of the universe, a dualist believed that there were two of such substances,\nthe first being material, the second being something metaphysical or intangible. The\nintangible substance was usually attributed to an immortal soul which oftentimes was\ndeemed responsible for human characteristics such as mind and will. La Mettrie stated\nthat only a physician was qualified to philosophize on the nature of man, but this should\nnot be taken to mean that all physicians were materialists. John Armstrong, also a\nphysician, takes a dualist stance towards the composition and operation of man in his\ndidactic poem, The Art of Preserving Health. Comparing his work with Man a Machine,\nin the context of material philosophy, medicine and disorder, and morality and happiness\nprovides insight into the relationship between the dualist and materialist philosophies,\nrespectively.\n\nUnlike La Mettrie, who begins Man a Machine by invoking \"the torch of\nexperience\" as his guide, Armstrong opens book four of The Art of Preserving Health by\nWalsh - 7 of 12\n\ninvoking, \"Ye poetic Shades, / Who know the secrets of the world unseen, / Assist my\nsong!\" (4.7-9). Immediately, a contrast between the two works appears in terms of each\nauthor's manner of acquiring knowledge. The style of Man a Machine was cold and\nmedical, invoked tangible experience, and was presented in plain prose - much like the\nstraightforward and physical materialist philosophy. The Art of Preserving Health,\nhowever, seems more enigmatic, invokes \"poetic Shades\" for inspiration and knowledge,\nand is written in blank verse. One could argue that, again, the style of the argument and\nwriting is representative and supportive of the type of philosophy being offered.\nInvoking the supernatural for inspiration implies the existence of the intangible and its\nlink to the mind--a strongly dualist position. The blank verse seems more complex,\ncoupling semantic meaning on one level with spoken rhythm on another. Although this\ntwo-tiered approach may be entirely coincidental, there is at least some support for the\nnotion that each author's style is representative of their respective philosophies.\n\nArmstrong proceeds by stating his dualist belief upon which the rest of his work\nrelates when he declares:\nThere is, they say, (and I believe there is)\nA spark within us of th' immortal fire,\nThat animates and moulds the grosser frame;\nAnd when the body sinks escapes to heaven,\nIts native seat, and mixes with the Gods.\nMean while this heavenly particle pervades\nThe mortal elements; in every never\nIt thrills with pleasure, or grows mad with pain,\nAnd, in its secret conclave, as it feels\nThe body's woes and joys, this ruling power\nWields at its will the dull material world,\nAnd is the body's health or malady.2\n\nThis statement is loaded with assertions that explain the dualist position and, in many\ninstances, contrast it with the materialist view. First, Armstrong professes his belief in an\n\n2 John Armstrong, The Art of Preserving Health 4.10-22\nWalsh - 8 of 12\n\n\"immortal fire\" that animates the body in the form of \"heavenly particles\". Clearly, this\ncontrasts with the materialist view of an animating force that terminates with the mortal\nbody and is most certainly conflicts with the idea that there is only one type of substance\nin the universe. Furthermore, this particle can feel (\"grows mad with pain\") and is\napparently undetectable, the interpretation of the \"secret conclave\". Finally, in direct\nopposition to the materialist view that the mind is a function of the body due to the nature\nof its composition, Armstrong presents a dualist position that the mind consists of the\nmaterial of the second, \"heavenly\", variety and that it is fluctuations of this substance, not\nthe material substance of the body, which is responsible for mood and ultimately the\nphysical health of the body itself. Armstrong states that \"the labours of the mind corrode\n/ the solid fabric\" (4.25-6), in doing so, he sets up the dualist hierarchy that he argues in\nthis work, namely that the intangible mind not only exists, but governs the material body.\n\nTherefore, one can see the major contrast of the materialist and dualist\nphilosophy. Where the materialist, La Mettrie, places the state of the mind as a function\nof the body, the dualist, Armstrong, places the state of the body as a function of the mind.\nRecall that La Mettrie claimed that the physical appearance of a man dictated his\npersonality. Armstrong presents a contrasting view when he states, \"The Lover's\npaleness; and the sallow hue / Of Envy, Jealousy; the meager stare / Of sore Revenge: the\ncanker'd body hence / Betrays each fretful motion of the mind\" (4.48-50). These lines\nexemplify the fundamental difference between the two philosophies, namely that La\nMettrie states that the mind takes on the characteristics of the body (e.g. \"sharp eyes\"\nmean a sharp wit), Armstrong claims that the body takes on the characteristics of the\nmind (e.g. \"sore Revenge\" leads to canker sores on the body). These two converse\nWalsh - 9 of 12\n\nhierarchies of body and mind constitute one of the major differences between a\nmaterialist and dualist philosophy.\n\nAdditionally, the two philosophies differ on their views of medicine and\naffliction. Whereas La Mettrie claimed that misalignment of the body leads to certain\ndisorders of the mind, Armstrong believes that all maladies enter through the mind and\nsubsequently \"decay the passive Body\" (4.6-7). Armstrong claims that such afflictions\ncan be caused by many things such as overwork, unrequited love, or other negative\nemotions, but the consequence is the same. The negative energies, or negative passions\n\"when the mind / They first invade, the conscious body soon / In sympathetic\nlanguishment declines\" (4.136-8). Although these passions are \"without the body's\nfault\" (4.140), they will ultimately lead to the body's decay. Therefore, another contrast\nemerges. Whereas the materialist ascribes to the body responsibility for the state of the\nmind, the dualist ascribes to the mind responsibility for the state of the body. As such, it\ncomes as no surprise that in contrast to La Mettrie's medical advice that to \"treat the\nmind one should treat the body\", Armstrong advises essentially that \"to treat the body\none must treat the mind.\"\n\nFinally, the dualist philosophy of Armstrong presents a very different position on\nhuman happiness than that of the materialist philosophy of La Mettrie. Recall that La\nMettrie believed that embracing the deterministic nature of man and the materialist view\nof the world would lead of to sustained happiness. Armstrong rejects this notion when he\nstates, \"'Tis not for mortals always to be blest. / But him the least the dull or painful\nhours\" (4.260-1). In lines reminiscent of Pope, Armstrong declares that perpetual\nhappiness is not in man's design, a point contrary to that of La Mettrie. Instead,\nWalsh - 10 of 12\n\nArmstrong advises his readers to follow his advice to with the aim of keeping\nunhappiness to a minimum. In a strange turn, he moves on to declare that there does\nexist one force able to quell the negative passions that afflict the mind and body, and\n\"That power is Music\" (4.483). He claims that music, by its virtue of being divinely\ninspired, has the power to appeal to this same heavenly element in the mind. In doing so,\n\"Music exalts each Joy, allays each Grief, / Expels Diseases, softens every Pain, /\nSubdues the rage of Poison, and the Plague\" (4.512-14). The result is another contrast in\nphilosophy, namely the materialist view of a philosophical route to happiness, contrasted\nwith the dualist view of a spiritual route to happiness.\n\nHowever, there two philosophies are not polar opposites. Take, for example, the\nlast contrast on happiness. Though on the surface, it may seem that the two philosophies\nare very different, the underlying theme is the same, namely that happiness must be\nachieved on a mental level. Simple stimulation of the body is not advocated by either\nwriter. While each philosophy's view on what constitutes the mind is certainly different,\nstripping away this point of disagreement leaves one with a fair degree of harmony. Both\nphilosophies agree there is a strong correlation between the body and the mind, and that\nchanging one will change the other. Both acknowledge that maladies affect the body and\nthe mind in concert, even though the mechanism by which the malady operates is a\nsource of disagreement.\n\nTherefore, there are some common themes that run through what may seem like\neven the most contrasting works, the greatest of these themes can be seen in the approach\nand aims of the authors. Both physicians, La Mettrie and Armstrong each approach the\nideas of philosophy, medicine, and happiness with a similar approach. They look to their\nWalsh - 11 of 12\n\nown experience--one more analytical, one more introspective--with the aim of better\nunderstanding the mysteries of man and then conveying their ideas to the populous. This\nis, in essence, the theme of the didactic poem of the eighteenth century. The focus of\neach of these works is increasing and conveying knowledge. These are not works of\n\"overflowing emotion\", but rather they are careful, deliberate attempts to elucidate the\nreader by the familiar tools of observation, reason, analogy, and argument. Ultimately,\nthe disagreement between whether there exists an immaterial soul has not, and in fact\ncannot be solved. The materialist / dualist argument, by the inherent immateriality in\nquestion, cannot be solved by any scientific means, but the attempts of the authors have\nhad a lasting impression on the very means we use to be convinced. The didactic poem\nmay be an outdated artistic form, but the rigorous and instructive qualities it espoused are\nboth the foundation of and the greatest part of the scientific culture of today.\nWalsh - 12 of 12"
    },
    {
      "category": "Resource",
      "title": "imagination.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-704-studies-in-poetry-british-poetry-and-the-sciences-of-the-mind-fall-2004/1edb355716af027408072025201acc48_imagination.pdf",
      "content": "Youngsun Cho\nProfessor Jackson, 21L.704, Studies in Poetry, Paper #1, Revision\nNovember 17, 2004\n\nThe Roles of Imagination and Reason in Morality\nMark Akenside's The Pleasures of Imagination, like other British didactic poems\nwritten in the seventeenth and eighteenth century, celebrates man and his mind.\nPrimarily a work discussing imagination, the poem also reflects the interest of\nseventeenth-and-eighteenth-century British philosophers in man's unique capacity for\nrational thought. Writings of some of Akenside's contemporaries, such as those of\nAlexander Pope's and John Locke's, had also explored reason, but a component of\nAkenside's work extends to exploring reason and its relationship with imagination as a\nway of understanding man. In The Pleasures of Imagination, Akenside sketches a\nreciprocal relationship between reason and imagination that ultimately shapes\nimagination into a property that aids man in understanding truth and morality.\nImagination, when exercised with reason, thus makes man a moral, enlightened creature,\nand man can understand God and himself by allowing his reason to affect his imagination,\nand vice versa. The final stanza of the poem (Book III, lines 568-633) serves as the\npoet's appeal to humanity to embrace imagination, and as a result, nature and God.\nImagination is defined as the faculty responsible for deriving pleasure from\nrecalling sensations, particularly visual sensations. From the very beginning of the final\nstanza, imagination is treated as a spiritual faculty, and exercising imagination is\ndescribed both as a choice, and as a spiritual, rather than material, choice. Lines 568-561\ncompare the different benefits of imagination to the different benefits of material wealth.\nLanguage such as \"the bribes/Of sordid wealth\" (III, 569-570) and \"gaudy spoils,\" (III,\n\n1 - Cho\n\n570) describes material wealth, while imagination is responsible for \"Those ever\nblooming sweets\" (III, 572). Imagination is a faculty available to \"whatever happy\nman/Will deign to use them,\" (III, 580-581), and will bring pleasures to the imaginer that\nare far \"Beyond the proud possessor's narrow claim,\" (III, 585). The sensations and\nvisions available through the imagination are treated as possessions, but as spiritual\npossessions meant to arouse pleasure and an awareness of beauty. In the first half of the\nstanza, Akenside describes the benefits of imagination, and also attempts to provoke the\nimagination of the reader, a tactic employed throughout the rest of the poem. His ornate\nlanguage and descriptions serve to guide the reader and to make him understand the\npowers of his own imagination. However, the powers of the imagination are exerted\nwithin the bounds of reason, and, likewise, the flowery language is written in blank verse\nand iambic pentameter, giving some structure to the poem.\nReason and man's capacity for rational thought can be defined by ideas and\nknowledge, and are more complex than sheer sensations. Lines 598-605 begin to reveal\nthe relationship between reason and imagination, and illustrate imagination's effect on\nreason. Within these lines, Akenside writes that by exercising imagination, the mind will\nbecome \"herself harmonious: wont so oft/In outward things to meditate the charm/Of\nsacred order, soon she seeks at home/To find a kindred order\" (III, 601-604). As a result\nof taking pleasure in the outside world, the mind will begin to \"meditate\" and reason,\ndiscerning order and ideas; imagination leads to reasoning. By describing the mind as\n\"harmonious,\" Akenside suggests a state of peace within the mind and the man that will\nbetter man's existence. This harmony is achieved by the soul first indulging in\nimagination, and then desiring the pursuit of order through reason. Such interaction\n\n2 - Cho\n\nbetween reason and the imagination shapes imagination into a moral faculty. Within\nthese lines, Akenside also pays homage to Pope and Locke. \"Order\" recalls Pope's\nstrong belief in the idea of a divine, universal order, and the term is applied to also reflect\na Lockean idea, self-reflection. Each of these references conjures up ideas on reason that\nwere expressed during the seventeenth and eighteenth century.\nThe effect of reason on the imagination is described in lines 609-615. Here\nAkenside argues that knowing the purpose behind an image appreciated by the\nimagination--here, that an \"eternal majesty\" has created nature and the world--makes\nthe mind \"nobler\" than if the sensations alone were appreciated. Exercising reason and\nunderstanding enhances the imagination, and allows man to understand God and himself.\n\"[M]ightier far/Will be the change, and nobler\" (III, 614-615) suggests that such a\nreasoning and imaginative mind will become enlightened. The idea that knowledge\nenhances imagination, and thus leads to morality, is also found in the second book, in\nwhich Akenside describes the effects of science on the imagination. In Book II, lines\n100-108, Akenside describes the amazement felt when viewing a rainbow within the\nunderstandings of light refraction and reflection. Akenside suggests that science and\nknowledge will lead to truths that enhance the sensations gathered by the imagination,\nand that man's desire for knowledge is stronger than his sensations. Akenside's desire to\nreconcile philosophy and the arts also reflects the idea that a complementary relationship\nbetween imagination and reason will lead to truth. Within man, imagination leads to a\ndesire for understanding, and in turn, such understanding enhances the imagination. This\nreciprocal relationship between reason and imagination leads to an orderly mind aware of\na divine presence.\n\n3 - Cho\n\nIf the moral quality of imagination depends on its relationship with reason, then\nthe breakdown of reason results in folly, or the ridiculous. Folly is the pleasure resulting\nfrom the appreciation of distorted or false representations. Akenside warns against folly\nand its effects in much of Book III, and references this idea in lines 615-619 of the final\nstanza. The \"forms\" (III, 615) refer to those various forms Akenside accuses of catering\nto folly, such as the liars, the exaggerators, and the arrogant. According to Akenside,\nGod confronts man with folly in order \"to aid/The tardy steps of reason, and at once/By\nthis prompt impulse urge us to depress/ The giddy aims of folly\" (III, 262-265). The\nbreakdown of reason prevents one from recognizing the false understanding that certain\nimages may be based upon. False understanding fails to enhance the imagination, and\nthis type of imagination can no longer enlighten man. Those who fail to recognize, or\nwho ignore, false representations do a disservice to God and are as immoral as those who\ncreate folly. Such people will then \"bow her down/To tame pursuits, to indolence and\nfear?\" (III, 618-619), unable to achieve enlightenment and \"be great like him [the eternal\nmaker],/ Beneficent and active\" (III, 628-629). As lines 629-633 state, only those men\nwho are both charmed by imagination, and know the true and divine purpose behind\nthose pleasurable images will be able to \"act upon his [God's] plan;/And form to his, the\nrelish of their souls\" (III,631-633).\nIn The Pleasure of Imagination, Akenside believes that, when exercised with\nrational thought, imagination can enlighten man, allowing him to understand God, nature\nand himself. The poet treats imagination as a spiritual faculty, and traces a\ncomplementary relationship between reason and the imagination. Within this\nrelationship, imagination can lead to the pursuit of knowledge, while knowledge, in turn,\n\n4 - Cho\n\nenhances the quality of the imagination. The result of this relationship is an orderly mind\nappreciative of a divine presence. The failure of reason, and thus, the reciprocal\nrelationship, leads to folly, an imagination incapable of enlightenment, and a lazy,\npassive mind. Previous philosophers had explored reason as man's defining trait, but\nAkenside's work combines this idea with the imagination, suggesting that both are\nequally important to man and his existence.\n\n5 - Cho\n\nFigure 1. House and Figures in a Mountainous Landscape, Thomas Gainsborough,\n1727-1788.\nAccording to Akenside, an enlightened person would appreciate the imagination of this\nartist, as well as the truth within this representation, and would understand that God has\ncreated nature and the land.\nView photo at: http://www.shannons.com/auct_j/det/208%20Gainsborough%20J070.jpg\n\nFigure 2. A rainbow--Akenside's example for illustrating the idea that knowledge\nand reason enhance the imagination.\nAccording to Akenside, this image will be most appreciated by the viewers who\nunderstand the refraction and reflection of sunlight that occurs within water droplets.\nView photo at: http://www.mandalas.freeserve.co.uk/images/Rainbow.jpeg\n\n6 - Cho\n\nFigure 3. A portrait of the poet.\nMark Akenside (1721-1770), British poet, physician. Author of \"The Pleasure of\nImagination.\"\nView photo at: http://clendening.kumc.edu/dc/pc/Akenside.jpg\n\n7 - Cho"
    },
    {
      "category": "Resource",
      "title": "pope_analysis.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-704-studies-in-poetry-british-poetry-and-the-sciences-of-the-mind-fall-2004/07c66fc4845fe885a57751c63d571ec0_pope_analysis.pdf",
      "content": "William Walsh\n21L.704\n\n\"Whatever Is, Is Right\":\n\nUnderstanding Alexander Pope's View of the Mind, Its Limits, and The Role of Man in\nthe Universe through the Critical Reading and Analysis of Selected Passages from An\nEssay on Man\n\nIn An Essay on Man, Pope sets out to explain his views on \"the nature and state of\nman, with respect to his own system ... [and] with respect to the universal system\" (\"To\nthe Reader\" pg. 501). The selected passages serve as a representative of the text and\nillustrate how Pope goes about presenting his world view. First, Pope describes his\ntheory on the nature of the mind of man with a discussion of the two forces behind all of\nhuman action, namely reason and passion. Next, Pope explains how the reasoning\nfaculty of man is limited in scope, being greater than the reason of some creatures, but\nundoubtedly lesser than the reason of others. Finally, Pope presents the critical point of\nhis world view when he argues that the limitations on reason, by virtue of being divinely\nimposed, are inescapable, fortuitous, and most importantly, correct. It is precisely this\nargument that Pope conveys when he claims, \"And, spite of pride, in erring reason's\nspite, / One truth is clear, 'Whatever is, is right'\" (1.293-4).\nPope believes that there are two major forces that define human nature, namely\nself-love and reason. He declares that these forces are neither good nor bad, but instead\n\"works its end, to move or govern all\" (2.56). Here, self-love (also referred to as passion)\nis described as urging, whereas reason is described as restraining. Therefore, the\ndichotomy is such: passion represents the forces of human instinct or desire, and reason,\nthe force of logic and restraint. Working in concert or at odds, Pope claims these forces\ngovern all human behavior. Even Pope's writing style reinforces this theme. With his\nheavy use of heroic couplets, Pope seems to be using the form of his verse to reinforce\nthe notion of two opposing forces working in concert to further one end. Pope expands\non this relationship by asserting that passion is \"still stronger\" (2.71) than reason. While\nthe meaning of this is not immediately clear, the following lines claim that where passion\ndeals with the present, reason is concerned with \"the future and consequence\" (2.74).\nPage 1 of 5 - Walsh\n\nThough, \"Thicker than arguments, temptations throng\" (2.75), reason is \"at best ...\nwatchful\" (2.76). Here, one finds the supporting argument for the initial claim that\npassion is stronger than reason, namely that instinct and temptation are stronger than\nlogic and argument. The following lines describe how the use of reason makes it stronger\nand helps it restrain passion. Pope concludes the passage with a major theme, namely,\n\"Wits, just like fools, at war about a name, / Have full as oft no meaning, or the same. /\nSelf-love and reason to one end aspire, / Pain their aversion, pleasure their desire...\"\n(2.85-8). The theme, thus, appears to be that like two fools arguing the same point, while\npassion and reason appear to be conflicting, they are actually working together to further\nthe same goal - that of increasing pleasure and decreasing pain. This pleasure, be it\nwrong or right, is the primary motivation for our actions, and as such \"our greatest evil,\nor our greatest good\" (2.92). The interpretation is that neither passion nor reason are\ninherently good or evil, but their application and resulting effects on man's behavior can\nwork in man's favor or against it. Thus, we see one of the major themes of the work in\nthe form of Pope's attempt to define the human mind. Pope's theory of the mind appears\nto be that the mind and behavior are the results of the combined effects of man's love of\nimmediate pleasure, passion, and man's love of future pleasure, reason.\n\nAnother major theme of the work is Pope's view on the limitations of reason and\nman's place in the universe. A good example of this begins in passage three which\ndescribes man using reason to measure, define, and declare how the world shall work\nthrough science. Pope mockingly calls man a \"wondrous creature\" (2.19) who will\n\"instruct the planets in what orbs to run, / Correct old time, and regulate the sun\" (2.21-\n2). Here, Pope is using his skill for satire to draw attention to what he sees as a prevailing\nattitude, namely the arrogance of man. To Pope, man seems infatuated with reason to the\npoint where he, at the extreme, believes himself to be the wisest and greatest creature in\nthe universe.\n\nPope refutes this idea with one of his great analogies which conveys his view on\nthe place on man in the universe. In response to man's perceived arrogance, Pope replies,\n\"Superior beings, when of late they saw a mortal man unfold all nature's law, / Admir'd\nsuch wisdom in an earthly shape, / And shew'd a Newton as we shew an ape\" (2.32-4).\nThe underlying meaning is one of Pope's greatest points, namely that just as man thinks\nPage 2 of 5 - Walsh\n\nhimself far more intelligent than an ape, there exist superior beings far more intelligent\nthan man. Pope does not mean to denigrate Newton, or man in general, but instead\nwishes to use this as an example to illustrate the limits of reason. Man has a developed\nreason, yes, but man's reason is also limited and has a place in a larger universe where\nman is above some, and below others. This is confirmed in the following stanza which\nasks, can the same mind who mapped the movement of a comet map the movements of\nhis own mind? Can he explain where he came from or what will happen when he dies?\nThe answer, of course, is no. Pope concludes with the observation that \"what reason\nweaves, by passion is undone\" (2.42). The meaning being that reason alone will achieve\ncertain things, but is ultimately bound by things that man's reason cannot answer. Here,\none falls into the domain of instinct or passion, which innocently unwinds the systems\ncreated by reason.\n\nPope continues to elaborate on this theme of the limits of reason and man's place\nin the universe in passage four which begins by describing man's life. Man can merely\ncome into existence, look around a maze (the world) for a while, and then die. However,\nPope states that the seemingly limited existence is \"not without a plan\" (1.5). This plan is\nattributed to God, as is the very faculty of reason that man so treasures. Pope believes\nthat man has a place in the universe ruled by God. He claims, \"What can we reason, but\nfrom what we know?\" (1.18). Here, the point is that reason is powerful, but again\nlimited. Reason is limited in this case not by its inherent, aptitude-attributed limits, but\nby the limits of our senses and our place. We exist but in this world, and therefore cannot\nreason about others. We are bound by our senses. Time and time again, Pope comes\nback to this idea that man is very limited in the overall scheme of the universe, but\nalways makes the distinction that these limits are intended and imposed by God.\nHowever, Pope does not stop by simply declaring reason to be limited. Instead,\nhe argues that having a limited scope of reason and understanding is in fact a good thing\nand that man should not strive to have the knowledge of God. Pope illustrates this theme\nvia another powerful analogy. Take first, a sheep that is to be killed by a man. The man\nknows the sheep is to be killed, but the sheep does not, therefore the sheep remains\nhappy. Analogously, man does not know his own fate, but God does. Would man be\nable to have a moment of pleasure if he were to know his own end? Pope argues that he\nPage 3 of 5 - Walsh\n\nwould not. Pope writes, \"Oh blindness to the future! Kindly giv'n, / That each may fill\nthe circle mark'd by heav'n\" (1.85-6). The meaning is that man is granted some peace in\nnot knowing all that there is to know. The following lines examine events from the small\nto the grand in scale that are all witnessed by God but not by man, the purpose being to\nillustrate that man cannot and should not wish to assume all of the knowledge of the\nuniverse, but instead should be content within his own divinely-imposed sphere of\nunderstanding, the afore mentioned \"circle marked by heaven\" (1.86).\nIndeed, the notion of the fortuitousness and correctness of divinely imposed limits\nis a major theme of the work. Pope claims that that God, being infinite in wisdom, must\nhave created the best system possible for man to exist in. All creatures have varying\nlevels of knowledge and understanding but should take comfort in the fact that since God\nhas infinite wisdom, the world in which they live is correct as is their place in it. This\nidea is reiterated when Pope states that we have a place in the world and that God has\ngiven man limitations \"of blindness, weakness\" (1.284) which is assumed to mean\nlimitations on knowledge and reasoning prowess. Pope then says not to fight these limits,\nbut to submit to them. Why? Because as before, \"Secure to be as blest as thou canst\nbear, / Safe in the hand of one disposing power, / Or in the natal, or the mortal hour\"\n(1.286-8). From conception to death, man is blessed by virtue of his gifts and his\nlimitations and is safe in the hands of a benevolent God. Pope concludes by stating that\nnature is a mystery, that there are chance forces that we cannot understand, and that we\nmay not understand all of discord and harmony of the world, yet it all doesn't matter.\nPope neatly packages his main theme when he claims that, \"And, spite of pride, in erring\nreason's spite, / One truth is clear, 'Whatever is, is right\" (1.293-4). This powerful final\ncouplet very eloquently states Pope's overarching theme and world view in two lines,\nnamely that despite our flawed, limited reasoning and our pride in it, one thing remains\ncertain - the world as it exists is correct. This is a final argument for Pope's claim that\nGod is infinite in wisdom and has created a world that is right. We may not, and in fact\ncannot understand it completely, but we should take comfort in that the things we do not\nknow are known by God and that God should be trusted.\nTherefore, Pope's work can be seen to make three major points that are illustrated\nthrough the selected passages. First, the mind of man is a sum of the forces of passion\nPage 4 of 5 - Walsh\n\nand reason working in concert. Second, reason is limited and these limits are imposed by\nGod. Third, these limits are a blessing and we should take comfort in our place because a\nwise and benevolent God has created us this way and therefore it must be right. Pope's\ncontribution to scientific poetry can thus be seen as twofold. First, the notion of the mind\nas a sum of the forces of passion and was explained in an effective and concise way.\nSecond, there was in the past, as there is now, a struggle for reconciling the world of\nscience and reason with that of religion and the supernatural. Pope attempted to provide\na possible reconciliation of the two spheres in this work by using the limits of reason as a\nmeans for justifying the things we cannot understand and allowing reason and God to\npurposefully co-exist. This expression of Pope's unifying world view is the major\nargument so effectively espoused in An Essay on Man.\nPage 5 of 5 - Walsh"
    },
    {
      "category": "Resource",
      "title": "text_essay.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-704-studies-in-poetry-british-poetry-and-the-sciences-of-the-mind-fall-2004/717abbb90dd22392e2dd5b6de7645bc5_text_essay.pdf",
      "content": "An Analysis of Matthew Green's \"The Spleen\"\n\"The Spleen\" was written by Matthew Green as an epistle to Mr. Cuthbert Jackson and,\naccording to A Preface to Eighteenth Century Poetry1, Green did not intend it to be published.\nMatthew Green uses the concept of 'spleen' from Greek humoral medicine - the black bile\nproduced by the spleen was thought to cause melancholy and depression. In \"The Spleen,\" Green\nlists many ways to guard against depression, emphasizing a life of moderation and a balance\nbetween reason and passion, and his argument is further emphasized by the balance between his\norganized rhyme scheme (the 'reason' in his writing) and the casual tone and disorganized nature\nof the poem ('passion').\nThe main purpose of Green's poem is to enumerate measures to prevent the depression\nand despondency caused by spleen. Green's method is comparable to another writer of the time,\nGeorge Cheyne, and both pieces give a series of recommendations on the best way to live a happy\nlife. An example of one of Green's many remedies for depression is shown when he writes, \"To\ncure the mind's wrong bias, spleen, / Some recommend the bowling-green\" (89-90). One\ncomponent of a life of moderation is modest exercise, and thus Green lists this as one of the\nmethods for alleviating melancholy. Green's advice to readers is very similar to that of Cheyne,\nwho writes in The English Malady that \"Such a course of life must necessarily beget an ineptitude\nfor exercise...Persons as live in the manner mention'd, are most subject to such complaints\" (52).\nCheyne states that those who do not exercise are more likely to suffer from what he sees as a\nmajor problem in England: melancholy, depression, and associated illnesses. Green's \"The\nSpleen\" was a new form of scientific poetry, for the focus on the body and ways of staying\nhealthy had rarely been addressed in poetry before. Also, both \"The Spleen\" and The English\nMalady look at socio-cultural causes of disease, an idea that was most likely groundbreaking in\neighteenth century medicine. \"The Spleen\" presents ideas on how to cure melancholy, an attribute\n1 A Preface to Eighteenth Century Poetry, James Sutherland, Clarendon Press Oxford, 1948.\nProctor - 1\n\nviewed by both Green and Cheyne as detrimental to a happy and productive existence. Green\nsuggests with his list of cures to spleen that a modest, temperate life is the best way to guard\nagainst the pitfalls and provocations of melancholy.\nGreen uses figurative language near the end of \"The Spleen\" to illustrate his belief in\nreason's ability to restrain passion, and this balance is seen as a key way to maintain control over\nlife. Green likens feelings of passion to melancholy and thus maintains that it is necessary for\nreason to mediate and stand above human passion. Green writes, \"At helm I make my reason sit, /\nMy crew of passions all submit\" (816-817). The metaphor compares the author directing his life\nto the directing of a ship, advising the faculties of reason to take the central command. The poet\ngoes further when he warns \"Tho' pleased to see the dolphins play, / I mind my compass and my\nway\" (826-827). The pleasure associated with some forms of passion (such as enjoyment from\nobserving natural scenes) can have some benefit but should not distract an individual from the\ncourse at hand. Instead of allowing himself to get lost in the realm of imagination, Green wishes\nto use reason to navigate a course through nebulous and ill-defined ideas.\nGreen uses the rhyme scheme, rhythm, and meter of \"The Spleen\" to further advance his\nargument that reason protects an individual from melancholy. Other poets of the early eighteenth\ncentury also use these devices to make their poetry more appealing to the reader and allow for a\nbetter ordered piece. For example, Alexander Pope, uses rhyming couplets to successfully\nillustrate his ideas on reason in An Essay on Man. Pope writes \"Say first, of God above, or man\nbelow, / What can we reason, but from what we know\" (1.17-18). Pope uses concise, witty lines\nto convey his grand idea of the limit of reason and human understanding, and his writing puts a\nlarge emphasis on the appearance of order. Green's \"The Spleen\" is also comprised of rhyming\ncouplets and, though they have neither the breadth nor the clarity of Pope's couplets, they do\nallow for a memorable closed verse form and lend themselves well to Green's flashes of wit. For\nexample, Green writes that some recommend \"hilly walks; all exercise; / Fling but a stone, the\ngiant dies\" (91-92). Green is conveying a simple point, yet he does it in a neat and fashionable\nProctor - 2\n\nway. Even the small exercise of throwing a stone will defeat the melancholy of the spleen,\nlikening the image to that of David and Goliath. The rhythm and meter of \"The Spleen\" is iambic\ntetrameter, another device used to enhance the clarity of the argument and help the reader to\nfollow along. Iambic rhythm best follows the patterns of natural speech and the shorter lines of\nthe tetrameter help to keep the tone light. Perhaps by using stylistic characteristics that emphasize\nthe rationality and lucidity of the argument, Green hopes to stress his idea of the importance of\nreason. The rhyme structure, rhythm, and metrical form of \"The Spleen\" give clarity to Green's\nwriting and represent the \"reason\" in his poem.\nThough the rhyming scheme and other elements of style add a sense of order to Green's\nwriting, the poet moderates this through the overall form and tone of \"The Spleen\". The\ndisorganized train of ideas and the self-conscious casualness of Green's writing serve to\nunderscore his idea of moderation in all realms: he balances what he considers to be his words of\nreason with his flighty manner of writing. In the first ten lines of \"The Spleen\", Green writes:\nThis motly piece to you I send,\nWho always were a faithful friend,\nWho, if disputes should happen hence,\nCan best explain the author's sense,\nAnd, anxious for the publick weal,\nDo, what I sing, so often feel.\nThe want of method pray excuse,\nAllowing for a vapour'd Muse;\nNor, to a narrow path confin'd,\nHedge in by rules a roving mind.\nAs evidenced by the first two lines of \"The Spleen\", Green initially sent the piece to a friend\ninstead of publishing it for a wide audience, and this may partially explain the informal tone of\nthe poem. The use of the word \"motly\" (an older version of the word \"motley\") implies that\nGreen recognizes his poem as being discordant and disorganized in style. Green apologizes for\nhis manner of writing by saying, \"The want of method pray excuse, / Allowing for a vapour'd\nMuse\" (7-8). Green confesses that \"The Spleen\" is unorganized and rambling in structure, listing\nProctor - 3\n\nways to live the contemplative life yet interspersed with side thoughts and tangents. Green argues\nfor his associative manner of writing in the lines: \"Nor, to a narrow path confin'd, / Hedge in by\nrules a roving mind\" (9-10). Instead of following a strictly ordered layout, Green's poem is more\na random walk of ideas, unconfined by any structure or logical ordering. Green does not intend to\nwrite a strict scientific analysis of the problem of melancholy, as evidenced by his lines, \"First\nknow, my friend, I do not mean / To write a treatise on the spleen\" (33-34). Instead, Green\nassumes that readers wish to know \"how I do myself demean / In stormy world to live serene\"\n(41-42). Green does not intend \"The Spleen\" to be a strict scientific analysis of the problem of\nmelancholy but a loose description of how he himself lives and guards against spleen. Green's\napology for his \"want of method\" at the beginning of \"The Spleen\" differs from the work of\nPope, who in An Essay on Man placed a section describing the scientific design and arguments of\nhis piece before the presentation of his poetry. Pope makes a point of laying out all of his\narguments in a coherent, organized fashion, thus emphasizing the use of reason as a tool to aid\nunderstanding and help readers to follow his progression of ideas. The difference between Pope\nand Green's structure of argumentation is evident: the style of writing in \"The Spleen\" is more\nbased on \"passion\" and the whims of the poet than the formal, ordered structure of Pope's work.\nThe structure and style of argumentation in \"The Spleen\" counteracts the order imposed by the\nrhyme scheme, demonstrating Green's belief that a balance of passion and reason is beneficial\nboth in life and in writing.\nIn \"The Spleen\", Green suggests that a moderate, balanced life--a life not overwhelmed\nby either reason or passion--is the cure for the illness of melancholy. Green conveys this idea\nboth thematically and through the structure of his poem, for the contrast of Green's organized\nrhyme scheme with his casual, unorganized flow of ideas exemplifies the balance of reason and\npassion that he recommends for life.\nProctor - 4"
    },
    {
      "category": "Resource",
      "title": "thomson_summer.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-704-studies-in-poetry-british-poetry-and-the-sciences-of-the-mind-fall-2004/cd927947a26a387c25b1e79e71f54503_thomson_summer.pdf",
      "content": "Lindsay Hays\nJames Thomson The Seasons \"Summer\"\n21L.704 Studies in Poetry\nOctober 18, 2004\n\nHays 2\nThe history of James Thomson's The Seasons is one that has been a bit\nromanticized over the years. As a young Scottish poet, Thomson came to London not\nwith a copy of \"Winter\" in his pocket, but merely the idea for a religious-didactic poem\nabout nature and the goal of gaining a patron. Although he did not make much money\nfrom this first poem, it was well received and soon the next three seasons followed. All\nfour poems focus on the sensuous description of the seasons' effect on a rural landscape,\nsome reflection on philosophy and morality, and Newtonian science in blank verse. In\nthe poem \"Summer,\" and in the minds of many readers, the main symbol of this season is\nthe Sun. In this poem the Sun is followed during its migration through the sky, honored\nin a Hymn about its powers and compared to the glory of Philosophy. In \"Summer,\"\nThomson presents some of his most powerful praises of Newton's natural science in\nconjunction with a personification of nature to present a powerful portrayal of the Sun\nand all that it symbolizes.\nAfter the introduction of the subject and the invocation, the subject of the poetic\nverse is the Sun. The first image is the dawn of day with light beginning to come over\nthe horizon, and this is followed by a description of the beauty of \"Sun-rising.\" In this\nbeginning part of the poem, the Sun is getting its first descriptions as the \"powerful King\nof Day\" (81). The representation of the Sun as a powerful being, an immortal or royalty,\nis a theme that is continued throughout Thomson's piece. After this reference there is a\npersonification of the landscape becoming glad at the appearance of the Sun, and a\nportrayal of light as being \"Of all material beings first, and best!\" (91). Through this\npersonification Thomson establishes a sensuous description of nature. Although short,\n\nHays 3\nthe first section of the poem associates the Sun with the mythical Sun god, recognized by\nGrecian or Roman mythology as a powerful figure.\nThe second excerpt, the \"Hymn to the Sun\" contains some of the most powerful\nscientific themes of the poem. In the description of the gravitational power and the\npower of over the seasons and life, the commanding effect that Newtonian science had on\nThomson is apparent. In the lines \"'Tis by thy secret, strong, attractive force/ As with a\nchain indissoluble bound/ Thy system rolls entire\" (97-99), a clear reference is made to\nNewton's work on the gravitation of natural bodies. In the next paragraph the lines,\n\"Without whose quickening glance their cumbrous orbs/ Were brute unlovely mass, inert\nand dead/ And not, as now, the green abodes of life!\" (105-107) show the power that the\nSun has to create life on the Earth. Following this paragraph Thomson writes \"The\nvegetable world is also thine/ Parent of Seasons!\" (112-113). Here the Sun is revered as\nholding power over all of the seasons, the subject of these series of poems, the Summer\nbeing the season where it holds the most power. Although the Sun features as a symbol\nmany times in this particular poem, in the few lines that form the \"Hymn to the Sun\"\nThomson presents scientific observations about the universal powers of the Sun, the\nenergy and force it has to control the planets. This section, following directly after the\n\"Sunrise,\" introduces the duality between the universal and the personalized\ninterpretations of the Sun, a feature that serves to highlight the power of each individually\nand as a whole.\nThe next section that focuses intently on the Sun is the section about \"Noonday,\"\nwhere the power of the Sun's heat is emphasized. In the opening lines of this section the\n\nHays 4\npower and heat of the Sun are compared to a heavy rain of fire beating down upon the\ncountryside:\n'Tis raging noon; and, vertical, the sun\nDarts on the head direct his forceful rays.\nO'er heaven and earth, far as the ranging eye\nCan sweep, a dazzling deluge reigns; and all\nFrom pole to pole is undistinguish'd blaze. (432-436)\nIn this section a new physical power of the Sun is called to attention, the heat, one that is\nmore easily realized by even the basest living things, and difficult to escape in the\nsummer months. There is some escape from the heat attempted, but even after the\nnarrator throws himself into the \"covert of the grove,\" (450) he exclaims, \"All\nconquering Heat, oh intermit thy wrath!\" (451), for it is inescapable. The heating power\nof the Sun in this excerpt is a physical property that ties the universal, the warming of the\nplanet and production of seasons and storms, and the personal, since each living thing\nfeels this power during the hot summer months.\nIn the last section, though it is the shortest, the power of the Sun again is\naddressed in a symbolic depiction. In this section there is very little emphasis on the\nphysical science described earlier, but there is again reference to the Sun as the god of the\nsky, being treated with god-like honors and coming to rest among the goddess of the sea\nand nymphs. At Sunset, \"The shifting clouds/ Assembled gay, a richly gorgeous train/ In\nall their pomp attend his setting throne\" (1620-1622); and as he descends he is welcomed\n\"As if his weary chariot sought the bowers/ Of Amphitrite, and her tending nymphs\"\n(1624-1625). This \"Sunset\" section, richly descriptive poetry is combined with brevity of\nlines and a godly subject. As this section is very similar to the \"Sunrise\" both images act\n\nHays 5\nto bookend the main action of the poem, and provide a balance in this scientific poem to\nthe strict observations of nature that permeate.\nThe scientific aspect of the Sun is presented most clearly in the \"Hymn to the\nSun\" where the physical and universal powers are given their most solid description and\nthe gravitational and energetic powers are discussed. In \"Hymn to the Sun\" and\n\"Noonday\" the Sun is referenced in a form not related to mythology, idealized or\npersonified. When the Sun is referenced as the Sun god, it supports the idea of the Sun as\na \"powerful\" figure, but in a different form than the scientific observation. Throughout\nthe poem, Thomson presents a duality, on one side an abstract and universal scientific\nworld that relates most to Newton's work in the Pricipia and on the other a personalized,\npersonified and sensuous world that relates to Newton's work in the Optics. This duality\nis preserved in the juxtaposition of the scientific and mythical presentations of the Sun.\nThough religion is never explicitly addressed, the presentation of a god-like figure in the\nSun that presides over the natural world presents the psysicotheological ideal - that the\norder and harmony of nature is something that is a result of the order and harmony of\nGod's work, an idea that was a common thread in scientific poetry admiring Newton. It\nis clear that this poem is Thomson's strong bid to be placed as the leader of natural poetry\nby balancing a praise and internalization of the science and reason of Newton with an\nimaginative description of nature's daily miracles.\nThe power of the Sun rules over the summer and gives the Sun its god-like stature\nin the poem. At the beginning the Sun's power is presented in both a mythical sense and\nthe scientific sense; the Sun is the power that holds the solar system together, sustains life\non Earth and changes the seasons. In the middle the power of the Sun controls the\n\nHays 6\ntemperature and comfort of all living things on the planet, from which there is little\nescape. At the end of the poem the mythical power of the Sun is again emphasized, and\nafter \"Sunset\" a new power is addressed that can be symbolized by the powers of the\nSun, but acts on man through his powers of reason.\nThe poem ends with \"Praise of Philosophy.\" In this section the powerful Sun is\ntied with the most important power of human reason. In this passage philosophy is\ndescribed with many of the same phrases and praised with many of the same metaphors\nthat have been used to portray the Sun for the majority of the poem:\nWith thee, serene Philosophy, with thee,\nAnd thy bright garland, let me crown my song!\nEffusive source of evidence, and truth!\nA lustre shedding o'er the ennobled mind,\nStronger than summer-noon; and pure as that,\nWhose mild vibrations soothe the parted soul,\nNew to the dawning of celestial day. (1729-1735)\nIn this last section of the poem, the correlation is made between the Sun and philosophy.\nThe Sun is the light of the world - it provides the power to keep things in order within the\nsolar system and on the Earth. Philosophy is the light of civilization, it provides order to\nthe human race and without it humanity would be have no guidance in the darkness.\nFurther, as beings endowed with a power that sets them apart from the rest of living\nthings, it is our duty to keep some semblance of balance and harmony both internalized\nand in the world at large.\nThroughout the poem, the various powers of the Sun are addressed and used to\nemphasize of the scientific and literary aspects of the poem. As it is the scientific poet's\nrole to balance reason and imagination, observations and descriptions of the Sun in\n\"Summer\" can be divided between those that treat the Sun as a personified god-like\n\nHays 7\nfigure and those that treat it as a universal power affecting all. Both descriptions focus on\nthe Sun as a powerful figure in the physical world. This poem also asserts that\nPhilosophy is a powerful human tool to set us apart from other animals and draws a very\nstrong analogy at the end of the poem between the power that philosophy gives to man\nand the power that the Sun exerts over the Earth. In this masterful work by Thomson, he\nhas proven himself to be a worthy advocate of Newton's science as well as an impressive\nscientific poet in his own right.\n\nHays 8\nBibliography:\nJames Thomson Biography\nhttp://www.bookrags.com/biography/james-thomson/\nLiterary Encyclopedia: James Thomson\nhttp://www.litencyc.com/php/speople.php?rec=true&UID=4389\nSamuel Johnson's Lives of the English Poets\nhttp://www.hn.psu.edu/Faculty/KKemmerer/poets/thomson/default.htm\nClaude Lorrain (1600-1682), French classical landscape painter\nhttp://www.j-m-w-turner.co.uk/artist/turner-claude.htm"
    },
    {
      "category": "Resource",
      "title": "univ_beauty_rev.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-704-studies-in-poetry-british-poetry-and-the-sciences-of-the-mind-fall-2004/ed5fb2fd5cfc8f4b89137bfbd669c582_univ_beauty_rev.pdf",
      "content": "Jonathan Blum\n21L.704\nFinal Draft\nFor God's Sake!--the Need for a Creator in Brooke's Universal Beauty\nThough his name doesn't spring to the tongue quite as readily as those of\nAlexander Pope or even Samuel Bowden, Henry Brooke left an indelible mark on the\ngenre of didactic verse with the 1735 publication of his Universal Beauty. Unfortunately,\nthough he would go on to write numerous plays, novels and pamphlets, these would bring\nhim even less renown than his initial effort. Later in his life, Brooke became involved in\npolitics, particularly with respect to the ongoing debate over the treatment of Catholics in\nIreland. He published less and less frequently in his final decades, falling into a deep\ndepression that some accounts even label insanity. A man of deep faith, Brooke's\nreligious convictions can be seen clearly in his writing. At the same time, however, he\nwas very much a student of the modern sciences, particularly the work of Newton.\nThrough an analysis of Universal Beauty's mechanics and theme, it will be seen that\nBrooke viewed both the splendor and scientific perfection of the universe of as\nincontrovertible proof of God's divinity.\nUniversal Beauty is a poem vast in both the scope of its subject matter and its\nsheer length. Brooke sets out, as he describes in the preface, to put forward a thorough\npresentation of all beauty in the known universe beginning with \"a demonstration, a\npriori, of the being and attributes of God,\" and continuing through Creation to the most\nrecent scientific discoveries of his time. The passages in this analysis were chosen for\ntheir strong connections to the newest scientific ideas of the time as well as to each other.\nThough the following analysis will mostly focus on Brooke's interpretation of Newtonian\n\nphysics and its relationship with a divine Creator, one should certainly not be left with the\nimpression that this is the sole focus of the poem or even merely one of its six books!\nUniversal Beauty meanders through such disparate territories as the life sciences and\ngeology; it snakes between both history and myth. Though this analysis may be limited\nin its range, the work itself assuredly is not.\nBrooke frames his ambitious poem in heroic couplets, much like his legendary\npredecessor Pope. Unlike Pope, however, Brooke rarely keeps his couplets self-\ncontained, instead letting ideas and sentences sprawl across entire stanzas. While this has\nthe effect of removing some of the forcefulness inherent to the couplet, it also allows the\npoet's words to paint more complete images, each building upon the last. Despite its\nopen couplets, the poem avoids a \"conversational\" tone; the use of iambic pentameter\nkeeps the poem sufficiently structured to complement its lofty subject matter. As a poet\nand a scholar, Brooke was simultaneously concerned with aesthetics and structure, so the\ncompromise inherent in his prosody works very well. Extended metaphors abound in the\npoem, with characters from Greek mythology and great sailing ships taking on such roles\nas blood circulation and physical laws for countless lines at a time. It is in this attitude,\nwhere no detail is too minute to be rhapsodized extensively about, that Brooke leaves his\nstrongest contribution to scientific poetry. Even taking each book as a separate entity,\nthere are still stories within stories within stories to be found, each hinting towards a\nlarger plan in the universe.\nOne of the strongest themes in Universal Beauty is the divinity and omnipotence\nof God. Though some philosophers studying Newton's new view of nature would go on\nto question whether there was still a role for God, Brooke clearly had no such difficulty\n\nreconciling natural laws with divine wisdom. From the start of the poem, where he poses\na challenge to all non-believers, to his very last line, Brooke makes it abundantly clear\nthat behind each sampling of perfection he details, God's hand is present. After\ndescribing a version of Newton's discoveries about light, he continues:\nBut whence the Light's invigorating force,\n\nIts active energy, or secret source,\n\nMust be ascribed to that Eternal Spring,\nWhom First, and Last, and ever Blest we sing--- (II, 65-68)\nBrooke wastes no time in reminding the reader that while light has countless amazing\nproperties, they are each and every one bestowed directly by God. In this view, the entire\npoem's topic--\"universal beauty\"--refers not to a vast collection of the aesthetically\npleasing but rather the universe as a whole, serving as a testament to God's divinity. This\nis a powerful idea, and Brooke clearly senses its enormity.\nIn cataloging the wonders of the natural world, Brooke employs a handful of\nwords repeatedly to get his message across. Though this may be due in some part to the\nfinite number of synonyms and similes that can be used to describe gravitational force,\nthere is an undeniable connotative power to these words. Specifically, Brooke uses\n\"wedlock\" to describe both the mutual gravitational attraction between masses and, later\nin Book II, the combinations of the four classical elements. The evocation of marriage,\none of the holiest and arguably most \"beautiful\" acts Man can perform on earth, is\nexceedingly deliberate. Such is the case also in Book I when Brooke refers to the motion\nof heavenly bodies:\nStill tow'rds the loved enlivening beam they wheel,\nAnd pant, and tremble, like the amorous steel. (I, 97-98)\n\nAmorous steel as a euphemism for magnetism is interesting, but it is even more\nnoteworthy when looked at along with a phrase several lines down, likening the bond\nbetween matter to an \"amorous touch\". Again, by drawing parallels between Newton's\nlaws and human intimacy, Brooke is able to simultaneously draw physics--Newton's\n\"secret spell\"--both up to the divine and down to the personal level.\nWhat, then, are the philosophical implications of Brooke's beautiful universe? A\nclue can be found in Book II:\nWhence we may pierce into the deep profound,\nAnd searching, view the wondrous system round:\nFor wide as universal Nature spreads,\nLight's sacred fount its streaming luster sheds; (II, 53-56)\nBrooke is equating beauty with goodness--the streaming light that may be found\nanywhere and everywhere is undoubtedly the light of God. Much as the Bible lists\nmiraculous occurrences on Earth, Brooke sees (and details) similar miracles in domains\nso large and small that they are only visible through scientific discovery. One can get a\nsense of his motive in writing Universal Beauty; what a reaffirming experience it must\nhave been to peer into a new world and find it completely consistent with an existing\nphilosophy! To Brooke, who saw goodness as radiant light, the knowledge that all\ndistant stars spun and burned under the same set of precise rules was the ultimate\nconfirmation of a universe of benevolence.\nThough Brooke is not as widely read today as some of his contemporaries, the\neffect his work left on British poetry is inescapable. Erasmus Darwin openly admitted\nthat much of his inspiration for The Botanic Garden came from reading Brooke and\nindeed, there is a striking similarity between the two works both in subject matter and in\nstyle. Pope himself said that with regard to Universal Beauty he approved of both the\n\nsentiment and the poetry. Brooke's ideas still persevere today, and if that is only because\nthe works that he inspired received more recognition, so be it. Much as his \"warring\nelements in wedlock bind,\" Brooke found a way to wed spirituality and science."
    },
    {
      "category": "Resource",
      "title": "wordsworth_essay.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-704-studies-in-poetry-british-poetry-and-the-sciences-of-the-mind-fall-2004/5388c6990133723eba02e671278018d1_wordsworth_essay.pdf",
      "content": "JoHanna Przybylowski\n21L.704 Final Essay\nWordsworth's Examination of the Role of Nature in Reason\nIn Lyrical Ballads, Wordsworth explores the dynamic relationship between the\nvalue of nature and reason in the continuum of thought. While Wordsworth claims in his\n\"Preface\" the purpose of the work is \"to illustrate the manner in which our feelings and\nideas are associated in the state of excitement\" [\"Preface,\" page 247], a secondary\nobjective threads through the poetry as he provides a treatise on the function of nature in\nenlightenment. Reason, observation of and incorporation into the natural world, and\nlearning through books are addressed differently in the poems, thus enabling Wordsworth\nto survey a range of interaction for these components of understanding. In addition to\naddressing multiple purposes, Lyrical Ballads employs poetry of varying form and style\nto more effectively reach the audience. The poems range in their content of lyric or ballad\nelements; some are presented as dynamic stories, others as heated conversations, and still\nothers as quiet contemplation. While, each form of poem has a different value in reaching\nthe audience, their diversity enhances the exploration of nature and reason. Moreover,\nthrough his craft at reaching the audience on a deeper level, Wordsworth experiments\nupon the audience to further explore the \"fluxes and refluxes of the mind when agitated\nby the great and simple affections of our nature\" [\"Preface\", page 247]. For example, in\n\"The Idiot Boy\" he draws upon the character associations learned in society to enhance\nthe reader emotions. Since Wordsworth stated purpose is to examine causes of\nstimulating human emotions, not to classify the role of nature or of reason, as a collection\nhis poems do not enumerate a specific position of nature within the continuum of\n\nthought. In fact, Wordsworth's explorations contradict in poems such as \"The Idiot Boy,\"\n\"The Tables Turned\" and \"Lines written a few miles above Tintern Abbey\".\n\"The Idiot Boy\" promotes pure nature, or the lack of reason, in a dynamic and\nemotional tale. Fretting over the health of her inexplicably ill neighbor, Susan Gale, Betty\nFoy sends her mentally impaired son, Johnny (\"the Idiot Boy\"), to fetch the doctor. Her\nheightened emotional states are so impressed upon the reader that they too experience the\nconcern, nervousness, anxiety, fear, pride, distress, hopelessness and joy of Betty Foy.\nLacking reason, Betty reacts to the moment; thus, her emotions, though always vivid, are\nalso fleeting.\nThough evidence of Betty's lacking reason runs throughout the poem, her\nemotional shifts and the causes thereof in the duration between sending Johnny out and\nleaving to find him most clearly illustrate it. After an extended wait with no sign of\nJohnny's return, Betty's pride and hope, which resulted from sending Johnny to fetch the\nDoctor, is replaced by an annoyance with Johnny's delay when she describes him as \"A\nlittle idle sauntering thing!\" [\"The Idiot Boy,\" ln 170]. While another hour passes without\nJohnny's return, Betty's emotional state shifts more towards confusion about the delay\nand frustration with the fact that she cannot aid Susan. As she waits, Betty has nothing to\noccupy her time besides watching over the sickly Susan; rather than ponder the possible\nexplanations for Johnny's delay or think upon an alternative cure for Susan, Betty focuses\nher thoughts upon the frustration of the moment, thereby leaving the audience with an\nimpression of a non-reasoning individual. Finally, Betty Foy's fear for Johnny's safety,\nwhich at times replaces her concern for Susan's health entirely, is initiated by a comment\nSusan makes: \"And Susan she begins to fear / Of sad mischances not a few, / That\n\nJohnny may perhaps be drown'd, / Or lost perhaps and never found\" [\"The Idiot Boy,\" ln\n187-190]. Based on the description of Johnny's mental state and his reaction to being sent\nfor the Doctor, one need not reason much to elicit a concern for his safety. That Betty,\npreoccupied by being forced to wait, cannot develop a readily-reasoned concerned for her\nown son's safety clearly demonstrates her lack of reasoning.\nWhile Betty Foy is not a reasoning character, she is also not a character immersed\nin nature; she neither learns nor extracts joy from nature. In fact, the primary importance\nof her character stems from the reader's emotional connection to her, which develops and\nsolidifies with each dramatic shift of state. Having thus designed the character of Betty\nFoy, Wordsworth addresses his stated purpose in Lyrical Ballads; he explores the nature\nof the bond that a reader develops with a character and the intensified emotional states\nthat can be transmitted through the bond. But there is another purpose to Betty Foy's\ncharacter, one that addresses his secondary objective of exploring the value of nature and\nreason within thought. As the main character with whom the reader develops a bond, she\nis deeply attached to the Idiot Boy.\nThe Idiot Boy, a controversial character due to his title, represents a character\ncompletely free of reason. Thus, through Johnny, Wordsworth addresses both of his aims.\nThe reader can envision Johnny more as a component of nature than as an element of\nhuman society. Wordsworth's diction and structure indicate that his plan was to leave the\nreader with such an impression. For example, as Johnny rides away from the house, he\nvocalizes along with the owlets: \"And in Johnny's in a merry tune, / The owlets whoot,\nthe owlets curr, / And Johnny's lips they burr, burr, burr\" [\"The Idiot Boy\", ln 113-115].\n\nMoreover, Johnny's general lack of concern about the state of Susan Gale contributes to\nthe reader's exclusion of Johnny from human society.\nIn a response to John Wilson's letter on Lyrical Ballads, Wordsworth explicitly\nstates his reason for choosing such a potent nickname for Johnny; the intent was the play\nupon the associations that one develops through society on the word \"idiot\". While he did\nnot desire the reader to be repulsed by the stupidity of Johnny, as \"idiot\" might imply, he\ndid seek to draw out a learned association of the audience. \"If there had been any such\nword in our language, to which we had attached passion, as lack-wit, half-wit, witless etc\nI should have certainly employed it in preference but there is no such word\" [Letters1,\npage 54]. Indeed, the selection of \"Idiot Boy\" for a nickname illustrates one of the means\nby which Wordsworth succeeds in exploring the causes of reader excitement.\nHaving stimulated the reader's emotions through the preconceptions associated\nwith \"idiot,\" Wordsworth utilizes this preconception to challenge the reader's\nexpectations. Betty Foy's attachment to Johnny demonstrates the deep love she feels\ntowards him; moreover, her degree of love and caring add a component of humanity to\nJohnny's character. An audience unfamiliar with a boy of Johnny's mental capacity\nmight be disgusted at his inability to perform simple tasks; they might consider him a\nburden and nuisance. However, still Betty Foy loves him beyond all measure. Even her ill\nstate, Susan Gale, who has no maternal relationship to him, demonstrates a love for\nJohnny. Thus, the audience is presented with their first challenge.\nThe second challenge to the reader, which is buried slightly deeper in the text,\naddresses Wordsworth exploration of the value of nature. Though Johnny fails on his\nmission to retrieve the Doctor, Susan Gale rapidly returns to health. As Johnny wanders\n1 The Letters of William Wordsworth, Alan G. Hill editor, New York, Oxford University Press, 1990.\n\naimlessly enjoying the ride, Susan frets and her mind, as well as her body, becomes ill.\nYet, indirectly and unintentionally, Johnny causes Susan to heal. No scientific or\nreasoned explanation exists for Susan Gale's return to health. Moreover, through no\nevident means did Johnny assist her recovery. However, the reader cannot deny that\nJohnny's actions did assist Susan. Thus, the reader is left with the following quandary: if\nthis story is believable, by innocent, unreasoning nature Johnny healed a woman near\ndeath. However, to explore the facets of this quandary against reason, the reader must\nemploy a logical reasoning. Now, the reader has reached Wordsworth's third challenge,\nthe same challenge which he himself is attempting to reconcile: how does nature best\ninteract with reasoning to support an understanding of the universe.\nWhile Johnny's character highlights the value of nature, the pony is a highly\nreasoning character. Wordsworth explicitly states that the pony, which one would expect\nto be more closely aligned with the natural world, is a thinking pony. Hence, he\nchallenges the reader to accept that an animal can produce coherent thoughts. This\npropensity for thought is the good-humored pony's only flaw since thinking distracts the\npony from accomplishing its task. \"But then he is a horse that thinks! / And when he\nthinks his pace is slack; / Now, though he knows poor Johnny well, / Yet for his life he\ncannot tell / What he has got upon his back\" [\"The Idiot Boy,\" ln 122-126]. Thus,\nWordsworth paints for the reader a picture of a pony sundering along slowly through the\nwoods pondering the weight and distribution of the object on its back. By stressing that\nthe act of reasoning inhibits the pony's ability to achieve its task, Wordsworth argues\nagainst reason.\n\nThe character of the pony in \"The Idiot Boy\" openly represents thought as a\nnegative quality; on the other hand, the personality of Susan Gale, the most strenuously\nthinking character, subtly argues against thought. Through Susan's character,\nWordsworth contends that one does not need to continuously seek answers. Nothing is\naccomplished through Susan's reasoning; in fact nothing is accomplished through the\npony's reasoning either. Moreover Wordsworth highlights the power of nature over\nreason through Susan. Though hers is the tendency towards thought, she is in a quandary\nregarding a cure for her illness; waiting for the Doctor to attend her and to prescribe a\nbook-learned treatment, Susan inexplicable heals by the due course of nature.\nLong Susan lay, deep lost in thought,\nAnd many dreadful fears beset her,\nBoth for her messenger and for her nurse;\nAnd as her mind grew worse and worse,\nHer body it grew better.\nShe turned, she toss'd herself in bed,\nOn all sides doubts and terrors met her;\nPoint after point did she discuss;\nAnd while her mind was fighting thus,\nHer body still grew better.\n[\"The Idiot Boy\" ln 422-432]\nThus, Wordsworth implies that given time to pursue to its own devices, nature will\namend a situation.\n\"The Idiot Boy\" is a dynamic tale in which Wordsworth employs his craft of\nreaching the audience at a deeper level to advocate the value of nature. Using the\nassociations that the audience would develop in human society, he forms a deeper bond\nbetween them and the characters, one which more strongly conveys the character's\nemotional state. In forming this bond Wordsworth addresses his stated goal of examining\nthe manner in which feelings and ideas develop in a state of intensified emotion.\n\nMoreover, through this bond and other poetic crafts, the nature-lover within Wordsworth\nsurfaces as he presents a position that the act of reasoning lacks value and that nature\nalone is the desired state. Ironically, to extract this message on the role of nature and of\nreasoning, Wordsworth requires the audience to think carefully upon the elements of the\npoem.\nDue to its length and story-like elements, \"The Idiot Boy\" contains more\nsubstance than shorter poems, such as the heated conversation in \"The Tables Turned.\"\nHowever, the value of \"The Tables Turned\" rests in the explicit clarity of Wordsworth's\nmassage, not in the complex web of character interaction and meaning. In its 32 lines,\nWordsworth provides a clear picture of the downfalls of knowledge inherited through\nbooks and study of others' philosophies; meanwhile he asserts the diversity of the value\nfound within nature.\nIn \"The Tables Turned,\" Wordsworth claims that the study of books has a\nnegative effect on one's health, is a monotonous and endless strife, misshapes beauty and\nlacks truth. He begins with the humorous message, \"Up! up! my friend, and quit your\nbooks, / Or surely you'll grow double\" [\"The Tables Turned,\" ln 3-4]. Though the\nassociation between being well-read and overweight is an entertaining introduction, one\nwhose tone matches that of the poem, it is not the most important message which\nWordsworth conveys. The lyrical elements and sing-song verses elicit a cheerful\nexcitement in the audience to complement the merry state of the speaker; however, the\nmerriment does not detract from the more profound statements on reason and nature.\nWordsworth argues that studying books is an endless plight through which one\ncannot reach a valid end. Claiming that the messages contained in books are misshapen\n\nby human intellect, he draws a parallel between a physician's dissection of a body and a\nscholar's dissection of natural occurrences: \"Our meddling intellect / Misshapes the\nbeauteous forms of things; / - we murder to dissect\" [\"The Tables Turned,\" ln 26-29].\nThe harness of this particular criticism is its attack on the heart of reason. To further an\nunderstanding of the universe one studies texts with the aim of gaining an insight\nrevealed by earlier scholars; thus, one relies on the validity of the work of the scholar. If\nin the act of dissecting an observation of nature, the prior scholars misshapen it and thus\nprovides a false impression, the reader studies erroneous information. While the\ncriticisms that book-learning is dull, boring or unhealthy speak against studying from\ntexts, only the assertion of its misleading and fallacious content address the nucleus of its\npurpose in advancing reason.\nThough texts cannot assist in one's pursuit of reason, observations of nature are\nessential to the quest. Wordsworth summarizes the positive aspects of nature in four\nlines: \"She has a world of ready wealth, / Our minds and hearts to bless - / Spontaneous\nwisdom breathed by health, / Truth breathed by cheerfulness\" [\"The Tables Turned,\" ln\n16-20]. As opposed to the endless task of studying the \"barren leaves\" [ln 30] in texts, the\nopportunity to examine nature yields copious insight full of pleasure. Wordsworth\ndescribes nature with diction of \"sweet\" [ln 11] and \"blithe\" [ln 13], thereby implying\nthat by immersing oneself in nature one will experience similar emotions.\nIn addition to addressing the joy of nature, Wordsworth emphasizes the learning\nwhich one can obtain by examining it. \"One impulse from a vernal wood / May teach you\nmore of man; / Of moral evil and of good, / Than all the sages can\" [\"The Tables\nTurned,\" ln 21-24]. The truth Wordsworth associates with the study of nature provides a\n\nstark contrast to the distorted depiction found in texts. Moreover, Wordsworth argues\nagainst learning through others in general (i.e. through conversations as well as through\nbooks). Though he attacks texts most strongly in \"The Tables Turned,\" he communicates\nthe downfall of all secondary learning and the benefit of experiencing nature.\nWhile \"The Idiot Boy\" shed a negative light on reason, \"The Tables Turned\"\navoids a direct assessment of reason. Because the value of nature is expressed through its\nability to augment thought, Wordsworth appears to support reasoning. In addition to a\ncontradiction in his review of reason between the two poems, Wordsworth presents the\nvalue of nature differently. In \"The Idiot Boy\" Wordsworth demonstrates that a reliance\nupon nature has a positive outcome, that nature is capable of healing without the\ninterference of reasoning, and that characters closely connected with nature do not\nexperience distress from worrying. Moreover, Wordsworth leaves the reader to extract\nthe relationship between nature and reason in \"The Idiot Boy\"; while, in \"The Tables\nTurned,\" Wordsworth directly states the relationship. Thus, from a comparison of these\ntwo poems, one can conclude that Wordsworth himself was exploring the dynamic\nrelationship between the value of nature and reason and how that relationship impacts a\ngreater understanding of the universe.\n\"Lines written a few miles above Tintern Abbey\" employs a wholly different,\nballad-like approach to both the poetic style and the message. In this poem Wordsworth\nreflects upon a visit to the area five years prior and his emotional state during that visit;\nhe considers the impact that nature had on him both during the visit and during his later\nreflections upon the visit. The method of conveying information in \"Lines written a few\nmiles above Tintern Abbey\" is based purely on reflection; while \"The Idiot Boy\" told a\n\nstory from which the reader was left to extract information and \"The Tables Turned\"\npresented an energized argument with a blatant purpose, \"Lines written a few miles\nabove Tintern Abbey\" removes all action elements. The reader's only glimpse at action in\nthe poem is through the reflection upon the prior visit:\nI came among these hills; when like a roe\nI bounded o'er the mountains, by the sides\nOf the deep rivers, and the lonely streams,\nWherever nature led; more like a man\nFlying from something that he dreads, than one\nWho sought the thing he loved. ...\n[\"Tintern Abbey\" ln 68-73]\nThe heavy reliance of \"Lines written a few miles above Tintern Abbey\" on\ncontemplation indicates that Wordsworth supports reflection in the poem. In addition,\nWordsworth praises reflection directly throughout the poem. He explains how conjuring\nthe memory of his more youthful visit has sustained him between the visits; moreover, he\nexplains why such memories comfort him. Thus, he demonstrates a deeper understanding\nof the relationship between nature and reflection, one which he readily shares with the\nreader.\n... For I have learned\nTo look on nature, not as in the hour\nOf thoughtless youth, but hearing oftentimes\nThe still, sad music of humanity,\nNot harsh nor grating, though of ample power\nTo chasten and subdue. And I have felt\nA presence that disturbs me with the joy\nOf elevated thoughts; a sense sublime\nOf something far more deeply interfused,\nWhose dwelling is the light of setting suns,\nAnd the round ocean, and the living air,\nAnd the blue sky, and in the mind of man,\nA motion and a spirit, that impels\nAll thinking things, all objects of all thought,\nAnd rolls through all things ...\n[\"Tintern Abbey\" ln 89-103].\n\nHere Wordsworth begins to describe the comfort which he extracts from nature. The\nsource of this comfort is not sensory inspiration of the moment; rather, the realization of\nomnipresence of nature reassures him, and the recollection of past experiences provides a\nsource of joy. In other areas of \"Lines written a few miles above Tintern Abbey,\"\nWordsworth elaborates further upon the interaction between nature and reason. He argues\nthat nature provides an intensification of thought and that a return to thought should be\ngrounded in human sensation. Moreover, reason is as crucial as experiencing nature in\n\"Lines written a few miles above Tintern Abbey;\" without the thought and reflection\nupon his past encounters, Wordsworth would fail to extract pleasure and comfort while\nabsent from immersion in nature.\nIn Lyrical Ballads, Wordsworth investigates the audience response to reach them\non a deeper emotional level; moreover, he explores a dynamic relationship between\nnature and reason. \"The Idiot Boy,\" \"The Tables Turned,\" and \"Lines written a few miles\nabove Tintern Abbey\" demonstrate both the range of Wordsworth's methods and the\nrange of his explorations into nature and reason. All three poems portray the observation\nof and interaction with nature as a positive experience. However, they differ in the\nreconciliation of nature and reason. \"The Idiot Boy\" implies that thought and reasoning\nserve no purpose besides to cause inefficiencies and inhibit nature; \"The Tables Turned\"\navoids reference to reason and juxtaposes the value of nature with the downfalls of\nlearning from texts; \"Lines written a few miles above Tintern Abbey\" amalgamates\nnature and reasoning into an advanced understanding of the value which results from\ncombining their benefits."
    },
    {
      "category": "Resource",
      "title": "luc_essay_jnp_v2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-704-studies-in-poetry-british-poetry-and-the-sciences-of-the-mind-fall-2004/b1dcf45723982aa643145120ece5fa70_luc_essay_jnp_v2.pdf",
      "content": "JoHanna Przybylowski\n\n21L.704\n\nRevision of Assignment #1\n\nImpact of the Fundamental Tension between Poetic Craft and the\nScientific Principles which Lucretius Introduces in De Rerum Natura\n\nIn his didactic position, Lucretius employs the mellifluous character of poetry to\nelaborate upon the structure of the universe; his \"dulcet strains\" assimilate scientific\nobservations, philosophical ponderings and logical analysis to stimulate the audience.\nAddressing subjects as diverse as the composition of matter, the structure of the universe,\nand the motivations of the spirit, he aims to enlighten the audience and to destroy their\nsuperstitions. The abstract nature of his subjects, obscure to the listener, is made more\nenjoyable through poetic verse. However, the poetic device of an invocation to the gods\ncontradicts his materialistic teachings, thus introducing a tension in De Rerum Natura;\nLucretius attempts to incorporate the conventional invocation of deities into a poem in\nwhich he argues that the gods are not responsible for creating objects or occasioning\nevents. This fundamental tension between the science being taught and poetic convention\npresents a challenge not only to Lucretius, but also to the audience; the audience must\njudge whether Lucretius was successful in the amalgamation of the poetic and scientific\ngenres essential to the poem. From a purely scientific standpoint, the invocation served to\nweaken the argument by presenting a potential contradiction within Lucretius'\nphilosophy; however, from a broader perspective, one recognizing Lucretius as an\ninstructor and a poet as well as a scientist, the invocation illustrates Lucretius' craft in\nmanipulating the audience to gain their attention.\nPrzybylowski - 1\n\nAs Lines 921-951 in Book 1, illustrates, Lucretius intentionally presented his\nargument in the mode of poetry. Recognizing the conceptual difficulty of the material and\nthe unique character of the thought, he selected a literary form and style of presentation\nwith a lyric basis. The song-like nature of his presentation was intended to trick the\naudience to attend to the subject matter. For example, in his analogy to a sick child\ndrinking wormwood because of the honey on the cup's edge, Lucretius said, \"They are\ntricked but not trapped, for the treatment restores them to health. In the same way our\ndoctrine often seems unpalatable to those who have not handled it, and the masses shrink\nfrom it. That is why I have tried to administer my philosophy to you in dulcet strains of\npoetry, to touch it with the sweet honey of the Muses\" (1.c940-947).\n\nAfter his analogy to the draught for a sick child, Lucretius points out that the child\nis \"tricked not trapped;\" thus, he implies that the audience too is not trapped. Though\ndeceived by the poetic presentation, they have listened to his argument, the audience is\nnot trapped into agreeing with Lucretius. His intent is to stimulate their thought on the\nstructure of the universe. While Lucretius firmly believes in the principles and ideas\nwhich he teaches, he does not necessarily expect the audience to understand or agree with\nhis argument. Rather, his emphasis focuses around expanding the mind and diversifying\nones thoughts. He says, \"My object has been to engage your mind with my verses while\nyou gain insight into the nature of the universe and the pattern of its architecture\"\n(1.c947-951). Thus, his goal is to enlighten the audience. Since enlightenment does not\nresult from blind agreement, but from thoughtful understanding and assent, Lucretius\nprides himself in exciting men's minds to ponder these topics: \"This is my reward for\nteaching on these lofty topics, for struggling to loose men's minds from the tight knots of\nPrzybylowski - 2\n\nsuperstition and shedding on dark material the bright beams of my song that irradiate\neverything with the sparkle of the Muses\" (1.c930-937). In the above quote, Lucretius\nemphasizes his role as a teacher who values thought and logic, and he exercises poetic\nlanguage. But, he is not a poet whose primary motivation is to entertain the audience;\nLucretius, recognizing that poetry provides a means to more effectively reach his\naudience, employs the craft of a poet.\n\nIn addition to fulfilling the roles of teacher and of poet, Lucretius operates as a\nscientist by combining observations of the natural world with thought-experiments and\nlogic. Though Lucretius' methods of argumentation fall short of modern scientific\nprocedure, they constituted a scientific method when De Rerum Natura was composed in\nthe first century before Christ. On abstract topics, such as the formation of the universe,\nLucretius relies heavily on reasoning and philosophy to prove his argument; to enforce\nhis claims he correlates his propositions to easily made observations of the world. For\nexample, his theory for the formation of the world states that atoms \"have experienced\nevery variety of movement and conjunction till they have fallen into the particular pattern\nby which this world of ours is constituted\" (1.c1026-1029). Then, he proposes that the\natoms remain in the configuration once they have been \"set going in the appropriate\nmotions\" (1.c.1030-1031). Finally he asserts that there are atoms continually replenishing\nthe world from the \"infinite space\" to counter the loss of atoms. This last contention is\nsupported by his observation that \"animals deprived of food waste away through loss of\nbody\" and extrapolation from this observation that \"everything must decay as soon as its\nsupply of matter goes astray and is cut off\" (1.c1037-1041).\nPrzybylowski - 3\n\nLucretius repeatedly argues against the superstitions of men. One of his goals is to\ndispel baseless myths through the demonstration of scientific thought applied to the\nexplanation of natural phenomena. For example, he speaks to Memmius and the other\naudience of the power of prophets, who are able to impact men's lives so significantly\nsince the men lack a defense. These prophets conjure phantoms and stories; men fall\nvictim to belief in these tales for fear of eternal punishment since they do not understand\nthe nature of the spirit after death. Thus Lucretius seeks to answer such questions on the\nspirit as \"Is it born, or is it implanted in us at birth? Does it perish with us, dissolved by\ndeath, or does it visit the murky depths and the dreary sloughs of the Underworld?\"\n(1.c112-115).\n\nIn addition to dispelling the power of prophets, Lucretius endeavors to account for\nnatural phenomena, such as echoes, with scientific reasoning as opposed to mythological\nreasoning. The first principle that Lucretius asserts, \"Nothing is ever created by divine\npower out of nothing,\" (1.c149) begins to address the position of the gods in governing\nevents. Though Lucretius does not argue against the existence of the gods, and in fact\nrepeatedly invokes the Muses and Venus in the poem, he does strive to dispel their\nattribution to a cause for many phenomena. \"Accordingly, when we have seen that\nnothing can be created out of nothing, we shall then have a clearer picture of the path\nahead, the problem of how things are created and occasioned without the aid of gods\"\n(1.c155-159).\n\nWhile Lucretius appears to argue against the power of the gods, he invokes their\npower, hence introducing confusion in the text. Though Lucretius never denies divine\ninfluence, he relegates the deities' power to augmenting that which already exists.\nPrzybylowski - 4\n\nMoreover, his materialistic arguments and reasoning produce an atmosphere supportive\nof denying divine existence; if, in the poem, Lucretius had not called upon the gods, the\naudience might readily conclude that he did not believe in their existence. In addition,\nLucretius fails to provide reasoning for the existence of divine power or to unite divine\npower with his materialistic arguments. This lack of argument surrounding the capacity\nof deities contrasts starkly with the method of comprehensive logic which Lucretius\nroutinely employs. Thus, from a scientific perspective, the invocation of divine power\nserves to weaken Lucretius' arguments by providing an apparent contraction and by\nomitting the reasoning crucial to Lucretius' method.\n\nHowever, Lucretius' function extends beyond that of a scientist; he is poet and\ninstructor as well. Examination of Lucretius' divine invocations as a poetic device reveals\nLucretius' skill as a poet. With this broader perspective on Lucretius' roles, one can\nassume that the opening invocation to Venus was incorporated to entice the audience.\nThe opening invocation conformed to poetic convention of the time period, thus\nsupporting the poetic nature of Lucretius' presentation. Moreover the diction and\nfigurative language paint a lucid picture for the audience; when calling to Venus,\nLucretius says, \"Through you all living creatures are conceived and come forth to look\nupon the sunlight. Before you the winds flee, and at your coming the clouds forsake the\nsky. For you the inventive earth flings up sweet flowers. For you the ocean levels laugh,\nthe sky is calmed and glows with diffused radiance\" (1.c5-9). Since wind blowing, clouds\ntraversing the sky, plants growing and the ocean levels varying are easily observable\nphenomena, the audience can comprehend and imagine them. Lucretius begins by\ndepicting events with which the audience cane readily identify, though he aims to\nPrzybylowski - 5\n\nenlighten the audience on a number of abstract and alien ideas. The reference to common\nphenomena entices the audiences' attention and stimulates their minds; thus, Lucretius\nuses the opening invocation as physicians use honey to entice sick children to drink\nwormwood: \"Physicians, when they wish to treat children with a nasty dose of\nwormwood, first smear the rim of the cup with the sweet yellow fluid of honey\" (1.c936-\n938). Having been lured by poetic craft, the audience attends to Lucretius' explanation of\nhis philosophy.\n\nAs an instructor who employed poetic craft to more effectively educate his\naudience, Lucretius' incorporation of an invocation to deities attests to his skill as both a\npoet and an instructor. However, the invocation reduces the logical and scientific\ncredibility of Lucretius' arguments since divine influence counters the materialistic\naspect of the philosophy being taught. Moreover, Lucretius, digressing from the reason\nand logic characteristic of his method, fails to elaborate upon the function of the gods\nwithin his philosophy and to defend their existence. Thus, Lucretius' success or failure in\nhis amalgamation of the poetic and scientific genres essential to De Rerum Natura\ndepends upon the perspective from which one examines the text. While from a primarily\nscientific standpoint the poetic craft of invoking the gods served to detract from\nLucretius' poem, from a broader perspective of Lucretius serving as scientist, instructor\nand poet, the invocation emphasizes Lucretius' cleverness.\nPrzybylowski - 6"
    },
    {
      "category": "Resource",
      "title": "041122_text.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-704-studies-in-poetry-british-poetry-and-the-sciences-of-the-mind-fall-2004/7b5da388fc3e4cd710de72d496ba305b_041122_text.pdf",
      "content": "An Analysis of Matthew Green's \"The Spleen\"\n\"The Spleen\" was written by Matthew Green as an epistle to Mr. Cuthbert Jackson and,\naccording to A Preface to Eighteenth Century Poetry1, Green did not intend it to be published.\nMatthew Green uses the concept of 'spleen' from Greek humoral medicine - the black bile\nproduced by the spleen was thought to cause melancholy and depression. In \"The Spleen,\" Green\nlists many ways to guard against depression, emphasizing a life of moderation and a balance\nbetween reason and passion, and his argument is further emphasized by the balance between his\norganized rhyme scheme (the 'reason' in his writing) and the casual tone and disorganized nature\nof the poem ('passion').\nThe main purpose of Green's poem is to enumerate measures to prevent the depression\nand despondency caused by spleen. Green's method is comparable to another writer of the time,\nGeorge Cheyne, and both pieces give a series of recommendations on the best way to live a happy\nlife. An example of one of Green's many remedies for depression is shown when he writes, \"To\ncure the mind's wrong bias, spleen, / Some recommend the bowling-green\" (89-90). One\ncomponent of a life of moderation is modest exercise, and thus Green lists this as one of the\nmethods for alleviating melancholy. Green's advice to readers is very similar to that of Cheyne,\nwho writes in The English Malady that \"Such a course of life must necessarily beget an ineptitude\nfor exercise...Persons as live in the manner mention'd, are most subject to such complaints\" (52).\nCheyne states that those who do not exercise are more likely to suffer from what he sees as a\nmajor problem in England: melancholy, depression, and associated illnesses. Green's \"The\nSpleen\" was a new form of scientific poetry, for the focus on the body and ways of staying\nhealthy had rarely been addressed in poetry before. Also, both \"The Spleen\" and The English\nMalady look at socio-cultural causes of disease, an idea that was most likely groundbreaking in\neighteenth century medicine. \"The Spleen\" presents ideas on how to cure melancholy, an attribute\n1 A Preface to Eighteenth Century Poetry, James Sutherland, Clarendon Press Oxford, 1948.\nProctor - 1\n\nviewed by both Green and Cheyne as detrimental to a happy and productive existence. Green\nsuggests with his list of cures to spleen that a modest, temperate life is the best way to guard\nagainst the pitfalls and provocations of melancholy.\nGreen uses figurative language near the end of \"The Spleen\" to illustrate his belief in\nreason's ability to restrain passion, and this balance is seen as a key way to maintain control over\nlife. Green likens feelings of passion to melancholy and thus maintains that it is necessary for\nreason to mediate and stand above human passion. Green writes, \"At helm I make my reason sit, /\nMy crew of passions all submit\" (816-817). The metaphor compares the author directing his life\nto the directing of a ship, advising the faculties of reason to take the central command. The poet\ngoes further when he warns \"Tho' pleased to see the dolphins play, / I mind my compass and my\nway\" (826-827). The pleasure associated with some forms of passion (such as enjoyment from\nobserving natural scenes) can have some benefit but should not distract an individual from the\ncourse at hand. Instead of allowing himself to get lost in the realm of imagination, Green wishes\nto use reason to navigate a course through nebulous and ill-defined ideas.\nGreen uses the rhyme scheme, rhythm, and meter of \"The Spleen\" to further advance his\nargument that reason protects an individual from melancholy. Other poets of the early eighteenth\ncentury also use these devices to make their poetry more appealing to the reader and allow for a\nbetter ordered piece. For example, Alexander Pope, uses rhyming couplets to successfully\nillustrate his ideas on reason in An Essay on Man. Pope writes \"Say first, of God above, or man\nbelow, / What can we reason, but from what we know\" (1.17-18). Pope uses concise, witty lines\nto convey his grand idea of the limit of reason and human understanding, and his writing puts a\nlarge emphasis on the appearance of order. Green's \"The Spleen\" is also comprised of rhyming\ncouplets and, though they have neither the breadth nor the clarity of Pope's couplets, they do\nallow for a memorable closed verse form and lend themselves well to Green's flashes of wit. For\nexample, Green writes that some recommend \"hilly walks; all exercise; / Fling but a stone, the\ngiant dies\" (91-92). Green is conveying a simple point, yet he does it in a neat and fashionable\nProctor - 2\n\nway. Even the small exercise of throwing a stone will defeat the melancholy of the spleen,\nlikening the image to that of David and Goliath. The rhythm and meter of \"The Spleen\" is iambic\ntetrameter, another device used to enhance the clarity of the argument and help the reader to\nfollow along. Iambic rhythm best follows the patterns of natural speech and the shorter lines of\nthe tetrameter help to keep the tone light. Perhaps by using stylistic characteristics that emphasize\nthe rationality and lucidity of the argument, Green hopes to stress his idea of the importance of\nreason. The rhyme structure, rhythm, and metrical form of \"The Spleen\" give clarity to Green's\nwriting and represent the \"reason\" in his poem.\nThough the rhyming scheme and other elements of style add a sense of order to Green's\nwriting, the poet moderates this through the overall form and tone of \"The Spleen\". The\ndisorganized train of ideas and the self-conscious casualness of Green's writing serve to\nunderscore his idea of moderation in all realms: he balances what he considers to be his words of\nreason with his flighty manner of writing. In the first ten lines of \"The Spleen\", Green writes:\nThis motly piece to you I send,\nWho always were a faithful friend,\nWho, if disputes should happen hence,\nCan best explain the author's sense,\nAnd, anxious for the publick weal,\nDo, what I sing, so often feel.\nThe want of method pray excuse,\nAllowing for a vapour'd Muse;\nNor, to a narrow path confin'd,\nHedge in by rules a roving mind.\nAs evidenced by the first two lines of \"The Spleen\", Green initially sent the piece to a friend\ninstead of publishing it for a wide audience, and this may partially explain the informal tone of\nthe poem. The use of the word \"motly\" (an older version of the word \"motley\") implies that\nGreen recognizes his poem as being discordant and disorganized in style. Green apologizes for\nhis manner of writing by saying, \"The want of method pray excuse, / Allowing for a vapour'd\nMuse\" (7-8). Green confesses that \"The Spleen\" is unorganized and rambling in structure, listing\nProctor - 3\n\nways to live the contemplative life yet interspersed with side thoughts and tangents. Green argues\nfor his associative manner of writing in the lines: \"Nor, to a narrow path confin'd, / Hedge in by\nrules a roving mind\" (9-10). Instead of following a strictly ordered layout, Green's poem is more\na random walk of ideas, unconfined by any structure or logical ordering. Green does not intend to\nwrite a strict scientific analysis of the problem of melancholy, as evidenced by his lines, \"First\nknow, my friend, I do not mean / To write a treatise on the spleen\" (33-34). Instead, Green\nassumes that readers wish to know \"how I do myself demean / In stormy world to live serene\"\n(41-42). Green does not intend \"The Spleen\" to be a strict scientific analysis of the problem of\nmelancholy but a loose description of how he himself lives and guards against spleen. Green's\napology for his \"want of method\" at the beginning of \"The Spleen\" differs from the work of\nPope, who in An Essay on Man placed a section describing the scientific design and arguments of\nhis piece before the presentation of his poetry. Pope makes a point of laying out all of his\narguments in a coherent, organized fashion, thus emphasizing the use of reason as a tool to aid\nunderstanding and help readers to follow his progression of ideas. The difference between Pope\nand Green's structure of argumentation is evident: the style of writing in \"The Spleen\" is more\nbased on \"passion\" and the whims of the poet than the formal, ordered structure of Pope's work.\nThe structure and style of argumentation in \"The Spleen\" counteracts the order imposed by the\nrhyme scheme, demonstrating Green's belief that a balance of passion and reason is beneficial\nboth in life and in writing.\nIn \"The Spleen\", Green suggests that a moderate, balanced life--a life not overwhelmed\nby either reason or passion--is the cure for the illness of melancholy. Green conveys this idea\nboth thematically and through the structure of his poem, for the contrast of Green's organized\nrhyme scheme with his casual, unorganized flow of ideas exemplifies the balance of reason and\npassion that he recommends for life.\nProctor - 4"
    }
  ]
}