{
  "course_name": "Studies in Drama: Stoppard and Company",
  "course_description": "Taking as its starting point the works of one of Britain’s most respected, prolific—and funny—living dramatists, this seminar will explore a wide range of knowledge in fields such as math, philosophy, politics, history and art. The careful reading and discussion of plays by (Sir) Tom Stoppard and some of his most compelling contemporaries (including Caryl Churchill, Anna Deveare Smith and Howard Barker) will allow us to time-travel and explore other cultures, and to think about the medium of drama as well as one writer’s work in depth. Some seminar participants will report on earlier plays that influenced these writers, others will research everything from Lord Byron’s poetry to the bridges of Konigsberg, from Dadaism to Charter 77. Employing a variety of critical approaches (both theoretical and theatrical), we will consider what postmodernity means, as applied to these plays. In the process, we will analyze how drama connects with both the culture it represents and that which it addresses in performance. We will also explore the wit and verbal energy of these contemporary dramatists…not to mention, how Fermat’s theorem, classical translation, and chaos theory become the stuff of stage comedy.",
  "topics": [
    "Fine Arts",
    "Performance Arts",
    "Theater",
    "Humanities",
    "Literature",
    "Criticism",
    "Drama",
    "Fine Arts",
    "Performance Arts",
    "Theater",
    "Humanities",
    "Literature",
    "Criticism",
    "Drama"
  ],
  "syllabus_content": "Course Meeting Times\n\nSessions: 2 sessions / week, 1.5 hours / session\n\nCourse Description\n\nTaking as its starting point the works of one of Britain's most respected, prolific--and funny--living dramatists, this seminar will explore a wide range of knowledge in fields such as math, philosophy, politics, history and art. The careful reading and discussion of plays by (Sir) Tom Stoppard and some of his most compelling contemporaries (including Caryl Churchill, Anna Deveare Smith and Howard Barker) will allow us to time-travel and explore other cultures, and to think about the medium of drama as well as one writer's work in depth. Some seminar participants will report on earlier plays that influenced these writers, others will research everything from Lord Byron's poetry to the bridges of Konigsberg, from Dadaism to Charter 77. Employing a variety of critical approaches (both theoretical and theatrical), we will consider what postmodernity means, as applied to these plays. In the process, we will analyze how drama connects with both the culture it represents and that which it addresses in performance. We will also explore the wit and verbal energy of these contemporary dramatists...not to mention, how Fermat's theorem, classical translation, and chaos theory become the stuff of stage comedy.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nReading, class participation and contribution, including watching films, providing feedback, and other events\n\nReports and class leadership\n\nFocused single-play analysis (5 pages / 1250 words)\n\nSelf-assessments, scene and other writing\n\nMajor analytical essay / project (15 pages)\n\nI reserve the right to alter the weighting somewhat in exceptional circumstances; usually this works to your advantage. If written work is incomplete or attendance is infrequent, you will not pass the course. I will consider each of the requirements in determining your grade. If you cannot be in class or meet a deadline because of an emergency, please speak with me (in advance, if possible); otherwise, absences and late papers will adversely affect your grade. I will expect you to write a one-page response essay on the assigned material on any day you miss class, after week one.\n\nCourse Objectives\n\nIn addition to participating in the fun of reading Tom Stoppard & Co.--and the adventures that any semester brings--I ask you to keep in mind these seven objectives, which connect our specific studies with larger learning goals that can extend into your future lives:\n\nTo provide the tools and nurture your ability to read dramatic texts more pleasurably, fully, and critically. This should encourage you to remain a reader of challenging and amusing material throughout your life.\n\nTo increase your consciousness of philosophical, historical, political, and artistic questions and approaches as distinct yet interrelated, so that you can study issues more effectively and function more sensitively and intelligently in the world.\n\nTo learn more about contemporary British culture, and through a process of rigorous comparison to understand your own culture(s) more precisely as well as how culture and social location contribute to your personal perspective.\n\nTo encourage a clearer understanding of your own personal strengths, passions, and creativity, increasing your self-awareness and the accuracy of your self-analysis, so that you can sustain a realistic sense of confidence and are better positioned to achieve whatever goals you set for yourself.\n\nTo accustom you to the discipline of digesting new material and taking responsibility for communicating it clearly in a collaborative setting. Moreover (and distinctly), to improve and refine your abilities to express and communicate your own ideas, feelings, and arguments effectively and persuasively, so that you can know what you believe and can contribute and lead as a member of a team or community.\n\nTo cultivate your intellectual curiosity and practice the discipline of independent research and writing, formulating appropriate questions and synthesizing credible information so that you can make a contribution to current knowledge.\n\nTo consider how the arts, and in particular theatrical arts, function in the twenty-first century, and how the humanities complement artistic creation, so that you can appreciate both fields of endeavor and become a wiser artistic producer or audience member.\n\nNot all of these goals will be fully realized by all participants, but among them, I hope you recognize at least some of your own personal priorities in taking this seminar. For your initial self-assessment essay, I ask that you consider your own background and learning objectives this semester, and how they mesh (or not) with those stated above.\n\nAn Important Note on the Readings\n\nI use the word \"read\" in a variety of ways; we will be practicing a variety of reading methods in this subject. You will be skimming, dipping into, appreciating and thoroughly dissecting written texts. But unless instructed otherwise, I expect you to have read the assigned plays carefully.\n\nIf you find it challenging to read a play carefully, I suggest that you:\n\nRead through the entire play quickly, as if you were an audience member watching it take place before you (i.e., read sequentially and don't worry about every detail or go back over a scene studiously--though try to attend to as many clues and dimensions of the script as you can). Consider the play's sequence and impact.\n\nRe-read slowly and analytically, looking for meanings, patterns, poetry, characterization and themes, and studying the sections that confused you. Consider the play's artistry and ideas, and the moment-by-moment unfolding of the action.\n\nLiterature Faculty Policy on Plagiarism\n\nPlagiarism--the use of another's intellectual work without acknowledgement--is a serious offense. It is the policy of the Literature Faculty that students who plagiarize will receive an F in the subject, and that the instructor will forward the case to the Committee on Discipline. Full acknowledgement for all information obtained from sources outside the classroom must be clearly stated in all written work submitted and in all oral presentations, including images or texts in other media and for materials collected online. All ideas, arguments, and direct phrasings taken from someone else's work must be identified and properly footnoted. Quotations from other sources must be clearly marked as distinct from the student's own work. For further guidance on the proper forms of attribution, consult the style guides available in the\nWriting and Communication Center\n, review the article on\navoiding plagiarism\n, and review\nMIT's online Academic Integrity Handbook\n.\n\nOther Resources and Requests\n\nI will also provide my own stylesheet. In addition, you might find helpful:\n\nMIT Library webpage for the course\n, designed by Mark Szarko.\n\nProctor, Margaret. \"\nStandard Documentation Formats.\n\" University of Toronto Writing Support.\n\nHarris, Robert. \"\nEvaluating Internet Research Sources.\n\"\n\nAnother important point: You cannot participate well if you are asleep, nearly asleep, or woozy with illness or exhaustion. Please take care of yourself--which obviously includes your body as well as your mind.\n\nIn addition to welcoming your participation in class, I encourage you to discuss your ideas and your writing with me during office hours, or at other times convenient for us both.\n\nAnd off we go!",
  "files": [
    {
      "category": "Assignment",
      "title": "21L.703 Spring 2014 Assignments: Annotated Bibliography and Preparation for your Final Essay: Guidelines",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-703-studies-in-drama-stoppard-and-company-spring-2014/d6cc092b771c79bfa5ad73c24114b013_MIT21L_703S14_Annotated.pdf",
      "content": "21L.703 Annotated Bibliography and Preparation for your Final Essay: Guidelines\n\nThis project is intended to introduce you to research work in literary studies and help you\ndevelop your ideas for your major essay and final presentation. The bibliography should be\nconsidered an important stage on the way to your 15-page, thesis-driven analytic essay/project.\nWhen applying for research time or money within academia, or when seeking grants funding for\nprofessional work, one usually needs a brief project proposal or description, supplemented by a\npertinent bibliography. The annotated bibliography is essentially an alphabetical list of\nreferences (primary and secondary), in each case followed by a paragraph summarizing\nthe text in a way that suggests its relevance for your research paper.\nThe scholarly form of the annotated bibliography can be a very useful reference tool (and one to\nwhich UROPs or graduate students often contribute as research assistants). Being adept at\ngiving a concise, accurate synopsis of a complex argument--the basic work involved in creating\nthe bibliography--is also a more generally useful ability.\n\nHow do you begin to write an analytic, research-informed essay?\nHumanities research includes knowing how to look for and find primary and secondary readings\nrelevant to your area of interest; narrowing your interests into a manageable essay topic; and\nbeginning the process of developing your own argument in dialogue with the primary and\nsecondary sources you have identified. The first step in this case is to identify a play or a\nparticular question that will be part of your essay, and pondering.\nIdeally, you would have a broad area of comparative interest (say, the role of poetry, or\ninvention, in two plays; or a structural or performative parallel between two films; or the political\nrelationship between one spin-off and a source text) as well as a sense of which texts you want to\nexplore more deeply. The broad topic and the texts serve as starting points; they mark out\nroughly the terrain of your final paper. Alternatively, you might be the sort of person who works\nbest from particulars--beginning with a scene, comment, or character that captures your\nimagination or frustrates you. For example, you might find yourself wondering why the South\nAmerican and African characters are introduced in the second half of Serious Money, or what it\nmeans for Lady Nijo to be the only non-European character in Top Girls? These sorts of\nquestions can lead in all sorts of productive directions: to issues of regional or racial identity; to\nissues of tone and theatrical genre; to the challenges of making economics or history meaningful\non the modern stage, and so forth. Your research would then focus on one or more of these\nissues. It may also be true that the research or exploration leads you to change gears: you might\ndecide you are interested, say, in how nationality, type characterization, or setting works\ndifferently on stage and page, or in one of Stoppard's plays. That's fine too.\nYou will most likely want to hone your topic through comparison with other related scenes or\nplays, and in that process your teammates are there to help provide suggestions and a sounding\nboard; I can also provide suggestions among the recommended works for reports/research listed\non the syllabus if you want to find a parallel with something we've not read collectively.\nHow do you find Primary and Secondary sources?\nTo help you get started, the Humanities Library staff has constructed a special website for this\n\nsubject: http://libguides.mit.edu/stoppard. There are many more tools out there, but the ones\nlisted should get you going. For secondary work on literary texts, the first place to search (by\nplay, author, title, keyword, or subject) is the MLA database: this will generate a large number of\ncitations of secondary articles and book on the play or topic. Go through them, looking at the\ntitles, and (if necessary) at the brief description of topics covered by the article, deciding which\nones might be relevant, and marking those. For contemporary drama, you may also want to look\nat the Humanities Index, and pay special attention to journals aimed more at the theatrical side of\ndrama (TDR, Theater Journal, etc.).\nIf you find an annotated bibliography in your reading--as you may well do--do NOT simply\n\"lift\" their entries as your annotations: that is plagiarism. Moreover, it won't suffice in helping\nyou to think through your topic. DO use the summaries to see whether you think the cited work\nis \"on topic\" for your research.\n\nAbove all, do not assume that a Google Search or Wikipedia guarantees truth: crowd-sourcing\nmight be great for democracy, but it is not always a route to accurate or up-to-date knowledge!\nMany of the most important, respected scholarly books are not available in digital form, and\nmuch of what is posted online has not been checked by experts for accuracy. YOU are\nresponsible for knowing that the scholarship is reliable and true, so if you aren't an expert\nyourself, take advantage of the scholarly presses and \"peer reviewed\" status of major journals.\nWith that in mind, good places to look online are JSTOR, ITER, and Project Muse. These\ndatabases cover selected years for a selected number of journals. The advantage to these is that\nyou get not just the citation but the articles themselves, which are downloadable in pdf format.\nNevertheless, do not confine yourself to online resources alone.\nSome databases (such as the MLA) will also indicate which works cited are available at MIT.\nThose that are not can be directly requested through Inter-Library Loan (ILL) from the site itself.\nIMMEDIATELY ORDER THOSE THAT YOU NEED, even if you are not planning on reading\nthem right away, since the time lag between ordering and receiving is unpredictable. The ones\navailable at MIT, you get yourself.\nThis leads to the wonders of the actual searchable stacks, \"open stacks\" being one of the joys of\nMIT's libraries that may soon recede if unused--so enjoy them now! You will often see related\ntitles in the aisle near the book you are seeking, ones that might enrich your thinking in\nunanticipated ways. Serendipity as well as deliberate searching can make learning more fun--in\nflesh and paper, not just sitting still at a computer screen but sitting down or reaching up in the\nstacks. Better exercise, too.\nOnce you have begun to locate books or articles, you will find more possible citations in the\nfootnotes and the back of books. Reference librarians can be very helpful if you have trouble\nlocating a source you need.\n\nThen, start reading, taking notes, and thinking as you read. And read and re-read the play(s) you\nwant to write about as well!\nWhat will your Annotated Bibliography for this project look like?\n\nYour task is to identify primary and secondary texts relevant to your project, but also to work as\na team. This means that you will have located and read more texts than you actually describe in\nyour bibliography (the ones you don't find pertinent should be mentioned, too, but a full citation\nis sufficient to take care of them). As you read, decide on which articles, books, or portions of\nbooks are likely to be useful for your or a teammate's research paper. Take notes on these as you\nread (or pass them along to the teammate). And then, after you've read each one, write up a brief\nsummary of its argument or main points in as concise and coherent a manner as you can. Try and\nkeep the description brief---in general, aim for 1/5 page single-spaced (or, ideally, less) per\narticle/chapter. Remember, however, that others should be able, upon reading the summary, to\nhave a clear sense of what the article was about, and have a rough sense of why you chose to\nsummarize it. When summarizing books, focus only on those parts of the whole text that are of\nrelevance to your topic.\n\nWith primary texts, in addition to the brief summary of the relevant sections or an overview of\nthe relevant parts, you probably want to excerpt a couple of quotations that you may use in your\nfinal paper. (In general, as you read, it is a good idea to maintain a file where you simply enter\nquotations from secondary and primary texts that you may use in the research essay, with the\npage number or act/scene number included. This will save you a lot of time in the long run.)\n\nA single document should be submitted by the team, and it should include at least 15 annotated\ncitations. Not all of you will find the same number of useful sources, and some may wish to\ninclude more annotations. However, each of you should contribute three of the annotations, and\nthose you write should be followed by your initials, in parentheses (DH in my case). You should\nshare your learning with the group so that all of you feel you know about all the works cited on\nyour group bibliography. If you read something that confuses you but seems important, you\nmight want to have another group member read it as well. But each of you should locate and\nannotate at least three works of scholarship or criticism.\n\nMerge and alphabetize all your entries, and give full citations using the MLA or Chicago Manual\nof Style. Proofread the document, and make sure your entire group feels included and\ncomfortable with the final product.\n\nNow, get going and have fun!\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.703 Studies in Drama: Stoppard and Company\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "21L.703 Spring 2014 Assignments: Arcadia discussion questions",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-703-studies-in-drama-stoppard-and-company-spring-2014/93842454c0b7da3933000f01056a444e_MIT21L_703S14_Arcadia.pdf",
      "content": "Arcadia\nTopics for discussion\n\n1. There are two narratives contained within Arcadia, which overlap in space but not\nin time. What is the function of having these two stories contained within the\nsame play? Does it make the play seem disconnected? If not, how does Stoppard\ntie the two halves together?\n\n2. At the end of the play, the two time periods are superimposed, running together -\nsimultaneous yet independent. Why might Stoppard have chosen to do this, and\nwhat is the effect upon the viewer?\n\n3. What parallels or ties are there between the characters of one time period and\nthose of the other? How is the split cast bound into one?\n\n4. Does Arcadia demonstrate more realism than other Stoppard we have read? Can\none identify with characters in Arcadia more than in, say, R&G? If so, why?\n\n5. R&G was based on Hamlet, Travesties on Ernest, The Real Inspector Hound on\ndetective dramas, and Hapgood on spy thrillers. Is Arcadia based on any other\nwork or generic form?\n\n6. What is the importance to Arcadia of the scientific ideas of entropy and\nrecursion? Why are they in there?\n\n7. More generally, Stoppard seems very interested in bringing sophisticated\nscientific ideas into his plays - Arcadia (entropy and recursion), Hapgood\n(particle/wave duality), even R&G (probability theory) - and to a greater extent in\nthe R&G movie. Why? How successful/clear are the science references to (i) a\nscientific audience, or (ii) a lay audience?\n\n8. Arcadia is seen by many to be Tom Stoppard's finest play. Based on just what\nwe have read so far, do you agree or disagree. What do you (dis)like most about\nArcadia?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.703 Studies in Drama: Stoppard and Company\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "21L.703 Spring 2014 Assignments: Discussion questions for Rosencrantz and Guildenstern Are Dead",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-703-studies-in-drama-stoppard-and-company-spring-2014/8b318730588f9696c246d0df2a5859dd_MIT21L_703S14_R_G_dis_ques.pdf",
      "content": "21L703: Studies in Drama: Stoppard & Company\nDiscussion questions for Rosencrantz and Guildenstern Are Dead\n\n1) What's in a name--beginning with the title of this play?\n\n2) Some theater critics consider Rosencrantz and Guildenstern to be modern \"types\" rather\nthan fully developed characters. Some even think that the theater audience should be excused\nif, like Gertrude and Hamlet, they can't tell the two apart. Do Stoppard's opening \"character\nnotes\" refute such responses? Does the script that follows? And does it confirm or qualify the\ncharacter notes themselves?\n\n3) Early in his career, Stoppard said he wrote plays of ideas. What ideas are thrown into play\nby the coin toss? How do they shape and connect with the narrative to come?\n\n4) When does the coin finally come up tails, and what do you make of that?\n\n5) The Player says he is always on. Is he, and what does that mean? What vision of the\ntheater do we get from the tragedians, and how does it connect with or reflect upon the play\nwe are watching? What do you make of R&G as audience members?\n\n6) What is the first scene from Hamlet that we see? What do you make of this choice?\n\n7) Stoppard said just a little knowledge of Hamlet would suffice for an R&G audience. How\nmuch knowledge of Hamlet (if any) does this play require for it to \"work\"? Taking it a step\nfurther, how does your thoughtful contemplation of Hamlet affect your experience of this\nplay--and vice-versa?\n\n8) After R & G's scene with Claudius and Gertrude--that is, after they have been \"placed\"\nback in the play Hamlet--what upsets them? Is this the response you expected, based on your\nknowledge of Hamlet? Does their subsequent encounter with Hamlet himself alter your\nfeelings about these three characters (of the Shakespearean or Stoppardian variety)?\n\n9) In what sense do R & G have choices? In this, how are they like/unlike other characters?\nHow are they like/unlike human beings?\n\n10) Which do R & G prefer: order or arbitrariness? Which does the play itself present as\nmore fearsome?\n\n11) How does the play make connections between its fiction and the audience?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.703 Studies in Drama: Stoppard and Company\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "21L.703 Spring 2014 Assignments: Discussion Questions for the video, Rosencrantz & Guildenstern Are Dead",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-703-studies-in-drama-stoppard-and-company-spring-2014/5b9224eaf9afe8d19f229989a1e42f6e_MIT21L_703S14_R_G_film_disc.pdf",
      "content": "Rosencrantz & Guildenstern Are Dead\nFilm Discussion Questions\n1. What do you make of the opening credits? As the play opens in a place \"without visible\ncharacter,\" the film begins with credits on a black screen. However, the film introduces \"audible\ncharacter\" in the form of a western-themed soundtrack. How does this contrast with your\nexpectation of \"two Elizabethans\"?\n2. Unlike a play, film can cut from scene to scene instantaneously. It can completely change the\nsetting and mise-en-scene without limitation. Does the film take advantage of this fact, or does it\ntry to respect the story's original medium by forcing characters around in circles so that that they\nrepeatedly end up in the same room of the castle?\n3. How are sound effects used in the film? Extradiegetic chimes are added at crucial moments -\nfirst after Guildenstern brings up the question of suspense, then again when the coin is finally\ntails. The film inserts dramatic echoes to some of Guildenstern's most excited moments that\nmomentarily halt the flow of dialogue and narrative. Ambient animal noises can be heard\nthroughout the film and are at one point revealed to be coming from Rosencrantz. Do these\nelements add anything to the narrative other than perhaps to emphasize moments of significance\nto the less sophisticated audience of cinema?\n4. As discussed in Thursday's class, two individuals on a stage or screen are far more\ndistinguishable from one another than words on a page. It was mentioned that being able to\nvisually tell them apart would make it easier to tell which character was which. After watching\nthe film, was it clear who was Rosencrantz and who was Guildenstern? Or did the fact that you\ncould differentiate them as Gary Oldman and Tim Roth (or the long-haired one and short-haired\none) eliminate the necessity of thinking of each one specifically as Rosencrantz or Guildenstern?\n5. What were the effects of having the question game played on an actual tennis court?\n6. What is the significance of wind in the film? Hamlet is said to be \"at the mercy of the\nelements,\" but Rosencrantz and Guildenstern are also plagued by their quest to find out the\ndirection of the wind. As an example, the windmill toy spins after Rosencrantz insists that \"there\nisn't any wind.\"\n7. Let's discuss the puppet show. The tragedians use puppets in addition to live action to enact\nthe deaths from Hamlet. Why does the film version include this story-telling mode when the\noriginal play does not? Is it simply a way to visually emphasize the complex literary layers of\nRosencrantz and Guildenstern are Dead?\n8. The film ends with the Tragedians driving away in their caravan. What is the effect of ending\nwith life rather than ending on a stage filled with death (as both Hamlet and the play of R&G\ndo)?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.703 Studies in Drama: Stoppard and Company\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "21L.703 Spring 2014 Assignments: Hapgood discussion questions",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-703-studies-in-drama-stoppard-and-company-spring-2014/09703409158834baa3bba6a3633dce07_MIT21L_703S14_hapgood.pdf",
      "content": "Discussion questions for Hapgood, Tom Stoppard\n\n1. Before the play starts, Stoppard quotes:\nWe choose to examine a phenomenon which is impossible, absolutely\nimpossible, to explain in any classical way, and which has in it the heart of\nquantum mechanics. In reality it contains only mystery. . . Any other situation\nin quantum mechanics, it turns out, can always be explained by saying, 'You\nremember the case of the experiment with two holes? It's the same thing.'\nRichard P. Feynman\n'Lectures on Physics'/'The Character of Physical Law'\nHow does this quote apply to the play? What is the experiment with two holes?\n\n2. Why is everyone calling her \"Mother\"? What is the intention of this?\n\n3. Why is the \"men\" sign on the door reversed? And later put back straight at the\nend?\n\n4. At the beginning of Scene 2, the stage direction it says:\nKERNER has been brought by RIDLEY to the zoo. BLAIR, having checked the\ntime on his watch, nods at RIDLEY to dismiss him.\nRIDLEY moves out.\nPerhaps we are looking at BLAIR and KERNER through the bars of a cage.\nThere could be a bench, there could be paper cups of coffee . . . The bars\nmake hard-edged shadows. We need one particular and distinct demarcation\nof light and shadow on the floor, perhaps thrown by the edge of a wall.\nIn Scene 3, Act 2, BLAIR and KERNER meet at the zoo, again. Why the zoo? And what\nis the possible intention of this staging?\n\n5. What kind of character is little Joe?\n\n6. In scene 5, Act 1, we see that Hapgood and Ridley are each others alibi. They\n\"betray\" each other for their own goals. At the end of scene 5 of Act 2, Hapgood tells\nhim to open the box. The scene ends with a kiss. What is the relationship between\nthe two?\n\n7. In scene 5, Act 1, between the conversation between Hapgood and Kerner (p.47),\nKerner describes about a spy novel that he wants to write one day. He also says that\nthey surprise him all in the same way. Which category does this play fall into? We\nknow from the start that there are two Ridleys. Did this ruin the fun?\n\n8. In the same scene, Kerner also makes a speech about Einstein and God (p.49-50).\nWhat is your opinion about this and do you think this is Stoppard's view point?\n\n9. In the 'inter-scene' between scene 1 and scene2 of Act 2, Ridley becomes a\ndifferent Ridley, and the stage direction says, \"It's like a quantum jump.\" What\nwould a 'quantum jump change' look like?\n\n10. In page 71-72 (scene 3, act 2), Kerner has a long monologue about him being the\n'minus' man. Why do you think he is chosen to be a minus man? In the same\ndialogue, he says, \"We're all doubles.\" What is the dual personality of Kerner? Of\nother characters? And what is similar/different from the characters in Travesties in\nthis context?\n\n11. Hapgood has three names: Elizabeth/Lilya Hapgood and Betty Newton. What do\nthey possibly mean?\n\n12. On her way out of scene 4 in act 2, Hapgood says \"Queen to king one.\" Was there\nany other clear statement that allowed the reader to know that she is acting as a\ndouble?\n\n13. At the end of scene 6, act 2, Hapgood says, \"Who? Us and the KGB? The\nopposition! We're just keeping each other in business, we should send each other\nChristmas cards - oh, f-f-fuck it, Paul!\" Like she mentioned, what do you think about\nthe relationship of the spy game, Russia versus the Western Europe, and maybe\neven how the Russian revolution was dealt in Travesties? What is the politics in this\nplay?\n\n14. There seems to be a point when Hapgood changes or collapses. When do you\nthink is the prime(haha) moment and what was the trigger?\n\n15. In the play, there are many physics laws that were explained by Kerner:\nHeisenberg's uncertainty principle, the topological problem of the Seven Bridges of\nKonigsbergs, anti-matter/matter, double slit experiment, and wave-partical duality.\nWas his description easy to follow/do you agree with his way of its application to\nhuman behavior? Furthermore, what is the significance/intention/effect of using\nthese principles?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.703 Studies in Drama: Stoppard and Company\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "21L.703 Spring 2014 Assignments: Rock 'n' Roll discussion questions",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-703-studies-in-drama-stoppard-and-company-spring-2014/19d27da10c13d45eccba678f1b6b75c2_MIT21L_703S14_Rock_n_Roll.pdf",
      "content": "Rock 'n' Roll, Tom Stoppard, Questions:\n\nHow do you illustrate a lecture...with rock 'n' roll?\n1. In the introduction to Rock 'n' Roll, we learn that Jan was originally (in the first draft) given the\nauthor's name: Tomas. What importance does this detail have about Stoppard and/or the play\nwe are reading?\n\n2. After the list of characters is given, we get the direction: Esme in Act One and Alice are to be\nplayed by the same actress; similarly Eleanor and Esme in Act Two; reading further: The\nintention is that the 20 characters may be played by a company of 12. Why would there be a\ndirection about a doubling of these 4 characters (and more characters, depending on the\ndirector's choice). What would the doubling(s)/tripling(s) bring to the play? If you were a\ndirector, what other characters would you decide to \"double/triple\" and why?\n\n3. What is the role of the music/songs at the begging or endings of an act?\n\n4. Seeing that the play both opens and closes with Jan and Esme, I wanted to focus a bit on these\ntwo characters. What is their role in the play (as single characters, or in relation to each other)?\nHow does their \"growing\" (both in age and as characters) relate to the entire play?\n\n5. How does the concept of a cultural revolution relate to that of a political/historical revolution in\nthe play? (Maybe analyze the character of Max a bit?)\n\n6. How are the ideas of freedom, rights, and rock 'n' roll treated in the play? Is there any relation\nbetween them?\n(Close reading pg 17-19, 22-23, 29-30, 32-36) What is the difference btw the first and second\npetition? Why would it be necessary (according to Jan) to defend those indifferent to the\nsociety?\n\n7. (Maybe part of question 6?) Why Rock 'n' Roll was considered \"dangerous\" for the time and\nplace the play is set in?\n\n8. Jan returns home to see his records smashed to pieces. Is there a reason this scene closes act 1?\nWhat might be the meaning/significance of this scene?\n\n9. Pg 69: John Lennon Wall. Can we make a parallel to The Berlin Wall?\n\n10. Can we see Max, Ferdinand and Jan as representing 3 different intellectual views present at the\ntime in Czechoslovakia?\n\n11. Can we see more than a friendly meeting of most of the characters toward the end of act 2?\n\n12. Close reading 93-95: What does the last confrontation between Jan and Max add to the play,\nand our reading?\n\n13. The play is titled Rock 'n' Roll, but it is neither a history of rock 'n' roll, neither is it entirely about\nrock 'n' roll. What were your expectations about the play before reading it , and how do they\ncompare to what you got after reading the play? What would you say Rock 'n' Roll is really\nabout?\n\nHey, Ferdo, it's only rock 'n' roll.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.703 Studies in Drama: Stoppard and Company\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "21L.703 Spring 2014 Assignments: Sample assignment for Rosencrantz & Guildenstern Are Dead",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-703-studies-in-drama-stoppard-and-company-spring-2014/10e556f1755e30df28fc7aeb556ff301_MIT21L_703S14_RnG_Roe.pdf",
      "content": "Waiting for Godot in Relation to Rosencrantz and Guildenstern Are Dead\nThe plot of Samuel Beckett's Waiting for Godot is simple to relate. Two tramps are waiting by a sickly\nlooking tree for the arrival of M. Godot. They quarrel, make up, contemplate suicide, try to sleep, eat a\ncarrot and gnaw on some chicken bones. Two other characters appear, a master and a slave, who\nperform a grotesque scene in the middle of the play. A young boy arrives to say that M. Godot will not\ncome today, but that he will come tomorrow. The play is a development of the title, Waiting for Godot.\nHe does not come and the two tramps resume their vigil by the tree, which between the first and second\nday has sprouted a few leaves, the only symbol of a possible order in a thoroughly alienated world.\n(Fowlie 210)\nCommon themes found in Waiting for Godot and Rosencrantz and Guildenstern Are Dead, together with quotes\nand examples from both plays.\nDeath\nBoth plays include death as a central theme. The awareness of mortality, both by the characters and by the\naudience, pervades both plays.\nIn Rosencrantz and Guildenstern Are Dead, the\nIn Waiting for Godot, death is somewhat less\naudience knows from the very title of the play and\nubiquitous, but still present. The coming of Godot,\nfrom previous knowledge of Hamlet that the\nor God, can be taken as a metaphor for death, and\nprotagonists will die. This dramatic irony and their\nVladimir and Estragon consider suicide a number of\nprogression toward their death at the end of the play\ntimes, and seem so hopeless and aimless that it\nprovide a context for both characters' musings on\nseems that only death can end their suffering.\nthe nature of death.\n\"ESTRAGON: Abused who?\n\"I mean one thinks of it like being alive in a box,\nVLADIMIR: The Saviour.\none keeps forgetting to take into account the fact\nESTRAGON: Why?\nthat one is dead...... Life in a box is better than no\nVLADIMIR: Because he wouldn't save them.\nlife at all. I expect.... Whatever became of the\nESTRAGON: From hell?\nmoment when one first knew about death?\"\nVLADIMIR: Imbecile! From death\" (Beckett).\n(Stoppard 70-71).\n\"ESTRAGON: What about hanging ourselves?\n\"We aim at the point where everyone who is\nVLADIMIR: Hmm. It'd give us an erection.\nmarked for death dies\" (79).\nESTRAGON: (highly excited). An erection!\"\n\"No, no, no... you've got it all wrong... you can't\n(Beckett).\nact death. The fact of it is nothing to do with seeing\n\"ESTRAGON: The best thing would be to kill me,\nIt happen -- it's not gasps and blood and falling\nlike the other.\nabout -- that isn't what makes it death. It's just a\nVLADIMIR: What other? (Pause.) What other?\nman failing to reappear, that's all -- now you see\nESTRAGON: Like billions of others.\nhim, now you don't, that's the only thing that's real:\nVLADIMIR: (sententious). To every man his little\nhere one minute and gone the next and never\ncross. (He sighs.) Till he dies. (Afterthought.)\ncoming back -- an exit, unobtrusive and\nAnd is forgotten\" (Beckett).\nunannounced, a disappearance gathering weight as\n\"ESTRAGON: All the dead voices.\nit goes on, until, finally, it is heavy with death\" (84).\nVLADIMIR: They make a noise like wings.\n\"And then again, what is so terrible about death?\nESTRAGON: Like leaves.\nAs Socrates so philosophically put it, since we don't\nVLADIMIR: Like sand.\nknow what death is, it is illogical to fear it. It might\n...\nbe...very nice\" (110).\nVLADIMIR: To have lived is not enough for them.\n\"I'm talking about death -- and you've never\nESTRAGON: They have to talk about it.\nexperienced that. And you cannot act it. You die a\nVLADIMIR: To be dead is not enough for them.\nthousand casual deaths -- with none of that intensity\nESTRAGON: It is not sufficient\" (Beckett).\n\nwhich squeezes out life...and no blood runs cold\nanywhere. Because even as you die you know that\nyou will come back in a different hat. But no one\ngets up after death -- there is no applause -- there is\nonly silence and some second-hand clothes, and\nthat's -- death\" (123).\n\"VLADIMIR: I'm afraid he's dying.\nESTRAGON: It'd be amusing\" (Beckett).\nReligion\nGiving the emphasis on death, religion naturally enters both plays to some extent.\nRosencrantz and Guildenstern banter about religion\nto a small extent, but don't dwell on the topic as\nmuch as Vladimir and Estragon.\n\"What in God's name is going on?\" (Stoppard 42).\n\"Is there a God?\" (43).\n\"Immortality is all I seek\" (45).\nChoice\nA number of religious metaphors pop out of\nWaiting for Godot. First of all, the title can be\ntaken as \"Waiting for God.\" Vladimir and Estragon\ncan be viewed as the two thieves that hung with\nJesus. Lucky has a nonsensical monologue, the\nlongest of the play, which includes a lot of religious\nreferences: \"a personal God... the heights of divine\napathia... blast hell to heaven so blue\" (Beckett).\nFinally, Estragon calls Pozzo \"Cain\" and \"Abel\"\n(Beckett) after forgetting Pozzo's name.\n\"VLADIMIR: Did you ever read the Bible?\n...\nVLADIMIR: Two thieves, crucified at the same\ntime as our Saviour\" (Beckett).\n\"ESTRAGON: Do you think God sees me?\nVLADIMIR: You must close your eyes.\nESTRAGON: God have pity on me!\" (Beckett).\nBoth plays represent characters as without choice. Their fate is set and each action determined by the previous.\nRosencrantz and Guildenstern try repeatedly to\nbreak out of their destiny, to go home, to deny that\nthey must follow a course determined in Hamlet.\n\"We have no control. None at all\" (Stoppard 71).\n\"Wheels have been set in motion, and they have\ntheir own pace, to which we are...condemned.\nEach move is dictated by the previous one -- that is\nthe meaning of order\" (60).\n\"GUILDENSTERN: Who decides?\nPLAYER: Decides? It is written\" (80).\n\"We're tragedians, you see. We follow directions.\nThere is no choice involved\" (80).\n\"There must have been a moment, at the beginning,\nwhere we could have said -- no. But somehow we\nmissed it\" (125).\n\"I want to go home\" (37), but they never do.\nIn Waiting for Godot, Vladimir and Estragon try\nover and over to leave. Yet they never do. Like\nGuildenstern, at the end of the play, they wonder\nwhether there was ever a chance for it to be\notherwise. The first line of the play, in fact is:\n\"ESTRAGON: Nothing to be done\" (Beckett).\n\"VLADIMIR: We must have thought a little.\nESTRAGON: At the very beginning\" (Beckett).\n\"ESTRAGON: Let's go.\nVLADIMIR: We can't.\nESTRAGON: Why not?\nVLADIMIR: We're waiting for Godot.\nESTRAGON: Ah!\" (Beckett).\n\"VLADIMIR: Let's go!\nPOZZO: I hope I'm not driving you away. Wait a\nlittle longer, you'll never regret it.\nESTRAGON: We're in no hurry\" (Beckett).\nDirection\nIn both plays, characters seem to have lost their sense of direction.\n\"Which way did we come in? I've lost my sense of\n\"POZZO: Is it evening?\ndirection\" (Stoppard 39).\nESTRAGON: It's rising.\n\"ROSENCRANTZ: Is that southerly?\nVLADIMIR: Impossible.\n\n...\nESTRAGON: Perhaps it's the dawn.\nGUILDENSTERN: In the morning the sun would\nVLADIMIR: Don't be a fool. It's the west over\nbe easterly. I think we can assume that\" (58).\nthere.\nESTRAGON: How do you know?\" (Beckett).\nRepetition\nBoth plays use repetition to a greater extent than most other plays.\nIn Rosencrantz and Guildenstern Are Dead, the\nMuch more so than Rosencrantz and Guildenstern\nquestion game occurs repetitively. Rosencrantz and\nAre Dead, Waiting for Godot is about repetition.\nGuildenstern are confused for each other over and\nThe characters wait in a place without change,\nover again. There are a number of phrases which\nwhere everything repeats. Even the second act is\nappear throughout the play, such as \"Give us this\nessentially a repetition of the first. Vladimir and\nday our daily mask\" (39) / \"round\" (93) / \"cue\"\nEstragon repeat phrases and exchanges throughout\n(102) and \"call us this day our daily tune\" (114).\nthe play, such as the suggestion to leave, and\n\"nothing to be done\" (Beckett).\nGames\nIn both plays, the protagonists use games to pass the time while they wait, indecisive.\nIn Rosencrantz and Guildenstern Are Dead, the\nIn Waiting for Godot, Vladimir and Estragon's\nquestion game, reminiscent of a tennis match\nverbal banter seems almost a game at times:\noccupies the protagonists as they wait for Hamlet's\nsomething to occupy them. In addition, echoing the\nattention. The play even starts with a game: the\nquestion game in Rosencrantz and Guildenstern Are\nflipping of a coin.\nDead, much is made of Vladimir and Estragon\nasking Pozzo a question, to the point of making it\ninto a game.\n\"VLADIMIR: Will you not play?\nESTRAGON: Play at what?\nVLADIMIR: We could play at Pozzo and Lucky\"\n(Beckett).\n\"LUCKY: sports such as tennis football running\ncycling swimming flying floating riding gliding\nconating camogie skating tennis of all kinds\ndying flying sports of all sorts\" (Beckett).\nMemory\nIn both plays, the protagonists seem to have either faulty memory or none at all.\n\"Do you remember the first thing that happened\n\"ESTRAGON: I'm unhappy.\ntoday?\" (Stoppard 19).\nVLADIMIR: Not really! Since when?\n\"ROSENCRANTZ: What was the last thing I said\nESTRAGON: I'd forgotten\nbefore we wandered off?\nVLADIMIR: Extraordinary the tricks that memory\nGUILDENSTERN: When was that?\nplays\" (Beckett).\nROSENCRANTZ: I can't remember\" (107).\n\"ESTRAGON: We came here yesterday.\nRight before his death, Rosencrantz claims \"Well,\nVLADIMIR: Ah no, there you're mistaken.\nwe'll know better next time\" (126), the next time\nESTRAGON: What did we do yesterday?\nthe play is performed. But they won't.\nVLADIMIR: What did we do yesterday?\nESTRAGON: Yes.\nVLADIMIR: Why...Nothing is certain when you're\nabout\" (Beckett).\n\"VLADIMIR: What was it you wanted to know?\nESTRAGON: I've forgotten\" (Beckett).\n\"ESTRAGON: That's the way I am. Either I forget\nimmediately or I never forget\" (Beckett).\n\n\"POZZO: I don't remember having met anyone\nyesterday. But tomorrow I won't remember\nhaving met anyone today. So don't count on me\nto enlighten you.\nNatural laws\nIn both plays, natural laws are set aside, and the characters notice.\nRosencrantz and Guildenstern Are Dead begins\nIn Waiting for Godot, time is frozen. It is evening\nwith a coin landing heads at least 89 times. At the\nfor most of each act, and yet the sun does not move\nend of the play, characters go enter one barrel and\nuntil it suddenly becomes night. This frozen time\nemerge from another.\nties in with the universal repetition.\n\"VLADIMIR: Time has stopped\" (Beckett).\n\"VLADIMIR: Time flows again already. The sun\nwill set, the moon rise, and we away...from\nhere\" (Beckett).\n\"POZZO: (suddenly furious.) Have you not done\ntormenting me with your accursed time! It's\nabominable! When! When! One day, is that not\nenough for you, one day he went dumb, one day\nI went blind, one day we'll go deaf, one day we\nwere born, one day we shall die, the same day,\nthe same second, is that not enough for you?\n(Calmer.) They give birth astride of a grave, the\nlight gleams an instant, then it's night once\nmore\" (Beckett).\n\"GUILDENSTERN: Oh he might not come.\nROSENCRANTZ: Oh, he'll come.\nGUILDENSTERN: We'd have some explaining to do.\nROSENCRANTZ: He'll come. Don't worry -- take my word for it -- He's coming!\" (Stoppard 88).\nBibliography and Further Reading\nBeckett, Samuel. Waiting for Godot. 9 Feb. 2004 <http://samuel-beckett.net/Waiting_for_Godot_Part1.html>.\nGlusman. From Beckett to Stoppard: Existentialism, Death, and Absurdity. 9 Feb. 2004\n<http://home.sprintmail.com/~lifeform/beckstop.html>. This essay discusses the development of\nabsurdist theater from Waiting for Godot through Endgame to Rosencrantz and Guildenstern Are Dead.\nJohnston, Ian. LBST 402: Lecture on Stoppard, Rosencrantz and Guildenstern Are Dead. Malaspina University-\nCollege. 9 Feb. 2004 <\n>.\nStoppard, Tom. Rosencrantz and Guildenstern Are Dead. New York: Grove Press, 1967.\nWaiting for Godot. 9 Feb. 2004 <\n> citing Fowlie, Wallace. Dionysus in Paris. New York: Meridian, 1960. p. 210-214.\nhttps://web.archive.org/web/20060903054616/http://www.malaspina.edu/~johnstoi/introser/\nstoppard.htm\nThe \"Theater of the Absurd\" section includes history of Absurdist Theater and some of the connections\nbetween Rosencrantz and Guildenstern Are Dead and Waiting for Godot.\nhttps://web.archive.org/web/20011118181037/http://www.theatrehistory.com/\nfrench/beckett002.html.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.703 Studies in Drama: Stoppard and Company\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "21L.703 Spring 2014 Assignments: Serious Money discussion questions",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-703-studies-in-drama-stoppard-and-company-spring-2014/32b62d4b9e18992baf41c069ba255718_MIT21L_703S14_Serious_Mon.pdf",
      "content": "Serious Money Questions\n\nBut first, some background:\n\nThe Big Bang\n(From Wikipedia)\n\nThe phrase Big Bang, used in reference to the sudden deregulation of financial markets, was\ncoined to describe measures, including abolition of fixed commission charges and of the distinction\nbetween stockjobbers and stockbrokers on the London Stock Exchange and change from open-outcry to\nelectronic, screen-based trading, enacted by the United Kingdom government in 1986. The day the\nLondon Stock Exchange's rules changed, 27 October 1986, was dubbed the \"Big Bang\" because of the\nincrease in market activity expected from an aggregation of measures designed to precipitate a complete\nalteration in the structure of the market.\nIn the UK, Big Bang became one of the cornerstones of the Thatcher government's reform\nprogram. Prior to these reforms, the once-dominant financial institutions of the City of London were\nfailing to compete with foreign banking. While London was still a global centre of finance, it had been\nsurpassed by New York, and was in danger of falling still further behind. Thatcher's government claimed\nthat the two problems behind the decline of London banking were overregulation and the dominance of\nelitist old boy networks and that the solution lay in the free market doctrines of unfettered competition\nand meritocracy.\n\nStockjobbers\n(From Wikipedia)\n\nStockjobbers were institutions that acted as market makers in the London Stock Exchange. Prior\nto \"Big Bang\" in 1986, every stock traded on the Exchange passed through a jobber's book, where they\nacted as intermediaries between stockbrokers, who were in turn not permitted to be market makers.\nImmediately prior to the Big Bang, the leading jobbing firms were Akroyd & Smithers, Wedd Durlacher,\nPinchin Denny, Smith Brothers, Bisgood Bishop and Charles Pulley.\n\nThomas Shadwell and The Volunteers\n(From Wikipedia and paraphrased from \"Thomas Shadwell: His Life and Comedies\" by Albert Stephens\nBorgman)\n\nThomas Shadwell was a 17th century English poet and playwright who was appointed poet\nlaureate in 1689. His play The Volunteers, or the Stockjobbers was published posthumously in 1693.\n\nThe plot is as follows: Major-General Blunt (old Royalist solider) has two daughters, the affected\nTeresia and the sensible Eugenia. Teresia is wooed by Sir Nicholas Dainty (a fop); Eugenia is loved by\nyoung Colonel Hackwell. Colonel Hackwell Senior is browbeaten by his second wife, who is having an\naffair with Nickum. Her daughter, Winifred, is sought by Sir Timothy Kastril and Hackwell's daughter,\nClara, by the volunteer Welford. Clara and the younger Hackwell are ordered from their house by their\ngreedy step-mother. Angered by this, the maid, Lettice, attempts to convince Hackwell Sr. of his wife's\ninfidelity. When Nickum and his wife are caught, she feigns a fainting fit which she blames on\nHackwell's son's solicitations. Eventually (as this is a comedy) the wife is found out, Hackwell Sr.\nwelcomes back his son and daughter. Winifred spurns Sir Timothy for Hop, a dancer; Clara marries\nWelford; Eugenia weds young Hackwell; Teresia wins Sir Nicholas.\n\nShadwell represents the Cromwellian colonel, Hackwell, as interested primarily in turning a\npenny through stock-jobbing. The colonel's remarks when the subject on the subject do not present it in\nthe best light. After his wife says that a \"Patent... for one's walking under water... wou'd have been of\n\ngreat use to carry messages under the ice this last frost before it wou'd bear,\" Hackwell replies: \"it's no\nmatter whether it turns to use or not; the main end, verily, is to turn the penny in the way of stock-\njobbing, that's all.\" When the jobber questions whether a patent be lawful, Hackwell reassures him:\n\"Look thee, brother, if it be to a good end, and that we ourselves have no share in the vanity or the wicked\ndiversion thereof, by beholding of it, but only use it whereby we may turn the penny, and employ it for\nedification, always considered that it is like to take, and the said shares will sell well; and then we shall\nnot care, whether the aforesaid dancers come over or no.\"\n\n...Shadwell, in the brief scene just described, was the first dramatist to see the possibility of satire\non stock-jobbing. Interest in this activity arose since the war with France, \"for trade being obstructed at\nsea, few that had money were willing it should lie idle, and a great many that wanted employments\nstudied how to dispose of their money, that they might be able to command it whensoever they had\noccasion, which they found they could more easily do in joint-stock, than in laying out the same in lands,\nhouses, or commodities\" (Houghton, 1694).\n\nIan Dury (writer of The Futures Song and Five More Glorious Years)\n(From Wikipedia)\n\nFrontman for The Blockheads, one of the top New Wave music bands. Dury's lyrics are a\ndistinctive combination of lyrical poetry, word play, observation of British everyday (working-class) life,\nacute character sketches, and vivid, earthy sexual humour. \"This is what we find ... [H]ome improvement\nexpert Harold Hill of Harold Hill, Of do-it-yourself dexterity and double-glazing skill, Came home to find\nanother gentleman's kippers in the grill, So he sanded off his winkle with his Black & Decker drill.\" The\nsong \"Billericay Dickie\" continues this sexual content, rhyming \"I had a love affair with Nina, In the back\nof my Cortina\" with \"A seasoned-up hyena Could not have been more obscener\".\n\nNow the questions:\n1. A lot of Serious Money revolves around the idea of human greed. Is greed a bad thing? What\nstance does the play take?\n2. In the play, Scilla says that insider dealing is \"a crime without a victim\" (p26). How does the\nplay support this opinion? How?\n3. What is Churchill's purpose in incorporating a part of The Volunteers, or The Stockjobbers in\nthe opening of the play?\n4. Churchill writes the majority of the play in sets of rhyming couplets or other common\nrhyming schemes. What effect does this have on the piece? What does it do to the few\nsections that are not written like this?\n5. A lot of the play occurs in overlapping scenes and conversations. What is the significance of\nthis and what effect does it have?\n6. What is the significance of the songs at the end of each act?\n7. Because of the hectic nature of the play, Churchill's characters do not have much time to\ndevelop. Are these characters more of a machine like we see in Hydriotaphia or a type like in\nScenes from an Execution?\n8. Churchill, being very pro-woman's rights, is a staunch advocate for strong, forward women.\nWhat type of woman is Scilla? Does she, in some ways, represent Thatcher? What about the\nother women in the play?\n9. There is a major age difference between two sets of the characters. How are the old (pre Big\nBang) and young views represented?\n10. The conclusion of the play has all the major characters saying a line about what happened to\nthem after the events of the play before they break into song. What do you think of this\nending as a whole? What about on an individual character basis?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.703 Studies in Drama: Stoppard and Company\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "21L.703 Spring 2014 Assignments: Shakespeare in Love discussion questions",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-703-studies-in-drama-stoppard-and-company-spring-2014/cfe45ffd438f857f8bab8d1d3d27bed8_MIT21L_703S14_Shakes_Love.pdf",
      "content": "Shakespeare in Love Discussion Questions\nApril 24, 2012\n\n\"Playwrights teach us nothing about love. They make it pretty, they make it comical, or\nthey make it lust, but they cannot make it true.\" -Queen Elizabeth, Shakespeare in Love\nGiven what have read and seen in The Invention of Love and Shakespeare in Love, to\nwhat extent do you agree with this statement?\n\nTom Stoppard has been known for writing plays that are intellectually dazzling, but his\nearly work largely shies away from love. In fact, Stoppard himself once admitted, \"I\ndon't know how to write love. I try to write it properly, and it just comes out\nembarrassing. It's either childish or it's rude.\"1 The Invention of Love and Shakespeare in\nLove are fairly recent attempts to write love stories. Is Stoppard successful? How does\nStoppard's treatment of love in the Shakespeare in Love compare to his treatment of love\nin The Invention of Love?\n\nHow does the film compare to Stoppard's plays? What elements of a Stoppardian play\nappear in Shakespeare in Love?\n\nIn October 2011, Disney Theatrical Productions announced that Stoppard was adapting\nthe screenplay for the stage.2 In your opinion, can this film be successfully adapted to the\nstage? Why or why not?\n\nIn the film, Shakespeare needed a muse in order to write Romeo and Juliet. Similarly,\nThe Invention of Love suggests that A.E. Housman's poems stemmed from his unrequited\nlove for Moses Jackson. In other words, the writers needed to be in love in order to write\nabout love. For a playwright to write about something (say, love or loss), is it necessary\nfor him/her to have experienced it firsthand?\n\nIn Shakespeare in Love, Stoppard incorporates parts of Romeo and Juliet (and ideas from\nTwelfth Night) into his own story. Lines from other Shakespeare plays are sprinkled\nthroughout the dialogue, as well. This technique isn't new, of course--most notably, he\nhas borrowed from Shakespeare in Rosencrantz and Guildenstern are Dead, Dogg's\nHamlet, and Cahoot's Macbeth. Why the obsession with Shakespeare? What\nconclusions can we draw about Stoppard's attitude toward Shakespeare?\n\n1 Source: http://www.sfgate.com/cgi-\nbin/article.cgi?f=/e/a/1999/02/14/STYLE14438.dtl&ao=all#ixzz1spPvlv3R\n2Source:\nhttp://www.variety.com/article/VR1118044864?categoryid=15&cs=1&cmpid=RSS%7CNews%7CLatestN\news\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.703 Studies in Drama: Stoppard and Company\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "21L.703 Spring 2014 Assignments: Stylesheet",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-703-studies-in-drama-stoppard-and-company-spring-2014/9c127b9c686238bb1b0e814aabdb78ac_MIT21L_703S14_stylesheet.pdf",
      "content": "Stylistic advice sheet*\n\n1) Nouns are, verbs do--and so if you want your writing to be lively, use active verbs.\nThe verb \"to be\" is not active or informative. If you use \"is\" frequently, your writing will\nbecome overloaded with things.\n\n2) Try to avoid verbs that are nouns in disguise, including the ubiquitous \"ize\" group\n(\"prioritize\") and computer jargon (\"network,\" \"interface\").\n\n3) Be sparing in your use of abstract nouns; be generous with concrete ones. The aim is to avoid\nfloating away into an amorphous haze. Ditto adjectives: nothing is more deadly than strings of\nabstract adjective-noun clusters linked by tiny verbs. \"Abstract verbalization is symptomatic of\nthe culture's denial of its personal agency and responsibility\"--snore. When the abstractions pile\nup, the reasoning often becomes circular (perhaps without the author even knowing it).\n\n4) A plethora of adjectives and adverbs may shut out the reader's imagination, or may just sound\neffusive and \"overwritten.\" Try to avoid vague evaluative adjectives (a good poem, an\ninteresting idea, etc.). Instead, take advantage of your power to describe precisely, using the\nlanguage with the largest vocabulary on earth.\n\n5) \"Mistakes were made.\" Those who want or need to deny personal responsibility (bureaucrats,\nsoldiers, criminals, etc.) often use the passive voice, thus making the object of the action into the\nsubject of the sentence (the true agent disappears). A smart reader knows this technique, and\nwill not accept it blindly. Write honestly and actively, saving the passive voice for those\noccasions when the subject truly is unknown, the object truly is your focus, or the active\nconstruction sounds awkward.\n\n6) The main clause signals your major point; the subordinate clauses qualify or reinforce it.\nTake advantage of the wonders of a main clause.\n\n7) Use subordinate clauses to clarify the relationship between your ideas. Compound sentences\nonly connect thoughts, whereas complex sentences explain the nature of their connection.\n\n8) Conjunctions and prepositions may all be equal, but they are not all the same. \"However\"\nsignifies a contradiction, while \"nevertheless\" overrides it. Be precise in using these connecting\nwords; they can vastly improve the logic and clarity of your writing.\n\n9) Notice how often you say \"this,\" \"that\" and \"it.\"\n\n10) Contractions have become increasingly mysterious to the general public, but they still retain\nmeaning. Getting them wrong will jar a knowledgeable reader and will thus diminish your\nauthority. It's=it is; its signals a possessive.\n\n11) A few quibbles about diction:\n\na-\"Incredible\" means, literally, not believable. \"Literally\" means literally, i.e., not\nmetaphorically. Don't use these words as if they were the meaningless equivalents of\nexclamation points (and while we're at it, avoid exclamation points in expository prose).\nb-Something is unique (the only one of its kind) or not; it cannot be \"more unique\" or \"most\nunique.\" The same applies for other superlatives (\"ideal,\" etc.)\nc-Try not to resort to \"deal with\" (\"this paper deals with,\" \"Shakespeare deals with\"); it is too\nvague to mean much.\nd-You can \"center on\" but not \"center around.\"\ne-\"Man\" is, grammatically speaking, a false generic; this means \"man\" often refers only and\ncorrectly to the male of the human species, and hence cannot be assumed in all cases to include\nthe entire genus. Although for many centuries very few authors saw a problem in blurring the\nspecies and its males, many of your readers may feel alienated if you do the same unconsciously.\nThus, while you certainly should quote Milton on \"man's first disobedience,\" try to use a gender-\nneutral term such as \"humanity,\" \"people,\" or \"human beings\" in your own writing, unless you\nhave a good historical or polemical reason not to do so. The same problem applies to the use of\nthe pronoun \"he\" as if it were gender-neutral.\n\n12) A genre (from the Latin words for \"kind\") identifies a particular category of literature.\nPlease do not call a play a \"novel\"; to someone who has devoted much of her life to literary\nstudy and theatre, this is like scraping your fingernails along the blackboard.\n\n13) Be consistent about verb tenses within a paragraph. I encourage you to use the \"literary\npresent tense\" to animate your discussion of texts, but be aware that in other fields of study, the\nconventions may be different.\n\n14) In discussing works written in earlier times, try to avoid the slang of our current cultural\nmoment; it often sounds (or is) anachronistic. Words such as \"lifestyle\" and \"self-esteem,\"\noutside their framework in sociology or psychology, can be intrusive and sometimes\ninappropriate.\n\n15) The introduction to an essay should do just that: it should introduce the main idea in a way\nthat compels your reader's attention. It should not rival the analytic body of your essay in size.\nGet to your particular topic as quickly as possible so that you can explore it as profoundly as\npossible.\n\n16) Paragraphs provide a mechanism to organize the ideas in an essay. Opening and closing\nsentences of paragraphs \"stand out,\" and hence provide a special opportunity for highlighting\nyour ideas or analysis. If you use them to describe or to quote, you are sacrificing that\nopportunity, so do so sparingly. If you organize paragraphs to follow the story (\"Then,\" \"Next,\")\nrather than to direct our attention, you are again losing the chance to emphasize your own\nthinking.\n\n17) In your conclusion, try to forestall this response: \"What you've shown me seems true based\non the textual evidence you have marshaled in support of your thesis--but so what?\" A\nconclusion allows you to give a fuller sense of the import and significance of your thesis, and to\n\nraise related issues and questions for your reader's further consideration. If you can't answer the\n\"so what?\" question, you may need to choose a more challenging thesis.\n\n18) All the above are guidelines, not rules--and even rules can be broken for the sake of style or\nsense. However, to write most effectively you should know when you are breaking rules or\nmodifying conventions, and do so sparingly.\n\nAbout citations: If an idea or observation does not derive from your own study, and is not a\nmatter of common knowledge or fact (i.e., you could find it in at least five sources), you must say\nwhere you learned it. This is a matter of simple honesty. Conversely, you do not need to preface\nall your remarks with \"I believe\" or \"it seems to me\"; only do so if you are switching back to\nyour own thoughts from someone else's, or if you want to give your point special emphasis\n(because your idea is unconventional, or objectively less persuasive than your others).\n\nIf you are quoting more than two lines of verse or five lines of prose, set off the passage\n(with spaces and indentation) from the body of your essay, and do not use quotation marks.\nPresent the verse in metrical lines, as it appeared in the original text. If the passage is shorter,\nincorporate it within your paragraph, and separate verse lines with a slash mark (/). Rather than\nsimply inserting a quotation as a freestanding sentence, try to introduce and integrate it into a\nsentence of your own; this is less jarring and more helpful in directing your reader's attention\n(any grammatical changes need to be signaled with brackets). However, don't try to sustain your\nown sentence \"through\" a longer indented quotation, as a rule: it's too hard to keep your syntax\nin mind and adequately attend to the meaning of the quoted passage.\n\nThe longer the quotation, the more you need to analyze it. If you have one particular\npoint to make, use only that section of the text which supports it (although make sure you are\ntrue to the original context and syntax, and signal all ellipses and changes).\n\nYou can use footnotes or parenthetical citation within the text; the latter works especially\nwell for repeatedly cited sources. Use any standard form of scholarly citation (e.g., MLA,\nChicago Manual of Style, etc.), and be consistent. For my essays, if you follow this format for\nfootnotes, you'll be fine: author, title (place of publication: publisher, year): page number. For\nthe bibliography (only necessary if a long essay), it's: author's last name first, first name. Title.\nPlace of publication: publisher, year.\n\nAt the end of a quotation, the commas and periods you add to clarify its place in the\nsentence go inside the quotation marks, even though they are not part of the quotation (I know\nthis is illogical, but it is the U.S. convention). However, if you have a parenthetical citation at\nthe conclusion of your sentence, the period goes after that citation. For example,\n\"Henderson requires too much work.\"\n\"Henderson requires too much work\" (Henderson, p. 20).\nYour semicolons, colons, and parentheses go outside the quotation marks.\n\nMarginal abbreviations I use:\n√ : good point, understood\n\nfrag: sentence fragment\nww: wrong word (diction mistake)\ncs: comma splice\nagr: subject-verb or singular-plural noun agreement\nref: unclear, confusing, or nonexistent referent\nawk: awkward phrasing\n//: problem with parallelism\nsp: spelling\ncap: capitalize, or don't\np: punctuation oddity or omission\nc: change comma usage (add or delete one, as fits)\nuncl: meaning unclear\nsplit inf: split infinitive\n? : I don't get it, or sometimes an incredulous \"really?\"\n! : \"goodness!\" or some similar sign of forceful surprise, or amusement at your wit\nss: consult this stylesheet\n\nIf the grammatical terms I use in this stylesheet are unfamiliar or hazy, please feel free to speak\nwith me or a writing tutor, or consult a composition handbook. I am always happy to do what I\ncan to help you improve your writing.\n\n*This handout draws extensively upon a similar stylesheet designed by my teacher Prof.\nE.W.Tayler (Columbia University), to whom I remain most grateful.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.703 Studies in Drama: Stoppard and Company\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "21L.703 Spring 2014: Early 60s British humor",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-703-studies-in-drama-stoppard-and-company-spring-2014/baeaf9e42f879d82945f86ef09e47eda_MIT21L_703S14_early_60s.pdf",
      "content": "To get a sense of early '60s British humor...\n\nYou should perform a Google search for the \"Beyond the Fringe\" show, the ones that\nbecame models for Monty Python--in a 1961 televised version right before they left the\nUK for Broadway. An interesting part was \"So that's the way you like it\" (their spoof of\nlow-budget formal Shakespeare).\n\nAlso, search for the \"First and Second Laws of Thermodynamics\" by Flanders and\nSwann. The audio from their live show may be available, which was a very popular\nalbum--listen far enough at least to get to the song!\n\nEnjoy!\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.703 Studies in Drama: Stoppard and Company\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "21L.703 Spring 2014: Peter Cook’s mining skit",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-703-studies-in-drama-stoppard-and-company-spring-2014/0beef141d677228d0a5ebd9ba0b01209_MIT21L_703S14_Peter_Cook.pdf",
      "content": "Hi folks,\n\nFor those wishing to hear a version of Peter Cook's mining skit, you should do a Google\nsearch for a video with the skit. You might well catch an additional skit (preceeding in at\nleast one video) that mocks the state of British science, theater censorship, and racism (as\nwell as corrupt African leaders, probably now offensive to many) all in one pseudo-\ninterview show.\n\nAs with so many great comedians, Cook was an ad lib and variations-on-a-theme\nperformer, so different \"bits\" showed up different nights. My favorite is on the cast album\nfrom Broadway!\n\nI am not saying Henry Carr in \"Travesties\" is meant to sound like the miner, only that the\npatterns of comedy there--repetition, sly inversions, and absurd juxtapositions delivered\nwith a straight face--were Peter Cook's master ingredients in many 'character' skits, and\nStoppard knew them and his manic popularity.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.703 Studies in Drama: Stoppard and Company\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}