{
  "course_name": "Studies in Poetry: 20th Century Irish Poetry: The Shadow of W. B. Yeats",
  "course_description": "William Butler Yeats occupies a dominant position in the lives and work of the Irish poets who followed him. We will explore some of that poetry, and consider how later poets, especially female poets, tried to come to grips with, or escape from, that dominance. As a seminar, the subject will place special emphasis on student involvement and control. I will ask you to submit one ten-twelve page essay, two shorter (five page) essays, and to accept the role of “leadoff person,” perhaps more than once, That role will demand that you choose from among the assigned readings for that session the poem we should focus upon, and to offer either a provocative articulation of what the poem is about, or a provocative question which the poem confronts, and which we should grapple with, as well.",
  "topics": [
    "Humanities",
    "Literature",
    "Criticism",
    "International Literature",
    "Poetry",
    "Humanities",
    "Literature",
    "Criticism",
    "International Literature",
    "Poetry"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nCourse Description\n\nWilliam Butler Yeats occupies a dominant position in the lives and work of the Irish poets who followed him. We will explore some of that poetry, and consider how later poets, especially female poets, tried to come to grips with, or escape from, that dominance.\n\nAs a seminar, the subject will place special emphasis on student involvement and control. I will ask you to submit one ten-twelve page essay, two shorter (five page) essays, and to accept the role of \"leadoff person,\" perhaps more than once, That role will demand that you choose from among the assigned readings for that session the poem we should focus upon, and to offer either a provocative articulation of what the poem is about, or a provocative question which the poem confronts, and which we should grapple with, as well. I have asked the Registrar to set up a class e-mail list. You will not be placed on the list unless and until you are fully and officially registered for the subject.\n\nIt is my presumption that all work you present or submit is your own. Which raises the troublesome issue of plagiarism, the use of another's intellectual work without proper acknowledgement. This is a very serious offense. It is the policy of the Literature Faculty that students who plagiarize will receive an F in the subject, and also that the instructor will turn the matter over to the Committee on Discipline. Please note that these responses are not within my power to vary or bypass.\n\nFull acknowledgement for all information obtained from sources outside the classroom must be clearly stated in all written work submitted. Ideas, arguments, and direct phrasings taken from someone else's work must be labeled and properly footnoted. Further guidance on the proper forms of attribution may be found in the style guides available in the Writing and Communication Center, and at the\nMIT Web site\non plagiarism.\n\nRequired Texts\n\nFinneran, Richard J., ed.\nThe Yeats Reader\n. New York, NY: Scribner, 1997. ISBN: 9780684831886.\n\nCrotty, Patrick, ed.\nModern Irish Poetry\n. Belfast, IR: Blackstaff Press, 1995. ISBN: 9780856405617.\n\nHiggins, Rita Ann.\nThrow in the Vowels\n. Tarset, UK: Bloodaxe Books, 2005. ISBN: 9781852247003.\n\nBoland, Eavan.\nAn Origin Like Water\n. New York, NY: W.W. Norton, 1996. ISBN: 9780393038521.\n\nNi Dhomhnaill, Nuala.\nSelected Poems\n. Dublin, New Island Books, 1989. ISBN: 9781851860272.\n\nWriting Assignments\n\nOn my Web site are what I hope will be useful links on such subjects as \"paraphrase,\" which is to be firmly resisted. As for deadlines, I grant you that they are inconvenient, but I have tried to structure the term so that essays from my two classes do not fall due simultaneously. If you look at the syllabus and see you will be needing an extension, come see me well in advance. I try to be sympathetic, but the excuse that you are \"busy\" is a non-starter. After all, we are all busy, all the time, here at MIT. If you simply fail to submit the essay at the deadline moment, without prior arrangement, I will record an irremediable F in my grade book. Essays should be placed in the plastic receptacle on my office door. The \"due date\" extends until I arrive on campus the following morning, usually around noon.\n\nParaphrasing (\nPDF\n)\n\nEssay 1: 10-12 pages (one-inch margins, double-spaced, 12 or 14 point font). Due one day after Ses #3.\n\nEssays 2 and 3: Use one of the \"leadoffs\" provided in the class, and write a cogent, detailed analytic essay on one of our assigned poems. The essays should run 5 pages. Due on Ses #8 and two days after Ses #14.\n\nSchedule\n\nSES #\n\nTOPICS\n\nKEY DATES\n\nHearty welcomes (the Irish are renowned for hospitality, after all)\n\n\"The Wild Swans at Coole\"\n\n\"Lapis Lazuli\"\n\nFirst essay due after one day\n\nYeats, \"When You Are Old\" and \"Leda and the Swan\"\n\n\"Easter 1916\"\n\nPatrick Kavanagh\n\nLouis MacNeice\n\nJohn Hewitt\n\nSecond essay due\n\nRichard Murphy\n\nJohn Montague\n\nSeamus Heaney\n\nMichael Hartnett\n\nDerek Mahon\n\nPaul Durcan\n\nThird essay due after two days\n\nPaul Muldoon\n\nCiaran Carson\n\nPaula Meehan\n\nMedbh McGuckian\n\nFree sampler day. Come to class prepared to read us a poem from the Crotty anthology. No explanation or defense expected, we'll just listen.\n\nA video encounter with Eavan Boland\n\nYeats, Cathleen ni Houlihan and Evan Boland, \"A Kind of Scar.\" Think back to any women you recall appearing in any of the poems we've read.\n\nPanel discussion of Boland's poetry. Each of you should put forth a \"provocation,\" a statement which includes which poem in the book seems most clearly to grapple with Yeats, and a few sentences about how that struggle is enacted.\n\nPanel discussion of Rita Ann Higgins. Same sort of \"provocation\" due for this class.\n\nPanel discussion on Nuala ni Dhomhnaill. Same \"provocation\" system as before.\n\nLast class. Ah, that we could sip some stout or fine Irish whiskey!",
  "files": [
    {
      "category": "Resource",
      "title": "paper_guide.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-704-studies-in-poetry-20th-century-irish-poetry-the-shadow-of-w-b-yeats-spring-2008/75086618a461d28f86b061e619d94b23_paper_guide.pdf",
      "content": "SOME GUIDELINES FOR WRITING PAPERS\n1. The purpose of the papers assigned in this subject is analytical. I want to allow\nyou to exercise your own critical judgment by formulating a critical argument and\nthen by pointing out and discussing specific textual evidence which supports your\nargument. Summary or paraphrase of plot and unanalytic character description are\nnot an acceptable part of such a paper.\n2. A critical argument consists most significantly of an assertion of what seems to\nyou to be the point made by the text under analysis, and then of answers to the\nquestion why: why has the author included a particular character or metaphor or\nword or turn of plot? In what ways does this specific element or moment serve to\npresent, complicate, or elaborate the \"argument\" which the work itself presents\nabout human life or human nature? Many of the best critical arguments seem, at\nfirst, a little odd; all critical arguments demand that the critic take a stand and\ndefend that stand from within the work being analyzed (not, in other words, solely\nor primarily by way of the assertion of \"truths\" derived from some undefined\nbody of wisdom).\n3. Papers should be economical; avoid elaborate and general beginnings, and be sure\nto include points and evidence only if they are relevant to your essay.\n4. Secondary works (books or articles about the author or her work; including the\nintroductory essays in the anthology or elsewhere) can be useful but, in this\nsubject, should be avoided. Even the introductions included in the assigned texts\nare of little value for our purposes, and should be approached very warily. If you\ndo for some reason use a source of information other than the work itself, you\nmust carefully and openly identify the source and your use of it, by way of\nfootnotes if possible. FAILURE TO DO THIS IS ABOUT AS SERIOUS A SIN\nAS CAN BE IMAGINED, IN AN ACADEMIC CONTEXT.\n5. Of course it is expected that the work in the paper you turn in is your own. Any\npaper which presents as your work language or ideas which in fact belong to\nsomeone else is unforgivably flawed. It is always better to write a bad paper of\nyour own than to \"borrow\" a good paper. ALWAYS.\n6. Papers should be typed or word-processed, on standard sized ( 8 1/2 by 11) paper.\nMargins should be about 1 inch all around. A \"page\" is about 250 words. Papers\nshould be proofread for spelling and grammatical errors.\n7. You need not use footnotes to identify the location of references or quotations IF\nYOU ARE CITING THE TEXT ASSIGNED IN CLASS. But you should \"locate\"\nthe references you make, using parentheses and page numbers. If you do not use\nthe assigned edition, you should briefly indicate at the end of the paper what\nedition you did use.\n8. The Writing Center at MIT can be of great help with mechanics, grammar,\norganization -- the messy details. They won't write the essay for you, but if you\ndrop in they will help you edit, revise, and improve what you've already written or\nthought."
    },
    {
      "category": "Resource",
      "title": "wilcox_essay1_yeats.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-704-studies-in-poetry-20th-century-irish-poetry-the-shadow-of-w-b-yeats-spring-2008/06ae8fd51eccbdd0a5b19103b6af7fee_wilcox_essay1_yeats.pdf",
      "content": "Martha Angela Wilcox\n21L.704\nPoetry Seminar\nEssay #1\nA Bemuddled Contrast of Human Mortality with Keatsian Immortality\nThrough Diction, Imagery, and Symbolism\nIn Yeats' \"Sailing to Byzantium\"\nWilliam Butler Yeats' lyric poem \"Sailing to Byzantium,\" written in\nfour eight-line stanzas in iambic pentameter, has been called endlessly\ninterpretable, and perhaps even the title itself is endlessly interpretable.\nByzantium, present-day Istanbul, no longer exists as it once did, but during\nthe fifth and sixth centuries, it was the capital of the Eastern Roman\nEmpire. Byzantium stood proud as a center for art and intellect, and even\nas late as 1926, the publication date of Yeats' poem, one could easily\ndiscover remnants of the rich city in museums throughout Europe. The city\nlived on through the permanence of its art such as its famous gold\nmosaics, though it eventually decayed itself. How then would the speaker\naim to \"Sail... to Byzantium\" if it no longer remains? Sailing is suggestive\nof a journey subject to the perils of the sea, much like life is subject to the\nperils of fate, but by sailing with a purpose to Byzantium, the speaker of\n\nYeats' poem may hope to achieve immortality as the great city had. Still,\nsailing is wrought with the unknown and a vitality. Therefore, the poem's\ntitle itself gives a first glimpse at the confusing contrast presented by the\nspeaker between mortality and immortality, the transient natural and\neternal art. How can one be sailing, journeying, living and still hope for the\nfinal destination to be this immortality of Byzantium? The speaker explores\nthis inherent paradox through the poem \"Sailing to Byzantium\" by showing\nthe contrast between the metaphorical journey of life and the possibility of\neternity through careful diction, inventive imagery, and compelling\nsymbolism.\nThe speaker begins by describing and even lamenting the sensual\naspects of mortality, his fate. Yeats describes the transient nature of\nvitality by sharply contrasting the \"young/ In one another's arms\" (lines 1\n2) or the sensual aspects of youth with \"Those dying generations\" (line 3)\nin just three lines. This reminds the reader that though a man may be\nyoung once, generations of men have died before and so will this young\nman also die eventually. Yeats' clever choice of diction allows the\nmonosyllabic and alliterative \"Fish, flesh, or fowl\" (line 5) to bring to mind\nthe choppy, abrupt nature of life itself. The staccato-like rhythm of the\nphrases used, especially in the first stanza of the poem, allow the reader to\nexperience the pulsing of mortal life. And all of these \"Fish, flesh...fowl\"\n(line 5) remember well whatever is born and whatever dies, but they\n\n\"neglect/ Monuments of unageing intellect\" (lines 7 - 8). Truly all mortal\nentities praise new members of the cycle of life, and they remember often\nquite fondly those that come to the close of the gyre of life to make room\nfor the newborns; however, mortality and life give rise to disregard for that\nwhich is permanent in the world. Change is vital to mortality and\novershadows the power of unchanging immortality.\nYeats further employs imagery to explore the mortality which is so\nsickening yet so seductive and inescapable for the speaker. The first\nstanza paints a picture of life with its youth, vitality, disorder, reproduction\nof the spawning \"salmon-falls\" (line 4), and final decay and then death. In\nthe second stanza, he then captures the image of a man in his final years\nnot as a kind old soul but rather as a decaying, repulsive \"tattered coat\nupon a stick\" (line 10). This lifeless shell of an \"aged man\" (line 9),\nanalogous to a scarecrow who is of little consequence and only \"but a\npaltry thing\" (line 9), reveals the speaker's statement about the agony of\nthe old age to which his mortality has condemned him; afterall, \"Whatever\nis begotten...dies\" (line 6). The speaker fears that life is only a means to\ndeath, and that after one has died, there is no permanent mark left. There\ncan be nothing immortal about humanity, about mortality. He believes that\none can be productive no more after one's life has ended, and so the\nspeaker of \"Sailing to Byzantium\" strives for an undying permanence. He\nasks that his heart be \"consume[d]...away\" (line 21) as it is \"fastened to a\n\ndying animal\" (line 22). The speaker wants his soul, his mortality, to be\nabsorbed into the permanent mosaic art of some ancient wall. The image\nof the \"dying animal\" to which his soul is bound presents the idea that the\nspeaker's inner desires are being dragged about by some sick, aged beast.\nBy the curse of mortality, the speaker is unable to free himself or his true\nsoul from this beast, his own mortal body.\nThrough a pervasive symbolism of birds and of song, Yeats further\ndevelops this disgusting mortality of the speaker in \"Sailing to Byzantium.\"\nThe \"birds in the trees/ - Those dying generations\" (lines 2 - 3) are high-\nperched in long trees, but those trees are unable to reach the skies of\nimmortality. The spiraling branches must finally expire, as the trees too are\nonly mortal; such trees serve to contrast with the fact that the birds and\nalso the trees are in fact dying. They are moving through the cycle of life\nfrom youth to old-age, \"Caught in that sensual music [of mortality]\" (line\n7). The symbolic singing of life is again recalled in the second stanza of the\npoem, when the speaker declares that he would rather study monuments\nof significance and permanence like those found in Byzantium than attend\nthe \"singing school\" (line 13) which sings \"For every tatter in... mortal\ndress\" (line 12). Living fully and rejoicing in vitality and ordinary life is\nsecondary to embracing permanence for this speaker, who is hungry for\nthe immortality of the unravished bride upon a forgotten Grecian urn and\nready to reject his mortal roots. The speaker wishes to sail the sea to\n\nByzantium, escape to a world of permanence, and transform himself into a\nwork of art - one that mortal after mortal and even a \"drowsy Emperor\"\n(line 29) can enjoy.\nThis immortality, which is so sought after by the speaker in the\npoem, is intensified by Yeats' choice and style of language, which\npurposefully contrasts with the language he uses to portray mere\nmortality. The flowing words which describe the eternal are decoratively\npolysyllabic rather than mono- or duosyllabic. The speaker yearns after\n\"Monuments of unageing intellect\" (line 8) and the \"gold enamelling\" (line\n28) of the world of art represented by the magnificence of the old city\nByzantium. The immortal art has been witnessed by many generations of\nmortals, yet as it is ageless, the art is still fresh to new eyes. But even art\nis susceptible to the decay of time, so one has to wonder whether it is\npossible to achieve the immortality for which the speaker so strives.\nPerhaps even the glorious art of \"the holy city of Byzantium\" (line 16) is\nmortal in a sense.\nYet the poem persists in its plea for immortality through images of\nthe supposed grandeur of endless life and the furthering of the symbols of\nbird and song. The speaker believes that once he is immortal, he will take\n\"such a form as Grecian goldsmiths make/ Of hammered gold\" (lines 27 -\n28). Perhaps he believes that unheard melodies are sweeter, but the bride\nupon the Grecian urn was never able to finish the kiss with her lover. She\n\nwas never able to immerse herself in living, but rather she was forced to\nremain in a single moment forever, never moving forward, and never\nachieving her purpose. Is this Keatsian form the one which the speaker\nwould like to take as he neglects the \"form from any natural thing\" (line\n26)? The speaker forgets that his saviors, the \"sages standing...in the gold\nmosaic of a wall\" (lines 17 - 18), are simply that; they are men which are\nforever wise and also forever old. He wants the sages to appear and take\nhim from his body into an existence outside of time like a piece of great\nart. The speaker wishes to exist in the \"artifice of eternity\" (line 24), but\nhis sages are unable to help him in this endeavor. They are \"standing\" yet\nnever able to gather him into their eternity. They are entrapped in the gold\nmosaic of a wall that may one day be demolished for the building of a new\nshopping center. The gold represents an untarnished brilliance, but it is\njust as easily melted or displaced as life itself; the sages are immortal only\nin the sense that they will forever be frozen in time until the day they\nperish or are destroyed. At least life has not left the speaker frozen in a\nsingle time before his day of decay. What is it exactly that the speaker in\nthe poem really desires: a permanent sense of self or his mortality to a\nfuller degree?\nThe symbolism derived to describe mortality is reused to depict\nimmortality, muddling the distinction between that which the speaker\nactually desires even further. The speaker declares his desire to become\n\nhammered into art which is in the shape of a bird, which would \"set upon a\ngolden bough to sing\" (line 30). The melody of a golden bird, however,\nwould not be heard. Birdsong is produced by \"Those dying generations\"\n(line 3), not by some inantimate block of gold that has been shaped to take\nthe form of a \"natural thing\" (line 26), which the confused speaker believes\nhe dislikes so much. Furthermore, the speaker himself used the bird to\nsymbolize the transient nature of mortality, yet here is the speaker's final\ndesire in the last lines of the poem to become a bird which will sing - a\nsymbol of its ability to change and live - to the nobility of Byzantium.\nByzantium itself, timeless as the speaker thinks it is, has crumpled. The\nbird he wishes to become will also decay should it have the ability to sing.\nHas the speaker come full circle and now wishes to live in the sensual\nworld? Afterall, to be stuck forever in a state of permanence is not so\nromantic as it first seems. The \"sages [must] stand... in God's holy fire\"\n(line 17) as perhaps they are martyrs being burned for their faith, but\nbecause they are immortal within the gold mosaic, these old men must be\nforever old and forever burning to their death. Similarly the unravished\nbride will never know true love and will never be married. The speaker\ninstead wants to sing beautifully to the living as a mortal would,\ncontradicting his previous lament. He wishes to sing \"Of what is past, or\npassing, or to come\" (line 32). That is, the speaker wants to chirp sweetly\nabout the past, the present, and even the future- the changing time which\n\ncannot be experienced by the sages burning in the fire.\nThe speaker in Yeats' \"Sailing to Byzantium\" has then encountered a\nparadox. He wishes to strive for the permanence of art, yet he also has\ndesires to be immersed in the changing nature of life. He is seduced by his\nown mortal sensuality, but he is aware of his intellectual powers. He feels\nthe transitory nature of life, yet he yearns for a permanent sense of self\nwhich will not end. The speaker enjoys the thrills of youth, but he likely\nunderstands that he is ageing and eventually even his intellect will decay.\nNature, such as the singing of birds, traps him, and still the art of\nByzantium calls out to him. Each of these opposing forces appeals to him,\nbut though they are opposing, they mutually depend upon one another.\nYouth cannot exist without age, and the transient cannot exist without the\ntensioned concept of the eternal. As in Yeats' \"The Lover Tells of the Rose\nin His Heart,\" the speaker longs to remake the world, or at least his own\npersonal world, into a \"casket of gold\" to eliminate any imperfections, but\nhe cherishes those imperfections simultaneously.\nIs William Butler Yeats equivilient to the speaker so cleverly masked\nin his \"Sailing to Byzantium?\" The speaker, afterall, desires to transform\nhimself into a work of art that will last forever, obscuring the distinction\nbetween form and content, the artist and his work. Through his poetry\nperhaps Yeats too desired his own permanence, his own immortality, while\nstill enjoying natural life and its changing course. Yeats then may have\n\nsolved the paradox which he explores through \"Sailing to Byzantium.\" He\nwas able to immerse himself in his own life while still striving for\npermanence through his art, his poems such as this one. \"Sailing to\nByzantium\" tells of the journey of the speaker's searching soul, but applied\nto Yeats' life it tells of the journey of a poet reaching for immortality\nthrough his poetry."
    }
  ]
}