{
  "course_name": "Submicrometer and Nanometer Technology",
  "course_description": "This course surveys techniques to fabricate and analyze submicron and nanometer structures, with applications. Optical and electron microscopy is reviewed. Additional topics that are covered include: surface characterization, preparation, and measurement techniques, resist technology, optical projection, interferometric, X-ray, ion, and electron lithography; Aqueous, ion, and plasma etching techniques; lift-off and electroplating; and ion implantation. Applications in microelectronics, microphotonics, information storage, and nanotechnology will also be explored.\nAcknowledgements\nThe Instructors would like to thank Bob Barsotti, Bryan Cord, and Ben Wunsch for their work on the Atomic Force Microscope video. They would also like to thank Bryan Cord for creating each video.",
  "topics": [
    "Engineering",
    "Electrical Engineering",
    "Mechanical Engineering",
    "Microtechnology",
    "Nanotechnology",
    "Engineering",
    "Electrical Engineering",
    "Mechanical Engineering",
    "Microtechnology",
    "Nanotechnology"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nPrerequisites\n\nThis course has no official prerequisites. However, we do assume a very thorough knowledge of the 1st-year basic sciences and a solid grasp of the EE or ME undergraduate curriculum. The class makes use of elementary concepts from optics, mechanics, special relativity, Fourier transforms, and chemistry.\n\nAcademic Conduct\n\nCollaboration is permitted (but not necessarily encouraged) on all assignments except the final assignment. This collaboration should take the form of discussion of problem approaches and solutions, but each student should write up his or her own solutions individually, without consulting others. The completed assignment should indicate if anyone outside of the teaching staff was consulted, and if so, who.\n\nThe final assignment should consist of strictly individual work.\n\nPrior year's lecture notes of other students may be consulted, however prior year's work on assignments may not be consulted.\n\nAssessment and Grading\n\nStudent's performance will be assessed primarily based on their performance on the final homework assignment (distributed in Ses #20, and due in Ses #26). This assignment will comprise at least 50% of the course grade. The remainder will be made up of the remaining homework assignments (of which there will be 13). The final assignment will be weighted more heavily in instances where the student's performance on it differs markedly (either positively or negatively) from their performance in the remainder in the class.\n\nThere will be no final examination for this class.\n\nLearning Objectives\n\nUpon completion of 6.781J/2.391J, students will know, and understand the principles of nanofabrication and materials analysis methods including:\n\nOptical Microscopy\n\nOptical Lithography\n\nElectron-Beam Microscopy\n\nElectron-Beam Lithography\n\nIon-Beam Microscopy\n\nIon-Beam Lithography\n\nScanning-Probe Microscopy\n\nScanning-Probe Lithography\n\nThin-film Patterning using Aqueous, Ion, and Plasma Etching Methods\n\nThin-film Patterning using Lift-off and Electroplating\n\nSubstrate Cleaning\n\nCleanroom Principles\n\nStudents will understand the concepts of lithographic and microscopic resolution, and be able to apply this knowledge to calculate resolution limits for lithographic and imaging/inspection tools. They will be able to define the concept of contrast and a transfer function for an optical system, and explain their role in both microscopy and lithography. They will know the factors that establish practical resolution limits for major microscopy and lithography approaches and explain the impact of these factors. Students will also be able to comprehend, evaluate, and critique articles on nanolithography and microscopy from the recent literature. Students will understand how nanofabrication tools are applied to fabricate nanostructures in materials and be able to analyze and evaluate proposed approaches to material processing.\n\nCalendar\n\nFirst, please note an important conceptual point about the class schedule: We distinguish a class (which occurs on a set date and time) from a lecture (which is a discussion of a single conceptually related set of topics). A class can contain a single or multiple lectures covered in whole or in part. Similarly, a lecture can span multiple classes.\n\nSES #\n\nTOPICS\n\nKEY DATES\n\nIntroduction to Nanometer-structures Technology and Applications\n\nFourier Optics, Optical Microscope\n\nAssignment 1 handed out\n\nFourier Optics, Optical Microscope (cont.)\n\nAssignment 2 handed out\n\nSpatial Filtering and Contrast in Optical Microscopy\n\nAssignments 1 and 2 due\n\nAssignment 3 handed out\n\nSpatial Filtering and Contrast in Optical Microscopy (cont.)\n\nAssignment 4 handed out\n\nElectron Optics and the Transmission-Electron Microscope\n\nElectron Optics and the Transmission-Electron Microscope (cont.)\n\nAssignments 3 and 4 due\n\nAssignment 5 handed out\n\nScanning-Electron-Beam Systems\n\nSignals Collected in Scanning-Electron-Beam Systems\n\nAssignment 5 due\n\nSignals Collected in Scanning-Electron-Beam Systems (cont.)\n\nNoise Analysis in Scanning-Electron-Beam Systems\n\nSubstrate Preparation, Characterization, Interferometry, Ellipsometry\n\nAssignment 6 handed out\n\nProximity-Probe Methods in Microscopy and Lithography\n\nContamination Control, Cleanrooms, and Substrate Cleaning\n\nAssignment 6 due\n\nAssignments 7 and 8 handed out\n\nResists\n\nAssignment 9 handed out\n\nEtching in Reactive Gaseous Plasmas\n\nAssignments 7 and 8 due\n\nAssignments 10 and 11 handed out\n\nPhotolithography\n\nAssignment 9 due\n\nOptical Projection Photolithography\n\nAssignment 10 due\n\nOptical Projection Photolithography (cont.)\n\nPhase-Measuring Laser Interferometer\n\nAssignment 11 due\n\nAssignments 12a 12b handed out\n\nElectron-Beam Lithography (Guest Speaker: Mark Mondol)\n\nAssignment 13 handed out\n\nElectron Scattering and Proximity Effects\n\nAssignments 12a, 12b, and 13 due\n\nInterference Lithography\n\nAnalyzing and Avoiding Distortion in E-beam Systems (SPLEBL)\n\nFinal assignment handed out\n\nNanoimprint and Soft Lithography\n\nX-ray Lithography\n\nAlignment (Guest Speaker: Dr. Euclid Moon)\n\nLift-off and Electroplating\n\nNonlinear Methods in Optical Lithography\n\nSpecial Class: The Debate\n\nHelium-Ion-Beam Microscopy and Lithography\n\nFinal assignment due",
  "files": [
    {
      "category": "Resource",
      "title": "final_soln.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-781j-submicrometer-and-nanometer-technology-spring-2006/4e1e95024c60c936b3ff38244250dd49_final_soln.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\n\n6.781/2.391J\nTAKE-HOME FINAL ASSIGNMENT, 2006\n\nHanded out Thursday, April 27, 2006\n\nDue no later than\n5 PM on May 18, 2006\n\nThis is a take-home assignment. You may use any text, notes, etc. You\nmay speak to Profs. Smith, Berggren, Barbastathis, or the TA's, either in class or\noutside of class, in order to clarify any of the problems. You may not consult\nwith others on the solution of problems.\n\nIn the solutions to any of the problems, you may make simplifying\nassumptions, such as square pixels, square beams, etc. Assume that electrons,\nphotons or gas molecules arrive on a surface independently and thus obey\nPoisson statistics (same assumption as we made in class and homework). Please\nbe brief! Note that some superfluous information may be provided in some of\nthe problems.\n\n(1)\nPlease answer true/false and give a brief explanation for the following\nquestions:\n\nA) True or false, chemically-amplified resists (CARs) are useful\nbecause they are very resistant to airborne contamination.\n\nB) True or false, in a scanning-electron-beam system, such as an SEM,\na field-emission source can be used to produce a finer focal spot\nthan can be achieved with a thermionic source, assuming the\ncurrent is the same in both cases.\n\nC) True or false, the only current application of scanning-electron-\nbeam lithography in industry is research and development.\n\nD) True or false, a good electron beam lens system can have a\nnumerical aperture (NA) up to 0.6.\n\nE) True or false, Polymethyl methacrylate (PMMA) can be used as a\nresist in deep-UV, electron-beam, and x-ray lithography.\n\nF) True or false, the ability of a Linnik interferometer to resolve small\nsteps on a surface is given by the optical system's depth of focus,\nλ/NA2.\n\nG) True or false, a typical atomic-force microscope (AFM) cannot\nresolve individual atoms.\n\nH) True or false, metal contaminants are usually removed from a\nsample by using ozone that oxidizes the metal.\n\nI) True or false, in optical-projection lithography (OPL), incoherent\nillumination can yield higher resolution than coherent illumination\ncan, but the contrast is reduced for lower spatial frequencies.\n\nJ) True or false, some optical microscopy methods can be used to\nresolve features much smaller than the wavelength of light\n\nK) True or false, contact lithography cannot yield as high a resolution\nas optical projection lithography (OPL) because there is additional\ndemagnification in OPL.\n\nL) True or false, in optical and electron-beam lithography one can\nachieve alignment much better than the system resolution.\n\nA. False- CARs are very sensitive to airborne contamination\nB. True- FE Gun is a much smaller source (brighter)\nC. False- It is used to make optical lithography masks and some products, such\nas diffractive optics for telecom systems.\nD. False- e-beam lenses have NA around 10^-2 or 10^-3\nE. True- PMMA is useful\nF. False- the interferometer's resolution is given by the ability to resolve phase\nin an interference pattern, and that is not related to the depth of field\nG. True- resolution is around 10 nm\nH. False- ozone is useful for organics- metals are removed with piranha or\nother techniques\nI. True- semiconductor companies use partially coherent illumination to\nbalance the trade-off.\nJ. True- two-photon and multi-photon confocal microscopy\nK. False- interference lithography can make smaller features with less\ndistortion\nL. True- with methods such as Spatial Phase Locking\n\n(2)\nRead the article \"Robust Shadow-Mask Evaporation via\nLithographically-Controlled Undercut,\" by B. Cord, C. Dames, K. K. Berggren,\nand J. Aumentado.\n\nA) Using the double-Gaussian point-spread function data in the paper,\nplot the cross-sectional, normalized dose profiles at the base of the\nPMMA layer and at the substrate for a grating of 250 nm period\nand 50 nm linewidth exposed in a PMGI/PMMA bilayer like the\none in the paper. Assume that the length of the lines in the grating\nis much greater than their width and that the total width of the\ngrating is 25 μm.\n\nB) Assuming perfect mass transfer during the development process\nand a nominal dose of 500 μC/cm2, estimate how long it will take\nfor lateral PMGI development to completely undercut the PMMA\nlines in the center of the grating in (A); i.e. approximately what\ndevelopment time will cause the entire grating structure to begin to\ncollapse?\n\nC) Repeat (B), this time taking into account the diffusion-limited\nnature of the development process.\n\nD) Will increasing the grating period to 500 nm and the linewidth to\n100 nm cause the lateral development rate to increase or decrease?\nExplain your answer.\n\nE) Show that, in the structure described in (A), the proximity effect is\nnegligible compared to mass transfer in determining the rate of\nundercut development.\n\nQuestion #32 Solutions Attached\n\n(3)\nRead the article \"\n\nA) What is meant by macroscopic nonuniformity?\n\nAns:\nEtch rate is a function of position on the substrate.\n\nB) What is meant by microscopic nonuniformity?\n\nMicrosystems Technology Research Report, Massachusetts\nInstitute of Technology (September 2006).\nGiapis, Konstantinos, Geoffrey Scheller, Richard Gottscho,\nWilliam Hobson, and Yong Lee. Microscopic and macroscopic uniformity control\nin plasma etching. Appl. Phys. Letter 57, no. 983 (1990).\n\nAns:\nEtch rate depends on pattern geometry, i.e., fine features etch at a\ndifferent rate than coarse features.\n\nC) What is the mean-free path of a Cl2 gas molecule at 7 m torr\nassuming the ideal gas law?\nAns:\nMean-free path, Λ, is given by\n\nΛ = 1/π(1.414)(d2) n\n\nwhere d is the molecule diameter taken to be 0.5 nm for the case of Cl2 , and\nn is the number density,\n\nn@760 torr\n= 6.02 ×1023molecular/mole\n22.4 ×103cm3 /mole\n\n= 2.69 x 1019 molecules/cm3\n\nn@ 7x 10-3 torr\n= 2.48 x 1014 molecular/cm3\n\nΛ\n= 1/π (1.414)(5 x 10-8cm)2 (2.48 x 1014cm-3)\n\nΛ\n= 0.36 cm\n\nSuppose we want to etch a lithographically patterned Si substrate using\nCl2 gas in a reactive-ion etching system operating at 7 m torr, 100 watts\ninput power, a peak-to-peak voltage of 75 V, and a bias voltage of 25V.\n\nThe \"dark space\" between the main body of the plasma and the electrode\non which the substrates are to be etched is about 7 mm thick. Assume that\nthe molecules and ions within the main body of the plasma are at room\ntemperature, and that ions acquire the full 25 eV as they are accelerated\nacross the dark space.\n\nD) Is an ion likely to experience a collision with a molecule in crossing\nthe dark space?\n\nAnswer: We calculated above that the mean-free path for a neutral Cl2\nmolecule with thermal velocity is 0.36 cm. Since the dark space is 7 mm\nacross, the probability of a molecule colliding with another molecule in\ncrossing the dark space is close to unity. For an ion such as Cl+, whose\neffective cross-sectional area is smaller than the Cl2 molecule, the\nprobability of a collision is proportionally smaller, but also close to unity.\nHowever, multiple collisions are unlikely.\n\nE) Is an ion likely to experience multiple collisions in crossing the dark\nspace?\nAnswer: No, multiple collisions in crossing the dark space are of low\nprobability.\n\nF) Why do you think there is a dark space (very little emission of\nlight) between the main body of the plasma and the powered\nelectrode?\nAnswer: The dark space indicates that the excitation of atoms by electron\nbombardment is low, hence the electron density is low in the dark space.\n\nG) Calculate the velocity of a 25 eV Cl ion and compare this to the\nmolecule's thermal velocity. What is the ratio of the two velocities?\nAnswer: The mass, m, of a Cl atom is (35.5) (1.66 x 10-24 gms) = 5.89 x 10-23\ngms\n\nBoltzman's constant, k = 1.381 x 10-16 erg/K\n\nTemperature, T = 300K\n\nFor a Cl ion before acceleration, thermal velocity is,\n\n(1/2) m v2 ~ kT, or vthermal ~ {2kT/m}1/2\n\nthus, vthermal ~ 375 m/sec\n\nTo calculate the velocity of the 25 eV ion, we set (1/2) m v2 = 25 eV\n\n25 eV = (25) (1.6x10-19) Joules = (1/2) (5.9 x 10-26 kg) v2\n\nTherefore, v25eV = {(50) (1.6x10-19)/ (5.9 x 10-26 kg)}1/2 = 11,644 m/sec,\nconsiderably faster than the thermal velocity.\n\nThe velocity ratio is, (v25eV / vthermal ) = 31\n\nH) From the ratio of velocities can you estimate the deviation from 90\ndeg of the angle of incidence of the ions on the substrate? Do you\nbelieve this is connected with the highly directional etching\nobtained in RIE when the isotropic component of etching is absent\nor very small?\n\nAnswer: Since the ions extracted from the body of the plasma acquire a\nvelocity much higher than the thermal velocity, and since the accelerating\nfield is perpendicular to the substrate, it is not surprising that the etching is\nhighly vertical as long as the isotropic component of the etching is\nnegligible compared to the etching stimulated by the ion bombardment.\nEven at a relatively low accelerating potential of 25 volts, the ratio of\nvelocities is about 31, indicating that the ions arrive an at angle close to\nnormal. It is difficult to estimate the effect of collisions on the angle of\narrival but this is expected to be small. In any event it is outside the scope\nof this course.\n\nI) Calculate the arrival rate in number/cm2 sec of neutral Cl2\nmolecules at the surface of the substrate.\nAns: Arrival rate, F, is given by\n\nF\n= P/{2 (1.414)m k T}1/2\n\nMCl2 = 2(35.5) (1.66 x 10-24 gms)\n\n= 1.18 x 10-22 g\n\nk\n= 1.381 x 10-16 erg/K\n\nT\n= 300K\n\nP = (7x10-3 torr)(133Pa/torr) (10 dynes/cm2/1 N/m2)\n\n= 9.3 dynes/cm2\n\nF = 2.5 x 1018/cm2s\n\nJ) Assume that the substrate is cooled so that no spontaneous or\nisotropic etching occurs, that each arriving Cl2 molecule sticks and\ndissociates, and that each bombarding ion gives rise to the removal\nof 2 Si atom, and that there is always sufficient Cl adsorbed on the\nsurface , i.e., that the Cl2 arrival rate does not limit the etching rate.\nIf the etch rate is 10 nm/s, what is the ion current density.\nAns: An etch rate of 10 nm/s corresponds to the removal of 10-6 cm3/s of\nSi per cm2. The number density of Si is 5 x 1022/cm3. So, an etch rate of\n10 nm/s corresponds to 5 x 1016 Si atoms/ cm2 s. This, in turn,\ncorresponds to an ion arrival rate of 2.5 x 1016 ions/ cm2 s, or a current\ndensity of 4 mA/cm2.\n\nK) Is the assumption that the arrival of Cl2 molecules on the surface is\nnot rate limiting valid?\nAns: The arrival rate of Cl2 molecules is given by\n\nF\n= 2.5 x 1018 Cl2/cm2 s\n\nIf every pair of Cl2 molecule that arrived resulted in one molecule of SiCl4\nbeing removed as a gaseous species then the removal rate of Si would be\n\nF/2\n= 1.25 x 1018 Si/cm2 s\n\nThe corresponding etch rate would be:\n\netch rate\n= (1.25 x 1018 Si/cm2s)/( 5 x 1022 Si /cm3)\n\n= 2.5 x 10-5 cm/s\n= 250 nm/s.\n\nHence the actual rate of Si removal, 10 nm/s, is not limited by the arrival\nof Cl2 but rather by the arrival of ions from the plasma.\n\n(4)\nAssume a bond in a resist takes 5 eV to break, and that the absorbed\nphoton energy in its entirety goes into bond breaking. Assume that in\nevery 1 nm3 of material there are 10 bonds that must be broken in order\nfor a material to develop. Assume that the vertical absorption profile of\nthe incident radiation in the resist is uniform (i.e. no z-dependence to the\nabsorption),\n\nA) Calculate the sensitivity of the resist in units of eV/nm3\n\nANSWER: 5 eV/bond * 10 bonds/nm3 = 50 eV/nm3\n\nB) Calculate the number of quanta per nm3 required to achieve this\nsensitivity as a function of wavelength for photons ranging from 4\nnm to 400 nm. Make a chart of this function\n\nANSWER: Ephoton (eV)= h c/(λ e) where e is the electron charge in Coulombs.\nAlso N = 50 eV/nm3/Ephoton = λ e 50 eV/nm3/(h c) = 0.044 λ(nm).\nlambda\nN\n0.176\n0.66\n8.492\n10.912\n\nC) Assume that 100 quanta/nm2 are required for relatively noise-free\nexposures. Make a chart of resist thickness vs. photon wavelength\nand indicate the region on this graph where shot noise is low\nenough to permit ~ 1nm line-edge roughness in the film.\n\nANSWER: Let the resist thickness be r, then the number of quanta for\nexposure of a parallelepiped with volume r x 1 nm x 1 nm is just 0.044 r(nm)\nλ(nm) > 100.\n\nD) Typical proposals for EUV lithography suggest that a resist with a\nsensitivity of 5 mJ/cm2 will be used. Suppose a 50-nm-thick film\nwill be used. The EUV wavelength is 13.4 nm. First convert the\nresist sensitivity to eV/nm2, then photons/nm2, and then eV/nm3\nand photons /nm3.\n\nANSWER: 2 mJ/cm2 corresponds to 125 eV/nm2 ~ 1.5 photons/nm2. This\ncorresponds to 2.5 eV/nm3 and 0.03 photons/nm3.\n\nE) What resist sensitivity (in mJ/cm2) is required to achieve 1 nm line-\nedge roughness based on shot noise? Typically EUV systems are\nlimited in the source power that they can provide. What would be\nthe consequences of this result on the manufacturing throughput of\nEUV systems (relative to the planned 5 mJ/cm2 sensitivity).\n\nANSWER: 100 photons per pixel requires a resist sensitivity of 100 h\nc/(λ) /nm2 = 134 mJ/cm2. This will results in production ~ 25 times\nslower than planned. The result will be an unacceptable cost-of-\nownership.\n\nF) If a resist sensitivity of 5 mJ/cm2 is to be achieved, what is the\nminimum pixel size that can be used and still maintain acceptable\nshot-noise performance?\n\nANSWER: By increasing the pixel area by ~ 25 times (to 5-nm x 5-nm)\nthe sensitivity can be decreased correspondingly to 5 mJ/cm2. 5 nm line-\nedge roughness is totally unacceptable for manufacturing at the 25-nm\nnode.\n\n(5)\nThis is a problem dealing with the liftoff process. As a preliminary to\nsolving this problem, you should look at the article, \"Fabrication of large\narea subwavelength antireflection structures on Si using trilayer resist\n\nnanoimprint lithography and liftoff\" by Z. Yu, et al, J. Vac. Sci. Technol. B,\nvol 21, pp2874-2877 (2003). In particular, look at Figure 2.\n\nA refractory material such as Ti is evaporated onto a relief structure in\nresist, as depicted schematically below:\n\nW\nd\nsubstrate\nresist\nevaporant\nelectron source (electrons are deflected\n270 deg by a magnetic field)\nhearth\ne's\nD\n\nThe source diameter, d, is 1.0 mm, the source-to-substrate distance, D, is\n500 mm, and the pattern area on the substrate has a diameter, W, of 2.0\ncm. A line-of-sight from the center of the source to the center of the\nsubstrate is perpendicular to the substrate.\n\nThe resist profile is as sketched:\n\nA) Assuming atoms stick where they land (i.e., there is no surface\nmigration) calculate, for regions in the center of the substrate, the\nthickness of material on the resist sidewalls after deposition of 100\nnm on the substrate.\nAns. Consider first an elementary point source that emits evaporant\nequally in all directions, i.e., isotropic emission. In order to calculate the\namount of sidewall coating, consider two infinitesimally small surface\nareas, one normal to the line-of-sight from the point source and one\noblique to the line-of-sight:\n\nθ\nsurface element\npoint source\noblique\nincidence\nnormal\nincidence\n,\n\nThe deposit thickness, to, on the oblique surface is related to the deposit\nthickness on the normal surface, tn, by\n\nto = tn cos θ\n\nFor an extended source we can calculate the deposit thickness on any\noblique surface as follows:\n\nto\n=\n\n∫\nmax\nmin\nd\n\ncos\nn\nt\nθ\nθ\nθ\nθ\n= (\n) ∫\n-\nmax\nmin\nd\n\ncos\nt\nmin\nmax\nn\nθ\nθ\nθ\nθ\nθ\nθ\n\nIn effect, we are assuming that the extended source can be considered a\ncontinuous distribution of equivalent point sources.\n\nFor the part of the substrate that is on axis, the following sketch (not\ndrawn to scale) applies:\n\nsubstrate\nmm\nθ min\nθmax\nresist\nD = 400m\nsource\nm\n\n500 mm\n\nθmax =90deg=π /2=1.571rad\n\n(\n)\ndeg\n.\n.1\n.1\n/\n\n5.0\n.1\nmin\n=\n=\n×\n-\n=\n-\n=\n-\nrad\nmm\nmm\nrad\nθ\n\nTherefore,\n\nto = 100nm/ 1.571-1.570\n(\n)\n[\n]\n1.570\n1.571\n∫cosθ dθ\n\nBecause the range of the integral is so small we can approximate it:\n\nto = 100 nm [cos(1.5705)] = 0.03 nm\n\nto = 0.03 nm!\n\nThis thickness would not be a monolayer on a perfectly smooth surface.\nHowever the sidewall of a resist structure is far from smooth, having a\nroughness of about 5nm. Hence, the film on the sidewall will certainly\nnot be continuous.\n\nB) Calculate the thickness of sidewall coating for regions at the edge of\nthe substrate.\nAns. For the off-axis part of the problem, the following sketch (not\ndrawn to scale) applies:\n\n0.5 mm\n\n10 mm\nθmin\nθmax\nD = 400 mm\nsource\n1 mm\n\n10 mm\n0.5 mm\n\nθmin = 1.571 rad - (10.5 mm/ 500 mm) = 1.550 rad = 88.8 deg\n\nθmax = 1.571 rad - (9.5 mm/ 500 mm) = 1.571 - 1.90 × 10-2 = 1.552 rad =\n88.9deg\n\nThe thickness of deposit on the sidewall is calculated as follows\nto = [100 nm/(1.552- 1.550)]\ncos θ dθ\n∫\n.1\n.1\n\nto = 100 nm [cos (1.551)] = 2 nm\n\nThis may be thick enough to form a continuous film on a smooth\nsurface. However, the surface of a resist sidewall is rough on the scale\nof 5 nm and hence the 2 nm deposit would not be continuous.\n\nC) Calculate the sidewall coating if the deposited material does exhibit\nsurface migration such that the opening at the top of the resist is\ngradually pinched off as the deposited material accumulates. This\nphenomenon is depicted in the following graphic. Hint: make\nsimplifying assumptions about how the material builds up and\npinches off the opening.\n\nIf the deposited material is mobile and forms an overhang, depicted in\nthe sketch as a 45 degree buildup, the sidewall coating will be reduced\nbelow what we calculated above. Let's consider when the deposit will\nbe cut off, first for the on-axis case with material arriving from the\nfurthest extreme of the 1.0 mm-diameter source.\n\nOn-axis case (not drawn to scale)\nmax angle at which some\nsidewall coating will\noccur\n\nIn this case the maximum angle of incidence is given by\n\n0.5 mm / 500 mm) = 1 × 10-3 rad\n\nTherefore, deposition on the sidewall will be fully cut off when the\noverhang extends out a distance given by\n\n100nm X 1.0 × 10-3 = 0.1 nm\n\nThis will occur after only 0.1 nm out of the total of 100 nm has been\ndeposited. In this case the amount of material deposited on the sidewall\nis given by\n\n(0.03 nm) (0.1 / 100) = 0.00003 nm; which is clearly negligible!\n\nNext, consider the off-axis case and the maximum angle of deposition.\n\nOff-axis case (not drawn to scale)\nmax angle at which some\nsidewall coating will\noccur\n\nThe maximum angle indicated is now given by (10.5 mm / 500 mm) =\n0.02.\nDeposition will be cut off when the overhang extends out a distance of\n\n(100nm) (0.02) = 2.1 nm\n\nThat is, after only 2.1 has been deposited. Thus, as illustrated in the\nmicrograph, there is no sidewall coating.\n\n(6)\nRead the article, \"Immersion zone-plate-array lithography,\"\nby D. Chao, A. Patel, T. Barwicz, H. I. Smith and R. Menon, J. Vac.\nSci. Technol. B 23(6) pp2657-2661 (2005).\n\nA) What is the reason for wanting to obtain a Pi phase shift through\nthe zones? Explain your answer.\nThe purpose of the pi phase shift is to maximize the focusing\nefficiency, i.e., maximize the number of photons into the first-order\nfocus. By having the phase of the transmitted light differ by pi radians\nin alternate zones, one eliminates the zero order transmission and the\nenergy that would otherwise go into the zero order goes into the other\norders, increasing the efficiency of first order focusing from 10% (the\nvalue for an amplitude zone plate) to about 40% (the value for a pi-\nphase zone plate).\n\nB) Why was Aquasave used on top of the PMMA? What is Aquasave?\nAquasave is a conducting polymer that is water soluble. Its purpose is\nto carry away the charge put in by the electron beam. If there is no\nsuch conducting layer, or insufficient conduction, the sample will\ncharge up and deflect the electron beam from where it is supposed to\nbe.\n\nC) After patterning the zone plate, the Ni was removed. Why did they\nbother to remove the Ni?\nThe purpose of the Ni was to serve as a hard mask for the etching.\nOnce this function is performed one should remove it. If the Ni were\nleft in place we'd have an amplitude zone plate (10% efficiency) rather\nthan a pi-phase zone plate (40% efficient).\n\nD) Why was chrome deposited?\nThe function of the chromium is to block all light that is not incident\non the zone plates, e.g., the light incident on the spaces in between the\ncircular zone plates.\n\nE) What did the Fulton-Dolan process accomplish?\nThe Fulton-Dolan process enables one to remove by electrochemical\nmeans the chromium that is not electrically continuous with that on\nthe periphery of the substrate. That is, all the chromium within the\ncircular zone plates is etched away while that in between the zone\nplates is retained.\n\nF) Given that the zone plates have a numerical aperture of 1.14 in\nwater, calculate the spatial period of the outermost zones, and\ncompare this with the finest spatial period achieved in the\nlithography.\nWe know from lecture 2 that for normal-incidence illumination\n\np = λ / NA = 400 nm/ 1.14 = 351 nm.\n\nThe finest period achieved with the lithography was 2 x 1.15nm = 230\nnm. It is not surprising that we can achieve a finer period in\nlithography than is present in the zone plate. In fact, the theoretical\nlimit for the finest period would be p/2, or 175 nm. However, this\nwould be at zero contrast and hence it is not really achievable. The\ncontrast in the image that produced the 230 nm period was very low; it\nrepresented the practical limit.\n\nG) Given that the zone plates designed for the 400 nm exposing\nwavelength and those designed for the HeNe wavelength (632.8\nnm) were made in the same material and located on the same\nsurface, what was the approximate phase shift for the HeNe\nradiation?\nIf we assume that the refractive index is the same at 400 nm and at\n632.8 nm then the phase shift, δφ, for the 632.8 nm light would be\n\nδφ = (180deg) ( 400nm/632.8 nm) = 114deg.\n\nH) Calculate the spatial period of the outermost zones of the zone\nplates designed for operation at the HeNe wavelength (632.8).\nActually, this is an ill posed or trick question; we're given the focal\nlength and the wavelength, but no other information. We would need\nto be given additional information to answer it. For example, we could\nbe given the diameter of the zone plate. For a fixed focal length, the\nspatial period of the outermost zones would get finer as the diameter is\nincreased.\n\nI) Explain in a few words how the point-spread function of the zone\nplate was measured experimentally.\nFor a fixed development time, we measure the diameter of the spot\ndeveloped in the resist as a function of exposure time. We then plot\nthe reciprocal of exposure time versus the spot diameter. This is\nequivalently the experimental point spread function.\n\n(7)\nRead the article \"Hybrid optical maskless lithography: scaling\nbeyond the 45 nm node\" by M. Fritze et al, J. Vac. Sci. Technol. B\n23(6):2743, Nov/Dec 2005, and then answer the following questions:\n\nA) According to this article, what is the main argument in favor of\ncombining interference lithography and projection lithography?\nWhat are the limitations in terms of applying this technology to\nnanolithography markets?\n\nInterference lithography can provide a regular grid with small features\n(limited to λ/2NA) without distortions and need to RET and other complex\ncorrection techniques. Subsequently, optical projection lithography of larger\nfeatures is used to remove parts of the previously written regular grid, finally\nresulting in the desired pattern. The assumption is that the second step will\nonly require large features, and therefore the need for corrections will be\nminimal. The obvious disadvantage is that, with this method, writing is\nlimited to regular \"Manhattan\" geometries, which are reliably found only in\nelectronics.\n\nB) In page 2744, first paragraph, the authors state about interference\nlithography that \"Depth of focus, in principle infinite, can be quite\nlarge in practice, and is limited mainly by the coherence length of\nthe laser source.\" Justify this statement using basic Optics, and\n\nname at least one additional reason that limits the depth of focus of\na real-life interference lithography system.\n\nIn an ideal, monochromatic (temporally coherent) interference lithography\nsystem, interference fringes of perfect contrast are obtained throughout the\nregion of overlap of the interfering beams, which can in principle be infinite.\nIn actuality, all light sources, including lasers, have limited temporal\ncoherence (i.e., they are not perfectly monochromatic.) Interference occurs\nonly within a range equal to the coherence length of the source. Outside that\nregion, the interference contrast gradually drops and so writing becomes\nimpossible. Typical coherence lengths for 193nm lasers are in the range of a\nfew hundred micrometers to millimeters, so the \"depth of focus\" specified by\ncoherence is much longer than the depth of focus of a high-NA imaging lens\n(typically a few micrometers.)\n\nC) According to Figure 3(b), process latitude is more relaxed for\nimmersion systems than \"dry\" systems. Explain qualitatively why.\n\nThe exposure latitude requirement originates from the narrowing of\ninterference lines adjacent to a trimmed feature due to the diffraction\nbroadening (this is explained in Figure 2.) High-NA systems, especially using\nimmersion, are subject to less severe diffraction artifacts; therefore, the\nprocess latitude is better.\n\nD) Propose a technique that would improve the process latitude even\nfurther than Figure 3(b) suggests.\n\nResolution Enhancement Techniques, e.g. serifs, could be used to improve the\nprocess latitude. This is because the edges of the trimmed features result in\nnarrowing of neighboring lines; therefore, by proper shaping of the edges of\nthe trimmed features the narrowing can be eliminated or reduced. However,\nthe use of RET would annul the whole purpose of using HOMA, which is to\navoid excessively complicated RET by combining interference lithography\nand projection lithography.\n\n(8)\nIn this problem, we will examine the effects of numerical aperture and\nprocess latitude on the quality of patterns produced by optical projection\nlithography. To perform the simulations, you need to download all the\nMatlab files from the MIT server) into the same directory in your computer. The code\nshould work with Matlab in any platform, such as Windows, Linux,\nMacintosh, etc.\n\nThe main function is demo_nested.m, which performs the following: (1)\ndefines a pattern of \"nested L's\" to be printed on a substrate [the nested\nL's are often used in tests of new lithographic tools]; (2) simulates the\neffect of diffraction due to the limited aperture of two optical systems, one\nwith high NA=0.85 and the other with low NA=0.2, using both coherent\nand incoherent illumination; (3) simulates the \"clipping\" effect of the\nphotoresist on the pattern that is actually exposed on the wafer.\n\nYou can modify the numerical aperture by changing the first argument of\nthe circ() function call in lines 34-35 of demo_nested.m. The photoresist\neffect is simulated in lines 50-54. The given function photores2.m\nrepresents a low-threshold high-contrast resist. You can also change the\nphotoresist exposure function by replacing photores2.m with\nphotores.m, photores3.m or you can make up your own photoresist\nfunctions.\n\nA) Comment as thoroughly as you can on the difference between the\nfour patterns that are generated by the function demo_nested.m as\ngiven.\n\nCoherent exposure has more ringing; incoherent has lower contrast.\nThese observations are even more obvious at lower NA.\n\nB) Which form of illumination, coherent or incoherent, would require\nmore serifs to be corrected?\n\nIncoherent.\n\nC) Which form of illumination, coherent or incoherent, has the lowest\ncontrast? Justify your observation from basic optical principles.\n\nIncoherent, because of the MTF rolloff towards higher frequencies.\n\nD) Repeat the simulation with even lower NA=0.1, and notice that the\ndifference with NA=0.2 is rather drastic for both coherent and\nincoherent illumination. Justify your observation from basic optical\nprinciples.\n\nYou observe that the nested Ls almost merge with strong ringing in the\ncoherent case, and merge totally in the incoherent case. The drastic\ndifference wrt the previous case is because the line spacing 0.8μm\n\nworks out to be below the Rayleigh resolution 1.22λ/(NA) of the\nsystem for NA=0.1, whereas it is just above for NA=0.2\n\nE) Is the performance of photores3.m better or worse than\nphotores2.m with the low NA system? Why, and how could you\nmake it even better? What is the tradeoff that you face as you try to\ntune the photoresist response for low NA?\n\nThe threshold is higher in photores3.m than photores2.m, and so\nthe former rejects better the high intensities near the line boundaries.\nHowever, photores3.m is not perfect either because it has lower\ncontrast than photores2.m. Ideally, we should aim for the highest\nthreshold possible and the highest sharpness, but then we would be\ngiving up process latitude.\n\n(9)\nRead the papers M. D. Austin, H. Ge, W. Wu, M. Li, Z. Yu, D. Wasserman,\nS. A. Lyon, and S. Y. Chou, \"Fabrication of 5 nm linewidth and 14 nm\npitch features by nanoimprint lithography,\" Appl. Phys. Lett., vol. 84, pp.\n5299-301, 2004. and:\n\nA) Provide an overview of the basic fabrication method--use sketches\nand short text descriptions.\n\nB) What are the various factors that contribute to limit the ultimate\nresolution of this technique?\n\nAnswer: (1) accuracy in growth (atomic level); (2) stretching and\ndistortion of imprint polymer; (3) intermolecular bonding length scales\nin polymer; (4) interatomic bonding lengths in polymer.\n\nC) Now read the paper [F. Hua, Y. G. Sun, A. Gaur, M. A. Meitl, L.\nBilhaut, L. Rotkina, J. F. Wang, P. Geil, M. Shim, J. A. Rogers, and\nA. Shim, \"Polymer imprint lithography with molecular-scale\nresolution,\" Nano Lett, vol. 4, pp. 2467-2471, 2004]. Express in your\nown words (you may use sketches) the basic idea of their\nfabrication method.\n\nD) Estimate the width of the features in figure 2a-d. Is this consistent\nwith a CNT dimension? Would you expect it to be? Why?\n\nANSWER: 2a: 17 nm, 2b: 33 nm, 2c: 50 nm, 2d: 50 nm. This is not\nconsistent with a CNT dimension. But we don't expect it to be\nbecause the image is convolved with the AFM tip dimension.\n\nE) Hypothesize the origin of the difference in widths between the\nfigures. Suggest an experiment to test your hypothesis.\n\nANSWER: presumably the tip was either wearing out or being damaged as\nthe experiments went on. The difference is too large to be explained\nby any other effect (expecially given the TEM data). They could have\ngone back to measure the first sample again at the end of the\nexperiment.\n\nF) Now look at figure 3 b and c. How did they decorate the image to\nimprove the contrast? Draw a sketch that clarifies what exactly is\non the substrate during the imaging process. How does the imaged\nlinewidth relate to the dimensions of the CNT and its replica?\nExplain the observed asymmetry in the linewidth profile (darker on\none side of the feature than the other). What additional\ninformation would it have been good to know about the decoration\nmethod?\n\nANSWER: roughly yes, it is consistent with a CNT. They use shadow\nevaporation of metal to decorate the image. The imaged linewidth\ndepends on the angle of evaporation, which we are not told,\ntherefore we don't know the right scaling factor to use. The\nasymmetry comes form the fact that we are looking at the feature\n(Which is presumably absorbing more electrons) and its shadow\n(which is presumably transmitting more electrons). We are told\nillumination is with TEM, so the shadow should be the bright part,\nthe feature should be the dark part. If illumination were STEM, the\nshadow would appear dark in the image (no scatterers present) while\nthe CNT would appear bright.\n\nG) Sketch an idealized figure of the profile (the insets in the figure 3b\nand 3c) and indicate on it the best dimension to use to indicate the\nwidth of the CNT. If instead of TEM, we assume these images are\nannular-dark-field STEM images, how does that change the\ninterpretation of the image?\n\nAnswer: any well-reasoned answer is acceptable. But what I had in mind is\nthat the Austin paper actually demonstrates pattern transfer into\nunderlying material, while the Hua paper is limited to relief structures\nin PolyUrethane.\n\nH) Compare these two papers: which of the techniques is likely to be\nof greater practical utility in the long run? Why?"
    },
    {
      "category": "Resource",
      "title": "final.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-781j-submicrometer-and-nanometer-technology-spring-2006/01e9a704ae55647c93c8cee1f85a08b2_final.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\n\n6.781/2.391J\nTAKE-HOME FINAL ASSIGNMENT, 2006\n\nHanded out Thursday, April 27, 2006\n\nDue no later than\n5 PM on May 18, 2006\n\nThis is a take-home assignment. You may use any text, notes, etc. You\nmay speak to Profs. Smith, Berggren, Barbastathis, or the TA's , either in class or\noutside of class, in order to clarify any of the problems. You may not consult\nwith others on the solution of problems.\n\nIn the solutions to any of the problems, you may make simplifying\nassumptions, such as square pixels, square beams, etc. Assume that electrons,\nphotons or gas molecules arrive on a surface independently and thus obey\nPoisson statistics (same assumption as we made in class and homework). Please\nbe brief! Note that some superfluous information may be provided in some of\nthe problems.\n\n(1)\nPlease answer true/false and give a brief explanation for the following\nquestions:\n\nA) True or false, chemically-amplified resists (CARs) are useful\nbecause they are very resistant to airborne contamination.\n\nB) True or false, in a scanning-electron-beam system, such as an SEM,\na field-emission source can be used to produce a finer focal spot\nthan can be achieved with a thermionic source, assuming the\ncurrent is the same in both cases.\n\nC) True or false, the only current application of scanning-electron-\nbeam lithography in industry is research and development.\n\nD) True or false, a good electron beam lens system can have a\nnumerical aperture (NA) up to 0.6.\n\nE) True or false, Polymethyl methacrylate (PMMA) can be used as a\nresist in deep-UV, electron-beam, and x-ray lithography.\n\nF) True or false, the ability of a Linnik interferometer to resolve small\nsteps on a surface is given by the optical system's depth of focus,\nλ/NA2.\n\nG) True or false, a typical atomic-force microscope (AFM) cannot\nresolve individual atoms.\n\nH) True or false, metal contaminants are usually removed from a\nsample by using ozone that oxidizes the metal.\n\nI) True or false, in optical-projection lithography (OPL), incoherent\nillumination can yield higher resolution than coherent illumination\ncan, but the contrast is reduced for lower spatial frequencies.\n\nJ) True or false, some optical microscopy methods can be used to\nresolve features much smaller than the wavelength of light\n\nK) True or false, contact lithography cannot yield as high a resolution\nas optical projection lithography (OPL) because there is additional\ndemagnification in OPL.\n\nL) True or false, in optical and electron-beam lithography one can\nachieve alignment much better than the system resolution.\n\n(2)\nRead the article \"Robust Shadow-Mask Evaporation via\nLithographically-Controlled Undercut,\" by B. Cord, C. Dames, K. K. Berggren,\nand J. Aumentado.\n\nA) Using the double-Gaussian point-spread function data in the paper,\nplot the cross-sectional, normalized dose profiles at the base of the\nPMMA layer and at the substrate for a grating of 250 nm period\nand 50 nm linewidth exposed in a PMGI/PMMA bilayer like the\none in the paper. Assume that the length of the lines in the grating\nis much greater than their width and that the total width of the\ngrating is 25 μm.\n\nB) Assuming perfect mass transfer during the development process\nand a nominal dose of 500 μC/cm2, estimate how long it will take\nfor lateral PMGI development to completely undercut the PMMA\nlines in the center of the grating in (A); i.e. approximately what\ndevelopment time will cause the entire grating structure to begin to\nMicrosystems Technology Research Report, Massachusetts\nInstitute of Technology (September 2006).\n\ncollapse?\n\nC) Repeat (B), this time taking into account the diffusion-limited\nnature of the development process.\n\nD) Will increasing the grating period to 500 nm and the linewidth to\n100 nm cause the lateral development rate to increase or decrease?\nExplain your answer.\n\nE) Show that, in the structure described in (A), the proximity effect is\nnegligible compared to mass transfer in determining the rate of\nundercut development.\n\n(3)\n\nA) What is meant by macroscopic nonuniformity?\n\nB) What is meant by microscopic nonuniformity?\n\nC) What is the mean-free path of a Cl2 gas molecule at 7 m torr\nassuming the ideal gas law?\n\nSuppose we want to etch a lithographically patterned Si substrate using\nCl2 gas in a reactive-ion etching system operating at 7 m torr, 100 watts\ninput power, a peak-to-peak voltage of 75 V, and a bias voltage of 25V.\n\nThe \"dark space\" between the main body of the plasma and the electrode\non which the substrates are to be etched is about 7 mm thick. Assume that\nthe molecules and ions within the main body of the plasma are at room\ntemperature, and that ions acquire the full 25 eV as they are accelerated\nacross the dark space.\n\nD) Is an ion likely to experience a collision with a molecule in crossing\nthe dark space?\n\nE) Is an ion likely to experience multiple collisions in crossing the dark\nspace?\n\nF) Why do you think there is a dark space (very little emission of\nlight) between the main body of the plasma and the powered\nelectrode?\nRead the article: Giapis, Konstantinos, Geoffrey Scheller, Richard Gottscho,\nWilliam Hobson, and Yong Lee. Microscopic and macroscopic uniformity control\nin plasma etching. Appl. Phys. Letter 57, no. 983 (1990).\n\nG) Calculate the velocity of a 25 eV Cl ion and compare this to the\nmolecule's thermal velocity. What is the ratio of the two velocities?\n\nH) From the ratio of velocities can you estimate the deviation from 90\ndeg of the angle of incidence of the ions on the substrate? Do you\nbelieve this is connected with the highly directional etching\nobtained in RIE when the isotropic component of etching is absent\nor very small?\n\nI) Calculate the arrival rate in number/cm2 sec of neutral Cl2\nmolecules at the surface of the substrate.\n\nJ) Assume that the substrate is cooled so that no spontaneous or\nisotropic etching occurs, that each arriving Cl2 molecule sticks and\ndissociates, and that each bombarding ion gives rise to the removal\nof 2 Si atom, and that there is always sufficient Cl adsorbed on the\nsurface , i.e., that the Cl2 arrival rate does not limit the etching rate.\nIf the etch rate is 10 nm/s, what is the ion current density.\n\nK) Is the assumption that the arrival of Cl2 molecules on the surface is\nnot rate limiting valid?\n\n(4)\nAssume a bond in a resist takes 5 eV to break, and that the absorbed\nphoton energy in its entirety goes into bond breaking. Assume that in\nevery 1 nm3 of material there are 10 bonds that must be broken in order\nfor a material to develop. Assume that the vertical absorption profile of\nthe incident radiation in the resist is uniform (i.e. no z-dependence to the\nabsorption),\n\nA) Calculate the sensitivity of the resist in units of eV/nm3\n\nB) Calculate the number of quanta per nm3 required to achieve this\nsensitivity as a function of wavelength for photons ranging from 4\nnm to 400 nm. Make a chart of this function\n\nC) Assume that 100 quanta/nm2 are required for relatively noise-free\nexposures. Make a chart of resist thickness vs. photon wavelength\nand indicate the region on this graph where shot noise is low\nenough to permit ~ 1nm line-edge roughness in the film.\n\nD) Typical proposals for EUV lithography suggest that a resist with a\nsensitivity of 5 mJ/cm2 will be used. Suppose a 50-nm-thick film\n\nwill be used. The EUV wavelength is 13.4 nm. First convert the\nresist sensitivity to eV/nm2, then photons/nm2, and then eV/nm3\nand photons /nm3.\n\nE) What resist sensitivity (in mJ/cm2) is required to achieve 1 nm line-\nedge roughness based on shot noise? Typically EUV systems are\nlimited in the source power that they can provide. What would be\nthe consequences of this result on the manufacturing throughput of\nEUV systems (relative to the planned 5 mJ/cm2 sensitivity).\n\nF) If a resist sensitivity of 5 mJ/cm2 is to be achieved, what is the\nminimum pixel size that can be used and still maintain acceptable\nshot-noise performance?\n\n(5)\nThis is a problem dealing with the liftoff process. As a preliminary to\nsolving this problem, you should look at the article, \"Fabrication of large\narea subwavelength antireflection structures on Si using trilayer resist\nnanoimprint lithography and liftoff\" by Z. Yu, et al, J. Vac. Sci. Technol. B,\nvol 21, pp2874-2877 (2003). In particular, look at Figure 2.\n\nA refractory material such as Ti is evaporated onto a relief structure in\nresist, as depicted schematically below:\n\nW\nd\nsubstrate\nresist\nevaporant\nelectron source (electrons are deflected\n270 deg by a magnetic field)\nhearth\ne's\nD\n\nThe source diameter, d, is 1.0 mm, the source-to-substrate distance, D, is\n500 mm, and the pattern area on the substrate has a diameter, W, of 2.0\ncm. A line-of-sight from the center of the source to the center of the\nsubstrate is perpendicular to the substrate.\n\nThe resist profile is as sketched:\n\nA) Assuming atoms stick where they land (i.e., there is no surface\nmigration) calculate, for regions in the center of the substrate, the\nthickness of material on the resist sidewalls after deposition of 100\nnm on the substrate.\n\nB) Calculate the thickness of sidewall coating for regions at the edge of\nthe substrate.\n\nC) Calculate the sidewall coating if the deposited material does exhibit\nsurface migration such that the opening at the top of the resist is\ngradually pinched off as the deposited material accumulates. This\nphenomenon is depicted in the following graphic. Hint: make\nsimplifying assumptions about how the material builds up and\npinches off the opening.\n\n(6)\nRead the article, \"Immersion zone-plate-array lithography,\"\nby D. Chao, A. Patel, T. Barwicz, H. I. Smith and R. Menon, J. Vac.\nSci. Technol. B 23(6) pp2657-2661 (2005).\n\nA) What is the reason for wanting to obtain a Pi phase shift through\nthe zones? Explain your answer.\n\nB) Why was Aquasave used on top of the PMMA? What is Aquasave?\n\nC) After patterning the zone plate, the Ni was removed. Why did they\nbother to remove the Ni?\n\nD) Why was chrome deposited?\n\nE) What did the Fulton-Dolan process accomplish?\n\nF) Given that the zone plates have a numerical aperture of 1.14 in\nwater, calculate the spatial period of the outermost zones, and\ncompare this with the finest spatial period achieved in the\nlithography.\n\nG) Given that the zone plates designed for the 400 nm exposing\nwavelength and those designed for the HeNe wavelength (632.8\nnm) were made in the same material and located on the same\nsurface, what was the approximate phase shift for the HeNe\nradiation?\n\nH) Calculate the spatial period of the outermost zones of the zone\nplates designed for operation at the HeNe wavelength (632.8).\n\nI) Explain in a few words how the point-spread function of the zone\nplate was measured experimentally.\n\n(7)\nRead the article \"Hybrid optical maskless lithography: scaling\nbeyond the 45 nm node\" by M. Fritze et al, J. Vac. Sci. Technol. B\n23(6):2743, Nov/Dec 2005, and then answer the following questions:\n\nA) According to this article, what is the main argument in favor of\ncombining interference lithography and projection lithography?\nWhat are the limitations in terms of applying this technology to\nnanolithography markets?\n\nB) In page 2744, first paragraph, the authors state about interference\nlithography that \"Depth of focus, in principle infinite, can be quite\nlarge in practice, and is limited mainly by the coherence length of\nthe laser source.\" Justify this statement using basic Optics, and\nname at least one additional reason that limits the depth of focus of\na real-life interference lithography system.\n\nC) According to Figure 3(b), process latitude is more relaxed for\nimmersion systems than \"dry\" systems. Explain qualitatively why.\n\nD) Propose a technique that would improve the process latitude even\nfurther than Figure 3(b) suggests.\n\n(8)\nIn this problem, we will examine the effects of numerical aperture and\nprocess latitude on the quality of patterns produced by optical projection\nlithography. To perform the simulations, you need to download all the\nMatlab files the MIT server) into the same directory in your computer. The code\nshould work with Matlab in any platform, such as Windows, Linux,\nMacintosh, etc.\n\nThe main function is demo_nested.m, which performs the following: (1)\ndefines a pattern of \"nested L's\" to be printed on a substrate [the nested\nL's are often used in tests of new lithographic tools]; (2) simulates the\neffect of diffraction due to the limited aperture of two optical systems, one\nwith high NA=0.85 and the other with low NA=0.2, using both coherent\nand incoherent illumination; (3) simulates the \"clipping\" effect of the\nphotoresist on the pattern that is actually exposed on the wafer.\n\nYou can modify the numerical aperture by changing the first argument of\nthe circ() function call in lines 34-35 of demo_nested.m. The photoresist\neffect is simulated in lines 50-54. The given function photores2.m\nrepresents a low-threshold high-contrast resist. You can also change the\nphotoresist exposure function by replacing photores2.m with\nphotores.m, photores3.m or you can make up your own photoresist\nfunctions.\n\nA) Comment as thoroughly as you can on the difference between the\nfour patterns that are generated by the function demo_nested.m as\ngiven.\n\nB) Which form of illumination, coherent or incoherent, would require\nmore serifs to be corrected?\n\nC) Which form of illumination, coherent or incoherent, has the lowest\ncontrast? Justify your observation from basic optical principles.\n\nD) Repeat the simulation with even lower NA=0.1, and notice that the\ndifference with NA=0.2 is rather drastic for both coherent and\nincoherent illumination. Justify your observation from basic optical\nprinciples.\n\nE) Is the performance of photores3.m better or worse than\nphotores2.m with the low NA system? Why, and how could you\nmake it even better? What is the tradeoff that you face as you try to\ntune the photoresist response for low NA?\n\n(9)\nRead the papers M. D. Austin, H. Ge, W. Wu, M. Li, Z. Yu, D. Wasserman,\nS. A. Lyon, and S. Y. Chou, \"Fabrication of 5 nm linewidth and 14 nm\npitch features by nanoimprint lithography,\" Appl. Phys. Lett., vol. 84, pp.\n5299-301, 2004. and:\n\nA) Provide an overview of the basic fabrication method--use sketches\nand short text descriptions.\n\nB) What are the various factors that contribute to limit the ultimate\nresolution of this technique?\n\nC) Now read the paper [F. Hua, Y. G. Sun, A. Gaur, M. A. Meitl, L.\nBilhaut, L. Rotkina, J. F. Wang, P. Geil, M. Shim, J. A. Rogers, and\nA. Shim, \"Polymer imprint lithography with molecular-scale\nresolution,\" Nano Lett, vol. 4, pp. 2467-2471, 2004]. Express in your\nown words (you may use sketches) the basic idea of their\nfabrication method.\n\nD) Estimate the width of the features in figure 2a-d. Is this consistent\nwith a CNT dimension? Would you expect it to be? Why?\n\nE) Hypothesize the origin of the difference in widths between the\nfigures. Suggest an experiment to test your hypothesis.\n\nF) Now look at figure 3 b and c. How did they decorate the image to\nimprove the contrast? Draw a sketch that clarifies what exactly is\non the substrate during the imaging process. How does the imaged\nlinewidth relate to the dimensions of the CNT and its replica?\nExplain the observed asymmetry in the linewidth profile (darker on\none side of the feature than the other). What additional\ninformation would it have been good to know about the decoration\nmethod?\n\nG) Sketch an idealized figure of the profile (the insets in the figure 3b\nand 3c) and indicate on it the best dimension to use to indicate the\nwidth of the CNT. If instead of TEM, we assume these images are\nannular-dark-field STEM images, how does that change the\ninterpretation of the image?\n\nH) Compare these two papers: which of the techniques is likely to be\nof greater practical utility in the long run? Why?"
    },
    {
      "category": "Assignment",
      "title": "pset_01.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-781j-submicrometer-and-nanometer-technology-spring-2006/cddafc793ffab3118541fd39ee758476_pset_01.pdf",
      "content": "6.781\nHomework set #1\n1. Handling the huge information content of nanometer-length-scale patterns\npresents a major engineering challenge. We want to do a crude, order-of\nmagnitude, calculation of the rate at which information is processed by a state-of\nthe-art semiconductor IC fabrication tool and compare this to the state-of-the-art\nof optical fiber communications.\na. What is the information content (measured in \"bits\") of a 300-mm\ndiameter wafer whose surface has been divided into 100-nm-square pixels,\neach of which can be in one of two states (\"part of the pattern\" or \"not part\nof the pattern\"). (Note: this question equivalently asks, \"How many digits\nwould a binary number have to have in order to represent any given state\nof the wafer?\").\nb. Suppose the tool is producing 100 of these wafers per hour, each with a\nnew pattern. What is the information throughput, in bits per second, of the\ntool. Compare this to the capacity of a typical office LAN connection (100\nMbit/sec). What about compared to a state-of-the art wavelength-division\nmultiplexed optical fiber capable of data rates of 1 Terabit/sec?\nc. Given that such a tool costs $25M to buy, what is the cost in $/(bit/sec)?\nd. Assume a wafer will go through ~ 10 patterning steps (in real fabrication\nprocesses, the number is more like 20) as it is manufactured. At the end of\nthese steps, assume on average it will have 10 defects per wafer (this is\nconsidered mediocre performance). Calculate what this defect rate\nrepresents in terms of a \"bit-error rate\" (i.e. calculate the fraction of the\nbits that contain errors). Compare this to the typical bit-error rate of a good\nfiber-optic communication channel (~ 10-12).\ne. In reality, all the pixels on a wafer are not independent, in fact the same\npattern is repeated many times across the wafer in a square-grid array of\nchips. If each chip is 30 mm on a side, how many 100-nm-square pixels\nare in a chip?\nf. Compare the result of d to the memory of a state-of-art memory chip.\nFrom this comparison, calculate how much area a single bit of memory on\nthe memory chip occupies.\ng. To make a comparison to a more familiar item: assume you use a desktop\ninkjet printer to print an image consisting of random, uncorrelated pixels\nthat cover an entire 8.5\" x 11\" page at the printer's maximum resolution,\nwhat is the resulting information throughput of the printer, in bits/sec?\nh. If the printer cost $100, what is the cost in $/(bits/sec). Compare this to\nyour result for c.\n\n6.781\n2. Read the two papers in your handout for lecture #1: \"There's plenty of room at\nthe bottom\" by Feynman, and \"An approach to microminiature printed systems\"\nby Buck and Shoulders. Comment on the differences in vision of these two\npapers.\n\nReferences\n\nProblem 2\n\nFeynman, Richard P. \"There's Plenty of Room at the Bottom.\" Journal of\nMicroelectromechanical Systems 1 (1992): 60-66.\n\nBuck, D. A., and K. R. Shoulders. \"An Approach to Microminiature Printed Systems.\"\nEastern Joint Computer Conference (July 1959): 55-59."
    },
    {
      "category": "Assignment",
      "title": "pset1_soln.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-781j-submicrometer-and-nanometer-technology-spring-2006/9e8b748250690eeaf354c633ff79c9e5_pset1_soln.pdf",
      "content": "Homework Set #1 Solution\nProblem #1\na) Here we assume 100-nm-square pixels (100 nm per side)\nApix = 1002 nm = 1e - 14 m2\nA\nAwafer = π300 / 4 mm2 = 071\n.0\nm2\nwafer\nN pixels =\n=\n7e\nApix\nbits\nbits\nb) We know the bits per hour is\n*\n100 N pixels =\n⇒\ne\ne\nhr\nsec\nCompare to LAN connection K =\ne\n= 20000 (much greater)\n100 e\nCompare to multiplexed optical fiber K = e\n= 2 (similar magnitude)\n1 e\nc) Cost in $/(bit/sec) is calculated directly from what we found in part b when the\ntools costs $25M\n$\n$\ne\n≈ 1e - 4\nbits\nbits /sec\ne\nsec\nd) The bit error rate is 10 / N pixels =\n4.1 e -12 . This is similar to a fiber-optic\ncommunication channel\ne) Similar to part a: N\nchip\npix\n= Achip =\n/\ne\nApix\nf) State of the art memory chip = 500 MB= 4e9 Bits\nN\nApix =\nAchip\n= 0009\n.\nm2\n= 25\n.2\ne - 13 m2\n⇒ Lside ≈ 500 nm\nchip\npix\n/\ne\ng) Assume a 500 dpi black and white printer. The page is approximately 100 square\ninches. Assume that each page can be printed in 10 seconds. Then the\ninformation throughput is given by:\nbits\n10002 bits ×(100 in )/(\nsec\nonds) = 7\n1 e\nin\nsec\n\nh) From part g we get:\n$\n$\n≈ 1e - 5\nbits\ne\nbits /sec\nsec\nThis is a factor of 10 cheaper than that found in part c.\nProblem #2\nIn \"There is plenty of room at the bottom,\" Feynmann presents the potential for\nmanipulation down to the atom by addressing the scaling of physics without much\nconsideration of process constraints. He provides an overview and inspiration for scaling\ndown devices and fabrication methods. Buck and Shoulders present a potential method\nin more detail for achieving a microminiature circuit. This is based on thin-film\nprocessing that has since then become the core of microtechnology."
    },
    {
      "category": "Assignment",
      "title": "pset_02.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-781j-submicrometer-and-nanometer-technology-spring-2006/0dadc89ac8b7146a43743f1dcc8b4518_pset_02.pdf",
      "content": "6.781\nHOMEWORK SET #2\n3.\nGiven a lens with a focal length of 100 tm. For an image located 1 cm away\ncalculate the distance to the object and the magnification.\nA second lens is used to reimage the first image. Give a pair of values for So\nand Si that would yield a total magnification of 1000 X.\n4.\nT(x)\nI\n4 i n\nI.U\n-\nIL-j\nI\nI\nI\n-~~\nI\nI\nI\n1-\nI\nt t\n-p/a\n+ p/a\nP\n1) Calculate the Fourier coefficients for the infinite grating sketched above.\n2) Write out the first four terms, and a general expression for Am and Bm.\n3) Plot the spatial frequency spectrum (i.e., coef. magnitude vs. mK)\nfor a = 5, p = 500 nm.\n5.\nGiven that the field distribution in the \"object\" plane is\nE(x) = E [1 + cos (2I/p) x]\n(the so-called aperture function), show that the field distribution in the\nFraunhofer diffraction pattern is the Fourier transform of this aperture function.\nHINT: see p. 495 of Hecht.\n\nNote also:\n,00) ei (k - k')x dx = 2t65(k - k')\nwhere 8(k - k') is the Dirac delta function.\n6.\nThe famous photographer, Ansel Adams, initiated a technique in which a\nvery small aperture (f# = 64) was used to achieve large depth-of-focus in\nphotography. (f#\nf/D ~ 1/2NA, where D is the lens diameter). In this\nway essentially everything in a photograph would be in focus, no matter\nhow near or far away.\nAt an f# of 64 what is the minimum resolvable spatial period? What size\nfilm would be needed to record a 1000 line scene (e.g., 1000 slats of a\ndistant snow fence on a Montana landscape?) What size for a 10,000 line\nscene?\n7.\nCalculate the resolution of a \"camera\" having a diameter of 4 meters\nlocated 100 km above the earth. What is the finest detail at the earth's\nsurface that can be resolved.\n8.\nThe attached sheet depicts a diffraction pattern projected onto a wall\nlocated 10 meters distant when an object is illuminated by a HeNe laser\n(lambda = 632.8 nm). The dimensions on the array of diffraction spots are\nindicated. The object is a glass plate with a pattern in opaque chromium, similar\nto what was demonstrated in class.\nThe intensities of the diffraction spots are left-right symmetric and are as follows:\nspot identification #\nrelative intensity\n1.0000\n0.4053\n·\n0.0000\n0.0450\n0.0000\n0.0162\n0.0000\n0.0083\nIdentify the type of pattern that is on the object, giving the dimensions. No need to\ndraw it, although you may do so. From the relative intensities you should be able to\ngive the actual widths of the features on the object.\n\n-7\n-5\n-4\n-3\n-2\n-1\n+1\n+2\n+3\n+5\n+6\n+7\n-7\n-5\n-3\n-2\n-\n+1\n+2\n+3\n+4\n+5\n+6\n+7\n-7\n-6\n-5\n-4\n-3\n-2\n-1\n+1\n+2\n+3\n+4\n+5\n+6\n+7\nI meter\n10 cm\n*o\no * o e*\n@0 *o * ' ,\n-7\n-6\n-5\n-4\n-3\n-2\n-1\n+1\n+2\n+3\n+4\n+5\n+6\n+7\nCentral spot\n*0 0 o··0\n·0\n0o\n-7\n-6\n-5\n-4\n-3\n-2\n-1\n+1\n+2\n+3\n+4\n+5\n+6\n+7\n0O00*··\n* * 00·0\n-7\n-6\n-5\n-4\n-3\n-2\n-1\n+2\n+3\n+4\n+5\n+6\n+7\n0O 0000\n0 00 0\n-7\n-6\n-5\n-4\n-3\n-2\n-1\n+1\n+2\n+3\n+4\n+5\n+6\n+7\n6.781. #9.97"
    },
    {
      "category": "Assignment",
      "title": "pset2_soln.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-781j-submicrometer-and-nanometer-technology-spring-2006/76638f68d4472495f5ce282df2b8bcc9_pset2_soln.pdf",
      "content": "6.781 Homework #2 Solution\nProblem 3\n⎛1\n1 ⎞\n-1\na)\ns = ⎜\n-\n⎟\n-1\n= ⎜\n⎛\n- 1 ⎞\n⎟\n-1\n= (100 -1) cm\n\n= 0.0101 cm =101μm\no\n⎝0.01cm\n1cm ⎠\nM\n⎝ f\nsi ⎠\n1 = -si = - 1cm\n= -99\ns\n0.0101cm\no\nb)\nM FINAL = M\n\nM\n\n2 =1000 ⇒M = 1000 = -\n\n10.1- si2\n-99\nso2\nAssume that the second lens has the same focal length as the first one. Then:\n⎡\n1 ⎤\n100μm\nso2\n+ si2\n= s\n+ 10.1s\n⇒s\n=100 μm ⎢⎣\n1+ 10.1⎦⎥=110μm\n=\no2\no2\no2\nsi2 =10.1s\n=1.11mm\no2\nProblem 4\nA periodic function with period p can be expanded into Fourier series as follows:\ninf\n( ) = A0 +∑[A cos(mk\n\n) + B sin(mk\n\n)]\nf x\nm\nm\nm=1\np 2\n( ) cos(kmx\n\ndx\n\nA\n\n=\n∫T\n\nx\n)\nm\np -p 2\np 2\n(\n)\nB =\n∫T\n\nx\n\n)sin(kmx\n\ndx\n\nm\np -p 2\n2π\nwith k = p\n\na.\np 2\np\n\na\n\nA =\n∫ T\n\nx\n)\n(\n)\np\nm\n( ) cos(kmx\n\ndx\n\n=\n∫ T\n\nx\n\n)cos(kmx\n\ndx\n\n- p 2\np - p\n\na\n\np\n⎛\n⎛ 2π\n⎞⎞\np a\np a\n⎛ 2πm ⎞\n=\n⎜ sin ⎜\nmx ⎟⎟\n= sinc ⎜\n⎟\np 2πm\np\na\n⎝ a\n⎠\n⎝\n⎝\n⎠⎠ -\np 2\np\n\na\n\nB =\n∫ T x\n)\n(\n)\np\nm\n( ) sin(kmx dx =\n∫ T x )sin(kmx dx\n- p 2\np - p\n\na\n\np\n⎛\n⎛ 2π\n⎞⎞\np a\np a\n= 0\n= p 2πm ⎝\n⎜- cos ⎜⎝ p mx\n⎠⎟\n⎠\n⎟\n-\n⎡\n4 1\n⎛ 2π ⎞\n⎛ 4π ⎞\n⎛ 6π ⎞\n⎤\n(\nb.\nT x ) = a ⎣⎢ 2 + sinc ⎜\n⎟ cos(kx) + sinc ⎜\n⎟ cos(2 kx)sinc ⎜\n⎟ cos(3 kx)⎥\n⎝ a ⎠\n⎝ a ⎠\n⎝ a ⎠\n⎦\nc. The Fourier coefficients can be in different forms depending on the base\nfunctions used. The base functions can be sinusoidal functions, or complex\nexponentials.\nFourier coefficients\n-0.2\n-0.1\n0.1\n0.2\n0.3\n0.4\n0.5\n0.6\n0.7\nA m\nm\n\nFor the base functions we choose for this problem, m ≥ 0.\nProblem 5\n(\n⎡\njk x\n2π\nE x) = E [1 + cos(k x)] = Eo ⎣⎢1+ 1\n2 e\no + 1\n2 e- jkox\n⎦⎥\n⎤ where k = p . A plane wave\no\no\no\ne\nleaving the surface of the object splits into three components: one traveling\nperpendicular to the object's surface and two waves with lateral components\n± jkx . Therefore, a Fraunhofer diffraction pattern formed by these three 'beams'\non a distant screen is simply three spots.\nThe Fourier transform of E( )\nx is\ninf\njkxdx\nF k ∫ ( )\n( ) =\nE x e\n-inf\ninf\ninf\n⎤\n⎡ e jkx\no\no\n= E ⎢∫\ndx + 1\ninf\n∫ e jk xe jkxdx + 1 ∫ e- jk xe jkxdx⎥\n⎣-inf\n2 -inf\n2 -inf\n⎦\n= E[ 2πδ (k) +πδ (k\n\nk\n\n) +πδ (k\n\nko )]\n+\n-\no\nwhich is the same three spots as in the Fraunhofer diffraction pattern.\nProblem 6\nλ\nNA = 2 f#\n⇒ pmin = 2NA\n\n= f#λ. For λ = 500nm, pmin = 500nm × 64 = 32μm. Then\n32mm film is needed to record 1000 slats, and 32cm is needed for 10000 slats.\nProblem 7\nm\nλ\nNA ≈ sinα ≈ 4\n\n= 2 ×10-5. Forλ = 500nm, p\n=\n= 1.25 cm .\n100km\nmin\n2NA\n\nProblem 8\nThe diffraction pattern like this is produced by an orthogonal grid with different\nspatial periods and duty cycles along grid's axes. Both periods can be\ndetermined from the constructive interference conditions for the first diffraction\nλ\n632.8nm\n632.8nm\norder with p = sin α . Then p ≈ 0.1m 10 m = 63μm, and p2 ≈\n= 6.3μm.\n1m 10m\nTo determine the duty cycles, we need to plot out the intensity distribution. From\nthe answer for problem 3 and the class handout on Fourier transforms, we realize\nthat the distribution function is a sinc function with zero crossings at\nm = 2, 4, 6, K . This suggests a 50% duty cycle in the x direction. The intensity in\nthe y direction is a constant, which indicates that the duty cycle in that direction\nis very small, or it is periodic slits."
    },
    {
      "category": "Assignment",
      "title": "pset_03.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-781j-submicrometer-and-nanometer-technology-spring-2006/8bc3e4880ba5edca50d41b1a9ed99999_pset_03.pdf",
      "content": "6.781\nHomework Set #3\n9.\n(Taken from Lecture #3) Show that a, b and c represent standing waves,\nwhere a = EoE*+1 + E* E+1\nb = EoE* -1 + E E-1\nc =E+lE*-1\n+ E*+1 E-1\n10. This homework problem has to do with optical microscopy, specifically,\ndifferential-interference-contrast microscopy and the measurement of\nlateral motions in the nanometer range. My objective in assigning this\nproblem is to allow you to see the impact of clever optics-based techniques\nin modem research. The attached articles from the journal Nature, Vol. 365,\n21 Oct., 1993 (J. Howard, p 720 \"One giant step for kinesin\"; K. Svoboda et\nal. pp 721-727, \"Direct observation of kinesin stepping by optical trapping\ninterferometry\") and Physics Today, p 17, April 1995 are concerned with a\nbasic measurement in cell biology: how far the motor protein kinesin\nmoves when it takes a single step along a microtubule. The stepping is\npowered by the \"fuel\" used within a cell, i.e., adenosine triphosphate (ATP),\nwhich is converted to adenosine diphosphate (ADP) releasing about 0.5 eV.\nThe article by Howard is a summary and explanation of the significance of\nthe technical article by Svoboda et al.\nIt is not necessary to understand the terminology and jargon of cell biology,\nor to read the entire articles to answer this problem; the full articles are\nattached just in case you are interested in seeing the whole picture. (Since\nbiology is now a required course for all MIT undergraduates, this\nassignment is perhaps not totally out of place.)\nThe principle of operation of the optical-trapping interferometer is\nexplained on page 722, and in Fig. 1 of Svoboda. The lateral motion of a\nglass bead, to which the kinesin is attached, is detected.\na) In the simplest possible terms, explain in one brief paragraph, the basic\nprinciple by which lateral motion of a glass bead is detected.\nb) Based on the results of the 100 Hz calibration signal do you believe a 1\nnm displacement can be detected?\nc) Would sensitivity to lateral motion be enhanced if the laser wavelength\nwas changed from the 1064 nm that was used to say half that\nwavelength, 532nm?\n\nHomework Set #3\n-2\nd) Why isn't an electron microscope suitable for this measurement?\n11.\nRead the attached commentary \"Shattering the diffraction\nlimit of light: A revolution in Fluorescence microscopy?\" by Shimon\nWeiss, Vol. 97, PNAS, August 1, 2000.\na) Summarize in as few words as possible the essential elements\nof the scheme.\nb) By what factor is the lateral resolution improved?\nc) By what factor is the axial resolution improved?\nReferences\nProblem 10\nHoward, Jonathan. \"One Giant Step for Kinesin.\" Nature 365 (October 21, 1993):\n696-697.\nSvoboda, Karel, Christoph F. Schmidt, Bruce J. Schnapp, and Steven M. Block.\n\"Direct Observation of Kinesin Stepping by Optical Trapping Interferometry.\"\nNature 365 (October 21, 1993): 721-727.\nLevi, Barbara Goss. \"Measured Steps Advance the Understanding of Molecular\nMotors.\" Physics Today (April 1995): 17-19.\nProblem 11\nWeiss, Shimon. \"Shattering the Diffraction Limit of Light: A Revolution in\nFluorescence Microscopy?\" PNAS 97, no. 6 (August 1, 2000): 8747-8749."
    },
    {
      "category": "Assignment",
      "title": "pset3_soln.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-781j-submicrometer-and-nanometer-technology-spring-2006/9b3983f84ab9ff544aff772f802d125f_pset3_soln.pdf",
      "content": "6.781 Homework #3 Solution\n\nProblem 9\n\n*\n*\n(\n)\n(\n)\n(\n)\n(\n)\n(\n)\n(\n)\n*\n*\n(\n)\n(\n)\n(\n)\n(\n)\n(\n)\n(\n)\ncos(\n)\ncos(\n)\nx\nx\nx\nx\nx\nx\nx\nx\nj k x\nt\nj k x\nt\nj\nt\nj\nt\nj\nk x\nj\nk x\nx\nj\nk x\nt\nj\nk x\nt\nj\nt\nj\nt\nj\nk x\nj\nk x\nx\na\nE E\nE E\nAe\ne\nAe\ne\ne\ne\nA\nA\nk x\nb\nE E\nE E\nAe\ne\nAe\ne\ne\ne\nA\nA\nk x\nc\nω\nω\nφ ω\nφ ω\nφ\nφ\nω\nω\nφ ω\nφ ω\nφ\nφ\nε\nε\nε\nε\nφ\nε\nε\nε\nε\nφ\n+\n+\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n+\n-\n+\n=\n+\n=\n+\n+\n=\n=\n-\n=\n+\n=\n+\n+\n=\n=\n+\n=\n*\n*\n(\n)\n(\n)\n(\n)\n(\ncos(2\n)\nx\nx\nx\nx\nx\nx\nj k x\nt\nj\nk x\nt\nj k x\nt\nj\nk x\nt\njk x\njk x\nx\nE E\nE E\ne\ne\ne\ne\ne\ne\nk x\n)\nω\nω\nω\nε\nε\nε\nε\nε\nε\n+\n-\n+\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n+\n=\n+\n+\n=\n=\nω\n\nProblem 10\n\na)\nIn the experimental setup, DIC is used for locating the bead, not for measuring the\nmovement of the bead. The movement of the bead is detected by a scheme that is similar\nto ellipsometry. A polarized light beam is first split into two orthogonally polarized\nbeams. These two beams are focused onto the bead, and they are largely overlapped.\nBecause the two beams go through different parts of the bead, they are out of phase from\neach other. When they are recombined, they form an elliptically polarized light. The\nmotion of the bead can be detected by measuring the change in the ellipticity of the\npolarization.\n\nb)\nThe answer to this question is it depends. The Voltage-vs-Time plot in Fig. 1 is\nquite noisy, and the noise can be from either the detection system, or the random motion\nof the bead. If the noise is from the detection system, it is a little farfetched to claim a\n\nresolution of 1 nm. The spectrum plot shows a unit of nmHz-1/2 which indicates that the\nmeasurement is taken over a certain period of time. This time can be substantially longer\nthan 10ms, the period of the 100Hz calibration signal, so the noise in the detection signal\ncan easily be averaged out during the measurement to give the nice peak in the frequency\nplot. The question is asking if a 1nm motion can be detected. In this context, Brownian\nmotion should not be considered as noise.\n\nc)\nThe sensitivity of the detection can be enhanced by using a shorter wavelength,\nbecause the same thickness difference will result in a larger phase shift of the two beams\nwhen a shorter wavelength is used. On the other hand, a shorter wavelength results in a\nlarger shot noise. So, there is a balance to play with. Another concern in this particular\napplication is that a shorter wavelength may destroy the sample.\n\nd)\nThere are many reasons for which SEM is not suitable for this task. First, the\nsample will not survive in the vacuum. Second, the sample is too thick for the electrons\nto go through. Third, even the sample is thin enough for the beam to go through, a\npolarized electron beam will no longer be polarized after passing through solid.\n\nProblem 11\n\na)\nThe scheme, point-spread-function engineering (PSFE), improves the resolution\nlimit by reducing the effective size of the point-spread function (PSF) through exploring\nnonlinearities in the fluorescent processing. It requires fluorophores that behaves as 4-\nlevel system (states S0, S1 and their corresponding vibrational manifolds), and light with\ntwo different wavelengths, the shorter one excites the fluorophores and the longer one\nquenches it. A phase mask is used to null the center of the PSF for the longer wavelength,\nbut preserves the wings. By doing so, the molecules at the tail of the shorter-wavelength\nPSF are quenched during the fluorescent process, and the shorter-wavelength PSF is\neffectively reduced. This mechanism works in all three dimensions of the space.\n\nb)\nAccording to the article, the lateral resolution is improved by a factor of 2.\n\nc)\nAccording to the article, the axial resolution is improved by a factor of 6."
    },
    {
      "category": "Assignment",
      "title": "pset_04.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-781j-submicrometer-and-nanometer-technology-spring-2006/b04975fd7ad224765042e551e48d6d24_pset_04.pdf",
      "content": "6.781\nHomework Set #4\n12.\nCalculate the deBroglie wavelength of an electron at 10 KeV, 100 KeV and 1000\nkinetic energy, both classically and relativistically. In which of these regimes\nshould you start to concern yourself with relativistic effects?\n13.\nThis problem is intended to clarify exactly what is meant by \"elastic\" collisions of\nelectrons with a sample in electron microscopy.\n(a) Show that in any collision between an energetic light particle (e.g. an\nelectron in an energetic beam) and a heavy particle at rest (e.g. a nucleus\nin a substrate) in which total energy and momentum are conserved, very\nlittle energy transfer occurs, and the collision can be considered \"nearly\nelastic\" from the point of view of the light particle.\n(b) Calculate the maximum energy lost in the collision of a 100-keV\nelectron with a gold nucleus.\n14.\nHere we show the electron-diffraction pattern for a 100 kV electron beam\nincident perpendicular to a thin film of (100) Si [i.e. 4-fold symmetry]. Note the\nlarge number of diffracted beams. The Si (100) sample can be considered a 2\ndimensional grid of 0.54 nm period.\n\nWithin the acceptance aperture of the TEM there are diffracted spots out to 6th\norder.\n(a)\ncalculate the acceptance half-angle (i.e., α) of the TEM.\nConsider an analogous optical diffraction pattern from a grid pattern.\n(b)\nAssuming an optical wavelength of 400 nm, what grid period\nwould give the same number of diffraction spots within an\nacceptance angle of 0.01 radians.\n(c)\nWhat is the highest order of diffraction one could get from such a\ngrid using the 400 nm incident radiation.\n(d)\nX-ray diffraction analysis is normally done with an x-ray wavelength of\n1.54A (0.154 nm). For the above Si crystal, what is the highest order of\ndiffraction that is possible?\n15. (a)\nCalculate the resolution of an electron microscope operating at 100 KeV\nwith an objective lens of 1 mm focal length.\n(b)\nDo the same for 1 KeV and a 1 cm focal length.\n(c)\nGive a rough estimate of how much the focusing current in the coil of the\nlens would differ in the two cases, assuming that the focal length of the\nlens is the same in the two cases (100 KV & 1KV). (i.e., factor of 100, (100)2\netc.?)\n16.\nThe attached figures are taken from the book by R. B. Marcus and T. T. Sheng\n\"Transmission Electron Microscopy of Silicon VLSI Circuits and Structures\" John\nWiley & Sons Inc. (1983).\nIn the Figures on pages 120 and 121 (upper) and 198/199 compare the\nappearances of oxide, poly Si and single-crystal Si. Why are there dark bands in\nthe single-crystal Si but none in the oxide?\nReferences\nProblem 16\nMarcus, R. B. and T. T. Sheng. Transmission Electron Microscopy of Silicon VLSI\nCircuits and Structures. New York, NY: John Wiley and Sons, Inc., 1983.\npp. 120-121, 198-199. ISBN: 0471092517."
    },
    {
      "category": "Assignment",
      "title": "pset4_soln.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-781j-submicrometer-and-nanometer-technology-spring-2006/a3f91694f633acc39d2ec5a3136f4d96_pset4_soln.pdf",
      "content": "Homework Set #4 Solution\nProblem #12\nClassically:\nh\np = h , K.E. = p 2\n⇒ λ =\n.\nλ\n2m 0\nK.E.\n\nm 0\nRelativistically:\nhc\npc = K.E.2 + 2 K.E. m c , λ = hc\n⇒ λ =\n.\npc\nK.E.2 + 2 K.E. m c\nIn the equations, p is the momentum, K.E. is the kinetic energy, c is the speed of light, m 0\nis the rest mass of the electron.\nK.E. (keV)\nλclassical (nm)\nλrelativistic (nm)\n0.0123\n0.0122\n0.00388\n0.00370\n0.0012\n0.00087\nRelativistic corrections are important above 100 keV.\nProblem #13\na.) Elastic collision\nConservation of momentum\nConservation of Energy\n1 ( )\nv\nm\ni\nf\n(\n(\n( ) = M (u )-\nv\nm\nf )\nv\nm\ni ) = 1 M (u f ) + 2\nv\nm\nf\nCombining these equations:\nM -m\n2m\nv f =\nvi\nu f =\nvi For M>>m, v f ≈vi\nM + m\nM + m\n\nb.) 100 KeV electron: m=9.1e-31 kg;\nresting gold nucleus: M=3.3e-25 kg\nEnergy lost for the electron is that imparted on the gold nucleus\n(\n4mM\n4mM\nQ\n= 1\nu\nM\nf ) = 1 M ⎜⎛ 2m vi\n⎞⎟\n=\n(M + m)2 [\nv\nm\ni )2 ]=\n(M + m)2 [ 100 KeV ]\n(\nlost\nQ\n⎝ M + m\n⎠\nlost = 1.1 eV\nProblem #14\n=\na) At 100Kev, λ = 3.7e-3 nm. Since p\nmλ sinα = 0.54 nm\n\n,\n-\nα ≈ sin α = mλ p = 6(3.7 × 10- 3 nm) 0.54 nm , or α =\n×\n\n4 10 2 rad .\n- 2\nb) For imaging α 10 - 10- 3, so4 10\n2 rad is reasonable for obtaining diffraction\n×\n-\npatterns, which are less critical than imaging.\nc) sinα\nm\np\nλ\n=\n⇒ 0.01 = 6(400 nm\n\n) p ⇒\np = 2.4 × 105 nm\n\n= 0.24 mm\n\nPretty big!\n=\nd) p\nmλ /sin α . Let sin α = 1, then p = mλ . m = p λ = 2.4 × 105 nm 4× 102 nm = 600.\nReally high!\nm\np\nλ\n- 1(\ne)sinα =\n⇒ α = sin\nm\np\nλ\n) = sin- 1(0.285m)\no\nFor m = 1;α = 17 .\no\nFor m = 2;α = 35 .\no\nFor m = 3;α = 59 .\nFor m = 4; α = cut off .\nSo, 3rd order is the highest.\nProblem #15\np\n=\n1 4\nwhere C ≈ f .\nmin\nC λ 3 4\ns\ns\n- 3\na) @ E = 100 keV\n\n, λ = 3.7 × 10 nm\n\n. For C = 1mm\n\n, p\n= 0.47 nm\n\ns\nmin\n\n- 2\nb) @ E = 1keV\n\n, λ = 3.88× 10 nm\n\n. For C = 10 mm\n\n, p\n= 4.9 nm\n\ns\nmin\n\nc) To keep the focal length the same, the current in the magnetic lens must be adjusted\nsuch that the trajectories of electrons are identical for the two beam energies. To achieve\n\nthis, the ratio of the axial velocity to the radial velocity v\nv\nshould be independent of\nr\nz\nthe beam energy. Hence, v = Eh\n\nz\n\n( ) and v = Eh\n\nz\n\n( ) .\nr\nr\nz\nz\nOn the other hand, the B field is a linear function of the current I, or\nz\n(\nB = I g ( ), B = I g (z) , where g\nz) and g (z) are functions of z. So, from the\nz\nz\nr\nr\nz\nr\nlecture notes we have\ndθ\nr\n∝∫v B dt\n\n= B dz\nz\nr\n∫ r\ndt\nv = ∫a dt\n\nr\nr\n∝∫F dt\nr\n( B dz B dt\nz\n∝∫∫ r )\nBz\n= ∫∫B dz)\ndz\nr\n(\nvz\nI 2\n∝\nE\nFinally,\nv\nI\nI\nr ∝\n=\nvz\nE\nE\nE\nTherefore, if energy E is increased by a factor of 100, the current I must be increased by a\nfactor of 10.\nProblem #16\nThe oxide is a uniform shade because it is amorphous, and thus no coherent Bragg\ndiffraction occurs. The polysilicon is polycrystalline. If a grain is oriented properly,\nBragg diffraction will enter the aperture and we will see a bright grain. Otherwise, the\ndiffracted beam will miss the aperture and the grain will appear dark. Silicon is\ncrystalline (single crystal) and scatters electrons coherently. Because TEM samples are\ntypically very thin, they bend easily. In certain regions of the bend the Bragg condition is\nmet such that the aperture is missed and the Si in those regions appears dark. Oxide does\nnot exhibit these bend contours because it is amorphous."
    }
  ]
}