{
  "course_name": "Sustainable Design and Technology Research Workshop",
  "course_description": "No description found.",
  "topics": [
    "Fine Arts",
    "Architecture",
    "Architectural Design",
    "Science",
    "Earth Science",
    "Sustainability",
    "Social Science",
    "Urban Studies",
    "Urban Planning",
    "Fine Arts",
    "Architecture",
    "Architectural Design",
    "Science",
    "Earth Science",
    "Sustainability",
    "Social Science",
    "Urban Studies",
    "Urban Planning"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 sessions / week, 3 hours / session\n\nGeneral Information\n\nThe workshop welcomes students from different disciplines that focus upon the design and technological issues related to the development of the built environment.\n\nThe intention is to explore and speculate upon current interpretations of sustainability in and around architecture and urban design, in the broadest sense - from the micro level of materials and technology, through the scale of the building, to the macro scale of urban form and suburbanization. We will be interested in looking at not only how the notion of sustainable architecture is conceptualized, interpreted and implemented at varying scales, but also how we might push the frontiers of knowledge toward new directions and dimensions. These new dimensions should challenge us to be conscious of resource use, ecological balance and minimizing environmental impacts in professional design work and technological applications.\n\nThe workshop will be interdisciplinary and collaborative in nature and will develop as a forum where students and faculty will engage both in investigative analysis as well as design studies of a speculative nature. The intention will be to produce work of a publishable quality that can then educate and inform a wider professional community.\n\nThe workshop will be structured around three interrelated phases. We will begin by looking at current interpretations of sustainability in architecture from literature, publications, professional practice and assessment methods with a view to developing some critical edge to the upcoming work of the class. Secondly, we will engage in holistic and critical research of a range of chosen projects through the study of their underlying objectives and ideas as well as the resultant problems and issues. For example, a group may do a critical analysis of a new building or urban development that has been critically acclaimed to be very sustainable. Finally (and for the second half of the semester), students will select their own design project which will become the vehicle to articulate and evaluate either totally new ideas and agendas for a sustainable future, or to revisit familiar problems but with a new vision and understanding of the environmental potential.",
  "files": [
    {
      "category": "Resource",
      "title": "assn1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-183-sustainable-design-and-technology-research-workshop-spring-2004/ee111d60cdad22d7a71a4b8466ab1ee3_assn1.pdf",
      "content": "ASSIGNMENT 1: 'What is Sustainability?'\n\nWe want to begin the workshop (for the first 2 meetings) by questioning and exploring some of\nthe multitude of interpretations of 'sustainability'. This is in order for us to comprehend how\ndifferent contexts, disciplines, regions or institutions are using the terminology to support their\nparticular needs or environmental aspirations. It will also enable us to open a discussion\nconcerning the manner in which 'sustainability' as a force within the professions of the built\nenvironment is diverging and developing a more complex nature.\n\nIn order to explore this complexity, we ask each group to research the issue through a review of\ncurrent literature, publications, web sites, assessment methods, products, professions and so\nforth. Each group should not attempt to review everything that is out there - but rather to\nconcentrate upon a defined area of your chose. For example, you might look at it from the\npoint of view of different design professions; disciplines; professional practices; institutions\n(academic / governmental for example); corporations; industries; assessment; local initiatives in\nour region (MIT, Boston, New England), or simply new literature on the market. However, in\nreviewing the material about sustainability within your chosen area we would like you to be able\nto bring a critical edge to your investigations, contrast and compare, and eventually to be able to\nrepresent your findings in an appropriate graphic form.\n\nNext Tuesday in the workshop, we would like you to informally present and discuss your area of\nchoice for the assignment, what progress you have made and how (for the following week) you\nmight represent your initial research.\n\nAs we said last Monday, we will then be moving forward over the next few weeks to look more\nclosely at a series of case studies that are selected by you. So in the process of working on this\nfirst assignment, please also look out for work or projects that might make for interesting subjects\nfor a study."
    },
    {
      "category": "Resource",
      "title": "assn2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-183-sustainable-design-and-technology-research-workshop-spring-2004/e43c04e5fcce9b359dff75ef36e64153_assn2.pdf",
      "content": "ASSIGNMENT 2: Case Study\n\nWe would like you all to focus on developing your ideas and research for an analytical and critical\nCASE STUDY of a selected project, technology, process or method that engages sustainable\ndesign principles in some form.\n\nThe intention is, over the coming 3 weeks, to research, discuss and document your selected\nstudy area - and then to take a critical position concerning how it does or does not achieve its\nstated objectives and intentions. As an example and guide, you should be able to identify what\nthe claims to sustainability are, how well does the project or ideas work, what are the problems\nand issues arising, and how might it be improved or done better. Therefore, the intention of the\nstudy is not to simply document and research it but also to take a critical position about its\nsuccess and lessons to be learnt for the future.\n\nThe product should be an approximately 6 page illustrated paper / article that might appear in a\npublication such as the Department's Thresholds or an equivalent. There are two major\nrequirements:\n\n1. Make a final presentation of your case study. You will have about a max. of about 15 minutes\neach so we would like you to focus predominantly upon your conclusions and critical observations\n(and less on the general description of the selected case).\n\n2. Condense your case study into a written, illustrated and publishable article of 4-6 pages\nmaximum. The size should relate to the page size and margins of Thresholds. The article should\nmake for an interesting and informative read about your case study and be a short critical\ncommentary about the subject and sustainable design."
    },
    {
      "category": "Resource",
      "title": "assn3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-183-sustainable-design-and-technology-research-workshop-spring-2004/a2756e074dfa0f279b0ec274ab105cd8_assn3.pdf",
      "content": "ASSIGNMENT 3: Design Study and Final Report\n\nAs we discussed at the last meeting, the design study is an opportunity to propose and develop\nan idea that breaks new ground in our thinking about sustainability. We are particularly interested\nin innovation and pushing the frontiers of our knowledge and expectations. It might be related to\nor arise from your case study or it might be something totally different. It could be about revisiting\na project you or someone else has already developed, reconceiving it relative to the sustainable\ndesign dimensions - or it might be something new. It could be about a process or technology, a\nbuilding element, a particular type of project, or about an area or place. It could be related to MIT,\nCambridge, or be situated elsewhere.\n\nSo please think about this over the next week and come prepared to discuss some ideas. Please\nalso be aware that this design study will need to be tailored to the time available in the second\nhalf of the semester. We will have about 5 weeks before we conclude the workshop.\n\nRequirements:\n\nPlease prepare a 15 minute (maximum) presentation that is primarily about communicating your\nrecent design study within the workshop but which also makes a key reference and quick\nsummary to your earlier work on the case study research. In relating these 2 parts, we are\ninterested to hear how your understanding, knowledge and critical opinions about sustainability\nhave developed.\n\nIn discussing your design study you should:\n1. outline the idea of your project and the sustainability and environmental impact\n2. outline the research and context of the design.\n3. describe your design proposal\n4. outline your recommendation for future steps should or others have more time for development\nof the idea.\n\nThe final requirement of the workshop will be to condense your presentation into the\nform of an article in the same size and format as your previous case study. These should\nbe posted on the workshops web site. This will form a part of our evaluation of your\ngrade for the class."
    },
    {
      "category": "Resource",
      "title": "finalbraddock.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-183-sustainable-design-and-technology-research-workshop-spring-2004/461c3d895aee7fa1bd59513c1d82f3e6_finalbraddock.pdf",
      "content": "Jon Braddock\nStudio 5 Lighting Strategy\nStudio 5 in the architecture department at MIT is a\nspace of average natural light capacity. It is located on\nthe top floor of a four story building and has north east\nfacing windows that emit indirect light and reflections\nduring the day from surrounding buildings. The space\nis also broken up into 5 bays that each contain a large\nnumber of working desks, computers, cutting stations,\nprinters, and floating pin up\nwalls. Everything in the studio\nis painted white except for the\ntrim around the desks and pin\nup walls and the color accounts\nfor 75% of the studio's light\ntransitivity. The surfaces in the studio are concrete,\nterrazo, wood, plastic and homosote; all of which con\ntribute to an interesting plethora of light patterns and\nreflections and consequentially a lot of deep shadows\nand pockets of darkness during the day.\nThe area of most concern in this studio is along the\ncentral access route. It is framed by floating partitions,\ncolumns and neatly arranged computer terminals that in\ntheir own way block a lot of the light from being dis\ntributed throughout the studio. The students desks are\ndivided by this corridor so one half of the studio gets\nnatural light in the morning and the other gets indirect\nlight in the afternoon.\nThe problem in this studio is how to distribute more natural\nlight into the space with out:\n1. Interfering with existing infrastructure\n2. Disrupting the overall layout of the space.\nTo begin, it was imperative to isolate the areas of the studio\nwhere light seemed to be efficient and to identify how and\nwhy it was so. My conclusion was that the glass garage doors\nalong the west side of the studio were the very best at light\ntransitivity primarily due to the array of skylights that lined\nthe corridor outside. These skylights allow for indirect light\ning to bathe the white painted corridor space that runs parallel\nto the studio and penetrate the glass doors, thus creating an\narea of comfortable visibility and extreme clarity where it\nmatters most. The key here was to create a device that would\nmaximize the light in the corridor and bounce it into the stu\ndio so that it would reach the inner corridor that currently\nsuffers most.\nMy proposal was to integrate a series of angled reflective\npanels under the sky lights and floating mirrors on the ceiling\nof the studio to transmit and bounce light into the space. In\norder to maximize this condition, the panels had to be aligned\nwith the mirrors, and hanging far enough down to achieve the\ndesired effect in the studio with out compromising the head\nheight along the corridor. It was also important to adjust the\nangle of the panels to eliminate glare and to think about the\ncorridor as a linear space of reflective mirrors disguised as\n\nsculptural panels.\nUsing Lightscape as a tool for analysis, it was important to\nrun several simulations of existing and proposed conditions\nat two times of the year: June 21 (Summer Solstice) and\nDecember 21 (Winter Solstice). Each day was significant in\nidentifying the behavior of the light on the longest day of\nthe year as well as on the shortest day. Six studies of each\nday were simulated: 9AM, 12Noon, and 5PM. The times\nwere significant in that they provide a variety of lighting con\nditions with which to compare conditions with and to track\nthe intensity of the sun throughout the day.\nAt the conclusion of the study, it was obvious that the panels\nwould contribute significantly to the overall light distribution\nof the corridor as well as produce the ambience necessary\nto create a comfortably lit studio space on the inside. The\ndrawback however was that the size and angle of the panels\nmattered more than expected in order to achieve a consis\ntent stream of light during the day. In response to the latter,\nmore reflective surface was placed around the opening of the\nskylight in an effort to capture as much light as possible and\nto maximize the light at its source instead of trying to take\nadvantage of its intensity so far away. The observations fol\nlowing the addition proved to be more brightness at the top\n\nnear the skylights - as expected- and more glare along the\ncorridor due to the shininess of the floor.\nIn conclusion, the corridor proved to be a potential space to\ntake advantage of light. The test would have been more suc\ncessful if a panel(s) were to be angled in several directions as\na tool to respond to the changing directions of the sun during\nthe day. Also, if the panels were built to house the existing\nartificial lights (that are small enough to be concealed) for\nambience at night. Overall, the studio benefited from this\naddition and it was a viable experiment that it indicated how\nflexible the conditions are for change as well as how strong\nlight can be when the proper strategies are implemented."
    },
    {
      "category": "Resource",
      "title": "finalbrown.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-183-sustainable-design-and-technology-research-workshop-spring-2004/408f0a5a60e766de6f0066af6faeab65_finalbrown.pdf",
      "content": "Carrie Brown\nRethinking Bexley Hall\nBackground:\nIn 1939, MIT purchased an apartment building on Mas\nsachusetts Avenue and renamed it Bexley Hall. Today,\nBexley is home to about 120 residents organized in to\nsuites of 2 to 4 people. While renovations have occurred\nover the years, certain comfort problems still persist in the\ndorm. The goal of this paper is to propose design solu\ntions that could be easily and economically retrofitted into\nan old building.\nThe site:\nBexley Hall is located at 50 Massachusetts Avenue, The\nroom that I have concentrated on is a third floor, west fac\ning room.\nAfter a series of informal interviews with students, the\nhouse manager and housing staff, several common prob\nlems were identified.\n\ncontrol.\nRadiators:\nThe radiators can\nAnything in between leads to\nsignificant leakage and ceiling damage.\nis far too warm. As a solution, most residents leave the\nheaters on high with their windows open.\ntions show that the radiators are providing about 10 times\nas much heat as needed.\nDesign Challenge:\nThe building is too old to warrant installing a new system.\nHow can residents gain more heating control to maintain\nSolution:\nAn insulated enclosure of one inch thick high density\nAn opening\nat the bottom and adjustable vents at the top would allow\npersonal heating\nAdjustable vents provide\nperssonal heating control\nwhile an opening at the\nSteam powered radiators heat Bexley.\nonly be set to high or off.\nWhile the build-\ning is too cold to leave the radiators off, the high setting\nRough calcula-\ncomfort while saving energy at the same time?\nfiber glass could be built around the radiator.\nRight: Insulated heater.\nbottom allows air flow.\n\nWindows:\nTwo 3x6 feet windows are located on the west wall.\nThe windows provide enough light during that day, so\nthat artificial lighting is rarely needed. However, bright\nafternoon afternoon sun causes glare on monitors. So, a\nshading device that allows sufficient day lighting while\nblocking glare is desired. However, at night, shade is\nneeded to block out the lights from Kresge, while allow\ning air flow for natural ventilation.\nSolution:\n1.\nRemovable window film: If this were installed\non the top half of the bed window, it would\ndecrease afternoon glare on the computer screen\nwhile maintaining day views.\n2.\nKnitted all-weather polyethylene fabric: This\nmaterial blocks 90% of UV light, while allowing\ndiffuse lighting and ventilation. However, this\nmaterial would be be able to provide suitable\nshading at night.\n3.\nHybrid shade: The top half would be a polyeth\nylene shade, while the bottom half would be the\ncurrent opaque white shade. This would solve\nthe night shading problem, but would decrease\nventilation and lack flexibility.\n4.\nDouble layer shade system: This design would\nblock light while allowing ventilation. Materials\ncould vary by need for shading and ventilation.\nAn accordian style shade would also increase\nflexibility.\n\nLighting Fixtures:\ncenter of the ceiling of each room.\nimproved indirect lighting design is desired.\nSolution:\nThere are three\nbasic types of fluorescent lights.\nand light production.\nvoltage to the cathode to produce immediate light. Rapid-\nstart fluorescents continuously heat a low-resistance\ncathode. As a result, light is produced in 1 to 2 seconds.\nThe latter is the most commonly used and a good choice\nfor our purposes.\n-\nA single fluorescent light is currently installed in the\nLighting fixtures that\nare pleasing, yet efficient with direct task lighting and\nFluorescent lights are generally about 20% efficient as\nopposed to incandescent's 5% efficiency.\nIn preheat fluorescents ,\nthere is a significant delay between turning on the circuit\nInstant-starts provide sufficient\nVarying the transparency levels of the\nRight: Double layer design blocks\nlight while allowing ventilation.\nAccordian-style, segmented shades\nintroduced greater flexibility.\nmaterial also enhances flexibility.\n\nFor task lighting, direct lighting is preferred to indirect\nlighting. To reduce glare problems, blocking direct site\nlines is desirable. Installing small desk lamps or mount\ning lighting fixtures under shelves are both good solu\ntions. Indirect lighting can be used for general ambient\nlighting. Again, blocking direct views to reduce glare\nimproves comfort levels.\nOther Design Challenges:\nNatural Ventilation:\nAttention has already been given to bringing air in\nthrough the windows. When the door is open, cross venti\nlation provides pleasant airflow, sufficient enough to cool\nthe room on most warm days. However, when the door\nis closed (most often during sleeping hours), the room is\nsignificantly less comfortable. A possible solution would\nbe to install a vent above the door. However, this vent\nwould probably need to be acoustically treated since there\nis significant noise level in the hallway at most hours.\nThere are also several other acoustical problems. The\nroom borders a hallway and bathroom, along with the\nalley--where there is trash collection every morning.\nMost residents interviewed would like to have lower noise\nlevels, but would not trade outdoor views. If acoustical\npaneling were installed in the room, this would decrease\nthe reverberation time in the room, which would also\nincrease the noise reduction. Additionally, white noise\nmachines could be installed.\nConclusion:\nOn a campus where constuction projects are big, and the\narchitects bigger, it is still possible to make fixes that are\nsimple, economic and sustainable.\nFuture steps for this project should include an in depth\nanalysis of the cost of materials and installation compared\nto the financial savings resulting from the renovations.\nAdditionally, more formal inteviews could be conducted\nto prioritize the renovation needs. With this information,\na test room should be started.\n."
    },
    {
      "category": "Resource",
      "title": "finalhelinski.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-183-sustainable-design-and-technology-research-workshop-spring-2004/7b109b5108a1d55fe246a5110c8ede7a_finalhelinski.pdf",
      "content": "Katice L. helinski\nBike Share: A Sustainable Addition to Urban Transportation\nCreating cities that promote sustainable lifestyles\nis a complex and far reaching process. One of the most\nimportant components of sustainability on an urban scale\nis the need for an efficient public transportation system,\nwhich provides enough convenience that, combined with\nwalking, can be more desirable for residents to use over\ndriving a car. Vehicular traffic congestion is one of the\ngreatest challenges for cities around the world, as city\nplanning departments continually reinvent forms of traffic\nmanagement. One of the simplest solutions is to reduce\nthe usage of automobiles in general. In the case of cities\nsuch as Boston a strong framework for public transporta\ntion already exists with buses, a subway system and com\nmuter rails, yet there are still holes in this system, where\nit is rather difficult to access public transportation and,\nironically, it is rather difficult to find parking for a per\nsonal vehicle as well. Consequently, establishing an addi\ntional transportation system would be extremely useful to\nthe cities overall simplicity for non-drivers. With minimal\ncosts and infrastructural changes, a bike-sharing program\ncould provide a network for those short-distance trips that\nare just beyond efficient walking distances as well as link\nup with the existing transportation system. This idea has\nbeen successful in many cities, though the advancement\nof the system has not reached its full potential, as certain\ncomputerized technology is continually advancing and\nbecoming more affordable. Bike sharing is not a part of\ncommon knowledge among urban dwellers, despite the\nfact that it provides solutions to many of the hassles of\npersonal bike usage or walking in a city. The bike share\nnetwork provides an opportunity for the reexamination of\ntransportation and, consequently, the idea of the urban bus\nshelter. If the bicycle stations become icons within the\nfabric of the city, with varying degrees of visual presence\nthrough design they will become an integral part of the ur\nban fabric and daily life more quickly than if they appear\nto be just another bike rack.\nPublic Use Bicycles, as they have become\nknown as, are extremely valuable components of an\nurban transportation system. First of all, they provide\nconvenience. With the availability of a free bicycle to\nuse, ready on demand, an immediate convenience is given\nfor short trips, and at times of day with busy traffic, they\ncould actually prove to be quicker modes of transport than\na personal car, bus or even taxi. Bicycles are relatively af\nfordable and cheap to maintain, but, nonetheless, theft and\nvandalism is often a problem even when they are locked\nresulting in the need for special storage. This situation\nis exasperated in places like Boston, with the prevalence\nof small, walk-up apartment units. Public use bicycles\ncan actually reduce theft by providing an alternative for\npotential thieves1. The police department in Copenhagen,\nDenmark reported that most bike thefts are \"convenience\"\nthefts, in that the bike is used as transport and then\nabandoned at another location. After the implementation\nof a bike share program in Copenhagen, thefts actually\ndropped dramatically. Additionally, cycling provides ob\nvious health benefits and benefit the commnity by reduc\ning pollution and congestion further aiding in sustainable\nliving.\nThe Stages of Development of Public Use Bicycles\nPUBs have gone through four 'generations' in\nthe evolution of their implementation. The first, and most\n\nTop: card reader and lock for Adshel\nBelow: Ashdel bike at station\nSource: www.communitybike.org/files/adshel\nBottom: First Generation PUBs in Minneapolis\nSource: members.aol.com/humorme81/demaio-paper.pdf\nsimple is simply supplying a city with donated bicycles,\nsimilarly marked for easy identification, and used and left\non the street in various places, to be picked up by some\none else. This was first tried in the 1960's in conjunction\nwith a radical proposal discussing the future of urban\nlifestyles. The \"White Bike Plan\" for Amsterdam, which\ncalled for the removal of all motorized vehicles from the\ncity center was proposed by Luud Shimmelpennik. He\nclaimed that automobiles were stealing away the city from\nthe pedestrian, removing social interaction from the set\nting2. While cars were not banned from the city, numer\nous bikes were donated, painted white, spread for public\nuse. Nonetheless, abuse of the bikes and an inconsistency\nin returning them to the street resulted in a need for fur\nther design of the system3.\nSecond Generation PUBs integrate a coin oper\nated locking system, similar to those used on grocery\ncarts. This allowed the bikes' locations to be consistent,\nand the deposit reduced theft in that they could be locked.\nWhile a $1-$3 deposit was required to release the bike,\nit, obviously, did not equate to the cost of the bike4. The\nbikes used for PUBs began to be specially designed with\nmore durability, so that less maintenance was required,\nBike lanes in Amsterdam are well maintained and separated from vehicular traffic.\nsource: www.communitybike.org/files/amsterdam\n\nand with use of advertising on the bikes they began to\ngenerate revenue for running the system. Additionally,\nthe bicycles have non-standard parts, heavy frames, and\nunusual design theft is greatly reduced. Adshel, an inter\nnational advertising company, has created a bike share\nsystem that can be implemented in any city using all of\nthe above methods to operate and maintain the system\nwithout charging for bike usage5.\nAdshel pushed the second generation PUBs\nfurther with the integration of Smart Card technology,\nwhich allowed bicycle use by individuals to be tracked\nand recorded. This Third Generation system has been\nintegrated into many of the bike sharing programs, as the\nSmart Card technology also allows fees to be charged to\nthe users, whether those are for use, or stolen bicycles.\nIn Adshel's Smart Card system, a GPS tracking device\nmarks the bike in relation to the various stations and sends\nsignals to a roving truck used to redistribute bikes as they\nbecome over full or empty6.\nFinally, Fourth Generation PUBs are beginning\nto be implemented in cities such as Washington DC and\nits surrounding areas. The system was advanced to inte\ngrate the Smart Card with the Metro card that commuters\nuse to ride buses, the subway and the commuter rails.\nConsequently, users can coordinate all of their commuting\ntransit with a single card and, due to an optional contract\nagreement with users, the use patterns are able to be\ntracked in such a way that the network can be continually\nadapted to meet the needs of the community7. The city\nalso provides many services that encourage personal bi\ncycle use for commuting purposes. For instance, bicycle\nlockers at commuter stations and showers encourage even\nsuburban residents to avoid automobile use sustainably\nlinking themselves to the commuter rail lines and reduc\ning environmental impacts. The Washington Metropoli\ntan Area Transit Authority website also provides links to\nvarious organizations such as groups of riders in various\nsuburbs and commuter routine planners. A link also cre\nates an itinerary to a destination using public transport,\nallowing one to prioritize minimal walking, number of\ninterchanges, time and modes of transit8. This type of vir\ntual infrastructure is a valuable component in the overall\ncreation of linked communities with residents who choose\nto travel in a sustainable manner.\nA New Network\nA network of a proposed bike share program\nwithin the Boston-Cambridge transportation system is\ncurrently being implemented on a trial scale at MIT,\nserving the community for short trips to local amenities\nsuch as Newbury Street shopping, Boston Common and\nDowntown Boston. Additionally it will link the east and\nwest edges of campus, where public transportation is\ncurrently limited. The TechBike program, as it has been\nnamed, will use card reader technology designed by MIT\nstudents to be used by the MIT community9. This project\nis a study that could serve as a potential expansion of the\nMIT plan, if it were successful, that remains based around\nthe arteries of Massachusetts Ave. and Main Street that\nrun through campus, linking up the eastern and western\nedges of Cambridge with the rest of public transportation.\nLarger scale bicycle stations will be located at major bus\nand subway stations along this network between Central\nSquare and the northern edges of Boston. With a capacity\nof 10 bicycles at each, they could be integrated with the\nstructures currently needed at these transportation hubs\nand could expand as a need arises, due to the flexibility\nof the station components, which will be described later.\nIn addition, neighborhood areas could have smaller scale\nunits with two to four bicycles per station, so they would\noccupy minimal space on the smaller scale sidewalk\nspaces; however, distributed every few blocks, travel\nfrom residence to bicycle would be low. Consequently,\nthis network, using city space and incorporating a large\nportion of Cambridge, could be a logical expansion to a\n\nsystem, could then be expanded to more of Boston and\nSommerville.\nMuch study and development has occurred in\nrelation to the technology involved in the bike share\nprogram, and will continue to evolve.\nment of the way in which these systems make their mark\nin the urban context has not been pursued to its greatest\npotential. In order to project an image of interconnected-\nsign the stations for these bicycles in such a way that they\nibility to adapt to space and need at each site. It is for this\nreason that I have designed a \"kit of parts\" for bike station\nshelters that can also incorporate seating and protective\nelements, allowing them to serve as shelters as well. Due\nto limited space along existing urban thoroughfares and\nthe need to integrate the bike network with existing transit\nelements such as bus stops, subway stops, commuter\ntrain stations, and parking garages, this kit will allow the\nstations to adapt to the requirements of its site, while still\nretaining an amount of uniformity that will contribute to\na recognizability within the city and simplicity of assem-\nThis proposal begins to look at the system in terms of\ndesign establishing an idea base for further exploration in\nterms of technology and mechanics.\nbicycle itself.\nincorporated design innovations that seem to be extremely\nbikes, electronic chips recording the duration the bikes are\nin use, Smart Cards for reserving bikes, advertising pan-\nels, leak-proof tires, durable and heavy frames, handlebars\nthat are incorporated with a bag container for holding\nbelongings and solid wheel frames. Assuming all of these\nAbove, behind: map of proposed Boston transportation network\nBelow: section through bike station with all components\ngrowing system at MIT, and the innovations used in this\nThe Stations: Icons in Their Context\nHowever, develop-\nness and sustainable lifestyles it would be beneficial to de-\nare a physical part of the existing infrastructure, with flex-\nbly.\nLet us begin this project's presentation with the\nThe Adshel system and others have already\nbeneficial to the system including GPS sensing in the\n\nwill be used in the system, I propose a new idea for bike\nsecurity. If an immobilization mechanism was incorpo\nrated into the wheel frames, similar to tire boots on cars,\nthe bike could be made stationary no matter where it\nwas located. The basic idea consists of a pegged circu\nlar disk attached to the bike frame that interlocks with a\nslotted wheel frame. This system could be electronically\nactivated by the overall Smart Card system. Due to the\nbike's weight, and its non-standard parts an immobile bike\nwould be rather useless to steal.\nThe components of the bike station kit consist\nof bike stalls, bike covers, a bench, a canopy for shade\nand rain protection for people, and a wall that may further\nenclose the shelter, keeping out blowing snow or rain.\nThe bike stalls themselves are simple spaces bound by\nlow walls, which have sensor technology and a small\ncomputer incorporated in them. The Smart Card system\nis in each of the taller posts, with a small map of the\nvarious bike stations around the city, so that a user may\nreserve a spot at another station if he/she chooses. The\nimmobilized bike sits between the sensor posts, which use\nsimilar technology as that of store security sensors. When\nthe Card triggers the release of a reserved bike the sensors\nrelease the immobilizer discs on the bike, and allow the\nbike to be removed from the stall. If a bike is lifted from\nbetween the stalls without the triggering of the system, an\nalarm will sound and the wheel will not be unlocked. The\nstalls could come in groups of two, allowing for smaller\nstations in residential areas where the sidewalks are not as\nwide.\nThe posts of the bike stalls are formed in such\na way that they can act as supports for a bench seat. The\nbench will be slotted, in order to allow some overlap in\nbicycle storage and seating, conserving space. Many bus\nstops do not contain a bench, so the bike station could\nbring an additional convenience to some of the smaller\nbus stops through this simple addition.\nThe next component is a bike locker device,\nwhich allows the bicycles to be sheltered from the\nweather and have additional security from vandalism\nand theft. These covers would be molded to curve over\nthe bicycles, their form relating to the arc of the canopy\nstructure. They would consist of a series of covers, which\nwould lock into place when lowered. The locking device\ncould use similar methods to those used in roller coaster\nshoulder guards, as they also hinge and lock into place\nwithout a connection to another surface. They would be\nunlocked using the SmartCard system as well.\nIn areas where bus shelters presently exist, a\ngreater quantity of bikes could be stored if the existing\nshelter were removed to make room for a hybrid bike sta\ntion and waiting shelter. The third component, a canopy,\nprovides shelter from rain, snow and sun using a light\nsystem in a curved form that requires minimal vertical\nsupports freeing more sidewalk space. Altering the orien\ntation of the canopy and the bench in relation to the stalls,\nit can shelter bikes and people if there is no available\nspace for the bike covers\nLastly, there is a wall component, which would\nbe made of a prefabricated panel system similar to those\nused in existing bus stops. Folding around the bench, it\ncan enclose the space below the canopy. This will shelter\nthe waiting space in thunderstorms, wind, or blowing\nsnow. The wall panels would have spaces for advertising,\nwhich could provide additional funds for maintaining the\nbike-sharing network.\nThe total of these components provides much\nvariation and flexibility in the nature of the bicycle sta\ntions, while still providing a consistency that makes them\neasily locatable for use by the community. The stations,\nas with many iconic bus stops in cities, could be altered\nin terms of color and materiality in various sites, adding\nto their highly visible presencein the urban environment.\n\nHowever, more practical infrastructural alterations must\nbe made with in the city in order to further encourage this\nas a viable mode of transport for the city. This includes\nthe creation of a more continuous, integrated system of\nbike lanes and reduction of potholes and uneven side\nwalks. One of the reasons cycling is such a viable option\nin cities such as Amsterdam is that the streets are zoned to\naccommodate various modes of traffic in a safe manner.\nAdditionally, a virtual information infrastructure creating\nlinks between modes of transportation, a metro card that\ncan be used for all modes, and a web-based format for\nmanaging transportation are valuable ways of encourag\ning bicycle transprotation.\nThe network of the MIT Techbikes, due to its\nconvenience and affordability promoted through simple,\nyet important infrastructural alterations will very likely\nexpand to the scale of this proposal, and hopefully\nbeyond. This will link much of Greater Boston, result\ning in a bike share program that is a component as easily\nused as the subway, commuter rails or buses. The stations\nand their design dynamics will be valuable for making\nthis system a well-known, usable system for the masses,\nhighly functional and integral with the present infrastruc\nture, yet playful in design, creating a recognizable image\nand attractive aesthetic quality within the city.\n\n21st\ndemaio\nCulture.\"\n.\nupdated 06/07/2002.\nthe 21st\nhumorme81/demaio\nupdated 04/09/2002.\nupdated 04/09/2002.\nthe 21st\nhumorme81/demaio\nfound at http://web.mit.edu/dzshen/www/\nRight: bike station components\nBelow: proposed station in context\nDeMaio, Paul J. \"Smart Bikes: Public Transportation for the\nCentury.\" Download at: members.aol.com/humorme81/\n-paper.pdf\nSimmelpennik, Luud. \"The White Bike Plan.\" http://\nwww.communitybike.org/files/new_urbanism/\nBenedict, Jared. \"Amsterdam White Bike Program and Bicycle\nwww.comunitybike.org/files/amsterdam\nDeMaio, Paul J. \"Smart Bikes: Public Transportation for\nCentury.\" Download at: members.aol.com/\n-paper.pdf\nBenedict, Jared. \"Clear Channel Adshel SmartBike Program\nOverview.\" www.communitybike.org/files/adshel\nBenedict, Jared. \"Clear Channel Adshel SmartBike Program\nOverview.\" www.communitybike.org/files/adshel\nDeMaio, Paul J. \"Smart Bikes: Public Transportation for\nCentury.\" Download at: members.aol.com/\n-paper.pdf\nwww.MetroOpensDoors.com\nInformation about the program outline for Techbikes can be"
    },
    {
      "category": "Resource",
      "title": "finalleifer.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-183-sustainable-design-and-technology-research-workshop-spring-2004/4f508255a3a6ee82dff8b964a1d8a692_finalleifer.pdf",
      "content": "Rainwater Harvesting: Embedding Storage in Home Structure\nSustaining public water supplies is a\ncomplex task that can only be achieved by\ninitiating changes in our consumptive\nbehavior. One way of constraining water\nuse is to develop the built world according\nto conservational and regenerative\ndesigns. From a water management\nperspective, this explicitly dictates the\ntapping of new potable sources and the\nprotection of traditional ground and\nsurface water supplies from excess runoff\nand overdraw. Methods of doing both\nexist, and have been manipulated to the\npoint that some public infrastructure\nsystems and building designs now\nincorporate new, generally neglected\nwater sources in altering the inputs and\noutputs of prior water use and distribution\nsystems.\nThree promising innovations in this\nnew vein are reclaimed water systems,\ngreywater reuse mechanisms, and rain\nharvesting apparatus. Reclaimed water\nsystems, which offer connections to\ntreated municipal effluent at a lower cost\nthan potable water provision, are effective\ntools for large volume users like\nagricultural operations, food production\noutfits, and golf courses to reduce their\npotable water consumption. To date\nhowever, these systems have made little\nprogress in reworking conventions of\nresidential water delivery, mainly because\nof infrastructure costs and public\nperceptions that treated effluent, which is\nactually filtered more vigorously than\nfaucet water,1 is unsuitable for supplying\n\nhome needs like clean bathing and\ndrinking water. Greywater reuse systems\nremain uncommon and with a few\nexceptions are still more of an academic,\nexperimental exercise in recycling drain\nwater than an infrastructural reality.2\nConcerns similar to those impeding wider\nreclaimed water use also hinder broader\ngreywater implementation, questioning the\nsuitability of greywater for even the most\nsimple irrigational uses.3\nRainwater systems are by no means a\nnew invention, having existed for\ncenturies in places like Australia,\nBermuda, Indonesia, Japan, Thailand, and\nHawaii, but have more recently been put\nto innovative new applications in the\ncontinental United States. Utilizing native\nlandscaping, roof catchment surfaces, and\nexternal storage cisterns, citizens of rain-\nparched areas like Austin, Texas and\nTucson, Arizona are enjoying impressive\nresidential water conservation results\nprove that over 50% of\nway of these techniques.4 Nearly 250,000\ndesigns to realize substantive potable\nsavings.\npolluted urban areas, rainwater is\ngenerally clean, can be purified with\nirrigation and toilet purposes. The\nconsideration of applying rain harvesting\nattributable to these home design\nelements. Rain harvesting achievements\nlike those made at Tucson's Civano\ndevelopment, which is touted as\nAmerica's first sustainable community,\na home's potable\nwater consumption can be eliminated by\nother Americans harness similar home\nWith the exception of downfall in some\nminimal filtration, and is at least suitable\nfor eliminating potable water use for\nachievements made at places like Civano\nand the general suitability of rainwater as\na potable water substitute merit the\n\nboth large home tract development and\nmunicipal water supply problems are civic\nnorms. Given these constraints, warm,\nhumid climates like Florida are the ideal\nsettings for siting new design proposals\nthat further integrate rainwater harvesting\nsystems into current in-home water use\nand distribution regimes. Conducting such\na design exercise is to experiment with\nmaking the home a more sustainable\nentity, and such an experiment is\nsubmitted below.\nPrior to advancing a new and\nintegrative sustainable home design, we\nwould be wise to constrain, and thus\nlegitimatize our design practices according\nto current building conventions. First and\nforemost, it is necessary to understand\nrainfall dynamics and the storage volume\nachievable given a designated rain\ncatchment surface. Second, daily and\nmonthly user requirements must be taken\ninto consideration to envision the\nsubstantiality of attainable results. And\nlast, building conventions and financial\nconsiderations must shape any rethinking\nof in home water regimes, in order to\navoid excessive project costs and\nconstruction difficulties.\nFlorida receives about 55 inches of\nrainfall each year,5 which, considering that\n1500 square feet of catchment surface can\naccumulate 825 gallons per inch,6 permits\naverage catchment volumes on the order\nof thousands of gallons of water each\nmonth. As the figure below illustrates, the\nareas in consideration could collect 2000\ngallons of water at least eight months of\nthe year.\nMonthly rainfall (gallons) collectible from a 1500\nft2 catchment surface.\nThese catchment volumes are substantial\nconsidering daily and monthly user\nrequirements, which tally to 224 gallons\ndaily and about 6700 gallons per month.7\nA cistern system capable of storing\nexcesses of 3500 gallons a month could, if\nused in conjunction with conservational\nappliances and xeriscape landscaping\ntechniques,8 reproduce residential potable\nsavings comparable to Civano results.\n\n$2000-$3000 dollars dependent on cistern\nAnother helpful way of rationalizing\n30-60 gallons, and 10-30 gallons daily for\nprovided 4700 of gallons storage space.\ndictate that for an appropriate storage\nthan $5000-$6000. In all likelihood these\nconstraints further assert that this 8 foot\nTaken together, these figures and\npotential.\nby connecting a rooftop and gutter\nconstruction, which consist of piping\nmaterials used.\npotential home water savings is to specify\nwater uses that might easily be eliminated\nas draws on potable municipal supplies.\nEssentially, this means deciding the water\nuses for which rainwater may constitute an\nacceptable substitute. Upon preliminary\nexamination, toilet and irrigation uses\nseem to be the most promising candidates\nfor substitution, and with minimal\nfiltration commercially available to cistern\nusers laundry uses might also be curtailed.\nEliminating these water uses, which\nrequire approximately 80 gallons, between\na four person home, could reduce home\npotable water consumption by up to 70%\nRelevant financial realities, however,\nsystem to appeal to likely clientele (large\nhome tract developers), the entirety of\nadded project costs must not exceed\nconventional home building costs by more\ncost constraints would limit system\ncapacity to a maximum of 4000 gallons,\nwhich could provide for 60% of monthly\nhome water needs. Spatial and building\nhigh, 9 foot diameter cistern must be\nembedded in a concrete slab foundation.\nconstraints reiterate that designing more\nintegrative rain harvesting systems is a\ncomplex but promising exercise in mining\nconsiderable in-home water savings\nPractically, these ideas might work\ntheir way into conventional home designs\ncatchment assembly to a solar and sand\nand gravel filtration apparatus that then\nfeeds a 4000 gallon cistern embedded in\nthe home's foundation. Attaching the extra\nsystem components necessary for\ninfrastructure, solar panel and distillation\nassemblies, and filtration mechanisms,\nwould admittedly add to project costs.\nHowever, as Civano investment returns\nsuggest, the private and municipal utility\n\nadded costs.10\nsavings possible from potable water use\nreductions may very well justify these\nThe system might manifest\nitself to resemble the roof assembly\nA roof assembly sketch. Red lines indicate the path of water flow from gutters into a filter, from the filter\nto a solar distillation panel, and then from the filter-panel assembly to a foundational cistern and,\nThe logic underlying the above design\nto feed appliances. The only non-\nattic space instead of living areas below.\nAs a further exercise in approaching\nsustainability through residential and\nintegrating water storage into conventional\nprefabricated \"tank-panels\" situated\nbetween wall studs, then energy costs for\nultimately, home appliances.\nis derived from conservational ideals. The\nfilter, solar panel, and cistern assembly is\ndesigned to minimize piping distances and\nlimit the work that pumps must perform\nagainst gravity, improving upon traditional\nexternal cistern systems by increasing\npumping proximity and utilizing rainwater\nfoundational spatial allowances that must\nbe made are for battery storage, structural\nsupports, and maintenance access ways,\nall of which might be relegated to occupy\nmunicipal resource efficiency, the idea of\nwall stud and insulation assemblies was\nassessed. The premise of this concept was\nthat if homes could also store rainwater in\nhome temperature control could be\n\nreplaced by a green-powered system that\nregulated temperature by recycling wall\npanel water through solar heating and\nconvection cooling mechanisms. This idea\nwas dashed however, because of concerns\nthat water does not provide a sufficient\nthermal mass. It seems that the appliance-\noriented approach is a more viable way of\nreducing home consumption and making\nthe home a more sustainable entity.\nBefore realizing potential water\nsavings, further research is needed to\nexamine rainfall dynamics and design a\nfunctional, cost-effective water system\nthat balances supply draw down and storm\nreplenishment flow regimes. Clearly, that\nresearch is justified, for if such a retooling\nof in-home water flows can save on over\nhalf of home use, then figures on savings\nper developed community will be equally\nsubstantial. Were each home in a 1000\nhome residential development to save 60%\nof its water consumption, then the\nresponsible municipality entity could cut\n4,000,000 gallons from its monthly\ndelivery load. A county with 20 such\ndevelopments could realize potable\nsavings on the order of billions of gallons\neach year.\nSources:\nwww.ci.tucson.az.us/water/water_resources/reclai\n[Accessed\nwww.stpete.org/wwwrecla.htm\n]\n/\n/\n[\n4 - See figures at\n//\n/\nt/\n5 - For Florida rainfall figures, see\n/\n]\n6 - For calculations, see the report at\n/\n/\n.\n/04]\nhttp://www.xeriscape.org/\nxeriscape in practice, go to\n9 - See the Texas Rain Harvesting Guide at\n/\nand\n1 - For more information on reclaimed water\nquality, see the Tucson website at\nmed_water/reclaimed_water.htm\n3/23/04]\n2 - St. Petersburg, Florida, distributes reclaimed\nwater to 7000+ residents. See\n[5/4/04\n- To examine greywater quality, see\nwww.ag.arizona.edu/pubs/garden/mg vegetable ro\noti ng.html 3/23/04]\nhttp: www.civanoneighbors.com docs/environmen\nCivano Water2003FNL.PDF [2/27/04]\nwww.worldclimate.com cgi-bin/data.pl?ref=\nN27W08 2+2200+088021C [4/3/04\nwww.civanoneighbors.com docs/environment revi\nsed 2civwaterfinal.pdf [2/25/04]\n7 - For home water usage figures, consult\nwww.ga.water.usgs.gov/edu/qahome.html\nEstimates range but confirm that usage is 60-80\ngallons per person per day. [4/3\n8 - For information on xeriscape landscaping, see\n. To see Floridian\nwww.sfwmd.gov/newsr/2_photo.html [3/23/04]\nwww.twdb.state.tx.us/assistance/conservation\nCons-image/Downloads/RainHarv.pdf [3/23/04]\n10 - Civano achievements repaid an added $4000\ninitial investment in 2 years. Potential municipal\nsavings from initiating rain harvesting cistern\nrebates instead of extending reclaimed water\nsystems could also be substantial. See\nwww.sustainable.doe.gov/success/civano.shtml\nwww.rmi.org/images/other/Businesses/NC99-\n19k_AqueousSltns.pdf [3/23/04]\nPictures from:\nhttp://architecture.about.com/library/blmurcutt-\nmagney-house.htm\nhttp://www.twdb.state.tx.us/assistance/conservatio\nn/Alternative_technologies/Rainwater_Harvesting/\nRain.asp\nhttp://www.twdb.state.tx.us/assistance/conservatio"
    },
    {
      "category": "Resource",
      "title": "finallin.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-183-sustainable-design-and-technology-research-workshop-spring-2004/ad9a548c35cc411f422a748e0d72844e_finallin.pdf",
      "content": "BACKGROUND\nA case study comparing three buildings of the same\nrating was performed on the U.S. Building Council's\nLEED (Leadership in Energy & Environmental\nDesign) program, revealing serious flaws in the\nprogram's method of measuring sustainability. For\nexample, the three buildings had varying impacts\non the environment, which depended on what cat\negories most credits were earned in. Some credits\nproved meaningless because of low standards\nand easy achievability. Also, there was a lack of\naccountability in actual building performance; too\nmany credits were based on inaccurate simula\ntions and modeling. Although LEED requires much\nimprovement, it is a valuable tool for architects to\nincorporate sustainability into the design process.\nSimilar evaluation systems exist such as UK's\nBREEAM (Building Research Establishment En\nvironmental Assessment Method) and Canada's\nBEPAC (Building Environmental Performance\nAssessment Critieria), but a void needs to be filled\nfor buildings in less developed countries. Using\nJamaica as a model, this design project attempts to\ncreated a sustainable design standard for low-in-\ncome housing in tropical climates.\nTHE NEED FOR A STANDARD\nCurrently, the majority of new low-income housing\nin Jamaica is built of concrete.or cinder block walls\nreinforced with steel. This construction is stable for\nhurricane and seismic zones, cheap, and easy to\nconstruct. A house building kit developed by Royal\nGroup Technologies, a Canadian company, takes\none month to complete including foundantion, sew\nage, water tank, and kitchen cupboards. A design\nfor Habitat for Humanity is inspired by the classic\nAmerican rowhouse with few windows.\nA SUSTAINABLE DESIGN STANDARD\nFOR LOW-INCOME HOUSING\nIN TROPICAL CLIMATES\nCHRISTINE LIN\nWhat these mass-produced homes lack is a re\nsponse to the climate and vernacular architecture\nof Jamaica.\nTraditionally, the smaller house in Jamaica follows\na vocabulary of wood structure, wood louvres for\nwindows, and a verandah as the main living space.\nBecause of the hot, humid climate, life is lived more\noutdoors than in. Some homes are composed of\nseveral connected buildings, each serving a dif\nferent function. While the current house designs\ndo provide decent shelter, it is possible to create\na smarter and more comfortable design without\nsignificantly increasing costs.\nDESIGN FOR CLIMATE\nBecause mechanical means of thermal comfort are\nnot available, simple sustainable design measures\nare particularly well-suited for this demographic.\nThere are essentially four different climatic condi\ntions to consider during the design process. The\nyear-round temperature averages in the low 70's for\nthe lows and upper 80's to lower 90's for the highs.\nThe rainy season is long, approximately 5 months,\nwith October receiving an average of 7 inches.\nBecause of Jamaica's close proximity to the equa\ntor, the sun is directly overhead, which makes the\nmaximum heat gains on the east and west sides.\n\nA steady wind blows from the northeast throughout\nthe year.\nDesign guidelines for hot, humid climates were\nresearched and compiled.\n- Windows placed in opposite walls provide for\ncross ventilation, but should notbe directly lined up\nto promote mixing of the air within the room.\n- Casement windows can be used for redirection of\nthe wind if necessary.\n- Shuttered windows allow for shade.\n- Windows on the east and west walls kept at a\nminimum create less solar heat gain.\n- Louvred windows allow for the maximum ventila-\ntion and weather protection.\n- Roof space ventilation reduces heat build-up.\n- A long and narrow floor plan with the long axis\noriented east-west minimizes heat gain.\n- Open plan living spaces with high ceilings maxi-\nmize air movement.\n- Walls perpendicular to the air flow should be\nminimized.\n- Elevation of the house improves ventilation be-\nneath.\n- Extensive verandahs provide shade.\n- Metal roofs with reflective coatings allow rapid\ncooling at night.\n- Materials with high thermal capacity such as\nbricks, concrete, etc. should be avoided.\nDEVELOPING A STANDARD\nBecause of the narrow scope, a standard based on\nthe structure of LEED can be simplified and more\ndetailed. The criteria gathered can be divided into\nthree different categories: natural ventilation, shad\ning, and materials. Other design factors that could\npossibly be included are water collection, energy\nsources, and waste disposal.\nCategory\nCredit\nWeight\nNatural Ventilation 1.1 Window Placement- indoor airflow parallel to outdoor wind conditions\n1.2 Airflow Path- indoor airflow traverses room in non-linear path\n1.3 Roof Space Ventilation- airflow through roof space\n1.4 Elevation of House- air circulation beneath house\n1.5 Window Design- simultaneously providing ventilation and shade\n1.6 Flow Compliance- less than 50% of square footage more than 2\nrooms deep\nShading\n2.1 Orientation on Site- long axis of building along east-west direction\n2.2 Mnimizing Heat Gain- no windows in east and west facing walls\n2.3 Optimal Floor Plan- around/at least 1:1.7 ratio width to length\n2.4 Outdoor Space Shading- verandahs at least 3' deep covering 50% of\nbuilding perimeter\nMaterials\n3.1 Minimal Heat Absorption- lightweight construction for walls\n3.2 Cooling- heat conducive material for roof\n3.3 Recycled Content- at least 25% of building materials\n\nThe credits are weighted to reflect the most essen\ntial elements for building in tropical climates. Out of\n26 total points, 18 points would have to be achieved\nto be considered sustainable. The assigning of\npercentages and hard numbers to some of the\ncredits is somewhat arbitrary; more research would\nbe necessary to determine the appropriateness of\neach.\nAPPLICATION & EVALUATION\nIn Jan Wampler's Jamaica House Workshop, a\ndesign for a single-family house was created for\nHabitat for Humanity. The initial square footage\nrequirement was 280, and expansion up to 800\nsquare feet had to be allowable. Although the\ndesign focus was on meeting those requirements,\nbasic ideas of natural ventilation were incorporated\nfrom the beginning with inspiration from Glenn\nMurcutt's Marika Alderton house. A long, nar\nrow elevated plan was developed with extensive\nlouvred windows. However, as the criteria for this\nstandard were developed further, modifications\nwere made to the design, such as the reduction of a\nconcrete wall, the off-setting of the roofs for ventila\ntion through clerestory windows, and the expansion\nUnexpanded Jamaica House- North Elevation\nUnexpanded Jamaica House- South Elevation\nExpanded Jamaica House- Plan\n\nUsing the standard developed, the original Jamaica\nHouse design would have received 17 out of 26\npoints, while the final design would receive 24 of 26\npoints.\nCONCLUSION\nSimply having a guideline for design would improve\nthe sustainability of the housing currently being built\nin tropical areas. Much growth is occuring in those\nareas and as resources become scarce, sustain\nable measure will become increasingly necessary.\nHowever, implementation of a standard would be\ndifficult as the infrastructure of the building industry\nis not quite similar to that of more developed coun\ntries such as the U.S. and U.K.\nFurther steps to take in the development of this\nstandard would be to cover more areas of sustain\nability and expand it to other building types for a\ntropical climate. It would also be useful to some\nhow incorporate building, material, and energy\ncosts as financial resources are limited in these\nareas. For example, while the Jamaica House\ndesign is more sustainable than the typical con\ncrete house, it is likely more expensive because\nof its larger footprint and elevation off the ground.\nHowever, in terms of long-term sustainability, it may\nbe more cost effective.\nCredit\nWeight\nOriginal\nFinal\n1.1 Window Placement- indoor airflow parallel to outdoor wind conditions\n1.2 Airflow Path- indoor airflow traverses room in non-linear path\n1.3 Roof Space Ventilation- airflow through roof space\n1.4 Elevation of House- air circulation beneath house\n1.5 Window Design- simultaneously providing ventilation and shade\n1.6 Flow Compliance- less than 50% of square footage more than 2\nrooms deep\n2.1 Orientation on Site- long axis of building along east-west direction\n2.2 Mnimizing Heat Gain- no windows in east and west facing walls\n2.3 Optimal Floor Plan- around/at least 1:1.7 ratio width to length\n2.4 Outdoor Space Shading- verandahs at least 3' deep covering 50% of\nbuilding perimeter\n3.1 Minimal Heat Absorption- lightweight construction for walls\n3.2 Cooling- heat conducive material for roof\n3.3 Recycled Content- at least 25% of building materials\n?\n?\nCredit Tabulation for Jamaica House"
    },
    {
      "category": "Resource",
      "title": "finalmeguro.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-183-sustainable-design-and-technology-research-workshop-spring-2004/9dd817d79c3fdb08297fc8b9c9d903fd_finalmeguro.pdf",
      "content": "Arch 4.183: Sustainable Design and Research Workshop\nProfessor Andrew Scott and Professor Leon Glicksman\nMay 2004\nWendy Meguro\nAero-acoustical Facade Design Proposal\nSummary\nThe design is an experiment of a facade system component\nthat allows for adequate airflow for natural ventilation while\nabsorbing outside noise. Once the basic airflow and acous\ntic parameters were defined, the additional challenge to ad\nmit daylight and provide views was considered. This prod\nuct is applicable for an office in an urban environment in a\ntemperate climate.\nSustainable Impact\nToday, climatically-responsive buildings are designed at an\nunprecedented scale with the aid of high-tech facades com\nbined with elaborate building management systems. Build\nings consume over half of the nation's energy, implying po\ntential for designers to prescribe significant energy savings.\nA thoughtful designer recognizes that air conditioning ac\ncounts for a significant portion of the building's energy use,\nand takes advantage of natural ventilation in appropriate cli\nmates. In addition to conserving energy, operable windows\nconnect the occupants to the environment outside and lend\na sense of control over their immediate surroundings. There\nis a need for an assembly that would allow for airflow com\nparable to an open window that mitigates outside noise.\nContext: Street noise encourages typical offices to keep\nwindows closed, preventing natural ventilation.\nGenzyme Building Ventilation Strategies\nThe Genzyme building by Behnisch, Behnisch & Partner\nlong with engineering firm Buro Happold demonstrates the\nenergy-saving potential and occupant control benefits within\nthe office building typology.\nThe Genzyme building relies on the stack effect of its 12\nstory atrium to exhaust air from much of the office space.\nThe double-facade is a climatic buffer which selectively ex\naggerated into a four-foot deep 'loggia' space that becomes\ninhabitable during the milder spring and fall seasons. The\noperable windows allow for natural ventilation and night-\ncooling as energy-saving, comfort-inducing alternative to\nair conditioning.\nThe aero-acoustical window could be applied in the Genzyme\nbuilding's facade to mitigate noise from surrounding con\nstruction sites. The product could also be used as an inte\nrior partition wall in areas that are 'sealed' meeting or offices,\nallowing air to travel from the perimeter to the atrium while\nproviding acoustic privacy and preserving the aspirations\nfor transparency.\n\nResearch: Design Precedents\nOne major deterrent to using natural ventilation in an urban\noffice is the justified fear that an open window will admit\nunwanted noise and dirt particles. This problem has been\naddressed in a number of commercially available products.\nFor example, the acoustical louvres typically used in fan\nrooms are designed to allow for airflow while mitigating the\nnoise from the HVAC equipment. The sound attenuation\nproperties of these louvres would not be sufficient for the\nfacade of an inhabited space such as an office. Another\nproduct currently on the market is a vent that may achieve\nthe quantitative airflow and acoustic objectives, but lacks\nan aesthetically-pleasing, architecturally-integrated design.\nDesign Proposal\nHow might the airflow, acoustics, and daylight be optimally\ncombined and integrated into a single product that can be\nintegrated into an architectural facade?\nFirst, design parameters for airflow and acoustic properties\nmust be established. The airflow calculations were estimated\nwith the assistance of Professor Leon Glicksman. The fol\nlowing assumptions suggest a base case from which further\nforms can be derived.\nWind speed: 8 mph\nDucts in facade: 6 feet long, 8\" sq. cross-section\n% openings in facade: 5%\nAir changes/ hour: 11\nOffice volume: 3 m tall x 10 m deep x 20 m long\nThe acoustic parameters were derived from a series of calcu\nlations with the assistance of MIT Building Technology stu\ndent Omar Saad. Based on AHRAE guidelines for a 12\"x12\"\nduct 6' in length, with a 1\" thick fiberglass lining, the follow\ning graph was plotted and corresponding Sound Transmis\nsion Class (STC) ratings were derived.\nSound Transmission Class:\nOffice with closed windows:\nOffice with 5% open windows:\nOffice with duct described above: 27\nThe plotted graph determines the STC rating of the duct\ndescribed above.\nThese ratings demonstrate that with open windows, the\noccupants inside will perceive sound half as loud as the\noutside levels. The modeled duct is practically as\neffective as the closed windows (the difference between\nand STC rating of 27 and 30 is almost imperceptible).\nThe duct described above is used as a reference point\nfrom which design ideas are initiated. The following\ndesigns would require physical testing to determine their\neffectiveness.\nContext: The proposed office vol-\nume (left) may be part of a cross\nventilation system (middle) or\nbuoyancy-driven system with an\natrium (right).\n\nDesign Proposal 1: Curtain Wall Component\nThe first design proposal is essentially a 6' tall double fa\ncade with operable vents, an air filtration device, fiberglass\nlining on two sides, and a sound-absorbing micro-perfo-\nrated plexiglas in the interior cavity (a product marketed at\nmicrosorber.com). This assembly could be integrated into a\ntypical glazed curtain wall facade. Its transparency allows\nfor daylight penetration as well as views.\n\nDesign Proposal 2: Undulating Glass\nThe second design proposal is a variation of the first pro\nposal of 6' high panels suited to a curtain wall facade. It\nconsists of undulating cast glass panes that might deflect\nsound waves within the double-skin cavity to the sound ab\nsorbing lining on the other two sides. The physical model is\nsolid to demonstrate the curved surface, although in reality\nthis might be constructed using a translucent cast glass.\n\nDesign Proposal 3: Tubular Series\nThe third design proposal envisions an atypical construc\ntion method where structural ribs are connected by a series\nof tubes which comprise the wall as well as provide ventila\ntion. The fiberglass-lined tubes are 4' in length and have\noperable vents on both exterior and interior surfaces. Air\nflow could be adjusted by the number of tubes vents opened\nat any given moment. The tubes are a translucent, water\nand weather-resistant material."
    },
    {
      "category": "Resource",
      "title": "midbraddock.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-183-sustainable-design-and-technology-research-workshop-spring-2004/72899c1e6a9afa65bd893f58d9a51e46_midbraddock.pdf",
      "content": "Jon Braddock\nBedZed Case Study\nAside from car use and buying exotic foods, the single\nfollowing energy saving strategies have been implemented\nbiggest impact each of us has on our environment has\nin BedZed to achieve zero carbon dioxide emissions:\nto do with the way we use and run our buildings. Most\nbuildings (in general) behave like gas guzzling cars and\n1. Providing an on site CHP (Combined Heat and Power)l\nconsume energy at astounding rates to heat, cool, light,\nplant to generate elec\nsecure and maintain themselves and creating waste\ntricity and heat\nprofusely in the process. In the U.S. buildings account\nfor 1/3 of all energy consumed and produce 35% of the\n2. Selecting materials\ncountry's carbon dioxide (the chief pollutant blamed for\nthat have been sourced\nclimate change).\nwhere possible ideally\nfrom with in a 35 mile\nIt's obvious then that an ecological building must be de-\nradius of the site. This\nsigned differently than a building that consumes energy\nstrategy is in place to\nfrom outside itself (for example, the national grid) and\nminimize the transport\nejects its waste for disposal outside itself (for example,\nof people and equip-\nthe local authority). So what are the priorities in design\nment\ning an ecologically responsible building? We can begin\nto understand them through an analysis of the Bedding\n3. Operating an on site pool car to reduce car ownership\nton Zero Energy Development (BedZed).\nand journeys\nBedZed is a prototype development of shared housing\n4. Using airtight methods of construction\nand workspace units that has been designed to achieve\nzero net carbon dioxide emissions from the buildings.\n5. Incorporating wind cowls that have been developed spe-\nThey do this by avoiding the use of fossil fuel. What are\ncifically for natural vent illation with heat recovery\nfossil fuels and how are they relevant? These fuels are\nin the form of coal, gas and oil and when they are burnt\nOf the previous list , the most innovative strategy is the\nto heat and cool our buildings they emit an amount of\npresence of a CHP plant on the premises. This plant oper\ncarbon dioxide that cannot be captured by plants. The\nates off of 850 tonnes of wood chips a year. The chips\n\nare sourced from the London Borourghs of Sutton and the\nfuel comes in the form of small logs or chips. The wood,\nthrough a process of heating at a very high temperature,\ngives off a gas which is filtered and then used to power the\nengine, thus generating electricity. The heat from the engine\nis used to produce hot water. This process is carbon neutral\nbecause when the wood is used and burnt in the CHP unit, a\nsimilar amount of carbon dioxide reenters the atmosphere.\nTherefore the CHP will provide electricity, heat and hot\nwater with little or no impact on the global environment. In\naddition, the total embodied energy of the CHP plant itself\nis around 145,000kwh with equivalent carbon emissions of\naround 75,000kgs, however the CHP will produce around\n726,000kwh of electrical energy per year.\nSustainable materials were an integral part of the design\nprocess as well as their source location. Local brick, con\ncrete aggregate, and precast floor planks can all be sourced\n35 miles of the site, ensuring that all bulky materials have\na reduced embodied energy.\nAdopting the 35 mile radius\nlimit for local sourcing of materials ensures that BedZed will\nuse local materials, respect the local market conditions and\nrespect the existing townscape. In addition, 15% of the ma\nterials used were reclaimed or recycled. For example, the use\nof aluminum, a material with a high-embodied energy was\nminimized while reclaimed steel was favoured. Other ex\namples of reclaimed materials are structural steel and timber\nfor internal wall partitions. By using these, resources have\nbeen saved from being land filled, the sites embodied\nenergy has been reduced and cost savings have been made\ntoo. Other examples of recycled materials include crushed\nglass (sand) which can be used as bedding for paving slabs,\nand crushed aggregate for use in the sub-base.\nBedZed also saves en\nergy by providing a car\npool service to reduce car\nownership and journeys.\nThe idea of the service is\nto create carbon neutral\ntransport.\nThis service\noperates off of south fac\ning PV panels that gener\nate enough electricity to\npower up to 40 electric\ncars for 10,000 miles a\nyear. One car in a car pool displaces four to five privately\nowned vehicles. In addition, an average family in the UK\nemits 4 tonnes of Carbon Dioxide traveling each year and\n8 tonnes on food prep, packaging and food miles. While it\nis important to provide this service, it is also important to\nmeet the cars annual electrical requirements from renew\nably sourced energy and in BedZed's case they achieve this\nthrough 14 square meters of photovoltaic panels. The panels\nturn solar power into motive power an enable the driver to\ntravel 8,500 miles per year on solar energy. In the end, the\ncar, battery conversion price and the photovoltaics still cost\nless than the cheapest fossil fueled people carrier, and have\nequal functionality in an urban area.\nAnother energy saving technique the BedZed incorporates is\nthe use of airtight construction methods. All of the\nbuildings are super insulated and have south facing glazing\nto provide useful heat gains in the winter. The high levels\nof insulation greatly reduce heat losses through the building\nfabric and it follows that ventilation heat losses become\n\nvery significant. Standard houses let outside air leak in\nthrough the cracks and openings, such as between window\nframes and walls. The use of super insulation and high per\nformance windows and doors means the heat loss through the\nwalls, roof, floor and windows is minimized. This also means\nthat the heat loss due to cold air coming into the house from\noutside becomes insignificant. It follows that this air leakage\nis one of the most critical factors in making a low energy\nhouse work without a heating system. At BedZed the general\nconstruction consists of plastered block work party walls\nat 6.5m on center supporting precast concrete plank floors.\nPerimeter cavity walls are of load bearing block work, 300\nmm of thermal insulation and an external face of brickwork.\nThe windows are wood framed and triple glazed. In addition,\ntypical UK building requirements state that air permeability\nis not to exceed 10 cubic meters per hour per square meter\nof external surface at an applied pressure difference of 50pa.\nAir permeability results at BedZed however are down to 2-3\ncubic meters per hour per square meter of external surface at\n50pa differential pressure.\nThe final strategy implemented that makes BedZed a zero\nenergy development is the use of a wind driven natural\nventilation system where outgoing stale air pre heats incom\ning fresh air. In this system fresh air is drawn into a smaller\nfunnel and is transported via pipes or ducts to the ventilation\noutlets just above the living room and bedrooms. Warm stale\nair is removed from the kitchen and bathroom and is taken by\nseparate air ducts back up to the wind cowl. This air passes\nthe cold fresh air coming in and although the two air streams\ndo not come into physical contact, the outgoing air gives its\nwarmth to the fresh air coming in, thus \"preheating\" the fresh\nair. This transfer of warmth takes place in a heat exchanger\nand the stale air then passes outside via the other, larger fun\nnel on the wind cowl. People want to breath fresh air that is\ndevoid of pollutants and this system allows the air ventilation\nto be controlled and implemented thus providing a clean en\nvironment to breathe in.\nBedZed is a testament to the difference between good, sound\necological building design and all others because it goes to\ngreat efforts to eliminate its dependency on the local author\nity for energy. The drawback to this ambitious carbon neutral\nlifestyle is that it is only achievable if there are sustainable\ntechnologies to support it and people willing to buy into a\nvery different way of life than most of us are used to. This\nquote from a content resident highlights the effect that such\nan environment has on the individuals that claim this lifestyle\nas their own and recognize its potential as a way of life.\n\"So it suits slightly lazy eco-warriors such\nasMarleen Stumpel, who bought a three-bed-\nroom maisonette last year. 'I guess I'm like\nmost people,' she says. 'I want to do things\nfor the environment, but I have a busy life.\nSo I want it to be really convenient. I want it\non a plate.' And so it is: if you want the whole\nGood Life thing, it's there (there's even a\ngreen lifestyles officer on site). 'But you don't\n\nhave to get involved,' says Stumpel. 'Most of\n\nthe green stuff you don't even notice.'\"\nThe Guardian/April2003"
    },
    {
      "category": "Resource",
      "title": "midbrown.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-183-sustainable-design-and-technology-research-workshop-spring-2004/6201927fe242e42866257f45a5a7db3b_midbrown.pdf",
      "content": "Carrie Brown & Wendy Meguro\n\nIn critically examining the Genzyme building,\none must explore the intent and effectiveness of\nits sustainable goals. This report asks three main\nquestions:\n1) What were the successes and hurdles in exe\ncuting sustainable design process?\n2) The ventilation and daylighting technologies are\nnon-standard U.S. - how are they functioning?\n3) How effective are the other \"green\" applications\nin the building?\nDesign Process\ndesign process\nThe Genzyme Building, a competition-winning design by\nGerman firm Behnisch, Behnisch and Partner, features astute\nlighting and ventilation technologies alongside a plethora\nof sustainable strategies, effectively executing \"green\" de\nsign in the US. This raises the question, \"How did they do\nit?\" Environmentally-conscious architecture often carries\nstigmas of an earthy aesthetic, higher costs, and undefined\ntesting methodologies. The Genzyme building defies these\nbarriers with a design process dependent on select variables:\nlease security, enlightened management, design expertise,\nresearch capabilities, interpersonal familiarity.\nWhat set of conditions nurtured the seeds of sustainabil\nity?\nIn 1998, developer Lyme Properties purchased the 10 acre\nbrownfield site and began remediation. In Genzyme's case,\nall of the soil was left in place and capped with the building's\nfoundation. Next, Master Planners Urban Strategies of To\nronto administered a competition for the mixed-use devel\nopment, which consisted of a \"hotel, housing, life science\nlabs, office space, shops, restaurants, underground parking\nand open space.\" (Gould) The site goals include enhancing\npedestrian life, creating a variety in building forms, and\navoiding the sense of a homogenous corporate campus. \"The\ncompetition brief had not stipulated sustainable design, but\nleft room for it.\" (Gould) Within the competition jury,\nGenzyme CEO, Henry Termeer, committed to a relatively\nlong-term lease with Lyme Properties.\nHaving a secured client proved pivotal to the execution of a\nsustainable design for several reasons. First, \"Genzyme [is]\nan international company with image and worker comfort\nphoto sources: 1-Behnisch\n\nConceptual Diagram\nin mind and a Dutch CEO already open to sustainability\"\nwho served on the competition jury. (Gould) Secondly,\nGenzyme, being a long-term tenant, had motivation to in\nvest in the building's sustainable technologies, above and\nbeyond Lyme Properties' capacities. \"If you create an open\nenvironment that makes employees feel good, the measure\nof the increased productivity is incredible,\" [Termeer] says,\n\"People feel more creative and there is less turnover; people\nlose time when they are uncomfortable. We can justify the\ncapital expense based on this.\" (Gould)\nThe building is designed as a \"city within a city\", concen\ntrating on the individual's interaction with other people\nand his environment. Integration of gardens and control\nover one's lighting and climate enhance the occupant expe\nrience.\nWhat were the hurdles in executing sustainable design? How\nwere they overcome?\nAmongst the designers, the key component to instilling\nconfidence in the clients and contractors was experience\n- implying a good reputation and demonstrable projects.\nEngineer Tony McLaughlin, of Buro Happold, is a respected\nexpert in the field, having successful projects with similar\nsystems (such as Wessex Waterworks). Behnisch, Behnisch\nand Partner has designed multiple projects with heliostats,\nemphasizing that most of the technologies used are not\nnew, just new to the US. The designers had to convince\nthe contractors, who did not have experience installing\ncertain systems, that they were build-able, operable, and\neconomic.\nA rigorous testing and research process proved the lighting\nand ventilation systems were both functional and superior\nto conventional design. Lighting consultants Bartenbach\nLichtLabor of Austria designed for maximum daylight\npenetration via a variety of technologies and reflective\nsurfaces. Engineering firm Buro Happold (located\nin the UK and New York) is unique compared to\nmany US firms in that it has the computational and\nphysical testing and analysis capabilities required\nfor a building with an atrium, double facade, and\nno mechanical humidification.\n\"Green\" design features are often eliminated\nbecause of budget constraints. How was this\navoided?\nIn any project, budget constraints tug at the\nthreads of the ambitious design fabric, threatening\nto unravel brilliant intentions. The Genzyme case was no\ndesign process\nexception, thus the design team had to demonstrate that the\nsystems were mutually dependent on eachother, therefore\none could not be displaced without affecting the others.\nFor example, the designers had to resist the contractor's\nsuggestion to change the concrete frame to a steel construc\ntion, citing that the concrete's thermal mass was vital to the\nsuccess of night cooling in summer.\nThe contractor, Turner Construction, has made great strides\nin developing its green construction practices in a few recent\nprojects. Their well-established relationship with Genzyme\nmade Turner a logical choice for contractor and construction\ncompany. Turner learned how to install certain components\nfor the first time while deciding that other suggested systems\nwere not feasible. The Boston division of Turner Construc\ntion has the advantage of nation-wide offices from which it\nmay draw on the expertise. As is the job of any contractor,\nTurner strove to keep the project within budget and on time,\nresulting in sub-optimal conditions for certain components,\nsuch as the vertical lamellar development and curtain wall\nselection. Turner lacked experience constructing two pro\nposed systems, the raised floor and radiant ceilings, which\nwere value engineered out of the final design.\nThe architects also issued green specifications to insure the\nuse of ecologically-responsible products and fulfill LEED\nrequirements. Manufacturers and contractors responded\nto the challenge of meeting these sometimes unfamiliar\nspecifications.\nWhat is design team's role once construction is com\npleted?\nphoto sources: 1-Behnisch\n\nCompleting the design and construction represents the ma\njority of the labor required to execute a sustainable build\ning, yet the commissioning and management determine the\nexecution of the design intent. In addition to the intense\ncommissioning process required for LEED certification,\nGenzyme's own engineers are collecting data and fine-tun-\ning the high-performance building. The extensive building\nmanagement system must be calibrated to reduce disturbance\nto occupants, determining the optimal dead-band in which\ntemperature and light may fluctuate without response from\nthe building's systems.\nIn conclusion, the effectiveness of the design process was\ndependent on the dedication of the individuals on the design\nteam. The integrated design approach, including architect,\nengineer, client, and consultants from the initial design\nLighting\nWhat were the basic goals during the design process?\nBartenbach LichtLabor of Innsbruck Austria sought to\nbring natural lighting into as much of the building as\npossible. \"Specifically, at least 75% of the building had to\nreceive 2 percent daylight, and all workspaces had to have\ndirect visual contact with the outdoors\" (Architecture, 64)\ndesign process\nlight-\nWhat are the main components of the lighting system?\nSeven heliostats on the north side of the roof direct light\nto fixed mirrors on the south side. Light then is directed\nthrough a system of prismatic louvers made of milled\nacrylic. The louvers mechanically adjust to deflect UV\nlight while diffusing natural lighting into the atrium. A\nchandelier composed of the same prismatic acrylic hangs\nin the atrium and also reflects and diffuses light deeper\ninto the building. This moving chandelier, specifically\ndesigned for the building by Bohman Solar, casts rainbows\nthroughout the atrium space. A light wall composed of\nvertical lamellars helps to both reflect light back into the\natrium and allow light to pass through to the inner spaces,\nwhile providing views into the atrium. Reflective flowers\non the ceiling redirect natural light form the atrium when\navailable and artificial light from spotlights when needed.\nOn the ground floor of the atrium, a reflective water pool\ncontinues the light distribution process.\nAlong the curtain wall, horizontal lamellars are\nmechanically adjusted by the control system. While the\nsmooth surface reflects light up to reflective ceilings, the\nperforated surface sends diffuse light directly into the\nadjacent space. During full anti-glare mode, the lamellars\ncan be completely closed, providing maximum shading.\nGlass partitions separate working spaces, while allowing\nsunlight to be directed deep into the building.\nphoto sources: 1-Behnisch\n\ndesign process\nlight-\nHow is the lighting system controlled?\nThe lighting system is fully automated, combining\nnatural and artificial lighting. Sunlight and weather are\nmeasured by a weather station and the information is\nused accordingly. However, there is a dead-band for the\nsystem so the lighting is not continuously changing when\nclouds pass over, etc. While the system is programmed\nto maximize natural lighting, the artificial lights in the\natrium are never turned off automatically during the\nday, providing at least 10% of the lighting needs. The\nautomated system can be overriden manually to meet\nspecific needs of individuals. For example, the shades\ncan be lowered to eliminate any glare or the lights can be\nturned off for a presentation.\nphoto sources: 1-Behnisch, 2-Rick Ames, 3-Brown\n\nHow is this system working?\nThe system is projected to save 40% on electrical needs.\nGenzyme engineers are closely monitoring the system, but\nit is still in the fine-tuning stage.\nIn informal interviews, the employees all expressed their\nappreciation for the natural lighting and outdoor views\nprovided by the system. However, there were a few\nconcerns:\n1.\nThe lighting sensors sometimes malfunction and\ndim the lights in spaces that are inhabited.\n2.\nTo provide light deep into the building, most\nof the dividers are made of glass. While\nsome enjoy this setup, others feel that it is\ndistracting--especially in a meeting setting. In\nmeeting rooms, there are curtains that can be\npulled. However, when we tested these, the\nspace felt much smaller and less pleasant.\n3.\nThe shades are loud when they adjust. This\ncan distract employees or cause problems with\nmeetings and conference calls.\n4.\nThe prismatic chandeliers cast moving rainbows\naround the building. While quite beautiful,\nagain, some were concerned about distraction\nduring meetings.\nphoto sources: 1-Rick Ames\n\nventilation\nVentilation diagram\nVentilation Analysis\nThe Genzyme building can be compared to a human body:\nsensory input from a roof-top weather station allows it to\nrespond to environmental conditions by adjusting its lighting\nand ventilation systems. In addition to the mechanical air\ndelivery system, the three main features that drive air through\nthe building are the twelve-story atrium, the four-foot deep\ndouble facade, and the operable curtain wall windows. The\nventilation system is a combination of user (manual) con\ntrol and building management system's (automatic) control.\nHow do these two coincide for comfort and energy savings?\nHow might the resulting spaces serve to enhance occupant\nexperience?\nVentilation Design Process: Calculated Risks\nHow was the ventilation system designed confidently?\nThe design process for hybrid ventilation (natural and me\nchanical combination) requires extensive environmental\nsimulation in order to take calculated risks. Although this\nprocess is often expensive and time-consuming, it is en\ntirely necessary to ensure that the building will perform as\nexpected. In the case of the Genzyme building, engineers\nwere able to eliminate a humidification system, calculating\nthat the necessary humidity would be supplied by the people,\nplants, and water feature. The design process consisted of\nComputational Fluid Dynamics (CFD) models on select por\ntions of the building; full-scale mock-ups of the facade, and\nmanual calculations. It is estimated that the cost invested in\nthe testing process will be recovered in the operational cost\nof the building in energy savings and occupants' increased\nwell-being.\nAtrium\nIndoor Garden\nAtrium\nBesides creating a beautiful space, how does the atrium result\nin a more comfortable space and energy savings?\nThe atrium provides light, air, views, and social spaces,\nbringing the building to life and venting air through the\nstack effect.\nOccupants have control over their climate through thermo\nstats and operable windows. In informal interviews, only\none of six occupants reported uncomfortable temperatures.\nOne useful suggestion: the management should send out a\nshort email identifying \"five things you need to know\" about\nhow to operate the building.\nThe atrium provides several opportunities for energy-saving\ntechniques such as night-cooling and heat exchangers. First,\nthe windows on the first floor may automatically open at\nnight to flush out the building and cool the concrete frame,\nusing its thermal mass to absorb the heat loads during the\nday, thus reducing the air conditioning demand. Secondly,\nduring winter, the heat exchangers at the exhaust fans warm\nthe incoming, mechanically delivered air.\nHow did the designers deal with fire codes that usually pro\nhibit such a large continuous vertical open space?\nIn some areas, a glass wall separates the office floor plate\nfrom the atrium. Areas open to the atrium use standard\nroll-down fire shutters at the atrium perimeter. Over-sized\nexhaust fans at the top of the atrium pull smoke out of\nthe building. The engineers struggled with the fire codes\ncommittee, urging them not to require an overly powerful\nexhaust system to prevent creating negative pressure that\nwould make it difficult to open lower-level exit doors.\nphoto sources: 1-Behnisch. 2-Behnisch, 3-Rick Ames\n\nLoggia lower vent\nLoggia\nHow is the atrium functioning now?\nDespite a thorough and rigorous modeling process, a build\ning is destined to encounter unpredicted hurdles in operation.\nDuring the winter, the temperature differential drives the\nstack effect at such a high rate, that great negative pressure\nis created within the atrium. The curtain wall, although it\nis of higher quality than the base system in the US, has a\nthin thermal break compared to those in Germany; thus the\nmanagement is now using thermal imaging to manage air\ninfiltration at the lower levels. Having only been occupied\nduring winter months, the atrium's summer performance is\nyet to be determined.\nInhabitable double facade\nThe four-foot inhabitable gap double facade (the\n\"loggia\")covers 32% of the building, adjacent to both\nprivate, enclosed offices as well as open office plan space.\nConceptually, the outer, single-pane glass layer provides a\nbuffer against the climate extremes, moderating the tem\nperature fluctuations at the inner, double-pane glass. How\ndoes the space perform in different orientations, varying\nseasons, and as a social space?\nDoes it make sense to apply the loggia on all facade orien\ntations?\nThe placement of the loggia on all sides of the building ap\npears to assume that the performance at all orientations, at\nall seasons will be desirable. Yet closer investigation reveals\nthat the outer layer of spectrally-selective glass varies in\ntransmittance according to orientation, admitting the most\nlight on the north side and reflecting most on the south.\nHow does the loggia perform as an energy-saver or\nsocial space throughout the year?\nThe facade serves different purposes as the seasons\nchange, while always acting as a moderator. In the\nwinter, the airspace traps both the heat radiating from\nthe building and the solar gain, acting as an insulator.\nAlthough the space does not fall below freezing,\nit is still too cold in winter to inhabit. Spring and\nfall are the optimal conditions for use of the loggia\nbecause of the variety of conditions that may exist.\nThe lower vents may be manually opened and the\ntop vents are automatically controlled with the assis\ntance of the thermostat in the space. The doors to the loggia\nmay be manually opened for more cooling and airflow in\nthe office. Or, the doors may be shut and the vented cavity\nkeeps the inner building facade at a much lower temperature\nthan the outer facade. During this time, it can be assumed\nthat the loggia temperatures will be comfortable to inhabit.\nIn the summer, the loggia will be sealed off from the offices\nand be continually vented to keep the inner window cooler\nthan the outer window. The south, east, and west loggias\nare assumed to be too hot to inhabit during the summer.\nIn conclusion, a tighter seal at the vents would allow for\ngreater insulative properties, and the loggia is probably an\ninhabitable social space on moderate spring and fall days.\nThis poses the question, does the material expenditure pay\nitself off in energy savings? Also, does the loggia afford\nany social space not provided by the gardens, huddle rooms,\nand coffee areas already provided?\nventilation\nphoto sources: 1-Rick Ames\n\nAdditional Technology\nWhat are some of the other 'green' aspects of the\nbuilding?\nA garden and photovoltaic cells are located on the roof.\nThese were added late in the design. The cells provide\nenough electricity for about one or two rooms and it\nseems likely that the main motivation for them was LEED\ncertification.\nGardens are also located throughout the building,\nproviding pleasant common spaces and humidity for\nthe entire building. Additionally, the gardens have soil\nsensors to detect irrigation needs.\nStormwater is collected into two separate tanks. The\nfirst provides water to the gardens while the second\nsupplements the evaporative cooling towers, saving\nthousands of gallons of potable water each year.\nOther water-saving technologies incorporated in the\nbuilding are the waterless urinals and dual-flush toilets.\nThe building's central heating and cooling systems run\non steam that is byproduct from the electrical plant that\nis located next door. The steam translates directly into is\nheat in the winter and powers absorption chillers in the\nsummer.\nAnd finally, there are charging stations for electrical cars\nlocated in the parking garage.\nWe would like to thank and acknowledge\nthose people who have kindly assisted our\ncase study:\nRick Ames, Next Phase Studios\nStephan Behnisch, of Behnisch, Behnisch\nand Partner\nFrank Duffy, DEGW\nTom Lee, MIT\nKonstantinos Tsakonas, MIT\nGreg Otto, Buro Happold\nRick Matilla, Genzyme\nBibliography\n1.\nBehnisch, Gunther, Stefan Behnisch, and\nGunther Schaller. Behnisch, Behnisch &\nPartner: Buildings and Designs. Basel:\nBirkhauser, 2003.\n2.\nBrown, Ray. \"Enlightened Behavior.\"\nArchitecture. February 2004: 58-67.\n3.\nGould, Kira L. \"Prudctivity: Innovative\nsystems put Genzyme's new headquarters at\nthe forefront of green technology.\"\"Metropolis.\nJanuary 2004.\nphoto sources: 1-Rick Ames"
    },
    {
      "category": "Resource",
      "title": "midhelinski.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-183-sustainable-design-and-technology-research-workshop-spring-2004/f47d37415b136a6bc66bbabcbfa57530_midhelinski.pdf",
      "content": "Katice L. Helinski\nGreenwich Millennium Village: planned sustainability?\nThe United Kindom is promoting an urban\nrenaissance through by creating sustainable communities.\nHow does one define this, so that members of a com\nmunity can relate to it and become active members in the\nprocess? The Millennium Village Project, one which is\nstill evolving, brings light to these issues. While it has\nlofty aims of social integration and ecological responsibil\nity, as well as instigation of the creation of a supportive\ngovernmental framework it also makes it evident that the\nnecessary framework is not yet a sufficient construct.\nThe competition\nJohn Prescott, Deputy Prime Minister of the\nUnited Kingdom, has taken an initiative through the\nestablishment of The Urban Task Force to integrate\nsocial, economic, and environmental issues in the\ndevelopment of sustainable communities at a sufficient\ndensity to promote reduction of land and automobile\nuse.1 Additionally, plans will promote redevelopment of\nthe urban periphery, where brownfields of post-industrial\nlandscapes await the purification and the infill of new\nprograms. As a key part of this initiative, the Office\nof the Deputy Prime Minister has begun the Thames\nGateway project, which addresses the waterfront of\nthe Thames River of London that was previously the\nsite of gasworks and factories. Within this long string\nof sites, sits Greenwich Peninsula where the famous\nMillennium Dome, by Richard Rogers Partnership, was\nconstructed for the Millennium celebrations. Rogers\nwas commissioned to design a master plan for the\npeninsula with the design for the Dome, which began\nthe establishment of an infrastructure for a sustainable\ndevelopment, that focuses on the creation of jobs; use\nof new energy and water saving standards; making use\nof modern building techniques and off-site manufacture\nof materials; using good quality design and planning;\npromoting pedestrian transportation and creating a\nsustainable social mix of 35% affordable to 65% private\nhousing. His plan provided for reconstruction of the\nnatural ecosystem of the river's edge and a series of\n'urban villages' designed in an architectural competition.\nHunt Thompson and Associates of London, and Erskine\nTovatt Architects of Sweden--a firm known for numerous\nsocial housing projects--designed the winning plan1.\nThe Goals\nA conversation that is continually being con\nducted in the UK on many levels involves the notion of\ncreating sustainable communities. In order to enter into\nthis conversation, sustainability in this context should be\ndefined. One of many defenitions know as The Aalborg\nDeclaration, adopted at the first European Conference on\nSustainable Cities and Towns, us used by the Urban Task\nForceit treats the sustainable settlement as a self-regulat-\ning interconnected social, economic, and environmental\nsystem which meets its needs and manages its impacts in\nternally, or by fair reciprocal arrangements. In addition,\nthere are seven themes for sustainability that are necessar\nily reevaluated and changed. Currently they have adopted\nseven broad criteria for a sustainable community that are\nlisted on the Urban Task Force website2:\n1. Resource consumption should be minimized\n2. Local environmental capital should be protected and\nenhanced\n3. Design quality should be high\n\n4. Residents should enjoy a high quality of life\n5. Equity and social inclusion should be increased\n6. Participation in governance should be as broad as pos-\nsible\n7. The community should be commercially viable in the\nsense of not requiring public subsidies to maintain its\nperformance on the other criteria.\nIn addition to the government's established situation, Hunt\nThompson and Associates have created their own frame\nwork for discussion of issues of sustainability, through the\nSustainable Placemaking Forum, which provides seminars\nand online discussion that proposes new ideas for creating\nintegrated communities in terms of social connectivity\nthrough the management of public spaces, integration of\ntenures and community discussion through online created\nsystems.\n\nHow does a social network relate to\nsustainability? According to the Urban Task Force,\n\"The planning and implementation of settlements affects\nquality of life in many ways above and beyond physical\ndesign issues.\" Within a connected community, personal\ninvestment is established among residents and people are\nless likely to move frequently, resulting in less greenfield\ndevelopment. Also, as residents hold their community in\nhigh regard, there is a better chance of achieving support\nin regard to environmental sustainability1. The notion of\nsustainable communities is still in its infancy, so there is\nno definite model and there is no guarantee one will work.\nConsequently, there is a continual need to evaluate and\nassess the conditions of community design in such a way\nthat the process continues to evolve, and the key issues\nremain as much in the forefront as possible.\nThe Evaluation\nIn the case of the Millennium Village it is ques\ntionable whether the key issues are in the forefront of the\nproject. If the elements of the proposed design, and the\ncurrent state of the process are considered, the difficulty\nin the execution of the design of a large scale, high profile\nproject with numerous participants is revealed. There is a\nlack of any sort of heirarchy in the project, which seems\nto contribute to the problems.\nUpon entering the website of Millennium Village,\nLLC2, there are dramatic graphics boasting a community\nof the 21st Century and a pronouncement stating, \"The\nmost exciting and innovative residential development\nin Europe...will act as a standard-bearer not only in its\narchitecture and design but also in its vision of how to\ncreate a new, more intelligent way of living using the very\nlatest environmentally friendly technologies.\" Despite\ntheir ambitious statement, what is the result of actually\napplying the criteria for a sustainable community to Mil\nlennium Village, proposed and present?\n1. Resource consumption should be minimized\nThe community aims to achieve this through\nreduction of water usage by one-third the norm, use of\nCombined Heat and Cooling power plants using biomass\nfuel and space flexibility through moving walls and\ninstallation of floor to ceiling glazing and shading\ndevices3. Despite this, the winning architecture firm,\nHunt Thompson and Associates, has resigned from the\nproject \"because the original ecological (or sustainable)\nstandards were increasingly being run down by the\ndevelopers, to such an extent that they could no longer\nsign-up to the project.\"4 According to a study of light\nand thermal conditions conducted by students of\nLondon's AA on some of Erskine's flats and found that\nthe plan layout made the spaces either too dark or they\noverheated.5 Also, apartments are all designed with\nsimilar strategies, regardless of their orientation--not a\nparticularly responsive method of design.\n2. Local environmental capital should be protected and\nenhanced\nPrior to 100 years ago, the land on Greenwich\nPeninsula was known for its wildlife and fisheries, but\nwhen the Blackwall Tunnel linked it to the North Bank\na period of industy and pollution dominated until it was\npurchased by English Partnerships (part of the pub\nlic sector)in 1997 and cleaned up for safe reuse. The\nredevelopment of the peninsula has planned for terraced\ngreenspaces at the water's edge with plants that will\nencourage the return of natural wildlife to the site1. In this\ncase, due to the lack of existing environmental capital,\nrestoration is vital and at the moment useful efforts are\nbeing made in that area. Public 'Garden Squares' will\nbe built in neighborhood blocks, turf for football will be\ninstalled throughout the site and greenways will connect\nall neighborhoods and services on the peninsula for use\nby pedestrians and cyclists2. If these natural projects are\ncarried out, they will certainly be beneficial; however,\ncurrently, the area is rather barren and isolated.\n3. Design quality should be high\nResidents should enjoy a high quality of life\nA description of innovative new housing blocks\nwith contemporary designs fills the webpage. HTA had\ngoals of designing a \"New Vernacular Kit\" for the project,\nutilizing construction innovation to provide future choice\nfor residents. components of interior modification would\nbe produced in a factory, so that they could be easily\nchosen by residents and fitted to a home as their needs\nchange.\n\nThis contributes, also, to achieving a high quality of life;\nif people feel they have the ability to modify their spaces\nas their needs change, there could potentially be a higher\npersonal investment in the area. However, no kit has been\ndeveloped, and flexibility is solely achieved with movable\npartitions.3 Design of public spaces should be high as\nwell. The beginnings of the greenway system for cyclists\nand pedestrians are under construction, but if the space is\nlacking in destinations, will they improve quality of life,\nor depress it due to isolation? Quality of life depends on\nfeelings of safety and accessibility of services. If green\nways exist in an isolated context of abandoned industry,\nneither of these criteria would be filled.4\nEquity and social inclusion should be increased\nThe village has planned for 1377 homes of\nmixed-tenure--for sale, rent, or managed by Affordable\nHousing Association--with no visible distinction between\ntypes of housing, in order to maximize social inclusion1.\nWith integrated designs, if people's economic situation\nimproves, they can change their tenure without leaving\nthe community, which, again, relates to increasing per\nsonal investment.\n\nIn actuality, much of the social housing, though\nnearby, is separated from the owned homes. Separation\nexists because amenities provided to wealthier owners\nsuch as a 24-hour doorman and concierge or an intensely\nlandscaped entry cannot be offered to social housing\nresidents due to high costs2. So, one wonders if disparity\nbetween income levels will be emphasized due to their\nproximity, yet obvious separation.\nParticipation in governance should be as broad as pos\nsible\nGovernance for the village, as previously men\ntioned, is part of an extensive framework that is being\nestablished as high up as the Office of the Deputy Prime\nMinister and as low as the interactive village website,\nwhich provides a forum for making community decisions\nand initiatives.\nThis system, though not running completely\nfluidly yet, is highly planned. The Urban Task force has\ncontracted URBED, The Urban and Economic Develop\nment Group, Ltd., and MORI, a regeneration and planning\nresearch group, to determine how people acquire or form\nviews about urban versus suburban versus rural--acquir-\ning information beyond just likes and dislikes in relation\nship to housing and communities. They will research and\nobserve methods of local authorities abd URBED will\nassess twenty-four towns and cities over ten months to\nproduce a \"Renaissance Profile\" on progress, which can\neventually serve as a guide for future development. Last\nly, MORI will hold one-day citizen workshops in eight of\nthe towns and cities with a cross-section of the residents\nand other partners in order to determine how change is\nspreading and whether the communities are thought to be\nsuccessful. The framework for the monitoring questions\nis outlined on the Urban Task Force website. Criteria are\ndivided into similar categories to the ones that are being\nused in this paper.3\nOn the level of urban centers, funding of Local\nArchitectural Centers is allocated to encourage public\ninvolvement in design issues by sponsoring community\nprojects, exhibits and seminars. The local government\norganization Groundwork, will support \"Community En\nablers\" through the Green Flag Award for public spaces\nthat are well managed, sustainable, and have community\ninvolvement1.\nLastly, there is the level of the community itself.\nSustainable Placemaking Seminars have frequently ad\ndressed the relevance of web-based communication for in\ncreasing involvement and connecting with a more diverse\nscope of residents in regards to their community. Malcolm\nPitcher, director of PCL and In-House Research, a market\ning research and customer satisfaction specialist stated\nthat focus groups are often swayed by a few outspoken\npeople, whereas the web provides a certain amount of an\nonymity, if so desired, and allows people to contribute on\ntheir own time. This forum aims to establish a connected,\nactive community that discusses issues openly. The\nmanagement company for the area employing residents\nof the social housing for maintaining the shared public\nspace, which would also provide jobs. Residents, upon\npurchase of their home, would set up the village trust.\nHowever, this creates issues in terms of social inclusion\nbecause the money would have to be supplied only by the\nbuyers, resulting in part of the community supporting the\nother. Local authorities are avoiding resolution of this by\nproviding management through an outside company who\nprovides its own workers from outside the community.\nThe community should be commercially viable in the\nsense of not requiring public subsidies to maintain\nits performance on the other criteria.\n...Establishment of the right links with the wider regional,\nnational and international community.1\nMillennium Village promotes their establishment of com\nmunity services and jobs: \"Adjacent to Greenwich Millen\nnium Village is a primary school, creche, health centre\nand convenience store. There is a large public park and\nsports pitch, new riverside terraces and paths and, close\nto the village center, a new clubhouse and moorings for\nGreenwich Yacht Club.\" In addtion, there will be plenty\nof public transporation and shops and restaruants within\nwalking distance. Currently, the village is equipped with\nthese amenities, the beginnings to a self-sufficient com\nmunity. One must also recognize, though, the existing\ncommunity that it seems Millennium Village has chosen\nto neglect. Richard Burdett of the Urban Task Force states\nat a Sustainable Placemaking Seminar his concerns about\nthe Millennium Village project becoming a series of\n\ninward-looking clusters with a limited connection with\nthe outside context. The \"village\" currently consists of\ntwo housing blocks in a very isolated swath of land--not\nquite from an integrated walking community. A descrip\ntion of the process of traveling to the peninsula develop\nment from old Greenwich is described by Deyan Sudjic,\n\"To get from 19th century London to the 21st century you\nhave to negotiate what feels like an asteroid belt dotted\nwith ...anonymous sheds, elevated motorways and an\nempty landscape of reclaimed spoil heaps and industrial\nwaste.\"3 Additionally, the Victorian town center of old\nGreenwich is in need of revitalization due to a large\nhighway system and problems with traffic management\nthat detract from the town center. An influx of tourism\nto the Millennium Dome has increased the problem4. It\nseems odd, that a community in Greenwich would ignore\nthe existing commercial context in the design of a highly\nintegrated community with local jobs and activity centers.\nThe goals of Millennium Village have not been\ncarried out as of yet, and according to discussion in the\nSustainable Placemaking Seminars and articles such as\nDeyan Sudjic's it is uncertain when they will. Much of\nthese problems seem to be with the lack of priority. How\ndoes one determine which is more important, when cut\nbacks are made? While the framework established by the\nUrban Task force makes efforts to understand the nature\nof community, issues are never prioritized, so there is no\nway of distinguishing which is more important, creating\na pedestrian network, or having energy efficient homes.\nThe evaluation process is hopefully ongoing and evolv\ning, so that those involved on all levels can be informed\non the challenges of designing sustainable communities.\n\n1 According to the Urban Task Force, Urban Renaissance will be created\nthrough the identification of causes of urban decline in England, the rec\nommendation of practical solutions to bring people back into our cities,\nand the establishment of a new vision for urban regeneration.\nUrban Task Force. \"Mission Statement.\" 03 April 2004: http://\nwww.odpm.gov.uk/stellent/groups/odpm_urbanpolicy/documents/page/\nodpm_urbpol_608462-01.hcsp#P20_513\n2\"London: The New Millennium.\" Architects' Journal 1997. Nov. 20 v.\n206 n. 19 p. I-xvi, 76-77.\n3 Urban Task Force. \"Towards an urban renaissance: report of the\nUrban Task Force - executive summary\" Office of the Deputy Prime\nMinister, 03 April 2004: http://www.odpm.gov.uk/stellent/groups/odpm_\nurbanpolicy/documents/page/odpm_urbpol_608462.hcsp\n4 Pitcher, Malcolm and Florence Hunt. \"customer choice\" 10 July 2000,\nSustainable Placemaking Forum: www.sustainable-placemaking.org/\npast.htm.\n5 Greenwich Millennium Village 04 April 2004: www.greenwich-\nvillage.co.uk\n6 Edwards, Brian and David Turrent (ed.). Sustainable Housing: Princi\nples and Practices. London; New York: E & FN Spon, 2000.\n7 Personal communication with Koen Steemers, 15 March 2004.\n8 Personal communication with Dr Susannah Hagan, 30 March 2004.\n9 \"London: The New Millennium.\" Architects' Journal. 1997. Nov. 20 v.\n206 n. 19 p. I-xvi, 76-77.\n10 Greenwich Millennium Village 04 April 2004: www.greenwich-\nvillage.co.uk\n11 JSS Pinnacle. \"Neighbourhood Management and Sustainabil\nity.\" Sustainable Placemaking Forum Seminar. 24 November 2000:\nwww.sustainable-placemaking.org.\n12 The Urban Task Force expresses these criteria as components of\nestablishing quality of life in their charts for evaluation.\nUrban Task Force. \"Towards an urban renaissance: report of the Urban\nTask Force - executive summary\" Office of the Deputy Prime Min\nister, 03 April 2004: http://www.odpm.gov.uk/stellent/groups/odpm_\nurbanpolicy/documents/page/odpm_urbpol_608462.hcsp\n13 Greenwich Millennium Village 04 April 2004: www.greenwich-\nvillage.co.uk\n14 JSS Pinnacle. \"Neighbourhood Management and Sustainabil\nity.\" Sustainable Placemaking Forum Seminar. 24 November 2000:\nwww.sustainable-placemaking.org.\n15 The criteria used were provided in the opening definition of sustainable\ncommunities in the website of the Office of the Deputy Prime Minister.\n16 Urban Task Force. \"Millennium villages and sustainable com\nmunities\" Office of the Deputy Prime Minister, 03 April 2004: http:\n//www.odpm.gov.uk/stellent/groups/odpm_urbanpolicy/documents/page/\nodpm_urbpol_608462.hcsp\n17 Urban Task Force. \"Towards an urban renaissance: report of the\nUrban Task Force - executive summary\" Office of the Deputy Prime\nMinister, 03 April 2004: http://www.odpm.gov.uk/stellent/groups/odpm_\nurbanpolicy/documents/page/odpm_urbpol_608462.hcsp\n18 An additional related statement put out through the Urban Task Force.\n19 Greenwich Millennium Village 04 April 2004: www.greenwich-\nvillage.co.uk\n20 Sudjic, Deyan. \"Strictly for Faux Village People.\" Guardian Unlim\nited. (online journal) 2001 October 28.\n21 \"Planning Chaos Leaves the Other Greenwich in the Lurch.\" Archi\ntects' Journal. 1997 July 24 v. 206 N. 4 p.18.\nPictures\n1. \"London: The New Millennium.\" Architects' Journal 1997. Nov. 20 v.\n206 n. 19 p. I-xvi, 76-77.\n2. Greenwich Millennium Village 04 April 2004: www.greenwich-\nvillage.co.uk\n3. www.photoguide.to/london/ greenwich2.html\n4. www.surrey.ac.uk/USEB/\n5. Edwards, Brian and David Turrent (ed.). Sustainable Housing: Prin\nciples and Practices. London; New York: E & FN Spon, 2000.\n6. Edwards, Brian and David Turrent (ed.). Sustainable Housing: Prin\nciples and Practices. London; New York: E & FN Spon, 2000."
    },
    {
      "category": "Resource",
      "title": "midleifer.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-183-sustainable-design-and-technology-research-workshop-spring-2004/97bcfb072fe4dd100bb010a84fc4c60f_midleifer.pdf",
      "content": "Tucson's Civano: Design Implications for Water Savings in Non-Arid Climates\nAchieving sustainability necessitates a\nrethinking of relationships between the\nbuilt environment and the natural world.\nTucson's Civano project, an 818 acre\ndevelopment touted as America's first\nsustainable community, stands as an\noriginal vision of such preservative\ndesign. Though hardly sustainable, in\nthat the community does not balance its\noverall consumption with matching\nresource regeneration efforts, project\nresults point to significant water and\nenergy conservation achievements\nreproducible elsewhere. Civano's most\npractical implications apply to the field\nof water management, where demand-\nreduction efforts indicate promising\npotential for incremental resource\nsavings outside, as well as in arid\nclimates.\nAs the brainchild of an enthusiastic\ngovernor, a progressive city council, and\na coalition of architects, developers, and\ncity planners, Civano enjoys a\nupon conservational design. In return for\ninitial procedural support and\ninfrastructure financing, the Master\nto reduce\nresidential energy and potable water\nuse by 60 and 65%.1 These requisites'\ntechniques.\nIn order to achieve stated water use\nproperties with xeriscape landscaping,\nrainwater harvesting infrastructure, and\nUtilizing these techniques, which require,\nnative plants to parse and reduce coverage\ntanks called cisterns to catch\ndemonstration project status along with a\nhost of municipal concessions conditional\nDeveloper demands that all builders\noperating on site must incorporate\nspecific design components\nhydrodynamic implications more\nspecifically dictate the use of water-\nsaving planting, plumbing, and irrigation\nreductions, builders must outfit all\nsecondary reclaimed water systems.\nrespectively, zoned landscaping with\nof consumption intense lawns, holding\n\nrainwater collected from roofs, and special\nplumbing to utilize treated municipal effluent,\nhas the cumulative effect of eliminating\npotable water use from residential irrigation.\nFrom a water management perspective, such\nreductions are invaluable, as residential\nirrigation is generally seen as a draw down\nthreat to existing supplies and as the culprit\nresponsible for worsening periods of\nsummertime drought. Early reports examining\nwater use in Civano's first neighborhoods\nindicate that homes utilizing rainwater\nharvesting systems rely on minimal amounts\nof reclaimed irrigation water even in drier\nseasons, despite the fact that Tucson typically\nreceives less than 8\" of rainfall each year (see\nfigure below).\nOther results tendered in those reports\nindicate substantial community-wide\nachievements. The average Civano resident,\naccording to these academic and engineering\nevaluations, uses 57.5 daily gallons of potable\nwater as opposed to the 141 gallons used by\n2 and the 152\nresidents of new Tucson homes\ngallons used by the average Tucson resident\nacross all homes. These represent daily\npotable water savings of 59.44% and 62.18%,\nrespectively. These early figures will likely be\ncharacteristic of the entire five thousand home\ncommunity, once it is completed, since the\ndesign techniques by which the 300 current\nCivano homes achieve their water-use\nreductions are mandated for each residential\nstructure to be built therein. More importantly,\ngiven the simple technical nature of water-\nsaving measures employed at Civano, there is\nreason to believe that similar, substantial\ndemand-reduction could likewise be achieved\nelsewhere. Other communities with similar\ntrends of residential construction through\nlarge-scale development might immediately\nbenefit from such reductions, and to prove\ntheir potential a group of communities in\nsouthwestern Florida is submitted below as a\n\nMonthly Tucson Rainfall - Even with minimal rainfall, the average Tucson home can collect enough\nrainwater for most all of its irrigation needs.\ncase study appropriate for feasibility-analysis.\nSarasota county is comprised of several\nretirement communities, and its 200,000\nperson population is growing due to profligate\ndevelopment in the area. In terms of water use,\nthis means that over 85% of demand for\nmunicipal supplies comes from the residential\nsector, and such a consumption trend will\nlikely continue as more people come to\noccupy vacancies among the 5000 new homes\nbuilt each year. To address this growing\nresidential drain upon its ground and surface\nsubsequent saltwater intrusion,3 Sarasota\ndependence on rainwater to prevent irrigation\nwater supplies, and to prevent future damage\nof the Floridian aquifer by overdrawing and\ncounty has implemented a number of\nprograms aimed a reworking residents'\nconsumption behavior. The foci of Sarasota's\nprograms are a reliance upon conservational\nappliances to reduce in home use and a\nfrom tapping potable supplies. To date, the\n\ncounty maintains showerhead and toilet rebate\nprograms, a municipal reclaimed water\nsystem, and a mandated retrofitting program to\nfit irrigation systems with rain sensors. The\nlast two initiatives mentioned, the reclaimed\nwater system and rain-sensing technology,\nrepresent wise steps taken towards water\nconservation. However, given that Sarasota\ncounty receives about 50\" of annual rainfall\nand that projections of future water supply\ngaps persist despite conservation efforts so far,\nit seems that using other, traditionally ignored\nbut existent potable sources may\nA look through Sarasota's newer\nxeriscape designs. But water-conserving\nmake the greatest impacts in limiting county-\nwide ground and surface water consumption.\ndevelopments suggests that private agents are\ndoing more to harvest rainwater than simply\nfitting sensors onto irrigation systems so as not\nto water lawns during rainstorms. Some\ndevelopments like Palmer Ranch and\nLakewood Ranch have made both spot-\noriented, incremental and more community-\nwide commitments to tailor landscapes with\ndesign is hardly the norm for the county at\n\nSources:\n/\n, RMI\nPress, Boulder, 2003. Chapter 11, entitled\n]\nrv.pdf\nm#reports\nCitations:\nplease consult\ncWorks/PWPDFFiles/WaterBrochure.pdf\n4 -\n5 -\n.\n6 -\n//\ndevelopment in the future.\n2002 Civano Water Use, Report, at\nwww.civanoneighbors.com civano/environment.ht\nm#reports [3/23/04]\nHawkins, Lovins, and Lovins, Natural Capitalism:\nCreating the Next Industrial Revolution\n\"Aqueous Solutions\" found at\nrmi.org/images/other/Businesses/NC99-\n19k_AqueousSltns.pdf [Accessed 3/23/04]\nTexas Rainwater Harvesting Guide at\nwww.twdb.state.tx.us/publications/reports/RainHarv.pdf\n[3/9/04\nPictures from:\nhttp://www.twdb.state.tx.us/publications/reports/RainHa\nhttp://www.civanoneighbors.com/civano/environment.ht\nhttp://it.ifas.ufl.edu/landscapeselector/twoeight.html\n1 - These goals take large conservation leaps, and\nfurther study of energy-use and CO reduction\nefforts is encouraged but not pursued here. For\ninformation on these topics please see the\n\"Guiding Documents\" & \"News\" sections of\ncivanoneighbors.com\n2 - Homes constructed according to 1990 Tucson\nBaselines. For sample sizes and other statistical\ninformation, see reports by the University of\nArizona and Al Nichols Engineering at\ncivanoneighbors.com.\n3 - For more information on Floridian aquifer\nhealth, draw down, and the relationship between\naquifer levels and salt intrusion into aquifers, see\nhttp://coastgis.marsci.uga.edu/summit/aquifers_fla.htm.\nFor more information on Sarasota county's\nspecific conservation measures,\nlinks at\nwww.sarasotagov.com/LivingInSarasota/Contents/Publi\nReaders should be aware that landscape water\nrequirements in Florida are different than those in\nArizona, and that larger Floridian lawns require\nmore water than desert-planted properties. These\nfigures nevertheless show vast potential for potable\nwater savings using rainwater harvesting.\nCistern costs are about $1 per gallon stored\nSee http: www.rmi.org/sitepages/pid172.php.\nlarge, and only one development, Lakewood\nRanch, has arranged access to available\nreclaimed water hook ups. Consider once\nagain that Sarasota, under pressure from\nstifling irrigation demands, receives 50\" of\nannual rainfall as compared to the 8\" with\nwhich Civano residents, harvesting fallen\nrainwater, almost completely irrigate their\nproperties,4 and it becomes obvious that\nSarasota county's story is one of untapped\nopportunities.\nHow might rainwater harvesting be\nachieved in Sarasota? The answer is not\ntremendously complicated; initial studies\nsuggest that southern Floridians, who have to\ndate entered enthusiastically into shower and\ntoilet rebate programs, would likely accept\nrebates for multiple 500-gallon cistern systems\nsimilar to those used at Civano.5 And more\nimportantly, the same studies suggest that\ninitiating such a rebate program would achieve\nsignificant water savings at a fraction6 of\nestimated costs for other current water\nconservation proposals, which seek to expand\ncentralized, county-managed reclaimed water\nhook-ups. Clearly, the potential for outfitting\nall new homes and retrofitting old ones with\nrainwater harvesting infrastructure is\nsubstantial and deserves further exploration.\nEliminating irrigation drains on potable water\nmight prove to political actors that incentiving\nsustainable design is a viable means of\ncoercing conservation efficiency. The success\nof programs like these could also initiate a\npolitical tipping point, encouraging broader\nconservation-oriented municipal action and\nmore legislation requiring sustainable"
    }
  ]
}