{
  "course_name": "Synapse Remodeling in Health and Disease",
  "course_description": "Our brains are remarkably adaptable throughout our lives. Individual brain cells called neurons form synapses, sites of physical connection and communication between neurons, and then repeatedly rewire those connections in response to new experiences or to neuronal cell death caused by injury, disease, or aging. In this course, we will explore how neurons establish their synapses in the healthy brain during childhood and later in life, and how this process goes awry in disease states. More specifically, we will discuss how the brain forms its synapses early in life, stabilizes a subset of those synapses for long-term maintenance, and continues to add and remove synapses throughout life. We will then explore synapse dysfunction in diseases such as autism and Alzheimer’s disease, which involve abnormal increases or losses of synaptic connections, respectively. We will also consider synapse remodeling, a process of adding and removing synaptic connections to optimize our brain network, in the context of neuroinflammation, recovery from traumatic brain injury, and psychological trauma following prolonged stress.\nThis course is one of many Advanced Undergraduate Seminars offered by the Biology Department at MIT. These seminars are tailored for students with an interest in using primary research literature to discuss and learn about current biological research in a highly interactive setting. Many instructors of the Advanced Undergraduate Seminars are postdoctoral scientists with a strong interest in teaching.",
  "topics": [
    "Health and Medicine",
    "Sensory-Neural Systems",
    "Science",
    "Biology",
    "Molecular Biology",
    "Neurobiology",
    "Neuroscience",
    "Cognitive Science",
    "Health and Medicine",
    "Sensory-Neural Systems",
    "Science",
    "Biology",
    "Molecular Biology",
    "Neurobiology",
    "Neuroscience",
    "Cognitive Science"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 2 hours / session\n\nPrerequisites\n\nThere is no strict prerequisite for this course, but some knowledge of molecular biology and/or neuroscience is recommended. We expect that all students will encounter some unfamiliar terminology while reading research papers from the primary literature, regardless of their academic background. We will go over important terminology in class, but students should also be prepared to do their own internet searches for unfamiliar terminology and/or bring their questions to the next class session.\n\nCourse Description\n\nOur brains are remarkably adaptable throughout our lives. Individual brain cells called neurons form synapses, sites of physical connection and communication between neurons, and then repeatedly rewire those connections in response to new experiences or to neuronal cell death caused by injury, disease, or aging. In this course, we will explore how neurons establish their synapses in the healthy brain during childhood and later in life, and how this process goes awry in disease states.\n\nMore specifically, we will discuss how the brain forms its synapses early in life, stabilizes a subset of those synapses for long-term maintenance, and continues to add and remove synapses throughout life. We will then explore synapse dysfunction in diseases such as autism and Alzheimer's disease, which involve abnormal increases or losses of synaptic connections, respectively. We will also consider synapse remodeling, a process of adding and removing synaptic connections to optimize our brain network, in the context of neuroinflammation, recovery from traumatic brain injury, and psychological trauma following prolonged stress.\n\nThis course will be discussion-based. Each session will provide an opportunity for students to tackle two related papers from the primary scientific literature, ask questions to hone their understanding of the methodology and data presented in the papers, and practice critiquing the papers. Students will also have an opportunity to build their written and verbal communication skills through a written assignment and an oral presentation. The written assignment will focus on proposing an experiment in a mock mini-grant proposal, which students will draft and then refine together during one of the class sessions. In the oral presentation, students will practice explaining and critiquing a paper from the scientific literature.\n\nTo provide real-life experience with the techniques used in the papers we discuss in class, we will see a demonstration of brain imaging in an MIT neuroscience laboratory, which will exemplify the experimental methods needed to generate the scientific figures analyzed in class. To facilitate discussion about career paths in the biomedical sciences, we will go on a field trip to an industry laboratory, where we will hear from industry scientists about their career journeys and learn about ongoing research behind neuromuscular diseases, a family of rare genetic disorders characterized by muscle degeneration due to alterations in the peripheral nervous system.\n\nThis course will introduce students to a variety of methodologies used not only in the field of synapse dynamics but more generally across many disciplines in the field of molecular medicine. This class may be particularly beneficial to students interested in careers in biomedical research and/or medicine, but we welcome all students who are excited about learning how to read the primary scientific literature, understanding the process of critical scientific reasoning, and learning about how our brains remodel their connections in healthy and diseased states.\n\nCourse Format\n\nThis course is discussion-based and will meet once per week for two hours. Each week, we will focus on two papers from the primary literature. Students are expected to read both papers carefully, bring their thoughts/questions to class and/or send them by e-mail to the instructors before class, and be prepared to participate actively in the discussion. At the end of each class, the instructors will provide a brief introduction to the papers that will be discussed in the next class session, to provide context for the papers and go over any important new experimental methods and terminology.\n\nWe will spend one class session on a field trip to Vertex Pharmaceuticals, half a class session on an imaging demonstration in the neurobiology laboratory of MIT Professor Elly Nedivi, one class session workshopping students' mock grant proposals, and one class session on students' final oral presentations (see\nAssignments\nfor details).\n\nCourse Objectives\n\nThe major goal is to learn to read and critique the primary research literature. By the end of the course, students should be able to do the following:\n\nIdentify the central questions in a paper from the primary literature.\n\nIdentify the experiment(s) and key control(s) that were performed to answer that question.\n\nIdentify the authors' conclusions and the data that support each conclusion.\n\nEvaluate whether each conclusion is well supported by the data presented in the paper.\n\nFor any claims that are not well supported, propose experiments the authors could perform to clarify the ambiguity.\n\nPropose new experiments that could further test or extend the findings of the paper.\n\nMore specifically, through our discussions and the written assignment, students will become more familiar with basic principles of experimental design, learning to understand the use and design of control experiments and to design new experiments with appropriate controls.\n\nThe papers we read each week will focus on a topic specified in the syllabus for that specific week. By the end of the course, we hope students also will learn about aspects of the field of neurobiology, will develop a broad familiarity with how synapses remodel during the course of normal development and in the context of various diseases, and will understand the advantages and disadvantages of different techniques and experimental systems that are used to investigate synapse remodeling.\n\nGrading and Attendance Policies\n\nThis course is worth 6 units and is graded pass/fail. A student who attends the course, actively participates in discussions, and completes both written and oral assignments in a satisfactory manner will receive a passing grade.\n\nField Trip and Imaging Technique Demonstration\n\nIn the Boston area, we are surrounded by labs that are at the forefront of biology and neuroscience research in both academia and industry. We will spend one class session on a field trip to\nVertex Pharmaceuticals\n, where we will hear from scientists about their career journeys and learn about their ongoing research. The CRISPR/Cas9 gene delivery system has revolutionized approaches to gene therapy and opened the door to personalized medicine. During our visit to Vertex Pharmaceuticals, we will learn about CRISPR/Cas9 approaches to treat neuromuscular disorders and cystic fibrosis. This experience will introduce students to a variety of methodologies used not only in the field of synapse dynamics but more generally across many disciplines in the field of molecular medicine.\n\nTo provide real-life exposure to some of the techniques used in the papers we discuss in class, students will observe a demonstration of\nin vivo\n2-photon imaging of the mouse brain to view how synapses on the dendritic arbor of a single neuron behaves in the brain of a live mouse. This visit to the MIT neuroscience laboratory of Professor Elly Nedivi will exemplify experimental methods used to generate some of the scientific figures discussed in class prior to the demonstration. More specifically, students will observe how the genetic labeling of individual neurons and their synapses allows studies of how synaptic connections are made and removed in real-time. Students also will observe how specific gene targets are validated using the polymerase chain reaction (PCR), which amplifies the DNA sequence of a gene and can be used to determine the presence/absence of a specific fragment belonging to the gene of interest. Both techniques are applied broadly in the field of neurobiology.\n\nClassroom Culture\n\nAll members of this class are expected to contribute to a respectful, welcoming, and inclusive environment for all other members of the class. We welcome students of all backgrounds, beliefs, ethnicities, national origins, gender identities, sexual orientations, religious and political affiliations--and other visible and non-visible differences. We (the instructors, Joe and Dalila) will provide a link to a feedback platform where students can send us any concerns about the class environment, our teaching, or their interactions with other students in the class. We will also provide feedback forms specifically about our teaching midway through the semester and at the end of the semester.\n\nCalendar\n\nWeek\n\nTopics\n\nIntroduction\n\nSynapse Plasticity: Developing Brain\n\nSynapse Plasticity: Aging Brain\n\nSensory Experience-Dependent Plasticity--Part 1\n\nSensory Experience-Dependent Plasticity--Part 2\n\nLearning-Induced Synaptic Plasticity\n\nNeurodevelopmental Disorders: Autism and Fragile X Syndrome\n\nWorkshop Mock Grant Proposals\n\nRough draft of mock grant proposal due\n\nNeurodegeneration: Alzheimer's Disease\n\nFinal draft of mock grant proposal due\n\nInjury: Peripheral Nerve Injury and Traumatic Brain Injury\n\nField Trip to\nVertex Pharmaceuticals\n\nFear and Trauma\n\nDeadline to choose paper for final presentation\n\nNedivi Lab Visit: Technique Demonstrations\n\nFinal Oral Presentations and Wrap-up Discussion",
  "files": [
    {
      "category": "Resource",
      "title": "7.342 (F22), Week 10 Reading Questions",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-342-synapse-remodeling-in-health-and-disease-fall-2022/mit7_342_f22_wk10_reading_q.pdf",
      "content": "Reading questions for Sen et al., 2017:\n-\nWhat is PERK-K618A, and why was it important to use PERK-K618A in addition to GSK2656157?\n-\nA central claim of Sen et al. is that blocking PERK activation prevents spine loss and improves\nmemory. Which figure provides evidence for this claim?\n-\nWhat behavioral test was used to assess learning and memory? Briefly describe the test.\n-\nIn Fig. 5G, PSD95 puncta are counted. Where on the cell are PSD95 puncta generally located\n(e.g. the cell body, axon, dendritic shaft, and/or dendritic spines), i.e. what part of the cell do\nyou expect the PSD95 puncta in Fig. 5G to represent?\nReading questions for Ko et al., 2018:\n-\nWhat is the central claim(s) of the paper? Please describe the main figures supporting the\nclaim(s)?\n-\nIn Fig. 1, 11 synaptic proteins were upregulated during nerve injury in the ACC. Are you surprise\nwith the list? Is there a protein of particular interest to you that you would have prefer to\nfollow? Do you agree using the hippocampus as the baseline region?\n-\nThe authors claim that ongoing protein synthesis is necessary to enhance synaptic strength. Is\nthis claim well supported? How do you interpret this data in the context of never injury? Could\nwe hope for a fast recovery? Does recovery stop without ongoing protein synthesis?\n-\nWhy do you think NCAM1 is only upregulated during the early stage of nerve injury (Fig. 6 &7)?\nAre authors correct to suggest that \"NCAM1 regulates synaptic reorganization\"? Based on the\nevidence here, how would you explain the role of NCAM1 in peripheral nerve injury?\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n7.342 Synapse Remodeling in Health and Disease\nFall 2022\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "7.342 (F22), Week 12 Reading Questions",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-342-synapse-remodeling-in-health-and-disease-fall-2022/mit7_342_f22_wk12_reading_q.pdf",
      "content": "Reading Questions for Week 12:\n- Lai et al. (2018) and Colyn et al. (2019) use two different models of trauma: fear\nconditioning and chronic social defeat stress (CSDS), respectively. Please briefly discuss\nthe advantages and disadvantages of each model, e.g. which types of human trauma\nwould be more appropriately represented by fear conditioning vs CSDS?\nQuestion for Colyn et al., 2019\n1. In Colyn et al., do you find it surprising that the effects of CSDS are delayed and/or long-\nlasting? Do you think it is adaptive or maladaptive for animals to have such long-lasting\nchanges in their brains after CSDS, i.e. is this a healthy response to danger or a\npathological phenotype?\n2. In Colyn et al., is there any mention of blinding to treatment condition during image\nacquisition and/or analysis?\n3. In Colyn et al., what was the control group used for comparison to mice experiencing\nCSDS? Do you think this was an appropriate control?\nQuestion for Lai et al., 2018\n1. The authors claim that fear conditioning elicit formation of different new spines with\ndifferent auditory cues. What is the evidence they provide? Do you agree? If so, what do\nyou think is driving these changes in response?\n2. In figure 3 and 4, the data suggests that fear-extinction preferentially eliminates newly\nformed spines induced by fear conditioning and this elimination is cue specific. Does the\ndata strongly support this conclusion? What could be driving the structural changes to\nfavor elimination? How is this conclusion similar or different to structural changes\ninduced by learning-based paradigms?\n3. If fear extinction reverses new spines induced by fear conditioning in a location-and cue-\nspecific manner in the mouse auditory cortex, do you think we could use learned-based\nconditioning to treat stress or PSTD? If so, how would you attempt to test this idea in\nmice?\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n7.342 Synapse Remodeling in Health and Disease\nFall 2022\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "7.342 (F22), Week 2 Reading Questions",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-342-synapse-remodeling-in-health-and-disease-fall-2022/mit7_342_f22_wk02_reading_q.pdf",
      "content": "Reading/discussion questions for Johnson et al., 2016 and Counotte et al., 2010\n1. Why do you think the authors chose these particular brain regions (PFC, OFC, and BLA) for their\nstudy of adolescent brain maturation?\n2. What are the advantages and disadvantages of using fixed tissue from animals that were\neuthanized at specific ages (e.g. Counotte et al., 2010) vs live animals for synapse imaging\nstudies (e.g. Johnson et al., 2016)?\n3. Could Johnson et al. have drawn the same conclusions if they had used fixed tissue?\n4. In Johnson et al., the authors concluded that the density of dendritic spines in dmPFC decreases\nwith age, the density of BLA-dmPFC boutons increases with age, and the density of\nOFC-dmPFC boutons does not change with age. Which figure(s) show the data for this\nconclusion?\n5. Interpret the graphs in Fig. 3c-d (Johnson et al.) in your own words (i.e. state the conclusions\nyou would draw from the data shown).\n6. Based on Fig. 5f (in Johnson et al.), are BLA axons growing, shrinking, or showing no net change\nin juvenile mice? In adult mice, are the BLA axons growing, shrinking, or showing no net change?\n7. In Counotte et al., describe the control group(s) for Fig. 1. If none, justify your answer.\n8. In Counotte et al., the authors claimed that nearly 35% of the identified synaptic proteins\nundergo significant changes in expression. Do you agree with the statement? What figure(s)\nsupport this claim?\n9. Based on the proposed model of synapse development in Counotte et al. (Fig. 4), the synaptic\nvesicle proteins undergo the most pronounced change in levels. Which figure(s) support this\nclaim? Would you have done the same experiment?\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n7.342 Synapse Remodeling in Health and Disease\nFall 2022\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "7.342 (F22), Week 3 Reading Questions",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-342-synapse-remodeling-in-health-and-disease-fall-2022/mit7_342_f22_wk03_reading_q.pdf",
      "content": "Discussion questions for Eavri et al., 2018:\n1. In Eavri et al. (2018), the authors claim that the capacity for inhibitory dendritic arbor\nremodeling decreases as mice age. Which figure provides evidence for this claim?\n2. In the abstract of Eavri et al. (2018), the authors state that their results \"suggest that declines in\ninhibitory neuron structural plasticity during aging contribute to reduced functional plasticity.\"\n(see questions below)\na. What evidence do the authors provide for reduced functional plasticity with aging?\nb. Do the authors provide any evidence that the decline in structural plasticity is causally\nrelated to the decline in functional plasticity?\ni. If not, can you think of an experiment that would test whether the decline in\nstructural plasticity is causally related to the decline in functional plasticity?\nDiscussion questions for Mostany et al., 2013\n1. In Mostany et al, the authors sought to investigate synapse dynamics during normal aging.\nWhich brain regions did they choose to focus on? How relevant is this area for age-related\nsensory decline? Would you have chosen the same area? Justify your answer.\n2. The authors claim that dendritic spine turnover increase significantly with age. What evidence\ndo they provide? What do you think is happening here? Does spine size dictate synaptic\nstrength? Is this true to all brain regions?\n3. The authors claim that synaptic dynamics are profoundly altered but not lost in old mice. If true,\nwhy do most neurodegenerative diseases result in altered synaptic transmission because of\nsynapse loss and subsequent neuronal loss? Can you reconcile this statement?\nGeneral question:\n1. Later in the semester, we'll discuss neurodegenerative disease. This week, we're focusing on\nhealthy aging. How should we distinguish pathological from healthy changes in the aging brain?\nIs some degree of functional decline healthy, or should we try to prevent the functional decline\nassociated with aging?\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n7.342 Synapse Remodeling in Health and Disease\nFall 2022\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "7.342 (F22), Week 4 Reading Questions",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-342-synapse-remodeling-in-health-and-disease-fall-2022/mit7_342_f22_wk04_reading_q.pdf",
      "content": "Questions for Van Versendaal et al., 2012\n-\nVan Versendaal et al. (2012), along with another study published in the same issue of Neuron,\nwere the first to image inhibitory synapses in live animals, as opposed to fixed tissue or cultured\nneurons. (see questions below)\no How were inhibitory synapses labeled in Van Versendaal et al. (2012)?\no What control experiment did the authors do to confirm that the labeled objects were\ninhibitory synapses?\no Did the authors do any additional control experiments to check whether their labeling\napproach perturbed the cells/synapses?\n-\nList one central claim in Van Versendaal et al. (2012).\no Which figure provides evidence for this claim?\no Are you convinced by the evidence provided?\nQuestions for Van Tan et al., 2012\n1. What do we refer to as homeostatic scaling? What type of studies have contributed to our\nunderstanding of homeostatic regulation of neuronal activity?\n2. What is the significance of the new method presented in the paper to monitor AMPA receptors\nin live mice? How are they accomplishing this task? Please be specific.\n3. Why do you think AMPA receptors are more dynamic in primary visual cortex (V1) Layer 2/3\nneurons compared to Layer 5? What is the data supporting this claim? How do you explain this\nphenomenon?\n4. In Figure 3, the authors claim that binocular enucleation induces an initial decrease in AMPA\nlevels followed by a recovery only after prolonged deprivation? What do you think there is a\ndelay in recovery? Name additional experiments that would further validate this claim.\n5. The authors claimed that GRIP1 is in part responsible for the increase in AMPA levels following\ndeprivation despite showing opposite results in the GRIP1 knockout mice. Do you agree with\ntheir conclusion? What is an alternative interpretation of their results that could explain a\ndecrease in AMPA levels in the GRIP1 knockout?\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n7.342 Synapse Remodeling in Health and Disease\nFall 2022\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "7.342 (F22), Week 5 Reading Questions",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-342-synapse-remodeling-in-health-and-disease-fall-2022/mit7_342_f22_wk05_reading_q.pdf",
      "content": "Reading questions for Week 5 papers\n-\nWhat is the difference between homeostatic and Hebbian plasticity? Why is the barrel cortex so\nimportant for Hebbian plasticity?\n-\nWhat is CamKII? What role does it play in synaptic plasticity?\n-\nIn Wilbrecht et al., and Seaton et al., did the T286A mutation affect spine gains, spine\nstabilization/persistence, or both? Based on what you know about CaMKII, do you find this\nresult surprising?\n-\nIn Wilbrecht et al., why do you think spine changes happen preferentially at the borders\nbetween barrel columns (as opposed to within the columns)?\n-\nIn Seaton et al., why do L2/3 basal dendrites exhibit plasticity and apical dendrites do not? Is this\nthe same type of plasticity as L2/3 basal dendrites in the visual cortex?\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n7.342 Synapse Remodeling in Health and Disease\nFall 2022\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "7.342 (F22), Week 6 Reading Questions",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-342-synapse-remodeling-in-health-and-disease-fall-2022/mit7_342_f22_wk06_reading_q.pdf",
      "content": "Questions for Roth et al. 2020\n1. The authors claim that AMPA spine levels are randomly distributed in control mice and\nclustered in trained mice. What is the evidence that supports this claim? What is the\nfunctional significance? How would you have interpreted this data in the context of\nHebbian plasticity?\n2. The authors claim that the visual cortex shows upregulation of AMPA expression in\nresponse to the motor task. Describe the evidence that supports a causal relationship\nbetween motor learning and visual remodeling? Are feedforward or feedback\nconnections responsible for this phenomenon, or something else?\nReading questions for Johnson et al., 2016\n- Describe the control groups in Figs. 2 and 5. What was the importance of the \"arena\ncontrol\" group? Do you agree with how the controls were done?\n- In the context of Johnson et al. (2016), what do the words \"explore\" and \"exploit\"\nmean? (See 2nd paragraph of Introduction section.)\no In your daily life, you perform behaviors based on cue-action-outcome\nassociations, e.g. when you purchase food. Describe what an \"explore\" strategy\nwould look like, and what an \"exploit\" strategy would look like, in the context of\nchoosing food for dinner.\no For animals foraging for food in the wild, what are the risks/benefits of explore\nvs exploit strategies?\n- Did Johnson et al. provide evidence for a causal link between the structural remodeling\nof OFC-dmPFC axons and task learning?\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n7.342 Synapse Remodeling in Health and Disease\nFall 2022\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "7.342 (F22), Week 7 Reading Questions",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-342-synapse-remodeling-in-health-and-disease-fall-2022/mit7_342_f22_wk07_reading_q.pdf",
      "content": "Reading questions for Arroyo et al., 2019\n-\nMost historical work from sensory cortices used sensory deprivation rather than sensory\nenrichment. Why did Arroyo et al. choose to use sensory enrichment rather than sensory\ndeprivation?\n-\nFig. 5 shows the evidence for the authors' main claims. Do you find the evidence in Fig. 5\nconvincing? Why or why not?\n-\nIf you were designing a future experiment (either in Fmr1 knockout mice or in people with\nfragile X syndrome) following up on the results from Arroyo et al., what question would you\nwant to ask? There is no right or wrong answer here; we're simply inviting you to think about\nfuture directions for a project like this.\nReading questions for Krueger et al., 2011\n-\nTo identify behavioral deficits in Fmr1 KO mice, the authors use the five-choice serial reaction\ntime task (5CSRTT). How efficiently does this task reflect the behavioral deficits we see in FXS\npatients? Would you have chosen a different task?\n-\nIn figure 4, the authors claim that neuronal activity is decreased in KO mice. What is c-Fos\nmeasuring? Is this conclusion well supported? If not, what would you have done differently?\n-\nWhat are the key features that would need to be present in an animal model to comfortably\nmake claims regarding FXS?\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n7.342 Synapse Remodeling in Health and Disease\nFall 2022\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "7.342 (F22), Week 9 Reading Questions",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-342-synapse-remodeling-in-health-and-disease-fall-2022/mit7_342_f22_wk09_reading_q.pdf",
      "content": "Questions about Wu et al., 2010:\n-\nWhat is the Tg2576 mouse line, and why was it used in this paper?\n-\nTg2576 mice don't begin to show AD-related phenotypes until adulthood. In this study, the\nneuronal cultures used were from embryonic mice. Do you find it surprising that embryonic\nneurons from Tg2576 mice show such dramatic phenotypes in culture, while young Tg2576 mice\nappear healthy? Can you come up with a potential explanation for why this might be?\n-\nDid the authors mention blinding to genotype or treatment condition, either in the imaging or\nanalysis phase of the project? Do you think blinding is necessary for experiments like this?\n-\nIn experiments where the authors applied conditioned media to the cultures, how did the\nauthors confirm that the observed effects were due to Abeta itself, and not something else in\nthe media (e.g. in Fig. 3D)?\n-\nIf you had funding to develop a therapy for people with AD, and you could only use this paper as\na guide, what would you do with your funding?\nQuestions about Lesne et al., 2006:\n-\nWhy do you think Aß oligomerization has no significant effect on memory impairment early in\nthe disease?\n-\nThe authors claim that \"the variability in levels of Aß assemblies between animals of the same\nage provided an opportunity to examine correlations between the different Aß oligomers and\nmemory impairment\" What are these correlations? What was the conclusion? Do you agree\nwith their interpretations?\n-\nThe authors claim the Aß *56 is responsible for memory retention deficits? What is their\nevidence? Is it sufficient to make such a strong claim?\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n7.342 Synapse Remodeling in Health and Disease\nFall 2022\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "7.342 (F22), NSF Research Proposal 2014 Example",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-342-synapse-remodeling-in-health-and-disease-fall-2022/mit7_342_f22_nsf_research-prop_example.pdf",
      "content": "Research Proposal:\nDalila Ordonez\nThe effect of synaptogenesis on the survival of adult born hippocampal neurons\nKey words: Neurogenesis, synaptogenesis, dentate granule cells, entorhinal cortex, glutamate\npathway, enriched environment, NMDARs\nBackground: After embryonic development, neurogenesis ceases in all of the nervous system\nexcept the dentate gyrus and the olfactory bulb. Recent evidence has shown that adult\nneurogenesis in the dentate gyrus is not merely a remnant of development, but a tightly regulated\nprocess that equips mammals with the ability to adapt to various environmental changes4,5. In the\ndentate gyrus of the hippocampus, an area involved in memory formation, newborn neurons\ndifferentiate into dentate granule cells (DGCs)1,5. About 50% of new DGCs successfully\nintegrate into hippocampal circuits, a process enhanced by environmental enrichment, stress and\nthe completion of tasks that require learning. Enriched environments are frequently employed in\nstudies of adult-born DGC survival because the large number of novel environmental encounters\nprovides a simple means to encourage learning and subsequently elevates neuronal firing of\nnewborn cells. Neuronal activity and synaptogenesis are important in determining which cells\nsurvive5. Adult-born DGCs possess elevated intrinsic excitability and plasticity, and neuronal\nactivity and synaptogenesis are important determinants of which cells survive5.3 . For\nsynaptogenesis to ensue, all the following events need to occur: formation of dendritic spines,\nglutamate input coming from the entorhinal cortex and the formation of axonal projections3,4.\nNewborn DGCs receive excitatory glutamate signaling predominantly via the N-methyl-D\naspartate receptors (NMDARs) from the enthorinal cortex, an area responsible for encoding\nfamiliarity, and they send excitatory glutamate signaling to the CA3 region, an area responsible\nfor memory consolidation. Given these findings, it is important to understand the role of enriched\nenvironments in elevated neuronal activity and thereby in DGC survival5. Hypothesis: Since\nenriched environmental exposure increases neuronal firing in adult-born DGCs, I hypothesize\nthat this elevated neuronal firing increases the likelihood of synaptogenesis, and hence survival.\nTo determine if DGC survival is dependent on increased excitability, I will use a modified teg-\ntag transgenic mouse line that allows persistent labeling of newborn neurons, and I will track\nsuch neurons until a successful synaptic connection is made by implanting a cranial glass\nwindow for two-photon in vivo imaging2,7.\nSuch\ntechnique\nhas\nalready\nallowed\nscientists to obtain long-term in vivo\nimaging of dendritic spines in the CA1\nhippocampal\nregion2,7.\nIf\nenvironment-\nFigure 1: Modified Teg-tag transgenic mouse system.\ndependent\nneuronal\nactivity\nincreases\nDeng et al., eLIFE, 2, (2013). License CC-BY.\nneuronal survival, I will go on to study if the glutamate pathway plays a role in neuronal survival\nby blocking NMDARs in newborn DGCs.\nExperimental Design:\nAim 1: Determine if DGC survival and hippocampal integration is dependent on increased\nneuronal excitability elicited by environmental factors: To label activated newborn neurons\nduring an environmental exposure, I will use the doxycycline-dependent (dox) teg-tag transgenic\nmouse that I optimized during my internship at UCSD (Fig. 1). In these mice, neuronal firing\nactivates the Fos promoter and induces the expression of tetracycline-controlled transactivator\n(tTA), which activates the expression of the tau-LacZ/YFP tag.6. The presence of a mutated tTA\n(tTA*) will allow persistent tau-LacZ expression in neurons irrespective of dox treatment6.\nAnimals will receive bromodeoxyuridine (BrdU), a proliferation marker, at the beginning of the\nexperiment to label all the neurons that were born during that period. The enriched environment\nwill include a running wheel, colorful house nest and toys. A chronic cranial glass window will\n\nResearch Proposal:\nDalila Ordonez\nbe implanted into the mouse brain before environmental exposure for in vivo two-photon\nimaging2. The two-photon microscope offers long-term in vivo imaging in awake animals owing\nto the head plate that provides specific coordinates to continuously reimage the same neurons\nover time. Using the transgenic mouse model, I will label only the newborn neurons that were\nactivated during the enriched environment exposure and follow them with two-photon imaging\nuntil they make a successful synaptic connection. The formation of synaptic connections will be\ntracked daily using real-time imaging. The formation of a synaptic connection with a CA3 region\nneuron indicates that the neuron has integrated into the hippocampal circuitry. In addition,\ncontrol experiments will be conducted with no exposure to an enriched environment. Since\nproper synaptic connections is required for neuronal survival, with these experiments, I expect to\nestimate the proportion of surviving neurons among those activated during environmental\nexposure. If the enriched environment is influencing the survival of newborn neurons, the\nnumber of successful synaptic connections of activated neurons should be higher in the enriched-\nenvironment group than in the control group. Such results will suggest that elevated neuronal\nfiring during exposure to the enriched environment improved newborn neuron survival. If the\nresults are very similar to control animals, this will suggest that environmental exposure during\ndevelopment increases neuronal activity of newborn neurons1 but that it is not sufficient to\nensure their survival.\nAim 2: Determine if neuronal survival is regulated by glutamate signaling between the\nentorhinal cortex-DG-CA3 region: NMDARs are predominantly responsible for the glutamate\nexcitatory signaling that newborn neurons receive from the entorhinal cortex during their\ndevelopment. Therefore, blocking NMDARs in the DGCs will impair the signaling input they\nreceive. Carboxyethylester (CGP 39551), a high-affinity NMDAR antagonist, will be\nadministered intraperitonially (ip) to block NMDARs. By blocking the glutamate pathway, I will\nbe able to determine the role of glutamate signaling in the survival of newborn neurons. I will\nuse the same experimental setup described in Aim 1. Two control groups will be included to\ndifferentiate between the effects of the enriched environment plus NMDAR blockage and the\neffects of NMDAR blockage alone. I expect to obtain an estimate of the number of neurons that\nwere activated and survived in the presence of the NMDAR antagonist. Such results will be\ncompared to the number of neurons that were activated and survive in the absence of the\nNDMAR antagonist. If antagonist treatment decreases the number of activated neurons that\nmade a successful synaptic connection and survived, it will suggest that enriched environmental\nexposure increases glutamatergic signaling, providing the newborn neurons with sufficient\nsignaling input to ensure the formation of a proper synaptic connection. If the number of\nantagonist-treated neurons making proper synaptic connections is higher than or equal to that in\ncontrol groups, I would conclude that environmental effects are not exerted via the glutamate\npathway. If the glutamate pathway does not have an effect on neuronal survival, I will examine\nthe GABAergic signaling pathway, which is predominantly activated during early development\nof newborn neurons.\nBroader impacts: An understanding of the formation of synaptic connections and neuronal\nsurvival in the adult brain will shed light on the putative function of adult neurogenesis in\nhippocampal information processing and storage. In addition, these studies will provide us with a\nnew method that can be use to modulate adult neurogenesis. Also, working with undergraduates\nin this project will allow me to continue mentoring and training young scientists.\nReferences: 1Deng et al., eLIFE, 2, (2013). 2 Gu et al. J. Neuroscience, 34, 13948-13953 (2014). 3Kelsch et al.\nAnnual Review Neuron, 33, 131-149 (2010). 4Tashiro et al. Nature, 442, 929-933(2011). 5Zhao et al. Cell, 132, 645\n660 (2008). 6Reijmers et al. Science, 317, 1230-1233(2007). 7Velasco et al. Biomedical Optics Express, 5 (4), 1700\n1708 (2014).\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n7.342 Synapse Remodeling in Health and Disease\nFall 2022\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    }
  ]
}