{
  "course_name": "Technology and Culture",
  "course_description": "No description found.",
  "topics": [
    "Social Science",
    "Anthropology",
    "Cultural Anthropology",
    "Public Administration",
    "Science and Technology Policy",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology",
    "Public Administration",
    "Science and Technology Policy"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 2 hours / session\n\nPrerequisites\n\nThere are no prerequisites for this course.\n\nCourse Description\n\nThis 9-unit subject examines relationships among technology, culture, and politics in a range of social and historical settings. Does technology save us work? Improve our health? Ameliorate social inequality? We organize this class around two topics: Identity and infrastructure. How does thinking of our bodies and selves as technologies shape our ideas and experiences of cultural and personal identity? How are politics built into our infrastructures, from roads to electricity grids to the Internet and beyond? We will be interested in whether technology has produced a better world, and for whom.\n\nClasses will combine interactive lectures, film screenings, and discussion. Each class is keyed to a set of readings, and it is crucial that students keep up with the readings and be prepared to discuss them in class. Some lectures will directly engage our readings while others will provide contextualizing historical and theoretical information. We will routinely break into small groups for more concentrated discussion. Class participation will count strongly towards the final grade.\n\nWe expect students to adhere to MIT's guidelines on academic integrity. Plagiarism, unauthorized collaboration, cheating, or facilitating academic dishonesty may cause us to contact the\nOffice of Student Conduct\nor\nCommittee on Discipline\n. If you have questions about what qualifies as plagiarism and how to avoid it--and for tips on how to succeed--check out:\nAcademic Integrity at MIT: A Handbook for Students\n.\n\nRequirements\n\nStudents will write two 6-7 page papers (1800 words or so). Each represents one third of the subject grade. Papers correspond to two thematic sections of the syllabus and will integrate class readings with a topic of each student's choosing. Students will also be evaluated on class participation, including discussion and in-class writing exercises (one third of subject grade). Punctual attendance is obligatory. There is no final.\n\nStudents are expected to attend class, complete all assigned readings (approximately 60-90 pages a week) and actively participate in class discussion, which will incorporate readings as well as project assignments. Readings and assignments are to be completed by the session indicated in the\nReadings\ntable.\n\nPlease bring to class the required readings for each session--a book, or printed hard copies or electronic versions of the articles. You will need these to participate in class discussion, complete in-class exercises, and perform group activities.\n\nWriting and Communication Center\n\nMIT's\nWriting and Communication Center\noffers free consultation as well as on-line help to MIT students at any stage of the writing process. Get help overcoming writer's block and formulating an argument, and with questions on grammar and style. (Writing Center consultants do not proofread, but they do offer help with grammar and beyond).",
  "files": [
    {
      "category": "Resource",
      "title": "“Glyph” – A Step Towards Isolation",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-500j-technology-and-culture-spring-2014/f97be155175b2bae73eb0a2c994c38eb_MIT21A_500JS14_the_glyph.pdf",
      "content": "Massachusetts Institute of Technology\n21A.500J/STS.075J Technology and Culture\n\"Glyph\" - A Step Towards Isolation\n\nSince Sony's first Walkman in 1979, headphones and ear buds have been\nintegral technologies in almost everyone's life. Wearable technology, more\ngenerally, has been penetrating the market during the last few decades. As\nJenkins says in Look, Listen, Walk, \"You've seen them. Maybe you're one of\nthem. They're the zombies of the New Media Era: the unthinking, the unseeing,\nthe undead. They are all around us.\" (Jenkins, 2004). Wearable technologies\nhave encompassed users in their own bubble and isolated them from their\nsurroundings. One of the new wearable technologies in the market that is\ninspired by the simple headphones is \"Glyph\"; a mobile wearable theater\ndesigned by Avegant. This paper will focus on this new technology and its social\ndimensions including the consequences on users. The analysis of Glyph will rely\non several theories of technology and culture as well as other studies and articles\non wearable technologies.\nWearable technologies (wearables), as indicated by the name, refer to\ntechnologies that can be worn on people's bodies. Headphones, smart watches,\nglasses, and Cochlear implants are all among the many wearable technologies\navailable in the market. The goal behind creating wearable devices is mobility\nand practicality. Designers advertise their ideas by convincing consumers that\nthey could have this technology with them wherever they are, and whenever they\nare by minimizing the need for bulky systems such as screens, keyboards,\ndesktop speakers, and so on.\nGlyph is an emerging wearable technology, currently in its development\nstages, which consists of a headset for audio and a bar that slides over the eyes\nfor video. Glyph uses a virtual retina display technology to provide the user with a\ntop-notch virtual image. It does not require a screen, but instead it uses micro-\nmirrors and fiber optics to create a virtual image that Avegant's CEO, Ed Tang,\nargues is clearer and sharper than anything people have seen so far. (About the\nTechnology, 2014)\n\nFirst and foremost, the social dimensions of such wearable technology\nmust be examined before diving in the potential of success of such device. A\nrecent article was published in the Tech Review by Rachel Metz about Glyph\ntitled The Future of Personal Entertainment, In Your Face. Metz describes the\nphenomenal experience she had using Glyph for the first time. In the \"Why it\nMatters\" section it says: \"A personal entertainment headset may overcome some\nof the limitations of current computer interfaces,\" (Metz, 2014) but this personal\nentertainment headset may also overstep on the social and cultural construct of\nour community. If every person will have their eyes and ears covered by this\nheadset, they will inevitably lose any natural connection with the outside\nsurrounding environment.\nIn Fetishism of the Commodity and Its Secret, Karl Marx defines Fetishism\nas making an inanimate object animate and argues how certain inputs (labor in\nMarx's example) could become overlooked commodities (Marx,1867). This can\nbe analytically expanded and applied to different scenarios. Glyph picture-\nforming technology is a visual reification, since it makes a picture seem real\nwhereas it is entirely an abstraction. Also, Glyph as an overall product fetishizes\nentertainment by transforming an inanimate form of audio and video transmitted\nthrough bits and bytes to an animate virtual reality. The repercussion of this is the\ncreation of an illusion of a sending-and-receiving relation that the user may think\nthey are experiencing, whereas in reality users are mere receivers interacting\nwith an inanimate object.\nThe PSFK report The Future of Wearable Technologies addresses\nwearables by looking at connected intimacy, tailored ecosystem, and co-evolved\npossibilities as the three categories wearables improve upon (PSFK, 2014). As a\nfuture wearable product, Glyph contributes to these three perspectives. First, the\nway Glyph is used with a bar completely covering the eyes as depicted in the\nfigure above, one is completely isolated from anything and anyone around them,\nand thus limiting connected intimacy. While smart phones, regular headphones\n\nand even laptops somewhat limit the person from interacting with their\nsurroundings, their eyes are still able to look around. For example, while on a\ntrain using your phone or listening to music you can still look around and share\nglances with other people, and similarly when using your laptop in a coffee shop,\nyou could still take a break from continuously staring at the screen. This allows\nthe user to benefit from connected intimacy by succeeding in utilizing a new layer\nto personal relationships and interactions (video chat, texting and other methods\nof social online communication) while still enabling the user to exist in other\nsocial dimensions. On the contrary, Glyph, only presents a one-dimensional\nsocial construct that consists of the user. The user is quite literally blinded from\ntheir surroundings. Whether one uses Glyph to socialize, play games or watch a\nmovie, they are not interacting with anything beyond Glyph, and this is\ndestructive on different levels.\nMetz describes her experience:\n\"I'm watching a jellyfish pump past me lazily, its movement interrupting the\ntwinkling of underwater particles, when a sea turtle suddenly swims my\nway and starts munching on the jellyfish's tentacles...but the image in\nfront of my face feels real enough that I cry out, 'Oh, no, don't eat that!\nThat's not going to taste good!'... The world outside my undersea\nenvironment is less dramatic\" (Metz, 2014).\nThis description of a first-hand Glyph experience conveys the idea of the\nfetishized reality of this technology. Metz admits that the world she is engaged in\nthrough her 3D Glyph projection is far more dramatic than the outside world.\nWhile it is important to have entertainment technologies that help us escape the\nwhirlwind of the challenging reality, the effect of having this virtue as portable as\nGlyph is somewhat frightening. Imagine what life would be like, if one could\nescape to a virtual, more dramatic and more entertaining life. People will have\nGlyph over their ears and eyes at all times. In public transportation, workplaces,\nschool recess, home, and everywhere else where they do not need to be using\ntheir eyes for any other function. People's sole interaction will be with this\n\nwearable technology further diminishing the, already decreasing, person-to\nperson social interaction. One of the most important educational resources is the\nsurrounding reality. I believe that walking down a street fully attentive to the\nenvironment and paying attention to all the little details is a learning experience.\nGlyph, and similar wearable technologies, strip away this attention from reality,\nand redirect it to a virtual, non-realistic, introverted experience.\nSecond, Glyph can be viewed as a tailored eco-system. Wearables are\ncommodities like most products that are designed by companies to meet\npeople's needs or wants. Products must have a certain functionality that will\ncreate demand for them in the market, or else they will be produced at a loss.\nThe CTO of Avegant, Allan Evans, expresses that Glyph's technology is a\n\"requirement\" for all consumers who watch movies (About the Technology,\n2014). Accordingly, Avegant makes Glyph as functional and practical as possible\nto meet this greater purpose, and to satisfy a targeted customer base (i.e. movie\nwatchers). For instance, Glyph can be hooked to anything that can essentially be\nplugged into a screen including smart-phones, DVD players, computers and\nothers. Metz expresses her satisfaction with Glyph's adaptation to ones sight;\nshe says: \"I'm also surprised to learn that I can wear the Glyph without my\nglasses, since I can adjust the distance between each pupil and focus each eye\nindividually. Once I do this, I have a big, crisp image in front of me. I'm floored to\nsee the images in front of me quite clearly without my specs, which I normally\nwear for pretty much everything.\" These are among the main features Avegant\nadvertises making Glyph a wanted product. Yet, with all this in mind, Glyph still\ncontributes to breaking the social events related to watching movies, which\nchanges the way this entertainment system is viewed. Movies started out in\nmovie theaters as a social event where many people meet in the same room\nlooking at the same screen. This ensures some level of communication between\nviewers. Then, it advanced to VCR and DVD's where people were able to mimic\nthe theater experience at the comfort of their homes, which made it a more\nfamily-based event, yet still involving some level of socialization. Now, many\n\npeople watch movies on their laptop alone, but there is still a possibility to view it\nwith others, and the existence of such possibility is important. Glyph strikes out\nthis possibility, encouraging watching a movie or a TV show individually with no\nsocial interaction. This is one of the many examples of how wearables are\ntransforming the forms of entertainment, as we know them.\nLastly, we can view Glyph as means of creating co-evolved possibilities,\nwhich applies directly to other wearable technologies. Simply, Glyph is capable of\ntaking a major role in daily activities and altering the relationship users have with\ntechnological objects. Although in the technological world this is a very\nprestigious goal and respected accomplishment, it is still quite dangerous on\nsociety. In Technology The Emergence of a Hazardous Concept, Leo Marx\nargues that technology becomes hazardous when it becomes the driving force of\nsociety due to our complete dependence on machines. (Marx, 2010). It seems\nthat wearables, including Glyph, are headed in that direction. Glyph is\nundoubtedly a fascinating technological product. The idea of a portable theater\nwith spectacular resolution wherever you go is mind blowing. Unfortunately,\npeople may be mind blown by the functionality and greatness of such\ntechnologies and simultaneously disregarding the potential consequences. If the\nmeans of interaction are transformed from people socializing with others to\npeople socializing with their wearables, perhaps their Glyph headset, then they\nwill be getting into the hazardous quicksand of technology as defined by Marx.\nMetz's only complaint is that Glyph is slightly bulky and too heavy to wear\nfor a long period of time, or when playing a racing game that requires some hand\nmovement the headset would move. However, Glyph is still in its research and\ndevelopment process, so it is very likely it will be improved in terms of size and\nother physical features. Metz also expresses that her experience was very\npositive with Glyph and that she would be willing to watch an entire movie using it\n(Metz, 2014). This further proves that users are most likely to be fascinated with\nthe technology behind Glyph overlooking its more complex social effects. Not\n\nonly will users be blindfolded when watching movies or playing games, thereby\nlosing the social construct of group activities, but they will also be at danger of\nhaving their eyes blocked while in a public place. As it is nowadays, many\nincidents of violence take place because people have their ear-buds in and are\nnot aware of their surrounding vicinity. One could only imagine that theft and\nphysical violence are more feasible when people have their eyes blinded as well\nas their ears.\nTaking a step back and looking at wearable technologies in the bigger\npicture, the market for wearables is growing rapidly. In Tech Attire, More Beta\nThan Chic, a New York Times article, Brian Chen states: \"The wearables\ncategory is expected to be highly lucrative. Gartner, the research firm, estimates\nwearable computers... will be a $10 billion market by 2016. The research\ncompany says that much of the revenue will come from accessories with health\napplications, like devices that count your steps or do things like automatically\ndeliver insulin for diabetics.\" (Chen, 2014). This incredibly large market will\ninevitably find its way to become a life routine. However, users must be mindful\nof the consequences behind the functionality. For instance, the automatic insulin\ndelivery Chen mentions will save lives and improve health, whereas portable\ntheaters will only encourage isolation and destruct social norms. Although this\nmay seem like an exaggeration, yet if not addressed drastically, these\nrepercussions could easily be overlooked and populations worldwide will be\nunmindfully using these devices.\nWearables are not only entering our life as entertainment products, but\nthey have made their way through to assessing our lifestyles. In The Body Craze\nData, Allisa Quart argues how wearable technologies quantify and measure\nmany aspects of our lives like heart rate, sleeping patterns, distance walked and\nso on without us realizing the negative effect on our health. The utter\nconvenience of such devices that require minimal input effort shadows the\ndanger of being exposed to electronics almost every hour of every day. This can\n\nbe extended to all wearables whether they serve health or entertainment\nfunctions.\nFrom an anthropological perspective, we must analyze all the\nconsequences, positive and negative, these technologies have. However, as\npotential users, we must be fully aware of the extent in which wearables can\naffect us. Such technologies will most likely enter the market regardless our\nopinion, because the market is driven by technological advancement and\ngenerated demand. Yet, we, as individuals and as a collective entity, have the\npower to assess our need for these technologies. In most cases, we do not need\nwearables, we merely want to depend on their convenience or want their new\nadded value features. Considering that users could be aware of this reality these\nwearables can eventually serve as convenient luxuries. Circling to Leo Marx, we\ncan conclude that luxurious wearables are acceptable up until the turning point\nwhen people start viewing these technologies as the driving force of their society.\nAt that point, we will fall into the one-dimensional virtual reality, failing to save the\nother dimensions that create a society; or rather, a community.\n\nBibliography:\n- About the Technology. About the Technology. Avegant, n.d. Web. 16 Mar.\n2014. <http://www.avegant.com/>.\n-\nChen, Brian X. \"Tech Attire, More Beta Than Chic.\" New York Times. N.p., 8\nJan. 2014. Web. 16 Jan. 2014.\n- Intel and PSFK Labs. 2014. The Future of Wearable Tech,\nhttp://www.slideshare.net/PSFK/psfk-future-of-wearable-technology\nreport?utm_source=slideshow02&utm_medium=ssemail&utm_campaign=sha\nre_slideshow\n- Jenkins, Henry. \"Look, Listen, Walk\". The Technology Review. 2 Apr. 2004.\nThe Technology Review. Web. 16 Mar. 2014.\n- Marx, Karl. 1867. The Fetishism of the Commodity and Its Secret. In Capital,\nvol. 1. Translated from the German by Ben Fowkes. London: Penguin, 1976,\n163-177.\n- Marx, Leo. 2010. Technology: The Emergence of a Hazardous Concept.\nTechnology and Culture 51 (3): 561-577.\n- Metz, Rachel. \"The Future of Personal Entertainment, In your Face\". The\nTechnology Review. 30, Jan 2014. The Technology Review. Web. 16 Mar.\n2014.\n- Quart, Alissa. The Body-Data Craze\". Newsweek. 26 Jun. 2013. Newsweek.\nWeb. 16 Mar. 2014.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21A.500J / STS.075J Technology and Culture\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "The Grid",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-500j-technology-and-culture-spring-2014/efe70b7d32f34ea15d7bae59d4bbecf6_MIT21A_500JS14_the_grid.pdf",
      "content": "MIT Student\n21A.500J\nMay 15, 2014\nThe Grid\nThe sun's setting. My forehead presses against the cool windowpane. I'm home on summer\nbreak from college in the city. My brother decided to stay in town with his girlfriend. I can see\ndowntown from my room, all glinting glass and metal rising hundreds of stories into the sky. The\nair is filled with MagLev cars, their occupants letting the automatic system drive while they read\nthe paper or call a friend. The Grid holds everything up. It all looks so big. The outskirts feel\nsmall by comparison. The houses are old, no more than ten stories and heavy with concrete and\nbrick. The Grid still hasn't reached this far out.\nDowntown grew first because it was just more populated. They say we were running out of land,\nand that's why we grew upwards instead - there was so much space up there. MagLev or\nMagnetic Levitation devices were already getting pretty popular back then, but they were small\nscale until the Grid was laid down. Mile after mile of metal crisscrossing under the city, giving\nthe MagLevs something to repel from. Now, the city grows upwards, buildings and sidewalks\nand cars hovering miles above the ground, while the outskirts are held firmly down by gravity -\nand our own stubbornness.\n\"Like hell they can tear up my roads, my neighborhood - my home!\" Dad's voice echoes from\ndownstairs. He yells a lot these days and he's on the phone a lot. There's definitely a correlation.\nThe city is trying to expand the Grid and most neighboring towns like ours won't let them1. Dad\nworks as a lawyer in the city, but when he comes home, he helps run the Anti-MagLev Society2.\nHe uses his skills as a lawyer to his advantage. They mostly call the city and sign petitions, but\nevery once in a while, someone does something radical. Our neighbor's son almost got arrested\nlast week for harassing a city contractor who came in to survey the roads. I think he stole some\nequipment.\n1 ͼϦρηηνΧΑ Ͷ & ΕΥΧΑ ΕΗ Ω͏ρΥρυΥΧ CηΧρϦΦ͏ν Ε͏ΧηΠηϸΕ First method of resistance is opposing the\nintroduction of a technology into a community\n2 ΠΥΧ͏Α Η & ΕΥΧΑ ΕΗ ΩΙρ͏νρ ρ !͏Χυρ η Ε͏ΧηΠηΥΠ CΧ͏Ε ρΥΦΥΠν υη υ͏ ΧυΥ-automobile societies created in\nrural parts of the US, who petitioned and also used more drastic measures to stop the influx of cars\n\n\"Alright pal, bribery isn't getting you anywhere. You can shove that \"compromise\" of yours\nright up your - \"Dinner time!\" Mom saves the day again. I peel myself away from the view and\nrun downstairs.\nMom's laying out plates when I get to the dining room. Dad fumes the corner, aggressively\nmixing the salad. A lettuce leaf flies out of the bowl. I reach over and pop it in my mouth.\n\"What did they say this time?\" I ask.\n\"They said they want to compromise, but it's all just cheap tricks.\" I raise an eyebrow, and he\ncontinues. \"They said they have a design for a new hybrid car - MagLevs and tires, all at once,\nso we can keep using it on normal roads here, and still get into the city. Honestly, all they really\nwant is to create demand for the Grid. We'll start liking these hybrids and one day, we'll all just\nconvert to the real things.3\"\nMagLev cars are fast and safe, using sensors to signal to each other. The new buildings that\ncome with the Grid are clean and pretty, and house hundreds and thousands more people than the\nsquat buildings here now. The problem is that only happens after installation. Installing the Grid\nin the first place is a logistical disaster. Roads are torn up and houses are demolished to clear the\nway for the every growing metal lattice. Dad grew up in this apartment, and he's not about to let\nit go down without a fight.\nThe city isn't going to let it go either. Until the whole area is converted to the Grid, the\ntechnology will continue to be a mix of botched hybrids trying to accommodate two\ndifferent ways of living. Somehow, they'll create demand until the Grid covers the region.4\n*****************\nAlex is my best friend - we grew up together. She's staying in her dorm over the summer, like\nmy brother. That weekend, I drive to visit her. The road into the city is having the Grid installed,\nso traffic is a disaster.5 Construction crews swarm across the highway, digging up concrete and\ndragging huge metal bars into the holes. The four lane road has been condensed into one. Traffic\n3 ΠΥΧ͏Α Η & ΕΥΧΑ ΕΗ ΩΙρ͏νρ ρ !͏Χυρ η Ε͏ΧηΠηΥΠ CΧ͏Ε Because of the users, manufacturers may\nredesign technology to fit a social construct.\n4 ͼϦρηηνΧΑ Ͷ & ΕΥΧΑ ΕΗ Ω͏ρΥρυΥΧ CηΧρϦΦ͏ν Ε͏ΧηΠηϸΕ The creation of demand, like the promotion of\nelectric washers during electrification, is used to increase technology use.\n5 As discussed in lecture, infrastructures often build off the infrastructure that is already present (like the roads).\n\nbegins to spread out when we reach town. Construction was finished long ago, shiny buildings\nreaching to the sky and MagLev cars ripping by overhead. I drive carefully - my old car doesn't\nhave the sensor that the new cars do, so the automatic driving system doesn't always recognize\nit. My dad petitions a lot against the new cars because of that. Something about \"dangerous\ninstrumentality\" and liability and all kinds of other lawyer speak.6\nI arrive half an hour late. Alex lives on the 76th floor. She meets me in the lobby, and we jump\ninto the elevator. The magnetized car accelerates upwards at a breathtaking speed. The doors\nslide open.\n\"I'll never get over this view,\" I sigh. Wall sized windows show light, wispy clouds floating\naround the tops of buildings downtown. I'll have a similar view from my dorm next semester.\n\"Eh, it's not that bad,\" Alex grins. \"C'mon, I wanna show you what I got!\" She grabs my arm\nand drags me to her room. She pulls a pack of cigarettes and a lighter from her desk drawer, and\nan odd looking set of bracelets from under her bed. She shoves it all into a faded canvas bag, and\nwe head back to the elevator.\nOnce outside, we run around the building to the new park. It's quiet and cool under the trees. We\nsit on a bench as Alex lights a cigarette.\n\"Mkay,\" she says. \"Check these babies out.\" She rummages in her bag with one hand and holds\nup four black bracelets for me to see. They're adjustable. Each has a single LED, flashing green.\nI frown. \"What are they?\" I ask.\n\"Hover bracelets, duh!\" She's grinning ear to ear. \"See, the light goes green when you're on top\nof the Grid. It means they'll work.\"\n\"Work how, exactly?\"\n\"Like this.\" Alex hands me the cigarette, and puts two bracelets on her wrists, and two on her\nankles, tightening the straps. She waggles her eyebrows at me and taps her fingers twice against\nthe left bracelet. She rises into the air, giggling. My jaw drops.\n6 JainΑ ΩΗ ΩDΧ͏νηϦρ ΧρυνϦΦ͏ΧυΠΥυϸΕ Hης η ς͏ Π͏ΠΠϸ ΧΠ͏ Χ͏ς υ͏ΧηΠηϸΑ ρϦ ρ νρΑ Χ ςη Υρ\nresponsible for accidents?\n\n\"Wha-?\" I try to compose myself. \"There is no way that thing is legal.\"\nAlex shrugs as she floats around the park. She looks weightless. \"Probably not. Then again,\nneither are those things.\" She nods towards the cigarette I'm still holding for her. I gingerly put it\nout and drop it in the trash next to the bench.\n\"Okay, well, how does it work? Where'd you get it?\" I'm bubbling over with questions.\nShe's floating about on her back, eyes closed. \"You know Max? He was in our anthropology\nclass last semester? Whatever, it was him. I don't know all the science, honestly, but long story\nshort, they're MagLev. It works because of the Grid!7 I heard some guy in the year above us\nmanaged to MagLev his skateboard. Pretty sick, huh? Apparently, MagLev Corp is opening up a\ncompetition. Best unorthodox use of the Grid - you know, not the buildings and cars and stuff -\ncould land you a job there doing R&D!\"\n\"Wait, seriously?\"\n\"Yeah, it sounds like they're trying to make the Grid more popular. You know, get input from\nthe rest of us. 8 It pays well too. Okay, your turn.\" Alex floats back down and unstrap the\nbracelets. She hands them to me. \"Put them on!\"\nI take the bands and wrap them around my wrists. Alex pulls out another cigarette.\n\"Hold up. You should come up with something for the competition!\"\nI stop wrapping to stare at her. \"No way. My dad would kill me. Or disinherit me. Or both. Plus,\nI would never win.\"\n\"Please. You get straight A's in everything ever, and I know you love the engineering classes\nyou started taking last semester. You're a natural!\"\n\"I can't. Really.\" I finish wrapping my ankles and tap the left wristband twice. A smile creeps\nacross my face as my feet lift off the ground. I feel like I don't weight anything.\n7 ͼϦρηηνΧΑ Ͷ & ΕΥΧΑ ΕΗ Ω͏ρΥρυΥΧ CηΧρϦΦ͏ν Ε͏ΧηΠηϸΕ Ω͏ηΧ Φ͏υη η ν͏ρΥρυΧ͏ Υρ Χηυ ϦρΥΧ υ͏ΧηΠηϸ\nis the prescribed manner.\n8 ΠΥΧ͏Α Η & ΕΥΧΑ ΕΗ ΩΙρ͏νρ ρ !͏Χυρ η Ε͏ΧηΠηΥΠ CΧ͏Ε Ιρ͏νρ Χ ΥΧΠϦ͏Χ͏ υ͏ΧηΠηϸΑ ΥΧρυ͏ η\ntechnology influencing the users.\n\n\"Sure you can!\" Alex waves her arms dramatically. She pulls a tablet out of her bag. \"Look, the\napplication is right here online. You don't even need an idea yet, they just want an idea of how\nmany people are signing up.\"\nShe holds the tablet up to where I'm floating. I take it and roll lazily onto my back, like she did\nearlier. It feels wonderful. I look at the application. I'm torn.\n*****************\nWhen I get home, mom's on the phone with my brother. I flop down on the sofa and turn on the\nTV. Ads for MagLev cars and new super high-rise apartments stream by9. A few minutes later,\nMom says goodbye and hangs up. She joins me on the sofa, offering me a bag of pretzels.\n\"Andrew says hi,\" she says. \"He seems to be doing well.\"\n\"Oh, yeah?\" I ask. Mom laughs a little.\n\"Your father will be proud to hear that although your brother continues to live in the city, his\ngirlfriend seems to have a good influence on him. Remember how she's from the countryside?\nWell, apparently the rural folk make your father's anti-MagLev campaign look like child's play.\nThey literally go in and stand before the construction machines and rip up the Grid and all kinds\nof craziness. Point is, she's convinced your brother to not take part, as he called it. They're living\nin an apartment on the ground floor and are driving a regular car and everything. They just won't\nget involved with this whole Grid thing!10\"\nI laugh. Dad will be happy to hear about that. I remember the application. Alex emailed it to me\nwhen I wouldn't fill it out in the park. I haven't filled it out, but I haven't deleted it. Dad would\nbe less happy to hear about that.\n*****************\nDad gets home late.\n9 ͼϦρηηνΧΑ Ͷ & ΕΥΧΑ ΕΗ Ω͏ρΥρυΥΧ CηΧρϦΦ͏ν Ε͏ΧηΠηϸΕ Ε͏ GνΥ Υρ ρ͏νυΥρ͏ ΥΧ Χ υυ͏Φκυ υη ΥΧν͏ρ͏\ndemand.\n10 ͼϦρηηνΧΑ Ͷ & ΕΥΧΑ ΕΗ Ω͏ρΥρυΥΧ CηΧρϦΦ͏ν Ε͏ΧηΠηϸΕ Ε͏ υΥν Φ͏υη η ν͏ρΥρυΧ͏ Υρ ϸ Χηυ\nΩκϦνρΥΧ υ͏ υ͏ΧηΠηϸΑ Πρη ΠΠ͏ ΩηΧρϦΦ͏ν ν͏ρΥρυΧ͏Η\n\nI've been thinking and worrying in the weeks since I visited Alex. I know my father has a point\nabout the dangers of the Grid. If they install it here, our home will be demolished and we will\nhave temporary housing in the city while the metal is laid and the residences put up. The new\nresidences can house hundreds and thousands of more people than our little homes. The\ncommunity would be drastically altered. He worries about the safety of the new cars and who is\nliable for damages. He sees the problems.\nI see things differently. I don't understand why we have to believe that this new technology, this\nnew infrastructure has to influence us so negatively. Why don't we influence the technology, and\nfit it to our culture? I want to be a part of the people that change technology in the way that we\nwant, to make it fit our society.11\nDad gives me a hug. I take a deep breath. \"I'm not going back to school next year.\" He stops\nshort. Another deep breath. \"I'm going to work for the Grid.\"\n11 ΠΥΧ͏Α Η & ΕΥΧΑ ΕΗ ΩΙρ͏νρ ρ !͏Χυρ η Ε͏ΧηΠηΥΠ CΧ͏Ε ! Ϧρ͏ν υΥρ͏ly decided to take initiative to\ninfluence a technological infrastructure, so that the infrastructure better fits the societal norms of the users.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21A.500J / STS.075J Technology and Culture\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}