{
  "course_name": "Techniques for Structural Analysis and Design",
  "course_description": "This course introduces analysis techniques for complex structures and the role of material properties in structural design, failure, and longevity. Students will learn about the energy principles in structural analysis and their applications to statically-indeterminate structures and solid continua. Additionally, the course will examine matrix and finite-element methods of structured analysis including bars, beams, and two-dimensional plane stress elements. Structural materials and their properties will be considered, as will metals and composites. Other topics include modes of structural failure, criteria for yielding and fracture, crack formation and fracture mechanics, and fatigue and design for longevity. Students are expected to apply these concepts to their own structural design projects.",
  "topics": [
    "Engineering",
    "Aerospace Engineering",
    "Materials Selection",
    "Structural Mechanics",
    "Engineering",
    "Aerospace Engineering",
    "Materials Selection",
    "Structural Mechanics"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 3 sessions / week, 1 hour / session\n\nLearning Objectives\n\n16.21 is a junior level course on techniques for structural analysis and design. Special emphasis is given to the learning of modern computational methods used in aerospace structural design. Equal importance is given to the learning of the role of material properties in structural design, failure and longevity. Although the focus of the course is on aerospace structures, the topics covered are relevant to a wide variety of applications in engineering.\n\n16.21 has a specific set of learning objectives which the student should always keep present as the semester progresses. Students graduating from 16.21 will be able to:\n\nFormulate and apply appropriate mathematical and numerical models to predict the state of stress and deformation of one, two and three-dimensional aerospace structures.\n\nExplain the limitations of the models, assess their applicability to realistic configurations and estimate the errors resulting from their application.\n\nDesign and conduct a computational analysis of a structural design in collaboration with members of a team.\n\nApply the concepts learned in the course to assess and explain the possibility of failure in aerospace structural configuration.\n\nMeasurable Outcomes\n\nStudents graduating from 16.21 will be able to:\n\nApply energy and variational principles for the determination of deflections and internal loads in one-dimensional structural elements.\n\nApply Ritz Method for the approximate calculation of deflections and stresses in one-dimensional structural elements.\n\nExplain the principles and implementation of the finite element method in linear static problems.\n\nApply the finite element method in the stress analysis of aerospace structural components.\n\nDesign a structural component of an aerospace structure with the aid of state of the art finite element techniques. Structural design criteria will account for stiffness, strength, toughness and useful life considerations.\n\nPrerequisites\n\n16.21 has Unified Engineering (16.03-16.04) as a prerequisite. Students taking 16.21 are expected to have the basic structural mechanics background as provided in Unified. However, all the concepts required in the course will be reviewed.\n\nLectures\n\nThere will be three one hour lectures a week. Student attendance is necessary to maximize the learning experience. Lectures will be used for presenting new concepts. Lecture notes will be available for download from the course's Web site. In addition, reading assignments from the course textbook will be given for each lecture. The learning of abstract concepts will be aided with electronic courseware developed especially for this course. This material consists of mathematical software tools written in Mathematica(r) which provide opportunities to illustrate and exercise the concepts as they are presented in class.\n\nRecitations\n\nRecitations will be primarily used as opportunities to practice problems similar to those found in home assignments and to answer questions that may arise. A second purpose of recitations is to learn the use of the software adopted in the course (mathematical and finite element software).\n\nIn the first recitation a Mathematica(r) Tutorial will be offered. In the second recitation a tutorial on SolidWorks, the solid modeling software used for the project, will be offered. Before the design project is introduced, a tutorial on Cosmos, the finite element software used for the sole purpose of carrying out the stress analyses required in the project, will be offered. Additional help with the software used in the course will be provided upon request. Students are strongly encouraged to gain acquaintance with both pieces of software early on. Mathematica(r) is heavily used for algebraic manipulation and numerical computation in the assignments, as well as in lectures as a didactical tool. Practice problems on the use of the software will be given in home assignments for training purposes\n\nActive Learning\n\nThe following practices of active learning will be implemented in this course:\n\nIn class concept questions with the aid of PRS cards (a custom version of the system used in Unified). These are presented during the lecture and intended to provide an immediate assessment of the understanding of the most important concepts by the students. The answers are discussed immediately after.\n\nMuddy cards: this is a well established and successful mechanism of feedback for the instructor which many students are familiar with. Cards are distributed at the beginning of each lecture and the students put down their comments on the lecture: specific points on the material covered in class that was not clearly presented, comments that the student considers as appropriate feedback for the instructor, suggestions that might contribute to the improvement of the lectures. The cards are turned in at the end of the lecture. The instructors will make every effort to respond to the muddy cards at the beginning of the following lecture. Muddy cards are anonymous and an essential feedback mechanism for the instructor. We strongly encourage their use.\n\nHands on collaborative computing sessions: In these sessions, each student uses a computer terminal to operate a central computer shared by the whole group. A computing problem is presented to the class in advance, e.g. a homework problem, and the solution is developed and implemented during the recitation on the central computer with the active, hands on participation of the students and instructor. A special networking technology (\nVNC\n) is utilized that allows the simultaneous action of the input devices (mouse, keyboard) from all the participant clients, as well as the output display on all the participant clients' screens.\n\nCourse Work Homework\n\nReading Assignments\n\nStudents are expected to read assigned material from the textbook prior to its discussion in class. The reading assignments are not part of the assessment process, i.e., they do not contribute directly to the grade. They can only affect the grade indirectly through the students' participation in class. Students are strongly encouraged to read the assigned material in order to maximize the learning experience. Reading assignments will be scheduled during the term and announced in class and on the Web site.\n\nProblem Sets and Computer Assignments\n\nA total of approximately ten (10) problem sets and computer assignments will be given on a weekly basis. The due date for submission of assignments is at the beginning of class the Wednesday after the assignment is given. Late submission of assignments is not accepted. A convention for file naming which facilitates the grading task will be given in the first assignment, as well as guidance on the electronic material to be submitted. Students are strongly encouraged to discuss homework problems in groups, since this is expected to help the learning process. However, homework assignments are also used for performance assessment and, therefore, the material that is turned in must represent the student's own understanding of the material.\n\nTeam Design Project\n\nStudents will participate in an integrative team design project concerning the analysis of a structural component of an aircraft or aerospace system. There will be a final written report and presentation of the Final Design. Students will work on this project in teams of three.\n\nExams\n\nThere will be two exams in this course:\n\nA midterm exam two days before Lecture 19 during lecture time. This exam will last one hour.\n\nA final exam on the date, time and location assigned by the Institute.\n\nBoth exams will have an \"open book\" policy. There are no restrictions in the material students may bring to the exams.\n\nAssessment of student performance\n\nGrades will be assigned according to the following scheme:\n\nACTIVITIES\n\nPERCENTAGES\n\nAssignments Including Team Project\n\n40%\n\nMidterm Exam\n\n25%\n\nFinal Exam\n\n30%\n\nParticipation\n\n5%\n\nStudents are strongly encouraged to discuss homework problems with each other, since this is expected to help the learning process. However, homework assignments are also used for performance assessment and, therefore, the material that is turned in must represent the student's own understanding of the material.\n\nEach student's total grade on the project reports will be based on a team grade and on an individual grade. The team grade will be 20% of the project report grade and will be based on the quality of the report as a whole. The individual grade will be 80% of the project report grade and will be based on the individual student's contribution to the team effort. The instructors will assess individual contributions to the team project through their interactions with the teams throughout the semester.\n\nThe final letter grades will be assigned according to the\nRules and Regulations of the Faculty\n.",
  "files": [
    {
      "category": "Resource",
      "title": "term_proj_slides.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-21-techniques-for-structural-analysis-and-design-spring-2005/eeea2d2b4fef816687a738125f8960ac_term_proj_slides.pdf",
      "content": "Mars Exploration Rover\nMER Parachute\n\nDecelerator\n\nSystem\n\nProgram Objectives\nMars Exploration Rover\n- MER Parachute Deceleration Subsystem (PDS) is to\ndeliver the landing vehicle, in the atmosphere of Mars, to\na point and flight condition where Rocket Assisted\nDescent and Airbag Impact Attenuation Systems can\ncomplete the descent to the surface\n- Resultant design should retain as much heritage as\npossible with previous Mars programs (MPF / MPL /\nMSP01 / Viking)\n\nOperational Sequence\nMars Exploration Rover\n2)\nl\n5)\n6)\n9)\nvelocity\n/\n1) Direct Entry from Hyperbolic Approach\nCruise Stage Separation: E- 15 minutes\n3) Atmospheric Entry: ~125 km a titude\n4) Parachute Deploy: ~10 km A.G.L., ~E+ 240 s\nHeatshield Jettison: 20 s after chute deploy\nBridle Descent: 20 s after heatshield jett., 10 s\nto complete\n7) Radar Acquisition of Ground: ~2.4 km A.G.L\n8) Airbag Inflate: ~4 s prior to retrorocket ignition\nRocket Ignition: ~160 meters A.G.L\n10) Bridle Cut: ~15 meters A.G.L, 0 m/s vertical\n11) First Contact w Ground: ~E+ 360 s\n\nGeneral Design Requirements\nMars Exploration Rover\n- Parachute Assembly\n- Decelerates the Entry Vehicle\nfrom supersonic flight\nconditions\n- Establishes stable vertical\ntrajectory to permit Heat\nShield jettison and Lander\ndeployment\n- Provides final descent\nvelocity and stability for\nRocket Assisted Descent and\nAirbag Impact Attenuation\nSystems\nTITLE\nDOCUMENT NO.\nMER PDS Performance TBD\nRequirements\nSpecification\nMER PDS Interface\nTBD\nControl Drawing\nMER PDS\nPD-420-1-139\nEnvironmental\n(preliminary)\nRequirements\n(Embedded in Perf.\nDocument\nSpec.)\nMER PDS Statement of TBD\nWork (SOW)\n\nGeneral Design Requirements\nMars Exploration Rover\n- Mortar Deployment Assembly\n- Interfaces with Backshell structure\n- Provides deceleration parachute structural attachment points\n- Packages and protects the Deceleration Parachute Assembly\n- Ejects the packed parachute from the stowed configuration\n- Accelerates parachute beyond the recirculating wake for controlled\nand reliable inflation\n\nDesign Requirements (Level 3)\nAssessment\nSame as MPF\nPDS shall ensure parachute deployment at a\n(S0\n≥ 178.48 m2 at Mach\nnumber 0.3 in the Martian atmosphere\n500 Pa and no greater than 830 Pa\nWithin Viking heritage\nPDS shall ensure parachute deployment at a\nmaximum Mach number of 2.23 and a\nminimum Mach number of 1.40.\nMars Exploration Rover\nRequirement\nPDS shall tolerate a maximum payload spin\nrate of 4 RPM during descent.\nViking, MPF, MSP01 limit 15 degrees\nmaximum Angle of attack of 10 degrees.\nBaseline: 140% MPF chute size,\n1.6 Viking Band under consideration\nPDS shall ensure that the nominal ref area\n) of the full open parachute with\nsuspended payload is\nDetermined as low risk (Workshop)\nEDL shall ensure that the parachute is\ndeployed at a dynamic pressure of at least\n\nDriving Level 4 Requirements\nMars Exploration Rover\nRequirement\nThe PDS shall meet the configuration and interface requirements specified in MICD drawing\nno. 10205261\nPeak inflation loads imparted to the BIP carried on one bridle leg shall not exceed 15,600 lbs.\nPeak mortar reaction loads imparted to the BIP shall not exceed 12.5 g' s.\nParachute packing density shall not exceed 47 lb/ft3\nParachute Decelerator System mass shall not exceed 28 kg\nThe PDS shall apply the factors of safety defined in [the ERD] to all metal components\nThe PDS shall apply a factor of safety of 1.5 to all textile components\nThe PDS shall apply a factor of safefy of 1.25 times the peak operating pressure at ambient\nfor proof pressure\nThe PDS shall apply a factor of safety of 1.5 times the peak operating pressure at ambient\nfor burst pressure.\nThe PDS shall be designed to function properly after 10 seconds of exposure to the static\nacceleration loads [defined in the ERD]\n\nDeployment Assembly\nMars Exploration Rover\n- Estimated MER Design Loads\n- Loads have increased because of increase in\nchute area and deployment conditions.\n- Preliminary Estimates:\n- Mortar Reaction Load: 17,000 lb\n(MPF = 11,000 lb)\n- Peak Inflation Load: 12,500 lb\n(MPF = 7,904 lb)\n(@ maximum dynamic pressure condition of 783 Pa,\nM = 1.9, 825 kg entry vehicle)\n\nDeployment Assembly\nMars Exploration Rover\n- Mortar System - Introduction\n- Design Heritage\n- Mars Explorer Rover (MER) Mortar\nDeployer Subsystem (MDS) design will be\nbased on the successful Mars Pathfinder\nMortar Deployer System (MDS) developed\nby General Dynamics (formerly\nPrimex/Olin) as part of the Pioneer\nAerospace team\n- Major Requirements Summary\n- 100 ft/s < muzzle exit velocity < 130 ft/s\n(Mars)\n- Dual initiators for gas generator\n- Operational temperature range: -35C + 10C\n- Ejection mass of 34.5 lbm (37 lbm max)\n- Max parachute opening load 15,000 lbf\n\nDeployment Assembly\nMars Exploration Rover\n- Mortar System - Introduction (cont'd)\n- Principal Similarities - Pathfinder vs. MER\n- Same propellant, initiators and design approach\n- Very similar parachute deployment velocity\n- Development, LAT and qualification approach\n- Principal Differences - Pathfinder vs. MER\n- Deployment mass (34.5 lbm vs. 21.5 lbm)\n- Parachute volume (1620 in.3 vs. 953 in3)\n- Larger parachute inflation load (15,000 lbf vs. 12,000 lbf - MSP01)\n\nDeployment Assembly\nBridle\nBag\nMortar cover\nNot shown\nNSI\nMars Pathfinder PDS Shown\nMars Exploration Rover\nDeployment\ngas generator\n2.5 \" diam. increase from MPF\nfor 40% area growth\n\nMars Exploration Rover\nDeployment Assembly\n- MER Mortar Deployer Subsystem ICD\nIN WORK 01-03-27 <FOR REF ONL\nY>\n\nDeployment Assembly\nMars Exploration Rover\n- GD will actively identify, prioritize and manage risk to ensure\ndevelopment and qualification are successful.\n- Potential risk items:\nItem\nSeverity\nProbability\nDesign does not scale\nReduced development cycle time\nRequirements are not well defined or\nunderstood or continue to change\nMedium\nLow\nLow\nHigh\nLow-High\nLow\n- Risk Mitigation Plan\n- Issue: Design Does Not Scale\n- Approach - early system level demonstration to correlate proven performance\nmodels\n- Issue: Reduced Development Cycle Time\n- Approach - develop program plan as soon as possible\n- Issue: Requirements Uncertainty\n- Approach - formalize spec and ICD as soon as possible\n\nDeployment Assembly\nMars Exploration Rover\n- Mortar Subsystem - Design\n- Mortar System\n- OD increase from 8.4\" to 10.9\" (nominal)\n- Gas Generator\n- 12 grams of WC230 (same as previous)\n- Design change to improve manufacturability\n(Proposed)\n(Proposed)\nproposed - exterior cap configuration to improve\naccess for burst shim braze\n- 2 Each NSI (CFE)\n- Cover\n- Same design approach\n- Mortar Tube\n- Same design approach\n- Will interface with Backshell Interface Plate\n(changes identified)\n- Structural evaluation will result in increased\n(Proposed)\nload/pressure capability for some features\n\nDeployment Assembly\nMars Exploration Rover\nGas Generator\nMortar Tube\nSabot\nCover\nMPF shown\n\nDeployment Assembly\n-\nMars Exploration Rover\nMortar Subsystem - Materials and Processes List (MPF shown)\nExpect M&P to be very similar for MER\n\nDeployment Assembly\nMars Exploration Rover\n- Mortar Subsystem\n- Earth/Mars Performance\n- Deployment subsystem performance\nwill be different in Earth and Mars\nenvironments\n- Primary performance effects due to\n-\nAtmospheric backpressure (1 atm vs. 0.03 atm)\n- Work delta = 2.94 kj (2169 ft-lbs)\n-\nEarth environment system performance\nreduction offset by system operating\ncharacteristics\n-\nBackpressure results in higher pressure under\nsabot\n-\nPresence of air behind sabot causes higher tube\ndelta p\n\nDeployment Assembly\nMars Exploration Rover\n- Mortar Subsystem\n- System Performance\n- Initial sizing analysis conducted\n- Structural Analysis\n- Loads of similar magnitude\n- FEA to be conducted when authorized\n- Reliability Analysis/Hazard Analysis\n- Expected to be similar to Pathfinder\n- To be conducted when authorized\n\nDeployment Assembly\nMars Exploration Rover\n- Mortar Subsystem\n-\nperformance\n- Anticipated mortar tube\npressure\n- Anticipated reaction load\nmeet requirements\ngas generator\nLoads and velocity expected to\nAnticipated\n\nMass Properties\nMars Exploration Rover\n- Parachute Assembly Mass Properties\n- Current Best Estimates, requirement ≤28 kg\nComponent\nWeight (lb)\nWeight (kg)\nPARACHUTE ASSY\n34.5\n15.6\nDisk\n8.23\n3.73\nBand\n10.51\n4.77\nTape\n3.44\n1.56\nThread\n1.33\n0.60\nSusp Lines\n8.44\n3.83\nRiser\n0.74\n0.34\nBridle\n0.62\n0.28\nBag\n0.19\n0.09\nMisc Hardware\n0.56\n0.25\nSabot Bag\n0.40\n0.18\nDEPLOYMENT ASSY\nMortar\n24.2\nTOTAL\n58.7\n26.6\n\nDevelopment Testing - Aerial\nMars Exploration Rover\n- Phase 2: Aerial Testing:\n- Divided into 3 parts, conducted\nafter design \"quantified\"\n- Part 1 Rate of Descent/Stability\nTesting\n- Part 2 Structural Testing 1& 2\n\nDeployment Assembly Testing\nMars Exploration Rover\nTest Matrix\nz 8 Tests\n- Mortar Development Tests\nIgnition/Mass\nFlowrate Tests\nz Closed Bomb Tests\nz\nAmbient\nC)\nC)\nAmbient\nBaseline Tests\nCartridge\nClosed\nBombTests\nEnvironmental\nExposure\nPerformance\nTests\nFlight\nConfiguration\nDemonstration\nTests\nCartridge\nEnvironmental\nExposure\nEngineering\nModels to PAC\nHigh (+20\nTemp\nTests\nLow (-65\nTemperature\nTests\nFabricate\nFlight\nConfiguration\nTest Units\nz\nLow Temp\n- Ignition/mass flowrate\nz 3 Tests\nz Correlate/Verify Performance Model\n- Ambient baseline tests\nz Achieve Ambient Performance\nz Workhorse Mortar\n- Low temperature tests\nRequirements\nz\n5 Tests Total\nz 1 Test with Dual NSI Initiators\n- High temperature tests\nz\nVerify Low Temp\nz 4 Tests with underloaded NSIs\n- Environmental exposure\nPerformance\n(ignition margin tests)\nperformance tests\nz 2 Tests\nz Verify Max. Press. and Reaction Load\n- Cartridge environmental\nexposure tests\nz 2 EM units\n- Flight configuration\nz JPL LCA\ndemonstration tests\n- Cartridge closed bomb tests\n-\nFunctional Tests\nMPF temperatures listed,\n- Flight Conf. Mortar\n- 6 Flight Config.\n9 Tests\n- 3 + 20 C\nand GG\nCartridges\n- 3 -65 C\n- 6 Tests\n- Vib\n- 3 +22 C\n- 6 - 65 C\nMER to be verified\n-3 +20 C\n- Shock\n-\nHydropressure\n- 3 @ 100% NSIs\n-3 -65 C\n- Temp/Humidity\n- 3 @ 65% NSIs\n\nDeployment Assembly Testing\nMars Exploration Rover\n-\nGas Generator Level Test Setup\n- Baseline GG performance\n- Test used to determine effects of\nEnvironment on GG performance\n- Establish baseline for LAT\n-\nMortar Level Test Setup\n- Correlate GG performance to system level\n- Validate performance models\nMPF shown\n\nDeployment Assembly Testing\nMars Exploration Rover\nVibration/Shock\nParachute opening load\nvalidated in static tensile test\nHydroburst\nMPF shown"
    },
    {
      "category": "Resource",
      "title": "term_project.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-21-techniques-for-structural-analysis-and-design-spring-2005/5bd7d4f11556a3d58fcb0dc17bb24978_term_project.pdf",
      "content": "16.21 - Spring 2005\nDesign Project:\nImproved Mortar Deployment Assembly\nof the Parachute Deceleration System for\nfuture planet exploration missions\nHanded out: 4/4/05\nDue: 5/5/5\nM\nER\nParachute\nDecelerator\n-\nSystem\n-\n-\n-\n-\n-\nBackground\nNASA's twin robot geologists, Spirit and Opportunity, the Mars Exploration Rovers, arrived in\nMars on January 3 and January 24, 2004, respectively. The Mars Exploration Rover mission is\n16.21\n\n16.21 - Spring 2005\npart of NASA's Mars Exploration Program, a long-term effort of robotic exploration of the red\nplanet (For more information, see the Mission's web site: http://mars.jpl.nasa.gov/\nmer/overview/).\nIn this and upcoming planet exploration missions, usually a Parachute Deceleration Subsystem\n(PDS) delivers the landing vehicle in the planet atmosphere, to a point and flight condition\nwhere Rocket Assisted Descent and Airbag Impact Attenuation Systems can complete the\ndescent to the surface, as shown in the Operational Sequence Figure.\n16.21\n\n16.21 - Spring 2005\nE- 15 minutes\nl\n20 s after heatshield jett., 10 s to\ncomplete\n7)\n10) Bridle Cut:\n)\n/\n1) Direct Entry from Hyperbolic Approach\n2) Cruise Stage Separation:\n3) Atmospheric Entry: ~125 km altitude\n4) Parachute Deploy: ~10 km A.G.L., ~E+ 240 s\n5) Heatshield Jettison: 20 s after chute dep oy\n6) Bridle Descent:\nRadar Acquisition of Ground: ~2.4 km A.G.L\n8) Airbag Inflate: ~4 s prior to retrorocket ignition\n9) Rocket Ignition: ~160 meters A.G.L\n~15 meters A.G.L, 0 m/s vertical\nvelocity\n11 First Contact w Ground: ~E+ 360 s\nOperational Sequence\nThe Parachute Deceleration System consists of two main subsystems: the Parachute Assembly\nand the Mortar Deployment Assembly. The Parachute Assembly's role is to:\n● Decelerate the Entry Vehicle from supersonic flight conditions\n● Establish stable vertical trajectory to permit Heat Shield jettison and Lander deployment\n● Provide final descent velocity and stability for Rocket Assisted Descent and Airbag Impact\nAttenuation Systems\nThe Mortar Deployment Assembly:\n●\nInterfaces with Backshell structure\n●\nProvides deceleration parachute structural attachment points\n●\nPackages and protects the Deceleration Parachute Assembly\n●\nEjects the packed parachute from the stowed configuration\n●\nAccelerates parachute beyond the recirculating wake for controlled and reliable inflation\n16.21\n\n16.21 - Spring 2005\n-\nParts of the Aeroshell\nThe current design used in the MER Entry, Descent and Landing system, is based on the Mars\nPathfinder and Viking Mission. Notwithstanding its success, it is accepted that future exploration\nmissions will demand optimized designs in terms of weight and overall performance.\n-\nStatement and objectives\nThe main goal of this project is to design a Mortar Deployment Assembly with a reduced weight\nassuming the design requirements of the MER mission in terms of function, loads and overall\nmission conditions. A summary of the main requirements is given below. Additional details are\ngiven in the accompanying slides.\nMaterial information:\nThe materials can be initially assumed as in the base design (MER) and modified as necessary to\nachieve design goals.\nGeometrical information:\nThe geometry can be initially assumed as in the base design (MER) and modified as necessary to\nachieve design goals.\n16.21\n\n16.21 - Spring 2005\nLoad Information\nEstimated MER Design Loads\nLoads have increased because of increase in chute area and deployment conditions.\nPreliminary Estimates:\nMortar Reaction Load: 17,000 lb\n(MPF = 11,000 lb)\nPeak Inflation Load: 12,500 lb\n(MPF = 7,904 lb)\n(@ maximum dynamic pressure condition of 783 Pa,\nM = 1.9, 825 kg entry vehicle)\nPreliminary Design Criteria\nThe new design of the mortar subsystem should satisfy or exceed the criteria in the MER design\nwith a reduced weight. The design goal will be achieved by modifications to the geometry of the\nassembly or by a judicious choice of materials:\nMortar System -\nDesign Heritage\nMars Explorer Rover (MER) Mortar\nDeployer Subsystem (MDS) design will be based on the successful Mars\nPathfinder Mortar Deployer System (MDS) developed by General Dynamics\n(formerly Primex/Olin) as part of the Pioneer Aerospace team\nMajor Requirements Summary\n100 ft/s < muzzle exit velocity < 130 ft/s (Mars)\nDual initiators for gas generator\nOperational temperature range: -35C + 10C\nEjection mass of 34.5 lbm (37 lbm max)\nMax parachute opening load 15,000 lbf\nPrincipal Similarities - Pathfinder vs. MER\nSame propellant, initiators and design approach\nVery similar parachute deployment velocity\nDevelopment, LAT and qualification approach\nPrincipal Differences - Pathfinder vs. MER\nDeployment mass (34.5 lbm vs. 21.5 lbm)\nParachute volume (1620 in.3 vs. 953 in3 )\nLarger parachute inflation load (15,000 lbf vs. 12,000 lbf - MSP01)\n16.21\n\n16.21 - Spring 2005\nMortar System Design in MER compared to MPF:\nOD increase from 8.4\" to 10.9\" (nominal)\nGas Generator\n12 grams of WC230 (same as previous)\nDesign change to improve manufacturability proposed - exterior cap configuration\nto improve access for burst shim braze\n2 Each NSI (CFE)\nCover\nSame design approach\nMortar Tube\nSame design approach\nWill interface with Backshell Interface Plate (changes identified)\nStructural evaluation will result in increased load/pressure capability for some\nfeatures\nThe Job\nBridl\nBag\nMortar\ncover\ngas\nNSI\nMars Pathfinder PDS\n2.5 \" diam. increase\nfrom MPF for 40% area\nYour team's job is to provide the complete specifications of your proposed design for the Mortar\nDeployment Assembly configuration, including all the dimensions of the geometry of the mortar\nDeployment\nth\n16.21\n\n16.21 - Spring 2005\ntube, cover, joint solution proposed (rivets, bolts), materials used and the weight and cost of the\nresulting structure.\nThe structural analysis will be carried out using commercial finite element software. The\nassumptions and limitations of the analysis should accompany the report.\nPresent your results in an engineering report (please, double-space to make commenting and\ncorrecting easier) containing the following items:\nExecutive summary\nProblem statement\nMethodology, assumptions\nResults and conclusions:\nGeometry\nMaterial selection\nRecommendations for manufacturing\nDetails of the finite element analysis including discretization, element type, compute meshes,\nmaterial models and properties, analysis type, etc should be provided in an appendix. Note the\nappendix constitutes a significant part of the report where you will show your skills using the\nfinite element method for conducting structural analysis.\n16.21"
    },
    {
      "category": "Resource",
      "title": "assn1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-21-techniques-for-structural-analysis-and-design-spring-2005/9a5053c659daf7c4fedcad261f5a0a66_assn1.pdf",
      "content": "16.21 Techniques of structural analysis and\ndesign\nHomework assignment # 1\nHanded out: 2/09/05\nDue: 2/16/05\nFebruary 10, 2005\nOnly problems 2, 3 and 4 are part of the assessment (contribute to the grade).\nIt is recommended that the assignment be done in Mathematica in its entirety\nand turned in electronically on the MIT Server.\n1. Mathematica practice problems. Write a Mathematica notebook\ncontaining the following items:\n(a) A header in a text cell containing the Homework assignment num\nber and your name. If possible try to use a Style Sheet of your\nchoice in your Mathematica notebooks from now on.\n(b) (Not for grade) Multiplication of a 3 × 3 matrix by a 3 × 1 vector.\nChoose arbitrary symbols (not numerical values) as matrix and\nvector coefficients. Repeat for coefficients with arbitrary numeric\nvalues. Repeat one more time for the case of a 5× 5 matrix A and\na 5 × 1 vector v whose coefficients satisfy the following functional\ndependence on the row (i) and column (j) number:\nAij = i + j; vi = i(i + 1)\n(c) Verification of candidate solutions of a differential equation by\ndirect differentiation. Given the differential equation governing\n\nthe elastic deflections of a beam due to a sinusoidal load:\nd4w\nπx\nEI\n+ q0 sin\n= 0, 0 < x < L\ndx4\nL\nEvaluate if any of the following candidate functional forms pro\nvides a solution to this problem and, in that case, find the value\nof the constant(s). What boundary conditions are implied in the\nproposed solution?\ni. w(x) = A + Bx + Cx2 + Dx3\nii. w(x) = A sin πx\nL\niii. w(x) = A cos πx + B sin πx\nL\nL\n2. Verification of that at equilibrium potential energy is a mini\nmum in beam problem :\nx\nL\nq0\nz\nUse mathematica to evaluate the potential energy of the beam in\nthe figure for the following two functions in terms of their respective\nparameters (a and (a, b, c), respectively). (Use the expression of the\npotential energy given in class):\n1)\nw1(x) = a q0L4\nEI\nx\nL\n\n1 - x\nL\n\n2)\nw3(x) = q0L4\nEI\n\"\na x\nL\n\n1 - x\nL\n\n+ b x\nL\n\n1 - x\nL\n+ c x\nL\n\n1 - x\nL\n#\n\nFor each function, plot the potential energy vs. the value of a for a\nrange a ∈ [-amin, 3amin], where amin is the value of a corresponding\nto the minimum potential energy given in class. Note: for the second\nfunction make b = bmin and c = cmin. Draw your conclusions about\nthe behavior of the potential energy as a function of a for each case.\n(Extra: Superimpose the plots and draw your own conclusions by\ncomparing them).\n3. Energy approach applied to a spring system problem .\nP2\nka\nu2\nP3\nP1\nu3\nu1\nkb\nkc\nke\nkd\nFind the displacements u1, u2, u3 of the nodes of the spring system in\nthe figure in terms of the given applied nodal loads P1, P2, P3. Use two\ndifferent methods:\n(a) Vector approach as learned in Unified Engineering (Hint: Apply\n\"three great principles and label the internal forces in the springs\nas Fa, Fb, Fc, Fd, Fe\"). If you find this part too hard to be done in\nMathematica, you can turn it in on paper.\n(b) Energy method: Compute the elastic energy of each spring in\nterms of the displacements u1, u2, u3, add up all the contributions\nto form the total \"strain energy\" of the system U. Compute the\nwork done by each external force P1, P2, P3 on these displacements,\nadd up all the contributions to form the total external work W.\nForm the total potential energy of the system as the difference\nbetween the \"strain energy\" and the work of the external forces:\nΠ = U - W. Determine the equations of equilibrium and the\nsolution by finding the stationary points of the total potential\nenergy with respect to the displacements u1, u2, u3. Comment on\nthe advantages and disadvantages of this approach.\n\n(c) Specialize the solution to the following two cases and provide your\nown interpretation of the results in both cases:\ni. ka = kb = kc = kd = ke = K, P1 = P2 = 0, P3 = P\nii. ka = kb = kc = kd = ke = K, P2 = P3 = 0, P1 = P\n4. Problem 3.15 from textbook. This problem can also be done on paper\nif you are not comfortable using Mathematica yet."
    },
    {
      "category": "Resource",
      "title": "assn2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-21-techniques-for-structural-analysis-and-design-spring-2005/aac5387b28c666d171af6130dee321a1_assn2.pdf",
      "content": "16.21 Techniques of structural analysis and\ndesign\nHomework assignment # 2\nHanded out: 2/18/05\nDue: 2/25/05\nFebruary 17, 2005\n1. Determine whether the following stress fields are possible in a structural\nmember free of body forces:\n(a) (not for grade)\nσ11 = -3x1 + 6x2\n(1)\nσ12 = 4x1 + 3x2\n(2)\nσ22 = 5x1 + 4x2\n(3)\n(b)\nσ11 = c1x1 + c2x2 + c3x1x2 + c4x1\n(4)\nx2 - c1x2 - c4x2\n(5)\nσ12 = - c\nσ22 = c4x1 + c1x2\n(6)\n\n(c)\nσ11 = 2x 2\n1 - 2x1x2 + 6x3\nσ12 = -x1x2 + x 2\n(7)\n(8)\nσ13 = x1x3\n(9)\nσ22 = -3x 2\n(10)\nσ23 = -5x2x3\n(11)\nσ33 = 2(x1 - 2x2)x3\n(12)\n2. Given the following state of stress, determine the body forces for which\nthe stress field describes a state of equilibrium:\nσ11 = -4x1\n(13)\nσ12 = x1 + x 2 + 2x1x2\n(14)\nσ13 = -4x1 + 2x2 - 7x3\n(15)\nσ22 = 3x2 - 2x3\n(16)\nσ23 = 4x1x2x3\n(17)\nσ33 = (2x1 - 3x2)x3\n(18)\n3. For the cantilever beam loaded with a point load at the free end (see\nfigure), the bending moment M3 about the x3axis is given by M3 =\n-F0x1. The bending stress σ11 is given by:\nM3x2\nσ11 =\nI3\nwhere I3 is the moment of inertia of the cross section about the x3axis.\nUse the twodimensional equilibrium equations in differential form to\ndetermine the stress fields: σ22 and σ12.\n\n4. For the state of stress of question 3, determine the stress vector and\nits normal and shear components at the point (L, h, 0) on the plane of\nnormal:\n(a) (1, 0, 0)\n(b)\n√1\n3(1, 1, -1)\nDetermine the principal stresses and principal directions of stress at\nthis point."
    },
    {
      "category": "Resource",
      "title": "final.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-21-techniques-for-structural-analysis-and-design-spring-2005/5cfe773979da5d35e68f07c8cf3c1eda_final.pdf",
      "content": "16.21 Techniques of structural analysis and\ndesign\nSpring 2005\nFinal Exam\nInstructors: Ra ul Radovitzky\nMay 17, 2005\nStudent's name:\nQuestion\nGrade\n1) 30 points\n2) 30 points\n3) 30 points\n4) 10 points\nTotal:\n\nStudent's name:\nPage 2 of 9\nL\nω\nx\nA = A\n[ 1 - x / (2 L) ]\nDensity:ρ\nThe structure of the figure is made of an elastic material with Young's Modulus E, and mass\ndensity ρ and rotates at an angular velocity ω. (Questions start on the next page)\n16.21, Spring 2005\nPlease go on to the next page. . .\nFinal Exam\n\nStudent's name:\nPage 3 of 9\n1. (30 points) Compute an approximate value of the radial displacement at x = L. Use an\napproximate method of your choice. Discuss the reason of your choice of method and\nyour additional assumptions, if any.\n16.21, Spring 2005\nPlease go on to the next page. . .\nFinal Exam\n\nStudent's name:\nPage 4 of 9\n16.21, Spring 2005\nPlease go on to the next page. . .\nFinal Exam\n\nStudent's name:\nPage 5 of 9\n2. (30 points) Show how you can use an energy method to compute the exact value of the\nradial displacement at x = L. You do not have to (but are welcome to) evaluate the\nfinal expression, if it is too complex to do by hand.\n16.21, Spring 2005\nPlease go on to the next page. . .\nFinal Exam\n\nStudent's name:\nPage 6 of 9\n16.21, Spring 2005\nPlease go on to the next page. . .\nFinal Exam\n\nStudent's name:\nPage 7 of 9\n3. (30 points) From the approximate solution compute an approximation of the stress at\nthe rotating axis (x = 0) and compare with the exact solution. Why can you compute\nthe exact solution in this case without much effort?\n16.21, Spring 2005\nPlease go on to the next page. . .\nFinal Exam\n\nStudent's name:\nPage 8 of 9\n16.21, Spring 2005\nPlease go on to the next page. . .\nFinal Exam\n\nStudent's name:\nPage 9 of 9\n4. (10 points) What is the maximum angular velocity attainable before the material starts\nto deform plastically if the structure has a length L = 2m and is made of an Aluminum\nwith mass density ρ = 2700Kg and yield stress σ0 = 200MPa.\nm\n16.21, Spring 2005\nEnd of Final Exam\nFinal Exam"
    },
    {
      "category": "Resource",
      "title": "lastrec_prac_sol.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-21-techniques-for-structural-analysis-and-design-spring-2005/de4ece47f6384f7978a681b8bc42ced9_lastrec_prac_sol.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "lastrec_problems.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-21-techniques-for-structural-analysis-and-design-spring-2005/9ca5b8b09565807af29efcbf3e42b66f_lastrec_problems.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "unit1_notes.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-21-techniques-for-structural-analysis-and-design-spring-2005/fac675846b0eea0980ca4a7bfc4754bf_unit1_notes.pdf",
      "content": "X\n16.21 Techniques of Structural Analysis and\nDesign\nSpring 2005\nUnit #1\nRa ul Radovitzky\nFebruary 2, 2005\nIn this course we are going to focus on energy and variational methods\nfor structural analysis. To understand the overall approach we start by con\ntrasting it with the alternative vector mechanics approach:\nExample of Vector mechanics formulation:\nConsider a simply supported beam subjected to a uniformlydistributed load\nq0, (see Fig.1). To analyze the equilibrium of the beam we consider the free\nbody diagram of an element of length Δx as shown in the figure and apply\nNewton's second law:\nFy = 0 : V - q0Δx - (V + ΔV ) = 0\n(1)\nX\nΔx\nMB = 0 : -V Δx - M + (M + ΔM) + (q0Δx)\n= 0\n(2)\nDividing by Δx and taking the limit Δx\n0:\n→\ndV =\n(3)\ndx\n-q0\ndM = V\n(4)\ndx\n\nx\nL\nq0\nz\nx\ndx\nM+dM\nM\nV\nV+dV\nq0\nA\nB\nA\nB\nFigure 1: Equilibrium of a simply supported beam\nEliminating V , we obtain:\nd2M + q0 = 0\n(5)\ndx2\nRecall from Unified Engineering or 16.20 (we'll cover this later in the\ncourse also) that the bending moment is related to the deflection of the\nbeam w(x) by the equation:\nd2w\nM = EI\n(6)\ndx2\nwhere E is the Young's modulus and I is the moment of inertia of the beam.\nCombining 5 and 6, we obtain:\nd2\nd2w\nEI\n+ q0 = 0, 0 < x < L\n(7)\ndx2\ndx2\nThe boundary conditions of the beam are:\nw(0) = w(L) = 0, M(0) = M(L) = 0\n(8)\nThe solution of equations 7 and 8 is given by:\nw(x) =\nq0\nx (L - x)\n\nL2 + Lx - x 2\n(9)\n- 24EI\n\n#\nCorresponding variational formulation\nThe same problem can be formulated in variational form by introducing the\npotential energy of the beam system:\nZ L \"\n\nEI\nd2w\nΠ(w) =\n+ q0w dx\n(10)\ndx2\nand requiring that the solution w(x) be the function minimizing it that also\nsatisfies the displacement boundary conditions:\nw(0) = w(L) = 0\n(11)\nA particularly attractive use of the variational formulation lies in the\ndetermination of approximate solutions. Let's seek an approximate solution\nto the previous beam example of the form:\nw1(x) = c1x(L - x)\n(12)\nwhich has a continuous second derivative and satisfies the boundary condi\ntions 11. Substituting w1(x) in 10 we obtain:\nZ L \"\n#\nΠ(c1) =\nEI (-2c1)2 + q0c1(Lx - x 2) dx\n(13)\nL3\n= 2EILc2\n1 +\nq0c1\nNote that our functional Π now depends on c1 only.\nw1(x) is an ap\nproximate solution to our problem if c1 minimizes Π = Π(c1). A necessary\ncondition for this is:\ndΠ\nL3\n= 4EILc1 + q0\n= 0\ndc1\n- q0L2\nor c1 =\n24EI , and the approximate solution becomes:\nq0L2\nw1(x) =\nx(L - x)\n- 24EI\nIn order to assess the accuracy of our approximate solution, let's compute\nthe approximate deflection of the beam at the midpoint δ1 = w1(L\n2 ):\nq0L2 L2\nq0L4\nδ =\n=\n- 24EI\n- 96EI\n\nThe exact value δ = w(L\n2 ) is obtained from eqn.9 as:\nq0\nL\nL - L h\nL2\nL\nL2i\n5 q0L4\nδ =\n+ L\n=\n- 24EI 2\n2 - 2\n- 384 EI\nWe observe that:\nδ1\n=\n=\n= 0.8\nδ\ni.e. the approximate solution underpredicts the maximum deflection by 20%.\nHowever, if we consider the following approximation with 3 degrees of\nfreedom (note it also satisfies the essential boundary conditions, eqn.11):\nw3(x) = c1x(L - x) + c2x 2(L - x) + c3x (L - x)\n(14)\nand require that Π(c1, c2, c3) be a minimum:\n∂Π\n∂Π\n∂Π\n= 0,\n= 0,\n= 0,\n∂c1\n∂c2\n∂c3\ni.e.:\nL3 q0\n4 c1 EI L + 2 c2 EI L2 + 2 c3 EI L3 +\n= 0\nL4 q0\n2 c1 EI L2 + 4 c2 EI L3 + 4 c3 EI L4 +\n= 0\n24 c3 EI L5\nL5 q0\n2 c1 EI L3 + 4 c2 EI L4 +\n+\n= 0\nwhose solution is:\n- (L2 q0)\n- (L q0)\nq0\nc1\n, c2\n, c3\n→\n24 EI\n→ 24 EI\n→ 24 EI\nIf you replace this values in eqn. 14 and evaluate the deflection at the\nmidpoint of the beam you obtain the exact solution !!!"
    },
    {
      "category": "Resource",
      "title": "unit2_math_aside.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-21-techniques-for-structural-analysis-and-design-spring-2005/9c108fc07d748e15b4702250bd84f53a_unit2_math_aside.pdf",
      "content": "16.21 Techniques of Structural Analysis and\nDesign\nSpring 2005\nUnit #2 Mathematical aside: Vectors,\nindicial notation and summation convention\nRa ul Radovitzky\nFebruary 6, 2005\nIndicial notation\nIn 16.21 we'll work in a an euclidean threedimensional space R3 .\nFree index: A subscript index ()i will be denoted a free index if it is\nnot repeated in the same additive term where the index appears. Free means\nthat the index represents all the values in its range.\n- Latin indices will range from 1 to, (i, j, k, ... = 1, 2, 3),\n- greek indices will range from 1 to 2, (α, β, γ, ... = 1, 2).\nExamples:\n1. ai1 implies a11, a21, a31. (one free index)\n2. xαyβ implies x1y1, x1y2, x2y1, x2y2 (two free indices).\n3. aij implies a11, a12, a13, a21, a22, a23, a31, a32, a33 (two free indices implies\n9 values).\n4.\n∂σij + bi = 0\n∂xj\n\nX\nhas a free index (i), therefore it represents three equations:\n∂σ1j + b1 = 0\n∂xj\n∂σ2j + b2 = 0\n∂xj\n∂σ3j + b3 = 0\n∂xj\nSummation convention: When a repeated index is found in an expression\n(inside an additive term) the summation of the terms ranging all the possible\nvalues of the indices is implied, i.e.:\naibi =\naibi = a1b1 + a2b2 + a3b3\ni=1\nNote that the choice of index is immaterial:\naibi = akbk\nExamples:\n1. aii = a11 + a22 + a33\n2. ti = σijnj implies the three equations (why?):\nt1 = σ11n1 + σ12n2 + σ13n3\nt2 = σ21n1 + σ22n2 + σ23n3\nt3 = σ31n1 + σ32n2 + σ33n3\nOther important rules about indicial notation:\n1. An index cannot appear more than twice in a single additive term, it's\neither free or repeated only once.\nai = bijcjdj is INCORRECT\n2. In an equation the lhs and rhs, as well as all the terms on both sides\nmust have the same free indices\n- aibk = cijdkj free indices i, k, CORRECT\n- aibk = cijdkj +eifjj +gkpiqr INCORRECT, second term is missing\nfree index k and third term has extra free index r\n\n(\nVectors\nA basis in R3 is given by any set of linearly independent vectors ei, (e1, e2, e3).\nFrom now on, we will assume that these basis vectors are orthonormal, i.e.,\nthey have a unit length and they are orthogonal with respect to each other.\nThis can be expressed using dot products:\ne1.e1 = 1, e2.e2 = 1, e3.e3 = 1,\ne1.e2 = 0, e1.e3 = 0, e2.e3 = 0, ...\nUsing indicial notation we can write these expression in very succinct form\nas follows:\nei.ej = δij\nIn the last expression the symbol δij is defined as the Kronecker delta :\nif i = j,\nδij =\nif i = j\nExample:\naiδij =a1δ11 + a2δ21 + a3δ31,\na1δ12 + a2δ22 + a3δ32,\na1δ13 + a2δ23 + a3δ33\n=a11 + a20 + a30,\na10 + a21 + a30,\na10 + a20 + a3\n=a1,\na2,\na3\nor more succinctly: aiδij = aj , i.e., the Kronecker delta can be thought of\nan \"index replacer\".\nA vector v will be represented as:\nv = viei = v1e1 + v2e2 + v3e3\n\nThe vi are the components of v in the basis ei. These components are the\nprojections of the vector on the basis vectors:\nv = vjej\nTaking the dot product with basis vector ei:\nv.ei = vj(ej.ei) = vjδji = vi\nTransformation of basis\nGiven two bases ei, ek and a vector v whose components in each of these\nbases are vi and vk, respectively, we seek to express the components in basis\nin terms of the components in the other basis. Since the vector is unique:\n\nv = v mem = vnen\nTaking the dot product with ei:\nv.\nem.\nei)\nei = v m(\nei) = vn(en.\nBut\nem.\nvm(\nei) = v mδmi = v i from which we obtain:\nv i = v.\nei)\nei = vj(ej.\nNote that (ej. ei) are the direction cosines of the basis vectors of one basis\non the other basis:\nei =\neik cos ej ei\nej.\nkejkk\nd"
    },
    {
      "category": "Resource",
      "title": "unit2_notes.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-21-techniques-for-structural-analysis-and-design-spring-2005/466ce40eea21d45e1093edccbc9f276f_unit2_notes.pdf",
      "content": "16.21 Techniques of Structural Analysis and\nDesign\nSpring 2005\nUnit #2 Stress and Momentum balance\nRa ul Radovitzky\nFebruary 6, 2005\nStress at a point\nWe are going to consider the forces exerted on a material. These can be\nexternal or internal. External forces come in two flavors: body forces (given\nper unit mass or volume) and surface forces (given per unit area). If we cut a\nbody of material in equilibrium under a set of external forces along a plane,\nas shown in Fig.1, and consider one side of it, we draw two conclusions: 1)\nthe equilibrium provided by the loads from the side taken out is provided by\na set of forces that are distributed among the material particles adjacent to\nthe cut plane and that should provide an equivalent set of forces to the ones\nloading the part taken out, 2) these forces can now be considered as external\nsurface forces acting on the part of material under consideration.\nThe stress vector at a point on ΔS is defined as:\nf\nt = lim\n(1)\nΔS\n0 ΔS\n→\nIf the cut had gone through the same point under consideration but along a\nplane with a different normal, the stress vector t would have been different.\nLet's consider the three stress vectors t(i) acting on the planes normal to the\ncoordinate axes. Let's also decompose each t(i) in its three components in\nthe coordinate system ei (this can be done for any vector) as (see Fig.2):\nt(i) = σijej\n(2)\n\nZ\nZ\n∆s\nf\nsurface forces\nbody forces\nn\nbody forces\nn\nFigure 1: Surface force f on area ΔS of the cross section by plane whose\nnormal is n\nσij is the component of the stress vector t(i) along the ej direction.\nStress tensor\nWe could keep analyzing different planes passing through the point with\ndifferent normals and, therefore, different stress vectors t(n) and one might\nwonder if there is any relation among them or if they are all independent. The\nanswer to this question is given by invoking equilibrium on the (shrinking)\ntetrahedron of material of Fig.3. The area of the faces of the tetrahedron are\nΔS1, ΔS2, ΔS3 and ΔS. The stress vectors on planes with reversed normals\nt(-ei) have been replaced with -t(i) using Newton's third law of action\nand reaction (which is in fact derivable from equilibrium): t(-n) = -t(n).\nEnforcing equilibrium we have:\nt(n)ΔS - t(1)ΔS1 - t(2)ΔS2 - t(3)ΔS3 = 0\n(3)\nwhere ΔV is the volume of the tetrahedron and f is the body force per\nunit volume. The following relation: ΔSni = ΔSi derived in the following\nmathematical aside:\nBy virtue of Green's Theorem:\nrφdV =\nnφdS\nV\nS\n\nσ11\nσ12\nσ13\nσ21\nσ22\nσ23\nσ31\nσ32\nσ33\nt\nt\nt\n(1)\n(2)\n(3)\nx1\nx2\nx3\ne\ne\ne1\nFigure 2: Stress components\nt\n(3)\n-\nt\n(2)\n-\nt\n(1)\n-\n-e\n-e\n-e\nn\nt(n)\nFigure 3: Cauchy's tetrahedron representing the equilibrium of a tetrahedron\nshrinking to a point\n\nZ\n\napplied to the function φ = 1, we get\n0 =\nndS\nS\nwhich applied to our tetrahedron gives:\n0 = ΔSn - ΔS1e1 - ΔS2e2 - ΔS3e3\nIf we take the scalar product of this equation with ei, we obtain:\nΔS(n ei) = ΔSi\n·\nor\nΔSi = ΔSni\ncan then be replaced in equation 3 to obtain:\ne3)t(3)\nΔS t(n) - (n e1)t(1) + (n e2)t(2) + (n\n= 0\n·\n·\n·\nor\ne1t(1) + e2t(2) + e3t(3)\nt(n) = n\n(4)\n·\nThe factor in parenthesis is the definition of the Cauchy stress tensor σ:\ne1t(1) + e2t(2) + e3t(3) = eit(i)\nσ =\n(5)\nNote it is a tensorial expression (independent of the vector and tensor com\nponents in a particular coordinate system). To obtain the tensorial com\nponenents in our rectangular system we replace the expressions of t(i) from\nEqn.2\nσ = eiσijej\n(6)\nReplacing in Eqn.4:\nt(n) = n · σ\n(7)\nor:\nt(n) = n · σijeiej = σij\n\nn · ei\n\nej =\n\nσijni\n\nej\n(8)\ntj = σijni\n(9)\n\nq\n\nTransformation of stress components\nConsider a different system of cartesian coordinates e0\ni. We can express our\ntensor in either one:\nσ = σklekel = σ0\ne0 e0\n(10)\nmn\nm\nn\nWe would like to relate the stress components in the two systems. To this\nend, we take the scalar product of (10) with e0 and e0\nj:\ni\ne0\ni σ e0\nj = σkl e0\ni\nel\n= σ0\nmnδimδnj = σ0\nmn e0\ni em\ne0\ne0\nj\n= σ0\nij\nn ·\n·\n·\n· ek\n· e0\nj\n·\nor\nσ0\n(11)\nij = σkl e0\ni\nel\n· ek\n· e0\nj\nThe factors in parenthesis are the cosine directors of the angles between the\noriginal and primed coordinate axes.\nPrincipal stresses and directions\nGiven the components of the stress tensor in a given coordinate system, the\ndetermination of the maximum normal and shear stresses is critical for the\ndesign of structures. The normal and shear stress components on a plane\nwith normal n are given by:\ntN = t(n) n\n·\n= σkinkni\ntS =\nkt(n)k2 - t2\nN\nIt is obvious from these equations that the normal component achieves its\nmaximum tN = kt(n)k when the shear components are zero. In this case:\nt(n) = n σ = λn = λIn\n·\nor in components:\nσkink = λni\nσkink = λδkink\n(12)\nσki - λδki nk = 0\n\nZ\nZ\nwhich means that the principal stresses are obtained by solving the previous\neigenvalue problem, the principal directions are the eigenvectors of the prob\nlem. The eigenvalues λ are obtained by noticing that the last identity can be\nsatisfied for nontrivial n only if the factor is singular, i.e., if its determinant\nvanishes:\n= 0\nσ11 - λ\nσ12\nσ13\nσ21\nσ22 - λ\nσ23\nσ32\nσ31\nσ33 - λ\nwhich leads to the characteristic equation :\n-λ3 + I1λ2 - I2λ + I3 = 0\nwhere:\nI1 = σii = σ11 + σ22 + σ33\n(13)\nσ2\n12 + σ2\n23 + σ2\nI2 =\nσiiσjj - σijσji = σ11σ22 + σ22σ33 + σ33σ11 -\n(14)\nI3 = det[σ] = kσijk\n(15)\nare called the stress invariants because they do not depend on the coordinate\nsystem of choice.\nLinear and angular momentum balance\nWe are going to derive the equations of momentum balance in integral form,\nsince this is the formulation that is more aligned with our \"integral\" approach\nin this course. We start from the definition of linear and angular momentum.\nFor an element of material at position x of volume dV , density ρ, mass ρdV\nwhich remains constant, moving at a velocity v, the linear momentum is\nρvdV and the angular momentum x × (ρvdV ). The total momenta of the\nbody are obtained by integration over the volume as:\nρvdV and\nx × ρvdV\nV\nV\nrespectively. The principle of conservation of linear momentum states that\nthe rate of change of linear momentum is equal to the sum of all the external\nforces acting on the body:\nZ\nZ\nZ\nD\nDt\nV\nρvdV =\nV\nfdV +\nS\ntdS\n(16)\n\nZ\nZ\nZ\nZ\nZ\nZ\nZ\nZ\nZ\n!\nZ\nZ\nZ\nwhere\nD is the total derivative. The lhs can be expanded as:\nDt\nZ\nZ\nZ\nD\nD\n∂v\nDt\nV\nρvdV =\nV Dt(ρdV )v +\nV\nρ ∂t dV\nD\nbut Dt(ρdV ) = 0 from conservation of mass, so the principle reads:\n∂v\nρ\ndV =\nfdV +\ntdS\n(17)\n∂t\nV\nV\nS\nNow, using what we've learned about the tractions and their relation to the\nstress tensor:\n∂v\nρ\ndV =\nfdV +\nn σdS\n(18)\n∂t\nV\n·\nV\nS\nThis is the linear momentum balance equation in integral form.\nWe can\nreplace the surface integral with a volume integral with the aid of the diver\ngence theorem:\nn σdS =\nr · σdV\n·\nS\nV\nand then (18) becomes:\n∂v\nρ\ndV = 0\n∂t -f -r · σ\nV\nSince this principle applies to an arbitrary volume of material, the integrand\nmust vanish:\n∂v\nρ\n= 0\n(19)\n∂t -f -r · σ\nThis is the linear momentum balance equation in differential form. In com\nponents:\n∂vi\nσji,j + fi = ρ ∂t\nAngular momentum balance and the symmetry of the\nstress tensor\nThe principle of conservation of angular momentum states that the rate of\nchange of angular momentum is equal to the sum of the moment of all the\nexternal forces acting on the body:\nD\nρx × vdV =\nx × fdV +\nx × tdS\n(20)\nDt\nV\nV\nS\n\nZ\nZ\nZ\nZ\nIt can be conveniently written as\n\n∂vj\n∂vi\nxitj - xjti dS +\nxifj - xjfi dV =\nxi\ndV\n∂t - xj ∂t\nS\nV\nV\nUsing ti = σkink, the divergence theorem and (19), this expression leads to\n(see homework problem):\n(σij - σji)dV = 0\nV\nwhich applies to an arbitrary volume V , and therefore, can only be satisfied\nif the integrand vanishes. This implies:\n(21)\nσij = σji"
    },
    {
      "category": "Resource",
      "title": "unit3_notes.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-21-techniques-for-structural-analysis-and-design-spring-2005/645c1c7bd79423f7bdc280b03e128bb4_unit3_notes.pdf",
      "content": "16.21 Techniques of Structural Analysis and\nDesign\nSpring 2005\nUnit #3 Kinematics of deformation\nRa ul Radovitzky\nFebruary 9, 2005\nFigure 1: Kinematics of deformable bodies\nDeformation described by deformation mapping :\nx0 = φ(x) = x + u\n(1)\n\nWe seek to characterize the local state of deformation of the material in a\nneighborhood of a point P. Consider two points P and Q in the undeformed:\nP : x = x1e1 + x2e2 + x3e3 = xiei\n(2)\nQ : x + dx = (xi + dxi)ei\n(3)\nand deformed\nP 0 : x0 = φ1(x)e1 + φ2(x)e2 + φ3(x)e3 = φi(x)ei\n(4)\nQ0 : x0 + dx0 = φi(x) + dφi ei\n(5)\nconfigurations. In this expression,\ndx0 = dφiei\n(6)\nExpressing the differentials dφi in terms of the partial derivatives of the\nfunctions φi(xjej):\n∂φ1\n∂φ1\n∂φ1\ndφ1 =\ndx1 +\ndx2 +\ndx3,\n(7)\n∂x1\n∂x2\n∂x3\nand similarly for dφ2, dφ3, in index notation:\n∂φi\ndφi =\ndxj\n(8)\n∂xj\nReplacing in equation (5):\n∂φi\nQ0 : x0 + dx0 =\nφi +\ndxj ei\n(9)\n∂xj\n∂φi\ndx0\ni =\ndxjei\n(10)\n∂xj\nWe now try to compute the change in length of the segment -→\nPQ which\ndeformed into segment --→ . Undeformed length (to the square):\nP 0Q0\nds2 = kdxk = dx · dx = dxidxi\n(11)\n\n|\n{z\n}\n\nDeformed length (to the square):\n∂φi\n(ds0)2 = kdx0\n= dx0 dx0 = ∂φi dxj\ndxk\n(12)\nk\n·\n∂xj\n∂xk\nThe change in length of segment -→\nPQ is then given by the difference between\nequations (12) and (11):\n∂φi\n(ds0)2 - ds2 = ∂φi dxj\ndxk - dxidxi\n(13)\n∂xj\n∂xk\nWe want to extract as common factor the differentials. To this end we observe\nthat:\ndxidxi = dxjdxkδjk\n(14)\nThen:\n∂φi\n(ds0)2 - ds2 = ∂φi dxj\ndxk - dxjdxkδjk\n∂xj\n∂xk\n∂φi ∂φi\n=\n∂xj ∂xk\n- δjk\ndxjdxk\n(15)\n2jk: GreenLagrange strain tensor\nAssume that the deformation mapping φ(x) has the form:\nφ(x) = x + u\n(16)\nwhere u is the displacement field. Then,\n∂φi\n∂xi\n∂ui\n∂ui\n=\n+\n= δij +\n(17)\n∂xj\n∂xj\n∂xj\n∂xj\nand the GreenLagrange strain tensor becomes:\n∂um\n∂um\n2ij =\nδmi +\nδmj + ∂xj\n- δij\n∂xi\n(18)\n∂ui\n∂uj\n∂um ∂um\n= δij +\n+\n+ ∂xi ∂xj\n-6 δij\n∂xj\n∂xi\n\nGreenLagrange strain tensor :\n∂ui\n∂uj\n∂um ∂um\nij =\n+\n+\n2 ∂xj\n∂xi\n∂xi ∂xj\n(19)\nWhen the absolute values of the derivatives of the displacement field are\nmuch smaller than 1, their products (nonlinear part of the strain) are even\nsmaller and we'll neglect them. We will make this assumption throughout\nthis course (See accompanying Mathematica notebook evaluating the limits\nof this assumption). Mathematically:\n∂um ∂um\n(20)\n1 ⇒ ∂xi ∂xj\n∼ 0\n∂ui\n∂xj\nWe will define the linear part of the GreenLagrange strain tensor as the\nsmall strain tensor :\n∂ui\n∂uj\nij =\n+\n2 ∂xj\n∂xi\n(21)\nTransformation of strain components\nGiven: ij, ei and a new basis ek, determine the components of strain in the\nnew basis kl\nui\n∂\n∂\nuj\nij =\n+\n(22)\nxj\n∂\n2 ∂\nxi\nWe want to express the expressions with tilde on the righthand side with\ntheir nontilde counterparts. Start by applying the chain rule of differentia\ntion:\nui\n∂\n∂\nui ∂xk\n=\n(23)\nxj\n∂xk ∂\n∂\nxj\nTransform the displacement components:\nu =\numem = ulel\n(24)\n\nem ·\n\num(\nei) = ul(el · ei)\n(25)\numδmi = ul(el · ei)\n(26)\n\nui = ul(el · ei)\n(27)\n\nh\ni\nh\ni\ntake the derivative of ui with respect to xk, as required by equation (23):\n∂ ui\n∂ul\n\n=\n(el · ei)\n(28)\n∂xk\n∂xk\nand take the derivative of the reverse transformation of the components of\nthe position vector x:\nx = xjej = xk\nek\n(29)\nxj(ej\nei) = xk(\nei)\n(30)\n\nek ·\n·\n\nek ·\nxjδji = xk(\nei)\n(31)\n\nek ·\nxi = xk(\nei)\n(32)\n∂xi\n∂ xk\n=\n(\nei) = δkj(\nei) = ( ej\nei)\n(33)\nek ·\nek ·\nxj\n∂\n∂\nxj\n·\nReplacing equations (28) and (33) in (23):\nui\n∂\n∂\nui ∂xk\n∂ul\nei)(\n=\n=\n(el ·\nej\nek)\n(34)\nxj\n∂xk ∂\n∂\nxj\n∂xk\n·\nReplacing in equation (22):\n1 ∂ul\n∂ul\nij =\n(el ·\nej\nek) +\n(el · ej)(\nek)\n(35)\n2 ∂xk\nei)( ·\n∂xk\n\nei ·\nExchange indices l and k in second term:\n1 ∂ul\n∂uk\n2 ∂xk\nei)( ·\n∂xl\n\nei el)\nij =\n(el ·\nej\nek) +\n(ek · ej)( ·\n\n(36)\n∂ul\n∂uk\nei)(\n=\n+\n(el ·\nej\nek)\n2 ∂xk\n∂xl\n·\nOr, finally:\nei)(\nij = lk(el ·\nej\nek)\n(37)\n·\nCompatibility of strains\nGiven displacement field u, expression (21) allows to compute the strains\ncomponents ij. How does one answer the reverse question? Note analogy\nwith potentialgradient field. Restrict the analysis to two dimensions:\n∂u1\n∂u2\n∂u1\n∂u2\n11 =\n, 22 =\n, 212 =\n+\n(38)\n∂x1\n∂x2\n∂x2\n∂x1\n\nDifferentiate the strain components as follows:\n∂2\n\n∂3u1\n∂3u2\n212 =\n+\n∂x1∂x2\n∂x1∂x2\n∂x2\n(39)\n1∂x2\n∂3u1\n∂211 =\n∂x2\n∂x1∂x2\n(40)\n∂3u2\n∂222 =\n∂x2\n∂x2∂x2\n(41)\nand conclude that:\n∂212\n∂211\n∂222\n=\n+\n(42)\n∂x1∂x2\n∂x2\n∂x2"
    },
    {
      "category": "Resource",
      "title": "unit4_notes.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-21-techniques-for-structural-analysis-and-design-spring-2005/6a7365929517af77bc45ff70aec5108e_unit4_notes.pdf",
      "content": "Z\nZ\nZ\nZ\n16.21 Techniques of Structural Analysis and\nDesign\nSpring 2005\nUnit #4 Thermodynamics Principles\nRa ul Radovitzky\nFebruary 22, 2005\nFirst Law of Thermodynamics\nd\nK + U\n= P + H\n(1)\ndt\nwhere:\n- K: kinetic energy\n- U: internal energy\nP: Power of external forces\n-\n- H: hear exchange per unit time\n∂u\n∂u\n∂ui ∂ui\nK =\nρ\ndV =\nρ\ndV\n(2)\nV\n∂t · ∂t\nV\n∂t ∂t\nU =\nρbU0dV =\nU0dV\n(3)\nV\nV\n\nb\nZ\nZ\nZ\nZ\nZ\nZ\nZ\nZ\n\nZ\nwhere U0, U0 are the internal energy densities per unit mass and per unit\nvolume, respectively.\n∂u\n∂u\nP =\nf\ndV +\nt\ndS\n(4)\n· ∂t\nS\n· ∂t\nV\nIn components:\n∂ui\n∂ui\nP =\nfi\ndV +\nti\ndS\n(5)\n∂t\nS\n∂t\nV\nReplacing ti = njσji in this expression:\n∂ui\n∂ui\nP =\nfi\ndV +\nnjσji\ndS\n(6)\n∂t\nS\n∂t\nV\nUsing Gauss' Theorem:\n∂ui\n∂\n∂ui\nP =\nfi\ndV +\nσji\ndV\nZV\n∂t\nV ∂xj\n∂t\nh ∂σji\n\ni\n∂ui\n∂ ∂ui\n=\n+ fi\n+ σji\ndV\n∂xj\n∂t\n∂xj ∂t\nV |\n{z\n}\n| {z }\n∂2ui\n∂ ∂ui\nρ\n(why?)\n(7)\n∂t2\n∂t ∂xj\n∂2ui ∂ui\n∂ ∂ui\n=\nρ\n+ σji\ndV\n∂t ∂xj\nV\n|∂t2 {z∂t }\n|\n{z\n}\n1 ∂ ∂ui 2\n∂\nσji\nji\n2 ∂t\n∂t\n∂t\nNotation:\nTime derivatives:\n∂(\n)\n∂t\n=\n\n(\n)\nExamples:\n- ∂ui\n∂t = ui,\n∂u\n∂t = u\n- ∂2ui\n∂t2 = ui\n\nZ\nZ\nZ\n∂ij = ij\n∂t\n-\nSpatial derivatives:\n∂(\n) = (\n),i\n∂xi\nExamples:\n∂σji\n- ∂xj = σji,j\nWith this notation, the power of the external forces can be rewritten as:\nd\n1 ∂ui ∂ui\nP =\nρ\ndV +\nσji jidV\ndt\n∂t ∂t\n| V\n| V\n{z\n}\n{z\n}\n(8)\nK\ndeformation power\nwhere the \"ρdV \" inside the first integral was included inside the time deriva\ntive since it is a constant due to conservation of mass. We conclude that part\nof the power of the external forces goes into changing the kinetic energy of\nthe material and the rest into deforming the material. We call the latter the\ndeformation power and it represents the rate at which the stresses do work\non the deforming material.\nReplacing in the first law, equation (1):\nd\nd\nK + U\n=\nK +\nσji jidV + H\n(9)\ndt\ndt\nV\nAfter canceling the kinetic energy from both sides, the first law expresses the\nfact that the internal energy of a deforming material can be changed either\nby heating or by deforming the material:\nZ\nZ\ndU\ndt = d\ndt\nV\nρbU0dV =\nV\nσji jidV + H\n(10)\nIn the isothermal case (H = 0):\nZ\nV\n\nρ ∂bU0\n∂t - σij ij\n\ndV = 0\n(11)\n\nor, in local form:\n∂bU0\nρ\n= σij ij\n(12)\n∂t\nIn ideal elasticity, we assume that all the work of deformation is converted\ninto internal energy, i.e., the internal energy density is a state function of the\ndeformation:\nbU0 = bU0(ij)\n(13)\nThen:\n∂bU0\n∂t = ∂bU0\n∂ij\nij\n(14)\nReplace in first law, equation (12:\nρ ∂bU0\n∂ij\nij = σij ij ⇒\n(15)\n∂bU0\nρ\n= σij\n(16)\n∂ij\ni.e., the stresses derive from a potential."
    },
    {
      "category": "Resource",
      "title": "unit5_notes.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-21-techniques-for-structural-analysis-and-design-spring-2005/05953c9b99e07e647cb96c1fe17c721f_unit5_notes.pdf",
      "content": "16.21 Techniques of Structural Analysis and\nDesign\nSpring 2005\nUnit #5 Constitutive Equations\nRa ul Radovitzky\nFebruary 23, 2005\nConstitutive Equations\nFor elastic materials:\nσij = σij() = ρ ∂bU0\n∂ij\n(1)\nIf the relation is linear:\nσij = Cijklkl , Generalized Hooke's Law\n(2)\nIn this expression: Cijkl fourthorder tensor of material properties or Elastic\nmoduli (How many material constants?). Making use of the symmetry of the\nstress tensor:\nσij = σji ⇒ Cjikl = Cijkl\n(3)\nProof by (generalizable) example:\nσ21 = C21klkl, σ12 = C12klkl\nσ21 = σ12\nC21klkl = C12klkl\n\n⇒\n\nC21kl - C12kl kl = 0 ⇒\nC21kl = C12kl\n\nwhich generalizes to the statement. This reduces the number of material\nconstants from 81 to 54. In a similar fashion we can make use of the symmetry\nof the strain tensor\nij = ji ⇒ Cijlk = Cijkl\n(4)\nThis further reduces the number of material constants to 36.\nTo further\nreduce the number of material constants consider the conclusion from the\nfirst law for elastic materials, equation (1):\n∂U0\nσij =\n, U0 : strain energy density per unit volume\n(5)\n∂ij\n∂U0\nCijklkl =\n(6)\n∂ij\n∂2U0\nCijklkl =\n(7)\n∂mn\n∂mn ∂ij\n∂2U0\nCijklδkmδln =\n(8)\n∂mn∂ij\n∂2U0\nCijmn =\n(9)\n∂mn ∂ij\nAssuming equivalence of the mixed partials:\nCijkl =\n∂2U0\n∂kl∂ij\n=\n∂2U0\n∂ij∂kl\n= Cklij\n(10)\nThis further reduces the number of material constants to 21.\nThe most\ngeneral anisotropic linear elastic material therefore has 21 material constants.\nWe are going to adopt Voigt's notation :\n∂\n⎤\n⎡\n⎤\n⎡\n⎤\n⎡ σ11\nC11\nC12\nC13\nC14\nC15\nC16\n⎢⎢⎢⎢⎢⎢⎣\nσ22\nσ33\nσ23\nσ13\n⎥⎥⎥⎥⎥⎥⎦\n=\n⎢⎢⎢⎢⎢⎢⎣\nC22\nC23\nC24\nC25\nC26\nC33\nC34\nC35\nC36\nC44\nC45\nC46\nsymm\nC55\nC56\n⎥⎥⎥⎥⎥⎥⎦\n=\n⎢⎢⎢⎢⎢⎢⎣\n⎥⎥⎥⎥⎥⎥⎦\n(11)\nσ12\nC66\nWhen the material has symmetries in its structure the number of material\nconstants is reduced even further (see Unified treatment of this material).\nWe are going to concentrate on the isotropic case:\n\nIsotropic linear elastic materials\nMost general isotropic 4th order isotropic tensor:\nCijkl = λδijδkl + μ δikδjl + δilδjk\n(12)\nReplacing in:\nσij = Cijklkl\n(13)\ngives:\nσij = λδijkk + μ ij + ji\n(14)\nσij = λδijkk + μ ij + ji\n(15)\nExamples\nσ11 = λδ11 11 + 22 + 33 + μ 11 + 11 = λ + 2μ 11 + λ22 + λ33 (16)\nσ12 = 2μ12\n(17)\nPractice problem: Write the matrix of coefficients C (elastic moduli)\nfor an isotropic material (Voigt form) in Mathematica.\nCompliance matrix for an isotropic elastic material\nFrom experiments one finds:\n1 h\n\ni\n11 =\nσ11 - ν σ22 + σ33\n(18)\nE\n1 h\n\ni\n22 =\nσ22 - ν σ11 + σ33\n(19)\nE\n1 h\n\ni\n33 = E σ33 - ν σ11 + σ22\n(20)\n223 = σ23\nG , 213 = σ13\nG , 212 = σ12\nG\n(21)\nIn these expressions, E is the Young's Modulus, ν the Poisson's ratio and\nG the shear modulus. They are referred to as the engineering constants,\n\nsince they are obtained from experiments. In Unified we demonstrated that\nG =\nE\n2(1+ν). This expressions can be written in the following matrix form:\n⎤\n⎡\n⎤\n⎡\n⎤\n⎡\nE\n-ν\nE\nν\nσ11\n-\nE\nE\n⎢⎢⎢⎢⎢⎢⎣\n⎥⎥⎥⎥⎥⎥⎦\n=\n⎢⎢⎢⎢⎢⎢⎣\n⎢⎢⎢⎢⎢⎢⎣\n⎥⎥⎥⎥⎥⎥⎦\n⎥⎥⎥⎥⎥⎥⎦\n-ν\nE\nE\nσ22\nσ33\nσ23\nσ13\n(22)\nG\nG\nsymm\nG\nσ12\nInvert and compare with:\n⎤\n⎡\n⎤\n⎡\n⎤\n⎡ σ11\nλ + 2μ\nλ\nλ\n⎢⎢⎢⎢⎢⎢⎣\nσ12\nμ\nand conclude that:\nEν\nλ =\n, μ = G\n(24)\n(1 + ν)(1 - 2ν)\n⎢⎢⎢⎢⎢⎢⎣\n⎥⎥⎥⎥⎥⎥⎦\n⎢⎢⎢⎢⎢⎢⎣\n⎥⎥⎥⎥⎥⎥⎦\n⎥⎥⎥⎥⎥⎥⎦\nσ22\nλ + 2μ\nλ\nσ33\nλ + 2μ\n(23)\n=\nσ23\nμ\nσ13\nsymm\nμ\n\nPlane stress\nConsider situations in which:\nσi3 = 0\n(25)\nx1\nx2\nx3\nThen:\n\n11 = E σ11 - νσ22\n(26)\n\n22 = E σ22 - νσ11\n(27)\n33 = -ν\nE\n\nσ11 + σ22\n\n6= 0 !!!\n(28)\n23 = 13 = 0\n(29)\n12 = σ12\n2G = (1 + ν)σ12\nE\n(30)\nIn matrix form:\n⎡\n⎤\n⎡\n⎤ ⎡\n⎤\n⎣\n⎦ = 1\nE\n⎣\n-ν\n-ν\n2(1 + ν)\n⎦ ⎣\nσ11\nσ22\nσ12\n⎦\n(31)\n\nInverting gives the relations among stresses and strains for plane stress :\n⎡\n⎤\n⎡\n⎤⎡\n⎤\nσ11\nE\nν\n⎣σ22⎦ =\n⎣ν\n0 ⎦⎣ 22 ⎦\n(32)\n(1-ν)\nσ12\n1 - ν2\nPlane strain\nIn this case we consider situations in which:\ni3 = 0\n(33)\nThen:\n1 h\n\ni\n33 = 0 =\nσ33 - ν σ11 + σ22\n, or:\n(34)\nE\n\nσ33 = ν σ11 + σ22\n(35)\n1 n\n\no\n11 =\nσ11 - ν σ22 + ν σ11 + σ22\nE\n(36)\n1 h\n\ni\n=\n1 - ν2 σ11 - ν 1 + ν σ22\nE\n1 h\n\ni\n22 =\n1 - ν2 σ22 - ν 1 + ν σ11\n(37)\nE\nIn matrix form:\n⎡\n⎤\n⎡\n⎤⎡\n⎤\n1 - ν2\n-ν(1 + ν)\nσ11\n⎣ 22 ⎦ =\n⎣-ν(1 + ν)\n1 - ν2\n⎦⎣σ22⎦\n(38)\nE\n2(1 + ν)\nσ12\nInverting gives the relations among stresses and strains for plane strain :\n⎡\n⎤\n⎡\n⎤⎡\n⎤\nσ11\nE\n1 - ν\nν\n⎣σ22⎦ =\n⎣ ν\n⎦⎣ 22 ⎦\n(39)\nσ12\n(1 + ν)(1 - 2ν)\n1 - ν\n(1-2ν)\nPractice problem: Verify equations (32) and (39) using Mathematica.\n\n0.0.1\nThermal strains\nWe are going to consider the strains produced by changes of temperature\n(θ). These strains have inherently a dilatational nature (thermal expansion\nor contraction) and do not cause any shear. Thermal strains are proportional\nto temperature changes. For isotropic materials:\nθ\nij = αΔθδij\n(40)\nThe total strains (ij) are then due to the (additive) contribution of the\nmechanical strains (M\nij ), i.e., those produced by the stresses and the thermal\nstrains:\nij = M\nij + θ\nij\n(41)\nσij = CijklM\nkl = Cijkl(kl - θ\nkl), or\n(42)\nσij = Cijkl(kl - αΔθδkl)\n(43)\nPractice problem: Write the relationship between stresses and strains\nfor an isotropic elastic material whose Lam e constants are λ and μ and whose\ncoefficient of thermal expansion is α. constants and"
    },
    {
      "category": "Resource",
      "title": "unit6_notes.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-21-techniques-for-structural-analysis-and-design-spring-2005/248d102c71a8fc89f0e2fb87c0c4bf2d_unit6_notes.pdf",
      "content": "16.21 Techniques of Structural Analysis and\nDesign\nSpring 2005\nUnit #6 Boundary value problems in linear\nelasticity\nRa ul Radovitzky\nFebruary 27, 2005\nFigure 1: Schematic of generic problem in linear elasticity\n- Equations of equilibrium ( 3 equations, 6 unknowns ):\nσji,j + fi = 0\n(1)\n- Compatibility ( 6 equations, 9 unknowns):\n∂ui\n∂uj\nij =\n+\n(2)\n2 ∂xj\n∂xi\n\n- Constitutive Law (6 equations, 0 unknowns) :\nσij = Cijklkl\n- Boundary conditions of two types:\n(3)\n-\n-\nTraction or natural boundary conditions: For tractions t imposed\non the portion of the surface of the body ∂Bt:\nniσij = tj = t j\nDisplacement or essential boundary conditions: For displacements\n(4)\nu imposed on the portion of the surface of the body ∂Bu, this\nincludes the supports for which we have u = 0:\n(5)\nui = ui\nOne can prove existence and uniqueness of the solution ( the fields: ui(xj), ij(xk), σij(xk))\nin B."
    },
    {
      "category": "Resource",
      "title": "unit7_beamenergy.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-21-techniques-for-structural-analysis-and-design-spring-2005/26b331e8d4258d9cd36e0686139784be_unit7_beamenergy.pdf",
      "content": "16.21 Techniques of Structural Analysis and\nDesign\nSpring 2004\nUnit #7 (continued) Concepts of work and\nenergy\nStrain energy and potential energy of a beam\nRa ul Radovitzky\nMarch 2, 2005\nFigure 1: Kinematic assumptions for a beam\n\nKinematic assumptions for a beam: From the figure: AA0 = u3(x1).\n\nAssume small deflections: B0\nB00, BB00 = u3 + du3.\nCC0 = u3(x) +\n∼\n\nZ\nZ\nZ\n{z\n}\nu1(x1, x3). Assume planar sections normal to the neutral axis remain planar\nafter deformation. Then:\nu3 = u3(x1)\n(1)\ndu3\nu1(x1, x3) = -x3\n(2)\ndx1\nu3(x1) is the only primary unknown of the problem\n(3)\nFrom these kinematic assumptions we can derive a theory for beams.\nStrains:\ndu1\nd2u3\n11 =\n= -x3\n(4)\ndx1\ndx2\n22 = 33 = -ν11, plane stress\n(5)\n13 = 1\ndu1\ndx3\n+ du3\ndx1\n\n= 1\n\n- du3\ndx1\n+ du3\ndx1\n\n= 0\n(6)\nConstitutive:\nσ11 = E11 = -Ex3\nd2u3\ndx2\n(7)\nEquilibrium: Apply equilibrium (in the undeformed configuration) to in\ntegral quantities (moment M and shear force V ).\nDefinitions of integral\nquantities as forces \"equivalent\" to the internal stresses:\nV (x1) +\nσ13dA = 0\n(8)\nZ A(x1)\nM(x1) +\nσ11x3dA = 0\n(9)\nA(x1)\nreplacing σ11:\n\nd2u3\nd2u3\nM(x1) =\n-E\nx3 dA = E\nx3dA\n(10)\ndx2\ndx2\nA(x1)\n1 |\nA(x1)\nd2u3\nM(x1) = EI(x1)\n(11)\ndx2\n\nAlso note:\nMx3\n(12)\nσ11 = - I\nWith these definitions we can apply equilibrium as shown in the figure:\nX\ndV\nFx3 = 0 :\nV - qdx1 - V - dV = 0 → dx1\n= -q\n(13)\nX\nM B = 0 : -M + M + dM - V dx1 + q dx2\n= 0 → dM\ndx1\n= V\n(14)\nd dM\nd2M\ndx1\ndx1\n= -q → dx2\n= -q\n(15)\nReplacing equation (11) in the last expression:\nd2\ndx2\n\nEI d2u3\ndx2\n\n+ q(x1) = 0\n(16)\nFourth order differential equation governing the deflections of beams. Needs\n4 boundary conditions. Examples:\na)\nb)\nL\nL\nx1\nx1\n3(L) = 0, u000\n- case a u3(0) = 0, u3\n0 (0) = 0, u00\n3 (L) = 0.\n3(0) = 0, u3(L) = 0, u00\n- case a u3(0) = 0, u00\n3(L) = 0.\n\nZ\nZ\nZ\nStrain energy of a beam Start from the general definition of strain\nenergy density:\nij\nU0 =\nσijdij\n(17)\nfor a linear elastic material we concluded:\nU0 =\nσijij\n(18)\nClassical beam theory: σ11 = 0, all other stress components are zero.\nU0 =\nσ1111 =\nE2\n(19)\nd2u3\nU0 = 1 Ex 2 d2u3 2\n11 = -x3\n(20)\ndx2\n→\ndx2\n(21)\nd2u3 2\nU =\nU0dV =\nEx 2\ndV\n(22)\ndx2\nV\nV\n1 Z L\nd2u3 2 Z\n=\nE\nx3dAdx1\n(23)\ndx2\nA(x)\nZ L\nd2u3 2\nU =\nEI(x)\ndx1\ndx2\n(24)\nalso note:\n(25)\n1 Z L\nd2u3\nU =\nM(x1)\ndx1\ndx2\nComplementary strain energy of a beam\nComplementary strain energy density:\nZ 11\n1 σ2\n(26)\n(27)\n-Mx3\n∗\nU\n11dσ11\n=\n=\n=\n2 E\n2E\nI\nThe complementary strain energy is then\nZ\nZ L\nZ\nM 2\n∗\n0 dV\nUc =\nU\ndAdx1\n(28)\n= 2\nEI2\nx3\nV\nA(x1)\nZ L M 2\nUc =\ndx1\nEI\nPotential of the external forces:\n(29)\n\nZ\nZ\nV =\ntiuidS -\nfiuidV\n(30)\n-\nS\nV\nZ L\nV =\nq(x1)u3(x1)dx1 - Pu3(L) - Mu0\n(31)\n3(L)\n-\nThe total potential energy of the beam is:\nZ Lh 1\nd2u3 2\ni\nΠ(u3) =\nEI\ndx1 + qu3 + Pu3(L) + Mu0\n(32)\n3(L)\ndx2\nThis is the expression we gave the first day of class!."
    },
    {
      "category": "Resource",
      "title": "unit7_notes.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-21-techniques-for-structural-analysis-and-design-spring-2005/266019e28442d3a53ee03227eef5d72e_unit7_notes.pdf",
      "content": "16.21 Techniques of Structural Analysis and\nDesign\nSpring 2005\nSection 2 Energy and Variational Principles\nUnit #7 Concepts of work and energy\nRa ul Radovitzky\nMarch 2, 2005\nWork\nFigure 1: Work of a force on a moving particle\n\nZ\nZ\nX\n- Work done by a force:\ndW = f\ndu = fiui = kfk kduk cos ( bfu)\n(1)\n·\nZ B\nZ B\nWAB =\ndW =\nf\ndu\n(2)\n·\nA\nA\n- Work done by a moment:\ndW = M dθ = Miθi\n(3)\n·\nZ B\nZ B\nWAB =\ndW =\nM dθ\n(4)\n·\nA\nA\nExtend definition to material bodies: total work is the addition of the\n-\nwork done on all particles:\n- by forces distributed over the volume:\nW =\nf\nudV\n·\nV\n- by forces distributed over the surface:\nW =\nt udS\n·\nS\n- by concentrated forces:\nn\nW =\nfi u(xi)\n·\ni=1\nAnother classification:\n- Work done by external forces: we will assume that external forces don't\nchange during the motion or deformation, i.e., they are independent\nof the displacements. This will lead to the potential character of the\nexternal work and to the definition of the potential of the external forces\nas the negative of the work done by the external forces.\n- Work done by internal forces: the internal forces do depend on the\ndeformation.\nIn general, the work done by external forces and the work done by\ninternal forces don't match (we saw that part of the work changes the\nkinetic energy of the material).\n\n2mg\nWE = WI would imply δ =\nk , which contradicts equilibrium: δ =\n-\nmg\nk ,\n- before the final displacement δ is reached the system is not in equilib\nrium. How can you explain this?\nStrain energy and strain energy density\nFigure 3: Strain energy density\nStrain energy and strain energy density (see also unit on first law\nof thermodynamics):\nZ\nU =\nU0dV\n(10)\nV\nFrom first law:\n∂U0\n∂t = σij ij\n\n| {z }\nZ\n∂U0 ij = σij ij\n∂ij\n????\n∂U0\nσij = ∂ij\nZ ij\nU0 =\nσijdij , not necessarily linear elastic\nLinear case:\nZ ij\nU0 =\nCijklkldij =\nCijklklij =\nσijij\n(11)\nComplementary strain energy and complementary strain energy\ndensity\nFigure 4: Complementary strain energy density\nU ? =\nU0\n?dV\n(12)\nV\nZ σij\nU ? =\nijdσij\n(13)\n\nZ\nLinear case: ij = Sijklσkl, where Sijkl = C-1\nijkl\nZ σij\nU0\n? =\nSijklσkldσij =\nSijklσklσij =\nijσij\n(14)\nU ? = U0 for a linear elastic material\n(15)\n⇒\nExample: Compute the strain energy density, strain energy, and their\ncomplementary counterparts for the linear elastic bar loaded axially shown\nin the figure:\nZ 0\nZ -ν0\nU0 =\nσ11d11 +\nσ22d22 + . . .\nZ 0\n=\nE11d11 =\nE2\nP\nFrom equilibrium we know: σ0 = A.\nP\nFrom the constitutive law: 0 = σ0 = AE\nE\n1 P 2\nU0 =\n⇒\n2 EA2\nALP 2\nP 2L\nU =\nU0dV =\n=\n2EA2\n2EA\nV\n\nZ\n\nZ\nZ\nZ\nZ\nZ\nZ\nZ σ0\nU ? =\n11dσ11 +\n22dσ22 + . . .\nZ σ0\nσ0\nσ2\nP 2\n=\n=\n=\nσ11\n1 σ2\ndσ11\nU0!!\n=\n= 2E\n11 0\n2E\n2EA2\nE\nALP 2\nP 2L\nU ? =\nU ?dV\nU!!\n=\n=\n=\n2EA2\n2EA\nV\nPotential Energy\nCapacity of the system (material body + external forces) to return work\nΠ = U + V , V : potential of external loads\nV =\nt iuidS -\nf iuidV\n-\nS\nV\nΠ =\nσijijdV -\nt iuidS -\nf iuidV\nV 2\nS\nV\n(16)\n(17)\n(18)\nThis expression applies to linear elastic materials (why?)."
    }
  ]
}