{
  "course_name": "Technology and Change in Rural America",
  "course_description": "This course considers the historical dimensions of rural production from subsistence to industrialization, both in America and in an international context, with an emphasis on the role of science and technology. Topics include changing notions of progress; emergence of genetics and its complex applications to food production; mechanization of both farm practices and the food industry; role of migrant labor; management theory and its impact on farm practice; role of federal governments and NGOs in production systems; women in food production systems; and the green revolution.",
  "topics": [
    "Humanities",
    "History",
    "American History",
    "History of Science and Technology",
    "Modern History",
    "Social Science",
    "Anthropology",
    "Social Anthropology",
    "Humanities",
    "History",
    "American History",
    "History of Science and Technology",
    "Modern History",
    "Social Science",
    "Anthropology",
    "Social Anthropology"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 3 hours / session\n\nOverview\n\nThis class considers the intersection of science and technology with agriculture and food production systems in the 20th century. A basic premise is that, when things become industrialized and rationalized, they follow particular historical patterns that tend to play themselves out over and over in different locations. Another premise, however, is that local circumstances never quite fit the patterns that have evolved, and historians must pay close attention to the differences between the micro and the macro, the universal and the particular, the state and the farmer. We attempt to understand these things by reading historical and anthropological essays on the relation between rural life, scientific institutions, technological and managerial innovations, agricultural production, and politics in America and the third world.\n\nRequirements\n\nStudents are required to attend all classes and be prepared to discuss the assigned readings. Students take turns leading the weekly discussions. Although there are no exams, each student must write either an original research paper on a topic of interest to the student or a bibliographic essay on a set of outside readings.",
  "files": []
}