{
  "course_name": "Technology in American History",
  "course_description": "This course will consider the ways in which technology, broadly defined, has contributed to the building of American society from colonial times to the present. This course has three primary goals: to train students to ask critical questions of both technology and the broader American culture of which it is a part; to provide an historical perspective with which to frame and address such questions; and to encourage students to be neither blind critics of new technologies, nor blind advocates for technologies in general, but thoughtful and educated participants in the democratic process.",
  "topics": [
    "Humanities",
    "History",
    "American History",
    "History of Science and Technology",
    "Humanities",
    "History",
    "American History",
    "History of Science and Technology"
  ],
  "syllabus_content": "This page presents a course overview, course policies and requirements, and a\nclass schedule\n.\n\nCourse Meeting Times\n\nLectures: 2 sessions / week\n\nLec 1: 1 hour / session, Lec 2: 2 hours / session\n\nClass Overview\n\nThis class will consider the ways in which technology, broadly defined, has contributed to the building of American society from colonial times to the present. Far from being an \"add-on\" to political and social events, technology is viewed as a central organizing theme in American history. Indeed, the United States is often referred to as \"the technological society.\" What does that expression mean? Why did it originate? How and in what ways does technology intersect with society and politics? How has technological progress been construed in America? Does technology mean progress? If so, progress for whom and for what? What is the relationship between technology and democracy in America? How have notions of \"responsibility\" in engineering and technology development changed over time?\n\nThis course has three primary goals: to train students to ask critical questions of both technology and the broader culture of American society; to provide an historical perspective with which to frame and address such questions; and to encourage students to be neither blind critics of new technologies, nor blind advocates for technologies in general, but thoughtful and educated participants in the democratic process.\n\nRequirements\n\nThis class meets two times per week: the first session per week is one hour long, while the second session per week lasts two hours. Class meetings will consist of lectures or films, followed by discussion. In each longer class period, two students will lead the discussion of material presented in lecture, film, and readings. In addition to attending all classes, students are expected to participate in these discussions by reading assigned materials\nbefore\nclass and thinking about the themes, questions, and historical patterns the readings suggest.\n\nWriting Assignments\n\nWriting for this course will consist of a 6-7 page book review of a book selected from a list, a 12-page essay on an assigned topic, and a 2-3 page reading response/discussion paper.\n\nReading response/discussion paper:\neach student will be assigned a date on which he or she is expected to submit a reading response paper and lead discussion in the section. An example response paper will be distributed, to give you an idea of how you are expected to construct your own responses.\n\nAll written work must be typed in 12-point font, double-spaced, with adequate margins. All papers must be proofread (not just spell checked) before submission: papers will be downgraded for errors of carelessness. Students who need extra help with writing should visit the Writing Center as they prepare their papers for submission, or schedule an appointment with the class Writing Tutor\ntwo weeks in advance of due dates\n. After initial grading, the book review and essay will be revised by students and re-submitted. Improvements will result in higher grades.\n\nExaminations\n\nThere is a cumulative final examination for this class, and two short quizzes, covering the readings, lectures, and films. Keep in mind that the lectures and readings for this course usually do not cover the same material. This means that you must be present in class and take good notes in order to be prepared for the quizzes and final exam.\n\nGrading Policy\n\nFinal grades will be determined as follows:\n\nActivities\n\nPercentages\n\nBook Review\n\n20%\n\nEssay\n\n25%\n\nReading Response Paper/Discussion Leading\n\n10%\n\nQuizzes\n\n20%\n\nFinal Exam\n\n25%\n\nRegular attendance, participation, and a good attitude are essential. Without all three you will not get much out of this course.\nAttendance will be taken daily and poor attendance will result in severe final grade penalties. Each student is allowed no more than two (2) unexcused absences\n. Thereafter one's final grade will be reduced by one full grade per cut. If a situation arises during the term (illness, family emergency, etc.) and you have to miss classes, please be sure to notify the instructor.\n\nReadings and Films\n\nThe following two textbooks are required:\n\nCowan, Ruth Schwarz.\nA Social History of American Technology\n. New York, NY: Oxford University Press, 1997. ISBN: 9780195046052.\n\nSmith, Merritt Roe, and Gregory Clancey, eds.\nMajor Problems in the History of American Technology\n. Boston, MA: Houghton Mifflin, 1997. ISBN: 9780669354720.\n\nFor students who are not familiar with American history and need to familiarize themselves with the subject, a helpful introduction is: Maier, Pauline, et al.\nInventing America: A History of the United States\n. 2nd ed. New York, NY: W. W. Norton & Co., 2005. ISBN: 9780393926750.\n\nClass Schedule\n\nLEC #\n\nTOPICS\n\nKEY DATES\n\nIntroduction\n\nWhat is Technology?\n\nTechnologies of Colonization and Conquest\n\nCrafts and Craftsmanship in Early America\n\nPaul Revere: Technologist?\n\nGuest Speaker: Prof. Rob Martello (Olin College)\n\nPolitics and Early American Industrialization\n\nThe Role of the State in Early American Industry\n\nSocial and Political Implications of the New Technology\n\nThe Transportation and Communications Revolution\n\nFirst Reading Quiz\n\nArt and Industrialization\n\nThe Emerging Culture of Engineering in America\n\nBook review due\n\nTechnology in the Civil War Era\n\nTechnology in the Civil War Era (cont.)\n\nHuman Machines? Frederick W. Taylor and the Rise of Scientific Management\n\nAutomobility and Mass Production\n\nSecond Reading Quiz\n\nMass Production\n\nHobbyist Worlds and Technological Enthusiasm in Modern America\n\nGuest Speaker: Kieran Downes (MIT)\n\nAeronautics and the Systems Approach\n\nGuest Speaker: Dr. Deborah Douglas (MIT Museum)\n\nTechnology and Art at the Apex of the Machine Age\n\nFirst draft of essay due\n\nWorld War II: A Technological Turning Point?\n\nGuest Speaker: Dr. Brendan Foley (Woods Hole Oceanographic Institute)\n\nWorld War II: A Technological Turning Point? (cont.)\n\nA New World: Technology in Cold War America\n\nComputers and Control: The Apollo Program\n\nGuest Speaker: Sandy Brown (MIT)\n\nFinal draft of essay due\n\nNature's Revenge: Technology and the Environment\n\nThe Brave New World of Biotechnology\n\nGuest Speaker: Victor McElheny (MIT Knight Fellows Program)",
  "files": [
    {
      "category": "Resource",
      "title": "bookreview_guide.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-001-technology-in-american-history-spring-2006/e5fb55c614afddca69ac30d90408516f_bookreview_guide.pdf",
      "content": "the class Writing Tutor\n."
    },
    {
      "category": "Resource",
      "title": "bookreviewsample.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-001-technology-in-american-history-spring-2006/2b478a93a65c09c604b8af494f25057b_bookreviewsample.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "essay_guide.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-001-technology-in-american-history-spring-2006/a19a0d00b7b0df21ae0183cce7c0ec4d_essay_guide.pdf",
      "content": "STS.001 - Technology in American History\n\nSpring Term 2006\nProfessor Merritt Roe Smith\n\nGUIDELINES FOR PREPARING A SCHOLARLY ESSAY\n\nFirst, the choice of topic is up to you. The subject may be a biography of a famous\ninventor (e.g. Thomas Edison, Elmer Sperry, Edwin Land, John Bardeen, et al.), an\ninfluential engineer or system builder (e.g. Vannevar Bush), the development of an\nimportant invention, improved design, and/or innovation (e.g. the DC-3 airplane, the\nlaser, industrial research lab), the development of a technological system (e.g. telephony,\nelectric power, telegraphy, the \"American system of manufacturing\"), a medical advance\n(e.g. penicillin, the artificial heart), or it can be about broader subjects like depiction of\ntechnology in art, literature, and/or modern advertising, technology and the advent of\n\"consumer society\" . . . and so on.\n\nWhatever topic you choose, remember that you are expected to address it from three\nangles of vision and analysis: the technical \"nuts and bolts\" aspect of the subject\n(technology as knowledge, if you will), the subject's impact on society (technology as\nsocial force), and how the subject reflected the society, politics, and culture in which it\nemerged and/or existed (technology as social product).\n\nSecond, once you have decided on a subject, you must clear it either with Professor\nSmith or the TA. If you have trouble identifying a topic, Professor Smith and the TA are\nwilling to help you do so.\n\nThird, the paper you write should be a footnoted scholarly essay. The text should be 11-\n12 pages long, double-spaced. Like the book review, it should be an example of your\nbest work. Remember to proof-read and correct your paper before handing it in. The\npaper should go through at least three drafts before you give it to us. Doing so will save a\nlot of extra work later on.\n\nIf you need help with writing the paper, remember that the writing tutor is available for\nconsultation.\n\nFourth, the paper will be graded on four levels: content, organization, insight/perception,\nand writing style. Each student will receive two grades, one for the first submission; a\nsecond for the revised submission.\n\nFifth, source materials. Whatever topic you select, you must consult at least four source\nmaterials beyond the required textbooks for this class. In other words, some basic\nresearch is required before you write the paper. Books, articles from scholarly journals,\nnewspaper and magazine articles are acceptable sources. The use of primary\nmanuscript/archival sources is encouraged but not required. Encyclopedias like the\nWorld Book do not count, nor will special websites unless they are discussed first and\napproved by Professor Smith or the TA. Your use of source materials will be\ntaken into account by the instructors and will comprise part of the grade assigned for the\n\"content\" portion of the essay. You are strongly encouraged to consult with the TA about\nfinding good sources. Oftentimes the best materials are tucked away in publications that\nare very hard to find. The TA is ready and willing to help you with your search.\n\nFinally, footnoting. The purpose of a footnote is to indicate to the reader where you\nacquired the information you are using. You don't have to footnote everything.\nHowever, direct quotations must always be footnoted. So should important pieces of\ninformation that are critical to your argument, as should anything you believe the reader\nmight want to know more about upon reading your essay. In other words, footnotes\nshould be used to document your essay and to point the reader to the sources you are\nusing in case s/he wants to check your facts and/or consult them for further information.\nSome example footnotes follow.\n\nSTS.001 - Technology in American History\n\nSpring Term 2006\nProfessor Merritt Roe Smith\n\nExample Footnotes\n\nBooks\nBook by a Single Author, First Edition:\n1. Donald N. McCloskey, Enterprise and Trade in Victorian Britain:\nEssays in Historical Economics (London: George Allen and Unwin,\n1981), 54.\nBook by a Single Author, Later Edition:\n2. Donald N. McCloskey, The Applied Theory of Price, 2nd ed. (New\nYork: Macmillan, 1985), 24.\n\nBook by Two or Three Authors:\n3. Donald A. Lloyd and Harry R. Warfel, American English and Its\nCultural Setting (New York: Alfred A. Knopf, 1956), 12.\n\n[If there is a third author, follow this example: James Smith, Donald Marc,\nand Jack Jones.]\nBook by More than Three Authors:\n4. Martin Greenberger et al., eds., Networks for Research and Education:\nSharing of Computer and Information Resources Nationwide\n(Cambridge: MIT Press, 1974), 50.\nBook by an Unknown Author:\n5. College Bound Seniors (Princeton: College Board Publications, 1979),\n1.\nBook with Both an Author and an Editor or Translator:\n6. Helmut Thielicke, Man in God's World, trans. and ed. John W.\nDoberstein (New York: Harper and Row, 1963), 12.\nAn Anthology:\n7. Poetical Works of William Wordsworth, ed. E. de Selincourt and H.\nDarbishire, 2nd ed., vol. 2 (Oxford: Oxford University Press, 1952), 10.\nChapter in an Edited Collection:\n8. Ernest Kaiser, \"The Literature of Harlem,\" in Harlem: A Community in\nTransition, ed. J. H. Clarke (New York: Citadel Press, 1964), 64.\nReprinted Book:\n9. Gunnar Myrdal, Population: A Problem for Democracy (Cambridge:\nHarvard University Press, 1940; reprint, Gloucester, MA: Peter Smith,\n1956), 9.\n\nArticles\nArticle in a Journal:\n10. Louise M. Rosenblatt, \"The Transactional Theory: Against\nDualisms,\" College English 54 (1993): 380.\nBook Review:\n11. Steven Spitzer, review of The Limits of Law Enforcement, by Hans\nZeisel, American Journal of Sociology 91 (1985): 727.\n\nNewspaper Article:\n12. Tyler Marshall, \"200th Birthday of Grimms Celebrated,\" Los Angeles\nTimes, 15 March 1985, sec. 1A, p. 3.\n[\"p.\" is used to make clear the difference between the page and section\nnumbers.]\n\nOther\nGovernment Document:\n13. Congressional Record, 71st Cong., 2nd sess., 1930, 72, pt.\n10:10828:30.\nUnpublished Material (Dissertation or Thesis):\n14. James E. Hoard, \"On the Foundations of Phonological Theory\" (Ph.D.\ndiss., University of Washington, 1967), 119.\nInterview by Writer of Research Paper:\n15. Charles M. Vest, interview by author, Cambridge, Massachusetts, 1\nDecember 1992.\n\nFor more examples see:\n\nKate L. Turabian, A Manual for Writers of Term Papers, Theses, and Dissertations\n(Chicago: University of Chicago Press, 1996)."
    },
    {
      "category": "Resource",
      "title": "response_guide.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-001-technology-in-american-history-spring-2006/57df5eaa13ef0b2f62822a37c56b2c6e_response_guide.pdf",
      "content": "STS.001: Technology in American History\nHow to Write a Response Paper\nBy Jamie Pietruska and Shane Hamilton, STS\nFebruary 14, 2006\nReading response papers have three basic purposes: to help you think critically about the\nreadings, formulate your own ideas, and pose questions for further discussion. They offer you\nthe chance to think on paper and clarify your own ideas before you present them to the class.\nResponse papers are not like formal essays in which you have a thesis clearly in mind when you\nbegin and then marshal evidence to support your argument. Rather, you will often write your\nway to a central idea or a set of questions that appear toward the end of your response paper, not\nat the beginning.\nHow should you go about writing your response? There is no one best way. You can have\nvarious starting points. You might begin with a personal experience that is relevant to the topic,\nor with a particularly compelling or confusing quotation from the readings, or with whatever idea\nin the readings seemed most important to you. You can also adopt various approaches. For\ninstance, you could agree with one author over another (e.g., \"I think Winner is right that\ntechnologies can have politics whether people use them or not, while Cowan is wrong to state\nthat technologies have no politics until they are put into use within systems, for the following\nreasons [x,y,z]\"). You could critique the standpoint of the authors (e.g., \"It seems that Winner is\ntoo pessimistic about the potential for technological change to bring beneficial social change.\nMacKenzie's idea of 'negotiation' is more hopeful, implying that ordinary people can direct\ntechnological change to fight entrenched sources of power\"). You could point out\ninconsistencies in the material (e.g., \"All the authors take pains to define 'technology,' but when\nthey use terms like 'large-scale' or 'nature,' they are much more lax\").\nRegardless of whatever approach you take, all reading response papers should be insightful,\nanalytical, and clearly written. Reading response papers should be 1-2 pages in length, typed,\ndouble-spaced, and in 12 point font.\nHere are some concrete suggestions to help you get started:\n- When you're doing the reading, take notes. Highlighting is NOT a good way to take\nnotes. You should write, on a separate piece of paper, paraphrases of the author's key\narguments as well as your own thoughts about the reading. These notes will not only\nhelp you write good responses, but will really help you with the final exam.\n- Don't waste space summarizing the authors' arguments. It is very important that you\ndemonstrate that you understand what the author is trying to communicate, but you\ncan do this very briefly. The most important part of a response paper is your\nresponse--that is, what did you think of these readings? What did you find\ninteresting, wrong-headed, surprising, or thought-provoking about the readings?\n- Be specific. Here's a vague sentence: \"One of the authors thinks that the meaning of\ntechnology is socially constructed.\" Here's a more precise sentence: \"Donald\nMacKenzie argues that people have different ideas about what is valuable about\nparticular technologies like supercomputers.\"\n\n- Ask questions, even if you don't know the answers! Often you need to wrestle with a\nquestion for a while--both on paper and in class discussion--before you can come up\nwith a good answer. And the most interesting historical questions don't have easy or\nobvious answers anyway. So you should feel comfortable with some intellectual risk-\ntaking here: try out ideas and questions even if you are not sure where exactly you are\nheaded.\n- Be creative! Remember, writing is thinking, and both are a lot more enjoyable when\nyou are playing with ideas that excite you."
    },
    {
      "category": "Resource",
      "title": "response_sample.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-001-technology-in-american-history-spring-2006/7baf973ac6546fa9184bc3b1e1bc3186_response_sample.pdf",
      "content": "STS.001 Technology in American History\n\nFebruary 7, 2006\n\nSample response to \"What is Technology?\" readings by Jamie Pietruska, HASTS\n\nIn my first semester at MIT, I took a class titled \"Technology in the Civil War Era.\"\nWhen I told a friend what I was taking, she looked at me strangely and said, \"I didn't know they\nhad technology in the Civil War!\" As I started to rattle off examples of material technologies\nused during the Civil War--rifles, cannons, bullets, wagons, the telegraph, and so on--she\ninterrupted and said, \"Well, that's not really technology, is it?\" Her question sounds simple, but\nas this week's readings suggest, the answer is anything but. To my friend, and surely to many\nothers, technology means something (definitely a material artifact) very late-twentieth-century\nand very digital, like a Dell laptop computer, Internet Explorer, a Motorola cellphone, or the\nubiquitous iPod. To this week's essayists, technology is much more than a material object; it is\nan idea with a history of its own, a political constraint, and a social phenomenon.\n\nWe often think of technologies as having the power to change and shape our world, but\nLeo Marx's essay underscores the power of technology as an idea. After he traces the\nintellectual history of the concept, Marx concludes that the very abstractness of the word\ntechnology has yielded an unintended consequence for those of us in the late twentieth century:\nas we have turned technology from a concrete noun to an increasingly abstract adjective in our\nso-called \"technological world\" or \"technological society,\" we have given the concept \"a host of\nmetaphysical properties and potencies, thereby making it seem to be a determinate entity, a\ndisembodied autonomous causal agent of social change--of history\" (5). According to Marx,\nthis mysterious power that our language has ascribed to technology has resulted in \"postmodern\npessimism\" (5). It strikes me as somewhat ironic that the optimism of an increasingly powerful\nand all-encompassing definition of technology may have resulted in a profound pessimism.\nHistorians often point out that material technologies have unintended consequences in the\n\nphysical world, but according to Marx's argument, it seems that the unintended consequences are\ncultural or metaphysical as well. I wonder how the nineteenth-century belief in a linear march of\nprogress that celebrated railroads and telegraphs, for example, as agents of economic power\nturned into a late-twentieth-century critique of a far more vague concept of technology as the\nroot of social problems. What kind of pessimism have we ended up with, and where did it come\nfrom?\n\nLangdon Winner's discussion of the social and political power of technologies--in\nparticular his account of Robert Moses's low-hanging and thus discriminatory overpasses in New\nYork--suggests one reason for pessimism: a sense of individual powerlessness within the\npolitical and social structures established by different technologies (12-13). Winner is careful to\nsay that few technological power structures are the direct result of willful conspiracies against\nparticular social groups (10-11), but his accounts of campus architecture and California tomato\nharvesting present a fairly bleak picture in which individual students and individual agricultural\nworkers cannot possibly hope to overcome the constraints imposed upon them by designers of\nconcrete campus plazas and the mechanical tomato harvester. Given Winner's account, what\nkind of optimism can a single person hope for in a society that seems already politically and\ntechnologically determined?\n\nDonald MacKenzie's essay offers a partial solution to the pessimism resulting from an\nincreasingly abstract and politicized definition of technology. He reminds us that technologies\ntake on different meanings and have different effects depending on who is using them and why,\nand so we must see technical decisions as choices made in a particular time and place, not\ninevitabilities of some natural evolution of \"technological progress.\" We can use Winner's\nquestion \"Best for whom?\" to understand technological change in a more complicated way. To\n\ntake one example, we can point to the nineteenth-century advent of clock time as a marvelous\ninnovation that allowed railroads to run according to schedule and carry freight and passengers\nthrough space at unheard-of speeds. But a technology that was best for railroad companies and\ntheir clients in the mid-nineteenth-century was hardly best for industrial factory workers in cities\nafter the Civil War. In such places, foremen used the clock to control the pace and rhythms of\nwork on the shop floor, thereby taking away the control workers once had over their own labor.\nMacKenzie's essay suggests that the real significance of technology is not as an abstract concept\nbut rather in the multiple technologies that exist for each social group of users in daily life.\nMacKenzie's users have power in the choices that they make about supercomputers and\nmicrochip density, for example, and thus his view of technology strikes me as more socially\nconstructed than politically determined (and far more optimistic than Winner's). It seems that\nwe can make choices about technology, according to MacKenzie, and that those choices do\nmatter in the long run.\n\nSo as I think about the various rationales for a kind of technological optimism and\npessimism, I am still left with a big question about the values we attach to the concept of\ntechnology. It is easy to see that technology is more than piles of nuts and bolts and wires, just\nas it is more than an intellectual construct handed down from Enlightenment thought. But it is\nhard to see exactly what it is in terms of human values, ethics, and morality. Historian of\ntechnology Melvin Kranzberg famously said that \"technology is neither good nor bad, nor is it\nneutral.\" What, then, is technology, and how are we to make sense of Kranzberg's paradoxical\nlaw? What might it mean to substitute the word \"humans\" for \"technology\" in Kranzberg's\nsentence? How do we understand our own responsibilities and obligations when we make\ndecisions about new technologies?"
    },
    {
      "category": "Resource",
      "title": "02_13.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-001-technology-in-american-history-spring-2006/e1c2a55b8329905eccfc6f8c17117bb4_02_13.pdf",
      "content": "STS.001\nProf. Merritt Roe Smith"
    },
    {
      "category": "Resource",
      "title": "02_15.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-001-technology-in-american-history-spring-2006/583017afec3257ddf2eea8bb8dc81fa8_02_15.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "02_21_gunsmith.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-001-technology-in-american-history-spring-2006/1878730bfa7a1b96460571a8bfd00c71_02_21_gunsmith.pdf",
      "content": "STS.001\nProf. Merritt Roe Smith"
    },
    {
      "category": "Resource",
      "title": "02_21.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-001-technology-in-american-history-spring-2006/59c34a97d9160ad02a0d93b8a97b394d_02_21.pdf",
      "content": "STS.001\nProf. Merritt Roe Smith"
    },
    {
      "category": "Resource",
      "title": "02_27.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-001-technology-in-american-history-spring-2006/f625b9e38df5142a2d753caccf902721_02_27.pdf",
      "content": "Lecture #5 Outline\nSTS.001\n\nA REVOLUTIONARY AGE:\n\nPOLITICS AND EARLY AMERICAN INDUSTRIALIZATION\n\nc. 1783-1815\n\nI.\nHow revolutionary is the industrial revolution?\n\nII.\nPolitical timeline:\n1620s-1770s - the \"colonial period\" of American history\n1763 - French & Indian War ends; Britain at peak of its\n\ncolonial power but deeply in debt\n1760s-70s - post-war time of troubles as American colonies\n\nprotest British taxation without representation\n1775 - 1st shot fired at Lexington-Concord\n1776 - Declaration of Independence\n1776-1781 - Revolutionary war years\n1781 - Articles of Confederation = 1st U.S. constitution\n1783 - Treaty of Paris: Britain acknowledges U.S.\n\nindependence\n1783-88 - Social and political turmoil: recession, rebellion,\n\nreaction\n1787 - Constitutional convention at Philadelphia\n1788 - U.S. Constitution adopted by 9th state (N.H.),\n\nthus putting the new U.S. government in motion\n1789 - George Washington inaugurated as 1st president of\n\nthe U.S.\nIII.\nQuestion: How did the U.S. go about weaning itself from the British\nEmpire and solidifying its independence?\nPolitical independence intimately connected with economic\nindependence\nIV.\nTwo sources of economic growth\na. Government policy\ni. Inventing the corporation, 1780s\n1. Example: The Potowmack Company (1784)\n\nii. Federal government policy:\n1. U.S. Patent Office established (1790)\n2. U.S. Post Office established (1792)\n3. Alexander Hamilton's three reports (1790-91)\na. Funding the national debt and assuming state\ndebts\n\nb. Establishing a national bank (1791)\nc. Subsidizing home manufacturing (Dec. 1791)\n\n4. Albert Gallatin's Report on Public Roads and Canals\n(1808)\n\nNote the implication: under Hamilton and Gallatin, the federal government was fully\nprepared to underwrite new industries and construct a national transportation system. In\ndoing so, they establish an important precedent that involves the federal government as\nan early venture capitalist, an investor and developer of new technologies.\nGOVERNMENT IN/GOVERNMENT OUT\n\nb. Another important source of economic growth in the new republic\nwas, of course, private enterprise and the technological innovations\nthat spring from it.\n\nExamples:\n\n1784 - American merchants and the China trade\n1786 - Oliver Evans' automated mill\n1789 - Samuel Slater's textile spinning mill at Pawtucket, R.I.\n1794 - Eli Whitney's cotton gin\n1807 - the Embargo Act and its implications\n1813 - Francis Cabot Lowell, the \"Boston Associates\" and the Boston\n\nManufacturing Co. at Waltham, MA."
    },
    {
      "category": "Resource",
      "title": "03_01.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-001-technology-in-american-history-spring-2006/25acc10510715c2a8a22a384ebe0c06d_03_01.pdf",
      "content": "STS.001\n\nSTATE-SPONSORED ENTERPRISE:\n\nTHE DEVELOPMENT OF INTERCHANGEABLE MANUFACTURING\nIN THE FIREARMS INDUSTRY, 1815-1851\n\nA. Introduction: the four leading sectors of American industrialization, c. 1790-\n1850: textiles, steamboats, firearms, and high speed printing/communications\n\nB. Challenging the \"textile paradigm\"\n\nC. The London Crystal Palace Exhibition (1851)\n\nD. The British Parliamentary \"Committee on the Machinery of the United\nStates of America\" (1854-55)\n\n1. Where the committee visited\n\n2. What it had to say about the textile and steam engine industries\n\n3. What it had to say about the Springfield Armory, Robbins & Lawrence,\n\nand the American firearms/machine tool industry\n\n4. Origins of the term \"American system of manufactures\" (1854)\n\nE. How did the \"American system\" come into being?\n\n1. Thomas Jefferson and the \"French connection\"\n\n2. Maj. Louis Tousard and other French engineers in America, 1790s-1800s\n\n3. The legend of Eli Whitney and interchangeable parts, 1798-1809\n\n4. The true origins of interchangeable manufacturing in America\n\na. Simeon North, Middletown, CT: horseman's pistols (1816)\n\nb. John H. Hall, Harpers Ferry Armory, VA: Hall rifles\n\nc. Hall and North produce interchangeable Hall rifles, 1832\n\nd. Springfield Armory and the U.S. Model 1842 musket, 1844-54\n\ne. Harpers Ferry Armory and the U.S. Model 1841 rifle, 1841-54\n\nf. the Model 1851 Colt revolver\n\ng. the Sharps rifle, c. 1851-1856\n\nAll the above firearms were made with functionally interchangeable parts -\nsomething which greatly appealed to the British committee in 1854\n\nF. What were the larger implications of the 'American system'?\n\n1. Arms industry morphs into commercial machine tool industry\n\nExample: Robbins & Lawrence to Jones & Lamson, Springfield, VT\n\nRobbins & Lawrence to Brown & Sharpe, Providence,\n\nR.I.\n\nColt to Pratt & Whitney, Hartford, CT\n\n2. Arms making technology (\"armory practice\") applied to other\n\ntechnically-related products:\n\nExamples: sewing machines\n\n--Wheeler & Wilson (Bridgeport, CT)//Colt & Springfield\n\nArmory connections, 1857+\n\n--Willcox & Gibbs (Providence, RI)//Brown & Sharpe,\n\nRobbins & Lawrence, Springfield Armory, Colt\n\nconnections, 1858+\n\nExample: The Sharps Rifle/Weed Sewing Machine/Columbia Bicycle,\n\nMotorcycle, and auto connections (Hartford, CT. 1855-\n\n1890s)\n\nCONCLUSIONS:\n\n1. \"Armory practice\" and technological convergence\n\n2. \"Armory practice\" and the origins of the machine tool industry\n\n3. The army's patent policy: Springfield's 'open door' policy and\n\ntechnological convergence\n\n4. Connection between the \"American system\" and Fordist mass production\n\n5. Military enterprise and the role of the state in developing the \"American\n\nsystem\""
    },
    {
      "category": "Resource",
      "title": "03_06.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-001-technology-in-american-history-spring-2006/fdaca684f799f0dcc4e749e668631546_03_06.pdf",
      "content": "Lecture Outline\nSTS.001\n\nSOCIAL & POLITICAL IMPLICATIONS OF THE NEW TECHNOLOGY\n\nA. Thomas Carlyle's \"Signs of the Times\" (1829)\n\nB. Five components of the \"Mechanical Age\"\n\na. Uniformity and standardization\nb. Work becomes more regimented\nc. Speed\nd. Time-orientation\ne. The idea of progress\n\nC. Conclusion: these ideas form essential elements of what is now referred to as\n\"modernity,\" the modern world view of things.\n\nD. Questions:\n\na. Did mechanization deskill workers?\ni. Workers no longer own their own tools (see Smith and\nClancey, pp. 182-83)\nii. See McGaw's argument in S&C, p. 160\n\nb. Were workers \"anti-technology\"? (cf. S&C, p. 162)\n\nc. What accounts for the absence of class consciousness in the Berkshire\npaper industry as opposed to its presence at Lowell and Harpers\nFerry? (see S&C, pp. 151, 162-63, 184)\n\nd. Was \"quitting\" or \"leaving\" a form of worker protest? --\"to better\nmyself\" (cf. pp. 159 and pp. 148-50)\n\ne. What about gender differences?\n\ni. Women's work and women's pay (cf. p. 152 [re. Waltham}; p.\n166 [re. Berkshires])\nii. Working conditions in the Berkshire Mills versus those in\nLowell?"
    },
    {
      "category": "Resource",
      "title": "03_08.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-001-technology-in-american-history-spring-2006/ca4ee2f3a93bada7ee72a6dc0016234d_03_08.pdf",
      "content": "Lecture Outline\nSTS.001\n\nTHE TRANSPORTATION REVOLUTION\n\nc. 1815-1860\n\nA. Ralph Waldo Emerson on \"The Superstitions of Our Age\"\n\nThe fear of Catholicism\nThe fear of pauperism\nThe fear of immigration\nThe fear of manufacturing interests\nThe fear of radical democracy\nAnd faith in the steam engine\n\nEmerson, Journals (Aug. 1847)\n\nB. The politics of \"internal improvement,\" 1815-1845\na. Albert Gallatin's Report (1808) calls for a federally-supported\nnational system of roads and canals\nb. The Madison Platform/Henry Clay's \"American System\" (1816+)\nc. John C. Calhoun and the Bonus Bill (1817): \"Let us conquer\nspace....\"\nd. The General Survey Act (1824-1840) assigns U.S. Army engineers to\nsurvey and initiate construction on numerous canals and nearly 50\nrailroads\ne. Example: Major George Washington Whistler's work on the\nBaltimore & Ohio Railroad (c. 1827-29)\n\nC. Elements of the Transportation Revolution [see Cowan, chap. 5]\na. Roads\ni. The Lancaster Pike (1792)\nii. The National/Cumberland Road (1808+)\n\nb. Steamboats\ni. Fulton's Clermont (1807)\nii. Steamboats on western rivers: Fulton, Shreve, et al. (1811+)\niii. Steamboats and steam engine building\n1. Oliver Evans' Mars Works, Phila. (1806)\n2. George Evans' Pittsburgh Steam Engine Co. (1812)\n3. James P. Allaire's works in New York, a Fulton protege\n(1806)\n4. \"Schools\" for mechanics/engineers: Joseph Harrison\n[see Cowan, pp. 74-76]\n\nc. Canals\ni. The Powtowmack Co. (1785) and corporate capital\nii. The Erie Canal (1825) and state financing\n\nd. Railroads\ni. Early \"connective\" railroads:\n1. The Boston & Lowell (1830)\n2. The Boston & Worster (1830-31)\n3. The Charleston & Hamburg (1830)\n4. The Philadelphia, Wilmington & Baltimore (1838)\n\nii. \"Anthracite roads\":\n1. The Delaware & Hudson (1828)\n2. The Reading (1830s)\n\niii. Trunk line railroads:\n1. The Baltimore & Ohio (1828+)\n2. The Camden & Amboy/Pennsylvania (1832+)\n3. The New York & Erie\n4. The New York Central\n5. The Boston & Albany\n\nD. The Hardware:\na. Fulton's Hudson River fleet\nb. The western river steamboat, 1811+ [see Cowan, pp. 108-10]\nc. British transfers: \"Planet class\" locomotives\ni. Whistler and the Lowell Machine Shop, c. 1834-37\nd. Joseph Harrison's Hercules (1837) and the classic \"American style\"\n4:4:0 locomotive\ne. Harrison in Russia (1842-1852): The St. Petersburg & Moscow\nRailroad (an early transfer of American technology to Europe)\n\nE. Railroads and the rise of modern management\na. Alfred Chandler's \"Visible Hand\" thesis (1977)\nb. The role of army engineers in the rise of modern management\ni. Accidents/managerial responses (e.g. Whistler on Western RR,\nc. 1840)\nii. Bookkeeping and accounting practices\niii. The West Point connection\n\nF. Railroads and literary imagination [see Smith & Clancey, pp. 191ff.]\na. Emily Dickinson's \"The Railway Train\"\nb. Daniel Webster's speech at opening of Northern Railroad at Lebanon,\nNew Hampshire, 1847"
    },
    {
      "category": "Resource",
      "title": "03_13.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-001-technology-in-american-history-spring-2006/9703e06e38659c9fdd5967e1adcb66ff_03_13.pdf",
      "content": "Lecture outline\nSTS.001\n\nART AND THE INDUSTRIAL REVOLUTION\n\nA. \"The Progress of the Age\"\n\n1. Daniel Webster's speech at Lebanon, N.H. (Nov. 1847)\n2. Emily Dickinson's poem, \"The Railway Train\"\n3. Currier & Ives' lithograph, \"Across the Continent: Westward the\nCourse of Empire Takes Its Way\" (1968)\n4. John Gast's painting, \"American Progress\" (1872)\n\nB. Technology and democracy\n1. Horace Greeley (1853)\n2. Alexis de Tocqueville (1831)\n3. Thomas Low Nichols (c. 1860)\n\nC. \"The Machine in the Garden\"\n\n1. American landscape art: The Hudson River School\ni. Thomas Cole, \"View on the Catskill, Early Autumn\" (1837)\nii. Thomas Cole, \"River in the Catskills\" (1843)\niii. Asher B. Durand, \"Progress\" (1853)\niv. George Innes, \"Lackawanna Valley\" (1855)\nv. Jasper Francis Cropsey, \"Starrucca Viaduct\" (1865)\nvi. Thomas Melrose, \"Westward the Star of Empire Takes Its\nWay\" (1865)\nvii. Thomas Rossiter, \"Opening the Wilderness\" (1872)\n\n2. American literature:\ni. James Fenimore Cooper's \"Leatherstocking Tales\" (1823-41)\nii. Washington Irving's short stories\niii. \"Transcendentalists\"\n1. Ralph Waldo Emerson, \"Nature\" (1836)\n2. Henry David Thoreau, Walden (1854)\n3. Nathaniel Hawthorne, \"The Celestial Railroad\"\n(1846)\n4. Herman Melville, Moby Dick (1851)\n\n3. Popular literature and the \"prophets of progress\"\ni. Henry Howe's Memoirs of the Most Eminent American\nMechanics (1841)\nii. Denison Olmsted, Memoir of Eli Whitney, Esq. (1846)\n\nD. Technology and Nationalism\n1. National symbols:\ni. American eagle\nii. Indian princess\niii. \"Columbia\"/ Lady Liberty"
    },
    {
      "category": "Resource",
      "title": "03_20.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-001-technology-in-american-history-spring-2006/4666a0cbd2db35de91e56377680bb33f_03_20.pdf",
      "content": "LECTURE OUTLINE: Technology, Civil War, and the War's Larger Implications\nA. The Civil War (1861-1865) as a great divide in American history that results in the\nrise of \"modern\" America\nB. What was different about the Civil War compared with other wars?\n--an industrially-based war that witnessed the mass production of many things:\n--mass transportation (esp. railroads/steamboats)\n--the Civil War as a railroad war\n\n--Telegraphy\n--Firearms and the spread of the \"uniformity system\" to other areas of\n\nmanufacturing:\n\nExamples:\n\n***Textiles (uniforms, shirts, socks, tents, blankets, etc.)\n***Boots and shoes of standard sizes\n\n***Wagons and wheeled vehicles\n\n***Food products: canned goods\nC. \"A Deadly Affair\"\na. Even though Union troops were the best equipped in history, many died:\n620,000 soldiers die [360K feds; 260K Confederates] Two out of three\ndie of disease\n500,000 wounded, 75,000 of whom later die of their wounds\nc.50,000 civilians (mostly Southerners) die as a direct result of war\nTotal war = ~750,000\nb. The great battlefield killer: rifled firearms\n--1st Manassas (July 1861): Casualties: c.3,000 (North), c.2,000 (South)\n--Shiloh (Mar. 1862): each side has more than 1,700 killed/8,000 wounded\n--Antietam (Sept. 1862): Casualties: 11,000/2108 killed (North);\n13,000/2,700 killed (South)\n--Fredericksburg (Dec. 1862): Casualties: 12,600/1,284 killed (North); c.\n5,000/595 killed (South)\n--Gettysburg (July 1863): Casualties: 23,000/3,153 killed (North);\n27,000/3,903 killed (South). CSA losses on 3rd day = 50%\n--Wilderness to Petersburg (May-June 1863): Casualties: 64,000 (North);\n30,000 (South)\n--Total casualties on both sides, 1861-65 = 1,095,000\n\nc. Civil war medicine: battlefield surgery\nD. Larger implications/impact of the Civil War\n1. Postwar \"take-off\" in economic growth:\n\"Between 1870 and 1920, the United States changed in ways that the founders\ncould have never dreamed possible. Under the conditions of industrialization...\npeople became linked together in large, complex networks that are...both\nphysical and social: technological systems.\" (Cowan, p. 149)\n2. When did people begin thinking seriously about technological/managerial\nsystems?\n--John C. Calhoun and the War Dept.'s uniformity system\n(1817+)\n--John McLean and the Post Office (1820s)\n\n--the spread of the factory system: Springfield (1820s)\n\n--the \"Lowell system\" (1820s+)\n\n--the transportation system, esp. railroads after 1828\n(remember the General Survey Act of 1824 and its import)\n3. System thinking and large systems building does not become pervasive until\nafter the Civil War\nSee Cowan, chap. 7 on:\n--The telegraph system (note the role of govt. subvention in building the\nfirst telegraph line between Baltimore and Washington, 1844-45)\n\n--The railway system:\n--between 1850 and 1871, the federal govt. turns over 131 million\nacres of land to subsidize the construction of 19,000 of privately owned\nrailroads.\n\n--Railroad mileage: 30,000 (1860); 35,000 miles (1865); 93,000\n(1880); 164,000 (1890); 254,000 (1916)\n--The spread of other systems after the Civil War:\n***Petroleum (Rockefeller and Standard Oil)\n\n***The Bell telephone system\n***The electric power system (Edison)\n\nINDUSTRIAL FALLOUTS/IMPLICATIONS OF THE CIVIL WAR:\nQUESTION: What role did the war play in the spread of systemic thinking and what is\nknown as \"the rise of big business\" c. 1865-1890?\n--The war introduced hundreds of thousands to experience of working in large\nhierarchical organizations: the army and the navy\n--working in large wartime organizations had a learning-by-doing effect: it\nprovided a model for budding entrepreneurs to follow;\n--and prepared them for the passage from preindustrial/agrarian society to a full-\nfledged industrial society\nSOME EXAMPLES OF THE TRANSITION:\n--the spread of time-keeping and time-consciousness with access to cheap\ntimepieces [example: Waltham watches]\n--the spread of standardized manufacturing methods from firearms to uniforms to\nrailway track gauges.\n--the trend toward large projects: e.g. the transcontinental railroad (1869)\n--the cultivation of global markets: e.g. the postwar international arms trade\n--growing concerns about the management of large-scale enterprises, esp. the\nmanagement of workers under increasingly competitive/industrialized conditions\n***trade unions and strikes: e.g. 1877\n***Frederick W. Taylor and the rise of \"scientific management\"\n--the problem of \"soldiering\" or pacing;\n--Early attempts to control pacing:\n\n***Lt. Daniel Tyler @ Springfield (1829-31)\n\n***Lammot du Pont (1870s)\n***Lt. Henry Metcalfe @ Frankford Arsenal (1870s-80s)\n***Henry R. Towne of Yale & Towne Lock Co. (1880s)\n--Taylor delivers his first paper to ASME (1895)\n***Taylor publishes his most important work, SHOP\nMANAGEMENT, as well as a more popular version of his management\nsystem, THE PRINCIPLES OF SCIENTIFIC MANAGEMENT, in 1911."
    },
    {
      "category": "Resource",
      "title": "celestial_rlrd.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-001-technology-in-american-history-spring-2006/b6f0a0d39c5126f7d62ed8757e774a8a_celestial_rlrd.pdf",
      "content": "NATHANIEL HAWTHORNE'S \"THE CELESTIAL RAILROAD\"\n\nThis short story was published by Nathaniel Hawthorne in 1852 in a book\ncalled The Snow Image and Other Twice-Told Tales. Hawthorne, the greatest American\nauthor of the 19th century, cast \"The Celestial Railroad\" in the form of one of the classic\nworks of prose in the English language, John Bunyan's The Pilgrim's Progress.\n\nJohn Bunyan (1628-1688) was an English Puritan preacher and author. He wrote\nmuch of Pilgrim's Progress while imprisoned for his refusal to accommodate himself to\nthe official Anglicanism of the years following the restoration of the Stuarts at the close\nof the Puritan Revolution and the rule of Oliver Cromwell.\n\nPilgrim's Progress is an elaborate religious allegory in which the protagonist,\nChristian, abandons his life in the City of Destruction and sets out on a long, arduous\njourney, determined to reach the Celestial City. He travels by foot, bearing a heavy\nburden (emblematic of original sin) on his back. He passes through the Slough of\nDespond, escapes the City of Destruction via the Wicket Gate, and endures many\ntemptations to despair of his faith and be diverted from the true route to the Celestial\nCity. Along Christian's journey, on Mr. Worldly-Wiseman tries to dissuade him, and he\nis rescued several times by the stern intervention of Evangelist and Mr. Greatheart, who\nguide the bewildered Christian back on the road to the Celestial City. He overcomes the\ntowering challenge of the Hill of Difficulty, defeats with sword in hand the fiery\nApollyon (the demon of spiritual doubt), passes through the Valley of the Shadow of\nDeath, and stays for a time at the city of Vanity. There Christian visits the bazaars and\ncommercial emporiums of Vanity Fair (modeled on the great summer merchants' fairs of\n17th century England), and there also a companion, Faithful, meets a martyr's end.\n\nUltimately, Christian succeeds in avoiding the fires of Tophet (hell), arriving in\nthe land of Beulah, a pleasant resting place before his passage over the River of Death\nand his entrance into the Celestial City.\n\nThe form of Hawthorne's story presents an updated mid-19th century\nAmerican version of Bunyan's enormously influential and popular tale.\n*\n*\n*\n*\n\nA free version of \"The Celestial Railroad,\" found in Mosses from an Old Manse and Other Stories,\ncan be downloaded from Project Gutenberg at http://www.gutenberg.org/etext/512."
    },
    {
      "category": "Resource",
      "title": "filmreview_tips.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-001-technology-in-american-history-spring-2006/c24f5d07eafe3b8204b197f8aa0f3880_filmreview_tips.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "reviewbooks_ocw.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-001-technology-in-american-history-spring-2006/b61e37367a3784ad595f280998fcdfce_reviewbooks_ocw.pdf",
      "content": "STS.001 : TECHNOLOGY IN AMERICAN HISTORY\n\nSpring 2006\n\nProf. Merritt Roe Smith\n\nLIST OF ACCEPTABLE BOOKS FOR REVIEW\n\nAitken, Hugh G. J., Taylorism at Watertown Arsenal. Princeton, NY: Princeton\nUniversity Press, 1985. A case study of the rise of scientific management. Re-issued in\n1984 under the title Scientific Management in Action.\n\nBiggs, Lindy. The Rational Factory: Architecture, Technology, and Work in\nAmerica's Age of Mass Production. Baltimore, MD: Johns Hopkins University Press,\n1996. About the structures that housed mass production operations like the Ford Motor\nCo.\n\nBruce, Robert V., Alexander Graham Bell and the Conquest of Solitude. New\nYork, NY: Cornell University Press, 1990. A biography.\n\nBuderi, Robert. The Invention that Changed the World. New York, NY: Simon &\nSchuster, 1996. The development of radar.\n\nCampbell-Kelly, Martin, and William Aspray. Computer. New York, NY: Basic\nBooks, 1996. The advent and spread of computer culture since the 1970s.\n\nCochran, Thomas C. Frontiers of Change. New York, NY: Oxford University\nPress, 1983. A business historian's perspective on the early industrial revolution in\nAmerica.\n\nCooper, Gail. Air-Conditioning in America: Engineers and the Controlled\nEnvironment, 1900-1960. Baltimore, MD: Johns Hopkins University Press, 2002.\n\nCowan, Ruth S. More Work for Mother. New York, NY: Basic Books, 1985.\nGender and technology.\n\nCronon, William. Nature's Metropolis: Chicago and the Great West. New York,\nNY: Norton, 1991. How Chicago became the \"metropolis\" of the American West.\n\nDew, Charles. Bond of Iron: Master and Slave at Buffalo Forge. New York, NY:\nNorton, 1995. Slave ironworkers in the Great Valley of Virginia prior to the Civil War.\n\nDowney, Gregory J. Telegraph Messenger Boys: Labor, Technology, and\nGeography, 1850-1950. New York, NY: Routledge, 2002. A geographical study of\ntelegraphic information networks and the laborers who work within them.\n\nDowns, Linda B. Diego Rivera: The Detroit Industry Murals. New York, NY:\nNorton, 1999. How a controversial artist interpreted the advent of mass production in\nDetroit.\n\nDublin, Thomas. Women at Work. 2nd Edition. New York, NY: Columbia\nUniversity Press, 1981. Women textile workers in Lowell prior to the Civil War.\n\nDunlavy, Colleen A. Politics and Industrialization. Princeton, NJ: Princeton\nUniversity Press, 1994. A comparative study of American and German railroads in the\n19th century.\n\nEdwards, Paul N. The Closed World: Computers and the Politics of Discourse in\nCold War America. Cambridge, MA: MIT Press, 1996.\n\nFitzgerald, Deborah K. Every Factory a Farm. New Haven, CT: Yale\nUniversity Press, 2003. The rise of industrial agriculture and the decline of the family\nfarm.\n\nFouche, Rayvon. Black Inventors in an Age of Segregation. Baltimore,\nMD: Johns Hopkins University Press, 2003.\n\nGordon, Robert B., and Patrick M. Malone. The Texture of Industry. New York,\nNY: Oxford University Press, 1994. An important treatment of the material culture and\narcheology of 19th century industry.\n\nHart, David M. Forged Consensus: Science, Technology, and Economic Policy in\nthe United States, 1921-1953. Princeton, N.J: Princeton University Press, 1998.\n\nHeadrick, Daniel. The Tools of Empire. New York, NY: Oxford University Press,\n1981. About European expansion into Africa during the 19th century and the types of\ntechnologies used to forge colonial empires.\n\nHounshell, David A. From the American System to Mass Production. Baltimore,\nMD: Johns Hopkins University Press, 1984. A study of the origins of interchangeable\nmanufacturing and mechanization of industry, culminating with the mass production of\nthe Model T Ford.\n\nHughes, Thomas P. American Genesis. New York, NY: Random House Value\nPublishers, 1989. A general survey of technology in America from the 1870s to the\n1970s. Emphasizes the growth of large systems.\n\nHughes, Thomas P. Rescuring Prometheus. New York, NY: Vintage, 1998. A\nhistory of large engineering projects in the U. S. since World War II - including Boston's\nBig Dig.\n\nHunter, Louis C. Steamboats on Western Rivers. New York, NY: Dover\nPublications, 1994. The definitive work on steamboating on the Ohio and Mississippi\nRivers. Be forewarned, however, it is a big book!\n\nIsenberg, Andrew C. The Destruction of the Bison. Cambridge, UK: Cambridge\nUniversity Press, 2001.\n\nIsrael, Paul. Edison. New York, NY: John Whiley & Sons, 1998. A prize-\nwinning biography.\n\nIsrael, Paul. From Machine Shop to Industrial Laboratory. Baltimore, MD:\nJohns Hopkins University Press, 1992. How research and development in the early\ntelegraph industry became increasingly scientific.\n\nJackson, Kenneth T. Crabgrass Frontier: The Suburbanization of America. New\nYork, NY: Oxford University Press, 1985.\n\nKanigel, Robert. The One Best Way. London, UK: Little Brown Company, 1997.\nBiography of Frederick W. Taylor.\n\nKasson, John F. Civilizing the Machine. New York, NY: Hill & Wang\nPublishers, 1976. Technology and culture in 19th- century America.\n\nKline, Ronald R. Consumers in the Country: Technology and Social Change in\nRural America. Baltimore, Md. : Johns Hopkins University Press, 2000. An important\nanalysis of the complicated rural response to technological change.\n\nLecuyer, Christophe. Making Silicon Valley. Cambridge, MA: MIT Press, 2006.\nThe latest work on Silicon Valley and its origins.\n\nLaurie, Bruce. Artisans into Workers. New York, NY: Hill & Wang Publishers,\n1989. A labor historian's perspective on the changes wrought by the industrial\nrevolution.\n\nLayton, Edwin T. The Revolt of the Engineers. Cleveland, OH: Press of Case\nWestern Reserve University, 1971. Engineers as reformers in early 20th-century America.\n\nLeslie, Stuart W. Boss Kettering. New York, NY: Columbia University Press,\n1983. Biography of the famous inventor of the electric starter, among other things.\n\nLeslie, Stuart W. The Cold War and American Science. New York, NY:\nColumbia University Press, 1993.\n\nLicht, Walter. Working for the Railroad. Princeton, NJ: Princeton University\nPress, 1983. A labor-oriented history.\n\nLucie, Karen. Charles Sheeler and the Cult of the Machine. Cambridge, MA:\nHarvard University Press, 1991. How an early 20th-century artist responded to the\nmachine age.\n\nMarx, Leo. The Machine in the Garden. New York, NY: Oxford University\nPress, 1999. A pathbreaking book about literary responses to technological change in\n19th-century America. First published in 1964, but read the 2000 edition which includes\na new afterword by the author.\n\nMalone, Patrick M. The Skulking Way of War. Lanham, MD: Madison Books,\n1991. How New England Indians adopted firearms and the implications it had for\nwarfare in colonial America.\n\nMarchand, Roland. Advertising the American Dream: Making Way for Modernity,\n1920-1940. Berkeley, CA: University of California Press, 1985.\n\nMcKenzie, Donald. Inventing Accuracy: A Historical Sociology of Nuclear\nMissile Guidance. Cambridge, MA: MIT Press, 1990. The development of missile\nguidance systems at Draper Labs. An important study, and an interesting perspective for\nanyone considering working in the defense industry.\n\nMcElheny, Victor K. Insisting on the Impossible. Cambridge, MA: Perseus\nPublishing, 1998. Biography of Edwin Land, inventor of instant photography and\nfounder of Polaroid.\n\nMcElheny, Victor K. Watson and DNA: Making a Scientific Revolution.\nCambridge, MA. : Perseus Publishing, 2003. About the origins of molecular biology and\nits technological applications.\n\nMcShane, Clay. Down the Asphalt Path. New York, NY: Columbia University\nPress, 1995. Autos in urban America.\n\nMeyer, Stephen. The Five Dollar Day. Albany, NY: State University of New\nYork Press, 1981. About Henry Ford and his controversial labor policies.\n\nMiller, Douglas T. The Birth of Modern America, 1820-1850. New York, NY:\nMacmillan Publishing Company, 1970. A general history of the period that\ncontextualizes early American industrialization.\n\nMindell, David A. War, Technology, and Experience Aboard U.S.S. Monitor.\nBaltimore, Md.: Johns Hopkins University Press, 2000. Designing, operating, and\npopular understanding of the famous Civil War ironclad. A different look at an oft-\ndiscussed subject.\n\nMindell, David A. Between Human and Machine: Feedback, Control, and\nComputing before Cybernetics. Baltimore, MD: Johns Hopkins University Press, 2002.\nA path-breaking history of control systems and their connection with computers.\n\nMisa, Thomas. Nation of Steel: The Making of Modern America, 1865-1925.\nBaltimore, MD: Johns Hopkins University Press, 1995. A very readable history of the\nrise of the steel industry in late 19th-century America.\n\nMowery, David C., and Nathan Rosenberg. Paths of Innovation: Technological\nChange in 20th-Century America. New York, NY: Cambridge University Press, 1998.\nAsking \"what are the lessons for policy makers,\" two economists look at industrial\nresearch and how innovation spreads in the electrical, chemical, and semiconductor\nindustries.\n\nNye, David F. Electrifying America. Cambridge, MA: MIT Press, 1990.\nA social history of electrification.\n\nNye, David F. America as Second Creation. Cambridge, MA: MIT Press, 2003.\nA cultural history of technology that examines narratives of technological change and\ntheir ideological significance.\n\nNeufeld, Michael J. The Rocket and the Reich: Pennemunde and the Coming of\nthe Ballistic Missile Era. New York, NY: Free Press, c1995. The German beginnings\nduring World War II.\n\nOgle, Maureen. All the Modern Conveniences: American Household Plumbing,\n1840-1890. Baltimore, MD: Johns Hopkins University Press, 1996.\n\nPost, Robert C. High Performance. Baltimore, MD: Johns Hopkins University\nPress, 1994. About top fuel drag racing and its technologies.\n\nRhodes, Richard. The Making of the Atomic Bomb. New York, NY: Simon &\nSchuster, 1986. The standard history of the subject.\n\nRoe, Joseph W. English and American Tool Builders. Bradley, IL: Lindsay\nPublications, 1987. The history of machine tools. Originally published in 1916.\n\nRussell, Edmund. War and Nature: Fighting Humans and Insects with Chemicals\nfrom World War I to Silent Spring. New York, NY: Cambridge University Press, 2001.\nAn innovative work about DDT that combines environmental history and military history\nin an analysis of the chemical industry.\n\nSale, Kirkpatrick. The Fire of His Genius: Robert Fulton and the American\nDream. New York, NY: Free Press, 2001. Biography of Robert Fulton, artist and\ninventor.\n\nScharff, Virginia . Taking the Wheel: Women and the Coming of the Motor Age.\nAlbuquerque NM: University of New Mexico Press, 1991.\n\nSherry, Michael. The Rise of American Air Power: The Creation of Armageddon.\nNew Haven, CT: Yale University Press, 1987. Social and military history of the\nAmerican fascination with air bombing leading up to World War II.\n\nSchivelbusch, Wolfgang. The Railway Journey: Trains and Travel in the 19th\nCentury. New York : Urizen Books, 1979\n\nSeely, Bruce. Building the American Highway System. Philadelphia, PA: Temple\nUniversity Press, 1987.\n\nCarol Sheriff, The Artificial River: The Erie Canal and the Paradox of Progress,\n1817-1862. New York, NY: Hill & Wang Publishers, 1996.\n\nSmith, Mark M. Mastered by the Clock: Time, Slavery, and Freedom in the\nAmerican South. Chapel Hill, NC: University of North Carolina Press, 1997. How slave\nmasters attempted to impose time-consciousness among their slaves.\n\nSmith, Merritt Roe. Harpers Ferry Armory and the New Technology. Ithaca,\nN.Y.: Cornell University Press, 1977. The origins of the 'American system' of\nmanufacturing and the responses to it.\n\nSusan Smulyan, Selling Radio. Washington, DC: Smithsonian Insitution Press,\n1994.\n\nSteinberg, Theodore. Nature Incorporated: Industrialization and the Waters of\nNew England. Amherst, MA: University of Massachusetts Press, 1994.An environmental\nhistory of New England's textile industry and its ecological and legal implications.\n\nThompson, Emily. The Soundscapes of Modernity: Architectural Acoustics and\nthe Culture of Listening in America, 1900-1933. Cambridge, MA: MIT Press, 2004.\n\nVander Meulen, Jacob. Building the B-29. Washington, DC: Smithsonian\nInstitution Press, 1995. About the World War II Boeing B-29 bomber, an advanced\naircraft best known for dropping the atomic bombs on Japan.\n\nWaldrop, M. Mitchell . The Dream Machine: J. C. R. Licklider and the\nRevolution that Made Computing Personal. New York, NY: Viking, 2001. How an\nacademic entrepreneur shaped the direction of DARPA's involvement with advanced\ncomputing.\n\nWallace, Anthony F. C. Rockdale: The Growth of an American Village in the\nEarly Industrial Revolution. New York, NY: Knopf, 1978. Historical ethnography of a\ntextile manufacturing community in southeastern Pennsylvania prior to the Civil War.\n\nWhite, John H. Jr., The John Bull. Washington, D.C.: Smithsonian Institution\nPress, 1981. White, a leading student of railroad technology, writes about an early\nBritish-built but American modified steam locomotive that is on exhibit at the\nSmithsonian Institution. Whoever reviews this book should pay a visit to the \"John Bull\"\nat the Smithsonian's National Museum of American History.\n\nWhite, Richard . The Organic Machine: The Remaking of the Columbia River.\nNew York, NY: Hill and Wang, 1996. An environmental history."
    },
    {
      "category": "Resource",
      "title": "american_eng_1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-001-technology-in-american-history-spring-2006/dc219451eea1107fd2669c42426e6612_american_eng_1.pdf",
      "content": "The Navy Roots of American Mechanical Engineering\nPart I - Navy Engineers in the Civil War Era\n\nBrendan Foley\nMassachusetts Institute of Technology\n\nWork in progress -- Do not cite or reproduce\n\nPart I: Engineers in the Civil War Era\nSteam Engineering Required\nThe United States Navy in 1861 was ill prepared for the enormous burdens\nsuddenly placed upon it by the outbreak of Civil War. The fleet was very small, and\nboasted few steamships. Most of the Navy's thirty-nine steamers were deep draft vessels,\nintended for sailing alone in the open ocean instead of near shore. The largest, heaviest\narmed, and most advanced American steam warships of the pre-war era still carried masts\nand yards for full sail power. They were designed for two missions: worldwide cruising\nto show the flag, or in the event of war with Britain, guerre de course. The strategic and\ntactical mindset of the Navy was mired in commerce raiding at sea, coupled with the\noccasional ship-to-ship duel.1\nSecession of the Southern states changed the Navy's strategic and tactical\npositions. Instead of global cruising, the Union's ships would patrol almost exclusively in\nNorth American waters. For the blockade strategy to be effective, squadrons of men-o'-\nwar had to hover outside Southern ports for extended periods. The North needed steamers\nto intercept steam-powered blockade runners; sailing warships would have been\ninadequate. Armored steamers, dreamt about by naval officers for a generation, would\nhave to be built to reduce Southern forts. The Union Navy also had to gain control of the\nmajor rivers in the Confederacy's interior. Steam ships were vital there, too, since vessels\ndependent on the wind could not navigate up and down rivers. The essential ingredient\nfor the North's economic warfare was a large fleet of dependable steam powered\nwarships.2\n\nReliance on steam plants brought increases in the numbers and importance of\nNavy steam engineers. An 1862 administrative reshuffling highlighted this new\nemphasis. The Navy split engineering from its former home as a division in the Bureau of\nEquipment and Repairs, and elevated it to Bureau status. At the head of the newly created\nBureau of Steam Engineering and each of the other seven Bureaus sat a chief,\nadministering operations. This was a major departure from the social traditions of the\nNavy. Until 1862, combat officers always overshadowed technically expert officers.\nCombat officers formed the \"line,\" and had the authority to command ships, guns, and\nmen at sea. Technical officers were part of the \"staff,\" and were not held in high esteem\nby line officers. Staff officers had never been allowed authority over line officers, even if\nthey nominally outranked them. Now, however, a staff officer from engineering would be\na Bureau chief. This meant new prestige and authority, ranking an engineer with the fleet-\ncommanding commodores. Commodore was the highest rank in the Navy until the\nintroduction of admiral grades in 1862.3\nThe new Chief of the Bureau of Steam Engineering would wield enormous\npower. The government budgeted tens of millions of dollars for steamers, and decisions\nhad to be made quickly as to the types of vessels, power plants, and boilers purchased or\nbuilt by the Navy. The Chief of the Bureau of Steam Engineering was responsible for the\ndesign, construction, and repair of all the Navy's steam machinery. In March 1861, long-\nserving Navy engineer Benjamin Franklin Isherwood became the first Chief of the\nBureau of Steam Engineering.4\nIn many ways Isherwood was ideally suited to be Bureau chief. He had combat\nexperience in the Mexican War (1846-48), one of only eight engineers still in the Navy\n\nwho saw action in that conflict.5 He spent years at sea, running the engines of various\nships and gaining a wide range of operational experience. That practical knowledge\ncomplemented a personal encyclopedia of engine performance data he had amassed in the\n1850s. Isherwood instituted a series of scientific experiments in those pre-war years,\ngathering empirical data on different fuels, engine designs, and steam expansion. These\nexperiments girded his comprehension of thermodynamics. In 1861 Isherwood's\njudgment was critical to implementing the wartime blockade strategy, for he understood\nbetter than anyone else the requirements for Navy steam engines.\nSpeed of Union warships was one factor in engine design, but engine reliability\nand durability became Isherwood's overriding concerns. He recognized that Navy\nengines had to withstand the abuse of wartime operations. The blockade required long\nweeks on station with banked fires under the boilers, ready to provide steam whenever\nlookouts spotted a blockade runner. Constant operation took a toll on machinery, causing\nbreakdowns that diminished combat readiness. Another hazard was the inadvertent\nneglect of the volunteer engineers aboard ship. With scores of steamers added to the fleet\neach month after March 1861, the Navy put into uniform hundreds of civilian engine\ndrivers. Many of these men were not familiar with the plants in their charge.6 The\nEngineer-in-Chief took all of these factors into consideration when selecting engines for\nthe fleet.\nEngine designs originating on the Engineer-in-Chief's drawing table were\ncharacterized by heavily constructed primary components to make them robust. He also\nsimplified where he could; Isherwood's designs were less complicated than commercial\nengines. One critical simplification was in the degree of steam expansion used in the\n\nFigure 12 - Isherwood's engines for the sloop-of-war Hassalo. The engines were simple,\nreliable, and compact. At Dickerson's behest, an 1865 congressional panel investigated\nIsherwood, his designs, and the Bureau of Steam Engineering in general. It returned a\nreport stating Isherwood's engines provided a great increase in speed and power over\nany others. Further, the panel concluded that his philosophy of long steam cut-off was\ntheoretically sound and experimentally proven.\nImage Source: Engineering (21 September 1866), p. 208\n\ncylinders. Relying on his results from a series of 1858 engine experiments, Isherwood\ndecided not to use steam expansively. He held that a short steam cutoff did not result in\nfuel savings great enough to justify the added expense and complication of a patent cutoff\nvalve. The chief designed his compact engines to be set low in the hulls of the ships, as\nfar out of the way of enemy shot as possible. With these considerations, he settled on a\nstandard for Navy screw war steamers: a horizontal back-acting engine with steam cut off\nat 7/10 of the piston stroke.7\n\nExpert Knowledge: Dickerson v. Isherwood\nAs the Navy purchased long cutoff engines at Isherwood's behest, proponents of the short\ncutoff trumpeted that he was wasting public funds on inefficient engines.8 The most\nvociferous of Isherwood's critics was civilian Edward N. Dickerson, a New York lawyer-\ncum-engine-designer who applied political influence to win an 1858 engine contract for\nthe Navy sloop, Pensacola. The lawyer was an aggravating thorn in the side of the\nEngineer-in-Chief, as Dickerson launched a dispute over steam engine design that ran\nlonger than any of his engines.\nDickerson claimed expertise in steam engineering, but his track record suggested\notherwise. His production pace for Pensacola's machinery was nearly three times slower\nthan any other engine builder then working for the Navy. Much of the delay resulted from\nDickerson's continual design changes through the construction process. Redesigns forced\nfollow-on changes in the vessel's interior layout and hull, slowing the entire project.\nWhen finally delivered late in 1861, Dickerson's engines were much larger and heavier\nthan specified in the contract. Pensacola's displacement was fixed, so heavier than\n\nexpected engines entailed a reduction in weight elsewhere. The easiest way around the\nproblem was to diminish the amount of coal carried on board. The ship's coal bunker\nspace was cut by half, curtailing its steaming endurance and range. Operationally, this\nmeant that Pensacola could maintain its blockade duty for only half the originally\nenvisioned duration before leaving station to refuel. This was bad enough, but other\nproblems with the engines soon became apparent. The ship never attained its contract\nspeed, and the engines broke down completely after only two voyages.9\n\nFigure 13 - Dickerson's engine for U.S.S. Pensacola, described as \"bewildering\" by Navy\nengineer Frank Bennett. Unlike the comparatively simple long-cutoff back acting engine designed\nas a standard by the Bureau of Steam Engineering, Dickerson's entire engine and the short cutoff\nmechanism in particular were complicated and prone to breakdown. Source: Rice, \"Marine\nEngines,\" H.R. Report No. 8 (30 January 1865), 38th Congress, 2d Session, pp. 26-28.\nImage: Naval Historical Center.\nThe inadequacies of Dickerson's design were easily discerned as Pensacola sat\nidle and crippled at the dock. Disgusted, Isherwood denounced the engines to Secretary\nof the Navy Gideon Welles. In one official report, the chief termed the engines \"absurd\ncreations of ignorance\" and Dickerson's theories \"the conclusions of a charlatan.\"10\n\nIsherwood typically used heated rhetoric when he criticized the work of engineering\namateurs. In this case, the engineer met his match when it came to abusive language.\nDickerson defended his design by publishing vicious personal attacks aimed at\nIsherwood. In a letter to the New York Times written under the pseudonym Vindex, the\nNew York lawyer railed that Navy engines were \"a national disgrace.\" He accused\nIsherwood of being an \"engine driver,\" raised beyond his station by wheedling political\nfavors from Abraham Lincoln.11 In a public letter to Gideon Welles, Dickerson dismissed\nIsherwood's experimental data as \"nonsense in rows of figures,\" and ridiculed the Navy\nman's conclusions about the expansion of steam as \"profound ignorance.\" As for the\nengine designs emanating from Isherwood's office, Dickerson termed them \"ridiculous,\"\n\"worthless,\" and \"vastly inferior to their predecessors, and practically useless.\" 12 Pride\nwas one reason for Dickerson's vigorous defense, but he had even more pressing\nconcerns.\nPrior to and early in the war, engine contracts seemed promising opportunities for\nfinancial gain. Dickerson wanted more lucrative government jobs. He used his political\nconnections to win the bid for two other power plants, to be installed in Algonquin and\nIdaho. The lawyer's prewar Washington contacts eroded after secession, however. He\nhad been closely allied with two member of the Naval Affairs committee, Senator Yulee\nand chairman Stephen Mallory, both from Florida. The pair of congressmen went south\nin 1861, and Mallory accepted Jefferson Davis' offer to be Confederate Secretary of the\nNavy.13 Given his close prewar ties with Stephen Mallory, Dickerson had every reason to\nfear being branded disloyal. By claiming that the Bureau of Steam Engineering was not\nperforming well for the Union, Dickerson deflected criticism of his own loyalties.\n\nAlways a theatrical orator in the courtroom, Dickerson was equally entertaining in\nhis attacks on Isherwood. He accused the Engineer-in-Chief of \"childish ignorance\" and\nin reference to the long cutoff, ridiculously averred that Isherwood did not comprehend\nbasic physical properties and engineering principles. Secretary Welles regarded\nDickerson's complaints as \"the vilest misrepresentations and fabrications that could well\n\nFigure 14 - An illustration from \"Uncle Sam's Whistle\" depicting Dickerson catching pennies\nfrom heaven in the form of government engine contracts. He sits on a throne of oil dash-pots, in\nwhich he collects the money falling from above. He uses Isherwood's published engineering texts\nas a footstool. Watt and Mariotte look down on him, and the \"gentle breeze of fame\" pushes him\nthrough the clouds. Source: \"Uncle Sam's Whistle,\" pp. 12-13.\n\nbe gathered together.\" He believed the accusations against Isherwood to be \"wholly\nunjustifiable and inexcusable.\" However, the lawyer made his complaints very public. He\nwent so far as to claim that Isherwood forced contractors to provide kickbacks to him.\nAccusations of corruption in the Bureau of Steam Engineering made good press and\nDickerson's newspaper friends played along by airing his views. With the lever of public\n\nnotice, Dickerson used his remaining contacts in Washington to force the Committee on\nNaval Affairs to launch an investigation of the Bureau of Steam Engineering.14\nDickerson's attacks forced the Engineer-in-Chief to protect himself and his\nBureau. In 1863 Isherwood attempted to discredit the lawyer's short cutoff argument by\ncollecting more engine performance data. Under Isherwood's orders Navy engineers\ntested several types of engines and noted the benefits, drawbacks, and relative efficiency\nof each variety. The results of these trials were published in a two volume series,\nExperimental Researches in Steam Engineering.\nIn the preface to those volumes, Isherwood argued that knowledge of the physical\nlaws of steam was too imperfect to allow confident application of descriptive\nmathematics. To state this another way, thermodynamic theory was not well enough\nunderstood to apply calculus to design effectively. Only by \"honest sagacious\nexperiment, long and frequently repeated\" could true knowledge be distilled: he needed\nempirical evidence to compare against theory. Isherwood fully expected his experimental\nevidence to be subject to counterattack by Dickerson and other supporters of the high-\nexpansion theory, but accepted that as a burden concomitant with his position as an\nengineering reformer.15 Under Isherwood, Navy engineers conducted an extensive series\nof practical experiments to ascertain the true physical properties of operational steam\nengines. The experiments showed conclusively that the theoretical gains of short cutoffs\nwere offset during normal operation by an increase in condensation in the cylinder, which\nreduced the engine's power.\nDespite the experimental results obtained by Navy engineers, the dispute between\nDickerson and the Engineer-in-Chief dragged on interminably. Dickerson continued to\n\ndenigrate Isherwood and Navy engine designs, and his political connections in\nWashington and financial links in New York helped him win engine contracts for four\nvessels during the war. Was Dickerson correct in his engineering opinions?\nThe evidence is against Dickerson. Just after the war, the respected British\njournal, Engineering, reported on a competition between Isherwood and Dickerson\nengines. The paddlewheel steamer Winooski was equipped with Isherwood engines, while\nthe identical ship Algonquin was fitted with a Dickerson design. The two ships sat side-\nby-side at the dock, ready to engage in a head-to-head competition under actual working\nconditions. The engineers started the machinery during dock trials, and immediately\nDickerson's engine broke down. Extensive repairs were necessary to ready it for another\nattempt. This was embarrassing enough for Dickerson, but things got worse. The engine\nwas poorly balanced, leaving Algonquin's port paddlewheel immersed nearly four feet\ndeeper than its starboard companion. This absurd situation was corrected temporarily\nonly by stowing 73 tons of ballast on Algonquin's deck. The message was clear:\nDickerson's machinery was a failure, and the Navy rejected it.16 Yet even this\ndemonstration combined with operational experience and a large body of scientifically\ncollected experimental data could not silence Dickerson's public assaults on Isherwood.\nAn 1865 congressional investigation into the replacement of Dickerson's\nPensacola engines with Isherwood designs vindicated the Engineer-in-Chief. The\nCommittee on Naval Affairs studied ships' deck logs, engine room steam logs, and repair\nrecords from the Bureau of Construction and Repair. The committee concluded that\ndespite Dickerson's claims to the contrary, Navy engines were more robust and\neconomical than others, and that ships powered with them were faster than those driven\n\nwith civilian designs. Further, the committee noted that the long cutoff of Isherwood's\nengines was very close to the accepted British practice for marine engines. Dickerson had\nposited that Navy engines' long cutoff was an engineering aberration, but the committee\nshowed that Dickerson's short cutoff diverged from common practice to a far greater\nextent.17\nEven with the support of Welles and the favorable results of the 1865\ninvestigation, Isherwood was never quite able to stifle Dickerson's criticism. This was\nonly one front in the battle he and the engineers fought for mechanical engineering\nauthority and professional prestige. The long cutoff dispute gave birth to a new\nmovement among Navy engineers. In the postwar period they began a long siege to\nestablish sole possession of expert mechanical engineering knowledge. They needed to\norganize a sequential program to gain this expert knowledge, for some very visible\nwartime problems called into question their supposed expertise.\n\nAlban Stimers and the Light Drafts\nThe most damaging wartime Navy engineering debacle was the complete failure\nof the Union's shallow water ironclad program. Deeply involved with the project was\nUnion Chief Engineer Alban Stimers. He joined the Navy as an engineer in 1849 and\nworked his way through the ranks to Chief Engineer by 1858. Soon after the Civil War\nbroke out, the Navy assigned Stimers to supervise construction of John Ericsson's\nironclad, Monitor. Stimers served aboard that ship when it dueled the Confederate\nironclad Virginia, taking charge of the gunnery division in the turret after the Executive\nOfficer left it to relieve the injured captain on the bridge.18 Stimers' behavior on this and\n\nother occasions made him a great favorite of Assistant Secretary of the Navy Gustavus\nFox, who became a powerful patron for the engineer.\nStimers' wartime duties and a close association with Ericsson made the Navy\nengineer an enthusiastic advocate of the monitor-style ironclad. A monitor craze swept\nthe Navy and nation after the engagement with Virginia, and production of a variety of\nthe type became a top priority. Chief Engineer Stimers had no formal training in\nshipbuilding, but he had overseen aspects of the Stevens Battery and original Monitor\nconstruction. After the national press reported his performance at Hampton Roads, he\nwas a public figure, and Gustavus Fox selected him to oversee the highly visible\nconstruction of the light drafts. The subsequent travails of the light draft monitor program\nbrought into sharp relief the limits of Navy engineering.19\nStimers' project ultimately foundered on a variety of rocks. In 1863 the nation's\nindustrial machine was still maturing. Wartime production in weapons, railroad\nlocomotives, and other iron-intensive goods increased demand for labor and iron far\nabove available supply. Another problem with the light draft monitor program occurred\nin the design process. Alban Stimers redesigned throughout the construction process,\nslowing construction and increasing costs.20\nAdditional problems saddled the light draft program. Stimers had sole authority\nover the design and construction process, with no oversight from higher-ups. When the\nChief Engineer launched his first long overdue and over budget monitor hull, he was\ndismayed to learn that he and his assistants had quite literally miscalculated. The vessel\nwas supposed to sit in the water with fifteen inches of freeboard, the distance between the\nwater's surface and the top of the deck. Instead, the bow sat about seven inches out of the\n\nwater, and the stern was two or three inches below the surface. When all requisite\nequipment and stores were put aboard the ships, the entire class of vessels designed and\nbuilt under Stimers' guidance simply would not float. At the base of the problem was an\nerror in a lengthy but straightforward hydrostatic calculation.21 If Stimers and his Navy\nengineer assistants had accurately predicted the mass and displacement of the finished\nship and its machinery, all other problems would likely have been forgiven. Instead, the\nNavy Department was left in 1865 with a very public multimillion-dollar humiliation.\nThe light drafts and Stimers became laughingstocks for a bitter Congress.22\nThe light draft monitor debacle and the continuing dispute between Isherwood\nand Dickerson pointed out shortcomings in the training of the Navy's engineer corps.\nThese difficulties forced the Navy's leaders to recognize the need for theoretically and\nscientifically educated, practically skilled men to design and operate the fleet's technical\nsystems. When the war ended in 1865, the Naval Academy returned to Annapolis from its\nwartime home in Rhode Island. The next year the Navy moved toward rectifying the\nsituation in its engineering corps.23\n\nPostwar Engineering at Annapolis, 1866-69: Fixing the Engineer Corps\nSteam engineering education for all midshipmen was the highest priority for the\nAcademy under its first postwar superintendent, Vice Admiral David Dixon Porter. In his\n1866 report to the Secretary of the Navy he commented on the large appropriation for\nAnnapolis' new Department of Steam Engineering. Porter spent the $20,000 allocation to\nput up a new building and equip it with \"a beautiful propeller engine\" designed by\nIsherwood. The admiral was complimentary to Isherwood, and termed the engine \"a\n\nmonument to the skill and perseverance of the engineer-in-chief.\" In a reference to the\ndispute between Isherwood and Dickerson, Porter averred that this was the best type of\nengine available, \"although efforts have been made to bring it into discredit.\" The\nengineering building also held classrooms and laboratories; henceforth all midshipmen\nwould undergo \"a full theoretical and practical course of steam\" during their four years at\nthe Academy.24\nContemporary ideas about the Academy's curriculum can be further discerned by\nthe report of the 1866 Board of Visitors. All but one of the members approved of the new\nprominence of engineering in cadet training. The Board deemed engineering knowledge\n\"indispensable for the efficiency of a naval officer\" and ranked it second only to\nseamanship in importance. The Visitors were of the opinion that every midshipman at the\nAcademy needed practical steam training and \"should understand the construction of\nsteam machinery, and the methods of using, repairing, and preserving it.\"\nCongress and the Navy recognized that practical knowledge of steam engines was\nrequisite for the next generation of line officers, but Navy engineers needed a deeper\ntheoretical understanding of their subject. Unsure how best to achieve this, in 1866 the\nAcademy introduced an experimental curriculum. The strategy for this program was to\ntake men already competent in the science and theory of engineering and enhance their\nknowledge with an additional two years of study, combined with practical operational\nexperience with engines. The Navy recruited this group of men from leading scientific\nschools: Harvard, Yale, Rensselaer Polytechnic Institute and a few other colleges. About\nfifty engineering students responded to the Navy's posted advertisements for steam\nengineers. They submitted to a competitive exam at Annapolis, and the top sixteen\n\naccepted the Navy's offer to enter a two-year program in steam engineering. These men\nhad earned engineering bachelor's degrees already: the Annapolis program would be\ngraduate education for them.25\nThe originator and chief proponent of this plan was Benjamin Isherwood. He\noutlined his idea in a report to Welles in early 1866, then actively encouraged it as part of\nhis drive for increased rank for engineers. In his annual report for 1866 he wrote,\n\"...elevating the status of the corps...[and] making first and second assistant engineers\ncommissioned officers, renders it practicable to now obtain for the lower grades the\ngraduates of the first scientific schools of the country.\"26\nGideon Welles also saw value in a scientific corps of naval engineers. In his\nannual report for 1866, he noted that \"the gross loss, delay, and embarrassments\nexperienced during the war in consequence of the ignorance, inefficiency, and\nincompetency of many of the engineers, admonish the government of the necessity of\neducating and training men of ability to this highly responsible profession.\" This was a\ndirect reference to Alban Stimers' light draft debacle. Welles continued that the cadet\nengineers would form a \"highly scientific and useful class, indispensable to the service\nand more useful, perhaps, in the design and construction of engines than in duty afloat.\"27\nThe Academy's new course of study achieved this while simultaneously setting a national\nprecedent for engineering education.\nThe 1866 Annapolis curriculum differed from that offered at contemporary\nAmerican technical and scientific universities. Technical education was in its early\nadolescence at the time of the Civil War. While West Point and a handful of established\ncolleges convened courses in civil engineering, mechanical engineering education was\n\nrooted in shop culture. The three best respected American colleges offering engineering\ncurricula were Rensselaer Polytechnic Institute, Lawrence Scientific School at Harvard,\nand the Sheffield Scientific School at Yale.28 Only RPI differentiated among branches of\nengineering. It offered tailored programs for mechanical, civil, and mining, but the four\nRPI graduates entering the Naval Academy engineering program in 1866 earned their\ndegrees in Civil Engineering.29\nThe classes taught in the Engineering division of RPI in 1865-66 provide the\nbenchmark for mechanical engineering education of the time. The nineteen students of\nthat year's senior class had studied for four years in the civil engineering program. In\ntheir first year, they undertook algebra and geometry, natural philosophy (physics),\ngeodesy and drawing. More algebra, geometry, physics, and drawing followed in the\nsecond year. Subjects in their penultimate year included calculus, electricity, chemistry,\nand more geodesy. They also studied mechanics of both solids and fluids. Building on the\nnatural philosophy presented in the first year, professors taught the physics of acoustics\nand optics in year three. In the final year at RPI, more solid and fluid mechanics, more\nchemistry and drawing, machine theory, and geology rounded out the civil engineering\ncourse. The course in mechanical engineering program was identical to it, with two\nexceptions: machine drawing replaced construction drawing, and a class on the\nconstruction of machines and their placement was substituted for road engineering.30 In\n1866, the RPI course was the standard against which all others were judged.\nIn contrast, the engineering course at Harvard's Lawrence Scientific School\nvaried a great deal from Rensselaer's. Unlike the four-year RPI engineering curriculum,\nHarvard conferred a Bachelor of Science degree after one year of instruction. Often men\n\nleft the school without completing the requirements for the degree, studying only a few\nsubjects before departing.\nThe Naval Academy inaugurated a rigorous program in response to the\ninadequacies of engineering curricula offered at civilian institutions. Annapolis drew\nsixteen engineers in 1866 from the best technical schools in the country. The men's\nperformance on the admissions test demonstrated their mastery of integral and\ndifferential calculus, so this group did not study those subjects at the Academy. Though\nalready proficient at the drafting table, the men expanded their skills with pen and ink by\npracticing mechanical drawing. Plans and estimates for the construction of boilers and\nengines, iron ships, and mill works were other areas of study. The Navy instilled practical\nskills in iron ship-building to correct the shortcomings made apparent by the light draft\ndebacle.31\nThe engineers at the Academy also focused attention on management of\nmachinery, consisting of practical exercises with steam engines and boilers. This\nexperience was vital to the engine-driving roles they would fulfill as Third and Second\nAssistant Engineers aboard ship. Once joining the fleet, the engineers would also\ncommand the fire room. Their course in Chemistry acquainted them with lubricating oils,\ncoals and fuels, and ores. Additional practical exercises included working with hand tools\nin wood and metals shops.32\nOn the theoretical side, the men studied physics, particularly steam and heat. An\nextensive course in mechanics covered engines and motors. The Annapolis program\nbolstered the standard practical and theoretical education acquired by the 1866 engineer\nclass in civilian institutions, but in one critical way it was not simply more of the same. In\n\na significant contribution to engineering education, in 1867 the Naval Academy\nintroduced thermodynamics into the theoretical training of American engineers.33\nYears earlier Benjamin Isherwood had pointed out mechanical engineers' woeful\nincomprehension of thermodynamic theory: this was the root of his fight with Dickerson.\nThe engineering students who entered Annapolis after the war studied thermodynamics to\ncorrect this. The first and second laws of thermodynamics had been proposed one and\ntwo decades prior respectively. The Annapolis curriculum's distinct sections on\nthermodynamics set the Naval Academy program apart from all others in the country.\nThe new curriculum served as a model for other schools: in 1870 the premier civilian\ntechnical institution, RPI, added thermodynamics to its engineering courses.34 With the\nfoundation of calculus and descriptive mathematics in place and an understanding of\nthermodynamics, Annapolis-trained mechanical engineers in the late 1860s possessed the\nmost advanced theoretical engineering education in the nation.\nWhile education of naval officers improved, social and professional relations\nbetween Navy engineers and line officers became more and more of a problem in the\nyears immediately after the war. Although Naval Regulations prohibited officers from\npublishing anything \"having in view the praise or excuses of any person in the naval\nservice,\"35 officers refused to be gagged. Anonymous articles featuring the invective of\nboth sides appeared regularly in the pages of the Army and Navy Journal, New York\nTimes, and New York Tribune throughout the late 1860s. The tensions between officers of\nthe line and staff would nearly consume the Navy in the following years. Evidence that it\naffected the 1868 engineers is found in their subsequent careers. Within one year in the\n\nfleet, a quarter of the graduating 1868 class of \"indispensable\" engineers resigned from\nthe Navy.36\nConclusions\n\nThe Civil War illustrated in high relief the shortcomings of the Navy's steam\nengineering. Alban Stimer's failed light draft monitor efforts were an example of a\nflawed administrative system more than anything. Stimers' patron, Assistant Secretary of\nthe Navy Gustavus Fox, had placed him in a position for which he was not qualified.\nStimers was not a naval constructor, and the demands of the task exceeded his\nprofessional abilities. Construction of the complete vessel was a systems engineering\nproject, but such holistic approaches to technical programs were far in the future.\n\nAfter the war, the Navy's budget shrank, officers and men left the service in\ndroves, and Congress forced a reduction in the number of ships to prewar levels. It seems\ncontradictory to this policy of retrenchment for the Naval Academy to have recruited a\nnew group of engineers in 1866. The explanation is that Gideon Welles and Benjamin\nIsherwood retained enough power to carry through on the idea, which was originally\nproposed by the Bureau chief. The two men saw in the plan a way to pre-empt future\nengineering difficulties like those experienced during the Civil War.\nBenjamin Isherwood's problem during the conflict was an inability to close the\ndebate with Dickerson over expert knowledge. The Navy engineer was armed with reams\nof experimental data and the proof of reliable steamers blockading the Confederacy, but\ncriticism of his engines continued throughout the war and after. Dickerson's power lay\nnot in his own engineering capabilities, but in his political, financial, and press\n\nconnections. Saddled with an enormous engineering and administrative workload,\nIsherwood could not devote enough attention to quelling the cries of his main detractor.\nIn 1866 Gideon Welles, Isherwood, Porter, and other high-ranking naval officers and\nadministrators cooperated to remedy some problems in the technical training of officers.\nThe curriculum changes effected at the Naval Academy in 1866 were direct responses to\nthe light draft disgrace and the debate over thermodynamic theory. Welles probably was\nthe most high-minded of the triumvirate. His writings show that his support for the new\ncurriculum was based on the long-term best interests of the Navy and nation. Isherwood\nwas self-interested; he wanted increased rank and prestige for engineers. By attracting\nbright, well educated engineers to the Navy, he could achieve that end. Porter probably\nbelieved that by increasing cadet midshipmen's education in steam engineering, he could\nall but eliminate technically expert engineer officers from ships. In Porter's mind the\nideal naval officer was a warrior, not an engineer.\n\n1 George Henry Preble, Complete List of the Vessels of the United States Navy from 1797 to 1874\n(Washington, D.C.: Government Printing Office, 1874), p. 4; Harold Sprout and Margaret Sprout, The Rise\nof American Naval Power, 1776-1918 (Annapolis: Naval Institute Press, 1990. Originally published 1939),\npp. 178-179; K. Jack Bauer, \"Naval Shipbuilding Programs 1794-1860,\" Military Affairs Vol. 29 No. 1\n(Spring 1965), pp. 38-39.\n2 Karl Lautenschlager, \"Technology and the Evolution of Naval Warfare,\" International Security Vol. 8\nNo. 2 (Autumn 1982), pp. 8-9.\n3 Report of the Secretary of the Navy, With an Appendix, containing Reports from Officers. December,\n1862. (Washington, D.C.: Government Printing Office, 1863), pp. 39, 45; Paullin, Paullin's History, pp.\n260-261.\n4 Edward Sloan, Benjamin Franklin Isherwood Naval Engineer: The Years as Engineer in Chief, 1861-69\n(Annapolis: United States Naval Institute, 1965) pp. 46, 83.\n5 Combat veteran engineer data compiled from Frank M. Bennett, The Steam Navy of the United States: A\nHistory of the Growth of the Steam Vessel of War in the U.S. Navy, and of the Naval Engineer Corps\n(Originally published Pittsburgh: W.T. Nicholson Press, 1896; reprinted Westport, CT: Greenwood Press,\n1974), Appendix A, and Lewis Randolph Hamersly, The Records of Living Officers of the U.S. Navy and\nMarine Corps Compiled From Official Sources, Fourth Edition (Philadelphia: L.R. Hamersly & Co.,\n1890).\n6 Benjamin Isherwood, \"Report of the Bureau of Steam Engineering,\" in Report of the Secretary of the\nNavy 1864 (Washington, D.C.: Government Printing Office, 1864), p. 1095; James M. McPherson and\nPatricia R. McPherson (eds.), Lamson of the Gettysburg: The Civil War Letters of Lieutenant Roswell H.\nLamson, U.S. Navy (New York: Oxford University Press, 1997), p. 23; Sprout and Sprout, The Rise of\nAmerican Naval Power, pp. 180-181 (fn).\n7 Sloan, Isherwood, pp. 14, 33, 41, 89; A.H. Rice, \"Marine Engines\" House of Representatives 38th\nCongress, 2nd Session, Report No. 8, p. 17.\n8 See Sloan's clear and concise discussion of Isherwood's decision process on the steam cutoff. Sloan,\nIsherwood, pp. 82-96.\n9 Sloan, Isherwood, pp. 106-107; \"Letter of the Secretary of the Navy, Communicating, In answer to a\nresolution of the Senate of the 15th of January, information in relation to the war steamers Ossipee and\nPensacola,\" (23 February 1863) Senate Executive Document No. 45, 37th Congress 3rd Session, pp. 4-8.\n10 Isherwood, \"Report to Welles\" (17 February 1863) Senate Ex. Doc. No. 45, p. 6.\n11 Vindex, \"Letter to the Editor,\" New York Times (29 December 1862).\n12 Edward N. Dickerson, The Steam Navy of the United States: Its Past, Present, and Future. A Letter to the\nHon. Gideon Welles, Secretary of the Navy, From Edward N. Dickerson, of New York (New York: John A.\nGray, 1863), pp. 5, 7, 9.\n13 Sloan, Isherwood, pp. 45, 106; Craig L. Symonds, Confederate Admiral: The Life and Wars of Franklin\nBuchanan (Annapolis: Naval Institute Press, 1999), pp. 117, 146; Isherwood, \"Report to Welles\" Senate\nEx. Doc. No. 45, p. 4.\n14 Dickerson, The Steam Navy of the United States, pp. 3-4; Gideon Welles, Diary of Gideon Welles,\nSecretary of the Navy under Lincoln and Johnson, Vol. I-III: 1861-March 30, 1869 (Boston and New York:\nHoughton Mifflin Co., 1911), v. 1, p. 50. For examples of the long continuation of Dickerson's derogatory\nviews of Isherwood expressed in newspapers, see \"Letter to the Editor,\" New York Times (29 December\n1862); \"Naval Engineering\" New York Times (1 January 1866), p. 5; \"Naval Engineering\" New York\nTimes (8 January 1866), p. 2; \"Naval Engineering\" New York Times (22 January 1866), p. 2; \"Reform and\nReconstruction in the Navy\" New York Times (29 November 1869), p. 4.\n15 Benjamin Franklin Isherwood, Experimental Researches in Steam Engineering Vol. I (Philadelphia:\n1863), pp. xv, xxv. One of Dickerson's counterattacks came in the form of a speech made during a court\ncase. The resulting published document runs to 80 pages. See Edward N. Dickerson, The Navy of the\nUnited States. An Exposure of its Condition and the Causes of its Failure, etc. (New York: John A. Gray\nand Green, 1864). Ultimately Isherwood replaced Dickerson's Pensacola design with low-expansion\nengines, and the ship served faithfully until 1912.\n\n16 Engineering, v. 1 (March 23, 1866): 183; Report of the Secretary of the Navy with an Appendix\nContaining Bureau Reports, Etc. December, 1866 (Washington, D.C.: Government Printing Office, 1866),\np. 41.\n17 Rice, \"Marine Engines\" H. R. Rep. No. 8, 38th Congress 2nd Session, pp. 32, 38; Congressional Globe (6\nFebruary 1865), 38th Congress 2nd Session, p. 621.\n18 Monte Calvert, The Mechanical Engineer in America, 1830-1910 (Baltimore: The Johns\nHopkins Press, 1967), p. 252; Bennett, Steam Navy, Appendix A; Alban C. Stimers, \"Chief Engineer\nStimer's [sic] Report,\" Report of the Secretary of the Navy in Relation to Armored Vessels (Washington,\nD.C.: Government Printing Office, 1864), p. 21.\n19 Roberts, Civil War Ironclads, p. 206. \"Light draft\" is the maritime terminology for vessels that draw a\nsmall amount; that is, vessels that are submerged only a few feet below the waterline. Light draft usually\ndecreases a ship's stability, so most ocean-going vessels are deep draft.\n20 Roberts, Civil War Ironclads, pp. 59-60, 66-68, 134.\n21 Roberts, Civil War Ironclads, pp. 159, 161.\n22 See comments by Senator Hale, Congressional Globe (30 January 1865), p. 491. Hale got the chamber\nlaughing by his criticism of the light drafts and those associated with it, particularly Asst. Navy Sec. Fox.\n23 Report of the Secretary of the Navy 1866, p. 33.\n24 Report of the Secretary of the Navy 1866, p. 75.\n25 Report of the Secretary of the Navy, 1866, pp. 33, 82; Bennett, Steam Navy, pp. 665-666.\n26 Report of the Secretary of the Navy, 1866, pp. 178-179.\n27 Report of the Secretary of the Navy 1866, pp. 33.\n28 Charles Riborg Mann, A Study of Engineering Education Prepared for the Joint Committee on\nEngineering Education of the National Engineering Societies - Bulletin No. 11 of the Carnegie Foundation\nfor the Advancement of Teaching (New York: 1918), pp. 4-6.\n29 The RPI graduates were John Q.A. Ford, Charles Rae, Holland Stevenson, and Francis Trevor. Source:\nAnnual Register of the Rensselaer Polytechnic Institute 1866, p. 13.\n30 Annual Register of RPI 1866, pp. 24-26.\n31 Letter, \"Welles to Porter,\" (14 February 1867) RG 405 Letters Received by the Superintendent, 1865-67:\nBox 9, Folder 11. Annual Register of the United States Naval Academy at Annapolis, MD., for the\nAcademic Year 1867-68 (Washington, D.C.: Government Printing Office, 1867), pp. 37, 41; Annual\nRegister of the United States Naval Academy at Annapolis, MD., for the Academic Year 1868-69\n(Washington, D.C.: Government Printing Office, 1968), pp. 40, 43. Calculus remained part of the USNA\nCadet Engineer course. C.P. Howell, the sole remaining participant in that program, studied calculus in the\nfirst term of his second year.\nIn addition to Yale, Harvard, and RPI, some other schools contributed men to the class of Acting Third\nAssistant Engineers. Charles Bray studied Civil Engineering at Brown prior to his admission at Annapolis.\nSource: Orren Henry Smith (ed.), The Tufts College Graduate: A Quarterly Magazine Published by the\nAlumni Association Vol. 28 (September 1919 - August 1920), p. 121.\n32 Register of the Naval Academy 1867-68, p. 41; Register of the Naval Academy 1868-69, p. 43.\n33 Register of the Naval Academy 1867-68, p. 41; Register of the Naval Academy 1868-69, p. 43.\n34 Annual Register of the Rensselaer Polytechnic Institute, Troy, N.Y., for the Academical Year 1870-71\n(Troy, NY: Wm. H. Young and Blake, 1871), p. 23.\nCourse catalogs for the other leading technical institution, Massachusetts Institute of Technology, are not\nextant in MIT Archives. The earliest Mechanical Engineering course catalogs date to 1892, when\nthermodynamics was well established at MIT.\n35 George M. Robeson, \"Circular,\" (12 March, 1870) General Orders and Circulars Issued by the Navy\nDepartment From 1863 to 1887 (Washington: Government Printing Office, 1887), p. 96.\n36 The four men who resigned in 1869 were Frank Symmes, Charles Bray, Theron Skeel, Francis Trevor."
    },
    {
      "category": "Resource",
      "title": "american_eng_2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-001-technology-in-american-history-spring-2006/390e2a2bca13267d4ec66307fea6ca77_american_eng_2.pdf",
      "content": "The Navy Roots of American Mechanical Engineering\nPart II - The Spread of Engineering After the Civil War\n\nBrendan Foley\nMassachusetts Institute of Technology\n\nWork in progress -- Do not cite or reproduce\n\nPart II - The Spread of Navy Engineering After the Civil War\n\nBy the 1870s, Annapolis engineering graduates possessed a unique education.\nUpon a foundation of science and mathematics, they built experience in practical design\nand operation of machinery. Their grasp of the theoretical underpinnings of their field\nplaced them at the forefront of mechanical engineering in America. These men were\nprimed for technical careers.\n\nHowever, Navy career prospects were dim for young engineering officers. The\nnumber of ships in the fleet declined, reducing the availability of billets for all officers.\nOlder line officers claimed that the Academy produced an overabundance of engineers,\nand recommended cutting their numbers. The line convinced Congress to pass anti-\nengineer legislation. These actions caused the line-staff controversy to flare again, and\nthe rivalry continued to fester throughout the end of the century. The 1882 Naval\nAcademy amalgamation of midshipmen and engineers could have been the foundation\nfor a unified corps of officers. However, it failed to alleviate tension among junior\nofficers, and the prejudices of senior men remained virulent.\nThe engineers responded in a variety of ways. Some of them persevered in the\nNavy. Others left the service to join industry. Most significantly, a group of officers\nadvocated for legislation that allowed them to become professors at civilian universities.\nThe men so detailed over the next decade were responsible for transferring the Naval\nAcademy engineering pedagogy to the nation.\nIn 1878, engineers in the Bureau of Steam Engineering responded to shrinking\nprospects in the fleet by summoning support in Congress. They drafted a short bill, called\n\"An act to promote the knowledge of steam engineering and iron ship-building among the\n\nBrendan Foley\nSTS.001 Spring 2005\nWork in progress - do not cite or reproduce\n\nscientific schools or colleges of America.\" The bill proposed that up to twenty-five\nofficers be posted annually as engineering instructors to technical schools, and it was\npassed into law in February, 1879.1\nThe bill's Navy proponents followed the lead of a few engineers who had already\nleft the service for academia. The best-known example among these men was Robert\nThurston. As a result of the turmoil within the shrinking Navy in the late 1860s, First\nAssistant Engineer Thurston vacated his position at the Academy as Assistant Instructor\nin Natural and Experimental Philosophy. He resigned in 1871 to assume an engineering\nprofessorship at the newly-founded Stevens Institute of Technology in Hoboken, New\nJersey. After fourteen years at Hoboken, Thurston moved to Cornell University in 1885.2\nRobert Thurston resigned from the Navy to pursue an academic career. Other\nengineers still on active duty had an even larger impact on the development of American\nengineering. Several details of active-duty Navy engineers to universities across the\ncountry resulted from the 1879 law. Lafayette College in Easton, Pennsylvania was the\nfirst school to see an active-duty Navy engineer. That engineer spent two years at the\ninstitution, 1879-1881. When his duty ended, the Navy instructor program gained\nmomentum with four additional details. Union College in Schenectady, New York and\nthe Franklin Institute in Philadelphia received Navy engineers. The University of\nPennsylvania welcomed engineer Henry Spangler. The final instructor assignment for the\nyear was Assistant Engineer Mortimer Cooley, sent to the University of Michigan.3\nThrough these men and others soon to follow, the Navy made a lasting mark on the\ndevelopment of American mechanical engineering practice.\n\nBrendan Foley\nSTS.001 Spring 2005\nWork in progress - do not cite or reproduce\n\nMortimer Cooley's path to the private sector was similar to many of his fellow\nengineering officers. He rapidly became disenchanted with the Navy after graduating\nfrom Annapolis, partly due to the Navy's delay in granting his commission. Cooley\ncomplained in 1881 that his promotion examination was a year overdue. The added\nprestige of being a commissioned officer was surely one reason Cooley desired the\npromotion, but there were 700 other reasons. As a graduated Cadet Engineer, Cooley's\nsea-duty salary was $1000; after his promotion to Assistant Engineer, the salary would\nincrease to $1700. The engineer was married soon after graduation, and his wife gave\nbirth to a daughter during the engineer's second post-graduate cruise in 1880. Supporting\na family on $1000 per year was hard to do, and it became even more difficult when he\nwas detached from his ship and ordered to the Bureau of Steam Engineering. Cooley's\nshore duty pay was only $800 as a Cadet Engineer, but would be $1400 once his\ncommission came through.4\nIn May 1881, Cooley finally received orders to report for his promotion\nexamination in Philadelphia. He passed handily, and returned to Washington. His\ncommission followed in June, finding him engaged in shore duty at the Bureau. His work\nthere was not related to engineering, however; he spent the hot summer months re-\norganizing the department's old personnel records. Writing to his brother, Lyman Cooley,\nhe tried to put a brave face on his dissatisfaction, \"It is not the duty I wish, but until I\nsecure that, of course I can or ought to rest satisfied with what is given me. I am no better\npleased with the service than ever, but the favorable day for resigning has not yet come.\"5\n\nBrendan Foley\nSTS.001 Spring 2005\nWork in progress - do not cite or reproduce\n\nFigure 25 - Assistant Engineer Mortimer Cooley, circa 1882, just before he reported for duty as\nprofessor of mechanical engineering at the University of Michigan. Image: Bentley Historical\nLibrary, University of Michigan.\n\nThe assignment Cooley wished for was an expected transfer to the Bureau of\nSteam Engineering's drafting room, where he could practice the skills honed at the\nAcademy. Instead, he was ordered to assist the Bureau of Ordnance in casting a bronze\nstatue of Admiral Farragut.6 In response to this disappointment, Cooley sought better\nduty away from Washington and the fleet: a billet at a college under the 1879 law.\nIn July 1881, Cooley's brother, Lyman, wrote to Professor Charles Greene at\nUniversity of Michigan, explaining to him the \"red-tape of the method\" to win the\nassignment for Mortimer. Greene was to convince the university president to write a\nletter to Secretary of the Navy William Hunt, who would refer the matter to William\nShock, Chief of the Bureau of Steam Engineering. If all went well, Shock would then\norder an engineer to the university. Cooley told Greene that a particular officer could be\n\nBrendan Foley\nSTS.001 Spring 2005\nWork in progress - do not cite or reproduce\n\nrequested for the detail, and that he hoped his brother would be favorably considered.7\nPatronage and personal connections were critical to engineers seeking university billets.\nIn Cooley's case, the transfer went smoothly. In less than one month, Cooley\nreceived orders from Secretary Hunt, detaching him from the Bureau of Steam\nEngineering and sending him to Ann Arbor. Immediately, Michigan's acting president,\nHenry Frieze, wrote an excited letter to the engineer. Frieze felt Cooley's presence was\n\"of vital importance to the successful opening of the new course of engineering study.\"\nThe university already had small programs in Civil and Mining Engineering; a new\ncourse in Mechanical would complete the Engineering school.8 The university president\ninformed Cooley that all studies in Mechanical, Steam, and Ship Building Engineering\nwould be under the Navy man's personal direction. Cooley was charged with laying out\nand organizing the plan of classes, the selection of all textbooks, and establishing\nrequisite shops for practical work. He would be responsible for creating a new academic\nprogram.\nThe opportunity spread before Cooley must have been exciting, but daunting.\nFrom the University of Pennsylvania, Henry Spangler informed Cooley that the task at\nMichigan was \"too much work entirely for any one man.\" However, Cooley was not\ncompletely alone. He was connected to a wide network of competent men: his friends in\nthe Navy engineer corps.9\nCooley solicited advice from his colleagues at both the Bureau of Steam\nEngineering and the Naval Academy. From the Bureau in Washington, one Passed\nAssistant Engineer provided a list of suitable articles and textbooks for the Michigan\nstudents to read. That engineer closed his letter with encouraging words: \"I shall take\n\nBrendan Foley\nSTS.001 Spring 2005\nWork in progress - do not cite or reproduce\n\ngreat pleasure in assisting you in every way possible, and I am sure Mr. [Chief Engineer]\nShock feels in the same way.\" Other engineering officers voiced similar sentiments; they,\ntoo, buttressed their good wishes with helpful material. The two longest-serving\nAnnapolis steam engineering instructors offered course outlines and classwork ideas for\nCooley to follow. Passed Assistant Engineer Asa Mattice, described by his peers as \"the\nsmartest number of the Engineer Corps,\" also offered help. Mattice was busy preparing\nfor his third year as an engineering instructor at the Academy, but promised to send\ncopies of lectures from Annapolis.10\nCooley's professional network extended to the men enjoying instructor details at\nthe other schools. Henry Spangler shared his experiences at Pennsylvania with his former\nclassmate at the start of the 1881 academic year. That school offered a diverse\nengineering course, with 171 students enrolled in 1882. Spangler's position was in the\nspecial \"Dynamical Engineering\" branch, where Spangler joined two other engineering\nprofessors to instruct two dozen students. In his first year as a professor, Spangler's\nteaching load was limited to classes in Marine Engineering and Naval Architecture.11\nTeaching was a skill Spangler had not yet mastered. After his initial day of\nlecturing to the students in ship building, he dashed off a letter to Cooley. Embarrassed,\nhe told his friend that he had made \"one grand blunder,\" and he hoped his letter would\nsave Cooley from a similar mistake. Spangler had assumed his students knew more than\nthey actually did, and the pace of his introductory lecture was far too fast. \"I find my\nboys wonderfully ignorant,\" he intimated to Cooley, then related his plan for educating\nthe various classes of students. After lecturing on ship stability to the senior class, he\nplanned to have them take up thermodynamics, followed by the design of ships'\n\nBrendan Foley\nSTS.001 Spring 2005\nWork in progress - do not cite or reproduce\n\nmachinery. The juniors would study mechanics and practical work, including two visits\nto industrial shops per week. The day after the shop tours, Spangler intended to lead\nrecitation discussions of what the students saw.12 The shop tours were similar to those\nundertaken during the Annapolis practice cruises. Spangler's mix of theoretical\ninstruction and practical experience at Penn directly mirrored the pedagogy of the Naval\nAcademy.\nCooley digested all of the information and suggestions arriving in the post from\nhis friends, then designed the new Michigan mechanical engineering curriculum. He\nknew that 1881-82 would be a building year, not given to convening all of the courses\nnecessary to an aspiring mechanical engineer. The university's course in mechanical\nengineering, originally codified in 1868 but dropped in 1872, had been re-instituted. It\ncontained many of the now-standard technical foundation classes: geometry,\ntrigonometry, calculus, and drawing. Surveying the incoming class, Cooley concluded\nthat they were not properly prepared for the most advanced courses he could teach:\nthermodynamics and naval architecture. He also concluded that due to a lack of facilities,\nmechanical laboratory work was out of reach for the first year.13\nCooley wanted to provide his students with practical experience as soon as\npossible. He drew on his own experience of Annapolis summer practice cruises and\nSpangler's report of shop tours. Beginning in the winter of 1881-82 he campaigned with\nindustries in the region, arranging visits to shops and manufacturing establishments.14\nIndustrial tours were only one aspect of Cooley's master plan. He wanted to erect\nan engineering laboratory on campus for his students. Informed by the president that a\n$2500 state allocation was available, Cooley went to work. He contracted for the erection\n\nBrendan Foley\nSTS.001 Spring 2005\nWork in progress - do not cite or reproduce\n\nof a small building, then spent the remaining funds on an engine and tools for the shop.\nNot satisfied with the meager supply of practical instruction material afforded under the\nallocation, he filled his letterbook with inquiries to manufacturing establishments and\nmachine shops around the country. Cooley asked firms to donate examples of their\nproducts for the instruction of his students. In exchange, the professor offered to test\nequipment and provide assessments of the apparatus donated.15\nBy the end of Cooley's first year he had generated impressive results. Not only\nwas the new laboratory building ready, but dozens of firms had responded to his requests\nwith donated apparatus. From Schenectady, Westinghouse Air Brake Company sent a\ncomplete air brake outfit, valued at $500. Boston's American Steam Gauge Company\nsent engine indicators and gauges; Deane Steam Pump Co. in Holyoke, Massachusetts\nprovided a steam pump in section. Several other firms made less expensive but\nsignificant donations.16\nThe largess of American manufacturing firms continued the next year. William\nSellers and Co., Nathan Manufacturing Co., and L. Schutte and Co. each shipped a\nvariety of locomotive injector; Henry Worthington contributed a steam water pump and\nmeter, worth $250. The total value of the apparatus accumulated by Cooley in his first\nfew years was nearly $1300. By 1884, Cooley had filled the new engineering laboratory,\nand required more space. The university agreed to move the carpenters' shop to a\nposition abutting the engineering lab, and convert it to Cooley's use.17 Michigan students\nlearned engineering in the Navy tradition, a unique combination of theoretical and basic\nscientific knowledge, and practical training in the shop.\n\nBrendan Foley\nSTS.001 Spring 2005\nWork in progress - do not cite or reproduce\n\nFigure 26 - University of Michigan Mechanical Engineering Laboratory buildings, circa 1885.\nWhen Cooley arrived in Ann Arbor, the university had no building or laboratory dedicated to\nmechanical engineering. Cooley spent $1500 in 1882 to build the stone structure at left. Soon\nafter, the University approved his request to move the carpenter's building (white building to\nright) to adjoin the engineering lab, increasing the floor space available for his students. Cooley\nthen filled the buildings with machinery purchased from or donated by American manufacturing\nfirms. Image: Bentley Historical Library, University of Michigan.\n\nOnce Cooley's students were adequately prepared to enter the workforce, the\nprofessor helped them find good jobs in their field. Frequently the directors of\nmanufacturing firms contacted Cooley, requesting that he send capable young engineers\nto them for employment. For instance, the superintendent of the Detroit Wheel Company\ninformed Cooley in 1887 that he was leaving his position to take a job with another\ncompany. The Wheel Company was looking for a college-educated engineer with\npractical experience to take the superintendent's place, and the directors solicited\nCooley's advice. In an 1888 example, the president of the Middlings Purifier Company\nbased in Jackson, Michigan hired two skilled men for his factory at Cooley's suggestion.\nCooley's interest in his proteges did not end once they landed employment. After placing\n\nBrendan Foley\nSTS.001 Spring 2005\nWork in progress - do not cite or reproduce\n\nMichigan graduates, Cooley inquired with the firms' management to check on their\nperformance.18\nThe education of University of Michigan's first generation of professional\nmechanical engineers was based entirely on the Navy style of engineering. Within a few\nyears, universities across the nation followed Michigan's example. They clamored for\nNavy engineers to jump-start their mechanical engineering programs, and the engineers\nresponded enthusiastically.\n\nThe Lure of Academic Life for Navy Engineers\n\nNews of Cooley's quick successes at Ann Arbor circulated among the engineers\nserving aboard Navy ships, and excited great interest. Some senior engineers took a long\nview of the possibilities of university assignments. Passed Assistant Engineer David\nJones, one of Cooley's and Spangler's Academy teachers, frequently wrote encouraging\nletters to Cooley. From U.S.S. Nipsic in Spain, Jones shared his outlook with Cooley. He\nthought the program of sending Navy engineers to colleges was \"of great advantage to us,\nby making us known as a body of scientific men.\" He continued, \"...it is a chance to\nextend our name and influence through all parts of the country.\"19\nYounger engineering officers also took this view. Walter McFarland wrote to\nCooley from Lake Erie in the fall of 1882, expressing his fervent hope to be detached\nfrom the old 1842 lake steamer U.S.S. Michigan. \"Mac\" wanted the Navy to send him to\nCornell as an instructor, an opportunity he felt was extremely important: \"...if the men in\nWashington look at it as I do, they would realize that the detailing of officers to colleges\nin the biggest thing for our corps that has happened in a long time. It will make us known\n\nBrendan Foley\nSTS.001 Spring 2005\nWork in progress - do not cite or reproduce\n\nthroughout the country and let people see that we are a body of educated gentlemen and\nnot mere engine drivers.\"20\nLike Isherwood in the 1860s, Navy engineers in the 1880s realized that they\nneeded to be respected as professionals if they hoped to win equal footing with line\nofficers in the fleet. Navy engineers consciously moved toward professionalization in\ntheir field: the clearest evidence was the creation of the American Society of Mechanical\nEngineers in 1880. ASME elected officers, published a journal of scholarly and technical\narticles, and limited its membership to a select group of educated, practicing engineers.\nNavy engineers were the foundation of ASME and professional mechanical\nengineering. Former Navy engineer Robert Thurston was elected ASME's first president\nin 1880, and served two consecutive terms. The ASME Secretary during Thurston's\nsecond term was Passed Assistant Engineer Thomas Whiteside Rae, a former Annapolis\ninstructor in steam engineering. In that same term, former Navy engineer Charles\nCopeland served as Treasurer. Thurston's vice president was also a Navy man: Erasmus\nDarwin Leavitt; he succeeded Thurston as ASME president in 1882.21\nActive-duty Navy engineers joined the Society as soon as it was formed. Senior\nNavy engineers encouraged the entire corps to join. For example, ASME member Passed\nAssistant Engineer David Jones used his influence with his subordinates to increase\nASME membership. Early in 1882, Jones wrote to Cooley in Michigan, \"I am inducing\nas many of our people as I can to join the Am. Soc. Mech. Eng. as I believe it a good\norganization. Unless you are already provided with proposers, and wish to join, I will be\none of your proposers with much pleasure.\"22\n\nBrendan Foley\nSTS.001 Spring 2005\nWork in progress - do not cite or reproduce\n\nCooley was an early member of the professional society, and other Navy men\nasked him for nominations so they could join, as well. Walter McFarland asked Cooley to\nsupport his membership bid, and to provide any possible assistance to get him an\ninstructor's position at Cornell. In return, McFarland dedicated time during a brief trip to\nWashington to arrange for technical models and books to be sent to Ann Arbor.\nMcFarland also spread the word among Navy engineers about Cooley's work in\nMichigan.23\nNews and gossip about Cooley's experiences at University of Michigan spread\namong Navy officers, and letters began to stream in to Ann Arbor from graduated Cadet\nEngineers and Assistant Engineers. Some friends just sent congratulatory letters and\nshared news. However, many more engineers asked Cooley about life on shore and the\nprospects of more men getting positions like his. Some had very personal reasons for\nseeking university positions: they wanted to settle down to married life. Others \"had quite\nenough ship\" after a few years in the service, and desired escape from the line-staff\nconflict, incompetent commanding officers, and obsolete, unsafe ships.24\nThe letters written to Cooley by Assistant Engineer Frank Bennett are\nenlightening, and convey the frustrations of Navy engineers at the time. In the spring of\n1883, Bennett described to his friend the conditions aboard his last ship, the old Civil\nWar double-ender, U.S.S. Ashuelot. The ship had recently been run onto a rock in the\nPacific and lost due to the captain's negligence. Bennett wrote that the vessel was \"about\nas near an approach to a hell on water as any ship could be\" because \"her officers were\nall at swords points with the commander and with each other.\" The crew was \"a motley\ngathering of outcasts from all lands but America - undisciplined, dirty, and worthless.\"\n\nBrendan Foley\nSTS.001 Spring 2005\nWork in progress - do not cite or reproduce\n\nThe young engineer told Cooley that his new ship, U.S.S. Monocacy, had a splendid set\nof officers and a decent crew, but problems remained. The ship was at the end of its life\nand was unsafe. \"She is so antique in design and so debilitated by long service,\" the\nengineer complained, \"that it makes us ashamed to go into port with her.\"25\nBennett's discontent did not end at poor equipment; he was dissatisfied with a\nmember of his own corps. The ship's senior engineer, W.L. Nicoll, was \"as near an\napproach to an idiot as one can be...; he knows nothing and is continually nagging at\nsome body.\" The ship's three junior engineering officers were all Annapolis classmates,\nand believed they knew much more about engineering than the \"ancient officer.\" Bennett\nand the others felt justified in snubbing him \"all the time,\" and believed it was payback\nfor sins committed against them by Nicoll. Part of Bennett's ire no doubt had its roots at\nAnnapolis: Nicoll was one of the engineering instructors during Bennett's education at\nthe Academy in the 1870s, and his eccentricities then infuriated cadet engineers.26\nLetters such as these made Cooley realize that his duty at Michigan was far more\nrewarding that service aboard ship. He was therefore dismayed when the Navy\nDepartment detached him from Michigan in the summer of 1885 and ordered him to\nprepare for sea service. This news sparked a stream of letters between Cooley and the\nDepartment. He wanted to extend his duty at Michigan another year, and offered to resign\nhis commission effective June 1886. The Secretary of the Navy refused to grant this\ncourtesy, citing \"the limited service rendered by you since leaving the Naval Academy.\"\nClearly the Secretary did not see the value in sending naval personnel to American\nuniversities. In the end Cooley resigned, effective January 1886.27\n\nBrendan Foley\nSTS.001 Spring 2005\nWork in progress - do not cite or reproduce\n\nCooley's naval service ended, but his connection to active-duty engineers did not.\nThe engineers who maintained the steadiest correspondence with Cooley sought duty as\nengineering instructors ashore. Frank Bennett was one of these men. From 1884 to 1887,\nhe taught at the Chicago Manual Training School, described by Bennett as \"a grade or\ntwo above a high school.\" This duty was not as prestigious as assignment to a university,\nbut Bennett was happy to relax. He envisioned the duty as \"one long picnic.\" Though he\nwas supposed to be in charge of machine shop instruction, there were no students\nadvanced enough for that class. Instead, Bennett taught physics, focusing on electricity.\nHe also served as a \"sort of adjutant or assistant to the director\" of the school. 28\nWalter McFarland also frequently wrote to Cooley of his desire to serve at\nCornell. In 1883 the Navy granted his wish. In the opinion of another Navy engineer, the\ncollege was more a school of mechanic arts than a school of mechanical engineering\nwhen McFarland arrived. McFarland's appointment indicated a change in attitude at the\ncollege, a determination to improve engineering education. This resolve was heightened\nin 1885, when Cornell hired Robert Thurston away from the Stevens Institute of\nTechnology to be the director of the Sibley College of Mechanic Arts. Thurston joined\nMcFarland and a handful of other instructors, and began to build Cornell engineering into\na highly regarded program. Cornell mechanical engineering was deep in Navy officers:\nPassed Assistant Engineers Alfred Canaga (USNA 1874) and Frank Bailey (USNA 1875)\neach served tours there in the 1880s. In 1891 Durand (USNA 1880) joined the faculty; he\nstayed in Ithaca for fourteen years, leaving for a professorship at Stanford in 1905.29\nAs director of Cornell's Sibley College, Robert Thurston understood the value of\nNavy engineers as instructors. He worked to hire as many of them as possible. In the fall\n\nBrendan Foley\nSTS.001 Spring 2005\nWork in progress - do not cite or reproduce\n\nof 1890 he planned to extend the school's capabilities by instituting a new program in\nMaritime Engineering and Naval Construction. He wrote to Cooley, seeking candidate\nsuggestions to chair the new department. Cooley responded that the best men probably\nwould be found in England, but a new tariff law might prevent them from being\nimported. He put forth the names of three Navy-trained American engineers as well.30\nThurston did not take his advice, for he already had the ideal candidate in mind. Thurston\nrepeatedly sent letters to Cooley, enticing him to leave Ann Arbor for Ithaca in order to\nchair the department. The Michigan professor politely refused each time. He cited the\nlucrative consulting business he had built in Michigan, and his belief that his academic\nduty lay in Ann Arbor.31\n\nThe trend evident at Michigan and Cornell of hiring Navy engineers as faculty\nwas a national phenomenon. Navy engineers actively sought billets at universities around\nthe country, and the new land grant universities welcomed them. Schools that would form\nthe Big Ten conference were particularly interested in starting engineering programs with\nNavy help. Michigan, Purdue, Wisconsin, Illinois, Ohio State, and Penn State all received\nactive duty engineers in the 1880s and 1890s. Officers detailed to those universities wrote\nto Cooley for advice and counsel. As his friends in the Bureau of Steam Engineering had\ndone for him, Cooley shared with new professors his lecture notes, class outlines,\ntextbook lists, and suggestions for setting up engineering laboratories. Other Navy men\nadapted Cooley's pedagogy at University of South Carolina, Madison University, Union\nCollege, and elsewhere.32\n\nCivilian professors took notice of the new engineering pedagogy Navy men\nbrought to academia, and mimicked it. From Vanderbilt University in Nashville,\n\nBrendan Foley\nSTS.001 Spring 2005\nWork in progress - do not cite or reproduce\n\nProfessor William Magruder requested from Cooley a catalog describing the Michigan\ncourse of study. He was particularly interested in learning about shop practice and\nmanual technology for engineering students, and asked Cooley to send information about\noutfitting a practical laboratory.33 Another request came from Pennsylvania State College\nin 1888. Plans were in the works for a major expansion of the Penn State Mechanical\nEngineering department, including construction of a new engineering building with\nlaboratories, recitation rooms, drawing rooms, and shops. Cooley duly sent floor plans\nand laboratory layout suggestions. When the new engineering building was ready, Penn\nState invited two Navy engineers to serve as instructors. At Penn State and other\nuniversities, Navy engineers provided an intellectual boost to emerging mechanical\nengineering departments.34\n\nNavy Engineering Practice as American Engineering Practice\n\nThe emphasis Cooley, Spangler, and their fellow Navy engineer instructors placed\non practical experience for their students resulted from their Annapolis education.\nAnnapolis instructors drilled their students in the mathematical and scientific basics, then\nassigned practical projects to the Cadet Engineers. Practical application of theoretical\nknowledge has been identified as a defining characteristic of American engineering\npractice, and it derived from Navy engineering practice.\nA comparison of nineteenth century engineering education in France and the\nUnited States shows that French technical institutions focused on mathematics and\nengineering theory, but largely eschewed experimental, industrial research. French\ntheoretical contributions in mechanics, hydrodynamics, thermodynamics, and theory of\n\nBrendan Foley\nSTS.001 Spring 2005\nWork in progress - do not cite or reproduce\n\nthe strength and elasticity of materials became the foundation for engineering practice\nthroughout the world. American engineers by comparison made few theoretical\ncontributions to their fields.35\nHowever, practical application of theory was a defining feature of American\nengineering pedagogy in the later part of the nineteenth century. Dozens of US firms and\ninstitutions including the Navy consistently carried out industrial research and testing.\nThat research \"became the basis for technological innovations of international importance\nin every imaginable field.\"36\nConclusions\nNaval engineering careers in the late nineteenth century were not attractive for the\nmany of the intelligent, ambitious young men graduating from the Naval Academy. They\npossessed the best technical education in the nation, but service in the fleet left them\nfrustrated. The ships of the U.S. Navy were obsolete, uncomfortable, even dangerous at\nsea. Socially, the situation for engineers was equally undesirable. Chances for promotions\nwere few, exacerbating in the 1880s tensions between line and engineer officers. A few\nhighly publicized groundings and sinkings of ships due to incompetent commanding\nofficers cast line officers in a negative light, but those officers were the exceptions in an\notherwise professional corps. All of these factors contributed to engineers' move toward\nprofessionalization.\nIf the engineers were seen as a scientific, professional body of experts, they would\ngain national political influence. That could be translated into authority within the Navy,\nwhich could improve the situation of active-duty engineers. The formation of the\nAmerican Society of Mechanical Engineers was one certain path to professionalization.\n\nBrendan Foley\nSTS.001 Spring 2005\nWork in progress - do not cite or reproduce\n\nASME was largely a Navy clubhouse in its first years, with Navy engineering officers\nfilling the key leadership positions.\nAnother avenue toward professional status for engineers was increasing the\nbarriers to entry. This was accomplished through academic training at universities. Again,\nNavy engineers guided their field. The legislative efforts of Navy engineers in 1879\nallowed Mortimer Cooley, Robert Thurston, Henry Spangler, William Durand, and\ndozens of other Navy engineers to establish themselves as eminent professors across the\nnation in ensuing decades. Those men took with them the Annapolis style of engineering\ninstruction. It was built upon foundations of advanced mathematics, basic science, and\ntheoretical knowledge; these underlay experimental laboratory investigations and\npractical shop experience. Navy engineering practice became American engineering\npractice, and it was distinct from European styles. By the 1890s, American universities\nturned out thousands of professional mechanical engineers trained in the Navy style. This\ngroup of technically competent men was one reason for American industrial dominance\nat the turn of the century.\n\nBrendan Foley\nSTS.001 Spring 2005\nWork in progress - do not cite or reproduce\n\nBrendan Foley\nSTS.001 Spring 2005\nWork in progress - do not cite or reproduce\n\nNotes\n\n1 Bennett, Steam Navy, p. 732.\n2 Annual Register of USNA 1868-1871; William F. Durand, Robert Henry Thurston: A Biography (New\nYork: American Society of Mechanical Engineers, 1929), pp. 58-59, 93. See also Robert Kwik, The\nFunction of Applied Science and the Mechanical Laboratory During the Period of Formation of the\nProfession of Mechanical Engineering, as Exemplified in the Career of Robert Henry Thurston, 1839-1903,\nunpublished History PhD dissertation (Cornell University, 1974).\n3 Navy Register 1881, p. 68; Annual Register USNA 1875-76, p. 37; Navy Register 1882, pp. 72-74; Annual\nRegister USNA 1878-79, p. 25, Bennett, Steam Navy, pp. 733.\n4 Letter, \"Mortimer Cooley to Lyman Cooley,\" (13 April 1881) Box 1 - Correspondence, 1873-1887, and\nundated, Folder - General, 1881, Cooley Papers; Cooley, Scientific Blacksmith, pp. 52-56; pay figures from\nNavy Register 1880, p. 3.\n5 Order, \"Navy Department to Mortimer Cooley,\" (13 May 1881); Order, \"William Hunt to Mortimer\nCooley,\" (16 June 1881); Letter, \"Mortimer Cooley to L. Cooley,\" (13 April 1881). Cooley, Scientific\nBlacksmith, p. 54.\n6 Letter, \"M. Cooley to L. Cooley,\" (16 April 1881); Order, \"Admiral David D. Porter to Cadet Engineer\nMortimer Cooley,\" (16 April 1881, forwarded 18 April 1881) Box 1, Folder - General 1881, Cooley\nPapers.\n7 Letter, \"L. Cooley to Charles Greene,\" (5 July 1881) Box 1, Folder - General 1881, Cooley Papers.\n8 Order, \"William Hunt to Mortimer Cooley,\" (2 August 1881); Letter, \"Frieze to Cooley,\" (4 August\n1881): Box 1, Folder - General 1881, Cooley Papers\n9 Letter, \"Harry Spangler to Mortimer Cooley,\" (21 September 1881), all in Box 1 Folder - General 1881,\nCooley Papers.\n10 Letter, \"Harrie Webster to Mortimer Cooley,\" (15 August 1881); Letter, \"John C. Kafer to Mortimer\nCooley,\" (24 August 1881); Navy Register and Annual Register USNA 1867-1883; Letter, \"Charles\nManning to Mortimer Cooley,\" (15 August 1881); Letter, \"Asa Mattice to Mortimer Cooley,\" (24 August\n1881); Letter, \"George McElroy to Mortimer Cooley\" (13 November 1881); Letter, \"Asa Mattice to\nMortimer Cooley,\" (21 November 1881): all correspondence located in Box 1, Folder - General 1881,\nCooley Papers. Asa Mattice graduated first in the class of USNA engineers in 1875.\n11 Catalogue of the Trustees Officers and Students of the University of Pennsylvania 1881-2 (Philadelphia:\nPress of Edward Stern & Co., 1882), pp. 22, 36.\n12 Letter, \"Spangler to Cooley,\" (21 September 1881).\n13 Mortimer Cooley, \"Report of Professor Mortimer E. Cooley of the Department of Mechanical\nEngineering,\" University of Michigan Regents Proceedings of June 1882 (Ann Arbor: University of\nMichigan, 1882) Box 48 Folder - U-M Mechanical Engineering, Cooley Papers.\n14 Letter, \"Henry Frieze to Q.W. Ruggles, Michigan Central Railroad,\" (11 January 1882); Letter,\n\"Pennsylvania Railroad: James Wood to Henry Frieze\" (20 January 1882); Letter, \"Lake Shore and\nMichigan Southern Railroad: John Newell to Henry Frieze,\" (24 January 1882): all in Box 1, Folder -\nGeneral 1881, Cooley Papers; Letter, \"Detroit and Cleveland Steam Navigation Co.: C.D. Whitcomb to\nHarry Soule, Univ. of Michigan,\" (25 May 1885): Box 1, Folder - General 1885 (April, May June), Cooley\nPapers.\n15 Cooley, \"Report, 1882.\"\n16 University of Michigan Regents Proceedings 1884.\n17 \"The Beginning of Mechanical Engineering at the University of Michigan,\" Box 48 Folder - U-M\nMechanical Engineering, Cooley Papers\n18 Letter, \"Willard Clapp to Cooley,\" (17 March 1887), Box 1 Folder - 1887 March; Letter, \"George Smith\nto Cooley,\" (20 August 1888), Box 1 Folder - 1888 July-August, Cooley Papers.\n19 Letter, \"David Jones to Cooley,\" (12 March 1882) Box 1 Folder - 1882, Cooley Papers.\n20 Letters, \"Walter McFarland to Cooley\" (7 October 1882) and \"McFarland to Cooley,\" (21 December\n1882) Box 1 Folder - 1882, Cooley Papers.\n\nBrendan Foley\nSTS.001 Spring 2005\nWork in progress - do not cite or reproduce\n\n21 Frederick Remsen Hutton, A History of the American Society of Mechanical Engineers from 1880 to\n1915 (New York: ASME, 1915), p. 78-80, 83-85; Bruce Sinclair, A Centennial History of the American\nSociety of Mechanical Engineers 1880-1980 (Toronto: University of Toronto Press, 1980), pp. 23, 27.\n22 Letter, \"Jones to Cooley\" (12 March 1882).\n23 Letters, \"McFarland to Cooley\" (7 October 1882) and \"McFarland to Cooley,\" (21 December 1882).\n24 Letter, \"George McElroy to Cooley,\" (2 December 1885) Box 1 Folder - 1885 October-November-\nDecember; Letter, \"William F. Durand to Cooley,\" 25 April 1886) Box 1 Folder - 1886 March-April;\nLetter, \"Arthur T. Woods to Cooley,\" (1 February 1887) Box 1 Folder - 1887 February; letter, \"Woods to\nCooley,\" (15 June 1887) Box 1 Folder - 1887 June-July, Cooley Papers.\n25 Letter, \"Frank Bennett to Cooley,\" (20 April 1883), Box 1 Folder - 1883, Cooley Papers.\n26 Letter, \"Bennett to Cooley,\" (20 April 1883), Cooley Papers.\n27 Letter, \"William C. Whitney to Cooley,\" (29 June 1885) Box 1 Folder - General, 1885 (April, May,\nJune); Letters, \"Whitney to Cooley,\" (7 August 1885); \"Cooley to Whitney,\" (10 August 1885); \"D.M.\nManning to Cooley,\" (13 August 1885) Box 1 Folder - General, 1885 (July, Aug., Sept.).\n28 Letters, \"Bennett to Cooley,\" (20 April 1883); \"Bennett to Cooley,\" (4 March 1884) Box 1 Folder -\n1884.\n29 Letter, \"Walter McFarland to Cooley,\" (24 June 1883) Box 1 Folder - 1883, Cooley Papers; Letter,\n\"Frank Bennett to Cooley,\" (4 March 1884), Box 1 Folder - 1884; Durand, Robert Henry Thurston, pp. 95-\n96; Durand, Adventures, pp. 38, 47.\n30 Letter, \"Cooley to Robert Thurston,\" (26 October 1890) Box 58 - Correspondence January 12, 1889 to\nDecember 24, 1890 (Letterpress book), Cooley Papers.\n31 Letters, \"Cooley to Thurston,\" (16 May 1891) and \"Cooley to Thurston,\" (9 June 1891) Box 58\nCorrespondence December 26, 1890 to August 5, 1893.\n32 Cooley generously shared his experience and knowledge with his fellow officers. See letters in the\nCooley Papers: from University of South Carolina, telegram, \"G.W. McElroy to Cooley,\" (28 February\n1885) Box 1 Folder - General, 1885 (Jan., Feb., Mar.); from Ohio State, letter, \"Frank Eldridge to Cooley,\"\n(24 May 1885) Box 1 Folder - 1885 April-May-June; from Chicago Manual Training School, letter, \"Frank\nBennett to Cooley,\" (9 December 1885) Box 1 Folder - 1885 October-November-December; from\nUniversity of South Carolina, letter, \"George McElroy to Cooley,\" (3 March 1886) Box 1 Folder - 1886\nMarch-April; from the Michigan Military Academy in Orchard Lake, letter, \"Andrew Hunt to Cooley,\" (28\nFebruary 1886) Box 1 Folder 1886 January-February; from Univ. of Illinois, \"A.T. Woods to Cooley,\" (16\nJuly 1887) Box 1 Folder - 1887 June and July; from University of South Carolina, letter, \"John Edwards to\nCooley: (6 August 1888) Box 1 Folder - 1888 July-August; from University of Wisconsin, letter, \"George\nB. Ransom to Cooley,\" (9 July 1888) Box 1 Folder - 1888 July-August; from Madison University in\nHamilton, New York, letter, \"William Eaton to Cooley,\" (18 August 1888) Box 1 Folder 1888 July-August\n33 Letter, \"William Magruder to Cooley,\" (1 November 1887) Box 1 Folder - 1887 November; letter,\n\"Magruder to Cooley,\" (19 December 1887), Box 1 Folder - 1887 December. See also letter \"Secretary of\nthe Technical School of Cincinnati to Cooley,\" (2 February 1888), Box 1 Folder 1888 January-February,\nCooley Papers.\n34 Letter, \"Louis Reder to Cooley,\" (15 October 1888) Box 1 Folder - 1888 September-October, Cooley\nPapers; Michael Bezilla, Engineering Education at Penn State: A Century in the Land-Grant Tradition\n(University Park, PA: The Pennsylvania State University Press, 1981), pp. 20-22, 27.\n35 Eda Kranakis, \"Social Determinants of Engineering Practice: A Comparative View of France and\nAmerica in the Nineteenth Century,\" Social Studies of Science v. 19, (1989), pp. 5-6.\n36 Kranakis, \"Social Determinants,\" pp. 6-7."
    }
  ]
}