{
  "course_name": "Technology and Innovation in Africa",
  "course_description": "What do technology and innovation mean from Africa? This is the central question of this course, which tackles a double absence: Of the meanings and role of technology in African history, on the one hand, and of Africa’s place in the global history of technology, on the other. This course alternates between technologies from outside and technologies from within Africa and their itineraries in everyday life, and it is designed to provide students with grounded understandings of technology in Africa for intellectual and action-oriented purposes.",
  "topics": [
    "Business",
    "Innovation",
    "Humanities",
    "History",
    "African History",
    "History of Science and Technology",
    "Social Science",
    "Anthropology",
    "Ethnography",
    "Society",
    "The Developing World",
    "Business",
    "Innovation",
    "Humanities",
    "History",
    "African History",
    "History of Science and Technology",
    "Social Science",
    "Anthropology",
    "Ethnography",
    "Society",
    "The Developing World"
  ],
  "syllabus_content": "Course Meeting Times\n\nSeminar: 2 sessions / week, 1.5 hours / session\n\nCourse Description\n\nWhat do technology and innovation mean from Africa? This is the central question of this course, which tackles a double absence: Of the meanings and role of technology in African history, on the one hand, and of Africa's place in the global history of technology, on the other. The concept of technology in the African context needs to be problematized because it is entangled within the colonial circumstances under which it arrived and the specific (Western) things it denoted. The persistent imagination of Africa is that of an untechnological continent that only wakes up when first Europeans and now the Chinese arrive. Even after being touched by the hand of civilization, Africa is prone to sleeping sickness when left to itself. Africa is seen as a powder keg of disease, wars, and refugees that might contaminate the 'civilized world.' Africa is the last place to look for or find technology; Africa and technology, let alone 'African technology,' is an oxymoron. The only thing worth talking about in Africa, a la Hegel, is what outsiders have brought in, the itineraries they have traveled, and what they have left. The course therefore focuses on three streams or directions from which one might see and define technology: From outside coming, from within (and sometimes going out), and in encounter.\n\nThe course alternates between technologies from outside and technologies from within Africa and their itineraries in everyday life. This course will spend time examining historical and cultural dimensions of technology and innovation emerging out of Africa by Africans, covering topics like plant and animal domestication, biochemistry, medicine, indigenous ecology, mining and metallurgy, architecture, urbanization, textiles, music, entrepreneurship, and many other topics. It will also explore the African experience with incoming technologies such as guns, bibles, books, and ICT applications and what they do to Africans and what Africans do to and with them. This course is designed to provide students with grounded understandings of technology in Africa for intellectual and action-oriented purposes.\n\nPrerequisites\n\nNone\n\nCourse Requirements\n\nACTIVITIES\n\nPERCENTAGES\n\nFirst paper (2 1/2 pages)\n\n15%\n\nSecond paper (5 pages)\n\n25%\n\nThird paper (10-15 pages)\n\n40%\n\nClass participation\n\n20%",
  "files": [
    {
      "category": "Lecture Notes",
      "title": "STS.089 Lecture 10: The Crafts of Witches",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-089-technology-and-innovation-in-africa-fall-2014/5dffa40db62ec3f5706f8f685cc65136_MITSTS_089F14_Lecture10.pdf",
      "content": "STS.089 -- Technology and Innovation in Africa\nFall '14\nLecture 10 - The Arts of Witching\nProf. Clapperton Chakanetsa Mavhunga\nMIT OpenCourseWare\nThis lecture is focused on two types of \"crafts\" opposed to one another, namely witching (kuroya in my na\ntive tongue, chidzimbahwe or chiShona) and anti-witching (kuroyonora) or healing (kurapa). What Adeline\nMasquelier calls \"a host of sorcerers (mayu, plural maye) who struck people, cattle and trees alike with deadly\nfire every rainy season, who hid in the clouds and flew through the skies.\" She talks about the protective\nsteps (special medicines) the Hausa Mawri people of Arewa, Nigeria, took to protect themselves when they\nstill believed completely in bori (spirit possession), before they became Muslims, who believe that lightning\nis sent by Allah. Yet even those converted have not completely severed their ties to spirits, but now believe\nthat lightning is caused by a family of bori spirits. Victims of lightning are therefore deemed offenders, not\nvictims. But even devout Muslims fear the sorcery of lightning.\nWitching is therefore a flexible, adaptive craft. It adapts to the coming of Islam, to market forces; bori\nis certainly no shrinking violet; invoking the spirits does not contradict faith in the Koran. The family of\nnoble spirits (Tooru) still govern the winds, the clouds, lightning and rain -and indeed the Niger River itself.\nThe bakin bori (black spirits) live in the sky from which they control the clouds which bring the rain; those\nspirits throw lightning on people who have offended them.\nThe spirituality of the Zarma people of the Zarma-Songhai region of Niger on the one hand builds nicely on\nthe theme of African meteorology that we starting exploring previously. Thus the watam bakwai (seventh\nmonth) ceremony involves a test to determine if, where, and in what quantity the rain will fall that year.\nMilk is given to the spirits to prevent them from sending lightning down on the people.\nThe Zarma spirits are headed by Harakwai, the father and judge, who sends his sons to deliver punish\nment. His oldest, Kirai, throws no lightning, but is fearful nonetheless; he is Dongo the mad one. His\nyounger brothers actually do the throwing; there's Moussa, a.k.a. sarkin gaugawa (\"the king of haste\"), fast\nand fatal. There is Suleymane, potent and harsh. Then there is Bela, the destroyer and the fire controller;\nBela's brother, Hausakwai, decides what and who shall be hit or burnt. He has four eyes, hence, \"Dodo.\"\nThen there is Yandu, the blacksmith who kills by continually hitting until he \"reaches the brain.\"\nTheir tools are the thunder stones (kankara), or neolithic axes recovered by bori specialists from the site\nwhere lightning has struck; it is claimed they are products of the blacksmith Yandu's forge. If Bela is in\nvolved, the ball is covered with fire, and the spirits' weapons resemble needles if the target is human. If\nKirai, Suleymane, and others are finished, they will leave a sign -three handfuls of grain aside, untouched.\nIf they hit a goat, they put a dead lizard on the animal's back. The stones can only be dug up by a healer,\nwho claims them as prized exhibitions and markers of his prowess.\nThe reading I assigned for today, Adeline Masquelier's \"Lightning and the Avenging Spirits,\" speaks to\na wider phenomenon of the uses of forces that are on the face of it beyond human control, and yet here they\nare as instruments in humankind's hands. Last week I retreated to my own research to initiate a conversation\nto see the larger context within which societies manipulate such forces. I also did this because I would like to\nland a more experiential perspective as an Africa, where Masquelier and other non-Africans might approach\nAfrica as empirical fodder for Western theory. The reason for this course is to explore the African voices\nand to see what meanings of technology we might derive from them. As you may notice, around p. 20,\nMasquelier ends up speculating, with the \"I think.\"\nLet me start my exploration by casting the witch as a pest, a human-spiritual pest, mobilizing forces of\n\nLecture 10\nThe Arts of Witching\nSTS.089, Fall '14\n\"nature\" that we might not consider subject to human manipulation, that is, as technologies for conducting\nthe craft, or art, or witching. These are potent tools varoyi (witches) cast upon people, livestock, and crops\nin the form of uroyi (witchcraft). Vedzimbahwe (also called the Shona people) say it happened this way.\nFirst the witches prayed to their own ancestors, then to those of their intended victims for permission to\njust pass through their village (Togarepi, 1983)).\nThey capitalized on any existing ancestral anger towards the living. If vadzimu could allow varoyi to spray\nuny e (itchy substances) or nh ata (fleas) on the mortals sleeping in the house, the pain would induce them\nto brew that beer all the much faster, and the ancestors would quench their thirst. Children who grew up\nwithout ever experiencing itches would have no sturdiness. Varoyi implored vadzimu to step aside and let\nthem through the spiritual fortifications that the n'anga had installed during kupinga musha, to remind the\ncomplacent mortals of their obligations to the ancestors. The night belonged to the witches. That is why\nno mudzimbahwe or Ndebele called anyone at night; his voice would be taken away by witches (Davies and\nQuinche, 1935).\nSo eventually the ancestors relented to protect their own interests, and the witches entered the village\nto remind the living of their obligations to their spiritual forebears. To enter the village was one step,\ngetting into the individual homestead was quite another, for besides the makona (medicines) of the village,\neach homestead had its own hoko (medicine pegs). Upon getting to the entrance of each homestead, varoyi\nsought permission from the family ancestor asking him \"to remove the fences, make the homestead wide\nopen, that we may do our work.\" The witches were only here to punish, to give them rash to scratch, so as\nto see another side of life. They craved to see tears, to wake their victims up, so that they can open their\neyes (Togarepi, 1983).\nThis, then, was the general theory (not myth) of human and animal health and pestilence among vedz\nimbahwe and their neighbors. The witch commanded both spiritual and herbal powers, just like the diviner\n(the only person qualified to diagnose a case (kushopera) and dispense with the necessary muti). Both were\npractitioners of medicine, one deploying it to cause illness and take life, the other to save and prolong it.\nSickness was therefore believed to result from witchcraft, with muroyi spraying or hiding it in the huts,\ncourtyard, and cattle pens, in the footpaths leaving to the river, well, or fields, or under the trees where\npeople did their daily work. The witch also cast mamhepo (\"airs,\" or hallucinogens) or zvitsinga (disease\ncausing implants) on their victims. Only the n'anga (healer) could remove mamhepo by burning herbs and\nordering the mweya yakaipa (\"bad airs,\" mamhepo) to leave the stricken body, and the chitsinga by biting\nthe spot where it is buried in the flesh and pulling it out. To ward off mamhepo and zvitsinga, a zango or\ndumwa (amulet) was hung around a newly-born child's neck or waist (Posselt 1935, Junod 1906).\nKuroya is neither a function of personal volition nor supernatural means, but \"an act...intimately connected\nwith natural agencies which [the witch] commands\" (Posselt). There is the muti or medicine that muroyi\nadministers to the intended victim through unconscious ingestion, inhalation, and skin contact. There is\nnothing cuckoo about that at all. Then there is the witch's carrier that includes such animals as the hyena,\nbaboon, and fish otter (Ibid.). It is not outside the realm of material possibility that the witch is in fact an\nexpert in taming forest animals to become organic vehicles. For long-distance sorties, witches have also been\nknown to ride on rusero or tsero (winnowing basket), vedzimbahwe's own version of a flying saucer. Their\nmission: to bewitch the living and the healthy into sickness or to feast on rancid human flesh (\"Holy Spirit\",\n2012).\nFrom \"This is Cuckoo\" Towards \"The Logics and Science of African Witchcraft\"\nEvery year in Zimbabwe, there are women found nude outside a relative's house, far away from their own\nhomes. The police arrest them for public indecency; when questioned, they will say they were on a witching\nmission, something went horribly wrong, and the sun set on them, and the witch-spirit deserted them.\n\nLecture 10\nThe Arts of Witching\nSTS.089, Fall '14\nThey will confess that they usually undertake expeditions as far as South Africa, Botswana, Zambia -any\nwhere there is a relative to be bewitched. They will reveal that they fly in winnowing baskets, nocturnally\ntaking off from and landing in graveyards, and completing their return journey the same night. Nobody not\nprivy to their nocturnal shenanigans will know, until a mission goes horribly wrong, the sun sets while they\nare still in a graveyard, in the house of a relative, and so on. They are totally naked, with all their wares\n-the winnowing basket among others -and are arrested for loitering around vari musvo (naked). Usually the\ncourts will call \"witchcraft experts\" (or n'anga) to testify, and once these experts confirm it is witchcraft, the\nindecency case is dismissed (\"Naked Basket Flight\", \"Woman 'Flew' in Basket\", \"Zimbabwe 'Witches'\" 2012).\nIt is very easy to read such stories and simply say, \"This is cuckoo!\" and move on. Without recourse to\nWestern scientific reasoning, anybody who does not believe in witchcraft or spiritual forces will simply say:\n\"Short of digging the whole grave up to get to the corpse, it is impossible for witches to get to and start\neating the flesh.\" Also: \"A reed basket is simply too fragile to carry a human body through the air. In any\ncase, how does it even take off and fly without propulsion?\" A Western physics perspective would be: \"It\nhas to have a force that allows it to defy the force of gravity and achieve self-propulsion once in motion.\"\nCould there be an African -or chidzimbahwe -theory and law of forces at play that Western physics cannot\nexplain? Or is that physics common to all, and that commentators have simply not bothered to investigate\nfurther in order not to be found justifying the scientificity of witchcraft, which colonial commentators have\nmarked as a symbol of the Africans' primitiveness before Europe gave them the gift of civilization?\nThis was the brave challenge that the retired Zimbabwean journalist Saul Gwakuba Ndiovu posed in the\nwake of a spate of witchcraft incidents involving winnowing baskets, even though nobody has actually seen\none in action flying through the sky and captured it visually:\n\"If it is indeed true, and there is no doubt that it is, there is a need to investigate the Gokwe\nwitchcraft story to find out whether or not it has a potential for the economic and/or social\ndevelopment of Zimbabwe. Taking the Gokwe-Budiriro incident as an example of what Zimbab\nwean witchcraft can offer the aviation industry, a research centre could be established with some\nwitches playing major roles for which they would be duly paid. The Government could play a\nfacilitator's role, leaving the field to private individuals and companies to research, invest, pro\nduce and market the products and services. If winnowing baskets (njiselo) can actually transport\npeople from Gokwe to Harare (and at night at that) it means that shorn of its negative aspects,\nthis particular type of Zimbabwean witchcraft can be turned into a most useful and usable tech\nnological wizardry. This is an obvious challenge to the country's universities and ought to be\ntreated as an opportunity towards technological progress and advancement in modern methods\nof travelling. Investigative journalists should now develop this story from its very start up to\nits logical conclusion. Its very start is the society in which the alleged witches live and practise\ntheir secretive science. The logical conclusion is effect (or effects) of witchcraft on its victims.\"\n(Ndlovu 2013)\nFor Ndlovu, treating these reputed competences of witches as cuckoo, crime, or hearsay not only fails to get\nat the science of this advanced winnowing basket aviation. Treating witchcraft in general as such forecloses\nour access into many forms of secret skills and knowledge that can, he says, \"help make this world a better\nplace for its people, flora and fauna\" (Ndlovu 2013). In a very lighthearted way, Ndlovu ends by saying that\nwinnowing basket incidents should inspired Zimbabwe to establish an academy for:\n\"the manufacturing of modern witchcraft products that can be exported with the passage of time\nand as technological enlightenment removes the black shroud of secretiveness from Zimbabwean\ntraditional technological wizardry. Young people with a vision will not fail to see an advantage\nin opening taxi and bus companies at Gokwe, and be ready to enter what we may call \"the Win\nnowing Basket Transport Age.\" Meanwhile, the first Zimbabwean university to take part in the\nfirst public \"Winnowing Basket Demonstration Flight\" will go down in the country's technological\nhistory annal as the country's educational institution of destiny.\" (Ndlovu 2013).\n\nLecture 10\nThe Arts of Witching\nSTS.089, Fall '14\nNdlovu's humor and ambitions should not distract us from the point he is making: that ignorance and a\npriori dismissal of witchcraft beliefs risk foreclosing a productive discovery and engagement with its log\nics and operations -materially and on the mind. In general, the task he sets before us is different from\nthe ethnophilosophy, ethnomusicology, ethnolinguistics, anthropological, and ethnohistory projects, which\nsought to understand the aethsetics, structure, and functions of African culture for academic or colonizing\npurposes. The scholars involved in that project were outsiders for whom Africa presented as \"fascinating\nfieldwork\" space to engage in \"participant observation\" with the \"native informants\" giving their \"informa\ntion\" to the expatriate \"ethnographer.\" These researchers were there to put the \"ethno\" into the \"graph.\"\nThese ethno-siudies by Africanists were so obsessed with witchcraft to reveal the savagery of the \"native.\"\nThey merely described witchcraft in such minute detail to explain why Africa was so messed up; witchcraft\nbecame the anti-thesis of the technological, the scientific, the civilized, and the Judeo-Christian (Junod 1927).\nI see witchcraft as a craft, a domain of secret knowledge, and a technological space that must be understood,\nnot in a judgmental, moralistic, or pejorative \"us\" versus \"them\" way.\nAnti-Witchcraft: African Pest Management Technologies\nIn part to protect against witchcraft, when a family or community was migrating to a new homestead or\nvillage, the choice of settlement in or migration from a given area could not be made without the consulta\ntion, approval, and instruction of vadzimu. In fact, they were requested to guide the journey, to keep the\nhome secure from pests, along with minda (fields) and pfuma (livestock wealth) (Nyevera 1983). At the\ncommencement of the migration, the father of the household would kneel down in the house and recite a\nprayer asking for guidance.\nUpon arrival, right after informing the ancestors of their gratitude for the new home they had been guided\nto, the elders proceeded to invite a n'anna to conduct a ritual called kupinga mush (medically securing the\nhomestead or village against pests). The rational was that musha unoda kupfekedzwa (the homestead or vil\nlage needs to be clothed), so that people from outside could respect it, \"kwete kuita sedambiro remadzvinyu\n(not to be like a playground for lizards).\" The procedure involved the use of many tree species. It entailed,\nfor instance, planting mishenjere or locating the homestead near trees like mubvumira and mutandangozi\nthat refracted ngozi (avenging spirits) and those like mukonde (euphorbia) that refracted mheni (lightning).\nMutarara was used to protect the village against witches, pegs made from wood of the mutarara tree, and\n\"dipped into medicine [and] driven it all around the village by a medicine man\" (NADA 1945). For that\nreason, mutarara could not be brought into the village for use as huni (firewood) under any circumstances\n(NADA 1945).\nThe hoko that the n'anga drove into the ground still required the sanctification of the ancestors for it\nto work. So when he was gone, the elders offered the final prayer, asking the ancestors to now come and\nlook after the homestead, to arm the hoko. We can now see why witches prayed to the ancestors to disarm\nthe hoko and let them in.\nThe association of pests and pestilence with the night is also interesting for two reasons relating to human-\nanimal relations. In the first instance, night was an aid to pest control: it was the time when some deadly\ninsects would be 'sleeping,' and people could, like witches, move through the insect's habitat without being\nseen or molested. Tsetse is one example of such a pest. In the second, however, the night (especially the\ndark night) is generally associated with pestilence. That is when the witches come out and patrol. Whether\nanyone has actually seen them in action is open to conjecture. I haven't. However, naked women are found\nat a victim's home or inside a cemetery at dawn. A n'anga called in to cleanse the village smells out a\nwitch -who confesses to eating someone's child, husband, wife, or mother. In their sleep, people see witches\nbewitching them. Owls perch on rooftops at night in their dozens, and are interpreted as accompaniments\nof the witch busy down below, bewitching the sleeping occupants (and not looking for the big rats running\nacross the yard from their barrows in one grass-thatched roof to the next). In the morning, at the crossroads,\n\nLecture 10\nThe Arts of Witching\nSTS.089, Fall '14\npeople see muti placed there as zvitsinga to afflict the intended target when he or she steps upon it. Most\nafflictions among vedzimbahwe are usually believed to start at night.\nThese beliefs, which have governed people's conduct but are never questioned or dared, go beyond witchcraft\nprecisely because infractions are believed to cause pestilence or harm to the infringer, his family, or the entire\ncommunity. Among the Ndebele and vedzimbahwe, burning intwala or inda (lice) or inwele/vhudzi (hair)\nwas taboo; one would suffer from epilepsy (Davies and Quinche 1935). Anyone who sat in the doorway or\nin his father's place or seat would never grow. Anyone who drank water while standing would be struck by\nlightning. Nobody was allowed to sit pamapfihwa or isikuni (on the hearthstone). Sitting on the hearth\nstones, throwing sand into the pool, or burning imizi (a rush used in basket and mat making) also induced\ncold, windy weather. Playing with the tail of a slaughtered cow or ox brought stomachache to all who ate\nthe meat. Jumping over wood-ashes was forbidden; any who did it would pass bloody stool or urine. Any\nwho sat on the road would get boils. If anyone spilled milk into the fire, the cows would develop cracked\nteats. The lambs and kids would die if anyone killed a turtledove. Nobody was supposed to cross a field in\nwhich nyimo (Bambara nuts) had been sown, lest they all wither. Any who held a dog's or cat's tail would\ndevelop sore eyes. Anyone who treaded on a grave would have aching feet. And if one poked the fire with a\nknife, his mother would develop sore breasts. Eating the spinal cord of animals was taboo; the person would\neasily feel cold. Any boy or man who put a piece of wood that had isikukuku or chikukuku (a swelling on\na tree stem due to parasitic activity) into the fire would develop swollen testicles. No storytelling was to\nhappen during summer, otherwise the crops would suffer pest infestation and fail. Hitting cattle dung was\nentirely forbidden: the cattle would develop constipation. When working in the fields, eating while standing\nwas forbidden; the birds would finish all the corn. Pointing to the gathering rain clouds with one's fingers\nwould make the rains go away (Davies and Quinche 1935).\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nSTS.089 Technology and Innovation in Africa\nFall 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "STS.089 Lecture 11: Mining & Metallurgy",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-089-technology-and-innovation-in-africa-fall-2014/a0562d0a6ecb3e138f43ad3b023627df_MITSTS_089F14_Lecture11.pdf",
      "content": "STS.089 -- Technology and Innovation in Africa\nFall '14\nLecture 11 - Mining & Metallurgy\nProf. Clapperton Chakanetsa Mavhunga\nMIT OpenCourseWare\nTwo main aims:\n1. To build on the conversation on music, beer, witchcraft, and healing -human power over forces that\nmight seem at first sight uncontrollable -and see how they figure in technology and innovation in Africa.\nDoes spirituality stifle of inspire/govern the conduct of innovation?\n2. Picking on a theme of apprenticeship that has fleeted in and out of our discussions so far, to understand\nits role in technology and innovation, and the family and kinship network as an important institution of\n\"informal(ized)\" innovation in Africa.\nTrivializing African metallurgical innovations\nJ. Flint (1974): By 1800, the West African iron mining and smelting industries, upon which the blacksmiths\nhad once had to rely completely for their raw material, were almost at an end, ruined by the competition of\ncheaper and purer iron bars imported from Europe.\nDenis Williams (1974): Denis Williams caricatured traditional African iron smelting in general as a\nmysterious transformation of earth into metal. To him, the African iron producer was a prisoner of the\nsupernatural world. This, according to him, explains the backwardness and the static condition of African\ntechnology, especially vis-a-vis European technology. Nancy Neaher, Leonard Pole, and Merrick Posnansky\ndisagree with Williams's iron hunger and the alleged changelessness of African practices.\nMiller and van der Merwe (1994): In light of the reassessment of evidence for very early smelting\nin Agadez, it is reasonable to believed that the knowledge of metal working was introduced to sub-Saharan\nAfrica from outside, despite the paucity of archaeological evidence in those areas that might have acted as\nconduits for the spread of this technological knowledge.\nPre-colonial Mining\nMore (1974) on \"Metal Age People\": Not only did the people of Africa, before the advent of the Eu\nropean, mine and prospect for various metals, but they were also capable of working iron, copper, tin, and\ngold and of making bronze and brass. It therefore seems to me more appropriate to refer to them as Metal\nAge peoples rather than as Iron Age peoples, which is the term commonly used.\nCandice Goucher: Such a view does not take into account the state of European metallurgy at the time.\nEuropean imports actually required an expansion in the repertoire of West African blacksmiths, including\ngun repairs and gunsmithing; expensive, repairs by African blacksmiths.\nSpirituality and Metalworking\nAs Onwuka Njoku has shown with respect to the Igbo, ironworking was \"highly ritualized and shrouded\nin mystique\"; \"supernatural forces were solicited to participate in and supervise the production process.\nTherefore, any description or analysis which omits the magico-religious context of the production process\nis bound to paint an incomplete picture\"; \"it would be impossible to appreciate the depth and strength of\nthis traditional industry without first understanding the mystical elements associated with it\". Conceptions\nof the qualities or powers of iron and the ritual acquisition of the means to handle iron by the smith; the\nproduction process indicates how Igbo metalcraftsmen forged a working synthesis between technology and\n\nLecture 11\nMining & Metallurgy\nSTS.089, Fall '14\nthe supernatural; to explore the inner logic of the magico-religious phenomena of the industry; the dearth of\nwritten documentation seems to compel reliance on oral information.\nTechnology and Religion: Traditional Igbo iron technology was embedded in a web of rituals and re\nligious ideas. To the contemporary mind, this is an antithesis, as technology and religion are regarded as\nopposites. Technology is the application of science and is seen as founded on rationality and tested mastery\nof the laws of nature. Religious beliefs and rituals, on the other hand, are thought to be symptomatic of a\npeople's inability to comprehend and master nature. They are, therefore, said to be built on ignorance and\nblind faith. Is this, then, to say that traditional Igbo iron working was not based on rational and scientific\nfoundations; that the iron producers were helplessly controlled by invisible forces in a production process\nthey neither comprehended nor mastered? (Njoku, 1991). I would like us to see the rationale from the\nironworker's perspective, not ours.\nWhat is skill in the presence of the spiritual?: Without mystical powers from his deity, the smelter\nwould not be able to perform the mystery of turning earth into iron, nor a smith the mystery of forging iron\ninto tools, weapons, ornaments, or the articles of ritual.\nIncoming Technology and African Innovation: As Njoku shows, Ogun (the iron deity of the Yoruba)\ngoverns not just iron products of his priesthood, but incoming technology as well. Ogun has become \"the\npatron of taxi, bus and lorry drivers, who hang his emblematic representation in their vehicles. Yoruba\ndrivers reputedly go out of their way to run over dogs as offerings to Ogun. Again, sacrifices to Ogun can\nbe made and oaths sworn upon car engines... When an Igbo person buys a new car, he usually launches it\nby libation. But the libation is not made to the iron deity or the car technology but to the buyer's chi, that\nis his personal deity and to his ikenga, the god of achievement among the Igbo.\"\nApprenticeship\nMarcia Wright (2002), through the story of Mzee Stefano, master smelter in Ufipa, Tanzania, beautifully\nwrites:\n\"The ethno-archaeologists spearheaded by Peter Schmidt must consequently be challenged on a\nnumber of scores, including their erasure of individuals whom they subsume into categories of\ncraftsmen and ritualists rather than regard as men with choices and activities beyond iron-\nworking. Mzee Stefano belonged to the generation that saw Ufipa become overwhelmingly\nCatholic. Reaching the peak of his life in the 1930s, he was not only a smelter observing the tra\nditional rituals of smelting, he was also an appointed sub-chief, blacksmith, farmer, and Catholic\nin good standing.\"\nThe Ise Hoe: The emblematic tool in Ufipa, the large hoe weighing between 3 1/2 and 4 pounds, was\nused by men to break up the grasslands into sods that were turned inward, forming green manure mounds,\nintumba. This work usually took place in the later part of the rainy season, in March and early April. The\nmounds were spread for millet planting in November or early December. It was the ise hoe that was a key\nelement in bridewealth assortments and in many ways symbolized manhood. When dedicating a furnace,\nsmelters explained that they spread on its floor bark from the trees that would be cleared for agriculture.\nThis treatment \"made the furnace strong\" and together with a ritual spreading of millet porridgeby an \"in\nnocent\" child helped to assure that the hoes from the furnace conveyed fertility (Wembah-Rashid 1969). A\nlighter-weight hoe served as the female tool for weeding the millet fields. Spears, knives, arrow-heads and\nbells rounded out the repertoire of blacksmiths.\nWright on Mzee Stefano's Apprenticeship: elsewhere in Africa, descent or heredity were critical to re\nproduction of skill within families; in Ufipa, in principle, it was open to all who wanted to practice; in reality,\nhowever, followed family lines; The pattern of furnace construction, charging, and carrying out attendant\nrituals had been handed down to him from his father, who had it from his grandfather. This paternal line\n\nLecture 11\nMining & Metallurgy\nSTS.089, Fall '14\noriginated in the south, in the Mambwe clan of Sinkambe (Wright). Usually priest-chiefs were identified with\niron-smelting and magic; Stefano took over from his father as the master smelter, having been invested with\nthe ntangala, the secret medicines necessary to the practice and authority of a master. By that time, he had\nexperience as a msole, the principal assistant, was married and had at least one child. He and his wife were\nbaptized Christians, but adherence posed no obstacle to his conduct of the traditional rituals of iron smelting,\nwhich were not criticized by the village catechists who were responsible for directing the swelling numbers of\nChristian adherents in the interwar years. When the time came to rebuild the ilungus, Stefano established\nthem close by his year-round residence at Ikumba instead of at Makuzani, a march of several hours. The skill\nto direct this construction came from observation and participation, not merely in boyhood when his father\nhad last built, but also by volunteering as an assistant when other masters called for helpers in such projects.\nApprenticeship and Graduation: At the end of training, apprentice passed through a ritualized gradu\nation ceremony: ima otutu or ihe otutu, \"the blessing of the hammer\"; and a passing out ceremony, required\nto produce the core tools with which the graduand would start off on his own -an anvil, a hammer and two\npairs of tongs; not to be bought on the market. The graduand could also be put through a proficiency test,\nto produce on the spot any item which one of the assembled smiths might ask him to. it was a standardized\npractice -standardized by adherence to taboos, ritual procedures, call and response chanting or music, even\ninstrumental play, and \"a strong tendency for mastery to descend through families.\"\nArming the Tools: Afterward, he and his new tools were presented to the lineage shrine to receive the\ndeity's blessings. Rules and ethics of the profession and graduand's rights and responsibilities rehearsed to\nhim by priest, who gave the graduand a drink of water into which a hammer had been dipped. He also\nmade four strokes of native white chalk, nzu, on the chest of the graduand, invoking the god of iron to guide\n\"this young bird...about to fly,\" to \"strengthen his wings,\" \"sharpen his beak,\" and \"open his eyes,\" so that\nhe could be productive in the places of work he sought. After all, \"people will not eat sand,\" and by their\nspecial gifts, the new smiths would \"fend for himself\" (Njoku).\nSmelters and Smiths: two main phases of iron production, namely smelting and smithing. Iron ore\nembedded in rocks, and smelting is the process of extracting the ore from its non-ferrous matrix. Smithing\nis the forging of iron and other non-ferrous metals into items for human consumption. In some commu\nnities, smelters were also smiths; in others, they were separate occupations. Smelting was undertaken by\nlineage-based work groups, not individuals. It was energy-sapping work involving four key stages: wood fuel\nproduction, furnace construction, ore prearation, and the loading and firing of the furnace charge. Each of\nthese stages was preceded and sometimes accompanied by magico-religious observances in which the god of\niron was fervently called upon to supervise the process to ensure a successful and accident-free smelt.\nAbstinence while Smelting: village participation involved helping with the massing of raw materials\nand giving domestic support to the smelting team. Some women and children participated, although more\nwomen remained behind to deal with the female tasks of harvesting the millet. Women normatively did not\nin any way participate in the active smelting, and their sexual duties were in abeyance owing to the obligation\nof the leaders, at least, to remain celibate throughout the season. This discipline continued to be a point of\nprofessional dignity for Mzee Stefano. The team donned leather singlets, they sweated and were smelly, they\nenjoyed their ribald jokes and songs [referring to sexual matters in an amusingly rude or irreverent way].\nBut women's work, in brewing millet beer and cooking, cannot be eliminated from the equation of labour\nconsiderations, and proximity to home lent flexibility in distributing effort among many tasks (Wright).\nWhat motivated people to join in building furnaces and turning out to produce the stockpiles of raw mate\nrials also has an initial answer that seems straightforward. A cow was slaughtered when a new furnace was\nto be build, and beer and food were supplied while the clay from anthills was brought and kneaded and the\nconstructed progressed (Wright). The sacrificing of a chicken and sprinkling of its blood by a pre-adolescent\ngirl, and the burying of protective medicines (ifingila) also occurred. The final touches, just short of comple\n\nLecture 11\nMining & Metallurgy\nSTS.089, Fall '14\ntion, entailed decorating the furnace as if it were a bride and singing special (often bawdy) songs. Although\neveryone helped with this phase, it was exclusively men and usually junior men who moulded and cut the\nclay for the tuyeres, the vents placed in the openings at the base of the furnace (Wright).\nSmelting continued in 1936 because demand for hoes remained vigorous, and imported tools tended to\nbe scarce or not appropriate to the heavy work of creating intumba mounds. For all the official projections\nthat duka shop sales would make redundant the blacksmiths who forged indigenous iron, the ranks of iron\nworkers were actually replenished between 1936 and 1943 (Greig 1937), (Wright).\nGiven that men were to some extent bottled up in Ufipa and available to make more intumba mounds\nfor greater production of food, the work of women in their gendered tasks of weeding, harvesting, and win\nnowing increased commensurately. Altogether, establishing furnaces nearer the village at this time made\nconsummate good sense (Wright).\nTestimony to the way in which culture responded to the local colonial situation. Notwithstanding major\ncontributions to the migrant labour force on the sisal estates, numbers of the male population remained re\ngionally committed, defining their lives as artisans servicing a complex grassland agricultural system through\nthe production of tools (Wright).\nThe Christian Onslaught: Wright undertakes a reassessment of five standard published authorities -ethno\ngraphers, Adolphe Lechaptois, Albert Wyckaert, and J.M. Robert, and two administrator-observers, R.C.H.\nGreig and Robert Wise. Where possible, archival sources will figure as a means to expose more fully the\nobservers' assumptions, strengths, and limitations and the ways in which published accounts have been mis\nread by late twentieth-century Africanists. Father Wyckaert arrived in the Tanganyika Vicariat in 1906, just\nas the apostolic vicar, Bishop Lechaptois, was fully engaged in gathering the materials for an ethnographic\nstudy (Wright). Lechaptois speculated that smelters were a residue from a once more advanced civilization.\nAt the same time as conceding that certain young men already preferred porter age or other wage labor\nto the hard and unprofitable work in iron smelting, he also reported that where the poeple could compare\nindigenous and imported iron, they preferred the indigenous. To pluck a few passages from the whole work\nwithout assessing a missionary leader and enterprise that looked to take over rather than transform the\nculture leads to continuous misreading. Wyckaert made the most important contribution to our knowledge\nof iron smelting and associated crafts. He took every opportunity to follow in Lechaptois's ethnographic\nfootsteps. He had found an ideal setting for studies of iron smelting in the Parish of Mwazye, where he\nbecame a missionary priest in 1909 and Father Superior in 1910. In his article \"Christian Smiths and Pagan\nSmiths,\" published in 1914, the Mwami, or master smelter, emerges as a rival priest and moralist.\nIt became Wyckaert's project to promote smelting by Christian masters who pledged to do without the\ntraditional rituals and medicines. In 1918, Christian villagers departed with the first Christian master to\naccept the terms, Lui Chawalanga. When the attentive missionaries visited the smelting site to help figure\nout why several charges failed to produce reducible iron, they dismissed suspicion that failure was caused by\nthe witchcraft of rivals, blessed by the furnace, and point out certain technical reasons for the failures.\nThe missionaries could smile on harvest festivals that mixed traditional and Christian features. Catechists\ncontinually negotiated between strong cultural imperatives, such as widow inheritance, and the influx of the\nyoung preparing for confirmation whom, without overt parental opposition, they instructed that monogamy\nalone was Christian.\nChristian Faith and the Demise of Ritual: The young master whom Greig observed as the owner\nof the furnace under construction was a Christian, who seems to have made asides to the District Commis\nsioner to the effect that the ritual performance was not necessary to the metallurgic process. It was the elder\nsmelters serving as principal councillors, wasole, who guarded it as essential (Greig, 1937). When Robert\n\nLecture 11\nMining & Metallurgy\nSTS.089, Fall '14\nWise commissioned the demonstration in the District Commissioner's front garden, the setting was largely\nartificial. By dividing the articles between the physical steps and the rituals, he contributed to the detach\nment of smelting from its place in daily life. In doing so, he drew upon Father Robert's recently published\nwork (Wise, 1958).\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nSTS.089 Technology and Innovation in Africa\nFall 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "STS.089 Lecture 12: African Entrepreneurship",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-089-technology-and-innovation-in-africa-fall-2014/070692d7f064897c39ef9ea952e78169_MITSTS_089F14_Lecture12.pdf",
      "content": "STS.089 -- Technology and Innovation in Africa\nFall '14\nLecture 12 - African Entrepreneurship\nProf. Clapperton Chakanetsa Mavhunga\nMIT OpenCourseWare\nDoes the concept of entrepreneurship make sense in Africa?\nCritics felt the concept of entrepreneurship was too deeply embedded in Schumpeterian circular flow mod\nels and the imagery of Western industrialism to have meaningful application for peasant or transitional\neconomies. Many have become skeptical as to whether the rise of a Western-educated middle-class elite can\nany longer be viewed as the indispensable vehicle for development once extolled in the literature of capital\nist economic growth. And several neo-Marxist and other scholars have criticized the rise of an indigenous\nWest African mercantile group as being not developers but a comprador class which served as a vehicle for\neconomic imperialism and the penetration of their countries by European interests (Dumett, Kaplow 1977,\nRodney 1972).\nWorth brief attention are attempts by anthropologists to devise various subcategories-e.g., \"small-scale\"\nversus \"large-scale,\" or \"innovating\" versus \"imitating\" entrepreneurs, in order to refine the term for ap\nplication to Africa. Most ideas are transmitted by emulation or diffusion, and most entrepreneurs are at\ndifferent times both innovators and imitators. Keith Hart's subdivision into \"traditional entrepreneurs\" and\n\"Westernized entrepreneurs\" seems to make more sense (Katzin 1964, Hart 1970). It is easy to pick out\nthose traders and middlemen who were immersed in the traditional sociocultural milieu, who were basically\nrural, who travelled far upcountry to open new markets, and who had little contact with Europeans. By the\nsame token, one can identify those African merchants who became acclimatized to life in the coastal towns,\nwho built stores, traded overseas on their own accounts, and served as conduits between the indigenous\nand European sectors of trade. Even this typology presents problems, however. There were few traders in\nthe Gold Coast/Ghana then or now who were not affected to some degree by non-African influences; many\nentrepreneurs -whether small market-stall operators, owners of fleets of lorries, or cocoa brokers textendash\nfit into a gray area midway between the two categories (Dumett).\nWhat are the risks of democratizing or severely limiting the term \"entrepreneur\nship\"?\nDumett says that the tendency in some recent [Global South] studies to suggest that every small-scale\nshopowner, hawker, or street peddler is an \"entrepreneur\" deprives the term of useful analytic force. An\nentrepreneur certainly does not have to be an industrialist; he can be a trader, farmer, or skilled craftsman.\nYet, one should keep in mind the classic definition of the entrepreneur as a leader, a \"change agent\" who\ncombines the basic factors of production and distribution-land, labor, capital, or transport-in new ways\n(standard definition as offered in Say 1821; Schumpeter 1934, Hawley 1907). This touches on other crucial\nquestions. What are the conditions and causal elements which transform an ordinary trader into an en\ntrepreneur? What qualities contribute to a prosperous and enduring business enterprise? What elements\nlink entrepreneurship to a nation's commercial expansion and general economic development? What are the\nbarriers to sustained mercantile activity and the reasons for entrepreneurial decline? (Dumett)\nWhat distinguishes an entrepreneur from everybody else in society?\nThose attitudes which distinguish unusually effective or successful traders, merchants, farmers, or artisans\nfrom others in the society: the leading innovators in rapidly industrializing countries were often relatively high\n\nLecture 12\nAfrican Entrepreneurship\nSTS.089, Fall '14\nstatus subgroups who had suffered loss of traditional power or who had traditional channels of advancement\ndenied to them (Dumett, Hagen 1962, LeVine 1966, McClelland 1961).\nDumett's Critique\nHagen, in particular, perpetuated some inaccurate stereotypes concerning the supposedly authoritarian,\nstatic, and non-innovational nature of traditional societies prior to modernization (Dumett). Of course, in\napplying his notion of subordination to Africa, one could assume that the European colonialists constituted\na \"new ruling elite\" which repressed the aspirations of potential leaders from the traditional society. But the\nfacts suggest that, for British West Africa, \"legitimate' European trading connections, built up during the\nmid-nineteenth century, brought more new opportunities than impediments and that the oppressive impact\nof formal colonial administration came mainly at the end of the period (the 1890s) covered in this essay. As\nfor the McClelland model, it seems unlikely that most human action can be reduced to a single paramount\npsychological determinant -\"need for achievement\" -any more than it can be reduced to a purely economic\none, such as acquisitiveness. In a trenchant critique of the methodology of the achievement motivation school,\nR. K. Godwin has pointed out the logical fallacies involved in jumping from the measurement of the attitudes\nof individuals to that of an aggregate personality, and from there to the level of the total social-cultural unit,\nwhether class, ethnic group, or nation (Godwin 1974, Schatz 1971, Hart 1975). Indeed, a number of scholars\nhave pointed out that tests of attitudes and beliefs may be of limited value in predicting overt behavior.\nCritique of Dumett\nDumett then commits a mistake of his own. He will the underlying determinants for the rise of particular\ngroups to trading dominance in many parts of West Africa can be traced to locational factors and favorable\nchanges in the economic environment; says there often a very close connection between success in trade and\nfamily ties to a king or chief. He emphasizes the significance of geographic and environmental elements, not\nthe people's abilities or their knowledge professoriates: From my work on African merchants and traders\nof the Gold Coast, which has centered thus far on two major groups -the Fetu and Fanti merchants of\nthe central region, and the Adangbe traders of the River Volta -it seems likely that geographic location,\nwhich placed certain groups in a favorable position to respond to economic stimuli, was the central and\ncontrolling factor. Sure, the \"nodal trading points\" were critical as springboards for entrepreneurial activity\nand economic development, more so on the Gold Coast, but we can't take the achievements of Africans and\nsimply attribute them to proximity or location. I will return to this later in the lecture.\nThe 17th and 18th Centuries\nThe arrival of European traders and trade goods on the coasts of West Africa and the entrance of these\nareas into international trading networks constituted, albeit in a limited way, an exercise in acculturation;\nthe development of middlemen who mediated political, cultural, and economic relations between Africans\nand incoming Europeans (Henige).\nUpper Guinea: the lan cados (of full Portuguese blood) initially dominated trade, but they intermar\nried with Africans. A second group dominant in trade were the grumetes, generally of African descent and\noften semi-independent. They owned a sense of corporate self-identity, living in their own villages and prac\nticing an Africanized form of Catholicism (Henige).\nSierra Leone: Here, similar situation, but besides the lan cados and grumetes, trading families useful\nkinship ties with the existing political system but attempted to maintain a certain sociopolitical distance by\nsettling on the many islands of the area and by adopting some English cultural patterns (Henige); emphasis\non all sides was on individuals rather than on corporate institutions.\n\nLecture 12\nAfrican Entrepreneurship\nSTS.089, Fall '14\nThe Gold Coast: On the Gold Coast this emphasis was largely reversed. The trade was both highly\nstructured and localized and the degree of interaction confined both spatially and socially. According to\nHenige: the traders did not develop from individuals to a \"class,\" contrary to Kwame Daaku (1970, also Kea\n1974 and Boahen 1974), who saw them as \"a new class\" (Henige)\nThe Niger Delta (Nigeria-Benin Area): developed from less centralized and structured communities in\nresponse to new exigencies and opportunities. Even less social and political intercourse between European\nand African here than on the Gold Coast, and for the Niger delta we should think in terms of African po\nlitical and economic responses which were the stronger, the more successful, and the more durable precisely\nbecause they were able to develop with little attendant acculturation (Henige).\nAfrican Entrepreneurs\nJohn Kabes\nThe mobility, the adaptability, and role of middlemen as mediators allowed them to become entrepreneurs, to\nserve European companies in capacity while retaining entrepreneurial independence to do their own thing on\nthe side. An able individual might manipulate conditions to his own long-term advantage, and John Kabes\n(or Cabessa) of late-17th century is an example of an African trader and political leader who benefited from\nthem (Henige, 3). He was born in the 1640s-50s, and was certainly \"old and growing sickly and infirm\" by\n1716 and deceased by June 1722. His career as trader and as political leader shows him as one of the major\nfigures in Dutch-African, English-African, Dutch-English, and African-African relations in the Gold Coast.\nHe started out as a prot eg e of the Dutch traders, was brought to Komenda by the English to serve as their\nbroker, and ended up as an independent trader (Henige). His own interests corresponded with those of the\nBritish, without submitting his will to them; it was a business calculation.\nAlthough the Europeans denigrated the waterside blacks as having \"nothing of their own to trade with\"\nin terms of gold, ivory, or slaves (Henige), Kabes (and others like him) in fact served as producers of both\ngoods and services for the English at Komenda and other nearby points, in addition to operating as mid\ndlemen for goods going into and coming from the interior. The English expected him to provide corn in\nadequate quantities to victual the garrison at Komenda, with any surplus going to Cape Coast Castle and\nother points on the coast. Another local commodity supplied by Kabes, probably under contract, was\nshells from the vicinity of Takoradi which were used to produce lime to prepare mortar for building and\nmaintaining the English forts. But in terms of operating as a primary supplier it was Kabes's ability to\nprovide manpower to the English garrison that was most important. In I69I, when the English made an\nabortive effort to re-establish the factory abandoned three years previously, the English agent emphasized\nhow important it was to \"appease\" Kabes, without whom, he added, \"nothing will be done.\" He supplied the\nCompany with workmen to bring stones to the site, to cut wood, and to offer some deterrent to the Dutch\nwho were threatening to prevent work from proceeding. Kabes was adept at extorting payments and bonuses\nat critical times in the progress of construction, fully realizing, one might suppose, the heavy dependence\nof the English on both his resources and his good will. Kabes was both an intermediary and producer of\nmerchandise, shaper of tastes as well as disseminator of goods to satisfy them (Henige).\nWilliam Nahr Ocansey\nI use here the standard definition of a merchant as one who engages in an overseas, long- distance, or\ninter-regional import or export business as well as in local trade. Other definitions which were used on the\nGold Coast during the period 1850-1900 were \"a man who did a large volume of trade\" and a businessman\n\"who lived in a large house.\" Some of these men worked as part-or full-time agents for European trading\nhouses. A leading merchant of the southeastern Gold Coast was William Nahr Ocansey, whose headquarters\nwas at the town of Ada in the Adangbe area located near the mouth of the River Volta. A completely\n\nLecture 12\nAfrican Entrepreneurship\nSTS.089, Fall '14\nself-made man, though he could neither read nor write, he built up a lucrative trade based on export of\npalm products to England and Germany and inward shipments of European cloth, tobacco, and liquor, plus\nlocal fish and salt, to central and northern Ghana. Ocansey operated in the tenuous marginal zone between\nthe indigenous production centers of the Lower Volta (including the Anlo Coast of present-day Togo) and\nthe seaborne trading system dominated by leading British houses such as Alexander Miller Brothers and F.\nand A. Swanzy; this region was difficult because the expatriate firms had easier access to the wholesalers,\nbrokerage houses, and credit institutions of the United Kingdom. In addition, the Swanzys owned two or\nthree steamships and large sailing vessels which shipped cargo direct to Europe and America; to hold its own\nfor several decades against European economies of scale was traceable to its expert use of local technologies,\ncoupled with its position of prominence within the surrounding Adangbe region and its network of more than\nfifty traditional traders and middlemen (Dumett). What were the wellsprings for the commercial wealth of\nAda and the entrepreneurial talent of its people? The salt trade of the nearby Songow (or Songor) Lagoon,\nwhich developed into a highly organized industry, utilizing cadres of laborers (in the early days slaves) under\nthe direct control of the traditional ruler of the Ada kingdom.\nSeveral elements inherent in the traditional sociopolitical structure also played a part in W. N. Ocansey's rise\nto prominence. To substantiate my royal lineage hypothesis, it is important to note that he was a younger\nbrother of the king of Ada. He exploited this relationship to the fullest in purchasing local supplies of salt\nand fish for interior African markets, in building an organization of itinerant agents and boatmen, and in\nacquiring capital for investment in canoes and in land for warehouses and branch stores. Lack of formal\neducation was no barrier, as Ocansey hired trained clerks to do his letter writing and bookkeeping. Use of\nkinship networks was crucial to the expansion of trade; \"You see,\" said Moses Pupulampu, descendant of\na nearly twentieth-century family of Ada traders, \"this is one reason our grandfathers had so many wives.\"\nW. N. Ocansey attained success gradually as a palm oil exporter during two decades of rising prices and\ndemand for the product in Europe. The advent of regular steamer service and lowered freight rates also\nhelped him to run a profit. Pivotal to his success was his ability to negotiate with the most important inte\nrior palm oil producers of the day -the Krobo people -in their common (Adagbe) language. By the 1860s\nhe was managing a complex network of some twelve trading stations or lodges, each with a store manager,\nsupporting cadre of laborers, and itinerant agents. At the height of its prosperity the Ocansey firm control\nled branch factories at the towns of Keta, Beh Beach, and Danu Beach on the eastern (Anlo) shore of the\nVolta estuary, as well as establishments at Agrave, Adidome, Battor, Weycoomabe, Amanoo, Tolesem, Ada\nFoa, Pram Pram, Akuse, and Kpong in the western or Adagbe zone of influence. Agents and middlemen\nwith whom father and son did business were Tetteh Ocansey, James Amartey, J. C. Ocansey, T. C. Ocansey,\nH. Solomon, Tetteh Dabah, J. F. Tamako, R. D. Totimah, O. T. Azzu, T. C. Dosooh, Tetteh Amler, and\nT. Adodatee. A feature of this expansion, often associated with the transition from traditional or \"ad hoc\nentrepreneurship\" to the \"cognitive entrepreneurship\" of modern mercantile organization, was regular record\nkeeping and management of accounts. The Ocansey papers at the Ghana National Archives indicate that\nthe ability of clerks to maintain invoices, bills of lading, records of commissions and wages paid, receipts\nof sales and purchases, and ledgers of debit and credit on a consistent basis was essential for success (Dumett).\nThe Ocansey firm's slow decline can be traced to a combination of natural disasters and external fac\ntors, including loss by fire, shipwreck, robbery, and involvement in warfare against the neighboring Anlo\npeople. William Ocansey showed amazing resiliency in rebounding from many of these misfortunes, but in\nthe end succumbed to general loss from the declining palm oil trade coupled with default on credit by local\nmiddlemen and oppressive treatment by European competitors (Dumett).\nR. J. Ghartey\nThe life of R. J. Ghartey, one of the leading nineteenth-century merchants of Winneba and Anomabu in the\ncentral Gold Coast, reinforces several of our hypotheses concerning advantages of location and the synthesis\nof traditional and Westernizing sociopolitical elements in the development of entrepreneurship. Born Kwamin\nAkyempong, he was the son of Gyateh Kumah, the Odefo, or king, of the Winneba state during the 1820s.\n\nLecture 12\nAfrican Entrepreneurship\nSTS.089, Fall '14\nSituated on the River Ayensu, about forty miles west of Accra, Winneba was originally a fishing town and\nthe gateway to a fertile farming area. In addition, the inhabitants became known as excellent canoe makers\nand traders. Disinclined to become a fisherman or farmer, the young man (now using the name Ghartey, a\ncorruption from Gyateh) struck out on his own and gained employment as an apprentice for a Dutch firm\ntrading at the nearby palm oil port of Apam. European contacts were, therefore, important in Ghartey's\ndevelopment, but he lacked formal schooling. For a total of fourteen years, Ghartey worked as a cooper\nfor the Dutch firm of Stoover Brothers at Apam, and from this he obtained a knowledge of basic business\nmethods. His son, King Ghartey V, recalled in an interview with the writer how his father subsequently\nspent a period at sea, working as a deck hand on various English, Portuguese, and Dutch ships, where he\ngained further experience, some of it harsh, in the ways of the European commercial and seafaring world and\nlearned five languages -Fanti, Ga, Guan (the language of Winneba), Dutch, and English, plus a smattering\nof Portuguese. He accumulated enough savings to purchase his own store at Anomabu. By the time of the\ndemise of Stoover Brothers, Ghartey had amassed sufficient capital to buy out his parent organization. As a\nresult, he gained control of the sizeable trading establishment at Apam, together with a network of thirteen\nbranch factories, which he then combined with his own budding import-export firm, Ghartey Brothers, at\nAnomabu. This partnership, along with the Sarbah firm of Cape Coast, became one of the best-known\nexamples of African mercantile entrepreneurship in the Gold Coast. He was elected as the best qualified to\nhold \"the paramount stool\" -first king -president of the Fanti Confederation, the African protonationalist\ngroup that included John Sarbah, F. C. Grant, Jacob W. Sey, J. F. Amissah, W. F. Hutchison, and other\nmerchants, chiefs, and professional men of the central districts (Dumett).\nGhartey grew up near the heart of some of the richest oil palm forests of the central coastal states. His\nwealth was based primarily on the export of palm oil from the Efutu, Fanti, Agona, and Gomoa states and\non the trade in gold dust and ivory from Asante, but his operations expanded to include nearly every port\ntown of the British Gold Coast Colony. Like the other merchants described here, he made use of kinship\nand friendship ties with other kings and chiefs, including those of Asante. Ghartey Brothers set standards\nfor their competitors in innovation, financial daring, and the development of new lines of business enterprise.\nGhartey was reportedly the first to ship palm kernels from the Gold Coast, using his branch factories at\nAchowa and Sekondi in the Ahanta state of the western region; and he is said to have experimented with\nmachine crushing of kernels, which for a time became a significant local industry. He also participated in a\nmechanized gold-mining venture in the Wassa district of the western Gold Coast in the late 1870s, and he\nattempted to develop a timber-cutting industry in the Winneba region. King Ghartey IV helped to open the\nrubber forests of Assin and Denkyera to the first commercial tapping of wild rubber by indigenous traders in\nthe 1880s and was able to retire a wealthy many decade slater. The evidence also attests to his participation\nin a wide variety of civic, philanthropic, and educational activities. King Ghartey IV did not live to see the\nsudden burgeoning of cocoa as the Gold Coast's number one export crop, but his son informed me that a\nbrother, J. B. carried on the tradition Q. Ghartey, family entrepreneurial by managing a large cocoa farm\nat Asemankese in Akyem-Abuakwain the early 1900s (Dumett).\nConclusions\nRegarding Dumett's Argument on \"Nodal Points\" and \"Niches\"\nInextricably bound up with locational advantage in the spread of new skills in trading and production were\nimportant changes in the external economic environment generated by technical and structural changes in\nAtlantic commerce during the second half of the nineteenth century. During the 1850s and 1860s we find\na of the niche wherein of widening entrepreneurial larger groups indigenous merchants might exercise their\ntalents. These changes, whose impact varied from place to place along the Guinea Coast, derived in part\nfrom rising European industrial demand for new tropical products, notably palm oil and palm kernels, and\nin part from the advent of the new steamships, whose faster service and larger cargo capacities stimulated\ntrade and drew the localized economies of West Africa more fully into the currents of the world capitalist\n\nLecture 12\nAfrican Entrepreneurship\nSTS.089, Fall '14\nsystem (Dumett).\nTransformation in Niches\nFor small-scale African traders, previously inhibited from entering overseas trade as principals, the new\nsteamers (both liners and tramp vessels) offered a fourfold advantage: (1) more frequent and regular stopovers\nat small towns along the coasts, (2) independence from prevailing winds and offshore currents (which had\ninhibited east and west trade along the Guinea Coast), (3) improved carrying capacities combined with\nwillingness of captains to accept produce shipments in smaller parcels, and (4) for a time at least, reduced\nfreight rates, induced by the healthy rivalry between the African Steamship Company and the African Steam\nNavigation Company, which continued until the coming of rate-fixing cartels in the 1890s. The net effect of\nall these was a widened entrepreneurship. Changes opportunity structure for young men anxious for careers\nin commerce at principal towns up and down the West African coast (Dumett). Of course, opportunities are\ncreated by people; they do not come before innovation.\nThe traditional systems are not necessarily anti-modern.\nContrary to Dumett's assertions that \"If it can be accepted that advantageous location and new economic\nopportunities were the fundamental determinants of entrepreneurial supply, it is still necessary to identify\nthe intervening variables which enabled particular traders to profit and survive in large-scale enterprise\"\n(Dumett). It is fundamentally flawed -it's as if all good things come from outside, and all incoming things\nare modern and local ones are not.\nDumett talks further that the adaptibility of indigenous social structures and the transmission of huckstering\nskills through traditional role models and institution. Key elements were peers, the immediate family, wider\nkinship networks and the chieftainship; entrance into retailing or related vocations was not restricted by\nsuch criteria as ethnic origin, class, clan, or the like; socialization of young men in a milieu where the profit\nmotive was not disparage.\nHe puts too much emphasis on European influences, and doesn't go far enough in displacing the West\nern ratio as a central aspect of African entrepreneurship. As a reinforcing element, European-style education\ncould play a part in the process. Some of the most prosperous local merchants, especially those in the major\nport towns of Accra and Cape Coast, were educated at colonial or Christian missionary schools. Many\nobtained a grasp of commercial arithmetic and English grammar, and some were fluent in more than one\nEuropean language. Other facets of Westernization are: many of the indigenous merchants were active in\nlocal (mainly Methodist) churches and English-style voluntary associations, that they maintained friendships\nwith Europeans, and that some took English, Dutch, or Danish surnames -have led several commentators\nto speak of a strong transcultural element in West African coastal society. Though not without significance,\nthese elements were not an indispensable key to entrepreneurial success. Much more important were the\ninteractions and intermarriages between members of the leading African bourgeois families. They became\na tightly knit group and were conscious that they were a vital force for the socioeconomic and political\ntransformation of the colony (Dumett). Dumett indeed de-emphasizes European educational influence on\nentrepreneurship, saying that \"previous accounts have erred in overemphasizing the role of formal schooling\nand Europeanization as major determinants of successful commercial careers in the Gold Coast.\" Part of the\nproblem for the historian stems from the fact that it was the literate people of Accra and Cape Coast who left\nthe fullest records of their activities. However, most of the African merchants and traders listed here lacked\nformal schooling, and one scholar has questioned the assumed literacy of some of the best-known members\nof the coastal middle-class elite (Dumett, ref. to Limberg 1970; Bevin 1956). Many of these merchants and\ntraders' agents remained embedded in the traditional African culture. Many of those Africans who became\nprosperous entrepreneurs -R. J. Ghartey, John Sarbah, W. F. Hutchison, Samuel Collins Brew -had been\napprenticed at an early age to work as retail store clerks, buying agents, or laborers either for their fathers,\nother relatives, or for European firms. Thus Henry Barnes, an indigenous merchant of Cape Coast, recalled\n\nLecture 12\nAfrican Entrepreneurship\nSTS.089, Fall '14\nin 1865 that he had begun his career as an agent for the London firms of Forster and Smith, but when he\nfound that he had made little profit under this arrangement he used the experience to take up trading on\nhis own account. Similarly, George Blankson, son of Chief Kuntu of Egya, served his apprenticeship under\none Thompson, an indigenous merchant of Winneba (Akita 1955) whose activities had extended as far as\nKumasi, capital of Asante. Such emphasis on youthful retailing experience as a key to later accomplishment\nin overseas trade is remarkably similar to the histories of many English and American merchants of the\neighteenth and nineteenth centuries (Dumett).\nHow not to connect politics and entrepreneurship\nDumett attempts the possible correlation between individual business success and close kinship ties with\ntraditional rulers: a significant number of leading entrepreneurs of the 1870s and 1880s were members of\ntheir local royal lineage; that is, they were the sons, nephews, grandsons, or grand-nephews of kings and\nchiefs. It is nonetheless true that members of royal lineages were accorded deference and favors, both in\nsocial life and in business, denied to ordinary people; the prestige of affiliation with a royal line facilitated\nentrance into large-scale trade by providing: (1) access to capital through loans, (2) access to resources (such\nas lagoon salt beds), (3) contacts with peasant producers in the interior, (4) assistance in local employment\nof workers, and (5) aid in laying a groundwork of business organization (Dumett).\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nSTS.089 Technology and Innovation in Africa\nFall 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "STS.089 Lecture 13: Pre-Colonial African Cities",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-089-technology-and-innovation-in-africa-fall-2014/848fc512b7fda26eef3076a1c3ea508e_MITSTS_089F14_Lecture13.pdf",
      "content": "STS.089 -- Technology and Innovation in Africa\nFall '14\nLecture 13 - Pre-Colonial African Cities\nAfrican Architectures: Rethinking the Architecture of the House of Stone\nProf. Clapperton Chakanetsa Mavhunga\nMIT OpenCourseWare\nVedzimbahwe is ChiKaranga for \"those of the houses of stone.\" It is a name that all the various groups that\nspeak the common root linguists call ChiKaNdaMaZeKo (ChiKaranga, chiNdau, chiManyika, chiZezuru,\nand chiKorekore) speak. The house of stone was a signature of their collective lineage, while the common\nlanguage acted as one of several technologies of fostering commonality and nationhood. The name Zimbabwe\n(chiZezuru for \"big house of stone\") is derived from the name dzimbahwe. Hwe is short for ihwe (stone), which\nin chiZezuru is pronounced bwe or ibwe. As they looked around for a symbol to rally different ethnic groups\n-including non-ChiKaNdaMaZeKo groups like amaNdebele and amaTshangana (19th century migrants from\nKwaZulu, South Africa) and maHlengwe (migrants from Musambike, or Mozambique)-the black nationalists\nfighting for independence in the 1950s chose dzimbahwe and its walls, which became the name of a republic\nin 1980, called Zimbabwe.\nThe word \"Shona\" was a name European itinerants gave to people who spoke ChiKaNdaMaZeKo. They\nlived in the high plateau between the Limpopo and Zambezi rivers, before the coming of the foreigners or\nntebele (SeSotho), under the leadership of Mzilikazi ka Mashobane, in the 1840s. European travelers then\ncorrupted ntebele into Ndebele and naturalized it as a designation for Mzilikazi's followers. The original\nmeaning of \"Shona\" is tshona (Zulu for \"to go under\"; amatshona (those who go under) was the name the\nZulu-speaking followers of Mzilikazi gave the ChiKaNdaMaZeKo-speaking peoples collectively, in reference\nto their tendency to take refuge in and fight from caves. Mzilikazi's people came increasingly to derisively\nrefer to amatshona as amasvina (those who are always dirty) or amaroli (literally \"blanket draggers\") or\norabarola ngubo (those who drag their blankets), meaning slaves (Taberer 1905, Selous 1893). I will use\nvedzimbahwe as a deep vocabulary that elders used to refer to all ChiKaNdaMaZeKo-speaking peoples as we\ngrew up.\nItineraries to and from veDzimbahwe\nDzimbahwe was a product of the migration of Bantu starting 3,500 years ago from northwestern Africa\nthrough eastern and central Africa, across the Zambezi to populate southern Africa. Today descendants of\nthe Bantu identify themselves as indigenous people and the owners of the land from whom white settlers\nforcibly grabbed the land from 1890 onwards. However, the original inhabitants of South Africa, Zim\nbabwe, Lesotho, Mozambique, Swaziland, Botswana, Namibia, and Angola are the San, who call themselves\nSho, Basarwa, or Khwe, whom the Bantu displaced. The first wave of Bantu arrived on the Zimbabwean\nplateau about the fifth-sixth century CE, settled and established farming communities in areas like Ziwa and\nGokomere. By the seventh century CE, these people had spread out all the way to the Mozambican and\nSouth African coastlines. Another wave of migrations from West Africa moved through the equatorial forest\nand settled in the western Zimbabwean plateau, eastern Botswana, and northern South Africa in fifth-sixth\ncentury A.D. (Brandt 1984; Ehret and Posnansky 1982; Vansina 1995; Oliver 2009; and Ehret 2001; Alves\net al. 2011; Castr`ı et al. 2009).\nBoth \"waves\" of Bantu migrations had spread out by seventh century CE to take advantage of the favorable\ngeophysical environment of the central watershed. The \"Ziwa\" farmers moved onto the area around what is\nnow Harare to farm on the fertile soils and pastures, well nourished by the good rains and almost perennial\nstreams. The \"Gokomere\" farmers settled in the woodlands on the south-southwest edges of the watershed\nin the Matopo hills and the Shashe-Limpopo basin up to Musina. Archaeologists call these successor settle\n\nLecture 13\nPre-Colonial African Cities\nSTS.089, Fall '14\nments \"Zhizo\" farming communities, the name being simply a placeholder for a people whose name will never\nbe historically known. In the seventh century CE, these two communities had settled enough to produce\ncommodities to trade with the Indian Ocean coast. Among the innovations generating such surplus were\niron, copper, and gold mining, smelting, and smithing, as well as ivory hunting and carving. These outcomes\nof local innovation were traded with Asian merchants for Chinese and Indian wares like glass beads, cloth,\nand ceramics. By the seventh-ninth century CE, this local production and surplus value had attracted the\nattention of the Arabian traders, who set up settlements along the eastern seaboard and increasingly acted\nas middlemen between the production centers in the hinterland and incoming overseas merchants ( Hall 1987).\nThe \"Zhizo\" are the ancestors of vaKaranga of southern Zimbabwe, who in the tenth century A.D. es\ntablished centralized political systems, starting with locations archaeologists denote \"Schroda\" (placeholder\nname) at the Shashe-Limpopo confluence. These settlers then moved to another site placeholder-named\n\"Bambandyanalo\" further west (but south of the Limpopo), perhaps economically distressed at the declining\ntrade with the Swahili. In any case, archaeologists speculate, \"Bambandyanalo\" probably became over\ncrowded after the eleventh century, forcing its rulers to shift the settlement to Mapungubwe, again south\nof the Limpopo, in the twelfth century. By 1300, the centers of power had shifted to Dzimbahwe (Great\nZimbabwe). It is often assumed that these farmers spread out into the Chivowa, Gumanye, and Dzimbahwe\nhills of what is now Masvingo not in the sense of walking there (foot-migration) but incremental spread of\nnew homesteads, villages, fields, and pastures in that direction (Pikirayi 2001). Recent careful attention\nto the conduct of power among vaKaranga (including speakers of chiZezuru, chiKorekore, chiManyika, and\nchiNdau) suggests that different successors to the throne did not have to move \"to the White House\" or \"State\nHouse\" in the western sense, but rule from their own homesteads. It seems likely that Chikowa, Gumanye,\nDzimbahwe, and even Manyanga (seat of later Rozvi power) were homesteads of succeeding incumbents,\ncontrary to earlier interpretations (Pikirayi 2001; Huffman 2005).\nFor this reason, speculations that mid-fifteenth century shifts in the geographic locus of power were a result\nof the declining power of a specific, fixed dynastic center where every incumbent ruled from may well be\nwrong. The state itself could well have continued to flourish, except that it was being rerouted through\ncontrol points the new ruler designated. This may account for the proliferation of not one but many dz\nimbahwe; each incoming incumbent ruled from one (Maund 1891, 1892). The traditions of Munhumutapa\nsuggest that Nyatsimba Mutota, a prince and heir, had left Dzimbahwe (Great Zimbabwe) to find salt in the\nMavhuradonha Mountains (Mt. Pfura?). Instead he established his own capital there and began ruling from\nthere, as did his successors. This new seat of power, archaeologists and historians say, thrived on the demand\nfor gold and other local products that the Portuguese settlements on the Zambezi provided, thus shifting\ntrade away from the Save River route leading between Dzimbahwe and Inhambane. The out-migration of\nMutota is also attributed to environmental decline.\nHowever, in chiKaranga (what is now called Shona culture), it is the tradition that when a father has\nmany sons, they never settle within the homestead, but to found their own as they become men, marry, and\nprepare to start their own families. Either the father accompanies the son and drives the peg (hoko) into the\nground marking the homestead and giving it stature (chiremerera), or the son, being a warrior-prince, took\na detachment of fighters under his command and marched on foot or on bullback, to a far away place, to con\nquer, subdue, and drive a peg in the ground marking his own homestead, village, and province. Sometimes\nit simply became a province of his father's vast domains (part and parcel of Karanga territorial expansion),\nor an independent domain (Zvarevashe).\nWhen establishing a village, a chiefdom, or a kingdom, the founder had to fortify his sovereignty not merely\nwith military force or political offices in charge of every kingdom. Sovereignty chiKaranga-style was not\nmerely a material, geophysical, political, or interhuman thing; the spiritual was, alpha to omega, the back\nbone and armor of power, life, and livelihood. The powers of the chief and the whole dzinza (clan) and imba\nyoushe (dynasty) resided in makona (clan medicines). Zimbuya guru (great ancestress), popularly known as\n\nLecture 13\nPre-Colonial African Cities\nSTS.089, Fall '14\nmbonga or sviba, kept these charms and was the most important person in the community after the chief.\nTo consummate the powers of makona, the king had to have intercourse with one of his sisters, who was\nto remain single -even celibate except for ritual purposes -for the rest of her life. In-so-doing, she became\nkeeper of makona and the most important woman in that community, to be defended to the death if ever\nunder military attack.\nThese spiritual fortifications do not usually constitute the narratives of Dzimbahwe or Munhumutapa pre\ncisely because their writers were either expatriate scholars engaged in surface rather than deep readings of\nAfrican cultural practices, or African scholars who simply rehashed such narratives. The latter group, com\nprising pioneering black scholars like Gilbert Pwiti, Innocent Pikirayi, and Weber Ndoro, may probably revisit\ntheir interpretations in light of a younger generation of archaeologists and historians who take chiKaranga\nseriously not just as a source of \"information\" for their own erudition, but as philosophy (Chirikure 2010;\nMavhunga 2014; Chikowero 2015). What if Dzimbahwe was abandoned because the war medicines of the rul\ning house had been comprised, had become powerless, the oracle said so, it was haunted by zvipoko (ghosts),\nor there were too many varoyi (witches)? What if the heir to the throne (perhaps Nyatsimba Mutota himself\nor his son Nyanhewe Matope) could not return to his forebears? dzitsi (stem, or homestead) to rule from\nthere, but chose to rule from Dande instead? None of these interpretations in any way prevents us from\naccepting that such movement and relocation of the seat of power enabled the new ruler to capture and\nmonopolize trade with a presence that had displaced the Swahili as middlemen: the Portuguese. Nor does\nit prevent us from seeing this innovative strategic relocation as one among several others in the Zambezian\nneighborhood, with the settlement of Ingombe Ilede on the Kafue-Zambezi confluence also exporting copper\nto the east coast in the late fourteenth century, one century prior to the rise of -and its own demise at the\nhands of -Munhumutapa (Pikirayi 1993; Pwiti 1996).\nThe biggest impediment to an innovative and critical introspection into Zimbabwe's and indeed southern\nAfrica's precolonial history is the almost slavish acceptance of Marxist modes of production and state-centric\ninterpretations of human-human and human-environment interactions. Archaeology serially focuses on the\nstate and the economy prime among other things, to the extent that the rise and fall of civilizations are\nreduced to economics and the environment's capacity to keep it going. That metanarrative has been the\nsingle most serious impediment to archaeology's otherwise best-placed capacity to anchor a history of African\ntechnology and innovation. The reason may well be that it is inevitably still also trapped in evolutionistic\ntemplates that force African archaeologists to have to start their chronology from a Western-centric notion\nof how things began, as opposed to an African notion of time and the origins of things.\nThus the story become one of the mobility of the physical environment from big bangs and volvanic erup\ntions (de-spiritualzed as the white man would want it to be), then the origins of species (as Darwin said and\nRobert Leakey and others prophesied), then hominid evolution, then hunting and gathering, then making\ntools in stone, then iron, then building in stones, then farming, then state formation, and so on. Nowhere in\nthis scheme is the African perspective of the origins of the earth and its constituents ever considered; it is\nalready presumed a myth, a fiction. From Zhizo, to Bambandyanalo, to Mapungubwe, to Great Zimbabwe\nto Mutapa, it is already one teleology towards a version of cultural evolution already appropriated in the\nWestern register. There is nothing more to say.\nTo return to migrations -it seems that the issue of foot mobilities in the founding of Dzimbahwe across\nZambezia is not one of migrations per se but also of families outgrowing their natal home and, as children\nbecame adult, marrying and setting up their own household as culture dictated. As chiKaranga says, chava\nchigondora chava chimombe, kusagona kutunga urema hwacho (a bullock is a bull, inability to fight is its\nown laziness). Mutota was staying true to this dictum. As he marched north towards Mount Pfura to realize\nhis own manhood, he carried with him the innovative traditions of his ancestors, and in so-doing carried\ndzimbahwe with him, and built it in Dande. So did many other veDzimbahwe (the name given to male\nvaKaranga): they carried the architectural tradition of stone masonry with them and built their on rusvingo\n\nLecture 13\nPre-Colonial African Cities\nSTS.089, Fall '14\nrwemabwe (stone walls) around their homesteads. He brought his ancestors with him; he brought Dzimbahwe\nwith him, for when vaKaranga migrated from one place to another, they took soils from the graves of their\nancestors and their ancestral homesteads and reburied them in new cemeteries and new homesteads. That\nway, there was no alienation between ancestor and living forebear; the ancestors not only came along with\nthe itinerants even as they stayed watch on those left home. They also guided the itinerants, for as indicated\nelsewhere, life -let alone journeying -among vaShona (vaKaranga) was guided mobility (kutungamirirwa).\nThus, when all trade shifted away from the Limpopo-Save axis to the feiras (markets) along the Zambezi\nvia the courts of Munhumutapa, such good omens were attributed never to supply-and-demand or political\npower alone, but to kutungamirirwa nemhondoro (ancestral spiritual guidance).\nThe Falsehoods Begin\nWhen civilization took the form of sophisticated technological innovation, the white traveler usually found\nthis too good to have been come from the mind and hand of the black man. First emphasizing that they\nfound certain buildings in \"ruins\" (thereby blurring the quality of the craftsmanship), the white man next\nmoved quickly (having asked no one) to conclude that they had no further information about such \"ruins\"\nand their history. Thus rendered of murky origins, the \"ruins\" could then be subject to instant, on-the-spot\nspeculation as the traveler sat munching a roasted buck or buffalo sirloin steak by the campsite. The En\nglishman Theodore Bent readily decided that the builders of Dzimbahwe were southern Arabians.\nShona Ancestors: Bent (1892): they were negroes, naked except for panther skins; they filed their teeth\nand were cannibals; they fought with long lances and had ambuscades for game. They had no religion except\nthat sort of witch doctor occasionally addressed them and bade them remember the prowess of their ancestors.\nShona Ancestors: Hungwe/Chapungu and Gora/Vulture: \"The outer wall of this temple was deco\nrated with birds carved on the summit of soapstone beams five or six feet in height; of the six and from its\nbeak we can easily see that it is intended to represent a vulture. Two have decorations down the back and\nround the neck, and one has four circles out on it, two on the wings and two below, presumably to represent\nincubation and fertility.\" (Bent 1892)\nFrederick Selous\nThe German Heinrich Schlichter (1893) disagreed: only \"a very rude people possessing no written characters\nand doing all their building by eye and without measurement\" could have built such a bad structure. Selous\nspeculated:\n\"Well, we will suppose that two or perhaps three thousand years ago a commercial people pen\netrated from Southern Arabia to Mashonaland. They were acquainted with the requirements of\nthe civilized nations of Asia at that period and understood the value of gold. This metal they\ndiscovered amongst the hills and in the streams of Mashonaland. It time these Arabian merchants\ngained a footing in the land and taught the black aborigines to mine for them. Their principal\nstation was at Zimbabwe, where they built, with the forced labour of the aborigines, a temple for\nthe worship of Baal, and a strongly-built and well-situated fortress. But I take it, that, like the\nArabs in Central Africa at the present day, these ancient Arabians brought a few or no women\nwith them, but took a very handsome allowance of wives from amongst the aboriginal blacks.\nFor a long period intercourse was kept up with Arabia, and during this period the gold seekers\nspread over the whole of South-eastern Africa from the Zambesi to the Limpopo, everywhere\nmixing with the people, and teaching them their own rude arts of wall-building and gold-mining.\nIn the course of time, we will suppose, that events happened in Arabia which put an end to\nall intercourse with the distant colony in Mashonaland, and as time went on, as the alien race\nwere still in small numbers, compared with the aboriginal blacks, and as they had none of their\nown women with them, they gradually became completely fused, and nationally lost among the\n\nLecture 13\nPre-Colonial African Cities\nSTS.089, Fall '14\naborigines.... At any rate I am absolutely convinced that the blood of the ancient builders of\nZimbabwe still runs (in a very diluted form if you like) in the veins of the Bantu races.\" (Selous\n1893).\nIn other words, it was not even possible for Selous to speculate that the black race might have built Dzim\nbahwe. If any such existed in their genes, then even such genes were not originally from Africa but of outside\norigin:\n\"On my theory the blood of the ancient worshippers of Baal still runs in their veins; very much\ndiluted, no doubt, but still in sufficient strength to occasionally produce amongst them men with\nlight-brown skins and high features, and sometimes of great intellectual power. After a certain\nlapse of time, when the higher race had become entirely fused and practically lost amongst the\nlower and more numerous aboriginal people, the worship of Baal died out, and was superceded by\nthe old religion of ancestor worship which still prevails.... But I maintain that the wall-building\nand gold-mining, originally learnt from the ancient Arabians, were carried on continuously from\nthe first inception up to the middle of the present century\" (Selous 1893)\nNo Evidence of High Civilization\nSelous concluded:\n\"In the foregoing pages, I have endeavoured to show that there is no evidence that any high form\nof ancient civilisation ever existed in South-Eastern Africa at all, whilst many facts go to prove\nthat the two industries or arts which are supposed by many to separate the ancient inhabitants\nof the country from the Bantu people living there at the present day, namely, gold-mining and\nwall-building, have only been abandoned very recently\" (Selous, 1893: 316).\n\"The original builders of the temple came from a country where that form of worship is known\nto have been practised in very ancient times; but I do not believe that this foreign race, in its\npure state, spread over the whole country between the Zambesi and the Limpopo, and did all\nthe gold-mining and wall-building that has been done in that vast territory, and was then utterly\ndestroyed and supplanted by a more barbarous people. The evidence available seems to me to be\nfar stronger in favour of the theory which I have advanced of the gradual fusion of a numerically\nsmall number of a race of traders and merchants, who were themselves in a low state of civilisation,\nwith the aboriginal inhabitants of the country. Thus alone can I account for many things: the\nlong continuance and the gradual deterioration noticeable in the wall-building in Mashonaland;\nthe ingrained inherited impulse which causes the Barotsi of the Upper Zambeesi, who are an\noffshoot of the Baritsi of Mashonaland, to still carve the same chevron patterns on their pottery,\non their knife sheaths, and on their wooden pots and bowls, that the ancient worshippers of Baal\nrepresented in stone-work round the Temple of Zimbabwe and carved in soapstone hundreds or\nthousands of years ago. Add to this that the wooden bowls themselves still retain the same form\nas the ancient ones carved in soapstone; that the wooden carvings of animals made at the present\nday, and the rude bas-reliefs on the soapstone bowls are the products of the same school of art, and\nthe fact that the Bantu races inhabiting Mashonaland and adjoining countries to-day are subject\nto atavism or reversion to a type of man, which is Asiatic or semitic rather than negroid, and it\nseems to me that only one theory is possible, which is that the ancient builders of Zimbabwe were\nnot first destroyed and then supplanted by an inferior race, but that they became gradually fused\nwith a lower race, which still bears traces of its admixture with the more intelligent people.... It\nis not to be wondered at that the native races inhabiting [Mashonaland] should have abandoned\nsome of their arts and industries, and become the timid and broken-spirited people which they\nare now (Selous 1893: 317)\n\nLecture 13\nPre-Colonial African Cities\nSTS.089, Fall '14\nMadzimbahwe beyond Dzimbahwe\nSelous 1893:\n\"I maintain that, so far from there having been an abrupt transition from a people who built the\ntemple of Zimbabwe to a race who never put one stone upon another, the inhabitants of Makoni's\nand Mangwendi's countries in South-eastern Mashonaland, only ceased to surround their towns\nwith well-built stone walls during the last generation, when they found that these walls offered but\nan inefficient protection against the Zulu hordes of Manikos, and his son, Umzila, by whom their\ncountry has been continually ravaged during the present century. The more ancient the towns\nappear to be, however, the better, speaking generally, they have been built; and in Makoni's\ncountry, at any rate, there is clear evidence that there has been a gradual deterioration from a\npeople who were capable of building walls which will compare with any part of the great Zim\nbabwe, to the very inferior hut-building barbarians of the present day. Makoni's [Father of the\npresent chief] town as it now stands is a monument of filth and uncleanliness, and is undefended\nby anything but a small fence. His old town which I also visited, aand from which I believe he\nwas driven by Umtasa, was surrounded by a moat and loopholed mud wall, whilst the town,\nwhich it is said was built by his ancestor, Chpadzi, was surrounded by a well-built, hoopholed\nstone wall. This is one of the best old walled towns I have seen. I visited it for the first time in\nOctober, 1890, and again last year. There are many other walled towns in the district, some of\nthem reminding one strongly of the fortress on the wall at Zimbabwe.\nLet me here make an extract from my diary, bearing date October 19th, 1890. \"On that day I\nleft Makoni's and passed some very curious old ruins. First, there was a hill on which were built\nseveral concentric walls and the stone foundations of round huts, the whole being surrounded by\na moat. A little further on, there was a small kopje composed of a few large blocks of granite,\nsome of which were piled up in the centre in the form of a tower. The whole of this kopje was\nenclosed by a very well-built wall about 200 yards in circumference, 8 feet in thickness, and 10\nfeet in height. The stones composing this wall have the appearance of having been cemented to\ngether with mud, which is the first time I have ever noticed anything of the kind in South-eastern\nAfrica. Through this wall there were four entrances, apertures about 4 feet in height, and 2 1/2\nfeet in breadth. These apertures were let into the base of the wall, and were roofed over with\nlarge flat slabs of granite. Inside this wall were the foundations of numerous round buildings.\nThese foundations were all very well built of closely fitted pieces of squared granite, and were\nabout 18 inches in depth. The huts that were built upon them must have been at least four times\nthe size of the huts used by the natives at the present day.... In the centre of Umtasa's deserted\ntown on the Chodzani River, a town which he built himself, and from which he was driven a\nfew years ago by the Abagaza, will be found a similar hut foundation, very carefully built of\nsmall slabs of granite, beautifully fitted without mortar or cement, which proves that the art of\nbuilding (315) walls of carefully fitted granite stones is not even yet dead amongst the Mashonas.\"\nHowever, let me return to the walled town of Makoni's ancestor. Besides the four entrances\ninto the stronghold, there were numerous small holes let into the wall, some of which may have\nserved as loopholes through which archers discharged arrows, but others, from their position I\njudge to have been intended for drains to carry off water. This stronghold is said to have been\nbuilt by Chipadzi, the ancient chief of all this part of the country and an ancestor of Makoni's.\nThe name of the walled town is Chiteketi.\nAbout half a mile from this old walled town was the burial-place of Chipadzi, one side of which\nwas enclosed by a beautifully built wall about 10 feet high, of evenly laid and squared granite\nstones, most carefully fitted together without mortar or cement of any kind. This wall was an\nexact facsimile of the best built portions of the great Zimbabwe, and no one who has examined\n\nLecture 13\nPre-Colonial African Cities\nSTS.089, Fall '14\ncarefully both these relics of a bygone age, can doubt for an instant that they were both built\nby the same race of people. This place is the Zimbabwe or temple of Makoni's people, and is\nspoken of by them as \"The Zimbabwe.\" Here in time of national trouble the chief slaughters\ncattle, and makes propitiatory offerings to the spirit of Chipadzi, and private individuals make\nofferings of goats, fowls, or pots of beer. Now there is no tower or indeed anything to make one\nbelieve that this Zimbabwe was ever connected with Phallic worship. It was probably built long\nafter the great temple, when the Arabian element had become lost amongst the more numerous\naboriginal race, and when the people had replaced the worship of Baal by the still older form of\nancestor-worship.\nThe enclosure is probably simply the burial-place of Chipadzi, but the wall could not have\nbeen better built had it been the work of the actual builders of the great temple.... The word\nZimbabge or Zimbabghi (the form used by the natives in the neighbourhood of the ruins) is in\nall probability derived from the words \"umba\" or \"imba,\" a building, plural zimba, and \"mubge,\"\n\"stones,\" these words being used at the present day in Mashonaland. Thus Zimbabge means the\n\"buildings of stones,\" and there were no other buildings except grass thatched huts, came to have\na special significance and may be best translated by the English word \"Temple\".\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nSTS.089 Technology and Innovation in Africa\nFall 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "STS.089 Lecture 17: Leadership & Culture",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-089-technology-and-innovation-in-africa-fall-2014/4b311f407c29ee07f95420917319bddd_MITSTS_089F14_Lecture17.pdf",
      "content": "STS.089 -- Technology and Innovation in Africa\nFall '14\nLecture 17 - Leadership & Culture: Indirect Rule\nProf. Clapperton Chakanetsa Mavhunga\nMIT OpenCourseWare\nThe (Ab)use of Endogenous Governance Systems\nThere were such fundamental differences between the French and British systems that, even if both did\nmake use of \"chiefs,\" it is not possible to place the French system of native administration in the same\ncategory as British Indirect Rule. It is true that both powers had little alternative to the use of existing\npolitical authorities as a means of governing their vast African empires, and in most cases these authorities\nwere headed by chiefs. What is important is the very different way in which these authorities were used.\n(Crowder)\nNorthern Nigeria\nThe British in Northern Nigeria, which became the model for indirect rule, believed that it was their task\nto conserve what was good in indigenous institutions and assist them to develop on their own lines. The\nrelation between the British political officer and the chief was in general that of an adviser who only in\nextreme circumstances interfered with the chief and the native authority under him. However, where chiefs\ngoverned small political units, and in particular where their traditional executive authority was question\nable, the political officer found himself interfering in native authority affairs more frequently than ideally he\nshould. This was true in many parts of East Africa and in parts of Yorubaland, where the borderline between\n\"advisory\" and \"supervisory\" in the activities of the political officer was not always clear. Though indirect\nrule reposed primarily on a chief as executive, its aim was not to preserve the institution of chieftaincy as\nsuch, but to encourage local self-government through indigenous political institutions, whether these were\nheaded by a single executive authority, or by a council of elders. (Crowder)\nLugard himself had insisted on a reform of the indigenous taxation system and of the administration of\nnative justice when he was Governor of Northern Nigeria and believed that, while the colonial government\nshould repose on the chiefs, their administration should be progressively modernized. And, though his suc\ncessors left them largely to themselves, Sir Donald Cameron, Governor of Nigeria from 193I to 1935, who\nhad introduced indirect rule to Tanganyika and held similar beliefs to those of Lugard, was shocked by the\nsituation in Northern Nigeria, where he felt the emirates were fast developing into Indian-style native states.\nThere was thus a minimal undermining of the traditional sources of authority. The main change for the Fu\nlani Emirs of Northern Nigeria, for instance, was that they now owed allegiance to the British Government\nrather than to the Sultan of Sokoto, and collected taxes on its behalf, though they retained, in most cases,\n70% of the amount collected for the administration of their native authority.\nThere were notable exceptions, especially in Eastern Nigeria, where the absence of identifiable executive\nauthority in most communities made indirect rule as practiced in Northern Nigeria almost impossible to\napply. In such societies, there was British assiduity in trying to discover chiefs or invent them. The British\nsystem depended on the advisory relationship between the political officer and the native authority, usually\na chief. The British political officer in Kano actually called on the Emir when he had business with him and\npaid him the compliment of learning Hausa so that he could speak to him directly.\nContrast the position of the Emir of Kano with that of the Alaketu of Ketu in Dahomey. By tradition,\nhe was one of the seven most important rulers in Yorubaland, on an equal footing with the Oni of Ife and\nthe Alafin of Oyo. A friend who visited him while Dahomey was still under French rule found him waiting\noutside the French Chef de Subdivision's office and kept him waiting a little longer. (Crowder)\n\nLecture 17\nLeadership & Culture: Indirect Rule\nSTS.089, Fall '14\nCriteria for Chefs de Canton\nIt is clear then that the French explicitly changed the very nature of the powers of the chief and that \"his\nfunctions were reduced to that of a mouthpiece for orders emanating from outside.\" The Chefs de Canton\n(&c.) are recruited:\ni. for preference from among the descendants of old families traditionally or customarily destined to\ncommand\nii. from among notable natives, literate if possible, who have rendered services to the French cause and\nwho are fitted to fill these functions by their authority or influence in the country\niii. from among the Chefs de Canton (&c) who have satisfactorily carried out their functions for at least\nfour years\niv. from among old soldiers who have completed more than the normal terms of service and who qualify\nfor special treatment\nv. from among local civil servants (clerks, interpreters, &c.) who have worked satisfactorily for at least\nfour years in the public service\nThe following are the disciplinary measures applicable to Chefs de Canton (&c.)\ni. reprimand by the Chef de Department\nii. temporary withholding of salary\niii. temporary interdiction\niv. reduction of salary\nv. dismissal\nSince the chiefs did not, except in rare cases, represent traditional authority and since they were the agents\nof the colonial power for carrying out its more unpopular measures, such as collecting taxes and recruiting\nfor labor, they were resented in most parts of French West Africa. While they retained no traditional judicial\nauthority such as that of their counterparts in British West Africa in their Native courts, they were agents\nof the law and in this case the unpopular system of summary administrative justice known as the indigenat.\n(Crowder)\nIn Light of Complaints about the Corruption of Traditional Leaders...\nHence it was not surprising that when, in 1957, just before the independence of Guinea, Sekou Toure (then\nVice-President du Conseil) decided to do away with chiefs. The operation was effected with remarkably\nlittle protest from either the indigenous population or from the French administration that had made use\nof them. The chiefs no longer possessed political traditional authority and had become mere agents of\nthe administration. This is a far cry from Nigeria of the day, where in the North the opposition party\n(N.E.P.U.) were trying unsuccessfully to rouse the people against the chiefs and where the Government of\nEastern Nigeria. In African countries where the British had imposed chiefs, as in Eastern Nigeria and parts\nof Uganda, their prestige had in fact gone up, but this has certainly not been true in the former French\nterritories. (Crowder)\n\nLecture 17\nLeadership & Culture: Indirect Rule\nSTS.089, Fall '14\nPaternalism/Separate Development vs Assimilation/ evolu e\nWhy this great difference in approach by the two powers to the question of native administration, given that\nboth for reasons of economy had to administer their vast African possessions with the aid of \"chiefs\"? The\ndifference has much to do with difference in national character and political traditions. While few would\ndisagree that the British were inspired by the concept of separate development for their African territories,\nthere is still much debate as to how far the French were inspired by the concept of assimilation even after\nits formal abandonment as official policy in favour ofapolitique d'association. (Crowder)\nDavid Henige & the Complexity of (In)direct through Chiefly Political Systems\nin \"Ghana\"\nHere, then, the problem should not be considered so much as deviation from a \"norm\" since these stools,\nmostly established after the arrival of the Europeans on the coast, were influenced as much by earlier Guan\npractices and by intrusive European institutions as by those of the Akan.\nIn 1939, the District Commissioner at Cape Coast thought that the Mkusukum electors \"may seek a candi\ndate from some other family should the present stool family [Twidan] not produce a satisfactory candidate\nin the near future\" and he advised them not to change without government sanction. (Henige)\nInterference & Instrumentalization of African Endogenous Governance Systems\nIn Dadiesoaba, an Asante stool, there was a change from \"the rightful line\" at some indeterminate time. In\nAjumaku, the State Council decided in 1931 to \"change the line of succession\" since it was \"dissatisfied with\nthe manner in which the Stool Family [has] conducted the affairs of the State.\" The Council advanced the\nargument that the unwanted stool family had only been \"caretakers\" after all and that the change was no\nmore than a return to an earlier, more correct, state of affairs.\nAny change in ruling line, no matter how permanent it had become, could easily be interpreted as orig\ninally having been intended as a temporary expedient. Occasionally this argument, when advanced by the\n\"original\" ruling line, was successful. But if the \"new\" line had been ruling for a reasonably long period,\nthe colonial administration usually rejected the plea for reversion unless other considerations supervened.\nChanges in ruling line have almost certainly occurred in other Akan paramount stools; regrettably, though,\nthe data for these are less full and unambiguous. (Henige).\nDistortions & Caricatures\nAlthough because of broad eligibility, succession undoubtedly circulated widely in the precolonial period,\nthe perception of a rotating system of succession was probably the result of the practice of the Gold Coast\ngovernment after c. 1915 to require that a questionnaire be completed before an election could be confirmed\nand gazetted. Among the questions were those asking how many \"houses\" were eligible to fill the paramount\nstool and the \"house\" to which the applicant belonged.\nWe know that one Kwamina Hammah had been enstooled in 1889 and that his ancestor Hammah had\nbeen destooled about twenty years before that, after which members of a different house (or abusua?) seem\nto have ruled. After 1889, however, only members of the \"restored\" line had been elected. (Henige)\nDirect Interference to Regularize Stools as Structures of \"Indirect\" Rule\nIn their dealings with African traditional authorities, the British sought to impose a hierarchical system at\nthe apex of which a large number of rulers were recognized as amanhin or \"Head Chiefs\" and granted juris\ndiction over a number of other stools. The implementation of this structure, principally between 1895 and\n\nLecture 17\nLeadership & Culture: Indirect Rule\nSTS.089, Fall '14\n1905, was adventitious and based as much on expediency and reflexive response as on any close appreciation\nof the dynamics of the traditional political structure.\nIn both Agona and Gomoa, substools claimed and eventually received paramount status with the former\nparamount stool lapsing into subordinate status. In Agona (that is, Fante, and not Asante Agona) the\nNyakrom stool was recognized as paramount over Agona state in 1931, replacing the Nsaba stool, which had\nbeen recognized as paramount by the British in 1905, and apparently by the Agona themselves long before\nthat.\nThe British, who also were familiar with the printed versions of this episode, accepted the Nyakrom ruler's\nassertion that his ancestors once held the paramountcy but the decision to transfer recognition was based\non what appeared to the colonial authorities to be widespread dissatisfaction with the Nsaba ruler. The\nexperiment (as, from the British point of view, it was) was not a success. Of the five Nyakrom amanhin\nbetween 1935 and 1944, two were destooled, two others abdicated to avoid destoolment, and the fifth was\nkilled in a motor accident. Not surprisingly the British regarded the situation as \"a real nightmare\" and\nreconstituted Nsaba as the paramount stool in 1945. But affairs in Agona had become too complex to be\nresolved so easily and eventually both Nsaha and Nyakrom were recognized as paramount stools by the\nNational Liberation Council in 1968. (Henige)\nTraces & Their Uses\nWere the widely variegated succession patterns discussed here the result of colonial exigencies or do they\nrepresent merely the continuation, perhaps even in attenuated forms, of aspects of Akan political culture\nbefore the advent of colonial rule? The first problem concerns the nature of our sources for traditional\nstool politics during the colonial era. Little of our information about Akan succession practices -whether\npre-colonial or colonial -is derived from unbiased data. The available records consist primarily of testimony\ngiven during stool, succession, and jurisdictional disputes and enquiries into public disorders.\nIn putting forward this view it is important to remember that the testimony advanced in support of succes\nsion changes usually cited pre-colonial precedents. Some of the anomalies of succession practices in Offinsu\nhave been attributed by Crook to the willingness of the Offinsu traditional authorities to play \"the colonial\ngame\"; that is, to be percipient enough to recognize British predilections and to seek to conform to them by\nciting traditional precedents. (Henige)\nNew Wine, Old Bottles\nWas this \"colonial game\" a new departure or did it represent a continuation of previous activities with only a\nchange in the identity of the paramount? The introduction of new elements like the questionnaires stimulated\nwhat were likely to have been new responses, but were these not perhaps more in the nature of new wine in\nold bottles? (Henige)\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nSTS.089 Technology and Innovation in Africa\nFall 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "STS.089 Lecture 21: Bibles",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-089-technology-and-innovation-in-africa-fall-2014/1bbb4e87ad8a27d3208c6b0268e3f5ea_MITSTS_089F14_Lecture21.pdf",
      "content": "STS.089 -- Technology and Innovation in Africa\nFall '14\nLecture 21 - The Bible in African Hands\nProf. Clapperton Chakanetsa Mavhunga\nMIT OpenCourseWare\nSo far we have dealt with two technologies that were introduced to Africa from outside. In the case of horses,\nthe smaller ones were original to West Africa, but the bigger ones were shown by Fisher to have come from\nthe Levant. In the case of guns, we saw them coming into South-Central Africa (the upper Zambezi area of\nZambia) from Angola, thanks to the Portuguese-African trade that began in the 1500s and continued well\ninto the 20th century, fuelled, of course, by the trade in Africans as slaves.\nNow, today's lecture/discussion tries to connect horse and gun to a larger discussion of how African leaders\n(whom we discussed under \"indirect rule\") and their communities both solicited, deployed, managed, and\ndefined things from means and ways of executing certain self-contrived objectives. Bibles and priests and\nnext lecture books and writings fall nicely into that expos e. I wish to state clearly where the initiative of\n\"technology transfer\" -such a bad word! -lay, if such is to be the term to describe it: with Africans them\nselves, as designers of their own, self-contrived destiny.\nThus Botswana in the lives and times of Bangwato chief Khama and Bakwena chief Sechele might be read\nas a site where Africans were engaged in defining outsiders and things from outside according to their own\nstrategic interests. What interests were these and how were they met through the bible and its European\nbringers to Botswana?\nOur source: J. Mutero Chirenje, \"Church, State, and Education in Bechuanaland in the Nineteenth Cen\ntury,\" International Journal of African Historical Studies 9, 3 (1978), 401-418\nEuropean Missionaries among Batswana: An Outline\nThe earliest missionaries the LMS sent to Batswana in the early were more interested in ivory than in\nevangelism. By Batswana, I mean different peoples speaking the same language, Setswana -Bathlaping (the\nfish people), Bakgatla, Bangwato, Bakwena, Bahurutshe, Batawana, and so on. One Setswana speaker is\ncalled Motswana; more than one is Batswana. The place that Batswana live is called Botswana.\n1840s: LMS expansion into northern Tswana chiefdoms\n1841: Livingstone arrives at Kuruman\n1844: he opesn Mabotsa mission in Kgatla territory with a subsequent station at Chonwane (the Knewa\ncapital)\n1851: Livingstone leaves to start his expeditions to the Zambezi and Central Africa\nNo white missionaries replaced him, but from 1857 the German missionaries arrived at the invitation of\nthe Batswana chiefs playing the British off against the Germans and Afrikaners. Hurt by this, the British\nexpanded more rapidly, as most of the British missionaries in Bechuanaland, especially Robert Moffat and\nJohn Mackenzie, were strongly committed to extending the British empire.\nWhy Did Batswana Leaders Invite Missionaries?\nTechnological Reasons\nIn 1816, Read observes that \"the chief is the center of everything done in the [Tswana] tribes. He is the one\nwho can pray to God\". Missionaries had the ability to offer Mothibi foreign goods, handkerchiefs, beads, and\ntobacco, and sent Mothibi and gun. The chief \"either breakfasts, dines or sups with me almost everyday\"\nand was fond of bread. He thought of introducing wheat farming as a bait to lure people to the gospel.\nA special feature of the missionaries' presence among Batswana was that in all but one case, Mothibi's, it\n\nLecture 21\nThe Bible in African Hands\nSTS.089, Fall '14\ncame about at the invitation of the Tswana rulers. And each time the chiefs were impelled less by religious\nmotives than by military and economic considerations. Missionaries were known to procure and repair guns,\nweapons which had assumed an important role in hunting and warfare. Some chiefs hoped to learn how\nto manufacture weapons themselves, and other show to \"make rain\" by using the white man's method of\nbuilding dams, an important skill in a semi-arid environment. Little wonder that early missionary reports\ndepict the Tswana as more impressed by the white man's technology than by his Christian doctrine.\nIn 1817, Hamilton sinks a well to drive this point home. Mothibi did eventually receive the gun he had\nbeen promised. Tswana rulers took considerable pains to provide their new guests with food, shelter, and\nsome amenities. In return they expected to use them as middlemen in acquiring guns and only marginally as\nteachers. Mission schools taught reading, writing, and arithmetic, with classes conducted in crude buildings\nconstructed by workmen provided by the chief. In more desperate cases wagons, trees, and the chief's court\nimprovised as classrooms. Pupils used stone walls, planks, and parts of broken boxes to write on. Wives of\nmissionaries conducted sewing lessons in their homes.\nPolitical Reasons\nLivingstone had baptized Sechele in 1848 despite great opposition from Sechele's subjects, who maintained\nthat baptism would compromise his position and all that it stood for. But Sechele had made up his mind to\nalign his chiefdom with the British, and he was willing to sacrifice some of the metaphysical attributes of his\noffice in return for protection against the aggressive Afrikaners. Sechele had strategic as well as diplomatic\nproblems; chief among them was the incessant menace of the Afrikaners, who poached on Kwena territory\nand occasionally skirmished with Kwena soldiers. In a shrewd diplomatic move, Sechele sought to neutralize\nhis antagonists by involving them in the religious life of his chiefdom. He asked the president of the South\nAfrican republic, Andries Pretorius, to provide him with missionaries. Pretorius was flattered; moreover,\nhe saw the request as a perfect means to expand Afrikaner influence and territory in Central Africa. He\npersuaded the Hermannsburg Society, which had been working in Natal since 1854, to accept Sechele's invi\ntation, and in 1857 the society sent Schroeder to the Kwena chiefdom; not to be outdone, Chief Sekgoma of\nthe Bamangwato sent a similar plea.\nThe arrival of German Lutherans incensed British missionaries, and in 1857 Robert Moffat asked Sechele\nif the Germans were evangelizing in his country and the chief pleaded ignorance. But a few years later,\nSechele concluded that an alliance with the British was more useful than one with the Afrikaners in preserv\ning a measure of his sovereignty, and he mounted a campaign to expel the Hermannsburgers and to restore\nthe LMS. Sechele and his btother Kosidintsi wrote to the LMS directors in London: \"we do not desire the\nteaching of the Germans and will receive the teaching of the English alone.\" The LMS dithered, and Sechele\npersisted in his requests for an English moruti.\nWhy Were African Leaders Wary of European Missionaries?\nYet despite these technological feats, the Tswana remained indifferent to Christianity. In 1822 Hamilton\nreported, \"I would be very glad if I could inform you that God's work is going forward in this place, but I\nmust write nothing but the truth. So far as I know, no one of these heathens are seeking after God.\" Below\nthe outward show of friendship lay an iceberg of resentment. Mothibi was afraid Christians might undermine\nhis authority. Many kept from coming to hear the gospel, and children were kept from school. He was afraid\nthat sooner or later the missionaries would usurp political power; this is what the church did, seeing strong\nstate power as an obstacle to evangelism.\nAt Shoshong, the rift between the traditionalist Chief Sekgoma and his Christian sons, Kgama and Kgamane,\nculminated in the civil war of 1866, one of the most tragic encounters between Christianity and traditional re\nligion in Tswana history. Although the balehuku party lost to Sekgoma, LMS agents subsequently supported\nKgama in a plot to depose the Ngwato chief, Macheng, which was successfully carried out in 1872.\n\nLecture 21\nThe Bible in African Hands\nSTS.089, Fall '14\nThe Bible in African Hands\nSechele, Bakwena, and the Bible\nAfrican rulers combined their secular duties with preaching. Moreover, he described himself as specially\nsuited to teach because he knew the scriptures well. Sechele in particular mastered the alphabet in just one\nday and became an eager student of the scriptures, who then went on to interpret them, rather masterfully,\nin like of the experience of his own Bakwena people. He read the Bible exhaustively, and raised some rather\nuncomfortable questions for the missionaries. For example, in 1854, Robert Moffat could not readily answer\nSechele's challenge that he explain to the Kwena \"why the missionaries had made him discard all but one of\nhis wives, while Solomon and David had so many wives and concubines, and were still 'men after God's own\nheart.'\" Sechele grew so dissatisfied with the educational opportunities in Bechuanaland that he proposed to\nstudy theology in England, a scheme he shelved owing to his shortage of funds. Several pupils were repelled\nby the doctrinal assumptions in the Congregational and Lutheran creeds as well as by inept teaching. Several\ncatechists complained to the missionaries that they closed their eyes and tried to talk to Jesus without success.\nSeveral traditionalists maintained that the Tswana needed no such instruction since they had evolved their\nown methods for communicating with God. A Kwena rainmaker rejected Livingstone's homily that Christ\nalone could provide rain. \"But God has told us that there is only one way by which we can pray to him\nacceptably: viz., by Jesus Christ,\" Livingstone said.\nAnd the rainmaker said: \"Truly. And he has told us differently. God has been very good to both white and\nblack. To the white he has given the knowledge of guns, gunpowder, horses, and many other things which\nwe know nothing about. He has given you wisdom too. We see it. To us blacks he has not been so liberal,\nbut he has given us the knowledge of rain-making; you have it not. Now we don't despise those things God\nhas given you, though we are ignorant of them. Nor should you despise what he has given us, though you\ndon't known or understand them.\"\nIn 1897, fifty years after his first encounter with Christianity, Sechele's elder Kosidintsi still refused to\nget converted, \"No, Monare [sir],I can not allow it -I shall die as I have lived, and God who knows my rea\nsons will judge me righteously.\" And the priest, the Reverend Williams, was impressed: \"Nothing could move\nhim, and we came away admiring the old man for his consistent attitude.\" And of Sechele, the departing\nReverend Price could only say, with resigned admiration: \"I shall feel in parting from him that I am parting\nfrom one who has on the whole treated me with much kindness and generosity.\"\nKgama and the Bible\nAs we saw, Kgama's ascension to the Ngwato throne owed to a clash between balehuku (children of the book)\nand balechulo (traditionalists). Kgama assumed the office with messianic pretensions bound to impinge on\nthe white missionaries' clerical role. For example, in 1890 Kgama warned a missionary not to meddle in\nNgwato politics, saying: \"Now I am chief of the country. You are a teacher. I cannot allow any teacher to\nact and speak as if he was a chief of my town -The Lord Jesus Christ who made you a teacher has made me\na chief, and He knows how I try and have always tried to rule my people for their good.\"\nThere were serious conflicts between Kgama and Reverend James D. Hepburn in 1891, which revolved\naround whether the chief or the missionary should have ultimate control where secular and Christian pre\nrogatives overlapped. Hepburn asserted that he was the spiritual leader of the Ngwato church, while Kgama\nmaintained that as a Christian head of state -he was baptised into the Lutheran church by German mis\nsionaries in 1860 -he was responsible for constructing new school buildings, as he was for any public work.\nBut Hepburn refused to yield, and according to some Ngwato informants even fomented sedition. For ex\nample, when his communicants asked him, \"Should the chief call out our regiment as usual, are we to obey\nthe chief to go and do whatever he asks?\", Hepburn is reported to have replied, \"No -you must not obey\nthe chief; you are the servants of Christ, and you must obey Christ alone.\" Kgama saw himself as Christ's\n\nLecture 21\nThe Bible in African Hands\nSTS.089, Fall '14\nrepresentative at Shoshong. Yet Kgama, whom whites had lavished with praise for his Christian leadership,\nfelt he had sufficient credentials to lead the church, and in consequence transferred all LMS church meetings\nto his court. To Hepburn, this move was the height of interference in church affairs, and his temperamental\ncharacter could not bear it. he left abruptly for Cape Town for good in December 1891.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nSTS.089 Technology and Innovation in Africa\nFall 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "STS.089 Lecture 22: Books & Letters",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-089-technology-and-innovation-in-africa-fall-2014/7d61265ee2b5e7488999e383c4106b7b_MITSTS_089F14_Lecture22.pdf",
      "content": "STS.089 -- Technology and Innovation in Africa\nFall '14\nLecture 22 - Books: From Tools of Empire to Tools of Self-Liberation\nProf. Clapperton Chakanetsa Mavhunga\nMIT OpenCourseWare\nThose of us who grew up in rural Africa see the home, the village, the mountains, the valleys, and the rivers\nas educational and technological spaces where these innovations occurred on a daily basis. Such spaces are\nindeed the universities, the laboratories, or the factories of psychomotor activities within which many of\nAfrica's leaders in politics, business, academia, sport, music, and many other endeavors are raised. The\nvalley where children herd cattle, the pools where they fish, the forests in which they hunt and pick fruit, the\ndusty streets where they play with their self-made plastic football -all these are sites in which the African\nchild is taught critical life skills through showing and doing, but not the exam or the pen. Out of them arises\na spirit of experiment, adventure, risk-taking, and ambition, inspired by a desire to escape grinding realities\nof being born poor through sheer hard work and seeking answers in novelty even while one's feet are firmly\nplanted in the elastic cultural traditions of one's ancestors.\nThe Coming of European Education: What Happened to this Prac\ntical Education?\nIf we listen to Robert Moffat, writing in 1833, there is doubt where the blame should go: \"Their intellectual\nfaculties seem so benumbed that it is astonishing to see how destitute they are of the principle of curiosity.\nThis, of course, is easily accounted for from their habits of indolence and sensuality.\" (Moffat in Chirenje,\n1833). Failure, therefore, was a result of \"the dull carnal apathy of a race sunk in sensuality.\"\nThe British and the Germans considered even a minimal ability to read the scriptures the height of ed\nucational achievement. Girls outnumbered boys in LMS schools throughout the nineteenth century, as boys\nwere required to go to the seasonal cattle posts while household chores kept the girls nearer home. School\nattendance was irregular because of household chores, pastoral, agricultural (heading cattle, watching over\ngrain crops fields besieged by birds); the curriculum too detached from the values and economy of Africans\n-just too bookish to make any tangible sense. By 1900, only two thousand people were full members of\nthe LMS church out of a population of over one hundred thousand -a sizeable number of Christians and\ntraditionalists sent their children to LMS schools. For the latter, the white man's schools only supplemented\nthe traditional education process which culminated in the initiation (bogwera for boys and bqjale for girls)\nand was indispensable to the transition from youth to adulthood. They brought with it pride and traditional\nwisdom; children who chose to become bathu balehuku (\"children of the book\") and refused to participate\nin the ceremonies were venerated by the bathu balechulo (traditionalists) and caused considerable friction in\nTswana households (Moffat).\nThe LMS tried to improve the quality of education by opening a teacher training school for evangelists\nat Kuruman in 1872. But the number of its graduates remained small and of low caliber for the rest of the\nnineteenth century; none of the Kuruman graduates became teachers. A report done in 1893 showed that all\nthe twenty-seven students who had graduated since 1872 had left the profession. Some reverted to the more\nviable traditional occupations, such as cattle herding and game hunting; others drove wagons for whites or\nengaged in the lucrative business of conveying wood to the gold and diamond mines and ivory, feathers, and\nhides to various South African markets.\nDenied influence in such matters as curriculum development, some Tswana parents expressed their dis\napproval by keeping their children home. Those who could afford the $20 fee sometimes sent their children\nto Lovedale, run by the Free Church of Scotland at the Cape, and to the Paris Evangelicals' Morija in\n\nLecture 22\nBooks: From Tools of Empire to Tools of Self-Liberation\nSTS.089, Fall '14\nBasutoland, two schools with a reputation for academic excellence. There was much self-criticism, calls for\nmore teachers, less evangelists, and African demands for a better curriculum on the Lovedale and Booker T.\nWashington or Tuskegee model. In 1902, Rev Peter Kawa of the Church of England:\n\"We want that system of education which recognises the fact that \"there is dignity in labour,\"\nand we detest that system, where all the educated natives are expected to be either missionaries\nor school masters.... We want practical schools rather than these too many Normal Institutions.\nWe prefer Agricultural Schools, where our Native youths would be led to follow the agricultural\npursuits. I am not averse to literary education, and am strongly of opinion that these native lads\nwho are able, should be taught the higher branches of study; for minds are not all alike... Let\ngiant intellects have by all means what is generally termed \"Higher Education,\" but let the masses\nbe taught to make bricks, tables, dishes, wagons, shoes, and above all let them be thorough with\ntheir spade and ploughs.\"\nAnd one Motswana chief summed it all up nicely: \"The book learning is no help to give to the people to live;\nthe books told us some of the things which we may expect when we...die... Now we find what is to be done\nand what the books mean; a new prospect is now opened before us.\"\nIndustrial Education: Booker T. Washington in Africa\nBooker T. Washington (1856-1915), founder and principal of Tuskegee Normal Industrial Institute, Alabama,\nand an African-American, was convinced his self-help and industrial education philosophy was what blacks\nin Africa required to get civilized -through individual initiative and instruction in the principles of \"a higher\nmoral life.\"\nFor him, the \"native\" of Africa, had to come to the tree of civilization, Tuskegee, and see, learn, return,\nand transplant the seed. Enthralled by this message, politically active and educated black elites in South\nAfrica traveled to Tuskegee in the 1890s and 1900s to eat the fruit at source. ANC political organizer, Pixley\nSeme, captured the mood in a letter to Booker T: \"We need your spirit in Africa.\" The central figure in\nthis exchange was John Langalibalele Dube, Zulu educator, first ANC president, who visited Tuskegee in\n1897. When introduced to an audience and asked to say a few words, he declared: \"The greatest need of\nmy people is industrial education.\" And Washington found Dube \"superior material to take on an energetic\nChristian civilization,\" someone who saw a pragmatic alliance with white paternalists in SA as essential for\nblack economic participation in society and eventual political equality.\nDube went on to establish his own institute: the Zulu Christian Industrial School, in 1901, outside Durban.\nStudents wanting to enroll first toiled in the institute's 30-acre fields growing ground nuts, corn, potatoes,\nbananas, beans, oranges, and peaches to pay their teacher's salaries. They learned arithmetic and English\nto be able to function in the workplace, and gave a certain amount of labor to the Institute during their\nenrollment. John Dube's motto was: \"As in Booker T's institution, so here... no money is expended for out\nside labor which the pupils can be made to do for themselves.\" He also went on to establish a Zulu language\nnewspaper, Ilanga lase Natal, to articulate black issues and advance the industrial education ethos.\nLet's be clear about why Booker T's model was popular in Africa among the colonial authorities.\nThe school was a site for the engineering of African children into disciplined (read: subservient) colonial\nsubjects. Children were made to recite racist poems like \"Bongwi the Baboon,\" sing \"Christopher Columbus\nwas a Great Man\" who went to America on a sauce pan, serenade David Livingstone, the great man who\ndiscovered the Mosi oa Tunya (Victoria Falls), and understand the valungu (whites) \"truth\" that the black\nperson had no history (Chinodya 1989). Official games like \"PT\" (physical training), soccer (boys), netball\n(girls), running or athletics (boys and girls), high, long, and triple jump, and choir or singing comprised the\nstaple of inter-house (intra-school) and inter-school competitions.\n\nLecture 22\nBooks: From Tools of Empire to Tools of Self-Liberation\nSTS.089, Fall '14\nAs social engineering tool, \"Native or Bantu Education\" was designed for the \"uncivilized\" (blacks), and\nto mark their differences from the \"civilized\" (whites). In one race, a child was born uncivilized; in another,\na child was born civilized. Education had to be beaten into the uncivilized, hence corporal punishment was\napplied instead of persuasive incentive in white schools. The white education officers encouraged physical as\nsaults of children in the name of discipline. Colonialized as well as patriarchal parents encouraged it (Matibe\n2009). This was a substantial difference with indigenous knowledge.\nTurning the Colonizer's Tools into Instruments of Self-Liberation\nBooker T's other famous prot eg e was Davidson Jabavu, educationist, graduate of University of London.\nIn 1913, the South African Minister of Native Affairs commissioned Jabavu to go and study the \"methods\nbeing used\" at Tuskegee \"with a view of adopting them in connection with the education of the natives of\nSouth Africa.\" Jabavu would be a key figure in founding South Africa's biggest \"Tuskegee,\" the National\nCollege at Fort Hare, today's University of Fort Hare, the laboratory that would churn out many an African\nleader in the 1930s-50s, including Nelson Mandela, Albert Luthuli, Tanzania's Julius Nyerere, Botswana's\nSeretse Khama, Zambia's Kenneth Kaunda, Zimbabwe's Robert Mugabe, and Desmond Tutu as chaplain.\nZ. K. Matthews was one of the African faculty members from 1936 to 1958. Fort Hare was a melting pot of\nChristian convictions, communism, and Pan-Africanism; out of this concoction African nationalism emerged.\nThe University of Fort Hare was the bridge between Black America and Black Africa. Visiting black in\ntellectuals (African and African-American) from Howard, Fisk University (Nashville), Penn School (South\nCarolina), Hampton, and Tuskegee visited Fort Hare to lecture and debate issues of black struggle.\nFort Hare was of course not unique. In Southern Rhodesia there was St. Faith's Farm in Mutasa, where\nChristianity, liberalism, and self-reliance met. In South Africa itself there was Lovedale, Adams College,\nand, of course, Dube's Industrial School. Adams, St. Faith's, and Fort Hare became hotbeds of African\nnationalism from the 1940s onwards. St. Faith's was shut down in 1959, only to resurrect as Cold Comfort\nFarm, which would itself be closed in 1964.\nIronically, institutions like Fort Hare had been built to stem the spread of communism and anti-colonial\nresistance through an industrial education that frowned upon intellection, but ended up becoming hubs of\nPan-Africanism and African nationalism. Booker T's prot eg es Seme, Dube, and Jabavu had an anti-labor\npro-capitalist, anti-Marx mentality; they were the black capitalists, who felt it was not their place for blacks\nto defer to protest in order to change society. Rather, they should equip themselves with the weapons to\ncompete and outwit the white man at his game of civilization. Jabavu argued that Africans attracted to\nBolshevism and revolution should be directed to a needed antidote -the Young Men's Christian Association!\nAnd institutions like Fort Hare, designed for just such a purpose, became quite the opposite. Later on in\nthe 1960s, this Christian Marxism would be very pronounced in the work not only of African nationalists,\nbut also churches and individual priests supporting guerrillas and the masses struggling for independence.\nThe World Council of Churches (WCC), Catholic Commission for Justice and Peace, the Catholic Institute\nfor International Relations, and individual priests like Adrian Hastings (Mozambique) and Donal Lamont\n(Zimbabwe) are good examples. At the same time, some churches and bishops were passionately support\nive of colonial regimes and loathed national liberation movements, whom they dismissed as agents of the\nAnti-Christ (communism).\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nSTS.089 Technology and Innovation in Africa\nFall 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "STS.089 Lecture 4: Food Production in Africa",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-089-technology-and-innovation-in-africa-fall-2014/5c78752ccf8eb054a292dd6c21ec79e8_MITSTS_089F14_Lecture4.pdf",
      "content": "STS.089 -- Technology and Innovation in Africa\nFall '14\nLecture 4 - Food Production in Africa\nRice: The Transatlantic Slave Trade as Technological Process\nProf. Clapperton Chakanetsa Mavhunga\nMIT OpenCourseWare\nOur special focus here is rice and how this crop made it to these shores.\nThe Atlantic Slave Trade: Timeline\n- 1502: First reported African slaves in the New World\n- 1640-1680: Large-scale introduction of African slave labor in the British Caribbean for sugar produc\ntion begins.\n- 1791: The Haitian Revolution begins\n- 1794: The French National Convention emancipates all slaves in the French colonies\n- 1804: January 1: The Republic of Haiti is proclaimed\n- 1807: British Parliament bans the Atlantic slave trade\n- 1820: May 15: U.S. law makes slave trading piracy, punishable by the death penalty, dispatches four\nvessels to patrol the coast of West Africa for slaves. This lasted four months and was recalled after\nAnglo-American disagreement.\n- 1831: A large-scale slave revolt breaks out in Jamaica -brutally repressed.\n- 1833: Great Britain passes the Abolition of Slavery Act, providing for emancipation in the British\nWest Indes -set to take effect August 1834. (Following emancipation, a 6 year period of apprenticeship\nis permitted.)\n- 1837: Britain invites the U.S. and France to create an international patrol to interdict slaving. The\nU.S. declines to participate.\n- 1888: Slavery abolished in Brazil, ending slavery in the Americas.\nSlavery in America: A Selective Timeline\n- 1619: First Africans arrive in Virginia\n- 1640-1680: Beginning of large-scale introduction of African slave labor in the British Caribbean for\nsugar production\n- 1774: Connecticut and Rhode Island prohibit further importation of slaves (although Rhode Island\nmerchants remain in slave trade to other colonies).\n- 1776: Society of Friends (Quakers) abolishes slavery among members\n- 1777: Vermont Constitution prohibits slavery\n- 1780: Massachusetts Constitution adopted with freedom clause interpreted as prohibiting slavery.\nPennsylvania adopts gradual emancipation, freeing slaves born after 1780 upon their 28th birthday.\n- 1784: Connecticut and Rhode Island pass gradual emancipation laws.\n\nLecture 4\nFood Production in Africa\nSTS.089, Fall '14\n- 1788: Connecticut prohibits residents from participating in slave trade.\n- 1789: U.S. Constitution ratified with clause equating slaves to 3/5ths of a white citizen and provision\nthat slave trade would end within 20 years.\n- 1793: Eli Whitney's invention of the cotton gin sets the stage for expansion of slavery in the American\nSouth and short-staple cotton becomes an economical product.\n- 1798-1808: Decade of greatest importation of African slaves into U.S., totaling approximately 200,000.\nThe transatlantic slave trade was not only a traumatic mobility of Africans as dehumanized people only, but\nalso their technologies or knowledge. The enslaved Africans were being captured and turned into exchange\ncommodities for their labor value, and exported across the Atlantic as such. The dehumanizing nature of\nthis trade has been and continues to be explored.\nTriangular trade\nThe slave trade was one site of a trade triangle, which went as follows:\nguns were invented in China → guns were perfected in Europe → guns were exported to Africa to buy African\ncaptives as slaves → slaves were exported to the Spanish, Portuguese, French, and English colonies to grow\ncrops (namely sugar, tobacco, and cotton) to Europe to fire the Industrial Revolution → the Industrial\nRevolution produced more guns → guns were exported to Africa to buy even more slaves\nThe Role of Music: Lightening the Burden of Work\nMy concern here is to focus more on the mobility of ideas, with the trade acting as a conveyor belt for\nthe transfer of technology by Africans to the New World. This enquiry is part of two knowledge mobilities:\nbetween Africans and Europeans and Africans and Native Americans. This was so because Native Americans\nand enslaved Africans worked in the plantations side-by-side, and shared agricultural knowledge.\nThe plantation fields and slave quarters are most revealing about the cultural innovations Africans brought\nfrom Africa, which they now used as coping devices in a changed, coercive environment. In indigenous\nAfrican religion, one calls his or her ancestors in times of trouble or hardship, and asks them to guide the\nway. After triumph, music, religion, and celebration also go together. People from Cameroon, the Ivory\nCoast, Guinea, Cape Verde, and Senegal bought their beliefs to places such as New Orleans.\nThe enslaved were a diverse culture, each with its own musical repertoires. They included music rituals\nlike the \"ring,\" whereby people gathered, played instruments, sang in a call-and-response, and danced. Music\nwas inseparable from prayer and communion with the ancestral spirits; now it eased the pain of captivity.\nAboard slave ships, captains forced slaves to sing and dance to keep them in good shape so that they could\narrive alive and sellable. But they were also wary lest drums incite rebellion or be used as technologies of\nsecret communication. So the slave masters banned them. Interestingly, the drumming continued without\nthe drums -through hand clapping and foot-tapping. Bodies became instruments, drums.\nFood and Rice\nThe debt that America owes to the technologies of the enslaved rival in the area of agricultural innovations\nis significant. Whereas Europeans had brought the spade and the plow to the New World, the African intro\nduced the hoe to turn over the soil. The hoe was a product of the African mining and metallurgical traditions\nof the ancestors back in Africa. Here it was entering Western science-based engineering and manufacturing\nnow via the plantations. The hoe was also used in preparing a cornmeal dish called fufu, perhaps the most\nwidespread meal in Africa. It has many names, each according to the language of its makers and eaters:\nfufu in West Africa, ugali in Kenya, and Tanzania, nshima in Zambia, nsima in Malawi, sadza in Zimbabwe,\n\nLecture 4\nFood Production in Africa\nSTS.089, Fall '14\npapa in South Africa, phaletshe in Botswana, posho in Uganda, and luku, moteke, semoule, and bugari in DR\nCongo. Most of the Africans enslaved in America came from Africa's western littoral, where this corn-based\nmeal was called fufu. The enslaved Africans had brought no pots or pans and owned none, so they cooked,\nbetter yet fried, on the hoe what came to be called hoecakes. To add taste and hold the cornmeal together,\nthey mixed it in plantains.\nAfricans may have been severed from the lands they farmed but the European enslaver did not sever the\nknowledge of farming from the Africans' heads. They carried it with them in their to the Americas. This role\nof Africans as organic vehicles and architects of technology transfer to the New World has only been recently\nappreciated. The story of rice in South Carolina's plantations is a good example. Previously, scholars like\nPeter Wood, author of Black Majority, characterized the relationship between the enslaved Africans and rice\nas a \"parallel\" and \"temporal\" association, hence his depiction of the cereal as \"White Rice.\" Some had simply\nspoken of the enslaved's \"contributions.\" Those that said the most could only remark about \"slaves who had\nexperience growing rice in West Africa were probably instrumental in the successful creation of early rice\nplantations.\" The narrative remained one of white planters as the innovators and pioneers against amazing\nodds.\nIn Black Rice, Judith Carney declared that America owes enslaved Africans, and indeed West Africa, a\nhuge debt of gratitude for bringing expertise in rice cultivation to its shores. Where Wood had talked of\n\"White Rice,\" Carney defiantly inserted to concept of \"Black Rice\" to specify who the inventors were. For the\nfirst three decades since the establishment of the English settlement in South Carolina in 1670, settlers had\nrealized that rice imported from Asia thrived in the inland valley swamps. Throughout the 1700s, rice became\nthe mainstay of South Carolina's economy; the rice economy subsequently extended to Georgia. Being at first\nignorant of swamp rice production initially, these planters quickly saw that the Africans they had enslaved\nfrom the traditional rice-growing region of West Africa possessed this rare expertise. Soon, they started\ntransferring this technology from Africa in a more deliberate way, targeting for capture and shipment women\nand some men specifically from those rice-growing regions. These imports from the \"Rice Coast,\" the \"Wind\nward Coast,\" the Gambia, and Sierra Leone, possessed a double technological value (labor and knowledge)\nand therefore fetched higher prices on the slave market and were advertised as \"accustomed to the planting\nof rice.\" These technical experts were then deployed to transfer their technical knowledge of rice growing\nthrough their hard labor for no personal beneficiation. They prepared the land into irrigation canals, selected\nand planted the seed, tended the crops against pests and weeds, reaped and processed the grain. At planting\ntime they line up on the edges of the field, and then, with their ancestral call-and-response singing style, they\nrhythmically paced themselves, hoeing in unison. Come harvest time and it was the women who pounded the\ngrain with pestles in large wooden mortars, then separated the chaff from the grain using winnowing baskets.\nThe narrative of the plantation owner as the rice planter yielded to another that now centered on the\nenslaved as the carriers riziculture from Africa to South Carolina. In fact, the enslaved were the link in the\nphysical continuity of rice growing; they linked, through the coerced mobility of their bodies between two\ncontinents, two sites of rice-growing: their erstwhile mangrove-lined fields in West Africa and the plantations\nof South Carolina. All technologies they carried in their heads from West Africa and transferred to the white\nman's plantation. They had also cultivated rice in sluices, ditches, and banks in the rain-fed wetland and\ntidal ecosystems of the Niger and Gambia rivers of West Africa. Now they did the same in South Carolina\nand Georgia.\nAs Carney shows, ancestral knowledge of rice cultivation played a critical role in the enslavement, ship\nment, and plantation experiences of Africans. The question is whether they were in fact recruited \"as skilled\nlaborers in a cropping system planters had already ingeniously developed, or whether slaves expert in rice\ncultivation\" so that they could show Carolina planters \"how to adapt a preferred dietary staple to diverse\nlowland settings.\" Carney says two things to this: not only was the origin of rice cultivation in South Carolina\nAfrican; enslaved Africans from West Africa?s rice region \"tutored planters in growing the crop.\" Because\n\nLecture 4\nFood Production in Africa\nSTS.089, Fall '14\nthey already had a vast reservoir of knowledge of mangrove rice, enslaved Africans became the critical actors\nin the transition from swamp cultivation to floodplain, irrigated rice in South Carolina. It was only the\nenslaved, women more so, who knew the art of rice milling, the only efficient way to extract the grain from\nits shell before the coming of the mechanized mill.\nThe example of rice encourages us to think of Africans as not mere \"users\" of technology or beneficiaries of\ntechnology transfer, but also as originators that transferred technology to the West. The Jola (Diola) people\nof Senegal, Gambia, and Guinea-Bissau had tilled the soil, and to make dikes and furrows, for rice planting\nusing the kajandu or kayendo, a long-handled fulcrum shovel. The men worked with the long-handled, large\nconcave-bladed hoe, while the women spread the manure, sowed (casting) the seed, transplanted seedlings,\nand cut the ripe rice.\nWhy this matters today?\n- the diffusion of knowledge in a time of heightened global mobilities (migration) and mobile technologies\n- rethinking the contribution of Africa to global technologies and its building blocks.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nSTS.089 Technology and Innovation in Africa\nFall 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "STS.089 Lecture 5: Textiles",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-089-technology-and-innovation-in-africa-fall-2014/d372691a3baf85dbe4130d442fdcc370_MITSTS_089F14_Lecture5.pdf",
      "content": "STS.089 -- Technology and Innovation in Africa\nFall '14\nLecture 5 - Textiles and Cotton (Qutn)\nProf. Clapperton Chakanetsa Mavhunga\nMIT OpenCourseWare\nIntro: Cotton & Cotton Textile Production\n- What arguments were advanced by Chivalier and Dalziel?\n- Chivalier: social and economic history as history of technology\n- Dalziel: the incoming and locally originated (spinners, weaver, dyers, tailors, and embroiderers)\n- What three aspects does Colleen E. Krieger's article focus on?\n- sources of evidences -what sorts of evidence does the author use?\n- dating\n- observations\nAfrica and the History of Old World Cotton (Gossypium Herbaceum)\n- Questions from readings\n- What were I.B. Hutchinson's speculations on the origins of cotton varieties?\n∗ In 1954: he speculated that the plant was indigenous to southern Africa but Arabs discovered\nit and took it back to Arabia for domestication.\n∗ in 1974, another speculation: there were two species, Gossypium arboretum and Gossypium\nherbaceum, domesticated from the same wild ancestor. Herbaceum domesticated in Ara\nbia/Baluchistan from a wild ancestor -the knowledge then diffused from there into Africa.\n- What is the status of the research now and what do these speculations say about images of Africa?\n∗ The state of research -by non-Africans, of course -supports this, and that herbaceum was\ndomesticated in 3,000 BC.\n∗ Scholars pick and choose from Hutchinson's two positions, even adding arrows on his maps\nto show \"diffusion pathways\" of the two cotton species entering sub-Saharan Africa via the\nsouthern Arabia and the Red Sea.\n- What does Kriger say to this?\n∗ \"Diffusions are far too simplistic\"\n- Questions of sources: Nubia and Meroe\n- The earliest radio-carbon cotton dates from Nubia in the Nile Valley (there are lint-bearing seeds\nand cotton fiber dating back to 2600-2400 BCE, but no evidence of cotton textile use or manu\nfacturing until much later)\n- Dates for Meroe: 280 BCE to 350-540 CE -many textile fragments; could have been logical made\nor imported, grown or wild. We just won't know. Kroger speculates that cotton was \"grown,\nspun, and woven in North Africa in 300 BCE - 400 CE.\"\n- To most scholars, Africa is a continent where everything that is good is supposed to have come\nfrom outside: from the Levant or from Europe to North Africa because of its accessibility by land\nto the east, the seed of civilization was always thought to have then spread from there to West\nand Southern Africa. But this diffusionist speculation is now doubted.\n\nLecture 5\nTextiles and Cotton (Qutn)\nSTS.089, Fall '14\n- The rise and spread of Islam (6th - 9th CE) was the lighting rod, it is said, for the spread of\ncotton from Nubia and Aksum (Ethiopia) to West Africa.\n- Two centers of cotton production in West Africa, ca. 900-1500\n- Linguistic evidence: gathered the generic words for cotton in 126 West African languages from\ndictionaries, word lists, and botanical sources -showed that there were at least two distinct centers\nof early cotton production in West Africa, around the 10th century:\n1. Cluster of Niger-Gambia-Senegal watersheds and areas contiguous to the Sahel\n2. Around Lake Chad\n- Fit perfectly within the flight path of Watson's \"routes of crop diffusion\" during the Islamic period\nbefore 1500. In a sense, this highlights the role of human mobilities as a carrier of technology.\nTextile Manufacturing in West Africa\n- Archaeology shows cotton manufacture in West Africa by at least the 11th century.\n- Written accounts of travelers like the Andalusian al-Bakri (1068) gave us the first description of cotton\nmanufacturing in West Africa; cloth was used as currency.\n- It was made not from cotton crop grown in the fields but the \"cotton tree,\" a perennial.\n- Spinning was done entirely by hand.\n- Cotton was one of many materials. Others were wood, silk, leather, grass, bark, palm leaf cloth. To\nmake the kyenkyen cloth in Asante, for example, they would soak and pound the inner bark of a\nparticular tree species.\n- Treadle looms on the Ivory and upper Guinea coats\n- by the 16th-18th centuries, Cabo Verde islands manufacturers were famous.\n- African cotton and indigo was commercialized into plantations worked by enslaved Africans, which\nthen exported cotton to the Gambia, Casamance, and Cacheu Rivers.\n- relied on enslaved Africans' indigenous knowledge and techniques to scale up from mere crop\nproduction to spinning, dyeing, and weaving.\n- Indigo dyeing was popular, too, and techniques in dyeing continued to shift.\nDiscussion: European Travelers Bear Witness to African technological innova\ntions\n- Cadamosto on the Gambia (1456): witnessed raw fiber, handspan thread, and handwoven textiles with\nlocally grown cotton. Elites wore cotton clothes and commoners wore goatskin, which were either plain\nwhite or loom-patterned with stripes of blue or red yarns.\n- Pacheco Pereira in Sierra Leone (1490s): cotton grown on the Cabo Verde islands using enslaved\nAfricans -exchanged for animal skins, palm oil, and unusually colored shells.\n- incoming trade and local textile industry: cloth imported, but also woven locally on a \"vertical loom\"\n- exported to markets on Gold Coast, Gabon, Angol, Sao Tome, West Indies, and Brazil; striped cloth\nexchanged for gold on the Gold Coast, indigo-blue cloth exchanged for ivory and captured Africans in\nGabon and Angola\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nSTS.089 Technology and Innovation in Africa\nFall 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "STS.089 Lecture 8: Music",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-089-technology-and-innovation-in-africa-fall-2014/1d29033bbc32a7f3207621ffdd4d0636_MITSTS_089F14_Lecture8.pdf",
      "content": "STS.089 -- Technology and Innovation in Africa\nFall '14\nLecture 8 - Music\nProf. Clapperton Chakanetsa Mavhunga\nMIT OpenCourseWare\nEuropeans did not go deep into African music to understand its place in people's lives as such. They looked\nfor the melodic and rhythmic characteristics and the outward-looks signs (aesthetics). This tradition of\nlooking and judging African music is particularly clear in the 18th-20th centuries. They saw it as largely\npagan and worship of ancestral spirits, warlord, release of tensions and conflict of everyday life.\nIn the late-19th century, mobilizing African knowledge was used to confirm western anthropological thought:\nstructure and function, labor, structure between young and old men for the control, production and sup\nply, women are held responsible, the controlling and dominant group of elders, challenging and emergent\ngeneration. It's this struggle between modernity and tradition.\nThe Uses of Music Among the Tsonga\nMusic is used in all of the following ways: the birth of a child, a marriage, a man's going hunting, the\ntaking in of harvest, to help guide the moral order of society, to aid in the reduction of social stress, the\nannouncement of eligibility of an individual (for pre-marital sex relations, for marriage, for passage to the\nspirit-world, etc.), group conviviality, the acquiring of prestige, the validation of power, the maintenance of\nlineage solidarity, and the disposal of maize surpluses.\nMusic, dance, and drink are a rite of incorporate, of physical union, and a sacrament of communion. Hence the\nimportant of call and response -the leader calling, the rest chorusing. There are children's songs, drumming\nschool songs, circumcision school songs, puberty school songs, exorcism songs, work songs, funeral songs,\npraise songs, epics, and solo instrumental music. The dances are xichayachaya for men, xilala for women,\nrhambela phikezano for both, but the Tsonga's national dance is muchongolo which involved men and women.\nNon-work-related dances were conducted at specific times of the year, viz., after the harvest and before\nthe planting to eh crops. They were to ask for fertility of everything from the ancestors and to thank them\nfor it. Hence the Tsonga tipping the calabash and pouring contents onto the ground, chanting \"This is for\nthe land!\" in reference to the earth that produces crops and in which the ancestors are buried. And the small\nflute or whistle (nanga) is made of the leg-bone of chapungu, the bird-of-heaven or \"lightning bird\" (known as\nthe battler eagle), because it zigzags, swooshes and swishes as it flies, in a whistling sound. This whistle, the\nTsonga believe, possesses the power to bring rain and to protect the flute's owner against lightning, which\noccurs regularly in this Southern African countryside.\nAmong the Tsonga, communal vocal music and drumming \"would sour the beer\" so it was not to be held\nnear where women were brewing beer from nkanyi or marula fruit.\nMusic as Lubicant, Smoothening Hard Labor into Workatainment\nAlso called nhimbe (chiShona) and humwe (in chiTshangana), jakwara (work party) was a day set aside for\ncollective work to plant, weed, and harvest the fields of the orphaned, the widowed, the elderly, the poor,\nand the master farmer. Because chara chimwe hachitswanye inda (one finger cannot crush lice), it made\nsense to mobilize the community to create a large labor force.\nThe beneficiary of this collective labor brewed beer and hosted a work party to provide not only an in\ncentive to come but also the energy to continue working. Beer and food aplenty were served; after all, adage\nukama igasva hunozadziswa nekudya (friendship is an empty calabash, it can only be filled up through a\n\nLecture 8\nMusic\nSTS.089, Fall '14\nmeal). Food and material possessions did not substitute for collective belonging; and food and material\npossessions were contents of a vessel called ukama (community). That is why chivanhu (culture) said that\nvana vanyamunhu (children of the same ancestor) must eat, drink, work, and pray together.\nThe collective was the water; only within it could the fish (the individual) find strength, hence simba rehove\nriri mumvura (the fish's strength is in the water). Then, like one organism, one body with many different\nbut mutually coordinating parts, the village descended on the field as one, each bringing their own mapadza\n(hoes) ready to weed and matemo (axes) ready to chop. The individual increased his or her mechanical\nmeans from a pair of hands to tens and hundreds of hands making the task light.\nSinging and song lubricated difficult work into fun and sport, pacing it, giving it rhythm, and taking the\nmind away from the arduous task, and placing it in a parallel universe of recreation and entertainment,\nthereby shutting it from communicating \"evil thought\" of nungo (laziness), kuzeza (dreading the task), and\nkuneta (tiredness). Singing transformed and coordinated this critical mass of individuals and their limbs\ninto one vast organism marching in lockstep. The food provided the fuel for the body and mind to remain\nenergized and to perform the work at hand.\nThe release of beer to the workers was paced and dispensed in quantities designed to give them simba\n(strength) without driving them into kudhakwa (drunken stupor) that neutralized efficiency. The volume\nof the singing picked up, powerful arms swung the hoe this way and that. Soon work became just another\nexcuse, another occasion, to drink, eat, and party. Work became a medium of entertainment. Soon the work\nitself was finished, and there was only beer, food, and singing to be partaken. With the hand, feed, and\nbody now freed from the \"small matter\" of hoeing, ngoma (drums), mbira (hand pianos), and hosho (percus\nsion gourds) were brought out, magagada (ankle percussion gourds), and dancing headgears were brought out.\nThe maridzahosho (expert drummers) and vanagwenyambira (expert mbira players) set store, and makate\n(beer pots, singular gate) came out, and the community danced late into the night. As each individual at\nlong last retired home without any goodbyes (for adhakwa haaoneke/a person who is full/drunk does not say\ngoodbye), they sang discordantly along the way home, staggering this way and that, their voices dragging,\nperhaps imitating the equally complicated striding of their beer-wizened feet.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nSTS.089 Technology and Innovation in Africa\nFall 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}