{
  "course_name": "Technology in a  Dangerous World",
  "course_description": "Aim is to analyze important current events for what they reveal about the nature and working of our technological world. Starting point is connection between technology and terrorism. Subject also explores how a human-built world can foster insecurity and danger, and how human beings respond. Many invited guests help develop a strong interdisciplinary approach (science, engineering, social science, humanities). Topics include technological risk and remediation, sociotechnical systems, imagination of disaster, technology and identity, technology and religion, technology and education, and technology and trust. Written and oral assignments and a final project required. Service-learning proposals and web-based presentations, in addition to written work, may be considered for the final project by the instructor.",
  "topics": [
    "Social Science",
    "Public Administration",
    "Science and Technology Policy",
    "Security Studies",
    "Sociology",
    "Social Science",
    "Public Administration",
    "Science and Technology Policy",
    "Security Studies",
    "Sociology"
  ],
  "syllabus_content": "Note: This section incorporates material from both Fall 2002, STS.069 Technology in a Dangerous World-which explored issues arising from the attacks of September 11, 2001-and Spring 2003, STS.092 Current Events from an STS Perspective, which developed as an outgrowth of STS.069.\n\nSTS.069 Technology in a Dangerous World\n\nSyllabus (\nPDF\n)\n\nCourse Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nCourse Overview\n\nThis subject is an exploratory one: students are expected to take an active role in shaping the questions and in defining topics they wish to explore further. In the spirit of exploration, many guests have been invited to contribute their perspective. Students are expected to be active listeners and discussants; they will need to prepare for the guests and also follow up on topics raised by these visitors.\n\nMany writing assignments will be brief, pithy ones: these include responses to the reading assignments, one-paragraph or one-page comments written and read in class, and brief discussions of definitions of key terms. There will be two longer assignments: a topic on a subject of the student's choosing, and a section of a substantial class project, a report written by the entire class, on the subject of \"MIT's role in a dangerous world.\" The latter report is intended to be submitted to the MIT administration at the conclusion of the class. The individually authored paper may be revised once.\n\nGrades will be based on short assignments (25%), student paper (40%), contribution to class project (25%), and class participation (10%).\n\nAttendance is recorded and required. Serious note-taking is necessary. Plagiarism in any form is unacceptable. These and other ground rules, as well as grading policy, will be discussed in more detail in the first two classes.\n\nMIT's academic honesty policy can be found at the following link:\nhttps://policies-procedures.mit.edu/academic-misconduct-and-dishonesty\n\nSTS.092 Current Events from an STS Perspective\n\nSyllabus (\nPDF\n)\n\nGoals of class\n\nDeveloping a conceptual vocabulary and analytical framework based on STS studies\n\nBuilding up a knowledge base about the world\n\nPracticing and improving reading, writing, and speaking skills\n\nAssignments\n\nReading: read\nThe New York Times\nfor a half hour daily\n\nBring in one article to each class that you found particularly interesting during the week\n\nOther readings as assigned\n\nLecture\n\nIn most classes I will take 20 minutes to discuss the history and implications of STS studies\n\nThese lectures should inform your writing assignments, both the weekly ones and the book review\n\nTake your own notes, but I will also hand out notes later on in the term\n\nSpeaking\n\nRead a 2-page short paper at each class session\n\nParticipate in discussion of questions raised by students papers\n\nYou may be called upon to contribute to discussion; you may also be asked to let others have more opportunity to speak\n\nWriting\n\nWrite a 2-page short paper for each class session\n\nMost of these papers will comment upon and raise questions about the weeks news\n\nSome assignments will be more specific, i.e. write a letter to the editor or an op-ed piece, write as if you were living somewhere other than in the U.S, write about whats not in the newspaper\n\nAll assignments should be revised, compiled, and submitted (both electronically and in hard copy) to the instructor at the middle of the term and at the end of the term\n\nTerm Project\n\nRead a book from the list provided and write a 4-5 page review summarizing and explaining how the book presents an STS perspective on the subject matter (we will discuss this assignment more in class)\n\nIf there is time, students will give a 10-minute presentation in class on their review\n\nNo final exam\n\nGrading Criteria\n\nDiscussion: 15%\n\nShort assignments: 65%\n\nBook review: 20%\n\nMIT's academic honesty policy can be found at the following link:\nhttp://web.mit.edu/policies/10.0.html",
  "files": [
    {
      "category": "Resource",
      "title": "vestspeech.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-069-technology-in-a-dangerous-world-fall-2002/2f77af3f7aa7855e9fb6b5dd3d464fc3_vestspeech.pdf",
      "content": "Charles M. Vest\n\"Openness, Opportunity and Security in Universities: A National\nChallenge\"\nAddress to the National Association and College and University\nAttorneys\nBoston, Massachusetts\n26 June 2002\nINTRODUCTION\nWe have all just finished an academic year that began in tragedy.\nThe thousands of deaths in New York, Washington, and Pennsylvania\nhave changed our outlook in profound ways. The ramifications will\nbe with us for years to come.\nThe attacks of September 11 did not pave the way only for a\nmilitary response. They instantly changed America's relationship\nwith the rest of the world. They challenged our very concepts of\ncitizenship, civil liberties, and openness.\nWe will all struggle with these matters together in the months and\nyears ahead. They have no simple answers, and they hold grave\ndangers. But they also provide opportunities to think about how we\nmight define and achieve the security of this nation -- and this\nworld -- in new ways.\nAs we consider opportunity in the context of a post-9/11 world, we\nfind ourselves asking questions that have arisen time after time in\nour modern history:\nTo whom is opportunity available?\nHow open should our society and institutions be?\nOPENNESS AND OPPORTUNITY\nEach spring, my wife Becky and I host a dinner for the men and\nwomen who are retiring from the tenured ranks of the MIT faculty.\nThese are always extraordinary gatherings of talented and\naccomplished colleagues -- people who have defined MIT and have\nhelped to shape their scholarly and professional fields.\nAs I survey that room each spring, I realize how much America has\nbenefited from being open to people from other countries. And I am\nreminded that my colleagues and I are fortunate to spend our lives\nin an institution that aspires to meritocracy -- one committed to\nselecting and advancing its people on the basis of their talent and\naccomplishment rather than wealth or nationality.\n\nNow, some might say that the diversity of our university's retiring\nfaculty represents nothing more than the passing of an\nera . . . that I am simply observing the end of the intellectual\nmigrations from Europe that were associated with the turmoil of\nWorld War II. But there is more to it than that. The sustained\nexcellence of America's colleges and universities is due in very\nlarge measure to the fact that we have welcomed scholars from other\nnations.\nThe recent Nobel laureates on the MIT Faculty include people born\nin Japan, India, Mexico, Italy and Germany, as well as the U.S.\nMost of them came to this country as graduate students. Or\nconsider our Institute Professors, the dozen or so faculty members\nwho have achieved the highest faculty rank at MIT. They were born\nin the United States and in Belgium, Italy, Mexico, Israel, and\nChina. Any of our great universities would offer a similar lesson.\nThe fact is that America has always been a nation of immigrants,\nand we have long been a land of opportunity. Those who have come\nfrom around the world to study here have contributed greatly to our\nsociety and to our institutions. Many have stayed and built our\nnation. Some have returned to the land of their birth, taking with\nthem the knowledge and skills learned here. They also have taken\nwith them a better understanding of what is good in this country,\nits people, and its institutions. And all have contributed, by\ntheir very presence, to the education and quality of experience of\ntheir fellow students.\nAnd let me also note the fact that MIT is blessed with\nextraordinarily talented, accomplished, and motivated\nundergraduates -- many of whom are the sons and daughters of\nimmigrants to America. As we strive to make all who live in this\ncountry safe from those who would harm us, we should not let our\nfear close the door to our own opportunity. We need to recognize\nthe cost to future generations if we were to become too zealous in\ntightening access to our colleges and universities.\nPULLING OUTWARD / PUSHING INWARD\nResearch universities today are subjected to orthogonal forces.\nConcerns about export controls and terrorist dangers are pushing us\ninward and threatening to isolate us. Yet globalization and\ncommunication technologies such as the World Wide Web pull us\noutward, into a broader and more instantaneous interaction with the\nworld. The balance of response to these forces is complicated and\ncritical -- perhaps even of historic importance. This balance was\nemerging as an issue long before September 11, 2001, but now it is\nabsolutely at center stage.\n\nSERIOUS STUDENTS\nThe issues facing our colleges, and especially our research\nuniversities, derive from several sources, most obviously:\nPresidential Directive No. 2, on \"Combating Terrorism through\nImmigration Policies,\" promulgated last October;\nThe Patriot Act; and\nThe Border Security Act.\nAdditionally, various agencies such as the Department of Defense\nare actively reviewing their policies regarding the conduct of\nresearch and access to research techniques and findings.\nFinally, the Export Control Laws and the International Traffic in\nArms Regulations (ITAR), and their application to university\nresearch, have been under review and revision since well before\nlast September.\nFlowing through all of these policies and legislation are three\nprimary issues:\n1. The tracking of international students who have been issued\nvisas to study at U.S. colleges and universities;\n2. A mandate to define \"Sensitive Areas of Study\" for which the\nState Department should not grant visas to students from certain\ncountries; and\n3. The need to appropriately secure scientific materials and\nresearch results that might be used by terrorists.\nDespite the seemingly endless editorial and journalistic commentary\nto the contrary, the university world is essentially united on the\nneed to track the basic information about international students\nand scholars -- the so-called \"directory information\" -- and on the\nmechanisms to do so. Universities like MIT have in fact met their\nobligation to provide this information to the INS for several\nyears. The issue is that there has been no functional computer\nsystem to maintain and utilize this information. As you know, we\nhave had a flow of paperwork back and forth among the INS, the\nState Department, and the universities that is frequently 6 to 18\nmonths behind. The world learned this when one of the identified\nterrorists received approval to study at a flight school long after\nhis suicidal mission on September 11.\n\nLet me cut to the quick. We need to get on post haste with\nimplementation of the new system, known as SEVIS -- the Student and\nExchange Visitor Information System -- which will allow effective\ntracking of the \"directory information\" for international students\nand scholars. There should be no excuse for not knowing whether\nsuch visitors are undertaking the studies for which their visas\nwere issued.\nEssentially every higher education association last week signed a\nletter supporting this system, while expressing concern that the\ncompliance deadline of January 30, 2003, is probably unrealistic,\nand recommending certain changes in details regarding the imposed\ncosts and needed flexibility of the system.\nThe Presidential Decision Directive on Homeland Security of October\n29, 2001, called for measures to end certain abuses of student\nvisas, and to \"prohibit certain international students from\nreceiving education and training in sensitive areas of study,\nincluding areas of study with direct application to the development\nand use of weapons of mass destruction.\"\nThis directive, although its aim is well understood, has led to\nconsiderable worry on the part of many of us in academia. I am\namong those who worry about it. There were visions of an overly\nsimplistic process, banning foreign students from certain majors or\neven individual classes. Many of us have also been concerned about\nits effectiveness, because one of the bitter lessons we have\nlearned is that a determined terrorist need not resort to\nsophisticated technology, and the identification of what knowledge\nmight be put to nefarious uses is virtually impossible.\nIt is my view, however, that the Bush Administration is moving\ntoward implementation of this directive in a thoughtful and careful\nmanner. Last month the Administration announced the creation of a\nnew Interagency Panel on Advancing Science and Security, or IPASS,\nthat will provide a new level of review of specialized visas,\nincluding those used by students, postdoctoral students, and\nresearchers.\n\nWhat will trigger such reviews? These reviews, by which the\nmeaning of \"sensitive areas of study\" will be developed, will be\ntriggered when visa applications are received from citizens of\ncountries known to sponsor terrorism who want to pursue study or\nresearch in specific topics of concern that are \"uniquely available\nin the United States\"\nThe criterion of unique availability in the U.S. . . the emphasis\non weapons of mass destruction . . . and the use of a substantial\nmulti-agency review panel . . . seem to me to form the basis of a\nsensible framework for approaching this complex issue.\nThe details of the protocols are yet to be understood, and many\npractical questions remain. Above all, it will be essential for\nthe government to maintain substantive dialogue with the academic\ncommunity. But I am cautiously optimistic that this framework can\nminimize unnecessary or unworkable incursions against academic\nopenness. We must adhere to the fundamental openness of our system\nof higher education.\nA senior government official recently remarked that the system\nshould allow \"serious students to study in serious institutions,\"\nand that once admitted by the State Department, they should not be\ndenied the basic freedoms and values that define America. I agree.\nThe issues surrounding research materials and information in the\ncontext of homeland security also are complicated. The complexity\narises from the fact that it is not possible to place either\nmaterials or knowledge into neat boxes labeled \"Useful for\nTerrorists,\" or \"Not Useful for Terrorists.\" Terrorism to date has\nbeen low-tech, although somewhat sophisticated organizationally.\nTruck bombs, the commandeering of commercial aircraft, and credit\ncard fraud are not the stuff of doctoral dissertations. To date,\nthe primary tools of terrorists have been fertilizer, diesel fuel,\nand a variety of off-the-shelf chemicals -- and they remain among\nthose about which we should be most concerned.\nTraditional weapons of mass destruction, such as nuclear weapons\nand missiles, require advanced \"know-how\" and techniques beyond the\nbasic scientific knowledge attainable in university classrooms and\nlaboratories. The materials for nuclear weapons must be maximally\nsecured, and \"know how\" must be protected insofar as possible\nthrough existing formal classification and security processes.\nCyber terrorism requires sophisticated information and knowledge,\nbut it is presumably readily available, as are the computers and\ninternet access necessary to implement it. It is not obvious to me\n\nthat this area is ripe for reduction through restrictions on\nuniversities.\nBioterrorism for me is a more perplexing area of concern, perhaps\nin some measure because it is the area I know the least about. But\nfor the most part, basic knowledge that might be used for ill\npurposes is readily available in the scientific literature. It is\nnot clear to me how difficult it is to attain the \"know how\" to do\nthings such as milling dangerous biological agents for their\ndispersion into the environment. But presumably the difficulty is\nnot great.\nBiological materials and knowledge are also special cases because\nthe distance from the research laboratory to application is very\nsmall. But the tools of contemporary biology are clearly double-\nedged swords: the knowledge that tells one how to make agents more\nvirulent may simultaneously be the key to more effective therapies.\nThe National Academy of Science and leading life science\norganizations are working hard to resolve these dilemmas and\nprovide advice and guidance to scientists and to the government.\nThere are common-sense steps that we should all take regarding\ndangerous biological, chemical, or other materials. We should\nminimize inventories . . . work insofar as possible with micro\nquantities . . . and maintain accurate and effective inventories,\nsecurity, and tracking of these materials. We should educate all\nof our students about the security of scientific materials,\nintegrating such training with health, safety, and environmental\nresponsibilities. And students should not work with such\nmaterials -- or indeed in virtually any laboratory setting -- alone.\nIN THE NATIONAL INTEREST\nThe quest to responsibly maintain the openness of American academia\nto students and research is very important. But our nation's\nuniversities are also committed to contribute to our nation's\nsecurity at this time.\nLast fall, MIT established an ad hoc committee on access to and\ndisclosure of scientific information. It was chaired by Dr. Sheila\nWidnall, a distinguished professor of aeronautics and former\nSecretary of the Air Force.\nInterestingly, this committee was conceived well before September\n11. It was asked to consider two questions:\nFirst, how should we look at access to and disclosure of\nscientific information in the university setting?\n\nAnd, second, institutionally how can we make concerted\ncontributions to the protection of human life and\ninfrastructure?\nTheir essential finding was that openness should be our guiding\nprinciple.\nThey concluded that national security, the health of the nation,\nand the strength of our economy depend heavily on the advancement\nof science and technology and on the education of future\ngenerations. The well-being of our nation will ultimately be\ndamaged if education, science, and technology suffer as a result of\nany practices that indiscriminately discourage or limit the open\nexchange of ideas.\nIndeed, the Widnall Committee recommended that MIT maintain three\nlongstanding policies in support of the openness of the educational\nenterprise:\nClassified research should not be conducted on campus.\nNo student, graduate or undergraduate, should need a security\nclearance to conduct thesis research.\nAnd no thesis research should be undertaken in areas requiring\naccess to classified materials.\n\nThe Committee recognized that many of our faculty will contribute\nto homeland defense and counter-terrorism through consulting or\nservice on federal boards engaged in, or overseeing, classified\nprojects. To facilitate this national service, MIT will continue\nto arrange for them to have access to off-campus facilities where\nthey can handle classified documents, and, in some instances,\nconduct research.\nOur faculty also are pursuing a number of important unclassified\nresearch and development projects directly relevant to protecting\nlife and infrastructure against terrorist attacks.\nI raise these matters today to emphasize that we believe that we\ncan contribute mightily to the needs of our nation at this time and\nat the same time maintain the fundamental openness of our campus\nand its learning environment.\nA REVOLUTION IN EDUCATION\nThus far, I have discussed what I believe to be appropriate\nuniversity responses to those forces pushing us inward and\nthreatening to isolate us. The issues are complicated. But I am\noptimistic that with continued substantive dialogue between the\nfederal government and academia, we can maintain the essential\nopenness of our campuses to students from around the world, while\nalso maintaining appropriate levels of security and assisting our\nnational defense against terrorism through both research and\neducation.\nBut what of the outward forces and opportunities brought about by\ncommunication technologies like the World Wide Web? These offer\npowerful channels of empowerment and democratization to improve the\nquality of life here at home, and throughout the world.\nIt is up to us to define what the \"Internet revolution\" will mean,\nand should mean, for learning on this planet.\nWe all know that the \"Digital Divide\" continues to exacerbate the\ngap between rich and poor, and no one has yet figured out quite how\nto reverse that trend.\nBut the information revolution also offers opportunities to help\nlevel the educational playing field between the world's haves and\nhave-nots.\nAt MIT, the faculty are committed to a major role in this process.\nOver the next few years, the MIT faculty will make all of our\ncourse materials available to everyone . . . anywhere in the\n\nworld . . . free of charge . . . through the World Wide Web. We\ncall this MIT Open Course Ware, or MIT OCW.\nThe OCW material will include course outlines, detailed lecture\nnotes, reading lists, problems, simulations, essay topics,\ndemonstrations, and myriad other things. Materials for the first\n100 courses will be available on the web this fall.\nOur primary audience is not the individual student. Rather, we see\nour primary audience as teachers -- our global colleagues in\neducation.\nTeachers from across the nation and around the world will be able\nto take bits and pieces of these resources, add their own flavor to\nthem, and shape them for use in the context of their own research,\nculture, and goals.\nAt the same time, OCW will make it far easier for faculty within\nMIT to provide well-formatted materials to their students, and to\nshare their ideas and teaching materials with each other . . . and\nso to improve the quality of education at the Institute.\nI've been extremely encouraged by the reaction we've received.\nSince we announced OCW, we've received literally thousands of\nmessages from support from students, parents, teachers, and\nprofessors -- from around the world.\nOur final great goal is that other institutions will be willing and\nable to throw open their curricular doors as well -- that\nOpenCourseWare will be a beautifully contagious idea.\nPaul Brest, president of the Hewlett Foundation, one of the two\nmajor supporters of OpenCourseWare in this pilot stage, put it this\nway. He said, \"Our hope is that this project will inspire similar\nefforts at other institutions -- and will reinforce the concept that\nideas are best viewed as the common property of all of us.\"\nNow, our litigious society may not make it easy to embrace such an\nopen educational vision. As you well know, the entertainment\nindustry and its interests have greatly influenced the development\nof legislation that governs electronic media. Intellectual\nproperty issues are now part of academic life in ways we would\nnever have imagined even a decade ago.\nNonetheless, we will basically treat our OpenCourseWare materials\nunder the \"fair use\" standard, so that it is readily available for\nnon-commercial use.\n\nAnd MIT is working hard to make sure that the materials we post as\npart of the OpenCourseWare initiative do not infringe on the legal\nrights of third parties. We are confident that we will resolve\nsuch issues. Because the benefits of a revolutionary level of\neducational openness are too important to give up.\nCONCLUSION\nThe culture of science has long been international. And it was an\nimportant element of the base of common understanding, and of the\nforces for freedom, that ended the Cold War.\nOf course today, we do not face a superpower nation across a\nnuclear abyss. Rather we face an indistinct but deadly force of\ngroups and individuals we call terrorism.\nWe see the mind of the dedicated and suicidal terrorist at best\nthrough a glass darkly. Yet, I must believe that it is a mind bred\nin poverty, absolutism, and ignorance. Open education and\nscholarly exchange stand in opposition to this. They are forces\nfor economic advancement, tolerance, and learning.\nThus, I remain optimistic about the transforming power of education\nfor our nation and for the world as a whole. And I remain\nconvinced that our country can reconcile its legitimate needs for\ndefense and homeland security with a fundamentally open educational\nsystem -- an educational system that will continue to enrich our\nnation and world through the flow of students, scholars, and ideas\nacross national boundaries.\nThank you."
    },
    {
      "category": "Resource",
      "title": "readingquestion1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-069-technology-in-a-dangerous-world-fall-2002/27aa64f2430690e1435c9fca1207ee8f_readingquestion1.pdf",
      "content": "Reading Questions\n\" Technology in a Dangerous World \" one day after Class\n#4\nQuestions we will discuss regarding \"Missile\nAccuracy \" by MacKenzie NOTE: Some pages are missing at\nthe end. If I can't get them up on the web tonight,\nI'll hand them out in class tomorrow. Be sure to print\nout a copy of this article to faciliate class\ndiscussion of it tomorrow. What is the underlying\npremise of this paper? (Note how MacKenzie uses\n\" signposting \" in this article to guide you through\nhis main points.] What is a reverse salient and a\ncritical problem, and how are they connected? What does\nMacKenzie mean by the \"micro\" and the \"macro \"? What\ndoes he mean when he says that system-builders are\nalways trying to mold the environment to facilitate the\ngrowth of the system? What are examples of these\nconcepts that are discussed in this article? What are\nthe implications of this article for engineering\neducation? What is heterogenous engineering? Yesterday\nwe talked about how different organizations (e.g.\npolice and fire departments) have different cultures,\nexpectations, training, and priorities. What are some\nof the different organizations involved in missile\ndevelopment and how do they differ in goals and\npriorities? How is the concept of a reverse salient\nrelated to organizational goals? In this story, what\nadvantages did MIT have as an organization? Are you\nfamiliar with the concept of \"paradigm \" and \"normal\nscience\" ? (They come from Thomas Kuhn's landmark book\nThe Structure of Scientific Revolutions.) How might\nthey apply to technology? Looking back on the events of\nthe last year: List some of the major existing systems\nof technology in the developed world, and then try to\nidentify some of the \" reverse salients \" that make\nthem potentially dangerous systems (in each case, you\nneed to define what you mean by danger). Identify some\ncritical problems in making those systems less\ndangerous. Would MIT have a role in addressing those\ncritical problems? Would it have an organizational\nadvantage in addressing them? Extra credit: Using\nunclassified information, find out what is happening at\nthe Draper Lab these days."
    },
    {
      "category": "Resource",
      "title": "readingquestion2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-069-technology-in-a-dangerous-world-fall-2002/2fdbc8292961ea336a8406b3a1e340dd_readingquestion2.pdf",
      "content": "Reading Questions\n\" MIT AS SYSTEM-BUILDER: SAGE, \" IN RESCUING PROMETHEUS\nSTS.069,ONE DAY AFTER CLASS #4.\nNote: Do not get bogged down in the details of his\nnarrative. Read it quickly until you get to a part\nwhere you realize Hughes is stating a larger point, and\nthen slow down. Focus your reading on the following\nquestions: What is the basic premise of this chapter?\nWhat are the reverse salient and the critical problem\nin this story? What does this narrative tell you about\nthe interplay between military and civilian\ntechnologies in recent times? What does this chapter\ntell you about the organization of technological\nsystem-building? In particular, what does it tell you\nabout MIT as a site of technological innovation and\ndevelopment? What does it tell you about MIT's values\n(note the epigram at the head of the chapter],\norganization, and culture? Do you think that MIT's\nvalues, organization, and culture and culture have\nchanged from the 1950s? If so, how does this affect\nMIT's ability to undertake \" its special responsibility\nto render public service \" at the present? If not, does\nMIT need to change in order to undertake this\nresponsibility effectively? For extra credit: What is\nhappening these days at Lincoln Lab? At MITRE? With Jay\nForrester?"
    }
  ]
}