{
  "course_name": "Techno-identity: Who we are and how we perceive ourselves and others",
  "course_description": "The nature of human identity - how we think of ourselves, how we perceive others - is a mutable concept, changing with the rise and fall of religious beliefs, social mores, philosophical theories. Today, we live in a world in which science and technology are among the most powerful forces reshaping our culture - and thus our definitions and perceptions of identity. In this seminar, we will examine the impact of science and technology on identity.\nThe instructor’s course page may be viewed at http://smg.media.mit.edu/classes/IdentitySeminar/",
  "topics": [
    "Fine Arts",
    "Media Studies",
    "Humanities",
    "Philosophy",
    "Social Science",
    "Anthropology",
    "Social Anthropology",
    "Fine Arts",
    "Media Studies",
    "Humanities",
    "Philosophy",
    "Social Science",
    "Anthropology",
    "Social Anthropology"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 3 hours / session\n\nCourse Overview\n\nThe nature of human identity - how we think of ourselves, how we perceive others - is a mutable concept, changing with the rise and fall of religious beliefs, social mores, philosophical theories. Today, we live in a world in which science and technology are among the most powerful forces reshaping our culture - and thus our definitions and perceptions of identity. In this seminar, we will examine the impact of science and technology on identity. The topics we will be discussing include:\n\nThe nature of identity\n: What makes an individual different than all others - how do we classify people? How are technologies changing the ways people define themselves and present themselves to others?\n\nMediated identity\n: How do we sense the identity of others in a mediated environment? How do people use media to create and project their identity? How are communication technologies changing cultural, national, religious and linguistic aspects of identity?\n\nSensing identity\n: How are advances in sensing technologies, biometrics, and genetics changing the way we define and recognize identity?\n\nPrivacy\n: What are the implications of the increasingly sophisticated technologies for identifying and tracking people? How are the vast amounts of data that are compiled about us gathered, protected, and divulged?\n\nPost-human identity\n: Advances in artificial intelligence, robots, and medical augmentation raise questions about what does it mean to be human. Is there a continuum that runs between man and machine?\n\nPortraying identity\n: How can new media technologies transform the tradition of the portrait - what are the new ways that some aspect or essence of the individual can be captured and displayed? How have artists responded to the questions above?\n\nRequirements\n\nThere will be weekly reading and writing assignments. Active participation in class discussions is required. There will also be a final term paper.\n\nPlease contact the instructor if you are interested in taking this class.\n\nSyllabus\n\nLEC #\n\nTOPICS\n\nIntroduction\n\nThinking About Identity: Categorization, Prototypes, Stereotypes\n\nCultural Identity Part 1: Language, Dialects and Email\n\nCultural Identity Part 2: Fashions in Clothing, Music and Links\n\nThe Face\n\nFinal Project Proposals\n\nThe not quite Human Other: Robots, Agents and Augmented Humans\n\nDatabanks and Privacy\n\nVisualizations: Depicting the Abstract and Mediated Self\n\nMeasuring Identity: Tests and Sensors\n\nPortraying Identity: Portraiture in the 21st Century\n\nFinal Presentations",
  "files": [
    {
      "category": "Resource",
      "title": "categorization.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/mas-963-techno-identity-who-we-are-and-how-we-perceive-ourselves-and-others-spring-2002/0b5ab7621c7b9f700b34fce994f11b1e_categorization.pdf",
      "content": "MAS 963: Techno-identity seminar\nLecture #2. Thinking about identity: categorization,\nprototypes, stereotypes\nAssignment\nRead all three essays. Think about how categorization \"makes society possible\":\n-\nHow do these authors describe the cognitive structure with which we think about\npeople?\n-\nWhere do the categories come from?\n-\nHow do they change and evolve?\n-\nHow do we classify people we meet?\n-\nWhat happens when the cues we get from the person do not fit any existing category?\n-\nWhy do we have the particular categories we have?\n-\nAre they primarily descriptive (what is this person like) or prescriptive (how should I\nact toward them)?\n-\nHow is information about types of people shared?\n-\nIs the development of these categories a personal or social process?\nPlease submit your essay by Sunday morning, and spend some time before class\nreading over the other essays."
    },
    {
      "category": "Resource",
      "title": "databasesAndPrivacy.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/mas-963-techno-identity-who-we-are-and-how-we-perceive-ourselves-and-others-spring-2002/4f99c6d2cec17fb81b445f494a2289ec_databasesAndPrivacy.pdf",
      "content": "MAS 963: Techno-identity seminar\nLecture #8: Databases and privacy\nAssignment\nRead Rosen article and look through Clarke's website. The latter is quite extensive\nand in addition to the page listed above, you may find that further exploration is quite\ninteresting.\nYour assignment is to present two opposing views describing the benefits and\ndrawbacks of creating big databases of information about individuals.\n-\nWhat are the most interesting, useful, intriguing, revolutionary things that can be done\nwith such databases? How can they enhance life for the individual and improve\nsociety? In particular, how can they enhance the computer-mediated world, where\nidentity is currently so sparsely depicted.\n-\nWhat are the most serious drawbacks to creating such databases? Are there social or\ntechnological approaches that ameliorate these concerns? Under what circumstances\nare these drawbacks most serious?\nPlease submit your essay by Sunday morning, and spend some time before class\nreading over the other essays."
    },
    {
      "category": "Resource",
      "title": "face.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/mas-963-techno-identity-who-we-are-and-how-we-perceive-ourselves-and-others-spring-2002/1008145ec60d7cebe99f57bbbe627428_face.pdf",
      "content": "MAS 963: Techno-identity seminar\nLecture #5: the face\nAssignment\nRead the papers and write about the following:\n-\nGo to a public place and observe 4 different people you do not know. Write down what\nyour impression is of each of them. How much is your impression drawn from their\nface, their clothing, their actions, etc? Concentrating on the face, what sense of the\nperson do you derive from it? Can you articulate why? Do you think any of the\n\"overgeneralization\" processes that Zebrowitz describes played a role in your\ninterpretation? What about other categorization processes?\n-\nWhen do you think seeing someone's face is important in a mediated environment?\nWhy? In what form? What about videophones - do you think they will eventually\nreplace or supplement the audio-only phone or is there a deeper reason why they\nhave never been successful?\nPlease submit your essay by Sunday morning, and spend some time before class\nreading over the other essays."
    },
    {
      "category": "Resource",
      "title": "fashion.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/mas-963-techno-identity-who-we-are-and-how-we-perceive-ourselves-and-others-spring-2002/d01529567b236a264156e086bcbcaa0a_fashion.pdf",
      "content": "MAS 963: Techno-identity seminar\ncultural identity part 2: fashions in clothing, music\nand links\nAssignment\nThis week we are thinking about how fashion is used to communicate identity. The\nfashion can be in any media - clothing can be a social medium, as can music,\nautomobiles, home furnishings, or, in the online world, links.\nPlease read the selected chapter. As you do so, think about these questions: how do\nthese media (i.e. clothes, cars, links, etc) acquire social meaning? How do these\nmeanings change? Why do they change? Can you map out a relationship between\ndifferentiation and imitation as forces of cultural change? Can you distinguish between\nthe inherent or symbolic meaning of an object and its social/fashion-based meaning?\nWhat is the impact of the affordances of a medium (say, clothing vs. links vs. music)\non its dissemination? What is the role of the media?\nIn your writing, discuss examples from both the physical world and the online world. Is there\n\"fashion\" online? How is it manifest? What do you think the future will hold?\nPlease submit your essay by Sunday morning, and spend some time before class\nreading over the other essays."
    },
    {
      "category": "Resource",
      "title": "language.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/mas-963-techno-identity-who-we-are-and-how-we-perceive-ourselves-and-others-spring-2002/f06d1ee861a76979808e63f5392cca27_language.pdf",
      "content": "MAS 963: Techno-identity seminar\nLecture #3 : Cultural identity part 1: language,\ndialects and email\nAssignment\nSome questions to think about: What do we need to know about the other person in\norder to converse with them? What are the things we learn about another person\nthrough their use of language? How does this migrate to the online world - given the\nsparse identity cues, what aspects of conversation become especially problematic?\nGiven that in conversational forums (such as email lists, etc) all we know of a person\nis through their words, what are the identity cues we can discern via language? How is\nlanguage evolving online?\nObserve two conversations, one in the immediate world and one online (can be email,\nchat, newsgroup, bulletin board etc., but should be something that is conversational -\npeople interacting with each other - rather than more publication-like media). Watch\nfor:\n-\nways in which the participants reveal their identity through their language (including\nnon-textual/non-verbal aspects)\n-\nways they use their knowledge of each other's identity to modify their language\n-\nways they try to assess the other's identity\nWrite up your observations. Keep the Saville-Troike reading in mind as you frame your\ndescription - are you finding interesting phenomena in greetings? In contextually\nmotivated language or stylistic shifts? Etc.\nPlease submit your essay by Sunday morning, and spend some time before class\nreading over the other essays."
    },
    {
      "category": "Resource",
      "title": "portrait.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/mas-963-techno-identity-who-we-are-and-how-we-perceive-ourselves-and-others-spring-2002/a6b94c376869f0b1714e6a2bd6bc475f_portrait.pdf",
      "content": "MAS 963: Techno-identity seminar\nLecture #11 :: portraying identity: portraiture in the\n21st century\nAssignment\nCreate a portrait of someone (possibly yourself) purely in the description of the person's room.\nThe description can be quite factual, a list of items, or it can be editorialized, commenting on the\nmeaning of things, or it can use the items as the basis for other narratives.\nThink about how objects are used to depict identity. Are some more evocative than other? Is it a\nmatter of their shape, their function, their history?\nA textual portrait is free to focus on any aspect of the person: their appearance, their personality,\ntheir past. How are these aspects related? Are some easier to convey to others?"
    },
    {
      "category": "Resource",
      "title": "visualization.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/mas-963-techno-identity-who-we-are-and-how-we-perceive-ourselves-and-others-spring-2002/4eced702ee907afc96044e672d433cbc_visualization.pdf",
      "content": "MAS 963: Techno-identity seminar\nLecture #9 :: Visualization of Identity\nAssignment\nIn a New Yorker article about Rembrandt, the critic Simon Schama said\n\"In fact, portraits are a three-way negotiation, involving the sitter's sense of identity,\nthe painter's perception of that identity, and the social conventions that the portrait is\nexpected to satisfy... In seventeenth century Holland, artists were required to supply a\ngood likeness of the sitter, but even artists who gave little thought to such matters\nassumed that a likeness would be something other than a facsimile \"\nThink about how you would create a digital portrait of an individual. For this week's\nwrite-up, discuss the major issues that you think must be raised in creating\nrepresentations of individuals and their behavior. Some possible questions to\nconsider:\nWhat characteristics of an individual must be conveyed? How would you show an\nindividual's interactions with others? How should a digital portrait change over time?\nWhat aspects of an individual's context should be conveyed in the portrait? Is there\nany information about an individual that should not be revealed? What are the\nconsequences of creating a representation for an individual? How much control\nshould an individual have over their digital representation?\nPlease submit your essay by Sunday evening, and spend some time before class\nreading over the other essays.\nClass on Monday will be a group discussion. Please come prepared with a handful of\nthought-out questions or comments on this topic; be prepared to engage the group in\nconversation."
    },
    {
      "category": "Resource",
      "title": "HICSS2002.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/mas-963-techno-identity-who-we-are-and-how-we-perceive-ourselves-and-others-spring-2002/be19075f979f654fae54d014832306f2_HICSS2002.pdf",
      "content": "Copyright 2002 IEEE. Published in the Proceedings of the Hawai'i International Conference on\nSystem Sciences, January 7 - 10, 2002, Big Island, Hawaii.\nDeveloping Legible Visualizations for Online Social Spaces\n\ndanah boyd, Hyun-Yeul Lee, Daniel Ramage, Judith Donath\n{danah, hyun, dramage, judith}@media.mit.edu\nSociable Media Group, MIT Media Lab\n20 Ames Street, E15-443; Cambridge MA 02139\nhttp://smg.media.mit.edu/projects/loom2/\n\nAbstract\nAlthough constructed for researchers to share news and\ninformation, Usenet quickly developed into a social\nenvironment\nwith\nvaried\nstyles\nof\ninteractions.\nUnfortunately, the browsers developed to view the shared\nmessages fail to effectively convey the rich social features\nof a newsgroup, let alone all of Usenet. The goal of our\nresearch is to use the salient features of social interaction\nto build a \"legible\" interactive visual representation of\nUsenet. In this paper, we introduce our approach to\ndeveloping this type of visualization, discussing our\ntheoretical framework, questions considered to access the\nsocially salient features, and a series of design iterations\nused for exploring how to develop a visual language that\nconveys social meaning. Although this paper represents a\nwork in progress, we hope that this approach and our\ninitial iterations help build a framework for future\ndirections.\n1. Introduction\nThe city, however, does not tell its past, but contains it like the\nlines of a hand, written in the corners of the streets, the gratings\nof the windows, the banisters of the steps, the antennae of the\nlightening rods, the poles of the flags, every segment marked in\nturn with scratches, indentations, scrolls. [2]\nWalking down a street in most cities, you are constantly\ngiven various physical and social cues that help you know\nhow to interact with the space and the people around you.\nBy briefly observing the people, their interactions, and the\nphysical features of the space, you can quickly determine\nwhether or not the environment is of interest to you.\nUnfortunately, the same does not apply online. While\nonline communities produce a vast amount of data about\nsocial interaction, this data is often impenetrable to the\nusers. Nothing about the format differentiates a support\nnewsgroup about HIV from a discussion group about the\nSimpsons TV show. Disentangling the style of interaction\nand developing an understanding of the people involved\nrequires extensive reading and analysis, and does not\nnecessarily help people recognize important social cues.\nThe online social environment of Usenet does not have\na physical structure; the people and their interactions\nconstruct the space. In order to develop a sense of Usenet,\nit is crucial to understand the nature of the space, which\nincludes the history of its people, their behaviors, and the\ncontent and intention of their messages. We are interested\nin developing a way to make these constructions legible\nfor users so that it is easier to understand the social space\nupon initial inspection. By legible, we refer to Lynch's\nidea that the environment should provide contextual cues\nas to what the space is about, including its social norms\n[12].\nIn this paper, we start by introducing Usenet and other\nvisualization research in this area, emphasizing our goals\nin developing a visualization of Usenet. Following this,\nwe introduce which socially salient features of Usenet\ninterest us and how they can be analyzed. Our next\nsection introduces the design philosophies we consider\nwhen developing our visualizations. The remainder of the\npaper is devoted to discussing how we use these design\nphilosophies to visually convey the aforementioned social\nattributes,\nfocusing\non\nportraying\nindividuals,\nconversations and groups.\n2. Why visualize Usenet, and with what\napproach?\nAs one of the oldest network applications, Usenet has\nevolved in the last 20+ years to provide a forum for all\ntypes of exchanges, ranging from technical question &\nanswer groups to support groups, MP3 and pornography\ndistribution hubs to political debates. Embedded in\nimmense quantities of data are flourishing communities\nengaging in a range of social interaction. Unfortunately,\nthe social characteristics are easily obscured by typical\nUsenet browsers, which emphasize the informative aspect\nof Usenet (Figure 1). In order to navigate the\n\nconversations in these browsers, you must first select a\ngroup by finding its name and then choose a thread based\non its subject. This approach lets you find content\neffectively, but isn't helpful in conveying the social\nqualities of the interaction. Given the innumerable styles\nof interaction in Usenet, immense possibilities exist\nexploring alternative techniques and approaches to\nvisually convey social interaction.\n\nFigure 1. Typical Usenet browser (Microsoft's\nOutlook Express)\n\nFigure 2. Loom - data visualization of Usenet, by\nKarrie Karahalios [6]\nMany researchers, recognizing the potential of Usenet,\nhave developed different mechanisms for visualizing\nimportant features of the environment. The original Loom\n[6], from which our research evolved, focused on using\nvisualization techniques to uncover social patterns,\nranging from pinpointing vociferous users to illuminating\nthread paths (Figure 2). Coming from a linguistics\nperspective, Sack [18] uses threading structure and\nlanguage to construct \"discourse diagrams,\" which\nconvey the social and semantic networks present in\nUsenet. More recently, Smith & Fiore [21] have focused\non portraying the social aspects of Usenet by visually\nexpressing the quantitative qualities of the environment,\nsuch as number of people and frequency of posting\n(Figure 3). Alongside other research in visualizing online\nsocial environments and patterns (e.g., [7][8]), these three\nprojects provide a foundation for visualizing Usenet's\nsocial data.\n\nFigure 3. Netscan's box plot, landscape view of\nUsenet [21]\nWhile detecting tone and emotional aspects out of text\nis still quite challenging, large quantities of social data are\ncurrently accessible. One current challenge is to\ndetermine how this data relates to the more fundamental\nsocial qualities of the environment. Rather than just\nconsidering the meaning of one piece of data, we must\nthink about how they work together in a system. Another\nchallenge is presenting not only the quantitative data, but\nalso the underlying meanings, or social qualities.\nOur visualization approach comes from both of these\ndirections. Given a set of interesting social characteristics,\nhow do we systematically analyze the data to reveal these\nfeatures? Additionally, what visual attributes can be used\nto convey the social attributes of Usenet? While we have\nyet to build a bridge between these two approaches, we\nbelieve that our approach offers numerous opportunities\nfor building a coherent visualization.\nIn some ways, this approach diverges from most\ninformation\nvisualization\nwork.\nOften,\nresearchers\nworking in information visualization are interested in\ndeveloping techniques that will work for a broad range of\ndata sets (e.g., [3][4][17]). Although we value the\nstrengths of this approach, particularly in making\nquantitative information understandable, we also feel that\nit is limited when trying to convey the underlying\nqualitative nature of a particular environment. To\nrepresent a specific environment in this way, we must\nmove beyond initial visualization techniques, such as\nlarger visuals represents more in data [23], and develop\nways to represent the more expressive and subjective\ncharacteristics.\nIn order to evoke a user's qualitative understanding, we\nneed to use images that convey both the quantifiable and\n\nthe subjective aspects of the data. Detailed representations\nof each numerical attribute is less imp ortant than\nreflecting the fundamental differences between groups.\nRelating subjective visual characteristics to interesting\ndata must be intimately tied to the data that is being\nrepresented; in our case, we focus on large-scale textual\nsocial communication. More specifically, we are tied to\nthe specific qualities of Usenet (i.e. how its structure and\nasynchronous nature affects social interaction). For this\nreason, we aren't focused on building visualization\ntechniques that might work universally, although much of\nwhat we build does apply to other social visualizations,\nparticularly those that emphasize group social interaction.\nInstead, our focus is in determining the socially salient\ncharacteristics and relating visual components to this\ninformation, bringing the underlying attributes, social\npatterns, and attitudes to the forefront of the visualization.\n3. Recognizing social characteristics in\ntextual data\nAlthough the interaction in Usenet is entirely textual,\nmany social characteristics emerge from it. For example,\nthrough regular use, one probably has a sense of the\nnumber of regular posters in a group and what type of\ntone they are trying to convey in their messages.\nAlthough it is possible to develop a sense of this through\nregular interaction, it is not easy to get the type of brief\nsocial overview upon entering a group as you would if\nyou entered a physical environment, like a dance hall.\nWhat social qualities are important to one's initial\nimpressions of a dance hall, and how is the same\ninformation conveyed textually in a digital environment\nlike a newsgroup?\nFocusing on the quantitative aspect of Usenet\ninteraction,\nWhittaker\n[25]\nprovides\na\nseries\nof\nquantifiable metrics that he believes contribute to mass\ninteraction in a newsgroup; these are broken down into\nthree categories - demographics, conversant strategies,\nand interactivity. Smith & Fiore [21] use many of the\nsame metrics in their data collection, as well as more\nindividual-centric\nfeatures,\nsuch\nas\ninterpersonal\nconnections.\nIncluding these quantitative characteristics as well as\nmore qualitative ones, we developed the following series\nof questions that we feel convey the social characteristics\nof individuals, conversations, and newsgroups.\nIndividual. How frequently does an individual post?\nHow verbose is s/he? What is the reputation of an\nindividual? How many and which groups is s/he involved\nwith? What can be said about an individual's identity,\nculture, job, or involvement in subgroups? What types of\ntone, language and conversation techniques are often\nused?\nConversation/thread. How many participants are active\nin a conversation? What structure or pattern of\ncommunication occurs (i.e. back and forth vs. large\nparticipation vs. one person dominating)? What is the\ntone of the conversation? What is the typical response to a\nnewcomer's posts? Are messages posted here also cross-\nposted in other groups? How do the conversation patterns\nchange over time or through extensive replies? Does the\nthread fracture into mini-threads? Are there common\nlanguage patterns and terms?\nGroup. How many threads are usually active? Are there\ntonal differences between ongoing conversations? How\nmany people participate in the group, and how frequently\ndo they post? How many people start conversations? Is\ngroup activity consistent or do internal/external events\ntrigger changes in posting patterns? What is the purpose\nof the group (i.e. support, Q&A, data sharing)? Do the\nparticipants have attributes in common, such as linguistic\npatterns, interests or group memberships? Are people who\ninitiate threads also tend to reply to others' messages?\nWhat networks of people usually interact with one\nanother?\nGiven these questions, it is important to imagine how to\nquantify them. Many of these questions are statistically\neasy to determine (i.e. How many? How often?). Others\ncan be answered through known methods such as social\nnetwork analysis [24] and various linguistics techniques,\nincluding semantic analysis [15]. The most challenging\nquestions concern tone, not only to determine emotional\ncontent, but also to answer questions such as the main\npurpose of a group. Related work on flaming [22]\nprovides one mechanism to analyze tone, but it is rather\nlimited. Unfortunately, given the large quantity of Usenet\ndata, even determining the statistically simple questions is\ncomputationally time intensive. Also, computing this\ninformation is memory-intensive process and requires\nlocal storage of large quantities of data. While these hard\nproblems present significant challenges, for the purpose\nof this paper, we will assume that quantifiable data is\nreadily accessible.\nGiven that we can quantify specific social attributes,\nwhat do these numbers actually mean? For example, if we\nknow that a group has a large number of people\ninteracting regularly, what can we say about the group? Is\nit vibrant or overcrowded? If a poster constructs long\nmessages, is s/he conveying a detailed answer or ranting?\nSome of these elements are personally subjective. For\nexample, what may appear vibrant to us might seem\novercrowded to you. In other cases, the answer is\nsomewhat universally perceived; users reading a long\nmessage would probably recognize if a message were\nhelpful to the conversation, or adding flame to the fire.\nYet, in order to construct a dynamic visualization, we\nmust systematically uncover such qualitative aspects. One\n\nway to do this is to rely on the context of other\ninformation. For example, if the responses contain\n\"angry\" words, the post is most likely a rant or otherwise\ninsulting.\nAlthough understanding the meaning behind different\ncharacteristics helps direct the designs, we do not want to\ntaint the view with only our personal perspective. Instead,\nwe want to portray the information in a subjective, yet\nopen manner, so that the users can determine the\ncharacteristics themselves. For example, we do not want\nto imply that a group with many conversations is vibrant\nor overcrowded; we only want to convey that there are\nmany ongoing conversations. We try to minimize our\npersonal\nbiases\nwhile\nstill\nconveying\nqualitative\ncharacteristics of the space, a delicate task.\n4. Design fundamentals\nBuilding a visual language with which to convey social\ninformation is a subjective process. Not only do we make\nassumptions about what social characteristics represent,\nbut we also rely on assumptions about the effect that a\nvisual form will have on the viewer. It becomes\ntremendously important to constantly evaluate the\nconsequences of these assumptions.\nIn order to understand the impact of visual elements,\nwe attempt to build on concepts developed by such fields\nas urban planning, graphic design, and interaction design.\nIn this section, we will introduce these underlying\nphilosophies. Three themes build the backbone for our\nresearch: Lynch's architectural theories [12] on legibility\nand related work on digital information landscapes;\ndesign and conceptual work on multi-scaled information\nvisualization; and research done in the area of kinetic\ntypography.\nThese building blocks create a conceptual framework\nfor imagining how a user can interact with social\ninformation in a more accessible manner. By applying\nvisual building blocks, such as shape, form, typography,\ncolor, and motion, to these philosophies, we hope to\nevolve a visual language that conveys the expressions of a\nsocial environment like Usenet.\n4.1. Creating legible social landscapes\nLegibility, or \"the ease with which people can\nunderstand the layout of a place,\" is a fundamental of\nurban design; Lynch's work sought to create legible cities\nwhere shape, color, and arrangement facilitate people to\ncreate vividly identified, powerfully structured and highly\nuseful mental images of the environment [1][12].\nAlthough intended for the physical world, these concepts\nare easily translated to the presentation of \"information\nlandscapes,\" a term developed by Muriel Cooper [5] to\ndescribe a digital environment where information is\ngeographically positioned in a virtual space. Just as urban\ndesigners must consider how to make a physical space\nlegible, an information visualization designer must make\nthe social landscape legible, thus allowing users to\nunderstand the space, its history, and its people through\nthe visual representation of the environment.\nIn order for an environment to be legible, the design\nmust rely on vividly identifiable components, thus\nimplying that viewers share a certain level of cultural and\ncognitive intuition about the presentation. Although\nRaskin [14] suggests that \"there is no human faculty of\nintuition, as the word is ordinarily meant; that is,\nknowledge acquired without prior exposure to the\nconcept, without having to go through a learning\nprocess,\" people do have a great number of conceptual\nclassifications\nor\nmodels\nin\ncommon.\nPhysical\nclassification schemes can be effectively used in visual\npresentations, so long as they rely on the same contextual\nexpectations. For example, viewers rely on cognitive\nintuition to assume that when bar A is taller than bar B in\ndata visualizations, A represents something that is larger\nthan B. Likewise, by drawing on cultural cues, such as the\nassociation of red with stop, users have a more intuitive\nunderstanding of what they are viewing.\nVisual cues are given through the physical world to\nsupport legibility and readability. Through noticing\npatterns, people learn to make sense of the world around\nthem. By relying on the assumptions learned in the\nphysical world, and relating them to descriptions of a\ndigital community, we should be able to build an\nenvironment that is more \"intuitive.\" This approach is\nnot without faults. For example, the tradeoff of drawing\non cultural norms for intuitive representations is that these\nimages are partially subjective. As a result, some of our\nwork presents visual language barriers that are not cross-\ncultural, and thus require some viewers to actively\ntranslate the information from its visual elements.\n4.2. Multi-scaled information visualization\nTo comprehend the quantity of information in Usenet,\nviewers need to be able to view the space at multiple\nscales, from broad views of the overall social landscape,\ndown to the level of individual interaction. In order to\nmake these multi-scale views legible, we consider the\nimage of how a city is presented, a metaphor that is\ncommonly used in presenting multiple levels of dense\ninformation [23].\nImagine looking at a city from above. From the\nairplane, the first layers of a city become visible - the\ndensity, the relationship between the city and the\nsurrounding areas. As you get closer, you begin to\ndifferentiate between various buildings, recognize the\nstreets that separate the buildings, see the forests and the\nlevel of traffic congestion. At each level, details emerge\n\nwithin the larger patterns, allowing you to see the trees\nthat build the forest.\nObserving the social patterns of the individuals, how\nthey act collectively and with whom they congregate\ngives another perspective of insight into a city. Before\nyou see individual people's characteristics, you get a\nsense of collective attributes. For example, a buzzing\nstreet filled with people in suits gives you a collective\nsense of the environment; looking closer allows you to\nview individual people's outfits. At that level, you are\nable to recognize someone who deviates from the\ncollective social norm. The legibility of a space is not\nonly determined by its architecture, but also by the\nmultiple layers of social interaction.\nLike its physical counterpart, portraying the online\nsocial landscape through multiple layers of interrelated\ninformation provides users with an opportunity to see\nboth the overall social character, as well as the more\ndetailed attributes of individuals and groups within the\ncommunity. All of these levels are important when trying\nto get a sense of a social atmosphere.\nShneiderman views this multi-layered perspective as\nessential for information visualizations, emphasizing it\nregularly as part of his \"Visual Information-Seeking\nMantra\" - \"overview first, zoom and filter, then details -\non-demand\" [19]. Following this advice allo ws us to build\na visualization where users can interact with the space,\nallowing them to be more immersed in the environment,\nand thus develop a deeper understanding of its attributes.\n4.3. Kinetic typography\nIn its current state, Usenet's social information consists\nentirely of textual data. Although users can build abstract\nmental models of the individuals, the conversations, and\nthe social anatomy of the space, text is still a core\ncomponent. For this reason, we believe that it is crucial to\nuse\ntypography\nrather\nthan\ncreating\nabstract\nrepresentations.\nIn his textual landscapes, Small [20] uses the text as his\ncore visual form. By manipulating visual aspects of the\ntext, including the font, color, size, and location, he is\nable to create an interactive information landscape that\nallows users to navigate large bodies of textual data.\nOne of Small's collaborators, Ishizaki, expanded this\nresearch to build a design technique known as kinetic\ntypography. Kinetic typography uses the form and\nfunction of type and motion to create an expressive visual\nrepresentation of text. In describing the issues in kinetic\ntypography,\nIshizaki's\ngroup\nat\nCarnegie\nMellon\nconstructs a foundation of questions that can be used to\nstart adding expression onto text [10]. Similarly,\nRosenberger [16] developed Prosodic Fonts to give\ntextual glyphs visual emotion based on interpretations of\na sound signal. Given the textual nature of Usenet, these\ndifferent research projects help us think about the power\nof using text for more than its functional attributes.\n5. Our design iterations\nIn the previous sections, we conveyed the big picture -\nour goal and the underlying philosophies and questions\nthat direct this work. In order to start building such a\nrepresentation, we must first develop a visual language\nfor representing the social characteristics of Usenet,\nthinking about how shape, form, color, and motion can be\nused to express these qualities. Although these pieces\nshow the early stages of ongoing work, we believe that\nthe process and considerations used to build them help set\nthe stage for future work in this area.\nIn this section, our goal is to describe how we have\nstarted to relate social characteristics to visual qualities.\nAt each stage, we focus on the approach and reasoning\nbehind each design, discussing its strengths and\nweaknesses, and considering how we could integrate this\nelement into a larger visualization. Although there is no\nfinal integration, we believe that this work still helps\naddress the fundamental questions we have laid out. The\nvalue of this approach lies in the considerations used to\nbuild these designs, and in constructing a framework for\nmore extensive research in this area.\n5.1. Representing an individual\nAs we are focused on a people-centric approach, the\nindividual is the core of our visualization. Considering the\npreviously discussed questions for considering an\nindividual's social attributes, what type of form\nadequately\nrepresents\nthe\ninformation\nabout\nan\nindividual's history and interactions? How can motion be\nadded to that form to help convey tone or emotion?\n\nFigure 4. Representing an individual's evolution\nover time through shapes\nIn Figure 4, we considered how one's form might\nevolve over time to represent one's history of\nparticipation. We wanted to use the form to evoke strong\nperceptions about the person's message tone, and thus the\nperson. In developing this image set, we thought about an\nindividual\nwhose\ninitial\nparticipation\nwas\nrather\ninnocuous, but eventually became provocative of\ninsulting through the use of harsh language or tones.\nThus, the shape on the far right appears more visually\nrigid, edgy and sharp.\nInitially, we realized that the element on the far right\nmight appear to portray a negative judgment of the\n\nindividual. This is problematic because some newsgroups\nencourage and reward edgy responses, such as the group\nalt.flame. One the other hand, this also assumes that the\nvisual element has a negative connotation. Perhaps, the\nimage only conveys differences in the tone of users, with\nthe connotation being developed by the viewer.\nDeveloping this piece allowed us to reflect on how one\ndevelops and maintains a form, considering how one's\nfrequency and history should be factored in. Should we\ndifferentiate a new user with only one edgy message from\na frequent poster who is often edgy? What if that active\nperson was only edgy early on and has posted no edgy\nmessages this year?\nIn order to think about weighting and the magnitude of\none's involvement, we started to consider the role of size.\nWith an individual, we could imagine size to mean either\nlength of involvement or intensity. One downside to this\napproach would be that a person who takes up a larger\nportion of the screen may appear more valuable - an\neffect that could be counter-productive if the most\nfrustrating member of the group is the loudest.\nOne approach is to imagine one's representation as a\nconglomeration of smaller forms, thus exploring the\nmeaning of density. We imagined building a user's form\nfrom the collection of shared words, allowing for density\nto relate to verbosity (Figure 5). We imagined that the\ncollective form should relate to the individual, potentially\nconstructing one's name.\n\nFigure 5. Using type density to build form\nUsing text to represent people makes a lot of sense. The\ntendency to use abstract representations in computational\npieces stems from the desire to develop visualizations that\ncan represent generic data sets. Alternatively, hand drawn\nvisualizations frequently relate the visual object to the\ninformation being conveyed, so as to help the user\nunderstand the representation [22]. Since our work is\nfocused on representing an individual known through\nword-based messages, it's only logical to use the features\nthat we know about the medium - specifically, text.\nAlthough building one's image through the history of\none's posts appears natural, doing so fails to acknowledge\nthe timing of those words. For example, if someone\nposted hundreds of messages 10 years ago, should their\nrepresentation be as dense as an active participant?\nBy considering history, we started to wonder what a\ndecrepit, or dying, form might look like. To express this,\nwe started imagining ways to personify a visual shape,\nspecifically a textual one. Although previous work in\nkinetic typography never altered the form of the text for\nfunctional purposes, we are using text primarily for its\nform; thus, it makes sense to build personality into the\nactual glyphs.\n\nFigure 6. Creating expressive typography\nthrough shape manipulation\nTo personify a textual form, we built a tool where a\nglyph is given physical attributes, such as joints,\nflexibility and weight (Figure 6).. The glyph deforms\ndepending on these attributes, and the associated physics\nequations. Our goal was to base the motion on Disney's\n[9] \"fundamental principles of animation,\" emphasizing\nsquash and stretch and exaggeration. We focused on how\na textual object might move when forced to interact with\nother textual objects, such as might occur if they were in\nconversation. For example, imagine an individual who\nconsistently defers to others. Using a rubbery fluid form,\nthis person would appear to ooze and lose form (or\nidentity) when s/he comes into contact with a persuasive\nindividual.\nThe expressive quality of this motion was quite\neffective and requires further exploration. We believe that\napplying different animation techniques to graphical\nforms has the potential to convey a wide range of\nemotional attributes, potentially personifying non-human\nvisual representations. One future direction would be to\ncorrelate physical properties of a representation with\ndifferent emotional states, extending from the work done\nat Pixar (e.g., [11]).\nBy considering how one represents an individual, we\nstarted to reflect on how shape, form, density, and motion\ncan be used to convey basic features of representation. In\norder to expand these ideas, the next step was to start\nthinking about how communication between different\nindividuals should be represented.\n5.2. Representing a conversation\nAs users communicate with one another, they share\ntextual content back and forth. In many cases, a post is in\nresponse to another post, developing a dialogue between\n\nmany individuals. Although we considered how to use\none's historical text as an individual representation in the\nprevious section, we also recognize the need to show that\nmessages are not just held by the individual, but shared\nwith the group. Thus, maybe text should flow from one\nindividual to another, or to the group as a whole.\nIn order to represent the flow of text -based\nconversations, we started thinking about how text might\nmove, and what paths it might take. Does a message\ncome directly from an individual into the group domain,\neven when it is a direct response? In Figure 7, we explore\nthe effect of speed, angle, and path on the appearance of\nflowing text. For example, a message with quick angular\nmotion that gets directed at a handful of users could\nrepresent a harsh response to previous posts by those\nusers.\n\nFigure 7. Imagining the path of moving text\nWhile some posts are definitely directed at specific\nindividuals, using a time-based path to convey this\nquickly becomes convoluted. What order does the path\ntake? How does a message die, or does it constantly just\ncycle through its path? Here, we started to raise one major\nproblem with using motion in a representation of\nsomething that evolves over a long period of time. If we\nrepresent everything as though it is happening in the\npresent, messages that are responses to others make little\nsense. Conversely, if we only represent things in real\ntime, we fail to show the history of interaction or\nrecognize that most people do not read messages in real\ntime. One alternative, explored in Figure 9, is to use an\ninternal clock that moves with some function to time, so\nthat the representation of a week's worth of interaction\nmight occur in 10 minutes of visualization time. We have\nnot even begun to figure out how to represent time well.\n\nFigure 8. Conversational activity through a\nfountain of letters.\nWhile\nstill\nconsidering\ntime,\nwe\nimagined\na\nconversation as a fountain of messages, where each new\npost explodes from the base to become a vibrant and\nnoticeable message, but slowly fades away into obscurity\nas new posts are written and people stop responding\n(Figure 8). In doing so, we recognize that socially\nimportant messages are not only the most recently posted,\nbut also the ones stirring up active conversations.\nTo distinguish between recent posts and posts that are\npart of an active conversation, we built a visualization\ntool based on actual data (Figure 9). This prompted us to\nthink about how to convey the people who participate in a\nconversation relative to one another. The idea of a\nconversation circle evolved from the natural geometry of\ngroup conversations. No matter how a population is\ndistributed, if there is something of interest that brings\nthem together, a ring will automatically form, providing\nthe\nmost\nefficient\narrangement\nfor\ncrowds\nand\nconversations alike [13]. Like the geometry that forms in\nphysical conversations, each person in our virtual\nconversation helps construct a larger social circle of\npeople conversing with one another.\n\nFigure 9. Developing communication clusters\nAs people converse, the shared information flows from\nthe poster to center of the group, representing a\ncontribution to the common good. We also wanted to\nemphasize a person's frequent contributions to the\nconversation, so we related the size of an individual to the\nnumber of posts contributed to the conversation.\nAlthough we wanted to represent an individual through\ndense flexible forms and use actual message text in the\nflow of conversations, we quickly learned that speed\ncontinues to be a limiting factor in large-scale interactive\nvisualizations. Temporarily, we decided to use abstract\nrepresentations that become text as you narrow your focus\non a specific conversation or person.\nWhen we started representing multiple conversations in\nthe same panel, another concern arose. How do you\nrepresent an individual's participation in multiple\nconversations? Physically, it is challenging to be actively\n\npart\nof\nmultiple\nconversations,\nunless\nthey\nare\ngeographically co-located. Since most people in Usenet\nare involved with multiple ongoing threads, trying to co-\nlocate them is a graph theory nightmare. Although we\ntemporarily addressed this by splitting individuals into\nparts, with a physical representation in each conversation\nand links appearing through interaction, this is neither\ndesired nor intuitive. Coming up with a better way of\nsolving this requires future work.\nWhile using live data, we also wanted to visually\nexplore the statistical aspects of actual newsgroups, so as\nto compare various aspects of different groups. As a\nresult, we were able to visually differentiate groups based\non differences in number of conversations, participants,\nand messages per thread. Through interaction, we could\nexplore a thread's social network, statistical data on\nindividuals,\nwhich\nconversations\nan\nindividual\nparticipated in, and topics addressed. Although these\nlatter attributes were arbitrarily related to visual\ncomponents such as color, visible differences between the\ngroups emerged immediately. For example, Figure 9\nrepresents soc.support.transgendered, a support group\nwith long threads engaging many participants, quite a few\nof whom post multiple times. When we used this same\ntechnique to visualize alt.transgendered, a newsgroup\noverrun with advertisements, no conversation clusters\nemerged. The entire landscape consisted of individual\nposts, with only a few two-person exceptions. On\ninspection, we realized that when people posted more\nthan once, they posted new posts in a series, with\nidentical content in each post. Although these two groups\nappear to be about similar topics, the social interaction\ndiffered enormously.\nWhile we originally built this piece to think about\nconversations, our curiosity got ahead of us and it quickly\nevolved into a group representation.\n5.3. Representing a group\nWhen considering how to represent a newsgroup, we\nreturn to the theories of information visualization\ndiscussed earlier. At this level, it is not possible to convey\neverything that is important within a group. Even if it\nwere graphically possible, we quickly realized that it is\nnot technically possible. Thus, a representation of a\nnewsgroup needs to work on multiple levels.\nFirst, the representation should serve as a fingerprint of\nthe space, conveying the fundamental social aspects of\nthis group so that a quick glance reveals interesting\nfeatures of the group. This fingerprint is useful when\nconsidering how to portray the entire landscape of Usenet,\nan aggregate of all the different groups.\nIn addition to using this representation as an overview,\nit should also serve as the portal to all information within\nthe group - including the specific conversations and\nindividuals. Just as an aerial view of a city portrays the\ncity as the sum of all its parts, so should a newsgroup\nrepresentation. By building a representation that is a\nconglomeration of its components, we give the users the\nability to see each conversation and person in context,\ncreating an obvious link between the different layers of\ninformation. This also encourages interaction, allowing\nusers to explore the finer details of the environment\nthrough interactively zooming in on specific aspects that\nappear interesting, and accessing individual data as\ndesired.\nWe use dense layers of text to build up the multiple\nlayers of information, even though not all of the text is\nreadable at the highest level. Although it may appear\ncounter-intuitive,\nTufte\n[23]\nsuggests\nthat\ndense\nrepresentations make a space far more legible than rough\ngeneralizations: \"High-density designs also allow viewers\nto select, to narrate, to recast and personalize data for\ntheir own uses. Thus control of information is given over\nthe viewers.\"\n\nFigure 10. Dense textual information used to\nconstruct varied forms\nUsing data from a newsgroup composed of spam,\nadvertisements and little conversation (i.e. few posts with\nresponses), we start to explore how textual density can be\nused to build a variety of different forms (Figure 10).\nTogether with the loud colors, these dense forms create an\nenvironment that is both noisy and inconsistent, showing\noff different possibilities while also conveying the general\ncharacter of the group.\nAs we thought about density, we considered the\nhistorical nature of messages. One of the reasons that a\nspace is cluttered with information is because it is\ndifficult to convey the now of an asynchronous\ncommunication channel. At the same time, one of the\nweaknesses of these spaces is that they fail to convey the\n\nhistory of interaction, making it difficult for users to\nimagine that a now-dead group was once quite vibrant.\nUnlike the physical world, interaction in digital\nenvironments does not alter the space; scuffs and stains\naren't left behind to show use.\nModeled after a dance hall environment, we designed\nFigure 11 to explore how historical conversations can\n\"scuff\" the space by slightly and inconsistently altering\nthe background color over the location of a past\nconversation. At the same time, we explored how users\ncould affect not only the space, but also each other. Using\nevolving colors, we imagined that the color of one's\nrepresentation is altered through interaction, particularly\nconsidering what would happen when persuasive\nindividuals interaction with impressionable ones.\n\nFigure 11. Individuals' interactions alter both the\nspace and each other's representation\nAlthough these environment-specific pieces allowed us\nto explore qualities of that space and of the forms\ninvolved, they certainly represent our biases and\nassumptions regarding the type of social environment.\nThe loud colors and rough forms of Figure 10 convey a\nvery negative quality that we have ascribed to spam-\nspecific environments, a projection that may not be\naccurate from everyone's perspective. On the contrary,\nwhile the computational design shown in Figure 9 showed\nsome group differences, the common elements of the\nimages made it difficult to notice anything but the most\nextreme differences.\nMuch work needs to be done at the group level to\nadequately convey the fundamental differences of the\nvarious newsgroups. While using individuals and\nconversations as building blocks, it is also necessary to\nfigure out how to use layout, coloring and overall style to\ndifferentiate between the spaces.\n6. Discussion and conclusion\nThe result of the design iterations presented here is not\na final visualization, but a collection of visual ideas that\nneed to evolve and be integrated into one coherent piece,\nan obvious direction for future work. Alongside these\ndesigns, we have articulated important social features for\ndescribing Usenet, as well as fundamental ideas that we\nbelieve should be applied to future social visualizations.\nThe intention of our method is to start attacking various\ngaps that need to be filled before we can go from a set of\ntextual data to a visualization that represents the\ncomplexity of social interaction behind those words.\nThrough this exploration, we have opened more questions\nand directions for future consideration, four of which we\nbriefly address in this section.\nNumbers do not tell the whole story. While knowing the\nnumber of messages in a group may indicate the level of\nactivity, it doesn't help you know if a newsgroup is\nactually thriving. To know this requires knowing other\ndata, as well as context. For example, thread depth\nconveys more about a group's success in a support group\nthan it does in a question/answer group. Because of this,\nvisualizations intended to convey underlying social\nattributes must present more than just numerical\ncomparisons. Likewise, determining what the quantifiable\ndata represents requires much more analysis.\nText is crucial; its form must be explored. While using\nvisual abstractions can help portray features of Usenet,\neliminating the text removes the most valuable aspect in\nconveying social information. Instead of limiting\nourselves to thinking about the functional aspects of text,\nwe should think about it as a fundamental form in\nportraying conversations. Also, by using text to build\nother forms, we can more accurately convey multiple\nlayers of information, allowing the zooming process to\ntruly present more detailed information. To most\neffectively use text as form, we must further investigate\nits qualitative attributes, particularly in relation to font,\ncolor and motion.\nPersonification through motion. By animating a\ngraphical object, affecting not only its position but also\nmanipulating its internal form, we can use motion to grab\nattention as well as produce a range of expressions. This\noffers the possibility of personifying text, or visually\nconveying the personality and tone that the underlying\nlanguage expresses. If we could visually convey the tone\nof each message, graphically clustering messages would\nhelp evolve the social character of each conversation and\ngroup, creating a cohesive visualization full of life. To do\nthis requires applying animation techniques to typography\nas well as furthering linguistic emotion detection\ntechniques.\nMapping social features to visual characteristics.\nAlthough we have started to relate features of social\ninteraction to visual attributes, there is still much more to\npursue here. For example, given the use of motion, how\nshould we treat time in the visualization? Should it relate\n\nto the time in which messages were posted or smoothly\nrepresent the flow of ideas within a thread? If threads are\nnot related, do they need to follow one universal timing?\nOther areas that need extensive consideration include\ncolor and layout. Can color be used to convey meaning or\nis it too arbitrary? How should layout be used to convey\ntime, importance, relationships or other features?\nWe hope that by discussing our approach, and the\ninitial progress that we have made, we are able to\nmotivate others to consider these issues and help us\ndevelop better visualizations to convey socially salient\ncharacteristics of online social environments.\nFor\nfurther\ninformation\non\nthe\nevolution\nand\ncontinuation of this project, please view our website at:\nhttp://smg.media.mit.edu/projects/loom2/\n7. Acknowledgements\nWe would like to thank the MIT Media Lab, its sponsors, and\nparticularly the Sociable Media Group for their support,\ndedication, encouragement, and late night marathons. Special\nthanks and appreciation go out to Scott Golder, Ming-En Cho,\nand Ronen Barzel for their technological and editing support\nthat make this project and paper possible.\n8. References\n[1] Bentley, I. et. al. 1985. Responsive Environments: A Manual\nfor Designers. London: Butterworth- Heinemann.\n[2] Calvino, I. (1972). Invisible cities. London: Picador.\n[3] Card, S., Robertson, G., and Mackinlay, J. 1991. \"The\nInformation\nVisualizer:\nAn\ninformation\nworkspace,\"\nProceedings of CHI 1991, New Orleans, LA, April 27 - May 2.\n[4] Chi, E. 2000. \"A Taxonomy of Visualization Techniques\nUsing the Data State Reference Model,\" Proceedings of InfoVis\n2000, Salt Lake City, UT, October 9-10.\n[5] Cooper, Muriel, et.al. 1994. \"Information Landscapes,\" MIT\nTechnical Note. April.\n[6] Donath, J., Karahalios, K., and Viegas, F. 1999. \"Visualizing\nconversations,\"\nProceedings\nof\nHICSS-32,\nPersistent\nConversations Track. Maui, Hawaii, January 5-8.\n[7] Donath, J. 1995. \"Visual Who,\" Proceedings of ACM\nMultimedia '95. San Francisco, CA, November 5-9.\n[8] Erickson, T. & Kellogg, W. 2000. \"Social translucence: an\napproach to designing systems that support social processes,\"\nACM Transactions on Computer-Human Interaction, Volume 7,\nIssue 1, pp 59-83. New York: ACM Press.\n[9] Frank, T. & Johnston, O. 1981. Disney Animation - The\nIllusion of Life, New York: Abbeville Press.\n[10] Ishizaki, S. 2001. \"Issues in Kinetic Typography.\"\nPittsburgh,\nPA:\nCarnegie\nMellon\nSchool\nof\nDesign.\nhttp://www.cmu.edu/cfa/design/kdg/kt/kt_issues.html.\n[11] Lasseter, J. 1987. \"Principles of traditional animation\napplied to 3D computer animation,\" Proceedings of the 14th\nannual conference on Computer graphics. Anaheim, CA, July\n27 - 31.\n[12] Lynch, K. 1960. The Image of the City. Cambridge, MA:\nMIT Press.\n[13] Milgram, S. 1977. The Individual in a Social World: Essays\nand Experiments. New York: McGraw-Hill.\n[14] Raskin, J. 2000. The Humane Interface: New Directions for\nDesigning Interactive Systems. Reading, MA: Addison-Wesley.\n[15] Richardson, S., Dolan, W., & Vanderwende, L. 1998.\n\"MindNet: acquiring and structuring semantic information from\ntext,\" Proceedings of ACL-Coling. Montreal, August 15-16.\n[16] Rosenberger, T. 1998. \"Prosodic Font: Between the Spoken\nand the Written.\" Massachusetts Institute of Technology: MAS\nThesis.\n[17] Roth, S., et. al. 1996. \"Visage: A user interface\nenvironment for exploring information,\" Proceedings of\nInformation Visualization. San Francisco, October 27 -\nNovember 1.\n[18] Sack, W. 2000. \"Discourse Diagrams: Interface Design for\nVery Large Scale Conversations,\" Proceedings of the HICSS-33,\nPersistent Conversations Track. Maui, Hawaii, January.\n[19] Shneiderman, B. 1987. Designing the User Interface:\nStrategies for Effective Human-Computer Interaction, Addison-\nWesley Publ. Co., Reading, MA.\n[20] Small, D. 1996. \"Navigating Large Bodies of Text,\" IBM\nSystems Journal, Vol. 35, No. 3&4.\n[21] Smith, M. and Fiore, A. 2001. \"Visualization components\nfor persistent conversations,\" Proceedings of CHI 2001. Seattle,\nWA, March 31 - April 5.\n[22] Spertus, E. 1997. \"Smokey: Automatic recognition of\nhostile messages,\" Proceedings of Innovative Applications of\nArtificial Intelligence (IAAI). Providence, RI, July 27-31.\n[23] Tufte, E. 1990. Envisioning Information. Chesire, CT:\nGraphics Press.\n[24] Wasserman, S., & Faust, K. 1994. Social Network Analysis:\nMethods and Applications. New York: Cambridge University\nPress.\n[25] Whittaker, S., Terveen, L., Hill, W., and Cherny, L. 1998.\n\"The dynamics of mass communication,\" The Proceedings of\nCSCW '98."
    },
    {
      "category": "Resource",
      "title": "danah1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/mas-963-techno-identity-who-we-are-and-how-we-perceive-ourselves-and-others-spring-2002/7e26a7c3739b768a4cb3d763bffbd336_danah1.pdf",
      "content": "Assignment 1: thinking about identity: categorization, prototypes, stereotypes\nAssignment:\nRead all three essays. Think about how categorization \"makes society possible\":\nz How do these authors describe the cognitive structure with which we think about\npeople?\nz Where do the categories come from?\nz How do they change and evolve?\nz How do we classify people we meet?\nz What happens when the cues we get from the person do not fit any existing category?\nz Why do we have the particular categories we have?\nz Are they primarily descriptive (what is this person like) or prescriptive (how should I\nact toward them)?\nz How is information about types of people shared?\nz Is the development of these categories a personal or social process?\nResponse:\nAs articulated by Simmel, and exemplified by Holland & Skinner and Hirschfeld, we develop\nimmense mental constructs about people, using detailed categorization to build intricate\nschemas for comparing and relating people along many axes of information. These constructs\nencompass many different aspects of an individual's self, weighting what the perceiver values\nduring the interaction. The perceiver than uses this information to build assumptions and\nstereotypes that can be valuable for quickly making sense of the world around hir.\nSocial interaction magnifies these constructs. In developing shared language by which to\nspeak about the different constructs, people develop a common vocabulary as well as socially\nnormative value judgements. Language allows for labels, but labels require an individual to\nnarrow a rich mental image into coarse categorizations for shared description. Thus, while\nlabels allow for people to share their perceptions and mental images of the world, they also\nstart developing common categorizations that are both socially beneficial and harmful.\nIn developing a language around race and gender, many assumptions are made based on\nphysical appearance. Visual appearance is most frequently what people use to develop these\ncategorizations, using skin tone and sex characteristics. Using racial and sex labels,\nindividuals then consider behaviors to narrow down those categories, resulting in\nassumptions that are not necessarily true if the same behavior is performed by someone of a\ndifferent race/sex.\n[Since race/gender assumptions are so pervasive in contemporary society, the fact that neither\ncan be simply defined becomes immensely interesting. Not only can race not simply be seen\nthrough skin tone, but our conversations surrounding race in the States usually stem from our\ninability to discuss socio-economic class properly. Gender is problematic because it is most\nfrequently tied to sex. For the most part, sex can be simply categorized into male/female,\nalthough the conversation gets hairy when we need to break sex down into chromosomes,\nhormone levels, genitalia, etc. Since approximately 99% of the population have biological\nsex characteristics that can be generalized into male/female, this labeling is usually simple.\nThe situation gets more convoluted when gender performance does not match sex (acquiring\nlabels such as \"tomboy\" or \"sissy\"). To confuse the sex/gender dichotomy, sexuality often\ngets thrown into the mix, as is evident in Holland & Skinner's article, where the girls\nreference suitors' gender in relation to their sex and equate it to sexuality.]\n\nDrawing from Simmel, we can imagine an individual's mental model to be a series of\nconstructs. Not only are these models affected by direct interaction with an individual, but\nalso by social discussion of interactions. In these interactions, both with new people and with\ndiscussants, an individual is able to (re)form hir mental models. It's important to note that the\nmagnitude of change is highly dependent on how willing an individual is to alter hir initial\nopinions. (Sadly, if i remember correctly, people are more likely to rewrite history than to\nalter their mental models, making first impressions highly valuable.)\nPeople use these models to build stereotypes, in order to make assumptions about proper\nways to act in future situations. Stereotypes are often quite valuable, saving time and effort\nby allowing assumptions to be derived based on past experiences. Although stereotypes are\nbuilt based on a descriptive understanding of past events, they are used prescriptively in new\nsituations. Depending on how malleable one's mental models are, stereotypes are rewritten\nwhen enough social interactions indicate their lack of validity. Without a willingness to\nchange, everything starts to look like a nail to the owner of a hammer. This lack of\nadjustment is precisely what allows problematic stereotypes to continue over time and\ndevelop into negative prejudices.\nIn short, Simmel's theories on mental models go a long way in explaining social prejudices\nby allowing us to reflect on how people perceive and categorize those around them in order\nto properly interact in a social setting."
    },
    {
      "category": "Resource",
      "title": "danah2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/mas-963-techno-identity-who-we-are-and-how-we-perceive-ourselves-and-others-spring-2002/6640765c49489b310ee2107f252f798a_danah2.pdf",
      "content": "Assignment 2: Cultural Identity\nPart 1: language, dialects and email\nAssignment:\nSome questions to think about: What do we need to know about the other\nperson in order to converse with them? What are the things we learn about\nanother person through their use of language? How does this migrate to the\nonline world - given the sparse identity cues, what aspects of conversation\nbecome especially problematic? Given that in conversational forums (such as\nemail lists, etc) all we know of a person is through their words, what are the\nidentity cues we can discern via language? How is language evolving online?\nObserve two conversations, one in the immediate world and one online (can\nbe email, chat, newsgroup, bulletin board etc., but should be something that\nis conversational - people interacting with each other - rather than more\npublication-like media). Watch for:\n-\nways in which the participants reveal their identity through their\nlanguage (including non-textual/non-verbal aspects)\n-\nways they use their knowledge of each other's identity to modify their\nlanguage\n-\nways they try to assess the other's identity\nWrite up your observations. Keep the Saville-Troike reading in mind as you\nframe your description - are you finding interesting phenomena in greetings?\nin contextually motivated language or stylistic shifts? etc.\nResponse:\nConversation 1: Direct personal physical reality (with biased\ncommentary)\n3 male participants in their late twenties in an environment where other\npeople come in and out. Carl & Scott live together; Scott & Alex are best\nfriends and have known one another since high school. Carl is a gay and\nMexican; all of his friends are straight and white.\nInitially, Carl & Scott are sitting in Scott's room, listening to music and\nshooting\nthe shit. Alex enters the room and Carl turns to him and greets him through\nsexual remarks, along the lines of \"Hey baby, come sit in my lap.\" He is\nexplicitly flamboyant, appearing to present a mocking view of his gay\nsexuality. Alex rolls his eyes, indicating that this greeting is pretty normal,\n\nand responds with \"Hey Carl - good to see you too.\" Carl pretends to get\noffended and throws back \"What? You don't like this hot Mexican ass?\" Alex\nraises an eyebrow and then turns his head to Scott. Scott just nods his head\nat Alex in greeting an Alex proceeds to sit down next to Scott. Carl gets up in\na fake huff and starts to talk around the room, picking up CDs and other\ncollections that Scott owns.\nAfter a short silence, Scott turns to Alex and asks \"So, what's going on?\" to\nwhich Alex responds with \"nothing\". Short silence, which Carl breaks with\n\"Bullshit Alex, your life is full of drama\" to which Alex scowls.\nAs the night continues, the boys continue to taunt one another with little\nthings. Carl continues to make direct references to his Mexican heritage, at\none point mocking another person in the room for being his brother because\nthey share the same dark Mexican eyes. Carl's language functions are\nsarcasm, often bringing his Mexican gay identity into the picture, reacting to\nthe fact that that makes him unique in this situation. Alex primarily functions\non sharing what is necessary or what is pulled out of him. Scott asks simple\nquestions for social appropriateness, knowing that the language responses\nwill give him no feedback. Having spoken with Alex & Scott, they don't\nexpect any linguistic honesty from the other two, but use the responses to\nget a gauge on what emotional content lies beneath.\nUnlike their interactions with me personally, their interactions in a group are\nheavily distanced, with minimal sharing of verbal personal information. Their\nshared experience is encoded in their body language, what they offer one\nanother, how they respond to music and shared objects. The content of the\nconversation becomes meaningless, as they are all looking to see more\ndetailed responses. Carl is the only one who adds verbal character to it, and\nit's all based on a certain level of sarcasm. Scot will tell little lies to add\nhumor to the situation, knowing that the other boys recognize all of his\ncontent as lies (I've been able to gain this awareness by conversing with\nthem privately).\nHaving baseline knowledge about them and their interactions makes the\nobservation fascinating. They expect to share everything through body\nlanguage and gestures, not verbal cues; verbal cues are meat to tease one\nanother. Their identity comes out in how they gesture to one another, what\nthey put forward in their body language. Carl magnifies his gayness through\nintentional prancing. Alex & Scott try to keep a low profile, constantly\nobserving others who enter into the room, with particular attention to the\nnon-passive Carl. Much about Carl's perception of Alex & Scott comes out\nthrough the ways in which Carl taunts them, and particularly how they\nrespond to Carl.\nWhen outsiders enter the room, Carl becomes less sarcastic, adjusting his\nbehavior to acknowledge that others are not aware of their relationship and\n\nmight not take the sarcasm as well. Alex & Scott are less self-monitoring,\ncontinuing to stay in the background.\nConversation 2: Digital discussion by participants in same physical\nenvironment\nThis conversation is taking place on a public archived mailing list with a 128\nmembers. During the conversation, about 10 people have spoken up.\nAlthough the mailing list was designed to help members of the same music\nscene communicate with one another, the group often talks about other\nthings of common interest. It's important to note that most members of this\ncommunity see each other regularly in social contexts at various music\nevents around Boston. The conversation was sparked by an initial post about\nthe ACLU's request for people to sign a petition opposing IDs for voting.\nMike, the initial respondent, was outraged that someone from the group\nforwarded ACLU's post and commented on individual sections of the ACLU's\npost, suggesting that most of the information is a lie, inaccurate or an\n\"attempt by leftists to vote multiple times.\" In his post, he made references\nto ways in which the legal system was set up for checks and balances and\nthat there was no racism within the government.\nNeedless to say, this stirred up a lot of people's emotions and they sought to\nattack his responses, using personal/societal examples and legal cases. Mike\nresponded to every response directed at him, although no one backed any of\nhis statements, only tried to refute them.\nAbout 10 messages into the conversation, another poster started attacking\nMike's views, referencing older events and angrily stating that his Libertarian\nattacks on people are not appreciated in this forum. He furthered this by\nattacking all Libertarians. Others tried to post with \"can't we all get along?\"\ntype messages but the flames slowly dwindled when people realized that the\nfighting wasn't getting anywhere.\nNot only did this dialogue make it apparent that the community is quite\nleftist/liberal, but that the one non-liberal is quite vocal and vengeful,\nattacking individuals, which inevitably means that he's attacked right back.\nThe tone of messages allows us to get glimpse of the people; their sex is\noften determined by the name on the post. Their political views are either\nderived by their content, or by statements like \"As a Libertarian...\" One can\nassume that everyone is white, because people of color seem to say \"As a\nblack woman...\" as well. This makes it very interesting to see how social\n\nnorms are maintained and people have to state their difference to the group\nnorms that are inexplicably built.\nThinking about both sets of conversations...\nOne of the fascinating things about the physical conversation that i chose is\nhow much was discussed without words, and how words were not used to\nactually share information, but to share non-information that unintentionally\nshares information. In the digital realm, everything is about the \"verbal\"\ncues. Little bits can be picked up between the lines (email addresses), but for\nthe most part, building a person's character relies on reading &\nunderstanding their words, or the words of others talking about them.\nBecause there's only one set of signals, things can easily be misinterpreted.\nAdditionally, because of the ease of flaming, things quickly reach a yelling\nmatch level, something that does not happen so easily in the physical world.\nSelf-monitoring habits are altered because there's only one channel with\nwhich to monitor from, so you are either silent or vocal and have to worry\nintensely about being read right. Additionally, you can't see how others are\nresponding to you, unless they do so explicitly. Thus, the ability to look\naround the room and see if most people agree becomes particularly\nchallenging."
    },
    {
      "category": "Resource",
      "title": "danah3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/mas-963-techno-identity-who-we-are-and-how-we-perceive-ourselves-and-others-spring-2002/dcc448b2fc7275c78523e25c7ec524cc_danah3.pdf",
      "content": "Assignment 3: cultural identity part 2: fashions in clothing, music and links\nAssignment:\nThis week we are thinking about how fashion is used to communicate identity. The fashion\ncan be in any media - clothing can be a social medium, as can music, automobiles, home\nfurnishings, or, in the online world, links.\nPlease read the selected chapter. As you do so, think about these questions: how do these\nmedia (i.e. clothes, cars, links, etc) acquire social meaning? How do these meanings change?\nWhy do they change? Can you map out a relationship between differentiation and imitation\nas forces of cultural change? Can you distinguish between the inherent or symbolic meaning\nof an object and its social/fashion-based meaning? What is the impact of the affordances of a\nmedium (say, clothing vs. links vs. music) on its dissemination? What is the role of the\nmedia?\nIn your writing, discuss examples from both the physical world and the online world. Is there\n\"fashion\" online? How is it manifest? What do you think the future will hold?\nResponse in random thoughts:\nBroken down, there are two main types of fashion that must be considered: objects and\nknowledge. They must be separated because the possession and dissemination of these two\nare dramatically different.\nMost objects are created for a purpose, in a particular time period, for a particular owner or\nclass of owners. In their creation, they already have meaning in relation to their owner or\nsociety. Simply the possession of these meaningful objects situates them and their owner\nwithin society. Part of what makes objects valuable is their tangibility, being one in a limited\nset. The rarer an object is, the more valuable it is. When an object is rare and in possession of\nan admired individual, it is likely to become fashionable out of desire. The more common an\nobject, the weaker its value; thus an easily duplicated object is less valuable.\nWhile the value of objects is socially defined, there is still a unique challenge in being able to\npossess something physical. Knowledge-based fashion is quite different because knowledge\nis easy to disseminate and easy to possess. Thus, in order to make knowledge valuable, it\nmust be publicly known that an individual has knowledge while simultaneously not revealing\nthe actual knowledge so as to not weaken its value. Unlike objects, knowledge loses its value\nsimply by being put on display, yet at the same time must often be displayed in order to give\nthe owner credibility.\nFashion in the digital world must deal with this confound. Unlike physical objects, digital\nones can be easily duplicated. Likewise, knowledge can be quickly disseminated while it's a\nchallenge to show that one possesses information. Such an environment magnifies the speed\nin which fashion changes, just as factories shortened the fashionable lifetime of clothing by\nmaking the objects more accessible. Because of the duplicateable nature, most digital\n\"fashion\" is in the form of knowledge not objects.\nMemes are an interesting digital example. In being the first person to share a particular\nmeme, the owner of the knowledge is perceived well. Yet, should the forward be considered\nlame or been previously seen, the owner is seen as behind the times, even if the life of the\nmeme is less than a day old. There is a tipping point in knowledge when it goes from being\n\nelite to being common, like the spread of gossip.\nThere is one digital site where digital object ownership is exceptionally valuable for its rarity\nand that would be gaming. In environments like Asheron's Call, the developers create certain\nobjects with limited quantities. For example, they might create 5 red vests. Whether these\nobjects are acquired through skill or luck, they quickly become monetarily valuable, traded\neither internally within the system or externally on sites like eBay (where some fashionable\ngaming items sell for hundreds of real-world dollars). When gamers figure out how to\nduplicate items or the developers release more of a particular item, the value quickly\ndeteriorates. Because the worlds were created to encourage fashion (complete with actual\nfashion shows), this type of social economy quickly mimicked the real world.\nOn a completely different note, i would like to take issue with McCracken's analysis of\ndivestment rituals. He fails to acknowledge or integrate the collector, the vintage clothes\nshopper or the antique dealer. While many people want to divest objects to make the\npossession seem original, there are also many individual who value objects with history, for a\nvariety of different reasons. Some value objects previously owned by famous individuals;\nothers value them for their time-based authenticity. For whatever the reason, there is a\ntremendous value in objects with history, placing them in a context that the current owner\nwants to associate with, or giving them a uniqueness that is inherently valuable, where the\nuniqueness comes from both the object and its association in context.\nIn the digital world, such history is hard to maintain. Objects don't hold on to unique stains.\nThe only comparable example of this would be complete collections (i.e. Google's groups,\narchive.org) which are valuable for their magnitude if not uniqueness. Traces of the past help\ngive people context now, which makes previously invaluable objects or ideas valuable now\n(i.e. Linus' announcement of Linux on Usenet as announced by Google). Yet, unlike the\nphysical objects that have traces, knowledge objects are mostly valued in their nostalgia,\ngiving the owner social rewards but not economic ones."
    },
    {
      "category": "Resource",
      "title": "danah4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/mas-963-techno-identity-who-we-are-and-how-we-perceive-ourselves-and-others-spring-2002/bd2075230c24178d87773dcc84a5019f_danah4.pdf",
      "content": "Assignment 4: the face\n\nAssignment: [web link]\n\nGo to a public place and observe 4 different people you do not know. Write down what your impression is of each of\nthem. How much is your impression drawn from their face, their clothing, their actions, etc? Concentrating on the face,\nwhat sense of the person do you derive from it? Can you articulate why? Do you think any of the \"overgeneralization\"\nprocesses that Zebrowitz describes played a role in your interpretation? What about other categorzation processes?\nWhen do you think seeing someone's face is important in a mediated environment? Why? In what form? What about\nvideophones - do you think they will eventually replace or supplement the audio-only phone or is there a deeper reason\nwhy they have never been successful?\n\nConceptual response:\n\nOne of the most important uses of faces is for trust building. By abstracting out people, it's easier to not think of the\nimpact of a lie or a decision, but by seeing their immediate visceral response, the impact is obvious. It is easier to tell\nsomeone painful news via email or phone because you don't have to feel the full impact of your statements, you don't\nhave to see it. Likewise, it's more difficult to build faith in someone who exists simply through text or voice, partially\nbecause it requires more honesty on their part.\nAside from all of the exceptionally valid points that Judith makes in her overview article, i think that one of the\nproblems with technological replacement of the face is that it's missing that visceral feeling. You can't smell someone's\nbad breath, but you can't also feel the effects of being in the same environment. Phermones asides, you don't feel the\nsame breezes, the same smells, etc. Depth can be artificially conveyed but the nuanced details are not picked up by\nthe camera, let alone by computation. It just isn't real, and i don't see it being real anytime in the near future.\nAnd, although i truly agree that artistic and abstract versions of faces provide a lot of information, they do not provide\nthe key salient features that do things like trust building. It's just as easy to lie to a smiley face as it is to lie in text.\nYou don't feel the consequences of co-presence; there's a distance that the abstract can't bridge.\n\nI am really interested in how close-but-not-perfect representations of the face are more problematic than completely\nabstract representations. Taken a little bit further, i am imaginging what problems would occur if the face felt\ncompletely natural. A lot of what we read into a face assumes co-presence. If i can't feel the wind, seeing a face that\nlooks like it's been blown by the wind seems peculiar. If the face that i'm looking at feels real, than i expect certain\nthings that will not happen if we aren't sharing the same space. This is confusing and could lead to a slew of other\nmiscommunications. Returning to my biggest use of the face, i could only imagine how these representations would not\nonly fail to build trust, but potentially tear it apart.\nAlso, i genuinely believe that the videophone will never be a common tool for most communication. There's a lot of\nadvantages in not being able to see the person on the other end. I happily answer the phone when i am naked,\nregardless of who is calling. I walk around the house, fold laundry, websurf; some of these tasks can be shared while\nothers indicate that i am not paying attention (and depending on the person at the other end of the line, i might not\nbe). I don't clean the room to talk on the phone; i don't have to adjust the light. Also, since you aren't sharing a space,\nyou can't share the same physical feelings of it. Sitting in your kitchen while your mom is cooking is much more\nenticing than sitting on a videophone watching her. I can have a phone conversation while playing with my kitten and\nwatching her; this would be annoying over video because there's no other sense that i'm paying attention and the\nrecipient can't reach over to pet the cat too. I can walk and talk, while a video phone would not give me that freedom.\nSince we are not sharing a physical space, we can't share physical experiences. In videophones, video is extra\ninformation that doesn't make a conversation more relaxed and comfortable, just more formalized; it takes away a lot\nof the things that people do while they are talking on the phone that they would not do if they shared a physical\nenvironment, for better or for worse.\n\nObservation:\n\nThis observation was completed at a goa club. Goa is a type of music that attracts people from a variety of cultures;\nthis party was approximately 1/2 Israeli, 1/4 German or French and a mix of other people. I decided to watch four\nindividuals at the beginning of the night as they interacted with people over time. Many of the people at this club were\non hallucinogenic drugs or alcohol. Most of the clothing resembles European rave. The party goers are between 21 and\n60, with most of the crowd being 25-35. Given the absurdity of this environment, i figured this would a be perfect\nobservation space. I should note that my motivation in attending the night was to see how a party was\npromoted/produced and, as i was the driver, i was completely sober. Thus, this absurdity described is not filtered\nthrough any alcohol or other substances; it's completely entertaining on its own.\nKingdomRuler. This is a character who i've heard about although i've never met him, but was quickly able to distinguish\nat the party. At the beginning of the night, he was wearing a tuxedo, had his ears molded into the shape of an elf and\n\nhad colored those ears with flurescent paint. Many people appeared to know him and were constantly approaching him.\nAlthough the greeting was typically a hug or a hand shake, it was done with a certain amount of aloofness so that the\nobserver knew who was in control; girls also received kisses. Although he was not throwing the party, he was acting as\nthough this was his kingdom and he was the ruler. Along with his body language, his face had a certain amount of\narrogance - one eyebrow being raised, a smile for the guys that resembled a smirk (one side of the lip raised up). I am\nalso assuming that he had access to drugs, because many girls would go up to him, dance around and then poise in a\nbegging-like position. He would wrap his arm around her and then take her off somewhere else. During the night, he\nchanged his outfit 3 different times, getting more and more casual as he started dancing. Although most of the\naudience was dancing most of the night, he spent his evening walking aro und talking to people. He had hand-crafted a\npair of glasses that had different flashing lights in them that he wore; they used a bright white light that made him\nhard to miss amongst the crowd. Without a smile on his face, with his chin raised all night (although almost everyone\nwas shorter than him), with a smirk on his face and a condescending gaze that often turned into raised eyebrows, it\nwas hard to see him as anything other than egotistical, acting as the mighty ruler of the space. [To magnify this\npicture, i tracked this character down online. He has developed his own religion, produces websites intended to be\nirritating, including information on worship.]\nWolfGirl. This girl was pretty small, had long dirty blonde thick dreadlocks and was wearing a bunch of layers of\nclothing including a rawhide vest that was handmade and had a statement about saving the world written in a dark red\nthat could have been blood. Her t-shirt read \"Terrorists win\" and there were holes in the shirt everywhere. All of her\nclothes were completely tattered, either due to hippie style or her being a genuine traveler (common for this scene).\nHer face was small beneath the dreadlocks, noticeably thin with a nose that pointed upwards and a smile that wrapped\naround her nose, quite large for her face. Her eyes were brown and distinctly noticeable (magnified by her thinness).\nMost of the night she was running around the club, shaking her dreads in people's faces and then pausing to raise her\nhands to the sky and start screaming, only to run and scream some more. Her rawhide vest had tassles on it that\nmoved as she moved, as did her many layers. Her face was mostly noticeable when she was screaming, with pursed\nlips in a wolf-like form, barking at the ceiling. At one point, she went up to MachineElf and licked his face; he put his\narm around her, tossling her hair and she nuzzled up to him. Because of his glasses, she followed him around for about\nan hour, making him look at her as she stroked and kissed his face (this did not help the arrogance about which he\nheld himself). In another moment, she came running up to me, dreads shaking, arms flaling and looked me straight in\nthe face, eyes as wide open as possible, tongue rattling random sounds. Her name is wolf girl, simply because her\npresence, her mannerisms were so animal like that it was hard to imagine her in any other way. At one point, i followed\nher into the bathroom and watched as she made fraggle-rock/Animal faces at herself in the mirror.\nMeditator. About 50 and balding, this guy wandered around the club all night to the beat of a very different drummer.\nAt most points, i would look around and everyone would be in tempo with the music, except him. In fact, i'm not\ncertain if he noticed the music since he rarely even faced the DJ let alone the other partygoers. And he didn't really\n\nnotice them either and he would wandered around eyes closed bumping into other people unless they moved, which\nthey usually did. He would scratch his head, go into meditation form, all with a content smile and open face. And then\nsuddenly, his eyes would open as though he had just solved the world's problems, he would get a _huge_ smile on his\nface, look up to the sky, raise both hands, appear to give thanks or express that he found god and then go back to\nthinking. In a few instances, he would go up to random people, not look them in the eye and then suddenly perform his\n\"i've solved the problem\" look. Sometimes, he would wander around, drop to the ground and start bowing Zen-form.\nHe also did random yoga movements, all in serious thinking face, yet with this odd content smile. His face was thin,\nnose pointy. He looked like he had found peace with himself when his eyes were open and mouth smiling, but\notherwise he looked like he was lost deep inside, oblivious to the rest of the world, happily glowing.\nAngryGuy. This guy ran around the club in speedwalker position all night, both eyebrows furrowed downward, cheeks\npuffed out like a chipmunk, mouth pursed as tightly as possible. In some instances, he had a clipboard with him that he\nwould occasionally stop and stare at for clarity, without chipmunk lips, but usually he was racing around the floor, head\nand neck first, arms square in speedwalker form. Sometimes, his arms would be rubbing his blown lips violently as he\nwalked or tossling his hair. During some stops, his hands would be at his face in thinker mode. Never did the v-shaped\neyebrows disappear, even in pauses. As a result, he looked like there was something he needed to do, something that\nhe had forgotten; he was puzzled and rushing, trying to figure it out. Should it have been Wall Street, he would have fit\nright in, appearing rushed, concerned and in need of a million things to do; in a party setting, it just seemed absurd.\nAll four characters, as well as the other 100 people in the club, had a distinct character about them, developed in part\nby their dancing style but also by their consistent facial expressions all evening (often adding to their dance style).\nAssuming that most people were far fro m sober, i have no idea what these people look like on the street, but their\ncharacters here could have been equally a party or an insane asylum. I chose to watch 4 characters that didn't rely on\nanyone else to be happy, but it should be noted that there were a lot of of people who weren't like that. One guy would\nget a huge grin on his face, dance spastically and elegantly in front of this one girl looking like the world was perfect\nand he was having a great time, but the moment that she would turn away, his face would droop, shoulders would\ndroop and all of a sudden he looked desperate and about to cry, with every element in his face going from absolutely\necstatic to absolutely depressed. There are also ways of characertizing the people at a club based on the\ncharacterization of their dancing style (and there are a few very common forms) - the Israeli stompers, the angry arm\nflaling girls, the lost in space bobbing dance, the animals (last nite, some of the dancers could best be described as\nhorses, birds, wolves...), the thin goa girl marchers. In each of these categorization, not only is there a particular look\nto their dance, but there is a look to their faces, showing the \"emotion\" that allows for them to get typed as \"lost\" or\n\"angry.\" Without their faces, they just look like they are moving to a beat in a peculiar way; it is the face that gives\nthem a \"character.\""
    },
    {
      "category": "Resource",
      "title": "danah5.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/mas-963-techno-identity-who-we-are-and-how-we-perceive-ourselves-and-others-spring-2002/1b54d102251b027e8e7711f3dc3a1e80_danah5.pdf",
      "content": "Assignment 5: paper proposal\n\nAssignment:\n\nIf you are taking the class for credit, this is a proposal for the final paper. What aspect of identity are you going to\nwrite about? What are the questions you are addressing? Why is this an interesting area? What approach will you take?\n\nConceptual response:\n\nI'm interested in looking at the convergence of identity and privacy in a digital age. How does data about you construct\nyour identity? Who owns this data? Who has access to it? Who should? What are the implications for an individual who\ndoesn't have control over hir information? What are the implications for marginalized individuals? Does external control\nof identity information create homogenization of people? How do digital design decisions affect an individual's ability to\ncontrol hir identity as desired?\nRecently, technology offers governments and businesses the ability to store and access large quantities of information\nabout people. Sometimes this data is used to do targeted advertising; sometimes it is stored to ease individual's digital\nlives. Regardless, the data has the potential to create an entirely different society, where people can be labeled and\nprioritized by various institutions for both economic and political reasons. Although thought of as a convenience, these\ntechnologies have the power to radically change how individuals present themselves both digitally and physically by\ncreating social values that can be easily enforced. Rather than being freeing, technology has the potential to be\ntremendously constraining.\nGiven these negative possibilities, how then can we affect technology to be more empowering for the individual? What\nmust we be aware of in order to control for the negative possibilities?\nThis paper will consist of a segment of my thesis, presenting an overview of the fears, the concerns and the philosophy\nbehind what control individuals should and shouldn't have over their identity information."
    },
    {
      "category": "Resource",
      "title": "danah7.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/mas-963-techno-identity-who-we-are-and-how-we-perceive-ourselves-and-others-spring-2002/8a46b1fe4992c554b9e9fe9e1d14d16a_danah7.pdf",
      "content": "Assignment 7: databases and privacy\nAssignment:\nYour assignment is to present two opposing views describing the benefits and\ndrawbacks of creating big databases of information about individuals.\nWhat are the most interesting, useful, intriguing, revolutionary things that can be\ndone with such databases? How can they enhance life for the individual and improve\nsociety? In particular, how can they enhance the computer-mediated world, where\nidentity is currently so sparsely depicted.\nWhat are the most serious drawbacks to creating such databases? Are there social or\ntechnological approaches that ameliorate these concerns? Under what circumstances\nare these drawbacks most serious?\nDatabases:\nAround the turn of the century, the Dutch started collecting massive amounts of data\nabout their citizens for genuinely good reasons. They wanted to have all of the\ngenealogical data on record for their citizens; they wanted to give individuals proper\nburials. In 1940, Nazi Germany invaded Holland and captured all of this meticulous\ndata within 3 days, having the appropriate data to track down and execute an absurd\npercentage of the Jewish population in a matter of days.\nDatabases are tricky. They make our lives much easier at the same time that they\noffer terrible potential when put into the wrong hands. It is that potential for harm\nthat makes databases terrifying because, even when data with the best of intentions\nis aggregated, it provides detailed data about individuals that can be used in harmful\nways.\nGenealogy work is a great example of where databases are both fantastic and\nterrifying. On one hand, databases eliminate the research nightmares of dealing with\nlocal churches/synagogues/legal systems, allowing individuals to more rapidly\ndetermine their history. In this way, the public access of this information is a\nblessing. Turn the problem on its heels. When one is going through the hassle of\ntracking down one's genealogy, one rarely considers researching one's friends,\ncolleagues or other individuals. But, the simplicity of the web allows people to quickly\naccess the genealogy of anyone, for better or for worse. Not only might this data be\nembarrassing (i.e. being related to a known historical villain), but it might also be\nmedically invasive (known to be the offspring in a family with genetic diseases).\nAdditionally, due to the lack of security, such databases make identity theft simple.\nThe database is neither good nor bad, but the ways in which people can use them\nare.\n\nDatabase Benefits:\nOne of the best uses of databases is to allow for the maintenance of important\nrecords for individual use. For example, having a complete medical history at my\nfingertips is essential when I enter the hospital because it gives the doctor a\ncomplete sense of what medical past s/he is working with, even if I am unconscious\nat the time. Even if I was conscious, my explanations of my medical history are most\nlikely not to be at the level that the doctor would like. Thus, this data snapshot can\nbe quite useful in conveying essential information.\nLikewise, databases are an aid to daily life when they can store and process the\nmassive amounts of data that we interact with on a daily basis - phone numbers,\naddresses, birthdays, calendar, song titles, etc. Information that we once focused\nintently on memorizing can now be kept in a 'secondary brain' of sorts, freeing our\nmind to deal with other issues.\nEvery day I use databases that make life a bit more convenient: IMDB, my\nbooks/CDs/movies databases, purchasing records, search engines, transit options,\nnews articles, etc. This allows for fingertip access to information, the most beneficial\naspect of databases. They give me some control over my world.\nDatabase Drawbacks:\nDatabases not only provide me with information and data (about me and about\nlibrary-esque information), but they also provide the database maintainers\ninformation about me. My actions are recorded and maintained, aggregated and\ncomputed. I have no control over this data, nor any access to its accuracy. It's used\nto create reputation scores that companies use to determine whether or not I'm a\nvaluable customer (and thus, whether or not they should talk to me). Since\ncomputers are never wrong (ha!), databases remove the responsibility of hierarchies\nfrom those implementing them in a Milgram-esque fashion of duty without moral\nconflict. This allows for a systematic implementation of marginalization, as is being\ncurrently implemented in airports.\nDatabases are dangerous because they amplify the possibilities for those with greedy\nor malicious intentions, or even for those with economic pursuits who don't realize\nthe impact of their technology. If society was utopian, databases would be harmless\nbecause no one would consider using them to inflict pain on others; that is not the\nsociety we live in.\nBrin argues that a transparent society would be an ideal response to data storage.\nSadly, I can't agree. Transparency would be ideal if individuals were homogeneous or\nexplicitly tolerant. Transparency fails individuals who are protecting personal data for\nfear of marginalization/violence/hatred. The further one is from the globalized\nstandard of 'average', the more likely an individual is to be a target with\ntransparency.\nAggregation of data means that context is no longer important to social\nperformance; we are always in the public spotlight when databases are involved. We\ncan laugh at funny reminders of how databases are used to remind us of our past in\n\na different context, so long as we aren't the ones who can't get a job because of our\npolitical views.\nThe more the world is on edge, out to get entire classes of people; the more\ndatabases can function to cause harm. Like anything, databases are most\nuseful/problematic when combined with power.\nHow then do you make certain that they can only be used for good purposes?"
    },
    {
      "category": "Resource",
      "title": "danah8W.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/mas-963-techno-identity-who-we-are-and-how-we-perceive-ourselves-and-others-spring-2002/30effd72987d1add425f10d42b54a509_danah8W.pdf",
      "content": "Assignment 8: textual portrait\n\nAssignment:\n\nCreate a portrait of someone (possibly yourself) purely in the description of the person's\nroom. The description can be quite factual, a list of items, or it can be editorialized,\ncommenting on the meaning of things, or it can use the items as the basis for other\nnarratives.\nThink about how objects are used to depict identity. Are some more evocative than other? Is\nit a matter of their shape, their function, their history?\nA textual portrait is free to focus on any aspect of the person: their appearance, their\npersonality, their past. How are these aspects related? Are some easier to convey to others?\n\nResponse:\n\n\"9-11\"\nChomsky, Noam\n\nA Void\nPerec, Georges\n\nAcid Dreams\nLee, Martin\n\nAdaptation to Life\nVaillant, George\n\nAffective Computing\nPicard, Roz\n\nAin't i A Woman: black women and feminism\nhooks, bell\n\nAlcoholics Anonymous\nAA World Services\n\nAll About Me\nKeel, Philipp\n\nAll Families are Psychotic\nCoupland, Douglas\n\nAll That is Solid Melts Into Air: The Experience of Modernity\nBerman, Marshall\n\nAlready Dead\nJohnson, Denis\n\nAmerican Disease: Origins of Narcotic Control\nMusto, David\n\nAndersen's Fairy Tales\nHowell, Troy\n\nAni Difranco: Righteous Babe\nQuirino, Raffaele\n\nAnimal Dreams\nKingsolver, Barbara\nAnimal Dreams\nKingsolver, Barbara\nAnnie Oakley's Girl\nBrown, Rebecca\n\nAnnotated Alice\nCarroll, Lewis\n\nAnthem\nRand, Ayn\n\nAppropriating Gender: Women's Activism and Politicized Religion in South Asia Jeffery, Patricia\n\nArchaic Revival, The\nMcKenna, Terence\n\nAriel\nPlath, Sylvia\n\nArt and Science of C\nRoberts, Eric\n\nArt Lover, The\nMaso, Carole\n\nAs i Lay Dying\nFaulkner, William\n\nAsa, As i Knew Him\nKaysen, Susanna\n\nAsylum\nMcGrath, Patrick\n\nAsylums: Essays on the social situation of mental patients and other inmates Goffman, Erving\n\nAtlas Shrugged\nRand, Ayn\n\nAureole\nMaso, Carole\n\nBack to Barbary Lane\nMaupin, Armistead\n\nBarrel Fever\nSedaris, David\n\nBartlett's Familiar Quotations\nBartlett, John\n\nBastard out of Carolina\nAllison, Dorothy\n\nBean Trees\nKingsolver, Barbara\nBeat Writers at Work\nMoody, Rick\n\nbeing digital\nNegroponte, Nicholas\n\nBell Curve\nHerstein & Murray\n\nBell Jar, The\nPlath, Sylvia\n\nBeloved\nMorrison, Toni\n\nBest Lesbian Erotica 1999\nTaormino, Tristan\n\nBeyond Good and Evil\nNietzsche, Frederick\nBeyond Majority Rule\nSheeran, Michael\n\nBeyond the Third Dimension\nBanchoff, Thomas\n\nBhagavadgita\nArnold, Sir Edward\n(translator)\n\nBig Sky Mind: Buddhism and the Beat Generation\nTonkinson, Carole\n\nBillboard: Art on the Road\nHeon, Laura\n\nBirth of the Clinic\nFoucault, Michel\n\nBitch: In Praise of Difficult Women\nWurtzel, Elizabeth\n\nBlack, White and Jewish\nWalker, Rebecca\n\nBleeding London\nNicholson, Geoff\n\nBlue Place\nGriffith, Nicola\n\nBluest Eyes\nMorrison, Toni\n\nBodies that Matter\nButler, Judith\n\nBonfire of the Vanities\nWolfe, Tom\n\nBook of Laughter and Forgetting, The\nKundera, Milan\n\nBook of Massage, The\nLidell, Lucinda\n\nboris op de berg\nBruna, Dick\n\nBowling Alone\nPutnam, Robert\n\nBoys Like Her\nTaste This\n\nBrain Sex: The Real Differences Between Men & Women\nMoir, Anne\n\nBreakfast of Champions\nVonnegut, Kurt\n\nBreaking Open the Head\nPinchbeck, Daniel\n\nBridget Jones's Diary\nFielding, Helen\n\nBrown University Picture Book\nBrown University\n\nBuddha's Little Instruction Book\nKornfield, Jack\n\nBuddhist Bible, A\nGoddard, Dwight\n\nC++ Programming Language\nStroustroup\n\nCan't Buy My Love\nKilbourne, Jean\n\nCatch-22\nHeller, Joseph\n\nCatcher in the Rye\nSalinger, J.D.\n\nCat's Cradle\nVonnegut, Kurt\n\nCavedweller\nAllison, Dorothy\n\nCelestine Prophecy, The\nRedfield, James and Carol Adrienne\n\nCelestine Prophecy, The: An Experimential Guide\nRedfield, James and Carol Adrienne\n\nCentury of Lesbian Erotica, A\nVarious Authors\n\nCentury of Women, A\nCovey, Alan\n\nChange Your Brain; Change Your Life\nAmen, Daniel\n\nChaos\nGleick, James\n\nChild's Life, A\nGloeckner, Phoebe\n\nChoke\nPalahniuk, Chuck\n\nChosen, The\nPotok, Chaim\n\nCities of the Red Night\nBurroughs, William\nCity of Bits\nMitchell, William\n\nClitNotes\nHughes, Holly\n\nClockwork Orange, A\nBurgess, Anthony\n\nCMS.920: Popular Narratives\nJenkins, Henry\n\nCode and Other Laws of Cyberspace\nLessig, Lawrence\n\nCollected Poems 1947-1980\nGinsberg, Allen\n\nCollected Poems of Audre Lorde\nLorde, Audre\n\nCollective Intelligence\nLevy, Pierre\n\nColor Purple, The\nWalker, Alice\n\nCommunities in Cyberspace\nSmith, Marc\n\nCompass of Zen\nSahn, Zen Master Seung\n\nComplete Guide to Massage, The\nMumford, Susan\n\nComplexity: The Emerging Science at the Edge of Order and Chaos\nWaldrop, M. Mitchell\nComposing Cyberspace\nHoleton, Richard\n\nCompuer Power and Human Reason\nWeizenbaum\n\nComputer Graphics\nFoley, van Dam, Fiener,\nHughes\n\nComputer Lib: Dream Machines\nNelson, Ted\n\nComputers, Ethics and Society\nErmann, David\n\nConceptualizing Global History\nMazlish, Bruce & Buultjens, Ralph\n\nCondition of Postmodernity, The\nHarvey, David\n\nCongratulations! Now What?\nCosby, Bill\n\nCool for You: a novel\nMyles, Eileen\n\nCosmicomics\nCalvino, Italo\n\nCrash\nBallard, J.G.\n\nCreativity: Flow and the Psychology of Discovery and Invention\nCsikszentmihalyi, Mihaly\n\nCultural Creatives, The\nRay, Paul\nCultural Studies\nGrossberg, Lawrence ...\n\nCunt\nMuscio, Inga\n\nCunt, version 2\nMuscio, Inga\n\nCybersexualities\nWolmark, Jenny\n\nDaedalus: Political Pharmacology: Thinking about Drugs\nJournal of American Academy of Arts &\nSciences\nDali\nAdes, Dawn\n\nDanish Girl, The\nEbershoff, David\n\nDarsan: Seeing the Divine Image in India\nEck, Diana\n\nDatabase Nation: The Death of Privacy in the 21st Century\nGarfinkel, Simson\n\nDays of Grass after the fall of humanity\nLee, Tanith\n\nDealers of Lightning: Xerox Parc and the Dawn of the Computer Age\nHiltzik, Michael\n\nDesign of Everyday Things, The\nNorman, Donald\n\nDesign Patterns\nGamma, Erich\n\nDesolation Angels\nKerouac, Jack\n\nDharma Bums, The\nKerouac, Jack\n\nDiary of a Manhattan Call Girl\nQuan, Tracy\n\nDiary of Anais Nin, The\nNin, Anais\n\nDick for a Day\nGiles, Fiona\n\nDirty Plotte (#s 1-12)\nDoucet, Julie\n\nDiscipline & Punish: The Birth of the Prison\nFoucault, Michel\n\nDivision of Labor in Society, The\nDurkheim, Emile\n\nDoc and Fluff\nCalifia, Pat\n\nDon't Sweat the Small Stuff - and it's all small stuff\nCarlson, Richard\n\nDoonesbury Deluxe\nTrudeau, GB\n\nDoors of Perception: Heaven and Hell\nHuxley, Aldous\n\nDoors, The\nRuhlmann, William\n\nDouble Game\nCalle, Sophie\n\nDouble Helix, The\nWatson, James\n\nDragon Ladies: Asian American Feminists Breathe Fire\nShah, Sonia\n\nDrawing on the Right Side of the Brain\nEdwards, Betty\n\nDriven to Distraction: Recognizing and Coping with Attention Deficit Disorder\nfrom Childho\nHallowell, Edward ...\nDubliners\nJoyce, James\n\nDutch-English English-Dutch Dictionary\nHippocrene Concise\nDictionary\n\nDykes to Watch Out For: Confessions, Comix and Miscellaneous\nBechdel, Alison\n\nEarly Modernism: Literature, Music and Painting in Europe 1900-1916\nButler, Christopher\nEat Me\nJaivin, Linda\n\nEcrits: A Selection\nLacan, Jacques\n\nEcstasy\nWelch, Irvine\n\nEdible Woman, The\nAtwood, Margaret\n\nEinstein's Dreams\nLightman, Alan\n\nElectric Kool-Aid Acid Test\nWolfe, Tom\n\nElements of Style\nStrunk, William Jr. and E.B. White\n\nElla Minnow Pea\nDunn, Mark\n\nEllen Foster\nGibbons, Kaye\n\nEmergences of Language: Development and Evolution\nWang, William\n\nEmpire\nHardt, Michael and Antonio Negri\n\nEmpire Falls\nRusso, Richard\n\nEnvisioning Information\nTufte, Edward\n\nErewhon\nButler, Samuel\n\nEscape Velocity\nDery, Mark\n\nEssential McLuhan\nMcLuhan, Eric\n\nEthnography of Communication\nSaville-Troike,\nMuriel\n\nEven Cowgirls Get the Blues\nRobbins, Tom\n\nEveryday Zen\nBeck, Charlotte\n\nEvolving Self, The\nCsikszentmihalyi, Mihaly\n\nExpensive People\nOates, Joyce Carol\n\nExtrodinary Delusions & the Madness of Crowds\nMacKay, Charles\n\nEye Scream\nRollins, Henry\n\nFabric of Reality, The\nDeutsch, David\n\nFaithless\nOates, Joyce Carol\n\nFarewell to Arms, A\nHemingway, Ernest\nFashion System, The\nBarthes, Roland\n\nFashion, Culture and Identity\nDavis, Fred\n\nFast Food Nation\nSchlosser, Eric\n\nFast Food Nation\nSchlosser, Eric\n\nFeminine Mystique, The\nFriedan, Betty\n\nFeminist Film Theory\nThornham, Sue\n\nFeminist Social Thoughts: A Reader\nMeyers, Diana\n\nFeminist Theory in Practice and Process\nMalson, Micheline\n\nFeminist Theory: from Margin to Center\nhooks, bell\n\nFierce Invalid Home From Hot Climatej\nRobbins, Tom\n\nFifth Sacred Thing, The\nStarhawk\nFive Faces of Modernity: Modernism, Avant-Garde, Decadence, Kitsch,\nPostemodernism\nCalinescu, Matei\n\nFlow\nCsikszentmihalyi, Mihaly\n\nFoucault for Beginners\nFillingham, Lydia\n\nFoucault Reader, The\nRabinow, Paul\n\nFoucault's Pendulum\nEco, Umberto\n\nFountainhead, The\nRand, Ayn\n\nFoxfire\nOates, Joyce Carol\n\nFrankenstein\nShelley, Mary\n\nFranny and Zoey\nSalinger, J.D.\n\nFreaks Talk Back\nGamson, Josh\n\nFrom Barbie to Mortal Kombat\nCassell, Justine\n\nFruits\nAoki,\nShoich\n\nFstr\nGlck, Jms\nFull Frontal Fiction: The Best of Nerve.com\nMurnighan, Jack and Genevieve Field\nFury\nRushdie, Salman\n\nGalapagos\nVonnegut, Kurt\n\nGarden of Eden\nHemingway, Ernest\nGate to Women's Country\nTepper, Sheri\n\nGeek Love\nDunn, Katherine\n\nGeeks\nKatz, Jon\n\nGender and Consumer Culture Reader, The\nScanlon, Jennifer\n\nGender and Psychology Reader\nClinchy, Blythe McVicker\n\nGender Differences in Human Cognition\nCaplan, Paula\n\nGender Shocks: Exploding the Myths of Male & Female\nBurke, Phyllis\n\nGender Trouble\nButler, Judith\n\nGender: An Ethnomethodological Approach\nKessler, Suzanne and McKenna,\nWendy\n\nGendered Cyborg: A Reader\nKirkup, Bill\n\nGeneration X\nCoupland, Douglas\n\nGenX Reader\nRushkoff, Douglas\n\nGhost World\nClowes, Daniel\n\nGirl, Interupted\nKaysen, Susanna\n\nGlamorama\nEllis, Bret Easton\n\nGo Ask Alice\nAnonymous\n\nGodel, Escher, Bach\nHofstadter, Douglas\nGolden Notebook, The\nLessing, Doris\n\nGreat Gatsby, The\nFitzgerald, F. Scott\nGun, with Occasional Music\nLetham, Jonathan\n\nGuns, Germs and Steel\nDiamond\n\nGutenberg Elegies, The: The Fate of Reading in an Electronic Age\nBirkerts, Sven\n\nHacker Ethic, The\nHimanen, Pekka\n\nHandmaid's Tale\nAtwood, Margaret\n\nHarry Potter and the Sorcerer's Stone\nRowling, J.K.\n\nHe, She and It\nPeircy, Marcy\n\nHeartbreaking Work of Staggering Genius\nEggers, David\n\nHerculine Barbin\nFoucault, Michel\n\nHerland\nGilman, Charlotte Perkins\n\nhet spook nijntje\nBruna, Dick\n\nHigher Superstition: The Academic Left and its Quarrels with Science\nGross, Paul\n\nHindu Religious Tradition\nHopkins, Thomas\n\nHistory of Private Life, A: Revelations of the Medieval World\nDuby, Georges\n\nHistory of Sexuality: An Introduction\nFoucault, Michel\n\nHitchiker's Guide to the Galaxy\nAdams, Douglas\n\nHolidays on Ice\nSedaris, David\n\nHouse of Leaves\nDanelewski, Mark\n\nHow Buildings Learn\nBrand, Stewart\n\nHow the Mind Works\nPinker, Steven\n\nHow we Became Posthuman\nHayles, Katherine\n\nHypertext 2.0\nLandow, George\n\nIlluminatus Trilogy\nShea Robert, Robert Anton Shea\n\nIllusion of Life, The\nThomas, Frank and Ollie Johnson\n\nIllusions\nBach, Richard\n\nIllustrated Encyclopedic Dictionary\nAmerican Heritage\n\nIn Praise of Krishna\nDimock, Edward, et.al.\n\nIndividual in a Social World, The\nMilgram, Stanley\n\nInfinite Jest\nWallace, David Foster\n\nInfluence of Context on Visual Space\nSchoumans, Nicole\nIntepreter of Maladies\nLahiri, Jhumpa\n\nInteraction Ritual\nGoffman, Erving\n\nInterdisciplinary Scientific Visualization #2\nLaidlaw, David\n\nInterface Culture\nJohnson, Steven\n\nInterview with a Vampire\nRice, Anne\n\nIntroduction to Algorithms\nCormen, Thomas\n\nIntroduction to Design and Analysis\nKepper\n\nIntroductory Lectures on Psycho-Analysis\nFreud, Sigmund\n\nInvisible Cities\nCalvino, Italo\n\nInvisible Man\nEllison, Ralph\n\nJohn's Wife\nCoover, Robert\n\nJournals of Sylvia Plath\nHughes, Ted\n\nJoystick Nation\nHerz, J.C.\nJungle, The\nSinclair, Upton\n\nKafka Chronicles, The\nAmerika, Mark\n\nkentucky ham/speed\nBurroughs, William, Jr.\n\nKhaki Shorts Saffron Flags\nBasu, Tapan\n\nLacan and Postfeminism\nWright, Elizabeth\n\nLanguage Instinct, The\nPinker, Steven\n\nLast Night in Paradise: Sex and Morals at the Century's End\nRoiphe, Katie\n\nLast Time i Wore a Dress\nScholinski, Daphne\n\nLeft Hand of Darkness, The\nLe Guin, Ursula\n\nLesbian and Gay Studies Reader\nAbelove, Henry\n\nLess than Zero\nEllis, Bret Easton\n\nLessons from Privilege: The American Prep School Tradition\nPowell, Arthur\n\nLeviathan\nAuster, Paul\n\nLife After God\nCoupland, Douglas\n\nLife on the Screen\nTurkle, Sherry\n\nLinear Algebra\nPenney, Richard\n\nListening to Prozac\nKramer, Peter\n\nLittle Zen Companion\nSchiller, David\n\nLolita\nNabokov, Vladimir\n\nLong Days Journey into Night\nO'Neill, Eugene\n\nLong Quiet Highway\nGoldberg, Natalie\n\nLord of the Rings 1: The Fellowship of the Ring\nTolkien, J.R.R.\n\nLords and the New Creatures\nMorrison, Jim\n\nLovely Bones, The\nSebold, Alice\n\nLucky\nSebold, Alice\n\nMacho Sluts\nCalifia, Pat\n\nMadonna Connection\nSchwichtenberg, Cathy\n\nMaeda @ Media\nMaeda, John\n\nMan and His Symbols\nJung, Carl\nMan of Vrouw; Min of Meer\nDe Jong, Tim\n\nMan Who Ate Everything, The\nSteingarten, Jeffrey\nMan Who Mistook His Wife for a Hat, The\nSacks, Oliver\n\nManufacturing Consent\nHerman, Edward and Noam Chomsky\nMasks of the Illuminati\nWilson, Robert Anton\n\nMasterpieces from the Peggy Guggenheim Collection\nGuggenheim Museum\n\nMcSweeney's (vol. 1-3)\nWallace, David Foster\n\nMeaning of Things: Domestic symbols and the self\nCsikszentmihalyi, Mihaly\n\nMedia Control: The Spectacular Achievements of Propaganda\nChomsky, Noam\n\nmedium is the massage, the\nMcLuhan, Marshall and Quentin Fiore\nMen and Women Learning Together: A Study of College Students in the Late\n70s\nBrown University\n\nMetamorphosis, The Penal Colony and Other Stories\nKafka, Franz\n\nmicroserfs\nCoupland, Douglas\n\nmicroserfs\nCoupland, Douglas\n\nModel Behavior\nMcInerney, Jay\n\nModeling and Simulation\nZyda, Michael\n\nModels of Computation (x2)\nSavage, John\n\nModern Operating Systems\nTenenbaum\n\nModernity and Self-Identity\nGiddens, Anthony\n\nMonkey Wrench Gang, The\nAbbey, Edward\n\nMoral Animal, The\nWright, Robert\n\nMoveable Feast, A\nHemingway, Ernest\nMr. Palomar\nCalvino, Italo\n\nMy Gender Workbook\nBornstein, Kate\n\nMy Legendary Girlfriend\nGayle, Mike\n\nMy Most Secret Desire\nDoucet, Julie\n\nMySQL\nUllman, Larry\n\nMyths of Gender\nFausto-Sterling, Anne\n\nNaked Angels\nTytell, John\n\nNaked Lunch\nBurroughs, William\nName of the Rose, The\nEco, Umberto\n\nNarcolepsy\nUtley, Marguerite Jones\n\nNatural Mind, The\nWeil, Andrew\n\nNature of Mathematical Modeling\nGershenfeld, Neil\n\nNearly Roadkill\nSullivan, Caitlin\n\nNecessary Targets\nEnsler, Eve\n\nNederlands voor buitenlanders\nMontens, F.\n\nNerve: Literate Smut\nField, Genevieve\n\nNetherlands in Perspective\nShetter, William\n\nNetworked Virtual Environments\nZyda, Michael\n\nNeuromancer\nGibson, William\n\nNew Improved Dykes to Watch Out For\nBechdel, Alison\n\nNickel and Dimed: On (not) Getting By in America\nEhrenreich, Barbara\nNietzsche Reader\nNietzsche, Frederick\n\nnijntje en nina\nBruna, Dick\n\nNijntje op de fiets\nBruna, Dick\n\nnijntje stickerbook 3\nBruna, Dick\n\nNo One Here Gets Out Alive: autobiography of Jim Morrison\nHopkins, Jerry and Danny Sugarman\nNotes from an Incomplete Revolution\nMaran, Meredith\n\nNotes from Underground\nDostoevsky, Fyodor\nNou Nou\nRuthe, Ralph\n\nNovel with Cocaine\nAgeyev, M\n\nNow We are Six\nMilne, A.A.\n\nNumber Our Days\nMyerhoff, Barbara\n\nOf Two Minds: Hypertext Pedagogy and Poetics\nJoyce, Michael\n\nOn Deconstruction: Theory and Criticism after Structuralism\nCuller, Jonathan\n\nOn Individuality and Social Forms\nSimmel, Georg\n\nOn the Road\nKerouac, Jack\n\nOne Flew Over the Cookoo's Nest\nKesey, Ken\n\nOne Hundred Years of Solitude\nMarquez, Gabriel Garcia\n\nOnion's Finest News Reporting\nOnion, The\n\nOrlando\nWoolf, Virginia\n\nOrlando\nWoolf, Virginia\n\nOtherland\nWilliams, Tad\n\nOur Bodies Ourselves, The New Updated Version\nBoston Women's Health Book\nCollective\n\nOur Dumb Century\nOnion, The\n\nOur Town\nWilder, Thornton\n\nOutlaw Culture: Resisting Representations\nhooks, bell\n\nParadise\nMorrison, Toni\n\nPassing\nLarsen, Nella\n\nPassion, The\nWinterson, Janette\nPath with Heart, A\nKornfield, Jack\n\nPathfinder, The\nLore, Nicholas\n\nPeople's History of the United States\nZinn, Howard\n\nPerception\nSekuler, Robert\n\nPersistence of Vision\nVarley, John\n\nPersonal Fincance for Dummies\nTyson, Eric\n\nPhilosophy in the Boudoir\nde Sade, the Marquis\n\nPHP: Advanced for the World Wide Web\nUllman, Larry\n\nPicture of Dorian Gray\nWilde, Oscar\n\npiecework - women's lives at Brown\nGarrett, Kate & Jane Hitti\n\nPlayer Piano\nVonnegut, Kurt\n\nPleasure of the Text\nBarthes, Roland\n\nPomes All Sizes\nKerouac, Jack\n\nPomosexuals: Challenging Assumptions about Gender and Sexuality\nQueen, Carol\n\nPooh and the Philosophers\nWilliams, John\n\nPornocopia: Porn, Sex, Technology & Desire\nO'Toole, Laurence\n\nPortable Beat Reader\nCharters, Ann\n\nPortnoy's Complaint\nRoth, Philip\n\nPortrait of the Artist as a Young Man\nJoyce, James\n\nPostmodernism for Beginners\nPowell, Jim\n\nPower & Sex\nElworthy, Scilla\n\nPower of Identity, The\nCastells, Manuel\n\nPowerbook, The\nWinterson, Janette\nPractices of Looking: An Introduction to Visual Culture\nSturken, Marita and Lisa Cartwright\n\nPrejudice and Racism\nJones, James\n\nPresentation of Self in Everyday Life\nGoffman, Erving\n\nPreventing Violence\nGilligan, James\n\nPrinicples of Statistics\nBulmer\n\nProcessed Lives\nTerry, Jennifer\n\nProduction of Reality\nO'Brien, Jodi\n\nProgramming and Customizing the Basic Stamp Computer\nEdwards, Scott\n\nProgramming Perl\nO'Reilly\n\nPromiscuities: The Secret Struggle for Womanhood\nWolf, Naomi\n\nProvoking Agents: Gender and Agency in Theory and Practice\nGardiner, Judith Kegan\n\nPsychedelic Experience, The: A Manual Based on the Tibetan Book of the Dead Leary, Timothy\n\nPsychedelics Encyclopedia\nStafford, Peter\n\nPsychology\nRathus, Spencer\n\nPsychology and the internet\nGackenbach, Jayne\n\nPublic Sex: The Culture of Radical Sex\nCalifia, Pat\n\nPure Heart, Enlightened Mind\nO'Halloran, Maura\n\nPY185: Motion Perception\nWelch, Leslie\n\nQueen of the Damned, The\nRice, Anne\n\nQueer Science\nLeVay, Simon\n\nRace, Class and Gender in a Diverse Society\nKendall, Diana\n\nRalp Nader Reader, The\nNader, Ralph\n\nRamayana, The\nNarayan, R.K.\n\nRamona\nJackson, Helen Hunt\nRansom\nMcInerney, Jay\n\nRe/Search #13: Angry Women\nJuno, Andrea\n\nRead My Lips: Sexual Subvesion and the End of Gender\nWilchins, Riki Anne\nReflections on Gender and Science\nFox Keller, Evelyn\n\nReligions of the World\nHoppe, Lewis\n\nRemaking Women: Feminism and Modernity in the Middle East\nAbu-Lughod, Lila\n\nRemembering\nBartlett, F.C.\n\nRepublic, The\nPlato\n\nReviving Ophelia: Saving the Selves of Adolescent Girls\nPipher, Mary\n\nRight to an Answer, The\nBurgess, Anthony\n\nRites of Spring: The Great War and the Birth of the Modern Age\nEksteins, Modris\n\nRobber Bride, The\nAtwood, Margaret\n\nRobots, Androids and Animatrons\nIovine, John\n\nRubyfruit Jungle\nBrown, Rita Mae\n\nSandman: the Doll's House\nGaiman, Neil\n\nSatanic Verses\nRushdie, Salman\n\nSaturated Self, The\nGergen, Kenneth\n\nScanner Darkly, A\nDick, Philip K.\n\nSchool Girls: Young Women, Self-Esteem and the Confidence Gap\nOrenstein, Peggy\n\nSCUM Manifesto\nSolanas, Valerie\n\nSecond Self: Computers and the Human Spirit\nTurkle, Sherry\n\nSecond Sex\nDe Beauvoir,\nSimone\n\nSecret Language of Birthdays\nGoldschneider, Gary\n\nSecrets of Shamanism: Tapping the Spirit Power Within You\nStevens, Jose & Lena Stevens\nSelected Poems\nSmith, Stevie\n\nSelection of Poems, A\ncummings, e.e.\n\nSellevision\nBurroughs,\nAugusten\n\nSelling Out\nChasin, Alexandra\n\nSex\nMadonna\n\nSex Changes: The Politics of Transgenderism\nCalifia, Pat\n\nSex on the Brain\nBlum, Deborah\n\nSex, Art & American Culture\nPaglia, Camille\n\nSexing the Body\nFausto-Sterling, Anne\n\nSexual Nature Sexual Culture\nAbramson, Paul\n\nSexual Personae: Art and Decadence from Nefertiti to Emily Dickinson\nPaglia, Camille\n\nSexy Dressing Etc.: Essays on the Power and Politics of Cultural Identity\nKennedy, Duncan\n\nShadow Man\nScott, Melissa\n\nShambhala Dictionary of Buddhism and Zen\nKohn, Michael\n\nShe's Come Undone\nLamb, Wally\n\nShort History of the Netherlands\nRietbergen, Pjan\n\nShy Girl\nStark, Elizabeth\n\nSiddhartha\nHesse, Herman\n\nSimple & Direct: A Rhetoric for Writers\nBarzun, Jacques\n\nSix Memos for the Next Millennium\nCalvino, Italo\n\nSkin: Talking about Sex, Class and Literature\nAllison, Dorothy\n\nSmart Mobs\nRheingold, Howard\nSnow Crash\nStephenson, Neal\n\nSo Long a Letter\nBa, Mariama\n\nSocial Animal, The\nAronson, Elliot\n\nSocial Life of Information\nBrown, John Seely\n\nSocial Network Analysis\nWasserman, Stanley and Faust,\nKatherine\n\nSocial Psychology of Gender\nBurn, Shawn\n\nSociety of Mind\nMinsky, Marvin\n\nsome of the dharma\nKerouac, Jack\n\nSongs of the Saints of India\nHawley, John, et.al.\nSound and the Fury\nFaulkner, William\n\nSpiral Dance, The\nStarhawk\nStars in my Pocket Like Grains of Sand\nDelany, Samuel\n\nStatistical Language Learning\nCharniak, Eugene\n\nStone Butch Blues\nFeinberg, Leslie\n\nStone Butch Blues #17\nFeinberg, Leslie\n\nStory of Junk, The\nYablonsky, Linda\n\nStory of my Life\nMcInerney, Jay\n\nStrange Sisters: The Art of Lesbian Pulp Fiction 1949-1969\nZimet, Jaye\n\nStreetcar Named Desire, A\nWilliams, Tennessee\nSubcultures Reader, The\nGelder, Ken and Thornton, Sarah\n\nSubterraneans, The\nKerouac, Jack\n\nSucculent Wild Woman: Dancing with your Wonder-full Self\nSark\n\nSun Also Rises, The\nHemingway, Ernest\nSuspicious River\nKasischke, Laura\n\nT Zero\nCalvino, Italo\n\nTales of Ordinary Madness\nBukowski, Charles\n\nTales of the City\nMaupin, Armistead\n\nTales of the City\nMaupin, Armistead\n\nTank Girl: The Collection\nHewlett & Martin\n\nTank Girl: The Movie\nHewlett & Martin\n\nTao of Physics, The\nCapra, Fritjof\n\nTao of Pooh, The\nHoff, Benjamin\n\nTao te Ching\nMichell, Stephen\n\nTe of Piglet, The\nHoff, Benjamin\n\nTeach Yourself Calculus\nAbbott, P.\nTell Me a Riddle\nOlsen, Tellie\n\nTen Things i Wish i'd known - Before i went out into the real world\nShriver, Maria\n\nTerminal Velocity\nBoyd, Blanche\n\nTheir Eyes were Watching God\nHurston, Zora Heale\nThesaurus\nMerriam-Webster\n\nThese are my Rivers\nFerlinghetti, Lawrence\n\nThings Fall Apart\nAchebe, Chinua\n\nThinking of You\nKruger, Barbara\n\nThird Wave Agenda\nHeywood & Drake\n\nThird World Women and the Politics of Feminism\nMohanty, Chandra\n\nThis Side of Paradise\nFitzgerald, F. Scott\nThree Plays\nWilder, Thornton\n\nTipping Point\nGladwell, Malcolm\n\nTipping the Velvet\nWaters, Sarah\n\nTo Dwell Among Friends: Personal Networks in Town and City\nFischer, Claude\n\nTongue First\nJenkins, Emily\n\nTowards a Recognition of Androgyny\nHeilbrun, Carolyn\n\nTransformation of Rural Life\nAdams, Jane\n\nTransformation2: Marxism, Queer Theory, Gender\nMorton, Donald ...\n\nTransgender Care\nIsrael, Gianna\n\nTransgender Warriors\nFeinberg, Leslie\n\nTransparent Society, The\nBrin, David\n\nTravels in Hyperreality\nEco, Umberto\n\nTrial, The\nKafka, Franz\n\nTurning Point, The\nCapra, Fritjof\n\nTwo Headed Poems\nAtwood, Margaret\n\nType in Motion\nBellantoni, Jeff\n\nTypical Girls: New Stories by Smart Women\nCorrigan, Susan\n\nUC116: Drug and Alcohol Addiction\nLewis, David\n\nUlysses\nJoyce, James\n\nUnbearable Lightness of Being\nKundera, Milan\n\nUnderstanding Comics\nMcCloud, Scott\n\nUnderstanding Development\nScarr, Sandra\n\nUnderstanding Power\nChomsky, Noam\n\nUnwanted Gaze, The\nRosen, Jeffrey\n\nUppity Women of Shakespearean Times\nLeon, Vicki\n\nUrban Life: anthropology of the city\nGmelch, George and Walter Zennem\nVagina Monologues\nEnsler, Eve\n\nVagina Monologues, The (original)\nEnsler, Eve\n\nVagina Monologues, The (original)\nEnsler, Eve\n\nVagina Monologues, The (original)\nEnsler, Eve\n\nVagina Monologues, The (V-Day)\nEnsler, Eve\n\nVagina Monologues, The (V-Day)\nEnsler, Eve\n\nValencia\nTea, Michele\n\nVampire Lestat, The\nRice, Anne\n\nVegetarian Times Cookbook\nMacmillan\nVirgin Suicides, The\nEugenides, Jeffrey\n\nVirtual Community, The\nRheingold, Howard\nVirtual Community, The\nRheingold, Howard\nVirtuous Reality\nKatz, Jon\n\nVisions of Cody\nKerouac, Jack\n\nVisual Display of Quantitative Information\nTufte, Edward\n\nVisual Explanations\nTufte, Edward\n\nVisual Intelligence\nHoffman, Donald\n\nVisual Space Perception\nHershenson,\nMaurice\n\nWaiting for Godot\nBeckett, Samuel\n\nWalden Two\nSkinner, B.F.\n\nWalk Across America, A\nJenkins, Peter\n\nWar and Peace in the Global Village\nMcLuhan, Marshall and Quentin Fiore\nWar of Desire and Technology\nStone, Sandy\n\nWas\nRyman, Geof\n\nWater Witches\nBohjalian, Chris\n\nWay of the Shaman, The\nHarner, Michael\n\nWay of Zen\nWatts, Alan\n\nWeb Database Applications with PHP & MySQL\nO'Reilly\n\nWelcome to the Monkeyhouse\nVonnegut, Kurt\n\nWell of Loneliness\nHall, Radclyffe\n\nWhat the Buddha Taught\nRahula, Walpola\n\nWhen Things Fall Apart\nChodron, Pema\n\nWhere the Girls Are: Growing Up Female with the Mass Media\nDouglas, Susan\n\nWicked\nMaguire, Gregory\n\nWinesburg, Ohio\nAnderson, Sherwood\nWinnie-the-Pooh\nMilne, A.A.\n\nwired_women\nCherny, Lynn\n\nWitch's Brew Good Spells for Peace of Mind\nWitch Bree\n\nWoman in the Body: A Cultural Analysis of Reproduction\nMartin, Emily\n\nwoman's notebook, a\nRunning Press\n\nWomen\nBurkowski, Charles\nWomen\nLeibovitz, Annie & Sontag, Susan\n\nWomen Race & Class\nDavis, Angela Y.\n\nWonder that was India, The\nBasham, A.L.\n\nWorld and Other Places\nWinterson, Janette\nWorld Lit Only by Fire, A\nMachester, William\nWrinkle in Time\nL'Engle, Madeleine\n\nWriting Ethnographic Fieldnotes\nEmerson, Robert\n\nWritten on the Body\nWinterson, Janette\nYou are Being Lied To\nKick, Russ\n\nZen and the Art of Motorcycle Maintenance\nPirsig, Robert\n\nZen at Work\nKaye, Les\nZen Mind, Beginner's Mind\nSuzuki, Shunryu\n\nZinn Reader, The\nZinn, Howard\n\nCollections upon collections. Whenever i walk into someone's home, one of the first things\ni'm bound to do is seek out their book collection. What can i learn about them from what\nthey read (or don't read)? What do the books look like - have they been moved lately? What\ntype of order are they in? How read are they? We have so many notions behind books, an\nunderstanding of what they stand for, of what they are about, about who reads them and\nwhy.\nAbove is about 2/3 of my book collection. These are the books that sit in my room in Boston;\nthey are the first thing you see when you walk in the door. On your right are the non-fiction\nbooks; on your left, the fiction. Unlike this list, they are clustered based on similarity in my\nmind, an ecclec tic ordering that i know by heart but everyone else is bound to mess up. On\n\ntop of the rows of books are new books that haven't yet found their home amongst the older\nbooks. At the bottom shelf of each are the books that i am currently reading, either for class\nor for pleasure. Yes, there are always at least 10 fiction books started at once. My books\nhave character; that is half of my pleasure in them. Most of them were purchased used and\nhave acquired even more wear & tear since then. There are a handful of books that i've gone\nout of my way to collect, spending obscene amounts of money on them. They are on top of\nthe shelves, far away from the random items that get added to the shelves. There is a notice\nabout my books that often adorns the bookshelves. Anyone may borrow any unsigned\nbooks; the signed books are not to leave the room. The shelves of my books also host the\ndisarray of my life. The beat-generation fiction row hosts all of my daily medications and\nvitamins, to be taken on the way out the door. On the shelf below, there are all of the\npocket items that get rotated between pockets each day. There are candles, half-eaten\ncandies and drinks, fliers for events that i've promoted, bills that need to be managed, ticket\nstubs, random notes to self, cat treats, etc. Inside each book there are also plenty of treats -\npieces of paper that got added during the process of reading each book, filled with historical\nmarkers of places i've been and people i've talked with.\nMy books have character. They host so much meaning in the perusal, in the markings, in the\nfood stains and the water marks, in the bits of paper stuffed in them. Together, as a\ncollection, they tell a story about their owner."
    }
  ]
}