{
  "course_name": "Technology in History",
  "course_description": "Today many people assume that technological change is the major factor in historical change and that it tends to lead to historical progress. This class turns these assumptions into a question—what is the role of technology in history?—by focusing on four key historical transitions: the human revolution (the emergence of humans as a history-making species), the Neolithic Revolution (the emergence of agriculture-based civilizations); the great leap in productivity (also known as the industrial revolution), and the great acceleration that has come with the rise of human empire on the planet. These topics are studied through a mix of textbook reading (David Christian’s “Maps of Time”), supplementary readings (ranging from Auel, “The Clan of the Cave Bear” to Hersey, “Hiroshima”), illustrated lectures, class discussions, guest lectures/discussions, short “problem paper” assignments, and a final project defined by the student.\nBecause MIT is celebrating its 150th anniversary in 2011, this version of the class will also focus on connections between MIT as an institution and technology in the history of the last 150 years.",
  "topics": [
    "Humanities",
    "History",
    "History of Science and Technology",
    "Humanities",
    "History",
    "History of Science and Technology"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nSummary\n\nIn this class we ask two big questions. First, what is \"technology\"? Second, how has the set of activities to which we commonly give this label shaped human relations among ourselves and with the rest of the natural world?\n\nWe focus on four fundamental transformations in these relations: the emergence of humankind as a history-making species; of agriculture-based civilizations; of productive systems based on fossil fuels; and of \"human empire\" dominated by human presence and power.\n\nIn each unit we will study, among other things, technologies as media of expression and communication; connections among technological, political, and military power; the concept of \"technological revolutions\"; and the role of imagination, beliefs, and values both in inspiring and in being shaped by technological creativity.\n\nBecause MIT is celebrating its 150\nth\nanniversary in 2011, we will focus on connections between MIT as an institution and technology in the history of the last 150 years.\n\nRequirements and Grading\n\nACTIVITIES\n\nPERCENTAGES\n\nCheck-off writing assignments (one-page, not graded)\n\n15%\n\nOral presentations and discussions\n\n15%\n\nQuizzes\n\n20%\n\n4 papers (one paper must be revised, others may be; 4-5 pp. each, to total 20 pages including a longer revised paper)\n\n40%\n\nRevised paper\n\n10%\n\nThis course is a\nCommunications Intensive HASS\n(CI-H) subject. Students are required to have two meetings with the class Writing Advisor.\n\nRequired Books\n\nChristian, David.\nMaps of Time: An Introduction to Big History\n. University of California Press, 2004. ISBN: 9780520244764. [Preview with\nGoogle Books\n]\n\nHersey, John.\nHiroshima\n. Vintage, 1989 [originally published in\nThe New Yorker\n, 1946]. ISBN: 9780679721031.\n\nAdditional readings will be assigned from other sources.\n\nCalendar\n\nLEC #\n\nTOPICS\n\nIN-CLASS ACTIVITIES & KEY DATES\n\nUnit 1: Humankind as a History-making Species\n\nIntroduction to class and key concepts\n\nIn class exercise: Maps of time\n\nWhat is\ntechnology\n? What is\nhistory\n(and\nprehistory\n)? (Visitor: Prof. Leo Marx)\n\nWriting (check-off): Question for Professor Marx\n\nTechnology in prehistory: cave art\n\nDiscuss paper 1 assignment\n\nTechnology in \"prehistory\"\n\nWriting (check-off): Where is \"technology\" in\nThe Clan of the Cave Bear\n?\n\nGroup discussions and presentations on reading\n\nHistorical Analogies\n\nPaper 1 due\n\nUnit 2: Civilizations Based on Agriculture\n\nThe Neolithic Revolution\n\nIntroduction to MIT's 150\nth\nanniversary: class visit to MIT archives\n\nWriting (check-off): Questions for Archivists\n\nDiscuss visit to Archives\n\nFirst mandatory meeting with writing advisor by this date\n\nCivilizations and Empires (part two)\n\nDiscuss paper 2 assignment\n\nTechnohistorical Revolutions (part one)\n\nTechnohistorical Revolutions (part two)\n\nPaper 2 due\n\nAgrarian Civilizations (part one): megalithic agrarian civilizations\n\nQuiz on reading and lectures/discussions to date\n\nAgrarian Civilizations (part two): the Roman Empire as an agrarian civilization\n\nUnit 3: Civilizations Based on Fossil Fuels\n\nThe Industrial Revolution\n\nVisit to MIT Museum\n\nWriting (check-off): Questions about your MIT topic for museum hosts\n\nThe Second Industrial Revolution (part one)\n\nPaper 3 due\n\nOral reports on paper 3 topics\n\nThe Second Industrial Revolution (part two)\n\nOral report on paper 3 topics (continued)\n\nUnit 4: Human Empire\n\nThe Second Industrial Revolution (part three)\n\nDiscuss Marx-Engels & Schivelbusch reading\n\nThe Second Industrial Revolution (part four)\n\nGroup discussions and presentations: Comments on Marx-Engels & Schivelbusch reading\n\nFrom Industry to Battlefield\n\nChemical Engineering at MIT\n\nFinish group and individual oral reports\n\nGround Zero (part one)\n\nDiscussion of Hersey,\nHiroshima\n, and \"Ground Zero\" from\nVisualizing Cultures\n\nSecond mandatory meeting with writing advisor by this date\n\nGround Zero (part two)\n\nFourth paper due\n: comments on Hersey,\nHiroshima\n(default mode); other topics acceptable with permission\n\nReview for quiz\n\nLooking Back and Beyond: General review of MIT 150\n\nQuiz\n\nLooking Back and Beyond: Presentations and discussion on \"what is the role of technology in history?\"\n\nLooking Back and Beyond: Presentations and discussion on \"what is the role of technology in history?\"\n\nRevised paper due: Student choice as to which one",
  "files": [
    {
      "category": "Lecture Notes",
      "title": "MITSTS_007F10_lec02_notes.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-007-technology-in-history-fall-2010/a000b7e427916c59270060238a97c8c0_MITSTS_007F10_lec02_notes.pdf",
      "content": "STS 007 Discovery of Prehistory\nThe history of prehistory: or, historical and scientific studies\nHow much development of modern science and modern historical studies are intertwined\nNB: Assign Steven Mithen, \"Freedom Through Cooking,\" NYRB , Oct. 22 2009, 44‐46.\nAlso assign \"Fire as an Engineering Tool of Early Modern Humans\"\nAnd how much this affects what we know and how we think about \"technology in history\"\nConvergence of \"natural history\" and \"natural philosophy\"\nYou can see this today in your examples\nAlso in two optional readings on site for today - role of optional readings: giving you ideas for a project\nPart of a very exciting convergence - limits to written documents - other types of documents: in the\nland and in biology, also in linguistics - from written to other material record - \"deep background\nconditions\" (Bernard Bailyn) ‐ need to \"cable together\" different types of evidence (see Lewis‐Williams\nreading for next week)\nArchaeology, ethology, genetics, paleontology, anthropology, linguistics\ne.g. Jane Goodall going to Kenya July 14, 1961, to work where Leakey had been digging - to live with\nchimpanzees, became another thread in the skein (not skeletons but behavior: ethology)\nShe actually took the time to study how chimpanzees live - they make tools, hunt animals, eat meat,\nand brutally kill members of their own species\nBut you need to contextualize it - put it with other evidence - genetics, linguistics, archaeology,\ngeology, conventional documents as available, imagination most of all\n\nAlso: A long trend in historical studies to giving voice to the voiceless (women, children, workers...)\nUncovering \"people without history\"\n\"dark ages\" as e.g.\n\nGlobe article: other examples: environmental history, neurological history, also ocean history (our own\nDavid Mindell) -\n\nDeep background conditions: most salient one of all is length of time involved in human history\nThe discovery of deep space, \"From the closed world to the infinite universe\"\nEsp. with galaxies (Kant, Wm Herschel) - even by late l800s not entirely clear but possibility was\nrecognized\nAlso deep time, a new world of the past, previously unsuspected, puts whole new lights on \"technology\nin history\"\nThe discovery of deep time is especially connected with the earth sciences/ geology\n\nCommon Western textual record:\nOld Testament Biblical framework in Near East - pharaohs, Sumer, Babylon, Egypt)\nNew Testament ancient civilizations (Rome, Greece)\nThis is the record that Europeans saw: Bishop Ussher, 1654, 4004 BC as time of creation\n\nUncovering deep time began with cataloging minerals and fossils\nGeorg Bauer/Agricola from central Europe, many mines there (Hungary, Bohemia, Saxony) -\n1494‐1555, De Re Metallica 1556 (translated by Herbert and Lou Clarke Hoover 1912)\nHard to get evidence underground\nSeemed jumbled, disorganized; minerals appeared here and there - order in the heavens but not on\nearth\nBegan mining academies in late 1700s - engineering school - schools of mining (even today: Paris,\nColorado)\nAbraham Gottlob Werner (1750‐1817) - mining family - collected minerals\nNeptunists vs. Vulcanists (Hutton) in 1780s -\nEarth's crust laid down when a primitive ocean subsided\nVs. volcanic action being main driver of change\n\nBut meant a testable hypothesis - strata laid down in orderly series - a universal stratigraphic column\nwas agreed upon by 1800\nHow deep does it go? How does it relate to Biblical time?\nCorrelate geological and fossil record - \"Flesh of paleontology\" added to layers of rock esp. by Georges,\nBaron Cuvier 1769‐1832\nExcavations in Paris basin early 1800s - many quarries there: can still visit \"the catacombs of Paris\"\n(limestone quarry, also site for overflow from cemeteries)\nPredictability of rock strata extended over 100 km\nSpecialist in comparative anatomy - first to reconstruct extinct animals from fragmentary remains -\nhippos, rhinos, cavebears, mastodons, crocodiles, tigers\n\"Le regne animal\" (the animal kingdom) pub. 1817 - epic work - later editions, expanded, hugely\ninfluential - this is from the Paris edition appearing from 1836‐1849 - hand colored (engravings)\nMuch larger and stranger animals too:\nMystery: how are these animals related to existing ones?\nCuvier a \"catastrophist\" - species are fixed, lifeforms succeed each other due to a series of sudden and\noverwhelming geological catastrophes ‐ 27 in all - Noah's flood the last one\nWhy not human fossils? Sinners who perished in the Flood? Would lie at the bottom of the deepest\nocean, he believed - human fossils did not exist\n\"wrong\" but like earlier argument (Neptune/Pluto) led to more research and agreement on basic point:\nmighty natural events in the past have laid down a geological record that is also a chronological record\nof earth's past\nAlso, beginning to be clear that the scale of geologic time had to be long enough for seas to become\nland and vice versa\nRace to fill in the stratigraphic column -\n\nCharles Lyell, Principles of Geology 1830‐33, first edition - stratigraphic table open at the bottom - great\ndefender of \"uniformitarianism\" as opposed to a series of catastrophes\n(Darwin took it along on the voyage of the Beagle)\nFrontispiece to the book speaks of not‐so‐deep time (columns from classical antiquity)\n\nDifferent classes of rock, many processes that over a long time results in what we see\nWilliam Buckland 1784‐1856 - chair in mineralogy at Oxford - pioneer in cave research\nAlso believed in floods, but not so catastrophic\n\nDid not believe fossil human would be found - nor did Lyell - assumed humans were \"non‐fossilized\napex of creation\"\nLong known that caves in Europe sheltered bones of species that no longer existed or no longer lived in\nthe area ‐ wouldn't animals trying to escape the flood take refuge there? Bones would be preserved\nesp. in limestone caves where water dripping from the roof would cover the bones with a protective\ncoating of stalagmite\nStarted exploring caves in Germany in 1816, also worked in UK - very careful work\nReliquiae Diluvianae (relics of the flood) - 1823 \"Observations on the Organic remains contained in\ncaves, fissures, and diluvial gravel, and on other geological phenomena attesting the action of a\nuniversal deluge\"\nBut no human fossils - he was eager to find this as evidence of the Mosaic Deluge\nGoat Hole Cave, in south Wales - human‐like skeleton found there - sketch from RD - Buckland wrote in\nRD that it was relatively recent, maybe Roman times\nNext year a Roman Catholic chaplain working at Oxford, interested in excavations, flint and bone tools\nfound next to bones of extinct animals (mammoth, cave bear) in Kent's Cavern, Devon - sealed beneath\nlimestone - Buckland insisted that \"ancient Britons\" had lived in upper levels of cave, scooped out\n\"ovens\" in the stalagmite, their tools had fallen down the holes\nSimilar reactions to caves along the Meuse/Maas, where implements (ivory, flint, bone) and a human\nskull found along with bones of extinct animals\nWanted to find human remains, but these were mixed with fantastic animals, unmentioned in\nscriptures, bizarre forms of life - never let go of belief that humankind was not changing, would be no\nfossils found - humans relatively new\nTime of great uncertainty - good reason to be skeptical in reading too much into scattered remains\nMany other excavations going on, in UK and Europe, including more findings of intact bone caves, with\nflint knives below a bed of stalagmite in which the bones of mammoths and cave bears were found\n\nNeandertal remains 1820s (baffling), 1848, also 1856 ( skulls uncovered in earlier decades, 1820s and\n1840s, simply called \"ancient humans\") the 1856 skeleton was more complete - puzzling: remains\nscattered by workmen in the quarry, no animal remains found with it, age unknown\nStrange shape of the skull: low narrow forehead, large ridges over the eyes, thick cranial bones, knot at\nbottom of skull - suprainiac fossa, a groove above the inion, the place on the bone at the back end of\nthe human skull that juts out the farthest (occipital bun)\nKey event: French researcher Jacques Boucher de Perthes had been collecting items esp. hand axes\nfrom river gravel dredging in northern France, including a stone axe buried in an antler - two\nEnglishmen visited, Joseph Prestwich and John Evans, both amateurs, businessmen, but obsessed with\nmapping surface deposits known as drift - now glacial drift - visited gravel pit near Amiens (Jules Verne\nliving in the neighborhood, very interested in this kind of scientific discovery, J to Center of Earth 1864) -\nBoucher de Perthes was old, didn't have credibility -\nthey were esp. interested in an object that lay 17 feet underground, four and a half feet up from the\nbase of a river terrace cut into a chalk slope - the edge of a worked flint tool - first to be fine in situ, in\ngravel that also had bones of woolly rhinos and mammoths - they asked three local reps of the Society\nof Antiquities of Picardie to witness this -\nphotograph of breaking the time barrier - 27 April 1859\nnot clear who the people are - one pointing to the flint tool\nreturned to UK - planned their scientific attack - spoke first to Royal Society May 26 (Faraday, Babbage,\nHuxley and Lyell in the audience) - then Society of Antiquities of London, then Geological Society\nLyell changed his mind about great human antiquity, visited the Somme - St. Achuel is the site, so\nAcheulean tools\nLyell announced this at a meeting (packed) of the British AAS, with Prince Albert there: \"A vast lapse of\nages...[separates] the era in which fossil implements were framed and that of the invasion of Gaul by the\nRomans.\"\nA month later in 1859 Origin of Species is published - sidesteps human evolution, which was dealt with\nlater in The Descent of Man 1871 -\nBut Darwin's friends and allies almost immediately recognized the implications, that humans too had\nevolved -\nLyell presented a skull to Huxley, who \"remarked at once that it was the most apelike skull he had ever\nbeheld\" -\n\nHuxley 1863 Man's Place in Nature - long discussion of the skull, refuting those who thought it was that\nof an \"idiot,\" Cossack or \"powerfully organized Celt,\" i.e. it resembled the skull of a modern Irishman\nwith low mental organization\nHuxley insisted it was that of an apelike human: \"it is singular how often the dream [of ancient\ntraditions] turns out to have been a half‐waking one, presaging a reality....though the quaint forms of\ncentaurs and satyrs have an existence only in the realms of Art, creatures approaching man more nearly\nthan they in essential structure...are now not only known, but notorious.\"\nScience had led not to Biblical history but to a previously unknown history, which tested humankind's\nsense of identity and specialness as never before\nImage of the skull: imagination, consciousness of prehistory - like Galileo turning telescope to the moon:\nnew things never before seen, man's place in nature, heavy‐browed, heavy‐jawed\nWho were they? How did they live? What does this mean? Skull doesn't tell you this -\n1864 discovery of a piece of ivory drawn with a hairy mammoth in La Madeleine, nearby\nIn 1868 railway line (progress!) being put in near Les Eyzies - involved blasting open a rock shelter in a\ncliff - found 4 skeletons like those Buckland had found in Kent's cavern - tall, large brained (Neandertals\nalso), long‐headed - formally buried with pierced shells and other ornaments ‐ called Cro‐Magnon after\nthe rock shelter\nBecame clear the Cro‐Magnons had succeeded the Neandertals\nSir John Lubbock, Prehistoric Times 1865 - widely ready - \"of late years a new branch of knowledge has\narisen, a new science has....been born among us, which deals with times and events far more ancient\nthan any which have yet fallen within the province of the archaeologist...Archaeology forms the link\nbetween geology and history.\"\nNew science, new word, railway line, \"technology\" emerging as a concept: all happening at once\nSerious excavations in Kent's Cavern, 1865‐1880 - calculated from stalagmite growth rates that stone\ntools under them were half a million years old - then sold to family 1903, used as a workshop and then a\ntourist attraction - during the cave tours lights are turned off, stone age shell lamps are used\nDiscovery of cave art\nSee preface to Lewis Williams: record of entrance into Niaux 1660, tourist attraction, natural wonder -\nleaves name and date on wall, a meter from images of bixon and ibex - images all o ver the wall, don't\nseem to get much attention\nLike the word \"technology\" - it is there but no one pays much attention\n\"rediscovery\" begins 1861\n\nAltamira 1879 - could be a hoax\n1895 disc. Of La Mouthe near Les Eyzies - sandstone lamp found\nAuthenticated 1902, retraction of views on Altamira\nPicasso: after this, art is just one long footnote\nAbbe Henri Breuil\n\nJuniper Fuse\nThe beginning of imagination\nAnd of separation of human from other animals - projecting it on the cave walls\nTools can produce images: great discovery (Eschleman xvi)\nAgain riddle of consciousness - Descartes, brain‐mind problem (see article about brain activity)\nMystery of motivation\nsymbolic capacity: what does this mean?\nPaabo on questions for which we will never know the answer\nDiscovery of imagination?\nLewis‐Williams on shamanism: the mind in the cave, the cave in the mind ‐ hypothesis\nVaried stages of consciousness\nLooking for common neurological equipment\nGeometrical and animal/representational images\nEntoptic - within the eyeball - particles in vitreous liquid or shadows of retinal blood vessels falling on\nretina\nSpiritual world exists, it's tangible\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nSTS.007 Technology in History\nFall 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "MITSTS_007F10_lec02_slides.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-007-technology-in-history-fall-2010/7d1e7388e6c0c5d54e9d70e7a7149182_MITSTS_007F10_lec02_slides.pdf",
      "content": "Stephen Jay Gould on \"deep time\"\n\"geology's greatest contribution to human\nthought....[a discovery] so central, so sweet,\nand so provocative, that we cannot hope to\nmatch its importance again.\"\nFrom Time's Arrow, Time's Cycle (1987)\n\nThis image is public domain\n\nThis image is public domain\n\nComparison of Werner's Neptunist\nTheory and Hutton's Plutonist Theory\nImage removed due to copyright restrictions\nSee: http://bit.ly/kJLrQ8\n\nBaron Georges Cuvier (1769‐1832)\nThis image is public domain\n\nFrom Cuvier's Le regne animal, first\npublished 1817\nThis image is public domain\n\nCuvier's Animals\nImage removed due to copyright restrictions\nSee: http://ecx.images‐amazon.com/images/I/516MD0GJX4L._SS500_.jpg\n\nHandaxes, from article in Archaeologia\n(written by John Frere), 1800\nThis image is public domain\n\nThis image is public domain\n\nFrontispiece, Lyell's Principles of\nGeology\nThis image is public domain\n\nFrom William Buckland, Reliquiae\nDiluvianae,(1823)\nThis image is public domain\n\nThis image is public domain\n\nKent's Cavern\nImage removed due to copyright restrictions.\nSee: http://farm6.static.flickr.com/5004/5380642570_4eef72fcef.jpg\n\nNeandertal skull (left)\nHomo sapiens (right)\nImage removed due to copyright restrictions.\nSee: http://bit.ly/jSWLge\n\nNeandertal skull (left)\nHomo sapiens (right)\nImage removed due to copyright restrictions.\nSee:\nhttp://anthro.palomar.edu/homo2/images/Neandertal_modern_human_skulls.gif\n\n27 April 1859\nGravel pit at Abbeville, France\nThis image is public domain\n\nImage of Neandertal skull from\nHuxley's Man's Place in Nature, Vol. 7\n(1863)\nThis image is public domain\n\nArtist Conceptions of Neandertal\nImage removed due to copyright restrictions.\nSee: http://custance.org/old/evol/3ch3/fig11.jpg\n\nArtist Conceptions of Neandertal\nImage removed due to copyright restrictions.\nSee: http://frankfrazetta.org/images/frank_frazetta_neanderthal.jpg\n\nLa Madeleine Art Objects\nImage removed due to copyright restrictions.\nSee: http://www.donsmaps.com/madeleine.html\n\nLes Eyzies, Dordogne region, southern\nFrance\n- Railroad line put through 1868\n- In blasting a rock shelter: 4 skeletons found\n(tall, large brained, long‐headed)\n- Formal burial with pierced shells and other\nornaments\n- Called Cro‐Magnon after the shelter\n- Neandertal skeletons also found in that area\n\nAbri de Cro‐Magnon\nImage removed due to copyright restrictions.\nSee: http://www.megalithic.co.uk/a558/a312/gallery/France/Aquitaine/aP5190370_Cro_Magnon.JPG\n\nSkull, found 1868 in Abri de\nCro‐Magnon, Les Eyzies\nImage removed due to copyright restrictions.\nSee: http://www.mos.org/evolution/fossils/photos/cro‐magnon.jpg\n\nFrom John Lubbock, Prehistoric Times\n(1865)\nThis image is public domain\n\nFrom Lubbock, Prehistoric Times\nThis image is public domain\n\nKent's Cavern today\nImage removed due to copyright restrictions.\nSee:\nhttp://www.kents-cavern.co.uk/\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nSTS.007 Technology in History\nFall 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "MITSTS_007F10_lec03_notes.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-007-technology-in-history-fall-2010/04a9da829dc060549681343ae1912653_MITSTS_007F10_lec03_notes.pdf",
      "content": "STS 007 class notes class 4\nGeneral prehistory\nContinuing importance of science in understanding history (and vice versa)\nPaabo's feat - first 1856 skeleton\nPaabo's comments on interbreeding - dominance matters\nSvante Paabo Stockholm Nov. 08\nOnly one gene so far clearly linked to language (Fox P2), Neandertals have it\nAnalysis of one million base pairs of N. DNA by 2600\nDNA sequencing in second generation: 3 billion bases by end of year\nHow different the self-conception of humans would be if Neandertals had survived\nForbidden experiment\nSee: http://www.edge.org/3rd_culture/paabo09/paabo09_index.htm\nStrands of evidence - sustaining and constraining\nThe riddle of consciousness\nDiscovery of cro-Magnono\nMale, 50 years old, 5 bodies deliberately buried\nSee: http://www.abc.net.au/beasts/evidence/prog6/images/evi_cromagnon_large.jpg\nFrom museum of prehistory (handouts)\n\nNeandertal or Mousterian culture - \"middle Paleolithic\" (50-250,000 BP)\nFire\nTools (from 2.5 M BP)\n(Carbon dating, radio carbon 14 decay - also uraniuim/thorium or potassium/argon ratios\nUsed wood, pelts, rocks\nBurials: ochre nearby, grave goods, from 100K BP\nSometimes fished, hunted\nMarks on bones, not necessarily cannibalism\nAs far east as Kurdistan and Palestine, north to Sweden, south to Spain\nFlint tools, biface (symmetrical) \"Swiss army knife\" utensil\nSee: http://www.astrosurf.com/luxorion/Bio/cro-magnon-caverne.jpg\nWhat makes us human? Not bipedalism (chickens) but \"refusal/defiance of his condition\"\nLe grand refus - challenge against the universe\nGesture more than function: both practical and artistic\nCro-Magnons - Upper Paleolithic ca. 40-50000 BP\nUse hand lamps (juniper fuse, animal fat), also torches\nSocial systems implied by hunt - chasing animals over cliffs\nCave bears until 15000 BP (300-800 kg, 2-3 m long, 1.3 m high)\nMaterials: animal, mineral (paintings), vegetable'\nSupplies for hunting and for art\nFeathers - arrows\nIvory\nShells\n\nFlints found in specific sites\nShells and bones used for apparel\nSee:\nhttp://www.megalithic.co.uk/a558/a312/gallery/France/Aquitaine/aP5190370_Cro_Magnon.JPG\nhttp://www.mos.org/evolution/fossils/photos/cro-magnon.jpg\nCave painting as needing many technologies - plural\nWhat are they? Tools: Minerals, binder, brush, light, ventilation, state of mind/psychotropic\nmechanisms\nAlso network of connections - emphasized by Christian - also true of art today\nAlso riddle of consciousness -\nMystery of motivation\nsymbolic capacity: what does this mean?\nPaabo on questions for which we will never know the answer\nDiscovery of imagination?\nFont de Gaume\n15-17000 BP - warmer then\nThe most extended frescoes are at the back, difficult to see\nSee: http://www.donsmaps.com/fontdegaume.html\nSophistication of the images\nPerspective: twisted, to show movement\n\"3-D\"\nCinematic effects\nCurves of stone make belly of horses\nOne leg serves for both bison and deer\n\nMastery off observation of habits, shapes\nTwo colors/ polychromatic, only one still open\nIron oxide is red, manganese dioxide powder is black\nFour types of images: animals, stick people, geometry (tectiforms), hand\nWays of making images: hand/fingers, brush, blowpipe\n100% humidity, necessary to keep paint on walls, mixed with water\nSee: http://williamcalvin.com/BHM/img/AbbeBureulCopy.jpg\nLes combarelles\nVery narrow\n600 engravings mainly horses 52 of the anthropomorphic\n15000 BP\nDiscovered 1901 authenticated by Abbe Breuil\nFlint used to engrave\nCalcite over engraving\nLascaux - \"Sistine chapel of prehistory\" - shaped like a sanctuary\nDiscovered 1940, closed since 1963\nLascaux II\n\"light show\" of guide\n3⁄4 view, overlaps of herd\nForelegs of cow are stone\nStylized animals: horses have small head, deers have big antlers\nThe shaman? Sorcerer?\n\nCougnac\nPillar in middle\nMusic, on stalagmites and tites - flute found\nInner sanctum\nBroken stalagmites/tites en route\nGreat drawing showing how stone shapes are used for legs of ibex\nWounded human figures on animals\nMany \"blazes\" on animals\nDrawn 25000-27000\nFinger marks 14000\nPech-Merle\nVery hard to get to, sealed up 12000 with return of cold weather\n16000 BP black frieze'\nBlack frieze: horse, bison, mammoth\nAlso mammoth and auroch (black frieze)\nOne artist, knew order, sketched first\nElongated head of bear so you see it as if from an angle\nHorse done 24000 BP - hands - red dots, ochre, spitted dots\nAlso aviform and tectiorms and\nOne line does a mammoth\nSketched with finger first\nClaw marks of cave bear - teeth\nFootprint of children, teenage boy\nGet dates of Chauvet\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nSTS.007 Technology in History\nFall 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "MITSTS_007F10_lec03_slides.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-007-technology-in-history-fall-2010/6803a6bbeaaa3a4eeee4f289cb474fa2_MITSTS_007F10_lec03_slides.pdf",
      "content": "Svante Paabo\nImage removed due to copyright restrictions.\nSee: http://www.edge.org/3rd_culture/paabo09/paabo09_index.html\n\nCro‐Magnon Man\nImage removed due to copyright restrictions\nSee:\nhttp://www.abc.net.au/beasts/evidence/prog6/images/evi_cromagnon_large.jpg\n\nCro‐Magnon Cave\nImage removed due to copyright restrictions.\nSee: http://www.astrosurf.com/luxorion/Bio/cro-magnon-caverne.jpg\n\nCro‐Magnon Village\nImage removed due to copyright restrictions.\nSee: http://www.kidspast.com/images/cro-magnon-village.jpg\n\nAbri de Cro‐Magnon\nImage removed due to copyright restrictions.\nSee: http://www.megalithic.co.uk/a558/a312/gallery/France/Aquitaine/aP5190370_Cro_Magnon.JPG\n\nSkull, found 1868 in Abri de\nCro‐Magnon, Les Eyzies\nImage removed due to copyright restrictions.\nSee: http://www.mos.org/evolution/fossils/photos/cro-magnon.jpg\n\nLes Eyzies\n\n\"Le grand refus\" of humankind\n(Le Musee de la prehistoire de la France)\nDefiance of our condition\nBreak with nature\nBoth in utilitarian and artistic activities\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nSTS.007 Technology in History\nFall 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "MITSTS_007F10_lec04_notes.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-007-technology-in-history-fall-2010/6a15b172b901359d23ab419e19199edd_MITSTS_007F10_lec04_notes.pdf",
      "content": "STS 022 Class Notes 4B\nCave art\nSummary, looking back and forward\nCourse organized around four revolutions:\nHuman, settled agriculture, industrial, unnamed one (your challenge)\nToday: last of discussions of first and fundamental: humans emerging as an inventive aggressive\nspecies\nUltimately a question about \"human nature\" (note wording: are humans included? Basic\nseparation from rest of animals)\nStartling and shocking discovery of human antiquity - so all of history gets redefined, including\ntech in history\nYou read Mumford on \"Technics and the Nature of Man\" - celebrates creativity\nEnd of chapter 7: the extinction of the large mammals, incl. maybe Neandertals (sp)\nBut also implies networks\nTheory of demographic imbalance (2 % mortality difference, 30 generations or a millennium) -\nLewis Williams 88\nAlso a creative, fast-growing population - \"human revolution\" \"creative explosion\" (Lewis\nWilliams 96)\n\"creative destruction\" (Joseph Schumpeter, contemporary of Veblen)\nhttp://www.stps.metu.edu.tr/stpswp/series05/0509.pdf\nTo learn more about \"creative destruction\" see: Creative Destruction.\nSecond: Neolithic Rev.\nUsually called \"agriculture\"\nChristian stresses that it is something more: domestication and settlement\nBy definition needs a set of technologies that can feed people without hunting/foraging\nA suite of technologies, a system\n\nChristian also stresses that in hybrid form it lasted a long time: settled agr.with nomads, foragers\nThink: Roman Empire and Goths\nThink: America and Australian indigenous peoples; Afghanistan\nChristian also stresses that this change is not necessarily progress\nRaises deep question of free will: why don't humans make inventions, new technologies that\nmake them happier and better off? (unanticipated consequences, foreclosing options)\nThird: emergence of a civilization based on industrial production fueled by fossil fuels\nLatter doesn't get enough attention: displacement of organic sources (wind, water, muscles of\nanimals and people)\nVast increase in productivity; vast increase in disparities\nMarx: \"prehistory\" is over, it's a new human condition\nThe unnamed revolution beginning around turn of 20th century\n\"information\" is part but not the whole\nMumford at beginning of \"technics and human nature\" - an artificial world - no more beyond\nthe human\nRemember Christian's emphasis on geographical consolidation, networks, from many to one\nKeep asking yourself this question as we proceed: what is it?\nKeep two things in mind:\nProblem with term \"revolution\" no matter what the modifier\nBorrowed from science, then to politics, then to \"industry\" (Toynbee)\nImage from storming of Bastille, or maybe Russian Rev of 1917: you have a government, you\noverthrow it, kill the powerful and install new leaders\nChristian's comments on human revolution - it didn't erupt in Europe in 40000 to 50000 BP\nLonger development in Africa (McBrearty and Brooks article; also cited by L-W 96)\nNeolithic Rev\n\nIt took a long time; they were not aware of what they were doing (consciousness); many\nsubinventions go into the big one of \"agriculture\"; and things accumulate (foraging lasts a long\nlong time; agriculture lasts into present; means continue to be used, are not displaced)\nBut inarguably a change in human condition\nSecond thing to keep in mind: what changes is not just material means but understanding of ends\naround which the means are organized - teleology\nMeans accumulate but meanings succeed each other - Gauguin: where are we coming from,\nwhere are we going, what does it mean? (In Boston Museum of Fine Arts) - ultimately\nunanswerable questions, or rather answers change\nTo learn more about Paul Gauguin's Where Do We Come From? What Are We? Where Are We\nGoing? See: Gauguin: Where Do We Come From? What Are We? Where Are We Going?\nThese questions do not appear in hierarchical order (Maslow) - physical then spiritual needs\nIn fact they define the human revolution: symbolic mastery\nAnother energy source: psychic energy, what you care about, are willing to live and die for\nLots of survival technologies: weaving, pottery, dwellings, hunting tools\nFirst sign of human is not fire, axes, but jewelry, art\nmeaning in kinship, tribe, fertility, a spirit world\nEarly civilizations: role of organized state, ruler and priests - later combines with monotheism -\nwe will read about Christian belief in Virgin Mary as a source of energy (Henry Adams)\nIndustry - \"progress\" defined either as democracy or as production, wealth\nNow: sustainability, back to living with nature - ?\nTalk about Clan of Cave Bear in this light - their tools, their ends\nSymbol, art, abstraction\nLanguage: here and now, life, death, strength, birth, sex, food\nPhysical weakness of the shaman\nPidgin-Aurignacian - communication - simple\n\"We need to distinguish between those kinds of art that can interact to produce viable new forms\nand those that cannot evolve into other types\" (Lewis Williams 89)\nGenerative grammar analogy\n\nCould body decoration (red ochre, jewelry) evolve into two D images on a cave wall?\nThey signify clan membership and also stages of kinship (puberty, marriage, childbearing)\nAnimals that hunt other animals are singled out for display\nHunting associated with supernatural realm\nNeanderthals did not take over pictures or carvings - body-painting does not evolve into image-\nmaking - could not remember altered states of consciousness or manipulate that imagery; could\nnot imagine an alternative reality (spirit world); could not recognize connection between 2D and\n3D\nNor burial with elaborate grave goods, nor advanced hunting strategies\nLarger social networks\nFace to face exchanges of artefacts and information - beyond face to face\nBurial with lots of grave goods indicates social networks\nLewis Williams' argument that the Aurignacians actively cultivated the characteristics of their\nlives that distinguished them (set them \"above\") the Neandertals -\nNeandertals coping with new arrivals around 45000 to 35000 BP - cave art as a form of social\ndistinction\nCave art: what they care about - quest for meaning -\nCave painting as needing many technologies (Mithen mentions some)\nCaves were handy - earth art is universal but not cave art - sealed in time by ice ages - also\nportable art\nThe dancing sorcerer image, from Trois Freres cave, Ariege\nIn a very hard to reach part of the cave - part human, part animal\nFont de Gaume\n15-17000 BP - warmer then\nThe most extended frescoes are at the back, difficult to see\nSophistication of the images\n\nPerspective: twisted, to show movement\n\"3-D\"\nCinematic effects\nCurves of stone make belly of horses\nOne leg serves for both bison and deer\nMastery off observation of habits, shapes\nTwo colors/ polychromatic, only one still open\nIron oxide is red, manganese dioxide powder is black\nFour types of images: animals, stick people, geometry (tectiforms), hand\nWays of making images: hand/fingers, brush, blowpipe\n100% humidity, necessary to keep paint on walls, mixed with water\nLes Combarelles\nVery narrow\n600 engravings mainly horses 52 of the anthropomorphic\n15000 BP\nDiscovered 1901 authenticated by Abbe Breuil\nFlint used to engrave\nCalcite over engraving\nLascaux - \"Sistine chapel of prehistory\" - shaped like a sanctuary\nDiscovered 1940, closed since 1963\nLascaux II\n\"light show\" of guide\n3⁄4 view, overlaps of herd\nForelegs of cow are stone\n\nStylized animals: horses have small head, deers have big antlers\nThe shaman? Sorcerer?\nCougnac\nPillar in middle\nMusic, on stalagmites and tites - flute found\nInner sanctum\nBroken stalagmites/tites en route\nGreat drawing showing how stone shapes are used for legs of ibex\nWounded human figures on animals\nMany \"blazes\" on animals\nDrawn 25000-27000\nFinger marks 14000\nPech-Merle\nVery hard to get to, sealed up 12000 with return of cold weather\n16000 BP black frieze'\nBlack frieze: horse, bison, mammoth\nAlso mammoth and auroch (black frieze)\nOne artist, knew order, sketched first\nElongated head of bear so you see it as if from an angle\nHorse done 24000 BP - hands - red dots, ochre, spitted dots\nAlso aviform and tectiorms and\nOne line does a mammoth\nSketched with finger first\nClaw marks of cave bear - teeth\n\nFootprint of children, teenage boy\nChauvet disc. 1994 by 3 spelunkers, one named Chauvet - in Rhone valley\nNow active searching: e.g. three friends (two men, one named Chauvet, one woman) feel a\ndraught, remove some rubble (modern entrances often not the prehistoric ones), goes down 10 m\ntunnel, find chamber, get a ladder\nSee mammoth, rhino, dots, handprints, horses heads, skull of a dave bear with its canine teeth\nhooked over an edge, even deeper find lion heads\n\"we were seized by a strange feeling. Everything was so beautiful, so fresh, almost too much so.\nTime was abolished, as if the tends of thousands of years that separated us from the producers of\nthese paintings no longer existed. It seemed as if they had just created these masterpieces.\nSuddenly we felt like intruders....we were weighed down by the feeling that we were not along;\nthe artists' souls and spirits surrounded us. We thought we could feel their presence; we were\ndisturbing them.\" (imagine similar feelings in Chauvet 27000) - in book pub. 1996 quoted in\nLewis Williams 17\n32000-30000 yrs ago - 22 dates\nEarliest known cave paintings\n2nd occupation 27000-26000 yrs BP (torch wipes, no paintings tho) - 7 dates\nMaybe a third around 22,800\nFoot and animal prints - foot from earliest known anatomically modern human\nEsp. bears\nHearths set up to produce wood charcoal for coloring (also illumination)\nStep dug - flints\nLevi-Strauss spoke of myth growing \"spiral-wise\" until the \"intellectual impulse which has\nproduced it is exhausted.\" (in Structural Anthropology 1963) UP nexus of mental states, fixed\nimagery, social relations and caves lasted until 10000 BP, long after the demise of the\nNeandertals - thereafter locus of spirit world was built above ground\n\nClan of the Cave Bear assignment: ask how literature helps imagine a whole way of life, with\neverything integrated\nWhat are other ways to accomplish this? biographies\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nSTS.007 Technology in History\nFall 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "MITSTS_007F10_lec04_slides.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-007-technology-in-history-fall-2010/774380fae8b7cb3b05140a4dd85ff9ac_MITSTS_007F10_lec04_slides.pdf",
      "content": "The Neolithic Revolution\n- Domestication, settlement, agriculture\n- Limited range\n- Persistence as part of hybrid \"many worlds\"\n(dates?)\n- The question of progress\n- The subsequent organization of agriculture‐\nbased states\n\nThe industrial revolution\n- Organization of labor\n- Reliance on fossil fuels\n- Vast increase in productivity\n\nThe still unnamed revolution we are\nliving through:\n\"Information\" is part but not the whole\nAlso geographical consolidation and concerns\nMumford: an artificial, human‐built world?\n\nTypes of revolution:\n- Physical, scientific use (earth around sun)\n- Political metaphor (French, Russian, etc.)\n- Technological metaphor (industrial, Second\nIndustrial, information, etc.)\n- Things accumulate: displacements are gradual\nand often incomplete\n\nSocial teleology:\nWhere do we come from?\nWhere are we going?\nWhat does it all mean?\nWhat is our place in the universe?\nWhat really matters?\n\nPaul Gauguin, \"Where Do We Come\nFrom? What are We? Where are We\nGoing?\" (1897)\n(Boston Museum of Fine Arts)\nThis image is public domain\n\nRevolutions in ends as well as means\n- Question of ends is always there\n- Another energy source: psychic and social\nenergy, enlisting allegiance and trust\n- Meanings in kinship, rulers, nation, wealth\n- Is this also changing? Is \"sustainability\" a new\nend? others?\n\nFour revolutions changing the role of\n\"technology in history\"\n- The Human Revolution in \"prehistory\" or\npaleohistory\n- The Neolithic Revolution\n- The Industrial Revolution\n- The Human Empire\n\nKey points about the human\nrevolution\n- Startling and shocking discovery of\n\"prehistory,\" which is also history (dates?)\n- The primary event: emergence of humans as\ndistinct from the rest of nature, while also\nbeing part of nature\n- A view of \"technology in history\" beyond tool\nmaking for physical survival\n\nCave art as part of socio‐technological\nsystem\n- Quest for meaning: human place and purpose\nin the rest of nature\n- Providing a social meeting point to swap\nobservations, reaffirm bonds, learn more\nabout animals, arrange for cooperation,\nsharing of food\n- Mithen: \"...a tool for survival, one as essential\nas tools of stone, clothes of fur, and the fires\nthat crackled within the caves\"\n\nLascaux, France\nRemoved due to copyright restrictions\nSee: http://www.atlantis‐webportfolios.com/world/cave/LascauxLocation.gif\n\nFrance and Spain\nRemoved due to copyright restrictions\nSee: http://www.muse.or.jp/spain/image/common/euro_map.jpg\n\nThis image is public domain\n\nThis image is public domain\n\nThis image is public domain\n\nThe Dancing Sorcerer\nImage removed due to copyright restrictions\nSee: http://media‐2.web.britannica.com/eb‐media/63/4763‐004‐824529EB.jpg\n\nFont du Gaume\nImages removed due to copyright restrictions\nSee:\nhttp://donsmaps.com/fontdegaume.html\nhttp://s3.amazonaws.com/readers/2009/04/08/a172gaume1_1.jpg\nhttp://infinity.cos.edu/art/strong/module/history2/unit1/paleoneo/photo2.jpg\n\nLes Combarelles\nImages removed due to copyright restrictions\nSee:\nhttp://t2.gstatic.com/images?q=tbn:ANd9GcSIb‐mUUgudsZCP40nu0_eyBNH‐ejCdrI8ssKHaO9o71AEhtvo&t=1\nhttp://pagesperso‐orange.fr/nicole.rolin/prehistoire/Images/Anthropomorphes%20les%20Combarelles1348.jpg\nhttp://www.landschaftsmuseum.de/Bilder/Mammut‐2.jpg\nhttp://www.paleolithicartmagazine.org/comba.jpg\nhttp://www.newworldencyclopedia.org/d/images/3/34/Altamira‐tectiformes.jpg\n\nTools found in Les Combarelles, now in\nmuseum at Les Eyzies\nImages removed due to copyright restrictions\nSee: http://bit.ly/iI0uZ3\n\nLascaux\nImages removed due to copyright restrictions\nSee:\nhttp://www.gailallen.com/images/his/lascaux_cave_painting_800x522.jpg\nhttp://ursispaltenstein.ch/blog/images/uploads_img/lascaux_2.jpg\nhttp://slowpainting.files.wordpress.com/2009/02/lascauxbulls.jpg\nhttp://smartistcareerblog.com/wp‐content/uploads/2008/10/lascaux‐axial‐gallery‐3.jpg\nhttp://web.me.com/kbolman/Lascaux_France/3LascauxHallofBulls_files/3.1lascaux.gif\nhttp://www.coolschool.k12.or.us/courses/119900/graphics/Lascaux/L2‐07b.jpg\nhttp://www.susanboothfinearts.com/WebImages/VengenceatLascaux.jpg\nhttp://bit.ly/iLJFP4\n\nCougnac\nImages removed due to copyright restrictions.\nSee:\nhttp://static.panoramio.com/photos/original/3462492.jpg\nhttp://www.donsmaps.com/images3/ibex.jpg\nhttp://www.culture.gouv.fr/culture/conservation/fr/grottes/Photos/Cougnac3191.jpg\nhttp://www.fenomenum.com.br/ufo/historico/imagens/6815883cougnac‐jpg.jpg\nhttp://www.judeart.com/Dscn0017.jpg\n\nPech Merle\nImages removed due to copyright restrictions\nSee:\nhttp://www.judeart.com/Dscn0017.jpg\nhttp://www.jesuiscultive.com/IMG/jpg/Pech_Merle.jpg\nhttp://www.dkiel.com/SouthofFrance/Dordogne/PechMerle/Cave35.jpg\nhttp://www.donsmaps.com/images3/pechmerlemammoth.jpg\nhttp://bit.ly/kj94pK\n\nChauvet\nImages removed due to copyright restrictions\nSee:\nhttp://www.newyorker.com/images/2008/06/23/p465/080623_r17477_p465.jpg\nhttp://upload.wikimedia.org/wikipedia/commons/d/d1/Chauvet_cave,_paintings.JPG\nhttp://www.woostercollective.com/images/horsegraf1.jpg\n\nThe end of a way of life\n- The warming of the climate, invasion of\nwoodlands, scattered animals, less need for\ngroup hunts\n- 20000+ years\n- What other ways of life are extinct?\n\nMithen on the end of cave art:\n\"The cessation of cave painting is a remarkable\ntestament to the ability of people to rewrite\nthe rules of their society when the need\narises. It is one we must recall as global\nwarming threatens our planet today.\"\n(After the Ice, p. 149)\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nSTS.007 Technology in History\nFall 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "MITSTS_007F10_lec06_notes.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-007-technology-in-history-fall-2010/ae9b46872b750c4e7274489b59090aa9_MITSTS_007F10_lec06_notes.pdf",
      "content": "STS.007\nNotes for class 7\nNeolithic Revolution\nHistory and Technology\nTechnology in history: agriculture, cities, states\nIf you think of \"technology\" as industrial production, it seems off topic\n\"ecosystem engineers\" - why I handed it out - a reminder of the varieties of engineering\nAgriculture as an entirely new way of interacting with flora and fauna of the world for human\nends, productive and reproductive\n\"bioengineering\" - not just genetics but redoing agricultural production - green revolution - GM\nfoods - animal breeding and cloning (Dolly) (we will get back to this at the end of class)\nAlso though engineering not as production of goods but production of space - a humanbuilt\nworld - civil engineering - along with military engineering, oldest branch\nOrganization of space through creation of pathways and centers - bridges and dwellings\n(Heidegger) - \"second nature\"\nMachines vs structures: Billington has complained about bias of engineering history on former,\nnot latter, which are highly visible, massive, relatively permanent, slow to evole, and site-\nspecific -\nAgriculture is both: food production and shaping the world\nSeismic scale of revolutions: this is the big one, should be the standard against which to measure\nEverything changed: physical health: organization of society: gender relations: ideas?\nAnd still a mystery - so many elements - so many trade-offs\nCutting edge: How knowledge and perspectives keep changing - research ongoing\nBasic questions: how revolutionary was it? Certainly in results, but how sudden?\nGordon Childe, 1936, Man Makes Himself\nUP initials - Paleolithic to Neolithic Revolution: not just stones but a whole new system of life\n\nChanges since then: a gradual economic transformation, most communities not pristine hunter-\ngatherers nor full-fledged farmers - ec evolution not cultural revolution - most people hunter-\ngatherers-cultivators\nThe story of agri is much more complicated and interesting than had been imagined\nA long and winding road\n\"people were messing with plants for a very long time\"\nSequence theory: domestication, then sedentism\nNow: Sequence: sedentary life came before plant domestication; then animal herding and use of\npottery - in Near East\nNot so in Americas\ne.g. Mexico, squash and maize/corn domesticated while people were still completely mobile, not\nsedentary\nAlso, dissemination (note word) or independent discovery?\nDiffusion theory\nNow , simultaneous invention of agr. ca. 11.5 BP\nMithen's talk last spring\n\"One of the most astonishing features of human history is that agricultural economics arose quite\nindependently during the early Holocene in several different regions of the world.\" (Mithen 49)\nScience handout\nLook at map in Science article\nHis conclusion: there is \"immense variety of pathways that led to farming in different parts of the\nworld\"\ne.g. in North Africa animals domesticated before plants\ne.g. in China pottery invented along with domestication of rice, but long before farming and\nsedentism in Japan\ne.g. cereal farming spread rapidly from China and Western Asia\n\nwhereas roots, tubers, vegetables in New Guinea and Central America remained localized\ne.g. Australia remained hunter-gatherers until whites arrive\ne.g.mystery how indigenous African plants became domesticated\nMithen: three requirements: not just end of ice ages (After the Ice)\nClimate - distinct increase in temp and rainfall that begins the Holocene (11.5 BP)\n\nEnvironmental resources\nMind: fluid, imaginative mentality of modern humans\nWestern Asia has by the the most and best quality evidence (climate)\nKathleen Kenyon at Jericho in 1950s -\nSee: http://www.archaeowiki.org/Kathleen_Kenyon\nNear Jordan river on West Bank - well below sea level (820 feet, 250 M) - east west route north\nof the Dead Sea - near current town by that name\nSee: http://www.archatlas.dept.shef.ac.uk/OriginsFarming/Colledge/Slide18.jpg\nNear salt and flint trade routes\nOne of the oldest human habitations\nImportance of methodical excavations - many layers\nfound mud-brick circular dwellings; cultivate wheat and barley on allurvial soils of Jordan\nValley? Probably collected wild seeds rather than planting them - scythes with flint edges and\nbone handles; stone mortars to grind seeds\nbut no ceramics/pottery (PPNA: pre-pottery Neolithic A) - round huts Mudbricks - not fired but\ndried in sun - clay, mud, and water mixed with a binding material such as straw, or rice husks -\ncombined hunting and gathering with crops - also burial customs: secondary (exhume skulls of\nthe dead, maybe display for a while, then rebury)\n\"type site\" settlement - a couple thousand\nSee: http://www.biblearchaeology.org/image.axd?picture=Life-on-the-Edge-WEB.jpg\nWalls - 2 meters wide - huge tower 9 meters in diameter - large tower - granary? (not Joshua's\ntower) - storage bins of stone or mud-brick - not evidence of serious warfare then - protect salt?\nSee: http://www.archaeology.org/online/reviews/kenyon/thumbnails/kenyon6.gif\n\nInteresting proposal: building makes people settle not the reverse (we'll return to this)\nSee: http://www.bible-architecture.info/Jerich4.jpg\nTypical tools - \"lithic\" industry (blades) - flint - striking a long narrow flake from a stone core -\nalso sickles (gather while you cut) and arrowheads - axes or adzes, to smooth wood - hatchets or\naxes to cut wood - weave mats - spears, flint-tipped arrows\nOthers found in West Bank area, but Jericho seemed unique\nSee: http://www.hadashot-esi.org.il/images//5188-9.jpg\nSee: http://www.absoluteastronomy.com/topics/Pre-Pottery_Neolithic\nMore recently similar sites in in southern Jordan - to the south - more recently to the north in\nSyria and Turkey - these are villages in Lowlands - PPNA more widespread than had been\nbelieved\nKey questions concerning the extent to which wild plants were cultivated and animals managed,\nwhether communities were mobile or sedentary, and the nature of cultural developments remain\nunanswered.\nIn Wadi Faynan site 16\nSee: http://www.antiquity.ac.uk/projgall/finlayson319/images/figure1big.jpg\nSee: http://www.reading.ac.uk/web/MultimediaFiles/ARCH-WF16-2.JPG\nTo learn more about WF16, see: WF16 at the University of Reading.\nSee: http://www.antiquity.ac.uk/projgall/finlayson319/images/figure2big.jpg\nSee: http://www.antiquity.ac.uk/projgall/finlayson319/images/figure3big.jpg\nFound circular dwellings stone technologies- working reeds, wood, hide, stone - seem to have\nmade clothing, traps, cages, stone beads, wood artefacts, maybe goat pens\nAlso animal bones, wild goat, surprisingly small, a sign of domestication, rather than wild flocks,\nor some partial domestication\nSee: http://www.antiquity.ac.uk/projgall/finlayson319/images/figure4big.jpg\nsecondary burials\nTo learn more about the excavations at WF16, see: Finlayson's comments in Antiquity.\n\nSee: http://www.antiquity.ac.uk/projgall/finlayson319/images/figure5big.jpg\nFor details and images of artifacts found at the site, including explanations of the above\nskeletons, see: http://www.antiquity.ac.uk/projgall/finlayson319\nAnd acceleration of change: emergence of different time scales - in \"B\" there were two-story\nmulti-roomed rectangular buildings, with polished lime floor - houses 7 meters by 7 meters -\nceiling ot reeds and mud (ca 5500 BCE)\nPottery comes - rough, primitive, geometrical figures - 4000 to 5000 BCE\nThen Bronze age sometime in 3000 BCE (copper; walls; Bedouin raiders)\nNow we are back to map we started with\nCities, states, \"civilization,\" all the British Museum stuff....\nProgress? \"civilization and its discontents\" - defending territory; health; economic surplus\nleading to social differentiation\nChristian assumes a long period before this happened\nNow not so clear: Gobekli Tepe in southeast Turkey discovered in 1960s\nSee: http://www.viewzone.com/g.geography.jpg\nIn the hills not lowlands - a limestone hill, 300 m in diameter, ca. 15 m high, with round-topped\nknolls on it (\"hill with a potbelly\" in Kurdish)\nWould be a lovely view: rivers, animals, trees, fields, mild climate, arable land...\nSee: http://media.smithsonianmag.com/images/gobeklitepe_nov08_631.jpg\n5000 years older than Troy (found in late l9th c)\nAbout same time circular dwellings of Jericho were being built, ca 9600 BC - people carved T-\nshaped pillars out of limestone bedrock - 8 ft high, 7 tons, within circular buildings sunk into the\nhill -\nOne acre excavation only 5% of site\nCircles range from 30 to 100 feet in diameter, surrounded by stone walls about 6 feet high -\n\nMany layers -top one shows agricultural activity - one below that is PPNB (7500-6000 BC)\nsurveys (ground penetrating radar, geomagnetic surverys) suggest 16 more structures/rings yet\nto be unearthed under 22 acres - upper levels are less large, some rectangular structures - the\nearlier you go down the more monumental they are - suggest several millennia of activity -\ncarved to display wild animals, typically dangerous ones: lions, ducks, scorpions, ants, spiders,\nsnakes, vulture, boar - one with human arm -\nstaggering labor - flint flakes all over, from tools used to carve the stone, which was in soft\nlimestone outcrops - could shape them into pillars there, carry them a few hundred yards to the\nsummit, lift them upright - source was several km away - no metal tools, no pottery\nNo hearths, no trash heaps, no houses, no clay fertility figures - Instead, lots of gazelle bones (60\n% total) People who relied on wild game and plants - nothing domesticated, no domestic\nbuildings - had to be a ritual center - another similar site in Syria, with similar symbols - also\nsimilar to a Neolithic site in central Turkey\n\"First came the temple, then the city\"\nNetworking center? Hunter gatherers came to council?\nMaybe wheat was domesticated to provide sufficient food for those who worked and gathered in\nGobekli Tepe, and when people dispersed back to villages, maybe they took seed grain with\nthem - so maybe wheat was not domesticated as result of struggle vs. harsh climate before global\nwarming at 9600 BC: maybe a by-product of ritual gatherings in southern Turkey\nFor images, see: http://www.viewzone.com/turkeyx.html\nhttp://www.smithsonianmag.com/history-archaeology/gobekli-tepe.html#\nhttp://www.philipcoppens.com/gobekli.html\nApparently when rings were done, the early Neolithic peoples deliberately buried these ritual\nbuildings below several tons of soil - and then placed another ring near or on top of the old one\nSee: http://www.philipcoppens.com/gobekli_5.jpg\nSo ideology went hand in hand with changes in the economy\nRight on the edge: had wild sheep and wild grains\nWithin 1000 years, sheep, cattle and pigs had been corralled -\nJust 500 years later there is evidence of domesticated strains of wheat\n\"Sociocultural change comes first, agri comes later\"\nSo what is going on? Fragments of human bone in layers of dirt - floors of rings are hardened\nlimestone - Burial ground, death cult?\n\nStone circles are familiar - but this one is about 7000 years before Stonehenge was built\nMore time separates these two structures than separates Stonehenge from us\nTo learn more about megaliths like the circles found at Gobekli Tepe and Stonehinge, see:\nMegaliths\nFirst Sumerian clay tables 3300 BCE\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nSTS.007 Technology in History\nFall 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "MITSTS_007F10_lec06_nt_jrc.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-007-technology-in-history-fall-2010/a834cb13380bf06907b5aca7d3deafd2_MITSTS_007F10_lec06_nt_jrc.pdf",
      "content": "See: Jericho, Crystalinks\nhttp://www.crystalinks.com/jericho.jpg\nAbsolute Astronomy, Pre‐Pottery Neolithic A\nAbsolute Astronomy, Neolithic\nAbsolute Astronomy, Levant\nAbsolute Astronomy, Mesopotamia\nAbsolute Astronomy, Fertile Crescent\nAbsolute Astronomy, Domestication\nAbsolute Astronomy, Pre‐Pottery Neolithic B\nAbsolute Astronomy, Kathleen Kenyon\nAbsolute Astronomy, Type site\nAbsolute Astronomy, Jericho\nAbsolute Astronomy, pottery\nAbsolute Astronomy, Wheat\nAbsolute Astronomy, Barley\nAbsolute Astronomy, Legume\nAbsolute Astronomy, Seed\nAbsolute Astronomy, Terrazzo\nAbsolute Astronomy, Mudbrick\nAbsolute Astronomy, Blades\nAbsolute Astronomy, Sickle\nAbsolute Astronomy, Arrowhead\nAbsolute Astronomy, Natufian culture\nAbsolute Astronomy, Axe\n\nAbsolute Astronomy, Adze\nAbsolute Astronomy, 9500 BC\nAbsolute Astronomy, 8500 BC\nAbsolute Astronomy, 7500 BC\nAbsolute Astronomy, Jordan River\nAbsolute Astronomy, Netiv HaGdud\nAbsolute Astronomy, Mureybet\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nSTS.007 Technology in History\nFall 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "MITSTS_007F10_lec08_notes.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-007-technology-in-history-fall-2010/965e88eeea989778aa2e8682c63dea6d_MITSTS_007F10_lec08_notes.pdf",
      "content": "STS.007 Class 9\n7 October 2010\nConcept of \"envirotech\" in history\nNot just discrete events but longue duree (though discrete events could matter: e.g. Black\nDeath)\n\nFirst, environment and technology are intertwined\nThree ways this happens:\n1 Human labor much more productive, consuming more energy (Christian)\n\nBenefits and costs\n2 Recreation of the world - second creation - tipping point\n\"the first species in the history of life to become a geophysical force\" -Edward O. Wilson\nAge of the anthropocene\n3 we begin or create natural processes ourselves\nInstead of surrounding our human world with defensive wall, we act into the world - acting into\nnature becomes part of acting into history\nAtomic energy - global warming ‐ biotechnology\nSecond envirotechnical change as part of history - not just ice ages, Neolithic rev., but now too\nNot \"Nature\" as separate from humans but intertwined\nAnd \"Nature\" as changing, not the stable background of history\nProduction demands: energy\nRebuilding the world: have to maintain it, destruction of other species\nAction: Unpredictability\n\nNext paper: explore some aspect of current environmental reality as envirotechnical and\nspeculate on historical significance\nAnother topic is OK if you clear it (e.g. review of Diamond)\n\nIslands in history - high and low ones in South Pacific - \"an island world\" - New Atlantis -\nTreasure Island - Lord of the Flies - Madagascar - an inherent metaphor - Greenland\ncausal comparisons 115‐8 - see review by J.R. McNeill ‐ Natural experiments of history\nmetaphorical significance 119\n\nOther examples in this book: Montana, Pitcairn and the Hendersons, Anasazi (SW), Mayans,\nVikings, DR and Haiti, China, Australia\n\nHow things were vs how things happened - image and logic - metaphor: a significant story\nThe prevailing image of Easter Island: describe the statues 95‐102 who are they?\nLeads him to trees: What are some of the resources on the island? Chickens, fish, shellfish,\ntrees, rocks, stone, grass, herbs, land birds, water, soil, animal power, wind, canoes, ovens\n(How was research done? 104‐ )\nResults of deforestation: 108‐ funerals, land birds, sea creatures, wild fruits and nuts - erosion\nPopulation crash 111\nDebates 113+ - What are some of the causes of depletion? 116\n\nDiamond's five factors analysis 11‐15\nProperties of environment\nClimate change\nHostile neighbors\n\nDecline in friendship\nSocial responses\nSee analogy on p. 114\n\nWhy can't we do better? (chap 14)\nFailure to anticipate a problem\nFailure to perceive a problem - creeping normalcy\nFailure to attempt solutions\nGarrett Hardin, \"The tragedy of the commons\" - Science 1966 - Elinor Ostrom's work\nlater on ‐ other forces at work - e.g. religion\nSupposedly irrational behavior - Norse in Greenland - crowd psychology, denial, addiction,\ngroupthink\n\nWhat are some analogies that come to your mind? Historical comparisons?\nFood for world of 9 billion (Science, 12 Feb 2010) - esp. protein from wild foods ‐ management\nDestruction of natural habitats - wetlands - deforestation in ALL of them (487) -\nGenetic diversity lost ‐ beehives\nSoil depletion\nCeilings: energy, freshwater, photosynthetic capacity (490)\nHarms: toxic chemicals ( toxic sludge in Danube), alien species, atmospheric gases\nPopulation and standard of living\nOthers: viruses (self‐domestication), nuclear power\nUnderstanding present as history ‐ J.R. McNeill: \"Something New Under the Sun\"\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nSTS.007 Technology in History\nFall 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "MITSTS_007F10_lec09_slides.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-007-technology-in-history-fall-2010/c9657de16c6157e5b4774288ef98ae57_MITSTS_007F10_lec09_slides.pdf",
      "content": "Images removed due to copyright restrictions.\nSee:\nhttp://en.wikipedia.org/wiki/megalith\nhttp://www.2idiotsinaboat.com/pilgrim/media/WhiteHorse.jpg\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nSTS.007 Technology in History\nFall 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MITSTS_007F10_read01.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-007-technology-in-history-fall-2010/7867a2a3f220b74ff0c4838e0139ac50_MITSTS_007F10_read01.pdf",
      "content": "STS.007 Reading Notes for Class 1\n\n(On Leo Marx, \"Technology: The Emergence of a Hazardous Concept\")\nIn the first part of the essay, L. Marx explains the fundamental anachronism of the word and\nconcept technology. Make sure you understand this basic point: the word is used to describe\n\"something\" that allegedly is a central driver of human history back to the so-called Stone Age,\nbut the word itself emerged only in very recent times.\nWhat is L. Marx's problem with the capsule history he describes as being the conventional view\nof the role of technology in history? Do you agree that this represents a conventional brief\nhistory of technology? (562)\n\nWhen did the word become popular in common usage? (562)\n\nHow is the emergence of word an historical event? (562-3)\n\nWhat is a \"semantic void\"? (563)\n\nWhat are some other, older words displaced by the growing use of the word technology? (563)\n\nHow can a word be said to be \"hazardous\"? (564)\n\nIn the second and third parts of the essay, L. Marx discusses two sets of reasons for the\nemergence of technology as a key word in the U.S.\n\nIn the second part: what are \"ideological\" reasons he cites? (564-67)\nWhat is the idea of progress? How is this a theory of history? (564-65)\nHow did radical thinkers of the l8th century think of the relationship between mechanical and\npolitical progress? (565)\nHow was the relationship between means and ends thought about differently by the \"new\nentrepreneurial elite\" of the l9th century? (566)\nHow did some dissidents of the l9th century challenge this prevailing understanding of means\nand ends? (566-67)\nIs the ideology of progress dominant at MIT today? If so, give some examples. If not, give some\nexamples.\n\nIn the third part: what are some \"substantive\" material reasons for the emergence of technology\nas a key word in the 20th century? (567)\nWhat is a complex sociotechnological system? (567) Can you think of other examples of such\nsystems besides the ones L. Marx cites?\n\nHow and when did the word technology began to be used more widely? How was its meaning\ndifferent from the prevailing meaning today? (569-70)\n\nWhat do you learn about the naming of MIT? (570)\n\nDid Karl Marx play an important role in popularizing technology? Read carefully K. Marx's\ndefinition of the term in Capital. (570) Do you think it is adequate? Illuminating?\n\nWhat is the Second Industrial Revolution? (For that matter, what is the first Industrial\nRevolution?) (571)\n\nWho are some social scientists and other writers who introduced technology into more common\nusage? (572)\n\nIn the last part of the essay. L. Marx summarizes his case that technology may be a hazardous\nconcept. He begins by returning to the concept of a \"semantic void.\" Make sure you understand\nwhat this is. (573)\n\nWhat is paralypsis? (573)\n\nWhat are some reasons L. Marx gives for the popularity of the word and concept technology in\nthe 20th and now the 21st century? What unfortunate associations does it leave behind, in contrast\nto older terms? (573-74)\n\nHow does the word technology blur the boundary between material and non-material\n(bureaucratic, ideological) components of a sociotechnological system? Where is the boundary\nbetween technology and the rest of society and culture? (574-75)\n\nIs this expansive character part of what makes technology \"hazardous\"?\n\nWhat does it mean to attribute historical agency to technology? What is reification? (576)\n\nHow is it hazardous to attribute technology with the power of historical agency? What are some\nother possible sources of \"agency\" in history? (576-77)\n\nSummarize the reasons why L. Marx concludes that technology is a hazardous concept.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\nSTS.007 Technology in History\n\nFall 2010\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MITSTS_007F10_read02.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-007-technology-in-history-fall-2010/c80fdf8af862dc0af4b434ac286dfa96_MITSTS_007F10_read02.pdf",
      "content": "STS.007 Reading Notes Class 2\n\nDavid Christian, Maps of Time, Chapter 6\n\nRead William McNeill's preface, pp. xvi‐xvii, to get a sense of the \"really big picture\" Christian is\npresenting in this book (beginning in the first five chapters, which are not assigned as required reading)\n\nGiven this \"really big picture,\" how does Christian defend his decision to focus on the history of homo\nsapiens? Why is human evolution \"a revolutionary event within the history of the earth\" (168)?\n\nReview the tables on pp. 141‐144 and think about their interconnections and synergies, as well as their\nimplications for the history‐to‐come of the next century [will these trends continue? what are other\npossibilities?].\n\nWhat does Christian proposed as the single most fundamental and significant cause of historical\nchange? (145‐148)\n\nWhat are our sources of knowledge about early human history? What are some elements of human\nhistory we do not know now but that we hope to know someday? What are features we can never\nknow?\n\nWhat is the critical threshold to definitively human history? What are some qualities of homo sapiens\nthat made it possible for humans to cross this threshold? (153‐159)\n\nPay special attention to descriptions of tool use in pp. 159‐165: when evidence of this first appears,\nwhat it consists of, and, most important of all, its significance in human history.\n\nWhen did human brain size start growing rapidly? What are some possible explanations for this\nbiological change? (165‐167)\n\nWho are the Neanderthals, and what is their biological and historical relation to homo sapiens?\n\nWhat is the puzzling mismatch between biological and cultural evolution described in this chapter (and\nalso in the following one)? What does it suggest about causality in history?\n\nChapter 7\n\nWhat is the current consensus about the emergence of language in humans? What are areas of\ndisagreement? (171‐175)\n\nWhen does evidence of \"modern\" human behavior begin to be manifest? What are the four main types\nof evidence that we have? What is the \"Upper Paleolithic Revolution\"? What is the current consensus\nregarding it (176‐182)?\n\nWhat is \"prehistory\"? (180)\n\nWhat direct evidence do we have of technological changes in Africa around 250,000 BP What indirect\nevidence do we have? (181, including figure, to 184)\n\nWhat is \"stone age economics\" (Sahlins)? Who are \"people without history\" (Wolf)? (185‐187)\n\nWhat do you think of the analogy between the law of gravity in physical and social science? How does\nthis \"law\" manifest itself in human societies? (188‐189)\n\nWhat is \"extensification\" in human history? Review the major steps in human migrations that led to\nhuman settlements all over the world. What is \"intensification\"? Are both processes still at work? (190‐\n194)\n\nWhat are some technologies and accompanying skills that were necessary for humans to \"extensify\" so\ndramatically? (194‐197)\n\nReview human population growth from 100,000 BP to now (198).\n\nWhat was the effect of human population growth and dispersal on other lifeforms? (199‐202)\n\nChristian makes the claim that the astonishing growth of human population, and its consequences for\nother parts of the biosphere, that is evident in our own time \"began deep in the Paleolithic era, with the\nfirst migrations into new terrain within Africa\" (199). What do you think of this claim?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\nSTS.007 Technology in History\n\nFall 2010\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MITSTS_007F10_read06.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-007-technology-in-history-fall-2010/a450c0e04ddc9a3581c0744bf315a45c_MITSTS_007F10_read06.pdf",
      "content": "Reading questions on Christian, Chapter 8: \"Intensification and the Origins of Agriculture\"\n(Beginning of Part Four, The Holocene, \"Few Worlds\")\n\nRead pp. 206-211 carefully (including tables and figures). Make sure you get the big picture of\nthe transition from the Pleistocene to the Holocene, the end of the last ice age, the distinction\nbetween \"extensification\" and \"intensification,\" and the significance of the Neolithic Revolution\n(and make sure you can define and date these terms).\nWhat are the three world zones of the early Holocene? (212-215, including figures)\nWhat is domestication? Give some examples of life forms that are domesticated. How is\ndomestication different from agriculture? Is domestication a (bio)technology? (216-218)\nWhen did domestication begin? What did it begin with? Describe in general terms the sequence\nof places and organisms that were domesticated in the Neolithic Revolution (see table on p. 219\nas well as text). (218-222)\nWhat are the relationships among foraging, domestication, and agriculture? Did one lead to the\nother or did they coexist for long periods? (222)\nChristian's discusses agriculture as an invention (222-224). Is is a simultaneous invention or one\nthat spread from a central source? Is this an invention that can be described as \"progress\" in the\nusual meaning of that word? (223-224) What are its costs and benefits?\nWas there \"resistance to change\" in the adoption of agriculture? (223-224) Was this a rational\nresistance? If so, how was it overcome? Why did so many humans adopt agriculture as the basis\nof their lives? (224-234; see esp. summaries on 225 and 236) Explain the various roles of\npreconditions, global triggers\nWhat is sedentism? What is its relation to agriculture? What is its effect on population? (233-\n236) Did it precede or succeed agriculture? What is the \"trap of sedentism\"? (235) Can you think\nof other examples of a similar technological \"trap\"?\nWhat is horticulture, and how is it different from agriculture? (238-239)\nDescribe early agrarian communities as an apparently stable and widespread form of human\nsocial life. How were the organized, and how did they interact with each other? (239-242) What\ncan we speculate about the consciousness of humans in these communities? What was their\neffect on the rest of the natural world? (242-43)\nRead the summary carefully. What are the main points that Christian makes? What do they imply\nabout \"technology in history\"? Do you find them convincing? (243)\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\nSTS.007 Technology in History\n\nFall 2010\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MITSTS_007F10_read09.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-007-technology-in-history-fall-2010/cd61145678b50271e0b3ddc0d1c0d5a4_MITSTS_007F10_read09.pdf",
      "content": "Reading questions on Christian, Chapter 9\n\"From Power over Nature to Power over People: Cities, States, and `Civilizations.\"\n\nWhy do you think Christian puts \"civilizations\" in quotes in the chapter title? (see p. 248)\nYou might start at the end, where Christian summarizes the relevance of the history of early\nagricultural states to the history of technologies. Keep in mind these big themes as you read:\ntechnological momentum, larger settlements, increasing productivity, coercive modes of power\nas power over nature becomes power over people (281-282).\nWhat do you think of his initial analogy between the physical and the social universe, i.e. how\nthe force of gravity works in both settings? (245)\nWhat are the general dates of the community-based Paleolithic era and the appearance of the first\nstates in the Middle East, northern India and China, and Mesoamerica?\nLook at the maps on pp. 246-7: what modern states occupy these territories?\nChristian refers to a social scientist, Marvin Harris, to suggest that a major change in the human\ncondition is not necessarily \"progress\" (248). You will recall Christian's earlier reference to\nMarshall Sahlin's \"stone age economics\" (185-87). Is he making a similar point? If so, what is\nit? If not, what are the differences?\n(Harris's work is mentioned again on p. 272. Does this example support the thesis of Harris as\ndescribed on p. 248?)\nThe chart on p. 249 and figure 9.1 (p. 250) are helpful in making distinctions among terms such\nas \"family\" and different types of extended groups, many still kinship-based (such as \"clan\" or\n\"tribe\"). Make sure you review them to get a sense of the different types of groups that form\nbasic social organizations in the absence of state structures. Do you think the groups still persist\neven in state-based political settings?\nMake sure you understand Christian's ecological explanation of the emergence of state power,\ni.e. human society becomes the niche in which elites forage for resources. Again he is making\nanalogies between human society and the nonhuman world, in transitions to greater social\ncomplexity. Are you persuaded that these analogies are valid and useful? (249-252)\nWhy is the transition to agriculture so important in human history? (252-53) What are some of\nthe critical changes after the introduction of domestication that made it significantly more\nproductive? What are some new sources of energy that were tapped by these changes? (253-258)\nOnce again \"intensification\" and \"extensification\" are contrasted as two ways that humans\nextend their powers over the rest of the world. Make sure you understand the distinction and can\ngive examples of each process (256, 259)\nWhat are some new materials that began to be worked in agrarian regions? (258-59)\nWhat are the population trends in early agrarian regions? (259)\n\nExplain the causal connections (including feedback loops) of population growth, agricultural\nsurpluses, and social inequalities. Do these inequalities appear to be inevitable? Is there\napparently some trade-off between overall wealth and overall equality in human societies? Do\nthese inequalities have a strong gender component? What is patriarchy? (259-264)\nOne hypothesis, as explained by Christian, is that consent-based power inevitably/necessarily\nmutates into coercive power. Is this persuasive? Are there other explanations that seem\nplausible? What forms of leadership seem most common in early agriculture-based societies?\n(264-67)\nChristian defines cities as \"wholly humanized environments.\" (267) So are cities technologies?\nDo they have a major role as \"technologies in history\"? If so, what kind of role (see figure 9.3\nfor a hint)?\nHow do the details of geographical positioning and climate affect the development of cities?\nHow does their presence in turn \"warp\" the surrounding geography? (268-71)\nHow do cities affect the distribution of social power? (271-72)\nWhat do you think of Tilly's definition of states on p. 273?\nWhat are some of the inherent weaknesses of these early states? How is violence different from\npower? (273-74)\nLook at the Standard Professions List as described on p. 274. How does it compare with your\nsense of standard professions in today's world?\nOn p. 275 Christian describes the transition from a kinship-based society to a class-based society.\nIs this the end of prehistory? When does prehistory end?\nWhen, why, and how was writing invented? (275-278)\nAll through this chapter Christian has mentioned the emergence of organized warfare. Connect\nthese dots to get an idea of when and how armies arose as a standard part of human societies.\nWhat is their role in conflict with other groups? What is their role within the state? (248)\nHere Christian calls upon another social scientist, Eric Wolf, to make a distinction between kin-\nordered and tribute-taking societies. Is the latter the same as a class-divided society? How is the\ntransition from the first to the second connected with technological changes? (278-280, with\nemphasis on Table 9.3; also p. 282)\nHow does the model of transition from community-based to state-based agricultural societies fit\nthe sequence of events in Mesoamerica? (280-281)\nChristian returns again to an analogy between human societies and nonhuman life (namely social\ninsects), to explain why the \"demographic dynamism\" associated with agriculture leads\ninevitably to the social results described in this chapter. Do you find this analogy convincing? Do\nyou find his assertion of historical inevitability--technological determinism, if you will--\nconvincing? (281)\n\nReread the summary to make sure you understand this long and complicated argument about the\nreasons for the emergence of cities, states, and civilizations in history.\nLook over the bibliography to get a sense of some of the major works and themes in early\nagrarian-based history.\nDoes Christian's account remind you of anything else you have read in history? As you get\ndeeper into the book, what do you think of it? How might you write a review of it to post on, for\nexample, Amazon.com?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\nSTS.007 Technology in History\n\nFall 2010\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MITSTS_007F10_read10.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-007-technology-in-history-fall-2010/c3b2d2119b92b398623256f17a1b378b_MITSTS_007F10_read10.pdf",
      "content": "Questions on Christian, Chapter 10, \"Long Trends in the Era of Agrarian 'Civilizations'\"\n\nThis is a long and rich chapter. As usual, Christian is unusually interested in why events happen.\nIn the first half of this chapter, he focuses on geographical explanations; in the second, on\neconomic explanations, defining it as \"the collective human capacity to manipulate the natural\nenvironment\" (283). In both cases he is looking for large structural changes--population growth,\nproductivity, collective learning and innovation--rather than than detailed sequences of political\nsuccession.\nWhile you are reading, then, try to link Christian's analysis with the historical sequence of events\nthat is probably more familiar to you. For example, in this chapter he covers Egypt under the\nPharoahs, Greece of the Bronze Age, and the Roman Empire (all familiar in \"Western Civ\"\ncourses) as all part of the 4000+- year chunk of time he is considering (see e.g. p. 298). He\nstresses that the emergence of large-scale, diverse agriculture-based states he is describing took\nplace not only in the Middle East but also in other \"world zones,\" most notably Mesoamerica,\napproximately 2000 years later.\nNevertheless, Christian repeatedly sounds the theme of the dominance in world history of the\ngreat junction point, the \"center of gravity,\" where Africa, Europe, and Asia connect--the \"Afro-\nEurasian world zone\" (295), or what we typically and vaguely refer to today as \"the Middle\nEast.\" Therefore he is going to need to explain how modern industry developed in other sites in\nthe modern age--the rise of Europe as the site of the Industrial Revolution, the dominance of the\nUS in the twentieth century, and the emerging dominance of China in the 21st century. Keep your\neyes open for how he deals with these issues. (Christian himself mentions this \"displacement\" of\nthe Afro-Eurasia hub from its central role in world history on p. 296.)\nBe sure you understand the overall trends of agrarian civilizations in the era ca.3200 BCE to\n1400 CE (or ca. 5000-1000 BP). (Note that the \"map of time\" we looked at in our first class\n*began* the story of history at 5000 BP, while for Christian this date comes about halfway\nthrough his historical account.) What are their dominant characteristics? (289) What other types\nof societies exist during this era and where did they prevail? (284-6) How are agrarian\ncivilizations distinct, and why are they worth special attention, especially in terms of the theme\n\"technology in history\"? (286, 293) What is the overall evolution of the balance between\nagrarian civilizations and other forms of society in this period? (293-94) Describe the overall\nexpansion of agrarian civilizations in this period in terms of territorial domination. Compare the\ncontrol over population of these civilizations with that of modern capitalist states (302-05; 317).\nMuch of the story of technology in recent history is written as an account of Famous Inventors,\nFamous Industrialists, etc. How is Christian's account written in the spirit of \"history from\nbelow\"? (287) How does he account for male authority (patriarchal claims) in this period? (287)\nWhat is a \"tribute-taking\" society, and how does it differ from a \"gift-giving\" society? How does\npower based on consent differ from power based on coercion? What do you think of McNeill's\nanalogy with parasitism (which Christian cites approvingly)? (287-88) Do these concepts help\nyou understand contemporary societies and states?\n\nWhat are \"world-systems? (The question of European dominance begins to be discussed here.)\nWhat are four kinds of networks of power and influence? Think about which technologies are\ndistinctively associated with each kind of network. (289-91)\nOnce again, what do you think of Christian's scientific analogies--e.g. laws of gravity and social\ncenters of gravity, and the deformation of space-time by large bodies? What are hub regions and\nhow do they differ from centers of gravity? (291-93) Is he \"reifying\" geography when he writes\nthat \"Both centers of gravity and hub regions powerfully shaped change....?\" Is this geographical\ndeterminism? If so, how might it relate to technological determinism?\nHow separate were the various world zones during this 4-millennia period? (297-98, 301) When\nand how did India emerge as a new center of gravity? (299) When did agricultural civilization\nexpand to south China, southeast Asia, sub-Saharan Africa, and Europe? (300) to eastern Europe\nup to the Urals and to West Africa? (301) when did agricultural civilization emerge in\nMesoamerica? (301) When the encounter with Europe took place in the 16th century, what\nagricultural civilizations existed in the Americas? (302-4) How did the American world system\nat that time compare with that of Afro-Eurasia? (304, 318; also map p. 314)\nNow Christian turns his attention to the themes of intensification (as opposed to\n\"extensification\"), innovation, growth, commercialization, and urbanization--in other words,\nprocesses now usually referred to as \"economic.\"\nHow is scale a source of innovation? What are major innovations in transportation in this period,\nand how do they related to the \"secondary products revolution\" Christian described in Chapter 9,\npp. 255-57? (306-8) What are major innovations in information communication? (307-8)\nWhat are the long-term patterns of population growth in the early agrarian era? How did\npopulation growth and technological change interact in what was ultimately a negative feedback\ncycle? What is the analysis of Malthus about population growth? What is population\n\"overshoot\"? What are Malthusian cycles? (308-12, 331-32)\nWhat are the ecological components of the interactions of population and technologies? Does\nChristian's discussion alter in any way your understanding of your reading in Diamond's\nCollapse?\nWhat is the role of epidemic disease in the cycles of population and technological change? What\nare some explanations for the growth of population in Eurasia in the first millennium BCE and\nfor the population downturn in the first millennium CE? (312-16) What are some other causes of\nmajor population decline? (316)\nHow do states and cities stimulate innovation? How do they dampen it? What is the mixed effect\nof military activity on innovation and accumulation? Of large urban projects? How does the\nwidespread distribution of property inhibit innovation? What are the implications of this\nrelationship for early modern history?(316, 319-324) Where and why did some peasants engage\nin productivity-raising innovation? (328-29)\nHow might the dominance of large agricultural civilizations relate to the emergence of universal\nreligions? (319) To a social hierarchy dominated by male warrior values and lifeways and lack of\n\ninteraction between this elite and productive work or commercial transactions? (322-25, 328,\n220)\nWhat is the role of commercial exchange in promoting innovation and accumulation? What is the\nrelationship of these exchanges to tributary methods? (326-220) To city-founding and -building?\n(324-26, including table on p. 326) What are some examples of small but vigorous states based\non trade? (327, 329-330) When did coinage appear? (328)\nChristian summarizes the contradictory results of population growth, increasing state power, and\nincreasing commercialization on innovation and growth of wealth in agrarian civilizations. How\ndoes he explain the overall result of sluggish growth? (330-331)\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\nSTS.007 Technology in History\n\nFall 2010\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MITSTS_007F10_read11.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-007-technology-in-history-fall-2010/cfdf8aa26bca6a98ebb39764440571fd_MITSTS_007F10_read11.pdf",
      "content": "STS 007\nReading Questions on Christian, Maps of Time, Chapter 11, \"Approaching Modernity\"\n\nThis is the first chapter of Part V, \"The Modern Era: One World.\" (Note that the title of this Part\ngives a geographical emphasis to the emergence of \"modernity\" or, in Christian's terminology,\n\"the Modern Revolution.\" ) This chapter presents a long, analytical introduction to Christian's\nexplanation of the \"rise of the modern world,\" which he describes in more detail in the next two\nchapters.\nHow does Christian justify spending so much of his book to this very short period of time? Why\nis this transformation more significant--for humanity and for the world--than any other to date?\nIs it just beginning or almost over? Do we have a way of knowing? (335)\nIn the first section of the chapter Christian describes another type of mass extinction that humans\nhave caused: the extinction, in modern times, of many alternative forms of human societies, now\nswept away by the Modern Revolution (top of 342, also top of 348). Describe the mix of\ndifferent types of human societies before this happened. In many cases, people who lived in\nagricultural civilizations referred to others (foragers, pastoralists, horticulturalists, small-scale\nfarmers) as \"barbarians.\" What does this term mean? How did these \"barbarians\" typically live?\nWhat are some of the most active and interesting points of contact and exchange among the\nvarious types of pre-modern societies? What are some of the technologies, goods, and ideas that\nwere transferred among them? (336-341)\nReview the major categories of change that make today's world \"utterly different from the world\nof seven or eight hundred years ago\" (342): population, productivity and energy supplies, ability\nof states to impose power (through bureaucracies and also through violence), \"transformed\nlifeways,\" new modes of consciousness, and acceleration of the pace of change, i.e. of history\nitself. What are \"lifeways\"? How is this term different from \"lifestyles\"? Which of these\nchanges are predominantly material and which ones are predominantly cultural/psychic? How do\nthey connect, and what material changes underlie the more psychic ones? (Note on p. 359\nChristian returns to these theme of connecting material and psychic changes when he discusses\nthe \"disciplining\" effects of capitalism.)\nWhich of these changes seems most significant to you? Are you convinced by Christian's\nargument that among new technologies, those relating to energy production and use are critical?\nAre you convinced by his argument that the management of energy supplies presents particular\nchallenges just because of their apparent abundance? (342-351)\nChristian tells us that the Modern Revolution is not an \"out of Europe\" phenomenon (that is, not\nanalogous to the human revolution, which came \"out of Africa\") but a global one, from which\nEurope happened to be in the best position to benefit. In other words, Christian is arguing that\nhistory works differently than it used to because it has become global history. Keep this\nhypothesis in mind as you read this and following chapters: are you persuaded? (351)\nThe main problem, he writes, is to account for the sudden, global acceleration in innovation,\nwhich made it possible for civilizations to break out of the Malthusian cycles of lagging\n\nproductivity (as discussed in the last chapter). On the other hand, it makes contemporary\ncivilizations vulnerable to business cycles caused by overproduction: keep this in mind as we\ndiscuss the possible \"collapse\" or \"crash\" of 20th century American power. (352)\nThereafter Christian walks us through the various explanations for the Modern Revolution, in\neach case telling us why he finds them inadequate (not necessarily wrong, but not sufficient\neither):\n--demography\n--geography (in the sense of resource availability, such as fossil fuels)\n--ideals and inner motivations (e.g. Max Weber's thesis)\n--commercial exchanges (e.g. Adam \"Smithian\" emphasis on markets fostering division of labor\nand thus innovation)\n--social structure (e.g. Karl Marx on modes of production that promote innovation by\nconcentrating wealth in the hands of a few, who benefit from the profits when new techniques\nare introduced, while leaving many people without means of production and so forced to sell\ntheir labor)\nThis review of causes of modernity gives you a brief introduction to some of the most influential\nsocial theorists of modern times (Weber, Smith, Marx, with living social scientists like Giddens ,\nWolf, and Mokyr in supporting roles). Make sure you understand their basic ideas of these\ntheorists. Note their approach to history: they are using historical evidence to understand the\norigins and workings of modern society works. What gets left out of their account? (352-360)\nThe chapter concludes as Christian tells us what he has told us and what he is going to tell us\n(\"signposting\"): he will present a synthetic global explanation for the Modern Revolution that\nincludes elements of the above plus an emphasis on an unprecedented global system of exchange\nin information/knowledge which favored the Atlantic shores of Europe and North America as a\nnew global hub. Just as he had described Paleolithic societies as being \"pre-adpated\" for\nagriculture, he will argue that western European societies were pre-adapted for\nindustrialization.(360-363)\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\nSTS.007 Technology in History\n\nFall 2010\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MITSTS_007F10_read14.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-007-technology-in-history-fall-2010/1669b43cca66fd0c784c83e368f4bbb0_MITSTS_007F10_read14.pdf",
      "content": "Reading Notes for Christian, Chapter 12, \"Globalization, Commercialization, Innovation\"\n\nThe first sentence tells you what this relatively long chapter is about. What are the three\ngeographic levels on which it describe this 700-year-long period of preparation? (364-66\nReview again the list of factors that Christian contends are the most important determinants of\nrates of innovation. (366-67)\nThe bulk of the chapter is devoted to two main periods within the seven-centuries covered in it:\n(1) the \"post-classical\" period, from ca. 1000 CE to the mid- 1300s, and (2)the \"early modern\"\nperiod, from around 1400 to 1700 CE. Why does Christian call these periods \"Malthusian\ncycles\"? (367; see also 403) How and why did the post-classical cycle end? (see also 370)\nWhile you are reading this chapter, note that Christian will often refer to \"revolutions\"\n(agricultural, commercial, etc.). However, in his summary at the end, he states that\n\"Nevertheless, no revolutionary changes occurred in this period.\" (403) How do you interpret\nthis seeming self-contradiction? How is he defining revolutions? Are they technological,\nhistorical, or both?\nAlso note his constant emphasis on the ultimately global scale of \"truly\" revolutionary change:\nglobal changes caused \"the rise of Europe\" as a world power, rather than European-generated\nchanges causing global ones. Christian stresses that this is a relatively new view of history (both\nEuropean and global; see esp. 403-04).\nWhat are some improvements in agricultural technologies in the post-classical period? (367-68;\nalso 376) what are some important developments in population, urbanization, and\ncommercialization? (368-69)\nHow was the Islamic world an important hub for the post-classical networks? Where was its\ncenter of gravity, and how did this shift during this period? What is \"Southernization\"? (371-72)\nWhat is the effect of increasing commercially-generated wealth on political organizations (who\nconstitutes the elite, how the state generates wealth for itself, how states interact)? (372-73)\nChristian spends quite a bit of time describing China under the Song dynasty: why do you think\nhe does this? What are some technological improvements made in China during this period?\nWhy did China nevertheless retreat from global trade networks and fail to develop an industrial\nbase? (374-80)\nChristian then turns his attention to the early modern period. The defining and unprecedented\ncharacteristic of this period is the coming together of previously separate world zones into a\nsingle global exchange system. What things were exchanged? Why does the greater size of the\nexchange network increase its dynamism? its disparities between rich and poor? (380-84; see\nalso 400)\n\nChristian argues that despite the energy jolt of this new global system, beyond a few areas,\ntechnological innovation remained \"sluggish.\" How does he explain this? Which geographical\nareas were dominant during the early modern period? (384-86)\nWhat are two ways in which societies become more commercialized in the early modern period?\n(386) Give some examples of ways that rural areas can be commercialized. (387-89)\nIn the next section Christian presents his analysis of reasons for Europe's rise to dominance by\nthe end of the early modern period. How did the creation of a global network of exchanges alter\nthe \"topology\" of exchanges? In particular, how did the Atlantic basin become such a newly\nimportant hub? Christian looks back to the example of Sumer, ca. 3000 BCE, as another\nexample of a world region that becomes a vital hub. How is this explanation different from ones\nthat depend on \"exceptionalism\"? Does this analysis of emerging hub regions suggest how to\ninterpret contemporary changes in the balance of international trade and power? (389-90)\nIf European societies were not exactly \"exceptional,\" they were still (Christian contends)\n\"preadapted\" to playing a leading role in the new global commercial system. What are two ways\nin which they were favorably disposed to do this? (391-92)\nWhat are some of the kinds of information that were exchanged, with significant results, in the\nearly modern period? Note the reference to Margaret Jacob's work on this question. What are\nsome intellectual and cultural characteristics of Europe that both contributed to and strengthened\nits new role as a sort of global clearinghouse for new information? (393-94)\nAs global exchange systems strengthened, how did this change the economic base and attitudes\nof the traditional elites who lived off \"tribute,\" i.e.rents for land? What are mercantilist policies?\nHow did military organization change as states became more commercializezd? (394-7)\nNow we move to factors that began to break up human ways of life that had been taken for\ngranted for thousands of years--most notably the expectation that most people would till the\nsoil; that producing food to eat would be the primary form of labor; and that cultivation and\npasturage would be the primary uses of the earth. How did these expectations begin to change?\nWhat were the sources of pressure making them change? (398-400)\nWhat do you think of the electrical analogy attributed to Karl Marx to explain the way that\ncapitalist systems changed behavior and attitudes in widespread and powerful ways? (400-401)\nChristian now summarizes the significant transformations of the world during this 700 year\nperiod and also the limits on these transformations. How is the percentage of population \"living\non and off the land\" a critical threshold? (401-03) When he concludes that \"no revolutionary\nchanges occurred in this period,\" what does he mean?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\nSTS.007 Technology in History\n\nFall 2010\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MITSTS_007F10_read15.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-007-technology-in-history-fall-2010/ab5d12bae31d048a71105f908f8a6719_MITSTS_007F10_read15.pdf",
      "content": "Reading Notes on David Christian, Maps of Time, Chapter 13, \"Birth of the Modern World\"\n\nTo begin with terminology: Christian refers to the \"Modern Revolution\" that has transformed the\nworld in the last 250 years. How is the Modern Revolution a more encompassing concept than\nwhat is usually called the Industrial Revolution? What other types of changes does it include\nbesides economic ones? (See p. 437, as well as the overall organization of this chapter.)\nAccording to Christian, is industrialization the material \"substructure\" of the other elements of\nthe Modern Revolution? (409)\nWhy does Christian believe that the economic changes associated with industrialization deserve\nto be called revolutionary? (410-411; also tables on pp. 407-09)\nTake some time to look at the tables on pp. 407-409. What are some things you notice about\nthem? How is this a different way of representing history in symbolic form than the \"chart of\ncivilizations\" we studied in our first class meeting?\nWhat is the geography of industrialization and modernity: are they regional (Western European)\nor global or both? (409-410) What are some examples of the \"soft power\" of now-global\nmodernity? (410) Why does Christian turn to Britain to trace the early stages on\nindustrialization? (411) What economic factors besides industrialization were involved in the\nBritish economic revolution? (411-412)\nWhat does Christian mean by Britain's \"pre-adaption\" as a commercial society? Do you consider\nthis a sufficient explanation of the role of cultural history in the British Industrial Revolution? Is\nit compatible with Margaret Jacobs' analysis of the scientific roots of industrialization? (412-13)\nHow was British agriculture transformed by commercial capitalism in the centuries preceding the\nIndustrial Revolution? We recently discussed \"the tragedy of the commons\" in connection with\nthe challenges of managing commonly-owned land and other resources. How were commonly\nheld lands dealt with in Britain in the years preceding and during the Industrial Revolution?\n(414-415)\nNote that Christian typically describes social inequalities with the metaphor of \"gradient\" rather\nthan in the concept of class. What do you think of this metaphor as he uses it to describe the new\ninequalities that came with the Modern Revolution in agriculture? (415; see also 428-29 for his\ndiscussion of the role of the state in maintaining social inequality) You might look back to his\ndescription of the much earlier \"gradient of wealth and power in large agrarian communities\" for\npurposes of comparison/contrast. (264-267)\nWhat are some ways that British agriculturists raised productivity significantly without striking\ninnovations in machinery or chemistry? (416-17)\nWhat changes in the marketing of agricultural goods intensified the changes in land ownership\nand management? How does Christian summarize four social and commercial changes that \"pre-\nadapted\" Britain for a leading role in industrialization? (417-18)\n\nIn these industrial changes, trace the intertwining roles of new energy sources, mechanization of\nproduction, and new management techniques (419-21)\nOn pp. 422-23 Christian presents a traditional account of the technical core of the Industrial\nRevolution (especially the figures, showing Watt's crucial inventions). On pp. 423-26 he\npresents a less traditional account of the wave of innovation, which emphasizes the role of\nanonymous artisanal skills and also the general shaping forces of global capitalism. Do you find\nthese accounts compatible or conflicting? Does the discussion of the relationship between what\nwe now call \"science\" and \"technology\" in early industrialization seem compatible with what we\nlearned about the French Encyclopedie edited by Diderot and d'Alembert? (424)\nWhat is the relationship between political and economic revolutions? More specifically, what\nnew roles for the state, and sources of power for the state, emerged in the l8th and l9th centuries?\nHow does the modern state try to balance regulation and support of its citizens? Of economic\nactivity in general? (426-30)\nWhat is the role of warfare in the transformation of state power? (426-29) Note in particular\nreferences to the American Civil War as the first \"industrialized\" war (429, 434), as this will be\nthe topic of Prof. Smith's presentation in our next class.\nChristian returns to the theme of the relationship between \"science\" and \"technology\" in his\ndiscussion of the cultural revolution associated with industrialization. How does he describe and\nexplain \"Science's grip on modern culture\"? (432) Does he assume this means a decline in the\n\"grip\" of religious faith? What other cultural changes does he emphasize? (430-32; also 438)\nWhat are some limitations and reservations what Christian acknowledges regarding the term\n\"revolution\"? (432) Despite them, how did the Modern Revolution sweep around the globe from\nits origins in Western Europe? What are some of the major waves in this process? (433-35)\nWhat were the overall effects of this global transformation on other parts of the world? When\nand how did the so-called Third World appear? How does its appearance modify prevailing\nconcepts of historical progress? How does the \"gradient\" of inequality within states become\nplayed out as a gradient among them?(435-36; 438)\nWhat are some new forms of industrial organization emerging in the l9th century? How do they\nsuggest a possible blurring of the roles of economic and political powers? (434) What is the\nparadox of economic development when it is undertaken by a \"traditional\" tributary state? (436-\n37)\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\nSTS.007 Technology in History\n\nFall 2010\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MITSTS_007F10_read17.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-007-technology-in-history-fall-2010/2ade90a6da7417d69391a1908596b679_MITSTS_007F10_read17.pdf",
      "content": "STS.007 Fall 2010\nClass 17 Questions for discussion\n\nQuestions on Schivelbusch, The Railway Journey\n\nThe subtitle of the book is The Industrialization of Time and Space in the 19th Century. What\ndoes Schivelbusch mean by this? How does his use of the term \"industrialization\" in the context\nof world experience suggest some reasons for the emergence of the word and concept\n\"technology\" about the same time?\n\nThe epigraph at the beginning of the chapter, by RalphWaldo Emerson, begins \"Dreamlike\ntraveling on the railroad.\" What does Emerson mean by this? Why does Schivelbusch quote it in\nthis prominent position? How are \"dreamlike\" and \"industrialization\" connected? (Note that the\nquote from \"an American traveler\" of 1853 also emphasizes the dreamlike quality of railway\ntravel.)\n\nWhat are some characteristics of railway travel that Schivelbusch emphasizes?\n\nWhat are some characteristics of travel by air that you would emphasize, if you were writing a\nsimilar study of airplane journeys?\n\nOf automotive travel?\n\nOf bicycle riding?\n\nWhat other things about this chapter especially impressed you--because they surprised you, or\nbecause they confirmed similar experiences you have had, or because they caught your attention\nfor any other reason?\n\nQuestions on Schivelbusch, Disenchanted Night\n\nThe subtitle of the book is The Industrialization of Light in the 19th Century. What does\nSchivelbusch mean by this? How does his use of the term \"industrialization\" in the context of\nworld experience suggest some reasons for the emergence of the word and concept \"technology\"\nabout the same time?\n\nHow does Schivelbusch contrast 19th century and 20th century modes of illumination? What does\nhe mean by claiming that with the tungsten filament \"Twentieth-century illumination had\nbegun\"?\n\nThere is the electric lamp, and then there is \"Electrification\" (section beginning on p. 64). What\nis the distinction between them? How may a similar distinction be applied to other developments\nin technological history?\n\nSchivelbusch suggests that there is an analogy between the dominant technological system of the\nday (electrical networks) and the prevailing social philosophy. How are they similar? Do you see\nany similarities between prevailing social philosophy today and the dominant technological\nsystem of the internet?\n\nOnce again, as with the railway journey, new technologies make possible new sensory\nexperiences. What are some of the most important media of illusion for which light began to be\nused in the l9th century? What other new light-based experiences emerged in the 20th and 21st\ncenturies? Do you believe they are radically different from those discussed in the selection from\nSchivelbusch, or are they more or less extensions of l9th century ones?\n\nOnce again (as in his chapter on the railway journey) Schivelbusch refers to the dream world\nmade possible through modern technologies. Compare his discussion of the way darkness\nheightens individual perceptions (at the end of the book. p. 221) with the way early humans used\nlamps and created images in the darkness of caves to stimulated experiences beyond the range of\nordinary consciousness. Are there any contemporary sites and situations that are designed to\nhave similar effects on human consciousness?\n\nWhat other things about this chapter especially impressed you--because they surprised you, or\nbecause they confirmed similar experiences you have had, or because they caught your attention\nfor any other reason?\n\nQuestions on Chapter I (Bourgeois and Proletarians), Manifesto of the Communist Party (1848)\n\nHave you ever read anything remotely resembling this manifesto? In particular, have you read, or\ndo you know of, other manifestos? If you were to write one, what would it proclaim?\n\nWhat are the main historical events that Marx and Engels claim, in the Manifesto, to have led to\nthe replacement of feudal society by industrial society?\n\nThe Manifesto claims that there are three revolutionary facts in the world of 1848: the\nreplacement of manufacturing by Modern Industry; the replacement of the industrial middle class\nby wealthier and more powerful industrial millionaires; and the emergence of a world market.\nWhat are the comparable revolutionary facts of the world of 2010?\n\nThis sentence -- \"All that is solid melts into air, all that is holy is profaned, and man is at last\ncompelled to face with sober senses his real conditions of life, and his relations with his kind\"--\nis one of the most famous of the l9th century. Why? Read it in context (going back to where the\nbourgeoisie is introduced as a \"revolutionary\" class, and forward to where it is claimed that \"it\ncreates a world after its own image\") and explain what this means. What is the attitude of Marx\nand Engels regarding this revolutionary class?\n\nMuch of this chapter is devoted to a discussion of the world-changing powers of the bourgeois\nclass. How does this discussion resemble current talk of \"globalization\"? How is it different?\n\nThe bourgeoisie create immense and hitherto unknown forces of production. They also create\nimmense and hitherto unknown dangers and crises. What are some of those dangers and crises?\nHow will it all end, according to Marx and Engels?\n\nHave you ever read anything like this Manifesto? What elements of it seem outdated and\nirrelevant to the present? What elements seem to have more lasting value and relevance?\n\nWhat other things about this chapter especially impressed you--because they surprised you, or\nbecause they confirmed similar experiences you have had, or because they caught your attention\nfor any other reason?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\nSTS.007 Technology in History\n\nFall 2010\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MITSTS_007F10_read20.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-007-technology-in-history-fall-2010/cd2316595863e51965db3de46e7bcb48_MITSTS_007F10_read20.pdf",
      "content": "STS.007 Fall 2010\nReading questions for Christian, Maps of Time, Chapter 14\n\nFrom the perspective of \"big history,\" what are some of the most important events of the 20th\ncentury? (440)\nHow is the Modern Revolution a \"phenomenological one,\" i.e. one in which the frameworks of\nexistence -space and time--have changed? Recall that the subtitle of Schivelbusch's book The\nRailway Journey is \"the industrialization of time and space in the 19th century,\" and recall also\nthe description in the Communist Manifesto that \"all that is solid melts into air....\" Does this\nsuggest that time and space began to be compressed/expanded before the 20th century?\nAccording to Christian, what is distinctive about the way they have changed in the 20th century?\n(440-42)\nHow has world population grown in the 20th century? (442-43 including table on 443)\nHow has world production grown in the 20th century? (444-46) What does the table on p. 445 tell\nyou about the organization of production in the 20th century?\nWhat are some of the largest and most obvious \"waves of innovation\" in the 20th century? What\nassumptions are made when the role of technology in history is described in this way? (442-44)\nCompare capitalist cycles of over-abundance with Malthusian cycles of scarcity. Have the\nformer displaced the latter or do they coexist, perhaps in new combinations? How do they result\nin new ways of thinking about history itself (to paraphrase Hobsbawm, p. 442)? How do they\nresult in new roles for governments? For non-governmental corporations? (refer back to table on\np. 445) How is \"tribute\" exacted in the age of consumer capitalism?\nWhat are some of the ethical and behavioral changes that have emerged in an age of consumer\ncapitalism? (447-48)\nAccording to Christian, what is the historical relationship between equality and productivity in\nmodern capitalist societies? Do you find his analysis convincing? What evidence does he provide\nof inequities within and among nations? What is the direction of change in equity of distribution?\nCan you imagine a role for \"technology in history\" that alters the current trend towards greater\ninequity? If so, what would that role be? (448-51, including tables on p. 450 and 452)\nThe \"creative destruction\" of capitalism (Schumpeter's expression) continues to render extinct\nlong-established ways of life. What are some of them? What others would you add from your\nown experience of knowledge? (451-54)\nHow has capitalism also rendered extinct, or nearly so, traditionally organized tributary empires?\nWhat are some examples? How does Christian explain his paradoxical listing of Communist\nempires under this heading? Do you find his analysis persuasive? Can you think of other parts of\nthe world where governments are not primarily organized around capitalist methods and values?\n(454-57)\n\nHow do the war-related conflicts of the 20th century compare with such conflicts in earlier\ncenturies? Consider how this analysis connects with what we learned about the American Civil\nWar as an \"industrial war.\" What are Christian's predictions regarding the future of warfare?\n(457-59)\nHow does Christian measure and summarize changes in the relationship between humanity and\nour home planet in the 20th century? What are some of the obvious critical limits that need to be\ndealt with in the 21st century? How do you find yourself reacting to this summary of serious\nproblems? What is the role of \"technology\" in addressing them? What other forms of creativity\nare needed? (459-63)\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\nSTS.007 Technology in History\n\nFall 2010\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}