{
  "course_name": "Technology and the Global Economy, 1000-2000",
  "course_description": "This seminar examines the global history of the last millennium, including technological change, commodity exchange, systems of production, and economic growth. Students engage with economic history, medieval and early modern origins of modern systems of production, consumption and global exchange. Topics include the long pre-history of modern economic development; medieval world systems; the age of discovery; the global crisis of the 17th century; demographic systems; global population movements; the industrial revolution; the rise of the modern consumer; colonialism and empire building; patterns of inequality, within and across states; the curse of natural resources fate of Africa; and the threat of climate change to modern economic systems. Students taking the graduate version complete additional assignments.",
  "topics": [
    "Humanities",
    "History",
    "African History",
    "American History",
    "Medieval History",
    "World History",
    "Humanities",
    "History",
    "African History",
    "American History",
    "Medieval History",
    "World History"
  ],
  "syllabus_content": "Course Meeting Times\n\nSeminars: 1 session / week, 3 hours / session\n\nPrerequisites\n\nThere are no prerequisites for this course.\n\nCourse Description\n\nThis course is a graduate / advanced undergraduate reading seminar in the global history of the last millennium, with a particular focus on technological change, commodity exchange, systems of production, and economic growth. This course will be of interest to students wanting to engage with core problems in economic and global history, particularly the medieval and early modern origins of modern systems of production, consumption and global exchange. Topics covered will include the long pre-history of modern economic development; medieval 'world systems'; the 'age of discovery' both east and west; the global crisis of the 17\nth\ncentury; demographic systems and global population movements; the industrial revolution and its discontents (both of its participants and its historians); the rise of the modern consumer; colonialism and empire building; patterns of inequality, within and across states; the 'curse' of natural resources and the fate of Africa; and the threat of climate change to modern economic systems. Participants will have the opportunity to explore in depth a major controversy in global economic history or the history of technology, but will also become familiar with the range of debate that informs current research and teaching across a variety of sub-fields in medieval, early modern and modern history more broadly. Participants will also review the range of methodologies available to explore these questions as they prepare for their own research projects.\n\nParticipants are expected to engage actively in the weekly seminar, to write short responses to the readings for each session, to prepare at least once for leadership of the seminar discussion, and to produce a substantial work of original scholarship as a culminating exercise. The final project could take the form of an extended review essay of a major debate in the field, or a research project centered on an archival body of evidence that would further inform a topic covered by the course.\n\nGrading Policy\n\nACTIVITIES\n\nPERCENTAGES\n\nWeekly reading responses\n\n25%\n\nBook reviews (2)\n\n30%\n\nClass discussion\n\n15%\n\nHistoriographical essay\n\n30%\n\nFor more information on the class activities, see the\nAssignments\nsection.",
  "files": [
    {
      "category": "Resource",
      "title": "21H.383F16 Technology and the Global Economy - Sample Book Review: Poverty of Clio",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-383-technology-and-the-global-economy-1000-2000-fall-2016/6e6b3493352dc1d88706eb6f8eb111ef_MIT21H_383F16_PovertyClio.pdf",
      "content": "Francesco Boldizzoni, The Poverty of Clio: Resurrecting Economic History (2012), xi + 216 (Princeton\nUniversity Press, Princeton, £27.95/$39.50).\n\nFrancesco Boldizzoni does not like cliometrics. This much the title of his book makes clear. His principal\nobjection is that it examines the economic past only through such numerical data as can be extracted\n(by others) from the sources or synthesized from bits and pieces of information and the application of\nmodels taken from neoclassical economics, especially as those are devised in the Anglophone academy.\nHe categorically denies the assumption, which he sees as basic to cliometrics, that the laws of\nneoclassical economics -‐-‐ based on rational choice and maximization operating in well-‐developed\nmarkets - can apply to societies other than those of the capitalist West in the modern era. Instead, he\nsees the workings of economies as determined by social, political, and cultural conditions specific to\neach society and time period. Parallel to this view, he asserts the primacy of inductive as opposed to\ndeductive reasoning in building explanatory schemes for historical research. Finally, on those historians\nwhose methods he deems sufficiently inductive, and whose findings he deems sympathetic to the mores\nof past societies, he confers the label 'authentically moralistic', suggesting perhaps that the\ncliometricians are not just wrong, but lacking in moral fiber as well (p. 67).\nIn Boldizzoni's characterization, the assumptions and methods behind the cliometric approach are not\njust a convenient excuse for the ignorance of context, but also the instruments of a perverse kind of\nintellectual hegemony. Indeed, the way he sees it, the cliometrician's aim is more to demonstrate the\nsuperiority of economic theory and econometrics over 'softer' social science than to elucidate any\naspect of actual history. As William Parker, himself a cliometric pioneer, once said: it amounts to\n\nshowing that 'the market did it again'.1 This reproach, by the way, applies at least as much to the New\nInstitutional type of economic history as to the more explicitly econometric work of the earlier\npractitioners. Economic imperialism also has an ideological dimension, of course. Not only has the\nmarket been at work since time immemorial, but economic progress is due mostly to removing the\nfetters that kept it from functioning at full capacity, foremost among these the lack of well-‐defined, far-‐\nreaching, and secure property rights.\nNow many of the criticisms Boldizzoni levels at cliometrics, though often reductionist, are not new, nor\nare they without merit. They have been part of the discourse in economic history since the beginning of\nthe movement. Indeed, the Nobel Prize winning economist Robert Solow worried nearly thirty years\nago already that 'economic theory [would] learn nothing from economic history' and that economic\nhistory in turn would be 'as much corrupted as enriched by economic theory'.2 Moreover, it is\nreasonable to believe that scholars trained as economists and employed in departments of economics\nhave embraced cliometrics not only because it was congenial to their training but also to be in good\nstanding with influential colleagues who viewed economic history as suspiciously lacking in rigor. An\nearlier practitioner of the history of economic growth, the Marxist Paul Baran, used to say that\nneoclassical economics looks for exact answers to small and not overly interesting questions. Deirdre\nMcCloskey has argued this point more forcefully than perhaps anyone else across numerous\npublications, yet this work merits no mention here.3 Fortunately though, the characterization of small-‐\nmindedness does not actually apply to the recent revival of interest in the onset of modern economic\ngrowth in the West, for which Boldizzoni reserves some of his sharpest criticism. Still, it is refreshing to\n\n1 Reported in J. Mokyr's review on EH.Net of J. W. Drukker, The Revolution that Bit its Own Tail: How Economic\nHistory Changed our Ideas on Economic Growth. Amsterdam: Aksant, 2006, and cited in the present book.\n2 From a talk first presented at the 1984 meetings of the American Economics Association and published in,\n\"Economics: Is Something Missing?\" in William Parker, Economic History and the Modern Economist, Basil\nBlackwell, 1986: 21.\n3 The theme of the small-‐mindedness that lies behind many economic applications of statistical significance is a\nrecurrent one in McCloskey's work. For an excellent summary of her position see in particular, The Vices of\nEconomists; The Virtues of the Bourgeoisie, Amsterdam University Press, 1997.\n\nread someone who appreciates certain earlier and alternative traditions, such as the work of the\nAnnales School and even the old German historical school typified by Werner Sombart.\nThe problem with this book is that its sometimes reasonable and even accurate critique of cliometrics\n(broadly defined) is marred by a pervasive and almost personal anti-‐Americanism. Now this too goes\nback a long way in the culture of European intellectuals, but one rather thought it had been put to bed\nalongside reflexive Marxism. For Boldizzoni, cliometrics is more than just bad. It is a poison that\nthreatens to infect and destroy economic history on the other side of the Atlantic, where cliometric\nscholarship is increasingly practiced and appreciated. What he does not say but could, is that the\nalmost total domination of the English language in scholarly discourse, as well as the preponderance of\nAnglophone universities among the global elite of institutions, probably give their scholars\ndisproportionate influence.\nA few examples will show that the accusation of bias is not merely a defensive move on the part of this\nreviewer, situated as I am in an American department of history. Boldizzoni extends his criticisms\nbeyond the narrow circle of cliometricians to include respected (American) historians whom one can\nhardly accuse of ignoring the context of their object of study. Joel Mokyr and Jan de Vries, who both\ngarner serious criticism in this book, have in fact written widely and deeply about the impact of ideas\nand values on processes of economic and social change. Boldizzoni also sins by omission. The works\ncited approvingly are (as he admits) almost all European. But why ignore or dismiss with a quip such\nscholars as David Landes, or Deirdre McCloskey if one wants to highlight the role of culture in economic\ndevelopment? Or, to take another example, why cite the European study led by Richard Bonney on the\npositive role of the state in economic development and ignore completely the carefully nuanced work of\nPeter Lindert on the same subject? Boldizzoni's book offers us an impassioned plea for good (virtuous\neven) scholarship, but surely such a standard must be applied reflexively. What can possibly be the\n\nscholarly value in fabricating a quote (complete with quote marks to set it off from the author's own\nvoice) attributed to a hypothetical practitioner of the cliometric (dark) arts, which is then denounced for\nboth its content and logic (p. 34). This kind of argument seems to me irresponsible at best, and at worst\na cheap rhetorical trick.\nIt is ironic that Boldizzoni calls for social science history (SSH) to come and rescue the field from the\nevils of cliometrics, since the European institutionalization of SSH is so clearly modeled on the American\nSocial Science History Association, active since the mid-‐1970s. One can, of course, question whether\nthis model does very much to counter the natural silo shape of scholarly discourse, particularly since the\nmeetings of both groups must constantly struggle to promote the mixing of disciplines. Working against\nthem is the understandable difficulty involved for any scholar to venture too far beyond her or his\nestablished area of expertise. The other leg on which his positive agenda rests is the holding-‐up (one\nmight go so far as to say the reification) of the inductive method as a way to re-‐anchor economic history\nin the solid field of 'value-‐free' facts (p. 82). Yet one is reminded in this regard of the Nobel Prize-‐\nwinning biologist Sir Peter Medewar's famous essay titled 'Is the Scientific Paper a Fraud', in which he\neffectively puts to rest any expectation that human inquiry of whatever kind can ever base itself\nentirely, or even primarily, on the observation of evidence acquired without some prior reliance on\ntheory.4\nIt is generally true on both sides of the Atlantic that the fuss over cliometrics has died down. For one\nthing, Boldizzoni ignores the large portion of economic history in America that was not mainly cliometric\nall along, although it is true that cliometric work generally received the most attention. Good scholars,\nnow as before, use quantitative techniques, from statistical regression to GIS, to complement historical\nmaterials and help organize them into a cogent argument, not to disguise ignorance or worse, ill-‐\n\n4 Peter Medewar, \"Is the Scientific Paper a Fraud?\" The Threat And The Glory : Reflections On Science And\nScientists. HarperCollins, 1990.\n\nintentioned agendas. And even cliometricians are encouraged by good critics and editors to translate\ntheir assumptions, techniques, and findings into intelligible prose. Having said that, it remains hopeful\nthat academic departments of both economics and history are now gradually turning away from the\nmethodological exaggerations of the recent past and moving toward more common ground. Despite its\nadmirable call for economic (but I would add all) historians to pursue the highest standards of best\npractice, this book will not be of much help in pushing the process along.\n\nAnne EC McCants\nMassachusetts Institute of Technology\n\n1393 words\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n21H.383 / 21H.982 Technology and the Global Economy, 1000-2000\nFall 2016\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "21H.383F16 Technology and the Global Economy - Student Example: Essay - Built for Success",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-383-technology-and-the-global-economy-1000-2000-fall-2016/8fbb898b89a5344c30861abdd5e82e75_MIT21H_383F16_BuiltSuccess.pdf",
      "content": "Built for Success: Organizational Structure and the\nGreat Divergence\n\n12/20/2016\n\nMIT Student\n\nI. Introduction\nOne certainly cannot say that historians lack for ideas on what caused the East and West\nto diverge economically. These explanations range from the philosophical (Weber and\nCalvinism), to the practical (Pomeranz's \"coal and colonies\") and even the mundane (Mokyr's\nanalysis of calorie intakes, for instance).1 Yet, though the reasons for the divergence may differ\ngreatly, the results have been much nearer to compliments than substitutes. By identifying key\neconomic, political, and geographic differences between the East and West and tracing the\nresulting effects forward in time, historians have developed a rich understanding of the linkages\nbetween various social forces, much to the betterment of the discipline. Ultimately, the result has\nbeen less of a cacophony of scholarship, then a sort of un-orchestrated harmony. But, it would be\nremiss to claim that the value of this scholarship is limited to the narrow question of \"East verses\nWest\". Indeed, one of the great benefits of this line of research has been the light it has shed on\nthe questions of economic growth more generally. In looking for reasons the West outpaced the\nEast (as of the 20th century, a 21st century scholar must caveat hastily), historians have been able\nto conceptualize the levers of economic growth much more broadly than our economist\ncounterparts, and in so doing, offered a much richer explanation for development. Though\nexamples abound, one recent example illustrates the point par excellence. In the recent\ncompletion of her magnum opus, Deidre McCloskey shows not only that the widening of social\nnorms to allow others to \"have a go\" was important for the Great Divergence, but also that this\nlever (if you will) continues to be important even in the present.2 And, though certainly many\n\n1 Weber, Max. \"The Protestant Ethic and the Spirit of Capitalism.\" (1930), Pomeranz, Kenneth. The Great\nDivergence: China, Europe, and the Making of the Modern World Economy. Princeton University Press, 2009, And\nKelly, Morgan, Joel Mokyr, and Cormac O'Grada. \"Roots of the Industrial Revolution.\" UCD Centre For Economic\nResearch Working Paper Series (2015).\n2 Though I am referencing her three-volume set \"Bourgeois Values\", she contextualizes her argument in the field\nhere: McCloskey, Deirdre Nansen. \"It was Ideas and Ideologies, not Interests or Institutions, which Changed in\nNorthwestern Europe, 1600-1848.\" Journal of Evolutionary Economics 25, no. 1 (2015): 57-68.\n\nwould disagree with her conclusion, it would be difficult to claim that this type of research has\nbeen anything less than tremendously beneficial for the field.\nThough much less ambitious in scope than McCloskey's three volumes, this small paper\nseeks to continue in the vein, looking to understand the role of organizational structure in the\neconomic trajectories of the West and East. It is important here to be very clear on what is meant\nby organizational structure: by \"organizational structure\", I mean here what the sociologists\nHannan and Freeman refer to as being \"...[C]omposed of hierarchical layers of structural and\nstrategic features that vary systematically in flexibility and responsiveness.\"3 In other words, I\nrefer here to how authority was organized within the organization, formally and informally. I do\nnot mean simply the \"corporate\" structure, or the importance of equity markets. On these points,\nRosenberg and Birdzell have written an excellent volume that I seek only to add to here. 4 The\npoint of this enquiry is to understand what was gained or lost in the managerial structure of\ncommercial firms in the East and West, and not in the capital structure. Additionally, I must\nunfortunately shrink the scope of this paper further to focus on China and Britain. Not only does\nthis give the poor reader some respite from a smaller size, but in so doing allows me to compare\nthe best of both respective worlds in respect to economic development before the \"Great\nDivergence.\"5\n\nII. History of the Corporation in Britain\n\n3 Hannan, Michael T., and John Freeman. \"Structural Inertia and Organizational Change.\" American Sociological\nReview (1984): 156.\n4 Rosenberg, Nathan, and Birdzell LE Jr. How the West Grew Rich: The Economic Transformation of the Industrial\nWorld. Basic Books, 2008.\n5 See Pomeranz, Kenneth. The Great Divergence: China, Europe, and the Making of the Modern World Economy.\nPrinceton University Press, 2009.\n\nFor a western audience, it is helpful to begin at the beginning of commercial organization\nin the West, which for Britain was (as with seemingly all things) the Romans. Contrary to the\nsentiment in many business schools, the corporation did not begin with Apple, nor even with\nGeneral Motors; even before even the 5th century, the Romans had anticipated the need for\nindividuals to jointly own property in order to run a commercial enterprise and developed the\nconcept of the \"collegium\" in their commercial code to do so.6 Though much less prominent than\nin our world today, Britain maintained this concept in its own legal code through the Dark Age\nand into the Medieval Age. Nonetheless, this is not to suggest the existence of some sort of\nmedieval New York Stock Exchange; there were no equity markets, stock quotes, or Citizen's\nUnited Super PACs. Rather, the purpose of the corporation until the 16th century was simply a\nlegal means of individuals uniting for purely commercial purposes. As will be illustrated below,\nhowever, one must not attach too much weight to \"simply\", however.\nDespite the legal existence of the corporation, before the Great Divergence, England was\na country of farmers. Though the corporate form existed, it was largely unused with the Limited\nPartnership the preferred form of commercial organization. The reason for this limited use was in\nlarge part due to the agrarian nature of Britain's economy. Until the 16th century, large\nbusinesses were unheard of, and households, typically rural households, performed most of the\neconomic activity. Thus, while the corporation existed, it was something of the medieval version\nof the unicorn.7\nThe concept of the corporation was greatly expanded in the 16th century, however,\nleading to a rapid rise in its popularity. With the creation of the chartered trading companies in\n\n6See Rosenberg, Nathan, and Birdzell LE Jr. How the West Grew Rich: The Economic Transformation of the\nIndustrial World. Basic Books, 2008.\n7 A unicorn in the contemporary world means a venture-capital backed firm worth more than $1 billion USD. They\nare quite rare, but certainly not non-existent, not unlike 13th century corporations.\n\nthe 16th century, citizens could become shareholders by buying equity in trading firms. This\npaved the way for equity markets, which became institutions unto themselves by the 19th\ncentury. Buying into trading companies became sound investment advice, as individuals from\nall walks of life became eligible (socially, though perhaps not financially) to buy-in.8 The first of\nthe trading companies was the Muscovy Corporation, created in 1555 to trade with Russia. It\nwould conduct long-distance trade with Russia profitably for nearly 100 years before closing its\ndoors, and was widely considered to have been an extremely profitable investment. The success\nof this early venture spawned others, including the Eastland Company (1579), the Africa\nCompany (1588), the Levant Company (1592), the East India Company (1600), and the Virginia\nCompany (1606).9 The legal form of the corporation would continue to be modified and updated;\nultimately, the chartered trading company gave way to the joint-stock company, which later\nbecame the corporation with us today. 10\nBut one must ask why, after a thousand years, were changes to the make-up of the\ncorporation required in the middle of the 16th century? The answer is that the chartered-trading\ncompany was the solution to a political puzzle for English (and Dutch) monarchs. While trade\nwas being conducted successfully with New World, it was not terribly profitable and could not\nbe done on a large scale before the chartered-trading company.11 While partnerships were\nsuccessful, they lacked sufficient capital to expand, requiring greater bureaucracy and buying\npower. Were the monarchs to simply let them continue, they risked their country being beaten in\n\n8 Chaudhuri, Kirti N. The English East India Company: The Study of an Early Joint-Stock Company 1600-1640.\nFrank Cass & Co, 1965, 33.\n9 Blackford, Mansel G. The Rise of Modern Business in Great Britain, the United States, and Japan. Univ of North\nCarolina Press, 1998, 22.\n10 Note that as I am interested in the organization of authority within the firms, I do not place a great emphasis on\nthe different types of corporations, e.g., the chartered-trading companies as compared to the joint-stock companies.\n11 Blackford, Mansel G. The Rise of Modern Business in Great Britain, the United States, and Japan. Univ of North\nCarolina Press, 1998, 53.\n\nthe international quest for world-trade domination.12 England and the Netherlands were\ndetermined not to cede control of key trade ports and each feared that without further\ncommercial capital, the other country might take the lead in trade and lock them out. The\nobvious solution was to grant one partnership a monopoly so that they could be guaranteed a\nprofit and thereby garner the capital to grow quite large. Not surprisingly, English people were\nnot keen on the idea of paying higher prices in the market to preserve the crown's image abroad,\nand therefore resisted calls for a monopoly. The chartered-trade company offered an elegant\nsolution, however, in that it diversified the ownership base, thereby allowing theoretically\neveryone to be a member.13 To this end, the chartered-trading company was quite successful.\nAs Irwin notes, though early voyages had struggle to break even (even assuming they made it\nback intact), the very first voyage of the East India Trading Company made a 95% profit.14\nWithin a short time, the ships would be bringing in over a million pounds of pepper alone into\nthe London market.15\n\nIII. History of the Corporation in China\nAcross the globe, Chinese economic activity looked very similar to Britain before 1600,\nsurprisingly so given the changes that unfolded shortly thereafter. China too had a vibrant market\n\n12 Irwin, Douglas A. \"Mercantilism as Strategic Trade Policy: the Anglo-Dutch Rivalry for the East India Trade.\"\nJournal of Political Economy (1991): 1299.\n13 Chaudhuri notes that there were classes of shares for a variety of groups, even orphans. Nonetheless, looking at\nthe legislated buy-in prices, one can't help but speculate that few orphans were able to invest. Nonetheless, while\nlikely not technically feasible, as a symbol of breaking social class boundaries, this was something of a progressive\nmove forward. See Chaudhuri, Kirti N. The English East India Company: The study of an early joint-stock company\n1600-1640. Frank Cass & Co, 1965.\n14 Irwin, Douglas A. \"Mercantilism as strategic trade policy: the Anglo-Dutch rivalry for the East India trade.\"\nJournal of Political economy (1991): 1299.\n15 Chaudhuri, Kirti N. The English East India Company: The Study of an Early Joint-Stock Company 1600-1640.\nFrank Cass & Co, 1965, 151.\n\neconomy for staples like grain, produce and textiles since the first Common Era,16 and like\nBritain, the vast majority of its business was done in small firms.17 Despite the periodic turmoil\nof war, Chinese peasants continued to be the backbone of the economy throughout what for\nEurope was the Dark and Middle Ages. Though data is scarce in these years, it is clear that even\nas late as 1700 80% of China's farmland produced grain, and that the average size of a farm was\nonly 5 acres.18 While these figures likely overstate the extent to which China was comprised of\nsmall farms during the pre-modern era,19 China's economic activity, much like Britain's,\nrevolved around small family farms.20 Land was even privatized, as it was the main basis of\ntaxation, accounting for nearly three-quarters of the government's revenue during the period.21\nThus, circa 1500 both Britain and China were agrarian based economies comprised primarily of\nsmall, family businesses with limited reasons to scale.\nIn contrast, the political realm looked very different in China during the medieval period.\nWhile Europe ricocheted from one war to the next, China remained relatively stable from the\nonset of the Tang Dynasty in the 7th century.22 Tang emperors were able to achieve nearly\nabsolute control, being largely insulated from internal wars and also from foreign competition.23\nRather than rest on their laurels, however, the Tang and Song dynasties (circa 900-1200) sought\n\n16 Brandt, Loren, Debin Ma, and Thomas G. Rawski. \"From Divergence to Convergence: Reevaluating the history\nbehind China's Economic Boom.\" Journal of Economic Literature 52, no. 1 (2014): 62.\n17 Pomeranz, Kenneth. The Great Divergence: China, Europe, and the Making of the Modern World Economy.\nPrinceton University Press, 2009, 164.\n18 Brandt, Loren, Debin Ma, and Thomas G. Rawski. \"From Divergence to Convergence: Reevaluating the history\nbehind China's Economic Boom.\" Journal of Economic Literature 52, no. 1 (2014): 52.\n19 China's population grew relatively rapidly during the time, meaning that the land per person ratio became small as\nthe denominator grew.\n20 This is not to say that there weren't significant differences in the crops produced and the methods, only that the\noverall structure of commercial activity looked quite similar.. For more details, see Morris, Ian. Why the West\nRules-for Now: The Patterns of History and what They Reveal about the Future. Profile Books, 2010.\n21 Brandt, Loren, Debin Ma, and Thomas G. Rawski. \"From Divergence to Convergence: Reevaluating the history\nbehind China's Economic Boom.\" Journal of Economic Literature 52, no. 1 (2014): 73.\n22 Ibid, 48.\n23 Ibid, 48.\n\nto build a strong government bureaucracy.24 They did so by creating a relatively meritocratic\nclass of scholar-administrators who governed each of China's 31 provinces.25 Not only were\nthese administrators selected on the basis of rigorous examinations (which, notably anyone could\ntake regardless of class or birth), but new administrators were moved to a different province than\nthe one in which they were born to prevent nepotism, under a law called \"the rule of\navoidance\".26 The importance of these administrators in China's economic development and\norganizational structures specifically is hard to overstate. The legacy of provincial rule by\nscholar-bureaucrats was immense, and its meritocratic image coupled with the tremendous\nauthority bestowed on key individuals meant the bureaucrats became ensconced in virtually\nevery aspect of the economy. While Westerners might be inclined to see economic activity as\nstarting with citizens and only being mediated by government, Ming and Qing China were the\nreverse; citizens could only take part in economic activity specifically sanctioned by the\ngovernment, all else was the emperor's domain. This would not change until 1904, when the\nCompany Law was passed in China that effectively granted citizens the right to any economic\nactivity not expressly regulated or prohibited by the emperor.27 Thus, while China did have many\nmarket institutions, Chinese law carefully circumscribed them. The net effect was that\ngovernment and economic activity in China were completely intertwined.\n\nThis resulted in significant differences in the legal form of commercial organizations.\nUnlike the corporate form that Britain inherited from the Romans, the Chinese did not have a\nmeans of individuals organizing strictly for commercial reasons. Nonetheless, they were not\nblind to the advantages of a division of labor and economies of scale, and therefore, began\n\n24 Ibid, 48.\n25 Ibid, 47-48.\n26 Ibid, 72.\n27 Faure, David. China and Capitalism: A History of Business Enterprise in Modern China. Vol. 1. Hong Kong\nUniversity Press, 2006, 46-47.\n\ncreating what Faure translates as \"trusts\" in the14th century to facilitate larger commercial\noperations. In a situation somewhat analogous to Britain's political puzzle regarding the\ncorporation, China's ubiquitous bureaucracy meant that business and law were never truly\ndistinct, and therefore, creating large-scale businesses meant developing a form that blended the\ntwo. This solution (which I also term trusts, to be consistent with Faure) was set up not as a\ncompany, but as a charity in the name of an ancient ancestor or god.28 Being something of a\nforerunner to the stakeholder movement of late, the purpose of these trusts was ostensibly not\nprofit, but rather a social good. To this end, they were formed with the ancient (i.e., deceased or\ndeity) individual as the \"owner\", but with a clear chain of command for administration\ncomprised of the heads of local families.29 Rather than keeping the residual of revenues minus\ncosts, \"profits\" took the form of payments out of the firm based upon inheritance rights, with the\nresidual going to the stated cause.30\nAs the mission of the organizations were charitable, they were meant to last forever, and\ntherefore, there revenue stream needed to do so as well. For this reason, to exist they would need\nto be recognized by the provincial bureaucracy and, conditional upon being recognized, would\nbe granted a monopoly on economic activity in a region or industry, or both.31 With the\nbureaucratic blessing, they could be run effectively as one would think of a utility company in\nthe U.S., generating a profit but carefully balancing that with the charter and obligations required\nby a close connection to government.\n\nThe trusts developed correspondingly very different management structures from a\nWestern corporation. While British merchants also had a government charter and were\n\n28 Ibid, 38.\n29 Ibid, 38.\n30 Ibid, 38.\n31 Brandt, Loren, Debin Ma, and Thomas G. Rawski. \"From Divergence to Convergence: Reevaluating the history\nbehind China's Economic Boom.\" Journal of Economic Literature 52, no. 1 (2014): 87.\n\nresponsible to shareholders, they were given a great deal of latitude in running the business.32 In\nChina, however, the charitable charge coupled with the pervasive influence of government meant\nsignificantly less leeway. A \"head merchant\" was put in charge of the organization, and this\nperson would have not just business powers but also legal ones, being able to fine and banish\nwayward underlings from the firm, and effectively, the industry.33 Managers and owners were\nnot distinct; families might come in and out of the organization as owners, however, those that\nowned the trust also worked as managers and overseers. This resulted in a pyramid structure in\nwhich the head-merchant was at the top, with managers, sub-managers and workers below him.\nBut, the middle-level managers had significant leeway, being owners themselves. Thus, while\ngreat care was taken not to offend the head merchant, there was little effort to centralize and\neconomize administrative procedures. At all nodes, decisions were made not based on expansion\nor productivity, but rather, based upon the preservation of the trust and respect for the\ninheritances.\nThe Chinese were even ahead of the British in developing the concept of shares. Using\nthis quasi-religious and political structure, a share system was developed to parcel the\nresponsibilities. During the Ming Dynasty, shares were developed which allowed families that\nwished to participate the lineages to purchase a position.34 As Faure argues, however, rather than\ntransforming the existing ownership structure into a more capitalistic framework, the shares\neffectively codified the existing one, simply demarcating who had been given positions in the\nlineages.35\n\n32 Guinnane, Timothy W., Ron Harris, and Naomi R. Lamoreaux. Contractual Freedom and the Evolution of\nCorporate Control in Britain, 1862 to 1929. No. w20481. National Bureau of Economic Research, 2014, 45.\n33 Brandt, Loren, Debin Ma, and Thomas G. Rawski. \"From Divergence to Convergence: Reevaluating the history\nbehind China's Economic Boom.\" Journal of Economic Literature 52, no. 1 (2014): 88.\n34 Faure, David. China and Capitalism: A History of Business Enterprise in Modern China. Vol. 1. Hong Kong\nUniversity Press, 2006, 40.\n35 Ibid, 53.\n\nChina ultimately did create a commercial code allowing for the joint-stock company, but\nonly in the late 19th century. Though evidence does suggest that trusts became increasingly less\nsacred over time,36 corporations as defined by Western standards did not truly exist until the\n1860s when Western firms began raising capital in China.37 This occurred largely as a result of\ntwo forces. First, after the Opium War of 1839-1842, China was forced to accept a number of\nport treaties with Britain, which effectively weakened Chinese control over the legal system in\nports with treaties.38 This allowed British firms in and emboldened them to begin raising capital.\nSecond, China might have been more concerned, but the Taiping Rebellion of 1850-1864 shook\nChina's confidence in government, leading to the \"Self-Strengthening Movement\" which sought\nto raise capital for enterprise in order to raise taxes and bolster Chinese defenses.39 As a result,\nBritish firms began raising capital in China, and in 1904, the Company Law was passed, giving\ncitizens legal right to whatever commerce was not already regulated, and allowing for the joint-\nstock form.40 This of course was not allowed to last very long, given the descent into\ncommunism in 1949.41 It would only be late in the 1970s before corporations could be formed\nagain within China.\n\nIV. Why did China Adopt the Corporation so Late?\n\nWhile there does not yet seem to be a consensus on why China was so late to\ndevelop the corporate form, but it does seem clear that the political pressures which\n\n36 See Pomeranz, Kenneth. \"\" Traditional\" Chinese Business Forms Revisited: Family, Firm, and Financing in the\nHistory of the Yutang Company of Jining, 1779-1956.\" Late Imperial China 18, no. 1 (1997): 1-38.\n37 Faure, David. China and Capitalism: A History of Business Enterprise in Modern China. Vol. 1. Hong Kong\nUniversity Press, 2006, 49.\n38 Brandt, Loren, Debin Ma, and Thomas G. Rawski. \"From Divergence to Convergence: Reevaluating the history\nbehind China's Economic Boom.\" Journal of Economic Literature 52, no. 1 (2014): 96.\n39 Ibid, 98-99.\n40 Faure, David. China and Capitalism: A History of Business Enterprise in Modern China. Vol. 1. Hong Kong\nUniversity Press, 2006, 46-47.\n41 Ibid, 67.\n\nnecessitated the form in Britain did not exist in pre-industrial China. The joint-stock form\ndoes not appear to have been something that Western countries developed purely for the\nsake of innovation, but rather as a solution to the political puzzle of world trade\ncompetition. Economists have previously argued that competition between European\ncountries drove innovation faster than it would otherwise have been, and the invention of\nthe corporate form seems to be another domain in which this occurred.42 In this\nperspective, one can see two missing geopolitical forces that might have led China to\ndevelop the joint-stock form. First, China lacked an interest in international trading ports,\nand was therefore not under any pressure to develop a trading company that could\noutcompete other countries. Not only did this mean that China did not have the incentive to\ncreate a trade monopoly as Britain the Netherlands would have, but it also did not need to\ncreate a means of raising capital as these firms required. Instead, it relied on a small army\nof \"junk traders\" that could procure odd items abroad, which met the political needs of the\nemperor.43 Second, and on a related point, the absolute control on the emperor on\neconomic life obviated the need for the corporation as a means of pacifying the citizenry.\nBecause the government controlled all economic life, business, law and religion were\ninextricably intertwined. Thus, the concept of impersonal business that was so critical to\nWestern development did not have an analogue in this context. As a result, the corporation\ncould not have made sense. This is a somewhat ironic point, given that the trust in China\ndid not allow for personal ownership; one might have though that this would have made\nthe salaried manager the de facto basis of the organization. The net effect was to bind\n\n42 For additional instances, see: Hoffman, Philip T. \"Why was it Europeans who Conquered the World?.\" The\nJournal of Economic History 72, no. 03 (2012): 601-633.\n43 Pomeranz, Kenneth. The Great Divergence: China, Europe, and the Making of the Modern World Economy.\nPrinceton University Press, 2009, 171.\n\nindividuals to their positions, however, because the legal system meant that their legal and\npersonal identity could not be divorced from the organization itself. As a result of these\ntwo factors, it becomes much more clear why the corporation did not appear in China.\n\nV. importance of Organization Structure\n\nAs promised above, I now return to the question of the capital structure of Chinese firms.\nThe claim of this paper is not that the capital structure was unimportant, but that it was not the\nonly important aspect of the commercial organization of firms. Lest we attribute everything\nbeneficial about Western organizational structure to equity markets, it is helpful to put capital\n(broadly) in its respective place. First, it must be noted that China was not without capital\nmarkets. In fact, contrary to popular imagination, the country now thought of as the last bastion\nof communism actually developed capital markets well before Britain. 44 This occurred in the\n14th century when the Ming emperors needed to bring grain to soldiers garrisoned in Northern\nChina but did not have the resources to purchase and transport the grain from the south.\nIngeniously, the emperor decided to leverage its monopoly in salt production to resolve the\nproblem. Thus, a policy was developed circa 1300 whereby a merchant willing to bring grain up\nto the northern border could exchange the amount of grain they brought for the ability to\npurchase and sell a set amount of salt. This right to buy salt (quite literally an option) could then\nbe sold back in the various locals.45 Second, the importance of capital is further bracketed by the\nlimited use of equity capital at the onset of the Industrial Revolution. While certainly, large,\nwell-funded corporations became synonymous with the industrialization toward the end of the\n\n44 Though certainly communism does not mean what it used to.\n45 Faure, David. China and Capitalism: A History of Business Enterprise in Modern China. Vol. 1. Hong Kong\nUniversity Press, 2006, 22.\n\n19th century, at the beginning of the 18th, these were relatively rare. It is worth quoting Pomeranz\nextensively here, as he makes the argument quite forcefully:46\n\nIt is even harder to see why Sino-European differences in capital costs or business\nforms should have been decisive for early mechanized industry. Most technologies\nof the early Industrial Revolution were cheap. Early textile mills did not require\nmuch fixed capital and were easily financed by family firms. The British coal\nindustry, which made possible the most important break with pre-industrial\nconstraints, raised its capital almost entirely from families and local contacts until the\nmid to late nineteenth century. The corporate form was almost never sued in these\nsectors of the early industrial economy.\n\nFaure too makes a similar case that business in 1750 China would have looked much like\nbusinesses in Britain at the time, absent the corporate form.47 China did in fact even have\nsome large firms, employing several hundred employees in the fishing and lumber\nindustries.48 Thus, if it is to be argued that organizational structure was important, as this\npaper hopes to do, it cannot be because of the capital it raised, but because of the structure\nof the firm itself.\n\nGiven these conditions, what possible effect could the structure of the large-scale\ncommercial form have had in contributing to the divergence of Britain and China? Here, I\n\n46 Pomeranz, Kenneth. The Great Divergence: China, Europe, and the Making of the Modern World Economy.\nPrinceton University Press, 2009, 181.\n47 Faure, David. China and Capitalism: A History of Business Enterprise in Modern China. Vol. 1. Hong Kong\nUniversity Press, 2006.\n48 Pomeranz, Kenneth. The Great Divergence: China, Europe, and the Making of the Modern World Economy.\nPrinceton University Press, 2009, 164.\n\nmake a two-step argument. First, I argue that the differences in structure led to a difference\nin strategy, counter to Chandler's famous maxim. Second, I claim that this difference\nstrategy, or more generally, management, meant that Chinese firms were ill-equipped to\nscale once big-business did become required, thereby contributing to the divergence of the\ntwo countries.\n\nThe structure of Chinese firms dramatically affected their strategy. Chandler of\ncourse famously argued that \"structure followed strategy\", meaning that a firm's goals\ndictated how authority would be divided in the firm.49 In this instance, however, the\nrelationship was symbiotic; having a different organizational structure affected the strategy\nof the firm by changing the incentive structure. As a result, not only were Chinese firms\nless efficient (as discussed below), but more specifically, they lacked knowledge of critical\nbusiness practices that became increasingly important during the 19th century. Thus, by not\ndeveloping management in the 16th and 17th centuries, China was not equipped to compete\nin the 18th and 19th centuries.\n\nFor this to hold, however, one must of course be convinced that management as a\nskill and a profession was truly practiced in Britain during the 16th and 17th century. Here\nagain, this paper runs foul of Chandler, who argued that management did not truly exist\nuntil 1850.50 Yet, there are two strong reasons to suggest that management was truly born\nout of the chartered trading companies that began in the 16th and 17th centuries. First: the\nnumber of transactions completed by these corporations was tremendously large.51 In order\nto purchase sufficient amounts of the commodities and then to sell them abroad, the British\n\n49 Chandler, Alfred D. \"Strategy and Structure: Chapters in the History of the American Industrial Enterprise.\" MIT\nPress Books (1969), 3.\n50 Chandler, Alfred. \"The Visible Hand Cambridge.\" Massachusetts: Harvard (1977).\n51 Carlos, Ann M., and Stephen Nicholas. \"\"Giants of an Earlier Capitalism\": The Chartered Trading Companies as\nModern Multinationals.\" Business history review 62, no. 03 (1988): 400.\n\nfirms were effectively conducting large-scale business in a manner that would not be seen\nin manufacturing until centuries later. Large-transaction volumes require organization to\nmanage accounts and keep the business running. Without an orderly, well-managed system\nto keep track of expenditures, ship maintenance, revenue, salary, shareholder stakes, etc.,\nbankruptcy would have been imminent. While one could run a small family business \"on\nthe back of an envelope\", this was not true of shipping companies with hundreds of people\nbringing in over one million pounds of pepper a year. 52 Secondly, not unlike the railroads\ncenturies later, the trading companies had to deal with significant information lags across\nlong-distances.53 Chandler, of course, famously argued that it was the tremendous expanse\nof distance that led railroads to truly development management, but, centuries earlier the\nsame logic required the joint-stock trading companies to develop a strong communication\nnetwork, the likes of which the business world had never seen before.54 As ships would be\nout to sea for almost a year, planning had to be made for their voyage and contingencies\ndeveloped to resolve problems that came up along the way.55 Additionally, the chartered\ntrading companies were required to leave people stationed in ports, but needed to\ncommunicate with them to monitor supply and demand across thousands of miles. Thus,\ncommunication chains were developed to improve their ability to share information\n\n52 Chaudhuri, Kirti N. The English East India Company: The study of an early joint-stock company 1600-1640.\nFrank Cass & Co, 1965, 16.\n53 See Ronnback, Klas. \"Transaction costs of early modern multinational enterprise: measuring the transatlantic\ninformation lag of the British Royal African Company and its successor, 1680-1818.\" Business History (2016): 1-\n17.\n54 One could argue that militarily this had existed since Genghis Kahn stormed across Asia. To date, however,\nbusiness had not needed this type of communication. It is worth noting that Napoleon's communication network was\nalso thought to be innovative, but he would not cross the Alps for almost 250 years after the Muscovy corporation\nbegan trading with Russia.\n55 Chaudhuri, Kirti N. The English East India Company: The study of an early joint-stock company 1600-1640.\nFrank Cass & Co, 1965, 16.\n\ninternally. These two components strongly suggest that new managerial techniques were\nrequired to run the joint-stock companies.\n\nThis does raise the question, however, of how successfully the chartered trading\ncompanies \"managed\" their organizations. The arguments above suggest that management\nwas required, but one could argue that requiring management does not equate to\nsuccessfully having it, as many of us have experienced at some point in our professional\ncareers.\n\nCritically, however, the argument of this paper is not that Britain began to\neffectively manage firms immediately, but rather, that it began to build the institutions and\nskills required to do so at a much earlier stage than China. While undoubtedly the\nMuscovy Corporation was not a model of Six Sigma management in 1555, the problems it\nfaced led Britain to begin developing managerial strategies and techniques to address the\nproblems that surfaced. While these techniques were not critical in 1555, two hundred\nyears later they would be, and Britain would be a strong position to capitalize on them.\n\nSpecifically, Britain's experience managing the chartered-trading companies led to\nthe development of two institutions that dramatically improved its ability to manage\ncommercial organizations. First, Britain developed significantly better accounting\nmeasures than China. While it would be untrue to say that China lacked any accounting (as\nnoted above), accounting in China was essentially too little too late for the industrial\nrevolution.56 Chinese accounts did not provide a clear report on assets and liabilities or\nprofits and losses, rather, they sought to clarify how much the \"lineages\" or \"inheritances\"\nwould be each year. Thus, there were no balance sheets, historical figures or transparent\n\n56 Faure, David. China and Capitalism: A History of Business Enterprise in Modern China. Vol. 1. Hong Kong\nUniversity Press, 2006, 36.\n\nreports that investors would have required. In Britain, accounting became much more\nstringent with the creation of chartered-trading firms as investors required records and\nlong-distance trade required organization. As a result, Britain became a world model for\naccounting standards, thereby allowing for relative ease of investment. As access to capital\nbecame more and more paramount, this ability to record transactions became increasingly\nimportant. Second, Britain's experience in joint-stock companies led it to develop\nmanagerial hierarchies, which formed the later basis for the organizational structure of the\nindustrial giants later on. In order to be able to sustain the significant amount of trade being\nconducted, the chartered-trading companies were forced to grow massively in size. By the\nmid-18th century, British trading companies would employ over 350 head officers alone,\nwhich Carlos et al note was more than two-thirds of all British firms even as late as the\nmid-20th century.57 One result of this increase in size was the creation of the salaried\nmanager, thereafter a permanent fixture on the Western landscape.58 This marked a huge\nchange from previous employment measures as it meant that leadership of the company\nwould no longer be tied to directly to ownership. These individuals were paid for\nperformance, and thus, could be removed if they were not meeting expectations, something\nthat cannot be done to an owner. The success of this position led it to form the basis for the\nforeman that became so ubiquitous in the factories of the industrial revolution.\nThough limited, there is evidence that the productivity gap between China and\nBritain can be explained by the lack of managerial ability. 59 As employees have known\n\n57 Carlos, Ann M., and Stephen Nicholas. \"\"Giants of an Earlier Capitalism\": The Chartered Trading Companies as\nModern Multinationals.\" Business History Review 62, no. 03 (1988): 404.\n58 Ibid, 414.\n59 Ideally, one would compare the factories of one country with the factories of another and, holding capital and\nemployees constant, compare outcomes. Data does not seem to be available to do this, however, and so one must\ntriangulate the importance of organizational structure, as I attempt to do here. For a more general discussion, see:\n\nsince time memorial, and economists have proven recently, management is critical to\norganizational success.60 Proving this in the context of 18th century China is difficult,\nhowever, due to the limited data. In agriculture, it is clear that China was much less\nproductive than Britain. Allen, in comparing the grain outputs per acre of land shows that\nChina began with higher productivity than Britain but did not improve while Britain did.61\nSpecifically, he finds that in the early 19th century Britain produced 60.9 pence of grain per\nday per acre of land, while China only produced 51.3. Broadberry and Gupta go further,\nusing a Ricardian model of trade to show that China's productivity was lower for tradable\ngoods generally.62 More direct evidence on the productivity of large commercial\norganizations can be seen, however, in the fact that Chinese textile firms in the late 19th\ncentury sought to learn how to be more productive from Japanese corporations. While\nChina was exceptionally late to develop multinational corporations (not until the 20th\ncentury), by the late 19th century, Japan had already done so.63 Consistent with the\nargument above (that the corporate structure led to better management), Japan's managers\nfound their Chinese counterparts woefully inefficient, saying that \"confusion reigned\" in\nthe Chinese mills.64 Thus, while the data prevents as full a discussion on productivity as\none would like, previous evidence collected is consistent with a picture of Chinese firms\nbeing inefficiently managed compared to their British counterparts.\n\nWilkins, Mira. \"Efficiency and Management: A Comment on Gregory Clark's \"Why Isn't the Whole World\nDeveloped?\"\" The Journal of Economic History 47, no. 04 (1987): 981-983.\n60 Bloom, Nicholas, Benn Eifert, Aprajit Mahajan, David McKenzie, and John Roberts. Does Management Matter?\nEvidence from India. No. w16658. National Bureau of Economic Research, 2011.\n61 Allen, Robert C. \"Agricultural Productivity and Rural Incomes in England and the Yangtze Delta, c. 1620-c.\n18201.\" The Economic History Review 62, no. 3 (2009): 525-550.\n62 Broadberry, Stephen, and Bishnupriya Gupta. \"The Early Modern Great Divergence: Wages, Prices and Economic\nDevelopment in Europe and Asia, 1500-18001.\" The Economic History Review 59, no. 1 (2006): 2-31.\n63 Wilkins, Mira. \"Japanese Multinational Enterprise Before 1914.\" Business History Review 60, no. 02 (1986): 199-\n231.\n64 Kuwahara, Tetsuya. \"The Business Strategy of Japanese Cotton Spinners: Overseas Operations 1890 to 1931.\"\nKyoto Sangyo University (1982).\n\nBeyond productivity, there is further evidence that Chinese economic activity was\ninhibited by the absence of a corporate form. There are two reasons to suggest this. First,\naccounts of Chinese business suggest that they were managed for stability, not growth. For\ninstance, if one looks at Pomeranz's account of the Yutang Corporation, 65 one sees clear\nevidence of a preference for stability over growth. Over the firm's 200 year history,\nmanagers tended to manage it for their working lives, and to pursue the same strategy the\nentire time. Additionally, new managers were wont to pull out cash quickly, starving the\nfirm of investment that would have allowed for growth. Alternatively, British firms under\nthe joint-stock form were given substantial incentive to achieve as high of profits as\npossible, and, to a significant amount of leeway in doing so. This too fits with Faure's\nwider account of Chinese firms, which sees them as extremely conservative, looking to\nfulfill their religious and legal obligations in perpetuity, not necessarily looking to grow.66\nSecondly, there is evidence of pent up demand for capital by these firms once the market\ndid open in the 1860s. Before 1895, not a single business had been valued at over 100,000\nyuan. But, in under 10 years, over 85 would be started with that amount, suggesting that\nthere was significant demand for large scale businesses that had not yet been met.67\nAdditionally, allowing Chinese firms to raise capital mean that railroads could be built, the\nshortest of which required 2.6 million yuan to be built in 1904.68 Thus, there is evidence\nthat there was demand for a form of organizing distinct from the trusts much earlier in\nChina.\n\n65 See Pomeranz, Kenneth. \"\" Traditional\" Chinese Business Forms Revisited: Family, Firm, and Financing in the\nHistory of the Yutang Company of Jining, 1779-1956.\" Late Imperial China 18, no. 1 (1997): 1-38.\nGuinnane, Timothy W., Ron Harris, and Naomi R. Lamoreaux. Contractual Freedom and the Evolution of Corporate\nControl in Britain, 1862 to 1929. No. w20481. National Bureau of Economic Research, 2014, 45.\n66 Faure, David. China and Capitalism: A History of Business Enterprise in Modern China. Vol. 1. Hong Kong\nUniversity Press, 2006, 38.\n67 Ibid, 60.\n68 Ibid, 60.\n\nVI. Conclusion\n\nWhile there are undoubtedly many factors that led to the divergence of Britain and\nChina, the managerial capabilities developed from the organizational structure of\nchartered-trading firms seems to have played a meaningful role. In developing the ability\nto manage large groups of people across long distances, Britain gained a head start in\nbuilding the tools of accounting and salaried managers that would become so important to\nthe organization of industrial firms later. And, while data is limited, the evidence available\nis consistent with a picture of superior management in Britain leading to higher\nproductivity, thereby furthering its economic growth.\n\nReferences\nAllen, Robert C. \"Agricultural Productivity and Rural Incomes in England and the\nYangtze Delta, c. 1620-c. 18201.\" The Economic History Review 62, no. 3 (2009): 525-\n550.\n\nBlackford, Mansel G. The Rise of Modern Business in Great Britain, the United\nStates, and Japan. Univ of North Carolina Press, 1998.\n\nBloom, Nicholas, Benn Eifert, Aprajit Mahajan, David McKenzie, and John\nRoberts. Does Management Matter? Evidence from India. No. w16658. National Bureau of\nEconomic Research, 2011.\n\nBrandt, Loren, and Xiaodong Zhu. \"Redistribution in a Decentralized Economy:\nGrowth and Inflation in China under Reform.\" Journal of Political Economy 108, no. 2\n(2000): 422-439.\n\nBrandt, Loren, Debin Ma, and Thomas G. Rawski. \"From Divergence to\nConvergence: Reevaluating the history behind China's Economic Boom.\" Journal of\nEconomic Literature 52, no. 1 (2014): 45-123.\n\nBroadberry, Stephen, and Bishnupriya Gupta. \"The Early Modern Great\nDivergence: Wages, Prices and Economic Development in Europe and Asia, 1500-18001.\"\nThe Economic History Review 59, no. 1 (2006): 2-31.\n\nCarlos, Ann M., and Stephen Nicholas. \"\"Giants of an Earlier Capitalism\": The\nChartered Trading Companies as Modern Multinationals.\" Business history review 62, no.\n03 (1988): 398-419.\n\nChandler, Alfred D. \"Strategy and Structure: Chapters in the History of the\nAmerican Industrial Enterprise.\" MIT Press Books (1969).\n\nChandler, Alfred. \"The Visible Hand Cambridge.\" Massachusetts: Harvard (1977).\n\nChaudhuri, Kirti N. The English East India Company: The study of an early joint-\nstock company 1600-1640. Frank Cass & Co, 1965.\n\nFaure, David. China and Capitalism: A History of Business Enterprise in Modern\nChina. Vol. 1. Hong Kong University Press, 2006.\n\nGelderblom, Oscar, and Joost Jonker. \"Completing a Financial Revolution: The\nFinance of the Dutch East India Trade and the Rise of the Amsterdam Capital Market,\n1595-1612.\" The Journal of Economic History 64, no. 03 (2004): 641-672.\n\nGuinnane, Timothy W., Ron Harris, and Naomi R. Lamoreaux. Contractual\nFreedom and the Evolution of Corporate Control in Britain, 1862 to 1929. No. w20481.\nNational Bureau of Economic Research, 2014,\n\nGuinnane, Timothy, Ron Harris, Naomi R. Lamoreaux, and Jean-Laurent\nRosenthal. \"Putting the Corporation in its Place.\" Enterprise and Society 8, no. 03 (2007):\n687-729.\n\nHannan, Michael T., and John Freeman. \"Structural Inertia and Organizational\nChange.\" American Sociological Review (1984): 149-164.\n\nHoffman, Philip T. \"Why was it Europeans who Conquered the World?\" The\nJournal of Economic History 72, no. 03 (2012): 601-633.\n\nIrwin, Douglas A. \"Mercantilism as Strategic Trade Policy: the Anglo-Dutch\nRivalry for the East India Trade.\" Journal of Political Economy (1991): 1296-1314.\n\nKelly, Morgan, Joel Mokyr, and Cormac O'Grada. \"Roots of the Industrial\nRevolution.\" UCD Centre For Economic Research Working Paper Series (2015).\n\nKuwahara, Tetsuya. \"The Business Strategy of Japanese Cotton Spinners: Overseas\nOperations 1890 to 1931.\" Kyoto Sangyo University (1982).\n\nMcCloskey, Deirdre Nansen. \"It was Ideas and Ideologies, not Interests or\nInstitutions, which Changed in Northwestern Europe, 1600-1848.\" Journal of Evolutionary\nEconomics 25, no. 1 (2015): 57-68.\n\nMorris, Ian. Why the West Rules-for Now: The Patterns of History and what They\nReveal about the Future. Profile Books, 2010.\n\nPomeranz, Kenneth. \"\" Traditional\" Chinese Business Forms Revisited: Family,\nFirm, and Financing in the History of the Yutang Company of Jining, 1779-1956.\" Late\nImperial China 18, no. 1 (1997): 1-38.\n\nPomeranz, Kenneth. The Great Divergence: China, Europe, and the Making of the\nModern World Economy. Princeton University Press, 2009.\n\nPomeranz, Kenneth. The Making of a Hinterland: State, Society, and Economy in\ninland North China, 1853-1937. Univ of California Press, 1993.\n\nRonnback, Klas. \"Transaction costs of early modern multinational enterprise:\nmeasuring the transatlantic information lag of the British Royal African Company and its\nsuccessor, 1680-1818.\" Business History (2016): 1-17.\n\nRosenberg, Nathan, and Birdzell LE Jr. How the West Grew Rich: The Economic\nTransformation of the Industrial World. Basic Books, 2008.\n\nWeber, Max. \"The Protestant Ethic and the Spirit of Capitalism.\" (1930).\n\nWilkins, Mira. \"Efficiency and Management: A Comment on Gregory Clark's\n\"Why Isn't the Whole World Developed?\".\" The Journal of Economic History 47, no. 04\n(1987): 981-983.\n\nWilkins, Mira. \"Japanese Multinational Enterprise Before 1914.\" Business History\nReview 60, no. 02 (1986): 199-231.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n21H.383 / 21H.982 Technology and the Global Economy, 1000-2000\nFall 2016\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "21H.383F16 Technology and the Global Economy - Student Example: Essay - Great Divergence",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-383-technology-and-the-global-economy-1000-2000-fall-2016/bfb172273c27068ca3bd86d43e51107a_MIT21H_383F16_GreatDvrgnce.pdf",
      "content": "21H.383 / 21H.982: Technology and the Global Economy: 1000 - 2000\nFinal Paper\nMIT Student\n\nCulture, Coal, Colonies, Computation: The Causes and Perpetuators of the Great Divergence\n\nIt is a truth universally acknowledged that the world today, for all its apparent lingering\npoverty and misery, is really quite wealthy--fantastically wealthy by the standards of 1800. As\nDierdre McCloskey is at such pains to point out, productivity has increased over the past two\ncenturies, not by 70%, but by factor of 70 (McCloskey 2016, 7). Average daily wages have gone from\n$3 a day to $100 a day in the most developed economies, like that of the United States, an\nimprovement of a factor of 30. These numbers are hard to make sense of in the abstract, but they\nrepresent a massive change in the standard of living of ordinary people. We tend not to notice the\nmagnitude of this change because it happens gradually, year after year. And considering historical\nincomes in current-day-dollar-equivalents is at best awkward and at worst misleading, missing much\nof the content of the changes: no matter how much I made, I could not have purchased a portable\ncomputer or paid for electric central-heating in England in 1816, and that $3 coffee that would have\nentirely eaten up the daily wages of any of my ancestors in the United States (or, God forbid,\nFinland) in that year would not have been available in the same way--expelled under high pressure\nfrom an electricity-powered Italian coffee machine in an electrically-lighted storefront rented by a\nmultinational coffee chain right outside the subway station I get off at every morning--without a\nsufficient market of $100 per day consumers to pay for all those perks. These sorts of wage\ncomparisons leave out the structural shifts those very changes have made possible. Because we use\n\nour money to buy smartphones and ready-made clothes and seven dollar sandwiches we may not live\nlike kings, despite our kingly incomes. But we also do not die like them, by the pox or the pata. Just\nhow we managed such a transition in 200 years is indeed something to be explained, and accounting\nfor why it occurred first in Western Europe (particularly with roots in Britain) rather than India,\nChina, or Japan, which had economies superficially similar to Europe's in a great many ways, has\nresulted in the spillage of much historical ink, of which McCloskey's three-volume, eighteen-\nhundred page magnum opus is only one of the largest and most recent contributions.\n\nThe causes of the Great Divergence are difficult to identify. If we could simulate history\nthousands of times and tweak the parameters just a bit, they might be easy enough to discover. But\nwe have only one cut of history. Making any generalizations from a sample of N=1 is a fool's errand,\nso we have to do our best at comparing similar situations within the history we have. Given Europe,\nChina, India, and Japan as a rough set of locales, we now have N=4. Better. But this is still not\nconclusive. The Great Divergence is almost certainly going to be multi-causal, and the boundaries\nof these causes are difficult to identify. If one accepts one of the \"causal factors\" as coal, for\nexample, (as many as far back as Jevons, in 1865, have done), does that mean the cause is a natural\none? Or is the cause ideas-about-how-to-use-coal? Or is it a-culture-that-furthers-the-\nproduction-of-ideas-about-how-to-use-coal? Which is \"more\" causative, the resource or the\nideas? We have no way to control for these variables--to present ample coal to a Western Europe\nbereft of bourgeois values, or to provide bourgeois values to a Britain bereft of coal--in order to\ntease apart such distinctions. So there is no easy way to settle such debates. It seems likely that\nsome are not matters of historical fact at all, but matters of philosophy and sociology, to be settled\n\nnot by ever more careful study of history, but by good models and even better stories. However,\nthe causes of the Great Divergence are a matter of great public importance. By the standards of our\nancestors we are doing fantastically well, and indeed the world is on average still getting wealthier at\na significant rate (McCloskey 2016, 43). But accelerating technological and social change, deeply\nindebted to the model produced during the Industrial Revolution (we are \"beholden to the approach\nto technological change that took root 300 years ago in Europe,\" as Rosenthal and Wong would\nhave it [ix], and are still living its legacy), puts us at something that appears rather like a key\nmoment in history. The developing economies of India and China are beginning to reach the levels\nof England or the US in the late 1800s, complete with similar levels of pollution (McCloskey 2016,\n68). Africa may be beginning its journey up the \"hockey stick,\" with the specter of global climate\nchange lingering in the background (McCloskey 2016, 71). Mechanization potentially threatens vast\nnew swaths of laborers in routine knowledge work professions (Brynjolfsson and McAfee 2014, Ford\n2015). And at home, globalization and neoliberalism seem to have left so many behind. If we are to\nbelieve the conventional narrative of Donald Trump's electoral success in Rust Belt states--that\neconomically motivated, primarily white, blue collar workers came out in droves to vote for someone\nwho promised to return to them the employment opportunities and attendant dignity that they\n(rightly or not) imagined their fathers had--then all McCloskey's pithy barbs about how the tide of\nliberalism still lifts all boats seem to have been of little comfort. While it would be risky to take too\nexceptionalist a stance about our present moment, historical explanations for the Great Divergence\nshould point us to an urgent contemporary question: What must be done now to preserve and\nextend the prosperity that industrialization has bestowed upon us? Different explanations for\n\ndivergence provide different answers.\n\nThe general structure of this paper is as follows. First, I outline the key claims of the\nnarratives of divergence, separated into several general categories based on what is attributed as\ntheir causal factor. Second, I examine what these claims mean for the maintenance of economic\ngrowth today. What are the current implications of each explanation? Then, I attempt to evaluate\nthese explanations in the context of the current progress of automation technologies, via a distinct\nnarrative of economic divergence rooted in the distributed computational power of human societies.\nThis computational hypothesis tries to bring multiple causal factors together into a coherent story\nthat leads us to focus even more closely on how contemporary destabilizations play into growth\nnarratives. Finally, I survey some possibilities for how increasingly advanced techniques of\nautomation stand to shape the factors that contribute to growth, if the computational hypothesis\nholds.\n\nNarratives of Divergence\n\nThe stories of divergence can be usefully, if inexactly, classified into four types. The first\nclass is a demographic one: Western Europe, as compared with other global competitors, was more\ngoverned by the preventative, than the Malthusian positive check, and was therefore able to\naccumulate the necessary initial capital to industrialize. One class is essentially ecological, or\nresource oriented: Europe had certain types and amounts of natural resources available, at a\nparticular time, that made industrialization possible. Another class is institutional: governments,\ncapital markets, or other societal structures were somehow different in Europe, compared to the\n\nrest of the world, and this allowed the shift to an industrial economy. And a last major class of\nexplanations is ideational: it was a proliferation of ideas--ideas about invention, or ideas about how\nto develop a civil society--that provided the impetus for industrialization. Each of these divergence\nnarratives has potential explanatory strengths, though some have fallen out of favor at various\nperiods in scholarship (this is seemingly cyclical though, as the European marriage pattern has\nexperienced a resurgence of interest in the last decade, see e.g. Voigtlander and Voth 2009). They\nare all worth exploring, at least in brief, as we begin to think about the sources of our modern\nprosperity.\n\nDemographic explanations focus particularly on family structure and the European marriage\npattern. Typified in John Hajnal's 1965 \"European Marriage Patterns in Perspective,\" this argument\nessentially states that Western Europe, at least by the 18th century, was unique in the world in\nterms of its average age at marriage, and the percentage of the population who remained unmarried\n(Hajnal 1965, 101). This theme, as Hajnal himself notes, is not a new one, but draws directly from\nMalthus's Essay on the Principle of Population, the source of the \"preventative check of moral\nrestraint\" (Hajnal 1965, 130). Hajnal's paper supports Malthus's claim that, indeed, late marriages\nand lower marriage rates resulted in lower birth rates and lower death rates within the European\npopulation, though the statistics for death rates are less clear cut than those for births.\nDemography alone does not a Great Enrichment make, but the point for Hajnal is that the marriage\npattern is deeply linked to economics: as he puts it, \"A marriage almost by definition requires the\nestablishment of an economic basis for the life of the couple and their children,\" and therefore the\neconomic structure and family structure will shape and influence each other (Hajnal 1965, 132). He\n\nsupposes that one possible economic consequence of late marriages is greater productivity and\ndemand for goods, as potential partners have longer periods of productive adult life during which\nthey are not raising children, and are able to labor full time, develop savings, and acquire goods\n\"other than the food etc. required for immediate survival\" (Hajnal 1965, 132). This is one possible\ndemographic source for the Great Enrichment, which Hajnal refers to as the 'take-off' into modern\neconomic growth. The other co-acting force is that a desire for wealth, and a certain standard of\nliving, may well have delayed marriage, such that the delaying of marriage could be self-reinforcing\nand add strength to the effect. These forces are connected to European family structure and the\ncultural expectation that young couples establish their own independent household rather than join\na larger co-habitating economic unit like an extended family, as was customary in China and\nelsewhere (Hajnal 1965, 133). But the precise causal relationship here is unclear.\n\nEric Jones's The European Miracle, though it also addresses other factors such the natural\nenvironment and European colonization, gives European family structure a central role in making\nthe \"miracle\" possible. Jones generally aligns with Hajnal in his treatment on the European family,\nas uniquely characterized by a nuclear structure and capable of controlling fertility preventatively in\nresponse to the availability of resources. The rest of the world, as Jones put it, were \"r-\nstrategists,\" maximizing their numbers to cope with catastrophe, but where therefore always in\ndanger of running headlong into the Malthusian positive check of resource exhaustion, famine,\ndisease, and death (Jones 1981, 20). Western Europe, the space of carrying-capacity sensitive \"K-\nstrategists,\" was meanwhile able to accumulate ever more capital, the fruits of excess production\nnot overtaken by population growth, which set the stage for the Industrial Revolution. Pomeranz\n\ndetails the precise sorts of mechanisms through which this process would purportedly operate: an\nincrease in the number of non-farmers, better tools, more livestock, better nourishment and health\nleading to greater productivity, and a larger market for non-essential goods (Pomeranz 2000, 10).\nHowever, the demographic thesis has been challenged by more recent scholarship which has tended\nto show that Europe and Asia were less different than Hajnal and Jones believed. Voigtlander and\nVoth dispute the relevance of \"California School\" findings about Yangtze productivity to the overall\nincomes of Europeans and Asians, but evidence overall suggests Asia was no Malthusian disaster\n(Voigtlander and Voth 2009, 248). Rises in living standards occurred elsewhere too, during various\nperiods, and much of Asia could have accommodated even higher population densities during the\n1800s without major changes in either productive technologies or the general standard of living--\nwhich was, in some respects, higher than that in Europe (Parthasarathi 2011, 11)--which sheds\nfurther doubt on the idea that Asia was, demographically, too close to Malthusian collapse to be\nable to support industrialization (Pomeranz 2000, 11). Instead, if we are to accept demography as\npart of the explanation for divergence, it would need to be in terms of a more sophisticated\nargument of path-dependence and sociopolitical goals, as Parthasarathi attempts to provide, rather\nthan via naive overpopulation and overstressing of an agrarian economy. Likewise, Sugihara Kaoru\nsuggests that the population growth of Asia represents an \"East Asian miracle\" of comparative scale\nand value to the European miracle, in that Asia was capable of supporting complex societies of\nartistic and technological achievement at population levels not seen in Western Europe (Pomeranz\n2000, 12). Sugihara posits two distinct types of industrialization, one a European-style capital-\nintensive industrialization, and another labor-intensive industrialization that was able to take root in\n\nAsia because of its historical trends that produced a large, relatively skilled workforce (Sugihara\n2007, 124). Hayami, for the Japanese case at least, calls this an \"Industrious Revolution\" in Asia\nafter the fashion of DeVries (Hayami 2015).\n\nAs should be clear from the description so far, demographic arguments overlap in places with\nresource-based ones. The motivating factor behind demographic exhaustion is arable land, the\nfundamental natural resource for the simple Malthusian model of population growth. As Pomeranz\nnotes, one of the classic types of Europe-centered stories pits an \"ecologically played-out\" East\nagainst a West that had room to grow, much of which was via colonization or exploitation of the new\nworld (Pomeranz 2000, 10). This kind of ecological exhaustion argument may read back more\ncontemporary East Asian ecological crises into the past, as Pomeranz claims, or simply turn a blind\neye to the actual natural bounties of parts of Asia (Pomeranz 2000, 11-12). Given the comparable\nstate of timber and soil between Europe and China, he argues, if China was 'falling' from ecological\ncrises, then Europe should have been doing so as well.\n\nThe second type of ecological argument differs more fully from demography. It attempts to\ncircumvent this problem of resource comparability by focusing on those few ecological features that\nare not consistent between Europe and East Asia, and here Pomeranz buys in, rather than dissents,\nfrom the natural resource-based arguments of others. What made the difference, in this vision, were\n\"important and sharp discontinuities\" coming from the accessibility of fossil fuels in England, and\naccess to resources in the New World that were of an entirely different scale than was available\nwithin Europe or East Asia themselves (Pomeranz 2000, 13). Here, Pomeranz builds on Wrigley's\nwork emphasizing the importance of coal to industrial take-off in England. Coal's primacy as a\n\npower source, over wood, is not necessarily clear based on its intrinsic material properties, and\nindeed it required in some cases decades of experimentation to be fully adapted as a fuel in\nindustries, such as steel-making, where its impurities caused problems with the behavior of the\nproduct (Wrigley 2010, 100). Coal also has the potential disadvantage in that it is not generally\navailable in the local environment, and so requires a developed transportation system to move the\nresource from its sources to its users (though this is itself a path-dependent characteristic, in that a\ntransportation network developed to distribute coal may go on to boost later industrial productivity\nof all kinds).\n\nHowever, coal's great advantage over prior sources of energy was in both its large absolute\nscale in terms of stored energy, and its even more massive scale when considered with respect to\nland area used. Coal provides, in Wrigley's terms, \"ghost acres,\" vast swathes of land that would\nhave been needed for trees had all the energy required by the industrialization come from firewood\nrather than fossil fuels (Wrigley 2010, 39). Coal is a punctiform, rather than areal, resource, coming\nfrom particular geographically confined locations rather than taking up large quantities of otherwise\nuseful land--it is this fact of coal's material properties, in a sense, that allows a coal-fueled society\nto avoid, or at least put off, the Malthusian checks of land demand. Wrigley's central thesis in\nEnergy and the English Industrial Revolution is that \"the discovery of a way of meeting the energy\nneeds of an economy from a single source which was not subject to the limitations associated with\ndependence on the annual round of plant photosynthesis, was the decisive step in ensuring that\ngrowth would not be halted by the changes induced by its earlier success\" (Wrigley 2010, 100). The\naverage coal miner could \"produce\" (unearth) 13 terajoules of energy annually, while each\n\nagriculturalist could produce only 0.10, a difference of two orders of magnitude (Wrigley 2010, 244)!\nFrom this comparison alone it is not hard to see how the energetic argument becomes an incredibly\ncompelling one--especially as the changes we are attempting to explain are, as McCloskey is so fond\nof noting, changes of several orders of magnitude. The added benefit that coal freed up additional\nland for the production of other raw materials, along with the mass importation of such materials\nfrom the colonies, was able to push up the productivity ceiling, such that the newly energized\nindustries did not simply run out of resources to process.\n\nThese properties were foremost in the minds of at least some economists as far back as\n1865, when Jevons published The Coal Question, which begins: \"Day by day it becomes more\nevident that the Coal we happily possess in excellent quality and abundance is the mainspring of\nmodern material civilization\" (Jevons 1965, 1). The energy dug up from the deep geological past\nmakes \"almost any feat\" possible, and its lack would return us inevitably to the \"laborious poverty\nof early times\" (Jevons 1965, 2). So, as early as coal was identified as a potential source for a great\nunlocking of productive potential and a vast amelioration of living conditions for the general\npopulation, the inevitability of its eventual exhaustion has been a matter of great concern. This is\nthe price of a highly productive consumptible, rather than fungible, society: consumptible\nresources, by their nature, are limited (Wrigley 2010, 22). The narrative of a coal-based Great\nEnrichment is not quite the simple one of a single great unlocking of productivity and an eventual\ncollapse. As Wrigley is careful to note, coal was not a one-shot solution. Its widespread use came\non the heels of other changes in transportation, such as in increase in the output of oats and the\nuse of horses for agriculture and transportation, that magnified its impact (Wrigley 2010, 31). And\n\nthe new transportation networks that trade in coal created went on to serve other purposes in\naiding economic growth via the shipping of commodities. And as McCloskey notes, though resources\nare fundamentally finite--the Earth, or even the Solar System if one wants to draw the line that far\nout, is for most purposes a closed system; new resources do not enter and waste does not leave--\nwhat is considered a resource expands with technical progress, such that all past predictions of the\nexhaustion of our fossil fuels have proved false: highly-motivated economic actors have figured out\nways to increase supply, or substitute alternatives (McCloskey 2016, 66). However, given that there\nare fundamental energetic and thermodynamic limits to life within our little closed system, such\nresource-based questions are matters of considerable debate and concern especially if they are what\nhas uniquely allowed the Great Enrichment (see Meadows et al. 1972, Schumacher 1989). Debates\nabout resource use and environmentalism and growth, can, mathematically, only ever turn out one\nway in the far future. But this mathematical limit is as intangible as it is fundamentally irrelevant:\nwe are doomed no matter what, either by our own growth or the heat death of the universe; the only\nquestion is how long we have. The problems here turn ethical and philosophical.\n\nBut perhaps raw materials are not so important as these stories make out. Perhaps, given the\nright economic structures, growth will occur almost regardless of resources, as economic actors\nfigure out the appropriate solutions to innovate around these difficulties. This type of explanation is\nthat preferred by Braudel, Wallerstein, North, and Brenner in different ways. For Brenner in\nparticular, institutional differences around the protection of private property rights made the\ndifference for spurring economic growth. This differential is not simply an East-West one, about a\nWest that protects private property and an East that does not--which as Pomeranz and McCloskey\n\nboth note, though different ways, does not square with historical fact (Pomeranz 2000, 12-13;\nMcCloskey 2016, 86). But it also interacts with class struggle so as to distinguish Britain, where\nindustrialization began, from a France that lagged behind: while conflicts over property rights\nturned out to provide strength to small independent agriculturalists in France, they strengthened\nagricultural lords in England, which produced an unemployed ex-agricultural workforce freed to\nmove to urban areas and become factory workers (Brenner 1982, 16-17). For Douglass North, by\ncontrast, the distinction that made the difference was the presence in Western Europe of\n\"increasingly competitive markets for commodified land, labor, capital, and intellectual property\"\n(Pomeranz 2000, 15; see also North 1981). This take on the importance of institutions is not far\nfrom McCloskey's argument on its face, though McCloskey identifies the source of the institutional\nchange within a broader force of changing ideas that had additional effects outside of institutions\nper-se. For Wallerstein, these institutional factors of free labor, capital markets, and government-\nfavored reinvestment of profits combine to explain what make the \"core\" countries core, and these\nadvantages are subsequently compounded by the central positioning of these nations within an\ninternational labor system (see Wallerstein 1974). N. F. R. Crafts, though he is primarily interested\nin how the English economy developed rather than why it was first to industrialize, finds that\nchanges in urbanization, the distribution of the labor force, reinvestment of capital, and\ndevelopment of factories are all important signposts for the Industrial Revolution in England. In\nparticular, the share of the agricultural labor force was exceptionally small, supporting the notion\nthat the availability of industrial labor may have been a key contributor to the early industrialization\nof England (Crafts 1985, 61).\n\nRosenthal and Wong, in Before and Beyond Divergence, spend several chapters considering\nwhether different institutions, or aspects of institutions, including capital markets and family\nstructures, provided a relative boost to Europe, just as Pomeranz studied these factors before them.\nAnd their conclusion seems to be that in general, institutions were often less different between East\nand West than previously believed, and at any rate any differences are insufficient to explain a\ndivergence. The sanctity of private property is a particularly played out explanation, to which\nMcCloskey likes to reply that respect for private property is abundant in organized societies of even\nthe ancient world because it is what we mean when we define a group as an organized society\n(McCloskey 2016, 86). Pomeranz does identify certain institutional patterns that separate out some\nareas of Europe, China, and Japan as most likely to be places where divergence begins, but they\ncannot explain why industrialization actually happened first in Europe (Pomeranz 2000, 24). The\nmost compelling institutional difference that Rosenthal and Wong seem to come up with is a\ndifference in the taxation schemes of Europe and China, which was, in their view, probably a net\nnegative for the European economy at the time. However, they claim this may have provided an\n\"irritant\" to spur structural changes that China was later unable to cope with (Rosenthal and Wong\n2011, 205-206). This is a different kind of path-dependent argument, which has something to do\nwith Europe's fragmentation and history of internal warfare, but also has much to do, it seems, with\nthe sort of Bourgeois Virtues wherein McCloskey finds the source of divergence. As Rosenthal and\nWong note, good governance in Europe came to be identified not with low taxes per se, but \"no\ntaxation without representation,\" part of the traditional liberalism McCloskey identifies as the cause\nof divergence. Acemoglu and Robinson fall somewhere on this spectrum as well, essentially arguing\n\nthat rapacious, extractive, and corrupt institutional structures are the cause of national failure. To\nhear them tell the story, the factors that have held nations such as Egypt from the prosperity of the\nWest are the same things Egyptians themselves will tell you: \"an ineffective and corrupt state and a\nsociety where they cannot use their talent, ambition, ingenuity, and what education they can get\"\n(Acemoglu and Robinson 2012, 2). Representative institutions, or at least ones that are relatively\nun-corrupt, which generally are one and the same, make the difference between prosperity and\npoverty. When elites scrape away much of the nation's wealth for their own gain, societies cannot\ngrow at Western rates. While Acemoglu and Robinson's arguments are directly founded in\ninstitutions, they are also on the border with the Bourgeois Virtues. High taxes differ from high\nappropriation due to the power of representation, which comes about due to certain cultural or\npolitical commitments. Institutions come about because of particular sets of ideas.\n\nThe last major class of explanations for the Great Divergence is therefore that of ideas. Was\nit perhaps inventiveness, innovation, and new classes of innovators, who provide the opportunity for\ndivergence? Crafts disagrees with this concept, stating based on economic data about productivity\ngrowth (and directly contradicting McCloskey's 1981 Enterprise and Trade in Victorian Britain:\nEssays in Historical Economics) that it \"does not seem appropriate to regard innovativeness as\npervasive\" in Britain during the Industrial Revolution (Crafts 1985, 87). However, Mokyr and\nMcCloskey defend ideational arguments for the divergence. Mokyr's arguments are actually quite\nclose to McCloskey's in many ways, though he focuses on an elite group of inventors rather than a\nchange in the cultural evaluation of the bourgeois: in both cases, it is a new freedom to invent, and\nto profit from inventions, that opens the door to previously unheard of levels of economic growth\n\n(Mokyr, 2005). And I think few would argue against the idea that technological advancement in\ncapital-intensive industries had a lot to do with divergence in practice--in a very basic way, this is\nwhere the unprecedented surpluses allowing for growth came from. But among questions that\nremain, the precise causal mechanism is not certain. Was it ideas alone that caused a revolution?\nOr was the tumult of new inventions caused by, for example, the institutional factors that Crafts,\nNorth, and Wallerstein favor. And the question still remains, why Europe? Advanced science existed\nelsewhere, and the Enlightenment in Europe is not coextensive with changes in industrialization.\nMcCloskey certainly favors the story that the relevant innovative ideas were freed up by another\nclass of ideas entirely: a new \"ideology of liberty and dignity\" for common people that both brought\nthem into the fold of invention from which they had previously been excluded, and made socially\nacceptable the maintenance of a culture of invention through the accumulation of commercial profit\n(McCloskey 2016, 21).\n\nA careful read on the Bourgeois ideational hypothesis leads back toward the institutional\nexplanations, however. When considered carefully, McCloskey's explanation, which depends on the\nR's of: Reading, Reformation, Revolt, Revolution, and the Reevaluation of the Bourgeoisie, is less\nabout ideas springing forth from nothing than about a cultural or sociological context (McCloskey\n2016, xxxv). Divergence in this theory is a matter of the \"surprising, black swan luck of\nnorthwestern Europe's reaction to the turmoil of the early modern\" (McCloskey 2016, xxxiv).\nUniquely in this context, unlike Japan, China, or India, the main economies to which Europe is\ncompared, Europe developed a set of ideas we recognize as liberalism--loosely: liberty, equality,\nfraternity--and its attendant economic pattern of \"trade-tested betterment\" in the McCloskeyan\n\nphrase. This was all a response to or a product of these five R's. McCloskey hews generally to the\nideational hypothesis, but states that \"ideas for the inventions [which unlocked a 70-fold\nbetterment for most of the world's population] . . . were released for the first time by a new liberty\nand dignity for commoners\" that was a product of these black swan events, which are not solely\nideological things (McCloskey 2016, xiv). The desired level of explanation matters for whether this\nis considered to be growth as a consequence of ideas, or of political shifts. McCloskey writes about\nit as primarily a question of ideas even as these ideas are clearly intertwined with the institutional\nchanges inherent in reformation, revolt, and revolution. Teasing these apart leads quickly into the\nrealms of philosophy and unprovable historical counterfactuals about revolutions without changes in\nvalues, and changes in values without revolutions.\n\nRecommendations from Divergence Stories\n\nMost notably for our purposes, these different narratives of divergence drive different kinds\nof policy recommendations. If economic growth is considered to be, universally, a very good thing,\nin bringing increased prosperity to people--and especially if a lack of growth leads to dysfunction\nand economic collapse, due to the organization of markets around the production of value through\ngrowth--then different origin stories for the Great Divergence, based in different first principles,\nsuggest different paths for the maintenance of growth in the more-developed world, and for the\nlifting up of the bottom billion people who have so far benefited the least from global economic\ngrowth.\n\nDemographic explanations for the divergence suggest demographic solutions, which are\n\nfundamentally unsatisfying in a modern context. While Hajnal's data on European marriage patterns\ncertainly suggests a culturally-based \"solution\" for lifting up the bottom billion, albeit essentially a\nproduct of Western cultural imperialism--encourage European-style marriage patterns, which should\nthereby stimulate savings and support the production of greater markets for consumer goods--it\ndoes not do us much good to diagnose contemporary economic ills in the more-developed world.\nHaving already by definition instituted European marriage patterns, where would Europe go to\nunlock further growth? In the United States, marriage rates are decreasing, and average ages at\nmarriage and proportion of people never marrying continue to increase, and yet these increases are\nnot seeming to produce runaway economic growth (CDC 2012). Given contemporary data it seems\nmost likely that if European marriage patterns are a part of the divergence story, they are a deeply\ncontingent one, and one that acted only with other causes, rather than as the primary causal factor.\nDespite recent interest, demographic explanations are sufficiently out of favor in the economic\nhistory establishment that McCloskey does not even bother to address these arguments directly in\nBourgeois Equality, even though she direct attacks arguments rooted in trickle-up, trickle-down,\ngovernmental, and institutional rhetorics. Perhaps marriage patterns favored certain economic\ndevelopments, but they are not responsible for them, nor do they leave us room to explain\ncontinued economic growth beyond a simple step-based change. They may alter the baseline of\neconomic activity, but it does not seem plausible to explain an exponential effect via this relatively\nlimited shift, one which is linear with respect to time and population. If we leave Malthusian\ncatastrophe behind, the demographic explanation essentially reduces to arguing that market-\nparticipating population is the growth determinant, which really puts us into the playground of\n\ninstitutional factors.\n\nResource-based explanations seem to have continued relevance to modern economies in a\nway that demographic explanations may not. Particularly compelling here is the energetic\nexplanation in the tradition of Jevons, Wrigley, and to some extent Pomeranz. If coal as an energy\nsource was at the center of a network of societal changes that made possible the growth of a\nmarket-consuming laboring class provided for, in essence, by the energy borrowed from the deep\ngeological past, we now need to be concerned about sustaining this surge of energy. If it was a vast\nstore of energy that made sustained growth possible, opening up new possibilities for mechanical\nwork that were absent when all the energy consumed in a year had to be produced by the prior\nyear's photosynthesis, how do we continue to secure such stores of energy to maintain growth into\nthe future, without making the world an unlivable place? The pessimistic way to look at the\nenergetic hypothesis is that our markets have ballooned on the borrowed time of non-replenishable,\nconsumptible sources of energy, and we risk coming to a juncture in which we will have to\nrenegotiate our sources of energy. If fossil fuels made the divergence possible, can their exhaustion\nunmake it? Or at the very least, if energy production threatens to return to an areal nature (via\nsolar and wind power), albeit with greater efficiency than photosynthesis, Wrigley's book calls us to\nask: Will the Ricardian pressures of land demand we have been escaping for hundreds of years yet\nhave their revenge? In this view, growth continues due to our ability to expend increasing amounts\nof energy, and so what is needed to maintain growth in future is to continue the process of liberating\ngreater and greater yearly amounts of energy from the environment. It may well be that the limits on\nthis are high--commercial solar power is less than 20-percent efficient today, which gives plenty of\n\nspace for science to improve energetic yields, and there is plenty of space left to put solar farms\nthat is not particularly useful for other purposes--but they should at least be a concern (Martin\n2016). The reserves of the necessary nonrenewable resources might become low, as Meadows et al.\nwarned of in 1972, before we ever reach areal limits to energy generation (see e.g. Meadows et al.\n1972, 66). But the resource hypothesis for growth provides both a clear path forward to maintain\ngrowth, one consistent with what the market is already doing (keep making greater supplies of\nenergy available for industrial use), as well as a fundamental, resource-based set of limits on\neconomic growth no matter what new technologies we are able to invent. The energetic narrative is\nlargely an optimistic one, as there is nothing, short of a global Dark Age or the encounter of\nfundamental physical barriers to growth, that should arrest economic development once begun.\nAssuming climate changes can be avoided or adapted to, this explanation seems to provide a way\nforward.\n\nInstitutional arguments about the source of divergence present similar challenges, when\napplied to the present, to the demographic arguments already examined. If it was certain political or\nmarket structures that allowed for growth, then those structures need to be exported to the bottom\nbillion. The historically fraught attempts to export Western economic success to Latin America\nthrough the implementation of import substitution industrialization fall into this mode. ISI sought to\nproduce strong internal markets through government investment and Keynesian economic practices,\nbut did not yield the desired results and is widely regarded as a failure (see e.g. Franko 2007). This\nfailure was followed by the so-called Washington Consensus model for intervention, supported by\nthe IMF and the World Bank, which essentially reads like a neoliberal economic wishlist: fiscal\n\nrestraint, trade liberalization, privatization of state enterprise, and deregulation are among its\nprimary components (see Williamson 2000). Whether or not these policies have been successful in\nthe Latin American context is a subject of some debate, with Williamson himself suggesting that his\nterm was never intended to imply the sort of extreme neoliberal policies that some have interpreted\nas being under its banner (Williamson 2002). The question of whether and why Latin American\ncountries have failed to experience Euroamerican levels of economic growth might shed important\nlight on the role of institutions in local contexts as determinants of growth, though a detailed\ntreatment of that debate is beyond the bounds of this paper. However, institution explanations raise\nother questions within the Western context: the question, \"Is growth at risk, and what do we do\nabout it?\" boils down to a question of whether the growth-producing economic conditions of strong\nmarkets, private property protection, and reinvestment of profits are maintained. Some particular\nthreats stand out here: Crafts, in the conclusion to British Economic Growth during the Industrial\nRevolution, addresses the follow-on question of whether the British economy failed during the\nVictorian period, to which he answers a qualified yes. For McCloskey, British economic growth\nduring this period seemed comparable to other advanced economies, but Crafts identifies other\neconomic historians, including Allen, Berck, and Webb who criticize British industries with respect\nto their total factor productivity (McCloskey 1981; Crafts 1985, 157). Kennedy and Richardson\nlikewise favor a view that Britain did indeed lag behind its potential because \"resources were not\ndeployed to exploit opportunities which did exist\" (Kennedy 1974, 440), perhaps because the\neconomy was \"overcommitted\" (Richardson 1967, 194) or perhaps for other structural reasons.\nCrafts suggests a path dependency, that the success of the early start locked in place a particular\n\neconomic culture, and that perhaps Britain was unable to access a \"higher growth path based on the\nopening-up of higher returns to investment in education and science\" due to entrenched cultural\nfactors (Crafts 1985, 160). Solutions to this structural inadequacy in the British economy seem to\ntend toward the ideational regime, e.g. a different cultural valuation of science education. Other\nthreats issue straightforwardly from classical economic theory. If economic growth depends on the\n\"reinvestment of a sufficient fraction of [the economy's investible] surplus,\" then anything that\nstands in the way of such reinvestment is a grave concern (Eltis 2000, vii). This is in fact the\nconcern for Louis Hyman, who in a 2016 presentation titled \"Unnatural Capitalism: How the New\nDeal Reinvented Capitalism and Why We Need to Do It Again,\" argued that the United States has\ntoo much money sitting in banks, and is flirting with a repeat of the Great Depression if that money\nis not reinvested (Hyman 2016). The ills and solutions to institutional crises are, among our four\nclasses of stories, those most clearly within the traditional realms of economic theory.\n\nThe ideational hypothesis for the Great Divergence instead suggests problems and solutions\nthat rise above the details of implementation. If it is old-fashioned liberalism that is the heart of\neconomic growth, as McCloskey asserts, then threats to economic growth are the same as the\nthreats to liberalism, and the one goal for all those interested in human betterment is to ensure that\nliberal values triumph across the globe. Citing the \"astonishing\" results shown by India and China\nafter accepting liberalism, she suggests that economic growth is not something to be chased directly\nthrough instrumental economic means but \"something people and their countries do mostly on their\nown, by way of the liberating and dignifying trade-tested progress in a market stall or a little\nmachine shop\" (McCloskey 2016, 142). Though good and honest governments are rare, even\n\ncorrupt and growth-draining governmental structures can be overcome in the presence of free\nmarkets and liberal values (McCloskey 2016, 140, 624-625). The ills and solutions look somewhat\ndifferent for a Sweden or a South Africa: when a nation has already accepted liberalized trade and is\ndoing well, even a high level of socialist welfare state practice is not causing that much harm in\nMcCloskey's view; but for those nations who have not yet achieved the requisite levels of growth,\nhands-off economic policies are the necessary solution for taking the brakes off economic growth.\nAnd in either case, what is to be fought for and protected are the ideas that make the whole project\npossible. Were we to lose liberal values entirely, so McCloskey's narrative goes, we should see\ngrowth evaporate. Having eliminated other explanations, such as institutions and natural resources,\nas either too late, too weak, or as second-order outcomes of ideational change, McCloskey\nidentifies the social ethics of liberalism as the factor to be nurtured and protected.\n\nEnter Computation\n\nOne of the primary issues with comparing and evaluating these divergence narratives has\nbeen the problem of level of explanation. Demographic, institutional, resource-based, and ideational\ndepictions sometimes differ more by a philosophical commitment to what can be considered a causal\nfactor than the actual dynamics being explained. But this ambiguity is also a site for new\ninterventions. Therefore, I would like to reimagine some of these arguments in a different mold, that\nof computation. It is possible to read portions of the resource, institution, and ideas arguments not\nas stories of the things in themselves, but as outgrowths of a great unlocking of human brainpower\nthrough competition, of devices and ideas, that essentially functions as a highly efficient distributed\n\ncomputing system. Culture, coal, and colonies all become linked through the notion of human\nsociety as essentially a large scale information processing endeavor. This perspective has roots both\nin cybernetics (another C-word, conveniently enough), which begins to view human brains as\ncomputational systems, and links them to other kinds of computational systems, both organic and\ninorganic (see for example Newell and Simon, 1957 in which the computational processes of the\nLogic Theorist program are explicitly analogized to those of the human mind); and in an\nunderstanding of the Smithian invisible hand as essentially a maximization process under constraints,\nand therefore interpretable as an algorithmic process. Stafford Beer imagined the complex\necosystem of a pond as essentially a distributing computing process, a slew of organisms acting\nsimultaneously for their own ends, capable of being harnessed as a control system and used to\nmanage industrial production (Pickering 2010, 2). While this enterprise was not successful, it\nrepresents a way of thinking about large scale distributed behaviors that remains relevant. Beer\nlater applied the idea of cybernetics to develop a sort of radical socialist economic planning in Chile\nunder Allende, though his control systems here were electronic rather than organic (Medina 2011).\nHe did however envision using human beings as part of the control system in the form of \"Project\nCyberfolk,\" which collected opinions about the happiness of the Chilean people via so-called\n\"algedonic\" meters to be used to aid in the economic planning project (Medina 2011, 89). His\ninspiration, to use \"the [human] brain as a computer, structured and programmed by individuality,\"\nto provide real-time feedback about how the system was operating, is particularly relevant to the\nnotion of seeing independent human actions, properly harnessed, as a distributed computation\n(Medina 2011, 89). Herbert Simon, in his management science work, developed the idea of bounded\n\nrationality to describe human decision making: the decision maker is not a perfect information\nprocessor, but nonetheless the general scope of what he or she does is process information under\nconstraints (Simon 1997, 291). And if the economic world is made up of a large collection of\nprocessors acting imperfectly based on incomplete local information, but manages to produce in the\naggregate what largely appear to be \"efficient\" outcomes, then this looks like a distributed\ninformation processor that largely works quite well. Buoyed by advances in computational power,\nthere have been discussions since the 1990s that a revival of cybernetic techniques of centralized\neconomic control, like Beer's Project Cybersyn, might be possible with contemporary computational\nresources, and might produce outcomes as good or better than the free market (see Cottrell and\nCockshott 1993, Cottrell and Cockshott 1994). Whether or not this is true depends on what is\ngained and lost in the centralization of control, as compared with distributed economic decisions\nthat may be locally efficient but impose some loss at the aggregate level. But at any rate, in the\nhistorical context of Cybernetics and rationalist economic modeling, it is not absurd to suggest that\npeople coming together in markets of goods and ideas, through uncoerced liberal exchange, are\njoining themselves into what is essentially a society-sized information processor.\n\nHow does such an information processor function, and maintain coherence? Since Shannon\nand Weaver's Mathematical Theory of Communication, it has been possible to conceive of at least\nsome aspects of human communicative behavior as communication, in the formal sense of\ninformation transfer. Much hinges on the definition of information, and this does not necessarily\ninclude all aspects of human speech. But all manner of economic statements are well within the\nbounds of the information processing paradigm: \"X's are worth Y\" or \"I will purchase W Zs\"\n\ncertainly qualify, as do more complex statements like \"take two aspirin, and call me in the morning.\"\nAnd the production and weaving together of these statements into patterns of behavior--the\ninventing, producing, purchasing and consuming of the talked-about products--depends on the\ncollectively harnessed action of individual human minds. There is a comforting naturalness to the\nview of economic growth as a product of collective human brainpower. It aligns with the fundamental\nclaims of McCloskey's Bourgeois Virtues. Trade-tested betterment is a process that relies on profit\nas the heuristic of goodness; profit means do more of this, loss means do less of that. The\narticulation of what to do therefore \"comes from the dollar votes of ordinary people, a democracy of\nwhat people in aggregate are willing to pay\" (McCloskey 2016, 565). Deciding what to pay is an\ninformation process, a weighing of costs and benefits: computation at its finest, salted with a liberal\nhelping of psychology, consumerism, impulse buying, and retail therapy. And the market system, in\nlinking many of these individual computations together, builds a distributed computation system that\n\"calculates\" the appropriate price, allowing for human foibles in the process.\n\nTo say that growth is about computation is not to say humans have changed. It is not that\nwe have become substantially smarter over the past two centuries in any sort of biological way.\nImprovements on IQ tests are the result not of genetic improvements but increased training in the\ntype of analytical thinking tested for on IQ tests (see e.g. Wicherts et al. 2004). The unlocked\nsuccess is not about the abilities of individuals, which were always there, but the opportunities for\nthem to exercise those abilities (McCloskey 2016, 474). Brainpower that was once wasted, or whose\nfruits were ignored as sinful or worthless, finally achieves a life-sustaining commercial outlet. While\nthe great masses of humanity lived a meagre existence, trodden into the dirt generation after\n\ngeneration, only an aristocratic few produced society's ideas, and many of these (Sorry, Socrates;\nforgive us, Leonardo; mea culpa, Galileo) either hid their ideas or found themselves persecuted for\nthem. And these ideas, tested as they might have been by philosophy, science, and the arts, were\nnot put to tests that pushed them to be useful at producing surplus, or perish. (This surplus test\nwas good for human welfare, though whether or not such a perspective is a good thing for the arts,\nor for example, the modern public university, is another question.) McCloskey's \"sweet talk,\" which\nis a large, increasing, and formerly neglected portion of the economy, seems to be the\ncommunications protocol by which this trade-tested betterment is orchestrated--deciding what is to\nbe done, connecting buyers and sellers, convincing them to make deals, directing them at what\nbooks to read, chiding them to eat their vegetables. This talk is not obviously computational, to the\nlayperson; but it does transfer information, in that it structures the actions of individuals and\nthereby acts as the behavioral glue that holds the whole structure together. So to the information\ntheorist, networks of talk can be networks of computation. To view the Great Divergence as\ncomputational is essentially to accept McCloskey's premise that all depends on the dignity of the\ntrade test and the dignity of the common people engaged in the practice, whose brainpower,\nhowever large or small individually, contributes just one more little input to move the market in the\nappropriate direction.\n\nAs discussed, this computational explanation fits with contemporary ideas about complex\nsystems, and humans as essentially organic computers. And it is also in line with some previous\nscholarship on industrialization, including Beniger's deeply ambitious The Control Revolution, which\nattempts to write the entire history of life itself, from bacteria to Boeing 747s, as a process of\n\nexerting control over longer distances at greater speed. Here, Beniger draws from the intellectual\ntradition of the likes of Lewis Mumford, who in Technics and Human Development wrote that the\nprimary, contemporary advancement (not a good thing, mind you) of the \"megamachine\" has been\nthe replacing of \"recalcitrant and uncertain human components with specialized mechanisms of\nprecision made of metal, glass, or plastics,\" and thereby \"Power, speed, motion, standardization,\nmass production, quantification, regimentation, precision, uniformity, astronomical regularity,\ncontrol, above all control--these became the passwords of modern society in the new Western style\"\n(Mumford 1967, 294). Mumford's megamachine originally existed in antiquity, as a mechanism of\ncentralized control for large collections of human beings responsible for building the great works of\nthe Ancient World, like the pyramids. And this sort of control does fit into the mold of computation\nand information processing as conceived here. But the new, faster, more powerful version of the\nmegamachine brings with it new capabilities of mass production for mass society. Likewise, for\nBeniger, the Industrial Revolution was essentially caused by increases in the speed of transmission\nof goods and ideas. His chain of causation touches upon many of the levels we have already seen:\nnew sources of energy, among other things, sped up the \"entire societal processing system\" and\nthereby put \"unprecedented strain\" on all the \"technological and economic means by which a\nsociety controls throughputs to its material economy\" (Beniger 1986, 218). The \"continuing\nresolution of these crises\" of control resulted in advances in communication technology, from trains\nto telegraphs to modern information technology, that supported the increased energy utilization and\nprocessing speed that have made the modern world what it is (Beinger 1986, 218, 293). So this too\nis a technical-ideational explanation, in the mold of previous scholarship discussed here. Meanwhile,\n\nadvances in marketing and the production of a mass market, and advances in data processing and\nbureaucratic control of organizations, make clear that control is aligned with our notion of\ncomputation. Like the efficiency of the market, advances in control are outcomes of distributed\nsystems acting in their own interests (something Beniger roots, rather loosely, in processes of\nevolution and natural selection). Control is expressed in the form of the \"twin activities of\ninformation processing and reciprocal communication,\" explicitly informational and thereby\ncomputational in our usage (Beniger 1986, 434). Innovation is, he writes, \"increasingly a collective,\ncumulative effort,\" and therefore technologies of storage and retrieval of information are advanced\nto serve this need by linking together the capacities of many individuals in more efficient ways\n(Beniger 1986, 434). While I am skeptical of the value of Beniger's broad historical scope, and find\nhis reaching back to bacteria and evolutionary selection to be a risky and ill-founded enterprise,\nmuch of what he describes in the era of Industrial Revolution, and subsequent \"Control Revolution,\"\nfits with other histories of organizational technologies (see e.g. Yates 1989).\nComputation as a Model for Growth\n\nSo the literature is behind this computational narrative. But what new perspective does it\nprovide us? Like each of the other divergence stories, computation presents its own read on the\neconomic questions of interest. If one were to write out a set of equations for the networked,\ndistributed computation model for economic growth, it might look something like this:\n\nCmaterial ~ N P + N n T\n\nCcognitive ~ N n S E γ\n\nG = α Cmaterial + β Ccognitive + K\n\nHere, the two C factors are the human components to growth, one in terms of material things and\nthe other in terms of ideas; N is the size of the human informational network (number of people\nconnected); P is an average measure of material productivity of each connected person (which\nincludes the impact of machine labor and computational tools used directly by the laborer); n is a\nmeasure of network density (number of connections per person); T is a McCloskeyan \"sweet talk\"\nfactor, that measures the sophistication and effectiveness of sweet talk in transactions of goods\n(which also may involve computational tools used by the laborer to further these exchanges); S is\nthe speed and productivity of connections in the network (which depends on properties of the\ninformation channels used); E measures the accumulated skills and education of the participants in\nthe network; γ is a possible difficulty scale factor to deflate this innovation term (if one accepts the\nidea that innovations get progressively more difficult to achieve over time); K is a term to express\nthe impact of artificial computational power hooked up to these networks in the appropriate way,\nnot directly operating through human participants (think Beer's Project Cybersyn), and G is total\neconomic growth. Alpha and beta are unknown scale factors, and indeed there may be terms\nmissing, and other scale factors involved that are not provided in this sketch. But as a rough model,\nthis relationship of terms provides certain predictions that are directly in line with historical\nevidence, and the other notions of the Great Divergence surveyed above.\n\nAs general trends, this model predicts we would see that growth increases where: more\npeople are connected to each other in dense networks (N and n); material productivity per person\n\nincreases (P); speed of transmission of ideas increases (S); exchanges happen more smoothly or\nreadily (T); people have greater education and skills (E); and artificial computational power included\nin these networks increases (K). Of these, the only claim unsupported by existing data is the last\none--trivially, because this model was built directly from the claims of the other four divergence\nnarratives. But what this model provides is comparability of the K factor to the rest of growth. Just\nas human brainpower needs to be \"hooked together\" in the right way, via networks of exchange,\ncomputers might be hooked to the economy in the \"right way\" to contribute to these networks in a\nlargely independent way. We have no good model, yet, for what this K component really represents.\nBeer's Cybersyn project would be included here, had it remained in operation. It is possible that\nhigh-frequency trading technologies are included in this term as well; though managed and surveyed\nby people, computers that automatically make trades on the stock market start to suggest the kind\nof independent action that would support pulling them out of the human-network terms. But there is\nnothing fundamental about human beings as information processors that allows us to rule out the\nexistence of such a term, in the computational hypothesis. Because of its construction, our model of\ngrowth should show continuity between the Industrial Revolution and the Control Revolution/IT\nRevolution, though the size of the K parameter may be increasing over time. The key question\npresented is the size of that term.\n\nThe computational explanation has advantages over other portrayals examined here, in that\nit provides a framework in which to unify market demography, the transmission of goods, and the\ntransmission of ideas as economic actions responsible for betterment. It depends on the dense\nmarket connections between people that are supported by scholars of the European marriage\n\npattern, but it does not present a Malthusian paradox. The model is not necessarily dominated by N\nalone, if it comes at the cost of advances in productivity (and indeed a large population, but low\nmarket-participating population, would present a low N in this model anyway). Computation\npresents a more fundamental cause than resources alone (which are not fixed, but expand in type\nand efficacy with ideas about how to harness them), or institutions (which depend on cultures,\nincluding flows of ideas, to function). And computation is less general than cultures (nebulous and\ndifficult to define) or ideas (which ideas, and what did they do?) alone. It provides a structure to the\nrelevant components, and a direct way to link them to outcomes through distributed processes of\ndecision making. It also takes seriously the notion that much economic work is sociomaterially\nperformative; that stories, speech acts, and practices create reality. Ben Bernanke, hardly a bastion\nof postmodern thought, has oft repeated that 98% of monetary policy is talk, creating the stories\nthat economic actors will follow (Bernanke 2015). And a computational/information processing\nmodel of growth actually manages to account for the labor of sweet talking. This much is essentially\nMcCloskey's argument in different terms. But the recognition that the ideational hypothesis really\ndescribes a distributed computational system leads to different considerations for the future.\nProtecting liberalism alone, to harness the decision-making powers of human beings en-masse, is no\nlonger the only way to proceed. For much of history, human beings have been the most powerful\ninformation processors on Earth (Timmer 2011). The billions of us, taken together, still are. But\nbetween the slow successes of artificial intelligence and the expansion of inorganic computation in\nline with Moore's performative heuristic (I shall not call it a \"law\")--and new developments in\nquantum computers, biological computers, and other modes of calculation, that may extend that\n\ntrend--it is possible that our computing power will one day be eclipsed. At the very least we have\ngreater and greater reserves of non-human calculating power to draw from, which is part of what\nBeniger's Control Revolution concept is all about. We should see increases in economic growth with\nincreasing involvement of information technologies, either through increased productivity of human\nbeings or through new structures of information processing and market control: K. The increases in\ngrowth will not be near the total increase in computational power, because not all this power is\nharnessed toward economic ends. And not all growth that is due to the harnessing of artificial\ncomputation will reside in the K term, as some is hidden within P, T, and S. But if K is increasing,\ndoes this mean that humans' role in driving economic growth might also be on the wane? Can\nadditional computation power speed growth further? And do we need liberal trade-tested\nbetterment, or can we substitute for it artificially, in a computationally advanced planned economy?\n\nAutomation and the Future of Labor\n\nIdeas matter. I do not argue with McCloskey's thesis. But ideas matter most strongly in\nparticular ways. Liberalism in particular matters for growth because it triggers tinkering, sharing,\nand entrepreneurship, and because it produces mass markets and mass consumption to support this\nentrepreneurship. Reframing the ideational hypothesis as essentially a computational one reorients\nfocus away from the distracting questions of what power ideas have over material circumstances, and\ntoward the particular kinds of cognitive and cognitively supported labor that other historians and\neconomists have already connected to economic performance. The computational approach\nhighlights trade and invention. If changes in ideas were limited to philosophical or aesthetic pursuits,\n\nor if they were simply about new ways to consume coffee or chintz, they would not have had the\neffect that they did. The power of ideas comes in the linking together of large numbers of people in\nrelationships of essentially mutual advantage, across a broad range of industries, and of incentivizing\nnew and more efficient ways of performing these relationships. Under the computational hypothesis\nfor the Great Divergence, the primary trade-off for continued growth seems to be one of advancing\nliberalism (the C terms) or expanding technocracy (the K term). Two arguments can be made. In the\nconventional case, what is necessary is to protect the gains we have made in trade-tested\nbetterment in the developed world and to expand these gains to the bottom billion. In the other\ncase, what is necessary is to increase the joint cognitive power of all economies, more and less\ndeveloped. Education alone is not enough, without the mechanisms to link the educated together\ninto productive networks. But to the extent that artificial computational power can perform the\nsame decision-making roles that McCloskey's liberalized bourgeoisie do, new computer technologies\nstand to assist in this process in a way that is unlike the conventional view, in which they are simply\nthe helpful outputs of a liberal society. Computation as a potentially \"exogenous\" growth factor--\ncertainly human-created but acting independently of individual human actors' decision making--is\nnot something McCloskey's model considers. While technocratic experiments in governance do not\nhave the best track record (e.g. rationalized urban planning), and computation is not a cure-all, this\ndiscourse of computational betterment is nascent within the projects of machine learning, \"Big\nData,\" and the \"Internet of Things.\" Smart things everywhere, processing greater amounts of data\nmore effectively, appear as the technocratic solution par excellence of the last decade. The source\nof the missing masses of the economic growth literature, the component deeply studied at a micro\n\nlevel but largely unacknowledged at the scale of global economic history, may be the distributed\ncomputational power of human groups.\n\nThe computational hypothesis puts somewhat of a sunny face on automation--automation can\nlead to the increase of K, and thereby cause growth, regardless of what happens with the human-\nbased C components. But growth as an outcome of increased computation still falls down, as a\nhumane project, in the same places that growth from liberal ideas does: people who cannot\nparticipate in the marketplace are in trouble. They do not make income, and cannot afford the\nnecessities of life, let alone the expanding range of goods and services that is the product of the\ngrowing economy we might wish to preserve and extend through automation. The causes of this\nfailure to make one's way in the marketplace can be of many kinds--disability, a lack of education\nand skills, skills mismatched with available jobs, various structural reasons like poverty,\nincarceration, etc.--and independently, such issues are lamentable. But in bulk they threaten to\nundermine the entire system. Structural unemployment by way of automation presents a potential\nexistential threat, even in a K-dominated growth model. McCloskey is perhaps a bit cavalier about\nthe relationship between machines and jobs. Consensus of historians of technology seems to be that\nautomation has, at worst, created nearly as many jobs as it has eliminated (and the vast expansion\nof the IT industries in the United States suggests that, indeed, many good jobs have been created\nby contemporary automation), but there is no guarantee that this will continue (Nye 2013, 161-164;\nNoble 1984, 330; Diebold 1953, 63-64). And the jobs that have been created have tended to be\npolarized, either lower or higher in skill and pay, than the jobs that were eliminated (Ford, 50).\nThough to McCloskey, \"robots are merely mechanical slaves for our benefit,\" the our this statement\n\nrefers to is not necessarily the whole of humanity, but only those people who can take advantage of\nthe labor of machines (McCloskey 2016, 497). She argues that \"Deciding what to do cannot in the\nend be mechanized . . . because the argument about what to do is never ended\" (McCloskey 2016,\n498). This seems accurate for at least a certain segment of the population--those fortunate enough\nto possess a graduate degree in Economics from Harvard University, for instance. But it\nemphatically does not mean that everyone can engage in the argument about what to do. Will the\njobs be there for people who need them? Who will pay all these people for all this sweet talking,\nregardless of their skills?\n\nLewis Mumford smartly commented that the old dream to abolish all labor and replace it with\nautomation, indeed one way out of poverty and toil, is a desperate and \"unimaginative\" one\n(Mumford 1967, 241-242). \"It ignored the fact that work which is not confined to the muscles, but\nincorporates all the functions of the mind, is not a curse but a blessing. No one who has ever found\nhis life-work and tasted its reward would entertain such a fantasy, for it would mean suicide\"\n(Mumford 1967, 242). There will always be jobs for some people, those capable of using technology,\nof competing in the liberal marketplace of ideas. But jobs for everyone are not guaranteed. They\nnever have been. But particularly if the computational explanation is right, and a declining human\nparticipation in the intellectual economy that sustains growth can be compensated for by increasing\nmachinic participation, then the assumption that the liberal tide lifts all boats may no longer be\nvalid. Growth could be maintained overall even while labor force participation declines, and an\nincreasing section of the workforce is left behind.\n\nThe world in which machines contribute to the economy in precisely the same way that\n\npeople do, thereby maintaining the old status-quo, is not the world we see today, or can expect to\nsee. So instead of the productive \"ghost acres\" made possible by coal, we might be living in the age\nof legions of \"ghost producers\" whose limited material needs can eventually be met by a fraction of\nhuman society. None of the economic growth hypotheses, not demographics, resources, institutions,\nideas, or computation, can guarantee an escape from the constant problem of who is able to benefit.\nWhile liberalism may have done a better job so far than other social organizations, there is no\nreason to think it is proof against technological changes. Thinking about growth as the output of a\ndistributed information-processing and problem-solving process has the potential to put humans and\nmachines on more equal footing in our calculations, and thereby do a better job of assessing what\nthe impacts of computing really are. If K remains marginal, this model does little but attempt to\nmake McCloskey's ideational hypothesis explicit about how we get from ideas to growth. And if K is\nlarge, humans are still not guaranteed the jobs they need to either afford goods or find meaning in\nlives culturally defined around occupations. But there is hope here, in this otherwise perhaps dismal\npicture. If the computational model is right, then growth can be maintained in the long term even\nwith a decline of participation in the labor force. The K term can grow larger, while the other terms\ndecrease. This change would come with great unrest. Dealing with such an economy will require\nstructural changes to society: something like a universal basic income becomes a necessity if most\npeople's participation in liberalized trade is not possible. But, on the plus side, such a switch to\nuniversal income and high unemployment--in the traditional sense of unemployment--would not\nnecessarily set the economy into a death spiral from which it would not recover. In this model, it\nappears entirely feasible to maintain growth and humane distribution of the necessities of life; so\n\nlong as K/N is large enough, there is sufficient material wealth to go around that everyone can be\nprovided for at some reasonable standard. And there may be a second light at the end of the tunnel.\nFreed from the need to contribute to Cmaterial in order to survive--and freed, in McCloskey's terms,\nfrom the tyranny of the profane P's--a society that made this transition could put more of its\nresources elsewhere, into Ccognitive and the sacred S's that provide new opportunities for meaning in\na changed landscape of production. This is not Mumford's feared abolition of labor, but a possible\ndemobilization of human beings from the confinement and regimentation of the megamachine.\n\nReferences\n\nAcemoglu, Daron and James Robinson. Why nations Fail: The Origins of Power, Prosperity, and\nPoverty. New York: Crown Publishing Group, 2012.\n\nBeniger, James R. The Control Revolution: Technological and Economic Origins of the Information\nSociety. Cambridge, MA: Harvard University Press, 1986.\n\nBernanke, Ben. \"Inaugurating a new blog.\" Brookings, March 30, 2015.\nhttps://www.brookings.edu/blog/ben-bernanke/2015/03/30/inaugurating-a-new-blog/\n\nBrenner, Rober. \"The Agrarian Roots of European Capitalism,\" Past & Present, No. 97 (1982): 16-\n113.\n\nBrynjolfsson, Erik and Andrew McAfee. The Second Machine Age: Work, Progress, and Propserity\nin a Time of Brilliant Technologies. New York: W. W. Norton & Company, 2014.\n\nCenter for Disease Control and Prevention (CDC). First Marriages in the United States: Data From\nthe 2006-2010 National Survey of Family Growth. National Health Statistics Reports, No. 49,\nMarch 22, 2012. https://www.cdc.gov/nchs/data/nhsr/nhsr049.pdf (See also more recent brief\n\ntables: https://www.cdc.gov/nchs/nvss/marriage_divorce_tables.htm)\n\nCottrell, A. and W. P. Cockshott. \"Calculation, complexity and planning: the socialist calculation\ndebate once again.\" Review of Political Economy, Vol. 5, (1993): 73-112.\n\nCottrell, A. and W. P. Cockshott. \"Information and Economics: A Critique of Hayek,\" Reality,\n1994. Unpublished web material. http://reality.gn.apc.org/econ/hayek.htm\n\nCrafts, N. F. R. British Economic Growth during the Industrial Revolution. Oxford, UK: Clarendon\nPress, 1985.\n\nDiebold, J. \"Automation--The New Technology,\" Harvard Business Review, Vol. 31, No. 6 (1953):\n63-71.\n\nEltis, Walter. The Classical Theory of Economic Growth. Hampshire, UK: Palgrave, 2000 (reprint).\n\nFord, Martin. Rise of the Robots: Technology and the Threat of a Jobless Future. New York: Basic\nBooks, 2015.\n\nFranko, P. M. The Puzzle of Latin American Economic Development (3rd ed.). Lanham, MD:\nRowman & Littlefield, 2007.\n\nHajnal, John. \"European Marriage Patterns in Perspective,\" in Population in History, Eds. D. V.\nGlass, D. E. C. Everday. London: Edward Arnold LTD, 1965.\n\nHayami, Akira. Japan's Industrious Revolution: Economic and Social Transformations in the Early\nModern Period. Springer Japan, 2015.\n\nHyman, Louis. \"Unnatural Capitalism: How the New Deal Reinvented Capitalism and Why We Need\nto Do It Again,\" presentation given at the Institute for the Future, December 01, 2016.\nhttps://www.periscope.tv/IFTFFutureNow/1ZkJznjnLPqJv\n\nJevons, W. Stanley. The Coal Question: An Inquiry Concerning the Progress of the Nation, and the\nProbably Exhaustion of our Coal-mines. New York: Augustus M. Kelley, 1965 (reprint).\n\nJones, Eric L. The European Miracle: Environments, Economies, and Geopolitics in the History of\nEurope and Asia. Cambridge University Press, 1981.\n\nKennedy, W. P. \"Foreign Investment, Trade and Growth in the United Kingdom, 1870-1913,\"\nExplorations in Economic History, Vol 11 (1974): 415-44.\n\nMartin, Richard. \"First Solar's Cells Break Efficiency Record,\" MIT Technology Review, March 3,\n2016. https://www.technologyreview.com/s/600922/first-solars-cells-break-efficiency-record/\nMcCloskey, Deirdre N. Enterprise and Trade in Victorian Britain: Essays in Historical Economics.\nLondon: Routledge, 1981.\n\nMcCloskey, Deirdre Nansen. Bourgeois Equality: How Ideas, Not Capital or Institutions, Enriched\nthe World. Chicago: University of Chicago Press, 2016.\n\nMeadows, Donella H, Dennis L. Meadows, Jørgen Randers, and William W. Behrens III. The Limits\nto Growth: A Report for the Club of Rome's Project on the Predicament of Mankind. New York:\nUniverse Books, 1972.\n\nMedina, Eden. Cybernetic Revolutionaries: Technology and Politics in Allende's Chile. Cambridge,\nMA: MIT Press, 2011.\n\nMokyr, Joel. \"The Intellectual Origins of Modern Economic Growth,\" The Journal of Economic\nHistory, Vol. 65, No. 2 (2005): 285-351.\n\nMokyr, Joel. The Enlightened Economy: An Economic History of Britain, 1700-1850. New Haven,\nCT: Yale University Press, 2009.\n\nMumford, Lewis. The Myth of the Machine: Technics and Human Development. New York: Harcourt\nBrace Jovanovich, Inc., 1967.\n\nNewell, Allen, J. C. Shaw, and Herbert Simon. \"Elements of a Theory of Human Problem Solving,\"\nSanta Monica, CA: Rand Corporation, 1957.\n\nNoble, D. F. Forces of Production: A Social History of Industrial Automation. New York: Knopf,\n1984.\n\nNorth, Douglass C. \"Institutions,\" The Journal of Economic Perspectives, Vol 5., No. 1 (1991): 97-\n112.\n\nNye, David E. America's Assembly Line. Cambridge, MA: MIT Press, 2013.\n\nParthasarathi, Prasannan. Why Europe Grew Rich and Asia Did Not: Global Economic Divergence,\n1600-1850. Cambridge, UK: Cambridge University Press, 2011.\n\nPickering, Andrew. The Cybernetic Brain: Sketches of Another Future. Chicago: University of\nChicago Press, 2010.\n\nRichardson, H. W. Economic Recovery in Britain, 1932-1939. London: Weidenfeld and Nicolson,\n1967.\n\nPomeranz, Kenneth. The Great Divergence: Europe, China, and the Making of the Modern World\nEconomy. Princeton, NJ: Princeton University Press, 2000.\n\nRosenthal, Jean-Laurent, and R. Bin Wong. Before and Beyond Divergence: The Politics of\nEconomic Change in China and Europe. Cambridge, MA: Harvard University Press, 2011.\n\nSchumacher, E. F. Small is Beautiful: Economics as if People Mattered. New York: Harper\nPerennial, 1989 (reprint).\n\nShannon, C. E., and W. Weaver. \"The Mathematical Theory of Communication.\" Urbana, IL:\nUniversity of Illinois, 1949.\n\nSimon, Herbert. Models of Bounded Rationality: Empirically Grounded Economic Reason, Vol. 3.\nCambridge, MA: MIT Press, 1997.\n\nSugihara, Kaoru. \"The Second Noel Butlin Lecture: Labour-Intensive Industrialization in Global\nHistory,\" Australian Economic History Review, Vol. 47, No. 2 (2007): 121-154.\n\nTimmer, John. \"World's Total CPU Power: One Human Brain,\" WIRED, February 11, 2011.\nhttps://www.wired.com/2011/02/world-computer-data/\n\nWallerstein, Immanuel. The Modern World-System I: Capitalist Agriculture and the Origins of the\nEuropean World-Economy in the Sixteenth Century. New York: Academic Press, 1974.\n\nWicherts, J.M., C. V. Dolan, D. J. Hessen, P. Oosterveld, G. C. M van Baal, D. I. Boomsma, and\nM. M. Span. \"Are intelligence tests measurement invariant over time? Investigating the nature of\nthe Flynn effect,\" Intelligence, Vol. 32, No. 5 (2004).\n\nWilliamson, John. \"What Should the World Bank Think About the Washington Consensus?\" World\nBank Research Observer, Vol. 15, No. 2 (2000): 251-264.\n\nWilliamson, John. \"Did the Washington Consensus Fail?\" Outline of Remarks at CSIS. Washington\nDC: Institute for International Economics, November 6, 2002. https://web-\nbeta.archive.org/web/20030207212143/http://www.iie.com/papers/williamson1102.htm\n\nWrigley, E. A. Energy and the English Industrial Revolution. Cambridge, UK: Cambridge University\nPress, 2010.\n\nVoigtlander, Nico and Hans-Joachim Voth. \"Malthusian Dynamism and the Rise of Europe: Make\nWar, Not Love,\" The American Economic Review, Vol. 99, No. 2, Papers and Proceedings of the\nOne Hundred Twenty-First Meeting of the American Economic Association (May, 2009), pp. 248-\n254.\n\nYates, JoAnne. Control through Communication: The Rise of System in American Management.\nBaltimore, MD: Johns Hopkins University Press, 1989.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n21H.383 / 21H.982 Technology and the Global Economy, 1000-2000\nFall 2016\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    }
  ]
}