{
  "course_name": "Tennis",
  "course_description": "The goals of this instructional course are to get you started in this wonderful sport and to give you a working knowledge of tennis. It should help you to understand the basics of a sport and how to perform these basics. Most of the course will focus on the basic stroke techniques. Variation to those techniques will be presented, as well as drills and games, so that you can take it to the court. Singles and doubles tactics will be covered as well.",
  "topics": [
    "Health and Medicine",
    "Physical Education and Recreation",
    "Health and Medicine",
    "Physical Education and Recreation"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week for 6 weeks, 1 hour / session\n\nTennis is truly a lifetime sport. Once you learn the basic skills, the benefits of playing are endless - fitness, friendly competition, and personal improvement, to name a few.\n\nCourse Description\n\nThe goals of this instructional course are to get you started in this wonderful sport and to give you a working knowledge of tennis. It should help you to understand the basics of a sport and how to perform these basics. Most of the course will focus on the basic stroke techniques. Variation to those techniques will be presented, as well as drills and games, so that you can take it to the court. Singles and doubles tactics will be covered as well.\n\nRequirements\n\nNon-marking Court Shoes (No running shoes, snowshoes, boots, cleats, dress shoes, etc. Tennis, basketball, volleyball, squash shoes, most x-trainers OK.)\n\nTennis Racket\n\nAthletic Clothes\n\nPunctuality\n\nEnthusiasm/Teamwork/Hustle - You don't have to be the fastest, strongest, most athletic, most skilled, tallest, etc...\nto try hard\n!!!\n\nFor those students taking this class for PE credit, you may miss one class and still get credit. If you need to make up a class, you can come to the other B. Tennis class offered this quarter: MW11.\n\nNotes\n\nPlease start warming up with a classmate(s) upon arrival to the class.\n\nPlease make an effort to learn each other's names.\n\nAbout the Instructor\n\nA three-time NEWMAC women's tennis Coach of the Year, Carol Matsuzaki steered the Engineers to four consecutive NEWMAC Championship titles from 1999-2002 and has led numerous individuals to appearances at the NCAA Championships.\n\nHailing from Los Angeles, Calif., Matsuzaki came to MIT in 1991 majoring in biology and literature. In addition to varsity tennis, Carol played JV squash and was a member of the Tennis Club. She captained the tennis team from 1994-96 and was the 1993 NCAA team MVP and the NEW 8 Player of the Year in 1995.\n\nUpon graduating in 1996, Carol became the assistant coach of the team until her appointment as head coach in the spring of 1998.\n\nMatsuzaki has truly risen through the ranks to assume her current position as head women's tennis coach. She began her tennis career as an undergraduate at MIT, picking up the racket for the first time in a physical education class. Matsuzaki was a quick study and steadily improved, making the varsity team where she was the No. 1 singles player her senior year.\n\nCarol received her graduate degree in Sports Psychology from Boston University in 1997. In 1998, she guided two members of her team to the NCAA Championships for the first time.",
  "files": [
    {
      "category": "Resource",
      "title": "backhandassn.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/pe-710-tennis-spring-2007/0cef32b6a2560dad2e3d1b1db40354e9_backhandassn.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "forehandassn.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/pe-710-tennis-spring-2007/76c58a09d26f3fbbc23c38a17f9f31e2_forehandassn.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "serveassn.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/pe-710-tennis-spring-2007/c3b6b6a74022d1811828be6439c041c0_serveassn.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "volleyassn.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/pe-710-tennis-spring-2007/b62e4f557b1d6591abc1bcbc426fa941_volleyassn.pdf",
      "content": ""
    }
  ]
}