{
  "course_name": "Territory: Spatial Reification of Power",
  "course_description": "This course proposes that investigating the ways in which territory is produced, maintained and strategized, generates conflicts, establishes divisions, and builds identities can lead to a more critical understanding of architecture’s role in society. This course is designed to expand the student’s literacy in the concept of territory and its relation to the realm of architecture.",
  "topics": [
    "Business",
    "Globalization",
    "Fine Arts",
    "Architecture",
    "Architectural Design",
    "Architectural History and Criticism",
    "Society",
    "The Developing World",
    "Business",
    "Globalization",
    "Fine Arts",
    "Architecture",
    "Architectural Design",
    "Architectural History and Criticism",
    "Society",
    "The Developing World"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 3 hours / session\n\nCourse Overview\n\nThe simple differentiation between \"inside\" and \"outside\" has politically configured the world as we see it today.\n\nIncreasingly, architectural thinking has addressed large-scale systems, such as those of cities, landscapes, regions, and even the world. With this increase in scale, the distinctions between architecture and geography get blurred and many aspects of those disciplines become interchangeable. However, although architecture claims agency in addressing geographical questions, there seems to be little understanding of one of the most fundamental aspects of large-scale spatial systems, the concept of \"territory.\"\n\nTo discuss \"territory\" is to move away from an apparent ordinary neutrality of the term to incorporate all the complexities inherent in the relation between place and power. What is usually taken for granted, imagined as natural, is in fact a highly articulated, historically defined social construct. Far from being an object, \"territory\" is a political technology (Elden, 2013), an apparatus of control we have gotten used to.\n\nThis course proposes that investigating the ways in which territory is produced, maintained and strategized, generates conflicts, establishes divisions, and builds identities can lead to a more critical understanding of architecture's role in society. Architecture, especially because it is always political--even in a rudimentary level it expresses ideological positions by limiting and separating one part from another--can be seen as a form of reproducing territorial logics into a smaller scale context. Architecture can be seen as a form of reproducing territorial logics into a smaller scale context. The overlap between architecture and \"territory\" are many, from concerns with the way the interplay of social and political forces gets spatialized, to more general issues such as struggles over land division, property rules, private vs. public realms, dominance vs. resistance, the definition of borders, and the reification of power as space.\n\nThis course is designed to expand the student's literacy in the concept of territory and its relation to the architecture realm. The course is structured as a seminar with a research component to be developed throughout the semester. Students will be asked to engage in a research project to explore territorial relations at a specific scale of their interest, e.g. a scale of a country, a neighborhood, a building, etc. Each project will investigate one specific case, either directly related to architecture or not, in which territorial logic is implemented. Drawing on the fact that the advent of \"territory\" was dependent on innovations in cartographic and mapping techniques, the research projects are expected to incorporate a strong graphical component to make these territorial logics visible.\n\nPrerequisites\n\nMIT students were required to obtain permission of the instructor.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nParticipation and Attendance\n\n30%\n\nClass Presentation\n\n20%\n\nMapping Exercise\n\n20%\n\nShort Research Paper\n\n30%\n\nCalendar\n\nSES #\n\nTOPICS\n\nKEY DATES\n\nTerritory, Not Land\n\nThe Production of Territory\n\nCartography and Spatial Calculation\n\nState & Nation\n\nPower & Space\n\nInitial Mapping and Research Topic Presentations\n\nMapping Exercise due\n\nReification--Marx, Lukacs, and Beyond\n\nWorld Urbanization--Theories (with\nRoi Salgueiro Barrio\n, Research Associate at MIT Center for Advanced Urbanism)\n\nWorld Urbanization--Architecture Reactions (with Roi Salgueiro Barrio)\n\nBoundlessness, or Infinite Extension\n\nThe Border\n\nThe Envelope\n\nFinal Presentations\n\nShort Research Paper due",
  "files": []
}