{
  "course_name": "The Human Past: Introduction to Archaeology",
  "course_description": "This class introduces the multidisciplinary nature of archaeology, both in theory and practice. Lectures provide a comparative examination of the origins of agriculture and the rise of early civilizations in the ancient Near East and Mesoamerica. The laboratory sessions provide practical experience in aspects of archaeological field methods and analytical techniques including the examination of stone, ceramic, and metal artifacts and bone materials. Lab sessions have occasional problem sets which are completed outside of class.",
  "topics": [
    "Social Science",
    "Archaeology",
    "Social Science",
    "Archaeology"
  ],
  "syllabus_content": "This page includes a course\ncalendar\nsummarizing the lecture and lab topics.\n\nCourse Meeting Times\n\nLectures: 2 sessions / week, 1 hour / session\n\nRecitations: 1 session / week, 1 hour / session\n\nLabs: 1 session / week, 2 hours / session\n\nOverview\n\nPrior to 13,000 years ago all humans lived in relatively mobile small scale societies characterized by egalitarian social structures. Their subsistence depended on foraging for wild foods (often called \"hunting and gathering\") and reciprocity of exchange. The total human population at 13,000 years bp (before present) has been estimated at about ten million. In the last 13,000 years the human population has increased several hundredfold, and numerous diverse complex societies characterized by food production (agriculture), permanent settlements, hierarchically ranked social structures, and redistributive economic systems developed in most parts of the Old and New Worlds. The attainment of this degree of complexity is often referred to as achieving \"civilization.\" The central theme of this class is the study of the processes leading to the earliest appearance of such societies in the Middle East/eastern Mediterranean region and Mesoamerica. We are interested in examining the similarity and difference in the trajectory of developments in these two regions to better understand the environmental contexts and the cultural processes involved with these changes.\n\nClass Requirements and Mechanics\n\nTo fulfill the HASS-D requirements this subject includes two one hour lectures per week, one hour of recitation, and two hours of lab.\n\nThe required written work includes three papers (ca. 7-8 pages each), a midterm examination and a final examination as scheduled below. Weekly lab exercises and problem sets will be assigned in conjunction with the labs. Attendance and participation in all class activities (lecture, recitation/discussion and lab) will be considered in evaluating your performance in this class. (Students not fulfilling the HASS-D writing requirement will not receive a passing grade.)\n\nTextbook\n\nLamberg-Karlovsky, C. C., and J. A. Sabloff.\nAncient Civilizations: The Near East and Mesoamerica\n. 2nd ed. Prospect Heights, IL: Waveland Press, 1995. ISBN: 9780881338348.\n\nAdditional readings are assigned from journal articles, journal abstracts, and papers from books.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\n1st Paper Assignment\n\n15%\n\nFirst Midterm Examination\n\n17%\n\n2nd Paper Assignment\n\n15%\n\n3rd Paper Assignment\n\n15%\n\nFinal Examination (Exam Period)\n\n20%\n\nLabs Assignments are Issued Weekly and Due the Following Week\n\n18%\n\nCalendar\n\nThe calendar below provides information on the course's lecture (Lec) and lab (Lab) sessions.\n\nSES #\n\nTOPICS\n\nKEY DATES\n\nIntroduction\n\nLec1\n\nIntroductory Remarks - Overview and Class and Lab Logistics\n\nLec2\n\nArchaeology: Nature and Goals; Historical Development as a Discipline\n\nLab1\n\nChronology and Dating Techniques\n\nUnit 1 - Earlier Prehistory: A Brief Overview\n\nLec3\n\nBecoming Human: Early Hominids and the Earliest Technology\n\nLec4\n\nBecoming Human: Early Humans and Emerging Cultural Behavior\n\nLec5\n\nBecoming Human: Modern Humans and the Advent of Modern Behaviors\n\nLab2\n\nChronology and Dating Techniques (cont.)\n\nUnit 2 - The Near East Case Study\n\nLec6\n\nTheoretical Perspectives; Variables to be Considered in Comparative Studies. The Environmental Setting for Domestication and the Evolution of Social Complexity in the Near East\n\nLec7\n\nPre-Neolithic Adaptations and the Natufian in the Near East\n\nLab3\n\nSite Documentation - Map Reading, Site Location\n\nLec8\n\nDomestication: Recognition, Processes and Impact\n\nLec9\n\nOrigins and Expansion of Agriculture and Pastoralism in the Near East Context\n\nLab4\n\nSite Documentation - Mapping\n\nLec10\n\nEarly Village Farming Communities: Geographic Expansion, Emerging Class Stratification and Centralization of Religion\n\nFirst paper due\n\nLab5\n\nStone Technology Lab: Manufacturing Techniques\n\nLec11\n\nThe Earliest Stages of Urbanization: Ubaid and Eridu\n\nLec12\n\nUrbanization and City States: Uruk, Civilization and Writing\n\nLab6\n\nStone Technology Lab: Debitage Identification / Classification\n\nLec13\n\nUrbanization and City States: Ur Political and Social Environments, Material Achievements, the Critical Factors Interacting in the Development of Stratified Society in the Near East\n\nMidterm Examination\n\nLec14\n\nRefocusing on the Comparative Theme: Eurasia - The Americas\n\nUnit 3 - The Mesoamerica Case Study\n\nLec15\n\nPeopling of The Americas. The Mesoamerican Environmental Setting: Lowlands and Highlands\n\nLab7\n\nStone Technology Lab: Artifact Identification / Classification\n\nLec16\n\nPlant and Animal Domestication and the Emergence of Settled Village Life: Tehuacan and Oaxaca\n\nLec17\n\nPlant and Animal Domestication and the Emergence of Settled Village Life: Comparing Processes in Mesoamerica and the Near East\n\nSecond paper due\n\nLab8\n\nCeramics Lab: Ceramics as Archaeological Materials, Forming and Firing Ceramic Vessels\n\nLec18\n\nThe Emergence of the Olmec and Early Lowland Civilization - La Venta\n\nLec19\n\nOlmec Accomplishments\n\nLab9\n\nCeramics Lab: Analysis of Ceramics as Materials\n\nLec20\n\nThe Maya: The Rise of Tropical Rain Forest City-states\n\nLec21\n\nMaya Achievements and the Decline of the Classic Maya\n\nLec22\n\nProf. Dorothy Hosler: West Mexican Metallurgy and its Importance in Interregional Contact\n\nThird paper due\n\nLab10\n\nFaunal Analysis Lab: Bone / Element Identification\n\nLec23\n\nTeotihuacan: The Rise and Fall of a Highland State: Its Social Consequences\n\nUnit 4 - Decline and Collapse\n\nLec24\n\nDecline of Early Civilizations - Social, Political, Economic - An Examination of Potential Causes in Mesopotamia and Mesoamerica\n\nLab11\n\nFaunal Analysis Lab: Bone / Faunal Identification\n\nLec25\n\nDecline of Early Civilizations (cont.)",
  "files": [
    {
      "category": "Resource",
      "title": "paper1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-986-the-human-past-introduction-to-archaeology-fall-2006/acd7763e0ac784d9b343a575f29c6996_paper1.pdf",
      "content": "3.986:\nIntroduction to Archaeology\nFall, 2006\nFirst Paper topic\n-\nModeling the origins of domestication and food production in\nthe Near East\nBackground\nHistorically a number of fairly simplistic models have been proposed to \"explain\" the origins of plant\nand animal domestication and food production in the Near East (see the handout and the Lamberg-Karlovsky and\nSabloff text). Three of the older models whose factors are regarded as still having some historical correctness or\npotential explanatory value are the population pressure hypothesis, the marginal zone hypothesis and the\nneoclimatic change hypothesis. Each emphasizes the importance of one or sometimes two particular factors in\nthe origin of domestication and food production. These factors include climate and environmental change,\npopulation growth, uneven distribution of resources, and human technological \"inventiveness\". However, none\nof these simple models offers a completely satisfactory description of the process in the Near East.\nThe current view\nRecently additional factors and more inclusive models have been proposed, and these views are\npresented in several of your readings, Zeder (2006), Diamond (2002), Bar-Yosef (1998), Henry (1985) and\nMcCorriston and Hole (1991). Each considers the necessary preconditions and initial starting conditions for the\ndevelopment of domesticated plants and the first agricultural societies in the Near East. From these readings it is\nclear that multiple factors act in synergistic combination to bring about early agriculture in the Levant. These\nfactors include:\nthe region's unique geographic conditions,\nchanges in settlement patterns and concomitant changes in social structure,\nlong term population growth,\nuneven distribution of local and regional resources,\nthe influences of individual cultural traditions, and\nmarked and rapid climatic and environmental changes\nYour task\nBased on your readings create a composite model which you feel best accounts for the development of\nagricultural economies in the Near East and prepare a \"flow diagram\" style chart which illustrates this process.\nDescribe your model in an essay of at least seven (7) typewritten pages and support it with specific examples or\nevidence from your readings. Use the chart as an integral part of the essay to illustrate your views. Be sure to\nreference the sources of your ideas and data and use the suggested format for references.\nAdvice\n1. Appropriate length of the text is 7 to 8 pages: typed, double-spaced with adequate margins.\nIt may be longer, but don't exceed 10 pages.\n2. Include a title page and number your pages of text.\n3 . Reference all sources you use. See attached handout for suggested archaeological style format.\n4. Include a 'References Cited' ('Bibliography') section (see style handout for proper format).\n5. Proofread your paper carefully.\n6. Late papers will be penalized, unless prior arrangements for late submission have been made.\nPAPER DUE:\nThursday, October 12\n\n3.986\nIntroduction to Archaeology\nFall 2006\nGuidelines for referencing archaeological/anthropological papers\nBibliographic referencing and citations:\nSeveral slightly different styles are used for bibliographic references and citation in the field of\nArchaeology. One of the most commonly used styles is that followed by the journal American\nAnthropologist.\nYou should use it for all your written work in this subject. Sample references for journal\narticles, books, and papers in books are shown below. Whether a book, journal article or paper in a book, all\nreferences are listed alphabetically in a single-spaced list.\n(examples for journals)\nBrown, F., J. Harris, R. Leakey and A. Walker\nEarly Homo erectus Skeleton from West Lake Turkana, Kenya. Nature\n316:788-792.\nMoore, A.\nA Pre-neolithic Farming Village on the Euphrates. Scientific American\n241(2):62-70.\nMann, A. and E. Trinkaus\nNeandertal and Neandertal-like Fossils from the Upper Pleistocene.\nYearbook of Physical Anthropology 17:169-193.\n(example for books)\nLamberg-Karlovsky, C.C., and J.A. Sabloff\nAncient Civilizations: The Near East and Mesoamerica (2nd ed).\nProspect Heights, IL: Waveland Press.\n(examples for papers in books)\nHenry, D.O.\nPreagricultural Sedentism: the Natufian example. In Prehistoric\nHunter-Gatherers. T.D. Price and J.A. Brown, eds. Pp. 365-384.\nOrlando, FL: Academic Press.\nZihlman, A.\nWomen as Shapers of the Human Adaptation. In Woman the Gatherer.\nF. Dahlberg, ed. Pp. 75-120. New Haven, CT: Yale University Press.\nIn most archaeological writing footnotes are not used for citations. Instead the author's name and the\ndate of the publication are placed in parentheses at the end of the sentence (but within it), to acknowledge\nthe source of the idea or information. Similarly, the source for a quotation is given in parentheses at the end\nof the quote. (Whether a period [\".\"] is required following it, depends on the quote's position in the sentence.)\nThe citation for a quote includes the author's name, date and page number. The following examples are based\non the sources above.\n\nstandard citation\ncitation for a quote\n(Moore 1979).\n(Moore 1979:63).\n(Mann and Trinkaus 1973).\n(Mann and Trinkaus 1973:192).\n(Brown et al. l985).\n(Brown et al. l985:790).\n\nImages removed due to copyright restrictions.\n\"Hypotheses for the origin of agriculture\" (Figures 4-1 through 4-5).\nIn Redman, C. L. The Rise of Civilization: From Early Farming to Urban Society in the\nAncient Near East. San Francisco, CA: Freeman, 1978."
    },
    {
      "category": "Resource",
      "title": "paper2_readings.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-986-the-human-past-introduction-to-archaeology-fall-2006/2b14a8722e86c75b4e0fa8a6bdda3711_paper2_readings.pdf",
      "content": "3.986\nThe Human Past: Introduction to Archaeology\nFall, 2006\nOptional Supplemental Reading for the 2nd Paper Topic\nExcerpts from:\nPhillipson, D.W. 1985.\nAfrican Archaeology.\nCambridge University Press.\nIn the event you would like some general information about the real Upper\nPleistocene/Holocene culture-history of the northern African region, the following readings\nare provided to give you additional background and perspective on developments in the\nregion. However, do not slavishly follow Phillipson's dating or his culture-historic\nframework, as you must rely, first and foremost, on the information provided in the problem\nstatement.\nThe following pages deal with the archaeological sequences in the Sahel, Saharan and\nnorthern African regions for the time periods covered by the Adrar Abu problem.\nMiddle and Upper Palaeolithic\npp. 87 - 94\nEpipalaeolithic (Mesolithic and Later Stone Age)\npp. 105 - 109\nearly farming (\"Neolithic\" and later)\npp. 130 - 135"
    },
    {
      "category": "Resource",
      "title": "paper2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-986-the-human-past-introduction-to-archaeology-fall-2006/95323ab49e7078414cbe9fabc233a0c4_paper2.pdf",
      "content": "3.986 The Human Past: Introduction to Archaeology\n\nFall 2006\n2nd Paper Topic: Reconstruction of the prehistory of the Adrar Abu Massif\nReference\nDaniels, S., and N. David. \"The Adrar Abu: Problem 7.\" In The Archaeology Workbook.\nPhiladelphia PA: University of Pennsylvania Press, 1982. p. 55-62.\nAssignment\nAttempt a concise reconstruction of the prehistory of the Adrar Abu massif. Pay special\nattention to the definition of the environmental sequence and its relationships, if any, to the\ncultural phases represented. What can be said about the prehistoric economy in this region?\nPrepare a coherent, well-organized essay of at least seven (7) typewritten pages (double-\nspaced with adequate margins) dealing with these issues. The paper is to be accompanied by a\nculture-stratigraphic table which summarizes the dating, the sites' stratigraphy and contents, and\nthe changes in environments, as well as changes in the regional economy. Make sure you\nintegrate the table into your discussion in the text.\nAdvice\n1.\nAppropriate length of the text is 7 pages: typed, double-spaced with adequate margins. It\nmay be longer, but do not exceed 9 pages.\n2.\nInclude a title page and number your pages.\n3.\nReference any additional sources you may use.\n4.\nProofread your paper carefully.\n5.\nLate papers will be penalized, unless prior arrangements for late submission have been\nmade.\nPaper Due: Tuesday, November 14.\n\n3.986\nThe Human Past: Introduction to Archaeology\nFall, 2006\nOptional Supplemental Reading for the 2nd Paper Topic\nExcerpts from:\nPhillipson, D.W. 1985.\nAfrican Archaeology.\nCambridge University Press.\nIn the event you would like some general information about the real Upper\nPleistocene/Holocene culture-history of the northern African region, the following readings\nare provided to give you additional background and perspective on developments in the\nregion. However, do not slavishly follow Phillipson's dating or his culture-historic\nframework, as you must rely, first and foremost, on the information provided in the problem\nstatement.\nThe following pages deal with the archaeological sequences in the Sahel, Saharan and\nnorthern African regions for the time periods covered by the Adrar Abu problem.\nMiddle and Upper Palaeolithic\npp. 87 - 94\nEpipalaeolithic (Mesolithic and Later Stone Age)\npp. 105 - 109\nearly farming (\"Neolithic\" and later)\npp. 130 - 135"
    },
    {
      "category": "Resource",
      "title": "paper3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-986-the-human-past-introduction-to-archaeology-fall-2006/80cac159c1f459efc28d93b41a55fe92_paper3.pdf",
      "content": "3.986:\nIntroduction to Archaeology\nFall, 2006\nThird Paper topic\n-\nexamining societal collapse in early civilizations\nBackground\nCollapse and disappearance of early complex societies is an intriguing issue which, no doubt, has\nmultiple and intertwined causes. Even what may be meant by the term \"collapse\" is sometimes vague\nand may involve multiple issues such as\n1) dissolution of political centralization and political entities\n2) decline and disappearance of population centers\n3) decline and disappearance of cultural traditions, elite and/or common\nSources of pressure contributing to any particular collapse are probably multiple and likely occur in\nvarious possible permutations. These sources of pressure might be broadly classified as\n1) Externally generated\nA) Environmental\n2) Internally generated\nB) Social/Cultural\nThese pressures (including both internally and externally generated) may include\n1) Environmental\na) natural disasters\nearthquakes, floods, fires, volcanic eruptions, droughts, disease, violent storms\nb) environmental degradation - sources\nlong term climatic changes\nchanges in sea levels or base levels of drainage, silting up of rivers and harbors\nanthropogenically induced\n2) Social/Cultural\na) population increase\nb) political destabilization - internally generated\nwars, political intrigue, internal revolts\nc) military conquest - externally generated\nd) trade and economic destabilization\nadministrative mismanagement, disruptions of trade and exchange networks\nAs is often the case archaeologists tend to focus on a limited number of factors to explain collapse\nin specific cases. Lately there has been great interest in the role of climatic changes in collapses, in part\ndue to tremendous advances in palaeoclimatic studies. As your readings indicate the collapses of the\nAkkadian empire and the classic Maya civilization have been recently attributed to climatic factors.\nContrarians might argue that collapses are not primarily environmentally induced, but result from social\nand cultural factors including wars, internal population increases, over exploitation of the natural\nenvironment, and the lack of effective means to cope with the social tensions created by these internal\nstresses, and that collapses don't occur as a result of climatic change alone.\nYour task\nBased on the handouts and readings, discuss and compare the decline of the Sumerians (The\nAkkadian empire and/or more generally southern Sumeria in post 3rd Dynasty of Ur times), and the Maya.\nBriefly present a summary for each which you feel reflects the relative importance of climatic and socio\ncultural factors in each case. Do you feel the recent emphasis on climatic change as a driving force may\nunderestimate the importance of social and cultural responses to this stress and others?\nP.T.O.\n\nAdvice\n1.\nAppropriate length of the text is 7 to 8 pages: typed, double-spaced with adequate margins.\nIt may be longer, but don't exceed 10 pages.\n2.\nInclude a title page and number your pages of text.\n3.\nReference all sources you use. (See style handout accompanying first paper topic on website.)\n4.\nInclude a 'References Cited' ('Bibliography') section (see style handout for proper format).\n5.\nProofread your paper carefully.\n6.\nLate papers will be penalized, unless prior arrangements for late submission have been made.\nPAPER DUE:\nTuesday, December 5\nSuggested Readings\nTextbook:\nLamberg-Karlovsky, C.C. and Sabloff, J.A.\nAncient Civilizations: The Near East and Mesoamerica. 2nd Ed.\nProspect Heights, IL: Waveland Press. Pp. 167-169, 288-296, 313-314.\nJournal articles and chapters\n1.\nMorrison, Kathleen D.\nFailure and how to avoid it. Nature 440:753-54.\n2.\nWeiss, H. and R. S. Bradley\nArchaeology: what drives societal collapse? Science 291 (5504), pp. 609-610.\n3. Jacobsen, T and R. McC. Adams\nSalt and silt in ancient Mesopotamian agriculture. Science 128:1251-58.\n4.\nGibson, M.\nViolation of fallow and engineered disaster in Mesopotamian civilization.\nIn T. Downing and M. Gibson (eds.) Irrigation's Impact on Society.\nUniversity of Arizona, Anthropological Papers no. 25:pp. 7-20.\n5.\nKerr, R.A.\nSea-floor dust shows drought felled Akkadian Empire. Science 279:325-26.\n6.\nHaug G.H., D. Gunther, L. C. Peterson, D.M. Sigman, K.A. Hughen, B. Aeschlimann\nClimate and the collapse of Maya civilization. Science 299:1731-35.\n7.\nWeiss, H., M.-A. Courty, W. Wetterstrom, F. Guichard, L. Senior, R. Meadow, A. Curnow\nThe genesis and collapse of third millennium north Mesopotamian civilization.\nScience 261(5124):995-1004.\n8.\nGrossman, D.\nParched turf battle. Scientific American 287(6):32-33. (Dec. 2002)"
    },
    {
      "category": "Resource",
      "title": "lab2_radiocarbon.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-986-the-human-past-introduction-to-archaeology-fall-2006/75cf94c994e0379bd3470a4e1f6099fd_lab2_radiocarbon.pdf",
      "content": "- - - - - - - - - - - - - - - - - - - - - - - - -\n3.986\n-\nThe Human Past:\nIntroduction to Archaeology\nFall\nLaboratory 2: Chronology and Dating Techniques - Radiocarbon Dating\nNotes and readings on 14C dating and calibration\nIntroduction: Radiocarbon dating is a lot more complicated than we've often been led to believe in\nthe popular literature. The overview from Renfrew and Bahn provides some general background on\nthe technique and the abstracts below provide some indication of the increasingly sophisticated\ntechniques and analytical methods use in current radiocarbon assays. One of the most exciting\ndevelopments is the potential pushing back of the utility of the calibration curve to nearly 50,000\nyears.\nAbstracts are provided for the papers announcing the latest 2004 calibration curve, and\nefforts to extend the calibration from 26,000 years to 50,000.\n[Excerpt from: Archaeology: Theories Methods and Practice. (3rd Ed.) Renfrew, C. and P. Bahn.\nLondon: Thames and Hudson. 2000. (pp.138-142)]\nRadiocarbon\nDating\nText removed due to copyright restrictions.\nHistory and Basis of Method.\nText removed due to copyright restrictions.\nCalibration of Radiocarbon Dates.\nText removed due to copyright restrictions.\n\nThe most recent developments in 14C calibration and data analysis\nThe new 2004 IntCal calibration\nReimer, Paula J.; Baillie, Mike G.L.; Bard, Edouard; Bayliss, Alex; Beck, J Warren; Bertrand, Chanda J.H.; Blackwell, Paul\nG.; Buck, Caitlin E.; Burr, George S.; Cutler, Kirsten B.; Damon, Paul E.; Edwards, R Lawrence; Fairbanks, Richard\nG.; Friedrich, Michael; Guilderson, Thomas P.; Hogg, Alan G.; Hughen, Konrad A.; Kromer, Bernd; McCormac,\nGerry; Manning, Sturt; Ramsey, Christopher Bronk; Reimer, Ron W.; Remmele, Sabine; Southon, John\nR.; Stuiver, Minze; Talamo, Sahra; Taylor, F.W.; van der Plicht, Johannes; Weyhenmeyer, Constanze E.\n2004 IntCal04 Terrestrial Radiocarbon Age Calibration, 0-26 Cal Kyr BP.\nRadiocarbon 46(3):1029-1058. (March 2004)\nAbstract:\nA new calibration curve for the conversion of radiocarbon ages to calibrated (cal) ages has been\nconstructed and internationally ratified to replace IntCal98, which extended from 0-24 cal kyr BP (Before Present, 0\ncal BP = AD 1950). The new calibration data set for terrestrial samples extends from 0-26 cal kyr BP, but with much\nhigher resolution beyond 11.4 cal kyr BP than IntCal98. Dendrochronologically-dated tree-ring samples cover the\nperiod from 0-12.4 cal kyr BP. Beyond the end of the tree rings, data from marine records (corals and foraminifera)\nare converted to the atmospheric equivalent with a site-specific marine reservoir correction to provide terrestrial\ncalibration from 12.4-26.0 cal kyr BP. A substantial enhancement relative to IntCal98 is the introduction of a\ncoherent statistical approach based on a random walk model, which takes into account the uncertainty in both the\ncalendar age and the 14C age to calculate the underlying calibration curve (Buck and Blackwell, this issue). The tree-\nring data sets, sources of uncertainty, and regional offsets are discussed here. The marine data sets and calibration\ncurve for marine samples from the surface mixed layer (Marine04) are discussed in brief, but details are presented in\nHughen et al. (this issue a). We do not make a recommendation for calibration beyond 26 cal kyr BP at this time;\nhowever, potential calibration data sets are compared in another paper (van der Plicht et al., this issue).\nNew statistical methods for producing calibration curves\nBuck, C.E. and Blackwell, P.G.\nFormal Statistical Models for Estimating Radiocarbon Calibration Curves\nRadiocarbon, 46(3): 1093-1102. (March 2004)\nAbstract:\nWe report on the development and implementation of a model-based statistical method for the\nestimation of radiocarbon calibration curves using diverse data. The method takes account of uncertainty on both\nthe 14C and calendar scales, coherently integrating data, the calendar age estimates of which arise from different\ndating methods. It also allows for correlation between observations, if they have particular sources of uncertainty in\ncommon. We adopt an approach based on a random walk model, tailoring it to take account of possible calendar age\noffsets between different data sources by adding a random effect component. The latter allows us to use the same\nmodeling framework for constructing the new calibration curve IntCal04, the comparison curve NotCal04, the\nSouthern Hemisphere curve SHCal04, and the marine calibration curve Marine04.\n\nThe effort to push the calibration curve to 50,000 BP\nK. Hughen, S. Lehman, J. Southon, J. Overpeck, O. Marchal, C. Herring and J. Turnbull.\n14C Activity and Global Carbon Cycle Changes over the Past 50,000 Years\nScience 303:202-207.\nAbstract: A series of 14C measurements in Ocean Drilling Program cores from the tropical Cariaco Basin, which have\nbeen correlated to the annual-layer counted chronology for the Greenland Ice Sheet Project 2 (GISP2) ice core,\nprovides a high-resolution calibration of the radiocarbon time scale back to 50,000 years before the present.\nIndependent radiometric dating of events correlated to GISP2 suggests that the calibration is accurate.\nReconstructed 14C activities varied substantially during the last glacial period, including sharp peaks synchronous\nwith the Laschamp and Mono Lake geomagnetic field intensity minimal and cosmogenic nuclide peaks in ice cores\nand marine sediments. Simulations with a geochemical box model suggest that much of the variability can be\nexplained by geomagnetically modulated changes in 14C production rate together with plausible changes in deep-\nocean ventilation and the global carbon cycle during glaciation.\nGraph removed due to copyright restrictions."
    },
    {
      "category": "Resource",
      "title": "lab3_reqd_readin.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-986-the-human-past-introduction-to-archaeology-fall-2006/f72d5ae39fd4eaa18add12b4c845f766_lab3_reqd_readin.pdf",
      "content": "3.986 - The Human Past:\nIntroduction to Archaeology\nFall\nLaboratory 3:\nMapping and Site Documentation\nNotes on the Latitude and Longitude System\nContent removed due to copyright restrictions. Please see the following website:\nhttp://www.uwsp.edu/geo/faculty/ritter/geog101/textbook/essentials/locational_systems.html\n(Ritter, Michael E. The Physical Environment: an Introduction to Physical Geography.)\nNotes on The Universal Transverse Mercator Grid System -\n\"UTM\"\nfrom: Strahler, A. 1960. Physical Geography. New York: John Wiley, p. 52-60.\nGrid Coordinates on the 1000-meter grid\nText and Figures 3.13, 3.14, 3.19 and 3.20 removed due to copyright restrictions.\nAdditional general information on the UTM system and Lat./Long. conversion to UTM can be found on\nline at the following sites.\nGeneral UTM descriptions:\nhttp://erg.usgs.gov/isb/pubs/factsheets/fs07701.html\nhttp://www.uwgb.edu/dutchs/FieldMethods/UTMSystem.htm\nhttp://www.warnercnr.colostate.edu/class_info/nr502/lg3/datums_coordinates/utm.html\nConversion utilities:\nhttp://www.ngs.noaa.gov/TOOLS/utm.html\nhttp://www.uwgb.edu/dutchs/UsefulData/UTMFormulas.HTM"
    },
    {
      "category": "Resource",
      "title": "lab3_utmsheet.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-986-the-human-past-introduction-to-archaeology-fall-2006/bc51d2eecfb5bf0b17dff93d061f0047_lab3_utmsheet.pdf",
      "content": "Universal Transverse Mercator(UTM) Grid, Fact Sheet 077-10 (August 2001)\n09/25/2006 01:00 PM\nThe Universal Transverse Mercator (UTM) Grid\nFact Sheet 077-01 (August 2001)\nMap Projections\nThe most convenient way to identify points on the curved surface of the Earth is with a system of reference lines called parallels of\nlatitude and meridians of longitude. On some maps, the meridians and parallels appear as straight lines. On most modern maps, however,\nthe meridians and parallels appear as curved lines. These differences are due to the mathematical treatment required to portray a curved\nsurface on a flat surface so that important properties of the map (such as distance and areal accuracy) are shown with minimum distortion.\nThe system used to portray a part of the round Earth on a flat surface is called a map projection.\nGrids\nTo simplify the use of maps and to avoid the inconvenience of pinpointing locations on curved reference lines, cartographers superimpose\non the map a rectangular grid consisting of two sets of straight, parallel lines, uniformly spaced, each set perpendicular to the other. This\ngrid is designed so that any point on the map can be designated by its latitude and longitude or by its grid coordinates, and a reference in\none system can be converted into a reference in another system. Such grids are usually identified by the name of the particular projection\nfor which they are designed.\nThe Universal Transverse Mercator Grid\nThe National Imagery and Mapping Agency (NIMA) (formerly the Defense\nMapping Agency) adopted a special grid for military use throughout the world\ncalled the Universal Transverse Mercator (UTM) grid. In this grid, the world is\ndivided into 60 north-south zones, each covering a strip 6° wide in longitude.\nThese zones are numbered consecutively beginning with Zone 1, between 180°\nand 174° west longitude, and progressing eastward to Zone 60, between 174°\nfile:///Users/Harry/Desktop/Universal%20Transverse%20Mercator(UTM)%20Grid,%20Fact%20Sheet%20077-10%20(August%202001).webarchive\nPage 1 of 3\n\nUniversal Transverse Mercator(UTM) Grid, Fact Sheet 077-10 (August 2001)\n09/25/2006 01:00 PM\nand 180° east longitude. Thus, the conterminous 48 States are covered by 10\nzones, from Zone 10 on the west coast through Zone 19 in New England (fig.\n1). In each zone, coordinates are measured north and east in meters. (One meter\nequals 39.37 inches, or slightly more than 1 yard.) The northing values are\nmeasured continuously from zero at the Equator, in a northerly direction. To\navoid negative numbers for locations south of the Equator, NIMA's\ncartographers assigned the Equator an arbitrary false northing value of\n10,000,000 meters. A central meridian through the middle of each 6° zone is\nassigned an easting value of 500,000 meters. Grid values to the west of this\ncentral meridian are less than 500,000; to the east, more than 500,000.\nVirtually all NIMA-produced topographic maps and many aeronautical charts show the UTM grid lines.\nDetermining a UTM Grid Value for a Map Point\nThe UTM grid is shown on all quadrangle maps prepared by the U.S.\nGeological Survey (USGS). On 7.5-minute quadrangle maps (1:24,000 and\n1:25,000 scale) and 15-minute quadrangle maps (1:50,000, 1:62,500, and\nstandard-edition 1:63,360 scales), the UTM grid lines are indicated at\nintervals of 1,000 meters, either by blue ticks in the margins of the map or\nwith full grid lines. The 1,000-meter value of the ticks is shown for every\ntick or grid line. In addition, the actual meter value is shown for ticks nearest\nthe southeast and northwest corners of the map. Provisional maps at 1:63,360\nscale show full UTM grids at 5,000-meter intervals.\nTo use the UTM grid, you can place a transparent grid overlay on the map to\nsubdivide the grid, or you can draw lines on the map connecting\ncorresponding ticks on opposite edges. The distances can be measured in\nmeters at the map scale between any map point and the nearest grid lines to\nthe south and west. The northing of the point is the value of the nearest grid\nline south of it plus its distance north of that line; its easting is the value of\nthe nearest grid line west of it plus its distance east of that line (see fig. 2).\nOn maps at 1:100,000 and 1:250,000 scale, a full UTM grid is shown at\nFigure 1. The Universal Transverse Mercator grid that covers the\nconterminous 48 United States comprises 10 zones--from Zone\n10 on the west coast through Zone 19 in New England.\nfile:///Users/Harry/Desktop/Universal%20Transverse%20Mercator(UTM)%20Grid,%20Fact%20Sheet%20077-10%20(August%202001).webarchive\nPage 2 of 3\n\nUniversal Transverse Mercator(UTM) Grid, Fact Sheet 077-10 (August 2001)\n09/25/2006 01:00 PM\nFigure 2. The grid value of line A-A is 357,000 meters east. The grid intervals of 10,000 meters and is numbered and used in the same way.\nvalue of line B-B is 4,276,000 meters north. Point P is 800 meters\neast and 750 meters north of the grid lines; therefore, the grid\ncoordinates of point P are north 4,276,750 and east 357,800.\nInformation\nFor information on USGS products and services, call 1-888-ASK-USGS, or visit the general interest publications Web site on mapping,\ngeography, and related topics at erg.usgs.gov/isb/pubs/pubslists/.\nFor additional information, visit the ask.usgs.gov Web site or the USGS home page at www.usgs.gov.\nThis document has undergone official review and approval for publications established by the National Mapping Discipline, U.S.\nGeological Survey. Some figures have been modified or added to improve the scientific visualization of information.\nU.S. Department of the Interior -- U.S. Geological Survey -- 509 National Center, Reston, VA 20192, USA\nURL: http:// erg.usgs.gov /isb/pubs/factsheets/fs07701.html -- Page Maintainer: USGS Eastern Region PSC 4\nFor comments or suggestions on this page please use the feedback form\nLast modified: 10:13:30 Mon 07 Aug 2006 -- USGS Privacy Policy and Disclaimers -- Accessibility\nfile:///Users/Harry/Desktop/Universal%20Transverse%20Mercator(UTM)%20Grid,%20Fact%20Sheet%20077-10%20(August%202001).webarchive\nPage 3 of 3"
    },
    {
      "category": "Resource",
      "title": "lab4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-986-the-human-past-introduction-to-archaeology-fall-2006/79d3c391ed74eea29b862fc76b52e0e6_lab4.pdf",
      "content": "3.986\n-\nIntroduction to Archaeology\nFall, 2006\nLab #4 - Mapping (Week 4)\nA.\nTopographic Maps\nMost maps we are familiar with, such as highway maps, provide a 2-dimensional or planimetric\nrepresentation of a particular area. For many purposes, however it is useful to also have the third dimension,\nground elevation or topography which is what a topographic map provides. Topography is generally\nillustrated by a series of lines known as contours, each of which connects all contiguous points of a particular\nelevation. The spacing of these lines, representing a difference in elevation, is the contour interval.\nSome generalizations about contour lines can be made as follows:\n1)\nwhen contour lines cross streams they bend or \"V\" upstream;\n2)\ncontours never intersect or cross (although they may merge at an overhang or cliff);\n3)\nclosed contours represent hills;\n4)\nclosed contours with hatchures represent depressions, the hatchures pointing in the downslope\ndirection. Closed contours within the hatchured contour are descending in elevation unless\notherwise marked;\n5)\nsteep slopes are shown by closely spaced contours, gentle slopes by widely spaced contours;\n6)\ncontour lines always close on themselves or extend between edges of the map.\nThe difference in elevation between the highest and lowest points in a given area is known as relief.\nB.\nTopographic\nProfiles\nA topographic profile is a line that shows the rise and fall of the land surface along a selected line\ncrossing a map. That is, it is a cross sectional view illustrating the relief of the topography. Profiles are\nusually drawn with some degree of vertical exaggeration in order to bring out the nature of the topography. A\nnatural scale profile (vertical and horizontal scales are 1:1) usually gives the profile so little vertical variation\nthat the profile is difficult to read. However highly exaggerated vertical profiles frequently give the profile a\n\"roller coaster\" appearance, and are to be avoided as well.\nIn producing the profile in Exercise 2, be sure to label the X and Y axes, with elevations or distances, and\nindicate North and South on the profile. Also include in a legend, both the vertical and horizontal scales - both\nfractional and graphic.\nOn line resources: Two excellent sources for a summary review of topographic maps can be found at the\nU.S.G.S. (U.S. Geological Survey) web site.\nhttp://topomaps.usgs.gov/\nhttp://erg.usgs.gov/isb/pubs/booklets/usgsmaps/usgsmaps.html"
    },
    {
      "category": "Resource",
      "title": "lab9_adrar_abu.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-986-the-human-past-introduction-to-archaeology-fall-2006/17f5cbaa8786615de48dab326d8d9f65_lab9_adrar_abu.pdf",
      "content": "3.986\nThe Human Past: Introduction to Archaeology\nFall 2006\nLab -\nWeek 9\n-\nPreparation for the Adrar Abu paper\nIssues to consider and things to ponder\n1.\nIs there any significant increase or decrease in the use and discard of stone tools, pottery and faunal\nremains over time at Hassi Eni?\nHow would you go about determining whether the raw numbers\nactually reflect significant changes over time?\nCalculate the \"normalized\" frequencies for stone artifacts and pottery sherds, and consider what\nimpact this normalization would have on minimum numbers of individuals of terrestrial fauna.\n2.\nWhat is the most likely sequence of rock art images based on image content, technique and\nsuperposition.\nCan you assign approximate ages to the images?\n3.\nHow would you interpret the climatic conditions at Hassi Eni, based on the sedimentological\ncharacteristics and color of layers 5 to 1.\nLayer 1\nLayer 2\nLayer 3\nLayer 4\nLayer 5\n4.\nHow would you interpret the climatic conditions at Uan Tuh, both in the cave and in the talus?\nConsider the physical features of the cave, the sedimentological characteristics and colors of layers 3\nto 1 and the conditions of the contained artifacts and faunal remains.\nCave\nTalus\nLayer 1\nLayer 1\nLayer 2\nLayer 2\nLayer 3\nLayer 3\n\n5.\nDetermine the relative temporal correlation of layers between Hassi Eni and Uan Tuh based on the\nfrequencies of decorative techniques on the pottery\nHassi Eni\nUan Tuh Cave\nUan Tuh talus\nLayer 1\n=\nLayer 2\n=\nLayer 3\n=\nLayer 4\n=\nLayer 5\n=\n6.\nWhat is the nature and significance of the final settlement with the dry stone wall at Hassi Eni?\n\n3.986 - Background information for the Adrar Abu problem\nSome things helpful to know, if you don't already.\nVocabulary and terms\ncarbuncles -\ngarnets or any of several other semiprecious red colored gem stones\ncairn - a heap of stone piled up as a memorial or as a landmark. Usually a low circular convex grading to conical mound\nof stones. [In the northern African context cairns are often built on top of burials and are more commonly\nassociated with pastoral peoples. They are seldom associated with either hunter/gatherers or agriculturalists.)\neolian - windblown (as in windblown sand)\nmassif - a principal mountain mass. A block of the earth's crust bounded by faults or flexures and displaced upward as a\nsingle unit.\nmidden - a refuse heap. In archaeology, usually a pile of food related debris, esp. bones, shells, and other organic\nfood refuse. May include discarded artifacts as well.\nwadi -\nFig. 7.1 - \"Dry wadi\" appears in the legend. \"wadi\" is the local term used in northern Africa to refer to an\narroyo, or steep sided riverbed found in arid desert areas. A \"dry\" wadi would be a dry riverbed or stream\nchannel. [We can probably safely presume that in the present time at some rare points during the year water\nmight flow down these channels following rains at higher elevations on the massif. In times past with\nwetter climates there may have been permanent flowing water or perhaps permanent standing ponds in these\nwadis.]\npubic symphysis - the pubic symphysis is in the front of the pelvic girdle where the two innominate bones join.\nterra sigillata - terra sigillata is a kind of pottery usually associated with Roman times and produced in the\nMediterranean area. It's definitely an '\"exotic\" at the Adrar Abu and either represents a trade item, or\nsomething that was brought to the region by folks from or in contact with the Mediterranean world.\nTroglodytes - a name given to people who live in caves.\nbored stones - these are usually donut shaped items. Large and small - Larger one (large donut sized) in the African\ncontext are sometimes digging stick weights. -\nSmaller ones (golf ball sized) might be net weights for\nfishing nets or loom weights for weaving.\nsterile -\nin an archaeological context 'sterile' means an absence of cultural material.\nhectare -\na metric system unit of measure of area = 10,000 sq. meters (100m x 100m). Equivalent to 2.47 acres in\nthe U.S. (English) system.\nAncient\nhistory\nRome defeated Carthage, absolutely and completely, in 146 BC rending Carthaginian influence in North African\ntotally nonexistent - Over the next two centuries Rome slowly developed control over the entire North\nAfrican coastal region.\n\nInterpreting the data presented in the problem\nIn Table 7.1 there are two carbon dates listed in the top right hand corner of the chart. The dates are 200 +/- 25 A.D.\nand 260 +/- 85 B.C. The correct reading of this chart should associate both dates with Layer 1 at Hassi Eni.\nThe earlier date is NOT to be associated with Layer 2.\nFaunal elements and their ecological requirements.\nsheep and goats - are not native to the African continent. - When present, they are obviously domesticates.\nbovines - members of the tribe Bovinae of the African Bovidae, including wild cattle, wild \"buffalo\" (Bubalus\nantiquus), and domestic cattle. [There is a very good possibility that some populations of African wild cattle\nin the eastern Saharan region were domesticated locally between 7-9,000 years ago.\nunidentified bovids - any member of the Bovidae, that is, cloven-hoofed herbivores- There are 10 \"tribes\" of bovids\nwhich includes all varieties of gazelles, antelopes, large and small, as well as sheep/goat and cattle too. It\ndoesn't include giraffids or camelids. [In this problem the \"unidentified bovids\" probably means the bones\nwere too fragmented to identify to specific taxa.]\nValue of animals as climatic indicators.\nIt is possible to distinguish 6 broad environmentally controlled classes of animals\naquatic - completely water dependent\nterrestrial water margin adapted\ngrassland - wet and dry\nbushland/woodland\nwoodland/forest\nsub desert and desert animals\nA number of herbivore species can be found in multiple environments and the carnivores can found across an even\nbroader range of these environments.\naquatic\nhippo, crocodile, catfish, Spinifex tepidus (small anchovy-sized fish), freshwater\nmussels (requires fresh moving water)\nwater margin adapted\nwaterbuck\ndry grassland, sub desert and desert\ngazelle, gerbil, ostrich\nelephant, rhino, giraffe - found in a wide range of bushland, woodland and grassland edge environments.\nbushland environments\nbushbuck\ngrassland\nwarthog\nbovines - (can be found in bushland as well)\nenvironmental requirements\n\nrock hyrax - the African equivalent to a guinea pig, its distribution is controlled by the presence of suitable rocky\noutcrops and available grass. They are grazers!\nbaboons - obligatory daily drinkers, never found too far from permanent water. bushland, grassland and even sub-\ndesert.\nsheep/goats - grazers and browsers - grassland and bushland environments, require water about every other day to\nremain in good condition.\nInterpreting\nsediments and soils as evidence of past climates.\nremember \"soils\" differ from sediments in being the result of weathering (biological and chemical alterations) at the\ntop of a land surface. - \"eolian\" means wind blown. Generally speaking the darker the sediment, the greater the\norganic component. These darker sediments and soils probably can be interpreted as being formed under wetter\nconditions. \"Loam\" is a type of soil.\nOther not so useful trivia\nBarchan - a type of sand dune\nErg - a region of sand dunes\nFouilleur - French for \"excavator\""
    },
    {
      "category": "Resource",
      "title": "domestication.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-986-the-human-past-introduction-to-archaeology-fall-2006/62a3dc36460d07484cee152bdfcbf5ac_domestication.pdf",
      "content": "3.986\nThe Human Past:\nIntroduction to Archaeology\nFall, 2006\nSome notes on domestication - the process\n) what is domestication?\ndevelopment of control of plant and animals by humans to the extent that it changes or alters their genetic make\nup, and in rare cases makes them unfit to survive without human aid or intervention - ex. maize (corn).\nThis is frequently done by\n1) planting crops in niches where they are not naturally adapted\n2) removing certain pressures of natural selection to allow more deviants from normal phenotypes to survive.\n3)\nselect for characters not beneficial under conditions of natural selection.\nFor animals frequently this is reflected in control of breeding of animals.\nselect for size, docility, or some other specific character, - color, hair covering, body type, etc.\n) How does one recognize it?\nRecognizing domestication archaeologically can be a significant problem. - for several reasons. -\nsoft\nparts, preservation, reflection of genetic changes being preserved in hard parts. Initial stages of domestication -\nwill have minimal impact on the morphology of the plant or animal.\nPlants\n1) seed or fruit size increases, flesh thickness increases, seed size of individual plants may become\nmore homogeneous.\n2) for grains - seed dispersal mechanisms may be altered\nselection for plants which do not drop seed readily. example: rachis - tough versus brittle\n3) geographic distribution may change\nfind plants in areas where the wild progenitors were not found\nAnimals\n1) size of animals changes\neither bigger or smaller depending on selection pressures\nex. dogs and cattle show initial size decease from wild progenitors, believed to be selection for\ndocility, (only later bred for large size.)\nhorses, size increase quite immediate as they are being selected for ability to carry loads.\n2) geographic distributions changes - found outside range of natural progenitors\n3) population characteristics of archaeological assemblages change in systematic ways.\nh and g accumulated assemblages tend to be variable - eclectic choice - age, sex, condition,\nmultiple taxa frequently associated\nsometimes mass herd hunting provides different profile - but regular patterns\n- but indiscriminate to age and/or sex\nherders - selectively cull\nchop males out - seasonal culling - often at start of dry or winter season to reduce feeding costs.\nfemales kept for breeding\nfrequently cull animals at young adulthood - to maximize weight gain and minimize feeding cost\n- or they cull aged animals with low fertility\n4) osteological changes\nbone densities - wild versus penned\nchanges in horn cores/ selective breeding\nsize - shape of jaws versus teeth\n\nFigure 8.5 The features affecting seed dispersal and spikelet implantation in wild and domesticated einkorn wheat.\nFrom Fagan, B. M. 1998. People of the Earth. 8th ed. Harpercollins. Fig. 8.5, p. 239.\nFigure removed due to copyright restrictions.\n\n3.986\nThe Human Past:\nIntroduction to Archaeology\nFall, 2006\nProbable 'hearths of domestication' of some common plants and animals\nNew World\nMesoamerica\nNorth America\nSouth America\nmaize\nturkey\namaranth\ncotton\nllama\ngourds\nMuscovy duck\nsunflower\npotato\nalpaca\nsquash\npeppers\nguinea pig\nbeans (many)\nmanioc\nchili peppers\nsquash\n(Capsicum)\nbeans\navocado\npineapple\ncacao\nsweet potato\ntomato\ncoca\nvanilla\npeanut ?\npapaya\nguavas\ntobacco\nOld World\nAfrica\nWestern Asia\nEastern Asia\nsorghum\ncat\nwheat\ndog\nmillets\ndog\nyams\ncattle\nbarley\ngoats\nrice\nchicken\nmillets\ndonkey\nrye\nsheep\nbananas\npigs\noil palm\noats\ncamel\ncoconut\ncattle\ngourds\ndates\npigs\napricot\ncoffee\nlentils\ncattle ?\nsoy bean\nrice (African)\nturnips\nsugar cane\nwatermelon\nonions\ncitrus\nteff\ngarlic\npeach\nleeks ?\nradish ?\nEurope\ncucumber\nyams\nlettuce\nbottle gourd\ncarrots\ncattle ?\nspinach\ncotton\nparsnips\nhorse\nfigs\nbeets\nreindeer\napple\nasparagus\ndog\npear\nhazel nut\npomegranates\nplums\nolives\nalmonds\npistachio nuts"
    },
    {
      "category": "Resource",
      "title": "humanness.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-986-the-human-past-introduction-to-archaeology-fall-2006/f54e99b88eda9a66e2589bff00ff8e08_humanness.pdf",
      "content": "3.986 - Introduction to Archaeology\nFall 2006\n\"Humanness\" - What are the features that make us \"human\"?\nHow do our nearest relatives the chimps compare?\nAre we qualitatively or quantitative different from other animals?\nIs there some minimum number of features required to define \"humanity\"?\nWhen do each of these features first appear in the course of human evolution?\nmodern humans (Homo sapiens)\nPhysical\nbipedal\nlarge cranial capacity, ca. 1325 cc\nvocal tract with large phonetic range\nsmall canines (both sexes)\nthick tooth enamel\nlong lumbar region (5 vertebrae)\nprecision and power grips - both good\nrelatively hairless\nloss of visible estrus signs\nmenopause in older females\nslow maturation\n46 chromosomes\nBehavioral\n\"abstract\" intelligence (symbolic thought)\ncomplex symbolic language\ntool use and tool making - very complex\n( fire, clothing, composite tools, etc.)\ndelayed food consumption - food sharing\nhome bases and central place foraging\ndivision of labor\nlong learning periods for offspring\ncomplex cultural behaviors\nmodern chimps (Pan troglodytes)\nPhysical\nquadrupedal\nsmall cranial capacity, ca. 425 cc\nvocal tract with limited phonetic range\ndimorphic canines - larger in males\nthin tooth enamel\nshort lumbar region (3 vertebrae)\nprecision (poorer), power grip (good)\nrelatively hairy\nestrus cycle pronounced\nno menopause in older females\nmore rapid maturation\n48 chromosomes\nBehavioral\nless \"abstract\" intelligence\nless complex communication system\nvery simple tool use and tool making\nno delayed consumption, minimal sharing\nlack home bases, central place foraging\nlacks division of labor\nshorter learning periods for offspring\nsimple cultural behaviors"
    },
    {
      "category": "Resource",
      "title": "ne_geography.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-986-the-human-past-introduction-to-archaeology-fall-2006/9a3fdc412da4ea896ff2738da6e9e92e_ne_geography.pdf",
      "content": "Courtesy of Rowman & LIttlefield Publishers, Inc. Used with permission."
    },
    {
      "category": "Resource",
      "title": "newworld_maps.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-986-the-human-past-introduction-to-archaeology-fall-2006/51f2836b6cebb734af7b79f9d200c156_newworld_maps.pdf",
      "content": "3.986 - Introduction to Archaeology\nM A P 1. 1 Mesoaincrica.\nMap removed due to copyright restrictions.\nfrom: Weaver, M.P. 1993. The Aztecs, Maya and the Predecessors. (3rd ed.), p.2\n\n3.986 - Introduction to Archaeology\nA wave model for rapid peopling of the New World\nM aps of North and So\nuth America,\nshowing\na \"wav\ne mode l\" o\nf\npeop\nle pr\nogres\nsing from n\north to south during the era from 11,500 to 10,500 y ears ago.\nFigure by MIT OCW."
    },
    {
      "category": "Resource",
      "title": "olmec.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-986-the-human-past-introduction-to-archaeology-fall-2006/35db54493a3d2081a747654dc55f9038_olmec.pdf",
      "content": "3.986 - Introduction to Archaeology\nFall 2006\nNotes on recently discovered Olmec Writing\nMartinez, M. del C. R., P.O Ceballos, M.D. Coe, R.A. Diehl, S.D. Houston, K.A. Taube, A.D. Calderon.\nOldest Writing in the New World. Science 313:1610-1614. (15 September 2006)\nAbstract: A block with a hitherto unknown system of writing has been found in the Olmec heartland of\nVeracruz, Mexico. Stylistic and other dating of the block places it in the early first millennium before the\ncommon era, the oldest writing in the New World, with features that firmly assign this pivotal development\nto the Olmec civilization of Mesoamerica.\nThe Cascajal block\nFigure removed due to copyright restrictions.\nFig. 4. Epigraphic drawing of block.\nalso see\nLawler, A.\nArchaeology: Claim of Oldest New World Writing Excites Archaeologists.\nScience 313:1551.\nP.T.O\n\nPohl, M.E.D., K.O. Pope, C. von Nagy\nOlmec Origins of Mesoamerican Writing. Science 298:1984-87.\nAbstract: A cylinder seal and carved greenstone plaque bearing glyphs dating to 650 B.C. have been\nuncovered near the Olmec center of La Venta in Tabasco, Mexico. These artifacts, which predate others\ncontaining writing, reveal that the key aspects of the Mesoamerican scripts were present in Olmec writing:\nthe combination of pictographic and glyphic elements to represent speech; the use of the sacred 260-day\ncalendar; and the connection between writing, the calendar, and kingship. They imply that Mesoamerican\nwriting originated in the La Venta polity.\nFigure removed due to copyright restrictions.\nFig. I. Map showing Mesoamerican archaeologicaL sites; early monuments with glyphs; and the\ngeographic distribution of the Isthmian, Mayan, and Oaxacan scripts.\n\nFigure removed due to copyright restrictions.\nFig. 2. Photograph (left) and rollout drawing (right) of the cylinder seal from San Andres, La Venta,\nTobasco, mexico. Scale bar in cm."
    },
    {
      "category": "Resource",
      "title": "pleistocene.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-986-the-human-past-introduction-to-archaeology-fall-2006/ed86aa75a35e910f95c5f0d0c468df97_pleistocene.pdf",
      "content": "3.986 - Introduction t o Archaeology\nSynoptic overview of Pleistocene prehistory in the Old World\nAsia &\nAfrica Hominid\nE~~~~~\nMajor sites\nTechnoloigcal and behavioral feats\n\"AGE\"\ntype\n\"AGE\"\nNEO-\nLITHIC\npottery\nAbu Hureyra\nm\nA\n$$\nMESO- I\nS! m\nLITHIC\nLascaux\n,\nground stone technology\n$73\n!\nbow and arrow Iexpansion into ~ e w\nworld I\nDolni Vestonice\nI\nmicrolith technology\na E\n?\nw A\nGrotte Chauvet\n8 2\nrock art\ng o\nVogelhard\n3 g\nV)\n3:\nArch sur Cure\n,, bone tool technology\na\na\npersonal ornamentation\n?\n.Y\n0-\ng\nblade technology\ns\nm\nI\n:3\nW\nC\n\ni\nPeche de I'Aze\nB\nIexpansion into ~ustralia]\nT\n0 0\n?\n8=\ns: 4\nShanidar\nintentional burial\na\nHaua Fteah\n.-c\nwhistle - ?flute ?\nK'asies River\n/\nli\nutilization of marine resources\nC\n/ ?\nCombe Grenal\n-.-\nprepared core stone technology\n.Y\nTerra Amata\nartificial shelters (huts)\nVI\ngJ 2\nV)\n?\nr\nSchoeningen\nwooden throwing spears\n$\nc\nChoukoutien\nP\n2'\ng\nsystematic hunting\nlsernia Olorgesailie\nx\nKilombe\n?\n.-\na\ncontrol of fire\ng z\nP).\"\nP\n3 -y\nbiface technology Ibig flakes\n$ 2 2 f!\nKarari\nChesowanja\n? possible control of fire ?\nP\n? ?\nKoobi Fora olduva, Dmanisi\nI horninids ceitainly out of ~frical\n$\nx\n\nShungura Frn.\nmeat eating - ? scavenging - hunting ?\nKada Gona\nearliest stone tools\nA. afarensis\nK. platyops\nA. anamensis\n.:"
    },
    {
      "category": "Resource",
      "title": "site_models.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-986-the-human-past-introduction-to-archaeology-fall-2006/229b726ec3f68db5294fcc401da0c90a_site_models.pdf",
      "content": "3.986 - Introduction to Archaeology - Hypothetical models for early archaeological site formation\n1 Hydraulic Jumble\n2 Common Amenity (e.g. Shade Tree)\nFour figures depicting site formation models.n\n3 Carnivore Accumulations used by Hominids\n4 Scavenging Opportunities\nWhere animals\nwere killed...\nor died\nFigures by MIT OCW.\n\n3.986 - Introduction to Archaeology - Hypothetical models for early archaeological site formation\n5 Central Place Foraging\n6 Stone-cache Model\n\"Home Base\" model\nStone prepositioned\nfor future use\n8 Opportunistic Use During Foraging\n7 \"Nesting/Nutting Areas\" - a la chimps\nRegular short visits to and reuse of\nsame locality over time\nFigures by MIT OCW.\n\n3.986 - Introduction to Archaeology - Hypothetical models for early archaeological site formation\nReferences:\nModels 1-5 after Isaac, G. 1983. Bones in contention: competing explanations for the juxtaposition\nof early Pleistocene artifacts and faunal remains. In Animals and Archeology: 1. Hunters and their\nprey (ed. J. Clutton-Brock and C. Grigson. BAR International Series 163. Pp. 1-19.\nModel 6: After Potts, R. Home bases and early hominids. American Scientist 72:338-347.\nModel 7: after Sept, J. 1992, Was there no place like home? Current Anthropology 33(2):187-207\nand also see Mercader, J. et al 2007, 4,300-Year-old chimpanzee sites. Proceeding of the National\nAcademy of Sciences 104-3043-3048."
    },
    {
      "category": "Resource",
      "title": "social_complex.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-986-the-human-past-introduction-to-archaeology-fall-2006/81560736daf45558809f0b649c762906_social_complex.pdf",
      "content": "3.986: Introduction to Archaeology\nFall, 2006\nThe path to social complexity -\nOld World / New World comparisons\nPrior to 13,000 years ago all humans lived in relatively mobile small scale societies\ncharacterized by egalitarian social structures. Their subsistence depended on \"gathering and\nhunting\" and reciprocity of exchange. The total human population at 13,000 years bp (before\npresent) has been estimated at about ten million. In the last 13,000 years the human population\nhas increased several hundred fold, and numerous diverse complex societies characterized by\nfood production, permanent settlements, hierarchically ranked social structures, and redistributive\neconomic systems developed in most parts of the Old and New Worlds. The attainment of this\ndegree of complexity is often referred to as achieving \"civilization\". The central theme of this\nclass is the study of the processes leading to the earliest appearance of such societies in the\nMiddle East/eastern Mediterranean region and Mesoamerica. We are interested in examining the\nsimilarity and difference in the trajectory of developments in these regions in order to better\nunderstand the processes involved with these changes.\nThe two major developments we will consider are:\n1)\nThe appearance and spread of food producing economies, based on agriculture and\npastoralism\n2)\nDevelopment of \"civilization\" - a stage of human cultural evolution involving a\n'polythetic' set of attributes - among which are usually cited.\nA) Primary\nsize and density of population - (usually in cities)\nfull time specialization of labor\nconcentration of surplus - social means for collection and management\nsystem for distribution and exchange of goods or labor\nclass structured society - privileged ruling class\nstate organization - political organization with king, based on residence rather\nthan kinship as primary organizational principle\nB) Secondary\nmonumental public works\nlong distance trade (a quantitative difference)\nstandardized monumental artwork\nwriting\narithmetic, geometry, astronomy - beginning of predictive science and engineering\nHistorically the study of the emergence of early civilizations (as well as the study of the\norigins of domestication and agriculture) has usually taken one of two approaches.\n1) Prime movers - There has been a tendency among researchers to look for single causes\n- \"prime movers\" to account for the development of civilizations in different areas. There\nare numerous difficulties with this view.\n2) Feedback systems - (interrelated factors) -\nIt may be more profitable to view the\nemergence of civilizations as the result of multiple factors that work in feedback systems.\nMoreover, the same prime movers (or principal factors) apparently may not have\noperated in all cases, but rather, different initial conditions in different geographic areas\ngave rise to generally similar consequences. Among the factors widely regarded as\ninfluential in determining the distinctive characters of early civilizations are:\n\nenvironment\nirrigation\nsubsistence economy\nwarfare\npopulation\npopulation growth\ntechnology\ntrade\nintegrative power of religion and art\nsocial circumscription\nsocial organization\ninformation flow\nWhether these factors are viewed as single prime movers or as interdependent factors in feedback\nsystems, some of the sources of data and issues to be considered are as follows.\n1)\nEnvironment - characteristics, features, resources and their role in these changes\n2)\nTechnological systems\ntool making - stone working, metallurgy, pottery\nfood procurement - food preparation, long term storage, hunting/gathering,\nagricultural, (irrigation) stock keeping\nbuilding technology\ninformation (writing)\n3)\nSubsistence (economics)\ndiet\navailability of resources - technology and environment factors - (storage, irrigation)\nscheduling of resource use\nreciprocity versus redistributive systems\ncraft - economic specialization - division of labor\naccess to resources - trade/exchange, land and property ownership, warfare\n4)\nSettlement patterns - demography - land use patterns\ndemography - population size, density, growth rates, health\ndegree of sedentary living\nsize of community - house types, sizes, density of dwellings\nspacing in and between communities - hierarchical structuring of settlements\n5)\nSocial/Political structure\nascribed and achieved statuses\ndegree of stratification of society - egalitarian, ranked, stratified, state\n[acephalous bands, tribes, chiefdoms and states (kings)]\nrole of kin structure or other corporate groups in governing\n6)\nReligion and Ideology - sources of data\nwriting\nmonuments\nartifacts\nburials"
    },
    {
      "category": "Resource",
      "title": "social_org.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-986-the-human-past-introduction-to-archaeology-fall-2006/c134a4a0333a278976db4e868f4f11c7_social_org.pdf",
      "content": "3.986 The Human Past: Introduction to Archaeology\nThe classification of social organization\nAnthropologists and archaeologists use several different, partially cross cutting, systems for\ndescribing levels of social organization in human societies. Fried's terminology focuses on power\nand authority relations between individuals and groups in society. Service's terminology focuses\non the overall level of \"political'' organization in groups. Redman's terminology is the most\narchaeologically focussed, emphasizing the material and economic correlates associated with\nsuccessively more complex levels of social organization.\nAlternative classifications of social organization\nM. Fried's terminology\nE. Service's terminology\nC. Redman's terminology\nState society\nState organization\nNational states\nStratified society\nCity -states\nTemple towns\nChiefdom organization\nAdvanced fanning villages\nRanked society\nSedentary village agriculture\nand mobile husbandry\nTribal organization\nSedentary and mobile intensive\nEgalitarian society\nhunters and gatherers\nBand organization\nMobile hunters and gatherers\nConcepts - nature of status of individuals\nachieved -\nstatus achieved by individual during lifetime by virtue of hislher actions\nascribed -\nstatus ascribed to an individual by virtue of birth\nrank -\nhereditary status - may be associated with privileges or obligations\nauthority -\nability to channel behaviors of others without use of threat or sanctions -\n\"expert\" -\nleadership\nbased on authority - \"charismatic\" leadership\npower -\nability to channel behavior through use of force or threat - removal of access to resources\nIn early civilizations - rank, authority and power all are combined in same folk in central leadership"
    },
    {
      "category": "Resource",
      "title": "socialcollapse.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-986-the-human-past-introduction-to-archaeology-fall-2006/c9e05f9891aeb7625fb13e17ddea81a1_socialcollapse.pdf",
      "content": "3.986 - Introduction to Archaeology\nSocietal Collapse - Additional Notes - Maya\nDecline of the Classic Maya\nBetween 700 - 900 AD many of the elite features disappear from the archaeological record - happens in different ways\nat slightly different times.\nno calendrical inscriptions (last known long count calendrical date - 909 AD)\nno stelae\nstop construction of monumental buildings\nstop production of polychrome pottery\nby 1000 AD all these activities had ceased in the southern lowlands.\nExamples:\nSeibal\nFirst site on southwestern periphery to display new intrusive pottery types. New physical types appear on\nstelae - at ca. 790 AD. Possibility of intrusion of other western lowland Mayan speakers - the Chontal.\nTikal\n730 - 830 AD - enormous increase in building - temples\n90% of the house mounds around the center were occupied during this period -\n50 to 80,000 population estimated\n830 - 900 AD - rapid contraction and population loss\nno monumental building activity\nlast long count monument at Tikal: 889 AD\n50-60% of the house mounds abandoned\nLamanai\nin coastal area of Belize, no disruptions of the population apparent, but classic Maya traits disappear ca.\n900 AD.\nIn some other places\nviolent destruction of monuments\nmass burials\nsome evidence of foreign intrusion - at other places not.\nPossible explanations for patterns\nenvironmental changes no doubt involved in complex ways\nover centralization of power and economy accompanied by environmental degradation - (a popular view)\nleading to\n1)\nreligious crisis\n2)\nforeign invasions - evident in southwest\n3)\npeasant revolt - internal revolt at Altun Ha?\n4)\nbreakdown of trade\n5)\nagricultural failure - over exploitation of environment, over population of region\n6)\npredisposition for collapse- cyclic nature of calendar - doomsday scenario -self-fulling prophecy\nSee:\nPuelston, D. 1976. An epistomological pathology and the collapse--or why the\nMaya kept the short count. In Maya Archaeology and Ethnohistory, (eds.) N. Hammond and\nG. Willey, Austin: University of Texas Press, pp. 187-215.\n7)\nregional environmental disasters\n\nPossible evidence\n1)\nsome evidence for \"over-population\" given \"slash and burn\" carrying capacities, as many as\n300 people per km2\n2)\nevidence for nutritional deprivation among commoners relative to elite\n3)\nincreasing evidence of warfare between centers\nmay be deliberate attempt to increase populations of individual centers to increase political\npower.\n4)\nregional droughts, see\nHaug, Gerald H. et al.\n2003. Climate and the Collapse of\nMaya\nCivilization.\nScience 299:1731-35\n(14 March 2003)\n\n-----------------------------------------------\n---------------------------------------------------------------\nSocietal Collapse\n-\nAdditional Notes\n-\nNear East\nDecline of ancient Sumer\nSee attached culture-historic and political history for a general overview\nLeading potential factors:\nanthropogenically induced environmental degradation\nGibson, M. 1974. Violation of fallow and engineered disaster in Mesopotamian civilization. In T.\nDowning and M. Gibson (eds.) Irrigation's Impact on Society. University of Arizona,\nAnthropological Papers no. 25: pp. 7-20.\nlong term climate change and environmental disasters\nJacobsen, T and R. McC. Adams 1958. Salt and silt in ancient Mesopotamian agriculture. Science\n128:1251-58.\nWeiss, H. and R. S. Bradley 2001. Archaeology: what drives societal collapse? Science 291, (5504)\npp. 609-610.\nWeiss, H. et al. 1993. The genesis and collapse of third millennium north Mesopotamian civilization.\nScience 261:995-1004.\nexternally and internally generated political destabilization\nSee attached culture-historic and political history\ntrade and economic destabilizaton\nsee Gibson, M. 1974 above\nPostgate, N. 1992. Early Mesopotamia: society and economy at the dawn of history. London:\nRoutledge. p.180-181.\nComments and Abstracts re: long term climate change and environmental disasters\nARCHAEOLOGY:\nSea-Floor Dust Shows Drought Felled Akkadian Empire\nRichard A. Kerr\nScience Volume 279, Number 5349, Issue of 16 January 1998, p. 325:\nSAN FRANCISCO--In 1993, a Yale archaeologist proposed that the Akkadian empire--which in 2300 B.C. was the first to subsume\nindependent societies into a single state, only to splinter a century later--was brought low by a wide-ranging, centuries-long drought\n(Science, 20 August 1993, p. 985). At the annual fall meeting last month of the American Geophysical Union here, new evidence for\nthis theory was presented from a sediment core retrieved from the bottom of the Gulf of Oman, 1800 kilometers from the heart of\nthe Akkadian empire, indicating that a 300-year-long dry spell began just as the Akkadians' northern stronghold of Tell Leilan was\nbeing abandoned. The new results illustrate that climate change is emerging as a new and powerful causal agent in the evolution of\ncivilization.\nThe genesis and collapse of third millennium north Mesopotamian civilization.\nWeiss, H., M.-A. Courty, W. Wetterstrom, F. Guichard, L. Senior, R. Meadow and A. Curnow.\nScience 261(5124):995-1004. (Aug.\n20,1993)\nAbstract:\nArchaeological and soil-stratigraphic data define the origin, growth, and collapse of Subir, the third millennium rain-fed\nagricultural civilization of northern Mesopotamia on the Habur Plains of Syria. At 2200 B.C., a marked increase in aridity and wind\ncirculation, subsequent to a volcanic eruption, induced a considerable degradation of land-use conditions. After four centuries of\nurban life, this abrupt climatic change evidently caused abandonment of Tell Leilan, regional desertion, and collapse of the Akkadian\nempire based in southern Mesopotamia. Synchronous collapse in adjacent regions suggests that the impact of the abrupt climatic\nchange was extensive.\n\n3.986:\nThe Human Past:\nIntroduction Archaeology\nSummary of the culture-historic and political history of lower Mesopotamia:\nSumer\n(read from bottom up)\nBabylonian kingdom\n+1,750 - 1,595 B.C.\nHammurabi reunites northern and southern Mesopotamia in the Babylonia empire\n(Old Babylonian)\n(Sumer ceases to be an independent political force and gradually becomes a\nbackwater)\nsmall kingdoms\n2,000 - 1,750 B.C.\nperiod of small kingdoms dominated by Larsa and Isin\npolitical consolidation destroyed by Elamite (Susa) invasions from east, and Amorite\npastoralist invasions from the western desert region.\n3rd Dynasty of Ur\n2,113 - 2,000 B.C.\npolitical consolidation of Sumer and northern Mesopotamia under Ur-nammu of Ur\npolitical instability\n2,200 - 2,113 B.C.\nperiod of anarchy in southern Mesopotamia. 21 kings in 91 years according to King\nlists.\nAkkadian empire destroyed by the Guti, a pastoral people from northern Zagros area\nSargonid Period\n2,371 - 2,200 B.C.\nSargon of Agade (2371-2316 B.C.) of northern Mesopotamia conquers northern and\nsouthern Mesopotamia to create the first regional empire, known as the Akkadian\nempire.\nIII\n2,600 - 2,371 B.C.\nregional consolidation under King of Umma, Luggal-zagge-si at end of period\nEarly Dynastic\nII\n2,750 - 2,600 B.C.\nElamite (Susa) - foreign domination for a short while at start of period\nI\n3,000 - 2,750 B.C.\nconstant struggle for supremacy among city-states during all three periods, with\nshifting alliances and periodic conflicts"
    },
    {
      "category": "Resource",
      "title": "unit1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-986-the-human-past-introduction-to-archaeology-fall-2006/5119d24a0493cbad01c3a896fa7d17c0_unit1.pdf",
      "content": "3.986\n-\nThe Human Past:\nIntroduction to Archaeology\nFall 2006\nRequired readings - Journal abstracts and synopses\nUnit 1 - Earlier Prehistory: a brief overview\nPlio-Pleistocene early hominids and early archaeological traces of stone technology\nDiet of\nAustralopithecus and\nParanthropus\n1.\nvan der Merwe, N.J., J. F. Thackeray, J. A. Lee-Thorp and J. Luyt\nThe carbon isotope ecology and diet of Australopithecus africanus at Sterkfontein,\nSouth Africa. Journal of Human Evolution 44 :581-597.\nAbstract: The stable carbon isotope ratio of fossil tooth enamel carbonate is determined by the\nphotosynthetic systems of plants at the base of the animal's foodweb. In subtropical Africa, grasses and many\nsedges have C4 photosynthesis and transmit their characteristically enriched 13C/12C ratios (more positive\n13C values) along the foodchain to consumers. We report here a carbon isotope study of ten specimens of\nAustralopithecus africanus from Member 4, Sterkfontein (ca. 2.5 to 2.0 Ma), compared with other fossil mammals\nfrom the same deposit. This is the most extensive isotopic study of an early hominin species that has been\nachieved so far. The results show that this hominin was intensively engaged with the savanna foodweb and\nthat the dietary variation between individuals was more pronounced than for any other early hominin or non\nhuman primate species on record. Suggestions that more than one species have been included in this taxon are\nnot supported by the isotopic evidence. We conclude that Australopithecus africanus was highly opportunistic\nand adaptable in its feeding habits.\n2. Lee-Thorp, Julia A., van der Merwe, N.J. and C.K. Brain\nDiet of Australopithecus robustus at Swartkrans from stable carbon isotopic\nanalysis.\nJournal of Human Evolution 27:361-372.\nAbstract:\nDietary adaptations of early hominids are generally understood to have played a crucial role in\nhominid evolution. The dietary habits of Australopithecus robustus are of special interest because the robust\nmasticatory apparatus and characteristic dental features point to a distinctive dietary niche. Suggestions have\nranged anywhere between carnivory and specialist herbivory, but current consensus has focused mainly on small\nhard items within the contest of a vegetarian diet, and more particularly, frugivory. Few studies have\nchallenged this perspective, although the results of a recent Sr/Ca study of A. robustus ar Swartkrans were\nfound to be inconsistent with herbivory. ----- Results for A. robustus, compared with other fauna from\nSwartkrans, show a mixed diet including both C3 and C4 foods. Since the C4 contribution must derive from\nconsumption of grass or grazing animals, the data do not support either a specialist frugivorous or\ngraminivorous niche for A. robustus, rather, they suggest a more generalized or omnivorous diet.\nEarly stone tools as a measure of cognitive and motor skills\n3. Roche, Helene., A. Delagnes, J-P. Brugal, C. Feibel, M. Kibunjia, V. Mourrek & P-J. Texier\nEarly hominid stone tool production and technical skill 2.34 Myr ago in West\nTurkana, Kenya.\nNature 399:57-60.\nAbstract: Well-documented Pliocene archaeological sites are exceptional. At present they are known only in\nEast Africa, in the Hadar and Shungura formations of Ethiopia and in the Nachukui formation of Kenya. Intensive\narcheological survey and a series of test excavations conducted in the Nachukui formation since 1987 have led\nto the discovery of more than 25 archaeological sites whose ages range from 2.34 to 0.7 million years before\npresent (Myr) and to the extensive excavation of two 2.34-Myr sites, Lokalalei 1 in 1991 and Lokalalei 2C in\n\n1997. Lokalalei 2C yielded nearly 3,000 archaeological finds from a context of such good preservation that it was\npossible to reconstitute more than 60 sets of complementary matching stone artefacts. These refits, predating\nthe Koobi Fora refits by 500Kyr, are the oldest ever studied. Here we describe a technological analysis of the\ncore reduction sequences, based on these refits, which allows unprecedented accuracy in the understanding of\nflake production processes. We can thus demonstrate greater cognitive capacity and motor skill than previously\nassumed for early hominids, and highlight the diversity of Pliocene technical behaviour.\nEarly bone tools and evidence of diet\n4. Backwell, Lucinda R. and F. d'Errico\nEvidence of termite foraging by Swartkrans early hominids.\nProc. Natl. Acad. Sci. USA 98(4):1358-1363.\n(February 13, 2001)\nAbstract: Previous studies have suggested that modified bones from the Lower Paleolithic sites of Swartkrans\nand Sterkfontein in South Africa represent the oldest known bone tools and that they were used by\nAustralopithecus robustus to dig up tubers. Macroscopic and microscopic analysis of the wear patterns on the\npurported bone tools, pseudo bone tools produced naturally by known taphonomic processes, and\nexperimentally used bone tools confirm the anthropic origin of the modifications. However, our analysis\nsuggests that these tools were used to dig into termite mounds, rather than to dig for tubers. This result\nindicates that early hominids from southern Africa maintained a behavioral pattern involving a bone tool\nmaterial culture that may have persisted for a long period and strongly supports the role of insectivory in the\nearly hominid diet.\nImportance of cooking in human biological and cultural evolution\n5.\nWrangham, R. and N.L. Conklin-Brittain\nCooking as a biological trait.\nComparative Biochemistry and Physiology Part A 136: 35-46.\nAbstract: No human foragers have been recorded as living without cooking, and people who choose a 'raw\nfoodist' life-style experience low energy and impaired reproductive function. This suggests that cooking may\nbe obligatory for humans. The possibility that cooking is obligatory is supported by calculations suggesting\nthat a diet of raw food could not supply sufficient calories for a normal hunter-gatherer lifestyle. In particular,\nmany plant foods are too fiber-rich when raw, while most raw meat appears too tough to allow easy chewing. If\ncooking is indeed obligatory for humans but not for other apes, this means that human biology must have\nadapted to the ingestion of cooked food (i.e. food that is tender and low in fiber) in ways that no longer allow\nefficient processing of raw foods. Cooking has been practiced for ample time to allow the evolution of such\nadaptations. Digestive adaptations have not been investigated in detail but may include small teeth, small hind\nguts, large small intestines, a fast gut passage rate, and possibly reduced ability to detoxify. The adoption of\ncooking can also be expected to have had far-reaching effects on such aspects of human biology as life-history,\nsocial behavior, and evolutionary psychology. Since dietary adaptations are central to understanding species\nevolution, cooking appears to have been a key feature of the environment of human evolutionary adaptedness.\nFurther investigation is therefore needed of the ways in which human digestive physiology is constrained by\nthe need for food of relatively high caloric density compared to other great apes.\nPlio-Pleistocene Overview\n-\noptional supplemental reading\nThe reading listed below provides an excellent overview of issues in Plio-Pleistocene hominid and\narchaeological research in Africa, from about 5 to 1.5 million years ago.\n6.\nToth, N. and K. Schick\nAfrican Origins. In The Human Past: world prehistory and the development\nof human societies, ed. C. Scarre. Thames and Hudson, pp. 55-83.\n\nMiddle Pleistocene and Upper Pleistocene evidence of diet and technology\n7. Goren-Inbar, Nama, G. Sharon., Y. Melamed, and M. Kislev\nNuts, nut cracking, and pitted stones at Gesher Benot Ya'aqov, Israel.\nProceedings of the National Academy of Sciences, USA 99(4):2455-2460.\nAbstract:\nThe Acheulian site of Gesher Benot Ya'aqov (Israel) has revealed a unique association of edible nuts\nwith pitted hammers and anvils. Located in the Dead Sea rift, on the boundary between the Arabian and African\nplates, the site dates to the Early-Middle Pleistocene, oxygen isotope stage 19. In a series of strata, seven\nspecies of nuts, most of which can be cracked open only by a hard hammer, were uncovered. Five of the species\nare extant terrestrial nuts, and two are aquatic nuts now extinct in the Levant. In addition, the site yielded an\nassemblage of pitted hammers and anvils similar in pit morphology to those used by chimpanzees and\ncontemporary hunter-gatherers. This is the first time, to our knowledge, that a site has offered both\npaleobotanical and lithic evidence of plant foods eaten by early hominins and technologies used for processing\nthese foods. The evidence also sheds light on the structure of the community: ethnographic analogies suggest\nthat mixed gender groups may have been active on the shores of paleo-Lake Hula.\n8. Goren-Inbar, Nama, N. Alperson, M E. Kislev, O. Simchoni, Y. Melamed, A. Ben-Nun and E.\nWerker\nEvidence of Hominin Control of Fire at Gesher Benot Ya'aqov, Israel.\nScience 304: 725-727.\nAbstract:\nThe presence of burned seeds, wood, and flint at the Acheulian site of Gesher Benot Ya'aqov in\nIsrael is suggestive of the control of fire by humans nearly 790,000 years ago. The distribution of the site's\nsmall burned flint fragments suggests that burning occurred in specific spots, possibly indicating hearth\nlocations. Wood of six taxa was burned at the site, at least three of which are edible-olive, wild barley, and wild\ngrape.\n\n9. Thieme, H.\nLower Palaeolithic hunting spears from Germany.\nNature 395:807-810.\nAbstract:\nLittle is known about the organic component of Lower and Middle Palaeolithic technologies,\nparticular with respect to wooden tools. Here I describe some wooden throwing spears about 400,000 years old\nthat were discovered in 1995 at the Pleistocene site of Schoningen, Germany. They are thought to be the\noldest complete hunting weapons so far discovered to have been used by humans. Found in association with\nstone tools and the butchered remains of more than ten horses, the spears strongly suggest that systematic\nhunting, involving foresight, planning and the use of appropriate technology, was part of the behavioural\nrepertoire of pre-modern hominids. The use of sophisticated spears as early as the Middle Pleistocene may\nmean that many current theories on early human behaviour and culture must be revised.\nFigure 5 from this paper (photo of wooden spear) removed due to copyright restrictions.\n\nANTHROPOLOGY\nNeandertals and early modern humans\nNeandertal diet\n??\n10. Richards, M.P., P.B. Pettitt, E. Trinkaus, F.H. Smith, M, Paunovic and I. Karavanic\nNeanderthal diet at Vindija and Neanderthal predation: The evidence from stable\nisotopes.\nProceedings of the National Academy of Sciences, USA\n97(13):7663-7666 (June 20, 2000)\nAbstract: Archeological analysis of faunal remains and of lithic and bone tools has suggested that hunting of\nmedium to large mammals was a major element of Neanderthal subsistence. Plant foods are almost invisible in\nthe archeological record, and it is impossible to estimate accurately their dietary importance. However, stable\nisotope (d13C and d15N) analysis of mammal bone collagen provides a direct measure of diet and has been\napplied to two Neanderthals and various faunal species from Vindija Cave, Croatia. The isotope evidence\noverwhelmingly points to the Neanderthals behaving as top-level carnivores, obtaining almost all of their\ndietary protein from animal sources. Earlier Neanderthals in France and Belgium have yielded similar results, and\na pattern of European Neanderthal adaptation as carnivores is emerging. These data reinforce current\ntaphonomic assessments of associated faunal elements and make it unlikely that the Neanderthals were\nacquiring animal protein principally through scavenging. Instead, these findings portray them as effective\npredators.\n11. Defleur, A., T. White, P. Valensi, L. Slimak, E. Cregut-Bonnoure\nNeanderthal Cannibalism at Moula-Guercy, Ardeche, France.\nScience 286:128-31.\n(1 October 1999)\nAbstract:\nThe cave site of Moula-Guercy, 80 meters above the modern Rhone River, was occupied by\nNeanderthals approximately 100,000 years ago. Excavations since 1991 have yielded rich paleontological,\npaleobotanical, and archaeological assemblages, including parts of six Neanderthals. The Neanderthals are\ncontemporary with stone tools and faunal remains in the same tightly controlled stratigraphic and spatial\ncontexts. The inference of Neanderthal cannibalism at Moula-Guercy is based on comparative analysis of hominid\nand ungulate bone spatial distributions, modifications by stone tools, and skeletal part representations.\nPatterns of land use and group mobility\n12. Lieberman, D. and Shea, J.J.\nBehavioral differences between archaic and modern humans in the Levantine\nMousterian.\nAmerican Anthropologist 96(2):300-332.\nAbstract: Early modern and archaic humans are associated with similar lithic industries in the Middle Paleolithic\nof the southern Levant, but new data suggest that they used the environment in different ways. Evidence\nfrom analyses of seasonally deposited increments of the teeth of the animals they hunted suggests that\nmodern humans primarily practiced a strategy of circulating seasonal mobility, while archaic humans in the same\nregion 30,000 years later were more residentially mobile. Analyses of their lithic hunting technology further\nsuggest that archaic humans hunted more frequently than did modern humans. We argue that this greater\nhunting intensity may have been a strategy for coping with the consequences of resource biodepletion\nresulting from long-term multiseasonal occupation of sites. These behavioral contrasts may be related to some\nof the morphological differences between early modern and archaic humans.\n13. d'Errico, F., C. Henshilwood, M. Vanhaeren and K. van Niekerk\nNassarius kraussianus shell beads from Blombos Cave: evidence for symbolic\nbehaviour in the Middle Stone Age.\nJournal of Human Evolution 48:3-24.\nAbstract:\nSince 1991, excavations at Blombos Cave have yielded a well-preserved sample of faunal and cultural\n\nmaterial in Middle Stone Age (MSA) levels. The uppermost MSA phase, M1, is dated to c. 75 ka by optically\nstimulated luminescence (OSL) and thermoluminescence, and the middle M2 phase to a provisional c. 78 ka.\nArtefacts unusual in a MSA context from these phases include bifacial points, bone tools, engraved ochre and\nengraved bone. In this paper, we describe forty-one marine tick shell beads recovered from these MSA phases\nand tick shell beads from Later Stone Age (LSA) levels at Blombos Cave and the Die Kelders site. Thirty-nine\nshell beads come from the upper M1 phase and two from M2. Morphometric, taphonomic and microscopic analysis\nof modern assemblages of living and dead tick shell demonstrate that the presence of perforated Nassarius\nkraussianus shells in the Blombos MSA levels cannot be due to natural processes or accidental transport by\nhumans. The types of perforation seen on the MSA shells are absent on modern accumulations of dead shells\nand not attributable to post-depositional damage. Their location, size, and microscopic features are similar to\nthose obtained experimentally by piercing the shell wall, through the aperture, with a sharp bone point. Use-\nwear, recorded on the perforation edge, the outer lip, and the parietal wall of the aperture indicates the shells\nhaving being strung and worn. MSA shell beads differ significantly in size, perforation type, wear pattern and\nshade compared to LSA beads and this eliminates the possibility of mixing across respective\nlevels.\nOn the rate of the emergence of modern cultural traits\nIn palaeoanthropology today there are two markedly opposing views about the timing and the\nnature of the first appearance of fully modern human behavior. By fully modern we often mean the\nappearance of the following features -\nblade technology, bone tools, increased geographic range,\nspecialized hunting, the use of aquatic resources, long distance trade, systematic processing and use of\npigment, and art and decoration. The proponents of these two opposing views are archaeologists Richard\nKlein on the one hand and Sally McBrearty and Alison Brooks on the other. An abstract and excerpts from\ntwo of their recent papers are presented below to give you a feeling for the nature of the controversy.\n14. Klein, Richard G.\nArcheology and the evolution of human behavior. Evolutionary Anthropology\n9(1):17-36.\n\"...it is surely reasonable to propose that the shift to a fully modern behavioral mode and the\ngeographic expansion of modern humans were also coproducts of a selectively advantageous\ngenetic mutation.\"( p. 17)\n\"In my view, however, we can say that fully modern behavior appeared only 50-40 ky ago. Prior to\nthat time, geographically far-flung populations progressively anticipated living people in their\nbehavior, but they remained uniformly nonmodern in many important, detectable respects,\nincluding their relatively unstandardized (informal) artifacts, the remarkable uniformity of their\nartifact assemblages through time and space, their failure to produce unequivocal art or\nornaments, the simplicity of their burials, their failure to build structures that retain archeological\nvisibility, and their relatively limited ability to hunt and gather. All people before 11 ky ago lived\nprimarily by hunting and gathering, but only archeological residues postdating 40 ky ago routinely\nimply the technological ingenuity, social formations, and ideological complexity of historic hunter-\ngatherers. Limited evidence suggests that fully modern behavior appeared first in Africa roughly\n50 ky ago.\"( p.17)\n\"...credible claims for art or other modern human behavioral markers before 50 ky ago must involve\nrelatively large numbers of highly patterned objects from deeply stratified, sealed contexts.\" (p.\n28)\n15. McBrearty, Sally and Alison S. Brooks\nThe revolution that wasn't: a new interpretation of the origin of modern human\nbehavior.\nJournal of Human Evolution 39, 453-563.\nAbstract:\nProponents of the model known as the ''human revolution'' claim that modern human\nbehaviors arose suddenly, and nearly simultaneously, throughout the Old World ca. 40-50 ka. This\n\nPERSP\nANTHROPOLOGY\nfundamental behavioral shift is purported to signal a cognitive advance, a possible reorganization\nof the brain, and the origin of language. Because the earliest modern human fossils, Homo sapiens\nsensu stricto, are found in Africa and the adjacent region of the Levant at >100 ka, the ''human\nrevolution'' model creates a time lag between the appearance of anatomical modernity and\nperceived behavioral modernity, and creates the impression that the earliest modern Africans\nwere behaviorally primitive. This view of events stems from a profound Eurocentric bias and a\nfailure to appreciate the depth and breadth of the African archaeological record. In fact, many of\nthe components of the ''human revolution'' claimed to appear at 40-50 ka are found in the African\nMiddle Stone Age tens of thousands of years earlier. These features include blade and microlithic\ntechnology, bone tools, increased geographic range, specialized hunting, the use of aquatic\nresources, long distance trade, systematic processing and use of pigment, and art and decoration.\nThese items do not occur suddenly together as predicted by the ''human revolution'' model, but\nat sites that are widely separated in space and time. This suggests a gradual assembling of the\npackage of modern human behaviors in Africa, and its later export to other regions of the Old\nWorld. The African Middle and early Late Pleistocene hominid fossil record is fairly continuous and\nin it can be recognized a number of probably distinct species that provide plausible ancestors for\nH. sapiens. The appearance of Middle Stone Age technology and the first signs of modern\nbehavior coincide with the appearance of fossils that have been attributed to H. helmei,\nsuggesting the behavior of H. helmei is distinct from that of earlier hominid species and quite\nsimilar to that of modern people. If on anatomical and behavioral grounds H. helmei is sunk into H.\nsapiens, the origin of our species is linked with the appearance of Middle Stone Age technology at\n250-300 ka.\nModern humans and the advent of modern behaviors\nOn the \"Broad Spectrum Revolution\"\n16. Stiner, Mary C.\nThirty years on the \"Broad Spectrum Revolution\" and paleolithic demography\nProceedings of the National Academy of Sciences, USA 98(13):6993-6996.\n(June 19, 2001)\n(comment)\nThis paper surveys the evidence for the \"broad spectrum revolution\" during the later part of the\nPalaeolithic in the Mediterranean basin, based on faunal remains from numerous archaeological sites. It considers\nthe evidence for the increasing use of small mammals, birds and reptiles as food sources near the end of the\nPleistocene. It concludes that there is substantial evidence supporting an increase in dietary breadth during\nthis time.\n17. Weiss, E., W. Wetterstrom, D. Nadel and O. Bar-Yosef\nThe broad spectrum revisited: evidence from plant remains.\nProceedings of the National Academy of Sciences, USA 101(26):9551-9555.\n(June 29, 2004)\nAbstract: The beginning of agriculture is one of the most important developments in human history, with\nenormous consequences that paved the way for settled life and complex society. Much of the research on the\norigins of agriculture over the last 40 years has been guided by Flannery's [Flannery, K. V. (1969) in The\nDomestication and Exploitation of Plants and Animals, eds. Ucko, P. J. & Dimbleby, G. W. (Duckworth, London),\npp. 73-100] ''broad spectrum revolution'' (BSR) hypothesis, which posits that the transition to farming in\nsouthwest Asia entailed a period during which foragers broadened their resource base to encompass a wide\narray of foods that were previously ignored in an attempt to overcome food shortages. Although these\nresources undoubtedly included plants, nearly all BSR hypothesis-inspired research has focused on animals\nbecause of a dearth of Upper Paleolithic archaeobotanical assemblages. Now, however, a collection of >90,000\nplant remains, recently recovered from the Stone Age site Ohalo II (23,000 B.P.), Israel, offers insights into the\n\nplant foods of the late Upper Paleolithic. The staple foods of this assemblage were wild grasses, pushing back\nthe dietary shift to grains some 10,000 years earlier than previously recognized. Besides the cereals (wild\nwheat and barley), small-grained grasses made up a large component of the assemblage, indicating that the BSR\nin the Levant was even broader than originally conceived, encompassing what would have been low-ranked\nplant foods. Over the next 15,000 years small-grained grasses were gradually replaced by the cereals and\nultimately disappeared from the Levantine diet."
    },
    {
      "category": "Resource",
      "title": "unit2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-986-the-human-past-introduction-to-archaeology-fall-2006/f0a4fcad7a141c08256458abbbbfa07d_unit2.pdf",
      "content": "3.986\n-\nThe Human Past:\nIntroduction to Archaeology\nFall 2006\nRequired readings - Journal abstracts and synopses\nUnit 2 - The Near East Case Study\nEarly plant domestication and domesticates\n1.\nKislev, M. E. E. Weiss and A. Hartmann\nImpetus for sowing and the beginning of agriculture: Ground collecting of\nwild cereals.\nProceedings of the National Academy of Sciences USA 101(9):2692-2695.\n(March 2, 2004)\nAbstract: The Agricultural Revolution in Western Asia, which took place some 11,000 years ago, was a turning\npoint in human history [Childe, V. G. (1952) New Light on the Most Ancient East (Routledge & Kegan Paul,\nLondon)]. In investigating the cultural processes that could have led from gathering to intentional cultivation,\nvarious authors have discussed and tested wild cereal harvesting techniques. Some argue that Near Eastern\nforagers gathered grains by means of sickle harvesting, uprooting, plucking (hand stripping), or beating into\nbaskets [Hillman, G. C. & Davies, M. S. (1999) in Prehistory of Agriculture: New Experimental and Ethnographic\nApproaches, ed. Anderson, P. (The Institute of Archaeology, University of California, Los Angeles), pp. 70-102].\nDuring systematic experiments, we found that archaeobotanical data from regional Neolithic sites support\nground collection of grains by early hunter-gatherers. Ground collecting suits the natural shattering of wild\nspecies that ripen and drop grains at the beginning of summer. We show that continual collection off the\nground from May to October would have provided surplus grains for deliberate sowing in more desirable fields,\nand facilitate the transition to intentional cultivation. Because ground gathering enabled collectors to observe\nthat fallen seeds are responsible for the growth of new plants in late fall, they became aware of the profitability\nof sowing their surplus seeds for next year's food. Ground collecting of wild barley and wild wheat may comprise\nthe missing link between seed collecting by hunter-gatherers and cereal harvesting by early farmers.\n2.\nKislev, M.E., A. Hartmann and O. Bar-Yosef\nEarly Domesticated Fig in the Jordan Valley\nScience 312:1372-1374 .\n(2 JUNE 2006)\nAbstract: It is generally accepted that the fig tree was domesticated in the Near East some 6500 years ago.\nHere we report the discovery of nine carbonized fig fruits and hundreds of drupelets stored in Gilgal I, an early\nNeolithic village, located in the Lower Jordan Valley, which dates to 11,400 to 11,200 years ago. We suggest\nthat these edible fruits were gathered from parthenocarpic trees grown from intentionally planted branches.\nHence, fig trees could have been the first domesticated plant of the Neolithic Revolution, which preceded\ncereal domestication by about a thousand years.\nGenetic evidence for plant domestication\n3.\nBadr, A., K. Muller, R. Schafer-Pregl, H. El Rabey, S. Effgen, H. H. Ibrahim, C. Pozzi, W. Rohde\nand F. Salamini\nOn the Origin and Domestication History of Barley (Hordeum vulgare)\nMolecular Biology and Evolution 17(4):499-510. 2000\nAbstract: Remains of barley (Hordeum vulgare) grains found at archaeological sites in the Fertile Crescent\nindicate that about 10,000 years ago the crop was domesticated there from its wild relative Hordeum\nspontaneum. The domestication history of barley is revisited based on the assumptions that DNA markers\n\neffectively measure genetic distances and that wild populations are genetically different and they have not\nundergone significant change since domestication. The monophyletic nature of barley domestication is\ndemonstrated based on allelic frequencies at 400 AFLP polymorphic loci studied in 317 wild and 57 cultivated\nlines. The wild populations from Israel-Jordan are molecularly more similar than are any others to the cultivated\ngene pool. The results provided support for the hypothesis that the Israel-Jordan area is the region in which\nbarley was brought into culture. Moreover, the diagnostic allele I of the homeobox gene BKn-3, rarely but\nalmost exclusively found in Israel H. spontaneum, is pervasive in western landraces and modern cultivated\nvarieties. In landraces from the Himalayas and India, the BKn-3 allele IIIa prevails, indicating that an allelic\nsubstitution has taken place during the migration of barley from the Near East to South Asia. Thus, the\nHimalayas can be considered a region of domesticated barley diversification.\n4.\nHeun, M., R. Schafer-Pregl, D. Klawan, R. Castagna, M. Accerbi, B. Borghi and F. Salamini\nSite of Einkorn Wheat Domestication Identified by DNA Fingerprinting\nScience 278:1312-14 . (14 November 1997)\nAbstract: The emergence of agriculture in the Near East also involved the domestication of einkorn wheat.\nPhylogenetic analysis that was based on the allelic frequency at 288 amplified fragment length polymorphism\nmolecular marker loci indicates that a wild group of Triticum monococcum boeoticum lines from the Karacadag\nmountains (southeast Turkey) is the likely progenitor of cultivated einkorn varieties. Evidence from\narcheological excavations of early agricultural settlements nearby supports the conclusion that domestication of\neinkorn wheat began near the Karacadag mountains.\nEarly animal domestication and domesticates\n5.\nBar-Oz, G., T. Dayan, D. Kaufman and M. Weinstein-Evron\nThe Natufian economy at el-Wad Terrace with special reference to gazelle\nexploitation patterns\nJournal of Archaeological Science 31:217-231.\nAbstract: We carried out a detailed taphonomic and zooarchaeological analysis of the faunal remains from the\nnew excavation of the Late Natufian layers of el-Wad Terrace. We focused on gazelle exploitation patterns and\nexamined them within the context of the established Epipalaeolithic sequence from the coastal plain of Israel.\nMountain gazelle (Gazella gazella) is the most heavily exploited species. The taphonomic history of the\nassemblage suggests minor loss of bones caused by post-depositional processes and indicates that bone\ndestruction occurred during occupation. Cut marks from all stages of activities, absence of selective transport,\nand body part representation suggest that gazelle were butchered at the site. Analysis of gazelle sex\ncomposition shows male overrepresentation during the Natufian. Size trends show an increase of gazelle body-\nsize during the Natufian in comparison to previous periods. The patterns of body-size increase show the same\ntendency in proximal and distal limb-bones. The trends in gazelle body-size from the Epipalaeolithic of the\ncoastal plain do not demonstrate any sign of morphological dwarfism, increased variation, or allometric changes in\nthe morphology of Natufian gazelles and thus do not support the previously suggested hypothesis of \"proto\ndomestication\".\n6.\nZeder, Melinda A. and B. Hesse\nThe Initial Domestication of Goats (Capra hircus) in the Zagros Mountains\n10,000 Years Ago.\nScience 287:2254-57\n(24 March 2000)\nAbstract: Initial goat domestication is documented in the highlands of western Iran at 10,000 calibrated\ncalendar years ago. Metrical analyses of patterns of sexual dimorphism in modern wild goat skeletons (Capra\nhircus aegagrus) allow sex specific age curves to be computed for archaeofaunal assemblages. A distinct shift to\nselective harvesting of subadult males marks initial human management and the transition from hunting to\nherding of the species. Direct accelerator mass spectrometry radiocarbon dates on skeletal elements provide a\ntight temporal context for the transition.\n\nLOGY\nGenetic evidence for the origins of goats\nLuikart, G., L. Gielly, L. Excoffier, J-D. Vigne, J. Bouvet and P. Taberlet\nMultiple maternal origins and weak phylogeographic structure in domestic goats\nProceedings of the National Academy of Sciences USA 98(10): 5927-5932\n(May 8, 2001)\nAbstract: Domestic animals have played a key role in human history. Despite their importance, however, the\norigins of most domestic species remain poorly understood. We assessed the phylogenetic history and\npopulation structure of domestic goats by sequencing a hypervariable segment (481 bp) of the mtDNA control\nregion from 406 goats representing 88 breeds distributed across the Old World. Phylogeographic analysis\nrevealed three highly divergent goat lineages (estimated divergence >200,000 years ago), with one lineage\noccurring only in eastern and southern Asia. A remarkably similar pattern exists in cattle, sheep, and pigs. These\nresults, combined with recent archaeological findings, suggest that goats and other farm animals have multiple\nmaternal origins with a possible center of origin in Asia, as well as in the Fertile Crescent. The pattern of goat\nmtDNA diversity suggests that all three lineages have undergone population expansions, but that the\nexpansion was relatively recent for two of the lineages (including the Asian lineage). Goat populations are\nsurprisingly less genetically structured than cattle populations. In goats only '10% of the mtDNA variation is\npartitioned among continents. In cattle the amount is >50%. This weak structuring suggests extensive\nintercontinental transportation of goats and has intriguing implications about the importance of goats in\nhistorical human migrations and commerce."
    },
    {
      "category": "Resource",
      "title": "unit3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-986-the-human-past-introduction-to-archaeology-fall-2006/2294db22b494a5d7a15661a7195d1fc7_unit3.pdf",
      "content": "3.986\n-\nThe Human Past:\nIntroduction to Archaeology\nFall 2006\nRequired readings - Journal abstracts and synopses\nUnit 3 - The Mesoamerican Case Study\nPeopling of the Americas\n1. Martin, P.S.\nThe Discovery of America. Science 179:969-74.\nThe first Americans may have swept the Western Hemisphere and decimated its fauna\nwithin 1000 years.\n2.\nMandryk, C.A.S., H. Josenhans, D.W. Fedje, R.W. Mathewes\nLate Quaternary paleoenvironments of Northwestern North America: implications\nfor inland versus coastal migration routes.\nQuaternary Science Reviews 20:301-314\nAbstract: Although the long held normative view of New World colonization relies on entrance through an\ninterior ice-free corridor by terrestrially adapted big-game hunters, a recently demonstrated human presence in\nsouthern Chile dating prior to the existence of the corridor route implies different colonization scenarios which\nmust be seriously considered. A renewed focus of archaeological and paleoecological research on early post\nglacial landscapes in Northwestern North America has revitalized the \"ice-free\" vs. coastal corridor controversy.\nGeological findings from glacial geology and paleo-sea levels support the possibility of coastal migration from\nBeringia to the Pacific Northwest between about 14,000 and 10,000 BP, and preliminary paleoecological data\nsuggest that the coastal landscape was in part vegetated and probably able to support a terrestrial fauna,\nincluding humans. The same cannot be said about the \"ice-free corridor\".\n3. Dixon, E.J.\nHuman colonization of the Americas: timing, technology and process.\nQuaternary Science Reviews 20:277-299.\nAbstract: Geological and archeological research indicates that humans first colonized the Americas with the use\nof watercraft along the southern coast of the Bering Land Bridge and the western coast of the Americas. Early\ndates from a number of archeological sites in the Americas indicate human colonization of the Americas began\nprior to ca. 13,000 BP. A review of archeological sites in eastern Beringia identifies several distinctive cultural\ntraditions which had developed by 11,000-10,000 BP. Geological, biological, linguistic evidence, and dated human\nskeletal remains all suggest human occupation of the Americas prior to ca. 11,500 BP. Glacial geology indicates\ncolonization could have begun ca. 14,000-13,000 BP along the western coasts of the Americas and ended about\n5000 BP with deglaciation of the Canadian eastern Arctic and coastal Greenland. The use of watercraft and\ncoastal navigation prior to 11,000 BP are inferentially demonstrated. A model for early coastal and subsequent\ninland colonization of the Americas along large ecological zones best fits current geologic and archeological data.\n4.\nNeves, W.A. and M. Hubbe\nCranial morphology of early Americans from Lagoa Santa, Brazil: Implications for\nthe settlement of the New World.\nProceedings of the National Academy of Sciences USA 102(51):18309-18314.\n(December 20, 2005)\nAbstract: Comparative morphological studies of the earliest human skeletons of the New World have shown\nthat, whereas late prehistoric, recent, and present Native Americans tend to exhibit a cranial morphology similar\n\nto late and modern Northern Asians (short and wide neurocrania; high, orthognatic and broad faces; and\nrelatively high and narrow orbits and noses), the earliest South Americans tend to be more similar to present\nAustralians, Melanesians, and Sub-Saharan Africans (narrow and long neurocrania; prognatic, low faces; and\nrelatively low and broad orbits and noses). However, most of the previous studies of early American human\nremains were based on small cranial samples. Herein we compare the largest sample of early American skulls ever\nstudied (81 skulls of the Lagoa Santa region) with worldwide data sets representing global morphological\nvariation in humans, through three different multivariate analyses. The results obtained from all multivariate\nanalyses confirm a close morphological affinity between South-American Paleoindians and extant Australo-\nMelanesians groups, supporting the hypothesis that two distinct biological populations could have colonized the\nNew World in the Pleistocene Holocene transition.\nEarly plant domestication and domesticates\n5. Benz, B.F.\nArchaeological evidence of teosinte domestication from Guila Naquitz, Oaxaca.\nProceedings of the National Academy of Sciences USA 98(4):2104-2106.\n(February 13, 2001)\nAbstract:\nAnalysis of the three most ancient Zea mays inflorescence fragments from Guila Naquitz, Oaxaca,\nMexico shows they did not disarticulate naturally, indicating that agricultural selection of domesticated teosinte\nwas underway by 5,400 14C years before the present (about 4,200 dendrocalibrated years B.C.). The co\noccurrence of two-ranked specimens with two rows and four rows of grain and numerous additional\nmorphological characteristics of these specimens support hypotheses based on molecular and quantitative\ngenetic analyses that maize evolved from teosinte. Domestication of the wild ancestor of maize occurred\nbefore the end of the 5th millennium B.C.\n\n6.\nMatsuoka, Y., Y. Vigouroux, M.M. Goodman, J. Sanchez G., E. Buckler and J. Doebley\nA single domestication for maize shown by multilocus microsatellite genotyping.\nProceedings of the National Academy of Sciences USA 99(9):6080-84.\nAbstract: There exists extraordinary morphological and genetic diversity among the maize landraces that have\nbeen developed by pre- Columbian cultivators. To explain this high level of diversity in maize, several authors\nhave proposed that maize landraces were the products of multiple independent domestications from their wild\nrelative (teosinte). We present phylogenetic analyses based on 264 individual plants, each genotyped at 99\nmicrosatellites, that challenge the multiple-origins hypothesis. Instead, our results indicate that all maize arose\nfrom a single domestication in southern Mexico about 9,000 years ago. Our analyses also indicate that the\noldest surviving maize types are those of the Mexican highlands with maize spreading from this region over the\nAmericas along two major paths. Our phylogenetic work is consistent with a model based on the archaeological\nrecord suggesting that maize diversified in the highlands of Mexico before spreading to the lowlands. We also\nfound only modest evidence for postdomestication gene flow from teosinte into maize.\nCourtesy of National Academy of Sciences, U.S.A.\nUsed with permission. (c) National Academy of Sciences, U.S.A.\n\n7. Smith, B.D.\nThe Initial Domestication of Cucurbita pepo in the Americas 10,000 Years Ago.\nScience 276: 932-34.\n(9 May 1997)\nAbstract:\nSquash seeds, peduncles, and fruit rind fragments from Archaic period stratigraphic zones of Guila\nNaquitz cave in Oaxaca, Mexico, are assigned to Cucurbita pepo on the basis of diagnostic morphological\ncharacters and identified as representing a domesticated plant on the basis of increased seed length and\npeduncle diameter, as well as changes in fruit shape and color, in comparison to wild Cucurbita gourds. Nine\naccelerator mass spectrometer radiocarbon dates on these specimens document the cultivation of C. pepo by\nthe inhabitants of Guila Naquitz cave between 10,000 to 8000 calendar years ago (9000 to 7000 carbon-14\nyears before the present), which predates maize, beans, and other directly dated domesticates in the Americas\nby more than 4000 years.\n\"Figure 2\" from this paper removed due to copyright restrictions.\n8. Sanjur, O.I. D.R. Piperno, T.C. Andres and Linda Wessel-Beaver.\nPhylogenetic relationships among domesticated and wild species of Cucurbita\n(Cucurbitaceae) inferred from a mitochondrial gene: Implications for crop plant\nevolution and areas of origin. Proceedings of the National Academy of Sciences\nUSA 99(1) :535-540. (January 8, 2002)\nAbstract: We have investigated the phylogenetic relationships among six wild and six domesticated taxa of\nCucurbita using as a marker an intron region from the mitochondrial nad1 gene. Our study represents one of\nthe first successful uses of a mtDNA gene in resolving inter- and intraspecific taxonomic relationships in\nAngiosperms and yields several important insights into the origins of domesticated Cucurbita. First, our data\nsuggest at least six independent domestication events from distinct wild ancestors. Second, Cucurbita\nargyrosperma likely was domesticated from a wild Mexican gourd, Cucurbita sororia, probably in the same region\nof southwest Mexico that gave rise to maize. Third, the wild ancestor of Cucurbita moschata is still unknown,\nbut mtDNA data combined with other sources of information suggest that it will probably be found in lowland\nnorthern South America. Fourth, Cucurbita andreana is supported as the wild progenitor of Cucurbita maxima,\nbut humid lowland regions of Bolivia in addition to warmer temperate zones in South America from where C.\nandreana was originally described should possibly be considered as an area of origin for C. maxima. Fifth, our data\nsupport other molecular results that indicate two separate domestications in the Cucurbita pepo complex. The\npotential zone of domestication for one of the domesticated subspecies, C. pepo subsp. ovifera, includes\neastern North America and should be extended to northeastern Mexico. The wild ancestor of the other\ndomesticated subspecies, C. pepo subsp. pepo, is undiscovered but is closely related to C. pepo subsp. fraterna\nand possibly will be found in southern Mexico.\n\n9. Erickson, D.L., B.D. Smith, A.C. Clarke, D.H. Sandweiss and N. Tuross\nAn Asian origin for a 10,000-year-old domesticated plant in the Americas.\nProceedings of the National Academy of Sciences USA 102(51):18315-18320.\n(December 20, 2005)\nAbstract: New genetic and archaeological approaches have substantially improved our understanding of the\ntransition to agriculture, a major turning point in human history that began 10,000-5,000 years ago with the\nindependent domestication of plants and animals in eight world regions. In the Americas, however,\nunderstanding the initial domestication of New World species has long been complicated by the early presence\nof an African enigma, the bottle gourd (Lagenaria siceraria). Indigenous to Africa, it reached East Asia by\n9,000-8,000 before present (B.P.) and had a broad New World distribution by 8,000 B.P. Here we integrate\ngenetic and archaeological approaches to address a set of long-standing core questions regarding the\nintroduction of the bottle gourd into the Americas. Did it reach the New World directly from Africa or through\nAsia? Was it transported by humans or ocean currents? Was it wild or domesticated upon arrival? Fruit rind\nthickness values and accelerator mass spectrometer radiocarbon dating of archaeological specimens indicate that\nthe bottle gourd was present in the Americas as a domesticated plant by 10,000 B.P., placing it among the\nearliest domesticates in the New World. Ancient DNA sequence analysis of archaeological bottle gourd\nspecimens and comparison with modern Asian and African landraces identify Asia as the source of its\nintroduction. We suggest that the bottle gourd and the dog, two ''utility'' species, were domesticated long\nbefore any food crops or livestock species, and that both were brought to the Americas by Paleoindian\npopulations as they colonized the New World.\n10. Pope, K., M.E.D. Pohl, J.G. Jones, D.L. Lentz, C. von Nagy, F.J. Vega and I.R. Quitmyer\nOrigin and Environmental Setting of Ancient Agriculture in the Lowlands of\nMesoamerica.\nScience 292:1370-73.\nAbstract: Archaeological research in the Gulf Coast of Tabasco reveals the earliest record of maize cultivation in\nMexico. The first farmers settled along beach ridges and lagoons of the Grijalva River delta. Pollen from\ncultivated Zea appears with evidence of forest clearing about 5100 calendar years B.C. (yr B.C.) [6200 14C years\nbefore the present (yr B.P.)]. Large Zea sp. pollen, typical of domesticated maize (Zea mays), appears about\n5000 calendar yr B.C. (6000 yr B.P.). A Manihot sp. pollen grain dated to 4600 calendar yr B.C. (5800 yr B.P.)\nmay be from domesticated manioc. About 2500 calendar yr B.C. (4000 yr B.P.), domesticated sunflower seeds\nand cotton pollen appear as farming expanded.\n11. Bricker, H.M., A. F. Aveni and V.R. Bricker\nAncient Maya documents concerning the movements of Mars.\nProceedings of the National Academy of Sciences USA 98(4):2107-2110.\nAbstract: A large part of the pre-Columbian Maya book known as the Dresden Codex is concerned with an\nexploration of commensurate relationships among celestial cycles and their relationship to other,\nnonastronomical cycles of cultural interest. As has long been known, pages 43b-45b of the Codex are concerned\nwith the synodic cycle of Mars. New work reported here with another part of the Codex, a complex table on\npages 69-74, reveals a concern on the part of the ancient Maya astronomers with the sidereal motion of Mars as\nwell as with its synodic cycle. Two kinds of empiric sidereal intervals of Mars were used, a long one (702 days)\nthat included a retrograde loop and a short one that did not. The use of these intervals, which is indicated by\nthe documents in the Dresden Codex, permitted the tracking of Mars across the zodiac and the relating of its\nmovements to the terrestrial seasons and to the 260-day sacred calendar. While Kepler solved the sidereal\nproblem of Mars by proposing an elliptical heliocentric orbit, anonymous but equally ingenious Maya astronomers\ndiscovered a pair of time cycles that not only accurately described the planet's motion, but also related it to\nother cosmic and terrestrial concerns.\n12.\nHosler, D.\nAncient West Mexican Metallurgy: South and Central American Origins and West\nMexican Transformations.\nAmerican Anthropologist, 90(4):832-855.\n\nAbstract: Metallurgy first appeared in Mesoamerica at about A.D. 800, introduced via a maritime route from\nCentral and South America into West Mexico. During the initial period of the establishment of the technology\n(approximately A.D. 800 to between A.D. 1200 and 1300) technical links were closest with the metallurgies of\nEcuador, Colombia, and lower Central America. During the second period of West Mexican metallurgy (A.D.\n1200-1300 to the Spanish invasion) new elements from these same regional metallurgies were introduced, in\naddition to technical components from the metallurgy of southern Peru. Although the roots of West Mexican\nmetallurgy lay in the metallurgies to the south, the elements that had been introduced from those areas were\nreinterpreted and transformed, resulting in the development of a technologically original, highly inventive\nregional technology in West Mexico."
    },
    {
      "category": "Resource",
      "title": "unit4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-986-the-human-past-introduction-to-archaeology-fall-2006/de75f0c3a798a093c5ff4ce1e7f6185c_unit4.pdf",
      "content": "3.986\n-\nThe Human Past:\nIntroduction to Archaeology\nFall 2006\nUnit 4 - Societal Collapse\n-\nsuggested readings\nTextbook:\nLamberg-Karlovsky, C.C. and Sabloff, J.A.\nAncient Civilizations: The Near East and Mesoamerica. 2nd Ed.\nProspect Heights, IL: Waveland Press. Pp. 167-169, 288-296, 313-314.\nJournal articles and chapters\n1.\nMorrison, Kathleen D.\nFailure and how to avoid it. Nature\n440:753-54.\n2.\nWeiss, H. and R. S. Bradley\nArchaeology: what drives societal collapse?\nScience 291 (5504): 609-610.\n3. Jacobsen, T and R. McC. Adams\nSalt and silt in ancient Mesopotamian agriculture.\nScience 128:1251-58.\n4.\nGibson, M.\nViolation of fallow and engineered disaster in Mesopotamian civilization.\nIn T. Downing and M. Gibson (eds.) Irrigation's Impact on Society.\nUniversity of Arizona, Anthropological Papers no. 25:pp. 7-20.\n5.\nKerr, R.A.\nSea-floor dust shows drought felled Akkadian Empire. Science 279:325-26.\n6.\nHaug G.H., D. Gunther, L. C. Peterson, D.M. Sigman, K.A. Hughen, B. Aeschlimann\nClimate and the collapse of Maya civilization. Science 299:1731-35.\n7.\nWeiss, H., M.-A. Courty, W. Wetterstrom, F. Guichard, L. Senior, R. Meadow, A. Curnow\nThe genesis and collapse of third millennium north Mesopotamian civilization.\nScience 261(5124):995-1004.\n8. Grossman, D.\nParched turf battle.\nScientific American 287(6):32-33.\n(Dec. 2002)"
    }
  ]
}