{
  "course_name": "The Places of Migration in United States History",
  "course_description": "This course examines the history of the United States as a “nation of immigrants” within a broader global context. It considers migration from the mid-19th century to the present through case studies of such places as New York’s Lower East Side, South Texas, Florida, and San Francisco’s Chinatown. It also examines the role of memory, media, and popular culture in shaping ideas about migration. The course includes optional field trip to New York City.",
  "topics": [
    "Humanities",
    "History",
    "American History",
    "Social Science",
    "Anthropology",
    "Ethnography",
    "Humanities",
    "History",
    "American History",
    "Social Science",
    "Anthropology",
    "Ethnography"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nSyllabus Archive\n\nThe following syllabi come from a variety of different terms. They illustrate the evolution of this course over time, and are intended to provide alternate views into the instruction of this course.\n\nFall 2006, Christopher Capozzola (\nPDF\n)\n\nOverview\n\nThe idea that the United States is a \"nation of immigrants\" is one of the fundamental premises of American history and popular culture. Of course, the United States is historically a nation of immigrants. Yet cross-border migration characterizes the experience of many nations, and even this nation of immigrants has had a changing and uneasy relationship to actual immigrants in our communities. This class takes up the challenge of examining migration in United States history from a global perspective, and does so by looking at migration from the perspective of several individual places. Some of them are familiar sites; others may be less so. Some, too, are conceptual places (\"Chinatown,\" \"Hollywood,\" \"Ellis Island\") that can be both conceptual and real. We will examine how ideas and representations of immigration have also shaped politics, economics, and demography in the modern United States.\n\nChronologically, the class begins in the late nineteenth century, with two founding moments: the passage of the Chinese Exclusion Act of 1882 (the first major federal law regulating immigration) and the establishment of the immigration processing center at Ellis Island in 1891. These events responded to and ushered in an era of mass migration from Europe and Asia that is the focus of the first half of the course. In the semesters second half, we will focus on the mass migrations since the mid-1960s, returning to many of the sites we studied earlier. We will also visit several area sites to get to examine the history and culture of immigration. Right now two trips are planned: one to New York City, another to Lawrence, Massachusetts. These are not required, but strongly recommended.\n\nGrading and Requirements\n\nREQUIREMENTS\n\nPERCENTAGES\n\nCollaborative Research Project\n\n10%\n\nWriting Exercises\n\n10%\n\nClass Participation\n\n20%\n\nShort Paper (3-5 Pages)\n\n20%\n\nResearch Paper (11-14 Pages)\n\n40%\n\nThe success of this class depends on the active participation of all students. Class\nparticipation\n(20%) represents a substantial portion of the grade, and will be evaluated in terms of preparation, participation in large and small group discussion, active listening, collaboration, and overall contributions to the class experience during the term. Needless to say, if you do not attend a class it is impossible for you to contribute to it. In preparation for discussion, you may be asked to write short response papers or send me your thoughts and questions by email. Completion of these exercises will factor in your participation grade. An additional portion of the grade will be based on participation, preparation, and presentation of the\ncollaborative research project\n(10%) at the end of the semester.\n\nEveryone will write\none 3-5 pages essay\n(20%) and a\nlonger 11-14 pages essay\n(40%) on a topic of your choosing. Preparatory\nwriting exercises\n(10%) will help students develop a topic, a bibliography, and an argument in advance of the final paper itself. There are no midterms or final examinations in this class. Adherence to standards of academic honesty is required; if you have any questions about how to go about your writing or cite your sources, don't hesitate to ask.\n\nCalendar\n\nWEEK #\n\nTOPICS\n\nKEY DATES\n\nPart 1: Then\n\nIntroduction\n\nLecture and Discussion: Where is Immigration History?\n\nLawrence\n\nLecture: European Migrants at the Turn of the Century\n\nDiscussion\n\nChinatown\n\nLecture: Asian Immigrants at the Turn of the Century\n\nDiscussion\n\nMapping Lawrence, Mapping Chinatown\n\nMultimedia Resources\n\nInformal Student Presentations\n\nFilm:\nFarmingville\n\nShort paper due\n\nTampa\n\nLecture and Discussion: The World of Caribbean Migration\n\nThe Border\n\nLecture and Discussion: The Border/Nuestra America\n\nChicago\n\nLecture: Was the Great Migration Great?\n\nDiscussion\n\nHollywood\n\nDiscussion (cont.)\n\nFilm:\nThe Jazz Singer\n\nResearch paper topic due\n\nFilm:\nThe Jazz Singer\n(cont.)\n\nDiscussion\n\nThe Lower East Side\n\nLecture: Remembering Ethnicity in an Age of Multiculturalism\n\nDiscussion\n\nTrip to New York City\n\nPart 2: Now\n\nThe \"New\" Immigration\n\nLecture and Discussion: What's New about \"New Immigration\"?\n\nFilm:\nThe New Los Angeles\n\nBrainstorming for Collaborative Research Project\n\nResearch paper prospectus due\n\nManila/Chicago\n\nLecture: American Imperialism and Filipino/a Experience\n\nDiscussion\n\nCollaborative Research Project: U.S. - Mexico Border Relations\n\n20-21\n\nDiscussion\n\nGuest Lecturer: Raul Rubio on the Cuban-American Experience\n\nLawrence\n\nPaper Meetings\n\nStudent Presentations on U.S.-Mexico Border Relations\n\nConclusion\n\nFilm:\nMy Big Fat Greek Wedding\n\nResearch paper due",
  "files": [
    {
      "category": "Resource",
      "title": "abstract_anon.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-221-the-places-of-migration-in-united-states-history-fall-2006/624d9b5cf5947750f276b062c3cf4bfe_abstract_anon.pdf",
      "content": "Courtesy of the author. Used with permission.\nAbstract: Lawrence and Chicago\n\nThere were expected and surprising similarities and differences of immigrants'\nlives and experiences between the textile factories of Lawrence, Massachusetts and the\nmeatpacking factories in the \"Packingtown\" district of Chicago, Illinois at the beginning\nof the 1900s. The Bread & Roses strike that happened in Lawrence on January-March\n1912 is compared and contrasted with the true events surrounding Packingtown in the\n1906 book The Jungle by Upton Sinclair. Topics discussed include the composition of\nthe immigrants, the living conditions, the working conditions, the involvement of unions,\nand the public and government responses. These two events changed the America's\nviewpoints on immigrants, laissez-faire capitalism, and the working class."
    },
    {
      "category": "Resource",
      "title": "abstract_jen.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-221-the-places-of-migration-in-united-states-history-fall-2006/da7673466e6590040011a6c43e4892b1_abstract_jen.pdf",
      "content": "Courtesy of Jennifer Hernandez. Used with permission.\nAbstract\nAs the Tide Turns: An Analysis of Cuban Policy and its Effects\non the Capability of Cuban Immigrants to Succeed in the U.S\n\nIn the years after Fidel Castro's ascension to power, Cubans have immigrated to the U.S.\nin various waves. While the initial exiles were wildly successful and prosperous, the\nmost recent immigrants have found considerably less success in their new country. This\nchange in the Cuban emigrant's experience, I argue, is fundamentally tied to the\neconomic changes in Cuba, culminating in the dollarization of the Cuban economy. This\nnew generation of Cuban immigrants is increasingly estranged from the human capital\nskills and strong work ethic embodied by the initial waves of Cuban immigrants. As I\nargue, the social, political and economic factors that currently prevail in Cuba have\ncreated a society more dependent on remittances, theft, and prostitution than on labor to\nsupport itself. This situation makes newer Cuban immigrants to the U.S. less able to\nadapt and integrate into the American workforce."
    },
    {
      "category": "Resource",
      "title": "abstract_nicholas.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-221-the-places-of-migration-in-united-states-history-fall-2006/56667e60d15b49bfc6fbcc61450a2ba0_abstract_nicholas.pdf",
      "content": "Courtesy of Nicholas Semenkovich. Used with permission.\nAbstract\nMuslim Integration and the European Union:\nA role for immigration restriction\nFew regions face immigration problems as pronounced as those in the European Union.\nLarge numbers of Muslim immigrants, combined with a growing anti-Islamic sentiment,\nhave resulted in social unrest. With few attempts to ease tensions, Muslims are\nincreasingly discriminated against and have been isolated from the European community.\nThe 2005 French riots may have only been the beginning of Europe's troubles as isolating\nMuslims is likely to promote Islamic extremism. As the flow of immigrants into EU\ncountries continues nearly unabated, the European Union must act soon to standardize\nimmigration laws and implement a selective immigration policy."
    },
    {
      "category": "Resource",
      "title": "abstract_stonely.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-221-the-places-of-migration-in-united-states-history-fall-2006/b0fc488a8bbab5ec3e703e3682e6d9fa_abstract_stonely.pdf",
      "content": "Courtesy of Aaron Stonely. Used with permission.\nAaron Stonely\n21H.221\nProfessor Capozzola\nAbstract\n\nMexican migration to the United States is as old as the border itself. Yet today, the\nMexican migration issue and the topic of immigration reform have once again surfaced as the\nfocus of intense political discussion. This debate has resurfaced due to an increase in the total\nmigration from Mexico to the United States. The objective of this paper is to explain this\nincrease as a combination of several factors. First this paper will examine the push and pull\nfactors involved in the migration. Next, this paper will analyze the factors involved in return\nmigration. Finally, this paper will analyze why Mexican immigration is spiraling out of control\nas well as suggest ways to bring it back under control."
    },
    {
      "category": "Resource",
      "title": "paper_healthcare.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-221-the-places-of-migration-in-united-states-history-fall-2006/ff9957fafd6e1d997697f131a77213e1_paper_healthcare.pdf",
      "content": "21H.221 Term Paper\nSarah Chu\nActive Children, Active Reformers: The Development of Child Healthcare in the Late 19th\nand early 20th Centuries\nAt the turn of the 20th Century, the United States saw the expansion of a major public\nhealth movement: the widespread interest in child health improvement. This public health\nmovement began in the late 19th century with legislation and charity organizations.\nMassachusetts in 1894 became the first state to require medical inspections of school children.\nNew York soon followedi. Northern cities such as Boston and New York effected similar\nchanges in industrial production, though such changes were not evenly distributed among rural\nand urban areas throughout the country. In Boston and New York, the birth rate among\nimmigrants was higher than among native-born families and then started to slow in the early\n1900s as more daughters began to workii. Between 1908 and 1915, twenty-one states passed\nlegislation requiring medical exams of school children. The public movement was a response to\nthe population increase in major cities such as Boston and New York, which included many\nimmigrant groups. The child health movement (mostly regarding physical health) began as a\nscientific but also very socio-cultural response to the time. This socio-cultural factor was tied to\nthe fight against poverty. But because of the social factor, immigrant and non immigrant\nchildren could play a critical role in addition to that of middle class reformers. Child health was\na reform that children could credit themselves for contributing to. They not only learned from a\nvariety of sources, but they also helped with education of good health care habits. Children,\nimmigrants, and immigrant children would not have played the integral role they did had the\nmovement not been as socially and sociologically grounded as it was.\n(c) 2006-2007 Sarah Chu\n\nIdeas of how to best care for children in America date back to 17th century Puritanism.\nThe history of child health was influenced by religion, science, and philosophical thought.\nDisease was thought to be caused by divine interventioniii. In the 19th century, midwives acted as\n\"doctors\" and not only assisted with birthing but also advised about breast feeding, nutrition, and\nhow to combat disease. Moreover, most medical schools began to teach about child diseases\nafter the mid 19th centuryiv. In the 19th century, prominent pediatricians emerged. Dr. Abraham\nJacobi established the field of pediatrics and the first child clinic in the United States. He\nstressed children's importance to the future, that their actions would have profound effects on\nsociety, and that thus their health needed to be attended to starting from a young agev. He\nthereby characterized pediatrics as a socio-cultural science; comforting sick children by cheering\nthem up was just as important as administering new medicines to them. Before doctors' visits\nbecame commonplace, it was thought that parents, especially mothers, would know the idio\nsyncrasies of each child and would therefore know the best way to care for that child's health.\nThe Progressive Movement gave rise to discussion about the issue of children's health\nand preventive medicine. In 1921 the Sheppard-Towner Act passed. This federal social\nlegislation sought to improve maternal and children's health with federal funds and contributions\nfrom the Children's Bureau. For the year 1921 alone it allocated $480,000 to be divided among\nseveral statesvi. The Sheppard-Towner Act in 1921 also allocated funds for midwife training\nprograms and to create licenses for public health nurses.\nThe movement to aid children living in poverty in fact dovetailed with the movement\nagainst cruelty to animals, though to animal rights activists child health was lower in importance,\njust above aiding criminals. Still, animal rights supporters also subsumed the issue of child\nwelfare and were among the first in the field in the late 19th centuryvii.\n(c) 2006-2007 Sarah Chu\n\nReformers believed in targeting poor and immigrant children to make the most\nimprovement. Progressives understood that poor children were tomorrow's lower class, and that\nthey were at risk for becoming criminals but would also be, as adult citizens, potential\ninfluencers of city policiesviii. Youths, and not just infants, thus needed to be cared for. Child\nlabor further compounded the problem. Child labor led to health problems like poor eyesight.\nChildren would work late at night and then arrive at school the next day injured and too tired to\nthink coherentlyix. Reformers also wanted to fix the filthy living conditions of poor immigrants\nbecause the squalor menaced their development and upbringing. The idea of the children's\nliving condition being the root cause of lack of moral or healthful development was known as the\nenvironmental explanation of povertyx.\nEdward T. Devine, the editor of \"Charities and the Commons\", a journal published by the\nNew York Charity Organization Society, wrote an editorial in 1908 encouraging reform and\nexpressing with conviction that children needed to be nurtured and protected. He felt that they\nalso had several rights, including the rights to education, play, and better health. He asserted that\n\"the substantial reduction in the death rate of many communities is due to the saving of the lives\nof babies more than to reduction at any later age. It is the new view, the social view, that this\nprocess should be carried farther...\" xi. He envisioned that the Children's Bureau, an\norganization only beginning to develop at the time, would oversee all aspects of raising children.\nRegarding the Children's Bureau, Devine said that \"The Federal government should study\ncontinuously the problems of...infant mortality, illiteracy...child dependence, and child labor,\njust as it studies...the soils, the forests, the fisheries, and the crops\"xii. In this optimistic editorial\nby Devine, which was probably at least somewhat characteristic of the rationale behind the\nProgressive reformers, it is apparent that reformers felt that this bureau would be a sort of social\n(c) 2006-2007 Sarah Chu\n\nconstruct, built to oversee not just the physical health of a child. They seemed to want this\noverarching organization to care for the child at the holistic level. Physical health would play a\nmajor role, but nurturing children and equipping them to be useful members of society was also\nof utmost importance. It was a social movement because in order to give children the right to\ngrow up, the rest of society would need to change as well; Devine, for instance, mentions\neducating parents to know what their children need and how to respond to these needs. Surely,\nas Devine would agree, if the issue at hand concerned people's own children, parents would want\nto know what they could do to help. Devine's editorial is an attempt at laying out precisely what\nchildren should have, especially children \"of avaricious poverty\" and to those children affected\nwith \"race degeneracy\".\nThe idea of a health care system was formalized in the late 19th and early 20th centuries.\nBreakthroughs in medicine were just as prestigious as were those in science. Health care\nproviders sought to gain social acceptance by associating with the field of medicine. Too much\nmotherly love was considered dangerous. Magazines encouraged mothers to consult doctors\ninstead of their friends for child health care. And at first they dutifully complied with the\ndoctors' suggestions.\nAt the turn of the century, child health was discussed from a variety of perspectives. At\ntimes the field was tagged onto the emerging field of medicine to give it more credibility. White\nmiddle class mothers were concerned about their own children but also about the immigrant\nchildren their children interacted with; these mothers began discussing what could be done to\nprotect their children from the immigrant children. The different social classes had different\nideas about how to best care for children, and there did not seem to be any sort of standardized\nprocedure for child rearing that was widely accepted among immigrant and nonimmigrant groups.\n(c) 2006-2007 Sarah Chu\n\nGerm theory about the transmission of disease was just beginning to find its footing. Germ\ntheory, the growing prestige of doctors, and the building of several hospitals was good and bad\nnews to immigrant families. In order to appeal to immigrants and non immigrant groups the\nemphasis would have to be on how better health would make them better citizens, and that the\nscience would need to be available for backup, although the social message would have to\ntranscend the science.\nMany immigrant groups were living in similar conditions during this time. Regardless of\nwhat groups of immigrants settled, they lived in similar conditions of overcrowded, dirty\ntenements. Though physicians attributed their poor health to their ethnicity, their health was\nmore likely tied to their being impoverished and unable to afford better nutrition or living\nconditions. Infanticide was considered an option that many mothers were aware of. Unwanted\nbabies would be put in foster homes and then neglected, leaving the infants to die of starvation,\ndehydration, or diseasexiii. These \"baby farms\" would be disguised as private nurseries but\nprovided a means for desperate parents to discard their unwanted children. Those children who\nsurvived this torture grew up to have psychological abnormalities.\nUnfortunately, conditions faced by late 19th century children who were not raised on baby\nfarms were not much better. Unsanitary conditions facilitated the circulation of diseases such\nas tuberculosis, diarrhea, and measles. Among social groups, there were fears of being\nstigmatizedxiv: having tuberculosis shamed your entire family. No one wanted to hire these\nimmigrants or let their kids to play with those from immigrant families.\nOut of concern for their own children and seeking to protect their children from the filthy\npoor immigrant children, middle-class women reformers organized to work to provide relief for\nchildren raised in poverty. These women were also concerned about these diseased immigrant\n(c) 2006-2007 Sarah Chu\n\nchildren's condition as resulting from lack of proper parental care and love. These children and\ntheir parents needed to learn middle-class, Christian values. Women reformers were successful\nin communicating these children's needs to financiers and political parties because they were\nable to convince them that the plight of poor immigrant children composed a large part of the\nnation's imminent social issues that needed attention and funding.\nAt the 53rd Annual Meeting of the American Public Health Association (APHA), the\nassociation wanted to focus on scientific advances, including advances in the field of child health,\nmostly regarding physical healthxv. A program of the meeting's \"Scientific Sections\", shows that\nin a session regarding public health administration, Dr. George Palmer gave a report about a\nchild health survey conducted in cities with a population between 40,000 and 70,000. In addition,\nthere was an entire session devoted to child hygiene. Some of the speakers talked about health\nproblems in education, dental hygiene for children, and the relationship between pasteurized\nmilk and gastroenteritis. It was easy to characterize children's health as an effect of their\nparents' health and parents' working conditions.\nDr. George Price was the Director of the Joint Board of Sanitary Control and the Union\nHealth Center in New York City. In a speech he gave at the 52nd annual APHA meeting, he\nspoke about clothing pressers and his several evaluations of them. These workers were less\nskilled than tailors and were mostly drawn from the adult immigrant population who had not\nnecessarily been pressers in their native country. Since pressing required handling heavy irons\nand standing for long stretches of time, few women worked in the trade. The working conditions\ndid not differ from those in other similar industries, though the U.S. Public Health Service did\nnote the high levels of carbon monoxide near the pressing tables. Though the work required\nhealthy workers, most workers' health was sub par, with many suffering from tuberculosis.\n(c) 2006-2007 Sarah Chu\n\nDiseased workers undoubtedly put their children at risk. Of the 129 paid benefit workers of the\nLocal 35 (all male) branch of the International Ladies garment Workers' Union affected with\ntuberculosis, 123 of them had childrenxvi.\nPower struggles occurred between mothers and physicians over who was most apt at\ncaring for families; both considered the other to be ignorant. In the 19th century some doctors\nhad already begun to treat patients by learning about their lives because disease supposedly came\nfrom people's interactions with their environments. Doctors thus established personal\nrelationships with their patients in addition to treating their illnesses. However, in the early 20th\ncentury, physicians were discouraged from using what they learned personally from each patient\nto treat his/her sickness. Germ theory and progress in bacteriology allowed doctors to approach\nmedicine from the purely technical side. And the building of several hospitals meant fewer at-\nhome visits, further distancing physicians with their patients. Still, the use of emotion and\nempathy was not completely discarded.\nBy the time the 20th Century came around, child care had the aid of better scientific\nunderstanding of disease. The US Children's Bureau was founded in 1912 to focus efforts on\nchildren's health. In 1921 more than 1.5 million copies of the book Infant Care circulated.\nPublished by the Children's Bureau, Infant Care advised on living conditions, nursery conditions,\nclothing children, bathing babies and children, feeding and breast feeding children (how and\nwhat to feed them), and how to assuage ailments like diarrhea and hiccups (gently massage the\nabdomen or place the baby's face downward across the mother's lap to help relieve him/her, or\ngive a few drops of water to the baby) xvii. It also contained advice about child sleeping habits.\nAnother section had recipes for all kinds of healthful foods. The Children's Bureau also\norganized several conferences about mother and child health.\n(c) 2006-2007 Sarah Chu\n\nMothers had become skeptical of doctors' advice, so they started writing to the\nChildren's Bureau because they wanted unbiased, objective directions for caring for their\nchildren. They trusted the bureau because they'd heard success stories from other mothers, and\nthey also noticed the start of the decline in infant mortality rate. Mothers would often ask the\nbureau to evaluate the doctor's advice because they felt they were getting conflicting advice\n(from or between doctors, other mothers, and the pamphlet) or advice that contradicted these\nmothers' intuition or instinct. Mothers considered the reply from the Children's Bureau to be the\nfinal answer. In some instances children also wrote to the Children's Bureau themselves. The\nChild Hygiene Division of the Bureau was established in 1914 and consisted of physicians and\npublic health officials such as nurses. This division studied conditions affecting children's\nhealth and infant mortality and responded to the mothers who wrote to the Children's Bureau\nasking for advice about their children's health xviii\n\"National Baby Week\" was first observed March, 1916, under suggestion of the\nChildren's Bureau and the General Federation of Women's Clubs. The goal was to make parents\nmore interested in understanding new ways to take steps to protect the health of their children\nand to learn about the new standards of child health xix. To this end, several conferences with\nexhibits offered a plethora of advice. One of the bureau's publications was entirely devoted to\nthe Baby Week Campaign.\nThe New York City based New York Charity Organization Society (COS) was another\nvery visible philanthropic organization. The COS distinguished between more deserving and\nless deserving immigrantsxx. Those who were willing to work were given higher priority. The\nCOS was less interested in stereotypical gender roles and encouraged women to pursue self\nsubsistence. This often meant that women had to leave their sick children home alone while they\n(c) 2006-2007 Sarah Chu\n\nworked. Home work did not pay well, so most women left their homes to work. And if they did\nwork at home, they often subjected their children to the dangerous environment or equipment\nthey needed for work, like hot irons and boiling water. Mothers couldn't bring their children to\nwork, and sick children were denied entry to daycares. Immigrant groups who were served by\nthe COS included Italians, Irish, Germans, Austro-Hungarians. Jews were referred to the United\nHebrew Charities.\nOne major contribution of the COS concerned efforts to combat tuberculosis. A set of\nfacilities for children was established to prevent tuberculosis. The \"Preventorium\" took in 150\nkids between ages four and fourteen, selected by the Department of Health. The COS also sent\nkids at high risk of tuberculosis to boarding houses in the country. As the rich were exempt from\nmandatory tuberculosis disinfection of homes, a system of rewards and punishments was\nestablished for poor families to comply with the tuberculosis eradication program. Aid consisted\nof groceries and fuel for heating.\nThe COS also tried to convince immigrants to let their kids be admitted to hospitals for\ncare. When the families refused, the COS could not force them. However, the COS referred the\nfamily to the Society for the Prevention of Cruelty to Children (SPCC) to ask the agency to\nforcibly take the child to a hospital. Often immigrant parents did not want to let their children go,\nsaying their children didn't want to be away from their parents and wouldn't be able to\ncommunicate to anyone in the hospital. It thus seemed that to immigrants, the child's social\ncircumstances/environment was more important than the type of medical treatment being\nreceived. It is not clear that these immigrants realized that their children would get better\ntreatment at a hospital. Immigrants talked among themselves. When they heard the tragic story\nof Maria Germani, who was forcibly taken to the hospital and then died because she did not\n(c) 2006-2007 Sarah Chu\n\naccept any of the treatment and her tuberculosis was already too advanced, other families were\nmore convinced that if their child was taken to a hospital she'd die therexxi. To the Germanis,\nMaria was a child, but in the eyes of the COS and Department of Health, she was an infectious\nagent. There is not enough written about the perspectives of immigrants to know whether their\nhealth beliefs actually paralleled those of these agencies and charities, though there is one\ninstance where immigrants thought reformers to be crazy. Italian mothers were astounded by the\nidea of sending their older daughters to school instead of to work xxii\nThe New York City Department of Health also became prominent through its response to\ntuberculosis and the health education campaigns it promoted. It was one of the first to have\ncomprehensive systems of treatment.\nOne of the deadliest child illnesses in the early 1900s was tuberculosis, for which there\nwas no medicinal cure. Instead, the treatment was lots of fresh air, which was not as readily\navailable in cities and neighborhoods of tenements. One of the solutions was to create outdoor\n\"fresh air\" schools, such as the School of Outdoor Life for Tuberculosis Children, in Boston xxiii.\nAt the school, children participated in a number of outdoor activities, some of which involved\nlearning about personal hygiene. The children enjoyed their time at these camps and learned to\nlike caring for themselves and being clean, which had been part of the intention when opening\nthe schools. Many children with tuberculosis were sent instead to hospitals, and their stay was\nnot nearly as enjoyable and likely not as educational. Thus, children learned about good hygiene\nin an environment conducive to teaching young people: the outdoors where they liked to play.\nChildren received much attention and were fed well, and after fifteen weeks were reexamined by\na physician and returned to their regular school. The school was funded entirely by volunteers\n(c) 2006-2007 Sarah Chu\n\nand only two of the children's parents were born in the United States; among the other children,\ntwelve were Irish, eleven Jewish, four Turkish, six Polish, and one Scottish.\nCharity organizations were not at all the only source of teachings. There were several\nmedia-based tactics and large-scale conventions, all aimed at reaching the masses. Health\nbroadcasts were short, five minute programs over radio on weeknightsxxiv. They were very\neffective because children could listen, too, even if they could not read articles in newspapers or\nmagazines. There were an increasing number of exhibits and health shows. Unfortunately,\nthough, these shows sometimes appeared more like massive fairs for companies to advertise their\nproducts; still, they successfully disseminated information about whatever health ailment they\nwanted to treat. Children often went through these fairs, given tickets by their employer.\nThe Chicago Child Welfare Exhibit in 1911 was a convention of booth displays and\nlectures featuring child welfare professionals about myriad topics ranging from infant health care,\nclean water, housekeeping techniques, social workers and pediatricians, and educational toys.\nPublic schools, governmental agencies, and charity organizations were among those with\ndisplays, some of which featured children demonstrating particular skills and some which were\noriented at audience participation. The tremendously successful exhibit drew crowds of up to\n45,000 people each day during its two week run. The exhibit also elicited excitement and\nhopefulness among the crowds and exhibitionersxxv .\nIn the opening remarks of the exhibit, Cyrus H. McCormick, the exhibit's sponsor,\nvehemently stated that \"If mankind is to be reformed or improved, we must begin with the\nchild\"xxvi. He said that children growing up in slums were in no way prepared to contribute to\nuseful life work as adults, and that children had the right to a healthier upbringing in order for\nthem to be able to meaningfully contribute to society later on in life and be self-sufficient. He\n(c) 2006-2007 Sarah Chu\n\ncalled for the exhibit to be a vehicle for the \"march of progress\" to see what advances had been\nmade and which ones were still to come. His focus on the idea that children were society's\nfuture adults and leaders seemed to give the impression that he wanted to prepare children to face\nuncertainties whose consequences would greatly affect society, and though he did not know what\nthese uncertainties would be, it seemed he knew that all children needed to be healthy enough so\nthat health would not be the primary concern and so that these soon-to-be mature citizens could\nface tougher challenges. These reformers' progressive thinking toward future challenges left\nlittle room for homage to or retrospective consideration of immigrant idiosyncrasies.\nSeveral of the displays at the Child Health and Welfare Exhibit educated audiences about\navailable resources for child raising. One example, the \"Baby Tent\", was a place mothers could\nleave their children in physician care for examination, bathing, enema, and new, clean clothing.\nWhen a mother retrieved her child, she also received food for her child and an individualized\nhealth report containing advice for future care. Often, these mothers did not speak English and\nthus had an older child translate. It also often took some coaxing of the mothers to convince\nthem to leave their child for this treatment because the mothers did not always agree with the\nphysicians' methods. The tents, however, were a success; child death from diarrhea dropped by\nten percent in cities in 1910. Once mothers began to see a difference, they began to support the\nendeavor enthusiastically xxvii.\nMuch advice was related to good dental and mouth hygiene because many of the chief\nchildhood diseases were contracted through germs entering the mouth and the digestive process.\nThe display advised mothers about tooth brushing and dentist visits.\nA working or lower class family spent about half its income or more solely on food.\nBetween the 1880s and 1930s, American society moved more toward a consumer culture with\n(c) 2006-2007 Sarah Chu\n\ndepartment stores and an abundance of new advertising schemes. And poor children could do\nlittle more than look at the ads and pine away. Thus, it seems that incorporating health\npromotion into advertisements and creative plays and parades was a clever idea because it was a\nway for children to get involved in consumer culture while also actually benefiting from it with\nimproved health.\nThough there were many media-based initiatives for targeting child audiences, the main\noutlet for learning about hygiene and public health occurred in schools. Maud Brown was the\nDirector of Health Education of the Child Health Demonstration in Fargo, North Dakota. She\naddressed the American Public Health Association (APHA) in its 52nd annual meeting. She said\nthat any health service in a school should also have the right to promote health through\neducationxxviii. She distinguished between the lawful domain and what was acceptable outside\nthis. Teachers in health education programs should be permitted to help children for their sake.\nShe was referring specifically to classroom teachers as opposed to, for instance, physical\neducation teachers or home economics teachers, who had different jobs that also addressed\nhealth education. But since the primary role of the classroom teacher was to instruct, it was\nreasonable for teachers to also teach students healthy habits and how to care for one's physical\nhealth. In agreement with Ms. Brown, Lou Lombard, a nutrition instructor for the Massachusetts\nState Department of Public Health based in Boston, quoted a Commissioner of Education of a\nsouthern state as saying that \"teaching people how to live is the biggest and most important\nproblem that the schools can undertake\" xxix, ostensibly because so many people appeared to be\nliving wayward lives. Mr. Lombard felt that nutrition constituted a significant part of someone's\nway of life and thus advocated, at the annual meeting of the American Public Health Association\nin 1923, for incorporation of nutrition lessons into school life. This program should include\n(c) 2006-2007 Sarah Chu\n\ninstruction on what to eat, how to rest, and how to care for the body. He stressed that all children,\nnot just the undernourished ones, needed these lessons to have good health. Moreover, a\nprogram targeted solely at undernourished children was very costly. Mr. Lombard encouraged\nteachers to instruct their students about nutrition and felt that teachers should receive more\ntraining to be able to do so.\nRegarding whether teachers, doctors, or nurses should teach health in schools, Dr. Merrill\nChampion also advised that teachers should undertake the responsibility because parents came to\nexpect the schools to teach things that were formerly taught at home, like safety, protection\nagainst fire, and physical care for themselves xxx. The issue of ethics was raised concerning how\nmuch medical influence teachers could have. Was it ok for teachers to do makeshift \"physicals\"\nof children before sending them to see a doctor? Brown said teachers would not want to do this\nin addition to their other responsibilities because they were underpaid and already overworked.\nHowever, Ms. Brown was in favor of their doing this as a way to educate teachers about\npediatric medicine and holistic care for the child. The role of the teacher in health education was\ndebated among educators.\nWhile several organizations aimed at imposing their ideas on poor and immigrant\nfamilies, the children themselves were not passive receptacles. In order to have children learn\nabout improving their health, they needed to be interested in learning either by having their\ncuriosity piqued or by being appealed to through another activity in which they already\nparticipated, like sports. Children probably even convinced their parents of good ways to care\nfor their kids because the parents may have been averse to these programs. Kids were easily a\ncritical influence on their parents. Thus, there were instances of bribes for children to get tested\n(c) 2006-2007 Sarah Chu\n\nfor disease: from rewards of talcum powder to tickets for shows at theater houses that were\nactually shows to promote good health. Mass marketing was often aimed specifically at children.\nThe children themselves began to play a more active role in their own education.\nAnother of the outlets of reaching children was A Health Circus Parade, in which children\nappeared. Part of the fanfare included boys dressed up to play a baseball game against visiting\nteam \"Tuberculosis\"; the bases represented the cures/preventions that were popular of the time--\nfresh air and closed windows, for example. Furthermore, a Boys' Health Pageant showed off\nchildren dressed as milk, vegetables, a scale showing proper child weight, and\ntoothbrush/pastexxxi. Several other health plays featured children performers and were also\naimed at teaching children.\nIn Boston, the \"City of Hawthorne\" was a program founded as a way for poor children\nages five through fourteen to be able to play in a safe, supervised setting. The program was\nfounded in a park in a poor neighborhood and was targeted at and actually limited to those\nfamilies. The children established their own mini-government of the Hawthorne Park, with each\nchild playing a role, following a written plan of rules, and carrying out punishments. One of the\npunishments for a child who broke the rules was expulsion from the playground. Interestingly,\nhowever, one eleven year old girl argued that this punishment was cruel because the child would\nhave to play in the dirty street \"which wouldn't be good for [his] health\", and she successfully\nconvinced the others to alter the punishment xxxii . It appears that she knew that health was\nimportant and that all children, even delinquents, should still have the right to clean surroundings\nand good health. Poor (and immigrant) children were cognizant of the alternative of continuing\nto play in filthy, dangerous city streets. These children, it seemed, thereby showed the\nmotivation themselves to better their own health and upbringing, though they may not have\n(c) 2006-2007 Sarah Chu\n\nrecognized that these were the very goals of the reformers responsible for the program's creation.\nEven if the program had been started by reformers with these exact goals and the goal of aiding\npoor children and teaching them discipline, it seemed that the government and harmonious\nmicro-society that the children established had to be done by the children with little adult help.\nChildren were moving in the direction reformers wanted them to, whether or not these children\nacknowledged any reformer influence.\nWhen the Hawthorne government was established, the \"city\" began to grow to include\nhygiene classes taught by a nurse and physician and then later an actual plan of care for a the\nmost \"delicate children\". This plan allowed for the children to spend the entire day in the park\nand involved playing, attending hygiene classes, and sharing nutritious lunches, sometimes based\non what immigrant Italians and Jews would eat, and which also included candy to entice children\nand which were served on fancy trays and tables. Before eating, the nurse had each child wash\nhis face and hands at the new fountain (a new continuous source of water), and each child was\ngiven his own towel (made by the older children). The lunches were cheap to buy and most\nolder children chose to buy these lunches instead of slightly cheaper candy or pickles. Finally, a\n\"Board of Health\", also consisting entirely of Club children, formed. The three members of the\nboard, one girl and two boys, produced the \"rules for health\", which they told the rest of the\nchildren in a speech. The speech consisted of what they had learned in their hygiene lessons and\nincluded rules such as \"In summer take two baths a week, and a sponge bath every day\", \"eat\nsimple and nourishing food, such as plain meat, fruit, eggs, crackers, cream, and cereals\", \"don't\nlet garbage stand around\", and \"change your clothes every week promptly\". As Lilian V.\nRobinson wrote in the Charities and the Commons, \"sickness plays such a grim part in the lives\nof tenement children that an enthusiasm for the pursuit of health is easily roused among\n(c) 2006-2007 Sarah Chu\n\nthem\"xxxiii. These children proudly implemented Hawthorne's Board of Health to interact with\ndifferent departments within the government.\nIn some sense, thus, children were not only receptive to ideas of sanitation and staying\nhealthy, they began to think that this was the only acceptable way to live. They had so much fun\nwith their mini-society that whatever they learned at the park was likely to leave an imprint on\ntheir moral character and help define their future ways of thinking, even if their parents taught\nthem other lifestyles at home. It seems that, at the very least, children who were taught\ndifferently at home would probably recognize the disparities in teachings and know that another\nlifestyle was out there for consideration. Immigrant parents may have been teaching what they\nthemselves learned growing up in their home country, but these practices may have not been well\nsuited for the different, crowded tenement environments of New York City or Boston. Even\nthough the Hawthorne Club was a program run out of a park, it was a success in helping children\nlearn how to improve their health through exercise, nutrition, and good hygiene.\n\nThroughout the 19th and early 20th centuries, immigrants were persistently associated\nwith germs that they had imported from their home country xxxiv, when this was seldom the case,\ngiven the often thorough medical inspection each immigrant had to pass in order to be admitted\nto the US. Knowing who and what caused disease seemed important because one could look at\nthese answers in the context of the organization of society, of the roles these agents played in the\nsocial and even economic realms. Technical medicine would not be useful unless it could be\ntranslated into something that the masses could understand and that society would want to care\nabout. This meant that the science would need to be put, for example, in a social context, to\nteach people how the causes or pathology of a disease could affect and disrupt someone's entire\nfamily, how disease related to poverty. And after hearing about what caused disease, people\n(c) 2006-2007 Sarah Chu\n\nwould want to know what they themselves could do to prevent it from infecting them, probably\nnot in the way of aiding with the actual biological research since most residents were not\nscientists. Nevertheless, doctors played a crucial part of advancing public health for\nunderstanding the biological basis of disease. Social workers alone, though they could\nunderstand societal dynamics, would not be as persuasive without the medical evidence to\nsupport them. The field of child health and public health was a reform of the early 20th century\nthat children played an active role in and also were major beneficiaries of. The fact that they\nwere so involved and had much responsibility in such an important movement and its success\nwas probably due in part to the fact that the movement was grounded in social and sociological\nbeliefs in addition to medical advances. Children were involved almost out of necessity; their\nparents could not really understand English very well and the mothers did not have as much\naccess to educational materials. The very idea of children taking a more active role in their own\neducation seemed to align with the Progressive reformers' call for change.\ni Donald C. Mebane, \"The Examination of the School Children of Olmstead County,\" American Journal of Public\nHealth, 14(8) (1924): 662.\nii David I. Macleod, The Age of the Child: Children in America, 1890-1920 (New York: Twayne Publishers, 1998),\n8.\niii Charles R. King, Children's Health in America: A History (New York: Twayne Publishers, 1993), xii.\niv King, xiv.\nv King, xvii.\nvi James A. Tobey, The Children's Bureau: Its History, Activities, and Organization (Baltimore: The Johns Hopkins\nPress, 1925), 68.\nvii King, 52.\nviii Charles L. Brace, \"The Dangerous Classes of New York, and Twenty Years' Work among Them\", 1872, in\nJames Marten, Childhood and Child Welfare in the Progressive Era: A Brief History with Documents (Boston:\nBedford/St.Martin's, 2005), 33.\nix United States Children's Bureau, Industrial Home Work of Children, in James Marten, Childhood and Child\nWelfare in the Progressive Era: A Brief History with Documents (Boston: Bedford/St.Martin's, 2005), 71.\nx Macleod, 22.\nxi Edward T. Devine, \"The Right View of the Child\", Charities and the Commons, 20 (Apr. 25, 1908): 123-25.\nxii Devine, 91.\nxiii King, 53.\nxiv Emily K. Abel. \"Taking Cure to the Poor: Patients' Responses to New York City's Tuberculosis Program, 1894\n1918\". American Journal of Public Health, 87 (1997): 1808-1815.\n(c) 2006-2007 Sarah Chu\n\nxv \"Association News,\" American Journal of Public Health, 14(9) (1924): 770.\nxvi George M. Price, \"Diseases of the Pressers\", American Journal of Public Health, 14(4) (1924): 310-314.\nxvii David J. Rothman and Sheila M. Rothman, Family in America: Child Rearing Literature of Twentieth Century\nAmerica, (New York: Arno Press, 1972).\nxviii Tobey, 33.\nxix Tobey, 16.\nxx Abel, 1997, 1810.\nxxi Emily K. Abel, Hearts of Wisdom: American Women Caring for Kin, 1850-1940, (Cambridge: Harvard\nUniversity Press, 2000), 157.\nxxii Macleod, 31.\nxxiii Walter E. Kruesi, \"The School of Outdoor Life for Tuberculous Children,\" Charities and the Commons, 21\n(Dec.19, 1909): 447-449.\nxxiv \"What's New In Health Education,\" American Journal of Public Health, 14(5) (1924): 416-424.\nxxv James Marten, \"The Day of the Child Has Come: The Chicago Child Welfare Exhibit, 1911,\" Childhood and\nChild Welfare in the Progressive Era: A Brief History with Documents (Boston: Bedford/St.Martin's, 2005).\nxxvi Cyrus H. McCormick, \"Introductory Remarks\", in James Marten, Childhood and Child Welfare in the\nProgressive Era: A Brief History with Documents (Boston: Bedford/St.Martin's, 2005), 124.\nxxvii \"Chicago Child Welfare Exhibit,\" in James Marten, Childhood and Child Welfare in the Progressive Era: A\nBrief History with Documents (Boston: Bedford/St.Martin's, 2005), 129.\nxxviii Maud A. Brown, \"The Place of the Teacher in a School Health Program\", American Journal of Public Health,\n1924; 14(9): 754-757.\nxxix Lou Lombard, . \"The Place of Nutrition in the School Program\". American Journal of Public Health, 14(5)\n(1924): 394-397.\nxxx Merrill E. Champion, \"Child Hygiene,\" American Journal of Public Health, 17(4) (1927): 418-421.\nxxxi \"Boys' Health Pageant,\" American Journal of Public Health, 11(9) (1921): 827-828.\nxxxii Lilian A. Robinson, \"The City of Hawthorne,\" Charities and the Commons, 15 (Nov.4, 1905): 182-185.\nxxxiii Ibid.\nxxxiv Howard Markel and Alexandra M Stern \"The Foreignness of Germs: The Persistent Association of Immigrants\nand Disease in American Society\". The Milbank Quarterly,\n80(4) (2002): 757-788.\n(c) 2006-2007 Sarah Chu"
    },
    {
      "category": "Resource",
      "title": "paper_muslim_eu.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-221-the-places-of-migration-in-united-states-history-fall-2006/d4cf5388e5ff9cd58cff8a6630cc18a7_paper_muslim_eu.pdf",
      "content": "Nicholas Semenkovich\n21H.221 - Final Paper\n\nMuslim Integration and the European Union:\nA role for immigration restriction\n\nAlthough it arose from a purely economic pact, the European Union today is\nanything but. Throughout the 1990s, policies arose regulating everything from human\nrights to drug trafficking. As nations have grown closer, increased cooperation has\nresulted in open borders and the recent adoption of a shared currency. These factors,\ncombined with the proximity of European nations, have resulted in nearly unencumbered\nimmigration, with enormous numbers of Muslims entering the EU from Northern Africa,\nas well as large internal migrations. Today, the growing number of Muslim immigrants\nin the European Union poses unique and largely unforeseen problems, from a strain on\nsocial services to Islamophobia and social unrest. A lack of unified immigration policy\nin the EU has worsened these problems, as disparate and contradictory policies have\narisen among nations. To protect national identities and promote stable economies, the\nEU needs to act soon to standardize immigration practices and implement selective\nimmigration policies.\n\nIsolation and Exclusion\nMuslim immigrants in the European Union today are broadly discriminated against. Both\nde jure and de facto discrimination exist, impacting civil rights, job availability, housing,\nand religious practice. Over the last few years, external pressures have forced Muslim\ncommunities in the EU to become closely knit, branching off from mainstream European\nsociety as they form \"states within a state.\"1 This status quo of discrimination arose from\nthree separate concerns about Muslim immigration that converged on September 11th:\npervasive Islamic extremism, Muslim cultural differences, and economic implications.\n\n1 Staff Writer. \"The war of the headscarves,\" The Economist, February 4, 2004.\n\nRise of Extremism\nUnlike the United States where much Muslim discrimination has only clearly arisen post\nSeptember 11th, Europe has seen long-term Islamic discrimination. After the 1979\nIranian Revolution, the 1980 hostage taking at the Iranian Embassy in London thrust\nMiddle Eastern affairs into the public eye. Following years of public debates over the\nrole of Muslim faith in Europe, extremist terrorism arose in the 1990s, starting with the\n1994 attempt to crash Air France Flight 8969 into the Eiffel Tower. Then, in 1995, a\nseries of bombs were detonated in France, aimed at damaging public transportation\nsystems. More recently, Muslim extremists were responsible for the 2004 Madrid train\nbombings, the July 7th, 2005 bombings of the London Underground, and have been\nimplicated in the airline liquid explosives plot earlier this year. Europe has typically been\nburdened by more terrorism than the United States as a result of internal factions, such\nthe Spanish group ETA and the IRA from Northern Ireland. Extremist terrorism,\nhowever, poses a vastly different threat to the EU. Both ETA and the IRA typically\ntarget government symbols, commonly warning the police before bombings. Islamic\nterrorism, however, is much broader - targeting civilians and aimed at cause chaos. As a\nresult, the European Union has become fearful and arguably irrationally paranoid\nregarding Islamic terrorism.\n\nTerrorism does pose a clear danger to the EU, but member states have issued far\nreaching edicts that are more likely to anger Muslims and promote extremism than\nincrease security. While the EU as a whole only has limited laws regarding terrorism -\naddressing the sharing of intelligence data and passport security - most member nations\nhave drafted their own restrictive mandates.2 The United Kingdom, for example, passed\nthe 'Terrorism Acts,' increasing police powers, such as legalizing detention without\njustification for up to 28 days.3 A series of botched police actions under these laws have\nsparked outrage among Muslim communities. London has had the most visible police\nfailures, which many blame on a free association of Middle-Eastern men with terrorism,\nas the Islamic Human Rights Commission describes:\n\n2 Cohn, Marjorie. \"SPAIN, EU AND US: WAR OR TERROR OR WAR ON LIBERTIES?,\" The Jurist,\nMarch 16, 2004.\n3 Staff Writer. \"Government's terror bill passed,\" BBC News, March 11, 2005.\n\n\"The increasing persecution of the Muslim community in Britain, both foreign\nnationals and third generation Britons, is an alarming sign of the level of\ninstitutional Islamophobia in Britain today. Both Burma and Zimbabwe justify\ntheir draconian laws and persecution of minorities due to \"internal security\nissues\" or a \"terror threat\". Britain today uses the very same justifications for its\nabuses of basic human rights. Britain today is speaking the language of repression\nand behaving as a tyrant state.\"4\nThe Muslim Council of Britain attributes these failures to intelligence problems and\nwarns of strained Muslim relations, arguing:\n\"The intelligence has to be tested seriously... Because if the intelligence is flawed\nand operations are carried out...that creates difficulties in the community\nrelationship.\"5\nSuch an inability to thoroughly vet intelligence has publicly troubled Britain for the last\nfew years. In October of 2004, it was revealed that seventeen people had been held in\nLondon's Belmarsh Prison for three years without any charges, drawing analogies to\nGuantanamo Bay.6 The majority of these detainees were from Arab countries. Six of the\ndetained people were later let go without charges, as they had been falsely imprisoned.\nAnother six were later release on bail, and it is unclear if they will ever be prosecuted.7\nSome interpreted their bailed release as a public relations stunt, since dropping charges\nagainst them could be interpreted as a British intelligence failure. In April of 2005,\nBritish police shot and killed Azelle Rodney, an unarmed man of Middle-Eastern\ncomplexion, after operating on incorrect intelligence. No police were prosecuted after\nthe killing, which sparked minor protests in Muslim communities.8 Later, in July of\n2005, the British police held down Jean Charles de Menezes and shot him five times in\nthe head. Menezes was an unarmed Brazilian electrician who was mistaken for a suicide\nbomber on the day after the London Underground bombings. Once again, the police\ninvolved were cleared of any wrongdoing, as they acted under a new British 'shoot-to-\n\n4 Policy Briefing, \"Britain: An Outpost of Tyranny,\" Islamic Human Rights Commission, February 4, 2005.\n5 Staff Writer, \"Questions over London Terror Raid,\" BBC News, June 10, 2006.\n6 Winterman, Denise. \"Belmarsh - Britain's Guantanamo Bay?,\" BBC News, October 6, 2004.\n7 Naughton, Philippe. \"Judge grants bail to Belmarsh terror detainees,\" The Times, March 10, 2005.\n8 Barkham, Patrick. \"Shot Six Times by British Police: Why has nobody heard of Azelle Rodney?,\" The\nGuardian, December 7, 2006.\n\nkill' doctrine regarding suspected suicide bombers.9 Abdulhaq Addae, the spokesman for\na Britain mosque, described resulting community tension:\n\"There is a case for shoot-to-kill if it will stop nutcases blowing up innocent\npeople, but the police have got to have more concrete evidence that the suspect is\na suicide bomber before they start firing bullets into someone's head.\"10\nDespite these failures, little has been done to improve British intelligence. In mid-2006,\nBritish police again acted on vague information, raiding a house in Forest Gate, London\nand shooting an innocent man in the shoulder.11 Later that year, nearly 100 British police\nsurrounded Jameah Islameah, an Islamic high school, and uncovered nothing after\nintrusively searching for explosives for 24 days.12\n\nWhile counter-terrorist operations are important to regional stability, the\nEuropean Union needs to be careful in exercising their police powers. Overly hostile\nactions will surely alienate Muslims from the European community. Although the\nhijackers on September 11th were from Arab nations, the London Underground attackers\nwere born in Britain.13 The suspects in the 2006 plot to destroy airlines with liquid\nexplosives were also 'home grown' terrorists. Out of 25 suspects in the airline plot, the\noverwhelming majority were Muslim extremists from Britain. However, even in that\ncase, which was described as a great intelligence success, eight of the 25 suspects were\nrecently released without charges. The EU has a clear need to establish regional\nguidelines for police use of force while increasing intelligence sharing between nations.\n\nHousing Disparities\nAlthough terrorism enforcement may illustrate the most egregious alienations of\nMuslims, a long history of cultural differences offers insight into the current state of\ndiscrimination. Islamic radicals have arisen from years of separation and persecution, an\n\n9 Staff Writer. \"Police chief 'sorry' over death,\" BBC News, July 24, 2005.\n10 Harrison, David and Chris Johnston. \"Muslims back 'shoot to kill' despite an innocent man's death,\" The\nTelegraph, July 23, 2005.\n11 Press Release. \"IPCC to Investigate Forest Gate Firearms Incident,\" Independent Police Complaints\nCommission, June 2, 2006.\n12 Staff Writer. \"No arrests at UK Islamic school after police search,\" The Irish Examiner, September 2,\n2006.\n13 Storobin, David. \"UK Spy Identifies Groups and People Behind London Bombings,\" Global Politician,\nJuly 7th, 2005.\n\nissue that is pronounced in France, and threatens to spread throughout the European\nUnion if left unchecked.\nA clear Muslim migration began in early 20th century France and expanded in the\ndecades after World War II, when Paris lacked reconstruction workers and turned to\nNorth African Muslims. These first generation Muslims, although not actively\ndiscriminated against, were alienated from the French population by choice, choosing to\nlive together in Muslim communities.14 Then, in 1962, nearly 1 million immigrants from\nAlgeria entered France after the Algerian War of Independence. Many of these migrants\nencountered racism in France and were publicly referred to as \"black feet,\" since the\nmigrants feet were sometimes stained from coal on the ships used for their transportation\nto France.15 Although their loyalties generally remained to their home nations, few\nmigrants left France, choosing instead to send money back home. This permanent\nmigration led to a housing shock in France and the construction of the French HLM -\nhousing projects that today serve over 20% of France's population.16 Although the HLM\nsystem was originally designed to spread housing projects evenly over France, all but the\npoorest communities (who needed construction jobs), opposed their development. Thus,\nthroughout the 1980s and 1990s, housing projects served to concentrate the poor and\nform French ghettos. Today, there exists a substantial Muslim immigrant population that\nis localized in the largely impoverished French housing projects.\nThe disconnected grouping of French Muslims makes their integration into\nEuropean society extremely difficult. While the rise of Islamic extremism should make\ncultural integration of utmost importance, many residents of the French HLM describe\nthe opposite - institutionalized opposition to Arab movement and the tendency of\nimmigrants to get \"stuck\" in housing projects. Following September 11th, Muslim\ndiscrimination skyrocketed and to this day, employers across the EU are reluctant to hire\nArabs. Although race-based discrimination is illegal in France, businesses, especially\nthose in retail, are rarely prosecuted. Many even acknowledge their discrimination and\njustify it by saying, \"to be responsible for marketing you must have roots in mainland\n\n14 Crumley, Bruce. \"Fighting Terrorism: Lessons from France,\" Time Magazine, September 24, 2001.\n15 Staff Writer. \"The Second May 13\" Time Magazine, May 25, 1959.\n16 Ryan, Yasmine. \"Why Marseille is Different,\" Scoop Independent, November 12, 2006.\n\nFrance over several generations to understand the French consumer attitudes.\"17\nLandlords are also less likely to rent space to Muslims, increasing the concentration of\nMuslims in poor housing projects and making them outsiders within their own nation.\nMany attribute housing discrimination to security fears. Ironically, however, this\ndiscrimination likely leads to increased risks of terrorism, with \"frustration among [those]\nof African and Arab descent\" arising from separatist policies.18 Finally, additional\nenforcement of immigration laws exacerbated these problems of racism. Although\nFrance has long standing laws that restrict undocumented immigrant employment, they\nwere rarely enforced until fears of terrorism arose, combined with pressure from the\nUnited States. French police were even granted the authority to demand proof of\ncitizenship from anyone walking on the street and a broadly reaching power to deport\nimmigrants. Combined, these measures have nearly destroyed the immigrant way of life\nin France. Today, the HLM districts have an unemployment rate of 19.6% (20 year-olds\nface more than 30% unemployment) and income at 75% less than the national average.19\nThis economic despair has driven crime and social unrest, with little response from the\nFrench government. As a result, in the fall of 2005, large riots broke out in towns\nsurrounding housing projects. The riots were sparked by two Arab immigrant teenagers,\nboth residents of a poor Paris housing project, who were running from police that were\nattempting to check their IDs. The teens ran into an electrical substation to hide and were\nboth killed. In the weeks that followed, youths rioted throughout France, burning nearly\n9,000 cars and causing an estimated $250 million USD in damage. Nearly all of the\nrioters were poor immigrants living in French housing projects.\n\nCulture Shock\nAlthough the problems associated with French housing may seem retrospectively\nclear, France has struggled with their options. Although the French have the option of\npromoting integration by enforcing non-discrimination laws, a strong movement in\nFrance exists in favor of preserving traditional French culture and values. Some recent\n\n17 Staff Writer. \"French Muslims face job discrimination,\" BBC World News, November 2, 2005.\n18 Bohlen, Celestine. \"France Struggles to Help Immigrants Without Sacrificing Ideals,\" Bloomberg,\nDecember 5, 2006.\n19 Valentine, Vikki. \"Economic Despair, Racism Drive French Riots,\" NPR, November 8, 2005.\n\nattempts to diversify French housing and employment have resulted in violence from\nnon-Muslim citizens, such as four French men who were recently convicted of burning\nIslamic religious sites. After their conviction, the men expressed how the desired to\n\"save French culture\" from \"[an] invasion of foreigners.\"20 Many French political\nparties, such as the National Front, advocate severe immigration restrictions and\nprotection of French culture. France's pro-immigration groups lack political capital, and\nIslamic political parties are all but non-existent, leaving xenophobic policy makers\nwithout opposition.21 As a result, in 2004, France took the unfortunate step of banning\nIslamic religious symbols. Historically, France has followed the ideas of laicite, which is\neffectively a pro-atheist standpoint. Unlike the secularism that many national\ngovernments follow, the French discourage any personal displays of religion; a policy\nviewed by some as fomenting a \"plague of separatism\" that is specific to Islam.22\nExtremely secular policy has had a significant impact on Islamic residents of France,\nspecifically after the March, 2004 law that bans any conspicuous display of religion in\npublic schools. This law has been interpreted to prohibit the Koran's requirement of\nwearing hijab (coverings), which include head scarves worn by Muslim women, while\nallowing the display of small Christian crosses and Jewish Stars of David. Despite\nprotests by French Muslims, the United States, and the European Convention on Human\nRights, the law remains in effect today. As a result, a number of Muslim students have\nleft French public schooling, choosing to be educated at home or in religious schools and\nfurther isolating themselves from French society. Although this French policy has been\ncriticized internally and externally, the French ban on head scarves is overwhelmingly\nsupported by French citizens.\n\nGrowing Problems\nPolice abuses, housing disparities, and the fear of culture shock are problems facing the\nentire European Union. While Great Britain has experienced the danger of broad police\npowers, housing problems have risen in Britain. Just this month, the UK housing board\n\n20 Staff Writer, \"Attackers of mosques in France receive 3 to 5 years in jail,\" Deutsche Presse-Agentur,\nDecember 8, 2006.\n21 Burton, James. \"The struggle for a united kingdom,\" The Sydney Morning Herald, December 9, 2006.\n22 Staff Writer. \"Ghettos shackle French Muslims,\" BBC News, October 31, 2005.\n\nwarned that \"properties are often overcrowded, the migrant workers have little choice of\nlocation or condition of property, the rents are usually high and there are often no tenancy\nagreements stating the length of the tenancy or giving any responsibilities.\"23 In France,\nwhere housing problems are at a breaking point, police powers have been growing\nfollowing the 2005 urban riots. Other nations across Europe are experiencing similar\nproblems, notably Spain, which is dealing with an increase in Moroccan immigrants. A\ngrowing body of evidence supports the idea that isolated immigrants are becoming\nextremist. A clear policy promoting diversity and integration across the EU is needed if\nIslamist violence is to be stopped.\n\nSelective Immigration\nThe difficulties facing immigrants in the EU have increased substantially following\nSeptember 11th. Although pressure from the US to increase border control was intended\nto quell the problems of immigration, most policies seem to have had the opposite effect.\nThe EU must now act to implement a selective immigration policy that: consolidates\nnational immigration policies into an EU-wide doctrine, defines short term limits on\nimmigration to the EU, and outlines the rights and services that are extended to all EU\nmembers. The clearest concrete policy to attain these goals is offered by Nicolas\nSarkozy, the French Interior Minister. Sarkozy urgently advocates \"a treaty on\ninternational migration,\" which would include unified rights of workers, selective\nimmigration based on education and job opportunities, and a plan to improve poor\nAfrican nations where many migrants come from.24\n\nStandard Policies\nStandardizing immigration policies will ease the problem of 'nation shopping' - a\nprocess in which immigrants pick and choose EU member states based on their ability to\nimmigrate for as a worker or in seeking asylum. In practice, the proximity of European\nborders and new EU-wide worker regulations means that any one nation with limitless\n\n23 Staff Writer. \"Need to address migrant housing,\" Spalding Today, December 11, 2006.\n24 Staff Writer. \"France's Sarkozy calls for creation of international treaty on migration,\" The International\nHerald Tribune, December 11, 2006.\n\nimmigration can impact all other nations. This has been seen in the recent Spanish\nmigrations, where workers have flocked from North Africa to Spain, and then outwards\nto higher-paying EU nations. Only in the past month has the European Union addressed\ntheir southern borders, forming a 25 nation coalition to secure the Mediterranean. It\nremains to be seen whether this coalition, which calls for purely police force to keep out\nmigrants, will improve conditions.25 A clear need still exists for unified policy regarding\nimmigration and asylum declaration in the European Union. Some nations, such as\nGermany, have become exceptionally restrictive in terms of granting asylum, while\nothers, such as Great Britain, remain open. Recently, Germany has been accused of\ndirectly causing the deaths of asylum seekers by forcing them back to hostile home\nnations. Although a new human rights agency was formed to investigate such claims,26\nthe only clear solution is a unified immigration policy. A centralized doctrine would also\nhelp prevent terrorism by promoting a transparent system for immigration, rather than the\ncurrent fragmented state.\n\nImmigration Limits\nEurope must establish two limits on immigration: an internal limit that restricts job flow,\nand an external limit that only allows needed workers to enter the EU.\nInternally, the clearest need for policy reform is due to vast economic disparities\nwithin EU member states. The EU faces, however, a much more peculiar economic\nproblem than other nations. Globally, much mass immigration involves poorly educated\nworkers seeking low paying jobs. Between the US and Mexico, for example, immigrants\naverage 4-5 years less education than their American counterparts27. In the European\nUnion, however, recent problems of internal migration stem from differences in job\nopportunities, rather than purely wage-driven concerns. As Muslims are denied job\nopportunities, their positions appear to be filled by Polish workers. In Great Britain\nalone, out of 447,000 migrant worker applications from 2004-2006, 62% were Polish,\n\n25 Staff Writer. \"EU ministers back plans to curb migration flows,\" DPA German Press Agency, December\n5, 2006.\n26 Staff Writer. \"EU justice ministers reach provisional deal on new human rights agency,\" The\nInternational Herald Tribune, December 4, 2006.\n27 Smith, James P., and Barry Edmonston. The New Americas : Economic, Demographic, and Fiscal\nEffects of Immigration. Washington, D.C.: National Academy Press, 1997.\n\nmany of whom have similar educational backgrounds to British citizens.28 As a result,\nPoland is desperate for workers, a situation which can best be described as resulting from\n'a mismatch between jobs and workers.'29 With a boom in service workers and few\nemployers, Polish service workers are quickly flocking to other member states, leaving\nPoland critically short of workers. By some estimates, the Polish economy could easily\naccommodate an additional 150,000 workers.30 This problem has hampered Turkish\nentrance into the EU and complicated relations with Baltic States, where this problem\npersists. In the last months, however, a solution has been proposed that would grant\ntemporary worker status to Polish citizens and increase enforcement of non-\ndiscrimination laws. After a few years, or the end of an employment contract, Polish\nworkers would have to return to Poland. This solution should be adopted on a wider\nscale in the European Union in targeted economies that face the clearest difficulties.\nWidespread adoption would encourage employers to hire Muslims and would decrease\ninternal economic disparities.\n\nInternal restriction may be an easy task, however, compared to the difficulty of\nrestricting external migration. Europe cannot afford to simply close their borders, as\nsome extremist candidates are advocating, due to declining birth rates across the EU and\nan aging population. The UN estimates that by 2050, the population of Europe will\nactually decrease by 10%, with analysts asserting that \"migration is really going to be\nnecessary...to maintain a normal population level in Europe.\"31 There is currently only\none policy being legitimately considered for adoption across states - a quota-based\nimmigration system. States would establish caps on the number of workers they wish to\nallow in, specifying educational background and prohibiting the entrance of lesser-\neducated migrants. Recent political developments suggest that such a policy will soon be\nenacted, with African countries in favor of restrictions. Countries such as Libya\nexperience the worst problems, as migrants travel through Libya to reach Europe. \"We\nhave an estimated 2.0 million illegal migrants living in the midst of about five million\n\n28 Great Britain. Home Office. Department for Work and Pensions Accession Monitoring Report, May\n2004-June 2006. Published August 22, 2006.\n29 Dempsey, Judy. \"Polish Labor Is Scarce as Workers Go West.\" The New York Times November 19,\n2006.\n30 Lucas, Ryan. \"Poland wrestles with manual labor shortage as workers head west.\" Associated Press,\nNovember 30, 2006.\n31 Staff Writer. \"Immigration fails to stem European population loss,\" Associated Press, August 17, 2006.\n\npeople. That illegal migrant presence is a threat to our social fabric and a cause of rising\ncrime and diseases,\" described the Libyan Foreign Minister.32 The EU must be careful,\nhowever, to avoid 'brain drain' problems that have plagued immigration elsewhere. By\nselecting only well-educated immigrants, Europe is likely to stifle the growth of African\nnations unless workers are require to return after a few years of employment. Such a\nsystem would be beneficial to both Africa and the EU, since the EU would gain needed\nemployment, while Africa would eventually have more experienced workers. European\nstates must promote such as system where \"programmes...foster mobility and temporary\nreturn of members of the diasporas with the necessary skills in their countries of origin, in\norder to contribute to capacity building.\"33 The EU should also resume talks on an\nAfrican development fund that calls for a largeAfrican investment campaign.34\n\nThe Future\nA unified policy will help EU member states prevent internal migrations while easing the\ntransition of Muslims into the European community. In weighing their policy options,\nhowever, Europe must be mindful of cultural identities and must balance complete\nrestriction with open borders. In trying to prevent terrorism, Europe must be reminded of\nthe difference between integration and assimilation. Britain is already on the brink of\nassimilation - according to the European Commission for Racial Equality - despite\nhistoric warnings from the Home Office that immigration policy should not result in \"a\nflattening process of assimilation,\" but rather \"equal opportunity accompanied by cultural\ndiversity.\"35 Tony Blair was recently criticized following his failed advocacy for\noutlawing head scarves, warning that Islam distorted British values and \"has thrown into\nsharp relief the nature of what we have called, with approval, multicultural Britain.\"36\nFrance, too, has wrongly chosen assimilation over integration in their ban on head\nscarves. Nations must realize that in the struggle to protect their own cultural identities\nand national security, the cultural identities of migrant groups must also be respected.\n\n32 Sarrar, Salah. \"EU, Africa seek ways to cut illegal migration,\" Reuters, November 22, 2006.\n33 Staff Writer. \"EU, Africa talk migration and brain drain,\" EurActiv, November 26, 2006.\n34 Staff Writer. \"EU backs away from migration fund,\" BBC News, November 23, 2006.\n35 Cowell, Alan. \"Islamic Schools Test Ideal of Integration in Britain,\" The New York Times, October 15,\n2006.\n36 Stringer, David. \"Blair sees immigrant duty to accept British values,\" Associated Press, December 9,\n2006."
    },
    {
      "category": "Resource",
      "title": "research_paper.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-221-the-places-of-migration-in-united-states-history-fall-2006/d12c85ffaf7ae225e8d751ef65e7ff48_research_paper.pdf",
      "content": "The Places of Migration in United States History\n21H.221 Fall 2006\nResearch Paper Assignment\nThe Places of Migration in United States History\n21H.221 Fall 2006\n\nRESEARCH PAPER ASSIGNMENT\n\nThis paper is designed to give you a chance to examine a topic of interest to you that also intersects with\nthe focus of our class on the history of migration to, from, and within the modern United States. You\nmight choose to go into greater depth on a subject that the class covers: how did ideas about public health\naffect the living and working conditions of immigrants? You can research a single moment in time, say\nthe passage of immigration restriction laws in 1924, or explore a theme over a long period of time: what\nhave been the differences between male and female migrants and their patterns of work and return\nmigration? How can current policy debates over immigration be placed in historical perspective? You\nmight pick a particular place that you'd like to study in depth: your hometown, or a city that you know\nwell. Or you can focus your paper around the experiences of a particular ethnic group, including ones that\nwe have not read about in depth. Or you might explore a topic that our class doesn't cover at all, including\nmigrations that we might not immediately consider as part of this class: postwar suburbanization,\nAppalachian migration to midwestern cities during World War II, movements of gays and lesbians to\nurban enclaves in the 1960s, expatriate American jazz musicians in France, Depression-era migrations\nfrom Oklahoma to California. Remember as well that history include more than politics, law, and\neconomics, even if those are the focus of this class. You might choose to explore the photographs of\nJacob Riis, the ballads of Americo Paredes, or the comedy of Margaret Cho.\n\nBeginning with some background reading, emails, and conversations, you should develop a base of\nprimary documents from the past broad enough to make substantial historical claims, but not so broad that\nyou could write a book. In eleven to fourteen pages, present your argument and support it with close\nanalysis of the documents. Although this is a research paper, the focus is fundamentally on your analysis\nand interpretation of the significance of past events, rather than your ability merely to document what\nhappened. You will be evaluated in terms of the coherence of the argument, the effectiveness of your use\nof primary evidence to support your argument, and the depth and originality of the analysis you present.\n\nThis is not the kind of paper that you can write in one night, and so the requirements for the paper are set\nup to prevent that from happening. By Tuesday October 24th, you should email me at least some sense\nof what you think your topic might be. I will respond by email or in a meeting with you to give you some\nguidance. This is also the time to do background research. By this I mean textbooks, general histories, and\n\nThe Places of Migration in United States History\n21H.221 Fall 2006\nResearch Paper Assignment\nencyclopedias, rather than desultory Google searches. At this point, it's best to be general and broad, and\nto keep more than one option open, in case good material on your topic is not available. Leave time for\ndead-ends and changing your mind.\n\nOn Thursday November 9th, you should hand in a research prospectus--a brief description of your\npaper that describes the primary source material that you will use and the questions that you think your\npaper will answer. This is required, and counts for 5% of your final grade. You don't have to have a\nthesis statement, an opening paragraph, or an outline, but you might find it useful to draft something to\ngive me (and you!) a sense of where you are headed. I will read it with an eye to whether the source\nmaterial you've found can help you address those questions and vice versa, and to give you more\nsuggestions about research possibilities.\n\nI'm happy to read drafts of the papers and give you general feedback on your research and argument. But\nin order for that feedback to be useful, it's important to receive those drafts early, by Tuesday November\n28th. This is not required, and does not guarantee that you will get a better grade on the final essay. Do\nit only if you want the feedback and are in a position to be able to take advantage of it.\n\nThe final paper is due at the beginning of class on Tuesday December 12. Bring your papers with you;\nwe'll spend part of the time talking about them. I encourage you to work with a peer editor or a writing\ncenter staff member on a draft during the last couple of days.\n\nReference Librarians. These folks are very helpful, particularly with such issues as identifying on-line\nsources, working with microfilm and microfiche, or navigating secondary research. You can always walk\nup to the reference librarian at the desk (during hours when it is staffed), but it may be a better idea to set\nup an appointment in advance.\n\nCitations. Please be careful to cite the sources of information and ideas that you use in your paper, both\nprimary and secondary. Carefully consider questions of authorship and authority before using materials\nyou find on the web. You may use any of the standard methods of citation (footnotes, endnotes,\nparenthetical references, etc.), as long as you are complete and consistent. The MIT Libraries website has\nlinks to online editions of all the major style guides. Be sure to leave enough time to prepare your\ncitations in the proper format.\n\nPS: In the words of Ben and Jerry, if it's not fun, why do it?"
    },
    {
      "category": "Resource",
      "title": "short_essay.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-221-the-places-of-migration-in-united-states-history-fall-2006/95ba6615f31fd7272543d2edcde96614_short_essay.pdf",
      "content": "The Places of Migration in US History\n\n21H.221 Fall 2006\n\nFirst Essay Assignment\n\nWrite a 3-5 page essay on one of the following questions. You should bring the essay with you\nto class on Thursday September 28.\n\n1. Was the Bread and Roses strike a success or a failure? Be sure to define your terms. Don't just\nlook them up in the dictionary; come up definitions that are meaningful to you as someone\nanalyzing the past, and that would take into account the expectations of people at the time.\n\n2. Was San Francisco's Chinatown a space of community or confinement?\n\n3. Both Bruce Watson and Nayan Shah are concerned with the \"agency\" (which we might define\nas \"the means and ability of exerting power or influence over a situation\") of immigrant workers\nat the turn of the century, and they have uncovered it in both familiar and unfamiliar places.\nChoosing examples from both Lawrence and Chinatown, write an essay in which you critically\nevaluate the political agency of immigrant workers.\n\n4. Design your own essay topic. If there is a particular question that has been nagging you and\nthat you would like to think through in a sustained way, talk to me about it and we'll craft an\nessay question around this theme.\n\nWhatever you do, be clear in your view on the theme you choose, state it clearly in the opening\nparagraph, and use specific evidence or direct quotations from the original works to demonstrate\nyour points. (The assigned readings for this course should be sufficient for building a good\nargument.) The paper should be double-spaced with standard margins; extensions will be granted\nonly for good reasons explained well in advance. Proper academic citation is required, but you\nmay use whichever standard style you know best. Adherence to standards of academic honesty is\nrequired; if you have any questions about how to go about your writing or cite your sources,\ndon't hesitate to ask."
    },
    {
      "category": "Resource",
      "title": "ses10_great_mig.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-221-the-places-of-migration-in-united-states-history-fall-2006/0d22d7a04fc6fcf3f0b9509ed873c6db_ses10_great_mig.pdf",
      "content": "21H.221 (Fall 2006), Places of Migration in U.S. History\nProf. Christopher Capozzola\nSession 10: Was the Great Migration Great? lecture\n\nToday: Nicholas Lemann's The Promised Land: The Great Black Migration and How It\nChanged America\n\nRelated article: Granddaddy of all ghettos faces wrecking ball (CNN)\nhttp://edition.cnn.com/2006/US/10/08/taylor.homes.ap/index.html?section=cnn_topstories\n\nNext week: Immigrants and the movies - immigrants making them, acting in them,\nmovies about them.\n\nThe paper: Resources such as http://libraries.mit.edu/guides/subjects/history/\n\nAs you get into Lemann's The Promised Land, it's a mesmerizing, amazing story that the\nauthor has put together. He's a journalist trained as a historian, so he knows what he's\ndoing as he's doing interviews with people. And he's found an amazing group of people,\nfrom very ordinary people to policy makers. I'd like to focus on the story of Ruby Daniels,\nthe first part of the book.\n\nRuby Daniels is a human being - a real person - and she does in fact exist and was\ninterviewed many times by the author. During his first interview with her, towards the end\nof his 12 year research, he thought she wasn't that interesting personally. She called him\nback asking for another interview, saying he'd asked all the wrong questions, and she\nproceeded to tell her life story.\n\nTo our mass media public debates, people like Ruby are cartoon characters. She lived what\nfor many people are stereotypes for black urban poverty - many husbands, many children,\nunmarried, on welfare, in public housing, lying to social services people. And these are\nimages we're constantly bombarded with. Focus on her life story.\n\nThe second part of the book is a policy history of Washington and the war of poverty.\n\nRuby's ex and one of her kids sued Lemann for misrepresenting them, for slander. The case\nwas thrown out because they had in fact done those things and didn't have much of a case.\n\nThe book was very controversial when it came out - this has to do with how to explain\nRuby's situation. Lemann doesn't fit easily into the standard categories of politics, of liberal\nor conservative. He leans more to liberal side but isn't an orthodox guy. He and his book\nwere attacked from both sides.\n\nSuburbanization is the related flipside of urban poverty.\n\nThe south has a cash-crop dependent economy whose laborers are landless - white tenant\nfarmers or black tenant farmers. African Americans are more commonly sharecroppers than\ntenants. Economic exploitation with political disenfranchisement - by the 1910s,\nthere are almost no meaningful numbers of black voters anywhere in the south. Other\npolitical rights such as jury service, protection of courts or by police are limited.\nSomewhere around the 1910s, things start to shift and the numbers of people leaving the\nsouth are dramatic. About 500,000 blacks leave the south between 1910-1920, most of\n\nwhom leave during WWI. If you want to talk about push and pull factors, you can imagine\nwhat those are: Push factors are both economic and political. If this system was in place in\nthe late 1800s, why then is it that only after 1910 that the blacks leave? The push and\npull factors create this migratory moment.\n\nPUSH\n\nEconomic - volatility in cotton markets\nPolitical - disenfranchisement and violence\n\nAs these numbers go up and down, the situation becomes more precarious. But the pull\nfactors are those that really determine what's going on:\n\nHere's where the story of other immigrant groups intersect with this.\n\nWhat do we know about the immigrants coming from Europe at this time?\n\nPULL\n\nEconomic - European immigration ends effectively in 1914 (in law 1921, 1924)\nSuddenly there's no new supply of immigrants. The wartime economic boom increases\ndemand for labor in factories in urban Northeast (copper for bullets, textiles for uniforms,\nmunitions). American economy is in wartime footing in 1915 even if not in the war. The\nlabor shortage is extended to 1917 by conscription - men were brought into army, out of\nlabor force. These pressures make it possible for African Americans to find jobs in the\nnorth. (Consider the factories in Lawrence, MA, for example - in practice, they were closed\nto African American workers before the war. For factories like that, the war created these\ndemands that made them open up.)\n\nSharecropping is a cash poor economy - the system develops as it does because no one\n(not even the landowners) has much money. People are paid in shares of the crop. Real\nbasic question: how did people get to places like Chicago in the 1910s when they didn't\nhave the money?\n\nConscription applies to African American men - who are disproportionately drafted out of\nthe rural south. In order to prevent dislocating American families, any soldier with a\ndependent had his pay cut in half - half went directly to his dependent as cash. This was\ndesigned to keep soldiers from abandoning their families and to prevent starvation of\nfamilies or soldiers drinking away their pay. In practice in the poorest parts of America, it\nprovides a cash influx - even though not great, $8/month. (A train ticket during WWI\nfrom rural south to Chicago was about $3.) By taking a train trip several hours away your\nincome could quadruple. (The story in the book: Carter goes to Chicago on vacation,\nsomeone offers him a job, he stays.)\n\nWe don't want to underestimate the political and social factors in this, and the\nextent to which people were fleeing a regime of terror under which they were\nliving and headed for a system that was more open, not equal by any means, but\npolitically more open for participation that made possible voting, political voice,\nand where everyday life was less rigidly structured than the south.\n\nBut the economic factors, both individual decisions about family and big economic\nforces people can't control, are driving this south to north migration.\n\n21H.221 (Fall 2006), Places of Migration in U.S. History\nSession 10\nProf. Christopher Capozzola\n\nPage 2 of 5\n\nPeople found out about migration opportunities through information networks of previous\nmigrants and return visits to their families. It's more like the people going back and forth in\nthe Caribbean than transatlantic migrations.\n\nThey're also learning about it as people and news are traveling back and forth on the\nrailroad. The Chicago Defender was the biggest newspaper of the African American\ncommunity in the country; it circulated outside too, carried on railroads by agents of\nmigration. Railroads segregated, but African Americans can get porter jobs - distribute\nChicago Defender in secret. The federal government sees what the white landowners see -\nthe war is disrupting/dislocating our economy, our way of life. All the black people\nare running out of the town in the middle of the night - German saboteurs must be stirring\nthings up in a secret conspiracy to undermine the production of the cotton crop.\nConspiracy is an easy way to explain complicated things, especially if you've been raised to\ndiscount that blacks could make rational economic choices in the marketplace. It doesn't\noccur to William Percy (a landowner in Mississippi) - he feels his workers have betrayed him\nby leaving, he the generous landowner - it doesn't occur to him to do the math that the\nwages are much higher in Chicago.\n\nTo replace the labor, what do the white landowners do?\n1. They complain\n2. They raise as much cotton as they can (supplies slightly reduce, prices go up)\n3. They conscript labor (Work or Fight Laws - municipal and state level all around the\ncountry - any able bodied man not in the army has to demonstrate he has a job and\nif not he'll be given one). The rural south didn't have state prisons and so convicts\nwere contracted out to landowners as convict labor. In some areas in Mississippi,\nAlabama, Georgia, and Florida too, work or fight laws were applied to both male and\nfemale black residents and so a black woman who obviously wouldn't be conscripted\ncould nevertheless find herself under the same terms. We don't have exact\nnumbers, but it was not an insignificant number. Work or fight laws had media\nexposes. They were widely condemned - even by white labor unions. They were\npretty quickly dismantled but other forms of coercion still existed.\n\nLook at Jack Temple Kirby article, \"The Southern Exodus: A Primer for Historians.\" He puts\nthese migrations in a broader perspective - 7 million people white and black leave the south\nduring this time, larger than any other migration of any particular group we're looking\nat it. He makes the argument that the economic and social factors pushing blacks and\nwhites out of the south are more alike than different - an interesting addition to the\nargument. Poor white sharecroppers are facing these same questions.\n\n500,000 blacks are leaving, going to cities - people moved along migration lines. You'd\nhave small, fragile, largely African American communities that already existed in the cities\nthat are now inundated with large numbers of migrants during the challenging time of the\nwar when there was a lot of economic dislocation going on. Also, the neighborhood\nboundaries were being scrutinized by white people so the neighborhood doesn't get any\nbigger.\n\nIn these black communities, tensions emerge between middle and working class blacks over\ncommunity institutions, everyday life, politics, and religion. The way that two different\nhistorians interpreted this...\n\nIf you read various newspapers, church publications, and even in the Chicago Defender,\nduring time of Great Migration, you'll find advice columns written by northern blacks for\nthe new arrivals - trying to get them to give up their rural southern ways (e.g. don't wear\n21H.221 (Fall 2006), Places of Migration in U.S. History\nSession 10\nProf. Christopher Capozzola\n\nPage 3 of 5\n\nhead scarves, no pajamas outside, don't talk too loudly, don't spit on the street). In some\nways people have said these are lot like the columns in immigrant newspapers (e.g. stop\nbeing greenhorns). Contemporary example: immihelp.com run by South Asian immigrants\nfor South Asian immigrants, a list of should and shouldn't in the US, encouraging them to\nact more middle class, dealing with culture codes, etc. Reading these advice columns,\npeople had different reactions.\n\n-\nA line of interpretation from historian Robin Kelley - infrapolitics:\nIt was a world where African Americans didn't have public voice, where their jobs\nweren't key to social mobility, where their votes didn't really count. You couldn't go to\nformal politics to get black politics - you have look to infrapolitics. Everyday interactions\non the streets and breaking cultural codes were deeply political moves not only against\nthe white elite but also against the middle class blacks who tried to tell them what to do.\nThey took advantage of this leisure in large black communities and this was political - a\nchallenge to political order that voting and organizing was never going to get for black\npeople.\n\n-\nContrary line of interpretation by Evelyn Higginbotham - politics of respectability:\nBlack churchwomen in the south in the early 1900s - this group of women might\nculturally seem middle class but certainly were not economically; they were some of the\npoorest in the country. They turned to a politics of respectability - in a world that\nexpected black people to be rude, not to obey the work habits of industrial capitalism or\nthe cultural codes of middle class life. This is particularly true of black women who were\nrepresented in such stereotypical fashion, often seen as sexually disordered. They\nreacted to these stereotypes by being proper, by being respectable; they were\nundermining expectations in more subversive ways than infrapolitics, which\nHigginbotham thought was a no-win strategy because it confirmed the stereotypes. The\npolitics of respectability was more subversive than anyone could imagine. But it plays\nout differently when you move north because meanings of the cultural codes change.\nFor example, in the south politeness from a black man toward a white woman on a\nstreetcar could be perceived as flirting - and this could have consequences. Habitual\nrudeness could be safer. Dressing formally could be labeled as uppity. But once you get\nto Chicago, rules change - politeness and stylish dressing and other cultural codes\nchange.\n\nHigginbotham argues that it's wrong to call it a middle class sensibility. Kelley would say\nthat this isn't consciously political - everything is political and plays out in a much wider\nrealm than we can imagine.\n\nKelley was looking back at the way historians had looked at Jim Crow at the turn of the\ncentury - how they were terrorized and silenced in a society of mass rural poverty.\nHistorians were trying to figure out why is there no response - could blacks have organized\nthese political parties? Why weren't they more political? Why did it take until the civil\nrights movement? Kelley wants to say those are all the wrong questions; there was politics\ngoing on - over things like identity, dignity, ability to control bodily presentation -\nand these were the things blacks had power over. Kelley is insistent that he is not providing\na prescription for the present.\n\nWhy do people move to suburbs?\n\nStudent responses:\n-\nthe American dream\n21H.221 (Fall 2006), Places of Migration in U.S. History\nSession 10\nProf. Christopher Capozzola\n\nPage 4 of 5\n\n-\nperceptions of city life not present in suburbs - more crime, violence - want more\nidyllic environment for raising children\n-\ntake what you like about an urban society and take it with you to somewhere you\nlike more space, interaction with people\n-\ntheir own town, more control over your private space\n-\nmore community in suburbs\n\nThe first models of the suburbanization: jobs and business continued in the center and\npeople spread out. This occurred in the 1940s/50s. From the 1970s onward, jobs also leave\ncities.\n\nThe radical separation of work, shopping, living; life is car-dependent - this is the modern\nidea of suburbs. Early suburbs could be mass transit oriented, street-car oriented, like\nWatertown, West Roxbury, Chicago, and the boroughs of New York City. Definitions have\nchanged. Where we are now is probably further from Levittown than Levittown was from the\ncities of before.\n\nYour answers get at questions of push and pull. Some of the structural issues that have\nto do with federal policies and expenditures and other laws have not caused\nsuburbanization but made it take on the forms that it does. Link that to other\ndevelopments in the same time period of the 1940s/50s that lead to the construction of\nmassive concentrated urban ghettos.\n\nRobert Taylor homes - the largest housing project, 28 16-story towers in Chicago built\nright after the war. They were seen as the greatest triumph, but when they were destroyed\nthey were seen as the worst disasters. They've been characterized by Lemann as one of the\nworst places on earth to live.\n\nSee the Chicago Housing Authority's website on the redevelopment project:\nhttp://www.thecha.org/housingdev/robert_taylor.html\n\nFor next time, think about: Why do people move to the suburbs? Why do people move into\nthe Robert Taylor homes, the two big urban housing projects?\n\nAnother example is Columbia Point in Boston. These are common in almost every big urban\ncity. In the last 10-15 years, almost all major cities have been thinking about what to do\nwith this housing.\n\nThere's housing like this in New York City, but a lot of what looks like big housing projects\nare much more mixed use, such as housing for elderly people. The costs of replacing these\nprojects are so astronomical in the US that it's just not possible - there's a lot more empty\nland than there is in NY. The consensus now is that smaller lower level mixed use housing\nis more effective, but that takes up more space and houses fewer people.\n21H.221 (Fall 2006), Places of Migration in U.S. History\nSession 10\nProf. Christopher Capozzola\n\nPage 5 of 5"
    },
    {
      "category": "Resource",
      "title": "ses11_great_mig2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-221-the-places-of-migration-in-united-states-history-fall-2006/fbcb511ca4ef118d805b303b6fffa11d_ses11_great_mig2.pdf",
      "content": "21H.221 (Fall 2006), Places of Migration in U.S. History\nProf. Christopher Capozzola\nSession 11: Discussion about the Great Migration\n\nIn the news today: The U.S. population has now surpassed 300 million. People are living\nlonger. Immigrants have higher birth rates in the US. But 300 million is an arbitrary\nnumber because there are probably more than that number on any given day, but it does\nelicit a moment of reflection.\n\nHarvard's Open Collections Program: Immigration to the United States, 1789-1930\nThe Social Museum has many many digitized photographs that document social conditions\nin cities and rural areas mostly having to do with immigration and poverty and public\nhealth. By documenting this visual data they attempt to show what was going on. It's\navailable here:\nhttp://ocp.hul.harvard.edu/immigration/\n\nAt the turn of the century, in 1911, Congress debated restricting immigration. They\nsponsored a study, the Dillingham Commission. It produced 41 volumes of statistics,\nanecdotes, testimony documenting the state of immigration of 1910. Stanford scanned in\nthe entire book page by page! It's available here:\nhttp://library.stanford.edu/depts/dlp/ebrary/dillingham/body.shtml\n\nFinish up discussion from last time: We come back to question of the debate between\ninfrapolitics and the politics of respectability. I want to emphasize you can have this\ndebate with almost any immigrant group. They are often battles between new immigrants\nand the more Americanized ones, battles over class as well. Many of the debates are about\ntradition - maintaining cultural tradition, e.g. modernizing/making more American food\ntraditions.\n\nimmihelp.com - \"from an immigrant to future immigrants\"\nResources for immigrants, made by South Asian immigrants mostly used by Indian\nimmigrants, topics for newcomers\n\nDebates within communities of immigrants - when people talk about how to adjust to a\nnew culture, they're talking about a lot of things, adjusting to class, new work situations\n\nPhotographs: Robert Taylor Homes.\n\nChicago Housing Authority's redevelopment project:\nhttp://www.thecha.org/housingdev/robert_taylor.html\n\nMayor Richard J. Daley's speech at the opening of the Robert Taylor Homes in 1962:\nhttp://www.encyclopedia.chicagohistory.org/pages/410107.html\n\nWhen they were constructed, the Robert Taylor Homes were the largest housing project in\nthe world, with 28 towers, 16 floors each.\n\nRobert Taylor was the first black housing officer in Chicago, trained as an architect at MIT.\n\nHow much faith do you place in architecture and environment as ways of shaping\nbehavior? There's an argument for them - planners will say that, in smaller places like\n\nthis, the people who live there have liked them better, have taken care of them (sense of\nownership); walking down streets is safer.\n\nRobert Taylor homes replaced smaller buildings, substandard in quality, overcrowded, often\nwithout modern conveniences like elevators and hot running water.\n\nWhy did the Taylor homes decline in quality? Part of it is how they were maintained, part of\nit is about the resources to maintain it. The late 1960s/early 1970s was a hard time for\ncities all across America - economic trouble, losing industries.\n\nNow we'll move into the history of suburbanization and the history of development of\nconcentrated urban ghettos in the same time period in these two decades around\nWWII...\n\n1939 - A federal planner gave testimony before Congress about suburbanization\n(\"decentralization\"). His argument was that it was taking inevitably place - it's not a\npolicy, but a reality. It's impossible to change this trend, and he likened it to the desire of\nbirds to migrate to a more suitable location. He emphasized the inevitability and insisted\nit wasn't due to federal government policy.\n\nToday we have the counter argument - that it's very specifically about policies, how\nthey made suburbs possible and accelerated their growth. They didn't cause them; in some\nways suburbs would have happened anyway mostly because of the ways that American\ncities govern themselves and the availability of cheap land in the US. This is compared to\nEuropean cities where there are more expensive, economic incentives to suburbanization.\nBut the policy does map - it made suburbanization look as if they were inevitable:\n\n1. Automobiles\n\nThe development of cars and the ways in which Americans become increasingly car-\ndependent right after WWII is critical. Car ownership expanded dramatically in the\n1920s with Ford's Model T and the Sloan factory. There was some increase in car ownership\nand use, but it's temporary - the Depression slowed things down. When people live in\ncities, they tend not to use cars as much/often. Only after WWII, you'd see people using\ncars everyday for their commute, start to see multiple cars in single households.\n\nThe invention of station wagon came in the 1940s. Why \"station\"? At the time, you only\nhad one car per household, and the wife would drive the husband to the [commuter rail]\nstation to take the train; then she'd take the kids around in the wagon. Over time as work\npatterns changed, it's less likely that people take trains to the city - so the number of cars\nper household increases.\n\nSome of this is economic:\n-\nautomobiles are getting cheaper as mass production techniques are developing\nparticularly after WWII when big 3 manufacturers are reaping enormous gains\n-\nfuel costs decreasing\n\nBut there are also policy issues:\n\n-\nFederal Highway Act (1916). This was the first federal effort to build roads. It\nwas mostly in the planning stages in the 1920s. What finally resulted was the US\nHighways (e.g. US 1, Route 66). A lot of money was pumped into those roads during the\n1930s, during the Depression, when Roosevelt wanted the economy to get going again\n21H.221 (Fall 2006), Places of Migration in U.S. History\nSession 11\nProf. Christopher Capozzola\n\nPage 2 of 6\n\nbut didn't want to hand out money - so the government hired lots of people to build\nroads.\n-\nInterstate Highway Act (1956) - This replaces the older system (e.g. I-90). This\npolicy was designed specifically with decentralization in mind; it made it possible for\npeople to live in the suburbs. (There's the popular idea that interstates were built as\nCold War defense measures, being wide enough for B52 bombers to land - but this isn't\ntrue.) But one of the ideas was that decentralization would be a good thing to pursue in\na nuclear era and suburbanization was thought of as a means of finding some sort of\nsurvivability during nuclear war. There was increasing demand from all around the\ncountry for more roads - the interstate highway system was the largest building project\never undertaken in human history, if you take in physical size, number of wokers,\nmoney spent. If you could count individual construction projects, the largest is the Big\nDig (particularly if you count costs, cost overruns). So we were pouring lots of money to\nget people to drive away/around highways. Money for roads increased, and money\nfor federal efforts for building public transportation systems decreased.\n\nIn 1950, what American city had the best street car transportation? Los Angeles! It was\ndismantled over the course of 1950s and replaced by freeways, which were touted as being\nfast, efficient, more modern, more convenient. But it's hard to think that when you're stuck\nin traffic jam at 3:00am for no reason! The system now is not what was imagined in the\n1950s/60s. Street cars were either folded into other systems, remain as quaint relics, or\nbecame commuter rail systems. But street cars had pretty low fares - a nickel - but\nridership went down. So the companies increased rates which then, in turn, sent ridership\ndown again. The number of forces acting against street cars was too many. It wasn't just\nspending more on roads, but deliberately spending less on street cars.\n\n2. Mortgages\n\nThere was a transformation in mortgages and mortgage policy. Before 1930 or so,\ndown payment was half to two-thirds of the total cost and then you could borrow the rest\non a 5-10 year mortgage. Houses tended to cost a little less as a percentage of income as\nthey do now. But many people would live their entire lives as renters. Part of what turns\nthe tide is Great Depression - 30% own houses at the beginning of the Depression, and\nvery quickly, those who still owe money on their houses go to default. By 1933, half of all\nhomes were technically in default and the banks could have claimed them if they wanted\nto/had the means to.\n\nThe Roosevelt administration established the Homeowners Loan Corporation (HOLC) in\n1933 which was then supplemented a year later with the Federal Housing\nAdministration (FHA), which was designed to protect homeowners from losing houses,\nprotect banks from losing loans, protect construction industry from going out of business.\nBetween 1929 and 1933, the home construction business virtually disappears. So they\ncreate a mortgage insurance procedure that insures mortgages from banks, allowing\npeople to borrow lots of money.\n\nThere are changes in the average term of a mortgage - it goes from 5 to 25-30 years.\n-\nReduced down payment (10%)\n-\nSelf-amortizing - the opposite of which is one with a balloon payment (you pay\ninterest along the way and at the end, you pay the loan but if you don't have enough\nmoney to pay off the loan, then the house is foreclosed). Rates of foreclosure were\nhigh, so many didn't see reason to buy houses.\n\n21H.221 (Fall 2006), Places of Migration in U.S. History\nSession 11\nProf. Christopher Capozzola\n\nPage 3 of 6\n\n1944 - Servicemen's Readjustment Act (\"GI Bill\") establishes the Veterans'\nAssociation. The government guarantees to banks a form of insurance on the loans; if\npeople default, the government will pick up the slack. So banks are more willing to loan\nmore, eventually at lower rates.\n\nThis combines with the fact that right after WWII there was demand for housing. There\nwasn't much construction in the 1930s (nothing to build with). Right after war, there was a\nbig demand for cheap housing.\n\nPolicies of how these loans are given force people to suburbs. FHA loans had standards:\nparticular size, set back from street, separated from adjacent building. By the late 1940s, it\nwas cheaper to buy something than to rent it. With massive construction in the suburbs,\nnew mortgage policies, decreasing interest rates, there was no incentive to fix up places\nwhere they were already living.\n\n3. Racial Segregation\n\nThe policies of racial segregation: the FHA and HOLC work together to create a system\ncalled redlining. As federal agencies figure out where they will/won't give loans, they map\nout cities, create rankings for 1st grade to 4th grade according to the condition of the\nhousing stock, safety, desire to live in neighborhood, whether it's residential or mixed in\nwith other uses (e.g. a factory next door). Those ratings preferred individual free standing\nhouses with lawns, etc. Declining neighborhoods were those that weren't ethnically\nhomogenous. They liked \"American business and professional men\". They were unwilling to\nloan in 4th grade areas. It's pretty clear that the FHA and HOLC are actively sharing this\ninformation with banks; evidence from the archives is pretty clear that the banks are using\nthis exact same information with what they'll do. (4th grade neighborhoods were marked\nwith red - hence, redlining.)\n\nDetroit, Michigan - big industrial city with all different kinds of ethnic groups needed to\nwork in factories during the war. One particular neighborhood as it was mapped out was\nconsidered declining because it was too ethnically heterogeneous - a mix of whites and\nblacks made it seem \"unhealthy.\" One enterprising developer discovered that on one side of\na particular road, the majority of people were white; on the other side of the road, black.\nHe convinced officials to rotate mapping by 90 degrees and to build a wall to separate one\nside of the neighborhood from the other. FHA comes in and remaps it; so now, instead of\ndenying to loans to everyone, 3rd grade and 4th grade areas are mapped out, so half of the\npeople (those in the 3rd grade area, the white area) get loans. What road is this? 8 mile\nroad - it divided the city from the suburbs by literally walling off neighborhoods.\n\nOver time, the people who are living in 4th grade neighborhoods can't get loans to purchase\nwhat is there or to fix it up. The housing stock is declining. There are specific incentives for\nthose leaving these neighborhoods and moving into suburbs (mostly white). The suburbs\nare governed by restricted covenants (e.g. \"the person to buy house must be\nwhite/Christian\"). In 1948, this was legally overturned but continued in practice as informal\nways of discrimination.\n\nThese are the forces acting towards suburbanization. There's also a series of forces to\nconcentrate people in urban ghettos...\n\n4. Urban \"ghettos\"\n\n21H.221 (Fall 2006), Places of Migration in U.S. History\nSession 11\nProf. Christopher Capozzola\n\nPage 4 of 6\n\nThink about the \"ghetto\" as the same way we think about Chinatown - the word maps a\nplace for us, but it also maps the people who live there - there's an understanding of who\nthey are racially but there's also a whole other set of cultural codes associated with that\nmapping.\n\nThe Federal Housing Act of 1949 says we'll pump lots of federal money to the\nconstruction of public housing to any community in America that asks for it. Cities are\nstruggling with their housing stock and with providing housing right after WWII - a lot of\nthe housing is sub par, having not been fixed up since 1929. Cities ask for money and get\nit, but suburbs are different cities and get to decide on their own - and they pass on public\nhousing. For example, Mayor Daley got money from the federal government that he could\nhave given to Chicago - which would have benefited not only people like those in the Robert\nTaylor homes but also construction unions. White suburbs of Chicago declined the option of\ntaking federal money, so the housing projects weren't built in the suburbs where land was\ncheaper and there was more of it. This forces cities to build in more concentrated land - so\nthey end up with solution of a tower (Robert Taylor homes).\n\nThis proliferation of localized government makes big difference in terms of housing and\nschools - every individual municipality governs its own schools. 1400 Governments: The\nPolitical Economy of the New York Metropolitan Region by Robert C. Wood and Vladimir V.\nAlmendinger talks about the suburbs of New York City. He argues that it's a source of this\nvariation, making it possible for housing and schools to work out the way they do. It should\nbe governed as one city so there's the power to tax and provide social services and\nmaintenances. But with so many different governments, some are very rich and some are\nvery poor. You're taxing poor people to come up with services! We're the only\nindustrialized country that is this fragmented.\n\nIn Chicago, it isn't surreptitious after all - it's quite explicit: these housing projects respond\nto the ideas of policy makers and demands of white people in Chicago so segregation\nends up working out this way. Some of it was a response to WWII and not having enough\nhousing. Coming out of WWII, there was a giant housing crunch - people really stacked up.\nPoliticians hoped they would win votes - they're under pressure from Congress (to bring\nmoney home to their districts), from the construction industry, from highway builders, and\nfrom ordinary people - such as a) the urban poor who now have political voice in cities that\nthey didn't have in the rural south before they moved, and b) those people who want to\nmove to suburbs. Luckily, in 1949, the government is flush. They certainly are funding it.\nWhat happens in the late 1960s is that money starts to run out as the US hits recession,\nand urban areas in the northeast and midwest are hit hard - jobs disappear, taxes\ndisappear, so there's less money to maintain the city, public housing, and protect people.\nMore and more, people who can are leaving, so there's even less of a tax base. Take NYC\nsubways in 1970s - what a downward spiral it was. NYC didn't have money to pick up\ngarbage for 2 weeks. (Contemporary note: There more rats now than in 1970s because\nthere are now more people and hence more garbage.)\n\nCLASS DISCUSSION\n\nDecentralization is not a policy claim - there's this idea that it's something natural and\ninevitable.\n\nHouston - not much zoning, incentive to buy, sprawl\n\n21H.221 (Fall 2006), Places of Migration in U.S. History\nSession 11\nProf. Christopher Capozzola\n\nPage 5 of 6\n\nHouses are now 40% larger than in 1950s. Part of it is that suburbs now are changing.\nFarmingville is where everybody moved in 1949. As even more suburbs are developing\nand sprawling, Farmingville had sidewalks. Now it is becoming a place where the\nimmigrants are moving. It's not in the interest of the suburban government to consolidate\nbecause they give up some autonomy and control. Municipal services are increasingly\nprivatized - e.g. garbage collection, security. We see this in Atlanta - the most sprawling\ncity in America.\n\nImmigrants commute by bus into the city and then have to get back at 1:30am - as jobs\ncontinue to leave cities, it presents challenges. The patterns are changing so quickly - at\nthe same time that downtowns are gentrifying (beginning in the 1980s) and getting\nmore expensive, patterns are moving back in ways that maintain different kinds of\ncommunities.\n\nHollow City: The Siege of San Francisco and the Crisis of American Urbanism by Rebecca\nSolnit is about how San Francisco was for years the funky place artists and liberals could\nafford to live and now it's out of [financial] reach for these people.\n\n\"Californication\" - the phenomenon of other states being overwhelmed by Californian\nmigrants who couldn't get what they wanted in California.\n\n21H.221 (Fall 2006), Places of Migration in U.S. History\nSession 11\nProf. Christopher Capozzola\n\nPage 6 of 6"
    },
    {
      "category": "Resource",
      "title": "ses12_great_mig3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-221-the-places-of-migration-in-united-states-history-fall-2006/1581a3c642bceba1433b4ae8a0315212_ses12_great_mig3.pdf",
      "content": "21H.221 (Fall 2006), Places of Migration in U.S. History\nProf. Christopher Capozzola\nSession 12: Discussion of the Great Migration, The Jazz Singer screening (Part I)\n\nToday: Discussion of articles, then screening of the first half of The Jazz Singer.\n\nWhat differences do these movies make? It's a question of modernization, urbanization,\nand assimilation. The movie we'll be watching - The Jazz Singer (1927) - is very\nspecifically about Americanization and the generational struggle between the father and\nthe son. It brings the readings together.\n\nHow is it that a couple of generations later, people look back at immigration and look at\ntheir family and where their family is from?\n\nWhat happens to children of European/Asian migrants of the early 20th century - what\nhappens to them in rest of 20th century as generations move on? There was the \"ethnic\nrevival\" of the 1970s.\n\nNew York trip update: We'll take the Chinatown bus and treat it as a historical artifact.\n\nDiscussion of Lemann's book The Promised Land and Kirby's article \"The Southern Exodus.\"\n\nDoes this book fit on our syllabus?\n\nStudent: Yes, the class is about learning how people adapt when they move. It deals with a\ngroup of people moving from one place to another, even if it's across state borders; and the\nways of life in north/south are very different.\n\nWere there ideas or concepts or events from previous weeks that came to mind?\n\nStudents:\n-\nChinatown, but it was a kind of different from Chinatown because all the people\nloved it [Chicago] and didn't want to move out.\n-\nChicago wanted the black labor, while San Francisco didn't want the Chinese at all.\nChicago wanted the labor nearby, but not for living.\n\nThere are a few places in the book that you get the sense that this is the only place in\nChicago that African Americans could go. When you think about questions of exclusion, in\nmany ways the story of Chinese immigrants is about exclusion - e.g. you can't be a citizen\n(excluding from politics). The story of African Americans is about inclusion, but into a\nhierarchy - you are a citizen, but a second class citizen.\n\nWhen they moved to Chicago, was it better for the African Americans?\n\nThey were thrown into large, urban spaces - and some experience the anonymity as\nliberating, particularly African Americans. Often small town sharecropping life meant a lot\nof scrutiny from the landowners who kept a close eye. Being in Chicago offered some\nfreedom to not to be known. But as with all migrations, that can be a tension on social\nnetworks and what holds people to one another; those connections can fray. Families are\nseparated, it's hard to support. Or, in Chicago because so many are coming to a confined\n\nspace in a small time, the whole urban fabric is tested in many ways - overcrowding, jobs\nare hard to come by.\n\nThere is nothing that looked on paper like apartheid, but in practice it was the case, e.g.\nrestricted covenants. There are a few examples where integration was attempted but\nwhites who lived in those neighborhoods just absolutely refused with violence. There were\nno legal contracts, but it was the settled policy in the neighborhood. For example, the\nRobert Taylor homes were 99% black.\n\nWhite out-migration: 9 million people leave the south between 1910 and 1960. That's\nhuge, larger than any one country's migration out of Europe. Kirby suggests we have\nmissed that by thinking too much about this as a movement of people based on race, that\ntheir motivations and destinations are shaped by race. If we think of the South as a\nregion that both whites and blacks are moving out of, we start to see some new\nthings. What do we see?\n\nWhat causes these migrations is economic dislocation rather than racism, that racism is\nthe context in which all of this is taking place but the economic forces of industrialization,\nsouthern agriculture, changes in factory work (e.g. textile industry in North Carolina, coal\nmines in West Virginia and Kentucky) push enormous numbers of people out of the south.\nThey are being pushed for the same kinds of reasons out of the south that they are\nbeing pulled to the north. The same factories that are hiring African Americans after\nWWII are hiring white workers in the big cities. So historians who have told the story of the\nGreat Migration as one primarily about \"the promised land,\" the story about black people's\nmovements from the south to the north, have missed this. Evaluate that against the life\nstory and people in The Promised Land. Why did they move?\n\nStudents:\n-\nThe economic pull of Chicago was a lot stronger than the push of Jim Crow.\n-\nHope that they could change their way of life, not only the economic part of it but\nalso the way they were treated.\n-\nWhen they would come back they'd have their fancy stuff to show off\n-\nPush out of the south much stronger with advent of automated cotton picker because\ndemand for black labor diminished - send them to the north so the blacks are no\nlonger their problem\n\nIt's a mix of motivations. Word does get back about both good and bad things.\n\nThe book opens with the mechanical cotton picker - suggesting that technological changes\nand economic forces are driving these events. But later on, p. 49, plantation manager\nwrites about mechanical cotton picker.\n\nEconomic relocation and technological change were perhaps responses to migrations. But\nmigrations were undertaken for a whole host of reasons - some economic, some political,\ncultural, prompted by issues about identity, dignity, rights. Migration = labor shortage =\nmechanical cotton picker = labor shortage = migration.\n\nOf the 9 million people who leave the south, blacks leave disproportionately - but is that\ndisproportionately related to how blacks are disproportionately represented in the number of\nsharecroppers?\n\nStudent: If sharecroppers were leaving all at the same rate, regardless of race, then it was\nmore an issue of class.\n21H.221 (Fall 2006), Places of Migration in U.S. History\nSession 12\nProf. Christopher Capozzola\n\nPage 2 of 3\n\nKirby suggests that blacks were leaving at disproportionate rates, even compared to white\nsharecroppers.\n\nIn the article he traces out how complicated it is to define the word South. The main reason\nfor excluding Florida is that a lot of people are moving into Florida during these years -\ntourism, retirement.\n\nPart of what Kirby traces out is that he wants us in some ways to think about these\neconomic pushes not to minimize the importance of racism but to suggest that we\nshouldn't start our social analysis with our racial blinders already on. He would\nextend this to migrations in general. (He's now working on a comparison between the\nAmerican South and southern Italy.) He wouldn't say to ignore race - but if you start with\na racialized set of ideas, you're going to miss part of the story.\n\nFor example, it's very easy to miss white out-migrants because they blend into the white\npopulations of those cities much faster than the blacks do. The discrimination about what\nwhite migrants face is particularly limited scope - the community would resent the arrival of\n100 white men from Oklahoma just because it disturbs community fabric. But over time,\nwhite migrants have advantages that black migrants don't. White migrants have\ndisappeared as a distinctive group. Much of the story in Chicago and elsewhere is about\nhow blacks remain distinct because blending in isn't an option because the policies and\neconomic practices are set to prevent that.\n\nIn the last few weeks we've driven home the economic forces driving social changes and I\ndon't want us to lose all the other reasons why people move, regardless of their race, but\nthat people move for all kinds of reasons. And I want to make everyone sensitive how\neconomic forces shape those migrations and how laws shape after the move. We are a\nprofoundly mobile society - the motivations are complex and complicated. Any\ngood explanation has to find a place for big economic forces, e.g. industrialization, but if\nyou start and finish with economic forces, then you lose something.\n\nMovie: The Jazz Singer made in 1927, about 2nd generation Jewish American who wants to\nbe a jazz singer and has to reject his role as singer in his synagogue.\n\n-\nmigrations from Europe to America\n-\ntensions of how to live as a Jewish immigrant\n-\ngenerational conflict between father and son\n\n21H.221 (Fall 2006), Places of Migration in U.S. History\nSession 12\nProf. Christopher Capozzola\n\nPage 3 of 3"
    },
    {
      "category": "Resource",
      "title": "ses13_jazz_sing.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-221-the-places-of-migration-in-united-states-history-fall-2006/44c9d2604bd6645b928f359b11dd3f14_ses13_jazz_sing.pdf",
      "content": "21H.221 (Fall 2006), Places of Migration in U.S. History\nProf. Christopher Capozzola\nSession 13: The Jazz Singer screening (Part II) and discussion\n\nFinish watching The Jazz Singer.\n\nFirst everyone deliberately stayed quiet, and then you [the class] took on the behavior of an\nearly 20th century movie crowd, talking during/to the movie.\n\nThis is the first sound film. Of all the stories that could have been told, in all the ways it\ncould have been told - it's this story, an immigrant story, the tension between tradition and\nmodernity, old music and jazz, it's central immigrant moment is an immigrant singing to his\nmother in blackface. This is the birth of sound film, and from this develops modern\nHollywood ethics. The songs that he was singing were his specialty songs, musical numbers\nwould have been a lot like the musical numbers in the movie.\n\nPart of what makes it cheesy to us is the visual motif of it all - the techniques of silent film\nhas to be more like a pantomime that may seem goofy for us. The content of the story -\nwell, we'll watch My Big Fat Greek Wedding and I don't know if the content is any less\ncheesy.\n\nImagine the audience, urban immigrants in a place like New York or Boston, watching this\nmovie. What lesson does it teach?\n\nStudents:\n-\ntraditional role of mother\n-\nnever forget roots\n-\nsocial mobility\n\nHe gets to live his dream. There's probably a whole other section we could do in this class\nabout show business migrations - moving to Hollywood or Las Vegas. The social mobility\nthing also came out of the very first bit of dialogue - that sound dialogue when he tells his\nmother what he's going to give her, how they'd move, etc. Of all the things that could have\nbeen said in the first talking movie, it's about moving to the suburbs and having more stuff.\n\nStudent: How cultures can adapt, e.g. when they visit the show.\n\nOne of the lessons is that you can have it both ways - a message to an audience that would\nhave largely been of the children's generations (American born kids of immigrants) -\nencountering America with excitement and guilt like Al Jolson.\n\nThe reading gives you a feel for the different generations. The first generation of\nimmigrants didn't go out to the movies (or out at all). Sometimes it was the kids, sneaking\nout hiding from their parents.\n\nEarly Hollywood film is largely a Jewish industry because a large part of many traditional\nfields are closed to Jews (e.g. banking, law), so that's part of where it comes from. An\nEmpire of Their Own traces the ways in which movies are made in this world that is an\nimmigrant world. The biography of Samuel Goldwyn, one of the first big movie moguls, was\nmade into a documentary - as an immigrant, changing his name, making money, moving to\nHollywood, running into difficulties getting his work done. This is the 1920s - anti-\n\nimmigration nativism. Anti-semitism flares up - and the fact that Hollywood is a Jewish\nindustry is how Hollywood and Jews get linked in America.\n\nLove and Theft is about the complicated cultural relationships between American Jews and\nAmerican blacks, particularly in media and entertainment.\n\nWhat are immigrants becoming? American, modern, capitalist workers. The story of movie\ngoing is the story of how mass culture makes them into modern urban consumers, and\nthis movie is about that. Think about that in conjunction with factory work in Lawrence. The\npresence of the blackface singer brings up the question of whether European immigrants are\nbecoming white, adopting American understandings of racial identity. Europeans didn't have\nmuch experience with black people before migrating to the US and then within such a short\nperiod of time can be out there performing in these racist, stereotypical ways - what does\nthat mean about how these immigrants think about who they are and what their identity is,\nnot just about relationships between blacks and Jews in the 1920s.\n\n21H.221 (Fall 2006), Places of Migration in U.S. History\nSession 13\nChristopher Capozzola\n\nPage 2 of 2"
    },
    {
      "category": "Resource",
      "title": "ses14_multicult.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-221-the-places-of-migration-in-united-states-history-fall-2006/ff75ce1c6d23756d8088fbd5857890df_ses14_multicult.pdf",
      "content": "21H.221 (Fall 2006), Places of Migration in U.S. History\nProf. Christopher Capozzola\nSession 14: Remembering Ethnicity in an Age of Multiculturalism lecture\n\nWe'll be learning about the ethnic revival of the 1970s. This will do a couple of things -\nput the readings in some perspective and give some sense of how immigration and ethnic\nidentity are changing in 1970s and a feel for what it is we're doing on our trip to New York\nCity (NYC).\n\nOptional reading: Eric Liu's essay, \"Chinatown\" in The Accidental Asian. A third generation\nChinese American writing about going from the suburbs to visit his grandmother in NYC.\n\nWe're aiming for an understanding of what it is that people in the late 20th century got\ninterested in - particularly the descendants of European immigrants. They got re-interested\nin roots. \"What the son wishes to forget, the grandson wishes to remember.\"\n\nThree reasons why people get interested in their roots, particularly in the 1960s, 1970s, and\nup to today.\n\nWhy ethnic revival?\n\n1. What the son wishes to forget, the grandson wishes to remember - quote by\nMarcus Hansen, one of the first immigration historians. Sense of family history -\npersonal, autobiographical reasons.\n\n2. General reaction to modernity - a lot of the impulse toward ethnic revival was\noften predicated on a search for a more authentic identity - family, community,\nhome, etc. - that people who live in (post)modern capitalistic societies feel they're\nmissing.\n\n3. Reaction to civil rights movement - deliberately vague phrase because it can be\na product of participation in and backlash against. It placed issues of race, ethnicity,\nidentity at the center of American public life. The world of multiculturalism couldn't\nhave happened without people coming together - an urge to participate in the\nculture changes implicated by this. The backlash, on the other hand, an assertion of\na particular kind of white ethnic identity made distinctions among ethnic groups in\nAmerican life.\n\nThe ethnic revival of the 1970s is all three of these things, even until today.\n\nImmigration reform - after restriction after 1924, there's almost no immigration from\nEurope or Asia. But already the tide is shifting on the rhetorical level - after 1973/4/5, the\nnumber of immigrants start to rise. There are changes in the rhetoric as early as the\n1950s. In 1958 Senator John Kennedy (JFK) publishes Nation of Immigrants where he says\nAmericans have been a nation of immigrants and owes its heritage to the reform of\nimmigration laws - prelude to election of JFK in 1960.\n\n1963 - JFK's trip to Ireland, back to his family's ancestral village. He's using it as a way to\ncement international alliances between the US and Ireland but is also showing that the US\nneeds to reform immigration laws.\n\n1965 - Immigration Reform Act - seen by Congress as part of a moment of great society, a\n\nmoment of the civil rights movement more generally. The same congress passes the voting\nrights act. Immigration reform acts as a symbolic gesture to show that we are a nation of\nimmigrants. Studies done in 1965 suggested that the number of immigrants wouldn't\nchange very much, but these laws could get racialization and ethniciziation of American\ninstitutions out.\n\nHow all of this works...\n\nThre's a renovation in American thinking between 1965 and 1990. It's in these decades\nthat Ellis Island replaces Plymouth Rock as center for American history. Most\ntextbooks or pop culture representations in the mid 20th century place Plymouth Rock as the\nsite of national origins. Ellis Island closed in 1954 and very unceremoniously. From 1954\ninto the 1970s, it was empty and decrepit, vandalized, not used at all. The government had\nsome ideas of what they'd do with it (e.g. luxury condos, public housing, a dump,\nsomething else). In the 1950s when there were plans to develop an American museum of\nimmigration, people turned to the Statue of Liberty not Ellis Island. A marketing firm did\nstudies in 1955, and found only 20% of Americans could identify Ellis Island. Its mythic\nfactor just wasn't really there in 1955, not as part of our national consciousness. It was\nmade part of the Statue of Liberty national park in 1965 - the same year Lyndon Johnson\nsigns the Immigration Reform Act. No real plans for renovation until 1976 - which was a\nturning point for many things, such as the American bicentennial. It was a big moment to\nget Americans to think about their own past - there were localized, community oriented\ncelebrations (since the nation didn't have money for big fair). Local things fostered senses\nof community or ethnic heritage. Between 1976 and 1986, the renovation of Statue of\nLiberty took place. 1986 was the centennial celebration and also renovation celebration - a\nbig 80s celebration. The main person in charge of fundraising was Lee Iacocca, the CEO of\nChrysler, himself the son of an immigrant. Chrysler was almost bankrupt in the 1970s but\nit came back (with government subsidy) - it served as a symbol of American being \"back.\"\nIakoka used money for the renovated Ellis Island that opened in 1990. Now more people\nvisit daily than ever went through on a given day. This is testament to the Americans'\nchanging understanding of a place like Ellis Island.\n\nThere was cultural exploration in literature, pop culture, historical research. 1976 =\ncrucial moment. Three influential books were published in 1976 - the best, most respected\nof the year were:\n\n-\nWorld of our Fathers by Irving Howe - giant history of the life of Jewish communities\nof the Lower East Side. Howe grew up in neighborhood and writes of the cultural/\npolitical life of the neighborhood, questions of assimilation. People responded\npositively, coming at a time when NYC was in tough times, a time of urban decline,\nso this appealed as a model of NYC in its better days. It's the idea that \"everyone\nwants a ghetto to look back to.\" The Lower East Side is often referred to as the\nJewish ghetto.\n\n-\nWoman Warrior by Maxine Hong Kingston - shows how different strands are coming\ntogether. Kingston comes out of the culture of ethnic studies and ethnic radicalism\nand feminism, particularly on the west coast in the 1970s. The book's about\nfamily, memory, community, and draws a lot on history (Chinese-American history of\nher own family).\n\n-\nRoots by Alex Haley - the book everyone read in 1976. In 1977 it was turned into a\nTV mini-series watched by 100 million people - a shared national media\nexperience (the country's population was just over 200 million then). The novel is\n21H.221 (Fall 2006), Places of Migration in U.S. History\nSession 14\nProf. Christopher Capozzola\n\nPage 2 of 4\n\nbased on his Haley's efforts at reconstructing his own family history, his ancestors'\npassage to America. It encouraged a national boom in family history and\ngenealogy.\n\nIt's after 1976 that you start to see ethnic revival kitsch everywhere - e.g. \"Kiss me I'm\nIrish!\" or \"Parking for Albanians only\" for personal driveway, cookbooks (like The Joys of\nYiddish and Czech Your Cooking). Movies starting in 1960s are increasingly about the\nimmigration experience - Zorba the Greek (1968), Fiddler on the Roof (1971), The\nGodfather (1972), Roots (1977).\n\nThe popular cultural texts are coming along with new historical texts and approaches; the\nhistory profession is changing as non-historians have their own interest in history -\neveryone's coming together. As late as 1962, the president of the American Historical\nAssociation says \"many of the young practitioners are products of the lower middle class,\nemotions get in the way of historical reconstructions\" - this was how immigration history\nwas received in 1962. But changes were clearly underway that he was responding to,\nchanges that only accelerated as the 1960s went on - redefining history of\nwar/politics/power to changes of work/labor history. He was also responding to\ncultural changes in literature and film. They're making these things possible. Kingston\ndraws on work of immigration historians. Haley couldn't have written his novel without the\nwork of those working in African American history. Howe is writing history. Philosophers,\npolitical theorists, cultural studies folk are all exploring theories of pluralism - cultural\nrelativism, identity politics. There was am excitement that a lot of people brought to this\nproject, with a wide array of people [and their backgrounds] were involved. A lot of what's\ngoing on is a way of participating in the civil rights movement - multiculturalism has a place\nin it for white ethnic identities, white ethnic European identities. It can also be a backlash\nagainst the civil rights movement.\n\nThe important thing is another 1976 cultural product - the movie Rocky. It's a poor Italian\nversus an African American (thinly veiled Mohammad Ali). It's the standard underdog story\nclassic to boxing movies - interesting that he is this white ethnic underdog. None of this is\never explicit - there's a sense in which it is this working class white ethnic guy and it\nmatters that he's a man who is suffering under all of these other things - he's living in the\ncity at a time when cities are under enormous strain and decay and other social problems.\nWhat Rocky taps into even if he doesn't directly talk about it is this sense of victimhood in\nwhich as assertion of a white ethnic identity like his could actually be a backlash/protest\nagainst a bunch of things - class differences against white suburbanites fleeing the cities\nleaving behind the old neighborhood but also against the civil rights movement\n(conceptualized as an African American movement), or against feminism. His appeal as the\nunderdog is through physicality - through boxing. Historically and even up to now, boxing\nis an immigrant sport. It's not the big popular national sport it once was. Boxing used to be\ndeeply divided - the color line was strictly drawn.\n\nRocky appears in theaters at the same time as the Supreme Court ruled on University of\nCalifornia Regents v. Bakke - the case substantially reins in affirmative action as a social\npolicy in 1976. People at the time actually talked about Bakke by comparing him to rocky\nas this white underdog. In 1984 when Reagan makes his journey to Ireland, one of the\nsongs they play is the theme song for Rocky.\n\nThe ethnic revival of 1960s and 1970s create places of tourism and pilgrimage - what\nwe'll be doing when we visit NYC. They are part of a very complicated set of cultural\nimpulses. The fact that Roots and Woman Warrior and Rocky and all these other things can\nfit on the same list suggest that there are multiple forces going on in the 1970s causing\n21H.221 (Fall 2006), Places of Migration in U.S. History\nSession 14\nProf. Christopher Capozzola\n\nPage 3 of 4\n\npeople to look back to their past. And it had many different impulses - sometimes\ncompeting from different people, conflicting from within.\n\nExamples of tension:\n\nThe conservative writer Michael Novak in the 1970s had an interchange with Native\nAmerican activist who was criticizing Novak for what his [Novak's] ancestors had done to his\n[the Native American activist's] ancestors.\n\nThe busing crises in South Boston in 1970s was an example of the ethnic revival of Irish\nAmerican identity, class wars, racism against African Americans. One of the common signs\nby white people opposing busing was \"England out of northern Ireland, blacks out of South\nBoston.\" The middle and upper class whites of Boston had already left - to suburbs where\nbusing was not going on - so that sense of being the underdog is going on as well.\n\nExplorations by historians, writers, particularly in the realm of culture, are very much there\nin 1970s, but not so much anymore. The ethnic revival wasn't solely a reaction\nagainst the civil rights movement.\n\nPaper topics\n\nHow do you know where to do online research and which resources to choose?\n\nStudents:\n-\nGoogle scholar\n-\nJSTOR\n-\nWikipedia\n\nA search on Google for \"Lincoln Great Emancipator\" yields search result by a holocaust\ndenial organization. It doesn't seem so at first, but there's a lesson here to learn. This is\nalso illustrated by how Wikipedia can provide useful knowledge. But the lesson is you\nshould also be critical things of works that show themselves as scholarly work.\n21H.221 (Fall 2006), Places of Migration in U.S. History\nSession 14\nProf. Christopher Capozzola\n\nPage 4 of 4"
    },
    {
      "category": "Resource",
      "title": "ses15_lower_east.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-221-the-places-of-migration-in-united-states-history-fall-2006/f5ac4123b1c362410b50c92c8629c260_ses15_lower_east.pdf",
      "content": "21H.221 (Fall 2006), Places of Migration in U.S. History\nProf. Christopher Capozzola\nSession 15: Discussion of Lower East Side Memories\n\nWhen we're visiting NYC and we get to the Eldridge Street Synagogue, what do you think\nthe tour guide is going to say?\n\nStudent: He'll probably leave out how the more real-lived details and instead emphasize the\ngrand history. Why did they make the synagogue like a typical cathedral?\n\np. 113\n\nReference the Temple Emanu-El ca. 1885 - how do the two compare? Both have Moorish\ndesign.\n\nIf you look at a lot of synagogues in this time period, a lot of them look increasingly like\nChristian churches, particularly those built in the US. In this moment Judaism itself is\nchanging dramatically and modernizing and urbanizing and adopting many of the\narchitectural and cultural forms of Christianity. In part, this is because it's no longer the\ncase that Jews are strictly excluded from the rest of society - they can do what they want -\nand other cultural practices change in the 19th century very quickly, e.g. moving away from\nkosher eating regulations, redefining Sabbath, congregations fragmenting (orthodox,\nreform).\n\nIt's no accident that it's 1986 when the synagogue's restoration begins - put that in the\ncontext of this ethnic revival from last lecture. It's also connected to the rebirth of NYC and\ncities in general in the 80s and 90s. One of the reasons we have a tenement museum is\nthat for 50 years, some of the buildings in the Lower East Side were empty - people were\nmoving out, parts were decaying, it wasn't occupied. Now, with the forces of gentrification\nand urban life, this wouldn't have happened. That's one of the forces that actually saves it.\nPeople who are going on these walking tours are also looking back at the neighborhoods\ntheir parents/grandparents lived in before they moved to the suburbs.\n\nDiner points out four problems with the mythic Lower East Side:\n-\npeople's attachment to this place isn't necessarily tied to the experience of the place\n-\nJews have been living in NY for a long time and the standard myth focuses on this\nturn of the century period even though present as early as 1830s - it was the\nGerman neighborhood, Jews coming from Germany\n-\nPeople came not only seeking political/religious freedom, but economic push/pull\nfactors were also at work\n-\nNo real geographical boundary or designation of \"Lower East Side\" - people at the\ntime didn't use the term, it was constructed later\n\nQuestions of memory: Can people actually remember something that didn't happen to\nthem? What's the appeal for the Lower East Side for contemporary American Jews?\n\nStudents:\n-\nfamily history - \"we've come a long way\" explanation\n-\ncenter for religious/cultural traditions - freedom to act as they pleased\n\nIt's a place distinctively Jewish and also tied to religion - but Diner questions this. When we\ngo on the tour, will they describe the synagogue as the epicenter/anchor of the community,\n\nbut Diner suggests that it probably wasn't - other institutions were just as important. It's\nbecome thought of as a very religious place which has as much to do with secularization of\n20th century life and as people moved away they looked back to this.\n\nStudent: It serves as a creation myth - it's huge, intense community\n\nWhy did this happen? One of the crucial things is that the Holocaust and WWII destroys\nother places that could be thought of as the \"Old Country.\" It's also the Cold War. When\nthe Iron Curtain goes down, they can't go back to Poland or Russia (even though they're not\ndying to in the first place, but it's not really an option anyway). And so the new places\nbecome \"home.\" Diner doesn't really talk about how American Jews have that mixed\nrelationship with Israel, particularly in the late 20th century, which is yet another option of a\nplace to call home. But it can't be necessarily called the Old Country because it's not where\nmost Jewish Americans are from. The Lower East Side doesn't' bring the political\ncontroversy that Israel has. Israeli Jews are themselves a very diverse group of people\nfrom many countries.\n\nZionism emerges in 18th century Europe as a response to the sense of European Jews that\nknow they can't really be at home in any European state and so they need a state of their\nown - first big leader was Austria's Theodor Herzl in late 19th century who suggested that\nJewish people settle in Palestine (at that time part of Ottoman Empire, British mandate after\nWWI). In the course of these decades, large numbers due migrate, but not as large as\nnumbers after 1948. After WWII, it's American Jews who are most visible, numerous,\npowerful on the international stage - in this sense the Lower East Side becomes the Old\nCountry.\n\nWhere does Diner find the evidence for all of this? She uses historical artifacts, from\nchildren's books to Simpson's episodes. Now having seen The Jazz Singer...?\n\nThere are still tensions between parents and children, particularly in the immigrant families.\nIf the remake of the movie was set in 1980 in a suburb, it would have been more accurate\nand less believable.\n\nCollective memory\n\nThis is not a book of history - it's not trying to say what happened in the LES, it's analyzing\nwhat people remember. Yes, she draws on historical documents, but she emphasizes that\npeople remember something else. They remember LES as a religious place, uniquely Jewish\nplace, cultural place.\n\nBy 1980, Ribinowitz was too American a name. By changing it back to a less Anglicized\nspelling would be marking this person as not fully Americanized person.\n\nAll these people who want to believe something that history books time and time reiterate is\nnot the case. We've encountered this throughout the semester - this is not how people\nremember it, but this is actually what happened. Why is it that people think about\nimmigration differently from its actual history? And what is it about history that's not\nactually getting through?\n\nStudents debate whether historical fact/truth is better than cultural/personal memory and\nthe validity and purposes of each.\n\n21H.221 (Fall 2006), Places of Migration in U.S. History\nSession 15\nProf. Christopher Capozzola\n\nPage 2 of 3\n\nIs this cultural process by which American Jews have remembered their history a distortion\nof history? A triumph of community?\n\nWhat's the other option other than mythologizing this? There's forgetting your past - the\ngeneration of American Jews who moved to the suburbs in the 50s went to great lengths to\ndo this. Furthermore, does the Holocaust have to be the central event of their culture's past\nwhich necessarily creates a cultural history of a culture as victimized? If you can remember\nthe Lower East Side as the center of your cultural past, isn't it more positive, generative,\ncreative than the alternative?\n\nRepression and discrimination and violence have actually always created shared collective\nidentities for all kinds of groups throughout history - creating an uneasiness in those\ncommunities, why do we have to be defined by something else?\n\nThe experience of modern life - a search for some sense of authenticity, solidity.\n\nThese are resistant, deliberate misreadings of history - it's not like American Jews don't\nunderstand the history books, it's that they're choosing (not necessarily consciously) to read\nthat history in a different way.\n\nIt matters for her argument that this story is also true for non-Jewish Americans, for whom\nLES and Jewish are synonyms in a way. In that way, the Simpsons are a good example\ninstead of just using solely Jewish references.\n\n21H.221 (Fall 2006), Places of Migration in U.S. History\nSession 15\nProf. Christopher Capozzola\n\nPage 3 of 3"
    },
    {
      "category": "Resource",
      "title": "ses16_new_imm.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-221-the-places-of-migration-in-united-states-history-fall-2006/52269eb48291c72b058de4b28d7534d5_ses16_new_imm.pdf",
      "content": "21H.221 (Fall 2006), Places of Migration in U.S. History\nProf. Christopher Capozzola\nSession 16: What's New about \"New Immigration\"? lecture and discussion\n\nWhere we're going from here:\n\nToday:\nImmigration policy\nHow things have changed in the last few decades\n\nNext class session:\nNo library session - instead we'll watch a short film, a 1⁄2 hour documentary looking at San\nDiego and Tijuana to get a joint history but it's actually more contemporary, about what\nlife's like in both places today. Then we'll have a brainstorming session - we'll spend 2\nweeks to think about current issues of US-Mexico border in historical perspective - what do\nyou want to know? What kinds of sources would you want to look at? If we were going to\ndo this research collectively, what would you want to find? Resources, interviews with\npeople across the border, border guards, employers of Mexican workers, people who aren't\ncrossing the borders but are nevertheless affected by these issues, Mexican-Americans in\nUS (multiple generations)? What kinds of sources - newspaper articles, journal,\nphotographs, works of art. We'll brainstorm about what might be on this list and then\nparsing out the research. Eventually, we'll have a collaborative project emerge - website,\nPowerPoint. This is designed to be flexible but substantive too.\n\nNext week: Regular week of class\n\nThanksgiving week: Border research project\n\nPaper topic: Write up something well in advance of the paper, definitely before\nThanksgiving, that gives a sense of what you'll actually write your paper about. What\nsources will your paper be based on? Everyone will be using both primary and secondary\nmaterial - primary material from the past to draw out some argument. Yes, you'll rely on\nsecondary material from scholars, but you should have some core of sources that should\nhelp you answer some kind of analytical question. The one thing you should not write is a\n\"This is what happened...\" paper. The paper is due on the last day class.\n\nChanges in immigration law and discussion of readings from Guarding the Golden Door.\n\nThink about what is or isn't new about this so-called \"new immigration\" - put it in the\nperspective of other immigrants at the turn of century.\n\nLet's start with the 1965 Immigration Act. How does it work? If you were to describe\nthe terms of the 1965 act, its central premises, what's different?\n\nFor a long time, there was a quota system that eliminated immigration, but the 1965 act\nchanged that. It set a numerical cap - at the beginning, it was split by eastern and western\nhemispheres. The 1965 act looks to limit immigration from, in particular, Mexico, Canada,\nand South America. There were also the issues of needed workers, family reunification,\nrefugees.\n\nPart of what the book lays out is how these principles work (with lots of details) but it also\nexplains why the number of immigrants who come doesn't match what people were\nexpecting. Why?\n\nSources of immigration turn out to be different. Southern and eastern Europeans aren't\nrushing to migrate - but looking at the poorer corners of Europe, you see increasing\nnumbers of immigrants after 1965.\n\nAlso, the numbers turn out to be much higher than expected. Family reunification and\nrefugees turn out to be much larger. See page 136 - look at the preference systems of\n1965 act, you see remarkable ways families can be unified. It includes children, spouses,\nparents, married children, etc. You end up with family chains whereby as families are\nunified, as one person moves here (maybe as a needed worker or refugee), he/she can\nbring in more family members who can in turn bring in more family members, and these\nnumbers turned out to be more than people anticipated.\n\nThe other part of it was the refugee portion. The number of refugees turns out to be far\nlarger than anyone anticipated. As these refugee policies began, it was as a small-scale\nprogram for those temporarily displaced. This was based on Hungary in 1956 - a couple\nthousand left Hungary and settled in US. Part of what happens is that under the politics of\nthe 20th century, all kinds of wars and revolutions lead to a general steady stream of people\nwho are refugees - so numbers are far higher. The conditions of flight, of leaving political\ncrises, turn out to be much greater and more durable than any short-term political crisis.\n\nWe've seen the relationship of these changes between domestic politics and foreign\npolitics. In domestic politics, you have the civil rights movement and at the same time you\nhave the Cold War context on the foreign front. How can we see immigration through this\nlens in this time period?\n\n1949 - mainland China becomes communist. At this point, there are still large numbers of\nChinese people in the US. There's a lot of concern in the federal government about the\npolitical loyalties of these immigrants - this is a forgotten chapter of history. We know a\nlot about the internment of Japanese a decade before. But when the stakes of the Cold War\nwere awfully high, there was a lot of concern of whether the Chinese in the US could be\ntrusted. And the government sets up this program called the Chinese confession\nprogram. See pages 156-157. The Immigration and Naturalization Service (INS) knows in\n1955 that there are large numbers of Chinese in the US and they know many are here\nillegally. They actually offer an amnesty program. If you think about the current debates\nover amnesty, this is in many ways the first historical precedent. The INS would offer\namnesty to a Chinese immigrant here illegally on the condition that he/she gave information\nabout other illegal Chinese immigrants. People end up turning in others - we don't have\nexact numbers, but it was between 10,000 to 20,000 people. This was occurring in Chinese\ncommunities where some were, in fact, communists, some were sympathetic to mainland\nChina, or from mainland China, looking at the Chinese revolution not through a lens of\ncommunist world domination but through a lens of nationalism - here's their country that's\nbeen through a lot, through European exploitation, and now there's a nationalist movement\nunder Mao and for many they see it only as nationalist. They know Mao's rhetoric - not\ninterested in it or want to downplay it. Enthusiasm for Chinese revolution could have been\nmisinterpreted for communism. The dynamics when you're being interrogated - it's a good\nchance to get back at people you don't like. The numbers are astonishing - we know the\n1950s and we hear about McCarthyism and you think this only affects a few radical\ncommunists in Hollywood - this part of the story is usually left out but the numbers show\nwhat the naming names policy could do. It could snowball, people labeling one another\n21H.221 (Fall 2006), Places of Migration in U.S. History\nSession 16\nProf. Christopher Capozzola\n\nPage 2 of 5\n\nuntil you end up with 20,000 people who have either confessed themselves as illegal or\nbrought in other people that they know. The question is how do we interpret this?\n\nYou can get a feel for specifically how complicated this was for Chinese people in the US\nwho are here illegally - they're in this very vulnerable position. They don't belong, they\ndon't have a right to be here. But if they participate, the government offers them amnesty\n- then everything will be normalized, your citizenship would be legalized. But this requires\ntalking. The murkiness of what it means to be communist among Chinese people in\nthe US in 1950s is totally unclear. Maybe in 1949 when Mao came to power, making public\nspeech saying that China will be world power - saying something like that could come back\nto haunt you.\n\nOn the other hand, there are historians that say it's wrong to see this as a witch trial only\nthrough the lens of McCarthyism. We can see this as a moment of victory for Chinese\nAmericans.\n\nStudents:\n-\nif they're here illegally, they need to do anything they can to stay\n-\nyou've got a family here, you've established roots here, so it becomes a practical\nmatter\n\nWe don't know how that 20,000 compares to the total number. It's a big number,\nconsidering the number of Chinese in the US in 1950 is low. At least 25% of the population\nin 1950 was illegal.\n\nHow can this be a step forward for the Chinese-American community?\n\nBy achieving amnesty, becoming citizens, they become legitimate. It depends on what\nyou think about exclusion. If you think exclusion is the law and any good Chinese person\nshould obey the law and so the people who are here illegally didn't really have any right to\namnesty in the first place, then you could see it that way. But if you think exclusion was a\nracist law, an exclusionary law, then coming here anyway (through paper son techniques,\netc.) and amnesty were a way to assert your right, particularly if you think about the way\nthe naturalization law had excluded Chinese for so long.\n\nIn some ways the government setting up an amnesty program is an admission that their\npolicies of exclusion were not working. The question is does that mean the policies weren't\nworking because they were poorly enforced or because they were incoherent/unworkable in\nthe first place. Think about this as you think about the current debate on amnesty -\nshould it be part of the new system? If the procedures aren't working, is it because the\nDepartment of Homeland Security isn't strong or substantial enough or because the policies\nweren't meant to work in the first place?\n\nThink about 4 ways of immigration:\n\n1. Needed workers - the immigrant's value is based on the American economy. Value\ncould be based on skill (like nurses) but it could also be by need (like seasonal\nagricultural workers).\n\n2. Family reunification - puts people's relationships first, recognizing that immigrants\nare real people.\n\n21H.221 (Fall 2006), Places of Migration in U.S. History\nSession 16\nProf. Christopher Capozzola\n\nPage 3 of 5\n\n3. Refugees - takes policies into account, that the US should base immigration policies in\npart on its politics. For example, if we're fighting the Cold War against communism, we\nshould make room for those fleeing it.\n\n4. Lottery - who cares who comes? Figure out how much space we've got and have a\nlottery and let people in at random.\n\nAnd we could even add two more categories of restriction...\n\n5. No limits on immigration.\n\n6. No immigration at all.\n\nHow should the US decide what citizens of other nations are permitted to enter? Can you\nthink of a set of underlying principles?\n\nIf you were going use family as a principle, should it be in US definitions of a family or the\nmigrant's own definitions of family?\n\nStudent: It's based on the idea that the family is the basic structure of social, economic,\nand political life.\n\nWhat do you do with someone who comes as a needed worker but their spouse is totally not\nneeded from the economy's perspective? Let's say you just want to work in the US for a\nwhile - why disrupt the community and family structure in the home country for x amount\nof time, moving the family to the new country where they might not even want to be.\nThere could be a reason where you might want to come by yourself. But shouldn't you be\nallowed to change your mind?\n\nStudent: There's often a minimum time - you have to be here a certain number of years\nbefore you're allowed to bring people over.\n\nMost people interpret the time stuff as basically the government stalling to keep numbers\ndown. Could you see it as an actual political principle? Could time be used to measure\none's commitment to the nation?\n\nLottery is designed to compensate for people from countries that were discriminated against\nin prior decades.\n\nIsn't there something denigrating in telling someone who doesn't have a good job or didn't\npick the right spouse that you're not \"useful\" to us?\n\nStudent responses:\n-\nthere's going to be a few bad apples\n-\nthey could come over and take advantage of welfare system\n-\nthese policies are predicated on fear - Latinos are becoming a majority in this\ncountry - news reports telling whites to reproduce more, playing on fear of losing\npower/money\n\nAll this goes back to the question of what are immigrants becoming? They're becoming\nAmerican, US citizens, voters, participants in democracy, workers in capitalist economy,\nconsumers in consumer culture, white in a nation defined largely by its racial categories -\nthose are all the things that would presumably get lost if Americans were overwhelmed by\n21H.221 (Fall 2006), Places of Migration in U.S. History\nSession 16\nProf. Christopher Capozzola\n\nPage 4 of 5\n\nhaving completely open borders. And this crosses all divisions in the US - Americans\ngenerally believe that 'Americanness' is a pretty valuable commodity.\n\nStudent: the None category doesn't allow you to know people's purposes here\n\nCould you imagine screening for those things in another way? Crime? How are you going\nto do that in this none category? Now we use these immigration procedures to screen\nfor other things - which include crime, terrorism, becoming a public charge. Recall that\nthe very first laws that restricted immigration were designed to prevent Chinese women\nfrom coming and working as prostitutes. We haven't really gotten away from that sense\nthat we use the border to look for all kinds of things.\n\nIs there anyone who would vote for the None category, or would see a principle of political\nphilosophy that could underlie None?\n\nStudent responses:\n-\nthe idea that we're the best\n-\nwe should take care of the people we already have here\n-\nin addition to closing borders, we should take more active role in global politics\n-\nglobalization argument that we'd want similarly developed nations\n\nIf you read these chapters, it's incredibly confusing and a real mess and it's not the author's\nfault. Part of what I want you to get out of all this is that behind all of these different\npolicies - some of which are totally piecemeal or handovers to some other group (ethnic, or\na group that employs particular workers), some of which are compromises, others that\ndidn't turn out in practice, and yet others that are there for no real reasons - behind all of\nthese are political theories of justice. As we talk about the various sort of policy options,\npeople turn to explanations that are in many ways identity based - how will American\nidentity be shaped by a change in this policy? Sometimes they turn to economic\nexplanations - would this work in a globalizing economy? Would we be able to pay for\nsocial security? The conversation we haven't had as a country is this deep philosophical\nquestion: on what basic principles should a policy rest? I don't know if we have it in us as a\ncountry - I think we do. Those are some of the main ways of thinking about immigration.\n\nBreakdown of political philosophy behind immigration policies:\n1. Workers - what's good for the economy?\n2. Family reunification - linking private and public concerns\n3. Refugees - political/public concerns above all\n4. Lottery/none - separating out politics and economics and looking at it abstractly\n\n21H.221 (Fall 2006), Places of Migration in U.S. History\nSession 16\nProf. Christopher Capozzola\n\nPage 5 of 5"
    },
    {
      "category": "Resource",
      "title": "ses17_brainstorm.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-221-the-places-of-migration-in-united-states-history-fall-2006/99eba3c011ebbb18280f533e2d7b325f_ses17_brainstorm.pdf",
      "content": "21H.221 (Fall 2006), Places of Migration in U.S. History\nProf. Christopher Capozzola\nSession 17: Film and Collaborative Brainstorming\n\nUS-Mexico Border Research Project: Brainstorming\n\n1. What are some of the questions about this topic (broad or specific) that you\nwould actually like answers to? This is actually the hardest question.\n\nWhat's with the persistent focus on the Mexican border being the source of illegal\nimmigration when we get so many illegal immigrants that come through other ports (e.g.\nthe Canandian border) of this country?\n\nStatistically it's a lot higher.\n\nWhat are the effects on legal immigration? How many can actually make it across and do\nthey get harassed if they don't have the right papers?\n\nWhen did it become a major political issue? It wasn't immediately after the Mexican-\nAmerican War, but how did it progress and when did communities and politicians start being\nconcerned about it?\n\nIn the '96 presidential election, the candidates viewed that the public had strong sentiments\nabout immigration - cyclic: they thought that's what people wanted to hear and then public\ngot more inflamed. Turns out politicians overestimated.\n\nSecurity and terrorism role. Legal rights of illegal immigrants. Recent policy change that\nrestricted medical care to the newborns of illegal immigrants?? Like prop 187 but on a\nnational level.\n\nWall at Mexican border. \"Keep America Safe\" Act. What are the financial and social costs?\n\nWhat are the effects on the economy because of the lack of migrant workers?\n\nThe leaderships of the Mexican and US governments - what do they talk to each other\nabout? There doesn't seem to be any mention on the Mexican role.\n\nRole of remittances and how Mexico would support immigration to America.\n\nDoes Mexico see it as a problem because it's helping their own economy. But we don't\nknow...\n\nDo we have sheer numbers of how many people are actually coming here each year? What\npercentage of those people crossing the border are illegal?\n\nEconomic impacts? \"steal away American jobs\" vs. jobs that Americans wouldn't want to\ntake/work for lesser money. So Americans wouldn't be able to purchase goods for cheaper.\n\nAre the people who are currently occupying these jobs really being displaced that they're\nnow unemployed or do they have better jobs?\n\nAre they putting limits on immigration?\n\nWhat is the process of how they decide who's allowed in and isn't? It seems so random.\n\n2. What kinds of sources would be useful in answering those questions? Don't\nworry too much for now about whether those sources are easily available at MIT,\nwould be in English or Spanish, etc. For now, the sky's the limit.\n\nEpisode of South Park that deals with illegal immigration.\nUnions\nAFCIO\nDepartment of Homeland Security\nCensus Bureau\nInterviews with immigrants themselves\nCA, AZ, NM, TX, FL state archives - court cases, etc.\nNewspapers\n\n3. Do you have any ideas about what a good format for our collaborative research\nshould be? Would you rather see small groups presenting to each other? Creating\na website or a documentary film? Collecting a group of documents that student in\nthe next version of this class can use as resources? Again, for now, the sky's the\nlimit.\n\nWebsite - put our stuff out there\nEditable Wiki\nPresentation - discuss findings\nBlog - for communication purposes throughout project\n\n4. What kinds of skills and interest do you bring to this that other students in the\nclass might not? This should include practical skills (web design, powerpoint,\nSpanish, digital movies). But I'd also like to know what kinds of topics interest you\nmost (arts and music, politics and law, the technical details of border surveillance,\neconomic data, etc.)\n\nStudents answer individually and turned in.\n\n21H.221 (Fall 2006), Places of Migration in U.S. History\nSession 17\nProf. Christopher Capozzola\n\nPage 2 of 2"
    },
    {
      "category": "Resource",
      "title": "ses18_filipino.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-221-the-places-of-migration-in-united-states-history-fall-2006/d2be525d5e3d131f518a5a3eaf9d837f_ses18_filipino.pdf",
      "content": "21H.221 (Fall 2006), Places of Migration in U.S. History\nProf. Christopher Capozzola\nSession 18: American Imperialism and the Filipino/a Experience lecture\n\nThis week: Focus on post 1965 Filipino immigration.\n\nToday: Background overview about the Spanish American War and the origins of US\ncolonialism in the Philippines.\n\nLet's start with the Spanish American War itself, in 1898. Part of this we talked about\nbefore when we were talking about Cuban immigrants.\n\nThere was a point in 1899 just after the war was over when ambassador John Hay wrote to\nTheodore Roosevelt and described the war as a \"splendid little war.\"\n\nIt's pretty clear that intervention in Cuba was likely to come - we talked about how much\nconflict there was in 1898. In the spring of 1898 - there's all this unrest in Cuba.\nSignificant numbers of US citizens are in Cuba in the 1890s and they're being affected by\nthis unrest - the USS Maine is sent to Havana to protect US interests. It serves as sign to\nCuba that we have our eye on it as well as a sign to Americans that interests were being\nprotected. On February 15, 1898, the USS Maine exploded and 266 people were killed.\nSince then, studies conclude that it sank because boilers exploded, but the explanation at\nthe time was that the Spanish had actually blown it up - and this prompts the US to declare\nwar against Spain, officially on April 25, 1898. There's very little debate in 1898 about\nwhether to go to war or not. After the USS Maine's explosion and news reports in press\nabout what's going in Cuba - it all led to intervention.\n\nWar is declared in April and is over by August - in large part because Cuban rebels had\nalready defeated much of the Spanish army. Almost all of it takes place in Cuba - some in\nPuerto Rico (the US does invade). When the war is basically over, Admiral George Dewey\nenters Manila Bay in the Philippines and seizes it for US, and the Spanish surrender fairly\nquickly. The war comes to an end, but the war itself is imagined as a Caribbean war and\nnot a Pacific war - even though the Pacific was an increasing interest to policy makers and\ntraders in the 19th century. There was also a nationalist movement going on in the\nPhilippines against Spain.\n\nThe US starts looking at various Philippine nationalist movements - they basically\ndeclared their independence in 1896 and tried to write their own constitution and step up\nown government. The US is in the pacific looking for allies against the Spanish. They turn\nto Emilio Agunaldo who agrees to work with US - they arm and train his troops against\nthe Spanish and it works. What was going in on in Manila now becomes national.\n\nAt this point, some of the questions emerge about what to do with what the Americans at\nthe time called their \"insular possessions,\" e.g. the Philippines, Puerto Rico, Cuba. Also in\n1898, the US officially annexes Hawaii and Guam. In late 1898/early 1899, there's a big\nnational debate about whether to annex the Philippines. There's the story that\nPresident McKinley prays for guidance, and God says to take the Philippines. This story\nseems to show how tortured it was - but really, that was from a speech he gave to a group\nof visiting Protestant missionaries after the fact when Americans were starting to think\nabout whether this was this actually the right thing to do. At the time of the decision, policy\nmakers and most American elites pushed strongly for annexation of the Philippines. There\n\nwas economic benefit - new markets for American goods, new raw materials (lumber,\nhemp, other fibers and textiles), and it provided a staging ground for access to China.\n\nTrading with China was on people's minds. How did Americans think of China in 1890s? It's\nsimilar to the way they speak of China today - a vast, untapped market waiting for\nAmerican industries. Many argued from the diplomatic perspective - although, this is not\nso much in the national press but certainly in the state dept which says the Spanish empire\nis collapsing and won't hold onto the Philippines. So, if we leave the Philippines to its own\ndevices, some other empire will come in, and they're especially worried about Germany and\nJapan. From a diplomatic perspective, advice for McKinley was we have to take the\nPhilippines lest someone else will. There was the argument to take the Philippines for a\ncivilizing mission - bring western civilization, capitalism, schooling, health. A lot of this\nargument comes from missionaries who are very active in the Philippines.\n\nThe one thing that doesn't seem to be in the record is any thought of whether to ask the\nFilipinos if they want to be taken. What few voices there are coming out of the Philippines\nin printed newspapers (mostly in Spanish) are coming from the elite class. The ilustrados\nare the wealthy elite in the know, educated in western institutions mostly in Spain during\ncolonialism, and who'd amassed power and wealth in Philippine society. Some are hoping\nthat the Spanish will stay because they've made their peace with the Spanish, some would\nwelcome the Americans and would want to work with them closely, some become\nnationalists and want independence. Those are the only voices out of the Philippines\nreaching Americans, but they're not really being heard. The debate of whether to annex\nthe Philippines is among Americans in America rather than an international\nconversation.\n\nArguments against annexation:\n\n-\nFrom anti-imperialists. They saw it as an un-American tradition - the US doesn't\nhave colonies, take over places, keep colonies that won't be states. They\ndistinguished expansion to the west from annexation of the Philippines - \"we are a\nrepublic, not an empire\" idea. These voices were most common in the northeast,\nparticularly among liberal intellectuals - the headquarters of Anti-Imperialist Society\nwas in Boston. Their voices were very loud - numerically there just weren't that\nmany. You could find them in newspapers and magazines but they were\noutnumbered. (For most Americans at the time, there was a more compelling liberal\nargument for empire. Many saw colonialism through this lens of charity and this\ncivilizing process.) Anti-imperialists included William James and Mark Twain but few\nin number.\n\n-\nPrimarily from the south. The US shouldn't take these colonies, particularly the\nPhilippines, because the people in these colonies weren't Americans and couldn't be\nAmericanized particularly because they were Asian. The US should avoid taking\ncolonies because it would disrupt racial integrity - drawing from nativism,\nparticularly Anti-Chinese rhetoric. \"We've already let in too many Chinese, we\nshouldn't make it worse by appropriating Filipinos into American society.\" This line\nof anti-imperialism outnumbered.\n\nTreaty of Paris in 1899 - US purchases Philippines for $20 million (Philippine population =\n10 million)\n\nThen came efforts by the US government to remake Filipino society - schools, urban city\nplanning. Many of the turn of the century American reformers went to the Philippines -\n21H.221 (Fall 2006), Places of Migration in U.S. History\nSession 18\nProf. Christopher Capozzola\n\nPage 2 of 8\n\nagriculture, banking, progressive era things experimented with in the Philippines sometimes\nwith success/resistance/reluctance. American institutions aren't immediately transferred\nbut many of them are.\n\nFilipino legal system - they keep large aspects of the Spanish system but add more\nthings that are more American. They try to separate church and state (Spain was officially\na Catholic country) and start building up legal institutions - courts, judges. One of the\nplaces they stumble is trial by jury - they decide that Filipinos aren't \"ready\" for trial by jury\nyet so Filipino courts don't have courts and jury trials - judges make all the decisions.\n\nMany of these are transferred in the rhetoric as preparation for self government. From\nthe Treaty of Paris onward, much of the rhetoric implies/promises/asserts \"at some later\ndate\" the Philippines will be independent - or, when the Filipinos are \"capable\" of self\ngovernment. Thus, it's imagined as a developmental process. European colonies didn't\noften have such promises/implications in their colonies - but does this make this any\ndifferent in the day to day experience?\n\nAs the US is in this process, they run into something they don't expect. They find out many\nFilipinos don't want to be colonized - various Philippine national movements weren't trying\nto get rid of the Spanish to replace with the Americans; they were trying to get rid of\neveryone and establish an independent Philippine republic. From 1899, Filipino\nnationalists take up armed battle against the US. And who leads it? Agunaldo! He takes\nhis troops trained by the US and turns against the US. (This is an old strategy in American\nhistory.)\n\nThe war itself turns out to be a gruesome undertaking - one of the most violent episodes in\nFilipino history, one of the most violent in American history but almost completely forgotten.\nFrom 1899 to 1902, 200,000 Americans serve in the Philippines. The highest during any\none time is 100,000. (150,000 in Iraq now.) It was a substantial number in the Philippines\nat that time - 100,000 soldiers in population of 10 million.\n\nWhen they were fighting in Cuba it was easy with open warfare against the Spanish. In the\nPhilippines, they were dealing with guerrilla warfare - from hills, villages, drew on local\ncommunity resources, secretly armed/fed/transported by civilians in villages. US had very\nlittle experience with this - sometimes the Native American wars were fought this way but\nnot often. US defined this warfare as \"uncivilized\" because it was unfamiliar to European\nwarfare and also because it was undertaken by people they saw as uncivilized.\n\nThis became a war of civilizations - civilized vs. uncivilized. The rules of civilized warfare\ndon't apply. There were massive campaigns to destroy the hearts and minds of Filipino\nrebels - attack villages, burn it and its fields. Physical torture was also used toward leaders\nof guerilla movement. In these three years, 4,300 American troops died - while only a\ncouple hundred die in the war with Spain, mostly from disease. The number of Filipinos\nwho died is unclear - but far greater - lowest reasonable estimate is 30,000, more serious\nin range of 50,000.\n\nBy the time you get to 1902, you have an American public that launched a war for reasons\nof humanitarian intervention, human liberation, and nation building in the third world which\nhas encountered resistance, insurgency, guerilla warfare, bitterness abroad, division at\nhome. The presidential election of 1900 was in many ways a referendum on the war and by\nthe end of the three years, the US was a nation exhausted and frustrated with a war that\ndidn't work out the way they planned. The best solution would be to declare victory and\nleave.\n21H.221 (Fall 2006), Places of Migration in U.S. History\nSession 18\nProf. Christopher Capozzola\n\nPage 3 of 8\n\nSo the US declares victory but doesn't leave. They find smarter more intelligent ways to\nwork with the local elite - instead of burning people out of villages, they capture\nintellectually, economically, politically influential people - they capture the ilustrado class.\nBy doing so, the US takes advantage of ethnic divisions, getting the leading figures of all\ndifferent ethnic groups and co-opting them, bringing them into the American empire and\nassuring them that on a day to day basis they'll have power in their particular province, that\ntheir economic situation won't change so long as they maintain order. Agunaldo lays down\narms by 1902 and pledges allegiance to the US; he retires to the hills and lives out life\nquietly. Eventually he's so attached to the colonial regime, he becomes explicitly pro-\nAmerican in the 1910s/20s.\n\nThe one part of the country that doesn't work is the southern Philippines - which is\npredominantly Muslim. Resistance and violent warfare continues to 1913 and in some\nways it never goes away. Muslims resented American presence and that of Christian\nFilipinos in the north - they don't want to be a unified Philippines (they'd be a minority). A\nrebellion was put down by the young soldier John J. Pershing (a WWI figure later on). [This\nwould be a good paper topic - looking at Muslims in the Philippines as incorporated into\nAmerican society and how Americans for the first time encounter Muslim society and how\nthey react to it.] The Bureau of Non-Civilized Tribes was set up to govern the south.\n\nSlavery and polygamy were still practiced in southern Philippines in 1899 - so old debates\nof the Civil War re-emerge and some say send troops, while others say they're uncivilized so\nit doesn't matter. At the same time this is occurring, the federal government is sending\ntroops to Utah to stop polygamy. There are all types of cultural contexts going on here!\n\nIn intervening decades from 1902, the US runs the empire on the cheap for the next four\ndecades. US removes most of its troops, turning day to day running of the colony to local\nelites. There are experiments with public health and education and other reforms, but it\ndoesn't develop the Philippines as a settler colony like it does Hawaii. Nor does it look like\nother European colonies - the US never developed infrastructure like the British did in India.\nBut they do build military bases - looking at proximity to Japan and China, increasingly\nimportant as WWII begins to approach.\n\n1920s - increasing numbers of Filipinos begin to migrate to the US, particularly after 1924\n(the date of the institution of the Immigration Restriction Act - so far fewer Europeans\nare coming). The labor needs continue and Filipinos can migrate in ways that other groups\ncannot - the first exclusion laws are against the Chinese in 1882, and then there are the\nGentlemen's Agreements when Japan agrees to block emigration, and now Europeans can't\ncome - but somebody's got to do the labor. So the Americans start recruiting Filipino\nlabor. First they go to Hawaii and then to the west coast - what you see on the west coast\nin the 1930s is a circular seasonal migration pattern. The first place that a migrant from\nPhilippines goes is to Hawaii (sugar industry) then to San Francisco, arriving in spring and\nthen heading north to spend summers in Alaska (fishing industry). Then in winter he/she\ncomes down to San Francisco/Seattle and hangs out in neighborhoods, \"Little Manilas,\"\nnext to or part of Chinatown, thought of and represented in the same ways by the white\npress. In the fall, it's planting/harvesting season, so you'd head to central California where\nbig farms were. During the in-between time, you'd go back to San Francisco/Seattle. Many\nof the migrants did return to Manila - not huge numbers, though in large part because the\nwages that these people were earning were pretty low. In this phase of migration, the\ngender ratio is 95% men. Later, post 1965, the vast majority are female.\n\n21H.221 (Fall 2006), Places of Migration in U.S. History\nSession 18\nProf. Christopher Capozzola\n\nPage 4 of 8\n\nKeep in mind for reading for next time: how is it that patterns of US colonialism in the\nPhilippines set it up so that large numbers of women will pursue careers in health and use\nthat career to immigrate to the US? What kinds of institutions and practices help make it so\nFilipina women coming as nurses?\n\nThen the Depression hits and exacerbates tensions over work and labor, particularly in\nplaces like California. There's a lot of tension aimed at Filipinos and there's a move for\nexclusion, the same kind of rhetoric and tactics as the anti-Chinese and anti-Japanese\nmovements that preceded it. It takes on a different form though - sometimes it's phrased\nmore politely, \"it's time to give Filipinos independence.\" In the 1930s there's a movement\nto give the Philippines independence. By 1936, the US announces that it will grant the\nPhilippines independence - this would never have happened without the opposition of\nAmericans to Filipinos as immigrants. Filipino nationalists don't want independence and to\nend up economically weak - they want rights of migration, which they don't get.\n\nBy 1937, war has begun in the Pacific as Japan was involved in war with China. It becomes\nincreasingly unclear what's going to happen to the Philippines. Secret US planning at the\ntime called for abandoning the Philippines in case of war in Asia. There were the \"orange\nplans\" put together by Douglas MacArthur and his assistant - \"we can't defend the\nPhilippines, we don't have enough troops, what we really need to protect is Hawaii and let\nthe Philippines go\" - and this wasn't revealed to either Americans or Filipinos. After Pearl\nHarbor, Japan also attacks US air planes in Manila. Early 1942: US troops have withdrawn\nfrom the Philippines, and it's under Japanese occupation until the end of war in 1945. The\nwar comes to an end, and US troops are there. 1946: Philippines gains independence when\nthe US officially grants what it had promised in 1936.\n\nBut the story doesn't come to an end at all. The US and the Philippines continue to have\ndeeply intertwined relationships after 1946 - military, factors of the Cold War (the\nPhilippines was a non-communist country in Asia; US supported dictators like Ferdinand\nMarcos because of his opposition to communism), economic and military interests. The end\nof the story comes in 1998 when they're celebrating 100 years since the Spanish American\nWar and there's some ceremony involving lowering the American flag and raising the\nPhilippine flag. It was a windy day and both flags get tied together. This is the Philippine\ncondition - tied up in knots with the US.\n\nUS economic relationship with Philippines has been what scholars would call neo-colonial.\nUS benefits more from trade with the Philippines than vice versa. Especially in more recent\ndecades, a lot of US outsourcing for factory labor has been to the Philippines. Here the\nlegacy of colonialism is clear - one of the most commonly spoken languages is English.\nSince about 1970s, the main export is Filipino workers. Filipino labor has contributed\nenormously to the Filipino economy in the form of remittances. A lot comes from domestic\nwork, mostly by women in Japan and Hong Kong, Italy too. Filipino men in smaller\nnumbers are looking for work, in places like Dubai, as they're needed for construction of\nhotels etc. Another place for male Filipino men is in Iraq - reconstruction undertaken by US\nhired out to private corporations with contract labor of non-US workers. Because the\nPhilippines is part of the Coalition of the Willing - supporting US war in Iraq - US pumped\nenormous amounts of aid into the Philippines to convince them to send large numbers of\nFilipino workers to Iraq.\n\n21H.221 (Fall 2006), Places of Migration in U.S. History\nSession 18\nProf. Christopher Capozzola\n\nPage 5 of 8\n\nMarriage\n\nFilipinos who come to California in the 1930s and what happens to them when they get\nmarried....\n\nMarch 1930 - Stella Robinson petitioned clerk to block daughter's marriage to Filipino\nmigrant. She cited an 1880 statue of California - an anti-miscegenation statute that\nforbade a Mongolian from marrying any white person. Did \"Mongolian\" incorporate Filipino\npeople or not? 1930: Los Angeles superior court granted petition and Robinson's daughter\nnever married Tony Romero.\n\n1939 - Mariang (we only know her first name) went before the Philippine Supreme Court in\nmanila. She was a Muslim woman from the southern Philippines who'd fallen in love with\nDavid Staples, who had been a soldier but wasn't one at the time they fell in love, instead a\ncivilian working for the colonial government. He came to the Philippines from Kentucky in\n1902, and the two were joined in marriage in 1913 by a Mohammadan priest (a Muslim\ncleric) and they lived together since then. In 1939, Mariang wanted to claim her late\nhusband's estate but was being challenged by her brother in law who argued that since\nKentucky law forbade marriage across the color line, their marriage was invalid and the\nproperty should pass to him. The court was puzzled. The 14th amendment, which says the\nmost about citizenship, affirms that Staples was a citizen of the US and the state in which\nhe resides- the court had to decide was the state Kentucky or the Philippines. Then there's\nthe common law principle of domicile - a woman's legal residence follows that of her\nhusband. As late as the 1970s, as this was the law. Did marriage make Mariang a citizen\nand resident of Kentucky even though she'd never been there? Citizenship generally follows\nfrom marriage but it won't follow from a marriage if the marriage is invalid - and cross-\nracial marriages are invalid in Kentucky in this period. The court ultimately ruled in her\nfavor and she got half of his estate, $50,000 in 1939.\n\nThese two cases demonstrate the uncertainty that you see when you think about citizenship\nand the meanings of citizenship as it comes up against the fact of formal imperialism.\nCertainly, it also highlights the importance of marriage as well as other social institutions,\nlike military service, work, etc. - public institutions do a lot to shape our\nunderstanding of citizenship. The specific experience of Filipinos in this era - also\nHawaiians, Puerto Ricans, and Native Americans - they're insiders and outsiders at the\nsame time. It sheds a lot of light on the meanings of citizenship, what it actually means.\n\nThe laws of citizenship and marriage in the Philippines and how it plays out:\n\nMarriage law in the Philippines itself was a subject of contest/controversy after 1899.\nColonial administrators come and think they're engaged in something modernizing. Almost\nall who come from the government are Protestants - coming to a country whose law is\nCatholic and whose people, many of whom are Catholic, many not - they could be Muslim,\nanimistic, a whole range. One of the first things the administrators do is take on the civil\ncode of marriage - get rid of Catholic laws, add new ones, like the possibility for divorce\nthat didn't exist in the Philippines before 1849. Very few Filipinos take advantage of\nmarriage or divorce laws - most marriages are conducted in Catholic churches. In the\ncountryside, local village traditions continue outside of any Catholic/Protestant churches.\n\nUsually when people talk about laws of intermarriage and racial restrictions, they put it in\ncontext of the US color line, particularly white/black and white/Asians/Mexicans. Part of the\nstory has to do with what's going on with marriage in the Philippines.\n\n21H.221 (Fall 2006), Places of Migration in U.S. History\nSession 18\nProf. Christopher Capozzola\n\nPage 6 of 8\n\nCitizenship\n\nComplexity and murkiness - where do citizens fit as citizens in US government? There was\na whole series of court cases in 1899 that read the Supreme Court and came to be known\nas the \"insular cases\" (1903 or so) having to do with questions where's it's unclear\nwhether Filipinos are citizens or not. Courts look to Native American law for precedents -\nthe closest thing that Filipinos are like are Native Americans, \"foreign in a domestic sense.\"\nThe same rulings in insular cases apply to Puerto Ricans as well.\n\nThis establishes a three tier system:\n-\nCitizens\n-\nNationals (Filipinos and Puerto Ricans)\n-\nAliens\n\nThis matters because laws refer to citizens and aliens. If we think about aliens, go back to\nAsian immigrants - laws from 1874 say Asian immigrants are ineligible to citizenship\nbecause they're not free white/black persons.\n\nNaturalization is one thing - can Filipinos not be naturalized because they're Asian? Or\ncan they be naturalized because they're not aliens?\n\nAlien land laws - persons ineligible for citizenship cannot buy/sell land, and this was\ntargeted at Asian immigrants. Court cases that emerge surround whether Filipinos can be\nnaturalized. Some say no because they're Asian and ineligible, others say the law is\nphrased for aliens and the Filipinos aren't alien.\n\nIn addition to statutes of anti-miscegenation, you also have marital alienation: A US\nwoman who marries a non-American man loses her citizenship, but not vice versa. When a\nUS man marries a foreign woman, she is essentially naturalized. This was the case from\n1907 into the 1930s. You can imagine this gets extra complicated when an American\nwoman marries a Filipino man and especially if the American woman is of a different race\nthan Filipino man she's marrying. For example, a landowning white American woman\nmarries a migrant Filipino man. She can either lose her citizenship and property, or her\nmarriage is invalidated and she'd be subject to prosecution.\n\nTimothy Yatko - 21 year old Filipino migrant waiter in Los Angeles (LA). 1925. Married to\nwhite American woman, Lola. Lola is in bed with another man and he kills the other man.\nState charges him with murder and then the state actually invokes the anti-miscegenation\nstatute that Lola and Timothy's marriage is invalid. Now she could testify against him\nduring the trial. The state invokes this, gets marriage invalidated, Lola testifies, he's found\nguilty in 1925. 1930 and 1940 - his name is in the prison roster at San Quentin.\n\nRuth Salas comes to US from Mexico in 1913 and in 1931 she goes to the LA county clerk to\nask for a marriage license to marry a Filipino man. The clerk refused on the grounds of an\ninter-racial marriage. The Filipino community in LA gets organized - these marriage cases\nare the first cases Filipinos organize around in the 1930s and do so with collaboration with\nother immigrant groups. They eventually do succeed - they go from clerk to court petition,\nand the judge agrees in a backhanded way. Since neither of them is white, he doesn't care\nif they marry each other. Anti-miscegenation statute is about a white person and someone\nof another race, so it doesn't apply in their case. The Filipino community isn't sure if this a\nvictory or not.\n\n21H.221 (Fall 2006), Places of Migration in U.S. History\nSession 18\nProf. Christopher Capozzola\n\nPage 7 of 8\n\nSalvador and Marjorie Rogers want to get married and went to the same clerk and were\nrefused. They hire a lawyer, a prominent LA lawyer that takes their case to the Calfironia\nSupreme Court that hears testimony from anthropologists about the differences between\nMongolian and Malay. The court rules in their favor. They're about to get married but a\ncouple of weeks later the California legislature rewrites the statute to include persons of the\nMalay race (a racialized term to refer to Filipinos). The law is a response to this case.\n\nIn 1948, California becomes the first state in the union to strike down laws of inter-racial\nmarriage. In 1948, 46 of 48 states have anti-miscegenation laws (not Vermont and Maine).\nPerez v. Sharp is over the marriage between an African American woman and a Mexican\nAmerican man. It was the first case that overturned these intermarriage laws. Filipinos\nactive in activism around this - carrying out their own concerns from the 1930s court cases.\n\nWWII - Filipino American men drafted into war wanted to marry their sweethearts, so their\ncommanding officer rented a bus and sent them and their girlfriends to New Mexico where\nthey could marry. It was called the Honeymoon Express.\n\nWe're interested in what this says about citizenship and what it says about our various\nunderstandings about law and how it operates and how the legal system can be accessed by\npeople who are seen as outsiders but not entirely as outsiders. They're coming to the states\nwith some familiarity of the legal system since institutions were being established in the\nPhilippines.\n21H.221 (Fall 2006), Places of Migration in U.S. History\nSession 18\nProf. Christopher Capozzola\n\nPage 8 of 8"
    },
    {
      "category": "Resource",
      "title": "border_anon.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-221-the-places-of-migration-in-united-states-history-fall-2006/317826a8c7068dd001887eb3f69d6d82_border_anon.pdf",
      "content": "Courtesy of the author. Used with permission.\n\nWith America's new issue about illegal immigration from the Mexican border, the\nmain focus surrounds Mexicans. What about Central Americans migrating to the United\nStates via Mexico? The Mexican migrants come to America to look for work, whereas\nthe Central American migrants come to America for asylum. More Americans think\nCentral Americans seeking asylum are more justifiable than Mexicans seeking work.\nHow are Central American immigrants viewed both as their on group and in comparison\nwith Mexicans? Because there are vastly more Mexicans, are Central Americans\nbasically neglected or are they automatically grouped into Mexicans? Once the Central\nAmericans arrive, do they find jobs? Are they \"stealing jobs\" as Mexicans are being\naccused of doing? In relation to Central Americans, what percentage travel directly to\nthe United States compared to traveling to America via Mexico? What is the scenario of\nMexico's southern border security in comparison with its northern border to the United\nStates? Is Mexico more tame or strict with its southern borders?"
    },
    {
      "category": "Resource",
      "title": "border_jen.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-221-the-places-of-migration-in-united-states-history-fall-2006/768e179b16e1930889e7dea40e911fe4_border_jen.pdf",
      "content": "Courtesy of Jennifer Hernandez. Used with permission.\nMemo on the US-Mexico Border\nDoes the existing US-Mexico border fence and the initiative to erect an even more\nimposing structure, reflect genuine anti-immigration sentiment? Although policy\ncreation seems to cater to those passionate about preventing illegal immigration, other\nnon-controversial concerns are what really get border defense legislation passed.\nAs Peter Skerry describes, it seems that the \"U.S.-Mexico border has become the\nfocus of a symbolic struggle over how Americans see themselves in the world\" and not\nreally a by product of strong anti-immigration sentiment. In fact, if the goal of the US-\nMexico fence was truly only to keep immigrants out, real steps would be taken to beef up\nsecurity and make the fences harder to scale. Really, it seems that US anti-immigration\nconcerns ebb and flow over the years, and, though they are currently slightly elevated in\nour post 9/11 environment, the media and public officials overstate its importance. But,\nother US concerns that happen to involve border security, in cooperation with the\nimmigration concern, however, have fueled conversations and initiatives to increase\nborder security and defense.\nOther superseding reasons for border protection include drug trafficking\ninterception and, more recently, counterterrorism. While these legitimate concerns offer\ncause for border security concerns, they are often overlooked by the media and average\nUS citizen. Border defense legislation, in many Americans' minds, therefore is\nsynonymous with illegal immigration control and that association can be a very\ndangerous one for diplomatic and discrimination sentiments.\nSource: Skerry, Peter. \"How Not to Build a Fence,\" Foreign Policy. September/October\n2006, 64-67."
    },
    {
      "category": "Resource",
      "title": "border_nicholas.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-221-the-places-of-migration-in-united-states-history-fall-2006/5284fe353315452b113e1062e6918615_border_nicholas.pdf",
      "content": "Courtesy of Nicholas Semenkovich. Used with permission.\nThroughout history, mass migrations have brought different populations to the United\nStates, from the Chinese in California, to the Irish in the Northeast. Along with these immigrants\ncame new culture, and many times, conflict. In looking at the current dilemma of Mexican\nimmigration, we must be careful not to forget out past and the factors that have shaped the\nimmigrant culture of today.\n\nBecoming an 'American'\nThe immigrant identity is stuck in between two worlds--between a home country and the\nUnited States. Although we generally think of ourselves as a nation of immigrants, it is hard for\nmost Americans to understand what their ancestors went through, or what their home country\nwas truly like. These images are powerfully distorted by the media and by a desire to be\n'American'. Foremost, we should understand that each immigrant population faces difficulty in\nestablishing a novel culture in the US, one that is a blend of old traditions and new opportunities.\nThe Chinese, for example, originally faced enormous hostility from Americans and government\ndiscrimination. Eventually, however, the Chinese in America adapted to American culture;\nAmericanized Chinese goods became popular and Chinese medicine was held in high regard.\nToday, the Chinese in America have become Chinese Americans, with their own niche in\nAmerican society.\nMexican immigrants, however, face a somewhat different dilemma. Mexico's proximity\nto the United States makes Mexican culture less adaptable to the United States. Mexican\nimmigrants tend to keep in touch with friends and family in Mexico and as a result, many\nMexican immigrants promote their culture and language in the United States. This unfamiliar\nculture has likely sparked the recent vehement protests against Mexican immigrants. In order for\nMexican immigrants to truly become Mexican Americans, their culture must change to fit with\nthe 'American' culture ? a process that may not be forthcoming.\n\nWhere are we left today?\nImmigrant culture has become intertwined with American society. The 'immigrant story'\nhas become an optimistic tale of the American Dream - hard work by anyone can bring\nprosperity. Still today, however, debates continue over the exclusivity of American immigration.\nMexican immigration is a hotly debated topic, but one that has been repeated each\ngeneration. The ideas that immigrants have stolen jobs, are invading American culture, or are in\nsome way unfit to live here, are far from novel. Just as Mexican workers are now being\ndeported, Irish immigrants were met with job postings saying, \"No Irish Need Apply,\" and\nChinese products were boycotted while immigrants were quarantined. In defining our\nimmigration policy, we must remember the mistakes of our past--of demonizing and demeaning\nimmigrants--and that as our nation struggles with immigrants, immigrants, too, struggle with\nadapting to the United States."
    },
    {
      "category": "Resource",
      "title": "border_stonely.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-221-the-places-of-migration-in-united-states-history-fall-2006/b5d2f6296ab49a101aafff8324812f7a_border_stonely.pdf",
      "content": "Courtesy of Aaron Stonely. Used with permission.\nAaron Stonely\n21H.221\nProf. Capozzola\nCollaborative Research: Mexican Migration\n\nOne of the issues that surprised me the most over the course of the collaborative research\nproject is how politics can complicate a simple issue such as the design and construction of a\nfence. In an article called \"How Not to Build a Fence\", Peter Skerry outlines the politics behind\nthe construction of the U.S-Mexico border fence1. On the one hand, business interests oppose the\nfence because they see Mexican immigration as a source of cheap labor and seek legislation such\nas a guest worker program. On the other hand, labor unions and average citizens support the\nfence because they see the increased Mexican immigration as eroding their quality of life and\ndecreasing wages. Yet another group protests the fence for its impact on the environment. The\nresulting conflict has manifested itself in the form of the current border fence. Skerry writes that\nthe primary fence is \"made of corrugated steel panels... [that] form a kind of ladder that makes\nthe fence easy for young and old.\" The awkward compromise that is the border fence is a symbol\nof the division in our country over the immigration issue. It is consistent with an immigration\npolicy that acknowledges the problem of illegal immigration, but does little to stop it. Recently,\nnew legislation has passed regarding the creation of a new and more robust border fence.\nAlthough the new legislation sounds promising, a lingering question I have is whether the fence\nwill end up being an effective barrier, or whether the complicated politics surrounding this issue\nwill lead to another ineffective compromise.\n\n1 Skerry, P. (2006). How Not to Build a Fence. Foreign Policy, 64-67."
    }
  ]
}