{
  "course_name": "The Space Between Workshop",
  "course_description": "This workshop explores how designers might become as sensitive to space as they are to objects. Through a number of projects and precedent studies, architectural design is studied in relation to the Space Between. The design process is studied in reverse, considering space first and objects second. This is not to imply that objects are not important, but rather that space is equally important.",
  "topics": [
    "Fine Arts",
    "Architecture",
    "Architectural Design",
    "Environmental Design",
    "Fine Arts",
    "Architecture",
    "Architectural Design",
    "Environmental Design"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 3 hours / session\n\nOverview\n\nThis workshop, taught for more than ten years at MIT, is titled \"The Space Between\". Its purpose is to investigate and understand the nature of the space between objects and buildings. The studies in the workshop include the analysis of existing spaces, and the designs of new spaces and their surrounding buildings. The goal can best be described as \"revers[ing] the process of design we know all too well, of designing objects first and spaces as leftover or negative space.\" This is to counter the common situation that \"the form and detail of buildings are invested with more design energy than the spaces that buildings create and people inhabit.\" Students review examples of precedent in art and music, make studies of local neighborhoods and conditions (in Boston's North End, among others), and hear guest lectures on the subject of the Space Between. They then build models of the Space Between, to inform their own designs and understanding of neighborhoods.\n\nThe nature of the Space Between is best described in the article \"The Space Between\" (\nPDF\n), written in 1993. It describes the rationale behind the workshop, and the reasons for considering space to be as valuable as buildings. It cites references in Siena, Italy, Oak Bluffs on Martha's Vineyard, and San Juan in Puerto Rico, and describes how, in each of these instances, beautiful and inspirational public spaces were purposefully created and how the spaces in these cities are more than just leftover.\n\nA description of the day to day workings and processes of the studio are described in more detail in \"Exploring Prototypes\" (\nPDF\n). Here the very first iteration of the Space Between Workshop is described, with all the steps undertaken by the students. The values of \"path versus place\" are debated. A series of models are described and built in which students come to understand the value of the Space Between, and learn to use that in their own designs. After the completing the work of the semester, the students hopefully understand better the ramifications of their designs on the surrounding spaces, and consider them as integral a part of the design process as the buildings themselves.\n\nArticles\n\nThese two articles on the Space Between, also mentioned in the text above, are from the journal\nPlaces\n, and used with permission.\n\n\"The Space Between\" (\nPDF\n)\n\n\"Exploring Prototypes\" (\nPDF\n)",
  "files": [
    {
      "category": "Resource",
      "title": "baron.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-171-the-space-between-workshop-fall-2004/b64319618b9a8eb4cf20affc5ca96768_baron.pdf",
      "content": "Final Statement\nSandra Baron\nThe Space Between Workshop\nProfessor Jan Wampler\nI set out with an interest in the spaces between buildings, but little formal understanding of the\ncharacteristics that lend to their personality and relative success. I have found it extremely\ndifficult to make sense of these aspects and nearly impossible to categorize spaces as they always\nseem to fall somewhere on the spectrum between two pure circumstances: public versus private,\npath versus place, orchestrated versus organic to name a few. My studies have therefore been\nfocused primarily on the varying levels of public and private as well as the experience, visual\nversus physical.\nAs a point of departure, I began most of my investigations by looking into the achievements of\nthe space between as it serves the needs of the public as opposed to those of the individual.\nUrban areas are becoming increasingly crowded and complex, which leaves us questioning our\nown definition of public space and questioning the value of the space between. This may be an\noverlooked topic of discussion, but as a concept is not necessarily a new. I've found, for example,\nthat the spatial volumes of the Roman courtyard house transition effectively from more public at\nthe front atrium to more private in the rear dining court. Boston's North End also has an\nambiguous break between public and private. The triangular open plots, as well as the streets\nthemselves, sustain the highest level of public interaction. On the other end of the spectrum, the\ninner-block courtyards often discourage or reject altogether admission for non-residents. The\nblurred zone exists where a number of alleyways cut between or under private residences. I have\ncome to realize the value of looking beyond obvious public areas and into the grey zone of the\nsemi-public.\nPublic space is not always about physical access, but often about perception. Some of the most\nremarkable spaces in between exist inadvertently, such as that formed by the walls of a canyon.\nThese spaces do not belong to any individual and are perhaps the most public of them all. Visual,\nas opposed to physical, space is abundant in the urban context. In the Roman example, spatial\nvolumes of the courtyard house are aligned axially such that an orchestrated view connects the\nstreet to the residence interior and vice versa. The Roman interest in this view stresses their\ndependence on the urban context as well as their understanding of space as a visual. In the North\nEnd of Boston there exist a number of interesting spaces detached from the ground plane, some\nviews framing the open sky and some the architecture beyond. Openings in the urban assembly\nact as extensions of the public realm and add texture and depth to the individual encounter.\nBecause space as a visual is extremely experiential, and can stir emotional response, it is design\ntool of great value.\nAs a growing population we could greatly benefit from looking beyond the obvious spatial\nboundaries and into the more ambiguous areas of the semi-public and the visual. We tend to be\nspatially acquisitive and feel comfortable behind the definite boundary of our white picket fence.\nThe question exists: can we ever look at space as a shared entity? And on the topic of non-\nphysical space, could we ever embrace the idea of the visual as a public right and benefit to a\npoint where it is preserved and on some occasions designed? Whether there is ever a change in\npublic thinking, it is our responsibility as designers to consider these notions of space and utilize\nthem as tools to enrich the public experience."
    },
    {
      "category": "Resource",
      "title": "tam.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-171-the-space-between-workshop-fall-2004/9ffc30b13d6149f632b1c356c290e943_tam.pdf",
      "content": "Final Statement\nMerritt Tam\nThe Space Between Workshop\nProfessor Jan Wampler\n\nSociety teaches us to focus on objects and things; when we look at a city, we see the\nbuildings and structures; when we visit a museum, we focus on the objects of art. What\nmany of us fail to realize is the importance of the space between, around, and within\nthose objects. As designers, it is our responsibility to recognize the potential of the space\nbetween and to design and utilize that space to improve human experience.\n\nAs architects, we design places. More specifically, we design the inhabitable space\nwithin the structure and must orchestrate the experience of being in that space. We can\nexamine the series of spaces leading people through a place. Chinese houses, for\nexample, represent a precise organization of entrances and a progression from public to\nprivate areas. We must design the structure with the spatial experience in mind. How do\nwe want people to feel inside the space? How can the built form and structure create and\naugment the desired experience? Human bodies occupy space, and architects must keep\nthe human scale in mind and consider the relationship of those bodies in space.\n\nThe space between exists within the visual art world as well. For example, the\ncontemporary American artist Fred Sandback worked with string and wire, exploring the\nrelationship between \"vacancy and volume.\"1 His minimalist string installations often\nconsisted of simple cubes outlined in string, enclosing empty space and asserting \"a\ncertain place or volume in its full materiality without occupying and obscuring it.\"1\nSandback reveals the power of a simple line as a means of dividing space in time and\nmakes the viewer aware of the space within and around. In this way, Sandback reveals\nthe power of simplicity and space.\n\nThe space between objects is critical in other aspects of our lives as well. The pauses and\nrests between notes of music can carry the emotions of the listener; the formations of\nbodies in space is an intrinsic and essential part of dancing; air gaps affect the texture of\nbread and other foods. The notion of space is an abstract concept, yet it is one that affects\nour lives and is something that we experience every day. The space between objects can\noften be far more intense and interesting than the objects themselves. These interstitial\nspaces- the pieces of sky seen between tree branches, the tiny alleys between buildings-\ncan be truly beautiful and intriguing. As the amount of open land decreases, we will be\nforced to build and design within these spaces. The space left behind between buildings\nand objects must be recognized and used to the best of our ability. We must design with\nthe ideas of space and experience in mind, producing objects that occupy, enclose, and\ncreate this notion of space.\n\n1 (http://www.diacenter.org/exhibs_b/sandback/essay.html#two)"
    }
  ]
}