{
  "course_name": "The Development of Object and Face Recognition",
  "course_description": "This course takes a ‘back to the beginning’ view that aims to better understand the end result. What might be the developmental processes that lead to the organization of ‘booming, buzzing confusions’ into coherent visual objects? This course examines key experimental results and computational proposals pertinent to the discovery of objects in complex visual inputs. The structure of the course is designed to get students to learn and to focus on the genre of study as a whole; to get a feel for how science is done in this field.",
  "topics": [
    "Engineering",
    "Systems Engineering",
    "Computational Modeling and Simulation",
    "Science",
    "Cognitive Science",
    "Engineering",
    "Systems Engineering",
    "Computational Modeling and Simulation",
    "Science",
    "Cognitive Science"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nOverview\n\nThis course takes a 'back to the beginning' view that aims to better understand the end result. What might be the developmental processes that lead to the organization of 'booming, buzzing confusions' into coherent visual objects? This course examines key experimental results and computational proposals pertinent to the discovery of objects in complex visual inputs. Each student is also responsible for chairing class discussions for a subset of the readings. There are no exams. The structure of the course is designed to have students acquire a broad understanding of high-level infant visual development; to get a feel for experimental methodologies, the results that they have generated and the theoretical insights they have yielded thus far.\n\nPrerequisites\n\n9.012\nor permission of instructor.\n\nStudent Presentations\n\nEach student is required to give a presentation on an assigned paper. The presentation should address the background of the paper as well as provide a non critical summary, critical evaluation, and discussion of the findings.\n\nGrading\n\nStudents are assigned a grade based on two factors: The quality of their presentations (as indicated by its comprehensiveness, critical evaluation of the assigned paper, and the students' skill in ascertaining the paper's significance), as well as the extent and quality of their participation in class discussions. Excellence in these two areas requires completion of assigned readings and regular attendance.",
  "files": []
}