{
  "course_name": "The Solar System",
  "course_description": "This is an introduction to the study of the solar system with emphasis on the latest spacecraft results. The subject covers basic principles rather than detailed mathematical and physical models. Topics include: an overview of the solar system, planetary orbits, rings, planetary formation, meteorites, asteroids, comets, planetary surfaces and cratering, planetary interiors, planetary atmospheres, and life in the solar system.",
  "topics": [
    "Science",
    "Earth Science",
    "Geophysics",
    "Planetary Science",
    "Physics",
    "Astrophysics",
    "Science",
    "Earth Science",
    "Geophysics",
    "Planetary Science",
    "Physics",
    "Astrophysics"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nses #\n\nTopics\n\nOrganization/Introduction\n\nOverview of the Solar System\n\nOverview of the Solar System (cont.)\n\nThe Sun\n\nCelestial Mechanics\n\nCelestial Mechanics (cont.)\n\nRings\n\nExam 1\n\nPlanetary Formation\n\nOther Planetary Systems\n\nMeteorites\n\nAsteroids\n\nComets\n\nExam 2\n\nPlanetary Interiors\n\nPlanetary Interiors (cont.)\n\nPlanetary Surfaces\n\nPlanetary Surfaces (cont.)\n\nPlanetary Surfaces (cont.)\n\nSatellites/Icy Bodies\n\nExam 3\n\nPlanetary Atmospheres\n\nPlanetary Atmospheres (cont.)\n\nPlanetary Atmospheres (cont.)\n\nLife in the Solar System\n\nMars Exploration\n\nReview Session\n\nRequired Texts\n\nHartmann, W. K.\nMoons and Planets\n. Belmont, CA: Thomson Brooks/Cole, 2004. ISBN: 9780534493936.\n\nBeatty, J. K., et al.\nThe New Solar System\n. Cambridge, UK: Cambridge University Press, 1998. ISBN: 9780521645874.\n\nReading Assignments\n\nReading assignments in the\nreadings\nsection are to be completed prior to class in the indicated sessions.\n\nHomework\n\nDiscussion of homework problems with your classmates and TA is permitted and encouraged, but you must turn in your own work. Copying constitutes academic dishonesty. Homework is due at the beginning of class, in the sessions mentioned in the\nassignments\nsection. Late homework problems not accepted.\n\nGrading Policy\n\nRegular Exams\n\nThere will be\nthree\nexams during the semester, each comprising 15% of your final grade. Exams will emphasize topics presented in lecture. However, any material in the assigned reading is fair game.\n\nFinal Exam\n\nThere will be a final exam covering all of the material during the semester. Emphasis will be on a synthesis of the subject material. Your previous exams will be your best guide to the most important topics.\n\nHomework\n\nThere will be regular homework problem sets, averaging about 1 per week.\n\nAttendance and Class Participation\n\nOccasional attendance will be taken. Class participation by everyone is encouraged!\n\nActivities\n\nPercentages\n\nRegular Exams\n\n45%\n\nFinal Exam\n\n35%\n\nHomework\n\n20%\n\nAttendance and Class Participation\n\n-2% to +2% of your final grade\n\nAbsence Policy\n\nMissed Homework Deadlines\n\nLate homework problems not accepted. Grade = 0.\n\nStrict Policy: Exception requires written medical excuse or Dean's office letter.\n\nMake-up Exams\n\nNone given. Grade = 0.\n\nStrict Policy: Exception requires written medical excuse or Dean's office letter.\n\nWhat to Do if You are Absent from an Exam or Miss a Homework Deadline\n\nNot necessary to phone/email Professor or TA. It is your responsibility to obtain a written medical excuse or an Explained Absence letter from the Dean's Office. Present to Professor at the beginning of the next attended class period.\n\nStrict Policy: Professor will not grant an excuse without one of the above.\n\nAcademic Dishonesty\n\nCopying of homework problems and discussion of exams when you have obtained an excused absence is considered academic dishonesty. Suspected cases will be immediately submitted to the Committee on Discipline.",
  "files": [
    {
      "category": "Resource",
      "title": "ps1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-400-the-solar-system-spring-2006/0591bf685cdcd9c69368274d203e2a5b_ps1.pdf",
      "content": "12.400: The Solar System\nHomework Problem Set #1\nSEE CLASS WEBSITE FOR DUE DATE\nPlease show all work neatly and clearly. Circle final answer for clarity.\n1. Distance Scales\nThe length of the infinite corridor is: 202.4 meters\nIn a scale model of the solar system, let the Sun-Pluto distance (39.5294 AU ) be equal to\nthe length of the infinite corridor. On this scale: (Hint: Use pages 387-388 of Beatty)\na. What would be the diameter for the Sun?\nb. What would be the diameters for each of the nine planets?\nc. What would be the diameter of the Moon and its distance from Earth?\nd. How far from the Sun would we place each of the nine planets?\ne. How far from the Sun would we place the nearest star?\n(Alpha Centuri is located 4.3 light-years away.)\n2. Spacecraft Communication\na. How many times can a photon travel the Earth's Circumference in one second?\nb. A spacecraft is sent to Pluto. At 12:00 noon ground controllers send a command to\ntake an image. Upon receiving the command, assume the spacecraft\ninstantaneously acquires the image and transmits it back to earth. Assuming Pluto\nis at its mean heliocentric distance, when is the image received?\n3. Eclipses\na. What is the apparent angular size of the Moon as seen from Earth?\n(Use diameter and average distance given in class.)\nb. What is the apparent angular size of the Sun as seen from Earth?\n(Use diameter and average distance given in class.)\nc. If a solar eclipse occurs with the Moon and Sun at these distances, does the Moon\ntotally block the disk of the Sun? Explain.\nd. The Moon's orbit is not circular and at its closest it is 363,000 km from the Earth.\nIf a solar eclipse occurs with the Moon at this distance, does the Moon\ntotally block the disk of the Sun? Explain.\n4. Density of the solar system\nAssume that the mass of the nine planets plus Ceres is distributed in a uniform disk,\n1 cm thick between 0.2 AU and 50 AU\na. Divide the solar system into 10 zones, and compute the density within each zone.\n(EXAMPLE: Assume the earth zone extends midway to Venus and to Mars, that is\nfrom 0.86 to 1.25 AU. Distributing the Earth's mass in this zone yields 10 g cm-3.)\nb. Discuss trends in the density, noting especially zone(s) of substantially lower density.\nc. A belt of comets (the Kuiper belt) is believed to extend from 35 to 50 AU from the Sun.\nThe total population of these objects is estimated to be as high as 30,000 objects with\ndiameters between 100 and 400 km. If these objects are taken into consideration in our\ndensity calculations, do they noticeably affect the calculated density distribution? (Assume\nan average diameter of 200 km and an average density of 1 g cm-3 for the comets.)"
    },
    {
      "category": "Resource",
      "title": "ps2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-400-the-solar-system-spring-2006/46a2c814e6b6312b5826c0143300f3f9_ps2.pdf",
      "content": "--------\n12.400: The Solar System\nProblem Set #2\nUseful Constant:\nStefan-Boltzmann constant, σ = 5.67 x 10-8 J sec-1 m-2 K-4\nPlease show all work neatly and clearly. Circle final answers for clarity.\nTHE FATE OF THE EARTH\n1. When will the Sun exhaust its supply of hydrogen and no longer maintain the same\nstate of hydrostatic equilibrium that exists today? (Assume that the Sun will run out of\nhydrogen fuel in its core, due to inefficient mixing, after 5% of the Sun's current total\nhydrogen content is converted into helium.)\n2. After the Sun ceases to be in its current state of hydrostatic equilibrium, it will\nbecome a red giant star.\na. What will be the radius of the Sun when it becomes a red giant star, assuming it has\na luminosity of 3.83 x 1030 J sec-1 and a surface temperature 5000 K?\nb. Will the red giant Sun engulf the Earth?\nc. What is the change (in percent) in the power (J sec-1) being emitted by the Sun\nonce it enters the red giant stage?\n(Compare with respect to the present Sun.)\n3. You are an astronaut standing on the surface of the Moon, looking back at Earth.\nYour friend in mission control on Earth, looks out the window at the Moon. If your\nfriend on Earth communicates to you that she sees the phase of the Moon as:\nA. New Moon\nB. First Quarter Moon\nC. Full Moon\nD. Last Quarter Moon\nFor each of these, A through D,\nexplain what phase the EARTH would appear to you, as viewed from the Moon."
    },
    {
      "category": "Resource",
      "title": "ps3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-400-the-solar-system-spring-2006/998ea775492c74eb139288919359acbc_ps3.pdf",
      "content": "12.400: The Solar System\nProblem Set #3\nUseful number: G = 6.67 x 10-11 nt m2 kg-2\nMake sure your mass units are in kg, length units in m.\nPlease show all work neatly and clearly. Circle final answer for clarity.\n1. Interplanetary Olympics\nIn the interplanetary Olympics, you are a gold medal contender for the longest\nmeasured throw of the javelin. Assuming you throw with a constant speed of\n25 meters / second and at an optimum angle for maximum distance:\na. What is the minimum diameter planet where this event should be held so that the\njudges can make a determination of how far you threw (i.e. it does not escape)?\nb. For a planet having this diameter, what is the minimum time it could take for\na javelin you throw to circle the planet and strike you in the back? (The velocity\ndoesn't need to equal your maximum of 25 meters / second.)\n(Assume an average density for planetary bodies equal to 3000 kg m-3)\n2. Tidal Forces\nShow that the Moon exerts a tidal force on the Earth that is about twice that of the tidal\nforce exerted by the Sun on the Earth.\n3. Should We Duck for Cover?\nA comet is discovered with the following orbital elements\na=110.0 AU e=0.995 i=89 deg\nΩ=180 deg\nω=0 deg T=2008 March 21.\na. How close does the comet come to Earth?\nb. If Ω=0 deg, how close does the comet come to Earth?\nc. What is the comet's velocity at 1 AU?"
    }
  ]
}