{
  "course_name": "The American Novel: Stranger and Stranger",
  "course_description": "This course covers works by major American novelists, beginning with the late 18th century and concluding with a contemporary novelist. The class places major emphasis on reading novels as literary texts, but attention is paid to historical, intellectual, and political contexts as well. The syllabus varies from term to term, but many of the following writers are represented: Rowson, Hawthorne, Melville, Twain, Wharton, James, and Toni Morrison. Previously taught topics include The American Revolution and Makeovers (i.e. adaptations and reinterpretation of novels traditionally considered as American “Classics”). May be repeated for credit with instructor’s permission so long as the content differs.",
  "topics": [
    "Humanities",
    "Literature",
    "American Literature",
    "Classics",
    "Humanities",
    "Literature",
    "American Literature",
    "Classics"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nCourse Description\n\nThe novel is a place where strangers meet. Characters in Octavia Butler's\nKindred\n, Herman Melville's\nMoby-Dick\n, Harriet Jacobs'\nIncidents in the Life of a Slave Girl\n, Mark Twain's\nPudd'nhead\n\nWilson\n, Edith Wharton's\nAge of Innocence\n, William Faulkner's\nAbsalom! Absalom\n!, and Toni Morrison's\nA\n\nMercy\nmeet strangers who are disturbingly kin, kin who turn out to be strangers. These often-experimental works also reflect on America as a home for strangers, and as a stranger in the global family. We will study the ways fiction can create new, undreamed-of relationships and forms of storytelling in a strange world.\n\nTravelers to a strange world need tools, maps, schema of different kinds. Our work in this class will depend on the tools of literary analysis: close reading, study of plot structure, character development, and language, and interpretive skills. We will also adapt interpretive tools from other domains, using maps, genealogies, timelines, and a simple annotation tool (\nAnnotation Studio\n) to make the strange familiar, even as these authors make the familiar strange.\n\nAssignments will include three essays, in-class presentations of work-in-progress (one map, two posters), and in-class writing assignments.\n\nRequired Reading\n\n[Melville] = Melville, Herman.\nMoby-Dick\n:\nA Longman\n\nCritical Edition\n. Edited by John Bryant and Haskell Springer. Longman, 2009. ISBN: 9780205514083.\n\n[Jacobs] = Jacobs, Harriet A.\nIncidents in the Life of a Slave Girl\n. Edited by Jean Fagan Yellin. Harvard University Press, 2009. ISBN: 9780674035836. [Preview with\nGoogle Books\n]\n\n[Twain] = Twain, Mark.\nTragedy of Pudd'nhead Wilson\n. Edited by R. D. Gooder. Oxford University Press, 2009. ISBN: 9780199554713. [Preview with\nGoogle Books\n]\n\n[Wharton] = Wharton, Edith.\nAge of Innocence\n. Vintage, 2012. ISBN: 9780307949516.\n\n[Faulkner] = Faulkner, William.\nAbsalom! Absalom\n. Vintage, 1991. ISBN: 9780679732181.\n\n[Morrison] = Morrison, Toni.\nA Mercy\n. Vintage, 2009. ISBN: 9780307276766.\n\n[Butler] = Butler, Octavia.\nKindred\n. Beacon Press, 2004. ISBN: 9780807083697.\n\nNote: Although it is best to have the classroom text, in most cases you may use a different edition if you prefer. In the case of\nMoby-Dick\n, however, the Longman edition edited by John Bryant offers features that other texts lack and that will be important to our discussions of the text.\n\nCalendar\n\nSES #\n\nTOPICS\n\nKEY DATES\n\nIntroduction\n\nStrange Places\n\n[Butler] \"Prologue,\" \"The River,\" \"The Fire,\" and \"The Fall\"\n\n[Butler] \"The Fight,\" \"The Storm,\" \"The Rope,\" and \"Epilogue\"\n\nAnnotation Studio Workshop\n\n[Melville] \"Etymology,\" \"Extracts,\" and Chapters 1-9\n\nLocast Mapping Workshop\n\n[Melville] Chapters 10-28\n\n[Melville] Chapters 29-46\n\n[Melville] Chapters 47-67\n\n[Melville] Chapters 68-88\n\n[Melville] Chapters 89-113\n\n[Melville] Chapter 113 and Epilogue\n\nPresentations in class: Maps\n\nEssay 1 due at midnight online.\n\nStrange Families\n\n[Jacobs] Chapters 1-18\n\n[Jacobs] Chapters 19-41\n\n[Twain] Chapters 1-11\n\n[Twain] Chapters 12-21 and Conclusion\n\n[Wharton] Chapters 1-13\n\n[Wharton] Chapters 14-23\n\n[Wharton] Chapters 24-34\n\nPresentations in class: Genealogies\n\nEssay 2 due at midnight online.\n\nStrange Histories\n\n[Faulkner] Chapters 1-4\n\n[Faulkner] Chapters 5-7\n\n[Faulkner] Chapters 8-9\n\n[Morrison] Chapters 1-4\n\n[Morrison] Chapters 5-7\n\n[Morrison] Chapters 8-13\n\nPresentations in class: Timelines\n\nEssay 3 due at midnight online.\n\nImportant Things to Know\n\nEach student will be allowed 1\nexcused\nabsence; an excused absence means that you have an urgent reason to miss class and have contacted me in advance. For any additional or unexcused absence your attendance grade will be reduced by 1/3 of a grade. If you are having trouble meeting your requirements for attendance and participation, please see me at once.\n\nPapers must be submitted online by\nmidnight\non the day that they are due. Class time that day will allow for writing workshops and in-class presentations before you hand in your final draft. Come to class with draft in hand.\n\nPlease be sure to hand your papers in on time. Lateness will result in lower paper grades. For each day that your paper is late, your grade will be lowered by 1/3 (i.e. a B+ will become a B after one day, a B- after 2 days and so on. Weekends will be included).\n\nBecause of the writing-intensive nature of this course and the swift reading pace, extensions may be granted only in extreme situations (illness, family crisis, or other equally difficult circumstances). You will need to contact me at least 24 hours before the paper is due in order to receive an extension.\n\nIntellectual integrity is imperative in all of our work. Plagiarism, co-opting of another's work, will not be tolerated in any class. This is the Literature Section's policy on plagiarism:\n\nPlagiarism--use of another's intellectual work without acknowledgement--is a serious offense. It is the policy of the Literature Faculty that students who plagiarize will receive an F in the subject, and that the instructor will forward the case to the Committee on Discipline. Full acknowledgement for all information obtained from sources outside the classroom, including images and other media, must be clearly stated in all written work submitted. All ideas, arguments, and direct phrasings taken from someone else's work must be identified and properly footnoted. Quotations from other sources must be clearly marked as distinct from the student's own work. For further guidance on the proper forms of attribution, consult the style guides available in the Writing and Communication Center, 12-132, and the\nMIT Website on Plagiarism\n.\n\nThe Writing and Communication Center offers free professional advice about oral presentations and about all types of academic, creative, and professional writing. The best way to guarantee an appointment is to schedule early!\n\nStudents with Disabilities that might affect their work, in or out of class, should check with me as soon as possible (privately after class or by email). MIT is committed to the principle of equal opportunity for students with disabilities with proper registration for accommodations.\n\nStudent Support Services (S3)\n: If you are encountering academic difficulty of any kind, be sure to take advantage of the resources at S3. \"Student Support Services (S3) is designed to be a friendly and easily accessible hub of support. Whether you are having trouble with academic work for personal or medical reasons, you are considering taking time away from the Institute, or you just don't know who to talk to, we can help. A diverse staff welcomes conversations with students about their interests, and the challenges and dilemmas they encounter.\"\n\nResearch/Library/Technology Assistance: If you have library-related questions about research and resources, contact our liaison.\n\nGrading\n\nThis course consists of both an oral component, which accounts for 25% of the grade, and a written component, which counts for 75%.\n\nACTIVITIES\n\nPERCENTAGES\n\nIn-class presentation\n\n15%\n\nClass attendance and participation\n\n10%\n\n3 5-page essays\n\n60%\n\nIn-class writing\n\n15%\n\nWriting Assignments\n\nAll essays will build on your use of\nAnnotation Studio\n, a simple digital annotation tool that allows you to search and take notes in a digital text, to display your comments either privately or publicly, and to filter, tag, and sort your notes. Please go to the site to find out more about the tool (scroll down menu under \"The Application\" to \"Tutorial\"). You will receive a link where you can register for the site and begin annotating texts.",
  "files": [
    {
      "category": "Resource",
      "title": "Ahab: The American Tragic Hero",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-501-the-american-novel-stranger-and-stranger-spring-2013/236d6593a0883af32c87a323084be2f4_MIT21L_501S13_essay1Sam2.pdf",
      "content": "Ahab: The American Tragic Hero\n\nIn Melville's Moby-Dick, Great Britain is characterized throughout the text as a peculiar\ndichotomy of honor and buffoonery. At times, Melville refers to England romantically as the home of\ngreat lords, honorable deeds, and valiance. At other points in the book, however, Melville seems to\nconsider England an outdated nation full of fools, governed by idiotic laws and inhabited by bumbling\nfools. Shakespeare's tragic heroes meet their downfall through some personal flaw. Melville links Ahab,\ncaptain aboard the doomed Pequod, to this bizarre characterization of England by several means. The\npresence of the Manxman aboard the ship serves as a reminder of Great Britain, and acts as a foil to\nAhab's own character. Moreover, Melville's own depiction of Ahab in the book strongly suggests that of\nthe Shakespearean tragic hero, further culturally linking Ahab to England. Melville's contrasting versions\nof England can be seen in Ahab's own character as well. At times, Ahab appears a tragic hero and, in his\nown mind, even a Christlike figure who nobly sacrifices himself in order to destroy evil. His own bullish\nrefusal to accept reality, however, ultimately leads to his downfall. The comparison Melville draws\nbetween England and Ahab, therefore, serves to illuminate the captain's seemingly bipolar personality\nas he hunts the white whale.\nAt many points in the novel, Melville seems to ascribe to England the definition of honor. Upon\nmeeting Queequeg in \"Biographical,\" Ishmael comes to the conclusion that the \"savage\" is, in fact,\nincredibly noble. He describes Queequeg as a \"sea Prince of Wales\" (55) in a turn of phrase that serves\nboth to link Queequeg to an indisputable benchmark of nobility (British royalty) and as a rather\ndelightful pun. In \"The Honor and Glory of Whaling\", Ishmael argues that whaling ranks among the\nnoblest professions of all. With no apparent irony, he describes whalers as \"heroes, saints, demigods,\nand prophets\" (362). He goes on to compare whalemen to English saints, claiming that \"a whaleman is\nthe tutelary guardian of England; and by good rights, we harpooners of Nantucket should be enrolled in\n\nthe most noble order of St. George\" (361). From these comparisons, the reader can see that Melville\nconsiders English gentry to be one of the noblest institutions in the world.\nDespite these references to the greatness of English nobility, however, Melville appears to\ndepict England as a nation full of buffoons at other points in the book. For instance, in \"The Gam\",\nMelville describes the typical English whaler as follows:\n\"English whalers sometimes affect a kind of metropolitan superiority over the American\nwhalers... but where this superiority in the English whaleman really does consist, it would be\nhard to say, seeing that the Yankees in one day, collectively, kill more whales than all the\nEnglish, collectively, in ten years\" (238)\nMelville's description of the English whaler, therefore, differs markedly from his description of the\nAmerican whaler. Whereas the American whaler is the noblest sort of man, comparable to Saint George\nhimself, the English whaler is typified as a smug little man with no particular achievements to back him\nup. Later in the text, Melville's description of English law in \"Heads or Tails\" depicts England and\nEnglishmen as utterly foolish. In this chapter, Melville relates the tale of a group of mariners who, upon\nkilling a whale, have the carcass seized by \"a very learned and most Christian and charitable gentleman\"\n(398) who is permitted by English law to seize the whale for the Duke of the area. Melville describes this\nEnglish gentleman in the most sarcastic and ironic of terms, but he scarcely treats the English mariners\nthemselves any better. He describes the seamen's reaction as follows: \"Upon this the poor mariners in\ntheir respectful consternation - so truly English - knowing not what to say, fall to vigorously scratching\ntheir heads all around\" (398). In this tale, then, Melville depicts the English nobility as greedy, English\nlaws as nonsensical and arbitrary, and English commoners as idiotic.\nMelville's somewhat bipolar representation of England might be notable on its own. However,\nthe author also takes pains to connect Captain Ahab to England throughout the novel. In this manner,\n\nMelville projects onto Ahab the duality of nobility and idiocy that he attributes to England in the novel.\nOne way in which Melville connects Ahab to England is through the presence of the Manxman aboard\nthe Pequod, who serves as a British foil to Ahab's own character. The Manxman, in keeping with\nMelville's depiction of other Englishmen, serves alternately as an uneducated buffoon and as a source of\nwisdom and steadiness. Perhaps ironically, the Manxman seems to be at his most ridiculous when Ahab\nis playing the role of the noble hero, but is portrayed as wise when Ahab is acting at the height of his\nmadness. For instance, in \"The Log and the Line\" the Manxman reveals where he is from in the following\nexchange:\n\"'Where wert thou born?'\n'In the little rocky Isle of Man, Sir.'\n'Excellent! Thou'st hit the world by that.'\n'I know not, Sir, but I was born there.'\n'In the Isle of Man, hey? Well, the other way, it's good. Here's a man from Man, a man born in\nonce independent Man, and now unmanned of Man'\" (513)\nAhab makes fun of the Manxman, and his country's loss of independence, with clever wordplay,\nwhich the Manxman seems unable to follow. Later, however, the Manxman correctly interprets the ill\nsigns accompanying the voyage, which Ahab bullishly chooses to ignore. When the Pequod approaches\nthe Rachel, the Manxman mutters under his breath that \"'she brings bad news'\" (p. 521), which turns\nout to be true. He also foretells the date that Ahab will encounter Moby Dick when he says \"'If the\nWhite Whale be raised, it must be in a month and a day'\" (p. 431). In fact, the Manxman's grim\npredictions cause Ishmael to decide that he must have been an \"'old hearse-driver... before he took to\nthe sea\" (p. 431). Ahab, however, ignores all warnings from the Manxman about the ill fortune to come.\n\nWith his well-founded respect for the ocean and his correct reminders of the bad fortune ahead, the\nManxman serves as a reminder of how incredibly reckless and bold Ahab is, to continue his hunt for\nMoby Dick even in the face of such ill omens as are presented him. He therefore acts as a foil to Ahab's\ncharacter, acting foolish when Ahab is clever and wise when Ahab is foolish. This connection between\nthe two characters serves to link Ahab to Britain through the Manxman.\nMelville further cements the connection between Ahab and England by creating a character\nmarkedly similar to the Shakespearean tragic hero. From the reader's first introduction to Ahab, striking\nparallels can be drawn between the whaling captain and the flawed hero at the center of many of\nShakespeare's plays. Like the Shakespearean hero, Ahab meets his downfall through a personal flaw.\nShakespeare's tragedies often also contain elements of mysticism and prophecies in them. Macbeth has\nhis witches, Caesar has his soothsayer - even Othello has old Brabantio warning him that Desdemona\nmay deceive him.1 As with King Lear, Julius Caesar, and Macbeth, Ahab's great flaw is his pride, which\nultimately causes his own death as well as that of the crew. Also like the Shakespearean tragic hero,\nAhab has his own augurers portending his death. From the beginning of the book, bad omens\naccompany the voyage. Even before Ahab first appears, Ishmael and Queequeg encounter Elijah, who\nhints at some ill fortune with his unsettling line, \"I was going to warn ye against - but never mind...\nShan't see ye again very soon, I guess; unless it's before the Grand Jury\" (98). Ishmael's uneasiness is\ncompounded when he and Queequeg stay at not one but two foreboding inns - one owned by a Mr.\nPeter Coffin (8), and the other with a \"top-mast [that] looked not a little like a gallows\" (64). Later in the\nbook, during the voyage, the sailor Fedallah prophesizes to Ahab still more ill omens: that Fedallah will\ndie before Ahab, that Ahab will see two hearses before his death, and that \"'Hemp only can kill thee'\"\n(p. 492). In a misguided overconfidence reminiscent of Macbeth's, Ahab misinterprets Fedallah's\n\n1 Othello, I.iii - \"Look to her [Desdemona], Moor, if thou hast eyes to see:/ she has deceived her father, and may\nthee.\" Admittedly, Desdemona never does deceive Othello, but Othello's fear that she will proves to be his\ndownfall.\n\nwarning, choosing to believe that he will die by hanging and therefore cannot die at sea. Even in his long\nsoliloquies interspersed throughout the book, Ahab echoes the Shakespearean hero. Melville in this\nmanner makes the parallels between Ahab and his Shakespearean counterparts readily apparent.\nAhab's speech and behaviors further connect him to the Shakespearean hero. Throughout the\nbook, Ahab soliloquizes and speaks in formalized, somewhat archaic English, distinguishing him from the\nother characters. For example, in \"The Symphony\", most of the chapter consists of Ahab delivering long,\neloquent monologues to Starbuck. An excerpt from one of these monologues is reproduced below:\n\"What is it, what nameless, inscrutable, unearthly thing is it; what cozening, hidden lord and\nmaster, and cruel remorseless emperor commands me; that against all natural lovings and\nlongings, I so keep pushing, and crowding, and jamming myself on all the time; recklessly making\nme ready to dowhat in my own proper, natural heart, I durst not so much as dare? Is Ahab,\nAhab? Is it I, God, or who that lifts this arm?\" (536)\nThis type of elevated language is reserved throughout the book for only Ahab. The use of\nmonologue in the book, along with entire scenes narrated entirely in dialogue (the exchange with the\nManxman previously referenced offers a brief example), highlight Ahab's connection to the classical\nEnglish tragic hero.\nThese connections serve to craft a sort of American version of the classic English tragic hero in\nAhab. Echoing the classical Shakespearean tragedy, Ahab blindly forges ahead in his quest to slay Moby\nDick, and, like in the classic Shakespearean tragedy, the prophecies become true. After Fedallah's death,\nAhab sees two \"hearses\": the sinking Pequod, and Moby Dick himself, with \"the half torn body of the\nParsee... lashed round and round to the fish's back... his distended eyes turned full upon old Ahab\" (p.\n560). Following this jarring sight, after a battle with the whale, Ahab's neck is caught by the end of his\nown harpoon, and Moby Dick drags him off into the ocean. During Ahab's final moments, the sailor\n\nTashtego is preoccupied with nailing a flag to the doomed Pequod's mast. Somehow a hawk gets itself\ncaught between Tashtego's hammer and the flag, and, \"his whole captive form folded in the flag of\nAhab, went down with the ship\" (p. 566). Thus we can see that, although the casualties of Ahab's folly\nwere something less than the lives lost in the great battles of Caesar and Macbeth and Lear, Melville has\nattached a great symbolic significance to Ahab's death and the Pequod's sinking. The flag2, and the bird\ncaught between the flag and the ship's sinking mast, are both symbols of Ahab's entire country. This\nsymbolism suggests that the entire American nation is bound to Ahab's folly, and that he is in some\nfigurative sense bringing the country down with him. As with Hamlet's demise, Ahab's death takes on\nthe symbolism of his whole's country's decline.\n\nThe reader can therefore understand that the character of Ahab is designed to represent an\nAmerican version of the classical English tragic hero. Melville portrays England as alternately noble and\nidiotic, much like the Shakespearean tragic hero who alternates between noble motives and bullish,\nwillful ignorance of the ill omens portending their own demise. Through use of the Manxman as a British\nfoil to Ahab's own personality and Ahab's archaic, dramatic language, Melville links Ahab specifically to\nthe Shakespearean tragic hero. Consequently, Ahab's ultimate demise is laden with the lofty significance\nof Shakespearean kings and emperors - when Ahab and his ship sink, his entire country and even\nheaven itself are symbolically dragged down to the depths with him.\n\nReferences\nMelville, Herman. Moby-Dick, or, the Whale. Project Gutenberg, 2001. Accessed through Annotation\nStudio. Web. April 2013.\nMelville, Herman. Moby-Dick, or, the Whale. Edited by Margaret Guroff. Power Moby-Dick. 2008. April\n2013.\n\n2 Although the flag is not specified in the text, it seems reasonable to assume that it is an American flag\n\nShakespeare, William. The Riverside Shakespeare, 2nd Ed. Othello. New York: Harper Collins, 1998. P.\n408-442.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.501 The American Novel: Stranger and Stranger\nSpring 2013\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Becoming Wilderness: A Look at Betrayal in A Mercy",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-501-the-american-novel-stranger-and-stranger-spring-2013/8be95f7131006c7f83516a4d3a013d89_MIT21L_501S13_essay3Samp.pdf",
      "content": "21L.501 Kelley\n5/20/13\nBecoming Wilderness:\nA Look at Betrayal in A Mercy\nA Mercy, Tony Morrison's 2008 bestseller, shares a common theme with most stories:\nlove. The rewards and difficulties of all shades of love-- Parental, romantic, friendly -- are seen\nin the core relationships, from Jacob and Rebecca, Florens and the Blacksmith, Lena and\nRebecca, Will and Scully, and more. However the love in these relationships, and A Mercy as a\nwhole, is overshadowed by what Morrison calls \"the opposite of love\", betrayal. Betrayal she\nsays, \"<Not hatred, but betrayal, the absence or collapse of trust\" is the ultimate pain these\ncharacters feel. Each experience of it redefines these characters in a powerful way. In fact, the\nbetrayals can be marked as the key events in the intertwined history of these people's lives;\nThe betrayals drive drastic change, and are the primary mechanism in the novel. To understand\nhow significant these betrayals are, we will look at their place in the novel in three ways. First,\nwe will find it useful to analyze betrayals as the key events driving the lives of the characters,\nthat is each betrayal marks a distinct period of time in these lives. Next we will look at the\ncomplex nature of A Mercy's betrayals - none of these are as simple as good an evil. Finally, we\nwill look at how these betrayals, and the changes they cause, become a device to highlight class\nand social themes in the story.\nBetrayals drive the action in A Mercy. These moments, so painful for these people, are\nthe primary catalyst for change in their worlds. Specifically, each betrayal redefines core parts\nof their character; change is seen their personalities, their relationships, and most often both.\nFor example, the novel begins and ends with the perceived betrayal of Florens by her\nmother. This decision, the real reasons hidden from Florence, create the unique blend of\nhumility, shame, and romance that doom Florens to fall for the Blacksmith as she does. She is\nconstantly haunted by memories of this rejection. One of the most palpable examples is seen\nin the sinking feeling she experiences when first meeting the Blacksmith's orphan boy, Maliak;\n\"!nd there is another reason, you say; You turn your head; My eyes follow where you look; This\nhappens twice before; The first time it is me peering around my mother's dress hoping for her\n\nhand that is only for her little boy< Now I am seeing a little boy come in holding a corn-husk\ndoll<;\" She immediately relates the impending abandonment to the familiar hurt she's never\nbeen able to let go. Ultimately, after she internalizes and accepts this betrayal by the\nBlacksmith, and as she completes her confession, she again laments this first betrayal, the\ndeterminant of her life; \"I will keep one sadness. That all this time I cannot know what my\nmother is telling me;\" What we see is that Florens life, internal and external, is the result of two\nmajor betrayals. The first sent her to where she would live, work, and ultimately meet the\nBlacksmith; It also created for her the feeling of being \"thrown away\", and with it the insatiable\ndesire for unconditional romance-- her fatal flaw is her dependency. The second betrayal is the\nopposite of the first. Her fantasy of a life with the blacksmith is ruined, and it leaves her unsure\nof her physical future. However, it completes her emotionally. She takes the blacksmiths\ncriticism to heart, and finally comes to peace with who she is; \"See? You are correct; ! minha\nmae too. I am become wilderness but I am also Florens. In full. Unforgiven. Unforgiving. No\nruth, my love. None. Hear me? Slave. Free; I last;\" Ultimately, Florens life can be seen in three\nperiods, partitioned by these defeats.\nBetrayals guide the lives of those around Florens as well. This is particularly clear in the\ndrastic change we see in Rebekkah after Jacob's death; The betrayal's Rebekkah experiences\nare less direct than those Florens faces. First, she is plagued by the repeated tragedy of her\ninfants' deaths; This betrayal, by life and fate, primes her loneliness; !fter Jacob unexpectedly\ndies of smallpox, yet another cruelty played on her, she turns to the narrow religious beliefs of\nher community. She assumes their beliefs and social constructs, driving her to redefine her\nrelationship with Lena, Sorrow, and Florens from one of love to one of cruelty. The betrayals\nagainst Rebekkah, though not as attributable as those of Florens, completely change her\npersonality and life just as much. Other betrayals arise as a result of this too. Particularly,\nRebekkah betrays Lena's loyalty. When the two first met, they were friends and equals in many\nways, struggling to redefine their lives after being displaced (Rebekkah from her country and\nlife, and Lena from an abusive relationship) . Their relationship was built over shared hardships\nand loss, so much so that Lena unequivocally stays loyal to the Vaark's, even after Rebekkah\n\nabuses them. This betrayal, between Rebekkah and her servants, changes the dynamics of their\nrelationship and darkens the future for all these women. We could similarly analyze the\nhardships and betrayals of Sorrow, Jacob, Will and Scully, and the blacksmith and find the same\ntrend. The theme of betrayals as transformative moments can be seen in all of ! Mercy's major\ncharacters.\nThe lifeblood of A Mercy is the stories of betrayal. However, the strength of the message\nisn't just in the pain of these moments, it's in their complexity. Nothing we see in A Mercy is\nblack and white, a case of good versus evil. Rather, as Morrison describes it, every character\nbelieves in what he or she is doing.\n\"The characters have such good intentions and they're not really at fault, except for the\nenvironment in which they live, the social environment, the times, what's available to them.\nTheir efforts to survive collapse in some instances because what they're thinking -- what they\nintend to happen-- is misunderstood or made wrong by other people, or the circumstances of\ntheir lives. These are not wicked people who betray for greed or personal fortune, they simply\nwant a calm --a better-- life, and when things go awry part of it is their misunderstanding and\nmistrust of other people or their own flaws.\"\nThis idea is epitomized by Florens and her mother. What Florens experiences is a sense\nof abandonment, a rejection of her as a person of value and someone to love. The experience\nhaunts and defines her. What her mother felt was a desperate attempt to save her daughter,\nstill too innocent to understand the sexually abusive environment around her; Lena's mother\nknew she had no other way to protect her daughter than to let her go, a painful sacrifice but\none she knew was necessary. Florens memory of it, and her inability to remember what her\nmom told her about it, makes the ordeal particularly painful for the reader, so simultaneously\naware of the love and sacrifice borne by the mother as well as Florens' misunderstanding and\npain.\n\nWe see the complexity again in the blacksmith's rejection of Florens;\n\"Why are you killing me I ask you.\nI want you to go.\nLet me explain.\nNo. Now.\nWhy? Why?\nBecause you are a slave<You have become one<Your head is empty and your body is wild;\nI am adoring you.\n!nd a slave to that too;\"\nThe reader is primed to see Florens side, that of a wildly romantic and repressed girl\ndesperate to have her love reciprocated; However, the blacksmith isn't shallow in his denial;\nInstead, as Florens notices, he has already dedicated himself to raising the orphan child, and his\nlove and concern are first for Maliak. Furthermore, the blacksmith resents Florens as\nrepresenting the vey concept of slavery. He conflates her desperate need for love with the\ninstitution that's been imposed on her; Though we aren't necessarily sympathetic to his choice,\nthe amalgamation of his dedication to Maliak, his aversion to the increasing ranks of bondman,\nand his antipathy for the dependence he sees in Florens, make his mind understandable.\nThe complicated nature of betrayal is seen in Rebekkah's sudden change as well; Her\nsudden unrelenting abuse of her servants, and the deeper betrayal of years of relationships, are\nclearly not the right choices; However, Rebekkah's cruelty isn't from a place of evil but from a\nplace of pain. After the deaths of all her children and husband, she turns to the narrow religious\nbeliefs of the church near her in order to survive. She does this because the center of her old\nlife, her husband and the family that never was, is now a paradigm that's impossible to achieve;\nShe finds a new way to continue her life through her religion. The betrayal then, is an\nunfortunate side effect of Rebekkah readapting her life to fit the definitions of slave and\nmaster, heaven bound and hell bound, that are at the heart of her new beliefs. Despite her\ngrowing and utter disregard for those closest to her, Rebekkah is a tragedy, not a villain. Her\n\nbetrayal, much like the others, is another example of good intentions and a bad environment\ncausing more pain.\nSo far betrayal has given us a way to understand the world Morrison has created; we\nunderstand why and how the characters are forced to change by what happens to them.\nBetrayal though, can offer us even more in this novel. Themes that underlie the story --such as\nracism, slavery, power, and love-- are made apparent by the betrayals; Rebekkah's betrayal of\nthe servants, particularly her close friend Lena, provide a portrait of the master-slave dynamic\nat this point in history. We can the love and loyalty years of being together have created, but\nwe see at least equally the corrupting nature of power and how it leads to abuse. The master-\nservant relationship, and how it relates to race, is explored in the entire lives of the black\ncharacters like Florens The similarities and contrasts between their lives and those of the\nindentured servants, Will and Scully, touch on part of the history Morrison is interested in. That\nis, the concept of slavery, together and separate from race, and how it came to be linked in the\nU.S. Additionally, we see the pain a parent feels in this world through betrayals. Besides Florens\nand her mother, we see Rebekkah and her reaction as a failed mother. We see Lena adopt a\nmotherly relationship with Florens, though this same motherly character drowns Sorrow's first\nborn. Sorrow in particular reforms her life and goals around motherhood. Other facets of love\nare explored as well, such as the difference between romance and relationships. Florens first\nbetrayal comes about as a result of the sexual abuse prevalent in dynamics with such\nunbalanced power. Her experience with the blacksmith is the exact opposite, however, and\ntheir sexual relationship is seen by her as a validation of her as a person. In contrast, Sorrow\ndoesn't or hasn't experienced love or romance in the same way; Physical relationships carry less\nweight for her, though she becomes at least as obsessed with the love of a parent as Florens\ndoes with that of a lover. Jacob and Rebekkah provide another interesting example as well.\nThey were initially matched in a relationship out of mutual convenience and expectation,\nsomething common for the time. However, it grew quickly into an earnest romance,\nunfortunately marred by their continued tragedies. Overall, betrayal as a theme highlights\nmany facets of Morrison's work;\n\nA Mercy is a complex story with complex characters. As the novel progresses many of\nthe characters and relationships are driven to change through the mechanism of betrayals.\nWhether these treacheries occur on personal relationships or ideals, the effects are strong and\nlasting for Morrison's characters; In this way, we can segment the path of the narrative and its\npeople by emotional events, the betrayals, rather than just physical events and the march of\ntime. In short, perhaps\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.501 The American Novel: Stranger and Stranger\nSpring 2013\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Genealogy in Age of Innocence: What’s in a Name?",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-501-the-american-novel-stranger-and-stranger-spring-2013/73c35f55e16b877fa773c4b815f13dde_MIT21L_501S13_essay2Samp.pdf",
      "content": "Genealogy in Age of Innocence:\nWhat's in a Name?\n``You've arranged it delightfully,'' he rejoined, alive to the flatness of the words, but\nimprisoned in the conventional by his consuming desire to be simple and striking.\"\n-Newland Archer, Chapter 9\nThe high class society in Edith Wharton's Age of Innocence rests on two pillars: How you\nact, and who you are. Unfortunately for most of the characters, their choices on how to act in\ntheir world are determined by what family they are born in. In this way, the two pillars--who\nyou are and what you do-- are inextricably connected. This society of bloodlines traps Newland\nArcher into a certain life path, a fate he originally desires but loses interest in when he sees\nEllen boldly reject the same trappings. As Archer struggles under the confines and expectations\nof being well-born this society, the interesting and complex facade the wealthy strive to\nmaintain in their fancy parties and customs collapses piece by piece, for both Archer and the\nreader, into what seem to be the pointless rituals of a barbaric tribe. I will look at the effect of\nthis genealogical perspective in the novel as a descriptor and literary tool, a unique way to give\ninsight into our protagonist's mind, and finally how the names change from simple labels into a\npersonality defining characteristic.\nIn Age of Innocence Wharton uses pronouns and impersonal descriptors like family\nnames to great effect. The most obvious of these are the monikers for her lead characters. Ellen\nOlenska is often referred to as the pale lady, and the antagonistic society as a tribe, or cabal of\nappearance obsessed whisperers. Many times Ellen and !rcher are likened to \"prisoners\", and\ntheir faces wear \"fugitive\" expressions. These nicknames and appellations can have a great\neffect on the visual picture of a scene, but more interestingly, these placeholders show an\nemotional picture of the scene. The repeated description of being a prisoner or fugitive\nsuccinctly connects us to !rcher's sense of being trapped, a sense which is emphasized by his\nbeing surrounded by a band of conspirators. In a similar way, family names become a literary\ndevice to emphasis the elitism of the aristocracy. For example, the names of the wealthy\nfamilies are often reused as first names for members of other families: Newland (Newland\nArcher and the Van Newland family), Dallas (Dallas Archer and the Dallas family), Sillerton\n\nJackson (Mr. Jackson and the Sillerton family), Thorley (Mr. Chivers and the Thorley family),\nLefferts (Widow Mrs. Lefferts Rushworth and the Leffert family), and even many others. This\nnaming convention is never mentioned outright in the novel, though even Archer follows it with\nhis own son Dallas. For the reader not diligently parsing names, the many wealthy families can\nbecome indistinguishable. This stresses the incestuous nature of the aristocracy. Since it's only\nhonorable to marry among one's own class or higher, after many generations the names of the\nwealthy have blended into an amalgamation. Even worse, the reader never hears more of some\nof these distant names, so many of these high class people virtually indistinguishable from the\nnext in their personalities as well as name. Furthermore, the repetition and careless mention by\nArcher for these lists of names impersonalizes them. This can be seen at parties and events like\nthe archery competition, where the guests are nothing more than their names, \"the Lawrence\nLeffertses, Mrs. Lefferts Rushworth (the lovely widow), the Harry Thorleys, the Reggie Chiverses\nand young Morris Dagonet and his wife (who was a van der Luyden).\" These kinds of guest lists\nare repeated, mixed, and remixed throughout the party scenes, and it seems natural as a\nreader to just skip over the lists entirely, since they are all just faceless, often characterless\nnames; consider especially Morris Dagonet's wife in the quote above is first recognized by her\nfamily name, and then her husband's name. This family referencing is a trend of the novel. For\nexample, the novel's start in hapter 2 we see, \"/the young enquirer, a candid Thorley,/\"\ndefending Ellen, and the novels end in hapter 34, \"Mary (who was so like her mother), had\nannounced her engagement to the dullest and most reliable of Reggie hivers' many sons/\".\nBoth these instances again show what is important in this New York. The individuals are\ncharacterless, only of importance as a cog in the greater machine of their family names.\nBeyond the effect on the reader, the confines of genealogy in Wharton's world are seen\nin how it defines characters. The reader may expect that someone's customs, traditions, and\nappearances at social events to be defined by their name and convention, but in Age of\nInnocence it appears a name defines one's very ability to be an individual. It defines the\naspirations, motives, and nearly the entirety of one's behavior. We see this in outward ways - a\ngentleman can only have a select few professions, such as a lawyer, and preferably no real\nprofession at all--and with a closer look, in more subtle internal ways. !rcher's first realizations\n\nabout his fate though are seen in the outer trappings (and traps) of the high class. As he\nmentions, a gentleman can only take a few professions, and working hard is somewhat\nshameful. Those who choose professions to enjoy, such as Emerson Sillerton as a Professor and\nArchaeologist, are outright resented and shunned. Even Newland is surprised by the later\nfreedom his son enjoys in becoming an !rchitect \"The young men nowadays were\nemancipating themselves from the law and business and taking up all sorts of new things.\"\nThroughout the novel, we learn it's shameful to enjoy travelling anywhere besides the\nfashionable parts of Europe, as well as to build your house outside a certain area or to employ\nthe use of certain shades of stone. These specifics are only the tip of the iceberg of the\nexpectations Archer feels pressured to follow. However, the full realization comes when Archer\nsees that it's not just customs being dictated, but his personality as well. The aristocracy around\nhim expects him to have certain likes and dislikes, to react to the opera in a certain way, and\ndislike the choices of others. In fact, most horrifying to Archer, is that even his private\ninteractions with his wife read like a script. When he begins to outwardly express his distress to\nMay, he quickly realizes she begins to coddle him for his worrying and actions just the same\nway May's mother, Mrs. Welland, treats Mr. Welland's penchant for imaginary illness. Here he\nrealizes that May isn't just going through the motions that society demands, but is an active\nparty in maintaining the facade.\nThe people surrounding Archer are driven by their names. The middle and upper class\nfamilies, determined to break into the elite circle, are those most obsessed with the customs\nand form. Two perfect examples are Sillerton Jackson and Lawrence Lefferts, the former as\nobsessed and knowledgeable about bloodlines as the latter is about proper form. These men\nare desperate to maintain and grow their place in the aristocracy by their absolute adherence\nto the customs, though their hypocrisy is equally as obvious in the affairs Lefferts enjoys and\nthe gossip and backstabbing beloved by Jackson. Others, like the eaufort's, are compelled to\nspend grand sums on ballrooms and food to prove themselves, since Julius eaufort's name\nisn't from the elite aristocrats, he had to buy and marry his way in. Indeed, the people that\noriginally shun Ellen for her faux pas and taboo nature are those same upper-middle families\nmost determined to maintain the order for their own benefit. The situation is resolved when\n\nArcher appeals to the most elite couple, the Van Der Luydens. The Van Der Luyden's ability to\ndetermine what is and isn't couth shows that they are much more free to do what they want in\ntheir restrictive culture as a result of their status. In fact their mere association with Ellen saves\nher image, at least initially. We continue to see freedom by those at the top of the ladder. For\nexample, Mrs. Mingott clearly enjoys unpopular views about social customs and house\ndecorum without any reproach. Similarly, we meet the character of Professor Emerson\nSillerton, who outright rejects the customs expected of him--He lives in Newport during the\nWinter!-- and he is greatly resented for it, but nevertheless is begrudgingly kept in good graces\nsolely because he and his wife are from the highest class families, \"when they gave one of their\ndreary annual garden-parties every family on the Cliffs, because of the Sillerton-Pennilow-Dagonet\nconnection, had to draw lots and send an unwilling representative.\" Through this, we see the\nmotives, actions, and beliefs of these characters are guided by their names, and the names of\nthose around them. The highest born enjoy great latitude in their decision making while those\nbelow them struggle to prove themselves and strictly adhere to expected customs. We see a\nname in this society can define the personality of those carrying it.\nIn particular, the reader can glean a unique look into !rcher's mind through this\ngenealogical perspective. We can see how Archer feels about those around him in the way he\nchooses to refer to those characters, and we also see how Archer is struggling with the\nexpectations about himself in this society. As mentioned earlier, Archer has a tendency to refer\nto many characters just by their family name. His disinterested manner and lack of concern\nshow us his mind. These characters are impersonal to him, but they aren't strangers. In fact,\nthey're part of a historical and interconnected wealth of knowledge !rcher has about them and\ntheir name. He can likely guess with relative accuracy many of their hobbies, \"favorite things\",\naspirations, dislikes, and so forth. Even when his daughter marries, to Archer the groom is just\nthe \"dullest and most reliable of Reggie hivers' many sons\". The dismissal of these characters\nin the text is more than just an author's dismissal of minor characters, instead it's of specific\nimportance that Archer dismisses them and doesn't value them. The ultimate result, and a big\npart of what Archer tries to reject, is how much a bloodline defines you personally in this\nuniverse. In the beginning he tries to convince himself that May and the stock life that comes\n\nwith his name are what he wants, but as he falls for Ellen he realizes things could be different\nand grows increasingly dissatisfied with the hypocrisy around him. He begrudgingly plays along,\nwith the help of May explaining away his increasing erratic behavior, while growing increasingly\nrebellious. In one of the many examples of May adapting to his growing outward display of\nsocial narcissism, we see the societal obsession with family again as well.\n\"Newland never seems to look ahead,' Mrs. Welland once ventured to complain to her\ndaughter; and May answered serenely:\n`No; but you see it doesn't matter, because when there's nothing particular to do he\nreads a book.'\n`Ah, yes -- like his father!'' Mrs. Welland agreed, as if allowing for an inherited oddity.\"\nDespite his determination to escape, ultimately Archer is finally trapped by history,\nobligation, and most of all the unassailable determination of May. We readers see that perhaps\nwe, as well as Archer, underestimated May all along. It seems that so much is determined by a\nname, and many of the characters like May are equally determined to keep their lives that way.\nThese characters are completely defined by their genealogy. They are often named and\nreferred only by their genes. Their goals and aspirations, or at least freedom to chase them, can\neven be seen a result of their genes. Those lower born, like the Blenckers, busily maintain the\nexpectations and dream of following atherine Spicer's success in climbing the societal ladder\ndespite their births. At the extreme ends, the minor characters are even void of character, and\nare simply given a name. In this way it seems, they are like cattle, and their name is the brand\nwhich tells of their ownership and bloodline. In the less extreme, Archer sees that the\nimportance of family and decorum has smothered the ability to be an individual. The stifling\nexpectations have drowned out creativity and freedom, and in doing so have crushed the best\npleasures of life. Though he realizes this, he is still ultimately trapped by obligation. His children\nthough, marrying more free, travelling at will, and working at their chosen profession, appear to\nbe able to enjoy all the parts of life he couldn't. Though bloodline and obligation were the end\nall of Newland !rcher's New York, it seems at least, the future was already changing.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.501 The American Novel: Stranger and Stranger\nSpring 2013\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Locations as Characters, A Look at Geography in Moby-Dick",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-501-the-american-novel-stranger-and-stranger-spring-2013/a79c692d9d25833e899713c91380a866_MIT21L_501S13_essay1sam1.pdf",
      "content": "21L.501 Kelley\n3/14/13\nLocations as Characters,\nA Look at Geography in Moby-Dick\nMelville's Moby-Dick is a richly woven psychological masterpiece. Time and again concepts and\ncharacters are deftly paralleled and contrasted. The sheer density and breadth of references spans\nbiblical allusions, a range of mythologies, as well as the geographical knowledge of a learned\ncartographer. One could easily argue there is too much for anyone to fully appreciate without at least a\nfew careful read-throughs. Perhaps Melville's most commonly underappreciated device, however, is his\ncomplex use of geography. His locations don't only represent real world challenges but also states of\nemotion, metaphors for characters and relationships, and metaphysical beliefs. Melville not only uses\nthe location and his active description of it to affect the audience, but deftly utilizes his readers'\npreconceptions and emotional reactions to these locations. Though examples are abound in the novel, I\nwill focus on interpreting Cape Horn as an analogue for the physical and spiritual life of the whalers, and\nhow this idea may be extended to other locations in Moby-Dick.\nMelville's representation of Cape Horn exhibits an interesting dual nature, a place\nsimultaneously filled with dread and death but evoking adventure and honor. Furthermore, this dual\nnature can be seen as an extended metaphor for the life and mind of the seafaring whalers.\nAs a place of danger, Cape Horn is presented in unambiguous terms. This is first seen in Chapter\n3, The Spouter Inn, when Ishmael analyzes the oil painting on the wall. He sees a powerful ship, \"/a\nCape-Horner in a great hurricane; the half-foundered ship weltering there/\" so named a Cape Horner\nbecause it's supposed to be strong enough to make the trip around the coast, though here instead it is\ndestroyed and sinking in the storm. The ship's precise location is unclear--Cape Horn is the only\ngeographical clue-- and the description of the stormy combat scene with a whale in this environment is\ntherefore painted geographically exclusively by Cape Horn. The description reinforces our association of\nCape Horn with majesty and danger, especially for whaling crews who see much danger in their\nprofessions. This association is seen many times throughout the novel, Cape Horn is a place of violence\nand the epitome of a dangerous location for the whalers. For example in Chapter 49, The Hyena, Stubb\nexclaims \"I've lowered for whales from a leaking ship in a gale off Cape Horn\" as a kind of hyperbole to\ndescribe how the act of whaling is always dangerous. What is unclear though, is whether or not the\nstatement is even a joke, or a way to make light of the real danger they exhibit themselves to.\n\nRegardless, Cape Horn represents the standard of danger to these seafarers. Continuing the theme, it\nappears Melville also associates Cape Horn with !hab's madness. In Chapters 19 and 41, we hear of\n\"/that thing that happened to him off Cape Horn/\" when \"/his torn body and gashed soul bled into\none another/\" but upon leaving this part of the ocean \"the old man's delirium seemed left behind him\nwith the Cape Horn swells.\" The cause of !hab's madness is clearly his fateful encounter with Moby\nDick, but his emotions are tied to his location. While he is passing around the stormy seas of cape, he is\nmad for three days and needs to be tied down by the crew. The visual imagery of storms and waves\nraging while Ahab struggles is powerful; and when they move to calmer seas, so does !hab's rage\nsubside. The danger of Cape Horn is always present with the sailors, so much so that they seem to\nassociate danger itself with the Cape, often using it as a metric to judge other situations.\nThe whalers' relationship with Cape Horn is not so simple as a place to fear though, instead the\ntwo capes, Cape Horn and the Cape of Good Hope, act as gateways to the world they want, filled with\nadventures away from land and the West. For these sailors, these capes are their escape. The novel\nseems to emphasize the mystery and excitement of the Pacific Ocean more than anywhere else. Europe\nand the United States are the known world, but also Africa and South America as continents are not\ntreated with much excitement. Instead, the focus of adventure is on the whaling grounds and Islands in\nthe Pacific Ocean. In the time of the Moby-Dick the two capes controlled almost all travel to the Pacific\nfrom the old world. The Suez Canal wasn't opened until around 1870, and the Panama Canal until 1914.\n!dditionally the US Transcontinental Railroad wasn't built until 1869 (The History Channel Website).\nThus, the two capes were the sole obstacles on the only path that separated the Old World from the\nNew. In this sense, The Pequod's crew don't just fear Cape Horn, but see it as a sign of adventure and\nthe connection between their worlds. We see in chapter 2 when Ishmael first sets off he \"/started for\nCape Horn...\" and when he talks of Queequeg's homeland in chapter 10, it's \"twenty thousand miles\nfrom home, by the way of Cape Horn, that is -- which was the only way he could get there -- thrown\namong people as strange to him as though he were in the planet Jupiter.\" !lready we see the Cape as\nthe divider between the known and unknown. In Chaper 16, Peleg criticizes Ishmael for this belief,\n\"Well, what does thou think then of seeing the world? Do ye wish to go round Cape Horn to see any\nmore of it, eh?\" Finally, we see Cape Horn used in reference to all the brave adventures of the past. In\nchapter 24, \"Until the whale fishery rounded Cape Horn,/ scarcely any intercourse but colonial, was\ncarried on between Europe/ and the Pacific Coast.\" Similarly in chapter 101, Ishmael reflects on \"/a\nfine ship, the !melia/ boldly rounded Cape Horn, and was the first among the nations to lower a\n\nwhaleboat of any sort in the great South Sea.\" Here Ishmael emphasizes the adventure and honor of\nthese brave early ships, and we see the crux of their adventures lie in rounding Cape Horn. Even in small\nways throughout the novel, the words Cape Horn are used to describe adventurous and honorable\nendeavors. Perhaps the minutest of these, but a good example, is Ishmael's reference to alcohol\namounts in chapter 3 \"so on to the full glass -- the Cape Horn measure, which you may gulp down for a\nshilling.\" The Cape Horn measure isn't in reference to the fear of Cape Horn, on the contrary it appears\nto represent honor and manhood-- the drinker is best measured by Cape Horn itself. In these passages\nand the context of Moby-Dick, we see that Cape Horn separates the world the sailors want to avoid from\nthe stories they venture to make.\nThe contrasting dual nature of Cape Horn can be seen as a metaphor for the sailors themselves.\nJust as Cape Horn is simultaneously the bane of the seafarers and the gateway to their desires, so are\nthe whalers simultaneously honorable adventurers as well as barbaric and flawed men.\nOn the one hand, the whalers are seen in many ways the pinnacle of humanity. !s we've seen in\nthe passages above, these crews are credited with opening up and exploring the world. In fact, chapter\n82 is titled The Honor and Glory of Whaling, in which many revered heroes and gods are argued to be\nwhalers in one way or another. Furthermore, in multiple chapters we see Ishmael describe the\nexperiences of a whaleship's crew as greater than someone on land is able to attain. References to the\nstrength of the bonds, and even being \"wedded\" are seen during the whale processing chapters. In\nparticular, in Chapter 94 Ishmael laments \"Would that I could keep squeezing that sperm forever!... , I\nhave perceived that in all cases man must eventually lower, or at least shift, his conceit of attainable\nfelicity/. In thoughts of the visions of the night, I saw long rows of angels in paradise, each with his\nhands in a jar of spermaceti.\" !gain Ishmael indicates the superior experience of the seamen, whom in\nthis chapter experience connections and serenity rivaling angels. Perhaps most importantly to the\ncharacters in the novel, it is whalers who are praised for hunting the greatest creature on earth. Though\nthis happens throughout, we see whaling extolled particularly in chapter 24, The Advocate. Ishmael\npraises \"I know a man that, in his lifetime, has taken three hundred and fifty whales. I account that man\nmore honourable than that great captain of antiquity who boasted of taking as many walled towns.\" It's\nvery clear that for Ishmael, and through him to the reader, that whaling is meant to be placed as a\nprofession on honor and heroism, a profession of adventurers, conquerors, and heroes.\n\nHowever, Melville also presents the opposing side of the whalers, the barbaric nature of their\nblood sport. The strongest realization is in Chapter 87, The Grand Armada. Here, instead the whale\nbeing presented as an epic beast, we see \"suspended in those watery vaults, floated the forms of the\nnursing mothers of the whales/ even so did the young of these whales seem looking up towards us, but\nnot at us, as if we were but a bit of Gulfweed in their new-born sight.\" We see now a different\nperspective of the whale; instead of a mythic beast to be conquered, they are serene and peaceful. Not\nonly are they hunted by the whalers, but the young appear too innocent to even understand they should\nbe afraid. Melville contrasts the serenity of this scene with the continuing battle nearby, which\nemphasizes the aggression of the human side. Furthermore, the way the whalers dispose of their prey\nalso echoes barbarism. First the whalers skin blubber off of the whale while it hangs from the side of the\nship where sharks chew at the carcass. The whale is then decapitated to drain the oil. The rest of the\nwhale is then dumped into the ocean unceremoniously, even the edible meat. In contrast to other\n\"savage\" cultures, like the Native !merican's, the whalers don't appear to honor or respect the whale,\nor fully utilize it. Instead it seems, they often mount the head on their ship as a kind of trophy--a\npractice which Ishmael notes unbalances the boat at worst, or at best weighs it down. The evil of the\nwhalers is perhaps best represented by Ahab, who blindly seeks revenge at all costs, with no regard for\nhis crew. In this light, Moby Dick seems to spare The Pequod the first two days of encounters, before\nfinally destroying the ship out of necessity, being given no other chance for peace. In another encounter,\nthe Pequod crew tricks the inexperienced captain of the Rose-Bud into giving them the dead whale,\nwhich contains extremely valuable Ambergris. By the end of the novel, the reader should consider\nwhether the antagonist is Moby Dick, or the whalers led by Ahab.\nThe dual nature of the sailors, whales, and locations add complexity to these characters,\nobscuring their nature from the simple binary of good and evil. Is Cape Horn a deathtrap for sailors, or a\ngateway to their dreams? Are the sailors the pinnacle of man, or murderers? Is Moby Dick the ultimate\nmonster to be conquered, or is he there to punish men for their hubris? This complexity raises many\nquestions in the reader, and is not limited to the examples we've seen.\nMelville creatively combined locations with reader expectations and historic references to\nemphasize and highlight meaning. In particular, much emphasis is placed on locations important to\nwhaling but not necessarily to the world as a whole. The novel often speaks about the Pacific Islands,\noceans, locations like the Cape of Good Hope and the Sunda straits, which are otherwise unimportant\n\nlocations but that are central to Ishmael and !hab's world. Melville thoroughly discusses places\nimportant to whaling, such as the Nantucket and the Isle of Man while locations that may be far more\nimportant to world at large go unmentioned. For example, the modern world around the\nMediterranean is virtually unexplored in the book. Instead, the Mediterranean is mentioned only in\nrelation to the Egyptians, Greeks, and most often the Bible. In this way the Mediterranean of old is far\nmore important to the characters than the modern Mediterranean; it is what the Pacific Ocean is to the\nwhalers-- the center of the adventuring world. In the time of Moby-Dick, the modern Mediterranean in\ncontrast has been conquered and doesn't loom large in the mind of these whalers. This premise of\nexploring how the whalers view different geographic areas is ripe for more analysis. For example, it\nseems most references to the far north use the ancient Greek mythology of \"Hyperborea\", a kind of\nparadise in the north. It seems most people would not associate the frigid ocean and ice of the poles\nwith paradise, however, Ishmael uses just that description many times throughout the novel. This kind\nof respect cues the reader into the mindset of the whalers, and what they hold as important.\nOverall, Melville's text is rich with devices that deepen the reader's understanding of the\nPequod's voyage. In addition to allegorical and literary references, Melville commonly uses locations as\ndescriptors, relying on the reader's preconceptions of these locations as well his own words to form\nmore enriched imagery. Many times these locations take on traits of their own, such as Cape Horn, that\nallow the reader to see how the whalers relate to these locations and the concepts they embody.\nThough Melville may not have intended it, this relationship keeps evolving. After Moby Dick was\npublished, with the opening of the Panama and Suez canals as well as the rapid decline of the whaling\nindustry, his reader's preconceptions have developed differently than in 1851. The reader nowadays can\nlook back with historical context on the coinciding decline of whaling with the declined use of Cape Horn\nto appreciate a different connection between the whalers and their \"gateway to adventure\". Many\nreaders now may have no other associations to Cape Horn than whaling, whereas Melville's\ncontemporaries would have known it as a passenger route, and the primary path for trading. As the\nreader's relationships to these locations keep evolving, so will Melville's ageless text.\n\nWorks Cited\nMelville, Herman. Moby-Dick ,or, the Whale. Edited by Margaret Guroff. Power Moby-Dick. 2008.\nWeb. 13 Mar. 2013\nMelville, Herman. Moby-Dick, or, the Whale. Project Gutenberg, 2001. Accessed through Annotation\nStudio. Web. 13 Mar. 2013\nThe History Channel website. A&E Networks. Web. 13 Mar. 2013\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.501 The American Novel: Stranger and Stranger\nSpring 2013\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Reflection of history in Absalom, Absalom!",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-501-the-american-novel-stranger-and-stranger-spring-2013/b5e49f8fee60a31c30a3bace69c3c406_MIT21L_501S13_essay3Samp2.pdf",
      "content": "Reflection of History in Absalom, Absalom!\nWilliam Faulkner's novel Absalom, Absalom! can be described as an attempt to\nface and understand the problem of race. Retelling Sutpen's story, introduced at the very\nbeginning, is not the purpose of Faulkner's novel. Instead, Faulkner uses Quentin and the\nmultiple narrations to uncover the motives and effects behind the incomprehensible\nevents in Sutpen's story. By delving back in time to rediscover Sutpen's life, Faulkner\neffectively also explores the history of the South when slavery was thriving before the\nCivil War. The simultaneous discovery of the nature of Sutpen's eventual fall and the\ndemise of the antebellum South is no mere coincidence. The tragic events of Sutpen's life\nare representative of the South. Faulkner's exploration of the history of Sutpen's fall and\nthe tragedy of the South contributes to the reflection of both Sutpen's and the South's\nhistories, eventually leading to the discovery of their shared tragic flaw: an ignorance of\nracial prejudice. Faulkner uses the novel's complex narrative structure and Sutpen's\ndesign to reflect on the past and emphasize the unexpected influence, knowledge, and\nperspective that history provides to the present.\n\nThe historical context in Absalom, Absalom!, sets up the framework for the rest of\nFaulkner's novel. In a sense, history is being told over and over again by way of Sutpen's\nstory, passed down many generations. Quentin claims that Rosa wants the story told \"so\nthat people whom she will never see and whose names she will never hear and who have\nnever heard her name nor seen her face will read it and know at last why God let us lose\nthe War,\" (6). This quote directly connects Sutpen's story to the history of the South.\nRosa seems to want Sutpen's story to survive so that readers in the future can learn from\nhis fatal flaw of dividing people based on class and race that resulted in Sutpen's fall and\n\nthe loss of slavery. To explore the cause of this fall, Faulkner uses multiple narrations of\nthe same story to instigate emotions in the readers so they are more involved in the\nconflict and are part of the hunt for answers as the novel deciphers the history of Sutpen,\nand at the same time, the history of the South. Along with the details that are uncovered\ncomes unreliability as the narrators interpret the story each in a different way. Because of\nthis, the story of Sutpen is not completely known, nor will it ever be because Sutpen is\nnot alive to tell it himself. The nature of Sutpen's history can be generalized to the South.\nStories from the South about slavery and aristocracy cannot be completely understood\nbecause no matter how many perspectives we see through, our view is still limited, just as\nwe are with Faulkner's novel. Thus, Faulkner seems to use Sutpen's story and the\nstructure of his novel to suggest that though history can provide explanations for present\nevents, our knowledge of the past is limited, and we can only try to learn more by\nrecreating the missing history ourselves, just as the narrators in Absalom, Absalom! do.\nFaulkner further strengthens the connection between Sutpen and the South when\nhe reconstructs Sutpen's past through the narration of Quentin's father, Mr. Compson.\nThe motive behind Sutpen's desire to become rich and well settled comes from his\nsudden exposure to the \"country all divided and fixed and neat with a people living on it\nall divided and fixed neat because of what color their skin happened to be and what they\nhappened to own,\" (179). In his childhood, living in the territory, which eventually will\nbecome West Virginia, Sutpen is surrounded by a community in which \"the land\nbelong[s] to anybody and everybody\" (179), and where \"the only colored people [are]\nIndians,\" (179). The Indians are only looked at \"over rifle sights\" (179), already creating\na barrier between classes of people. Sutpen's early life points to the earliest South that\n\ninitially instilled racial bias and prejudice. After Sutpen is turned away from the front\ndoor of a rich white family's mansion, he discovers his innocence about class differences\nand stays \"quite calm\" (189), thinking about what he can do to fix his living and compete\nagainst his innocence. He concludes that he needs \"land and niggers and a fine house to\ncombat [the other whites],\" (192) thus beginning his life-long quest to achieve wealth and\npower of his own. By investigating Sutpen's past, readers also steal a glance at the early\nhuman bias and mentality that gradually grows into the Southern lifestyle ripe with racial\nand class prejudice. Faulkner's emphasis on the early history of the South seems to\nreiterate the point that this history and pattern of removal or separation of a race, such as\nthe Indians, and class resentment arising from early communities creates characters like\nSutpen. Sutpen is a mirror image of the South and is not only a portrayal of the Southern\ncustoms, but also is an actual product of the Southern principles.\n\nBecause Sutpen builds his plan upon the principles of the Southern aristocracy, by\nsocial division between humans, he is doomed to fail from the very beginning of his plan.\nHowever, Sutpen does not realize his mistake and repeats to himself that to accomplish\nhis design, all he needed was \"money, a house, a plantation, slaves, a family--\nincidentally of course, a wife,\" (212). Sutpen does indeed attain all of what he set out to\ndo, but falters at the end because of his tendency to overlook the racial prejudice that\nprevails throughout society just as class divisions do. Sutpen and the Southern\ncommunity both underestimate the effect of racial injustice, leading to the falls of both\nSutpen and the foundational principles of slavery in the South after the Civil War. Racial\nprejudice haunts Sutpen from the very beginning. The major turning point in the novel\nwhere this racial bias is brought to light is when Sutpen leaves his first wife and son\n\nbecause they may have some negro blood, \"a fact which [he] did not learn until after [his]\nson was born,\" (212). Even though Sutpen now has a son to carry on his legacy, he does\nnot consider it a fortune, but only considers \"these wasted years\" (212). Sutpen's ease of\nbetrayal of his son and wife as he \"merely explain[s] how this new fact rendered it\nimpossible that this woman and child be incorporated in [his] design,\" (212) is his crucial\nmistake. Sutpen's hamartia of intolerance for mixed race triggers the inevitable domino\neffect of Sutpen's fall, similar to that of a tragic hero. He willingly sacrifices his family,\nplantation, and heir all because of an unsuitable race. His grand design eventually fails\nbecause his plan is based on personal gain and is not considerate of any others,\nparalleling the mentality of the South. The ignorance of the racial divisions in society that\nproduce reverberating effects is the cause of the South's fall after the Civil War, and is\nalso the cause of Sutpen's demise. Sutpen's past comes hunting when Henry, his second\nson, meets Bon. Once Bon decides to marry Judith, Sutpen takes drastic actions to\ndestroy his past son, metaphorically trying to erase his history. Faulkner never allows his\nreaders to forget Sutpen's immoral act as the murder of Bon backfires and destroys\nSutpen's whole design; Sutpen never produces a son who lives and loses most of his\nplantation. From this, Faulkner's emphatically suggests that history cannot be deleted, but\nrather serves as a constant reminder for the present.\n\nThis constant reminder is what tortures Quentin as he inherits the chaos of his\npast. Though he doesn't realize it until the end when Shreve asks him why he hates the\nSouth, Quentin experiences a reflection on the South as he hears the multiple recounts of\nSutpen's story. Through these versions, his previous notion of his home in the south is\neffectively destroyed, and instead Quentin sees a new South that is strange to him. He\n\ncan't fathom the immoral and unjust acts that Sutpen and the South built their\nfoundations on, and hence questions his love for his home. In reply to Shreve's question\nat the end of the novel, Quentin immediately replies and repeats to himself, \"I don't hate\nit,\" (303) as if trying to remind himself that he can't hate the South because that is where\nhis origins lie. However, Quentin really has come to question the South's principles by\nreflecting back on Sutpen's, and thereby the South's history. By ending with Quentin's\nreflective thoughts, Faulkner seems to pose an open challenge to readers to reflect back\nand reinterpret history so they can experience the unexpected and find the power to\nunderstand, learn from, and accept the past.\n\nWorks Cited\nFaulkner, William. Absalom, Absalom!. New York: Vintage International, 1986. Print.\nWorks Consulted\nLevins, Lynn G. \"The Four Narrative Perspectives in \"Absalom, Absalom!\". PMLA.\n85.1 (1970): 35-47. JSTOR. Web. 12 May. 2013.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.501 The American Novel: Stranger and Stranger\nSpring 2013\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Resources for Mapping Moby-Dick in Locast",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-501-the-american-novel-stranger-and-stranger-spring-2013/4ee9f78867238c4030ecf44662858673_MIT21L_501S13_essay1.pdf",
      "content": "21L501 Stranger and Stranger [American Novel]\nResources for Mapping Moby-Dick in Locast\n\nEssay 1: Mapping Melville Due session 11\nFor this essay, you will explore Melville's imagination of a vast space, the geographical\nworld of Moby-Dick. Using a digital mapping tool called Locast\n(http://locast.mit.edu/melville) and a database of Melville's place names keyed to the\nLongman Critical Edition of the text, you will choose a geographical location or region\nthat interests you. Use Annotation Studio (http://annotationstudio.mit.edu/) to search\nMoby-Dick and annotate relevant place names, adding comments, images, and links to\nuseful online materials. You will then create a \"cast,\" or small collection of images, video\nclips, and comments, to upload to Locast, to populate the class's map of Melville's world,\nand to share with the class on session 11. Your essay for this project will reflect on the\nsignificance of Melville's references to the location you chose in Moby-Dick, focusing on\nparticular passages in the text.\n\nChecklist\n1. Register for Locast at the address above and at Annotation Studio if you have not\nalready done so.\n2. As you read Moby-Dick note geographical locations that figure in Melville's text\nin striking ways. Use the textual notes in the Longman edition to identify\nunfamiliar names and places. Search the Excel spreadsheet provided and the\nLocast map to see how often and where these names appear in the novel. Note\nMelville's use of language in significant passages where geographical locations\nappear. Use these tools to select the region that interests you most and will give\nyou rich materials to explore for your project.\n3. Use the Annotation Studio text to search, comment on, and make connections\nwithin the novel.\n4. Create a \"cast\" within Locast. Upload suitable content, using the resources below\nas a starting point.\n5. Your cast should contain at least one example of three different media:\na. visual images (18th or 19th-century maps, fine arts, illustrations;\nphotography)\nb. video (clips from YouTube stock footage or other reputable academic,\nmuseum, library, film, or television sources; yourself or an interview\nsubject speaking on your topic)\nc. written comments in the Locast comment box (including the passage(s) in\nMoby-Dick where your location appears and captions/bibliography for\nyour materials). You may also link to useful books or articles.\n6. You will present your cast briefly (5 minutes) in class on session 11 and submit\nyour essay that evening.\n\nResources\n\n1. Museum Collections\na. Hart Nautical Collection, MIT:\nhttp://web.mit.edu/museum/collections/nautical_list.html\nb. New Bedford Whaling Museum, New Bedford, MA:\nhttp://www.whalingmuseum.org/explore/collections/database. See also the\nPurrington and Russell Grand Panorama of a Whaling Voyage 'Round the\nWorld http://www.whalingmuseum.org/explore/collections/panorama\nc. Mystic Seaport: The Museum of America and the Sea:\nhttp://www.mysticseaport.org/index.cfm?fuseaction=home.viewPage&pag\ne_id=1\nd. Peabody Essex Museum, Salem, MA: http://www.pem.org/collections/\n2. YouTube Stock Footage: http://www.youtube.com/user/FootageForFree. See also\nclips from film versions of Moby-Dick.\n3. Research Support\na. Hart Nautical Collection, MIT: Kurt Hasselbalch\nb. New Bedford Whaling Museum:\ni. General Information: Mark Procknik\nii. Images, photos: Michael Lapides\niii. Maps: Michael P. Dyer\nc. MIT Libraries: Mark Szarko\n4. Technical Support\na. Locast: Amar Boghani\nb. Annotation Studio: Jamie Folsom, Ayse Gursoy\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.501 The American Novel: Stranger and Stranger\nSpring 2013\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}