{
  "course_name": "The Supernatural in Music, Literature and Culture",
  "course_description": "This course explores the relationship between music and the supernatural, focusing on the social history and context of supernatural beliefs as reflected in key literary and musical works from 1600 to the present. It provides an understanding of the place of ambiguity and the role of interpretation in culture, science and art. Great works of art by Shakespeare, Verdi, Goethe (in translation), Gounod, Henry James and Benjamin Britten are explored, as well as readings from the most recent scholarship on magic and the supernatural.",
  "topics": [
    "Fine Arts",
    "Music",
    "Humanities",
    "Literature",
    "Classics",
    "Fine Arts",
    "Music",
    "Humanities",
    "Literature",
    "Classics"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nPrerequisites\n\nThere are no prerequisites for this course.\n\nCourse Overview\n\nThis class focusses on beliefs and practices about the supernatural, and their reflection in literature and music. The semester is divided into three sections, concerned with:\n\nWitchcraft Beliefs and Witch Hunting\n\nSpecial attention to the great European witch hunt of the 15\nth\nthrough 18\nth\ncenturies: Shakespeare's\nMacbeth\n; Purcell's\nDido and Aeneas\n; Verdi's\nMacbeth\n; Kurosawa's Throne\nof Blood\n.\n\nLearned Magic\n\nMagic and science in early modem Europe: Goethe's\nFaust;\nLiszt's\nA Faust Symphony\n;\n\nBerlioz's\nSymphonie Fantastique;\nMurnau's\nFaust\n.\n\nGhosts and Spirit Contact\n\nSpiritualism and ghosts in 19\nth\ncentury America: James's\nThe Turn of the Screw\n;\n\nBritten's\nThe Turn of the Screw\n.\n\nEmphasis falls on\nweekly listening and reading assignments\n. There will be live performances by staff members, other faculty, and outside musicians and actors. Film adaptations and opera videos will be screened in the evening.\n\nClass Requirements\n\nEssay Writing\n\nA total of 20 pages divided into three papers (one with required revision and expansion).\n\nClass Participation\n\nAs part of the\nCI\nrequirement of this class, students are required to attend lectures and recitations and to participate actively. At least one hour per week will be devoted to discussion.\n\nOral Presentations\n\nAt the end of the semester, several class sessions will be devoted to preparing and delivering oral presentations on aspects of the works considered in the last third of the course. Earlier group and / or individual presentations will be assigned to help prepare students for this component of the class.\n\nThere is no final exam\n\nEnrollment\n\n21M.013J / 21A.113J / 21L.013J is both a\nHASS-D\nand\nCI-HASS\nsubject. This means that each recitation can accept a maximum of 18 students. Priority is given to students who are registered in the class through the\nHASS-D\nlottery, but these students must attend the first two recitation meetings to keep their place in the class. Additional students may enter the class, so long as there are open slots, through the second week of classes.\n\nRequired Texts\n\nShakespeare, William.\nThe Tragedy of Macbeth\n. Oxford University Press, 1998. ISBN: 9780192834171.\n\nGoethe, Johann Wolfgang von.\nGoethe's Faust\n. Translated and with an Introduction by William Kaufmann. Anchor Books, 1962. ISBN: 9780385031141.\n\nJames, Henry.\nThe Turn of the Screw\n. 2nd ed. Edited by Deborah Esch, and Jonathan Warren. W. W. Norton & Company, 1999. ISBN: 9780393959048.\n\nFor additional readings, see the\nReadings\nsection.\n\nAssignments\n\nStudents are required to write three essays, the first of which will require a revision and expansion. In addition, students will work on a final project with both an oral and written component.\n\nFor further detail, see the\nAssignments\nsection.\n\nAttendance\n\nAttendance is required. Because there is no final exam, students who miss class for any reason will be required to write a two-page summary of the material covered that day.\n\nCourse Grade\n\nThe individual recitation instructors give the grades in this class, adhering to the following percentages:\n\nACTIVITIES\n\nPERCENTAGES\n\nEssays\n\n50%\n\nOral contributions to recitation and oral presentations\n\n50%",
  "files": [
    {
      "category": "Resource",
      "title": "21M.013J The Supernatural in Music: Literature and Culture: Essay 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-013j-the-supernatural-in-music-literature-and-culture-fall-2013/e516b30bb7120527c914592b4fce4f06_MIT21M_013JF13_Essay_1.pdf",
      "content": "21A.201/21L.013/21M.013 ESSAY 1\nTOPIC: What are the witches in Shakespeare's Macbeth?\nWe've read a number of accounts of what witches were believed to be in early modern Europe,\nranging from people who had really signed a demonic contract giving them real powers, to\npeople whose supposed powers existed solely in the mind of an observer convinced and deluded\nby \"fables\" (untrue but persuasive stories). We've also read several accounts of why and how\npeople came to believe in the existence of a phenomenon that really didn't exist, as well as (in the\nOxford introduction) some accounts of illusion-making in visual art and theater of the period.\nThese should give you some context for reflecting on this deceptively simple question about this\nplay by an author the body of whose work, as Greenblatt shows, exploits the whole range of\npossibilities available to him with respect to whether witchcraft \"really\" existed or not. What is it\nthat exists when these witches are on the page, or the stage, or lurking in the margins or the\nwings while the drama proceeds?\nGreenblatt's essay focuses attention on things that dwell on or cross the boundary between\nexistence only in our imagination and apparent existence in external reality (\"Shakespeare\nBewitched,\" 124). In Macbeth, that boundary between fantasy and reality, between things\nactually present and things that are only a figure of speech, a hallucination, a staged\nperformance, or a play on words (equivocation), seems especially porous. (Remember Hecate's\nplan to use her powers to create \"illusion\"!). That means that questions about \"what is X?\" also\nimply questions about how we, or other observers, know about X. How are we convinced of\nsomething's objective existence or nonexistence, or about its nature? Through what we see?\nThrough what we hear? Can we trust those forms of evidence, or are they susceptible to\nmanipulation and failure? Of course, an idea can have its own reality in the sense that it exercises\npower over our thoughts and actions; fictions can also be powerful without making truth claims.\nFORMAT: We would appreciate receiving your essay as a Word, Rich Text, or PDF file; other\nformats are sometimes illegible. Essays should be double-spaced with 1\" margins (see\n\"Formatting your essay\" for important details on how to quote sources).\n\nCONSULTATION: Please visit us during office hours. We would also be happy to spend some\ntime in class addressing general questions about writing in general or this assignment in\nparticular; think about what you would like to learn in this domain as well as about clarifying our\nexpectations.\nSPECS: Your essay should be 1500-1700 words, and will be due Friday, 10/5, at 11:59 pm. Late\nsubmission will be reflected in your grade.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21M.013J / 21A.113J / 21L.013J The Supernatural in Music, Literature and Culture\nFall 2013\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "21M.013J The Supernatural in Music: Literature and Culture: Essay 2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-013j-the-supernatural-in-music-literature-and-culture-fall-2013/38edafe1fe52a0e6bde20091c1189e4a_MIT21M_013JF13_Essay_2.pdf",
      "content": "21A.201/21L.013/21M.013 Topics for Essay 2.\n\nWe would like to propose three possible topics for your second essay, which will be focused on\nthe Faust material from Marlowe through Murnau. While Goethe's Faust should be central to the\nessay, we would like to see a comparative element in the essay, which may range simply from\nreference to alternative handlings of key moments, speeches, or characters to a full-on\ncomparison between two treatments of the material.\n1. We began this section of the class with readings and lectures focusing on the history of\nlearned magic in Europe: alchemy, astrology, and necromancy in particular. What is the role of\nlearning in the Faust material we've read and heard - do these various versions of the story really\nengage with the idea of the learned magician, and how? (NOTE: If you think Faust's learning\nsimply a pretext to get the story going this probably won't be the right topic for you). What are\nthe possibilities attached to learning? What are the constraints? Where is learning positioned in\nsociety? What are the trade-offs associated with learning? Then there's magic. Is it reliable or\nnot? Real or illusory? Natural or demonic? Permitted or forbidden? Obscure or easy? You might\nalso think about how the figure of the learned magician has evolved over the intervening\ncenturies: what issues and questions from Medieval and Renaissance magic are still present for\nus today, particularly in the techno-scientific context we inhabit at MIT?\n\n2. Liszt, like Verdi, condenses a complex literary text into the interplay between three rich\ncharacters: here, Faust, Mephisto, and Gretchen/Marguerite. Pick a piece of text that you feel\nsums up something important about one of the characters. Begin with that exercise: explain (of\ncourse) why this passage strikes you as important, and use close reading as a way into talking\nabout the ingredients that make up the character you've chosen as your focus. As this character\nmoves through the story, and migrates from Goethe to Murnau or Liszt, what changes and what\nstays the same?\n\n3. Does the Gretchen material simply hijack the story about ritual magic, and turn it into\nsomething else? Perhaps there's a way of thinking about Gretchen as the \"outside\" of learned\nmagic - and thus, in relation to it, helping define it in terms of what it excludes. As we learned\nfrom Tara Nummedal, not all alchemists were male. Yet the social context of Renaissance\neducation in its communal and public forms (schools, monasteries, and universities) was almost\nentirely masculine. Perhaps Benevuto Cellini's request to the demons that they enable him to be\nreunited with his distant girlfriend (Maxwell-Stuart, 14) was not the hasty, random idea he\nthought it was! Throughout the Faust material, we see the idea that learned magicians use their\npainfully acquired magical power in order to summon or pay court to women. Indeed, we might\nsay that learned magic excludes women only to summon them back through art. What kinds of\nthings do the female figures that appear in the Faust materials -- Helen, Gretchen, the various\nwitches and servant girls in Goethe - represent? What do they allow the narrators to talk about or\nmake happen? (Note: if your answer is \"love\", or \"sex,\" what do those represent or make\nhappen?) Consider also the conclusion of Part II, incorporated by Liszt as the choral conclusion\nto his Faust symphony: \"the Eternal Feminine leads us ever higher.\" What in the world does that\nmean?\n\nDue Friday, 11/15 (extensions to 11/18 by prior request only). Length: 6 pp./ 1600 words.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21M.013J / 21A.113J / 21L.013J The Supernatural in Music, Literature and Culture\nFall 2013\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "21M.013J The Supernatural in Music: Literature and Culture: Essay 3",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-013j-the-supernatural-in-music-literature-and-culture-fall-2013/684d8b79c0e502b5842253114430d5d1_MIT21M_013JF13_Essay_3.pdf",
      "content": "21A.201/21L.013/21M.013 FINAL PROJECT\nFor the last few weeks of the semester, you'll be working in groups on a final project that has\nboth an oral and written component. The project will focus on materials for the last segment of\nthe class: that is, either on Benjamin Britten's opera, The Turn of the Screw, or on Henry James'\nnovel of the same title and its context in the culture of his time. (Thus, some topics deal\npredominantly with literature, some with music, and others with social history).\nThe oral component of the project will be a series of class presentations taking place on the last\ntwo days of the semester. We will assign topics for these presentations, and they will involve\nsome degree of reading beyond the primary sources in James and Britten/Piper. You should\nexpect to spend some time as a group planning and assigning tasks for the presentation, some\ntime discussing your ideas (either virtually or in person), and you should also count on actually\nrehearsing the presentation at least once in order to be polished on the day. Using visual and\nother media is optional but certainly a possibility in our wired classroom; we leave that up to\nyou. Your group presentation should take up about 20 minutes, followed by about 10 minutes of\ndiscussion, which you will also lead.\nThe written component of the project will be an informal report, roughly 6 pages in length. (By\n\"informal,\" we mean to indicate something in the style of a journal; we do not expect anything as\nlabor-intensive as the earlier, formal essays). This report should consist of two things: 1/ an\naccount of your own work in preparing for the presentation (research, reflection, process),\npossibly including questions or ideas that there may not have been time to incorporate in the\nactual presentation; 2/ some concluding reflections on the work we've done together this\nsemester. In particular, think about this question: why has the supernatural remained of interest\nin our culture?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21M.013J / 21A.113J / 21L.013J The Supernatural in Music, Literature and Culture\nFall 2013\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "21M.013J The Supernatural in Music: Literature and Culture: Format Your Essay",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-013j-the-supernatural-in-music-literature-and-culture-fall-2013/d701bff744652d03bc5ff38f79868d80_MIT21M_013JF13_FormatEssay.pdf",
      "content": "Title, format, quotation.\n\nHow to title your paper:\nYour essay should have a fairly specific title - one which will suggest what is most interesting or\nimportant about what you have to say. It's worth taking a little thought over the title, not only\nbecause it creates the first impression of your essay (that, too); coming up with a phrase which\nencapsulates your argument can help in focusing that argument. One popular strategy, and not a\nbad one, is to use a key phrase from the text followed by another phrase of clarification. (E.g.: \"I\nconjure you\": who are the real witches in Macbeth?\").\n\nHow to format your paper:\nTyped/printed, double-spaced, 1\" margins (note: Microsoft Word automatically sets margins to\n1.25\". Change them in \"Page Setup\" on the \"File\" menu). Paragraphs indented 5 spaces at left;\ndo not separate paragraphs by extra blank lines. Quotations of 10 words or less should be\nintegrated into the text; longer quotations should be indented 5 spaces at left and right margins,\nsingle spaced, and set off from the text of the essay by a blank line before and after the\nquotation. (Please see examples below).\n\nHow to quote:\nThe MOST IMPORTANT THING about quotations, besides that you should be using them as\nevidence: when you put text from the play into one of your sentences, the grammar must\nwork. Page down to 3/ for an example of what not to do.\n\nShort Quotation (2 kinds)\n1/ Macduff responds to Malcolm's challenge to respond to the murder in a manly way by\nasserting: \"I shall do so\" (Macbeth, 4.3.220).\n\n2/ When Malcolm tells Macduff that he should respond to the murder of his wife and\nchildren \"like a man,\" Macduff's telling response is that he must \"also feel it like a man\" (italics\nmine; 4.3.219, 221).\n\nNOTE 1: The first time you quote the play, include the title. If you're using an edition different\nfrom the Oxford, please provide information about it either in your \"Works Cited\" list or in a\nfootnote to your first quotation of the play.\nNOTE 2: When the quotation is integrated into your own sentence, as in example 2 -- your word\n\"he\" is the grammatical subject of Shakespeare's verb \"feel\" -- make sure the grammar works.\nTo check whether it does, remove the quotation marks and see if the sentence looks right.\n\nDon't do this:\n3/ When Malcolm tells Macduff that he should respond to the murder of his wife and children\n\"like a man,\" Macduff states \"also feel it like a man\" (italics mine; 4.3.219, 221).\n\nNOTE 3: Two things are wrong here. The grammar does not work, because \"feel\" needs a\nsubject; and Macduff is unlikely to be uttering this line in the dispassionate tone suggested by\n\"states\".\n\nLong Quotation\nHere I am, writing along in my essay, along and along and along. Here comes a long\nquotation (longer than 10 words) from Steven Greenblatt's article on Shakespeare and witchcraft;\nGreenblatt argues that\n[t]he demonic in Shakespeare's early history play [I Henry VI] makes history\nhappen... the witches in Macbeth by contrast account for nothing\" (\"Shakespeare\nBewitched,\" 122).\n\n(Notice that I've used brackets for anything that alters Greenblatt's sentence, and used an ellipsis\nto skip over some details that I didn't need). Okay, quotation's over; if I'm using the \"Works\nCited\" format, I'm done, and if I'm using footnotes, I would footnote full information for the\nsource the first time and cite it parenthetically after that - as in the example above. Back to the\nessay now, with double-spacing and regular margins again. If I decided to include a longer\nquotation from the play, it would look like this:\nMacduff. I cannot but remember such things were\nThat were most precious to me; did Heaven look on,\nAnd would not take their part? (4.3.222-24).\n\nOne other thing: anytime you include a long chunk of text, be sure to talk about its details and\nwhat, specifically, we should understand from reading it. If there is not enough to say, the\nquotation should probably be shorter.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21M.013J / 21A.113J / 21L.013J The Supernatural in Music, Literature and Culture\nFall 2013\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "21M.013J The Supernatural in Music, Literature and Culture: Special Collections Booklist",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-013j-the-supernatural-in-music-literature-and-culture-fall-2013/78cce113fc4a4125b3c2bd6104a15927_MIT21M_013JF13_Spec_Coll.pdf",
      "content": "Special Collections: early modern books\n\nConiuratio malignorum spirituum in corporibus hominum existentium prout in\nSancto Petro\nRome, ca. 1486-1487\nBX2340.C66 1486\nExorcism manual; no t.p. or info. Marginalia. Ephemeral,\nunbound, probably meant to be carried around by priests.\nFundamental belief in the existence of an invisible, supernatural\nworld, here including demons/malign spirits. Cites Scripture for\nauthoritative accounts of demons and exorcism. (NB: rites for\nsummoning and expelling demons not dissimilar; cf. Black Mass).\n\nMagica de spectris et apparitionibus spiritu[m]\nLeiden, 1656\nBF1520.M34 1656\nMagic of spectres, foretelling the future. Woman w/ cauldron,\ndemons. List of authorities - really pulling on ancient works to\nvalidate idea that this exists. In Latin - not for \"vulgar\" audience, all\nabout learnedness. P. 68 bottom, story via prognostication via the\nhead of an infant.\n\nde Vallemont, M.L.L.\nLa physique occulte ou traite de la baguette divinatoire\nAmsterdam, 1683\nTreatise on dowsing (using stick to find water, AND minerals,\nhidden treasure, thieves and murderers). Part of [natural]\nphilosophy, i.e. science, it works because \"particles\" are given off by\nsubterranean water, etc. Investigated by Royal Society, Robert Boyle\nexpresses wish for research on topic. Reported in Transactions of the\nRoyal Society. Described not as demonic, but natural. People don't\nbelieve there are unknown things in nature, and thus so many stupid\nfables re sorcerers, and belief those who knew a little Greek or\nHebrew were magic, or that mathematical figures had magical force.\nJust because we haven't understood the mechanism does not mean\nit is magic. Image: calculating correct time for cutting dowsing\nstick, in relation to movements of celestial bodies that influence the\nearth. Not superstition, but observations based on experience!\n\nNewton, Isaac\nThe book of Nicholas Flamel\n(Manuscript), ca. 1690-1699\nQD25.F613 1690z\nAn alchemical book, published in Paris in 1613 as Livre des figures\nhieroglypiques and in London in 1624 as Exposition of the\nHieroglyphical Figures was attributed to Flamel.[5] It is a collection\nof designs purportedly commissioned by Flamel for a tympanum at\nthe Cimetiere des Innocents in Paris, long disappeared at the time\nthe work was published. In the publisher's introduction Flamel's\nsearch for the philosopher's stone was described. According to that\nintroduction, Flamel had made it his life's work to understand the\ntext of a mysterious 21-page book he had purchased. The\nintroduction claims that, around 1378, he travelled to Spain for\nassistance with translation. On the way back, he reported that he\nmet a sage, who identified Flamel's book as being a copy of the\noriginal Book of Abramelin the Mage. With this knowledge, over the\nnext few years, Flamel and his wife allegedly decoded enough of the\nbook to successfully replicate its recipe for the Philosopher's Stone,\nproducing first silver in 1382, and then gold.\n\nBaxter, Richard\nThe certainty of the worlds of spirits\nLondon, 1691\nBF1445.B39 1691\nhttp://library.mit.edu/item/001759652\nProves immortality of souls and malices of devils (cp. Exorcism\nmanual). Scriptural quotes on t.p. A3 seeing devils would not bring\nour Atheists to believe in God (on why they are normally invisible),\nand rest of us believe by faith anyway. Contents list: contemporary\nand classical instances of witchcraft, catholic frauds, devil worship,\ndemons having sex with women, good angels, etc. \"Multitudes\"\nrefuse to believe \"fullest evidence\" of spiritual world. See p. 42 IX.\nRe what counts as \"certain and full\" example of witchcraft\n(involving stones that could be seen and exactly described,\ntestimony of Boyle and Earl of Shmptn, holograph narrative by\nminister).\n\nHauber, Eberhard David\nBibliotheca, acta et scripta magica (vol. 1 only)\nLemgo, Germany, 1739-1745\nBF1547.H38 1739\nCompendium of stuff. Witch undergoing trial by drowning; Dr.\nFaustus; Gorgon of Augsburg terrifies Attila's army (fear of naked\nold woman).\n\nAlbert, Petit\nSecrets merveilleux de la magie naturelle & cabalistique\nLyon, 1743\nBF1602.A43 1743\n\"wonderful secrets of nature.\" Distillation. Recipe for perfume for\nSaturday, under Saturn (use to seek minerals on that day). Also,\nconciliate gnomes when looking for metal. Wear a talisman\n(instructions for preparing, image + words in Greek).\n\nBarrett, Francis\nThe magus, or, Celestial intelligencer\nLondon, 1801\nBF1611.B37 1801\nhttp://library.mit.edu/item/001988325\nA grimoire, or book of how to do magic; note also involved with\n\"science\", magnetism, theology (fall of man) - as well as alchemy,\nmaking talismans, conjuring spirits. Fruit of laborious research into\n\"curious and rare\" knowledge, includes \"rare experiments.\"\nRhetoric of impartiality.\n\nBooks on spiritualism\n\nCahagnet, Louis Alphonse\nThe celestial telegraph, or, Secrets of the life to come revealed through magnetism\nLondon, ca. 1850\nBF1292.C34 1850\nTitle says it all.\n\nHammond, Charles\nPhilosophy of the spirit-world\nNew York, 1853\nBF1251.H36 1853\nText delivered to a minister acting as a medium.\n\nPrichard, John\nA few sober words about table-talk and table-spirits, and the Rev. N.S.\nGodfrey's incantations\nLondon, 1853\nBF1375.P75 1853\nFellow, Royal College of Surgeons; a very amusing pamphlet by a\nskeptic. T.p. cites Macbeth. Also refers to the Franklin sceance\ndescribed in pamphlet\n\nDods, John Bovee\nSpirit manifestations examined and explained\nNew York, 1854\nBF1042.D63 1854\n\nWilson, Robert P.\nDiscourses from the spirit-world\nNew York, 1855\nBF1291.W55 1855\nAlso dictated to a minister medium. Part of P&B series re\nspiritualism.\n\nHare, Robert\nExperimental investigation of the spirit manifestations\nNew York, 1856\nBT961.H37 1856\nBy MD and professor of chemistry. \"Doctrine of the spirit world\"\nincluding heaven and hell. Apparatus for testing supposed\nmanifestations.\n\nCrosland, Mrs. Newton\nLight in the valley\nLondon, 1857\nBF1251.C76 1857\nAppeal to \"just and dispassionate\" audience who can look beyond\n\"preconceived ideas and opinions\" to consider evidence, which she\nhas \"rigidly\" examined.\n\nZerffi, Gustavus George\nSpiritualism and animal magnetism\nLondon, 1871\nBF1031.Z47 1871\n\nCrookes, William\nResearches in the phenomena of spiritualism\nLondon, 1874\nBF1371.C76 1874\n\nAppendix contains accounts of seances; reprint from scientific\njournal. Excited re use of photography and electric light (new\ntechnologies) to test a supposed medium.\n\n[Anonymous]\nConfessions of a medium\nLondon, 1882\nBF1283.Z9.C66 1882\n\nZollner, Johann Karl Friedrich\nTranscendental physics\nLondon, 1885\nBF1383.Z66513 1885\nSpiritualism must be regarded as \"a simple question of evidence,\"\npresented here by well-known German scientists and academics.\n\n[Serial publication]:\nSociety for Psychical Research (Great Britain)\nProceedings\nLondon, 1883-1907\nBF1011.S63 (all volumes will be on display); but see vol. I re the\naims (\"objects\") of the SPR.\n\n[Set of 5 pamphlets]:\n1. \"Letters on table-moving\" by A.B. (1853)\n2. \"A practical investigation into the truth of clairvoyance\" by\nAn Unprejudiced Observer (1854). Medium produces\ninformation about the fate of the lost Arctic explorer, Sir\nJohn Franklin.\n3. \"Le spiritisme envisage et refute ... \" par P. Fumeaux S.J.\n(1865)\n4. \"Psychic force and modern spiritualism\" by William\nCrookes (1871)\n5. \"Table moving, with directions how to experiment\" by\nNicholls (1873)\nBF1272.C65 1833 (items 1-5)\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21M.013J / 21A.113J / 21L.013J The Supernatural in Music, Literature and Culture\nFall 2013\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "21M.013J The Supernatural in Music: Literature and Culture: Beginner's Guide",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-013j-the-supernatural-in-music-literature-and-culture-fall-2013/3e175a881e9a3450f771d6bd7572d525_MIT21M_013JF13_Begnrs_Gde.pdf",
      "content": "A Beginner's Guide to the Supernatural in Music: \"Macbeth\" and \"Symphonie\nfantastique\"\nThe following elements of music are often used by composers to signify the presence of\nthe Supernatural.\nTHE NORMATIVE: In general, supernatural elements in music are expressed as\ndeviations from well-known norms. In essence the supernatural is suggested by the extent\nto which it fails to conform to basic musical types or topoi. This can be established\nuniquely within the context of an individual work, or can be seen in the comparison of\nother, sometimes only vaguely similar works. Important musical ideas, like 'dissonance'\nare often best defined as deviations from the normative 'consonance\".\nMELODY\n>melodies that use unusual and/or dissonant intervals. Intervals are the distances between\nindividual notes. This may be a feature of the use of a minor key (see HARMONY\nbelow.) as well. In Verdi's \"Macbeth\" the half-step, (the smallest interval) plays a\ndominant role, and seems to symbolize evil. The tritone, the 'devil in music\" also features\nvery prominently in the witches \"e il nostro oracolo\"in their second chorus, and in many\nother places as well.\n>melodies that feature chromaticism. \"Extra\" pitches not part of the basic sonic set of the\npiece. Rather like \"blue notes\" in Jazz. The chromatic scale often signifies something\namiss.\n>grotesque use of grace notes and other ornamental musical figures.\n>monotone, or melodies that use only a single pitch. There are many example of this in\n\"Macbeth\", very early instance being the prophesy to Banco at the beginning of Act I.\n>melodies that are related to folksong or to exotic cultures.\nHARMONY\n>the use of a minor key or tonality. In the witches chorus \"S'allontanrono\" the first part\nis in minor. This emphasizes the witches' evil intent. When Verdi shifts of major for the\nfinal section we sense the witches delight in the havoc they create.\n>the use of the highly dissonant, and tension-filled diminished chord. It is made up of\ntwo interlocking tritones!\n>chromaticism. The addition, for expressive purposes, of harmonies not generally present\nin the given key.\n> the use of movement from chord to chord that defies the standard and accepted rules of\nharmonic motion. The witches three-fold \"Salve, 0 Macbetto\" is an instance of this.\nRHYTHM\n>ostinato. The incessant use of a constant repeated rhythmic pattern. This can be very\nquick or the slow and relentless pulse of a funeral march. In Verdi's \"Macbeth\" the music\nof the witches continually employs these repetitive rhythms. They are often dance-like\nand suggest a grotesque orgiastic frenzy. They are also closely related to the music Verdi\nuses for gypsy characters. At there heart related to Italian peasant dances, they none-the\nless clearly represent the \"other\" in musical terms.\n\n> use of unusual or rarely encountered rhythmic patterns, or groupings of rhythmic\npatterns (meter)\n>syncopation. In this effect, beats---within a given measure or musical unit---which\nwould not normally be emphasized are accented/emphasized. This is an indispensable\ntool for any composer.\nTEXTURE\n>in the music of the 19th century a melody and accompaniment texture is the norm. In\nspite of the normative quality of this texture, remember that accompanimental ideas can\nbe extremely subtle and sophisticated. The can also be exploited as a means of vividly\ndepicting emotions or concepts with the musical work. (see TONE & TEXT -PAINTING\nbelow). A typical example of this texture is found in Lady's cavatina \"Vieni! t'affretta!\"\nin Act I.\n>drastic reductions of texture, often to just a single sustained tone, can have dramatic\nimplications. Monophonic texture is rare and usually important. Note that the Prelude to\n\"Macbeth\" begins with haunted, bare octaves.\n>the use of hymn-like homophony can be used ironically. We see this in the Finale to Act\nI of \"Macbeth\" where Lady and Macbeth piously lament the king they have just slain.\nThe use of the a cappella texture (without instruments) in variably suggests the\nperforming traditions of sacred music.\n>Imitative polyphony/fugue. This most elaborate of textures is used in \"Macbeth\" to\nsuggest the confusion of the battle in Act III. However, this texture is traditionally\nassociated with the music of the church. Hence Berlioz's choice of this \"blasphemous\"\ntexture for the Witches orgy that concludes \"Symphonie fantastique\".\nTIMBRE\n>This element of music focuses on the very nature of the sounds themselves. Are they\nshrill and piercing, or low and growling? Are they more 'noise\" than music? The more\nunusual the sonic \"color\", or more tied to literal depiction of the unsettling (the hooting\nof owls in both Verdi and Berlioz), the more likely they are to prove identifiers of the\nsupernatural. Think about the use of a bell in both the Verdi and Berlioz works. This\nunique and immediately recognizable sound is little more than a realistic stage effect in\n\"Macbeth\" but it is very much more in \"Symphony fantastique\".\n>sudden very loud or very quiet sounds.\n>... silence ... Note that this can also be a component of RHYTHM.\n>sound effects like thunder and lightning. The military drum roll that announces the\nentrance of Macbeth and Banco is an obvious example, and Verdi begins act one with the\nmusical depiction of thunder and lightning. Part of the magic of the Introduction to the\nlast movement of \"Symphony fantastique\" is that mere effects are transformed into\nmusical material.\nTEXT AND/OR TONE-PAINTING\n>in text-painting the way in which the sung text is set actually reflects some important\naspect of the text. For example, the word \"hell\"could be expected to be sung on a low\npitch, while heaven would be a high one. We see this continually, from Purcell's\ndissonant harmony for the word' hate\" through innumerable examples in \"Alcina\". Text\npainting is central to the art of the Baroque composer, and remains key for Romantics\nlike Verdi as well.\n\n>in tone-painting the non-texted instrumental music depicts an idea or concept.\nRemember the pounding hoof -beats of the horse in Schubert's setting of Goethe's\n\"Erlkonig\"?\nFORM\n>this is one of the most complex elements to relate to the supernatural, largely because\nwe hear form through a subtle web of cultural contexts and references. Think of the\nABA \"da capo\" form that is central to \"opera seria\" as exemplified by Handel.In the early\npart of Verdi's career the typical Italian operatic form was made up of an instrumental\nintroduction followed by recitative, a slow, flowing and lyrical vocal solo, then a\ntransition section with dramatic and narrative aspects that lead directly into a lively and\nornate final section. When Lady Macbeth employs this form in her opening scene we\ncertainly understand her as a \"Queenly\" character---far removed from the peasant\nvulgarity of much of the witches choruses. A very interesting subversion of this formal\npattern occurs in Banco's scene before the Finale of Act II. Here Verdi begins the\nformula---introduction and recitative followed by the slow \"Cavatina\". In the ensuing\ndramatic interlude Banco is murdered and Fleance flees. Now Verdi poignantly omits the\nfast and showy final \"Cabaletta\", as Banco is now dead. The fact that the final movement\nof Berlioz's \"Symphony fantastique\" is not in any 'standard\" form is significant; clearly\nthe composer is rejecting the \"natural\" for the supernatural.\nMENUDU JOUR\n\"Now good digestion wait on appetite, And health on both\"\nMacbeth 3.4.37\n-Appetizer\nMusical signifiers of the Supernatural\nNumerous piquant and exotic offerings will be sampled. (Eye of\nnewt-market price). Served with a flute of Witches Brew '666 or a glass of Hell Gate\nPorter.\n-Main Dish\nVerdi's \"Macbeth\"\nMaggot-pie (3.4.128) thickened with \"grease that's sweaten From the\nmurderer's gibbet.\"(4.1.29). Not recommend for those prone to insomnia. Served with a\nLacryma Christi '09\n-Dessert (serves two)\n\"Symphonie fantastique\" by Berlioz\nWarning: this Romantic treat is liable to go bad rather quickly. The initial\nsweetness is followed by a bitter aftertaste. Best paired with Laudanum, Absinthe or Bile.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21M.013J / 21A.113J / 21L.013J The Supernatural in Music, Literature and Culture\nFall 2013\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "21M.013J The Supernatural in Music: Literature and Culture: Faust Guide",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-013j-the-supernatural-in-music-literature-and-culture-fall-2013/764dd8540ab4447bf328d0e4256e5e7e_MIT21M_013JF13_Ft19_Och_Msc.pdf",
      "content": "FAUST & 19TH CENTURY ORCHESTRAL MUSIC\nLA FAUST SYMPHONY (1856)\nFRANZ LISZT (1811 -1886)\nIn Three Character-pictures\nFor Tenor, Male Chorus and Orchestra\n>Dedicated to Berlioz.\n>Composed during Liszt's years of service as court composer to the Duchy of Weimar.\nLiszt's patron at Weimar was the grandson of Goethe's Duke, and he specifically\nengaged the composer to restore the Duchy to the artistic prestige it had enjoyed under\nhis ancestor.\n>A cyclic symphony, with Liszt's characteristic \"thematic transformation\".\nI. FAUST\n>Five main musical ideas:\na. Faust the Magician (0:01). Atonal -adrift from the regulated universe of\ntraditional tonal harmony. Fully chromatic---after the first note all twelve of the\npossible musical tones are heard. Use of the \"mysterious\" augmented chord in a\nmelodic form.\nb.\"Doubt\" (0:35). A large dissonant interval begins this idea. Also extremely\nchromatic.\nc.\"Passion\" (4:29). Fast and agitated. Largely based on a descending chromatic\nscale.\nd.\"Love\" (9:05). This music has a clear, Romantic (and romantic) affect. Much\nslower and very lyrical. Note its close thematic similarity to the \"Doubt\" motive.\ne.\"Pride\" (11: 10). Noble and heroic. Not dissonant and much less chromatic. The\nrhythm of this motive is associated by some scholars with the words \"In Anfang\nwar die Tat\" (\"In the beginning was the deed\").\n>A vast and imaginative movement that seeks to portray the breadth and\ninconsistencies of Faust's personality.\n> The first two ideas are presented in what musicians hear as an \"Introduction\". Recall\nthat the final movement of Berlioz's \"Fantastic Symphony\" all so begins with a\nmysterious, seemingly inchoate introduction that is also highly chromatic and\nengaged in the depiction of creepy, supernatural elements.\n>Ideas\" COO ,\"d\", and\" e\" form the \"exposition\" of a symphonic sonata form\nmovement. This is followed by a free fantasia on all of the themes that culminate in\nthe return of the \"Introduction\". The final part, called a \"recapitulation\" revisits \"c\",\n\"d\" and \"e\". If you are not an experienced listener this can be hard to hear, but keep\nin mind that for our purpose it is not essential.\n> Wild shifts in tempo and meter. Even the \"Love\" music employs alternating triple\nand quadruple meters!\nSupplement: J.s.Bach, \"Prelude in A minor\" from WTC book II (chromaticism)\n2. GRETCHEN\n\n> Though very rich harmonically, this movement is much less chromatic in general\nthan those that surround it.\n>A vast ABA form. >A brief and fragile sounding introduction for flutes and\nclarinets.\n> The \"A\" section is made up of two themes for Gretchen. The first is a lyrical oboe\nsolo accompanied by the murmuring \"spinning\" of the violas (1:16). A brief\ntransition famously illustrates the plucked flower petals of \"he loves me, he loves me\nnot\" (4:27). The second is closely related, but is notable for a more chordal texture\n(6:51). Perhaps this homophonic texture suggests church music and prayer. There is a\nmore dramatic middle section-\"B\" (9:03)-- in which Faust's themes appear more\nand more insistently and which culminates in his song of seduction. The \"A\" section,\nmuch altered, returns (15: 12). Note just before the end an isolated fragment that\nsounds like a lullaby (21:15). Is Liszt delicately hinting at Gretchen's pregnancy?\nSupplement: Franz Schubert, \"Gretchen am Spinnrade\" (a musical depiction of the\nspinning wheel)\n3. MEPHISTOPHELES\n>As Mephisto is the \"spirit of negation\" he has no musical \"themes\" of his own, but\nis rather depicted through ideas that are parodistic deformations of Faust's themes.\n>Again there is an introduction, and again its focus on the grotesque invites\ncomparison to the last movement of the Berlioz. The movement proper begins at\n(1;15).\n>Most of the music is dance-like. Clearly Liszt is composing a vast witche's orgy, a\nvast Walpurgis Night.\n> The form is quite free, though elements of sonata form are present, but the effect is\nthat is is freely composed.\n>Note grotesque, brutal and highly chromatic fugue that is based mostly on the\n\"Doubt\" theme (4:15). Like the fugue in Berlioz this too suggests a blasphemous\nrevision of a style associated with sacred music. It also as the most complex and\narcane of music styles, and evokes the Faust-like \"magic\" of old Bach.\n>Climactic reappearance of the first \"Gretchen\" theme from the second movement\n(8:29). Note that it cannot be deformed. Mephisto tries to draw Faust back into the\norgy, but he resists and will insist of rescuing Gretchen. As the intensity subsides only\nfragments of \"Gretchen\" music remain---surely this is Liszt's equivalent to the prison\nscene (13: 12). Musically there is a clear sense of catastrophe, and the grotesque\ntheme seems to pull at the Magic/Faust theme is such away that one can imagine\nMephisto's panic as he tries to persuade Faust to abandon the cell. Does the orchestra\nsuggest the announcement of Gretchen's salvation with the slow descending scales\nrepresenting the roses that fall from heaven? Originally in 1853 Liszt ended the\nmovement with a triumphant presentation of the \"Pride\" theme.\n>In 1856 Liszt added the final section (16: 11). This is music of enormous\nexpansiveness; so slow in it's unfolding that the listener loses all sense of time. The\nmale chorus and solo tenor sing the final line of Goethe's poem as the music\ngradually becomes ever more ethereal.\n\nSupplement: J.S .Bach, \"Fugue in G minor\" from WTC book I (exposition only; a\nclear easy-to-hear example of Fugue)\n\"All things transitory\n\"Alles Vergangliche\nare but parable;\n1st nur ein Gleichnis;\nhere insufficiency\nDas Unzulangliche\nbecomes fulfillment,\nHier wird's Ereignis;\nhere the indescribable\nDas Unbeschreibliche\nis accomplished;\nHier ist's getan;\nthe eternal feminine\nDas Ewig-Weibliche\ndraws us heavenward.\"\nZieht uns hinan.\"\nGoethe, Faust Part II, final lines\nII.ALSO SPRACH ZARATHUSTRA (1896)\nRICHARD STRAUSS (1864-1949)\nTone Poem for large orchestra after F.W.Nietsche\n> The opening section has in recent years become one of the most famous passages in the\nrepertoire. It is designed to depict the rising of the sun. Note the almost total lack of\nchromaticism and the very limited use of dissonance in general.\n>the section we will briefly explore is labeled in the score as \"Science\". It is a fugue, and\nlike the first of the \"Faust\" themes in Liszt's symphony it uses all twelve of the musical\nnotes.\n>In the end it is entirely unsatisfactory. This is exactly Nietzsche's and Strauss's point.\nIII. L'APPRENTI SORCIER (1897)\nPAUL DUKAS (1865-1935)\nScherzo d' apres use ballade de Goethe)\n>Based on another poem by Goethe, this time a comic one.\n>After an introduction, the piece employs a fairly straightforward ABA form.\n>Note the prominent use of our friend the augmented triad, now used in a harmonic form.\n>Enjoy the Mouse!\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21M.013J / 21A.113J / 21L.013J The Supernatural in Music, Literature and Culture\nFall 2013\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "21M.013J The Supernatural in Music: Literature and Culture: Guide for Britten's Turn of the Screw",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-013j-the-supernatural-in-music-literature-and-culture-fall-2013/cf7e53b8ac8114e1c5bd8fe607dc359c_MIT21M_013JF13_Gde_fr_Brten.pdf",
      "content": "BRITTEN'S TURN OF THE SCREW: A BASIC GUIDE\n1. The Theme and Variation Structure\na. Each scene is preceded by a variation, which tends to introduce the\npredominant musical material of that scene.\nb. Britten associates each variation with a further \"turn\" or tightening of the\nscrew\nc. The theme is based on the pitches, A-D-B-E-C#-F#-D#-G#-F-Bb-G-C,\nand uses all 12 notes of the Western scale. This gives it an intense, highly\nchromatic quality. (Act I; track 2)\nd. It may be significant to note that the Theme is made up of intervals that\nare either \"perfect\" (4ths and 5ths) or \"imperfect\" (3rds and 6ths). Does\nthis suggest the inevitable destruction of innocence?\n2. The Malo Theme\na. The \"hauntingly\" memorable theme first sung by Miles, and associated\nwith him. (Act I; Track 7; 2' 18\")\nb. Note that this theme is made up almost entirely of the \"imperfect\" thirds.\nc. It may be reasonable to suggest that Britten identifies closely with Miles.\nWhen the melody is first heard it is accompanied by the viola, a favorite of\nthe composer and an instrument that he played regularly, particularly as a\nchild. Though Miles may well have been taught the song by Quint, note\nthat when queried by the Governess's he claims, \"I found it. I like it. Do\nyou\". Surely a most succinct description of the composer's creative\nprocess.\n3. Borrowed Music/Borrowed Texts\na. \"Lavender's Blue\" (Act I; track 4; 2' 19\")\nb. ''Tom, Tom the Piper's Son\" (Act I; track 6; 32\")\nc. \"Anglican church Music\" (Act II; track 2; 50\")\nd. \"The classical piano concerto\" (Act II; track 6)\ne. Borrowed texts; Latin mnemonics in the schoolroom, The Book of\nCommon Prayer, and Yeats\n4. The Sonic World of the Ghosts.\na. The use of the celesta (Act I; track 7)-a keyboard instruments in which\nthe hammers strike metal bars, creating an enchanting bell-like sound. An\ninstruments of fairly modern origin, it was first used by Tchaikovsky in\n''The Dance of the Sugarplum Fairy\" in ''The Nutcracker\".\nb. Note that the instrumental music of the Ghost's is enormously strange and\nattractive, not unlike the seductive music of the Erl-king\nc. Highly elaborate and virtuosic singing. (Act II; track 1; 6:40)\nd. Britten specifically asked the librettist to provide words for the Ghost's to\nsing, insisting that ghostly \"moaning\" would render the opera ridiculous.\nNote: Timings are keyed to the Naxos recording.\n\nThe Cast\nThe Prologue .......Tenor\nThe Governess .....Soprano\nMiles ................Boy Soprano\nFlora.................Soprano\nQuint. .............. .Tenor\nMiss Jessel .........Soprano\nACT I\nPrologue\nTenor/narrator. Piano accompaniment\nTheme\nPresented most simply and audibly by the Piano, then grows into a musical\ndepiction of the rattling of the coach in which the Governess travels to Bly.\nScene 1: The Journey\nMusically related to the \"coach\" music. The Governess's speech-like music is\nsupported mostly the timpani or kettledrums.\nVariation I\nTheme presented most audibly in the strings with dense build up or colors in the\nother instruments. The music suggests the excitement of both the children and the\nadults at the Governess's arrival at Bly.\nScene 2: The Welcome\nThe harp plays a prominent role. Note the descending gesture that depicts Mile's\nformal bow, and the ascending gesture that accompanies Flora's curtsies.\nVariation II\nThe Theme is most easily heard in the lower string parts, though it is also\nfragmented in a dialogue between the wind instruments and the upper strings.\nScene 3: The Letter\nA scene of dialogue between the Governess and Mrs. Grosse. Note the first\nappearance of the characteristic sound of the celesta). Viola-Britten's own\ninstrument-- is prominently featured. Quotation of the folksong \"Lavender's\nblue\" .\nVariation III\nOut door music, with the flute, oboe and clarinet transforming the Theme into\nbirdsong.\nScene 4: The Tower\nMusically continuous with the previous variation. Quint/celesta appears on the\ntower.\nVariation IV\n\nAgitated repeated notes in the plucked strings. The Theme is most prominent in\nthe piano and bass.\nScene 5: The Window\nThe children quote the familiar nursery tune, \"Tom, Tom the Piper's Son\" to an\norchestral accompaniment that suggests a military (cavalry---the children are on\nhobby horses) march. The celesta marks the appearance of Quint at the window.\nVariation V\nBrisk and bustling. The Theme is obscured and very hard to hear in the complex\nfugue-like texture. This music reflects the growing anxiety of the Governess and\nthe learned counterpoint sets up the schoolroom scene.\nScene 6: The Lesson\nThe first half of the scene focuses on Mile's recitation of his Latin lessons. I\ncareful look at the Latin text is revelatory. The second half of this pivotal scene is\nMiles \"Malo\" song (.This is the simplest most melodically intriguing music of the\nopera. it is simply accompanied by harp, viola (again Britten's instrument) and\nthe English horn, in spite of its name a kind of tenor oboe!\nVariation VI\nAnother outdoor scene with the winds perhaps representing the shimmer of the\nlake on a sleepy summer afternoon. The plucked strings play versions of the\nTheme.\nScene 7:The Lake\nContinues the atmosphere of the previous music. The appearance of Miss Jessel\ndispels the idyllic quality.\nVariation VII\nMysterious nocturnal music, with the Theme prominently displayed in the horn.\nQuint's celesta is a constant presecence.\nScene 8: At Night\nNote the utter sensuousness of the Ghost's music: the melismatic singing is\nextraordinary and the celesta adds it characteristic glamour.\nACT II\nVariation VIII\nThis serves as the introduction to Act II. The musical ideas seem to sum up what\nhas come before. Note particularly Quint's florid melisma played on the clarinet.\nAll of the instruments get characteristic cadenzas; the relationship to the Theme\ncan be quite obscure.\nScene 1: Colloquy and Soliloquy\nThis begins as a duet for the Ghosts and features a climactic presentation of the\nYeat's \"Ceremony of Innocence\" line in a particularly extraordinary version of\nthe Ghost music. The scene ends with the Governess's singing \"Lost in my\nlabyrinth\" in music of an extremely unsettled, labyrinthine character.\nVariation IX\nThe Theme is most apparent in the bells, which introduce the following scene\nwith its clear evocation of Sunday morning in the Churchyard\n\nScene 2: The Bells\nTextual quotation from the Anglican liturgy, though the music is Britten's own.\nBoth are later deformed or parodied by the children. The bell music eventually\ntakes on a quite \"mad\" quality and the wheezy sound of the village organ is also\nsuggested.\nVariation X\nThe string and piano present the Theme, with rushing woodwinds above.\nScene 3: Miss Jessel\nThis scene is haunted by the sound of the flute and harp. In particular the simple\ntriadic accompaniment figure (Do, mi, sol) that is associated with Miss Jessel's\nanguish is a compelling illustration of obsession. Though which governess is\nobsessed? The scene ends with a vivid musical depiction of the Governess hastily\nscribbling her letter to the children's uncle.\nVariation XI\nThe alto flute and bass clarinet provide a florid canonic duet based on the Theme.\nScene 4: the Bedroom\nThe canonic textures continue obsessively throughout the scene. The sounds are\nusually very dark and oddly colored.\nVariation XII\nNote that the unseen Quint is present throughout this variation. Plucked strings\ncharacterize most of the music.\nScene 5: Quint\nIn this tiny scene Miles, at Quint's apparent urging steals the Governess's letter.\nVariation XIII\nA kind of mock classical piano concerto with Miles at the keyboard. Conventional\nMozartean accompanimental pattern (Alberti bass) supports odd melodies based\non the Theme.\nScene 5: The Piano\nThe concerto continues becoming ever more elaborate and disconcerting. Note\nthat when Flora \"enchants\" Mrs. Grosse Mile's is playing Quint's celesta music on the\npiano.\nVariation XIV\nHere the piano concerto reaches its grandiose and grotesque climax with heavy\nchords. The Theme is in the orchestra, and is a radically slowed down version.\nScene 7: Flora\nFull textures and dramatic\nVariation XV\nVery brief, with important solos for flute and timpani. Enormous dynamic range.\nScene 8 Miles\nQuint's celesta music is powerful presence, and the theme, no longer just\ncontained in the Variations proper, plays an important role, underpinning the\nscene. Note that at the climax Mile shouts rather than sings. Much of what the\nGoverness sings is \"infected \"with the Theme, and the Malo theme is used with\npoignant and tragic irony.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21M.013J / 21A.113J / 21L.013J The Supernatural in Music, Literature and Culture\nFall 2013\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "21M.013J The Supernatural in Music: Literature and Culture: Puppet Play Excepts",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-013j-the-supernatural-in-music-literature-and-culture-fall-2013/281445b25f97d5d2b3b2ebb5abc66222_MIT21M_013JF13_PupPly_excpt.pdf",
      "content": "The following material is in the public domain.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21M.013J / 21A.113J / 21L.013J The Supernatural in Music, Literature and Culture\nFall 2013\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}