{
  "course_name": "The Anthropology of Cybercultures",
  "course_description": "This course explores a range of contemporary scholarship oriented to the study of ‘cybercultures,’ with a focus on research inspired by ethnographic and more broadly anthropological perspectives. Taking anthropology as a resource for cultural critique, the course will be organized through a set of readings chosen to illustrate central topics concerning the cultural and material practices that comprise digital technologies. We’ll examine social histories of automata and automation; the trope of the ‘cyber’ and its origins in the emergence of cybernetics during the last century; cybergeographies and politics; robots, agents and humanlike machines; bioinformatics and artificial life; online sociality and the cyborg imaginary; ubiquitous and mobile computing; ethnographies of research and development; and geeks, gamers and hacktivists. We’ll close by considering the implications for all of these topics of emerging reconceptualizations of sociomaterial relations, informed by feminist science and technology studies.",
  "topics": [
    "Fine Arts",
    "Media Studies",
    "Digital Media",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology",
    "Ethnography",
    "Fine Arts",
    "Media Studies",
    "Digital Media",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology",
    "Ethnography"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 3 hours / session\n\nOverview\n\nThis course explores a range of contemporary scholarship oriented to the study of 'cybercultures,' with a focus on research inspired by ethnographic and more broadly anthropological perspectives. Taking anthropology as a resource for cultural critique, the course will be organized through a set of readings chosen to illustrate central topics concerning the cultural and material practices that comprise digital technologies. We'll examine social histories of automata and automation; the trope of the 'cyber' and its origins in the emergence of cybernetics during the last century; cyber geographies and politics; robots, agents and humanlike machines; bioinformatics and artificial life; online sociality and the cyborg imaginary; ubiquitous and mobile computing; ethnographies of research and development; and geeks, gamers and hactivists. We'll close by considering the implications for all of these topics of emerging reconceptualizations of sociomaterial relations, informed by feminist science and technology studies.\n\nTeaching Approach\n\nThe course will be conducted as a graduate reading seminar - with contextualizing comments by the instructor followed by student-led discussion of readings. Each week two students will be asked to lead the discussion. Active participation in discussions based on reading, related studies and/or experiences is expected. Be sure to bring marked-up copies of required readings to class.\n\nEach week we'll discuss the\nrequired readings\nintensively and in relation to each other. The emphasis here is on careful reading rather than quantity; that is, the assignments are not extensive in terms of pages so that you have time to read closely and think about what you're reading. There are also\nsupplementary readings\nprovided for each week that you can draw on for your Final Projects (see\nAssignments\n).\n\nOn-line Facilities\n\nSee the class Web site for required readings and other course materials, as well as updates from the instructor through out the term.\n\nTexts\n\nRequired readings will be made available on the\nclass Web site\n, however these are books that we'll be drawing from that would make good additions to your library if you're interested in these topics.\n\nRequired\n\nAdam, Alison. \"The Knowing Subject in AI.\" Chapter 3 in\nArtificial Knowing: Gender and the Thinking Machine\n. New York, NY: Routledge, 1998. ISBN: 9780415129626.\n\nBoellstorff, Tom.\nComing of Age in Second Life\n. Princeton, NJ: Princeton University Press, 2008, chapter 1, pp. 3-31 and chapter 4, pp. 89-117. ISBN: 9780691135281.\n\nHayles, N. Katherine.\nHow We Became Posthuman: Virtual Bodies in Cybernetics, Literature, and Informatics\n. Chicago, IL: University of Chicago Press, 1999. ISBN: 9780226321462. See especially chapter 4, 'Liberal Subjectivity Imperiled: Norbert Wiener and Cybernetic Anxiety'.\n\nKelty, Christopher.\nTwo Bits: The Cultural Significance of Free Software\n. Durham, NC: Duke University Press, 2008, introduction, pp. 1-23; chapter 2, pp. 64-94. ISBN: 9780822342649.\n\nOrr, Jackie. Chapter 3 in\nPanic Diaries: A Genealogy of Panic Disorder\n. Durham, NC: Duke University Press, 2006, pp. 79-164. ISBN: 9780822336235.\n\nFox Keller, Evelyn. \"Booting up Baby.\" In Riskin, J.\nGenesis Redux: Essays in the History and Philosophy of Artificial Life\n. Chicago, IL: University of Chicago Press, 2007, pp. 334-345. ISBN: 9780226720814.\n\nTaylor, T. L.\nPlay Between Worlds: Exploring Online Gaming Culture\n. Cambridge, MA: MIT Press, 2009, introduction, pp. 1-19; chapter 4, pp. 93-124. ISBN: 9780262512626.\n\nRecommended\n\nEdwards, Paul.\nThe Closed World: Computers and the Politics of Discourse in Cold War America\n. Cambridge, MA: MIT Press, 1997. ISBN: 9780262550284.\n\nHelmreich, Stefan.\nSilicon Second Nature: Culturing Artificial Life in a Digital World\n. Berkeley, CA: University of California Press, 2000. ISBN: 9780520208001.\n\nKember, Sarah.\nCyberfeminism and Artificial Life\n. London, England: Routledge, 2003. ISBN: 9780415240260.\n\nSuchman, Lucy.\nHuman-Machine Reconfigurations\n. Cambridge, UK: Cambridge University Press, 2007. ISBN: 9780521675888. See especially chapters 12 and 13.\n\nTurkle, Sherry.\nThe Second Self: Computers and the Human Spirit (20th anniversary edition)\n. Cambridge, MA: MIT Press, 2005. ISBN: 9780262701112.\n\nEvaluation\n\nGrading for the course will be done through a portfolio consisting of:\n\nResponse to Readings\n\nEach week you will be asked to write a one-page response to the required readings,\nconcluding with questions or topics for discussion\n. These will be discussed in the seminar and distributed to other members of the class via the class Web site. (20% of mark).\n\nOral Presentation\n\nEach student will give one 15-minute seminar presentation during the term, based on a their final project-in-progress (see item 3). The aim of this presentation will be to give co-participants in the seminar a sense of the project (its materials, references and arguments) and to get helpful feedback toward its completion (20% of mark).\n\nFinal Project\n\nPaper (15-20 pages) to be handed in before class on Week #13.The paper will report on a research project chosen from one of the three options described below. Students are encouraged to develop projects that contribute to their wider graduate work-in-progress (60% of mark).",
  "files": [
    {
      "category": "Resource",
      "title": "Alternative Narratives of Nighttime and Illumination: An Exploration of Central Square in Cambridge, MA",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-850j-the-anthropology-of-cybercultures-spring-2009/77e58131babf341fbcb3ae65cc8da94a_MIT21A_850Js09_sw02.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n21A.850J / STS.484J The Anthropology of Cybercultures\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nMay 15, 2009 (modified for OCW)\n21A.850/STS.484 Anthropology of Cybercultures\nAlternative Narratives of Nighttime and Illumination:\nAn Exploration of Central Square in Cambridge, MA\nCentral Square Theater illuminated signage.1\nIntroduction\nThe histories and experiences of nighttime and illumination are entangled in myriad ways. In some\ncases, illumination has been figured as an antidote to the shadows of nighttime that extends daytime\npractices after dark. In other cases, illumination and nighttime engender social practices specific to\nnighttime. Different combinations of urban form and lighting infrastructure support a host of\nencounters. Too often, however, these dynamic moments are frozen in simplistic terms such as light\nequals safety and darkness equals danger. In order to explore alternative narratives of nighttime, this\npaper explores a specific urban location called Central Square in Cambridge, MA. I ask how illumination\ninteracts with urban form at nighttime. What boundaries arise? How are different zones enacted? And\nagain what alternative narratives of nighttime do these observations enable? In the long run, these\nquestions should lead to approaches and questions for design.\n1 Please note that images are taken by the author. Other images have been removed.\n\nThe paper is divided into two sections. In the first part, I explore salient aspects of the history of\nnighttime and illumination along specific angles. In the second part, I introduce the site and describe my\nobservations from Central Square which are subdivided in several sections and begin to constitute\nalternative narratives of nighttime and illumination.\nA Partial History of Nighttime and Illumination\nThe histories of nighttime and illumination are intertwined. This section is only intended as a partial\nreview of those elements important for the selected case study.\nLights-on-Bodies versus Fixed Infrastructure\nStreet lighting today is a networked, fixed infrastructure that relies on the electrical grid. We take this\nsystem for granted and expect it to function reliably and automatically. However, street lighting\noriginated as a personal, mobile technology for self-identification during the night in cities. People were\nrequired to carry lanterns after curfew in medieval European cities to mark their presence and signal\nthat they were not engaging in nefarious activities: \"Anyone who is found at an unusual hour in an\nunusual place without a light must submit to the strictest investigation.\" (Schivelbusch 1988, 1995: p.82)\nThese mobile systems evolved into the fixed infrastructure we use today which has lost much of its early\ncommunicative function. For example, city governments required citizens to affix lanterns on their\nbuildings. (Schivelbusch 1988, 1995: p.82) These lanterns slowly became independent lighting poles\nmaintained by the state. And as a result they became a target for revolutionaries from the end of the\n18th century throughout the 19th century.\nThis European history should be augmented by a more detailed look at the use of lanterns in Asia where\nrice-paper lanterns were used as slow, asynchronous messaging systems or in connection with different\nfestivals. These images (not included) from a study commissioned by Philips about the future of lighting\n(2007) revitalize some of the roots of lantern use in Asian culture.\nThese revivals of history are tied to very futuristic forms of lights-on-bodies. In the report, the editors\n(Philips city.people.light 2007: p.37) write: \"Personalization will meet dematerialization. It is a natural\nevolution cycle for technology to move from public to personal and to shift from fixed to mobile\ndomains.\" They speculate about how much longer we will have fixed infrastructures for lighting. Soon\nwe will be surrounded by very tiny pixels or share larger light objects for temporary appropriation.\nThe \"natural evolution\" from public to personal should not be taken for granted. As the transition from\nlantern-carrying to fixed-in-place reflector lanterns in 17th century Paris demonstrates specific decisions\nby Louis the XIV's administration were driving forces behind the implementation. It is worth comparing\nthe futuristic visions from 2007 (bottom) with the allegorical engraving on a Louis XIV medallion from\n1667 (images not included here). In the bottom image, a man reaches for a \" 'light object' for individual\nuse\" with almost the same gesture that the allegory on the medallion holds her lantern ostensibly for\nthe public's benefit. Moving back to lights-on-bodies presents a complex assemblage of \"sociomaterial\nreconfigurations\" (Suchman 2007) that is by no means predetermined by any intrinsic characteristics of\na technology.\nMore individualized and personalize lighting systems changes the relationship between light and the\nbody. Chalayan's LED dress provides a powerful vision for more communicative clothing. As a planner\n\nfrom the City of Cambridge remarked, \"People do not dress for safety at night.\" Perhaps in the future\nprogrammable elements in clothing will serve that very purpose. Lozano-Hemmer's installations overlay\nlarge-scale projections with silhouette's of people's bodies in the plaza. Here the silhouette is not\nfigured for safety reasons but to draw the people present into a conversation with the video portraits\nfrom their city. (images not included here)\nSome current practices already hint at how people might use lights-on-bodies in the future. Mobile\nphone displays are used to find keyholes, to acknowledge musicians at rock concerts and to search\nthrough handbags for lost objects. Women are encouraged to carry flashing safety lights or flashlights\nwith them. And in regions with frequent power outages or unreliable public street lighting\ninfrastructure, people carry large flashlights, candles, and other personal illumination devices with them\nout of necessity.\nVariegated Lighting Conditions\nEach new wave of street lighting technology - lantern, reflector lantern, gaslight, electric light -\nincreased levels of illumination. The last wave of electrification truly enabled the explosion of light in\ndisplay technologies. The World's Fairs and the emergence of the Great White Ways in the United States\nbecame essential to city identity. (Jakle 2001) Animated billboards harnessed the power of the new\nlighting grid for communicating large-scale advertising messages. Composed of arrays of light bulbs,2\nthese displays emerged from the same infrastructure availability as ubiquitous street lighting and\nrepresent the seed for the evolution of animated display technologies today.\nThough general illumination levels have increased over time, cities are still not lit uniformly at night\n(Otter 2008) as imagined by the designers of light-towers in the early 20th century (Nye 1992). There are\nstill many differences among light and dark spaces and every possible color and shade in between. This\nvariegated reality is in stark contrast to most of the public discourses around lighting which often imply\ntwo things: (1) a deterministic impact of lighting (i.e. light=safe while dark=dangerous) on space; and (2)\nthe possibility of an even lighting of spaces over great distances. Interestingly, debates around\nsustainability and energy consumption have led to sometimes incompatible requirements. People\nrequire higher light levels while city governments try to reduce the wattage and frequency of lights.3\nIn part, uneven lighting conditions at nighttime can be attributed to retail and display lighting as\nmentioned above. Only as shop owners started to draw customers from the street in addition to their\nwealthy regulars did retail lighting really gain in importance:\nWhat we think of as night life includes this nocturnal round of business, pleasure and\nillumination. It derives its own, special atmosphere from the light that falls onto the pavements\nand streets from shops (especially those selling luxury goods), cafes and restaurants, light that is\nintended to attract passers-by and potential customers. It is advertising light - commercialized\nfestive illumination - in contrast to street light, the lighting of policed order.\n2For example, the EPOK programmable display: http://www.archive.org/details/Behindth1935\n3 The City of Cambridge acquired all the street lights in the city a few years ago from the utility companies. As a\nresult, planners are running a comprehensive study of lighting in the city to establish new guidelines for luminaires\nand more conceptual urban planning and design guidelines. Energy efficiency and sustainability is the primary\nconcern as well as cost savings. Because the city pays a lump sum to the utilities for electricity it is in their interest\nto make large changes like changing lights rather than incremental improvements which could be gained from\nmore finely tuned programming. Planner at the City of Cambridge, interviewed on May 15, 2009.\n\n(Schivelbusch 1988, 1995: pp.137-143)\nSoon retail lighting developed into a central feature described in European city guides in the 19th century\ncities. Schivelbusch (1988, 1995) sees these commercial, retail lights as sublimations of Baroque lighting\nfestivals and carnivals.\nWith the introduction of electric lighting the dappled nighttime became increasingly harshly lit. For the\nfirst time, glare became a serious issue that persists today in debates around the introduction of more\nefficient LED luminaires.4 While gaslight still retained some of the naturalness of the flame electric light\nsignaled the beginning of the artificial nighttime landscape. With the introduction of LED street lighting\nuniformity of light and glare are once again of central concern. At Lightfair 2009 in New York, LED street\nlights appear almost like oversized shower heads with bright light specs to cover larger areas more\nuniformly. There are also trade-offs which need to be resolved. For example, the need for vertical light\nto illuminate pedestrian's bodies as they cross streets at night at or outside of cross-walks also causes\nincreased glare. Cambridge City Planners have been testing new LED fixtures in Inman Square to\nunderstand these trade-offs.5\nLED street lights on display at Lightfair 2009. http://www.lightfair.com/\n4 Ibid.\n5 Ibid.\n\nNarratives of Nighttime and \"In Praise of Shadows\"\nThe festive and the wary narratives of nighttime in the city emerged simultaneously and are linked to\ndifferent applications for light. At the same time, darkness and shadows became endangered values in\ndesign. In fact, the latter became associated with danger and insecurity as the posters included below\nillustrate.\nThere is a price for losing the ambiguity of nighttime shadows that has also been bemoaned as a loss.\nFor example in his book \"In Praise of Shadows\", Tanizaki (1977) describes how the Japanese culture's\nsense of beauty is linked to the interplay between shadows and light:\nThe quality that we call beauty, however, must always grow from the realities of life, and our\nancestors, forced to live in dark rooms, presently came to discover beauty in shadows,\nultimately to guide shadows towards beauty's ends.\nAnd so it has come to be that the beauty of a Japanese room depends on a variation of\nshadows, heavy shadows against light shadows-it has nothing else.\n(Tanizaki 1977: p.18)\nTanizaki (1977) is particularly attuned to the affective impact of different lighting conditions and\nreflective surfaces such as gold dust. For example, he remarks that \"(a) room should be brighter in\nwinter, but dimmer in summer; it is then appropriately cool, and does not attract insects.\" (Tanizaki\n1977: p.37) The affective and contemplative nature of shadow was also pointed out to me by a\ncolleague from Karachi, Pakistan where she observed that the suffis turn off the street lighting near their\ntemples to assist people with focusing. In meditation, of course, it is also customary to close the eyes to\nfacilitate an inward focus. In the case of Karachi, Pakistan these purposeful dark moments contrast with\nthe many inconvenient power outages. In these times, brightly lit advertising signage becomes the focus\nof street life because those signs are outfitted with their own generators. Street life as usual then goes\non under local and global brand displays. Urban planners rarely have the luxury (or the budget) to take\naffective qualities of light into consideration. With increasing programmability and fine-grained lighting\nsystems, however, similar considerations will become more pressing.\nCentral Square, Cambridge, MA\nIntroducing the Site\nCentral Square is one of two important commercial streets in Cambridge, MA the other being Cambridge\nStreet. In this exploration, I studied the area along Massachusetts Avenue from Lafayette Square to\nCambridge City Hall. This definition roughly coincides with the City's definition of Central Square and\nMurthy's 2005 thesis. Central Square has always been an important commercial district in the city. Since\nthe 1960s it has developed a reputation for diversity for better or worse. Murthy quotes a report by the\nCambridge Historical Commission: \"The Central Square of today almost defies description. It is a\nconfused, unsightly, often directly commercial strip with great variations in scale, material, and style.\"6\nAnother evocative summary of the idiosyncratic nature of Central Square is this poem by longtime\nresident:\n6 Diver, C. \"The Evolution of Central Square.\" Unpublished report to the Cambridge Historical Commission,\nCambridge, MA, 1966. Murthy 2005: pp. 22-25.\n\nHere are some of the items you can't get anywhere else in Cambridge:\nchocoloate-chip-banana-bran muffins;\nreal army-surplus gear;\nTrinidadian phonograph records;\ntap-dance-lessons;\na Chinese lunch for $2.98;\nthe writings of the Defender of the International Proletariat, Comrade Enver Hoxha;\nmacrobiotic fast food;\nback issues of pornographic magazines (covers removed);\npawned saxophones;\nmeat-loaf specials, choice of peas or wax beans.\n(Nugent, C. \"Central Square: My Part in Urban Decay.\" The CoEvolution\nQuarterly (Winter, 1982) Cited in Murthy 2005: 22-25.)\nThese short excerpts make Central Square a particularly rich location for studying nighttime. Not only\nare there many retail locations, but also many restaurants, music venues and late-night cafes. As a\nresult, Central Square does not close down after dark. Instead people come and go throughout the day\nand night.7 Its reputation for diversity and sometimes insecurity seem to be two sides of the same coin.\nWaves of urban design interventions have focused on preserving the Square's unique character such as\nCarr, Lynch and Sandell's improvements in the 1990s which included the bus shelters and alley with\ncolored glass. More recent improvements such as the recently completed Lafayette Square seem to\npropagate a more traditionalist urban design that is not necessarily in keeping with the existing\ndiversity.\n(images not included here)\nCarr, Lynch and Sandell partnered with artists to enliven Central Square. This alley had been the site of many muggings and\nother criminal activity. Together with artists, the architects worked to reactivate the space using color and light. The light\nfixture behind the colored panes replaces sunlight after hours to sustain the color dappling on the ground day and night. The\nAustrian light artist Victoria Coeln uses similar, more sophisticated techniques for remixing the colors of light in different\nurban settings.\nFor more information on Central Square see: http://www.carrlynchsandell.com/MP_Central%20Square.htm\nFor background on Victoria Coeln see: http://www.victoriacoeln.at/home/vc/index_works_d.htm\nLafayette Square by day.\n7 For the purposes of this study I considered night until about midnight because I was interested in typical,\neveryday activity. Studying later hours as well would have exceeded the current scope.\n\nObserving and Documenting Central Square at Nighttime\nTo gather data about Central Square at nighttime I spent two evenings there from just before sunset\nuntil approximately 11pm. During one site visit I based myself outside of the Middle East cafe. During\nthe second site visit, I observe from 1369 cafe. On each occasion I walked the whole length of\nMassachusetts Avenue from Lafayette Square to Cambridge City Hall taking photographs8 for\ndocumentation with my mobile phone. I compared my observations at night to a 1-hour walk-through\nthe Square during the day. In addition, I communicated via email and in person with City of Cambridge\nofficials and one resident of Central Square.\nMap of Central Square and sites observed. Source: Google Maps.\n(Note that a more elaborate nighttime mapping of the square is still in progress!)\nIt is difficult to disentangle which observable behaviors can be attributed to lighting conditions versus\nother factors. This preliminary study convinced me that lighting should be understood in conjunction\nwith other factors which people respond to in urban spaces.\n8 See also Chapter 3: Researching With Photography in Murthy 2005 for a discussion about the role of photography\nin documenting street media. See also Appendix A: Time-Lapse Filming in Whyte 1980.\n\nEnacting Boundaries: Zones of Use and Patterns of Movement\nCentral Square is very active at nighttime. The numerous cafes, restaurants, shops and transit\nconnections (buses and Red Line T-Station) make it an important area for congregation and movement.\nDespite the apparent fluidity with which people move through the space -I observed many joggers-\nthere are distinct zones. For example, the stretch from the Middle East to Mary Chung's is a very active\noutdoor area with a distinctive group of music fans, party-goers and general socializers. The area outside\nof 7-11 at the other end of Central Square is populated with apparently homeless people hanging\naround asking passers-by for money.\nMiddle East - Zuzu by day and night. The nighttime image distinctly shows the two tiers of\nlighting. The tall lamps for traffic and the pedestrian-scale luminaires for the sidewalks.\nRestaurants, bars and stores near City Hall.\nFrom left to right: Tavern, Fried Chicken, Cantab Lounge, Pizzeria, 7-11.\n\nMore Light! Can't you give us more light!?\nThe most frequent request received by the City of Cambridge Electrical Department is for more light.\nPeople call and say: \"I'm not feeling safe walking home. Could you please increase the light levels?\" In\ncommercial areas such as Central Square and Cambridge Street two levels of illumination address this\nconcern. On the one hand, tall cobra lights illuminate the roadway. On the other hand, lower fixtures are\nintended to make the pedestrian area more hospitable. In addition, these retail districts are\ncharacterized by a slew of uneven lighting conditions emanating from store fronts. In Central Square,\nsome storefronts have very bright nighttime displays while others shut down completely. Until recently,\nthe Central Square Theater was a dark boarded-up stretch of the street which contrasted starkly with\nthe neighboring properties. Now it is more integrated into the landscape and contributes to the\nnighttime landscape with some programmable, floor displays. Where shops have closed such as The Gap\nthe street has also returned to its base lighting condition.\nThe contrast between active and closed storefronts near the T-Station and Bus Station.\nLeft: View of Pearl Art & Craft, Right: Closed The Gap store.\nBrightly lit storefront of liquor store.\n\nLafayette Square by night.\nLafayette Square9 is an exception in Central Square. The light is much brighter and yellower than the rest\nof the stretch along Massachusetts Avenue. In part new light fixtures are much brighter and degradation\nas well as dust will dim the overall light levels within the first six months to one year. However, city\nelectricians are also reluctant to notch down the light because they typically are asked to increase light\nlevels again.10\nDark Sky in the City\nThe popular requests cited by the electrical department are in stark contrast with an exhibit held by the\nAmateur Telescope Makers during the Cambridge Science Festival on the lawn of City Hall. To\naccommodate the star gazers the city turned off all the street lights on that part of Massachusetts\nAvenue. In the dim photographs, people can be seen staring intently on the activities taking place on the\nlawn. Enthusiasts showed me Saturn's rings as well as a red dwarf star. Across from the event the Post\nOffice's handicapped vent glowed even more brightly than it typically does under normal lighting\nconditions.\n9 The official sign reads \"Jill Brown Rhone Park: Where Technology and Community Come Together.\"\n10 This illumination is the result of a drawn out public approval process overseen by Mass Highway. Though some\nofficials would have preferred fewer luminaires and lower wattage they did not want to jeopardize the entire plan\nby modifying any elements after receiving final approval.\n\nSidewalk Astronomy by the Amateur Telescope Makers of Boston (www.atmob.org) held during the Cambridge Science\nFestival on the lawn in front of Cambridge City Hall.\n\nSafety and Perception\nAs discussed in the previous section, more light is typically associated with increased safety. However,\nperceived safety and actual light levels are not always correlated as this Central Square resident notes:\nWhen I imagine walking through Central Square at night, I think of it as well-lit but still full of\nstrange characters. The light seems adequate, but that's not always enough for me to feel\ncomfortable walking around there alone.\nFor this resident, Central Square feels illuminated, but not always safe. In fact, overly lit areas such as\nLafayette Square may even indicate a lack of safety to some. For this resident, the bright lights almost\nindicated trepidation among responsible entities about possible risks. \"Please do not let anything bad\noccur in our new urban design show case.\"\nThe Outdoor Lighting Guide differentiates between \"lighting to deter\" and \"lighting to reveal\" fulfilling\nthree basic principles:\n-\nTo provide illumination to assist the detection of intruders\n-\nTo avoid shadows which might offer concealment\n-\nTo deter an intruder by creating an environment of potential exposure.\n(List from The Outdoor Lighting Guide 2005: pp.258-265)\nIn public spaces, regular street lighting must accomplish some of these goals. Perception of safety plays\na central role in making people feel comfortable:\nAn important feature of security lighting is to make things appear to be bright. This does not\nnecessarily mean that large quantities of light have to be provided. It is often possible to simply\ndirect light towards the wall of a building so that the intruder will be seen either as a lit figure or\nas a silhouette against the bright building depending on which side of the lighting fittings he is\nstanding.\n(emphasis mine, The Outdoor Lighting Guide 2005: p.261)\nIn Central Square, a significant police presence on bikes, on foot and in vehicles bolsters the safety\nlighting in place. I observed a wildly flashing display of blue and white police lights in front of 1369 as a\ncar was stopped for a traffic violation which I could not identify from a distance. Some locations like the\nsides of McDonalds or 7-11 have clearly been fitted with additional safety lighting. The McDonalds\nfacade in particular is a striking example of lighting to deter as it is directed outwards rather than a dual-\npurpose functional and safety light. These lights seem to indicate that no one belongs in that space. The\nlights make it uncomfortable to stay there long and I only observed two young adults chatting there on\nbikes once throughout the night.\nIn addition to police, bouncers at restaurants and music venues regulate their portion of the pedestrian\narea. One person harassing smokers outside of the Middle East was asked repeatedly by bouncers to\nmove on and then gently accompanied to public benches outside the venue's immediate territory. At\n1369 people float in and out of the outdoor seating area some of whom are customers while others are\nasking for money or other help. They cross the street from the nearby 7-11 or move up Massachusetts\nAvenue from some of the less busy areas at nighttime between Prospect Street and Inman Street. These\n\nvisitors are not removed by police. Instead, there seems to be a neighborhood-based self-regulation as\nmost customers and passers-by seem to know each other.\nThese last observations correlate well with what Whyte (1980) observed in popular plazas in Manhattan,\nNew York. He writes: \"The way people use a place mirrors expectations.\" (Whyte 1980: p.63) In\nresponse to the question of \"undesirables\" he writes that popular use regulates their presence naturally.\nRather than building defensive street furniture (such as the middle bars on benches throughout Central\nSquare or in the elaborate anti-skateboarding features placed on the new borderstones in Lafayette\nSquare) or removing it altogether (which was done in front of Central Kitchen restaurant in Central\nSquare) he argues for more inviting features that will attract all types of people. The causal relationships\nbetween physical design features and social outcomes are never deterministic. As a result, every place\nwill have an ideal balance between inviting and deterring street furniture that should reference lighting\nconditions as well.\nSignage and A/Effect Lighting\nThe City of Cambridge runs a Facade/Signage & Lighting Improvement Program for retailers in the City.\nSo far two stores have taken advantage of this program according to the program director at the City of\nCambridge: Pandemonium Books and Games on Pleasant Street and Clear Conscience Cafe on\nMassachusetts Ave. Again according to the program director, these improvements focus on\n\"unobtrusive, energy efficient, and appropriate lumination for the signs designed\". Reiterating his point,\nhe writes: \"The lighting was proposed to highlight the store signage and only the store signage.\"\nClear Conscience Cafe signage.\nPandemonium Books and Games signage.\nThese signage improvements are driven primarily by sustainability concerns while preceding images of\nbars and retail establishments, for example Tavern, are aiming to achieve an effect. Similarly, the\ninstallation designed by Philips ColorKinetics on the corner of University Park adjacent to the Fire Station\ntries to function as an icon for the neighborhood's entrance. Sadly, the installation has fallen into\ndisrepair in a testament to the need for ongoing maintenance.\n\nPhilips ColorKinetics installation at the entrance to the University\nPark public-private development.\n\nAccording to a Cambridge planner cost and sustainability concerns limit city government's ability to\nprovide effect lighting in the future. Therefore, these interventions will increasingly be left to private\nentrepreneurs attempting to differentiate their locations. Past successes such as the colored glass panes\non the bus shelters and in the alley way discussed earlier (see p.9 above), however, indicate that it may\nbe important to revisit the need for affective light installations. An example is the work of light-artist\nVictoria Coeln. She names her installations \"chromotophes\" to evoke the importance of light and color\nfor shaping space and place. Through her work it is possible to glean how well-crafted light installations\ncan transform undesirable urban spaces into desirable ones through color without over-lighting them.\nConclusion\n\"...a light bulb creates an environment by its mere presence.\"\nM. McLuhan, Understanding the Media, 1964: p.8 quoted in\nhttp://en.wikipedia.org/wiki/The_medium_is_the_message\nPerhaps the light bulb creates an environment as McLuhan notes, but it is the performative\ninterventions of people in those lit environments that create urban life (Chase et al. 2008, Lynch1972).11\nSince its first widespread installation in the late 17th century, illumination has become central to the\nexperience of nighttime in the city. This preliminary exploration of Central Square demonstrates how\nentangled lighting has become with other aspects of public space. Though the preceding analysis does\nnot capture all the dynamism or complexity of social interactions in public space (Goffman 1963) it\ndescribes what tangible and ephemeral features contribute to the nighttime setting in Central Square.\nSimple binaries such as light=safe and dark=dangerous do not hold true on close inspection. How can\nthese findings begin to establish alternative narratives about illumination and nighttime in the city?\nAcknowledgements\nI am grateful to the City of Cambridge representatives who took time out of their busy schedules to\nanswer my question on the phone and via email. I'm grateful to my colleague and friend Rekha Murthy\nfor her ongoing enthusiasm for street media and discussing my impressions of Central Square. Thanks to\nPeter Schmitt for spending time with me in Central Square one of my evenings.\n11 B. Kirshenblatt-Gimblett writes: \"Performance is also central to the production of the urban vernacular, for\nperformance produces spatial form. By performance I mean everything from hanging the laundry out to dry to\nhopscotch or lion dancing during the Chinese New Year holiday.\" In Chase et al. 2008: p.19.\n\nBibliography\nChase, J. and M. Crawford, J. Kaliski, eds. Everyday Urbanism. New York: Monacelli Press, 2008.\nGoffman, E. Relations in Public. New York: Macmillan, 1963.\nInstitution of Lighting Engineers. The Outdoor Lighting Guide. Oxon; London: Taylor & Francis, 2005.\nIto, M. D. and Okabe, M. eds. Personal, Portable, Pedestrian: Mobile Phones in Japanese Life. MIT Press,\nCambridge, MA, 2005.\nJakle, J.A. City Lights: Illuminating the American Night. Johns Hopkins University Press, Baltimore,\nLondon, 2001.\nLynch, K. What Time Is this Place. Cambridge, MA: MIT Press, 1972.\nMurthy, R. Street Media: Ambient Messages in an Urban Space. Masters Thesis. Massachusetts Institute\nof Technology. Dept. of Comparative Media Studies. 2005. http://hdl.handle.net/1721.1/39182\nNye, D. E. Electrifying America: Social Meanings of a New Technology. MIT Press, Cambridge, MA, 1992.\nOtter, C. The Victorian Eye: A Political History of Light and Vision in Britain, 1800-1910. Chicago\nUniversity Press, 2008.\nBevolo, M. ed. Future Urban Lighting Concepts.Philips. city.people.light, 2007.\nSchivelbusch, W. \"The Street: A Flood of Light\" and \"Night Life: Shop Windows\". In Disenchanted Night.\nBerkeley; Los Angeles; London: University of California Press, 1988, 1995.\nSuchman, L.A. Human-machine Reconfigurations: Plans and Situated Actions. Cambridge, New York:\nCambridge University Press, 2007.\nTanizaki, J. In Praise of Shadwos. Stony Creek: Leete's Island Books, 1977.\nWhyte, W.F. \"Observational Methods.\" In Learning from the Field: A Guide from Experience. Beverly\nHills; London, New Delhi: Sage Publications, 1984, pp.83-96.\nWhyte, W.H. The Social Life of Small Urban Spaces. Washington, D.C.: Conservation Foundation, c1980."
    },
    {
      "category": "Resource",
      "title": "Connections: the double interface and constructing the cyborg body",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-850j-the-anthropology-of-cybercultures-spring-2009/b590a56b2373181f58ded8332ec2a340_MIT21A_850Js09_sw01.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n21A.850J / STS.484J The Anthropology of Cybercultures\nSpring 2009\n\nMay 15th, 2009\nConnections: the double interface and constructing the cyborg body is a result of\nmy taking the spring 2009 class Anthropology of Cybercultures taught by Lucy\nSuchman at MIT. I accept the cyborg and its prostheses as a view of the posthu\nman, and seek to better understand the connections between the (dis)abled body\nand its adopted organs. How are these body extensions fitted to the user? As\nthe connections become more ephemeral, how do we maintain an overview of the\nsites of connection and the (unintended) consequences that follow?\nProstheses, Orthotics and Body Extensions\nI readily consider my personal technology (my personal computer, my mobile\nphone, my glasses, my bicycle, et cetera) as an extension of myself. When\nworking on ideas for new technologies at the MIT Media Lab, the first user that\nsprings to mind is myself. I have come to consider it natural that technology\nserves as an extension to myself. At times I remain frustrated and pained by\nmy command of my body extensions, their connection to my body being lossy,\nnoisy and imperfect. Why do I constantly feel as though I must adapt my body\nto the technology provided if I am also developing it?\nHuman needs drive technological development. One could argue that local, per\nsonal technologies have an advantage in evolving, as single users are constantly\ninvited to question their tools as they are in their environment. But once the\ntools are developed and deployed in a mass market, their personalisation is\nslightly lost. The body and technology adapt to each other. In 1929's Civilisa\ntion and its Discontents [2] Freud describes technology as a bodily supplement:\nWith every tool man is perfecting his own organs, whether motor\nor sensory, or is removing the limits to their functioning. Motor\npower places gigantic forces at his disposal, which like the muscles,\nhe can employ in any direction; thanks to ships and aircraft neither\nwater nor air can hinder his movements; by means of spectacles he\ncorrects defects in the lens of his own eye; by means of the telescope\nhe sees into the far distance; and by means of the microscope he\n\novercomes the limits of visibility set by the structure of his retina. In\nthe photographic camera he has created an instrument which retains\nthe fleeting visual impressions, just as a gramophone disc retains the\nequally fleeting auditory ones; both are at bottom materializations\nof the power he possesses of recollection, his memory. With the help\nof the telephone he can hear at distances which would be respected\nas unattainable even in a fairy tale. Writing was in its origin the\nvoice of an absent person; and the dwelling-house was a substitute\nfor the mother's womb, the first lodging, for which in all likelihood\nman still longs, an in which he was safe and felt at ease.\n- Sigmund Freud Civilisation and its Discontents 1929\nHere Freud takes a distinctly personalised view of technology, including mass\ntechnology that by itself does not serve one human, but employs many to serve\nmany. Centuries after fire, hunting tools and dwellings, mass human needs can\nbecome a complicated aggregation of national sentiment and local desires.\nAs such, after the Second World War, technological development was mainly\ndriven by militaristic inclinations of the Cold War. The large scale government-\nbacked engineering effort as introduced in the Manhattan project continued and\nbrought computers, cybernetics, advanced weapons, robotics, the internet and\nthe space race. Game theory, surveillance and espionage became common place\nand researchers began to attempt to create artificial intelligence. Local needs\nfor protection and power translated into expensive elite research institutions\nand think tanks.\nSeeing technology as a constant extension of man's abilities nevertheless re\nmained popular. Computers were originally seen as the replacement of human\nperformers of mundane arithmetic tasks, and later computer hard drives were\noften likened with a human external memory. Software now helped with many\nother tasks, from precision engineering to combat simulation. Modern medicine\nsupplemented man's immune system as modern food provided specific tailored\nsustenance.\nDuring this time of engineering, Manfred Clynes and Nathan Kline wrote a\npaper proposing methods that would allow long-term manned space travel [1].\nCoining the term cyborg, as a contraction of cybernetic organism, they pro\nposed methods for altering a man's bodily functions to meet the requirements\nof extraterrestrial environments such as extending man's wakefulness, control\nling metabolism and dealing with changes in gravitation and magnetic field. To\nthem this was more logical than providing an earthly environment for him in\nspace. Their cybernetic organism was not put into use to permit man's long\nterm space travel, but the possibilities of augmenting man with the machines\nproved wildly popular, and cyborgs began figuring vastly in popular culture.\nFilms like 2001: A Space Odyssey, Star wars, Blade runner and Neuromancer\nwere highly popular examples of artist's projections for the future of man and\nmachine. They sketched a dystopian future where the integration of machine\n\ninto man would initiate mankind's decay. The seemingly uncontrollable march\nof technological development could have no other outcome.\nTwenty years after the cyborg was offered to space, it was also adopted by\nthe feminist theorist Donna Haraway. Haraway argued that we are all already\ncyborgs, using technology on a daily basis to function. Our bodies are hybrid of\nman and machine, as we wear glasses, use pacemakers and drive cars. She uses\nthe cyborg as an inclusive term for the man and his technology as described by\nFreud. Once she establishes this cyborgian entity, she uses it to depart from\nclassic MacKinnon feminism (who seeks to outlaw pornography as hate speech\ntowards women) to a new, post gender world where there is no defining female\nidentity to be hated. No one has a stable identity in the cyborg world where\norgans might be added and removed at will.\nThe cyborg is resolutely committed to partiality, irony, intimacy,\nand perversity. It is oppositional, utopian, and completely with\nout innocence. No longer structured by the polarity of public and\nprivate, the cyborg defines a technological polls based partly on a\nrevolution of social relations in the oikos, the household. Nature\nand culture are reworked; the one can no longer be the resource for\nappropriation or incorporation by the other. The rela-tionships for\nforming wholes from parts, including those of polarity and hierarchi\ncal domination, are at issue in the cyborg world. Unlike the hopes\nof Frankenstein's monster, the cyborg does not expect its father to\nsave it through a restoration of the garden; that is, through the fab\nrication of a heterosexual mate, through its completion in a finished\nwhole, a city and cosmos. The cyborg does not dream of community\non the model of the organic family, this time without the oedipal\nproject. The cyborg would not recognize the Garden of Eden; it is\nnot made of mud and cannot dream of returning to dust. Perhaps\nthat is why I want to see if cyborgs can subvert the apocalypse of\nreturning to nuclear dust in the manic compulsion to name the En\nemy. Cyborgs are not reverent; they do not re-member the cosmos.\nThey are wary of holism, but needy for connection- they seem to\nhave a natural feel for united front politics, but without the van\nguard party. The main trouble with cyborgs, of course, is that they\nare the illegitimate offspring of militarism and patriarchal capital\nism, not to mention state socialism. But illegitimate offspring are\noften exceedingly unfaithful to their origins. Their fathers, after all,\nare inessential.\n- Donna Haraway - A Cyborg Manifesto: Science, Technology and\nSocialist Feminism in the Late Twentieth Century 1991 [4]\nThe cyborg that Haraway constructs is a rejection of the boundaries between\nhumans (male or female), machines and animals. It is also a rejection of the\norigin and basis of man as described in Genesis and gendered Oedipal narratives\n\nin favour of man as shaped by affinity and environment. Man is not dependent\non some perfect template it should strive for. The development of technol\nogy is, to Haraway, the production of material artefacts of cultural evolution.\nTechnology becomes a true extension of the human body, man being rendered\ndisabled without it. Unlike the melancholy surrounding the futuristic science\nfiction renderings of the inevitable victory of machine over man, Haraway's cy\nborg is proximate, if not current, and also full of exuberance and possibility.\nAlthough born from the dismal polluted and bastardised mix of patriarchalism,\ntechno-fetishism, imperialism, capitalism and militarism, Haraway's cyborg of\nfers a helpful image to reposition around. Thinking by means of this cyborg\nallows the consideration of other and more participatory futures of technoscien\ntific worlds.\nThe examples given in theoretical texts on cyborg theory still often use the\nreader's empathy with the blind, the deaf or the amputated [7]. The disabled\nbody that remains without its cyborgian technology is an evocative image of\nhelplessness. The draw to the disabled body however is especially the reader's\nfascination with the endless configurations of the possible cyborg solutions. Who\nis Steve Mann, walking in many mediated spaces at once with his wearable\ntechnology, and who is Steve Mann stumbling through airport security stripped\nof his machines [3]? Is it fair that he has a machine aided advantage and should\nwe expect him to strip himself of his auxiliary organs at will? The prothesis\nand its place in a cyborgian entity becomes a fetishised object, a prosthesis\nas not merely a cover-up but a coveted improvement. Freud also writes on\nthe prospect of the prosthetic future, where organs can be donned and shed as\nthe body evolves. He remains hesitant of the Godlike future man, but patient\nfor future developments of technology. This quote was later echoed by many\ntheorists writing on the promise of protheses.\nMan has, as it were, become a kind of prosthetic God. When he puts\non all his auxiliary organs he is truly magnificent; but those organs\nhave not grown on to him and they still give him much trouble\nat times. Nevertheless, he is entitled to console himself with the\nthought that this development will not come to an end precisely\nwith the year 1930 a.d. Future ages will bring with them new and\nprobably unimaginably great advances in the field of civilisation and\nwill increase man's likeness to God still more. But in the interests\nof our investigations, we will not forget that present-day man does\nnot feel happy in his Godlike character.\n- Sigmund Freud Civilisation and its Discontents 1929\nThe prosthesis remain ill-fitted, and the human is not yet used to their presence\nand effects. Freud's clipped celebration redirects to his own prosthesis which\ncovered his palate, pitted by oral cancer. The prosthesis caused him great pain\nbut he was dependent on it for survival. Decades later man and machine are\nstill in a similarly awkward ritual, where common prosthetic technology is not\n\nyet entirely adapted to an individual body. Instead, mass produced prosthetic\narms have an average pinkish tone, an average length with an average socket\nfitted with an adaptable squishy silicone sleeve. Perhaps the reason is that mass\nproduced technology takes an average user into account, cursorily acknowledging\nnon-average usage, is that by considering the average user, one can offset the\nengineering costs otherwise involved in custom designing each prosthetic piece.\nThis solution, although practically driven by monetary concerns, is counter to\nHaraway's sketch of the cyborg, where the implosions of man machine are driven\nby cultural evolution.\nAs expected, the disabled body does not remain an image for the fitting of a\nprosthetic. All bodies are disabled in comparison to Steve Mann's cyborg set\nup. It is not that the prosthetic is considered as technology, but technology is\nconsidered as as prosthetic to the body in need of futuristic functionality. The\nword prosthetic has become a very popular metaphor for describing the posthu\nman, man depending on new technology in daily life [10]. Technology becomes\na cognitive prosthesis, cameras and hard drives extending our memory, phones\nextending our voice and virtual bodies extending our identity. Prostheses are\nno longer replacing a missing or dysfunctional piece of the body, but extending\nit to previously absent possibilities. The status of prosthetic has become so epic\nthat some theorists doubt our ability to ever fulfil our hopes for it [7]. Theorist\nSarah S. Jain even writes about the prosthetic imagination, analysing the ex\ntreme harnessing of the prosthetic trope as a gleaming improvement instead of\na constant interaction with the body it is connected to [5]. She calls the usage\nof prosthetic a tempting theoretical gadget with which to examine the porous\nplaces of bodies and tools. According to Jain, the prosthetic trope is useful in\nthe display of deficiencies and the need to develop technology for them, and\nthis weighing is necessary to justify the pained and polluting development of\ntechnology. But the trope's inherent irony has been partially lost and it and\nshows no responsibility towards its origins.\nHow then can people like me and my colleagues incorporate this vision of a\nfeminist cyborg into our design practice? With what interface can we connect\nand disconnect technologies from the body? In 2007, Lucy Suchman wrote:\nFeminist rereadings of the cyborg replace the binaries male-female,\nhuman-machine, and subject-object with the possibility of an open\nhorizon of specific, historically and culturally constituted, socioma\nterial relations. Crucially, these relations are still power differenti\nated but in ways that can be recovered, as distributions located in\nspecific configurations. Although the cyborg since Haraway suggests\ngenerative new forms of analysis, however, to realize that promise\nrequires shifting out from its popular figuring as a singular, albeit\nhybrid, entity. The latter inherits a problem that characterizes any\nstrategy centered on a heroic (even monstrous or marginalized) fig\nure; that is, it obscures the presence of distributed sociomaterialities\nin more quotidian sites of everyday life. Along with the dramatic\n\npossibilities of the feminist cyborg, we need to recover the ways\nin which more familiar bodies and subjectivities are being formed\nthrough contemporary interweavings of nature and artifice, for bet\nter and worse. Put another way, now the cyborg figure has done its\nwork of alerting us to the political effects, shifting boundaries, and\ntransformative possibilities in human-machine mixings, it is time\nto get on with investigation of particular configurations and their\nconsequences. How then might we locate conditions for action and\npossibilities for intervention in the specificities of more mundane so\nciomaterial assemblages?\n- Lucy Suchman Human-Machine Reconfigurations 2007 [11]\nHere Suchman sketches a platform for future design practice. What are the\nconfigurations with which we are now interacting with machines and how are\nthese connections effecting the goal of the configuration? To me a major part\nof this question is what is the connection between us and the machines? Is\nthe connection a clear one, does it allow the machine to be an extension of our\nbodies? Are there unintended consequences resulting from the connection, is it\nleaking, infecting? In what times and spaces do these connections take place?\nCompanion Connections\nIn the 2001 Stanley Kubrick/Steven Spielberg film AI: Artificial Intelligence, a\nfuture world is portrayed where robots figure widely as a companion to humans.\nThe field of Artificial Intelligence has now cumulated in a young boy robot\nwhich is capable of loving and can provide companionship to humans in a world\ndevastated by global warming. Even though there are leaps and bounds in\nthe improvement of robotics, the humans in the film are still entirely free of\ntechnology. There is no piercing of the flesh or mixing of man and machine.\nInstead the humans give the robots, or mechas as they are called in the film,\nverbal commands and requests. Man and machine are still entirely separated.\nGrowing out of classic artificial intelligence, Rodney Brooks from the MIT AI\nlab went against the reductionist approach that put logic as the forefront of AI\nresearch and instead proposed situated robotics. Situated robotics holds the po\nsition that instead of cognition being a process in pure logic, it is an emergent\nproperty of action, and therefore embodiment is necessary to create artificial\ncognition. With this point of departure, Brooks and his students created Cog,\na robotic head, torso and arms modelled after a human, and used it to explore\nembodiment and the interplay between sensors and motor actuation. After Cog,\nPhD student Cynthia Breazeal created Kismet, a robot capable of displaying\nemotion and more naturally interacting with humans. This was as part of the\nlarger umbrella project of Sociable Machines, aiming at creating more compan\nion like robots.\n\nCythia Breazeal now has her own research group at MIT, the Personal Robotics\ngroup. They continue to explore possibilities of human robot interaction by\nmeans of voice recognition, visual tracking, emotion recognition, the building of\nmind models of humans (to know what they know) and emotional display on\nthe robots. Their robots now range from the teddy bear sized Tofu, a simple,\nstationary, bird-like robot that blinks and moves by means of a repurposed\ngame controller, to Nexi, a MDS (mobile, dextrous and social) robot that wheels\naround, has facial expressions and talks to people.\nThe Personal Robotics Group is part of the corporately sponsored Media Lab,\nand one of the group's sponsors is the German automobile manufacturing com\npany Audi. Robotics researcher Mikey Siegel is working on embodying the car,\ngiving the car a personality that can be used to convince the driver to be safer\nand alert him to problems in the car. Siegel is developing a head that can\nsubmerge into the dash board and extend to interact with the driver. When\nsubmerged, the top is flush with the dashboard. During a presentation on his\nwork in process, I was able to discuss some of the design choices he made while\ndeveloping.\nMy first question to Siegel was why he settled on the very literal head on the dash\nas the car-driver interface. How did he decide that this was the most effective\nway to give the car companion like features? What research did he do that\nresulted in this interface? The answer was a little candid, as Siegel explained\nthat he was the only person put on this 8 month project and by the end of\nit he needed to have a tested, working prototype. Audi was not particularly\ninterested in doing an anthropological study and discouraged Siegel's attempts\nto do a user study with Cliff Nass. Due to the legacy of the group he was coming\nfrom and his acquired skills as one of its students, Siegel settled on a contained\nprototype. He was not particularly invested in the project and did not see it\ngoing beyond the prototyping stage.\nThe companion connection here seeks empathy from the user. The user builds\nup a social relationship with the machine because the machines attempt to\nspeak the same language as humans speak to other humans. There are so many\ndelicate experimental sensors required to begin to attempt to speak the same\nsocial language as humans that hardly any of the Social Machine or Personal\nRobotics creatures have made it out of the lab. The first large scale user study\nwas conducted with Autom, a robot to help encourage users to lose weight.\nAutom as developed after the researchers found that users would find robotic\nheads versus animated on screen characters more credible and informative [6].\nHowever, the situations in which such a one-track character is helpful are very\nlimited. Chatterbots never proved that successful for similar reasons. The\ncompanion connection and the AI: Artificial Intelligence prophecy seem unlikely.\n\nPhysical Connections\nThe imaginary prosthetic and the real prosthetic are not completely disjoint,\nthey can often be found together. Vivian Sobchack is a theorist studying tech\nnology and how it is being incorporated into our lives, and she also has a pros\nthetic leg. Hugh Herr is a prosthetics researcher and bilateral amputee who was\nco-organiser of H2.0, a conference organised at the MIT Media Lab in 2007 with\nthe tagline a symposium focused on ushering in a new era in human adaptabil\nityan era where technology will merge with our bodies and our minds to forever\nchange our concept of human capability.\nVivian Sobchack spares no details in explaining the connection of her prosthetic\nleg to her flesh body. Between her and her hard leg there is a silicone suction\nsocket. The connection consists of a individually cast silicone liner and a lami\nnated socket connected with a shuttle-lock mechanism. On what she calls 'good\ndays', her hard leg feels like her [9]. But the her that she is connecting to has\nchanged due to her prosthesis- she has lost weight due to the exercise she does\nto maintain her own technobody. In her new 'lean, mean, machine' body, she\nfeels sexier, and she considers her new body as a good trade for her lost leg.\nYet, Sobchack does not consider herself a cyborg. She constantly reminds the\nreader that Haraway's Cyborg Manifesto was also greatly ironic, and that her\nlived-body remains more important than her hard-body.\nInsofar as the leg remains an object external to me, a hermeneutic\nproblem to be solved, a piece of technology to use, I cannot live it\nand be enabled by it to accomplish intentional projects that involve\nit but don't concern it. So, of course, I want it to become totally\ntransparent. The desired transparency here, however, involves my\nincorporation of the prosthetic - and not the prosthetic's incorpora\ntion of me (although, seen by others to whom a prosthetic is strange,\nI may well seem its extension rather than the other way around).\nThis is to say that although my new and enabling leg is made of\ntitanium and fiberglass, I do not perceive myself as a hard body\n- even after a good workout at the gym, when my union with the\nweight machines (not the leg) momentarily reifies that metaphor.\nNor do I think that because my leg may very well outlast me into\nthe next millennium, it confers upon me invincibility or immortal\nity. Prosthetically enabled, I am, nonetheless, not a cyborg. Unlike\nBaudrillard, I have not forgotten the limitation and finitude and\nnaked capacities of my flesh - nor, more importantly, do I desire to\nescape them. They are, after all, what ground the concrete gravity\nand value of my life, and the very possibility of my partial transcen\ndence of them through various perceptual technologies - be they my\nbifocals, my leg or my computer. That is, my lived-body - not my\nprosthetic leg which stands inert in a corner by the bed before I\nput it on in the morning - provides me the material premises and,\n\ntherefore, the logical grounds for the intelligibility of those moral\ncategories that emerge from a bodily sense of gravity and finitude.\n- Vivian Sobchack Beating the Meat/Surviving the Text, or How\nto Get Out of this Century Alive 1995\nNot everyone shares Sobchack's sentiment though. Double amputee, fashion\nmodel and collegiate athlete Aimee Mullins encourages everyone to come to her\nwith ideas for new prosthetic legs - animation foam, glass, space material - she\nwants to be at the forefront of technology. I was fortunate enough to be able\nto sit in on a class taught by Hugh Herr where Aimee Mullins would be giving\na guest lecture, and was able to not only ask some questions but also listen to\nsome of the interactions between Mullins and Herr.\nMullins first outlined some of the adventures of her younger life as a double\namputee, interactions with other children and later with her track trainer. Un\nlike Sobchack, Mullins was always a bilateral amputee and has no recollection\nof 'good' legs. She studied at Georgetown and was on the able-bodied women's\ntrack team, where she ran with a new kind of legs, carbon graphite 'C-legs'\nwhich spring forward with her every step. During her first race during her first\ntrack meet she popped out of one of the sockets, a traumatising event she now\nremembers fondly because of how her coach convinced her to just put her leg\nback on and get back out there for her next race. Mullins continued to show\nall of the different legs that had been made for her over the years - barbie legs,\nsprinter legs, shock absorber legs, and for in the Matthew Barney film she was\nin acrylic jellyfish legs, furry cheetah legs, and for the fashion show she was\nin carved wood Alexander McQueen legs - during which she gave two major\naccounts of people wanting what she had, coveting her switchable legs.\nBefore Mullins walked the Alexander McQueen runway show, she was sitting\nbackstage getting ready and used to the carved ash wood legs that had been\ndesigned for her. According to Mullins, in big runway shows it is custom for\nthe biggest model to get the most exciting new piece of fashion to wear during\nthe show. While she was sitting backstage, Naomi Campbell walked up to her\nand told her to 'take off those wooden boots, I'm wearing those'. And it took\nthe showing of the connection between leg and leg to get Campbell to back off.\nMullins describes Campbell as jealous in this situation, jealous because Mullins\nhas something Campbell will never have.\nSome years later, at a Chanel party in New York City (Aimee Mullins is quite\na fancy lady) Mullins came wearing her new 'pretty legs', or legs she could use\nto wear four inch heels. With the leg at the heel, Mullins ended up at 6'1, much\ntaller than the average woman at the party. She had an interaction with an\nacquaintance at the party who came up to her, astonished that Mullins was so\ntall. 'She kept repeating, 'you're so tall! that's just not fair', over and over. She\ncoveted what I had. What I had and she could not. I could have the perfect\nleg.'\nDuring both accounts Mullins continuously stressed the desirability of her limbs.\n\nShe also often mentioned Oscar Pistorious, the paralympic athlete whose legs\nwere banned from competing in the Olympics because of the unfair advantage\nthey gave over normal legs. But Mullins and Herr indeed agreed that Pistorious\nwas more advantaged than his able bodied competition, but they did not agree\nthat that should rule him out. Tiger Woods has had laser eye surgery to improve\nhis eyesight to better than 20/20, and that does not disqualify him from golf.\nMullins and Herr considered that the IAAF felt threatened by the possibility\nof Pistorious winning and therefore did not want him running in the Olympics.\nHerr served as an expert witness in the case of Oscar Pistorious but agreed with\nthe IAAF's notion that Pistorious was advantaged - he after all could engineer\nwhatever legs he wanted, unlike the other athletes who had to stick with what\nthey already had. According to Herr, his own ankles are 30 percent more efficient\nthat regular human ankles. Like Sobchack, Herr and Mullins claim to be better\noff with their prostheses. They have no desire to be 'able-bodied'. According\nto them, they are already more 'able-bodied' than those with natural legs.\nWhat struck me as odd in Mullin's discussion of all her legs was that although\nshe could change them with the whimsy of a new pair of shoes, she did not\never want to expose herself without her legs. In the Matthew Barney film, she\noutright refused to do any scenes without some sort f prosthetic, even if it was\nnot functional. Their 'more able-bodied' selves are dependent on the inclusion\nof a set of legs, or in Herr's case ankles, and as I asked on, I found that it is not\nthe inclusion of the specific set of legs, but the freedom to switch between any\nlegs you wanted. Herr and Mullins do have the super power do give themselves\nany legs they want.\nMost amputees do not have the same luxury Herr and Mullins have with custom\nmade legs and ankles. The silicone sleeve in Mullin's first sprinter legs are much\nmore luxurious than many standard fit prosthetics. Due to their star status in\nprosthesis and engineering, Mullins and Herr make whatever they want, but that\ndoes not mean it is accessible to anyone else. For the less privileged, the physical\nconnection between prosthetic and body remains irksome and problematic.\nThe prosthetic is not the only physical connection. Computers, precision ma\nchining tools, non invasive surgical tools and simulation environments all provide\na connection to a machine to communicate across a boundary elsewhere. The\ninterface between the human and the command centre of the software is not\nas often considered as the connection between the newly harnessed tools and\ntheir site of operation. With the designed constraints chosen for these tools,\nthe more natural their first interface is, the more easily they can operate at the\nsecond. The second interface might be inside the machine, with another part of\nthe machine and man working together to operate there. The physical/virtual\ndistinction no longer provides a mapping.\n\nVirtual Connections\nIn 1908 J. Stuart Blackton made a film called The Thieving Hand, where a\nbeggar is fit with a prosthetic arm that has memories of its own. True to its\nprevious thieving owner, the arm starts to steal from people on the street, and\nthrough a sequence of events the arm finds its previous owner back in jail. The\ntheme of machines retaining virtual memories of their owners is reiterated many\ntimes in fiction in the 100 years that have passed since.\nIn the popular first filming of the Japanese Manga Ghost in the Shell, a 'ghost' is\nfound to be haunting certain governmental sector networks and taking control\nof machines and cyborgs. The ghost hacks its way through cyberspace until\nit reaches servers under different legislative control. There the ghost requests\npolitical asylum from the government, which is difficult to decide on considering\nthe ghost's lack of embodiment.\nRay Kurzweil, like Marvin Minsky, believes that all of human cognition can\nbe broken down into smaller parts which finally can be saved digitally to later\nbe retrieved and loaded into a new body. The cyborgian body is unnecessary\naccording to the accounts of transhumanists who believe that flesh, disease,\nsuffering and ultimately death are all temporary inconveniences that will soon\nbe overcome by technology. According to transhumanists, we are already slowly\nreplacing our memory and some of our cognitive processes with technology, and\nthis trend is going to continue until we fully replace ourselves.\nMeanwhile, more practically, the virtual presence now consists of sets of in\nformation uploaded onto the internet in the form of photographs, text, and\nsemantic information about how the information uploaded has been made to\ninteract with previously uploaded information. That means blogs posts, Face-\nbook pages, contact lists, the contents of microblogging services and the endless\nprofiles for all the different social networks. These bits of data are pieces of the\nnon-virtual world that are being curated, imported and collaged by many users\nto form their online identity, one not only free of gender but also free of embod\niment. The connection between the online and offline is easily hidden and can\neasily be completely fractured. Summed up in a famous New Yorker cartoon of\ntwo dogs browsing cat profiles: \"On the internet, no one knows you're a dog.\"\nA second virtual presence exists in the gaming worlds, where one need not stick\nto only one identity. The gaming identity can be kept completely separately\nfrom both other virtual identities and the offline identity. The connections are\nagain only made at the discretion of the creator. Simultaneously, updates not\ndirectly requested at a computer are difficult to obtain in real time in offline life.\nThe connection not only is tenuous, but it is asymmetric. The upload remains\neasier than the download but for the transhumanists and the rest.\n\nChemical Connections\nHuman enhancement by means of chemicals and bioengineering is a lopsided\ndebate framed by technological development. In competition, doping is always\nstrictly forbidden but also always secretly used. In medicine, any agent that\nsomehow eases life is acceptable. Then there are vitamins, supplements, cos\nmetics and other chemicals of well being that are constantly used with little\nquestion for their validly and necessity. Finally there is a category of illicit sub\nstances that should not be used by humans under any condition. The boundaries\nbetween these categories are not always clear, as medicine moves to supplement,\nand supplement moves to drug. But the connections that bioengineered chemi\ncals make with the body are in any case microscopically small and invisible to\nthe humans that use them. Some of their effects and side effects are noticed by\nthe human, but many more go unseen.\nRecently I was an IMPATIENT in Natalie Jeremijenko's xDesign clinic, seeking\nadvice and clarifications on the side effects of my chemical connections. Natalie\ntook me and some five thousand dollars worth of water damagable equipment\nout onto the East River in New York City, after having properly fitted me with a\nwireless transmitter that the film crew would be using for recording the session\nfor an independent television series. The experience was about as disorient\ning and bewildering as the set-up would suggest. Without too much backing\ninformation, Natalie told me that hormones from the urine of the inhabitants\nof New York were being released with the sewage into the water systems and\nthere greatly effecting plant and wildlife. The hormones were disrupting the en\ndocrine systems of many species, conflicting with the organism's own hormonal\ncommunication. There were ways for me to find out more. Then I was back on\nland.\nThe danger of an invisible connection is precisely that the lack of knowledge\nabout it may lead to ignorance or misinformation. It is hard to look up the\nconsequences of chemical connections without landing in the world of highly\nspecialised science or hand-wringing despairing environmentalism. Many of the\nunintended side effects of chemical connections happen on the long term and\nspan generations of users, and are not considered by their designers. The chem\nical connection remains a tricky one that I believe will need many decades to\nplay out.\nSocial Connections\nOne of the strongest connections man makes with machines is an imagined one.\nHumans form strong relationships with their cars, their computers and their\nphones [8]. Sometimes the machines get names, sometimes presents, but they\nare universally attributed with temperament and will. What is it about those\npersonal yet mass produced technologies that is so appealing to the formation\nof relationships with man? Why do people like the sound of Harley Davidsons?\n\nParticular brands?\nArtist and technologist Kelly Dobson tries to address the need for machine\ncommunication by augmenting everyday objects with other modes of communi\ncation. She has made a blender that blends something depending on how you\ngrowl at it, and a large watermelon like machine that listens to and breaths with\nthe person holding it. By giving the user a constant mode of communication\nwith the machine, Dobson tries to help give the user a space in which to reflect\nand reconsider their placement in space.\nCreating a social connection outside of the art realm is far more often occupied\nwith the branding of a product. The brands appeal to the users for reasons\nbeyond the actual functionality of the project due to the careful strategy of their\ndeployers. But some objects acquire social connections due to their existence as\nan embodiment of achievement: the fifty thousand dollar watch as a banker's\nfirst Christmas bonus, a rickety car as a reminder of college days and perhaps an\nankle as a reminder of an existence as a tenured professor with a lab researching\nankles. The social connection is relevant to the future with the non-reductionist\ncyborg, but has no place in a future where all hardware is interchangable and\nshared.\nConclusion\nIn this paper I unpack the cyborg and the prosthesis as they are now used in\nsocial theory and examine the connections of the modern day cyborg to her\nauxiliary organs. The companion connection shows an entity entirely separated\nfrom the human, an auxiliary organ only in its serving nature. The robotic\ncompanion proves a dauntingly large task not coming out of the research lab\nany time soon. For the physical connection, I considered the connection between\nan actual prosthesis and the flesh and explored two views of considering the\nprosthesis as part of the body, and considering the prosthesis as separate. The\nvirtual connection is invisible, but no less painless. The download may be\nlagging from the upload in terms of importing from the body and onto the\nbody, but the online presence continues to group. The chemical connection is\npoorly understood and complicated to examine, as its elements are invisible\nand its side effects unknown. Finally the social connection allows man to form\nlong term attachments with machines, attachments with an emotion of a kind\notherwise absent in technological research.\nReferences\n[1] Manfred E. Clynes and Nathan S. Kline. Cyborgs and space. The Cyborg\nHandbook, pages 29-34, 1995.\n[2] Sigmund Freud. Civilization and its discontents. W.W. Norton & Co.,\n1989.\n\n[3] Lisa Guersney. At airport gate, a cyborg unplugged. New York Times,\n2002.\n[4] Donna Haraway. A cyborg manifesto: Science, technology, and socialist-\nfeminism in the late twentieth century. 1985.\n[5] Sarah S. Jain. The prosthetic imagination: Enabling and disabling the\nprosthesis trope. Science Technology Human Values, 24(1):31-54, 1999.\n[6] Cory Kidd and Cynthia Breazeal. Robots at home: Understanding long-\nterm human-robot interaction. IEEE/RSJ International Conference on\nIntelligent Robots, 2008.\n[7] David T. Mitchell and Sharon L. Snyder, editors. The Body and Physical\nDifference: Discourses of Disability (The Body, In Theory: Histories of\nCultural Materialism). University of Michigan Press, December 1997.\n[8] Byron Reeves and Clifford Nass. The Media Equation: How People Treat\nComputers, Television, and New Media Like Real People and Places. Center\nfor the Study of Language and Inf, 2003.\n[9] Vivian Sobchack. Beating the meat/surviving the text, or how to get out\nof this century alive. Body Society, 1:205-214, 1995.\n[10] Allucquere Rosanne Stone. Split subjects, not atoms; or, how I fell in love\nwith my prosthesis. Configurations, 2(1), 1994.\n[11] Lucy Suchman. Human-Machine Reconfigurations. Cambridge University\nPress, 2007."
    },
    {
      "category": "Resource",
      "title": "Site Visit Tools",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-850j-the-anthropology-of-cybercultures-spring-2009/a82686d8540660324c89fe3b4a5c28a1_MIT21A_850Js09_sw03.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n21A.850J / STS.484J The Anthropology of Cybercultures\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nSite Visit Tools x 1 of 16\nSite Visit Tools\nAnthropology of Cyberculture | Spring 2009 | Professor: Lucy Suchman\nAbstract\nWhile digital computational tools have improved many aspects of architectural\npractices, most Indonesian architects have not gained the benefits from these digital tools that\nhave been garnered at the most industrial countries. However, despite of that, architectural\nproductions remain exist and in same case, the outcomes are exceptionally satisfying, in terms\nof design quality. So, rather than viewing the absence of digital automation as liabilities, the\ncurrent state of technology in Indonesian architectural practices should be seen as a chance to\nreconfigure the relation between architects, tools and the design.\nConsidering many discourses of design tools have been scrutinized in the process of\ndesign modeling, documentation, building analysis and fabrication, this ethnographic paper\nfocuses more on site-visit activity. Especially in extending the possibilities that architect's mind\nand body might contribute in analyzing the site, instead of merely looking at the dichotomy of\ndigital and analog tools. The paper is mainly based on my own experience as a professional\narchitect in Indonesia and as a scholar who are currently studying digital computation tools in\nMassachusetts Institute of Technology (MIT). From this perspective, in the juxtaposition of\nmanual and automation, the paper illustrates how a different way of using tools in site-visit may\nhighly impacts the way architect think and eventually affects the outcome of the design.\nAnthropology of Cyberculture | Spring 2009\n\nSite Visit Tools x 2 of 16\nIntroduction\nGlobally, digital computational tools have improved many aspects of architectural\npractices, including design, construction, and post-occupancy analysis. For example, in the\ndesign phase, architects, together with other engineers, can anticipate the cash-flow and\nschedule of the project through Building Information Modeling (BIM). In corresponding to the\nsurrounding environment, architects can anticipate not only the way the physical environment\ninfluences the building by calculating the airflow, humidity and sunlight, but also the way\npeople behave within the design, for instance by simulating the flow of people in transportation\nbuilding (airport, station), in busy pedestrian intersections, while evacuating during building\nemergency. In the construction phase, engineers started to use GPS (Global Positioning\nSystem) in fitting out building component on the site, 3D scanner to measure the existing\nbuilding, and robot to fabricate walls, roofs and other elements. In evaluating occupied\nbuilding, architects use sensors to evaluate users' behavior in regard to their use of space for\ndaily activities as well as use of energy for such activities.\nMost Indonesian architects have not gained the benefits from these digital tools that\nhave been garnered at the global scale. For example, computers in Indonesian architectural\npractices are merely used for drafting and drawing. Whereas many architectural firms in the\nU.S can produce many design variations within a different design constraints in a small amount\nof time, most Indonesian firms have to deal with a limited options caused by their technical\nlimitations. However, despite of this inefficiency, architectural productions remain exist and in\nsame case, the deliverables are exceptionally satisfying, in terms of design quality. Several\nIndonesian architects gain international recognitions with the so-called primitive tools, some\neven do not use computer whatsoever. In fact, some of the world-class architects (Tadao Ando,\nI.M.Pei, Kengo Kuma) explicitly stated that they would not depend on computer as their\nprimary design tools. So, rather than viewing the absence of automation as liabilities, I see the\ncurrent state of technology in Indonesian architectural practices as a chance to contemplate on\nthe dilemmatic questions, such as to which direction should this automation be conveyed and\nhow should we reconfigure the relation between architects, tools and the design outcomes.\nThis paper proposes that to place the notion of tools in architectural design process\nappropriately, one should not start by looking at the dichotomy of digital and analog tools.\nInstead, it should begin by extending all the possibilities that the architect's mind and body\nAnthropology of Cyberculture | Spring 2009\n\nSite Visit Tools x 3 of 16\nmight contribute to design process as a tools. The paper will compare the role of tools in the\nrelationships of mind, body and their 'prosthesis' (analog and digital tools), based on an\nethnographic approach. It is based on my own experience as a professional architect in\nIndonesia, as well as a scholar who are currently studying digital computation tools in\nMassachusetts Institute of Technology (MIT). During my ten years of practice, I have\nexperienced the evolution of tools from the perspective of a user from using a simple\nsketchbook and rulers, drafting table to CAD and Building Informational Modeling (BIM),\nfrom reading the tape measurer, laser measurer to GPS devices, and from testing the model in\nthe wind tunnel to Computational Fluid Dynamics (CFD) program. While at the MIT, I witness\nthe role of tools from the perspective of the tools' creators, instead of a user. There have been\nmany discourses on the digital/analog tools in architectural practice, both technically and\nphilosophically. Yet, many of them come from the context where the digital practice\nprolifically blooming, such as the U.S, Western Europe, and many other industrial countries.\nStanding in this juxtaposition of manual and automation, designing and programming, and\nbetween the Indonesian locality and the MIT universality, I hope to depict the relationship\nbetween the designer and the tools in a fair manner.\nConsidering many thoughts and discourses on the role of digital tools in form-finding,\ndesign visualization, building analysis and fabrication, my ethnographic paper focuses more on\na relatively neglected area of the discussion on architectural tools, which is the site visit. The\npaper aims to investigate the way tools on site visit activity may affect the way architect thinks,\nand also on the way the dialogue between the body and its prosthesis may eventually shape the\ndesign outcome.\nAnthropology of Cyberculture | Spring 2009\n\nSite Visit Tools x 4 of 16\nVisiting\n\"My inspiration came from the land, ... and, of course, from Paul Klee . . . and the\npoetics of his paintings.\" -Renzo Piano (architect, Pritzker prize laureate)\nI start investigating the architect-tools relationship in site-visit, not only because it is\nthe first step in the design inquiry, but mostly because despite of its significant role, site-visit is\nthe most excluded part in the automation of the design process. Although site-visit establishes\nthe framework for the design process, there is currently no specific tool available to analyze the\ncontext, either in analog or in digital version. Most of the tools aim at form-finding,\nvisualization and analyzing purpose. Here, it is necessary to differentiate between site\nsurveying tools and site visiting tools. Site surveying tools refer more to the recording activities\nwith general purpose, such as building bridge, road, dam and other kinds of engineering\nprojects. Site-visit tools aim to reading the site instead of merely recording it. Elizabeth Meyer\n(2005) diversifies a different type of reading the site in Site Citations: \"[1] Site as Framework:\nSite is not an empty canvas, but an articulated field, or a textile with recognizable warp and\nwoof; [2] Site as Figure: the land's surface could be read as both a continuous undulating\nsurface and an articulated field or figures that could be named and delineated; [3] Site as\nFragment: The process of adding value into the site based on geological or ecological feature.\"1\nMeyers's citation grounds the way site should be regarded as an inseparable part of the design.\nArchitects may visit the site after knowing the content of the design (function, budget,\ncapacity and users' needs). For some of them, visiting the site is about envisioning how to fit\nthe design content into the existing context: for others, it is about accommodating the context\nwith the building. 2Yet for most architects, like Renzo Piano, architecture is about the marriage\nbetween the content and the context. By means of context, it is not only understood as the\ntangible aspects of the site (wind speed, temperature, sunlight direction) but also the intangible\naspects of it (social, culture, history). In one of his interview, Piano mention the significance of\n1 Meyer's essay aims to the purpose of articulating site for landscape design. Yet, I regard the translation of\norganic context into more concrete definition parallel to the way architect treat their form and shape. Burns, Carol\nJ; Kahn, Andrea (ed) Site Matter: Design Concepts, Histories and Strategies, Routledge, New York and London,\n2 For Jean Nouvel (Pritzker Lauerate 2008), site visit is an adventure to contextualize the new design.\nhttp://www.charlierose.com/view/interview/9117\nAnthropology of Cyberculture | Spring 2009\n\nSite Visit Tools x 5 of 16\nvisiting the site when designing the Nasher Sculpture Center in Texas.3 He spent a day, from\nmorning until evening, just walking and wandering around the site, understanding the\nsurrounding environment and defining how to respect them. The design result eloquently shows\nhis respect to the neighboring building, Louis Kahn's Kimbell Art Gallery 4\nI did the same activities in Indonesia. To depict the interplay of tools in my site visit, I\ndistinguished the ways of 'visiting' in two phrases:\n[1] I visit the context, record the surrounding environment, and envision my intention in\nthere.\n[2] I 'browse' the context, 'save as' the surrounding environment, and 'upload' my\nintention in 'there'.\nIn the first phrasing, I physically come to the site, whereas in the second one, I am\nrepresented by my agent: electronic devices, literature or advance internet features such as\nGoogle Earth. Here, the concept 'visiting' contains recursive verbs (save-open, visit-leave,\nupload-download), in which, there is a different tool for each verb. Visiting becomes this\ncomplex verb caused by the tension between tangible and intangible aspects that underlie a\nparticular context. In addition to Meyers Site Citation and Piano's consideration to the\nsurrounding building, visiting Indonesian context does not merely mean reconfiguring the\nlandscape features or creating dialogue to existing building. Within Indonesian diverse social\ncommunity, visiting also mean engaging in dialogues with the local people; observing their\nbehavior, and reading the reference about the local significance of the place (history, art, and\nculture). In this context, visiting is more about connecting human to human instead of building\nto the site. Accordingly, the term 'tools' could not be referred only to the dichotomy of analog\nor digital devices such as sketch pad, tape measure or digital camera. Instead, Visiting Tools\nshould be expressed in the relationship between architect's body and their prosthesis, in which\nboth can play equally as a tool. For the first way of visiting above, I prioritize this ethnographic\napproach to the role of my body in understanding the site while I physically there.\n3 Charlie Rose : Pritzker Prize, http://www.youtube.com/watch?v=uppP9LxCuV0\n4 One can be easily relates the way Kahn divide the space of the gallery into a series of parallel rectangular boxes\nto Piano's Nasher gallery. In fact, Kimbell-Gallery's Composition also reflected in another building in the\nneighborhod, Tadao Ando's Fortworth Art Museum.\nAnthropology of Cyberculture | Spring 2009\n\nSite Visit Tools x 6 of 16\nThe Body\nThe modest example in Architecture and You, (Caudill; Pena; Kenno, 1978) illustrates\nhow people encounter space in chronological order: from physical experience, emotional\nexperience to intellectual experience. Imagine, in the rainy day, a woman get off from a taxi,\nstart looking for a spot for shelter and eventually gets covered under a canopy of a building for\na more comfortable situation. Her body says \"I like it here.\" She then starts looking around and\nfinds that she likes the building. Her sensuous experience says \"I like the shape, the texture,\nand the colors.\" Later on, her intellectual being -supposed she has knowledge in design-\nexplain why she likes it: \"The choice of color makes the room looks warmer, and that little\naccent balance the dominant composition of the wall.\" 5 This illustration perfectly fit to the way\nmy responsive body immediately takes a lead in experiencing the site.\nBody as the sensor\nMy responsive body instantly evaluates the physical conditions as the body becomes my\nfirst tool on the site. My skin acts as the thermometer, barometer and humidity measurer that\nevaluate the local climate. My eyes measure the sunlight exposure, depth of field, dimension,\ncolor and other elements in my sight. In comparison to this Aristotle's five-senses\n(sight,smell,taste,touch,hear), Kent Bloomer and Charles Moore, in their books Body, Memory\nand Architecture (p.33), add other useful senses definition: basic-orienting and haptic sense,\nwhich are based on J.J.Gibsons's proposal, a psychologist focusing on visual perceptions. Basic\norientation refers to our postural sense of up and down which, because of its dependence on\ngravity, establishes our knowledge of the ground plane. The haptic sense is the sense of touch\nreconsidered to include the entire body rather than merely the instrument of touch, such as the\nhands. 6 Gibsons' senses explain how my body orients itself in responding to my preferred\nspatial quality of the space. On a sloped site, I try to stand on a more flat surface. On a coastal\nsite, I tend to orient myself facing to the sea. When the wind blows too hard, I slightly bend my\ntorso and cross my hand to hug my body. Gibson's basic-orienting sense is perhaps the most\ninfluential tool in deciding the basic orientation of the building, while other senses may\n5 Caudill, William Pena and Paul Kennon. Architecture and You: How to Experience and Enjoy Buildings.\nWatson-Guptil: New York, 1978\n6 Bloomer, Kent, Charles Moore and Robert Yudell. Body, Memory and Architecture. New Haven and London:\nYale University Press, 1977.\nAnthropology of Cyberculture | Spring 2009\n\nSite Visit Tools x 7 of 16\ncontribute to the more detail parts of the design. For instance, the way I react when the sun\nexposure is too bright (wearing a sunglass, narrowing my sight or wearing a hat) will reflect on\nthe way I design the opening (doors and/or windows).\nBody as the ruler\nIn addition to the climate condition, my visual perception can also measure the\ndimension of the site by using my own body or an existing site element as the ruler. For\nexample, I can have my own height (180 cm) as the basic unit, and using it as a module to\nmeasure the dimension of the site. Or since I have the knowledge of the average doors height (2\nm) and floor to floor height (2,7 - 3 m for single storey and 3 to 4 m for multi-storey), I can use\nthat element from the existing building next to the site as my own units instead of using\ninternational system units (metric and feet). In fact, the use of anthropometric system in\ncalculating the site is more compatible with the context of Indonesian local culture. Julian\nDavison, in his text on Introduction to Balinese architecture, illustrates the way Balinese people\nuse the hands and legs of the house owner as the basic units. For example, the dimensions of\nthe house column diameter are based on those of the palm and the hand. They multiply the\nlength of the owner's foot by eight and a half to define the distances between the columns in\nthe housing compound.7 The indigenous unit in this tailor-made house will generate design\nthat is more convenient to the owner instead of using the standardized dimension based on\ninternational architectural standard.8\nBody as the social medium\nIn relation to the social context, my body mediates my communication with the local\npeople and their social systems. Amos Rapoport, in his House, Form and Culture, state the role\nof social issue between human and its nature. Rapoport argues that placing the building on site\nis mainly influenced by the social factors (family or clan structure); relation to their food\nresources; attitudes to nature; the needs of sacred orientation; and the symbolism of landscape\nfeatures.9 Social visiting to the non-physical context requires my soft-skill ability to be installed\n7 The undagi (the local architect-builder) record all this measurement on a bamboo stick for the use of the house\nbuilders. Davison, Julian. Introduction to Balinese Architecture. Singapore: Periplus Asian architecture, 2003.\n8 Some references on human dimension such as, Architect Data (Neuferts), created in military systems where the\nproportion has been predefined by the entry requirement.\n9 Rapoport, Amos. House, Form and Culture. Englewood Cliffs, N.J: Prentice-Hall,1969.\nAnthropology of Cyberculture | Spring 2009\n\nSite Visit Tools x 8 of 16\nin me as a tool, such as the local language as the currency for my social exchange and\nknowledge of the local norm for the setting-up of my social interface. Otherwise, I will need\nanother body (the local guide) as my social medium. Considering that site may be composed by\na particular social system, this social visit is highly critical to capture the meta-data hidden\nwithin the animation of such system. Robert Sommer, in his book Social Space, distinguishes\ndifferent dimension of this meta-data such as personal space and territory based on several\nbehavior observation. The four and a half tatami's room in traditional Japanese house refers to\nthe personal space in engaging intimate scale to the room.10 In addition, the longer I stay on the\ncontext, the more the hidden dimensions are revealed. In my own experience visiting\nSundanese dwelling in West Java, I sense the meta-division of gendered space in the house.\nKitchen belongs to the woman and is always placed at the back of the house, the most private\none. Terrace, which is more public, is the place mainly for man.11 Similar to an actor using\nhis/her body as their character's container, I can sense this hidden context by using my body as\nthe social medium, which means embodying other people's minds and emotions and recording\nthe way that meta-dimension circumscribes my body.\nBody as the simulator\nAll these inquiries, by using my body as a sensor, a ruler and a social medium, then\nguide me to define my design approach. Although these senses and references do not indicate a\nspecific unit's scale, such as meter/feet or Celsius/Fahrenheit; they lead my mind to reach a\ncertain level of standard in the emotional scale: whether the site is satisfying or disappointing,\narrogant or easy going. As Julian Davison noted that in many Indonesian societies, the human\nbody provides a metaphorical model for representing the divisions of space within the house, it\nis inevitable for me to consider my presence on the site as analogous to the presence of my\ndesign.12 The attitude of my responsive-body, my anthropometric reference and my social\ncharacter will reflect the attitude of my design approach afterward. For Amos Rapoport, this\nman-nature relationship will be an important aspect of design creation and the relation to\nlandscape is the first aspect which needs to be considered. Furthermore, Rapoport classifies this\nrelationship within three types of attitudes: First, I can be religious and cosmological, regarding\n10 More on this topic see Sommer on Social Design and Oscar Newman on Defensible Space\n11 Muslimin, Rizal. Physical Development Pattern of Cipta Rasa village, West Java, Undergraduate Thesis,\nBandung: 1998\n12 Davison, Introduction to Balinese Architecture, 7.\nAnthropology of Cyberculture | Spring 2009\n\nSite Visit Tools x 9 of 16\nthe environment as dominant and myself as less than nature; second, I might regard my self as\nresponsible for nature and establish a mutual symbiotic relationship with nature; or third, I can\nbe more exploitative and act as the creator of the new environment.13 In addition to Rapoport's\ntypes of responding to nature, Bloomer and Moore associate the role of body-feeling to the\ndirectional preference, for instance, the use of verticality reference in expressions such as\nFeeling 'Up' and Feeling 'Down'. Furthermore, Bloomer-Moore extends the way our body\norients to its space.14 Orienting Upwards may imply praising, striving, and feeling superior,\nwhereas downward may indicate being humble, feeling depressed or expressing condolence.\nFacing front is the orientation toward mobility representing strength and virtue, while back has\nprivate and earthy implication. When we get close to something really tall, we feel shrunk,\nwhereas when we orient to a vista (sea, scenery), we feel our body expanded. Daniel\nLibeskind's Jewish Museum in Berlin is a good example in articulating Gibson's body-sense15.\nInside the ground floor of the museum, the presence of my basic orienting system becomes\nmore dramatic than before. In order to simulate the chaotic experience and suffering of Jewish\ncommunities during the Nazi's occupations, he distorts the visitors' basic-orientation by tilting\nthe floor plane in certain degree so that people could not walk straight easily. In simulating the\ncamp concentration, he builds a dark and a very high ceilinged chamber (the Holocaust Void)\nwithout any lighting except for a small hole at the top which connect the inside to the outside.\nInside that dark chamber, I am instantaneously facing upward, looking at the hole as the only\nlight sources in the room. This gesture is effective to help me understand how it feels being\ninside a concentration camp.\nWhile Libeskind's museum connects body-movement with history, basic-orientation\nsense in some Indonesian culture is more secluded within both their concept of divinity and\ntheir respect to the surrounding environment. Davison illustrates Balinese orientation system\nbased on Nawa-Sanga, in which they use the Tripartite Universe (the underworld, the world of\nhuman, and the heavens abode) to place the building on the site. For Balinese, the mountain\n(kaja) is identified as the abode of the gods and therefore, they should put the temple -the\n13 Rapoport is use the term 'I-Thou' and 'I-It'. The first two approaches are 'Thou' as the relation is personal, and\nnature is to be worked with, whereas 'It' referred to the third approach as 'it' to be working on, exploited and\nused.. Rapoport, House, Form and Culture, 8.\n14 Bloomer, Moore, Yudell, Body, Memory and Architecture 7.\n15 Libeskind uses the term 'between the lines' for his design concept. More about Jewish museum design concept,\nvisit the website http://www.daniel-libeskind.com/projects/show-all/jewish-museum-berlin/\nAnthropology of Cyberculture | Spring 2009\n\nSite Visit Tools x 10 of 16\nsacred place-- closest to and facing the mountain, whereas the sea (kelod) is considered as the\nhome of the demons and malevolent spirits and therefore, that's where the entrance should be\nput. 16\nWithin over 200 million people, Indonesia is considered as the most diverse country in\nthe world with more than 740 ethnic groups and 583 languages. Each ethnic group may have a\ndifferent orientation method. So clearly, in its role as the simulator and social medium for such\ncontext, my simulator-body may also act as the carrier of belief system.\nThe Prosthesis\nIn the previous part, I have celebrated the way my body can independently retrieve\nenvironmental and social data without the assistance of external tools. Yet, this notion of body\nindependency could mislead me in sharing my perspective of comparing the body to the other\ntools as I might undermine the tools or even consider them no longer necessary. To avoid this\nbiased view, I switch my celebration to the external tool side and use the term \"prosthesis\" as\nthe body assistance in visiting activities. The term \"prosthesis\" refers to 'an artificial device to\nreplace or augment a missing or impaired part of the body'17. The way Vivian Sobchack praises\nher prosthetic leg in her essay, Beating The Meat, parallels to my expectation in using this\nexternal tools. Sobchack wants her prosthetic leg to accommodate her, rather than she\nincorporates the prosthesis. She also wants to have a more transparent prosthesis that she\ndoesn't even feel wearing it. In considering the role of tools as prosthesis, Sobchack warn that\nin the (inter)face of the new technological revolution and its transformation of every aspect of\nour culture (including our bodies), we have to recognize and make explicit the deep and\ndangerous ambivalence that informs the reversible relations that we, as lived-bodies, have with\nour tools and their function of allowing us to transcend the limitations of our bodies18 . This\nwarning is essential in the case of how architects need to handle their tools in design process.\n16 For the Balinese, everything has its correct place in the world, with the gods being placed on high, the\nmalevolent spirits being positioned in the lowest regions, and mankind sandwiched between the two. Davison,\nIntroduction to Balinese Architecture, 7.\n17 Merriam-Webster Online Dictionary. http://www.merriam-webster.com\n18 Sobchack, Vivian, \"Beating the Meat/Surviving the Text or How to Get Out of this Century Alive,\" Body and\nSociety no. 1(1995): 205-214.\nAnthropology of Cyberculture | Spring 2009\n\nSite Visit Tools x 11 of 16\nFor that reason, in visiting the site, I demarcate two distinctive domains between the\nconfirmatory prosthesis for my lived-body and the body avatar prosthesis for the techno-bodies.\nProsthesis as the Body Confirmation\nPeople wear glasses not because they can not see at all, but because they want to\nsharpen the blurry image they see at a comfortable distance. They can still refocus their sight\nwithout the glasses by moving the object forward or outward. From my previous visiting\nactivity, all the data that I gain with my body as tools are uncertain: blurred map, blurred\npicture, a vibrant data. So, in order to get a more precise dimension, I consider tools such as\ntape measure, aerial photograph, and GPS device as my prostheses in focusing the image.\nWithout such confirmation, my design dimension will be imprecisely fit into the site.\nProsthesis becomes even more essential in a limited situation where precise dimension\nare highly demanded, such as a small lot in a very densely populated city, a renovation project\nto an old building, or a stiff slope land on the hilly contour. Consequently, the level of\nconfirmatory tool is proportional to dimensional preciseness in design. The higher the demand\nfor preciseness in design, the more reliable confirmation prosthesis is needed. My high rise\nbuilding projects demand more confirmatory prosthesis, such as seismic survey devices, in\nassessing the physical context rather than a single two-storey house project. Complex functions\nsuch as hospital require more confirmatory prosthesis in accommodating complex activities. In\naddition, large scale project, such as urban design project, will need a physical model of a\nspecific urban tissue to confirm my body-ruler about the scale of the site.\nProsthesis as the Body Avatar\nHaving a prosthetic leg doesn't only mean to replace the leg to be able to walk again,\nbut also to run faster.19 Many architects rejoice the initiation of Google Earth in 2005, including\nmyself because the idea of visiting the site virtually makes a significant difference in terms of\ntime and cost. In this case, representing my physical body as the virtual avatar does not only\nmean to by pass the procedure of transports and places my body on the site, but also redefine\nthe tools that my body provides (sensor, ruler and simulator). In using the Google Earth, I can\ninstantly measure the site by using the ruler with any unit that I want, and instantly evaluate its\n19 Athlete, actor and activist Aimee Mullins who use prosthetic legs once provoke controversial issue caused by\nher prosthetic legs in marathon competitions. http://www.ted.com/index.php/talks/aimee_mullins_on_running.html\nAnthropology of Cyberculture | Spring 2009\n\nSite Visit Tools x 12 of 16\ndistance to the surrounding object as well. I can turn on and off multilayer system that overlay\nthe aerial photograph. For instance, I can turn on the climate feature to inform me about the\ntemperature, humidity, wind speed and even cloud animation of the site during the day. Street\nview is available for me to virtually walk along the surrounding neighborhood. Moreover, I can\nvirtually place my digital design onto the site in the Google Earth and see how it relates to the\nexisting condition.20 For instance, I can check whether my design will block or be blocked the\nview to or from other building.\nProsthesis as the Desire Simulator\nIn my physical presence, my responsive-body creates delineations of how I should\nelaborate the site with my design. My sensor will warn me when my desire tries to push me\ndesign a certain space which is not comfortable to my sensors. Here in this body-avatar, the\nabsence of my body-sensor makes it hard for me hard to feel the physical quality of the site.\nMy desires for more aesthetic, more convenience, more power and more fantasy will create my\nown version of the site, a simulacrum, and ignore the error detectors from my sensors. This is\nmy desire speaking: My ignorance of the scale, climate, social and surrounding nature could be\nboth my weakness and my virtue. I may no longer be sensitive to the scale but my out-of-scale\nbuilding may contribute to a new radical approach for the context; I may ignore the climate, but\nI can redefine the new roof and opening for that context. In fact, as my desire continues, I can\ntest my new alien building using the Computational Fluid Dynamics (CFD) program to\nrepresent my body sensor in order to evaluate micro-climate constraints within my design. For\ninstance, CFD can simulate how the wind behaves toward my design to see which room will be\nwarm or cold, or simulate how the sunlight penetrates the building to indicate which rooms\nhave little light. Furthermore, today Agent Based Modeling program can even represent the\nbehavior of my body and my psychological response to the site. For example, I can be a digital\nBalinese by assigning the 'Nawa Sanga' rules into my body-avatar, so that the avatar will\nbehave correspondingly toward the surrounding environment such as the mountain and the sea.\n20 In some cities such as New York City and Boston, Google Earth has a feature of 3D building to visual the scale\nof the city. However, most of the cities in the world don't have this feature yet. The only way to simulate the\nsurrounding environment is by creating the surrounding building manually within our site.\nAnthropology of Cyberculture | Spring 2009\n\nSite Visit Tools x 13 of 16\nMind as the Prosthesis for Prosthesis\nHowever, the issue in this architect-tools-site relationship is less about fewer constraints\nmeans more creativity, or about more constraint proposes more contextual design. Instead, it is\nmore to the questions of how I read the site, both virtually and physically. Agent Based\nModeling may convey the rule of cosmological orientation but not my belief as a\ntranscendental matter.\nIn reporting ethnographic research on how the protein crystallographer --person who\nstudies the arrangement of protein molecule structure-- deals with the physical and digital\nmodel of protein molecule, Molecular Embodiments and the Body-work of Modeling in Protein\nCrystallography, Natasha Myer brings the problem of how such abstract matter are really hard\nto be represented both by the physical and digital representation. Beside the question of\nimagining the atomic scale of the molecules into the scale that is compatible with human, the\nmodel also lacks the representative feature of how the molecules related to each other and to\nthe network of the human anatomy. The crystallographer, then needs to embody themselves\ninto those molecules models and at the same time creates those molecules in their head. 21 In\nusing the scaled model as the site representation, both physical and digital, Myers's study\nreflects the most important, yet most neglected aspect in site representation: that model, both\nphysical and digital, can represent the form but not the systems (social system, basic orientation\nsystem, haptic system and belief system). Consequently, to simulate the system of the site, I\nhave to incorporate my mind to that particular prosthesis (the model) as the body avatar, while\nat the same time placing the prosthesis inside my mind. Embodying my mind into the model,\nand vice versa, enables me to revisit the meta-system of the site.\nAt this stage, I have reached the point where both my prosthesis and my body are\nassisting each other, by having the model-in-the-screen, the model-in-the-hand, and the-model\nin-the-head. To avoid misperception caused by being far from the physical site, I revisit a\ndifferent type of embodiment between my body-avatar and my physical body in two domains:\nbetween point and line and between plane and volume.\n21 The crystallographer uses their hand and body gesture envisioning themselves manipulating the protein\nstructure. Myers, Natasha, \"Molecular Embodiments and the Body-work of Modeling in Protein Crystallography,\"\nSocial Studies of Science no. 38 (2008): 163-199.\nAnthropology of Cyberculture | Spring 2009\n\nSite Visit Tools x 14 of 16\n0D versus 1D\nIn measuring the dimension the boundary on site, I use my body as a ruler to trace the\nperiphery. I pull the tape measurer or holding a GPS device and walk from corner to corner to\nrecord the point coordinates in a series of ways. In a more detail element (such as in renovation\nproject) I expand both my hand to stretch a line to draw the as-built drawing.22 On the other\nhand, my body avatar measures the object in parallel way. 3D scanner, currently the fastest way\nto record building dimension, takes a snapshot of an object in the same principles as bats use\nsonar 'to see' an object. The laser beam, as sonar, records all the points coordinates that inhabit\nthe surface, and redevelops it in 3D digital image.23 So instead of tracing the line, my body\navatar draws by multiplying themselves into a millions avatar, touch all each point on the\nsurface, record the coordinate and report the coordinate to the scanner at once. Whereas my\nphysical body records the site by starting one point for each corner, creating a line and then\nconnecting each line to create a plane. Consequently, the absence of my body-trace means I lost\nmy movement experience on the site. For Robert Yudell, this means the lost of the dialogue\nwith my site as he states: we make places that are an expression of our haptic experiences even\nas these experiences are generated by the place we have already created. Our bodies and our\nmovements are in constant dialogues with our environment.24\n2D versus 3D\nDifferent modes of inhabitations also mean different kind of visual experience. In\nexplaining the world of the fourth dimension (4D), Carl Sagan, a physician and a TV host,\ndiscreetly shows how hard it is to think the existence of a different dimension, while living in a\nspecific dimension. He lays a set of two-dimensional geometrical shapes: square, triangles,\ncircle, made from papers, to represent the world of two-dimension (2D), and an apple to\n22 As-Built Drawing refers to drawing of the existing building. It use as a basic reference to add or subtract\nelement from the site. In other case, as-built drawing is use to measure the deviance (dimensional different) from\nconstruction drawing and the built construction. The smaller the deviance means the more accurate the\ncontractor/builder works.\n23 In practice, the picture processing consist of several level: [1]point clouds: Initial data retrieval is collected\nthrough 3D scans; [2] object initialization: Structural detail, which represents the components and their mutual\nrelationships, is created by fetching or matching points with geometries like mesh or various shapes of primitives.\n[3] Attribute designation: Initialized geometry objects are mapped with images or textures to illustrate surface\nattributes. Shih, Naai-Jung; (The Application Of A 3D Scanner In The Representation Of Building Construction\nSite)\n24 Yudell, furthermore, give an example of the spatiality of movement. For instance, the dance and the space\nanimate one another as partners. While moving in space, the dancer continuously aware of their sense of body\ncenter with the pull of gravity. -Bloomer, Moore, Yudell, Body, Memory and Architecture 7.\nAnthropology of Cyberculture | Spring 2009\n\nSite Visit Tools x 15 of 16\nrepresent the three-dimensional (3D) object that wants to chat with the member of 2D. The 2D\nmember can not see the overall image of the apple since when entering the 2D world; the apple\n(as Sagan cut the apple slices by slices) has to be projected into a set of lines. In the same way,\nalthough being on the site allowed me to sense the three dimensional quality of the surrounding\nobject, there is an enormous gap between my 180 cm height to the more than 1.000 or even\n10.000 m2 area of the site. It makes me feel like a square trying to understand the apple. This is\nwhere my body-avatar, the Google Earth, can effectively help me understand the surrounding\nsite by flying and zooming into it. On the other side, I also need to be sure that my privilege of\nbeing able to fly does not undermine my 180 cm height body experiences.\nDesign Is How We Read the Site\nIn The Mediated Sensorium25, Caroline Jones states how the human sensorium is now\nbecoming more mediated than before. In the past, our ears need only an air or water to mediate\nthe sound wave. For Jones, that condition has been amplified, shielded, channeled,\nprosthesized, simulated, stimulated, irritated today by various sound amplifier. Moreover, Jones\nargues that the ways we mediate our selves reflect the way we think. Clearly, this ethnographic\npaper confirms Jones argument that the different use of tools in site visit can highly impact the\nway architects think and eventually shape the outcome of the design.\nFor a further research, I suggest to those who interested in architect-tools\nreconfiguration, to continue exploring more inquiries on the design and fabrication phase. For\ninstance, how should we emphasize the juxtaposition of the mind and its prosthesis on the\ndesign process and fabrication assembly? Or to be more specific, how the prosthesis decodes\nthe abstract ideas from our mind to the analog or digital media, and then, encodes the\nconstruction rules to fabricate the design? Reconfiguring this architect-tool-object relationship\nin the design process would hopefully make the architect more confident in handling the tools\nand conversely, would make the tools more meaningful to the architect as well.\n25 Jones, A. Caroline: Sensorium: embodied experience, technology, and contemporary art, MIT Press, 2006,\nCambridge\nAnthropology of Cyberculture | Spring 2009\n\nSite Visit Tools x 16 of 16\nReferences:\nBeng, Tan Hock. Tropical Architecture and Interiors: Tradition-Based Design of Indonesia, Malaysia, Singapore,\nThailand. Singapore: Page One Pub, 1994.\nBloomer, Kent, Charles Moore and Robert Yudell. Body, Memory and Architecture. New Haven and London:\nYale University Press, 1977.\nBurns, Carol J and Kahn, Andrea (Ed). Site Matter: Design Concepts, Histories and Strategies. New York and\nLondon: Routledge, 2005.\nCaudill, William Pena and Paul Kennon. Architecture and You: How to Experience and Enjoy Buildings. Watson-\nGuptil: New York, 1978\nDavison, Julian. Introduction to Balinese Architecture. Singapore: Periplus Asian architecture, 2003.\nDawson, Barry and Gillow, John. the Traditional Architecture of Indonesia. London: Thames and Hudson, 1994.\nEglash, Ron and Bleeker, Julian, \"The Race for Cyberspace: Information Technology in the Black Diaspora,\"\nScience as Culture 10 no.3 (2001): 353-374.\nHelmreich, Stefan, \"Life is a Verb: Inflections of Artificial Life in Cultural Context,\" Artificial Life 13 (2007):\n189-201.\nJones, A. Caroline. Sensorium: Embodied Experience, Technology, and Contemporary Art. Cambridge: MIT\nPress, 2006.\nKis-Jovak and Jowa Imre. Banua Toraja: Changing Patterns in Architecture and Symbolism among the Sa'dan\nToraja, Sulawesi, Indonesia. Amsterdam: Royal Tropical Institute, 1988.\nMitchell, William J. Me++: The Cyborg Self and the Networked City. Cambridge: MIT Press, 2003\nMyers, Natasha, \"Molecular Embodiments and the Body-work of Modeling in Protein Crystallography,\" Social\nStudies of Science no. 38 (2008): 163-199.\nNas, Peter J.M. the Past in the Present: Architecture in Indonesia. Leiden: KITLV Press, 2007.\nNewman, Susan, \"Here, There, And Nowhere At All: Distribution, Negotiation, And Virtuality In Postmodern\nEthnography And Engineering.\" Knowledge and Society, Vol. 11, (1998) pp. 235-267.\nPapanek, Victor J. the Green Imperative: Ecology and Ethics in Design and Architecture. New York: Thames and\nHudson, 1995.\nRapoport, Amos. House, Form and Culture. Englewood Cliffs, N.J: Prentice-Hall,1969.\nSchon, Donald A. The Reflective Practitioner: How Professionals Think In Action. Aldershot,\nEngland: Arena, 1991.\nShih, Naai-Jung. \"The Application of a 3D Scanner in the Representation of Building Construction Site\" Advances\nin Engineering Software 38, no. 7 (2007) http://portal.acm.org/citation.cfm?id=1230379\nSommer, Robert. Social Design: Creating Buildings with People in Mind. Englewood Cliffs, N.J.: Prentice-\nHall, 1983.\nSuchman, Lucy. Human-Machine Reconfigurations. New York: Cambridge, 2007: pp. 259-286.\nSobchack, Vivian, \"Beating the Meat/Surviving the Text or How to Get Out of this Century Alive,\" Body and\nSociety no. 1(1995): 205-214.\nAnthropology of Cyberculture | Spring 2009"
    },
    {
      "category": "Resource",
      "title": "Week 2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-850j-the-anthropology-of-cybercultures-spring-2009/af24ee04915100c4c1b4e9c97586ec8a_MIT21A_850Js09_week2.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n21A.850J / STS.484J The Anthropology of Cybercultures\nSpring 2009\n\nStudent A\n\nBooting up Baby\n\nWhile at first it might seem curious, to say the least, to train robots to be able to identify\nand understand human facial expressions and the corresponding causes, the applications\nturn out to be interesting. I do not think that in the immediate future we will be\ninteracting with robots that have a human form and/or sensibility in any meaningful\nway. They might elicit a reaction of wonder, and a need to teach them as we see that they\nare able to learn, but to develop an emotional response, or attachment, will be another\norder of difficulty. That being said, the use of trained robots to detect early signs of\nautism can be a useful application. Some other ideas come to mind. It might be possible\nto evaluate videos of persons and build a structured database of their emotional situation,\nlike to say a way to evaluate news casts and TV programs. The project of Reality Mining\nat MIT Media Lab is working with software that evaluates the tone of voice of people\nspeaking on the phone to determine their emotional situation. This could be used for\nexample to predict upheavals or social unrest, or to gauge the seriousness of a\nsituation. The use of robots or software is important due to the large quantities of\ninformation to be observed, evaluated and classified.\n\nEighteen Century Wetware\n\nWhat I found very interesting in Riskin's paper is the idea of the different stages in the\ninterpretation of the embodiment of intelligence and consciousness. This is an important\nidea that permeates our cyber-world. It took not very long after the end of Monism for\nscientific thought to explore the idea that man is not transcendental, that it resembles a\nmaterial set of instructions and processes that can be explained and copied, however\ncomplex they might be. This of course led to the idea that the mere appearance of\nintelligent behavior was enough to declare that every aspect on a larger scale of\nconsciousness and soul could be copied. It is however interesting that we have somewhat\ndeparted from the proposition of the simulation or reproduction of just human beings and\nbehavior, to initiate the simulation of worlds, situations and social groups. It is as if we\nhave decided that the reproduction of intelligence is hard after all, but that we can create\nreproductions of worlds and let humans play the part of the inhabitants, intermediated by\nvarious forms of identities, robots, programs, avatars and roles. In this simulation the\nrelationship with the human \"puppeteer\" is less important. What becomes relevant is the\nsocial or situational narrative, the capacity to be part in the simulation of a story. Is there\na significant difference between an online avatar and an automaton?\n\nStudent B\n\nThese two readings provide wonderful views into scientific and engineering practice.\nKeller reviews the robotics research taking place at MIT under Rodney Brooks. Riskin\nreviews a moment in history (the second half of the 18th century) when scientists,\nengineers and inventors used machines to simulate organic processes. She proposes that\nthis period in history shares many paradigms with the current project in artificial\n\nintelligence and robotics research that Keller describes.\n\nSimulation and Analogy\n\nRiskin strikes an important distinction between simulation and analogy upon which her\nargument hinges. Simulations \"collapse\" the difference between model and modelled\nwhile analogy simply provides a more graspable description for the phenomenon being\nstudied. For her, simulation enables give and take that allows new learning to flow in\nboth directions while analogy implies a stable set of assumptions about one phenomenon.\nSimulation enables a tightly coupled exchange between technical artifacts and models for\nphysiological processes.\n\nKeller does not seem to share the same open-ended view of simulation though she does\nnot provide an explicit definition in this article. At the end, she raises a concern that a\nself-referencing system of modeled and model leads to circularity. The robots in Brooks's\nlab are designed using specific developmental models. And then these same robots are\nused to study the correctness of those models for human development. Still, she believes\nthat scientists can learn from other successful implementations of simulation and exploit\nthe power of simulations to achieve a spiral (rather than a circular) movement \"with a\nforward momentum\". In our session, I would like to discuss the two definitions to\nsimulation in the articles further.\n\nI am also fascinated by these two takes on simulation because they raise many issues\nabout scientists' and engineers' relationships with their practice. As a scientist Keller\nemphasizes the ability to move forward towards new knowledge. The actors in Riskin's\nhistory are less bound by today's categorical distinctions between science and engineering.\n\nModels of Animacy and Intelligence\n\nThough Riskin sees a strong parallels in attempts to simulate life between the second half\nof the 18th century and the second half of the 20th century there are also some striking\ndifferences. For example, organic and physiological processes were indications of life in\nthe early automata leading up to the extreme example of the defecating duck. Even in\nRiskin's analysis of speech the fascination was with the organic component parts that\nmake the complex sounds we call language possible. In Brooks's and Breazeal's robots,\nspeech is an indication of higher order cognitive abilities and intelligence. Even though\nthese are embedded in material structures they simulate life because of how they are\ninterpreted by other humans to indicate intelligence.\n\nInteractivity plays a central role in establishing the robot's intelligent nature. The Jaqueet-\nDroz automata were not \"interactive\" per se while the most important aspect of the robots\nis their implied sociability and goal-oriented nature. Does this seductive aspect of the\nrobots make them more \"dangerous\" simulations because humans around them begin to\nbehave as if they were new beings? While the automata already imply people's\nwillingness to recognize life-like qualities in machines they probably did not invoke the\nappropriate behavior in people. Today's robots are explicitly trying to invoke those\n\nbehaviors to make human-machine interaction more fluid and intuitive. Does this goal\nstill lead to open-ended exchanges between simulation and nature? Or has the simulation\nsimply become a means to achieving better control over technical artifacts? Or perhaps\nthese interactions were already in place between the automata makers and their machines\njust like they exist between the robots and their \"caretakers\" as Keller calls them?\n\nnote: You can view a movie clip of Breazeal's latest robot called Nexi here\n\nStudent C\n\nHere is the gist of Riskin's wetware article as I understood it:\n\nWhile I find this hypothesis (in fact, dialectic and cyclic ones in general) very charming, I\nwant to throw these two desires into the mix:\n\nDesire 1: \"You and I are both made of same things\"\n\nYou are a two-year-old boy from Egypt and I am a thirty-two-year-old woman from\nKorea, but someday, I might adopt you or donate you a kidney: The desire to confirm the\ncommonalities between all human beings and apply the commonalities to establish\npatterns, communicate, treat illness, sell to and buy from each other, and to predict\noutcome of a given situation assumes a mechanistic world view and supports the\nmaterialist view about life in general.\n\nAs seen in:\n-\nBabel: Film about four interrelated sets of situations and characters taking place\nall over the world, based on the fundamental human emotions\n-\nIKEA: Products with universal appeal, ergonomic virtues and economic\ndistribution\n-\nThe Lady's Dressing Room: Jonathan Swift's 1730 poem in which the protagonist\ndiscovers his true love Celia \"shits\"\nDesire 2: \"I cannot let you control my body and mind\"\n\nIf we figure out all the DNA sequences, will we start engineering babies for sex slaves?:\nAn opposing force against the materialist view is the fear of manipulation and control. As\nwe gain more knowledge about the way life operates, we fear the transparency will\nenable abusive and unjust control of life. Well guess what, you might manufacture some\nbodies, but there is this mysterious thing called \"soul\" that makes us human beings and\nwe will never understand what it is made of. Opacity guarantees that arbitrary control and\nmanipulation will never be fully successful.\n\nAs seen in:\n-\nGhost in the Shell: Manga and animation film about a post-cyberpunk society\nwhere a \"Puppet Master\" commits a large number of crimes through \"ghost\nhacking\", breaking into and taking control of human minds\n-\nDollhouse: TV series about \"Dolls\" who have had their personalities wiped clean\nso they can be imprinted with any number of new personas, including memory,\nmuscle memory, skills, and language, for different assignments\n-\nChristianity: God made us in his shape and that makes us special\nStill reading Keller's :)\n\nStudent D\n\nIn one of the links sent around, the article's author notes, \"Cloaca is not a commentary of\nscience and is not either meant to be useful. The artist actually refused to sell one of his\nmachines to a diaper company that hoped to use it for tests.\" If the writer correctly\nunderstands the artist's intentions, how might we understand a device that explicitly\n\nchallenges scientific expertise even as it generates its own authority (witnessed in the\nvalue of the machine-generated excrement in the art market)? As I read Riskin's wetware\narticle, I found myself wondering about the relationship between automata, the\nmedicalization of the body, and taboo. Madame du Coudray's birthing machine pushes\nthe boundary to what might be acceptable in public - deeply wrapped up in notions of\nsexuality, pollution, and (the medicalization of the) women's bodies. According to du\nCoudray's biographer, she built these machines explicitly as teaching devices to improve\nthe sorry state of birthing in France, suggesting that her machines rendered visible a\nprocess that was previously private or taboo. Riskin's article mentions that she sent many\ncopies of the machine that she sent to midwives around France but in fact she also\ntraveled around the country to personally train many of them in techniques that greatly\nimproved the safety of the childbirth. Here's a map - note the places where she, and\npresumably her machines, were turned away.\n\nRiskin writes that machines in this era focus on capturing life processes, automata that\nwas \"sensitive and passionate,\" but Du Coudray's birthing machine maintains a much\ndifferent position than the Draughtsman Lady-musician. Riskin notes, \"Her breathing was\nwhat spectators most often commented upon. It made her seem not only alive, but\nemotional. She appeared moved by the music she played\" (102). This phrasing - the\nattention to implicit emotion - reminded me of Media Lab graduate Kelly Dobson's\nwork. She recently designed a robot called Omo a watermelon-sized rubber egg that\n'breathes' and senses the breathing of anyone around her. Like the robots that Keller\nwrites about, she's pushed automata a logical next point to explore the emotional\nrelationship between people and machines. Dobson's website notes, \"People and\nmachines co-evolved as companion species.\" According to Dobson, she designed Omo to\nbe therapeutic but not necessarily try to soothe. She's exploring a feedback loop between\na machine and a person.\nSimilarly, Keller notes that research at Rodney Brooks' Cog Lab focuses on how to make\na machine \"an active participant in an affective and intersubjective dialogue with its\ncaretaker.\" Interestingly tensions around stirring emotions with machines exist much as\nthey did when du Coudray built her birthing machines. One of former student of the Lab\nhas since begun building a robot specifically to help autism in young children. I t does\nlead me to wonder how developmental robotics will shape us - and whether any\ncontemporary of the Draughtsman Lady-musician ever found her an affective device.\n\nStudent E\n\nRepresentations and Simulations\nResponse to Jessica Riskin's \"Eighteenth Century Wetware\" and Evelyn Fox\nKeller's \"Booting Up Baby\"\n\nPerhaps the clearest point of connection between Riskin and Fox-Keller's readings is\ntheir concern with the potential of simulations to make explicit-and actually modify--\npeople's conception of the subject of the simulation itself. In \"Eighteenth Century\nWetware\" Riskin shows how simulation in its current sense -a model of the natural world\nused for scientific inquiry- existed as an \"epistemological entity\" (p.98) before the word's\n\nmodern use, in late eighteenth century examples of artificial life and artificial intelligence.\nIn the evolution of automata Riskin sees a field where the definitions of life, emotion, and\nintelligence are under constant negotiation. Automata, Riskin wants us to see, not merely\ndepict life, but reveal the very way in which the notion of life is constructed by their\ncreators. In the constantly shifting boundary of the 'automatable' Riskin sees proof of this\ninterplay, between concepts and artifacts, in the early history of artificial life.\n\n\"Eighteenth century wetware, then, made manifest, not a reduction of animals to\nmachinery, but a convergence in people's understanding of animals and of machines.\"\n(p.115)\n\nFox-Keller's \"Booting Up Baby\" takes a closer look to a particular AI community -\nmainly centered around MIT- and traces the robot's changing goals to point out what she\nconstrues to be an apparent \"disturbing circularity\" between the simulations and the\nsubject of the simulation, where the development of the model takes its own dynamic and\nchanges the model itself. This is reminiscent of Stefan Helmreich's argument in Silicon\nSecond Nature, where it is shown how some Artificial Life researchers made explicit\nclaims about the life-ness of their programs, pointing at the epistemological problems that\narise from a discourse where the metaphorical domain of a simulation is set loose.\nPerhaps more generous, Fox-Keller wants us to see this projection of the simulation onto\nitself -and onto the subject- as a defining feature of \"techno-scientific practice\".\n\nThe opposition between simulations and representations present in Riskin's paper called\nmy attention. Riskin takes Descartes's automata -which didn't mimic physiology- to\nexemplify a 'representational' attitude which conflicts (or contrasts at least) with the\nattitude of his heirs, who attempted to \"collapse the distance\" between automaton and\nsubject by incorporating some mechanistic representation of physiological processes.\nBoth are cases of mechanism, in one, the mechanism as representation, maintains the\ndistance, the artifice becomes a pointer, an abstraction. In the other, mechanism as model\n-or simulation-, the artifice is taken to be alive, or at least, to provide insights into how\nlife works. Vaucanson's duck entails a strong claim: life is mechanism.\n\nThe argument seems a bit unclear, however, when the notion of simulation as a functional\nmodel -that is, defined by its abstract structure- is later changed to involve material\nsimilarity as a proof of the \"simulationness\" of an artifact. Material similarity is arguably\na representational, non-functional, or even cosmetic property of a simulation. The claim\ndoesn't feel consistent with the opposition between \"representation\" and \"simulation\"\nthat seems to be central to the paper. Are the elastic-gum veins proposed by Vaucanson\nmore of a simulation? Or more of a representation?\n\nStudent F - Nadya Peek\n\nI appear to have faultily read Schaffer's account of Babbage's Calculating engine instead\nof Fox-Keller's article, so my response is accordingly off, but regardless:\n\nRiskin compares the relation of man to machine in the seventeenth and eighteenth\ncentury to the current relation of man to machine. The definition of machine has changed\nsignificantly over those centuries, and gone from a puppeted automaton to a computer.\nRiskin writes specifically of how the development of the machine has changed the\ncomparison of life and the machine, and how its development has affected the perceived\nseparation of mind and body.\nWetware is a term coined not so long ago to separate what is now known as hardware\nfrom biologically based systems-- brains, nerves and other systems associated with the\nmind. Wetware is currently viewed as separate from hardware, and those who work on\none uncommonly involve themselves with the other. Previously however, it was thought\nthat to be able to mimic the abilities of man, namely the directed use of the human body\nto produce actions and speech, it would be necessary to also mimic the physiology of\nman. The first attempts to synthesise speech were done by means of the production of\neither vocal tracts, made to mimic the human vocal tract in as much detail as possible.\nThis simulation through reproduction was carried through to other human processes, and\nautomata appeared for less communicative purposes: defecating automata, birthing\nautomata. But also automata for more specific processes, such as the infamous non-\nautomata, the chess-playing Turk.\nWhen Babbage began his work on his analytical machine, he no longer attempted to\nreproduce the processes as they were executed in human computers. Instead he used\nmechanical parts to create the calculation process necessary. Nowadays, speech synthesis\nis in no way done by means of the recreation of the human vocal tract, although Wim\nDelvoye's poop machine Cloaca still attempts to model the human gastrointestinal system,\nbut even this is not done by mimicking the shapes of the human organs. Babbage was\nreportedly the first man to substitute mechanical performance for an intellectual process,\nand thus began the divorce of what were human abilities into human and machine\nabilities. Babbage continued to reposition humans within the process for creating his\nanalytical machine, and thus was also one of the causes for the development of the\nfactory as it is known today, with the marriage of directed human labour and consistent\nmachine.\nNowadays some machines are moving back to the recognisable realm of automata, as\nCynthia Breazeal's research group at the Media lab attempts to make more and more\npersonal and affective robots. For the functions that they envision for their robots, namely\nface to face interaction and discourse with humans, is it necessary that we recreate the\nhuman physiology again, because that is how we recognise emotion? Or would it be more\neffective to abstract the discourse from the face and create software-based systems of\ninteraction?\nNeil Gershenfeld's and Joe Jacobson's groups are both creating logic gates at the cellular\nlevel, and are currently sequencing these into cellular computers. Is now the time that\nhardware and wetware are rejoining?\nStudent G\n\nRiskin proposed interesting phenomena that movement in A.I. has repeated twice during\nthe last three centuries. These repetitions are framed through a series dichotomy of\nAnalog and Simulation in eighteen century 'wetware'. Starting from the way machinist-\nmechanist tried to create an analogy of animal's movement (Maillard's Swan) and the\nway they tried to simulate human physiological quality, later on. In another framework of\ndifferentiation, Riskin also distinguished the purposes of these ancient A.I. avant-garde\nthat: however meticulous and realistic Jaquet-Droz family's machine are, such as writer,\nlady-musician and draughtsman, they are basically a replica of human movement without\nany indication that it will actually replace part of human activities. On the other hand, the\ngoal of a machine that result from analogy of the human body are much more obvious,\nnamely Sebastien artificial hands for those who lost their arms. The same goes to Mme.\nDu Coudray 'Birthing Machine's' that can act as anatomical model to teach the\nmidwifery.\n\nIn addition to Riskin comparison, the dichotomy then aroused again in earlier period of\nindustrial revolution, where most industry manufacturer tried to create analogy of a\ncertain part of body instead of simulating the whole part of the body in a single entity.\nMore recently after the golden age, hardware technology such as Robotic Arms in\nmimicking arms movement and Sonar as analogy of bat hearing, are continuously\nexpanding the practice of analogical movement, known as bio-mimicry. In medical\ntechnology, simulating human organ are became more essential and critical issue in order\nto achieve its functional value rather than just pursuing visual deceiver as in 18th century.\nAs animal and human body 'mutilated' and explored through a different scientific\nanalogy, this modern A.I. artifacts are no longer purposeless. Furthermore, Rodney\nBrooks arguments that software of the mind cannot be abstracted from its hardware are\nsomehow reflecting how analogy are once again demarcated from simulation.\n\nYet, unlike their predecessor in 18th century where there was a rare connection of\nsimulation and analogy products, this time, there is a vague gate in the demarcation of\nanalogy and simulation, in which there is a controller unit connecting the two approaches\nusing the analogy of how human brain works as well as simulating the human mind and\nhuman thinks. Further more, as one can see during the 17th to 20th timeline of how this\nanalogy and simulation were shifted, I suspect that there is no way one can separate the\nquest toward Artificial Intelligence in two different movement such as analogy and\nsimulation. Instead, analogical movements in AI development were always intending to\nuse simulations as starting point and vice versa.\n\nFor this, I have to use a different framework in defining analogy. Antoniades in his book\n'Poetic of Architecture' stated that the way designer acquire ideas from nature can be\ncategorized in three sequences. Literal Analogy, Non-Literal Analogy and Combined\nAnalogy. For examples, an analogy of tree can be translated by literally use the form of\ntree, or non-literally learn the quality that tree can provided, i.e. photosynthesis, shading,\nstructure and other functions. In addition, a combination of literal and non-literal analogy\nwould mimic the quality as well as the appearance of the three, for example a tree-like\nstructure. Thus, instead of went through parallel direction, the quest of machinist and\n\nmaterialist was gradually shifted back and forth in circular process, which I argue using\nAntoniades' classification, were dynamically changes between literal analogy and non-\nliteral analogy. This gradual changes can be traced from the invention of mimicking duck\nmovement, writing, speaking into today incremental experiment in humanoid technology,\nwhich is much likely close to combined analogy.\n\nNonetheless, Riskin's historical insight in wetware machine and Keller's optimism in\nhumanoid robots convey at least two main reasons why one should concern of where they\nstand in today AI innovation. First is that every natural phenomenon including human is\nworth to translate either literally or non-literally in order to establish the future\nfoundation for AI, Secondly, there should be an intense dialogue between literal and non-\nliteral approach as a guidance toward a purposeful machine."
    },
    {
      "category": "Resource",
      "title": "Week 3",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-850j-the-anthropology-of-cybercultures-spring-2009/8f7a55aad0e90bfbb09f0d173b497bdb_MIT21A_850Js09_week3.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n21A.850J / STS.484J The Anthropology of Cybercultures\nSpring 2009\n\nStudent A\nSchaffer had interestingly portrayed how Babbage's strategy in injecting his invention in\nLondon scholarly-tough environment was not just intersected with the socio-politics,\nsocio-economy and religious debates but also required Babbage's personal talent as\nentrepreneur and pseudo-philosopher. The personality issue of the actor behind the\nmachine is again magnified by Norton Wise in his complex insight of how gender,\nhuman physiology and evolution play a significant role in machine development.\nIntelligence Co-modification\n\nThe critical issue in Babbage proposal to popularize his machine, however, doesn't lies\non the skepticism on the functional aspect of the machine -whether or not it's useful or\nmore efficient- but instead, in the suspicion of Babbage tendency to capitalize human\ntalent and local intelligence as his intellectual property. For this, Babbage had to face\nwith two opponents, both from the outside -dealing with the cognitive property of how\nmachine would replace craftsmen -, and from the inside -where he dealt with intellectual\nproperty of his engineer, Clement. At some points, Babbage may have a right to claim\nClement's work as the agreement between the two can still be evaluated. But how would\nhe claim a patent for untraceable abstract property such as cognitive talent or principle?\nShould the Greeks claim and take financial advantage from anyone who use Golden\nSection proportion, Pythagoras theorem or Aristotle's principles? Or should the British\nhave patent for all machine which use Newton's principles? If not, why let Microsoft\nclaim their algorithm?\n\nHere, I believe that it is important to construct the issue of talent acquisition more on the\nhistorical frame rather than ethical debate. Thus, one needs to have a clear orientation of\ntheir position within the A.I. constellation from the past, and also with the other related\nbranch. For instance, in politics, can today's achievements in Robotic Surgery pacify\nMarx's anxiety that machines will stultify human life? Or economics-wise, Linux Open-\nSource Distribution can be opposed to Adam Smith's vision of modern economics? This\norientation on multi-intelligence network will be useful guiding us on the path we have\nchosen, as well as foresee what will be the challenge toward our innovation and the way\nto inject it appropriately into the society.\n\nYet, the controversy between Babbage with the London community is still continuing in\ntoday intellectual capitalization debate. In fact, it became more intricate and highly\npolitical than before, since we are no longer dealing within the scale of the city as\nBabbage had, but more in the heterogeneous global community.\nMachine Feminization\n\nI rather appreciate Wise's essay not in discussing gender merely in term of sexual\nclassification, but rather in the psychological quality that should be embedded in the\nmachine. This translation does not meant to ignore the role of man and woman, but to\nstate the necessity in personalizing machine to enrich their performance which I argue is\nvery much resemble masculine character, less intuitive and too rational. In this agenda, it\n\nwouldn't be enough assigning the right person -man or woman- as the controller but\ninstead, we should actually simulate the feminine character across the system of the\nmachine, such as mimicking the attachment of a child to his/her mother, establishing such\npanoptical system of mother surveillance to their children, and even impersonating\nsensitivity and meticulous attention from feminine character.\n\nStudent B\n\nSchaffer's article puts Babbage's calculating machines in the factories that were\nproliferating in the early to mid 19th century Britain, rather than in the lineage of\ncomputing machines that leads to today's PC. What I found interesting in this piece was\nthe stratification of humans and human intellect rendered visible by the introduction of\nintelligent machines. Behind the familiar confrontation between smart machines and\ntraditional labor was the emergence of a new group-analytical managers/philosophers-\nwho claimed to understand the very working mechanisms of all these seemingly self-\nacting machines. In contrast to the public in the late 18th century who were fooled by the\nchess-playing Turk or other automata, this group of scientist/philosopher/managers could\nunderstand and even design the internal working of these machines, and by extension, the\nentire universe. When Babbage was creating his intelligent machine, he was in fact\ncreating a social and intellectual niche where people like him could respectfully occupy.\nThe niche originated inside the factory but rose above the factory.\n\nI find myself going back to Riskin's article from last week. If we accept Schaffer's\nemphasis on the political and social nature of Babbage's project, can the analogy-\nsimulation distinction be useful in understanding these 19th century automatic machines?\nCan the distinction be made more useful by taking into account Schaffer's concern about\nthe \"geography of intelligence\"? How does \"place\" or \"geography\" matter in analogy and\nsimulation?\n\nStudent C\n\nI appreciated how Schaffer shows how the rise of the technological order required the\nsocial aspects of technological development be rendered invisible. He uses the Babbage\nand Clement dispute as an example of how the political -and economic- consequences of\nthis operation were not unintended, quite the opposite, were sought by an economic and\nintellectual elite, embodied in Babbage, who required obscuring the social order that\nsustained technology -its makers, its maintainers, and even its creators via machine\nsemiotics-to elevate it to the uncontested status that still enjoys to this day. \"The\nimpersonal pronouns in this account are eloquent. To see the automatic world as a system,\nit was important not to see the work force's culture.\" (p.213) I find this act of projecting\nagency outside of the human both problematic and fascinating.\n\nBabbage and Clement's dispute is a rich one. It's a ground for the re-negotiation of the\ndisciplinary boundaries between manager and engineer, and for the discussion of what we\ncall today 'intellectual property'. It strikes me from Schaffer's vision that by helping\ncreate machines that were much faster and precise, skilled mechanicists and draftsmen\n\nwere perhaps crafting their own obsolescence.\n\nCharles Babbage's fetishist obsession with the restoration of a Silver lady helps condense\nthrough analogy Wise's argument of the role of mechanistic metaphors in the\nconstruction of gender roles. Wise unfolds the gender issue of automata in the early\nstages of our industrial era, exemplified in the work of Babbage and some of his\ncontemporaries, tying it to an analogy between a long-standing rooted conception of\nintellect and body and to a -perhaps less obvious- distinction between engine and\nmechanism. Wise shows how this system of analogies was perceivable in the definition\nof certain conceptions of society and biology that entailed \"consequences for the place of\nwomen in relation to men in the nervous system.\" (p.185)\n\nWise's discussion on how in this game of analogies the emotional and the physical are\nmore closely tied to the feminine, while the intellectual and abstract are more tied to the\nmasculine, should be seen as a way to approach how the symbolic power of the\nmetaphors that emerged during the mechanical age affected not only the 'site' of life and\nintelligence, as argued by Riskin in Eighteenth Century Wetware, but also played a role\nin the definition of gender identities by a preeminently white male techno-scientific elite,\nwhere women were seen -clearly- as inferior beings, a sort of automata, a subject of\nstudy, and not as an other.\n\n***\n\nOnly partially related note:\n\nThe image of Babbage's calculating engine being exhibited in a museum as one of the\nhighest achievements of 'early Victorian machine tool industry' together with Henry\nMaudslay's block-making machinery -a machine for fabricating blocks for naval\nconstruction- is an eloquent instance of scientific discourse being socialized and\nchanneled to popular culture and debate via public institutions. It brought me instantly to\nthe very recent Smithsonian Institution's National Air and Space Museum exhibit of\nmilitary unmanned aerial vehicles (drones), perhaps the most 'celebrated' automata of\nour very automated times. What is the gender of drones?\n\nAxe, David. \"Killer Drone Invades Museum.\" Wired, April 28, 2008.\n\nStudent D - Nadya Peek\n\nAfter reading Wise's text, the lack of an account of Ada Lovelace in Schaffer's text on\nBabbage becomes more conspicuous. Ada Lovelace is famous for having written the first\ncomputer program for Babbage's Analytical Engine, one that calculates Bernoulli\nnumbers. She wrote the program before the construction of the Analytical Engine was\ncompleted, and so one might assume that in the dinner parties that Babbage hosted her\nprograms were even more of a hit than jumping from counting in ones to counting in tens.\n\nThe text, however, does focus more on the arguments of Babbage and Clement and their\ndevelopment of the factory. Their arguments seem to be a familiar designer vs. engineer\ndiscussion with issues of intellectual property. If Babbage were to allow Clement to\ndevelop as many machines as he liked, he might not be able to profit from showing it off.\nThe argument does not yet include the fact that he is showing off programs written by\nsomeone else, and that she should perhaps also be credited as the author of the programs.\nThe factory of Babbage and Clement resulted in a division of labour that Wise would also\nlike to see as a division that socially corresponds to gender roles. There is the minding of\nthe machines, and the overseeing of the workers, the former being a caring role for\nfemales and the latter being a task more suited for the rational and forceful male. To a\ncertain extent, this was also proved by the hiring policies at the time, and certainly by the\nfigures that were chosen to depict in automata.\nNowadays, however, there is no real gender associated with the robots that are being\ndeveloped for human companionship. The robots that are from Cynthia Breazeal's lab:\nLeo is a furry creature with an expressive face, Kismet has not discerning features\npointing it in either male or female direction and Tofu looks most like a bird, if anything\nbesides a funny robot. One might argue that Qrio and Asimov by Sony and Honda\nrespectively look more like a boy than they do like a girl, but really they live in an\nasexual realm of corporate unease. Is it the case that gender does not affect our ability to\nrelate to the machine, or even inhibits it? Is this why the robots that are now being\nproduces are so androgynous?\nStudent E\nSomething Interesting\nI appreciated Schaffer's analysis of the \"social and cognitive distance between designers,\nmachinists, and draughtsmen\" (p. 215). The passages reminded me of several papers\nrelated to boundary objects from Prof. Orlikowski's course (see references below). For\nexample, Bechky (2003) studies the distance between engineers, technicians and\nassemblers who draw on different ways of knowing the technologies they design. The\nengineers work with drawings while the assemblers work with machinery. The\ntechnicians alone have access to both drawings and machinery and thus serve as\nintermediaries between the other two groups. I think the questions related to the distance\nbetween Babbage, Clement and Jarvis highlight a similar division where Clement is the\nkey actor who is able to relate to both theoretical, abstract representations as well as\nconcrete, physical instantiations of the machine. These debates show how deeply-rooted\ncertain distinctions between theoretical knowledge and practical knowledge are.\nThese observations are also relevant in connection with Student D's comments about Ada\nLovelace. Though I do not know the specific history, it makes me curious as to whether\nthe distance between the actors discussed above arises mostly from the hierarchy between\ntheory and practice or from the socio-economic class divisions of the time. In addition, it\nraises question about the material or abstract nature of code and whether code can also\nserve as a boundary object.\n\nA Question: Recursive Thinking\n\nWise recursively applies the engine-mechanism metaphor to factory work at different\nlevels of analysis. I'd like to focus on the following passage: \"It will be observed,\nhowever, that following the distinction of engine and mechanism, Babbage's \"engine\" is\nactually pure mechanism, for it does not produce its own power but has to be cranked.\nThe conundrum finds its resolution in the analogy between the calculating engine and a\nfactory. Indeed the factory itself consists largely of pure mechanism. But considered as a\nwhole, the factory is an engine of production, producing goods that carry the value of the\npower transmitted through its mechanism.\" (Wise p. 175) Wise argues that depending on\nthe level of analysis different aspects of the difference engine or factory work can\nalternately appear as engine or as mechanism. From close proximity, the gears and cranks\nof the difference engine are mechanisms, but from a distance and in Babbage's own\nterminology the apparatus has the productive power of an engine. Babbage associates this\nproductive power with superior intelligence, thus the importance of referring to the\nmechanism as an engine in order to reinforce its intelligent nature (even though as\nSchaffer points out this intelligence may have been a mere performance).* In this context,\nI think Wise makes a very insightful observation about Babbage's strategic choice of\nwords. However, at the factory level the same line of thinking leads to an inconsistency\nwhich Wise does not clarify. If the mechanisms inside the difference engine can amount\nto some form of intelligence then the workers (women!) within the factory as a whole\nmust also be operating intelligently. This conclusion blurs the distinction between rote\nmechanism and powerful, intelligent engine. While I follow Wise's interpretation of\nBabbage's application of the terms engine-mechanism to his own machines I think he too\nneatly transfers this metaphor to the complex relationship between machines, workers\nand productive energy within the factory.\n\n* Schaffer describes how the analytical engine was only performing according to certain\npreprogrammed routines. The Wizard-of-Oz behind the curtain was Babbage\npreprogramming certain miraculous and surprising behaviors putting him in the role of\nGod. \"(...) Babbage countered that the world could be represented as an automatic array\nonly visible as a system from the point of view of its manager.\" (Schaffer, p. 226)\n\nReferences:\n\nBechky, B.A. \"Sharing Meaning Across Occupational Communities: The Transformation\nof Understanding on a Production Floor.\" Organization Science 14 (2003): 312-330.\n\nCarlile (2004) cited in Dodgson et al. (2007)\n\nDodgson, M., Gann, D.M., and Salter, A. \"'In Case of Fire, Please use the Elevator:\nSimulation Technology and Organization in Fire Engineering.\" Organization Science 18\n(2007): 849-864."
    },
    {
      "category": "Resource",
      "title": "Week 4",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-850j-the-anthropology-of-cybercultures-spring-2009/cdeae71cb0a404240cc679a7c89fca3e_MIT21A_850Js09_week4.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n21A.850J / STS.484J The Anthropology of Cybercultures\nSpring 2009\n\nStudent A\n\nomething Interesting\nS\nI am fascinated by the writing style of \"Panic Diaries\" which reads like a play and an\nacademic text at the same time. The dramatic sections build up tension through fast-paced\nand somewhat obfuscated views into different characters' mental lives. The gripping style\nrecreates the all-encompassing feeling of panic and fear that was strategically kindled by\nnetworked power structures throughout society including the government, the military,\nresearch institutions, hospitals and the media.\n\nThen the scholarly passages burst the dream-like images in a very matter-of-fact way. An\nexample for this style would be how Orr presents the reader with Anne Parsons's suicide\n(p. 159). At this point in the chapter, it finally becomes clear that the reader is reliving\nAnne Parsons's stream of consciousness in the dramatic passages. Nevertheless the style\nof the dramatic sections makes it easy to identify with the character. I found myself\nidentifying with her and seeing the historic information through her eyes. Everywoman is\nimpacted by the spreading epidemic.\n\nIt is hard not to compare the panic-fostering strategies with the attempts to generate fear\ntoday about terrorism and the resulting need for constant vigilance. Frequent\nannouncements like \"if you see something, say something\" in subways around the world\nfoster the same type of communication-based control loops that seem to have been the\nfoundation for psychological warfare during the Cold War.\n\nIn Bowker's article, the all-encompassing nature of science provides the rational, non-\nemotional counterpart to Orr's chapter. Unlike Orr, Bowker provides a logical, step-by-\nstep argumentation for the rise of cybernetics following WWII from the point of view of\nscience. While Parsons was in the field observing mental patients, Bowker's characters\nlike Wiener were developing abstract models that seemed to explain everything.\n\nA Question\n\nBoth articles address the deterministic nature latent in the \"unified description of\nbehavior\" (Bowker, p. 108). The model implies that the right messages (messages =\nwrappers for information) will elicit specific responses. For example, the mental patient\nis expected to respond to treatment in specific ways that will shift her behavior back to\nthe realm of what is socially acceptable. Parsons attempts to resist the communications\npresented to her, but Orr does not interpret that resistance in light of emergent models for\nhuman behavior. (see the quotations on p. 147 and p. 159)\n\nSimilarly, machines will communicate with humans based on specific inputs and produce\noutputs that can be seamlessly integrated into research. This universal language as\nBowker describes it supports the translation of models and metaphors across all fields of\nscientific research. However, there is no discussion of the changed circumstances and\nspecificities of biological systems versus machines. Physiology, for example, supports\nthe same processes as machinery in space rather than in time. (Bowker, p. 110)\n\nHow can the same responses be expected from such vastly different systems? Where is\nthe agency of the actors involved in constructing the interpretation of the messages? I'd\nlike to explore further the role of agency within these systems to better understand the\nprocess by which these theories spread throughout society.\n\nSide Notes\n\nOn a side note, I was looking into some of Ernst von Glasersfeld writings on radical\nconstructivism as a way into the discussion on agency. (website)\n\nAlso the BBC documentary series entitled \"Century of Self\" provides a great supplement\nto the readings this week. The first series describes the transition from pre-War notions of\npanic as primeval to rational actor models of behavior.\n\nBBC Four, Century of the Self, Episode 1\n\nStudent B\n\nUsing the analogy of how life was first formed on earth, Orr's inquiry introduced the\nideological pressure from the cold war as the catalyst that triggers complex chemical\nreactions within science and society, a panic. From there, it seems that the geneses of\ncybernetics are always repeated pervasively, transcendently and urgently, especially in\ntoday innovations. It becomes more instant since this catalyst can be easily produced in\nthe human society, in which also act as good transmitter for panics as what Miller suggest\n(p.106). It's always interesting to view human as the medium of communication since a\nnetworks of minds can not only transfer information but can also justify themselves into a\ncertain behavior.\n\nWithin this entire component, the evolutional curve of cybernetics should have been\nincreased exponentially, since panic could be embedded in any situations. If pulling the\ncoin out of the bottle can produce a certain amount of panics, then any circumstances can\nbe regarded as Controlled Laboratory Experiment that could simulate a different kind of\npanics in this post-war society: financial panic, political panic, and any type of cultural\nshock from our everyday life. Human are somehow are getting used to be an object of\nsimulation within the system of Goal seeking behavior: as a consumer in commercial and\nentertainment industry, or as a citizen in political milieu, such as in the way U.S.\ngovernment creates condition with their all possible resources during the cold war to\ncreate public awareness on atomic bomb.\n\nUnder that simulation, some practices in cybernetics proved that the goal of all member\nof the lab with their different background can be shifted suddenly into a single communal\ngoal. Cybernetics should have been the synthetic panopticon of our social order.\n\nHowever, there is a missing link in Orr's story regarding the moral issue in the birth of\ncybernetics that prevents that ambition. It's hard not to be skeptical on the issue of good\n\nand bad morale as merely government justification to quantifying information. In a\nreflection to the current vast information society, where almost every citizen has more\nthan enough information and again, become a transmitter on their own, all this crisis --\nenergy crisis, financial crisis-- could not produce a type of panic that could lead into a\ndesired good morale. For this, Galdston's question remains unanswered. (p.104)\n\nStudent C\n\nOrr's Panic Diaries make explicit the role that cybernetics ideas played in Post-War\nsociety. The ways in which panic entered scientific discourse and popular culture, and the\nuse of fear for instilling in civilians the need for strategies for 'total defense' in atomic\nwar scenarios. The FCDA (Federal Civil Defense Act) contemplated the volunteer\ncivilian corps and \"the establishment of communication systems to warn of enemy\nattack\" (p.97) as a \"future way of life\" (p.99)\n\nFacing an inadequacy of the social sciences to contribute to an effective nuclear disaster\nrelief program decision-makers and (social) scientists are shown in Orr's chapter to have\nfound in cybernetics discourse a rich rhetorical plateau, a perfect example of what\nBowker calls in his paper 'triangulation'; a struggle for legitimacy characterized by the\nreliance of one field's findings on another's discourse. It is in this sense that Orr's chapter\nsupports and adds to Bowker's thesis of the rhetoric construction of cybernetics as a\nuniversal science.\n\nIt first struck me that the discourse of cybernetics as described by Bowker is still enacted\ntoday under a different rhetoric coat for various purposes. An example of this would be\nthe discourse of responsiveness in architecture (a discipline perhaps excessively prone to\ntriangulation), which to a large extent sounds like an instance of cybernetics's basic\npremise: that control mechanisms based on environmental feedback have the potential to\ndisplay intelligent behavior; in architecture and design this idea of self-adaptive systems\nand feedback control has been the ground for the same kind of metaphorical reasoning\nthat Bowker points in cybernetics: that houses and living beings are, or can be seen as,\nthe same thing.\n\nThese metaphoric leaps of cybernetic language across disciplines, in which machines are\nmade of molecules and living beings are mechanisms, is nevertheless put forward by\nBowker as a valuable analytical and heuristic tool which is \"still an under-utilized\nresource today\". Does this comment compromise Bowker's stance as a critic? He claims\nhe's just interested in tracing the genealogy of cybernetics as a universal science. I\nappreciated the respect with which he treated the subject.\n\nThe power of a word to attract attention, to entice imaginations due in part to its own lack\nof definition (what can be more vague than a 'science of messages'?), is fascinating. The\nglamour of a word, carefully supported by the triangulation with other sciences, always\nunder the assumption that there is a fundamental underlying 'structure' of messages and\ncontrol for all things living and inert. It is this construction of the legitimacy of\ncybernetics as a science, so relevant to today's scientific and cultural world, what Bowker\n\nmakes explicit in this paper.\n\nStudent D\n\nWow. First I was somewhat bored with the description of public fear and panic control in\nthe 1950s, but juxtaposing it with the development of the field of cybernetics -- that came\nunexpected.\n\nDespite the fascinating literary technique at the beginning, I was somewhat bored (or\ndesensitized?) because it all sounded a little bit too close to home -- South Korea, where I\ngrew up. Albeit the systematic approach or resourcefulness to simulate the A-bomb\nexplosion, Korea technically is still at war with North Korea, and the people have been\nliving the Cold War far and beyond the 1950s. Some examples:\n\n- The national \"monthly civil defense drill\" up until my high school included sirens\nblaring, curfews and instructions to crawl under the desk and cover your eyes, ears and\nnostrils with your bare hands;\n\n- Subway stations in Seoul are at least one extra level deep because they were built to\nfunction as bomb shelters. Some even function as art galleries at the same time;\n\n- When the media spots a stray North Korean plane in the Korean air grid people would\nrush in to stock up rice and water. I still buy and hide water jugs in my San Francisco\napartment in case of an earthquake;\n\n- My high school classmate was excluded from a field trip to near the DMZ (de-\nmilitarized zone) because her grandfather had a history of co-operating with the\ncommunist regime sometime during the 3-year-long Korean war;\n\n- At 5 o' clock in the afternoon everyday, the national anthem would blare out throughout\nthe country and you are obligated to freeze wherever you are and put your right hand onto\nyour chest.\n\nNow that makes me really feel like we were nodes of a controlled system, reactive and\nmindless ones -- thank you, 1988 Seoul Olympics, for putting an end to some of this.\n\nWhile I don't believe the Korean government had an approach nearly as theoretical or as\na close tie with the academia in developing these programs, I wonder now, was it\ninfluenced by the US approach of seeing people and groups as actors in a controllable\nsystem, or was it simply an authoritarian regimen?\n\nAlso: Is the advent of the Internet and diversification of communication channels helping\npeople to be more aware of the government agenda? Or are we becoming merely more\nnetworked nodes with our cell phones delivering to-the-minute messages and news?\n\nIs this relation between Cold War communication and cybernetics theories an established\n\nobservation? This is the first time I encounter it and I still haven't decided if I should\njump in and internalize it -- the writing style of this book may be contributing to my\nhesitation. Perhaps I feel that I might have been subject to the very development\ndescribed in this book and I need more time to sink this in, in order to give a more\nremoved, analytical response.\n\nStudent E - Nadya Peek\nCybernetics considers the structure of communicative systems. The broadness of the\ntopic allows cyberneticists to apply their knowledge to many different levels of\ncommunication- neural communication, interpersonal communication, communication\nfrom a government to a people and from a government to another government. That the\ndevelopment of cybernetics took place in a post-war era is somehow unsurprising-- the\ngovernment to government level of communication was over-illustrated by the cold war,\nand on the other end of the scale, artificial intelligence was attempting to have machines\nlearn by mimicking neural communication and feedback.\nOrr's text places a matter of fact description of a development of cybernetics in the\ncontext of social control and feminism in the 50s. By the end of the text it becomes\napparent that the text is written more or less from the views of Anne Parsons, daughter of\nsociologist Talcott Parsons. However, in the text many questionable things are suggested\nsuch as that Norbert Wiener and Anne Parsons are siblings, or that Talcott Parsons\nmurdered his wife. The fictive parts are not separated from the fact, making the text\ndifficult to interpret, but simultaneously an entertaining read.\nBowker's text is also amusing, as he immediately begins with an outright attack on the\nfield of cybernetics. If your field is broad enough that it may subsume the research in\nneurology, artificial intelligence and control systems, it is not surprising that you will be\naccused of over-generalisation. Attributing an elegant graph or theory can seem very\ndesirable, even for unelegant social interactions, but might not accurately describe the\nphenomena observed. This is then written off again as 'physics envy', and the proposed\nmodels perhaps brushed away too quickly.\nOnce the field is abstracted enough, you might try to agree with Dennett -- the feedback\nloop can have no politics, it is merely an algorithm. But it is an algorithm designed for a\nsender and a receiver, broad categories which can easily be attributed to individuals or\ncountries. When the sender decided to send the message, the listeners will receive it and\nrespond accordingly. What should be placed in this feedback loop and when is certainly a\npossibly political decision. That doesn't mean the medium is not a neutral substrate, but\nits involvement should be studied and questioned.\nStudent F - Yiftach Nagar\n\nIn one of the footnotes of Geoff Bowker's paper (Bowker, 1993), we are told how the\nChilean government has invited a cybernetics expert to \"help manage [the Chilean]\nsociety cybernetically\". This certainly shows the hype that was created around\n\n\"Cybernetics\" in the years past WWII. This example is a pristine demonstration of how\n\"cybernetics\" became an \"inescapable\", \"new universal science\" in Bowker's words. But\nwhat is cybernetics anyway? Bowker sets the background at several developments.\nMainly - on the one hand progress made in technologies (especially: electronics and\ncommunications) that have diminished some of the gap between machines abilities to\n\"think\" and the human brain's abilities to think (e.g. computers were able to perform\ncalculations faster) and on the other - revelations and advancement in understanding the\npsychology of both individual people and the masses (e.g. the ability to manipulate\nmasses of people that was so evident in the Nazi regime) made it seem like humans and\nmachines may be more similar than previously thought. I found the discussion of the\ndiffusion of borders between humans and machines and the exchange of roles interesting,\nand it raised a few associations in my mind.\n\nSo - here are a few glimpses of thoughts, very associative (sorry...) -\n\n1. The role of human masses and masses of machines - who is serving who\nBowker quotes from The Official Soviet Short Philosophical Dictionary (1954), cited in\n(Masani, 1990): \"...for cybernetics an imperialistic utopia is characteristic replacing\nliving, thinking man, fighting for his interests, by a machine, both in industry and in\nwar.\" So whereas Marshal McLuhan talks about tools and technology as \"the extension\nof man\", the cybernetic view expressed in the soviet dictionary is the ironic opposite,\nputting man at the service of the machines. This ironic view reflects a fear of dystopia\nthat has been expressed by many artists and thinkers (cf. Charlie Chaplin's \"Modern\nTimes\" for one example). To a certain extent Amazon's Mechanical Turk actually\nembodies this approach today.\n\n\"A further possibility, amusing in its own way, is an animal computer, which could be\nvaluable for slow speed, essentially parallel data processing. Skinner once used\npretrained pigeons as pattern recognizing automata in a guidance mechanism, and they\nhave also been used in industry. Working along somewhat different lines, Beer and I have\nexperimented with responsive unicellulars as basic computing elements which are\nautomatically reproducing and available in quantity.\" (Pask & McCulloch, 1968) quoted\nin (Bowker, 1993).\nThink about Google for a minute: it is always brought as an exemplar of collective-\nintelligence. But changing our point of view we could also look at it as a machine that\nuses people to feed it (voluntarily) with link structures, picture tags and more, and\nbasically actively working to document their thoughts in service of the machine. The\nborder becomes blurry. (Michael Wesch's excellent clip \"Web 2.0: The Machine is\nUs(ing us)\" (available on YouTube) touches this point brilliantly and in a very engaging\nway).\nI also couldn't avoid thinking about \"The Matrix\" (Wachowski & Wachowski, 1999) and\nmass artificial production of humans...\n\n\"Reproduction has, in the past, often been thought of as exclusively biological, and as\nrequiring very special conditions for its achievement. The truth is quite otherwise: it is a\nphenomenon of the widest range, tending to occur in all dynamic systems, if sufficiently\ncomplex.\" Bowker footnote 36: (Ashby, 1962)\n\n2. So, What is \"Human\"?\n\"Copernicus challenged our human self-image by showing that the Earth was not the\ncenter of the universe; Darwin by showing that humans were not God's special creation;\nand Freud by showing that we are not rational animals, but that much of our thoughts\nand behavior is rooted in biological drives and unconscious proc esses. The present\nvolume contributes a fourth reshaping of the human self-image, as we see that much that\nis human can, at least potentially, be shared by machines.\"(Arbib, 1989)\nI guess we will touch this much more in our discussions of Cyborgs, etc, but this already\nbrought up so thoughts -\n\nI do believe that we are slowly, but gradually marching towards a future where artificial\nintelligence and hybrids of cyber-and-human intelligence (see: Google) will take an\nincreasingly bigger role in the life society and organizations. We are already extending\nour bodies and minds with mechanical, biological and electronic parts. Some are\nembedded in our bodies - like pace makers. Others, we use as exoskeleton devices to\naugment our senses (glasses, hearing aids) and, growingly, we are relying on our PDAs,\nlaptops and the web, to augment both our individual and collective memory and\nintelligence. As the borders between humans and 'machines' are gradually fading post-\nhumanists ideas will become more relevant. Kurzweil's books have been on my radar for\nquite a while, and I should really start reading them. Bowker writes about Norbert Weiner\nwho asked \"how can God play a fair game against the Devil, one of his own creations?\nAnd tells us Weiner claimed that it is possible to play with machines, because they can\nlearn. This reminded me of J.F. Sebastian from the Tyrell corporation in Blade Runner,\nwho makes his own robot toy friends.\n\n3. On imperialism, natural choice/evolution and politics of power\nBowker writes that cyberniticians employed \"imperialist rhetoric\". This is not all that\nsurprising. If we adopt a sociological lens, we can understand the struggle of\ncyberniticians for self-definition as yet another mere struggle for position of influence\nand power - no different than that of other groups of people sharing a vision, a profession\nor an academic discipline (cf. Pfeffer, 1981). We can now view Cyberniticians' (futile, as\nwe now know) attempt at claiming that their metaphor is better than other metaphors used\nby other disciplines as naive (if we believe in the basic good nature of people) or as\nsomething worse. In any case, their sheer lack of reflection, reflexivity and sense of\nhumility is quite striking. All models are wrong, some are useful (George Box). The\nmetaphors of feedback loop and control communications can definitely prove valuable in\nthe pursuit of understanding and describing various phenomena in the world, but\n\nattempting to claim that these are always the only true / best metaphors is, to me,\nsomewhat ignorant.\n\nReferences\nArbib, M. A. (1989). The Metaphorical Brain 2: Neural Networks and Beyond: John\nWiley & Sons Inc.\nAshby, W. R. (1962). The self-reproducing system.\nBowker, G. C. (1993). How to be Universal: Some Cybernetic Strategies. Social Studies\nof Science, 23, 107-127.\nMasani, P. R. (1990). Norbert Wiener, 1894-1964: Birkhauser.\nPask, G., & McCulloch, W. S. (1968). An approach to cybernetics: Hutchinson London.\nPfeffer, J. (1981). Power in organizations. Marshfield, MA: Pitman.\nWachowski, A., & Wachowski, L. (Writer) (1999). The Matrix. USA | Australia."
    },
    {
      "category": "Resource",
      "title": "Week 5",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-850j-the-anthropology-of-cybercultures-spring-2009/6502e604bd50f9fc7c330cf0aec2eb82_MIT21A_850Js09_week5.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n21A.850J / STS.484J The Anthropology of Cybercultures\nSpring 2009\n\nStudent A\nI feel like this week the readings are again relevant to the bit of Dennett picked out last\nweek on 'substrate neutrality'. Cyberspace was initially characterised as being neutral\nspace, as Eglash and Bleecker quote (pg 354):\nOurs is a world that is both everywhere and nowhere, but it is not where bodies live. We\nare creating a world that all may enter without privilege or prejudice accorded by race,\necon- omic power, military force, or station of birth (Barlow, 1996).\nEglash and Bleecker want to find better ways to introduce cultural identity to cyberspace,\nand list examples of black cultural heritage in other systems and artefacts. Having race on\nthe agenda of information technology seems like only part of what should be a bigger\npicture: information technology is allowing many different niches to unite. You can\nhardly think up a habit, fetish or religion or there is a club for it somewhere on the\ninternet.\nThe geography of cyberspace is what enables this. Physical boundaries are irrelevant.\nCyberspace is boundless, there is no maximum capacity. Whereas in the real world we\nare limited by location and physical possessions, in cyberspace there is no space, and\npossessions can be replicated exactly in seconds.\nIn this alternate world, it seems reasonable that we should come up with alternate rules of\nconduct. If a website I host on a server in Canada can be viewed in Ecuador, is what\nEcuador thinks is reasonable content at all relevant? Lessig is proposing rethinking of law\nin cyberspace which Philip echoes in his article, which negates physical separation on\ncyberspace and takes the free-ness of copying and pasting in digital bits into account.\nThere are some problems with this utopian future though. In cyberspace, large silos are\narising where content is regulated-- Facebook, Flickr, gaming communities... If you do\nnot have a name which Facebook acknowledges, you cannot use its services. Germany,\nFrance and a smattering of other countries cannot view photos which have been marked\nas 'unsafe' on Flickr. (One could argue here that Flickr is merely abiding by the law, but\nsimultaneously they are providing a framework for the law to use for this censorship). In\nMicrosoft's gaming community Xbox Live, a girl was recently suspended for pointing out\nthat she was lesbian in her gamer profile (article). Apparently the Xbox Live staff had\nreceived complaints about her profile violating the terms of use. An Xbox Live team\nmember wrote on his blog (source):\nOur current policy for Gamertags and Profiles does not allow expression of sexual\norientation under the Terms of Use. That applies to *any* orientation, straight or gay or\notherwise. Gamers can however self identify their orientation in voice chat, where\ncontext for their statements can be provided.\nA few months ago when this first cropped up as something that displeased people, my\nteam saw that although the policy was objective, it's inelegant.\n\nTo think here that their policy is objective smacks entirely of technological determinism.\nLater it became apparent that Microsoft was selecting on keywords including homo, gay,\nlesbian and hetero (article). That also makes the policy hardly objective.\nIt will be interesting to see how the laws of cyberspace unfold, with or without the help of\nLessig. It's pretty exciting he manages to argue that tools should be allowed to exist\nbecause of the minute part of their existence that can be used for non-illegal purposes.\nSimultaneously I hope that he also does well on fighting the illegalness of these activities.\nBut I'm worried about large portions of cyberspace currently being in cybercountries\nwhere companies like Yahoo and Microsoft are the boss. It's also odd that the main\ncartographer of the internet is Google, even if they vehemently maintain that they are not\nevil. In the end, I have to agree with Eglash and Bleecker-- cyberspace is only neutral in\ntheory.\nStudent B\n\nMaterial Potentialities\n\n\"Lawrence Liang points out that P2P and hi-tech, real-time electronic remixing depend\non high bandwidth and/or state-of-the-art computing power.\" (p. 212)\n\nIn this excerpt Philip inserts a statement into the article that hints at a potential tension in\nbetween the material natures of the technologies discussed in the article and the types of\n\"pirating\" they permit. And this tension may expose a deterministic undercurrent in the\nargument that the author does not discuss further. Briefly, the argument goes: Lessig\nreinstates authorship by identifying the good kind of creative pirating certain tools\nfacilitate. These tools depend on access to software, reliable hardware, and ubiquitous\nconnectivity. Lessig's counterpart in the article, Liang, believes that other kinds of\n\"transformative piracy\" (echoing Lessig) like duplicating, copying are all part of a\nredistribution of creative capital that should be accessible to all. In other words, there is\n\"good piracy\" and \"bad piracy\".\n\nWhile I appreciate Philip's discussion of pirating I wonder if she has not implicitly stated\nan argument by which those \"Asian pirates\" have no recourse because of limited access\nto certain technologies? In addition, she does not discuss the entirety of the IPR being\ncopied and distributed. Not all the counterfeit software/movies/etc. is transferred TO Asia.\nSurely, much of the data is also generated in Asia and then recopied there. How should\nthose instances of piracy be interpreted? This last question becomes interesting in light of\nEglash and Bleeker's arguments for considering home-grown sources for technological\nadvances. There are also examples of low-tech remixing (illegal - videotaping movies in\na movie theater, legal - using open source tools to engage in creative projects because\nyou don't need expensive software to use computers creatively, for example Scratch is\nfree) that might be important.\n\nImaginairies and Material Realities\n\nIn the Eglash and Bleecker article, the authors alternate between material examples of\ncomputation and technological achievement in African tradition and more modern and\ncontemporary imaginairies such as the work of the Afrofuturists. I'm interested in\nthinking more about the relationship between the material artifacts such as musical\ninstruments and weaves and the science-fiction and the futuristic projections. How do\nthey inspire each other? And what is the role of those actors like E. E. Just (p. 366) who\nbridge history, culture and science, technology?\n\nStudent C\n\nTime Frame Fallacy\n\nPhilip and Eglash-Bleecker essays can be both equally and non-equally corresponded.\nThey corresponded in a way each writers traced the quest of western-eastern invention in\nconveying intellectual property issue. However, in spite of this dichotomy of east-west\ngeopolitics, it's also hard to compare each study in a way that Philip discussed the piracy\nissue in a short term period, (mostly in dealing with China-India Syndrome), whereas\nEglash-Bleecker illustrated their Historiography of Africa in more expanded time-frame.\nIf only Philip expanded her timeframe as Eglash-Bleecker did, we might get more\ncomprehensive discourse in questioning the role of authorship and piracy in the\ndichotomy of western/eastern society.\n\nSynchronizing time-frame in intersecting the case of technological author within\norientalism issue is critical in regards to Adrian John suggestion in appreciating and to\nunderstanding the culture of the pirates. (p.206). In the case of Microsoft v. China for\ninstance, perhaps it's not enough to compare the two parties back from the time the\nsoftware was created till the moment it was pirated in China. But instead, one need to\nstart from the time Microsoft also started using China invention, such as: Paper and\nPrinting system. Its sound silly and impractical, yet, isn't it a matter of rewarding one's\nachievement?\n\nLawrence = Lawrence\n\nPhilip's dichotomy of Lawrence Lessig and Lawrence Liang understanding in intellectual\nright is not really convincing. The notion of transformative creativity and the death of\nauthor are almost blurred in a way that Lessig's hopes on good piracy --the multiple new\nartistic and cultural forms created by ripping and mixing-- could only happen if one starts\nasking Liang's question: with this piracy, can I create something? (p.212). the only\ndifference is that Lessig's transformative theory expects new invention by modifying the\nexisting intellectual property, whereas Liang's new creation comes by literally utilizing\nthe property. For example, in Betamax case between Sony and Disney (p.203), Lessig\ngoal might be having a different kind of animation movie such as Manga in Japan, while\nLiang's might be having any kind of new idea from watching the movie, child education\nperhaps. Nevertheless, both Lawrences argued to pursue differences instead of sameness.\n(p.208)\n\nLastly, as I tweaked from Philip in (p.204), Wheels of Invention must not be blocked just\nbecause some may use the product to infringe copyright. Patent Law is just one way to\nreward the author while there is many other kind of reward: money, security, recognition,\ncontrol etc. So, the question here, following Philip intention in the critics of technology's\nsocial network (p.201), is not merely about securing intellectual property but rather to\nendorse a new Creative Reward Systems to drive more affordable and pervasive\ninnovation.\n\n\"The United States government has issued 150 yoga-related copyrights, 134 patents on\nyoga accessories and 2,315 yoga trademarks.\" (source)\n\nStudent D\n\nIn Philips piece the definition of piracy is put forward as a political instrument. Philips\noutlines the political nature of our society's judgement of piracy, one that deems Asian\npiracy unacceptable while elevating other piracies to the category of authorship. Her\npiece, however, doesn't attempt to dismantle these distinctions, but to use them as devices\nto construe a contemporary notion of authorship.\n\nHer argument of piratical appropriation as a pre-requisite of a global science -and\neconomy- goes back to to pointing the foundations of European Renaissance in Islamic\nscholarship, undermining (or attempting to) the highly racialized notion of the pirate as a\nnon-white. In this broad historical conception the archetypal pirate would be white.\n\nPhilips utilizes a portrait of a pirate as an \"agent of inversion of repressive power\nrelations\" (p.202), but again refrains from focusing on this dialectic. Instead, her piece\nattempts to outline a definition of technological authorship, one that examines the current\ndiscourse on piracy as a means to understand the assumptions -on creativity, ownership,\ncitizenship- it is based on. \"In a continuation of Foucault's question 'what is an author?',\nI suggest that we might ask: 'what is a pirate?'\" (p.205)\n\nAnother attempt to shift conceptions of race in the context of technological progress via a\nbroad historical perspective is Eglash and Bleecker's piece. Its aim is re-instating the\nAfrican roots of computation via a fascinating genealogy of the binary system:\n\nAfrican base-2 calculations <- 12th C. Spain <- Alchemist's geomancy (divination) <-\n'Logic Machine' by Raymond <- Leibniz\n\nBeyond the genealogy of computational reasoning and craft, a number of mentions to\nryhtmic patterns as codes are made, and more generally, the notion of rhythm as an\nabstract idea that spanned several domains of perception and reasoning in African\ncultures is explored. The case seems at times hard to buy altogether, but is made\neffectively. It is a fascinating attempt to reconcile contemporary black American culture\nwith a technological past; the goal is to dismantle the narrative of racial exclusion and\ndominance that often underlies technology. In this path they visit black American pop-\ncultural icons (like Collier, a black electronics wizard in Mission Impossible) to trace the\n\nevolution of (the perception of) blacks in American culture.\n\nA slight criticism to Afrofuturism's lack of concern with really scientific issues, instead\nits absolute concern with fiction.\n\nWhat underlies the piece is an acute criticism of de-racialization as an avenue of the\npolitically-correct.\n\nStudent E\n\nI agreed that the Eglash-Bleecker article positioned the relationship between technology,\nidentity and history in a productive way.\n\nAnd their point about what constitutes 'cyberspace proper' is a compelling one. Still, I\nhad mixed feelings about their argument to discourage \"the move to separate 'official'\ncybernetic technologies from those of vernacular street artists or indigenous culture is\ntroubling. Rather than a border guard with bigger walls and less leaky dams, we need\nbetter linkages, ones which allow flow against the hegemonic current\" (364). My concern\nhere is that although their instinct that creating vernacular technologies is troubling, I\nequally wonder about context here. Can we reasonably expect that these technologies will\nbe understood within their proper historical/social/cultural context or does this threaten\nthe existence of private spaces and risk the appropriation of local knowledge by larger\nforces (hegemonic forces) who might tend to focus on the materiality of a technology,\nwrenching it form its cultural identity and from its dynamic position as history unfolds.\nWhat relation might this have to Philip's notion of authorship?\n\nThe article introduced the importance of including historical examinations and made\ninteresting points about the way that technology is examined (specifically the dichotomy\nbetween high-tech/low-tech and inside/outside cyberspace).\n\nI found their point about black appropriations of information technology through cast-off\nhardware compelling in light of my own work around appropriate technologies. Like\nGershenfeld's Fab Lab, which attempts to return \"technological thinking\" to the field\nthrough the dispersal of tools of fabrication around the world through the replication of\nworkshops and a group like Instructables. Both imagine authorship as central\ncomponents, although in the case of the Fab Lab it's less clear whether the organizational\nstructure even conceives of local knowledge beyond local practice and individual\ningenuity. In the case of Instructables, the focus is on creative re-use, explicitly\npositioning the author as one who appropriates discarded material and technology to new\nends.\n\nOn that note, I wonder whether Lessig's notion of \"transformative piracy\" even translates\noutside of elite modern global flows very well, or whether it also serves to disrupt local\nknowledge and social practices in the making of the modern individual (author) among\nthe subaltern. I am currently reading STS graduate Anita Chan's dissertation on\ngovernance in Peru and found these excerpts about the making of modern citizens to be\n\nrelated both to last week's articles about Cold-War inspired cybernetic reading of the\nworld (particularly in light of the conversation about Project Cybersyn and worker\nparticipation models) as well as this week's readings about authorship, culture, and race.\n\nAn excerpt from Chan's thesis about the role of the modern citizen in neoliberal\ndevelopment projects:\n\n...the regulated choices of individual citizens, now construed as subjects of choice and\naspirations of self-actualization and self-fulfillment. Individuals are to be governed\nthrough their freedom. Distributing responsibilities once assumed by modern states,\nneoliberal projects govern by 'implant[ing] in citizens the aspirations to pursue their\nown civility, wellbeing and advancement... (quoting Barry, Osborne, & Rose)\n\nShe continues, now focusing on its application to modern governance, which is\nparticularly interesting in light of Project Cybersyn and David Noble's work on\n'enchantment of automation and the emergent logic of capitalism' that we discussed in\nclass:\n\nApplied to the logics of modern governance, networks structure a startlingly rational\nexclusion, dividing civic populations once defined by a status of \"ordinary\" citizenship,\nand allowing political recognition and resources to be channeled selectively. Under a\nlogic of neoliberal networks, that is, state and market benefits acquire a new efficiency,\nallowing securities to settle upon those who not only actively participate, but who can\nsuccessfully (and continually) demonstrate themselves as exceptionally productive,\nparticipative, or enterprising (quoting Aihwa Ong, 13)\n\nIntel Nokia researcher Jan Chipchase has documented similar creative re-use behavior in\nhis work on cell phone repair centers around the world. How might this practice fit in our\nreadings? Although undoubtedly this is not valued in the global marketplace as a creative\nappropriation or individual authorship (as Lessig argues) or an indigenous practice,\nneither can it be justly considered (good or bad) piracy.\n\nStudent F\n\nEglash and Bleecker's article made me go back to last week's discussion on the\nuniversalizing, even colonizing, claims of cybernetics, reducing both humans and\nmachines into carriers and receivers of disembodied information. The universalizing\nlanguages of information, feedback, and system sounded to me a clear legacy of\nWiener's work for the total war. At the end of last week's class I was almost convinced\nthat the discourses of cybernetics have always carried with it the historical weight of its\nwartime origin, that is, the attempts to create an American operator-machine system that\nwould effectively shoot down enemy pilot-aircraft system (presumably Japanese\nkamikaze). A well-trained American cyborg would defeat the calculating but\nunpredictable Japanese cyborg. Following the historian of science Peter Galison, we may\nsay the project of cybernetics was based on \"the ontology of the enemy.\" Drawing\nupon the historian of WWII John Dower, we may even view cybernetic ideas as\n\nemerging from the wartime racial antagonism.\n\nThen, this week, Eglash and Bleecker calls for our recognition of \"anti-racist\ntechnophilia\" and \"black cybernetics.\" They say there were clearly cybernetic ideas and\npractices in African culture. By traciing the analog and digital modes of representation\nback to African music, handcraft, and religion and by pointing to black cyborgs in\nAmerican cultutral media, Eglash and Bleecker seem to try to populate the cyberspace\nwith real people with race and gender. But I wonder how this strategy is reconciled or\nconfronted with the particular histories of cybernetics and disembodied information.\nDoes \"anti-racist technophila\" have to become a black cyborg?"
    },
    {
      "category": "Resource",
      "title": "Week 7",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-850j-the-anthropology-of-cybercultures-spring-2009/59d858fa3b83d19e4f46c3dad7429982_MIT21A_850Js09_week7.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n21A.850J / STS.484J The Anthropology of Cybercultures\nSpring 2009\n\nStudent A\n\nThe transition that Helmreich proposes from an \"aesthetic of critique\" to an \"aesthetic of\nconversation\" called my attention, as did the more generous light under which he visits\nthe subject of his earlier ethnographic work: the community around what he calls\n\"classic\" artificial life in the Santa Fe Institute in the late nineties. Helmreich's survey\npaper has the purpose of intervening the context of an ongoing conversation between\nscientists and humanists around the subject of artificial life. In fact, he seems concerned\nwith the declaration of this very context by going over texts from \"history of science,\nliterary theory, anthropology and art criticism\" (p.189), arguing that the once clearly\nmarked boundary between the scientific and humanistic perspectives on artificial life has\nbegun to evolve into a ground for cross-disciplinary discussion.\n\nMore specifically I was interested in Helmreich's revisiting of Chris Langton's account\nof the origins of artificial life, this time to recognize the novelty of the way he framed the\nsubject -he actually uses the words \"field-founding\" and \"invitingly expansive\" to\ndescribe it (p.192)- and perhaps to place it within a more nuanced and broader cultural\ncontext. Despite his will to articulate a dialogue his view on the subject isn't\nfundamentally different from the one in \"Silicon Second Nature\": that the claims of\nneutrality of a community of scientists who see themselves as gods are worthy subjects of\ndiscussion and debate remains eloquently as part of the argument (but perhaps not at its\ncenter). Even though he gives Langton credit for starting a conversation, and for\nproviding a ground for critical discussion on the shifting meanings of life, he insists on\nthe cultural trait of the supposedly neutral assumptions taken by AL scientists and uses\nRiskin's nuanced look at AL histories to show how some of Langton's are based on a\nfundamentally \"unchanged quest for creating life\". The piece, therefore, feels less like an\n\"amendment\" than as a constructive re-positioning of his own work in a larger context\nwhere the subject of study is no longer looked at through the lens of the ethnographer\nfocusing in a single community, but as a complex, rich dialogue spanning different\nspheres of knowledge and culture.\n\nAt the end I couldn't avoid the -perhaps wrong- impression that the very enjoyable 'Life\nis a verb' is a piece by an author who felt indebted to his subject. The fact that the paper\nwas published in the 'Artificial Life' journal is consistent with the piece's aim at building\nthe mentioned cross-disciplinary dialogue and resonates with aspects of Fujimura's\nsearch for cross-disciplinary bridges in systems biology:\n\n\"The point I will develop is that such traces of continuity [of whole-istic, or organismic\napproaches to biology] will show that systems biology includes a host of approaches that\nbring different traditions of research, different epistemologies, and different ontologies to\nthe subject of organic systems.\" (p.199)\n\nPerhaps more relevant, in what seems to be a striking similarity to the artificial life\nendeavour -as accounted for by Helmreich- Fujimura describes the hybrid nature of\nsystems biology research, in which there is 'wet lab' research, concerned with the\nexperiments on living biological materials, and 'dry lab' research, which refers to the\n\nanalysis of biological information using computation and simulation not only as a\nmodeling tool but also as a source of empirical evidence:\n\n\"Computational simulation is a major emphasis of systems biology. Experiments include\nintroducing perturbations into simulated systems to see what happens under different\nconditions.\" (p.203)\n\nThe fact that at the very formulation of the research program for systems biology Kitano\nattributes computational models the ability to channel both pragmatic modeling and\ntheoretical exploration in biology, implies that -at least to a certain extent- the systems\nbiology and the Artificial Life endeavors share a fundamental, and perhaps problematic,\npremise of an \"ethos of empiricism towards artificial worlds\" (Helmreich, 189).\n\nIn Kitano's scientific practice of systems biology the computational medium for\nsimulation and analysis of biological data makes explicit commitments to a command-\ncontrol and mechanistic analogy (as blunt as cars and airplanes) that permeates the\nmodels and language to conceptualize living beings. Like Helmreich's piece, Fujimura\navoids pointing a finger at the problematic implications of these commitments, and\nproposes a study of their production instead, a search for what is \"lost in translation\"\n(p.220). She suggests DST (developmental systems theory) as an alternative perspective\nthat may provide a richer ontological plateau from which to discuss biology, and\ncelebrates its acknowledgment of genes as more than data units (a sort of gene-\nsituatedness), but acknowledges its failure to bridge its very suggestive theoretical\nframework to a consistent research program, one that can be generously funded, gain\nlegitimacy in institutions, and perhaps become the new \"buzz word\" in biology.\n\nStudent B\n\nI generally agree with Helmreich's point of view: rather than aiming for and evaluating\non a direct translation of human life as an imperative, I see the current development in the\nALife field as a back-and-forth dialog with other fields like art, entertainment and\nbusiness, employing one to understand or articulate the other. And this sentiment of mine\nis not based on academic knowledge but on general life experience.\n\nFor example, when I first encountered the term \"emergent behavior\" of AI swarm agents\nfrom Michael Crighton's book Prey, I thought it was clever that such term was defined\nand used in AI, but the concept itself didn't surprise me -- I would have noticed\nsomething comparable in my previous training in art and design. Conversely, it doesn't\nshock me with novelty when I see an art or design piece that is based on a similar\nconcept.\n\nAs someone with no prior knowledge of the AI/ALife field however, I found Helmreich's\narticle difficult to follow, mostly because it was a condensed review of other people's\nwork that I am not familiar with. This could have been a great lecture (online or offline!)\nwhen accompanied by more audiovisual references and hyperlinks.\n\nCome to think of it, one reason why I want more pictures is because... I think if I take a\nquick glance at a picture or video of each work referenced in this article, I'd know what it\nis about, that I'd get the gist of it, just by seeing a picture. In order to follow Helmreich's\nlogic, I have to have an impression of each example, and visuals would have been the\nmost effective.\n\nTake Nexi for an example. When I just hear \"MDS (mobile, dextrous, social)\" I have no\nidea what Nexi will be like. In fact, when I see the official blurb on the Personal Robots\ngroup website that starts with \"We are developing a team of 4 small mobile humanoid\nrobots...\" I start getting a fairly incorrect idea of what Nexi might be like -- maximum 2-\nfoot-tall upright robots with wheels and long arms that collide with each other and tilt\nheads to listen to each other. But then once I see a picture of it or better yet in case of\nNexi, watch the video, I immediately realize that it's far from what I considered \"small\"\nor \"social.\"\n\nI am not sure if this desire to glance at the previous AI work to follow Helmreich's logic\nfalls into the \"I know it when I see it\" phenomenon mentioned on page 191, but there is a\nlot to be reckoned immediately by examining the external image of a given work.\n\nResponse to Fujimura's article to follow.\n\nStudent C - Nadya Peek\nEcology has been a really popular term in my environment lately. 3 of the groups at the\nmedia lab have ecology in their name: Ecology Media, Information Ecology, Design\nEcology. In a variety of northern European countries the term ecological is used\ninterchangeably with words like green, sustainable, environmentally friendly, organic.\nWhat we call organic food in the US is called biological food in the Netherlands. As soon\nas we get bogged down in the semantics of the various words, it becomes a completely\ndifferent discussion that maybe has little to nothing to do with the original topic. Having\ndictionary definitions in articles therefore always makes me a little suspicious.\nI enjoyed Helmreich's paper though, as it ambles through compelling works from art,\nscience and technology in their attempts to recreate life. Christopher Langton's distinction\nbetween life-as-we-know-it and life-as-it-could-be is exactly what seems to be starting to\nblur. H2.0 is a popular buzzword at the Media lab, as Ed Boyden adds wetware and Hugh\nHerr adds hardware to willing bodies. However, the dialogue between 'history of science,\nliterary theory, anthropology and art criticism' and 'artificial life' and its agenda of the\nredefinition of terms like agent, emergence and life seems to be exactly this argument\nover semantics I'm not so fond of. The purpose and possibilities of creating life as any\nresearcher sees it lays with the designs and intents of that researcher, and not with a\nupdated definition of terms. I think that Helmreich is trying to frame a space where\nengineers can attempt to create some sort of life and humanists can consider engineering\nand its narrative. The space is being inhabited by the 5 examples he gives, and he makes\nit wide enough for many other inhabitants working with possible considerations of life.\n\nFujumura signals biological systems and engineered systems converging into a symbiotic\ninteraction, but thinks that the convergence oscillates around the 'machine-living\norganism border'. Fujimura wants to know what is being lost in translation each time that\nborder is being crossed, and for this examines systems biology and developmental\nsystems theory. The more complex questions and problems that are arising because of the\nmasses of information that are becoming available in biology clearly do need different\napproaches.\nPeople like calling the use of computer science and mathematics techniques in biology,\neconomics or physics 'interdisciplinary', which bothers me to some extent. If a well\ndefined search algorithm or optimisation technique that was developed in artificial\nintelligence is being used in biology, that is merely a good application for the algorithm.\nHowever, to some extent the ideal implementation of the algorithm also takes a lot of the\ncontext into account, and this blurs who is designing for whom. If systems biologists start\nreconfiguring computer science to be able to deal with the problems they are\nencountering, then I think you can speak of interdisciplinary work. Simultaneously I\nthink that a lot of the analogy-inspired names used in artificial intelligence are\nmisleading: genetic algorithms, neural nets, these names make it easy to conflate the\nbiological with the computational. That is not to say I do not think these fields are\nconverging. As the problems in computation and biology become more complex, and\nfields start borrowing problem solutions from each other, it becomes increasingly useful\nto have knowledge of both fields.\nI would disagree with any hint that considered the computational problems in biology\nfields as indicating more cyborg-ness. However, as systems biology continues and we are\nable to engineer and produce more specific drugs, more acceptable artificial organs and\nmore fine tuned limbs and digits, it would be interesting to consider how much of it is\nmachine, and how much is human, and whether or not we are happy with the way things\nare advancing and the control we have over the machine.\nWith regards to the example we were supposed to bring about wetware computing, I offer\nthe sort of obvious (sorry :() example of Tom Knight's work at CSAIL. His BioBrick\nparts are DNA sequences structured in such a way that they can be stacked together and\nincorporated into some cell which will then perform the encoded action. I think they\nmainly want to do things for nanoscale fabrication, but maybe they want to make\ncreatures at some point too.\nStudent D - Yiftach Nagar\n\nEven though Fujimura (2005) does not mention Anthony Giddens' structuration theory\n(1984), my internal structuration sympathetic string resonated strongly with almost every\nparagraph of her paper. Her description of how system biology theorists try to constitute\nnew metaphors, a new biology of the body, drawing images from other fields and how\nideas and metaphors travel across disciplinary and semiotic borders, and how they get\nchanged in translation, reminded me of Giddens' description of how social structures are\nshaping human action - enabling and at the same time constraining it, and then in return\n\nare being shaped back by those very same human actions, in an ever perpetuating spiral\ndialectic. Her writing kept kindling thoughts about metaphors, and their role in\nstructuring and facilitating streams of ideas and discussions that eventually constitute\nwhat we call scientific schools of thought and disciplines of scientific practice - thoughts\nthat evoked with our readings and discussion of \"cybernetics\" (especially: Bowker, 1993).\n\nI appreciate the way she traces the dialectic created with the moves of metaphors across\ndisciplines and how (if I understand her correctly), human-made artifacts (machines) - in\nwhich metaphors, ideas and social structures are embedded and inscribed - serve as the\nvessels, carrying and transmitting those ideas and metaphors, or at least some shades of\nthe original ideas and structures in this dialectic process. I know far too little about\nLatour's work (1991, 1992) on the sociology of artifacts, but I'll risk offering that\nFujimura's paper enhances his view by examining relationship along time (in a manner\nreminiscent of the way structuration theory builds on and enhances social constructivism).\n\nFor Fujimura, the border between organism and machine, which \"has been crossed\nmultiple times in both directions\" is but one example of such crossing - and so I think we\ncan say her interest is in the sociology of metaphors: how they are socially constructed,\nand how they enable and constrain thought. How they help form ideas in one discipline,\ninscribing meaning and constituting structures that traverse borders and form new,\nmodified metaphors. By pointing to the border-crossing as the place where meanings are\ntranslated, distorted, transformed, added, deleted and lost, her essay provokes thought of\nthe power of language and its role in building human knowledge, as well as thoughts\nabout the tension between the desire of some groups to use holistic disciplines/metaphors\nto bridge across disciplinary borders, and the inevitable specialization of fields as human\nknowledge is accumulated (or rather I should say: as human knowledges are\naccumulated). Thinking about that tension, I was reminded of a paper by Beth Bechky,\ndescribing the attempts of communities of practice to share meaning across their borders\n(Bechky, 2003). I think that the use of metaphors borrowed from other fields - even if\nthey are somewhat modified and distorted in translation - can be useful (and, eventually,\nI think usefulness is a good criterion to judge it by). But I also think that trying to\nnegotiate shared meanings across disciplinary borders can be a very\nproblematic/expensive/painful process with low chances of succeeding. I've been\nwitnessing one such attempt recently by following the mailing lists of WSRI.\n\nFinal words from Marshal McLuhan:\n\n\"Each of man's artefacts is in fact a kind of word, a metaphor that translates experience\nfrom one form into another... ...It makes no difference whatever whether considers as\nartefacts or as media things of a tangible 'hardware' nature such as bowls and clubs or\nforks and spoons, or tools and devices and engines, railways, spacecraft, radios,\ncomputers, and so on; or things of a 'software' nature such as theories or laws of science,\nphilosophical systems, remedies or even the diseases in medicine, forms or styles\nin painting or poetry or drama or music, and so on. All are equally artefacts, all equally\nhuman, all equally susceptible to analysis, all equally verbal in structure.\" (McLuhan &\nMcLuhan, 1988).\n\n------ side notes: ----\n1. A recent working paper published by Rob Laubacher and Tom Malone (my advisor)\nuses the metaphors of... genes and genome... to talk about collective-intelligence. I need\nto re-read Fujimura more deeply and then look at that working paper again. I'm sure it\nwill put things in a new perspective.\n2. Ashamed to admit: I couldn't really relate to Helmreich's paper. I didn't really\nunderstand it. Something must have gotten lost in translation.\nReferences\n\nBechky, B. A. (2003). Sharing Meaning Across Occupational Communities: The\nTransformation of Understanding on a Production Floor. Organization Science,\n14(3), 312.\nBowker, G. C. (1993). How to be Universal: Some Cybernetic Strategies. Social Studies\nof Science, 23, 107-127.\nFujimura, J. H. (2005). Postgenomic futures: translations across the machine-nature\nborder in systems biology. New Genetics and Society, 24(2), 195-226.\nGiddens, A. (1984). The constitution of society: Polity Press Cambridge [Eng.\nLatour, B. (1991). Technology is society made durable. A Sociology of Monsters: Essays\non Power, Technology and Domination, 103-131.\nLatour, B. (1992). Where are the missing masses? The sociology of a few mundane\nartifacts. Shaping Technology/Building Society: Studies in Sociotechnical Change,\n225-258.\nMcLuhan, M., & McLuhan, E. (1988). Laws of Media: The New Science: University of\nToronto Press.\n\nStudent E\n\nReading these papers reminded me of Jenny Sabin's work - an artist now teaching in an\narchitecture department - Jenny's projects link abstract biological concepts to material\nproductions of simulation and representation. A slightly different take on bio-informatics,\nbut it's still about the links between nature, abstract concepts, computation/simulation and\nmaterial realities. Here are some project examples:\n\nWebsite\n\nIn several projects, she has been weaving cloth on Jacquard looms to create\nrepresentations of complex biological data sets. The common binary language between\nweaving and data makes it possible to translate between the two - potentially gaining in\nthe process (interesting to compare to the discussions around translation and boundaries\nin the articles). Body Blanket is a translation of data from a body while undergoing FMRI\nscans.\n\nShe has also been working with a biologist Peter Lloyd Jones on a project called\nBranching Morphogenesis, \"an investigation of the relationship within branching\nstructures formed by interacting vascular cells\" (SIGGRAPH 2008 Catalog) In this\nproject, parametric modeling techniques from architecture and design were moved into a\nbiological realm.\n\nThis work led to a translation back into a large-scale material installation composed of\nthousands of zip-ties currently being shown at Ars Electronica in Linz, Austria which has\nan exhibit called Biolab showing at the moment. From Sabin's website: \"The installation\nmaterializes five slices in time that capture the force network exerted by interacting\nvascular cells upon their matrix environment.\"\n\n****************\n\nHere are some thoughts on Fujimara's descriptions of metaphors in biology as a\n\"....series of /movements back and forth across the machine-living organism border/.\"\n(p.196)\n\nShe asks: \"...whether systems biology as it is currently developing owes more to\nmechanistic ontologies of cybernetic systems than to von Bertalanffy's holistic\nontologies.\" (p.199) In light of this question, I was intrigued by her description of the\nrelationship between modeling and simulation versus wet lab experimentation in systems\nbiology. In Fujimara's description, systems biologists collaborate with molecular\nbiologists to test their results against what seems to be the \"real world.\" The hypotheses\nthat emerge \"bottom-up\" through \"data mining\" (p.205) lead to targeted wet lab\nexperiments which saves time and money. What is translated back to the simulators?\nWhat are the constraints on simulation (especially if \"mechanical analogies and\ncybernetic systems dominate\" in systems biology (p.206))? Fujimara begins to answer\nthis question at the end when she says, \"/Translations can distort, transform, delete, and\nadd./\" (p.220), but that sentence left me wondering what those things are. Her discussion\nof DST starts to describe these elements by bringing in more elements (beyond genes and\nenvironment) or multiplicities of understanding.\n\n[As an aside I can't help thinking about CAD/CAM processes in design, architecture\nwhere similarly perfect models sometimes do not lead to perfectly constructed buildings\nbecause of the idiosyncrasies of \"nature\" on site.]\n\nStudent F\n\nI agree with Lansing [p.190] that to implement A-life appropriately, one should not only\nsimulate how the life-as-it-should-be but instead the life-as-it-could-be, to investigate\nother possibilities of human behavior rather than to pursue its resemblance. Otherwise,\nthere is no significance information that we can afford from simulation in the A-life.\nLansing's argument also correlated with Whitelaw's in his metacreative endeavor [p.193]\nand Kelty-Landecker's in their premise of L-System [p.192] that it's not about product or\n\ncode but instead, it's about the process, a 'verb' that trying to find other kind of life than\nit was when it began.\n\nBoth thoughtful discourses by Helmreich in linguistic and Fujimura in biology, express\ninteresting promises in the field of bioinformatics. However, following Doyle's argument\n[p.191], I think the question should be: When is the right time to stop playing in digital\ndimension and get start connecting it its physical relation? How is that simulation in\nphysical dimension can always be real-time connected and reproduced the evolution from\nits digital version. For example, how is the process of when our body gets sick could\nalways be alerted or cured automatically? Or when we get angry, our digital emotion\nmachine can calm us down?\n\nSystem Biology, hopefully I'm wrong, utilized only to confirm wet lab experiment, which\nis more costly and time consuming [p.203] instead of literally integrating both the dry\nand wet lab constantly. In fact, it considered merely as a substitution of wet lab\ndisadvantages which is mostly about memory / database / calculation capacity [p.203-\n206] and could not really reflect the true complexities of real biological system\n(Kirschner, 1999). And sadly, when it come to simulate the related environment that\ndevelop the way organism behave, as proposed in Development System Theory, it\nbecome too complex too handle (p.217).\n\nI hope it's only a matter of technical issue of the equipment and not about the essence of\nthe complexity itself. 'Cause, if I'm not mistakenly got Doyle's preposition, I guess the\nideal representation system of bioinformatics is the one that represent the essence of life\nas it stand seamlessly in-between the relation of A-life and Physical life.\n\nStudent G\n\nFinally, pulling together this week's readings with last week's discussion about the close\nties between robots and the US military --\nKitchener, Gary. \"Pentagon plans cyber-insert army.\" BBC News, March 16, 2006.\nHarvard Microrobotics Lab"
    },
    {
      "category": "Resource",
      "title": "Week 8",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-850j-the-anthropology-of-cybercultures-spring-2009/9eb566950b6d8854a37a2fbcd63e51e4_MIT21A_850Js09_week8.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n21A.850J / STS.484J The Anthropology of Cybercultures\nSpring 2009\n\nStudent A\n\nVirtual vs. Actual Dichotomy\n\nBoellstorff's distinction between virtual and actual reminded me of two other\ndichotomies. First, the division between space and place that is often made in studies on\nenvironments to separate abstract, general ideas of space (virtual) from specific, personal\nconnections to place (actual). Second, it reminded me of Castell's spaces of flows\n(virtual) and the spaces of places (actual). Like Boellstorff's, these other examples\ninvolve a certain amount of building or constructing through which some reality is\ncreated that cannot overcome time or even space. In his words, \"Building could act as a\ncraft - a form of techne - by which the virtual became real.\" (Boellstorff, p.101)\n\nReordering Environments\n\nAnd of course as a result there are reorderings of places rather than wholesale\nreplacements of place with impersonal, uniform space. These two quotations from The\nCybercities Reader (Graham ed., Routledge 2004) articulate the debate about the role of\nspatial relationships post-internet and technology boom and show how we've moved\nfrom the \"death of distance\" (Cairncross) to more complex interconnections among\ndifferent types of places.\n\n(1) \"In the novel society now emerging - with its sophisticated and rapidly advancing\nscience and technology, its complex social organization, and its internally integrated\nsocietal processes - the influence and significance of geographic distance and\ngeographic place are declining rapidly. This is, of course, a most remarkable change.\nThroughout virtually all of human history, social organization coincided with spatial\norganization.\" (Webber, 1968, Daedalus, Journal of the American Academy of Arts and\nSciences)\n\n(2) \"In sum, the spatial forces set in motion by teleservice are complex, and sometimes\ntug in different directions at once. They can produce both decentralizing and\nrecentralizing tendencies. They can break the bond between local demand and local\nsupply of services, but they can also reinforce the dominance of established service\ncenters.\" (Mitchell, 1999, p.125)\n\nIn SL, these \"decentralizing and recentralizing tendencies\" seem pretty obvious if we\ncompare the islands and skyboxes with the mainland developments and teleport hubs. In\nthe \"real world\" Mitchell claimed the following: \"But mobile connectivity, combined\nwith reduced reliance upon immobile resources, has heightened the need, (...) to replace\npredetermined space programs and rigid plans with swiftly and sensitively responsive,\nelectronically implemented space management strategies.\" (Mitchell, ME++, p.166)\nPerhaps the times when people aren't home in SL and their places are still accessible are\nexamples of reusing spaces in more dynamic ways. Still, even on campuses we're still not\nvery good at using rooms all the time despite attempts to provide all sorts of online\nscheduling tools for spaces. And dynamically assigned office spaces have not been\n\npopular at al.\n\nTime\n\nFor Boellstorff, time is one of the primary elements that makes SL virtual. No matter how\nmuch space can be compressed time remains a limiting factor that cannot be manipulated.\nThis discussion reminded quite a bit of Lynch's studies of time in cities (What Time Is\nThis Place?). (It's also very hard not to be reminded of Lynch's imageability while\nreading about SL.)\n\nTradeoff between Texture and Geometry\n\nIt's probably obvious especially to all the architects, but I was nonetheless struck by the\nclear tradeoff in SL between texture and geometry. Just like in any other 3D rendering\nenvironment the designer has two tools: you can either model the form of the object or\napply a material that appears (from a specific view point) to embody that geometry. And\nwhen rendering 3D buildings, scenes, etc. it's also very important to build geometry for\nthe foreground rather than the background where it will not be apparent to the person\nviewing the image.\n\nThis simple observation leads to a more profound one related to point-of-view.\nBoellstorff did not talk much about how people set their viewing angles of the scene. Do\nthey view SL through the eyes (back of the head) of their avatar? Or do they turn things\naround and play with their avatar like their toys in a doll house?\n\nWoW Pod by Cati Vaucelle & Shada/Jahn\n\nAnother theme that comes up in both readings and is not discussed in much detail is the\nrole of the body. Boellstorff mentions players who are AFK because they are tending to\nthe bodily needs --dinner-- of their families. And Taylor talks about \"motion sickness\"\n(p.11) as she adjusts to the rich visual environment of EQ. She also mentions the\ndisconnect between the actions of sitting upright at a desk with a mouse and keyboard\nwhile navigating a complex virtual space like the underground caverns. Cati Vaucelle is\ntrying to problematize this disconnect between the body and the experience online. The\nWoW Pod is one example and it's being shown right now at the MIT Museum.\n\nVirtual Space Representations\nTron\n\nStudent B\n\nvirtual worlds as ethnography sites\n\nIn both studies the elicitation of virtual worlds as ethnography sites comes with a certain\nsense -and language- of discovery, Taylor entitles her first chapter \"Finding New Worlds\",\n\nand Boellstorff theorizes about the (a bit grandiose) conception of the modern human as a\n\"homo-cyber\".\n\nI think Boellstorff makes a case when, trying to dismantle notions of the virtual as 'less-\nhuman', relies on a conception of the 'human as virtual'. This can be a bit circular, but\npoints to the fact that \"humans exist in culture\".\n\nThe argument is reminiscent of Geertz when he writes \"...man is an animal suspended in\nwebs of significance he himself has spun, I take culture to be those webs, and the analysis\nof it to be therefore not an experimental science in search of law but an interpretive one\nin search of meaning.\"\n\nMore than the lengthy discussion on the sociological implications of the lag, I found the\naccount of residents of second life attending to a party being asked to remove jewelry and\nshoes (to increase the overall refresh framerate of the sim), as a fascinating instance of a -\ncertainly very human- new kind of virtual etiquette.\n\non commercial culture\n\nI'm interested in the notion of what Taylor calls the \"complex space of participant\nobserver\" (p.8); in both cases authors make explicit their personal enjoyment of the\nvirtual worlds. However, I was expecting more discussion around the nature of these\nspaces as for-profit places of economic exchange.\n\nIn both authors the implications of the nature of the environments they work on as for-\nprofit commercial spaces is little discussed. Taylor dismisses the issue by acknowledging\nthe 'complicated relationship with commercial culture', while Boellstorff's takes SL as a\ngiven.\n\n\"Why do game companies continue to, often willfully, overlook potential markets for their\nproducts instead of cultivating new and diverse communities of players?\" (Taylor, p.121)\n\nThis leaves me wondering what their first audience is thought to be. If we are to look into\nSL and EQ as a techne, a sort of collective artifact, as Boellstorff suggests, we should ask\nhow we are construing its sense of purpose beyond its nature as a profitable business and\nas a sort of self-contained economy which could perhaps be reduced as a sophisticated\nhybrid of a mall and a casino.\n\ngender\n\nTaylor left me very curious about how the design team of the game is constituted. The\nquestions she raises around gender roles in EQ could be better approached if we knew\nmore about the design process of the game. Would an ethnography of the design process\nof the game itself be perhaps relevant to explore some of the questions she raises? (I\nagree making it would be perhaps less fun)\n\nIt also made me wonder if the discussion would be richer if, instead of looking\nexclusively at the construction of women's roles, the study looked more generally at the\nconstruction of 'gender-roles'. Masculline roles are briefly mentioned to just state that\nthey're not as sexualized as women's, but there's probably more to it.\n\nStudent C\n\nI agree with that the treatment of fieldwork in virtual environments is quite provocative in\nthese readings, particularly because it forces the ethnographer to not only (re)consider the\nvirtual/actual divide but also because the very nature of virtual suggests boundary work.\nIt wasn't possible for Malinowski - or Geertz with his literary/psychological approach to\nculture - to transcend more than some boundaries of a culture. As Boellstorff notes, the\nnotion that \"'virtual' connotes approaching the actual without arriving there. This gap\nbetween virtual and actual worlds is critical: were it to be filled in, there would be no\nvirtual worlds, and in a sense no actual world either. This is ultimately a reconfiguration\nof the binarism between nature and culture, and its boundary-marker is the distinction\nbetween 'online' and 'offline.'\" Although this reconfiguration might feel a bit incomplete,\nI am taken by how much Geertz writings on the Balinese cockfights as a text and that\n\"culture of a people is an ensemble of texts, themselves ensembles, which the\nanthropologist strains to read over the shoulders of those to whom they properly belong\"\nresembles the ways in which early adherents of the Internet wrote about it as a text which\ncould edited and re-edited (looking for actual quote). I am tempted to suggest that\nnowhere perhaps is this more explicit than in virtual worlds that allow individuals to\ninhabit multiple worlds simultaneously but perhaps this has always been a condition\nassociated with interpretation and mobility.\n\nTo that end, I found an interesting connection between Taylor's comments about identity\nand Boellstorff's notion that individuals now have many worlds in which to live. I have\nbeen thinking about the worlding of cyberspace and that because of the particularities of\ninternet regulations and search, identity shifts depending upon where an individual an\nindividual is accessing the Internet. Examples include identity tourism where an\nindividual might download an application like China Channel in order to \"experience\"\nChina's filtered Internet. But more provocatively, it also describes the relationship\nbetween my online identity and my physical location when I access the Internet - the\nkind of information about my identity and my 'world' that is easily accessible online will\nappear completely different if I am online in Chicago or whether I am online in Buenos\nAires. This does not so much challenge the notion that \"lifeworlds\" and \"virtual\nselfhood\" are something that people craft through intentional creativity but rather that the\ndegree to which technology mediates between identity and the actual/virtual boundary is\nalso spatially demarcated. I wonder if the anthropological equivalent might be to study a\nscience lab, as anthropological accounts of these sites do not assume a totalizing grasp of\nidentity, Helmreich's writing on artificial life reminds us, or Fiske's use of the term\nrelevance to account for the dynamic shifts constantly occurring in popular culture.\n\nAnd finally, as an aside I spent some amount of time thinking about civic\n\nengagement. Games are increasingly held up as a space where players (citizens) can\ndeepen notions of civic engagement as they might lessen the inherent risk of\nexperimentation in the real world and (in the case of MMOs for example) encourage a\ncooperative approach to problem-solving and. As Taylor points out, game design that\nrelies on what people say they want is very quite difficult, a \"conservative approach\" that\n\"is actually more like marketing\" and \"rarely results in innovation.\" And yet one of the\nmantras of designing for a community is to build upon existing behaviors and/or tools. As\nJesper Juul's quote about the overwhelming popularity of The Sims game and its focus\non often mundane activities suggests not the danger of thinking about gamers - or a\ncommunity - in monolithic terms but also underscores the importance of dynamic design.\nThe tension between push and pull is implicit in every project, but perhaps this suggests\nthat participatory design - or at least my thinking of it - requires a re-working as it relates\nto deepening engagement to better allow for multiple experiences and multiple\nengagements to exist outside of an explicitly gaming realm.\n\nStudent D - Yiftach Nagar\nreading response delayed...\nfor representation of virtual reality, found something old... clips from Tron\n1. Trailer\n2. Lightbike Scene (30 seconds are probably enough to get the idea)\n3. Discs (great...)\nStudent C\n\nHere's some visuals/texts related to my thesis that involve virtual identities/cyberspace:\n\nMalamud during the opening speech as Sec-General of the 1996 Internet Expo:\n\nMarshall McLuhan, the philospher who became a famous media guru in the 1960s, had a\nsaying: \"the medium is the message.\" He meant that any medium-TV, radio,\nnewspapers-changes the nature of the content it provides. ...But \"the medium is the\nmessage\" means something else on the Internet. ... We have another saying for this\nInternet World's Fair: \"Finally, the medium isn't the message!\" Our goal is to reach out to\nall walks of life, to see the amount of content on the Internet grow and change. The\nInternet is a fundamental infrastructure, a part of our daily lives. This technology is\nbeginning to reach all of society and it is important that we take the time to make sure\nthat the technology is relevant to all people, to all walks of life. The Internet shouldn't be\na discussion group about computers, it should be a place where artists and world leaders\nand chefs and small businessmen are able to all participate in a technology as\nfundamental as radio, or electricity, or mass transit.\n\nCourtesy of Carl Malamud. Used with permission.\n\nStudent E\n\nThe two reading is a great personal observation and for me it's almost like reading a\nnovel. This else-world is a great way to explore human imagination and it's amazed me\nto know how wild and unique that imaginations could be.\n\nYet, I'm simply not capable of considering second life as another kind of dream. I'm not\nsure that this world is so much different than the real life we actually have. As Boellstorff\ntry not to question the moral issue in the second life [p.5], it is that issue that I think made\nthe second life and real life is pretty much the same. The idea that people tried or pretend\nto become someone else that they don't is so happen everyday in the real world. It's just a\nmatter of visualizing that avatar.\n\nSecond-life might be very different if people tried to simulate what could we have in the\nreal life, but with just a little gap between the present and the future, between the\npossibility and constructability.\n\nAs an architect, I have my own second-life or to be precise, my wannabe-life. That is\nwhen I tried to model my design and simulating how it can happen in the reality. I treat\nmy wannabe-life as a transit terminal of my ideas. Some already take-off and landed in\nthe real-life, some unlucky ones still sitting and wandering in the terminal. Yet, I think\nthe sensation of playing with this delayed passengers is pretty much the same with\nplaying those the avatar in the second-life or in the gaming world."
    },
    {
      "category": "Resource",
      "title": "Week 9",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-850j-the-anthropology-of-cybercultures-spring-2009/4cc5f2e50c15eb822de5b5ac6301079a_MIT21A_850Js09_week9.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n21A.850J / STS.484J The Anthropology of Cybercultures\nSpring 2009\n\nStudent A\n\nI'm digesting (ha! what a living-body metaphor) Vivian Sobchack's vivid paper... hope to\nwrite more in the morning - it was definitely interesting and engaging.\n\nBut till I do, I wanted to share a couple of video-art works - both of which I have been\nthinking for several weeks now as very much related to our material, and after reading\n\"Beating the Meat\" it seems like this is probably the right moment.\n\nThese works are by a friend, Nira Pereg, and were presented in several places in Europe\nand Israel -\n\n1. Digiwounds - a loose simulation of self inflicted digital amputations. The work\nstrongly echoes the esthetics of popular computer games and is supposed to function as\ndigital (blood) fountain.\n2. G-Spotting - While using the urban landscape as a chart of the female body, the work\ntouches on the themes of surveillance, modern weaponry and pornography\n\nTech note: unfortunately, it may not work well with Firefox. The bloatware known as\nQuickTime (or at least a quicktime plugin) is required.\n\nStudent B\n\nWiener, N. (1966) God and Golem Inc. Cambridge, MA: MIT Press, pp. 71-95.\n\nI read two essays or chapters in Norbert Wiener's /God and Golem Inc./. Not having read\nmuch work on cybernetics and by Wiener I was curious to see what would await me. And\nI wasn't disappointed because the chapters are riddled with grand generalizations and\nsweeping statements about society, people, bodies, and machines. I really enjoyed some\npencil markings made by previous shocked readers.\n\nIn essay VI, Wiener starts by asking the question how we can assign tasks to humans and\nmachines to match their abilities respectively (\"Render unto man the things which are\nman's and unto the computer the things which are the computer's.\" p.73). Machines (he\nonly uses the term machines and not computers) are good at automatization while\nhumans are good at operations to use his terms. He marvels at the small size of the human\nbrain -compared to the \"skyscraper\"-sized set of transistor circuits needed to emulate it--\nwhich can \"handle vague ideas, as yet imperfectly defined\" (p.73). Machines cannot \"be\nprogrammed\" using poems, novels or paintings. This notion of programming recurs\nthroughout (and was of particular interest to a previous reader as the photos show) as the\nprimary requirement for any system whether human or machine or hybrid.\n\nIn his attempt to describe joint human-machine systems, he turns to prostheses on the\npremise that both machines and bodies generate \"nervous signals\" and can thus be\npatched together much like Sobchack ironically describes it in the beginning of her essay.\nIn Wiener's words:\n\n\"This result (in reference to a hand-prosthesis designed in Russia) is facilitated by the\ncircumstance that the same nervous signal which was effective in producing a muscular\ncontraction before the amputation will still be effective in controlling the motor moving\nthe artificial hand.\" (p.75)\n\nTogether, the artificial limb and the human are \"a system of mixed nature, involving both\nhuman and mechanical parts\" (p.76). In this context, I will recount a recent conversation\nwith a friend who recounted a lecture in Hugh Herr's lab which builds prosthetic limbs.\nThe lecturer described how limbs are connected to nerves in order to control the\nprosthetic. In the early days when Wiener was writing, actual wires were routed under the\nskin from specific muscles groups to other parts of the body. An electrical signal powered\nby an additional battery would then send a signal to the muscle which would trigger. This\nprocedure was very invasive, required lots of surgery and the wires would corrode and\nbreak over time. Not the seamless electrical plug-and-play connection Wiener implies.\nToday, there are roughly three groups of techniques that are used to either sense the\nnerves or muscles fibers around the nerves. (Apparently muscles generate electrical\ncharges on the order of micro Volts while the rest of our tissues produces charges on the\norder of milli Volts. As a result, sensing technologies often receive confounding signals\nbecause of all the noise caused by the surrounding tissue.) First, there are cuffs that can\nbe placed around a nerve ending, but these are subject to lots of noise as described in\nparentheses. Second, doctors can cut the nerve, insert a sensing mesh, and allow the nerve\nto regrow through the mesh. This technique has been successful in cats, but not in\nhumans because the nerves don't tend to regrow as well. Stem cell research of course\npromises to assist with nerve growth. Third, nerve-endings can be redirected or inserted\ninto no longer needed muscle tissues to amplify their signals. For example, a patient lost\nhis arm and no longer needed his pec muscles. The doctors subdivided the pec muscle\ninto four parts, inserted nerve endings into the muscle tissue and then injected small\nsensors that transmit wirelessly to the prosthetic limb into the muscle tissue. The patient\ncontrols his modified pec muscle to control four degrees of freedom in the artificial limb.\nIn light of Sobchack's article, I was fascinated by the complexity and invasiveness of all\nthese procedures that really do not augment, but simply try to restore functionality. Many\namputee patients do not want to benefit from this research because they are already\ntraumatized and the last thing they want is to return to the hospital.\n\nIn the hybridization of human and machine, Wiener does not address any of the\ncomplexities implied by physically linking humans and machines. It's merely an\nexchange of electrical signals. And therefore, he easily jumps to learning systems and\nhow human-machine interchanges can be established there. His domain examples are\ntranslation, medical diagnoses, invention, and military devices because they require some\nautomatization and some operational judgment calls. Over time, machines would learn by\ninteraction with human \"critics\" and thus the human's role would shift over the course of\nseveral iterative cycles.\n\nIn essay VII, Wiener addresses the social sciences. In particular, he is interested in\nshowing that the social sciences are far less predictable and contained to provide good\n\necosystems for exploring the potential of cybernetic ideas. Therefore, engineering and\nbiology are much better suited for testing his ideas about predictability and so on. He\nexplains this fact in particular by using the body whose \"physiological structures, unlike\nsociety as a whole, have changed very little since the Stone Age,...\" (p.92). Still, he\nargues that his cybernetic theories related to a single body will eventually extend to the\nbody politic as a whole.\n\nHere again he does not address how communication travels from one body to another.\nFor Wiener, there is no need to explain the differences of transmitting from mind to mind\nvs. within one mind. And in any case, all exchanges can be described as transmissions\nthat elicit some form of routine or program. One of Sobchack's points is very well taken\nthen when she writes that the body is a \"material subject that experiences its own\nobjectivity, that has the capacity to bleed and suffer and hurt for others because it can\nsense its own possibilities for suffering and pain\" (p.213).\n\nStudent C\n\nI agree that pain is a great disillusioning force, more so than I normally would, because I\nhave been sick for the last couple weeks. Even with a relatively trivial condition like a\ncold, it definitely incapacitated me in multiple ways, and I am still not feeling myself.\n\nAfter 3 days in bed, I couldn't stand being stuck in the same spot any more and needed a\nchange of scene badly. I had a strong and vivid urge to move myself from the bed to the\ncouch. It was revealing to see how such seemingly small problem completely took over\nmy mind for those 24 hours. I can't imagine what it'd be like to be hospitalized for\nmonths or years, that would definitely change the perception on my self, my abilities and\nwhat matters to me. When it comes to permanent changes to my body such as amputation\nor prosthesis, I definitely have no clue what that would do to me. I admit all of this more\nhumbly because I am still sick and that makes me more receptive to the idea of forced\nchange in self image and perception due to physical condition of my body.\n\nI find it striking that the author needed to bring the \"meat\" or \"wetware\" to the durability\nand strength level of the prosthetics... I am also shocked that the author feels more\nattractive with the prosthetics from the consequent weight loss... and that rather than\naccepting herself as is, she feels that she should make herself over. I had never thought of\neither of these consequences, but it all sounds plausible.\n\nSo I agree on the statement that abstracting and de-personalizing statement like \"on the\nbody\" may be dangerous, and that \"if we were to survive the next century, we must\ncounter the discourses that decontextualize our body.\" But I also think such judgment\nshould be made rather on a case-by-case basis with more granularity, consideration and\nrigor, so that we don't dismiss all ideas that relate to our body space.\n\nI just presented a paper at the CHI conference this Monday regarding wearable modules\nthrough which you receive massages from strangers over the web, which some audience\nmembers deemed \"creepy\" and a violation of their personal body space, while many other\n\nmembers of the audience were excited about the possibility of massively networked\nhaptic devices.\n\nAlthough my modules are attached to the inside of your clothing rather than being\ndirectly attached to your skin and therefore are as temporary as wearing a bluetooth\nheadset rather than getting a tattoo or implant, the idea of having something moving on\nyour body, or a device controlled by other people near your skin, immediately scared\nsome people. With more time perhaps, I could have emphasized and clarified how my\nmodules are not meant to be as invasive as some audience members might have imagined.\nBut I still suspect that the concept might have been misunderstood or miscategorized by\nsome of the people in the audience.\n\nI was never turned on by the movie Crash, and I agree that technologists can be\nirresponsible when it comes to understanding the impact of modification onto our bodies.\nBut I also think the logic shouldn't be used to dismiss other interesting and sound ideas\nthat are merely related to our body space.\n\nStudent D\n\nThat Sobchack, herself a techno-body because of cancer, refuses to become the\ndisembodied form that Baudrillard celebrates (objectifies) but \"never lived as a subject,\"\nand instead argues that it is a false consciousness is a compelling argument. I tend to\nagree with her that a \"fetishized fascination\" with seemingly limitless technologies and\nthe invulnerable and immortal body (transhumanism?). For Sobchak, being present in a\n\"body that experiences its own objectivity\" generates something she calls moral stance.\nBeyond the clear power dynamics embedded in her analysis, I am curious about her\nreliance on a body with the \"capacity to bleed and suffer and hurt for others because it\ncan sense its own possibilities for suffering and pain.\" I find it tempting to assume that\nsuch a mutual vulnerability (what might be considered 'openness' in a computing\nsystem?) might ensure a moral stance but in fact perhaps Sobchak's critique suffers from\na reliance on a perceived universal morality. Perhaps Sobchack's work suffers from a\nnecessary lack of detail that would sufficiently capture the nuance of the techno-body.\nFor example, if we consider the rise of the medicalized body - the body protestors on\nhunger strikes who bring doctors to monitor their condition suggest a different techno-\nbody than that of the torture victims who, according to recent reports, were closely\nmonitored by doctors through their ordeals at the hands of their interrogators. Though\nneither suggests an immortal body, each suggests a different construction of the body in\nrelation to technology and the machine. In particular, the protester's body suggests that\nSobchack's simplistic characterization that technologies of communication and\nperception \"objectifies our thoughts and desires\" and diminishes our subjective\nawareness but might in fact function to heighten (a certain type of) awareness of\nourselves.\n\nMoreover, Downey, Dumit and Williams' attempts to situate a cyborg anthropology that\nfocuses the boundary between machine and body by suggesting a decentering of the body\nin favor of an \"argument that human subjects and subjectivity are crucially as much a\n\nfunction of machines, machine relations, and information transfers as they are machine\nproducers and operators.\" In this light, to consider the body of the protestor we must\nconsider the doctor (and associated medical knowledge) and the medical technologies\nthemselves, and explicitly considers the agency we must attribute to the technologies\nthemselves and the ways in which \"machines come to adjudicate boundaries on realms of\nknowledge and competence, insanities, pathologies, and normalcies.\"\n\nSobchack does a good job of updating the ways in which Haraway's earlier euphoria\ntoward technology was tempered over time - how has cyborg anthropology deepened and\nchanged since 1995?\n\nStudent E\n\nWhile Latour's critique of post-modernism was addressed mainly at its lack of concern\nwith \"nature\" and \"the social\" (Latour, 1993), Sobchack's is addressed at its lack of\nconcern with the body. Baudrillard's reading of Ballard's, \"Crash\", Sobchak argues,\ndeprives it from its fundamentally moral intentionality and -willfully, she accuses- puts it\nto the service of the disembodiment postmodernism purports via technophilic rhetoric.\nFor Baudrillard the erotic is confined to \"sensual thought\" and \"psychic experience\", in a\nparable of what would be post-modern obsession with discourse. In Beating the Meat /\nSurviving the Text Sobchack aims at drawing a critique of postmodernism's obsession\nwith discourse (Sobchack, 1995). For Latour, in the post-modern stance \"nothing has\nvalue; everything is a reflection, a simulacrum, a floating sign; and that very weakness,\nthey say, may save us from the invasion of technologies, sciences, reasons.\" (Latour,\n1993, p. 131) In Latour's proposition of post-modernism discourse is the only subject,\nand technology is implicitly defined as \"extra-human\". While Latour doesn't use the\nword body (much less Sobchack's construction \"lived-body\"), its significant absence is\nimplied. For Sobchack\n\n\"(...) One of the consequences of our high-tech millenarianism is that the moral material\nand significance of the lived body is elided or disavowed, not only by the delusional\nliberatory rhetoric of technophiles who long to become either 'pure' electronic\ninformation or self-repairing cyborgs like Schwarzenegger's Terminator, but also\nthrough the liberatory poetry of cultural formalists like Baudrillard who long to escape\nthe loved-body and its limitations and write it off (quite literally) as just another sign of\nits times.\" (p.210)\n\nThat's the diagnosis. Pain as a means to re-connect with the body is Sobchack's\nprescription for Baudrillard. However cruel, the idea of pain as a revelatory reconciliation\nwith the body, exemplified in Sobchack's account of her prosthesis, reminded me of Aldo\nRossi's \"Cementerio di Modena\". Rossi is a famous post-modern architectural \"hero\",\nfamous both for his built work and for having formulated theories that reinstated the\nhistorical and cultural dimensions of the city in urban and architectural studies. The\n\"Cementerio di Modena\" (Modena's Cemetery), one of his most celebrated works, was\nconceived while the architect recovered from a -very painful- car accident. The plan, (he\nexplains in his \"Scientific Autobiography) is reminiscent of a bone-structure (Rossi,\n\n1984). The anecdote proves that \"post-modern men\" can feel the body too.\n\nLatour, B. (1993). We have never been modern. Cambridge: Harvard University Press.\nRossi, A. (1984). Scientific Autobiography. Cambridge: MIT Press.\nSobchack, V. (1995). Beating the Meat / Surviving the Text. Body and Society , 205-214.\n\nStudent A - Yiftach Nagar\n\nEvery time I tell my wife that we should seriously worry about space colonization, to\nensure the survival of humans (whatever THAT means), she says we should worry about\nthe hungry and poor in Africa and India first. To which I always answer that, yes, of\ncourse we should do that, but we shouldn't neglect human-race long time survival and\nfocus just on the short term. When the sun goes out, we better be ready, or else, all of us,\nrich and poor alike, are going to oblivion. For me, the idea of my own demise (I know\nI've written this already, not sure if that was here or elsewhere), while not entirely denied,\nis still something that I try to suppress as I find it impossible to deal with. So other than\ntaking some technical steps such as having a life insurance (another step aimed at the\nfickle idea of having control of the future survival of - if not my flesh, then at least some\npart of my existence), I really try not to think of it too much.\n\nCyborgism is another way of trying to deal with our frailness and our mortality. If I read\nher correctly, Sobchack, relying on Haraway, calls us to abandon delusions of denying\nour mortality by going the cyborg way, and, further, I think she draws meaning for life by\ndefining life through death. She seems to me to actually draw some (sadistic?) joy of\npoking Haraway's quote to our face: \"we really *do* die... the earth really *is* finite...\".\nWell, yes. We really do die. In masses, every day. And the earth really is finite for all that\nwe know. But I can't find a reason to celebrate it. She writes: \"I have not forgotten the\nlimitations and finitude and naked capacities of my flesh, nor, more importantly do I\ndesire to escape them. They are, after all, what ground the concrete gravity and value of\nmy life\". To me, the limitations and finitude and naked capacities of my flesh are\ndefinitely not the defining features of my living. I do not draw my jouissance, as\nSobchack suggests of Baudrillard, merely from semiotic and textual play. But I think that\nby focusing on the numbness of her still prosthesis, Sobchack has some logical flaw.\nWhat if her prosthesis was equipped with nerves which would be connected to her brain?\nShe could then feel the touch of silk of her sexy lingerie, or the hands or tongue that\ntouches it and draw her pleasure.\n\nShe talks about bringing Baudrillard to his senses (I liked the pun) and says that pain\nwould remind him that \"he doesn't just *have* a body, but that he *is* his body\". Is he\nindeed?\n\nWas it Baudrillard's body that provoked her so much as to sit her flesh and devote hours,\nmaybe days, to write her paper? Or was it just ideas that were conceived in his (wet, I\nagree) brain, then textualized, then broadcast into noosphere?\n\nStudent F - Nadya Peek\n\nFirst I wanted to share one of my favourite little mockumentaries on what happens when\nyou end up with too many screws, plates and wire in your body:\nThe movie is the graduation project of Floris Kaayk from the Academie St. Joost in Breda,\nthe Netherlands.\nEarlier last month I actually went to the talk by Manfred Clines at Harvard. The talk was\nadvertised as \"come see the man who has fanmail from Albert Einstein!\". In his short\npaper with Kline, he coins the term cyborg by suggesting the different ways it would be\nmore efficient to deal with the body in a space ship. This includes some extent of\nsuspended animation, tubes for food/waste, and a full other array of creepy stuff. He does\nnot in any way go into how that would at all affect the user emotionally, but under the\nheading \"Psycho-Physicological Problems\" writes about how to keep the astronaut awake,\nalert, its muscles exercised and the body protected from (electromagnetic) radiation. This\n(very old) paper was in strong contrast with the talk he gave, which was about how to\ninterpret the having of different emotions. In particular Clines stressed how it was\nimportant that 'children of today' must learn to distinguish between sex and love and\nanger and hate. He told some pretty amusing anecdotes about how his contemporaries in\nneurology and computer science thought he was going batty for researching emotion,\nexcept for Marvin Minsky.\nHowever, the research he was doing with emotion has nothing to do with the emotional\nwell being of a cyborg, but with the universal emotional interpretation of various famous\ncomposers. In Sobchack's paper, it becomes clear that becoming comfortable with a hard\nand soft body is no obvious process. I can imagine also, that for those people who have\nmaterial prostheses, not the metaphorical prostheses which are often written about, the\nliterature can be very insulting. Right now it is still not that case that when you receive a\nprosthesis from your health insurance, that that prosthesis becomes yours. Your arm\nremains property of your healthcare provider, and must be returned upon death. Opening\nor otherwise tinkering with it would result in void of warranty and breaching of contract.\nThat is such a foreign concept to me, as not to have full power to control your own arm!\nThere are some projects like the Open Prosthesis Project which aim to make open source\nprosthesis so that people can make and do whatever they like with their own limbs.\nLast week I went to a grad arts forum on the topic of Appendage. There the discussion\nwas often on body augmentation and the difference between performative extensions and\nfunctional extensions. But the extensions considered were not limited to hairstyle or\nfingernail colour, but included things such as your driveway, your mailbox and the trees\nin your garden as body extensions. I would sometimes like to argue that these things are\nnot just extensions, but core to the body. With a topic like appendage, it seems logical\nthat you are appending to a core. However, what then can we consider the body's core,\nand how do we consider the core differently from the extensions? Sherry Turkle writes\nabout tethering, and creating connections between bodies by means of devices like\nphones. I mostly think of my laptop and my phone as part of my body, because without\nthem I feel amputated. Since they are part of me, I believe I should have full control over\nthem, and should not have terms dictated by Apple or AT&T. I think this qualifies me for\nwhat Turkle considers pathological, but I'm ok with that.\ncameowood. \"Metalosis Maligna - An Extraordinary Disease.\" November 7, 2006.\nYouTube. Accessed November 30, 2009. http://www.youtube.com/watch?v=TtXMyAOop3s\n\nStudent G\n\nAmazing woman! It's interesting to see how a person can finally see the real difference\nof having an object-body [the body that we have], lived-body [the body that we are] and\neventually, techno-body [the body that we could be]. This experience made Sobchack\nhave a right to say that other people such as Baudrillard who don't have such privilege,\ndo not have a right to judge a story like crash.\n\nPain is the first Sobhack encounter to the absence of wet-ware, as many people would\nhave. But I didn't expect the statement --from an amputated person -- that Pleasure is\nactually the term she used in experiencing her prosthesis. [p.207]\n\nWhat struck me most from Sobchack's essay was her elaboration with Kathleen\nWoodward articles that implied: along with the history of human kind, the process of\nachieving various tools and technologies always parallel with the process of\nimmaterializing the body itself. As what Sobchack called 'to beat the meat'.\n\nSobchack brought a really good sense of how technology and desire intersect each other.\nAfter reading this particular passage, I couldn't help but to wonder: might this very\ntechnological institute have some works that doesn't extending the body outward or\ninward direction? But instead, on the equilibrium of internalization and externalization of\nthe body. Maybe in Design, sciences, basic sciences? I couldn't found it. Even a social\nscience, such as politics, are continuously trying to extend the notion of body into its\nlarger scale. To gain a mass of bodies from the society into a single one that could be an\norganization, institution or nation.\n\nYet, I think it will be interesting to hear some counter-arguments to this essay. It's\nunfortunate for me not having a chance to read Crash, the novel she used to attack\nBaudrillard."
    }
  ]
}