{
  "course_name": "The Art of Approximation in Science and Engineering",
  "course_description": "This course teaches simple reasoning techniques for complex phenomena: divide and conquer, dimensional analysis, extreme cases, continuity, scaling, successive approximation, balancing, cheap calculus, and symmetry. Applications are drawn from the physical and biological sciences, mathematics, and engineering. Examples include bird and machine flight, neuron biophysics, weather, prime numbers, and animal locomotion. Emphasis is on low-cost experiments to test ideas and on fostering curiosity about phenomena in the world.",
  "topics": [
    "Engineering",
    "Computer Science",
    "Algorithms and Data Structures",
    "Mathematics",
    "Applied Mathematics",
    "Engineering",
    "Computer Science",
    "Algorithms and Data Structures",
    "Mathematics",
    "Applied Mathematics"
  ],
  "syllabus_content": "Course Meeting Times\n\n3 sessions / week, 1 hour / session\n\nIntroduction\n\nAn approximate model can be better than an exact model!\n\nThis counterintuitive statement suggests a few questions. First, how can approximate models be at all useful? Should we not strive for exactness? Second, what makes some models more useful than others?\n\nOn the first question: An approximate answer is all that we can understand because our minds are a small part of the world itself. So when we represent or model the world, we have to throw away aspects of the world in order for our minds to contain the model.\n\nOn the second question: Making\nuseful\nmodels means discarding less important information so that our minds may grasp the important features that remain.\n\nI will show you how to discard the less important information and thereby to make the most useful approximate answers. The most useful techniques fall into three groups:\n\nDivide and conquer\n(managing complexity)\n\nHeterogeneous hierarchies\n\nHomogeneous hierarchies\n\nSymmetry and invariance\n(removing spurious complexity)\n\nProportional reasoning\n\nConservation/box models\n\nDimensionless groups\n\nLying\n(discarding complexity)\n\nSpecial cases\n\nSpring models\n\nDiscretization\n\nThe two divide-and-conquer techniques help you manage complexity. The three symmetry techniques help you remove superfluous complexity. These first two groups do lossless compression. The three lying techniques help you discard complexity. This third group does lossy compression.\n\nUsing these techniques, we will explore the natural and manmade worlds. Applications include:\n\nturbulent drag\n: or how falling coffee filters tell us the fuel efficiency of airplanes.\n\nxylophone acoustics\n: or why pianos are tuned with the lower notes below the ideal, equal-tempered frequency and with the higher notes above the ideal, equal-tempered frequency.\n\nthe design of compact discs\n: or how Beethoven's ninth symphony helps you find the spacing between the pits.\n\nperiod of a pendulum as a function of amplitude\n: or how hard it was to navigate 300 years ago.\n\nthe size distribution of eddies in turbulent flow\n: or how stars twinkle.\n\nthe bending of starlight by the sun\n: or the size of a black hole.\n\nbiomechanics\n: how high an animal jumps as a function of its size.\n\nNone of these problems has a simple analytic solution. The world -- whether manmade or natural -- rarely offers problems limited to one field of study, let alone problems whose equations have an analytic solution. To understand aspects of the world even partially, we need to use the preceding techniques, to make models that keep only the important features of a problem.\n\nBy making such models, we make understanding and designing more enjoyable. So the hidden although less tangible purpose of this course is to amplify your curiosity about the world.\n\nDescription\n\nThis course teaches simple reasoning techniques for complex phenomena: divide and conquer, dimensional analysis, extreme cases, continuity, scaling, successive approximation, balancing, cheap calculus, and symmetry. Applications are drawn from the physical and biological sciences, mathematics, and engineering. Examples include bird and machine flight, neuron biophysics, weather, prime numbers, and animal locomotion. Emphasis is on low-cost experiments to test ideas and on fostering curiosity about phenomena in the world.\n\nPrerequisites\n\nThe prerequisites for this course are\nPhysics I (8.01 Mechanics, GIR)\nand\nCalculus I (18.01 Single Variable Calculus, GIR)\n. A dose of curiosity and open-mindedness to attack problems about which you know little are recommended.\n\nAssignments\n\nThere will be six assigned problem sets during the semester and one optional problem set for you to chew on over the summer months. For each problem set there are a series of warmups and problems. Write solutions to all of them based on the\nopen universe\npolicy:\n\nCollaboration, notes, and other sources of information are\nencouraged\n. However, avoid looking up answers until you solve the problem (or have tried hard). That policy helps you learn the most from the problems.\n\nBring a photocopy of your solution to class on the due date\n, trade it for a solution set, and figure out or ask me about any confusing points.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nHomeworks (6)\n\n100%\n\nThe purpose of this course is to learn, not to grade. If you come to class, do your homework and hand it in, you can succeed in this course.\n\nYour work will be graded lightly: P (made a reasonable effort), D (did not make a reasonable effort), or F (did not turn in).",
  "files": [
    {
      "category": "Resource",
      "title": "Homework 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-055j-the-art-of-approximation-in-science-and-engineering-spring-2008/7c2dabcefaa2f10185f9ff6817dd497c_hw01.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n6.055J / 2.038J The Art of Approximation in Science and Engineering\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\n6.055J/2.038J (Spring 2008)\nHomework 1\nDo the following warmups and problems. Due in class on Friday, 15 Feb 2008.\nOpen universe: Collaboration, notes, and other sources of information are encouraged. However, avoid\nlooking up answers until you solve the problem (or have tried hard). That policy helps you learn the most\nfrom the problems.\nBring a photocopy to class on the due date, trade it for a solution set, and figure out or ask me about\nany confusing points. Your work will be graded lightly: P (made a reasonable effort), D (did not make a\nreasonable effort), or F (did not turn in).\nWarmups\n1. Air mass\nEstimate the mass of air in the 6.055J/2.038J classroom and explain your estimate with a tree.\nIf you have not seen the classroom yet, then make more effort to come to lecture (!); meanwhile\npictures of the classroom are linked from the course website.\n2. 747\nEstimate the mass of a full 747 jumbo jet, explaining your estimate using a tree. Then compare\nwith data online. We'll use this value later this semester for estimating the energy costs of\nflying.\nProblems\n3. Random walks and accuracy of divide and conquer\nUse a coin, a random-number function (in whatever programming language you like), or a\ntable of reasonably random numbers to do the following experiments or their equivalent.\nThe first experiment:\n1. Flip a coin 25 times. For each heads move right one step; for each tails, move left one step.\nAt the end of the 25 steps, record your position as a number between -25 and 25.\n2. Repeat the above procedure four times (i.e. three more times), and mark your four ending\npositions on a number line.\nThe second experiment:\n1. Flip a coin once. For heads, move right 25 steps; for tails, move left 25 steps.\n\nHomework 1 / 6.055J/2.038J: Art of approximation in science and engineering (Spring 2008)\n2. Repeat the above procedure four times (i.e. three more times), and mark your four ending\npositions on a second number line.\nCompare the marks on the two number lines, and explain the relation between this data and\nthe model from lecture for why divide and conquer often reduces errors.\n4. Your turn to create\nInvent - but do not solve! - an estimation question for which dividing and conquering into\nassorted subproblems would help solve it (i.e. that would illustrate heterogeneous divide and\nconquer). To give you an idea for the kinds of problems that might work well, the classic of\nthis genre, due to Fermi, is 'How many piano tuners are there in Chicago?' Other examples\nare the warmup problems on this problem sheet and the problems that we solved in lecture.\nParticularly interesting or instructive questions will appear on the website or as examples in\nlecture or the notes (let me know should you not want your name attributed in case your\nquestion gets selected)."
    },
    {
      "category": "Resource",
      "title": "Solution Set 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-055j-the-art-of-approximation-in-science-and-engineering-spring-2008/52c9ee21f01cad01ebf8238aa10c670a_sol01.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n6.055J / 2.038J The Art of Approximation in Science and Engineering\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\n6.055J/2.038J (Spring 2008)\nSolution set 1\nDo the following warmups and problems. Due in class on Friday, 15 Feb 2008.\nOpen universe: Collaboration, notes, and other sources of information are encouraged. However, avoid\nlooking up answers until you solve the problem (or have tried hard). That policy helps you learn the most\nfrom the problems.\nBring a photocopy to class on the due date, trade it for a solution set, and figure out or ask me about\nany confusing points. Your work will be graded lightly: P (made a reasonable effort), D (did not make a\nreasonable effort), or F (did not turn in).\nWarmups\n1. Air mass\nEstimate the mass of air in the 6.055J/2.038J classroom and explain your estimate with a tree.\nIf you have not seen the classroom yet, then make more effort to come to lecture (!); meanwhile\npictures of the classroom are linked from the course website.\nOne way to estimate the mass is to subdivide into the volume of the room and the density of air.\nThe volume of the room subdivides into its length, height, and width. I remember that the density\nof air is roughly 1 g l-1 because the value is needed often in estimation problems. Alternatively,\nyou can use a useful fact from chemistry, that one mole of an ideal gas at standard temperature and\npressure occupies 22 liters, and combine that fact with the molar mass of air.\nmass of air\ndensity of air\nmolar volume\nmolar mass\nvolume of room\nlength\nwidth\nheight\nUsing that method,\nthe tree is\nNow put values at the leaves.\nFor the room dimensions, the MIT schedules office webpage gives the room area, but let's estimate\nthe dimensions by eye. Most rooms are 8 or 9 feet high, or about 2.5 m. The room has about 10\nrows, spaced around 1 m apart. So the length is about 10 m. The room is roughly square in aspect\nratio, so the width is around 10 m as well. [The MIT page says that the area is 768 square feet, or\nabout 77 m2. Our estimate of 100 m2 is reasonably accurate.]\nThe molar volume for air (like any ideal gas) is 22 liters. The molar mass is, roughly, the molar\nmass of nitrogen, so about 14 g. But wait, nitrogen is diatomic, so the molar mass is 28 g.\nThe tree with values is:\n\nSolution set 1 / 6.055J/2.038J: Art of approximation in science and engineering (Spring 2008)\nmass of air\ndensity of air\nmolar volume\n22 l\nmolar mass\n28 g\nvolume of room\nlength\n10 m\nwidth\n10 m\nheight\n2.5 m\nNow propagate values upward. The volume of the room is 250 m3 . The density of air is roughly\n28/22 g l-1, or roughly 1 kg m-3 . So the mass of air in the room is roughly 250 kg or about 500\npounds.\n2. 747\nEstimate the mass of a full 747 jumbo jet, explaining your estimate using a tree. Then compare\nwith data online. We'll use this value later this semester for estimating the energy costs of\nflying.\nOne method - and as usual there are many methods - is to estimate the mass of the passengers\nand then fudge that value to include the rest of the load (baggage and fuel), and then fudge that\nvalue to include the mass of the empty plane. Here is a tree to represent the method:\nmass of 747\nlive load\npassengers\nfudge for luggage\nfudge for fuel\nfudge for plane\nNow let's put values at the leaves. The plane holds about 400 passengers each weighing 70 kg, so\n3 × 104 kg. The fuel may be a factor of 2 or 3 larger than the passengers with luggage, although I\nam not confident about this number. And the plane itself, when empty, might weigh as much as\nall the load, so include another factor of 2 for the plane itself.\nThe tree with leaf values is\nmass of 747\nlive load\npassengers\n3 × 104 kg\nfudge for luggage\nfactor of 2\nfudge for fuel\nfactor of 2\nfudge for plane\nfactor of 2\nNow propagate values upward. The result is\nm ∼ 3 × 104 kg × 2 × 2 × 2 ∼ 2.5 × 105 kg.\nThe actual maximum takeoff weight is (from Wikipedia) 4×105 kg. Not too bad (and more accurate\nthan an initial guess without subdividing would have been).\n\nSolution set 1 / 6.055J/2.038J: Art of approximation in science and engineering (Spring 2008)\nProblems\n3. Random walks and accuracy of divide and conquer\nUse a coin, a random-number function (in whatever programming language you like), or a\ntable of reasonably random numbers to do the following experiments or their equivalent.\nThe first experiment:\n1. Flip a coin 25 times. For each heads move right one step; for each tails, move left one step.\nAt the end of the 25 steps, record your position as a number between -25 and 25.\nWhen I flipped a coin 25 times (using a Python program), I ended 3 steps to the right from\ngetting 14 heads and 11 tails.\n2. Repeat the above procedure four times (i.e. three more times), and mark your four ending\npositions on a number line.\nIn the three repetitions I ended at 7, 3, and -3. The four ending positions are\n-25\n-20\n-15\n-10\n-5\nThe second experiment:\n1. Flip a coin once. For heads, move right 25 steps; for tails, move left 25 steps.\nI ended at +25.\n2. Repeat the above procedure four times (i.e. three more times), and mark your four ending\npositions on a second number line.\nOn the next repetitions, I ended at +25, -25, and +25. Here are the four ending locations:\n-25\nCompare the marks on the two number lines, and explain the relation between this data and\nthe model from lecture for why divide and conquer often reduces errors.\n\nSolution set 1 / 6.055J/2.038J: Art of approximation in science and engineering (Spring 2008)\nThe marks in the first experiment are clustered much closer to the origin than they are in the second\nexperiment.\nThe first experiment is analogous to dividing the estimate into 25 equal parts. The errors in the\nestimate of each part are not likely to point in the same direction. And that's why, when we did\nthe experiment three more times, the results ended up near the origin.\nThe second experiment is analogous to making the estimate in one gulp, and not subdividing. And\nthat's why the expected error is so large. The moral is to subdivide!\n4. Your turn to create\nInvent - but do not solve! - an estimation question for which dividing and conquering into\nassorted subproblems would help solve it (i.e. that would illustrate heterogeneous divide and\nconquer). To give you an idea for the kinds of problems that might work well, the classic of\nthis genre, due to Fermi, is 'How many piano tuners are there in Chicago?' Other examples\nare the warmup problems on this problem sheet and the problems that we solved in lecture.\nParticularly interesting or instructive questions will appear on the website or as examples in\nlecture or the notes (let me know should you not want your name attributed in case your\nquestion gets selected)."
    },
    {
      "category": "Resource",
      "title": "Homework 2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-055j-the-art-of-approximation-in-science-and-engineering-spring-2008/03af95a17d0383aa078fc9ff2db78c96_hw02.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n6.055J / 2.038J The Art of Approximation in Science and Engineering\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nZ\n6.055J/2.038J (Spring 2008)\nHomework 2\nDo the following warmups and problems. Due in class on Monday, 03 Mar 2008.\nOpen universe: Collaboration, notes, and other sources of information are encouraged. However, avoid\nlooking up answers until you solve the problem (or have tried hard). That policy helps you learn the most\nfrom the problems.\nBring a photocopy to class on the due date, trade it for a solution set, and figure out or ask me about\nany confusing points. Your work will be graded lightly: P (made a reasonable effort), D (did not make a\nreasonable effort), or F (did not turn in).\nWarmups\n1. Fish tank\nEstimate the mass of a typical home fish tank (filled with water and fish): a useful exercise\nbefore you help a friend move who has a fish tank.\n2. Bandwidth\nEstimate the bandwidth (bits/s) of a 747 crossing the Atlantic filled with CDROM's.\n3. Integrals\nEvaluate these definite integrals:\nZ 10\na.\nx3e-x2 dx\n-10\ninf\nx3\nb.\ndx\n1 + 7x2 + 18x8\n-inf\nProblems\n4. Number sum\nUse symmetry to find the sum of the integers between 200 and 300 (inclusive).\n5. Repainting MIT\nEstimate the cost to repaint all indoor walls in the main MIT classroom buildings. [with thanks\nto D. Zurovcik]\n6. Raindrop speed\n\nHomework 2 / 6.055J/2.038J: Art of approximation in science and engineering (Spring 2008)\na. How does a raindrop's terminal velocity v depend on the raindrop's radius r?\nb. Estimate the terminal speed for a typical raindrop.\nc.\nHow could you check your estimate in part (b)?\n7. Mountains\nLook up the height of the tallest mountain on earth, Mars, and Venus, and explain any pattern\nin the three values.\n8. Your turn to create\nInvent - but do not solve! - a question for which proportional reasoning or symmetry would\nhelp solve.\nParticularly enjoyable questions might appear on the website or as examples in lecture or\nthe notes (let me know if you do not want your name attributed in case your question gets\nselected).\nOptional\n9. Heat equation\nIn lecture we used symmetry to argue that the temperature at the center of the\nmetal sheet is the average of the temperatures of the sides.\nCheck this result by making a simulation or, if you are bold but crazy, by finding\nan analytic solution of the heat equation.\n10*\n10*\n10*\n10*\n80*\nT =?"
    },
    {
      "category": "Resource",
      "title": "Solution Set 2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-055j-the-art-of-approximation-in-science-and-engineering-spring-2008/1dfc2717711f11489812202736168fe4_sol02.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n6.055J / 2.038J The Art of Approximation in Science and Engineering\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\n6.055J/2.038J (Spring 2008)\nSolution set 2\nDo the following warmups and problems. Due in class on Monday, 03 Mar 2008.\nOpen universe: Collaboration, notes, and other sources of information are encouraged. However, avoid\nlooking up answers until you solve the problem (or have tried hard). That policy helps you learn the most\nfrom the problems.\nBring a photocopy to class on the due date, trade it for a solution set, and figure out or ask me about\nany confusing points. Your work will be graded lightly: P (made a reasonable effort), D (did not make a\nreasonable effort), or F (did not turn in).\nWarmups\n1. Fish tank\nEstimate the mass of a typical home fish tank (filled with water and fish): a useful exercise\nbefore you help a friend move who has a fish tank.\nBy having good aim or getting lucky, I won two tiny goldfish at our elementary school's annual\nfair. They lived happily for many years in our fish tank, eventually growing to 7 inches in length.\nThe tank was perhaps 1 foot wide, 3 feet long, and 1.5 feet high, which is a volume of\nV ∼ 0.3 m × 1 m × 0.5 m ∼ 0.15 m3 .\nIf it filled two-thirds with water, that's 0.1 m3 of water or 100 kg! The glass tank itself has a much\nlower mass so the main contribution is from the water.\nI estimated the mass to only one digit, neglecting the mass of the empty tank. That's no worse\nthan the errors from the length estimates. The tank itself is an old memory (from 30 years ago) and\nthere's no need to overengineer the estimate.\n2. Bandwidth\nEstimate the bandwidth (bits/s) of a 747 crossing the Atlantic filled with CDROM's.\nDivide and conquer! Here's a tree on which to fill values:\nbandwidth\ncapacity (bits) of 747\nnumber of CDROM's\ncargo mass\nCDROM mass\nCDROM capacity\ntime to cross Atlantic\n\nZ\nSolution set 2 / 6.055J/2.038J: Art of approximation in science and engineering (Spring 2008)\nFirst I estimate the cargo mass. A 747 can easily carry about 400 people, each person having a mass\n(with luggage) of, say 140 kg. The total mass is\nm ∼ 400 × 140 kg ∼ 6· 104 kg.\nA special cargo plane, with no seats or other frills for passengers, probably can carry 105 kg.\nHere are the other estimates. A CDROM's mass is perhaps one ounce or 30 g. So the number of\nCDROM's is 3· 106. The capacity of a CDROM is 600 MB or about 5· 109 bits. The time to cross the\nAtlantic is about 8 hours or 3· 104 s.\nNow propagate the values toward the root of the tree:\nbandwidth (capacity/time)\n5·1011 s-1\ncapacity (bits) of 747\n1.5·1016\nnumber of CDROM's\n3·106\ncargo mass\n105 kg\nCDROM mass\n30 g\nCDROM capacity\n5·109\ntime to cross Atlantic\n3·104 s\nThe bandwidth is 0.5 terabits per second.\nDespite the large bandwidth offered by a 747 carrying CDROM's (not to mention DVDROM's),\ntrans-Atlantic Internet connections go via undersea fiber-optic cables. Low latency is important!\n3. Integrals\nEvaluate these definite integrals:\nZ 10\na.\nx3e-x2 dx\n-10\nThe integrand x3e-x2 is antisymmetric: Replacing x by -x changes the function's sign. Therefore\nintegrating it over a symmetric range such as -10 to 10 produces zero.\ninf\nx3\nb.\ndx\n1 + 7x2 + 18x8\n-inf\nThis integrand is also antisymmetric, so integrating it over a symmetric range such as -inf to inf\nproduces zero.\n[As a physics undergraduate, I spent many hours with the table of integrals that we knew\naffectionately as Gradshteyn. The table was so massive and complete that when we could not\nlocate an integral in it, we suspected that the integral should be zero and went looking for the\nsymmetry.]\n\nSolution set 2 / 6.055J/2.038J: Art of approximation in science and engineering (Spring 2008)\nProblems\n4. Number sum\nUse symmetry to find the sum of the integers between 200 and 300 (inclusive).\nReversing the order of the terms is the symmetry operation because the sum is the same in reverse:\n200 + 201 + 202 +\n+ 300 = 300 + 299 + 298 +\n+ 200.\n· · ·\n· · ·\nAdd these sums as follows:\n200 + 201 + 202 +\n+ 300\n· · ·\n+ 300 + 299 + 298 +\n+ 200\n· · ·\n= 500 + 500 + 500 +\n+ 500.\n· · ·\nThere are 101 copies of the 500, so this duplicated sum is 500 × 101 = 50500. The original sum is\none-half of the duplicated sum, so it is 25250.\nA quick confirmation is the following Unix pipeline:\nseq 200 300 | awk 'BEGIN {total=0}; {total += $1}; END {print total};'\nwhich produces 25250.\n5. Repainting MIT\nEstimate the cost to repaint all indoor walls in the main MIT classroom buildings. [with thanks\nto D. Zurovcik]\nPainting requires paint and labor. Let's estimate the ratio of labor to paint costs. A painter charges\nsay $35/hour. A gallon of paint costs maybe $25. How much wall or ceiling area gets painted with\nthat much paint? One method is to guess that paint goes onto walls as thickly as a sheet of paper\n(0.01 cm). So a gallon, which is roughly 4l, can cover\n4000 cm3\n0.01 cm ∼ 4· 105 cm ∼ 40 m .\nSince walls are roughly 4 m high, that's 10 m of wall, or one wall of a small classroom (or a medium-\nsized room in a house). It will take probably a couple hours to paint the wall, costing about $70, so\nlabor is more important than materials in the total cost.\nThe estimate in the last paragraph is 20 m2 per hour, or about $2/ m2. Now estimate the classroom\narea. For a typical classroom, the wall and ceiling area is perhaps five times the area of the wall that\nseparates the classroom from the corridor. So I'll estimate the wall area of the corridors. Walking\nthe Infinite Corridor takes me about 3-4 minutes. Typical walking is 3 miles per hour, which is\n1.5 m s-1, makes its length 300 m. There are four storeys, maybe five if you count the basement. So\nthat makes 1500 m of corridor. Multiply by a factor of 2 since there are walls on both sides; by a\nfactor of 2 to account for the other parts of the main building; and by another factor of 2 to account\nfor the other classroom buildings. That gives 104 m of wall, or about 4 104 m2 of wall. Multiplying\n·\nby the factor of 5 gives 2 105 m2 of surface to be painted.\n·\nTo paint 2 105 m2 would cost about $4 105.\n·\n·\n\nr\nSolution set 2 / 6.055J/2.038J: Art of approximation in science and engineering (Spring 2008)\n6. Raindrop speed\na. How does a raindrop's terminal velocity v depend on the raindrop's radius r?\nThe weight of the raindrop is the density times the volume times g:\nW ∼ ρr3g,\nwhere I neglect dimensionless factors such as 4π/3.\nAt terminal velocity, the weight equals the drag. The drag is\nF ∼ ρairv2A ∼ ρairv2r2 .\nEquating the weight to the drag gives an equation for v and r:\nρairv2r2 ∼ ρr3g,\nso v ∝ r1/2.\nBigger raindrops fall faster but - because of the square root - not much faster.\nb. Estimate the terminal speed for a typical raindrop.\nWith the g and the densities, the terminal velocity is\nρ\nv ∼\nρair\ngr.\nA typical raindrop has a diameter of maybe 6 mm, so r ∼ 3 mm. Since the density ratio between\nwater and air is roughly 1000,\nv ∼\n√\n1000 × 10 m s-2 × 3 10-3 m ∼ 5 m s-1 .\n·\nc.\nHow could you check your estimate in part (b)?\nFirst convert the speed into a more familiar value: 11 mph (miles per hour). If one drives at a\nspeed vcar, then raindrops appear to move at an angle arctan(vcar/v). When vcar = v, the drops\ncome at a 45-degree angle. So one way to measure the terminal speed is to drive in a rainstorm,\nslowly accelerating while the passenger says when the drops come at a 45-degree angle.\nYou could also run in a rainstorm and note the speed at which a small umbrella has to be at 45\ndegrees to keep you perfectly dry.\n7. Mountains\nLook up the height of the tallest mountain on earth, Mars, and Venus, and explain any pattern\nin the three values.\n\nSolution set 2 / 6.055J/2.038J: Art of approximation in science and engineering (Spring 2008)\nThe heights are:\n- Mars: 27 km (Mount Olympus)\n- earth: 9 km (Mount Everest)\n- Venus: 11 km (Maxwell Montes)\nOne pattern is that the large planets (earth and Venus) have short mountains, at least short com\npared to Mount Olympus at a huge height of 27 km.\nLarge planets presumably have stronger gravitational fields at their surface, which keeps the\nmountains closer to the ground. The derivation in lecture on mountain heights dropped the depen\ndence on g because we looked only at mountains on earth. Here's the same derivation but retaining\ng. The weight of a mountain of size l is W ∝ gl3, so the pressure at the base is p ∝ gl3/l2 ∼ gl. When\nthe pressure exceeds the maximum pressure that rock can support, the mountain can no longer\ngrow upward. So the maximum height l depends inversely on g:\nl ∝ g-1 .\nTo test that analysis, here are the gravitational field strengths on the three planets:\n- Mars: 3.7 m s-2\n- earth: 10 m s-2\n- Venus: 8.9 m s-2\nThe product gl for each planet should be the same, and it roughly is:\n- Mars: 105 m2 s-2\n- earth: 0.9· 105 m2 s-2\n- Venus: 0.98· 105 m2 s-2\nFun question: Why aren't mountains on the moon 60 km tall (since the Moon's surface gravity is\nabout one-sixth of earth's surface gravity)?\n8. Your turn to create\nInvent - but do not solve! - a question for which proportional reasoning or symmetry would\nhelp solve.\nParticularly enjoyable questions might appear on the website or as examples in lecture or\nthe notes (let me know if you do not want your name attributed in case your question gets\nselected).\nOptional\n\nSolution set 2 / 6.055J/2.038J: Art of approximation in science and engineering (Spring 2008)\n9. Heat equation\n10*\n10*\n10*\n10*\n80*\nT =?\nIn lecture we used symmetry to argue that the temperature at the center of the\nmetal sheet is the average of the temperatures of the sides.\nCheck this result by making a simulation or, if you are bold but crazy, by finding\nan analytic solution of the heat equation.\nThis simulation in Python was written to be clear though not necessarily efficient. It uses a lat\ntice to approximate the continuous sheet, and implements so-called relaxation: At each step, the\ntemperature at each point is replaced by the average temperature of the neighbors. The main\ncomplications are:\n1. The edges of the pentagon are held at fixed temperatures (10 degrees for four edges and 80\ndegrees for the fifth edge). However, the relaxation step does not maintain those fixed values.\nSo they are re-imposed after each sweep through the lattice.\n2. Only one of the edges lies along a coordinate direction. The other four edges have funny slopes,\nand need to be rasterized. It is the identical problem to rendering lines on a laser printer: Which\npixels get the toner? Bresenham's algorithm does the rasterization.\n# Relaxation simulation of the temperature at the center of the pentagon.\n# Four edges are held at 10 degrees, and the fifth at 80 degrees.\nfrom scipy import *\n# rounds to nearest integer, and returns an integer\ndef intround(f):\nreturn int(round(f))\n# Bresenham's algorithm: returns list of lattice points on the line connecting\n# r1 and r2\ndef line(r1, r2):\nx0, y0 = intround(r1[0]), intround(r1[1])\nx1, y1 = intround(r2[0]), intround(r2[1])\npoints = []\nsteep = abs(y1 - y0) > abs(x1 - x0)\nif steep:\nx0,y0 = y0,x0\nx1,y1 = y1,x1\nif x0 > x1:\nx0,x1=x1,x0\ny0,y1=y1,y0\ndeltax = x1 - x0\ndeltay = abs(y1 - y0)\nerror = 0\ndeltaerr = float(deltay) / deltax\ny = y0\nif y0 < y1:\nystep = 1\nelse:\nystep = -1\n\nSolution set 2 / 6.055J/2.038J: Art of approximation in science and engineering (Spring 2008)\nfor x in range(x0,x1+1):\nif steep:\npoints.append((y,x))\nelse:\npoints.append((x,y))\nerror += deltaerr\nif error >= 0.5:\ny += ystep\nerror -= 1.0\nreturn points\ndef complex2pair(c):\nreturn (real(c),imag(c))\ndef set_edge_temps(grid):\nfor e in lo_temp_edges:\ngrid[e[0]][e[1]] = 10\nfor e in hi_temp_edges:\nif e in lo_temp_edges:\ngrid[e[0]][e[1]] = 45 # corner joining high- and lo-temp edges\nelse:\ngrid[e[0]][e[1]] = 80\nangle\n= 72.0/180*pi\n# 72 degrees\n# use complex plane to find the vertices\nr\n= exp(angle*1j)\n# pentagon vertices in the complex plane, with first vertex duplicated\n# at the end of the list\ncorners\n= array([r**(i+0.25) for i in range(6)])\n# translate pentagon into first quadrant\ncorners -= complex(min(real(corners)), min(imag(corners)))\ncorners *= 50\n# grid spacing (bigger means finer spacing)\ncenter\n= sum(corners[0:5])/5 # center of pentagon\n# use Bresenham's algorithm to find the lattice points on the edges\nlo_temp_edges = []\nhi_temp_edges = []\nfor i in range(4):\nlo_temp_edges += line(complex2pair(corners[i]), complex2pair(corners[i+1]))\nhi_temp_edges = line(complex2pair(corners[4]), complex2pair(corners[5]))\n# figure out the grid dimensions\nmax_x = max([r[0] for r in lo_temp_edges+hi_temp_edges])\nmax_y = max([r[1] for r in lo_temp_edges+hi_temp_edges])\ngrid\n= zeros((max_x+1,max_y+1))\ndirs = [(-1,0), (1,0), (0,1), (0,-1)]\nwhile True:\nnewgrid = zeros((max_x+1,max_y+1))\nset_edge_temps(grid)\n# impose constraint\nfor x in range(max_x+1):\n# relax each location to avg of its neighbors\nfor y in range(max_y+1):\n\nSolution set 2 / 6.055J/2.038J: Art of approximation in science and engineering (Spring 2008)\ntotal = n = 0\nfor d in dirs:\n# use each neighbor that's within the grid\ntry:\ntotal += grid[x+d[0]][y+d[1]]\nn += 1\nexcept: pass\n# that neighbor was not inside the grid\nnewgrid[x][y] = total/n # but save new value in a new grid\ngrid, newgrid = newgrid, grid\n# swap new and old grid\n# print temperature at the center of the pentagon\nprint grid[intround(real(center))][intround(imag(center))]"
    },
    {
      "category": "Resource",
      "title": "Homework 3",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-055j-the-art-of-approximation-in-science-and-engineering-spring-2008/a2216ef47756d89473b997bef96f5fe7_hw03.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n6.055J / 2.038J The Art of Approximation in Science and Engineering\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\n6.055J/2.038J (Spring 2008)\nHomework 3\nDo the following warmups and problems. Due in class on Friday, 14 Mar 2008.\nOpen universe: Collaboration, notes, and other sources of information are encouraged. However, avoid\nlooking up answers until you solve the problem (or have tried hard). That policy helps you learn the most\nfrom the problems.\nBring a photocopy to class on the due date, trade it for a solution set, and figure out or ask me about\nany confusing points. Your work will be graded lightly: P (made a reasonable effort), D (did not make a\nreasonable effort), or F (did not turn in).\nWarmups\n1. Explain a Unix pipeline\nWhat does this pipeline do?\nls -t | head | tac\n[Hint: If you are not familiar with Unix commands, use the man command on Athena or on\nany nearby Unix or GNU/Linux system.]\n2. Symmetry for algebra\nUse symmetry to find (a - b)3.\nProblems\n3. Highway vs city driving\nIn lecture we derived a measure of how important drag is for a car moving at speed v for a\ndistance d:\nEdrag\nρv2Ad .\nEkinetic\n∼ mcarv2\na. Show that the ratio is equivalent to the ratio\nmass of the air displaced\nmass of the car\nand to the ratio\nρair\nd\nρcar\n× lcar\n,\nwhere ρcar is the density of the car (i.e. its mass divided by its volume) and lcar is the length\nof the car.\n\nHomework 3 / 6.055J/2.038J: Art of approximation in science and engineering (Spring 2008)\nb. Make estimates for a typical car and find the distance d at which the ratio becomes signif\nicant (say, roughly 1). How does the distance compare with the distance between exits on\nthe highway and between stop signs or stoplights on city streets?\n4. Symmetry for second-order systems\nThis problem analyzes the frequency of maximum gain for an LRC circuit or, equivalently, for\na damped spring-mass system. The gain of such a system is the ratio of the input amplitude\nto the output amplitude as a function of frequency.\nIf the output voltage is measured across the resistor, and you drive the circuit with a voltage\noscillating at frequency ω, the gain is (in a suitable system of units):\njω\nG(ω) = 1 + jω/Q - ω2 ,\nwhere j =\n√\n-1 and Q is quality factor, a dimensionless measure of the damping.\nDo not worry if you do not know where that gain formula comes from. The purpose of this\nproblem is not its origin, but rather using symmetry to maximize its magnitude.\na. Show that the magnitude of the gain is\nω\n|G(ω)| = q\n.\n1 - ω2\n+ ω2/Q2\nb. Find a variable substitution (a symmetry operation) ωnew = f(ω) that turns |G(ω)| into\n|H(ωnew)| such that G and H are the same function (i.e. they have the same structure but\nwith ω in G replaced by ωnew in H).\nc. Use the form of that symmetry operation to maximize |G(ω)| without using calculus.\nd. [Optional, for masochists!] Maximize |(Gω)| using calculus.\n5. Gravity on the moon\nIn this problem you use a scaling argument to estimate the strength of gravity on the surface\nof the moon.\na. Assume that a planet is a uniform sphere. What is the proportionality between the gravi\ntational acceleration g at the surface of a planet and the planet's radius R and density ρ?\nb. Write the ratio gmoon /gearth as a product of dimensionless factors as in the analysis of the\nfuel efficiency of planes.\nc. Estimate those factors and estimate the ratio gmoon /gearth, then estimate gmoon. [Hint: To\nestimate the radius of the moon, whose angular size you can estimate by looking at it, you\nmight find it useful to know that the moon is 4 108 m distant from the earth.]\n·\n\nHomework 3 / 6.055J/2.038J: Art of approximation in science and engineering (Spring 2008)\nd. Look up gmoon and compare the value to your estimate, venturing an explanation for any\ndiscrepancy.\n6. Checking plane fuel-efficiency calculation\nThis problem offers two more methods to estimate the fuel efficiency of a plane.\na. Use the cost of a plane ticket to estimate the fuel efficiency of a 747, in passenger-miles per\ngallon.\nb. According to Wikipedia, a 747-400 can hold up to 2 105l of fuel for a maximum range of\n·\n1.3 104 km. Use that information to estimate the fuel efficiency of the 747, in passenger-\n·\nmiles per gallon.\nHow do these values compare with the rough result from lecture, that the fuel efficiency is\ncomparable to the fuel efficiency of a car?\n7. Invent your own problem\nInvent your own problem whose solution might use symmetry, proportional reasoning, or a\nUnix pipeline.\nOptional\n8. Design a Unix pipeline\nMake a pipeline that prints the ten most common words in the input stream, along with how\nmany times each word occurs. They should be printed in order from the the most frequent\nto the less frequent words. [Hint: First translate any non-alphabetic character into a newline.\nUseful utilities include tr and uniq.]"
    },
    {
      "category": "Resource",
      "title": "Solution Set 3",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-055j-the-art-of-approximation-in-science-and-engineering-spring-2008/0f2b688b7b86ae9e0deb5eecc5218433_sol03.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n6.055J / 2.038J The Art of Approximation in Science and Engineering\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\n6.055J/2.038J (Spring 2008)\nSolution set 3\nDo the following warmups and problems. Due in class on Friday, 14 Mar 2008.\nOpen universe: Collaboration, notes, and other sources of information are encouraged. However, avoid\nlooking up answers until you solve the problem (or have tried hard). That policy helps you learn the most\nfrom the problems.\nBring a photocopy to class on the due date, trade it for a solution set, and figure out or ask me about\nany confusing points. Your work will be graded lightly: P (made a reasonable effort), D (did not make a\nreasonable effort), or F (did not turn in).\nWarmups\n1. Explain a Unix pipeline\nWhat does this pipeline do?\nls -t | head | tac\n[Hint: If you are not familiar with Unix commands, use the man command on Athena or on\nany nearby Unix or GNU/Linux system.]\nThe ls -t lists the files and subdirectories in a directory ordered by modification time with the\nmost recently modified files at the beginning. The head selects the first ten lines, which means\nthe first ten names. The tac reverses the order of the lines, so the 10th-most-recently-modified file\n(or subdirectory) comes first, then the 9th-most-recently-modified file, etc. with the most-recently\nmodified file at the end of the list.\n2. Symmetry for algebra\nUse symmetry to find (a - b)3.\nThe original expression is antisymmetric in a and b: The result changes sign if you swap a and b.\nThe expansion has third-degree terms such as a3 or a2b. One category of third-degree terms is\nlike a3 and includes a3 and b3. The antisymmetric combination is a3 - b3. The other category of\nthird-degree terms is like a2b and includes a2b and ab2. The antisymmetric combination is a2b - ab2.\nThe expansion therefore has the antisymmetric form\n(a - b)3 = A(a3 - b3) + B(a2b - ab2)\nwhere A and B are constants to be determined.\nSetting b = 0 shows that A = 1, because (a - 0)3 = A(a3 - 0) + B(0 - 0) or a3 = Aa3.\nTo find B, think about the naive expansion of (a - b)3. The basic expression a - b has two terms, so\n(a - b)3 has eight terms (before collecting like terms). So the absolute values of the coefficients of\neach term in the form\n\nSolution set 3 / 6.055J/2.038J: Art of approximation in science and engineering (Spring 2008)\nA(a3 - b3) + B(a2b - ab2)\nhave to add to eight. With A = 1, this requirement shows that B = ±3. The choice B = -3 gives the\ncorrect sign for the a2b term (which has one negative factor from the -b).\nSo\n(a - b)3 = (a3 - b3) - 3(a2b - ab2).\nProblems\n3. Highway vs city driving\nIn lecture we derived a measure of how important drag is for a car moving at speed v for a\ndistance d:\nEdrag\nρv2Ad .\nEkinetic\n∼ mcarv2\na. Show that the ratio is equivalent to the ratio\nmass of the air displaced\nmass of the car\nand to the ratio\nρair\nd\nρcar\n× lcar\n,\nwhere ρcar is the density of the car (i.e. its mass divided by its volume) and lcar is the length\nof the car.\nIn the ratio ρv2Ad/mcarv2, the v2 divide out leaving ρAd/mcar, where ρ is the air density. Since\nA is the cross-sectional area of the car, Ad is the volume of air that the car displaces, and ρAd is\nthe mass of that air. So\nEdrag\nρv2Ad\nρAd\nmass of the air displaced\n=\n=\n.\nEkinetic\n∼ mcarv2\nmcar\nmass of the car\nAn alternative equivalence comes from writing the mass of the car as ρcar Alcar. Making that\nsubstitution and dividing out the v2 gives\nρv2Ad\nρairAd\nρair\nd\nmcarv2 = ρcarAlcar\n= ρcar lcar\n.\nb. Make estimates for a typical car and find the distance d at which the ratio becomes signif\nicant (say, roughly 1). How does the distance compare with the distance between exits on\nthe highway and between stop signs or stoplights on city streets?\n\nSolution set 3 / 6.055J/2.038J: Art of approximation in science and engineering (Spring 2008)\nA typical car has mass mcar ∼ 103 kg, cross-sectional area A ∼ 2 m × 1.5 m = 3 m2, and length\nlcar ∼ 4 m. So\nmcar\n103 kg\nρcar\n× 4 m ∼ 102 kg m-3 .\n∼ Alcar\n∼ 3 m2\nSince ρcar/ρair ∼ 100, the ratio\nρair\nd\nρcar lcar\nbecomes 1 when d/lcar ∼ 100, so d ∼ 400 m.\nThis distance d is significantly farther than the distance between stop signs or stoplights on\ncity streets. In Manhattan, for example, 20 east-west blocks are one mile, giving a spacing of\napproximately 80 m. So air resistance is not a significant loss in city driving. Instead the loss\ncomes from engine friction, rolling resistance, and braking.\nHowever, the distance d is comparable to the exit spacing on urban highways. So when you\ndrive on the highway for even a few exit distances, air resistance is a significant loss.\nInterestingly, highway fuel efficiencies are higher than city fuel efficiencies, even though drag\ngets worse at the higher, highway speeds, and presumably engine friction and rolling resis\ntance also get worse at higher speeds. Only one loss mechanism, braking, is less prevalent in\nhighway than in city driving. So braking must cause a significant loss in city driving. Regen\nerative braking, for hybrid or electric cars, should significantly improve fuel efficiency in city\ndriving.\n4. Symmetry for second-order systems\nThis problem analyzes the frequency of maximum gain for an LRC circuit or, equivalently, for\na damped spring-mass system. The gain of such a system is the ratio of the input amplitude\nto the output amplitude as a function of frequency.\nIf the output voltage is measured across the resistor, and you drive the circuit with a voltage\noscillating at frequency ω, the gain is (in a suitable system of units):\njω\nG(ω) = 1 + jω/Q - ω2 ,\nwhere j =\n√\n-1 and Q is quality factor, a dimensionless measure of the damping.\nDo not worry if you do not know where that gain formula comes from. The purpose of this\nproblem is not its origin, but rather using symmetry to maximize its magnitude.\na. Show that the magnitude of the gain is\nω\n|G(ω)| = q\n1 - ω2 2 + ω2/Q2\n.\nThe magnitude of the numerator is ω (assuming positive frequency). The magnitude of the\ndenominator is\np\n|real part|2 + |imaginary part|2 so it is\nq\n1 - ω2 2 + ω2/Q2.\nThe ratio of magnitudes is |G(ω)|:\n\nSolution set 3 / 6.055J/2.038J: Art of approximation in science and engineering (Spring 2008)\n|G(ω)| =\nω\nq\n1 - ω2 2 + ω2/Q2\n.\nb. Find a variable substitution (a symmetry operation) ωnew = f(ω) that turns |G(ω)| into\n|H(ωnew)| such that G and H are the same function (i.e. they have the same structure but\nwith ω in G replaced by ωnew in H).\nWhen maximizing a parabolic function such as y = x(6 - x), the symmetry is reflection about\nthe line x = 3. In symbols, the transformation is xnew = 6 - x.\nLet's transfer a few lessons from the parabola example to the problem of maximizing the gain.\nIn the parabola example, the symmetry is a reflection about an interesting point (there, the\npoint halfway between the two roots x = 0 and x = 6). Analogously, an interesting frequency\nis ω = 1 because it makes the real part of the denominator in G(ω) go to zero, and making the\nreal part go to zero helps minimize the denominator.\nTherefore reflecting about ω = 1 is worth trying, perhaps ωnew = 1 - ω. For frequencies,\nhowever, differences are not as important as ratios. For example, a musical octave is a factor\nof 2 in frequency, rather than a difference. So reflect in a multiplicative way: ωnew = w-1.\nThis transformation works either in G(ω) or in the magnitude |G(ω)|. It's slightly easier in G(ω):\njω\nj/ωnew\nG(ω) = 1 + jω/Q - ω2 7→ H(ωnew) = 1 + j/Qωnew - 1/ω2\n.\nnew\nMultiply numerator and denominator by ω2\n:\nnew\nH(ωnew) = ω2\njωnew\n,\nnew + jωnew/Q - 1\nwhich is the same function as G(ω), except for negating the real part in the denominator.\nNegating the real part in the denominator doesn't affect the magnitude of the denominator,\nso |H(ωnew)| has the same form as |G(ω)|.\nc. Use the form of that symmetry operation to maximize |G(ω)| without using calculus.\nSince ωnew = 1/ω, the maximum value of ωnew will be ω-1 . That's one equation.\nmax\nSince the two magnitudes |G(ω)| and |H(ωnew)| are the same function, the maximum value of\nωnew is also the maximum value of ω. That's the second equation.\nTogether they produce ω = ωnew = 1 (ignoring the negative-frequency solution ω = -1). At\nthat frequency, |G(ω)| is Q. For the electrical and mechanical engineers: The quality factor Q is\nalso the gain at resonance.\n\np\n\nSolution set 3 / 6.055J/2.038J: Art of approximation in science and engineering (Spring 2008)\nd. [Optional, for masochists!] Maximize |(Gω)| using calculus.\nA direct differentiation of |G(ω)| is too awful for words, and I cannot make myself do it. Instead\nI'll massage the expression until differentiating is not horrible or maybe not even needed.\nFirst, put the ω from the numerator into the denominator by multiplying numerator and de\nnominator by 1/ω:\nω\n|G(ω)| = q\n= q\n.\n1 - ω2\n+ ω2/Q2\nω-1 - ω + 1/Q2\nSecond, find the extremum of an equivalent, simpler expression. Maximizing 1/ f(ω) is equiv\nalent to maximizing 1/ f(ω). And maximizing 1/ f(ω) is equivalent to minimizing f(ω). So I'll\nfind the extremum of\n\nω-1 - ω + 1/Q2 .\nFurthermore, the 1/Q2 doesn't affect the location of the extremum, so instead I minimize ω-1-\nω . Even better, the squaring does not affect the location of the extremum, so I minimize the\nabsolute value of ω-1 - ω. Its absolute value can never fall below zero, and it equals zero when\nω = 1. So ω = 1 is the location of the maximum of |G(ω)|. No need for differentiation!\n5. Gravity on the moon\nIn this problem you use a scaling argument to estimate the strength of gravity on the surface\nof the moon.\na. Assume that a planet is a uniform sphere. What is the proportionality between the gravi\ntational acceleration g at the surface of a planet and the planet's radius R and density ρ?\nThe force of gravity on an object of mass m is F = mg. By Newton's law of gravitation, it is also\nF = GMm/R2, where M is the mass of the planet and G is Newton's constant of gravitation.\nTherefore the gravitational acceleration is g = GM/R2. Since M = ρ(4π/3)R3, the gravitational\nacceleration is\nGρ(4π/3)R3\ng =\nR2\n∝ ρR.\nIn the last step, G vanished and the equals sign got replaced by a proportionality, which is okay\nsince G is the same for all planets in the universe.\nb. Write the ratio gmoon /gearth as a product of dimensionless factors as in the analysis of the\nfuel efficiency of planes.\nUsing the proportionality, the ratio of gravities is\ngmoon\nρmoon Rmoon\n=\n.\ngearth\nρearth Rearth\nThe factors are ratios of densities or radii, so they are dimensionless.\n\n|{z}\n|{z}\nSolution set 3 / 6.055J/2.038J: Art of approximation in science and engineering (Spring 2008)\nc. Estimate those factors and estimate the ratio gmoon /gearth, then estimate gmoon. [Hint: To\nestimate the radius of the moon, whose angular size you can estimate by looking at it, you\nmight find it useful to know that the moon is 4 108 m distant from the earth.]\n·\nI'll first assume that earth and moon rock are the same. So ρmoon /ρearth ∼ 1.\nThe earth's radius is worth memorizing once you've derived it. Here's one way to derive it.\nThe distance from Boston to San Francisco is about 3000 miles, and the cities are separated by\nthree time zones. So the sun 'travels' about 1000 miles per time zone (per hour). Since one day\nhas 24 time zones, the sun's travel around the earth is about 24,000 miles. That value is the\ncircumference 2πRearth, so Rearth ∼ 4 103 mi (since π ∼ 3) or 6.4 103 km. This estimate neglects\n·\n·\na trigonometric factor due Boston not being on the equator, but it makes other errors, and they\ncancel (surprise!): The true value of the mean radius is 6373 km.\nThe moon's radius needs a different analysis. I can just cover the moon with my index finger\nat arm's length. So the moon subtends an angle\nwidth of my finger\n1 cm\nθ ∼\nmy arm length\n∼ 1 m ∼ 0.01.\nSo the diameter of the moon is roughly θd, where d ∼ 4 108 m is the distance to the moon, and\n·\nthe radius is therefore Rmoon ∼ 2 106 m. If the moon is hidden, you can (carefully!) use the sun\n·\ninstead because it has the same angular size as the moon - which is the explanation for total\nsolar eclipses.\nThe density and radii factors produce\ngmoon\ngearth\n=\n×\n= 3.\ndensities\nradii\nSo gmoon ∼ 3 m s-2.\nd. Look up gmoon and compare the value to your estimate, venturing an explanation for any\ndiscrepancy.\nThe true value is gmoon ∼ 1.6 m s-2. So the estimate is too high by a factor of 2. The radii\nestimates are fairly accurate, so the equal-density assumption must be significantly wrong. So\nthe moon's density is much less than the earth's. The actual values are ρmoon ∼ 3.4 g cm-3 and\nρearth ∼ 5.5 g cm-3. However, ρmoon is comparable to the density of rock in the earth's crust.\nPerhaps the moon was once part of the earth's crust, which is still a viable theory of the moon's\norigin.\n6. Checking plane fuel-efficiency calculation\nThis problem offers two more methods to estimate the fuel efficiency of a plane.\n\nSolution set 3 / 6.055J/2.038J: Art of approximation in science and engineering (Spring 2008)\na. Use the cost of a plane ticket to estimate the fuel efficiency of a 747, in passenger-miles per\ngallon.\nA roundtrip ticket from New York to San Francisco costs roughly $400. The journey is about\n2500 miles each way, so a 5000-mile journey costs about $500 (rounding up the $400 to make\nthe math easier). That's about 10 cents/mile. Perhaps one-half of that cost is fuel. [Although\nthe service - in the air, on the phone, and at the counter - is so lousy due to understaffing that\nperhaps two-thirds of the cost being fuel would be a better estimate!] At 5 cents/mile for fuel,\nand at $3/gallon for fuel, the fuel efficiency is 60 passenger-miles per gallon.\nb. According to Wikipedia, a 747-400 can hold up to 2 105l of fuel for a maximum range of\n·\n1.3 104 km. Use that information to estimate the fuel efficiency of the 747, in passenger-\n·\nmiles per gallon.\nThe 747 can hold about 400 people, so the fuel efficiency is\n400 passengers × 1.3 104 km\n1 mile\n4l\n2 105l\n·\n× 1.6 km × 1 gallon ∼ 65 passenger-miles per gallon.\n·\nThis estimate is amazingly close to the estimate from using the ticket price!\nHow do these values compare with the rough result from lecture, that the fuel efficiency is\ncomparable to the fuel efficiency of a car?\nThe fuel efficiency of a medium-sized car (holding one person, which is typical for California) is\nroughly 30 passenger-miles per gallon. So both fuel-efficiency estimates in this problem give a\nfuel efficiency that is a factor of 2 higher than the result from lecture - not too bad considering\nhow much we neglected (drag coefficient and lift being the main ones) when we estimated the\nefficiency.\n7. Invent your own problem\nInvent your own problem whose solution might use symmetry, proportional reasoning, or a\nUnix pipeline.\nOptional\n8. Design a Unix pipeline\nMake a pipeline that prints the ten most common words in the input stream, along with how\nmany times each word occurs. They should be printed in order from the the most frequent\nto the less frequent words. [Hint: First translate any non-alphabetic character into a newline.\nUseful utilities include tr and uniq.]\n\nSolution set 3 / 6.055J/2.038J: Art of approximation in science and engineering (Spring 2008)\nDivide and conquer! The first step is to get rid of all the non-alphabetic characters and turn them\ninto newlines. Then get rid of the empty lines, which occur either from empty lines in the original\ntext or when consecutive non-alphabetic characters get turned into newlines. Then we'll have the\nwords from the file, one word per line. This piece of the pipeline is\ntr -cs 'a-zA-Z' '\\n'\nThe -c option says that the list of characters is to be inverted (complemented). So tr will trans\nlate all characters except for the upper- and lowercase alphabetic characters a-z and A-Z. The\nbackslash-n is the Unix syntax for the newline character. The -s option tells tr to squeeze repeated\ntranslated characters into one copy of that character; therefore repeated newlines get turned into\none newline, which gets rid of the empty lines.\nTo count the words, sort them and run uniq. uniq looks only at adjacent lines, which is why the\nword list needs to be sorted. In the simplest invocation, uniq print the first line from a series of\nduplicate lines. For example, feeding this input to uniq\nthe\nthe\nthe\nhow\nthe\nhow\nhow\nproduces\nthe\nhow\nthe\nhow\nGiving uniq the -c switch tells it instead to count the duplicates. The same input to uniq -c\nproduces\n3 the\n1 how\n1 the\n2 how\nThe pipeline so far is\ntr -cs 'a-zA-Z' '\\n' | sort | uniq -c\nI want the top ten words, so I reverse sort the list numerically (so that the largest count is at the\ntop) with sort -nr, then select the top ten lines with head.\nThe full pipeline is\ntr -cs 'a-zA-Z' '\\n' | sort | uniq -c | sort -nr | head\nAs a test, here is the result of applying that pipeline to an old email message about misconceptions\nabout gravity on the moon. The full command is:\ntr -cs 'a-zA-Z' '\\n' < email.txt | sort | uniq -c | sort -nr | head\nIt produces this word-frequency list:\n\nSolution set 3 / 6.055J/2.038J: Art of approximation in science and engineering (Spring 2008)\n149 the\n87 it\n65 is\n53 to\n52 Moon\n50 of\n44 will\n43 float\n33 on\n33 away"
    },
    {
      "category": "Resource",
      "title": "Homework 4",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-055j-the-art-of-approximation-in-science-and-engineering-spring-2008/b20eb2e38ad886b128737998fe1e22af_hw04.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n6.055J / 2.038J The Art of Approximation in Science and Engineering\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\n6.055J/2.038J (Spring 2008)\nHomework 4\nDo the following warmups and problems. Due in class on Friday, 04 Apr 2008.\nOpen universe: Collaboration, notes, and other sources of information are encouraged. However, avoid\nlooking up answers until you solve the problem (or have tried hard). That policy helps you learn the most\nfrom the problems.\nBring a photocopy to class on the due date, trade it for a solution set, and figure out or ask me about\nany confusing points. Your work will be graded lightly: P (made a reasonable effort), D (did not make a\nreasonable effort), or F (did not turn in).\nWarmups\n1. Minimum power\nIn lecture we estimated the flight speed that minimizes energy consumption. Call that speed\nvE. We could also have estimated vP, the speed that minimizes power consumption. What is\nthe ratio vP/vE?\n2. Solitaire\nYou start with the numbers 3, 4, and 5. At each move, you choose any two of the three numbers\n- call the choices a and b - and replace them with 0.8a - 0.6b and 0.6a + 0.8b. The goal is to\nreach 4, 4, 4. Can you do it? If yes, give a move sequence; if no, show that you cannot.\nProblems\n3. Bird flight\na. For geometrically similar animals (same shape and composition but different size), how\ndoes the minimum-energy speed v depend on mass M and air density ρ? In other words,\nwhat are the exponents α and β in v ∝ ραMβ?\nb. Use that result to write the ratio v747/vgodwit as a product of dimensionless factors, where\nv747 is the minimum-energy speed of a 747, and vgodwit is the minimum-energy speed of\na bar-tailed godwit. Then estimate the dimensionless factors and their product. Useful\ninformation: mgodwit ∼ 0.4 kg.\nc. Use v747, from experience or from looking it up, to find vgodwit. Compare with the speed of\nthe record-setting bar-tailed godwit, which made its 11, 570 km journey in 8 days, 12 hours.\n4. Hovering and hummingbirds\nA simple model of hovering is that the animal or helicopter (mass M and wingspan L) forces\nair downward to stay aloft.\n\nHomework 4 / 6.055J/2.038J: Art of approximation in science and engineering (Spring 2008)\na. Estimate the downward air speed vdown needed to hover.\nb. Show that the power required to hover is\n(Mg)3/2\n.\nP ∼ ρ1/2L\nc. Estimate P and vdown for a person hovering by flapping or waving his or her arms.\nd. How does P depend on M for geometrically similar animals (same composition and shape\nbut varying size)? In other words, give the exponent β in\nP ∝ Mβ.\ne. What fraction of its body weight does a hummingbird (M ∼ 3 g) eat every day in order to\nhover for a working day (8 hours)? Compare to the fraction for a person in a typical day.\n[Hummingbirds eat nectar, which is roughly equal parts sugar and water.]\nOptional\n5. Inertia tensor\n[For those who know about inertia tensors.] Here is the inertia tensor (the generalization of mo\nment of inertia) of a particular object, calculated in a lousy coordinate system:\na. Change coordinate systems to a set of principal axes. In other words, write the inertia\ntensor as\nIxx\nIyy\nIzz\nand give Ixx, Iyy, and Izz. Hint: What properties of a matrix are invariant when changing\ncoordinate systems?\nb. Give an example of an object with a similar inertia tensor. On Friday in class we'll have a\ndemonstration.\n6. Resistive grid\n\n⎟\n\n⎜\n\n⎟\n\n⎜\n\nHomework 4 / 6.055J/2.038J: Art of approximation in science and engineering (Spring 2008)\nIn an infinite grid of 1-ohm resistors, what is the resistance measured\nacross one resistor?\nTo measure resistance, an ohmmeter injects a current I at one terminal\n(for simplicity, say I = 1 A), removes the same current from the other\nterminal, and measures the resulting voltage difference V between\nthe terminals. The resistance is R = V/I.\nHint: Use symmetry. But it's still a hard problem!\nΩ"
    },
    {
      "category": "Resource",
      "title": "Solution Set 4",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-055j-the-art-of-approximation-in-science-and-engineering-spring-2008/49ef4e4315b10aebc0db742633156021_sol04.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n6.055J / 2.038J The Art of Approximation in Science and Engineering\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\n6.055J/2.038J (Spring 2008)\nSolution set 4\nDo the following warmups and problems. Due in class on Friday, 04 Apr 2008.\nOpen universe: Collaboration, notes, and other sources of information are encouraged. However, avoid\nlooking up answers until you solve the problem (or have tried hard). That policy helps you learn the most\nfrom the problems.\nBring a photocopy to class on the due date, trade it for a solution set, and figure out or ask me about\nany confusing points. Your work will be graded lightly: P (made a reasonable effort), D (did not make a\nreasonable effort), or F (did not turn in).\nWarmups\n1. Minimum power\nIn lecture we estimated the flight speed that minimizes energy consumption. Call that speed\nvE. We could also have estimated vP, the speed that minimizes power consumption. What is\nthe ratio vP/vE?\nThe zillions of constants (such as ρ) clutter the analysis without changing the result. So I'll simplify\nthe problem by using a system of units where all the constants are 1. Then the energy is\nE ∼ v2\nv2 ,\n+\nwhere the first term is from drag and the second term is from lift. The power is energy per time,\nand time is inversely proportional to v, so P ∝ Ev and\n+ .\nP ∼ v3\nv\nThe first term is the steep v3 dependence of drag power on velocity (which we used to estimate the\nworld-record cycling and swimming speeds).\nThe energy expression is unchanged when v\n1/v, so it has a minimum at vE = 1. To minimize\n→\nthe power, use calculus (ask me if you are curious about calculus-free ways to minimize it):\ndP\ndv ∼ 3v2 - v2 = 0,\ntherefore vP = 3-1/4 (roughly 3/4), which is also the ratio vP/vE.\nSo the minimum-power speed is about 25% less than the minimum-energy speed. That result\nmakes sense. Drag power grows very fast as v increases - much faster than lift power decreases -\nso it's worth reducing the speed a little to reduce the drag a lot.\nIf you don't believe the simplification that I used of setting all constants to 1 - and it is not imme\ndiately obvious that it should work - then try using this general form:\nB\nE ∼ Av2 + v2 ,\nwhere A and B are constants. You'll find that vE and vP get the same function of A and B, which\ndisappears from the ratio vP/vE.\n\nSolution set 4 / 6.055J/2.038J: Art of approximation in science and engineering (Spring 2008)\n2. Solitaire\nYou start with the numbers 3, 4, and 5. At each move, you choose any two of the three numbers\n- call the choices a and b - and replace them with 0.8a - 0.6b and 0.6a + 0.8b. The goal is to\nreach 4, 4, 4. Can you do it? If yes, give a move sequence; if no, show that you cannot.\nTo see whether solitaire games are solvable, look for an invariant. Alas there is no algorithm for\nfinding invariants; you have to use clues and make lucky guesses.\nSpeaking of clues, is it a happy coincidence that 0.82 + 0.62 = 1? That convenient sum suggests\nlooking at sums of squares, and how those are changed by making a move. Replacing a and b by\na′ = 0.8a - 0.6b and b′ = 0.6a + 0.8b makes the sum of squares a2 + b2 into a′2 + b′2. Expand that\nexpression:\na′2 + b′2 = (0.8a - 0.6b)2 + (0.6a + 0.8b)2\n= 0.64a2 - 0.96ab + 0.36b2 + 0.36a2 + 0.96ab + 0.64b2\n= a2 + b2 .\nGreat! Each move leaves the sum of squares unchanged. That sum started out with the invariant\nat 32 + 42 + 52 = 50, so it remains 50. The goal state, however, requires that the invariant become\n42 + 42 + 42 = 48. It's not possible to reach the goal.\nThe invariant has a nice geometric interpretation (a picture). To see it, let P = (a, b, c) be the coordi\nnates of a point in three-dimensional space. Then each move leaves unchanged the distance to the\norigin, which is\n√\na2 + b2 + c2. So each move shifts P to another location equally distant from the\norigin, meaning that it moves P on the surface of a sphere. But it cannot escape the surface.\nAn interesting question to which I don't know the answer: Can you reach every point on the\nsurface of the sphere? The distance invariant does not forbid it, but maybe other constraints do?\nProblems\n3. Bird flight\na. For geometrically similar animals (same shape and composition but different size), how\ndoes the minimum-energy speed v depend on mass M and air density ρ? In other words,\nwhat are the exponents α and β in v ∝ ραMβ?\nFrom the lecture notes,\nMg ∼ C1/2ρv2L2 ,\nwhere C is the modified drag coefficient. So\n\n!1/2\nMg\n.\nv ∼ C1/2ρL2\nFor geometrically similar animals, g is independent of size (they all fight the same gravity)\nand C is also independent of size (because the drag coefficient depends only on shape). But M\ndepends on L according to M ∝ L3 or L ∝ M1/3. So the L2 in the denominator is proportional to\nM2/3 making\nv ∝ ρ-1/2M1/6 .\n\nSolution set 4 / 6.055J/2.038J: Art of approximation in science and engineering (Spring 2008)\ngiving α = -1/2 and β = 1/6.\nThe inverse relationship between the speed and density explains why planes fly at a high alti\ntude. The energy consumption at the minimum-energy speed is independent of ρ, so by flying\nhigh where ρ is low, planes increase their speed without increasing their energy consumption.\nb. Use that result to write the ratio v747/vgodwit as a product of dimensionless factors, where\nv747 is the minimum-energy speed of a 747, and vgodwit is the minimum-energy speed of\na bar-tailed godwit. Then estimate the dimensionless factors and their product. Useful\ninformation: mgodwit ∼ 0.4 kg.\nAssuming that the animals and planes fly at the minimum-energy speed,\nv747\nρhigh\n!-1/2\nm747\n!1/6\nvgodwit\n= ρsealevel\n· mgodwit\n.\nA plane flies at around 10 km where the density is roughly one-third of the sea-level density.\nThe mass of a 747 is roughly 4 105 kg, so the mass ratio is 106. Therefore the speed ratio should\n·\nbe roughly\n(1/3)-1/2 × (106)1/6 =\n√\n3 × 10 ∼ 17.\nc. Use v747, from experience or from looking it up, to find vgodwit. Compare with the speed of\nthe record-setting bar-tailed godwit, which made its 11, 570 km journey in 8 days, 12 hours.\nA 747 flies at around 600 mph so the godwit should fly around 600/17 mph ∼ 35 mph. The\nspeed of record-setting godwit is\n11, 570 km\n0.6 mi\n1 day\n8.5 days × 1 km × 24 hours ∼ 35 mph.\nThat's absurdly close.\n4. Hovering and hummingbirds\nA simple model of hovering is that the animal or helicopter (mass M and wingspan L) forces\nair downward to stay aloft.\na. Estimate the downward air speed vdown needed to hover.\nThe reasoning is the same as for a forward-flying animal: It must deflect air downwards in\norder to recoil upwards and stay aloft. The hummingbird sweeps air downwards roughly over\nan area L2, so in a time t, it has swept a volume L2vdownt and a mass\nmair ∼ ρL2vdownt.\nTo get the right recoil, the momentum provided by gravity must be the momentum imparted\nto the air. Gravity provides a force Mg, so in time t it provides a momentum Mgt (since F =\nd(momentum)/dt). So mairvdown ∼ Mgt and\n\nSolution set 4 / 6.055J/2.038J: Art of approximation in science and engineering (Spring 2008)\nMgt\nMgt\nvdown ∼ mair\n∼ ρL2vdownt .\nBefore solving for vdown, note the difference between this analysis and the analysis for forward-\nflying animals. In that analysis (the one given in the notes), the similar formula has vforward in\nthe denominator on the right side rather than vdown.\nSolving for vdown gives\n\n!1/2\nMg\nvdown ∼ ρL2\n.\nb. Show that the power required to hover is\n(Mg)3/2\n.\nP ∼ ρ1/2L\nPower is force times velocity. The bird is generating a lift force Mg so that it can hover, and\nforcing air downward at speed vdown, so the power is\n\n!1/2\nMg\n(Mg)3/2\nP ∼ Mgvdown ∼ Mg\nρL2\n= ρ1/2L .\nc. Estimate P and vdown for a person hovering by flapping or waving his or her arms.\nI estimate vdown using a wingspan of L ∼ 2 m and a mass of M ∼ 70 kg:\n70 kg × 10 m s-2 !1/2\nvdown ∼ 1 kg m-3 × 4 m2\n∼ 14 m s-1 .\nThis value is probably an underestimate because it assumes that the person's arm motions fill\nthe whole area L2, whereas it might fill only one-fifth or even one-tenth of the whole area.\nBut leaving the estimate as is, the resulting power is\nP ∼ Mgvdown ∼ 70 kg × 10 m s-2 × 14 m s-1 ∼ 104 W.\nThat power is significantly greater than the 500 W endurance-power that we estimated for an\nathlete. People have no chance of hovering, at least not without using very large (and very\nlight!) wings.\nd. How does P depend on M for geometrically similar animals (same composition and shape\nbut varying size)? In other words, give the exponent β in\nP ∝ Mβ.\n\nSolution set 4 / 6.055J/2.038J: Art of approximation in science and engineering (Spring 2008)\nAgain L ∝ M1/3, so\n(Mg)3/2\nP ∼ ρ1/2L\nbecomes\nM3/2\nP ∝ M1/3 = M5/6 .\nSo the power increases slightly more slowly than the mass does.\ne. What fraction of its body weight does a hummingbird (M ∼ 3 g) eat every day in order to\nhover for a working day (8 hours)? Compare to the fraction for a person in a typical day.\n[Hummingbirds eat nectar, which is roughly equal parts sugar and water.]\nFor simplicity I assume that humans and hummingbirds are geometrically similar, so L ∝ M1/3;\nthen I use that proportionality to work out how the body-weight fraction scales with M.\nThe body-weight fraction is proportional to the hovering power per body mass P/M, which\nis proportional to M-1/6. So small animals need to eat a larger fraction of their body mass to\nhover than do large animals. The mass ratio between a hummingbird and a person is roughly\n2.5 104, or 106/40, so ratio of body-weight fractions is (106/40)-1/6 or 401/6/10. Since 401/6 is\n·\nroughly 2, the ratio is roughly 0.2.\nNow I compute the body-weight fraction for a hovering person starting from the power re\nquired to hover. In part (c) I computed that a hovering person requires roughly 104 W. Pretend\nthat humans also eat nectar. Sugar provides 4 kcal/ g of energy, but the conversion is about\n25% efficient, so about 1 kcal/ g of mechanical power. That's 4 MJ kg-1. Nectar is one-half as\nuseful, so it provides 2 MJ kg-1.\nOne day of hovering (8 hours) means eating (or drinking) this much nectar:\n104 W × 8 hours × 3600 s\n1 kg nectar ∼ 150 kg.\n1 hour ×\n2 106 J\n·\nSo a hovering person would eat roughly double their body weight in nectar, and a humming\nbird (using the estimated ratio of 0.2) would eat 2 × 0.2 ∼ 50% of their body weight in nectar!\nHummingbirds are hungry animals! And big hummingbirds would have a hard time hovering\nbecause the energy requirements are so large.\nIn a typical human day - definitely not spent hovering - we eat 2500 kcal or roughly 500 g of\ncarbohydrate. Most foods (e.g. plants, meat) are about 80 or 90% water, so we probably eat 5\nor 10 times 500 g in mass. I'll use a factor of 7 because the numbers turn out simple. A factor\nof 7 makes the total mass consumed in a day roughly 3.5 kg; that mass is 0.05 times a typical\nhuman mass.\n\nSolution set 4 / 6.055J/2.038J: Art of approximation in science and engineering (Spring 2008)\nOptional\n5. Inertia tensor\n[For those who know about inertia tensors.] Here is the inertia tensor (the generalization of mo\nment of inertia) of a particular object, calculated in a lousy coordinate system:\na. Change coordinate systems to a set of principal axes. In other words, write the inertia\ntensor as\nIxx\nIyy\nIzz\nand give Ixx, Iyy, and Izz. Hint: What properties of a matrix are invariant when changing\ncoordinate systems?\n\n⎟\n\n⎜\n\n⎟\n\n⎜\n\nWhatever coordinate change I make, I will leave the x axis alone because the Ixx component is\nalready separated from the y- and z submatrix. That submatrix is\n\nI have to figure out how changing the coordinate system changes this submatrix. Rather than\nfind the coordinate change explicitly, I use invariants to avoid that computation.\nOne invariant of any matrix, not just of this 2×2 matrix, is its determinant. Another invariant is\nits trace (the sum of the diagonal elements). In the nasty coordinate system, the trace of the y-\nand z submatrix is 5 + 5 = 10. So the trace is 10 in the nice coordinate system. The determinant\nis 5 × 5 - 4 × 4 = 9, so it the determinant is 9 in the nice coordinate system.\nThose facts are sufficient to deduce the submatrix in the nice coordinate system (without need\ning to figure out what the nice coordinate system is). In the nice coordinate system, the 2 × 2\nsubmatrix looks like\nIyy\nIzz\n\nSo I need to find Iyy and Izz such that\nIyy + Izz = 10\n(from the trace invariant)\nand\nIyyIzz = 9\n(from the determinant invariant)\nThe solution is Iyy = 1 and Izz = 9 (or vice versa). So the inertia tensor becomes\n\nSolution set 4 / 6.055J/2.038J: Art of approximation in science and engineering (Spring 2008)\nb. Give an example of an object with a similar inertia tensor. On Friday in class we'll have a\ndemonstration.\nThe object has three principal axes, each with a different moment of inertia. If the object is\nrectangular and uniform density, the three axes must have different lengths. Most books fit\ninto this category. They have a short axis that passes perpendicularly through the pages (this\naxis is the one with the highest moment of inertia). The medium-length axis is perpendicular\nto the spine. And the long axis is parallel to the spine.\n6. Resistive grid\nΩ\nIn an infinite grid of 1-ohm resistors, what is the resistance measured\nacross one resistor?\nTo measure resistance, an ohmmeter injects a current I at one terminal\n(for simplicity, say I = 1 A), removes the same current from the other\nterminal, and measures the resulting voltage difference V between\nthe terminals. The resistance is R = V/I.\nHint: Use symmetry. But it's still a hard problem!\nI'd like to find the current flowing through the resistor when 1 A is sent\ninto one terminal of the ohmmeter and removed from its other terminal.\nThe solution has two steps, each subtle:\n1. Break the resistance-measuring experiment into two parts, each having a lot of symmetry.\n2. Analyze those parts using symmetry.\nThe current distribution that results from the full resistance-measuring experiment is not suffi\nciently symmetric because it has a preferred direction along the selected resistor. However, if I\nbreak the experiment into two parts - inserting current and removing current - then each part\nproduces a symmetric current distribution.\nBy symmetry - because all four coordinate directions are equivalent -\ninserting 1 A produces 1/4 A flowing in each coordinate direction away\nfrom the terminal. Let's call this terminal the positive terminal. So in\nserting the 1 A at the positive terminal produces 1/4 A through the se\nlected resistor, and this current flows away from the positive terminal.\n\nSolution set 4 / 6.055J/2.038J: Art of approximation in science and engineering (Spring 2008)\nBy symmetry, removing 1 A produces 1/4 A in each coordinate direc\ntion, flowing toward the terminal. Let's call this terminal the negative\nterminal. So removing 1 A produces 1/4 A through the selected resistor,\nflowing toward the negative terminal. Equivalently, it produces 1/4 A\nflowing away from the positive terminal.\nNow superimpose the two pictures to reproduce the experiment of mea\nsuring the resistance. The experiment produces 1/2 A through the re\nsistor, flowing from the positive to the negative terminal. The voltage\nacross the resistor is the current times its resistance, so the voltage is\n1/2 V. Since a 1 A test current produces a 1/2 V drop, the effective resis\ntance is 1/2 Ω.\nIf you want an even more difficult problem: Find the resistance mea\nsured across a diagonal!"
    },
    {
      "category": "Resource",
      "title": "Homework 5",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-055j-the-art-of-approximation-in-science-and-engineering-spring-2008/84cb095bc7df21f98122a14a67a060df_hw05.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n6.055J / 2.038J The Art of Approximation in Science and Engineering\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nZ\n6.055J/2.038J (Spring 2008)\nHomework 5\nDo the following warmups and problems. Due in class on Friday, 18 April 2008.\nOpen universe: Collaboration, notes, and other sources of information are encouraged. However, avoid\nlooking up answers until you solve the problem (or have tried hard). That policy helps you learn the most\nfrom the problems.\nBring a photocopy to class on the due date, trade it for a solution set, and figure out or ask me about\nany confusing points. Your work will be graded lightly: P (made a reasonable effort), D (did not make a\nreasonable effort), or F (did not turn in).\nWarmups\n1. Counting dimensionless groups\nHow many independent dimensionless groups are there in the following sets of variables:\na. size of hydrogen including relativistic effects:\ne2/4πε0, ħ, c, a0 (Bohr radius), me (electron mass).\nb. period of a spring-mass system in a gravitational field:\nT (period), k (spring constant), m, x0 (amplitude), g.\nc. speed at which a free-falling object hits the ground:\nv, g, h (initial drop height).\nd. [tricky!] weight W of an object:\nW, g, m.\n2. Integrals by dimensions\nYou can use dimensions to do integrals. As an example, try this integral:\nI(β) =\ninf\ne-βx2 dx.\n-inf\nWhich choice has correct dimensions:\n(a.)\n√\nπβ-1\n(b.)\n√\nπβ-1/2\n(c.)\n√\nπβ1/2\n(d.)\n√\nπβ1\nHints:\n\n| {z }\nHomework 5 / 6.055J/2.038J: Art of approximation in science and engineering (Spring 2008)\n1. The dimensions of dx are the same as the dimensions of x.\n2. Pick interesting dimensions for x, such as length. (If x is dimensionless then you cannot\nuse dimensional analysis on the integral.)\nProblems\n3. How to avoid remembering lots of constants\nMany atomic problems, such as the size or binding energy of hydrogen, end up in expressions\nwith ħ, the electron mass me, and e2/4πε0, which is a nicer way to express the squared electron\ncharge. You can avoid having to remember those constants if instead you remember these\nvalues instead:\nħc ≈ 200 eV nm = 2000 eV A\nmec2 ∼ 0.5 106 eV\n·\ne2/4πε0\n(fine-structure constant).\nħc\n≡ α ≈ 137\nUse those values to evaluate the Bohr radius in angstroms (1 A = 0.1 nm):\nħ2\na0 =\n.\nme(e2/4πε0)\nAs an example calculation using the ħc value, here is the energy of a photon:\nc\nE = h f = 2πħ f = 2πħ ,\nλ\nwhere f is its frequency and λ is its wavelength. For green light, λ ∼ 600 nm, so\n2π\nħc\nz}|{\nz\n}|\n{\nE ∼\n× 200 eV nm ∼ 2 eV.\n600 nm\nλ\n4. Heavy nuclei\nIn lecture we analyzed hydrogen, which is one electron bound to one proton. In this problem\nyou study the innermost electron in an atom such as uranium that has many protons, and\nanalyze one physical consequence of its binding energy.\nSo, imagine a nucleus with Z protons around which orbits one electron. Let E(Z) be the binding\nenergy (the hydrogen energy is the case Z = 1).\na. Show that the ratio E(Z)/E(1) is Z2.\nb. In lecture, we derived that E(1) is the kinetic energy of an electron moving with speed αc\nwhere α is the fine-structure constant (roughly 10-2). How fast does the innermost electron\nmove around a heavy nucleus with charge Z?\n\nHomework 5 / 6.055J/2.038J: Art of approximation in science and engineering (Spring 2008)\nc. When that speed is comparable to the speed of light, the electron has a kinetic energy\ncomparable to its (relativistic) rest energy. One consequence of such a high kinetic energy\nis that the electron has enough kinetic energy to produce a positron (an anti-electron) out of\nnowhere ('pair creation'). That positron leaves the nucleus, turning a proton into a neutron\nas it exits. So the atomic number Z drops by one: The nucleus is unstable! Relativity sets\nan upper limit for Z.\nEstimate that maximum Z and compare it with the Z for the heaviest stable nucleus (ura\nnium).\n5. Power radiated by an accelerating charge\nElectromagnetism, where the usual derivations are so cumbersome, is an excellent area to ap\nply dimensional analysis. In this problem you work out the power radiated by an accelerating\ncharge, which is how radio stations work.\nSo, consider a particle with charge q, with position x, velocity v, and acceleration a. What\nvariables are relevant to the radiated power P? The position cannot matter because it depends\non the origin of the coordinate system, whereas the power radiated cannot depend on the\norigin. The velocity cannot matter because of relativity: You can transform to a reference frame\nwhere v = 0, but that change will not affect the radiation (otherwise you could distinguish\na moving frame from a non-moving frame, in violation of the principle of relativity). So the\nacceleration a is all that's left to determine the radiated power. [This line of argument is slightly\ndodgy, but it works for low speeds.]\na. Using P, q2/4πε0, and a, how many dimensionless quantities can you form?\nb. Fix the problem in the previous part by adding one quantity to the list of variables, and\ngive a physical reason for including the quantity.\nc. With the new list, use dimensionless groups to find the power radiated by an accelerating\npoint charge. In case you are curious, the exact result contains a dimensionless factor of\n2/3; dimensional analysis triumphs again!\n6. Yield from an atomic bomb\nGeoffrey Taylor, a famous Cambridge fluid mechanic, annoyed the US government by doing\nthe following analysis. The question he answered: 'What was the yield (in kilotons of TNT) of\nthe first atomic blast (in the New Mexico desert in 1945)?' Declassified pictures, which even\nhad a scale bar, gave the following data on the radius of the explosion at various times:\nt (ms)\nR (m)\n3.26\n59.0\n4.61\n67.3\n15.0\n106.5\n62.0\n185.0\n\nHomework 5 / 6.055J/2.038J: Art of approximation in science and engineering (Spring 2008)\na. Use dimensional analysis to work out the relation between radius R, time t, blast energy E,\nand air density ρ.\nb. Use the data in the table to estimate the blast energy E (in Joules).\nc. Convert that energy to kilotons of TNT. One gram of TNT releases 1 kcal or roughly 4 kJ.\nThe actual value was 20 kilotons, a classified number when Taylor published his result ['The\nFormation of a Blast Wave by a Very Intense Explosion. II. The Atomic Explosion of 1945.',\nProceedings of the Royal Society of London. Series A, Mathematical and Physical 201(1065): 175-186\n(22 March 1950)]\n7. Your turn to create\nInvent - but you do not need to solve! - an estimation question for which dimensional analysis\nwould help solve it.\nOptional\n8. Atomic blast: A physical interpretation\nUse energy densities and sound speeds to make a rough physical explanation of the result in\nthe 'yield from an atomic bomb' problem."
    },
    {
      "category": "Resource",
      "title": "Solution Set 5",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-055j-the-art-of-approximation-in-science-and-engineering-spring-2008/47bdf3bb80f8f2fd080e3952a9cace43_sol05.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n6.055J / 2.038J The Art of Approximation in Science and Engineering\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\n6.055J/2.038J (Spring 2008)\nSolution set 5\nDo the following warmups and problems. Due in class on Friday, 18 April 2008.\nOpen universe: Collaboration, notes, and other sources of information are encouraged. However, avoid\nlooking up answers until you solve the problem (or have tried hard). That policy helps you learn the most\nfrom the problems.\nBring a photocopy to class on the due date, trade it for a solution set, and figure out or ask me about\nany confusing points. Your work will be graded lightly: P (made a reasonable effort), D (did not make a\nreasonable effort), or F (did not turn in).\nWarmups\n1. Counting dimensionless groups\nHow many independent dimensionless groups are there in the following sets of variables:\na. size of hydrogen including relativistic effects:\ne2/4πε0, ħ, c, a0 (Bohr radius), me (electron mass).\nAccording to the Buckingham Pi theorem, five quantities composed of three independent di\nmensions make two independent dimensionless groups.\nThe question did not ask you to choose the dimensionless groups. But it is useful to see what\nthey could be. The following pair is a reasonable choice for the two groups:\nħ2\ne2/4πε0\nΠ1 ≡ mea0(e2/4πε0)\nand Π2 ≡\nħc\n.\nThe groups are often called Π variables, following a tradition started by Buckingham, author\nof the Buckingham Pi theorem.\nIn the preceding choice of groups, the second group Π2 is the fine-structure constant α.\nb. period of a spring-mass system in a gravitational field:\nT (period), k (spring constant), m, x0 (amplitude), g.\nFive quantities composed of three independent dimensions make two independent dimension\nless groups. Here is a reasonable combination:\nkT2\nkx0\nΠ1 ≡ m\nand Π2 ≡ mg .\nIt turns out that the second group Π2 does not affect the period T. However, dimensional\nanalysis does not tell you that result; it has to be derived by physical thinking.\n\nZ\nSolution set 5 / 6.055J/2.038J: Art of approximation in science and engineering (Spring 2008)\nc. speed at which a free-falling object hits the ground:\nv, g, h (initial drop height).\nThree quantities composed of two dimensions (length and time) produce one independent\ndimensionless group. A reasonable choice is\nv .\nΠ1 ≡ gh\nThat ratio - except for a factor of 2 - has a physical interpretation as the ratio of kinetic energy\non impact to the potential energy at the start.\nd. [tricky!] weight W of an object:\nW, g, m.\nThese three quantities are composed of three dimensions (mass, length, and time), so there\nshould be zero dimensionless groups! However, there is at least one group: W/mg is dimen\nsionless.\nWhat went wrong is that the three quantities are composed of two independent dimensions:\nmass M and acceleration LT-2. So the Buckingham Pi theorem predicts one independent di\nmensionless group. A reasonable choice for it is W/mg.\n2. Integrals by dimensions\nYou can use dimensions to do integrals. As an example, try this integral:\nI(β) =\ninf\ne-βx dx.\n-inf\nWhich choice has correct dimensions:\n(a.)\n√\nπβ-1\n(b.)\n√\nπβ-1/2\n(c.)\n√\nπβ1/2\n(d.)\n√\nπβ1\nHints:\n1. The dimensions of dx are the same as the dimensions of x.\n2. Pick interesting dimensions for x, such as length. (If x is dimensionless then you cannot\nuse dimensional analysis on the integral.)\nAn exponent, for example -βx2, the question, 'How many times do I multiply the base by itself?'\nHere the base is e, but the principle applies to any exponent.\nPretend that x is a length. The dimensions of dx are the same as the dimensions of x, so dx is also\na length. The exponential is dimensionless since it's the product, -βx2 times, of the dimensionless\nnumber e. So the integral, which is the sum of little lengths (from the dx), is also a length.\nNow determine which choice has dimensions of length. Since x is a length, β = L-2 in order that\nβx2 be dimensionless. So β-1/2 is a length; any other power is something else.\n\n| {z }\nSolution set 5 / 6.055J/2.038J: Art of approximation in science and engineering (Spring 2008)\nThe only reasonable choice is √πβ-1/2. I might have been unkind by giving you a choice with the\nwrong dimensionless constant alongside the correct power of β. But not this time: The factor of\n√π is correct.\nProblems\n3. How to avoid remembering lots of constants\nMany atomic problems, such as the size or binding energy of hydrogen, end up in expressions\nwith ħ, the electron mass me, and e2/4πε0, which is a nicer way to express the squared electron\ncharge. You can avoid having to remember those constants if instead you remember these\nvalues instead:\nħc ≈ 200 eV nm = 2000 eV A\nmec2 ∼ 0.5 106 eV\n·\ne2/4πε0\n(fine-structure constant).\nħc\n≡ α ≈ 137\nUse those values to evaluate the Bohr radius in angstroms (1 A = 0.1 nm):\nħ2\na0 =\n.\nme(e2/4πε0)\nAs an example calculation using the ħc value, here is the energy of a photon:\nc\nE = h f = 2πħ f = 2πħ ,\nλ\nwhere f is its frequency and λ is its wavelength. For green light, λ ∼ 600 nm, so\n2π\nħc\nz}|{\nz\n}|\n{\n200 eV nm\n×\n∼ 2 eV.\nE ∼\n600 nm\nλ\nLooking at the Bohr radius\nħ2\na0 =\n,\nme(e2/4πε0)\nI see two powers of ħ just asking to be joined with two powers of c to make (ħc)2. To add two\npowers of c without changing the fraction, multiply the denominator by c2 as well. The electron\nmass me is happy to join with two powers of c to make mec2, the rest energy of the electron.\nTherefore,\nħ2c2\na0 =\n,\nmec2(e2/4πε0)\nNow use\ne2/4πε0\nα =\nħc\n\n| {z }\nSolution set 5 / 6.055J/2.038J: Art of approximation in science and engineering (Spring 2008)\nto simplify even more:\nħc\nħc\n= α-1 ħc\na0 =\n.\nmec2 e2/4πε0\nmec2\nα-1\nThe pieces of this form are easy to remember:\n2000 eVA\na0 = α-1\nm\nħ\ne\nc\nc2 ∼ 102 × 0.5 106 eV ∼ 0.5A.\n·\n4. Heavy nuclei\nIn lecture we analyzed hydrogen, which is one electron bound to one proton. In this problem\nyou study the innermost electron in an atom such as uranium that has many protons, and\nanalyze one physical consequence of its binding energy.\nSo, imagine a nucleus with Z protons around which orbits one electron. Let E(Z) be the binding\nenergy (the hydrogen energy is the case Z = 1).\na. Show that the ratio E(Z)/E(1) is Z2.\nWith Z protons pulling on one electron, the electrostatic energy is Ze2/4πε0. So instead of\nusing e2/4πε0 as one of the quantities, the dimensional analysis should use Ze2/4πε0. The\nother quantities are unchanged. The Z propagates along with the e2 through the calculation of\nthe radius aZ and the energy E(Z).\nSince the radius a0 has one factor of e2 in the denominator, the aZ picks up a factor of Z in the\ndenominator relative to a0:\na0\naZ =\n.\nZ\nSince the energy E0 has a factor of e4 in the numerator, the energy E(Z) picks up a factor of Z2:\nE(Z) = E(1) × Z2 .\nb. In lecture, we derived that E(1) is the kinetic energy of an electron moving with speed αc\nwhere α is the fine-structure constant (roughly 10-2). How fast does the innermost electron\nmove around a heavy nucleus with charge Z?\nTo increase the energy of the electron by a factor of Z2, the speed must increase by a factor of\nZ. So the innermost electron moves with speed Zαc.\nc. When that speed is comparable to the speed of light, the electron has a kinetic energy\ncomparable to its (relativistic) rest energy. One consequence of such a high kinetic energy\nis that the electron has enough kinetic energy to produce a positron (an anti-electron) out of\nnowhere ('pair creation'). That positron leaves the nucleus, turning a proton into a neutron\nas it exits. So the atomic number Z drops by one: The nucleus is unstable! Relativity sets\nan upper limit for Z.\n\nSolution set 5 / 6.055J/2.038J: Art of approximation in science and engineering (Spring 2008)\nEstimate that maximum Z and compare it with the Z for the heaviest stable nucleus (ura\nnium).\nWhen Zαc ∼ c, the electron becomes significantly relativistic and permits pair creation to desta\nbilize the nucleus. So the maximum Z is roughly α-1 or about 137.\nThe heaviest stable nucleus is uranium with Z = 92, so the estimate is not too bad.\n5. Power radiated by an accelerating charge\nElectromagnetism, where the usual derivations are so cumbersome, is an excellent area to ap\nply dimensional analysis. In this problem you work out the power radiated by an accelerating\ncharge, which is how radio stations work.\nSo, consider a particle with charge q, with position x, velocity v, and acceleration a. What\nvariables are relevant to the radiated power P? The position cannot matter because it depends\non the origin of the coordinate system, whereas the power radiated cannot depend on the\norigin. The velocity cannot matter because of relativity: You can transform to a reference frame\nwhere v = 0, but that change will not affect the radiation (otherwise you could distinguish\na moving frame from a non-moving frame, in violation of the principle of relativity). So the\nacceleration a is all that's left to determine the radiated power. [This line of argument is slightly\ndodgy, but it works for low speeds.]\na. Using P, q2/4πε0, and a, how many dimensionless quantities can you form?\nZero! There are three quantities and three independent dimensions, so the Buckingham Pi\ntheorem says there will be no dimensionless groups.\nb. Fix the problem in the previous part by adding one quantity to the list of variables, and\ngive a physical reason for including the quantity.\nRadiation travels at the speed of light. Furthermore, radiation is a relativistic phenomenon.\nRelativity means that magnetic fields are electric fields seen from a moving reference frame.\nAnd radiation is an alternation of electric and magnetic fields, like a cat chasing its tail, so\nradiation needs relativity. And relativity needs the speed of light.\nTherefore, I should add c to the list of variables.\nc. With the new list, use dimensionless groups to find the power radiated by an accelerating\npoint charge. In case you are curious, the exact result contains a dimensionless factor of\n2/3; dimensional analysis triumphs again!\nFour quantities composed of three dimensions produce one independent group. The dimen\nsions of power P are ML2T-3. The dimensions of q2/4πε0 are energy times distance, which is\nML3T-2. The dimensions of acceleration a are LT-2. And the dimensions of c are LT-1.\n\nSolution set 5 / 6.055J/2.038J: Art of approximation in science and engineering (Spring 2008)\nIn order to cancel the mass dimensions, a dimensionless combination will contain P/(q2/4πε0),\nwhich has dimensions of L-1T-1. The only way to make those dimensions from a and c is a2/c3.\nSo a dimensionless group is\nP/(q2/4πε0)\nPc3\n=\n.\nΠ1 ≡\na2/c3\na2(q2/4πε0)\nThe radiated power P must therefore be\na2q2/4πε0 .\nP ∼\nc3\nThis result explains why radiation (radio waves, light, etc.) is such a good way to transmit\ninformation for a long distance. To see how, I'll use the power to estimate the electric field at a\ndistance r from the accelerating (and radiating) charge.\nThe power P is the same no matter how far away one is from the charge because all the radiated\nenergy escapes to infinity. Pretend that the angular distribution of the power is isotropic. Then\nthe radiated power per area at a distance r is\nP\nP\nr2 .\nP ∼ area of sphere with radius r ∼\nThe power per area is also known as the energy flux, which is energy per area per time. Energy\nflux is the propagation speed times the energy per volume (the energy density) E in the electric\nfield:\nP ∝ cE.\nHard to believe? Check the dimensions!\nThe energy density in the electric field is proportional to the square of the field E:\n.\nE ∝ E2\nThis relation is analogous to the relation that the energy in a spring is proportional to the square\nof the amplitude.\nPut these relations together to find the relation between energy flux and electric field:\n.\nP ∝ cE2\nSince P ∼ P/r2:\nE ∝ r-1 .\nCompare this distance dependence with the similar result for electrostatics: There the electric\nfield is proportional to r-2. So, by accelerating a charge, we make an electric field that falls off\nmuch more slowly than it would from just electrostatics. The importance of that change grows\nas r grows. For large r - from radio stations and, especially, from stars - radiation is the only\nway to get a message to us. What a difference that change in the exponent makes!\n\nSolution set 5 / 6.055J/2.038J: Art of approximation in science and engineering (Spring 2008)\n6. Yield from an atomic bomb\nGeoffrey Taylor, a famous Cambridge fluid mechanic, annoyed the US government by doing\nthe following analysis. The question he answered: 'What was the yield (in kilotons of TNT) of\nthe first atomic blast (in the New Mexico desert in 1945)?' Declassified pictures, which even\nhad a scale bar, gave the following data on the radius of the explosion at various times:\nt (ms)\nR (m)\n3.26\n59.0\n4.61\n67.3\n15.0\n106.5\n62.0\n185.0\na. Use dimensional analysis to work out the relation between radius R, time t, blast energy E,\nand air density ρ.\nFour quantities composed of three independent dimensions make one independent dimen\nsionless group. The only quantities whose dimensions contain mass are E and ρ. So E and\nρ appear in the group as E/ρ, whose dimensions are L5T-2. Therefore the following choice is\ndimensionless:\nEt2\n.\nΠ1 ≡ ρR5\nb. Use the data in the table to estimate the blast energy E (in Joules).\nWith only one dimensionless group, the most general statement connecting those four quanti\nties is\nEt2\nρR5 ∼ 1.\nor\nρR5\nE ∼ t2 .\nFor each row of data in the table, I'll estimate ρR5/t2, using ρ ∼ 1 kg m-3:\nt (ms)\nR (m)\nE (1013 J)\n3.26\n59.0\n6.7\n4.61\n67.3\n6.5\n15.0\n106.5\n6.1\n62.0\n185.0\n5.6\nThe data are not perfectly consistent about the predicted blast energy E, but they hover pretty\nclosely around 6 1013 J.\n·\n\nr\ns\ns\nSolution set 5 / 6.055J/2.038J: Art of approximation in science and engineering (Spring 2008)\nc.\nConvert that energy to kilotons of TNT. One gram of TNT releases 1 kcal or roughly 4 kJ.\nOne kiloton of TNT is\n109 g\n4 103 J\n1012 J.\n1 kiloton × 1 kiloton × 1\n· g ∼ 4·\nThe predicted yield of 6 1013 J is roughly 15 kiltons, in close agreement with the classified value\n·\nof 20 kiltons.\nIf I'd used the more accurate density ρ ∼ 1.3 kg m-3, then I'd have found E ∼ 19.5 kilotons, a\nresult that is far too accurate for the number of approximations contained in it!\nThe actual value was 20 kilotons, a classified number when Taylor published his result ['The\nFormation of a Blast Wave by a Very Intense Explosion. II. The Atomic Explosion of 1945.',\nProceedings of the Royal Society of London. Series A, Mathematical and Physical 201(1065): 175-186\n(22 March 1950)]\n7. Your turn to create\nInvent - but you do not need to solve! - an estimation question for which dimensional analysis\nwould help solve it.\nOptional\n8. Atomic blast: A physical interpretation\nUse energy densities and sound speeds to make a rough physical explanation of the result in\nthe 'yield from an atomic bomb' problem.\nI'll use the blast energy E, the radius R, and the air density ρ to estimate out how fast the fireball\nexpands when it has radius R.\nFor a simple model, imagine that the fireball expands as fast as the speed of sound. Of course, the\nspeed of sound is much higher in the fireball than in normal air, because the fireball has a huge\npressure due to the blast.\nThe energy density E in the fireball is the blast energy E divided by the volume of the fireball, so\nE ∼ E/R3. The energy density is the pressure, give or take a dimensionless constant. Sound speed\ndepends on pressure and density (check the dimensions):\npressure .\ncs ∼\ndensity\nSo the sound speed, which is the rate at which the fireball expands, is\nE .\ncs ∼\nρR3\nNext assume that the expansion speed is constant, even though it falls as fireball grows. Then the\nradius is R ∼ tcs. So\nE\nR ∼ t\nρR3 ,\n\nSolution set 5 / 6.055J/2.038J: Art of approximation in science and engineering (Spring 2008)\nor\nρR5\nE ∼ t2 ,\nas derived using dimensions."
    },
    {
      "category": "Resource",
      "title": "Approximating Logarithms Using Musical Intervals",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-055j-the-art-of-approximation-in-science-and-engineering-spring-2008/0c8fb911d00bc6c96a598f7a113e0f47_singing_logs.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n6.055J / 2.038J The Art of Approximation in Science and Engineering\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nApproximating logarithms using musical intervals\nKEY\nSemitones\nInterval\nRatio\nExact Value\nM2\n9/8\n1.122\nSymbol\nInterval\nNotes\nm3\n6/5\n1.1885\nM2\nMajor 2nd\nC-D\nM3\n5/4\n1.259\nm3\nMinor 3rd\nC-E[\nP4\nd5\n4/3\n√\n1.3335\n1.4125\nM3\nP4\nd5\nMajor 3rd\nPerfect 4th\nDiminished 5th\nC-E\nC-F\nC-G[\nP5\n3/2\n1.496\nP5\nPerfect 5th\nC-G\nm6 = P8 - M3\n8/5\n1.585\nm6\nMinor 6th\nC-A[\nM6 = P8 - m3\n5/3\n1.679\nM6\nMajor 6th\nC-A\nP5 + m3\n9/5\n1.7783\n2 · P4\n16/9\n1.7783\n17/9\n1.8836\nP8\n1.9953\n17.4\ne\n2.718\nP8 + P5\n2.9854\n2 · P8\n3.981\n2 · P8 + M3\n5.012\n2 · P8 + P5\n5.9566\n3 · P8 - M2\n9 ≈ 7\n7.080\n3 · P8\n7.943\n2 · (P8 + P5)\n8.913\n3 · P8 + M3\n10.\nThe starting point is 210 ≈ 103, or 21/12 ≈ 101/40. By chance 21/12 is the semitone frequency ratio on the\nequal-tempered scale. Since we know what Pythagorean ratios the equal-tempered intervals are supposed to\napproximate, we can approximate logarithms to the base 21/12, and thereby approximate logarithms to the\nbase 101/40, which gives us twice the number of decibels. The ratio column indicates the ratios for perfect\nPythagorean intervals, and the exact value column shows 10semitones/40, to show the accuracy of the method.\nNote that 10 semitones has two possible breakdowns into intervals, as P5 + m3 or 2 P4. The second is much\n·\nmore accurate, because in the equal-tempered scale, the perfect intervals come out almost exactly right, at\nthe cost of some error in the major and minor intervals.\nTo use the table to compute log10 x, find x as a product of ratios, add the number of semitones for the\nratios, and divide by 40 (divide by 2 to get dB). To calculate 10x, multiply x by 40, find that value in the\nsemitones column, and read off the corresponding ratio. From a few basic Pythagorean ratios and number\nof semitones, most of the table is easy to figure out. The most important to remember one is the fifth:\n7 semitones corresponds to 3/2. For example, from the fifth we can compute the frequency ratio for a fourth\n(5 semitones). The two intervals together make an octave, so the product of their frequency ratios is 2. This\nmeans 5 semitones corresponds to 4/3. Many other entries can be worked out similarly.\nSome examples (arrows point from the real to the log world):\n1 octave = 12 semitones = 6 dB = 0.3 decades.\n→\n10 P4 = 50 semitones = 40 semitones + 2 P4\n= 17.78 (exact 17.76).\n→\n·\n·\n←\n· 9\n5 =\n2 2\nM3 + 2 P8 = 28 semitones =\nor 0.7 decades (14 dB).\n4 ·\n·\n→\n·\n310 → 10 · (P8 + P5) = 190 semitones = 200 - 2 · P4 ← 10200/40 · 16 = 56250 (exact 59049).\ne 10\n10 17.4 semitones = 174 semitones = 160 + 12 + 2 semitones\n104 2\n= 22500.\n→\n·\n←\n·\n· 8\n(This method is due to the statistician I. J. Good, who credits his father.)\n6.055: Art of Approximation in Science and Engineering\n/\nSanjoy Mahajan"
    },
    {
      "category": "Resource",
      "title": "Back-of-the-envelope Numbers",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-055j-the-art-of-approximation-in-science-and-engineering-spring-2008/d70f08f617960f2ff4060e9e93b91283_constants.pdf",
      "content": "Back-of-the-envelope numbers\nSymbol\nWhat\nValue\nUnits\nπ\npi\nG\nNewton's constant\n7 · 10-11 kg-1 m3 s-1\nc\nspeed of light\n3 · 108\nm s-1\nkB\nBoltzmann's constant\n10-4 eV K-1\ne\nelectron charge\n1.6 · 10-19 C\nσ\nStefan-Boltzmann constant\n6 · 10-8 W m-2 K-4\nmsun\nSolar mass\n2 · 1030\nkg\nRearth\nEarth radius\n6 · 106\nm\nθmoon/sun\nangular diameter\n10-2\nρair\nair density\nkg m-3\nρrock\nrock density\ng cm-3\nħc\neV nm\nLwater\nvap\nheat of vaporization\nMJ kg-1\nγwater\nsurface tension of water\n10-1 N m-1\na0\nBohr radius\n0.5\nA\na\ntypical interatomic spacing\nA\nNA\nAvogadro's number\n6 · 1023\nEfat\nEbond\ncombustion energy density\ntypical bond energy\nkcal g-1\neV\ne2/4πε0\nħc\nfine-structure constant α\n10-2\np0\nair pressure\nPa\nνair\nkinematic viscosity of air\n1.5 · 10-5 m2 s-1\nνwater\nkinematic viscosity of water\n10-6 m2 s-1\nday\ns\nyear\nπ · 107\ns\nF\nsolar constant\n1.3\nkW m-2\nAU\ndistance to sun\n1.5 · 1011\nm\nPbasal\nhuman basal metabolic rate\nW\nKair\nthermal conductivity of air\n2 · 10-2 W m-1 K-1\nK\n. . . of non-metallic solids/liquids\nW m-1 K-1\nKmetal\n. . . of metals\nW m-1 K-1\ncair\np\nspecific heat of air\nJ g-1 K-1\ncp\n. . . of solids/liquids\nJ mole-1 K-1"
    },
    {
      "category": "Resource",
      "title": "Bending of Light",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-055j-the-art-of-approximation-in-science-and-engineering-spring-2008/293ae4904ca7e19c8f0a38d759938cc3_apr09.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n6.055J / 2.038J The Art of Approximation in Science and Engineering\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\n7 Dimensions\nAn error of 15 percent is often small compared to the other inaccuracies in an approximate\ncomputation, so this method of approximate minimization is a valuable time-saver.\nNow return to the original problem: determining the Bohr radius. The approximate min\nimization predicts the correct value. Even if the method were not so charmed, there is no\npoint in doing a proper, calculus minimization. The calculus method is too accurate given\nthe inaccuracies in the rest of the derivation.\nEngineers understand this idea of not over-engineering a system. If a bicycle most often\nbreaks at welds in the frame, there is little point replacing the metal between the welds\nwith expensive, high-strength aerospace materials. The new materials might last 100 years\ninstead of 50 years, but such a replacement would be overengineering. To improve a bicy\ncle, put effort into improving or doing without the welds.\nIn estimating the Bohr radius, the kinetic-energy estimate uses a crude form of the uncer\ntainty principle, ∆p∆x ∼ ħ, whereas the true statement is that ∆p∆x ≥ ħ/2. The estimate\nalso uses the approximation EKinetic ∼ (∆p)2/m. This approximation contains m instead of\n2m in the denominator. It also assumes that ∆p can be converted into an energy as though\nit were a true momentum rather than merely a crude estimate for the root-mean-square\nmomentum. The potential- and kinetic-energy estimates use a crude definition of position\nuncertainty ∆x: that ∆x ∼ r. After making so many approximations, it is pointless to mini\nmize the result using the elephant gun of differential calculus. The approximate method is\nas accurate as, or perhaps more accurate than the approximations in the energy.\nThis method of equating competing terms is balancing. We balanced the kinetic energy\nagainst the potential energy by assuming that they are roughly the same size. The conse\nquence is that\nħ2\n.\na0 ∼ me(e2/4πε0)\nNature could have been unkind: The potential and kinetic energies could have differed by\na factor of 10 or 100. But Nature is kind: The two energies are roughly equal, except for a\nconstant that is nearly 1. 'Nearly 1' is also called of order unity. This rough equality occurs\nin many examples, and you often get a reasonable answer by pretending that two energies\n(or two quantities with the same units) are equal. When the quantities are potential and\nkinetic energy, as they often are, you get extra safety: The so-called virial theorem protects\nyou against large errors (for more on the virial theorem, see any intermediate textbook on\nclassical dynamics).\n7.5 Bending of light by gravity\nRocks, birds, and people feel the effect of gravity. So why not light? The analysis of that\nquestion is a triumph of Einstein's theory of general relativity. I can calculate how gravity\nbends light by solving the so-called geodesic equations from general relativity:\nd2xβ\nβ dxμ dxν\ndλ2 + Γ μν dλ dλ = 0.\n\n6.055 / Art of approximation\nTo compute the Christoffel symbols Γμν\nβ requires solving for the metric tensor gμν, which\nrequires solving the curvature equations Rμν = 0.\nThe curvature equations are a shorthand for ten partial-differential equations. The equa\ntions are rich in mathematical interest but are a nightmare to solve. The equations are nu\nmerous - that's one problem - but worse, they are not linear. So the standard trick, which\nis to guess a type of solution and form new solutions by combining the basic types, does\nnot work. You can spend a decade learning advanced mathematics to solve the equations\nexactly. Or you can accept the great principle of analysis: When the going gets tough, lower\nyour standards. If I sacrifice accuracy, I can explain light bending in less than one thousand\npages using mathematics and physics that you (and I!) already know.\nThe simpler method is dimensional analysis, in the usual three steps:\n1. Find the relevant parameters.\n2. Find dimensionless groups.\n3. Use the groups to make the most general dimensionless statement.\n4. Add physical knowledge to narrow the possibilities.\nThe following sections do each step.\n7.5.1 Finding parameters\nThe first step in a dimensional analysis is to decide what physical parameters the bending\n1. The list has to include the quantity to solve for. So the angle θ is the first item in the list.\n2. The mass of the sun, m, has to affect the angle. Black holes greatly deflect light, probably\nbecause of their huge mass.\n3. A faraway sun or black hole cannot strongly affect the path (near the earth light seems\nto travel straight, in spite of black holes all over the universe); therefore r, the distance\nfrom the center of the mass, is a relevant parameter. The phrase 'distance from the\ncenter' is ambiguous, since the light is at various distances from the center. Let r be the\ndistance of closest approach.\n4. The dimensional analysis needs to know that gravity produces the bending. The para\nmeters listed so far do not create any forces. So include Newton's gravitational constant\nG.\nHere is the same diagram with important parameters labeled:\nangle can depend on. An unlabeled diagram prods me into thinking of labels, many of\nwhich are parameters of the problem:\nsun\nHere are reasons to include various parameters:\n\n7 Dimensions\nsun\nmass m\nθ\nr\nHere is a table of the parameters and their dimensions:\nParameter Meaning\nDimensions\nθ\nangle\n-\nm\nmass of sun\nM\nG\nNewton's constant\nL3T-2M-1\nr\ndistance from center of sun\nL\nwhere, as you might suspect, L, M, and T represent the dimensions of length, mass, and\ntime, respectively.\n7.5.2 Dimensionless groups\nWhat are the dimensionless groups? The parameter θ is an angle, which is already dimen\nsionless. The other variables, G, m, and r, cannot form a second dimensionless group. To\nsee why, following the dimensions of mass. It appears only in G and m, so a dimensionless\ngroup would contain the product Gm, which has no mass dimensions in it. But Gm and\nr cannot get rid of the time dimensions. So there is only one independent dimensionless\ngroup, for which θ is the simplest choice.\nI want a second dimensionless group because otherwise my analysis seems like nonsense.\nAny physical solution can be written in dimensionless form; this idea is the foundation\nof dimensional analysis. With only one dimensionless group, θ, I have to conclude that θ\ndepends on no variables at all:\nθ = function of other dimensionless groups,\nbut there are no other dimensionless groups, so\nθ = constant.\nThis conclusion is crazy! The angle must depend on at least one of m and r. My physical\npicture might be confused, but it's not so confused that neither variable is relevant. So I\nneed to make another dimensionless group on which θ can depend. Therefore, I return to\nStep 1: Finding parameters.\nThe list so far lacks a crucial parameter.\nWhat physics have I neglected? Free associating often suggests the missing parameter.\nUnlike rocks, light is difficult to deflect, otherwise humanity would not have waited until\n\n6.055 / Art of approximation\nthe 1800s to study the deflection, whereas the path of rocks was studied at least as far back\nas Aristotle and probably for millions of years beforehand. Light travels much faster than\nrocks, which may explain why light is so difficult to deflect: The gravitational field 'gets\nhold of it' only for a short time. But none of my parameters distinguish between light\nand rocks. Therefore I should include c, the speed of light. It introduces the fact that I'm\nstudying light, and it does so with a useful distinguishing parameter, the speed.\nHere is the latest table of parameters and dimensions:\nParameter Meaning\nDimensions\nθ\nangle\n-\nm\nmass of sun\nM\nG\nNewton's constant\nL3T-2M-1\nr\ndistance from center of sun\nL\nc\nspeed of light\nLT-1\nLength is strewn all over the parameters (it's in G, r, and c). Mass, however, appears in only\nG and m, so I already know I need a combination such as Gm to cancel out mass. Time also\nappears in only two parameters: G and c. To cancel out time, I need to form Gm/c2. This\ncombination has one length in it, so a dimensionless group is Gm/rc2.\n7.5.3 Drawing conclusions\nThe most general relation between the two dimensionless groups is\nGm\nθ = f\n.\nrc2\nDimensional analysis cannot tell me the correct function f.\nPhysical reasoning and symmetry narrow the possibilities. First, strong gravity - from a\nlarge G or m - should increase the angle. So f should be an increasing function. Now try\nsymmetry: Imagine a world where gravity is repulsive or, equivalently, the gravitational\nconstant is negative. Then the angle should also be negative, so f should be an odd func\ntion. This symmetry argument eliminates choices like f(Gm/rc2) ∼ (Gm/rc2)2.\nThe simplest guess is that f is the identity function. Then the bending angle is\nGm\nθ = rc2 .\nThere is likely a dimensionless constant in f:\nGm\nθ = 7 rc2\nor\nGm\nθ = 0.3 rc2\nare also possible. This freedom means\n\n7 Dimensions\nGm\nθ ∼ rc2 .\n7.5.4 Comparison with exact calculations\nDifferent theories of gravity give the same result\nGm\nθ ∼ rc2 ;\nthe only variation is in the value for the missing dimensionless constant. Here are those\nvalues from exact calculation:\nGm\nθ = rc2 ×\n⎪ ⎪\n1 (simplest guess);\n2 (Newtonian gravity);\n4 (Einstein's theory).\nHere is a rough explanation of the origin of those constants. The 1 for the simplest guess\nis just that. The 2 for Newtonian gravity is from integrating angular factors like cosine and\nsine that determine the position of the photon as it moves toward and past the sun.\nThe most interesting constant is the 4 for general relativity, which is twice the Newtonian\nvalue because light moves at the speed of light. The extra bending is a consequence of Ein\nstein's theory of special relativity putting space and time on the same level. The theory of\ngeneral relativity then formulates gravity in terms of the curvature of spacetime. Newton's\ntheory is the limit of general relativity that considers only time curvature; general relativ\nity itself also calculates the space curvature. Since most objects move much slower than the\nspeed of light, meaning that they travel much farther in time than in space, they feel mostly\nthe time curvature. The Newtonian analysis is fine for those objects. Since light moves at\nthe speed of light, it sees equal amounts of space and time curvature, so it bends twice as\nfar as the Newtonian theory would predict.\n7.5.5 Numbers!\nAt the surface of the Earth, the strength is\nGm\n6.7 10-11 m3 s-2 kg-1 × 6.0 1024 kg\nrc2 ∼ 6.4 106\n·\nm × 3.0 108 m s-1 × 3.0\n·\n108 m s-1 ∼ 10-9 .\n·\n·\n·\nThis miniscule value is the bending angle (in radians). So if physicists want to show that\nlight bends, they had better look beyond the earth! That statement is based on another\npiece of dimensional analysis and physical reasoning, whose result I quote without proof:\nA telescope with mirror of diameter d can resolve angles roughly as small as λ/d, where\nλ is the wavelength of light. One way to measure the bending of light is to measure the\nchange in position of the stars. A lens that could resolve an angle of 10-9 has a diameter of\nat least\nd ∼ λ/θ ∼ 0.5 ·\n-\n-\n6 m ∼ 500 m.\n\n6.055 / Art of approximation\nLarge lenses warp and crack; one of the largest lenses made is 6 m. So there is no chance of\ndetecting an angle of 10-9.\nPhysicists therefore searched for another source of light bending. In the solar system, the\nlargest mass is the sun. At the surface of the sun, the field strength is\nGm\n6.7 · 10-11 m3 s-2 kg-1 × 2.0 · 1030 kg\n10-6 ≈ 0.4′′.\nrc2 ∼ 7.0 108 m × 3.0 108 m s-1 × 3.0 108 m s-1 ∼ 2.1 ·\n·\n·\n·\nThis angle, though small, is possible to detect: The required lens diameter is roughly\nd ∼ λ/θ ∼ 0.5 · 10-6 m ∼ 20 cm.\n2.1 10-6\n·\nThe eclipse expedition of 1919, led by Arthur Eddington of Cambridge, tried to measure\nexactly this effect.\nFor many years Einstein believed that his theory of gravity would predict the Newton\nian value, which turns out to be 0.87 arcseconds for light just grazing the surface of the\nsun. The German mathematician, Soldner, derived the same result in 1803. Fortunately\nfor Einstein's reputation, the eclipse expeditions that went to test his (and Soldner's) pre\ndiction got rained or clouded out. By the time an expedition got lucky with the weather\n(Eddington's in 1919), Einstein had invented a new theory of gravity, which predicted 1.75\narcseconds. The goal of Eddington's expedition was to decide between the Newtonian and\ngeneral relativity values. The measurements are difficult, and the results were not accurate\nenough to decide which theory was right. But 1919 was the first year after the World War, in\nwhich Germany and Britain had fought each other almost to oblivion. A theory invented\nby a German, confirmed by an Englishman (from Newton's university, no less) - such a\npicture was comforting after the trauma of war, so the world press and scientific commu\nnity saw what they wanted to: Einstein vindicated! A proper confirmation of Einstein's\nprediction came only with the advent of radio astronomy, which could measure small de\nflections accurately. I leave you with this puzzle: If the accuracy of a telescope is λ/d, how\ncould radio telescopes be more accurate than optical ones, since radio waves have a longer\nwavelength than light has?!\n7.6 Buckingham Pi theorem\nThe second step is in a dimensional analysis is to make dimensionless groups. That task is\nsimpler by knowing in advance how many groups to look for. The Buckingham Pi theorem\nprovides that number. I derive it with a series of examples.\nHere is a possible beginning of the theorem statement: The number of dimensionless groups\nis. . . . Try it on the light-bending example. How many groups can the variables θ, G, m, r,\nand c produce? The possibilities include θ, θ2, Gm/rc2, θGm/rc2, and so on. The possibilities\nare infinite! Now apply the theorem statement to estimating the size of hydrogen, before\nincluding quantum mechanics in the list of variables. That list is a0 (the size), e2/4πε0, and\nme. That list produces no dimensionless groups. So it seems that the number of groups\nwould be zero - if no groups are possible - or infinity, if even one group is possible."
    },
    {
      "category": "Resource",
      "title": "Bon Voyage!",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-055j-the-art-of-approximation-in-science-and-engineering-spring-2008/3f5c586ccac732c5cc2ac66161dbe0cf_apr07.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n6.055J / 2.038J The Art of Approximation in Science and Engineering\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nChapter 11\nBon voyage!\nThe theme of this book is how to understand new fields, whether the field is known gen\nerally but is new to you; or the field is new to everyone. In either case, certain ways of\nthinking promote understanding and long-term learning. This afterword illustrates these\nways by using an example that has appeared twice in the book - the volume of a pyramid.\n11.1 Remember nothing!\nThe volume is proportional to the height, because of the drilling-core argument. So V ∝ h.\nBut a dimensionally correct expression for the volume needs two additional lengths. They\ncan come only from b2. So\nV ∼ bh2 .\nBut what is the constant? It turns out to be 1/3.\n11.2 Connect to other problems\nIs that 3 in the denominator new information to remember? No! That piece of information\nalso connects to other problems.\nFirst, you can derive it by using special cases, which is the subject of Section 8.1.\nSecond, 3 is also the dimensionality of space. That fact is not a coincidence. Consider the\nsimpler but analogous problem of the area of a triangle. Its area is\nA = bh.\nThe area has a similar form as the volume of the pyramid: A constant times a factor related\nto the base times the height. In two dimensions the constant is 1/2. So the 1/3 is likely to\narise from the dimensionality of space.\nThat analysis makes the 3 easy to remember and thereby the whole formula for the volume.\nBut there are two follow-up questions. The first is: Why does the dimensionality of space\nmatter? The special-cases argument explains it because you need pyramids for each di\nrection of space (I say no more for the moment until we do the special-cases argument in\nlecture!).\n\n11 Bon voyage!\nThe second follow-up question is: Does the 3 occur in other problems and for the same\nreason? A related place is the volume of a sphere\nV = πr .\nThe ancient Greeks showed that the 3 in the 4/3 is the same 3 as in the pyramid volume.\nTo explain their picture, I'll use method to find the area of a circle then use it to find the\nvolume of a sphere.\nDivide a circle into many pie wedges. To find its area, cut somewhere on the circum\nference and unroll it into this shape:\nEach pie wedge is almost a triangle, so its area is bh/2, where the height h is approximately\nr. The sum of all the bases is the circumference 2πr, so A = 2πr × r/2 = πr2.\nNow do the same procedure with a sphere: Divide it into small pieces that are almost\npyramids, then unfold it. The unfolded sphere has a base area of 4πr2, which is the surface\narea of the sphere. So the volume of all the mini pyramids is\nV = 3\n1 × height × basearea = 4 πr3 .\n|{z} | {z }\n4πr2\nr\nVoila! So, if you remember the volume of a sphere - and most of us have had it etched into\nour minds during our schooling - then you know that the volume of a pyramid contains a\nfactor of 3 in the denominator.\n11.3 Percolation model\nThe moral of the preceding examples is to build connections. A physical illustration of this\nprocess is percolation. Imagine how oil diffuses through rock. The rock has pores through\nwhich oil moves from zone to zone. However, many pores are blocked by mineral deposits.\nHow does the oil percolate through that kind of rock?"
    },
    {
      "category": "Resource",
      "title": "Box Models and Conservation",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-055j-the-art-of-approximation-in-science-and-engineering-spring-2008/ae2e39d1a66d474d0bb537f8c4c3bdcf_mar12.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n6.055J / 2.038J The Art of Approximation in Science and Engineering\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nChapter 6\nBox models and conservation\n6.1 Cube solitaire\nHere is a game of solitaire that illustrates the theme of this chapter. The following\ncube starts in the configuration in the margin; the goal is to make all vertices be\nmultiples of three simultaneously. The moves are all of the same form: Pick any\nedge and increment its two vertices by one. For example, if I pick the bottom\nedge of the front face, then the bottom edge of the back face, the configuration\nbecomes the first one in this series, then the second one:\nAlas, neither configuration wins the game.\nCan I win the cube game? If I can win, what is a sequence of moves ends in all vertices\nbeing multiples of 3? If I cannot win, how can that negative result be proved?\nBrute force - trying lots of possibilities - looks overwhelming. Each move requires choosing\none of 12 edges, so there are 1210 sequences of ten moves. That number is an overestimate\nbecause the order of the moves does not affect the final state. I could push that line of\nreasoning by figuring out how many possibilities there are, and how to list and check them\nif the number is not too large. But that approach is specific to this problem and unlikely to\ngeneralize to other problems.\nInstead of that specific approach, make the generic observation that this problem is\ndifficult because each move offers many choices. The problem would be simpler\nwith fewer edges: for example, if the cube were a square. Can this square be turned\ninto one where the four vertices are multiples of 3? This problem is not the original\nproblem, but solving it might teach me enough to solve the cube. This hope motivates\nthe following advice: When the going gets tough, the tough lower their standards.\n\n6 Box models and conservation\na = 1\nb = 0\nThe square is easier to analyze than is the cube, but standards can be lowered still more\nby analyzing the one-dimensional analog, a line. Having only one edge means that there\nis only one move: incrementing the top and bottom vertices. The vertices start with a\ndifference of one, and continue with that difference. So they cannot be multiples of 3\nsimultaneously. In symbols: a - b = 1. If all vertices were multiples of 3, then a - b would\nalso be a multiple of 3. Since a - b = 1, it is also true that\na - b ≡ 1 (mod 3),\nwhere the mathematical notation x ≡ y (mod 3) means that x and y have the same remain\nder (the same modulus) when dividing by 3. In this one-dimensional version of the game,\nthe quantity a - b is an invariant: It is unchanged after the only move of increasing each\na = 1\nb = 0\nc = 0\nd = 0\nvertex on an edge.\nPerhaps a similar invariant exists in the two-dimensional version of the game.\nHere is the square with variables to track the number at each vertex. The one-\ndimensional invariant a - b is sometimes an invariant for the square. If my move\nuses the bottom edge, then a and b increase by 1, so a - b does not change. If my\nmove uses the top edge, then a and b are individually unchanged so a - b is again\nunchanged. However, if my move uses the left or right edge, then either a or b\nchanges without a compensating change in the other variable. The difference d - c has a\nsimilar behavior in that it is changed by some of the moves. Fortunately, even when a - b\nand d - c change, they change in the same way. A move using the left edge increments a - b\nand d - c; a move using the right edge decrements a - b and d - c. So (a - b) - (d - c) is\ninvariant! Therefore for the square,\na - b + c - d ≡ 1 (mod 3),\nso it is impossible to get all vertices to be multiples of 3.\nThe original, three-dimensional solitaire game is also likely to be impossible\na = 1\nb = 0\nc = 0\nd = 0\ne = 0\nf = 0\ng = 0\nh = 0\nto win. The correct invariant shows this impossibility. The quantity a - b + c -\nd + f - g + h - e generalizes the invariant for the square, and it is preserved by\nall 12 moves. So\na - b + c - d + f - g + h - e ≡ 1 (mod 3),\nwhich shows that all vertices cannot be made multiples of 3 simultaneously.\nInvariants - quantities that remain unchanged - are a powerful tool for solving problems.\nPhysics problems are also solitaire games, and invariants (conserved quantities) are essen\ntial in physics. Here is an example: In a frictionless world, design a roller-coaster track so\nthat an unpowered roller coaster, starting from rest, rises above its starting height. Perhaps\na clever combination of loops and curves could make it happen.\nThe rules of the physics game are that the roller coaster's position is determined by New\nton's second law of motion F = ma, where the forces on the roller coaster are its weight and\n\n6.055 / Art of approximation\nthe contact force from the track. In choosing the shape of the track, you affect the contact\nforce on the roller coaster, and thereby its acceleration, velocity, and position. There are an\ninfinity of possible tracks, and we do not want to analyze each one to find the forces and\nacceleration. An invariant, energy, simplifies the analysis. No matter what tricks the track\ndoes, the kinetic plus potential energy\nmv + mgh\nis constant. The roller coaster starts with v = 0 and height hstart; it can never rise above\nthat height without violating the constancy of the energy. The invariant - the conserved\nquantity - solves the problem in one step, avoiding an endless analysis of an infinity of\npossible paths.\nThe moral of this section is: When there is change, look for what does not change.\n6.2 Flight\nHow far can birds and planes fly? The theory of flight is difficult and involves vortices,\nBernoulli's principle, streamlines, and much else. This section offers an alternative ap\nproach: use conservation estimate the energy required to generate lift, then minimize the\nlift and drag contributions to the energy to find the minimum-energy way to make a trip.\n6.2.1 Lift\nInstead of wading into the swamp of vortices, study what does not change. In this case, the\nvertical component of the plane's momentum does not change while it cruises at constant\naltitude.\nBecause of momentum conservation, a plane must deflect air downward. If it did not, grav\nity would pull the plane into the ground. By deflecting air downwards - which generates\nlift - the plane gets a compensating, upward recoil. Finding the necessary recoil leads to\nfinding the energy required to produce it.\nImagine a journey of distance s. I calculate the energy to produce lift in three steps:\n1. How much air is deflected downward?\n2. How fast must that mass be deflected downward in order to give the plane the needed\nrecoil?\n3. How much kinetic energy is imparted to that air?\nThe plane is moving forward at speed v, and it deflects air over an area L2 where L is the\nwingspan. Why this area L2, rather than the cross-sectional area, is subtle. The reason is that\nthe wings disturb the flow over a distance comparable to their span (the longest length). So\nwhen the plane travels a distance s, it deflects a mass of air\nmair ∼ ρL2s."
    },
    {
      "category": "Resource",
      "title": "Buckingham Pi Theorem",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-055j-the-art-of-approximation-in-science-and-engineering-spring-2008/a122c6317f3a2c60f9316cab2f8ce570_apr14b.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n6.055J / 2.038J The Art of Approximation in Science and Engineering\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\n6.055 / Art of approximation\nLarge lenses warp and crack; one of the largest lenses made is 6 m. So there is no chance of\ndetecting an angle of 10-9.\nPhysicists therefore searched for another source of light bending. In the solar system, the\nlargest mass is the sun. At the surface of the sun, the field strength is\nGm\n6.7 · 10-11 m3 s-2 kg-1 × 2.0 · 1030 kg\n10-6 ≈ 0.4′′.\nrc2 ∼ 7.0 108 m × 3.0 108 m s-1 × 3.0 108 m s-1 ∼ 2.1 ·\n·\n·\n·\nThis angle, though small, is possible to detect: The required lens diameter is roughly\nd ∼ λ/θ ∼ 0.5 · 10-6 m ∼ 20 cm.\n2.1 10-6\n·\nThe eclipse expedition of 1919, led by Arthur Eddington of Cambridge, tried to measure\nexactly this effect.\nFor many years Einstein believed that his theory of gravity would predict the Newton\nian value, which turns out to be 0.87 arcseconds for light just grazing the surface of the\nsun. The German mathematician, Soldner, derived the same result in 1803. Fortunately\nfor Einstein's reputation, the eclipse expeditions that went to test his (and Soldner's) pre\ndiction got rained or clouded out. By the time an expedition got lucky with the weather\n(Eddington's in 1919), Einstein had invented a new theory of gravity, which predicted 1.75\narcseconds. The goal of Eddington's expedition was to decide between the Newtonian and\ngeneral relativity values. The measurements are difficult, and the results were not accurate\nenough to decide which theory was right. But 1919 was the first year after the World War, in\nwhich Germany and Britain had fought each other almost to oblivion. A theory invented\nby a German, confirmed by an Englishman (from Newton's university, no less) - such a\npicture was comforting after the trauma of war, so the world press and scientific commu\nnity saw what they wanted to: Einstein vindicated! A proper confirmation of Einstein's\nprediction came only with the advent of radio astronomy, which could measure small de\nflections accurately. I leave you with this puzzle: If the accuracy of a telescope is λ/d, how\ncould radio telescopes be more accurate than optical ones, since radio waves have a longer\nwavelength than light has?!\n7.6 Buckingham Pi theorem\nThe second step is in a dimensional analysis is to make dimensionless groups. That task is\nsimpler by knowing in advance how many groups to look for. The Buckingham Pi theorem\nprovides that number. I derive it with a series of examples.\nHere is a possible beginning of the theorem statement: The number of dimensionless groups\nis. . . . Try it on the light-bending example. How many groups can the variables θ, G, m, r,\nand c produce? The possibilities include θ, θ2, Gm/rc2, θGm/rc2, and so on. The possibilities\nare infinite! Now apply the theorem statement to estimating the size of hydrogen, before\nincluding quantum mechanics in the list of variables. That list is a0 (the size), e2/4πε0, and\nme. That list produces no dimensionless groups. So it seems that the number of groups\nwould be zero - if no groups are possible - or infinity, if even one group is possible.\n\n7 Dimensions\nHere is an improved theorem statement taking account of the redundancy: The number of\nindependent dimensionless groups is. . . . To complete the statement, try a few examples:\n1. Bending of light. The five quantities θ, G, m, r, and c produce two independent groups.\nA convenient choice for the two groups is θ and Gm/rc2, but any other independent set\nis equally valid, even if not as intuitive.\n2. Size of hydrogen without quantum mechanics. The three quantities a0 (the size), e2/4πε0,\nand me produce zero groups.\n3. Size of hydrogen with quantum mechanics. The four quantities a0 (the size), e2/4πε0,\nme, and ħ produce one independent group.\nThese examples fit a simple pattern:\nno. of independent groups = no. of quantities - 3.\nThe 3 is a bit distressing because it is a magic number with no explanation. It is also the\nnumber of basic dimensions: length, mass, and time. So perhaps the statement is\nno. of independent groups = no. of quantities - no. of dimensions.\nTest this statement with additional examples:\n1. Period of a spring-mass system. The quantities are T (the period), k, m, and x0 (the\namplitude). These four quantities form one independent dimensionless group, which\ncould be kT2/m. This result is consistent with the proposed theorem.\n2. Period of a spring-mass system (without x0). Since the amplitude x0 does not affect\nthe period, the quantities could have been T (the period), k, and m. These three quan\ntities form one independent dimensionless group, which again could be kT2/m. This\nresult is also consistent with the proposed theorem, since T, k, and m contain only two\ndimensions (mass and time).\nThe theorem is safe until we try to derive Newton's second law. The force F depends on\nmass m and acceleration a. Those three quantities contain three dimensions - mass, length,\nand time. Three minus three is zero, so the proposed theorem predicts zero independent\ndimensionless groups. Whereas F = ma tells me that F/ma is a dimensionless group.\nThis problem can be fixed by adding one word. Look at the\nVar\nDim\nWhat\ndimensions of F, m, and a. All the dimensions - M or MLT-2\nF\nMLT-2\nforce\nor LT-2 - can be constructed from only two dimensions: M and\nm\nM\nmass\nLT-2. The key idea is that the original set of three dimensions\na\nLT-2\nacceleration\nare not independent, whereas the pair M and LT-2 are indepen\ndent. So:\nno. of independent groups = no. of quantities - no. of independent dimensions.\nAnd that statement is the Buckingham Pi theorem [9]."
    },
    {
      "category": "Resource",
      "title": "Cycling, Swimming, Flying",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-055j-the-art-of-approximation-in-science-and-engineering-spring-2008/e9fadf9d61173408d2d41263c918490f_mar05.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n6.055J / 2.038J The Art of Approximation in Science and Engineering\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\n5 Proportional reasoning\nSince A is the cross-sectional area of the animal, Ah is the volume of air that it sweeps out\nin the jump, and ρAh is the mass of air swept out in the jump. So the relative importance of\ndrag has a physical interpretation as a ratio of the mass of air displaced to the mass of the\nanimal.\nTo find how this ratio depends on animal size, rewrite it in terms of the animal's side length\nl. In terms of side length, A ∼ l2 and m ∝ l3. What about the jump height h? The simplest\nanalysis predicts that all animals have the same jump height, so h ∝ l0. Therefore the\nnumerator ρAh is ∝ l1, the denominator m is ∝ l3, and\nEdrag\nl2\n= l-1 .\nErequired\n∝ l3\nSo, small animals have a large ratio, meaning that drag affects the jumps of small animals\nmore than it affects the jumps of large animals. The missing constant of proportionality\nmeans that we cannot say at what size an animal becomes 'small' for the purposes of drag.\nSo the calculation so far cannot tell us whether fleas are included among the small animals.\nThe jump data, however, substitutes for the missing constant of proportionality. The ratio\nis\nEdrag\nρAh\nρl2h\nErequired\n∼ m\n∼ ρanimall3 .\nIt simplifies to\nEdrag\nρ\nh .\nErequired\n∼ ρanimal l\nAs a quick check, verify that the dimensions match. The left side is a ratio of energies, so\nit is dimensionless. The right side is the product of two dimensionless ratios, so it is also\ndimensionless. The dimensions match.\nNow put in numbers. A density of air is ρ ∼ 1 kg m-3. The density of an animal is roughly\nthe density of water, so ρanimal ∼ 103 kg m-3. The typical jump height - which is where the\ndata substitutes for the constant of proportionality - is 60 cm or roughly 1 m. A flea's length\nis about 1 mm or l ∼ 10-3 m. So\nEdrag\n1 kg m-3\n1 m\nErequired\n∼ 103 kg m-3 10-3 m ∼ 1.\nThe ratio being unity means that if a flea would jump to 60 cm, overcoming drag would\nrequire roughly as much as energy as would the jump itself in vacuum.\nDrag provides a plausible explanation for why fleas do not jump as high as the typical\nheight to which larger animals jump.\n5.4.3 Cycling\n\n6.055 / Art of approximation\nThis section discusses cycling as an example of how drag affects the performance of people\nas well as fleas. Those results will be used in the analysis of swimming, the example of the\nnext section.\nWhat is the world-record cycling speed? Before looking it up, predict it using armchair\nproportional reasoning. The first task is to define the kind of world record. Let's say that\nthe cycling is on a level ground using a regular bicycle, although faster speeds are possible\nusing special bicycles or going downhill.\nTo estimate the speed, make a model of where the energy goes. It goes into rolling resis\ntance, into friction in the chain and gears, and into drag. At low speeds, the rolling resis\ntance and chain friction are probably important. But the importance of drag rises rapidly\nwith speed, so at high-enough speeds, drag is the dominant consumer of energy.\nFor simplicity, assume that drag is the only consumer of energy. The maximum speed\nhappens when the power supplied by the rider equals the power consumed by drag. The\nproblem therefore divides into two estimates: the power consumed by drag and the power\nthat an athlete can supply.\nThe drag power Pdrag is related to the drag force:\nPdrag = Fdragv ∼ ρv3A.\nIt indeed rises rapidly with velocity, supporting the initial assumption that drag is the im\nportant effect at world-record speeds.\nSetting Pdrag = Pathlete gives\n\n!1/3\nPathlete\nvmax ∼\nρA\nTo estimate how much power an athlete can supply, I ran up one flight of stairs leading\nfrom the MIT Infinite Corridor. The Infinite Corridor, being an old building, has spacious\nhigh ceilings, so the vertical climb is perhaps h ∼ 4 m (a typical house is 3 m per storey).\nLeaping up the stairs as fast as I could, I needed t ∼ 5 s for the climb. My mass is 60 kg, so\nmy power output was\nPauthor ∼ potential energy supplied\ntime to deliver it\n= mgh\n60 kg × 10 m s-2 × 4 m ∼ 500 W.\nt\n∼\n5 s\nPathlete should be higher than this peak power since most authors are not Olympic athletes.\nFortunately I'd like to predict the endurance record. An Olympic athlete's long-term power\nmight well be comparable to my peak power. So I use Pathlete = 500 W.\nThe remaining item is the cyclist's cross-sectional area A. Divide the area into width and\nheight. The width is a body width, perhaps 0.4 m. A racing cyclist crouches, so the height\nis maybe 1 m rather than a full 2 m. So A ∼ 0.4 m2.\nHere is the tree that represents this analysis:\n\n5 Proportional reasoning\nvmax\nPathlete ∼Estairs/tstairs\nEstairs\n2400 J\nm\n60 kg\ng\n10 m s-2\nh\n4 m\ntstairs\n5 s\nPdrag ∼ρv3A\nρ\n1 kg m-3\nv\nA\n0.4 m2\nNow combine the estimates to find the maximum speed. Putting in numbers gives\n\n!1/3\n\n!1/3\nPathlete\n500 W\nvmax ∼\nρA\n∼ 1 kg m-3 × 0.4 m2\n.\nThe cube root might suggest using a calculator. However, massaging the numbers simpli\nfies the arithmetic enough to do it mentally. If only the power were 400 W or, instead, if the\narea were 0.5 m! Therefore, in the words of Captain Jean-Luc Picard, 'make it so'. The cube\nroot becomes easy:\n\n!1/3\n400 W\nvmax ∼∼ 1 kg m-3 × 0.4 m2\n∼ (1000 m3 s-3)1/3 = 10 m s-1 .\nSo the world record should be, if this analysis has any correct physics in it, around 10 m s-1\nor 22 mph.\nThe world one-hour record - where the contestant cycles as far as possible in one hour - is\n49.7 km or 30.9 mi. The estimate based on drag is reasonable!\n5.4.4 Swimming\nThe last section's analysis of cycling helps predict the world-record speed for swimming.\nThe last section showed that\n\n!1/3\nPathlete\nvmax ∼\nρA\n.\nTo evaluate the maximum speed for swimming, one could put in a new ρ and A directly\ninto that formula. However, that method replicates the work of multiplying, dividing, and\ncube-rooting the various values.\nInstead it is instructive to scale the numerical result for cycling by looking at how the maxi\nmum speed depends on the parameters of the situation. In other words, I'll use the formula\nfor vmax to work out the ratio vswimmer/vcyclist, and then use that ratio along with vcyclist to\nwork out vswimmer.\nThe speed vmax is\n\n!1/3\nPathlete\nvmax ∼\nρA\n.\n\n6.055 / Art of approximation\nSo the ratio of swimming and cycling speeds is\nvswimmer\n\nPswimmer\n!1/3\nρswimmer\n!-1/3\n\nAswimmer\n!-1/3\n.\nvcyclist\n∼\nPcyclist\n×\nρcyclist\n×\nAcyclist\nEstimate each factor in turn. The first factor accounts for the relative athletic prowess of\nswimmers and cyclists. Let's assume that they generate equal amounts of power; then the\nfirst factor is unity. The second factor accounts for the differing density of the mediums\nin which each athlete moves. Roughly, water is 1000 times denser than air. So the second\nfactor contributes a factor of 0.1 to the speed ratio. If the only factors were the first two,\nthen the swimming world record would be about 1 m s-1.\nLet's compare with reality. The actual world record for a 1500-m freestyle (in a 50-m pool) is\n14m34.56s set in July 2001 by Grant Hackett. That speed is 1.713 m s-1, significantly higher\nthan the prediction of 1 m s-1.\nThe third factor comes to the rescue by accounting for the relative profile of a cyclist and\na swimmer. A swimmer and a cyclist probably have the same width, but the swimmer's\nheight (depth in the water) is perhaps one-sixth that of a crouched cyclist. So the third\nfactor contributes 61/3 to the predicted speed, making it 1.8 m s-1.\nThis prediction is close to the actual record, closer to reality than one might expect given\nthe approximations in the physics, the values, and the arithmetic. However, the accuracy\nis a result of the form of the estimate, that the maximum speed is proportional to the cube\nroot of the athlete's power and the inverse cube root of the cross-sectional area. Errors in\neither the power or area get compressed by the cube root. For example, the estimate of\n500 W might easily be in error by a factor of 2 in either direction. The resulting error in the\nmaximum speed is 21/3 or 1.25, an error of only 25%. The cross-sectional area of a swimmer\nmight be in error by a factor of 2 as well, and this mistake would contribute only a 25%\nerror to the maximum speed. [With luck, the two errors would cancel!]\n5.4.5 Flying\nIn the next example, I scale the drag formula to estimate the fuel efficiency of a jumbo\njet. Rather than estimating the actual fuel consumption, which would produce a large,\nmeaningless number, it is more instructive to estimate the relative fuel efficiency of a plane\nand a car.\nAssume that jet fuel goes mostly to fighting drag. This assumption is not quite right, so at\nthe end I'll discuss it and other troubles in the analysis. The next step is to assume that the\ndrag force for a plane is given by the same formula as for a car:\nFdrag ∼ ρv2A.\nThen the ratio of energy consumed in travelling a distance d is\nEplane\nρup-high\nvplane 2\nAplane\nd .\nEcar\n∼\nρlow\n×\nvcar\n× Acar\n× d\n\n5 Proportional reasoning\nEstimate each factor in turn. The first factor accounts for the lower air density at a plane's\ncruising altitude. At 10 km, the density is roughly one-third of the sea-level density, so\nthe first factor contributes 1/3. The second factor accounts for the faster speed of a plane.\nPerhaps vplane ∼ 600 mph and vcar ∼ 60 mph, so the second factor contributes a factor of 100.\nThe third factor accounts for the greater cross-sectional area of the plane. As a reasonable\nestimate\nAplane ∼ 6 m × 6 m = 36 m2 ,\nwhereas\nAcar ∼ 2 m × 1.5 m = 3 m2 ,\nso the third factor contributes a factor of 12. The fourth factor contributes unity, since we\nare analyzing the plane and car making the same trip (New York to Los Angeles, say).\nThe result of the four factors is\nEplane\nEcar\n∼ 3 × 100 × 12 ∼ 400.\nA plane looks incredibly inefficient. But I neglected the number of people. A jumbo jet\ntakes carries 400 people; a typical car, at least in California, carries one person. So the plane\nand car come out equal!\nThis analysis leaves out many effects. First, jet fuel is used to generate lift as well as to\nfight drag. However, as a later analysis will show, the energy consumed in generating lift is\ncomparable to the energy consumed in fighting drag. Second, a plane is more streamlined\nthan a car. Therefore the missing constant in the drag force Fdrag ∼ ρv2A is smaller for a\nplane than for a car. our crude analysis of drag has not included this effect. Fortunately\nthis error compensates, or perhaps overcompensates, for the error in neglecting lift.\n5.5 Analysis of algorithms\nProportional reasoning is the basis of an entire subject of the analysis of algorithms, a core\npart of computer science. How fast does an algorithm run? How much space does it re\nquire? A proportional-reasoning analysis helps you decide which algorithms to use. This\nsection discusses these decisions using the problem of how to square very large numbers.\nSquaring numbers is a special case of multiplication, but the algebra is simpler for squaring\nthan for multiplying since having only one number as the input means there are fewer\nvariables in the analysis.\nHere is a divide-and-conquer version of the standard school multiplication algorithm."
    },
    {
      "category": "Resource",
      "title": "Densities",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-055j-the-art-of-approximation-in-science-and-engineering-spring-2008/163f5862157161dd55e89c757b43b0ad_apr04a.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n6.055J / 2.038J The Art of Approximation in Science and Engineering\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\n6.055 / Art of approximation\nThe other possibility is to add quantum mechanics, which was developed to solve funda\nmental problems like the existence of matter. The physics of quantum mechanics is com\nplicated, but its effect on dimensional analyses is simple: It contributes a new constant of\nnature ħ whose dimensions are those of angular momentum. Angular momentum is mvr,\nso\n[ħ] = ML2T-1 .\nThe ħ might save the day. There are now two quantities\nVar\nDim\nWhat\ncontaining time dimensions. Since e2/4πε0 has T-2 and\na0\nL\nsize\nħ has T-1, the ratio ħ2/(e2/4πε0) contains no time dimen\ne2/4πε0\nML3T-2\nsions. Since\nme\nM\nelectron mass\n\"\nħ2\n#\nħ\nML2T-1\nquantum\n= ML,\ne2/4πε0\na dimensionless group is\nħ2\na0me(e2/4πε0)\nIt turns out that all dimensionless groups can be formed from this group. So, as in the\nspring-mass example, the only possible true statement involving this group is\nħ2\n= dimensionless constant.\na0me(e2/4πε0)\nTherefore, the size of hydrogen is\nħ2\n.\na0 ∼ me(e2/4πε0)\nPutting in values for the constants gives\na0 ∼ 0.5A = 0.5 10-10 m.\n·\nIt turns out that the missing dimensionless constant is 1, so the dimensional analysis has\ngiven the exact answer.\n7.4.2 Atomic sizes and substance densities\nHydrogen has a diameter of 1A. A useful consequence is the rule of thumb is that a typical\ninteratomic spacing is 3A. This approximation gives a reasonable approximation for the\ndensities of substances, as this section explains.\n\n7 Dimensions\nLet A be the atomic mass of the atom; it is (roughly) the number of pro\na\na\ntons and neutrons in the nucleus. Although A is called a mass, it is\ndimensionless. Each atom occupies a cube of side length a ∼ 3 A, and\nhas mass Amproton. The density of the substance is\nmass\nAmproton\nρ = volume ∼\n(3 A)3 .\nYou do not need to remember or look up mproton if you multiply this\nfraction by unity in the form of NA/NA, where NA is Avogadro's number:\nAmprotonNA .\nρ ∼\n(3 A)3 × NA\nThe numerator is A g, because that is how NA is defined. The denominator is\n3 10-23 cm3 × 6 1023 = 18.\n·\n·\nSo instead of remembering mproton, you need to remember NA. However, NA is more famil\niar than mproton because NA arises in chemistry and physics. Using NA also emphasizes the\nconnection between microscopic and macroscopic values. Carrying out the calculations:\nρ ∼ A g cm-3 .\nThe table compares the estimate against reality. Most every-\nElement\nρestimated\nρactual\nday elements have atomic masses between 15 and 150, so the\nLi\n0.39\n0.54\ndensity estimate explains why most densities lie between 1 and\nH2O\n1.0\n1.0\n10 g cm-3. It also shows why, for materials physics, cgs units\nare more convenient than SI units are. A typical cgs density of\nSi\n1.56\n2.4\na solid is 3 g cm-3, and 3 is a modest number and easy to re-\nFe\n3.11\n7.9\nmember and work with. However, a typical SI density of a solid\nHg\n11.2\n13.5\n3000 kg m-3. Numbers such as 3000 are unwieldy. Each time\nAu\n10.9\n19.3\nyou use it, you have to think, 'How many powers of ten were\nU\n13.3\n18.7\nthere again?' So the table tabulates densities using the cgs units\nof g cm-3. I even threw a joker into the pack - water is not an element! - but the density\nestimate is amazingly accurate.\n7.4.3 Physical interpretation\nThe previous method, dimensional analysis, is mostly mathematical. As a second computa\ntion of a0, we show you a method that is mostly physics. Besides checking the Bohr radius,\nit provides a physical interpretation of it. The Bohr radius is the radius of the orbit with the\nlowest energy (the ground state). The energy is a sum of kinetic and potential energy. This\ndivision suggests, again, a divide-and-conquer approach: first the kinetic energy, then the\npotential energy."
    },
    {
      "category": "Resource",
      "title": "Dimensionless Groups",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-055j-the-art-of-approximation-in-science-and-engineering-spring-2008/50772f7c4e7bd233034630fafe6934db_apr02a.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n6.055J / 2.038J The Art of Approximation in Science and Engineering\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\n6.055 / Art of approximation\n7.3 Dimensionless groups\nDimensionless ratios are useful. For example, in the oil example, the ratio of the two quan\ntities has dimensions; in that case, the dimensions of the ratio are time (or one over time).\nIf the authors of the article had used a dimensionless ratio, they might have made a valid\ncomparison.\nThis section explains why dimensionless ratios are the only quantities that you need to\nthink about; in other words, that there is no need to think about quantities with dimensions.\nTo see why, take a concrete example: computing the energy E to produce lift as a function\nof distance traveled s, plane speed v, air density ρ, wingspan L, plane mass m, and strength\nof gravity g. Any true statement about these variables looks like\nmess\n+\nmess\n=\nmess ,\nwhere the various messes mean 'a horrible combination of E, s, v, ρ, L, and m.\nby the first one (the triangle). Then\nmess\nmess\n+\nmess\nmess\n=\nmess\nmess\n,\nThe first ratio is 1, which has no dimensions. Without knowing the individual messes, we\ndon't know the second ratio; but it has no dimensions because it is being added to the first\nAs horrible as that true statement is, it permits the following rewriting: Divide each term\nratio. Similarly, the third ratio, which is on the right side, also has no dimensions.\nSo the rewritten expression is dimensionless. Nothing in the rewriting depended on the\nparticular form of the true statement, except that each term has the same dimensions.\nTherefore, any true statement can be rewritten in dimensionless form.\nDimensionless forms are made from dimensionless ratios, so all you need are dimension\nless ratios, and you can do all your thinking with them. Here is a familiar example to show\nhow this change simplifies your thinking. This example uses familiar physics so that you\ncan concentrate on the new idea of dimensionless ratios.\nThe problem is to find the period of an oscillating spring-mass system given\nk\nx = 0\nm\nx\nan initial displacement x0, then allowed to oscillate freely. Section 5.1 gave\na proportional-reasoning analysis of this system. The relevant variables that\ndetermine the period T are mass m, spring constant k, and amplitude x0.\nThose three variables completely describe the system, so any true statement\nabout period needs only those variables.\n\n7 Dimensions\nSince any true statement can be written in dimensionless form,\nVar\nDim\nWhat\nthe next step is to find all dimensionless forms that can be\nT\nT\nperiod\nconstructed from T, m, k, and x0. A table of dimensions is\nm\nM\nmass\nhelpful. The only tricky entry is the dimensions of a spring\nk\nMT-2\nspring constant\nconstant. Since the force from the spring is F = kx, where x\nx0\nL\namplitude\nis the displacement, the dimensions of a spring constant are\nthe dimensions of force divided by the dimensions of x. It is\nconvenient to have a notation for the concept of 'the dimensions of'. In that notation,\n[F]\n[k] =\n,\n[x]\nwhere quantity means the dimensions of the quantity. Since [F] = MLT-2 and [x] = L,\n[k] = MT-2 ,\nwhich is the entry in the table.\nThese quantities combine into many - infinitely many - dimensionless combinations or\ngroups:\nkT2\nm\n\nkT2 !25\nm\nm , kT2 ,\nm\n, π kT2 , , . . . .\nThe groups are redundant. You can construct them from only one group. In fancy terms,\nall the dimensionless groups are formed from one independent dimensionless group. What\ncombination to use for that one group is up to you, but you need only one group. I like\nkT2/m.\nSo any true statement about the period can be written just using kT2/m. That requirement\nlimits the possible statements to\nkT2\n= C,\nm\nwhere C is a dimensionless constant. This form has two important consequences:\n1. The amplitude x0 does not affect the period. This independence is also known as simple\nharmonic motion. The analysis in Section 5.1 gave an approximate argument for why\nthe period should be independent of the amplitude. So that approximate argument\nturns out to be an exact argument.\n2. The constant C is independent of k and m. So I can measure it for one spring-mass\nsystem and know it for all spring-mass systems, no matter the mass or spring constant.\nThe constant is a universal constant.\nThe requirement that dimensions be valid has simplified the analysis of the spring-mass\nsystem. Without using dimensions, the problem would be to find (or measure) the three-\nvariable function f that connects m, k, and x0 to the period:\nT = f(m, k, x0).\n\n6.055 / Art of approximation\nWhereas using dimensions reveals that the problem is simpler: to find the function h such\nthat\nkT2\n= h().\nm\nHere h() means a function of no variables. Why no variables? Because the right side con\ntains all the other quantities on which kT2/m could depend. However, dimensional analysis\nsays that the variables appear only through the combination kT2/m, which is already on the\nleft side. So no variables remain to be put on the right side; hence h is a function of zero\nvariables. The only function of zero variables is a constant, so kT2/m = C.\nThis pattern illustrates a famous quote from the statistician and physicist Harold Jeffreys\n[6, p. 82]:\nA good table of functions of one variable may require a page; that of a function of\ntwo variables a volume; that of a function of three variables a bookcase; and that of\na function of four variables a library.\nUse dimensions; avoid tables as big as a library!\n7.4 Hydrogen atom\nHydrogen is the simplest atom, and studying hydrogen is the simplest way to understand\nthe atomic theory. Feynman has explained the importance of the atomic theory in his\nfamous lectures on physics [7, p. 1-2]:\nIf, in some cataclysm, all of scientific knowledge were to be destroyed, and only\none sentence passed on to the next generations of creatures, what statement would\ncontain the most information in the fewest words? I believe it is the atomic hypothesis\n(or the atomic fact, or whatever you wish to call it) that all things are made of atoms\n- little particles that move around in perpetual motion, attracting each other when they\nare a little distance apart, but repelling upon being squeezed into one another. In that one\nsentence, you will see, there is an enormous amount of information about the world. . .\nThe atomic theory was first stated by Democritus. (Early Greek science and philosophy\nis discussed with wit, sympathy, and insight in Bertrand Russell's History of Western Phi\nlosophy [8].) Democritus could not say much about the properties of atoms. With modern\nknowledge of classical and quantum mechanics, and dimensional analysis, you can say\nmore.\n7.4.1 Dimensional analysis\nThe next example of dimensional reasoning is the hydrogen atom in order to answer two\nquestions. The first question is how big is it. That size sets the size of more complex atoms\nand molecules. The second question is how much energy is needed to disassemble hy\ndrogen. That energy sets the scale for the bond energies of more complex substances, and"
    },
    {
      "category": "Resource",
      "title": "Dimensions",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-055j-the-art-of-approximation-in-science-and-engineering-spring-2008/d95ade21fff0cd2412dc23acfe59db55_feb27a.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n6.055J / 2.038J The Art of Approximation in Science and Engineering\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nChapter 7\nDimensions\nThe next way to eliminate spurious complexity is the method of dimensional analysis or\ndimensionless groups.\nThe following mathematical problem shows how dimensionless groups are, like propor\ntional reasoning and conservation laws, a form of symmetry reasoning. The problem is to\nexpand the polynomial (a + b + c)3 into its numerous terms. The school-algebra method is\nto multiply a + b + c by a + b + c and then multiply the result by a + b + c.\nThe school-algebra method is messy prone to mistakes, but symmetry comes to the rescue.\nThe factor a + b + c is unchanged if a an b, if a and c, or if b and c are swapped. Indeed,\nany permutation of a, b, and c leaves a + b + c unchanged and leaves (a + b + c)3 unchanged.\nTherefore, the product can - and should be - built using invariant combinations of a, b, and\nc: combinations that are unchanged by permuting a, b, and c.\nThe product contains a3, but a3 alone is not invariant to a permutation. The invariant ver\nsion of a3 is a3 + b3 + c3, which is one component of the product. The product also contains\nterms like a2b, which again is not invariant. The analogous invariant sum comes from\nadding all possible permutations of a2b:\n(a2b + ab2) + (a2c + ac2) + (b2c + bc2).\nThe third type of term is abc.\nSo the product has the form\n(a + b + c)3 = A(a3 + b3 + c3) + B(a2b + ab2 + a2c + ac2 + b2c + bc2) + C(abc),\nwhere A, B, and C are for-the-moment-unknown constants.\nHere is one way to evaluate the constants. Set a = 1, b = c = 0. Then the equation reduces\nto\n13 = A 13 ,\n·\nso A = 1. To get another relation, set a = b = c = 1. Then, using A = 1, the equation reduces\nto\n27 = 3 + 6B + C.\n\n7 Dimensions\nTo find C, notice that there are six ways to get an abc factor. So C = 6 and then B = 3.\nThus\n(a + b + c)3 = (a3 + b3 + c3) + 3(a2b + ab2 + a2c + ac2 + b2c + bc2) + 6abc.\nThis symmetry solution has several merits. First, it is less prone to mistakes than is multi\nplying by brute force. Second, it produces the answer in a meaningful, low-entropy form.\nThe chunks in the solution - the terms a3 + b3 + c3 and a2b + ab2 + a2c + ac2 + b2c + bc2 and\nabc - each obey the symmetry that nothing important changes if you permute a, b, and c.\nRather than using a brute-force method and then doing hard work to turn the solution into\na meaningful form, use symmetry reasoning: Whenever possible, work with quantities that\nobey the symmetries of the problem.\nThis chapter shows how this idea leads naturally to dimensionless groups, the fundamental\nidea of dimensional analysis.\n7.1 Power of multinationals\nThe first example shows what happens when people take no notice of dimensions.\nCritics of globalization often make this argument:\nIn Nigeria, a relatively economically strong country, the GDP [gross domestic prod\nuct] is $99 billion. The net worth of Exxon is $119 billion. 'When multinationals have\na net worth higher than the GDP of the country in which they operate, what kind of\npower relationship are we talking about?' asks Laura Morosini. [Source: 'Impunity\nfor Multinationals', ATTAC, 11 Sept 2002, [url:nigeria-argument], retrieved 11\nSept 2006]\nBefore reading further, try to find the most egregious fault in the comparison between\nExxon and Nigeria. It's a competitive field, but one fault stands out.\nThe comparison between Exxon and Nigeria has many problems. First, the comparison\nexaggerates Exxon's power by using its worldwide assets (net worth) rather than its as\nsets only in Nigeria. On the other hand, Exxon can use its full international power when\nnegotiating with Nigeria, so perhaps the worldwide assets are a fair basis for comparison.\nA more serious, and less debatable, problem is the comparison with GDP, or gross domestic\nproduct. To see the problem, look at the ingredients in how GDP is usually measured: as\ndollars per year. The $99 billion for Nigeria's GDP is shorthand for $99 billion per year.\nA year is an astronomical time, and its use in an economic measurement is arbitrary. Eco\nnomic flows, which are a social phenomenon, should not care about how long the earth\nrequires to travel around the sun. Suppose instead that the decade was the chosen unit of\ntime in measuring the GDP. Then Nigeria's GDP would be roughly $1 trillion per decade\n(assuming that the $99 billion per year value held steady) and would be reported as $1 tril\nlion. Now Nigeria towers over the puny Exxon whose assets are a mere one-tenth of this\nfigure."
    }
  ]
}