{
  "course_name": "The Art Museum: History, Theory, Controversy",
  "course_description": "Art museums are powerful and contested institutions. They are also innovative sites of architectural and artistic practice. From the exhibitionary complex of the nineteenth century to the experiential complex of today, this course investigates the art museum from historical and contemporary perspectives, striking a balance between theoretical investigation and case studies of recent exhibitions and museum buildings. Where and why did the concept of the public art museum emerge, and how have its functions changed over time? How do art museums continue to shape our definitions of what art is? How have they responded to recent critiques of the self-described ‘universal’ museum and to claims for the ethical display of ill-gotten artifacts or the restitution of such objects as Greek vases and bronzes looted from Benin? And why is the Euro-American art museum so compelling a model that it has spread around the globe?\nTo address these and other questions, we will also go behind the scenes. Visits to local museums and discussions with curators are an essential component of the course.",
  "topics": [
    "Fine Arts",
    "Architecture",
    "Architectural History and Criticism",
    "Art History",
    "Fine Arts",
    "Architecture",
    "Architectural History and Criticism",
    "Art History"
  ],
  "syllabus_content": "Course Meeting Times\n\nSeminar: 1 session / week, 3 hours / session\n\nCourse Description\n\nArt museums are powerful and contested institutions. They are also innovative sites of architectural and artistic practice. From the exhibitionary complex of the nineteenth century to the experiential complex of today, this course investigates the art museum from historical and contemporary perspectives, striking a balance between theoretical investigation and case studies of recent exhibitions and museum buildings. Where and why did the concept of the public art museum emerge, and how have its functions changed over time? How do art museums continue to shape our definitions of what art is? How have they responded to recent critiques of the self-described 'universal' museum and to claims for the ethical display of ill-gotten artifacts or the restitution of such objects as Greek vases and bronzes looted from Benin? And why is the Euro-American art museum so compelling a model that it has spread around the globe?\n\nTo address these and other questions, we will also go behind the scenes. Visits to local museums and discussions with curators are an essential component of the course.\n\nPrerequsites\n\nNone.\n\nRequired Books\n\nMcClellan, Andrew.\nArt Museum from Boullee to Bilbao\n. University of California Press, 2008. ISBN: 9780520251267.\n\nDuncan, Carol.\nCivilizing Rituals: Inside Public Art Museums\n. Routledge, 1995. ISBN: 9780415070126. [Preview with\nGoogle Books\n]\n\nRecommended Book\n\nSerrell, Beverly.\nExhibit Labels: An Interpretive Approach\n. Altamira Press, 1996. [Preview with\nGoogle Books\n]\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nParticipation\n\n3 response papers\n\n30 (10 each)\n\nFinal project (includes preliminary proposal and short presentation)\n\nThis class is a discussion based seminar. Your participation (in class conversation and during our offsite visits) is crucial and is weighted accordingly. Please come to each class meeting prepared to discuss all assigned readings for that week. Fieldtrips are not optional; they are an essential component of the course.\n\nCalendar\n\nSES #\n\nTOPICS\n\nKEY DATES\n\nIntroduction\n\nMuseum, Nation, Citizen\n\nGuest Lecture: Sam Bardaouil and Till Fellrath.\nTea with Nefertiti, or How the Arts Shape Culture\n\nLecture of interest:\nMatthew Rampley\n, \"\nMuseums and the Construction of Identities\n\"\n\nThe Museum as Arbiter: Episodes in Exhibition History\n\nDestination Museum: The Bilbao Effect\n\nWestern Museums and the Rest of the World: The \"Primitive\" and the Global International\n\nProject proposals and preliminary bibliographies due\n\nThe Artist as Curator: A Discussion with Arlene Shechet on\nMeissen Recast\n\nVisit to\nRhode Island School of Design (RISD)\n\nLooting and Restitution, or, the Universal Museum Reconsidered\n\nDue: Response paper on repatriation\n\nThe Private Museum\n\nVisit to the\nIsabella Stewart Gardner Museum\n.\n\nTour and discussion with\nAnne-Marie Eze\n, Associate Curator of Collections\n\nBeyond the Nation: The Americas Galleries at the MFA\n\nVisit to the\nMuseum of Fine Arts\n.\n\nDue: Response paper to the Gardner Museum\n\nLightning Talks\n\nIn-class:\nLightning talks\nof ongoing research projects\n\nMuseums and Money\n\nIn-class: Additional lightning talks if necessary\n\nSneak Preview of new\nHarvard University Art Museums\nwith Elizabeth Rudy, Theodore Rousseau Assistant Curator of European Paintings\n\nFinal projects due",
  "files": [
    {
      "category": "Resource",
      "title": "Writing Handout 1: Title, Thesis Statement and Claim Sentences",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-609-the-art-museum-history-theory-controversy-spring-2014/0a83ac6750e1400a1ef6cbb947131bcd_MIT4_609S14_assignmnts_wh1.pdf",
      "content": "Writing Handout 1: Title, Thesis Statement and Claim Sentences\n\nTitles\n\nYour paper should always have a title. The title should function as a statement of the\nchief topic of your paper, giving the reader an idea of what the paper is going to be about.\nDo not use vague titles, or titles that promise far more than the paper can deliver (e.g.\n\"Modern Painting,\" \"The Art of the Nineteenth Century,\" or worse, \"Second Paper.\")\n\nThesis Statement\n\nThe single feature of a paper that most contributes to its clarity is the thesis statement. A\nthesis statement is a very condensed expression of your whole argument.\n\nQualities of a Well-Written Thesis Statement\n\n- Significant: In order to be considered \"significant,\" a thesis must not be so obvious\nthat it requires no argument to support it. The thesis, \"Paul Cezanne was a French\npainter,\" is not significant because it is indisputable. A thesis must be disputable.\n\n- Appropriately Located: The thesis should appear at or near the end of the introductory\nparagraph. (In a short paper, this usually means at the end of the first paragraph.) The\npurpose of a thesis is to control the way the reader reads the rest of your paper. By\nstating your thesis at the beginning you make it much more difficult for the reader to\nread whatever they like into your paper.\n\n- Clear, specific, and detailed: If the thesis is vague or awkwardly expressed, your\nreaders will enter the paper without having been told what they should see. This will\nhave two consequences:\n(a) They will see whatever they are predisposed to see.\n(b) They will experience the paper as \"unclear.\"\n\nThe thesis statement should be the sentence you take most time and trouble to write.\n\nThe more detailed your thesis statement is, the less opportunity you provide your\nreader to see something else in the evidence than what you want them to see. The\nthesis should take the form of one long, rich sentence that summarizes the whole of\nwhat you want the reader to believe after they have read your paper.\n\n- Not Topic-Announcing: A thesis should never be topic announcing. A topic-\nannouncing thesis is one of the following sort: \"In this paper we are going to discuss a\npainting by Kandinsky.\" This thesis is topic announcing because it tells the reader\nthat you are going to tell them something without telling them what that something is.\n\nA better thesis would state: \"In his painting Improvisation X, Kandinsky conveys a\nsense of agitation though his use of jagged line, strongly contrasting colors, and a\ncompressed, almost claustrophobic spatial construction.\"\nA good thesis actually states what the argument is; it does not just state that an\nargument concerning a particular topic will, in the course of time, be presented.\n\nClaim Sentences\n\nThe second most important tool in creating a paper that is \"clear\" to a reader is the claim\nsentence. The claim sentence is a sentence that states the point of a paragraph. It is to the\nparagraph what the thesis is to the paper as a whole. It controls the way the reader reads\nthe rest of the information in the paragraph. A paper will seem \"clear\" to the reader to the\nextent that paragraphs have appropriate claim sentences and unclear to the extent that\nthey do not.\n\nClaim sentences have two functions:\n\n1. To sum up the point the paragraph is making.\n\n2. To tie the paragraph back to the thesis of the paper.\n\nIf your claim sentence does not do both then it is inadequate.\n\n- Like a thesis statement, a claim sentence should be appropriately located. A claim\nsentence is most effective when it is the first sentence of a paragraph.\n\n- Just as a thesis should not be topic announcing, so a claim sentence should not merely\nannounce the topic of a paragraph:\n\nBad claim sentence: \"In The Night Cafe, Van Gogh makes great use of color.\"\n\nGood claim sentence: \"In The Night Cafe, Van Gogh uses intense, saturated, and\nstrongly contrasting colors to heighten the effect of psychological tension in his\npainting.\"\n\n- The rest of the paragraph should do two things:\n(a) Explain in more detail what you mean by the claim sentence.\n(b) Give evidence for the claim. Here you would use your specific observations of the\nimages you are discussing; you might use quotations; or you might refer to another\nauthor's argument.\n\n- It is vital that material which has nothing to do with your claim should not appear in\nyour paragraph. If it does, it will confuse your reader and will make your paragraph\nless clear and coherent.\n\nIf the misplaced material is important then it should have a paragraph of its own. If it\nis not important, cut it.\n\n- Never give the reader evidence (for instance, a quotation) until you have told them\nhow to interpret it. Readers will always assume that the sentences which precede a\nquotation state a claim that the quotation is intended to support.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n4.609 / 4.S67 The Art Museum: History, Theory, Controversy\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Writing Handout 2: Style Sheet",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-609-the-art-museum-history-theory-controversy-spring-2014/574254b24df0c56da03644f82a8e65ea_MIT4_609S14_assignmnts_wh2.pdf",
      "content": "Writing Handout 2: Style Sheet\n\nBLOCK QUOTES: Whenever you quote a passage that runs for more than four lines in your paper,\nyou should set it off as a block quote:\n\nBlock quotes do not take quotation marks. They always start with a capital letter.\nThey are indented a half inch from the left margin and are justified left (you may\njustify right and indent a half inch on the right also, but this is not required). Block\nquotes must be in the same font size as the rest of your paper. Block quotes are\nalways single spaced. Passages shorter than four full lines in your paper should not\nbe block quoted.\n\nBOOK TITLES: When referring to a book title in your paper, always either underline it or italicize\nit. Never underline or italicize an article or chapter title. These should appear in quotation marks.\n\nCITATION: Whenever you quote from another text, or whenever you refer to a specific idea in\nanother text, you are required to cite your source. To fail to do so is plagiarism. Plagiarism is a\nserious offense. You can be fired from a job for misrepresenting someone else's ideas as your\nown. You can also be dismissed from college.\n\nCitation of sources can take one of two forms.\n\n(a) Footnotes: The most common form of citation among art historians is the footnote. Footnote\nnumbers in the text always appear outside the period at the end of a sentence [e.g. French art.i].\nThe following is the correct format for footnote citation:\n\nBook: Eilean Hooper-Greenhill, Museums and the Shaping of Knowledge (London and\nNew York, 1985), 5.\n\nNOTE: You are not required to cite the name of the publisher, but if you do so, this is the\nformat--(London and New York: Routledge, 1992).\n\nArticle: Mark Rectanus, \"New York-Bilbao-Berlin and Back: The Global Museum and\nCultural Politics,\" European Studies Journal 17 (2000), 41-66.\n\nEssay in a Collection: Danielle Rice, \"Museums: Theory, Practice, and Illusion,\" in Art\nand Its Publics: Museum Studies at the Millennium, Andrew McClellan, ed.,\n(Malden, MA, and Oxford, 1995), 77-95.\n\nPlease note:\n\n- First name comes first, followed by last name and a comma.\n- Title of book or journal is always italicized or underlined.\n- Publisher can be omitted, but city of publication cannot.\n- City of publication and date of edition should appear in parentheses separated by a comma.\n\n- Page number(s) are represented by numerals only. Do not use \"page,\" or \"p\" or \"pp.\"\n- Always list a book under the name of the author, not the editor.\n\n(b) Parenthetical citation: The citation always comes before the period and outside any\nquotation marks. Parenthetical citations should always appear at the end of sentences. The\nfollowing is the \"correct format for a book, article, or essay citation\" (Crow, 5); (Hyde, 50);\n(Wrigley, 21).\n\nIf you use this format you are required to include a bibliography of works cited after the final\npage of the paper. The bibliography format is as follows:\n\nDuncan, Carol, Civilizing Rituals: Inside Public Art Museums (London and New York,\n1995).\n\nPlease Note: Format is the same as in footnotes except that last name comes before first\nname.\n\nWhen writing a paper in which multiple cites from the same text are necessary, it is better to use\nparenthetical citation. When the title of the work to which you are referring is obvious on the\nbasis of context, you may omit the author name from the parentheses and simply cite the page\nnumber, e.g. (5).\n\nELLIPSES: Use an ellipsis . . . whenever you leave out part of a quotation. A standard ellipsis has\nthree dots, each separated by a space. When the part of the quotation you are eliding contains a\nperiod, there must be four dots in the ellipsis. Ellipses are important because if you don't use\nthem you can be accused of distorting a quote to serve your own purposes.\n\nFONT: Use 12 point. Do not use ornate styles. The closer it looks to print the better. Suggested:\nTimes New Roman; Garamond.\n\nLINE SPACING: Double space, except for block quotes and footnotes which must be single\nspaced.\n\nMARGINS: Use 1.25 inch, left and right, and one inch top and bottom.\n\nPAGE NUMBERS: You should always have page numbers except on a separate title page. A\nseparate title page never counts as page one.\n\nPARAGRAPHING: Spacing between paragraphs should not differ from spacing between lines. The\nfirst line of the paragraph should be indented a half inch.\n\nQUOTATION: Never mis-quote a passage. Always give the quote exactly as it appears in the text.\nExceptions: (a) you may leave part of the quotation out by using an ellipsis, (b) you may change\nthe case of the first letter of the quotation.\n\nQUOTATION MARKS: \"There should be no spaces between the quotation mark and the first letter\nof the sentence. The period should go inside the quotation mark.\" When using a \"quoted phrase,\nset off by commas,\" inside a sentence, the final comma should go inside the quotation marks.\n\nSPACING: Periods, commas, colons, and semi-colons take one space only.\n\nCOMMON MINOR ERRORS\n\n- It's = \"It is,\" not the possessive of \"It.\"\n\n- When using the word one's (as in one's obligations to one's community), do not forget the\napostrophe.\n\n- When using a double-barrel word as an adjective, hyphenate it. When not using it as an\nadjective, omit the hyphen. [An adjective is a descriptive word that modifies a noun].\ne.g. \"Twentieth-century museums were. . .\"\n\"In the twentienth century, museums were . . ..\"\n- Note: do not use \"-type\" as an adjective, e.g. aristocratic-type. This is highly informal\n(and often improper) word usage and looks sloppy.\n\n- Affect vs. Effect. When effect is used as a noun in means \"result,\" \"consequence.\" When\nused as a verb it means \"to cause,\" \"to bring about.\" When \"affect\" is used as a noun it\nmeans \"feeling,\" or \"emotion.\" When used as a verb it usually means \"to act upon,\"\n\"change,\" or \"alter.\" Affect is most commonly used as a verb; effect is most commonly used\nas a noun.\n\n- Do not use contractions (don't, won't, it's, they're etc.). Contractions look sloppy and casual\nand do not usually appear in academic prose.\n\n- Never use i.e. or etc., or e.g. in a paper. Spell it out: \"that is\"; \"and so on\"; \"for example.\"\n\ni\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n4.609 / 4.S67 The Art Museum: History, Theory, Controversy\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "4.609 S14 Final Paper: Art Museums in Maoist China",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-609-the-art-museum-history-theory-controversy-spring-2014/b3551d383696c1d7f7be3be37c8b435b_MIT4_609S14_assgn_student_work3.pdf",
      "content": "Final Paper: Art Museums in Maoist China\nIn the first half of the twentieth century, China was ravaged by wars and rarely\nhad a stable or powerful central government. In 1949, the Chinese Communist Party\n(CCP) led by Mao Zedong took power and quickly consolidated its rule over China. The\nCCP sought to radically transform almost all aspects of life and art and art museums were\nno exception. The CCP sought to reshape art and art museums according to their\nrevolutionary political ideas. According to these principles, museums such as the\nMuseum of the Chinese Revolution were effectively overseen by the CCP's propaganda\ndepartment and there was little room for independent art. The Cultural Revolution\nfurthered these trends when many priceless artifacts were destroyed by paramilitary\nRed Guards who associated the artifacts with traditional Confucian ways of thinking. The\nCultural Revolution also inflicted incredible suffering on many individuals and families\nwho were often groundlessly fingered as being counterrevolutionary. However,\nsomewhat surprisingly institutions such as the Shanghai Museum cooperated with Red\nGuards to enrich their collections. The CCP also extensively utilized art-historical\nexpertise during this time to export art for foreign exchange.\nThis paper will begin with a historical overview of the period as the political\ncontext had an important effects on Chinese art during this period. We will then discuss\n\nthe Museum of the Chinese Revolution and its founding in 1960 as one of the major case\nstudies in this paper. The Shanghai Museum which opened in 1952 is the other major\ncase study. These cases illustrate that while politics generally dominated art during this\nperiod of Chinese history; art and art museums managed to avoid complete domination\nand in some respects art-historical expertise became more important. This complexity\nproblematizes the conventional narrative that Maoist China and particularly the Cultural\nRevolution were a terrible time for art which while accurate in many respects does not\nfully capture the subtleties of the period. These subtleties would become very important\nlater on in the case of the Shanghai Museum where the curatorial expertise gained\nduring this period placed a crucial role in the museum after 1976.\nThe CCP was founded in 1921 and in its early years allied with the Nationalists in\nfighting warlords. Yet in 1927 Chiang Kai-shek turned on the CCP which was driven out\nof the coastal urban centers where its support had originated. By the mid-1930s the\nCommunists were on the run and the Nationalists had consolidated power. The Second\nSino-Japanese War broke out in 1937 at which point the CCP and Nationalists nominally\nformed an alliance against the Japanese. In reality, the Communists began to take\nterritory from the Nationalists government which was forced to move its capital inland to\nChongqing as Japan conquered the coastal cities. After Japan's defeat in 1945 the Chinese\nCivil War resumed in full force. In 1949, the Nationalists were forced to retreat to Taiwan\nand the People's Republic of China was founded.\nThe early 1950s were a time of dramatic social change in China with land reform\nand Communist control transforming the economy. The economy grew at a relatively\n\nrapid pace which led Mao to order the Great Leap Forward in 1958. The Great Leap\nForward turned out to be an unmitigated disaster with tens of millions starving between\n1958 and 1961. Relations with the Soviet Union also worsened during this period. After\nthe failed experiment of the Great Leap Forward life normalized somewhat in the\nmid-1960s until the Cultural Revolution began in 1966. The Cultural Revolution\nattempted to eradicate traditional influences on society which led to harassment of\nformer land owners and destruction of many traditional artifacts. After Mao's death in\n1976 the CCP became more moderate under Deng Xiaoping and independent art\ndeveloped to a much greater extent.\nThe CCP was from its early years very aware of the importance of using culture to\ninitially spread its popularity and later when it took power in 1949 it used similar\nmethods to legitimize its rule. The Party even began to think about building a museum\ndevoted to artifacts and art during its difficult years in the early 1930s when Nationalist\nforces had chased it out of the major cities where it had originated (The Red Line 915).\nAlthough such plans did not materialize for decades due to the turbulent political\nenvironment and continuous armed conflict it is representative of the Party's approach to\npower. For example when the CCP took Beijing in 1949 it began collecting items for what\nwould eventually become the Museum of the Chinese Revolution, which would not\nactually open for more than a decade. The first item for the museum was the scaffolds\nused to execute Li Dazhao, one of the co-founders of the CCP.\nThe CCP also developed a type of oil painting which they called, \"\"revolutionary\nhistory painting\" to recount and glorify the history of the party (Oil Paintings and\n\nPolitics 785). The use of oil paintings as a political tool is particularly interesting as oil\npaintings could have been considered a sign of individual expression influenced by the\nbourgeois West instead of a proper proletarian art form. Yet the CCP relied on this\npaintings extensively to present their preferred historical narrative to the Chinese\npopulation. Art was a particularly important medium of communication during this early\nyears of the PRC as most of the population was rural illiterate farmers. The oil paintings\nwere also influenced by Soviet Socialist Realism as there was widespread cultural\nexchange between the PRC and the Soviet Union in the 1950s. The addition of art to the\nMuseum of the Chinese Revolution had its roots in these exchanges. Wang Yeqiu visited\nthe Soviet Union in 1950 and was so impressed by the Soviet National Museum of the\nRevolution that he proposed adding oil paintings to the Museum of the Chinese\nRevolution (Oil Paintings and Politics 786). The next year his proposal was accepted and\nplans were made to commission historical oil paintings for the museum.\nAlthough many museums commission artwork for exhibits this case was unusual\nin how strictly the Party proscribed the historical topics to be painted. Influenced by\nsimilar Soviet museums the organization of the museum was to follow the then orthodox\nview of Party history laid out in Hu Qiaomu's Thirty years of the Chinese Communist\nParty, which was based on Mao's 1940 essay, \"New Democracy\" (Oil Paintings and Politics\n791). Some technically skilled and politically loyal painters were assigned to make\npaintings for the museum a task which they eagerly applied themselves due to a mixture\nof belief in the communist cause, desire for national recognition, and financial support.\n\nAlthough there was general consensus in the Party over its history; the role of\nMao in the Part proved a much more challenging topic. While the Museum of the Chinese\nRevolution was originally planned to open in October 1949 as part of celebrations for the\nPRC's 10th anniversary its opening was delayed for two years because of this dispute.\nThe disagreement centered on whether Mao was a singular figure in the Party history or\nwhether he was one of several important early Party leaders. Eventually the Museum\nopened with something closer to the latter view although Mao was still portrayed as the\nmost important figure.\nAlthough the dispute over Mao's centrality was particularly divisive it was far\nfrom the only politically motivated dispute during the founding of the Museum of the\nChinese Revolution. Many artists struggled with the difficult task of having their works\n\"reflect the revolutionary movement of workers, peasants, and soldiers and their\nrevolutionary wars [against imperialism and capitalism], and portray the determination\nand integrity of revolutionary heroes\" which was the official standard for artworks in the\nmuseums (Oil Paintings and Politics 801). Many works of art produced for the museum\nwere rejected on these grounds although we do not have statistics on the exact number\nbecause museum archives are closed to the public. Several paintings portraying\nCommunist martyrs were rejected for being too gloomy.\nNor did political interference in art end when the artworks were completed. For\nexample, Dong Xiwen's 1953 oil painting The Founding Ceremony of the Nation features\nMao Zedong addressing hundreds of thousands in Tiananmen Square gloriously\nannouncing the formation of the People's Republic. Although contrary to history, in the\n\npainting Mao stands along with a group of senior Communist leaders watching close by.\nAs the painting was initially politically popular and regarded as one of China's best oil\npaintings over 500,000 reproductions were made within three months (Oil Paintings and\nPolitics 783). Yet during the continuously shifting political tides of Maoist China several\nof the senior party leaders in the painting were purged and Dong was ordered to remove\nthem from the painting. Although Dong died in 1973 other painters restored the images\nof the purged leaders in 1979.\nThese examples illustrate the centrality of politics to art and art museums during\nthis period. Although technical excellence was not completely ignored it was certainly\ndevalued compared to political correctness. As such while the Museum of the Chinese\nRevolution was officially under the Ministry of Culture the CCP's Propaganda Department\nplayed an even more important role (The Red Line 923). Yet there was still limited room\nfor artistic innovation during this period. The CCP was keen to see the development of a\nnew Chinese form of painting and as long as the paintings were sufficiently politically\ncorrect and met certain basic artistic tenets the artists had reasonable freedom. The CCP\nalso provided technical training to young artists and encouraged artistic exchange with\nthe Soviet Union before the Sino-Soviet Split. As part of this exchange there were\nexhibitions of Soviet paintings in 1954 and in 1955-56 Konstantin Masksimov, a\nprominent Soviet painter taught a two-year class at the Central Academy of Fine Arts (Oil\nPaintings and Politics 789).\nAlthough CCP controlled art had its roots in the 1930s it was not until the\nfounding of the PRC in 1949 that the Party was able to exercise control over most artistic\n\nactivities. Once seizing power the CCP quickly went about setting up organizations to\ntrain and influence artists. The Party sought to utilize both previously sympathetic\nartists and previously apolitical artists to legitimize its rule through art (Galikowski 11).\nThe CCP used a mixture of coercion and support for its preferred artists in the form of\nmembership in new prestigious art associations and prominence in art publications and\nexhibitions to ensure compliance from artists (Ibid 16). As the Communists almost\ncompletely controlled access to the ways that artists could communicate with the public\nthis was a very important incentive. Particular tensions arose over New Year pictures and\ntraditional Chinese landscape paintings which were seen as inappropriate for the new\nCommunist society. The Party attempted to introduce realist elements into New Year\npictures but admitted that artistically these efforts were a failure (Ibid 29). While efforts\nto politicize traditional landscape paintings were largely similarly unsuccessful the CCP\nallowed a few prominent painters to continue painting traditional landscapes because\nthey represented China's \"artistic heritage\" which the Party did not try to completely\neradicate during this period (Ibid 35). Yet on occasion various political campaigns would\ntarget artists seen as insufficiently politically loyal.\nExport laws promulgated by the new Communist government also played an\nimportant role in redefining the Chinese art canon. Artworks made before 1795 were not\nallowed to be exported and were considered in some sense public property while\nanything post-1795 could be exported (Lu 49). Anything to be exported had to be\ninspected by customs officials who were typically museum employees. This empowered\nmuseum employees at the expense of art dealers who had to with a lengthy bureaucratic\n\nprocess to export any art. Experts were hired to inspect potential exports and to train\nmore workers capable of these tasks. Objects were also classified into three tiers\ncorresponding roughly to museum quality, usable for cultural endeavors such as film\ncompanies or libraries, and not worth preserving. While shifting government policy put\nmany art dealers and formerly elite households in dire financial straits the Shanghai\nMuseum received generous funding to allow it to expand its collection largely from the\npreviously mentioned groups (Ibid 69). Several large art dealers were accused of\nsmuggling art for export and the Shanghai Museum was able to confiscate their\ncollections. While the Shanghai Museum was enriching its collection through\nconfiscations and pressured donations it claimed that its acquisitions were voluntary\ndonations given out of a newfound sense of nationalism among collectors (Ibid 99).\nDuring this period the Shanghai Museum also established a conservation\ndepartment. Conservators worked on the museum's collection but also took orders from\noutside collectors. Not only did this allow the Shanghai Museum to learn more about the\nquality of private collections it also allowed the state to essentially eliminate the market\nof private restorers (Ibid 114). The Shanghai Museum also enriched its collection by\nsalvaging more than ten thousand bronze relics from the scrap metal produced during\nthe Great Leap Forward (Ibid 124). At the same time the Shanghai Museum further\ndeveloped its training program as most of its senior staff was getting old. The training\nfocused on hands-on experience with artifacts instead of theoretical knowledge of art as\nthe former was considered more proper for a proletarian institution. This enabled\nShanghai to increase its number of art inspectors and thus allow more pieces to be\n\nexported. As foreign exchange was hard to obtain during this time this proved the value\nof the museum to the state (Ibid 145). The Shanghai Museum also played an important\nrole in setting prices for artworks during this period.\nIn the late 1950s the Shanghai Museum gained interest in ethnic minority art as\npart of the PRC's policy that its fifty-five minority groups were an integral part of the\nnation. The export of pre-1949 minority artifacts was prohibited (Ibid 157). This was just\none of many ways in which PRC policy shaped the Chinese art canon. The Shanghai\nMuseum had gained enough prominence that it was able to refuse most of Beijing's\nrequests for items for the openings of the Museum of the Chinese Revolution and the\nChinese History Museum which was unprecedented (Ibid 165).\nThe CCP's policies towards artists generally followed its more general policy\ntowards intellectuals. There was a liberalization of what was considered acceptable\nduring the Hundred Flowers Campaign and then a subsequent reversal during the\nAnti-Rightist Campaign. Several prominent artists such as Jiang Feng, the most senior\npolitical figure in an important art association were labeled as rightists and massively\ndemoted or sent to re-education camps (Ibid 77). Oftentimes victims of purges were not\ntargeted solely because of ideological or artistic differences but also in part due to\nfactional struggles.\nAfter the horrors of the Great Leap Forward, Mao's influence within the party was\ndiminished. In 1966, Mao began the Cultural Revolution as a way to regain his former\ninfluence. Paramilitary youth groups called Red Guards began an assault on anything\nassociated with tradition or bourgeois capitalism. The previously precarious position of\n\ntraditional Chinese art further deteriorated as Red Guards attacked its practitioners as\nfeudal elites. Estimates of deaths caused by the Cultural Revolution vary but are typically\nbetween one and two million (Song 2). Many individuals committed suicide after\nharassment and public shaming by Red Guards. Priceless artifacts were destroyed when\nRed Guards ransacked households (King and Walls 8).\nAt the Central Academy of Fine Arts, four faculty members were beaten and\nimprisoned in makeshift campus prisons (Andrews 36). Plaster casts of European and\nAsian sculptures were hacked with axes and then burned. The Cultural Revolution also\nalmost completely shut down the production of not explicitly political art although there\nwere some dissidents who resisted such as Shi Lu (Hawks 59). Although certain works of\nart from the period have become internationally famous it was generally a dark period\nfor artistic production in China.\nWhile there was initial fear among employees of the Shanghai Museum that Red\nGuards would destroy parts of the collection ,the museum ended up collaborating with\nRed Guard raids to enrich its collection. Lu argues, \"While some argue that cultural\ninstitutions buffered the PRC's ancient relics from the worst of the Cultural Revolution,\nShanghai Museum employees' work throughout the 1960s show that converting seized\nproperty into public assets was the institutions' true legacy\" (172). As part of the\nmuseum's strategy to keep out Red Guards and preserve its collection it set up its own\nteam of Red Guards to dissuade other Red Guards from entering and closed its doors on\nAugust 24th, 1996 (Ibid 177).\n\nAs Red Guards would often raid houses and destroy or expropriate artworks the\nShanghai Museum petitioned Shanghai's mayor for the right to go along on raids and take\nwhatever artworks the Red Guards had seized. The mayor accepted the petition and\nmuseum staff began sleeping at the museum so they could send the appropriate art\nexperts to accompany raids at any hour of day. While museum employees claimed and\nstill maintain that the objects were voluntarily donated owners who often had repeatedly\nrefused to donate the objects in the past disagreed with that assessment. Lu notes that\nwhile museum employees \"regarded Red Guards as irresponsible students who\n\"didn't know anything\"...[they] followed the same set of state policies regarding the\nsearch and seizure of private property, and even worked together to maximize the\nefficiency of specific raids\" (195). In some cases, private collectors claimed they had\ndonated their collections to the Shanghai Museum to avoid Red Guards from destroying\nthem even in the absence of actual agreements with the museum (Ibid 192).\nThe turmoil of the Cultural Revolution also disrupted the art market as fear of Red\nGuards and being labeled counterrevolutionary scared off both domestic collectors and\ninternational dealers. To earn valuable foreign exchange the state-owned Arts and Crafts\nCompany began using mail-order catalogs to sell items. The foreign exchange earned by\nthese exports and the Shanghai Museum's role in them helps explain why the museum\nretained political support throughout the Cultural Revolution.\nWhile the Shanghai Museum was enriching its collection it was also undergoing\ninternal purges. Big character posters leveled accusations against museum employees of\nclinging to traditional ideas or being insufficiently dedicated to the Communist cause.\n\nAfter a big character poster accused Hu Bo, head of the cataloging department of\nsmuggling artworks Hu went home and committed suicide (Ibid 206). Other employees\nwere sent to do hard labor.\nAlthough the raiding of individual homes quieted down after 1966 a huge amount\nof items had been seized which still had to be sorted. As there were a massive number of\nobjects to be sorted and relatively few individuals capable of appraising, the sorting\ncommittee struggled to find enough appraisers. Objects were sorted into pre or post\n1795 due to export laws and valuable items were either sent to museums or exported.\nThe poor conditions that confiscated items were kept in led to the ruin of some objects.\nAs the PRC was in dire financial straits by 1970 and was preparing for possible\nwar with the Soviet Union it decided to export as much art as possible. As part of that\npolicy the state Arts and Crafts Company began only selling in bulk. International\ndemand boomed and there was rapid price inflation in Chinese antiques. As the Cultural\nRevolution had somewhat calmed down at this point Hong Kong art dealers again\ntraveled to the Mainland to buy artifacts which they later sold to buyers around the\nWorld. However, Shanghai Museum staff eventually convinced the government that bulk\nselling would not maximize profits and that exporting the best post-1795 artworks was\nunwise.\nThe calming of the Cultural Revolution also allowed the Shanghai Museum to\nreopen in 1972. The Shanghai Museum also began welcoming international visitors as\nChina began improving its diplomatic relations with Western nations. Although the\nShanghai Museum displayed many confiscated items it did not display any provenance\n\ninformation which they argued would undermine the \"scientific value\" of their work (Lu\n247). One particularly important confiscated object was the Qin Standard, a volumetric\nmeasuring device. Museum exhibits argued that as the Qin Standard allowed China to\nadvance to a centralized state and contemporary Communist policies would allow China\nto advance from feudalism (Ibid 248).\nThe Cultural Revolution also upended the museum's internal hierarchy. Senior\nstaff often had politically questionable backgrounds in the pre-1949 era and were forced\nto step aside. Although junior staff lacked the expertise of senior staff they were forced\nto do best as they could. This also allowed them to gain valuable expertise that proved\nuseful when they would later take senior positions in the museum.\nAlthough the Shanghai Museum appears to have profited considerably from the\nturmoil of the Cultural Revolution it is less clear if this was true of Chinese art museums\nin general. Unfortunately, English language work on this question appears almost non\nexistent. What remains clear is that the role of art and art museums during the Cultural\nRevolution was more complex than conventionally thought. Maoist China and the Cultural\nRevolution in particular was not so much a conflict between politically minded officials\nand Red Guards on one side and artists and art museums on the other but a complete free\nfor-all. Art museums were happy to ally with Red Guards if it meant enriching their\ncollections. The state was happy to utilize knowledge of antiques and traditional Chinese\nart if it could produce foreign exchange. Artists and museum employees denounced their\nco-workers when politically expedient. Even though the Shanghai Museum maintained a\nremarkable degree of organization that greatly expanded its collection influence it was\n\nnot without large human costs for many individuals both inside and outside the museum.\nIn the final analysis, the true legacy of the Cultural Revolution is the terrible human toil\nit inflicted on Chinese citizens and intellectuals in particular. It seems that like many\nWestern art museums the provenance of the Shanghai Museum's collection is closely tied\nto violence and looting. After 1976 the Shanghai Museum faced many claims for\nrestitution which like many Western museums it only partially fulfilled.\nMuch as the CCP created the Museum of the Chinese Revolution to present its\nversion of history in recent years dissident groups in China and Hong Kong have created\ntheir own museums to remember the Cultural Revolution and the June 4th Tiananmen\nSquare Massacre. The idea for a museum dedicated to the Cultural Revolution was\ninitially conceived by Ba Jin, a famous Chinese author who was brutally persecuted\nduring the Cultural Revolution which also saw the death of his wife after she was denied\nmedical care. Although Ba was later rehabilitated he never forgot the horrors of the\nCultural Revolution and suggested the construction of a museum to ensure it was never\nrepeated. In 2005, a small private museum to the Cultural Revolution was built in\nGuangdong (Coonan). The museum contains hundreds of engravings depicting the events\nof the Cultural Revolution.\nWhile the museum dedicated to the Cultural Revolution managed to slip past the\ncensors in Mainland China the museum dedicated to June 4th had to be built in Hong\nKong. While the June 4 Memorial Museum is only 800 square feet its very existence is\ntestament to the existence of a group of citizens determined to remember June 4th. Even\nthough free speech is theoretically protected in Hong Kong there were doubts whether\n\nthe museum would be able to open after other tenants in the same building as the\nmuseum complained citing safety concerns. Allegedly Communist Party officials were\nbehind these efforts (Leung and Steinfield). A Chinese dissident living in the United\nStates was also denied entrance to Hong Kong when he attempted to attend the\nmuseum's opening. Whether the June 4 Memorial Museum will be as successful in\nshaping perceptions of China's history as the Museum of the Chinese Revolution was\nremains to be seen but reveals the politically charged nature of museums.\n\nWorks Cited\nAndrews, Julia F. \"The Art of the Cultural Revolution.\" Art in Turmoil: The Chinese\nCultural Revolution (2010): 27-57.\nCoonan, Clifford. \"China's first Cultural Revolution museum exposes Mao's war on\n'bourgeois culture'\". Independent. 21 Feb. 2006. Web. 16 May 2014.\nGalikowski, Maria. Art and Politics in China, 1949-1984. Chinese University Press, 1998.\nHawks, Shelley Drake. \"Summoning Confucius: Inside Shi Lu's Imagination\". Art in\nTurmoil: The Chinese Cultural Revolution (2010): 58-90.\nHung, Chang-Tai. \"Oil Paintings and Politics: Weaving a Heroic Tale of the Chinese\nCommunist Revolution.\" Comparative studies in society and history 49.04 (2007):\n783-814.\nHung, Chang-tai. \"The Red Line: Creating a Museum of the Chinese Revolution.\" The China\nQuarterly 184 (2005): 914-933.\nLeung, Hannah, and Jemimah Steinfeld. \"Inside the Hong Kong museum dedicated to the\nTiananmen Square massacre\". Index. May 7 2014. Web. May 16 2014.\nLu, Di Yin. \"Seizing Civilization: Antiquities in Shanghai's Custody, 1949-1996.\" (2012).\nHarvard Dissertation.\nKing, Richard, and Jan Walls. \"Introduction: Vibrant Images of a Turbulent Decade.\" Art in\nTurmoil. The Chinese Cultural Revolution (2010): 3-24.\nYongyi, Song. \"Chronology of Mass Killings during the Chinese Cultural Revolution\n(1966-1976).\" (2011).\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21W.022.03 Writing and Experience: Reading and Writing Autobiography\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "4.609 S14 Modern Authentication: An Exhibition",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-609-the-art-museum-history-theory-controversy-spring-2014/ece47f2167a56ee9128e7a3cf5376c8e_MIT4_609S14_assgn_Student_work1.pdf",
      "content": "Modern Authentication\nAn Exhibition\n4.609: The Art Museum: History, Theory, Controversy\n\nModern Authentication\nIntroduction\nSince the Romans imitated Greek sculptures, copying has been an ingrained aspect of art.\nThese early replications were born out of a desire to disseminate and educate, as burgeoning\nartists even today rely on imitating to refine their technique (Lenain, 2012). But motivations\nbegan to change during the Renaissance, when demand for art increased and suddenly art\nbecame a commodity (Savage, 1963). Art created with a deliberate intent to deceive, hereafter\ntermed forgeries, have infected the art market, with current estimates that up to 40% of art on the\ninternational market is fake (Holving, 1996).\nCombating this rise in art forgery has lead to the concurrent development of the field of\nauthentication. At the most basic level, authentication requires identification of the materials\nused, the style they were used in, and effects of time on the art. The historians, curators,\nresearchers, and art dealers who are tasked with this responsibility begin with empirical\nexamination of the materials, techniques, and condition of a given piece of artwork to attribute it\nto a specific time, place, and artist (Savage, 1963). Often this is much more difficult that it\nsounds. Although contextual information such as provenance, sociopolitical history and context,\nor a strong understanding of art history and theory can be helpful, authenticators are increasingly\nrelying on scientific techniques to identify forgeries (Aldrich, 2012).\nThis exhibition explores the parallel development of the arts of forgery and\nauthentication. Beginning with contextualization and connoisseurship as a basis to assess\nauthenticity, we then move on to more empirical and scientific analysis. Through the fifteen\nforgeries presented, each detailing a specific development in the techniques of either the forger\nor authenticator, this exhibit will call into question how forgeries have impacted the process and\n\ntechnology behind art authentication. These authentication techniques are divided into three\nrooms, which each represent a specific question posed by authenticators: What materials were\nused? How were they used? And how has the art aged?\nHistorically, authentication techniques have always been one step behind the techniques\nof forgers, and for this reason many institutions and private collectors have lost millions of\ndollars (Dolice, 2001; Arnau, 1959). With the emergence of interest in scientific\nexperimentation in the seventeenth century came the invention of techniques by intellectuals and\nalchemists to study material properties. Although these early experiments had limited tools and\nknowledge, integration of these scientific techniques with knowledge of art history provided a\nprimitive model for authentication. Later scientific developments in the twentieth century\nfurther lifted the burden off the questionable accuracy of art connoisseurship and historical\nresearch (King, 1994). These technologies developed in the twentieth century brought the ability\nto both accurately date objects and analyze their material composition. With these two\ngroundbreaking advances, the field of authentication has developed into the modern science it is\ntoday (Alrdich, 2012; Keats, 2013).\nThe authentication teams of today's most prominent international museums wield an\nintimidating arsenal of tools to detect forgery. Modern authentication techniques have revealed\nthat many works from the past two hundred years that had been accepted as authentic are indeed\nforgeries (Close Examination, National Gallery London). However, it is suspected that many\nforgeries continue to elude authentication attempts today (Wieseman, 2010; Sullivan, 2012;\nRadnoti, 1999; Keats, 2013). Indeed, this exhibit features specific works of art that are suspected\nto be forgeries, but for whom modern techniques are still not able to definitively prove whether\nthey are or not. By examining the history of art authentication through forged works that eluded\n\nand eventually changed the field, this exhibition calls into question whether it is possible for a\nforgery to deceive modern institutions.\nUnfortunately, the advances brought by scientific techniques to the filed of authentication\nare not without limit. Most often, authentication teams or individuals are limited by prohibitive\ncosts or lack of access to necessary scientific equipment. Many techniques also require the\nisolation of a sample of material from objects in question, resulting in damage. Even the\nquantitative results produced by scientific analyses can be interpreted subjectively. Mistakes in\nequipment calibration, object sampling, or human analysis can lead to as flawed a determination\nof authenticity as the imperfect fields of art historical research and contextualization (Savage,\n1963).\nIn the face of these limitations, authenticators of the twenty first century must posses the\nattributes of a good detective. A successful modern authenticator is not only an apt observer of\ndetails, and able to draw inferences upon physical and scientific examinations of an object, but is\nalso an expert with a background of both historical and technical knowledge. Modern\nauthenticators need not be specialists, but must know who the correct specialists are. The\ndifference between a specialized scientist and an art authenticator is that the scientist will be able\nto answer the question, but only the specialist will know what question to ask (Kurz, 1948;\nSavage, 1963). Perhaps the most prominent example of such a multidisciplinary team is the\nRembrandt Research Project. This Netherlandish group sought to revisit and revise the\nRembrandt oeuvre \"that in the course of time has become corrupted.\" Although disbanded in\n2011, their five volume A Corpus of Rembrandt Paintings was compiled through integration of\nart connoisseurship, historical research, and scientific analysis, and is considered the definitive\nauthority by auction houses selling Rembrandt works (Bryun, 1982).\n\nAs you browse this exhibit see if you can become this detective. As you gain familiarity\nwith the techniques used by modern authenticators, try to predict the correct questions to ask and\nhow these questions can be answered. As you observe the mutual development of forgery and\nauthentication, you will develop as a detector of forgeries in your own right. The objects\npresented herein will quickly move beyond the simple question of \"What is a forgery?\" and ask\nhow forgeries have influenced authentication and vice versa. This exhibit ultimately suggests\nthat forgeries have been a driving force behind authentication technology, but despite these\ntechnological advances, the prevalence of works with dubious authenticity suggest that modern\nauthentication techniques are still insufficient to detect all forgeries.\n\nObjects and Labels\nRoom 1: Style\nStatue of a Kouros\nUnknown, Greek, about 530 BC or modern forgery\nDespite studying this sculpture for two years before finally purchasing it in 1985, the Paul Getty\nMuseum in Malibu, California continuous to face questions over its authenticity. To this day,\ndespite tremendous advances in art authentication, neither art historians nor scientists have been\nable to completely answer questions of the kouros's authenticity. Many of these questions arise\nfrom connoisseurship of Greek sculpture, such as the fact that the marble used is an ancient\nmarble from the Island of Thasos, but use of this specific type of marble is atypical of the\nattributed time period. Tool markings on the detailed contours of the young boy match typical\nmarkings from the archaic Greek time period, but the aging of the stone seems disingenuous and\nfaked. It is also known that similar kouros statues, as well as other artifacts purchased at the\nsame time from the same art dealer, are forgeries.\n\nYoung Man and Woman in an Inn\nPossibly: Frans Hals (1582-1666), 1623\nNote the iconic FHALS monogram and 1623 date above the fireplace in the painting. Do you\nbelieve it? Modern authentication techniques are still not able to reach a consensus on the\nauthenticity of this painting; even the title of this painting is debated, assigned names such as\nYoung Man and Woman in an Inn, Yonker Ramp and His Sweetheart, or The Prodigal Son based\noff various museum catalogues and primary documents dating from Frans Hals's lifetime. Since\n1910, this painting's authenticity has been debated and continues today. Most notably, art\nhistorian Seymour Slive accepted it as a genuine Hals based on its iconographical similarity to\nHan's oeuvre, and thus came head to head with scholar Claus Grimm, who insists that it is a later\nunknown forger's copy of previous works by Han.\n\nEtruscan Sarcophagus\nIncorrect: Unknown, Sixth century BC\nCorrect: Pinellis workshop, 1863\nBefore the invent of modern scientific tools, the authentication of art relied entirely on the ability\nof connoisseurship to determine the stylistic congruity of a given piece of art. This Etruscan\nSarcophagus was proven to be a fake using only contextual discern of style. Etruscan historians\npointed out that nudity in art was unprecedented in sculptures from this time period, making the\nentirely nude man on the lid incredibly questionable. Contextualization also brought light to the\nfact that the woman beside the man is wearing underwear in the style of the nineteenth century,\nwhich is out of place in a sixth century BC sculpture. It is believed that this forgery is the work\nof the Pinellis factory, under the guidance of Marchese di Cavelli and his terracotta factory, from\n1863. The British Museum finally removed this Etruscan Sarcophagus from its collection in\n1935.\n\nPortrait of a Woman\nIncorrect: Francisco Goya (1746-1828), unknown\nCorrect: Unknown\nThe image you see is what an X-ray sees. While visible light will only illuminate the outermost\nlayer of a painting, X-rays are used to detect earlier work present under the surface of a painting.\nMany legitimate paintings are done on top of an artist's own canvas, but in certain cases X-ray\nanalysis reveals a second painting that is incongruous with the first, such as when an under\npainting shows people in 19th century clothing, when the actual painting is attributed to the\nseventeenth century. Such is the case of Portrait of a Woman, which was acquired by the Fogg\nArt Museum in 1943 through a Harvard alumnus. Goya expert FJ Sanchez-Canton and\nconservator Elizabeth Jones raised suspicion that it might be a forgery based on its modern\nsurface and oily paint. X-rays revealed a second woman, who you see in the right half of this\ncurrent painting, now hypothesized to be a Spanish provincial work of around 1790. X-ray\ndiffraction analysis revealed zinc white paint in the over painting, which was not invented until\nafter the death of Goya in 1828. Although material analysis is certainly helped, a thorough\nknowledge of art history and the context of Goya's works in the eighteenth century were\nnecessary to prove this is not an authentic Goya.\n\nWoman in Yellow\nIncorrect: Pablo Picasso (1881-1973), 1907\nCorrect: Mike Bidlo (1953-), 1987\nMany art authenticators have raised concern over the increasing ease of forging contemporary\nart. Taken to the extreme, George Savage in his textbook Forgeries, Fakes, and Reproductions\nstates that, \"In a good deal of modern painting the element of craftsmanship is largely absent.\nWork of the kind is hardly to be taken seriously; neither, for that matter, are those who buy it ...\nAn art which can be forged with practically no risk of detection is worthless.\" Presented here is\na second-rate forgery of Woman in Yellow, originally by Pablo Picasso, which demonstrates that\nat least some contemporary art retains enough of a stylistic identity to be distinguished from\ninauthentic forgery by connoisseurship alone. This forgery is quickly distinguishable; although\nthe painting resembles the original, note its sterility and lack of manipulation of light and\nshadow, which is found in Picasso's original. The forger, Mike Bidlo, has constructed a\nlucrative and controversial career of painting \"genuine fakes\" of renowned works of art.\nNevertheless, individual styles that are near impossible for forgers to imitate with high fidelity\npersist, as evidenced in the works of Picasso.\n\nAmarna Princess\nIncorrect: Unknown, 1350 BC\nCorrect: Shaun Greenhalgh (1961-), 2000s\nMuseums do not go out of their way to identify forgeries within their collection. Often times,\nthese forgeries are only identified due to extraneous circumstances, as is the case with this statue,\npurported to be of the daughters of the Pharoah Akhenaten and Queen Nefertiti, probable father\nand stepmother of Tutankhamun. The Bolton Museum purchased the statue in 2003, after\nconsultation with the Christie's Auction House and the British Museum, who both confirmed its\nauthenticity. The basis for this authentication was the provenance of the sculpture and its\nresemblance with a similar statue of an Egyptian princess in the Louvre. The authenticity of the\nAmarna Princess was not called into question again until March 2006, when Scotland Yard's Art\nand Antiquities Unit impounded the sculpture as part of an ongoing investigation of the\nGreenhalgh family. Shaun Greenhalgh and his father were caught selling a forged Assyrian\nfrieze, using the same forged provenance they provided when selling the Amarna Princess. This\nability to deceive even the largest art institutions and auction houses of today, using only\nprovenance and stylistic contextualization nonetheless, demonstrates that despite advances in\ntechnology, forgers are still ahead of authenticators.\n\nRoom 2: Materials\nThe Madonna with the Iris\nIncorrect: Albrecht Durer (1471-1528), about 1508\nCorrect: Durer's workshop, 1500-1750\nAlthough the monogram and date to the left of the Virgin's head attribute this painting to\nAlbrecht Durer in 1508, scientific analysis of the materials used have demonstrated that both of\nthese claims are false. In 1959, curator Michael Levey used contextual knowledge and\nconnoisseurship of Durer's works to raise concern of the painting's legitimacy. Levey was\nconcerned that the painting combined multiple motifs from different Durer paintings from\ndifferent time periods in Durer's career, such as the Iris. In 1996, infrared spectrograph revealed\nseveral odd findings regarding the underdrawn pencil sketch: the virgin and child were\nunderdrawn, the iris was underdrawn but altered, there was a rose underdrawn to the right of the\nVirgin's head that was not included, and the wall to the left of virgin not underdrawn. These\ndifferent approaches to the underdrawing and setting raised suspicion that more than one artist\nworked on the painting. Later crossectional and material analyses revealed that the overpaint\nvarnish over the monogram (which dated the painting to 1508) had manila copal, which was only\navailable in the 1750s, and the date itself was painted with lead tin yellow, which stopped being\nused in 1730s. Fourier transform IR microscopy (FTIR) and gas chromatography mass\nspectrometry (GCMS) revealed that the earliest varnish layer contained sandarac, which was\nmostly used in the sixteenth century. These findings suggest that the painting was painted by\nmultiple artists inspired by Durer, and was later retouched with varnish and a Durer autograph\nand date in the early eighteenth century in an attempt to deceive buyers into believing it was an\nauthentic Durer.\n\nBuckingham Jars\nPossibly: unknown, c. 1660\nThese jars were discovered in 1981 in the collections of Burghley House in Lincolnshire, and\ninside them a scrap of paper with the inscription \"Duke of Buckinhams China\" sparked interest\nin the miniature vases. Porcelain was unfamiliar in the west during this time period (prior to\n1683), so of principal concern was analysis of the jar's composition. Material analysis was\nespecially necessary to rule out the possibility that the jars were made of opacified glass, because\nenameling on glass was unheard of in the seventeenth century. X-ray fluorescence and X-ray\ndiffraction performed by the British Museum Research Lab concluded that the jars were made of\nporcelain, and the glaze contained lead, suggesting the vases were not of oriental origin because\nlead was not used in China or Japan during this time period. Additionally, lack of the crystalline\nstructure mullite on the vase lids suggested that they were not produced in the Far East. In 2007,\nscanning electron micscopy of the body paste and glaze revealed the presence of potassium, iron,\nlead, and calcium, which all indicated that the jars were made of hard-paste porcelain. These\nfindings call into question the significance of the then-believed first instance of European\nproduction of hard-paste porcelain, attributed to Ehrenfried Walther von Tschirnhaus and Johann\nFriedrich Bottger in 1709. Are these vases evidence for European porcelain production that pre\ndates the currently accepted theory by twenty-five years and in an entirely different country?\nWhatever your conviction, these jars and scientific analysis of their materials demonstrate the\npotential of modern authentication to alter accepted art historical knowledge.\n\nLa Bella Principessa\nPossibly: Leonardo da Vinci (1452-1519), 1495\nOr: Unknown, 19th century\nModern authentication is still unable to conclusively determine whether this painting was done\nby Leonardo da Vinci, which would increase its value from $21,850 to $150 million. Chemical\nanalysis of its pigments and vellum date these materials to between 1440 and 1650, which\ninitially raised suspicion of its original attribution to an artist of the early 19th century German\nschool. Leonardo da Vinci scholar Martin Kemp analyzed the painting's composition,\niconography and pigments, and claimed in 2009 that it was an authentic Leonardo da Vinci\nportrait of a member the Sforza family. Kemp cited left-handed hatching present in the figure's\ndetails, multispectral imaging analysis that allowed for more detailed pigment analysis, and a\nfingerprint found in the upper left corner of the painting that resembled a fingerprint found on\nLeonardo's St Jerome in the Vatican. However, to this day the authentication of La Bella\nPrincipessa has not achieved consensus from the majority of Leonardo experts, and despite the\nmaterial evidence generated by scientific examination, most experts remain unconvinced that this\nis sufficient to attribute the painting to the great master.\n\nPortrait Group\nIncorrect: Italian, 15th century\nCorrect: Unknown, early 20th century\nTime breeds innovation. Although suspicion over the legitimacy of this painting first arose in\n1924, its inauthenticity was not officially recognized by the National Gallery London until 1996.\nOnly through scientific developments in art authentication did suspicions over its accuracy gain\nsufficient evidence to declare it a forgery. This portrait was acquired by the National Gallery in\n1923, and attributed to an unknown 15th century artist, possibly affiliated with Melozzo da Forli\n(1438-1494). Perhaps it is a portrait of the Montefeltro family, as suggested by the armorial\nbadge in the upper right. Following early suspicions of its authenticity in 1924, AH Buttery\nexamined the painting by applying heat and a solvent, neither of which disturbed the varnish,\nleading him to claim its authenticity. But by 1951, curator Martin Davies once again raised\ndoubts, stating that the aesthetic style appeared to be modern. In the 1960s, historian Stella Mary\nNewton raised questions over the painting's historical accuracy, concluding that the woman's hat\nwas based off of a 1913 fashion trend. Art connoisseurship knowledge also brought light to the\nfact that the supposed fifteenth century painting had too much linearity and definition for its time\nperiod. Finally, tests done using contemporary scientific analysis after the investigation was\nreopened in 1996 conclusively demonstrated that this painting could not have been made in the\nfifteenth century: Cross-sectional analysis revealed that tinted glue and varnish were used to give\nthe painting a brownish tonality, thereby aging it. Shellac was used create faux craquelure,\nresembling genuine aging, due to its ability to contract as it dries. Most convincingly, scanning\nelectron microscope energy dispersive x ray (SEM-EDX) identified the pigments cobalt blue,\n\ncadmium yellow, virdian, and chrome yellow, none of which were available before the 19th\ncentury.\n\nRoom 3: Age\nVenice: Entrance to the Cannaregio\nPossibly: Francesco Guardi (1712-1793), 18th century\nOr: 19th century imitator\nModern pigment analysis is one of most conclusive tools employed to determine the age of a\npainting. In the eighteenth century, the popularity of Venetian view painters inspired an eruption\nof imitations that have seeped into collections throughout Europe as souvenirs from the Grand\nTour. Consequently, this painting - initially attributed to Francesco Guardi - sparked\ninvestigation since its original purchase in 1879. Art historians and critics alike have argued that\nthe detail in the sky and buildings are suggestive of a \"lesser skill of another hand\". The figures\nin the foreground also lack Guardi's \"griffe endiablee\", or furious touch, a notorious aspect of\nGuardi's more impressionistic brushwork. However, a 1955 pigment analysis claimed that this\npainting was definitely an imitiation, after paint sampling of the foreground found the presence\nof Thenard's blue, a man-made pigment discovered in 1804. However, a follow up pigment\nanalysis in 2009 yielded more specific results. Sampling of the blue coat on the man in the\ngroup at the far left, and the dress of woman near the second group from them left, found the\npresence of the Prussian blue pigment mixed with lead white and earth pigments, which were\nindeed available before and during Guardi's lifetime. Cross-sectional analysis of the blue jacket\nfrom the figure furthest left revealed the presence of a distinct surface layer, and elemental\nanalysis by scanning electron microscope energy dispersive x ray (SEM-EDX) identified the\npigment Thenard's blue in this later surface layer. These modern findings suggest that the earlier\npigment analysis is invalid, and there is no longer definitive evidence that this painting was made\nafter 1804, although its authenticity still remains in question.\n\nEdzard the Great, Count of East Friesland\nIncorrect: Jacob Cornelisz van Oostanen (1470-1533), 1517\nCorrect: German, 18th century\nThe study perhaps most often employed to definitively date paintings is dendrochronology, or\nthe study of wood and its ring patterns to date panels. Although not necessarily a malicious\nforgery, Edward the Great, Count of East Friesland and related dating provided insight into the\nhistory of this painting both in the aesthetic art world and historical sociopolitical contexts.\nAlthough originally attributed to the Dutch painter Jacob Cornelisz van Oostanen and painted\nwhen Count Edzard travelled through the Netherlands in 1517, logistically it is more likely that\nCount Edzard was painted locally in Germany. In 1993, dendrochronoligical analysis of the\nwood panel's growth rings revealed that the earliest possible date of the painting was 1704.\nPigment analysis corroborated this dating, finding pigments from the greenish background that\nwere only available since 1704. Other eighteenth century portraits of East Friesland counts have\narisen, suggesting that the end of the Cirksena dynasty in 1744 triggered a wave of nationwide\nnostalgic sentiments, represented by these portraits that emerged in the eighteenth century.\n\nThe Virgin and Child with an Angel\nIncorrect: Francesco Francia (1450-1517), 1490\nCorrect: Unknown, late 19th century\nIf it were not for an identical painting that went up for auction in 1955, this fake might still be\nhanging in the National Gallery London, which prized it as one of Francia's earliest known\nworks. After being acquired by the National Gallery in 1924, The Virgin and Child with an\nAngel was touted as authentic without any question. When an identical painting surfaced, this\nimmediately changed. In 1995, photomicrograph showed fake craquelure that had been painted\non in order to make the painting appear older. This is especially noticeable on the child's right\narm. Other photomicrographs showed graphite pencil around areas of detail, which was not\ncommon of Renaissance paintings, but used commonly in the 19th century. These graphite\nmarkings can even been seen with the naked eye, if one looks closely at the curls in the Angel's\nhair. These findings definitely pointed suspicion towards the National Gallery painting, but its\ninauthenticity was not confirmed until later developments in authentication technology. In 2009,\nX-rays revealed that wormholes in the wood backing had been filled with an unknown material,\na common technique used to make paintings look older. Infrared reflectogram analysis revealed\ngraphite pencil underdrawing that was incredibly detailed, which is not typical of Renaissance\nera paintings, while the Pittsburgh painting had a brush underdrawing, which was less detailed\nand not followed in the actual painting with absolute fidelity. High-pressure liquid\nchromatography (HPLC) analysis of the red curtain in the background found red lake and\nchrome yellow pigments, which weren't available until after 1818. Ultimately, this nineteenth\ncentury forger's downfall was his efforts to meet the need of making this 100-year-old painting\nseem 500 years old.\n\nMadonna of the Veil\nIncorrect: Sandro Botticelli (1445-1510), unknown\nCorrect: Umberto Giunti, 1920-1929\nOnly through advancements in scientific analysis of false aging was this painting, originally\nattributed to Sandro Botticelli, conclusively demonstrated to be the work of Umberto Giunti.\nWhen this painting appeared on the art market in the 1930s, art critics and academics praised the\nwork as an authentic masterpiece. However, conservation treatments in the 1940s revealed that\nthe blue robe worn by the Madonna uses Prussian blue, a pigment only available after the\neighteenth century. Magnification revealed the pigment grains to be fine and possibly machine-\nground, uncharacteristic of fifteenth century pigments which had coarser grains. In 1994, energy\ndispersive X-ray analysis revealed the use of oxide green, a pigment that was not available until\nafter 1862. Material analysis also revealed inconsistencies with Boticelli's oeuvre: X-rays\nrevealed that the wooden panel was prepared uncharacteristically, and photomicrograph analysis\nof the Madonna's lips were painted with black, not Boticelli's characteristic madder lake\npigment. Analysis also revealed that Umberto Giunti employed a number of techniques to\nfalsely age the painting: surface craquelure and paint losses suggest intentional damage, worm\nholes in the panel bear stress fractures indicative of a mechanical drill, and an umber pigment\nwas used to create discoloration in the green foliage behind the Madonna, mimicking an aging\neffect typical in fifteenth century painting.\n\nChrist and the Disciples at Emmaus\nIncorrect: Johannes Vermeer (1632-1675), unknown\nCorrect: Han van Meegeren (1889-1947), 1936\nThe impetus to investigate art for forgeries is often time nonexistent, and this painting would\nlikely still be attributed to Johannes Vermeer if not for the coincidence of the arrest of its forger\nHan van Meegeren. Now one of the world's most infamous art forgers, van Meegeren is known\nto have forged hundreds of works attributed to Frans Hals, Pieter de Hooch, Gerard ter Borch,\nand Johannes Vermeer, some of which are still unknown, collectively costing more than $30\nmillion. In 1945 van Meegeren was arrested after The Woman Taken in Adultery, a work he had\nsold, was found in the possession of Reicheshmarschall Hermann Goring, and he was accused of\ncollaborating with the Nazis, a crime punishable by death. Fearing his life, van Meegeren\nadmitted to forging The Woman Taken in Adultery, along with other Vermeers including Christ\nand the Disciples at Emmaus. This confession, along with dating of the canvas using wood\nanalysis such as annual ring count and wormholes, lead to the exposure of this forgery.\n\nBibliography\nA. Roy and G. Mancini, '\"The Virgin and Child with an Angel\", after Francia: A history of\nerror', 'The National Gallery Technical Bulletin' 31, 2010, pp. 64-77\nAckroyd P., Foister S., Spring M., White R. and Billinge R., 'A Virgin and Child from the\nWorkshop of Albrecht Durer?', 'The National Gallery Technical Bulletin' 21, 2000, pp.\n28-42\nAldrich, J. H.-J., with essays by Megan Aldrich, David Bellingham, Jonathan Clancy, Lis Darby,\nNatasha Degan, Anthony Downey, Sophie von der Golst, Jos Hackforth-Jones, Barbara\nLasic, Noel Riley, Bernard Vere, Morgan Wesley Megan. (2012). Art and Authenticity.\nFarnham; Burlington, Vt.; London; New York: Lund Humphries.\nArnau, Frank. The Art of The Faker - 3,000 years of Deception. Boston, Little Brown &\nCompany, 1959. LCCN: 61-5317.\nArts: Legit art or forgery? Tough to tell at times. (n.d.). WacoTrib.com. Retrieved April 25,\n2014, from http://www.wacotrib.com/entertainment/accesswaco/david_a_smith/arts\nlegit-art-or-forgery-tough-to-tell-at-times/article_2d22b2e3-54c0-5977-b43a\n96c5420f8d70.html\nBruyn J., Haak B., Levie SH., van Thiel P.J.J., Cook-Radmore D., and Peese Binkhorst-\nHoffscholte L. (1982). A Corpus of Rembrandt Paintings: 1625-1631 (The Hague ;\nBoston : Hingham, MA: Springer).\nColin, Ralph F., Dudley T. Easby, Jr., Carmen Gomez-Moreno, Thomas P. F. Hoving, Clare Le\nCorbeiller, Louis J. Lefkowitz, Joseph V. Noble, and Theodore Rousseau. \"Art Forgery\":\nThe Metropolitan Museum of Art Bulletin, v. 26, no. 6 (February, 1968)\nDolice, JL. A History of Art Forgery (2001). Mystudios.com. Retrieved April 25, 2014, from\nhttp://www.mystudios.com/gallery/forgery/history/forgery-1.html\nDutton, D. (n.d.). Forgery. Encyclopedia of Aesthetics.\nFoister S., 'Durer and the Virgin in the Garden', exh. cat., The National Gallery, London 2004,\nesp. pp. 24-8\nGopnik, B. (2013, November 2). In Praise of Art Forgeries. The New York Times. Retrieved from\nhttp://www.nytimes.com/2013/11/03/opinion/sunday/in-praise-of-art-forgeries.html\nHolving T. (1996) False Impressions: The Hunt for Big-Time Art Fakes. Simon & Schuster.\nIntroductory Essay | Art Forgery: A Crime on the Rise? (n.d.). Retrieved from\nhttp://www.intenttodeceive.org/about/art-forgery-a-crime-on-the-rise/\nJones M. with Craddock P. and Barker N. (eds), 'Fake? The Art of Deception', exh. cat., British\nMuseum, London 1990, pp. 34-5, no. 7\nKeats, J. (2013). Forged: Why Fakes are the Great Art of Our Age. New York, NY: Oxford\nUniversity Press, USA.\nKing A., 'An Evaluation of Selected Methods of Technical Examination in the Detection of\nForgeries', Research Project, Department of Conservation and Technology, Courtauld\nInstitute of Art, London, 1994, pp. 8-13\nKurz, Otto. Fakes - A Handbook for Collectors and Students. New Haven; Yale University Press\nLenain, T. (2012). Art Forgery: The History of a Modern Obsession. London: Reaktion Books.\nLevey M, 'National Gallery Catalogues. The Seventeenth and Eighteenth Century Italian\nSchools', second edn, London 1986, p. 140\nOwen R., 'Duped art experts praise a master forger', 'The Times', 29 June 2004\nPhillips, D. (n.d.). Forgery. Grove Art Online.\n\nRadnoti, S., & Dunai, E. (1999). The Fake: Forgery and Its Place in Art. Lanham: Rowman &\nLittlefield Publishers.\nSavage, G. (1963). Forgeries, Fakes, and Reproductions. Praeger.\nSullivan, P. (2012, March 2). How to Avoid Forgeries When Buying Fine Art. The New York\nTimes. Retrieved from http://www.nytimes.com/2012/03/03/your-money/is-that-a-real\nmotherwell-better-make-sure-before-buying.html\nWednesday, S. P. S. W., 19, F., & 2014. (n.d.). Can you spot the fake? Springfield Museums\nexhibit examines widespread problem of forged paintings, drawings. GazetteNet.com.\nRetrieved April 25, 2014, from\nhttp://www.gazettenet.com/artsentertainment/artstheaterdance/10628617-95/can-you\nspot-the-fake-springfield-museums-exhibit-examines-widespread-problem-of-forged\npaintings\nWieseman M.E., 'A Closer Look: Deceptions and Discoveries', London 2010, pp. 39-41\nWilson M., 'If the Paintings Could Talk', London 2008, p. 57\n\nModern Authen4ca4on\n\nRoom 1\nStyle\n\nRoom 2\nMaterials\n\nRoom 3\nAge\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21W.022.03 Writing and Experience: Reading and Writing Autobiography\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "4.609 S14 The Founding of the MFA: Myths and Realities",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-609-the-art-museum-history-theory-controversy-spring-2014/dd0f50a42539a84bc742a86190b804d4_MIT4_609S14_assgn_Student_work2.pdf",
      "content": "The Boston Museum of Fine Arts (MFA), one of the first major museums in the\nThe Founding of the MFA: Myths and Realities\nUnited States, was an ambitious undertaking. The committee that formed the museum\nwanted to create an educational institution that would cause Americans to develop a taste\nfor the fine arts1. Critics objected to the museum's eclectic collection and accused the\nmuseum of simply being an imitation of European museums.2 I want to look at the myths\nsurrounding the formation of the Boston MFA, that is, the myths born out of criticism by\nAmericans and Europeans alike. In re-‐evaluating these myths in terms of America's cultural\nclimate and the practical limitations of creating a new museum in Boston, I argue that we\ncan understand the formation of the MFA as the start of a unique and American institution.\nI then re-‐evaluate the situation surrounding the museum boom in Abu Dhabi using the\nMFA's history as a lens through which to view the Abu Dhabi museums as unique to their\nregion and time.\nThe Boston MFA was one of the first large museum institutions created in the United\nStates. Although there had been previous attempts to create large museums in America,\nduring the 1870s there was a unique set of circumstances that led to the founding of\n\n8.\nPerkins, C\nJSTOR.\nharles C. \"American Art Museums.\" The North American Review\n111.228 (1870):\nArts.\"\nHirayama, H\nThe Boston Athenaeum: Bicentennial Essays\nina. \"The Boston Athenaeum and the C\n. Ed. Richar\nreation of Boston's Museum of Fine\nAthenaeum, 2009: 263.\nd Wendorf. Boston, MA: Boston\n\nmuseums in New York, Washington, and Boston3. At this time in Boston, there were\nmultiple institutions that needed more space to house their growing collections of art.\nSpecifically, Harvard, MIT, and the Boston Athenaeum were acquiring new collections but\nlacked the facilities to display them. Charles C. Perkins, a Boston intellectual, was\ninstrumental in the creation of the MFA. Perkins was a theorist and a member of Boston's\nelite 'Brahmin' class, so was in a perfect position to organize and execute this endeavor. He\nwas also the brother of Edward N. Perkins, the head of the Fine Arts Committee at the\nBoston Athenaeum. The Boston Athenaeum's Fine Arts Committee, while often incorrectly\nconsidered to provide the 'nucleus' of the MFA's first collection4 nevertheless contributed a\ngreat deal of resources to the founding of the MFA. The Athenaeum was both a library and a\nfine arts gallery, but the Library Committee and the Fine Arts Committee were constantly\nvying for space and money. As the library started to receive more resources, it was difficult\nfor the Fine Arts Committee to continue supporting the arts: \"The Fine Arts Committee was\nleft with this difficult task, while its independence and power--and even its true\ninstitutional affiliation and system of support--remained highly ambiguous.5\" In order to\ncontinue its mission of contributing to the appreciation of the fine arts in Boston, the Fine\nArts Committee became more involved with the formation of a citywide institution. They\ndonated space and pieces of art to the early museum exhibitions that occurred before the\n\nAmerican Association of Museums, 1939:\nColeman, Lawrence Vail.\n. Vol. 1. Washington:\nArts.\"\nHirayama, H\nThe Boston Athenaeum: Bicentennial Essays\nina. \"The Boston Athenaeum and the C\nThe Museum in America: A Critical Stu\n17.\nreation of Boston's Museum of Fine\ndy\nAthenaeum, 2009: 231.\n. Ed. Richard Wendorf. Boston, MA: Boston\nIbid., 235.\n\nmuseum had a permanent building6. The early MFA also collaborated with the newly\nformed MIT architecture department, which had a large collection of plaster casts. When\nthe MFA was founded in 1870, the trustees included three members of the Athenaeum,\nthree people from MIT, and three from Harvard. Charles Perkins, who served as honorary\ndirector under president Martin Brimmer during the early years of the MFA, had a hand in\nmost major decisions including the work that the museum acquired and showed. Perkins\nbelieved that the increase in public appreciation of art could \"only be done by the\norganization of comprehensive museums, which will raise the standard of taste, furnish\nmaterials for study to artists and archaeologists, affect industry, and provide places of\nresort for the general public where amusement and unconscious instruction will be\ncombined.\"7 He used this philosophy to shape the MFA as an educational institution\nmodeled after the South Kensington Museum in England.\nWhen the museum was founded, its three goals were to (1) make the art in Boston\navailable to the public, (2) develop a comprehensive museum, and (3) instruct people in\nthe studio arts. In order to accomplish these goals, the committee started hosting\nexhibitions in the Athenaeum's building with loaned art from the Athenaeum, MIT, and\nHarvard. Eventually they amassed enough of a collection through donations and loans to\nmove into a larger space--a 'terra-‐cotta Gothic structure'8 in Back Bay designed by\narchitects Sturgis and Brigham. The early MFA did not have many funds and spent their\n\nArts.\"\nHirayama, H\nThe Boston Athenaeum: Bicentennial Essays\nina. \"The Boston Athenaeum and the C\n. Ed. Richar\nreation of Boston's Museum of Fine\nAthenaeum, 2009.\nd Wendorf. Boston, MA: Boston\n5.\nPerkins, C\nJSTOR.\nharles C. \"American Art Museums.\" The North American Review\nMuseum of Fine Arts, Boston: A Centennial History\n111.228 (1870):\nC\n\nambridge, MA: Belknap, 1970.\nWhitehill, Walter Muir.\n16.\n. Vol. 1.\n\nmoney on securing reproductions of famous works and trying to amass enough of a\ncomprehensive collection to present an overview of global artistic history. Unlike their\nEuropean counterparts, they did not own all of the works, and relied heavily on loans and\ndonations from wealthy collectors. Among the original body of work displayed at the 1876\nMFA (when they moved into the Back Bay building) were paintings by Gilbert Stuart,\nThomas Crawford, Washington Allston, Joseph Duplessis, and Joseph William Turner,\nplaster casts lent by the Athenaeum, Egyptian sculptures, artifacts from the Cesnola\ncollection of Cyprus antiquities, various tapestries and pottery, Japanese artifacts, examples\nof German and Venetian glass, photographs of old master drawings, carved wood, and\nprints lent by Harvard University9. With the new space in Back Bay and a rise in donations,\nthe MFA was able to realize its goal of having a school for studio art. Previously, Boston had\nnot had an art school on the level of New York and Philadelphia's10 and the main mode for\nteaching art to young Americans was to send them to Europe to learn: \"It was out of the\nquestion for anyone who wished to study art seriously to remain in Boston, if he could\nafford to cross the Atlantic.\"11 Art education was not considered necessary in American\nsociety: \"The artist was popularly supposed to be an ins\npired being, needing only his\ninspiration, depending solely on the 'Divine Afflatus.'\"\nAs a new institution, the MFA was not safe from critics, both from America and\nEurope. American museums were seen as trying to catch up to the 'great museums\n\nIbid\nPeirce, H. W\n., 27-‐37.\n. Boston: T.O. Metcalf, 1930.\ninthrop.\nC\nambridge, MA: Belknap, 1970.\nWhitehill, Walter Mui\nThe History of the School of the Museum of t\nr. Museum of Fine Arts, Boston: A Centennial History\n12.\nhe Arts, Boston 1877\n42.\n. Vol. 1.\n-‐\nPeirce, H. W\n. Boston: T.O. Metcalf, 1930: 15.\ninthrop. The History of the School of the Museum of the Arts, Bo\n\nston 1877-‐\n\nabroad.'13 Even as early as 1816, Americans were fighting to convince the world that they\nwere capable of possessing 'taste.'14 Instead of considering America as a separate entity, it\nwas viewed as the daughter of England, and could owe its successes to that fact.15 However,\ndespite it\ns European heritage, it was believed that culture would never take root in\nAmerica. Such criticism suggests that an art museum was necessary and yet doomed to\nfail in the eyes of critics. Hira Hirayama summarizes the criticism of the MFA as \"a variety\nof perceived faults: that it was a mausoleum of accumulated family wealth; that the\nfounders imposed European notions of art on native taste; that the museum\ninstitutionalized the hierarchical distinctions between high and popular cultures; and that\nthe museum movement in general was a quintessential manifestation of the vulgar, Gilded\nAge worship of money and consumption.\"17 Critics were also skeptical that an art museum\nwould ever succeed in America without any works by old masters or the means to secure\nthem.18 To complicate the lack of original artwork in America, Parisians were resistant to\nAmericans legally buying French artwork, because they felt that Americans were unable to\nunderstand it properly.19 The irony in this situation was noted in 1887: \"While the\nstandard of art is higher in France than in America, what better means could Americans\n\nAmerican Association of Museums, 1939: 18.\nColeman, Laurence Vail. The Museum in America: A Critical Study\n. Vol. 1. Washington:\nReview\n\"For the North-‐American Journal. Institution for the Fine Arts.\"\n\"The Americans, in Their Moral, Social, and Political Relations by Francis J. Grund\nand Miscellaneous Journal\nNorth American Review\n2.5 (1816): 153-‐64. JSTOR.\nThe North-‐American\n\"A Frenchman's \"Coup D'Oeil\" of American Art.\"\n46.98 (1838): 111. JSTOR.\nH\nThe Boston Athenaeum: Bicentennial Essays\n5.1\n.\"\nirayama, Hina. \"The Boston Athenaeum and the C\nThe Crayon\nreation of Boston's Museum of Fine\n(1858): 11. JSTOR.\nThe\nArts.\"\nAthenaeum, 2009: 263.\n. Ed. Richard Wendorf. Boston, MA: Boston\nConnoisseur\nSouth, Erastus. \"An Art-‐\nDurand-‐Greville, E. \"Priva\nMusee in America.\"\n2.2 (1887): 90. J\nt\nSTOR.\ne Picture-‐Galleries of the United States. First Article.\"\nThe Aldine 5.6 (1872): 127. JSTOR.\n\nThe\n\nemploy to elevate their taste than to lavish their money upon French art works?\"20\nAdditionally, a Frenchman visiting America felt that the galleries in New York (which were\nrepresentative of galleries elsewhere) were too 'eclectic.'21 This criticism suggests cultural\nelitism by Europeans who gave authority to the established museums in Europe. While\nthere is certainly merit to these arguments, I want to specifically tackle the notion that\nmuseums in America were doomed due to lack of funds or taste. Through the efforts of\nCharles Perkins and the early museum committee, I believe the MFA was able to carve a\nniche as a new kind of museum, and a uniquely American institution.\nI intend to re-‐evaluate the criticism of American museums by examining the\npractical impetuses for the museum's decisions. One criticism was that American museums\nwere lesser imitations of European museums, and that they focused too heavily on\ndisplaying European goods. Kouwenhoven suggests that even though the museum was\nintended to assist industrial design, it was all just part of the \"tradition which had\ndedicated itself to persuading the Americans that they were a 'raw and noisy and obtrusive\npeople' who could be saved only by placing themselves under the influence of the past and\nreverently studying specimens of the arts of luxury from Europe.\"22 Let us first tackle this\ncriticism by examining in what ways the MFA was modeled after European tradition,\nspecifically the South Kensington Museum.23 Hirayama summarizes the founding principles\nand influences of the MFA:\n\n20 Durand-‐Greville, E. \"Private Picture-‐Galleries of the United States. First Article.\" The\nConnoisseur\n2.2 (1887): 90. JSTOR.\nNY\nKouwenhoven, John Atlee.\nIbid., 96.\n\nPerkins, C\n: Doubleda\n(1870): 1\nharles C\ny, 1948: 115.\nMade in America; the Arts in Modern Civilization. Garden City,\n5. JSTOR.\n. \"American Art Museums.\" The North American Review 111.228\n\nInstead of being a mere extension of the Athenaeum, the\nbecome, in Charles Perkins's view, a didactic museum with illustrative collections\nnew institution was to\nand an art school. The proposed museum was to be committed to the cultivation of\npublic taste for the ultimate improvement of industrial design, operating not like the\nLou\nMuseum.\nvre or\nLon\n\ndon's National Gallery but exactly like the South Kensington\nIn order to cultivate industrial design, Perkins convinced the museum to show many\ndecorative objects and plaster casts. The museum even purchased a large set of Italian\nartifacts from Castellani, an Italian dealer, in 1880.25 As a final example of the South\nKensington influence, the architects modeled the original Back Bay building after the gothic\nstyle emulated in the South Kensington Museum.26 Despite these similarities, and the fact\nthat there were many European works shown in the museum, there were many factors to\nsuggest that the MFA did not completely imitate the South Kensington Museum.\nThe United States was very different from Europe. Perkins recognized that the lack\nof central authority in America made it more difficult to suddenly create a new museum. In\nspeaking of Europeans, he claims \"They do not recognize that we are called upon to solve a\nnew problem, and to discover some way of overcoming the obstacles which are created by\nour position.\"27 Without any princely galleries to begin with, the founders of the MFA had\nto look to local institutions for support and to loan them their collections.28 As the\ncommittee began plans for the MFA before they had a dedicated collection, Perkins urged\nBo\n\nston to be patient a\n\nnd focu\n\ns on building a collection before constructing a physical\nArts.\"\nHirayama, H\nThe Boston Athenaeum: Bicentennial Essays\nina. \"The Boston Athenaeum and the C\n. Ed. Richar\nreation of Boston's Museum of Fine\nAthenaeum, 2009: 241\nd Wendorf. Boston, MA: Boston\nC\nambridge, MA: Belknap, 1970: 25.\n\nIbid., 253.\n.\nWhitehill, Walter Muir.\n. Vol. 1.\n(1870):\nPerkins, Charles C. \"American Art Museums.\"\nMuseum of Fine Arts, Boston: A Centennial History\n26.\n111.228\nIbid., 27.\nJSTOR.\nThe North American Review\n\nbuilding. They followed his advice, and it took six years from incorporation before the MFA\nplaced the artwork in the Back Bay establishment.\nAmerica also had a unique social situation that led to the creation of multiple\nmuseums in 1870. After the Civil War there was a period of\nprosperity in the northern\nUnited States, which led to an increased interest in culture. Judith Blau claims that\n\"Typically, the impetus for establishing a museum comes from a civic association composed\nof a broad segment of city notables--wealthy entrepreneurs, collectors, civic leaders, along\nwith educators and artists--and this pattern has been fairly persistent over time.\"30 These\nfactors resulted in more American collectors, and allowed for the formation of a committee\nof notables willing to devote the time to creating an artistic institution in Boston. Unlike the\nroyal art collections in Europe that served as basis for many European museums,\nAmericans created their own cultural environment through individual collection and a\ncommitment to donating to these public institutions. As a result, some including Lewis\nMumford have argued that \"by the patronage of the museums the ruling metropolitan\noligarchy of financiers and officeholders establish their own claims to culture: more than\nthat they fix their own standards of taste, morals and learning as that of their civilization.\"31\nThis would suggest that the museum committee was beholden to their patrons, and that\njust like these new collectors, they were trying to fill their walls with anything that seemed\n'cultured.' Neil Harris argues that despite the collecting activity of these nouveaux riches,\nIt was not a matter of trying to force V\ncountrymen who reveled in plain design and bright colors, but rather to stem the\nictorian standards down the throats of\n\ntide of 'indifferent' European paintings and designs which were flooding America, to\n\n(1991):\nBlau, Judith R. \"The Disjunctive H\nistory of U.S. Museums, 1869-‐1980.\"\n70.1\n\nMumford, Lewis.\nIbid., 89.\n.\n\nJSTOR.\nSocial Forces\nThe Culture of Cities. New York: Harcourt Brace, 1938: 32.\n\nproduce an 'educated public' with an appreciates of artistic meaning and purpose.\nThis was the museum's function.32\nTo support this view, the collections were not composed of only European goods. Harris\nsuggests that the prominence given to \"Asiatic and Near Eastern designs in the Boston\nCollection, and to handicrafts and household wares, seems to belie the charge that the\nfounders adhered rigidly to European traditions of gentility.\"33\nAdditionally, Americans were impatient to increase the cultural appreciation in\nBoston, which prior to the MFA \"was essentially a Puritan town, and with all its virtues, the\nEnglish Puritan Reformation had been an anti-‐art movement from the time when Cromwell\nsmashed church windows and knocked off the heads of gothic saints.\"34 Art museums were\nrecognized by many as a tool for elevating American\nartistic taste to keep up with their\nsuccesses in manufacturing and social order. The impatience is evident in how the MFA\nmoved quickly to host exhibitions in temporary galleries before their permanent building\nwas constructed. Those outside of the United States also recognized that it would not be\nlong before Americans would want to enter the art world. According to the Chronique des\nArts, 'The day cannot be far distant... when the United States will desire to form collections,\nfor it is impossible to admit that so intelligent a people can long continue to ignore the fact\nthat the fine arts make men moral by raising them to a comprehension of the beautiful, and\nthat they increase the wealth of nations by developing good taste in their artisans.'\"36 In the\n\n32 Harris, Neil. \"The Gilded Age Revisited: Boston and the Museum Movement.\" American\nQuarterly\n14.4 (1962): 561: JSTOR.\n\nPeirce, H. W\nIbid\nH\n.\n\n. Boston: T.O. Metcalf, 1930: 11.\ninthrop.\nale, Edward E. \"Fine Art in Massachusetts.\"\nThe History of the School of the Museum of the Arts, Boston 1877\n\nPerkins, Charles C. \"American Art Museums.\"\nThe Art Review\nThe North American Review\n1.3 (1871): 2.\n111.228\nJSTOR.\n-‐\n(1870): 25. JSTOR.\n\nsame publication, it urged France to purchase French masterpieces before American\ninstitutions took them. The desire for greater cultural affinity in America was one of the\nfounding theoretical impetuses for the creation of the MFA, and led the committee to focus\non creating a didactic, instead of aesthetic, program at the museum.\nAs a result of the American social situation, impatience, South Kensington\ninspiration, funding, and the institutions present in Boston, the early MFA displayed a\nunique and eclectic set of artwork. Due to their lack of funding, the committee relied on\ndonations, loans, and chea\nper reproductions to create a collection. Although they did not\nhave a lot of American art at the start, they tried to support the American arts whenever\npossible. Of the 56 paintings that the Athenaeum donated to the MFA when it opened, 18\nwere by American artists,38 and in 1880 they had an exhibition of living American artists\nthat was very well received.39 In the event they came into money, the museum consciously\ndecided to first buy cheap pieces, then decorative art, then works from Boston artists, and\nfinally would acquire permanent works at small cost.40 They felt they could make the most\nprogress in terms of pedagogical benefit by acquiring greater volume in the form of\nreproductions and plaster casts. Perkins knew their situation and was looking to create a\nmuseum:\n...mostly composed of reproductions of statues, architectural fragments,\n\nmonuments, gems, coins, inscriptions, &\n\nc. &c. These will answer our purpose, as we\nEurope at this time. People in general were still unsatisfied with American art production\nIt's important to note that much of the highly regarded 'American' art was produced in\nand hoped that the MFA would stimulate a national style.\nArts.\"\nHirayama, Hina. \"The Boston Athenaeum and the C\n. Ed. Richar\nreation of Boston's Museum of Fine\nAthenaeum, 2009: 254.\nd Wendorf. Boston, MA: Boston\nC\nambridge, MA: Belknap, 1970: 59.\nWhi\nThe Boston Athenaeum: Bicentennial Essays\ntehill, Walter Muir. Museum of Fine Arts, Boston: A Centennial History. Vol. 1.\nIbid., 62-‐63.\n\naim at collecting material for the education of a nation in art, not at making\ncollections of objects of art.\ndevelopment, when we are willing to pay for them.\nThat must be done at a later stage of national\nThese were arranged chronologically to add to their educational benefit. Therefore, it is\ntrue that the MFA's collection did not have as many historical objects as a great European\nmuseum, but by working within their constraints the museum committee was able to\ncreate a quality institution dedicated to education. Instead of forming a museum around a\nvast set of objects, they intentionally filled their walls with objects to complete a historical\nstory. A European author suggested that Americans needed to be very strict about what\nthey showed to the public in their museums because \"Although Americans have bought\nhundreds of fine works of art during the last ten or fifteen years, the supply of fine things\navailable for any American is still, undoubtedly, small compared with that of the great\nEuropean collections\n, while the supply of worthless things bought by earlier generations is\nvery large.\" As a counter to this view, we can consider that the MFA was not at the mercy\nof its sparse collection, but used what it had to intentionally create something better and\ndifferent than a European princely gallery. Ferdinand Eckhardt captures this sentiment in\n1953 when he critiqued American museums through the lens of a European visitor: \"The\nAmerican museum does not look back but concentrates on shaping the mind of the man of\ntoday or even better of tomorrow, to create the really internationally minded world\ncitizen.\"43\n\n(1870): 8\nPerkins, C\n. JS\nharles C\nTOR.\n. \"American Art Museums.\" The North American Review\n111.228\nConnoisseurs\nArt Jo\n\"The Purpose and Policy of National Museums.\"\nEckhar\nurna\nd\nl\nt, F\n\n9.37\nerdinand\n(1906):\n. \"American Museums Seen through the Eyes of a European.\"\n5. JSTOR.\nThe Burlington Magazine for\n12.2 (1953): 136. JSTOR.\nCollege\n\nIt is evident that the founders of the MFA wanted to increase cultural appreciation\nin America, which they did through \"comparison, not imitation\"44 of European artwork and\nmuseums. Many aspects were borrowed from the South Kensington Museum, including the\nfocus on decorative arts and ties to industrial production, but Americans had a different\nkind of affinity towards relics, as these objects were not part of their immediate history.45\nAccording to Eckhardt, this allowed them to view the objects more objectively. As the goal\nwas to educate the nation in art, Perkins summarizes my argument: \"It will be seen that no\none of the [European] museums of which we have been speaking offers a perfect example\nof what the American museum should be.\"46 Although the criticism may disagree, the MFA\nin Boston is a testament to how Americans leveraged their goals to create an institution\nrecognized by Europeans and Americans alike as a unique and worthwhile endeavor.47 We\ncan look at the current museum-‐building boom in Abu Dhabi through a similar lens. I\nwould like to propose that the museums in Abu Dhabi, while modeled after Western\nmuseums in very obvious ways, are nevertheless unique to Abu Dhabi's situation.\nAbu Dhabi has plans to construct four major museums as part of the Saadiyat\nCultural District in order to create a cultural hub in the Middle East. Of particular note are\nplans for a Guggenheim Museum, designed by Frank Gehry, and a Louvre Abu Dhabi\ndesigned by Jean Nouvel. Both buildings leverage the brand names of the associated\nmuseums and architects. At the start, \"The Guggenheim Foundation will lend works from\n\nQuarterly\nHarris, Neil. \"The Gilded Age Revisited: Boston and the Museum Movement.\"\nEckhard\n14.4\nt, Fer\n(1962):\ndinand. \"\nAmerican Museums\n. JSTOR.\nSeen through the Eyes of a European.\"\nAmerican\nPerkins, C\nharles C\n2.2 (1953):\n. \"American Art Museums.\"\n135. JSTOR.\n111.228\nCollege\nArt Jo\n(1870): 14\nurnal\n.\n\nJS\nThe North American Review\nConnoisseurs\n\"The Purpose and Policy of National Museums.\"\nTOR.\n9.37 (1906): 4. JSTOR.\nThe Burlington Magazine for\n\nits collection and also provide curatorial advice as the Guggenheim Abu Dhabi builds its\nown staff and collection of modern Middle Eastern art.\"48 The Louvre Abu Dhabi has a\nsimilar agreement with the Louvre in Paris, which will loan them works and curatorial\nexpertise until the museum can build its own collection. According to McClellan,\n\"Prominent European architects reinforce cultural ties to countries upon which Abu Dhabi\nwill rely for expertise and object loans.\"49 Abu Dhabi must also understand the 'Bilbao\nEffect', in which Gehry's Guggenheim in Bilbao caused the struggling region to have a\nprosperous tourism industry. According to the Official Saadiyat website, the items shown in\nthe Louvre Abu Dhabi \"will originate from societies and cultures all over the world, but\nuniversal themes and common influences will be highlighted to illustrate similarities\narising from shared human experience transcending geography, nationality and history.\"50\nInterestingly, the 'universal themes' that the website mentions primarily refer to 'western\nthemes' that have become the de facto art historical narrative. Abu Dhabi has taken a\ndifferent approach than Qatar, whose new museums were created to celebrate Islamic art\nand culture.51 Although some Islamic art will be shown in the Louvre and Guggenheim\nmuseums in Abu Dhabi, it will be put into the context of the larger trajectory from ancient\nto modern times in Western history. McClellan suggests that \"It is a testament to how\nuniversal western values have become, to how difficult it is to 'unthink' western\ntaxonomies, that the Louvre is essentially reproducing itself in the Persian Gulf while\n\nJournal of Curatorial Studies\nMcClellan, Andrew. \"Museum Expansion in the Twenty-‐First C\n1.3 (2012): 277.\nentury: Abu Dhabi.\"\n\n\"Louvre Abu Dhabi Overview.\" TDIC\nIbid.\ndha\nOuroussoff, Nicolai. \"Building Museums, and a Fresh Ar\nbi1/louvre-‐abu-‐dhabi-‐overview.html>.\n, <http://www.saadiyat.ae/en/cultural/louvre-‐abu-‐\n27 November 2010: A9.\nab Identity.\" The New York Times\n\nclaiming to do something new and different.\"52 Criticism generally takes this stance--that\nAbu Dhabi is missing an opportunity to showcase Islamic culture in a new way and is\ninstead conforming to western values. Nicholas Ouroussoff of the New York Times believes\nthere is a larger issue at play: \"while the money for all these developments comes from\nEmirati oil, the projects themselves are being shaped almost exclusively by foreigners.\"53\nHe suggests that instead of creating something to uplift Arab culture, \"what is being touted\nas a society wide embrace of global culture will end up being just another example of\ncultural colonialism.\"54 In taking this side, western critics are immediately placing Islamic\nculture as something 'outside' and different from the accepted western canon of art.\n\nHow does the situation in Abu Dhabi compare to the museum-‐boom in America\nduring the 1870s? Both Abu Dhabi and America were using well-‐known art as a basis for\nbringing cultural recognition to their region. In America this happened through the buying\nof European art and reproductions. Abu Dhabi is accomplishing this by lifting entire\nmuseum enterprises to give their endeavor credibility. In both cases the museums are used\nas a way to change national identity. Abu Dhabi is trying to change the way the Arab world\nis viewed by the West, and in the United States the goal was to increase the cultural literacy\nof Americans so they could reach the level of Europeans. For the museums in Abu Dhabi\nand the early museums in America, there is criticism as to the authenticity or novelty of\nsuch endeavors: \"Is it possible, some academics and art experts ask, to create an 'oasis of\nculture\" in a place that has no history of museums, no community of artists to speak of, no\n\nJournal of Curatorial Studies\nMcClellan, Andrew. \"Museum Expansion in the Twenty-‐First Century: Abu Dhabi.\"\n27 November 2010: A8.\nOuroussoff, Nicolai. \"Build\n1.3\ning Museums, and a Fresh Arab Identity.\"\n(2012): 284.\nThe New York Times\nIbid.\n\ncollectors, no donors, and where the local passions run to falcons and racehorses rather\nthan to Pablo Picasso and Jeff Koons?'\"55\n\nJust as we can evaluate criticism of American museums\n\nby looking at the goals of the\ninstitution, let us look at the goals of the Saadiyat Cultural District. According to their\nwebsite:\nAn entire district on Saadiyat Island is d\nUnprecedented in scale and scope, Saadiyat\nevoted to culture and the arts.\nglobal cultur\nexhibitions, permanent collections, productions and performances. Its iconic\ne, drawing local, regional and in\nCul\ntern\ntural\nation\nDist\nal visit\nrict w\nors\nill\nw\nb\nit\ne a l\nh u\nive canvas for\nnique\ninstitutions will be housed in buildings drawing a statement of the finest\narchitecture at the beginning of the 21st century.56\nThey are building these museums in order to increase tourism and traffic to the region, and\nto \"reshape their national identities virtually overnight, and in the process... redeem the\ntarnished image of Arabs abroad while showing the way toward a modern society within\nthe boundaries of Islam.\"57 The building projects also have an embedded economic root.\nSince the 1960s, Abu Dhabi has made most of its money through the oil industry, but this\nonly creates stability as long as there is oil available. Creating a cultural hub may be a way\nto compensate for their ephemeral economy and to prepare for the future.\nAbu Dhabi has exorbitant amounts of wealth that allows them to build these\nmuseums and bring together names such as the Guggenheim and the Louvre into one\nlocation. The buildings will be modern and placed in a new context, even if the content of\nthe museums is still highly influenced by western ideals. Whether critics believe it or not,\n\n<http://www.artnews.com/2009/02/01/an-‐\nARTnews. \"An Oasis in the Desert.\" 2/1/2009.\noasis\nARTnew\n-‐in-‐the\ns\n-‐\n.\n\"Saadiyat Cultural District Abu Dhabi\".\ndesert/>.\n<ht\nOuroussoff, Nicolai. \"Building Museums, and a Fresh Arab Identity.\"\ntp://www.saadiyatculturaldistrict.ae/\nSaadiyat C\nen/saadiya\nultur\nt-‐cul\nal D\ntur\nistr\nal-‐dist\nict.\nrict/about/>.\n27 November 2010: A1.\n\nThe New York Times\n\nthe art will acquire a new meaning by being placed in a 'Disneyland' of museums, even if it\ndoes not act as a perfect 'cultural bridge' as the Tourism Development & Investment\nCompany (TDIC) in Abu Dhabi would like us to believe. Unlike the MFA, the Louvre and\nGuggenheim in Abu Dhabi will have buildings before they have large collections. However,\ncreating such grand establishments is something that only could be done in a place with\nlarge amounts of space and wealth. It also must be remembered that these projects began\nat the request of Sheikh Kh\nalita bin Zayed al-‐Nahayan, who wanted to create a miniature\ncity for culture and leisure . The decisions have been strategic, including the choice of\nmuseums and architects. It is impossible to ignore the spectacle present in the new\nestablishments-- they may be seen as an extreme embodiment of the commodification of\nart for tourism that happens in museums all over the world. In short, these museums, their\narchitecture and purpose, are unique to Abu Dhabi.\n\nIt is easy to get caught up in myths derived from criticism, to get annoyed at Abu\nDhabi for co-‐opting western ideals, or to claim that American museums are cheap\nimitations of their European counterparts. These myths seem to arise when a group wants\nto challenge tradition by bringing it to a new place or time. Harris suggests that the new\npost-‐Civil War era may have been to blame in the MFA's case: \"Any reforming age\ncondemns the immediate past as guilty, by definition. Since the museums themselves were\nproducts of an immediately preceding age, it was easier to taint their pedigree and prove\ntheir illegitimacy right from the start, than to reveal by more careful analyses just where\n\n58 ARTnews. \"An Oasis in the Desert.\" 2/1/2009. ARTnews.\n<http://www.artnews.com/2009/02/01/an-‐oasis-‐in-‐the-‐desert/>.\n\ntheir development diverged from an acceptable pattern.\"59 It is more acceptable to build a\nmuseum that tries to fit in with your national identity, as in Doha, than it is to build one 'out\nof place,' like in Abu Dhabi.60 How do certain canons become the established way of\nthinking, and when do such controversial actions become acceptable? This process\ndefinitely takes time. America is now at the forefront of the art world, yet in the nineteenth\ncentury Europeans thought they would never be taken seriously. Rich royals from the\nMiddle East are now spending exorbitant amounts of money in the contemporary art\nmarket, just as Americans were doing in the 1800s. Perhaps in the future there will be a\nglobalized art world and art history. In the meantime we can try to respect the institutions'\nintentions and recognize when our cultural biases enter the conversation.\n\nQuar\nHarris, Neil. \"The Gilded Age Revisited: Boston and the Museum Movement.\"\nterly 14.4 (1962): 562. JSTOR.\nAmerican\n27 November 2010: A1, 8-‐\nOuroussoff, Nicolai. \"Building Museums, and a Fresh Arab Identity.\"\n9.\nThe New York Times\n\n\"The Americans, in Their Moral, Social, and Political Relations by Francis J. Grund.\"\nBibliography\n\nThe\nNorth American Review 46.98 (1838): 106-‐26. JSTOR.\n\"An Oas\n<\ni\nht\ns i\nt\nn th\np://\ne\nwww.ar\nDesert.\"\ntne\n1 Feb\nws.com/2009/02/01/an-‐\nruary 2009. ARTnews.\noa\n\nsis-‐in-‐the-‐desert/>.\nColeman, Lawr\nAmerican Association of Museums, 1939.\nence Vail. The Museum in America: A Critical Study. Vol. 1. Washington:\nBlau, Judith R. \"The Disjunctive H\n(1991): 87-‐105. JSTOR.\nistory of U.S. Museums, 1869-‐1980.\" Social Forces 70.1\n\nDuncan\nRoutledge, 1995.\n, Carol.\n. London and New York:\noi\n\nDurand\nCon\n-‐Grevil\nn sseur\nl\nCivilizing Rituals: Inside Public Art Museums\ne, E. \"Priva\n2.2 (1887):\nte Pict\nure\n-‐99.\n-‐Galleries of the United States. First Article.\"\nJSTOR.\nThe\nEckhardt, Ferdinand\n12.2\n. \"American Museums Seen through the Eyes of a European.\"\n(1953): 131-‐136. JSTOR.\nCollege\n\"For the Nor\nArt Jo\nth\nurna\n-‐American Journal. Institution for the Fine Arts.\"\nl\nThe North-‐American\nReview and Miscellaneous Journal 2.5 (1816): 153-‐64. JSTOR.\n\"A Frenchman's \"Coup D'Oeil\" of American Art.\" The Crayon\nThe Art Review\n5.1 (1858): 10-‐13. JSTOR.\nH\n\nale, Edward E. \"Fine Art in Massachusetts.\"\n1.3 (1871): 1-‐2. JS\nAmerican\nTOR.\nHarris, Neil. \"The Gilded Age Revisited: Boston and the Museum Movement.\"\nQuarterly\n\n14.4 (1962): 545-‐66. JSTOR.\nHirayama, Hina. \"The Boston Athenaeum and the C\nBoston Athenaeum, 2009\nArts.\"\nKouwenhoven, John Atlee.\n\nThe Boston Athenaeum: Bicentennial Essays\nreation of Boston's Museum of Fine\n. 231-‐71.\n. Ed. Richard Wendorf. Boston, MA:\nNY: Doubleday, 1948.\nMade in America; the Arts in Modern Civilization\n\n. Garden City,\n\n\"Louvre Abu Dhabi Overview.\" TDIC\ndhabi1/louvre-‐abu-‐dhabi-‐overview.html\n, <http://ww\n>.\nw.saadiyat.ae/en/cultural/louvre-‐abu-‐\nMcClellan, Andrew.\n\nCalifornia Press\nThe Art Museum from Boullee to Bilbao\n, 2008.\n. Berkeley: University of\n\nMcClellan, Andrew. \"Museum Expansion in the Twenty-‐First Century: Abu Dhabi.\" Journal\nof Curatorial Studies\n\n1.3 (2012): 271-‐93.\nMumford, Lewis.\n\nThe Culture of Cities. New York: Harcourt Brace, 1938.\nThe New\n\nOuroussoff, Nicolai. \"Building Museums, and a Fresh Arab Identity.\"\n27 November 2010: A1, 8-‐9.\nYork Times\nPeirce, H. W\n\ninthrop. The History of the School of the Museum of the Arts, Boston 1877-‐\n\n. Boston: T.O. Metcalf, 1930.\nPerkins, C\n1-‐29.\nharles C\nJSTOR\n. \"American Art Museums.\"\n\n.\nThe North American Review 111.228 (1870):\n\"The Purpose and Policy of National Museums.\"\n\nConnoisseurs 9.37 (1906): 3-‐6. JSTOR.\nThe Burlington Magazine for\n\"Saadiyat Cultural District Abu Dhabi\".\n\n<http://www.saadiyatculturaldist\nSaadiyat C\nrict\nTh\n.a\ne\ne/\nAldine\nen/\nultur\nsa\nal D\nadiya\nistr\nt-‐cul\nict.\nt\n\nural-‐district/about/>.\nSouth, Erastus. \"An Art\n\n-‐Musee in America.\"\n5.6 (1872): 127. JSTOR.\nTemin, Peter. \"An Economic H\nMuseums\n\n(1989): 179-‐194.\nistory of American Art Museums.\"\n\nThe Economics of Art\nWallach\nDefinition of Art,\"\n, Alan. \"The American C\nExhibiting Contradiction: Essays on the Art Museum in the United\nStates\nast Museum: An Episode in the History of the Institutional\n\n(Amherst, 1998): 38-‐56.\nWhiteh\nC\nill, Walte\nZolberg, V\n\nambridge, MA: Belknap, 1970.\nr Muir. Museum of Fine Arts, Boston: A Centennial History. Vol. 1.\n. L. \"C\n-‐25.\nonflicting visions of American art museums.\" Theory and Society\n\n10 (1981):\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21W.022.03 Writing and Experience: Reading and Writing Autobiography\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}