{
  "course_name": "The Coming Years",
  "course_description": "No description found.",
  "topics": [
    "Humanities",
    "History",
    "Historiography",
    "Modern History",
    "Humanities",
    "History",
    "Historiography",
    "Modern History"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 2 hours / session\n\nOverview\n\nIn this seminar, we will explore what the future might hold. We will draw upon anthropology, history, human system dynamics, fiction, and current movements to illuminate our speculations. Our fields of interest will include changes in science and technology, culture and lifestyles, and dominant paradigms and societies. Each aspect, we'll try to predict 20 years out, and then project into the future. The scope of the class will range from the effects of the internet over the next decade, to the worldwide political changes we can expect in the next century, to the feats of engineering that might emerge in the coming millennium. Class will be organized around discussion, with assignments including reading and writing of non-fiction and fiction, scenario games, simulations, and creative design.\n\nClass Expectations\n\nOur time each week will be divided as follows:\n\n2 meeting hours\n\n2 hours reading\n\n2 hours homework (writing fiction, creating and experimenting with simulations)\n\nFinal Project\n\nFor the last five weeks of the semester, out-of-class time will be largely used for working on a final project. Each student or group of students will choose a project, which must have a simulation component, a creative component, and a research component.\n\nCalendar\n\nSES #\n\nTOPICS\n\nIntroduction and the recent past\n\nTechniques in futurology\n\nHistorigraphic theories: class struggle, cycles, and paradigm shifts\n\nCatastrophic change, power laws, and fractals\n\nDisasters and collapses: nuclear war, global warming, peak oil, bioterrorism\n\nThe singularity\n\nWorld changing, revelations, and revolutions\n\nFuture politics\n\nSociety in motion\n\nScience and technology\n\nEconomics and demographics\n\nDescribing the future\n\nMemetics\n\nFinal project presentations",
  "files": [
    {
      "category": "Resource",
      "title": "How Superpowers, Populations, and Globalization will Change the Way You Live and Work",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/es-256-the-coming-years-spring-2008/e4f04127dcc5c96aac77577421493edc_MITES_256S08_assn11.pdf",
      "content": "Futurecast: How Superpowers, Populations, and Globalization will Change the Way You\nLive and Work by Robert J. Shapiro\n\n* What assumptions and prejudices does this author bring, and throughout the\ndiscussion of the following questions, what other interpretations can be brought to his\nfacts?\n\nChapter 2, The Demographic Earthquake\n\n* The New York Times claimed that over half of children born today in developed\ncountries will age to be 104 or older. What affects will that have on the structure of\nsociety and culture?\n\n* Why does modernization result in a baby boom and a baby bust, and will the cycle\ncontinue?\n\n* What will happen when he money available to support retired people dries up?\n\n* As European countries experience great strains from their age-heavy demographics,\nand more people are forced into poverty, will their \"level of development\" decrease?\n\n* Is there a limit to Kuznets's and Boserup's view that greater populations provide\nsupport for greater prosperity?\n\n* To what extent should developing countries protect their investors' interests?\n\n* The author discusses baby booms and busts on only a society-wide scale. Is it\nimportant to conceder which segments of the population are producing greater and\nfewer babies?\n\n* Why would a decreased population result in less growth and lower per capita\nproduct?\n\n* What kinds of technological improvement could improve the lot for Europe and\nJapan?\n\n* If technology provides for the leisure of such large sectors of society, is there any\nharm in people taking advantage of that potential?\n\n* The author claims, \"The price of all the regulations and barriers is less competition,\nso European and Japanese businessmen feel less pressure to come up with new\nproducts and more efficient ways of conducting their business-- and, directly or\nindirectly, that's what drives modern economies to create jobs.\" Do you agree?\n\n* Should Europe decrease its workers' rights in exchange for the greater competition\ntheir businesses will be able to muster?\n\n* Do we believe economics? Demographics? Is growth important for societies? Is\nyouth?\n\n* What can social movements do to respond to national and worldwide economic\nsituations?\n\n* Can Chinese communism survive the next 20 years?\n\nChapter 7, The Coming Crises in Health Care, Energy, and the Global Environment\n\n* As the problems in each of health care, energy, and the environment reach a critical\npoint, pivotal clashes will occur. What will those pivotal clashes be like?\n\n* \"The American superpower will try to oversee [everything], maneuvering to contain\nChina's ambitions, deflect those of the Russians, and maintain the Middle East as a\nstable energy supplier for the world.\" Can it?\n\n* How old will people live in 50 years, and with what kinds of medical conditions?\n\n* What will happen to worldwide medicine if the US can no longer pay as much as it\ncurrently does?\n\n* What do you think the long-term solution to health care is? Does it require a shift of\nour attitudes toward health?\n\n* Will China expand it's healthcare? Why?\n\n* What will happen to healthcare when demand greatly exceeds accessibility?\n\n* Are you convinced that peak oil is not an issue?\n\n* What side-effects will unconventional extraction methods have?\n\n* What will be the effects of a eastern countries relying more on Middle Eastern oil, and\nAmerica relying less? What will change when China is in a position to compete in the\nMiddle East?\n\n* What will the future version of the Kyoto protocol look like, and what kinds of\ninternational relations will be behind it?\n\n* What will finally precipitate global climate change policy?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nES.256 The Coming Years\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Questions from the Fourth Turning",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/es-256-the-coming-years-spring-2008/6e6db4d04e4461f3f96e527f5ec09761_MITES_256S08_assn03.pdf",
      "content": "Questions from The Fourth Turning by William Strauss and Neil Howe\nPages 106 - 115, 136 - 137, 272 - 302, charts on 61, 83, 98, 105, 138\nRhythms in History\n* Historical cycles describe a stable, systematic world, and yet Strauss and Howe's\ncycles are characterized by catastrophe. What is the role of chaos in cycles?\n* What does cycle theory predict current university campus attitudes should be\ncharacterized by, and does that inform our perception of them?\n* The study of history is said to be searching for \"how it was.\" Do the gross statistics\nupon which cycle theory is based tell us about the gestalt of the times?\nPolitics\n* Where are we in the politic cycle? Is it different in different regions of the country?\nDo different politicians reflect different points on that cycle? Are we now in a one-party\npolitical system?\n* Government is designed to be stable, and self-supporting, but Strauss and Howe\nclaim that it never has been. What factors in a liberal society would motivate the return\nof authoritative government?\nFamily and Society\n* Why do gender roles solidify during a crisis? How can it be said that they did, when\nin the United States, the last crisis resulted in huge influxes of women into the\nworkforce?\n* Was the family structure strong or weak during your youth? What aspects of that\nwould you prefer to maintain for your children, and which change?\nCulture\n* How \"civilized\" are you? Does culture advance over time?\nArchetypes in History Chart\n* Which of these archetypes seem \"best\"?\n* What is the right way to raise a child?\nMoods of the Four Turnings Chart\n* How would you describe the current mood for each category-- gender roles, ideals,\nsocial motivation, worldview, etc.?\n\nA Fourth Turning Prophesy\n* Was 9/11 the crisis of our cycle? If so, why did it temporarily reinforce the standing\norder?\n* What is our fourth turning prophesy, knowing how things have developed so far?\n* The internet seems to exemplify the ideals of an unraveling. What will happen to it\nduring the crisis?\n* What is our new political constellation? Do Boomers have the wisdom to lead us?\n* Will there be a great war this crisis? What and when? Will it involve the use of\nnuclear weapons?\n* Predict the climax of the crisis. Where will the post-crisis solution come from?\n* What does cycle theory tell us about the fate of social security?\n* How does the 13th gen description compare to the popular media understanding of\ngeneration X?\n* Explain the statement on 289, \"They will widen the continuing dispersions of\ntechnology and culture-- yet will vote for politicians who promise to reverse it.\"\n* How does Obama reflect the 13th gen traits (and how did McCain reflect the Silent\ngeneration and Clinton the Boomers)?\n* How have the millennials changed MIT?\n* Would your generation go to war?\n* Now that we understand the extremes of the cycle (for example, the stifling that Artist\nyouth are subjected to), can and should we change it?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nES.256 The Coming Years\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture 1: Introduction and the Recent Past",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/es-256-the-coming-years-spring-2008/5e65ee5d1029fa9a3c9686123260a88a_MITES_256S08_Lec01.pdf",
      "content": ".256 -- The Coming Years\nSpring '08\nLecture 1 - Introduction and the Recent Past\nJames Rising\nMIT OpenCourseWare\nThe world is changing at an unprecedented pace. At MIT, we have the potential to hugely affect it.\nHaving a clear vision of the future is the most important tool for choosing change.\nThe future, like the present, is a delicately overdetermined fractal system. In parts:\nIt's a system- that is a complex of inter-related elements. System dynamics can be used to model\n-\nsystems.\nIt's fractal, with complexity at all levels. Also, it follows power laws.\n-\nIt's overdetermined, every factor cybernetically supporting every other. Change one, and all will be\n-\naffect. Most often, try to change one, and its original state will be reinforced and the change nullified\nby all of the others.\nIt's delicate, always pushing itself to the brink of catastrophe. Small changes can have large effects.\n-\nIs it possible to predict the future?\nVoltaire : The present is pregnant with the future.\nGates : 640k ought to be enough for anybody.\nAnonymous : There are two types of forecasts: luck and wrong!\nIt's impossible to predict the future, per se. The future is too delicate and complex and huge, and our hope\nand fears (that is, our predictions) themselves play a role in shaping it. This class is more about developing\nthe liberal artistry of predicting the future, not the science of it. We will be wrong, but let's construct a\nvision to be wrong about!\nIf I asked you to describe the present, how you would approach the question, as something other than a\nlaundry list?\nOne reached-for goal in the study history to describe \"what it was like\". Similarly so it should be with\nfuturology. As humans, our experience is hugely shaped by language.\nWhat are the nouns, verbs, and adjectives of the future. The nouns would be the science and technology.\nThe verbs would come from how people work and play. The adjectives come from paradigms and world\nviews.\nOne goal of this class is to create a new language of the future.\nWe're going to look at the big paradigms, how they expand and mature.\nHow does one go about predicting the future?\nBig trends (extrapolation)\n-\nInfluence of new technology (creation)\n-\nBattle of dominant paradigms (conflict)\n-\nSystem dynamics\n-\nTheories of history\n-\nAn organic combination of all of these\n-\nThe semester will be divided into four sections.\nES\n\nLecture 1\nIntroduction and the Recent Past\n.256, Spring '08\nTechniques : System dynamics, historiographical theories, anthropology, catastrophe theory, and others.\nExtreme Scenarios : The great concerning results of humankind's hubris: nuclear war, global warming,\npeak oil, bioterrorism, etc. We will discuss these, as well as extremely Utopian views, in part to set\nthem aside and deal with the harsh realities of difficult predictions.\nA Look at the Future : We will focus 20 years out and consider politics and society, science and technol\nogy, economics and demographics, culture and subculture.\nFinal Projects : At the end of the course, each student will present on some topic in futurology.\nAdditional Discussion: What has happened in the past five years? What can we predict for the next\nfive? Look at the covers of magazines and music albums, college admission changes, technology, movies, and\nvideo games.\nES\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nES.256 The Coming Years\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture 2: Techniques in Futurology",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/es-256-the-coming-years-spring-2008/cc7e0f285d1b410fe8b5cfe1046c031d_MITES_256S08_Lec02.pdf",
      "content": ".256 -- The Coming Years\nSpring '08\nLecture 2 - Techniques in Futurology\nJames Rising\nMIT OpenCourseWare\nWhat did you think of the reading?\nAccording to this, the next century will be characterized, in part, by collapse. A world population of 7\nbillion people will be cut to half in 50 years, and it will be devastating.\nIs this the fault of the developing world, with its huge population boom?\nPerhaps not. A single American has as much impact on the world as 40 to 80 residents of developing\ncountries.\nIs this reading describing an extreme scenario?\nProbably not: this model already accounts for optimistic changes in technology and policy.\nWhat will this population disturbance do in the areas of science, art, government, culture,\nand subculture?\n850 million people are currently in conditions of chronic malnutrition (13% of the popula\ntion). What will the world be like when 4 billion (say 50%) are?\nWhat policy changes can we expect over the next 100 years as a result of this?\nMore generally, how do we deal with no longer being able to live only needing to consider\nshort-term consequences?\nHere follows a brief introduction to system dynamics.\nSystem dynamics is a tool for modeling the real world based on very simple principles. SD is well applied\nto economies, populations, companies, resources, and biological systems. It's also possible to pull out a\nnumber of general principles which apply to the real world from its models.\nThe basis of SD is stocks and flows. Stocks are real-world quantities, which can only change continuously.\nFlows are those changes, informed (through equations) by values throughout the model.\nBasic Examples:\nPopulation Growth and Decay: this is a simple exponential model, or (potentially) an \"S\"-Curve.\n-\nFeedback and Delay: If there are two stocks which feedback into each other, there will always be\n-\nsome delay. For example, suppose people have fewer children as a result of pollution. Pollution (like\npopulation) is a \"stock\" quantity, we will naturally overshoot our desired (steady-state) population.\nThe result is oscillation.\nThe other examples from The Fifth Discipline all have direct analogs for studying the development of\nthe present into the future.\nThe Tragedy of the Commons is a problem with the world's resources, particularly air quality.\n-\nFixes that Fail could be applied to Jihadism.\n-\nShifting the Burden is at the crux of the dangers of the energy crisis.\n-\nShifting the Burden to the Intervenor may be occurring now in the Middle East.\n-\nEscalation was the problem in the arms race between the US and Russia (and may now be a problem\n-\nwith terrorism responses).\nSuccess to the Successful is the fundamental model between the rich and poor under capitalism.\n-\nThere are a number of general principles that one can pull out of the study of system dynamics. These\ninclude:\nES\n\nLecture 2\nTechniques in Futurology\n.256, Spring '08\n- The Boiling Toad: Like the proverbial toad that gets boiled alive if you raise up heat slowly, we are\nmuch better at noticing fast changes than slow ones.\n- The Beer Game: Small and simple changes, far removed from your means of noticing them and appear\nto be complicated and unwieldy.\n- People often know exactly what are the most critical points in the system they're in- and push them\nin the wrong direction.\n- People are very good at self-organization. If a system seems to be broken, sometimes the best solution\nis to get rid of it.\nES\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nES.256 The Coming Years\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture 3: Historigraphic Theories",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/es-256-the-coming-years-spring-2008/30840530e3eace6376f7767531eb65b0_MITES_256S08_Lec03.pdf",
      "content": ".256 -- The Coming Years\nSpring '08\nLecture 3 - Historigraphic Theories\nJames Rising\nMIT OpenCourseWare\nWhat did you think of the reading?\nThis is a good opportunity to go over the big terms from the reading: High, Awakening, Unraveling,\nCrisis, Prophet, Nomad, Hero, and Artist, and how they apply in the most recent cycle (30's, 50's, 60-70's,\n80-90's, Silent, Boom, 13th, Millennial).\nWhat are the generational conflicts happening now?\nThe presidential election is a clear generational conflict. Consider:\nJohn McCain born 1936, so Silent Generation (1925 - 1942)\nHillary Clinton born 1947, so Boom Generation (1943- 1960)\nBarack Obama born 1961, so 13th Generation (1961 - 1981)\nBefore this, Bush Jr. (1946) and Clinton (1946) were from the Boom Generation. Before them, Bush Sr.\n(1924), Reagan (1911), Carter (1924), Ford (1913), Nixon (1913), LBJ (1908), and JFK (1917) were all from\nthe G.I. Generation (for 32 years of their rule). We have never had a president from the Silent Generation.\nA related and older theory of cyclical history comes from Hegel.\nHegel held that underneath all history was one repeating cycle. The Hegelian cycle starts with a High\n(to use Fourth Turning terminology) when a single paradigm reigns supreme, the thesis. The existence of\nthis unipolar world makes alternative paradigms flourish at the fringe (the Awakening). One, the antithesis,\nwill gain strength because it best encompasses the needs neglected by the thesis, and the world grows more\nopposed (the Unraveling). Finally, the thesis and antithesis will necessarily come into conflict (the Crisis),\nout of which will arise a synthesis of the two paradigms, which will create a new unipolar thesis.\nAre we in a fourth turning? What distinguishes it?\nThe Fourth Turning precipitating crisis was probably 9/11. This polarized the American population, and\nat least half began strongly supporting increased social constriction from the government.\nHowever, this cohesion fell apart. While not discussed during the class, the economic crisis appears to\nbe a new catalyst for the fourth turning.\nWho are the Millennials, and what distinguishes them?\nGenerally, the students of the class are Millennials, having been born between 1982 and 2001.\nThe former Dean of Admissions, Marilee Jones, wrote a controversial article on the Millennial and how\nthe group would change MIT (and how MIT should change to accommodate it).\nLike the G.I.'s, the Millennials may define the next century. The pragmatic 13th generation will lead us\nthrough the crisis, helping to deliver a new world into the hands of its new heroes.\nES\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nES.256 The Coming Years\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture 4: Catastrophic Change, Power Laws, and Fractals",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/es-256-the-coming-years-spring-2008/bce733325af77ba15d0a044c86e87f44_MITES_256S08_Lec04.pdf",
      "content": ".256 -- The Coming Years\nSpring '08\nLecture 4 - Catastrophic Change, Power Laws, and Fractals\nJames Rising\nMIT OpenCourseWare\nWhat did you think of the reading?\nWhat does historical physics tell us about the future? Does this mean that predicting the future is\nimpossible, because chaos always has the ability to turn the smallest decimal into the largest effect? What\nexactly do these laws of critical states say we can and cannot predict?\nDo the laws of historical physics apply to human systems?\nIt's said that the laws of science can't apply to humans because, with our intellect and culture, we're\ntoo complicated. We remember the past, so, while we might still repeat ourselves, we do it differently. But\nmemory and complexity are exactly the conditions of historical physics.\nWhat are the characteristics of Critical States?\nThey're ubiquitous: historical systems naturally organize themselves into critical states. That includes\n-\neverything from societies to psychologies.\nThey're fractal: Critical states are critical on all levels, and an arbitrary small change can result in an\n-\narbitrary large avalanche of changes, by virtue of snowballing.\nThey follow power laws: Because of this \"fractal size\", the size of events follows a power law. If there\n-\nare N events in a given time period of one size, there will be XN events half that size, X2N events a\nquarter of that size, etc., and N/X events double that size, N/X2 quadruple that size, etc.\nES\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nES.256 The Coming Years\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture 5: Disasters and Collapses",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/es-256-the-coming-years-spring-2008/f4aefbf178d95154ee756178a2d06e9b_MITES_256S08_Lec05.pdf",
      "content": ".256 -- The Coming Years\nSpring '08\nLecture 5 - Disasters and Collapses\nJames Rising\nMIT OpenCourseWare\nWhat did you think of the reading?\nAre the Utopian and dystopia visions that start Chapter 1 realistic?\nThese views are explicitly tempered with an understanding of the necessary consequences of our current\nactions, as well as the current trends which could dominate the future.\nWhat does the author mean by \"drivers\"?\nDriver is an old, pre-cybernetic term. While useful to discuss drivers to isolate some of the variables\ninvolved, the fact is that all of those variables are defined and derive their status as major factors from their\nrole in the whole system.\nWhat are the big concerns for the next 100 years?\nRecent news has centered on peak oil, climate change, nuclear war, and biological outbreak. New such\n\"consequences of overextended human hubris\" concerns seem to appear every decade, but they're well-worth\nconsidering.\nHow fragile is contemporary civilization?\nProbably more fragile than it appears. Contemporary civilization is intensely interdependent, and capi\ntalism ensures that every element is pushed to an edge. Basic functions of society rely on layers-upon-layers\nof necessary support systems.\nRecent news has pointed out the ways that the United States support systems are decaying, and need\nimmense work if we want them to continue to be reliable.\nThe environment is another necessary and highly interdependent system. The honeybee crisis is one\nexample of unintended consequences that could vastly alter modern life before we even know the causes.\nIf there are so many imminent disasters, why are we still here?\nThere seems to be a new imminent disaster from humankind's hubris every five years. It's shift from\nNuclear War to Bio-terrorism to Peak Oil to Global Warming. But we're still here- is it all doom-saying?\nWhat happens in a collapse of civilization?\nWhat would it be like to live through a collapse? What falls apart first, and what ceases to function\nproperly long before people realize it's stopped? How long does it take? What would it be like afterwords?\nHow could we recover?\nActivity: What are the major challenges of the next 20 years, and how likely (in our group\nopinion) is each to end in disaster?\nPeak Oil Nuclear War Water Shortages Food Shortages Bio-terrorism Global Warming\nES\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nES.256 The Coming Years\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture 6: The Singularity",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/es-256-the-coming-years-spring-2008/e29f28d2254fa55e12767cef7bb36ac8_MITES_256S08_Lec06.pdf",
      "content": ".256 -- The Coming Years\nSpring '08\nLecture 6 - The Singularity\nJames Rising\nMIT OpenCourseWare\nWhat did you think of the reading?\nIs the singularity likely? Is it inevitable? Will it happen in 10 years or 100? What technologies will drive\nus toward singularity?\nHow fast can humans handle change?\nRemember when the cell phone hit MIT? One year, all the frosh came in with their new-fangled devices; by\nthe next year, all the upperclassmen had them too. How significant of a cultural shift did that technological\nchange produce?\nWhat will the approach to the singularity be like?\nAs we approach the singularity, not only will technological change become more rapid; so will scientific,\npolitical, cultural, and artistic change. The nature of work, play, and relationships will change- as they\nalways have, at a slower pace- now over the course of years instead of centuries.\nWhat technological shifts will characterize the early singularity?\nNanotech: nanobots will permeate our bodies and the air; we will interact with nanotechnology in\n-\nhome and work.\nArtificial Intelligence: A.I. will become a normal part of everyday life, as you interact with it in your\n-\nhome; science will begin to be progressed by A.I.\nBiotech: We will use technology to augment our minds and our bodies.\n-\nNote that many of these trends have already begun.\nAre we already there, as far as humankind is concerned?\nThe rate of progress in science outstrips our ability to keep up with it. Far more technological and\ninformatic inventions are produced than we have the capacity to embrace. Maybe the singularity-proper\nwon't appear any different from this.\nDo we want the singularity? Can we stop it?\nIs the singularity good for humanity? Could we choose to roll-back certain kinds of progress- like the\nJapanese after inventing the gun- and keep progress on a human level?\nES\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nES.256 The Coming Years\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture 7: World Changing, Revelations, and Revolutions",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/es-256-the-coming-years-spring-2008/f2354aab0db1aeea4a9a04c2e9a782af_MITES_256S08_Lec07.pdf",
      "content": ".256 -- The Coming Years\nSpring '08\nLecture 7 - World Changing, Revelations, and Revolutions\nJames Rising\nMIT OpenCourseWare\nWhat did you think of the reading?\nWhat are the basic principles of Parecon? Does Marx's world view describe today? Have his changes\nhappened?\nWhat are the drastic alternatives to capitalism?\nSocial Anarchism - Spanish Revolution\n-\nCommunism - Soviet Union? Cuba? China?\n-\nParticipatory Economics - Porto Alegre (deep democracy)\n-\nLibertarianism - Iceland, 13th c.\n-\nCoupon Societies - Seattle\n-\nSocialism and Social Democracy Left - Norway\n-\nGovernment-Assisted Capitalism - United States\n-\nFeudalism - Europe\n-\nHunter-Gatherer - Ancients\n-\nMutualist\n-\nGift Economy - Burning Man\n-\nCommand Economy - Cuba\n-\nNote: American capitalism is a complex arrangement, where government safety nets and services and\ncorporate welfare are essential \"external\" elements.\nNote: While capitalism has made the United States the largest single economy in the world, our Human\nDevelopment Index is only 12th.\nIs revolutionary change possible?\nIt's probably even inevitable. Remember, catastrophes- including world-changing revolutions and paradigm\nshifts- are lurking under ever grain.\nA technique called \"World Work\" has been developed for situations where change seems impossible, like\nrace relations, to take advantage of the potential of people to change.\nWhat will cause it to happen?\nProbably as a result of many over-determined forces. These include:\nInfectious Change the ability of social networks to grow exponentially\nLeap-frog Technologies developing nations can jump ahead by using new technology while more developed\nnations need to uproot existing infrastructure\nNew Paradigms many of our current paradigms are stale and ready for change\nPower of Information the ability for information to circumnavigate the globe is incredible now\nES\n\nLecture 7\nWorld Changing, Revelations, and Revolutions\n.256, Spring '08\nHow will it happen?\nAgain, probably many different stories will be told. There will be revolution, but the changes will also\nbe extensions of existing trends. Creative new subcultures will push in some directions, and supporting laws\nwill push in others. Existing institutions will change from inside, as well as new institutions wills come into\nexistence, expand and duplicate, and displace current institutions.\nWhy hasn't the revolution happened yet?\nAre we still lacking proper solutions? Do we need sufficient discontent with current systems?\nES\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nES.256 The Coming Years\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture 8: Future Politics",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/es-256-the-coming-years-spring-2008/af14f43717308ffbd89d9349373993ff_MITES_256S08_Lec08.pdf",
      "content": ".256 -- The Coming Years\nSpring '08\nLecture 8 - Future Politics\nJames Rising\nMIT OpenCourseWare\nWhat did you think of the reading?\nThis is a fantastic work, and good reference material. I was a little surprised that this 2003 - 2020 version\nwas an improvement over the 2000 - 2015 version, given the potential political motivations, but I found the\n2000 - 2015 version to be very simplistic in its world view (it concentrated on drivers and simple trends).\nWhich are the developing countries ready to make a splash?\nThe acronym is BRIC: Brazil, Russia, India, and China. Also on the short list of countries to watch are\nIndonesia and South Africa.\nWhat will the development of these countries do?\nCurrently, we just have a lot of \"Made in China\"-ness and outsourcing to India.\nWill the Western world need to learn Mandarin? Will the transition be peaceful? How will the injustices\nof the Chinese government play out on a world stage?\nHow will they change world culture? How will they enforce their vision of economics, justice, and them-\ncentrism?\nWhat is development?\nThis reading assumes that \"development\" is the same as \"market development\" (expansion, greater GDP).\nSuch is the economist's vision of development. But many developing countries have a different sense of what\nit means to develop.\nBy what metric should the most important countries in the world be determined?\nHow long will it take?\nRemember how fast cell phones changed the US. The changes were even more drastic in some developing\nareas, which went from very limited phone access (a village phone booth), to everyone having a cell. What\nleap-frog technologies could bring them suddenly into the developed world?\nMore likely than adopting our own technologies and leap-frogging over developed countries by virtue of\ntheir lack of antiquated infrastructure, developing countries will attach to entirely different technological\nconstellations. For example, RockBand is a technology that's perfect for the United States. But it doesn't\nmake sense in Japan, where people don't have the space in their homes. However, cities like Tokyo have\nKaraoke bars on every block- maybe a RockBand Karaoke franchise will pick up.\nWhat will this increase in the total global economy be like?\nBig players will get bigger. The long tail will get longer. World-wide shifts will become easier and more\ndrastic. Cross-continent communication will become easier and more common. Western workers will have\nto compete with BRIC workers; western inventors will have to watch BRIC inventors.\nIs globalization inevitable?\nNot just market globalization, but cultural globalization- the predominance of a single world culture, by\nvirtue of the easy exchange of culture. What would it be like? Will we end up with just one language? One\nset of laws?\nWhat role does the US play in a booming world?\nDo we sit back and welcome, or pursue our \"project for an America century\"? Will there be a world-wide\nlegal organization, to enforce basic social, environmental, and economic justice? What role will the US have\nin developing that?\nHow will the US respond to being toppled?\nCan we handle the humbleness? How will nations we've wronged treat us when they have the upper\nhand?\nES\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nES.256 The Coming Years\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}