{
  "course_name": "The Ancient World: Greece",
  "course_description": "This course elaborates the history of Ancient Greece from the Bronze Age to the death of Alexander. It covers major social, economic, political, and religious trends. It also includes discussions on Homer, heroism, and the Greek identity; the hoplite revolution and the rise of the city-state; Herodotus, Persia, and the (re)birth of history; Empire, Thucydidean rationalism, and the Peloponnesian War; Platonic constructs; Aristotle, Macedonia, and Hellenism. Emphasis is on use of primary sources in translation.",
  "topics": [
    "Humanities",
    "History",
    "Ancient History",
    "European History",
    "Literature",
    "Classics",
    "Humanities",
    "History",
    "Ancient History",
    "European History",
    "Literature",
    "Classics"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 3 sessions / week, 1 hour / session\n\nSyllabus Archive\n\nThe following syllabi come from a variety of different terms. They illustrate the evolution of this course over time, and are intended to provide alternate views into the instruction of this course.\n\nFall 2010, Steven Ostrow (\nPDF\n)\n\nFall 2009, Steven Ostrow (\nPDF\n)\n\nFall 2008, Steven Ostrow (\nPDF\n)\n\nFall 2007, Steven Ostrow (\nPDF\n)\n\nFall 2006, Steven Ostrow (\nPDF\n)\n\nFall 2005, William Broadhead and Steven Ostrow (\nPDF\n)\n\nFall 2004, William Broadhead and Steven Ostrow (\nPDF\n)\n\nDescription\n\nThis course elaborates the history of Ancient Greece from the Bronze Age to the death of Alexander. It covers major social, economic, political, and religious trends. It also includes discussions on Homer, heroism, and the Greek identity; the hoplite revolution and the rise of the city-state; Herodotus, Persia, and the (re)birth of history; Empire, Thucydidean rationalism, and the Peloponnesian War; Platonic constructs; Aristotle, Macedonia, and Hellenism. Emphasis is on use of primary sources in translation.\n\nClass Participation\n\nYour grade for class participation will be based on the following:\n\nAttendance\n\nYou are required to attend both the Tuesday/Thursday lectures and your Friday discussion section every week.\n\nReading\n\nYou are required to complete all reading assignments in time for the meeting with which they are associated, as indicated on the schedule.\n\nActive Participation\n\nYou are expected to arrive at your weekly discussion sections having completed all the reading and prepared to pose questions and actively to contribute to the discussion of the material covered that week.\n\nPapers\n\nThe four required writing assignments for this course are as follows:\n\nPaper 1\n\nFive to six pages in length, the first paper will be due on lecture 11.\n\nPaper 2\n\nFive to six pages in length, the second paper will be due on lecture 23.\n\nRevision\n\nSince this course has been designated as a CI subject, all students are required to revise and resubmit one of their papers. In our case, you will be required to revise and resubmit either Paper #1 or Paper 2. Students who receive a grade lower than B on Paper 1 will be required to revise that paper; all others may choose which of the two papers they would prefer to revise. As part of the revision process, all students will be required to attend a 30-minute tutorial with the writing tutor for this course, at which you will have the opportunity to discuss strategies for improving the quality of your writing.\n\nPaper 3\n\nTen to twelve pages in length, the final paper will be due at the last meeting of the course, on lecture 36. The final paper is intended not only to be longer, but also to be wider in scope and more adventurous in argument. Students will, with guidance, choose their own topics for these papers and will be required to submit a substantial outline of their proposed topic and argument no later than lecture 31. Students are strongly encouraged to schedule a second tutorial with the writing tutor to discuss the outline of their final paper.\n\nCourse Requirements and Grading\n\nActivities\n\npercentages\n\nClass Participation\n\n25%\n\nPaper 1 (5-6 pages)\n\n20%\n\nPaper 2 (5-6 pages)\n\n20%\n\nPaper 3 (10-12 pages)\n\n35%",
  "files": [
    {
      "category": "Resource",
      "title": "delphi_paper.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-301-the-ancient-world-greece-fall-2004/ced4bf9d51413be222998dffa58c58f6_delphi_paper.pdf",
      "content": "12/09/2004\nSteve Fredette\nFinal Paper\nAncient Greece\nThe Center of the Greek World: The Myth and Reality of Delphi\nThe legend goes that Zeus took two eagles and released them at different\nends of the world, one in the east and one in the west. When they met again, it\nwas in Delphi, which was thus declared the center of the world. As in many\nmythical stories, which attempt to explain a given phenomena through acts of the\ngods, there was surely some reason behind this story. In other words, in some\nway the Greeks must have seen Delphi as the center of the world. Looking back\nthrough history, ways in which this mythical claim was true can be examined. To\nbegin, Delphi was certainly a great and important religious center. People from\nall over Greece came to visit the oracle, and the temple of Apollo was built\nthrough contributions from city-states throughout Greece. The Pythian Games in\nDelphi, held every four years, was an event which brought together all of Greece.\nMany Greek city-states also set up treasuries in Delphi which represented a\nmore peaceful method of competition than the wars were parallel. Much Greek\nhistory passed through and was influenced by Delphi, and Delphi certainly\nrepresents and symbolizes the panhellenism of Greece. In Delphi, the\nindependent nature of each individual city-state was represented through the\nindividual treasuries. At the same time, these treasuries were all located in the\nsame sacred ground and all the city-states collectively supported the temple and\nDelphi's public buildings. Delphi's independence as a panhellenic site was also\nprotected by all Greek city-states. Delphi sits at the center of Greek religion,\n\npolitics, and history, and is certainly worthy of the claim that it was the center of\nthe Greek world.\nOther myths point to Delphi as the center of Greece as well as the story of\nthe two eagles. One myth tells that Apollo came down from Mt. Olympus to\ndestroy Python, the serpent who guarded the original shrine to the earth-mother\nGaia. As Homer told the story, \"he killed the fearsome dragon Python, piercing it\nwith his darts\" (http://www.pantheon.org/articles/d/delphi.html, 12/08/2004).\nThen, after killing Python, Apollo left for a time to make amends for this deed.\nUpon his return, Apollo set up his temple, and at the place where the serpent\nwas killed, an omphalos stone was set in the ground. The omphalos stone\nrepresented the \"center of the earth,\" or \"navel of the world.\" Again here is a\nreference to Delphi as the center of the earth.\nThere is also a legend that says Apollo jumped aboard a Cretan ship in\nthe form of a dolphin and brought the sailors to Delphi. Upon arrival, he turned\ninto a handsome young man and asked the sailors to stay and be priests in his\ntemple. This myth explains how the location came to be called Delphi, because\nthe Greek word for dolphin was delphis. The word delphis was also Greek for\nwomb, (connected to dolphins, since they were mammals, not fish, and thus had\nwombs) which may also have been connected to the idea that Delphi was the\ncenter of the world. (http://iam.classics.unc.edu/loci/del/16_hist.html,\n12/08/2002). Whatever the myth, it is clear that Delphi was regarded as a central\ncity to the whole of the Greek society throughout much of its history.\nTruly, the Delphic oracle played a central role through many centuries of\nGreek history. It is hard to pick up a history book on ancient Greece without\nreading about a decision which was made based on consultation of the Delphic\noracle. In the first book of The Peloponnesian War, for example, Thucydides\ntells a story about the Epidamnians. In the story, the Epidamnians were hard\npressed at war, and when the Corcyraeans refused to help them, they \"were in a\n\nquandary about what to do next. So they sent to Delphi and inquired of the god\"\n(Thucydides, The Peloponnesian War 1.25). The oracle gave an answer, and\nthey then proceeded to follow its advice. Such inquiry of the oracle in political\nmatters was common to city-states from all over Greece and was found in much\nof Greek history. In Plutarch's Lycurgus, one story goes that Lycurgus had his\npeople swear an oath that they would abide by his laws until he returned from\nDelphi. Traveling to Delphi, he \"sacrificed to the god, and then asked whether\nthe laws he had made were in fact good enough to guarantee the material and\nmoral welfare of the state. The god replied that the legislative measures that he\nhad taken were good, and that by keeping to Lycurgus' constitution the state\nwould continue to be held in highest honor\" (Plutarch, Lycurgus 29). In order to\nkeep his people abiding by his laws, he killed himself and thus never returned to\nSparta to free his people from their oath. The oracle's response, history revealed\nas quite accurate, as the Spartans were the most powerful Greek city-state for a\nlong time afterwards.\nThe accuracy of the oracle in the case above was not an anomaly. Often,\nin fact, the Delphic oracle (also called the Pythian oracle) was quite accurate.\nThis only increased Delphi's prominence, leading it towards becoming \"the center\nof the world.\" In Herodotus' account of Croesus, the idea that the Delphic oracle\nwas truly the best oracle, and therefore the only one worth consulting is laid out\nclearly. Croesus sends men to many different oracles and instructs them to go to\nthe respective oracle at a specific time and ask what Croesus was doing at that\nvery moment. According to the story, only the Delphic oracle gave an answer\nwhich was correct, and thus Croesus declared \"that the oracle at Delphi was the\nonly genuine one in the world, because it had succeeded in finding out what he\nhad been doing\" (Herodotus, The Histories 1.48). This reputation was supported\nby many other cases, and kept people coming back for hundreds of years to\nfollow.\n\nThis is not to say that the Delphic oracle was always clear. According to\nHeraclitus, a philosopher around 500 BC, the Pythia never gave a straight\nanswer. The oracle \"neither conceals nor reveals the truth, but only hints at it\"\n(http://www.aroundparnassos.com/history/, 12/8/2004), Heraclitus said. Yet even\nambiguous answers or unclear answers could be interpreted after the fact as\nbeing valid, and thus the fame of the Delphic oracle was not marred. The\noracle's response to the Athenians that \"...the wooden wall only shall not fall, but\nhelp you and your children...\" (Herod., The Histories 7.141) was not clear at all,\nand the Athenians had many ways to interpret it. Themistocles interpreted it as\nmeaning they should put their effort towards their navy and their wooden ships\nwere what the oracle meant by wooden walls. When the Athenians were\nvictorious at sea, it was declared that the oracle was correct and that this had\nindeed been the meaning. One could go on and on about how correct or valid\nthese oracular messages actually were. Yet, without going into a discussion\nabout the oracle's methods or methods of fortune telling, let it simply be said that\nthe Greeks believed that these prophesies held some truth. The point is that due\nto its success, people came from all over Greece. Thus, one can imagine that if\nthey were in Delphi in ancient times, they would run into people from all over\nGreece and could learn quite a lot about the current affairs of the world. The\noracle was also consulted often for commercial ventures and colonization efforts,\nas well as personal questions of all sorts, and so one might also imagine that a\nwhole history of Greece could be observed through Delphi - a history covering\npolitical movements as well as economic and social structure. Viewed in this\nway, Delphi really seems to be the center of the Greek world and much of Greek\nhistory.\nYet not only did Delphi bear witness to a great deal of Greek history\nthrough the Pythian oracle, it also had a great deal of power to change Greek\nhistory. When the oracle was given, people listened and took it seriously. When\n\nthe Alcmaeonidae bribed the priestess to tell the Spartans that they must\noverthrow the Athenian tyranny, the Spartans proceeded to do so against their\nwishes. As Herodotus describes, \"The Pisistratidae were good friends of theirs:\nbut no matter - the commands of God were more important to them than human\nties\" (Herod., The Histories 5.63). The demands of Apollo thus carried a lot of\npower. If Apollo told a city-state to do something, they most likely would comply.\nIn another case, Apollo orders Athens to return the Delians, and they\ncorrespondingly do so. As Thucidydes describes, they \"brought back the Delians\nto Delos, moved by ... the commands of the god at Delphi\" (Thuc. The\nPeloponnesian War, 5.32). There was a lot of power in the fact that Greeks\nbelieved that the oracle was absolute. The idea that the oracle couldn't be\nwrong, and that its command must be followed was expressed even by\nphilosophers such as Socrates. Plato relates Socrates' views in his Apology, in\nwhich he has Socrates responding to the oracle's claim that Socrates was the\nwisest. \"What then does he mean by declaring that I am the wisest,\" Socrates\nsays. \"He certainly cannot be lying, for that is not possible for him\" (Plato,\nApology 21). Whether or not Socrates himself actually believed this, he was\ncertainly affirming the common view about the oracle in attempting to assert that\nhe was not an atheist. The oracle accordingly, had power over all of Greece, and\nin this way was central to Greek history.\nIn many ways Delphi can be seen as a central symbol of panhellenic\nGreek society. While most of Greece was composed of small independent city\nstates who were often enemies of one another, they were still held together by a\ncommon language and common religious beliefs. While an Athenian would have\nthought of himself as primarily an Athenian, and a Spartan as a Spartan, he\nwould probably have had some concept of being part of the larger Greek society\nas well. The fact that there were terms like \"medizing\" and that there was a\ncommon effort to expel the Persians show this panhellenism. Delphi, as well, is\n\nan example of the Greeks caming together for a common cause. As one of the\nfour great panhellenic sanctuaries where festivals and athletic games took place\n(the others were Nemea, Isthmia and Olympia), Delphi saw people pour into the\ncity every four years. The games brought contestants and spectators from all\nover Greece and even brought foreigners. Success in the games gave the\nathletes much prestige and honor, and they would have been met with respect\nthroughout all of Greece. The nature of the games was very sacred and\nritualistic, and control over the games gave a lot of power to Delphi.\nDelphi was set apart from the other sanctuaries though, in that it also was\nthe place of the temple to Apollo and numerous treasuries. This was another\ngreat attraction which brought together people from all over Greece. For\nexample, in 548 BC, and again in 373 BC, the temple to Apollo was destroyed,\nthe first case due to fire, the latter to an earthquake. In both cases though, the\ntemple was rebuilt through contributions from all over Greece, as well as Egypt\nand Lydia in the first case (http://iam.classics.unc.edu/loci/del/16_hist.html). As\nHerodotus describes, when \"the Delphians went round from city to city asking for\ncontributions, Egypt was by no means least in giving assistance\" (Herod., The\nHistories 2.180). While the context of this passage was of a discussion of Egypt,\nit is clear from this excerpt that the Delphians would expect contributions for their\nsanctuary from all parts of Greece. Certainly massive amounts of wealth flowed\ninto the city, and through panhellenic contributions, Delphi was also able to build\nnumerous other public buildings. In the 5th century BC a stadium was built and\nlater, in the 4th century, a theater was built. There was also a public gymnasium,\na magnificent building called the Tholos, and no doubt many other buildings\n(http://www.culture.gr/2/21/211/21110a/e211ja01.html, 12/08/2004).\nPerhaps more significantly, city-states from all over Greece set up\ntreasuries in Delphi, erecting grand monumental buildings dedicated to the gods.\nThus in one central location, city-states representing all of panhellenic Greece\n\nbuilt together in relative peace. Enemies and allies alike shared the sacred\nground that these treasuries were built on, showing just how highly the respect\nfor Delphi was across all Greece. A great example of this is that after defeating\nthe Athenians in the Peloponnesian war, the Syracusans built a treasury in\nDelphi right across from the treasury of the Athenians\n(http://www.aroundparnassos.com/history/, 12/08/2004). Essentially, these\ntreasuries were buildings to house dedications. Through the dedications, many\nhistoric events could be seen, marked down at Delphi through some offering or\nanother. A part of the plunder from many major battles was always set aside to\nbe sent to Delphi. One example of this from Herodotus tells how after the\nGreeks had won some victory over the Persians, \"they then turned to the division\nof plunder, and sent to Delphi the 'first fruits' set apart for the purpose; from these\nwas made the statue, eighteen feet high, which had the beak of a ship in its\nhand, and stands beside the gold statue of Alexander of Macedon\" (Herod., The\nHistories 8.121). Again, talking of a victory by Pausanias, Herodotus writes,\n\"when all the stuff had been collected, a tenth was set apart for the god at Delphi\"\n(Herod., The Histories 9.81). Dedications were a way to show off to the rest of\nthe world, to show just how victorious a battle was, or to show just how wealthy a\ncity-state was. Siphnos, for instance, was one of the richest states of Greece,\nand built a magnificent temple to show off their wealth. Similarly, individuals with\nenough success made dedications on their own. For example, Polyzalos, a\nSyracusan, celebrated a victory at the Phythian Games of 474 with the\ndedication of a bronze statue, now famously know as the 'Charioteer'\n(Hornblower, The Greek World p. 46). Another example comes from Herodotus,\nwho describes a man at one point as \"Euelthon, who dedicated the remarkable\ncenser in the Corinthian treasure-house at Delphi\" (Herod., The Histories 4.162).\nThe idea that the various dedications in Delphi marked a city-state's success for\nall the world to see adds to the understanding of why Greeks saw Delphi as the\n\n\"navel of the world.\" These were definite signs, and when after a certain battle in\nthe 9th year of the Peloponnesian War, \"both sides set up trophies and sent\nspoils to Delphi\" (Thud., The Peloponnesian War 4.134), it was unclear exactly\nwho was victorious.\nThe desire for Delphi to be accessible to all Greeks and for the treasure\nthere to be kept sacred was an important one. This is well illustrated in a peace\ntreaty between the Athenians and the Spartans during the Peloponnesian War.\nBefore the terms of the peace that affect one side or the other are even given,\ntwo terms are set out to protect the access to and the treasure of Delphi. The\nfollowing passage from Thucydides gives the terms.\n\"An armistice was accordingly concluded by Sparta and her allies upon\nthe terms following:\n- As to the temple and oracle of the Pythian Apollo, we are\nagreed that whoever so wishes shall have access to it, without\nfraud or fear, according to the usages of his forefathers. [2] The\nSpartans and the allies present agree to this, and promise to\nsend heralds to the Boetians and Phocians, and to do their best\nto persuade them to agree likewise.\n- [3] As to the treasure of the god, we agree to exert ourselves to\ndetect all wrongdoers, truly and honestly following the customs\nof our forefathers, we and you and all others willing to do so, all\nfollowing the customs of our forefathers. [4] As to these points\nthe Spartans and the other allies are agreed as has been said.\n- ....\" (Thuc. The Peloponnesian War 4.118)\nThe war itself had not been centered around Delphi, yet protection of Delphi was\nthe first thing mentioned in this treaty. This certainly points to Delphi's\nimportance to both parties involved and their mutual desire to see its sacredness\n\npreserved. Despite the war between them, they recognized that Delphi, as the\ncenter of the world, belonged to all of Greece, and should be protected as such.\nPolitically, Delphi was represented by a panhellenic association of city-\nstates called the Amphictyonic League, or Delphic Amphictyony. The\nAmphictyony governed the sacred area of Delphi, whose territory was\nindependent from the surrounding area of the Phocians. The Amphictyony had\nthe power to institute fines and declare sacred wars, often pertaining to claims\nthat the offending party cultivated sacred land. Having control of Delphi, which\nwas so centrally important to the Greek culture, was thus a source of much\npower. Consequently, control of the Amphictyony was a source of struggle\nbetween city-states. One case of this is given by Hornblower, who states that \"it\nwas arguably in order to secure more direct control of an amphiktionic vote that\nthe Spartans founded a new city at Herakleia\" (Horn., The Greek World p. 28).\nHornblower then continues on to argue that struggle for influence at Delphi\nplayed a larger part in the First Peloponnesian War than some might believe.\nOn the other hand, while there was struggle between states over control at\nDelphi, protection of Delphi as a panhellenic site was agreed upon by both sides,\nas already illustrated by the terms of the treaty given above. In a sense, the care\nof Delphi was seen as an obligation of the whole of Greece. The Sacred Wars,\nalthough often politically motivated for other reasons, generally were fought in\norder to free Delphi from the Phocians, who at various times took over Delphi\nand its sanctuary. Plutarch describes how Solon gained popularity \"with the\nspeech he made on the temple at Delphi, to the effect that the Greeks should not\nstand idle while the Cirrhaeans violated the oracle, but should come to its\nassistance and help the people of Delphi defend the god. In fact it was because\nthey were won over by his arguments that the member-states of the\nAmphictyonic League went to war\" (Plut., Solon 11). Thus the argument that\nGreeks must protect the sanctity of Delphi was a convincing one, and an\n\nargument that perhaps most Greeks would have agreed with. Delphi belonged to\nall of Greece. They all contributed money to it's upkeep and they contributed\ntroops to its defense.\nAs a symbol of panhellenism, Delphi's influence and greatest period\nfollowed closely with the rise and prominence of panhellenism. The history of the\nPythian oracle goes back at least as far as the seventh century BC, when Delphi\nwas declared independent, and the seat of the Amphictyony was moved there\n(http://iam.classics.unc.edu/loci/del/16_hist.html). Delphi's fame only continued\nto grow with the prestige of the oracle, through the Persian Wars, through the\nPeloponnesian War, throughout the ages when Greece was defined as a\ncollection of city-states. It was in the period after the panhellenic age that the\noracle thus started to decline. While there were still lots of visitors to Delphi and\nthe oracle in the period after Philip controlled all of Greece, the number of people\ndeclined (http://www.aroundparnassos.com/history/). This would be the trend for\nthe rest of its existence, despite efforts from people like the Roman emperor\nHadrian, who undertook some building in Delphi in the early 2nd century AD.\nWhile Delphi was not the center of an empire like Athens after the Persian\nWars, or like Sparta or Thebes after the Peloponnesian War, it was the center of\na greater culture of all Greeks. It was the center of the religious world, and the\ncenter of a history which lasted longer than any empire the Athenians or\nSpartans may have had. Delphi, truly was a place worthy of its title."
    },
    {
      "category": "Resource",
      "title": "fin_pap_pwar_dne.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-301-the-ancient-world-greece-fall-2004/d93c0fe895a80042a6f687eb75ad6518_fin_pap_pwar_dne.pdf",
      "content": "Final Paper:\nCheryl Texin\nThe Peloponnesian War\n21h.301\nThe Peloponnesian War:\nThe Struggle for Security\nIn the years leading up to the Peloponnesian War Greece was ridden with strife\nand discord. This generated fear in the city-states that stood to lose influence and elicited\nhope in those who stood to gain influence. The major players in the war were Athens and\nSparta, but most of the city-states on the Greek mainland and nearby islands were\ninvolved at some point. The underlying motivation for the conflict was the desire for\nsecurity aggravated by the power shifts that arose in the aftermath of the Persian Wars.\nSparta and her allies initiated the conflict with a desire to protect themselves against the\nnewly demonstrated power of Athens. The dependence on alliances combined with the\ninconsistent nature of the alliances themselves exacerbated the struggle for security.\nLastly, Athens' pursuit of empire, itself founded in Athenian security, spiraled out of\ncontrol to prolong the war. These three security issues, the problems regarding Athens'\nrise to power, the unstable systems of alliances pervading Greece, and the increasing\nexpansion of Athens, were instrumental in shaping the Peloponnesian War from start to\nfinish.\nSparta had been the dominant force in Hellas for a long time and Athens' growing\npower posed a terrific threat to that previously unrivalled strength. With a stratified,\nmilitaristic system of government that had been in place for over 400 years1 the Spartan\nsystem had developed a military far greater than any other in Greece. The hoplite army\nwas renowned in the Greek world, and indeed all of Spartan society was a dedicated war\nmachine. At the top of the social structure was a fighting class that was not allowed to\nengage in agriculture or business, but was raised solely to be full-time hoplite soldiers.\nAt the bottom of the social hierarchy there was the lowest and also the largest class, the\nhelot slave population. These slaves performed agricultural labor and were therefore\nextremely important to the survival of the rest of the population2.\nSparta's slave population was its largest security issue and one they had been\nunable to resolve despite centuries of internal conflict. The helots suffered brutal\n1 Thucydides. History of the Peloponnesian War. NY: Penguin Books, 1972. Thuc. 1.18, pg 45\n2 Broadhead, William. Lecture, Oct 7\n\nFinal Paper:\nCheryl Texin\nThe Peloponnesian War\n21h.301\ntreatment and Sparta constantly feared that they would rise up. This was especially\nworrisome when Sparta was at war, because if an attacker should move into its main\nterritory, the helots in addition to the attacking force could overwhelm Sparta's military.\nSparta also could not afford to send any significant portion of its military far from its\nmain lands since it always had to be prepared to put down a revolt3. Sparta's need to\nmaintain control at home made them reluctant to send forces north to fight the Persians in\nthe Persian Wars. Sparta's military policies not only allowed Athens to become a force\nto counter that of Sparta, but actually forced Athens to become a strong power.\nSparta's traditional prowess can be seen in its control over the long-standing\nPeloponnesian League, an alliance of city-states. The members of this league were\nostensibly equal, but Sparta held all of the power, as the league was founded on the\nstrength of Sparta's hoplite military. Each city-state made a bilateral alliance with\nSparta, and swore to follow them. Sparta dictated when the league would go to war, in\nwhich case Sparta would have complete control, even over each allied contingent.\nExcept when at war, each member of the league was autonomous4. The promise of elite\nSpartan military support provided security for the member city-states, and Sparta had\nadditional forces it could call on in the event of a helot revolt.\nAthens was not a weak power, but did not have the formidable reputation of\nSparta. However, Athens' role during the Persian Wars and its aftermath set the stage for\nthe Peloponnesian War by demonstrating that Athens was a significant military force in\nits own right. Whereas Sparta, in the southernmost region of the Greek mainland, had no\nneed to rush to combat the Persians in the far north, Athens was nearer to the invasion\nand wanted to prevent the Persians from reaching Attica if at all possible for its own\nsecurity. Therefore, Athens was helping itself by advocating a Greek alliance and trying\nto protect the northern city-states. With the famous military might of Sparta playing little\npart in the fighting, Athens was able to demonstrate that its army was capable of\nexecuting successful campaigns as well. The Persian Wars also showed Athens the\nimportance of a strong navy, and they began to build it up5.\n3 Hornblower, Simon. The Greek World 49-323 B.C. London: Routledge, 1996. pg 119\n4 Broadhead, Nov 2\n5 Broadhead, Oct 26.\n\nFinal Paper:\nCheryl Texin\nThe Peloponnesian War\n21h.301\nAthens' performance against the Persians made them a leader among the Greek\ncity-states. Since the Persians had not been entirely driven out of Greek waters, many\ncity-states remained nervous about their defenses and they turned to Athens, who\ndeveloped a Greek alliance. Like the Peloponnesian League, this Delian League was\ndesigned to be democratic, with the policy decided by an assembly in which each\nmember state had an equal vote, but Athens was really at its head. The Athenians\nprovided the commander for the Greek offensive, dictated the contributions of the other\nstates in the league, and were in charge of distributing those contributions. This setup left\nAthens in control of the joint navy and large treasury of the league, further increasing\nAthenian power. As time progressed, Athens began to exhibit more control over the\nleague and its members. While the initial members had voluntarily entered the league,\nthey were not allowed to leave the league, and new members were forced to join. Naxos\nwas the first to revolt and be \"forced back to allegiance6\" but was far from the last. The\nmoney and manpower Athens received through the Delian League allowed her to begin\nto develop an empire.\nThe Peloponnesian and Delian Leagues themselves generated security issues for\nthe Greek city-states. The highly unstable situation in Greece after the Persian Wars\ncaused each city-state to look towards securing its status and independence amidst the\nturmoil. However, the security of one state was frequently dependent on others being\nweak, and this created a severe, and potentially violent, conflict of interests. Greece was\nparticularly susceptible to security issues because it consisted of a large number of\nindependent city-states. Since none of these city-states, not even the dominating powers\nof Sparta and Athens, were strong enough to establish sufficient control to stabilize the\npower hierarchy in the region, and therefore the individual city-states felt safer having\nothers bound by treaty to bolster their own defenses.\nSimilarly, but on a larger scale, neither of the two competing leagues were able to\ndominate the Greek world. This bred difficulties in maintaining the alliances by making\nit easier to cross-over between them. Because the Peloponnesian and Delian leagues\nopposed each other, a city-state that had a grievance within their league could often count\non the other to support the switch. This made the alliances themselves unreliable and a\n6 Thucydides 1.98, pg 93\n\nFinal Paper:\nCheryl Texin\nThe Peloponnesian War\n21h.301\nsecurity problem, even though they were originally instituted to reduce that same\nproblem.\nThe empirical tendencies of Athens were also driven by a need for security. As\nthe Athenians told Melos after devastating their land, \"By conquering you we shall\nincrease not only the size but the security of our empire7\". On the military front, Athens\nfeared that a coalition of city-states would be able to subdue them. Athens' economic\nstrength also depended on their relations with other city-states. \"The inability of Attica\nas a whole to feed a large population8\", composed as it was of infertile land9, meant that\nresources had to be gained abroad. Accessibility to grain routes was necessary to feed the\npopulation, and availability of friendly trading centers was essential for commerce.\nAdditionally, Athens needed to protect its lands and the resources they contained. Since\nAthens had large amounts of territory on the sea, its navy was instrumental in protecting\nits empire and commerce. Athens funded its formidable and expensive navy with tributes\ntaken from the lands under its control, making them indispensable in yet another way to\nAthenian security. As Athens controlled more land, and therefore more resources, it also\nrequired more protection and the process became cyclic. The need for military strength,\nresources, and the protection of her assets made Athens' continual territorial expansion a\nmeasure taken to increase Athenian security.\nThese security issues began to build up once the Persian threat was gone. Despite\nthe alarm felt in response to Athens' increasing power, the Spartans were reluctant to\nmake an offensive move without further provocation, due to their perpetual helot problem\nat home. Sparta did try to subtly limit Athens' expansion as early as 479 BC by trying to\nconvince them not to rebuild their walls when Athens tried to strengthen its position by\nfortifying the city10, and even debated starting a war to prevent Athens from growing\nstronger. Not too long after, though, the helots erupted with enough force that Sparta\nactually called on Athens for help in putting down the slaves11. Athens came to aid\nSpartans, and \"it became clear to the Spartans that they themselves lacked experience in\n7 Thucydides 5.97, pg 403\n8 Hornblower, 125\n9 Hornblower, 127\n10 Thucydides 1.90, pg 88\n11 Broadhead, Nov 2\n\nFinal Paper:\nCheryl Texin\nThe Peloponnesian War\n21h.301\nthis department of warfare12\" and Sparta realized that they no longer had a monopoly\nover military power on land, compounding their fear.\nAthens' new power threatened other city-states as well. Clearly, the city-states in\nthe Delian League that had tried to revolt and those that were forced into the league were\ndispleased with their loss of independence to Athens' expansionist policies, as well as\nthose that feared they would be next. Sparta's ally Megara used Athens' power to aid in\na border dispute with Corinth by joining the Athenian alliance. A request for support\ngave Athens a perfect excuse to set up garrisons, and so Athens was more than willing to\nfight for Megara. The Corinthians' security was hindered now that their rival was allied\nwith a power stronger than them, so this incident spawned Corinth's anger with Athens13.\nEventually, fighting with Corinth, and also dealing with rebellions from Megara and\nEuboea, Athens agreed to a truce. The revolts from within the Athenian alliance and\nMegara's defection from the Peloponnesian League demonstrate the unstable nature of\nthe alliances in Greece that added to the security dilemma of the city-states.\nThe truce did nothing to eliminate the security issues of the city-states around\nAthens, but provided a good excuse for the hesitant Spartans to justify war with Athens.\nA few years after the truce, claims were made that Athens had broken the truce. Aegina\nclaimed that Athens infringed on its independence, which was protected in the truce.\nMegara claimed that Athens broke the truce with them in issuing the Megarian Decree,\nwhich excluded them from trading with the Athenian empire14. The more decisive claims\nwere those Corinth brought against the Athenians, in regards to Epidamnus and Potidaea.\nThis is not to say that there was any more weight to Corinth's claims, but that Corinth\nitself had a significant amount of political influence. Corinth was a naval power, second\nonly to Athens, and therefore a powerful ally or enemy. Both Sparta and Athens were\ndependent on their allies, Sparta because they needed a wide base of support to protect\nthemselves against their own slave population, and Athens because they needed the\ntributes to fund their navy and the people to man the ships.\nThe dispute over Epidamnus reveals how the alliances, made for defense and\nprotection, actually produced a fear of conquest. Epidamnus was a tiny colony involved\n12 Thucydides 1.102, pg 95\n13 Thucydides 1.103, pg 96\n14 Thucydides 1.67, pg 73\n\nFinal Paper:\nCheryl Texin\nThe Peloponnesian War\n21h.301\nin a civil war that had historical ties to both Corcyra and Corinth. Corcyra felt that\nCorinth, who sent aid upon request to aid one of the warring parties, was interfering\nwithout cause, and they turned to Athens for help against Corinth. Athens in turn feared\nthat Corinth, with its already strong navy, would win Corcyra's substantial fleet and\nweaken the margin of their naval superiority, so they established an alliance with\nCorcyra. This alliance was supposed to be defensive, meaning that Athens would only\nprovide aid if Corinth was the attacker and Corcyra could not win on its own, because\noffensive action against Corinth by Athens would break the truce. It turned out to be\ndifficult to distinguish between offensive and defensive actions, and allowed Corinth to\nclaim that Athens took offensive action against them, thus breaking the truce. The small,\nrelatively unimportant island was able to exploit its political connections for their own\npurposes and set off a domino effect, drawing in multiple increasingly powerful allies and\nseverely escalating the civil war into a cause for a major inter-state war.\nThe next year, Athens attempt to tighten control over its tribute-paying ally\nPotidaea created another cause for complaint against the rising power. The reason for\nAthens' ordering of Potidaea to tear down its walls and hand over hostages was an\nAthenian fear that one revolt would trigger others in the area15 which would hurt Athens\npolitically and economically. Athens was acting to preserve the resources and tribute\ngarnered from her allies. Potidaea, promised help from Corinth and Sparta, refused the\ndemands and revolted along with others. Without support from Athens' opponents,\nPotidaea would have had no hope in winning a revolt and would have remained\nsubmissive to the much stronger Athenian power. The result was that Athens and\nCorinth were again openly fighting because of the instability of the alliances.\nAll of these cases claiming Athens had broken the truce were brought to Sparta,\nwhere they were heard in council and debated. The Spartan king Archidamus' analysis\nof the relative strengths of the two powers concluded that it was highly unlikely that\nSparta could win a war with Athens. Sparta had no significant source of revenue, and it\nwould take time to build a navy to match that of Athens. Sparta's strength was in her\nland forces, which were incredibly effective in local conflicts but Athens had territory all\nover Greece, much of which consisted of islands. Athens' naval dominance and wealth\n15 Thucydides 1.56, pg 68\n\nFinal Paper:\nCheryl Texin\nThe Peloponnesian War\n21h.301\nmeant that Athens could always import supplies, so there was no chance of restricting\nAthenian resources16. A Spartan victory required Athens to make a mistake. Despite\nrecognizing that the war was likely to favor Athens, the \"Spartans voted that the treaty\nhad been broken and that war should be declared not so much because they were\ninfluenced by the speeches of their allies as because they were afraid of the further\ngrowth of Athenian power17\". Athens' strength caused Sparta to fear for its security, and\nthe claims made against Athens provided the justification Sparta needed to finally take\naction. Thus, at the outset of the Peloponnesian War, Sparta was acting to prevent further\nAthenian expansion while Athens was trying to protect her empire.\nEach party's goals dictated their policy in implementing the war. Sparta wanted\nto reduce Athenian power, or at least halt the growth of Athenian power. Sparta's\nstrategy was to mount an attack on the countryside of Attica, knowing that it would be\ndifficult to take the fortified city of Athens. Sparta ravaged the land outside the walls\nhoping that the Athenians would come out and fight rather than \"allow their land to be\nlaid waste18\".\nUnder the leadership of Pericles, Athens' goal was to protect its empire. Pericles\nwas known to be a cautious leader and one who did not take chances that put his troops at\nunnecessary risk19 but his military aptitude was evident in his fifteen consecutive\nappointments as military commander20. He designed and initiated a defensive plan for\nAthens. Recognizing, as Archidamus did for Sparta21, that Sparta could not afford an\nextensive engagement, Pericles decided to preserve his troops and focus on \"[diverting]\nmost of their resources to guarding and securing what they already had22\". Expecting an\nattack on Attica, Pericles brought the populace into the city, and sent out the navy to\ncounterattack on the coastal cities of the enemy. The navy was successful in its small\nexpeditions, but sentiment in Athens was factional23, and there were many who were\n16 Thucydides 1.81/1.82, pg 83\n17 Thucydides 1.88, pg 87\n18 Thucydides 2.20, pg 137\n19 Plutarch. Greek Lives. Trans. Robin Waterfield. Oxford: Oxford University Press, 1998. Plut. Pericles\n18, pg 161\n20 Plutarch, Pericles 16, pg 160\n21 Thucydides 1.141/1.142, pg 120\n22 Plutarch, Pericles 21, pg 163\n23 Plutarch, Pericles 11, pg 154\n\nFinal Paper:\nCheryl Texin\nThe Peloponnesian War\n21h.301\nunsatisfied with his purely defensive strategy against Sparta24. Although Athens was in\nname a democracy, Pericles was able to manipulate the people so that he was essentially\nin complete control25 and was able to \"pacify those who were spoiling for a fight26\".\nThe war was stalemated for two years as the Spartans burned farmland and the\nAthenians waited them out until a plague swept through Athens. The plague demoralized\nthe Athenians, who were already angered at being crowded into close quarters in the city,\nand they \"became eager to make peace with Sparta and actually sent ambassadors\nthere27\". The plague also took the life of Pericles, and furthered the faction that was\nvying to take an offensive. Cleon, \"remarkable among the Athenians for the violence of\nhis character28\", came to power in Pericles' place with aggressive plans. He believed that\nassaulting Sparta itself would incite a helot riot, and force the Spartans to stay out of\nAttica. The death of Pericles and the ensuing rise of the hawks in Athens spurred the\nnext phase of the war, with a series of major battles leading up to the Peace of Nicias.\nThe escalation of the war under Cleon was a solid indication that the Athenians\nwere allowing their war aims to grow beyond the original goal of defending what they\nhad. Athens occupied Pylos and fortified it. Sparta was unable to win Pylos back despite\nhard fighting, and Athens ended up capturing some of the famed Spartan hoplites29. This\nhorrified the Spartans, and they immediately decided to \"send ambassadors to Athens\nwith a view for ending the war30\". Athens, under the urging of Cleon and \"aimed at\nwinning still more31\" refused, and then initiated further expeditions against Spartan allies,\nsuch as Corinth and Cythera32. Sparta was in serious trouble, having suffered multiple\ndefeats and fighting a war mainly on the sea and out of their realm of military expertise.\nStill, the Athenians pressed on33. Sparta managed to win some victories at Delium and\nAmphipolis, and with those setbacks combined with revolts from Athenian allies in the\nnorth, Athens agreed to the Peace of Nicias.\n24 Thucydides 2.21, pg 138\n25 Thucydides, 2.65, pg 164 & Plutarch 15, pg 158-59\n26 Plutarch, Pericles 33, pg 174\n27 Thucydides 2.59, pg 158\n28 Thucydides 3.36, pg 212\n29 Broadhead, Lecture Nov 4\n30 Thucydides 4.15, pg 273\n31 Thucydides 4.22, pg 277\n32 Thucydides 4.42, pg 290 & 4.54, pg 296\n33 Thucydides 4.56, pg 297\n\nFinal Paper:\nCheryl Texin\nThe Peloponnesian War\n21h.301\nThe Peace of Nicias did not end the Peloponnesian War, however, as the\nAthenians had not put aside their push for empire. The motivation for the war had\nshifted, becoming a war of conquest by Athens. Sparta, while not entirely happy with the\npeace, and fighting its allies who had refused to even agree to the treaty, had suffered too\nmany losses at the hands of the Athenians. The Spartans' confidence had been shattered,\nand they were not eager to return to combat34.\nAthens, on the other hand, was overconfident. As previously described, Athenian\nwar aims had drastically increased over the first part of the war. The original move for\nterritorial expansion was founded in self-protection, but had spiraled out of control with\nthe successes already achieved inflating Athenian desire for more. The Sicilian\nExpedition Athens developed was ostensibly to aid to their allies there who claimed the\nSyracusans on the island were looking to \"utterly [destroy] the power of Athens\", but was\nin reality a mission of conquest35. Athens was excited to capture the grain and timber of\nthe island36, but knew nearly nothing about the island or the people living there37. Nicias\nargued reasonably that Sicily would not be easy to conquer, and harder to control if it\nwas . However, the Athenians were so focused on the benefits of a victory that they\nrefused to look closely at the possible hazards. The massive force sent over, looking\n\"like a demonstration of the power and greatness of Athens39\", failed to take the island.\nThe expedition had some successes early on, but was overall disastrous for Athens.\nAlcibiades, one of the leaders, was recalled to Athens on the charge of mutilation of\nHermae prior to his departure. Rather than returning to Athens to stand trial, he defected\nto Sparta and helped them relieve Sicily40. Alcibiades' inside information allowed Sparta\nto regain some of their vaunted military reputation with big victories against Athens.\nDespite Nicias' letter explaining the poor situation in Sicily and asking to be recalled,\nAthens sent reinforcements41, and still Sparta shut them down. This renewed Sparta's\n34 Thucydides 5.14, pg 356\n35 Thucydides 6.6, pg 412\n36 Hornblower, 164\n37 Thucydides 6.1, pg 409\n38 Thucydides 6.11, pg 416\n39 Thucydides 6.31, pg 429\n40 Thucydides 6.61, pg 448 & Broadhead Lec Nov 9\n41 Thucydides 7.16, pg 486 & Hornblower, 170\n\nFinal Paper:\nCheryl Texin\nThe Peloponnesian War\n21h.301\nconfidence, and they designed an invasion into Attica itself42. Athens' position kept\ngetting worse, as they suffered a huge defeat at Syracuse that effectively wiped out the\nnavy, but still Athens refused to cut their losses and back out. In the end, Athenian\n\"losses were, as they say, total; army, navy, everything was destroyed43\". Money was in\nshort supply, as most of the treasury had been used to support the expedition in the first\nplace. There were revolts all around the Aegean, encouraged by Alcibiades, and Sparta\nwas gaining momentum. The Spartans were able to set up a garrison in Attica itself at\nDecelea and monetary support from the Persians allowed them to be successful at\nbuilding up their navy44. Athens now began to fall apart entirely, with the city erupting in\nstrife over the miserable failure of the Sicilian Expedition. Finally the Athenians were\nable to pull out a victory at Arginusae, but Sparta was able to recover with the addition of\nPersian support. In the final battle at Aegospotamoi Sparta captured nearly all of the\nAthenian ships, and Athens was utterly defeated with their navy and food imports now\nunder Spartan control45. Sparta had become the sole dominant power in Greece once\nagain.\nSparta emerged victorious in the Peloponnesian War, and Athens was entirely\ndecimated. The treaty that resulted forced Athens to destroy her fortifications and\nbecome a minor ally of Sparta46. She lost her empire so completely that she never\nregained it. The city continued to enjoy a level of wealth, and as a center of culture she\nstill counted among the leading towns of Greece, but her political influence was never\nagain decisive. Sparta was now in an extremely advantageous position, having fulfilled\nall of its war aims in breaking apart the Athenian empire.\nWhere did the Peloponnesian War turn sour for Athens? At the outset of the war\nboth Archidamus and Pericles arrived at the conclusion that Athens was superior in\nmilitary might, financial backing, and tactical position. Sparta's military strategy was\nfounded on hope and as predicted Athens dominated every aspect of the fighting for\nyears. Pericles was \"confident in ultimate victory\" as long as Athens made no mistakes,\n42 Thucydides 7.18, pg 487\n43 Thucydides 7.87, pg 537\n44 Hornblower, 174\n45 Broadhead, Lecture Nov 9\n46 Hornblower, 183\n\nFinal Paper:\nCheryl Texin\nThe Peloponnesian War\n21h.301\nand contained their urge to \"add to the empire while the war [was] in progress47\".\nUnfortunately for Athens, Pericles died in the plague and no one heeded his words. With\nPericles in power, the war was extremely uneventful, but was also going extremely well\nfor Athens, and was likely to continue to go well. Pericles' defensive plan was\nstrategically sound. The victories produced by the aggressive policies initiated after his\ndeath made Athens overconfident and greedy, ultimately leading to the destruction of the\ncity's political power.\nAthens had multiple opportunities to exit the war in a better position than they had\nbeen on entering it, but squandered their chances. Cleon refused to accept a Spartan\nsurrender after Pylos. At this point in the war, Sparta had yet to claim any significant\nvictory, and any treaty would have followed Athenian desires closely. Cleon's rejection\nof peace overtures from Sparta allowed them to win some battles fought out of\ndesperation and regain some morale before Athens settled for peace talks.\nDespite this, the Peace of Nicias was largely in favor of Athens. The treaty\nreturned land taken in the fighting to the other side, and returned prisoners of war as\nwell48. This put the Greek city-states in a position very similar to that at the start of the\nwar, with the Athenian empire intact. At this point Sparta had failed to succeed in their\nwar aim, as they were unable to reduce the threat of the Athenian empire. Additionally,\nthe peace treaty hurt Sparta's military reputation and angered her allies49. Athens had\nfulfilled her original goal of maintaining the status quo. If Athens had kept in mind\nPericles' warning against reaching for empire and let the Peace of Nicias stand, it could\nhave remained a significant power in Greece for decades to come.\nThe Athenians, however, had been overwhelmed with their success, and their\ngreed culminated in the disastrous Sicilian Expedition. Sicily was a mistake from the\nvery beginning, and demonstrates the extent to which Athens was overcome by the desire\nto conquer. The recall of Alcibiades was a devastating error, not only depriving Athens\nof its main proponent for the expedition, but also providing Sparta with valuable\ninformation to use against Athens. Nicias had twice counseled Athens against the\nexpedition, prior to the war and in his letter advising retreat, but was not a strong enough\n47 Thucydides 1.144, pg 122\n48 Plutarch, Nicias 10, pg 193-94\n49 Hornblower, 160\n\nFinal Paper:\nCheryl Texin\nThe Peloponnesian War\n21h.301\nleader to force people to listen. After a hard won victory at Arginusae, Athens recalled\nand executed its generals over a war crime, even though the war was still going on50. All\nof these mistakes demonstrate how Athens was overcome with imperialism to the degree\nof ignoring the reality of the situation. Pericles had originally laid out specific, attainable\ngoals for Athens, but after his death Athens simply wanted more. Had Pericles survived\nto provide a persuasive voice of reason, perhaps Athens would have been satisfied with\nthe Peace of Nicias, since Nicias was unable to convince the people despite all his efforts.\nSparta was victorious in the Peloponnesian War but unable to make that victory\nlast. The Greek states rapidly fell into more squabbling, until Alexander came along and\nconquered all of Greece and Persia. How could an Athenian victory have changed\nhistory? If the plague had not taken the life of Pericles, would he have been able to\nconvince Athens that the Peace of Nicias should last? If Nicias had been more\npersuasive, could he have done the same? Would a strong Athenian empire have taken\nthe place of Alexander in history, or had an entirely different result? There is no\ndefinitive answer to these questions, but the speculation itself proposes the idea that a\nsmall event, or a single person, could have a huge impact on the world. An event of the\nmagnitude of the Peloponnesian War must clearly have an even larger significance in\ndefining history throughout the ages that were to follow.\nSecurity in many guises motivated the Peloponnesian War. The Persian Wars\nshook up the Greek world and the unsteady situation produced drove each city-state to\ntake a close look at its own interests. Sparta was concerned that Athens' newfound\npower could rival its own historic dominance, and smaller city-states feared that Athenian\nexpansion would strip them of their independence. The Peloponnesian and Delian\nLeagues, created to provide a network of support for their members, experienced too\nmany affiliation changes to be effective. Additionally, the backing of the alliances not\nonly encouraged city-states to engage in military operations, but caused small local\nconflicts to expand and include a large portion of the Greek world. Athens, looking\nforward to a future of power and influence, fed off its own successes and growing\nstrength until it ground itself into defeat. While we can never truly know what could\n50 Broadhead, Lec Nov 9\n\nFinal Paper:\nCheryl Texin\nThe Peloponnesian War\n21h.301\nhave happened if a few events were changed, history could have turned out entirely\ndifferent. The Peloponnesian War had a huge impact in its time, and long after as well."
    },
    {
      "category": "Resource",
      "title": "final.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-301-the-ancient-world-greece-fall-2004/789c2a21baa615c3fc172a246b8999cc_final.pdf",
      "content": "City-States and Alliances in Ancient Greece.\nUnderlying Reasons of Their Existence and Their Consequences\nPanayiotis P. Mavrommatis\nDec 8, 2004\nIntroduction\nThe ancient Greek world was much troubled and influenced by politics. While\nother peoples settled to a single form of government, the Greeks were strungling\nbetween monarchy, oligarchy, democracy and tyranny; and while other peoples\nwere forming empires, the Greek cities usually preferred independence, in the form\nof a polis, a city-state, and other times preferred to (or were forced to) join some\nalliances, symmachies. Apart from the several differences that the several cities\nhad, which was one of the reasons why they might wish to stay independent, a\nnumber of other reasons did not favor the formation of alliances, leagues, confed\neracies or empires. On the other hand, Greek cities shared a lot in common, and\nmany other factors did favor the formation of alliances.\nAfter a short review of the Greek cities and alliances formed from the Trojan war\nto the years of Alexander the Great, we explore the reasons why a Greek city would\nlike to join a coallition or would prefer to stay independent. Finally, we present\nsome of the consequences of the two different levels of authority, and present a\nconnection between the ancient poleis with modern nations, and between ancient\ncoallitions with modern ones.\n\nCity-states and alliances in Ancient Greece\nBefore the Trojan War, there is little account for Greek alliances; as Thucydides\nmentions [Thu, 1.III]: \"... Before the Trojan war there is no indication of any common\naction in Hellas, nor indeed of the universal prevalence of the name; ... It was not\ntill Hellen and his sons grew strong in Phthiotis, and were invited as allies into the\nother cities, that one by one they gradually acquired from the connection the name\nof Hellenes; though a long time elapsed before that name could fasten itself upon\nall. \"\nHomer provides us with the earliest accounts for the various city-states of main\nland Greece in the Iliad. Book 2? lists the composition of the Greek army in Troy,\nwith over ? cities, all independent and ruled by their basileis. The expedition to Troy,\nhowever, also constitutes an early example of an alliance formed by poleis, with the\nparticipating armies recognizing Agamemnon, ruler of Argos, as their leader [?, ?].\nMoving on to later years and away from an expedition whose reasons and even\nexistence several commentators have questioned, an important, as it proved for the\nfuture of Greeks, alliance was formed towards the ?when?, the \"Hellenic League\".\nOriginating from the Peloponnesian League but also including Athens and other\nGreek cities, the Hellenic League successfully repelled the Persians from mainland\nGreece. Herodotus lists the cities that participated in the league both in the battle\nof Salamis and in that of Plataea.\nAnother alliance was also present in these\nbattles, however: At the battle of Plataea, Thebes, Boeotia, Thessalia, Macedonia\nand Thessaly fought on the Persian side [Her20, 8,9].\nAfter the success against the Persians, Sparta withdrew from the Hellenic League\nand reformed the Peloponnesian League. Athens took advantage of its contribu\ntion to the success of the Persian wars and of its naval dominance, and given\nthe still existent barbarian danger led a symmachia, which soon turned out to be\nan empire, the Delian League. As Thucydides describes, several cities voluntar\nily joined Athens which decided how many ships and how much money each city\nwould contribute against the barbarian danger [Thu, 1.XCVI].\n\nSoon the two alliances confronted each other. In the Peloponnesian War, the\ngreatest war until then, according to Thucydides, [Thu, 1.I], Sparta, with most of\nPeloponnese, Megarians, Locrians, Boeotians, Phocians, Ambraciots, Leucadians,\nand Anactorians, faced Athens, with the Chians, Lesbians, Plateans, the Messe\nnians in Naupactus, most of the Acarnanians, the Corcyraeans, Zacynthians and\nsome others as well [Thu, 2.IX].\nAfter the fall of Athens in 404 B.C. , Sparta began expanding to \"all four points\nof the compass\" [Hor02, p.212], leading to the creation of a second Athenian con\nfederacy. Thebes was the one who stopped Sparta's dominance this time, with the\nbattle at Leuctra[?, ?].\nPhilip's rise in Macedonia lead to another alliance among Thebes, Sparta, Athens\nand other cities that resisted the idea of Philip's expansion to the south. The battle\nof Chaeronea in 338 B.C. marks the end of the Greek city-state, with the exception\nof some cities such as Athens that survived until later. Without traditional city-\nstates, the leagues created from then on were no longer the same either. Greek\ncities were merged in the Macedonian empire, and in other empires that followed\nthe death of Alexander.\nReasons for independent city-states\nThe most obvious reason why city-states chose to remain independent is the dif\nferences that the various city-states had. In terms of form of government, Athens\nand a number of cities that imitated her were democratic [Her20, 2.XXXVII], while\nmost of the other cities had either an oligarchy, tyranny or aristocracy. Social class\nwas also a point of difference among poleis. Sparta, for example, had a unique\nclassification with Helots, Perioikoi and Spartiates sharing different citizen privi\nleges, while in democratic cities the citizens usually shared equal privileges. Ed\nucation was mostly about philosophy and arts in Athens, and solely military in\nSparta. Some cities had restrictions in trading with other cities, while others were\neconomically dependent mostly on trading. The position of women, although gen\nerally unacceptable, was also different among poleis. All these differences made\nthe existence of independent poleis reasonable.\n\nAside from the obvious differences among the city-states, for several cities, es\npecially for powerful ones, joining an alliance might mean losing their dominance.\nIn many cases, for example, disputes arose as to who should lead the alliance\nand take decisions, and whether the others should obey someone who they might\nconsider inferior or at least not superior. Homer begins the Iliad with such a dis\npute, among Achilles and Agamemnon [?, 1.?]. Later on, during the Persian Wars,\nthe Peloponnesians and the Athenians disputed about the location of the league's\nnaval fight with the Persians. The former were proposing the Isthmus of Corinth,\nwhile the Athenians led by Themistocles insisted on Salamis, which would prevent\nthe Persians from reaching Athens [Her20, 1.?]. City-specific or even personal\ninterests, therefore, several times acted as barriers in creating alliances.\nAnother fact that kept poleis from joining alliances was that often a single mem\nber of the alliance would act imperialistically and abuse the resources of the other\nmembers.\nThere are plenty examples of such actions throughout the ancient\nGreek history. The earliest example is probably in the Iliad, where Agamemnon\ntook Achilles' girl because he had to return his own to her father [?, 1.?]. Athens,\ncenturies later, treated their allies as subjects and not as equals; as Thucydides\nmentions, \"Athens, on the contrary, had by degrees deprived hers of their ships,\nand imposed instead contributions in money on all except Chios and Lesbos. Both\nfound their resources for this war separately to exceed the sum of their strength\nwhen the alliance flourished intact\" [Thu, 1.XIX]. Similar behavior was engaged by\nPhilip and Alexander. The \"allies\" had to contribute in terms of men and arms,\nor else pay a heavy fine [Fer01, p.18]. Thus, imperialistic behavior, which was not\ninfrequent in the ancient Greek history, acted as another barrier in joining alliances.\nMoreover, the possibility of losing the city's distinctive identity, and the unwilling\nness to share a city's history and pride constitute some more reasons to why a polis\nmight rather stay out of an alliance. Sparta, for example, by constitution did not al\nlow the mingling with other Greeks, in fear of its people questioning whether their\nconstitution and way of living was the best they could have. Athens made an effort\nto unite the various city-states in the era of its empire. These efforts, however, did\nnot include political rights (citizenship) to men of other cities. Athenians, on the one\nhand, did not wish to share the advantages of being Athenian, and the other cities\n\nfeared of \"at least partial loss of identity\"[Fer01, p.19]. At this point we could also\nmention that Sparta, which, being special (in the sense of completely different) had\nanother reason against forming an alliance, namely the Helots. An alliance usually\nmeant expeditions, but Sparta could not afford them in fear of the Helot population's\nrevolving. The loss of identity, therefore, the unwillingness to share political rights\nand the dependency of some cities on slaves constituted some further reasons\nagainst the formation of alliances.\nA final reason why city-states remained mostly independent was the existence\nof tyranny in many of the Greek cities. As Thucydides reports, \" wherever there\nwere tyrants, their habit of providing simply for themselves, of looking solely to\ntheir personal comfort and family aggrandizement, made safety the great aim of\ntheir policy, and prevented anything great proceeding from them\" [Thu, 1.XVII].\nHistory provides many examples of tyrants, most of which remained monarchs for\na relatively small period of time, were usually detested by their people and rarely, if\never, did their descendants inherit their power. Osborne explains how the tradition\nof the \"bad tyrant\" evolved, and how most of the tyrants were busy eliminating\nthe members of the elite that opposed them [Osb96, pp.192-6]. Even in cases\nwhere the tyrants were considered \"good\", this might have been due to their efforts\nto show some public work which turned the people's attention away from politics,\nas in the case of the Peisistratids [Osb96, p. 285]. No matter what the people's\nopinion about the tyrants was, therefore, their existence most of the times proved\nanother obstacle in any effort to unity.\nReasons for alliances\nOn the other hand, as we have seen in page 2, alliances between the Greek\ncity-states were not at all infrequent. A number of reasons that motivated the for\nmation of such alliances can be traced throughout the History, the most obvious\none being the common elements that the Greek cities shared. What distinguished\nGreeks from non-Greeks was their language, which was common among Greek\ncity-states in most parts, maybe in several dialects. Greek tradition was also com\nmon for the cities, and Greek mythology was usually shared among them. Religion\nand moral beliefs were also very similar, given the belief to the Olympian Gods and\n\nthe frequent visits to their representatives at Delphi, for example. Archaeological\nevidence enriches our list with architecture and art; Greek cities were influenced\nby each other's patterns. Finally, many of the poleis were founded by others and\ntherefore felt \"blood bonds\" with their founding cities[?]. All these common ele\nments, therefore, that distinguished Greeks from non-Greeks, were a significant\nmotive for the formation of alliances.\nA second cause for alliances was the defense against the Persian danger. The\nformation of the Hellenic League when the Persians started moving towards main\nland Greece was an early example; with the league consisting of many Greek city-\nstates defending themselves in Marathon, Salamis and Plataea. As soon as the\nPersian threat was miles away from mainland Greece, the league broke up, thus\nmaking clear the reasons of its formation. The Delian League, formed soon after\nwas also formed for this reason. Thucydides states \"The Athenians ... fixed which\ncities were to contribute money against the barbarian, which ships; their professed\nobject being to retaliate for their sufferings by ravaging the [Persian] king's coun\ntry.\" [Thu, 1.XCVI]. Thus, even though as it turned out in the end, the Athenians\nturned the alliance into an empire, the barbarian danger was a significant cause\nfor the formation of alliances.\nA further reason to the formation of an alliance was to defend from, or attack to,\nanother existing alliance. There were two examples of such a behavior. First,\nHerodotus informs us about the fears of Sparta: \"If the Athenians are not our\nfriends, but league themselves with the barbarians, however strong our wall across\nthe Isthmus may be, there will be doors enough, and wide enough open too, by\nwhich the Persian may gain entrance to the Peloponnese\" [Her, 9.IX]. These fears\ncontributed to Sparta's decision to join the other forces against the Persians. The\nsecond example is Thucydides' view of the true reasons of the Peloponnesian\nWar. According to the Greek historian, the real cause for the war was the growing\npower of Athens and its alliance (or empire), and the \"alarm which this inspired\nin Lacedaemon\" [Thu, 1.XXII]. Sparta's action was then to (re)form the Pelopon\nnesian League and after some events (the \"immediate causes\") declare war with\nAthens. The existence of alliances, therefore, which might gain power and threaten\nother city-states, was another cause for the creation of even more alliances.\n\nAnother reason for joining an alliance was the inability to stay independent, es\npecially in the case of existing and powerful alliances or empires were having a\nwar with each other. During the Persian Wars, for example, as Herodotus writes,\nalmost all the city-states were forced to join one alliance (the Persian one) or the\nother (the Hellenic League); and those who chose the Persian one were not few,\nsince it was certainly more powerful and its success was more probable. The case\nwhere a city-state might want to exit an alliance was similar. To do so, they usu\nally had to ask for the help of another alliance. During the Peloponnesian War,\nMytilene attempted to revolt and asked from Sparta and its allies their help [Thu,\n3.IX]. Thucydides provides the Mytilenean justification for their revolt: \"How then\ncould we put our trust in such friendship or freedom as we had here? We accepted\neach other against our inclination; fear made them court us in war, and us them\nin peace; sympathy, the ordinary basis of confidence, had its place supplied by\nterror, fear having more share than friendship in detaining us in the alliance\" [Thu,\n3.XII]. Either with the Greco-Persian War, therefore, or with the Peloponnesian war,\nGreek poleis had to choose between one alliance or another.\nConsequences of independent city-states\nThe existence of city-states in Greece that were autonomous and independent\nhad a number of consequences for the subsequent history of the Greek world and\nthe world in general. The first positive consequence is the rise of democracy in\nAthens. The constitution of Athens, as developed by Solon and later improved by\nCleisthenes and Pericles [Plu48, p. 449-59], included many elements considered\ndemocratic today; the major difference being that it only applied to male citizens.\nWithout autonomy and independence, under an empire or a kingdom, for example,\nit is hard to imagine that a city-state could develop a democratic constitution. First,\nthe emperor(s)/king would not like the idea at all, and second, it would be infeasible\nto apply. Given the lack of technological advances of modern society, implemented\na nation-wide democracy would be very hard, given the \"absolute\" character of it,\ni.e. all the people deciding in public gatherings. The rise of Athenian democracy,\ntherefore, is an important consequence of the polis.\n\nThe independence of every city also gave rise to a Greek \"war machine\", Sparta.\nSparta's distinctive identity in education, constitution, way of life and war is evi\ndent from many accounts as well as archaeological findings [Osb96, p.180]. Once\nagain, it is hard to believe that many other cities could have adopted the Lykourgan\nconstitution; especially given their lack of some kind of Helot population, that was\npresent in Sparta and suppor ted the existence of the whole Spartan system. This\nsystem, however, proved essential in the battles of the Hellenic League against\nthe Persians. As Herodotus' account shows [Her20, 1.LXV], the effectiveness of\nSparta in war was directly related to Lycourgos' constitution and regulations. The\ncity-state system, therefore, gave the opportunity to \"specialization\" of a whole city\nin the art of war and the successful confrontance of the Persian empire.\nFinally, we can trace another important consequence of the polis system, the rich\nflowering of the arts and sciences in Ancient Greece. A brief sampling of this de\nvelopment would start from the monumental temples of the 5th century B.C. Athens\nbut of almost every Greek city as well. Furthermore, we can trace architectural\nsculpture, cult statues, pottery, as well as the Doric and the Ionic forms [Osb96,\npp. 259-71]. Other forms of art including the tragedy and the commedy, philos\nophy, poetry and history itself are some further examples of the Greek cultural\ninheritance. It should be recognized that such a cultural activity might also be\npossible even if the city-states were not independent, however, the polis system\ndid favor this development, given the competition among the cities, the democratic\ngovernment of some of them, etc.\nOn the other hand, however, there was at least one very important negative con\nsequence of the city-state system, and that was the collection of wars between the\nvarious city-states themselves. With the Peloponnesian War being the longest and\nthe most devastating, examining the effects of this war is enough to see the degree\nof this consequence. The political changes Sparta imposed on Athens and basi\ncally all Greek poleis led to local hostilities, staseis [Thu, 3.LXXXII]. The economy\nof Athens declined dangerously, and her population dropped dramatically [Hor02,\npp.201-5]. All these demonstrate the adverse effects of the existence of indepen\ndent city-states and the competition that arose between them.\n\nConsequences of alliances\nWhat were the effects of alliances, however, whenever they formed? Once again,\nboth positive and negative consequences can be traced by the formation of al\nliances. The most important positive effect is probably the success against the\nPersians.\n- The economic rise of fifth century Athens and the rise of a strong navy. (as a\nresult of the Delian League)\nNegative consequences:\n- Imperialistic behavior (Athens' expedition to Sicily, Sparta's expedition to Asia\nMinor as soon as the Peloponnesian War ended, Alexander's expedition to\nthe South and the East)\nConclusions - Connection with present\nThe correspondence between\n(a) City-state  Modern nations\n(b) Ancient Greek alliances  Modern international alliances (e.g, EU)\nin terms of having similar reasons for and against alliances.\nReferences\n[Fer01] W. S. Ferguson. Greek Imperialism. Batoche Books, Kitchener, Ontario,\n2001.\n[Her]\nHerodotus. The History of Herodotus. (G. Rawlinson, Trans). The Internet\nClassics Archive, http://classics.mit.edu/Herodotus/histor y.html.\n[Her20] Herodotus.\nThe Histories.\n(A. D. Godley, Trans). The Perseus Digi\ntal Library, http://www.perseus.tufts.edu/cgi-bin/ptext?lookup=Hdt.+9.1.1,\n1920.\n[Hor02] S. Hornblower. The Greek World 479-323 BC. Routledge, London, UK,\n2002.\n\n[Osb96] R. Osborne. Greece in the Making 1200-479 BC. Routledge, London,\nUK, 1996.\n[Plu48] Plutarch. Plutarch's Lives, volume 1. (B. Perrin, Trans.) Harvard University\nPress, Cambridge, MA, 1948.\n[Thu]\nThucydides.\nHistory of the Peloponnesian War.\n(E. P. Dutton,\nTrans) The Perseus Digital Library, http://www.perseus.tufts.edu/cgi-\nbin/ptext?lookup=Thuc.+1.1.1."
    },
    {
      "category": "Resource",
      "title": "hesiod.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-301-the-ancient-world-greece-fall-2004/8e7fbf316c08b9c7311d4bdfd35a9e3e_hesiod.pdf",
      "content": "Hesiod's Works and Days: Moral or Practical Teaching?\nPanayiotis P. Mavrommatis\nMassachusetts Institute of Technology\n21H.301 The Ancient World: Greece\nHesiod's Works and Days is undeniably a didactic poem. It is concerned\nwith real problems of mankind. At a first glance it may seem as a practical guide\nto living and prospering in the Ancient Greek world. The title itself, along with the\nmany parts of the poem that deal with practical issues can lead one to this\nconclusion. A more careful analysis, however, can show that Works and Days is\nmore about morality. Undeniably it also deals with the practice of morality, but the\nmain axis of the poem is not that; it is morality itself.\nThe first part of this paper attempts to present the abundance of moral\nelements in the poem. The occasion of the poem is injustice, but Hesiod does not\nstop there. He talks about war and peace, religion, family as well as society, all\ncrucial issues both then and now. In the second part, I argue against the view\nthat Works and Days is mostly a practical teaching poem. Instead, I trace the\nimportance of practical instruction in the poem as being support to Hesiod's main\nteaching goal, morality.\nProbably the most important issue for the poet is injustice. In fact, it is to\ninjustice that we may owe this poem: Perses, Hesiod's brother has tricked him in\na matter of inheritance. Moreover, the lords, to whom the poet had applied for\njustice, had been bribed by Perses and have misjudged to his favor. The\ncomplaint about this injustice, especially that of the lords, is of great importance,\nsince it reveals the fact that Hesiod (and thus any member of the community)\n\nwas not afraid to accuse the lords in public. Along with injustice, Hesiod warns\nabout a society ruled by the powerful, when he foretells about the future\ngenerations that \"law and decency will be in fists\", (West, Hesiod's Works and\nDays 191). This ethical issue is also presented in the story of the hawk and the\nnightingale. This tale is well known, although in a quite different version, as one\nof Aesop's tales. The main difference between the two versions lies in the fact\nthat, in Aesop's tale, as in almost all of his tales, talking animals simply represent\nsome classes of people. Hesiod's version of the tale, on the other hand, reminds\nus that people are actually very different from animals. In particular, he points out\nthat the law of the jungle that prevails in the world of animals should not\ndominate our world too: \"So spoke the swift-flying hawk, the great winged bird.\nBut you, Perses, must hearken to Right and not promote violence\" (West,\nHesiod's Works and Days 213)\nApart from injustice, a very significant issue for the poet is that of religion.\nReligion appears everywhere in the poem, from the first word, \"Muses\", to the\nlast sentence, \"well with god\" (West, Hesiod's Works and Days 1, 826). The\nbelief that disobeying or tricking the Gods leads to disaster is emphasized by the\nmyth of Prometheus, whose action to steal the fire from Zeus lead to the fact that\na man must work to find his food, as well as to many other evils that were\nreleased from Pandora's box. (Hesiod, Works and Days 48-104) Serving and\nsacrificing to the immortals is another aspect of religion stressed by Hesiod\n(Hesiod, Works and Days 336-7). Moreover, the failure to respect these rules is\nimplied as the main reason for the extinction of the second, Silver race of men:\nAccording to the poet, the Gods destroyed the Silver race since they neglected to\noffer respect to them (Hesiod, Works and Days 135-40).\nHesiod is also concerned with the moral issue of war and peace. While\nHesiod's world \"is a world without war\", (Osborne, Greece in The Making p. 146)\nthe consequences of previous wars are presented in an effort to emphasize the\n\nirrationality of violent actions and the importance of peace. An example is the\ndestruction of the Bronze race of men: With \"woeful works of Ares and with acts\nof violence ... they were laid low by their own hands\" (West, Hesiod's Works and\nDays 146-55) Peace is also praised in a non-mythological context, for its\nbeneficial effects on the land and the people. (West, Hesiod's Works and Days\n225-37)\nMoreover, a substantial part of Works and Days is concerned with the\nrelationships of people with their families as well as with community in general.\nHesiod foresees the decline of his own race, the Iron one, with reference to\npeople losing respect to their aging parents and blasting crude words towards\nthem. (West, Hesiod's Works and Days 185, 330). The poem also provides\nadvice for social behavior, in terms of neighbor relationships and donating to\nsociety. Furthermore, he warns that the actions of a single man may adversely\naffect the whole community. (West, Hesiod's Works and Days 260-6)\nThe above issues are the main moral concerns of Hesiod in Works and\nDays. Beyond these elements, as the title suggests, Hesiod cites much practical\ninstruction as to how to work and when to do so. Even though this advice\nconstitutes a large proportion of the poem (about two thirds of it), a number of\nreasons suggest that Works and Days is more about morality than it is about\npractical teaching.\nFirstly, I argue that most of the practical elements presented in the poem\nare simply used as means to the end of teaching morality. The poem would be\nincomplete without arguments and examples of how to implement the moral\ntheory cited. All of the practical advice found in Works and Days is associated to\none or more moral issues. For example, the largest part and the main theme of\nHesiod's practical advice is work, both in the land and the sea. The poet\norganizes his advice very carefully, providing several subtasks and giving the\n\nproper time margins in which each subtask should take place. However, one\nshould also regard the reasons why Hesiod describes in such detail how one\nshould work. Some of these reasons can be traced in the poem: Hesiod\nmentions \"whatever your fortune, work is preferable, that is, if you turn your\nblight-witted heart from others' possessions towards work\" (West, Hesiod's\nWorks and Days 313-5), giving the moral advantages of work: It keeps you from\nstealing and being jealous of the others. In addition to this, work helps one avoid\nbegging for money or goods from others, a significant moral issue for the poet\nwho himself experiences Perses soliciting for food or employment. (West,\nHesiod's Works and Days 394-6) On the contrary, work allows you to offer\nvoluntarily, a moral action than brings pleasure to the giver. (West, Hesiod's\nWorks and Days 358-61)\nFinally, there are several reasons that suggest that Works and Days is of\nno significant practical value. Despite the length of the practical instruction in the\npoem, the value of this teaching is doubtable, and compared to the moral\nelements that have been cited above, it only constitutes a secondary feature.\nFirst of all, the practical advice offered to the audience is no less known to the\naverage Greek of that age than it is to Hesiod. The poet does not suggest any\nnew discoveries or a new way of living; most of the advice can be classified as\ncommon knowledge. It is well known that the main occupations of the Greeks at\nthe period were agriculture and sailing. In such a society, therefore, it is natural to\nassume that people knew very well their jobs and that all the advice cited by\nHesiod was not secret or original. Another fact that supports the above is that\nHesiod himself had an extremely limited experience in sailing: \"I have never yet\nsailed the broad sea, except to Euboea from Aulis\", a distance of 65 meters\n(West, Hesiod's Works and Days 647-9). This does not necessarily mean that\nHesiod made up of all these practical advice about sailing; rather that he himself\nlistened to the sailors and rephrased what he had heard in his poem, or used\nother traditional poems and compiled them to a version of his own.\n\nFurthermore, Hesiod's calendar is not as one could claim completely\ndidactic. A large portion of the calendar is superstitious and not practical at all:\nAn example of that is advice of this kind: \"The middle 6th is ... good for a man's\nbirth; for a girl, however, it is not suitable, either to be born or to marry.\" (West,\nHesiod's Works and Days 780-3) It would need extreme caution and luck to\nmake sure that a woman doesn't give birth to a child (boy or girl) in the middle 6th,\nsince she wouldn't know the sex of the child she was carrying. Finally, some of\nthe advice is simply common sense, both now and back then. One particular\nexample is the one about what to wear on your feet and how to cover your head\nin the cold (Hesiod Works and Days 540-5) Later on, the poet advices the worker\nto work before the dawn, in order to avoid the morning rain or the hot sun, and to\nhave a dog in order to protect his house. To summarize, clearly the poem does\nnot teach practical things to someone today, and from the above one can see\nthat if it did teach something to the people of those days, this was not practical\nbut moral.\n\nIn conclusion, Works and Days is a poem about morality. Hesiod is\nconcerned with almost all the moral issues of his world: Law, justice and\ninjustice, religion, peace and war, as well as matters of family and community,\nissues that have tortured generations and are still torturing us today. A large part\nof the poem is dedicated to some practical instruction, which, under a more\ncareful analysis, turns out to either be support for Hesiod's arguments about\nmorality or advice already known by the majority and thus of no significant\npractical value. All these strongly suggest that Works and Days is more\nconcerned with moral rather than practical teaching."
    },
    {
      "category": "Resource",
      "title": "plutarch.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-301-the-ancient-world-greece-fall-2004/851f8751be9549792488ecd68c091de1_plutarch.pdf",
      "content": "Yelena Gorlin\n21.301H\n11/9/04\nParallel Lives - a Historical Lesson in Ethical Behavior\nPlutarch, a Greek aristocrat and a writer by profession, was born in the middle of\nfirst century AD. During his life he produced over two hundred separate titles that\nfocused mostly on moral issues. However, one of his major works, Parallel Lives,\nprovides the readers with biographies of Greek and Roman historical figures and is\nlargely based on information obtained from various historical documents, oral tradition,\nand knowledgeable contemporaries of the author. Plutarch's choice of material may lead\nthe readers to believe that the goal of Parallel Lives was to give an accurate historical\naccount of the lives of the famous statesmen and that the work can be safely used as a\nhistorical source. A careful analysis of the text, however, reveals that in his biographies\nsuch as those of Lycurgus and Solon, Plutarch focuses on character traits of the historical\nfigures and provides the readers with numerous stories containing moral lessons. This\nsuggests that his true purpose was not to provide an unbiased historical account of the\nlives of the past leaders but to analyze the character of important Greek and Roman\nhistorical figures and through real-life examples of their decisions that either lead to\nsuccess or to failure educate the leaders of his own time in ethical behavior (Plutarch\n(Stadter Introduction), xi). Consequently, before using a particular piece of information\nin Parallel Lives as a historical source, the readers should examine the context of its\npresentation and assess the objectiveness of Plutarch. For example, Plutarch could have\ninvented events to support the character development of the historical figures, interpreted\nan actual fact in a biased way that fit a particular trait he wanted to discuss, or presented\nonly those events that fit the personality he selected for his statesman.\nPlutarch demonstrates his focus on the character of the historical figures through\nopen use of unreliable historical information for the sake of character development. For\nexample, at the beginning of Lycurgus's biography, the author acknowledges that \"there\nis nothing indisputable to be said about Lycurgus the legislator\" and yet, he proceeds to\nexamine his life, unsure about when the man lived, who his parents were, how he died,\nand even if he were just one man and not two (Plutarch, Lycurgus, 1). He writes about\n\nGorlin 2\nLycurgus because he could be credited with creation of \"an actual and unrivalled system\nof government\" that relies on \"virtue and internal unanimity,\" a system from which\nPlutarch's contemporaries could learn proper ethical behavior (Plutarch, Lycurgus, 31).\nLater in the biography the author is \"reluctant to attribute to Lycurgus a disgusting\ninstitution like the krypteia\" even though the ancient sources suggest that he was\nresponsible for its establishment (Plutarch, Lycurgus, 28). Plutarch bases \"this judgment\nof his character on his equitability and fairness in other respects\" (Plutarch, Lycurgus,\n28). Thus, in order to present the character of Lycurgus in a consistent way to his\nreaders, Plutarch picks out historical evidence that fits with Lycurgus's \"high-mindedness\nand justice\" and rejects other sources (Plutarch, Lycurgus, 3). Similarly, in his biography\nof Solon, Plutarch includes an unreliable account of Solon's encounter with Croesus. He\nexplains his decision by claiming that \"when a story is so famous and well attested and,\nmore importantly, so much in keeping with Solon's character and worthy of his self-\nassurance\" that a chronological inconsistency is not a good enough reason to reject it as\nfiction (Plutarch, Solon, 27). Thus, in the biographies of Lycurgus and Solon, Plutarch is\nmore concerned with character development of his historical figures than the historical\naccuracy of the information he presents.\nAnother clue that reveals the author's focus on character development of\nLycurgus and Solon is his inclusion of stories from history interpreted in a way that they\nhighlight the moral values and personality traits of the historical figures and provide the\nreaders with valuable lessons. For example, in the first story told in Lycurgus's\nbiography, Lycurgus is approached by his deceased brother's wife who offers to kill her\nunborn child, an heir to the throne, if Lycurgus marries her. Plutarch reports that\nLycurgus found the woman's \"immorality abhorrent\" but went along with the idea until\nthe king was born and then saved the child by taking him away from his mother\n(Plutarch, Lycurgus, 3). The author then points out that after this event, the people of\nSparta become \"very impressed by his [Lycurgus's] high-mindedness and justice\"\n(Plutarch, Lycurgus, 3). Consequently, this episode identifies the character of Lycurgus\nand allows the readers to learn from a real-life problem that was resolved by Lycurgus in\na just manner. In another historical account, Lycurgus is chased out of the city square by\nthe rich Spartans who are unhappy with his reforms and is eventually struck by a young\n\nGorlin 3\nSpartan Alcander who knocks out his eye. Lycurgus, however, still confronts the crowd\nand is able to win it over. He then punishes Alcander by making him his servant with a\ngoal of changing him \"from being an insubordinate, badly behaved young man to a very\nwell-mannered responsible adult\" (Plutarch, Lycurgus, 11). Plutarch uses this story to\nemphasize Lycurgus's \"self-possession and high-mindedness\" and to present his readers\nwith another case study of a real-life problem and an appropriate solution (Plutarch,\nLycurgus, 11). In the concluding story of Lycurgus's biography, Lycurgus obtains a\npromise from the assembly of Spartans that they will live by his laws until he comes back\nfrom Delphi. He then leaves Sparta and decides to kill himself, so \"the state would\ncontinue to be held in the highest honor\" (Plutarch, Lycurgus, 29). Plutarch uses this\nepisode to highlight Lycurgus's honorable qualities and \"perfection of his happiness\" in\ndeath and to demonstrate to his readers that even death can be \"an effective act of virtue\"\n(Plutarch, Lycurgus, 29). The idea of death as an act of virtue is also mentioned in the\nbiography of Solon, when Solon tells Croesus about some of the most happy men he\nknows --Tellus and Cleobis and Biton brothers. \"Tellus had been a man of integrity, with\ndistinguished sons to succeed him, who had lacked for none of life's essentials while he\nwas alive and had died a glorious death winning the prize for valour in defence of his\nhomeland\" (Plutarch, Solon, 27). Thus, like Lycurgus, he was able to die a happy man.\nCleobis and Biton brothers were highly devoted to each other and their mother, so when\ntheir mother's oxen was late they harnessed themselves instead and took her to the temple\nof Hera. After they \"had performed their sacrifices and drunk their wine, they went to\nsleep and never got up in the morning, but were found to have capped their great glory\nwith an easy and painless death\" (Plutarch, Solon, 27). Thus, the two brothers also died\nhappy and honorably. Consequently, these stories emphasize the wise character of Solon\nand teach the readers that people should strive to live virtuous and honorable lives up\nuntil they die, because they can only be considered happy and successful if they die\nhappy and successful. In another story in Solon's biography, Plutarch describes an\nassembly meeting during which Ariston suggests granting Pisistratus fifty club-bearers as\nbodyguards. Solon, however, sees through Pisistratus's plea for protection and\nrecognizes that he is attempting to gain power of the city. Consequently, he protests\nAriston's motion and attempts to convince the people to not assist Pisistratus. However,\n\nGorlin 4\nwhen he realizes that the poor will continue to support Pisistratus and the rich will not\nspeak against Pisistratus, he gives up and leaves the assembly, \"remarking that he had\nmore intelligence that the one party and more courage than the other\" (Plutarch, Solon,\n30). This episode provides further evidence of Solon's cleverness and honesty, but since\nSolon gives up on the people, it presents the readers with a real-life problem but no\ndefinitive solution. Thus, Plutarch's stories had different kinds of lessons for his\naudience; some stories had a suggested answer provided within them, while others\nprovoked the readers to think of their own solutions. As a group, they served to\nemphasize the character of important historical figures and to educate the readers of\nParallel Lives.\nPlutarch's inclusion of stories and unreliable material to stress character\ndevelopment has a great affect on the potential use of his work as a historical source.\nSince historical accuracy is not his first priority, he could have transferred some of the\ncharacteristics of Lycurgus's and Solon's Roman counterparts onto them in order to make\nthe character comparisons between the two lives easier. He could have also invented\ncertain events to support his points and left out events that failed to support his points.\nFor example, in Lycurgus's biography Plutarch supplies the readers with such random\ndetails as \"they [Spartans] remembered something Lycurgus had said about long hair -\nthat it increases the attractiveness of handsome men and the fearsomeness of ugly men\"\n(Plutarch, Lycurgus, 22). This detail works well with Plutarch's portrayal of Lycurgus as\nan intelligent ruler but it is unclear how Plutarch would know that Lycurgus used to say\nthis. Therefore, it is likely that he is attributing common Lacedaemonian sayings to\nLycurgus. Similarly, in Solon's biography, the author includes a conversation between\nSolon and Thespis, a play writer, in which Solon asks \"Aren't you ashamed to tell such\nenormous lies in front of so many people?\" (Plutarch, Solon, 29) This episode is\nconsistent with Solon's honest character and Plutarch uses it to emphasize Solon's\ndisposition to truth. However, it is again uncertain how Plutarch would collect such\ninformation and therefore, it is likely that the story was fabricated. Besides adding\nquestionable and possibly invented stories, Plutarch probably leaves out contradicting\ninformation from his analysis of the historical figures. For example, the institution of\nkrypteia plays no role in his character development of Lycurgus, but since the institution\n\nGorlin 5\nwas well-known Plutarch briefly mentions it in his text with an explanation of why he\ndoes not think it applies to Lycurgus. However, Plutarch could have been aware of other\nless famous details that also contradicted his analysis but have chosen not to include them\nin his work. Consequently, Plutarch's account of events is probably incomplete since it\ncontains only those events which support the character development of his historical\nfigures. Thus, Plutarch's text should not be completely trusted as historically correct\neven in relation to the character and contributions of the historical figures.\nAnother problem with Plutarch's focus on character development and not\nhistorical accuracy is his subjective interpretation of the historical sources. For example,\nto be able to compare the society created by Lycurgus to Plato's ideal systems, he\ndescribes all of the unorthodox Spartan practices in a positive light. Plutarch mentions\nhow Spartan boys were taught \"to be teased without getting annoyed\" and claims that this\nresulted in a formation of a \"particular feature of Laconian character: the ability to take a\njoke\" (Plutarch, Lycurgus, 12). However, his reason behind inclusion of this supposedly\npositive characteristic is probably justification of a Laconian custom \"to... condemn what\nwas disgraceful\" during assembly meetings (Plutarch, Lycurgus, 25). Although the\nauthor claims that the criticism was performed \"in an easy and jocular manner\" and was\ntaken well by those criticized, one can speculate that he is not providing his audience\nwith an objective interpretation of the custom (Plutarch, Lycurgus, 25). The experience\ncould have been embarrassing and those criticized certainly could have become annoyed\nwith the constant teasing they had to tolerate. In a different interpretation of the custom,\nStadter claims that some Spartans committed suicide because of the social pressure put\nonto them by the assembly (Plutarch (Stadter Notes), 390). Another unusual custom that\nPlutarch discusses is boys sustaining themselves by stealing food from people's gardens.\nHe interprets this as a learning experience that develops \"their...bravery and cunning\"\nbut it could also be interpreted as savage and immoral conduct (Plutarch, Lycurgus, 17).\nAristotle, for example, thought that Lycurgus turned boys into animals (Plutarch (Stadter\nNotes), 388). Thus, to support his argument of Lycurgus as a ruler who created \"an\nactual and unrivalled system of government\" based on virtue and internal unanimity,\nPlutarch had to interpret all the parts of the social system in a positive way (Plutarch,\nLycurgus, 31). Consequently, these interpretations should be examined carefully and not\n\nGorlin 6\nnecessarily trusted as the reality of the Spartan social system. Plutarch also subjectively\ninterprets Solon's laws to support Solon's wise and just character. For example, as a\nresult of Solon's reforms, the common people \"could attend the Assembly and act as\njurors\" (Plutarch, Solon, 18). This granted them power to resolve most disputes.\nPlutarch also suggests that Solon could have purposely written his laws \"obscurely and\nambiguously...so that they in a way were the masters of the laws\" (Plutarch, Solon, 18).\nPlutarch seems to borrow these ideas from Aristotle but he does not include the last part\nof Aristotle's argument that \"it is not likely that he was unclear for that reason, but rather\nbecause it is impossible to define what is best in general terms\" (AthPol, 9). Thus,\nPlutarch wants to portray Solon as a wise and foreseeing ruler, who gave the people\nultimate power and gives him too much credit. Consequently, one should approach\nPlutarch's arguments in the biographies carefully to make sure that they were not\ninterpreted in a biased or misleading way to support the established character of a\nhistorical figure.\nThus, Plutarch's biographies in Parallel Lives should be primarily treated as\nlessons in ethical behavior and not as historical sources. They focus on the character of\nthe past historical figures, and they aim to educate the leaders of Plutarch's time in ethical\nbehavior. However, Plutarch's work could also be used as a historical source, if\nhistorical evidence is extracted through careful examination of the text and identification\nof possible biases, omissions, and fabrications."
    },
    {
      "category": "Resource",
      "title": "solonrevised.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-301-the-ancient-world-greece-fall-2004/da6430e8520d75ff7352f0821632c9a0_solonrevised.pdf",
      "content": "Founding Democracy\nThe democratic character of Solon's reforms\nPanayiotis P. Mavrommatis\nIn the midst of a society swamped with science and technology, advertisement\nand information, work and entertainment, consumerism and capitalism, a society that\nhas conquered everything from the genome to space, moments come when we turn to\nnotions that we take for granted - constitution, elections, democracy, and wonder\nwhether we should indeed take them for granted. Twenty-five centuries later, several\nevents make the world turn its attention to what Solon, Cleisthenes and their peers first\nenvisioned and attempted to apply, democracy, with fundamental questions such as\n\"how democratic is our society?\". Relevant to this philosophical and political question,\nwe can pose another one, more historical but also a bit philosophical at the end: How\ndemocratic were the early reforms and specifically the very first of them, those of\nSolon?\nAfter a brief discussion of Solon and the reforms that are attributed to him, we\naddress the issue of defining democracy and trace the reasons why Solon's reforms\ncan be considered as democratic. Finally, we explain why the reforms might not look\ncompletely democratic given later notions of democracy.\nSolon traveled a lot as a trader, before being named sole archon of Athens for a\nnumber of reasons such as his background, personality and poetical abilities. Solon is\nsaid to have introduced a number of reforms, aiming to bring order and stability to the\npolitically troubled Athens of the sixth century BC. Whether all the reforms we refer to\nbelow were indeed established by Solon is a matter of dispute. Plutarch himself admits\nthat his statement about Solon's founding of the Areopagus might be wrong since one\nof Solon's laws refers to the Areopagus as an office already present in the state.\n\nAristotle is also inconsistent at some points, as he mentions that Solon reformed the\nselection of magistrates in The Athenian Constitution but in the Politics he claims that\nno such change was made (Rhodes, A.C., Introduction). The above, along with some\ndifferences between the two writers regarding Solon, generate the question whether\nthese reforms were indeed introduced by Solon. The answer to this question is not in\nthe scope of this paper; we will instead consider the reports of Aristotle and Plutarch as\nvalid and comment on the reforms they present to us.\nThe first major reform attributed to Solon is the \"disbursement\", or seisactheia.\nAccording to Plutarch, this was the cancellation of all debts, and Aristotle adds that the\n\"loans on security of the person\" were banned. (A.C, p. 50) This reform affected both\nrich and poor Athenians who had been involved in loans, mostly in favor of the poor.\nMoreover, a significant number of citizens became free. The second reform was the\nformation of four classes, based on the citizens' wealth. A person belonged to the first\nclass if he could produce more than five hundred measures of goods, to the second\nclass for more than three hundred, to the third class for more than two hundred, and\neverybody else belonged to the last class, the thetes. Members of the first three classes\ncould hold offices such as those of the archons and the treasurers. The last class\ngathered at the assembly and could act as jury in court. Another reform of Solon was\nthe founding of the council of four hundred, the boule. One hundred men from each of\nthe four traditional tribes of Athens, but only from the first three newly-formed classes,\nformed the council that was responsible for processing public matters before bringing\nthem to the assembly. Finally, Solon's legal reforms were also significant. Anyone could\nappeal to the jury if a decision of the magistrates was not accepted. Furthermore, one\ncould seek justice for other persons who could not represent themselves.\nThese have been the main reforms characterized by several critics as\ndemocratic. As already mentioned, however, no single definition of democracy exists; in\nfact the issue is still open to many. A very rough listing of elements that are generally\nconsidered democratic could be the following: A constitution that defines the power of\n\nevery public office, free and just elections for public offices, the right to vote and to be\nelected, freedom of speech and press and equality before the law. In the light of these\nelements, but keeping in mind the social, economic and political context of those\nreforms, we attempt to present the reasons why Solon's changes can be considered\ndemocratic.\nIn short, democracy means power to the people. Solon introduced laws that gave\npeople what they urged for, power. Firstly, all four classes could participate in the body\nof jurors that, according to Plutarch, turned out to be significantly powerful because\n\"most disputes came to the hands of these jurors\" (Lives, Solon XVIII, p. 453).\nThe\nfact that Solon's laws were not clear and simple might have been another reason why a\nlot of disputes arose and a lot of cases ended up in the jury-court (Aristotle, A.C. p 50).\nThis practice is not uncommon even in modern law systems, where laws are written to\ngive general guidance to the judge or the jury who take the final decision. Apart from\nthe jury, the people were those who took the final decisions on crucial public matters, in\nthe form of the assembly in which every citizen was encouraged to join. In fact, Solon\nintroduced a controversial law punishing those who did not take part in public decisions\non crucial matters, following the view that everybody should care about public issues.\nThis law might not be accepted as democratic in general today, but it is still in dispute;\nin a number of nations citizens are obligated to vote. Moreover, Solon introduced\nelections for the appointment of public officers. According to Aristotle, the tribes elected\na number of candidates, and the final decision was based on lottery (A.C.). It should be\nmentioned that a thete could not stand for election; however, the right to elect the\ngovernment officers is undeniably fundamental to democracy. Finally, Solon's laws\ndecreased the power of the aristocratic archons and landlords of Attica. The seisactheia\nclearly favored the poor over the rich, and the distribution of offices to members of the\nmiddle classes reduced the power of the aristocracy. All these reforms, therefore, made\nSolon's constitution democratic in the literal sense of giving power to the people.\n\nApart from the power that Solon gave to the public, the introduction of the four\nclasses was an equally important step towards democracy. First, it was a step away\nfrom aristocracy, since a citizen's class was determined by wealth, and not by origin,\nand all three upper classes could hold public offices. Secondly, Solon's reforms gave\nthe potential, at least, for anyone to hold public offices and exercise authority. Through\nhard work (or other means, of course), someone who would like to participate in politics\nmore actively could overcome the barrier of the two hundred measures of goods and\nclaim a position in the public offices. This was quite a revolutionary change from the\noriginal \"aristocratic\" way that officers were appointed in the past. As Aristotle states,\nofficers' appointment was solely based on the judgment of the Areiopagus, whose\nmembers were former archons, thus the circle of archons and other officers would\nremain closed. (A.C.)\nAnother reason why one might be tempted to describe Solon's reforms as\ndemocratic is the observation that these reforms have been the groundwork upon which\nCleisthenes and Pericles built and established democracy later. Elements such as the\nassembly and the Boule were enhanced by Cleisthenes, giving more power to the\npeople. Ephialtes and Pericles further decreased the power of the Areiopagus.\nMoreover, the classification of citizens based on their property was taken a step further\nby Cleisthenes to the formation of ten tribes, in which neither origin nor property\nmattered, thus further decreasing the power of the rich. One could claim that\ndemocracy could not have been built overnight or in the course of a few years and by a\nsingle person. Rather, progressive men such as Solon, Cleisthenes, Pericles and the\ndemand of justice, equality and freedom from the people of Athens gradually gave rise\nto what came to be known as democracy. In my view, Solon's reforms could not have\nbeen much more democratic at the time. Further reducing the power of the rich would\nrisk the acceptance of the reforms by the aristocracy, which would lead back to\noligarchy. This could be supported by the fact that, even though Solon's reforms were\ninitially accepted, tyranny was not avoided a few years later.\n\nThese were the main reasons why people studying Solon and ancient Greece\nhave been tempted to characterize his laws as democratic. On the other hand, one\ncould argue that Solon's constitution was not totally democratic as compared to the\ncommonly accepted notions of democracy today, but also then, in the fifth century B.C.\nFirstly, only members of the three upper classes could hold public offices, for example\nbe a member of the council or become archons. This opposes the fundamental right to\nbe able to stand for election. This had another implication as well: A major portion of the\npopulation was not represented directly, i.e. by some of its members, in the public\noffices. Moreover, even within the three upper classes, the richest class had more\npolitical rights than the other two. Aristotle mentions, for example, that the treasurers\nhad been appointed only from the highest class (A.C.). On the other hand, one could\nclaim that something similar is still in effect in many nations today. Everybody is indeed\nfree to stand for election, however, in order for one to have a substantial probability of\nbeing elected, a number of \"unofficial\" prerequisites such as education, background,\noccupation and even family origin exist.\nIn summary, this paper has discussed a number of reasons why one might be\ntempted to characterize Solon's reforms as democratic. The major arguments for this\nclaim are that Solon's reforms included a number of democratic elements, and that they\nwere the basis for even more democratic changes later. The presence of a class\nsystem, though, upon which political rights were distributed, might not allow us to\naccept Solon's constitution as a complete democracy. In any case, these reforms were\ncertainly a work of a wise man, carefully written to be accepted at the time and to last\nthroughout the ages, and one of the reasons why Solon was one of the seven sages of\nancient Greece."
    },
    {
      "category": "Resource",
      "title": "pa1_iliad_rev_dn.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-301-the-ancient-world-greece-fall-2004/1447f97ae9d1c36fb2b26ad4260bb734_pa1_iliad_rev_dn.pdf",
      "content": "Paper 1\nCheryl Texin\n21h.301\nRec: F2\nHonor & Glory in the Iliad:\nLife After Death\nHonor and glory are central to the Greek character. Since heroes are the essence\nof the society from which they come, Greek heroes live their lives according to honor and\nglory, in all their varied forms. Honor and glory trigger an epic war that takes the lives of\nnumerous men, and shape its development at every stage. The fall of Troy is \"a thing...\nwhose glory shall perish never (Homer, Iliad 2.324)\". The goal of the Greeks is the fame\nthat resounds even after death, and they let nothing bar their way. The honor of the\nindividual, family, and community guide every action and response. Honor and glory\ndefine the hero, and therefore are the foundations for everything that comes to pass in\nHomer's Iliad.\nThe concepts of honor and glory are critical to understanding the motivation of\nthe heroes in Homer's Iliad1. Glory was gained by great, heroic actions and deeds and\nwas conferred upon an individual by others who witnessed and acclaimed the glorious\nactions. Major battles provided an opportunity for many to find glory at once. Honor\nwas similar to glory, but while the public had to view actions and deem them glorious,\neach individual maintained their own sense of personal honor which did not always\ncoincide with honor as defined or perceived by the masses. Honor was gained through\nheroism in battle, but also through compelling speechmaking, loyalty and other noble\nqualities that a person might demonstrate. Having honor and glory allowed a Greek to\ngain influence in their society; as Osborne writes, \"Individuals exert political influence\naccording to their social standing, their rhetorical abilities, and their personal charisma,\nbut not according to their holding the office of ruler (Osborne, 150) 2\". An example that\ndemonstrates this point occurs in the Iliad amidst an argument over a possible retreat.\nOdysseus, a respected fighter, makes the claim that it is \"disgraceful to wait long and at\nthe end go home empty-handed (Homer, Iliad 2.297)\". His message is well received.\nMeanwhile, Thersites, a man- and commoner- despised by all, advises the army to return\nhome and is struck down by Odysseus to the pleasure of the gathered crowd. Here the\n1 Homer. The Iliad. Trans. Richmond Lattimore. Chicago: The University of Chicago Press, 1951.\n2 Osborne, Robin. Greece in the Making 1200-479BC. London: Routledge, 1996.\n\nPaper 1\nCheryl Texin\n21h.301\nRec: F2\nrespect and honor that Odysseus has achieved lends sufficient weight to his argument that\nhis opponent, without equivalent status, is barely allowed to retort. The honor and glory\nan individual has gained increase the respect and influence he commands as well.\nHonor and glory were important to the ancient Greeks because social status was\nnot fixed. Indeed, in the eyes of the Greeks \"social status correlates closely with access\nto power, but does not fully determine it (Osborne, 155).\" Positions of power were not\nsimply inherited, and through honorable and respected actions a person could elevate\ntheir social position significantly. This mobility in Greek culture inspires a cooperative\nattitude between the local leaders and the people following them. The leaders require the\nvoluntary cooperation of the people under them, and only achieve that with respect and\nhonor. This quality allows Achilles to disobey Agamemnon and refuse to fight when\nAgamemnon dishonors him by taking his prize. Many of the strategic decisions for the\narmy that are made throughout the Iliad are reviewed by a group of respected fighters and\nelders, even though Agamemnon is considered the main leader. In book nine, facing a\nrout at the hands of the Trojans, Agamemnon calls a counsel of leaders to persuade them\nthat the army should \"run away with our ships (Homer, Iliad 9.27)\" before losing more\nmen. However, Agamemnon's suggestion shocks his audience, and his idea is\nemphatically rejected. Diomedes states, \"if in truth your own heart is so set upon going,\ngo... yet the rest of the flowing-heart Achaians will stay here until we have sacked the\ncity of Troy (Homer, Iliad 9.42)\". Agamemnon's leadership position can easily be\ntransferred to another, if he begins to falter. Status could always be gained and lost, and\ntherefore it was necessary to continually protect your honor and resulting status while\nstriving for more.\nGaining honor and glory is not always simple, as there are different and often\nconflicting ways of achieving status and respect. One of the more obvious methods\ndepicted in the Iliad is success in battle, as well as courage. Achilles and Hektor are\nnoted as great fighters, and both of them greatly affect a battle with their presence.\nAchilles' decision to abstain from the fighting because he was slighted by Agamemnon\ncarried enough weight to force consideration of defeat. \"Glorious\" Hektor, \"who was\never the bravest fighter of the Trojans (Homer, Iliad 6.460)\", also demonstrates extreme\ncourage and battle prowess by continually expressing a desire to return to battle while his\n\nPaper 1\nCheryl Texin\n21h.301\nRec: F2\nduties force him on errands into the city (Homer, Iliad Book 6). His brother Paris, on the\nother hand, the instigator of the war, must be dragged out of the city to fight, causing\nother Trojans to say \"shameful things (Homer, Iliad 6.524)\" about his character.\nSimilarly, success in athletic competitions also leads to honor and glory.\nThe possession of material goods as well as pretty women can be indicators of\nstatus. However the giving of possessions is an even stronger sign of status. For\nexample, it was considered in the funeral games held for Patroclus (Homer, Iliad, Book\n23), that the event not only honors the victors, and Patroclus, but above all Achilles, who\nspared no expense in choosing the prizes.\nPossession of women was important to a man's standing and honor. Paris' theft\nof Helen struck a huge blow to the honor of Menelaus and became the initial cause of the\nwar between the Greeks and the Trojans. The Spartan ruler called upon his brother\nAgamemnon to gather the Greek forces to forcefully persuade Paris to return Helen and\nreinstate respect for the king. In this case, others sympathize with the blow to Menelaus'\nhonor, and Achilles and other famous Greek leaders agree to join the fight to recapture\nHelen and the honor of Menelaus. The theft of Menelaus' woman justifies the initiation\nof the war, and the later theft of Achilles' woman intensifies the war with his absence.\nThe Greeks had more subtle distinctions of status in addition to these physical,\nand personal, demonstrations of honor. Homeric society was very community-based, as\ncan be seen with the collective nature of the ruling class. This communal sentiment often\nconflicts with individual desires. Many times throughout the Iliad what is best for the\ngroup is rejected for individual honor. Menelaus and his brother Agamemnon wage war\nto regain honor, despite the cost of the lives that will be lost in the process. There are\nmultiple instances throughout the Iliad where the question of standing down to prevent\nothers from being killed is rejected as cowardly or weak, and the fight continues.\nWith the massive struggle between two of the Greeks' greatest men, Agamemnon\nand Achilles, to retain their honor in the public view, it becomes clear that there are\ndifferent views on honor within the society. Agamemnon felt his personal honor was\ngreater than that of the army, but Achilles calls him out as \"wrapped in shamelessness,\nwith your mind forever on profit (Homer, Iliad 1.149)\". Both of the heroes see their\nwomen as a sign of status and honor, but relinquishing the symbol of honor for the sake\n\nPaper 1\nCheryl Texin\n21h.301\nRec: F2\nof the army, as in Agamemnon's case, does not necessarily diminish his personal honor.\nMany other respected men, such as Odysseus, try to convince Agamemnon to calmly\nreturn his prize, but Agamemnon is overwhelmed with the idea that he is being slighted.\nIn this situation, the communal sentiment outweighs that of the individual. To save lives,\nAgamemnon must give up a possession, which is not viewed by the community as\ndishonorable. However, Agamemnon's perceived slight does not compare with the insult\nto Achilles' honor with Agamemnon's appropriation of his woman. Achilles feels his\nhonor as acutely as Agamemnon, and declares, \"I am minded no longer to stay here\ndishonoured and pile up your wealth and luxury (Homer, Iliad 1.170),\" as he removes\nhimself from the main camp. Achilles gives up the prospect of gaining certain glory on\nthe battlefield, and having \"the Achaians [honour] you as they would an immortal\n(Homer, Iliad 9.603)\", to preserve his honor off the field.\nThe idea of family honor adds a new level of intricacy in maintaining a balance\nbetween individual and community honor. For the Greeks, family honor is similar to\ncommunity honor. Menelaus calls upon his brother when his honor is wounded with the\ntheft of Helen. Agamemnon responds to the familial need, and the community does as\nwell, providing more support for Menelaus' difficult situation.\nIndividuals of a family, like those of a community, do not always have the same\nideas on what constitutes the proper actions to take in a given situation. Patroclus is like\nfamily to Achilles, as they grew up together, practically brothers. Patroclus respects\nAchilles' decision to remain out of the fighting, but also desires to achieve his own honor\nby inspiring fear into the Trojans by wearing Achilles' armor, since Achilles himself will\nnot. His honor is shown in the elaborate ceremonies that Achilles holds for his passing,\nand the extent of the mourning shown.\nHektor and Paris provide a good example of family honor by the contrast in their\ncharacters. Hektor is undoubtedly honorable, brave, and respected, as he \"learned to be\nvaliant and to fight always among the foremost ranks of the Trojans, winning for [his]\nown self great glory, and for [his] father (Homer, Iliad 6.444)\". Like with Patroclus,\nHomer describes his funeral, and the depth of mourning over his loss at length. Hektor is\nmourned by the entire city, including the gods who even go so far as to protect his body\nfrom the mutilation that the grieving Achilles tried to put it through. Unlike his brother,\n\nPaper 1\nCheryl Texin\n21h.301\nRec: F2\nParis is liable to hang back from the fighting, and to perform underhanded dishonorable\nactions. The stealing of Helen was itself a dishonorable act, but Paris also defied the\nhost-guest relationship which is of serious import to the Greeks. The cause of the war,\nParis \"wished to give [himself] over to sorrow (Homer, Iliad 6.336),\" rather than join the\nranks outside the walls. The honorable Hektor has to scold him to get him to enter the\nbattle. Helen, who herself demonstrates regret for leaving Sparta with Paris and\ninstigating a long, bloody war, is disapproving of Paris, and enamored of Hektor. Despite\nhis extensive personal honor, Hektor is ashamed of his brothers' weakness for the\ndishonor that it brings on their family.\nThe emphasis placed on the retrieval of the body and the burial, for both Hektor\nand Patroclus, illustrates the Greek perception that respect and renown continue after\ndeath, and therefore validate the struggle in life to achieve honor and glory. Achilles and\nPriam both go to extreme lengths and physical difficulty to have the body of their loved\nones returned to them. Achilles had to weigh a death in battle, where his \"glory shall be\neverlasting (Homer, Iliad 9.412)\", against a long life without glory. Initially, Achilles\nabstains from the fighting, believing the insult to his honor by Agamemnon to prevail\nover the glory of the fight, but he later returns to the battle and a sure death to avenge\nPatroclus. He also swears to not only kill Hektor, but to exact his revenge by mutilating\nthe Trojan hero's body, while Hektor himself offers gifts for the return of his own body\n(Homer, Iliad 22.338). Achilles refuses, and attempts all kinds of \"shameful treatment\nfor glorious Hektor (Homer, Iliad 22.395)\". The mutilation of the body is an attempt to\ndishonor the deceased.\nJust as Achilles fought for Patroclus's body, Priam comes for that of Hektor.\nPriam begs Achilles for his son's body, saying \"I have gone through what no other mortal\non earth has gone through; I put my lips to the hands of the man who has killed my\nchildren (Homer, Iliad 24.505)\". In doing so, Priam demonstrates how death is no barrier\nto the honor and glory gained in life. Priam is not dishonored in his begging, either, as he\ndoes so in the name of his family honor. Such a sacrifice of individual glory is honorable\nin the eyes of the community.\nHonor and glory were at the core of Greek civilization in Homer's time, as the\nGreeks recognized that honor and glory last far longer than any physical remnants of a\n\nPaper 1\nCheryl Texin\n21h.301\nRec: F2\nperson's life. The pursuit and protection of these qualities in all their various forms were\nthe driving force behind everything the Greeks did. Honor and glory made it reasonable\nto go to war, to fight with friends, to lose countless comrades and to be away from home\nand family for decades. In the Iliad, honor and glory were life."
    },
    {
      "category": "Resource",
      "title": "paper_1_for_ocw.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-301-the-ancient-world-greece-fall-2004/8d1502d2bc3e75b4287c44d275ad3bf4_paper_1_for_ocw.pdf",
      "content": "Rubaiyat Khan\n21H.301\nHesiod's Moral Teachings on Living\nIn Hesiod's poem \"Works and Days\", he explains to his brother how to live a\ngood life. He describes both moral and practical ways of leading life. However,\nhis emphasis lies on the moral teachings rather than the practical ones. One of\nthe overarching themes of his work is the importance of being just in life. Hesiod\nbelieves that Zeus and the other almighty immortal Gods punish immoral men\nand reward moral ones. Therefore, men must not be unjust or unkind to one\nanother.\nSome of his teachings are clearly moral For example, he mentions the\nimportance of treating one's parents well multiple times in the poem. Hesiod's\nobsession with justice and morality can be inferred from this importance that he\nplaces on taking care of ones parents. To him, being disrespectful to ones aging\nparents is unjust and unfair because parents take care of their children when the\nchildren are young and unable to take care of themselves. Thus it is only fair and\njust to the parents that the children take care of them when they are too old to\nfend for themselves.\nHesiod believes that it is not only justice that Zeus asks of people. He describes\nother criminal acts that he believes will make Zeus angry. He mentions\nwickedness, violence, seizing someone else's property, being ungracious to a\nguest, adultery and cheating orphans as examples of other crimes that warrant\nZeus' wrath. \"But for those who occupy themselves with violence and\nwickedness and brutal deeds, Kronos' son, wide-seeing Zeus, marks out\nretribution. ...From heaven, Kronos' son brings disaster upon them, famine and\n\nwith it plague, and the people waste away. ... \" (Hesiod, Works and Days, pp.\n44). Most of these transgressions have one thing in common - they are unjust\ntowards other people. For example, a man who commits adultery is being unjust\nto his wife, while one who seizes someone else's property is being unjust to the\nrightful owner of the property. Thus we see that Hesiod is very concerned with\njustice and righteousness and believes that Zeus harshly punishes anyone who\ndoes injustice to another person.\nA third moral teaching Hesiod provides in \"Works and Days\" is that cheating, that\nis getting something by means other than hard work, is immoral; hence men\nmust refrain from cheating. He narrates a mythical story to make his audience\nunderstand the consequences of cheating. He describes the story of Pandora:\nPrometheus cheated the Gods, and as a penalty, the Gods seized fire from\nearth. Prometheus further wronged the Gods by stealing fire back from Olympus.\nAs a punishment for this heinous crime, the God's created a charming woman,\nPandora, and sent her to earth along with a jar full of trouble. Once Pandora\nunleashed the trouble, it not only afflicted the criminal Prometheus, but also\nbrought trouble on the rest of mankind. Through this example, Hesiod is trying to\nteach his audience how cheating and unjust behavior have grave penalties not\nonly for the rogue, but also for his entire society. Here, Hesiod draws an implicit\nparallelism between Prometheus and Perses, who cheated Hesiod out of his fair\nshare of inheritance. Hesiod is warning Perses that he will have to suffer for\ncheating Hesiod out of his inheritance. Hesiod also warns the local chiefs who\nallowed Perses to get away with conning Hesiod \"lords ... keep your\npronouncement straight, you bribe swallowers, and forget your crooked judgment\naltogether.... The eyes of Zeus, that sees everything and notices everything ...\"\n(Hesiod, Works and Days, pp. 44, 45). Thus, through the story of Pandora,\nHesiod is asking his fellow citizens and his brother to become honest and moral.\nIn the poem, Hesiod provides a detailed account of how to honor and respect\nZeus and the other Gods, which is definitely a form of moral teaching. He says\n\n\"Make sacrifice to the immortal gods ...\" (Hesiod, Works and Days, pp. 47). He\nalso says \"Never pour gleaming wine to Zeus in the morning with unwashed\nhands, or to other immortals ...\" (Hesiod, Works and Days, pp. 58). According to\nhim, the consequence of not honoring the immortal Gods is self-destruction. He\ncites the example of the silver race of men who were \"put away by Zeus son of\nKronos, angry because they did not offer honor to the blessed gods who occupy\nOlympus\" (Hesiod, Works and Days, pp. 41).\nHesiod's teachings described above are undoubtedly moral. But some of his\nmoral teachings appear practical on the surface. A deeper analysis of such\nostensibly practical teachings shows that they are, in fact, fundamentally moral.\nFor example, he asks Perses always to keep two ploughs at the farm. The moral\nreason behind this seemingly practical advice is that Hesiod believes humans are\npowerless and they should be continually prepared to fend off minor misfortunes\nthat Gods may throw in their way. Thus, having two ploughs is necessary\nbecause Zeus might want to destroy one. Similarly, he asks Perses to build the\nhuts for his laborers in summer because Zeus may change the weather to winter\nsooner than expected and the laborers will then need the huts to survive. These\npractical advices are therefore given in the moral context of Hesiod's belief that\nhumans are as helpless in the hands of Gods as puppets are in the hands of a\npuppeteer, and the best a human can do to survive a God's whims is to prepare\nas much as possible.\nTo illustrate this powerlessness of humans, Hesiod narrates the story of a little\nnightingale in the talons of a hawk. The hawk says to the nightingale \"You are in\nthe power of one much superior, and you will go whichever way I take you.... He\nis a fool who seeks to compete against the stronger. He both loses the struggle\nand suffers injury on top of insult\" (Hesiod, Works and Days, pp. 43). Here, the\nhawk in the fable is a metaphor for the omnipotent Gods, and the nightingale\nstands for weak humans. To prove the powerlessness of humans, he also\ndescribes how absolutely powerful the Gods are. \"Because of him [Zeus] mortal\n\nmen are unmentioned and mentioned, spoken and unspoken of, according to\ngreat Zeus' will. For easily he makes strong, and easily he oppresses the strong\n... \" (Hesiod, Works and Days, pp. 37).\nA second seemingly practical teaching that has a moral basis underneath is\nHesiod's advice to Perses about working hard. On several occasions Hesiod\ntells Perses that he must be diligent in his work. He even tries to motivate Perses\nto work hard by telling him that only industry can make him wealthy and \"wealth\nbrings worth and prestige\" (Hesiod, Works and Days, pp. 46). Hesiod's moral\nreason for asking Perses to be industrious is not to make him wealthy. Rather he\nwants the Gods to be pleased with Perses as \"Gods and men disapprove of men\nwho live without working\" (Hesiod, Works and Days, pp. 46).\nAnother moral teaching obscured by the facade of practicality is the calendar of\nfavorable dates that Hesiod presents at the end of the poem \"Works and Days\".\nHe advises his audience to keep track of these dates \"Pay due attention to the\ndays which comes from Zeus ...\" (Hesiod, Works and Days, pp. 59). Even\nthough the calendar describes days for performing practical tasks, Hesiod\nprovides it to its audience for a moral reason. Because Hesiod believes that men\nare powerless in the hands of the immortal Gods, he asks men to follow these\nGod given dates so that they can be successful in their endeavors. He says \"Well\nwith god and fortune is he who works with knowledge of all this, giving the\nimmortals no cause for offence, judging the bird-omens and avoiding\ntransgression\" (Hesiod, Works and Days, pp. 59).\nWhy Hesiod dispenses moral teaching throughout his poem is clear. He believes\nthat Zeus destroys immoral races and rewards moral ones. He tells his audience\nabout the four races that Zeus destroyed because they were becoming\nprogressively more evil and violent. He warns his contemporary fellow Greek\ncitizens \"Zeus will destroy this race [the race that Hesiod belongs to] of man also\"\n(Hesiod, Works and Days, pp. 42). As an incentive for being moral, Hesiod\n\ndescribes Zeus' prizes to just and righteous people. He says that if the people in\na community are just, their community will flourish and Zeus will prevent\ncalamities like famine and blight from affecting them. As a reward for their moral\nbehavior, Zeus will give these communities sufficient food, wealth and good\nchildren, and make sure that they never need to go out in the dangerous seas.\nTo summarize, Hesiod's moral teaching in \"Works and Days\" is that to lead a\ngood life it is extremely important that a man is just and righteous and that he\nworks hard to win his livelihood. But because men are powerless in the hand of\nGods, for his hard work to be successful, he must honor the all-powerful Gods by\npartaking of actions on days that have been assigned for those actions. Lastly,\nmen must avoid every action that can offend the almighty Gods in Olympus.\nSome of these advices are provided as moral teachings while some are\nshrouded by an aura of practicality. But basically, most of his advices in \"Works\nand Days\" have some sort of moral foundation. Therefore, Hesiod's \"Works and\nDays\" is mostly concerned with moral, rather than practical teaching."
    },
    {
      "category": "Resource",
      "title": "paper1_rev.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-301-the-ancient-world-greece-fall-2004/ea50b21041a6f62c6a34a97d7a8fbdee_paper1_rev.pdf",
      "content": "5/10/05\nStathis Metsovitis\n21H.301 The Ancient World: Greece\nPaper #1\nIs Really Achilles a Hero?\nThe Iliad is not a work that gives a mere account of historic facts and\nevents but one where persons are the protagonists by virtue of their behaviors,\nvalues, motives and decisions which affect the flow of the story. Achilles is one of\nthese persons that play a primary role in the plot of Iliad; as Homer puts it in the\nfirst lines of this work, the anger (menin) of Achilles, his withdrawal from the\nbattles and the devastating effects that this has on the Greek army will be the\ncore of the story. Achilles appears in the story as a complicated character with\nhis own idiosyncrasy and system of ideals that sometimes no one else but him\ncan understand. This system of values is exactly what I am going to explore in\nthis paper. In particular, I will look at these values and examine how they affect\nAchilles' dramatic decisions and the people around him. However, I will\nespecially focus on the characterization of these values from the point of view of\nthe following questions: Is it worth abiding by this system of values as firmly as\nAchilles does? What does Achilles not accomplish in his life by adopting these\nideals? Is this the best way for one to live? My response to these questions will\nseriously question this system, for it leads to obdurate, cruel, mindless behaviors\nthat do not befit either a humane, minded individual or an inspired leader.\nThe first step in this exploration will be to locate Achilles' values in the text.\nIn the Iliad, as a whole, Achilles reflects a paradigm of the hero that has fallen in\ndeep love with honor and glory. Behind every action or decision of Achilles lies\nhis thirst for everlasting time (honor) and reputation, and this single-mindedness\nand persistence permeate the whole story. In [1], A 302, and [1], A 352-355,\nAchilles maintains that the prizes from his battles are evidence of his glory and\nthe loss of these prizes as a result of Agamemnon's orders disgraces him. As a\nresult, he attempts to prevent the loss of Briseis at all costs; he does not even\nhesitate to pray for the destruction of the Greek army and Agamemnon, as a\ni\n\nStathis Metsovitis\nmeans of making the king understand his mistake and restore Achilles' time in\nthe eyes of his fellows. The latter scene repeats in [1], I 374-409, however, here\nwe have two more important facts. Achilles corroborates, in his response to the\ndelegation that visited him, that the cause for his wrath is neither the loss of his\nwealth nor of Briseis, but the deprivation of his rightful spoils. In his mind, this\naction degrades his achievements in combat and harms his prestige; this\nprestige is exactly what Achilles pursues in his life and he seems to lose it as an\neffect of Agamemnon's behavior. Also, the acceptance of Agamemnon's gifts to\nreturn to the battlefield may make him wealthier, but result in a greater loss of\nhonor, therefore he rejects them. A few lines later, [1], I 398-402, Achilles\nbecomes even more emphatic: he stresses that the motive for his participation in\nthe Trojan War is not the love for wealth, since his father Peleus was rich\nenough, but his hunt for glory and pride, which would distinguish him from all\nothers. In [1], I 415 he ends up saying that a life without time is pointless and in\n[1], I 647-648 he proclaims to Aias that Agamemnon humiliated him. On the\nsame note, on hearing about the demise of his intimate friend Patroclus, in [1], \n112-117, he defies death and swears to take revenge for the loss of Patroclus,\nbecause he believes that in this way he will receive even more glory.\nNevertheless, glory and honor for a Mycenaean man are not only\nachieved in the battle field. Nobility, sincerity, politeness and respect to gods, his\nparents and other men are also important for Mycenaeans and Achilles exhibits\nthese qualities in every occasion. He shows respect and modesty before the\ngods by obeying their orders even if they are contrary to his will; for instance in\n[1], A 215-218 the intervention of Athena prevents Achilles from assassinating\nAgamemnon and in [1],  139-141 he agrees to stop the desecration of Hector's\nbody after the exhortation of his mother, goddess Thetis. Additionally, he\nmanifests his love and devotion to his comrades in [1], I 323 and he talks\ncourageously and sincerely, expressing clearly his opinions, as is seen in [1], A\n149-171 and in [1], I 309.\nHowever, what we see in book  is much more critical when trying to\nidentify Achilles' code of values. In the beginning of this book Achilles exhibits an\nii\n\nStathis Metsovitis\natrocious and vindictive behavior, which contradicts the traits of an ancient hero\nas they were described above, by desecrating dead Hector. Everything seems to\nchange though, when Priam, the father of dead Hector, comes to Achilles with\ngifts, entreating for his dead son's corpse. Achilles, after a divine intervention,\nsoftens his anger and not only accepts the offer but also welcomes Priam\nwarmly, according to all the institutions of xenia. This entirely different second\nface of Achilles showing measured humanity should not be surpsiring; Achilles\nhas now an excellent opportunity to recover his heroic virtues. By giving back the\ncorpse of Hector to Priam, he shows nobility and respect to the elderly and the\nforeign leader. Moreover, by having the foreign king visit and entreat him with\ngifts, Achilles feels that he is still important and respectful in the eyes of others.\nThis visit breaks Achilles' long isolation and restores some of his lost kleos\n(glory), and this explains his acceptance of the offer. This is essentialy the same\nrole that Achilles plays in book , where as a preeminent social leader and\numpire, organizes funeral games in remembrance of Patroclus.\nHaving mentioned the values that Achilles exhibits in the Iliad, I am now\ngoing to examine more closely the effects they have on the people around him,\nboth Greeks and Trojans. The analysis here is essential, for it will help us\nunderstand how things would be different if Achilles was more humane and less\nrigid earlier in the story. According to Homer's narration in the beginning of the\nIliad ([1], A 10-12), Greeks have already suffered much by the god-driven plague\ncaused by the abduction of Chryseis, the daughter of the god-loved priest\nChryses. As we see in [1], A 303-310, Agamemnon finally agrees to give\nChryseis back to her father, but just as Greeks were expecting a better day to\ncome in their camp, two evils hit them. The first is Achilles' subsequent\nwithdrawal from the battlefield, which emboldens Trojans and discourages Greek\nsoldiers, since they now fight without one of their best warriors. However, even\nworse is a second god-driven plague, caused by Achilles' prayers. The ill-\ntempered Achilles is once more not thinking as a \"community man\" but rather on\nhis own. Living in his single-mindedness, he is only determined to achieve his\niii\n\nStathis Metsovitis\npersonal goals, namely unlimited kleos, being indifferent to the outcome and the\neffects on others.\nIn addition, Patroclus' demise and Achilles' subsequent decision to join the\nGreek army again can be regarded as a consequence of Achilles' compliance\nwith a problematic system of values. It is because of his complex that Achilles\ndoes not enter the war himself. Instead, he sends his loyal companion to the\nbattlefield, indirectly contributing to his death. Patroclus's death stimulates\nAchilles to reconsider his attitude towards his comrades. On the one hand, he\nfeels remorse and embarrassment for not going to the battlefield himself and\nhaving sent Patroclus instead. On the other hand, his thirst for glory is\nunquenchable. Nothing else but this thirst is what makes him terminate the\nestrangement from his fellow Greeks. According to Achilles' moral code, if he\nmanages to kill Hector and take revenge for Patroclus' loss he will be honored.\nTherefore an outraged Achilles makes the big decision to join his comrades and\ntake revenge for his friend's death. He fights with bitter hatred and kills Hector,\nthus giving courage to Greeks and spreading sorrow in Troy. At this stage\nhowever, the mutilation of Hector's corpse dehumanizes Achilles' morals.\nAchilles abandons the noble qualities of a social hero and becomes disrespectful,\na man without feelings. It is only because of the Gods' intervention that he stops.\nHaving analyzed the ideals and the motives of Achilles as well as their\nconsequences in the evolution of the story, we are able now to focus on the\nmajor questions that were raised at the start of this paper. Achilles remains\nthroughout the Iliad faithful to the system of values which was described above.\nBy adhering to it he may obtain what every Mycenaean parent wishes for his son,\nthrough the inherited code of ideals, namely time and kleos. Nonetheless, we\nshould be wondering whether this blind adherence goes to extremes and\nwhether there are also other equally important things that an ancient Greek male\naristocrat should seek in his life [3]. Achilles is a supernatural warrior who seems\nto have been isolated from his social environment. Before his own eyes, his\nactions seem heroic, but meanwhile few of his fellows understand them; thus\nAchilles cannot be considered as a community man. More precisely, these\niv\n\nStathis Metsovitis\nactions are not balanced on the basis of their consequences on society, but on\nhis personal code of values, which is excessively rigid, focused on how to\nbecome first and distinguish oneself from others. It is not astonishing therefore\nthat Achilles seems to ignore the happiness of everyday life and the heroism one\ncan show in his daily routine. Indisputably Achilles' life is a heroic life, with the\nnarrow Mycenaean meaning of the term, but it is very doubtful whether it is also a\nhappy life, since Achilles is tightly engaged in his personal conflicts and peculiar\nideology.\nThe incidence that gives valuable insight in Achilles' attitude towards life is\nthe delivery of his new shield by his mother Thetis ([1], T 13-28). Achilles gazes it\nfrivolously, merely as a nice piece of warfare equipment, and totally ignores the\nimport behind the impressive engravings. This elaborate shield mostly depicts\nscenes of the everyday life of a peaceful polis (city) and its residents ([1], \n490~); scenes full of joy illustrating young people dancing and participating in rich\nbanquets; in other instances people are resolving their differences peacefully in\nlaw-courts, despite their passions and anger. There are also scenes with\nordinary, though admirable, people working on the fields, struggling honorably for\ntheir living without killing others in battles and looting their properties. In spite of\nthe fact that the struggle of people in their workplaces bears disappointments\nsince their efforts are not always rewarded, people continue, in a heroic context,\ntheir efforts to render their lives more comfortable ([1],  573-587). People of a\npeaceful polis exhibit an everyday modest heroism and admirable dignity in their\nefforts to overcome the obstacles in their work and relations, in order to build up\na healthy, self-sufficient and harmonic community with their peers. It is exactly\nthis kind of humane heroism that Achilles does neither possess nor appreciate.\nBecause not only in war but also in daily life, are there positions of honor, prizes\nand rewards that make an individual stand out from the others. Public recognition\nand rewards can also be regarded as fruits of hard work, social responsibility,\nproper treatment of fellow citizens, wisdom and eloquence. Not only is there the\nparadigm of Nestor, the anax (king) of Pylos, in the Iliad, who is admired for\nshowing all these qualities but also the scene of the law-court ([1],  497-508)\nv\n\nStathis Metsovitis\nthat makes this clear. On the one hand, the jury of this law-court consists of\nrespectful seniors who have excelled both in battle and city life, having thus\nobtained the privilege to distribute justice. On the other hand, the litigant parties\nprovide arguments in order to convince the jury about their right. The winning\nparty will obtain wealth but more importantly he will obtain more honor and\nappreciation from his peers. On the contrary, the polis in war, as depicted on the\nshield, is a heartbreaking scene which is little described by Homer. This picture\nillustrates to a great extent the life Achilles has chosen to live. Therefore, Achilles\nneglects the peaceful life his shield puts forward and instead he picks up his\nweapons and rushes into the battle ready to redeem himself by killing Hector.\nMuch in contrast with the hectic and violent life of Achilles comes the\nsomewhat measured life of Hector. While being a hero in the battlefield, Hector is\nalso a domestic and communal figure, thus deserving additional respect. In book\nZ we see Hector being a tender father and husband, not hesitating to express his\nhuman feelings and trying to provide reasons for his decisions to Andromache.\nOn the contrary, Achilles is isolated from his peers and only the presence of\nPatroclus keeps him socially alive. In his life there are absolutely no scenes like\nthe ones that Hector experiences. Social responsibility, affection and love are\nabsent from Achilles' life. Even in the case of Briseis, it is evident that he sees\nher more as a prize of war than as a wife. Moreover, he feels no need to justify\nhis decisions to anyone because these are made only on the basis of his set of\nvalues. As a result, Achilles may be admirable for his battle achievements but he\nis still incomprehensible by his peers.\nFrom another point of view, many things would be different if Achilles were\nnot so idiosyncratic, both for him and his peers. Sacrificing his own goal for more\nand more pride and yielding to the common good would render him even more\nadmirable in the future and of course would have preempted the additional pain\nGreeks suffered because of his decisions. Then Achilles would not only be a\nhero for himself but also a societal hero, forming an integrated paradigm of\nheroism both in the battlefield and community. Moreover, should he have\nadopted a more approachable, less honor-obsessed, humane and modest\nvi\n\nStathis Metsovitis\nattitude of living, he would be able to resolve his inner conflicts which prevented\nhim from living a happy life. In addition, he could have prevented the loss of his\nbest friend Patroclus, which can be attributed in some sense to his withdrawal\nfrom the Greek army. It is worth noticing how humane Achilles becomes after\ntalking with Priam in his tent ([1],  500~), when he seems to realize how bad\nhuman pain is and that there are other noble qualities that one must possess to\nbe a hero in the whole meaning of the term.\nIn conclusion, Achilles' hunting of excessive honor and glory deprive him\nof living a balanced life. Achilles' may be admired for his boldness in battle, but\non the other hand he has little to show in his social and family life, since he's little\nconcerned about the effects of his actions on others. He is overly hot-tempered\nand addicted to his code of values, which does not allow him to pursue any other\ngoals which ought to characterize the life of a human being. This obsession\nsometimes demoralizes Achilles and makes him even ferocious. Therefore, the\nsystem of ideals that Achilles has chosen to follow, let alone his way of adhering\nto it, should be rejected.\nReferences\n[1] Homer, The Iliad, (in Greek), Translation by N. Kazantzakis. (High School\nTextbook), Athens, 1998\n[2] Homer, The Iliad, (in English), ed. Samuel Butler.\nhttp://www.perseus.tufts.edu/cgi-bin/ptext?doc=Perseus%3Atext%3A1999.01.0217 (Oct.\n2, 2004)\n[3] Prof. Steven Ostrow, Personal Communication, Sept. 30, 2004\nvii"
    },
    {
      "category": "Resource",
      "title": "paper_2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-301-the-ancient-world-greece-fall-2004/a4569c208792dc44124ba702f9b0c5fa_paper_2.pdf",
      "content": "Steve Fredette\n\nThe Ancient World: Greece\n12/02/2004\n\nPaper #2, Topic #1\nPlutarch wrote the Parallel Lives in the beginning of the 2nd century AD as a set\nof biographies meant to be read by prominent Roman and Grecian statesmen of the time.\nThese biographies covered the major Greek and Roman historical figures, and were\nwritten in pairs, one Greek and one Roman whose lives Plutarch saw as parallel.\nPlutarch's intention was that these biographies would act as a mirror - that in reading the\nlives of others, his readers might see part of themselves in a particular character. Then,\nby viewing the outcomes of a character's actions or personality, Plutarch's readers could\nrationally evaluate their own actions and traits with some idea of the consequences. For\nthis purpose, it was important that Plutarch was writing about real men to whom\nPlutarch's audience could relate. Rather than just being told about the ideal\nconsequences or outcome of ideal behaviors, biography allowed Plutarch to bring his\nreaders much closer to real observation. Still, this does not mean that Plutarch kept\nstrictly to historical fact, nor does it mean he didn't shape his subjects' lives to suit his\npurpose. His main goal was to show character and its connection to the rest of a person's\nlife and not to simply write history. These priorities are revealed in the lives of Lycurgus\nand Solon through the use of stories and anecdotes of questionable historic accuracy, and\nthe inclusion or exclusion of information in order to portray a character that fit Plutarch's\ndesign. In reading Plutarch for historical reasons, one must keep Plutarch's purpose in\nmind. The story and interpretation must be set aside as simply that, but the society and\npolitical ideas and systems of early Athens and Sparta are portrayed, and this is valuable\nto a reader of history.\nIn Lycurgus and Solon, much of the text is stories, which serve well to illustrate\nthe individual character and personality of each man, but may have had more value as\nparables than history. Many of these stories were likely passed on orally from generation\nto generation. Thus at the time Plutarch knew them, hundreds of years later, they\nprobably could not have been considered historically accurate. Yet Plutarch not only\n\nincludes these stories, he comments on them and interprets how each story shows some\naspect of his subject's character. For example, he does not simply tell the story of\nLycurgus' eye, he uses it to comment on Lycurgus character. Plutarch describes\nLycurgus as \"uniquely gentle and even tempered,\" with his \"self-possession and high-\nmindedness, his ascetic lifestyle, and his inexhaustible capacity for hard work\" (Plut.,\nLycurgus 11). In this way, Plutarch creates a character that fits well with the Lycurgan\nreforms. In Solon, the story of Croesus is included to build Solon's character as a\nphilosopher, and in this case Plutarch even admits that many people think the story is\nuntrue. Plutarch, however, felt that since it was \"so much in keeping with Solon's\ncharacter and worthy of self-assurance\" (Plut., Solon 27), he must not reject the story. He\nproceeds to tell the story of Solon's meeting with Croesus and indeed it does portray\nSolon as a wise and honest man. Many other stories are similarly used to indicate the\npersonalities of Solon or Lycurgus. The story of Lycurgus making sure the rightful heir\nto the throne would be born attested to his righteousness. The stories about Solon's\ncapture of Salamis show his leadership qualities and clever thinking, and the stories of\nSolon's interactions with other sages and philosophers of the time establish Solon as a\nphilosopher himself. In using stories such as these, especially the Croesus story which is\nlikely untrue, Plutarch reveals that he is not concerned with relating the exact history of\nSolon or Lycurgus, but with creating character. It doesn't really matter whether either\nstory of Salamis' capture is right or not, and Plutarch includes both of them. The\nimportance is that they serve to fill in the character of Solon.\nAs well as using stories to create his subject's character, Plutarch also excludes or\ndiscredits stories which do not fit his design. The krypteia, an institution where young\nSpartans were sent out with daggers to kill promising helots, is something Plutarch claims\nwas not part of Lycurgus' reforms. He states, \"I myself would be reluctant to attribute to\nLycurgus a disgusting institution like the krypteia. I base this judgment of his character\non his equitability and fairness in other respects\" (Plut., Lycurgus 28). Plutarch \"selects\nonly those elements which fit his purpose\" (Stadter (1998) p. 7), Stadter says, for\nXenophon's account of the Spartans includes much more about the military, but Plutarch\ndoes not include this information.\n\nIt is important to Plutarch that the stories he includes create a character that is\nconsistent with their history and politics. If Plutarch can argue that a certain battle or\npiece of legislation rationally follows from a person's character, then the biography has\nmore value as a philosophical mirror. Talking about a law of Solon's, Plutarch writes,\n\"there is a saying of Solon's that has come down to us which is consistent with this piece\nof legislation\" (Plut., Solon 18) and then gives the saying. This saying of Solon's was\nprobably not related to the law, but Plutarch makes the connection between them to show\na similarity between character and political action.\nIn some cases, Plutarch fits his subject's character to political actions, but in\nothers, he fits the political actions to the character. Plutarch attributes a great number of\nlaws and political changes to Solon and Lycurgus which may be more accurately seen as\nchanges made by many men over a longer time period. Solon, at least, is seen as a real\nhistorical figure but there is no information in writings, such as his poems, which gives\ndetail of the laws. For this, Plutarch had to go to the written record of the laws himself,\nperhaps the ones inscribed in wooden tablets, fragments of which Plutarch says \"have\nsurvived right up to modern times in the City Hall\" (Plut., Solon 25). Yet it is not certain\nwhether Plutarch would have been able to know with certainty that Solon actually was\nresponsible for all the laws he claims. In his introduction to Solon, Stadter writes that\n\"there is the possibility that some provisions ascribed to Solon in fact reflect later\nchanges\" (Stadter (1998) p. 42). It is possible that for a time after Solon, the laws were\nall recorded on the wooden tablets and later just referred to as Solon's laws even though\nsome were created by others.\nLycurgus, on the other hand, is not even a definite historical figure. Plutarch\nadmits that this is the case and that \"there are divergent accounts\" of \"precisely what he\nachieved with regard to the laws and the constitution\" (Plut., Lycurgus 1). Certainly the\nsense of a man Lycurgus existing is similar to that of Homer, where it is debatable as to\nwhether or not Homer wrote the poems or even existed. In the same sense, as Stadter\nputs it, \"we must remain in doubt whether a single major legislator existed, or whether in\nlater times a pattern of unwritten traditions was ascribed to this semi-legendary figure\"\n(Stadter (1998) p. 4). Still it suited Plutarch's purpose to sum up the Spartan system and\ntell it as Lycurgus' creation, pulling it together to make a neat little biography.\n\nAttributing a set of reforms to one man both in Solon and Lycurgus, again allows Plutarch\nto connect character and moral value to the political sphere. It allows Plutarch to portray\na man of good virtue and character and then show how that leads to a whole set of\npositive reforms and actions.\nWriting biographies which compared a Greek and Roman figure also shows how\nPlutarch connected similar characters and actions. Certainly, by writing lives in parallel,\nPlutarch was directly showing that two different men of similar character could end up\nleading similar lives. This further supports Plutarch's belief that his readers could\ncompare their own lives to his biographies in order to gain insight. To write these\nparallel lives, it is likely that Plutarch had to stretch his characters' lives to make them fit.\nSolon, for instance, is paired with the Roman Publicola, who \"took decisive action\nagainst attempts to reinstitute tyranny\" (Stadter (1998) p. 44) and was a founder of the\nRoman republic. Because of this pairing, it's possible to imagine that Plutarch\noveremphasized Solon's rejection of and outspokenness against tyranny, and his role as\nthe founder of democracy.\nPlutarch's belief in Greek education and philosophy influenced his writing in\nmany ways. Plutarch himself was greatly influenced by Aristotle and Plato and\nfrequently cites them in both lives. He believed in the philosophy that people could\nprogress in virtue, and that observation of a fault and its affects in others was important in\nrealizing its affects in one's own life. The Lives show this belief, as they give their\nreaders a way to observe traits and affects in statesmen of the past. Other indications of\nPlutarch's background as a philosopher are evident at various times throughout Lycurgus\nand Solon. In telling about Lycurgus' laws, Plutarch goes into great depth about the\nphilosophy behind the reforms. He explains how the revoking of money solved many\nproblems. For, \"who would set out to embezzle, or accept as a bribe, or rob, or steal\nsomething which was impossible to conceal, which no one particularly wanted to have,\nand which could not even be profitably cut up\" (Plut., Lycurgus 9), Plutarch reasons. He\ntalks of the whole system as being quite ideal, based on simplicity and moderation and an\neye to the public good. Stadter sums it up, stating that \"Lycurgus is not just history, but a\nstatement of the value of the simple, disciplined, communitarian life against the\nindividualist pursuit of pleasure\" (Stadter (1998) p. 7). There is a philosophical element\n\nto Solon as well, with his stance on money and wealth. Plutarch includes excerpts from\nSolon's poetry in which one verse equates the happiness of a man rich in silver and a man\nwho has \"only enough to keep belly, body and feet in comfort, and to enjoy the youthful\nbloom of woman and boy...\" (Plut., Solon 2). Plutarch's inclusion of the Croesus story\nfurther adds to the philosophical content.\nIn one instance, Plutarch directly goes off on a philosophical tangent about\nmarriage. All of chapter 7 from Solon is a philosophical digression about Thales' refusal\nto marry, and he goes on about how \"it is strange and churlish behaviour to be so afraid\nof losing things that one forgoes what one ought to have\" (Plut., Lycurgus 7). With a\nphilosophical slant to much of the description of the political systems in Athens and\nSparta, one must refrain from believing that historically these political systems worked\nexactly as they were described. Plutarch describes the ideal system, but in reality, the\nsituation was probably somewhat less than ideal in both city-states. For example, in\nAthens, Solon's laws were against tyranny, but soon after he created them, a tyranny was\ninstituted.\nOverall, the lives of Solon and Lycurgus do give a good impression of early\nAthens and Sparta, respectively. Plutarch's life of Lycurgus is a great account of the\nwhole Spartan system, which was certainly a historical reality, albeit an ideal version.\nThe council of elders, the redistribution of land, and the abolishment of money were three\nimportant parts of Spartan history, whether due to Lycurgus or not. The entire social and\npublic system described is also of great historical value. The system of common messes,\nbarracks, and the education system were quite unique to Sparta and important to any\nunderstanding of ancient Greece. The system described in Solon for Athens is equally\nuseful historically. The council of 400, the 'alleviation' of debt, the creation of new\nproperty classes, and the right of appeal to a popular court were all an integral part of the\nhistory of Athens. The social and public laws described in Solon as well give an even\nmore in depth understanding of the city's structure. Certainly the truth of these things\ncan be doubted, but their truth is certainly more evident than the truth of stories of one\nevent or person. The system of government and the social system were systems in place\nfor long periods of time and affected a whole group of people. In the case of Solon's\nlaws, many were written down directly. Thus while the details such as when some of\n\nthese reforms took place, or who they should be attributed to, may not be clear, the\nresults certainly are much more grounded. Plutarch himself was well educated and well\nread, taking much of his information from historical sources that are not available to\nhistorians today.\nAs with any piece of literature to be read for historical value, whether reading\nHerodotus, Thucydides, Aeschylus, or Homer, the works by Plutarch must be read with\nknowledge of his purpose and background. Who was the author and when was he\nwriting? Was he writing about events he would have witnessed? Was the goal\nentertainment, or perhaps persuasion? Who was the audience? These are all important\nquestions in determining how to evaluate a work's historical value.\nThucydides, for example, was an Athenian general who lived through the\nPeloponnesian War and was writing, he claims, an objective account of the war for the\nsake of history. He claims to have only included those accounts which are the most\naccurate, but in the same way that Plutarch may include or exclude information to create\nhis character, Thucydides' own personal opinions and bias towards different people in his\nhistory may have influenced what he chose to write and not to write. On the other hand,\nHomer's work is mainly fictional and must be read as such. Any historical value derived\nfrom Homer must be inferred through his depiction of social structure, custom, and\nmotivation, and cannot be connected to actual times, events or places, but can only be\nused as a general idea of the society at some point in history before Homer.\nPlutarch was writing biography for the sake of observing character and the\noutcome of a given person. In the case of Lycurgus and Solon, Plutarch was writing\nhundreds of years after their deaths and thus was not writing about his contemporaries, as\nThucydides would have been. Neither are his accounts purely fiction or written for\npurely entertainment purposes. Plutarch, rather, is somewhere in between fiction and\nhistorical fact, and while Solon and Lycurgus may not be the most accurate sources of\nactual events, people and places, the depiction of the structure of society in early Athens\nand Sparta in these two respective works is invaluable."
    }
  ]
}