{
  "course_name": "The Environment of the Earth's Surface",
  "course_description": "A great variety of processes affect the surface of the Earth. Topics to be covered are production and movement of surficial materials; soils and soil erosion; precipitation; streams and lakes; groundwater flow; glaciers and their deposits. The course combines aspects of geology, climatology, hydrology, and soil science to present a coherent introduction to the surface of the Earth, with emphasis on both fundamental concepts and practical applications, as a basis for understanding and intelligent management of the Earth’s physical and chemical environment.",
  "topics": [
    "Engineering",
    "Environmental Engineering",
    "Hydrology and Water Resource Systems",
    "Science",
    "Earth Science",
    "Environmental Science",
    "Geology",
    "Geophysics",
    "Planetary Science",
    "Engineering",
    "Environmental Engineering",
    "Hydrology and Water Resource Systems",
    "Science",
    "Earth Science",
    "Environmental Science",
    "Geology",
    "Geophysics",
    "Planetary Science"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 2 hours / session\n\nPrerequisite\n\nPermission of instructor\n\nDescription\n\nThis course covers the following topics: Production and movement of surficial materials; soils and soil erosion; precipitation; streams and lakes; groundwater flow; glaciers and their deposits. The course combines aspects of geology, climatology, hydrology, and soil science to present a coherent introduction to the surface of the Earth, with emphasis on both fundamental concepts and practical applications, as a basis for understanding and intelligent management of the Earth's physical and chemical environment.\n\nTopics\n\nPhysics and chemistry of the Earth's surface\n\nHeating and cooling\n\nThe chemistry of the surface zone\n\nThe nature of water\n\nThe flow of water\n\nThe solid materials of the Earth's surface\n\nMinerals\n\nRocks\n\nBedrock\n\nWeathering\n\nRegolith and sediment\n\nSoils\n\nTopography\n\nMaps, and how to read them\n\nUnderstanding and using contours and contour maps\n\nGeologic maps and cross sections\n\nGroundwater\n\nInfiltration and percolation\n\nThe physics of groundwater movement\n\nAquifers, aquicludes, and the groundwater table\n\nWater wells\n\nGroundwater in coastal regions\n\nRivers\n\nHydrology of rivers\n\nFlow of water in rivers\n\nSediment transport in rivers\n\nPlan form of rivers\n\nClassification of rivers\n\nFloodplains and floods\n\nLakes\n\nThe nature of lakes\n\nThermal structure of lakes\n\nGlaciers\n\nGlaciology\n\nGlacial erosion and transport\n\nGlacial sediments\n\nGlacial landforms\n\nCoasts\n\nWaves\n\nTides\n\nClassification of coasts\n\nBeaches\n\nEstuaries\n\nDeltas\n\nDeserts\n\nThe nature of deserts\n\nEolian sediment transport\n\nWind ripples\n\nEolian dunes\n\nMass wasting\n\nCreep\n\nLandslides\n\nLandscapes\n\nLandforms\n\nThe nature of valleys\n\nThe nature of mountains\n\nErosion cycles\n\nDesert sand seas\n\nSmall-scale landforms\n\nRates of landscape change\n\nPhysical and chemical cycles\n\nThe Earth as a system\n\nThe hydrologic cycle\n\nThe carbon cycle\n\nExams\n\nThere are mid-term exam and final exam. Both exams are in class close book exams. Mid-term exam is optional.\n\nGrading\n\nIf a student receives better grade in final exam than in mid-term exam, then final exam counts for 100% of the grade. If a student receives better grade in mid-term exam than in final exam, then mid-term exam counts for 1/3 of the grade and final exam counts for 2/3 of the grade.",
  "files": [
    {
      "category": "Exam",
      "title": "final_exam.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-090-the-environment-of-the-earths-surface-spring-2007/a9fa9b75c929ddb46f3a11c600858e93_final_exam.pdf",
      "content": "NAME:\n\nTHE ENVIRONMENT OF THE EARTH'S SURFACE\nFINAL EXAMINATION\n\nThis is a closed-book examination. You have two hours to complete this\nexamination.\n\nPut all of your answers in this examination booklet. Return only the examination\nbooklet to me.\n\nThere are 165 total points in this examination.\n\nTOTAL:\n\n1 LITERACY [25 points]\n\nFor each of the following terms, supply a succinct definition (to fit into the space\nprovided. Each definition should be in the form of a \"noun phrase\", not a\ncomplete sentence. (Example: the definition of a \"stream is \"a channelized flow\nof water across the land surface\".)\n\nablation\n\nalbedo\n\naquifer\n\navulsion\n\nbase level\n\nbed load\n\ncirque\n\ndesert pavement\n\ndrainage basin\n\nesker\n\nfloodplain\n\ngroundwater\n\nhydrograph\n\ninfiltration\n\nloess\n\noverland flow\n\npeneplain\n\nphreatic zone\n\npoint bar\n\nporosity\n\nriver stage\n\nsaltation\n\nstream capture\n\nthermocline\n\nweathering\n\n2 TOPOGRAPHY [30 points]\n\nBelow is a topographic contour map of a land area with topographic relief.\n\n(1) [15 points] Draw, with solid curves, the traces of all major and tributary\nstream valleys.\n\n(2) [15 points] Draw, with dashed curves, the divides between all of the streams\nthat flow outward across the boundaries of the map. (Do not draw divides\nbetween the tributary streams you included in your answer to Part 1.)\n\n3 SHORT ANSWERS [60 points]\n\nAnswer each of the following questions in the space provided. Write carefully in\ncomplete sentences. Do not include material that is not directly relevant to your\nanswer, even if such material is true.\n\n(1) [20 points] Why is the slope of a beach become steeper with increasing size\nof the beach sediment?\n\n(2) [20 points] Why is the density of liquid water greater than the density of ice?\n\n(3) [20 points] How does a meandering river respond to slow subsidence of its\nsubstrate, and what are the consequences for human use of the floodplain of the\nriver? [By \"substrate\" I mean the region of the Earth's crust that underlies the\nriver valley.]\n\n4 SYNTHESIS [50 points]\n\nOn a gently rolling land surface on the continent of Envira is a low-to-the ground\noutcrop of quartz-bearing bedrock that is undergoing weathering. The weathering\nloosens one of the quartz particles, of sand size (about half a millimeter in\ndiameter).\nEventually, the little quartz particle makes its way to the ocean, where it is\ndeposited and remains for a geologically long time.\n\nThink about the possible pathways that the particle might take on its trip to the\nocean, and about the various processes and/or events that might be involved in its\ntravels.\n\nOn the following large blank page, draw a diagram that shows all of the possible\npathways of travel of the particle. For every step of the way, annotate the\ndiagram, succinctly and carefully. Your annotations should specify the nature of\nthe processes or events, and perhaps any other information that you think is\nrelevant.\n\nNotes:\n- Time is not a factor here. The trip might take a short time or a very long time,\ndepending upon speeds of movement and upon duration of periods of rest.\n- Let the scope of your consideration range widely in terms of climate: cold or\nwarm, arid or humid. You should make provision for the possibility that the\nclimate could change substantially during the time between first movement and\nfinal deposition."
    },
    {
      "category": "Exam",
      "title": "midterm_exam.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-090-the-environment-of-the-earths-surface-spring-2007/11aaf40be3a00970ad4148afbec06437_midterm_exam.pdf",
      "content": "NAME:\nHARVARD EXTENSION 2006-2007\nTHE ENVIRONMENT OF THE EARTH'S SURFACE\n\nThis is an open-book take-home examination. It is designed for you to spend\nabout three hours on it. The questions are representative of the kind and level of\ndifficulty I will build into the final examination.\nPut the answers to all of your questions in this examination book. Return only the\nexamination book to me.\n\nI CONSTRUCTING YOUR OWN TOPOGRAPHIC MAP (given various\nconstraints [50 points]\nOn the following page is a blank map of a land area with topographic relief. Note\nthat the map area has a north arrow but no horizontal scale and no stated contour\ninterval. YOU have to fill in the map with realistic contour lines, and certain\nother information, to represent in a qualitative way a land area with the features\nindicated below.\nYour map must have at least six contour-line levels within it.\nYour map must have at least three well-defined saddle points within it.\nAnswer all of the questions by use of the blank map. If you want to make sketches\nof trial maps, use your own blank paper (but don't hand that back).\nHINT: Obviously there are zillions of possibilities. Don't just start in to draw any\nold map. Some initial planning will make life much simpler for you.\n(1) [20 points] You get twenty points just for presenting a self-consistent set of\ncontour lines, with the requisite number of saddle points, that represent the\ntopography you are assuming.\nFour streams flow out from the map area across the boundaries of the map. These\nstreams flow in recognizable and well-defined valleys, and each has a number of\ntributary streams that also flow in recognizable and well-defined valleys. Be sure\nto adjust the contour lines to reflect the stream valleys!\n(2) [20 points] Draw the courses of all of the streams on your map by solid\ncurves.\n(3) [10 points] Draw the divides between the drainage areas of the major\nstreams (i.e., the four that flow out of your map area) by dashed curves.\n\nN\n\nII GROUNDWATER [50 points]\n\nYou are made responsible for a particular cubic meter of regolith with its upper\nsurface located about two meters below the ground surface. List, and comment\nbriefly upon, the factors that determine the rate of groundwater flow through the\ngiven cubic meter of regolith.\n\nAnswer this question in the space provided below.\n\nIII RIVER SYSTEMS [50 points]\nPart A [25 points]\nImagine that humankind were to do something catastrophic in the near future so as\nto cause the melting of most or all of the ice in the Greenland Ice Sheet, thereby\nraising sea level around the world by something like five meters. In the following\nblank pages, describe in as much detail as you can (both in words and, where you\nthink them appropriate, with diagrams), what would happen to the major river\nsystems of the world, in terms of the following aspects or features:\n\n- discharge\n- longitudinal profile\n- sediment load\n- channel pattern\n- valley morphology\n- nature of valley-fill deposits\n\nIn each case, indicate something about the firmness of your prediction: it could\nrange from almost certain to highly speculative.\n\nPart B [25 points]\nThe climate suddenly cools, worldwide. We enter upon a new ice age.\nContinental glaciers build up rapidly (in reality, they would not build up rapidly,\nbut for sake of discussion ... ). Sea level is lowered by about five meters.\nWhat would happen to the major river systems of the world, in terms of the same\naspects or features as in Part A? Answer this question in the same way as in Part\nA, on the following blank pages."
    }
  ]
}