{
  "course_name": "The Royal Family",
  "course_description": "This course is an an exploration of British culture and politics, focusing on the changing role of the monarchy from the accession of the House of Hanover (later Windsor) in 1714 to the present. The dynasty has encountered a series of crises, in which the personal and the political have been inextricably combined: for example, George III’s mental illness; the scandalous behavior of his son, George IV; Victoria’s withdrawal from public life after the death of Prince Albert; the abdication of Edward VIII; and the public antagonism sparked by sympathy for Diana, Princess of Wales.",
  "topics": [
    "Humanities",
    "History",
    "European History",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology",
    "Political Science",
    "Society",
    "European and Russian Studies",
    "Humanities",
    "History",
    "European History",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology",
    "Political Science",
    "Society",
    "European and Russian Studies"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nSyllabus Archive\n\nThe following syllabi come from a variety of different terms. They illustrate the evolution of this course over time, and are intended to provide alternate views into the instruction of this course.\n\nFall 2007, Harriet Ritvo (\nPDF\n)\n\nFall 2003, Harriet Ritvo (\nPDF\n)\n\nSubject Description\n\nAn exploration of British culture and politics, focusing on the changing role of the monarchy from the accession of the House of Hanover (later Windsor) in 1714 to the present. The dynasty has encountered a series of crises, in which the personal and the political have been inextricably combined: for example, George III's mental illness; the scandalous behavior of his son, George IV; Victoria's withdrawal from public life after the death of Prince Albert; the abdication of Edward VIII; and the public antagonism sparked by sympathy for Diana, Princess of Wales. In addition to readings, materials include portraits, news footage, and films.\n\nRequired Texts\n\nGriffiths, Ralph Alan, and John Ashton Cannon.\nThe Oxford Illustrated History of the British Monarchy\n.\n\nStrachey, Lytton.\nQueen Victoria.\n\nTownsend, Sue.\nThe Queen and I.\n\nAssignments\n\nThere will be three formal written assignments, of 2, 4, and 10 pages. They will be due in Lecture 2, Lecture 12, and Lecture 24 respectively. Assignment sheets will be given out in class and posted on the website. The final written assignment will include a progress report due in Lecture 21 and a class presentation (see the schedule for Lecture 24 and Lecture 25).\n\nIn addition, informal response papers (1-2 pages) on the readings for each unit will be due in class on the day that the readings are discussed.\n\nThere will be no final examination.\n\nGrading\n\nGrading will be based on the written assignments (75% distributed according to the length of the papers) and class participation (25%).\n\nRevision\n\nPapers may be revised and handed in for a new grade at any time before the last class meeting. The new grade will replace the old one. Revisions should be handed in along with the marked copy of the original version. They should represent a real rethinking or recasting, not just correction of misspellings, grammatical errors, and stylistic infelicities. Revisions will be accepted until the last day of classes.\n\nThings to Remember\n\nWritten assignments should represent original and individual work.\n\nAssignments are to be handed in on time. If an extension becomes necessary it should be requested ahead of the due date. Otherwise, lateness will be penalized.\n\nAttendance is important. Not all the material to be covered in class is included in the readings. Be sure to bring your copy of the readings to discussion classes.",
  "files": [
    {
      "category": "Resource",
      "title": "asgmt1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-342-the-royal-family-fall-2003/9f1dc2434ec2e9bb2ada5361949a589e_asgmt1.pdf",
      "content": "Peter Walton, A Celebration of Empire\n\n1. For what purpose was this book written? How do you think that is likely to affect its\nperspective? (preface)\n2. What is the point of sharing the \"well known\" story of how Victoria found out that she\nwas queen? (7)\n3. How does Walton describe reactions to the young queen? Do you really think this\nimpression was \"unanimous?\" (7)\n4. Why does Walton describe Victoria's relationship with the Navy and Army as one of\n\"mutual love and respect\" so early in the text? (8)\n5. Why does Walton emphasize that the queen \"very much enjoyed the whole day?\" Do\nyou think her diaries are good evidence for this? (8)\n6. What is the point of mentioning who decided that Victoria and Albert's honeymoon\nwas over? (9)\n7. Why does Walton pay so much attention to the question of military honors? (9-10)\n8. Why does Walton start praising Albert? What aspect of Albert's contributions does he\nemphasize? (12)\n9. Why is it a \"sad fact\" that the Queen spent only five weeks in Ireland? In what way\ndid the Irish \"not forget?\" (13)\n10. In what way does Walton demonstrate the loyalty of the Colonies? (14)\n11. How does Walton view the Empire? (14)\n12. Why do the queen's clothes matter so much to Walton? (23)\n13. Why does Walton note that the crowd of people \"was not a mob?\" What does this\nsay about the people's feelings for celebration? For the Queen? (19)\n14. What do the pictures that Walton has chosen emphasize? Who are the subjects of\nthe pictures? (26)\n15. What does Walton see as the point of the celebrations? (25)\n16. Is the Daily Mail description of the Queen the same as Walton's? (28)\n17. What is meant by the comment, \"it is men like Lord Roberts that make queens like\nQueen Victoria?\" (27)\n18. What aspects of Victoria's reign are emphasized in the Daily Mail article? What was\nthe order of procession? What does this represent? How does the article portray the\ncelebration? Is it a positive review? (27)\n19. What do you notice about the double page picture of the Colonial forces? What\nimage of Empire is this meant to portray? (34-35) What does Walton mean when he\nsays the picture is \"correct of 22nd June 1897 in London?\" (46)\n20. Does this piece strike you as historical writing? How does it differ from other styles\nthat we have read?\n21. Why is so much attention paid to the various military uniforms in the appendices? Do\nyou think there is some similarity between the elaborate costumes of the monarchy and\nthose of the military?\n22. What aspect of the empire is emphasized in the processions? Do you think that the\nmilitaries represent the empire?\n23. Pay attention to the orders of procession of the various militaries. What does this say\nabout the tension between war and peace and the state of international politics?\n24. Go back to the book and look at the pictures again. What impression do they leave\nyou with in terms of scale? Elaborateness? Organization? What do these pictures\nportray about the celebration?"
    },
    {
      "category": "Resource",
      "title": "asgmt2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-342-the-royal-family-fall-2003/6f1bcb728d6159a3f0f4378c54e5a1bc_asgmt2.pdf",
      "content": "Lytton Strachey, Queen Victoria, Chapters 1-6\n\nWhat is Strachey's opinion of his principle characters? How does he reveal this to his\nreaders?\nHow does he balance or interweave interpretation and information?\n\nWhat is the effect of Strachey's tendency to speak in his characters' voices, but without\nusing quotation marks? How can you tell when this is happening?\n\nWhat are Strachey's main sources for his account? Does he buttress all his assertions\nwith the same kind of references? If not, what explains the difference?\n\nHow does Strachey rank politics vs. personality as the subject of biography? As the\ncause of events?\n\nHow does \"foreignness\" figure in Queen Victoria? Is it the same as \"Germanness\"?\n\nStrachey was working on this book during World War I and it appeared soon afterwards.\nHow might this have influenced his (and his original readers') interpretation of Victoria's\nreign?\n\nWhat does Strachey think of Prince Leopold of Saxe Coburg (later King of the\nBelgians)? Why does he start the book with him? What is his attitude toward Saxe\nCoburg in general? Why?\n\nTone is an important tool for Strachey. Think about these sentences (and they are only a\nfew of many possible examples):\nThe tragedy at Claremont was of a most upsetting kind. (12)\nBut Owen was of a sanguine temperament. He also numbered among his proselytes\nPresident Jefferson, Prince Metternich, and Napoleon; so that some uncertainty must\nstill linger over the Duke of Kent's views. (15)\nFor it would be a mistake to suppose that either of these two men was actuated by a\nvulgar selfishness. (53)\nHe went to sleep in the Cabinet. (57)\nNext morning the royal critic was careful to note down her impressions. (63)\nVictoria, treasuring every word, preserving every letter, was all breathless attention and\neager obedience. (151)\nYet, strange to say, the object of all this vigilance and solicitude continued to be\nunsatisfactory and appeared, in fact, to be positively growing worse. (154)\n\nWhy does Strachey emphasize the Duke of Kent's rigidity when he is introduced? (14)\n\nWhat does Strachey think of Lord Sefton's description of the Duke of Kent's motives,\nwhich he quotes on 18?\n\nWhy was it important for the Duke of Kent to specify that his widow would be Victoria's\nguardian? (24)\n\nWhat does Strachey characterize Victoria as a representative of the middle classes? As\nopposed to what alternative? How is it possible for a member of the royal family to fulfill\nsuch a role?\n\nWhy does Strachey suggest that Victoria grew up without \"humor and imagination\"? (32)\nDoes this reveal anything about the author?\n\nHow does Strachey's account of William IV differ from that offered in the textbook?\n\nHow did the balance of power shift within the Duchess of Kent's household as Victoria\ngrew up? What political difficulties did the Duchess encounter by virtue of her position\nand her character? Why did Victoria cut her ties with her mother as soon as she became\nQueen?\n\nWhat does Strachey suggest about Victoria's relations with the Privy Council in his\ndescription of her first meeting with them? (47) How does that compare with the parallel\nset description of her reaction to the death of Albert? (175)\n\nWhen Strachey says that Melbourne had \"an individuality peculiar to the core,\" (55) does\nhe mean it as criticism or praise?\n\nWhat is Strachey's opinion of Victoria's own mastery of tone on 65?\n\nWhat does Strachey think is the relationship between Victoria's physical appearance and\nher temperament or character?\n\nWhat conflict between Melbourne's advice and example, in terms of their effect on\nVictoria, does Strachey allude to on 79 80?\n\nWhy does Strachey note that as a child Albert had \"a marked distaste for the opposite\nsex\" (84) and that Victoria had no cause for worry about his fidelity?\n\nWho is the \"more remarkable Englishwoman\" in Brussels during Victoria's visit? (106)\nWhat does this ranking reveal about Strachey's sense of values?\n\nWhat was so troublesome and fascinating about the \"boy Jones\" episode? (111 112)\n\nHow was it possible for Palmerston to order a special train to London on the spur of the\nmoment? (126)\n\nHow did Victoria and Albert's marital relationship influence her discharge of her duties as\nQueen?\n\nHow does Strachey characterize Albert's political role? Why was it a problem? What is\nthe constitutional issue raised on 147 148?\n\nWhy does Strachey mention the full size statue of Albert in kilts at Balmoral? (157)\n\nWhy was the Prince of Wales \"a true scion of the House of Brunswick\"? (168)\n\nHow sympathetic is Strachey to the dissatisfaction that he attributes to Albert? (169 170)"
    },
    {
      "category": "Resource",
      "title": "asgmt3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-342-the-royal-family-fall-2003/566bb0739089b2c5c61d48d4c4af48e7_asgmt3.pdf",
      "content": "Fanny Burney, Diary, selections\n\nWhat was Fanny Burney's position in the royal household? Was she a servant? Why or\nwhy not?\n\nTo what social class did Burney belong before she entered the royal household? How\ndid that influence her responses to the conditions of her employment? Which of those\nconditions did she find particularly problematic?\n\nWhy does Burney use marriage as a metaphor for her position (155)?\n\nWhat can you tell from the diary entries and letters about Fanny Burney's character? Is\nshe a careful observer? A trustworthy judge of character?\n\nCan you see any difference between the letters (addressed to others) and the diary\n(addressed to herself)? Was the diary intended for an audience of one?\n\nHow does her account of events (especially the King's illness) differ from or corroborate\nthose in other sources (the textbook, the movie)? Does her eyewitness perspective and\ninvolvement in the emotional ups and downs of the household make her more or less\nreliable as a source?\n\nHow does Burney portray the Queen? The King? The Prince of Wales? How does her\nsense of their personalities accord with that you have gleaned from other sources?\n\nWhat was the like of the royal household like (schedule, etiquette, etc)?\n\nHow would you characterize the King's literary tastes (144-7)? The breadth of his\nreading?\n\nThere is a lot weeping in these selections. What was the value and significance of tears\nin Fanny Burney's view?\n\nIn describing the King's illness, how does Burney juxtapose the political and personal\ndimensions of the story? What is the effect of the repeated phrase: \"the Royal sufferer\"?\n\nWhat is the point and the effect--of the episode in which she inadvertently encounters\nthe recovering King and flees from him through the shrubbery (213-20)?\n\nWhat about the episode in which the \"Royal sailor\" commands members of the\nhousehold to drink toast after toast (231-4)?\n\nWhy was it so difficult for her to leave the royal establishment?"
    },
    {
      "category": "Resource",
      "title": "asgmt4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-342-the-royal-family-fall-2003/bb845777748ed0884eeba91d64d82e10_asgmt4.pdf",
      "content": "William Makepeace Thackeray, The First Four Georges, Parts 1 and 2)\n\nWhat is Thackeray like as a historian? What is his persona? What are his political\nopinions? What is his definition of history (or of what he is writing)? Why does he\nemphasize that he isn't writing \"grave historical treatises\" (2, 10)?\nDo you like him? Do you trust him?\n\nGeorge I\n\nHow does he describe the Hanoverians in their pre-British days (2-3)? Hanover (8-9)?\nWhy does he emphasize the disparity of wealth and poverty on the European continent\n(4-5)?\nWhat does Thackeray think of Hanoverian religious convictions (5-6)?\nWhat does he think about the hiring out of mercenaries (3, 6)?\n\nWhat is Thackeray's final judgment of George I (6, 19)? On what does he base it? Why\ndoes Thackeray discount the opinion of George's cousin Elizabeth Charlotte?\n\nWhat is Thackeray's opinion about the story of George I's wife? Does he think that\nGeorge was a monster for locking her up in a castle (11-14)? Why does he compare her\nwith Mary Queen of Scots and Caroline of Brunswick?\n\nWho is Thackeray criticizing on 14-15 the King and his German train, or the newly loyal\nEnglish subjects who received him? What does he think of the Duke of Marlborough?\n\nWhat is the point of the counterfactual on p.16?\n\nWhat does Thackeray think is the proper attitude toward monarchy (20)? Does he\nexemplify it?\n\nGeorge II\n\nWhy does Thackeray emphasize his small size? His martial nature? What is T's overall\nestimate of George II (177)?\n\nWhat does Thackeray think about Sir Robert Walpole (176)?\n\nWhat does T think of Queen Caroline? What is the point of the \"J'aurai des maitresses\"\nanecdote (181)?\n\nWhy does Thackeray include a generalized evocation of old (18th century) England\n(184-7)? How persuasive is it?? What is the point of the newspaper excerpts on 187-8?\n\nWhat does Thackeray think of George's fondness for things German (189-90)?\n\nWhat does Thackeray think of his caperings as an old man (190-1)?"
    },
    {
      "category": "Resource",
      "title": "asgmt5.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-342-the-royal-family-fall-2003/a5b66524b8571ce23265c273b7a69859_asgmt5.pdf",
      "content": "Laqueur, \"The Queen Caroline Affair: Politics as Art in the Reign of George IV\"\n\nWhy does he call the Queen Caroline affair trivial? Do you agree? If it is trivial, why is it\nworth writing an article about? (417)\nWhat is the point of Hazlitt's comment (418) about the attention paid to the Queen, as\nopposed to public indifference to many other injustices?\nDo you agree with Laqueur that George's behavior toward Caroline should be\nconsidered harassment? (418)\nDoes the rioting around her funeral cortege resonate with recent experience with the\nPrincess of Wales? Why or why not? (421)\nHow (if at all) does Laqueur distinguish between the Caroline affair as politics and as\nart? (422)\nWere the King's ministers right to be nervous about the public response to the \"trial\"?\n(422)\nWhy did radicals adopt Caroline's cause? Do you think that she was really radical?\nWhy did she appeal so strongly to the Apopulace@ (middle and lower classes)? (425-7)\nWhat was the Caroline-inspired propaganda like? Why was there so much and so\nvarious of it? (429)\nWhy does Laqueur emphasize that this agitation and propaganda emanated from\nprovincial towns as well as from London? (430)\nWhat effect did this newly powerful expression of public opinion have on the way the\nCaroline affair played out on the level of high politics? (431)\nWhy was Caroline routinely described as a vulnerable and unprotected female? (432)\nDo you think that this was the reason that her advocates often resorted to riot and\nviolence? (432)\nWhy was the propaganda generated by this debate so frequently indecent? (436)\nWhy does Laqueur argue that the element of gossip that was so undermining to the\ndignity of the king, ultimately trivialized the whole affair, so that it had no further\npolitical/radical repercussions? (438-9) [This is the heart of his argument]\nDo you agree that the aestheticization of the Caroline affair precluded its politicization?\nWhy should the trivialization of the case against Caroline undermine the radical position\nbut not the royalist one? (440)\nWhat is the effect of treating an episode of royal politics as a story about the nature of\nmarriage? (441)\nHow did male and female responses to the Caroline affair differ? (442-3)\nWhat were the arguments for and against the double standard in marriage? (445-6)\nWhat do you think of the argument that the affair should never have been publicized\nbecause it was inappropriate for discussion in the public press? (447)? Reminiscent of\nMonica L.?\nWhat role did xenophobia play in English response to the case? (453)\nWhat is the role of carnival (456) and charivari in Laqueur's (and Clark's) interpretation of\nthis episode?\nDoes Laqueur's emphasis on theater and theatricality undermine the political\nsignificance of the episode, or is he just describing it?\nDo you agree with his suggestion that in this case politics began to conform to art?\nDid the popular/royalist demonstrations of support for Caroline tend to undermine\nroyalism or radicalism? (460-1)\n\nWhy did ideas of chivalry feature so prominently in the Caroline affair?\nClark\n\nWhat relation does she posit between gossip and \"serious history\"? (47)\nHow does she characterize her argument in relation to Laqueur's? (47)\nIs her interpretation more feminist than Laqueur's?\nWhy does Clark think it is important to analyze popular response to Caroline as a\nrepresentation of plebeian families, rather than as a reflection of them? (48)\nWhy was there such a strongly felt need for a new style of politics at this period? (50)\nDo you agree with Clark that the popular Caroline propaganda represented a way of\nengaging the illiterate masses (rather than a trivialization of the radical message, as\nLaqueur suggests)? (51)\nHow does her interpretation of the role of chivalry differ from Laqueur's? (53)\nWhere does Clark identify the sources of emotional power of the defense of Caroline?\nRelation to feminism (or protofeminism)?"
    },
    {
      "category": "Resource",
      "title": "asgmt6.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-342-the-royal-family-fall-2003/7afed2db4b053d391b9cb565ed083c2a_asgmt6.pdf",
      "content": "Cannadine, \"The Context, Performance and Meaning of Ritual:\"\n\nThe essay begins with two 19th century critiques of British royal ceremony. Do they\nagree?\n\nIs it true that Queen Elizabeth is surrounded by more ceremony than anyone else? If so,\nwhy? (102)\n\nWhat does he think that elaborate ceremonial always seems traditional, whether it is or\nnot? (102)\n\nHow does he think that historical and sociological analysis of ceremonial differs? (104)\nWhat does he mean by \"thick description\"? (105)\nIs it paradoxical that stasis can indicate change? (105)\n\nWhat is the effect of enumeration 10 specific aspects of ritual? (106-7)\n\nDo you agree with the suggestion that royal pomp and ceremony in Britain has varied\ninversely with royal power but directly with royal popularity?\n\nDoes Cannadine's argument about the popular press (111) contradict Colley's\nsuggestion that even disrespectful publicity enhanced the stature of the monarchy?\n\nDo you think his notion that power makes ceremony unnecessary can be applied equally in\nother places, for example, Russia or Germany? (116) Why does he think that ceremony\nwas associated with royal weakness in Britain and royal strength in other places? (121)\nWhat about at different times (for example royal ceremony in 16th and 17th century\nBritain)? (121) Does he give sufficient weight to the difference between a constitutional\nmonarch and one who exercised real political power? (133)\n\nWhat is the meaning of the distinction he makes between the head of society and the\nhead of the nation? (116)\n\nWhat is the relation of Gladstone's criticism of Victoria's avoidance of ceremony to his\nnotion of her functioning as Queen? (119-20)\n\nWhy does Cannadine think that royal ceremonial improved at the end of the\n19th/beginning of the 20th century? (120)\n\nWhy does Cannadine think that the emergence of the Empire strengthened affection for\nroyalty and also royal ceremonial? (122-2)\n\nWhy does Cannadine concentrate so much on music? (130ff)\n\nHow much of the rise and fall of royal ceremonial can be explained by the personality of\nthe monarch, as opposed to external factors? (135)\n\nCannadine notes that ceremonial became a more prominent feature of many aspects of\nBritish and imperial society in the late 19th century. What influence does this have on his\n\nargument about the significance of purely royal ceremony. Could it be explained as a\nconsequence of currents running through society as a whole? (138)\n\nOn p. 140 he describes George V's formula for success as combining the grand and the\ndomestic. This sounds like George III's formula, can you think of any reason for\nCannadine to understate the popular appreciation of George III?\n\nWhy does he think that BBC coverage of the monarchy has been so important? (142)\nWhy does he compare the broadcast of George VI's funeral with the newspaper\ncoverage of the death of George IV (153)? Is the comparison illuminating or fair?\n\nWhat is the significance of his use of the word Afairytale@ (142)?\n\nHow well has Cannadine's analysis of the public position of Elizabeth II held up? (155ff)\n\nLook at the 5 statistical tables at the end (163-4). What information can you extract from\nthem? How well chosen are they? Can you think of other information that would have\nbeen more illuminating?"
    },
    {
      "category": "Resource",
      "title": "asgmt7.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-342-the-royal-family-fall-2003/06fa178db6a4e1386c35c0ee651385ca_asgmt7.pdf",
      "content": "A King's Story\n\nWhat is the role of \"character\" in A King's Story? Does the character that the narrator\nreveals in his text agree with the character that he attributes to himself?\n\nWhat does he present as the role of a prince (and a king) in a democratic society? (254)\nIs it reasonable or unreasonable for him to think of himself as his own master? (254)\nOf the king as having a private life that is total independent of his public position? (321)\nDo you think that in a sense he felt his abdication as a liberation? (408)\n\nWhat is the business of being King like? (Two different accounts of sample days: 319\nand 352)\n\nDoes the initial description of their meeting give a persuasive sense of why he found\nMrs. Simpson so wonderful? Does he do this anywhere? (254-6)\n\nWhat do you think about his discussion of divorce on 257?\nDoes Edward present his views on divorce as changing in the light of his own\nexperiences? If not, why not?\nWhy does he claim on 258 that his intended wife was beyond reproach?\n\nWhat is the force and purpose of his comparison of his brother the Duke of York to their\nfather George V on 258? (See also 319)\n\nThe narrator makes many references to the closeness among members of his original\nnuclear family. Are these claims supported by the text?\nHow would you describe his relations with his father? His mother? (311) His brother\nBertie? (410) His other brothers? His sister? (For family reaction to his plans: 334-6)\n\nDo you agree with his assessment and explanation of the reticence of the British press\nwith regard to the private life of the monarch? (314-5)\n\nWhat do you think of Edward's use of the following metaphors?\nPrime minister as Procrustes: 317\nRoyal minuet: 321\nBaldwin's car as sinister black beetle: 332\nHimself as Eliza in Uncle Tom's Cabin: 332\nHis mother's position as a fortress: 334\n\nWhat do you think of Edward's behavior and the Prime Minister's during their first\ndiscussion of the Wallis issue? (317-8)\nWhy does he respond to the communication from Alec Hardinge as though it was a\npersonal challenge? (326-7)\n\nDo you agree that Edward and the archbishop of Canterbury were equally fighting for\nprinciples? (331)\nWhat does Edward mean when he says that \"Men do not all live by the same rules.\"?\n(331)\nWhy does he characterize his decision to abdicate as a \"spiritual struggle\"? (336)\n\nDo you think that he gave up the struggle too easily? (354)\n\nHow does he characterize his own performance when he opened Parliament? Why does\nhe focus on the trivial symbols office? (322-3)\n\nWhy was he worried about signing the Declaration of Protestant faith? (324)\n\nWhat is the role of external political issues in this narrative?\nGermany: Ribbentrop 321-2\nSouth Wales miners:"
    },
    {
      "category": "Resource",
      "title": "asgmt8.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-342-the-royal-family-fall-2003/623923ed8025dea40532b76fbfd0a112_asgmt8.pdf",
      "content": "Official Program for King George's Jubilee\n\nCover: what is the device (in gorgeous color in the original pamphlet)?\n\nWhat was the purpose of the Jubilee?\nWhat was the purpose of the Jubilee Program? Who was its audience? How do you\nthink people could get it?\nTo what genre does it belong? What are the implications of this implied similarity?\n\nWhy is the message from the Prince of Wales at the beginning of the program? Why do\nyou think there is a disclaimer about the profits (bottom of page 1)? What is King\nGeorge's Jubilee Trust? Which youth does it intend to aid?\n\nWhat do you think of the portraits? What impression do they give of the king and his\nfamily? Are they consistent with the image that was presented in the video?\n\nWhy does the article by John Drinkwater focus so much on the distinction between the\nKing as a person and the King as monarch? (6) (also 8)\nIn what sense can it be said that \"he is England, he is Britain, and he is the Empire\"? (6)\n\nWhat do you think of the selection of photographs to accompany Drinkwater's article?\n\nWhat relationship does Drinkwater posit between constitutional monarchy, empire, and\ndemocracy? (6,7, 11) What is his notion of democracy? Why does he mention the\nconstitutionality of the monarchy so persistently?\n\nWhy is the Empire so prominent in Drinkwater's essay, and in the pamphlet as a whole?\nWhy is the bond between the King and his Empire so frequently described in terms of\npersonal affection? (10)\n\nWhat is the relationship between the empire and \"our race\"? (7,8)\nWhat is the significance of the itinerary George and Mary followed on their Imperial tour\nof 1901? (9)\n\nWhat is the poet laureate?\nWhat does the poem mean?\n:\nHow is the Empire represented among the dignitaries in the procession? How does it\ncompare with the representation in Victoria's Jubilee?\nWhat is the point of the maps on p. 16-17 and 26?\nWith regard to the maps on p. 26, what is the significance of the routes?\n\nWhy do you think that the centerpiece of this national celebration was a religious\nservice?\nHow does the Dean of St. Paul's deal with the tension between the official (popular,\ngovernmental) purpose of the jubilee, and its embodiment in a religious service?\n\nWhat mission does he think that God has given \"our race and Empire\"? (18)\nWhat do you think about the choice of psalms, hymns, and scripture? (20-22)\n\nWhy do you think there is a separate entry about the importance of broadcasting in\naddition to the schedule of broadcasts?\n\nWhy is the genealogical table included on p. 28?\n\nWhat is the point of the ceremony of the sword? (29)\nWhat do you think of the symbol of the King's Jubilee Trust (last page)?"
    }
  ]
}