{
  "course_name": "The Peripheral Auditory System",
  "course_description": "In this course, experimental approaches to the study of hearing and deafness are presented through lectures, laboratory exercises and discussions of the primary literature on the auditory periphery. Topics include inner-ear development, functional anatomy of the inner ear, cochlear mechanics and micromechanics, mechano-electric transduction by hair cells, outer hair cells’ electromotility and the cochlear amplifier, otoacoustic emissions, synaptic transmission, stimulus coding in auditory nerve responses, efferent control of cochlear function, damage and repair of hair-cell organs, and sensorineural hearing loss.",
  "topics": [
    "Health and Medicine",
    "Anatomy and Physiology",
    "Sensory-Neural Systems",
    "Science",
    "Biology",
    "Biophysics",
    "Neuroscience",
    "Health and Medicine",
    "Anatomy and Physiology",
    "Sensory-Neural Systems",
    "Science",
    "Biology",
    "Biophysics",
    "Neuroscience"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 2 hours / session\n\nRecitations: 1 session / week, 1 hour / session\n\nCourse Overview\n\nThere are two lectures per week, one devoted to a 'real' lecture containing new material, and one devoted to discussions of research papers with topics from previous lectures. You will be expected to read these papers and turn in written answers to the 'study questions' before the discussion lecture. There are six recitation sessions scheduled throughout the term, in which problem sets will be discussed. Finally, there are two labs: anatomy (viewing slides of auditory structures) and a physiology experiment (assessment of mouse hearing).\n\nCourse Structure\n\nLectures: 1 per week, 2 hrs duration, summarizing basic principles in each major area\n\nPaper Discussions: 1 per week, 2 hrs duration, with student-led discussions of the original scientific literature\n\nProblem Sets: 1 every other week, with a TA-led recitation session to discuss answers, which must be turned in the day before by 5:00 p.m.\n\nLaboratory Exercises:\n\nAnatomy of the Auditory Periphery\n- light- and electron-microscopic evaluation of the inner ear and\n\nFunctional Assessment of Mouse Hearing\n- recording brainstem evoked responses and otoacoustic emissions from anesthetized mice.\n\nAssignments\n\nIn addition to completing the 6 problem sets, each week, students will:\n\nRead overview material assigned for each Lecture\n\nRead 2-3 papers assigned for that week's Discussion\n\nTurn in written answers to Study Questions designed to guide reading of assigned papers\n\nAt least twice during the semester, each student will present a 15-minute oral summary of one of the papers assigned for Discussion. In preparation for this presentation, each student will meet twice with an Instructor.\n\nOnce during the semester, each student will be Discussion leader for a Paper Discussion and will be responsible for producing a short (5-page) summary of the salient points.\n\nFor Mouse Hearing Laboratory, students will work in small groups and each group will prepare and present a Lab Report during one of the Discussion Sessions.\n\nExams\n\nThere will be a final exam.\n\nTexts\n\nStudents are strongly encouraged to buy two books:\n\nGeisler, C. Daniel.\nFrom Sound to Synapse: Physiology of the Mammalian Ear\n. New York, NY: Oxford University Press, 1998. ISBN: 9780195100259.\n\nAlberts, Bruce, et al.\nMolecular Biology of the Cell\n. 4th ed. New York, NY: Garland Science, 2002. ISBN: 9780815332183.",
  "files": [
    {
      "category": "Resource",
      "title": "problemset1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-721-the-peripheral-auditory-system-fall-2005/52a5225112e388525afa44f0f3b905ba_problemset1.pdf",
      "content": "Harvard-MIT Division of Health Sciences and Technology\nHST.721: The Peripheral Auditory System, Fall 2005\nInstructors: Professor M. Charles Liberman and Professor Joe Adams\nHST 721 PROBLEM SET 1\n\nProblem Set 1: Anatomy and Hair Cell Physiology\n\nDue Date: 10-03-2005\n\nThese problems sets are intended to help you integrate the material learned in HST721. You\nare required to turn in individually written solutions sets. You are encouraged to work\nthrough the problems individually before discussing them in small groups. If you do work\nthrough the problems in small groups please include the names of your group members at the\nbeginning of your write-up. Please include appropriate citations if you find your answers in\nthe literature.\n\nHST 721 PROBLEM SET 1\nProblem 1\n\nUse the accompanying image of a section through the middle of guinea pig cochlea to\nestimate the volume of scala media. Express your answer in mm3 and show your work. Hint:\nUse the 3-D viewer of the human temporal bone to help you visualize how this single section\nmust relate to the entire spiraling cochlear duct (remembering that the human cochlear spiral\nhas three turns, whereas the guinea pig cochlear spiral has four turns.\n\nTo simplify the process, you may:\n- consider each cross-section through the scala media to be a right triangle\n- consider that each half turn (e.g. lower turn I to upper turn I) is a perfect semicircle\n\nTurn IV\nUpper\nTurn III\nUpper\nTurn II\nUpper\nTurn I\nUpper\nTurn IV\nLower\nTurnIII\nLower\nTurn II\nLower\nTurn I\nLower\n0.5 mm\nImage by MIT OCW.\n\nHST 721 PROBLEM SET 1\nProblem 2\n\na) Draw a schematic representation of a hair cell and its stereocilia bundle, indicating\nthe hair cell type. Include all structures important for transduction.\n\nb) Note on your drawing 1) the direction of stereocilia motion that produces a\ndepolarization of the hair cell and 2) the location(s) of the transduction channels.\n\nc) Provide estimates of the following: 1) hair-cell length, 2) height of the tallest\nstereocilia, 3) resting potential inside the cell, outside the cell near its apical\n(stereociliary) end and outside the cell near the synaptic end, and 4) Na+ and K+\nconcentrations inside the cell, outside the cell near its apical (stereociliary) end and\noutside the cell near the synaptic end.\n\nd) Using the Nernst equation, compute the equilibrium potentials for K+ and Na+\nacross the basolateral hair cell membrane. What is an equilibrium potential?\nExplain the significance of any differences you find between the equilibrium\npotentials for Na+ and K+, and the value of resting membrane potential for this cell\nyou cited in part c).\n\ne) Graph the relationship between stereocilia deflection and the \"open probability\" of\nthe transduction channels. Label the axes, indicating clearly the rest position for\nthe hair bundle and the magnitude of the deflections eliciting maximal response.\n\nf) When the transduction channels open, which ions carry the bulk of the\ntransduction current? Why?\n\nHST 721 PROBLEM SET 1\nProblem 3\n\nThe instantaneous relations between transduction-channel conductance (summed over all\ntransduction channels) and\ndisplacement of stereocilia\ntips have been determined in\ntwo types of hair cells. The\nshape of the relation and the\nmaximum summed\nconductance is identical in\nboth, but the situation at rest\ndiffers as indicated. For one,\ntype \"T,\" 10% of the\ntransduction channels are\nopen at rest; for the other,\ntype \"F,\" 50% are open at\nrest. All other\nelectrophysiological\ncharacteristics of the two cell\ntypes are identical. Assume\nthat both are present in an\ninner-ear organ facing the\nsame fluid compositions and presented with the same electrical potential difference between\nendolymph and perilymph.\n\na) What differences in cellular or molecular processes or structures might account for the\ndifference in the proportion of transduction channels open at rest?\n\nb) How would you expect the two cell types to differ in their resting intracellular potentials\nwith respect to perilymph?\n\nc) How would you expect their AC and DC intracellular electrical responses to low-level\nstimuli (magnitude indicated by short horizontal bar) to differ for 300-Hz stimuli? For 5000-\nHz stimuli?\n\nd) How would you expect their AC and DC intracellular electrical responses to high-level\nstimuli (magnitude indicated by long horizontal bar) to differ for 300-Hz stimuli? For 5000-\nHz stimuli?\n\ne) One of the these transducer types more closely approximates the situation in inner hair cells\nand the other in outer hair cells. Which is which, and why might these characteristics be well\nsuited to the differing functional roles of these two cell types?"
    },
    {
      "category": "Resource",
      "title": "problemset2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-721-the-peripheral-auditory-system-fall-2005/126c99d0b820d3da6759922a6ede458b_problemset2.pdf",
      "content": "Harvard-MIT Division of Health Sciences and Technology\nHST.721: The Peripheral Auditory System, Fall 2005\nInstructors: Professor M. Charles Liberman and Professor Joe Adams\nProblem Set 2: Endocochlear Potential and Cochlear Mechanics\n\nDue Date: 10-17-2005\n\nThese problems sets are intended to help you integrate the material learned in HST721.\nYou are required to turn in individually written solutions sets. You are encouraged to\nwork through the problems individually before discussing them in small groups. If you\ndo work through the problems in small groups please include the names of your group\nmembers at the beginning of your write-up.\n\nProblem 1:\nFurosemide is a diuretic used to decrease blood volume. In large doses it can also cause a\nhearing loss which is usually fully reversible. Furosemide has these effects because it\nblocks the Na-K-Cl co-transporter. Based on the currently accepted (Takeuchi) model of\nEP generation, how would you expect the following to change in the minutes after\nfurosemide administration (defend your answers):\na. The endolymphatic potential\nb. The endolymphatic K concentration\nc. The intrastrial potential\nd. The intrastrial K concentration\ne. The potential inside the tunnel of Corti\nf. The K concentration inside the tunnel of Corti\n\nIf you fix the ear during a dose of furosemide and examine inner ear morphology, you\nsee expansion of the intrastrial spaces suggesting an accumulation of water between the\nintermediate cells (edema).\ng. Can you explain this water movement following furosemide using the currently\naccepted model? Explain.\n\nThe cochlear microphonic (CM) potential represent the summed receptor currents of all\nthe hair cells in the inner ear. According to the accepted (Davis) model, hair cell receptor\ncurrents arise via movement of K through the variable resistance of the transduction\nchannels in stereociliary bundles.\nh. By how much would you expect the CM to change when you give a fully\neffective dose of furosemide: express the answer both as a fractional change and\nas a dB change.\ni. Based on the above calculation, how much hearing loss would you expect? Based\non the data from the Ruggero and Rich paper (Discussion #4), how much\nhearing loss would you expect? Explain any discrepancy\n\nIf you interrupt the blood supply to the ear, thereby decreasing the activity of all ion\npumps, the endolymphatic potential falls to a negative value, e.g. -15 mV.\nj. If you assume that this potential is largely a diffusion potential arising from ions\nmoving down their concentration gradients, what does this observation suggest\nabout the relative permeabilities of Na and K? Through what channels might the\nions be moving?\n\nProblem 2:\n(a) On a set of clearly labeled graphs, draw the basilar membrane displacement vs.\nsound pressure curves you would expect from a spot 5 mm from the base in a\nhealthy mammalian cochlea. On one graph show the result for tonal stimulation\nat the best frequency for that spot (assume ~8 kHz), on the other show the result\nfor tonal stimulation at a much lower frequency (~1 kHz). Make sure you label\nthe axes, including both the numerical values and the units, and indicate whether\nthe axes are logarithmic or linear.\n\n(b) On the graphs, indicate how these basilar membrane displacement vs. sound\npressure curves would change after the animal died. For clarity, superimpose the\n\"healthy ear\" curve you plotted above on the \"dead ear\" curve in each panel.\n\n(c) Discuss which of these \"input-output curves\" show linear or non-linear behavior,\nand briefly describe a likely source of any non-linearity observed in these curves.\n\nProblem 3:\nWhen two primary tones, f1 and f2, are presented simultaneously to the ear in an\nappropriate frequency ratio (f2/f1 = ~1.25), a number of distortion product otoacoustic\nemissions (DPOAEs) can be measured in the ear canal sound pressure as well as in the\nmotion of the basilar membrane. The strongest distortion component is usually at the\nfrequency 2f1-f2.\n\nThe current model of DPOAE generation states that when outer hair cells (OHCs) in one\ncochlear location are driven simultaneously at the two input frequencies, f1 and f2, the\nsaturating non-linearity in the mechano-electric transduction apparatus produces a\ndistortion component at 2f1-f2 in the receptor potentials which drives the OHC motors.\nExperimentally, it is observed that cochlear insults which target the OHCs decrease the\nDPOAEs.\n\na) Given what you have learned about cochlear mechanics, is it more reasonable to\npropose that the DPOAEs arise near the cochlear region tuned to f2 or the region\ntuned to f1? Explain your reasoning in words and graphs.\n\nIn mammalian ears, empirical observation shows that the DPOAEs are often largest when\nthe level of the f1 tone is 10 - 20 dB greater than that of f2.\n\nb) Given what you have learned about cochlear mechanics, can you explain why this\nmight be?"
    },
    {
      "category": "Resource",
      "title": "problemset3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-721-the-peripheral-auditory-system-fall-2005/4b36a3db723f889aa3aee524f5dd0526_problemset3.pdf",
      "content": "Harvard-MIT Division of Health Sciences and Technology\nHST.721: The Peripheral Auditory System, Fall 2005\nInstructors: Professor M. Charles Liberman and Professor Joe Adams\nProblem Set 3: Afferent Transmission and Auditory Nerve Response\n\nDue Date: 10-31-2005\n\nThese problems sets are intended to help you integrate the material learned in HST721.\nYou are required to turn in individually written solutions sets. You are encouraged to\nwork through the problems individually before discussing them in small groups. If you\ndo work through the problems in small groups please include the names of your group\nmembers at the beginning of your write-up.\n\nProblem 1:\nThe tuning curves (right) and rate-vs.-level functions (left) for tones at the characteristic\nfrequency (CF) are shown for three auditory-nerve fibers with high, medium or low\nspontaneous rate (SR) .\n\na) Identify which fiber belongs to which SR group and sketch graphically the\nrelation between SR and threshold at the CF. Label all axes clearly.\n\nReconstruction of intracellularly labeled fibers such as these shows that each forms only\na single afferent synapse and suggest that all three fiber types could contact the same\ninner hair cell.\n\nb) Outline the critical processes of afferent synaptic transmission both pre- and post-\nsynaptically that theoretically should contribute to threshold sensitivity. Suggest\ndifferences in these processes that might produce the difference in sensitivity\nbetween high and low-SR fibers.\n\nIntracellular labeling studies have also shown that low SR fibers have smaller diameters\nthan those with high SR. The diameter difference is seen both for the unmyelinated\nportion within the organ of Corti and the myelinated portions outside the sensory\nepithelium. It has been suggested that the diameter differences per se cause the threshold\ndifferences between low- and high-SR fibers.\n\nc) Given what you have learned about the generation and transmission of electric\npotentials in nerve fibers, explain how this could come about. Assume: 1. EPSPs\n(excitatory post-synaptic potentials) are generated at the afferent synapse; 2. The\n-20\n-20\n-10\n0.1\n1.0\n10.0\nDischarge rate (spikes / sec)\nSound pressure (db SPL AT TM)\nFrequency (kHz)\nSound pressure (db SPL AT TM)\nMCL94-227\nMCL94-225\nMCL94-22\nImages by MIT OCW.\n\naction potentials are generated at a point just outside the organ of Corti, at the\nonset point of myelination within the osseous spiral lamina.\n\nAcoustic trauma can cause loss of stereocilia on inner hair cells: they break off at the\napical surface of the cell, and the cell membrane reseals. Such stereocilia loss is\ncorrelated with an apparent decrease in SR of all auditory nerve fibers.\n\nd) Explain how loss of stereocilia might decrease spontaneous rate. Hint: 1) assume\nthat the transduction channels are located in the tips of the stereocilia; 2)\nremember that the transduction channels are not always closed in the absence of\nacoustic stimulation\n\nIt seems possible that some (or all) of the \"spontaneous\" activity in the auditory nerve is\nactually a response to low-level noise in the environment or internal noise generated by\nthe animal itself: i.e. that all fibers actually have low SR, and that the most sensitive\nfibers are always driven by background noise and thus appear to have higher SRs.\n\ne) How could you determine experimentally whether the rate measured in the\nabsence of purposely applied sounds is truly \"spontaneous\" or actually sound-\ndriven? Suggest a number of different experimental approaches. Hint: for one\napproach, think about the fine time-patterns of discharge you might expect in\nauditory nerve fibers if you purposely applied low-level broad-band noise (See\nProblem 2d).\n\nProblem 2:\nThe graph to the left shows the rate-based tuning curves of two auditory nerve fibers (A\nand B). Assume that each of these fibers has a\nspontaneous rate of 50 sp/sec.\n\na) Sketch the rate-vs-level functions expected\nfor Fiber A and Fiber B for tone-burst\nstimulation at the CF. Supply numerical values\nfor all axes.\n\nb) Sketch the PST histogram expected for a\ncontinuous tone presented at the frequency/level\ncombination indicated by the numbers 1 and 2.\nSupply numerical values and units for all axes.\n\nb) Sketch the interval histograms expected for\nresponse to a continuous tone presented at the\nfrequency-level combinations indicated by the numbers 1 and 2 Supply numerical values\nand units for all axes.\nFiber A\nCF=0.2 kHz\nCF=6.0 kHz\nFrequency\nFiber B\n\nc) Sketch the period histogram expected for a continuous tone presented at the\nfrequency/level combination indicated by the numbers 1 and 2. Supply numerical values\nand units for all axes.\n\nd) Sketch the interval histogram expected for the response to broadband noise presented\nat the level indicated by the numbers 1 and 2. Supply numerical values and units for all\naxis."
    },
    {
      "category": "Resource",
      "title": "problemset4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-721-the-peripheral-auditory-system-fall-2005/4e5275b3c12a1b67c9bef8a088b970c5_problemset4.pdf",
      "content": "Harvard-MIT Division of Health Sciences and Technology\nHST.721: The Peripheral Auditory System, Fall 2005\nInstructors: Professor M. Charles Liberman and Professor Joe Adams\nProblem Set 4: Efferent Control\n\nDue: 11-21-2005\n\nThese problems sets are intended to help you integrate the material learned in HST721. You are\nrequired to turn in individually written solutions sets. You are encouraged to work through the\nproblems individually before discussing them in small groups. If you do work through the\nproblems in small groups please include the names of your group members at the beginning of\nyour write-up.\n\nProblem 1:\nExplain how electrical activation of the olivocochlear bundle (OCB) leads to its peripheral\neffects. Discuss the molecular mechanisms underlying this effect. Include a discussion of all\nrelevant ion channels in the OHC and of how these channels are coupled to changes in cochlear\nthreshold sensitivity.\n\nProblem 2:\nOne hypothesized functional role of the middle-ear muscle (MEM) reflex and the medial\nolivocochlear (MOC) efferent reflex is anti-masking, i.e. the improvement of hearing in noisy\nenvironments.\n\na) The MEM reflex is thought to reduce the upward spread of masking, i.e. the phenomenon\nwhereby a low-frequency noise or tonal \"masker\" can raise thresholds for the percept of a high-\nfrequency \"signal\" tone. The upward spread of masking arises largely from suppressive masking\nrelated to the phenomenon of \"two-tone suppression\".\n- Describe the phenomenon of two-tone suppression, and the mechanism by which this\nnon-linearity arises.\n- Describe how sound-evoked middle-ear muscle contraction can minimize the upwards\nspread of masking.\n\nb) The MOC reflex is thought to improve discrimination of high-frequency transient signals\nagainst a background of continuous high-frequency noise. This type of masking arises largely\nfrom excitatory masking which is related to the phenomenon of adaptation.\n- Describe the phenomenon of adaptation in the auditory nerve and the mechanisms by\nwhich this non-linearity arises.\n- Describe how the MOC reflex could minimize adaptation and thereby increase the\nresponse to a transient signal tone.\n- Explain why might the impact of MOC feedback is maximal for high-frequency stimuli.\n\nProblem 3:\nUse a simplified circuit diagram of current flow through the cochlear duct to explain why\nactivation of olivocochlear efferents to the OHCs a) increases the magnitude of the cochlear\nmicrophonic (CM) while it b) decreases the compound action potential (CAP) to a moderate-\nlevel click or tone burst and c) decreases the Endolymphatic Potential (EP).\n\nYou need to consider only 4 lumped resistances in your diagram: 1) the transduction channels, 2)\nthe channels activated at the efferent synapses (which are found exclusively at the bases of\nOHCs), 3) all other channels through the basolateral OHCs, and 4) the lumped extracellular\nresistance. Assume: 1. CM and CAP are recorded from a wire on the RW membrane referred to\nthe tongue; 2. CM is generated by transduction current flowing through the OHCs; 3. CAP is the\nsummed activity of auditory-nerve fibers discharging synchronously."
    },
    {
      "category": "Resource",
      "title": "problemset5.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-721-the-peripheral-auditory-system-fall-2005/202e3c3f269e48c4f8b2a7618722c78d_problemset5.pdf",
      "content": "Harvard-MIT Division of Health Sciences and Technology\nHST.721: The Peripheral Auditory System, Fall 2005\nInstructors: Professor M. Charles Liberman and Professor Joe Adams\n\nProblem Set 5: Development / Acoustic Trauma and Repair\n\nDue: 12-05-2005\n\nProblem 1.\nSuppose that a particular drug, when given to mice soon after insemination, dramatically affects\ndevelopment of the neural tube and cochlea of the offspring. Describe a course of\nobservations/experiments that could be performed to determine the cause of the inner ear defects.\nHow would you determine whether the problem was due to defects in induction, specification,\nand/or commitment?\n\nProblem 2.\nWhy might type II fibrocytes and strial marginal cells be more vulnerable to damage than other\ncells in the lateral wall following overexposure to traumatizing noise? If the organ of Corti (OC)\nis destroyed by such noise why might type II fibrocytes apical and basal to the site of OC\ndestruction be damaged far more than those adjacent to the site of OC destruction? If there is\nsevere damage to the organ of Corti and stria vascularis following noise trauma, EP can regain\nits normal value. Explain how this can occur.\n\nProblem 3.\nThe maximum threshold shift seen after acoustic overexposure to a narrow-band stimulus such\nas a pure tone is often seen at frequencies 1/2 octave above the exposure frequency. Use what\nyou have learned about the vibration of the basilar membrane in response to stimuli on and off\nCF to explain this curious observation.\n\nProblem 4.\nOverexposure to loud noise can cause permanent threshold shifts. Pre-exposure to physical\nstresses, such as elevation of body temperature (heat stress), or psychological stresses, such as\nplacing an animal in plastic tube which restricts movement (restraint stress), can \"protect\" the ear\nfrom acoustic injury. \"Protection\" means that pre-stressed individuals show less threshold shift\nfrom a subsequent acoustic trauma than control animals without the pre-exposure stress.\n\na) Describe the functionally important damage to cells and structures that underlies the\nirreversible threshold shifts seen after noise.\n\nb) Discuss the molecular mechanisms underlying noise-induced cell death in the cochlea.\n\nc) The time interval between pre-stress and sound exposure is critical to the degree of\nprotection: a stress-trauma interval of 6-12 hours provides maximal protection in many\ncases. What does the requirement for a time interval of this magnitude suggest about the\nmechanism of protection?\n\nd) Discuss the molecular mechanisms which might underlie induction of a protected state in\nthe cochlea."
    },
    {
      "category": "Resource",
      "title": "problemset6.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-721-the-peripheral-auditory-system-fall-2005/e7940085a266d100f01ba15a2012527c_problemset6.pdf",
      "content": "Harvard-MIT Division of Health Sciences and Technology\nHST.721: The Peripheral Auditory System, Fall 2005\nInstructors: Professor M. Charles Liberman and Professor Joe Adams\nProblem Set 6: Sensorineural Hearing Loss and Review\n\nDue: 12-08-2005\n\nThese problems sets are intended to help you integrate the material learned in HST721.\nYou are required to turn in individually written solutions sets. You are encouraged to\nwork through the problems individually before discussing them in small groups. If you\ndo work through the problems in small groups please include the names of your group\nmembers at the beginning of your write-up.\n\nProblem 1\nIn the course of a large mutagenesis project, a mutant mouse has been identified by the\nprimary hearing screen which appears to be deaf, i.e. it fails to show the normal reflex\nmovement of the pinna in response to a high-level click. The mutant has been\nsuccessfully bred, and a small colony of animals now exists. Your task is to begin the\nprocess of characterizing the genetic defect in this new mouse model You must apply a\nseries of physiological measures to pinpoint the basis for this \"deafness\" phenotype. You\nmay use any experimental techniques which you have read about or studied: i.e. do not\nattempt to design novel tests, however you may apply established techniques to novel\nsituations. You may assume that measurements you have seen applied to any mammalian\nspecies could be applied to the mouse. You may use in vivo approaches on awake or\nanesthetized animals, and you may also apply in vitro techniques to living tissues\nisolated from these mice. However, if several tests are equally conclusive, the less\ncomplex or invasive is better.\n\nFor each test that you suggest, describe the physiological basis for the test, graph the\ntypes of normal and mutant responses you might see, and clearly state what you could\n(and could not) safely conclude from the test results.\na) The first step is to determine whether the lack of pinna reflex is due to an auditory\n\"sensory\" defect or a loss of the motor \"response\" of the pinna. What test(s)\ncould you apply to verify that the phenotype is based on a sensory defect?\nIllustrate and explain your suggestions.\nb) Having concluded that you are indeed dealing with a type of deafness, you now\nneed to diagnose whether the deafness is \"conductive\" (i.e. in the external or\nmiddle-ear conduction of sound energy) or \"sensorineural\" (involving sensory\ntransduction or processing by neural circuits). What measurement(s) could be\nmade to distinguish these two types of deafness. Illustrate and explain your\nsuggestions.\nc) Assume you conclude that the problem is sensorineural in origin. What\nmeasurement(s) would help you decide whether the problem was \"cochlear\"\n(involving any of the multiple cell types lining the cochlear duct) or\n\"retrocochlear\", involving the auditory nerve, cochlear nucleus or higher\nauditory brainstem nuclei. Illustrate and explain your suggestions.\n\nAfter your preliminary analysis, a colleague presents genetic data suggesting that the\nmutation is in a gene which appears to be a novel member of a family of mechano-\nsensitive ion channels and speculates that this represents the cochlear transduction\nchannel. She further speculates that the mutation should lead to a protein structure in\nwhich the ion pore is blocked.\n\nd) How would you expect the structure and ultrastructure of the inner ear to be\naltered by this mutation? Defend your prediction.\ne) What would you expect to measure, in vivo, from this mutant mouse with respect\nto a) sound-evoked otoacoustic emissions (e.g. distortion product OAEs), b)\ncompound action potentials or c) endolymphatic potentials from the cochlea?\nIllustrate and explain your predictions.\nf) What would you expect to measure, in vitro, from outer hair cells in this mutant\nmouse if you performed an electromotility analysis. Describe the nature of your\nelectromotility assay and iIlustrate and explain your predictions.\ng) What type of in vitro tests would you carry out to provide the most compelling test\nof the hypothesized nature of this mutation? Illustrate and explain your\nsuggestions."
    },
    {
      "category": "Lecture Notes",
      "title": "elec_resources.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-721-the-peripheral-auditory-system-fall-2005/bc059ebc86a0a23c8014460f88311627_elec_resources.pdf",
      "content": "Harvard-MIT Division of Health Sciences and Technology\nHST.721: The Peripheral Auditory System, Fall 2005\nInstructors: Professor M. Charles Liberman and Professor Joe Adams\nHST 721\nElectronic Resources\n\nPubMed\nhttp://www.ncbi.nlm.nih.gov/PubMed/\nYou should become familiar with the PubMed information system provided by the National Library of\nMedicine. This is a fundamental tool for anyone studying or working in biomedical science. PubMed allows\nfree searching and downloading of bibliographic data on biomedical publications dating back to 1966 (often\nincluding abstracts of papers). It also provides:\n- systematic categorization of the topics of papers (\"MESH,\" for \"Medical Subject Headings\")\n- sophisticated filtering and selection of publications by author, date, journal, type of publication\n- links to background reading on topics of articles (on-line selections from \"The Molecular\nBiology of the Cell\" by Alberts et al!)\n- links to on-line electronic journals\n- automatically generated links to related papers\n- links to sequences and 3-D structures of related nucleic acids and proteins\n- links to genetic maps and genome databases\nLearn to use the \"Preview/Index\" search mode in PubMed: you will be able to select a manageable number of\nreferences (from the 11 million available) a lot more quickly than with simple searches.\n\nVirtual 3-D Model of the Auditory Periphery:\nhttp://epl.meei.harvard.edu/~hwang/3Dviewer/3Dviewer.html\n\nCreated by EPL personnel, this rotatable, 3-D model with controllable transparency of a variety of structures\nwithin the external, middle and inner ears is a good way to learn the overall structure of the peripheral auditory\nsystem. Downloadable files include applet for viewing of the model on MacOS, Windows or Linux platforms.\n\nVirtual Anatomy Tours\nhttp://www.iurc.montp.inserm.fr/cric/audition/english/start.htm\nhttp://www.vimm.it/cochlea/index.htm\nhttp://library.gallaudet.edu/dr/faq-etiol.html\nhttp://oto.wustl.edu/cochlea/\nhttp://www.neurophys.wisc.edu/aud/\n\nARO: http://www.aro.org\nThe Association for Research in Otolaryngology is the professional organization most closely associated with\nbasic research in hearing. This site links to the electronic versions of the official journal of the Association, the\nJARO, and to abstracts of presentations made at the annual meetings of the Association."
    },
    {
      "category": "Resource",
      "title": "ion_currents.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-721-the-peripheral-auditory-system-fall-2005/9b0f39093f573b454e9ea53978e795ce_ion_currents.pdf",
      "content": "Harvard-MIT Division of Health Sciences and Technology\nHST.721: The Peripheral Auditory System, Fall 2005\nInstructors: Professor M. Charles Liberman and Professor Joe Adams\nHST.721\n\nFall, 2005\n\nIONS, CHANNELS, CURRENTS, AND ELECTRICAL POTENTIALS\n\nIon Currents\nCourses in physics and electrical\nengineering courses usually deal with\nelectrical current as a flow of electrons or\nsometime of \"holes.\" In biology, currents\nare carried by charged atomic or molecular\nspecies, ions.\nWith ions, you can still use a\ngeneralization of Ohm's law as a first-order\napproach to analyzing biological currents:\nFlow = Force * Conductance.\nThe \"Force\" for ion currents, however, is\nnot simply due to electrical potential.\nChemical species, even uncharged, will\nundergo net directional flow if there are\ndifferences in concentration of a species\nwithin a system or across a barrier. This net\ndirectional flow is just due to random\nprocesses. Molecules bounce around; if\nthere are more in one place than in another,\nthen there are more to bounce away from the\none place than from the other.\nThere is thus a net macroscopic flow of\nany chemical species from a region of high\nconcentration to a region of low\nconcentration. Once its concentration is\nequalized throughout the system, there is\nstill dynamic random motion, but there is no\nnet direction to the flow.\nElectrochemical potential\nSimilarly to the electrical potentials used\nto quantify forces acting on current flow, a\n\"chemical potential\" can be used to quantify\nthe forces acting on chemical flows. The\n\"chemical potential\" of substance i in ideal\nsolution is:\nμi = μi\n0 P,T\n(\n)+ RT lnci\nwhere μi\n0(P,T) depends only on pressure P\nand absolute temperature T, R is the gas\nconstant, and ci is the concentration of\nsubstance i. The term μi\n0(P,T) differs\namong chemical substances and quantifies\nthe energetics of chemical reactions. The\nterm RT lnci quantifies the energetics of\nconcentration differences. For this course,\nyou don't have to worry about where this\nlogarithmic relation between concentration\nand chemical potential comes from, but you\nmust recognize its importance.\nIf a chemical species is charged, then its\nflow may be driven by gradients of both\nelectrical and chemical potentials. The\n\"electrochemical potential\" of a charged\nchemical substance i with charge zi per\nmolecule is:\nμi = μi\n0 P,T\n(\n)+ RT lnci + ziFV\nwhere F is the Faraday constant (number of\ncoulombs per mole: 96,500), and V is\nelectrical potential.\nIf substance i doesn't undergo chemical\ntransformation, and it is at the same\ntemperature and pressure on two sides of a\nmembrane, then its term μi\n0 is the same on\nboth sides. The difference in its electro-\nchemical potential across the membrane\n(\"inside\" of membrane, versus \"outside\" as\nreference) is thus:\n(ziFVin + RT lnci\nin) -(ziFVout + RT lnci\nout)\nor\nziF(Vin -Vout ) + RT ln ci\nin /ci\nout\n(\n).\n\nThis difference in electrochemical potential\nis a measure of the driving force for flow of\nsubstance i across the membrane.\nIf we call Vm = Vin -Vout (the \"membrane\npotential\") we can write:\n\nEd Mroz\n\nHST 721\n\nFall, 2005\ndriving force = ziF(Vm ) + RT ln ci\nin /ci\nout\n(\n).\nNo Net Flow--No Net Force\nSay that some system maintains a fixed\nconcentration ratio of ion i across the\nmembrane. There will be no net driving\nforce acting on that ion, and thus no net flow\nof that ion, at one particular electrical\npotential difference for any given\nconcentration ratio. The electrical potential\ndifference that balances off the\nconcentration ratio for the ion (often called\nthe \"equilibrium potential\" or \"Nernst\npotential\" for the ion) is:\nEi = RT\nziF ln ci\nout /ci\nin\n(\n).\nFor \"typical\" values of intracellular and\nextracellular ion concentrations in\nmammalian tissues at body temperature\n(T=310oK) we can calculate:\nTypical Nernst equilibrium potentials\n\nNote that no two of these ions have the same\nNernst equilibrium potential. Thus at most\none of these ions can be in equilibrium at the\nsame time across this cell's membrane.\nAs a rule of thumb, for systems between\nroom temperature and mammalian body\ntemperature, about a 60 mV electrical\npotential difference can counteract a 10-fold\nconcentration ratio for a singly charged ion.\nDriving force and conductance\nNow let's see the quantitative\nimplications of considering both electrical\nand chemical forces. Use the definition of\nthe \"equilibrium potential\" for ion i to write\nthe driving force for flow of the ion in a\nmore compact form:\ndriving force = ziF(Vm -Ei ).\nThe \"conductance\" of the membrane to\nthe ion is simply the ratio of the ion's net\nflow to this driving force. The current for\neach ion i can be written in terms of the\nconductance, gi:\nIi = gi(Vm-Ei).\nThis form is consistent with the conventions\nof cellular electrophysiology, in which an\noutward current (outward movement of a\npositive ion or inward movement of a\nnegative ion) is positive. A (positive)\nconductance gion leads to a positive\n(outward) current if there is a positive\ndriving force (Vm-Eion).\nIon\ncin\n(mM)\ncout\n(mM)\nEion\n(mV)\nK+\n-91\nNa+\n+71\nCl-\n-48\nCa2+\n0.0001\n1.2\n+125\nMg2+\n0.5\n+9\nHCO3\n-\n-6\nA few related issues are potentially\nconfusing. First, this type of conductance is\na \"chord\" conductance, not a \"slope\"\nconductance. That is, this conductance is not\nthe local slope of a relation between current\nand electrical potential.\nSecond, recall that the driving force is\ndefined per mole of the ion. If two systems\nhave the same concentration ratio for i\nacross their membranes but one system has a\nlarger absolute concentration, then that\nsystem may have a larger net flow than the\nother and thus show a higher conductance in\nthese terms. The \"conductance\" is thus not\nsimply a function of the barrier to current\nflow; it will also depend, at least, on the\nconcentration of the ion carrying the current.\nThird, the symbol \"gi\" might leave the\nimpression that conductance is constant.\nThis is simply not the case for most\ninteresting ion conductances in biology. The\nconcentrations of other ions, the presence of\nIon currents and potentials\npage 2\nEd Mroz\n\nHST 721\n\nFall, 2005\nchemicals that interact with the conductance\npathway, even the electrical-potential\ndifference itself, may have great effects on\nthe conductance of a membrane to an ion.\nThese types of influences on conductances\nunderlie much of biological signaling. For\nexample, determining experimentally how\nion conductances change with membrane\npotential, ion concentrations, and time\nformed the basis for Hodgkin and Huxley's\nexplanation of action potentials in nerves.\nBiological ion channels\nThe pioneering work of Hodgkin, Huxley\nand Katz in the late 1940s and early 1950s\nindicated that ion flow across cell\nmembranes was mediated by individual\nmolecular-scale aqueous \"channels\" across\nthe membrane. Different channels were\nthought to have different selectivity among\nions--e.g., some selective for potassium,\nothers for sodium ion. Whether a channel\nwas \"open\" or \"closed\" depended on the\nmembrane potential, with the kinetics of\nresponse to a change in membrane potential\ndiffering among channel types. The\nexperimentally-determined characteristics of\nion flow across squid giant axon membranes\ncould be modeled by cooperative processes,\nin which a number of subunits of a channel\nneeded all to be in particular voltage-\ndependent states for the channel to be open.\nThis conceptual approach provided the\nfirst quantitative description of the\nmechanism of the \"action potential\" that\ntransmits electrical signals along nerve\naxons. Work by Katz and his colleagues\nthen demonstrated that the signal from a\nnerve that makes a skeletal muscle contract\nalso works via a channel. In this case, a\nchannel on the surface membrane of the\nmuscle cell is opened by a chemical signal,\nacetylcholine, which is released by the nerve\nterminals in response to an action potential\nin the nerve. The acetylcholine-sensitive\nchannel on the muscle membrane was found\nto be permeant to many cations, but not to\nanions. Studies of the detailed time-course\nof responses to acetylcholine indicated that\nthis channel had not only \"open\" and\n\"closed\" states, but also a special\n\"desensitized\" state that had to revert slowly\nto the \"closed\" state before the channel\ncould open again.\nThis concept of molecular-scale channels,\nbased on work at the cellular level, has now\nbeen amply verified at the molecular scale.\nRecordings have been made of currents\nthrough individual channels; the gene and\nprotein sequences of many types of ion\nchannels have been determined, including\nchannels directly responding to\nacetylcholine or to other neurotransmitter\nmolecules; physical subunit structures have\nbeen found that correspond to the type of\ncooperatively-acting subunits hypothesized\nby Hodgkin, Huxley and Katz; natural and\ninduced mutations of channel sequences\nhave begun to demonstrate the particular\nportions of the channel proteins that provide\nselectivity among ions, sensitivity to\nchemical ligands, and dependence on\nelectrical potential difference across the\nmembrane in which the channels are\nembedded.\nSome types of channels are affected more\nindirectly by external chemical signals. In\nthese cases, an external chemical signal\nbinds to a non-channel membrane protein\nthat initiates a series of intracellular\nchemical reactions. The \"second\nmessengers\" thus produced by the cell then\naffect the states of ion channels. For\nexample, although acetylcholine binds\ndirectly to proteins that form an ion channel\nin skeletal muscle, it does not bind directly\nto ion channels on \"smooth muscle\" cells of\ninternal organs. In smooth muscle,\nacetylcholine exerts its effects through\n\"second messengers\" instead.\nIon currents and potentials\npage 3\nEd Mroz\n\nHST 721\n\nFall, 2005\nCurrent-voltage curves\nThe most widely used ways for studying\nprocesses involving movement of ions\nacross membranes involve one of the\nvariants of the \"voltage-clamp\" protocol as\ndeveloped by Hodgkin, Huxley and\ncoworkers. Measure the electrical potential\ndifference across the membrane, and apply\n(and record) the current across the\nmembrane needed to reach some desired\nmembrane potential. This can be done for a\nsheet of epithelial tissue, for a single cell, or\nfor a piece of cell membrane. A useful way\nto present this information is to plot the\ncurrent required to achieve any membrane\npotential as a function of that potential. This\nis a \"current-voltage\" or \"I-V\" curve.\n(For many ion-transport processes, such as those\ninvolved in the action-potential mechanism, the time-\ncourse of the current required to obtain a new\nmembrane potential contains important information.\nIn that case you need to choose the current at some\nuniform time or times after the change in membrane\npotential.)\nI-V curves can be obtained for many\ndifferent conditions, designed to obtain\ninformation about particular ion-transport\nprocesses. Pharmacological agents and\naltered ion concentrations can be used to\nobtain information more-or-less specific to\nindividual types of channels.\nA channel conductance is constant if and\nonly if its I-V curve is a straight line. The\nslope of the line then equals the\nconductance.\nThe I-V curve for a channel specific for\none ion passes through the voltage axis at\nthe ion's Nernst equilibrium potential: no\nnet force, no net flow. Manipulating ion\nconcentrations and determining how the\nzero-current potential changes can thus help\nto determine which ion or ions permeate a\nparticular channel type.\nIf more than one ion can permeate a\nchannel, the zero-current point for the\nchannel's I-V curve is the potential where\nthe currents of the two ions balance to zero.\nThis potential will be a weighted average of\nthe Nernst potentials for the permeant ions.\nThe weights are related to the conductances\nof the channel for each of the ions. If one\nion predominates in terms of conductance,\nthen the zero-current point will be close to\nthat ion's Nernst potential.\nIon currents and potentials\npage 4\nEd Mroz\n\nHST 721\n\nFall, 2005\nSensory transduction\nFormally, transduction is changing one\nform of energy into another. For vertebrate\nsensory systems, transduction of\nenvironmental signals eventually leads to\ncoding in terms of action potentials in\n\"afferent\" nerves that bring the information\nto the brain.\nEven at the very first steps in vertebrate\nsensory transduction, ion channels are\ninvolved. In primary receptor cells for vision\nand smell, stimuli from the environment\nlead to changes in production of \"second\nmessengers\" that then affect ion channels in\nthe receptor cells' membranes. In the\nprimary sensory cells of the auditory and\nvestibular systems, the hair cells, ion\nchannels are directly gated by mechanical\nstimuli.\nResting cell membrane potential\nSo what determines the electrical\npotential difference across a cell membrane?\nThe \"Resting Potential\" of a cell is simply\nthe membrane-potential difference at which\nthere is no net current and no net solute\nflow. Since different ions are found to have\ndifferent \"Nernst equilibrium potentials\"\nacross cell membranes, this zero net ion\nflow does not mean zero net force acting on\nthe ions.\nEquilibrium vs. Steady state\nThe \"steady state\" that occurs in a living\norganism is substantially different from\nequilibrium. In a steady state, compositions\nand volumes of body fluid compartments are\nconstant because of zero net flow for each of\nthe internal components of the system. Zero\nnet flow is obtained by a balance of\nindividual transport processes and chemical\nreactions, each of which has a non-zero\ndriving force and proceeds at an appreciable\nrate. Unlike equilibrium with zero net force\nto drive transport or reactions, a steady-state\nbalance of flows requires an \"open system\"\nthat can exchange matter or energy with the\nenvironment, because energy must be\ncontinually expended to keep the system in a\nsteady state away from equilibrium.\nIon pumps\nAt the cellular level, this continuing\nenergy expenditure involves a set of ion\npumps and transporters that are coupled\ndirectly or indirectly to the consumption of\nATP. These energy-consuming processes\nbalance the passive leaks of ions down their\nelectrochemical potential gradients.\nFirst approximation--weighted\naverage of Nernst potentials\nIn principle, to figure out a cell's resting\npotential, all we have to do is figure out\nwhat value of membrane potential leads to\nzero net current. In one hypothetical\nsituation, that's easy. Say that the ion pumps\nwork perfectly well at keeping intracellular\nconcentrations constant, while extracellular\nconcentrations are maintained constant by\nthe investigator (in an experiment) or by the\nhomeostatic mechanisms of the body (in\nvivo). Then each ion has a well-defined\nNernst equilibrium potential. Also assume\nthat the ion conductances are independent of\nmembrane potential, and that the rates of the\nion pumps are not affected by membrane\npotential. Then the resting potential of the\ncell is simply the conductance-weighted\naverage of the Nernst potentials of the\npermeant ions. Thus if the conductance to\none ion is quantitatively dominant, the\nmembrane potential will be close to that\nion's equilibrium potential.\nThis approximation often works pretty\nwell in practice, although there are some\npotential complications. We've already\nnoted that conductances can depend on\nmembrane potential. In addition, not all\ncurrent-producing cell processes are\nchannels. Some transporters in cell\nmembranes that couple the motion of two or\nmore ions can lead to net current flow.\nIon currents and potentials\npage 5\nEd Mroz\n\nHST 721\n\nFall, 2005\nFurthermore, not all processes that transport\nions across the plasma membrane result in a\ncurrent. Neither the Na+-H+ exchanger\ninvolved in acid-base balance nor the\nNa+-K+-2Cl- cotransporter important in renal\nand inner-ear function carries net current.\nYet both can affect ion concentrations in\ncells, and thus the Nernst equilibrium\npotentials for those ions and the whole-cell\nzero-net-current resting potential. Despite\nthese complications, a conductance-\nweighted average of Nernst potentials is a\ngood place to start for an estimate of a cell's\nmembrane potential.\nWhat comes in must go out\nAlthough ion channels may best be\nstudied when the experimenter controls ion\nconcentrations and potentials, that is not\nhow they work in vivo. Channels in the\nplasma membrane are in a structure that\nsurrounds the contents of the cell. If\nsituations change in one membrane location,\nleading say to a local inward current, there\nmust also be an outward current elsewhere\nthrough the cell membrane to continue the\ncircuit. (The capacitance of cell membranes\nis important during transients, but steady-\nstate current return will be via conductive\npaths.) For cells that are polarized, like hair\ncells, this means that we have to consider\nnot only the specialized current entry\nchannels but also the (potentially quite\ndifferent) current exit channels.\nFurthermore, in this type of situation, there\nwill be extracellular currents to complete the\nelectrical circuit. Many electrical\nmeasurements made in biological systems\nare effectively of these extracellular currents\nrather than of electrical potential differences\nacross individual cell membranes.\nExtracellular potentials\nIt's simplest conceptually to start thinking\nabout electrical potential differences across\na cell membrane. Nevertheless, bioelectric\npotentials were studied long before it\nbecame technically possible to measure\npotential differences across cell membranes.\nMeasurements of the electrocardiogram and\nearly measurements of \"receptor potentials,\"\nthe electrical events associated with sense\norgans, were not accomplished by sticking\nan electrode into a cell. These rather were\nrecordings taken by electrodes sitting on the\nsurface of the body or perhaps within a\ntissue but not within a cell.\nEven today, many of the most common\nelectrical measurements associated with\nstudies of auditory function are\nextracellular, not intracellular. The\ncompound action potential, the cochlear\nmicrophonic, the auditory brainstem\nresponse, even the endocochlear potential\nare all extracellular recordings. How do\nthese extracellular potentials correspond to\nevents going on across cell membranes?\nThe best way to think about extracellular\npotentials is to apply Ohm's Law. A\npotential is the product of a current times a\nresistance. An extracellular electrode\nrecords a potential difference from some\ndistant ground electrode located elsewhere\non the body or in a tissue bath. That\nextracellular potential difference is\ndetermined by the resistance to current flow\nbetween the recording electrode and ground,\nand the current flowing past the recording\nelectrode to ground.\nSo for a fixed recording location, the\npotential recorded from an extracellular\nelectrode is primarily determined by\nextracellular current flow. If enough cells\nsynchronously produce currents there may\nbe enough net extracellular current to\nproduce an appreciable extracellular\npotential.\nHow many cells is enough? One cell can\nbe enough: about 70 years ago, Alan\nHodgkin forced the extracellular currents\ngenerated by a nerve axon to flow through a\nhigh enough extracellular resistance to make\nIon currents and potentials\npage 6\nEd Mroz\n\nHST 721\n\nFall, 2005\nreliable measurements and perform some\nelegant experiments on the conduction of\naction potentials even before intracellular\nrecordings were possible. Millions of cells\nare involved in the electrocardiogram, which\nrepresents the synchronized activity of\nmuscle fibers in the heart. The classic\nreceptor potential of the auditory system, the\n\"cochlear microphonic,\" arises from\nsynchronous currents passing through some\nhundreds or thousands of hair cells when\nthey are stimulated by sound.\nReferences\nFor a somewhat different perspective on\nthese topics, consult \"The Molecular\nBiology of the Cell\" by Alberts et al.\n(Garland, New York; 4th Edition, 2002),\nchapters 10 and 11. Chapter 10 deals with\nthe structure of cell membranes and proteins\nin cell membranes. Chapter 11 deals with\nion transport, ion channels, action potentials,\nand synaptic function.\nIntroductory neuroscience texts also\ncover this material. \"Principles of Neural\nScience\" by Kandel, Schwartz and Jessell\n(McGraw-Hill, New York; 4th Edition,\n2000) is generally well written, though\nvoluminous. A particularly useful book\nspecifically on ion channels is \"Ionic\nChannels of Excitable Membranes\" by B.\nHille (Sinauer, Sunderland MA; 3rd Edition,\n2001).\nFor further reading of research reviews or\nof classic experimental studies, consult the\nreferences at the end of Chapter 11 of\nAlberts et al., or talk with one of the faculty.\n\nIon currents and potentials\npage 7\nEd Mroz"
    },
    {
      "category": "Resource",
      "title": "study_qs_ds_1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-721-the-peripheral-auditory-system-fall-2005/5acd31e665e704d984d78858b93586af_study_qs_ds_1.pdf",
      "content": "Harvard-MIT Division of Health Sciences and Technology\nHST.721: The Peripheral Auditory System, Fall 2005\nInstructors: Professor M. Charles Liberman and Professor Joe Adams\nStudy Questions: Discussion 1 - Anatomy\n\nDue: Monday Sept 19 by 5:00 p.m.\nReview: Forge, A. and T. Wright (2002). \"The molecular architecture of the inner ear.\" Br Med Bull 63: 5-\n24.\n\n1a. Kikuchi, T., Kimura, R. S., Paul, D. L. and Adams, J. C. (1995).\"Gap junctions in the rat cochlea:\nimmunhistochemical and ultrastructural analysis,\" Anat Embryol 191, 101-118.\na) What is a connexin; what is the relationship between connexins and gap junctions; give examples of\nsome important intracellular molecules that either can or can't pass through a gap junction; and describe\nby what ultrastructural or immunohistochemical criteria the authors identified the locations of gap\njunctions in the cochlear.\nb) The authors propose that these gap junction systems are important in K+ recycling. Briefly describe the\nK+ cycle to which they are referring and the role of gap junctions in that cycle.\n\n1b1. Liberman, M. C. (1980).\"Morphological differences among radial afferent fibers in the cat cochlea: An\nelectron-microscopic study of serial sections,\" Hear Res 3, 45-63.\na) What was the main aim of the experiments described in this report: i.e. why was the author inspired to\ncarry out this tedious and time-consuming serial-section study?\nb) What are the major new findings concerning the afferent innervation of the inner hair cell reported here?\nc) What are the predicted correlations between response properties and ultrastructure, and on what are they\nbased?\n\n1b2. Liberman, M. C. (1982).\"Single-neuron labeling in the cat auditory nerve,\" Science 216, 1239-1241.\na) This paper represents a direct test of the hypotheses set forth in paper 1b1. Which aspects of the\nhypotheses were confirmed, which were refuted and which could not be addressed?\nb) Describe the technique of intracellular labeling. How could the author be sure that fibers seen in the\nultimate histological material really did correspond to the units from which he recorded?"
    },
    {
      "category": "Resource",
      "title": "study_qs_ds_2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-721-the-peripheral-auditory-system-fall-2005/a4849923671ebb6c2589f0e7293faba2_study_qs_ds_2.pdf",
      "content": "Harvard-MIT Division of Health Sciences and Technology\nHST.721: The Peripheral Auditory System, Fall 2005\nInstructors: Professor M. Charles Liberman and Professor Joe Adams\nStudy Questions: Discussion 2 - Hair Cells & Transduction\n\nReview: Roberts, W. M., J. Howard, et al. (1988). \"Hair cells: transduction, tuning, and transmission in\nthe inner ear.\" Annu Rev Cell Biol 4: 63-92.\n\n2a. Corey, D. P. and Hudspeth, A. J. (1983).\"Kinetics of the receptor current in bullfrog saccular hair\ncells,\" J Neurosci 3, 962-976.\na) Describe the overall experimental approach: how were the hair bundles stimulated and how was the\nreceptor current measured? What were some of the experimenters' concerns with respect to possible\nartifacts in their methodology?\nb) You need not understand the details of the biophysics to appreciate the overall strategy the\nexperimenters used to try and gain insight into the molecular mechanisms of transduction. Describe the\ntransduction model suggested by the authors and one key observation which argues for it.\n\n2b. Pickles, J.O. , Comis, S.D. and Osborne, M.P. (1984) Cross-links between stereocilia in the guinea pig\norgan of Corti, and their possible relation to sensory transduction. Hear Res 15: 103-112.\na) What are the differences between scanning electron microscopy and transmission electron microscopy?\nWhy did the authors use both approaches? Were the results consistent?\nb) How many different kinds of links between stereocilia did the authors describe, and which ones did they\nsuggest were involved in transduction? Had these links been described before?\nc) Which functional properties of mechanoelectric transduction are well explained by the model presented\nhere?\n\n2c. Denk W, Holt JR, Shepherd GM, and Corey DP. Calcium imaging of single stereocilia in hair cells:\nlocalization of transduction channels at both ends of tip links. Neuron 15: 1311-1321, 1995.\na) Briefly explain how calcium imaging is done, and what it can and can't tell you about calcium\nconcentration in various cellular compartments.\nb) What evidence is presented here to suggest that transduction occurs at the tips of the stereocilia? How\ndid the authors explain inconsistencies with previous published results by Ohmori?\nc) What was the nature of the evidence that transduction channels are present at both ends of the tip links?"
    },
    {
      "category": "Resource",
      "title": "study_qs_ds_3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-721-the-peripheral-auditory-system-fall-2005/0bdc32c8463077f7b8262fa25528afe8_study_qs_ds_3.pdf",
      "content": "Harvard-MIT Division of Health Sciences and Technology\nHST.721: The Peripheral Auditory System, Fall 2005\nInstructors: Professor M. Charles Liberman and Professor Joe Adams\nStudy Questions: Discussion 3 - Stria & EP\n\nReview: Wangemann, P. (2002).\"K+ cycling and its regulation in the cochlea and vestibular labyrintl,\"\nAudiology Neurootology 7:199-205.\n\n3a. Salt, A. N., Melichar, I. and Thalmann, R. (1987).\"Mechanisms of endocochlear potential generation\nby stria vascularis,\" Laryngoscope 97, 984-991.\n\n3b. Takeuchi, S., Ando, M. and Kakigi, A. (2000).\"Mechanism generating endocochlear potential: role\nplayed by intermediate cells in stria vascularis,\" Biophys J 79, 2572-2582."
    },
    {
      "category": "Resource",
      "title": "disc_papers_04.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-721-the-peripheral-auditory-system-fall-2005/4fca9605e6f9be9a36c0f3d02adfc41c_disc_papers_04.pdf",
      "content": "Harvard-MIT Division of Health Sciences and Technology\nHST.721: The Peripheral Auditory System, Fall 2005\nInstructors: Professor M. Charles Liberman and Professor Joe Adams\nHST.721 2004 Edition\n\nDISCUSSION TOPICS AND PAPERS: (Papers still subject to change)\n\n1. Anatomy\nReview: Forge, A. and T. Wright (2002). \"The molecular architecture of the inner ear.\" Br Med Bull 63: 5-24..\n1a. Kikuchi, T., Kimura, R. S., Paul, D. L. and Adams, J. C. (1995).\"Gap junctions in the rat cochlea:\nimmunhistochemical and ultrastructural analysis,\" Anat Embryol 191, 101-118.\n1b1. Liberman, M. C. (1980).\"Morphological differences among radial afferent fibers in the cat cochlea: An\nelectron-microscopic study of serial sections,\" Hear Res 3, 45-63.\n1b2. Liberman, M. C. (1982).\"Single-neuron labeling in the cat auditory nerve,\" Science 216, 1239-1241.\n\n2. Hair Cells & Transduction\nReview: Roberts, W. M., J. Howard, et al. (1988). \"Hair cells: transduction, tuning, and transmission in the\ninner ear.\" Annu Rev Cell Biol 4: 63-92.\n2a. Corey, D. P. and Hudspeth, A. J. (1983).\"Kinetics of the receptor current in bullfrog saccular hair cells,\" J\nNeurosci 3, 962-976.\n2b1. Pickles, J.O. , Comis, S.D. and Osborne, M.P. (1984) Cross-links between stereocilia in the guinea pig\norgan of Corti, and their possible relation to sensory transduction. Hear Res 15: 103-112.\n2b2. Denk W, Holt JR, Shepherd GM, and Corey DP. Calcium imaging of single stereocilia in hair cells:\nlocalization of transduction channels at both ends of tip links. Neuron 15: 1311-1321, 1995.\n\n3. Stria / Endocochlear Potential\nReview: Wangemann, P. (2002).\"K+ cycling and its regulation in the cochlea and vestibular labyrintl,\"\nAudiology Neurootology 7:199-205.\n3a. Salt, A. N., Melichar, I. and Thalmann, R. (1987).\"Mechanisms of endocochlear potential generation by\nstria vascularis,\" Laryngoscope 97, 984-991.\n3b. Takeuchi, S., Ando, M. and Kakigi, A. (2000).\"Mechanism generating endocochlear potential: role played\nby intermediate cells in stria vascularis,\" Biophys J 79, 2572-2582.\n\n4. OHCs and Electromotility\nReview: Santos-Sacchi, J. (2003) New tunes from Corti's organ: the outer hair cell boogie rules. Curr. Opin.\nNeurobio. 13:459-468.\n4a. Holley, M. C. and Ashmore, J. F. (1988).\"On the mechanism of a high-frequency force generator in outer\nhair cells isolated from the guinea pig cochlea,\" Proc R Soc Lond B Biol Sci 232, 413-429.\n4b. Hallworth, R., Evans, B. N. and Dallos, P. (1993).\"The location and mechanism of electromotility in guinea\npig outer hair cells,\" J. Neurophysiol. 70, 549-558.\n4c. Zheng, J., Shen, W., He, D. Z., Long, K. B., Madison, L. D. and Dallos, P. (2000).\"Prestin is the motor\nprotein of cochlear outer hair cells,\" Nature 405, 149-155.\n\n5. Frequency Tuning and Cochlear Mechanics\nReview: Dallos, P. (1992). The active cochlea. J. Neurosci. 12:4575-4585.\n5a. Wilson, J. P. and Johnstone, J. R. (1975).\"Basilar membrane and middle-ear vibration in guinea pig\nmeasured by capacitive probe,\" J Acoust Soc Am 57, 705-723.\n5b. Ruggero, M.A. and Rich, N.C. (1991) \"Furosemide alters organ of Corti mechanics: Evidence for feedback\nof outer hair cells upon the basilar membrane\". J. Neurosci. 11:1057-1067.\n\n5c. Neely, S.T. (1993) A model of cochlear mechanics with outer hair cell motility. J Acoust Soc Amer 94(1)\n137-146.\n\n6. Afferent Transmission\nReview: Fuchs, P.A., Glowatski, E. and Moser, T. (2003) The afferent synapse of cochlear hair cells. Curr.\nOpin. Neurobio. 13:452-458.\n6a. Roberts, W. M., Jacobs, R. A. and Hudspeth, A. J. (1990).\"Colocalization of ion channels involved in\nfrequency selectivity and synaptic transmission at presynaptic active zones of hair cells,\" J.\nNeuroscience 10, 3664-3684.\n6b. Moser, T. and Beutner, D. (2000).\"Kinetics of exocytosis and endocytosis at the cochlear inner hair cell\nafferent synapse of the mouse,\" Proc. Nat. Acad. Sci. 97, 883-888.\n6c. Glowatzki, E. and Fuchs, P. A. (2002).\"Transmitter release at the hair cell ribbon synapse,\" Nat Neurosci 5,\n147-154.\n\n7. Auditory Nerve Response\nReview: Kiang NYS (1984) Peripheral processing of auditory information. Handbook of Physiology - The\nNervous System.\n7a. Liberman, M. C. (1978).\"Auditory-nerve response from cats raised in a low-noise chamber,\" J Acoust Soc\nAm 63, 442-455.\n7b. Sachs, M. B. and Young, E. D. (1979).\"Encoding of steady-state vowels in the auditory nerve:\nrepresentation in terms of discharge rate,\" J. Acoust. Soc. Am. 66, 470-479.\n7c. Young ED and Sachs MB (1979) Representation of steady state vowels in the temporal aspects of the\ndischarge patterns of populations of auditory nerve fibers. J. Acoust. Soc. Amer. 66:1381-1403.\n\n8. Efferent Control\nReview: Guinan, JJ (1996) Physiology of Cochlear Efferents. In \"The Cochlea\", eds. P Dallos, AN Popper and\nRR Fay. New York, Springer, pp 435-500.\n8a. Elgoyhen, A.B., Johnson, D.S., Boulter, J., Vetter, D.E. and Heinemann, S. (1994) \"9: An acetylcholine\nreceptor with novel pharmacological properties expressed in rat cochlear hair cells.\" Cell: 79-705-715.\n8b. Russell, I. J. and Murugasu, E. (1997).\"Medial efferent inhibition suppresses basilar membrane responses to\nnear characteristic frequency tones of moderate to high intensities,\" J Acoust Soc Am 102, 1734-1738.\n8c. Maison, S. F. and Liberman, M. C. (2000).\"Predicting vulnerability to acoustic injury with a non-invasive\nassay of olivocochlear reflex strength,\" J. Neuroscience 20, 4701-4707.\n\n9. Inner Ear Development\nReview: Bryant, J., R. J. Goodyear, et al. (2002). \"Sensory organ development in the inner ear: molecular and\ncellular mechanisms.\" Br Med Bull 63: 39-57.\n9a. Groves, A. K. and Bronner-Fraser, M. (2000).\"Competence, specification and commitment in otic placode\ninduction,\" Development 127, 3489-3499.\n9b. Eddison, M., Le Roux, I. and Lewis, J. (2000).\"Notch signaling in the development of the inner ear: lessons\nfrom Drosophila,\" Proc Natl Acad Sci U S A 97, 11692-11699.\n\n10. Trauma and Repair\nReview Trauma: Huang, T., A. G. Cheng, et al. (2000). \"Oxidative stress-induced apoptosis of cochlear\nsensory cells: otoprotective strategies.\" Int J Dev Neurosci 18(2-3): 259-70.\nReview Repair: Bermingham-McDonogh, O. and E. W. Rubel (2003). \"Hair cell regeneration: winging our\nway towards a sound future.\" Curr Opin Neurobiol 13(1): 119-26.\n10a. Wang, Y., Hirose, K. and Liberman, M. C. (2002).\"Dynamics of noise-induced cellular injury and repair in\nthe mouse cochlea,\" J Assoc Res Otolaryngol 3, 248-268.\n10b. Pirvola, U., Xing-Qun, L., Virkkala, J., Saarma, M., Murakata, C., Camoratto, A. M., Walton, K. M. and\nYlikoski, J. (2000).\"Rescue of hearing, auditory hair cells, and neurons by CEP-1347/KT7515, an\ninhibitor of c-Jun N-terminal kinase activation,\" J Neurosci 20, 43-50.\n10c. Warchol, M. E. and Corwin, J. T. (1996).\"Regenerative proliferation in organ cultures of the avian cochlea:\nidentification of the initial progenitors and determination of the latency of the proliferative response,\" J\nNeurosci 16, 5466-5477.\n\n11. Sensorineural Hearing Loss\nReview: Liberman M.C. (2005) \"Auditory Processing in Sensorineural Hearing Loss\" In: Basic Science Review\nfor Otolaryngology, Theime Medical Publishers; Eds. T.R. Van De Water, H. Staecker.\n11a. Heinz, M.G. and Young, E.D. (2004). \"Response Growth With Sound Level in Auditory-Nerve Fibers\nAfter Noise-Induced Hearing Loss\". J, Neurophysiology 91:784-795.\n11b. Liberman, M.C. and Dodds, L.W. (1984) Single-neuron labeling and chronic cochlear pathology, III:\nStereocilia damage and alterations of threshold tuning curves. Hearing Research 16:55-74.\n11c. Moore, B.C, D.A. Vickers, C.J. Plack and A.J. Oxenham (1999) Inter-relationship between different\npsychoacoustic measures assumed to be related to the cochlear active mechanism. J. Acoust. Soc. Amer.\n106(5): 2761-2778."
    },
    {
      "category": "Resource",
      "title": "study_qs_ds_4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-721-the-peripheral-auditory-system-fall-2005/0d988b21ba6f76714255a9f99bb63386_study_qs_ds_4.pdf",
      "content": "Harvard-MIT Division of Health Sciences and Technology\nHST.721: The Peripheral Auditory System, Fall 2005\nInstructors: Professor M. Charles Liberman and Professor Joe Adams\nStudy Questions: Discussion 4 - OHCs & Electromotility\n\nReview: Santos-Sacchi, J. (2003) New tunes from Corti's organ: the outer hair cell boogie rules. Curr.\nOpin. Neurobio. 13:459-468.\n\n4a. Holley, M. C. and Ashmore, J. F. (1988).\"On the mechanism of a high-frequency force generator in\nouter hair cells isolated from the guinea pig cochlea,\" Proc R Soc Lond B Biol Sci 232, 413-429.\n1. What data do the authors present that suggests that membrane-bound processes give rise to motility?\n2. If OHC electromotility is robust (i.e. insensitive to many manipulations that interfere with cellular\nmetabolism), yet the compressive nonlinearity associated with cochlear \"amplification\" is labile (i.e.\nextremely vulnerable to processes that compromise cellular metabolism), doesn't that argue against the\nidea that electromotility is the process powering the cochlear amplifier? If so, why so; if not, why not?\nWhat might the labile processes be?\n\n4b. Hallworth, R., Evans, B. N. and Dallos, P. (1993).\"The location and mechanism of electromotility in\nguinea pig outer hair cells,\" J. Neurophysiol. 70, 549-558.\n1. AC length changes (e.g., Fig. 3) tend to be largest for 'q' values near 1/2. AC width changes (e.g., Fig. 8)\ntend to decrease monotonically with increasing 'q'. What does this result suggest about the directionality\nof the motility motor? Reword this question.\n2. The authors talk about both 'active' and 'passive' forms of motility. Other papers present evidence that\nmotility is not affected by any of the common metabolic inhibitors. Discuss the sense in which the words\n'active' and 'passive' apply to OHC motility.\n\n4c. Zheng, J., Shen, W., He, D. Z., Long, K. B., Madison, L. D. and Dallos, P. (2000).\"Prestin is the motor\nprotein of cochlear outer hair cells,\" Nature 405, 149-155.\n1. Describe the logical and molecular strategies the authors used to find the OHC motor protein\n2. Describe the experiments performed to determine if the novel gene product is indeed the motor protein\nand indicate which is the most compelling."
    },
    {
      "category": "Resource",
      "title": "study_qs_ds_5.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-721-the-peripheral-auditory-system-fall-2005/3e858e614ff1a891b5a2708d493dc060_study_qs_ds_5.pdf",
      "content": "Harvard-MIT Division of Health Sciences and Technology\nHST.721: The Peripheral Auditory System, Fall 2005\nInstructors: Professor M. Charles Liberman and Professor Joe Adams\nStudy Questions: Discussion 5 - Frequency Tuning and Cochlear Mechanics\n\nReview: Dallos, P. (1992). The active cochlea. J. Neurosci. 12:4575-4585.\n\n5a. Wilson, J. P. and Johnstone, J. R. (1975).\"Basilar membrane and middle-ear vibration in guinea pig\nmeasured by capacitive probe,\" J Acoust Soc Am 57, 705-723.\n1. This study presents evidence that the tuning of the mammalian basilar membrane is quite different from\nthe tuning of auditory nerve fibers. What is that evidence?\n2. A key piece in the interpretation of this study is the assay used to determine whether the cochlear was in\na healthy condition at the time of the mechanical measurements. To determine the health of the cochlea\nWilson & Johnstone used a click evoked CAP measurement, where the click was produced by a 50 μs\nwide electric pulse. What is the Fourier transform of such a pulse; specifically, is there much energy at\n20 kHz? Was the sound source used in these experiments 'flat' past 20 kHz?\n3. This paper concludes in the firm belief that a striking discrepancy in the sharpness of tuning between\nbasilar membrane and neural tuning has been unequivocally established. The results of the Ruggero\npaper and others suggest that they were completely wrong. How do you resolve the discrepancy? What\nwas the error that Wilson and Johnstone made?\n\n5b. Ruggero, M.A. and Rich, N.C. (1991) \"Furosemide alters organ of Corti mechanics: Evidence for\nfeedback of outer hair cells upon the basilar membrane\". J. Neurosci. 11:1057-1067.\n1. What are effects of furosemide on the compound action potential, the endolymphatic potential, the\ncochlear microphonic, and basilar membrane vibration?\n2. Why does this constellation of effects argue in favor of the idea that outer hair cells provide feedback\nenhancement of cochlear vibrations? How compelling is the argument?\n\n5c. Neely, S.T. (1993) A model of cochlear mechanics with outer hair cell motility. J Acoust Soc Amer\n94(1) 137-146.\n1. Describe the physical mechanisms hypothesized to produce the sharp frequency selectivity in this\nmodel. List the parameters that effect each step. Over what frequency range(s) can the mechanisms be\nexpected to operate? Explain your reasoning.\n2. Neely characterizes the action of the outer hair cells as contributing to both a 'cochlear amplifier' and to\na 'second filter.' Explain the role of each (i.e., amplifier and filter) in shaping the tuning produced in the\nmodel."
    },
    {
      "category": "Resource",
      "title": "study_qs_ds_6.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-721-the-peripheral-auditory-system-fall-2005/81c9a12fb4bdd5762a76c03c72c1a893_study_qs_ds_6.pdf",
      "content": "Harvard-MIT Division of Health Sciences and Technology\nHST.721: The Peripheral Auditory System, Fall 2005\nInstructors: Professor M. Charles Liberman and Professor Joe Adams\nStudy Questions: Discussion 6 - Afferent Transmission\n\nReview: Fuchs, P.A., Glowatski, E. and Moser, T. (2003) The afferent synapse of cochlear hair cells. Curr.\nOpin. Neurobio. 13:452-458.\n\n6a. Griesinger Richards and Ashmore \"Fast vesicle replenishment allows indefatigable signaling at the\nfirst auditory synapse\". Nature 2005, 435:212-215\n\n1. What evidence is presented to indicate that the decrease in fluorescence of basally located spots was due\nto fusion of fluorescent synaptic vesicles with the plasma membrane?\n\n2. Why should the reader believe that the recovery of fluorescence at release sites after the stimulation\nceased is not due to endocytosis by the adjacent membrane?\n\n3. What do the authors suggest as the mechanism by which ribbon synapses make possible their high rate\nof release of vesicles?\n\n6b. Moser, T. and Beutner, D. (2000).\"Kinetics of exocytosis and endocytosis at the cochlear inner hair\ncell afferent synapse of the mouse,\" Proc. Nat. Acad. Sci. 97, 883-888.\n\n1. How did the authors identify and characterize functionally different pools of vesicles?\n2. How did the authors show that their capacitance measures were calcium dependent? Why was\nthat essential for their arguments?\n3. The authors indicated a number of possible mechanisms that might contribute to adaptation of\nIHCs. What evidence did they use to argue for vesicle depletion's role in this process? How did\nthey rule out other mechanisms that might have contributed to their inferred measures of vesicle\ndepletion?\n4. The authors estimated the maximum secretory rate for vesicles to be 28,000/sec but a maximal\nrecovery rate of 1200/sec. If both numbers are correct how can the difference be reconciled?\n6c. Glowatzki, E. and Fuchs, P. A. (2002).\"Transmitter release at the hair cell ribbon synapse,\" Nat\nNeurosci 5, 147-154.\n\n1. Why might the authors have used cochleas from such young rats, in some cases before the age of onset\nof hearing? How might the age of the animals affect the interpretation of the results in terms of normal\n\"adult\" hearing?\n2. Several of the experiments involved using different concentrations of extracellular potassium. What is\nsupposed to be the mechanism of action of elevated extracellular potassium, in terms of effects on the\nEPSC measurements reported in this paper?\n3. How do you interpret the data shown in figures 3a and 3b?\n4. What are the differences among \"AMPA,\" \"kainate,\" and \"NMDA\" receptors? What implications might\nthese different types of receptors have if they were involved in neurotransmission at this synapse?\n5. Consider the results with cyclothiazide (Fig. 3d and text). Might \"desensitization\" of the\nneurotransmitter receptor be important in neural coding of auditory stimuli?\n\n6. What data support the authors' claim of generally \"multivesicular\" release of transmitter at this ribbon\nsynapse? If only one or a few vesicles had been released at a time, how might the data have turned out?\n7. How do the numbers of EPSCs per second in these recording relate to what you've heard about\nspontaneous firing rates in auditory nerve fibers?\n8. At what temperature were the recordings made? What is the \"normal\" temperature of a rat ribbon\nsynapse in vivo? What might be the implications for interpreting these data?"
    },
    {
      "category": "Resource",
      "title": "study_qs_ds_7.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-721-the-peripheral-auditory-system-fall-2005/f80fb4d00490b3b9f755622ccae444f0_study_qs_ds_7.pdf",
      "content": "Harvard-MIT Division of Health Sciences and Technology\nHST.721: The Peripheral Auditory System, Fall 2005\nInstructors: Professor M. Charles Liberman and Professor Joe Adams\nStudy Questions: Discussion 7 - Auditory Nerve Response\n\nReview: Kiang NYS (1984) Peripheral processing of auditory information. Handbook of Physiology -\nThe Nervous System.\n7a. Liberman, M. C. (1978).\"Auditory-nerve response from cats raised in a low-noise chamber,\" J Acoust\nSoc Am 63, 442-455.\n1. At the time this paper was written, it was thought that central axons type-II spiral ganglion neurons were\nmyelinated, and therefore that both type-I and type-II fiber types should be included in any exhaustive\nsampling of auditory nerve response. Thus, this study started as a search for the elusive type-II response\ntype. According to present day understanding, what do high-, medium- and low-spontaneous rate fibers\ncorrespond to?\n2. The important point of this paper is that there are large sensitivity differences among auditory nerve\nfibers with similar CFs. Are the insensitive fibers normal or might they reflect some sort of common\npathology? What are the arguments the author presents on this issue.\n3. Given that the ear is so sensitive to sound, how do we know that the \"spontaneous activity\" we record is\nnot actually a response to sounds not under experimental control, e.g. internal to the living animal?\n7b. Sachs, M. B. and Young, E. D. (1979).\"Encoding of steady-state vowels in the auditory nerve:\nrepresentation in terms of discharge rate,\" J. Acoust. Soc. Am. 66, 470-479.\n1. What is meant by a rate-place code? What is the alternative mechanism by which information about\nvowel spectrum could be carried to the central nervous system?\n2. The authors were interested in the role of two-tone suppression in shaping the auditory nerve response to\nsteady state vowels. What do they conclude about its effect?\n3. Why do the rate-place profiles flatten as stimulus sound pressure increases?\n4. What do the authors conclude as to whether rate-based information in auditory nerve fibers can code\nvowel spectrum over the full dynamic range? What are the differences in contributions of high- vs. low-\nSR fibers?\n7c. Young ED and Sachs MB (1979) \"Representation of steady state vowels in the temporal aspects of\nthe discharge patterns of populations of auditory nerve fibers\". J. Acoust. Soc. Amer. 66:1381-1403.\n1. What is the ALSR and how is it measured?\n2. What is meant by synchrony suppression and how does it shape the responses of auditory nerve fibers to\nvowels?\n3. What do the authors conclude about as to whether information about vowel spectrum is coded in the\ntemporal patterns of auditory nerve discharge? Does the answer differ as stimulus sound pressure\nincreases?\n4. A thought question (the authors don't address this): Auditory nerve fibers project to the cochlear\nnucleus, where the process of signal analysis begins. How would you build a central neural circuit to\nextract spectral information, e.g. the pitch of pure tone, from the spike trains coming down the auditory\nnerve?"
    }
  ]
}