{
  "course_name": "The Analytics Edge",
  "course_description": "This course presents real-world examples in which quantitative methods provide a significant competitive edge that has led to a first order impact on some of today’s most important companies. We outline the competitive landscape and present the key quantitative methods that created the edge (data-mining, dynamic optimization, simulation), and discuss their impact.",
  "topics": [
    "Business",
    "Management",
    "Operations Management",
    "Mathematics",
    "Probability and Statistics",
    "Business",
    "Management",
    "Operations Management",
    "Mathematics",
    "Probability and Statistics"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nRecitations: 1 sessions / week, 1 hour / session\n\nPrerequisites\n\n15.060 Data, Models, and Decisions\nor a basic statistics and a basic optimization course.\n\nCourse Description\n\nIn the last decade, the amount of data available to organizations has reached unprecedented levels. Companies and individuals who can use this data together with analytics give themselves an edge over the competition. In this class, we examine real world examples of how analytics have been used to transform a business or industry. These examples include Moneyball, the Framingham Heart Study, Google, Twitter, IBM Watson, and Netflix among many others. Through these examples and many more, we cover the following analytics methods: linear regression, logistic regression, trees, deep learning, missing data imputation, text analytics, clustering, and optimization. In addition, we present new methods and applications from the research of the instructor: an optimization framework for regression problems, algorithms for missing data, optimal trees for prediction and prescription, algorithms from prediction to prescription, personalized medicine, and patterns of heart attacks among other topics. Students will use the R programming language, a free open statistical computational environment, and LibreOffice (or compatible), an open office suite.\n\nCourse Overview\n\nThis OCW course site includes content from Dimitris Bertsimas' residential 15.071 course, as well as the 15.071x MOOC offered on MITx authored by Dimitris Bertsimas and Allison O'Hair.\n\nThe course is organized by units. Weekly coursework includes:\n\nInteractive lecture sequences\n\nRecitation\n\nHomework\n\nInteractive Lecture Sequences\n\nThe lectures are presented in interactive sequences of videos and quick questions. Each sequence includes a succession of short video clips and online questions, arranged in a logical progression. Please take the time to watch each video and complete each question in the sequence they are provided. Answer-check mechanisms provided in these questions are designed to quickly test your understanding of the lecture material. When we work in R or LibreOffice during the lecture videos, we encourage you to follow along.\n\nRecitations\n\nRecitations will cover additional examples of the analytics methods presented in the lectures, and recitations will be used to show how to create models in R or LibreOffice in more depth. Recitation attendance is highly recommended.\n\nAssignments\n\nThere will be nine individual homework assignments and a final project that should be done in teams of two. See the\nAssignments section\nfor more details about the assignments and the final project.\n\nReadings\n\nThe readings include chapters from the required book for the class:\n\nDimitris Bertsimas, Allison O'Hair and Bill Pulleyblank,\nThe Analytics Edge\n, Dynamic Ideas, 2016. ISBN: 978-0989910897.\n\nGrading\n\nGrades will be based on the following weighting:\n\nActivities\n\nPercentages\n\nHomework Assignments\n\n45%\n\nFinal Course Project\n\n45%\n\nClass Participation\n\n10%",
  "files": []
}