{
  "course_name": "The City in Film",
  "course_description": "Using film as a lens to explore and interpret various aspects of the urban experience in both the U.S. and abroad, this course presents a survey of important developments in urbanism from 1900 to the present day, including changes in technology, bureaucracy, and industrialization; immigration and national identity; race, class, gender, and economic inequality; politics, conformity, and urban anomie; and planning, development, private property, displacement, sprawl, environmental degradation, and suburbanization.",
  "topics": [
    "Fine Arts",
    "Visual Arts",
    "Film and Video",
    "Social Science",
    "Urban Studies",
    "Urban Planning",
    "Fine Arts",
    "Visual Arts",
    "Film and Video",
    "Social Science",
    "Urban Studies",
    "Urban Planning"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 1.5 hours / session\n\nUndergraduate Recitations: 1 session / week, 1.5 hours / session\n\nFilm Screenings: 1 session / week, 3 hours / session\n\nCourse Overview\n\nOver the past 150 years, the world has moved from one characterized by rural settlement patterns and provincial lifestyles to one dominated by urbanization, industrialization, immigration, and globalization. Interestingly, the history of this transformation overlaps nearly perfectly with the development of motion pictures, which have served as silent--and then talking--witnesses to our changing lifestyles, changing cities, and changing attitudes about the increasingly urban world we live in. Through the movies--both documentaries and feature films--we are able to see, hear, and share the lived experiences of urban dwellers around the world and across more than twelve decades.\n\nUsing film as a lens to explore and interpret various aspects of the urban experience in both the U.S. and abroad, this course presents a survey of important developments in urbanism from 1900 to the present day, including changes in technology, bureaucracy, and industrialization; immigration and national identity; race, class, gender, and economic inequality; politics, conformity, and urban anomie; planning, development, private property, displacement, sprawl, environmental degradation, and suburbanization; and more.\n\nThe films shown in the course vary from year to year, but always include a balance of \"classics\" from the history of film, an occasional experimental / avant-garde film, and a number of more recent, mainstream movies. (See below for this year's schedule.)\n\nPrerequisites\n\nNone.\n\nFilm Schedule\n\nWEEK #\n\nFILMS\n\nMetropolis\n, Fritz Lang (1926)\n\nBerlin: Symphony of a Great City\n, Walther Ruttman (1927)\n\nThe Crowd\n, King Vidor (1928)\n\nModern Times\n, Charles Chaplin (1936)\n\nLadri di Biciclette (Bicycle Thieves)\n, Vittorio De Sica (1948)\n\nThe Naked City\n, Jules Dassin (1948)\n\nWest Side Story\n, Robert Wise and Jerome Robbins (1961)\n\nPlay Time\n, Jacques Tati (1967)\n\nMidnight Cowboy\n, John Schlesinger (1969)\n\nBlade Runner\n, Ridley Scott (1982)\n\nDo the Right Thing\n, Spike Lee (1989)\n\nLondon\n, Patrick Keiller (1994)\n\nNight on Earth\n, Jim Jarmusch (1991)\n\nCourse Requirements\n\nUndergraduate\n\nACTIVITIES\n\nPERCENTAGES\n\nWeekly film notes (2% each, 12 total)\n\n24%\n\nClass participation\n\n20%\n\nThree short papers (12% each)\n\n36%\n\nFinal film essay\n\n20%\n\nGraduate\n\nACTIVITIES\n\nPERCENTAGES\n\nWeekly film notes (3% each, 12 total)\n\n36%\n\nClass participation\n\n24%\n\nFinal film essay\n\n40%",
  "files": []
}