{
  "course_name": "The Anthropology of Sound",
  "course_description": "This class examines the ways humans experience the realm of sound and how perceptions and technologies of sound emerge from cultural, economic, and historical worlds. In addition to learning about how environmental, linguistic, and musical sounds are construed cross-culturally, students learn about the rise of telephony, architectural acoustics, and sound recording, as well as about the globalized travel of these technologies. Questions of ownership, property, authorship, and copyright in the age of digital file sharing are also addressed. A major concern will be with how the sound/noise boundary has been imagined, created, and modeled across diverse sociocultural and scientific contexts. Auditory examples — sound art, environmental recordings, music — will be provided and invited throughout the term.",
  "topics": [
    "Fine Arts",
    "Media Studies",
    "Music",
    "Music Theory",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology",
    "Fine Arts",
    "Media Studies",
    "Music",
    "Music Theory",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 3 hours / session\n\nCourse Description\n\nThis class examines the ways humans experience the realm of sound and how perceptions and technologies of sound emerge from cultural, economic, and historical worlds. In addition to learning about how environmental, linguistic, and musical sounds are construed cross-culturally, students learn about the rise of telephony, architectural acoustics, and sound recording, as well as about the globalized travel of these technologies. Questions of ownership, property, authorship, and copyright in the age of digital file sharing are also addressed. A major concern will be with how the sound/noise boundary has been imagined, created, and modeled across diverse sociocultural and scientific contexts. Auditory examples -- sound art, environmental recordings, music -- will be provided and invited throughout the term.\n\nRequired Books\n\nAttali, Jacques.\nNoise: The Political Economy of Music\n. Translated by Brian Massumi. Minneapolis, MN: University of Minnesota Press, 1985. ISBN: 9780816612871.\n\nBull, Michael, and Les Back, eds.\nThe Auditory Culture Reader\n. Oxford, UK: Berg Publishers, 2004. ISBN: 9781859736180.\n\nRequirements\n\nStudents will write three 7-page papers, on the subjects of sound word, sound technology, and sonic communities. The sonic communities papers will also be presented in class on the last day. No emailed papers will be accepted. Papers are docked by a letter grade for each day they are late. Students will also be evaluated on class participation, including discussion and in-class writing exercises. Punctual attendance is obligatory. There will not be a final exam.\n\nGrading Policy\n\nACTIVITIES\n\nPERCENTAGES\n\nPaper 1\n\n25%\n\nPaper 2\n\n25%\n\nPaper 3\n\n25%\n\nClass participation: discussion and in-class writing\n\n25%\n\nCalendar\n\nLEC #\n\nTOPICS\n\nGUESTS\n\nKEY DATES\n\nCourse introduction\n\nThinking about sound\n\nAcoustemologies\n\nSoundscapes\n\nSoundwalk at MIT\n\nVoices\n\nSound word paper due\n\nTelephones and radio\n\nSoundscapes, revisited through sound sculpture\n\nBeth Coleman\n, Comparative Media Studies, MIT\n\nPhonograph and gramophone records, compact discs, MP3s\n\nKieran Downes, History, Anthropology, and Science, Technology, and Society, MIT\n\nSound, culture, property\n\nIan Condry\n, Foreign Languages and Literatures, MIT\n\nA political economy of sound and noise\n\nAndres Lombana\n, Comparative Media Studies, MIT\n\nThe sound of music\n\nPeter Whincop, Music, Harvard University / Music and Theatre Arts, MIT\n\nSound technology paper due\n\nSonic publics\n\nStyles of silence\n\nThe sounds of science\n\nDale Joachim, Media Lab, MIT\n\nClass presentations of sonic communities paper\n\nSonic communities paper due",
  "files": [
    {
      "category": "Resource",
      "title": "Siren",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-360j-the-anthropology-of-sound-spring-2008/7b1036ee9a34a08af22bf95a853c0d40_shera_siren.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n21A.360J / STS.065J / CMS.710J The Anthropology of Sound\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nKatherine Shera\n21A.360J Helmreich\nMarch 5, 2008\nIn the twelfth book of the Odyssey, Circe the sorceress warns Odysseus of the perils that await him on the\nlong journey home. The first of these obstacles is an encounter with the beguiling Sirens, dangerous\nseductresses who lure sailors to their death with their enchanting song:\nSquare in your ship's path are Seirenes, crying\nbeauty to bewitch men...\nSteer wide;\nkeep well to seaward; plug your oarsmen's ears\nwith beeswax kneaded soft; none of the rest\nshould hear that song.\nBut if you wish to listen...\nOdysseus, overcome by curiosity, prepares to meet the challenge of the Sirens:\nI carved\na massive cake of beeswax into bits\nand rolled them in my hands until they softened.\n(48-61, 208-210)\nHomer's engaging narrative has, over the centuries, been unusually stimulative of the poetic imagination.\nThe story also inspired the French engineer and physicist Baron Charles Cagniard de la Tour, when in 1819\nhe selected a name--the Syren--for the acoustic instrument of his invention, a vox mechanica that\ngenerated and measured the frequencies of musical tones. Cagniard de la Tour's syren was the forerunner of\nthe modern electronic siren, which today is installed on countless thousands of emergency vehicles around\nthe world.\nIn this essay, I explore the anthropological phenomenon of the siren, from its eighteenth century\ngenesis as a scientific instrument to its contemporary manifestation as a ubiquitous form of public warning\nand address. The siren plays a vocal role in cultural patterns so deeply embedded that they almost seem\nsecond nature--excellent motivation, from an anthropological standpoint, for taking of the measure of the\nphenomenon. The anthropologist Clifford Geertz says, \"Man is an animal suspended in webs of\nsignificance he himself has spun. I take culture to be those webs\" (Geertz 5). How is the sound of the siren\npart of this web? R. Murray Schafer and Steven Feld, in their examinations of auditory culture The\nSoundscape and A Rainforest Acoustemology, have helped us to understand the way that sound, at least as\nmuch as other forms of human engagement, is deeply expressive and reflective of culture. What exactly is\nit that makes a siren \"a sound that matters\"? (Schafer 12). How does the sound of siren affect human\nbehavior? How can we understand the rich symbolism the sound has accumulated for us?\n\nI begin by tracing the history and meaning of the sound of the siren (the siren of myth >> the siren of\ninstrumentation >> the siren as public address), and by analyzing the institutional infrastructures that the\nconstruct of the siren presupposes. These include a highly rational social organization that values particular\nnotions of law, order, and the public wellbeing; the existence of political and economic infrastructures of\nemergency response; and most importantly, a responsive, hearing public. These are the keynotes of a\nmodern society. Within this context, the sound of the siren is the sound of power; in responding to its\nvoicings, citizens demonstrate their obedience to its authority. If sounds are syntax through which\nindividuals express their relations to the community, then the siren is the sound of civil obedience. And so\nvery naturally, the sounds of the siren have emerged as elements of artistic production and musical\ncomposition, where they are often reconstituted as voices of civil dis-obedience.\nIn analyzing the historical and contemporary American soundscape and the siren's role within it, we gain\ninsight into the ways that modern societies are constructed with sound. The ultimate goal is to construct an\nacoustemology of contemporary society through the sound of the siren, a pervasive technology of public\naddress. Deep listening to the siren reveals the multiple layers of meaning embedded in its voice.\nThe siren in history\nThe syren of classical mythology was \"one of several fabulous monsters, part woman, part bird\" who were\nsupposed to lure sailors to destruction with their enchanted voices (OED). In 1819, the French physicist\nBaron Charles Cagniard de la Tour, after improving upon Scottish physicist John Robison's earlier design,\ndescribed his new Syren, an enchanting acoustic instrument which was capable of generating and\nmeasuring musical tones of varying frequencies (Kenyon, wiki siren). The Syren consisted of a rotating\ndisc, pierced with holes, which interrupted a stream of pressurized air, causing fluctuations in its flow. Such\nwaves of pressure, of periodically compressed and rarefied air, are in fact the physical basis of sound; the\nrate at which the air pressure fluctuated (i.e. the rotation rate of the disc) defining the pitch (frequency) of\nthe tone produced (Kenyon, wiki siren). In 1820, the Annual Register, a British historical chronicle\npublished annually since 1758, announced \"The Syren, a new Acoustical Instrument... In consequence of\nthis property of being sonorous in the water the instrument has been called the Syren\" (OED). The Baron's\nsyren was soon followed by more complex forms, including German physicist Hermann Helmholtz's\ningenious double sirene of 1860, which he used to illustrate interference and beat phenomena (Kenyon).\nBy 1879, an analogous instrument, built on a similar principle but of a larger size, was being used on\nsteam ships for issuing signals and fog warnings. The ship's siren was driven by steam or compressed air,\nwhich was forced through a fixed flat disc fitted to the throat of a long trumpet (OED). As electricity\nbecame available early in the twentieth century, the first electromechanical fire sirens were produced. (Fire\nvolunteers had previously been summoned by the ringing of a bell) (wiki siren). Two early manufacturers\nof fire sirens were Federal Signal and Sterling Siren; both began production of fire sirens between 1900 and\n1905.\nSirens were employed as motor horns until about 1915, when their use was limited to police and fire\nvehicles (NYT Rules). It was in 1933 that New York City automobile and taxicab drivers were first\nrequired to \"draw up to the curb and come to a halt\" at the sound of police siren--a regulation made\nbecause police cars \"had incurred a number of accidents as a result of obstruction by traffic when speeding\nto answer a call\". Three months previously, police cars had been equipped with \"extra-loud sirens\", which,\nunfortunately, had failed to reduce the number of accidents. (NYT Autos Must Halt).\nA siren-based system for warning British civilians of an aircraft-based enemy attack was developed in\nLondon in 1938, and air raid sirens first sounded warnings in London in September 1939. Air raid sirens\nbecame an almost daily part of life--keynote sounds--in London during the height of the Blitz (BBC). In\n1940 the Irish dramatist Sean O'Casey wrote \"We have a kind of a cellar that we are to go to when the\nsiren sounds\" (OED). Air raid warning systems were developed and tested in the United States during the\n1940's and 50's (NYT multiple), but were never put into actual use. After the end of the Cold War,\nAmerican air raid siren systems increasingly fell into disuse or were converted to tornado warnings (wiki),\nand the air raid siren became a chronotopic sound, one that maps time in space. In the public imagination,\n\nits wail is intimately linked with WWII London. Today, electronic sirens employ oscillators and\nmodulators to synthesize siren-like tones which are amplified and broadcast through external speakers; they\nare ubiquitous on modern emergency vehicles.\nThe siren in the soundscape\nLike the sounds of water and birds in the rainforest (Feld 225), the sounds of police, fire, and emergency\nsirens permeate the body of the modern city. Because sirens are signal sounds, they must rise above the\nkeynotes of the metropolitan soundscape: outdoors, the internal combustion engine (Schafer 82); indoors,\nthe sounds of HVAC and the 60 Hz hum. The sound of the siren, therefore, must distinguish itself both in\ncharacter--in being the antithesis of a \"flat line sound\" (Schafer 79)--and in intensity, in simply being\nlouder than most everything else. Modern-day sirens have a characteristic wailing oscillation that centers\naround 440 Hz, and exert sound pressures on the order of 110 to 120 dBA, intensities on the scale of\nthunder and lightning, \"the most feared forces in nature\" (Schafer 25). The sound of the air raid siren,\nwhich can reach pressures of a literally ear-splitting 138 dBA, lies far outside the scale of human\nsoundmaking. It is a truly mighty noise that \"bridges the gulf between men and the gods\" (Schafer 25).\nIf the sounds of emergency sirens map the metropolitan soundscape--emplacing origins and\nterminations, localizing comings and goings and centers of human activity--they also feature prominently\nin rural and regional soundscapes as well, where they alert listeners to fires, emergencies, and natural\ndisasters such as hurricanes, tornados, and tsunamis. Lastly, the sounds of sirens are conspicuous features\nof geopolitical soundscapes; the sounds of air raid and civil defense sirens penetrating, reflecting, and\nunifying the bodies of entire nations and geographic regions. The sounds of air raid sirens, like the sounds\nof war and religion, are truly eschatological in scale (Schafer 50, see [1]).\nIn every soundscape in which it voices--metropolitan, regional, and geopolitical--the sound of the siren\nis centripetal (Schafer 54, 56). Like a clock or bell, a siren regulates and unifies a community. But sirens,\nunlike clocks and bells, cannot simply be heard. Sirens carry the harmonics of deference, and must be\nlocalized, attended to, listened to. Sirens, because they powerfully alter our behavior, become human\nagents, sonic architects of the modern social order.\nAn audiocultural inheritance\nMost of us probably cannot remember when, as very young children, we began to learn about sirens--or\nhave even considered the idea of that we needed to learn about sirens. Sirens, and the right way to behave\nwith to them, were simply something we...always knew. Anthropology teaches us that such apparently\ncommonsense responses are often fruitful subjects for cultural critique. A social phenomenon that cannot\nbe explained is a social phenomenon of great power. We first learn about sirens very early in life; ample\nevidence can be found in the picture books enjoyed by the young (Fig. 1). Compelling arrays of emergency\nvehicles and responses, in fact, figure quite prominently in much popular children's literature (Fig. 2). If\nanthropology's task is to \"make the strange familiar, the familiar strange\" the rich symbolism of the siren\nseems fair game. What is it that makes the siren \"a sound that matters\"?\nThe siren as experience\nHow does the siren figure in the sonic ecology of the modern city? The siren is a loud sound, a\ntechnological sound (Schafer 73), an imperialistic sound (Schafer 77), a plaintive sound. Its sound rises\nbravely, inexorably above the aural congestion (Schafer 71) of the lo-fi post-Industrial Revolutionary city\nsoundscape, making itself heard night and day. Unlike other urban noises such as bells, honks, yells, and\n[1]. I propose a broad aural category, \"eSchaferotological sound\", to denote any auditory phenomenon that might be linked, however\ncausally or casually, to the perceived post-Industrial Revolutionary decline of all human civilization. Also see anostalgia, paradise\nlost.\n\nwhistles, the sound of the siren cannot simply be ignored. The ear must actively grab the sound of the siren\nfrom its sonic environment (Schwartz 487). This auditory extraction--the first step in the appropriate social\nresponse to the sound--is no simple perceptual task, and the auditor, especially if he is in motion himself,\noften experiences significant anxiety and confusion as he endeavors, in all earnestness, to locate the source\nof the sound. His confusion may persist for many harrowing seconds--especially if more than one siren is\nsounding--and can only be completely relieved when the sight of the siren and vehicle provides clear\n(visual) evidence of its location and vector. Audiospatial confusion resolved, the requirement for further\naction now becomes clear. Those unfortunate citizens who stand in the path of the oncoming siren must,\nimmediately, yield full right-of-way, freezing like rabbits in full sight of a hungry predator. The tension\nmounts as the siren approaches; the auditor winces and bows his head. Then the emergency vehicle passes,\nuneventfully, and the sociospatial rift it created is quickly annealed. The auditory participants, returned to\ntheir routine, may feel comforted by their own safety and good fortune, and indulge in the guilty pleasures\nof schadenfreude. The siren has thus enacted a sonic transformation-catharsis of its hearing public; an\nauditory experience which as shared ritual intimacy serves to strengthen the social fabric of the community.\nThe siren is thus endowed with a social ability, almost unparalleled in contemporary secular life, of\naltering in the space of a moment the behavior of an entire community. Paul Stoller, in Sound in Songhay\nPossession, shows us how sounds relay power. Like the cries of the godji, the siren is a force that literally\nmoves people. Although individual citizens may or may not attend to the personal tragedy attached the\nsound of a siren, they must attend to the demand for increased awareness and deference. The voice of the\nsiren is thus much larger than the sound itself. The siren is a code all modern participants understand\n(Schafer 47); the symbolic meaning of the siren lies in its ability to alter our behavior on a cultural scale.\nAuditory cartographies\nThe sounds of the siren, in the way that they absorb and reflect from the surfaces of the modern metropolis,\nshare many characteristics with the sounds of the tropical rainforest described by Steven Feld in his poetic\ncartography of the Kaluli tribe of Papua New Guinea. In the tropical rainforest, \"acoustic revelatory\npresence is always in tension with visual hidden presence\"; or to put it more simply, things in the rainforest\nare often heard, but not seen. In the rainforest, height and depth are easily confused, and upward feels like\noutward, making sounds difficult to locate. The modern city, like the rainforest, abbreviates the facility for\nseeing and hearing (Schafer 43), and auditory presence seems to dominate the visual: things in the city are\noften heard, but not seen. City sounds echo and reflect off the geometric planes of tall buildings, making\noutward feel like upward; the fluid and ambiguous relations between the city's spatial and temporal\ndimensions make individual sounds in the city (especially moving sounds) extremely difficult to locate.\nFor the Kaluli, \"the sensory tension between the seen and heard, the hidden and reveled, is poeticized in\nthe synesthetic metaphor lift-up-over-sounding. The auditory environment of the modern city might, in\nturn, be poeticized by the popular term surround-sound, a name the audiophile attaches to the technological\nattempt to reproduce the effect. The surround-sound of the city, e.g. the experience of multiple sirens\nsounding, is like lift-up-over sound: \"in synchrony but out of phase\", \"not in unison but simultaneous\" and\n\"cacophonous\". The surround-sound of the modern metropolis, like the lift-up-over-sound of the tropical\nrainforest, is dense, multilayered, overlapping.\nA call to community\nAs discussed above, sirens are centripetal sounds, unifying and regulating the community. In fact the siren,\nas the voicing of a community, plays an essential role in the very creation of the community, in the very\nformation of a public identity. The reciprocal relationship between voicing and identity (Feld 226)--in\nwhich voicing authorizes identity, and an identity, in turn, authorizes voice--implies that a public voicing\n(like a siren) can help to create a public identity (like a state), and that the two entities mutually reinforce\neach other. The community hears itself in the voicing of the siren; the act of attending to the siren voices\nthe community's collective identity.\n\nA siren is thus a thing that cultivates the very notion of a public (and of a public soundscape: see [2]\nbelow). A siren is a \"we-thing\", and as a \"we-thing\", it is deeply implicated in the relationships between\nmembers of a community. For in defining the very notion of \"we\", we run into the problem of \"them\". If\nwe are the public, what (or who) then, is the public enemy? Fires, injuries, natural disasters, to be sure, but\nwhat about liminal and distal portions of the body public itself? Young people, dark people, people who act\ndifferent? At the same time the sound of the siren works to define a community, paradoxically, it also\nfragments it. An inside makes an outside, a public makes a private. So a community is heterogeneous in its\nattitude to the siren--some sense comfort, others threat--and, to a lesser extent, heterogeneous in its\nresponse to the siren: some comply, others resist. Different subcultures experience the sound of a siren\ndifferently. A public address system addresses not one, but many publics.\nThe siren song of modernity\nThe siren and the state\nIn his 1977 work The Soundscape, Murray Schafer elucidates the intimate relationship between sound\nand the state: \"The general acoustic environment of a society\", he says, \"can be read as an indicator of\nsocial conditions which produce it, and may tell us much about the trending and evolution of that society\"\n(Schafer 7). As part of a complex cultural response to states of emergency, the construct of the emergency\nsiren presupposes a multiplicity of institutional infrastructures: sophisticated systems for the detecting and\nresponding to injuries, fires, crimes, and civic emergencies; telecommunications infrastructures; medical\ncare and criminal justice systems; and a wide array of complex technologies to populate these systems. Not\nto mention an economic infrastructure to support the emergency regime.\nA siren is thus a hallmark of a highly rational, organized, and regulated society: a society that holds\nparticular, expansive notions of law and orderliness; a society which shares a certain conception of an\nemergency, and a belief in a certain proscribed way of dealing with the threat. These characteristics are\nhallmarks of a modern society, in the 19th-20th century sociological sense of the world (Helmreich\nlecture). Modernity's obsessions lie with rationality and order, because rationality and order will help us to\nunderstand--and to control--the world. In the context of emergency response, modernity asks: What level of\nthreat actually constitutes an emergency? In the face of emergency, what is the appropriate response of the\ncitizen? Of the community, of the state? In the background of an increasingly diverse and mobile society,\nhow can an acceptable uniformity of emergency response be achieved? Modern society attempts to define\nresponses to these questions, and to create structures and institutions that enable its response. But these\nresponses are contingent, just one of many possible configurations.\nA standard emergency response\nMurray Schafer sees the honoring of traffic codes as the hallmark of \"societies that have experienced the\nIndustrial Revolution and mechanized warfare\" (Schafer 83). Although this is a sweeping statement, the\nearly decades of the twentieth century did in fact see the increasing standardization of traffic codes and\nemergency response, especially in metropolitan areas. In 1915, the use of sirens was restricted to fire and\npolice vehicles in New York City, part of a larger effort towards standardizing traffic codes (NYT Rules).\nBy 1937, Great Britain had developed a system that enabled citizens to dial a single three-digit telephone\nnumber when reporting emergencies. The United States Congress considered the idea in 1958, and passed\n[2]. In a very real sense, Cagniard de la Tour's siren laid the sonosymbolic groundwork for Job's iPod. Without a widespread notion of\na \"public soundscape\", the \"revolutionary\" reversal of the soundscape promised by the iPod -- with its notion of \"private sounds\" and\n\"private soundscapes\" -- would never have been possible. The iPod works to privatize the public soundscape; the siren works to\npublify the private soundscape. So the two technologies are symbolic opposites, with opposing goals.\n\na legal mandate in 1967 (911 History). The development of the Emergency Broadcast System in 1963\nrepresented another step towards the realization of an abstract vision of a safe society; EBS television test\nmessages were broadcast at least weekly during that period, and became part of the American cultural\nfabric of the era:\nThis is a test of the Emergency Broadcast System. The broadcasters of your area, in voluntary cooperation with\nthe Federal, State and local authorities, have developed this system to keep you informed in the event of an\nemergency. If this had been an actual emergency, the Attention Signal you just heard would have been followed\nby official information, news or instructions. This station (optional -- insert station call sign) serves the\n(operational area name) area. This concludes this test of the Emergency Broadcast System.\nEfforts at strengthening and standardizing the system of emergency response were driven by a modern\ndemocratic impulse: safety and security for all. The standardization of emergency response implied that an\nincreasingly mobile American public would enjoy the same level of civic safety and comfort anywhere in\nthe nation, and more importantly, would be aware of the appropriate response in the event of an emergency.\nLike the sounds of late nineteenth-century symphony halls, the emergency soundscape of one American\ntown became more and more like the emergency soundscape of any other (Thompson). In standardizing the\nsoundscape of civic safety, control was key--the experience of the siren, like the symphony, was not meant\nto be fun (Thompson 49).\nThe siren and the citizen\nFrom an acoustic ecology we can learn how man behaves with sounds and how sounds affect and change\nhis behavior (Schafer 4). How has man behaved with the siren, and how has it affected and changed his\nbehavior? Over the course of the twentieth century, American citizens learned first to trust in, and then to\nrely on, the sociocultural ideals symbolized by the sound of the siren: an abstract notion of an always-ready\ninfrastructure of succor and support, and benevolent protection against medical emergencies, crime, natural\ndisasters, and acts of war. As an infrastructure of emergency response developed, so did a willing (and\nhearing) public. Both elements were necessary components of the meaning of the sound of the siren.\nSafe and secure?\nThe siren signaled not just modern society's ambition for order and rationality but a deep social desire: that\nfor physical and emotional security. Although the sound of the siren threatens momentarily, it comforts\nexistentially, because it signifies that the system is working. The desire for community safety and security\nwas perhaps no more conspicuous in the United States than in the decades surrounding WWII. This\ndistention of desire for public safety was paralleled by a fascinating increase in the sheer physical size and\ndecibel level of sirens manufactured during that era.\nThe phenomenon of the air raid siren began in Europe in 1938, with the development of the London air\nraid warning system; the sounds of air raid warning systems became very familiar to those living in large\ncities. The sirens were placed atop tall buildings, or poles if no suitable buildings could be found, and\nproduced two signals: the first a warning--a rising and falling note created by varying the power of the\nsiren--and the 'all clear'--a single, continuous note (BBC).\nIn the United States, air raid sirens of increasing size and intensity were developed and tested during the\n1940's and early 1950's. 1952, during the Cold War era, saw the pinnacle of the siren's auditory might: the\n180HP V8-Hemi engine-powered Chrysler Air Raid Siren, which registered 138 dB at 100 feet\n(Victorysiren.com). Known as the \"Big Red\", the new Chrysler siren--the loudest ever produced--was six\nfeet tall, twelve feet long, and weighed 5500 pounds (see Figure). Air raid sirens had become true sky\nnoises, sound that could not be localized or contained (Schafer 86). Of architecture, Joseph Henry has said:\n\"It is only when a building expresses the dominant sentiment of the age, when a perfect adaptation to its\nuse is joined to harmony of proportions and an outward expression of its character, that it is entitled to our\nadmiration\" (Thompson 28). Sirens, too, can express the dominant sentiment of their age, and the growth in\nsize and decibel level of sirens in production after WWII speaks volumes about the psyche of Cold War\nAmerican society. Listening back in time, we can hear the level of concern for American safety with\nperfect clarity.\n\nThe Federal Civil Defense Act of 1950, which provided the Federal Civil Defense Administration with\nthe statutory authority for civil defense planning, sheltering, and evacuation, was as much a cultural\nmeasure as a public safety measure. The intent was to stoke the fires of democracy and patriotism. In her\nwork The Soundscape of Modernity, historian Emily Thompson describes how romantic notions of the\nennobling nature of music became attached to the sound of the orchestral symphony in late nineteenth\ncentury America (Thompson 46). In the same way, romantic notions about the ennobling nature of\ndemocracy--and the blasphemy of communism--became attached to the sound of the air raid siren in the\ndecades following WWII. In taking the measure of an ideal symphony hall, that the desire to control sound\nproduction was a manifestation of the modernist desire to control the audience (Thompson 46). Similarly,\nthe desire to create air raid networks was paired with the desire for an orderly civilian populace, and the\ncivilian populace's own desire for orderliness.\nThe nineteenth century, according to Thompson, saw the development of a musical culture that was\n\"almost religious in its intensity, in which listening became a way to worship\" (Thompson 47). Campaigns\nwere undertaken to educate Americans to appreciate \"great\" music, and to approach it with humility and\nrespect (Thompson 48). Likewise, the years after WWII saw the development of a patriotic culture almost\nreligious in its intensity, in which doing one's civic duty became a way to worship; campaigns were\nlaunched to educate Americans about patriotism and their new civic duties, which were to be approached\nwith humility and respect. Finally, if the new home for the Boston Symphony Orchestra \"embodied a\nromantic, even religious dedication to symphonic music that characterized elite culture in turn-of-the\ncentury America\" (Thompson 14), the gargantuan Chrysler Air Raid Siren embodied a romantic, even\nreligious devotion to civil defense that characterized post-WWII America.\nThe many parallels between two such unlikely phenomena as the development of architectural acoustics\nand the establishment of air raid siren networks simply illustrate the degree to which both phenomena were\noutgrowths of the modern project. If acoustics became important because listening had become important,\nso did air raid sirens become important because protecting us had became so important. By listening\ncarefully to the sound and meaning of the emergency siren, we can begin to comprehend the complex\nconjunction of politics and public sentiment that constituted a phenomenon and a moment in America's\ncultural history (Thompson 18).\nCivil obedience\nSchafer points out that the German word horen, 'to hear\" is the root of gehoren, \"to belong to\", and\ngehorchen, \"to obey\". We hear sound, we belong to sound, we obey sound (Schafer Open Ears 30). The\nsound of the siren, as a sound that makes itself heard over other sounds, is endowed with an extra-ordinary\namount of power. Bruce Smith, in Tuning into London c. 1600, speaks of finding a syntax for sounds, of\ndiscovering how people order sounds, and the ways they use them to position themselves in the world\n(Smith 131). The sound of the siren is an imperative; in responding to the imperative, citizens demonstrate\ntheir willing hearing, belonging, and subordination to its issuer--the civic authorities. The sound of the\nsiren is a syntax through which citizens place themselves relative to the authority of the state. In sounding\nthe siren, the state asserts itself over its domain. In responding to the authority of the siren, citizens\nrecognize it as a sound of civil obedience.\nThe politics of sirens\nIf the sound of the siren is the sound of power, its syntax of civil obedience, exactly who is entitled to\nmake a siren sound? The early decades of the twentieth century saw the increasing regulation of individuals\nand institutions legally entitled to utilize the siren to impel others to stop, listen, and obey. The ship's mate\nand the motor car driver yielded to the policeman and the fireman, who in their turn yielded to the agents of\nCivil Defense. In December 1941, the use of sirens in New York City was limited to fire trucks in order \"to\nreduce the confusion if an air raid signal should be given\". Police cars and ambulances were directed to use\ngongs to clear traffic (NYT police sirens curbed). By 1950, the sirens on fire trucks had been banned as\nwell, in order \"to avoid confusion with air raid alarms.\" The ban on fire and police sirens was finally lifted\nin 1953, after complaints that police and fire vehicles were frequently delayed in responding to calls\n\n\"because of an 'apathetic spirit' by civilian and vehicular traffic to the less imperative warning bells and\nwhistles.\" (NYT Fire and Police to Return).\nNoisy relations\nWhere might the sound of the siren fall on the continuum between sound and noise? That would depend on\nwhich particular acoustic ecologist or soundscape scholar you happened to ask. For R. Murray Schafer,\nnoise is sound \"we have learned to ignore\" (Schafer 4). If our ability to ignore the sound of a siren is a\nfunction of our position relative to it, our conception of the siren as sound or noise must be mobile as well.\nEnroute to a picnic in the park, the siren on the oncoming fire truck would demand all our attention; its\nvoicing, at that moment, would constitute sound, not noise. Once we arrived at the park, however, we could\nsafely ignore the sound of a siren; its sound would, at some ill-defined moment, become reconstituted as\nnoise. In Schafer's more extended Apollonian-Dionysian philosophical system, the siren might be cast as a\nsort of chimeric dystopic-utopic auditory being: an imperialistic, unnatural, post-Industrial Revolutionary\nsound, but the welcome agent of an orderly Apollonian soundscape, all the same.\nSchafer might also place sirens in the special sonecologic category of Sacred Noises, which by virtue of\ntheir association with divine power, have throughout history been \"absent from the lists of proscripted\nsounds which societies have from time to time drawn up\" (Schafer 51). The siren, like the church bell, has\nin fact been since its introduction relatively immune to anti-noise legislation, a hallmark of a modernizing\nstate (Thompson 126). In those cases where the sounds of sirens have been regulated, the goal has\ngenerally been to limit their use to increasingly higher-ranking civic authorities (Schafer 67). \"Wherever\nnoise is granted immunity from human intervention,\" notes Schafer, \"there will be found a seat of power\"\n(Schafer 76). After the Industrial Revolution, Sacred Noises, once the exclusive province of the church,\n\"sprang across to the profane world\" and began to emanate from industrialists--and evidently, from\nmodern states. According to Schafer, the association of noise and power has never been broken in the\nhuman imagination (Schafer 76). If the study of noise legislation reveals social attitudes (Schafer 67), when\n(if ever?) have people resisted the noise of the siren? Will tomorrow's citizens resist the sound of the siren\nin the future?\nFor Aden Evens, author of Sound Ideas, noise is deeply implicated in its relations with music. In order to\nextend his philosophy to an analysis of the sound of the siren, I shall define the city soundscape as the sonic\nuniverse, and the sound of the siren, the sound or music within it. For Evens, city noise is the inarticulate,\nconfused mass of vibration in which the sound of a siren relaxes and dissipates (Evens 14.5). Human\nperception contracts the sound of the siren into sense, but the noise of the city is un-contracted. The noise\nof the city binds the signal of the siren, serving as its medium, its baseline, the plane of relief against which\nthe siren stands out.\nCity noise is thus the reservoir of sense of the siren. The noise of the city is implicated (necessarily\ninterwoven with) the sound of the siren; the sound of the siren is explicated (made clear) by the noise of the\ncity. City noise is the reserve of sense that gives the siren its force. Just as the concert piano draws\nexpressive power from the force of the concert hall, the siren draws expressive power from the force of the\ncityscape. The concert piano is a tool for shaping the sound of the concert hall; the siren is a tool for\nshaping the city noise, contracting parts of it into perception. The hearer of the siren is like a sculptor who\nattends at once to the siren and to the relaxed cityspace around him (Evens 16.7).\nIn a third philosophy of sound and noise, which draws on the ideas of Evens (with illuminations from\nLenoir), I imagine sound as conditioned by noise in the same way that sunlight is conditioned by stained\nglass in the medieval cathedral. In the same way that wavelengths are subtracted from light as they pass\nthrough stained glass, something of any sound is lost to the noise around it. Yet conditioned sound, like\nconditioned light, has more meaning and vitality for the process. The sound of the siren is conditioned by\nthe noise of the city, and the sound of the city conditioned by the noise of the siren. The reciprocal\nexchange between siren and city animates the body of the modern metropolis.\n\nAmbivalence and resistance\nIn naming his acoustic invention, Baron Cagniard de la Tour is said to have been inspired by its property of\nbeing sonorous under water, and by the singing quality of its voice. Hence, the Syren. But could Cagniard\nde la Tour have \"blindly\" disregarded the complex metaphorical meaning of the Syren: she who sings\nsweetly, but beguiles and deceives? Conscious or not, Cagniard de la Tour's choice of the name was\ncertainly a prophetic one, for the metaphorical meaning of the Syren--which engages the binary poles of\nattraction and repulsion, candor and deceit--is so neatly echoed in the ambiguous power of the modern\ninstrument. The siren of myth promises sex, then offers death; the siren as instrument promises security,\nthen serves oppression. Both sorts of sirens are the objects of deep cultural ambivalence, and both, the\nmuses of artistic inspiration.\nSchafer (40) and Feld (225) have commented on the tendency of peoples to echo their soundscape in\ntheir language and music. And so, from their earliest appearance in the soundscape, sirens have found their\nway into works of art and music. Because the siren is so deeply embedded in relations of power, however,\nthe use of the sirens as elements of musical composition goes far beyond the mere echoing of the artist's\nsoundscape. Sirens in music are often the sounds of the resistance, a form of reverse sound imperialism.\nThis resistance may be directed towards dominant artistic conventions, e.g. the sirens of George Antheil's\n1924 Dada piece Ballet Mecanique or Edgard Varese's 1929 Ionisation; hegemonic social or political\nregimes; or the anxieties of modern life (Bob Dylan's 1965 Highway 61 Revisited and The Crystal\nMethod's 1997 big beat Busy Child (track 3, also footnote [3]).\nSiren sounds in music represent neither sound nor noise, but activated creative elements. The house DJ\nsamples the sound of the police or air raid siren, reversing its power in order to amplify and electrify her\ncreative statement; Max Neuhaus' 1980's siren project seeks to reshape the soundscape of the city; The\nBeastie Boys' turntable tricks and Midfield General's sampled sirens recall the close-range urban bustle.\nThe right to use the siren to move and motivate the public has always been in the hands of the artist.\nAcoustic inversions\nSchafer draws our attention to a phenomenon I call an acoustic inversion, an instance in which shifts in the\nperceptual habits of society cause auditory figure and ground to exchange roles (Schafer 98). Figure and\nground have, in fact, exchanged roles in the historical soundscape of the siren, but the effect was not the\nresult of shifts of perception, but of apocalyptic shifts in actual conditions. When the frequency of\nemergency sirens (and so of emergencies) increases to the point at which the figure of the siren is\ntransformed into ground, we have achieved the acoustic inversion of the siren, otherwise known as war.\nThis horrifying conception, when siren's signal becomes keynote, recalls the sonic reality of WWII London,\nor modern Baghdad. When the signal-to-noise ratio reaches 1, Schafer says, it is no longer possible to know\nwhat, if anything, is to be listened to (Schafer 71). War is the ultimate lo-fi landscape.\nDeep history\nWhy did the sound of the siren, in particular, find a foothold as a sound of public address? What was it\nabout that particular sound--its plaintive, modulated note--that helped it to become an uber-linguistic\nsignifier of civil obedience? (Erlmann 61). The world is filled with sounds: loud sounds, technological\nsounds, imperialistic sounds, any of which might have fulfilled the prescribed social role. Was the siren\nsimply in the right place at the right time, a mass-produced sound-making electronic commodity, which\nhappened to find a home in the infrastructure of civic authority... and so atop emergency vehicles and\nrooftops across the land?\n[3] The Crystal Method are said to have done their early musical production in an underground shelter referred to as \"The Bomb\nShelter\".\n\nIt seems unlikely. Perhaps if we listen deeply to the sound of the siren, to its plangent, wavering\nfundamentals and harmonics, we may find an answer (track 1). Clairaudience may help us to unear an\nancient sound, an ancestral form of public address, a sound that has lain claim to territory, reaffirmed social\nbonds, and defined the space of the community from a thousand lonely ridgetops of time. From deep\nmemory, we may retrieve the howl of the wolf (track 2).\nSchafer likens the sounds of police sirens to the alarm calls of birds (Schafer 33), but I do not concur.\nNot only does sound of the siren--in frequency, timbre, and modulation--simply sound more like a howl\nof the wolf, but the meaning and symbolism of the two vocalizations are neatly congruent. The howling of\nwolves is believed to play multiple social functions: coordinating movements among pack mates,\nstrengthening the social bonds between them, and establishing the spatial boundaries of the pack (Mech).\nThe sound of the siren, too, coordinates the movements of citizens, strengthens the social bonds between\nthem, and establishes and defines the boundaries of the community. Both the howl and the siren are the\nsyntax through which individuals position and define themselves relative to their group.\nSchafer notes that definition of space by acoustic means is much more ancient than the establishment of\nproperty lines and fences (33). In the call of the wolf, he allows, \"...we encounter a vocal ritual which\ndefines the territorial claim of the pack to an acoustic space---in just the same way as the hunter's horn lays\nclaim to the forest or the church bell to the parish\" (39). And, so by extension, the siren lays claim to the\nneighborhood, the precinct, and the nation-state, defining power and authority and right-of-way within it.\nAs wolves respond to the howl of the alpha-male, modern citizens respond to the vocalizations of the state.\nHearing is touching at a distance (Schafer 11), and the wolf pack howls to stay in touch. Sirens, like howls,\ntouch the civil body over a distance.\nCanines instinctively recognize the sonosymbolic kinship between howl and siren, yet we are often\namused when neighborhood dogs howl at the sound of a passing fire truck. But it is we, not the dogs, who\nfail to grasp the meaning of the event; we who must examine the meaning of our misinterpretation. In our\nanthropocentrism, we see the howling of dogs as (mostly inadequate) imitations of the sound of the siren; it\nis in fact our own species that routinely produces feeble imitations of the voicings of wolves.\nThe auditory congruence of howl and siren supports the general hypothesis that man echoes his\nsoundscape (Schafer 40, Feld 225), but in the instance of the siren, we find evidence for the symbolic\nechoing of the soundscape. The mechanical howl has the same meaning and symbolic purpose as the\noriginal. The reproduction echoes the original--in frequency, modulation, and timbre--and in symbolic\nintent.\nWas it mere coincidence that a mechanical howl came to serve as a signal in the dense city soundscape?\nCertainly, a striking, penetrating sound was required. Ethologists tell us that lower-pitched, harmonically\nsimple tones like the howl carry best over long distances, that modulated tones are easier to localize (Mech\n77). Schafer writes of modern society's synthetic soundscape, in which natural sounds are becoming\nincreasingly unnatural, while man-made substitutes are providing the operative signals directing modern\nlife (Schafer 91). It is fascinating that our rational, modern state has chosen the haunting, almost\nsupernatural song of the wolf as the song of civil obedience.\nListening for the future\nModern society becomes increasingly more diffuse, yet the siren still evokes a surprisingly unified cultural\nresponse. But the authority of the siren, like all cultural constructs, is contingent, and may increasingly be\nresisted and challenged in the future. 2007 saw the introduction of a new breed of siren: a siren that\nrumbled the ground.\nThe Rumbler introduces a revolutionary new concept to audible warning. This system has the ability to\ninteract with 100/200-watt siren amplifiers and provide secondary, low frequency duplicate tones. Low\n\nfrequency tones have the distinct advantage of penetrating and shaking solid materials allowing\nvehicle operators and nearby pedestrians to FEEL the sound waves, and perhaps even see their effects\nthrough a shaking rearview mirror. (Illinois Fire)\nIf sirens, like works of architecture, are expressions of the dominant sentiment of the age, what is the\nmeaning of the Rumbler? What is the meaning of the city's increasing ability, through the use of\nsophisticated video networks, to surveil its citizens in an historically unprecedented way--opening the door\nfor a brave new era of Urban Panopticism (Dochtermann). Do these phenomena represent the advances of\nan increasingly controlling, aggressive state? Or are the shifts situated in the realm of the hearing public,\nwhich in mounting an increased resistance to listening, drives the state to feel the need to \"raise its voice\"\nto be heard? Perhaps the displacements are occurring on both sides. Civil obedience is a two-way dialog:\nwill the State and the Public of the future continue to hear each other as they have in the past? Perhaps we\ncan look to Homer's narrative for clues. After Odysseus' successful encounter with the Sirens, the episode\nconcludes with these lines:\nSo all rowed on, until the Seirenes\ndropped under the sea rim, and their singing\ndwindled away.\n(252-4)\nOdysseus faced the challenge of the Sirens by stopping his men's ears to the sound. If we would take the\nmeasure of man, we would do well to attend to the sound of the siren.\n\nBibliography/Discography/Illustration Credits\n\"Air Raid Siren is Termed Success Despite Dead Spots.\" New York Times. 27 May 1951.\n\"Approves Series of Rules for Traffic Regulation.\" New York Times. 13 Jun 1915.\n\"Autos Must Halt at Curb When Police Sirens Sound.\" New York Times. 16 Sep 1933.\n\"BBC - School Radio - World War 2,\"\n<http://www.bbc.co.uk/schoolradio/history/worldwar2audioclipslibrary_clip02.shtml.>\nLudwig Bemelmans, Madeline, (Viking Press, 1967).\n\"Big Bertha Air Raid Siren Undergoes a Voice Test.\" Science News Letter. 23 May 1942.\nMichael Bull and Les Back, The Auditory Culture Reader, First Edition (Berg Publishers, 2004).\n\"Chrysler air raid siren.\" Victory Siren Foundation, Inc. <http://victorysiren.com/s/main.htm>\n\"Chrysler Air Raid Siren c. 1952.\" <http://users.tpg.com.au/nielsent/sirenworld/php/data.php>\n\"City Cocks its Ears for Siren in Vain.\" New York Times. 18 Dec 1941.\n\"Civil defense siren - Wikipedia, the free encyclopedia,\"\n<http://en.wikipedia.org/wiki/Civil_defense_siren.>\n\"Composer Replaces Siren's Wail with Melody and Meaning.\" New York Times. 1 Apr 1989\nAnton Dochtermann, \"Metaphors of the contemporary city,\" <http://www.math.tu\nberlin.de/~dochterm/city%20metaphors.htm.>\n\"Early Siren Design,\" Anthony Burr/Charles Curtis. Physics and Metaphysics of Sound.\n<http://www.gardenvariety.org/projects/lucier/booklet.html>\n\"Earsplitting Symphony, With the Maestro in Blue\" New York Times, 15 Jun 2007.\n\"Emergency Broadcast System - Wikipedia, the free encyclopedia,\"\n<http://en.wikipedia.org/wiki/Emergency_Broadcast_System.>\nVeit Erlmann, Hearing Cultures: Essays on Sound, Listening and Modernity, English Ed (Berg Publishers,\n2004).\nAden Evens, Sound Ideas: Music, Machines, and Experience (Univ Of Minnesota Press, 2005).\n\"Federal Signal Rumbler Siren | Police Sirens,\" <http://www.ilfireandpoliceequip.com/rumbler_siren.htm.\n\"Federal Signal Thunderbolt Model 1003,\" <http://en.wikipedia.org/wiki/Thunderbolt_siren>\n\"Federal Siren model 2001 movie from Williamson, TN\" <http://www.airraidsirens.com/.>\nSteven Feld, \"A Rainforest Acoustemology.\" The Auditory Culture Reader, Ed. Michael Bull and Les\nBack. First Edition (Berg Publishers, 2004). 223-229.\n\"Fire and Police Sirens to Return.\" New York Times. 14 Jan 1953.\n\nClifford Geertz, The Interpretation of Cultures: Selected Essays (Basic Books, 1973).\nStefan Helmreich, Silicon Second Nature: Culturing Artificial Life in a Digital World, (University of\nCalifornia Press, 2000).\nHomer, The Odyssey, Robert Fitzgerald (New York; Farrar Straus and Giroux, 1998).\nLenoir, Timothy. Helmholtz and the Materialities of Communication. Osiris. 1994. 2(9):184-207.\n\"A Lonesome Howl\" NOVA Online | Wild Wolves | What's in a Howl,\"\n<http://www.pbs.org/wgbh/nova/wolves/howl.html.>\nDavid Mech and Luigi Boitani, Wolves: Behavior, Ecology, and Conservation (University of Chicago\nPress, 2003).\n\"On Guard Advertisement.\" The American City. Jul 1953.\n\"Opinions Differ on Test of Siren.\" New York Times. 5 Jul 1942.\n\"Police Sirens are Curbed Except for Air Raids.\" New York Times. 28 Dec 1941.\nRichard Scarry, Best Word Book Ever, (Golden Books, 1963).\nR. Murray Schafer, The Soundscape (Destiny Books, 1993).\n---, \"Open Ears.\" The Auditory Culture Reader, Ed. Michael Bull and Les Back. First Edition (Berg\nPublishers, 2004). 25-40.\nHillel Schwartz, \"The Indefensible Ear: A History.\" The Auditory Culture Reader, Ed. Michael Bull and\nLes Back. First Edition (Berg Publishers, 2004). 487-501.\nBruce R. Smith, \"Tuning into London c. 1600.\" The Auditory Culture Reader, Ed. Michael Bull and Les\nBack. First Edition (Berg Publishers, 2004). 127-136.\n\"Siren.\" Acoustics. Kenyon College Department of Physics.\n<http://physics.kenyon.edu/EarlyApparatus/Acoustics/Siren/siren.htm.>\n\"Siren.\" The Oxford English Dictionary. 2nd ed. 1989. OED Online. Oxford University Press. 5 Mar. 2008\n<http://dictionary.oed.com.libproxy.mit.edu/cgi/entry/50225650>\n\"Siren.\" Urban Dictionary: <http://www.urbandictionary.com/define.php?term=siren&page=1.>\n\"Siren (noisemaker).\" Wikipedia, the free encyclopedia\"\n<http://en.wikipedia.org/wiki/Siren_%28noisemaker%29.>\n\"Sound Kills Mouse.\" Science News Letter. 1 Nov 1947.\n\"Spinning the Dial to Europe.\" New York Times. 17 Sep 1939.\nPaul Stoller and Cheryl Olkes, The Taste of Ethnographic Things: The Senses in Anthropology (University\nof Pennsylvania Press, 1989).\nThe Crystal Method, \"Get Busy Child.\".<http://www.youtube.com/watch?v=u0Fn2Fk9qyA>\n\"The History of 911 Emergency Calls,\" <http://inventors.about.com/library/inventors/bl911.htm.\n\nEmily Thompson, The Soundscape of Modernity: Architectural Acoustics and the Culture of Listening in\nAmerica, 1900-1933, New Ed (The MIT Press, 2004).\nThe fact that subliminal messages have gone public does not mean covert messages have become extinct. In department stores there\nmay be the subliminal sound of jail doors slamming or police sirens wailing to deter shoplifters... \"What's New in Subliminal\nMessages\" New York Times, 20 Mar 1988.\n\nAccompanying Media\nThe following content was part of the project documentation, but has been removed for OCW publication\ndue to copyright restrictions.\nImages\nEarly siren design\nhttp://www.gardenvariety.org/projects/lucier/booklet.html\nFederal Signal Thunderbolt Model 1003\nhttp://en.wikipedia.org/wiki/Thunderbolt_siren\n\"ON GUARD\" advertisement from The American City Magazine - July 1953\nat http://www.victorysiren.com/x/Ads/AC-jul1953-sm.htm\nChrysler Air Raid Siren c. 1952\nhttp://users.tpg.com.au/nielsent/sirenworld/php/data.php\nMadeline book image by Ludwig Bemelmans\nhttp://onoloa.net/16456/7101.html?*session*id*key*=*session*id*val*\n\"In a car with a red light they drove out into the night.\"\n- Ludwig Bemelmans, Madeline, 1939.\nRichard Scarry's Best Word Book Ever\nhttp://en.wikipedia.org/wiki/Best_Word_Book_Ever\nRichard Scarry's 1963 classic Best Word Book Ever! features ten emergency vehicles and twenty one sirens.\nVideo\nAir raid siren: Federal 2001 from Williamson, TN\nhttp://www.williamson-tn.org/co_gov/depts/ecc/siren4.mpg (1.2 MB)\nWolf howl sonogram: \"A Lonesome Howl\" from NOVA Online | Wild Wolves | What's in a Howl\nhttp://www.pbs.org/wgbh/nova/wolves/howl.html.\nAudio\nThe Crystal Method, \"Get Busy Child.\""
    }
  ]
}