{
  "course_name": "The History of MIT",
  "course_description": "To study MIT is to study the modern world. In 2016, MIT celebrated the 100th anniversary of the move from Boston to Cambridge; therefore, this course examines the history of the Institute through the lens of the history of science and technology, and vice-versa. It is about discovery, exploration, adventure, learning, creative thinking, and the synthesis of big ideas. Additionally, this course is about the importance of the research university, what it has been in the past and what it will be in the future. The course includes guest lecturers and field trips to the Institute Archives and the MIT Museum.\nThe most important prerequisite for this class is curiosity, a desire to think deeply about MIT, and a willingness to communicate your thoughts and ideas. The ultimate aim is to fascinate you as much as to help you improve your skills synthesizing information from diverse sources about science, technology, and culture.",
  "topics": [
    "Humanities",
    "History",
    "American History",
    "History of Science and Technology",
    "Modern History",
    "Humanities",
    "History",
    "American History",
    "History of Science and Technology",
    "Modern History"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 lectures / week, 1 hour / lecture\n\nRecitations: 2 recitations / week, 1 hour / recitation\n\nCourse Description\n\n\"MIT is...(fill in the blank)...\"\n\nHow many times have you attempted to describe MIT? How do you fill in the blank? What do you wish you knew about the Institute? The short description for this course suggests a simple (albeit fascinating) effort to survey MIT's history from its founding to the present day. MIT is not a simple place. To study MIT is to study the modern world. This course is about discovery, exploration, adventure, learning, creative thinking, and the synthesis of big ideas. It is about the importance of the research university: What it has been in the past and what it will be in the future.\n\nWhen writing down his vision for MIT, charismatic founder and education pioneer William Barton Rogers wrote this in his 1860 \"Objects and Plan\":\n\n\"The practical nature of the discoveries in chemistry, mechanics, geology, and other branches of scientific inquiry, has multiplied almost infinitely the lines of connection between them and the processes of the Workshop, the Manufactory, and the Farm, and of the Constructive and Locomotive Arts;\nand these countless connecting threads, woven into one indissoluble texture, form that ever-enlarging web which is the blended product of the world's scientific and industrial activity\n.\" (emphasis added)\n\nThrough readings, videos, discussions, lectures, special guest talks and hands-on opportunities, you will explore MIT like few others have. You will take up Rogers' challenge to weave together countless connecting threads.\n\nThis class has been steadily evolving since first taught in 2010. This year (2016), MIT will celebrate the 100\nth\nanniversary of the move from Boston to Cambridge (Did you know that MIT was in Boston for its first half-century?!). There are a number of special events from exhibition openings and symposia, to some incredibly fun parties. You'll have a front row seat for many of these activities, and the opportunity to contribute behind the scenes. You'll have the opportunity to study original architectural plans, 3-D print sections of campus for a special map display, meet Cambridge residents who grew up in this neighborhood, listen to some of the world's best architectural historians and make a ceremonial crossing of the Charles.\n\nThe class will officially be scheduled to meet twice a week, plus a recitation, but will be adjusted to accommodate some of the special events. A key feature of this class is special presentations by guest speakers. The mix varies from year to year but you can expect to meet outstanding professionals sharing stories about different aspects of MIT history. We will use the recitation sections for discussion and on-campus \"field trips.\"\n\nAssignments will be a bit different from previous years. Reading reflection papers are still a key part of this course. These are short (1-2 page) essays that help you think about the readings, videos and lectures. You will complete two additional reports--a document report and an artifact / plan report--that will be based on your close study of original materials.\n\nThe final assignment for the class will be a \"then and now\" comparison of some aspect of MIT history of the past 100 years. That could be anything that interests you, from academics to athletics. This could be a written assignment, an in-class presentation, a video, a special display at the Open House event, something you make...it will be up to you.\n\nThe most important prerequisite for this class is curiosity, a desire to think deeply about MIT, and a willingness to communicate your thoughts and ideas with your classmates. The ultimate aim is to fascinate you as much as to help you improve your skills synthesizing information from diverse sources about science, technology, and culture.\n\nField Trips\n\nThere will be some \"field trips\" to other places on campus, such as the\nInstitute Archives\nand the\nMIT Museum\nthat are scheduled during class periods. In addition, I will call attention to various\nCentennial Celebration\nevents and arrange an occasional \"field trip\" or outing that I think will enhance your appreciation of MIT's history. These extracurricular trips are completely voluntary and will have absolutely no bearing on your grade.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nReflection papers\n\n40%\n\nDocument report\n\n12.5%\n\nArtifact / Plan report\n\n12.5%\n\nFinal project\n\n25%\n\nClass participation\n\n10%",
  "files": [
    {
      "category": "Resource",
      "title": "Archives Visit Worksheet",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-050-the-history-of-mit-spring-2016/fbf54ed516797cd5079160f201099813_MITSTS_050S16_Worksheet.pdf",
      "content": "STS.050 The History of MIT\nSpring 2016\nArchives Visit Worksheet\n\nArchives Visit Worksheet\n\nTo learn from primary source material, you must approach the material systematically. Step One is to\nbehave just like a journalist and try to figure out: WHO, WHAT, WHEN, WHERE, HOW AND WHY.\nHowever, you also behave a bit like a scientist and keep detailed notes about where you found the\nmaterial, all of its identifying inscriptions (e.g., Manuscript Collection Number), and other helpful details\nsuch as a physical description that may also offer you clues about a document's provenance,\nauthenticity, and reliability.\n\nI.\nQUICK REVIEW OF THE MATERIALS\n\nMake a quick first pass and see how many of these questions you think you can easily answer. (Just\ncheck off the boxes). You are aiming to get an overview of the material and trying to figure out if it will\nbe useful for your purpose.\n\n☐\nWho are the people represented in these materials? (Some suggestions for what to report:\nnames, titles, positions.)\n\n☐\nWhat events or activities are documented?\n\n☐\nWhat are the dates of the materials? When was it created, circulated, annotated, altered?\n(Give a reasoned guess if it's not clearly indicated.)\n\n☐\nWhich geographic places or locations are represented in the item?\n\n☐\nWhat type of item or document is it? How would you describe it physically?\n\n☐\nWhat do you think was the purpose of the item? Why was it created? What did its creators\nwant to achieve?\n\n☐\nWho was the intended audience of the item? Who might have seen it? Was it for private or\npublic consumption?\n\n☐\nWhat does this item tell you and what does it leave out? What would you like to ask about it?\n\n☐\nDoes this item tell a story?\n\nII.\nREVIEWING THE MATERIAL\n\nNow go back and try answering the questions. Do not make up answers but if you if you think you can\nmake a reasonable guess, make note of that. For example, maybe a letter doesn't have a date but the\nenvelope does.\n\nIII.\nDOCUMENTING THE COLLECTION\n\nImagining you are preparing a bibliography, please document your materials as thoroughly as you can.\n\nWhat collection do your materials come from?\n\nWhat is the preferred/required citation format for the Archives/Museum/Historical Society etc. you are\nworking in?\n\nIV.\nSPECIAL NOTES ABOUT YOUR MATERIALS\n\nWhat other kinds of information can you derive from your materials?\n\nDo you think your materials are authentic? Why or Why not?\n\nAre there other sources you need or want to consult to verify your sources?\n\nOther Notes\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\nSTS.050 The History of MIT\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Using Artifacts as Evidence",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-050-the-history-of-mit-spring-2016/8bff8e8c5300a08f8043710181a923a2_MITSTS_050S16_ArchivesGrid.pdf",
      "content": "Using Artifacts as Evidence\n\nQUESTION\nOBJECT\n1-4\n\nWhat do you think\nthis is?\n\nWho made it?\n\nWhat is it made\nof?\n\nIs anything\nwritten on it? If\nso, what?\n\nHow was it made?\n\nWhy do you think\nit was made?\n\nWhat is it used\nfor?\n\nWhat do you think\nthe MIT\nconnection is?\n\nOther important\nobservations?\n\nRate your level of certainty: 1 = Guess; 2 = Possible, a little bit of evidence; 3 = Several pieces of\nevidence; 4 = Certainty\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\nSTS.050 The History of MIT\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    }
  ]
}