{
  "course_name": "The Emergence of Europe: 500-1300",
  "course_description": "This course surveys the social, cultural, and political development of western Europe between 500 and 1350. A number of topics are incorporated into the broad chronological sweep of the course, including: the Germanic conquest of the ancient Mediterranean world; the rise of a distinct northern culture and the Carolingian Renaissance; the emergence of feudalism and the breakdown of political order; contact with the Byzantine and Islamic East and the Crusading movement; the quality of religious life; the vitality of the high medieval economy and culture; and the catastrophes of the fourteenth century.",
  "topics": [
    "Humanities",
    "History",
    "European History",
    "Medieval History",
    "Philosophy",
    "Political Philosophy",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology",
    "Humanities",
    "History",
    "European History",
    "Medieval History",
    "Philosophy",
    "Political Philosophy",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nCourse Overview\n\nThis course will survey the social, cultural, and political development of western Europe between 500 and 1350. A number of topics will be incorporated into the broad chronological sweep of the course, including: the Germanic conquest of the ancient Mediterranean world; the rise of a distinct northern culture and the Carolingian Renaissance; the emergence of feudalism and the breakdown of political order; contact with the Byzantine and Islamic East and the Crusading movement; the quality of religious life; the vitality of the high medieval economy and culture; and the catastrophes of the fourteenth century.\n\nThe course has a scheduled three-hour final exam, as well as a shorter mid-term exam to be taken in class. As you can see from reviewing the syllabus, the reading for this course is of two main types: a text narrative of events and major ideas, and short selections from primary sources. The mid-term and final exams will primarily test your ability to make sense of the narrative of the course. In addition to the exams, you are also required to submit a total of four discussion papers - two due before the mid-term and two after - in which you analyse a primary source. These papers should be short - not more than 2 pages - and should demonstrate your ability to dissect a single source and place it in its larger historical context. They should be turned in on the day in which the particular source is being discussed in class. These papers will not depend on any outside reading. However, if you wish to pursue a topic which does require some additional reading, please clear this with me in advance. In particular, you are not permitted to use any Internet sources, unless they are from fully refereed sites, or are on-line versions of primary source documents.\n\nRegular attendance in class is required; and participation in class discussion will feature prominently in the calculation of final grades. If you need to miss class for some legitimate reason, please notify me in advance so that I may make a note of it as an excused absence. Unexcused absences will detract from the participation component of your grade.\n\nGrading\n\nACTIVITY\n\nPERCENTAGE (%)\n\nMid-term\n\n15%\n\nPapers @ 10% Each\n\n40%\n\nFinal Exam\n\n20%\n\nParticipation\n\n25%",
  "files": [
    {
      "category": "Resource",
      "title": "Barbara Tuchman - A Distant Mirror",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-306-the-emergence-of-europe-500-1300-fall-2003/144ab0422938e37631479439658d226d_medievaltuchman.pdf",
      "content": "21H.306\nFinal reading assignment\nBarbara Tuchman B A Distant Mirror\n\nThis work of Apopular@ history was published in 1978 to much general acclaim, and resounding critique\nfrom the historical profession. After all, Tuchman was not a PhD certified historian. Perhaps even more\negregiously she had already published books on a wide variety of fields ranging from the Bible, to the First\nWorld War, to China, etc. By contrast the mode of the academic discipline of history has been to\nspecialize ever more narrowly in time and place, especially as it concerns areas of research focus. There\nmight be room for broad and eclectic teaching of undergraduates, but certainly not for scholarly output.\n\nNow that you have read the book for yourselves, and can compare it with both the work of Areal@ historians\nand with selections from the sources Tuchman herself employed to write the book, can you assess for\nyourself what all the fuss was about?\n\nThe following questions might be helpful in thinking about this:\n\n1. What does a historian do?\n\n2. Who gets to be a historian, and why? -- this is a credentials question\n\n3. What are legitimate sources, and how should they be used?\n\n4. To what purpose do we engage in this stuff anyway? or Why bother studying history?\n\n5. What are the 'legitimate' subjects (or topics you might say) of historical enquiry?\n\nNow some specific questions for A Distant Mirror:\n\n1. How is Tuchman's history of the 14th century different from your textbook's? (We already thought about\nthis a bit with the Cambridge Medieval Textbook on the 100 years war.)\n\n2. And the big one.... Given what we know about what it means to \"be medieval\", was it inevitable that the\nvarious disasters of the 14th c. would spell the end of the middle ages? that is, that they would so disrupt\nthe mental and cultural worlds of Europe that communities (of intellectuals and regular folk alike) would be\nforced to understand themselves in new ways, ways that we now understand to be Aearly modern@? Or is\nour periodization of the middle ages (merely) an artifact of our backwards reading of events?"
    },
    {
      "category": "Resource",
      "title": "High Middle Ages, \"Super-Princes,\" and National Unity",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-306-the-emergence-of-europe-500-1300-fall-2003/29745d9e27a96697a9e4daf14c5e2f2d_leeds_final_paper.pdf",
      "content": "21H.306 - Final Paper\nDaniel Leeds\n\nThe High Middle Ages saw the rise of \"super-princes\" and a growing sense of national\nunity. In addition, the advent of natural disasters, such as the Black Death, gave\nsurviving laborers significant potential power over their masters. In relating the Peasants‚\nRebellion of 1381, the French chronicler Jean de Froissart shows England as a\nprototypical fourteenth century European kingdom - thus warning contemporaries to be\nmindful of troublesome workers in their own lands. England is a country with a\ncentralized government, lucrative cities, and, of course, a restive labor force.\n\nFroissart's account begins with theological arguments from the \"commonalty\" of several\nEnglish counties against their mistreatment by the gentry. Citing the Bible as proof\nagainst the contemporary social hierarchy, since \"in the beginning of the world there\nwere no slaves,\" they demand freedom and pay for any service performed. In truth, the\ntypical peasant was not a Biblical scholar, but John Ball's recorded assertions of\nCanonical support for a new form of universal freedom are somewhat akin to the\nactivities of the traveling preachers who promoted humility, in some opposition to the\nsplendor of the material glory of the Church and the nobility. In addition, new cultural\nemphasis on personal devotion may have led serfs to individual reflections on lessons\nfrom Genesis that matched Ball's cries.\n\nBeyond establishing theological arguments, England‚s peasants successfully enter\nLondon and convince their King, Richard II, to mandate their release from centuries-old\nbonds of servitude. While Richard soon recants this order, his initial concession and his\ninability (after Froissart's account ends) to completely check serf liberation indicates\nsome strong advantage held by the peasantry. This advantage was most likely the\nresult of the natural catastrophes of the preceding decades, rather than of the religious\nstances addressed above. Over the first half of the fourteenth century, Europe faced\nfamine and the Black Death, resulting in the deaths of up to fifty percent of the populace.\nLabor supply dramatically decreased. As the demand for this labor dropped significantly\nless, peasants now could offer a scarce resource, and thus had a key bargaining tool.\nFrom England to Italy, rulers issued decrees to keep farm workers from negotiating\nhigher wages and privileges for their services. Nonetheless, peasants were no longer\nexpendable. For the first time, they could rebel and could earn the King‚s approval, even\nafter murdering four of his men. While Froissart ends his account with the official\nsuppression of the Rebellion and nobility triumphant, one must keep in mind the\nconcessions made by nobles thereafter, and one must recall the chronicler‚s potential\ndesire to shape history to favor those of his own rank.\n\nThe fact that the serfs think to seek justice from Richard II, and that he is capable of\nyielding a meaningful ruling to be applied to his entire realm, indicates a centralization of\nauthority relatively new to Europe in the fourteenth century. While kingship and the\nsubdivision of land among nobles and knights had been established by the turn of the\nmillennium, for much of the Middle Ages, kings had very little real power outside of their\nimmediate environs. The peasant‚s world extended little beyond his local noble's\nterritory; all matters of dispute were handled by the noble. Froissart, however, presents\na King who grants freedom and orders death throughout the counties of his realm.\nPerceiving this control, John Ball urges the serfs \"[l]et us go to the king and remonstrate\nwith him.\" The power of English royalty by Richard‚s time largely derived from the\n\nsystem of laws established two centuries before by Henry II. Henry set a strong\nprecedent, sending his men throughout England to keep order according to royal\nstandards.\n\nBy the fourteenth century, cities enjoyed relatively long standing reputation as mercantile\ncenters. However, in Froissart's record, London plays a newer urban role as a hub for\nsocial ferment, in addition to housing rich nobles and merchants. Londoners \"envious of\nthe rich and noble\" seek to destroy them in the guise of fighting for serfs‚ freedom, thus\nproducing the Rebellion. In Froissart's presentation, the social order is successfully\nattacked, as protesting peasants quickly note the city‚s wealth and take to looting. While\nprobably better viewed as a product of Plague and of the sense of a unified authority\nagainst which to revolt, the Peasants‚ Rebellion also can be taken as another scene in\nthe play of contemporary urban unrest."
    },
    {
      "category": "Resource",
      "title": "On The Life of St. Gerald of Aurillac, by St. Odo of Cluny",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-306-the-emergence-of-europe-500-1300-fall-2003/8aa98a129fca0defd1f59796a9bfe283_st_gerald.pdf",
      "content": "Alya Asarina\n21H.306\n10/15/03\nOn _The Life of St. Gerald of Aurillac_, by St. Odo of Cluny\n\nThe hagiography of St. Gerald of Aurillac, portraying an almost perfect\nperson, is a lesson in 10th century morals, as well as a description of the\nactivities of a lord. Riding to hounds, shooting arrows, and flying falcons and\nhawks are the proper activities of a lord; studying the Scriptures is the\npursuit the author, St. Odo, values.\n\nSt. Odo also promotes modesty and love of peace, though he finds fighting\nto defend the weak acceptable. St. Odo describes Gerald's forces as fighting\n\"with the backs of their sword and with their spears reversed,\" and tells us\nthat Gerald nevertheless always triumphed because God was on his side. But St.\nOdo is repeatedly apologetic about Gerald having used force at all, explaining\nat length why it is OK, and repeatedly saying that Gerald fought only to defend\nhis people. There is a contrast between these excuses and the Christian crusades\nthat would come, when a knight certainly did not fight with the back of his\nweapon, and nor was he \"defending his own.\" The Bible is complex and self-\ncontradictory - different generations provide different interpretations, and\nfighting became more acceptable to the church after Odo's time. It still needed\nto be \"unselfish,\" e.g. for the glory of God, however.\n\nIn the text, Gerald's dependents complain that he does not defend his\nproperty, so we gather that it was something a lord was obligated to do.\nAccording to Odo, many landlords fought for revenge. Gerald's motives were\ndifferent, he claims, though it is unclear how much he actually knows about\nthem. The description of the fighting is certainly hard to believe - Gerald,\ninvincible, not slaying his enemies. How can an army possibly win by fighting\nwith the reverse ends of their weapons? This seems physically impossible. We do\nlearn from the account, however, that a lord physically led his people in battle\n- this seems to be taken for granted.\n\nAnother important role the lord had was that of judge. Gerald, apparently,\nalways defended a weaker man when accused by a more powerful one. It seems\nunfair to the modern reader, but it is another illustration of Gerald defending\nthe meek, as he ought as a Christian. More practically speaking, the powerful\nprobably did have an unfair advantage in a trial, being able to bribe the lord,\nperhaps, and probably receiving more respect simply because they belonged to a\nhigher class.\n\nThe incident with the robbers is also informative. A band of them takes\ncontrol of a wood and raids the vicinity; their punishment, when captured by the\nlord's soldiers, is having their eyes put out. This is very different from the\nmodern system of punishments, where imprisonment is the answer to almost any\noffence. Yet putting out the eyes is reasonable - it punishes the offender and\nit makes it rather difficult for him to commit more crimes, though it also makes\nit hard for him to become a working member of society (but so does having jail\ntime on your resume). If this is a standard punishment, it also serves as\nwarning to others that the man or woman had probably committed a crime, and as a\nreminder of the punishment that awaits them if they break the law. The\npunishment seems cruel to us, but was probably pretty successful.\n\nOdo sees it as a virtue that Gerald \"often spared the guilty.\" In the\nfirst example, the justification is that the one harmed has already been\nconsoled with a deed for a church and has forgiven the injury. In the next case,\nit is less clear why Gerald freed the accused, nor is it clear whether he\nthought them guilty. Odo stipulates that Gerald was unwilling to free them\nopenly in order that \"the goodness did not appear too much.\" More likely, it was\nbecause the accusers would have been rather upset, as they no doubt were in any\n\ncase. Not knowing who the accusers were, it's hard to say what they could have\ndone had Gerald ordered the accused to be freed directly.\n\nThe account shows that imprisonment was not a form of punishment, perhaps\nbecause prisons are expensive to maintain and the lords would not have been\nwilling to maintain them. Instead, maiming (e.g. putting out the eyes), death,\nfines, and branding are acceptable punishments. There appears to be no clear\nstandard that would match punishment to offence - it's the lord's call, and will\ntherefore depend on the lord holding trial and on the feelings the lord has\nabout the particular case. Gerald, apparently, did nothing to those who had\ncommitted a crime inadvertently, which Odo believes is the right choice.\n\nThe account ends with some of Gerald's peasants leaving the land. Perhaps,\nthen, he was not a satisfactory lord. Gerald's humanitarianism appears\nimpractical. If someone has wronged you, and the lord lets them go, you will not\nbe pleased with his mildness. Most of the contrasts between Gerald and other\nlords probably did not make Gerald the better lord."
    },
    {
      "category": "Exam",
      "title": "Final Exam Review Questions",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-306-the-emergence-of-europe-500-1300-fall-2003/635f8d4d82d9733ad9c1b0b7d2bcabc3_medievalrev_ques.pdf",
      "content": "21H.306\nThe Emergence of Europe\n\nSample review and test questions.\n\n1.\nIs it reasonable to view the Byzantine empire as the legitimate heir of the\nRoman imperial tradition, as it indeed claimed for itself?\n\n2.\nDiscuss the role played by Christianity (if any) in the merger of the\ngermanic and roman cultural traditions in the early medieval period. [Your\nanswer should consider the part played by both the highest levels of the\nChurch as well as efforts \"on the ground\" as it were.]\n\n3.\nSome scholars have designated the reign of Charlemagne as the 'Carolingian\nRenaissance'. Is this a useful historical description of the late 8th and\nearly 9th centuries?\n\n4.\nIn 887, following the deposition of Charles the Fat, Regino of Prum records\nin his history: \"Now the kingdoms which had been subject to Charles,\nholding themselves bereft of lawful heirs, cut loose into separate realms.\nNow they looked for no prince of hereditary descent; each divided part\nelected a king for itself from itself.\"\n\nWhat forces are at work in the events he describes? How might we make\nsense of them in the context of a \"feudal\" political framework? [Hint: be\nthinking about the peculiar problems of monarchy itself in this system.]\n\n5.\nCompare the repercussions of the 'germanic migrations' of the 5th c. and\nthe 'barbarian invasions' of the 9th c. on the economic, social and\npolitical life of early medieval Europe.\n\n6.\nWhat function(s) did the crusades play in the development of medieval\nsociety? Or put somewhat differently, what can the crusading experience\ntell us about European culture?\n\n7.\nDid the medieval Church have aspirations (and/or the opportunity) to wield\nthe power of a 'state'? If so, why did it ultimately fail to make good on\nsuch a claim?\n\n8.\nWhat are the distinguishing features of the medieval economy of the 11th\nthrough the 13th centuries? Is this economy best seen as an extension of\nthat which came before, or as a precursor to that which would follow?\n\n9.\nWhat are the key features of the \"medieval synthesis\"? Discuss at least\none important medieval thinker and put his work into the larger context of\nthis synthesis.\n\n10.\nThe fourteenth century is often referred to as the \"calamitous century.\"\nDiscuss the impact of at least two of its calamities (from among plague,\nschism, and war) on the development of late medieval statecraft. You might\nwant to think about whether you see these developments as progress or\nregress.\n\n11.\nRead the following passages, both dating from the 9th century. Write a short\nessay about medieval lordship and vassalage centered on the information revealed\nin these passages. You may of course also draw on a larger body of relevant\ninformation to supply context.\n\nEnglish -- 9th c.\nThus shall one take the oath of fidelity:\nBy the Lord before whom this sanctuary is holy, I will to N. be true and faithful, and\nlove all which he loves and shun all which he shuns, according to the laws of God and the\norder of the world. Nor will I ever with will or action, through word or deed, do\nanything which is unpleasing to him, on condition that he will hold to me as I shall\ndeserve it, and that he will perform everything as it was in our agreement when I\nsubmitted myself to him and chose his will.\nIt is right that those who offer to us unbroken fidelity should be protected by\nour aid. And since N. a faithful one of ours, by the favor of God, coming here in our\npalace with his arms, has seen fit to swear trust and fidelity to us in our hand,\ntherefore we decree and command by the present precept that for the future N above\nmentioned be counted with the number of antrustions. And if anyone perchance should\npresume to kill him, let him know that he will be judged quilty of his wergild of 600\nshillings.\n\nCapitulary of Mersen (Kings Lothar, Lewis, and Charles, 847)\n\nWe will moreover that each free man in our kingdom shall choose a lord, from us or\nour faithful, such a one as he wishes.\nWe command moreover that no man shall leave his lord without just cause, nor\nshould any one receive him, except in such a way as was customary in the time of our\npredecessors.\nAnd we wish you to know that we want to grant right to our faithful subjects and\nwe do not wish to do anything to them against reason. Similarly we admonish you and the\nrest of our faithful subjects that you grant right to your men and do not act against\nreason toward them."
    },
    {
      "category": "Exam",
      "title": "Mid-term exam",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-306-the-emergence-of-europe-500-1300-fall-2003/8bfbc753cdb19992f40c64d628c22f03_midtermemergence.pdf",
      "content": "Mid-term exam\nEmergence of Europe\nFall 2003\n\n1. The passage below refers to an event we have not yet discussed in class, but which reflects traditions which we\nhave discussed at length. Write no more than several paragraphs putting this text into its historical context. What\ndoes it tell us about structures of governance and the prevailing social order at the close of the first millennium?\n\nThe Election of Hugh Capet, 987\n\nMeanwhile, at the appointed time the magnates of Gaul who had taken the oath came together at Senlis. When they\nhad all taken their places in the assembly and the duke [Hugh Capet] had given the sign, the archbishop [Adalbero]\nspoke to them as follows: A King Louis, of divine memory, having been removed from the world, and having left no\nheirs, it devolves upon us to take serious counsel as to the choice of a successor, so that the state may not suffer any\ninjury through neglect and the lack of a leader. On a former occasion we thought it advisable to postpone that\ndeliberation in order that each of you might be able to come here and, in the presence of the assembly, voice the\nsentiment which God should have inspired in you, and that from all these different expressions of opinion we might\nbe able to find out what is the general will. Here we are assembled. Let us see to it, by our prudence and honor, that\nhatred shall not destroy reason, that love shall not interfere with truth. We are aware that Charles [Charles of Lower\nLorraine] has his partisans who claim that the throne belongs to him by right of birth. But if we look into the matter,\nthe throne is not acquired by hereditary right, and no one ought to be placed at the head of the kingdom unless he is\ndistinguished, not only by nobility of body, but also by strength of mind---only such a one as honor and generosity\nrecommend. We read in the annals of rulers of illustrious descent who were deposed on account of their\nunworthiness and replaced by others of the same, or even lesser, rank.\n\n\"What dignity shall we gain by making Charles king? He is not guided by honor, nor is he possessed of strength.\nThen, too, he has compromised himself so far as to have become the dependent of a foreign king and to have married\na girl taken from among his own vassals. How could the great duke endure that a woman of the low rank of vassal\nshould become queen and rule over him? How could he tender services to this woman, when his equals, and even his\nsuperiors in birth bend the knee before him and place their hands under his feet? Think of this seriously and you will\nsee that Charles must be rejected for his own faults rather than on account of any wrong done by others. Make a\ndecision, therefore, for the welfare rather than for the injury of the state. If you wish ill to your country, choose\nCharles to be king; if you have regard for its prosperity, choose Hugh, the illustrious duke. . . . Elect, then, the duke,\na man who is recommended by his conduct, by his nobility, and by his military following. In him you will find a\ndefender, not only of the state, but also of your private interests. His large-heartedness will make him a father to you\nall. Who has ever fled to him for protection without receiving it? Who that has been deserted by his friends has he\never failed to restore to his rights?\"\n\nThis speech was applauded and concurred in by all, and by unanimous consent the duke was raised to the throne. He\nwas crowned at Noyon on the first of June by the archbishop and the other bishops as king of the Gauls, the Bretons,\nthe Normans, the Aquitanians, the Goths, the Spaniards and the Gascons. Surrounded by the nobles of the king, he\nissued decrees and made laws according to royal custom, judging and disposing of all matters with success.\n\n2. Write a short (paragraph length at most) identification of three of the following five terms or concepts we have\ndiscussed thus far in the course. Be sure to explain both the term itself and say something about why it is historically\nimportant.\n\nBenedictine Monasticism\n\nBarbarians\nByzantine Empire\n\nArianism\nPeace of God"
    }
  ]
}