{
  "course_name": "The New Spain:1977-Present",
  "course_description": "In this class we will come to understand the vast changes in Spanish life that have taken place since Franco’s death in 1975. We will focus on the new freedom from censorship, the re-emergence of movements for regional autonomy, the new cinema, reforms in education and changes in daily life: Sex roles, work, and family that have occurred in the last decade. In so doing, we will examine myths that are often considered commonplaces when describing Spain and its people.",
  "topics": [
    "Humanities",
    "History",
    "European History",
    "Modern History",
    "Language",
    "Spanish",
    "Society",
    "European and Russian Studies",
    "Humanities",
    "History",
    "European History",
    "Modern History",
    "Language",
    "Spanish",
    "Society",
    "European and Russian Studies"
  ],
  "syllabus_content": "Course Meeting Times\n\nSeminar: 1 session / week, 3 hours / session\n\nPrerequisites\n\nOne intermediate course in Spanish or MIT students need to get the instructor's permission.\n\nCourse Overview\n\nThis course deals with the vast changes in Spanish social, political and cultural life that have taken place since the death of Franco. Topics include new freedom from censorship, the re-emergence of strong movements for regional autonomy (the Basque region and Catalonia), the new cinema including Almodovar and Saura, educational reforms instituted by the socialist government, and the fiction of Carme Riera and Terenci Moix. Special emphasis on the emergence of mass media as a vehicle for expression in Spain. The course considers the changes wrought by Spain's acceptance into the European Community. Materials include magazines, newspapers, films, fiction, and Amando de Miguel's\nLos Espanoles\n. The classes were taught in Spanish.\n\nMaterials\n\nIn addition to the required books for this subject, there is additional assigned reading material on the course website. Readings allow us to share information on politics, film, the new constitution, art, education, immigration, the autonomous regions, \"la movida\" and fashion. There will be several movies and telenovela used in the course as well as DVDs that chronicle the\ntransicion\nfrom dictatorship to democracy.\n\nBooks\n\nGrandes, Almudena.\nCastillos de Carton\n. TusQuets, 2004. ISBN: 9788483102596.\n\nMendicutti, Eduardo.\nUna mala noche la tiene cualquiera\n. TusQuets, 1998. ISBN: 9788472238329.\n\nMolina, Antonio Munoz.\nEl dueno del secreto\n. Booket, 2007. ISBN: 9788432217661.\n\nPedrero, Paloma.\nJuego de noches. Nueve obras en un acto\n. Catedra, 1999. ISBN: 9788437617459.\n\nTremlett, Giles.\nGhosts of Spain: Travels Through Spain and Its Silent Past\n. Walker Books, 2008. ISBN: 9780802716743.\n\nSee the\nReadings\nsection for a list of the readings used in class.\n\nThe movies must be seen before the class date when they will be discussed. Finally, it is important that you read\nEl Pais\nso that we can discuss the way contemporary Spaniards view their own and international politics. Reading\nEl Pais\nwill be an essential part of the subject.\n\nRequirements\n\nClass discussion is central to this course; therefore, you are expected to attend all classes. Any unexcused absence will lower your grade. If you are sick, or if you must be absent for any other reason, email me before class. Because class meets once a week, missing a class is equivalent to missing a week.\n\nYou will be asked to write short responses to questions based on the readings. One purpose of this exercise is to get your thoughts and reactions together for class discussion: Therefore, the responses must be handed-in when you come to class--not a few days or an hour later.\n\nBy Week 6, you will each begin to explore some aspect of contemporary Spain in greater depth. These topics can include anything that interests you: Film, educational reform, the problems engendered by having autonomous regions, fashion, music, religion, the new constitution, immigration, gender, government energy initiatives (wind, solar, wave), etc. Each week when noted on the syllabus, you will read two articles on your topic and write a two or three sentence summary. I will distribute samples to give you an idea of what to do. By the end of the semester you will have read quite a lot on your topic and, for your final project portfolio, you will write a report of what you have learned that focuses on the agents of change in contemporary Spain: How has democracy, the end of censorship, Spain's entry into the European Community, the Spanish economy, etc. transformed the area you are studying. We will also have oral presentations on the topic.\n\nThe most important work you do in this course is the construction of a portfolio that reflects research and your response to that research on a chosen topic. By the second half of the semester, part of each class will be devoted to your giving presentations in which you share insights, problems, and materials you have discovered as you do your research.\n\nYou will be using the internet and other sources as you build your portfolio. Much of the portfolio will be constructed around articles you find in various places. Your final report will reflect your own thoughts. If you are in doubt about whether or not to cite sources in your own writing: See me. It is crucial that you state the difference between your thoughts and someone else's.\n\nI will try to gear the course to each of your interests. Please let me know if you are having trouble during the semester or if there are specific language skills you would like to improve. This course should be an enjoyable one for you: It is varied in its materials and examines one of the only times in history when the transition from dictatorship--in this case a military / fascist dictatorship that endured almost 40 years--to democracy took place without bloodshed.\n\nGrading\n\nACTIVITIES\n\nPOINTS\n\nClass participation\n\nWritten responses\n\nOral presentation of portfolio\n\nPortfolio\n\n*Unless we are specifically doing a task that requires individual access to the internet, no electronic devices are allowed during class time.\n\n*Please read the following note about plagiarism. It is extremely important that you take care to acknowledge any idea that you learn from any source. It is better to be cautious. If you are not sure if you should cite something, please ask one of us.\n\nPlagiarism - the use of another's intellectual work without acknowledgement - is a serious offense. It is the policy of the Literature Faculty that students who plagiarize will receive an F in the subject, and that the instructor will forward the case to the Committee on Discipline. Full acknowledgement for all information obtained from sources outside the classroom must be clearly stated in all written work submitted and in all oral presentations, including images or texts in other media and for materials collected online. All ideas, arguments, and direct phrasings taken from someone else's work must be identified and properly footnoted. Quotations from other sources must be clearly marked as distinct from the student's own work. For further guidance on the proper forms of attribution, consult the style guides available in the\nWriting and Communication Center\n, review their page on avoiding plagiarism, review MIT's online\nAcademic Integrity Handbook\n.",
  "files": [
    {
      "category": "Assignment",
      "title": "21L.640 F15 Essay assignment on the book Castillos de Cartón",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-640j-the-new-spain-1977-present-fall-2015/b8af1a7d63413c7625b24fe6d662d7b5_MIT21L_640JF15_Essay_Cas.pdf",
      "content": "Hay que entregar en clase un ensayo corto de dos paginas sobre Castillos de carton.\n\n- Hay que utilizar \"Times 12 point font.\"\n- Hay que mantener margenes de 1\".\n- Hay que poner tu nombre y un titulo (esto te ayuda organizar tus ideas.)\n- El ensayo debe ser explicito: es decir, debes apoyar tus ideas en el texto\napoyandolas con ejemplos citados.\n- Cada parrafo debe tener un enfoque--una idea clave.\n\nEscoge UN tema:\n\n1. ¿Como se ve en la novela el contraste o conflicto entre la Espana tradicional y la nueva\nEspana de la Transicion? Hay que citar con claridad los ejemplos y cada parrafo debe\nestar ligado a la idea central.\n\n2. Analiza las conexiones entre arte, sexualidad y cambio social en la novela. Enfoca tu\nensayo en el analisis de uno o maximo dos de los personajes. Hay que citar con claridad\nlos ejemplos y cada parrafo debe estar ligado a la idea central.\n\n3. ¿Quien es el personaje mas interesante para ti? ¿Por que? Examina la evolucion del\npersonaje dentro de la novela. Hay que citar con claridad los ejemplos y cada parrafo\ndebe estar ligado a la idea central.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.640J / 21G.740J The New Spain:1977-Present\nFall 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "21L.640 F15 Final Portfolio Guidelines",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-640j-the-new-spain-1977-present-fall-2015/fb0eb58c75ef2232e55fff363a87a79d_MIT21L_640JF15_Portfolio.pdf",
      "content": "Final project: 21L.640J/21G.740J\n1. Determine your theme. Make sure it is reasonably limited.\n2. Each day when specified on the syllabus, submit a short summary--two to four\nsentences--of 3 bibliographical entries. You may have read something on-line, or a\nchapter in a book, etc.\n3. Make sure the bibliographical entry uses standard citation practices.\n4. Keep a copy of the articles or chapter you read.\nThe final presentation will have two parts: oral and written.\nOral Presentation: On Session 12, each student will prepare (in Spanish) a 7 min. oral\npresentation with 3-4 minutes for questions.\nThe Criteria for Evaluation for Oral Presentation\nStructure\nLogical organization pattern\nPowerful Introduction\nClear key message\nUse of transitions\nPowerful conclusion\nUse of evidence for support\nVisual Aids: Only use Powerpoint to enhance your oral presentation or to emphasize a\nfew facts. Do not include your narration in a Powerpoint presentation.\nWritten Project:\nThe written project is due two days after the last class. I hope that most of you will have\nit the last day of class--but two days afterwards is absolutely the last day it can be\nsubmitted. It will consist of a two to three page, double-spaced, 1\" margin summary of\nwhat you learned about your topic with reference to Post-Franco Spain. It should have a\npoint of view. It should consist of:\na) a title page\nb) your two-three page summary that should be constructed within the framework of\npost-Franco Spain.\nc) An annotated bibliography: bibliographies are organized alphabetically\naccording to author. You just need to cut and past the entries I have already\ncorrected into this list.\nd) If possible, a copy of the materials on which your annotations were based. Of\ncourse you cannot include a book, but if it is an article, simply include it.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.640J / 21G.740J The New Spain:1977-Present\nFall 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "21L.640 F15 Homework Assignment 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-640j-the-new-spain-1977-present-fall-2015/9b91bc398009dc98e34b836af04fea44_MIT21L_640JF15_HW_ses1.pdf",
      "content": "Homework #1\n\nPrimera Tarea: 21L.640/21G.740J\n\nIncluye tu nombre. Escribe todo a maquina.\n\nPara entregar en la proxima clase:\n\nA. Ghosts:\n\n1. Despues de leer la introduccion y los primeros dos capitulos, ¿Como se explica\nla cita de Lorca que encabeza el libro? Haz una lista de, por lo menos, 3\nejemplos. Piensen en los hechos y en las personas con quienes habla el autor.\n\n2. ¿Cual es la importancia de \"El Escorial?\" ¿El Valle de los Caidos?\" (dos frases\nsobre cada uno) Buscad imagenes de los dos. Venid a clase con unas imagenes\npara analizarlas.\n\n3. ¿Cual es la pregunta inquietante que motiva este estudio de Tremlett? (dos o tres\nfrases)\n\nB. Ibanez Martin:\n\n1. Escoge una idea interesante que debemos discutir en clase.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.640J / 21G.740J The New Spain:1977-Present\nFall 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "21L.640 F15 Homework Assignment 10",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-640j-the-new-spain-1977-present-fall-2015/9c785c3004bfc899128fa75755e66ebb_MIT21L_640JF15_HW_ses10.pdf",
      "content": "Homework #10\n\nHay que leer Pedrero: \"De la noche al alba\" y \"La noche que ilumina\".\n\nContesten las siguientes preguntas:\n\n\"De la noche al alba\"\n1. ¿Que es la situacion que plantea Pedrero aqui? ¿Es mas realista que la de las\notras \"noches\" que han leido? ¿Por que? (unas frases)\n\n\"La noche que ilumina\"\n\n2. Expliquen el titulo en el contexto del drama. (unas frases)\n\nHay que ver: Almodovar: \"Todo sobre mi madre\"\n\nEn la pelicula La Agrado dice: \"Una mujer es mas autentica cuanto mas se parece a\nlo que ha sonado de si misma.\" (A woman is authentic only in so far as she\nresembles her dream of herself.)\n\nEn el contexto de la pelicula, ¿que puede significar esto? Se puede hablar de\ncualquier personaje en tu respuesta. (Un parrafo corto.)\n\nHay que entregar tres citaciones para la bibliografia.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.640J / 21G.740J The New Spain:1977-Present\nFall 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "21L.640 F15 Homework Assignment 2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-640j-the-new-spain-1977-present-fall-2015/930b4c9f4215a880441f64ba3b7c70fa_MIT21L_640JF15_HW_ses2.pdf",
      "content": "Homework #2\n\nPara el sesion 3, hay que leer capitulo 3 de Tremlett y los primeros cinco capitulos\nde El dueno...(hasta la pagina 129 pero la novela empieza en la pagina 67) y\ncontestar las siguientes preguntas. No pido ni un ensayo ni un parrafo -solo una o\ndos frases: por favor, utiliza esta hoja y contesta las preguntas a maquina....\n\nCapitulo I\n1. ¿Como es la relacion entre el narrador y Ramon? (diferencias politicas, etc.)\nunas frases...\n\n2. ¿Que significa \"un impulso de vanidad invencible\" en el contexto del caracter\ndel protagonista?\n\n3. ¿Que secreto guardaba?\n\n4. ¿Quien as Ataulfo Ramiro? Explica su relacion al narrador. (unas frases)\n\n5. ¿Que significa la maquina de escribir para el narrador? (una frase)\n\n6. p. 79 \"Aquellos fueron tiempos.\" Explica. (una frase)\n\nCapitulo II\n1. ¿Como se va elaborando el caracter del narrador? p. 89 (unas frases)\n2. p. 86--explica la escena con el telefono/manifestaciones. (unas frases)\n3. ¿Que paso en la casa de Ataulfo? (una frase)\n\nCapitulo III\n1. Un ejemplo del humor en la escena en Lhardy.\n2. Explica \"parece mentira....\" p. 99 (una frase)\n\nCapitulo IV\n1. Explica la reaccion del narrador a los bares. p. 103 (una frase)\n2. ¿Como es la vida de Ataulfo? (una frase)\n3. ¿Por que no va clase? ¿Como es la Facultad? (unas frases)\n4. ¿Cual es la confesion de Ataulfo? (una frase)\n5.\nCap. V.\n6. ¿Por que no puede guardar secretos el narrador? ¿Cuanto tiempo guardaba el\nsecreto? Dos frases.\n\nUna idea interesante de capitulo 3 de Tremlett es:\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.640J / 21G.740J The New Spain:1977-Present\nFall 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "21L.640 F15 Homework Assignment 3",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-640j-the-new-spain-1977-present-fall-2015/35ab1e7088b899affe177ee4ebecce61_MIT21L_640JF15_HW_ses3.pdf",
      "content": "Homework #3\nTercera tarea:\n\nPara el sesion 4, vamos a terminar la discuson de El dueno del secreto. Por favor,\ncontesten las siguientes preguntas--brevemente....Para entregar en clase.\n\nSe puede imprimir esta pagina y dejar espacio para contestar directamente en esta hoja.\n\nTambien: Hay que leer Tremlett, capitulo 4.\n\nCap. VI\n\n1. ¿Cual es el secreto de Ataulfo? (p. 135) Una frase.\n\nCap. VII\n\n1. ¿Como son los suenos del narrador? (p. 139) Una o dos frases.\n2. ¿Por que es tan dificil escribirle a la novia? (p. 143) Una frase.\n3. ¿Como es la mujer a quien le lleva una carta?\n\nCap. VIII\n\n1. ¿Por que tiene tanto miedo el narrador en este capitulo? Una frase.\n\nCap. IX\n1. ¿Como es el desenlace de la novela? ¿Que anora el narrador?\n¿La vida diaria del narrador? Unas frases.\n2. ¿Como son los anos 70? (p. 168) Una frase.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.640J / 21G.740J The New Spain:1977-Present\nFall 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "21L.640 F15 Homework Assignment 4",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-640j-the-new-spain-1977-present-fall-2015/50f68d270cb5f1fee87998d8a99f7e0a_MIT21L_640JF15_HW_ses4.pdf",
      "content": "Homework #4\nPara el sesion 5:\n--Hay que ver la pelicula \"¿Que he hecho para merecer esto?\" y contester las\npreguntas abajo.\n\nAl final, hay que poner una lista de 3 temas que son de interes para ti como temas\npara examinar por el porfolio final.\n\n--Hay que leer el capitulo sobre Almodovar \"Introduccion: El Deseo\" S.A.\n\n--hay que repasar \"La nueva constitucion\"\n\nPreguntas:\n\n1. ¿Quien es tu character favorito? ¿por que? (unas frases)\n\n2. Haz una lista de 5 problemas sociales que aparecen en la pelicula.\n\n3. Una escena chistosa es......\n\n4. ¿Que tiene que ver esta pelicula con la transicion? ¿Que anade a lo que sabemos\npor la lectura de Tremlett? (unas frases: piensa en la estetica y el contenido)\n\nTres temas que me gustaria investigar son:\n(vas a escoger uno..pero me gustaria ayudaros escoger algo que puedes hacer\nen unos meses)\n\n1.\n2.\n3.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.640J / 21G.740J The New Spain:1977-Present\nFall 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "21L.640 F15 Homework Assignment 5",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-640j-the-new-spain-1977-present-fall-2015/8725261a5c7fe0364d2771a1ff822cad_MIT21L_640JF15_HW_ses5.pdf",
      "content": "Homework #5\n\nPara el sesion 6:\n\nHay que leer Tremlett, capitulo 7.\n\nHay que leer Castillos de carton hasta la pag. 87 y contestar las siguientes preguntas:\nsolo unas frases para cada pregunta.\n\n1. ¿Quienes son los personajes principales?\n2. ¿Que caracteristicas de la educacion artistica de Maria Jose (en el\nbachillerato) reflejaron la educacion limitada de la epoca franquista?\n3. Tanto Maria Jose como Jaime tiene sus sujetos predilectos para la pintura.\n¿cuales son?\n4. ¿Por que le llaman a Marcos Molina Schultz, \"el arcangel?\"\n5. ¿Como es el padre de Jaime? ¿Que importancia tiene?\n6. ¿Hay elementos en la novela que senalan una Espana que ha cambiado? ¿Hay\nelementos tradicionales?\n7. Describe la personalidad y la figura de cada protagonista.\n8. Describe el fracaso sexual en la pag. 63.\n9. Busca referencias al numero 3.\n10. Entre la pag. 67 y 87 se describe varios actos sexuales. ¿Cuales son las\nexperiencias de cada uno?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.640J / 21G.740J The New Spain:1977-Present\nFall 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "21L.640 F15 Homework Assignment 6",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-640j-the-new-spain-1977-present-fall-2015/a53f98c0c788cd7740c9b674833fc324_MIT21L_640JF15_HW_ses6.pdf",
      "content": "Homework #6\nPara el sesion 7:\n\nTermina Castillos de carton y ve la pelicula...\"Mujeres....\"\n\nContesta las siguientes preguntas:\n\nCastillos de carton:\n\n1. Explica las expresiones sobre los numeros: (\"las caricias de 4 manos es\nmejor\" \"El tres es un numero par\" \"Despues cuando el 3 se vengo de\nnosotros con su indivisible crueldad de numero impar...\" )\n\n2. ¿Como es el padre de Marcos?\n\n3. ¿Es Marcos homosexual?\n\n4. Explica: \"estos dos amigos tuyos son maricones\"...p. 100\n\n5. Explica: \"Los dos eran mi novia\" (pag. 106-107)\n\n6. ¿Por que es la fiesta elemento clave en la novela?\n\n7. ¿Que significa lo siguiente? \"Hacia ya meses que mi actitud tenia menos que\nver con las etapas de un noviazgo que con las fases de una desercion\nsistematica.\" p. 105.\n\nMujeres: ¿Cual es la escena en la pelicula que mas te gusta?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.640J / 21G.740J The New Spain:1977-Present\nFall 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "21L.640 F15 Homework Assignment 7",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-640j-the-new-spain-1977-present-fall-2015/f799509df49a20140b31a1a4a34cfc4b_MIT21L_640JF15_HW_ses7.pdf",
      "content": "Homework #7\n\nPara el sesion 8:\n\nTermina la lectura de Castillos de carton\" Lee con cuidado pag. 145 hasta el\nfinal.\n\nPara entregar:\n\n1. Entrega 3 entradas bibliograficas. Para cada una haz un resumen de 2 o 3\nfrases.\n\n2. Van a leer el drama \"La llamada de Lauren\" en el libro de Paloma Pedrero.\nEn la pagina 95 Pedro dice: \"A veces es tan duro ser una persona normal. Quiero\ndecir que a veces uno tiene sensaciones o necesidades...inadmisibles.\" Comenta:\n¿que significa? (unas frases)\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.640J / 21G.740J The New Spain:1977-Present\nFall 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "21L.640 F15 A Guide to Reading the Book  El dueño del secreto",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-640j-the-new-spain-1977-present-fall-2015/5d139fa68eb44e3484b5d51b1a0b8069_MIT21L_640JF15_du.pdf",
      "content": "Personajes:\n\nEl narrador: un joven de 18 anos acaba de llegar a Madrid para estudiar periodismo.\nEs muy ingenuo: viene de un pueblo y no conoce la vida urbana.\n\nAtaulfo Ramiro: un personaje muy de la epoca: bombastico, presumido, hablador.\nAtaulfo le invita al narrador a formar parte de su complot de derrumbar el regimen\nfranquista. Como el narrador es muy ingenuo, ve a Ataulfo como una persona de\nsuma importancia politica. Claro que Ataulfo le pide que guarde el secreto de la\nconspiracion para terminar la dictadura.\n\nRamon Tovar: un amigo del narrador que viene a Madrid y que vive con el. Como el\nguardar secretos es imposible para el narrador, le explica la conspiracion de Ataulfo\na Ramon.\n\nLa novela es una refleccion, 19 anos despues, de la vida, las actitudes, los\nacontecimientos, de sus primeros meses en Madrid, y de la culpa que siente por\nhaber compartido el secreto con su amigo. El se cree responsable por del fracaso de\nla conspiracion.\n\n_________________________________________________________________________________________________\nComo la novela es en primera persona, conocemos el mundo de Madrid, 1974, por\nojos de un chico de provincia, que anora la muerte de Franco. Los detalles: la\nuniversidad, la falta de comida, la relacion con su madre son importantes porque\nsubrayan cualidades de la epoca.\n\nCuando leen, intenten identificar aspectos curiosos de la vida madrilena de aquel\nentonces.\n\n¡La novela es chistosa!\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.640J / 21G.740J The New Spain:1977-Present\nFall 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "21L.640 F15 Questions for the Book Juego de noche",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-640j-the-new-spain-1977-present-fall-2015/5d80f27f8440b85d6e12b478658d4e0e_MIT21L_640JF15_Juego.pdf",
      "content": "Cuando leen \"Esta noche en el parque\" y \"La noche dividida\" piensen en lo\nsiguiente:\n\n1. Cuando Fernando dice en la pag. 156 \"No. Te voy a dar lo tyuo primero. Es\nverdad, a eso tienes derecho. Sere un cobarde pero no soy ingrato. No sabia que la\notra noche tu no habias llegado\" ¿esta hablando en serio? ¿Como cambia la postura\nde Fernando a partir de este momento del dialogo?\n\n2. En la pagina 165 Adolfo dice \"Le puedo asegurar que es una verdadera\nganga...irian estupendamente.\" Expliquen este monologo.\n\n3. ¿Que pasa al final de \"La noche dividida\"?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.640J / 21G.740J The New Spain:1977-Present\nFall 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "21L.640 F15 Questions for the Movie Todo sobre mi madre",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-640j-the-new-spain-1977-present-fall-2015/2f2195df4f74cfa47b8a45f6b596dd3b_MIT21L_640JF15_Todo.pdf",
      "content": "1. En la pelicula \"Todo sobre mi madre\" hay muchas expresiones de amor.\nPresten atencion a los personajes y sus vinculos carinosos. ¿Son generosos?\n¿En que sentido?\n\n2. Presten atencion a los personajes y sus trayectorias vitales:\n\nManuela, Agrado, Rosa, Lola, Huma, Nina. ¿Que significa la amistad en esta\npelicula? ¿el dolor?\n\n3. Piensen en las trasvesties de \"Una mala noche...\" ¿Que cualidades comparten con\n\ncon Agrado y Lola?\n\n4. En su monologo, la Agrado habla de los sacrificios que ha hecho para ser la\n\npersona que sonaba ser. ¿Como se transforman otros personajes de la pelicula\n\ntratando de constrir sus identidades?\n\n5. En las otras peliculas de Almodovar que hemos visto, Madrid es un personaje\nmas. En esta pelicula, es fundamentalmente Barcelona. ¿Como aparece el espacio\n\nurbano en esta pelicula?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.640J / 21G.740J The New Spain:1977-Present\nFall 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "21L.640F15 Framing Questions for the Book Castillos de Cartón from pages 66-116",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-640j-the-new-spain-1977-present-fall-2015/652aa7f77177ddb3e205ca0d8e198007_MIT21L_640JF15_Cas2.pdf",
      "content": "1. Analiza las expresiones sobre los numeros: (\"las caricias de 4 manos es\nmejor\" \"El tres es un numero par\" \"Despues cuando el 3 se vengo de\nnosotros con su indivisible crueldad de numero impar...\" )\n2. ¿Como es el padre de Marcos?\n3. ¿Es Marcos homosexual?\n4. Explica: \"estos dos amigos tuyos son maricones\"...p. 100\n5. Explica: \"Los dos eran mi novia\" (pag. 106-107)\n6. ¿Por que es la fiesta elemento clave en la novela?\n7. ¿Que significa lo siguiente? \"Hacia ya meses que mi actitud tenia menos que\nver con las etapas de un noviazgo que con las fases de una desercion\nsistematica.\" p. 105.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.640J / 21G.740J The New Spain:1977-Present\nFall 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "21L.640F15 Framing Questions for the Book Castillos de Cartón through page 65",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-640j-the-new-spain-1977-present-fall-2015/b857ecfdf07438931b9c611cc3021486_MIT21L_640JF15_Cas1.pdf",
      "content": "1. ¿Quienes son los personajes principales?\n2. ¿Que caracteristicas de la educacion artistica de Maria Jose (en el\nbachillerato) reflejaron la educacion limitada de la epoca franquista?\n3. Tanto Maria Jose como Jaime tiene sus sujetos predilectos para la pintura.\n¿cuales son?\n4. ¿Por que le llaman a Marcos Molina Schultz, \"el arcangel?\"\n5. ¿Como es el padre de Jaime? ¿Que importancia tiene?\n6. ¿Hay elementos en la novela que senalan una Espana que ha cambiado? ¿Hay\nelementos tradicionales?\n7. Describe la personalidad y la figura de cada protagonista.\n8. Describe el fracaso sexual en la pag. 63.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.640J / 21G.740J The New Spain:1977-Present\nFall 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}