{
  "course_name": "The Business of Politics: A View of Latin America",
  "course_description": "This class looks at the birth and international expansion of an American industry of political marketing, with a special emphasis on Latin America. We will focus our attention on the cultural processes, sociopolitical contexts and moral utopias that shape the practice of political marketing in the U.S. and in different Latin American countries. By looking at the debates and expert practices at the core of the business of politics, we will explore how the “universal” concept of democracy is interpreted and reworked as it travels through space and time. Specifically, we will study how different groups experimenting with political marketing in different cultural contexts understand the role of citizens in a democracy.",
  "topics": [
    "Social Science",
    "Anthropology",
    "Social Anthropology",
    "Political Science",
    "Society",
    "Latin and Caribbean Studies",
    "Social Science",
    "Anthropology",
    "Social Anthropology",
    "Political Science",
    "Society",
    "Latin and Caribbean Studies"
  ],
  "syllabus_content": "Course Meeting Times\n\nSeminars: 2 sessions / week, 1.5 hours / session\n\nPrerequisites\n\nThere are no prerequisites for this course.\n\nClass Description\n\nTeams of political consultants deploy sophisticated marketing techniques to carefully manage elections worldwide. Although today political marketing is indispensable to manage campaigns around the world, this was not always the case. Political consulting was invented in the United States in the 1930s, as new media (radio, film and TV) became more entrenched in American daily life. When a wave of democratization and liberal reformation swept the world in the 1970s and 1980s, and television consumption dramatically increased worldwide, American political consultants found new and exciting business opportunities in these contexts of political reform, especially in Latin America. The introduction of an American-inspired form of doing politics to the Latin American context fostered complex political processes that challenged straightforward definitions of what democracy and civic participation meant.\n\nIn this class, we will analyze the birth and international spread of an American industry of political marketing from an anthropological perspective. For this purpose, we will focus our attention on the cultural processes, sociopolitical contexts and moral utopias that shape the practice of political marketing in the U.S. and abroad. By focusing on the debates and expert practices at the core of the business of politics, we will explore how the \"universal\" concept of democracy is interpreted and reworked as it travels through space and time. Specifically, we will study how different groups experimenting with political marketing in different cultural contexts understand the role of citizens in a democracy.\n\nObjectives\n\nIn this class students will:\n\nIdentify the main features of liberalism and liberalization in Latin America.\n\nLearn key debates about public formation and civic engagement in the age of mass media.\n\nAcquire research skills to relate specific ethnographic material to broader political and cultural processes.\n\nMethodology\n\nIn this class, we will combine a diversity of sources in order to study the emergence and establishment of political marketing as a global industry. We will explore journalistic accounts, memoirs, documentaries and academic sources (mainly from anthropology, political sociology and political science). We will analyze these materials as objects produced within situated cultural contexts. In this way, we will pay close attention to the geopolitical conditions, legal frameworks and local processes that inform the production of these objects.\n\nAssignments\n\nThe students will develop a semester long research project that will be divided into different tasks throughout the semester. Students can work on the project\nindividually or in pairs\n.\n\nGoal:\nYou will pretend to be the international political consultant for a presidential political campaign in a\nLatin American country of your choice.\nThe goal of the project is to design a plausible campaign strategy for the political context you have chosen. The last week of class you will present your results to the rest of the class.\n\nFor further detail, please see the\nAssignments\nsection.\n\nGrading Policy\n\nACTIVITIES\n\nPOINTS\n\nTask 1: Written report - Knowing the rules\n\nTask 2: Written report - Political histories\n\nTask 3: Written report - Media platforms and political attitudes\n\nTask 4: Campaign strategy report and presentation\n\nTask 5: Final report\n\nParticipation in class\n\nStudent Responsibilities\n\nStudents must come to class and participate actively in class discussions. If you miss a class, it is your responsibility to catch-up. It is your responsibility to inform the instructor of any missed classes or assignments\n\nFor all research reports, students must cite research sources using the\nChicago Manual of Style\n.\n\nIf you miss a deadline without a valid excuse (religious observance, illness, family calamity, circumstances beyond your control), a penalty of 5 points will be applied for every day past the deadline. For example, if the original assignment was worth 20 points, the day after the deadline your work will be worth a maximum of 15 points.\n\nIf you need specific accommodations in order to complete your work successfully, please inform the instructor at the beginning of the semester.\n\nReading Materials\n\nThe required books for this course are:\n\nDezalay, Yves, and Bryant G. Garth.\nThe Internationalization of Palace Wars: Lawyers, Economists, and the Contest to Transform Latin American States\n. University of Chicago Press, 2002. ISBN: 9780226144269. [Preview with\nGoogle Books\n]\n\nHarding, James.\nAlpha Dogs: The Americans who Turned Political Spin into a Global Business\n. Farrar, Strauss and Giroux, 2009. ISBN: 9780374531751.\n\nRemaining readings are detailed in the\nReadings\nsection.",
  "files": [
    {
      "category": "Assignment",
      "title": "21A.506S14 The Business of Politics - Assignments: Task 4 Student Example",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-506-the-business-of-politics-a-view-of-latin-america-spring-2014/09254af18fec1951702893a8696e4efa_MIT21A_506S14_Task4Studnt.pdf",
      "content": "A eleicao presidencial brasileira\nBrazilian Presidential Election\n\nA brief history of Brazil\n1500 -Brazil is \"discovered\" by the Portuguese\n1822 -Brazil declares independence form Portugal (official treaty in 1825)\n1888 -Slavery is abolished\n1889 -Angry landowners overthrow monarchy\n\n-Found first Republican government,\n1930 -Presidential candidate Vargas seizes power through military coup\n1945 -Vargas dictatorship ended by another coup\n1951 -Vargas elected president\n(linked to attempted assassination of rival, called to resign, commits suicide)\n1960 -Brasilia is completed, built from scratch to be Brazil's capital\n1964 -Military overthrows president Goulart and seizes power\n\n(a leftist Vargas man) after his terrible attempts to impose socialist reforms.\n\nMilitary rule to present\n1964 marks start of 20 year military dictatorship\n1974 -Military allows limited political activity and elections.\n1985 -MILITARY DICTATORSHIP OFFICIALLY ENDS, allow peaceful transition to\ndemocracy\nFirst civilian president in 21 years elected under the electoral college system\nset up by the military.\n1988 -New Constitution ratified\n1997 - Constitution changed to allow president to run for re-election.\n2006 October - President Lula is re-elected.\n2010 October - Dilma Rousseff, of President Lula's Workers' Party, wins second\nround to become Brazil's first female president.\n\nos partidos politicos\n\nSeats in Federal Senate: 12 (#2)\nSeats in Chamber of Deputies: 86 (#1)\nLargest and most important left wing parties in Latin America\nFounded in 1980 to oppose military dictatorship\nSupports bigger role for state enterprises and reducing privitaizaiton\nof sectors like banking, oil and gas.\nBitter rival with PSDB\n\nO Partido dos Trabalhadores\nWorkers' Party\n\nPartido da Social Democracia Brasileira\n\nBrazilian Social Democratic Party\nSeats in Federal Senate: 10 (#3)\nSeats in Chamber of Deputies: 51 (#3)\nFounded in opposition to military dictatorship in early '80s from same\nmovement as the PT\nAfter end of dictatorship they broke off to form own party due to\nideological disagreements\nToday, PSDB supports privatization of industry and public sector pay\ncuts\nVIRTUALLY NO COOPERATION BETWEEN THE PSDB AND THE PT IN\nGOVERNMENT.\n\nPartido do Movimento Democratico Brasileiro\nBrazilian Democratic Movement Party\nSeats in Federal Senate: 20 (#1)\nSeats in Chamber of Deputies: 78 (#2)\nModerate central position\nBegan from democratization movement of '70s\nHas since moderated its policies\nSome consider it more center-right than center-left\n\nRecent Presidents (and main opponent)\n2010-Present (Dilma Rouseff) beat out\n\n(Jose Serra)\n1994-2002 (Cardoso) beat out (Lula 1994)\n\n(Lula 1998)\n\n2002-2010 (Lula) beat out (Jose Serra, 2002)\n(Geraldo Alckmin, 2006)\n1989- Itmar Franco takes over as president (Collor's VP)\n\n(Collor forced to resign over corruption scandal)\n\n1989- (Collor) beat out (Lula)\nFirst Direct Election since\nMilitary dictatorship\n\nPRN\n\nThis image appears courtesy of\nAgencia Brasil/Palacio do Planalto.\nLicense CC BY.\n\nVoting in Brasil\nPresidential elections held every 4 years\nPresident must gain total majority (>50%) of votes to win 1st round\nIf no one wins 1st round, top two candidates go to 2nd round of\nvoting\nVoting is mandatory for citizens between ages 18-70\nOptional for 16 and 17 year olds\nThose who do not vote may have trouble obtaining bank accounts,\ncredit, or passports.\nSince 2000, all voting is done via electronic machines\n\nos candidatos\n\nDilma Rousseff (PT, Worker's Party)\nCurrent President (officially nominated as PT candidate yesterday)\n-\nElected president in 2010\n-\nfirst ever elected government position\n-\nHandpicked by highly loved former\npresident Lula, also PT\n-\nClaims goals to be eradication of\nextreme poverty and reduced\nilliteracy rates\n\nThis image appears courtesy of\nAgencia Brasil. License CC BY.\n\nMore on Dilma -- poverty\nIncreased spending on professional training, child care, low-cost\nloans\nMore than 6000 doctors deployed to countryside & underserved\nareas\nPublic housing drive has built 1.4 million homes and has 1.6 million\nunder construction\nStrengthened Bolsa Familia, gives families in extreme poverty of at\nleast 70 reais a month to keep children healthy & in school\n13.8 million currently enrolled, expected to add 700,000 more\nOnly country in BRICS to achieve reduction in inequality\n(Brazil fell 5.08 points (good), Russia & China rose 2.62 and 2.68\npoints)\n\nAt what Cost?\nRousseff chose to focus on poverty instead of tax policy, poor\ninfrastructure or economic growth.\nGDP expanded 1.9% during first 2 years while it averages 4%\nannually during Lula's 8 years\nWill it pay off?\n\nAecio Neves (PSDB)\nEconomist, politician, form president of PSDB\nCurrent member of Senate\nFormer governor of Minas Gerais (won by record 57\n% of votes)\nTook Minas Gerais out of $270m debt after 1 term\nNow considered best managed state\nPSDB MG on flickr. License CC BY.\nThis image appears courtesy of\n\nAs governor, took 45% salary cut, capped public-sector pay\nand left 3,000 of those jobs unfilled instead of using them to\nreward allies\nSince the PT took power in 2002, the number of federal ministries has\nrisen from 26 to 40.\nFederal payroll grew relentlessly, Rouseff called a halt to it in 2011.\n\"Spending Less on government & more on citizens\"\n78% approval rate as president\nArgued slashing electricity bills would stifle investment\nSaid she cares more about ordinary voters than business\nArgues she is merely \"administering poverty\", not working to\nend it.\nIncreased federal handouts to poorest Brazilians last month, has\nimproved the lives of Brazil's poorest\nWiped out $270m worth of debt in 1 term as governor of Minas\nGerais\nPromised to boost growth: has not\nGDP grew by .9% last year vs 2.7% in 2011, Inflation at\n6%\n. Now rated as best managed state. Reduced\nspending on public investment\n22 million emerged from extreme poverty during 3 yrs in office,\n<3% live remain World Bank Considers\nVS\nThis image appears courtesy of\nPSDB MG on flickr. License CC BY. This image appears courtesy of\nAgencia Brasil. License CC BY.\n\nWhat about an upset of the\nPT/PDSB rivalry that has been\ndominating Brazilian politics for the\npast 20 years?\n\nCampos-Marina Ticket Announced\nPSB (Brazilian Socialist Party) just announced Campos will run with VP\nMarina Silva, who was going to run herself but her new party was not\napproved in time.\nThis image appears courtesy of Agencia Brasil. License CC BY.\n\nEduardo Campos\nHead of Brazilian Socialist Party\nAdopting pro-market proposals in bid to\nunseat Rousseff\nSays independent central bank will\nencourage investors and return Brazil to\nrapid growth\nSays state run oil firm Petrobras needs\noverhaul, linked to recent corruption\nscandal\n\nThis image appears courtesy of Michael Renner\non flickr. License CC BY-NC-SA.\n\nMarina Silva\nRecently left the PT\nBrazil's most successful environmental campaigner\nRan in 2010 for president\nRemains popular today as symbol of clean, green politics against\ncorruption and waste that sparked huge street protests last year.\nTried to establish own party but her nationwide petition was\ncontroversially struck down by the electoral court.\nHas 10 siblings and is from a poor rubber-tappers family, worked as a\nmaid before college and becoming involved in trade unions\nServed in Lula's administration\n\nThis image appears courtesy of Talita Oliveira\non flickr. License CC BY.\n\n\"After three years, Brazil has come\nto a halt, the Brazilian people have\nlost hope and the world has\nbecome disenchanted with us.\"\n-Campos\n\n\"This is a historic re-alignment,\nburying once and for all the old\nrepublic\"\n-Silva\n\nThis image appears courtesy of Lou Gold\non flickr. License CC BY-NC.\n\nRecent Protests\nMost triggered by World Cup occurring this June and the upcoming\n2016 Olympics in Rio\n\n2013 Confederations Cup Riots\nOver 100 Brazilian cities and cities with Brazilian diasporas around the globe\n- Increases in bus, train and metro fare in some major cities\n- Multiple issues regarding infrastructure, education and health care among\nother public services\n- High cost of living\n- Increasing government funding of major sports events\n- Feeling of alienation from government decisions\n- Multiple scandals of corruption, embezzlement and overbilling in the\ngovernment\n- Multiple reports of abuse of special benefits conceded to Brazilian politicians\n\nThis image appears courtesy of Agencia Brasil. License CC BY.\n\nMEDIA CONSUMPTION\n\nPrint\nDespite the country's 10% illiteracy rate...\nNearly HALF the population read newspapers at least weekly\n(highest rates concentrated in the South)\nNewspaper circulation continues to grow, up 1.8% in 2012 alone\n25-39 year olds are largest age group to read newspaper\n16-24 year olds prefer magazines to newspaper\n61% of magazine readers are women from the top two classes\n31% of Brazilians have read a magazine in the past week, 57% of\nwhich consumed 5-6 other sources of media as well\n\nRadio\n80% of Brazilians claim to listen to radio\n70% (largely middle-lower classes) listen at home\nElectoral Laws\nRadio networks must carry two 50 minute time slots for candidates,\ntime proportioned based on seats in Congress\nEach party allowed an additional six 30-second ads per day\nOn Aug 20-22 of 2010, 42.9% of people claimed to be\nlistening/watching to broadcasted election campaigns (Census)\n\nTV\nFree Broadcast TV watched by 83% of the entire population\nOnly 10% (largely the upper class) watch paid TV\nBrazilians watched 23 more minutes of TV in 2012 than 2011\nAverage Brazilian watches 5 hours and 32 minute PER DAY\nEntire TV audience of around 53.4 milllion\n\nTelephones\nOnly around 23 working telephones per 100 people\n54.4% of households have fixed telephone lines\nOut of those who do not have fixed lines, 59.4% say they use\nmobile phones instead\nBrazil accounts for 60% of the entire Latin American mobile phone\nmarket\n\nInternet\nBrazil has 94 million internet users, as of 2012\n47% of Brazilians use the internet as their 1st source of information\n(the world average is 45%)\nBrazilians average 27 hours per month online (24.7 is world avg)\n78% of young people (ages 20-34) access the internet(of these young people, 94%\nuse email, 87% use for research/news, 80% shop)\nWhile only 45% of ages above 34 use the internet\nOnly 10% of rural households have internet access (vs 44% in urban)\nYoung people in urban areas w/o internet use public internet\nOnly 6% of the lowest 2 classes have internet access\n97% of the highest class has internet access\nOf overall internet users in Brazil, 79% are using social media for 39% of their online\ntime\n65 million users on facebook (2nd only to US) & 2nd largest YouTube market\n\n9% of Brazilian households do not\nhave access to any type of\ntelecommunication service, largely\nthose in extreme poverty\n\nGoverno Pra Quem?\n\nMetro in Brazil\nSao Paulo: 886 million annual riders, 3.5 million daily\nRio de Janeiro: 405 million annually, 1.1 million daily\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21A.506 The Business of Politics: A View of Latin America\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "21A.506S14 The Business of Politics - Assignments: Task 5 Student Example",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-506-the-business-of-politics-a-view-of-latin-america-spring-2014/d666c3953a0643eb48d078186491a2ac_MIT21A_506S14_Task5Studnt.pdf",
      "content": "21A.506\nTask 5- final campaign strategy\n\nCampaign Strategy for Brazilian 2014 Presidential elections- Campos/Silva ticket\n\nMy campaign strategy is for Eduardo Campos, who will be running for president in\nthe Brazilian elections this October. The candidate is part of the Brazilian Socialist Party,\nnot to be confused with the Brazilian Social Democracy party, and has recently announced\nhis vice-presidential nomination for the famous politician and environmentalist, Marina\nSilva. Marina Silva gives an otherwise unlikely winner a fighting chance to upset the two\nparties that have been dominating Brazilian politics for the past two decades. I will review\nthe recent political landscape in Brazil and why Brazilians will be looking for a change in\nthe recent political dynamic through voting on the Campos/Silva ticket. I will then outline\nthe target population who my campaign for Campos/Silva will be targeting, why this is the\nmost effective group to target and the strategy that will be used to reach and effect the\nvotes of the most people possible.\n\nTo understand current Brazilian politics, we must first look at the political trends\nthat have followed the reinstatement of Democracy in Brazil in the 80's after the end of 20\nyears of military dictatorship. In the early '80s, the military government, noticing\nincreasing tension in the citizens for greater freedom, began a slow and controlled process\nof democratization. In 1989, Fernando Collor was the first to be elected president under\nthe new Constitution. After a corruption scandal, his vice president, a member of the\nBrazilian Democratic Movement Party, took over. In the next election, a member of the\nSocial Democracy Party, Fernando Cardoso, was elected, thus ushering in a new era of\nMIT Student\n\n21A.506\nTask 5- final campaign strategy\nBrazilian politics. For the next 20 years, the top contenders in the presidential elections\nwould be either from the Social Democracy Party or the Workers' Party, with the Worke\n\nrs'\nParty being in power since 2002. Now, what does this mean for Eduardo Campos, who's\nparty is one of the top 5 in Congress but one that has never successfully won a presidential\nrace? Well, because of the recent unrest in Brazil over controversy surrounding the\ncountry's preparation for multiple world events, it means a chance. The people are fed up\nwith a government that seems to neither be helping economic growth or listening to its\npeoples' concerns. They are instead focused on looking good for the world, and failing to\ndo that or appease the peoples' demands. The Workers' Party is currently alienating the\nvery group of people they were formed primarily for, the middle class workers of Brazil's\ncities.\n\nThat's not to say Campos will have an easy time winning this upcoming election; if\nhe does manage to win it isn't likely to be in the first round. The current president, Dilma\nRouseff, who is running for reelection, still has a high chance of being reelected. Despite\nmany citizens' feelings of alienation, Rouseff has made many administrative priorities that\nmake here extremely popular with certain groups of people, namely the poor. During her\nfew years as president, Rouseff has managed to decrease extreme poverty to below 3%,\nmaking it the only country in the BRICS group (Brazil, Russia, India, China, South Africa) to\ndecrease inequality, dropping 5.08 points while most countries went up. Dilma has largely\nstrengthened the Bolsa Familia program.[3] According to the world bank, the program\nreaches 11 million families and over 46 million of the countries lowest earning people,\ngiving them 70 reais (around $35 US dollars) per child if they keep them in school and with\nregular checkups.[3] The money from this program goes to the reach the poorest 40% of\nMIT Student\n\n21A.506\nTask 5- final campaign strategy\nthe population. Until recently, the poorest 60 percent of the population earne\n\nd only 4% of\nthe national income. According to the World Bank, between 1995 and 2004, the inequality\nin Brazil fell by almost 5% and is continuing to fall as Bolsa Familia is strengthened. This\nprogram helps a LOT of Brazilian, which translates to a LOT of Brazilians who will almost\ndefinitely be voting to reelect Rouseff to ensure that this money that they so dearly need\nkeeps coming, especially with her recent increases in the payments to \"account for\ninflation\" right before campaign season.[1] Many of the families live in rural areas in the\nnorthern regions of Brazil. They are unaffected by most of the issues Brazilian's have with\nthe central government; to them, what is going on with protestors in the cities and how the\neconomy is not growing is an afterthought that does not directly affect their daily lives.\nMoney does, which is a reason my campaign will not be focused on winning these votes,\nespecially not those of poor families in rural areas.\n\nThe approval Rouseff is gaining through one sector of the population is gaining her\ncriticism from others. Some, including the current Social Democracy Party presidential\ncandidate, Aecio Neves, say that Rouseff is merely administering poverty, not working to fix\nit. Many are suspicious that actions like this are effectively being used to buy the votes of\nthe poor. With the election approaching and popularity in the polls dropping, Rouseff\nseems to be feeling the pressure to boost these social programs to give herself a boost\ncoming in votes. According the Wall Street Journal, the Brazilian government is\nconsidering increasing taxes on imports and automobiles in order to fund a pay boost in\nsocial programs, which some say is a ploy to combat her falling popularity. Despite the\nsuccess of these programs, Brazil's economic growth is slowing rapidly and even increasing\ntaxes hasn't been able to keep up with increased governmental spending.\nMIT Student\n\n21A.506\nTask 5- final campaign strategy\n\nIf the people of Brazil were only worried about a stronger economoy, Social\nDemocracy candidate Aecio Neves would be the clear choice. Currently a member of t\n\nhe\nSenate and former president of his party, as governor of Minas Gerais he was able to take\nthe state out of $270 million dollars worth of debt in 1 term. Minas Gerais is now\nconsidered the best managed state in Brazil. As governor, he took a 45% salary cut, capped\npublic sector pay and left 3,000 public jobs unfilled instead of using them to reward allies.\nThis is in stark contrast to the increased federal payroll and federal positions that have\noccurred during Rouseff's presidency.[10] Neves argues that the political cronyism and\ncorruption that has been a large part of the federal government needs to stop by hiring civil\nservants based on merit instead of political alliance. Although he is likely a well suited\ncandidate, 7 out of 10 Brazilians have never heard of him. Those who have criticize the fact\nthat his party has a tendency of selling off public companies to private investors and he\nwould likely cut spending on programs like Bolsa Familia. There is also a sentiment in\nBrazil similar to that in America about Republicans and Democrats, and the people are\ntired of the two party politics that have been dominating Brazil. So the question is, how\nwill our campaign capitalize on that sentiment and what recent events in Brazil might\nprompt the people to abandon the status quo.\nIf we look at recent news, most of the conflict recently in Brazil surrounds\ncontroversy regarding this summer's World Cup and the 2016 Olympic Games, both to be\nhosted in Brazil. There is currently a lot of social unrest in the country as people feel\nalienated by the government, who seems to be spending an awful lot of money on these\nworld events the people feel could better be invested in improving Brazil. Widespread\nprotests started last summer, sparked by increased public transportation fees, a move the\nMIT Student\n\n21A.506\nTask 5- final campaign strategy\ngovernment made to help foot some of the increased costs of the games. These pr\n\notests\nerupted shortly after they began, with Brazilians from over 100 cities marching in huge\nprotests. The increased fare hike was simply the last straw, the government had been taking\nsteps to increasingly alienate the public that brought millions to their breaking point. The\nunderlying issues are the increasing of government funding for the World Cup, meaning\ntaxpayers' money going to fund these major sporting events that Brazilians would rather be\ninvested in aging infrastructure, education and health care. Instead, what it is doing is\nincreasing the cost of living, encroaching on the working class of the major Brazilian cities\nwho cannot afford to pay more for necessities. Besides simple anger at having to pay more,\nBrazilians are fed up with the government and alienated by the multiple corruption,\nembezzlement and overbilling scandals. There have been multiple reports of abuse and\nspecial benefits conceded to Brazilian politicians from questionable sources. With the World\nCup being less than a month away, scrutiny on the government's preparations are increasing.\nThis tension between the government and the people is not likely to decrease in the near\nfuture. A government audit and electoral data now shows a huge rise in both construction\ncosts and campaign funding by firms hired to prepare for the world cup. The cost of building\nBrasilia's World Cup stadium is nearly 3 times its original estimate. [8] This stadium alone\ncost $900 million in public funds, and auditors say this is largely due to fraudulent billing.\nThe auditors showed countless instances of price gouging and overbilling, like the instance\nwhere the transportation of pre-fabricated grandstands cost the government $1.5 million\ndollars when it was supposed to cost just $4,700. [7]\nBrazilians are well aware of this corruption, as it is directly impacting their daily lives.\nCampaign contributions from companies whose services the government is overpaying for\nMIT Student\n\n21A.506\nTask 5- final campaign strategy\nare technically legal, as there is no restriction regarding campaign donations from\nbusinesses in Brazil, and have been increasing exponentially from companies hired starting\n\nwhen Brazil began to prepare for the World Cup. Brazilians are aware and angry about this.\nA poll last year found that 3 out of every four respondents said the World Cup construction\nwas extremely corrupt, a reason why so many Brazilians have and continue to take part in\nwidespread anti-government protests. The overall price of the 12 stadiums has quadrupled\nsince FIFAs original estimate, which also promised the stadiums would be privately funded.\nNow, when the costs have shifted onto the backs of the Brazilian tax payers, the total cost\nstands at $4.2 billion, again, 4 times what FIFA had originally said. 4 of these stadiums\nare criticized to be in small cities that cannot support them.\nThis anger isn't expected to die down any time soon. Even in a country that is known\nfor its love of soccer, Brazilians as a whole are strongly against the World Cup. Recent protest\nslogans include the phrases \"Copa pra quem?\" (Cup for who?) and an even more threatening\n\"Nao Vai Ter Copa\" (there won't be a cup). The protestors are expected to use the World Cup\nas a means to showcase their grievances, which is what the government fears as the eyes of\nthe world will be on them. The way that protestors are treated during the Cup will have a\nhuge effect on how Brazilians vote in the coming October elections. With such a short span\nin between the end of the cup and the elections, people likely won't be thinking about any\ngains Rouseff has made in decreasing illiteracy rates or poverty, they will be thinking about\neverything that just happened leading up to and during the World Cup is just going to happen\nagain leading up to and during the Olympics and they will be looking for a different candidate\nthat will bring change.\nMIT Student\n\n21A.506\nTask 5- final campaign strategy\nThis is where my campaign strategy comes in. It will look to highlight what Braz\n\nilians\nlike about my candidates, taking advantage of the fact that the vice presidential candidate is\nwell liked by Brazilians, while highlighted the corruption and dissatisfaction with the\ngovernment's actions in preparing for the Cup and dealing with protestors. I will largely be\ntargeting the working population in the cities, people whose daily lives are being directly\naffected by the government's mismanagement and disregard for using public money. Just\nunder 200 million people live in Brazil. 33 million people live directly in the host cities and\n170 million people live in urban areas. 43% of the population is in the age range 25-54 years\nold. We will be mainly focusing our campaign on the younger people, like those involved in\nprotests, and the slightly older to middle age people who are in the working class of cities.\nFor this reason, our campaign will have two tiers, virtual and physical. We will be placing\nads in cities in places like subways and buses, which, in some cities, get millions of riders per\nday. These posters will have plays on common protesting slogans, like using the question\n\"governo pra quem?\" instead of \"copa pra quem\" to target people's unrest and distrust of\ngovernment as a result of its actions leading up to and during the world cup and give them\nan alternative. We will also be targeting the large majority of young people who are using\nsocial media, as 78% of Brazilians between the ages of 20 and 34 access the internet, with\n87% of internet users using the internet for research and news. Brazil is second only to the\nUS in facebook usership with 65 million users. Campos's running mate Marina Silva has the\nhighest number of facebook likes out of all the candidates. We will have both facebook and\ntwitter campaigns, as these services are used heavily by not only young people but also\nprotestors to organize themselves and air their grievances about the government. Twitter\nMIT Student\n\n21A.506\nTask 5- final campaign strategy\nprovides real time information on the sentiments of angry citizens, giving the campaign\nadvisors information to work on when building campaigns.\nOur campaign will target the population that is calling out for change in\nadministration. This includes people online and in urban areas. According to an online\nIBOPE study last summer, 75% of respondents said they support the protestors.\nRespondents saw the main issues of the protests to be targeted at dissatisfaction with\npoliticians of all parties, corruption, poor education, poor health care, a deficient\ntransportation system and inflation. Dilma Rouseff's approval rating is now below 50% and\nBrazilians overall want change. While Campos and Nieves have similar backgrounds and\nopinions in many areas. In order to pull votes away from both Nieves and Rouseff, the\n\ncampaign will lump the two candidates together as part of the problem, since they have been\ndominating politics in recent times. In Campos's own words: \"...what we see today is a\npolitical bloc with its back to society, discussing how to distribute political appointments.\nAnd we only see a part of these conversations. We don't know the other part.\" The campaign\nwill paint Campos and Silva as political outsiders while attributing the corruption in Brazil\nto be the result of current political dynamics, dominated by the Workers' Party and the\nBrazilian Social Democracy Party. In this way, the campaign will show voters there is a viable\nalternative to the current political situation that will bring much needed change.\n\n[1]\"Dilma Rousseff increases welfare payments for the poor as her approval ratings fall. - World Politics\nJournal.\"World\nPolitics\nJournal.\nN.p.,\nMay\n2014.\nWeb.\nMay\n2014.\n<http://worldpoliticsjournal.com/2014/05/dilma-rousseff-increases-welfare-payments-poor-approval-\nratings-fall/>.\n\n[2]Watts, Jonathan. \"Brazil's bolsa familiascheme: political tool or social welfare success?.\" theguardian.com.\nGuardian News and Media, 19 Dec. 2013. Web. 14 May 2014. <http://www.theguardian.com/global-\ndevelopment/2013/dec/19/brazil-bolsa-familia-political-tool-social-welfare>.\n\nMIT Student\n\n21A.506\nTask 5- final campaign strategy\n\n[3]\"Bolsa Familia: Changing the Lives of Millions in Brazil.\" News & Broadcast -. N.p., n.d. Web. 13 May 2014.\n<http://web.worldbank.org/WBSITE/EXTER>\n\n[4]Boadle, Anthony. \"Brazil's Campos to run for president with environmentalist.\"Reuters. Thomson Reuters,\n14 Apr. 2014. Web. 14 May 2014. <http://www.reuters.com/article/2014/04/15/us-brazil-politics-campos-\nidUSBREA3E00Q20140415>.\n\n[5]Masters, James. \"World Cup 2014: Can the FBI help stop Brazil's World Cup protesters?.\" CNN. Cable News\nNetwork, 1 Jan. 1970. Web. 13 May 2014. <http://www.cnn.com/2014/05/13/sport/football/world-cup-brazil-\nsecurity-football/?hpt=hp_c2>.\n\n[6]\"Brazil clashes during Rio cup final.\" BBC News. N.p., 30 June 2013. Web. 14 May 2014.\n<http://www.bbc.com/news/world-latin-america-23121532>.\n\n[7]\"High cost, corruption claims mar Brazil World Cup.\" Watertown Public Opinion. N.p., 12 May 2014. Web.\nMay\n2014.\n[8]\"The World Cup doesn't bring wealth to the host country by Simon Kuper.\"ESPNFC. N.p., 12 Dec. 2014.\nWeb. 13 May 2014. <http://www.espnfc.com/blog/_/name/worldcupcentral/id/1524?cc=5901>.\n\n[9]\"Three out of four Brazilians fed up with poor public services support street protests.\" MercoPress. N.p.,\n24 June 2013. Web. 14 May 2014. <http://en.mercopress.com/2013/06/24/three-out-of-four-brazilians-fed-\nup-with-poor-public-services-support-street-protests>.\n\n[10]\"Brazil: Allied in opposition, Campos and Silva step up attacks on Rousseff.\"Pulsamerica Latin American\nNews\nPolitics\nand\nEconomics.\nN.p.,\nMar.\n2014.\nWeb.\nMay\n2014.\n<http://www.pulsamerica.co.uk/2014/03/17/brazil-conservative-groups-urge-military-intervention/>.\n\n\"The president and the pretenders.\" The Economist. The Economist Newspaper, 10 May 2014. Web. 14\n\nMay2014. <http://www.economist.com/news/americas/21601828-dilma-rousseffs-rivals-are-gaining-ground-\npresident-and-pretenders>.\n\nMIT Student\n[11]\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21A.506 The Business of Politics: A View of Latin America\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT21A_506S14_Task1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-506-the-business-of-politics-a-view-of-latin-america-spring-2014/9fe5d5ec0a4d5023e564daf74a2dfcce_MIT21A_506S14_Task1.pdf",
      "content": "Task 1 (20 points): Written report - Knowing the rules\n\nElectoral legislations and party systems frame political campaigns. For this first task, you will\nresearch the political system in place in the country of your choice. For this purpose, you will\nsubmit a report on:\n\n-\nThe major political parties and their ideological leanings\n\n-\nWhat is the voting system? (i.e. how votes are counted, how ballots are organized and how\npeople vote)\n\n-\nWhat are the financial limits for political campaigns? Who is allowed to fund a political\ncampaign?\n\n-\nAre media ads (billboards, TV spots, campaigning online) and political proselytism regulated?\nHow so?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21A.506 The Business of Politics: A View of Latin America\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT21A_506S14_Task2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-506-the-business-of-politics-a-view-of-latin-america-spring-2014/5825352d8fa6a8b3f2cd1d16084bbc0f_MIT21A_506S14_Task2.pdf",
      "content": "Task 2 (20 points): Written report - Political histories\n\nElectoral legislations are not produced in a vacuum. These are the result of social and political struggles.\nFor example, the Voting Rights Act in the U.S. is a result of the Civil Rights Movement. For this second\ntask you will find out:\n\n-\nHow old is the electoral system in place?\n\n-\nWhen was this system implemented?\n\n-\nWhat were the reasons for reforming the electoral system?\n\n-\nIs the electoral system controversial among the public opinion? What are the main criticisms?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21A.506 The Business of Politics: A View of Latin America\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT21A_506S14_Task3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-506-the-business-of-politics-a-view-of-latin-america-spring-2014/c977dbf43e5e1c4489d31e47c5e550b8_MIT21A_506S14_Task3.pdf",
      "content": "Task 3 (20 points): Written report - Media platforms and political attitudes\n\nCampaigns pay close attention to the media people use and to the sensitive issues that catch people's\nattention. For this third task you will profile the use of media and the most salient issues in the country of\nyour choice. For this purpose you will:\n\n-\nFind statistics on media penetration (you can use resources such as LAPOP - Latin America\nPublic Opinion Project)\n\n-\nReview past presidential campaigns and find the main issues that the campaigns focused on\n\n-\nChoose one of the major media outlets of the country and review their headlines for the past\nmonth. What are the most frequent topics that pop up?\n\n-\nChoose one of the topics as your campaign focus. Who are the people most affected by this\nissue? How would you characterize this group of people?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21A.506 The Business of Politics: A View of Latin America\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT21A_506S14_Task4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-506-the-business-of-politics-a-view-of-latin-america-spring-2014/c6de7a6f3373741fce2755946dd92ce6_MIT21A_506S14_Task4.pdf",
      "content": "Task 4 (15 points): Campaign strategy report and presentations\n\nPart 1:\n\nBased on the information you have collected, you will design a campaign strategy for an imaginary\npresidential candidate (you can imagine the candidate or you can design the campaign for the\nexisting president of the country you chose). You will have to:\n\n-\nFind a target population for your candidate. Who does your candidate represent?\n\n-\nDesign an appealing campaign message that synthesizes what the candidate stands for\n\n-\nDesign a media strategy that reaches your target population. Where can you reach the target\npopulation? Where do they typically hang out? What media format would work best in order to\nreach the target population?\n\nPart 2:\n\nYou will design an ad for your candidate, bring it to class and present it along with your campaign\nstrategy. The ad has to be coherent with your research and your campaign strategy. The class will make\nsuggestions to improve your campaign strategy.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21A.506 The Business of Politics: A View of Latin America\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT21A_506S14_Task5.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-506-the-business-of-politics-a-view-of-latin-america-spring-2014/e16efc36a34470c68e1e03f1a7209ac6_MIT21A_506S14_Task5.pdf",
      "content": "Task 5 (20 points): Final reports\n\nYou will turn in a final report that collects the campaign strategy and the research you have done\nthroughout the semester. This final report can take any form you want (e.g.: dossier, website,\ninfographic, poster presentation, etc.), as long as it contains all the information in an organized way.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21A.506 The Business of Politics: A View of Latin America\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}