{
  "course_name": "Theater and Cultural Diversity in the U.S.",
  "course_description": "This course explores contemporary American theatrical expression as it may be organized around issues of gender and cultural identity. This exploration will include the analysis of performances, scripts, and video documentation, as well as the invention of original documents of theatrical expression. Class lectures and discussions will analyze samples of Native American, Chicano, African American, and Asian American theater, taking into consideration the historical and political context for the creation of these works. Performance exercises will help students identify theatrical forms and techniques used by these theaters, and how these techniques contribute to the overall goals of specific theatrical expressions.",
  "topics": [
    "Fine Arts",
    "Performance Arts",
    "Theater",
    "Humanities",
    "Literature",
    "Creative Writing",
    "Criticism",
    "Drama",
    "Social Science",
    "Anthropology",
    "Ethnography",
    "Fine Arts",
    "Performance Arts",
    "Theater",
    "Humanities",
    "Literature",
    "Creative Writing",
    "Criticism",
    "Drama",
    "Social Science",
    "Anthropology",
    "Ethnography"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 2 hours / session\n\nGeneral Course Description\n\nThis course explores contemporary American theatrical expression as it may be organized around issues of gender and cultural identity. This exploration will include the analysis of performances, scripts, and video documentation, as well as the invention of original documents of theatrical expression. Class lectures and discussions will analyze samples of Native American, Chicano, African American, and Asian American theater, taking into consideration the historical and political context for the creation of these works. Performance exercises will help students identify theatrical forms and techniques used by these theaters, and how these techniques contribute to the overall goals of specific theatrical expressions.\n\nReadings and Materials\n\nCore Text\n\nCastillo, Ana.\nPsst... I Have Something To Tell You, Mi Amour\n. Preface by Sister Dianna Ortiz. San Antonio, TX: Wings Press, 2005. ISBN: 9780916727208.\n\nUno, Roberta, and Kathy A. Perkins, eds.\nContemporary Plays by Women of Color\n. New York, NY: Routledge, 1996. ISBN: 9780415113779.\n\nOther readings are provided in the\nreadings\nsection.\n\nClass Requirements\n\nApproximately 25 pages of reading and 1 hour of viewing weekly. Participation in class discussions will account for 10% of the final grade.\n\nWe will attend at least two performances of theater. Each student will write a short response paper, of 2-3 pages length, on the topics of the performance. Response papers will account for 10% of the final grade (5% each).\n\nParticipation as run crew or performer on one performance project on campus as approved by the instructor. Successful participation will account for 10% of the final grade.\n\nThree performance projects on the topics described below. The performance projects account for 45% of the final grade (15% each).\n\nA final group creative project, that draws on themes of the semester. The final assignment will account for 25% of the final grade.\n\nACTIVITIES\n\nPERCENTAGES\n\nParticipation in class discussions\n\n10%\n\nTwo response papers (5% each)\n\n10%\n\nParticipation as run crew or performer on one performance project\n\n10%\n\nThree performance projects (15% each)\n\n45%\n\nFinal group creative project\n\n25%\n\nRequired Performances on Campus\n\nsubUrbia (21M.873 IAP '08)\n\nWritten by Eric Bogosian directed by David R. Gammons\n\npresented by MIT Dramashop\n\nThe play is set in a fictional suburban town, Burnfield, and is the story of several people trying to figure out their lives, while being visited by their sole successful friend. The story develops throughout the play revealing subtle flaws and noble traits in all of the characters.\n\nTongue, Smell, Color\n\nBrenda Dixon Gottschild and Helmut Gottschild\n\nHelmut and Brenda Dixon Gottschild achieve a rare success in \"Tongue\" - a work that is highly provocative, profoundly personal, and very, very smart. It is an improbable success in that it weaves together dance, music, poetry, readings from academic texts, enactments of searing personal catharsis, and a unique physical vocabulary created by the scholar/artists. That it is a success explodes from the stage in every autobiographical truth the performers utter. Without flinching, they confess the racialized points of attraction and desire which initially divide them, but ultimately bound them together. At times they inflect the autobiographical narrative with fragments of Brenda's groundbreaking scholarship in Africanist performance practice or Helmut's deeply-felt dance. The result is a huge advance in critical scholarship and performance, of vital importance to anyone interested in cultural studies, performance studies, dance, or the nagging persistence of \"race\" in the way couples view the world.\n\nIn the Heart of America\n\nWritten by Naomi Wallace, directed by Michael Ouellette\n\npresented by MIT Dramashop\n\nSet during the first Gulf War, In The Heart Of America tells the story of a young Arab-American woman, Saboura, on a mission to find out what happened to her army enlisted brother Remzi. Her journey finds her crossing paths with many people who have been deeply affected by the horrors of war, including Remzi's best friend, Private Craver Perry. Although written in 1994, In The Heart Of America resonates with the current situation in Iraq, and the effects of war on family and friends.\n\nCalendar\n\nThe course will be divided into six major units. Most contain sessions with various visiting artists, as detailed below. More information about each guest artist can be found here: (\nPDF\n)\n\nSES #\n\nTOPICS\n\nEVENTS\n\nKEY DATES\n\n1-3\n\nUnit I: Introduction and overview\n\nWhat is culture? And how do we identify culture and performance in American theater? A sharing of family traditions and the creation of \"stereotypical\" history of immigration to the United States. This unit will provide students with a general overview of basic concepts such as theater, movement, culture, diversity, and composition.\n\nSes #1: Guest Artist Workshop, Melissa Blanco-Borelli\n\n4-9\n\nUnit II: African American theatrical traditions\n\nWhat are African American traditions of theater? How do music and dance figure in the construction of African American experience on stage? How is the \"dancing black body\" represented on stages?\n\nSes #4, #6, #8: Guest Lectures, Brenda Dixon Gottschild\n\nPerformance project 1 due in Ses #9 - autobiography without words\n\n10-13\n\nUnit III: Latino/a and Chicano theatrical traditions part I\n\nWhat sorts of Chicano and Latino/a American theatrical traditions have emerged in the past century? A focus on the plays of Miguel Pinero.\n\nSes #10: Visiting Artist, Rafael Sanchez from Design Studio for Social Intervention\n\nPerformance project 2 due in Ses #13 - spoken word poetry exercise\n\n14-17\n\nUnit IV: Asian American theatrical traditions\n\nHow can theater express Asian American cultural heritage? What sorts of stories do Asian diaspora playwrights chose to tell? A consideration of David Henry Hwang's M. Butterfly.\n\nSes #14: Visiting Artists, Kit Yan and Melissa Li\n\nPerformance project 3 due in Ses #17 - gender and secrecy\n\n18-21\n\nUnit V: Latina/Chicana theatrical traditions part 2\n\nVisiting Artist Ana Castillo will come work with us on her play.\n\nVisiting Artist Workshop, Ana Castillo\n\n22-23\n\nUnit VI: Reaching beyond diversity\n\nHow can we reach beyond the rubric of diversity to explore particular histories and theatrical methodologies?\n\n24-25\n\nFinal group projects\n\nFinal group projects due in Ses #24 and #25",
  "files": [
    {
      "category": "Assignment",
      "title": "Final project assignment",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-621-theater-and-cultural-diversity-in-the-u-s-spring-2008/fd4108d6fc6a68af480edfc22a3214df_MIT21M_670S08_unit6finalpro.pdf",
      "content": "Theater and Cultural Diversity in the United States\n21M.621/SP.595\nSpring 2006\nWalker\nThomas Defrantz\n\nFinal Project Assignment\nFor your final project create a three-part invention that includes\ncreative text\nanalytic discussion of your text\nperformance of your text\nYour creative text should be an autobiographical narrative that describes your\nemergence into an ethnicity. While acknowledging that ethnic identity can be a\n\"contingent\" status - that people claim ethnic identities for different reasons at\ndifferent moments in time - choose a moment of realization for yourself that holds\nsome importance to you, and dramatize that. Your text need not be realistic in\nany way; in fact, it might be best served as a creative poetic invention.\nRefer to the different analytic and theatrical texts that we have considered in this\ncourse over the semester. For instance, you might make reference to popular\nculture and television ads that revealed you to yourself in a particular way\n(Richard Schechner and Marlon Riggs); you might make reference to political\nevents that have persuaded you to \"become\" a particular ethnicity (Vincent Chen\nincident); you might make reference to peer pressure or class issues that\ninfluenced your choices (Ana Castillo, Miguel Pinero); you might make reference\nto experiences of gender identity that emerged as you matured and started\ndating (Diana Son). Ultimately, your text should aspire toward the density offered\nby the play ....\nYour analytic discussion of your text should be concise; 1-2 pages in length. This\ndiscussion should articulate and defend your creative choices. The discussion\nshould also place your text in relationship to plays we've read in this course: how\nis your text similar to that of Diana Son or Miguel Pinero?\nYour performance of the text should draw on techniques that we have engaged\nin class and seen in performances during the semester. It might include\nnaturalistic gestures; expressionistic or abstract gestures; it might include words\nor nonsense sounds; it might include music and dance.\nIMPORTANT Your performance may be no more than 5 minutes in length!\nYour projects should be ready for performance on May 7.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21M.621 / WGS.595 Theater and Cultural Diversity in the U.S.\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Performance possibilities for Run Crew/Participation on the MIT Campus",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-621-theater-and-cultural-diversity-in-the-u-s-spring-2008/e26b232f58c19fd93fe5ef4387af8986_MIT21M_670S08_unit3crewpe.pdf",
      "content": "Theater and Cultural Diversity in the United States\n21M.621/SP.595\nSpring 2008\nThomas DeFrantz\nPERFORMANCE POSSIBILITIES FOR RUN CREW/PARTICIPATION ON THE MIT Campus\nCANE (workshop)\nMarch 12 - 15 Kresge Little Theater\nCollaboration with SLIPPAGE: Performance|Culture|Technology\nImmersive-environment contemporary dance theater exploration of Jean Toomer's 1923 classic\nopus Cane. Workshop Performances Friday and Saturday @ 8pm\nBACKSTAGE PARTICIPATION\nBoard Operators - Sound and Light\ncommitment: T, W, Th, F, Sa 7-10pm\nStage Manager COMMITMENT premeetings to be arranged,\nMarch 11-16, 7-10pm\nHouse Manager COMMITMENT March 14, 15, 7pm - 10pm\nLight Board Operator COMMITMENT March 11 - 16, 7 - 10pm\nSound Board Operator COMMITMENT March 11-16, 7 - 10pm\nCostume Run Crew COMMITMENT March 11-16, 7pm - 10pm\nLight Hang Crew: COMMITMENT Sunday March 9 10-5 OR 2 - 10pm\nStrike Crew: COMMITMENT Sunday March 16 8-12midnight\nJAZZ ALL OVER MIT\nMay 2 -3 Building 26 Hallways\nGuerilla dance performances via distributed music score in the hallways of MIT.\nPerformances Friday and Saturday at 5pm\nBACKSTAGE PARTICIPATION\nStage Manager COMMITMENT premeetings to be arranged,\nMay 1 - 3 530-830pm\nSound Operator COMMITMENTMay 1 - 3 530-830pm\nRun Crew COMMITMENT May 1 - 3 530-830pm\nCostume Designer COMMITMENT premeetings to be arranged, May 1 - 3 530-830\nCREATIVE/PERFORMANCE PARTICIPATION\nDocents/Crowd Wranglers COMMITMENT May 1 - 3 530-830pm\nPerformers COMMITMENT April 4, 11, May 25-27 6-8pm; May 1-3 530-830\nWalker\n\nDeFrantz\n21M.621 - Theater and Cultural Diversity\nSpring 2008\nPage 2.\nREQUIRED PERFORMANCES ON CAMPUS\nwritten by Eric Bogosian directed by David R. Gammons\npresented by MIT Dramashop\nsubUrbia\nOpening February 7, Performances February 7-9, 14-16 at 8 pm\nMassachusetts Avenue, Cambridge MA\nThe play is set in a fictional suburban town, Burnfield, and is the story of several people\ntrying to figure out their lives, while being visited by their sole successful friend. The\nstory develops throughout the play revealing subtle flaws and noble traits in all of the\ncharacters.\nTickets: $6 for students, $8 general admission OPENING NIGHT SPECIAL: 2 for 1\nticket admissions!\nTongue, Smell, Color\nBrenda Dixon Gottschild and Helmut Gottschild\nFebruary 28, 2008 7pm\nFree and open to the Public\nHelmut and Brenda Dixon Gottschild achieve a rare success in \"Tongue\" - a work that is\nhighly provocative, profoundly personal, and very, very smart. It is an improbable\nsuccess in that it weaves together dance, music, poetry, readings from academic texts,\nenactments of searing personal catharsis, and a unique physical vocabulary created by\nthe scholar/artists. That it is a success explodes from the stage in every\nautobiographical truth the performers utter. Without flinching, they confess the racialized\npoints of attraction and desire which initially divide them, but ultimately bound them\ntogether. At times they inflect the autobiographical narrative with fragments of Brenda's\ngroundbreaking scholarship in Africanist performance practice or Helmut's deeply-felt\ndance. The result is a huge advance in critical scholarship and performance, of vital\nimportance to anyone interested in cultural studies, performance studies, dance, or the\nnagging persistence of \"race\" in the way couples view the world.\nIn the Heart of the America\nwritten by Naomi Wallace, directed by Michael Ouellette\npresented by MIT Dramashop\nApril 10 - 12 and 16-18 at at 8 pm Massachusetts Avenue,\nCambridge MA\nSet during the first Gulf War, In The Heart Of America tells the story of a young\nArab-American woman, Saboura, on a mission to find out what happened to her army\nenlisted brother Remzi. Her journey finds her crossing paths with many people who\nhave been deeply affected by the horrors of war, including Remzi's best friend, Private\nCraver Perry. Although written in 1994, In The Heart Of America resonates with the\ncurrent situation in Iraq, and the effects of war on family and friends.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21M.621 / WGS.595 Theater and Cultural Diversity in the U.S.\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Writing assignment 1: Ethnic Notions response",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-621-theater-and-cultural-diversity-in-the-u-s-spring-2008/8951c19038adfb674140965f9c60f669_MIT21M_621S08_unit1ethnicn.pdf",
      "content": "Theater and Cultural Diversity in the United States\n21M.621\nSpring 2008\nWalker\nThomas Defrantz\nWritten Assignment One: Ethnic Notions response\nFor Wednesday, February 13, view the film Ethnic Notions available on the course\nwebsite. Write a three-page response to the film in which you both challenge and\nsubstantiate points made by Riggs and others in the film. Your response should refer\nto either specific information from the film; specific scenes dramatized within the film; or\nideas about stereotypes or representations of ethnicity suggested by the film.\nAttempt to tie your assessment of the film to the reading from the Schechner text\n(\"What is Performance?\"). Considers questions that Schechner ignores: What are the\ndifferences between performance and representation? Is cultural identity represented\nby the media in terms that are familiar to its practitioners? Do people always perform\nethnicity well?\nYour paper should be 'written,' that is, you should frame specific arguments in English\nwith an attention to grammar, spelling, and punctuation. Be sure to both 'challenge'\nsome points and 'substantiate' others; that is, you should find a point that the film\nmakes and challenge its truth, and also support a point or two that the film suggests\nabout the construction of ethnic identities. Your paper need only be three-pages long,\nso you probably will only have time to take on two or three points in your response. Be\nparticular, and offer examples or evidence from your own experience and awareness\nto underscore your arguments.\nThe film will be available on the course web site or in the Film Office and lasts\napproximately 60 minutes total. Good luck!\nAny questions or concerns, do not hesitate to contact me.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21M.621 / WGS.595 Theater and Cultural Diversity in the U.S.\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Writing assignment 2: \"SubUrbia\" (21M.873 IAP '08) response",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-621-theater-and-cultural-diversity-in-the-u-s-spring-2008/6d3df32254374204be8de91c28c4c48f_MIT21M_670S08_unit2suburb.pdf",
      "content": "Theater and Cultural Diversity in the United States\n21M.621\nSpring 2008\nWalker\nThomas Defrantz\nWriting Assignment Two: \"SubUrbia\" Response\nFor Wednesday, February 20, Attend the MIT Dramashop performance of \"SubUrbia\"\nby Eric Bogosian. Write a two-page response to the performance in which you interpret\nand respond to the performance of gender and ethnic identity presented by the\nperformance. Your response should refer to either specific information from the\nperformance; specific physical gestures enacted during the work, or ideas about family,\ngender, and representations of ethnicity suggested by its plot or characterizations.\nYour paper should be 'written,' that is, you should frame specific arguments in English\nwith an attention to grammar, spelling, and punctuation. Be sure to both 'challenge'\nsome points and 'substantiate' others; that is, you should find a point that the\nperformance makes and challenge its truth, and also support a point or two that the\nperformance achieves that feeds you. Your paper need only be two-pages long, so you\nprobably will only have time to take on one or two points in your response. Be\nparticular, and offer examples or evidence from your own experience and awareness\nto underscore your arguments.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21M.621 / WGS.595 Theater and Cultural Diversity in the U.S.\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Performance assignment 3: Secrecy and Gender",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-621-theater-and-cultural-diversity-in-the-u-s-spring-2008/1a1a564c6a156b170922f4eb3d0a883d_MIT21M_670S08_unit4gender.pdf",
      "content": "Theater and Cultural Diversity in the United States\n21M.621\nSpring 2008\nWalker\nThomas F. DeFrantz\nPerformance Assignment Three: Secrecy and Gender\nFor Friday, April 11, write a short poem that explores a secret\nthat you hold surrounding gender. The poem should be inspired by\nsome thought, experience, desire, question, or secret concern that\nyou have about gender. The form of the poem is entirely open; it\ncan be in blank verse or in some rhyming form; it might be a series\nof two or three haiku. Your poem may be oblique or direct in its\ncontent; it does not need to be a coming-out story of any kind,\nalthough it might; it does not need to be a \"first time\" story of\nany kind, although it might.\nYour poem does need to make reference to a secret that you hold\nwithout revealing that secret. Your poem text should probably not\nbe humorous; the secret that you explore in this poem must mean\nsomething important and urgent to you. You should not try to write\nsomething funny or entertaining; take this opportunity to dig\ndeeply into your own conception of gender and find something new\nabout yourself.\nTo repeat, your poem should not necessarily \"reveal\" the secret it\nrefers to, rather, it should be inspired by it.\nBring four copies of the poem to class on Friday.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21M.621 / WGS.595 Theater and Cultural Diversity in the U.S.\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Writing assignment 3: \"Reading the Black Dancing Body\" lecture series responses",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-621-theater-and-cultural-diversity-in-the-u-s-spring-2008/79037faa5f781b37881fec6cfb328105_MIT21M_670S08_unit2reading.pdf",
      "content": "Theater and Cultural Diversity in the United States\n21M.621\nSpring 2008\nWalker\nThomas Defrantz\nWriting Assignment Three: \"Reading the Black Dancing Body\" Lecture Series\nResponses\nFor Friday March 28, Attend the performance of \"Tongue, Color, Smell\" on Thursday\nFebruary 28 at pm. Construct a series of at least five questions in which you\ninterpret and respond to the issues raised by the artists/scholars in their\nlectures/performance. Your questions should be cogent and provocative; framed with a\nlaser-beam perception that lays bare your interests and curiosity along with the points\nthat inspired your queries.\nYour questions should also be 'written,' that is, you should frame specific arguments in\nEnglish with an attention to grammar, spelling, and punctuation. Be sure to both\n'challenge' some points and 'substantiate' others; that is, you should find a point that\nthe lecture makes and challenge its truth, and also support a point or two that the\nperformance achieves that feeds you. Your questions should be in the form of shrot\nparagraphs of two or three lines each. Be particular, and offer examples or evidence\nfrom your own experience and awareness to underscore your arguments.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21M.621 / WGS.595 Theater and Cultural Diversity in the U.S.\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Writing assignment 4: Short Eyes character analysis",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-621-theater-and-cultural-diversity-in-the-u-s-spring-2008/ee5054c836df58d2dffb344d8d9cd5f0_MIT21M_670S08_unit3shorte.pdf",
      "content": "Theater and Cultural Diversity in the United States\n21M.621\nSpring 2008\nWalker\nThomas DeFrantz\nWriting Assignment Four: Short Eyes Character Analysis\nFor Wednesday, March 19, read the Miguel Pinero play Short Eyes\n(1974). Write a 1-2 page analysis of a single character in the\nplay. Using the play as a starting point, construct an imaginary\ncharacter biography that might include a family history, social and\ngeographic circumstance surrounding your character's upbringing,\nthe story surrounding his incarceration, or his relationships with\npeople outside the prison.\nYou may choose from any of the main characters that you feel offer\nyou enough information to imagine. You should support your flights\nof fancy with some textual evidence. For example, if the playwright\ntells us that the character became violent after a particular\nincident, be sure that your biography could, logically, include\nthat incident.\nYour analysis should be 'written,' that is, you should frame\nspecific arguments in English with an attention to grammar,\nspelling, and punctuation. Be creative, but be sure to ground your\ninvention in the reality of the play, its time period, and the\ncharacter information provided by the playwright. Your paper need\nonly be two-pages long, so you probably will only have time to take\non a few important incidents or character traits in your analysis.\nBe particular, and offer examples or evidence supported by Pinero's\nplay to underscore your arguments.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21M.621 / WGS.595 Theater and Cultural Diversity in the U.S.\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Writing assignment 5: Pssst... research analysis",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-621-theater-and-cultural-diversity-in-the-u-s-spring-2008/f300cbc571b17141a328168d84bcf658_MIT21M_670S08_unit5_pssst.pdf",
      "content": "Theater and Cultural Diversity in the United States\n21M.621/SP.595\nSpring 2008\nWalker\nThomas F. DeFrantz\nWriting Assignment Five: Pssst... Research Analysis\nFor Wednesday, April 23, read the play Psst... I Have Something To Tell You, Mi\nAmour by Ana Castillo (2005). Write a 1-2 page research analysis of the events of the\nplay. Using the play as a starting point, research the historical and political events that\nled to the possibility of the events of the play. How did the social circumstances that\nallowed the events of the play come to pass? What were the major events that led to\nthis social and political context? How are gender, race, class, location, age, or ability\nimplicated in the events of the play?\nYour analysis should be 'written,' that is, you should frame specific arguments in\nEnglish with an attention to grammar, spelling, and punctuation. Be creative, but be\nsure to ground your invention in the reality of the play, its time period, and the character\ninformation provided by the playwright. Your paper need only be two-pages long, so you\nprobably will only have time to take on a few important incidents or character traits in\nyour analysis. Be particular, and offer examples or evidence supported by Castillo's\nplay to underscore your arguments.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21M.621 / WGS.595 Theater and Cultural Diversity in the U.S.\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}