{
  "course_name": "Thermodynamics and Climate Change",
  "course_description": "In this course you will learn the three laws of thermodynamics, explore concepts like entropy and enthalpy, and investigate the causes and effects of global warming from a thermodynamics perspective. We will also apply these concepts to learning about state-of-the-art energy conversion and storage technologies, for example heat pumps, hydrogen fuel cells, metal-air batteries, artificial photosynthesis, molten salt storage, and concentrated solar power. \nThis course was offered as part of MITES Semester (formerly MOSTEC) in Summer 2022. MITES Semester is a 6-month online program for rising high-school seniors. The program offers students an opportunity to learn about diverse science and engineering fields, strengthen their academic STEM foundation, build 21st-century skills in networking, interviewing, collaboration and presentation delivery, prepare for college, and build a strong community of peers and mentors.\nMITES Semester is part of MIT Introduction to Technology, Engineering, and Science (MITES), which provides transformative experiences that bolster confidence, create lifelong community, and build an exciting, challenging foundation in STEM for highly motivated 7th–12th grade students from diverse and underrepresented backgrounds.",
  "topics": [
    "Energy",
    "Fuel Cells",
    "Hydrogen and Alternatives",
    "Technology",
    "Science",
    "Earth Science",
    "Climate Studies",
    "Physics",
    "Thermodynamics",
    "Energy",
    "Fuel Cells",
    "Hydrogen and Alternatives",
    "Technology",
    "Science",
    "Earth Science",
    "Climate Studies",
    "Physics",
    "Thermodynamics"
  ],
  "syllabus_content": "Course Meeting Times\n\n2 sessions / week, 2 hours / session\n\nPrerequisites\n\nProficiency in single-variable calculus and experience with basic programming are required for this course. Classes taken in chemistry, physics, and biology are helpful but not required.\n\nAbout this Course\n\nThis course was offered as part of\nMITES Semester\n(formerly MOSTEC) in Summer 2022. MITES Semester is a 6-month online program for rising high-school seniors. The program offers students an opportunity to learn about diverse science and engineering fields, strengthen their academic STEM foundation, build 21st-century skills in networking, interviewing, collaboration and presentation delivery, prepare for college, and build a strong community of peers and mentors.\n\nMITES Semester is part of\nMIT Introduction to Technology, Engineering, and Science (MITES)\n, which provides transformative experiences that bolster confidence, create lifelong community, and build an exciting, challenging foundation in STEM for highly motivated 7th-12th grade students from diverse and underrepresented backgrounds.\n\nCourse Description\n\nFrom air-conditioners and electric vehicles to humans and photosynthesizing plants, every system that converts energy from one form to another is governed by the laws of thermodynamics. So fundamental are these laws that Einstein himself once said they comprise \"the only physical theory of universal content, which I am convinced...will never be overthrown.\" However, with great power comes great responsibility. Our understanding of thermodynamics enabled the industrial revolution and virtually every technological breakthrough since, but it has also led to the over-consumption of fossil fuels and associated global warming. Now we need to turn the problem on its head and use these theories to find a solution.\n\nIn this course you will learn the three laws of thermodynamics, explore concepts like entropy and enthalpy, and investigate the causes and effects of global warming from a thermodynamics perspective. We will also apply these concepts to learning about state-of-the-art energy conversion and storage technologies like heat pumps, hydrogen fuel cells, metal-air batteries, artificial photosynthesis, molten salt storage, concentrated solar power, and many more.\n\nLearning Objectives\n\nThe primary aim of this course is to have students reach an undergraduate-level understanding of thermodynamics through the lens of climate change, paying special attention to placing fundamental concepts within a narrative that emphasizes both the benefits and dangers of technological progress. Throughout this course, students will:\n\nDevelop an understanding of the fundamental laws of thermodynamics and an intuition for how they relate to observed physical phenomena through concepts like energy, entropy, and enthalpy.\n\nApply these thermodynamic principles to illuminate the impact of human industrialization on the climate.\n\nThink broadly about the greater context of climate change and the history of the Earth and Universe as a whole to better understand the competing timescales of human consumption and the carbon cycle.\n\nUse Python to evaluate the performance and climatological impact of thermodynamic systems that are contributing to climate change and their proposed replacements.\n\nWork together as teams to evaluate the efficacy of leading climate change mitigation strategies using the theory and computational tools learned throughout this course.\n\nCourse Format\n\nThe\nonline textbook\nhas seven chapters. Each chapter is paired with a\nPython Jupyter notebook\nthat provides students a means to explore and gain an intuition for the various thermodynamic properties presented, as well as provide exposure to the computational tools necessary for analyzing various thermodynamic systems. Students are encouraged to complete both the qualitative concept-question style and quantitative computation exercises given in these notebooks after reading each chapter to solidify understanding.\n\nTopic Outline\n\nThermodynamics and Climate Change\nis not organized according to the fundamental physics as is usually the case in texts on these subjects, but rather by the story of anthropogenic climate change itself. We will see the motivation to dig deeper into thermodynamics emerge organically from the narrative as we progress through the following units:\n\nUniversal Beginnings\n, where we will discuss at a high level the history of the Universe, including the formation of the Earth and the importance and ubiquity of solar energy. The origins of thermodynamics as a field will be discussed as well.\n\nEnergy, Climate, and the Carbon Cycle\n, where we will learn how the Earth's climate was established, various forms of energy and First Law of Thermodynamics, the greenhouse effect, and the delicate balance between atmospheric composition and temperature that enables life to exist.\n\nControlling Fire\n, where we will take a look at the origins of thermodynamics and the physics of fire, heat, and combustion chemistry, as well as early human uses of fire and its effect on the climate.\n\nEntropy and a Move Towards Chaos\n, where we extend our understanding of heat with the concept of entropy and its relationship to processes, cycles, and the Second Law of Thermodynamics.\n\nEngines, Power, and the Anthropocene\n, in which we will develop an understanding of engines and other power machinery, as well as the climate change caused by human use of fossil fuels and industrialization.\n\nA Return to Renewables\n, where we will look at carbon-neutral alternatives to fossil fuels, energy storage, and how the world could be powered sustainably by solar and geothermal energy.\n\nMitigating the Climate Crisis\n, where we will explore promising approaches to slowing and altogether stopping global warming, as well as how to evaluate these approaches on technical and ethical merit.\n\nRequirements\n\nWeekly deliverables will include\nproblem sets\non fundamental topics, as well as interactive coding assignments to simulate and analyze various thermodynamic systems. As a final group project, you will pick one of these systems and provide an in-depth analysis and simulation to better understand its potential for reducing greenhouse gas emissions.",
  "files": []
}