{
  "course_name": "Thermodynamics of Materials",
  "course_description": "Treatment of the laws of thermodynamics and their applications to equilibrium and the properties of materials. Provides a foundation to treat general phenomena in materials science and engineering, including chemical reactions, magnetism, polarizability, and elasticity. Develops relations pertaining to multiphase equilibria as determined by a treatment of solution thermodynamics. Develops graphical constructions that are essential for the interpretation of phase diagrams. Treatment includes electrochemical equilibria and surface thermodynamics. Introduces aspects of statistical thermodynamics as they relate to macroscopic equilibrium phenomena.",
  "topics": [
    "Engineering",
    "Materials Science and Engineering",
    "Science",
    "Physics",
    "Thermodynamics",
    "Engineering",
    "Materials Science and Engineering",
    "Science",
    "Physics",
    "Thermodynamics"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 3 sessions / week, 1 hour / session\n\nExams\n\nThere will be two midterm exams, one hour. There will be a final exam during exam week.\n\nHomework\n\nHomework assignments will be posted almost every Friday and will usually be due the Monday of the following week (i.e., you will have about 10 days to complete each homework, although on three of those days you will have two different assignments. The intent is allow you a bit of flexibility so that you can budget your time accordingly). No homework can be assigned that will be Lecture 34.\nYou are encouraged to work in groups and turn in a single homework for the entire group\n. Group homeworks\n\\[1\\]\nwill receive a 5% bonus score. In other words, if the homework score is 73, then everyone in the group will receive a 77\n\\[2\\]\n. I hope that you will use the group homeworks as a vehicle for cooperative teaching and learning as well as a time-saving device. Regarding the group homeworks--some students fall into a trap of letting other members of their group do the hard intellectual work and think that they can catch up in time to take the exams. Of course, this is not only a mistake and not an effective way to learn--it is also bad manners.\n\nHomeworks will be due the following Monday at 5pm. If you choose to work in a group, it is each group member's responsibility that the group's homework is turned in on time.\n\nYou will be allowed\none and only one\nlate homework\n\\[3\\]\n. No exceptions.\n\nFinal Grade\n\nThe grade in 3.00 will be determined by:\n\nClass Participation (10%):\n\nRecords will be kept for good questions and comments during lectures--you must raise your hand so we can maintain some order in the classroom. You will also need to state your name when asking a question. Students will also be asked randomly about the current lecture topic. You are allowed to pass on making a comment twice during the semester. Not being present at a lecture in which you are asked a question counts as two passes, unless you have informed the TA or professor that you cannot attend a particular lecture by sending them email.\n\nStudents will not get credit for showing off--only productive comments or genuine questions will receive credit.\n\nIf you are curious whether you are getting credit--please ask. However, if you are unsure, then you are probably not participating actively.\n\nAsking questions during recitation or coming to office hours also count as participation. If you fear that you are getting very far behind in class participation, it is possible to get some credit for creating web content to add to the 3.00 website.\n\nHomework (20%):\n\nYou are allowed to turn in one homework up to a week late. Otherwise, homework is due by 5pm on the assigned day with no exceptions except your one free late homework. Homework will tend to test problem solving ability.\n\nYou can turn in homeworks as a group--in other words, if you choose to work as a group, you only need to turn in one problem set for the group[4]. There is no limit on the number of people of homework group. However, if you turn the problem set as a group then each member of the group must turn in a confidential report of the fraction that each member contributed; the sum of fractions will be unity. We will assign credit based on all the confidential reports.\n\nExam I (20%):\n\nThis will cover only material from the beginning of the semester to week before Exam I.\n\nExam II (20%):\n\nThis will cover only material from the week before Exam I up to the week before Exam II.\n\nFinal Exam (30%):\n\nThis will cover all lecture material.\n\nThere are exams from last year on the web. It would be wise to look at them as this year's exams will follow a similar format. You should expect conceptual questions on exams--the kind you should read very carefully because they can be tricky. For instance, a typical question may be:\nExplain whether and why the following statements are true or false. \"The entropy of an isolated system can never decrease.\" \"If the Gibbs Free energy of two bodies are equal, then the two bodies are in equilibrium at constant pressure.\"\nThere may simple questions that require symbolic computation--you definitely won't need a calculator, but bring one with you if it helps you feel more comfortable. No notes or open book exams.\n\nThermodynamics is a subject that must be digested slowly. Please try to keep up and work at a constant rate. Cramming for a thermodynamics exam is usually a recipe for poor performance.\n\nAbridged Notes\n\nAbridged lecture notes will be available on the web the night before each lecture\n\\[5\\]\n. Looking over the notes briefly before the lecture is a good idea. As you will see, they are designed for you to add notes during the lectures. Just printing the notes and reading them in lieu of attending lectures is not a good idea--the notes are designed as an aid to your comprehension and retention of lectures. Also, as described below, printing the lectures and taking notes on them will also provide another means of accruing points towards your final grade.\n\nCopies of the notes will not be provided you--you must download and print them yourselves. Many of the figures are in color. It is not necessary to print them in color, but it may prove to be useful.\n\nTime Management\n\nThis is a 12 unit course. You are expected to spend 4 waking hours a week in lecture and recitation. You should be spending a minimum of eight hours a week reviewing lecture material, reading books on reserve, doing homework, and studying for exams. My advice to you is that you spend at least 3 of those 8 hours reviewing lecture material each week--and that you set aside regular time to study.\n\nEverything that will appear on the exams or the homeworks will be covered in the lectures and lecture notes. However, you will want to supplement the lecture notes with reading from the text or other sources on thermodynamics.\n\nI recommend that you take your own lecture notes on the printed versions of the abridged notes (perhaps with extra paper) and then recopy the notes neatly at a time shortly after the lecture. You could recopy on freshly printed versions of my notes or rewrite it them completely yourself. That way, you are constantly reviewing the important points and will see how everything fits together; I believe you will be surprised at how effective a studying strategy that this is. In fact, I believe it so strongly that I will make the following bargain. Anyone who shows me that they are carefully re-copying the notes will receive--as a reward--half the difference between their score on one of the midterms and the top score for the class for that midterm. To receive this bonus, you must show your carefully recopied notes at least one day before each exam (i.e., three times during the semester). To determine whether you have been sufficiently assiduous to receive this bonus.\n\nOutside Reading\n\nAlthough there is no formal text for this course, you should be doing a couple hours a week of reading. You are all mature enough to find readings on your own that supplement parts of the lecture that are hard to understand. There is a section below that lists some of the thousands of books on thermodynamics. People tend to like the second book on thermodynamics that they use more than the first. I think this is because thermodynamics is deceptively subtle and students really need some familiarity with the difficulties before they can understand them.\n\nIf you are having trouble finding outside reading for a particular - ask!\n\nThis struggle with familiarity creates a dilemma for professors of thermodynamics: should the first course in thermodynamics be taught as formulaic solving of the standard problems--or should one try to teach the more philosophical aspects of the subject. I am not sure which is the best approach. I was educated with the practical first approach, but I have chosen the second for MIT 3.00 because I find it more interesting and hopefully more useful in the long-run. I am pretty sure that this theoretical approach is not the best for\nevery\nstudent; but, I hope that it is best for the majority.\n\nAs a hedge, I have worked with past TA's of this course to create a library of practical solved problems for each week. You can find these on the 3.00 website. I encourage you to study the practical problems.\n\nAbout Thermodynamics\n\nMany consider this a \"vegetables\" class--as in \"eating your vegetables first.\" It is true that thermodynamics is about developing a rigorous understanding of natural processes. And it is true that thermodynamics can become tedious and also true that the useful applications don't begin until a solid foundation is developed. However, I don't think it necessarily has to be boring and I encourage you to keep your minds open about the beauty of developing a subject rigorously. Veggies can be tasty as well.\n\nMuch of what you will learn about materials science will rely on your comprehension of thermodynamics. Unfortunately, most of you do not yet know about all the wonderful things you are going to learn over the next three years as you become a professional materials scientist and how they depend on this course. So, there will be times when you will be struggling to learn something without knowing why you should bother to learn it. Had we an infinite amount of time, I would introduce a practical aspect of each thermodynamic concept, then rigorously teach you the concept, and then show how it applies in a particular case. However, there are a large number of concepts that I must teach you in a finite amount of time. Furthermore, some concepts are so basic and essential that any practical example would seem artificial\n\\[6\\]\n. I have tried to distill the thermodynamics you will need to know into 37 lectures--sometimes you are going to have to trust that I am trying to teach you something useful.\n\nI truly and deeply like thermodynamics and have liked it since the first time I took it. It is elegant and beautiful. I also think that it takes many years to master this subject. I believe that a thorough understanding of the subject--especially of the second law--separates qualified scientists from amateurs and pretenders.\n\nHowever, I encourage you to be skeptical about what I tell you. Here are some excerpts from what others have said about thermodynamics:\n\nA theory is the more impressive the greater the simplicity of its premises, the more different kinds of things it relates, and the more extended its area of applicability. Therefore the deep impression that classical thermodynamics made upon me. It is the only physical theory of universal content which I am convinced will never be overthrown, within the framework of applicability of its basic concepts.\n\n-A. Einstein.\n\nOnce or twice I have been provoked and asked the company how many of them could describe the Second Law of Thermodynamics. The response was cold: It was also negative. Yet I was asking something which is about the scientific equivalent of \"Have you read a work of Shakespeare's?\"\n\n-C.P. Snow\n\\[7\\]\n.\n\nThe law that entropy always increases-the second law of thermodynamics-holds I think, the supreme position among the laws of Nature. If someone points out to you that your pet theory of the universe is in disagreement with Maxwell's equations--then so much worse for Maxwell equations. If it is found to be contradicted by observation--well these experimentalists do bungle things sometimes. But if your theory is found to be against the second law of Thermodynamics, I can give you no hope; there is nothing for it but to collapse in deepest humiliation.\n\n-Sir A.S. Eddington.\n\nLisa, get in here. In this house we obey the laws of thermodynamics!\n\n-Homer Simpson.\n\nText and Reading Materials\n\nPrimary Text\n\nThe primary source of material will come from the lecture notes. You should print out the lecture notes before coming to class, or make your own notes and combine them with the printed lecture notes.\n\nLast year I used a classical textbook by Denbigh in this course to supplement the lecture material. The students didn't like it because Denbigh is a bit advanced for a first thermodynamics course, but it is the best thermodynamics book that I know of. It is rigorous and descriptive. It will be a useful reference for you in the future as well as this class--I would encourage you to get your hands on a copy.\n\nAdditional Reference Material\n\nIn the first part of this course, it might also be useful for you to browse through the classic monograph by Fermi . It is a classic introduction to the fundamentals of thermodynamics--it is also a bargain. The coverage in Fermi is generic and applicable to all branches of physics and engineering. Concepts that are specific to materials science will be covered in the lectures.\n\nIt is very useful to take a look at one or two of the hundreds of other thermodynamics texts\n\\[8\\]\n. Everyone learns in different ways and you may find one that is particularly suitable for you. Perhaps the reason that there are so many thermodynamics texts is that few people agree on the best way to explain the material. You will find that notation varies considerably from book to book (and sometimes even within a single text). You can often learn just by sorting out differences in notation--after all, it is only the subject material that counts. You will learn even more if you study the different ways that similar subject material is developed. You will begin to master the subject when you start identifying the conceptual errors that exist in nearly every textbook.\n\nGaskell and Devereux are widely used in Materials Sciences courses at other good universities. Gaskell, in particular, is full of practical worked problems for materials scientists. Keep in mind that notation varies from textbook to textbook; nevertheless, these books may help clarify complicated topics and provide additional practical problems.\n\nStatistical Physics\nfrom the Landau and Lifshitz series is an excellent advanced treatise on both classical and statistical thermodynamics. It is ponderous, but is a good investment if you find yourself needing more thermo.\n\nDenbigh is perhaps the most complete textbook on chemical equilibrium. It is dense but very well-written. The introductory book by Bent has a number of very clear examples and historical anecdotes, I used it very often while preparing lectures.\n\nBesides Fermi, Planck also wrote short and very readable introductory treatises on thermodynamics. Shrodinger has a very nice (but perhaps too advanced for this course) introduction to statistical thermodynamics that is also a bargain. You probably associate these authors with other topics--their interest in the formulation of thermodynamics demonstrates the importance that most professional scientists place on a coherent understanding of thermodynamics as a foundation for advanced study. Chandrasekhar devoted an entire chapter of his book on Stellar Structure to the differential geometry of the second law of thermodynamics. The most complete and fundamental development of thermodynamics is a single paper by J. Willard Gibbs. Even though it is very difficult to read, Gibbs is the quintessential reference in thermodynamics. I've tried to use Gibbs as much as possible when I prepared the lectures.\n\nYou should have a good book on multivariable calculus. MIT's 18.02 is a prerequisite for this course.\n\nBibliography\n\nBent, Henry A.\nThe Second Law: An Introduction to Classical and Statistical Thermodynamics\n. Oxford University Press, 1965.\n\nChandrasekhar, S.\nAn Introduction to the Study of Stellar Structure\n. New York: Dover Publications, 1939.\n\nDenbigh K.\nThe Principles of Chemical Equilibrium\n. 3rd edition. Cambridge Univ. Press, 1971.\n\nDevereux, Owen F.\nTopics in Metallurgical Thermodynamics\n. NY: John Wiley and Sons, 1983.\n\nFermi, Enrico.\nThermodynamics\n. New York: Dover Publications, 1936.\n\nGaskell, David R.\nIntroduction to Metallurgical Thermodynamics\n. NY: McGraw-Hill, 2nd edition, 1981.\n\nGibbs, J. Willard. \"On the equilibrium of heterogeneous substances.\" (1876). In\nCollected Works\n1, Longmans, Green, and Co., 1928.\n\nLifshitz, E.M., and L.P. Pitaevskii.\nStatistical Physics.\n3rd edition. Part 1. New York: Pergammon Press, 1980, pages 365ff.\n\nPlanck, Max.\nTreatise on Thermodynamics\n. 7th edition. New York: Dover Publications, 1926.\n\nShrodinger, Edwin.\nStatistical Thermodynamics\n. Dover, 1989.\n\nFootnotes\n\nHomeworks\n\\[1\\]\n\nGroups are comprised of two or more people.\n\n\\[2\\]\n\nWith the caveat about group participation described below.\n\nHomework\n\\[3\\]\n\nYou can be associated through your group with only one late homework. Acceptable homeworks expire one week after their due date--i.e., you get one week's grace for a late homework.\n\ngroup\n\\[4\\]\n\nLate homeworks will be charged to all members of the group.\n\nLecture\n\\[5\\]\n\nAt least, I will do my best to get them there on time.\n\nArtificial\n\\[6\\]\n\nThink about how you might try motivate a very young student to learn multiplication, algebra, Newton's laws, or calculus--there are some things that you just need to know to get on with life.\n\nSnow\n\\[7\\]\n\nC.P. Snow (1905-1980) was a physicist and novelist that explored, among other things, the culture of science and the relationship of science to culture. To be fair, this quote is out of context, for in his book Two Cultures, Snow is exposing the hypocrisy of company is a group of liberal artists who scoff at what they call the narrow-mindedness of scientists. However, I think that the same question, if applied to a modern group of scientists, might have the same reaction.\n\ntexts\n\\[8\\]\n\nSometimes you will find the entire solution to a troublesome homework question--I think it is perfectly acceptable to transcribe a (homework) solution that you find elsewhere. However, attribution is a moral question that I will leave to you.",
  "files": [
    {
      "category": "Resource",
      "title": "ps_01.PDF",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-00-thermodynamics-of-materials-fall-2002/bc0e583cc98ee8457335d41f156fd53e_ps_01.PDF",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "sol_ps1.PDF",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-00-thermodynamics-of-materials-fall-2002/f14240831b751691f484a440ca793710_sol_ps1.PDF",
      "content": "\"!$#&%('*) +\",.-/!(,10$32450( ,76\n'*+8+\"'9:\"; <='*)?>@,.A10(\"BC,.!.DE\nFCG\nH'-I2JC,2K-L'M4 ,.+N4 ,.!@A.%(\") 8;&<0( ,O)P,132QBM8'*%:'C6R2K!@SM!@0(,.-5T<C\"B*,1;A.,.%U0V2C\";WA1'*; !U0X%X28;0X!\nG\nYMG[Z\n-\\# 32C!@8]1,\\0( ,L\"-L#'*%U0V2C; A1,'C6^0( ,_2C!@!(` -\\#&0(8'*; !-L2C4 ,\nG\n,.%@,I9^,1%(,L!(,1BC,.%(2C+^A1'*%(%@,.A10=2C; !U9^,1%(!.T\n4&,.#,.; 4 \"; <'*;0X ,2C!@!(` -\\#&0X\"'*; !-L2C4 ,O20:0( ,O)P,1<*8; ;&8; <\nG\naG$b\n;0(%('M4 ` A10(8'*;c0('\\A1'*; !@,.%@B20(8'*;5# %@8; A18# +\",.!\nG\nd\nG[e\n%@'*-L'0X,7A.%@,Q20(\"BC,O0( 8;&JM\"; <\nG\nf\n; A1,_S*'*`g32C4h,1!@0X2C) +8\"!( ,14i0X ,2!(!(`&-L#&0(8'*;&!K2C; 4g4 ,kj3; ,.4h0( ,_B2C%(82C) +8,1!l0('m)P,_\"; A.'C%(#'*%X20(,.4h\";n0X ,\n-\\'4&,.+oTpS*'*`q9r,.%@,s,kt#,.Ak0X,.4u0('i,.!U0V2C) +\"8!@u2v)32+w2C; A1,x,1yM` 20X\"'*;q'*%\\,.y?`320(8'*;z6\n'*%L0( ,xA1'*; !(,1%@B20(8'*;q'6\n<*,1%() \"+#'*# ` +820X\"'*;\nG\n{l|}_~@\n\n~?N\nqg}3@N\n@*\n\n!(\"-L\"+w2C%)32C+82C; A1,p,1y?`320X\"'*;AQ2C;)P,9:%@\"0(0(,.;O6\n'*%J?\"0@0X,.;#'*# ` +820X\"'*;7'*%A.` %@%(,1;?0J?\"0@0X,.;'MA.A.`&#32C; AkS\n~fO\nG\n'C0(!'C662A10X'C%(!A.'C` +842P,.Ak0:0X ,7<*,1%() \"+N#'*# ` +820X\"'*;\nG\nH';32C-\\,72=6\n,19OT3) \"%@0(2C; 454 ,Q20(%X20(,7'C6R<C,.%()&8+8!1T\n) \"%@0(W2; 44 ,Q20(W%(20X,O'C6J?\"0@0X,.;&!.T3<*,1%() \"+,.!@AQ2C#,l%(20X,T J?\"0@0X,.;5,.!@AQ2C#,%X20(,7,10XA\nG\"GG\n\n+8+0X ,=2C!(!@` -L,14m62CA10('*%(![; ,.,14s0X'c),8;&A.'*%@#P'*%(20X,14s8;W0X ,l)32C+w2; A.,=,1y?`320X\"'*;s# %@'*#,.%(+S\nG¡\n'C%¡,kt&2C-\\# +\",CT\n0( ,OA.` %@%(,.;0[<*,.%@) 8+'MA.A1` #32C;&A1S8!$2=6\n` ; Ak0X\"'*;W'60( ,l;?` -)P,1%$'6¢AQ20X!$20:0X320$0(8-\\,\n~\n#&%('£BM84 ,14WS*'C`W32QBC,\n2C;52C!@!(` -\\#&0(8'*;c0X 20$AQ20(!$4&'\\,.20:0X ,O<*,1%() \"+8!1¤\n\nG\n¥lf~\n\n'C0( ,.%0(,.%(-\\!$¦ §\n\n(c)\na\n~{l«m}@*\n\n9: ,1%(,\nf\n\"!0X ,OA1` %(%@,.;0$JM0(0(,.;5'A1A.` #32; A1S\nG\nH'I%(,1;0!(# 2CA.,6\n'C%$<C,.%()&8+8![2C; 4WJ?\"0(0(,.; !1TSC'*`s; ,1,.4x0('IJ?; '£9OTN'C;s2C;m2QBC,.%X2<*,CT¬0X ,l<*,.%@) 8+#'*# ` +820X\"'*;\n\";W2=9r,.,1J\nG\n\"!$\"!<*\"BC,.;5)S\n\n{|l}(r) ¥lf~\n# %(,kB\"'*` !9r,.,.J\n\n¦\n~\nF*G° *±\n9^,1,.J\n\n§2&3o3o (3μQ¶\n2&3o3o X·\n1 »o1⁄4\n(c)\n~{|l}U*\ne\n'C8;0X!K6\n'*%0( ,# %('C) +8,1-1⁄2!('C+8`&0(8'*;i9r,.%@,x2Q9^2C%(4 ,14z# 2C%@0(+\"Sn6\n'C%=0X ,_9:%@\"0X\"; <m4 '£9:;g0X ,52C!@!(` -\\#&0X\"'*; !\n2C;&4W4 ,kj3; 0X8'C; !\n~\nd\n*3⁄4\n\nT #32C%U0X+SI6\n'*%9:%@\"0X\"; <4 '£9:;50( ,O)32C+82C; A.,O,1yM` 20X\"'*;\n~\naC 3⁄4\n\n2C; 45%(,.!U0:6\n'*%0X ,O-\\'4&,.+\n9:%@\"0(0(,.;4 '£9:;W9:0X \";_0X ,OA1'*; !@0(%X2C\";0X!$2C; 45+8\")P,1%@0X\",.!2!(!(`&-L,14\nG\n¿»AAkA^A¢A1A£Æ\nA@C»EE°EkA@AA1AE°A1A\nEI1A@AII(I\nAPÐIA1AENA@AAA»EOO\nF"
    },
    {
      "category": "Resource",
      "title": "exweek2.PDF",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-00-thermodynamics-of-materials-fall-2002/88a01170700421ee6cc59968ebb58a6f_exweek2.PDF",
      "content": "stored\nin\nthe\nsystem\nof\nsprings\nis\ngiv\nen\nb\nelo\nw\nwhere\nx\nA;0\nand\nx\nB\n;0\nare\nthe\nequilibrium\nlengths\nof\neac\nh\nfree\nspring.\nE\n=\n\nk\nA\n(x\nA\nx\nA;0\n)\n\n+\n\nk\nB\n(x\nB\nx\nB\n;0\n)\n\nIf\nthe\nlength\nof\nspring\nA\nis\nx\nA\nand\nthen\nthe\nlength\nof\nspring\nB\nis\nL\nx\nA\n.The\nequilibrium\nstate\nof\nthe\nsystem\nis\nthe\none\nwith\nthe\nlo\nw\nest\nenergy\n.\nThis\nis\nequiv\nalen\nt\nto\ncalculating\ndE\ndx\nA\nj\nx\nA\n=x\nf\nand\nsolving\nfor\nx\nf\n.\nE\n=\n\nk\nA\n(x\nA\nx\nA;0\n)\n\n+\n\nk\nB\n(L\nx\nA\nx\nB\n;0\n)\n\ndE\ndx\nA\nj\nx\nA\n=x\nf\n=\n=\nk\nA\n(x\nf\nx\nA;0\n)\nk\nB\n(L\nx\nf\nx\nB\n;0\n)\n(k\nA\n+\nk\nB\n)x\nf\n=\nk\nA\nx\nA;0\n+\nk\nB\n(L\nx\nB\n;0\n)\nx\nf\n=\nk\nA\nx\nA;0\n+\nk\nB\n(L\nx\nB\n;0\n)\n(k\nA\n+\nk\nB\n)\nNote\nthat\nthere\nis\nan\nupp\ner\nand\nlo\nw\ner\nb\nound\non\nthe\nequilibrium\np\nosition,x\nf\n.\nMathemat-\nically\n,\n<\nx\nf\n<\nL.\nHo\nw\nev\ner,\neac\nh\nspring\nhas\na\nnite\nv\nolume\nand\ncompressibilit\ny\nso\nthe\nlimits\non\nx\nf\nare\ncloser\ntogether\nin\na\nb\netter\nappro\nximation.\nThe\nforce\non\na\nspring\nis\ngiv\nen\nb\ny\nF\n=\ndE\ndx\n=\nk\n(x\nx\n).\nF\nA\n=\nk\nA\n(x\nf\nx\nA;0\n)\nF\nA\n=\nk\nA\n(\nk\nA\nx\nA;0\n+\nk\nB\n(L\nx\nB\n;0\n)\n(k\nA\n+\nk\nB\n)\nx\nA;0\n)\nF\nA\n=\nk\nA\nk\nB\n(L\nx\nA;0\nx\nB\n;0\n)\nk\nA\n+\nk\nB\nand\nF\nB\n=\nk\nB\n(L\nx\nf\nx\nB\n;0\n)\nF\nB\n=\nk\nB\n(L\nk\nA\nx\nA;0\n+\nk\nB\n(L\nx\nB\n;0\n)\n(k\nA\n+\nk\nB\n)\nx\nB\n;0\n)\nF\nB\n=\nk\nA\nk\nB\n(L\nx\nA;0\nx\nB\n;0\n)\nk\nA\n+\nk\nB\nNote\nthat\nthe\nforces\non\nsprings\nA\nand\nB\nare\nequal\nin\nmagnitude\nbut\nopp\nosite\nin\ndirection.\nW\ne\ncould\nha\nv\ne\nfound\nx\nf\nusing\nthis\ndenition\nof\nequilibrium.\nThe\nmathematics\nthat\nresult\nare\nexactly\nthe\nsame.\nNo\nw\nsubstitution\nof\nthe\nnal\nand\ninitial\np\nositions\nin\nto\nthe\nenergy\nexpressions\nwill\nyield\nthe\nc\nhange\nin\nin\nternal\nenergy\nfor\neac\nh\nspring.\nE\nA\n=\nE\nA;f\nE\nA;i\nE\nA\n=\n\nk\nA\n(x\nf\nx\nA;0\n)\n\n+\n\nk\nA\n(x\ni\nx\nA;0\n)\n\nE\nA\n=\n\nk\nA\n\"\n(\nk\nA\nx\nA;0\n+\nk\nB\n(L\nx\nB\n;0\n)\n(k\nA\n+\nk\nB\n)\nx\nA;0\n)\n\n(x\ni\nx\nA;0\n)\n\n#\n\nand\nE\nB\n=\nE\nB\n;f\nE\nB\n;i\nE\nB\n=\n\nk\nB\n(L\nx\nf\nx\nB\n;0\n)\n\n+\n\nk\nB\n(L\nx\ni\nx\nB\n;0\n)\n\nE\nB\n=\n\nk\nB\n\"\n(L\nk\nA\nx\nA;0\n+\nk\nB\n(L\nx\nB\n;0\n)\n(k\nA\n+\nk\nB\n)\nx\nB\n;0\n)\n\n+\n(L\nx\ni\nx\nB\n;0\n)\n\n#\nNote\nthat\nin\ngeneral\nthe\nc\nhange\nin\nin\nternal\nenergy\nof\nspring\nA\nis\ndieren\nt\nfrom\nthat\nfor\nspring\nB.\nThe\ntotal\nc\nhange\nin\nin\nternal\nenergy\nof\nthe\nsystem\nof\nsprings\nis\nnot\np\nositiv\ne."
    },
    {
      "category": "Resource",
      "title": "ps_02.PDF",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-00-thermodynamics-of-materials-fall-2002/4dd47afa9474e29ad184b122b3f50083_ps_02.PDF",
      "content": "(c)aÞUc Ez÷ 1 rA£|·£U«U]3+«|_ U Uc£«¬\nE\nþ+«|P a Uc£«UÞHEU1(r)A· U«;Ya·A£Þ·aEX ·E± n£EX N£c\næ\n£\n«iUYAaEXr«a· zE]EÞA· aYa·A£cÞTUn|U]£cÞa6«iUYAaE];«i£|«|«|ß\ni\n¬\n(c)aÞU§ÞnU N+«|EÞa NaE4EX UPEv|U_¬§¡ÞIE«4Ev4EX N«|P a Uc£«<cÞnU NaEXHEXEßaEßa3 3KØ_Ø¬(c)aÞU$H IEvHE_ Ur£\n÷·aØPÞn£oEXEc£UE]«UEN«| U N Ev|UX3£ÞatUY·_ U«t14¤A· U«E]o·«Ec«|Xa £|·P ££ÞUtEP &%a·Ec£oaEv·ßP £6·a £Þa\ncUY·P U«14¤tA· a«¬\n\n£|EzEÞIE] S«|P a Uc£«\næ\nEz«|' U4Y6 SEX«(I£Evþ·aEX ð«|P U a£«\ni\nÞnU EXaIE_EXaIE!EßUEßa\næ\nX#EXaIE_EXaIE\nEßaEßaEß\ni\nEX Uß\n£ÞUN4Eoc£Y§ i£Þa YEc££NEX Uß\n£ÞUN«|«i£c£÷«|ÞU4Y6«1EEÞIE] UØ_N· i£Þa Yc£)\n«t±]· n£1X3\nUY·Y;¬\n*rX6 NX6· r3k] TEz£|·P ± «Þ£|£±¥,+ +YaY)Y;¬\n«|±¬\nUEP a B¬\nßU -+/.\ntY6Þ0_μ\n1+4·aE] 1·E]¬\nÞn£\n1)\nA)ÞHEXUnU\nYa·A£cÞ\n£\n«iUYAaE]«÷c1A· a#EX aß\nßaP -)\n£÷EzEz·A36UnP DEzE]\nTE·A£ÞU NNX UX£12\nY6ÞUc£cÞa;UnP\nEvrzE]«| Ya·A£Þ\n£ÞIEz£;·« Eß·AuBc n£÷ Ev£|£c4¬\nE\n«| oU_ i Uß\naX£t«i£|·Ec£1UnP rc«|cA3a£\nUØ]A·«|Þ3\n¤"
    },
    {
      "category": "Resource",
      "title": "sol_ps2.PDF",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-00-thermodynamics-of-materials-fall-2002/8852a55a2bb25938b11b751963a071bf_sol_ps2.PDF",
      "content": "\"!\n#%$'&()+*,$-!\n*,./102$43% (./56,78:9;)+/9,)=<, ($4>@?-$4 (AB#%)+*,$C> (EDF G G$HI' G.KJL*B3'?B$MJL)8&\n<.)N>'78 GFIMO3' GP G$%3Q*,$QJL*B3% G7RPM.J1 S G.OUTWV/TX$%3QYP%I?)8&G7Z&G*,$'[$@/\\^]\n_a`cbed;fQg\nh\ng\ni(_\nhkj\nf-l\ninm\nf-o/p\nDOI' G.K\nd;fQgSq\nh\ng\n)8r.K S!\nG..K G3\"K*srI% t)+$ G.$M7BP%.K (K#%.K u3%#' F*:I% uvK.K&(K)8*,$> (EDF G G$LJL*,78 (&G#%7+ G\n$%3\nf-l\n)+O$w SxB.Ky<*,78#'J1 T%K*,JL (K)8JL GOK*B&G)8 (3wDO)=IzI' ^<*,78#'J1 sP G.OJL*,78 (&G#%7+\n5{.K)= |*#'LC3%)+}R G. G$)87~ xP%.K (KK)+*,$!\n*.Y\nf\n)8$ (.KJLY*!:3%)+}R G. G$)878*!:KI% |I' G.KJL*B3'?B$MJL)8&\n<.)N>'78 G(\n\nI' ;K*,7+#')+*,$|)+~P%. (KE?K.)+9,IK!\n*,.Dt.3;$% /D~?|)+~*\"3')+}R G.K ($)Nv :KI% s G$K)8.K : SxP%. GK)8*,$$'3\n9.K*,#%PCKI% Y (.KJLs&G*,..K GPR*$%3%)8$'9wK*w\nf\nTr\n`\nTZ\np\nT$%3\nh\nU/$%*KI% G.;D~?C*w3%*w)+s>@?-)8JLP%78)+&G)=\n3')+}R G.K ($)Nv)8*$\n\nI% .K G79 (A@#M)+*,$w&$> . (DO.)+KK G$K#%&[IIMvT\nf\nm\nf\n_\npO\nh\n\n`i\n\nf\nm\n\nf\n\n`{OB\n\n`b\nf\n\nh\nB\n\nh\nb\nf\n\np\n@\n\np\n\n$C$C GA@#%)=<78 ($@D~?T?,*#C&G*,#'783CIM< UDO.K)=K ($QKI% U!\n#%$%&S)+*,$\n`m`1_\nh\nKpO[f\ni\n$%3- SxB.K&(;\nf\n!\n.*,JKI% s!\n*,787+*DO)8$%9%\n\n`\nm\n\n`\n\nf\nB\n\nf\nbF\n`\n\nh\nOB\n\nh\nb\n`\n\np\n/r\n\np\n\n*,.~)8$%[$%&( T%KI% s M.KK G.J\n¡¢\n\n¢\n:£\n\n&$>R ^ S<78#MK G3\n\n`\n\np\n\nm\nfQo\nh¤j\nf-l\n¥\nK)+$%9L$?z*,$% ^*!rI% ^JL (KI%*3'O?*,#wD~*,#'783w9, (\n\nf\nm\n_\nhkj\nl\"f\ni\n\n`b¦_a`\nj\n_\nd;f\ng\nq\nh\ng\niZb¦_ §\nd;lUfQ(c)Sq\nh\n(c)\niKi\n\nh¦j\nosf\n\np\nl\n`b\no/p\nba_ «\nd/l\"f\ng\nq\nh\ng\ni\nj\n_¬§\nd;fyq\nh\ni\n§\n:&[Iy3M?\";&G G.[)+$yJL*,#%$*!XD~ (. (<P*,.K G(r)!\n.*,JKI% u*B&G $%GT78 (GT@$%3y G.KIYK#%.!a&G O$'3\n!\n*.KJLDtK G.<PR*.$%3&(78*,#'3%)+$sI% FJL*,P%I% G. °2&[IU3M?O&G G.[)+$UJ1*,#'$@r*!'.)+$s!a787+Z>M&[\nK*sI% O .I±- KI% :. *,$M>'78 OK#%JLP')+*,$yIMGT*,$yI% <, (.9, TBKI% O G$% (.K9?y&(*,$%#%J1 (3>?\nS<PR*.K)8$%9$%3478)=!2)+$wKI% UD~ (.s)8: GA@#M7r*KI% \" G$' G.K9?CP%.*3%#'&G G3H>?Q&G*,$%3' G$%K)+*,$H$%34.K)8$\n!a7878)+$%9L>M&[ -K*z .I\n\n*w S<PR*,.K U*,$% YJL*,78 *!DtK G.(TP%P%.K*x)8J1K G7+?3% ,μ, ^¶*,#'78 G/*!2I%\n\nI\n\nJ\n*\n#\n$\n\n*\n!\nD\n*\n.\n\n.\n\nA\n#\n)\n.\n\n&\nI\n\n?\n\n*\nP\n.\n*\n#\n&\n\nI\n\n.\n\n)\n$\n\nI\n\n.\n\n)\n$\n\nI\n\nI\n\n)\n\nT\n\nI\n\nD\n*\n.\n\nK*Y (<P*,.v s$'37+)+!22I% ;D~K G.G(r)·2*,#zJ1?$' G G3w*\" %$%3w3M[UK*YI% G7+PwJ /I')8t ()+Jv ;#%&[I\nKI% ;< G.9, :I' G)89I@F*!.K)8$L&G7+*,#%3T@ ODOIM2I'*,K 3M. /$%3L!\n.*,J DOI% ($%&G I% S?1&GJL\n)+K&(#%K;DOIMv)+sK#%P'P%7+?B)8$'9|I%)+s3M)87=?- ($% G.9?,Lo~*J1PM.K \"I')8s3M)+7+?Q G$% (.K9?C&G*,$%#%JLP')+*,$4DO)+I\nKI% ^ G$% (.K9?|P%.K*B3%#%&( G3- G&[Iw?, .:)+$zJ1 S.K*PR*,7+)+$zV~*,*,$\n\n.*,JKI% ^P%.K*,>'78 GJ (J1 ($@GT\n\nI% G$% (.K9?zK*y78)+!2FDtv G.\nm\n($% G.9?zP%.*3'#%&G (3->?z&G*$%3% G$'K)8*,$Q$%3.)+$\n\nI' M.FK GPDF*,#%7+3> OK* M$'31I' <*,78#%JL O*!D~K G.~ S<PR*.K G3L)8$yI% K#%.!a&G :*! G.KI»)+$%&G\n787,I' ~Dtv G.)8°K#%J1 (3U*/P%.K (&G)8P')+[v F$%3\" S#%.$% G3y.)+$T,$\"<, (.9, ~.)+$'!a7873%[:$%3\" G.KI\n#%.!a&G s. DF*,#%7+3z>R /$% G (3% G3z*U GK)8J1 I%)+G(r)¦K)8JLP%7+)+!2?B)8$%9K#%JLP'K)8*,$!\n*.FI' ;&7+&G#%78)+*,$\n*!M<,*,7+#%J1 F*!XDtv G.°P%.K (&G)8P')+[v G3U&G*,#%7+3\"> ~IMv(r)I% ~&G#%.<v#%. u*!XK#%.!a&G u)+< G.?UKJ1787B&G*J1PM.K G3\nK*zI% 1<, G.K9, LI% G)+9,I*!tP%. G&()8P%)=[K)8*,$\n_\n\nI% y!\n*,787+*DO)+$%9|3Mv[.K Y!\n.K*J1⁄4P%.K*>%78 (J1⁄4K*,7+#')+*,$%s>?\nKI% 9.K*,#%P6\\O?,$1⁄2o~78.K XT\n$%)8 (7~±Q&3⁄4I% ( T\n\n?B7+*,.\"»B&[I%)87+3%9, G$T(r)/7+ Sx{V~.K3%78 S?4¿;. GP*,.K G36 ($\n!\n.*,JA&(78)+JK /P%. G3%)+&(K)8*,$w&G ($ G.(TμAμv¿\n§\n, , 3M[\ni\n\n978*,>M7P%. G&G)+P%)+)+*,$z<, (.9 P G.O3M?\nm«\nJ1J\n.K3%)+#%u*! .I\nmA,«\nAB @JL\n#%.!a&G .K GY*!(r) G.KI\nmA\n+\"A1 BA\nÆJ\ng\n<*,78#'J1 *!P%. G&G)+P%)+)+*,$\nm\nK#%.!a&G s.K yA<, G.K9, ;P'.K G&()8P%)=[K)8*,$\nm¤«\nW BA@ BC\n(c)\nA\nA\n=Ay BA\nÆuJ\n(c)\nm\n\nA\n\n«\nA@\nA\ng\nJ\n(c)\nJ1u*!°P'.K G&()8P%)=[K)8*,$\nm\n3% G$'K)+E?CA<*,78#%JL\nm\n\nA\n\n«\nA@ BAaEO @9\n_\n3% G$'K)+E?w*!D~ (.\nm\n9,JE&(&\ni\n$@#%JU>R (.*!°JL*,78 (t*!rDtv G.\nm\nK*[7JK:E\"J1*,78.~J1\nm\n\nA\n\n«\nEE1A BAaE\nm\nE\nA\nA1 BA\nÆ\nE\nSxB^K GPH)8:*z&78&G#'7NK I' Y G$% (.K9?-KP G$*,$478)=!2)8$'9LKI%)8; (K)8J1 (3C<,*,7+#%J1 *!Dtv G.;K*|I%\nvJL*,KP%I' G.K\n\nI% G$% (.K9?{$% G (3% G3K*C (<P*,.K LDtK G.\")+9)+<, ($)8${I% 1P%.K*,>'78 GJI[K GJL G$Y\n3' ,μ, ;¶*,#%78 (;P G.;9,.KJ;?,*,#CDF*,#%7+3H78*|$% G (3{*,JL U)8$!\n*,.KJ1)+*,$*,$CI% y< G.9, YI% G)+9,I/KI% G\n3'.K*,P%. 78)=!2 (3*.KI% |<, (.9 &G7+*,#%3{I% G)+9,IK*-&78&G#'7NK L)=PR* G$K)N7 G$' G.K9?{&[I%$%9,\n\nI%\nK*[7r ($% G.9?QPR (./3M?3M?-&G$C> U ()+Jv G3!\n.K*,JKI% G \"&7+&G#%78)+*,$%(\n\nI%)8/J1*#%$/*! ($% G.9?\n)+u&G*,$'K#%JL G3 (< G.?B3M?>?zI% sD~ (.uIMO.K)8$' (I\n¤. *,$M>'78 ^3%)8[$'&G uDOI%)+&[IQ&(78*,#%3':.K ;!\n*,.J1 (3&(*,#%7+3> .K*#%$%3\nA\n, , \" @JLG\n\nI' Y G$% (.K9?4$' G G3' G3H*z78)=!2/KI% YJKs*!D~ (.;*|I')8sI% ()89,I\nm\nJwA9AI\nm\n\nA\n\n«\nA BAaE\"Aμ'IEQA\nA\n, , yI*,#%7+ G\nm\nABW3μ,A@A@\ngEI\n¶*,#'78 G\n\nI' s G$% (.K9?$% G (3% G3w*Y S<PR*,.K ;KI% ; ($@K)8. ;<,*,7+#%J1 /*!ZDtv G.\nm\n$@#%J\"> G.t*!rJL*,78 (:A G$' G.K9?!\n*,.\nS<PR*.K)8*,$zP G.uJL*,78\nm\nE'\nA\nA1 @A\nÆA3% μ, LI*,#%78 (\nm«\nÐ3μ\n§A,A\nA BAaN;I*#%78 (G\n\nI' ^K*[7 G$% (.K9?zK*y (<P*,.K ^$%378)=!2\nmA_\nAW3,μA\nb\nWE\nA,i\nA\ngEI\nI*,#%7+ G\nm\nE'\n«\n3@AA@\ngEI\nI*,#%7+ G(\n)+K&(#%K)8*,$L*,$yDOIMF)82K#%P%P'7+?B)8$%9^I' : ($% G.9?y*78)+!2°I%)+~JL*,#%$2*!RDtK G.2&$1>R *,$L!\n.&S)8*$L*!\n#%$OÐ; G$' G.K9?C.K G&[I%)+$%9| .IT*,$-KI% U!\n.K&(K)8*,$Q*!Dtv G./K#%.!a&G Y<)+7N>%7+ TX<, (.9 Y9,78*,>%7Z GJY¿\nP G.K#'.K TB*,O(*,$% /78?, G.u$%3|$?BKI%)8$'9U G7+K IM~J1)+9,IF} (&(FI% :K#%P%P'7+?L*! G$' G.K9?LK*\" (<P*,.K\n$%3w78)+!2~DtK G.u<*,P%#'.G\n§\n\n&\n*\n$\n\n#\nJ\nP\n\n)\n*\n$\n*\n!\n\nV\n*\n\n*\n$\n)\n\n$\n\n$\n\nI\n\nP\n*\nP\n#\n\n)\n*\n$\n*\n!\n>\n*\n\n*\n$\n\nE\n*\nD\n\nI\n)\n\n&\n\n$\n>\n\n&\n*\nJ\nP\n\n.\n\nD\n)\n\nI\nKI% ^&7+&G#%78 (3|*7 ($% G.9?w&G*,$'K#%JLP')+*,$z*yJ1 ^.)8$|I%.)+$%uPR (.u3M?,\n\nI' P G.O&GP%)+Y&G*,$%#%JLP')+*,$w*!° ($% G.9?z)+$\n¥\n»\nA\n_\n!\n*,.sμμ,μ\nium\n\n«\nA\n^ 5OI\n3⁄4r*,P%#%78)+*,$z*!°V~*,*,$J1 S.*,PR*78)+K*,$\nmA\nTIE\nA\nT\n«,«\n,\n$% (.K9?&(*,$%K#'J1 (34)8$CVF*,K*,$CP G./3%?\nm\n\n«A\n3%LA|\n(c)\nA\nA\nE'\nA««\nyA\nA\n|E\n«AA\nI*,#'78 G\nm\n,\n§\nμ3A\nBA\n(c)\nI*,#%78 (\n:K#%J1)+$%9KIM~JL ;JL*,#%$F*! G$' G.K9?)+~> G)8$'9UP%.*3%#'&G G3|K*!\n( G3|I' ;&G*,$'K#%JLP')+*,$T@I% :.K)8*\n*!° ($% G.9?zP%.*3%#'&G G3Q)8$w>*,K*,$z*YI% ^ ($% G.9?z*yJ1 ^.)8$|I%.)+$¿E SIz)8\n$% (.K9?P%.*3'#%&G (3)8$6V~*,K*,$OEQ$' G.K9?{$' G G3' G3*QJ L.)+$\nm\n,\n§\nμ34A4 @A\n(c)\n¶*,#%7+ GUEQE'\n«\n3A\n\ngEI\n¶*,#%78 (\nm\n,\nA\n3|A1 BCBO\n×EØ(U U U@UYUSU[ÞZÞZÞß\naIaavß\na(a aU[æaU¬aU¬æEUKcveIaæEU[æ aeeæ\nUea[UeæeU[eSaiaIiviaeiKUiEaSðiGU¬a ivUKðvæß\nØ(U¬n\n«"
    },
    {
      "category": "Resource",
      "title": "exweek3.PDF",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-00-thermodynamics-of-materials-fall-2002/91f656caa4dcf5fc072b0023a0b13905_exweek3.PDF",
      "content": "W\ns\n=\n\n(\n+\n)\n+\n\n(\n)\n=\n\nL\n\natm\nBy\nthis\nmetho\nd\nthe\nw\nork\ndone\nb\ny\nthe\nsystem\nis\n\n0:J\n=\nJ\n.\nThe\nsecond\nmetho\nd\nin\nv\nolv\nes\nexamining\nthe\narea\nunder\nthe\ncurv\ne,\na\ncircle\nwith\nradius\n.\nSo\nthe\narea\nis\n\nL\n\natm.\nThis\nagain\nis\nthe\nw\nork\ndone\nb\ny\nthe\nsystem\nequal\nto\nJ\n.\nThe\nmaxim\num\nand\nminim\num\ntemp\neratures\ncan\nb\ne\nfound\nfrom\nthe\nideal\ngas\nla\nw\nfor\none\nmole\nof\ngas,\nP\nV\n=\nR\nT\n.\nT\nmax\nattains\nwhen\n(P\nV\n)\nis\na\nmaxim\num\nand\nT\nmin\nattains\nwhen\n(P\nV\n)\nis\na\nminim\num.\nLet\nP\n=\nP\nand\nV\n=\nV\nso\nP\nV\nis\nan\nextremal\nwhen\nP\nV\nis\nextremal.\nP\nV\n=\nf\n(P\n(V\n);\nV\n)\n=\n\np\n\nV\nV\nd\nf\ndV\n=\n=\n\np\n\nV\n\nV\n\nV\np\n\nV\n=\n\n\"\n\nV\nV\np\n\nV\n#\nThe\nextrema\nare\nfor\nV\n=\n\nq\n\n.\nExamination\nor\nc\nhec\nking\nthe\nsign\nof\nthe\nsecond\nderiv\nativ\ne,\nd\n\nF\ndV\n\n>\nfor\na\nminim\num\nand\nd\n\nF\ndV\n\n<\nfor\na\nmaxim\num,\ngiv\nes\nthe\nfollo\nwing.\n[h]\nV\nP\nV\nP\nmax\nq\n\nq\n\n+\nq\n\n+\nq\n\nmin\nq\n\nq\n\nq\n\nq\n\nThis\nleads\nto\nT\nmax\n=\n(P\nV\n)\nmax\n=R\n=\n0K\nand\nT\nmin\n=\n(P\nV\n)\nmax\n=R\n=\n0K\n.\nIf\nthe\nn\num\nb\ner\nof\nmoles\nare\ndoubled\nthe\nw\nork\ndone\nb\ny\nthe\nsystem\nis\nstill\nW\n=\nJ\nbut\nthe\nmaxim\num\nand\nminim\num\ntemp\neratures\nare\ndecreased\nb\ny\na\nfactor\nof\nt\nw\no\nfrom\nT\n=\nP\nV\n=(nR\n)\nand\nT\nmax\n=\n0K\nand\nT\nmin\n=\nK\n.\nExample\nProblem\n.\nOne\nmole\nof\nide\nal\ngas\nat\n\nC\nand\natm\nunder\ngo\nes\nthe\nfol\nlowing\nr\neversible\npr\no\nc\ness:\n.\nIsothermal\nexp\nansion\nto\n0:atm\n,\nfol\nlowe\nd\nby\n.\nIsob\naric\nexp\nansion\nto\n\nC,\nfol\nlowe\nd\nby\n.\nIsothermal\nc\nompr\nession\nto\natm\n,\nfol\nlowe\nd\nby\n.\nIsob\naric\nc\nompr\nession\nto\n\nC\nThe\nsystem\nthen\nunder\ngo\nes\nthe\nfol\nlowing\ncyclic\npr\no\nc\ness:\n.\nIsob\naric\nexp\nansion\nto\n\nC,\nfol\nlowe\nd\nby\n.\nA\nde\ncr\ne\nase\nin\npr\nessur\ne\nat\nc\nonstant\nvolume\nto\nP\natm\n,\nfol\nlowe\nd\nby\n.\nA\nn\nisob\naric\nc\nompr\nession\nat\nP\natm\nto\n:L\n,\nfol\nlowe\nd\nby\n.\nA\nn\nincr\ne\nase\nin\npr\nessur\ne\nat\nc\nonstant\nvolume\nto\natm.\n\nCalculate\nthe\nvalue\nof\nP\nwhich\nmakes\nthe\nwork\ndone\non\nthe\ngas\nin\nthe\nrst\ncycle\ne\nqual\nto\nthe\nwork\ndone\nby\nthe\ngas\nin\nthe\nse\nc\nond\ncycle.\nSolution\n.\nF\nor\none\nmole\nof\nan\nideal\ngas\nP\nV\n=\nR\nT\nand\nW\n=\nR\nP\ndV\n.\nW\nis\nthe\nw\nork\ndone\nb\ny\nthe\ngas.\nThere\nare\n\nkinds\nof\npro\ncesses\nhere\nand\nthe\nw\nork\nm\nust\nb\ne\ncalculated\naccordingly\n.\n.\nF\nor\nan\nisothermal\npro\ncess\n(T\nis\nconstan\nt):\nP\n=\nR\nT\n=V\nso\nW\n=\nR\nT\nln\nV\n\nV\n=\nR\nT\nln\nP\nP\n\n.\n.\nF\nor\nan\nisobaric\npro\ncess\n(P\nis\nconstan\nt):\nW\n=\nP\n(V\n\nV\n)\n=\nR\n(T\n\nT\n)\n.\nF\nor\na\nconstan\nt\nv\nolume\npro\ncess\n(one\nof\nthe\niso\nc\nhoric\npro\ncesses)\nW\n=\nbut\nthe\npressure\nand\ntemp\nerature\nwill\nc\nhange.\nLet's\nb\negin\nb\ny\nsummarizing\nthe\ntransformations\nof\nthe\ngas\nb\ny\nrecording\nthe\nT,P\n,V\nb\nefore\nand\nafter\neac\nh\npro\ncess\nin\nliters,\natmospheres\nand\nKelvin\nand\nalso\nthe\nform\nof\nthe\nw\nork\ndone\nb\ny\nthe\nsystem.\nT\nP\nV\nT\n\nP\n\nV\n\nW\ni\n\n.\n\n0:\n.\nW\n\n=\nR\nT\nln\nP\nP\n\n0:\n.\n\n0:\n.\nW\n\n=\nR\n(T\n\nT\n)\n\n0:\n.\n\n.\nW\n\n=\nR\nT\nln\nP\nP\n\n.\n\n.\nW\n\n=\nR\n(T\n\nT\n)\n\n.\n\nV\nu\nW\n\n=\nR\n(T\n\nT\n)\n\nV\nu\nT\n\nP\nu\nV\nu\nW\n\n=\nT\n\nP\nu\nV\nu\nT\n\nP\nu\n:\nW\n\n=\nR\n(T\n\nT\n)\n.\nP\nu\n:\n.\n\n:\nW\n\n=\nF\nor\nthe\nrst\nrev\nersible\npro\ncess\nthe\nw\nork\ndone\nb\ny\nthe\nsystem\nis\nW\n=\nP\n\ni=\nW\ni\n.\nW\n=\n\nX\ni=\nW\ni\n=\nR\nln\n\n+\nR\n(\n)\n+\nR\nln\n0:\n+\nR\n(\n)\nW\n=\n(\n)R\nln\n\n=\nR\nln\n\nF\nor\nthe\nsecond\ncyclic\npro\ncess\nthe\nw\nork\ndone\nb\ny\nthe\nsystem\nis\nW\n=\nP\n\ni=\nW\ni\n.\nW\n=\n\nX\ni=\nW\ni\n=\nR\n(\n)\n+\n+\nR\n(T\n\nT\n\n)\n+\nW\n=\nR\n+\nR\n(T\n\nT\n\n)\nSo\nw\ne\nm\nust\nnd\nthe\nunkno\nwn\ntemp\neratures\nusing\nT\n=\nP\nV\n=R\nand\nV\n=\nR\nT\n=P\n.\nT\n\n=\nP\nu\nR\nV\nu\n=\nP\nu\nR\nR\n\n=\nP\nu\nT\n\n=\nP\nu\n:\nR\nNo\nw\nW\n=\nR\n+\nR\n(\nP\nu\n:\nR\nP\nu\n)\n=\nR\n+\nR\nP\nu\n(\n:\nR\n).\n\nThe\nrestriction\nthat\nthe\nw\nork\ndone\non\nthe\ngas\nin\nthe\nrst\ncycle\nequals\nthe\nw\nork\ndone\nb\ny\nthe\ngas\nin\nthe\nsecond\ncycle\nis\nequiv\nalen\nt\nto\nW\n=\nW\n.\nW\n+\nW\n=\n=\nR\nln\n\n+\nR\n+\nR\nP\nu\n(\n:\nR\n)\nP\nu\n=\n(ln\n\n)\n:\nR\n\nIn\nthe\nab\no\nv\ne\nR\n=\n:\nJ\nmole\nK\n\natm\n:00\n\nP\na\n\nL\nm\n\n=\n0:00\nLatm\nmole\nK\n.\nSo\nP\nu\n=\n0:atm\n."
    },
    {
      "category": "Resource",
      "title": "hw3_sol.PDF",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-00-thermodynamics-of-materials-fall-2002/29fe29cdda18f3b37ffb470671d0d7f3_hw3_sol.PDF",
      "content": "! \"\n#\n\n$% '& )(*+&,-(,\n.0/2143564/87'9:4;\n&%) ( *<=( >8,$(<?@(\nABC )DEF GH I@(8,)\n,!(< *$J,-K\n\n% IIL\n%M%<NN DEJF, 2G+!,)\n,O( $J,-\n<% IM,P+,<MI\n\n<\nQ@(IR NSJ\n4(A%UTV(W, I0( XGY%@T%FGY\n\nZ[]\\VZ^\n_=`Qa\nb\nc )S(<%L?J( d I@(efJ)(=gGY\nNh(< I\n<P%ei2j\n\\lk8mon\nmEp2qOr\n\\ts\nm)u\nmEpv\nr\n*%\n% I0(<w\nZ[]\\\ni\nj\nZ,x\n_\n\na\nT\n\n_\na\ni0j\n\\zy\ni0j\n_Y{\"a\nX|-}T0\nW+ I I Q~(\n< Q< *( X(< IfJ I\n(<-\nC%F,, c$Hw\n\nZ\"^\\\n\np\npU\ny\ni\nj\nZ,x\n_a\n\n^\\zy\ni\nj\n_YxL2xUa\n_,a\n,\nAc% IF\"Iw\niB\n\ni0j\n\\V\n\n^\\\nU\nex\n\n_xL2xQa\n_a\n\n^\\\n`\n\n`\nN\n`\n\nC\n\n@\n\n_\n,\n\n¡`Qa\n_\n\na\n\n^¢\\\n\n,£H¤\n_\n\na\n,\nMNT0 %<-@( I¥\n¦e Q@(Bf< IL(<\n-F,¥( $J,-\n<% II?U(< ,%-\neSD I?!§(< +f\n< Q<<-\neSD IOh\n)GY,\n< ,?LN(< (< fH\nE@(-\n< hEJF, IN(<\n-d$H\nXG8% IeG8F\"N§(<\nU(c)=-J=(Ee,\nEF%CN QN(<J@(X(<\n<4(< Ia Ic4, T2,\n<W¡«(< ¬4-\n<\n-JF,~,~, Q)-% Ig QU ( (r)44(<\n\n+F, (@(C( h44(< I°,C4+%B\nSJ) +@(<(,E I§(<±c$%O+2z I(r)(<\nF,,% I)- Q QU X( d<4(< I3(< d\nSJ X(< I~ I,(\n*(< ¥$J%4h\nT0\nW~±(< 4-\n\n-F\"A%Nd-4(N$H ¥(EW, %,(g,),-\"(*%(< |\"( F\nE@(,\n$§-<%F±i\n\nJ=( I¬G2( hT0\nW,Kμ% I* Q@(dIf,)(=?!i\nj\n\n¶,(<%O?P(< + I@(\nf (=+GP( CF,,EF, I|GY-Jo(<%GL( fJ I\n(<-\n?Hi\n\n\\zyR_x¥·\n\nEUa\ni\n\nZ[]\\\n\nZ\"^\\\n\np\n\npU\n\nQ\nex\niR\nZ,x\n_4`\n\na\n\n^¢\\1\n@\n\niR!%F\nxL\nx\n_4``Qa\n\n^¢\\\n`\n\n`\nA\n`\n,\nC\n\n@0\n\n%F\n,\n\n_4`\n\na\n\n^\\¦`,`\n\n£H¤\n_4`\na\n\n§f\n4,O?J(X%effJ\n\"(A(<J@(e(< $J@(<X( fJ I\n(<-\nd%\n< Q< ¥\n< \"-\nI\n% IA\nFh(( |4(\"(*,- ¥f\nI4-\nX(< IfJ I\n(<-\n¥%)\nI,4 ,%\nf\n$%\n(+4(<\nE%F\"(4GY,\n<T\nE¶&\n<GY\n\n<(<) Q8\nGY,\n+\n<,ff%F\n\n)GY\nJ) 0 I\n<F,C|(< %\"(< IF\nE@(<%dT% %+4 I GH F, Qo(!(e(W, 2%\"(<CI),-\"(\n(< X(< fH\nE@(-\n< C IfJ I I) CGP( C I(AfJ)(=hGL(< ¥44(<\n\n.0/2143564/87'9:\n\nN, eGLh IJF\"RJ ¥4(@( N@\n<$% IIM AGY,-\n0 F\nQRGOGY\n< I I,\n_\nO?\n#\n?\nd?§\na\nGY,\ne§\n$(<\nE\n~F,,*\n< I\n< Q< I$c(< ),=(\n\"(E?\ny¶\\`\nJ\n\n\\\nyOex\n\n2 ¥IcT\n<(<\n[\ng(< I\n<+GP I,Egd$(<%cGP(=T2J fH \"(A@\n%$ Qw\n[_Yx*\nda)\n[_xA\n\na)\n[_\n\na\n¥\n\"(%PGY,\n<'GY,\n*( ,%\n*%\"(<\nP I\nF\nGM IF,0F% Ig$\nZ\n[]\\\ni\nj\nZ,x\n_4`{\"a\n\n\"(< IF\nE@(<%gF% Qw\n[_YxeaM\\\ni\nj\n_Yx¡xUa8\\«[_xA\nda8\\«[_xA\n\na\n_4`Qa\n&-$J=( (-(<%-<F(< X IOF,,2UT«F,, IIw\n[_\n\nda8\\\ni\nj\n\n_\n\na\n_4`I,a\n.0/2143564/87'9:9\nb\nI-< (< e\n\",\n8,$(<*JT2,\n<W%2$H %F¥(\n=GY I\n< Q(<| (@(04(\"(\n\nE@(< ,?\"(< I\n_\nc( ¥$< J) XG!f< e(<\nE<(<%0%g( C\n\",\na\n( C\n<,(< IfH\nE@K\n(<-\n< Xd-J=(%)\nI,4 XT0\nW%0(\n=GY I\n< Qh( (Q?\n< IF,\nE% I8GPT (< I\n(< ¥\",\n%\nfH c\nA\"4 Q\n\nIfJ I%F¥,d( Af\nI%< (<%GH(< (\n)(\nQ?@(< (< fH\nE@(-\n< +U\n% (%%\nI)\nI,4 ,A@T0 ,\nQ?8@(h%F(r)( Q(< (=T0¶)-\nQ\n_\n,fJ IV¡)%,< I\na\n<-gW~\n<,-F%(< ¥< ,\n\nh),-\n<F,- d(@(C( (< IfJ I\n(<-\nGY\nX( +fH GY\n<F, +U§$J h<%F\"(\n%F I\nh@(h%F(r)( Q+$J Q-4 ( ± Q@(hf-fzT0-%¡$H I),\n< Q<F%\nQ<\nh I,(z¥%<A$H I-< B(< 0 Q@(!If,)(=NG(< 2\n<,\nP<%F,,(C<+% I\nLT(<K\n-(N( \"(<\n%$-(<%GR( +@(< I\n<P(<J@(X%eT(<%§( GY\n<F,\n\n(W(< (=T0\n)-\n<, ICf\n$J$% I\n<F, (<( g h(<,%%§%)\nI,4%F@%- ~ IK\n4(<\nE@(< Q4-h I,(A-\nE4(JF\n.0/2143564/87'9:\n\nF X%g%\"(<\nI\n<F,hGM44(<\n\\\nA Q@(@T«%\"(<\n#\n$c~T@(\n\n\\\ni\n#\n$\n_Yx !#\"%$\n\na&\ni\n('\n\n_x) !#\"%$\n\na\nx\n*!#\"+$\n\\\n\n&\n\n,\n\ni\n#\n$\n&\ni\n-'\n\n.0/214365+787890:;*90<>=@?BA@CDFEHGJIFK+L+MON+GJP*QRN+S)N+MOK(T#UVN+UWPXRUWP*QRN+SZY[DRQHC\\N+M]P*QFXR?#/_^F`%=978a>^cbd:e90fefhgVi^1>?4jk90l\nm\n5+:enO?@op+q+r1\n`%i\\=tsu1\\vd78=\\90i@?,wxy{z|=\\5JlB9uy]`}9hxa>i{~90:k9`~ea>i\\+\\?#j_`~e:e9+?Z{#?p++|op++H1\n\n1hr\n2hr\n3hr\n4hr\nTo\nTemperature as measured\nby a thermometer in room\nopen fridge\nclosed fridge\n!F,-\n<\n`\nw8&E +(<X&%-(<%cGY\nN- I4(<%\nN< Ihf\n<(8R(\n<EWM N4T0\n8%8(<(8( *( fH\nE@(<-\n< AT%%J$H N%@T0\nQ\ne) \"(\n0GL+2G(< NT@(\n8T%%H\nE< NJh4|f\n<(2G(< efH(< I\"(< I\n<F,|G\n(< *% IhT2 IF,,(0T%H$J e),\n<(< I(dfH( \"(<H I\n<F,|G(< eT@(< I\nI\n\n,\n\nT0-\n$H d I\n< Q< Ic$c±-,(e)\n\nI<fJ,%F(<+( ¥\nE4 CGB \"(< I\n*GM+,<*GM(<\nT@(< I\nI"
    },
    {
      "category": "Resource",
      "title": "ps_03.PDF",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-00-thermodynamics-of-materials-fall-2002/b4e153752ea3e6c693f8617187e4bcab_ps_03.PDF",
      "content": "0kA UEi£|\nC\n£N]\nC\naUaIX£\nC\n£\nC\nanI;cccÐ\nC\nan£<IO\nC\n\nC\nIc£cc|μEi£|μIE]±I_ <I r|ÐE21\nC\naUItUE rN£×μaIIμI\nC\n£Na6OrμIO\nI r|ÐI]|cE|¬PaIIUEN£1\nC\nIOI\nC\nE]«\n»#1⁄461⁄2<3⁄4U¿KAiAY1⁄2AA+A43\nE\nPaIEiμIUc\nC\naμE|X\nC\n£cIEiIEi£c\nI_aUEiμEi£|μaUØO]±\nC\naYμA_ØX\nC\n\n]±\nC\nI\nC\naUI\nC\naYμAPØ]\nC\n\nX±<a\nC\n£c6μAA UEi£|\nC\n£I\n4a;«\n1 Kg\nPb\n1 Kg Liquid Water\nT = 20°C (uniform throughout system)\n1 Kg Liquid Water\n1 Kg\nPb\n1 meter\nTfinal = ??? (uniform throughout system)\n57698;:=<)>?.@BA%@C6CDFEBGIHJLKNM)>OPGRQ=G$M)>ST6JJU:VGRMI<(K.M)>OXWY>(ZH<)>K[\\OXK.ZM)>(<^]\n_ `V>a`V>^K.Mcb^KdKb6M2Q+H%Zfeag6J9H;8<(K%ShH%ZjikW69Gc8%6lm>[nWoQqp\nifWsr\nM)`V>a`V>^K.Mcb^KdKb6M2QtHZkeFg6JUHu8<(K%SvHZwxKNM><k69G\n86lo>[yWoQzpF{x|$}\nr\nKNJJ~HM)`V><F`V>^K.M b^KdKb6MI69>G69[nM)`V> 69GIH%JLK.M)>OzGRQ=GRM>Sb^K[zWY>[\\>8%J9>bM)>O]p\nikW\nK[\\OzpF{x|$}\nS-KQWY>nbH;[VGR69O\\>(<)>O69[\\OV>dY>[\\OV>[mMH%ZK[oQbHu[VGRMI<(KN69[oM)Gy4>%]8]cbH;[VGRM(K[oMd<>GIGI:=<)>nH<bHu[\\GRMK%[oM*lmH%J9:VSn>.\nK[\\OyM)H+WY>69[\\OV>dY>[VO\\>[oMH%ZsM)>SqdY><(K.M):=<)>%]\nBKoz><I6lm>nK[>)\\d=<)>GIGR69Hu[ZH<M)`V>'![!KNJM>Snd><(K.M):<)>KNZLM)><K-d=<)Hb>GIGJ9>NK%O=69[\\8zM)HyM)`V>*8u:<)>Hu[M)`\\>\n<I698;`oMxH%ZsM)`V>6JJ9:\\GRM<(KNMI69Hu[]\nCWtH;:=J9OM)`V>M)>SqdY><(K.M):=<)>WY>JLKN<8;>(<H<GIS-KNJJ9><6ZFM)`\\>*W=J9HbIgHZkJ9>^KO`KOZCK.JJ9>[M)HnM)`V>J9>ZLMn6C]>%]\n69[oM)H*M)`\\>w K.M)>(<I"
    },
    {
      "category": "Resource",
      "title": "exweek4.PDF",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-00-thermodynamics-of-materials-fall-2002/f423e756ddb6e11bb41b966f4a38caca_exweek4.PDF",
      "content": "b.\nTHIS\nP\nAR\nT\nOF\nTHE\nPR\nOBLEM\nIS\nTO\nSER\nVE\nAS\nAN\nILLUSTRA\nTION.\nYOU\nARE\nNOT\nRESPONSIBLE\nF\nOR\nTHIS\nMA\nTERIAL\nIN\nTHIS\nCOURSE.\nIt\nis\nnecessary\nto\nrotate\nthe\nprop\nerties\nof\nthe\ncrystal\nto\ncoincide\nwith\nthe\norien\ntation\nof\nthe\ncrystal\naxes\nwith\nresp\nect\nto\nthe\nlab\noratory\nreference\nframe.\nThis\nis\ndone\nusing\nthe\nmatrix\nof\ncosines,\n~\nA.\nLet\n~\n\nL\n=\n~\nA\n~\n\nb\ne\nthe\ndielectric\nconstan\nt\nreferred\nto\nthe\nlab\nreference\nframe.\n~\nA\n=\nB\n@\ncos\n\nsin\n\nsin\n\ncos\n\nC\nA\nAnd\nso,\n~\n\nL\n=\nB\n@\ncos\n\nsin\n\nsin\n\ncos\n\nC\nA\nB\n@\n\nC\nA\n~\n\nL\n=\nB\n@\n\ncos\n\nsin\n\nsin\n\ncos\n\nC\nA\nAnd\nthe\nc\nhange\nin\nin\nternal\nenergy\nis\ngiv\nen\nb\ny\nthe\nfollo\nwing.\nU\n=\nE\n\ncos\n\n+\nE\n\ncos\n\n+\nE\n\n+\nE\n\nE\n\n(\n\n)\nsin\n\nc.\nWhen\nthe\ncrystal\nhas\ntetragonal\nsymmetry\nthe\nfollo\nwing\nholds.\nU\na\n=\n\n(E\n\n+\nE\n\n)\n+\n\nE\n\nU\nb\n=\n\n(E\n\n+\nE\n\n)\ncos\n\n+\n\nE\n\nOn\ninsp\nection\nthese\nare\nequal\nwhen\ncos\n\n=\n\nor\n\n=\n\n=.\nW\ne'v\ne\nsho\nwn\nthat\nif\na\ntetragonal\ncrystal\nis\nrotated\ndegrees\nab\nout\nits\nc-axis\nthe\ncrystal\nprop\nerties\nare\nindistinguishable\nfrom\nthose\nb\nefore\nthe\nrotation.\nThis\nis\nan\nillustration\nof\nNeumanns\nPrinciple.\nExample\nProblem\n.\nThe\ne\nquation\nof\nstate\nfor\nan\nide\nal\ngas\nis\nP\nV\n=\nnR\nT\n.\nThe\ne\nquation\nof\nstate\nfor\none\nmole\nof\na\nvan\nder\nWaals\ngas\nis\nb\nelow.\nCalculate\nthe\nchange\nin\ninternal\nener\ngy\nfor\none\nmole\nof\nan\nadiab\natic\nal\nly\nc\nontaine\nd\nvan\nder\nWaals\ngas\nduring\nan\nisothermal\ntr\nansformation\nfr\nom\n(P\n;\nV\n)\nto\n(P\n\n;\nV\n\n).\n\nP\n+\na\nV\n\n(V\nb)\n=\nR\nT\n\nSolution\n.\nF\nrom\nthe\nrst\nla\nw:\ndU\n=\ndQ\n+\ndW\nwhere\ndU\nis\nthe\nc\nhange\nin\nin\nternal\nenergy\n,\ndQ\nis\nheat\nadded\nto\nthe\nsystem\nand\ndW\nis\nthe\nw\nork\ndone\non\nthe\nsystem.\nF\nor\nan\nadiabatic\nsystem\ndQ\n=\n0.\ndU\n=\nP\ndV\nU\n=\nZ\nV\n\nV\nP\ndV\nW\ne\nalso\nneed\nP\n(V\n)\nfor\none\nmole\nof\ngas.\nP\n=\n\"\nR\nT\n(V\nb)\na\nV\n\n#\nU\n=\nZ\nV\nV\n\n\"\nR\nT\n(V\nb)\na\nV\n\n#\ndV\nU\n=\nR\nT\nln\n\nV\nb\nV\n\nb\n!\n+\na\n\nV\n\nV\n\nCon\ntrast\nthis\nwith\nthe\nexpression\nfor\nan\nideal\ngas,\nU\n=\nR\nT\nln\n\nV\nV\n\n.\nExample\nProblem\n.\nFind\nthe\ne\nquation\nof\nthe\nadiab\nats\nin\nthe\nP-V\nplane\nfor\na\ngas\nwith\nan\ne\nquation\nof\nstate\ngiven\nby\nU\n=\nAP\n\nV\nwher\ne\nA\nis\na\np\nositive\nc\nonstant.\nSolution\n.\ndU\n=\ndQ\n+\ndW\ndU\n=\nP\ndV\nAP\n\ndV\n+\nAP\nV\ndP\n=\nP\ndV\nAP\nV\ndP\n=\n(AP\n\n+\nP\n)dV\ndP\nAP\n+\n\n=\ndV\nAV\nZ\nP\n\nP\ndP\nAP\n+\n\n=\nZ\nV\n\nV\ndV\nAV\n\nA\nln\nV\nV\n\n=\n\nA\nln\nP\n\nP\n\nV\nV\n\n=\n\nP\n\nP\n\nV\n\nP\n=\nV\n\nP\n\n=\nconstan\nt\nThe\nequation\nof\nthe\nadiabats\nfor\nthis\ngas\nis\nV\n\nP\n=\nconstan\nt\n.\nNote\nthat\nthe\nequation\nfor\nthe\nadiabats\nof\nthe\nideal\ngas\nis\nsimilar,\nP\nV\n\n=\nconstan\nt\n."
    },
    {
      "category": "Resource",
      "title": "hw4_sol.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-00-thermodynamics-of-materials-fall-2002/ef666f814c3f2cd9c5b469da3010c80e_hw4_sol.pdf",
      "content": "3.00\nThermo\ndynamics\nF\nall\nProblem\nSet\nSolutions\nProblem\n4.1\nLet\nthe\nmolar\nin\nternal\nenergy\nand\nmolar\nen\ntrop\ny\nof\nan\nideal\ngas\nat\nstandard\ntemp\nerature\nand\npressure\nb\ne\nU\n(P\n;\nT\n)\nand\nS\n(P\n;\nT\n).\nDeriv\ne\nexpressions\nfor\nthe\nstate\nfunctions\nU\n(P\n;\nT\n),\nU\n(V\n;\nT\n),\nU\n(P\n;\nV\n)\nand\nS\n(P\n;\nT\n),\nS\n(V\n;\nT\n),\nS\n(P\n;\nV\n).\nSolution\n4.1\nThe\nmolar\nin\nternal\nenergy\nof\nan\nideal\ngas\nis\nonly\na\nfunction\nof\ntemp\nerature.\ndU\n=\nC\nv\ndT\n(1)\nU\nU\n=\nC\nv\n(T\nT\n)\n(2)\nTherefore\nwith\nsubstitution:\nU\n(T\n;\nP\n)\nU\n(T\n;\nP\n)\n=\nC\nv\n(T\nT\n)\n(3)\nU\n(T\n;\nV\n)\nU\n(T\n;\nV\n)\n=\nC\nv\n(T\nT\n)\n(4)\nU\n(P\n;\nV\n)\nU\n(P\n;\nV\n)\n=\nC\nv\nR\n(P\nV\nP\nV\n)\n(5)\nT\no\nderiv\ne\nthe\nexpression\nfor\nthe\nmolar\nen\ntrop\ny\nfor\nan\nideal\ngas\nw\ne\nb\negin\nwith\nthe\nrst\nla\nw.\ndU\n=\ndq\nP\ndV\n=\nC\nv\ndT\n(6)\ndS\n=\ndq\nT\n=\nC\nv\nT\ndT\n+\nP\nT\ndV\n(7)\nS\nS\n=\nC\nv\nlog\nT\nT\n+\nR\nlog\nV\nV\n(8)\nSubstituting\nusing\nthe\nideal\ngas\nla\nw\nand\nthe\nrelation\nC\np\n=\nC\nv\nR\ngiv\nes\nthe\nfollo\nwing.\nS\n(T\n;\nV\n)\nS\n(T\n;\nV\n)\n=\nC\nv\nlog\nT\nT\n+\nR\nlog\nV\nV\n(9)\nS\n(T\n;\nP\n)\nS\n(T\n;\nP\n)\n=\nC\np\nlog\nT\nT\n+\nR\nlog\nP\nP\n(10)\nS\n(P\n;\nV\n)\nS\n(P\n;\nV\n)\n=\nC\nv\nlog\nP\nP\n+\nC\np\nlog\nV\nV\n(11)\nProblem\n4.2\nThe\nmolar\nheat\ncapacit\ny\nof\nsolid\nalumin\num\nis\na\nw\neak\nfunction\nof\ntemp\nerature\nC\np\n=\n20:7\n+\n12:4\n\nT\n\njoule\ndegree\nmole\n\nfor\n300K\n<\nT\n<\n900K\n.\nSupp\nose\nc\ngrams\nof\nalumin\num\nat\ntemp\nerature\nT\nc\n=\n600(1\n\n)\n(Kelvin)\nare\nput\nin\nthermal\ncon\ntact\nwith\nh\ngrams\nof\nalumin\num\nat\nT\nh\n=\n600(1\n+\n\n)\n(Kelvin).\n\n1-2-i\nCalculate\nan\nexpression\nfor\nthe\nnal\ntemp\nerature\nas\na\nfunction\nof\nthe\nratio\nc=h\nand\n\n(0\n<\n\n<\n1).\n1-2-ii\nPlot\nthe\nc\nhange\nin\ntotal\nen\ntrop\ny\np\ner\nmole\nof\nalumin\num\nas\na\nfunction\nof\n\nfor\nv\nalues\nof\nc=h\n=\n(1/16,\n1/8,\n1/4,\n1/2,\n1).\nSolution\n4.2\na)\nT\nak\ne\nthe\nt\nw\no\nalumin\num\nmasses\ntogether\nas\nan\nisolated\nsystem.\nThe\nheat\ntransferred\nfrom\nthe\nhot\nto\nthe\ncold\nalumin\num\npiece\nis\nequal\nto\nthe\nheat\nadsorb\ned\nb\ny\nthe\ncold\nfrom\nthe\nhot\nafter\nthey\nreac\nh\nthe\nnal\ntemp\nerature,\nT\nf\n.\ndq\nh!c\n=\ndq\nc!h\n(12)\nUse\nthe\nrelation\ndq\n=\nC\np\ndT\n=\nnC\np\ndT\n.\nIn\nthe\nfollo\nwing,\nM\nis\nthe\natomic\nw\neigh\nt\nof\nalumin\num.\nC\ncold\np\ndT\n=\nC\nhot\np\ndT\n(13)\nc\nM\nZ\nT\nf\nT\nc\nC\nAl\np\ndT\n+\nh\nM\nZ\nT\nf\nT\nh\nC\nAl\np\ndT\n=\n(14)\n\n+\nc\nh\n\nZ\nT\nf\nT\nc\nC\nAl\np\ndT\nZ\nT\nh\nT\nc\nC\nAl\np\ndT\n=\n(15)\nEv\naluation\nin\nMathematica\ngiv\nes\nthe\nfollo\nwing\noutput\nwhere\n\n=\nc\nh\n.\nThe\nquadratic\nexpression\nhas\nt\nw\no\nro\nots.\nT\nf\n=\n0:5(20:7\n20:7\n\n((20:7\n+\n20:7\n)\n4(0:0062\n+\n0:0062\n)\n(12420\n(1\n\n)\n(1\n\n)\n12420(1\n\n)\n2232(1\n\n)\n))\n)=(0:0062\n+\n0:0062\n)\nOnly\nthe\nrst\nmak\nes\nsense\n(+).\nb)\nThe\ntotal\nc\nhange\nin\nen\ntrop\ny\nfor\nthe\nsystem\nis\ngiv\nen\nb\ny\nthe\nsum\nof\nthe\nc\nhange\nin\nen\ntrop\ny\nfor\nthe\nhot\nblo\nc\nk\nand\nthe\ncold\nblo\nc\nk.\ndS\n=\nc\nM\nZ\nT\nf\nT\nc\nC\nAl\np\nT\ndT\n+\nh\nM\nZ\nT\nf\nT\nh\nC\nAl\np\nT\ndT\n(16)\nThe\nc\nhange\nin\nen\ntrop\ny\np\ner\nunit\nmole\nis\ngiv\nen\nb\nelo\nw.\ndS\n=\nc\nc\n+\nh\nZ\nT\nf\nT\nc\nC\nAl\np\nT\ndT\n+\nh\nc\n+\nh\nZ\nT\nf\nT\nh\nC\nAl\np\nT\ndT\n(17)\nUsing\nMathematica\nand\nsubstituting\nexpressions\nfor\nC\nAl\np\n,\nT\nc\n,\nT\nh\n,\nand\nT\nf\ngiv\nes\nthe\nfollo\nwing\nresults\nfor\nthe\nplot\nof\nen\ntrop\ny\nc\nhange\np\ner\nmole\nof\nalumin\num.\nThe\nlo\nw\nest\ncurv\ne\ncorresp\nonds\nto\nthe\n\n=\n1=16\nand\nthe\nhighest\nto\n\n=\n1.\nAlso,\nthe\ncurv\nes\nare\nall\nmonotonically\nincreasing.\nThese\ntrends\nfollo\nw\nb\necause\nthe\nen\ntrop\ny\nc\nhange\napproac\nhes\nthat\nfor\na\nrev\nersible\nor\nquasi-static\npro\ncess\n(zero\nin\nan\nisolated\nsystem)\nas\n\nand\n\nget\ninnitesimally\nsmall.\n\n0.2\n0.4\n0.6\n0.8\ntheta\n0.5\n1.5\n2.5\nS\nFigure\n1:\nThe\nen\ntrop\ny\nc\nhange\np\ner\nmole\nof\nalumin\num\nas\na\nfunction\nof\n\nthe\ninitial\ntemp\nerature\ndierence\nfor\ndieren\nt\nmass\nratios\nof\ncold\nto\nhot\nblo\nc\nks\nof\nalumin\num,\n\n.\n\n=\nis\npink,\n\n=\nis\ny\nello\nw,\n\n=\nis\nblue,\n\n=\nis\ngreen,\nand\n\n=\nis\nred."
    },
    {
      "category": "Lecture Notes",
      "title": "lecture_01_oneside.PDF",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-00-thermodynamics-of-materials-fall-2002/1ee1b2498e59187b52269bacf107e374_lecture_01_oneside.PDF",
      "content": "MIT 3.00 Fall 2002\nc⃝W.C Carter\nLecture 1\nIntroduction and Course Description\nIntroduction to the Subject\n- Class Structure (Described in Syllabus)\n- These notes\n- Grading\nParticipation\nHomework\nExams\nNotes Bonus\n\nMIT 3.00 Fall 2002\nc⃝W.C Carter\n- Study Groups\n- Reading\n- Thermodynamics as a foundation for understanding material behavior.\nAs a Practical Tool\nAs a Basis for Solving Unsolved Problems\nAs a Philosophical Basis for Understanding Natural Laws\n- Conservation of Energy vs Energy Minimization\n- What is the difference between temperature and heat?\n- Does energy exist?\nWhat is energy?\nYou learned in Newtonian mechanics part of physics that sum of kinetic energy and poten-\ntial energy of a body was conserved to solve useful problems\n\nMIT 3.00 Fall 2002\nc⃝W.C Carter\nh(x)\nFigure 1-1: What is the velocity as a function of x?\nd2x\ndt2 = 0\nand\nd2h\ndt2 = -g\n(1-1)\n-mgh + 1\n2mv2 = constant\n(1-2)\nYou learned in later physics or chemistry that the stable state has the lowest energy.\n\nMIT 3.00 Fall 2002\nc⃝W.C Carter\ne-\nFigure 1-2: Simple example: the Bohr atom\nHow can both statements, \"Energy is conserved\" and \"Energy is minimized\" be true?\nIn particular consider a proton and electron:\nhν\nuniverse\nFigure 1-3: What is the ground state of a proton-electron system?\nWhat is temperature\n\nMIT 3.00 Fall 2002\nc⃝W.C Carter\nExample of old battery?\nWhat is entropy?\nDoes energy exist?\nPhysicists believe it does because a conservation principle seems to apply to each observa-\ntion made by observers\nMathematicians might think of it as an abstract quantity that physicists talk about all the\ntime and conserved quantities have useful things to prove theorems about.\nObservers believe it exists because physicists tell them to look for something conserved,\nPhilosophers might believe it because it is aesthetically beautiful-- or would say that if we\never found an observation contrary to the expectation that energy is conserved, that physicists\nwould make up a new type of energy to balance things out.\nHere is the opinion of one famous scientist on energy:\nIt is important to realize the in physics today, we have no knowledge of what energy\nis . . . It is an abstract thing . . .\nR.P. Feynman"
    },
    {
      "category": "Lecture Notes",
      "title": "lecture_02_oneside.PDF",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-00-thermodynamics-of-materials-fall-2002/14c95abd6fac023d84bd33c5d74d787d_lecture_02_oneside.PDF",
      "content": "MIT 3.00 Fall 2002\nc⃝W.C Carter\nLecture 2\nCourse Survey\nLast Time\nCourse Strucure\nWould you buy my batteries?\nEnergy is Conserved. Energy is Minimized. How can both be true?\nPreview of Entire Course\nThis lecture is an outline of everything I hope to cover in 3.00 this semester. I won't expect the\nstudents to follow everything, but I hope it will prove useful as a map of where we are going.\nI also hope that when the exams roll around that it might be useful to review this lecture.\nThink of this lecture as:\n- A review for the final exam.\n- A preview of the things you learn and how they fit together\nThermodynamics can be categorized into two separate parts:\n1. Classical (or continuum) Thermodynamics\n\nMIT 3.00 Fall 2002\nc⃝W.C Carter\n2. Statistical Thermodynamics or Statistical Mechanics\nWe will focus on classical thermodynamics in this course as it will prepare you for further\nstudies of phase diagrams, reactions, solution thermodynamics and mostly everything else in\nmaterials science. Statistical thermodynamics is useful and we will discuss it from time to\ntime, but the bulk of statistical thermodynamics will be covered in 3.01.\n2-1\nContinuum Thermodynamics\nContinuum thermodynamics substitutes a few average quantities like temperature T, pressure\nP, and internal energy U that represent the state of a system. These averages reduce the enor-\nmous number of variables that one needs to start a discussion of statistical thermodynamics:\nthe positions and momenta of zillions of particles.\n2-1.1\nState Functions\nWe use the continuum thermodynamic variables to describe the state of a system, e.g., a state\nfunction:\nP = f(N, V, T)\n(2-1)\nThis simply says that there is a physical relationship between different quantities that one\ncould measure in a system. Some relationships come from the specific properties of a material\n(material properties) and some follow from physical laws that are independent of the material\n(the laws of thermodynamics).\n2-1.2\nFour Laws\nThermodynamics is a set of four laws (two of which are really more important) that limit\nthe ways the system can change. It is useful to distinguish state functions (that are materials\n\nMIT 3.00 Fall 2002\nc⃝W.C Carter\nproperties that you would need to measure) for thermodynamic restrictions (which derive from\nphysical laws of nature).\nQuestion: What is the difference between a physical law and a theorem?\nThe power of thermodynamics is that everything--everything--follows from these laws.\nHow it follows from the laws is the hard part.\n2-1.3\nTypes of Systems\nIt is very important to be careful in thermodynamics about the type of system that you are\nconsidering: the thermodynamic rules that apply change in very subtle ways depending on\nwhether a system is at constant pressure, absorbs no heat, etc. For instance, to discuss a\nquantity as simple as the heat capacity, one needs to make very precise specifications about\nhow the physical experiment is actually performed.\n2-1.4\nTypes of Variables\nThere are two different kinds of continuum thermodynamic variables:\n1. Intensive Variables (those that don't depend on the size of the system)\n2. Extensive Variables (those that scale linearly with the size of the system)\n2-1.5\nTemperature\nDefining temperature in thermodynamics is particularly troublesome, even though it seems\nobvious to all of you about what it is. The Zeroth law is mechanism for defining temperature\nand it says, \"if two objects are in thermal equilibrium with a specified object, then the two\nobjects would be in thermal equilibrium with each other--and in fact they have the same\ntemperature.\" That specific object in the previous sentence is a thermometer.\n\nMIT 3.00 Fall 2002\nc⃝W.C Carter\nIt is very important to learn the difference between temperature, heat capacity and heat.\nMany people get confused by this. Heat is the work-less transfer of energy from one entity to\nanother. Temperature is that which is equal when heat is no longer conducted between bodies\nin thermal contact. Heat capacity is how much the temperature changes as you add heat to a\nbody that remains in the same state.\nNote that the sentences in the above paragraph start growing lots of clauses (e.g., \". . .body\nthat remains in the same state.\"). This happens in thermodynamics because the exceptions to\nthe rule have to be removed so that the logic can proceed from true statements. Unfortunately, it\nincreases the effort that one must exert in reading (rigorous) thermodynamics books.\n2-1.6\nPhases\nA phase is defined a homogeneous form of matter that can be physically distinguished from any\nother such phase by an identifiable interface. Pedestrian examples are the solid phases, liquid\nphase, and vapor phase of pure water. Less obvious are the FCC and BCC phases of iron-\ncarbon-nickel-chromium steel or the ferromagnetic and non-ferromagnetic phases of LaSrMnO\nmanganites.\nI'll take this opportunity to quote one of my heros:\nWe may call such bodies as differ in composition or state, different phases of\nthe matter considered, regarding all bodies which differ only in quantity and form\nas different examples of the same phase.\n. . . . . .J. W. GIBBS in Trans. Connecticut Acad. III.\n(1875) page 152\n2-1.7\nThermodynamic Notation\nThermodynamic notation becomes complicated because there are so many things that need to\nbe specified. It is not unusual to see a quantity like μα\ni *which means \"the chemical potential of\nthe ith chemical component in the α phase in its standard state.\" You will have to pay attention\nto sorting out notation--otherwise you will have difficulty understanding how everything fits\ntogether.\n\nMIT 3.00 Fall 2002\nc⃝W.C Carter\nThe notation for specifying chemical composition becomes necessarily messy, because it\ncan vary from phase to phase. We will spend some time making sure that you understand\nwhat is meant by the \"concentration of chemical species i in phase α: cα\ni .\nStudents often confuse composition with phase fractions. Let's make sure we understand\nthe distinction.\nPartial quantities are other variables that use the treatment of an intensive variable like\npressure as a linear combination of all the present chemical species--as in the case of partial\npressures.\n2-1.8\nThe First Law\nThe first law says that heat and work have the same effect of increasing the internal energy\nof body--and the internal energy is a state function. Heat and work have the same units\nand they are ways of transferring energy from one entity to another. It may seem obvious to\nyou, but it was not obvious 200 years ago that heat and work could be converted from one to\nanother.\n2-1.9\nTypes of Work\nThere are many different ways that energy can be stored in a body by doing work on it:\nelastically by straining it, electrostatically by charging it, polarizing it in an electric field E,\nmagnetizing it in a magnetic field H, chemically by changing its composition with a chemical\npotential μ. Each example is a different type of work--they all have the form that the (dif-\nferential) work performed is the change in some extensive variable of the system multiplied by\nan intensive variable.\nStudents often get confused about where to put minus signs in equations dealing with work,\nheat and changes in energy. This confusion can usually be removed by forming a physical\n\nMIT 3.00 Fall 2002\nc⃝W.C Carter\npicture of what is actually happening in the system and using common sense.1\n2-1.10\nReversible Work\nSome work always gets wasted as heat. In other words, all of the work that is done on a body\ncannot get stored as internal energy--some of it leaks out as heat. The amount of wasted\nwork is minimized when a process is carried out reversibly. A reversible process happens very\nslowly and the system is always in equilibrium (i.e., the intensive variables are uniform) during\na reversible process.\nThis idea of a minimum of something is very useful because it allows the definition of\nnew thermodynamic variables associated with the limiting (minimizing) case.\nThis is an\nabstraction--like the notion of limits in calculus--which seems confusing at first, but becomes\nnatural with familiarity.\n2-1.11\nEntropy\nBecause there is a limiting process that minimizes something (in this case the wasted heat), we\ncan define a new state variable based on this limiting idealization. This lets us define a new and\nvery important state function called the entropy S. S is necessarily extensive thermodynamic\nquantities.\nEntropy also has quite a different looking definition in statistical thermodynamics--it says\nthat entropy is proportional to the logarithm of the number of states accessible at the systems\nenergy. Because the number of states of two systems together is the product of the number of\neach system taken individually and because entropy, being an extensive function, must go like\nthe sum of the individual system entropies, entropy must go like a log.\n1I know it is true because I have seen it and have done it myself--but students are reluctant to use common\nsense. I wish I knew why it is true.\n\nMIT 3.00 Fall 2002\nc⃝W.C Carter\n2-1.12\nEnthalpy\nIt is useful to imagine a system that changes at constant pressure. In this case, the change in\nenergy as a body is heated is not exactly the internal energy, but a new state function called\nenthalpy H. H represents the available thermal energy at constant pressure. It is the first new\nderived state function we will learn about after entropy.\n2-1.13\nThe Second Law\nThe second law states that entropy is a state function and--if added up for all parts of system--\nnever decreases. This turns out to be incredibly useful, since if we want to find the condition\nthat a system stops changing (i.e., when it is in equilibrium) then the entropy of the entire\nsystem is as large as possible.\nIt is also difficult to apply because it forces us to consider everything that may be affected\nby a process and not the little bit of material in which we may be interested.\nThere are many different ways to state the second law and they all sound quite different\nfrom each other.\nThis fact is not terribly enlightening, but showing that all the differing\nstatements are consistent is terribly enlightening.\n2-1.14\nThe Gibbs Free Energy and Helmholtz Free Energy\nThe entropy gives a maximal principle, but for the entire universe. It would be useful to find\nother functions that have similar extremal properties but for a subsystem of the universe. For\nexample, one doesn't usually state that ice will freeze at a particular temperature and pressure\nbecause the entropy of the ice plus the freezer plus the wires that run to the power station\nplus the power station, etc, have a total sum entropy that increases. Rather, it is decidedly\nmore useful to have some other quantity that applies to the water/ice itself as a function of\ntemperature and pressure of its environment.\n\nMIT 3.00 Fall 2002\nc⃝W.C Carter\nThe quintessential concept in the application of the laws of thermodynamics is how to\nderive that useful quantity from the second law. Their derivation depend on what aspects of\nthe material can vary--in other words, a precise description of the experiment that would be\nperformed on the material in which you are interested. The two most famous such quantities\nare the Gibbs Free Energy and Helmholtz Free energies.\nThe entropy allows us to define two new extensive thermodynamic variables: the Helmholtz\nfree energy, F, is the maximum amount of work a system can do a constant volume and\ntemperature; the Gibbs free energy G is the maximum amount of work a system can do at\nconstant pressure and temperature. G is a minimum for a closed systems at equilibrium with\na fixed temperature and pressure.\nWhy define all these different functions--can't we just have one? No, because in practice,\nsystems have different constraints imposed on them, and to understand them we need to find\nthe physical principles that describe their behavior.\n2-1.15\nPhase Changes\nWhen a body changes phase (e.g., melts, freezes, evaporates, changes crystal structure), its\nenthalpy increases or decreases depending on whether heat is absorbed or given offat constant\npressure. When the body changes phase at the equilibrium temperature, the entropy of the\nuniverse should not change therefore G ≡H -TS does not change. Therefore the Gibbs free\nenergy per mole of two phases in equilibrium are equal. Such equalities are very useful.\n2-1.16\nMolar Entropies\nThe molar entropies of dense objects tends to be smaller than not dense objects so G = H-TS\ntends to favor not-dense objects (gases) at high temperatures. The molar entropies of complex\ncrystals are generally larger than simple ones. Molar entropies of ordered systems like crystals\ngenerally are generally smaller than those with no long-range order like fluids. Apparently,\nentropy has something to do with the number of different ways a system can be rearranged\n\nMIT 3.00 Fall 2002\nc⃝W.C Carter\nand still have the same energy.\n2-1.17\nExtrapolation to Non-Stable States\nWe can calculate the enthalpies, entropies for substances at conditions that they are not stable\nby extrapolating data. This is a useful trick as it allows us to make predictions about non-\nequilibrium changes in a system.\nP = 1atm\nH (enthalpy)\nT (Temperature)\nCP\n0 °C\n10 °C\n≈∆Hmelting(283 °K)\nFigure 2-1: Extrapolating state functions to conditions for which the material is not\nstable.\n2-1.18\nMinimum Principles\nThe principle that S is a maximum at constant energy allows us to prove the obvious, that T\nand P are uniform in systems that are in thermal and mechanical contact. This idea is not\nterribly useful until we consider two systems in mechanical and thermal contact, one so large\nthat it hardly changes at all and the other being the system we are interested in studying.\nTo see if our little system is in equilibrium, we consider all of its internal degrees of freedom.\nIt turns out that if the internal degrees of freedom are the chemical compositions of all the\n\nMIT 3.00 Fall 2002\nc⃝W.C Carter\nphases in our little system, then what must be minimized is the sum of the partial Gibbs free\nenergies each weighted by the amount of substance present.\n2-1.19\nGibbs Free Energy is Minimized at constant Pressure and\nTemperature\nThe Gibbs free energy is partitioned into a potential for each chemical species i, μi and the\nnumber of moles of i, Ni. Then, the Gibbs free energy, G = PC\ni=1 μiNi must be a minimum.\nKnowing that it is a minimum means its derivative is zero--and this gives us a bunch of useful\nequations that apply to states of equilibrium. The fact that it is a minimum also means that\nits second derivative is positive definite--this implies restrictions on the properties of stable\nmaterials (such as the bulk modulus and the heat capacity must be positive).\n2-1.20\nChemical Reaction Equilibria\nOne immediate consequence of Gibbs free energy being minimized is that we can calculate the\nequilibrium concentrations in a chemical reaction from the molar change in Gibbs free energy\nof the reaction. The resulting equation is a fraction containing chemical activities raised to\nstoichiometric powers is equal to an equilibrium constant that can be calculated from ∆GRX.\nThis minimization leads directly to what may be a familiar formula for the equilibrium\nconcentrations in a chemical reaction, i.e.,\npP + qQ ⇀\n↽rR + mM\nP r\nRP m\nM\nP p\nPP q\nQ\n= e\n-\n\n∆Grxn\nRT\n\n= Keq(T)\nXr\nRXm\nM\nXp\nPXq\nQ\n= P p+q-r-s\ntotal\nKeq(T)\n(2-2)\n\nMIT 3.00 Fall 2002\nc⃝W.C Carter\n2-1.21\nMathematical Thermodynamics\nThere are some mathematical consequences of our friends, U, S, H, F, and G, being state\nfunctions. They are the Maxwell relations. It is useful to know they exist because it allows you\nto form relations between different quantities that are not intuitive at all. They are good fodder\nfrom questions on exams in other thermodynamics courses. I'd like you to understand where\nthey come from and be able to manipulate them in the calm quiet atmosphere of your home,\nbut I won't put questions about them on exams. What's the point? I would feel perfectly\ncomfortable asking you questions about why they are important or where the Maxwell relations\ncome from. There are also some implications that follow from the maths that imply how you\nshould draw free energy curves--for some reason, materials scientists are amused by this fact.\nWe will have to go through some exercises about how to do mathematical manipulations\nin thermodynamics. I happen to like this kind of thing. You are expected to have seen them\nso I will teach them to you and give you some homework exercises.\n2-1.22\nLe Chatelier's Principle\nLe Chatelier's principle says that a system will respond to mitigate the effect of an implied\nstimulus. Another way of stating this is that perturbing a system will excite internal degrees of\nfreedom that respond to the stimulus--you push on ice, it transforms to a lower volume liquid\nphase; you increase the pressure in a chemical reaction, it produces more of the reactants that\ntake up less space.\n2-1.23\nGibbs-Duhem Equation and its Consequences\nYou might have noticed that we have defined the Gibbs free energy in two different ways\nabove, once by subtracting offcombinations of S, H, and T and once as a sum of chemical\npotentials and amounts of species. The fact that they are equal gives a new useful relation called\nthe \"Gibbs-Duhem Relation.\" The Gibbs-Duhem relation allows us to calculate relationships\nbetween quantities as a system remains in equilibrium. One example is the Clausius-Clapeyron\nequation that relates equilibrium changes in pressure to changes in temperature as a function\nof material parameters. These relationships restrict the degrees of freedom in a system at\nequilibrium. These restrictions make up the famous \"Gibbs Phase Rule\" P + f = C + 2. The\nGibbs phase rule tells you how many things you can change and still have equilibrium and it\n\nMIT 3.00 Fall 2002\nc⃝W.C Carter\ndepends on the number of chemical components and the number of existing phases. You will\nall know Gibbs phase rule by the end of the class--I hope I can also teach you what it means.\n2-1.24\nThe Relation between Gibb's Free Energy and Equilibrium\nPhase Diagrams\nThe equality of the molar Gibbs free energy can be graphically depicted in phase diagrams. It\nis very important for you to understand how the Gibbs free energy is related to phase diagrams.\nThis is very very important.\nHere is a single component phase diagram:\nP (Pressure)\nT (Temperature)\nP (Pressure)\nT (Temperature)\nSolid\nLiquid\nGas (Vapor)\nFigure 2-2: Single component phase diagram as function of P and T\nA phase diagram is a map that tells you what phases will be stable at what conditions. You\nmust understand and be able to explain how these diagrams follow from plots of free energy\ncurves--this involves using intersections of the free energy curves and the common tangent\nconstruction.\n2-1.25\nGibb's Free Energy of Solution\nThe free energy of a homogeneous solution is very different from a heterogeneous composite.\n\nMIT 3.00 Fall 2002\nc⃝W.C Carter\nG--(molar Gibbs free energy)\nXB\nXA = 1\nXB = 0\npure A\nXA = 0\nXB = 1\npure B\nG-- °A(T,P)\nG-- °B(T,P)\nG-- (heterogeneous mixture) = XA G-- °A + XB G-- °B\nG-- (solution)\n∆G\n--\nmixing(T,P,XB)\nT= constant\nP =constant\nFigure 2-3: Free energy of homogeneous solution (curve) and free energy of heteroge-\nneous composite (line).\nThe reduction in free energy at a fixed composition drives systems into solution.\n2-1.26\nBinary Phase Diagrams\nThere is a graphical construction that allows you to determine the chemical potentials of\nchemical species in solution:\n\nMIT 3.00 Fall 2002\nc⃝W.C Carter\nG--\nG--\nsol.(XBarb, T,P)\nT= constant\nP =constant\nXBarb\nXB\nXAarb\nμA(X =XBarb ,T, P)\nμB(X =XBarb ,T, P)\nμB°(T,P) -\nμB(X =XBarb ,T, P)\nFigure 2-4: A graphical construction of great importance.\nThis construction and the equality of chemical potentials results in the common tangent\nconstruction between several phases of heterogeneous solution in a binary alloy:\n\nMIT 3.00 Fall 2002\nc⃝W.C Carter\nG--\nP =constant\nT = 800\nXB\nα\nβ\nXL\nXα\nXL\nXβ\nFigure 2-5: Common Tangent Construction\nWhich allows the construction of binary phase diagrams, for example:\nFigure 2-6: Eutectic binary phase diagram\nThe two phase regions are composed of the limiting compositions on either side of the\ntwo-phase region on the phase diagram; the lever rule allows us to determine the fractions of\neach phase.\n\nMIT 3.00 Fall 2002\nc⃝W.C Carter\nThere are four main types of binary phase diagrams: Eutectic-type, Peritectic-type, Spin-\nodal, and Lens. You should be able to draw these without too much effort.\n2-1.27\nPhase Diagrams with more than Two Independent Compo-\nnents\nFor systems with more than two components, the phase diagrams become more complicated.\nTernary phase diagrams are drawn in triangles at constant pressure and temperature. There\nare constructions that are similar to the lever rule.\n2-1.28\nIdeal Solutions\nTo construct a phase diagram for a material, one needs the Gibbs free energy as a function\nof composition of the solution. There are various standard models for solutions that provide\napproximations to the Gibbs free energy.\nIdeal solutions are the simplest case, they are a direct analogue of an ideal gas mixture.\nAll solutions take on ideal behavior when they are dilute, this is called Raoult's law for the\nsolvent and Henry's law for the solute.\n2-1.29\nRegular Solutions\nBetter models of the free energy of solution come from consideration of the interactions between\natoms in the system. The most simple version is called the regular solution model--it averages\nthe interactions between like and unlike atoms to calculate the enthalpy and uses the ideal\nsolution to calculate the entropy. Regular solution models can predict \"unmixing\" and this\nresults in a spinodal phase diagram.\n\nMIT 3.00 Fall 2002\nc⃝W.C Carter\n2-1.30\nTypes of Transformations\nThe local curvature of the Gibbs free energy of solution with respect to composition determines\nwhether an unstable composition will achieve stability by small widely-spaced composition\nfluctuations or large isolated fluctuations in composition. The later is an important process\ncalled nucleation.\nFor the case of nucleation of very small nucleating particles, one needs to consider the\nextra energy associated with a surface of the particles. This extra energy has to be overcome\nby a decrease in the Gibbs free energy of the entire particle. This leads to the possibility of\nunder-cooling and the prediction of minimum size of a particle (a nucleus) that can grow.\n2-1.31\nChemical Reactions involving Pure Condensed Phases\nWhen considering chemical reactions of involving pure condensed phases, we can calculate\nequilibrium concentrations by considering the chemical potentials in the vapor that is equilib-\nrium with the system. This leads to an important approximation that one can set the activities\nof the pure condensed reactants and products to one--in other words, they don't appear in\nthe equilibrium constant. This allows us to make quantitative predictions on the reduction\nand oxidation of materials in terms of the partial pressure of oxygen.\nThe data for free energies of reaction for oxidation of metals is conveniently represented in\nan Ellingham diagram.\n2-1.32\nElectrochemistry\nWhen reacting components are charged or involve electron transfer, additional terms must\nbe added to the chemical potential to represent the extra energy of a charged species in\nan electrostatic potential. The sum of the chemical potential and the electrostatic potential\ndefines the \"electrochemical potential.\"\nAt equilibrium, the electrochemical potentials are\nequal between phases. The electrochemical potential yields the Nernst equation. The Nernst\nequation is exactly the same as an equilibrium constant equation, except with the energy of\ncharged species being added in.\n\nMIT 3.00 Fall 2002\nc⃝W.C Carter\n2-1.33\nInterfacial Thermodynamics\nA material can store energy at interfaces. The energy contribution is the surface tension mul-\ntiplied by the area of interface. Surface tension can result in the pressure of two phase being\ndifferent if the interface between them is curved. The chemical potential at an interface is in-\ncreased if it is curved, this is the Gibbs-Thompson effect. Material can segregate preferentially\nto interfaces if it decreases the surface tension. This follows from the Gibbs-Duhem equation\nfor surfaces and the result is called the Gibbs Absorption equation.\nSurface tensions act a force balances and specify the contact angle between two phases:\nγlv\nγsl\nliquid\nsolid\nvapor\nγvs\nφ\nFigure 2-7: Young's Equation for a flat surface\nConsiderations of the geometry of such surfaces has important implications on the sizes of\nnuclei and therefore on the entire topic of phase transformations.\n2-1.34\nDefect Equilibria\nChemical equilibria between species on a lattice with a fixed number of sites is known as\ndefect chemistry. Defects in ionic lattices are charged; Kroger-Vink notation is introduced to\ndistinguish the various types of defects and their associated charges.\nThe results also apply to the equilibrium concentration of charged carriers in a semicon-\nductor."
    },
    {
      "category": "Lecture Notes",
      "title": "lecture_03_oneside.PDF",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-00-thermodynamics-of-materials-fall-2002/0e64f29f90775957de6dc8f0d185f49b_lecture_03_oneside.PDF",
      "content": "MIT 3.00 Fall 2002\nc⃝W.C Carter\nLecture 3\nThermodynamic Variables\nLast Time\nL'Art d'Ennuyer Consiste a Tout Dire\nThermodynamic variables versus microscopic variables\nA primary goal of this course is the description, characterization, and hopefully the prediction\nof the properties and behaviors of a real material. Of course, any description or characterization\nrequires a certain amount of forethought about the lexicon that will be used. Our lexicon\ninvolves the variables that will efficiently describe the properties of materials.\nQuestion: What kinds of variables describe a material body and the changes that occur as it is\nmanipulated\nHow does one describe a body or a system completely? There are at least two plausible\napproaches:\nMethod of description: 1\nDescribe for each particle in the body\n- position (x, y, z)\n- velocity (Vx, Vy, VZ)\n- charge q\n- spin\n...\n- etc.\nQuestion: Why is Avogadro's number, Navag. so big?\n\nMIT 3.00 Fall 2002\nc⃝W.C Carter\nKeeping track of Navag. molecules is just not humanly (or even, in this decade at least,\ncomputerly) possible.\nMethod of description: 2\nDetermine a quantity that reflects the average or sum total properties of the body\nExamples:\n1. Volume V\n2. Total number of atoms of type A, NA\n3. Total number of B-molecules NB\n4. Total charge\n5. Size of system?\n6. charge per volume.\nQuestion: Can you identify others?\nQuestion: If an applied force, F, tries to make a spring get shorter (larger opposing forces →\nshorter spring)--what is it that makes the volume of a body get smaller?\nHow would you measure pressure?\nDesign a small gauge:\n\nMIT 3.00 Fall 2002\nc⃝W.C Carter\nF = k(x - xo)\nFigure 3-1: A small pressure gauge: use x*to measure P.\nFspring = -P\nA =⇒P = Ak(x -x*)\n(3-1)\nCompression, caused by large positive pressures, compresses the spring. In other words,\na negative force in a spring is compressive; thus pressure and force have different sign conven-\ntions. Tensile forces extend the spring and are associated with negative pressures.2\nWhat kinds of things might be wrong with our little device to cause it to give bad measurements\nof pressure?\nImagine that we made our device very small. In the limit of an infinitely small device, we\ncould use it to measure pressure from point to point: P(x).\nQuestion: Practically, how small would be too small?\n2There is yet another type of force distributed over an area that we will discuss--it is the stress tensor.\nUnfortunately for students, there is another minus sign that comes in when going from pressure to stresses. A\npositive stress is tensile.\n\nMIT 3.00 Fall 2002\nc⃝W.C Carter\nQuestion: Would two bodies be in equilibrium if they were in mechanical contact and their\npressures are different?\nQuestion: Are pressure and volume similar variables? How are they naturally coupled?\nIntensive and Extensive Variables\nConsider two bodies each with the same volume V1 and the same pressure. Bring the bodies\ntogether, what is the result?\nV total = V1 + V2\nPtotal = P1 = P2\n(3-2)\nVariables that are additive like V are called extensive variables, they depend on the size or\nthe extent of the system.\nVariables that do no add, but combine like P are called intensive variables, they are intrinsic\nto the system and can vary from point to point. Fields and potentials are intensive variables.\nAnother example: Temperature:3\nQuestion: Is T an extensive or intensive variable?\n3Note that we have not defined temperature yet, but let's proceed anyways\n\nMIT 3.00 Fall 2002\nc⃝W.C Carter\nCan you design a small device that would measure the temperature at a point? (what does\nit resist changes in?)\nThis is a difficult question because we haven't defined temperature.\nLeads to difficult argument found in thermodyanamics books (e.g., Denbigh §1.4) which can\nbe extended to an even more difficult argument that defines the absolute zero of temperature.\nZeroeth Law of Thermodynamics\nLet's just state the zeroeth Law of Thermodynamics\nIf bodies A and B are in thermal but not mechanical contact and heat flows from A to B\nand if B is in thermal contact with C and heat flows from B to C then\nHeat will flow from A to C if they are in thermal contact. In other words,\nif ΘA > ΘB\nand\nΘB > ΘC\n=⇒ΘA > ΘC\n(3-3)\nif ΘA = ΘB\nand\nΘB = ΘC\n=⇒ΘA = ΘC\n(3-4)\nWe can call the body B a thermometer and use the zeroeth law.4\nThe temperature can be related to Θ, we can just call T = Θ. This can be done rigorously\nand it defines an absolute zero (T = 0) but let's not do this and move on.\nLater we may use the entropy, S and internal energy, U, of a body to define the tempera-\nture.5\nT =\nμ∂U\n∂S\n¶\nno work\n(3-5)\n4Think about what a thermometer is for a moment. How do they work? How are materials properties\nimportant in the construction of a thermometer? What kinds of precautions do you need to take to make sure\nthat you are measuring the temperature of the object about which you are making an inquiry and not the\nthermometer itself.\n5The body must also be in equilibrium or uniform temperature.\n\nMIT 3.00 Fall 2002\nc⃝W.C Carter\nFor a body that does no work, or has no work performed on it, the temperature is the rate\nat which internal energy changes with entropy.\nT > 0\n=⇒\nμ∂U\n∂S\n¶\nno work\n> 0\n(3-6)\nU tends to increase with S.\nIn this lecture, we have discussed state variable that gives us information about a body, an\nefficient way.\n-- Intensive Variables--\n-- Extensive Variables--\nN\nNumber of Molecules/Atoms\nP\nPressure\nV\nVolume\nT\nTemperature\nS\nEntropy\nU\nInternal Energy\nM\nTotal Mass\nAll of these quantities rely on measurement but are assumed to be independent of the type\nof measurement."
    },
    {
      "category": "Lecture Notes",
      "title": "lecture_04_oneside.PDF",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-00-thermodynamics-of-materials-fall-2002/117bfb9da78477aa6a646bca60e32ff8_lecture_04_oneside.PDF",
      "content": "MIT 3.00 Fall 2002\nc⃝W.C Carter\nLecture 4\nState Variables and Functions\nLast Time\nMicroscopic Variables versus Macroscopic Variables\nExtensive versus Intensive Variable\nCanonical Conjugates\nDerived Quantities or Densities\nZeroeth Law of Thermodynamics: Temperature\n\nMIT 3.00 Fall 2002\nc⃝W.C Carter\nState Functions\nA state function is a relationship between thermodynamic quantities--what it means is\nthat if you have N thermodynamic variables that describe the system that you are interested\nin and you have a state function, then you can specify N -1 of the variables and the other is\ndetermined by the state function.\nA state function is a model for a material or a system.\nNote that the definition of a state function implies a dependence between some variable\nand the current value of the other thermodynamic values--in other words, it doesn't matter\nhow the system arrived at a certain state. State functions cannot depend on the any of the\nprior processes--state functions are history-independent.\nQuestion: Can you write an equation that describes how far the lecturer is located from the\ncorner of the room?\nQuestion: Is the distance of the lecturer from the corner of the room a state function? What\nare the variables?\nQuestion: Can you write a differential expression for this distance in terms of its variables?\nQuestion: What assumptions have been made in writing down the model for distance?\nQuestion: Imagine that you have closed your eyes for a few seconds and the lecturer walks to\na new location in the room, can you write an equation expressing how far he has walked?\n\nMIT 3.00 Fall 2002\nc⃝W.C Carter\nQuestion: Is the 'distance the lecturer has walked' a state function?\nQuestion: If the 'distance the lecturer has walked' is not a state function, is there any modifi-\ncation to the phrase that would make it a state function?\nSome Example State Functions\nPressure could be a state function of the variables, N the number of atoms present, V the\nvolume of the container, and T the temperature:\nP = f(N, V, T)\n(4-1)\nThis says that we can pick any of the three and the fourth is determined by equilibrium\nproperties of the material.\nNote that the word pressure plays two roles here! One role is as a thermodynamic variable\nthat could be measured and the other is the name of some function. Another way to think\nof this is that for an arbitrary system, there is no reason to expect that there might be a\nfunction called pressure that relates to only N, V , and T but there is nothing preventing us\nfrom measuring the pressure anyways. However, if we are considering an ideal gas model for\nour system, then there is a function P = P(N, V, T) which tells us that we need not bother to\nmeasure P if we know N, V , and T--or we can use our knowledge of P(N, V, T) for an ideal\ngas to construct a pressure gauge.\nAnother state function is total number of molecules or atoms:\nNtotal = q(N1, N2, N3, . . . , NC) (Ntotal =\nC\nX\ni=1\nNi)\n(4-2)\n\nMIT 3.00 Fall 2002\nc⃝W.C Carter\nTotal mass:\nM = g(N1, N2, N3, . . . , NC) (M =\nC\nX\ni=1\nNi MWi)\n(4-3)\nDerived Variables\nLast time we introduced two different kinds of thermodynamic variables: Extensive and\nIntensive\nIntensive variables can be specified point by point; i.e.\nP(x, y, z)\nPressure\nT(x, y, z)\nTemperature\nE(x, y, z)\nElectric Field\nφ(x, y, z)\nElectrostatic Potental (∇φ = -E)\nH(x, y, z)\nMagnetic Field\nThey do not depend on the size of the body.\nExtensive variables depend on the size of the system in question. They are additive.\nM1+2 = M1 + M2\nN α+β\nj\n= N α\nj + N β\nj\nV α+β = V α + V β\n(4-4)\nWe can define \"derived quantities\" (or densities) by scaling:6\nsome Extensive quantity\nsome other Extensive quantity\n(4-5)\nand size of system drops out and these quantities are not additive.\nHowever, the derived intensive quantities still 'act' like extensive quantities regarding where\nthey appear in 'work' terms:\n6I prefer the name derived intensive quantities over the name density. I would prefer to reserve density for\nthose derived extensive quantities that are scaled by dividing through by total volume.\n\nMIT 3.00 Fall 2002\nc⃝W.C Carter\nExtensive variables can be distinguished from intensive variables by the way they add when\nyou add two systems at equilibrium (See Eq. 3-2). Derived quantities don't sum like extensive\nor intensive quantities, but one can derive a rule for their addition. The trick in involves\nrealizing that the derived quantities are \"extensive variables in hiding.\" One can turn them\ninto extensive variables and then use the appropriate rule to add, for instance, consider the\ncombined density, ρAB of two bodies with volumes VA, VB, and masses MA, MB:\nρAB = MA + MB\nVA + VB\n=\nVA\nVA + VB\nMA\nVA\n+\nVB\nVA + VB\nMB\nVB\n=\nVA\nVA + VB\nρA +\nVB\nVA + VB\nρB = fAρA + fBρB\n(4-6)\nwhere the fi are volume fractions. The derived quantities or densities have a \"weighted addi-\ntion\" rule.\nExamples of derived intensive quantities are:\nρ = M\nV\n(4-7)\nρj = MWjNj\nV Navag.\n≡MWjNj\nV\nNtotal\nNavag.\n(4-8)\nThis last equation introduces another derived intensive quantity called a molar quantity:\nExtensive variable\nTotal Number of moles = Extensive variable\nNtotal\n≡Extensive variable\n(4-9)\nFor example, molar species number\nNj =\nNj\nNtotal =\nNj\nN1 + N2 + . . . + NC\n(4-10)\nThis quantity is used so often that it gets its own name--mole fraction and symbol Xj\nU =\nU\nNtotal\n(4-11)\n\nMIT 3.00 Fall 2002\nc⃝W.C Carter\nNote on Notation: we use the over-line as the notation to specify that a quantity is molar.\nPartial Quantities\nFor intensive quantities, it is sometimes useful to associate the contributions of each type\nof existing chemical species to the value of the intensive quantities. Each separate contribution\nis called a partial quantity, for example for pressure,\nPj = XjP\n(P1 + P2 + . . . PC) = PC\ni=1 Pi = (X1 + X2 + . . . XC)P = P PC\ni=1 Xi = P\n(4-12)\nPj is defined as the partial pressure of species j\nQuestion: Does the product of two extensive variables produce a similar extensive variable?\nQuestion: Does the product of two intensive variables produce an intensive variable?\nQuestion: Under what conditions does the product of an intensive variable and an extensive\nvariable produce an extensive variable?\nEquivalence of heat and work\nDiscussion: Name some ways that one can heat up (i.e. increase the temperature of) a\nfixed mass of Pb.\n\nMIT 3.00 Fall 2002\nc⃝W.C Carter\nThe observation that heat and work can independently produce the exact same changes on\na body is obvious today. I can't imagine what it is like not to understand this intuitively.\nThe classical way of explaining this is the following:\nrigid insulating\nmaterial\n1 gram water\nat 25 ° C\n1 gm water\n1 gram water\nat 26 ° C\nThermal\nReservoir\nmaintained\nat 26 ° C\nexperiment 1\n1 gm\nwater\n1 Kg\nexperiment 2\nFigure 4-1: Two ways to change the state of water\nI've abstracted the following story about James Joule and the introduction of the first law\nof thermodynamics from Bent's book.\nFigure 4-2: James P. Joule, 1818-89, born in Salford, Lancashire worked\nin a brewery, painstakingly established the equivalence of heat and work,\nhero of thermodynamics.\n\nMIT 3.00 Fall 2002\nc⃝W.C Carter\nJames Joule is credited with the first careful experiments and analysis that led us to our present\nunderstanding of the first law. Joule worked in his family's brewery in Manchester, England and at\nthe age of nineteen in 1838 became interested in the improvement of electric motors. He discovered\nby various means that he could heat a body of water by purely mechanical means: a) by lowering a\nweight and letting a paddle wheel stir the water; b) by passing electric current through a resistor;\nc) by compressing a piston immersed in the water; d) by friction from rubbing blocks together.\nHe found that about 800 foot-pounds (approx 1 kilojoule) of work could raise the temperature of\none pound (.45 kilograms) of water one Fahrenheit degree (0.55*C). The result was presented to\nthe British Association in 1843 (Joule was then 24). It was received with \"entire incredulity\" and\n\"general silence.\"\nIn 1844, a paper on the subject was rejected by the Royal Society.\nJoule must have had a combination of great confidence in his conclusions, extraordinary temerity,\nand will. In 1845, he discussed his results and suggested that water at the bottom of a waterfall\nshould have a slight temperature increase from water at the top of a waterfall. He also suggested\nthat data from the thermal expansion of gases indicated that there was a lowest possible temperature\nthat could be achieved--this was the first suggestion of absolute zero on the temperature scale.\nThese results failed to provoke discussion.\nTwo years passed and once more in 1847, Joule presented his maturing work at an Oxford\nmeeting of the British Association. As Joule later remarked, \"... the communication would have\n[again] passed without comment if a young man has not risen in the section, and by his intelligent\nobservations created a lively interest in the new theory. The young man was William Thomson\n[later Lord Kelvin] who had two years previously passed at the University of Cambridge with the\nhighest honour, and is now [1885] probably the foremost scientific authority of the age.\"\nIn later years Thomson recalled that he was \"tremendously struck\" by Joule's paper, and added,\n\"This is one of the most valuable recollections of my life, and is indeed as valuable a recollection\nas I can conceive in the possession of any man interested in science.\"\nThomson has given this account of the historic 1847 Oxford meeting. \" ...as I listened [to Joule's\npaper] I saw that [he] had certainly a great truth and a great discovery, and a most important\nmeasurement to bring forward....\n\"...Faraday was there and was much struck with it, but did not enter fully into the new views.\nIt was many years after that before any of the scientific chiefs began to give their adhesion.\"\n\"...\nMiller and Graham, or both, we for many year quite incredulous as to Joule's results,\nbecause they all depended on fractions of a degree of temperature, sometimes very small fractions.\nHis boldness in making such large conclusions from such very small observational effects is almost\nas note-worthy and admirable as his skill in extorting accuracy from them. I remember distinctly at\nthe Royal Society, I think it was either Miller or Graham saying simply he did not believe in Joule\nbecause he had nothing but a hundreths of a degree to prove his case by\"\nIn the same account, Thomson adds that soon after the Oxford meeting he was walking near\nChamonix at the beginning of a hike at Mt. Blanc in the French Alps, \"and whom should I meet\nwalking up but Joule, with a long thermometer in his hand, and a carriage with a lady in it not far\noff. He told me that he had been married since we had parted at Oxford! and he was going to try\nfor the elevation of temperatures in waterfalls.\"\nJoule's paper \"On the Mechanical Equivalent of Heat\" was communicated by Faraday to the\nRoyal Society in 1849 and appeared in Philosophical Transactions in 1850. The last paragraph of\nthis historic paper ends with the statements:\nI will therefore conclude by considering it as demonstrated by the experiments contained in this\n\nMIT 3.00 Fall 2002\nc⃝W.C Carter\npaper:\n1. That the quantity of heat produced by the friction of bodies, whether solid or liquid, is always\nproportional to the quantity of force extended.\n2. That the quantity of heat capable of increasing the temperature of a pound of water (weighed\nin vacuo, and taken between 55*and 60*F) by 1*F requires for its evolution the expenditure\nof a mechanical force represented by the fall of 772 lb. through a space of one foot.\nA third proposition, suppressed by the publication committee, state that friction consists of a\nconversion between mechanical work into heat."
    },
    {
      "category": "Lecture Notes",
      "title": "lecture_05_oneside.PDF",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-00-thermodynamics-of-materials-fall-2002/18189492b2cf0de1752639d1ef8a856d_lecture_05_oneside.PDF",
      "content": "MIT 3.00 Fall 2002\nc⃝W.C Carter\nLecture 5\nThermodynamic Systems and Processes\nLast Time\nState Functions\nLimiting Cases of Path Dependendent Processes\nJames Joule, Hero of the First Law\nFirst Law\nConsider again the classical experiment that illustrates the equivalent effects of adding heat\nto a system and doing an equivalent amount of work on a system.\n\nMIT 3.00 Fall 2002\nc⃝W.C Carter\nrigid insulating\nmaterial\n1 gram water\nat 25 ° C\n1 gm water\n1 gram water\nat 26 ° C\nThermal\nReservoir\nmaintained\nat 26 ° C\nexperiment 1\n1 gm\nwater\n1 Kg\nexperiment 2\nFigure 5-1: Schematic illustration of one of several experiments that Joule used to\ndemonstrate the equivalence of heat and work.\nThe final conclusions of Joule's paper were:\nThat the quantity of heat produced by the friction of bodies, whether solid or\nliquid, is always proportional to the quantity of force extended.\nThat the quantity of heat capable of increasing the temperature of a pound of\nwater (weighed in vacuo, and taken between 55*and 60*F) by 1*F requires for its\nevolution the expenditure of a mechanical force represented by the fall of 772 lb.\nthrough a space of one foot.\nThis states that work, defined here as a mechanical force exerted over a displacement, can\nbe converted into an equivalent amount of heat.\nQuestion: How long would it take to heat water about 5 degrees F?\nWe can state the first law as follows:\nFirst Law of Thermodynamics: Version 1\nA state function, called the internal energy, exists for any\nphysical system--and the change in the internal energy\nduring any process is the sum of the work done on the\nsystem and the heat transfered to the system.\n\nMIT 3.00 Fall 2002\nc⃝W.C Carter\nThere are several interpretations of the first law:\n1. A restriction on the processes that occur in any system.\n2. A definition.\n3. A bookkeeping device.\nAnd, now for something completely different:\nA Sonnet to the First Law\nHow could I have have doubted your constancy\nyour warmth and labors summed, signify\nyour ever unchanging incessancy.\nThough some virtues wane, will others supply\nperfect completeness in my universe.\nAre we not a pair, born of heat and toil,\ncontrovertable, not better nor worse.\nThough shoulders may be cold or blood may boil,\nyou are balanced and never violated.\nTimeless compass of perfect reckoning,\nnorthen star of mislaid paths translated,\nyou, the first, though a second, beckoning\nNature, forever, through her laws eschew\ndw + dq is dU\nTo define work, we need to consider all of the possible ways that we can change the extent\nof a system. Let dx represent the change in some arbitrary extensive quantity (volume, charge,\n\nMIT 3.00 Fall 2002\nc⃝W.C Carter\nnumber of atoms of a certain type, total magnetization, etc) of a system and suppose that we\nconstruct some mechanical device to produce that change--just like in Joule's experiments.\nLet the force be exerted by the device--during the change dx-be F, then the rate at which\nwork is done per change dx is dw = Fdx. If there are N different extensive quantities (dx1,\ndx2, . . . , dxN) then the rate at which work is done is:\ndw = F1dx1 + F2dx2 + . . . FNdxN =\nN\nX\ni=1\nFidxi\n(5-1)\nImportant: the Fi refer to the device that is producing the extent dx, while the dxi refer\nto the system's extensive variables.\nQuestion: Suppose the system changes from some initial state Sinit ≡(xinit\n, xinit\n, . . . , xinit\nN )\nto some final state Sfinal ≡(xfinal\n, xfinal\n, . . . , xfinal\nN\n), could we just integrate to find:\n∆w ≡w(Sfinal) -w(Sinit)\n?=\nZ Sinit\nSfinal dw\n?=\nZ Sinit\nSfinal\nN\nX\ni=1\nFidxi\n(5-2)\nBecause the forces refer their values during a change in a system, we can write the first law\nas a differential expression:\nDifferential Form of the First Law of Thermodynamics\ndU = dw + dq\nThose Pesky Minus Signs\nFirst Law Form\nWork\nHeat\ndU = dw + dq\ndU = dw -dq\ndU = -dw -dq\ndU = -dw + dq\nLet's work out a simple example for a capacitor:\n\nMIT 3.00 Fall 2002\nc⃝W.C Carter\nExamples of different ways that work can be done will appear in later lectures.\nFor the definition of heat, let's use the definition of work and the first law and define heat\nis the work-less transfer of internal energy from one system to another. From our definition\nof the Zeroth law, it follows that heat flows from higher to lower temperature systems. To\nrepeat, temperature refers a property of a system while heat refers to a process--the process\nof exchanging that part of internal energy that is not associated with work.\nTypes of systems\nQuestion: What kinds of precautions did Joule have to make in his measurements such as those\ndepicted in Figure 5-1\nNotice that one must be very careful in defining what processes can and cannot happen and\nidealizations for the systems on which the experiments are being performed. For this reason,\nhistorically, a naming convention has arisen for certain types of systems, Definitions\n\nMIT 3.00 Fall 2002\nc⃝W.C Carter\nThermodynamic Systems\nTYPE\n(Example)\nIsolated\n(The Universe)\nNo energy and no matter may be passed through the\nboundaries\nClosed\n(A free Pinball Machine)\nEnergy can pass through the boundaries, but matter can-\nnot pass through the boundaries.a\nAdiabatic\n(A perfect Thermos)\nNo heat (and therefore no matter that can carry heat)\ncan pass through the boundaries.\nOpen\n(An Aquarium)\nBoth energy and matter may be passed through the\nboundaries\naThis does not exclude the possibility for a change in composition of the present phases or a change in the\nphase content.\nQuestion: What kind of system is a refrigerator?\nQuestion: What is the universe (i.e., all possible systems that must be considered to conserve\nenergy) for a closed refrigerator plugged into an electrical socket\nTypes of Processes\nSimilarly, one needs a naming convention to describe types of processes.\nProcess Type\nAdiabatic\nNo heat passes through boundaries of the\nsystem\nIsochoric\nNo work is transferred to the system from\nits surroundings\nIsothermal\nThe temperature remains constant\nIsobaric\nThe pressure remains constant\n...\n...\nIsosomething\nSomething remains constant\nNotice that adiabatic appears in both the definitions of systems and processes--it is used\ninterchangeably. Adiabatic systems are those that have adiabatic boundaries which are defined\nby not being able to conduct heat. An adiabatic process is one that occurs without the transfer\nof heat.\n\nMIT 3.00 Fall 2002\nc⃝W.C Carter\nQuestion: Considering a sheet of glass as a system, what kind of process is dropping and letting\nit crash onto the floor?\nQuestion: Considering a bathroom scale, what kind of process is stepping onto it?\nThe definition of an adiabatic process allows an alternative definition of the first law:\nFirst Law of Thermodynamics: Version 2\nThe work done on a system during an adiabatic process\nis a state function and numerically equal to the change\nin internal energy of the system.\nComposition vs Concentration\nIt is useful to reiterate the definitions of concentration and composition.\nConcentration is the number of something per unit volume:7\nMolar Concentration of Species j =\nnj\nV total\n(5-3)\nwhere nj is the number of moles of j:\nnj ≡\nNj\nNavag.\n(5-4)\nwhere Nj is the number of j-type atoms or molecules.\n7Or, alternatively, per unit mass. The conversion clearly involves the density. You can always tell which\n(mass or volume scaling) by looking at the units.\n\nMIT 3.00 Fall 2002\nc⃝W.C Carter\nMole fractions or number fractions are defined by:\nNj =\nNj\nNtotal\n≡Xj\n(5-5)\nMole fractions are unit-less--they are just numbers and each must satisfy 0 ≤Xj ≤1 and\ntheir sum must satisfy:\n1 =\nC\nX\nj=1\nXj\n(5-6)\nComposition describes the molar chemical complexion of a system--it is the set of mole\nfractions: (X1, X2, . . . , XC) =\nNtotal\n(N1, N2, . . . , NC).\nIn the special case of the binary alloys (those that have only two possible components A\nand B), the composition can be identified with a single variable X = XB because XA is fixed\nby the relation XA + XB = 1."
    },
    {
      "category": "Lecture Notes",
      "title": "lecture_06_oneside.PDF",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-00-thermodynamics-of-materials-fall-2002/59f04886eeaf521df775ea20a28e00aa_lecture_06_oneside.PDF",
      "content": "MIT 3.00 Fall 2002\nc⃝W.C Carter\nLecture 6\nEnergy and Work\nLast Time\nTopic\nTopic\nTopic\nEnergy\nIn physics, you are used to dividing energy into two (or more) parts:\nEtotal = Kinetic Energy + Potential Energy + . . .\nfor example: Etotal = 1\n2mv2 + 1\n2Iω2 + . . . + mgh\n(6-1)\nTypically, in thermodynamics, the body remain in the same inertial frame as the observer,\nso the velocity and rotation of the body can be taken to be zero. The kinetic energy of the\nsystem is typically ignored.8\n8Questions about whether to include kinetic energy in the internal energy of a body can lead to considerable\nconfusion in classical thermodynamics. One can choose to add the total kinetic energy of body to the total\ninternal energy and keep track of the relative reference frames of the body and the observer. However, it is\nquite reasonable to ask \"Should one add the kinetic energies of all the individual particles that make up a\n\nMIT 3.00 Fall 2002\nc⃝W.C Carter\nIt is useful, but not necessary, to divide the potential energy into parts that do not depend\non its position in space and those that do, for instance:\nU = Uint + Mgh\n(6-3)\nIn the majority of cases in materials thermodynamics, changes in the potential energy due\nto gravity are not considered. If they are required to account for the balance of internal energy,\nthen they must be included and terms like h become a degree of freedom for the system.9 We\nwill not consider gravitational energy any further and what we mean by the internal energy U\nwill be intrinsic to the material system under consideration.\nIn other words, the internal energy of a body is associated with all the internal degrees of\nfreedom of a body.\nInternal energy\nHow can the internal energy of a body be increased?\nHow can the internal energy of a body be decreased?\nbody?\" To be specific, consider a balloon filled with Helium that is floating upwards at constant velocity v*.\nSuppose that, at some particular moment, each of the Helium atoms has a velocity vi. A reasonable way to\ndivide up the kinetic energy of the N He atoms would be:\nEkin = 1\n2NmHe|v*|2 +\nN\nX\ni=1\n2mHe|vi -v*|2\n(6-2)\nwhere the last term includes all the velocities which taken together have zero average velocity. The first term\nhas and old scholarly latin phrase associated with it--the vis viva kinetic energy. The kinetic energy associated\nwith the summation is not \"readily observable\" by experiment and is associated with the internal energy U.\nFor an ideal gas, all of the internal energy is associated with the sum.\n9An excellent example of an application in which the gravitational term must be included is the calculation\nof partial pressure of Oxygen as a function of altitude.\n\nMIT 3.00 Fall 2002\nc⃝W.C Carter\nWe consider all possible internal changes to the body as making up the total internal energy\nU. There are two ways to change the internal energy: those that involve work, and everything\nelse.\nEverything else is defined as heat. Heat is the defined as the transfer of energy to a body\nthat does not involve work--or those transfers of energy that occur only because of a difference\nin temperature. As the Bellman would say, \"Repetition being the apotheoses of pedagogy\"--\ntherefore, heat is the workless transfer of energy.\nSo, by definition and as indefatigably observed by Joule:\ndU = dq + dw\n(6-4)\nNote: You will see this written up to four different ways: dU = dq + dw, dU = dq -dw,\ndU = -dq + dw, and dU = -dq -dw. They are all correct! They only differ in the definitions\nof the heat and work. If there is a minus sign in front of the dq, then dq is the heat out of the\nbody; if a minus sign is in front of dw, it is the work one by the body. One consequence is\nthat the student has to either pay close attention to the definition that are being used or use\ncommon sense--adding heat to a body should increase its internal energy!\nThe flow of heat is fairly obvious; we can always refer to the changes due to a difference in\ntemperatures of an object that has no work performed on it and the agent that is performing\nthe work.\nHowever, it is instructive to list the various ways that one can do work on a body--in other\nwords, the ways that a body can store energy internally when you do work on the body.\nTypes of Work\nThermodynamics is almost always taught for fluids only--i.e. systems that do only PdV\nwork. I think this is not terribly useful because it gives the impression that thermo can only be\napplied to fluids and this is a mistake! Even more, because, as students, professional scientists\n\nMIT 3.00 Fall 2002\nc⃝W.C Carter\nwere taught thermodynamics as fluids, they tend to reduce every system they study to a\nfluid--and this can be a mistake as well!\nHowever, there is a simple reason for this historical method of teaching thermodynamics:\nthe language and symbols become very complicated if we develop thermodynamics in the most\ngeneral way. And this makes it difficult to learn anything at all--so, my object is to teach you\nhow to apply thermodynamics and extend the lessons to more general cases. To extend it to\nmore general cases, we need to consider other ways that work can be done on a body, then\nyou can work out useful relations in new cases by following the methods that we will develop\nin this course.\nThe rate at which work is done is always of the form Fdx where dx represents the change\nin the extent of some quantity and F is a force that resists the change. This should be familiar\nfor the case of a springs and mechanical objects. Perhaps, it is not so familar to think of dx as\na generalization. For instance, we might want to think of dx as the 'change in number of water\nmolecules in a polymer' or we might want to think of dx as the 'change in the the charge held\nin a capacitor', or the 'change in the number of Lithium ions in an anode.' Each one of these\nexamples represents a different way for a material to store internal energy--and each one has\nan intensive variable (a generalized) force associated with it.\nWhat follows is a discussion of some other types of work that can be done on a system. The\ndetails about polarization, magnetization, and elasticity are abstracted from the very useful\nbook by Nye.\nWork of Polarization\nA material is said to be polarized if the positive and negative charges within the material\nbecome slightly displaced from one another due to an electric field.\n\nMIT 3.00 Fall 2002\nc⃝W.C Carter\nc⃝W.C Carter\nE=0\nE\nP\n+ + +\n+\n+ + + + + +\n+\n+\n-\n-\n-\n-\n--\n-\n-\n-\n-\n-\n-\nFigure 6-1: The effect of polarizing a Cesium Chloride structure--there is displacement\nof the ions according to their charge due to an applied electric field. The net result is\nthat some charge accumulates on the surface of the material.\nFor electric work due to polarizing a material:\nE\nElectric Field\nP\nPolarization in material due to local charge\ndisplacement\nD\nElectric Displacements\nD = κ*E + P\n(6-5)\nThe electric displacement, D, is the total polarization per unit volume. The electric dis-\nplacement is the sum of two terms: the electric field in free space and the contribution due\nto the polarization of the material. The electric displacement D can be thought of as the net\npolarization. κ*is the permittivity of free space; it is a conversion between the units of electric\nfield and polarization and its value reflects how an electromagnetic wave travels through the\nvacuum.10\nThe polarization work done is:\ndw = V E · d D\n(6-6)\n10In SI units, the permittivity of free space is approximately 8.85410×10-12 F/m (F/m = m kg/(s2coulomb2))\n\nMIT 3.00 Fall 2002\nc⃝W.C Carter\nLinear Isotropic Material Properties\nThe simplest model for polarizable material is that the induced polarization density P is\nlinearly related to the applied field E:\nP = κ*χ E\n(6-7)\nχ is the dielectric susceptibility. χ is a measure of the extend to which a material to form\ninternal dipoles.\nAn isotropic material is one that the response of a material does not depend on the direction\nof the applied field with respect to the orientation of the crystal--that is the polarization\ndirection is parallel to the applied field E.11\nIn an isotropic material, then, the polarization of the material is in the same direction as\nthe direction of electric field that is trying to polarize it:\nD = κ E\n(6-8)\nκ = κ*(1 + χ)\n(6-9)\nκ is called the permittivity of a material.\nIf κ does not depend on E and the material generates no heat as it is polarized, then\ndw = V κ E · d E\nand\nw = 1\n2V κE2\n(6-10)\nMagnetic Work\nThe magnetic work has a form that is very similar to that of the polarization work. However,\nthere are important differences between magnetic properties. One of the most important is\nthat the linear material that relates the induced magnetization to the applied field (by analogy\nto Eq. 6-7) can be either positive or negative.\nPhysically, it is imagined that the material is composed of magnetic moments that align\n(or anti-align) in response to an applied field.\nThere are two categories of magnetism:\nFerromagnets Materials that can maintain a magnetization even when no there is no applied\nmagnetic field. These are the magnets you find in toy stores, electric motors, and on\nrefrigerators. Very few materials exhibit ferromagnetism; if they do it is likely that they\ncontain iron, cobalt, or nickel.\n11We will discuss anisotropic properties later.\nAn anisotropic material is one that does not satisfy the\ndefinition for isotropy.\n\nMIT 3.00 Fall 2002\nc⃝W.C Carter\nFerromagnets tend to align their own magnetic field with an applied field--this is the\nmagic trick that allowed them to be discovered by the Chinese about 1000 years ago and\nEuropeans about 500 years ago.\nNon-Ferromagnets Non-ferromagnets do not sustain their own magnetic field when an ap-\nplied field is removed. There are two important sub-categories of such non-permanent\nmagnetic behavior:\nParamagnetism The induced magnetic field in the material tends to align parallel with\nan applied field.\nDiamagnetism The induced magnetic field in the material tends to align at right angles\nwith an applied field.\nThe relation between the applied field H, the induced magnetic field density I and the\ntotal magnetic field density is analogous to the case of the electric field (c.f. Eq.. 6-5):\nB = μ*H + I\n(6-11)\nH is the applied magnetic field, μ*is called the permeability of vacuum and relates the\nmagnetization of empty space to the applied field.12 I is the magnetization of the material,\nit is the magnetic moment per unit volume (a derived intensive quantity). B is the magnetic\ninduction of the local net field density.\nExactly similar to the polarization work, the magnetic thermodynamic work is:\ndw = V H · d B\n(6-12)\nModels for magnetic materials\nLinear Isotropic Non-Ferromagnetic Materials\nI = μ*ψ H\n(6-13)\nψ is the magnetic susceptibility, is relates the local microscopic alignment of the individual\nmagnetic moments to the applied field.\nIf ψ > 0, the magnetic moments align with the field--this is called a paramagnetic material\nIf ψ < 0, the magnetic moments align anti-parallel with the field--this is called a diamag-\nnetic material\nCombining Eq. 6-11 with Eq. 6-13, we get the definition of magnetic permeability μ for an\nisotropic magnetic material:\n12In SI (MKS) units, μ*= 4π × 10-7newtons/(ampere)2.\n\nMIT 3.00 Fall 2002\nc⃝W.C Carter\nB = (1 + ψ)μ*H = μ H\n(6-14)\nAnd from this follows the associated magnetic work for this model:"
    },
    {
      "category": "Lecture Notes",
      "title": "lecture_07_oneside.PDF",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-00-thermodynamics-of-materials-fall-2002/184f6f0bbb972ce1dc52f1914006f950_lecture_07_oneside.PDF",
      "content": "MIT 3.00 Fall 2002\nc⃝W.C Carter\nLecture 7\nProperties of Materials\nLast Time\nTypes of Systems and Types of Processes\nDivision of Total Energy into Kinetic, Potential, and Internal\nTypes of Work: Polarization\nLinear Isotropic Polarizable Materials\nTypes of Work: Magnetization\nLinear Isotropic Non-Ferromagnetic Materials\n\nMIT 3.00 Fall 2002\nc⃝W.C Carter\nChemical Work\nIf we consider an open chemical system, then we can change the internal energy of a body\nby alterations of the composition.\nFor instance, we know that salt has a maximum solubility in water (it is about 300 g/l). If\na salt crystal is placed in contact of an open system of water of fixed volume, then chemical\nwork is performed by the dissolution of the salt crystal (or precipitation of salt if the water\nsystem is supersaturated).\nWe will discuss chemical work at length later in the course--but it may be useful to ask\nyourself the following:\nQuestion: What is the natural \"force\" against which one must to work to add molecules to a\nsystem? Should this force depend on the type of molecule being added to the system? Should the\nvalue of the force depend on the chemical composition of the system to which the molecules are\nbeing added?\nα-phase, composed of N1\nα , N2\nα ,N3\nα ... ,NC\nα\nβ-phase, composed of N1\nβ , N2\nβ ,N3\nβ ... ,NC\nβ\nChemical compoment 1\nChemical compoment 2\nChemical compoment 3\nChemical compoment i\nChemical compoment C\nFigure 7-1: Illustration of the concept of chemical work. Each \"syringe\" contains one\nchemical component, to change the composition of the system work must be performed\non the sytem that is proportional to the extensive quantity dNi where i represents the\ni-th chemical component.\nIt may be useful to think of a particular case. Consider a regular kitchen sponge that has\nbeen dried out in the oven for a few days and then exposed to a humid environment. Is there a\nforce driving water molecules from the vapor into the sponge? When does the force disappear?\n\nMIT 3.00 Fall 2002\nc⃝W.C Carter\nConsider a sponge that has been soaking in liquid water and then placed in the desert--is\nthere a force on the water molecules driving them one way or another?\nElastic Work\nA spring is an example of a one-dimensional material--it resists or exerts force in one\ndirection only. A volume of material can exert forces in all three directions simultaneously--\nand the forces need not be the same in all directions.\nA volume of material can also be\n\"squeezed\" in many different ways: it can be squeezed in only one or in only two directions13\nAll the ways that a force can be applied to small element of material is illustrated below.\nA force divided by an area is a stress--think of it the area density of force.\nσij = Fi\nAj\n(i.e., σxz = Fx\nAz\n= σxz =\nF ·ˆi\nA · ˆk\n)\n(7-1)\nAj is a plane with normal in ˆj-direction (or the projection of the area of a plane A in the\ndirection parallel to the ˆj)\nx\ny\nz\nσyx\nσzx\nσxx\nσyy\nσzy\nσxy\nσyz\nσzz\nσxz\nσ21\nσ31\nσ11\nσ22\nσ32\nσ12\nσ23\nσ33\nσ13\nFigure 7-2: Illustration of stress on an oriented volume element.\nσij =\n\nσxx\nσxy\nσxz\nσyx\nσyy\nσyz\nσzx\nσzy\nσzz\n\n(7-2)\n13Consider a blob modeling clay--you can deform it by placing between one of your opposable thumbs and\na finger; you can deform it by simultaneously squeezing with two sets of opposable digits; you can \"smear\" it\nby pushing and pulling in opposite directions. These are examples of uniaxial, biaxial, and shear stress.\n\nMIT 3.00 Fall 2002\nc⃝W.C Carter\nThere is one special and very simple case of elastic stress, and that is called the hydrostatic\nstress. It is the case of pure pressure and there are no shear (off-diagonal) stresses. (i.e., all\nσij = 0 for i = j, and σ11 = σ22 = σ33). An equilibrium system composed of a body in a fluid\nenvironment is always in hydrostatic stress:\nσij =\n\n-P\n-P\n-P\n\n(7-3)\nAnd the pure hydrostatic pressure is given by P\nIf the body that is being stressed hydrostatically is isotropic, then its response is pure\ndilation (in other words, it expands or shrinks uniformly and without shear):\nεij =\n\n∆/3\n∆/3\n∆/3\n\n(7-4)\n∆= dV\nV\n(7-5)\nSo, for the case of hydrostatic stress, the work term has a particularly simple form:\nV\nX\ni=1\nX\nj=1\nσijdεij = -PdV\nV σijdεij = -PdV\nsummation convention\n(7-6)\nThis expression is the same as the rate of work performed on a compressible fluid, such as\nan ideal gas.\n\nMIT 3.00 Fall 2002\nc⃝W.C Carter\nModels for Anisotropic materials\nAs part of our discussion of different ways that the internal energy of a body U could be\nchanged, we considered what would happen to a material if it is held in an electric field. In an\nelectric field, charges of opposite sign move in opposite directions, so one side of the material\ntakes on a different charge than another side--in other words, it becomes polarized.\nQuestion: Do you think the internal energy of the material increases or decreases as it gets\npolarized? What about the energy associated with the device that creates the electric field?\nModels for Anisotropic Polarizable Materials\nWe discussed a model for isotropic polarizable materials--we wrote down an expression for\nthe work of polarizing a material in an electric field and then assumed linear isotropic behavior\nto find an expression for the polarization energy in such an idealized material. We introduced\na material parameter χ that quantifies how much internal polarization develops for an applied\nelectric field: P = κ*χ E.\nIn an isotropic material, therefore, the underlying material cannot influence the material\nresponse and the induced polarization, total polarization, and applied field are all parallel.\nκοE\nP\nD\nisotropic response\nκοE\nP\nanisotropic response\nD\nFigure 7-3: For an isotropic material, the vectors E, P, and D are parallel; in an\nanisotropic material the ions or electron clouds may be constrained to move in particular\ndirections due to the underlying lattice or symmetry.\nIn an anisotropic material, the material response depends on the relative direction of the\napplied field and the crystal orientation--physically, the internal dipoles are constrained to lie\nin particular directions with respect to the underlying material.\n\nMIT 3.00 Fall 2002\nc⃝W.C Carter\n+\n-\n+\n-\n+\n-\n+\n-\n+\n-\n+\n-\n+\n-\n+\n-\nE\nP\nFigure 7-4: Model of an internal dipole in a crystalline material\nThe polarization is not necessarily in the direction of the field. The polarization is linearly\nrelated to the field direction.\nSuch linear relationships can be written as follows:\n\nPx\nPy\nPz\n\n=κ*\n\nχxx\nχxy\nχxz\nχyx\nχyy\nχyz\nχzx\nχzy\nχzz\n\nEx\nEy\nEz\n\nP =κ*χ E\nPi =\nX\nj=1\nκ*χijEj\nPi =κ*χijEj\nsummation convention\n(7-7)\nwhere χ is called the the dielectric susceptibility tensor.\nYou won't be tested or otherwise asked whether you understand what a tensor is in this\ncourse, but I will tell you what they are because they are important. They are representations\n\nMIT 3.00 Fall 2002\nc⃝W.C Carter\nof materials properties that may depend on the underlying symmetry of the material--or any\nmeasurable quantity that can depend on the orientation of the measuring device with respect\nto some laboratory coordinate system.\nTensors\nExtraneous but Potentially Instructive Material\nA tensor expresses the relation between material response\nor force with respect to the axes of its underlying sym-\nmetry to the axes of response or force in a laboratory\nframe.\nA first rank tensor is a spatial vector: its three compo-\nnents refer to the axes of some reference frame.\nA second rank tensor has 9 components, like a matrix.\nEach component is associated with two axes: one from\nthe set of the reference frame axes and one from the mate-\nrial frame axes. You can think of the second rank tensor\nas a linear relationship between two vectors (or equiva-\nlently, two first rank tensors).\nA third rank tensor is a relationship between a first rank\ntensor and a second rank tensor, and so on.\nAn N-rank tensor will have 3N components, but there\nmay be symmetry relations that reduce the number of\nindependent components considerably.\nWhen a material property is a tensor, there are constraints on the form of the tensor that\nfollow from the symmetry of the underlying material. We will discuss this constraint, called\nNeumann's Principle, in a later lecture.\nModels for Diamagnetic and Paramagnetic Anisotropic Materials\nBecause the equations for magnetization and polarization are so similar, it is not surprising\nthat the anisotropic material properties will have a similar form.\nThe general (anisotropic) relationship between the induced magnetization density and the\napplied field is\n\nIx\nIy\nIz\n\n=μ*\n\nψxx\nψxy\nψxz\nψyx\nψyy\nψyz\nψzx\nψzy\nψzz\n\nHx\nHy\nHz\n\nI =μ*ψ H\nIi =\nX\nj=1\nμ*ψijHj\nIi =μ*ψijHj\nsummation convention\n(7-8)\n\nMIT 3.00 Fall 2002\nc⃝W.C Carter\nwhere ψ is the magnetic susceptibility tensor.\nTherefore Eq. 6-11 becomes:\n\nBx\nBy\nBz\n\n=\n\nμxx\nμxy\nμxz\nμyx\nμyy\nμyz\nμzx\nμzy\nμzz\n\nHx\nHy\nHz\n\nB =μ H\nBi =\nX\nj=1\nμ*μijHj\nBi =μijHj\nsummation convention\n(7-9)\nwhere μij = μ*(δij + ψij) is the the magnetic permeability tensor. δij is the identity matrix\nand is also called Kronecker-delta tensor which is 1 if i = j and zero otherwise.\nModels for Anisotropic Elastic Materials: Advanced Material\nAn elastic material is one that responds to an applied stress by deforming--and then \"pops\"\nback to its original shape when the stress is returned to its original value.\nThe resistance to deformation--or material stiffness--is ultimately related to the bonds\nbetween the atoms or molecules that comprise a solid. Weak bonds in a particular direction\nwould result in a material that is not very stiff--in other words, highly compliant--when a\nforce is applied in the direction of the weak bonds.\nσzz\nσzz\nσxx\nσxx\nweak Van der Waals\nbonds between planes\nstrong covalent\nbonds within planes\nFigure 7-5: Illustration of the effect of applying a stress in two different directions in\ngraphite. Because the deformation will depend on the direction that a particular stress\nis applied, the elasticity properties will be anisotropic.\n\nMIT 3.00 Fall 2002\nc⃝W.C Carter\nBecause the stress is a rank-2 tensor (i.e., it has two components i and j) and the strain\nεij is also a rank-2 tensor, the most general linear relationship between the two is:\nεij =\nX\nl=1\nX\nl=1\nSijklσkl\n(7-10)\nwhere S is the elastic compliance tensor--a rank-4 tensor. The inverse of S is related to the\nelastic modulus or stiffness tensor. For example, the shear strain associated with twisting\naround the y-axis is:\nεxz =Sxzxxσxx + Sxzxyσxy + Sxzxzσxz\nSxzyxσyx + . . .\n...\n. . . + Sxzzzσzz\n(7-11)\nand is related to all nine possible applied stresses.14\n14There are actually only six independent stresses in elastic equilibrium--it can be shown that σij = σji,\ni.e., the stress is symmetric."
    },
    {
      "category": "Lecture Notes",
      "title": "lecture_08_oneside.PDF",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-00-thermodynamics-of-materials-fall-2002/e7236d44f8d03eb5b9b876f40dcefaf8_lecture_08_oneside.PDF",
      "content": "MIT 3.00 Fall 2002\nc⃝W.C Carter\nLecture 8\nStored Energy in Solids, First Law for Fluids\nLast Time\nLinear Isotropic and Anisotropic Material Properties\nChemical Work\nElastic Work\nSummary: Forms of Work in the First Law\nFrom the the first law of thermodynamics\ndU = dq + dw\n(8-1)\nWe identified the work associated with various types of physical processes. For the case of\na magnetic and polarizable solid we have:\ndw =\nV E · d D + V H · d B\n+V σijdεij + . . . +\n. . . as many work terms as required to account for adiabatic energy changes\n(8-2)\nThe extra terms could include chemical work, work to add or subtract charge from a body,\npotential energy in a gravitational field, etc.\n\nMIT 3.00 Fall 2002\nc⃝W.C Carter\nFor the special case of a non-polar, non-magnetic fluid, that cannot change its composition,\nthe work is simply:\ndw = -PdV\n(8-3)\nSystems that have Equation 8-3 as the only type of work term will be called simple pure\nfluids.\nQuestions: Why does the V term appear in front of the terms in Eq. 8-2 and not in front of\nEq. 8-3? Why is there a \"minus sign difference\"? Could Eq. 8-3 be modified so it also have a\n\"reference volume term\" out front?\nWork performed by Simple Fluids\nThe incremental work performed by a simple pure fluid is dw = PdV , so dU = dq -PdV .\nRecall that U is a state function:\nQuestion: Can we simply integrate dw between two states, say \"State A\" and \"State B\", and\nidentify the work done by the body?\nZ State B\nState A\ndw\n?= w(State B) -w(State B)\n(8-4)\nIf Equation 8-4 were true, then for any \"work cycle\" (i.e., one that returns to its initial\nstate--the initial state and the final state are the same.)\nI\ndw\n?= 0\n(8-5)\nAn idealized automobile engine can be represented by the following P(V )-path:\n\nMIT 3.00 Fall 2002\nc⃝W.C Carter\nVolume\nPressure\nP3\nP2\nP1\nV2\nV1\nqin\nqout\nwin\nwout\nadiabatic\nprocesses\nFigure 8-1: Idealized P(V ) for a standard automobile engine.\nI\ndw = -\nI\nPdV = 0\n(8-6)\ndw is sometimes called \"not a perfect differential\" because of this property.\nIt simply\nmeans that you need even more information to integrate it--namely the path:\nR\ndw is \"path\ndependent\".\nFurthermore, the idealization in Figure 8-1 is a somewhat misleading.\nIt is easy to specify what the volume is in such a system, but what about the pressure, P,\njust after the beginning of the \"spark?\" The pressure is not uniform throughout the piston\ncylinder and cannot be represented by a point--so the curve cannot be represented by a series\nof points.\n\nMIT 3.00 Fall 2002\nc⃝W.C Carter\nThe idealization in Figure 8-1 introduces the topic of reversibility. (Sometimes, the terms\nquasi-equilibrium or quasi-static are used, they are effectively synonyms for reversible pro-\ncesses).\nDuring a quasi-static process, all of the intensive variables are approximated as uniform;\nso it is possible to use one value and represent it on a graph such as Figure 8-1. However, it is\nimportant to realize that the quasi-static case is a limiting case that can be realized only if the\nsystem moves slowly enough to that all the intensive variables can adjust to their equilibrium\nvalues. This would be an efficient automobile engine, but the upper limit of its horsepower\nwould be zero."
    },
    {
      "category": "Lecture Notes",
      "title": "lecture_09_oneside.PDF",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-00-thermodynamics-of-materials-fall-2002/fd6cb3968c7193c9946a6e785c9d335e_lecture_09_oneside.PDF",
      "content": "MIT 3.00 Fall 2002\nc⃝W.C Carter\nLecture 9\nQuasistatic Processes\nLast Time\nForms of Work\nElastic Solids: Stress and Strain\nFluids: Pressure and Volume\nPV work\n\nMIT 3.00 Fall 2002\nc⃝W.C Carter\nReversibility\nVolume\nPressure\nFigure 9-1: Idealized P(V ) for a standard automobile engine.\nRecall that we showed that the work performed cannot be a state function because:\nI\ndw = -\nI\nPdV = 0\n(9-1)\nQuestion: Why does the inequality in Eq. 9-1 show that the the integral of dw is path dependent?\nThe differential work dw is sometimes called \"not a perfect differential\" because of this\nproperty. It simply means that you need even more information to integrate it--namely the\npath:\nR\ndw is \"path dependent\".\nFurthermore, the idealization in Figure 8-1 is a somewhat misleading.\nIt is easy to specify what the volume is in such a system, but what about the pressure,\nP, just after the beginning of the \"spark\" as the system expands rapidly? The pressure is\nnot uniform and cannot be represented for the system by a point--so the curve cannot be\nrepresented by a series of points.\n\nMIT 3.00 Fall 2002\nc⃝W.C Carter\nThe idealization in Figure 8-1 introduces the topic of reversibility. (Sometimes, the terms\nquasi-equilibrium or quasi-static are used, they are effectively synonyms for reversible pro-\ncesses).\nTo illustrate what is meant by reversibility, consider the following simple processes:\n\nF\nP=F/A\ngas\nperfect\ninsulation\nfrictionless\nsliding\nFigure 9-2: An adiabatic processes consisting of an ideal fluid, a piston, and a mechanism\nfor storing potential energy.\n\nMIT 3.00 Fall 2002\nc⃝W.C Carter\n\nF\n\nF\n\nF\nFigure 9-3: Case 1: A wasteful little demon removes all the weight at once. The system\ndoes no work because there is no force resisting the piston as it slides up the cylinder.\n.\n\nF/2\nF/2\nF/2\nF/2\nF/2\nF/2\nFigure 9-4: Case 2: A somewhat informed little demon removes the upper half of the\nweight. The system does some positive work as it lifts half the equilibrium force up.\n\nMIT 3.00 Fall 2002\nc⃝W.C Carter\n\nFigure 9-5: Limiting (Reversible) Case: Slice weight into sheets dxi thick, where each\ndxi is picked so that the piston moves a constant distance after each removal of the\nweight. Each little volume of weight is stacked on the uniformly spaced shelf on the\nright by our extremely clever little demon. By induction, this will yield the most work.\nWork is maximized when reversible, but infinitely slow in this limit.\nQuestion: Why is the word \"reversible\" applied to the case in Figure 9-5?\nTherefore, the curves in Figure 8-1 are idealizations of a sequence of equilibrium states\n(P, V ). This idealization is called \"quasi-static\" and applies only if the system is changing\nvery slowly. A quasi-static process is also called \"reversible.\"\nBecause U is a state function, then it must be true in general that\nI\ndU = 0 =\nI\ndq +\nI\ndw =\nI\n(dw + dq)\n(9-2)\nBecause dw depends on the path, so must dq; it is also not a perfect differential.\n\nMIT 3.00 Fall 2002\nc⃝W.C Carter\nHeat Capacities\nThe fact that dq is not a perfect differential is reflected by the observation that the heat\ncapacity depends on path as well.\ndq = CV dT\n(constant volume)\n(9-3)\ndq = CpdT\n(constant pressure)\n(9-4)\nCV is the heat capacity at constant V . CP is the heat capacity at constant P.\nQuestion: In materials that expand while heating, they differ considerably. Question: which\none should be bigger? Why?\nFor larger thermal expansion, the difference in heat capacities will be greater.\nGases, which expand considerably with temperature, have a large difference in their heat\ncapacities.\nLiquids do not expand as much. For H2O at 15*C and P = 1 atm, cP = 1cal/(*Kgram).\n(Note use of little c for the derived intensive quantity on a per mass basis), and cV is only\nslightly different.\nFor solids, the difference is very small and usually neglected."
    },
    {
      "category": "Lecture Notes",
      "title": "lecture_10_oneside.PDF",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-00-thermodynamics-of-materials-fall-2002/5beff7ddf7bad261c450faf45c6369fa_lecture_10_oneside.PDF",
      "content": "MIT 3.00 Fall 2002\nc⃝W.C Carter\nLecture 10\nHeat Capacities and Gaseous Behavior\nLast Time\nPV Work for Fluids\nCycles as Demonstration that Work is not a State Function\nA Cycle as a Limiting Case of a Quasi-equilibrium Process\nMaximum Work and Reversible Processes\nHeat Capacities\nGaseous Capacities at Constant Volume or Pressure\n\nMIT 3.00 Fall 2002\nc⃝W.C Carter\nCV is the heat capacity for an ideal fluid substance for processes in which no work is done.\nThere would be equivalent \"no-work\" heat capacity in more complex materials.\nCP is the heat capacity for an ideal fluid substance for processes in which an intensive\nvariable is held fixed.\nConsider identical ideal fluid systems, that receive the exact same amount of heat by a\nconstant volume (isochoric) process and by a constant pressure (isobaric) process:\nq =\nZ TV\nT*\nCV dT =\nZ TP\nT*\nCPdT\n(10-1)\nWe can make a hand-waving argument that the temperature, TP, reached during the con-\nstant pressure process is smaller than TV .\nNo work is done for the constant volume process, so ∆UV = q. Let's imagine that a new\nprocess is added to the end of the constant volume process that takes it to the same state as\nthe end of the constant pressure process (i.e, let it expand by reducing the applied pressure).\nIt is clear that we can extract work from this added process because the fluid can do work\non its surroundings as it expands--therefore it should be possible to store this work and then\npass it back to the system as heat at constant volume, thus increasing the temperature. Since\nthe final state is the same, it follows that TP < TV , therefore, using the intermediate value\ntheorem of basic calculus:\n(TV -T*)⟨CV ⟩= (TP -T*)⟨CP⟩\nCP\nCV\n= TV -T*\nTP -T*\n> 1\n(10-2)\nFor larger thermal expansion, the difference in heat capacities will be greater.\nGases, which expand considerably with temperature, have a large difference in their heat\ncapacities.\nLiquids do not expand as much. For H2O at 15*C and P = 1 atm, cP = 1cal/(*Kgram).\n(Note use of little c for the derived intensive quantity on a per mass basis), and cV is only\nslightly different.\nFor solids, the difference is very small and usually neglected.\nModels for Gaseous Behavior\n\nMIT 3.00 Fall 2002\nc⃝W.C Carter\nExperimental Observations:\nBoyle's Law: At constant temperature. The pressure of a fixed amount of a gas varies\ninversely with its volume.\nP = constant\nV\nor\nPV = constant\n(10-3)\nQuestion: How would you show this experimentally?\nCharle's Law (or Gay-Lussac)\nThe constant from Boyle's Law varies approximately linearly with the temperature of the\ngas.\nPV = constant2T\n(10-4)\nfrom which follows (since V is extensive):\nPV = nRT\n(10-5)\nTraditionally, R is used when n is the number of moles, but we could define it as the molar\nversion of Boltzmann's constant: k = R.\nFor a general, (nonpolar, non-magnetic, non-anything-else-that-can-store-work) fluid, we\ncan write a state function\nT = f(N, P, V )\n(10-6)\nThe ideal gas is just one example of such a function:\nPV = nRT\nor\nPV = RT\n(10-7)\n\nMIT 3.00 Fall 2002\nc⃝W.C Carter\ndT = ∂T\n∂P dP + ∂T\n∂V dV +\n∂T\n∂NtotaldNtotal\n= V\nNkdP + P\nNkdV -\nPV\nNtotal2k\ndNtotal\n= T\nP dP + T\nV dV -\nT\nNtotaldNtotal\nd log T =d log P + d log V -d log Ntotal\n(10-8)\nAn ideal gas can be thought of a set of point particles that have no finite range forces\ninteractions-this is clearly an idealization, since we know that molecules take up a finite amount\nof space and that forces can exist between gas molecules.\nOn closer examination of experimental data, it is found that gasses only approximate this\nbehavior; van der Waals added a few extra constants to fit the data better:\nμ\nP + a\nV\n¶ ¡\nV -b\n¢\n= RT\n(10-9)\nWhen a = b = 0, Equation 10-9 is the same as Equation 10-5.\nb accounts the finite size of the molecule.\na is a measure of forces between molecules thus affecting pressure.\nBoth Equation 10-9 and Equation 10-5 are models for material behavior. They are inde-\npendent of thermodynamic principles, but the behavior of any material is subject to the laws\nof thermodynamics. So, thermodynamics limits the types of equations that can be used as\nstate functions for material behavior."
    },
    {
      "category": "Resource",
      "title": "finalreview.PDF",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-00-thermodynamics-of-materials-fall-2002/e05fd4a3c36aed470fd7779e53bdf5af_finalreview.PDF",
      "content": "!\"$#%\"'&)(+*-,.#&)\"$/10)&2(3546/13%7.&)8.9:(;<4<=>(%7.4:=.0)?>,@\"A/B*6CD&20)&E*6#F+&G3H7IF+7.\"J8>3K*:LM&28.9N3H7.\"POQ8Q*60SRGR2RGR\nTVU\n3H*63H\"WQ=.8X$3H&24<8ZYZ[57\"$;'*:#\"]\\Q*63%7^&28.?.\"$\\@\"$8.?.\"J8_3`ba]8.\"$#%9:;:c:a]8_3H#4<\\_;<c6a]8M3%7Q*:02\\M;:c6d'&2,.,.(Jce!\"J0)Cf7.4<0G3HgihjY\nkmlonqp\nr<s+tup\nr<v\n`wxh\nl\n&2(+*N\\@\"$#/y\"JXj3z?&2{@\"J#%\"$8_3H&E*60Sc\ns\n*:8.?\nv\n*:#%\"'=.(=Q*:0202;|84:3iR}8.0)\"$(%(+4<8.\"'4:/~3H7.\"$C&)(5g$\"J#%4R\nTu\n8_3H\"$8.(%&G<\"'*:#%&)*:,.02\"J(JY\nU\n&)g$\"\n\n8?.\"J\\\"J8.?\"J8_3\nT\na3H\"$8.(%&G<\"'*:#%&)*:,.0)\"$(JY\nU\n&2gJ\"'A\"$\\@\"$8.?.\"J8_3\nT\n4<=(7.4<=.02?,\"^*:,.0)\"A3%4-&)?.\"$8M3%&2/;D3H7.\"P3;\\@\"'4:/1(;(3H\"JC>Y\n\n(%4<0)*63H\"$?Zc0)4:(%\"J?cP\\\"J8cQz?.&)*:,Q*63%&)X\nTV\n\"$#%4:3%7*iF'Y'A\"J(XJ#&),\"J?7.4xF*3%7.\"J#CD4<Cf\"$3%\"J#AF4<#%LM($Y^[57\"J#%Cf4<Cf\"$3%\"J#P&)(A*(;(3H\"$C3H7Q*e3\nXK7Q*68.9<\"J(]&G3H(1\\.#%4<\\\"J#3H&2\"J(]*:(*z/y=.8.Xj3H&)4:84:/Q3H\"$CD\\\"J#%*63H=#%\"&28N*z\\.#\"J?.&2X$3K*6,.0)\"F*i;<R17.\"J8f*:8.463H7.\"$#\n(;(3H\"$C&)(&28|¡ ~¢M£e¤¦¥Q§¢ Z(c)~ab§BaB«~£eab(c)~¤¬F+&G3H7I&G3icF\"'LM8.4xF\n3H7\"'3%\"JCf\\@\"$#H*63%=.#%\"z4:/(=.XK7>(;(3%\"JC>R\nT\n[;\\@\"$(4:/]#%4XJ\"$(%(%\"$(JYz?.&)*:,Q*63%&)X:c&)(4<,Q*:#&)X:c&)(%4XK7.4<#&)X6c&)(4:3H7\"J#%CD*:0\nT\n[57.\"$#%\"N*6#%\"^(%\"$:\"J#%*:01F*i;(F\"XJ*:8m?.4fF4:#%L4<8(r)*f(;(3%\"JC>Y5XJ4<Cf\\.#%\"$(%(&)4<8Zc\\4<0E*:#&)gJ*63H&24<8Zc.CD*:96\n8.\"j3H&2gi*63%&)4<8Zc\"$3%X:R\nT\nW&2#%(3+*xF'Y\nkml~°2±B3μ ·¶ 21bo@±y»H±y 21b1⁄4no1⁄2\nR\nU\n&28.XJ\"'\"$8.\"J#9:;I&)(+*-XJ4:8.(%\"$#<\"$?m3⁄4M=Q*:8_3H&G3;<cQ&G35&)(+*:02(%4f*N\\@\"$#/y\"$X$3?.&2{@\"J#\"J8_3H&)*:0*:8?m¿\nlon\n1⁄2\nTu\n?.\"J*:0~d'*:(JYAAA\nnAAZAzÆ\n\n8_3H\"$#%8Q*60Qa]8.\"J#9:;4:/@*:8\n\n?\"i*:0d'*:($Y\nk\nlAnqC1E\nEE\nE5I\nr<Æ\nRII4:3H\"3H7Q*63I(%&)8XJ\"3H7\"5&)8_3H\"$#%8Q*:0\"J8.\"$#%9:;\n&2(+*-(3K*63%\"P/y=.8.X$3%&)4<8c3H7.&2(+\"j\\.#%\"$(%(&)4<8&)(6*:0)&2?Zc8.4DCD*633H\"J#F+7.*63+3H7.\"'\\.#4X$\"J(%(+&2(JR\na]8_3H7Q*60)\\_;I4:/*:8\n\n?.\"i*:0~d'*:($Y\nk\nIÐn\nC\nE\nE.E\nEN\nr<Æ\na]8_3H#4<\\_;4:/I*68>&2?.\"i*60d^*6(JY\nr\nO¦n\nO_O\no\nE\nE\ntOO\nI\nr\nA\nWQ4<#+*:8&2?.\"i*:09_*:(Jc\nENI×\nE5I\nn\nA\nT\n!4¡FA3H4NXJ*:0)X$=.0E*e3H\"P*XK7Q*68.9<\"'&)8I\"$8M3%#%4<\\_;|/y4:#5*:8&)##%\"$:\"J#(%&),0)\"A(;(3H\"$CY}(\"'*NXJ4<C,&)8Q*63%&)4<8D4:/\n#\"$<\"$#%(&),.02\"^(3K*63%\"J(53H7.*630)\"i*6?3%4N3H7.\"'(H*6CD\"AOQ8.*:0(3H*63H\"6R\nT\n}(%\"$/y=0(3K*e3H\"P/y=.8.Xj3H&)4:8.(JY\nØ\nIUUlut\nAA\nØUU\nUl\n×\nÆzO\nØUY\nUlt\nAAA\n×\nÆAO\nØ\n\n4:=AXJ*:8XJ#\"i*63%\"*:8_;V(3K*63%\"m/y=.8.X$3%&)4<8V;:4<=Xi*:8V3%7.&)8Lu4:/ÞRß[57.&28.Lu/y4:#|\"j*:Cf\\.0)\"4:/A*\n\\4<0)*:#%&2gi*:,.02\"IC*e3H\"J#&E*:0bc74¡F3%4¦(=.,.(3%#H*:Xj33%7.\"a\"$0)\"JXj3H#&)XF4<#Laa¦4<=0)?a&G3f,@\">0)&2L:\"*:8\na\n\"J0)\"$X$3%#%&)XP\"$8_3H7Q*:02\\_;a_a\nw\n\nTVU\n\"$XJ4<8?m*iF'Y[57\"J#%\"^&)(+*N(3K*63%\"'/y=8.X$3%&)4<8I/y4<#+*:8_;(;(3H\"$CXi*:020)\"J?\"$8M3%#%4<\\_;:R[57.\"^(%=C\n4:/~3H7.&2(\n(3K*63%\"/y=8.X$3%&)4<8\n/y4<#3%7.\"(;(3%\"JC\n*:8?u&G3H((=.#%#4<=.8.?.&28.9<(-C=.(3-,@\">*:0GF*i;(-\"J3⁄4M=Q*:054:#N9<#%\"J*63H\"$#\n3%7Q*:8gJ\"$#%4.Y\nkO\n\n°\n\n1⁄2\nT\n]7Q*:(\"3H#%*:8.(/y4<#%CD*63H&24<8ZY[57.\"$#%\"&2(I*:0GF*i;(]*:8\"J8_3H7Q*60)\\_;*68.?\"J8_3%#%4<\\_;XK7.*:8.9<\"5*6(%(%4XJ&)*63H\"$?F+&23%7\n*N\\.7Q*6(%\"'3H#H*68.(/y4<#C*e3H&)4:8ZY\nk\nY\n¶\n\n±\n\nn\nk>I ¶\n\n±\n\n×\nÆPkO@ ¶\n\n±\n\n7.\"$8a3H7\"A3F4I\\.7Q*:(\"J(P*:#\"*e3z\"$3⁄4=&)0)&2,.#%&2=.C>c.3H7.\"^3H4:3H*:0XK7Q*:8.9<\"A&)8>3H7.\"d'&2,.,.(+/y#%\"J\"A\"J8.\"$#%9:;>&2(\ng$\"J#%4R3+3%7.&)(5\\4<&)8_3Jc3H7.\"P3%#H*:8.(/y4<#%CD*63%&)4<83%\"JCf\\@\"$#H*63%=.#%\"'&2(59<&2:\"J8,_;@Y\nÆ ¶\n\n±\n\nn\n\nT\na]3⁄4M=.&)02&),.#&)=.C\nX$4<8.?.&G3H&24<8ZYf[57.\"J#\"*6#%\"|3F4F*i;(f46/?\"$OQ8.&28.9*:8\"J3⁄4M=.&20)&2,.#%&2=.C\nXJ4<8?.&23%&)4<8¦/y4:#\n*:8_;\n\\.#4X$\"J(%($YF\"Xi*:8\"J&23%7.\"J#AXi*:02XJ=.0)*63H\"N3%7.\"D3%4:3K*:0]XK7.*:8.9<\"|&28\n3%7.\"\"$8_3H#%4:\\M;4:/3%7.\"=8.&2:\"J#%(\"\n*:8?aCD*:L:\"A(%=.#\"A3H7.*63z&G3&)(gJ\"J#44:#+F\"XJ*:8a=.(\"N*D(3K*63%\"^/y=8.X$3%&)4<8(%=.XK7*:(zdP&),.,.(\"J8\"J#%96;>3%4\n?.\"jOQ8.\"A*:8\"J3⁄4M=Q*:0202;D:*60)&)?I024XJ*:0X$4<8.?.&G3H&24<8I4:/1\"J3⁄4M=.&)02&),.#&)=.C>Y\nØ\nk>O\n\n°\n\nno1⁄2\nØ\nk\nY\n\n»H±\n\nno1⁄2\nT\n[57.&2#%?'*iF'Y\nO! !1±y»H±y 21b1⁄4#\"\nEE\nnP1⁄2\nR\n\nCD\\4<#3H*:8_3iYa]8_3H#4<\\_;P&)(8.4:34<8.0G;A*Cf\"i*6(%=.#\"46/3%7.\"\na\n?.&)(4<#%?.\"$#%a\n4:/*N(;(3%\"JC>R\nT%$\n*¡&2C*60ScMCD&28.&)CD*:0.\\#%&)8XJ&)\\0)\"J($YIA\"jOQ8.\"P*X$4<8.?.&G3H&24<8f/y4:#(3H*:,.02\"z\"J3⁄4M=.&20)&2,.#%&2=.CY`'&\nl\nh(\n\n\"\n(\nI*)\nE\n\n1⁄2\nc`&\nY\nh+(\nN\n\"\n(\nN,)\nE\n\n1⁄2\nc`&\nO\nh(\n\n\"\n(\nI*)\nE\n\n1⁄2\nR[57.&)(]Cf\"i*:8(3%7Q*63&28M3%\"J#8Q*:0Q*:8?|dP&),.,(]\"J8.\"$#%9<&2\"J(C=.(3\n,\"*(r)CD&28.&)C=C\nF+&G3H7#%\"$(%\\\"JXj3f3%4\n*:8_;\n\\@4:(%(%&2,.0)\"IXK7.*:8.9<\"&)8\n\"\n3H\"J8(%&2:\">6*:#&E*:,0)\"J($R\na]8_3H#%4:\\M;\nC=(3,@\"'*-CD*e&)C=.C\nT\n7.\"$CD&2Xi*:0@1463H\"J8_3%&E*:0bY.-\n°@n0/21\n/\nRa]3⁄4=&)0)&2,.#%&2=.COX$4<8.?.&G3H&)4:8ZYIWQ4<#*:8_;65_§'7*8$¢9(;(3H\"JC/y4<#F+7&)XK7\n3%7.\"J#\"*:#%\"(r)8.4#\"J(3%#%&2X$3H&24<8.(F+&G3H7#\"J9_*:#?3H4\nCD*:(%(|3%#H*:8.(/y\"J#*:Cf4<8.9¦\\.7Q*:(\"J(Jc3H7.\"(r)XK7.\"$CD&2Xi*:0\n\\4:3H\"$8_3H&E*60Z4:/~3H7.\"'&)8?.&2&)?=Q*:0XJ4<Cf\\@4:8.\"J8_3H(+C=(3,@\"'\"$3⁄4=.*:0&)8>*:020\\.7Q*6(%\"J($R8_;I&)8.\"$3⁄4M=Q*:0)&G3;|&28\n3%7.\"'XK7.\"JCf&)XJ*:0Z\\4:3H\"$8M3%&E*:02(F4:=.0)?XJ4:8.(3%&23H=3H\"^*N?.#%&G&28.9/y4<#XJ\"P/y4<#3H7\";:.4¡F\n4:/ICD*:((JR\nTu\n?.\"J*:0d^*:(\n$\n&23H=.#\":RI7.\"$8|XJ4<8(%&)?\"J#%&28.9*'Cf&G3H=.#\"46/Z&)?\"i*:09_*:(\"J($c&23&2(\\4<(%(&),.02\"53H4\"\n\\.#%\"$(%(\n3%7.\"'XK7.\"JCf&)XJ*:0Z\\4:3H\"$8M3%&E*:04:/\"J*:XK7a&28.?.&G&2?.=Q*:0@XJ4<Cf\\4<8.\"J8_3*:($Y\n-\n°@n\n-\n°<\"\nN4=\n`\nÆ\nh\ntuAzÆ\n0)8`\nA\nE\n3S\n\nA\nh\ntAzÆ\n028`'>\n°\nh\nØ\n[57\"OQ#(33F43%\"J#%Cf(XJ4<##%\"J(\\@4:8.?D3%4A3H7\"zXK7.\"$CD&2Xi*:0Q\\4:3H\"$8_3H&E*6046/3H7\"z\\.=.#\"X$4<Cf\\@4<8\"J8_3H($Y\n[57\"OQ#(33H\"J#C\n&)(]3H7.\"zdP&),.,.(\"$8.\"J#9:;f4://y4<#C*e3H&)4:8f46/3H7\"X$4<CD\\4<8.\"$8_3*633%7.\"#\"$/y\"$#%\"J8XJ\"\n\\#%\"J((%=.#\"^`bA\nn\nA\nh\nc6F+7.&20)\"3H7.\"(%\"$XJ4<8.?3%\"J#C&2(~3%7.\"\\#%\"J((%=.#\"5XJ4<8_3%#%&),=3H&24<8^3%43%7.\"5dP&),.,(\n\"$8.\"J#9:;<RN[57&)(PCf\"i*:8.(A3%7Q*63',_;(r)&28.XJ#\"i*:(&)8.9|3%7.\"N\\.#%\"$(%(=.#%\"6c~3%7.\"-XK7.\"JCf&)XJ*:0\\4:3H\"$8_3H&E*60I4:/*\n\\=.#%\"^9_*:(5(7.4<=.02?&28.XJ#\"i*:(\":R\nØ\n[57\"A0)*:(353%\"J#%C\nXJ4<##%\"J(\\@4:8.?.(+3H4N3H7.\"'\"$8M3%#%4<\\_;4:/1Cf&G&)8.9\n[57.\"'\"\n\\#%\"J((%&24<8m*:,4x<\"^XJ4<=0)?,@\"P/y=.#3H7.\"$#5(%&2CD\\.02&2OQ\"$?ZY\n-\n°n\n-\n°?\"\nN4=\n`\nÆ\nh\ntAzÆ\n028`A@\n°\nA\nh\nB\n\ncZF+7.\"$#%\"\n@\n°\n&)(A3%7.\"-\\Q*:#3H&E*60\\.#\"J(%(=.#%\"f4:/3H7.\"-X$4<CD\\4<8.\"$8_35&)8(r)3H7.\"-9_*6(PCD&23%=.#%\"6Y\n>\n°n\n\nN\n=\n?\nR\n[57.&2(5XJ4<Cf\"J(/y#4<C\n3H7.\"A/B*:Xj353H7Q*e3F\"'XJ*:8#%\"J0)*63H\"3H7.\"P\\Q*6#3H&)*:0\\.#%\"$(%(%=#%\"^4:/1*:8I&)?.\"J*:0Z9_*6(3H4N3H7\"\n8M=.C,\"J#+4:/1Cf4<0)\"$(4:/3%7.\"'(H*:Cf\"P9_*:($Y\nA@°Zn\n\nI\nO\nE\nR\n+\"JCf\"JC,\"J#3%7Q*63*:8>&)?\"i*:0Z9<*:(5CD&23H=.#\"P&)(+*-CD&23%=.#%\"z4:/84<8 &28_3H\"J#%*:X$3%&)8.9-\\Q*6#3H&2XJ02\"J(JR\nT\nWQ4<#*#%\"J*:X$3%&)4<8\nt\n\nE\ntr\ncF\"P7Q*i<\"P*X$4<#%#\"J(\\@4<8?.&)8.9XK7Q*:8.9<\"z&)83%7.\"'dP&),.,.(/y#%\"$\"\n\"$8.\"J#9:;Y\nk\nY\n\nn\nY\nE\nO\ntur\nY\nE\n\n×\n\nY\nE\n×\n\nY\nE\n\nWQ4<#3%7.&)(5#\"i*:Xj3H&)4:8Zc.&23&)(+\\@4:(%(%&2,.0)\"3H4f4<,3K*6&)8*:8>\"J3⁄4M=.&20)&),#%&)=CX$4<8.(3K*:8_3iY\n\n1n\n@\nO\n@\n\no\n@\n\n¶\n@\n\nn \"!\n@\n`\n×\nk\nY\n\nAzÆ\nh\nT$#\n*:X$4<,.&)*:8.(JY\nU\n3K*e3H\"/y=.8.X$3%&)4<8(D(=.XK7*:(D}Acd-c!^cWc*:#%\">\\@\"$#/y\"$X$3D?.&2{@\"J#\"J8_3H&)*:0)($RV[57.\"J#\"$/y4<#\"\nr&%n('\n/*)\n/\n+\n»\nt-,\n/*)\n/\n».\n\nc*68.?\n/0/&)\n/\n\n/\n»\nn\n/0/&)\n/\n»\n/\n\nR\n[57.&2(CD\"J*:8.(I3H7Q*e3>3%7.\"\n4<#%?.\"$#&)8F+7.&)XK7;<4<=A3K*:L6\"\n3%7.\"\n(%\"JX$4<8.?o?.\"J#&26*63H&G<\"4:/*\\\"J#/y\"JX$3%02;\n?.&G{\"$#%\"$8M3%&E*:,0)\"z/y=.8X$3H&24<8&)(54<#?.\"J#Þ &28.?.\"J\\\"J8?.\"J8_3iR\n\\.\\.02;&28.9N3H7.&2(5#%=.02\"A3H4N3H7.\"'\"\n\\#%\"J((%&24<8/y4<#3%7.\"Ad'&2,.,.(5\"$8.\"J#9:;<cQF\"^7.*x:\":Y\n'A/\n\n/\nN\n+\nE\n\"\nn\n'\n×\n/\nI\n/\nE\n+\nN\n\"\n#\n*:X$4<,.&)*:8.(5*:#\"32=.(3*NCD*63H7\"JCD*63H&2Xi*:03H44<0=(%\"$/y=0Z3H4N\\.0)*x;|*:#%4:=.8.?IF+&23%7IC*eF\"J02054·(#%\"$0E*63%&)4<8.(\n(4fF\"'Xi*:8OQ8.?>#%\"$0E*63%&)4<8.(7.&)\\(,@\"j3F\"$\"J8mCD*63%\"J#%&)*:0\\#%4<\\\"J#3H&)\"$(Jc.(=.XK7m*6(\nEN\nc\nE5I\ncQ\"$3HX6R\n`87:9<;h\n`\n!\n9>=.h\nnor \"?A@B\n'\n/\n\n/\n+\n»\n,\n/\n\n/\n».\n\n'\n/\n\n/\n+\n»\n,\n/\n\n/\n»C.\n\nDE\nT\ndP&),.,( ÞA=7.\"JC\na3⁄4M=Q*e3H&)4:8ZYI]#%4:,Q*:,.0G;<c_3H7.\"(%\"$XJ4<8?Cf4<(3&)Cf\\4<#3H*:8_3]\"J3⁄4M=Q*63%&)4<8-4:/@3H7.&2(XJ4<=.#(%\"6R\n\n3+3H\"$0)02(;<4<=>7.4xF\n3%7.\"'&)8_3H\"$8.(%&G<\"'6*:#%&)*:,.0)\"$((%74<=.0)?>XK7Q*:89<\"PF+7.\"J8a*-\\7Q*:(%\"'&2(*e3+\"J3⁄4M=.&)02&),.#&)=.C>R\n!4¡Fo3H4-?.\"$#%&2:\"'&23\na\nw<RGF\"J9<&28I,M;fF+#%&G3H&28.9?.4xF+8I3H7\"A\"J3⁄4M=Q*63%&)4<8D/y4<#3H7\"A?.&2{@\"J#\"J8_3H&)*:04:/3H7.\"Pd'&2,.,.(\"$8.\"J#9:;<c/y#%4<C\n3%7.\"'?.\"$O.8.&23%&)4<8\nY\nnIH\n-\n°)A@°\nY\nr\nY\nnJH\n-\n°Er_A@°tKH\nA@°r\n-\n°\nR\nB\nR5[57\"J8F+#%&23%\"I?.4xF+8\n3H7.\"I?.\"jOQ8.&G3H&)4:8\n/y4<#\nr\nY\n/y#4<Ca3%7.\"I?.\"J#&26*63%&)4<8\n=(%&)89m3H7.\"|OQ#(3-0)*xF'Y\nr\nY\nn\nA\nr\nA\n×\nO]r<Æ\ntLH\n-\n°Er_A@°\nM\nR\nU\n=.,.(3%#H*:Xj3z,4:3%7>\"\n\\.#%\"$(%(%&24<8.(\nN\nR+W1&)8Q*:0202;:c;:4<=a9<\"j3iY\n1⁄2^nqO]r<Æ\n×\nA\nr\nA\ntKH\nA@°r\n-\n°\nR][57.&)(+Cf\"i*:8(+3%7Q*63+&G/1;:4<=&28.XJ#\"i*:(\"\nÆ\nc\n/y4:#\"j*:Cf\\.0)\"6c*60)03H7.\"A#\"JCD*:&)8&)8.9^&)8_3H\"$8.(%&G<\"z6*:#&E*:,0)\"J(C=.(35XK7Q*:8.9:\"P*:XJX$4<#%?&)8.9<0G;f(%43H7\"\n\"$3⁄4M=Q*:0)&G3;I#%\"$C*6&)8.(3%#%=.\"6R\nTLOQP\n¥Q¤\nR1§B¢\n7TSQU\n¢§yxaVXWZY\n7@a[V@]\\I¢R1£¡¢\n848ia'7^V\nT\ndP&),.,(z]7Q*:(\"_+=.0)\"6YPa`\n\nPa`\n\nAa`\n+$\na[~AI[PR\nOtK%(r)n\nE\nt\nB\nR\n\n4<=m(7.4<=.02?\nLM8.4xF&23z,M;7.\"J*:#3JR\n\n3A(%74<=.0)?a,@\"X$0)\"J*:#3%4;<4<=m3%7Q*63A3%7.\"NdP&),,.(A]7Q*:(\"b=0)\"A3%\"J020)(+;<4<=(r)7.4xF\nCD*:8_;?\"J9<#\"J\"J(]46/Q/y#%\"J\"$?.4<Cß;<4<=N7.*x:\"F+7.\"J8N3%7.\"8M=.C,\"J#I46/@X$4<Cf\\@4<8\"J8_3H(]*68.?\\.7Q*6(%\"J(]&2(O\"J?R\n[1*:L:\"'/y4<#5\"\n.*6CD\\.02\"'*N(%&)89<0)\"PX$4<CD\\4<8.\"$8_3I μ[\n\\.7.*:(%\"'?.&)*:9<#H*6CR\nM\n\nT\nF&28Q*:#;I]7Q*:(\"A&)*:9<#H*6CD($R\nØ\n\n4:=u(7.4<=.02?uLM8.4xF7.4xF\n3%44<,3K*6&)8\n3H7.\"XK7.\"$CD&2Xi*:05\\4:3%\"J8_3H&)*:04:/3H7.\"XJ4:CD\\4<8.\"$8M3%(Jc,M;\n3H*:LM&)8.9\n3%7.\"(%024<\\@\"3H4\n3H7\"(r)XJ=.#<\"\n#%\"J\\#%\"J(\"J8_3H&28.9\n3H7.\"(r)3%4:3K*:0XK7.\"JCf&)XJ*:0z\\4:3%\"J8_3H&)*:0z4:/^3H7\"\n\\7Q*:(%\"6R\nØ\n\n4:=(7.4<=.02?>,\"^*:,.02\"A3H4-=.8.?.\"$#%(3K*:8.?>3H7.\"'X$4<CDCf4<8 S3K*:89<\"J8_3+XJ4:8.(3%#%=.Xj3H&)4:8ZR\nØ\n}(%&28.9A3%7.\"AdP&),,.(\"J8.\"$#%9:;-X$=.#:\"J(5*:8?f3%7.\"X$4<CfCD4<8N3H*:8.9<\"$8M3XJ4:8.(3%#%=.Xj3H&)4:8Zc;:4<=(7.4<=.02?\nLM8.4xF74¡F3H4\"\n3%#H*:Xj3'3H7.\"N\"$3⁄4=&)0)&2,.#%&2=.C\nXJ4<8XJ\"J8_3%#H*63%&)4<8.('X$4<#%#\"J(%\\4<8.?&)8.9I3H4I3%7.\"N\\.7Q*:(\"\n,4<=.8?Q*:#%&2\"J(*:8.?&)X$\"$<\"$#%(%*R\nØ\n}8.?.\"$#%(3H*:8.?I3H7\"A0)&2CD&G3H&)89P,@\"$7Q*i&24<#46/3H7.\"A9:&),.,.(\"J8.\"$#%9:;XJ=.#<\"$(*68.?|XK7.\"$CD&2Xi*:0\\@463H\"J8\n3%&E*:02(JR\nØ8.4xF\n74¡Fo3H4f*:\\.\\02;3%7.\"'0)\"j<\"J0#=.0)\"6Y\n%n\n>\n\n×\n>\n>\n\n×\n>\n\nT\n]7Q*:(\"A?&E*:9<#%*:Cf(\nØ\n\\.\\.02Xi*63%&)4<84:/]7Q*:(%\"\n+=.0)\"6R\nØ8.4xF\n74¡Fo3H4f*:\\.\\02;3%7.\"^\"$<\"$#Q+=.02\":R\nØ\n}8.?.\"$#%(3H*:8.?>3H7.\"'XJ4:8.XJ\"$\\3z46/13%&)\"j μ0)&28.\"J($R\n\n/1;:4<==.8.?.\"$#%(3K*:8.?>*:020@3%7.&)(X$4<8.X$\"J\\3%(Jc.;<4:=*6#%\"A&28I9<44?|(7Q*:\\\"'*:8.?I(%74<=.0)?,\"P*:,.02\"z3H4-*6XJ\"A3H7\"\nOQ8Q*60]Y\nÞhjR\nN"
    },
    {
      "category": "Resource",
      "title": "rec2solutions.PDF",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-00-thermodynamics-of-materials-fall-2002/2726dc8d0dd47aaaa7762f37df82930b_rec2solutions.PDF",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "recitation2.PDF",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-00-thermodynamics-of-materials-fall-2002/7985e2f6cfb80b9a0cf7f1ded088ab3f_recitation2.PDF",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "rec3_solutions.PDF",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-00-thermodynamics-of-materials-fall-2002/e33763f403c3743e64fd03bd946de93f_rec3_solutions.PDF",
      "content": "\"!$#%&#')(*+#,-/.&0213'\"45167-89;:<!$#=?>@#A:<.9+)B!C')(,D6D:C')0EF>@#A:<.9+)B!C')(7D6;:<')0EGH\n\"!$#9;:/#:84C')DCI94D'2!JK\nLFM:C0?N+889B+')(O:<.94D!$I9P$.E:<.9'Q89;:<!$#E:<!R4C'\"(9I9)'Q:<.9'S$!$B+I90R'Q!JT:<.9'QP\nJ4D!$0VUMWOXY:C!FZ[WOX\n\n\\\n]F^_.&M:YK:C.9' `a!$4Db(9!$#'Q16:C.9'D6D:C')0Fc\nd\n.9' #98I:K+#J!$4C0?M:C!$#R#9')'\"(9K:<!213'0?(9'I9#9+J!4C0RB+6e'\"+:<.')4Nfg>hI9#+:<i!$4Njk5f3&ja!#lS')4;:<#P\n:<!?fg>aI#9+:C)Gm\nn$opWrqs\nLt/uEWwvx\nH^y!$4Db(9!$#'5z3{|D6D:C')0r+kP$+S')#E1l6\n}\nq\n~)\n_5\nq\n\n\\\n\nk\n\nL]qsQ\nL\nt\nuW\n\\\n1]`N.&M:YK:C.9'/.&#9P$'5#O:C.9'#:<'\"4C#&B=')#9'\"4CP6-+#:<.9'894D!g\"')C<c\nd\n.9'5%94CD:YB\n`!J:<.9'\"4C0R!g(g6g#90?+)k;:/M:C')\n\nq\nl\n}\n>@#_:C.9'894D!$19B'\"0\n;:/M:C')0R')#:GY')#!$I9P$._#gJ!$4C0?M:<+!$##9!M:O894C!\nS(')(:<!|'\"D:<+0F[:<'+#l:C')4D#&B\n')#9'\"4CP6K:<.9' ;6D:<'\"0VP$S$')#O+k)B+!$C'\"(OD6D:C')0EG9`a'`i!$I9B+(O#9')'\"(+#J!$4D0FM:C!$#?1!$I:a.9'M:\n'g/.&#9P'\n\\\nl\n]i:<!MB)IBM:C':<.9'#:C')4C#9B')#')4CPM6-!JT:C.9'D6D:C')0E\nZja.')/b:<.'J!BB!\n`N+#9PD:<M:<'\"0?'\"#:<5H:<4CI'5!4KJBD'\nc\n\\\nI9#9(9'\"4Y`N.&[:N)!$#9(+:<+!$#9<c[]\n\\\n]>@#l:C')4D#&B ')#9'\"4CP6!JHD6;:<')0r+NR;:/M:C' JI9#9\":C!$#=\nd\n4DI9'\nd\n.9'Y%&4C;:KB\n`¡894C!\nS(9'\":C.9'('\"%&#9:<+!$#?!MJ Q;:/M:C'YJI9#\":<+!$#Gl>@#:<'\"4C#&B')#')4CPM6$h>@#:<')4D#&B\n')#9'\"4CP6-+NB+`a6gYeD:<M:<' JI9#\":<+!$#O`N+:C.#9!'\"')8:C!$#)\n\\\n1]O>@#l:C')4D#&B ')#9'\"4CP6N#E#:<'\"#9CS$'894D!$83'\"4D:@6\n¢\nMBC'M>£:NK0R!$4D' BbM' #-':C')#9D+S$'5¤lI&#:<:@6$h>@#:<'\"4C#&Bm'\"#9')4DP6O(9!I919B'\"K`N+:C.-:@`i!(9'\"#:<)B\nD6D:C')0R4D'5(9(9'\"(\n\\\n\n]O>@#w#(91&M:CD6D:C')0EG`i!$4Db(9!$#9'5Ne;:/M:C'JI#9\":C!$#\nd\n4DI9'\nd\n.9' %&4C;:YB`¥!MJT:C.9')4D0?!(6#&0R\"kP$+S')\n\nq\nl\n}\n>@#e#M(919M:<+D6D:C')0EGM:<.')4C'i#9!'g/.&#9P$'i!J&.9')M:T')#9'\"4CP6\n\\\nl\nqL$]f#9\"'i165(9'\"%9#9+:C!$#\n#:<'\"4C#&Bm'\"#9')4DP6O+NR;:/M:C'JI#9\":C!$#O:<.'`i!$4Db(9!$#9'+NBD!?e;:/M:C'JI#9\":C!$#\n\\\n(]^y!$4Db(9!$#'5+NeD:/[:<' JI9#9:<!#(9I4C#PeC!M:<.9'\"4C0?B894D!g\"')C\"\n¢\nMBC'Mh¦I94C+#9P#-D!:<.')4C0?B3894C!)'\"C)G&.'M:Ya'g/.&#9P')(:C!b')'\"8:C.9' D6D:C')0§D!:<.')4C0?B\n\n'\n\n:\n\n#\n\n'\n\nB\n!\n!\n.\n\nI\n\n'\n(\n:\n!\n!\nS\n\n(\n'\n.\n'\n\n:\n:\n!\n:\n.\n\n.\n\n'\nJ\n!\n\nL\n\n'\n\n!\n#\n(\n\n\\\n\nI\n'\n#\n:\n>\nq\n\n0RB+B0R89/]jKB\"I9B[:<':<.'5.'M:k:C4<#9;J')4D4C')(w#9(-#:C')4C#9Bm')#9'\"4CP6!J\n:C.9'D6D:C')0E\n\\\n]#-)B+!$C'\"(;6g;:<'\"0V`N+:<.E/.&0213'\"4k13!$I#9(&4;6-k:<.9';6g;:<'\"0\n1!$I9#(&4D6\nfg#9\"'2:<.+)B+!$C'\"(D6D:C')0EG.9')M:#9!`\n\"4C!$D:<.9'213!$I#9(&4D')!J:<.9'2D6D:C')0E\nd\n.9'\n0?!I9#:N!J\n'\"#9')4DP6-CI8989B+')(-16O:<.9'.9')M:<+#9P)!$+B=+YP+S$'\"#-1l6\n\nn$o\n\nq\n~\nQ\nq\n~\n\nohq\n\nx\n\n\\\no\n*o]qs !\nL\nv#\"\n\nL\nX\n\nL$nW\n$%x\n'&\n\nW\n\n(\n&*)\n\nq\nZ\n\nZ+#,\n&\n-\n\nCDI90R#9P\nB+B:C.9'')#')4CPM6P$'\":C:<4C#9DJ'\"4C4D')(:<!*:C.9'D6D:C')0\nMO.9'M:)GIC#P\n¢\n4DD:B`\n!MJ\n:<.9'\"4C0R!g(6#&M0?+))G\n\nq\nl\n}\n^_+:<.O#!`i!$4DbF(9!$#' 1l6F:<.9' ;6g;:<'\"0\n\\\n89+D:C!$#-K\"B0R83'\"(]Gl:<.' /.&#9P$'+K#:<'\"4C#&MB=')#')4CPM6O\n')#:<+4C')B6O(9I9' :C!:C.9''g/.&#P$'Q!MJ\n.9')M:\n.\n\nq\n.\n\nq\nZ\n\nZ/,\n&\n\n\\\n1]O>@#w(91&M:C;6D:<'\"0r`N+:<.-1!$I9#9(94D6OD0RB4:C!e:<.9'51!\nS$'5894C!$1B')0\n$\n>£J:<.9'7D6;:<')0\n+M(919M:<+A#9(_:<.9'\"4C'y+-#9!`i!$4Db\n(!$#9'G:C.9'7#:<'\"4C#&B '\"#9')4DP6\n4C'\"0F+#9\n)!$#9;:/#:)\n\\\n\n]O>@#A(91&M:CD6D:C')0\n`N.9/.+#9)B+I9(9')Y:<.9'24C')D;:<+S')!B\n\\\n:C.9'2`aBB+!J:C.9'\"!$#:/+#9')44C'\n:<.9'\"4C0?BB6F\"!$#9(9I9:<+#9Pl]\nd\n.9YC0RB4i:C!?:C.9'2)C'5`N.9')#AR.9'M:C#9PR)!B Yb'\"8: RD6D:C')0§`N+:<.w(91&M:CD6D:C')0\n13!$I#9(&4D')\">@#E:C.9aD'G9:<.')4C' +\n21l 43T5\n&6-77187\n{\n7\"9\nz\n-:<; =6[7\n#(\n.9')#9\"'\n\n>\nqL@?!\n`i'\"S$'\"4)G$:C.9')4D'K `a!4Cb5(9!$#9'i!$#Q:C.9'KD6;:<')0s16Q:C.9'KM8989B+M:C!$#!J983!:C')#:<B\n(9BA3')4D')#9\"')4D!$CK:C.9'.9')M:<+#9Pe)!$+B`N./.-B')(9i:C!e89I90R89#P!J\nZg\nZC!$I9B+')K!MJT'\"#9')4DP6$\nd\n.9'\n/.&#9P$'5#-+#l:C')4D#&B'\"#9')4DP6O`a!I9B(-1'\n.\n\nq\n~\n\nD\nq\nZ\n\nZ/,\n&\n\nE\n\nd\n.' 19I9Bb?0?!(9I9B+I9)GeG9!JT#O+C!:C4C!$89+B+#9'M4a')BD:CC!$B+(+K(9'\"%9#9')(E16:<.9' (BM:<+!$#G\n.\n\nF\n\nG\n4D')D83!$#C':<!.6g(4C!$;:/M:C894C'\"CDI94C'HGk\nI\n\n/\nq\n\nv\n/\n/\nq\nKJ\nL\nd\n689)BHSMBI') !JMJ!$4#7!#9\"4D6D:<Bh4D'?M13!$Ig:\nL$LENGT\n\\\nOG\nq\nF P89C)B\nGTFM:C0\nP\nL\nv\nMQ\nG\n]\nZ\n\n'\n:\n\nB\n\n:\nG\n\\\n\nq\n\n]\nG\n!\nJ\n\n#\n\n!\n#\n\n:\n\nB\n\n'\n\n!\nI\n:\n\nL\n\\\nI\n#\n\n:\nB\n'\n\n]\n\nd\n.'83'\"4C0R+:C:C+S+:@6Y!JlSM\"I9I90EG\nhG\nE\nL\nv\nYx\nWOX\nF\n,\n\\\nd\nmK:C')CB]\nd\n.9'h0?P$#9':<+\nCIC)'\"8:<+19B++:@6G\n\\\n\nq\n\n]G&!MJH:@689)Bm8&4C0?P$#9':<!$#9+)4;6D:/MBmN1!$I:5\nL\n\\\nI#9+:CB')D/]\njKMB)IBM:C'BBY:<.9'A4CM:<+!$O!Jp*;:<!$4D')(\n')BMD:<+')#9'\"4CP6GD:C!$4C'\"(8!$B4CM:C!$#\n')#9'\"4CP6G #9(\nD:C!$4C'\"(\n0?P$#'\":<+K')#')4CPM6#R:@689+B!$#9+k)4;6g;:/BM:NYM:C0GZZLS$!$B:<[0Gl#(?+#:C.9'N'4;:<.\n0FP#9'\":C\n%9')B(=\n!\"$#&%('()*%+,%.-&'0/1\n23\"(456/\"(4!7148!49:4;%+<\"=7>%?@417BA\n814DC':%$@%('()E)FB%G4\nEIH\nU"
    },
    {
      "category": "Resource",
      "title": "recitation3.PDF",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-00-thermodynamics-of-materials-fall-2002/0be59fdb7e9077c6ceedefa729123e41_recitation3.PDF",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "rec4_solutions.PDF",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-00-thermodynamics-of-materials-fall-2002/5fafdec4b9dee16d896d28202de0b611_rec4_solutions.PDF",
      "content": "\"!$#&%$'()+*,,% -.)0/213% *\"!)0-4.)0.!513% /6*7!$8*:9 % ;+<#=*7!>?!@*A;0%\nBDC63/6/,<6FE/6/,<#=)0\n)+*\"6% -G*,%IHJ!$K)04L!;M!$/3NO13!;01-<;P!@*\"Q*\"R!#=% <*S%'TR3!$*2,3U8<)+,-4?*\"%I,)+/,V)+*,/S*,3#=CW-\"!$*,<,\n'6% #YXZ ZA*\"%[\nZ Z Z\\V\n]\n% ^)+*,,% -`_bacedgfih j$k(lm fnj hZ$opLZqrbs^tvuw)0[13!;xu \"!$#Iy#%;z6\\Q\nuR)0*|{M</6S*,R|,-;P!$*,)0% [_ba(}~_^(cz\n]\n% 213% /6*7!$8*V9% ;0<#=C6%g1-3/6/A*\"R-,)0/:%B^% 6>K4%[!4*\"R,/*V;P!LB)0#=C;0)+3/2=c2\n\n)01-)+*,,% -[)0/*7!$>3`*\"%VH2!$`)+4L!$;!/\nJ\nc\n~3\n\n_^t\n\n%V -*_^@NB2</,*\"R|63;P!@*\")0%[_ba}_^(cA\nV\nc\n\nuw_ba(}~|z6 t\nuB(R36Sc k A1L!$;xu#=% ;Pz6\\Sz\n\n<H/6*,)+*,<)0QH!17>¡N\nV\nc\nm¢w£¤£¤£\nr\n£¤£\nuwdfnh jk}¥ fk (l¦ZgfnZ Zgj h(stz6 t\n§\n*,3 ,!$*\")+\nV\nc\nfnh$ 8ju\nZ ZZ}X Z Zz(c)laZfZ Zj h« j(su\nZ ZZ¬}X Z Z¬7zcmX $ (r)- 8°\n§\nA±6% <;+3/-NX $ Q13!;pc2hNnd jQ3% <;0-/3\nj\n]\n)04K*,R17R! )0.*,R)0*\"-,!$;^33,$ .%'!μC% <4~%'¶\n¬\nu·!$/,/,<#)+4L!;!/\"z:RL!@*\"34'6% #\nj$Z *\"%XZ 1!$*13% /*7!*|C63/6/,<6Q%'T\n!$*,#I !;+13<;0!$*\"SRL!@*1L!C!13)o*¤ 5!@*13%/6*\"!*9 % ;+<#=:!4\n)+*\"36!;-36 [%'»*\"R|/ g/*\"-#Iuw/6CW-13)o1|RL!$*1⁄413!C!1-)+*¤ %'b|jVcZnjX1L!$;x$[\\Sz\n|C% <4[%'O¶\n¬\n3U8<!;+/1⁄4 hXdV#/T%'O¶\n¬\n\n1⁄2\n/,)+Q*\"R\n]\n)+,/6*;P!LB1%'»*\"R3,#=%4 !#=)013/-N\n\nc\n¥l¦3⁄4\n\nc\n5At\n!$4',% #\n*,R|4-)+*,)0% %'O_baJu·_bac\n\nz\n_ba\nAt\nc\n\n]\n6% #2*,R,/*;0!LB|N*\"R|17R!$ |)0[)0*,3,!;(c)3-, )0/T )o9 3`H\nJ\nc\n_baAt¥}\nQt\n(3#=3#:HW-O*\"R!@*M*\"RT/6CW-13)+11⁄4RL!$*13!C!1-)+*¤ A)+/b )o9 3V)+C3M ,!#<)o*\"/-\n\n)+13(¶\n¬\n)0/!4)P!$*,% #)+1\n#=% ;+313<;0N%:#=% ;0|%'M¶\n¬\nB^-)0 R/XjV #/-(C;0< )0V*\"R3/,213% 93,/6)0% /)0[*\"R:!HW%\n9A3U8<!$*,)0%\nB% <;+4[;0L!$4[*,%ec d dfnhA1L!;+% ,)+3/3\nXg\n]\n)04*,R|17R! |)+*\"R|)0*,3,!;33,$ '% T!Q13 g/*7!;+;0)+/,%;0)04B()o*\"R[4)+3;0-1-*,,)0113% /*7!*TB()+*\"R\n*,R!$CC;0)+1L!$*,)0% =%'pg*,36!;-;031*\"6)01(3;+4ME/6/,<#=*\"R!$*^*,R/,%;0)04R!/;+)03!,3/6CW%/,$E/,/6<#\n*,R!$*T*,R|;P!H% \"!@*\"% ',!#1-% )013)043/B()+*,R*\"R|13 /6*7!$;\n!gNH`!4`1S!g3/-\n\n;+L!/6S6-'-(*,%!#=C;+\n\n6% H;+3#=/K-3>\nj"
    }
  ]
}